[
    {
        "source_sentence": "大寶積經卷第一百八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1, Volume 108",
        "source": "T11n0310_108:0603a27_0"
    },
    {
        "source_sentence": "東晉天竺居士竺難提譯",
        "translation": "Translated by Zhu Nanandi, a layman of Tianzhus from the Eastern Jin Dynasty",
        "source": "T11n0310_108:0603a29_0"
    },
    {
        "source_sentence": "大乘方便會第三十八之三",
        "translation": "Twenty-eighth and Thirty-eighth Part of the Mahāyāna Abhidharma Assembly",
        "source": "T11n0310_108:0603b01_0"
    },
    {
        "source_sentence": "「以何緣故，菩薩食已得氣力充足至菩提樹，不以羸瘦至菩提樹？",
        "translation": "What is the reason why a bodhisattva who eats and has enough energy to reach the tree of enlightenment doesn't reach the tree of enlightenment because he's weak?",
        "source": "T11n0310_108:0603b02_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0603b03_1"
    },
    {
        "source_sentence": "菩薩能不飲食身體羸異成阿耨多羅三藐三菩提，況食麻米耶。",
        "translation": "A bodhisattva can attain unsurpassed, correct, and complete enlightenment without eating or drinking, so why wouldn't he eat sesame?",
        "source": "T11n0310_108:0603b03_2"
    },
    {
        "source_sentence": "爾時菩薩為愍當來眾生故，食此上妙食。",
        "translation": "It was then that the bodhisattva ate this wonderful food for the sake of future sentient beings.",
        "source": "T11n0310_108:0603b05_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0603b06_4"
    },
    {
        "source_sentence": "眾生善根未熟，不噉飲食而欲求道，彼諸眾生飢渴苦故不能得智慧。",
        "translation": "Sentient beings whose good roots are immature don't eat food and want to pursue the path, and those sentient beings can't attain wisdom because they suffer from hunger and thirst.",
        "source": "T11n0310_108:0603b06_5"
    },
    {
        "source_sentence": "若安樂行能得智慧，照明諸法非苦行也。",
        "translation": "If a peaceful practice can attain wisdom, illuminating the teachings is not an ascetic practice.",
        "source": "T11n0310_108:0603b07_6"
    },
    {
        "source_sentence": "是故菩薩示眾生行安樂行而得智慧，亦愍當來眾生故，欲令眾生效我食此妙食，",
        "translation": "Therefore, the bodhisattva shows sentient beings how to practice peacefulness and attain wisdom. He also wishes to cause future sentient beings to develop enlightenment so that they can eat this wondrous food.",
        "source": "T11n0310_108:0603b08_7"
    },
    {
        "source_sentence": "是故食修舍佉尼食已，成三十七助菩提法，得阿耨多羅三藐三菩提，施食女人亦成就助菩提法。",
        "translation": "That's why they eat and cultivate the thirty-seven factors that aid in enlightenment, attain unsurpassed, correct, and complete enlightenment, and give food to women who also accomplish the factors that aid in enlightenment",
        "source": "T11n0310_108:0603b10_8"
    },
    {
        "source_sentence": "復次菩薩在一禪中生歡喜心，於百千劫不食能住。",
        "translation": "Furthermore, the bodhisattva's joyful mind arises in the first dhyāna, and for a hundred thousand eons he can abide without food.",
        "source": "T11n0310_108:0603b12_9"
    },
    {
        "source_sentence": "是名菩薩摩訶薩行於方便。",
        "translation": "This is called the bodhisattva-mahāsattva's practice of skillful means.",
        "source": "T11n0310_108:0603b14_10"
    },
    {
        "source_sentence": "「以何緣故，菩薩從吉安天子求草敷座？",
        "translation": "For what reason did the bodhisattva request a seat made of grass from the celestial being Jian?",
        "source": "T11n0310_108:0603b15_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0603b15_1"
    },
    {
        "source_sentence": "過去諸佛敷解脫坐不以綩綖妙物，亦欲成就吉安天子助菩提法。",
        "translation": "In the past, the buddhas laid out their seats of liberation and didn't sit with crude and marvelous things, but they also wanted to accomplish the enlightenment teachings of the celestial child Jian who assisted them.",
        "source": "T11n0310_108:0603b16_2"
    },
    {
        "source_sentence": "爾時吉安與菩薩草已，發阿耨多羅三藐三菩提心。",
        "translation": "After he gave the bodhisattva's grass to Jian, he aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_108:0603b17_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0603b18_4"
    },
    {
        "source_sentence": "今我當與受記：『彼吉安天子於未來世當得成佛，號曰無垢如來、應、正遍知。』",
        "translation": "Now, I will give you a prediction: 'That heavenly prince of good fortune will become a buddha in the future, and he'll be called the stainless Tathāgata, Arhat, Perfectly Enlightened One.'",
        "source": "T11n0310_108:0603b19_0"
    },
    {
        "source_sentence": "是名菩薩摩訶薩行於方便。",
        "translation": "This is called the bodhisattva-mahāsattva's practice of skillful means.",
        "source": "T11n0310_108:0603b20_1"
    },
    {
        "source_sentence": "「以何緣故，菩薩坐菩提樹下，使惡魔波旬至菩提樹下，不欲令菩薩即成阿耨多羅三藐三菩提？",
        "translation": "For what reason did the bodhisattva sit under an enlightenment tree and cause Māra Pāpīyān to go under an enlightenment tree, not wanting to cause the bodhisattva to attain supreme perfect enlightenment?",
        "source": "T11n0310_108:0603b22_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0603b24_1"
    },
    {
        "source_sentence": "魔本不能至菩提樹下。",
        "translation": "Māra originally couldn't go to the foot of the bodhi tree.",
        "source": "T11n0310_108:0603b24_2"
    },
    {
        "source_sentence": "若我不召而能來此者，無有是處。",
        "translation": "If I were to come here without summoning you, there would be no place for me.",
        "source": "T11n0310_108:0603b24_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0603b25_4"
    },
    {
        "source_sentence": "爾時菩薩坐菩提樹下如是思惟：『於四天下誰為最尊第一？",
        "translation": "It was then that the bodhisattva sat under the bodhi tree and thought, 'Who is the most honored among the four worlds?'",
        "source": "T11n0310_108:0603b25_5"
    },
    {
        "source_sentence": "此四天下今為屬誰？』",
        "translation": "To whom do these four worlds now belong?'",
        "source": "T11n0310_108:0603b27_6"
    },
    {
        "source_sentence": "菩薩即知惡魔波旬欲界最尊。",
        "translation": "The bodhisattva then knows that bad Māra Pāpīyān is the most honored in the desire realm.",
        "source": "T11n0310_108:0603b27_7"
    },
    {
        "source_sentence": "『今我與魔共鬪，魔若不如，一切欲界所有眾生悉皆不如。",
        "translation": "'Now, I'm fighting with Māra, and if Māra doesn't do so, all the sentient beings in the desire realm won't.",
        "source": "T11n0310_108:0603b28_8"
    },
    {
        "source_sentence": "爾時當有諸天大眾和合而來到菩提樹下，到已必生信心。",
        "translation": "At that point, there will be a large congregation of gods and goddesses coming together under the bodhi tree, and when they arrive, they'll surely give rise to faith.",
        "source": "T11n0310_108:0603b29_9"
    },
    {
        "source_sentence": "魔眾、天眾、諸龍、鬼神、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽，",
        "translation": "Māra, gods, dragons, ghosts, spirits, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas.",
        "source": "T11n0310_108:0603c02_0"
    },
    {
        "source_sentence": "如是一切眾來遶菩提樹。",
        "translation": "Thus, all these people come to the bodhi tree and circumambulate it.",
        "source": "T11n0310_108:0603c03_1"
    },
    {
        "source_sentence": "彼諸眾等見菩薩師子遊戲，見已或發阿耨多羅三藐三菩提心，或發菩薩心，",
        "translation": "Those in the assembly saw the bodhisattva’s lion playing and, seeing him, some of them resolved to attain unexcelled, perfect enlightenment. Some resolved to become bodhisattvas.",
        "source": "T11n0310_108:0603c03_2"
    },
    {
        "source_sentence": "或生信心，彼人乃至見菩薩因緣故盡得解脫。』",
        "translation": "Perhaps they give rise to faith, and that person or even those who see the bodhisattva's causes and conditions will attain liberation.'",
        "source": "T11n0310_108:0603c05_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0603c06_4"
    },
    {
        "source_sentence": "菩薩如是思惟已，放眉間白毫相光，能令波旬宮殿黑闇。",
        "translation": "After thus reflecting, the bodhisattva radiates a white-haired ray of light between his eyebrows that causes the palace of Pāpīyān to become black and dark.",
        "source": "T11n0310_108:0603c07_0"
    },
    {
        "source_sentence": "爾時三千大千世界以光明照故普令大明，此光明中出如是聲：『彼釋種子出家學道，",
        "translation": "It was then that a ray of light illumined the great manifold cosmos and caused it to shine brightly. From this ray of light a voice emerged, saying:",
        "source": "T11n0310_108:0603c08_1"
    },
    {
        "source_sentence": "今當成阿耨多羅三藐三菩提。",
        "translation": "Now, he'll attain unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_108:0603c10_2"
    },
    {
        "source_sentence": "過魔境界勝出魔眾，減損當來一切魔眾。",
        "translation": "Beyond the realm of Māra, it's superior to the multitude of Māras and inferior to all the multitudes of Māras in the future.",
        "source": "T11n0310_108:0603c10_3"
    },
    {
        "source_sentence": "今彼菩薩與魔共戰。』",
        "translation": "Now, that bodhisattva and Māra are fighting together.'",
        "source": "T11n0310_108:0603c11_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0603c12_5"
    },
    {
        "source_sentence": "爾時波旬聞是聲已，心大憂愁如箭入心。",
        "translation": "After hearing this sound, Pāpīyān was greatly distressed like an arrow entering his heart.",
        "source": "T11n0310_108:0603c12_6"
    },
    {
        "source_sentence": "時魔波旬嚴四種兵滿三十六由旬，一切皆來圍菩提樹，欲為菩薩作大留難。",
        "translation": "Māra Pāpīyān then gathered four kinds of soldiers, all thirty-six yojanas in number, to surround the bodhi tree and want to create a great obstacle for the bodhisattva.",
        "source": "T11n0310_108:0603c13_7"
    },
    {
        "source_sentence": "爾時菩薩住大慈悲及大智慧，以智慧執金色之手而以拍地，拍已一切魔眾尋時散壞。",
        "translation": "At the time, the bodhisattva was abiding in great compassion and great wisdom, holding his golden hand with wisdom and clapping it to the ground, and after he did so, all the Māras scattered and disintegrated at the right time.",
        "source": "T11n0310_108:0603c15_8"
    },
    {
        "source_sentence": "魔眾壞已，八萬四千億天、龍、鬼神、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、拘槃荼等如是大眾，",
        "translation": "“After the destruction of this assembly, eighty-four thousand koṭis of devas, nāgas, yakṣa spirits, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, and kumbhāṇḍ",
        "source": "T11n0310_108:0603c17_9"
    },
    {
        "source_sentence": "見菩薩威德身體微妙容顏端嚴威力勇健，發阿耨多羅三藐三菩提心。",
        "translation": "Seeing the bodhisattva's authoritative body, subtle appearance, and dignified appearance, he arouses the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_108:0603c19_10"
    },
    {
        "source_sentence": "是名菩薩摩訶薩行於方便。",
        "translation": "This is called the bodhisattva-mahāsattva's practice of skillful means.",
        "source": "T11n0310_108:0603c21_11"
    },
    {
        "source_sentence": "「以何緣故，如來於七日七夜不捨結加趺坐，仰觀菩提樹目不暫眴？",
        "translation": "For what reason did the Tathāgata sit cross-legged without leaving his fetters for seven days and nights, looking up at the eye of the bodhi tree without blinking?",
        "source": "T11n0310_108:0603c22_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0603c23_1"
    },
    {
        "source_sentence": "爾時有色界天行寂滅行，彼諸天等見如來結加趺坐心生歡喜，生歡喜已如是思惟：『今我當求沙門瞿曇心何所依？』",
        "translation": "At the time, the gods of the form realm were engaged in the practice of extinction, and when those gods saw the Tathāgata sitting cross-legged, their minds became joyous, and after they became joyous, they thought, '",
        "source": "T11n0310_108:0603c23_2"
    },
    {
        "source_sentence": "彼諸天人於七日七夜作是求已，不得如來一念依處。",
        "translation": "For seven days and nights, those gods and humans did so for seven days and nights, but they couldn't get a single thought of the Tathāgata to rely on him.",
        "source": "T11n0310_108:0603c26_3"
    },
    {
        "source_sentence": "彼時諸天倍增喜悅，有三萬二千天子發阿耨多羅三藐三菩提心，作如是願：『我等於未來世當得如是寂滅之行，",
        "translation": "The gods then became even more joyful, and thirty-two thousand celestial beings aroused the determination for unexcelled, complete perfect enlightenment. They made this vow:",
        "source": "T11n0310_108:0603c27_4"
    },
    {
        "source_sentence": "仰觀菩提樹。』",
        "translation": "I look up to the bodhi tree of contemplation.'",
        "source": "T11n0310_108:0604a01_5"
    },
    {
        "source_sentence": "是故如來得成道已，於七日七夜結加趺坐，仰觀菩提樹目不暫眴。",
        "translation": "That's why the Tathāgata sat cross-legged for seven days and nights after he had attained enlightenment, looking up at the eyes of the bodhi tree without blinking for a moment.",
        "source": "T11n0310_108:0604a01_6"
    },
    {
        "source_sentence": "是名如來方便。",
        "translation": "This is called the Tathāgata's method.",
        "source": "T11n0310_108:0604a03_7"
    },
    {
        "source_sentence": "「以何緣故，如來本行菩薩道時修無量阿僧祇行願，諸一切眾生與解脫樂。",
        "translation": "“Why is it that when the Tathāgata was practicing the bodhisattva path, he cultivated measureless and incalculable practices and vows, which gave all sentient beings the bliss of liberation?",
        "source": "T11n0310_108:0604a04_0"
    },
    {
        "source_sentence": "何以方待梵王請然後說法？",
        "translation": "Why do you have to wait for the king of Brahmā to invite me and then preach the Dharma?",
        "source": "T11n0310_108:0604a05_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604a06_2"
    },
    {
        "source_sentence": "如來有如是知，多有天人歸依梵王、尊重梵王。",
        "translation": "The Tathāgata has this kind of knowledge, and many gods and humans take refuge in Brahmā and venerate him.",
        "source": "T11n0310_108:0604a06_3"
    },
    {
        "source_sentence": "彼諸眾生作如是知：『梵天王化生我等，世界最尊，若除梵王更無有能造世界者。』",
        "translation": "Those sentient beings thus know, 'The king of Brahmā produces us, the most honored in the world, and there's no one other than the king of Brahmā who can create a world.'",
        "source": "T11n0310_108:0604a07_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604a09_5"
    },
    {
        "source_sentence": "爾時如來如是知已——『今我當待梵王勸請。』",
        "translation": "It was then that the Tathāgata thus knew - 'Now, I'll wait for the king of Brahmā to encourage me.'",
        "source": "T11n0310_108:0604a09_6"
    },
    {
        "source_sentence": "若彼梵王一傾首者，諸可歸依梵王眾生悉皆歸依。",
        "translation": "If that king of Brahmā tilts his head once, all the sentient beings who can rely on him will all rely on him.",
        "source": "T11n0310_108:0604a10_7"
    },
    {
        "source_sentence": "當相謂言：『梵王勸請如來說法，非為不請。』",
        "translation": "They should say to each other, 'The king of Brahmā encourages the Tathāgata to teach the Dharma, not because he doesn't invite it.'",
        "source": "T11n0310_108:0604a11_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604a12_9"
    },
    {
        "source_sentence": "如來有大威德故，梵王來至我所勸請說法轉於法輪。",
        "translation": "Because the Tathāgata has great majestic virtue, Brahmā came to me and asked him to teach the Dharma and turn the wheel of the Dharma.",
        "source": "T11n0310_108:0604a12_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604a14_11"
    },
    {
        "source_sentence": "若我不以神力令梵王請者，然彼梵王先無有心能來請佛。",
        "translation": "If I didn't cause the king of Brahmā to invite them with my supernormal powers, that king of Brahmā would have no intention to come and invite the Buddha.",
        "source": "T11n0310_108:0604a14_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604a15_13"
    },
    {
        "source_sentence": "由諸眾生依梵王故，欲令眾生離於梵王，待其勸請，以梵王為證故。",
        "translation": "It's because sentient beings rely on the king of Brahmā and want to cause sentient beings to part with the king of Brahmā, waiting for him to encourage them, and using the king of Brahmā as their witness.",
        "source": "T11n0310_108:0604a15_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604a17_15"
    },
    {
        "source_sentence": "爾時梵王勸請如來轉於法輪，彼時六十八百千梵天發阿耨多羅三藐三菩提心，",
        "translation": "It was then that the Brahma king urged the Tathāgata to turn the wheel of the Dharma, and sixty-eight hundred thousand Brahma gods aroused the mind of unexcelled complete perfect enlightenment.",
        "source": "T11n0310_108:0604a17_16"
    },
    {
        "source_sentence": "作如是言：『此真是佛，於眾生中最尊最勝。』",
        "translation": "He said, 'This is really a buddha who's the most venerable among sentient beings.'",
        "source": "T11n0310_108:0604a19_17"
    },
    {
        "source_sentence": "作如是願言：『我來世得成就如是智慧威德。』",
        "translation": "They make this vow, saying, 'In a future life, I'll attain such authoritative wisdom and virtue.'",
        "source": "T11n0310_108:0604a20_18"
    },
    {
        "source_sentence": "是名如來方便。",
        "translation": "This is called the Tathāgata's method.",
        "source": "T11n0310_108:0604a21_19"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604a22_0"
    },
    {
        "source_sentence": "我先於說示現眾生十業因緣，或是菩薩、或是如來，於此十中示現方便，",
        "translation": "“Earlier, when I had explained the ten kinds of causality that show sentient beings the causes and conditions of their deeds, whether they are bodhisattvas or buddhas, I demonstrated these ten methods.",
        "source": "T11n0310_108:0604a22_1"
    },
    {
        "source_sentence": "唯有智者能知是義。",
        "translation": "Only the wise can know this meaning.",
        "source": "T11n0310_108:0604a23_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604a24_3"
    },
    {
        "source_sentence": "不應生念，謂菩薩當有微細之罪。",
        "translation": "You shouldn't give rise to thoughts that the bodhisattva will have subtle sins.",
        "source": "T11n0310_108:0604a24_4"
    },
    {
        "source_sentence": "若菩薩成就如是微細不善之法坐於道場成阿耨多羅三藐三菩提者，無有是處。",
        "translation": "If a bodhisattva accomplishes such subtle, unwholesome dharmas and sits at the site of enlightenment to achieve unsurpassed, correct, and complete enlightenment, there's no place for them.",
        "source": "T11n0310_108:0604a25_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0604a27_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604a27_7"
    },
    {
        "source_sentence": "如來成就一切善法、斷一切不善法，無有生死業報習氣，若有遺餘不斷滅者，",
        "translation": "The Tathāgata accomplishes all good qualities and eliminates all unskillful qualities, has no karmic retribution or karmic impressions of birth-and-death, and if there are any leftovers, they don’t cease.",
        "source": "T11n0310_108:0604a27_8"
    },
    {
        "source_sentence": "無有是處，何況有障礙業報。",
        "translation": "There's no such place, so why wouldn't there be an obstructive karmic retribution?",
        "source": "T11n0310_108:0604a29_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604b01_0"
    },
    {
        "source_sentence": "若有眾生謂無業報不信業報，為是眾生示現業報因緣。",
        "translation": "If there are sentient beings who say there's no karmic retribution and don't believe in the karmic retribution, they show the causes and conditions for the karmic retribution to sentient beings.",
        "source": "T11n0310_108:0604b01_1"
    },
    {
        "source_sentence": "如來實無業報，我是法王尚受業報，況餘眾生而不受耶？",
        "translation": "The Tathāgata really has no karmic retribution, so I am the king of the Dharma who is still subject to karmic retribution, so why wouldn't other sentient beings receive it?",
        "source": "T11n0310_108:0604b02_2"
    },
    {
        "source_sentence": "為彼眾生作如是示現，是故如來自現業緣。",
        "translation": "For the sake of those sentient beings, he thus manifests it, which is why the Tathāgata manifests karmic conditions.",
        "source": "T11n0310_108:0604b03_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604b04_4"
    },
    {
        "source_sentence": "如來無有一切業障。",
        "translation": "The Tathāgata doesn't have all the karmic hindrances.",
        "source": "T11n0310_108:0604b04_5"
    },
    {
        "source_sentence": "譬如書師善學書論教諸幼童，隨諸幼童讚諸書章，非是書師於諸書章有障礙也。",
        "translation": "It's like a book maker who well learns books and treatises and teaches young children to follow the young children in praising books and chapters, not a book maker who has an obstruction with respect to books and chapters.",
        "source": "T11n0310_108:0604b05_6"
    },
    {
        "source_sentence": "書師作如是念：『彼諸幼童當隨我學。』",
        "translation": "The calligrapher had this thought, 'These young children will follow me to study.'",
        "source": "T11n0310_108:0604b07_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604b08_8"
    },
    {
        "source_sentence": "彼書師非為不達故作如是唱。",
        "translation": "That book master doesn't make such a call because he doesn't understand it.",
        "source": "T11n0310_108:0604b08_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604b09_10"
    },
    {
        "source_sentence": "如來亦復如是，於一切法善學已，如是說如是示，為餘眾生令行業清淨故。",
        "translation": "The Tathagata is also like this: having studied all factors well, he explains and indicates them in this way for the sake of other living beings so that their actions will be pure.",
        "source": "T11n0310_108:0604b09_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604b10_12"
    },
    {
        "source_sentence": "譬如大藥師，善能療治一切諸病。",
        "translation": "It's like a great healing doctor who's well able to treat all illnesses.",
        "source": "T11n0310_108:0604b11_13"
    },
    {
        "source_sentence": "自無有病，見諸病人而於其前自服苦藥。",
        "translation": "He himself has no illness, and he sees the sick and takes painful medicine in front of them.",
        "source": "T11n0310_108:0604b11_14"
    },
    {
        "source_sentence": "諸病人見是藥師服苦藥已，然後效服，各得除病。",
        "translation": "The sick people saw that the physician had prescribed this painful medicine, and after he had taken it, they each succeeded in getting rid of their illness.",
        "source": "T11n0310_108:0604b12_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604b13_16"
    },
    {
        "source_sentence": "如來亦復如是，自除一切煩惱病已，於一切法無有障礙，能示現一切法，",
        "translation": "The Buddha is also like this: Having himself extinguished all the sicknesses of afflictions, he has no obstruction whatsoever in regard to any doctrine and can manifest all doctrines without obstruction.",
        "source": "T11n0310_108:0604b14_17"
    },
    {
        "source_sentence": "以是不善業故得如是報。",
        "translation": "It's because of unwholesome actions that they attain such rewards.",
        "source": "T11n0310_108:0604b15_18"
    },
    {
        "source_sentence": "現如是緣，欲令眾生除一切身口意業障行於淨行。",
        "translation": "It's for this reason that they want to cause sentient beings to remove all the physical, verbal, and mental karmic hindrances and perform pure actions.",
        "source": "T11n0310_108:0604b16_19"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604b17_20"
    },
    {
        "source_sentence": "譬如長者子、若居士子，父母愛念與其乳母。",
        "translation": "It's like when an elderly man's child or a householder's child is loved by their parents and given to their nursing mother.",
        "source": "T11n0310_108:0604b17_21"
    },
    {
        "source_sentence": "時此乳母無有病痛，為嬰兒故自服苦藥，欲令乳得清淨。",
        "translation": "The nurse then had no illness or pain, so she took painful medicine for the sake of the baby and wanted to make the milk pure.",
        "source": "T11n0310_108:0604b18_22"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604b20_0"
    },
    {
        "source_sentence": "如來亦復如是，是一切世界之父，為教化不知業報眾生故，如來無病而為眾生示現作病，",
        "translation": "The Tathagata is also like this. He is the father of all worlds, because in order to edify sentient beings who do not know the consequences of their actions, the Tathagata manifests illness for them without illness.",
        "source": "T11n0310_108:0604b20_1"
    },
    {
        "source_sentence": "以是業故得如是報，以此業故得如是報。",
        "translation": "It's because of this action that such a reward is obtained, and it's because of this action that such a reward is obtained.",
        "source": "T11n0310_108:0604b22_2"
    },
    {
        "source_sentence": "眾生聞已心生驚畏，除諸惡業不作惡緣。」",
        "translation": "After hearing it, sentient beings become frightened and remove bad actions that don't create bad conditions.",
        "source": "T11n0310_108:0604b23_3"
    },
    {
        "source_sentence": "佛復告智勝菩薩：「善男子！",
        "translation": "The Buddha again addressed the bodhisattva Zhixiang, Good sons!",
        "source": "T11n0310_108:0604b24_4"
    },
    {
        "source_sentence": "乃往過去世遇然燈佛，時有五百賈人為求珍寶入於大海。",
        "translation": "In a past life he had encountered the buddha Rājagṛha. At that time five hundred merchants entered the great sea in search of rare treasures.",
        "source": "T11n0310_108:0604b24_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604b26_6"
    },
    {
        "source_sentence": "時賈人中有一惡人——多懷奸偽，常行惡業初無悔心，善知兵法恒為寇賊，",
        "translation": "At the time, there was a bad man among the merchants who often harbored treachery and hypocrisy. They always committed evil deeds but at first they had no regrets. They were well versed in the law of warfare and always",
        "source": "T11n0310_108:0604b26_7"
    },
    {
        "source_sentence": "奪他財物以為產業——狀如賈人，共諸賈人同載一船。",
        "translation": "They steal another's property for business - it's shaped like a merchant, and they share the same boat with the merchants.",
        "source": "T11n0310_108:0604b27_8"
    },
    {
        "source_sentence": "時彼惡人如是思惟：『此諸賈人大得珍寶，我今當殺此諸賈人，取其珍寶還閻浮提。』",
        "translation": "That bad man then thus thought, 'These merchants have obtained treasures, so now I will kill these merchants and take their treasures back to Jambudvīpa.'",
        "source": "T11n0310_108:0604b29_9"
    },
    {
        "source_sentence": "如是思惟已欲殺諸人。",
        "translation": "After thus contemplating it, he wants to kill people.",
        "source": "T11n0310_108:0604c01_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604c02_11"
    },
    {
        "source_sentence": "爾時有人名曰大悲，於彼眾中作大導師。",
        "translation": "At the time, there was a man named Mahāprajñāpāramitā who became a great guide among those people.",
        "source": "T11n0310_108:0604c02_12"
    },
    {
        "source_sentence": "時彼導師於夜夢中，見海鬼神來作是言：『汝此眾中有一惡人，如是相貌，",
        "translation": "In the middle of the night, he dreamed that a sea spirit came and said to him, “There is a bad man among you here.",
        "source": "T11n0310_108:0604c03_13"
    },
    {
        "source_sentence": "恒為寇賊劫他財物。",
        "translation": "They'll always be attacked by thieves and robbed of their possessions.",
        "source": "T11n0310_108:0604c05_14"
    },
    {
        "source_sentence": "彼人今生如是惡心：「我當殺此五百人已，取其財物還閻浮提。」",
        "translation": "Now, that person has this bad thought, After killing these five hundred people, I'll take their possessions and return them to Jambudvīpa.",
        "source": "T11n0310_108:0604c05_15"
    },
    {
        "source_sentence": "若此惡人得遂本心殺五百人者，作大惡逆業。",
        "translation": "If this bad person were to kill 500 people with their original intention, they'd do a great bad and heinous act.",
        "source": "T11n0310_108:0604c07_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0604c08_17"
    },
    {
        "source_sentence": "此五百人皆是向阿耨多羅三藐三菩提不退轉菩薩。",
        "translation": "These five hundred bodhisattvas all turned toward unsurpassed, correct, and complete enlightenment without regressing.",
        "source": "T11n0310_108:0604c08_18"
    },
    {
        "source_sentence": "若此惡人殺諸菩薩，以此業緣障礙罪故，一一菩薩從初發心乃至成阿耨多羅三藐三菩提，",
        "translation": "If this bad person kills the bodhisattvas because of these karmic conditions that obstruct sin, then each bodhisattva will attain unexcelled complete perfect enlightenment from the first arousal of his mind until he attains it.",
        "source": "T11n0310_108:0604c09_19"
    },
    {
        "source_sentence": "爾時惡人於其中間常在地獄。",
        "translation": "At that point, bad people are always in hell among them.",
        "source": "T11n0310_108:0604c11_20"
    },
    {
        "source_sentence": "汝為導師可作方便，令彼惡人不墮地獄，彼五百菩薩亦復可得全其身命。』",
        "translation": "You're the guide, so you can make an effort to prevent that bad person from falling into hell, and those five hundred bodhisattvas will also be able to complete their lives.'",
        "source": "T11n0310_108:0604c12_21"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604c14_22"
    },
    {
        "source_sentence": "爾時大悲導師如是思惟：『作何方便令彼惡人不墮地獄，五百菩薩全其身命？』",
        "translation": "It was then that the great compassionate guide teacher thus thought, 'What method did he use to prevent those bad people from falling into hell and the five hundred bodhisattvas from giving up their lives?'",
        "source": "T11n0310_108:0604c14_23"
    },
    {
        "source_sentence": "作如是思惟已，乃不向一人說是事也。",
        "translation": "After he had this thought, he didn't tell one person about it.",
        "source": "T11n0310_108:0604c16_24"
    },
    {
        "source_sentence": "爾時待風，餘有七日當還閻浮提。",
        "translation": "It was then that he waited for the wind and returned to Jambudvīpa in seven days.",
        "source": "T11n0310_108:0604c16_25"
    },
    {
        "source_sentence": "七日過已如是思惟：『更無方便，唯有除此一惡人者，爾乃可令此五百人得全身命。』",
        "translation": "After seven days passed, he thus thought, 'There's no way to remove this one bad person, and then you can cause these five hundred people to attain their whole lives.'",
        "source": "T11n0310_108:0604c17_26"
    },
    {
        "source_sentence": "復作是念：『若我向餘人說，此五百人當生惡心。",
        "translation": "Again, they think, 'If I tell others, these five hundred people will give rise to bad thoughts.",
        "source": "T11n0310_108:0604c19_27"
    },
    {
        "source_sentence": "生惡心已殺此惡人，彼諸人等當墮惡道。』",
        "translation": "After you give rise to bad thoughts and kill this bad person, those people will fall into a bad path.'",
        "source": "T11n0310_108:0604c20_28"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604c21_29"
    },
    {
        "source_sentence": "大悲導師如是思惟：『我今當自殺之。",
        "translation": "The great compassionate teacher thus thought, 'Now, I will kill him.'",
        "source": "T11n0310_108:0604c21_30"
    },
    {
        "source_sentence": "我以殺此人故，雖百千劫墮惡道中受地獄苦，我能忍之。",
        "translation": "Because of killing this man, even though I've fallen into a bad path for a hundred thousand eons and suffered the pain of hell, I can tolerate it.",
        "source": "T11n0310_108:0604c22_31"
    },
    {
        "source_sentence": "不令惡人害五百菩薩，作此惡緣受地獄苦。』",
        "translation": "They won't allow bad people to harm five hundred bodhisattvas and suffer the pain of hell for these bad reasons.'",
        "source": "T11n0310_108:0604c23_32"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604c24_33"
    },
    {
        "source_sentence": "爾時大悲導師生哀愍心作是方便，吾護五百人故害此惡人。",
        "translation": "At the time, the great compassionate guide teacher had compassion for this kind of skillful means, and because I protected 500 people, I harmed this bad person.",
        "source": "T11n0310_108:0604c25_34"
    },
    {
        "source_sentence": "是時導師即以[矛*(替-曰+貝)]牟刺殺惡人，令諸賈人安隱得還至閻浮提。",
        "translation": "The guide then killed the bad man with a [spear*(ti-yu+pui)]mu刺殺惡人,令諸賈人安隱得還至閻浮提。",
        "source": "T11n0310_108:0604c26_35"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0604c27_36"
    },
    {
        "source_sentence": "汝勿有疑。",
        "translation": "Don't have doubts.",
        "source": "T11n0310_108:0604c28_37"
    },
    {
        "source_sentence": "爾時導師，則我身是也。",
        "translation": "At the time, the guide was me.",
        "source": "T11n0310_108:0604c28_38"
    },
    {
        "source_sentence": "五百賈人，此賢劫中五百菩薩是也，當於此劫中成阿耨多羅三藐三菩提。",
        "translation": "The five hundred noble people, the five hundred bodhisattvas of this good eon, will attain unsurpassed, correct, and complete enlightenment in this eon.",
        "source": "T11n0310_108:0604c28_39"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605a01_40"
    },
    {
        "source_sentence": "我於爾時行方便大悲故，即得超越百千劫生死之難。",
        "translation": "Because of my skillful means and great compassion at that point, I'll be able to transcend the difficulty of birth-and-death for a hundred thousand eons.",
        "source": "T11n0310_108:0605a01_41"
    },
    {
        "source_sentence": "時彼惡人命終之後，生善道天上。",
        "translation": "When that bad person's life ends, they'll be born in the heaven of a good path.",
        "source": "T11n0310_108:0605a03_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605a03_1"
    },
    {
        "source_sentence": "汝今當知，勿謂菩薩有如是障礙業報。",
        "translation": "You should now know that it doesn't mean that bodhisattvas have such an obstructive karmic retribution.",
        "source": "T11n0310_108:0605a04_0"
    },
    {
        "source_sentence": "而得超越百千劫生死之難，即時是菩薩方便力也。",
        "translation": "It's the power of the bodhisattva's skillful means to immediately transcend the difficulty of birth and death for a hundred thousand eons.",
        "source": "T11n0310_108:0605a04_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605a07_0"
    },
    {
        "source_sentence": "如來為一切眾生故而作是方便，示現佉違羅刺。",
        "translation": "The Tathāgata does this skillful means for the sake of all sentient beings, revealing crude and contrary thorns.",
        "source": "T11n0310_108:0605a07_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605a08_2"
    },
    {
        "source_sentence": "爾時佉違羅刺刺如來足，善男子！",
        "translation": "It was then that the Tathāgata's feet were pierced by a thorn, Good man!",
        "source": "T11n0310_108:0605a08_3"
    },
    {
        "source_sentence": "佛神力故令刺入足。",
        "translation": "It's because of the Buddha's miraculous power that he causes it to pierce his feet.",
        "source": "T11n0310_108:0605a09_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0605a09_5"
    },
    {
        "source_sentence": "如來金剛之身無能壞者。",
        "translation": "The Tathāgata's adamantine body has no one who can destroy it.",
        "source": "T11n0310_108:0605a09_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605a10_7"
    },
    {
        "source_sentence": "昔舍衛城中有二十人，皆是最後邊身。",
        "translation": "In the old days in Śrāvastī there were twenty people, all of whom had final bodies.",
        "source": "T11n0310_108:0605a10_8"
    },
    {
        "source_sentence": "彼二十人更有怨家二十人，各各思惟：『我當為作親友而至其舍，奪其命根，",
        "translation": "Twenty of these men had twenty enemies living in their houses. Each thought, “I will go to that man’s house as a friend and steal his vital principle.",
        "source": "T11n0310_108:0605a11_9"
    },
    {
        "source_sentence": "不向人說。』",
        "translation": "I won't tell anyone.'",
        "source": "T11n0310_108:0605a13_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605a13_11"
    },
    {
        "source_sentence": "彼時二十最後身者，及二十怨家人，以佛神力故共至佛所。",
        "translation": "At the time, those 20 final bodies and 20 enemies and their families went to the Buddha's place because of the Buddha's miraculous power.",
        "source": "T11n0310_108:0605a13_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605a15_0"
    },
    {
        "source_sentence": "如來爾時為調伏是四十人故，於大眾中告大目揵連言：『今此地中出佉違羅刺欲刺吾右足。』",
        "translation": "It was then that the Tathāgata, for the sake of subduing these forty people, addressed Mahāmaudgalyāyana in the great assembly, saying, 'Now, here in this place, I'm going to stab my right foot with",
        "source": "T11n0310_108:0605a15_1"
    },
    {
        "source_sentence": "未至足之間，此佉違羅刺即從地出長一肘。",
        "translation": "Before he reaches his feet, this coarse and contrary thorn emerges from the ground one elbow long.",
        "source": "T11n0310_108:0605a17_2"
    },
    {
        "source_sentence": "當出之時，目連白佛言：『世尊！",
        "translation": "When he emerged, Maudgalyāyana said to the Buddha, 'Bhagavān!",
        "source": "T11n0310_108:0605a18_3"
    },
    {
        "source_sentence": "我今當取此刺擲著他方世界。』",
        "translation": "Now, I will take this thorn and toss it into another world.'",
        "source": "T11n0310_108:0605a18_4"
    },
    {
        "source_sentence": "佛告目連：『非汝所能。",
        "translation": "The Buddha told Maudgalyāyana, 'It's beyond your ability.",
        "source": "T11n0310_108:0605a19_5"
    },
    {
        "source_sentence": "此佉違羅刺今在此地，汝不能拔。』",
        "translation": "This thorn contradicts Rāṣṭrapāla, and now it's here; you can't pull it out.'",
        "source": "T11n0310_108:0605a20_6"
    },
    {
        "source_sentence": "爾時目連以大神力前拔此刺，于時三千大千世界皆大震動，一切世界隨刺而舉，",
        "translation": "At that moment, Maudgalyāyana pulled out this thorn by means of his great supernatural power. Then all the worlds in the universe called trichiliocosm shook with trembling and all the worlds rose up to wherever it was drawn",
        "source": "T11n0310_108:0605a20_7"
    },
    {
        "source_sentence": "不能動刺乃至一毛。",
        "translation": "They can't move an thorn or even a hair.",
        "source": "T11n0310_108:0605a22_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605a23_9"
    },
    {
        "source_sentence": "爾時如來以神通力上四天王，彼佉違羅刺亦隨佛去。",
        "translation": "At the time, the Tathāgata used his supernormal powers to go up to the four celestial kings, and they defeated Rāṣṭrapāla and departed with him.",
        "source": "T11n0310_108:0605a23_10"
    },
    {
        "source_sentence": "爾時如來復至三十三天、夜摩天、兜術天、化樂天、他化自在天，刺亦隨去；",
        "translation": "The Tathāgata then proceeded to the thirty-three celestial bodies, the Yama gods, the Tuṣita gods, the Nirmāṇarati gods, and the Paranirmitavaśavartin gods.",
        "source": "T11n0310_108:0605a24_11"
    },
    {
        "source_sentence": "乃至梵天亦復如是。",
        "translation": "It's likewise with the Brahma gods.",
        "source": "T11n0310_108:0605a26_12"
    },
    {
        "source_sentence": "爾時如來從梵天還至閻浮提舍衛城中本所坐處，刺亦逐還至此地中竪向如來。",
        "translation": "The Tathāgata then returned from the Brahma heaven to the place where he was sitting in Jambudvīpa's Śrāvastī and flew back to this place, pointing toward the Tathāgata.",
        "source": "T11n0310_108:0605a26_13"
    },
    {
        "source_sentence": "爾時如來即以右手捉佉違羅刺，左手安地右脚踏之，爾時三千大千世界皆大震動。",
        "translation": "At the time, the Tathāgata then grabbed a thorn with his right hand, placed it on the ground with his left hand, and stepped on it with his right foot, and 3,000 great one-thousand worlds all shook.",
        "source": "T11n0310_108:0605a28_14"
    },
    {
        "source_sentence": "時尊者阿難即從坐起，偏袒右肩，為佛作禮，合掌向佛而作是言：『世尊！",
        "translation": "Venerable Ānanda then rose from his seat, bared his right shoulder, paid homage to the Buddha, joined his palms in respect toward him, and said, 'Bhagavān!",
        "source": "T11n0310_108:0605b01_15"
    },
    {
        "source_sentence": "往昔作何等業得如是報？』",
        "translation": "What kind of karma did you do in the past that gave such a reward?'",
        "source": "T11n0310_108:0605b03_16"
    },
    {
        "source_sentence": "佛告阿難：『我過去世入大海中，持[矛*(替-曰+貝)]刺人斷其命根。",
        "translation": "The Buddha told Ānanda, 'In a past life, when I entered the ocean with a [spear*(ti-yo+pui)] spear in my hand, I cut off its life root.",
        "source": "T11n0310_108:0605b03_17"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T11n0310_108:0605b05_18"
    },
    {
        "source_sentence": "以此業緣得如是報。』",
        "translation": "Because of these karmic conditions, they attain such a reward.'",
        "source": "T11n0310_108:0605b05_19"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605b05_20"
    },
    {
        "source_sentence": "我說是業緣已，彼時二十怨賊欲害二十人者作是思惟：『如來法王尚得如是惡業之報，",
        "translation": "When I had explained these karmic conditions, the twenty thieves who wanted to kill those twenty people thought:",
        "source": "T11n0310_108:0605b05_21"
    },
    {
        "source_sentence": "況我等輩不受此報？』",
        "translation": "How could we not receive this reward?'",
        "source": "T11n0310_108:0605b07_22"
    },
    {
        "source_sentence": "是二十人即從座起，頭面禮佛，作如是言：『我等今日向佛悔過，不敢覆藏。",
        "translation": "The twenty of them rose from their seats, bowed their foreheads and faces to the Buddha, and said these words: Today we repent to him. We dare not hide our sins.",
        "source": "T11n0310_108:0605b08_23"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_108:0605b10_0"
    },
    {
        "source_sentence": "我先惡心欲害彼人，今重悔過不敢覆藏。』",
        "translation": "I used to want to harm that person with bad intentions, but now I repent and won't cover it up.'",
        "source": "T11n0310_108:0605b10_1"
    },
    {
        "source_sentence": "爾時世尊為彼人故，說作業緣及盡業緣。",
        "translation": "At that time the World-honoured One spoke, for the sake of these people, of the supporting object of action and the supporting object of destruction of action.",
        "source": "T11n0310_108:0605b11_2"
    },
    {
        "source_sentence": "時二十人聞是法已即得正解，及四萬人亦得正解。",
        "translation": "Twenty people then heard this teaching and attained right understanding, and 40,000 people also attained right understanding.",
        "source": "T11n0310_108:0605b12_0"
    },
    {
        "source_sentence": "是故如來示佉違羅刺刺足，是名如來方便。",
        "translation": "That's why the Tathāgata shows his feet with a crooked thorn, which is called the Tathāgata's skillful means.",
        "source": "T11n0310_108:0605b13_1"
    },
    {
        "source_sentence": "「以何緣故，如來先無諸病，而從耆域藥王索優鉢羅花嗅之令下。",
        "translation": "“Why is it that the Tathāgata didn’t have any illnesses in the past, but he ordered the Medicine King of Jīvaka to smell the blue lotus flower and told him to do so?",
        "source": "T11n0310_108:0605b15_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605b16_1"
    },
    {
        "source_sentence": "爾時如來制解脫戒未久，時有五百比丘是最後身，常在餘諸林中修道。",
        "translation": "Not long after the liberation precepts of the Tathāgata had been established, five hundred monks were present in his last body and always cultivated their practice in other forests.",
        "source": "T11n0310_108:0605b16_2"
    },
    {
        "source_sentence": "彼諸比丘得如是病，陳故之藥所不能治。",
        "translation": "Those monks became ill like this and couldn't be cured by the old medicine.",
        "source": "T11n0310_108:0605b18_3"
    },
    {
        "source_sentence": "彼諸比丘敬慎佛戒，不求餘藥不服餘藥。",
        "translation": "Those monks respected the Buddha's precepts and didn't seek other medicines or take other medicines.",
        "source": "T11n0310_108:0605b19_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605b20_5"
    },
    {
        "source_sentence": "爾時如來如是思惟：『作何方便聽服餘藥？",
        "translation": "It was then that the Tathāgata thus thought, 'What method would I use to hear and take the other medicine?'",
        "source": "T11n0310_108:0605b20_6"
    },
    {
        "source_sentence": "若我聽者，彼諸比丘當求餘藥當服餘藥。",
        "translation": "If I listen, those monks will seek the other medicine and take the other medicine.",
        "source": "T11n0310_108:0605b21_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0605b22_8"
    },
    {
        "source_sentence": "若如來不聽者，後諸人輩當犯聖法。』",
        "translation": "If the Tathāgata doesn't listen, later generations of people will violate the noble teaching.'",
        "source": "T11n0310_108:0605b22_9"
    },
    {
        "source_sentence": "是以如來行方便故，從耆域藥師求優鉢羅花嗅之令下。",
        "translation": "That's why the Tathāgata practiced skillful means and asked the Gṛdhrakūṭa Medicine Master to search for the utpala flower and smell it so that it would go down.",
        "source": "T11n0310_108:0605b23_10"
    },
    {
        "source_sentence": "時淨居天即至彼比丘眾中作如是言：『大德！",
        "translation": "The Śuddhodana then went to that monk's congregation and said, 'O great virtuous one!",
        "source": "T11n0310_108:0605b24_11"
    },
    {
        "source_sentence": "可求餘藥，莫守病而死。』",
        "translation": "You should seek other medicines, so you won't be sick and die.'",
        "source": "T11n0310_108:0605b25_12"
    },
    {
        "source_sentence": "比丘答言：『我等不敢違世尊教，我等不得自在，我等寧死不違佛教，",
        "translation": "The bhikṣus replied: We would not dare disobey the instruction of the World-honored One. We will not be able to do so freely. Let us rather die and not disobey the Buddha’s instructions.",
        "source": "T11n0310_108:0605b26_13"
    },
    {
        "source_sentence": "我等不求盈長好藥。』",
        "translation": "We won't seek to fill it with long, good medicine.'",
        "source": "T11n0310_108:0605b27_14"
    },
    {
        "source_sentence": "如是說已，淨居天子語諸比丘言：『大德！",
        "translation": "After he spoke these words, the Pure Land celestial said to the monks, 'O great virtuous one!",
        "source": "T11n0310_108:0605b28_15"
    },
    {
        "source_sentence": "如來法王求餘好藥、捨陳故藥。",
        "translation": "The Tathāgata Dharma King asked for the remaining good medicine and abandoned the old medicine that was given to him.",
        "source": "T11n0310_108:0605b29_16"
    },
    {
        "source_sentence": "諸大德可求餘藥。』",
        "translation": "The great virtuous ones can ask for the rest of the medicine.'",
        "source": "T11n0310_108:0605b29_17"
    },
    {
        "source_sentence": "諸比丘聞語已，除去疑心更求餘藥，更服餘藥然後除病，除病已不過七日證阿羅漢果。",
        "translation": "Having heard these words, the bhikṣus dispelled their doubts and further sought other kinds of medicine. After taking another kind of medicine, they were cured of their illnesses; after being cured of their illnesses, it was not more than seven",
        "source": "T11n0310_108:0605c01_18"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605c03_19"
    },
    {
        "source_sentence": "若如來不求餘藥，彼諸比丘亦不求餘藥。",
        "translation": "If the Tathāgata doesn't seek other medicine, those monks won't seek other medicine either.",
        "source": "T11n0310_108:0605c03_20"
    },
    {
        "source_sentence": "若不求餘藥，能除諸病及斷諸結證於阿羅漢果者，無有是處。",
        "translation": "If someone doesn't seek other medicines that can remove illnesses and cut bonds and realize the fruit of arhatship, there's no place for them.",
        "source": "T11n0310_108:0605c04_21"
    },
    {
        "source_sentence": "是名如來方便。",
        "translation": "This is called the Tathāgata's method.",
        "source": "T11n0310_108:0605c05_22"
    },
    {
        "source_sentence": "「以何緣故，如來入城乞食空鉢而出？",
        "translation": "“For what reason did the Tathāgata enter the city to solicit alms with an empty bowl and leave?",
        "source": "T11n0310_108:0605c07_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605c07_1"
    },
    {
        "source_sentence": "如來無有業障，爾時如來矜愍護念當來比丘，或有比丘入於城邑聚落乞食，",
        "translation": "The Tathāgata has no karmic hindrances. At that time, the Tathāgata is affectionate and protective toward future bhikṣus. Some bhikṣus may enter towns and villages to solicit alms.",
        "source": "T11n0310_108:0605c08_0"
    },
    {
        "source_sentence": "自無福德乞食不得。",
        "translation": "They themselves lack the virtue to beg for food and won't get it.",
        "source": "T11n0310_108:0605c09_1"
    },
    {
        "source_sentence": "彼比丘當作是念：『如來世尊功德成就，入城乞食空鉢而出，何況我等善根微薄？",
        "translation": "That monk thinks, 'The Bhagavān, the Tathāgata, has accomplished his virtue, entered the city to solicit alms and left with an empty bowl, so why wouldn't we have weak good roots?'",
        "source": "T11n0310_108:0605c10_2"
    },
    {
        "source_sentence": "我等不應以乞食不得而生憂惱熱。』",
        "translation": "We shouldn't give rise to grief and anguish because we can't obtain almsfood.'",
        "source": "T11n0310_108:0605c12_3"
    },
    {
        "source_sentence": "是故如來示現入城乞食空鉢而出。",
        "translation": "Therefore, the Tathāgata shows that he enters the city to solicit alms with an empty bowl and leaves it.",
        "source": "T11n0310_108:0605c12_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605c13_5"
    },
    {
        "source_sentence": "汝若謂惡魔波旬能覆蔽城中長者婆羅門心故，乃至不與一摶食者，善男子！",
        "translation": "If you say that bad Māra Pāpīyān can obscure the minds of the elders and brāhmaṇas in the city, even if he doesn't give them a single mouthful of food, good man!",
        "source": "T11n0310_108:0605c13_6"
    },
    {
        "source_sentence": "莫作斯觀。",
        "translation": "Don't make such an observation.",
        "source": "T11n0310_108:0605c15_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0605c15_8"
    },
    {
        "source_sentence": "惡魔波旬不能斷絕如來食也。",
        "translation": "Bad Māra Pāpīyān can't cut off the Tathāgata's food.",
        "source": "T11n0310_108:0605c16_9"
    },
    {
        "source_sentence": "爾時佛神力故，令惡魔波旬覆蔽彼城中人，非是惡魔力之所能。",
        "translation": "At the time, it was because of the Buddha's supernormal power that bad Māra Pāpīyān caused the people in that city to be overwhelmed by them, and it wasn't possible for a bad demon to do so.",
        "source": "T11n0310_108:0605c16_10"
    },
    {
        "source_sentence": "我於爾時都無業障，為化彼眾生故，示現空鉢而出。",
        "translation": "At the time, I had no karmic hindrances, so in order to transform those sentient beings, I showed them an empty bowl and came out.",
        "source": "T11n0310_108:0605c18_11"
    },
    {
        "source_sentence": "爾時我及比丘僧不得食已，一切魔天及諸餘天作如是念：『佛及眾僧不得食已，",
        "translation": "At that time, when neither I nor any of the monks and nuns were allowed to eat, all the Māra gods and other goddesses thought:",
        "source": "T11n0310_108:0605c19_12"
    },
    {
        "source_sentence": "頗有憂耶？』",
        "translation": "Could it be that there's grief?'",
        "source": "T11n0310_108:0605c21_13"
    },
    {
        "source_sentence": "即於其夜見佛及僧，乃至無有一念憂惱，心亦不高亦復不下，如前後亦如是。",
        "translation": "That night, he saw the Buddha and the saṃgha, didn't even have a single thought of grief, and his mind isn't raised or lowered, just as before or after.",
        "source": "T11n0310_108:0605c21_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605c23_15"
    },
    {
        "source_sentence": "爾時有七千天子，傾向如來生信敬心。",
        "translation": "At the time, 7,000 celestial beings tended toward the Tathāgata and gave rise to faith and respect.",
        "source": "T11n0310_108:0605c23_16"
    },
    {
        "source_sentence": "我於是時即為說法，於一切法得法眼淨。",
        "translation": "At that point, I then explained the teaching for them so that they would attain purity of the Dharma eye in all dharmas.",
        "source": "T11n0310_108:0605c24_17"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0605c25_18"
    },
    {
        "source_sentence": "彼時婆羅門長者，其後不久又聞世尊有大威德，生渴仰心即至佛所，頭面作禮向佛悔過。",
        "translation": "Soon after that, the Brāhmaṇa householder, hearing that the Bhagavān had great authority and virtue, became thirsty and went to the Buddha, bowed his head and face, and repented of his sins.",
        "source": "T11n0310_108:0605c25_19"
    },
    {
        "source_sentence": "彼時如來即為其說四聖諦法，一說法時有二萬人於一切法中得法眼淨。",
        "translation": "The Tathāgata then explained the teaching of the four noble truths for them, and 20,000 people attain purity of the Dharma eye in all dharmas when they taught one teaching.",
        "source": "T11n0310_108:0605c27_20"
    },
    {
        "source_sentence": "是故如來入城乞食空鉢而出，是名如來方便。",
        "translation": "That's why the Tathāgata enters the city to solicit alms with an empty bowl and leaves it, which is called the Tathāgata's method.",
        "source": "T11n0310_108:0605c29_21"
    },
    {
        "source_sentence": "「以何緣故，旃遮婆羅門女以木杅繫腹誹謗如來，而作是言：『由沙門瞿曇令我妊身，",
        "translation": "“For what reason did the brahman woman Kauṣṭhila, holding a bamboo ball in her belly and slandering the Tathāgata, say, ‘The renunciant Gotama has made me pregnant.",
        "source": "T11n0310_108:0606a02_0"
    },
    {
        "source_sentence": "應當與我衣被飲食。』",
        "translation": "You should give me my clothing, food, and drink.'",
        "source": "T11n0310_108:0606a03_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606a04_2"
    },
    {
        "source_sentence": "如來於此事中都無業障。",
        "translation": "In this matter, the Tathāgata has no karmic hindrances.",
        "source": "T11n0310_108:0606a04_3"
    },
    {
        "source_sentence": "若有業障，我能擲此旃遮婆羅門女置恒河沙世界之外。",
        "translation": "If there are karmic hindrances, I can toss this Kauṣṭhila Brahman woman outside the world beyond the sands of the Ganges River.",
        "source": "T11n0310_108:0606a05_4"
    },
    {
        "source_sentence": "如來以方便故現此業障，為化不知解眾生故。",
        "translation": "The Tathāgata manifests these karmic hindrances because of skillful means in order to transform sentient beings who don't understand.",
        "source": "T11n0310_108:0606a06_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0606a07_6"
    },
    {
        "source_sentence": "當來之世有諸比丘於我法中出家學道，爾時或為他人所謗，以是緣故心生慚愧，",
        "translation": "In the future, when there are monks who leave home and study the path in my teachings, sometimes they'll be denigrated by others. For this reason, their minds will become ashamed,",
        "source": "T11n0310_108:0606a07_7"
    },
    {
        "source_sentence": "或不樂佛法捨戒還俗。",
        "translation": "Perhaps they don't delight in the Buddha's teaching and abandon precepts and return to the secular world.",
        "source": "T11n0310_108:0606a09_8"
    },
    {
        "source_sentence": "彼諸比丘若被謗已當念如來，如來成就一切善法具大威德尚被誹謗，而況我等不被誹謗，",
        "translation": "If those monks are slandered, they should think of the Tathāgata. The Tathāgata who has perfected all good qualities and is endowed with great majesty will still be slandered, but how could we not?",
        "source": "T11n0310_108:0606a10_9"
    },
    {
        "source_sentence": "思念是已則除慚愧，除慚愧已當得修習淨妙梵行。",
        "translation": "After contemplating this, they'll remove their shame, and after removing their shame, they'll attain cultivation of the pure and marvelous religious practice.",
        "source": "T11n0310_108:0606a12_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606a13_11"
    },
    {
        "source_sentence": "旃遮婆羅門女常為惡業所覆故性多不信，今此女身於佛法中不得調伏，",
        "translation": "The brahman woman Kauṣṭhila had always been hindered by evil deeds and therefore naturally disbelieved in all the teachings of the Buddha.",
        "source": "T11n0310_108:0606a13_12"
    },
    {
        "source_sentence": "常為惡業之所覆蔽，乃至夢中亦生誹謗，覺已心喜。",
        "translation": "They are always hindered by bad karma, even in a dream they denigrate it and rejoice when they awaken to it.",
        "source": "T11n0310_108:0606a15_13"
    },
    {
        "source_sentence": "此女人中命終當墮地獄。",
        "translation": "At the end of her life, this woman will fall into hell.",
        "source": "T11n0310_108:0606a16_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606a17_15"
    },
    {
        "source_sentence": "我能以餘方便除此女人諸不善業，令度生死能為作救。",
        "translation": "I can use other skillful means to remove this woman's unwholesome actions and cause her to be liberated from birth and death so that I can rescue her.",
        "source": "T11n0310_108:0606a17_16"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606a18_17"
    },
    {
        "source_sentence": "或時如來不救餘人。",
        "translation": "Sometimes the Tathāgata doesn't save others.",
        "source": "T11n0310_108:0606a18_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0606a19_19"
    },
    {
        "source_sentence": "如來於一切眾生無有偏心，是名如來方便。",
        "translation": "The Tathāgata has no partial mind toward all sentient beings, which is called the Tathāgata's method.",
        "source": "T11n0310_108:0606a19_20"
    },
    {
        "source_sentence": "「以何緣故，諸婆羅門殺婆羅門女孫陀利，埋祇洹園塹中？",
        "translation": "For what reason did the brāhmaṇas kill the brāhmaṇa’s daughter, Sundatta, and bury her in the moat of Jetavana?",
        "source": "T11n0310_108:0606a21_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606a22_1"
    },
    {
        "source_sentence": "如來是時知有是事，捨而不說。",
        "translation": "At the time, the Tathāgata knew there was such a thing, but he abandoned it and didn't explain it.",
        "source": "T11n0310_108:0606a22_2"
    },
    {
        "source_sentence": "如來成就一切智心無有障礙，能以神力可令此刀不入女身。",
        "translation": "The Tathāgata has perfected the mind of omniscience without obstruction, and he can use his supernormal powers to prevent this sword from entering a woman's body.",
        "source": "T11n0310_108:0606a23_3"
    },
    {
        "source_sentence": "我於爾時知孫陀利女命根將盡必為他殺，以此方便令諸外道不善彰露墮不如處。",
        "translation": "Knowing that the life root of Sundarī's daughter was about to end, I would surely kill her for someone else, and this method will cause non-Buddhists who don't well express themselves to fall into a bad place.",
        "source": "T11n0310_108:0606a24_4"
    },
    {
        "source_sentence": "如此諸事唯佛知之安住是事，令多眾生生清淨心增益善根。",
        "translation": "Only the Buddha knows and abides in these things, which cause many sentient beings to give rise to pure minds and increase good roots.",
        "source": "T11n0310_108:0606a26_5"
    },
    {
        "source_sentence": "爾時如來七日不入舍衛大城。",
        "translation": "For seven days, the Tathāgata didn't enter the great city of Śrāvastī.",
        "source": "T11n0310_108:0606a27_6"
    },
    {
        "source_sentence": "不入城已，爾時調伏六十億天過七日已，諸天世人集會共來至於我所。",
        "translation": "After seven days had passed, the gods and humans gathered together to come to me.",
        "source": "T11n0310_108:0606a28_7"
    },
    {
        "source_sentence": "爾時如來為四眾說法，聞說法已有八萬四千人於諸法中得法眼淨。",
        "translation": "At the time, the Tathāgata taught the Dharma to the four groups of people, and 84,000 people who heard the teaching had already attained purity of the Dharma eye in all dharmas.",
        "source": "T11n0310_108:0606b01_8"
    },
    {
        "source_sentence": "是名如來方便。",
        "translation": "This is called the Tathāgata's method.",
        "source": "T11n0310_108:0606b02_9"
    },
    {
        "source_sentence": "「以何緣故，如來及僧在於婆羅門毘蘭若聚落三月之中食馬麥耶？",
        "translation": "For what reason did the Tathāgata and the saṃgha eat horse wheat for three months in the village of Brāhmaṇapilanjīva?",
        "source": "T11n0310_108:0606b04_0"
    },
    {
        "source_sentence": "善男子？",
        "translation": "Good sons?",
        "source": "T11n0310_108:0606b05_1"
    },
    {
        "source_sentence": "我於昔時知此婆羅門，必捨初始請佛僧心不給飲食，而故往受請。",
        "translation": "In the past, I knew that this Brāhmaṇa would surely give up his initial invitation to the buddhas and saṃgha without offering food or drink, so I went there to accept the invitation.",
        "source": "T11n0310_108:0606b05_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0606b07_3"
    },
    {
        "source_sentence": "為彼五百馬故。",
        "translation": "It's because of those five hundred horses.",
        "source": "T11n0310_108:0606b07_4"
    },
    {
        "source_sentence": "此五百馬於先世中，已學菩薩乘、已曾供養過去諸佛，近惡知識作惡業緣，",
        "translation": "These five hundred horses had studied the bodhisattva vehicle in their previous existences and had formerly offered offerings to all the buddhas of the past.",
        "source": "T11n0310_108:0606b07_5"
    },
    {
        "source_sentence": "惡業緣故墮畜生中。",
        "translation": "Because of bad karmic conditions, they'll fall into the animal kingdom.",
        "source": "T11n0310_108:0606b09_6"
    },
    {
        "source_sentence": "五百馬中有一大馬名曰日藏，是大菩薩。",
        "translation": "Among the five hundred horses, there's a large horse named Sun Treasury, which is a great bodhisattva.",
        "source": "T11n0310_108:0606b09_7"
    },
    {
        "source_sentence": "是日藏菩薩於過去世在人道中，已曾勸是五百小馬發菩提心，為欲度此五百馬故現生馬中。",
        "translation": "In a past life, this Sun-Store Bodhisattva was among humans and had once encouraged these five hundred small horses to give rise to the mind of enlightenment, and because he wanted to save these five hundred horses, he's now born",
        "source": "T11n0310_108:0606b10_8"
    },
    {
        "source_sentence": "由大馬威德故，令五百馬自識宿命，本所失心而令還得。",
        "translation": "Because of his great horse's authoritative power, he caused the five hundred horses to know their past lives for themselves and regained the mind they had lost in the past.",
        "source": "T11n0310_108:0606b13_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606b14_10"
    },
    {
        "source_sentence": "我愍彼五百菩薩墮馬中者，欲令得脫離於畜生，是故如來知故受請。",
        "translation": "I pity those five hundred bodhisattvas who fell into a horse, wanting to let them be freed from the animals, so the Tathāgata knew and therefore accepted my invitation.",
        "source": "T11n0310_108:0606b14_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606b16_12"
    },
    {
        "source_sentence": "是時五百馬減所食麥半持施僧，大馬半分奉施如來。",
        "translation": "Five hundred horses then gave half of the wheat they ate to the saṃgha and half of the large horses to the Tathāgata.",
        "source": "T11n0310_108:0606b16_13"
    },
    {
        "source_sentence": "爾時大馬為五百馬，以馬音聲而為說法亦教悔過：『今當禮佛及比丘僧。』",
        "translation": "It was then that the great horse formed five hundred horses, spoke to them with the sound of his horse and taught them to repent, saying, 'Now, I will pay homage to the Buddha and the monks.'",
        "source": "T11n0310_108:0606b17_14"
    },
    {
        "source_sentence": "說此事已復作是言：『汝等當以所食半分供養於僧。』",
        "translation": "After explaining this, he also said, 'You must make offerings to the saṃgha with half of what you eat.'",
        "source": "T11n0310_108:0606b19_15"
    },
    {
        "source_sentence": "爾時五百馬悔過已，於佛及僧生淨信心。",
        "translation": "After repenting, the five hundred horses then had pure faith in the Buddha and the saṃgha.",
        "source": "T11n0310_108:0606b20_16"
    },
    {
        "source_sentence": "過三月已，其後不久是五百馬命終生於兜術天上。",
        "translation": "Soon after three months had passed, the five hundred horses died and were soon reborn in the Tuṣita Heaven.",
        "source": "T11n0310_108:0606b21_17"
    },
    {
        "source_sentence": "彼五百天子即從天來至於佛所供養如來，爾時如來即為說法，聞說法已必定得成阿耨多羅三藐三菩提。",
        "translation": "Those five hundred celestial beings then came from heaven to the Buddha's place to make offerings to the Tathāgata, and the Tathāgata then taught him the Dharma, and after hearing it, he would surely attain unsurpassed, correct, and",
        "source": "T11n0310_108:0606b22_18"
    },
    {
        "source_sentence": "彼時五百馬子善調伏其心，於將來世得辟支佛。",
        "translation": "The five hundred horsemen then well subdued their minds and attained pratyekabuddhahood in a future life.",
        "source": "T11n0310_108:0606b24_19"
    },
    {
        "source_sentence": "彼日藏大馬於當來世供養無量諸佛，得成助菩提法，然後作佛，號曰善調如來、應供、正遍知。",
        "translation": "In the future, that great horse Sun-Store Great Horse will make offerings to measureless buddhas, attain the method of assisting enlightenment, and then become a buddha named the well-adjusted Tathāgata, Worthy of Offerings",
        "source": "T11n0310_108:0606b26_20"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606b28_21"
    },
    {
        "source_sentence": "無有世中上妙美味而如來不得。",
        "translation": "There's no such marvelous delicacy in the world that the Tathāgata won't obtain it.",
        "source": "T11n0310_108:0606b28_22"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606b29_23"
    },
    {
        "source_sentence": "如來雖食草木土塊瓦礫，三千大千世界中無如是味似如來所食草木土塊瓦礫味者。",
        "translation": "Although the Tathāgata eats lumps of grass, wood, dirt, and rubble, there's no such taste in 3,000 great one-thousand worlds that resembles the tasty taste of grass, wood, dirt,",
        "source": "T11n0310_108:0606b29_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0606c02_25"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606c02_26"
    },
    {
        "source_sentence": "如來大人得味中上味相，若如來以最麁食著口中已，其所得味勝天妙食。",
        "translation": "If the Tathāgata puts the most delicious food in his mouth, he'll attain the taste of superior heavenly subtle food.",
        "source": "T11n0310_108:0606c02_27"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606c04_28"
    },
    {
        "source_sentence": "以是故知如來所食最是勝妙。",
        "translation": "Because of this, it's known that what the Tathāgata eats is most wonderful.",
        "source": "T11n0310_108:0606c04_29"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606c05_30"
    },
    {
        "source_sentence": "爾時阿難心生憂惱：『轉輪聖王種出家學道，如下賤人食此馬麥。』",
        "translation": "It was then that Ānanda became mentally distressed, saying, 'The wheel-turning sage king's family renounced the householder's life and trained in the path, just like a lowly person who eats this horse wheat",
        "source": "T11n0310_108:0606c05_31"
    },
    {
        "source_sentence": "我於爾時見阿難心。",
        "translation": "At the time, I saw Ānanda's mind.",
        "source": "T11n0310_108:0606c07_0"
    },
    {
        "source_sentence": "見阿難心已即與阿難一粒麥，語阿難言：『汝甞此麥味為何如？』",
        "translation": "Seeing the mind of Ānanda, he gave him a grain of wheat to Ānanda and said to Ānanda, 'What's the taste of this wheat you eat?'",
        "source": "T11n0310_108:0606c07_1"
    },
    {
        "source_sentence": "阿難甞已生希有心，白佛言：『世尊！",
        "translation": "Ānanda then had a rare feeling of wonder and said to the Buddha, 'Bhagavān!",
        "source": "T11n0310_108:0606c08_2"
    },
    {
        "source_sentence": "我生王家長大王家，未曾得如是之味。』",
        "translation": "I'm born in the king's family, the great king's family, and I've never tasted such a taste before.'",
        "source": "T11n0310_108:0606c09_3"
    },
    {
        "source_sentence": "阿難食此麥已，七日七夜更不飲食無飢渴想。",
        "translation": "After he ate this wheat, Ānanda didn't eat or drink it for seven days and nights without hunger or thirst.",
        "source": "T11n0310_108:0606c10_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606c11_5"
    },
    {
        "source_sentence": "是故當知，是如來方便，非是業障。",
        "translation": "Therefore, you should know that this is the Tathāgata's skillful means and not an karmic obstruction.",
        "source": "T11n0310_108:0606c11_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606c12_7"
    },
    {
        "source_sentence": "有沙門婆羅門持戒如我受他請已，而知請主荒迷不能供給，或不肯住。",
        "translation": "Suppose there's an ascetic or priest who observes the precepts like me and accepts another person's invitation, but knows that the invitee is in a wilderness and can't make offerings, or won't stay.",
        "source": "T11n0310_108:0606c12_8"
    },
    {
        "source_sentence": "以是緣故，如來已所許處現必就請，及欲示現業報緣故。",
        "translation": "Because of these reasons, when the Tathāgata has already accepted a place to be manifested, he necessarily asks for it and because he wants to show the conditions as retribution for his actions.",
        "source": "T11n0310_108:0606c14_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606c15_10"
    },
    {
        "source_sentence": "當知如來常法，雖受他請不得供給，不令請主墮於惡道。",
        "translation": "You should know that the Tathāgata's constant teaching is that even though he accepts someone else's invitation, he can't make offerings, and he doesn't cause the inviter to fall into a bad path.",
        "source": "T11n0310_108:0606c15_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606c17_12"
    },
    {
        "source_sentence": "若彼五百比丘共如來夏安居食馬麥者，有四百比丘多見淨故生貪欲心。",
        "translation": "If those five hundred monks were to share the Tathāgata's summer retreat and eat horse wheat, 400 monks would become greedy because they often see purity.",
        "source": "T11n0310_108:0606c17_13"
    },
    {
        "source_sentence": "彼諸比丘若食細食增益欲心、若食麁食心則不為貪欲所覆。",
        "translation": "If those monks eat fine food and increase their minds with desire, or if they eat coarse food, they won't be covered by craving.",
        "source": "T11n0310_108:0606c19_14"
    },
    {
        "source_sentence": "彼諸比丘過三月已，離婬欲心證阿羅漢果。",
        "translation": "After three months had passed, those monks were freed from the mind of sexual desire and realized the fruit of arhatship.",
        "source": "T11n0310_108:0606c20_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606c21_16"
    },
    {
        "source_sentence": "為調伏五百比丘、度五百菩薩故，如來以方便力受三月食馬麥，非是業報。",
        "translation": "In order to subdue the five hundred monks and liberate the five hundred bodhisattvas, the Tathāgata used his skillful means to accept three months of eating horse wheat, which is not the result of karma.",
        "source": "T11n0310_108:0606c21_17"
    },
    {
        "source_sentence": "是名如來方便。",
        "translation": "This is called the Tathāgata's method.",
        "source": "T11n0310_108:0606c23_18"
    },
    {
        "source_sentence": "「以何緣故，如來十五日說戒時，告長老迦葉：『我今背痛。",
        "translation": "“For what reason did the Tathāgata preach the precepts on the fifteenth day? He said to the venerable Kāśyapa:",
        "source": "T11n0310_108:0606c24_0"
    },
    {
        "source_sentence": "汝今說七覺支法。』",
        "translation": "Now, you'll explain the seven factors of awakening.'",
        "source": "T11n0310_108:0606c25_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606c25_2"
    },
    {
        "source_sentence": "爾時有八千天子以聲聞法而自調伏，在彼眾中和合共坐。",
        "translation": "At the time, there were 8,000 celestial beings who self-controlled themselves with the śrāvaka teachings and sat together in that congregation in harmony.",
        "source": "T11n0310_108:0606c25_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606c27_4"
    },
    {
        "source_sentence": "彼諸天子於過去世是大迦葉所教化者，於佛法僧而不放逸。",
        "translation": "In a past life, those celestial beings who were taught by Mahākāśyapa didn't be careless about the Buddha, Dharma, and saṃgha.",
        "source": "T11n0310_108:0606c27_5"
    },
    {
        "source_sentence": "彼諸天子數聞迦葉比丘說七覺法。",
        "translation": "Those celestial beings repeatedly heard the monk Kāśyapa explain the teaching of the seven factors of awakening.",
        "source": "T11n0310_108:0606c28_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0606c29_7"
    },
    {
        "source_sentence": "此諸天子除迦葉比丘，若百千諸佛為其說法不能令解。",
        "translation": "These celestial beings except the monk Kāśyapa, if hundreds of thousands of buddhas were to preach for him, they wouldn't be able to make him understand.",
        "source": "T11n0310_108:0606c29_8"
    },
    {
        "source_sentence": "爾時迦葉為諸天子廣說七覺法，諸天子從迦葉比丘聞七覺法已得法眼淨。",
        "translation": "It was then that Kāśyapa explained the seven principles of awakening in detail for the godlings, and the godlings heard the seven principles of awakening from the monk Kāśyapa and attained purity of the Dharma eye.",
        "source": "T11n0310_108:0607a02_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607a04_0"
    },
    {
        "source_sentence": "若有眾生病苦纏身，不能得至於說法之處聽法恭敬。",
        "translation": "If there are a multitude of people with illnesses and painful fetters, they can't go to the place where he teaches or listens to the teaching and venerate it.",
        "source": "T11n0310_108:0607a04_1"
    },
    {
        "source_sentence": "彼諸人等當作是念：『佛是法王，尚聽七覺法而得除病，何況我等不往聽法不恭敬法？』",
        "translation": "Those people will think, 'The Buddha is the king of the Dharma, and he still hears the teaching of the seven factors of awakening and gets rid of illness, so why wouldn't we go there to hear the teaching and disrespect it?'",
        "source": "T11n0310_108:0607a05_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607a07_3"
    },
    {
        "source_sentence": "為調伏諸天除人苦患故，又示現敬重於法，是故如來作如是言：『迦葉！",
        "translation": "In order to tame the gods and remove human suffering, he also showed respect for the Dharma. That's why the Tathāgata said, 'Kāśyapa!",
        "source": "T11n0310_108:0607a07_4"
    },
    {
        "source_sentence": "我今背痛。",
        "translation": "Now, I'm suffering from back pain.",
        "source": "T11n0310_108:0607a09_5"
    },
    {
        "source_sentence": "汝當說七覺法。",
        "translation": "You must explain the seven factors of awakening.",
        "source": "T11n0310_108:0607a09_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0607a09_7"
    },
    {
        "source_sentence": "尊重法故。』",
        "translation": "It's because they respect the Dharma.'",
        "source": "T11n0310_108:0607a09_8"
    },
    {
        "source_sentence": "如來無有麁重四大之身，何況有病？",
        "translation": "The Tathāgata doesn't have the body of the four major debilitating hindrances, so why wouldn't he have illness?",
        "source": "T11n0310_108:0607a10_9"
    },
    {
        "source_sentence": "是名如來方便。",
        "translation": "This is called the Tathāgata's method.",
        "source": "T11n0310_108:0607a11_0"
    },
    {
        "source_sentence": "「以何緣故，釋種破時，如來自言我頭痛耶？",
        "translation": "For what reason did the Tathāgata say, 'I have a headache' when the Śākyamuni clan breaks up?",
        "source": "T11n0310_108:0607a12_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607a12_1"
    },
    {
        "source_sentence": "或有眾生作如是言：『世尊不能利益親族，亦不矜愍、不欲安隱，而出家已種族意斷不欲救護。』",
        "translation": "Perhaps there are sentient beings who say, 'The Bhagavān can't benefit their relatives, nor does he look down on them or want to be comfortable, but after leaving home, his family stops thinking and doesn't want to rescue them",
        "source": "T11n0310_108:0607a13_2"
    },
    {
        "source_sentence": "是諸眾生以不知故作如是言。",
        "translation": "Because sentient beings don't know it, they say this.",
        "source": "T11n0310_108:0607a15_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607a15_4"
    },
    {
        "source_sentence": "如來於諸苦本已到其邊，如來知是眾生心所念故，坐舍耶樹下自言頭痛。",
        "translation": "Knowing that these were the thoughts of sentient beings in their minds, the Tathāgata sat under a śāla tree and said to himself, Headache!",
        "source": "T11n0310_108:0607a16_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607a17_6"
    },
    {
        "source_sentence": "吾於爾時尋向阿難說我頭痛。",
        "translation": "At the time, I went to Ānanda and told him about my headache.",
        "source": "T11n0310_108:0607a18_0"
    },
    {
        "source_sentence": "時有斷見三千天子，復有無量好殺生者，皆共集會。",
        "translation": "At the time, there were 3,000 celestial beings who cut off views and also had measureless good intentions to kill people, and they all gathered together.",
        "source": "T11n0310_108:0607a18_1"
    },
    {
        "source_sentence": "為彼斷見天子及好殺者，示現業障故作是言：『吾以眼見他殺生心隨喜故，",
        "translation": "In order to show the karmic hindrances of those who have abandoned views of celestial beings and are fond of killing, they say, 'With my eyes I see others killing.",
        "source": "T11n0310_108:0607a19_2"
    },
    {
        "source_sentence": "今得頭痛。』",
        "translation": "Now, I'll have a headache.'",
        "source": "T11n0310_108:0607a21_3"
    },
    {
        "source_sentence": "說是法已，七千人天皆得調伏。",
        "translation": "After he taught this teaching, 7,000 gods and goddesses were all disciplined.",
        "source": "T11n0310_108:0607a21_4"
    },
    {
        "source_sentence": "是名如來方便。",
        "translation": "This is called the Tathāgata's method.",
        "source": "T11n0310_108:0607a22_5"
    },
    {
        "source_sentence": "「以何緣故，頗羅墮婆羅門以五百種罵詈佛，如來聞已能忍？",
        "translation": "“For what reason are the five hundred kinds of scolding that the Brāhmaṇa Bhāradvāja uses to disparage the Buddha, which the Tathāgata can tolerate after hearing it?",
        "source": "T11n0310_108:0607a23_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607a24_1"
    },
    {
        "source_sentence": "如來能以神力擲此婆羅門置餘世界，亦能以神力令婆羅門乃至不能出於一言罵詈之聲。",
        "translation": "The Tathāgata can toss this Brāhmaṇa into other worlds with his supernormal powers, and he can also use his supernormal powers to cause the Brāhmaṇa not even a single word of disparagement to sound.",
        "source": "T11n0310_108:0607a24_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607a26_3"
    },
    {
        "source_sentence": "時彼眾中多有人天，見如來能忍惡罵不說不答，生於捨心等心利益心堪忍心，",
        "translation": "When many people in the assembly saw that the Tathāgata was able to tolerate harsh verbal abuse without saying or answering, they gave rise to thoughts of equanimity and so forth, such thoughts as equanimity, benefit, and",
        "source": "T11n0310_108:0607a26_4"
    },
    {
        "source_sentence": "前如後、後如前。",
        "translation": "The former is like the latter, and the latter is like the former.",
        "source": "T11n0310_108:0607a28_5"
    },
    {
        "source_sentence": "爾時有四千人發阿耨多羅三藐三菩提心。",
        "translation": "At the time, 4,000 people aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_108:0607a29_0"
    },
    {
        "source_sentence": "如來見如是義，又頗羅墮婆羅門以五百種惡罵已，見佛世尊生於捨心。",
        "translation": "Seeing this meaning, the Tathāgata also saw that the Brāhmaṇa Bhāradvāja had given rise to the mind of equanimity after being scolded in five hundred ways by the Bhagavān.",
        "source": "T11n0310_108:0607b01_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607b02_1"
    },
    {
        "source_sentence": "是婆羅門見如是已生信敬心！",
        "translation": "That Brāhmaṇa's view is like this, and he's already become faithful and respectful!",
        "source": "T11n0310_108:0607b02_2"
    },
    {
        "source_sentence": "歸依佛法僧種解脫根。",
        "translation": "They take refuge in the liberation faculty of the buddhas, Dharma, and saṃgha.",
        "source": "T11n0310_108:0607b03_3"
    },
    {
        "source_sentence": "是名如來方便。",
        "translation": "This is called the Tathāgata's method.",
        "source": "T11n0310_108:0607b04_4"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607b05_0"
    },
    {
        "source_sentence": "提婆達多與菩薩世世共生一處，此輩亦是菩薩方便。",
        "translation": "Devadatta and the bodhisattva are born together in one place in the world, and this group is also a bodhisattva's method.",
        "source": "T11n0310_108:0607b05_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0607b06_2"
    },
    {
        "source_sentence": "我因提婆達多故具滿六波羅蜜，亦多利益無量眾生。",
        "translation": "Because of Devadatta, I'm fully endowed with the six perfections and often benefit measureless sentient beings.",
        "source": "T11n0310_108:0607b06_3"
    },
    {
        "source_sentence": "云何知爾？",
        "translation": "How do we know this?",
        "source": "T11n0310_108:0607b07_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607b08_5"
    },
    {
        "source_sentence": "爾時眾生快樂，不知行施不知受者。",
        "translation": "At that point, the sentient beings are happy and don't know how to practice generosity or receive it.",
        "source": "T11n0310_108:0607b08_6"
    },
    {
        "source_sentence": "菩薩爾時欲教行布施，是時提婆達多起嫉妬心至菩薩所，求國城妻子及頭目手足。",
        "translation": "Desiring to teach the practice of generosity at that point, Devadatta then became jealous and went to the bodhisattva, seeking his country, city, wife, head, eyes, hands, and feet.",
        "source": "T11n0310_108:0607b09_7"
    },
    {
        "source_sentence": "爾時菩薩歡喜施與。",
        "translation": "It was then that the bodhisattva rejoiced and gave it to him.",
        "source": "T11n0310_108:0607b11_0"
    },
    {
        "source_sentence": "時有無量眾生見菩薩施心生歡喜信解布施，作如是言：『如菩薩施，我亦如是行於布施，",
        "translation": "Countless sentient beings then saw the enlightening being’s generosity and became joyful, believing in it. They said, “Just as a bodhisattva is generous, so too I am also generous.",
        "source": "T11n0310_108:0607b11_1"
    },
    {
        "source_sentence": "願成菩薩。』",
        "translation": "May I become a bodhisattva.'",
        "source": "T11n0310_108:0607b13_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607b13_3"
    },
    {
        "source_sentence": "提婆達多或見菩薩持戒清淨知已，欲破菩薩所持之戒。",
        "translation": "Devadatta might see that the bodhisattva's observance of the precepts is purified, and he wants to break the precepts observed by the bodhisattva.",
        "source": "T11n0310_108:0607b14_0"
    },
    {
        "source_sentence": "爾時菩薩不毀淨戒。",
        "translation": "It was then that the bodhisattva didn't disparage the pure precepts.",
        "source": "T11n0310_108:0607b15_1"
    },
    {
        "source_sentence": "時有無量眾生見菩薩持戒亦效持戒。",
        "translation": "Measureless sentient beings then saw that the bodhisattva observed precepts and also followed them.",
        "source": "T11n0310_108:0607b15_2"
    },
    {
        "source_sentence": "菩薩持戒或為他人輕毀惡罵不生惡心，爾時具足羼提波羅蜜。",
        "translation": "When a bodhisattva observes the precepts or is despised by others and doesn't give rise to bad thoughts, he'll be fully endowed with the perfection of the perfection of deceitfulness.",
        "source": "T11n0310_108:0607b16_3"
    },
    {
        "source_sentence": "有無量眾生見菩薩以忍調心，亦效菩薩行於忍辱。",
        "translation": "Countless sentient beings saw the bodhisattva temper his mind with forbearance and also imitated the bodhisattva's practice of forbearance.",
        "source": "T11n0310_108:0607b18_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607b19_5"
    },
    {
        "source_sentence": "當知提婆達多大利益菩薩。",
        "translation": "You should know that Devadatta is a bodhisattva of great benefit.",
        "source": "T11n0310_108:0607b19_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607b20_7"
    },
    {
        "source_sentence": "如今提婆達多放大醉象欲害如來！",
        "translation": "Now, Devadatta's greatly drunken elephant wants to harm the Tathāgata!",
        "source": "T11n0310_108:0607b20_8"
    },
    {
        "source_sentence": "亦於耆闍崛山推下大石！",
        "translation": "It's also pushed down a large rock at Mount Gṛdhrakūṭa!",
        "source": "T11n0310_108:0607b21_9"
    },
    {
        "source_sentence": "俱是如來方便示現非業報罪。",
        "translation": "They are all the sins of the Tathāgata's skillful means that show what's not the result of karma.",
        "source": "T11n0310_108:0607b21_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0607b22_11"
    },
    {
        "source_sentence": "由此方便利益無量眾生。",
        "translation": "This is the method of benefiting measureless sentient beings.",
        "source": "T11n0310_108:0607b22_12"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607b23_13"
    },
    {
        "source_sentence": "如來總說十業因緣，皆是如來方便示現非是業報。",
        "translation": "The Tathāgata summarizes the causes and conditions of these ten karmas, which are all the Tathāgata's skillful means to show that they aren't the results of karma.",
        "source": "T11n0310_108:0607b23_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0607b24_15"
    },
    {
        "source_sentence": "眾生不知業因所得果報。",
        "translation": "Sentient beings don't know the results of actions that result from causes.",
        "source": "T11n0310_108:0607b24_16"
    },
    {
        "source_sentence": "為眾生故，如來示現如是業報，此業作已得如是報，彼業作已得如是報，",
        "translation": "For the sake of sentient beings, the Tathāgata manifests such karmic rewards as these. Having done this action, they attain such rewards; having done that action, they attain such rewards.",
        "source": "T11n0310_108:0607b25_17"
    },
    {
        "source_sentence": "作如是業得如是報。",
        "translation": "They do such actions and attain such rewards.",
        "source": "T11n0310_108:0607b27_0"
    },
    {
        "source_sentence": "眾生聞已，作如是業離如是業，離不善業修習善業。",
        "translation": "After hearing this, sentient beings do such actions, part with such actions, part with unskillful actions, and cultivate good actions.",
        "source": "T11n0310_108:0607b27_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607b28_2"
    },
    {
        "source_sentence": "今說方便已、示現方便已，此諸方便堅持祕藏，不應為下劣之人薄善根者說。",
        "translation": "Now, after explaining the skillful means and showing the skillful means, these skillful means insist on the secret store, which shouldn't be explained to inferior people who have weak good roots.",
        "source": "T11n0310_108:0607b28_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0607c01_4"
    },
    {
        "source_sentence": "此經非聲聞辟支佛之所行處，況下劣凡夫能信解耶。",
        "translation": "This sūtra isn't a place where śrāvakas and pratyekbuddhas practice, so why wouldn't inferior worldlings believe it?",
        "source": "T11n0310_108:0607c01_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0607c03_0"
    },
    {
        "source_sentence": "此人不能學諸方便。",
        "translation": "This person can't train in the teachings.",
        "source": "T11n0310_108:0607c03_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0310_108:0607c03_2"
    },
    {
        "source_sentence": "此方便經非其所用故，非餘瓦器所能受持，唯有菩薩於此方便法能說能學。",
        "translation": "Because these scriptures of skillful means are not for their use, they cannot be grasped or preserved by any other tile vessel. Only bodhisattvas can teach and study these teachings of skillful means.",
        "source": "T11n0310_108:0607c03_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607c05_4"
    },
    {
        "source_sentence": "譬如夜闇然大明燈，得見室中一切所有。",
        "translation": "It's like a great bright lamp of darkness at night that sees everything in the room.",
        "source": "T11n0310_108:0607c05_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0310_108:0607c06_6"
    },
    {
        "source_sentence": "菩薩聞如是諸方便已，即見一切菩薩所行之道，於此法中我所應學，於一切如來行及菩薩行已到彼岸，",
        "translation": "Having heard these teachings, the enlightening beings see all the paths of practice of enlightening beings; having heard them, they proceed to the other shore.",
        "source": "T11n0310_108:0607c07_7"
    },
    {
        "source_sentence": "善行菩薩道者不以為難。",
        "translation": "Those who well practice the bodhisattva path don't think it's difficult.",
        "source": "T11n0310_108:0607c09_8"
    },
    {
        "source_sentence": "善男子，我今當說，欲得菩提道諸善法者，所謂善男子善女人，聞過百千由旬有說此方便經處，",
        "translation": "Good man, I will now explain that those who want to attain the path of enlightenment and all good qualities are called good men and good women. If they hear this teaching of skillful means beyond a hundred thousand yojanas,",
        "source": "T11n0310_108:0607c10_9"
    },
    {
        "source_sentence": "當往彼聽。",
        "translation": "You must go there and listen.",
        "source": "T11n0310_108:0607c12_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_108:0607c12_11"
    },
    {
        "source_sentence": "若菩薩聞此方便經已得光明行，一切法中除疑悔心。",
        "translation": "If a bodhisattva hears this teaching of skillful means and has attained the practice of illumination, he'll remove doubt and remorse in all dharmas.",
        "source": "T11n0310_108:0607c12_12"
    },
    {
        "source_sentence": "爾時四眾及諸人天成寶器者，說此經時悉聞悉知；",
        "translation": "At that time the fourfold assembly and those humans and gods who had formed the jeweled vessel were all able to hear and know when they preached this sutra.",
        "source": "T11n0310_108:0607c13_13"
    },
    {
        "source_sentence": "非寶器者，雖在此會不聞不知，於此經中耳尚不聞，況能口說，非寶器故。",
        "translation": "It's not a precious vessel because even though they haven't heard or known it here, their ears haven't heard it in this sūtra, so why wouldn't they hear it when they can speak it?",
        "source": "T11n0310_108:0607c15_14"
    },
    {
        "source_sentence": "是以如來說是法時不聞不知，不蒙佛神力故。」",
        "translation": "That's why the Tathāgata doesn't hear or know when he teaches this teaching and doesn't receive the Buddha's supernormal powers.",
        "source": "T11n0310_108:0607c16_15"
    },
    {
        "source_sentence": "說此經已，七萬二千人發阿耨多羅三藐三菩提心。",
        "translation": "After he taught this sūtra, 72,000 people aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_108:0607c17_16"
    },
    {
        "source_sentence": "爾時尊者阿難白佛言：「世尊！",
        "translation": "It was then that Venerable Ānanda said to the Buddha, Bhagavān!",
        "source": "T11n0310_108:0607c19_0"
    },
    {
        "source_sentence": "當何名此經？",
        "translation": "What is the name of this sutra?",
        "source": "T11n0310_108:0607c19_1"
    },
    {
        "source_sentence": "云何奉持？」",
        "translation": "How do you consecrate it?",
        "source": "T11n0310_108:0607c19_2"
    },
    {
        "source_sentence": "佛告阿難：「是經名為『方便波羅蜜』，亦名『轉方便品』，亦名『說方便調伏』，",
        "translation": "The Buddha told Ānanda, This sūtra is called the perfection of skillful means, which is also called the chapter on transforming skillful means and also called teaching skillful means to subdue.",
        "source": "T11n0310_108:0607c20_3"
    },
    {
        "source_sentence": "如是奉持。」",
        "translation": "Thus, I'll consecrate it.",
        "source": "T11n0310_108:0607c21_4"
    },
    {
        "source_sentence": "佛說是已，智勝菩薩心生歡喜，及學聲聞辟支佛乘、學菩薩乘比丘、比丘尼、優婆塞、優婆夷，",
        "translation": "After the Buddha had said this, the minds of the wise and superior bodhisattvas were overjoyed, as well as the śrāvakas and pratyekbuddhas who studied the śrāvaka vehicle and the bodhisattva vehicle, monks",
        "source": "T11n0310_108:0607c22_0"
    },
    {
        "source_sentence": "并諸天、龍、鬼神、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，",
        "translation": "and gods, dragons, spirits, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, nonhumans, and so forth.",
        "source": "T11n0310_108:0607c24_1"
    },
    {
        "source_sentence": "聞說是已，讚言善哉善哉，今說大乘方便經竟。",
        "translation": "After hearing this, he praised it and said, Good! Good! Now, I'll explain the completion of the great vehicle skillful means sūtra.",
        "source": "T11n0310_108:0607c25_2"
    },
    {
        "source_sentence": "大寶積經卷第一百八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1, Volume 108",
        "source": "T11n0310_108:0607c27_0"
    }
]