[
    {
        "source_sentence": "佛說大乘菩薩藏正法經卷第三",
        "translation": "Foshuo daishi pusa zhengfa jing, vol. 3",
        "source": "T11n0316_038:0879b09_0"
    },
    {
        "source_sentence": "十八",
        "translation": "eighteen",
        "source": "T11n0316_038:0879b10_0"
    },
    {
        "source_sentence": "西天譯經三藏銀青光祿大夫",
        "translation": "translated scriptures of the Western Heavens, Tripiṭaka Master銀青光祿大夫",
        "source": "T11n0316_038:0879b12_0"
    },
    {
        "source_sentence": "試光祿卿慈覺傳梵大師賜紫",
        "translation": "試光祿卿慈覺傳梵大師賜紫",
        "source": "T11n0316_038:0879b13_0"
    },
    {
        "source_sentence": "沙門臣法護等奉　詔譯",
        "translation": "translated by imperial edict by the ascetic ministers Dharmagupta and others",
        "source": "T11n0316_038:0879b14_0"
    },
    {
        "source_sentence": "勝慧波羅蜜多品第十一之六",
        "translation": "Eleventh and Sixth Chapter of the Perfection of Supreme Wisdom",
        "source": "T11n0316_038:0879b15_0"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_038:0879b16_0"
    },
    {
        "source_sentence": "略說菩薩一種聖道，謂是菩薩於阿耨多羅三藐三菩提單己無二，以自勇猛大精進力深心攝受，",
        "translation": "“In sum, the holy path of enlightening beings is one kind: they embrace unexcelled, complete perfect enlightenment by means of their own determination and great energy.",
        "source": "T11n0316_038:0879b16_1"
    },
    {
        "source_sentence": "不藉他緣及他開示，而自成辦極大力用，能被如是堅固甲冑。",
        "translation": "They don't rely on other conditions or other teachings, but they themselves accomplish their extremely powerful function, and they can wear such a strong armor.",
        "source": "T11n0316_038:0879b18_2"
    },
    {
        "source_sentence": "而諸有情難得能得，諸新發意住菩薩乘未得今得。",
        "translation": "It's difficult for sentient beings to attain, and those newly awakened bodhisattvas who abide in the bodhisattva vehicle have yet to attain it now.",
        "source": "T11n0316_038:0879b19_3"
    },
    {
        "source_sentence": "又復一切難施能施，持戒、忍辱、精進、禪定、勝慧亦復如是。",
        "translation": "Again, it's likewise with all the things that are difficult to give and can be given, such as observing precepts, patience, effort, meditation, and superior wisdom.",
        "source": "T11n0316_038:0879b21_4"
    },
    {
        "source_sentence": "又於波羅蜜多無能建立者，而是菩薩於諸波羅蜜多悉能建立。",
        "translation": "Also, there's no one who can establish the perfections, but a bodhisattva can establish all the perfections.",
        "source": "T11n0316_038:0879b22_5"
    },
    {
        "source_sentence": "以要言之，乃至廣大覺悟種諸善根無能及者，於是法行單己無二，詣菩提場坐金剛座摧伏魔力，",
        "translation": "To sum up, there's no one who can match the vastly enlightened cultivation of good roots, so he practices this teaching alone without duality, goes to the site of enlightenment, sits on the adamantine throne, and subdues the demonic power of Māra.",
        "source": "T11n0316_038:0879b23_6"
    },
    {
        "source_sentence": "一剎那頃勝慧相應，於阿耨多羅三藐三菩提果決定平等無復退轉。",
        "translation": "Concomitant with superior wisdom in a single moment of time, it's certain that the fruit of unsurpassed, correct, and complete enlightenment will be equal without further retrogression.",
        "source": "T11n0316_038:0879b26_7"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_038:0879b27_8"
    },
    {
        "source_sentence": "是名菩薩摩訶薩於勝慧波羅蜜多獲得菩薩聖道善巧。",
        "translation": "This is called a bodhisattva-mahāsattva who attains the skillfulness of the noble bodhisattva path in the perfection of superior wisdom.",
        "source": "T11n0316_038:0879b27_9"
    },
    {
        "source_sentence": "「云何菩薩緣生善巧？",
        "translation": "How does a bodhisattva give rise to skillful means by relying on conditions?",
        "source": "T11n0316_038:0879c01_0"
    },
    {
        "source_sentence": "謂此菩薩於晝夜中獨處宴坐發善尋伺，蘊由何起？",
        "translation": "It means that this bodhisattva sits alone in meditation day and night to give rise to good discursive thought, so where did the aggregate arise?",
        "source": "T11n0316_038:0879c01_1"
    },
    {
        "source_sentence": "當由何力？",
        "translation": "By what power?",
        "source": "T11n0316_038:0879c02_2"
    },
    {
        "source_sentence": "謂由如是不如理作意發生無明，無明緣行，行緣識，識緣名色，名色緣六入，",
        "translation": "It means that ignorance is the cause for the six āyatanṉas, namely saskāra and nāmarūpa.",
        "source": "T11n0316_038:0879c02_3"
    },
    {
        "source_sentence": "六入緣觸，觸緣受，受緣愛，愛緣取，取緣有，有緣生，生緣老死憂悲苦惱及隨煩惱方便集起。",
        "translation": "The six sense-fields take contact as supporting object, sensation as supporting object, feeling as supporting object, thirst as supporting object, craving as supporting object, grasping as supporting object, existence as supporting object, birth as supporting object, old age and death as supporting object, sorrow and suffering as supporting object, pain and vexation as supporting object",
        "source": "T11n0316_038:0879c04_4"
    },
    {
        "source_sentence": "又復由如是法無體、無作及無主宰，謂善因、惡因、無記因一切緣生。",
        "translation": "Furthermore, it is also because such factors are without essence, without doing anything and without sovereignty: that is to say, they arise by virtue of all conditions as causes for good, bad, or neutral causes.",
        "source": "T11n0316_038:0879c06_5"
    },
    {
        "source_sentence": "又諸有情各有分量，謂根因、增上根因、業因、果因、有無邊際究竟等因，",
        "translation": "Sentient beings each have their own specific limitations: they are the causes of faculties, the causes of higher faculties, the causes of action, the causes of results, and the boundless ultimate causes.",
        "source": "T11n0316_038:0879c08_6"
    },
    {
        "source_sentence": "一切集生而皆了知。",
        "translation": "All the accumulations and births are all known.",
        "source": "T11n0316_038:0879c09_7"
    },
    {
        "source_sentence": "此說是名緣生善巧。",
        "translation": "This teaching is called the skillfulness of conditioned arising.",
        "source": "T11n0316_038:0879c10_8"
    },
    {
        "source_sentence": "又復蘊滅，當云何滅？",
        "translation": "Also, when the aggregates cease, how will they cease?",
        "source": "T11n0316_038:0879c10_9"
    },
    {
        "source_sentence": "謂不如理作意滅則無明滅，無明滅則行滅，行滅則識滅，識滅則名色滅，",
        "translation": "When there is cessation of non-rational attention, there is cessation of nescience; when there is cessation of nescience, there is cessation of volition; when there is cessation of volition, there is cessation of consciousness; and when there is cessation of consciousness, there is cessation of name and form.",
        "source": "T11n0316_038:0879c11_10"
    },
    {
        "source_sentence": "名色滅則六入滅，六入滅則觸滅，觸滅則受滅，受滅則愛滅，愛滅則取滅，",
        "translation": "When name and form cease, the six sense-fields cease; when the six sense-fields cease, contact ceases; when contact ceases, sensation ceases; when sensation ceases, craving ceases; and when craving ceases, grasping ceases.",
        "source": "T11n0316_038:0879c12_11"
    },
    {
        "source_sentence": "取滅則有滅，有滅則生滅，生滅則老死憂悲苦惱滅，而於此中得如是智。",
        "translation": "When grasping ceases, there's cessation; when there's cessation, birth ceases; and when birth ceases, old age, grief, sorrow, pain, and vexation cease, and they attain such knowledge here.",
        "source": "T11n0316_038:0879c14_12"
    },
    {
        "source_sentence": "又緣生善巧者，謂一切法繫屬因緣之所和合，即能加持無我、無人、無眾生、無壽者，",
        "translation": "Also, the skillfulness of conditioned arising refers to the conjunction of all dharmas that are bound by causes and conditions, which enables them to maintain selflessness, no person, no sentient being, and no life.",
        "source": "T11n0316_038:0879c16_13"
    },
    {
        "source_sentence": "於如是等得無計度。",
        "translation": "In such things, they attain the absence of conceptualization.",
        "source": "T11n0316_038:0879c18_14"
    },
    {
        "source_sentence": "而諸菩薩於此緣生，復能建立一切佛法及菩提相，於有盡滅應妙觀察，",
        "translation": "But the enlightening beings are also able to establish all the characteristics of buddhahood and enlightenment by means of these conditions—they should contemplate endless extinction.",
        "source": "T11n0316_038:0879c18_15"
    },
    {
        "source_sentence": "於無盡滅攝化有情。",
        "translation": "In the inexhaustible cessation, he collects and transforms sentient beings.",
        "source": "T11n0316_038:0879c20_16"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_038:0879c20_17"
    },
    {
        "source_sentence": "菩薩摩訶薩於勝慧波羅蜜多。",
        "translation": "Bodhisattvas, mahāsattvas, and bodhisattvas attain the perfection of superior wisdom.",
        "source": "T11n0316_038:0879c20_18"
    },
    {
        "source_sentence": "獲得如是緣生善巧。",
        "translation": "They attain such conditions that give rise to skillful means.",
        "source": "T11n0316_038:0879c21_19"
    },
    {
        "source_sentence": "「云何菩薩一切法善巧？",
        "translation": "“What is enlightening beings’ skill in all truths?",
        "source": "T11n0316_038:0879c23_0"
    },
    {
        "source_sentence": "一切法者，謂有為、無為。",
        "translation": "All dharmas are conditioned and unconditioned.",
        "source": "T11n0316_038:0879c23_1"
    },
    {
        "source_sentence": "而諸菩薩於有為、無為善巧，應如是知。",
        "translation": "But bodhisattvas should thus know the skillfulness of both conditioned and unconditioned.",
        "source": "T11n0316_038:0879c24_2"
    },
    {
        "source_sentence": "有為善巧者，謂身語意所有善行，觀察有為菩提向一切智，是名有為善巧。",
        "translation": "Conditioned skillful means the good practices of body, speech, and thought that observe conditioned enlightenment and lead to omniscience. This is called conditioned skillfulness.",
        "source": "T11n0316_038:0879c24_3"
    },
    {
        "source_sentence": "又有為善巧者，謂積集布施、持戒、忍辱、精進、禪定五種波羅蜜多；",
        "translation": "Also conditioned skillful means accumulating the five kinds of perfections: generosity, morality, patience, effort, and meditation.",
        "source": "T11n0316_038:0879c26_4"
    },
    {
        "source_sentence": "若復於勝慧波羅蜜多得無為智，於五波羅蜜多亦無棄捨，善求一切波羅蜜多，",
        "translation": "“Furthermore, if one attains unconditioned knowledge regarding the transcendent wisdom of liberation, he does not abandon the five transcendent ways and skillfully seeks all the transcendent ways.",
        "source": "T11n0316_038:0879c28_5"
    },
    {
        "source_sentence": "信解無漏菩提向一切智，是名無為善巧。",
        "translation": "To believe and understand that uncontaminated enlightenment leads to omniscience, which is called the skillfulness of nonexistence.",
        "source": "T11n0316_038:0879c29_6"
    },
    {
        "source_sentence": "又有為善巧者，謂於有情行四攝事無所對遣，雖復攝受有情而實攝受、無我無人；",
        "translation": "Also, there is another kind of skillful means that they do not reject the four methods of taking care of sentient beings in terms of their activities. Although they take care of sentient beings, they are actually taken care of them; they have no self and no one else.",
        "source": "T11n0316_038:0880a01_7"
    },
    {
        "source_sentence": "於攝事善巧亦無所取，信解無為菩提向一切智，是名無為善巧。",
        "translation": "Being skillful in gathering things, not grasping anything, and believing in unconditioned enlightenment and heading for omniscience is called unconditioned skillfulness.",
        "source": "T11n0316_038:0880a03_8"
    },
    {
        "source_sentence": "又復有為善巧者，謂斷諸行相續繫縛，即斷輪回及煩惱縛，於菩提相有所任持相續繫縛微細方分而不集行，",
        "translation": "Also, there is another conditioned skillful means to abandon the successive fetters of conditioned states. That is, by eliminating the fetters of transmigration and the fetters of defilement, one has a supporting characteristic of enlightenment that acts as a subtle directional part of the successive fetters of the fetters of continuation but does not accumulate actions.",
        "source": "T11n0316_038:0880a05_9"
    },
    {
        "source_sentence": "此說是名有為善巧。",
        "translation": "This teaching is called conditioned skillfulness.",
        "source": "T11n0316_038:0880a07_10"
    },
    {
        "source_sentence": "若復於空、無相、無願，以智伺察善解諸法因緣，修菩提行而不取證無為，",
        "translation": "“Furthermore, if they cultivate the practice of enlightenment but do not apprehend and realize nonexistence in regard to emptiness, signlessness, or wishlessness, by means of knowledge and insight they examine and understand the causes and conditions of all phenomena.",
        "source": "T11n0316_038:0880a08_11"
    },
    {
        "source_sentence": "是名無為善巧。",
        "translation": "This is called the skillfulness of nonproductivity.",
        "source": "T11n0316_038:0880a09_12"
    },
    {
        "source_sentence": "又復雖行三界而不為三界煩惱之所繫著，是名有為善巧。",
        "translation": "Also, even though they practice the three realms, they aren't bound by the afflictions of the three realms, which is called conditioned skillfulness.",
        "source": "T11n0316_038:0880a10_13"
    },
    {
        "source_sentence": "若以智了知出離三界，而不離三界亦無墮落，是名無為善巧。",
        "translation": "If someone knows with knowledge that they're free of the three realms, but aren't free of the three realms and don't fall into them, this is called unconditional skillfulness.",
        "source": "T11n0316_038:0880a11_14"
    },
    {
        "source_sentence": "若說一切法善巧，即一切智悉是增語。",
        "translation": "If someone explains the skillfulness of all dharmas, that's when all cognition is fully augmented speech.",
        "source": "T11n0316_038:0880a12_15"
    },
    {
        "source_sentence": "若於一切智通達圓滿無所損減，說此勝慧善巧，是即名為一切法善巧。",
        "translation": "If someone explains the skillfulness of this superior wisdom when they fully understand all cognition without any loss or gain, this is called the skillfulness of all dharmas.",
        "source": "T11n0316_038:0880a13_16"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_038:0880a15_17"
    },
    {
        "source_sentence": "諸菩薩摩訶薩安住勝慧波羅蜜多行時，於勝慧分獲得如是十種善巧。」",
        "translation": "When bodhisattvas and mahāsattvas abide in the practice of the perfection of superior wisdom, they attain these ten kinds of skillfulness in the aspect of superior wisdom.",
        "source": "T11n0316_038:0880a15_18"
    },
    {
        "source_sentence": "佛告舍利子：「云何勝慧？",
        "translation": "The Buddha told Śāriputra, What's superior wisdom?",
        "source": "T11n0316_038:0880a18_0"
    },
    {
        "source_sentence": "云何波羅蜜多？",
        "translation": "What is the perfection?",
        "source": "T11n0316_038:0880a18_1"
    },
    {
        "source_sentence": "勝慧者，謂觀察了知善不善法，是名勝慧。",
        "translation": "Superlative wisdom means to observe and understand good and unskillful qualities, which is called superior wisdom.",
        "source": "T11n0316_038:0880a18_2"
    },
    {
        "source_sentence": "分別無量如實法門，是名勝慧。",
        "translation": "Discriminating the immeasurable true dharma-gate is called superior wisdom.",
        "source": "T11n0316_038:0880a19_3"
    },
    {
        "source_sentence": "通達諸見得無礙法，是名勝慧。",
        "translation": "To comprehend all views and attain unobstructed dharmas is called superior wisdom.",
        "source": "T11n0316_038:0880a20_4"
    },
    {
        "source_sentence": "安住一切正願而實捨諸願求，是名勝慧。",
        "translation": "Abiding in all right vows and really abandoning the vow to seek them is called superior wisdom.",
        "source": "T11n0316_038:0880a21_5"
    },
    {
        "source_sentence": "離諸熱惱而得輕安，是名勝慧。",
        "translation": "Being free of fever and torment and attaining ease is called superior wisdom.",
        "source": "T11n0316_038:0880a22_6"
    },
    {
        "source_sentence": "斷諸攀緣得大法樂，是名勝慧。",
        "translation": "To stop clinging to conditions and attain great happiness in the Dharma is called superior wisdom.",
        "source": "T11n0316_038:0880a22_7"
    },
    {
        "source_sentence": "隨義觀察，是名勝慧。",
        "translation": "Observing it according to its meaning is called superior wisdom.",
        "source": "T11n0316_038:0880a23_8"
    },
    {
        "source_sentence": "得住一切菩提分法，是名勝慧。",
        "translation": "Attaining and abiding in all the factors of enlightenment is called superior wisdom.",
        "source": "T11n0316_038:0880a24_9"
    },
    {
        "source_sentence": "於相無相如實了知，是名勝慧。",
        "translation": "Knowing marks and signlessness as they really are is called superior wisdom.",
        "source": "T11n0316_038:0880a24_10"
    },
    {
        "source_sentence": "以智照解諸法體性，是名勝慧。",
        "translation": "To illuminate and understand the essence of dharmas with knowledge is called superior wisdom.",
        "source": "T11n0316_038:0880a25_11"
    },
    {
        "source_sentence": "超諸險難獲無障礙，是名勝慧。",
        "translation": "Beyond the dangers and difficulties that are difficult to attain without obstruction, this is called superior wisdom.",
        "source": "T11n0316_038:0880a26_12"
    },
    {
        "source_sentence": "攝受正達，是名勝慧。",
        "translation": "This is called superior wisdom that collects and correctly understands.",
        "source": "T11n0316_038:0880a26_13"
    },
    {
        "source_sentence": "於諸善法使得清淨，是名勝慧。",
        "translation": "To make the good qualities pure is called superior wisdom.",
        "source": "T11n0316_038:0880a27_14"
    },
    {
        "source_sentence": "斷煩惱習，是名勝慧。",
        "translation": "To stop the accumulation of afflictions is called superior wisdom.",
        "source": "T11n0316_038:0880a28_15"
    },
    {
        "source_sentence": "由先修證一切善法，是名勝慧。",
        "translation": "Because they first cultivate and realize all good qualities, this is called superior wisdom.",
        "source": "T11n0316_038:0880a28_16"
    },
    {
        "source_sentence": "於自然生等而起覺悟引導遠離，是名勝慧。",
        "translation": "To give rise to enlightenment and guide it away from naturally arising and so forth is called superior wisdom.",
        "source": "T11n0316_038:0880a29_17"
    },
    {
        "source_sentence": "不著三界，是名勝慧。",
        "translation": "Not being attached to the three realms, this is called superior wisdom.",
        "source": "T11n0316_038:0880b01_18"
    },
    {
        "source_sentence": "於諸聖願相續不斷，是名勝慧。",
        "translation": "The unceasing continuity of the noble vows is called superior wisdom.",
        "source": "T11n0316_038:0880b01_19"
    },
    {
        "source_sentence": "以諸無相伏除遍計對治清淨，是名勝慧。",
        "translation": "To subdue pervasively discriminated antidotes with marklessness and purify them is called superior wisdom.",
        "source": "T11n0316_038:0880b02_20"
    },
    {
        "source_sentence": "離諸闇鈍成就一切相應行地，是名勝慧。",
        "translation": "Being free of darkness and dullness and accomplishing all the associated stages of practice is called superior wisdom.",
        "source": "T11n0316_038:0880b03_21"
    },
    {
        "source_sentence": "於一切智智住光明道，是名勝慧。",
        "translation": "In omniscience and knowledge, he abides in the path of light, which is called superior wisdom.",
        "source": "T11n0316_038:0880b04_22"
    },
    {
        "source_sentence": "於無明闇蔽作諸明眼，是名勝慧。",
        "translation": "Being blinded by the darkness of ignorance and creating the eye of insight is called superior wisdom.",
        "source": "T11n0316_038:0880b05_23"
    },
    {
        "source_sentence": "如是信解得無漏眼根，是名勝慧。",
        "translation": "Such faith and understanding that attains the uncontaminated eye faculty is called superior wisdom.",
        "source": "T11n0316_038:0880b05_24"
    },
    {
        "source_sentence": "於眼境道超諸勝義，是名勝慧。",
        "translation": "The path that transcends the ultimate meaning in terms of the eye and objects is called superior wisdom.",
        "source": "T11n0316_038:0880b06_25"
    },
    {
        "source_sentence": "真實出離不動調伏，是名勝慧。",
        "translation": "Being truly liberated and unmoving and disciplined is called superior wisdom.",
        "source": "T11n0316_038:0880b07_26"
    },
    {
        "source_sentence": "照智慧門無有窮盡，是名勝慧。",
        "translation": "To illuminate the gate of wisdom without limit is called superior wisdom.",
        "source": "T11n0316_038:0880b08_27"
    },
    {
        "source_sentence": "遍一切處無有相違，是名勝慧。",
        "translation": "Pervading all places without contradiction is called superior wisdom.",
        "source": "T11n0316_038:0880b08_28"
    },
    {
        "source_sentence": "於解脫道而常高顯，是名勝慧。",
        "translation": "Being always lofty and prominent in the path of liberation is called superior wisdom.",
        "source": "T11n0316_038:0880b09_29"
    },
    {
        "source_sentence": "離諸煩惱及障礙法悉不共住，是名勝慧。",
        "translation": "Being free of all the afflictions and obstructive dharmas that are not shared, this is called superior wisdom.",
        "source": "T11n0316_038:0880b10_30"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_038:0880b11_31"
    },
    {
        "source_sentence": "諸菩薩以如是勝慧，而能入解一切有情心之所趣、業行差別諸塵勞門，",
        "translation": "Enlightening beings, by means of such superior wisdom, are able to enter and understand the mental states of all sentient beings, the distinctions in actions and deeds of all kinds of worldly afflictions.",
        "source": "T11n0316_038:0880b11_32"
    },
    {
        "source_sentence": "乃至以如是慧於執持門，而能遍知一切聲聞、辟支佛、三藐三佛陀，此說是名勝慧。",
        "translation": "It's called superior wisdom because it can pervasively know all śrāvakas, pratyekbuddhas, and samyak-saṃbuddhas with such wisdom in the approach of appropriation.",
        "source": "T11n0316_038:0880b13_0"
    },
    {
        "source_sentence": "而諸菩薩於是句義一切當學。",
        "translation": "The bodhisattvas then explain the meaning of these words in terms that all should be studied.",
        "source": "T11n0316_038:0880b14_1"
    },
    {
        "source_sentence": "「又舍利子！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0316_038:0880b15_2"
    },
    {
        "source_sentence": "波羅蜜多者，謂是勝慧了知一切善不善法，名波羅蜜多。",
        "translation": "The perfection refers to the superior wisdom of knowing all good and unskillful qualities, which is called the perfection.",
        "source": "T11n0316_038:0880b15_3"
    },
    {
        "source_sentence": "以要言之，乃至於是句義一切當學，名波羅蜜多。",
        "translation": "To summarize, it's called the perfection of all things that should be learned in terms of words and meanings up to this point.",
        "source": "T11n0316_038:0880b17_4"
    },
    {
        "source_sentence": "又復於菩薩行殊勝圓滿，名波羅蜜多。",
        "translation": "Furthermore, it's called the perfection of bodhisattva practice that's superior and complete.",
        "source": "T11n0316_038:0880b18_5"
    },
    {
        "source_sentence": "一切智智圓滿，名波羅蜜多。",
        "translation": "When omniscience and knowledge are perfected, it's called the perfection of wisdom.",
        "source": "T11n0316_038:0880b19_6"
    },
    {
        "source_sentence": "於有為無為法悉無所著，名波羅蜜多。",
        "translation": "The absence of any attachment to conditioned or unconditioned dharmas is called the perfection.",
        "source": "T11n0316_038:0880b19_7"
    },
    {
        "source_sentence": "為令覺悟輪回過失，名波羅蜜多。",
        "translation": "In order to awaken the transmigration of faults, it's called the perfection of enlightenment.",
        "source": "T11n0316_038:0880b20_8"
    },
    {
        "source_sentence": "普能顯示無盡法藏，名波羅蜜多。",
        "translation": "Being able to universally display the inexhaustible store of the Dharma is called the perfection.",
        "source": "T11n0316_038:0880b21_9"
    },
    {
        "source_sentence": "離諸攀緣解脫圓滿，名波羅蜜多。",
        "translation": "Being free of the fulfillment of liberation from clinging, it's called the pāramitā.",
        "source": "T11n0316_038:0880b22_10"
    },
    {
        "source_sentence": "於布施、持戒、忍辱、精進、禪定、勝慧普令覺悟，名波羅蜜多。",
        "translation": "It's called the perfection of generosity, observance of precepts, forbearance, effort, meditation, and superior wisdom that universally bring enlightenment.",
        "source": "T11n0316_038:0880b22_11"
    },
    {
        "source_sentence": "究竟善巧，於有情界引導一切，為令圓滿無生法忍至不退地，名波羅蜜多。",
        "translation": "The perfection of skillfulness, guiding all sentient beings in the realm of sentient beings and causing them to perfect the forbearance of the nonarising of dharmas up to the stage of nonretrogression is called the perfection.",
        "source": "T11n0316_038:0880b24_12"
    },
    {
        "source_sentence": "圓滿佛剎化度有情，至菩提場除諸魔怨，獲得圓滿一切佛法，名波羅蜜多。",
        "translation": "Perfecting the buddha bases, transforming sentient beings, reaching the site of enlightenment to remove Māra's enemies, and attaining the fulfillment of all the Buddha's teachings are called the perfections.",
        "source": "T11n0316_038:0880b25_13"
    },
    {
        "source_sentence": "又能如是建立大乘菩薩藏正法，名波羅蜜多。",
        "translation": "They can also thus establish the true teaching of the great vehicle bodhisattva store, which is called the perfection.",
        "source": "T11n0316_038:0880b27_14"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_038:0880b28_15"
    },
    {
        "source_sentence": "而諸菩薩於正法藏如是學已得至彼岸，是故於此大乘一切波羅蜜多，當如是學。",
        "translation": "Because bodhisattvas have thus trained in the true store of the Dharma, they've reached the other shore; therefore, they should thus train in all the perfections of this great vehicle.",
        "source": "T11n0316_038:0880b28_16"
    },
    {
        "source_sentence": "「又舍利子！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0316_038:0880c02_0"
    },
    {
        "source_sentence": "若善男子善女人，於此菩薩藏正法受持讀誦，廣大開示、為他人說，而能獲得十種稱讚功德。",
        "translation": "If good men and good women receive, retain, recite, extensively reveal, and teach the right teaching of this bodhisattva's store, they'll attain ten kinds of praiseworthy merit.",
        "source": "T11n0316_038:0880c02_1"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T11n0316_038:0880c04_2"
    },
    {
        "source_sentence": "一者過是生已而得通達一切事業，二者得生聖族，三者具大名稱，四者所說言辭人喜信受，",
        "translation": "One, they attain mastery of all works after having been produced; two, they are born in a holy family; three, they have great repute; and four, the words they utter are liked by those who believe.",
        "source": "T11n0316_038:0880c04_3"
    },
    {
        "source_sentence": "五者得大富饒，六者人天愛敬，七者獲轉輪王，八者得生梵世，九者(梵本元闕)，",
        "translation": "The fifth is to attain great prosperity, the sixth is to be loved and respected by humans and gods, the seventh is to attain the status of wheel-turning king, the eighth is to be born in the Brahma world, and the ninth (the original Sanskrit text is missing),",
        "source": "T11n0316_038:0880c06_4"
    },
    {
        "source_sentence": "十者遍一切處得菩提心無有退失。",
        "translation": "Tenth, he pervades all places to attain the mind of enlightenment without any retrogression.",
        "source": "T11n0316_038:0880c08_5"
    },
    {
        "source_sentence": "又復獲得十種稱讚功德。",
        "translation": "They'll also attain ten kinds of praiseworthy merit.",
        "source": "T11n0316_038:0880c09_6"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T11n0316_038:0880c09_7"
    },
    {
        "source_sentence": "一者與尼乾陀等得不共住，二者不起我見，三者不起人見，四者不起眾生見，",
        "translation": "One, they don't live in common with Nirgrantha and so forth. Two, they don't give rise to views of self, three don't give rise to views of person, and four don't give rise to views of sentient beings.",
        "source": "T11n0316_038:0880c10_8"
    },
    {
        "source_sentence": "五者不起壽者見，六者不起常見，七者不起斷見，八者捨諸玩好，九者發淨信心常樂出家，",
        "translation": "The fifth is that they do not give up views of longevity; the sixth does not give up views of permanence; the seventh does not give up views of annihilation; the eighth abandons all pleasures; and the ninth develops pure faith and always delights in leaving home.",
        "source": "T11n0316_038:0880c11_9"
    },
    {
        "source_sentence": "十者於名句文速得悟入。",
        "translation": "Ten, they quickly awaken to and enter names, phrases, and words.",
        "source": "T11n0316_038:0880c13_10"
    },
    {
        "source_sentence": "又復獲得十種稱讚功德。",
        "translation": "They'll also attain ten kinds of praiseworthy merit.",
        "source": "T11n0316_038:0880c14_11"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T11n0316_038:0880c15_12"
    },
    {
        "source_sentence": "一者正念，二者聰利，三者總持，四者勝慧，五者剎那具足，六者得宿住念，",
        "translation": "The first is right mindfulness; the second is intelligence; the third is omniscience; the fourth is transcendent wisdom; the fifth is endowed with moment-to-moment [wisdom]; and the sixth attains recollection of past lives.",
        "source": "T11n0316_038:0880c15_13"
    },
    {
        "source_sentence": "七者性少貪欲，八者性少瞋恚，九者性少愚癡，十者不為熾然三毒之所燒煮。",
        "translation": "The seventh is the absence of desire by nature, the eighth is the absence of anger by nature, the ninth is the absence of folly by nature, and the tenth is the absence of being burned or cooked by the three poisons of blazing fire.",
        "source": "T11n0316_038:0880c17_0"
    },
    {
        "source_sentence": "又復獲得十種稱讚功德。",
        "translation": "They'll also attain ten kinds of praiseworthy merit.",
        "source": "T11n0316_038:0880c18_1"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T11n0316_038:0880c19_2"
    },
    {
        "source_sentence": "一者希有勝慧，二者輕捷勝慧，三者猛利勝慧，四者極迅速勝慧，五者廣大勝慧，",
        "translation": "They are (1) rare superior wisdom, (2) light superior wisdom, (3) intense superior wisdom, (4) extremely swift superior wisdom, and (5) vast superior wisdom.",
        "source": "T11n0316_038:0880c19_3"
    },
    {
        "source_sentence": "六者甚深勝慧，七者決擇勝慧，八者無礙勝慧，九者現前得見如來能以伽陀歌詠讚歎，",
        "translation": "The sixth is their profound superior wisdom. The seventh is their discerning superior wisdom. The eighth is their unhindered superior wisdom.",
        "source": "T11n0316_038:0880c21_4"
    },
    {
        "source_sentence": "十者復與如來深心問答。",
        "translation": "Tenth, it's also a profound question and answer with the Tathāgata.",
        "source": "T11n0316_038:0880c23_5"
    },
    {
        "source_sentence": "又復獲得十種稱讚功德。",
        "translation": "They'll also attain ten kinds of praiseworthy merit.",
        "source": "T11n0316_038:0880c24_6"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T11n0316_038:0880c24_7"
    },
    {
        "source_sentence": "一者謂能將護諸惡知識，二者解諸魔縛，三者破諸魔軍，四者斷諸惑染，",
        "translation": "The first is to be able to lead and protect evil companions. The second is to free them from the bondage of demons. The third is to vanquish the armies of demons. The fourth is to cut off the defilements of all passions.",
        "source": "T11n0316_038:0880c24_8"
    },
    {
        "source_sentence": "五者於諸行中除伏憍慢，六者趣諸善道，七者向涅槃門，八者布施受施超諸輪轉，",
        "translation": "The fifth is to remove self-conceit in all practices. The sixth is to proceed on good paths. The seventh is to turn toward the gate of nirvana. The eighth is to give generosity and receive charity, transcending all states of cyclic existence.",
        "source": "T11n0316_038:0880c26_9"
    },
    {
        "source_sentence": "九者於菩薩道一切隨學，十者隨順諸佛一切教勅。",
        "translation": "The ninth is to follow and study all the bodhisattva paths, and the tenth is to follow all the teachings of the buddhas.",
        "source": "T11n0316_038:0880c28_10"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_038:0880c29_11"
    },
    {
        "source_sentence": "於菩薩藏正法，應當受持讀誦，廣大開示、為他人說，悉獲如是稱讚功德。」",
        "translation": "In the bodhisattva store of the right teaching, they should memorize and recite it, extensively reveal it, and explain it to others, and they'll all attain such praiseworthy merit.",
        "source": "T11n0316_038:0880c29_12"
    },
    {
        "source_sentence": "「諸有大智者，　　善了文句義，",
        "translation": "“Those of great knowledge understand the meaning of words, phrases, and syllables",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　持此經中王，　　獲無量勝慧。",
        "translation": "The king who preserves this sūtra Will attain immeasurable superior wisdom.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　彼比丘法師，　　常行是法施，",
        "translation": "That monk, the teacher of the Dharma, Always practices this giving of the Dharma.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　持此經中王，　　最勝生歡喜，",
        "translation": "The king who preserves this sutra Supremely rejoices.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　為諸聽法者，　　宣說如是法。",
        "translation": "For the sake of those who listen to the teaching, he teaches such a teaching.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　持此經中王，　　獲歎美功德，",
        "translation": "The king who preserves this sūtra Praises the virtue of praise.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　得是勝慧已，　　於法無損減。",
        "translation": "Having attained this superior wisdom, there's no loss or gain in the Dharma.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　復於勝念力，　　能演無上句，",
        "translation": "Again, by the power of supreme mindfulness They can utter unexcelled words:",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　善說法要者，　　常讚佛教勅。",
        "translation": "Those who well explain the essentials of the Dharma always praise Buddhist commands.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　持此經中王，　　多聞常具足，",
        "translation": "The king who holds this sutra is well-versed and always fully endowed.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　聞已受持者，　　不著於文字。",
        "translation": "Those who have heard it and retain it don't cling to words.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　隨義常觀察，　　增長佛智慧，",
        "translation": "Observing always according to meaning, They increase the Buddha’s knowledge and wisdom.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　由智慧無邊，　　深達勝義諦。",
        "translation": "Because of his boundless wisdom, he deeply comprehends the ultimate truth.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　宣布詣十方，　　聞是獲稱讚，",
        "translation": "Having proclaimed this, he went to the ten directions and heard it praised.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　又令貪恚癡，　　由斯皆漸少。",
        "translation": "It also causes craving, ill-will, and delusion to all gradually diminish.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　最上清淨心，　　聞是獲稱讚，",
        "translation": "The supremely pure mind hears this and receives praise.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　受用資具中，　　稱量如實義。",
        "translation": "Among the necessities that are received and used, they are measured according to their true meaning.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　曉了非真實，　　捨家求解脫，",
        "translation": "Knowing that it’s not true, they leave home and seek liberation.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　樂住空閑處，　　聞法常無厭。",
        "translation": "Pleasantly abiding in a lonely place, they always hear the Dharma without tire.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　諮問世尊所，　　法施無有悋，",
        "translation": "I'll consult the Bhagavān, and there's no dispute about giving the Dharma.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "　令智慧增長，　　清白無減失。」",
        "translation": "Causing wisdom to grow, there's no loss of purity and whiteness.",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "爾時世尊欲重明斯義說伽陀曰：爾時世尊說是偈已，告舍利子：「此諸菩薩於勝慧波羅蜜多之行，",
        "translation": "At that time the World-honored One, wanting to elaborate on the meaning of this further, spoke these verses: Having uttered these verses, the World-honored One said to Śāriputra:",
        "source": "T11n0316_038:0881a02_13"
    },
    {
        "source_sentence": "應當勇猛以四攝事，於長夜中攝受有情。",
        "translation": "You should be courageous and use the four methods of gathering in sentient beings to take care of them for a long time.",
        "source": "T11n0316_038:0881a26_14"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_038:0881a27_15"
    },
    {
        "source_sentence": "所謂布施、愛語、利行、同事，是名四種。",
        "translation": "The so-called generosity, loving words, beneficial actions, and fellow practitioners are called four kinds.",
        "source": "T11n0316_038:0881a27_16"
    },
    {
        "source_sentence": "云何布施？",
        "translation": "What's generosity?",
        "source": "T11n0316_038:0881a28_17"
    },
    {
        "source_sentence": "謂財施、法施及無畏施。",
        "translation": "It's generosity with possessions, generosity with the Dharma, and generosity without fear.",
        "source": "T11n0316_038:0881a28_18"
    },
    {
        "source_sentence": "云何愛語？",
        "translation": "What's loving words?",
        "source": "T11n0316_038:0881a29_19"
    },
    {
        "source_sentence": "謂於聞法者出柔順語。",
        "translation": "It means to speak softly and gently to someone who hears the teaching.",
        "source": "T11n0316_038:0881a29_20"
    },
    {
        "source_sentence": "云何利行？",
        "translation": "What are the beneficial practices?",
        "source": "T11n0316_038:0881b01_0"
    },
    {
        "source_sentence": "謂於自他意樂圓滿。",
        "translation": "It's the fulfillment of one's own and others' intentions.",
        "source": "T11n0316_038:0881b01_1"
    },
    {
        "source_sentence": "云何同事？",
        "translation": "What's co-worker?",
        "source": "T11n0316_038:0881b01_2"
    },
    {
        "source_sentence": "謂於是智起功德想，攝受有情安住是法。",
        "translation": "It means that this knowledge gives rise to the perception of merit and takes in sentient beings who abide in this teaching.",
        "source": "T11n0316_038:0881b01_3"
    },
    {
        "source_sentence": "又布施者，謂於一切來求丐者意極清淨。",
        "translation": "Also, generosity means that the mind of all those who come to ask for a beggar is extremely pure.",
        "source": "T11n0316_038:0881b02_4"
    },
    {
        "source_sentence": "愛語者，斷諸合集。",
        "translation": "affectionate words are cutting off the conjunctions and collections.",
        "source": "T11n0316_038:0881b03_5"
    },
    {
        "source_sentence": "利行者，使無退屈。",
        "translation": "Those who practice for profit are those who don't regress.",
        "source": "T11n0316_038:0881b04_6"
    },
    {
        "source_sentence": "同事者，迴向大乘。",
        "translation": "Co-workers are those who dedicate themselves back to the great vehicle.",
        "source": "T11n0316_038:0881b04_7"
    },
    {
        "source_sentence": "又布施者，隨轉大慈心無遺惜。",
        "translation": "Also, a donor follows the great compassion that's cultivated without stinginess.",
        "source": "T11n0316_038:0881b05_8"
    },
    {
        "source_sentence": "愛語者，隨心喜捨。",
        "translation": "Someone who speaks lovingly follows the mind's joy and equanimity.",
        "source": "T11n0316_038:0881b05_9"
    },
    {
        "source_sentence": "利行者，為諸有情身心勇悍被大甲冑。",
        "translation": "Those who practice for the benefit of sentient beings are armed with great armor for the sake of their physical and mental courage.",
        "source": "T11n0316_038:0881b06_10"
    },
    {
        "source_sentence": "同事者，心捨高下向一切智。",
        "translation": "A fellow practitioner's mind abandons high and low and heads for omniscience.",
        "source": "T11n0316_038:0881b07_11"
    },
    {
        "source_sentence": "又布施者，如法追求捨諸資具。",
        "translation": "Also, generosity refers to pursuing and abandoning necessities according to the teaching.",
        "source": "T11n0316_038:0881b07_12"
    },
    {
        "source_sentence": "愛語者，導以正法。",
        "translation": "Someone who speaks lovingly will guide them to the right teaching.",
        "source": "T11n0316_038:0881b08_13"
    },
    {
        "source_sentence": "利行者，自利利他悉起平等。",
        "translation": "Beneficent practice means that equality arises for self-benefiting and benefitting others.",
        "source": "T11n0316_038:0881b08_14"
    },
    {
        "source_sentence": "同事者，利諸有情咸共發起一切智心。",
        "translation": "Coworkers are those who jointly give rise to the mind of omniscience for the benefit of all sentient beings.",
        "source": "T11n0316_038:0881b09_15"
    },
    {
        "source_sentence": "又布施者，自捨一切若內外法。",
        "translation": "Also, generosity is the self-abandonment of all internal and external dharmas.",
        "source": "T11n0316_038:0881b10_16"
    },
    {
        "source_sentence": "愛語者，於諸法行功德智慧善權稱讚。",
        "translation": "Someone who speaks lovingly praises the virtues, merits, wisdom, and goodness of Dharma practices.",
        "source": "T11n0316_038:0881b11_17"
    },
    {
        "source_sentence": "利行者，棄自所利隨轉利他。",
        "translation": "Those who practice for profit abandon their own profit and follow it to benefit others.",
        "source": "T11n0316_038:0881b12_18"
    },
    {
        "source_sentence": "同事者，成熟菩提，譬彼掌中菴摩勒果，普施一切得無怯弱。",
        "translation": "The fellow practitioner ripens enlightenment, resembling the fruit of ambrosia in his palm and bestows it on all who attain nonweakness.",
        "source": "T11n0316_038:0881b12_19"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_038:0881b15_0"
    },
    {
        "source_sentence": "法施者，謂如其所聞為他人說。",
        "translation": "Giving the Dharma is speaking for others according to what they have heard.",
        "source": "T11n0316_038:0881b15_1"
    },
    {
        "source_sentence": "愛語者，謂正開示無所希望。",
        "translation": "Someone who speaks lovingly means to correctly reveal that there's nothing to hope for.",
        "source": "T11n0316_038:0881b16_0"
    },
    {
        "source_sentence": "利行者，為他演說不生疲厭。",
        "translation": "A beneficial practitioner explains for others and doesn't become weary.",
        "source": "T11n0316_038:0881b16_1"
    },
    {
        "source_sentence": "同事者，於一切智樂甚深法心無棄捨。",
        "translation": "The fellow practitioner doesn't abandon the profound mind of all knowledge and happiness in the Dharma.",
        "source": "T11n0316_038:0881b17_2"
    },
    {
        "source_sentence": "又法施者，於來聽法者說無散亂。",
        "translation": "Also, a donor of the Dharma is someone who teaches without confusion to those who come and listen to the Dharma.",
        "source": "T11n0316_038:0881b18_3"
    },
    {
        "source_sentence": "愛語者，遠至他方演說諸法。",
        "translation": "Someone who speaks lovingly explains the teachings from a distance to others.",
        "source": "T11n0316_038:0881b19_0"
    },
    {
        "source_sentence": "利行者，為法義故於諸法師以飲食衣服臥具醫藥乃至以身覆護一切給侍。",
        "translation": "For the sake of the meaning of the teaching, he protects all his attendants with food, drink, clothing, bedding, and medicine for the sake of the Dharma teacher.",
        "source": "T11n0316_038:0881b19_1"
    },
    {
        "source_sentence": "同事者，為令薰習安住種性。",
        "translation": "Co-workers are the seed nature of causing perfuming to abide in peaceful abiding.",
        "source": "T11n0316_038:0881b21_2"
    },
    {
        "source_sentence": "又法施者，於諸施中無有過上。",
        "translation": "Also, a donor of the Dharma has nothing more to offer than that.",
        "source": "T11n0316_038:0881b22_3"
    },
    {
        "source_sentence": "愛語者，分別義利。",
        "translation": "affectionate words are discriminating meanings and benefits.",
        "source": "T11n0316_038:0881b22_4"
    },
    {
        "source_sentence": "利行者，謂隨於義不隨文句。",
        "translation": "Beneficent practice means following the meaning and not following the words.",
        "source": "T11n0316_038:0881b23_5"
    },
    {
        "source_sentence": "同事者，為令圓滿一切佛法。",
        "translation": "Coworkers are those who work together to perfect all the Buddha's teachings.",
        "source": "T11n0316_038:0881b23_6"
    },
    {
        "source_sentence": "又布施者，是即布施波羅蜜多。",
        "translation": "Also, generosity refers to the perfection of generosity.",
        "source": "T11n0316_038:0881b24_7"
    },
    {
        "source_sentence": "愛語者，是即持戒忍辱波羅蜜多。",
        "translation": "affectionate speech is the perfection of observing precepts and tolerating humility.",
        "source": "T11n0316_038:0881b25_8"
    },
    {
        "source_sentence": "利行者，是即精進波羅蜜多。",
        "translation": "The beneficial practice is the perfection of effort.",
        "source": "T11n0316_038:0881b25_9"
    },
    {
        "source_sentence": "同事者，是即禪定、勝慧波羅蜜多。",
        "translation": "The fellow practitioner is the perfection of meditation and superior wisdom.",
        "source": "T11n0316_038:0881b26_10"
    },
    {
        "source_sentence": "又布施者，是即最初發心菩薩。",
        "translation": "Also, generosity is the first bodhisattva who arouses the mind.",
        "source": "T11n0316_038:0881b27_11"
    },
    {
        "source_sentence": "愛語者，是即行勝解行菩薩。",
        "translation": "A bodhisattva who loves words is a bodhisattva who practices the practice of superior understanding.",
        "source": "T11n0316_038:0881b28_12"
    },
    {
        "source_sentence": "利行者，是即不退轉地菩薩。",
        "translation": "Those who practice for profit are bodhisattvas in the stage of nonretrogression.",
        "source": "T11n0316_038:0881b28_13"
    },
    {
        "source_sentence": "同事者，是即一生補處菩薩。",
        "translation": "A co-worker is a bodhisattva who lives one lifetime in a supplementary place.",
        "source": "T11n0316_038:0881b29_14"
    },
    {
        "source_sentence": "又布施者，是即住菩提根。",
        "translation": "Also, generosity is abiding in the faculty of enlightenment.",
        "source": "T11n0316_038:0881c01_0"
    },
    {
        "source_sentence": "愛語者，是即長菩提芽。",
        "translation": "affectionate words are the sprouts of enlightenment that grow.",
        "source": "T11n0316_038:0881c01_1"
    },
    {
        "source_sentence": "利行者，是即開菩提花。",
        "translation": "To practice for profit is to bloom the flower of enlightenment.",
        "source": "T11n0316_038:0881c02_2"
    },
    {
        "source_sentence": "同事者，是即結菩提果。",
        "translation": "To work together is to form the fruit of enlightenment.",
        "source": "T11n0316_038:0881c02_3"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_038:0881c04_0"
    },
    {
        "source_sentence": "是故諸菩薩摩訶薩於長夜中以四攝事攝受有情，於菩提行諸波羅蜜多而能隨轉，",
        "translation": "Therefore, the bodhisattvas and mahāsattvas take in sentient beings during the long night by means of the four methods of gathering in sentient beings and are able to follow them along with the perfections of enlightenment practice.",
        "source": "T11n0316_038:0881c04_1"
    },
    {
        "source_sentence": "於此復有無量無邊諸攝事等。」",
        "translation": "Again, there are measureless and limitless ways to gather things here.",
        "source": "T11n0316_038:0881c06_2"
    },
    {
        "source_sentence": "爾時佛告舍利子：「彼大蘊如來、應供、正等正覺，為精進行太子於菩提道悉正開示，",
        "translation": "It was then that the Buddha addressed Śāriputra, The great aggregate-tathāgata, Worthy of Offerings, and Completely Enlightened One, Prince Jīvaka, correctly revealed the path to enlightenment for the sake of energy.",
        "source": "T11n0316_038:0881c07_0"
    },
    {
        "source_sentence": "及過去未來現在諸佛世尊之所稱讚。",
        "translation": "It's praised by the world-honored buddhas of the past, future, and present.",
        "source": "T11n0316_038:0881c08_1"
    },
    {
        "source_sentence": "時精進行太子於彼佛所，得聞如是菩提正道及聞三世諸佛世尊之所稱讚，",
        "translation": "At that buddha, the prince Jīvaka had heard of this true path of enlightenment and heard it praised by the Buddhas of the past, present, and future.",
        "source": "T11n0316_038:0881c09_2"
    },
    {
        "source_sentence": "快得善利發大歡喜，復於彼佛及諸大聲聞眾，於九十九俱胝歲，以飲食衣服臥具醫藥供養、恭敬尊重讚歎。",
        "translation": "They'll quickly attain good benefits and become greatly joyous, and then they'll offer food, drink, clothing, bedding, medicine, offerings, respect, veneration, and praise to those buddhas and great śrāvakas when they're ninety-nine years old.",
        "source": "T11n0316_038:0881c11_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_038:0881c14_0"
    },
    {
        "source_sentence": "彼大蘊如來、應供、正等正覺，即時與授阿耨多羅三藐三菩提記。」",
        "translation": "That great aggregate tathāgata, Worthy of Offerings, and Completely Awakened One will immediately give him the assurance of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_038:0881c14_1"
    },
    {
        "source_sentence": "佛說大乘菩薩藏正法經卷第三十八",
        "translation": "Foshuo daishi pusa zhengfa jing, vol. 38",
        "source": "T11n0316_038:0881c16_0"
    }
]