[
    {
        "source_sentence": "佛說大乘菩薩藏正法經卷第三",
        "translation": "Foshuo daishi pusa zhengfa jing, vol. 3",
        "source": "T11n0316_031:0861c22_0"
    },
    {
        "source_sentence": "十一",
        "translation": "eleven",
        "source": "T11n0316_031:0861c23_0"
    },
    {
        "source_sentence": "西天譯經三藏銀青光祿大夫",
        "translation": "translated scriptures of the Western Heavens, Tripiṭaka Master銀青光祿大夫",
        "source": "T11n0316_031:0861c25_0"
    },
    {
        "source_sentence": "試光祿卿慈覺傳梵大師賜紫",
        "translation": "試光祿卿慈覺傳梵大師賜紫",
        "source": "T11n0316_031:0861c26_0"
    },
    {
        "source_sentence": "沙門臣法護等奉　詔譯",
        "translation": "translated by imperial edict by the ascetic ministers Dharmagupta and others",
        "source": "T11n0316_031:0861c27_0"
    },
    {
        "source_sentence": "精進波羅蜜多品第九之七",
        "translation": "ninth and seventh parts of the chapter on the perfection of effort",
        "source": "T11n0316_031:0861c28_0"
    },
    {
        "source_sentence": "「爾時！",
        "translation": "At that point!",
        "source": "T11n0316_031:0861c29_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0861c29_1"
    },
    {
        "source_sentence": "彼正法行童子為成熟善根故，於二十歲發生淨信，捨家出家成苾芻相，",
        "translation": "In order to mature his good roots, that boy of right teaching and practice had developed pure faith when he was twenty years old, renounced the householder’s life, renounced domestic life, and became a bhikṣu.",
        "source": "T11n0316_031:0861c29_2"
    },
    {
        "source_sentence": "受具足戒，住阿蘭若大樹林中而為宴坐。",
        "translation": "Accepting the full set of precepts, he stayed in the great forest of Ārāṇya and sat in meditation.",
        "source": "T11n0316_031:0862a01_3"
    },
    {
        "source_sentence": "於虛空中有諸賢聖，潛來教示如是義利，語苾芻言：『汝於菩薩藏正法得不退轉精進之行，",
        "translation": "In space, there were wise and holy beings who came in vain to show such benefits. They said to the bhikṣus: You have attained the practice of unregressing zeal toward the true-dharma of the bodhisattva collection.",
        "source": "T11n0316_031:0862a02_4"
    },
    {
        "source_sentence": "有大名稱當得作佛。』",
        "translation": "If there's a great reputation, he'll become a buddha.'",
        "source": "T11n0316_031:0862a04_5"
    },
    {
        "source_sentence": "時彼苾芻於賢聖所聞是語已生大歡喜，得未曾有，乃於城邑聚落國土王宮在在處處一切人民，",
        "translation": "Having heard these words, the bhikṣu was greatly delighted and rejoiced. He attained such an unprecedented experience that all the inhabitants of towns, villages, kingdoms, palaces, cities, and other",
        "source": "T11n0316_031:0862a05_6"
    },
    {
        "source_sentence": "如是尋求菩薩藏正法。",
        "translation": "Thus, they seek the right teaching of the bodhisattva store.",
        "source": "T11n0316_031:0862a07_7"
    },
    {
        "source_sentence": "又復往詣僧伽藍中，恭敬禮問苾芻苾芻尼眾：『云何名為菩薩藏正法？",
        "translation": "Again, he went to the saṃghârāma and venerated the monks and nuns with respect and asked them, 'What's called the right teaching of the bodhisattva collection?'",
        "source": "T11n0316_031:0862a08_8"
    },
    {
        "source_sentence": "菩薩於阿闍梨及佛法中，復何承事親近修學？",
        "translation": "How does a bodhisattva serve, become intimate with, and cultivate the ācārya and the Buddha's teachings?",
        "source": "T11n0316_031:0862a09_9"
    },
    {
        "source_sentence": "我今欲於諸尊者所尋求菩薩藏正法，若名若字而來聽受。』",
        "translation": "Now, I want to seek out the right teaching of the bodhisattva store that's sought by the venerable ones and listen to it with names and words.'",
        "source": "T11n0316_031:0862a10_10"
    },
    {
        "source_sentence": "彼苾芻等答如是言：『非我所知。』",
        "translation": "Those monks and others answered in this way, saying, 'It's not known to me.'",
        "source": "T11n0316_031:0862a12_11"
    },
    {
        "source_sentence": "又竊作是念：『彼賢聖言應無虛妄。",
        "translation": "Again, he thought to himself, 'That good man's words shouldn't be false.",
        "source": "T11n0316_031:0862a12_12"
    },
    {
        "source_sentence": "我於菩薩藏正法未曾聽受，於不退精進復何修行？』",
        "translation": "I've never heard or accepted the true teaching of the bodhisattva store, so how could I cultivate it with unregressing effort?'",
        "source": "T11n0316_031:0862a13_13"
    },
    {
        "source_sentence": "轉復問言：『具壽尊者！",
        "translation": "Again, he asked, 'Venerable Kauśinagara!",
        "source": "T11n0316_031:0862a14_14"
    },
    {
        "source_sentence": "彼蓮花超勝如來住何方所？",
        "translation": "Where did that lotus flower transcendent Tathāgata live?",
        "source": "T11n0316_031:0862a15_15"
    },
    {
        "source_sentence": "願賜開示。』",
        "translation": "May I be given the opportunity to reveal it?'",
        "source": "T11n0316_031:0862a15_16"
    },
    {
        "source_sentence": "答言：『苾芻！",
        "translation": "He replied, 'Monks!",
        "source": "T11n0316_031:0862a16_17"
    },
    {
        "source_sentence": "蓮花超勝如來住是方所。』",
        "translation": "This is the place where the lotus flower transcends the Tathāgata's abode.'",
        "source": "T11n0316_031:0862a16_18"
    },
    {
        "source_sentence": "即時往詣所示方所，到已右繞三匝頭面禮足，住立佛前發如是言：『我今於此結加敷坐，",
        "translation": "Having arrived there, he circumambulated the Buddha three times to his right. After venerating him by bowing his forehead at his feet, he stood before the Buddha and said: I now sit cross-legged here.",
        "source": "T11n0316_031:0862a17_0"
    },
    {
        "source_sentence": "於蓮花超勝如來不得聞是菩薩藏正法，於是方所誓不起立。』",
        "translation": "In the Lotus Sugata Tathāgata, the Tathāgata won't hear this bodhisattva collection of the right teaching, so he doesn't stand up where he vows.'",
        "source": "T11n0316_031:0862a19_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0862a20_2"
    },
    {
        "source_sentence": "此苾芻七晝夜中於地方所不退精進，如是堅固過七晝夜，以佛神力乃見東方世界寶藏如來、應供、正等正覺，",
        "translation": "For seven days and nights, this bhikṣu did not turn back from his efforts in the locality; for seven days and nights he remained steadfast like this. After passing through seven days and nights, by the supernatural power of the Buddha",
        "source": "T11n0316_031:0862a20_3"
    },
    {
        "source_sentence": "聞彼開演八種法門。",
        "translation": "He hears them expound eight kinds of teachings.",
        "source": "T11n0316_031:0862a23_4"
    },
    {
        "source_sentence": "此八種法門，能於菩薩藏正法隨順修學。",
        "translation": "These eight kinds of dharma-gates enable one to follow and study the true doctrine of the bodhisattva collection.",
        "source": "T11n0316_031:0862a23_5"
    },
    {
        "source_sentence": "時彼苾芻具足聞是不可思議八種法門無有過上，即於方所從坐而起，亦能於菩薩藏正法開演不退轉精進之行，",
        "translation": "That monk then had heard these inconceivable eight kinds of teaching, without exception. Having risen from his seat in that direction, he was also able to expound the practice of unregressing zeal toward the true teaching of the enlightening",
        "source": "T11n0316_031:0862a24_6"
    },
    {
        "source_sentence": "復於城邑聚落國土王宮滿六十年教化無量俱胝天人令住三乘。",
        "translation": "For another sixty years, he taught measureless corpuscles and gods in cities, villages, lands, kingdoms, and palaces to live in the three vehicles.",
        "source": "T11n0316_031:0862a27_7"
    },
    {
        "source_sentence": "時彼苾芻臨命終時，作是願言：『生諸佛剎人同分中。』",
        "translation": "When that monk reaches the end of his life, he makes this vow, saying, 'Birth among the buddha-stage people in the same class.'",
        "source": "T11n0316_031:0862a28_8"
    },
    {
        "source_sentence": "於彼沒已生閻浮提洲長者族中。",
        "translation": "After he disappears, he'll be born among the elders of Jambudvīpa.",
        "source": "T11n0316_031:0862a29_9"
    },
    {
        "source_sentence": "如是生已，乃發是言行正法行。",
        "translation": "After such a birth, they then initiate this practice of speaking and practicing the right teaching.",
        "source": "T11n0316_031:0862b01_10"
    },
    {
        "source_sentence": "以是因緣，同彼往昔名正法行。",
        "translation": "Because of these causes and conditions, they're the same as those in the past who were called practicing the right teaching.",
        "source": "T11n0316_031:0862b02_11"
    },
    {
        "source_sentence": "發生淨信捨家出家，成苾芻相受具足戒。",
        "translation": "He gives rise to pure faith, abandons home and leaves home, becomes a bhikṣu, and receives the full set of precepts.",
        "source": "T11n0316_031:0862b03_12"
    },
    {
        "source_sentence": "出家未久，復於菩薩藏正法現前安住。",
        "translation": "Not long after leaving home, he returned to the bodhisattva collection of the true teaching and settled there.",
        "source": "T11n0316_031:0862b04_13"
    },
    {
        "source_sentence": "於六萬歲，城邑聚落國土王宮及能開演菩薩藏正法之行，教化無量俱胝天人成熟三乘，",
        "translation": "At the age of sixty thousand years, cities, towns, villages, kingdoms, palaces, and those who were able to expound the practice of the enlightening being’s store of true doctrine taught immeasurable buddha-te",
        "source": "T11n0316_031:0862b04_14"
    },
    {
        "source_sentence": "所謂聲聞乘、緣覺乘、無上大乘。",
        "translation": "It's called the śrāvaka vehicle, the pratyekabuddha vehicle, and the unsurpassed great vehicle.",
        "source": "T11n0316_031:0862b07_0"
    },
    {
        "source_sentence": "臨命終時復發誓言，由彼願力，於閻浮提洲得獲人身，王族中生。",
        "translation": "At the end of his life, he then made another vow, saying, By the power of that vow, I'll be born among the king's people in Jambudvīpa.",
        "source": "T11n0316_031:0862b07_1"
    },
    {
        "source_sentence": "剎那生已，於虛空中賢聖告言：『汝有情界超越諸法。』",
        "translation": "After the moment had arisen, the good and noble ones in space told him, 'You sentient beings transcend all dharmas.'",
        "source": "T11n0316_031:0862b09_2"
    },
    {
        "source_sentence": "以是緣故立彼名字為超越諸法成熟有情。",
        "translation": "It's because of these conditions that they establish their names to transcend all dharmas and ripen sentient beings.",
        "source": "T11n0316_031:0862b10_3"
    },
    {
        "source_sentence": "於二十年中發生正信捨家出家，為苾芻相受具足戒。",
        "translation": "For 20 years, he cultivated right faith and renounced home and left home, and he received the full set of precepts for the monk's sake.",
        "source": "T11n0316_031:0862b11_4"
    },
    {
        "source_sentence": "超越諸法正念緣力，於菩薩藏正法現前安住。",
        "translation": "By transcending the power of the right mindfulness of dharmas as causes and conditions, he's presently abiding in the bodhisattva collection of right teachings.",
        "source": "T11n0316_031:0862b12_5"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0862b13_6"
    },
    {
        "source_sentence": "此超越諸法苾芻，於菩薩藏正法斷諸疑惑，於城邑聚落國土王宮復能開演滿六萬歲。",
        "translation": "This monk who transcends all dharmas stops doubts about the bodhisattva's store of the right teaching and ends doubts, and he can continue to expound it for 60,000 years in cities, villages, lands, kingdoms,",
        "source": "T11n0316_031:0862b13_7"
    },
    {
        "source_sentence": "過是數已，令無量俱胝天人阿脩羅等發阿耨多羅三藐三菩提心。",
        "translation": "After that number, they cause measureless koṭīs of gods, humans, asuras, and so forth to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_031:0862b15_8"
    },
    {
        "source_sentence": "臨命終時復發願言：『得獲人身。』",
        "translation": "When he died, he again made a vow, saying, 'I'll attain my human body.'",
        "source": "T11n0316_031:0862b17_9"
    },
    {
        "source_sentence": "於閻浮提洲大娑羅長者種族中生。",
        "translation": "He was born in the great elder's family on Jambudvīpa.",
        "source": "T11n0316_031:0862b18_10"
    },
    {
        "source_sentence": "剎那生已，空中有聲，賢聖告言：『汝有情界得獲正念。』",
        "translation": "After a moment had passed, there was a sound in the air that said, 'Good men and gods told him, 'You sentient beings have attained right mindfulness.'",
        "source": "T11n0316_031:0862b18_11"
    },
    {
        "source_sentence": "以是緣故立彼名字為得正念成熟有情。",
        "translation": "It's because of these causes that they establish their names in order to attain right mindfulness and ripen sentient beings.",
        "source": "T11n0316_031:0862b20_12"
    },
    {
        "source_sentence": "於二十年中，發生正信捨家出家，成苾芻相受具足戒。",
        "translation": "For 20 years, he cultivated right faith, renounced home and left home, became a monk, and received the full set of precepts.",
        "source": "T11n0316_031:0862b21_13"
    },
    {
        "source_sentence": "由彼往昔如實思念最上最勝成就多聞，六十年中說法教化。",
        "translation": "Because they had truly thought of the past as the highest and most excellent accomplishment of many learnings, they taught and transformed themselves by teaching for 60 years.",
        "source": "T11n0316_031:0862b22_14"
    },
    {
        "source_sentence": "於城邑聚落國土王宮，今諸有情於菩薩藏正法，復能開演斷諸疑惑。",
        "translation": "In cities, towns, villages, lands, kingdoms, and palaces, now sentient beings can again reveal the right teaching of the bodhisattva store and cut off doubt and confusion.",
        "source": "T11n0316_031:0862b23_15"
    },
    {
        "source_sentence": "又過是數，教化四俱胝天人阿脩羅等成熟三乘，所謂聲聞乘、緣覺乘、無上智佛乘。",
        "translation": "Beyond this number, he teaches the four corpuscles, gods, humans, asuras, and so forth to ripen the three vehicles, which are called the śrāvaka vehicle, pratyekabuddha vehicle, and the unsurpassed wisdom buddha vehicle.",
        "source": "T11n0316_031:0862b25_16"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0862b27_17"
    },
    {
        "source_sentence": "此正法行苾芻發是願已即時命終，生於往昔彼地方所寶藏如來佛剎之中。",
        "translation": "After making this vow, this monk who practices the right teaching will immediately die and be born in the Tathāgata Buddha's buddha-stage of the jeweled store tathāgata buddha temple where he lived in that place in the past.",
        "source": "T11n0316_031:0862b27_18"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0862b29_19"
    },
    {
        "source_sentence": "彼菩薩摩訶薩令六十俱胝天人阿脩羅等，成熟三乘悉得圓滿。",
        "translation": "That bodhisattva Mahāsattva causes 60 corpuscles of gods, humans, asuras, and so forth to ripen the three vehicles and attain their fullness.",
        "source": "T11n0316_031:0862b29_20"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0862c01_21"
    },
    {
        "source_sentence": "彼菩薩摩訶薩中無間隔，於寶藏如來佛剎之中，得不思議最上最勝多聞具足。",
        "translation": "Among those bodhisattvas and mahāsattvas, there's no gap between them and the jeweled treasury tathāgata buddha bases where they attain the inconceivable, unsurpassed, most excellent, and well-versed",
        "source": "T11n0316_031:0862c02_0"
    },
    {
        "source_sentence": "於彼命終，即時得生蓮花超勝如來世界王族之中。",
        "translation": "At the end of his life, he'll immediately be born among the lotus flower surpassing the Tathāgata world kings and clans.",
        "source": "T11n0316_031:0862c03_1"
    },
    {
        "source_sentence": "往昔教化六十俱胝天人阿脩羅等，悉同生彼而為眷屬。",
        "translation": "In the past, they taught and transformed 60 corpuscles of gods, humans, asuras, and so forth, all being born there together as their followers.",
        "source": "T11n0316_031:0862c05_0"
    },
    {
        "source_sentence": "復於彼時有佛出世，號最上行如來、應供、正等正覺。",
        "translation": "Again, there was a Buddha appearing in the world at that time named Supreme Acting Tathāgata, Worthy of Offerings, and Completely Awakened One.",
        "source": "T11n0316_031:0862c06_1"
    },
    {
        "source_sentence": "彼佛具足壽量八十俱胝歲，彼國人民壽命亦等。",
        "translation": "The Buddha was endowed with a life span of eighty koṭis of years, and the duration of life of the people in that country was the same.",
        "source": "T11n0316_031:0862c07_2"
    },
    {
        "source_sentence": "彼佛有八十俱胝大聲聞眾俱來集會，皆阿羅漢。",
        "translation": "That Buddha had eighty corpuscles of great śrāvakas gathered together, all arhats.",
        "source": "T11n0316_031:0862c08_3"
    },
    {
        "source_sentence": "一一聲聞各有八十俱胝大聲聞眾，皆是清淨大阿羅漢。",
        "translation": "Each of the śrāvakas had eighty corpuscles of great śrāvakas, all pure great arhats.",
        "source": "T11n0316_031:0862c09_4"
    },
    {
        "source_sentence": "復於彼時名勇猛受王童子，多聞成就智慧明達。",
        "translation": "Again, at that point, he's called the boy who's called the king of courageous acceptance, well-versed and accomplished in wisdom and insight.",
        "source": "T11n0316_031:0862c11_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0862c12_1"
    },
    {
        "source_sentence": "時彼童子與自眷屬八十俱胝，同時往詣最上行如來、應供、正等正覺所。",
        "translation": "That boy and his eighty koṭis of followers then went to the supreme practice tathāgata, Worthy of Offerings, and Completely Awakened One at the same time.",
        "source": "T11n0316_031:0862c12_2"
    },
    {
        "source_sentence": "到已頭面禮足，圍繞世尊却住一面。",
        "translation": "When he arrived, he bowed his head and feet, surrounded the Bhagavān, withdrew, and stood to one side.",
        "source": "T11n0316_031:0862c13_3"
    },
    {
        "source_sentence": "時最上行如來知彼童子往昔因緣心之所念，而為說法。」",
        "translation": "Knowing the causes and conditions of that boy's thoughts in the past, the supreme practice tathāgata then taught the Dharma for him.",
        "source": "T11n0316_031:0862c14_4"
    },
    {
        "source_sentence": "爾時世尊告舍利子言：「彼勇猛受王童子得聞如是往昔相應所修之行，",
        "translation": "It was then that the World-honored One said to Śāriputra:",
        "source": "T11n0316_031:0862c17_0"
    },
    {
        "source_sentence": "生大歡喜，與自眷屬八十俱胝同發淨信捨家出家，成苾芻相受具足戒，",
        "translation": "They become greatly joyful and together with their own retinues of eighty koṭis of bhikṣus, they develop pure faith and renounce the householder’s life. They become bhikṣus and receive the full set of precepts.",
        "source": "T11n0316_031:0862c18_1"
    },
    {
        "source_sentence": "盡其形壽常修梵行求菩提道。",
        "translation": "Throughout their physical life, they always cultivate the religious practice and seek the path of enlightenment.",
        "source": "T11n0316_031:0862c20_2"
    },
    {
        "source_sentence": "時最上行如來告諸大眾：『此勇猛受王菩薩摩訶薩，我滅度後次當作佛出現世間，",
        "translation": "The supreme among the buddhas then said to the great assembly, “These enlightening beings and bodhisattvas who have undertaken this heroic undertaking will become buddhas in the world after my nirvana.",
        "source": "T11n0316_031:0862c21_0"
    },
    {
        "source_sentence": "號大精進如來、應供、正等正覺。』",
        "translation": "He's called the Tathāgata of Great Energy, Worthy of Offerings, and Completely Enlightened.'",
        "source": "T11n0316_031:0862c22_1"
    },
    {
        "source_sentence": "彼最上行如來般涅盤後，所有舍利作供養已，受持正法，然後得成阿耨多羅三藐三菩提果。",
        "translation": "After that supreme practitioner Tathāgata's parinirvāṇa, he makes offerings to all the relics he has, retains the right teaching, and then he attains the fruit of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_031:0862c23_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0862c25_3"
    },
    {
        "source_sentence": "彼大精進如來壽量半劫。",
        "translation": "The Tathāgata of Great Energy has a life span of half an eon.",
        "source": "T11n0316_031:0862c26_0"
    },
    {
        "source_sentence": "有無量大聲聞眾，一一復有二十那踰多，皆是清淨大阿羅漢，俱來集會。",
        "translation": "There were an immeasurable number of great śrāvakas, each another twenty nayutas in number, all pure great arhats who came to the assembly.",
        "source": "T11n0316_031:0862c26_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0862c28_2"
    },
    {
        "source_sentence": "此不退轉精進菩薩摩訶薩行精進波羅蜜多行時，於菩薩藏正法聞已次第受持讀誦、為他人說，",
        "translation": "“When these bodhisattvas and mahāsattvas of unregressing effort practice the perfection of effort, they hear the true teaching of the enlightening beings’ treasury of enlightenment, memorize it, recite it, and explain it",
        "source": "T11n0316_031:0862c28_3"
    },
    {
        "source_sentence": "乃至生彼大精進如來世界之中。",
        "translation": "He'll even be born in that world of the great effort-tathāgata.",
        "source": "T11n0316_031:0863a01_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0863a02_5"
    },
    {
        "source_sentence": "若善男子善女人安住大乘，速疾得成阿耨多羅三藐三菩提，不退精進行時，",
        "translation": "If good men and good women abide in the great vehicle and quickly attain unexcelled, perfect enlightenment, they won't regress when they practice with energy.",
        "source": "T11n0316_031:0863a02_6"
    },
    {
        "source_sentence": "於菩薩藏正法決定聽聞受持讀誦，乃至廣為人說。",
        "translation": "They will definitely hear, retain, memorize, and recite the true teaching of the bodhisattva collection, even to the point where they'll explain it widely for others.",
        "source": "T11n0316_031:0863a04_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0316_031:0863a05_8"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0863a05_9"
    },
    {
        "source_sentence": "此諸菩薩摩訶薩唯能於菩薩藏正法如是進求不退轉精進之行。",
        "translation": "These bodhisattvas, mahāsattvas, and bodhisattvas can only thus advance and pursue the right teaching of the bodhisattva collection without retreating from the practice of effort.",
        "source": "T11n0316_031:0863a05_10"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0863a07_11"
    },
    {
        "source_sentence": "是名菩薩摩訶薩精進波羅蜜多。",
        "translation": "This is called the bodhisattva-mahāsattva's perfection of effort.",
        "source": "T11n0316_031:0863a07_12"
    },
    {
        "source_sentence": "禪定波羅蜜多品第十之一",
        "translation": "Chapter 11 of the Eleventh Chapter of the Perfection of Meditation",
        "source": "T11n0316_031:0863a09_0"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_031:0863a10_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩修行進趣菩薩禪定波羅蜜多之行？",
        "translation": "What is the practice of the bodhisattva-mahāsattva who cultivates the perfection of enlightening beings' meditative absorption that advances toward enlightenment?",
        "source": "T11n0316_031:0863a10_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0863a11_2"
    },
    {
        "source_sentence": "菩薩摩訶薩應先遠離染欲過失諸不善法，於彼尋伺發生喜樂，是名入解初禪定行。",
        "translation": "A bodhisattva-mahāsattva should first part with the unwholesome dharmas that are free of defilement, desire, faults, and errors, and give rise to joy and happiness in their discursive examination, which is called",
        "source": "T11n0316_031:0863a11_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0863a13_4"
    },
    {
        "source_sentence": "菩薩摩訶薩次當遠離尋伺，於內引生清淨潔白心一境性，於彼等持發生喜樂，",
        "translation": "“Furthermore, great enlightening beings should be far removed from discursive thought and give rise to the single-realm nature of pure, clean, white mind within themselves that produces joy and happiness in their upholding.",
        "source": "T11n0316_031:0863a13_5"
    },
    {
        "source_sentence": "是名入解二禪定行。",
        "translation": "This is called the practice of entering and understanding the second dhyāna.",
        "source": "T11n0316_031:0863a15_6"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0863a16_7"
    },
    {
        "source_sentence": "菩薩摩訶薩次當捨離貪愛、行念正知，唯妙樂受身雖正知，如彼聖人觀察捨念離喜妙樂行故，",
        "translation": "“Furthermore, great enlightening beings should abandon craving and right knowledge of volition. Although they only have right knowledge of the body that is subtle and blissful, just as those noble people observe equanimity because they are",
        "source": "T11n0316_031:0863a16_8"
    },
    {
        "source_sentence": "是名入解三禪定行。",
        "translation": "This is called the practice of entering and understanding the three meditations.",
        "source": "T11n0316_031:0863a18_9"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0863a18_10"
    },
    {
        "source_sentence": "菩薩摩訶薩次當如是先斷苦樂適悅煩惱，無苦無樂捨念清淨，是名入解四禪定行。",
        "translation": "The bodhisattva Mahāsattva then thus first stops the afflictions of suffering, pleasure, and comfort, and purges the mindfulness of equanimity without suffering or pleasure, which is called the practice of entering and understanding the fourth meditation.",
        "source": "T11n0316_031:0863a19_11"
    },
    {
        "source_sentence": "彼如實得圓滿清淨純一無雜正等引心，無餘支分及隨煩惱，不離等持而能作彼禪定事業，",
        "translation": "They truly attain the perfect, pure, pure, pure, unadulterated, and correctly induced state of mind. Without any remaining members or secondary afflictions, they are able to do this action of meditative absorption without being separated",
        "source": "T11n0316_031:0863a21_12"
    },
    {
        "source_sentence": "而復圓滿五種神通及彼智業。",
        "translation": "They also perfect the five kinds of supernormal abilities and their cognitive actions.",
        "source": "T11n0316_031:0863a23_13"
    },
    {
        "source_sentence": "云何名為五種神通？",
        "translation": "What are these five kinds of supernormal powers?",
        "source": "T11n0316_031:0863a23_14"
    },
    {
        "source_sentence": "一者天眼、二者天耳、三者他心、四者宿住、五者神境，此說名為五種神通。",
        "translation": "The first is the divine eye; the second is the divine ear; the third is the mind of another; the fourth is the abode of former existences; and the fifth is the realm of supernormal powers. These are said to be",
        "source": "T11n0316_031:0863a24_15"
    },
    {
        "source_sentence": "又復云何菩薩於彼天眼乃至神境而能圓滿最上正行神通智業？",
        "translation": "Again, how can a bodhisattva perfect the supremely correct practice of the divine eye and even the spiritual objects of those gods' supernormal abilities and actions?",
        "source": "T11n0316_031:0863a26_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0863a27_1"
    },
    {
        "source_sentence": "此菩薩如實安住正等引心圓滿清淨，純一無雜及隨煩惱，於諸有情心無所欲，",
        "translation": "“These enlightening beings truly abide in equanimity; their minds are perfectly pure, unadulterated and free of afflictions. They have no craving for sentient beings or desire for anything at all.",
        "source": "T11n0316_031:0863a27_2"
    },
    {
        "source_sentence": "而能發起神境等通，此說名為神通智業。",
        "translation": "This is called the action of supernormal knowledge.",
        "source": "T11n0316_031:0863a29_3"
    },
    {
        "source_sentence": "又天眼清淨出過於人，而能觀察諸有情等，初生退沒好醜等相、善趣惡趣勝妙下劣，",
        "translation": "Again, the divine eye is pure and transcends human [vision]. It can see all sentient beings as superior, inferior, excellent, and inferior to those who are born in good or bad states of existence.",
        "source": "T11n0316_031:0863b01_4"
    },
    {
        "source_sentence": "乃至知諸有情業行差別，身語意中具足惡行，起彼邪見誹謗聖賢，而復積集邪見業因，",
        "translation": "They know the differences in actions of sentient beings, and they commit all kinds of evil deeds in body, speech, and thought. They give rise to false views that slander saints and wise ones, yet they also accumulate the",
        "source": "T11n0316_031:0863b03_5"
    },
    {
        "source_sentence": "身謝命終墮於惡趣那落迦中。",
        "translation": "At the end of his life, he'll fall into a bad destiny in Naraka.",
        "source": "T11n0316_031:0863b05_6"
    },
    {
        "source_sentence": "又復知彼諸有情等身語意中具足善行，起彼正見稱讚聖賢，而復積集正見業因，",
        "translation": "“Furthermore, they also know that all those sentient beings are endowed with good deeds in body, speech, and mind, give rise to right view, praise the noble ones, and again accumulate the causes of right view as",
        "source": "T11n0316_031:0863b06_7"
    },
    {
        "source_sentence": "身謝命終生於善趣或生天界。",
        "translation": "At the end of his life, he'll be born in a good destiny or in the heavenly realm.",
        "source": "T11n0316_031:0863b08_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0863b08_1"
    },
    {
        "source_sentence": "以清淨天眼出過於人，於諸有情積集惡業悉能了知。",
        "translation": "With the pure divine eye that surpasses humans, he's able to fully understand the accumulation of bad actions in sentient beings.",
        "source": "T11n0316_031:0863b08_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0863b10_3"
    },
    {
        "source_sentence": "此菩薩摩訶薩清淨天眼，於諸有情而為最勝，色相明了悉無障礙，一切天、龍、夜叉、乾闥婆、阿脩羅，",
        "translation": "“These great enlightening beings’ pure divine eye is supreme among all sentient beings. Their colors and forms are clearly perceived without obstruction by all gods, dragons, yakṣas, gandharvas, asuras",
        "source": "T11n0316_031:0863b10_4"
    },
    {
        "source_sentence": "有學無學大阿羅漢、辟支佛眾，悉勝於彼，最上最勝、最極明了、無有過上。",
        "translation": "The great arhats and pratyekabuddhas of those who have studied and those who have no more to learn are all superior to them, the highest, most excellent, most extremely insightful, and unsurpassed.",
        "source": "T11n0316_031:0863b12_5"
    },
    {
        "source_sentence": "又此天眼，於彼一切出離道中最勝出離。",
        "translation": "Furthermore, this divine eye is the most superior escape of all those paths of liberation.",
        "source": "T11n0316_031:0863b14_6"
    },
    {
        "source_sentence": "而諸菩薩有是天眼，於十方世界無量有情，若麁若細、若勝若劣、若遠若近，",
        "translation": "And yet the enlightening beings have this divine eye that can see infinitely many sentient beings in the worlds of the ten directions, whether gross or subtle, superior or inferior, distant or near.",
        "source": "T11n0316_031:0863b15_7"
    },
    {
        "source_sentence": "而此天眼諸有色相，於彼了知悉無對礙。",
        "translation": "The divine eye perceives all the physical forms without any obstruction.",
        "source": "T11n0316_031:0863b16_8"
    },
    {
        "source_sentence": "又此天眼見色究竟，除無色界，所有十方世界無量有情，若生若滅，及彼業因一切根因，",
        "translation": "“Furthermore, the divine eye of this celestial being sees form ultimately: exception made for the realm of formlessness; there are innumerable sentient beings in all worlds in the ten directions - whether they arise",
        "source": "T11n0316_031:0863b17_9"
    },
    {
        "source_sentence": "若增若減若勝若劣，悉能了知。",
        "translation": "They are able to know whether it increases or decreases, becomes superior or inferior.",
        "source": "T11n0316_031:0863b19_10"
    },
    {
        "source_sentence": "又彼所有十方世界諸佛剎土功德莊嚴，一切悉見。",
        "translation": "Furthermore, all the buddha-lands of the worlds in the ten directions and their adornments of virtue were seen.",
        "source": "T11n0316_031:0863b20_11"
    },
    {
        "source_sentence": "清淨戒蘊安住成就勝妙果報，亦皆了知。",
        "translation": "The aggregate of pure morality, which abides in the accomplishment of the ultimate rewards, is also known.",
        "source": "T11n0316_031:0863b21_12"
    },
    {
        "source_sentence": "又彼清淨天眼出過於人，諸佛世尊及菩薩眾一切悉見，及彼正士正念正知、通達境界威儀道行，",
        "translation": "“Furthermore, the divine eye of purity is superior to human [vision]. All buddhas, world-honored ones, and enlightening beings see it; as well as those who are correctly mindful and correctly cognizant,",
        "source": "T11n0316_031:0863b22_13"
    },
    {
        "source_sentence": "及解脫法得總持門，安住智慧善巧方便，而能入解一切圓滿。",
        "translation": "He's also the gate of attaining the dhāraṇī of the teaching of liberation, abiding in wisdom and skillful means, and being able to enter and understand all perfections.",
        "source": "T11n0316_031:0863b24_14"
    },
    {
        "source_sentence": "彼眼無礙諸色無見，彼眼無著諸色無染，彼眼解脫謂離諸見，彼眼清淨自體光潔，",
        "translation": "Their eyes are unobstructed by forms and have no vision. Their eyes are free from attachment, the forms are free from defilement. The liberation of their eyes is to be freed from all views.",
        "source": "T11n0316_031:0863b26_15"
    },
    {
        "source_sentence": "眼無依止離諸境界，眼無所取離諸煩惱，眼無翳障離諸疑惑，眼不起念離對礙法，",
        "translation": "The eye has no support and is free of objects, the eye has no grasping and is free of afflictions, the eye has no angry hindrances and is free of doubt, the eye doesn’t give rise to thought and is free of obstruct",
        "source": "T11n0316_031:0863b28_16"
    },
    {
        "source_sentence": "眼得光明照燭諸法，眼隨智慧離識境界，彼眼無著離難調伏及彼癡冥一切煩惱。",
        "translation": "When the eye attains light that illuminates dharmas, the eye follows wisdom and is free of the realm of consciousness, and their eyes are unattached, free of difficulties to be subdued, and they're deluded by all",
        "source": "T11n0316_031:0863c01_17"
    },
    {
        "source_sentence": "眼能決擇諸根幻化，又復眼相彼無能勝，於諸有情平等觀矚。",
        "translation": "The eye can discern the illusory transformations of the faculties, and furthermore, the characteristics of the eye are unsurpassed by them, observing all sentient beings equally.",
        "source": "T11n0316_031:0863c02_18"
    },
    {
        "source_sentence": "彼眼清淨離雜思惟，彼眼無垢體性光瑩。",
        "translation": "That eye is pure and free of mixed contemplation, and that eye's unsullied essence shines brightly.",
        "source": "T11n0316_031:0863c04_19"
    },
    {
        "source_sentence": "又彼天眼隨其心意而能現前成熟佛眼，眼無貪瞋離諸違順。",
        "translation": "Also, that divine eye can manifest the ripened Buddha's eye according to their mind and thought, and their eye has no craving or anger and is free of disobedience.",
        "source": "T11n0316_031:0863c05_20"
    },
    {
        "source_sentence": "又彼天眼於義境界修行法式如實相應，又於有情安住大悲。",
        "translation": "Furthermore, that divine eye is truly associated with the cultivation of the Dharma in the meaningful realm and abides in great compassion for sentient beings.",
        "source": "T11n0316_031:0863c06_21"
    },
    {
        "source_sentence": "又彼天眼來求丐者而無不與，見破戒者亦無瞋怒，於墮落者而常守護，",
        "translation": "Also, the divine eye comes to ask for a beggar and doesn't give it away, and when it sees someone who breaks the precepts, it doesn't become angry, and it always guards those who fall into it.",
        "source": "T11n0316_031:0863c08_22"
    },
    {
        "source_sentence": "於懈怠者而常勤策，為散亂者現禪定分，為惡慧者示正慧眼，為邪道者開悟正道，",
        "translation": "To those who are lazy he always exerts himself energetically; to those who are scattered he manifests the state of meditative absorption; to those with bad wisdom he shows the eye of right insight; to those on wrong paths he en",
        "source": "T11n0316_031:0863c09_23"
    },
    {
        "source_sentence": "劣勝解者導以最上佛之知見。",
        "translation": "Those of weak resolve are led by the knowledge and vision of the supreme buddha.",
        "source": "T11n0316_031:0863c11_24"
    },
    {
        "source_sentence": "又彼天眼，於一切智智最上神通，於菩提道專注一境決定現前。",
        "translation": "Also, that divine eye, which is the supreme supernormal power of omniscience and knowledge, focuses on a single object in the path to enlightenment and definitely appears before it.",
        "source": "T11n0316_031:0863c12_25"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0863c13_26"
    },
    {
        "source_sentence": "此名菩薩摩訶薩而能圓滿彼天眼通及智事業。",
        "translation": "This is called a bodhisattva-mahāsattva who can perfect the divine vision, supernormal abilities, and intellectual works of those gods.",
        "source": "T11n0316_031:0863c14_27"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_031:0863c16_0"
    },
    {
        "source_sentence": "云何名菩薩摩訶薩得天耳通及能圓滿最上正行神通智業？",
        "translation": "What's called a bodhisattva-mahāsattva who attains the divine hearing of the divine ear and can perfect the supremely correct practice of supernormal knowledge and actions?",
        "source": "T11n0316_031:0863c16_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_031:0863c17_2"
    },
    {
        "source_sentence": "此菩薩摩訶薩天耳清淨出過於人，能聞十方無量世界人非人聲，所謂天聲、龍聲、夜叉聲、乾闥婆聲、阿脩羅聲、[薩\\/女]嚕拏聲、緊那羅聲、摩睺羅聲、人非人聲，",
        "translation": "“These great enlightening beings’ divine ears are pure and transcend human. They can hear the sounds of gods, dragons, yakṣas, gandharvas, titans, asuras, nāgas, kinnaras, mahoras,",
        "source": "T11n0316_031:0863c17_3"
    },
    {
        "source_sentence": "聖人聲、聲聞聲、緣覺聲、菩薩聲、佛聲，是名諸菩薩摩訶薩天耳清淨。",
        "translation": "The sounds of sages, sounds of śrāvakas, sounds of pratyekbuddhas, sounds of pratyekabuddhas, sounds of bodhisattvas, and sounds of buddhas are called the purity of the divine ears of the bodhi",
        "source": "T11n0316_031:0863c21_4"
    },
    {
        "source_sentence": "又復得聞諸罪業聲，地獄聲、傍生聲、焰摩羅界聲，乃至微細邊際蝴蝶蜂蠆蚊蚋等聲，",
        "translation": "Furthermore, they can hear the sounds of sinful actions, the sounds of hells, animals, and the sounds of the realm of Yama, as well as subtle sounds like butterflies, bees, insects, gnats, mosquitoes",
        "source": "T11n0316_031:0863c22_5"
    },
    {
        "source_sentence": "及諸有情所發語業或攀緣心善不善等，一切了知。",
        "translation": "They know all the verbal actions that sentient beings give rise to, or the good and unskillful mental activities that are conditioned by clinging, etc.",
        "source": "T11n0316_031:0863c24_6"
    },
    {
        "source_sentence": "所發語業善不善根彼因及果，悉皆了知。",
        "translation": "The causes and results of the good and bad roots of verbal action that they give rise to are all known.",
        "source": "T11n0316_031:0863c26_7"
    },
    {
        "source_sentence": "若語業貪隨染愛所表，若語業瞋隨惡罵所表，又語業癡亦隨貪瞋所表，",
        "translation": "If verbal action is manifested by attachment to greed following defiled craving, and if verbal action is manifested by hatred following malice, and verbal action and delusion are also manifested by greed and hatred following.",
        "source": "T11n0316_031:0863c27_8"
    },
    {
        "source_sentence": "皆能了知即語業癡亦隨惡罵所表。",
        "translation": "They can all know that words, actions, and delusion are also manifested by bad verbal abuse.",
        "source": "T11n0316_031:0863c28_9"
    },
    {
        "source_sentence": "若語業唯惡罵所表，即瞋隨惡罵所表，彼語業癡亦即隨癡冥所表，悉能了知。",
        "translation": "If verbal action is only indicated by harsh words, that is to say, by anger and following harsh words; if verbal action and delusion are also expressed by following the darkness of delusion, they can all perceive.",
        "source": "T11n0316_031:0863c29_10"
    },
    {
        "source_sentence": "又天耳通智，如實了知發生善巧，破彼語業、隨順清淨。",
        "translation": "Also, the supernormal knowledge of the divine ear truly knows and develops skillful means to refute their verbal actions and follow their purity.",
        "source": "T11n0316_031:0864a02_11"
    },
    {
        "source_sentence": "由能對破、語業清淨，即能對破一切貪瞋癡等悉令清淨。",
        "translation": "It's because they can oppose and purify verbal actions, which is to say, they can oppose and purify all craving, anger, delusion, and so forth.",
        "source": "T11n0316_031:0864a03_12"
    },
    {
        "source_sentence": "又彼天耳，於聖人非聖人聲悉聽聞。",
        "translation": "Also, that divine ear hears the sounds of sages and non-sages.",
        "source": "T11n0316_031:0864a04_13"
    },
    {
        "source_sentence": "如是聽已，於聖人聲不生住著，於非聖人聲不著對破。",
        "translation": "After listening in this way, they don't become attached to the sounds of noble people and don't become attached to the sounds of non-noble people to counteract their attachment.",
        "source": "T11n0316_031:0864a05_14"
    },
    {
        "source_sentence": "又於聖人聲獲得大慈，於非聖人聲發起大悲。",
        "translation": "Also, they attain great compassion for the sounds of sages and give rise to great compassion for the sounds of non-sages.",
        "source": "T11n0316_031:0864a06_15"
    },
    {
        "source_sentence": "於一切聲無前後際，以決定智如實了知。",
        "translation": "He knows all sounds without any prior or subsequent time periods with certainty and knowledge, as they really are.",
        "source": "T11n0316_031:0864a07_16"
    },
    {
        "source_sentence": "又彼天耳，於十方無餘一切世界，得聞如是諸佛世尊所說妙法。",
        "translation": "With their divine ears, they can hear in all the other worlds in the ten directions such wonderful teachings taught by the buddhas and world-honored ones.",
        "source": "T11n0316_031:0864a08_17"
    },
    {
        "source_sentence": "聞已念彼所度根器，不生癡冥一切攝受，亦無失念。",
        "translation": "After hearing it, he's mindful of the faculties and vessels they save, doesn't give rise to delusion, and takes in all the sensations without losing mindfulness.",
        "source": "T11n0316_031:0864a10_18"
    },
    {
        "source_sentence": "如彼有情根器入解，了知諸法平等一味。",
        "translation": "It's like those sentient beings whose faculties and vessels enter into understanding and perceive the equality of all dharmas with one flavor.",
        "source": "T11n0316_031:0864a11_19"
    },
    {
        "source_sentence": "又復不於一佛二佛所說之法得聽聞已，不作互相障礙差別事相。",
        "translation": "Furthermore, they won't hear the teachings taught by one Buddha or two Buddhas, and they won't create distinctive characteristics that hinder each other.",
        "source": "T11n0316_031:0864a12_20"
    },
    {
        "source_sentence": "佛說大乘菩薩藏正法經卷三十一",
        "translation": "Foshuo dayan pusa zhengfa jing, vol. 31",
        "source": "T11n0316_031:0864a14_0"
    }
]