[
    {
        "source_sentence": "大寶積經卷第四十六",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 46",
        "source": "T11n0310_046:0267c17_0"
    },
    {
        "source_sentence": "大唐三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial edict by the Tripiṭaka Master Xuanzang of the Great Tang dynasty",
        "source": "T11n0310_046:0267c19_0"
    },
    {
        "source_sentence": "菩薩藏會第十二之十二毘利耶波羅",
        "translation": "twelveth and twelfth parts of the bodhisattva collection assembly",
        "source": "T11n0310_046:0267c20_0"
    },
    {
        "source_sentence": "蜜多品第九之二",
        "translation": "ninth and second parts of the category of honey",
        "source": "T11n0310_046:0267c21_0"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0267c22_0"
    },
    {
        "source_sentence": "當來之世法欲滅時，復有菩薩摩訶薩安住大乘行毘利耶波羅蜜多者，見如是等諸惡眾生誹謗毀滅是正法已，",
        "translation": "In the future, when the Dharma is about to be destroyed, there will also be bodhisattvas, mahāsattvas, and bodhisattvas abiding in the great vehicle practice of the vīrya-pāramitā who see that such bad sentient beings denigrate and disparage this right teaching.",
        "source": "T11n0310_046:0267c22_1"
    },
    {
        "source_sentence": "倍增振發勇猛正勤大精進力，於是經典大菩薩藏微妙法門，慇懃聽受書持讀誦，",
        "translation": "To this scripture he recited the subtle teachings of the great treasury of enlightening beings, in which he listened, accepted, wrote, preserved, and read them.",
        "source": "T11n0310_046:0267c24_2"
    },
    {
        "source_sentence": "廣為他人開示演說。",
        "translation": "He explains it extensively for others.",
        "source": "T11n0310_046:0267c26_3"
    },
    {
        "source_sentence": "舍利子，如是菩薩摩訶薩當於爾時應起四想。",
        "translation": "Śāriputra, thus should the bodhisattva Mahāsattva at that point give rise to four thoughts.",
        "source": "T11n0310_046:0267c27_4"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0310_046:0267c28_5"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0267c28_6"
    },
    {
        "source_sentence": "所謂我父寶藏不久當滅，由為此故，佛薄伽梵釋迦牟尼如來、應、正等覺，",
        "translation": "It is said that my father’s treasure-treasury will soon perish. Because of this cause, the Buddha Bhagavat, Brahmā, and Śākyamuni, the Tathāgata, Arhat, Perfectly Enlightened One,",
        "source": "T11n0310_046:0267c28_7"
    },
    {
        "source_sentence": "於百千那庾多拘胝無數大劫，精勤修習難行苦行，方乃獲是正法寶藏。",
        "translation": "Only after diligently cultivating difficult and painful practices for hundreds of thousands of myriads of koṭis of kalpas will I attain this treasury of the treasure of the true teaching.",
        "source": "T11n0310_046:0268a01_8"
    },
    {
        "source_sentence": "是故我當發勤精進，奉持此藏遍持此藏，極當遍持廣通此藏，欲令法寶久不滅故。",
        "translation": "Therefore, I will arouse diligence and make effort to preserve this store and pervade this store. I will greatly pervade and penetrate this store in order to keep the treasure of the Dharma unceasing for a long time.",
        "source": "T11n0310_046:0268a03_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268a04_1"
    },
    {
        "source_sentence": "譬如有人唯有一子，憐念愛重具大福相觀無厭足。",
        "translation": "It's like a person with only one child who has great compassion and love, possesses great merit and observes the characteristics without tire.",
        "source": "T11n0310_046:0268a05_2"
    },
    {
        "source_sentence": "是人後時欲有所趣，而携此子將涉危難，恐顛墜故以手執持，又等遍持極等遍持，",
        "translation": "That person later wishes to have some destination, but carrying this child is about to wade through danger and difficulty. Fearing that he might fall into error, they grasp him with their hands and hold him as pervasively as pervasive as the ultimate omnipotence.",
        "source": "T11n0310_046:0268a06_3"
    },
    {
        "source_sentence": "勿令我子墮險難處。",
        "translation": "Don't let my son fall into a dangerous place.",
        "source": "T11n0310_046:0268a08_4"
    },
    {
        "source_sentence": "如是舍利子！",
        "translation": "So it is, Śāriputra!",
        "source": "T11n0310_046:0268a08_5"
    },
    {
        "source_sentence": "彼善男子亦復如是，深懷奉信敬重於我，不捨如是無上法寶，志恒希求清淨寂滅，",
        "translation": "That good man is also like this: he deeply believes in and respects me, doesn’t give up such an unexcelled treasure of the Dharma, and always wishes to seek purity and tranquility.",
        "source": "T11n0310_046:0268a08_6"
    },
    {
        "source_sentence": "雖經惡世而能攝受最勝正法。",
        "translation": "Even though they've passed through a bad world, they can still take in the most excellent right teaching.",
        "source": "T11n0310_046:0268a10_7"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268a11_8"
    },
    {
        "source_sentence": "我今以此菩提因緣無上正法付囑是人。",
        "translation": "Now, I'll entrust this person with the unsurpassed true teaching of the causes and conditions for enlightenment.",
        "source": "T11n0310_046:0268a11_9"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0268a12_10"
    },
    {
        "source_sentence": "譬如世間大軍戰時，少有眾生為護眾故處於前陣，唯有果敢雄猛丈夫合率驍勇抗拒勍敵，",
        "translation": "It's like when there's a great army in the world and few sentient beings are standing in front of it for the sake of protecting others, but only the fruit-bold heroic man who combines his strength and courage to resist an enemy.",
        "source": "T11n0310_046:0268a12_11"
    },
    {
        "source_sentence": "為護己眾處大軍前振威而住。",
        "translation": "In order to protect himself, he stands in front of the great army and exalts his authority.",
        "source": "T11n0310_046:0268a14_12"
    },
    {
        "source_sentence": "如是舍利子！",
        "translation": "So it is, Śāriputra!",
        "source": "T11n0310_046:0268a15_13"
    },
    {
        "source_sentence": "於當來世正法滅時，壞正法者當現前時，有諸眾生發起深心欣樂寂滅，",
        "translation": "“Furthermore, in the future when the true teaching ceases and those who break it are manifested, there will be sentient beings who give rise to a profound aspiration for cessation.",
        "source": "T11n0310_046:0268a15_14"
    },
    {
        "source_sentence": "而能於是無上法寶，乃至受持少分要義。",
        "translation": "He's able to receive and uphold a small part of the essential meaning of this unsurpassed treasure of the Dharma.",
        "source": "T11n0310_046:0268a17_15"
    },
    {
        "source_sentence": "當知是人亦復如是，被於正勤堅固甲冑，奮發勇猛大精進力，摧碎諸魔所有軍陣。",
        "translation": "You should know that this person is likewise, wearing a correctly diligent and strong armor, he arouses the strength of courage and great zeal to destroy all the Māra's armies.",
        "source": "T11n0310_046:0268a18_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_046:0268a20_17"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268a20_18"
    },
    {
        "source_sentence": "若有眾生於是經典乃至受持一四句頌，不生誹謗隨喜讚歎，言此經典真是佛說，",
        "translation": "If there are any sentient beings who hold to a single four-line verse of this scripture and don't disparage it, rejoice and praise it, saying that this sūtra is really the Buddha's teaching.",
        "source": "T11n0310_046:0268a20_19"
    },
    {
        "source_sentence": "於多人前廣宣顯示者，當知是人即為隨喜讚說去來現在諸佛所說經法。",
        "translation": "You should know that someone who explains it extensively in front of many people will then joyfully praise the sūtras and teachings taught by the buddhas of the past, future, and present.",
        "source": "T11n0310_046:0268a22_20"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268a24_21"
    },
    {
        "source_sentence": "如來不說是人但得少分功德果報，我說是人乃能成就如虛空量大功德聚。",
        "translation": "The Tathāgata doesn't say that this person will only attain the results of a small amount of merit, but I say that such a person can accomplish a great stock of merit as vast as space.",
        "source": "T11n0310_046:0268a24_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_046:0268a26_23"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268a26_24"
    },
    {
        "source_sentence": "我說是等名為善人。",
        "translation": "I say these are called good people.",
        "source": "T11n0310_046:0268a26_25"
    },
    {
        "source_sentence": "如是善人甚為難得，謂知恩者及報恩者。",
        "translation": "Such a good person is very difficult to find, meaning someone who knows kindness and someone who repays kindness.",
        "source": "T11n0310_046:0268a27_26"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268a28_27"
    },
    {
        "source_sentence": "如是知恩及報恩者，當知是為人中珍寶。",
        "translation": "Knowing kindness and repaying kindness in this way, you should know that it's a treasure among people.",
        "source": "T11n0310_046:0268a28_28"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0268a29_29"
    },
    {
        "source_sentence": "於當來世正法滅時，諸惡魔等威勢現時，若有眾生於如來所信重不捨，",
        "translation": "In the future, when the true teaching ceases, bad demons and so forth will manifest their might. If there are sentient beings who believe in what the enlightened one teaches but do not give it up,",
        "source": "T11n0310_046:0268a29_30"
    },
    {
        "source_sentence": "受持是經無有遠離，我說是人第一丈夫，為善丈夫、為勝丈夫、為健丈夫、為大丈夫。",
        "translation": "There's no difference between accepting and upholding this sūtra, saying that person is the first husband, a good husband, a superior husband, a strong husband, or a great man.",
        "source": "T11n0310_046:0268b02_31"
    },
    {
        "source_sentence": "當知是人則為如來勝法朋侶，非為詐現朋惡黨者，當知是人行實行者。",
        "translation": "You should know that this person is a friend of the Tathāgata's superior dharma, not a fraudulent friend or bad party, and you should know that they are people who practice what they really practice.",
        "source": "T11n0310_046:0268b03_32"
    },
    {
        "source_sentence": "如是舍利子！",
        "translation": "So it is, Śāriputra!",
        "source": "T11n0310_046:0268b05_33"
    },
    {
        "source_sentence": "菩薩摩訶薩應當修習堅固正行，乃至命終中無暫廢。",
        "translation": "A bodhisattva-mahāsattva should cultivate resolute right practice that doesn't stop even for a moment at the end of his life.",
        "source": "T11n0310_046:0268b05_34"
    },
    {
        "source_sentence": "於諸佛所當勤衛護，乃至命終中無暫廢。",
        "translation": "They will diligently guard the place where the buddhas are, and they won't abandon it for a moment until the end of their lives.",
        "source": "T11n0310_046:0268b07_35"
    },
    {
        "source_sentence": "於正法所當勤攝受，乃至命終中無暫廢。",
        "translation": "They will diligently take in the true teaching, and they won't abandon it for a moment until the end of their life.",
        "source": "T11n0310_046:0268b08_36"
    },
    {
        "source_sentence": "甚深空法當勤信解，乃至命終中無暫廢。",
        "translation": "The profound teaching of emptiness should be diligently believed and understood, and it won't be abandoned for a moment until the end of his life.",
        "source": "T11n0310_046:0268b09_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268b09_1"
    },
    {
        "source_sentence": "是為菩薩摩訶薩於後惡世所起四法。",
        "translation": "These are the four dharmas that bodhisattvas, mahāsattvas, give rise to in later evil worlds.",
        "source": "T11n0310_046:0268b10_2"
    },
    {
        "source_sentence": "若有成就如是四法菩薩摩訶薩，於當來世法欲盡時、謗正法時、滅正法時、犯戒徒黨大強盛時、熾然追求順世外道惡呪術時、劫濁亂時、有情濁時、壽命濁時、煩惱濁時、諸見濁時，",
        "translation": "If there are bodhisattvas and mahāsattvas who have accomplished these four things, in the future when the Dharma is about to end, when they denigrate the right teaching, when they destroy the right teaching, when their groups of followers who violate precepts are so powerful, when they blazingly pursue the bad spells of worldly non-Buddhist teachings, when the eon",
        "source": "T11n0310_046:0268b11_0"
    },
    {
        "source_sentence": "菩薩摩訶薩當於爾時應住三處而為依止。",
        "translation": "At that point, the bodhisattva Mahāsattva should abide in three places and rely on them.",
        "source": "T11n0310_046:0268b15_1"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T11n0310_046:0268b16_2"
    },
    {
        "source_sentence": "所謂應住阿蘭若處、應住諍息滅處、應住佛菩提處。",
        "translation": "They're called those who should abide in the forested abode, the abode of cessation and extinction, and the abode of enlightenment of buddhas.",
        "source": "T11n0310_046:0268b16_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268b17_4"
    },
    {
        "source_sentence": "是為菩薩摩訶薩當來惡世住於三處，應如是持，是則具足毘利耶波羅蜜多故。」",
        "translation": "These are the three places where bodhisattvas, mahāsattvas, will abide in future bad worlds and should thus maintain them, which is because they'll be fully endowed with the pāramitā of vīrya.",
        "source": "T11n0310_046:0268b17_5"
    },
    {
        "source_sentence": "「於最勝法不遠離，　　為盡生老病死苦，",
        "translation": "Not far from the supreme teaching, To end the suffering of birth, old age, sickness, and death,",
        "source": "T11n0310_046:0268b19_6"
    },
    {
        "source_sentence": "　常勤精進無妄念，　　當速成就自他利。",
        "translation": "Always diligent and energetic, without deluded thoughts, they'll quickly accomplish their own and others' benefits.",
        "source": "T11n0310_046:0268b19_6"
    },
    {
        "source_sentence": "　若有於是善說法，　　聞已安住正思惟，",
        "translation": "If there’s someone who well explains the teaching in this way, After hearing it, they’ll abide in right contemplation.",
        "source": "T11n0310_046:0268b19_6"
    },
    {
        "source_sentence": "　當知我為彼大師，　　彼則是我真弟子。",
        "translation": "You should know that I am their teacher, and they are my true disciples.",
        "source": "T11n0310_046:0268b19_6"
    },
    {
        "source_sentence": "　若不聽聞如是法，　　設聞不住正思惟，",
        "translation": "If someone doesn’t hear such a teaching, Suppose they hear it and don’t correctly contemplate.",
        "source": "T11n0310_046:0268b19_6"
    },
    {
        "source_sentence": "　是人當趣諸惡道，　　猶彼眾流歸大海。",
        "translation": "That person will be destined for bad destinies, just like those streams returning to the ocean.",
        "source": "T11n0310_046:0268b19_6"
    },
    {
        "source_sentence": "　百千拘胝那庾劫，　　諸佛出現甚為難，",
        "translation": "For hundreds of thousands of koṭis of kalpas It will be very difficult for the buddhas To appear.",
        "source": "T11n0310_046:0268b19_6"
    },
    {
        "source_sentence": "　雖復暫遇不親奉，　　當隨惡魔自在轉。",
        "translation": "Even if they temporarily meet someone who doesn't serve them, they'll follow the evil demons and freely turn around.",
        "source": "T11n0310_046:0268b19_6"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說頌曰：「復次舍利子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Furthermore, Śāriputra!",
        "source": "T11n0310_046:0268b19_6"
    },
    {
        "source_sentence": "乃往過去九十一劫，當於爾時有佛出世，名曰勝觀如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、善調御士、天人師、佛、薄伽梵。",
        "translation": "In the past, ninety-one eons ago, a buddha named Vaiśravaṇa Tathāgata, Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Unsurpassed Worthy, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavān appeared in the world.",
        "source": "T11n0310_046:0268b29_7"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268c03_8"
    },
    {
        "source_sentence": "彼佛法中有六苾芻，行諸惡行恒相隨逐：一名善見，二名善樂，三名歡喜，",
        "translation": "In that buddha-dharma, there are six monks who always follow each other in bad behavior: one is called having good views, two are called having good happiness, and three are called being joyous.",
        "source": "T11n0310_046:0268c03_9"
    },
    {
        "source_sentence": "四名調善，五名蘇逾遮，六名火天授。",
        "translation": "The fourth name is tamed and good, the fifth name is suṣe chakra, and the sixth name is fire deva dharma.",
        "source": "T11n0310_046:0268c05_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268c05_1"
    },
    {
        "source_sentence": "是六苾芻恒說非法，有我有人、有常有斷，結固周旋更相信任，趣深隱所同共謀議：『我等應當各各誘化，",
        "translation": "These six bhikṣus always said, “There is a self, there is a personality, there is permanence, and there is annihilation.” The bhikṣus became firmly established in the doctrine of individual salvation and further believed in it. They proceeded on their way into deep seclusion but they held secret discussions among themselves, saying:",
        "source": "T11n0310_046:0268c06_0"
    },
    {
        "source_sentence": "人別百家用為徒黨。",
        "translation": "The people are separated by a hundred families and used as followers.",
        "source": "T11n0310_046:0268c08_1"
    },
    {
        "source_sentence": "又令百家傳告眷屬，如是展轉親姻傳告，或當至於五十百等。』",
        "translation": "It also causes a hundred families to transmit it to their dependents, and thus they'll be transmitted by their relatives in turn, or even up to fifty hundred of them.'",
        "source": "T11n0310_046:0268c08_2"
    },
    {
        "source_sentence": "作是議已便往教化，若村若城郊野店肆，或至王都及餘邦國，一一諸家悉皆往趣。",
        "translation": "After he had this discussion, he went to teach and transform them, either in villages, cities, countryside shops, or the king's capital or other states, and each of those houses all went there.",
        "source": "T11n0310_046:0268c10_3"
    },
    {
        "source_sentence": "既到彼已不說正法，於佛世尊先行毀謗。",
        "translation": "Having arrived there, they won't explain the right teaching, and the Bhagavān will first disparage them.",
        "source": "T11n0310_046:0268c12_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268c13_5"
    },
    {
        "source_sentence": "彼惡苾芻云何毀謗？",
        "translation": "How did that bad monk disparage it?",
        "source": "T11n0310_046:0268c13_6"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268c13_7"
    },
    {
        "source_sentence": "諸惡苾芻告眾人言：『世間決定有我、有眾生、有壽命者、有數取者。",
        "translation": "The evil monks told the crowd, 'There must be a self in the world, sentient beings, a life span, and a number of grasping people.'",
        "source": "T11n0310_046:0268c13_8"
    },
    {
        "source_sentence": "若諸世間定無有我及諸法者，誰去誰來、誰坐誰臥、誰語誰默，誰能行施、誰是所受、誰能受用、誰受苦樂、誰有能受不苦不樂？",
        "translation": "If the world definitely has no self and dharmas, who goes, who comes, who sits, who lies down, who speaks, who is silent, who can practice generosity, who receives it, who can use it, who experiences pain and pleasure, and who has the ability to experience neither pain nor pleasure?",
        "source": "T11n0310_046:0268c15_9"
    },
    {
        "source_sentence": "若有人來語汝等言：「世間決定無我、無眾生、無壽命者、無數取者。」",
        "translation": "Suppose someone comes to you and says, The world is definitely without self, without sentient beings, without life, and countlessly grasped.",
        "source": "T11n0310_046:0268c18_10"
    },
    {
        "source_sentence": "當知是人為汝等怨，非汝善友。』",
        "translation": "You should know that this person is your enemy and not your good friend.'",
        "source": "T11n0310_046:0268c19_11"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268c20_12"
    },
    {
        "source_sentence": "爾時諸惡苾芻重更誘化婦人丈夫及以男女，作如是言：『若有人說無我等法，",
        "translation": "It was then that the evil bhikṣus again urged their wives, husbands, men, and women to be converted. They said:",
        "source": "T11n0310_046:0268c20_13"
    },
    {
        "source_sentence": "當知其人為不善者、為暴惡者，是汝惡友非汝善友。』",
        "translation": "You should know that someone who's unwholesome or violent is your bad friend and not your good friend.'",
        "source": "T11n0310_046:0268c22_14"
    },
    {
        "source_sentence": "復更化言：『汝等諸人是聰慧者，深能領解我所說義。",
        "translation": "Again, they say, 'You people are wise and able to deeply comprehend the meaning of what I teach.",
        "source": "T11n0310_046:0268c23_15"
    },
    {
        "source_sentence": "自今已往，若諸惡友非善友來，當為汝說世間決定無我等法。",
        "translation": "From now on, if bad friends or non-good friends come, I'll explain for you the worldly dharmas that are definitely selfless.",
        "source": "T11n0310_046:0268c24_16"
    },
    {
        "source_sentence": "汝等不應輒相親昵交顧往還承事供養。』",
        "translation": "You shouldn't so easily become intimate with each other, look back and forth, serve and make offerings.'",
        "source": "T11n0310_046:0268c26_17"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268c27_0"
    },
    {
        "source_sentence": "諸惡苾芻行如是化，於半月間人各誘得滿五百家歸從其見。",
        "translation": "The bad monks performed such a transformation, and within half a month, each of them were tempted to follow their views in all five hundred houses.",
        "source": "T11n0310_046:0268c27_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0268c28_2"
    },
    {
        "source_sentence": "爾時有諸苾芻是阿羅漢，永離一切煩惱垢穢，而是勝觀如來、應、正等覺真實弟子，",
        "translation": "At the time, there were monks and nuns who were arhats permanently freed from all the defilements of afflictions, but they were truly disciples of Vaiśravaṇa, the Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T11n0310_046:0268c28_3"
    },
    {
        "source_sentence": "為乞食等諸因緣故，詣彼諸惡苾芻所化之家。",
        "translation": "Because of such causes and conditions as begging for food, they go to the houses transformed by those bad monks.",
        "source": "T11n0310_046:0269a01_4"
    },
    {
        "source_sentence": "暫至其門，便為婦人丈夫及諸男女所共毀罵非理訶責，以麁惡言面陳挫辱，",
        "translation": "When they arrived at the gate for a moment, they were scolded by their wives, husbands, men, and women together, unreasonably reprimanded, verbally abused, and humiliated.",
        "source": "T11n0310_046:0269a02_5"
    },
    {
        "source_sentence": "「『汝等不能知正法，　　汝等迷失於聖道，",
        "translation": "'You don't know the right teaching, and you're lost in the noble path.",
        "source": "T11n0310_046:0269a04_6"
    },
    {
        "source_sentence": "　　汝等退捨於淨教，　　汝等皆當墮地獄。』",
        "translation": "You will all turn away from the pure teaching, and you'll all fall into hell.'",
        "source": "T11n0310_046:0269a04_6"
    },
    {
        "source_sentence": "為諸苾芻而說頌曰：「舍利子！",
        "translation": "He spoke a verse for the monks, saying, Śāriputra!",
        "source": "T11n0310_046:0269a04_6"
    },
    {
        "source_sentence": "彼諸人等說是語已，於阿羅漢倍更訶罵。",
        "translation": "After they spoke these words, those people were even more rebuked by the arhat.",
        "source": "T11n0310_046:0269a08_7"
    },
    {
        "source_sentence": "既訶罵已，復以種種言詞而罵於佛。",
        "translation": "After he reprimanded them, he then scolded the Buddha in various ways.",
        "source": "T11n0310_046:0269a09_8"
    },
    {
        "source_sentence": "「『如來所說非虛妄，　　所謂諸行悉無常，",
        "translation": "'That what the Tathāgata teaches is not false, saying that all conditioned things are completely impermanent,",
        "source": "T11n0310_046:0269a09_9"
    },
    {
        "source_sentence": "　　又說諸法皆無我，　　及以無恒無不變。",
        "translation": "It's also said that all dharmas lack self, and it's because they lack permanence and change.",
        "source": "T11n0310_046:0269a09_9"
    },
    {
        "source_sentence": "　　諸行都無有堅實，　　皆為虛偽妄失法，",
        "translation": "All conditioned phenomena have no solidity; They are all false and deluded dharmas.",
        "source": "T11n0310_046:0269a09_9"
    },
    {
        "source_sentence": "　　所說空華無所有，　　但能誑惑彼愚夫。』",
        "translation": "The flowers of emptiness that are explained have no existence, but they can deceive those foolish people.'",
        "source": "T11n0310_046:0269a09_9"
    },
    {
        "source_sentence": "即於佛前說伽陀曰：「舍利子！",
        "translation": "He then spoke to the Buddha in front of him, saying, Śāriputra!",
        "source": "T11n0310_046:0269a09_9"
    },
    {
        "source_sentence": "「『如來所說一切法，　　決定無我無眾生、",
        "translation": "'All the teachings of the Tathāgata are definitely without self and without sentient beings.",
        "source": "T11n0310_046:0269a15_10"
    },
    {
        "source_sentence": "　　無有壽命無數取，　　亦無作者及受者。",
        "translation": "There's no life and countless grasping, and there's no author or recipient.",
        "source": "T11n0310_046:0269a15_10"
    },
    {
        "source_sentence": "　　而今現見諸世間，　　有能行施及所受，",
        "translation": "But now we see that all the worlds Are capable of practicing giving and receiving.",
        "source": "T11n0310_046:0269a15_10"
    },
    {
        "source_sentence": "　　并餘種種受用人，　　及覺廣大諸受等。",
        "translation": "They are also the other various kinds of persons who experience and enjoy, as well as feelings that perceive vast sensations and so forth.",
        "source": "T11n0310_046:0269a15_10"
    },
    {
        "source_sentence": "　　當知宣說定無我，　　一切皆應墮惡道。』",
        "translation": "You should know that you proclaim that there's definitely no self, and all of them will fall into a bad path.'",
        "source": "T11n0310_046:0269a15_10"
    },
    {
        "source_sentence": "彼諸人等說如是語輕毀佛已，倍增憤恚，又於佛前說伽他曰：「舍利子！",
        "translation": "After they spoke such words to disparage the Buddha, those people became even more angry and said again to Kātyāyana in front of him, Śāriputra!",
        "source": "T11n0310_046:0269a15_10"
    },
    {
        "source_sentence": "當爾之時，諸不善人同聲說是非法語者，大小男女有六十八拘胝千眾生，",
        "translation": "At that time, all the unwholesome people spoke in unlawful words with one voice. There were sixty-eight koṭis of sentient beings, male and female, large and small, a thousand sentient beings,",
        "source": "T11n0310_046:0269a22_11"
    },
    {
        "source_sentence": "皆惡苾芻所化導故行是惡業。",
        "translation": "Because they are all led by bad monks, their conduct is bad action.",
        "source": "T11n0310_046:0269a23_12"
    },
    {
        "source_sentence": "彼命終已同生無間大地獄中，受身麁大魚形人首，其舌長廣彌布於地，",
        "translation": "At the end of their life, they'll be born together in the great hell of Unremitting Hell, where they'll experience a body shaped like a large fish with a human head and a tongue long and wide spreading on the ground.",
        "source": "T11n0310_046:0269a24_13"
    },
    {
        "source_sentence": "周遍下釘如殖薑田，又於舌上眾多鐵犁常以耕之。",
        "translation": "It's pervaded by nails like planting a field of grapes, and there are many iron plows on his tongue to plow it.",
        "source": "T11n0310_046:0269a26_14"
    },
    {
        "source_sentence": "彼一一身又為一百極惡商佉之所唼食。",
        "translation": "Each of those bodies and body is also eaten by a hundred extremely bad merchants.",
        "source": "T11n0310_046:0269a27_15"
    },
    {
        "source_sentence": "又於空中大熱鐵丸，猛焰赫然光色熾盛，從空而墮常雨其身。",
        "translation": "Again, there was a great hot iron ball in the sky with a blazing flame and an abundant bright light. It fell from the sky and always rained down on its body.",
        "source": "T11n0310_046:0269a28_16"
    },
    {
        "source_sentence": "是諸罪人以惡業故，受如是等種種楚毒。」",
        "translation": "Because of bad actions, these sinners are subject to various kinds of pain and suffering like this.",
        "source": "T11n0310_046:0269a29_17"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說頌曰。",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, saying.",
        "source": "T11n0310_046:0269b01_18"
    },
    {
        "source_sentence": "「鐵丸猛焰如飛電，　　可畏無量百千種，",
        "translation": "“The iron ball’s blazing flame is like flying lightning, Of which there are immeasurable hundreds of thousands to be feared.",
        "source": "T11n0310_046:0269b03_0"
    },
    {
        "source_sentence": "　常於其身而墮墜，　　熾然恒受種種苦。",
        "translation": "They always fall into their bodies, blazing and constantly suffering various kinds of pain.",
        "source": "T11n0310_046:0269b04_0"
    },
    {
        "source_sentence": "　又於身內遍流轉，　　炎熾猛盛難逢近，",
        "translation": "Furthermore, within their bodies they revolve in all directions With a blazing fire so intense that it is hard to reach them.",
        "source": "T11n0310_046:0269b05_0"
    },
    {
        "source_sentence": "　騰焰高踊百由旬，　　流火遍出身毛孔。",
        "translation": "A hundred yojanas high rises the flame, and a stream of fire emerges from all its hair pores.",
        "source": "T11n0310_046:0269b06_0"
    },
    {
        "source_sentence": "　又彼眾生一一舌，　　盡為無量鐵犁耕，",
        "translation": "Also, each tongue of those sentient beings Is plowed with an infinite iron plow.",
        "source": "T11n0310_046:0269b07_0"
    },
    {
        "source_sentence": "　一切舌分皆分裂，　　如是苦受恒纏繞。",
        "translation": "All parts of the tongue are all divided, constantly tethered by painful feelings like this.",
        "source": "T11n0310_046:0269b08_0"
    },
    {
        "source_sentence": "　斯由親近惡友已，　　能感如斯大苦聚，",
        "translation": "Through association with evil companions They are able to bring forth this great mass of suffering.",
        "source": "T11n0310_046:0269b09_0"
    },
    {
        "source_sentence": "　又由遠離具戒者，　　致令速墮於惡道。",
        "translation": "It's also because they're far removed from those who possess the precepts, which causes them to quickly fall into a bad path.",
        "source": "T11n0310_046:0269b10_0"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0269b11_0"
    },
    {
        "source_sentence": "時彼非法六惡苾芻，由惡教故，命終之後皆生阿毘大地獄中。",
        "translation": "Because of their bad teachings, those unlawful six bad monks were all born in the great hell of abhi after their lives ended.",
        "source": "T11n0310_046:0269b11_1"
    },
    {
        "source_sentence": "一一受身縱廣等量三十踰繕那，彼一一身皆生千口，一一口中各生二舌，",
        "translation": "Each sensation is thirty yojanas long and wide, each body equal in length and breadth to the extent of one hundred yojanas. A thousand syllables are uttered in each body; two syllables occur in each mouth.",
        "source": "T11n0310_046:0269b12_2"
    },
    {
        "source_sentence": "是一一舌廣長量等四踰繕那，一一舌上有五百鐵犁，鐵牛挽之以耕其舌。",
        "translation": "Each tongue is four yojanas in width and length, and each tongue has five hundred iron plows on top of each tongue, pulled by an iron cow to plow its tongue.",
        "source": "T11n0310_046:0269b14_3"
    },
    {
        "source_sentence": "是諸罪人雖受苦痛，大苦逼故不遑號叫。",
        "translation": "Even though these sinners experience pain and suffering, they aren't screaming or wailing because they're tormented by great suffering.",
        "source": "T11n0310_046:0269b16_0"
    },
    {
        "source_sentence": "又於頭上各有萬億獄卒，手執害具刀鋸矛矟，斫刺破裂壞其身首。",
        "translation": "On each of their heads, there are a thousand million jailers holding harmful weapons in their hands, swords, saws, spears, and lances that pierce and break up their bodies and heads.",
        "source": "T11n0310_046:0269b16_1"
    },
    {
        "source_sentence": "在此獄中壽萬億歲，如是展轉復往諸餘大地獄中，具受辛酸種種苦楚。",
        "translation": "The duration of life in this hell is one thousand myriad koṭis of years. In this way they go one after another in succession to the other great hells, undergoing all kinds of pain and suffering:",
        "source": "T11n0310_046:0269b18_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_046:0269b20_3"
    },
    {
        "source_sentence": "由彼瞋毀佛聖教故。",
        "translation": "It's because they angrily disparage the Buddha's noble teaching.",
        "source": "T11n0310_046:0269b20_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0269b20_5"
    },
    {
        "source_sentence": "當於爾時，有大長者名曰安隱，財富無量資產具足，多諸珍寶，金銀琉璃、珊瑚末尼、真珠貝玉無不備有。",
        "translation": "At the time, there was a great elder named Anyin with immeasurable wealth and possessions, abundant in treasures, such as gold, silver, lapis lazuli, coral, maṇi, pearls, shellfish, and jade.",
        "source": "T11n0310_046:0269b20_6"
    },
    {
        "source_sentence": "又多僕使奴婢，財穀庫藏皆悉盈滿。",
        "translation": "There were also many servants, messengers, male and female servants, and all the storehouses of property and grain were fully filled.",
        "source": "T11n0310_046:0269b23_7"
    },
    {
        "source_sentence": "是時長者為惡苾芻之所教化，既受其語生於斷見。",
        "translation": "The elder was then taught by a bad monk, and after accepting his words, he gave rise to the view of stopping.",
        "source": "T11n0310_046:0269b24_8"
    },
    {
        "source_sentence": "長者有妻名為焰慧，容色盛美為人所重。",
        "translation": "The elder had a wife named Yamu, whose appearance was so beautiful that it was valued by people.",
        "source": "T11n0310_046:0269b25_9"
    },
    {
        "source_sentence": "彼生一男，形貌端嚴眾覩無厭，成就第一圓滿淨色，曾於過去無量百千那庾多拘胝佛所植諸善本。",
        "translation": "He gave birth to a boy whose appearance was dignified and beautiful, with no weariness or resentment, who possessed the first perfect form of purity and had planted good roots in measureless hundreds of thousands of millions of koṭis of buddha-lands in the past.",
        "source": "T11n0310_046:0269b26_10"
    },
    {
        "source_sentence": "當初生時三返微笑，又發是言：『奇哉奇哉！",
        "translation": "When he was first born, he smiled three times and said, 'How marvelous!",
        "source": "T11n0310_046:0269b28_11"
    },
    {
        "source_sentence": "云何今者生斷見家？』",
        "translation": "How is it now that he's born in the house of the view of nihilism?'",
        "source": "T11n0310_046:0269b29_12"
    },
    {
        "source_sentence": "其母聞已驚恐惶懼身毛為竪，與諸女人棄之逃避。",
        "translation": "When the mother heard this, she was frightened and fearful. Her hair stood on end and her body hair stood on end.",
        "source": "T11n0310_046:0269b29_13"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0269c02_14"
    },
    {
        "source_sentence": "時諸女人欲審悉故，還來近住觀察是兒為何等類？",
        "translation": "The women then wanted to examine it, so they came back and stayed nearby to see what kind of child he was.",
        "source": "T11n0310_046:0269c02_15"
    },
    {
        "source_sentence": "天耶？",
        "translation": "Are they gods?",
        "source": "T11n0310_046:0269c03_16"
    },
    {
        "source_sentence": "龍耶？",
        "translation": "Is a dragon?",
        "source": "T11n0310_046:0269c03_17"
    },
    {
        "source_sentence": "為藥叉耶？",
        "translation": "Why is it a yakṣa?",
        "source": "T11n0310_046:0269c03_18"
    },
    {
        "source_sentence": "為健達縛？",
        "translation": "Why is it bound by the gandharva?",
        "source": "T11n0310_046:0269c03_19"
    },
    {
        "source_sentence": "為阿素洛？",
        "translation": "For the sake of asura?",
        "source": "T11n0310_046:0269c04_20"
    },
    {
        "source_sentence": "為揭路荼？",
        "translation": "Why is it a garuḍa?",
        "source": "T11n0310_046:0269c04_21"
    },
    {
        "source_sentence": "為緊捺洛？",
        "translation": "Why is it kiṃnara?",
        "source": "T11n0310_046:0269c04_22"
    },
    {
        "source_sentence": "為牟呼洛伽？",
        "translation": "For the sake of the mahoraga?",
        "source": "T11n0310_046:0269c04_23"
    },
    {
        "source_sentence": "為究槃荼？",
        "translation": "For the sake of a kumbhāṇḍa?",
        "source": "T11n0310_046:0269c05_24"
    },
    {
        "source_sentence": "為畢舍遮人非人耶？",
        "translation": "Is it a person or not a person in Vaiśravaṇa?",
        "source": "T11n0310_046:0269c05_25"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0269c05_26"
    },
    {
        "source_sentence": "時此嬰兒再發是言告諸女曰：『汝雖怖走，我甚安樂。』",
        "translation": "The baby then again spoke to the women, saying, 'Although you're afraid to run away, I'm very comfortable.'",
        "source": "T11n0310_046:0269c06_27"
    },
    {
        "source_sentence": "「『汝當樂義利，　　於義利勿怖，",
        "translation": "'You should delight in meaningful benefits, and don't be afraid of meaningful benefits.",
        "source": "T11n0310_046:0269c07_28"
    },
    {
        "source_sentence": "　　我當度汝等，　　令脫於邪道。",
        "translation": "I will save you And lead you away from the wrong path.",
        "source": "T11n0310_046:0269c07_28"
    },
    {
        "source_sentence": "　　汝安隱勿怖，　　應怖前惡友，",
        "translation": "You should be at ease and not fearful. You should fear the bad companions who are before you.",
        "source": "T11n0310_046:0269c07_28"
    },
    {
        "source_sentence": "　　我當度汝等，　　令脫於邪見。』",
        "translation": "I will save you and free you from wrong views.'",
        "source": "T11n0310_046:0269c07_28"
    },
    {
        "source_sentence": "時此嬰兒為諸女人而說頌曰：「舍利子！",
        "translation": "The baby then spoke a verse for the women, saying, Śāriputra!",
        "source": "T11n0310_046:0269c07_28"
    },
    {
        "source_sentence": "時彼父母及餘大眾，聞是嬰兒說伽他已，便往兒所。",
        "translation": "The parents and the other members of the crowd then heard that the baby was teaching Kṣāṭa, so they went to his child.",
        "source": "T11n0310_046:0269c12_29"
    },
    {
        "source_sentence": "「『家中凡所有，　　廣大諸財穀，",
        "translation": "'All the vast wealth and grains that are possessed at home,",
        "source": "T11n0310_046:0269c13_30"
    },
    {
        "source_sentence": "　　速持來見與，　　供佛及聲聞。",
        "translation": "They quickly bring the present and give it to the Buddha and śrāvakas.",
        "source": "T11n0310_046:0269c13_30"
    },
    {
        "source_sentence": "　　彼大聲聞眾，　　照世勝觀尊，",
        "translation": "That great assembly of śrāvakas, the world-illuminating supreme contemplation honored one,",
        "source": "T11n0310_046:0269c13_30"
    },
    {
        "source_sentence": "　　三界圍輪中，　　都無與等者。",
        "translation": "In the worlds of the three spheres, There is no equal.",
        "source": "T11n0310_046:0269c13_30"
    },
    {
        "source_sentence": "　　彼大聲聞眾，　　照世勝觀尊，",
        "translation": "That great assembly of śrāvakas, the world-illuminating supreme contemplation honored one,",
        "source": "T11n0310_046:0269c13_30"
    },
    {
        "source_sentence": "　　廣闡揚妙法，　　利益諸群品。",
        "translation": "He extensively explains the marvelous teaching for the benefit of all living beings.",
        "source": "T11n0310_046:0269c13_30"
    },
    {
        "source_sentence": "　　彼大聲聞眾，　　照世勝觀尊，",
        "translation": "That great assembly of śrāvakas, the world-illuminating supreme contemplation honored one,",
        "source": "T11n0310_046:0269c13_30"
    },
    {
        "source_sentence": "　　身具三十二，　　大丈夫威相。",
        "translation": "His body is endowed with thirty-two marks, With the majesty of a great being.",
        "source": "T11n0310_046:0269c13_30"
    },
    {
        "source_sentence": "　　彼佛聲聞眾，　　猶如烏曇花，",
        "translation": "Those buddhas and śrāvakas are like the udumbara flower.",
        "source": "T11n0310_046:0269c13_30"
    },
    {
        "source_sentence": "　　名稱甚難聞，　　過億拘胝劫。』",
        "translation": "Their reputation is so difficult to hear that it's more than a hundred million koṭis of eons.'",
        "source": "T11n0310_046:0269c13_30"
    },
    {
        "source_sentence": "是時嬰兒為其父母而說頌曰：「舍利子！",
        "translation": "The baby then spoke a verse for his parents, saying, Śāriputra!",
        "source": "T11n0310_046:0269c13_30"
    },
    {
        "source_sentence": "時兒父母聞是法已，即取家中二十拘胝上妙財寶，將至兒所而語之言：『此諸財寶是汝父母所有之物，",
        "translation": "Having heard this teaching, the children’s parents at once took the riches of twenty koṭis of their wealth from their house. They went to their children and said:",
        "source": "T11n0310_046:0269c25_31"
    },
    {
        "source_sentence": "汝當取之，隨汝志意生信之所任持奉施。』",
        "translation": "You must take it, follow your wishes and give it to someone with faith who gives it as an offering.'",
        "source": "T11n0310_046:0269c27_32"
    },
    {
        "source_sentence": "「『此是汝父母，　　所致諸財寶，",
        "translation": "'These are the riches and treasures your parents gave you.",
        "source": "T11n0310_046:0269c28_33"
    },
    {
        "source_sentence": "　　隨心所敬信，　　汝當持布施。",
        "translation": "Whatever your heart respects and believes, You should maintain generosity.",
        "source": "T11n0310_046:0269c28_33"
    },
    {
        "source_sentence": "　　若金若珍寶，　　家中甚豐積，",
        "translation": "Both gold and precious treasures are abundant in the house.",
        "source": "T11n0310_046:0269c28_33"
    },
    {
        "source_sentence": "　　隨心所敬信，　　汝當持速施。",
        "translation": "Whatever your mind respects and believes, you must maintain it and quickly give it.",
        "source": "T11n0310_046:0269c28_33"
    },
    {
        "source_sentence": "　　衣服坐臥具，　　花鬘及塗香，",
        "translation": "They wear clothes, seats, bedding, flower garlands, and ointments.",
        "source": "T11n0310_046:0269c28_33"
    },
    {
        "source_sentence": "　　隨心所敬信，　　汝持歡喜施。",
        "translation": "Whatever your heart respects and believes, you'll maintain joyful generosity.",
        "source": "T11n0310_046:0269c28_33"
    },
    {
        "source_sentence": "　　於佛及法僧，　　無上福田所，",
        "translation": "Among the buddhas and Dharma and saṃgha, it's the unsurpassed field of merit.",
        "source": "T11n0310_046:0269c28_33"
    },
    {
        "source_sentence": "　　為利諸群生，　　當應行布施。』",
        "translation": "For the benefit of all sentient beings, you should practice generosity.'",
        "source": "T11n0310_046:0269c28_33"
    },
    {
        "source_sentence": "爾時父母即為是兒而說頌曰：「舍利子！",
        "translation": "It was then that the parents spoke a verse for this child, saying, Śāriputra!",
        "source": "T11n0310_046:0269c28_33"
    },
    {
        "source_sentence": "「『我今往勝觀，　　世間依怙所，",
        "translation": "'Now, I'll go to Vaiśravaṇa and the world will rely on me.",
        "source": "T11n0310_046:0270a09_34"
    },
    {
        "source_sentence": "　　當廣設供養，　　為利群生故。",
        "translation": "You should make extensive offerings for the benefit of all living beings.",
        "source": "T11n0310_046:0270a09_34"
    },
    {
        "source_sentence": "　　諸有欲希求，　　天上人中樂，",
        "translation": "Those who desire and seek heavenly bliss among gods and humans.",
        "source": "T11n0310_046:0270a09_34"
    },
    {
        "source_sentence": "　　應隨我所詣，　　勝觀如來所。』",
        "translation": "You should follow where I go and visit the Tathāgata Vaiśravaṇa.'",
        "source": "T11n0310_046:0270a09_34"
    },
    {
        "source_sentence": "爾時嬰兒聞其父母所說頌已，復為父母而說頌曰：「舍利子！",
        "translation": "After hearing the verse spoken by his parents, the baby then spoke another verse for them, saying, Śāriputra!",
        "source": "T11n0310_046:0270a09_34"
    },
    {
        "source_sentence": "爾時嬰兒以念正知觀視四方，白父母曰：『父母當知，我今應往薄伽梵勝觀如來、應、正等覺所。』",
        "translation": "It was then that the baby observed the Tathāgata, Arhat, and Perfectly Enlightened One in four directions with mindfulness of right knowledge and said to his parents, 'Parents, you should know that now I should go to the Bhagavān's place to see the Tathāgata, Arhat, and Perfectly Enlightened One.'",
        "source": "T11n0310_046:0270a15_35"
    },
    {
        "source_sentence": "於是眾人聞是語已皆大驚愕：『云何嬰兒當初生日，便能與人往返言議？",
        "translation": "After hearing these words, the people were all greatly startled, saying, 'How could a baby on its first birthday be able to talk back and forth with someone?'",
        "source": "T11n0310_046:0270a17_36"
    },
    {
        "source_sentence": "又能徒步有所造詣？』",
        "translation": "Can you make a pilgrimage on your own?'",
        "source": "T11n0310_046:0270a18_37"
    },
    {
        "source_sentence": "時有八萬四千眾生，聞是奇異皆來雲集，而作是言：『我等當觀此嬰兒者是何等類。",
        "translation": "When 84,000 sentient beings heard this marvelous thing, they all gathered in clouds and said, 'We'll see what kind this baby is.'",
        "source": "T11n0310_046:0270a19_38"
    },
    {
        "source_sentence": "為天？",
        "translation": "For the sake of gods?",
        "source": "T11n0310_046:0270a21_39"
    },
    {
        "source_sentence": "為龍？",
        "translation": "For the sake of dragons?",
        "source": "T11n0310_046:0270a21_40"
    },
    {
        "source_sentence": "為藥叉耶？",
        "translation": "Why is it a yakṣa?",
        "source": "T11n0310_046:0270a21_41"
    },
    {
        "source_sentence": "乃至為畢舍遮人非人耶？』",
        "translation": "Is it because the person in Vaiśālī is not a human being?'",
        "source": "T11n0310_046:0270a21_42"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0270a22_43"
    },
    {
        "source_sentence": "爾時嬰兒與諸大眾八萬四千前後圍遶，往詣勝觀如來所止之處。",
        "translation": "At the time, the baby was surrounded by 84,000 people in front and behind him, and he went to the place where the Tathāgata stayed at Vaiśravaṇa.",
        "source": "T11n0310_046:0270a22_44"
    },
    {
        "source_sentence": "當此嬰兒往佛所時，以福德力恐為風日所損弊故，於上空中十千寶蓋自然而現用覆其身。",
        "translation": "When this baby went to the Buddha's place, he was afraid of being damaged by the wind and sun because of his virtue, so he naturally produced a 10,000-jeweled canopy in the air above to cover his body.",
        "source": "T11n0310_046:0270a24_45"
    },
    {
        "source_sentence": "又於嬰兒所由之路，虛空之中羅布金網，雨上妙花及細末香，超勝諸天常所散者。",
        "translation": "Also, on the path where the infant was going, he spreads a golden net in space, raining marvelous flowers and fine powdered fragrances that surpass those always scattered by gods.",
        "source": "T11n0310_046:0270a26_46"
    },
    {
        "source_sentence": "扇清涼風與天香合，周流飄散相續不斷。",
        "translation": "The cool breeze of the fan is combined with the heavenly fragrance, and it flows around in an unbroken series.",
        "source": "T11n0310_046:0270a28_47"
    },
    {
        "source_sentence": "虛空諸天又於行路，以諸香水而用灑之，覆以金羅種種珍服。",
        "translation": "The sky gods also sprinkled the pathway with perfume and covered it with various precious clothing made of gold.",
        "source": "T11n0310_046:0270a29_48"
    },
    {
        "source_sentence": "又彼諸天雨花布道，光彩相曜積齊于膝。",
        "translation": "The gods rained flowers and spread them on the path, shining as brilliantly as high as their knees.",
        "source": "T11n0310_046:0270b01_49"
    },
    {
        "source_sentence": "於其道側無量百千清淨池沼自然出現，八功德水具足盈滿，生諸妙花，",
        "translation": "Measureless hundreds of thousands of pure ponds and pools appeared spontaneously beside the road. The water of the eight kinds of virtue filled them up to the brim, producing beautiful flowers.",
        "source": "T11n0310_046:0270b02_50"
    },
    {
        "source_sentence": "所謂殟鉢羅花、鉢特摩花、拘貿陀花、奔荼利花，含發鮮榮彌滿池內。",
        "translation": "The so-called blue lotus, white lotus, white lotus, pink lotus, red lotus, and white lotus blossoms filled the pond.",
        "source": "T11n0310_046:0270b04_51"
    },
    {
        "source_sentence": "又有鳧鴈鴛鴦異類眾鳥遊戲水上。",
        "translation": "There are also various kinds of birds such as ducks, mandarin ducks, and a variety of birds that play in the water.",
        "source": "T11n0310_046:0270b05_52"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0270b06_53"
    },
    {
        "source_sentence": "時彼嬰兒所由之路，七寶欄楯以界道側，諸天伎樂具無量千，深遠妙音自然而發。",
        "translation": "The seven-jeweled railings were placed beside the boundary and the heavenly deities played innumerable thousands of kinds of music that arose spontaneously from the profound, subtle sound.",
        "source": "T11n0310_046:0270b06_54"
    },
    {
        "source_sentence": "左右寶樹行列莊嚴，於大道中復施花路，現於身前為供養故，以待嬰兒遊履其上。",
        "translation": "On his left and right, adorned with rows of jeweled trees standing in rows, he offered a path of flowers on the highway that appeared before his body as an offering, waiting for the baby to wander there.",
        "source": "T11n0310_046:0270b08_55"
    },
    {
        "source_sentence": "於其花路承步諸花，舉足之時自然隱沒，及將下足花便踊現。",
        "translation": "The flowers that follow the steps on the paths of those flowers naturally disappear when they lift their feet, and the flowers that are about to fall down quickly appear.",
        "source": "T11n0310_046:0270b10_56"
    },
    {
        "source_sentence": "「『汝等無理不應行，　　異我此路餘非理，",
        "translation": "'You shouldn't act irrationally; it's unreasonable to do anything other than this path of self.",
        "source": "T11n0310_046:0270b11_57"
    },
    {
        "source_sentence": "　　而我常遊此正理，　　故往有理最勝處。",
        "translation": "I always traveled to this true principle, so there was a place where the principle was most superior.",
        "source": "T11n0310_046:0270b11_57"
    },
    {
        "source_sentence": "　　超過無量那庾劫，　　時復一福遇人身，",
        "translation": "For innumerable millions of eons More than one blessedness can be found in a human body.",
        "source": "T11n0310_046:0270b11_57"
    },
    {
        "source_sentence": "　　時有一佛出世間，　　時勤修得淨信慧。』",
        "translation": "When a buddha emerges from the world, he diligently cultivates pure faith and wisdom.'",
        "source": "T11n0310_046:0270b11_57"
    },
    {
        "source_sentence": "爾時嬰兒遊此花道經須臾頃，即便迴顧觀諸大眾，說伽他曰：「舍利子！",
        "translation": "In a moment's time, the baby traveled this flower path, looked around the crowd, and said to Kāṭaśyapa, Śāriputra!",
        "source": "T11n0310_046:0270b11_57"
    },
    {
        "source_sentence": "爾時嬰兒為諸大眾說伽他已，於虛空中有八萬四千諸大天子同聲讚言：『善哉善哉！』",
        "translation": "After the baby then explained the verse for the masses, 84,000 great celestial beings in the sky praised it with one voice, saying, 'Good, good!'",
        "source": "T11n0310_046:0270b18_58"
    },
    {
        "source_sentence": "「『善哉善哉大智慧，　　汝所宣說會正理，",
        "translation": "'Good, good, great wisdom! Good, what you proclaim will unite the correct principle.",
        "source": "T11n0310_046:0270b20_59"
    },
    {
        "source_sentence": "　　仁者後顧為無理，　　有正理者當前趣。』",
        "translation": "Gentlemen, the latter is considered irrational, and those who have the right principle are in the present destinies.'",
        "source": "T11n0310_046:0270b20_59"
    },
    {
        "source_sentence": "便說伽他讚嬰兒曰：「舍利子！",
        "translation": "He then spoke to the Gatha and praised the baby, saying, Śāriputra!",
        "source": "T11n0310_046:0270b20_59"
    },
    {
        "source_sentence": "「『汝諸天等所宣說，　　有理無理之正言，",
        "translation": "'You gods and so forth, what you proclaim is reasonable and unreasonable right speech.",
        "source": "T11n0310_046:0270b23_60"
    },
    {
        "source_sentence": "　　我今問汝汝當答，　　有理無理之實義。』",
        "translation": "Now, I'll ask you a question and you will answer it, which has the true meaning of principle and non-dharma.'",
        "source": "T11n0310_046:0270b23_60"
    },
    {
        "source_sentence": "爾時嬰兒又以伽他報諸天曰：「舍利子！",
        "translation": "It was then that the baby again reported to the gods with a verse, saying, Śāriputra!",
        "source": "T11n0310_046:0270b23_60"
    },
    {
        "source_sentence": "「『若樂欲住諸財寶，　　不樂出離所行處，",
        "translation": "'If someone delights in wanting to abide in possessions and treasures, they don't delight in leaving their place of practice.",
        "source": "T11n0310_046:0270b26_61"
    },
    {
        "source_sentence": "　　如是無理諸凡愚，　　安住地獄之前道。",
        "translation": "Thus, it's not reasonable for ordinary foolish people to live in the path before hell.",
        "source": "T11n0310_046:0270b26_61"
    },
    {
        "source_sentence": "　　若樂捨家趣非家，　　當應捨欲棄財寶，",
        "translation": "If someone delights in abandoning home and heading for what’s not home, they should abandon their desires and discard possessions.",
        "source": "T11n0310_046:0270b26_61"
    },
    {
        "source_sentence": "　　是人於世有正理，　　不久便開解脫門。』",
        "translation": "That person has the right principle in the world, and soon they'll open the door to liberation.'",
        "source": "T11n0310_046:0270b26_61"
    },
    {
        "source_sentence": "爾時諸天復以伽他報嬰兒曰：「舍利子！",
        "translation": "It was then that the gods again reported to the baby with a verse, saying, Śāriputra!",
        "source": "T11n0310_046:0270b26_61"
    },
    {
        "source_sentence": "「『如汝所說理無理，　　觀汝全未能明曉。",
        "translation": "'As you say, the principle is unreasonable, but observing it, you can't understand it at all.",
        "source": "T11n0310_046:0270c02_62"
    },
    {
        "source_sentence": "　　如是有理無理義，　　我深於此正開悟。』",
        "translation": "Thus, there's a principle that's unreasonable, and I'm profoundly enlightened here.'",
        "source": "T11n0310_046:0270c02_62"
    },
    {
        "source_sentence": "爾時嬰兒復以伽他報諸天曰：「舍利子！",
        "translation": "It was then that the baby again reported to the gods with a verse, saying, Śāriputra!",
        "source": "T11n0310_046:0270c02_62"
    },
    {
        "source_sentence": "爾時嬰兒說是語已，即便前進趣薄伽梵毘鉢尸如來、應、正等覺大會之所。",
        "translation": "After speaking these words, the baby then proceeded to the place where the Tathāgata, Arhat, and Completely Awakened One, Bhagavān Vipaśyin, the great assembly, was.",
        "source": "T11n0310_046:0270c05_63"
    },
    {
        "source_sentence": "既到彼已，頂禮佛足右繞三匝却住一面，於薄伽梵勝觀如來深生敬仰，",
        "translation": "Having arrived there, they bowed their heads at the Buddha’s feet, circumambulated him three times to his right and left, and withdrew to one side. They reverently venerated the Tathāgata Brahmakāyika Bodhisattva.",
        "source": "T11n0310_046:0270c06_64"
    },
    {
        "source_sentence": "「『常行利益諸世間，　　勝觀三明施甘露，",
        "translation": "'Permanently practicing for the benefit of all worlds, he's superior to observing the three kinds of insight and bestowing ambrosia.",
        "source": "T11n0310_046:0270c08_65"
    },
    {
        "source_sentence": "　　如大龍象大師子，　　由是我今常敬禮。",
        "translation": "Like the great dragon elephant lion, this is why I now venerate him.",
        "source": "T11n0310_046:0270c08_65"
    },
    {
        "source_sentence": "　　世間明照甚難得，　　猶如烏曇跋羅花，",
        "translation": "Worldly illumination is difficult to attain, Like the udumbara flower.",
        "source": "T11n0310_046:0270c08_65"
    },
    {
        "source_sentence": "　　為世依怙作光明，　　形色微妙甚圓具。",
        "translation": "Being the world's reliance, he creates a light whose form is subtle and perfectly round.",
        "source": "T11n0310_046:0270c08_65"
    },
    {
        "source_sentence": "　　世間眾苦所逼迫，　　不能了知真聖道，",
        "translation": "The world is oppressed by all kinds of suffering, Unable to know the true and holy path.",
        "source": "T11n0310_046:0270c08_65"
    },
    {
        "source_sentence": "　　踰越正路而逃迸，　　譬等生盲處於世。",
        "translation": "They cross the right path and flee, like being born blind in the world.",
        "source": "T11n0310_046:0270c08_65"
    },
    {
        "source_sentence": "　　願我此世當成佛，　　如今勝觀人中尊，",
        "translation": "May I attain buddhahood in this world, honored among humans as the best of men.",
        "source": "T11n0310_046:0270c08_65"
    },
    {
        "source_sentence": "　　當拔眾生無量苦，　　及救三火燒然者。",
        "translation": "They will remove the immeasurable suffering of sentient beings and rescue those who are burned by the three fires.",
        "source": "T11n0310_046:0270c08_65"
    },
    {
        "source_sentence": "　　如是無邊百千眾，　　皆隨我來至於此，",
        "translation": "boundless hundreds of thousands of such assemblies Have all come to this place following me.",
        "source": "T11n0310_046:0270c08_65"
    },
    {
        "source_sentence": "　　唯願演宣微妙法，　　悉令安住上菩提。』",
        "translation": "Please explain the subtle teaching and make them all abide in supreme enlightenment.'",
        "source": "T11n0310_046:0270c08_65"
    },
    {
        "source_sentence": "即以伽他而讚頌曰：「舍利子！",
        "translation": "He then praised him with a verse of praise, saying, Śāriputra!",
        "source": "T11n0310_046:0270c08_65"
    },
    {
        "source_sentence": "爾時嬰兒說是頌已，白勝觀如來應正等覺言：『世尊！",
        "translation": "After speaking this verse, the infant then said to the Vaiśeṣika Tathāgata, Worthy of Correct Enlightenment, 'Bhagavān!",
        "source": "T11n0310_046:0270c19_66"
    },
    {
        "source_sentence": "願我來世於此世間，當成如來、應、正等覺，為諸眾生顯揚正法，亦如今者勝觀如來為諸大眾廣說妙法。』",
        "translation": "May I attain the Tathāgata, Arhat, and Completely Awakened One in this world in the future for the sake of sentient beings who will reveal the right teaching to them, and now that I'm here, I'll explain the marvelous teaching to the masses.'",
        "source": "T11n0310_046:0270c20_67"
    },
    {
        "source_sentence": "爾時會中有八萬四千眾生，復白勝觀如來言：『世尊！",
        "translation": "At the time, 84,000 sentient beings in the assembly again said to the Vaiśravaṇa Tathāgata, 'Bhagavān!",
        "source": "T11n0310_046:0270c22_68"
    },
    {
        "source_sentence": "我等亦願於當來世，得成如來、應、正等覺，為眾生故顯揚正法，亦如今者勝觀如來等無有異。』",
        "translation": "We also want to attain the Tathāgata, Arhat, and Completely Awakened One in a future life so that we can reveal the right teaching for the sake of sentient beings, and now we're superiorly observing the Tathāgata and so forth without any difference.'",
        "source": "T11n0310_046:0270c23_69"
    },
    {
        "source_sentence": "爾時勝觀如來、應、正等覺，了知如是八萬四千人增上意已，即便微笑。",
        "translation": "It was then that the Vaiśravaṇa Tathāgata, Arhat, and Completely Awakened One understood the superior intentions of these 84,000 people and even smiled.",
        "source": "T11n0310_046:0270c26_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0270c27_1"
    },
    {
        "source_sentence": "諸佛法爾，於微笑時有種種光，青黃赤白紅頗胝色，從佛面門自然而發，",
        "translation": "When the Buddhas smile, they naturally emit a variety of rays of light that are blue, yellow, red, white, and crimson in color, which emerge from the Buddha’s face.",
        "source": "T11n0310_046:0270c27_2"
    },
    {
        "source_sentence": "遍照無量無邊佛之世界，上至梵世映蔽一切日月光明。",
        "translation": "It pervades the world of the infinite and limitless buddhas, reaching up to the Brahma world that eclipses all the lights of the sun and moon.",
        "source": "T11n0310_046:0270c29_3"
    },
    {
        "source_sentence": "其光遍照所應作已，而復還來右繞勝觀如來百千匝已，從薄伽梵頂髻而入。",
        "translation": "After that light universally illuminates what should be done, it returns to the right and circumambulates the Tathāgata of Vaiśravaṇa a hundred thousand times from the topknot of the Bhagavān.",
        "source": "T11n0310_046:0271a01_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0271a03_5"
    },
    {
        "source_sentence": "爾時勝觀如來有一侍者，覩佛神變現微笑已，從坐而起偏覆左肩，以右膝輪安處于地，",
        "translation": "At that time the Tathāgata Vaiśeṣika had an attendant who, having saluted the Buddha with a magical smile, rose from his seat, circumscribed his left shoulder, placed his right knee on the ground.",
        "source": "T11n0310_046:0271a03_6"
    },
    {
        "source_sentence": "「『我今問佛勝觀尊，　　端嚴希有生眾喜，",
        "translation": "'Now, I'm asking the Buddha, the supremely contemplative honored one, Whose dignity is rare and gives rise to joy in many people.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　何等因緣大善逝，　　現發微笑世間依？",
        "translation": "What are the causes and conditions for the great well-gone one's presently smiling worldly basis?",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　兩足世尊現微笑，　　其相非無有因緣，",
        "translation": "The two-legged World-honored One smiled, Yet his features are not without cause.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　願演微笑因緣本，　　利益世間悲愍故。",
        "translation": "May I explain the root of the causes and conditions for smiling, benefiting the world with compassion.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　今有百千拘胝眾，　　現住牟尼世尊前，",
        "translation": "Hundreds of thousands of koṭis of bhikṣus are now standing before the World-honored One.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　攝耳專注樂聽聞，　　願世間依愍眾說。",
        "translation": "Gathering your ears and focusing them on listening with joy, may the world speak to sentient beings based on their compassion.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　佛為一切眾生眼，　　為舍為救為歸趣，",
        "translation": "The Buddha is the eye of all sentient beings. He provides shelter, rescue, and refuge for them.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　能斷眾生諸有疑，　　憐愍世間利益者。",
        "translation": "He's able to cut off the doubts of sentient beings and pity those who have worldly benefits.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　如來善知諸過去，　　又能通達彼未來，",
        "translation": "The Enlightened One knows the past well, And can also know the future.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　於一切法不生疑，　　及以現在諸佛土。",
        "translation": "They don't give rise to doubt about all things, and they don't give rise to doubt about the buddha-lands of the present.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　通智法王論自在，　　出過三世妙如來，",
        "translation": "Master of the theories of the King of Universal Knowledge, he surpasses the wonderful Buddhas of past, present, and future.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　我今請問世間依，　　何等因緣現微笑？",
        "translation": "Now, I'll ask the worldly basis, What are the causes and conditions that make me smile?",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　佛能永斷他疑網，　　於一切法自無疑，",
        "translation": "The Buddha can forever eliminate the web of doubts of others. He himself has no doubt about anything.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　八音暢宣微妙法，　　善拔眾生憂毒箭。",
        "translation": "The subtle teachings of the eight sounds are fluently proclaimed, and they skillfully remove the poisonous arrow of sorrow for sentient beings.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　我心喜踊難陳說，　　合十指掌懷恭敬，",
        "translation": "With joy and reverence, I joined my palms with ten fingers in respect.",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "　　敢問法主大聖尊，　　何等因緣現微笑？』",
        "translation": "I dare to ask the Dharma lord, the great sage and honored one, What are the reasons he's smiling now?'",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "向佛合掌曲躬禮敬，即於佛前以頌問曰：「舍利子！",
        "translation": "He saluted the Buddha with joined palms and bowed his head in respect, and then asked him in verse before the Buddha, Śāriputra!",
        "source": "T11n0310_046:0271a05_7"
    },
    {
        "source_sentence": "爾時勝觀如來、應、正等覺告侍者曰：『苾芻！",
        "translation": "It was then that the Vaiśravaṇa Tathāgata, Arhat, and Completely Awakened One addressed the attendants, saying, 'Sir, monks!",
        "source": "T11n0310_046:0271a23_8"
    },
    {
        "source_sentence": "汝今見是嬰兒在我前不？』",
        "translation": "Do you now see this baby in front of me?'",
        "source": "T11n0310_046:0271a24_9"
    },
    {
        "source_sentence": "對曰：『唯然。",
        "translation": "He replied, 'Yes.",
        "source": "T11n0310_046:0271a24_10"
    },
    {
        "source_sentence": "我今已見。』",
        "translation": "Now, I've seen it.'",
        "source": "T11n0310_046:0271a24_11"
    },
    {
        "source_sentence": "勝觀佛言：『此嬰兒者，往昔過去曾於六十四拘胝那庾多百千佛所供養恭敬尊重讚歎，",
        "translation": "Vaiśeṣika Buddha said: In the past this infant was revered, venerated, honored, and praised by as many hundreds of thousands of buddhas as there are in sixty-four koṭis of universes.",
        "source": "T11n0310_046:0271a25_12"
    },
    {
        "source_sentence": "以諸衣服飲食臥具病緣醫藥及餘資物持用奉施彼諸佛已，為欲趣向三菩提故，",
        "translation": "Having given their robes, food and drink, bedding, medicine for curing illnesses, and other necessities to the buddhas, they want to dedicate themselves to the three kinds of enlightenment.",
        "source": "T11n0310_046:0271a27_13"
    },
    {
        "source_sentence": "又於過去十那庾多佛所修行梵行，迴向阿耨多羅三藐三菩提。",
        "translation": "Also, they cultivated religious practices at the places where ten nayutas of buddhas lived in the past and dedicated themselves back to unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_046:0271a29_14"
    },
    {
        "source_sentence": "苾芻當知，今是嬰兒所將大眾八萬四千，於過去世並是嬰兒本生父母。",
        "translation": "You should know, monks, that this is the eighty-four thousand people who were led by the baby now, and in a past life they were the parents of the baby's original birth.",
        "source": "T11n0310_046:0271b01_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_046:0271b03_16"
    },
    {
        "source_sentence": "此嬰兒者曾於過去發如是願：「願我經生在在處處所有父母，皆令安住於佛菩提。",
        "translation": "In the past, this little boy had made this vow, May my sūtras give birth to all the parents everywhere and cause them to live peacefully in the Buddha's enlightenment.",
        "source": "T11n0310_046:0271b03_17"
    },
    {
        "source_sentence": "又令諸母更無第二再受女身。」",
        "translation": "It also causes the mothers to have no second rebirth in the woman's body.",
        "source": "T11n0310_046:0271b05_18"
    },
    {
        "source_sentence": "由是願故，彼諸眾生至于今日，隨逐嬰兒來至我所，又隨修學發於無上正等覺心。』",
        "translation": "Because of this vow, those sentient beings today will follow the baby and come to me, and following their cultivation, they'll give rise to the mind of unsurpassed perfect enlightenment.'",
        "source": "T11n0310_046:0271b05_19"
    },
    {
        "source_sentence": "「『苾芻當觀此嬰兒，　　及現前住多千眾，",
        "translation": "'Monks, you should observe this baby and the many thousands of people who are staying there now.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　其心踊躍發誠言，　　願我當來如法主。",
        "translation": "Their hearts dance with joy and make sincere prayers, saying, May I be the Dharma lord in the future.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　當知曾於過去生，　　如上數量諸佛所，",
        "translation": "You should know that there was a past birth, As many buddha-places as above:",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　恭敬供養大導師，　　利益天人世間者。",
        "translation": "They venerate and offer support to the great guide, who benefits gods and humans in the world.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　於十那庾諸佛所，　　依佛捨家持正法，",
        "translation": "In the presence of ten billion buddhas, They relied on the Buddhas To abandon their homes and uphold the true teaching.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　常行最勝之所行，　　為求無上菩提故。",
        "translation": "They always practice what is most excellent, Because they seek supreme enlightenment.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　汝觀八萬四千眾，　　今現皆住如來前，",
        "translation": "You see the eighty-four thousand bodhisattvas who are now standing before the Buddha.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　曾於久遠過去世，　　悉是嬰兒之父母。",
        "translation": "In a long, distant past life They were all the parents of an infant.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　又此嬰兒曾發願，　　諸有生生父母者，",
        "translation": "Furthermore, this baby once made the vow To give birth to all those who are born as parents.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　普令安住上正覺，　　更不重受女人身。",
        "translation": "They cause all to abide in supreme perfect enlightenment, and they don't again experience the body of a woman.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　彼皆隨學嬰兒行，　　發菩提心於我所，",
        "translation": "They all follow the practice of children, Awakening the aspiration for enlightenment in my place.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　今我皆當授彼記，　　方將為世兩足尊。",
        "translation": "I will now give them all my predictions, and they will soon become the world's two-legged honored one.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　由此因緣現微笑，　　彼昔勝行我能知，",
        "translation": "Because of this cause and condition, he smiles now. I can know his past superior deeds.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　及以未來諸所作，　　當證人中大聖主。』",
        "translation": "And what's done in the future will be realized as the great sage among men.'",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　諸天龍神及人等，　　無量百千那庾多，",
        "translation": "The gods, dragons, spirits, humans, and so forth, Measureless hundreds of thousands of myriads of nayutas.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "　　聞佛為彼授記已，　　於勝觀尊生大喜。",
        "translation": "Having heard the Buddha give his prediction for them, they become greatly joyful to the venerable Vaiśravaṇa.",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "爾時勝觀如來欲重宣此義，為侍者苾芻而說是頌：「舍利子！",
        "translation": "It was then that the Vaiśravaṇa Tathāgata wanted to reiterate this meaning and spoke this verse for the attendant monk, Śāriputra!",
        "source": "T11n0310_046:0271b07_20"
    },
    {
        "source_sentence": "爾時嬰兒聞佛授記，心生歡喜踊躍無量，悅意泰然得未曾有，速疾往詣其父母所，",
        "translation": "At that moment, having heard the Buddha’s prediction, the infant was overjoyed and infinitely joyful. Delighted, he attained such an unprecedented state of bliss that he quickly approached his parents.",
        "source": "T11n0310_046:0271b25_21"
    },
    {
        "source_sentence": "「『如是多千眾，　　我前生父母，",
        "translation": "'So many thousands of people like this were born to my parents before me.",
        "source": "T11n0310_046:0271b27_22"
    },
    {
        "source_sentence": "　　皆已住菩提，　　父母心何趣？』",
        "translation": "They've all been abiding in enlightenment, so what's the destination of their parents' mind?'",
        "source": "T11n0310_046:0271b27_22"
    },
    {
        "source_sentence": "說伽他曰：「舍利子！",
        "translation": "He said to Kātyāyana, Śāriputra!",
        "source": "T11n0310_046:0271b27_22"
    },
    {
        "source_sentence": "「『如子志所趣，　　我心亦如是，",
        "translation": "'Just as the son's intention is to aim, so is my mind.",
        "source": "T11n0310_046:0271c01_23"
    },
    {
        "source_sentence": "　　當成一切智，　　此決定無疑。",
        "translation": "They will attain omniscience, and there's no doubt about this certainty.",
        "source": "T11n0310_046:0271c01_23"
    },
    {
        "source_sentence": "　　子已生我家，　　願後勿相捨，",
        "translation": "Your son has already been born in my house. Please do not let him go of me.",
        "source": "T11n0310_046:0271c01_23"
    },
    {
        "source_sentence": "　　常當憶念我，　　令速證菩提。』",
        "translation": "You should always remember me and quickly realize enlightenment.'",
        "source": "T11n0310_046:0271c01_23"
    },
    {
        "source_sentence": "爾時父母復以伽他報其子曰：「舍利子！",
        "translation": "It was then that the parents again reported to their son with a verse, saying, Śāriputra!",
        "source": "T11n0310_046:0271c01_23"
    },
    {
        "source_sentence": "「『我諸行化導，　　皆願先成佛，",
        "translation": "'All of my practices are guided by transformation, and I want to become a buddha first.",
        "source": "T11n0310_046:0271c06_24"
    },
    {
        "source_sentence": "　　最後我當成，　　照世人調御。』",
        "translation": "In the end, I will accomplish it, illuminating and regulating the world.'",
        "source": "T11n0310_046:0271c06_24"
    },
    {
        "source_sentence": "爾時嬰兒復以伽他報父母曰：「舍利子！",
        "translation": "It was then that the baby again reported to his parents with a verse, saying, Śāriputra!",
        "source": "T11n0310_046:0271c06_24"
    },
    {
        "source_sentence": "汝今當觀彼過去世勝觀如來法中嬰兒者，豈異人乎？",
        "translation": "You should now observe that in a past life, you've been observing the Tathāgata's teaching of superiorly observing the buddha-nature as a child, isn't it different from someone?",
        "source": "T11n0310_046:0271c09_25"
    },
    {
        "source_sentence": "勿作餘疑，今大自在天子是也。",
        "translation": "Don't have any other doubts, for this is the present Mahêśvaradeva.",
        "source": "T11n0310_046:0271c10_26"
    },
    {
        "source_sentence": "從是已後又經拘胝那庾多劫更不退墮，過是劫後生轉輪王聖種族中，彼當來父號曰名稱，",
        "translation": "After that he passed through many millions of aeons without regressing and was reborn in the family of the cakravartin kings. His father, Vimalakīrti, would be his only surname.",
        "source": "T11n0310_046:0271c11_27"
    },
    {
        "source_sentence": "如我今父淨飯大王；",
        "translation": "Suppose my present father, the Great King Jīvaka, is like this.",
        "source": "T11n0310_046:0271c13_28"
    },
    {
        "source_sentence": "彼當來母號曰離暗，如我今母摩訶摩耶；",
        "translation": "The future mother’s name will be Lici; just like the present-day mother of mine, Mahama yea.",
        "source": "T11n0310_046:0271c13_29"
    },
    {
        "source_sentence": "彼當來子號曰無憂，如我今子羅睺羅。",
        "translation": "That future son will be called Aśoka, just like the present-day son of mine, Rāhula.",
        "source": "T11n0310_046:0271c14_30"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0271c15_31"
    },
    {
        "source_sentence": "彼既出家悟菩提已得成為佛，名曰大悲如來、應、正等覺，十號具足。",
        "translation": "After leaving home and awakening to enlightenment, he becomes a buddha named the Tathāgata of Great Compassion, Arhat, Perfectly Enlightened One, whose ten names are complete.",
        "source": "T11n0310_046:0271c15_32"
    },
    {
        "source_sentence": "其佛壽量滿百千拘胝歲，佛身常光遍照所及十踰繕那，佛說法處大會充滿百踰繕那。",
        "translation": "The Buddha's life span was one hundred thousand koṭis of years, and the Buddha's body always shone brightly everywhere for ten yojanas, and the great assembly at the Buddha's preaching site filled it with a hundred yojanas.",
        "source": "T11n0310_046:0271c17_33"
    },
    {
        "source_sentence": "大悲如來處世教化，為度聲聞三會說法。",
        "translation": "The Greatly Compassionate Tathāgata lives in the world to teach and transform, teaching for the salvation of śrāvakas in three assemblies.",
        "source": "T11n0310_046:0271c19_34"
    },
    {
        "source_sentence": "第一大會度諸弟子有百拘胝，第二大會度諸弟子有那庾多拘胝，第三大會度諸弟子有百千那庾多拘胝。",
        "translation": "The first great assembly liberated the disciples by measuring one hundred thousand yojanas; the second great assembly liberated the disciples by measuring ten thousand yojanas; and the third great assembly liberated the disciples by measuring one hundred thousand yojanas.",
        "source": "T11n0310_046:0271c20_35"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0271c22_36"
    },
    {
        "source_sentence": "其弟子中滿一拘胝皆是大阿羅漢，諸漏已盡無復煩惱，得自在慧具八解脫，",
        "translation": "Among his disciples, all of them were great arhats for as long as one koṭis of kalpas. Having extinguished their defilements and no longer afflicted themselves, they attained the eight liberations endowed with unimpeded intellect.",
        "source": "T11n0310_046:0271c22_37"
    },
    {
        "source_sentence": "成就靜慮及六神通。",
        "translation": "He accomplishes meditation and the six supernormal powers.",
        "source": "T11n0310_046:0271c24_38"
    },
    {
        "source_sentence": "舍利子，大悲如來所度聲聞阿羅漢眾，如上所說三會數量，彼菩薩眾其數亦等，",
        "translation": "“O Śāriputra! The assembly of śrāvakas and arhats liberated by the Buddha Mahaparinirmita-vaśavartin is the same as the threefold assemblies mentioned above, with the number of bodhisattvas equal to these.",
        "source": "T11n0310_046:0271c25_39"
    },
    {
        "source_sentence": "皆是往世所生父母。",
        "translation": "They were all born by their parents in a previous life.",
        "source": "T11n0310_046:0271c26_40"
    },
    {
        "source_sentence": "彼佛世尊宣說妙法利益無數諸眾生已，然後涅槃。",
        "translation": "After that Buddha Bhagavān proclaims the wonderful teaching for the benefit of countless sentient beings, he then enters nirvāṇa.",
        "source": "T11n0310_046:0271c27_41"
    },
    {
        "source_sentence": "佛滅度後，正法住世滿拘胝歲，分布舍利饒益眾生，亦如我今般涅槃後，",
        "translation": "“After the parinirvana of this buddha, his true-dharma will remain in the world for as many kalpas as there are koṭis of years. He will distribute these relics to benefit sentient beings, just as I do now after my parinirvāṇa.",
        "source": "T11n0310_046:0271c28_42"
    },
    {
        "source_sentence": "流布供養等無有異。",
        "translation": "There's no difference between spreading offerings and so forth.",
        "source": "T11n0310_046:0272a01_43"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272a01_44"
    },
    {
        "source_sentence": "安住正勤菩薩摩訶薩亦復如是，修行毘利耶波羅蜜多時，為求阿耨多羅三藐三菩提故，",
        "translation": "So it is with the bodhisattva Mahāsattva Anāthapiṇḍika, who practices the perfection of vīrya because he seeks unexcelled complete perfect enlightenment.",
        "source": "T11n0310_046:0272a01_45"
    },
    {
        "source_sentence": "能於是經修行正行，倍增振發勇猛正勤大精進力，度脫無量諸眾生等。",
        "translation": "He's able to cultivate the correct practice of this sūtra, which doubles the power of courageous and correctly diligent great effort that liberates measureless sentient beings.",
        "source": "T11n0310_046:0272a03_46"
    },
    {
        "source_sentence": "我說是人為善丈夫，思覺觀察不倦不退，勇猛精進明繫在心。",
        "translation": "I say this person is a good man who contemplates, observes, and doesn't tire or retreat, and his courageous effort is clearly bound to his mind.",
        "source": "T11n0310_046:0272a05_47"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272a06_48"
    },
    {
        "source_sentence": "云何菩薩摩訶薩不倦精進？",
        "translation": "How does the bodhisattva Mahāsattva not tirelessly exert effort?",
        "source": "T11n0310_046:0272a07_49"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272a08_0"
    },
    {
        "source_sentence": "菩薩摩訶薩為眾生故求菩提時，不應限以數量而有所求。",
        "translation": "When bodhisattvas, mahāsattvas, and sentient beings seek enlightenment for the sake of sentient beings, they shouldn't limit their pursuit by number.",
        "source": "T11n0310_046:0272a08_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_046:0272a09_2"
    },
    {
        "source_sentence": "菩薩摩訶薩不作是念：『於爾所劫我當流轉。",
        "translation": "The bodhisattva Mahāsattva doesn't think, 'In such an eon, I will continue to transmigrate.",
        "source": "T11n0310_046:0272a09_3"
    },
    {
        "source_sentence": "於爾所劫我不流轉。』",
        "translation": "In that eon, I won't turn around.'",
        "source": "T11n0310_046:0272a10_4"
    },
    {
        "source_sentence": "以如是故，菩薩爾時被難思鎧處於生死，作是念言：『假使如我前際所經生死如是，",
        "translation": "Because of this, the enlightening beings at that time were armed with inconceivable armies and faced birth and death. They thought thus:",
        "source": "T11n0310_046:0272a11_5"
    },
    {
        "source_sentence": "更受勤苦經於生死倍過前際，為求菩提中無懈息。』",
        "translation": "Furthermore, the sūtras of suffering and suffering are twice as numerous as the previous ones in birth-and-death, so there's no laziness in seeking enlightenment.'",
        "source": "T11n0310_046:0272a13_6"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272a14_7"
    },
    {
        "source_sentence": "菩薩摩訶薩具足如是堅固弘誓，則名成就不倦精進。",
        "translation": "When the bodhisattva Mahāsattva fulfills such a resolute and great vow, it's called accomplishing unremitting effort.",
        "source": "T11n0310_046:0272a14_8"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0272a16_0"
    },
    {
        "source_sentence": "菩薩摩訶薩云何修行勇猛精進？",
        "translation": "How does the bodhisattva Mahāsattva cultivate courageous effort?",
        "source": "T11n0310_046:0272a16_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272a17_2"
    },
    {
        "source_sentence": "假使三千大千世界滿中熾火，發起勇猛正勤菩薩摩訶薩，為欲往覲彼如來故，",
        "translation": "“Even if the great enlightening beings were to go to see those buddhas, even if they were to set fire to a billion-world-galactic universe filled with flames and give rise to arousal of courageous zeal.",
        "source": "T11n0310_046:0272a17_3"
    },
    {
        "source_sentence": "以精進力於是熾火從中而過不怯不退。",
        "translation": "With the power of effort, he follows the blazing fire from within and doesn't become frightened or retreat.",
        "source": "T11n0310_046:0272a19_4"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0272a20_0"
    },
    {
        "source_sentence": "勇猛正勤菩薩摩訶薩，為求聽聞大菩薩藏微妙法門故，以精進力雖逢是火，",
        "translation": "The great enlightening being Courageous and correctly striving, seeking to hear the subtle teachings of the great treasury of enlightenment, encountered this fire through the power of energy.",
        "source": "T11n0310_046:0272a20_1"
    },
    {
        "source_sentence": "從中直過而無怯退。",
        "translation": "From the middle, he's straightforward and doesn't retreat with fear.",
        "source": "T11n0310_046:0272a22_0"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0272a22_1"
    },
    {
        "source_sentence": "假使三千大千世界滿中熾火，勇猛正勤菩薩摩訶薩，為欲宣說大菩薩藏深妙法故，",
        "translation": "“Even if the great enlightening being Burning with energy were to teach the profound and subtle teaching of the treasury of enlightenment in a billion worlds, how could it be possible for an enlightening being like this to do so?",
        "source": "T11n0310_046:0272a22_2"
    },
    {
        "source_sentence": "以精進力於是熾火從中直過而無怯退。",
        "translation": "With the power of his effort, he follows the blazing fire and goes straight through it without retreating.",
        "source": "T11n0310_046:0272a24_3"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0272a25_4"
    },
    {
        "source_sentence": "假使三千大千世界滿中熾火，勇猛正勤菩薩摩訶薩，為欲生起善根因緣，",
        "translation": "“Even if a great enlightening being were to give rise to the roots of goodness for the sake of sentient beings, it would be like this:",
        "source": "T11n0310_046:0272a25_5"
    },
    {
        "source_sentence": "以精進力於是熾火從中直過而無怯退。",
        "translation": "With the power of his effort, he follows the blazing fire and goes straight through it without retreating.",
        "source": "T11n0310_046:0272a27_6"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0272a28_7"
    },
    {
        "source_sentence": "假使三千大千世界滿中熾火，勇猛正勤菩薩摩訶薩，為欲利益諸眾生故，",
        "translation": "“Even if the great enlightening being Burning in the midst of a great chiliocosm were to make offerings to all sentient beings, how could it be possible for an enlightening being like this to do so?",
        "source": "T11n0310_046:0272a28_8"
    },
    {
        "source_sentence": "以精進力能於中過。",
        "translation": "With the power of effort, he's able to overcome them.",
        "source": "T11n0310_046:0272b01_9"
    },
    {
        "source_sentence": "如是為欲令他得寂靜故、得調伏故，雖逢是火，皆由中過而無怯退。",
        "translation": "Thus, because they want to cause others to attain quiescence and attain submission, even though they encounter this fire, they're all due to their middling faults and don't retreat from it.",
        "source": "T11n0310_046:0272b01_10"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0272b03_11"
    },
    {
        "source_sentence": "發起勇猛不倦正勤菩薩摩訶薩，為欲令他般涅槃故，以精進力雖逢是火，",
        "translation": "“Furthermore, the great enlightening beings who have undertaken to be courageous, tireless, and correctly striving are like this: because they want others to attain nirvana, yet through the power of effort they confront this fire.",
        "source": "T11n0310_046:0272b03_12"
    },
    {
        "source_sentence": "能於中過而無怯退。",
        "translation": "He's able to avoid the errors in them and doesn't retreat.",
        "source": "T11n0310_046:0272b05_13"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272b05_14"
    },
    {
        "source_sentence": "是名菩薩摩訶薩修行毘利耶波羅蜜多勇猛之相。",
        "translation": "This is called the characteristic of the boldness of the bodhisattva Mahāsattva's cultivation of the vṛji-pāramitā.",
        "source": "T11n0310_046:0272b06_0"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0272b08_0"
    },
    {
        "source_sentence": "發起勇猛不倦正勤菩薩摩訶薩行毘利耶波羅蜜多時，由不懈倦堅固不退善根所發無上大悲之所熏故，",
        "translation": "When the bodhisattva Mahāsattva who arouses courage and doesn't tire of right effort and practices the pāramitā of vīrya because it's perfumed by the unsurpassed great compassion that arises from the unremitting, resolute, non-backsliding good roots,",
        "source": "T11n0310_046:0272b08_1"
    },
    {
        "source_sentence": "恒發勇猛大精進力，於諸眾生常行化導。",
        "translation": "He always arouses the power of courageous great effort and always conducts himself in a transformative way to guide sentient beings.",
        "source": "T11n0310_046:0272b10_2"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0272b11_3"
    },
    {
        "source_sentence": "如是發起勇猛不倦正勤菩薩摩訶薩，於一切時舉足下足常不捨離大菩提心，",
        "translation": "“In this way, the enlightening beings who have undertaken to be courageous, unwearied, and correctly striving do not give up their determination for enlightenment at all times.",
        "source": "T11n0310_046:0272b11_4"
    },
    {
        "source_sentence": "於佛法僧恒生珍敬繫念在前，於諸眾生恒遍觀察為利益故，不欲令被煩惱勢力之所逼奪。",
        "translation": "Because they always have jeweled respect for the Buddha, Dharma, and saṃgha in front of them, they always observe sentient beings everywhere for their benefit and don't want to be suppressed by the power of afflictions.",
        "source": "T11n0310_046:0272b13_5"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0272b15_6"
    },
    {
        "source_sentence": "發起勇猛不倦正勤菩薩摩訶薩，所有已生諸妙善根一切迴向無上菩提，",
        "translation": "“Furthermore, the great enlightening beings who have undertaken heroic and indefatigable correct effort dedicate all the roots of goodness they have already produced to unexcelled awakening.",
        "source": "T11n0310_046:0272b16_7"
    },
    {
        "source_sentence": "令此善根畢竟無盡。",
        "translation": "It causes these good roots to be ultimately inexhaustible.",
        "source": "T11n0310_046:0272b17_8"
    },
    {
        "source_sentence": "譬如少水投于大海，乃至劫燒中無有盡。",
        "translation": "It's like throwing a little water into the ocean that doesn't run out even for an eon of burning.",
        "source": "T11n0310_046:0272b18_9"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272b19_10"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，以諸善根迴向菩提亦無有盡，是名菩薩摩訶薩勇猛不倦大精進力。",
        "translation": "Similarly, the bodhisattva Mahāsattva dedicates his good roots to enlightenment without limit, which is called the great effort of the bodhisattva Mahāsattva's courage and untiring great zeal.",
        "source": "T11n0310_046:0272b19_11"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0272b21_12"
    },
    {
        "source_sentence": "勇猛不倦精進菩薩摩訶薩，以平等行積集善根，於諸眾生起平等行積集善根，",
        "translation": "“Furthermore, the great enlightening being Courageous and indefatigable Energy, by means of his impartial practice accumulating roots of goodness, produces equal practice for all sentient beings and accumulates roots of goodness.",
        "source": "T11n0310_046:0272b21_13"
    },
    {
        "source_sentence": "為欲引生一切智智積集善根，為欲利益諸眾生故積集善根。",
        "translation": "He accumulates good roots because he wants to produce omniscience and knowledge, and he accumulates good roots because he wants to benefit sentient beings.",
        "source": "T11n0310_046:0272b23_14"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272b25_0"
    },
    {
        "source_sentence": "如是無量諸大善根，皆是菩薩摩訶薩勇猛無倦大精進力之所集起。",
        "translation": "Such measureless great good roots are all produced by the bodhisattva-mahāsattva's courageous and tireless great effort.",
        "source": "T11n0310_046:0272b25_1"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0272b27_0"
    },
    {
        "source_sentence": "如是勇猛不倦正勤菩薩摩訶薩，常應精進修學是法，所得福聚無量無邊。",
        "translation": "Thus, the bodhisattva Mahāsattva who is courageous, tireless, and correctly diligent should always exert effort to cultivate this teaching, and the accumulation of merit that he attains is immeasurable and limitless.",
        "source": "T11n0310_046:0272b27_1"
    },
    {
        "source_sentence": "今當廣說福聚之相。",
        "translation": "Now, we'll explain in detail the characteristics of the stock of merit.",
        "source": "T11n0310_046:0272b29_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272b29_1"
    },
    {
        "source_sentence": "我觀世間一切眾生所有福聚無量無邊，如是乃至一切有學無學所有福聚、一切獨覺所有福聚，",
        "translation": "I observe the boundless and infinite accumulations of merits of all sentient beings in the world, up to the accumulations of merits of all those who are still learning and those who have no more learning to do, and the accumulations of merits of all self-enlightened ones.",
        "source": "T11n0310_046:0272b29_2"
    },
    {
        "source_sentence": "轉復無量不可思議。",
        "translation": "It's also immeasurable and inconceivable.",
        "source": "T11n0310_046:0272c02_3"
    },
    {
        "source_sentence": "如上所有諸福聚等，假使皆悉內置眾生一毛孔中，如是眾生一一毛孔皆有如上福德之聚，",
        "translation": "Suppose all the accumulations of merits and so forth as described above were to be placed inside a single pore of sentient beings, and each pore of sentient beings like this had an accumulation of virtues as described above.",
        "source": "T11n0310_046:0272c03_4"
    },
    {
        "source_sentence": "無量無邊不可思議。",
        "translation": "They are immeasurable, limitless, and inconceivable.",
        "source": "T11n0310_046:0272c05_5"
    },
    {
        "source_sentence": "如是假使一切眾生一切毛孔所有福聚合集，置一無關鍵會大法祠中。",
        "translation": "Thus, suppose all sentient beings and all the accumulations of merit in their pores are collected together and placed in a single, keyless assembly in a great Dharma shrine.",
        "source": "T11n0310_046:0272c06_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272c07_1"
    },
    {
        "source_sentence": "如是法祠功德福聚倍增于百，感得如來大丈夫身色相之一。",
        "translation": "Thus, the merit of this Dharma-sacrifice doubles by a hundredthree times for the accumulation of merit and merit, which will result in the attainment of the form and characteristics of the Tathāgata's body as a great man.",
        "source": "T11n0310_046:0272c07_2"
    },
    {
        "source_sentence": "如是一一大丈夫相，皆以如是功德所成。",
        "translation": "Each and every one of these marks of a great person is formed by such merit.",
        "source": "T11n0310_046:0272c09_3"
    },
    {
        "source_sentence": "如是一切如來身中大丈夫相，所有福聚皆合成一眉間毫相。",
        "translation": "Thus, these are the marks of a great person in the bodies of all the Tathāgatas, and all the clusters of merit that they have combined into one tuft of hair between their eyebrows.",
        "source": "T11n0310_046:0272c10_4"
    },
    {
        "source_sentence": "如是入一眉間毫相福聚，又過於此滿百千倍大功德聚，合成如來頂上無能觀見烏瑟膩沙大丈夫相。",
        "translation": "Thus, he enters the tiny mark of merit between one eyebrow and fills it with a hundred thousand times greater amount of great merit than this, which combines to form the Tathāgata's topknot that doesn't allow him to contemplate the characteristics of Ustinīṣa as a great man.",
        "source": "T11n0310_046:0272c11_5"
    },
    {
        "source_sentence": "如是入一肉髻大功德聚，又過於此滿於拘胝百千倍大功德聚，合成如來大法商佉之相。",
        "translation": "Thus, he enters the great cluster of merit in a single flesh topknot and fills it with a hundred thousand times the great cluster of merit more than that, which combines the characteristics of the Tathāgata's great dharma-trading merchantship.",
        "source": "T11n0310_046:0272c13_6"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272c15_7"
    },
    {
        "source_sentence": "由此如來大法螺相為無量種功德集成，以如是故，如來隨所意欲出大音聲遍告無量無邊一切世界，",
        "translation": "Because of this, the characteristics of the great conch of teaching of Buddha are a collection of innumerable kinds of virtues. And because of this, the Buddha can emanate from any place wherever he wishes to utter a loud voice telling infinite and boundless all worlds:",
        "source": "T11n0310_046:0272c16_8"
    },
    {
        "source_sentence": "為諸有情廣說妙法，如其根性隨聞信解悉令歡喜。",
        "translation": "He explains the wonderful Dharma in detail for sentient beings, causing them to rejoice as their faculties are naturally endowed with hearing and believing.",
        "source": "T11n0310_046:0272c18_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_046:0272c19_10"
    },
    {
        "source_sentence": "皆由精進所修學故。",
        "translation": "It's all because it's cultivated by effort.",
        "source": "T11n0310_046:0272c19_11"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272c20_12"
    },
    {
        "source_sentence": "菩薩摩訶薩應作是念：『如是無上正等菩提雖極難得，我當不捨精進鎧甲發大勇猛，",
        "translation": "“Great enlightening beings should think thus: Though such supreme perfect enlightenment is extremely difficult to attain, I will not give up the armor of effort and become greatly courageous.",
        "source": "T11n0310_046:0272c20_13"
    },
    {
        "source_sentence": "必定速悟無上菩提不足為難。",
        "translation": "It's not difficult to quickly realize unsurpassed enlightenment.",
        "source": "T11n0310_046:0272c22_14"
    },
    {
        "source_sentence": "既成佛已隨我意欲，於法螺相出大音聲，遍告無量無邊一切世界，為諸眾生說微妙法，",
        "translation": "Having attained buddhahood, he emanated from the constellation of the Teaching according to my wishes in all worlds throughout the ten directions and taught the subtle Dharma to living beings.",
        "source": "T11n0310_046:0272c23_15"
    },
    {
        "source_sentence": "隨根信解皆令歡喜。』",
        "translation": "They'll all rejoice according to their faculties, faith, and understanding.'",
        "source": "T11n0310_046:0272c25_16"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272c25_17"
    },
    {
        "source_sentence": "是名菩薩摩訶薩勇猛無倦正勤之相。",
        "translation": "This is called the characteristic of a bodhisattva-mahāsattva's courageous, tireless, and correctly diligent form.",
        "source": "T11n0310_046:0272c25_18"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0272c27_0"
    },
    {
        "source_sentence": "勇猛無倦精進菩薩摩訶薩依毘利耶波羅蜜多故，常應如是精進修學，由修學故具足成就一切智慧。",
        "translation": "Because the bold and tirelessly energetic bodhisattva Mahāsattva relies on the vṛji-pāramitā, he should always thus diligently cultivate it, and because of cultivating it, he fully accomplishes all wisdom.",
        "source": "T11n0310_046:0272c27_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0272c29_2"
    },
    {
        "source_sentence": "假使三千大千世界所有眾生，一切成就隨信行智，即用此智欲以比一成就隨法行智，",
        "translation": "“Even if all sentient beings in the great manifold cosmos had attained knowledge of faith-followers, they would use this knowledge to compare one with another and attain knowledge of doctrine-followers.",
        "source": "T11n0310_046:0272c29_3"
    },
    {
        "source_sentence": "百分不及一、千分不及一、百千萬分不及一、僧佉分不及一、迦羅分不及一、伽拏那分不及一、烏波摩分不及一、烏波尼沙陀分不及一。",
        "translation": "A hundred parts don't reach one, a thousand parts don't reach one, a hundred million parts don't reach one, a part of the saṃgha doesn't reach one, a part of the kalala doesn't reach one, a part of the kaṭhina doesn't reach one, a part of the upama doesn't reach one, and a part of the uponiṣada",
        "source": "T11n0310_046:0273a02_4"
    },
    {
        "source_sentence": "復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0273a05_5"
    },
    {
        "source_sentence": "假使三千大千世界所有眾生，一切成就隨法行智，欲以比一第八人智，",
        "translation": "Suppose all the sentient beings in the great manifold cosmos were to perfect knowledge of the practice of doctrine, wanting to compare it to the knowledge of one and the eighth:",
        "source": "T11n0310_046:0273a06_6"
    },
    {
        "source_sentence": "百分不及一，乃至烏波尼沙陀分不及一。",
        "translation": "A hundred parts won't be one, and even a part of Upanissada won't be one.",
        "source": "T11n0310_046:0273a07_7"
    },
    {
        "source_sentence": "復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0273a08_8"
    },
    {
        "source_sentence": "假使三千大千世界所有眾生，一切成就第八人智，欲以比一預流果智，",
        "translation": "Suppose all sentient beings in the 3,000 great one-thousand worlds had attained the eighth human knowledge and wanted to compare it to the knowledge of stream-winner.",
        "source": "T11n0310_046:0273a09_9"
    },
    {
        "source_sentence": "百分不及一，乃至烏波尼沙陀分不及一。",
        "translation": "A hundred parts won't be one, and even a part of Upanissada won't be one.",
        "source": "T11n0310_046:0273a10_10"
    },
    {
        "source_sentence": "復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0273a11_11"
    },
    {
        "source_sentence": "假使三千大千世界所有眾生，一切成就預流果智，欲以比一乃至一來向智，",
        "translation": "Suppose all the sentient beings in a thousand great one-thousand worlds were to perfect the knowledge of the fruit of stream-entry, wanting to compare it with the knowledge of one up to one coming.",
        "source": "T11n0310_046:0273a11_12"
    },
    {
        "source_sentence": "如是一來果智乃至欲比不還果智，如是乃至欲比阿羅漢智、若獨覺智、若過百劫菩薩智、若成就不退轉菩薩智，",
        "translation": "Thus, this is the cognition of the fruit of once-returning or even the cognition of the fruit of nonreturning in proportion to desire, and thus it's up to the cognition of arhatship in proportion to desire, if it's the cognition of self-enlightened, bodhisattva cognition over a hundred eons, and bodhisattva cognition",
        "source": "T11n0310_046:0273a13_13"
    },
    {
        "source_sentence": "如是乃至欲比繫屬一生菩薩智，皆應廣說無量無邊算數譬喻所不能及。",
        "translation": "In this way, up to the one who belongs to a bodhisattva knowledge of one lifetime belonging to the fetters of desire as compared with these, all should be spoken of elaborately and in detail.",
        "source": "T11n0310_046:0273a16_14"
    },
    {
        "source_sentence": "如是舍利子！",
        "translation": "So it is, Śāriputra!",
        "source": "T11n0310_046:0273a17_15"
    },
    {
        "source_sentence": "假使十方無量無邊一切世界所有眾生，皆悉成就繫屬一生菩薩之智，欲比如來十力之一處非處智，",
        "translation": "Suppose all the sentient beings in all the infinite and boundless worlds of the ten directions had all perfected the knowledge of enlightening beings who were bound to one lifetime, wanting to be like the Buddha’s knowledge of the ten powers of buddhahood.",
        "source": "T11n0310_046:0273a18_16"
    },
    {
        "source_sentence": "百分千分百千萬分不及一、僧佉分不及一、迦羅分不及一、伽拏那分不及一、烏波摩分不及一、烏波尼沙陀分不及一，",
        "translation": "A hundred parts of a thousand parts and a hundred million parts don't amount to one, a part of the saṃgha doesn't amount to one, a part of the kalala doesn't amount to one, a part of the kaṭhina doesn't amount to one, a part of the upama doesn't amount to one, and a part of the upanisadhā doesn't amount to",
        "source": "T11n0310_046:0273a20_17"
    },
    {
        "source_sentence": "乃至算數譬喻所不能及。",
        "translation": "It's beyond the ability of calculation and metaphor.",
        "source": "T11n0310_046:0273a23_18"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0273a23_19"
    },
    {
        "source_sentence": "是菩薩摩訶薩行毘利耶波羅蜜多故，聞如來如是甚深智解之時，其心不驚無有怖畏，",
        "translation": "“Furthermore, when great enlightening beings practice the perfection of vīrya-pāramitā, their minds are not frightened or terrified when they hear this profound knowledge and understanding of buddhas.",
        "source": "T11n0310_046:0273a24_20"
    },
    {
        "source_sentence": "於是智人生樂欲心，發起正勤中無廢捨，作如是念：『我今修行勇猛精進，",
        "translation": "Having arisen with a mind imbued with desire for enlightenment, he does not give up the discipline of right effort. He thinks:",
        "source": "T11n0310_046:0273a26_21"
    },
    {
        "source_sentence": "假使我身皮肉骨血筋脈髓腦皆悉枯燥爛壞無遺，未得如來如是處非處智力已來，",
        "translation": "Suppose my body, skin, flesh, bones, flesh, blood, tendons, veins, marrow, and brain were all dried up and disintegrated without remainder, but I hadn't yet attained the Tathāgata's such-and-such wisdom power.",
        "source": "T11n0310_046:0273a27_22"
    },
    {
        "source_sentence": "於其中間發大勇猛堅固精進終無懈廢。』",
        "translation": "Among them, he gives rise to great courage and resolute effort without laziness.'",
        "source": "T11n0310_046:0273a29_23"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0273b01_24"
    },
    {
        "source_sentence": "是名菩薩摩訶薩勇猛無倦正勤波羅蜜多堅固之相。",
        "translation": "This is called the resolute characteristic of the bodhisattva Mahāsattva's courageous, tireless, and correctly diligent form of the perfection of diligence.",
        "source": "T11n0310_046:0273b01_25"
    },
    {
        "source_sentence": "應如是學。",
        "translation": "You should thus train.",
        "source": "T11n0310_046:0273b03_26"
    },
    {
        "source_sentence": "復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0273b03_27"
    },
    {
        "source_sentence": "菩薩摩訶薩行毘利耶波羅蜜多故，發大勇猛無倦正勤，常應如是精進修學。",
        "translation": "Because the bodhisattva Mahāsattva practices the perfection of vīrya, he arouses great courage and doesn't tire of right effort, and he should always thus diligently cultivate it.",
        "source": "T11n0310_046:0273b03_28"
    },
    {
        "source_sentence": "由修學故，能滅眾生諸煩惱火。",
        "translation": "Because of their cultivation, they're able to extinguish the fires of afflictions in sentient beings.",
        "source": "T11n0310_046:0273b05_29"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0273b06_30"
    },
    {
        "source_sentence": "假使一切眾生於過去世所有諸心，皆入眾生一心中轉。",
        "translation": "Suppose all sentient beings' minds in past lives were to enter into the single mind of sentient beings and turn it.",
        "source": "T11n0310_046:0273b06_31"
    },
    {
        "source_sentence": "如是眾生一一諸心，乃至一切眾生一一各有爾所諸心，無量繁雜難可了知。",
        "translation": "Thus, each of these minds of sentient beings and each of those minds that exist in all sentient beings are immeasurable, complicated, and difficult to understand.",
        "source": "T11n0310_046:0273b07_32"
    },
    {
        "source_sentence": "如是一切眾生一一心中，各具無量貪瞋癡等諸惑繁雜。",
        "translation": "Thus, all sentient beings are each endowed with measureless afflictions like greed, anger, and delusion in their minds.",
        "source": "T11n0310_046:0273b09_33"
    },
    {
        "source_sentence": "以此一切眾生所有煩惱，皆入一眾生一心中轉。",
        "translation": "Because all the afflictions of all sentient beings enter into one sentient being's single mind and are transformed by one sentient being.",
        "source": "T11n0310_046:0273b10_34"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0273b11_35"
    },
    {
        "source_sentence": "假使展轉一切眾生，皆具如是無量煩惱難可了知。",
        "translation": "Suppose all sentient beings in turn have such measureless afflictions that it's difficult to know.",
        "source": "T11n0310_046:0273b11_36"
    },
    {
        "source_sentence": "菩薩摩訶薩作如是念：『我當策勵勇猛發勤精進，尋求如是智慧資糧，",
        "translation": "“Great enlightening beings think, ‘Should I be encouraged and motivated to seek this store of knowledge?",
        "source": "T11n0310_046:0273b13_37"
    },
    {
        "source_sentence": "隨我所發正勤之力，於諸眾生貪瞋癡火及餘熱惱我要當令息滅無遺，斬除毒害摧破散壞同於灰燼，",
        "translation": "According to the power of my arousal of right effort, I will extinguish the fires of craving, anger, delusion, and other burning afflictions in sentient beings. I will cause them to cease without residue, eliminate their poisonous effects, destroying and disintegrating them as if they were ashes.",
        "source": "T11n0310_046:0273b14_38"
    },
    {
        "source_sentence": "速令眾生住涅槃道。』",
        "translation": "Quickly cause sentient beings to abide in the path of nirvāṇa.'",
        "source": "T11n0310_046:0273b17_39"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0273b17_40"
    },
    {
        "source_sentence": "是名菩薩摩訶薩勇猛無倦正勤波羅蜜多。",
        "translation": "This is called the bodhisattva-mahāsattva's bold, tireless, and correctly diligent perfection of effort.",
        "source": "T11n0310_046:0273b17_41"
    },
    {
        "source_sentence": "應如是學。",
        "translation": "You should thus train.",
        "source": "T11n0310_046:0273b18_42"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_046:0273b19_0"
    },
    {
        "source_sentence": "菩薩摩訶薩依毘利耶波羅蜜多故，安住勇猛無倦精進，常應如是正勤修學。",
        "translation": "Because the bodhisattva Mahāsattva relies on the vīrya-pāramitā, he abides in courageous and tireless effort, which should always be cultivated with such correct diligence.",
        "source": "T11n0310_046:0273b19_1"
    },
    {
        "source_sentence": "以修學故，諸善身業無有休廢，諸善語業無有休廢，諸善心業無有休廢，",
        "translation": "Good bodily deeds are not abandoned through meditation, good verbal deeds are not abandoned, and good mental deeds are not abandoned.",
        "source": "T11n0310_046:0273b21_2"
    },
    {
        "source_sentence": "乃至所有一切正勤皆為方便策進菩薩身語心業。",
        "translation": "All of his or her correct effort is directed toward the bodhisattva's physical, verbal, and mental actions for the sake of skillful means.",
        "source": "T11n0310_046:0273b22_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0273b23_4"
    },
    {
        "source_sentence": "然諸世間但說菩薩身語二業精進第一，不說菩薩心精進相。",
        "translation": "However, the world simply says that the bodhisattva's body and speech are the first in terms of the two kinds of karmic effort, but it doesn't explain the characteristics of the bodhisattva's mental effort.",
        "source": "T11n0310_046:0273b24_5"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0273b25_6"
    },
    {
        "source_sentence": "菩薩摩訶薩心精進相無量無邊，吾今略說。",
        "translation": "The characteristics of the mind's effort of bodhisattvas, mahāsattvas, are immeasurable and limitless, so I'll explain them briefly.",
        "source": "T11n0310_046:0273b25_7"
    },
    {
        "source_sentence": "何等名為心精進相？",
        "translation": "What's called the characteristic of mental exertion?",
        "source": "T11n0310_046:0273b26_8"
    },
    {
        "source_sentence": "謂菩薩心修行正勤若進若止，如是為相。",
        "translation": "These are the characteristics of a bodhisattva's mind that cultivates right effort, whether it advances or stops, such as this.",
        "source": "T11n0310_046:0273b27_9"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0273b28_10"
    },
    {
        "source_sentence": "云何名為正勤進止？",
        "translation": "What's called right effort that advances and stops?",
        "source": "T11n0310_046:0273b28_11"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0273b28_12"
    },
    {
        "source_sentence": "菩薩修行大精進者，為菩提故勤行精進。",
        "translation": "A bodhisattva cultivates great effort because he diligently practices effort for the sake of enlightenment.",
        "source": "T11n0310_046:0273b28_13"
    },
    {
        "source_sentence": "所言進者於諸眾生發起大悲，所言止者謂無我忍。",
        "translation": "What's called advancement is the arousal of great compassion for sentient beings, and what's called stopping refers to the tolerance of selflessness.",
        "source": "T11n0310_046:0273b29_14"
    },
    {
        "source_sentence": "所言進者攝諸眾生，所言止者於法不取。",
        "translation": "What's called advancement includes sentient beings, and what's called cessation doesn't grasp the teaching.",
        "source": "T11n0310_046:0273c02_0"
    },
    {
        "source_sentence": "所言進者生死無倦，所言止者不得三界。",
        "translation": "What's called progressing is birth and death without weariness, and what's called stopping is not attaining the three realms.",
        "source": "T11n0310_046:0273c02_1"
    },
    {
        "source_sentence": "所言進者一切盡捨，所言止者不厭布施。",
        "translation": "What's called advancement is completely abandoned, and what's called stopping is not disillusioned with generosity.",
        "source": "T11n0310_046:0273c03_2"
    },
    {
        "source_sentence": "所言進者攝取淨戒，所言止者不厭尸羅。",
        "translation": "What's called advancement takes in the pure precepts, and what's called stopping doesn't tire of śīla.",
        "source": "T11n0310_046:0273c04_3"
    },
    {
        "source_sentence": "所言進者堪忍眾苦，所言止者心無毀壞。",
        "translation": "Those who say they're advancing are capable of enduring all kinds of suffering, and those who say they're calming their minds without disfiguring them.",
        "source": "T11n0310_046:0273c05_4"
    },
    {
        "source_sentence": "所言進者起諸善法，所言止者心常遠離。",
        "translation": "What's called advancement gives rise to good qualities, and what's called cessation is always free of mind.",
        "source": "T11n0310_046:0273c06_5"
    },
    {
        "source_sentence": "所言進者攝受靜慮，所言止者心常寂滅。",
        "translation": "What's called advancement is taking in meditation, and what's called calming is the mind that's always quiescent.",
        "source": "T11n0310_046:0273c07_6"
    },
    {
        "source_sentence": "所言進者聞法無厭，所言止者如理善巧。",
        "translation": "Those who say they're advancing don't tire of hearing the teaching, and those who say they're stopping are skillful according to principle.",
        "source": "T11n0310_046:0273c08_7"
    },
    {
        "source_sentence": "所言進者聽說無倦，所言止者無戲論法。",
        "translation": "Those who say they advance don't tire of listening, and those who say they stop don't discuss the teaching.",
        "source": "T11n0310_046:0273c09_8"
    },
    {
        "source_sentence": "所言進者求慧資糧，所言止者斷諸戲論。",
        "translation": "What's called advancement is seeking the accumulation of wisdom, and what's called stopping is cutting off conceptual elaborations.",
        "source": "T11n0310_046:0273c10_9"
    },
    {
        "source_sentence": "所言進者增長梵信，所言止者真知行捨。",
        "translation": "What's called advancement increases religious faith, and what's called cessation really knows the practice of equanimity.",
        "source": "T11n0310_046:0273c11_10"
    },
    {
        "source_sentence": "所言進者具五神通，所言止者遍知漏盡。",
        "translation": "What's called advancement has five supernormal powers, and what's called cessation is the pervasive knowledge of the end of contaminants.",
        "source": "T11n0310_046:0273c12_11"
    },
    {
        "source_sentence": "所言進者修諸念處，所言止者念無功用。",
        "translation": "What's called advancement is cultivating the abode of mindfulness, and what's called cessation is thought without exertion.",
        "source": "T11n0310_046:0273c13_12"
    },
    {
        "source_sentence": "所言進者正斷方便，所言止者善惡俱捨。",
        "translation": "What's called advancement is the method of correctly eliminating, and what's called cessation is the equanimity of both good and bad.",
        "source": "T11n0310_046:0273c14_13"
    },
    {
        "source_sentence": "所言進者引發神足，所言止者任運作用。",
        "translation": "What's called advancement gives rise to miraculous abilities, and what's called stopping freely functions.",
        "source": "T11n0310_046:0273c15_14"
    },
    {
        "source_sentence": "所言進者諸根善權，所言止者觀非根性。",
        "translation": "What's called advancement refers to the faculties that are good and expedient, and what's called cessation refers to contemplation that's not the nature of faculties.",
        "source": "T11n0310_046:0273c16_15"
    },
    {
        "source_sentence": "所言進者攝受諸力，所言止者智無制伏。",
        "translation": "What's called advancement is to gather in the powers, and what's called cessation is wisdom that has no restraints.",
        "source": "T11n0310_046:0273c17_16"
    },
    {
        "source_sentence": "所言進者生菩提分，所言止者智簡擇法。",
        "translation": "What's called advancement is the aspect of enlightenment that gives rise to what's called cessation, and what's called stopping is wisdom that briefly discerns qualities.",
        "source": "T11n0310_046:0273c18_0"
    },
    {
        "source_sentence": "所言進者求道資糧，所言止者無來往性。",
        "translation": "What's called advancement is seeking the accumulation of the path, and what's called stopping has no past or future nature.",
        "source": "T11n0310_046:0273c18_1"
    },
    {
        "source_sentence": "所言進者求奢摩他，所言止者心住寂止。",
        "translation": "What's called advancement is seeking quietude, and what's called calming is the mind abiding in quiescence.",
        "source": "T11n0310_046:0273c19_2"
    },
    {
        "source_sentence": "所言進者資助勝觀，所言止者伺察法性。",
        "translation": "What's called advancement is to assist superior contemplation, and what's called cessation is to examine the Dharma nature.",
        "source": "T11n0310_046:0273c20_3"
    },
    {
        "source_sentence": "所言進者隨覺諸因，所言止者諸因遍智。",
        "translation": "What's called advancement follows the causes that are perceived, and what's called cessation is the pervasive knowledge of causes.",
        "source": "T11n0310_046:0273c21_4"
    },
    {
        "source_sentence": "所言進者從他聞音，所言止者如法修行。",
        "translation": "What's called advancement is heard from others, and what's called stopping is cultivated according to the teaching.",
        "source": "T11n0310_046:0273c22_5"
    },
    {
        "source_sentence": "所言進者謂身莊嚴，所言止者謂法性身。",
        "translation": "The expression advancement refers to the adornment of the body. The expression stillness means the Dharma body.",
        "source": "T11n0310_046:0273c23_6"
    },
    {
        "source_sentence": "所言進者謂語莊嚴，所言止者聖默然性。",
        "translation": "What's called advancement refers to the verbal adornment, and what's called cessation is the noble silent nature.",
        "source": "T11n0310_046:0273c24_7"
    },
    {
        "source_sentence": "所言進者信解脫門，所言止者無有發起。",
        "translation": "What's called advancement is the gate of faith and liberation, and what's called cessation has no arousal.",
        "source": "T11n0310_046:0273c25_8"
    },
    {
        "source_sentence": "所言進者遠離四魔，所言止者捨煩惱習。",
        "translation": "What's called advancement is being free of the four Māras, and what's called cessation is abandoning the afflictive habits.",
        "source": "T11n0310_046:0273c26_9"
    },
    {
        "source_sentence": "所言進者方便善巧，所言止者觀察深慧。",
        "translation": "What's called advancement is skillful means, and what's called cessation is the profound wisdom of observing.",
        "source": "T11n0310_046:0273c27_10"
    },
    {
        "source_sentence": "所言進者觀察緣境，所言止者無功用觀。",
        "translation": "What's called advancement is observing objects as perceptual objects, and what's called cessation is observing effortlessly.",
        "source": "T11n0310_046:0273c28_11"
    },
    {
        "source_sentence": "所言進者觀察假名，所言止者了達實義。",
        "translation": "What's called advancement observes nominal names, and what's called cessation understands the true meaning.",
        "source": "T11n0310_046:0273c29_12"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0274a01_13"
    },
    {
        "source_sentence": "諸如是等進止之相，是名菩薩摩訶薩唯心精進。",
        "translation": "Such signs of advancement and cessation are called the bodhisattva-mahāsattva's only mental effort.",
        "source": "T11n0310_046:0274a01_14"
    },
    {
        "source_sentence": "若諸菩薩摩訶薩聞如是等心精進相，應當發起勇猛無倦具足正勤。",
        "translation": "If bodhisattvas, mahāsattvas, hear such signs of mental exertion, they should give rise to courageous and tirelessly fulfilled right effort.",
        "source": "T11n0310_046:0274a02_15"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_046:0274a04_16"
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩修行正勤波羅蜜多無有厭倦勇猛精進修習之相。",
        "translation": "Thus, this is called the characteristic of the bodhisattva Mahāsattva's cultivation of the perfection of right effort that has no sign of weariness and courageous exertion.",
        "source": "T11n0310_046:0274a04_17"
    },
    {
        "source_sentence": "大寶積經卷第四十六",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 46",
        "source": "T11n0310_046:0274a06_0"
    }
]