[
    {
        "source_sentence": "大寶積經卷第一百一十四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1, Volume 14",
        "source": "T11n0310_114:0644b05_0"
    },
    {
        "source_sentence": "北涼沙門釋道龔譯",
        "translation": "Northern Liang translated by the ascetic Shi Daogong",
        "source": "T11n0310_114:0644b07_0"
    },
    {
        "source_sentence": "寶梁聚會第四十四阿蘭若比丘品第",
        "translation": "Chapter Fourty-fourth Chapter of the Arāya Bhikṣu Chapter of the Jeweled Assembly",
        "source": "T11n0310_114:0644b08_0"
    },
    {
        "source_sentence": "五",
        "translation": "five",
        "source": "T11n0310_114:0644b09_0"
    },
    {
        "source_sentence": "爾時摩訶迦葉白佛言：「世尊！",
        "translation": "It was then that Mahākāśyapa said to the Buddha, Bhagavān!",
        "source": "T11n0310_114:0644b10_0"
    },
    {
        "source_sentence": "若有比丘自言阿蘭若比丘，世尊！",
        "translation": "If a monk says he's an arhat monk, Bhagavān!",
        "source": "T11n0310_114:0644b10_1"
    },
    {
        "source_sentence": "齊幾所名阿蘭若比丘？",
        "translation": "How many monks are called Ārājñāta bhikṣus in Qi?",
        "source": "T11n0310_114:0644b11_2"
    },
    {
        "source_sentence": "齊幾所名乞食比丘？",
        "translation": "How many monks are called begging for food in the same way?",
        "source": "T11n0310_114:0644b11_3"
    },
    {
        "source_sentence": "齊幾所名畜糞掃衣比丘？",
        "translation": "How many monks in Qi are called the monks who store dung and sweep robes?",
        "source": "T11n0310_114:0644b12_4"
    },
    {
        "source_sentence": "齊幾所名樹下比丘？",
        "translation": "How many monks are there at the foot of a tree?",
        "source": "T11n0310_114:0644b13_0"
    },
    {
        "source_sentence": "齊幾所名塚間比丘？",
        "translation": "How many monks are there in Qi called'monks in the tomb?'",
        "source": "T11n0310_114:0644b13_1"
    },
    {
        "source_sentence": "齊幾所名露處比丘？」",
        "translation": "How many are the names of the monks in the open?",
        "source": "T11n0310_114:0644b13_2"
    },
    {
        "source_sentence": "佛告迦葉：「阿蘭若比丘，必樂阿蘭若處、住阿蘭若處。",
        "translation": "The Buddha told Kāśyapa, A monk in a forest will surely delight in the forest abode and stay in the forest abode.",
        "source": "T11n0310_114:0644b14_3"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0644b15_4"
    },
    {
        "source_sentence": "若阿蘭若處，所謂無大聲，無眾閙聲，離麞鹿虎狼及諸飛鳥，遠諸賊盜及牧牛羊者。",
        "translation": "If there's a place in a forest, it's called the absence of loud sounds and no crowded sounds, which are free of cows, deer, tigers, wolves, and flying birds, and they're far removed from thieves, thieves, cattle, and sheep herders.",
        "source": "T11n0310_114:0644b15_5"
    },
    {
        "source_sentence": "順沙門行處如是阿蘭若處，應於中修行。",
        "translation": "Following the ascetic's place of practice is thus an aāraṇya place where he should cultivate it.",
        "source": "T11n0310_114:0644b17_6"
    },
    {
        "source_sentence": "彼比丘若欲至阿蘭若處，應當思惟八法。",
        "translation": "If that monk wants to go to the forest, he should contemplate eight things.",
        "source": "T11n0310_114:0644b18_7"
    },
    {
        "source_sentence": "何等八？",
        "translation": "What are the eight?",
        "source": "T11n0310_114:0644b19_8"
    },
    {
        "source_sentence": "一者我當捨身，二者應當捨命，三者當捨利養，四者離於一切所愛樂處，",
        "translation": "One, that I should abandon my body; two, that I should abandon my life; three, that I should abandon gain and profit; and four, that I should be free of all cravings.",
        "source": "T11n0310_114:0644b19_9"
    },
    {
        "source_sentence": "五者於山間死當如鹿死，六者阿蘭若處當受阿蘭若行，七者當以法自活，",
        "translation": "Five, when they die in the mountains, they'll die like a deer; six, when they live in a forested place, they'll be subject to the practice of forest dwelling; and seven, when they live on their own with the Dharma, they'll be liberated.",
        "source": "T11n0310_114:0644b21_10"
    },
    {
        "source_sentence": "八者非以煩惱自活。",
        "translation": "Eight, it's not because of the afflictions that they live on their own.",
        "source": "T11n0310_114:0644b23_0"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0644b23_1"
    },
    {
        "source_sentence": "是名八法，阿蘭若比丘所應思惟，思惟已當至阿蘭若處。",
        "translation": "These are called the eight dharmas that a monk in a forest should contemplate, and after contemplating them, he'll go to the forest.",
        "source": "T11n0310_114:0644b23_2"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0644b24_3"
    },
    {
        "source_sentence": "阿蘭若比丘至阿蘭若處已，行阿蘭若法，以八行行慈，於一切眾生生慈心。",
        "translation": "After he arrived at the forest, the monk in Araṇya practiced the teachings of Araṇya and cultivated kindness with eight practices that gave rise to a compassionate attitude toward all sentient beings.",
        "source": "T11n0310_114:0644b25_0"
    },
    {
        "source_sentence": "何等八？",
        "translation": "What are the eight?",
        "source": "T11n0310_114:0644b26_1"
    },
    {
        "source_sentence": "一者以慈利益，二者以慈樂，三者無恚慈，四者正慈，五者無異慈，六者順慈，",
        "translation": "They are (1) kindness that benefits, (2) kindness that brings happiness, (3) kindness without ill-will, (4) kindness with righteousness, (5) kindness without dissimilarity, and (6) kindness in harmony.",
        "source": "T11n0310_114:0644b26_2"
    },
    {
        "source_sentence": "七者觀一切法慈，八者淨如虛空慈。",
        "translation": "The seventh is the compassion that observes all dharmas, and the eighth is the compassion that's pure like space.",
        "source": "T11n0310_114:0644b28_3"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0644b29_4"
    },
    {
        "source_sentence": "以如是八行於諸眾生生慈心。",
        "translation": "With these eight practices, he gives rise to the mind of kindness toward sentient beings.",
        "source": "T11n0310_114:0644b29_5"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0644c01_6"
    },
    {
        "source_sentence": "阿蘭若比丘至阿蘭若處已，應如是思惟：『我雖至遠處獨無伴侶，若我行善若行不善無人教呵。』",
        "translation": "After arriving at the forest-dwelling monk's place, he should thus think, 'Although I go to a distant place and have no companion, there's no one to criticize me if I do good or bad actions.'",
        "source": "T11n0310_114:0644c01_7"
    },
    {
        "source_sentence": "復作是念：『此有諸天龍鬼神、諸佛世尊，知我專心，彼為我證。",
        "translation": "Again, they think, 'There are gods, dragons, ghosts, spirits, and world-honored buddhas here who know I concentrate my mind and they will realize it for me.",
        "source": "T11n0310_114:0644c03_8"
    },
    {
        "source_sentence": "我今在此行阿蘭若法，我不善心不得自在。",
        "translation": "Now, I'm here practicing the teaching of the aāraṇḍa, and I don't have good thoughts that aren't self-contained.",
        "source": "T11n0310_114:0644c04_9"
    },
    {
        "source_sentence": "若我至此極遠之處，獨無伴侶無親近者無我所有，我今當覺欲覺恚覺惱覺，",
        "translation": "If I were to go so far away from this place, alone and without companions or associates, there wouldn’t be a self that exists, and now I would experience feelings of desire, feelings of anger, and feelings of irritation.",
        "source": "T11n0310_114:0644c05_10"
    },
    {
        "source_sentence": "餘不善法亦應當覺。",
        "translation": "The other unwholesome dharmas should also be perceived.",
        "source": "T11n0310_114:0644c07_11"
    },
    {
        "source_sentence": "我今不應不異於樂眾者，亦不應不異近聚落人，若如是不異，我即為誑諸天龍鬼神已，",
        "translation": "Now, I shouldn't differ from those who delight in the congregation, and I shouldn't differ from those who approach people in villages. If they don't differ, then I am just like the gods, dragons, ghosts, and spirits that feed on me.",
        "source": "T11n0310_114:0644c08_12"
    },
    {
        "source_sentence": "諸佛見我亦不歡悅。",
        "translation": "The buddhas see me and don't rejoice, either.",
        "source": "T11n0310_114:0644c10_13"
    },
    {
        "source_sentence": "我今若如阿蘭若法，則諸天龍鬼神不見呵責，諸佛見我即亦歡悅。』",
        "translation": "If I now follow the teaching of the Ārāṇya, then gods, dragons, ghosts, and spirits won't see me rebuked, and the buddhas will be delighted when they see me.'",
        "source": "T11n0310_114:0644c10_14"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0644c12_15"
    },
    {
        "source_sentence": "阿蘭若比丘住阿蘭若處行阿蘭若法，一心堅持解脫禁戒、善護戒眾，淨身口意無諛諂行，",
        "translation": "Ā蘭若比丘住阿蘭若處行阿蘭若法,一心堅持解脫禁戒、善護戒眾,淨身口口聲無諂行,",
        "source": "T11n0310_114:0644c12_16"
    },
    {
        "source_sentence": "淨於正命，心向諸定，如所聞法，應憶念之勤正思惟，趣向離欲寂滅涅槃。",
        "translation": "He purifies right livelihood, dedicates his mind to concentrations, recollects the teachings he hears, diligently and correctly contemplates them, and heads for nirvāṇa of freedom from desire and cessation.",
        "source": "T11n0310_114:0644c14_17"
    },
    {
        "source_sentence": "畏於生死觀五陰如怨家，觀四大如毒蛇，觀六入如空聚。",
        "translation": "Fearing birth and death, he observes the five aggregates as enemies, observes the four elements as poisonous snakes, and observes the six sense-fields as clusters of emptiness.",
        "source": "T11n0310_114:0644c15_18"
    },
    {
        "source_sentence": "善知方便，觀十二因緣離斷常見，觀無眾生無我無人無命，解法空相行於無相，",
        "translation": "He well knows the means, observes twelve causes and conditions, is free from annihilation and eternal, observes that there are no sentient beings, no self, no person, and no life, understands the marklessness of things, and acts on signlessness.",
        "source": "T11n0310_114:0644c17_19"
    },
    {
        "source_sentence": "漸損所作而行無作。",
        "translation": "They gradually harm what's done and practice what's not done.",
        "source": "T11n0310_114:0644c19_20"
    },
    {
        "source_sentence": "心常驚畏於三界行，常勤修行如救頭然，常行精進終不退轉。",
        "translation": "Their minds are always frightened by the practice of the three realms, always diligently cultivating it as if they were rescuing their heads, always practicing effort without ever retreating.",
        "source": "T11n0310_114:0644c19_21"
    },
    {
        "source_sentence": "觀身實相，應生如是心觀如是法，當知苦本、斷一切集、證於滅盡、勤修於道。",
        "translation": "Observing the true characteristics of the body, they should give rise to such-and-such a mind and contemplate such-and-such a teaching, knowing that it's the root of suffering, stops all accumulation, realizes cessation, and diligently cultivates the path.",
        "source": "T11n0310_114:0644c20_22"
    },
    {
        "source_sentence": "行於慈心安住四念處，離不善法入善法門，安住四正勤、入四如意足、護五善根，",
        "translation": "He practices the four abodes of mindfulness with a compassionate mind, parting with unwholesome things and entering wholesome principles, abiding in the four correct endeavors, entering the four supernormal powers, and guarding the five wholesome roots.",
        "source": "T11n0310_114:0644c22_23"
    },
    {
        "source_sentence": "於五力中而得自在。",
        "translation": "Within the five powers, he attains mastery.",
        "source": "T11n0310_114:0644c24_24"
    },
    {
        "source_sentence": "覺七菩提分、勤行八聖善道分，受持禪定，以慧分別諸法之相。",
        "translation": "He perceives the seven factors of enlightenment and diligently practices the eight noble parts of the good path, retains meditation, discerns the characteristics of dharmas with wisdom, and maintains them.",
        "source": "T11n0310_114:0644c24_25"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0644c26_26"
    },
    {
        "source_sentence": "說如是法以嚴飾阿蘭若比丘。",
        "translation": "He teaches such a teaching to adorn the monks of Araṇya.",
        "source": "T11n0310_114:0644c26_27"
    },
    {
        "source_sentence": "作是嚴飾已住於山林，初夜後夜勤修諸行不應睡眠，常念欲得出世之法。",
        "translation": "After he had done this adornment, he stayed in the mountain forest, diligently cultivated his practices day and night, didn't sleep, and always thought of the teaching that he wanted to leave the world.",
        "source": "T11n0310_114:0644c27_28"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0644c28_29"
    },
    {
        "source_sentence": "阿蘭若比丘凡所住處常修行道，不自嚴身及諸衣服，拾乾枯草以用敷坐自用坐具，",
        "translation": "Wherever the monks of a forest-dwelling place always practice the path, they don't adorn themselves with their bodies or clothing, gather dry grass to spread and use it for their seats and make their own sitting cloth.",
        "source": "T11n0310_114:0644c29_0"
    },
    {
        "source_sentence": "離常住僧及招提僧物。",
        "translation": "He's free of the permanently abiding saṃgha and the property of the Zhaoti saṃgha.",
        "source": "T11n0310_114:0645a01_1"
    },
    {
        "source_sentence": "於阿蘭若處，衣服知足趣得覆身，為行聖道故。",
        "translation": "At the place of a forest, they'll cover their body with clothing and know the path to fulfillment because they're practicing the noble path.",
        "source": "T11n0310_114:0645a02_2"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T11n0310_114:0645a03_3"
    },
    {
        "source_sentence": "阿蘭若比丘若為乞食至城邑聚落，應作是念：『我從阿蘭若處至是城邑聚落，",
        "translation": "If a monk from Araṇya goes to towns and villages for the sake of food, he should think, 'I'll go from the place of Araṇya to this town or village.",
        "source": "T11n0310_114:0645a03_4"
    },
    {
        "source_sentence": "若得食若不得心無憂喜。』",
        "translation": "If he gets food or doesn't get it, his mind has no sorrow or joy.'",
        "source": "T11n0310_114:0645a05_5"
    },
    {
        "source_sentence": "若不得食者，應生喜心念宿業報，我今當勤修習福業，又念如來乞食亦不得。",
        "translation": "If someone doesn't get food, they should give rise to joyful thoughts of the results of past actions. Now, I will diligently cultivate meritorious actions, and think that the Tathāgata won't get food when he asks for it.",
        "source": "T11n0310_114:0645a06_0"
    },
    {
        "source_sentence": "彼阿蘭若比丘入於城邑聚落乞食，應以法莊嚴，法莊嚴已然後乞食。",
        "translation": "That monk from Araṇya enters towns and villages to solicit alms, he should adorn himself with the Dharma, and after adorning himself with the Dharma, he then solicits alms.",
        "source": "T11n0310_114:0645a07_1"
    },
    {
        "source_sentence": "云何法莊嚴？",
        "translation": "What is the adornment of the Dharma?",
        "source": "T11n0310_114:0645a09_2"
    },
    {
        "source_sentence": "若見適意色不應染著，見不適意色亦不生瞋。",
        "translation": "If he sees form that's appropriate for his mind, he shouldn't be stained by it, and if he sees form that's not appropriate for his mind, anger doesn't arise.",
        "source": "T11n0310_114:0645a09_3"
    },
    {
        "source_sentence": "若聞適意聲不適意聲、若嗅適意香不適意香、適意味不適意味、適意觸不適意觸、適意法不適意法，",
        "translation": "If someone hears a sound that's appropriate for the mind and doesn't appropriate for the mind, smells an odor that's appropriate for the mind and doesn't appropriate for the mind, speaks appropriately and doesn't speak appropriately, touches appropriately and doesn't touch appropriately, speaks appropriately and doesn't speak appropriately, speaks appropriately and doesn't",
        "source": "T11n0310_114:0645a10_4"
    },
    {
        "source_sentence": "心無染著亦不生瞋。",
        "translation": "The mind is free of defiled attachment, and anger doesn't arise.",
        "source": "T11n0310_114:0645a13_0"
    },
    {
        "source_sentence": "攝護根門諦視一尋調伏其心，本所思法不令離心，不以食污心而行乞食，",
        "translation": "He guards his faculties, observes and disciplines his mind with a single investigation, doesn't let his mind be distracted by the principles he originally thought about, doesn't beg for food with food that defiles his mind, and doesn't practice alms.",
        "source": "T11n0310_114:0645a13_1"
    },
    {
        "source_sentence": "應次第乞食。",
        "translation": "They should beg for food in order.",
        "source": "T11n0310_114:0645a15_2"
    },
    {
        "source_sentence": "若得食處不應生著，不得食處不應生瞋。",
        "translation": "If he obtains a place to eat, no attachment should arise, and if he doesn't obtain a place to eat, anger shouldn't arise.",
        "source": "T11n0310_114:0645a15_3"
    },
    {
        "source_sentence": "若至十家若過十家，不得食者不應生憂，應作是心：『此諸長者及婆羅門，",
        "translation": "If you go to ten houses or more than ten houses and don’t get food, you shouldn’t become sad. You should think thus:",
        "source": "T11n0310_114:0645a16_4"
    },
    {
        "source_sentence": "多有諸緣不與我食。",
        "translation": "There are many reasons why they won't give me food.",
        "source": "T11n0310_114:0645a18_5"
    },
    {
        "source_sentence": "又此長者諸婆羅門，乃至未曾生心念我，況與我食。』",
        "translation": "Furthermore, these elders and brāhmaṇas never had thoughts of self in their minds, so why wouldn't they give me food?'",
        "source": "T11n0310_114:0645a18_6"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645a19_7"
    },
    {
        "source_sentence": "阿蘭若比丘若能如是，於乞食中不生驚畏。",
        "translation": "If a monk in a forest can do so, he won't become frightened while begging for food.",
        "source": "T11n0310_114:0645a19_8"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645a20_9"
    },
    {
        "source_sentence": "阿蘭若比丘乞食時，若見眾生若男若女若童男童女，乃至畜生，應於是中生慈悲心：『我行如是精進，",
        "translation": "When a monk in a forest-dwelling place begs for food, if he sees sentient beings, whether men, women, children, boys, girls, or even animals, he should give rise to the mind of kindness and compassion there:",
        "source": "T11n0310_114:0645a20_10"
    },
    {
        "source_sentence": "作如是願。",
        "translation": "They make such a vow.",
        "source": "T11n0310_114:0645a23_11"
    },
    {
        "source_sentence": "若眾生見我及與我食者皆生天上。』",
        "translation": "If sentient beings see me and give me food, they'll all be born in heaven.'",
        "source": "T11n0310_114:0645a23_12"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645a24_13"
    },
    {
        "source_sentence": "阿蘭若比丘若得麁食若得細食，受是食已應觀四方，此村邑中誰貧窮者，",
        "translation": "If a monk in a forest-dwelling place obtains delicious food or fine food, and after accepting that food, he should look in all directions to see who is poor in this village or town.",
        "source": "T11n0310_114:0645a24_14"
    },
    {
        "source_sentence": "當減此食以施與之。",
        "translation": "You must reduce this food and give it to them.",
        "source": "T11n0310_114:0645a26_15"
    },
    {
        "source_sentence": "若見貧人所可乞食即分半與，若不見貧者應生是心：『我眼所不見眾生，",
        "translation": "If you see what a poor person can beg for, give half of it to him. If he doesn’t see the poor, you should have this thought:",
        "source": "T11n0310_114:0645a26_16"
    },
    {
        "source_sentence": "我所得食於中好者願施與之。",
        "translation": "I wish to give the food that's good in it to those who eat it.",
        "source": "T11n0310_114:0645a28_17"
    },
    {
        "source_sentence": "我為施主彼為受者。』",
        "translation": "I'm the donor, and they're the recipient.'",
        "source": "T11n0310_114:0645a29_0"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T11n0310_114:0645a29_1"
    },
    {
        "source_sentence": "阿蘭若比丘乞食，得受食已，持至阿蘭若處淨洗手足，淨沙門儀式具一切淨法，",
        "translation": "After the monk in Araṇya begged for food, he accepted it and took it to the place in Araṇya to wash his hands and feet cleanly, purify the ascetic's rituals, and fulfill all the pure dharmas.",
        "source": "T11n0310_114:0645a29_2"
    },
    {
        "source_sentence": "如法取草已結加趺坐，坐已而食，心無愛著亦無貢高，無有瞋心無濁亂心。",
        "translation": "After he takes the grass in accordance with the teaching, he sits cross-legged and eats it after he's seated, his mind is free of attachment and without pride, and he has no anger or turbidity.",
        "source": "T11n0310_114:0645b02_3"
    },
    {
        "source_sentence": "臨欲食時如是思惟：『今此身中有八萬戶蟲，蟲得此食皆悉安樂，我今以食攝此諸蟲。",
        "translation": "When he was about to eat, he thought, 'Now, there are 80,000 household worms in this body, and they'll all be comfortable when they get this food, so now I'll take care of these worms with food.",
        "source": "T11n0310_114:0645b04_4"
    },
    {
        "source_sentence": "我得阿耨多羅三藐三菩提時，以法攝取。』",
        "translation": "When I attain supreme perfect enlightenment, I'll take it in with the Dharma.'",
        "source": "T11n0310_114:0645b06_5"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645b07_6"
    },
    {
        "source_sentence": "又時阿蘭若比丘食或不足，應作是念：『我今身輕能修忍辱，斷除諸惡少大小便，",
        "translation": "Again, when an arhat monk eats or doesn’t have enough to eat, he should think, ‘Now that I can cultivate forbearance lightly in my body, ending bad defecation and urinating,",
        "source": "T11n0310_114:0645b07_7"
    },
    {
        "source_sentence": "得身輕已亦得心輕，又得少睡亦不起欲想。』",
        "translation": "After attaining lightness of body, he'll also attain lightness of mind, and after attaining a little drowsiness, he won't have any thoughts of desire.'",
        "source": "T11n0310_114:0645b09_0"
    },
    {
        "source_sentence": "應作如是思惟。",
        "translation": "You should think in this way.",
        "source": "T11n0310_114:0645b10_0"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645b10_1"
    },
    {
        "source_sentence": "阿蘭若比丘若乞食得多，應生知足想。",
        "translation": "If a monk in a forest dwelling asks for much food, he should give rise to the perception of contentment.",
        "source": "T11n0310_114:0645b10_2"
    },
    {
        "source_sentence": "應於食中減取一摶置淨石上，如是思惟：『有諸鳥獸能噉食者，我以施之，",
        "translation": "You should reduce the amount of food you eat by one grain and place it on a clean rock. Think thus:",
        "source": "T11n0310_114:0645b11_3"
    },
    {
        "source_sentence": "彼為受者。』",
        "translation": "They're recipients.'",
        "source": "T11n0310_114:0645b13_0"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645b13_1"
    },
    {
        "source_sentence": "阿蘭若比丘食已洗鉢漱口洗手，淨滌應器手拭令乾，舉僧伽梨依阿蘭若處行，",
        "translation": "After he had eaten it, the monk in Araṇya washed his bowl, rinsed his mouth and hands, cleansed his hands from the container, wiped them dry with his hands, lifted up his saṃghâvaśeṣarī, and walked around in Araṇya.",
        "source": "T11n0310_114:0645b13_2"
    },
    {
        "source_sentence": "不離本所思惟法相。",
        "translation": "They don't part from the characteristics of the dharmas that they originally contemplated.",
        "source": "T11n0310_114:0645b15_3"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645b15_4"
    },
    {
        "source_sentence": "阿蘭若比丘行阿蘭若行時，若是凡夫未得沙門果，或時虎狼來至其所，",
        "translation": "When a monk of Araṇya practices Araṇya, if he's a worldling who hasn't yet attained the fruit of asceticism, or if tiger and wolf sometimes come to him,",
        "source": "T11n0310_114:0645b15_5"
    },
    {
        "source_sentence": "若見不應生畏，作如是念：『我本來至阿蘭若處時已捨身命，我不應驚畏，",
        "translation": "If they see that they shouldn’t become frightened, they think, ‘When I originally went to the forested abode in Araṇya, I gave up my body and life.",
        "source": "T11n0310_114:0645b17_6"
    },
    {
        "source_sentence": "應修慈心離一切惡亦離怖畏。",
        "translation": "You should cultivate a compassionate mind that's free of all evils and free of fear.",
        "source": "T11n0310_114:0645b19_7"
    },
    {
        "source_sentence": "若諸虎狼斷我命根噉我身肉，當生是念，我得大利，以不堅身當得堅身。",
        "translation": "If tigers and wolves cut off my life root and eat my flesh, they'll give rise to this thought, 'I'll attain great reward because I won't have a hard body, and I'll attain a hard body.'",
        "source": "T11n0310_114:0645b19_8"
    },
    {
        "source_sentence": "此諸虎狼我不與食，今噉我肉已身得安樂。』",
        "translation": "These tigers and wolves won't give me food, but now that they eat my flesh, I'll attain well-being.'",
        "source": "T11n0310_114:0645b21_9"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645b22_10"
    },
    {
        "source_sentence": "阿蘭若比丘行阿蘭若法，應如是捨身命。",
        "translation": "A monk in a forest should thus abandon his body and life when he practices the forest-dwelling Dharma.",
        "source": "T11n0310_114:0645b22_11"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T11n0310_114:0645b23_12"
    },
    {
        "source_sentence": "阿蘭若比丘行阿蘭若法，若有非人或作好色、或作惡色來至其所，於此非人不生愛心不生瞋心。",
        "translation": "If an arhat monk who practices the teaching of arhatship or if there are non-people who come to him with good form or bad form, he doesn't become attached to these non-people and doesn't become angry.",
        "source": "T11n0310_114:0645b23_13"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645b25_14"
    },
    {
        "source_sentence": "或有曾見佛諸天來，至阿蘭若所作諸問難。",
        "translation": "Perhaps there's someone who once saw the buddhas and gods come to Araṇya and asked questions about what they did.",
        "source": "T11n0310_114:0645b26_15"
    },
    {
        "source_sentence": "問難已，阿蘭若比丘隨力所能隨所學法為諸天說。",
        "translation": "After he asked the difficult question, the monk Araṇya explained the teaching to the gods according to his ability and what he studied.",
        "source": "T11n0310_114:0645b27_16"
    },
    {
        "source_sentence": "或時諸天有深問難，阿蘭若比丘若不能答，不應生於憍慢之心，應作是言：『我不多聞，",
        "translation": "Sometimes the gods may have profound questions and difficulties, but if the monks in a forest can't answer them, they shouldn't become arrogant and say, 'I haven't heard much.",
        "source": "T11n0310_114:0645b28_17"
    },
    {
        "source_sentence": "汝莫輕我。",
        "translation": "Don't despise me.",
        "source": "T11n0310_114:0645c01_18"
    },
    {
        "source_sentence": "我今當勤修學佛法，或時我得通佛法已，能一切答。』",
        "translation": "Now, I will diligently cultivate the buddha-dharma, or at some point when I've mastered the buddha-dharma, I'll be able to answer all of them.'",
        "source": "T11n0310_114:0645c01_19"
    },
    {
        "source_sentence": "又應勸請諸天：『汝等今當為我說法，我當聽受。』",
        "translation": "You should also encourage the gods, 'Now, you must explain the teaching for me, and I will listen and accept it.'",
        "source": "T11n0310_114:0645c02_20"
    },
    {
        "source_sentence": "又應如是報謝言：『願勿嫌也。』",
        "translation": "You should also thus repay your thanks, saying, 'May it not be disliked.'",
        "source": "T11n0310_114:0645c03_21"
    },
    {
        "source_sentence": "復次迦葉！",
        "translation": "Furthermore, Kāśyapa!",
        "source": "T11n0310_114:0645c04_22"
    },
    {
        "source_sentence": "阿蘭若比丘行阿蘭若法，善修阿蘭若想。",
        "translation": "Ā蘭若比丘行阿蘭若法,善修阿蘭若想。",
        "source": "T11n0310_114:0645c04_23"
    },
    {
        "source_sentence": "猶如草木瓦石無主無我亦無所屬，此身亦爾，無我無命無人無眾生無諍訟，",
        "translation": "Just as grass, trees, tile, and stones have no owner, no self, and nothing to which they belong. So too is this body: without self, without life, without living beings, without sentient beings, without dispute or controversy.",
        "source": "T11n0310_114:0645c05_24"
    },
    {
        "source_sentence": "此法皆從緣合而生。",
        "translation": "These dharmas all arise from the conjunction of conditions.",
        "source": "T11n0310_114:0645c07_25"
    },
    {
        "source_sentence": "於此法中若善思惟，我當得斷一切諸見，常應思惟空無相無作法。",
        "translation": "If I well contemplate this teaching, I'll be able to stop all views, and you should always contemplate emptiness, signlessness, and unconstructed dharmas.",
        "source": "T11n0310_114:0645c07_26"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645c09_27"
    },
    {
        "source_sentence": "阿蘭若比丘行阿蘭若法時，若草藥草及諸樹林，云何和合？",
        "translation": "When a monk in a forest practices the forest dharma, how does he combine grass, herbs, plants, and trees?",
        "source": "T11n0310_114:0645c09_28"
    },
    {
        "source_sentence": "云何散滅？",
        "translation": "What is dispersal and cessation?",
        "source": "T11n0310_114:0645c10_29"
    },
    {
        "source_sentence": "如此外物，無主無我無有我所亦無諍訟，自生自滅無生滅者。",
        "translation": "Such external things have no subject, no self, no self, no self and nothing what belongs to self, and no dispute. They arise on their own and cease on their own, without birth or cessation.",
        "source": "T11n0310_114:0645c11_30"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645c12_31"
    },
    {
        "source_sentence": "如草木瓦石無我無主亦無所屬，此身亦爾，無我無命無人無眾生無諍訟，",
        "translation": "Just as grass, trees, stones, tiles, and stones have no self, no owner, and nothing to which they belong. So too is this body: without self, without life, without living beings, without sentient beings, without dispute or controversy.",
        "source": "T11n0310_114:0645c12_32"
    },
    {
        "source_sentence": "從眾緣生緣離則滅，此如實中無有一法若生若滅。",
        "translation": "In this, as it really is, there's no single thing that arises or ceases from many conditions.",
        "source": "T11n0310_114:0645c14_33"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645c15_34"
    },
    {
        "source_sentence": "如是法，阿蘭若比丘至阿蘭若處所應修行。",
        "translation": "Thus, this is the teaching that a monk in Araṇya who goes to an Araṇya place should cultivate.",
        "source": "T11n0310_114:0645c15_35"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645c16_36"
    },
    {
        "source_sentence": "阿蘭若比丘行如是法，若學聲聞乘疾得沙門果，若有障法現世不得沙門果者，",
        "translation": "If an arhat monk practices such a teaching and if he trains in the śrāvaka vehicle, he'll quickly attain the fruit of asceticism, and if there are obstacles in the present life that prevent him from attaining the fruit of ascetichood,",
        "source": "T11n0310_114:0645c16_37"
    },
    {
        "source_sentence": "不過見一佛二佛三佛，必定得斷一切諸漏。",
        "translation": "If they simply see one Buddha, two Buddhas, or three Buddhas, they'll surely end all the contaminants.",
        "source": "T11n0310_114:0645c18_38"
    },
    {
        "source_sentence": "若學菩薩乘，現世得無生法忍得無障法，必見未來諸佛，疾成阿耨多羅三藐三菩提。」",
        "translation": "If someone trains in the bodhisattva vehicle and attains the forbearance of the nonarising Dharma in the present life and attains the unobstructed Dharma, they'll surely see future buddhas and quickly attain supreme perfect enlightenment.",
        "source": "T11n0310_114:0645c19_39"
    },
    {
        "source_sentence": "說此阿蘭若品時，有五百比丘斷一切漏心得解脫。",
        "translation": "When this chapter of the aāraṇḍa was taught, five hundred monks were liberated by cutting off all contaminants in their minds.",
        "source": "T11n0310_114:0645c21_40"
    },
    {
        "source_sentence": "乞食比丘品第六",
        "translation": "The Sixth Chapter of the Begging Bhikṣu",
        "source": "T11n0310_114:0645c23_0"
    },
    {
        "source_sentence": "佛告迦葉：「云何比丘乞食？",
        "translation": "The Buddha told Kāśyapa, How does a monk beg for food?",
        "source": "T11n0310_114:0645c24_0"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0645c24_1"
    },
    {
        "source_sentence": "若有比丘先安住本誓：『我依乞食出家。",
        "translation": "Suppose there's a monk who first abides in his original vow, 'I renounce home based on begging for food.",
        "source": "T11n0310_114:0645c24_2"
    },
    {
        "source_sentence": "我今住先誓。』",
        "translation": "Now, I'll abide in the prior vow.'",
        "source": "T11n0310_114:0645c25_3"
    },
    {
        "source_sentence": "彼比丘專念無有諛諂，離一切請食、離一切僧中供養堅自莊嚴。",
        "translation": "That monk concentrates his thoughts without deceitfulness and is free of all invitations to food and offerings from all the saṃgha, and he firmly adorns himself.",
        "source": "T11n0310_114:0645c25_4"
    },
    {
        "source_sentence": "乞食比丘於一切味中不應生好味想，又於上妙食中自勸其心生如是想：『我如旃陀羅，",
        "translation": "The begging monk should not give rise to thoughts of good flavor in all flavors, nor should he give rise to thoughts such as, 'I am like caṇḍāla.",
        "source": "T11n0310_114:0645c27_5"
    },
    {
        "source_sentence": "應淨身心，不應淨飲食。",
        "translation": "You should purify body and mind and not purify food and drink.",
        "source": "T11n0310_114:0645c29_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_114:0645c29_7"
    },
    {
        "source_sentence": "食好食已，一切為糞。",
        "translation": "After he eats good food, everything becomes dung.",
        "source": "T11n0310_114:0646a01_0"
    },
    {
        "source_sentence": "臭穢不淨故，我不應求好食。』",
        "translation": "Because it smells bad and impure, I shouldn't seek good food.'",
        "source": "T11n0310_114:0646a01_1"
    },
    {
        "source_sentence": "如是調伏心已，若入城邑聚落次第乞食，不應生如是想：『男子與我食非女人、女人與我食非男子、童男與我食非童女、童女與我食非童男。",
        "translation": "Having disciplined their minds in this way, if they enter towns and villages to solicit alms in order, they shouldn't give rise to the thought, 'A man giving me food is not a woman, a woman giving me food is not a man, a boy giving me food is not a girl, or a girl giving me food is not a boy.'",
        "source": "T11n0310_114:0646a02_2"
    },
    {
        "source_sentence": "應得細食非麁食、應得美食非不美食。",
        "translation": "You should attain subtle food that's neither delicious nor not delicious, and you should attain fine food that's neither delicious nor not delicious.",
        "source": "T11n0310_114:0646a05_3"
    },
    {
        "source_sentence": "時應故與食非不故、應易得食非不易、應速得食非不速。",
        "translation": "When it's appropriate, they should give food because it's not unwholesome, eat when it's easy to obtain food that's not easy, and eat when it's quickly obtained that's not inefficient.",
        "source": "T11n0310_114:0646a06_4"
    },
    {
        "source_sentence": "若入人村應得恭敬非不恭敬、應得新食非宿食、應得富家食非貧家食、男子女人眾應來迎我。』",
        "translation": "If he enters a village of people, he should be respected and not disrespected, given new food that's not food from the past, food from a rich family that's not food from a poor family, men and women who should come to greet me.'",
        "source": "T11n0310_114:0646a07_5"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646a09_6"
    },
    {
        "source_sentence": "乞食比丘如是不善法不應思惟。",
        "translation": "A monk who begs for food thus doesn't think about unwholesome things.",
        "source": "T11n0310_114:0646a09_7"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646a10_8"
    },
    {
        "source_sentence": "乞食比丘應如是自莊嚴，此是乞食常所行法。",
        "translation": "A begging monk should thus adorn himself; this is the regular practice of begging for food.",
        "source": "T11n0310_114:0646a10_9"
    },
    {
        "source_sentence": "若乞食時得與不得無有憂喜，不應生於麁細食想。",
        "translation": "If someone who obtains and doesn't obtain food at the time of begging without sorrow or joy, they shouldn't give rise to the perception of crude and fine food.",
        "source": "T11n0310_114:0646a11_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_114:0646a12_11"
    },
    {
        "source_sentence": "多有眾生貪著美味，由著味故作諸惡業，惡業因緣故墮於地獄畜生餓鬼。",
        "translation": "Many sentient beings cling to delicious food and do bad actions because of their attachment to taste, and because of the causes and conditions of bad actions they fall into hell, animals, hungry ghosts, and hungry ghosts.",
        "source": "T11n0310_114:0646a13_12"
    },
    {
        "source_sentence": "若知足者不貪美味，應捨細食受取麁食，除舌著味其心知足，得極麁食亦當知足。",
        "translation": "If someone who knows they're satisfied and doesn't crave delicious food, they should abandon subtle food and accept crude food. They know their mind well enough except for the taste attached to their tongue, and they'll also know they're satisfied when they attain extreme crude food.",
        "source": "T11n0310_114:0646a14_13"
    },
    {
        "source_sentence": "彼若命終生於天上或生人中，生天上已食天美食。",
        "translation": "If they die and are born in heaven or among humans, they'll be born in heaven and eat heavenly food after being born there.",
        "source": "T11n0310_114:0646a16_14"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646a17_15"
    },
    {
        "source_sentence": "如是乞食比丘離於味愛以調伏心，若七日噉豆亦不生憂。",
        "translation": "Thus, a begging monk who parts with taste and craving to subdue his mind by being free of taste doesn't become sad if he has seven days of grated beans.",
        "source": "T11n0310_114:0646a17_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_114:0646a19_17"
    },
    {
        "source_sentence": "趣活身故，我今食已足以修道，以是故食。",
        "translation": "Because they are destined for a living body, I've eaten enough to cultivate it now; therefore, I'll eat.",
        "source": "T11n0310_114:0646a19_18"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646a20_19"
    },
    {
        "source_sentence": "乞食比丘得此食分墮鉢中者，如法所得如法利養，應與梵行比丘共食此食。",
        "translation": "If a begging monk obtains this food and puts it in his bowl, then he receives it according to the teaching and benefits from it according to the teaching, and he should share that food with the religiously practicing monk.",
        "source": "T11n0310_114:0646a20_20"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646a22_21"
    },
    {
        "source_sentence": "乞食比丘或時有病，無有使人不能乞食，此應如是調伏其心：『我獨無侶一身出家，",
        "translation": "A bhikṣu begging for food sometimes has an illness, and there is no messenger who can’t beg for food. Here a bhikṣu should control his mind in this way:",
        "source": "T11n0310_114:0646a22_22"
    },
    {
        "source_sentence": "法是我伴我應念法。",
        "translation": "The Dharma is my companion, and I should be mindful of the Dharma.",
        "source": "T11n0310_114:0646a24_23"
    },
    {
        "source_sentence": "今我病苦，如世尊說諸比丘應念於法。",
        "translation": "Now, as the Bhagavān explains, monks should be mindful of the teaching.",
        "source": "T11n0310_114:0646a24_24"
    },
    {
        "source_sentence": "我所聞法應善思惟。",
        "translation": "You should well contemplate the teachings that I've heard.",
        "source": "T11n0310_114:0646a25_25"
    },
    {
        "source_sentence": "云何善思惟？",
        "translation": "What's well-contemplated?",
        "source": "T11n0310_114:0646a26_26"
    },
    {
        "source_sentence": "如實觀身。",
        "translation": "He observes the body as it really is.",
        "source": "T11n0310_114:0646a26_27"
    },
    {
        "source_sentence": "如實觀身已有智慧者，若獨一心能得初禪則有是處。』",
        "translation": "If someone who observes the body as it really is and has wisdom, then there's a place where they can attain the first dhyāna with one mind alone.'",
        "source": "T11n0310_114:0646a26_28"
    },
    {
        "source_sentence": "得初禪樂，若一日若二日乃至七日，以禪為食其心歡悅。",
        "translation": "They attain the bliss of the first dhyāna, and if they eat it for one day, two days, or even seven days, their minds rejoice when they're fed with meditation.",
        "source": "T11n0310_114:0646a27_29"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646a29_30"
    },
    {
        "source_sentence": "乞食比丘行如是法若不得禪，應如是勤行安住善法中。",
        "translation": "If a begging monk practices this teaching and doesn't attain meditation, he should thus diligently practice it and abide in the good teaching.",
        "source": "T11n0310_114:0646a29_31"
    },
    {
        "source_sentence": "有多人所知，諸天龍神送食與之，此是離扼報故。",
        "translation": "Many people know that the gods and dragons send food to them, which is because they're free of the retribution of being entangled.",
        "source": "T11n0310_114:0646b01_32"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646b02_33"
    },
    {
        "source_sentence": "或乞食比丘值天大雨或大風塵不能乞食，爾時以慈為食而自莊嚴，於所行法安住思惟。",
        "translation": "If a begging monk meets a great rain in the sky or a great windstorm and doesn't beg for food, then he adorns himself with kindness as food and calmly contemplates the Dharma he practices.",
        "source": "T11n0310_114:0646b02_34"
    },
    {
        "source_sentence": "若二夜三夜不得食者，應生是念：『有多眾生墮餓鬼中，作惡業故苦惱所切，",
        "translation": "If they can't eat for two nights or three nights, they should give rise to this thought: 'Many sentient beings fall into hungry ghosts and are cured by suffering and distress because of bad actions.",
        "source": "T11n0310_114:0646b05_0"
    },
    {
        "source_sentence": "乃至百歲不得一唾。",
        "translation": "Up to a hundred years old, he won't get a single spittle.",
        "source": "T11n0310_114:0646b06_1"
    },
    {
        "source_sentence": "我今安住諸法門中，應生是念，身心羸劣今我堪忍飢渴，勤修聖道不應退轉。』",
        "translation": "Now that I'm settled in the teachings, you should give rise to this thought, 'Now that my body and mind are weak, I can tolerate hunger and thirst, diligently cultivate the noble path, and shouldn't turn back.'",
        "source": "T11n0310_114:0646b07_2"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646b08_3"
    },
    {
        "source_sentence": "乞食比丘不應親近在家之人，男子女人童男童女。",
        "translation": "A monk who begs for food shouldn't be intimate with people at home, men, women, children, boys, or girls.",
        "source": "T11n0310_114:0646b09_4"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646b10_5"
    },
    {
        "source_sentence": "若乞食比丘令在家人擇去食中諸不淨物，於坐處坐，應為說法。",
        "translation": "If a begging monk causes his family members to choose the impure things in food and leaves them there, then he should teach the Dharma for them while they're sitting at their seats.",
        "source": "T11n0310_114:0646b10_6"
    },
    {
        "source_sentence": "乃至食淨還受食已，從坐起去。",
        "translation": "After he had eaten the pure food and returned to receive it, he rose from his seat and departed.",
        "source": "T11n0310_114:0646b11_7"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646b12_8"
    },
    {
        "source_sentence": "乞食比丘不應自現諛諂。",
        "translation": "A monk who begs for food shouldn't show deceitfulness on his own.",
        "source": "T11n0310_114:0646b12_9"
    },
    {
        "source_sentence": "云何自現諛諂？",
        "translation": "How do they show themselves to be coarse and flattering?",
        "source": "T11n0310_114:0646b13_10"
    },
    {
        "source_sentence": "若為他人說如是言：『我今乞得麁惡之食，又復不足與多眾共食。",
        "translation": "If someone says to another person, 'Now that I'm begging for crude food, it's not enough to share it with many people.",
        "source": "T11n0310_114:0646b13_11"
    },
    {
        "source_sentence": "我食少，我今飢渴身力羸劣。』",
        "translation": "I eat a little, but now I'm hungry and thirsty, and my body is weak.'",
        "source": "T11n0310_114:0646b15_12"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646b15_13"
    },
    {
        "source_sentence": "是名自現諛諂。",
        "translation": "This is called self-manifest flattery.",
        "source": "T11n0310_114:0646b15_14"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646b16_15"
    },
    {
        "source_sentence": "乞食比丘如是之事應當遠離。",
        "translation": "A monk who begs for food should be kept away from such things.",
        "source": "T11n0310_114:0646b16_16"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T11n0310_114:0646b17_17"
    },
    {
        "source_sentence": "乞食比丘於一切事應生捨心。",
        "translation": "A monk who begs for food should give rise to the mind of equanimity in all things.",
        "source": "T11n0310_114:0646b17_18"
    },
    {
        "source_sentence": "若食墮鉢中，若麁若細、若少若多、若淨若不淨，一切應受心無憂喜。",
        "translation": "If food falls into a bowl, whether coarse or fine, small or large, pure or impure, they should all experience it without sorrow or joy in their minds.",
        "source": "T11n0310_114:0646b17_19"
    },
    {
        "source_sentence": "常應淨心觀諸法相，趣得活身為行聖道，是故受食。",
        "translation": "They should always observe the characteristics of dharmas with a pure mind and proceed to attain the noble path in their living body, which is why they receive food.",
        "source": "T11n0310_114:0646b19_20"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646b20_21"
    },
    {
        "source_sentence": "乞食比丘或時入於城邑聚落次第乞食，若不得食空鉢而出，應念如來有大威德，",
        "translation": "If a begging monk sometimes enters towns and villages to solicit alms in order, or if he doesn't eat an empty bowl and leaves it, he should remember that the Tathāgata has great authority.",
        "source": "T11n0310_114:0646b20_22"
    },
    {
        "source_sentence": "捨轉輪王位而行出家，斷一切惡法成一切善法，入村乞食尚空鉢出。",
        "translation": "He renounces the position of wheel-turning king and leaves home, stops all bad qualities and accomplishes all good qualities, enters a village to solicit alms while leaving an empty bowl.",
        "source": "T11n0310_114:0646b22_23"
    },
    {
        "source_sentence": "況我薄福不種善根，不空鉢還也？",
        "translation": "How could it be that I lack merit and don't plant good roots, and my bowl isn't empty when I return?",
        "source": "T11n0310_114:0646b24_24"
    },
    {
        "source_sentence": "是故不應生憂。",
        "translation": "Therefore, grief shouldn't arise.",
        "source": "T11n0310_114:0646b25_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_114:0646b25_1"
    },
    {
        "source_sentence": "不種善根能得麁食細食，無有是處。",
        "translation": "Without planting the roots of goodness, it is impossible to obtain nutritious and subtle food. There is no reason for this.",
        "source": "T11n0310_114:0646b25_2"
    },
    {
        "source_sentence": "我不得食，或自有魔或魔所使，或魔覆蔽諸婆羅門居士，令我乞食不得。",
        "translation": "I won't be allowed to eat, whether it's caused by Māra or by Māra, or if Māra covers the Brāhmaṇa householders and causes me to beg for food that I won't get.",
        "source": "T11n0310_114:0646b26_3"
    },
    {
        "source_sentence": "我當勤修離於四魔，斷一切煩惱。",
        "translation": "I will diligently cultivate freedom from the four Māras and end all afflictions.",
        "source": "T11n0310_114:0646b28_0"
    },
    {
        "source_sentence": "若我勤修如是道已，非魔波旬非魔所使能作留難。",
        "translation": "If I diligently cultivate such a path, it won't be difficult for Māra Pāpīyān or Māra's messengers to make me stay.",
        "source": "T11n0310_114:0646b28_1"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646b29_2"
    },
    {
        "source_sentence": "乞食比丘應如是受持聖種。」",
        "translation": "A monk who begs for food should thus accept and uphold the noble seed.",
        "source": "T11n0310_114:0646c01_3"
    },
    {
        "source_sentence": "糞掃衣比丘品第七",
        "translation": "Chapter Seven: The Bhikṣu Who Wears the Garbage of filthy clothes",
        "source": "T11n0310_114:0646c02_0"
    },
    {
        "source_sentence": "佛告迦葉：「畜糞掃衣比丘，拾糞掃物作如是想：『為慚愧故，非以衣自嚴飾故，",
        "translation": "The Buddha told Kāśyapa, A monk who stores excrement and sweeps clothes has this thought: 'It's because of shame that he gathers excrement and sweeps things, not because he adorns himself with his robes.",
        "source": "T11n0310_114:0646c03_0"
    },
    {
        "source_sentence": "為障風吹日曝蚊虻蟇子諸惡觸故，安住佛教故，非求淨好故，於糞掃中拾取棄物。』",
        "translation": "It's because of the bad touches that prevent the wind from blowing and the sun from exposing themselves to mosquitoes, gadflies, and dust motes; it's because they abide in Buddhism; not because they seek purity and beauty, so they gather up and throw away things in the dung and sweep.'",
        "source": "T11n0310_114:0646c04_1"
    },
    {
        "source_sentence": "取時應生二種想：何等二？",
        "translation": "At the moment of grasping, two kinds of conceptual identification should arise:",
        "source": "T11n0310_114:0646c06_2"
    },
    {
        "source_sentence": "一者知足想，二者易養想。",
        "translation": "One is the perception of knowing contentment, and the other is the perception of easy nourishment.",
        "source": "T11n0310_114:0646c07_3"
    },
    {
        "source_sentence": "復生二想：一者無慢想，二者持聖種想。",
        "translation": "Again, two kinds of perceptions arise: first, perceptions of no conceit and second, perceptions of holding the noble lineage.",
        "source": "T11n0310_114:0646c07_4"
    },
    {
        "source_sentence": "復生二想：一者不以嚴身，二者令心淨故。",
        "translation": "Again, two kinds of perception arise: first, because they don't adorn themselves with their bodies and second, to make their minds pure.",
        "source": "T11n0310_114:0646c08_5"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646c09_6"
    },
    {
        "source_sentence": "畜糞掃衣比丘於糞掃中拾取棄物時，若於是處見諸親族知識，見已即止不取，",
        "translation": "When a monk who stores garbage and sweeps clothes picks up what's thrown away in the garbage, or if he meets his relatives and friends at that place and stops them after seeing them, he doesn't take it.",
        "source": "T11n0310_114:0646c09_7"
    },
    {
        "source_sentence": "而作是念：『此諸人輩或呵責我言：「汝是不淨人。」』",
        "translation": "They think, 'Some of these people may criticize me and say, You're an impure person.'",
        "source": "T11n0310_114:0646c11_8"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646c12_9"
    },
    {
        "source_sentence": "我說是比丘不得淨行。",
        "translation": "I say this monk won't attain pure practice.",
        "source": "T11n0310_114:0646c12_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_114:0646c13_11"
    },
    {
        "source_sentence": "畜糞掃衣比丘心堅如石，外物不入亦不能動故。",
        "translation": "It's because the monk's mind is as strong as a stone when he stores excrement and sweeps his robe, and external things don't enter or move.",
        "source": "T11n0310_114:0646c13_12"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646c14_13"
    },
    {
        "source_sentence": "畜糞掃衣比丘拾糞掃中物，應淨浣濯令無垢膩，浣已好染，染已作僧伽梨，",
        "translation": "A monk who stores a garbage and sweeps clothes and picks up what's in the garbage should cleanly wash his clothes so that they aren't dirty and greasy, dye them well after washing them, make a monk's robe after dyeing them, and make a monk's robe after dyeing them.",
        "source": "T11n0310_114:0646c14_14"
    },
    {
        "source_sentence": "善合善綴善縫善受，受已應著莫令綻壞。",
        "translation": "It's well combined, well knotted, well sewn, and well accepted, and after accepting it, he should attach it so it doesn't break down.",
        "source": "T11n0310_114:0646c16_15"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646c17_16"
    },
    {
        "source_sentence": "畜糞掃衣比丘安住不淨觀中著糞掃衣，為離欲故。",
        "translation": "A monk who stores a garbage sweeping robe and abides peacefully in an impure pavilion puts on a garbage sweeping robe because he's free of desire.",
        "source": "T11n0310_114:0646c17_17"
    },
    {
        "source_sentence": "慈心著糞掃衣，為離瞋恚故。",
        "translation": "With a compassionate mind, he wears robes made of rags because he's free of anger.",
        "source": "T11n0310_114:0646c18_18"
    },
    {
        "source_sentence": "觀十二因緣著糞掃衣，為離癡故。",
        "translation": "He observes the twelve causes and conditions for wearing robes made of rags because he's free of delusion.",
        "source": "T11n0310_114:0646c19_19"
    },
    {
        "source_sentence": "正思惟著糞掃衣，為斷一切煩惱故。",
        "translation": "He correctly contemplates wearing robes made of rags in order to stop all afflictions.",
        "source": "T11n0310_114:0646c20_20"
    },
    {
        "source_sentence": "攝護諸根著糞掃衣，為知六入故。",
        "translation": "He guards his faculties and wears robes made of rags in order to know the six sense-fields.",
        "source": "T11n0310_114:0646c20_21"
    },
    {
        "source_sentence": "不諛諂著糞掃衣，為令諸天龍神喜悅故。",
        "translation": "They don't wear flattering robes made of rags or sweeping clothes, so that gods and dragons will be delighted.",
        "source": "T11n0310_114:0646c21_22"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646c22_23"
    },
    {
        "source_sentence": "何故名糞掃衣？",
        "translation": "Why is it called a robe made of rags?",
        "source": "T11n0310_114:0646c22_24"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646c23_25"
    },
    {
        "source_sentence": "譬如死灰，人所不貪、不生我所心，法應除棄。",
        "translation": "It's like a dead ashes, which are not craved by people and don't give rise to the mind that perceives self or possessions, and the Dharma should be removed.",
        "source": "T11n0310_114:0646c23_26"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646c24_27"
    },
    {
        "source_sentence": "如是糞掃衣，非我非我所，是易得、非邪命、不求他、不觀他顏色。",
        "translation": "Such a garbage is not self or possessions of self, which are easy to obtain, not wrong livelihood, not seeking others, and not looking at other people's appearance.",
        "source": "T11n0310_114:0646c24_28"
    },
    {
        "source_sentence": "捨棄之物糞掃無異，亦無所屬，是故名糞掃衣。",
        "translation": "The things that are discarded are no different from the excrement and sweeping, and they don't have anything to which they belong; therefore, it's called the excrement and sweeping robe.",
        "source": "T11n0310_114:0646c25_29"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0646c26_30"
    },
    {
        "source_sentence": "糞掃衣是法幢，以大仙人故。",
        "translation": "The robe made of rags and sweeping cloth is the dharma flag, because it's due to the great sage.",
        "source": "T11n0310_114:0646c27_31"
    },
    {
        "source_sentence": "是姓，以聖人故。",
        "translation": "It's because it's a family name, and it's because it's noble.",
        "source": "T11n0310_114:0646c27_32"
    },
    {
        "source_sentence": "是安住，以聖種故。",
        "translation": "This is the abode of peace because it's based on the noble type.",
        "source": "T11n0310_114:0646c28_33"
    },
    {
        "source_sentence": "是專念，以善法儀式故。",
        "translation": "This is concentrated mindfulness because it's based on the ritual of good qualities.",
        "source": "T11n0310_114:0646c28_34"
    },
    {
        "source_sentence": "是善護，以戒眾故。",
        "translation": "This is good protection because of the multitude of moral precepts.",
        "source": "T11n0310_114:0646c29_0"
    },
    {
        "source_sentence": "是向門，以定眾故。",
        "translation": "This is the gate of dedication because it determines the multitude.",
        "source": "T11n0310_114:0646c29_1"
    },
    {
        "source_sentence": "是安住，以慧眾故。",
        "translation": "This is the abode of peace because it's based on the multitude of wisdom.",
        "source": "T11n0310_114:0646c29_2"
    },
    {
        "source_sentence": "是身，以解脫眾故。",
        "translation": "This body is because it's liberated from the many.",
        "source": "T11n0310_114:0647a01_3"
    },
    {
        "source_sentence": "是順法，以解脫知見眾故。",
        "translation": "This is a compliant dharma because it's liberated from knowing and seeing the multitude.",
        "source": "T11n0310_114:0647a01_4"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647a02_5"
    },
    {
        "source_sentence": "如是畜糞掃衣得大福德，無所希求無所貪著，能離慢心能捨重擔。",
        "translation": "Thus, they store dung and sweep robes to attain great merit, have no desire or craving, are free of conceit, and can abandon their heavy burden.",
        "source": "T11n0310_114:0647a02_6"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647a03_7"
    },
    {
        "source_sentence": "若有比丘畜糞掃衣，以知足故，諸天龍鬼神貪樂欲見。",
        "translation": "Suppose there's a monk who stores dung and sweeps robes because he knows they're sufficient, and gods, dragons, ghosts, and spirits desire to see them.",
        "source": "T11n0310_114:0647a04_0"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647a05_1"
    },
    {
        "source_sentence": "畜糞掃衣比丘若入禪定，釋梵四天王長跪合掌頭面作禮，況餘小天。",
        "translation": "If a monk who stores excrement and sweeps robes enters meditation, the four heavenly kings of Śakra and Brahmā kneel down with their palms joined and pay homage to him, much less the other lesser gods.",
        "source": "T11n0310_114:0647a05_2"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647a06_3"
    },
    {
        "source_sentence": "若有惡比丘勤求衣服以嚴飾身，外現淨行而內具足貪欲恚癡。",
        "translation": "Suppose there's a bad monk who diligently seeks clothing to adorn his body, produces pure actions externally and is endowed with craving, ill-will, and delusion internally.",
        "source": "T11n0310_114:0647a07_4"
    },
    {
        "source_sentence": "雖作如是好嚴飾身，而諸天龍神不至其所禮敬供養。",
        "translation": "Even though they had such a beautifully adorned body, gods, dragons, and spirits didn't go to them to venerate it or make offerings.",
        "source": "T11n0310_114:0647a08_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_114:0647a09_6"
    },
    {
        "source_sentence": "知此比丘勤求衣服以嚴飾身，不除心心數法垢。",
        "translation": "Knowing this monk diligently seeking clothing to adorn his body, he doesn't remove the stain of mind and mental factors.",
        "source": "T11n0310_114:0647a09_7"
    },
    {
        "source_sentence": "諸天知故則遠捨去。",
        "translation": "Knowing this, the gods then abandoned it far away.",
        "source": "T11n0310_114:0647a11_8"
    },
    {
        "source_sentence": "「迦葉！",
        "translation": "Kasyapa!",
        "source": "T11n0310_114:0647a11_9"
    },
    {
        "source_sentence": "汝見周那沙彌拾不淨臭穢糞掃中物，乞食已至阿耨大池欲浣濯之。",
        "translation": "See how Cundasambī collects impure, smelly, and filthy excrement from the things he sweeps. Having begged for food, he goes to Anavatapta’s pond in order to wash it.",
        "source": "T11n0310_114:0647a11_10"
    },
    {
        "source_sentence": "爾時池邊有常住諸天，皆遠奉迎頭面作禮。",
        "translation": "At the time, there were always standing gods at the side of the pond, and they all greeted them from afar with their heads and faces bowed.",
        "source": "T11n0310_114:0647a13_11"
    },
    {
        "source_sentence": "彼諸天等皆樂淨潔，而取周那沙彌所捉不淨糞掃衣而為浣之令無垢穢，",
        "translation": "Those gods and so forth all delighted in purity, and they took the impure garments that Cundasamitra was holding and swept them away to make them pure.",
        "source": "T11n0310_114:0647a14_12"
    },
    {
        "source_sentence": "又取浣汁自以洗身。",
        "translation": "Again, he takes the juice for washing and rinses his body.",
        "source": "T11n0310_114:0647a15_13"
    },
    {
        "source_sentence": "諸天知周那能持淨戒，入諸禪定有大威德，是故奉迎恭敬作禮。",
        "translation": "The gods knew that Cunda could observe the pure precepts and enter meditation with great authority, so they greeted him with respect and veneration.",
        "source": "T11n0310_114:0647a16_14"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647a17_15"
    },
    {
        "source_sentence": "汝見須跋陀梵志著淨潔衣乞食已，欲至阿耨大池時，常住諸天於池四面面各五里，",
        "translation": "“Friends, you see that when the brahmin Subhadra, dressed in clean clothes and begging for food, was about to reach the great lake Anavatapta, the heavenly gods who always lived there were five li on each of the four sides of the lake.",
        "source": "T11n0310_114:0647a18_0"
    },
    {
        "source_sentence": "遙遮梵志不令近池，恐以不淨食及以殘食污此大池。",
        "translation": "From a distance, he hides the priest and doesn't allow him to approach the pond, lest he dirty this large pond with impure food or leftover food.",
        "source": "T11n0310_114:0647a19_1"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647a21_2"
    },
    {
        "source_sentence": "汝今現見此事，以聖人正行威德故得是果。",
        "translation": "Now that you've seen this, it's because of the authoritative virtue of the noble person's right practice that they attain this result.",
        "source": "T11n0310_114:0647a21_3"
    },
    {
        "source_sentence": "周那沙彌所有不淨糞掃中物，而諸天取之為浣，亦以浣汁自洗其身。",
        "translation": "Cundaśamī's impure dung and sweeping things in it are taken by the gods to wash, and they also wash their own bodies with the juice of that washing.",
        "source": "T11n0310_114:0647a22_4"
    },
    {
        "source_sentence": "須跋陀梵志去池五里不令近之。",
        "translation": "The priest Subhadra went five miles from the pond and didn't allow him to approach it.",
        "source": "T11n0310_114:0647a23_5"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647a24_6"
    },
    {
        "source_sentence": "誰聞是已，於聖法中不勤修學？",
        "translation": "Who wouldn't diligently cultivate the noble teaching after hearing it?",
        "source": "T11n0310_114:0647a24_7"
    },
    {
        "source_sentence": "彼諸聖人諸天世人，皆來頭面禮敬供養。",
        "translation": "All those sages, humans, gods, and worldlings came to pay homage with their heads and faces.",
        "source": "T11n0310_114:0647a25_8"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647a26_9"
    },
    {
        "source_sentence": "欲求如是聖德故，畜糞掃衣。",
        "translation": "Because they want to seek such noble virtue, they store dung and sweep their robes.",
        "source": "T11n0310_114:0647a26_10"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647a27_11"
    },
    {
        "source_sentence": "畜糞掃衣比丘，安住聖種不應生憂，於糞掃衣應生塔想、應生世尊想、應生出世想、應生無我無我所想，",
        "translation": "A monk who stores excrement and sweeps robes shouldn't become sad when he's settled in the noble seed. He should give rise to thoughts of stūpas, world-honored ones, supramundane thoughts, and selflessness and nothingness with his excrement and sweeps robes.",
        "source": "T11n0310_114:0647a27_12"
    },
    {
        "source_sentence": "如是觀已著糞掃衣，應如是調伏其心。",
        "translation": "After observing it this way, he puts on a robe made of rags and sweeps, and his mind should thus be disciplined.",
        "source": "T11n0310_114:0647a29_13"
    },
    {
        "source_sentence": "由心淨故得身淨，非身淨故得心淨。",
        "translation": "It is because the mind is pure that bodily purity is attained, but it is not because the body is pure that mental purity is attained.",
        "source": "T11n0310_114:0647b01_14"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b02_15"
    },
    {
        "source_sentence": "是故當淨其心，莫嚴飾身。",
        "translation": "Therefore, they should purify their minds and not adorn their bodies.",
        "source": "T11n0310_114:0647b02_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_114:0647b03_17"
    },
    {
        "source_sentence": "由心淨故，於佛法中得名梵行。",
        "translation": "Because of the purity of mind, it's called the religious practice in the Buddha's teaching.",
        "source": "T11n0310_114:0647b03_18"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b04_0"
    },
    {
        "source_sentence": "如是畜糞掃衣比丘能如是學，則為學我亦學於汝。",
        "translation": "Thus, if a monk who stores excrement and sweeps robes can thus train, then I'll train for you as well as you.",
        "source": "T11n0310_114:0647b04_1"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b05_2"
    },
    {
        "source_sentence": "若汝能畜如是麁衣，則便知足行於聖種。",
        "translation": "If you can store such crude clothing, then you'll know that you're sufficient to practice the noble seed.",
        "source": "T11n0310_114:0647b05_3"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b06_4"
    },
    {
        "source_sentence": "汝僧伽梨若著床上、若在坐處，著憂多羅僧經行，則有千萬諸天禮汝僧伽梨，",
        "translation": "If you, Saṃghâriṣṭha, were to put your robe on a couch or seat and walk around in the monastic community of Uttarakuru, thousands of myriads of koṭis of devas would venerate you, Saṃghâriṣṭha.",
        "source": "T11n0310_114:0647b06_5"
    },
    {
        "source_sentence": "此僧伽梨是戒定慧所薰者覆身之衣。",
        "translation": "This incense is the robe that covers the body of someone who's perfumed by morality, meditation, and wisdom.",
        "source": "T11n0310_114:0647b08_6"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b09_7"
    },
    {
        "source_sentence": "當知汝衣尚得如是尊重禮敬，況汝身耶。",
        "translation": "You should know that your robe still receives such reverence and veneration, so why wouldn't you?",
        "source": "T11n0310_114:0647b09_8"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b10_9"
    },
    {
        "source_sentence": "我捨轉輪王位出家學道，先所著好上妙繒衣、頭羅衣、好細疊衣、諸上妙衣，",
        "translation": "I renounced the throne of a universal ruler and renounced domestic life to pursue religious practice. My formerly worn garments were made of fine silk, woolen cloth, cotton cloth, fine linen cloth, and other exquisite clothes.",
        "source": "T11n0310_114:0647b10_10"
    },
    {
        "source_sentence": "一切著已。",
        "translation": "After all the attachments are present, then...",
        "source": "T11n0310_114:0647b12_11"
    },
    {
        "source_sentence": "我今知足行於聖種，為餘人故身捨好服畜塚間衣。",
        "translation": "Now, I know that I'm sufficient to practice among the noble types and abandon my body for the sake of other people in good clothing and store up a garment in a cemetery.",
        "source": "T11n0310_114:0647b12_12"
    },
    {
        "source_sentence": "若當來比丘聞我此法，即得學我。",
        "translation": "If a future monk hears this teaching from me, he'll be able to train me.",
        "source": "T11n0310_114:0647b13_13"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b14_14"
    },
    {
        "source_sentence": "汝本有金縷上衣，我從汝索，汝持與我。",
        "translation": "You originally had a gold threaded upper garment, which I asked you to give it to me.",
        "source": "T11n0310_114:0647b14_15"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b15_16"
    },
    {
        "source_sentence": "我愍汝故即為汝受，非以貪故、非以嚴身故。",
        "translation": "It's because I pity you that I receive it for you, not because of craving or because of adorning my body.",
        "source": "T11n0310_114:0647b15_17"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b16_18"
    },
    {
        "source_sentence": "有惡比丘，不能學我亦不學汝，為貪所覆，多畜衣鉢積聚飲食藏舉不捨，",
        "translation": "A bad monk can't train, and I won't train you either. Being hindered by greed, they store up a lot of clothing, bowls, food, and storehouses without abandoning them.",
        "source": "T11n0310_114:0647b16_19"
    },
    {
        "source_sentence": "亦畜金銀琉璃穀米牛羊鷄猪驢馬車乘犁具，家業所須皆求畜之。",
        "translation": "They also store gold, silver, lapis lazuli, grain, rice, cattle, sheep, chickens, pigs, horses, chariots, and plows. All the necessities of their daily lives they seek to keep.",
        "source": "T11n0310_114:0647b18_20"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b19_21"
    },
    {
        "source_sentence": "有智之人雖在於家能增善法，非癡人出家得是善分。",
        "translation": "Although a wise person at home can increase good qualities, it's not the case that a deluded person who leaves home and attains this good part.",
        "source": "T11n0310_114:0647b19_22"
    },
    {
        "source_sentence": "云何智人在家能增長善法？",
        "translation": "How can a wise person at home grow good qualities?",
        "source": "T11n0310_114:0647b21_23"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b21_24"
    },
    {
        "source_sentence": "若有出家以袈裟遶項，無沙門行多有緣事，種種繫縛求好衣食。",
        "translation": "Suppose there's a renunciant who puts his robe around his neck, doesn't practice as an ascetic, and has many conditions that bind him in various ways to seek good clothing and food.",
        "source": "T11n0310_114:0647b21_25"
    },
    {
        "source_sentence": "著袈裟已在家人見，禮敬給施衣服飲食臥具湯藥，來去迎送。",
        "translation": "Having put on the monastic robes, he was seen by his family members. They paid respect to him and offered him clothing, food, drink, bedding, bathing water, and medicine. They came and went to greet him.",
        "source": "T11n0310_114:0647b23_26"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b24_27"
    },
    {
        "source_sentence": "在家之人得如是善法。",
        "translation": "A layman at home attains such a good teaching.",
        "source": "T11n0310_114:0647b24_28"
    },
    {
        "source_sentence": "彼出家人無有是事。",
        "translation": "That renunciant doesn't have such a thing.",
        "source": "T11n0310_114:0647b25_29"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_114:0647b25_30"
    },
    {
        "source_sentence": "彼出家人多求所須，不能施他故。",
        "translation": "That renunciant often asks for what's needed, so he can't give it to others.",
        "source": "T11n0310_114:0647b26_31"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647b26_32"
    },
    {
        "source_sentence": "當來有比丘多畜衣鉢多有諸物，時彼比丘多為諸在家人所見禮敬尊重讚歎。",
        "translation": "In the future, there will be a monk who has many robes and bowls and many things, and that monk will often be seen by his family members to venerate, respect, venerate, and praise him.",
        "source": "T11n0310_114:0647b27_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_114:0647b28_1"
    },
    {
        "source_sentence": "謂是比丘多受他施或持與我，我有所須能時時與。",
        "translation": "It means that a monk often receives gifts from others or gives them to me, and I give whatever I need at the right time.",
        "source": "T11n0310_114:0647b29_0"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647c01_1"
    },
    {
        "source_sentence": "或有比丘持戒見世過患，勤修善法離一切漏如救頭然，其心知足少諸緣事，",
        "translation": "Suppose there is a monk who keeps the precepts and sees worldly disadvantages. He diligently practices wholesome states free of all impure influences, just as if he were to rescue someone with his hair on his head.",
        "source": "T11n0310_114:0647c01_2"
    },
    {
        "source_sentence": "勤修自利離於一切習惡緣者。",
        "translation": "He who diligently cultivates self-benefiting and parts with all the bad conditions for accumulation.",
        "source": "T11n0310_114:0647c03_3"
    },
    {
        "source_sentence": "而彼比丘無人往至其所無親近者，無禮敬尊重讚歎者。",
        "translation": "That monk doesn't go to anyone who doesn't become intimate with them, and he doesn't venerate or praise them.",
        "source": "T11n0310_114:0647c03_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_114:0647c05_5"
    },
    {
        "source_sentence": "彼在家人輕躁淺薄，見現世利不見後世利。",
        "translation": "Those in the householder's family are light-minded and shallow, who see benefits in the present life but don't see benefits in the afterlife.",
        "source": "T11n0310_114:0647c05_6"
    },
    {
        "source_sentence": "彼在家人生如是心：『此比丘邊不得利益，用親近為？",
        "translation": "At home, they give rise to the thought, 'This monk won't get benefits at their side, so why would he need to become intimate with them?'",
        "source": "T11n0310_114:0647c06_7"
    },
    {
        "source_sentence": "用禮敬尊重讚歎為？』",
        "translation": "What's the point of paying homage and respect and praising it?'",
        "source": "T11n0310_114:0647c07_8"
    },
    {
        "source_sentence": "除貧窮人少善根者、宿緣應敬者，迦葉！",
        "translation": "It's except for those who have few good roots in the poor and those who are honored by past conditions, Kāśyapa!",
        "source": "T11n0310_114:0647c07_9"
    },
    {
        "source_sentence": "如是人等親近禮敬尊重讚歎持戒比丘以為善知識。",
        "translation": "Such people become intimate with, venerate, respect, and praise the monks who observe precepts as good teachers.",
        "source": "T11n0310_114:0647c08_10"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647c10_11"
    },
    {
        "source_sentence": "如是說已稱可二種人意。",
        "translation": "Thus, it's said that there are two kinds of people who praise what they approve of.",
        "source": "T11n0310_114:0647c10_12"
    },
    {
        "source_sentence": "何等二？",
        "translation": "What are these two?",
        "source": "T11n0310_114:0647c10_13"
    },
    {
        "source_sentence": "一者若見四聖諦，二者若見生死過患。",
        "translation": "One, if they see the four noble truths, and two, if they see the faults of birth-and-death.",
        "source": "T11n0310_114:0647c10_14"
    },
    {
        "source_sentence": "復有二：一者勤行欲離四扼，二者欲得沙門果。",
        "translation": "Again, there are two: first, the desire to diligently practice and part with the four fetters, and second, the desire to attain the fruit of asceticism.",
        "source": "T11n0310_114:0647c11_15"
    },
    {
        "source_sentence": "復有二：一者專念業報，二者欲知諸法相義。",
        "translation": "Again, there are two: first, focusing on the results of karma and second, wanting to know the meaning of the characteristics of dharmas.",
        "source": "T11n0310_114:0647c12_16"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647c13_17"
    },
    {
        "source_sentence": "我今閉塞一切懈怠者門，所謂不知業不知業報者，離善儀式者，不見後世過惡喻如金剛、見現世利不見後世利、不生一念向解脫門者。",
        "translation": "Now, I'll shut the door to all lazy people, which are those who don't know actions and don't know the results of actions, those who part with good rituals, don't see the metaphor of past and future faults as adamantine, those who see present worldly benefits and don't see future benefits, and those who don't give rise to a single",
        "source": "T11n0310_114:0647c14_18"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T11n0310_114:0647c17_19"
    },
    {
        "source_sentence": "我今說彼惡比丘不應希望，若說如是法、若遇如是法。",
        "translation": "Now, I'll explain that bad monk who shouldn't hope for it, and if he teaches such a teaching or encounters such a teaching.",
        "source": "T11n0310_114:0647c17_20"
    },
    {
        "source_sentence": "聞如是法已自知所行，不解深法而誹謗之，謂非佛說，是論師作，或魔所說，",
        "translation": "Having heard such a doctrine, they know for themselves what to practice and do not understand the profound doctrine but denigrate it. That is to say, they are not taught by buddhas; they are taught by philosophers or by Māras.",
        "source": "T11n0310_114:0647c18_21"
    },
    {
        "source_sentence": "用教餘人。",
        "translation": "He uses it to teach others.",
        "source": "T11n0310_114:0647c20_22"
    },
    {
        "source_sentence": "彼惡比丘如是自害亦復害他，自染垢污亦垢污他。",
        "translation": "That bad monk thus harms himself and harms others, and he defiles himself and defiles others.",
        "source": "T11n0310_114:0647c20_23"
    },
    {
        "source_sentence": "是惡比丘不能自利亦不利他。」",
        "translation": "That bad monk can't benefit himself and doesn't benefit others.",
        "source": "T11n0310_114:0647c21_24"
    },
    {
        "source_sentence": "爾時摩訶迦葉白佛言：「世尊！",
        "translation": "It was then that Mahākāśyapa said to the Buddha, Bhagavān!",
        "source": "T11n0310_114:0647c22_25"
    },
    {
        "source_sentence": "如諸佛大悲故，說專行比丘於諸法中得自在者，如來於此經中已廣說竟。",
        "translation": "It's because of the great compassion of the buddhas that they say that a monk who exclusively practices has attained mastery over the teachings, and the Tathāgata has explained them in detail in this sūtra.",
        "source": "T11n0310_114:0647c23_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_114:0647c24_1"
    },
    {
        "source_sentence": "若有眾生聞此經已，信解讀誦向如實法，當知是諸眾生已為諸佛之所攝取。」",
        "translation": "If there are sentient beings who hear this sūtra and believe, understand, recite, and dedicate themselves to the true teaching, you should know that these sentient beings have already been collected by the buddhas.",
        "source": "T11n0310_114:0647c24_2"
    },
    {
        "source_sentence": "爾時佛告阿難：「若有受持是經者，已於先佛種諸善根故，今欲得此經讀誦通利、欲得解脫，",
        "translation": "It was then that the Buddha said to Ānanda: If there is anyone who holds to and preserves this scripture, it is because he planted roots of goodness in former buddhas. Now if he wants to attain penetration and liberation by reciting and reciting this scripture,",
        "source": "T11n0310_114:0647c27_0"
    },
    {
        "source_sentence": "所謂善男子善女人，若出家學若在家學，此法門能斷諸漏亦得涅槃。」",
        "translation": "Good men and good women, whether they leave home to train or train at home, this approach of the Dharma can cut off the contaminants and also attain nirvāṇa.",
        "source": "T11n0310_114:0647c29_1"
    },
    {
        "source_sentence": "阿難白佛言：「世尊！",
        "translation": "Ānanda said to the Buddha, Bhagavān!",
        "source": "T11n0310_114:0648a01_2"
    },
    {
        "source_sentence": "我欲受持此經。",
        "translation": "I want to memorize this sūtra.",
        "source": "T11n0310_114:0648a02_3"
    },
    {
        "source_sentence": "當何名此經？",
        "translation": "What is the name of this sutra?",
        "source": "T11n0310_114:0648a02_4"
    },
    {
        "source_sentence": "云何受持？」",
        "translation": "How do you receive and uphold it?",
        "source": "T11n0310_114:0648a02_5"
    },
    {
        "source_sentence": "佛告阿難：「此經名『選擇一切法寶』，亦名『安住聖種儀式』，亦名『攝取持戒者』，",
        "translation": "The Buddha told Ānanda, This sūtra is called selecting all the treasures of the Dharma, which are also called abiding in the noble rituals, and it's also called gathering in those who observe precepts.",
        "source": "T11n0310_114:0648a03_6"
    },
    {
        "source_sentence": "亦名『節解破戒者』，亦名『寶梁』，亦名『寶取』，亦名『寶藏』，",
        "translation": "It's also called'monk who breaks the precepts with restraint,' it's also called 'jeweled liang,' it's also called 'jeweled grasping,' and it's also called 'jeweled store.'",
        "source": "T11n0310_114:0648a04_7"
    },
    {
        "source_sentence": "亦名『諸寶法門』。」",
        "translation": "It's also called the Dharma-gate of the Treasures.",
        "source": "T11n0310_114:0648a05_8"
    },
    {
        "source_sentence": "摩訶迦葉問大乘寶梁經竟，諸比丘眾聞佛所說，歡喜奉行。",
        "translation": "After Mahākāśyapa asked about the completion of the great vehicle Jeweled Liang sūtra, the monks who heard what the Buddha taught rejoiced and handed it down.",
        "source": "T11n0310_114:0648a06_9"
    },
    {
        "source_sentence": "大寶積經卷第一百一十四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 1, Volume 14",
        "source": "T11n0310_114:0648a08_0"
    }
]