[
    {
        "source_sentence": "父子合集經卷第九",
        "translation": "Sutra of the Collection of Fathers and Sons, Volume 9",
        "source": "T11n0320_009:0943a09_0"
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫",
        "translation": "translated scriptures of the Western Heaven, Sanzang朝散大夫",
        "source": "T11n0320_009:0943a11_0"
    },
    {
        "source_sentence": "試鴻臚卿宣梵大師賜紫",
        "translation": "試鴻卿宣梵大師賜紫, Xuanfan dashi granted it to him",
        "source": "T11n0320_009:0943a12_0"
    },
    {
        "source_sentence": "沙門臣日稱等奉　詔譯",
        "translation": "translated by imperial edict by the ascetic ministers Rixiang and others",
        "source": "T11n0320_009:0943a13_0"
    },
    {
        "source_sentence": "覩史多天授記品第十七",
        "translation": "Chapter XVII of the Record of the Teachings of the Tathāgata Kauśita",
        "source": "T11n0320_009:0943a14_0"
    },
    {
        "source_sentence": "爾時會中，有八十俱胝覩史多天子，見諸阿修羅王乃至焰摩天等，於世尊所作諸供養，",
        "translation": "At the time, there were eighty koṭis of Kauṣṭhila gods in the assembly who saw the asuras and even the Yama gods making offerings to the Bhagavān.",
        "source": "T11n0320_009:0943a15_0"
    },
    {
        "source_sentence": "復聞如來與授無上大菩提記，心大歡喜，得未曾有。",
        "translation": "Again, when they heard that the Tathāgata had given them a prediction of unsurpassed great enlightenment, their hearts rejoiced greatly and attained an unprecedented experience.",
        "source": "T11n0320_009:0943a17_0"
    },
    {
        "source_sentence": "是諸天子即作是念：「此菩提法本無色相，受、想、行、識亦復無相。",
        "translation": "The celestial beings then had this thought, This enlightenment dharma has no form in the first place, and so too feeling, perception, volition, and consciousness have no form.",
        "source": "T11n0320_009:0943a18_1"
    },
    {
        "source_sentence": "今者世尊，當以何法而為授記？",
        "translation": "Bhagavān, what teaching should be used to confer the assurance of future enlightenment?",
        "source": "T11n0320_009:0943a19_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0320_009:0943a20_3"
    },
    {
        "source_sentence": "色本無生，菩提亦無生，乃至識無生故，菩提亦無生。",
        "translation": "Form is originally unarisen, and so is enlightenment; even because consciousness is unarisen, enlightenment is also unarisen.",
        "source": "T11n0320_009:0943a20_4"
    },
    {
        "source_sentence": "云何無生法能得菩提耶？",
        "translation": "How are the nonarising dharmas capable of attaining enlightenment?",
        "source": "T11n0320_009:0943a21_5"
    },
    {
        "source_sentence": "如是色無滅故，菩提亦無滅，乃至識無滅故，菩提亦無滅。",
        "translation": "Thus, because form has no cessation, enlightenment also has no cessation, and because consciousness has no cessation, enlightenment also has no cessation.",
        "source": "T11n0320_009:0943a22_6"
    },
    {
        "source_sentence": "云何無滅法能得菩提耶？",
        "translation": "How can an unceasing dharma attain enlightenment?",
        "source": "T11n0320_009:0943a23_7"
    },
    {
        "source_sentence": "如是色寂靜故，菩提亦寂靜，乃至識寂靜故，菩提亦寂靜。",
        "translation": "Thus, because form is quiescent, enlightenment is also quiescent, and because consciousness is quiescent, enlightenment is also quiescent.",
        "source": "T11n0320_009:0943a24_8"
    },
    {
        "source_sentence": "如是色無二故，菩提亦無二，乃至識無二故，菩提亦無二。",
        "translation": "Because such form is without duality, enlightenment is also without duality, and because consciousness is without duality, enlightenment is also without duality.",
        "source": "T11n0320_009:0943a25_9"
    },
    {
        "source_sentence": "如是色無動故，菩提亦無動，乃至識無動故，菩提亦無動。",
        "translation": "Thus, because form has no movement, enlightenment also has no movement, and because consciousness has no movement, enlightenment also has no movement.",
        "source": "T11n0320_009:0943a26_10"
    },
    {
        "source_sentence": "如是色不可見故，菩提亦不可見，乃至識不可見故，菩提亦不可見。",
        "translation": "Because such form is invisible, enlightenment is also invisible, and because consciousness is invisible, enlightenment is also invisible.",
        "source": "T11n0320_009:0943a28_11"
    },
    {
        "source_sentence": "彼菩提相自性離故，復云何說不生不滅、寂靜無二、湛然不動及不可見？",
        "translation": "Because their characteristics of enlightenment are inherently free, how can they be said to neither arise nor cease, be quiescent and without duality, be unmoving and invisible?",
        "source": "T11n0320_009:0943a29_12"
    },
    {
        "source_sentence": "於諸法中何者名色？",
        "translation": "Among all dharmas, which is name and form?",
        "source": "T11n0320_009:0943b02_13"
    },
    {
        "source_sentence": "色自性空，受、想、行、識亦復皆空。",
        "translation": "The self-nature of form is empty, and so are feeling, perception, volition, and consciousness.",
        "source": "T11n0320_009:0943b02_14"
    },
    {
        "source_sentence": "何者名佛？",
        "translation": "What's called Buddha?",
        "source": "T11n0320_009:0943b03_15"
    },
    {
        "source_sentence": "何名菩薩？",
        "translation": "What's called a bodhisattva?",
        "source": "T11n0320_009:0943b03_16"
    },
    {
        "source_sentence": "何名授記？",
        "translation": "What's the name of the prediction?",
        "source": "T11n0320_009:0943b03_17"
    },
    {
        "source_sentence": "佛、佛自性空，菩薩、菩薩自性空，菩提、菩提自性空，授記、授記自性空。",
        "translation": "The self-natures of buddhas and buddhas are empty, the self-natures of bodhisattvas and bodhisattvas are empty, the self-natures of enlightenment and enlightenment are empty, and the self-natures of",
        "source": "T11n0320_009:0943b04_18"
    },
    {
        "source_sentence": "所名佛者，但依世俗，假名呼召希望分別，諸有智者聞諸法空，不生取著，",
        "translation": "They are called buddhas because they rely only on worldly conventions, using names and calls to discriminate. The wise hear the emptiness of all phenomena without being attached to them.",
        "source": "T11n0320_009:0943b05_19"
    },
    {
        "source_sentence": "彼愚癡人聞則瞋恚不能入解。",
        "translation": "When that foolish man hears it, he becomes angry and can't enter understanding.",
        "source": "T11n0320_009:0943b07_20"
    },
    {
        "source_sentence": "譬如有人於睡夢中，具足受用五欲快樂，覺已思念實不可得，智者了知不生憂惱。",
        "translation": "It's like a person in a sleep or dream who fully experiences the five desires and pleasures, and after realizing them, he thinks they really can't be obtained, but a wise person understands that they don't give rise to gri",
        "source": "T11n0320_009:0943b08_21"
    },
    {
        "source_sentence": "如是安住菩薩乘者，了菩提性，本來空寂實無所得，不生怖畏亦復如是。",
        "translation": "Those who thus abide in the bodhisattva vehicle understand that the essence of enlightenment is inherently empty, tranquil, and really ungraspable, and so it's likewise when they don't become frightened.",
        "source": "T11n0320_009:0943b09_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0320_009:0943b11_23"
    },
    {
        "source_sentence": "了知諸法皆如夢故。",
        "translation": "It's because he knows that all dharmas are like dreams.",
        "source": "T11n0320_009:0943b11_24"
    },
    {
        "source_sentence": "愚癡凡夫取解各異，於諸妄法而生執著；",
        "translation": "Foolish worldlings, each with different grasping and understanding, give rise to clinging to false doctrines.",
        "source": "T11n0320_009:0943b12_25"
    },
    {
        "source_sentence": "如是諸法皆不可得。",
        "translation": "Such things are all unobtainable.",
        "source": "T11n0320_009:0943b13_26"
    },
    {
        "source_sentence": "凡夫不可得，凡夫法亦不可得；",
        "translation": "Ordinary people are ungraspable, and so are the principles of ordinary people.",
        "source": "T11n0320_009:0943b13_27"
    },
    {
        "source_sentence": "聲聞不可得，聲聞法亦不可得；",
        "translation": "A śrāvaka is ungraspable, and the dharma of a śrāvaka is also ungraspable.",
        "source": "T11n0320_009:0943b14_28"
    },
    {
        "source_sentence": "緣覺不可得，緣覺法亦不可得；",
        "translation": "Conditioned states of mind are ungraspable, and so are the principles of conditioned states of mind.",
        "source": "T11n0320_009:0943b15_29"
    },
    {
        "source_sentence": "菩薩不可得，菩薩法亦不可得；",
        "translation": "Enlightening beings are ungraspable, and so are the principles of enlightening beings.",
        "source": "T11n0320_009:0943b15_30"
    },
    {
        "source_sentence": "佛不可得，佛法亦不可得；",
        "translation": "The Buddha is ungraspable, and so are the Buddha teachings.",
        "source": "T11n0320_009:0943b16_31"
    },
    {
        "source_sentence": "菩提不可得，菩提法亦不可得；",
        "translation": "Enlightenment is ungraspable, and the principles of enlightenment are also ungraspable.",
        "source": "T11n0320_009:0943b17_32"
    },
    {
        "source_sentence": "涅盤不可得，涅盤法亦不可得。」",
        "translation": "The nirvāṇa is unobtainable, and the nirvāṇa teaching is also unobtainable.",
        "source": "T11n0320_009:0943b17_33"
    },
    {
        "source_sentence": "時覩史多天子作是說已，白言：「世尊！",
        "translation": "After he said this, the Kauṣṭhila Devānām-Indra said, Bhagavān!",
        "source": "T11n0320_009:0943b18_34"
    },
    {
        "source_sentence": "我今於此第一義中，得無疑惑，發清淨心，造作上妙種種供養，勝焰摩天不可為比。」",
        "translation": "Now, in this first meaning, I've attained the absence of doubt and arisen with a pure mind to make various kinds of excellent offerings that can't be compared to those of Yama Heaven.",
        "source": "T11n0320_009:0943b19_35"
    },
    {
        "source_sentence": "「若人奉行如來教，　　則為安住佛功德，",
        "translation": "“If someone follows the teaching of the Enlightened, They will abide in the virtues of buddhahood.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　彼於三種解脫門，　　深達義味無罣礙。",
        "translation": "In the three kinds of liberation, they profoundly understand their meaning and taste without obstruction.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　此中無色及受想，　　亦無行識心與境，",
        "translation": "Herein there is formlessness and feeling and perception, And no conditioned consciousness, mind, or object.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　了彼五蘊但假名，　　是名具慧人師子。",
        "translation": "Understanding that the five aggregates are only nominal names, this is called a lion who possesses wisdom.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　如是最上勝丈夫，　　不取少分菩提相，",
        "translation": "Thus, the supremely superior man doesn't take a little bit of the characteristic of enlightenment.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　已悟蘊空獲善利，　　於佛功德無疑惑。",
        "translation": "Having awakened to the emptiness of the aggregates, they attain good benefits, and have no doubts or doubts about the Buddha’s virtues.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　深達菩提實相義，　　不起希望不毀呰，",
        "translation": "Deeply comprehending the true meaning of enlightenment, They do not give up hope or disparage it.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　亦無忻喜任運心，　　此則善住菩提行。",
        "translation": "Nor does he have the mind to rejoice freely, and this is a well-abiding bodhisattva's practice.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　若人平等見法性，　　則於諸法無所畏，",
        "translation": "If someone equally sees the essence of things, Then they have no fear in regard to things.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　佛子能於此世間，　　具足修證勝功德。",
        "translation": "In this world, the offspring of Buddha can fully cultivate and realize supreme virtue.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　了達色相悉皆空，　　於諸欲境咸棄捨，",
        "translation": "Understanding that form and characteristics are all void, They abandon all objects of desire.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　觀察輪迴三有中，　　亦不希求不願樂。",
        "translation": "Observing the transmigration of the three existences, they don't seek or wish for happiness.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　若人明了五蘊法，　　佛及菩提并授記，",
        "translation": "If someone clearly understands the five dharmas of the aggregates, the Buddha and enlightenment as well as their predictions,",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　說者聽者二皆空，　　如是悟解無所礙。",
        "translation": "Those who teach and those who hear are both empty; Thus enlightenment and understanding are unhindered.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　佛功德法凡夫法，　　此一切相本無生，",
        "translation": "The Buddha’s qualities are the qualities of buddhas, and the qualities of worldlings. All these characteristics are fundamentally uncreated.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　能了最上法性門，　　是則名為真佛子。",
        "translation": "Being able to comprehend the supreme aspect of the nature of dharmas is called a true Buddha-child.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　又復了知如是法，　　五蘊處界本無滅，",
        "translation": "Furthermore, they also understand that such things As the five aggregates, fields, and realms Originally have no cessation:",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　佛及菩提授記言，　　斯等諸法悉同等。",
        "translation": "The Buddha and the prediction of enlightenment say, All these things are the same.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　智者達解此法門，　　而不捨離菩提行，",
        "translation": "The wise understand this teaching And do not give up enlightenment practice.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　由了法性無滅故，　　於佛菩提不難得。",
        "translation": "Because they understand that the essence of things has no cessation, The Buddha’s enlightenment is not difficult to attain.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　又復諸蘊及處界，　　佛及菩提皆空寂，",
        "translation": "Furthermore, all the aggregates and sense-fields, Buddhas and enlightenment are both empty and void.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　若人於此無依求，　　彼則能持佛正法。",
        "translation": "If someone doesn't rely on this, they can maintain the Buddha's right teaching.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　諸蘊處界皆無作，　　佛及菩提授記事，",
        "translation": "The aggregates, fields, and realms are all uncreated: Buddha and enlightenment teach this.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　彼等諸法悉皆同，　　如是了知為佛子。",
        "translation": "All of these things are the same: Thus do they know as offspring of Buddha.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　諸蘊處界自性空，　　佛及菩提授記事，",
        "translation": "The self-nature of the aggregates, fields, and realms is emptiness; Buddha and enlightenment teach this doctrine.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　智者決定善了知，　　此則名為真佛子。",
        "translation": "A wise person is certain to know well, and this is called the true Buddha-child.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　諸蘊處界悉虛妄，　　及與最勝二足尊，",
        "translation": "The aggregates, fields, and realms are all unreal, As well as the supreme two-legged honored one.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　菩提授記亦同然，　　如是了知為佛子。",
        "translation": "So it is with the prediction of enlightenment, which thus understands as a Buddha-child.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　是法非離非不離，　　亦非為有亦非無，",
        "translation": "This doctrine is neither separated nor not separated, Neither existent nor nonexistent.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　非有為相及無為，　　如是了知為佛子。",
        "translation": "What’s not conditioned and what’s unconditioned Is thus known as Buddha-child.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　如來出現於世間，　　了達如是微妙義，",
        "translation": "The Buddha appears in the world, Understanding such subtle meanings.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　是為最上勝丈夫，　　堪受諸天廣供養。",
        "translation": "This is the supreme and most excellent man Who can receive extensive offerings from heavenly beings.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　我今稱讚佛功德，　　所獲福報利群生，",
        "translation": "I now praise the virtues of buddhas, The blessings and rewards they bring for the benefit of all living beings.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "　唯有如來悉證知，　　迴向自他皆作佛。」",
        "translation": "Only the Tathāgata fully realizes that dedication of merit to self and others becomes buddha.",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "作供養已，頭面敬禮佛世尊足，右繞三匝，住立一面，合掌向佛，以偈讚曰：爾時世尊知諸天子心之所念，",
        "translation": "Having made this offering, he bowed his forehead and face at the Buddha’s feet. The World-honored One circumambulated him three times to his right, stood to one side, joined his palms in respect toward the Buddha, and praised him",
        "source": "T11n0320_009:0943b21_36"
    },
    {
        "source_sentence": "希望如來與授佛記，即於座中，放淨光明。",
        "translation": "I hope that the Tathāgata will give me the Buddha's assurance of enlightenment, and that he will radiate a pure light from his seat.",
        "source": "T11n0320_009:0943c28_37"
    },
    {
        "source_sentence": "「世尊今者何因緣，　　以神通力現斯瑞？",
        "translation": "Bhagavān, what is the reason for this miraculous manifestation of your supernormal powers?",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　願為眾會說其由，　　一切世間咸喜悅。",
        "translation": "Please explain the reason for this to the assembly, and all the worlds will be delighted.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　覩佛口中放淨光，　　諸天皆悉懷疑惑，",
        "translation": "Pure light emanated from the Buddha’s mouth; The gods all wondered and wondered.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　各各瞻仰於慈顏，　　一心願聞佛所說。",
        "translation": "Each looked up to his compassionate countenance, wishing to hear what the Buddha taught with one mind.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　譬如病者遇良醫，　　唯希拯救授靈藥，",
        "translation": "It's like a sick person who meets a good doctor Who only wants to save and prescribe spiritual medicine.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　今此眾等住佛前，　　渴仰希須亦如是。",
        "translation": "These beings now stand before the Buddha, And their longing and need is likewise.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　諸來集會天人眾，　　皆具廣大清淨慧，",
        "translation": "All the gods and humans who have come to this assembly Are all endowed with vast pure wisdom.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　一心諦聽無異緣，　　於佛所說能入解。",
        "translation": "Listen with one mind, attentively, without dissimilar conditions; Being able to enter and understand what the Buddha teaches.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　如來常以大悲心，　　能破一切諸疑網，",
        "translation": "The enlightened always, with great compassion, Can destroy all the webs of doubt.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　彼等聞已皆奉持，　　摧諸異論生正見。」",
        "translation": "After they hear it, they all adhere to it and destroy divergent theories and give rise to right views.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "「馬勝汝今發斯問，　　為利世間作照明，",
        "translation": "“馬勝汝今發斯問,為利世界作照明,",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　智者能息諸群疑，　　故得人天咸尊重。",
        "translation": "The wise can quell all doubts, so they attain the respect of humans and gods.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　覩史天王及天子，　　達最上法甘露味，",
        "translation": "The king of Kauśinagara and the celestial beings Realized the supreme taste of the ambrosia of the Dharma.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　作大供養妙莊嚴，　　是故我今與授記。",
        "translation": "I'll make a great offering of marvelous adornment, so now I'll give it to you as an assurance.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　彼以勝慧觀世間，　　得見法性無所著，",
        "translation": "Observing the world with supreme wisdom, They see the essence of things Without attachment or attachment.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　善達三種解脫門，　　非愚癡者之所及。",
        "translation": "He well understands the three kinds of liberation, which are beyond the ability of foolish people.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　彼於過去諸佛所，　　已曾請問如是義，",
        "translation": "They’ve already questioned the Buddhas of the past about such things.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　觀諸法性畢竟空，　　悉如先佛之所說。",
        "translation": "Observing that the essence of all dharmas is ultimately empty, they're all as explained by the previous buddhas.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　今復於我興供養，　　最上最勝無與比，",
        "translation": "I now offer you my highest and most excellent offering, incomparable.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　能以空義讚如來，　　皆為利樂有情故。",
        "translation": "They can praise the Tathāgata in terms of emptiness, All for the benefit and welfare of sentient beings.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　一切諸法皆無生，　　佛及菩提授記事，",
        "translation": "All things have no birth: The Buddha and enlightenment teach this doctrine.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　乃至修習菩提者，　　本性無生亦同等。",
        "translation": "Even if someone cultivates enlightenment, the original nature of nonarising is the same as that.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　若人如是了法性，　　決定當證大菩提，",
        "translation": "If someone understands the essence of things like this, They will surely realize great enlightenment.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　彼諸天子昔聞持，　　故能宣暢第一義。",
        "translation": "Because those celestial beings heard and upheld it in the past, they were able to proclaim the supreme truth.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　能以明慧善決擇，　　了知法性常無減，",
        "translation": "They are able, through knowledge and wisdom, to skillfully discriminate And know the essence of things is eternal without diminution.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　彼諸天子離諸疑，　　自然成就無師智。",
        "translation": "Those celestial beings, free of doubt, Will naturally perfect teacherless knowledge.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　法性非取亦非求，　　畢竟無依離分別，",
        "translation": "The essence of things is neither grasping nor seeking, Ultimately without basis and free from discrimination.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　彼諸天子離諸疑，　　愚夫心則生驚怖。",
        "translation": "Those celestials are free of doubt, and the minds of foolish people become frightened.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　一切諸法離自性，　　菩提及彼菩提心，",
        "translation": "All things are apart from their own essence, Enlightenment and that mind of enlightenment.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　彼諸天子善了知，　　本來清淨無染著。",
        "translation": "Those celestial beings well understand Their original purity, without defiled attachment.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　覩史天王天子等，　　住堅固慧無所住，",
        "translation": "Celestial beings like Kauśinagara, the king of gods, and so forth, Abiding in steadfast wisdom, have no abode.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　不久當得佛菩提，　　具足圓成一切智。",
        "translation": "Soon they will attain enlightenment of buddhahood, Completely perfecting omniscience.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　於彼未來星宿劫，　　次第出現於世間，",
        "translation": "In those future ages of stars, constellations, and eons They appear in the world one after another.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　度脫無邊諸眾生，　　同名決定智王佛。",
        "translation": "To liberate boundless sentient beings, They are all called the Buddha King of Determined Knowledge.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　如來知彼心所念，　　應念忽放淨光明，",
        "translation": "Knowing what they think, the Enlightened One instantly emanates pure light.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "　為說授記成佛因，　　令彼時會生忻慶。」",
        "translation": "He teaches the causes of the accomplishment of Buddhahood in order to cause them to attain enlightenment, so that they'll then be born in Xianqing.",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "時尊者馬勝覩是相已，合掌向佛，以偈問曰：爾時世尊，為馬勝比丘說伽陀曰：父子合集經樂變化天授記品第十八爾時樂變化天主，",
        "translation": "After these signs had appeared, Venerable Ma Śrīmālā joined his palms and faced the Buddha. He asked in verse: At that time the World-honored One said to the bhikṣu Mahāsthāmaprāpta, “O father",
        "source": "T11n0320_009:0943c29_38"
    },
    {
        "source_sentence": "與七十俱胝天子眷屬俱，見諸阿脩羅王乃至都史多天諸天子等，於世尊所作供養已，",
        "translation": "He was accompanied by a retinue of seventy corpuscles of celestial beings who saw the asuras and other celestial beings from Tuṣita Heaven and so forth making offerings to the Bhagavān.",
        "source": "T11n0320_009:0944b11_39"
    },
    {
        "source_sentence": "深生隨喜，踊躍無量，復聞如來與彼授記，是諸天子聞是說已，身意泰然，",
        "translation": "Having heard this discourse, the celestial beings were delighted and jumped for joy. They also heard that the Tathāgata had given them a prediction of future enlightenment.",
        "source": "T11n0320_009:0944b13_40"
    },
    {
        "source_sentence": "得住實際，於勝義法，離諸疑惑。",
        "translation": "He attains the practice of abiding in reality, becomes free of doubt and confusion about the ultimate truth.",
        "source": "T11n0320_009:0944b15_41"
    },
    {
        "source_sentence": "時樂變化天王，即從座起，頭面禮足，合掌恭敬，而白佛言：「世尊！",
        "translation": "The heavenly king of the timely blissful transformation heaven rose from his seat, bowed his head and feet, joined his palms in respect, and said to the Buddha, Bhagavān!",
        "source": "T11n0320_009:0944b15_42"
    },
    {
        "source_sentence": "如我解佛所說義，一切諸法名為實際，名無量際、無礙際、無住際、無盡際、無二際，",
        "translation": "As I understand the meaning of what the Buddha teaches, all things are called reality. They are called boundless, unobstructed, nonabiding, inexhaustible, and nondual.",
        "source": "T11n0320_009:0944b17_43"
    },
    {
        "source_sentence": "非際無際，說名實際。",
        "translation": "The dharmas that are neither finite nor infinite are said to be called actual.",
        "source": "T11n0320_009:0944b19_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0320_009:0944b19_1"
    },
    {
        "source_sentence": "言實際者，不顛倒故；",
        "translation": "The expression actual is because they are not overturned.",
        "source": "T11n0320_009:0944b19_2"
    },
    {
        "source_sentence": "無量際者，非分限故；",
        "translation": "Measureless is because they are not limited.",
        "source": "T11n0320_009:0944b20_3"
    },
    {
        "source_sentence": "無礙際者，非和合故；",
        "translation": "The unobstructed boundary is because it is not a combination.",
        "source": "T11n0320_009:0944b20_4"
    },
    {
        "source_sentence": "無住際者，離自性故；",
        "translation": "“There is no limit of abiding”: Because it is free from the specific nature.",
        "source": "T11n0320_009:0944b21_5"
    },
    {
        "source_sentence": "無量際者，無有生故；",
        "translation": "“Countless realms”: Because there is no birth.",
        "source": "T11n0320_009:0944b21_6"
    },
    {
        "source_sentence": "無二際者，唯一相故；",
        "translation": "The absence of duality is because it has only one characteristic.",
        "source": "T11n0320_009:0944b22_7"
    },
    {
        "source_sentence": "非際者，體非有故；",
        "translation": "“They do not have a limit”: Because the essence does not exist.",
        "source": "T11n0320_009:0944b22_8"
    },
    {
        "source_sentence": "無際者，本無極故。",
        "translation": "The boundless one is because they are originally infinite.",
        "source": "T11n0320_009:0944b23_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0320_009:0944b23_1"
    },
    {
        "source_sentence": "此實際法遍一切處，有為、無為通達無礙，無有一法非實際故，乃至菩提，",
        "translation": "These actual dharmas pervade all places, and conditioned and unconditioned can be comprehended without obstruction. Because there is not a single dharma that is not actual, up to enlightenment.",
        "source": "T11n0320_009:0944b23_2"
    },
    {
        "source_sentence": "亦是實際。",
        "translation": "It's also the actuality.",
        "source": "T11n0320_009:0944b25_3"
    },
    {
        "source_sentence": "復以何法名為菩提？",
        "translation": "Again, what is called enlightenment?",
        "source": "T11n0320_009:0944b25_4"
    },
    {
        "source_sentence": "此一切法即是菩提，乃至所有五無間業亦是菩提。",
        "translation": "All these things are enlightenment, and all the five kinds of unremitting karma that exist are also enlightenment.",
        "source": "T11n0320_009:0944b25_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0320_009:0944b27_6"
    },
    {
        "source_sentence": "彼菩提法，離自性故，五無間業亦離自性。",
        "translation": "Because these factors of enlightenment are free from their own nature, the five proximate actions are also free from their own nature.",
        "source": "T11n0320_009:0944b27_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0320_009:0944b28_8"
    },
    {
        "source_sentence": "又彼五無間業，即無餘涅盤界。",
        "translation": "Also, these five kinds of proximate action are the realm of nirvana without remainder.",
        "source": "T11n0320_009:0944b28_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0320_009:0944b29_0"
    },
    {
        "source_sentence": "彼諸法性離罪相故，是故無間業，名為涅盤界。",
        "translation": "Because the nature of these dharmas is free from the characteristics of blameworthiness, that's why unremitting karma is called the nirvāṇa realm.",
        "source": "T11n0320_009:0944b29_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0320_009:0944c01_2"
    },
    {
        "source_sentence": "住輪迴者，可求涅盤，彼實際中，無有二相，無生死可離，無涅盤可證。",
        "translation": "Those who abide in transmigration can seek nirvāṇa, but there are no two characteristics in their actuality, no birth-and-death to part with, and no nirvāṇa to realize.",
        "source": "T11n0320_009:0944c01_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0320_009:0944c02_4"
    },
    {
        "source_sentence": "自性離故。",
        "translation": "It's because the self-nature is free of it.",
        "source": "T11n0320_009:0944c03_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0320_009:0944c03_6"
    },
    {
        "source_sentence": "我今於此實際理中無有疑惑，若於此法得離疑者，當知是人，已於過去佛世尊所，",
        "translation": "I have no doubt whatsoever regarding this doctrine of reality. If someone has been freed from doubt regarding this doctrine, know that such a person was already in the presence of the Buddhas of the past:",
        "source": "T11n0320_009:0944c03_7"
    },
    {
        "source_sentence": "得授阿耨多羅三藐三菩提記。」",
        "translation": "They'll be given the assurance of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0320_009:0944c05_8"
    },
    {
        "source_sentence": "是時如來聞彼天王作是說已，欲令大眾心淨信解，生歡喜故，即於座中放大光明。",
        "translation": "When the Tathāgata heard those celestial kings say this, he wanted to cause the minds of the masses to become pure and faithful, so they rejoiced and radiated a bright light from their seats.",
        "source": "T11n0320_009:0944c06_9"
    },
    {
        "source_sentence": "「憐愍世間調御師，　　於大眾中現斯瑞，",
        "translation": "With compassion for the tamer of the world, he manifests this miracle in the midst of the masses.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　口中忽放淨光明，　　此相非無其所以。",
        "translation": "Suddenly a pure light emanates from his mouth: This sign is not without reason.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　今此諸來大集會，　　咸生清淨恭敬心，",
        "translation": "The great assembly of those who have come here now All become pure and respectful.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　願說所放光因緣，　　使除一切諸疑惑。",
        "translation": "May you explain the causes and conditions for the light emitted, getting rid of all doubts and confusion.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　此等若聞佛所說，　　一心諦聽而信受，",
        "translation": "If they hear what the Buddha teaches, They listen attentively and accept it with one mind.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　咸遵佛教能奉行，　　誓求無上菩提果。",
        "translation": "They all follow Buddhism and can practice it, Vowing to seek the supreme fruit of enlightenment.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　唯願如來速演說，　　慰彼群生渴仰心，",
        "translation": "I entreat you, World-Honored One, to teach them quickly, Reasoning the cravings of those living beings.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　諸天身意咸泰然，　　決定自知當得佛。」",
        "translation": "The bodies and minds of the gods are all calm, determined to know for themselves that they'll attain Buddhahood.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "「馬勝今問放光事，　　如來所作非無因，",
        "translation": "\\",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　汝當諦聽無異思，　　今與諸天授佛記。",
        "translation": "Listen attentively, without any dissimilar thoughts. Now I give the prediction of enlightenment to the gods.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　化樂天王并眷屬，　　漸能成就一切智，",
        "translation": "The apparitional celestial king and his retinues Will gradually be able to perfect omniscience.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　當於天人大眾中，　　作師子吼摧異論。",
        "translation": "In the midst of the great assembly of gods and humans, he'll make a lion's roar to destroy dissent.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　譬如一切山穴中，　　不產珠璣無有惑，",
        "translation": "It's like all the mountain caves that don't produce pearls and have no confusion.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　如是化樂諸天人，　　決定當來得作佛。",
        "translation": "Thus, the gods and humans who are transformed into bliss will surely become buddhas in the future.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　又如世間日沒時，　　不久應知月出現，",
        "translation": "Also, just as when the sun goes down in the world, Soon you should know that the moon appears.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　彼諸天子達法性，　　自知必定成正覺。",
        "translation": "Those celestial beings understand the essence of reality And know for themselves that they will surely attain enlightenment.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　又如世間日中時，　　觀諸色像皆明了，",
        "translation": "It’s also like observing all forms at noon in the world, Observing them clearly.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　彼諸天子達法性，　　當獲如來一切智。",
        "translation": "Those celestial beings who understand the essence of reality Will attain the omniscience of buddhahood.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　又如世間夜分時，　　有情咸知日不現，",
        "translation": "Furthermore, just as at the time of the night in the world, All sentient beings know that the sun does not appear.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　彼諸天子達法性，　　當得明慧悉照了。",
        "translation": "Those celestial beings who understand the essence of reality Will attain clarity and wisdom, completely illuminating it.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　又如世間諸流泉，　　悉皆注下歸於海，",
        "translation": "And just as all the rivers and streams of the world All flow down into the ocean,",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　彼諸佛子達法性，　　必能速證大菩提。",
        "translation": "Those Buddha-children who understand the essence of things Will surely quickly realize great enlightenment.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　如以瓦礫擲空中，　　力盡墜地必應爾，",
        "translation": "Like throwing a piece of rubble into the sky, it will surely fall to the ground with all its strength.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　彼諸佛子達法性，　　不久成佛無有疑。",
        "translation": "Those heirs of the Buddha understand the essence of reality Soon they will become buddhas, without any doubt.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　若人了達此法性，　　入佛知見離戲論，",
        "translation": "If someone understands this essence of reality, they’ll enter the Buddha’s knowledge and vision and be free of conceptual elaborations.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　彼當取證大功德，　　往趣菩提場不遠。",
        "translation": "They will attain great merit and realize it, not far from the site of enlightenment.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　假使二十那由他，　　弊魔說我不作佛，",
        "translation": "Even if the Evil One were to teach me that I am not a buddha for twenty nayutas,",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　由具正見達法性，　　不能退壞菩提意。",
        "translation": "Because they are endowed with right view and understand the essence of reality, They can't regress or break the mind of enlightenment.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　如是彼諸天子眾，　　善解法性心無著，",
        "translation": "In the same way, those celestial beings Understand the essence of reality; Their minds have no attachment.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　各各希望授記言，　　故我讚勵生忻慰。",
        "translation": "Each one wishes to give a prediction, saying, Therefore, I praise and encourage the enthusiastic.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　是諸天子久修習，　　不由他悟能入解，",
        "translation": "These celestial beings have cultivated it for a long time, Able to enter and understand without relying on others’ enlightenment.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　自知決定得菩提，　　諸有智者皆隨喜。",
        "translation": "Knowing for themselves that they will surely attain enlightenment, the wise are all delighted.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　馬勝比丘當了知，　　若求無上菩提者，",
        "translation": "The superior monk Ma should know that those who seek supreme enlightenment,",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　常樂親近佛世尊，　　觀諸法性無罣礙。",
        "translation": "They always delight in associating with the Buddha, the Bhagavān, Observing the nature of all dharmas without obstruction.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　自能入解於正理，　　復令他人善通達，",
        "translation": "They themselves can enter and understand the correct principle, And also cause others to comprehend well.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　隨其力能為演說，　　是為第一行法者。",
        "translation": "Being able to explain it for them according to their power is the first practice.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　設百千劫行苦行，　　以身血肉而布施，",
        "translation": "Even if they practice asceticism for a hundred thousand eons, They give away their bodies, blood and flesh.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　於剎那頃了法性，　　此福廣大復過是。",
        "translation": "To comprehend the essence of dharmas in an instant, this merit is even greater.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　過去所有一切佛，　　現在救度眾生者，",
        "translation": "All the buddhas of the past, Those who save sentient beings in the present.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　以及未來諸世尊，　　無不依此而修習。",
        "translation": "And there are no future world-honored ones who won't cultivate it without relying on it.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　化樂天王并眷屬，　　今於我前伸供養，",
        "translation": "The lord of the Nirmāṇaratideva heaven and his retinue will now extend their offerings before me.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　已曾往昔植福因，　　故能了斯深法義。",
        "translation": "Having planted roots of goodness in the past, They are able to understand the meaning of this profound teaching.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　諸有世間具智者，　　當須修證三摩地，",
        "translation": "Those in the world who are endowed with knowledge Should cultivate and realize concentration.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　若能依止勝等持，　　是人得至佛行處。",
        "translation": "If someone can rely on superior equipoise, they'll attain the Buddha's place of practice.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　馬勝比丘當了知，　　此諸佛子悟法性，",
        "translation": "The superior monk Ma should know that these heirs of the Buddha have awakened to the essence of reality.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　常能游戲佛境界，　　摧伏一切諸異論。",
        "translation": "They can always play in the Buddha’s sphere, Overcoming all heretical theories.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　是故勤修清淨業，　　則能遠離諸苦惱，",
        "translation": "Therefore, by diligently cultivating pure actions They can be far removed from suffering and distress.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "　常樂親近說法師，　　得成無上菩提道。」",
        "translation": "They always delight in being intimate with the teacher who teaches the Dharma and attain the unsurpassed path of enlightenment.",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "時尊者馬勝比丘，以偈問曰：爾時世尊為馬勝比丘說伽陀曰：父子合集經他化自在天授記品第十九爾時他化自在天王，",
        "translation": "At that time the venerable monk Kasyapa asked in verse, “Then the World-honored One said to the monk Kasyapa:",
        "source": "T11n0320_009:0944c07_10"
    },
    {
        "source_sentence": "與八十那由他天子眷屬俱，見諸阿修羅王乃至樂變化天等，於如來所作諸供養，",
        "translation": "Together with their retinues of eighty myriads of celestial beings, they saw the asura kings and so forth, up to the heaven of bliss and magical manifestations, making offerings to the enlightened ones.",
        "source": "T11n0320_009:0945b01_11"
    },
    {
        "source_sentence": "復聞如來與彼授記，歡喜踊躍，得未曾有。",
        "translation": "Again, when they heard that the Tathāgata had given them a prediction, they rejoiced and jumped for joy, attaining an unprecedented experience.",
        "source": "T11n0320_009:0945b03_12"
    },
    {
        "source_sentence": "白言：「世尊！",
        "translation": "He said, Bhagavān!",
        "source": "T11n0320_009:0945b04_13"
    },
    {
        "source_sentence": "此樂變化天所說實際，我今於實尚不可得，云何復說更有於際？",
        "translation": "This is the reality explained by the gods of bliss and transformation, but now that it's really unobtainable, how could they say there's a limit?",
        "source": "T11n0320_009:0945b04_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0320_009:0945b06_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0320_009:0945b06_1"
    },
    {
        "source_sentence": "若見實者亦應見際，當知是人住二種相，何能入解證彼菩提？",
        "translation": "If someone sees the real, they should also see the limits, knowing that these people abide in two kinds of characteristics, so how can they enter and understand and realize their enlightenment?",
        "source": "T11n0320_009:0945b06_2"
    },
    {
        "source_sentence": "應知彼說是非道行。",
        "translation": "You should know that they teach what's not the practice of the path.",
        "source": "T11n0320_009:0945b07_3"
    },
    {
        "source_sentence": "若善男子離此二相名善安住，住無所住，則無言說。",
        "translation": "If good sons are free of these two characteristics, they're called well-abiding and abide, and there's nothing to abide in, then there's nothing to say.",
        "source": "T11n0320_009:0945b08_4"
    },
    {
        "source_sentence": "求菩提者，無有少法當情可見，而能覺悟得彼菩提。",
        "translation": "Those who seek enlightenment don't have few dharmas that can be seen in their minds, but they can awaken and attain their enlightenment.",
        "source": "T11n0320_009:0945b09_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0320_009:0945b10_6"
    },
    {
        "source_sentence": "此實際法，非有非無，離一切相，非過去、非現在、非未來，非有為、非無為，",
        "translation": "This actual entity is neither existent nor nonexistent, free from all characteristics, not past, not present, not future, not conditioned or unconditioned.",
        "source": "T11n0320_009:0945b10_7"
    },
    {
        "source_sentence": "非識識、非智知，非觀察、非現證，無有少法為能對治，亦無少法作所對治。",
        "translation": "It's not consciousness, consciousness, cognition, or knowledge, and it's not observed or actualized, there are few things that can be counteracted, and there are few things that are counteracted by what's done.",
        "source": "T11n0320_009:0945b12_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0320_009:0945b14_9"
    },
    {
        "source_sentence": "法非煩惱所染污故，法無自性不可得故；",
        "translation": "Because dharmas are not stained by defilement, because dharmas have no essence and cannot be grasped.",
        "source": "T11n0320_009:0945b14_10"
    },
    {
        "source_sentence": "若彼彼法有所對治，則有少法自性可見。",
        "translation": "If those things have antidotes, then there are few things that can be seen by their own nature.",
        "source": "T11n0320_009:0945b15_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0320_009:0945b16_12"
    },
    {
        "source_sentence": "若色生者，彼色離生相故，受、想、行、識生者，受、想、行、識離生相故。",
        "translation": "If form arises, it's because that form is free of the mark of arising and feeling, perception, volition, and consciousness arise because feeling, perception, volition, and consciousness are free of the mark of arising.",
        "source": "T11n0320_009:0945b16_13"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0320_009:0945b17_14"
    },
    {
        "source_sentence": "若色滅者，彼色離滅相故；",
        "translation": "When form ceases, it is because those forms are free from the characteristic mark of cessation.",
        "source": "T11n0320_009:0945b17_15"
    },
    {
        "source_sentence": "受、想、行、識滅者，受、想、行、識離滅相故。",
        "translation": "The cessation of feeling, perception, volition, and consciousness is because feeling, perception, volition, and consciousness are free of the characteristic of cessation.",
        "source": "T11n0320_009:0945b18_16"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0320_009:0945b19_17"
    },
    {
        "source_sentence": "若過去者，離過去相故；",
        "translation": "The one of the past is because it is free from the characteristic marks of the past.",
        "source": "T11n0320_009:0945b19_18"
    },
    {
        "source_sentence": "未來者，離未來相故；",
        "translation": "The future is because of being free from the characteristic marks of the future.",
        "source": "T11n0320_009:0945b19_19"
    },
    {
        "source_sentence": "現在者，離現在相故。",
        "translation": "“ Present”: Because it is free from the characteristic marks of the present.",
        "source": "T11n0320_009:0945b20_20"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0320_009:0945b20_21"
    },
    {
        "source_sentence": "若有為者，離有為相故；",
        "translation": "Conditioned dharmas are conditioned because they are free from the characteristics of conditioned things.",
        "source": "T11n0320_009:0945b21_22"
    },
    {
        "source_sentence": "無為者，離無為相故。",
        "translation": "The unconditioned one: because it is free from the characteristic mark of being unconditioned.",
        "source": "T11n0320_009:0945b21_23"
    },
    {
        "source_sentence": "如是五蘊所攝，三際所攝，有為所攝，無為所攝，此等諸法皆不可得；",
        "translation": "In this way, all these factors are included in the five aggregates; they are included in the three periods of time. They are categorized as conditioned and unconditioned. All these factors cannot be grasped.",
        "source": "T11n0320_009:0945b22_24"
    },
    {
        "source_sentence": "以不可得，是故彼法不可知、不可見、不可說、不可解、不可觀、不可證。",
        "translation": "Because it's unobtainable, that dharma can't be known, seen, explained, understood, contemplated, or realized.",
        "source": "T11n0320_009:0945b23_25"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0320_009:0945b25_26"
    },
    {
        "source_sentence": "若善男子，善女人，為求菩提，如是發心決定修行；",
        "translation": "Good men and good women, in order to seek enlightenment, practice with determination like this.",
        "source": "T11n0320_009:0945b25_27"
    },
    {
        "source_sentence": "彼皆名為善能安住菩薩乘者。」",
        "translation": "They're all called those who are well able to abide in the bodhisattva vehicle.",
        "source": "T11n0320_009:0945b26_28"
    },
    {
        "source_sentence": "「如來顯示輪迴際，　　無始堅固難超越，",
        "translation": "The Tathāgata shows the limit of transmigration, which is beginningless and hard to transcend.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　世間無智諸凡夫，　　樂住三有生死海。",
        "translation": "Ordinary people lacking knowledge in the world are happy to abide in the sea of birth and death in the three existences.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　諸蘊本來自性空，　　一切有情不可得，",
        "translation": "The aggregates are inherently empty by nature, Ungraspable to all sentient beings.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　無有少法可對治，　　當知諸法皆無相。",
        "translation": "There's no little thing to counteract, and you should know that all things have no characteristics.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　色自性空本非有，　　非知非識非觀察，",
        "translation": "The self-nature of form as emptiness is not existence in the first instance; neither knowing nor consciousness, and neither contemplation nor observation.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　非見非證亦非無，　　依此正理善明了。",
        "translation": "Not seeing, not realizing, and not nonexistent: Based on this correct principle, they can clearly understand.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　菩提無相不可得，　　菩提分法亦復然，",
        "translation": "Enlightenment is signless and ungraspable, So are the factors of enlightenment.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　佛菩薩僧但假名，　　離心取相皆無相。",
        "translation": "Buddhas, bodhisattvas, and saṃgha are only nominal names; apart from the mind's grasping of characteristics, they all lack characteristics.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　愚夫著欲取諸相，　　自謂我得菩提心，",
        "translation": "Foolish people, attached to desire and grasping images, Think that they themselves have attained the will for enlightenment.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　彼行顛倒境界中，　　染慧難證真常理。",
        "translation": "Their practice is in the realm of delusion, and it's difficult for defiled wisdom to realize the true eternal principle.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　於佛境界離相者，　　是為智者依法行，",
        "translation": "Someone who is free of signs in the Buddha’s sphere— This is the religious practice of the wise.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　遠離諸相如無相，　　亦離於空及不空。",
        "translation": "Being free of marks like signlessness, they're also free of emptiness and nonemptyness.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　依此修習菩提行，　　獲得最上第一樂，",
        "translation": "Based on these practices of enlightenment, They attain the supreme bliss.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　一切外道不能知，　　亦非聲聞所行學，",
        "translation": "All non-Buddhists can't know, and they aren't trained by śrāvakas.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　又非辟支迦佛陀，　　心善解脫離塵垢，",
        "translation": "Furthermore, they are not pratyekabuddhas whose minds are well liberated from the defilement of dust.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　亦非無漏阿羅漢，　　於此正理能入解。",
        "translation": "Nor are they uncontaminated arhats who can enter and understand this correct principle.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　牟尼無相菩提行，　　唯大智者善了知，",
        "translation": "The practice of markless enlightenment of the sages Is well known only to the wise.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　若依正教能說空，　　非二乘輩之所有。",
        "translation": "If someone can explain emptiness based on the correct teaching, it doesn't belong to the two-vehicle group.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　善達實相不思議，　　了一切法無自性，",
        "translation": "Understanding the true character of things is inconceivable, They know all things have no essence.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "　菩提淺識不能知，　　上根聰慧聞即解。」",
        "translation": "Bodhi is not known by shallow consciousness, but the higher faculties are wise and understand it when they hear it.",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "爾時他化自在天子，咸說是所悟法已，合掌向佛，以偈讚曰：爾時世尊，",
        "translation": "At that time, the celestial being Paranirmitavaśavartin said to the Buddha: Having thus taught this doctrine of enlightenment, they joined their palms and praised him in verse:",
        "source": "T11n0320_009:0945b27_29"
    },
    {
        "source_sentence": "知諸他化天子心之所念，即於坐中放淨光明。",
        "translation": "Knowing what the other transformed celestial beings thought, they radiated pure light in their seats.",
        "source": "T11n0320_009:0945c20_30"
    },
    {
        "source_sentence": "「佛知他化天意樂，　　忽放清淨大光明，",
        "translation": "Knowing the wishes of other buddhas, The Buddha suddenly emanated a pure great ray of light",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　此唯如來自證知，　　願為時眾分別說。",
        "translation": "Only the Enlightened One knows this, And wishes to explain it distinctly for the sake of the beings of the time.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　諸天咸作是思念，　　佛非無因現此光，",
        "translation": "The gods all think, “The Buddha does not show this light for no reason.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　必為饒益諸群生，　　令生諦信心渴仰。",
        "translation": "It must be to benefit all sentient beings, Causing them to give rise to faith in the truth and longing for it.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　今此大眾懷猶豫。　　由覩如是希有因。",
        "translation": "Now the entire assembly is hesitant, for this rare and wonderful reason.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　口中放此淨光明。　　應與諸天授佛記。",
        "translation": "The pure light emitted from his mouth should be given to the gods and give them the Buddha’s prediction.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　彼等棄背輪迴道，　　求趣寂靜涅盤城，",
        "translation": "They turn their backs on the path of transmigration And seek to enter the city of peace and nirvana.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　佇聞如來梵音聲，　　無礙辯才速演說。",
        "translation": "They can hear the Buddha’s pure voice, Unhindered in intelligence and power of elucidation, speaking quickly.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　眾等尊重如來教，　　達諸法性無有疑，",
        "translation": "The assembly honored the teaching of the Enlightened, Understanding the essence of all things without doubt.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　堅固聞持信解心，　　稱讚牟尼功德海。",
        "translation": "Steadfast in listening, maintaining faith and understanding, they praise the ocean of merits of Samantabhadra.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　如來正教不思議，　　令眾生至安隱處，",
        "translation": "The true teaching of the Buddha is inconceivable, Causing sentient beings to reach a peaceful state.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　若能如理善修作，　　畢竟得成無上道。」",
        "translation": "If they can correctly cultivate it well, they'll ultimately attain the unsurpassed path.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "「善哉馬勝大比丘，　　諮問為利群生故，",
        "translation": "Good, O great monk Mahāsthāmaprāpta! It is for the benefit of living beings that you ask questions.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　我今放此淨光明，　　與授最上菩提記。",
        "translation": "Now, I'll radiate this pure light to bestow the supreme assurance of enlightenment.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　他化自在天主等，　　信解堅固悉利根，",
        "translation": "The lords of the heavens, masters of others’ emanations, and so on, Have faith and understanding that are firm, with keen faculties.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　皆能奉持諸佛言，　　久已修習菩提道。",
        "translation": "They can all honor the words of the Buddhas And have cultivated the path of enlightenment for a long time.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　能了世間諸妄想，　　如見陽焰知非實，",
        "translation": "They can comprehend all the deluded conceptions of the world, Just as they see mirages and know they are not real.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　愚夫謂水起妄心，　　求菩提者勿同彼。",
        "translation": "Foolish people say water gives rise to deluded thoughts, and those seeking enlightenment don't belong to them.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　諸有執著想見者，　　無智返怖於無相，",
        "translation": "Those who cling to conceptions and views Have no knowledge and fear formlessness.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　愚夫妄想趣非道，　　離此能得大菩提。",
        "translation": "Foolish people with deluded conceptions are headed for what's not the path, and being free of them can attain great enlightenment.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　妄想邪思為苦本，　　隨生分別即為縛，",
        "translation": "False ideation and false thought are the root of suffering. The discrimination that follows is bondage.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　智者了此悉皆空，　　得勝總持寂靜樂。",
        "translation": "A wise person understands that all of these are empty, and attains the bliss of the tranquility of superior mastery.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　妄想之心不平等，　　決定墮落於諸趣，",
        "translation": "The mind of deluded conception is unequal, definitely falling into the destinies.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　百千生中為苦緣，　　三世如來同此說。",
        "translation": "In one hundred thousand forms of birth, it is the condition for frustration. The Tathågatas of the three time periods are to be spoken of in exactly the same way.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　若人取著於想者，　　則為陰界所纏縛，",
        "translation": "If someone grasps and clings to conceptions, they’re bound by the aggregates and realms.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　善觀察者息妄緣，　　一切皆空無有相。",
        "translation": "Those who well observe cease deluded cognition, and all things are empty without marks.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　由想相故增諸惑，　　復能損減諸福業，",
        "translation": "It is because of the characteristics of ideation that defilement increases, and it can also harm virtuous actions.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　若於無相離狐疑，　　速證無上菩提果。",
        "translation": "If they are free of doubt about signlessness, They will quickly realize the fruit of supreme enlightenment.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　若人分別求聖道，　　分別求道即為縛，",
        "translation": "If someone discriminates and seeks the noble path, discriminating and seeking the path is bondage.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　智者在欲而行禪，　　彼則善修無相行。",
        "translation": "A wise person practices meditation in desire, and they skillfully cultivate the markless practice.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　諸法無體不可說，　　分別諸法性皆空，",
        "translation": "All things have no essence and cannot be explained; Discriminating the essence of things is emptiness.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　彼無相法離思惟，　　如是菩提不難得。」",
        "translation": "Those markless dharmas are free of contemplation, and thus enlightenment isn't difficult to attain.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　聞佛世尊作是說，　　眾離疑惑得無畏，",
        "translation": "Having heard this teaching of the Buddha, the World-honored One, They are freed from doubt and attain fearlessness.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　如以詹博迦花鬘，　　授之歡忻而頂受。",
        "translation": "It's like giving a flower garland of Jambudvīpa, bestowering it with joy and accepting it on the top of your head.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　是諸天眾心開悟，　　今於佛所伸供養，",
        "translation": "These gods are enlightened in their minds, and now they extend their offerings to the Buddha.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "　了知法性本來空，　　於未來世皆作佛。",
        "translation": "Knowing that the essence of things is originally empty, they'll all become buddhas in future lives.",
        "source": "T11n0320_009:0945c21_31"
    },
    {
        "source_sentence": "時馬勝尊者覩是相已，合掌向佛，以偈問曰：爾時世尊為尊者馬勝說伽陀曰：父子合集經卷第九",
        "translation": "Having seen these signs, Venerable Maud galyayana joined his palms and said to the Buddha in verse: At that time the World-honored One taught the Dharma to Venerable Maudgalyāyana, saying:",
        "source": "T11n0320_009:0945c21_31"
    }
]