[
    {
        "source_sentence": "大寶積經卷第四",
        "translation": "Dabaoji jing, vol. 4",
        "source": "T11n0310_004:0020b02_0"
    },
    {
        "source_sentence": "大唐三藏菩提流志奉　詔譯",
        "translation": "translated by imperial edict of the Great Tang Tripitaka Master Bodhiruci奉",
        "source": "T11n0310_004:0020b05_0"
    },
    {
        "source_sentence": "第二無邊莊嚴會無上陀羅尼品第一之一如是我聞：一時佛住王舍城迦蘭陀竹林，",
        "translation": "Thus have I heard. At one time the Buddha was staying at Rājagaha, in the bamboo grove of Kalandaka’s Park:",
        "source": "T11n0310_004:0020b06_0"
    },
    {
        "source_sentence": "與大比丘眾及無量無數菩薩摩訶薩俱。",
        "translation": "He was accompanied by the great assembly of monks and measureless and countless bodhisattva mahāsattvas.",
        "source": "T11n0310_004:0020b07_1"
    },
    {
        "source_sentence": "此諸菩薩皆是一生補處，從異佛剎而來集會。",
        "translation": "These bodhisattvas are all the supplementary places for one lifetime, coming from different buddha-lands to assemble.",
        "source": "T11n0310_004:0020b08_2"
    },
    {
        "source_sentence": "爾時世尊，大眾圍遶供養恭敬而為說法。",
        "translation": "At the time, the Bhagavān was surrounded by a large crowd of people who offered support and respect and taught the Dharma.",
        "source": "T11n0310_004:0020b09_3"
    },
    {
        "source_sentence": "時彼眾中有一菩薩，名無邊莊嚴，從座而起偏袒右肩，右膝著地向佛合掌，",
        "translation": "Among those bodhisattvas, there was an enlightening being named Boundless Adornment who rose from his seat, bared his right shoulder, knelt on the ground with his right knee facing the Buddha and joined his palms.",
        "source": "T11n0310_004:0020b10_4"
    },
    {
        "source_sentence": "而白佛言：「世尊！",
        "translation": "He said to the Buddha, Bhagavān!",
        "source": "T11n0310_004:0020b12_5"
    },
    {
        "source_sentence": "我有少疑今欲諮問，唯願如來哀愍聽許。」",
        "translation": "I have a few doubts, and now I want to ask questions, but may the Tathāgata have mercy on me and allow them.",
        "source": "T11n0310_004:0020b12_6"
    },
    {
        "source_sentence": "爾時佛告無邊莊嚴菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Buddha addressed the Bodhisattva Mahāsattva of Boundless Adornment, saying, Good man!",
        "source": "T11n0310_004:0020b13_7"
    },
    {
        "source_sentence": "如來、應、正等覺恣汝所問，當隨汝疑而為解說，令汝歡喜。」",
        "translation": "The Tathāgata, Arhat, and Completely Awakened One will follow your doubts and explain them for you so that you'll rejoice.",
        "source": "T11n0310_004:0020b14_8"
    },
    {
        "source_sentence": "時無邊莊嚴菩薩摩訶薩白佛言：「世尊！",
        "translation": "The Bodhisattva Mahāsattva of Boundless Adornment then said to the Buddha, Bhagavān!",
        "source": "T11n0310_004:0020b16_9"
    },
    {
        "source_sentence": "我為趣求無邊智慧被精進甲。",
        "translation": "For the sake of seeking limitless wisdom, I'm armed with the armor of effort.",
        "source": "T11n0310_004:0020b17_10"
    },
    {
        "source_sentence": "諸菩薩等求大方便善巧地者、趣無邊義智善巧者、決定大智初發起者、於菩提道已安住者，",
        "translation": "Those bodhisattvas who seek the skillfulness of great skill in means, those who aspire to the skillfulness of boundless knowledge of meaning, those who are determined for the first arousal of great knowledge, and those who have settled on the path to enlightenment.",
        "source": "T11n0310_004:0020b17_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0020b19_12"
    },
    {
        "source_sentence": "我為如是諸菩薩故請問如來，亦為利樂有情之類，心無等喻思惟諸法清淨智義甚深大智方便，",
        "translation": "For the sake of these enlightening beings I inquire of the Enlightened One, also for the benefit and welfare of sentient beings. My mind is without peerless, reflecting on the principles of purity, knowledge, meaning, profundity, great knowledge, wisdom, skillful means, and gnosis:",
        "source": "T11n0310_004:0020b20_0"
    },
    {
        "source_sentence": "簡擇得無量義善巧決定，為欲趣求大師子座、昇一切智師子之座，正初發起勇猛勤修獲不退轉，",
        "translation": "He had attained skillfulness and certainty in the investigation of infinite meanings, wishing to seat himself on the throne of the great teacher or on the lion throne of omniscience. At the very outset he aroused heroic energy and diligently cultivated nonregression.",
        "source": "T11n0310_004:0020b22_1"
    },
    {
        "source_sentence": "言詞善巧積集精進被甲冑者，為如是等諸菩薩故請問如來。",
        "translation": "Someone who speaks skillfully and accumulates effort with armor is asking the Tathāgata questions for these kinds of bodhisattvas.",
        "source": "T11n0310_004:0020b24_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0020b25_3"
    },
    {
        "source_sentence": "若有菩薩，於諸有情願欲超昇到於彼岸，復有志求無礙無畏，住無畏中方便隨機演諸法義，",
        "translation": "“If there is a bodhisattva who wishes to transcend all sentient beings and reach the other shore, yet has aspiration for unhindered fearlessness, abides in fearlessness, and skillfully expounds the meaning of all teachings according to their capacities.",
        "source": "T11n0310_004:0020b26_0"
    },
    {
        "source_sentence": "善巧分別不增不減，又於諸法本性自性如實宣揚。",
        "translation": "They skillfully discriminate, neither increasing nor decreasing, and they truly proclaim the essential essence of dharmas as their own nature.",
        "source": "T11n0310_004:0020b28_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0020b29_2"
    },
    {
        "source_sentence": "復有趣入無等喻心、最勝之心及無上心，得自在故，為如是等請問如來。",
        "translation": "Again, it's interesting to enter the mind of peerlessness, the most superior mind, and the unsurpassed mind because they attain mastery, so I'll ask the Tathāgata this kind of question.",
        "source": "T11n0310_004:0020b29_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0020c02_4"
    },
    {
        "source_sentence": "若諸有情求自然智及無師智，破無明殼超於天人，最為殊勝有希，利樂一切世間，",
        "translation": "If sentient beings seek natural knowledge and teacherless knowledge, they will destroy the shell of ignorance and surpass gods and humans. The most extraordinary and desirable [of all] is to benefit and delight in all worlds.",
        "source": "T11n0310_004:0020c02_5"
    },
    {
        "source_sentence": "當欲趣求大智無畏除自然智，欲示無邊知見善巧，將說無量決定之法，",
        "translation": "They should seek great knowledge and fearlessness, getting rid of spontaneous knowledge. They should show boundless knowledge and skill in vision, and they should teach immeasurable definitive teachings.",
        "source": "T11n0310_004:0020c04_6"
    },
    {
        "source_sentence": "欲以光照世間天人。",
        "translation": "They want to illuminate the gods and humans of the world with their light.",
        "source": "T11n0310_004:0020c05_7"
    },
    {
        "source_sentence": "復有為諸眾生樂欲，開示無上無礙大智方便，欲行究竟清淨智見，求一切智善巧地者，",
        "translation": "“Furthermore, to sentient beings attached to pleasure and craving they show the means of unexcelled great knowledge. They want to practice the ultimate vision of pure knowledge and seek the state of omniscience and skillfulness.",
        "source": "T11n0310_004:0020c06_8"
    },
    {
        "source_sentence": "我今為彼諸菩薩故欲問如來。",
        "translation": "Now, for the sake of those bodhisattvas, I want to ask the Tathāgata.",
        "source": "T11n0310_004:0020c08_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0020c08_10"
    },
    {
        "source_sentence": "若諸菩薩住是地已，速能圓滿成如來地，及能證得不可思議方便善巧波羅蜜多，",
        "translation": "“Furthermore, if enlightening beings in this stage are able to quickly perfect the state of buddhahood and realize the transcendent skill in in inconceivable means,",
        "source": "T11n0310_004:0020c09_0"
    },
    {
        "source_sentence": "以少功用成熟眾生。",
        "translation": "With little effort, he ripens sentient beings.",
        "source": "T11n0310_004:0020c10_1"
    },
    {
        "source_sentence": "現前能得如是智慧，令諸眾生捨離惡法增長善法，示菩提道諸佛種性，",
        "translation": "They manifest such knowledge, enabling sentient beings to abandon bad states and develop good states. They show the buddhas of the path of enlightenment.",
        "source": "T11n0310_004:0020c11_2"
    },
    {
        "source_sentence": "及能安立無量眾生於阿耨多羅三藐三菩提皆不退轉。",
        "translation": "They can establish measureless sentient beings who don't regress from the unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_004:0020c12_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0020c14_4"
    },
    {
        "source_sentence": "彼諸菩薩能開覺路，於佛法中令心歡喜，我為斯輩請問如來。",
        "translation": "Those bodhisattvas can open the path of enlightenment and make their minds rejoice in the Buddha's teaching, and I'll question the Tathāgata for these people.",
        "source": "T11n0310_004:0020c14_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0020c15_6"
    },
    {
        "source_sentence": "此諸大眾皆悉已集，說微妙法今正是時。",
        "translation": "These masses have all assembled, and now is the right time to teach the subtle Dharma.",
        "source": "T11n0310_004:0020c15_7"
    },
    {
        "source_sentence": "唯願如來開示演說如是法門，授諸菩薩，令得圓滿不思議願及一生補處所有善根。",
        "translation": "May the Tathāgata reveal and expound such a teaching, bestowing it on all bodhisattvas so that they may fulfill their inconceivable vows and attain the good roots of one lifetime's supplementary position.",
        "source": "T11n0310_004:0020c16_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0020c18_9"
    },
    {
        "source_sentence": "如是善巧陀羅尼門，如來隨時應當授與，使諸菩薩能持無量法門理趣善巧決定，",
        "translation": "Such are the skillful dhāraṇī teachings that the Tathāgata should bestow at any time, so that enlightening beings may be able to maintain the practice of skillful determination by means of innumerable teachings and principles.",
        "source": "T11n0310_004:0020c18_10"
    },
    {
        "source_sentence": "及以言詞演說諸義，復有志樂當證菩提，安住無邊大神通業，成熟無量無數眾生，",
        "translation": "“Furthermore, enlightening beings have aspirations that will lead to realization of enlightenment. Abiding in boundless great spiritual deeds, they develop measureless and countless sentient beings.",
        "source": "T11n0310_004:0020c20_11"
    },
    {
        "source_sentence": "攝受如來善巧之智。",
        "translation": "They take in the Tathāgata's skillful wisdom.",
        "source": "T11n0310_004:0020c22_12"
    },
    {
        "source_sentence": "惟願開示如是法門，當令眾生證菩提道。",
        "translation": "May they reveal such a teaching, which will cause sentient beings to realize the path of enlightenment.",
        "source": "T11n0310_004:0020c23_13"
    },
    {
        "source_sentence": "世尊往昔於長夜中已發弘誓，令無數眾生安住佛智及自然智。",
        "translation": "In the past, the Bhagavān had made a great vow to cause countless sentient beings to abide in buddha-wisdom and natural wisdom for a long time.",
        "source": "T11n0310_004:0020c24_14"
    },
    {
        "source_sentence": "如是陀羅尼門應當演說，令諸菩薩成自善根，及以如來威加之力，持彼無上不思議願。",
        "translation": "Such are the dhāraṇī teachings that should be explained so that bodhisattvas will attain their own good roots and maintain their unsurpassed, inconceivable vows by the authoritative power of the Tathāgata.",
        "source": "T11n0310_004:0020c25_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0020c27_16"
    },
    {
        "source_sentence": "如來、應、正等覺已證無量方便善巧，得不思議住無畏地，了諸眾生意樂差別，",
        "translation": "Having realized infinite skill in means, they attain the state of fearlessness beyond conception and perceive the differentiations of all living beings’ business activities.",
        "source": "T11n0310_004:0020c27_17"
    },
    {
        "source_sentence": "無量億劫蘊諸覺慧。",
        "translation": "Measureless millions of eons are filled with the aggregates of awakening and wisdom.",
        "source": "T11n0310_004:0020c29_18"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0020c29_19"
    },
    {
        "source_sentence": "此諸大眾瞻仰如來無時暫捨，於一切智智及諸法藏志求不怠、欲樂無厭，",
        "translation": "These great assemblies venerate the Enlightened One, never giving up for a moment. They are not lazy in their aspiration for omniscience and knowledge or for the store of all teachings; they do not indulge in self-indulgence but eagerly wish to pursue it.",
        "source": "T11n0310_004:0021a01_0"
    },
    {
        "source_sentence": "願聞如來決定之義。",
        "translation": "May I hear the Tathāgata's definitive meaning?",
        "source": "T11n0310_004:0021a02_1"
    },
    {
        "source_sentence": "世尊安住一切智境，皆已知此諸菩薩願及發趣善巧成熟。",
        "translation": "The Bhagavān abides in the sphere of omniscience, and they all know the vows of these bodhisattvas and the skillful ripening that arouses their aspirations.",
        "source": "T11n0310_004:0021a03_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0021a04_3"
    },
    {
        "source_sentence": "是諸法門陀羅尼門圓滿句義，一切諸法決定善巧，如是法門如來應說，",
        "translation": "These are the complete phrases and meanings of the teachings, the dhāraṇī aspects of the teachings, the certainty of skillfulness in all things. Such is the teaching that the Tathāgata should explain.",
        "source": "T11n0310_004:0021a04_4"
    },
    {
        "source_sentence": "令諸菩薩未成熟者悉令成熟，已成熟者速得神通及一切智心解脫智見。",
        "translation": "It causes those bodhisattvas who are not yet mature to become fully mature, and those who are mature quickly attain miraculous powers and the wisdom vision of the liberation of the mind of omniscience.",
        "source": "T11n0310_004:0021a06_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0021a08_6"
    },
    {
        "source_sentence": "若諸菩薩住不定地，是諸菩薩預聞法已，而得成就一切智境。",
        "translation": "If bodhisattvas abide in the indeterminate stage, it's because bodhisattvas who hear the teaching beforehand will attain the accomplishment of the sphere of omniscience.",
        "source": "T11n0310_004:0021a08_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0021a09_8"
    },
    {
        "source_sentence": "我以此緣敢申巨問，惟願大慈威加守護攝諸菩薩說如是法。",
        "translation": "Because of this, I dare to ask a big question, wishing that the bodhisattvas who are disciplined by great compassion and protective power will explain such a teaching.",
        "source": "T11n0310_004:0021a09_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0021a11_10"
    },
    {
        "source_sentence": "於後末世諍論起時，執著有情更相賊害，三毒增長壞亂正法，令諸菩薩於彼時中以大慈悲堪忍斯事，",
        "translation": "When disputes arise in later ages, they cling to sentient beings and attack each other with thieves, and the three poisons grow and disintegrate the right teaching, causing bodhisattvas at that time to tolerate these things with great compassion.",
        "source": "T11n0310_004:0021a11_11"
    },
    {
        "source_sentence": "流布此法而無諍論。",
        "translation": "He spreads this teaching and doesn't argue about it.",
        "source": "T11n0310_004:0021a13_12"
    },
    {
        "source_sentence": "由順無諍則能攝受大慈大悲，及當積集諸善根力。",
        "translation": "Because of following the absence of anger, they're able to gather in great kindness and compassion, and they'll accumulate the power of good roots.",
        "source": "T11n0310_004:0021a14_13"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0021a15_14"
    },
    {
        "source_sentence": "我今敢緣斯義，請問如來無礙法門決定之義。",
        "translation": "Now, I dare to ask the Tathāgata about the meaning of the unobstructed dharma-gate ascertainment based on this meaning.",
        "source": "T11n0310_004:0021a15_15"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0021a16_16"
    },
    {
        "source_sentence": "云何彼諸菩薩無量法門、法光明門及一切法方便發起？",
        "translation": "What are those bodhisattvas' measureless approaches to the teachings, their approach of illumination of the teachings, and the skillful means for initiating all dharmas?",
        "source": "T11n0310_004:0021a16_17"
    },
    {
        "source_sentence": "復願如來說不滅壞寂靜法門，兼演無邊微密法藏，具足成就念力無斷，",
        "translation": "“Furthermore, may the Enlightened One teach the doctrine of non-perishing tranquility, and also expound the boundless mysterious store of teachings, fully endowed with the power of unceasing mindfulness.",
        "source": "T11n0310_004:0021a17_18"
    },
    {
        "source_sentence": "降伏魔怨及諸異論，而不為彼之所摧伏。",
        "translation": "They subdue Māra's enemies and divergent theories, but they aren't subdued by them.",
        "source": "T11n0310_004:0021a19_19"
    },
    {
        "source_sentence": "惟願如來演說正法，令諸眾生積集善根，亦令積集無邊善巧，於一切智智示現出生，",
        "translation": "May the Buddha expound the true teaching, enabling sentient beings to accumulate roots of goodness and also enabling them to accumulate boundless skillfulness, manifesting birth in omniscience.",
        "source": "T11n0310_004:0021a20_20"
    },
    {
        "source_sentence": "隨念結集無量法要，得諸辯才清淨具足相續不亂無等句義，欲令證得無量法門及陀羅尼真實方便。",
        "translation": "They are mindful of the accumulation of measureless essentials of the Dharma, attain the purity of their eloquence, become fully endowed with continuity, unconfused, and unequalled in meaning, and want to cause them to realize the true method of attaining measureless teachings and dhāraṇīs.",
        "source": "T11n0310_004:0021a22_21"
    },
    {
        "source_sentence": "又令眾生發起意樂，為說先後兩際加行，示見去來現在諸法，於因自在、法無所住。",
        "translation": "It also causes sentient beings to give rise to the intention to explain the first and second periods of applied practices, showing that they see past and future dharmas as self-contained causes and dharmas without abiding in anything.",
        "source": "T11n0310_004:0021a24_22"
    },
    {
        "source_sentence": "願諸菩薩了知十方如來本事，以神通無畏遍諸佛剎，授彼眾生清淨法眼，",
        "translation": "“May all enlightening beings, knowing the past deeds of buddhas of the ten directions, pervade all buddha-lands by spiritual power and fearlessness, bestowing on sentient beings the pure eye of truth.",
        "source": "T11n0310_004:0021a26_23"
    },
    {
        "source_sentence": "亦為開示不思議法，成熟佛智方便善巧。",
        "translation": "It's also to reveal inconceivable dharmas and ripen the skillful means of the Buddha's wisdom.",
        "source": "T11n0310_004:0021a28_24"
    },
    {
        "source_sentence": "我緣斯義敢有所請。",
        "translation": "Because of this meaning, I dare to ask for something.",
        "source": "T11n0310_004:0021a29_25"
    },
    {
        "source_sentence": "惟願世尊說如來地廣大方便甚深之法，為一切智，攝諸善巧無量不思議法理趣，",
        "translation": "“World-honored One, may the Buddha expound the vast and profound teaching of skill in means at the stage of enlightenment, which consists of all kinds of knowledge.",
        "source": "T11n0310_004:0021a29_26"
    },
    {
        "source_sentence": "令彼菩薩願及方便善巧圓滿。",
        "translation": "It causes the bodhisattva's vows and skillful means to be fulfilled.",
        "source": "T11n0310_004:0021b02_27"
    },
    {
        "source_sentence": "此諸菩薩預聞法已，悉皆獲證大法光明，成就菩提殊勝善巧，及彼弘誓悉令圓滿。」",
        "translation": "These bodhisattvas who had heard the teaching before all attained the light of the great teaching, accomplished the extraordinary skillfulness of enlightenment, and fulfilled their vast vows.",
        "source": "T11n0310_004:0021b03_28"
    },
    {
        "source_sentence": "爾時佛告無邊莊嚴菩薩摩訶薩言：「善哉善哉！",
        "translation": "It was then that the Buddha addressed the Bodhisattva Mahāsattva of Boundless Adornment, saying, Good, good!",
        "source": "T11n0310_004:0021b06_0"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0021b07_1"
    },
    {
        "source_sentence": "汝今為諸菩薩住清淨願方便善巧，亦為哀愍諸眾生故，以決定慧善問如來，",
        "translation": "\\",
        "source": "T11n0310_004:0021b07_2"
    },
    {
        "source_sentence": "汝之功德無有限量。",
        "translation": "Your merit has no limit.",
        "source": "T11n0310_004:0021b09_3"
    },
    {
        "source_sentence": "諦聽諦聽，如實思惟，我今為汝分別解說，令諸菩薩於佛智境出生無量種種功德。」",
        "translation": "Listen closely, listen closely, and truly contemplate. Now, I'll explain it for you in a discriminating way to cause bodhisattvas to produce measureless various merits in the Buddha's wisdom realm.",
        "source": "T11n0310_004:0021b09_4"
    },
    {
        "source_sentence": "無邊莊嚴菩薩言：「唯然世尊！",
        "translation": "Bodhisattva Aboundless Adornment said, Yes, Bhagavān!",
        "source": "T11n0310_004:0021b11_5"
    },
    {
        "source_sentence": "我等樂聞。」",
        "translation": "We're happy to hear it.",
        "source": "T11n0310_004:0021b12_0"
    },
    {
        "source_sentence": "爾時佛告無邊莊嚴：「若諸菩薩為求無邊善巧願者，應知諸佛祕密語言，",
        "translation": "It was then that the Buddha addressed Boundless Adornment, If bodhisattvas seek limitless skillful vows, they should know the secret words of the buddhas:",
        "source": "T11n0310_004:0021b12_1"
    },
    {
        "source_sentence": "受持思惟如理觀察。",
        "translation": "He receives, retains, contemplates, and observes them according to principle.",
        "source": "T11n0310_004:0021b13_2"
    },
    {
        "source_sentence": "云何觀察？",
        "translation": "What's observing?",
        "source": "T11n0310_004:0021b14_3"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0021b14_4"
    },
    {
        "source_sentence": "如來之智攝諸善巧，有所宣說無不清淨，是諸菩薩應當進修此之法要。",
        "translation": "The Tathāgata's knowledge embraces skillful means, and whatever he teaches is not unclean; these are the essentials of the teaching that bodhisattvas should cultivate.",
        "source": "T11n0310_004:0021b14_5"
    },
    {
        "source_sentence": "諸佛所說皆是平等，安住大悲普於群生，決定成熟諸有情類。",
        "translation": "All the teachings of the buddhas are equal, abiding in great compassion for all sentient beings and determined to ripen all sentient beings.",
        "source": "T11n0310_004:0021b16_6"
    },
    {
        "source_sentence": "或於下乘志希解脫，於聲聞道有於真實最勝涅槃，弘誓圓滿成一切智。",
        "translation": "Or they may wish for liberation in the lower vehicle, have truly the most excellent nirvāṇa in the śrāvaka path, and make a great vow to perfect omniscience.",
        "source": "T11n0310_004:0021b17_7"
    },
    {
        "source_sentence": "我今安住無上解脫，遠離餘乘下劣之法，善入諸佛祕密語言，及說如來無比詞句廣大清淨攝受諸法，",
        "translation": "I now abide in unexcelled liberation, far removed from the inferior teachings of other vehicles. I am able to enter the secret words of buddhas and expound the incomparable expressions of enlightenment.",
        "source": "T11n0310_004:0021b19_8"
    },
    {
        "source_sentence": "令諸有情隨彼根性解脫成熟。",
        "translation": "It causes sentient beings to follow their faculties, natures, liberation, and maturation.",
        "source": "T11n0310_004:0021b21_9"
    },
    {
        "source_sentence": "然於是法皆悉平等，不增不減無缺無漏，乃至無色及無等色，無邊無際自性清淨。",
        "translation": "However, these things are all equal, neither increasing nor decreasing, without gaps or contaminants, up to formlessness and formlessness, which are boundless and limitless in their own-nature purity.",
        "source": "T11n0310_004:0021b22_10"
    },
    {
        "source_sentence": "諸佛世尊之所演說，自性本性如實了知，而無有法了不了者。",
        "translation": "The buddhas and world-honored ones teach that the original nature of self-nature is truly known, but there's no dharma that isn't comprehended.",
        "source": "T11n0310_004:0021b24_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_004:0021b25_12"
    },
    {
        "source_sentence": "一切諸法皆是如來假名說故。",
        "translation": "All dharmas are all nominally explained by the Tathāgata.",
        "source": "T11n0310_004:0021b26_13"
    },
    {
        "source_sentence": "若彼諸法由假名者，是則不可以法施設亦無示現。",
        "translation": "If those things are nominally named because of their names, then they can't be defined as dharmas or shown.",
        "source": "T11n0310_004:0021b26_14"
    },
    {
        "source_sentence": "無示現故，如來所說皆真勝義，隨法同入一切諸法，於一切法不住分別亦非不住。",
        "translation": "Because it's unmanifest, what the Tathāgata teaches is truly superior, entering all dharmas together according to their teachings and not discriminating or abiding in all dharmas.",
        "source": "T11n0310_004:0021b27_15"
    },
    {
        "source_sentence": "以分別法及無分別，如實平等證一切法無有差別。",
        "translation": "With discriminating dharmas and nondiscriminating, they truly and equally realize that all dharmas are without distinctions.",
        "source": "T11n0310_004:0021b29_16"
    },
    {
        "source_sentence": "法無有生，如是生法無所有故；",
        "translation": "There is no arising of dharmas, because the arising of dharmas in this way has no existence.",
        "source": "T11n0310_004:0021c01_17"
    },
    {
        "source_sentence": "法無有法，生妄分別遍計度故；",
        "translation": "Conditioned things have no dharmas, because they give rise to deluded discrimination and pervasive imagination.",
        "source": "T11n0310_004:0021c02_18"
    },
    {
        "source_sentence": "法無有起，不自在故；",
        "translation": "There is no arising of dharmas, because they do not arise independently.",
        "source": "T11n0310_004:0021c03_19"
    },
    {
        "source_sentence": "法無觀待，捨圓滿故；",
        "translation": "Conditions of existence have no expectation, because they are abandoned and fulfilled.",
        "source": "T11n0310_004:0021c03_20"
    },
    {
        "source_sentence": "法無作用，無去來故；",
        "translation": "Conditioned things have no function, because there is no going or coming.",
        "source": "T11n0310_004:0021c04_21"
    },
    {
        "source_sentence": "法無自性，超過一切自性法故；",
        "translation": "A factor has no self-nature, because it surpasses all the factors of its own nature.",
        "source": "T11n0310_004:0021c04_22"
    },
    {
        "source_sentence": "法本平等無有差別，無戲論故。",
        "translation": "The fundamental equality of dharmas has no distinctions, because there's no conceptual elaboration.",
        "source": "T11n0310_004:0021c05_23"
    },
    {
        "source_sentence": "隨所作法起殊勝願無不成就，而於其中無有作者，乃至無有少法所得，",
        "translation": "They give rise to extraordinary vows according to the things they do, never failing to fulfill them; yet there is no author of those vows, not even a small part of their endowment.",
        "source": "T11n0310_004:0021c06_24"
    },
    {
        "source_sentence": "皆歸於空。",
        "translation": "They all return to emptiness.",
        "source": "T11n0310_004:0021c07_25"
    },
    {
        "source_sentence": "是故如來說一切法如幻如夢、無有高下。",
        "translation": "Therefore, the Tathāgata teaches that all dharmas are illusory like dreams and have no height or lowness.",
        "source": "T11n0310_004:0021c08_0"
    },
    {
        "source_sentence": "我當以此清淨弘誓攝眾生時，實無少法而可著者。",
        "translation": "When I take this pure and vast vow to gather sentient beings, there really isn't a little thing to attach to.",
        "source": "T11n0310_004:0021c08_1"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0021c10_2"
    },
    {
        "source_sentence": "此是諸菩薩等法光明門。",
        "translation": "This is the gate of the bodhisattvas' illumination of the Dharma and so forth.",
        "source": "T11n0310_004:0021c10_3"
    },
    {
        "source_sentence": "由斯門故，於殊勝願而得增長，如日出現光明普照。",
        "translation": "Because of this approach, they'll attain growth in their superior vows, like the sun shining brightly and illuminating everywhere.",
        "source": "T11n0310_004:0021c10_4"
    },
    {
        "source_sentence": "如是善男子等於此法門能信解者，與諸眾生作法光明。",
        "translation": "Thus, good sons and so forth, those who can believe in this teaching and understand it will create the Dharma light for sentient beings.",
        "source": "T11n0310_004:0021c12_5"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0021c13_6"
    },
    {
        "source_sentence": "若諸菩薩內正思惟、外無散亂，安住能斷諸障礙者，隨念菩薩普光三昧，",
        "translation": "“Furthermore, if enlightening beings are correctly reflecting within and not distracted outward, abide calmly and peacefully, able to eliminate all obstacles, then remember the concentration of enlightening being Universal Light:",
        "source": "T11n0310_004:0021c13_7"
    },
    {
        "source_sentence": "及能信解甚深法者，應當觀察此諸法門。",
        "translation": "And those who can believe and understand the profound teaching should examine these teachings.",
        "source": "T11n0310_004:0021c15_8"
    },
    {
        "source_sentence": "一切諸法如來悉知，以緣起門開示宣說。",
        "translation": "The Tathāgata fully knows all dharmas and explains them in terms of the aspect of dependent arising.",
        "source": "T11n0310_004:0021c16_9"
    },
    {
        "source_sentence": "如是緣起虛妄不實，自性本性皆悉空寂，是緣起性亦非真實。",
        "translation": "Thus, the nature of conditioned arising is false and insubstantial, and the original nature of self-nature is completely empty and quiescent, which is the nature of conditioned arising that's not real.",
        "source": "T11n0310_004:0021c17_10"
    },
    {
        "source_sentence": "能令眾生雜染清淨，於十方求皆不可得，無所得故無有攝受，無攝受故於我所說尚應捨離何況非法。",
        "translation": "It can cause sentient beings to be defiled and purified, and all the things they seek in the ten directions are unobtainable; because there's nothing to attain, there's no taking in, so what I teach should still be abandoned, let alone unlawful.",
        "source": "T11n0310_004:0021c18_11"
    },
    {
        "source_sentence": "所言捨離，彼亦非有，亦無所取、無有功用，本性清淨。",
        "translation": "What's said to be abandoned is also not existent, has nothing to grasp, has no exertion, and is inherently pure.",
        "source": "T11n0310_004:0021c20_12"
    },
    {
        "source_sentence": "一切諸法無有分別，了知分別如實性故。",
        "translation": "All dharmas have no discrimination, because they perceive discrimination as it really is.",
        "source": "T11n0310_004:0021c22_13"
    },
    {
        "source_sentence": "一切諸法無有所住亦不可見，無異性故。",
        "translation": "All dharmas are neither abiding nor invisible because they have no different natures.",
        "source": "T11n0310_004:0021c23_0"
    },
    {
        "source_sentence": "是故諸法無住無依，但以名字施設而有，彼皆空寂無有自性、無住而住。",
        "translation": "Therefore, all dharmas have no abiding and no basis but exist by designating them by names, and they all abide in emptiness and quiescence with no self-nature and no abiding.",
        "source": "T11n0310_004:0021c23_1"
    },
    {
        "source_sentence": "是故諸法無有住處，處無有故、盡故、滅故及變易故，如來但以異名宣說。",
        "translation": "Therefore, all dharmas have no abiding place, and because there are no locations, ends, ceases, and transformations, the Tathāgata simply explains them by different names.",
        "source": "T11n0310_004:0021c25_2"
    },
    {
        "source_sentence": "如是密意應當了知，不應執著善與不善。",
        "translation": "Such a mysterious intention should be understood, and you shouldn't cling to what's good or bad.",
        "source": "T11n0310_004:0021c27_3"
    },
    {
        "source_sentence": "若執善法，彼不善法亦當執著。",
        "translation": "If someone clings to good qualities, they'll also cling to unwholesome qualities.",
        "source": "T11n0310_004:0021c28_4"
    },
    {
        "source_sentence": "由執如是不善法故，生諸苦惱，佛以異名於此示說為苦聖諦。",
        "translation": "Because they cling to such unwholesome dharmas, suffering and distress arise, and the Buddha uses different names to show that this is the noble truth of suffering.",
        "source": "T11n0310_004:0021c28_5"
    },
    {
        "source_sentence": "由不執著善不善故，彼諸愛滅，如來於此善法所斷，異名示說為集聖諦。",
        "translation": "Because they don't cling to what's good and unwholesome, their cravings cease, and the Tathāgata stops them with these good qualities, which are differently named and shown as the noble truth of accumulation.",
        "source": "T11n0310_004:0022a01_6"
    },
    {
        "source_sentence": "第二聖諦能了知故，滅故、盡故、無憶想故，厭離觀察無所有故，無喜想受無分別故，",
        "translation": "Because the second noble truth is able to know, because of cessation, because of extinction, because of nonconception, because of being disgusted with it and observing it as nonexistent, because there is no joy, perception, feeling, or discrimination.",
        "source": "T11n0310_004:0022a03_0"
    },
    {
        "source_sentence": "如來於此異名言說為苦滅諦。",
        "translation": "The Tathāgata explains this differently as the truth of suffering's cessation in terms of names.",
        "source": "T11n0310_004:0022a04_1"
    },
    {
        "source_sentence": "了知第三滅聖諦故，是所求道如實悟入一切法地，超過一切憶想分別戲論之境，",
        "translation": "Knowing the third noble truth of cessation, they truly awaken to the path they seek and enter the state of all things, transcending all conceptions, discriminations, conceptualizations, and elaborations.",
        "source": "T11n0310_004:0022a05_2"
    },
    {
        "source_sentence": "八支相應修習正見乃至正定，苦滅趣道聖諦了知，佛以異名於此宣說為第四諦。",
        "translation": "The noble truth of cultivating right view up to right concentration associated with the eight limbs and knowing suffering, cessation, destinies, and paths is declared by the Buddha as the fourth truth by different names here.",
        "source": "T11n0310_004:0022a07_3"
    },
    {
        "source_sentence": "諸佛世尊於此施設，知苦、斷集、證滅、修道；",
        "translation": "The buddhas and world-honored ones define these as suffering, annihilation, arising, realization, cessation, and cultivation.",
        "source": "T11n0310_004:0022a09_4"
    },
    {
        "source_sentence": "苦、集、苦滅及滅趣道。",
        "translation": "Suffering, arising, cessation of suffering and the path leading to cessation.",
        "source": "T11n0310_004:0022a10_5"
    },
    {
        "source_sentence": "此苦無有，以世俗故假名施設。",
        "translation": "There is no such thing as suffering. Because it is worldly, it is called a provisional designation.",
        "source": "T11n0310_004:0022a10_6"
    },
    {
        "source_sentence": "是無明等，一切皆是無智攀緣。",
        "translation": "These are ignorance and so forth, all of which are the clinging condition of nescience.",
        "source": "T11n0310_004:0022a11_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_004:0022a12_8"
    },
    {
        "source_sentence": "於彼無智亦無有少攀緣可取，無有所證、無有光明，不可了知亦不可得，",
        "translation": "They lack knowledge, and there are no few objects to be grasped, no realization, no light, which can’t be known or obtained.",
        "source": "T11n0310_004:0022a12_9"
    },
    {
        "source_sentence": "而於其中當有何物？",
        "translation": "What's there to be in it?",
        "source": "T11n0310_004:0022a14_10"
    },
    {
        "source_sentence": "一切皆是虛妄壞法，無有堅實。",
        "translation": "All of them are illusory and destructive dharmas that lack stability.",
        "source": "T11n0310_004:0022a14_11"
    },
    {
        "source_sentence": "於中若以實物施設，彼即於常應有執著。",
        "translation": "If they were to define it in terms of real things, they would have an attachment to permanence.",
        "source": "T11n0310_004:0022a15_12"
    },
    {
        "source_sentence": "若以無分別執著，彼即於斷應有執著。",
        "translation": "If someone were to cling to nondiscriminating attachment, they would have attachment to cessation.",
        "source": "T11n0310_004:0022a16_13"
    },
    {
        "source_sentence": "是故於苦不應分別，以智慧故應當了知，無智自性即苦自性，由與無明共相應故，",
        "translation": "The self-nature of noncognisance is the self-nature of unsatisfactoriness, because it is associated with ignorance.",
        "source": "T11n0310_004:0022a17_14"
    },
    {
        "source_sentence": "無明亦不與物相應或不相應，彼亦無有。",
        "translation": "Neither is ignorance associated with things nor not associated with things: neither is ignorance associated with things.",
        "source": "T11n0310_004:0022a18_15"
    },
    {
        "source_sentence": "由彼不相應故，是故無明非分別非不分別，不作不壞亦無作者。",
        "translation": "Because they are not conjoined, that is why ignorance is neither discriminating nor nondiscriminating. It does not act or break down, and it has no author.",
        "source": "T11n0310_004:0022a19_16"
    },
    {
        "source_sentence": "施設作者不可得故，無邊莊嚴！",
        "translation": "Because the author of the designation is unobtainable, it's limitlessly adorned!",
        "source": "T11n0310_004:0022a21_17"
    },
    {
        "source_sentence": "此是諸菩薩了知悟入無明自性順明法門。",
        "translation": "These are the bodhisattvas who understand and awaken to the self-nature of nescience and follow the teachings of insight.",
        "source": "T11n0310_004:0022a22_18"
    },
    {
        "source_sentence": "由是門故，能捨一切無明黑闇，現前證得隨順明法，於菩提分能善修習，",
        "translation": "Because of this door they are able to abandon all the darkness of ignorance and realize in their presence the teachings of knowledge, and skillfully practice the aids to enlightenment.",
        "source": "T11n0310_004:0022a23_19"
    },
    {
        "source_sentence": "於諸聖諦能善了知。",
        "translation": "They can well understand the noble truths.",
        "source": "T11n0310_004:0022a24_20"
    },
    {
        "source_sentence": "是諸菩薩於此法門能得清淨，所謂由不生故苦得清淨，不攀緣故集得清淨，",
        "translation": "These bodhisattvas can attain purity in this aspect of the teaching, which is to say that suffering attains purity because it doesn't arise and accumulation attains purity because it doesn't cling to conditions.",
        "source": "T11n0310_004:0022a25_21"
    },
    {
        "source_sentence": "由滅盡故滅得清淨，由修習故道得清淨，信平等故道即平等。",
        "translation": "Because of cessation, cessation acquires purity; because of cultivation, the path acquires purity; because of equality of faith, the path is equality.",
        "source": "T11n0310_004:0022a26_22"
    },
    {
        "source_sentence": "如是諸法異名差別，應當解了。",
        "translation": "Thus, the different names of these dharmas should be understood.",
        "source": "T11n0310_004:0022a28_23"
    },
    {
        "source_sentence": "了已應斷應證應修。",
        "translation": "After they've understood it, they should be eliminated, realized, and cultivated.",
        "source": "T11n0310_004:0022a29_24"
    },
    {
        "source_sentence": "於如來言若能解了，彼即遍知、彼即隨斷、彼即作證、彼即修習。",
        "translation": "If the Tathāgata says he can understand, that's pervasive knowing, that's subsequently eliminated, that's realized, and that's cultivated.",
        "source": "T11n0310_004:0022a29_25"
    },
    {
        "source_sentence": "是故聖者如是知已，於一切法不取不捨，便得安住四諦法門。",
        "translation": "Therefore, once the noble person thus knows it, he doesn't grasp or abandon all dharmas, and then he attains the Dharma teaching of the four truths.",
        "source": "T11n0310_004:0022b01_26"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0022b03_27"
    },
    {
        "source_sentence": "一切諸法無有分別，亦不增長亦不積集。",
        "translation": "All dharmas have no discrimination, and they don't grow or accumulate.",
        "source": "T11n0310_004:0022b03_28"
    },
    {
        "source_sentence": "聖者如實善了知故，不起分別、不行戲論，能如實見不毀不著。",
        "translation": "Because the noble person accurately and well understands, he doesn't discriminate or engage in conceptual elaborations, and he can accurately see without disparaging or clinging.",
        "source": "T11n0310_004:0022b04_29"
    },
    {
        "source_sentence": "由道斷故，於諸善法不起分別亦無戲論，況不善法。",
        "translation": "Because of their abandonment through the path, they don't discriminate among good qualities and don't engage in conceptual elaborations, much less bad qualities.",
        "source": "T11n0310_004:0022b05_30"
    },
    {
        "source_sentence": "由無分別共相應故，亦復不住法非法斷。",
        "translation": "Because they are nondiscriminating and co-associated, they also don't abide in the unlawful elimination of dharmas.",
        "source": "T11n0310_004:0022b07_31"
    },
    {
        "source_sentence": "若遍知斷，即無法結及非法結。",
        "translation": "If pervasive knowing is stopped, that's the bond of nonexistence and the bond of non-dharma.",
        "source": "T11n0310_004:0022b08_0"
    },
    {
        "source_sentence": "彼能了知結法虛妄，此虛妄法空無所有，此是彼等所入諦門。",
        "translation": "They can understand that the fetters are false and that these false dharmas are empty and lack existence, and this is the gate of truth that they enter.",
        "source": "T11n0310_004:0022b08_1"
    },
    {
        "source_sentence": "由是門故不愛不恚，證捨圓滿能斷諸結，安住正道到於彼岸，證法自性而無入出。",
        "translation": "Because of this approach, he doesn't crave or resent it, realizes the perfection of equanimity that breaks the bonds, abides in the right path to reach the other side, realizes the self-nature of dharmas without entry or exit.",
        "source": "T11n0310_004:0022b10_2"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0022b12_0"
    },
    {
        "source_sentence": "汝今當觀一切諸法本性皆空、自性寂靜、無有作者，諸法非實與結相應、非不相應。",
        "translation": "Now, you must observe that the original nature of all dharmas is empty, tranquil in its own nature, and without an author, and that dharmas aren't really associated with fetters or non-associated with fetters.",
        "source": "T11n0310_004:0022b12_1"
    },
    {
        "source_sentence": "於彼無性法中不應執著，亦復不應離性非性而起分別。",
        "translation": "They shouldn't cling to those natureless dharmas, and they shouldn't discriminate them apart from their nature or non-nature.",
        "source": "T11n0310_004:0022b14_2"
    },
    {
        "source_sentence": "既能了知因緣清淨，不應戲論。",
        "translation": "Since they can understand the purity of causes and conditions, they shouldn't discuss them in detail.",
        "source": "T11n0310_004:0022b15_3"
    },
    {
        "source_sentence": "諸有一切因緣生法，彼緣性空究竟清淨，如是因緣非互相應。",
        "translation": "All dharmas that arise from all causes and conditions are ultimately pure in terms of their conditioned nature as emptiness, such causes and conditions aren't mutually exclusive.",
        "source": "T11n0310_004:0022b16_4"
    },
    {
        "source_sentence": "諸法展轉無有所作、無有所行、無有事業，如是思惟一切諸法互相空故，",
        "translation": "Because all things are mutually exclusive, without doing anything, without action, and without undertaking anything: because they contemplate all things in this way.",
        "source": "T11n0310_004:0022b17_5"
    },
    {
        "source_sentence": "無有自性、無依無住。",
        "translation": "There's no self-nature, no basis, and no abiding.",
        "source": "T11n0310_004:0022b19_6"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0022b19_7"
    },
    {
        "source_sentence": "汝於此中應當悟入，則能增長不可損壞普遍光明清淨法門。",
        "translation": "You should awaken to and enter this, so you can grow the pure dharma-gate of unbreakable universal light.",
        "source": "T11n0310_004:0022b19_8"
    },
    {
        "source_sentence": "由攝受故當得清淨，無戲論故當作光明超過結使，無所著故當得出離。",
        "translation": "Because they are collected, they'll attain purity, and because they lack conceptual elaborations, they'll become radiant and beyond the bonds, and because they have no attachment, they'll be liberated.",
        "source": "T11n0310_004:0022b21_9"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0022b22_10"
    },
    {
        "source_sentence": "一切諸法唯有名相開示宣說。",
        "translation": "All dharmas are only names and characteristics that reveal and proclaim them.",
        "source": "T11n0310_004:0022b23_11"
    },
    {
        "source_sentence": "何謂名相？",
        "translation": "What's called name and form?",
        "source": "T11n0310_004:0022b23_12"
    },
    {
        "source_sentence": "相謂四大所造諸色，名謂一切非色之蘊。",
        "translation": "Characteristics are the forms created by the four elements. The name refers to all nonform aggregates.",
        "source": "T11n0310_004:0022b24_13"
    },
    {
        "source_sentence": "如是名相，一切皆悉虛妄不實，以顛倒故而有執著，或色是我、色是我所，",
        "translation": "Such names and marks are all false and unreal, and because of their mistakenness they have attachments. Some form is the self, while form is mine.",
        "source": "T11n0310_004:0022b25_14"
    },
    {
        "source_sentence": "相分別故有名示說。",
        "translation": "Because the characteristics are discriminated, there's a teaching and an explanation.",
        "source": "T11n0310_004:0022b26_15"
    },
    {
        "source_sentence": "如是名色二俱不實，一切皆是虛妄壞法、如幻如夢。",
        "translation": "Thus, these two kinds of name-and-form are both insubstantial, and they are all false and destructive dharmas, illusory and like dreams.",
        "source": "T11n0310_004:0022b27_16"
    },
    {
        "source_sentence": "色體不堅如夢所見，乃至四蘊亦非真實，但以世俗文字施設。",
        "translation": "The essence of form is not as firm as what's seen in a dream, and even the four aggregates aren't real, but are defined by worldly words.",
        "source": "T11n0310_004:0022b28_17"
    },
    {
        "source_sentence": "如是知時不見有苦，由實諦故無有攀緣，無攀緣故心無所有，無所有故何有與彼攀緣相應？",
        "translation": "When they know this, they don't see suffering, and it's because of the true truth that there are no perceptual objects; because there are no perceptual objects, the mind has no perceptual objects, so how could it be associated with those perceptual objects?",
        "source": "T11n0310_004:0022b29_18"
    },
    {
        "source_sentence": "由此而能於涅槃界得超過想及所知滅。",
        "translation": "As a result, he's able to attain the cessation of transcendent conceptions and cognition in the realm of nirvāṇa.",
        "source": "T11n0310_004:0022c02_19"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0022c03_20"
    },
    {
        "source_sentence": "三界由想、作意所生，是故說言三界虛妄，想及作意亦非真實。",
        "translation": "Because the three realms are produced by conceptual identification and thought. That is why it is said to be called ‘false’”*! in relation to the three realms. Also, conceptual identification and thought are no reality.",
        "source": "T11n0310_004:0022c04_21"
    },
    {
        "source_sentence": "彼所有想即色執著，所有作意皆與受想行識相應。",
        "translation": "All those conceptions that exist are form attachment, and all the contemplations that exist are associated with feeling, perception, volition, and consciousness.",
        "source": "T11n0310_004:0022c05_22"
    },
    {
        "source_sentence": "諸法本性亦無相應非不相應，乃至非想亦非作意，想及作意本性皆空。",
        "translation": "The original natures of dharmas are also neither associated nor disjoined, up to the point where they aren't perceived or contemplated, and the original natures of perception and contemplation are all empty.",
        "source": "T11n0310_004:0022c06_23"
    },
    {
        "source_sentence": "所有言說亦皆虛妄，但假施設令性寂靜。",
        "translation": "All the verbal expressions are also false, but they are nominally defined so that their nature is quiescent.",
        "source": "T11n0310_004:0022c08_24"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0022c09_25"
    },
    {
        "source_sentence": "諸法本性以假名故，如是所說亦皆平等。",
        "translation": "Because the original nature of all dharmas is based on nominal names, what's explained like this is also equal.",
        "source": "T11n0310_004:0022c09_26"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0022c10_27"
    },
    {
        "source_sentence": "於此法中證於實諦，諸菩薩等應當了知，謂諸如來一切結使皆捨離故，",
        "translation": "To realize the true truth in this teaching, enlightening beings should understand: that is, because all the bonds and tendencies of buddhas are abandoned.",
        "source": "T11n0310_004:0022c10_28"
    },
    {
        "source_sentence": "凡所演說終不唐捐。",
        "translation": "Whatever he teaches, he never neglects it.",
        "source": "T11n0310_004:0022c12_29"
    },
    {
        "source_sentence": "汝等於此應善思惟無令執著，於一切法勿生分別，離諸戲論，了一切法無有自性，",
        "translation": "You should think carefully about this and not cling to it. Don’t discriminate among all things, be free of conceptual elaborations, and understand that all things have no essence.",
        "source": "T11n0310_004:0022c12_30"
    },
    {
        "source_sentence": "而於眾生起慈悲想，思惟悟入如是法門，為利一切開示演說。",
        "translation": "They give rise to thoughts of kindness and pity for sentient beings, contemplate and awaken to such a teaching, and explain it for the benefit of all.",
        "source": "T11n0310_004:0022c14_31"
    },
    {
        "source_sentence": "云何法門？",
        "translation": "What is the dharma-gate?",
        "source": "T11n0310_004:0022c16_32"
    },
    {
        "source_sentence": "謂了無明諸有為法、悟智見等諸無為法，應遍清淨證入一切有為無為，",
        "translation": "It means that if one understands the unconditioned things of nescience, conditioned things, enlightenment, knowledge, vision, and so forth, one should thoroughly purify and realize entry into all conditioned and unconditioned things.",
        "source": "T11n0310_004:0022c16_33"
    },
    {
        "source_sentence": "無戲論智，非數入數、非數住數。",
        "translation": "There's no discursive cognition that doesn't count the number of entry and doesn't count the number of abodes.",
        "source": "T11n0310_004:0022c18_0"
    },
    {
        "source_sentence": "隨順如是非數法故，證入無為清淨法門，獲得遍持光明智慧，攝受諸法令不失壞，",
        "translation": "Because they follow the teachings of right and wrong, they realize the pure dharma-gate of unconditioned dharmas, attain pervasive illumination and wisdom, and embrace all teachings without loss or destruction.",
        "source": "T11n0310_004:0022c18_1"
    },
    {
        "source_sentence": "能以覺慧方便善巧，廣為眾生演說諸法。",
        "translation": "He was able to extensively expound the teachings for sentient beings using the skillful means of enlightenment and wisdom.",
        "source": "T11n0310_004:0022c20_2"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0022c21_3"
    },
    {
        "source_sentence": "此是諸菩薩等入陀羅尼門。",
        "translation": "This is the dhāraṇī entry for bodhisattvas and so forth.",
        "source": "T11n0310_004:0022c21_4"
    },
    {
        "source_sentence": "由是門故，出生廣大差別覺慧，及能發起演諸法義善巧之智。",
        "translation": "Because of this approach, vast discriminating awakening wisdom and the skillful knowledge that can give rise to explanations of the meaning of the teachings are produced.",
        "source": "T11n0310_004:0022c22_5"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0022c23_6"
    },
    {
        "source_sentence": "此中何者是彼陀羅尼門？",
        "translation": "Which of these is the dhāraṇī teaching?",
        "source": "T11n0310_004:0022c24_7"
    },
    {
        "source_sentence": "由是菩薩於諸法中能得總持方便善巧。",
        "translation": "Because of this, the bodhisattva can attain the skillfulness of the method of summarizing and maintaining dharmas.",
        "source": "T11n0310_004:0022c24_8"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0022c25_9"
    },
    {
        "source_sentence": "此中菩薩住遍清淨善巧之智行於辯才，由義覺慧觀察諸法本性自性。",
        "translation": "Here, the bodhisattva abides in the wisdom of pervasively pure skillfulness and conducts himself with eloquence, observing the self-nature of the essence of dharmas by means of meaning, awakening, and wisdom.",
        "source": "T11n0310_004:0022c25_10"
    },
    {
        "source_sentence": "然一切法自性無住，無名無相無所建立，無邊建立不可宣示，但以世俗言詞演說。",
        "translation": "However, the self-nature of all dharmas has no abiding, no names, no marks, and nothing to establish. Their establishment has no limit and cannot be proclaimed; it can only be explained in worldly terms.",
        "source": "T11n0310_004:0022c27_11"
    },
    {
        "source_sentence": "所有諸法本性自性皆不可說，無來無去無有文字，文字清淨無有功用。",
        "translation": "All the essential natures and self-natures of all dharmas can't be explained, have no coming or going, have no words, are pure in words, and have no function.",
        "source": "T11n0310_004:0022c29_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_004:0023a02_13"
    },
    {
        "source_sentence": "諸法本性等虛空故。",
        "translation": "It's because the original nature of dharmas is equal to space.",
        "source": "T11n0310_004:0023a02_14"
    },
    {
        "source_sentence": "一切諸法亦復如是，無作無起無相清淨，以虛空開示演說，此則諸法無門之門。",
        "translation": "All dharmas are likewise, unconstructed, unarisen, markless, pure, and explained in space, which is the gate of all dharmas without a gate.",
        "source": "T11n0310_004:0023a02_15"
    },
    {
        "source_sentence": "門清淨故，究竟無染亦不隨染。",
        "translation": "Because the gate is pure, it's ultimately undefiled and doesn't follow defilement.",
        "source": "T11n0310_004:0023a04_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_004:0023a05_17"
    },
    {
        "source_sentence": "諸法究竟不生不起，所有自性亦不生起。",
        "translation": "All dharmas ultimately don't arise and don't arise, and the self-nature that exists doesn't arise either.",
        "source": "T11n0310_004:0023a05_18"
    },
    {
        "source_sentence": "是故當知，三世所說一切諸法自性無性，亦不應執諸法無性，此是諸菩薩無所執著陀羅尼門。",
        "translation": "Therefore, you should know that all the self-natures of all dharmas taught in the three times are without essence, and you shouldn't cling to the absence of essence of dharmas. This is the dhāraṇī approach where bodhisattvas don't cling to anything.",
        "source": "T11n0310_004:0023a06_19"
    },
    {
        "source_sentence": "為諸菩薩門清淨故，如是開示說一切法。",
        "translation": "Because the bodhisattva's approach is pure, he thus reveals and explains all dharmas.",
        "source": "T11n0310_004:0023a08_20"
    },
    {
        "source_sentence": "有形相者，所說形相即非形相，不作不壞不愛不恚。",
        "translation": "Someone with form and characteristics means that what's described as form is not form and characteristics, which are unmanifest, indestructible, unattractive, and neither liked nor disliked.",
        "source": "T11n0310_004:0023a09_21"
    },
    {
        "source_sentence": "是故當知，形相門者則為非門。",
        "translation": "Therefore, you should know that the approach of form and characteristics is what's not the approach.",
        "source": "T11n0310_004:0023a10_22"
    },
    {
        "source_sentence": "門清淨故，由是能得入無形相清淨法門。",
        "translation": "Because the gate is pure, they can thus enter the pure formless dharma-gate.",
        "source": "T11n0310_004:0023a11_23"
    },
    {
        "source_sentence": "為欲了知此形相門無所有故，不以有義如是宣說，無所作故入無形相。",
        "translation": "Because they want to understand that this aspect of form has no existence, they don't explain it in this way with meaning, and because there's nothing to do, they enter formlessness.",
        "source": "T11n0310_004:0023a12_24"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0023a14_0"
    },
    {
        "source_sentence": "如是所說無形相門，為陀羅尼清淨故轉。",
        "translation": "Thus, the approach of formlessness that's explained is developed because the dhāraṇī is pure.",
        "source": "T11n0310_004:0023a14_1"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0023a15_2"
    },
    {
        "source_sentence": "所言門者猶如虛空。",
        "translation": "The approach that's called gate is like space.",
        "source": "T11n0310_004:0023a15_3"
    },
    {
        "source_sentence": "一切諸法依於虛空而有生滅，彼生滅者性皆平等，作是觀時無有生滅無所攝受，",
        "translation": "All things have birth and death for their support in space. Their natures of birth and death are all equal. When one contemplates this, there is neither birth nor death, and nothing to be grasped.",
        "source": "T11n0310_004:0023a15_4"
    },
    {
        "source_sentence": "於一切法應如是知。",
        "translation": "They should thus know all dharmas.",
        "source": "T11n0310_004:0023a17_5"
    },
    {
        "source_sentence": "一切諸法亦非攝受非不攝受，非等非不等，乃至無有少法而可得者。",
        "translation": "All dharmas are neither collected nor not collected, neither equal nor unequal, up to the point where there are few dharmas that can be obtained.",
        "source": "T11n0310_004:0023a18_6"
    },
    {
        "source_sentence": "由是能了此形相門，為得無相門清淨故開示演說。",
        "translation": "Because they can understand this aspect of form and characteristics, they reveal and explain it in order to attain the purity of the aspect of formlessness.",
        "source": "T11n0310_004:0023a19_7"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0023a21_0"
    },
    {
        "source_sentence": "言無相者，所謂無身及身施設，無名無句亦無示現。",
        "translation": "The expression signless refers to the absence of body and body as a designation, namelessness, phraselessness, and manifestation.",
        "source": "T11n0310_004:0023a21_1"
    },
    {
        "source_sentence": "於此教義應當了知，彼無形相與虛空等。",
        "translation": "The meaning of this teaching should be understood as being formless like space, etc.",
        "source": "T11n0310_004:0023a22_2"
    },
    {
        "source_sentence": "言虛空者，亦無虛空及空示說。",
        "translation": "The expression space refers to the fact that there's neither space nor emptiness shown and explained.",
        "source": "T11n0310_004:0023a23_3"
    },
    {
        "source_sentence": "此是無明隨順明智力聚法門。",
        "translation": "This is the dharma-gate of nescience that follows the cluster of knowledge and wisdom.",
        "source": "T11n0310_004:0023a24_4"
    },
    {
        "source_sentence": "菩薩能證陀羅尼門理趣方便，由證入故無有諍論、無有忘失，隨入無斷祕密語言陀羅尼門。",
        "translation": "Because the bodhisattva can realize the principle and method of the dhāraṇī teachings, there's no dispute or forgetfulness because he realizes their entry, and he follows them into the gate of the dhāraṇī teachings that don't cut off esoteric language.",
        "source": "T11n0310_004:0023a24_5"
    },
    {
        "source_sentence": "譬如有龍名無熱惱，降澍大雨流澍無斷。",
        "translation": "It's like a dragon named No Heatless, which sends down great rain and streams without stopping.",
        "source": "T11n0310_004:0023a26_6"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0023a27_7"
    },
    {
        "source_sentence": "所言陀羅尼者，是何句義？」",
        "translation": "What is the meaning of the phrase that's called dhāraṇī?",
        "source": "T11n0310_004:0023a28_8"
    },
    {
        "source_sentence": "無邊莊嚴菩薩摩訶薩白佛言世尊：「陀羅尼者，即是隨順諸法祕密方便假名，",
        "translation": "The Bodhisattva Mahāsattva of Boundless Adornment said to the Buddha, Bhagavān, Dhāraṇī is a provisional name that follows the esoteric method of following the teachings.",
        "source": "T11n0310_004:0023a28_9"
    },
    {
        "source_sentence": "即是隨念遍持之業，即是說法語言之句。",
        "translation": "That's the pervasive karma that follows mindfulness, which is the phrase for expounding the Dharma and speech.",
        "source": "T11n0310_004:0023b01_10"
    },
    {
        "source_sentence": "由智聚力，得入如是陀羅尼數。",
        "translation": "Due to the power of the accumulation of wisdom, they'll enter such a number of dhāraṇīs.",
        "source": "T11n0310_004:0023b02_11"
    },
    {
        "source_sentence": "以善覺慧，應當受持無量無邊菩提之力。",
        "translation": "With the wisdom of well-enlightened ones, they should receive and uphold the power of measureless and limitless enlightenment.",
        "source": "T11n0310_004:0023b03_12"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0023b04_13"
    },
    {
        "source_sentence": "如我所解，此無邊智演說方便，為欲利益諸眾生故，開示流布令法不斷。",
        "translation": "As I understand it, this boundless wisdom explains the teaching of skillful means, and because I want to benefit sentient beings, I enlighten and disseminate it so that the teaching doesn't stop.",
        "source": "T11n0310_004:0023b04_14"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_004:0023b05_15"
    },
    {
        "source_sentence": "此陀羅尼門，是大虛空、是大方廣，以是義故能廣宣說。",
        "translation": "This dhāraṇī teaching is the great space and the great width, and it's because of this meaning that it can be explained in detail.",
        "source": "T11n0310_004:0023b05_16"
    },
    {
        "source_sentence": "由說平等能攝受故，名隨教法。",
        "translation": "Because it's said that equality can be collected, it's called the method of following the teachings.",
        "source": "T11n0310_004:0023b07_17"
    },
    {
        "source_sentence": "善巧開示廣大流布，文字差別得圓滿故，通達辯才而得成就。",
        "translation": "He skillfully reveals and spreads it widely, perfecting them by comprehending the distinctive characteristics and eloquence of words.",
        "source": "T11n0310_004:0023b07_18"
    },
    {
        "source_sentence": "由觀察義善巧說故，於義辯才而得圓滿。",
        "translation": "Because they observe the meaning and skillfully explain it, their eloquence regarding meanings is perfected.",
        "source": "T11n0310_004:0023b09_19"
    },
    {
        "source_sentence": "決定諸法善開示故，於法辯才而得圓滿。",
        "translation": "Because they are certain that the teachings are well-disclosed, their eloquence in explaining the teachings is perfected.",
        "source": "T11n0310_004:0023b10_20"
    },
    {
        "source_sentence": "哀愍眾生以大慈悲而能攝受，由攝受故次第調伏令得清淨，無諸戲論而能演說平等捨法。",
        "translation": "pities sentient beings with great compassion and is able to take in them; because of taking in sentient beings, they are gradually disciplined so that they attain purity; without conceptual elaborations, they can expound the doctrine of equanimity.",
        "source": "T11n0310_004:0023b11_21"
    },
    {
        "source_sentence": "世尊說此陀羅尼祕密方便法門品時，無量無邊善巧之義從佛口出。」",
        "translation": "When the Bhagavān teaches this chapter on the esoteric method of the dhāraṇī, the meaning of immeasurable and limitless skillful means comes from the Buddha's mouth.",
        "source": "T11n0310_004:0023b13_22"
    },
    {
        "source_sentence": "爾時佛告無邊莊嚴菩薩摩訶薩：「所言門者，即是如來一切智智門之增語。",
        "translation": "It was then that the Buddha addressed the Bodhisattva Mahāsattva of Infinite Adornment, What's called the gate is the Tathāgata's augmentation of the gate of omniscience and wisdom.",
        "source": "T11n0310_004:0023b14_23"
    },
    {
        "source_sentence": "於此門中，由語言故而得演說一切諸法。",
        "translation": "In this approach, it's because of language that they can explain all dharmas.",
        "source": "T11n0310_004:0023b16_24"
    },
    {
        "source_sentence": "如來安住無邊清淨、究竟清淨自然智見，以無所住無所建立，流注廣大甚深之法。",
        "translation": "The Tathāgata abides in the natural wisdom view of boundless purity and ultimate purity, which flows out vast and profound dharmas because there's nothing to abide in and nothing to establish.",
        "source": "T11n0310_004:0023b17_25"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0023b19_26"
    },
    {
        "source_sentence": "如來嘗說一切諸法皆是佛法，以於諸法能善了知名為佛法。",
        "translation": "The Tathāgata once said that all dharmas are buddha-dharmas, and it's because they can well understand them that they're called buddha-dharmas.",
        "source": "T11n0310_004:0023b19_27"
    },
    {
        "source_sentence": "諸法本性與佛法等，是故諸法皆是佛法。",
        "translation": "The original natures of dharmas are the same as the Buddha's teachings, so all dharmas are buddha-teachings.",
        "source": "T11n0310_004:0023b21_28"
    },
    {
        "source_sentence": "由能了知法非法故，說能了知一切諸法。",
        "translation": "Because the dharmas that can be discerned are unlawful, it's said to be able to discern all dharmas.",
        "source": "T11n0310_004:0023b22_0"
    },
    {
        "source_sentence": "能了知者，即能了知陀羅尼門。",
        "translation": "Those who can comprehend are those who can comprehend the dhāraṇī teachings.",
        "source": "T11n0310_004:0023b22_1"
    },
    {
        "source_sentence": "此陀羅尼而能遍入一切諸法，所謂語言演說談論。",
        "translation": "These dhāraṇīs can pervade all dharmas, which are called verbal explanations and discussions.",
        "source": "T11n0310_004:0023b23_2"
    },
    {
        "source_sentence": "一切語言演說談論，皆由文字表示宣說，是中文字，阿字為初、荷字為後。",
        "translation": "All verbal explanations and discussions are all explained by means of words, which are expressed in words. The letter a comes first and the letter he comes last.",
        "source": "T11n0310_004:0023b24_3"
    },
    {
        "source_sentence": "猶如入胎、受胎、持胎以母為先，又如種子長養以父為先，如蘊積集以生為先，",
        "translation": "It is just as when entering a womb, receiving a womb, and maintaining a womb take the mother as their first priority; in the same way growing seeds takes the father as its first priority. Just as accumulation of aggregates takes birth as its first priority.",
        "source": "T11n0310_004:0023b26_4"
    },
    {
        "source_sentence": "次後建立餘分差別，六處諸根次第成熟。",
        "translation": "Subsequently, the other parts are established as differences. The faculties of the six spheres successively mature in succession.",
        "source": "T11n0310_004:0023b28_5"
    },
    {
        "source_sentence": "如是字母為先，一切文字差別和合。",
        "translation": "Thus, these letters are first, and all the words are combined with distinctions and combinations.",
        "source": "T11n0310_004:0023b29_6"
    },
    {
        "source_sentence": "如是字母為先，光發長養。",
        "translation": "Thus, these letters are the first, and their luminosity gives rise to long nourishment.",
        "source": "T11n0310_004:0023c01_7"
    },
    {
        "source_sentence": "所謂阿字為先、荷字為後，諸餘文字在其中間，隨彼相應和合而轉，此即能入演說語言陀羅尼門。",
        "translation": "The so-called letter a comes first and the letter he comes last, while the other words in between are combined and transformed according to their concomitance, which means they can enter the dhāraṇī aspect of expounding language.",
        "source": "T11n0310_004:0023c01_8"
    },
    {
        "source_sentence": "又當了知一切諸行皆悉壞滅，如彼文字書學成已尋當除滅。",
        "translation": "Also, you should know that all conditioned things completely perish, just as those words and writings will be removed after they've been written or studied.",
        "source": "T11n0310_004:0023c03_9"
    },
    {
        "source_sentence": "如是一切有支建立皆當壞滅，如彼諸行和合故生，彼不和合應知壞滅。",
        "translation": "Thus, all the members of existence that are established in this way will disintegrate and perish. Just as these formations arise due to the conjunction of conditioned forces, it should be known that when they are not conjoined, they disintegrate and perish.",
        "source": "T11n0310_004:0023c05_10"
    },
    {
        "source_sentence": "如是二種相應和合，建立一切諸有愛結；",
        "translation": "Together these two kinds of conjoinedness establish all bonds of craving for existence.",
        "source": "T11n0310_004:0023c07_0"
    },
    {
        "source_sentence": "亦由如是二種和合，建立一切有為諸法。",
        "translation": "It is also because of the combination of these two kinds that all conditioned dharmas are established.",
        "source": "T11n0310_004:0023c07_1"
    },
    {
        "source_sentence": "如是觀察，漸次能淨無作法門，由此能入演說生滅陀羅尼門，令諸菩薩方便善巧速得圓滿。",
        "translation": "Observing them in this way, they can gradually purify the unconstructed dharma-gate and thus be able to enter and explain the dhāraṇī of arising and ceasing so that bodhisattvas will quickly perfect it with skillful means.",
        "source": "T11n0310_004:0023c08_2"
    },
    {
        "source_sentence": "猶如字母阿字為初、荷字為後，如是作已，應以語言演說談論，善入一切祕密言詞。",
        "translation": "It's like when the letter a comes first and the letter he comes last, and after doing so, you should explain it in words to enter into all the esoteric words.",
        "source": "T11n0310_004:0023c11_0"
    },
    {
        "source_sentence": "又應了知無障礙法開示宣說，無邊莊嚴！",
        "translation": "You should also know that the unobstructed teaching reveals and proclaims, boundlessly adorned!",
        "source": "T11n0310_004:0023c12_1"
    },
    {
        "source_sentence": "猶如字母阿字為初，乃至諸餘一切文字分別作已，作意相續入於書寫；",
        "translation": "It is as if the letter a were the first letter of the alphabet, and so on, up to all the other syllables. Having differentiated and composed them, one continues to enter into writing with attention.",
        "source": "T11n0310_004:0023c13_2"
    },
    {
        "source_sentence": "荷字之後更無文字而可建立。",
        "translation": "After the letter荷, there are no words that can be established.",
        "source": "T11n0310_004:0023c15_3"
    },
    {
        "source_sentence": "由是二種作意，能生一切有為之行，彼二分別無有真實。",
        "translation": "Because these two kinds of attention can give rise to all conditioned formations, those two kinds of discrimination have no reality.",
        "source": "T11n0310_004:0023c16_4"
    },
    {
        "source_sentence": "以於真實無少文字，本性自性亦無分別及不分別，而於其中亦復無有少分所作。",
        "translation": "Because there are no few words in reality, the original self-nature has no discrimination or nondiscrimination, and there's no part of what's done about it.",
        "source": "T11n0310_004:0023c17_5"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0023c19_6"
    },
    {
        "source_sentence": "一切諸法以智所知，是智皆從文字建立而得生起。",
        "translation": "All dharmas are known by means of cognition, which is the knowledge that they all arise from words.",
        "source": "T11n0310_004:0023c19_7"
    },
    {
        "source_sentence": "由是文字不成就故，彼智亦復無有形相可得。",
        "translation": "Because these words aren't accomplished, that knowledge also has no form or characteristics to attain.",
        "source": "T11n0310_004:0023c20_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_004:0023c21_9"
    },
    {
        "source_sentence": "以於真實無有形相。",
        "translation": "It's because there are no form and characteristics in reality.",
        "source": "T11n0310_004:0023c21_10"
    },
    {
        "source_sentence": "由入如是無形相故，捨離一切所作事業。",
        "translation": "Because they enter such formlessness, they abandon all their undertakings.",
        "source": "T11n0310_004:0023c22_11"
    },
    {
        "source_sentence": "無所作故，捨離一切有為之事。",
        "translation": "Because there's nothing to do, they abandon all conditioned things.",
        "source": "T11n0310_004:0023c23_12"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0023c24_13"
    },
    {
        "source_sentence": "此是陀羅尼清淨善巧遍持法門。",
        "translation": "This is the dhāraṇī that's pure, skillful, and pervasively maintained dharma-gate.",
        "source": "T11n0310_004:0023c24_14"
    },
    {
        "source_sentence": "若諸菩薩於此學時，能起一切無癡事業，為諸眾生宣說正法，令不缺減、不住諸想覆蓋著心，",
        "translation": "“When enlightening beings study these teachings, they are able to undertake all the practices free of delusion and explain the right teaching for sentient beings so that they don’t lack it or cling to it.",
        "source": "T11n0310_004:0023c25_15"
    },
    {
        "source_sentence": "及能遠離想及作意。",
        "translation": "He's able to be free of conceptions and contemplation.",
        "source": "T11n0310_004:0023c27_16"
    },
    {
        "source_sentence": "以能趣入諸法覺慧，證無邊智理趣善巧。",
        "translation": "By being able to enter into the awakening wisdom of all dharmas, they realize limitless knowledge and skillfulness in principles and destinies.",
        "source": "T11n0310_004:0023c27_17"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0023c28_18"
    },
    {
        "source_sentence": "若諸菩薩遍取名已，了一切法唯有種種積集言說所起之名而無真實。",
        "translation": "If bodhisattvas pervasively grasp names, they understand that all dharmas are nothing real but the names produced by various kinds of accumulated verbal expressions.",
        "source": "T11n0310_004:0023c28_19"
    },
    {
        "source_sentence": "如是知者，應當隨入陀羅尼門理趣善巧。",
        "translation": "Known in this way, they should follow the entry into the dhāraṇī teachings and skillfully practice them according to their principles.",
        "source": "T11n0310_004:0024a01_20"
    },
    {
        "source_sentence": "云何應入陀羅尼門理趣善巧？",
        "translation": "What's the skillful way to enter the dhāraṇī approach of principle and practice?",
        "source": "T11n0310_004:0024a02_21"
    },
    {
        "source_sentence": "知所有名而無住處，不住諸法內外中邊，於一切處都不可得，但依積集種種言說而假施設，",
        "translation": "They know all names but have no dwelling places, and do not dwell in the middle or the extremes of dharmas. They cannot be found in any place; they simply designate them provisionally on the basis of accumulation of various expressions.",
        "source": "T11n0310_004:0024a03_22"
    },
    {
        "source_sentence": "於施設名如實隨覺是如實句，以此實句應當了知一切諸法無名無說。",
        "translation": "In designating names as they really are and following feelings as they really are phrases, this true phrase should be used to understand that all dharmas have no names and no explanations.",
        "source": "T11n0310_004:0024a05_23"
    },
    {
        "source_sentence": "此是諸佛力無畏地。",
        "translation": "This is the fearless stage of the powers of the buddhas.",
        "source": "T11n0310_004:0024a06_24"
    },
    {
        "source_sentence": "於所有法，應以此門開示演說。",
        "translation": "Regarding all dharmas, they should be revealed and explained in this way.",
        "source": "T11n0310_004:0024a07_25"
    },
    {
        "source_sentence": "如來所說一切諸法非一性、非異性，諸法無有一異性故。",
        "translation": "The Tathāgata teaches that all dharmas are not one and the same in nature or different in nature, because there's no single difference in the dharmas.",
        "source": "T11n0310_004:0024a08_26"
    },
    {
        "source_sentence": "此一切法非生非有，如是宣示諸法亦空。",
        "translation": "All these dharmas are neither produced nor existent, thus proclaiming that all dharmas are also empty.",
        "source": "T11n0310_004:0024a09_27"
    },
    {
        "source_sentence": "法若空者彼即無相，若無相者即無願求。",
        "translation": "If a dharma is empty, then it has no characteristics, and if it has no characteristics, then it's wishing for nothing.",
        "source": "T11n0310_004:0024a10_28"
    },
    {
        "source_sentence": "若法是空無相無願，則不可知、不可遍知，不應說彼若有若無。",
        "translation": "If things are emptiness, signless, and wishless, then they can't be known or pervaded, and it shouldn't be said that they exist or don't exist.",
        "source": "T11n0310_004:0024a11_29"
    },
    {
        "source_sentence": "言有無者但是言說，不應於中而生執著。",
        "translation": "The expression 'existence and nonexistence' refers only to verbal explanations, and you shouldn't give rise to attachment in them.",
        "source": "T11n0310_004:0024a12_30"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_004:0024a13_31"
    },
    {
        "source_sentence": "如來常說，若不執著一切法者是真勝義；",
        "translation": "The Tathagata always says: If one does not cling to all factors, this is the ultimate truth.",
        "source": "T11n0310_004:0024a13_32"
    },
    {
        "source_sentence": "若有著者，由是著故於彼彼法隨生執著。",
        "translation": "If someone has an attachment, it's because of this attachment that they subsequently become attached to those things.",
        "source": "T11n0310_004:0024a14_33"
    },
    {
        "source_sentence": "如是執著一切皆空，是敗壞法，但唯虛妄戲論分別。",
        "translation": "Thus, they cling to all things as emptiness, which is a destructive dharma but only falsely conceptualize it.",
        "source": "T11n0310_004:0024a15_34"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024a16_35"
    },
    {
        "source_sentence": "汝應當觀演說諸法，而於彼法實無示說。",
        "translation": "You should observe and explain the teachings, but there's really no explanation of those teachings.",
        "source": "T11n0310_004:0024a17_36"
    },
    {
        "source_sentence": "豈於此中有能說者而為他說？",
        "translation": "How could there be someone here who can teach and yet speak for others?",
        "source": "T11n0310_004:0024a18_37"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024a18_38"
    },
    {
        "source_sentence": "此清淨法，從諸如來之所演出，能了知者甚為希有。",
        "translation": "These pure dharmas are produced by the tathāgatas, and it's rare for someone to be able to understand them.",
        "source": "T11n0310_004:0024a19_0"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024a20_1"
    },
    {
        "source_sentence": "汝等今於我前聞如是法，能善了知住清淨信，能生勝解雖復眾多，而於後世希有眾生於此法中能遍了知，",
        "translation": "Having heard these teachings before me, you will be able to know them well and abide in pure faith. Although there are still so many people who can give rise to such conviction, rare sentient beings of later ages will be able to know all about them.",
        "source": "T11n0310_004:0024a20_2"
    },
    {
        "source_sentence": "唯除今時親於我所發弘誓言：『願於來世利益安樂諸眾生故，而當受持如來法教。』",
        "translation": "Only now does he personally make a great vow to me, saying, 'May I accept and uphold the Tathāgata's teaching of the Dharma for the benefit and welfare of sentient beings in future lives.'",
        "source": "T11n0310_004:0024a22_3"
    },
    {
        "source_sentence": "若曾往昔於如來所，承事供養深生信解，愛樂希求於甚深法理趣善巧願聽聞者，",
        "translation": "“Furthermore, if someone had served and honored the enlightened ones in the past, deeply believed in them, yearned to hear their teachings, and skillfully wished to hear them.",
        "source": "T11n0310_004:0024a24_4"
    },
    {
        "source_sentence": "此諸菩薩當能獲得陀羅尼法。",
        "translation": "These bodhisattvas will be able to attain the dhāraṇī teachings.",
        "source": "T11n0310_004:0024a26_5"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024a27_6"
    },
    {
        "source_sentence": "由於往昔供養如來，復得值遇無量諸佛承事供養，於甚深法因緣理趣深信解者、善求於法多勝解者、趣行深廣求大乘者；",
        "translation": "As a result of having honored buddhas in the past, they were also able to meet countless buddhas and receive their service and offerings from those who had deep faith and understanding of the profound causes and conditions of the Teaching, well sought enlightenment with great devotion, and practiced pursuing the Great Vehicle.",
        "source": "T11n0310_004:0024a27_7"
    },
    {
        "source_sentence": "聲聞乘人厭離三界，於甚深法勤修行者，此諸人等未曾聽聞此甚深法。",
        "translation": "Those in the śrāvaka vehicle who are disillusioned with the three realms and diligently cultivate the profound teaching, these people haven't heard this profound teaching before.",
        "source": "T11n0310_004:0024b01_8"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024b03_9"
    },
    {
        "source_sentence": "如來為欲利益安樂此諸有情，令證甚深廣大無量難見難解種智覺故，而復宣說甚深之法。",
        "translation": "Because the Tathāgata wants to benefit and comfort these sentient beings so that they realize profound, vast, immeasurable, difficult-to-view, and difficult-to-understand kinds of wisdom and awakening, he also explains a profound teaching.",
        "source": "T11n0310_004:0024b03_10"
    },
    {
        "source_sentence": "此非愚夫無聞執著不求法者之所行地；",
        "translation": "This is not the sphere of action of ignorant people who do not hear and cling to doctrine and do not seek it.",
        "source": "T11n0310_004:0024b05_11"
    },
    {
        "source_sentence": "有如理修行善根具足，於微少過生大怖畏，於諸怖畏而求解脫，是此等類之所依處。",
        "translation": "Those who correctly cultivate the good roots and are fully endowed with them, become greatly frightened by their slight faults, and seek liberation from those fears—this is the basis for such people.",
        "source": "T11n0310_004:0024b06_12"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024b08_13"
    },
    {
        "source_sentence": "如來今為汝等天人世間常演說法不生勞倦，由佛往昔行菩薩道時，於無量億劫精勤修學此甚深法，",
        "translation": "The Tathāgata now always expounds the Teaching for you gods and humans, never getting tired of it. Because in the past when the Buddha was practicing the path of enlightening beings, he diligently cultivated this profound teaching for immeasurable millions of kalpas.",
        "source": "T11n0310_004:0024b08_14"
    },
    {
        "source_sentence": "既修學已方便迴向：『云何為諸有情當轉無上微妙法輪，及為有情而得示現無上大智，",
        "translation": "Having cultivated it, they dedicate it skillfully: How will they turn the supremely subtle wheel of teaching for the sake of sentient beings and attain the manifestation of unexcelled great knowledge for sentient beings?",
        "source": "T11n0310_004:0024b10_15"
    },
    {
        "source_sentence": "令一切智智種性不斷？』",
        "translation": "Does it cause the seed nature of omniscience and cognition not to continue?'",
        "source": "T11n0310_004:0024b12_16"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024b13_17"
    },
    {
        "source_sentence": "此由如來往昔願力，為令一切種性不斷，及威加此陀羅尼句，開示演說此甚深法廣令流布，",
        "translation": "Because of the power of the Buddha’s past vow to cause all beings not to be abandoned, and because of his authoritative application of these dhāraṇī phrases, enlightening beings reveal and expound this profound teaching so as to make it widely known.",
        "source": "T11n0310_004:0024b13_18"
    },
    {
        "source_sentence": "使諸有情於佛法中當能悟入，令一切智種性不斷，光闡弘宣此諸法教。",
        "translation": "It will cause sentient beings to be able to awaken and enter the Buddha's teaching, so that the seed nature of omniscience doesn't stop, and it will illuminate and disseminate this teaching of the Dharma.",
        "source": "T11n0310_004:0024b15_19"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024b17_20"
    },
    {
        "source_sentence": "汝等今欲隨學如來，有諸眾生希求法者，開示演說勿生勞倦。",
        "translation": "Now, if you want to follow the Tathāgata's example, show and explain it to sentient beings who desire the Dharma so that they won't become weary.",
        "source": "T11n0310_004:0024b17_21"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024b19_22"
    },
    {
        "source_sentence": "諸菩薩等如所聞法，於大眾中當廣開演所有法行，由是當得近於佛智，",
        "translation": "“Enlightening beings, just as they have heard the Teaching, will expound it widely in the great assembly. Because of this, they will attain nearness to buddha-knowledge.",
        "source": "T11n0310_004:0024b19_23"
    },
    {
        "source_sentence": "能速證獲陀羅尼門。",
        "translation": "They'll quickly realize the dhāraṇī teachings.",
        "source": "T11n0310_004:0024b20_24"
    },
    {
        "source_sentence": "由證陀羅尼故，以少功力而能受持光明照耀清淨法門。",
        "translation": "Because they've realized the dhāraṇī, they're able to retain the pure dharma-gate of illuminating and shining light with little effort.",
        "source": "T11n0310_004:0024b21_25"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024b22_26"
    },
    {
        "source_sentence": "一切諸法本性清淨，若法本性非彼相應非不相應，非和合住非不和合，",
        "translation": "The original nature of all dharmas is pure, and if the original nature of dharmas isn't associated with them or not associated with them, it's neither combined, abiding, nor uncombined.",
        "source": "T11n0310_004:0024b22_27"
    },
    {
        "source_sentence": "於諸法中而無有法，若無有者則無有處而可示說，唯除因盡，因盡故即離，",
        "translation": "There is no dharma among all dharmas. If there were non-existence, there would be no place where one could expound it. The only exception would be when the cause ceases. Because the cause ceases, there would be separation.",
        "source": "T11n0310_004:0024b24_28"
    },
    {
        "source_sentence": "離故即滅。",
        "translation": "Being free, it's cessation.",
        "source": "T11n0310_004:0024b26_29"
    },
    {
        "source_sentence": "我為有情了知故，說一切諸法本性自性。",
        "translation": "Because sentient beings understand it, I explain the essential nature and self-nature of all dharmas.",
        "source": "T11n0310_004:0024b26_30"
    },
    {
        "source_sentence": "於彼無因即無因盡，無因盡故無離無滅。",
        "translation": "The absence of a cause in relation to that is the exhaustion of noncausation. Because there is no destruction of causes, there is neither separation nor cessation.",
        "source": "T11n0310_004:0024b27_31"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024b28_32"
    },
    {
        "source_sentence": "汝觀如來之所說法如是清淨，若有以法觀如來者，彼於如來見不清淨。",
        "translation": "You observe that what the Tathāgata teaches is thus pure, and if someone observes the Tathāgata with the Dharma, they'll see that the Tathāgata isn't pure.",
        "source": "T11n0310_004:0024b28_33"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_004:0024c01_34"
    },
    {
        "source_sentence": "如來非法亦非非法。",
        "translation": "The Tathāgata is neither unlawful nor unlawful.",
        "source": "T11n0310_004:0024c01_35"
    },
    {
        "source_sentence": "如來尚不安住少法，何況非法。",
        "translation": "The Tathāgata still doesn't abide in few dharmas, so why wouldn't he do anything unlawful?",
        "source": "T11n0310_004:0024c01_36"
    },
    {
        "source_sentence": "若住非法，無有是處。",
        "translation": "If someone abides in what's unlawful, there's no place for them.",
        "source": "T11n0310_004:0024c02_37"
    },
    {
        "source_sentence": "如來超過諸表示法不可宣說，一切語言皆清淨故。",
        "translation": "The Tathāgata transcends all expressions and dharmas that can't be explained, because all words are pure.",
        "source": "T11n0310_004:0024c03_38"
    },
    {
        "source_sentence": "是故如來最極甚深廣大無量。",
        "translation": "Therefore, the Tathāgata's most profound and vast is immeasurable.",
        "source": "T11n0310_004:0024c04_39"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024c05_0"
    },
    {
        "source_sentence": "如是如來非色表示，非受想行識之所表示。",
        "translation": "Thus, the Tathāgata doesn't show form, and it's not shown by feeling, perception, volition, or consciousness.",
        "source": "T11n0310_004:0024c05_1"
    },
    {
        "source_sentence": "如來亦非色盡解脫，非受想行識盡解脫。",
        "translation": "The Tathagata is also not liberation from the exhaustion of form, and he is not liberation from the exhaustion of feeling, perception, volition, and consciousness.",
        "source": "T11n0310_004:0024c06_2"
    },
    {
        "source_sentence": "由是如來絕諸表示，與色等法非共相應非不相應，而於一切有為無為能遍解脫，",
        "translation": "Thus, the Tathāgata has abandoned all expressions. He is neither associated with form, etc., nor not associated with them, yet he can be liberated from all conditioned and unconditioned things.",
        "source": "T11n0310_004:0024c07_3"
    },
    {
        "source_sentence": "不起分別無有戲論。",
        "translation": "They don't discriminate, and there's no conceptual elaboration.",
        "source": "T11n0310_004:0024c09_4"
    },
    {
        "source_sentence": "如來不與色取相應，亦復不與受想行識諸取相應，永斷一切取蘊根本，",
        "translation": "The Tathagata is not associated with the grasping of material form. Nor is he associated with the grasping of feeling, perception, volition, and consciousness. He absolutely eliminates the roots of all grasping aggregates.",
        "source": "T11n0310_004:0024c09_5"
    },
    {
        "source_sentence": "而亦遠離諸法根本。",
        "translation": "They're also far removed from the root of all dharmas.",
        "source": "T11n0310_004:0024c11_6"
    },
    {
        "source_sentence": "謂無戲論，不入不出超度瀑流，不住無上諸佛智境亦非不住。",
        "translation": "They are those who don't engage in conceptual elaborations, don't enter or leave and transcend the flow of the waterfall, don't abide in the sphere of the knowledge of the unsurpassed buddhas, and don't abide.",
        "source": "T11n0310_004:0024c11_7"
    },
    {
        "source_sentence": "應說如來不住少法、不取不捨。",
        "translation": "You should say that the Tathāgata doesn't abide in little dharmas and doesn't grasp or abandon them.",
        "source": "T11n0310_004:0024c13_0"
    },
    {
        "source_sentence": "如說如來，說法亦爾。",
        "translation": "Just as it's said that the Tathāgata teaches, so does he explain the teaching.",
        "source": "T11n0310_004:0024c13_1"
    },
    {
        "source_sentence": "如來不相應故，如來之法亦不相應。",
        "translation": "Because the Tathāgata isn't associated, the Tathāgata's teaching isn't associated either.",
        "source": "T11n0310_004:0024c14_2"
    },
    {
        "source_sentence": "如如來法，諸法亦爾。",
        "translation": "Just as the Tathāgata's teaching, so are all dharmas.",
        "source": "T11n0310_004:0024c15_0"
    },
    {
        "source_sentence": "依如實理，諸法皆如，是故世尊說一切法悉是真如，一切法如與佛真如無二無別、非一非異。",
        "translation": "Based on the true principle, all dharmas are thus; therefore, the Bhagavān explains that all dharmas are ultimately true, that all dharmas are as they are and the Buddha's true nature is not two, not distinct, not one, not different.",
        "source": "T11n0310_004:0024c15_1"
    },
    {
        "source_sentence": "如來安住無分別法，非遍計故。",
        "translation": "The Tathāgata abides in nondiscriminating dharmas, not pervasive discrimination.",
        "source": "T11n0310_004:0024c17_2"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024c18_3"
    },
    {
        "source_sentence": "如來說法，終不超過一切諸法。",
        "translation": "The Tathāgata teaches the Dharma, never surpassing all dharmas.",
        "source": "T11n0310_004:0024c18_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_004:0024c19_5"
    },
    {
        "source_sentence": "無有少法可超過故。",
        "translation": "There's no little thing that can be transcended.",
        "source": "T11n0310_004:0024c19_6"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024c19_7"
    },
    {
        "source_sentence": "如來於彼某時證得無上正等菩提，然於彼時實無有法而可得者，以一切法及諸隨法不可得故，",
        "translation": "At that certain time, the Tathāgata realizes unsurpassed true and complete enlightenment, but there really is no dharma to be attained at that point, because all dharmas and derivative dharmas are ungraspable.",
        "source": "T11n0310_004:0024c20_8"
    },
    {
        "source_sentence": "不起分別亦復不起法與非法及作意想，於彼本性清淨法性而不安住亦不建立。",
        "translation": "They don't discriminate and also don't give rise to conceptions of dharmas, what's neither lawful nor unlawful, or contemplation, and they don't abide in the pure Dharma nature of their original nature and don't establish it.",
        "source": "T11n0310_004:0024c22_9"
    },
    {
        "source_sentence": "如是了知簡擇法時，亦無了知及簡擇者。",
        "translation": "In the same way, at the moment of knowing a factor that is to be investigated in this way, also no one understands or investigates it.",
        "source": "T11n0310_004:0024c24_10"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024c25_11"
    },
    {
        "source_sentence": "此所演說第一義句，即是如來非句之句，句清淨故。",
        "translation": "The phrase that's explained as the first meaning is a phrase that's not a phrase of the Tathāgata, because the phrase is pure.",
        "source": "T11n0310_004:0024c25_12"
    },
    {
        "source_sentence": "以是義故，諸菩薩等得一切句清淨之智，由是能入無邊理趣陀羅尼門，",
        "translation": "Because of these meanings, enlightening beings attain the pure knowledge of all expressions and are thus able to enter boundless dhāraṇī-gates of principle and path.",
        "source": "T11n0310_004:0024c26_13"
    },
    {
        "source_sentence": "亦無少法而可證入，不來不去。",
        "translation": "Nor is there a little teaching that can be realized and entered, which doesn't come or go.",
        "source": "T11n0310_004:0024c28_14"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0024c28_15"
    },
    {
        "source_sentence": "所言句者，無句可得，非句句故，於一切句應如是知。",
        "translation": "The phrase refers to the absence of a phrase that can be obtained, and because it's not a phrase, all phrases should be known in this way.",
        "source": "T11n0310_004:0024c29_16"
    },
    {
        "source_sentence": "如是諸句是厭離句，若厭離句是虛妄句，若虛妄句即厭離句。",
        "translation": "Such phrases are phrases that are disillusioned, and if they are disillusioned, they are false phrases, and if they are false, they are phrases that are disillusioned.",
        "source": "T11n0310_004:0024c30_17"
    },
    {
        "source_sentence": "彼一切句是滅盡句，若滅盡句即真如句，若真如句即究竟句，若究竟句是盡離滅句，",
        "translation": "All these phrases are phrases of cessation. If they are phrases of cessation, they are phrases of the ultimate truth. If they are phrases of the ultimate truth, they are phrases of cessation free from cessation.",
        "source": "T11n0310_004:0025a01_18"
    },
    {
        "source_sentence": "若盡離滅句即涅槃句。",
        "translation": "If the phrase exhaustion is free of cessation, that's the phrase nirvāṇa.",
        "source": "T11n0310_004:0025a03_19"
    },
    {
        "source_sentence": "若涅槃句即非世俗，無句施設亦無示說。",
        "translation": "If the phrase nirvāṇa is not worldly, there are no phrases that define it or show it.",
        "source": "T11n0310_004:0025a04_20"
    },
    {
        "source_sentence": "無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0025a05_21"
    },
    {
        "source_sentence": "言一句者，於一切善不善法中平等趣入。",
        "translation": "The phrase one sentence means to enter equally into all good and unskillful dharmas.",
        "source": "T11n0310_004:0025a05_22"
    },
    {
        "source_sentence": "云何一句？",
        "translation": "What's a phrase?",
        "source": "T11n0310_004:0025a06_23"
    },
    {
        "source_sentence": "所謂離句。",
        "translation": "It's called being free of phrases.",
        "source": "T11n0310_004:0025a06_24"
    },
    {
        "source_sentence": "於厭離中無有少句，是一切句猶如厭離句。",
        "translation": "There are no few phrases in disillusionment, and all phrases are like the phrase disillusionment.",
        "source": "T11n0310_004:0025a06_25"
    },
    {
        "source_sentence": "亦非句，句清淨故。",
        "translation": "Nor is it a phrase, because the phrase is pure.",
        "source": "T11n0310_004:0025a07_26"
    },
    {
        "source_sentence": "若句清淨即涅槃清淨，若涅槃清淨即句清淨。",
        "translation": "If the phrase is purified, then nirvāṇa is purified, and if nirvāṇa is purified, then the phrase is purified.",
        "source": "T11n0310_004:0025a08_27"
    },
    {
        "source_sentence": "如是諸句皆不可說。",
        "translation": "None of these phrases can be explained.",
        "source": "T11n0310_004:0025a09_28"
    },
    {
        "source_sentence": "若以語言宣示句者，而彼諸言於十方界求不可得，誰為誰說？",
        "translation": "If someone proclaims a phrase with words, but those words are sought in the ten directions that they can't be obtained, who will explain it for whom?",
        "source": "T11n0310_004:0025a09_29"
    },
    {
        "source_sentence": "故諸言說一切皆空。",
        "translation": "Therefore, all words and explanations are empty.",
        "source": "T11n0310_004:0025a11_30"
    },
    {
        "source_sentence": "彼若空者即無有義，不應於中戲論分別。",
        "translation": "If they are empty, then they have no meaning and shouldn't be discussed or discriminated.",
        "source": "T11n0310_004:0025a11_31"
    },
    {
        "source_sentence": "出生如是諸句義者，一切皆是無分別句、無戲論句。",
        "translation": "Those who give rise to the meaning of such phrases are all nondiscriminating phrases and non-conceptual phrases.",
        "source": "T11n0310_004:0025a12_32"
    },
    {
        "source_sentence": "是故修觀行者，尋求觀察一切句時，當知皆為離滅涅槃。",
        "translation": "Therefore, when someone cultivates the practice of contemplation and seeks to examine all phrases, they should know that they are all free of cessation and nirvāṇa.",
        "source": "T11n0310_004:0025a13_33"
    },
    {
        "source_sentence": "如是諸句不異涅槃亦不可說，然非不異。",
        "translation": "Thus, these phrases aren't different from nirvāṇa and can't be explained, but they aren't not different.",
        "source": "T11n0310_004:0025a15_34"
    },
    {
        "source_sentence": "由言說句皆虛妄故為清淨句，宣說善巧表示諸句非實表示，若非表示非不表示則處中道。",
        "translation": "Because verbal expressions are all false, they're pure phrases that proclaim skillfully express words that aren't really expressed, and if they don't express or don't express what's not expressed, then they're in the middle way.",
        "source": "T11n0310_004:0025a16_0"
    },
    {
        "source_sentence": "若處中道則無分別，以於此中分別斷故。",
        "translation": "In the case of the intermediate path, there is no discrimination: because in this one it is to be abandoned through differentiating.",
        "source": "T11n0310_004:0025a18_1"
    },
    {
        "source_sentence": "於此法性平等入時，而無有處行少惡行，無所得故。",
        "translation": "When they enter this Dharma nature equally, there's no place to engage in few bad actions, because there's nothing to be gained.",
        "source": "T11n0310_004:0025a19_2"
    },
    {
        "source_sentence": "如是不行，亦不遍行不等近行，若如是行，諸佛說為菩薩乘者無有少法而可行時，",
        "translation": "They don’t practice in this way, nor do they practice pervasively or equally. If they practice in this way, the Buddhas teach that there is no little thing to practice for those who adhere to the bodhisattva vehicle.",
        "source": "T11n0310_004:0025a20_3"
    },
    {
        "source_sentence": "彼行菩薩地安住無上清淨陀羅尼故。",
        "translation": "It's because they practice the bodhisattva ground and abide in the unsurpassed pure dhāraṇī.",
        "source": "T11n0310_004:0025a22_4"
    },
    {
        "source_sentence": "「無邊莊嚴！",
        "translation": "Boundless adornment!",
        "source": "T11n0310_004:0025a23_0"
    },
    {
        "source_sentence": "我今當說陀羅尼句。",
        "translation": "Now, I will explain the dhāraṇī phrase.",
        "source": "T11n0310_004:0025a23_1"
    },
    {
        "source_sentence": "由是句故，令諸菩薩得陀羅尼，而能開示無邊法藏。",
        "translation": "Because of these phrases, they cause bodhisattvas to attain the dhāraṇī and be able to reveal the limitless store of the Dharma.",
        "source": "T11n0310_004:0025a23_2"
    },
    {
        "source_sentence": "應說此等住無諍地，以能摧破諸他論故、極寂靜故、廣演法故。",
        "translation": "It should be said that these abide in the stage of noncontention: because they are able to destroy the theories of others, because of being extremely quiet and explaining the doctrine extensively.",
        "source": "T11n0310_004:0025a24_3"
    },
    {
        "source_sentence": "此中何者是彼法門陀羅尼句？",
        "translation": "What's the dhāraṇī phrase for that dharma-gate?",
        "source": "T11n0310_004:0025a26_4"
    },
    {
        "source_sentence": "「哆姪他若曳(一)　微若曳(二)　隖計(三)　烏迦(上)筏底(丁以反)(四)　阿(引)[口*路]計(五)　阿(引)[口*路]迦(上)筏底(丁以反)(六)　鉢囉(二合上)陛(七)　鉢囉(二合上)婆(上)筏底(丁以反)(八)　娜唎設儜(九)　儞(尼頂反)那唎設曇筏底(十)　遏替(十一)　遏他筏底(十二)　戍闥儜(十三)　鞞戍闥儜(十四)　鉢唎戍闥儜(十五)　吃唎(二合)耶(十六)(上聲)　吃唎(二合)耶筏底(十七)　嗢哆囉尼(十八)(上聲)　珊哆囉尼(十九)(上聲)　摩訶毘社曳(二十)　麼訶毘社耶筏底(丁以反)(二十一)　阿怒珊地(上)(二十二)　阿鉢囉(上、二合)底(丁以反)珊地(上)(二十三)　庾伽(上)磨[阿-可+欠][木*奈]陀(上)(二十四)　悉地(二十五)　悉馱遏挮(二合)(二十六)　悉陀(上)遏他(上)筏底(丁以反)(二十七)　麼底(丁以反)(二十八)　麼底(丁以反)鉢囉(二鞞合)(二十九)　嗢哆唎(三十)　嗢哆囉筏底(丁以反)(三十一)　弭磨唎(三十二)　彌磨囉怒散地(三十三)　薩嚟(三十四)　薩囉筏底(三十五)　薩囉(引)怒伽底(三十六)　娑冥(上)(三十七)　娑麼[口*藍]婆(上)弭伽底(三十八)　羯底(丁以反)(三十九)　阿儞伽底(四十)　阿鉢囉(上、二合)底(丁以反)儞筏底(四十一)　彌勢曬(四十二)　彌勢曬筏底(四十三)　阿(上)磨醯儞(四十四)　儞磨醯儞(四十五)　鉢囉(二合)磨醯儞(四十六)　鄔(引)荷鄔哆囉嚀(四十七)　麼囉鉢娜曳(四十八)　阿(上)勢鎩(去)(四十九)　阿怒跛勢鎩(五十)　阿怒伽迷(五十一)　阿鉢囉(二合)底伽迷(五十二)　阿伽(上聲、呼)帝(五十三)　阿娜伽(上聲、呼)　底(五十四)　伽底弭戍馱儞(五十五)　鉢唎戍第(五十六)　薑(去)竭差(初假反)(二合)掣(尺曳反)娜儞夜帝(五十七)　麼底(丁以反)鉢囉(二合)避帝(五十八)　麼底毘戍馱儞(五十九)　三縵多(引)怒羯帝(六十)　三縵多鉢唎縛(房可反)嚟(六十一)　三縵多毘戍馱(六十二)　儞阿怒跛仡囉(二合)呬(六十三)　阿儞仡囉(二合)呬帝(六十四)　呬那(引)囉梯(二合)(六十五)　阿囉他(二合)毘戍地鉢囉冥(六十六)　奚都儞地珊寧鉢囉(二合)避底(六十七)　鉢囉(二合)避多筏底(丁以反)(六十八)　毘儞設者(二合)曳(六十九)　避儞設者(二合)耶(引)怒羯帝(七十)　阿難多囉挮(七十一)　阿難多苾仡囉(二合)奚(七十二)　麼社毘戍地(七十三)　阿怒竭囉奚(七十四)　鉢囉(二合)竭囉荷毘戍馱儞(七十五)　阿地耶(二合、引)多麼(二合)毘竭帝(七十六)　麼呬囉馱(二合)毘戍馱儞(七十七)　苾地耶(二合、引)怒竭底(丁以反)(七十八)　苾地耶(二合、引)怒散地(七十九)　鉢唎戍馱儞(八十)「無邊莊嚴！",
        "translation": "「哆姪他若曳(一) 微若曳(二) 計(三) 烏迦(上)筏底(丁以反)(四) 阿(引)[口*路]計(五) 阿(引)[口*路]迦(上)筏底(丁以反)(六) 鉢囉(二合上)陛(七)",
        "source": "T11n0310_004:0025a27_0"
    },
    {
        "source_sentence": "此是陀羅尼標釋之句。",
        "translation": "These are the phrases that are labeled and explained in the dhāraṇī.",
        "source": "T11n0310_004:0025c03_1"
    },
    {
        "source_sentence": "諸菩薩等由是句故，而能隨念無量如來所有法藏，亦能為諸有情開示演說住無諍地，",
        "translation": "Because of these words, enlightening beings are able to follow the thoughts of the infinite treasury of teachings of buddhas and can also show sentient beings how to abide in the sphere of no dispute.",
        "source": "T11n0310_004:0025c03_2"
    },
    {
        "source_sentence": "復能隨入一切義句理趣善巧，善能了知無量廣大差別智覺，隨其所願皆得圓滿。」",
        "translation": "He's also able to follow all the meanings, phrases, principles, and destinies of all kinds of skillfulness, well understand measureless, vast, and distinctive wisdom and awakening, and fulfill whatever he wishes.",
        "source": "T11n0310_004:0025c05_3"
    },
    {
        "source_sentence": "大寶積經卷第四",
        "translation": "Dabaoji jing, vol. 4",
        "source": "T11n0310_004:0025c08_0"
    }
]