[
    {
        "source_sentence": "佛說大乘菩薩藏正法經卷第二",
        "translation": "Foshuo daishi pusa zhengfa jing, vol. 2",
        "source": "T11n0316_025:0843b02_0"
    },
    {
        "source_sentence": "十五",
        "translation": "fifteen",
        "source": "T11n0316_025:0843b03_0"
    },
    {
        "source_sentence": "西天譯經三藏銀青光祿大夫",
        "translation": "translated scriptures of the Western Heavens, Tripiṭaka Master銀青光祿大夫",
        "source": "T11n0316_025:0843b05_0"
    },
    {
        "source_sentence": "試光祿卿慈覺傳梵大師賜紫",
        "translation": "試光祿卿慈覺傳梵大師賜紫",
        "source": "T11n0316_025:0843b06_0"
    },
    {
        "source_sentence": "沙門臣法護等奉　詔譯",
        "translation": "translated by imperial edict by the ascetic ministers Dharmagupta and others",
        "source": "T11n0316_025:0843b07_0"
    },
    {
        "source_sentence": "◎忍辱波羅蜜多品第八之餘",
        "translation": "The rest of the eighth chapter of the perfection of forbearance",
        "source": "T11n0316_025:0843b08_0"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_025:0843b09_0"
    },
    {
        "source_sentence": "菩薩摩訶薩忍辱波羅蜜多，所謂自身畢竟忍辱，有我等相非究竟忍。",
        "translation": "The perfection of the bodhisattva-mahāsattva's tolerance of forbearance is called ultimate self-forbearance, which has characteristics like self and so forth that aren't perfect tolerance.",
        "source": "T11n0316_025:0843b09_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0316_025:0843b10_2"
    },
    {
        "source_sentence": "若他瞋恚來嬈惱時及能忍受，於心境中俱不可得。",
        "translation": "When another person's anger comes to harm them and they can tolerate it, neither is it obtainable in the mind or object.",
        "source": "T11n0316_025:0843b11_3"
    },
    {
        "source_sentence": "而菩薩作是思惟：『何者為瞋？",
        "translation": "The bodhisattva then thought, 'What's anger?'",
        "source": "T11n0316_025:0843b12_4"
    },
    {
        "source_sentence": "何者為忍？",
        "translation": "What's patience?",
        "source": "T11n0316_025:0843b12_5"
    },
    {
        "source_sentence": "於法數中云何眼等處而有瞋恚？』",
        "translation": "How is there anger in the eye and so forth in the number of dharmas?'",
        "source": "T11n0316_025:0843b13_6"
    },
    {
        "source_sentence": "又復伺察，於十二處忍辱亦不可得，展轉入解有情等相悉無所得。",
        "translation": "Furthermore, it's also observed that forbearance in 12 places is also unobtainable, and the characteristics of sentient beings and so forth are all unobtainable.",
        "source": "T11n0316_025:0843b13_7"
    },
    {
        "source_sentence": "又此忍辱非實究竟，至於忍辱名字如空谷響，是名苦空無常無我，於忍辱等作如是解。",
        "translation": "Furthermore, this forbearance is not really ultimate, and the name for for forbearance is like the sound of an empty valley, which is called suffering, emptiness, impermanence, and selflessness, and it's thus explained in terms of forbearance and so forth.",
        "source": "T11n0316_025:0843b15_8"
    },
    {
        "source_sentence": "又此忍辱亦非究竟，謂於是法我無顛倒、彼是顛倒，於忍辱行起高下相。",
        "translation": "Also, this forbearance isn't perfect, meaning that there's no mistaken self or mistakenness in these things and the practice of forbearance gives rise to high and low marks.",
        "source": "T11n0316_025:0843b17_9"
    },
    {
        "source_sentence": "又此忍辱非實究竟，謂於是法我能解脫、彼非解脫，於忍辱行而非相應。",
        "translation": "Furthermore, this patience is not really the ultimate: that is to say, when I am able to liberate myself from these things and they are not liberated, it is not conjoined with patience or humility.",
        "source": "T11n0316_025:0843b19_10"
    },
    {
        "source_sentence": "又此忍辱亦非究竟，謂於是法我居正道、彼非正道，於忍辱行生二種相。",
        "translation": "Also, this forbearance isn't perfect, meaning that there are two kinds of characteristics that arise from the practice of forbearance with respect to self-abiding in the right path and those who don't follow it.",
        "source": "T11n0316_025:0843b20_11"
    },
    {
        "source_sentence": "又此忍辱非實究竟，謂於是法於空能忍、於見非忍，於無相中而能忍受、於有相中而不能忍，",
        "translation": "Furthermore, this patience is not really the ultimate. That is to say, a certain doctrine can tolerate emptiness and what is not tolerated in regard to views; it can tolerate signlessness but cannot tolerate signlessness.",
        "source": "T11n0316_025:0843b22_12"
    },
    {
        "source_sentence": "若於無願無求而皆能忍、於有願有求而不能忍，若於無積集攀緣而能忍受、於有積集攀緣而不能忍，",
        "translation": "If they are able to tolerate wishlessness without seeking and cannot tolerate wishes, if they can tolerate the clinging of accumulation without accumulation and cannot tolerate the clinging of accumulation with accumulation,",
        "source": "T11n0316_025:0843b24_13"
    },
    {
        "source_sentence": "若於煩惱盡處而能忍受、於煩惱處而不能忍，又於善處而能忍受、於不善處而不能忍，",
        "translation": "If they can tolerate where the afflictions are ended and can’t tolerate where the afflictions are developed, if they can tolerate what’s good and can’t tolerate what’s bad,",
        "source": "T11n0316_025:0843b26_14"
    },
    {
        "source_sentence": "若於無過失處而能忍受、於有過失處而不能忍，若於無漏法而能忍受、於有漏法而不能忍，",
        "translation": "If they can tolerate faultless states and can't tolerate faulty states, or if they can tolerate uncontaminated states and can't tolerate contaminated states,",
        "source": "T11n0316_025:0843b28_15"
    },
    {
        "source_sentence": "若於出世間法而能忍受、於世間法而不能忍，若於清淨法而能忍受、於雜染法而不能忍，",
        "translation": "If they can tolerate transmundane phenomena and cannot tolerate mundane phenomena, if they can tolerate pure phenomena and cannot tolerate defiled phenomena,",
        "source": "T11n0316_025:0843c01_16"
    },
    {
        "source_sentence": "若於涅盤法而能忍受、於生死法而不能忍，此等忍辱有對治故非實究竟。",
        "translation": "If someone can tolerate the teaching of nirvāṇa and can't tolerate the teaching of birth-and-death, these forms of forbearance have antidotes, so they aren't really perfect.",
        "source": "T11n0316_025:0843c04_0"
    },
    {
        "source_sentence": "云何名為究竟忍辱？",
        "translation": "What's called ultimate forbearance?",
        "source": "T11n0316_025:0843c05_1"
    },
    {
        "source_sentence": "若能隨順空性，於見非見中，非有非無。",
        "translation": "If someone can follow the nature of emptiness, then what's seen and what's not seen is neither existent nor nonexistent.",
        "source": "T11n0316_025:0843c06_2"
    },
    {
        "source_sentence": "若能隨順空性，於有願有求及無願無求，非有非無。",
        "translation": "If someone can follow the nature of emptiness, then there's desire for existence and no desire for existence and no desire for nonexistence, neither existent nor nonexistent.",
        "source": "T11n0316_025:0843c07_3"
    },
    {
        "source_sentence": "若能隨順空性，於積集攀緣中，非有非無。",
        "translation": "If someone can follow the nature of emptiness, they're neither existent nor nonexistent in accumulating and clinging to conditions.",
        "source": "T11n0316_025:0843c08_4"
    },
    {
        "source_sentence": "若能隨順空性，於清淨法及雜染法，非有非無。",
        "translation": "If someone can follow the nature of emptiness, they'll be neither existent nor nonexistent in pure dharmas and defiled dharmas.",
        "source": "T11n0316_025:0843c09_5"
    },
    {
        "source_sentence": "若能隨順空性，於善不善法，非有非無。",
        "translation": "If someone can follow the nature of emptiness, good and unskillful things are neither existent nor nonexistent.",
        "source": "T11n0316_025:0843c10_6"
    },
    {
        "source_sentence": "若能隨順空性，於諸過失及非過失，非有非無。",
        "translation": "If they can follow the nature of emptiness, then what's faulty and what's not faulty is neither existent nor nonexistent.",
        "source": "T11n0316_025:0843c11_7"
    },
    {
        "source_sentence": "若能隨順空性，於諸行中及涅盤法，非有非無。",
        "translation": "If they can follow the nature of emptiness, there's neither existence nor nonexistence in all conditioned states and nirvāṇa dharmas.",
        "source": "T11n0316_025:0843c12_8"
    },
    {
        "source_sentence": "是名究竟忍辱。",
        "translation": "This is called the ultimate forbearance.",
        "source": "T11n0316_025:0843c13_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0316_025:0843c13_10"
    },
    {
        "source_sentence": "謂過去未來見在諸法皆不生故，眾緣無盡、忍辱無盡。",
        "translation": "It means that the views of the past and future won't arise in all dharmas, so the conditions are inexhaustible and the forbearance is inexhaustible.",
        "source": "T11n0316_025:0843c13_11"
    },
    {
        "source_sentence": "若於是法，非有為非無為亦非和合，亦不增減亦無成壞，亦非作者亦非養者，",
        "translation": "If this dharma is neither conditioned nor unconditioned, neither compounded nor conjoined, neither increased nor diminished, neither formed nor disintegrated, neither created nor nurtured,",
        "source": "T11n0316_025:0843c15_0"
    },
    {
        "source_sentence": "彼不生故，是名無盡，說此是為真實忍辱。",
        "translation": "Because they don't arise, this is called inexhaustible, and it's said to be true forbearance.",
        "source": "T11n0316_025:0843c16_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0843c17_2"
    },
    {
        "source_sentence": "如是菩薩能行是行者，是名諸大菩薩摩訶薩忍辱波羅蜜多。",
        "translation": "Such a bodhisattva who can practice this practice is called the great bodhisattva-mahāsattva's perfection of tolerating humility.",
        "source": "T11n0316_025:0843c17_3"
    },
    {
        "source_sentence": "若彼菩薩摩訶薩能行是菩薩相應行時，一切魔王及魔眷屬作諸魔事及諍訟等皆悉不現，",
        "translation": "If those bodhisattvas and mahāsattvas can practice these bodhisattva-associated practices, all the demon kings and their demon retinues who do demonic deeds and disputes won't show them.",
        "source": "T11n0316_025:0843c19_4"
    },
    {
        "source_sentence": "是名菩薩摩訶薩成就最上忍辱波羅蜜多。",
        "translation": "This is called the bodhisattva-mahāsattva's accomplishment of the supreme perfection of forbearance.",
        "source": "T11n0316_025:0843c21_5"
    },
    {
        "source_sentence": "◎◎精進波羅蜜多品第九之一「復次舍利子！",
        "translation": "Śāriputra, the ninth part of the ninth chapter of the perfection of effort!",
        "source": "T11n0316_025:0843c22_6"
    },
    {
        "source_sentence": "云何名為菩薩摩訶薩精進波羅蜜多？」",
        "translation": "What is called the bodhisattva-mahāsattva's perfection of effort?",
        "source": "T11n0316_025:0843c24_7"
    },
    {
        "source_sentence": "佛言舍利子：「菩薩摩訶薩修精進波羅蜜多相應行時，先令魔事隱沒不現。",
        "translation": "The Buddha said to Śāriputra, When bodhisattvas and mahāsattvas cultivate the practice associated with the perfection of effort, they first cause demonic things to be hidden and not manifested.",
        "source": "T11n0316_025:0843c25_8"
    },
    {
        "source_sentence": "次當發起不退具足勇猛精進，不惜身命堅固勇捍志求修習此菩薩藏正法明文，",
        "translation": "“Then the enlightening being Universally Good, having undertaken this practice, will not turn away from it; he will become firm in body and life, unshakably determined, resolute, courageous, brave, and determined.",
        "source": "T11n0316_025:0843c26_9"
    },
    {
        "source_sentence": "復能書寫受持聽聞讀誦，解其義趣為人解說。",
        "translation": "They can also write, memorize, hear, read, and recite it, understand its meaning and explain it for others.",
        "source": "T11n0316_025:0843c28_10"
    },
    {
        "source_sentence": "又菩薩摩訶薩於諸契經，亦復教人聽聞書寫受持讀誦，解其義趣為他人說。",
        "translation": "Also, the bodhisattva Mahāsattva also teaches people to hear, write, memorize, retain, recite, understand, and explain its meaning for others.",
        "source": "T11n0316_025:0843c29_11"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844a02_12"
    },
    {
        "source_sentence": "譬如有人行真實行，執持種種金剛器仗與百人戰而無怯懼，勇捍敵眾不惜身命。",
        "translation": "It's like a person practicing true practice who holds various vajra weapons and fights with a hundred people without fear, and their courageous opponents don't spare their lives.",
        "source": "T11n0316_025:0844a02_13"
    },
    {
        "source_sentence": "菩薩摩訶薩行精進行亦復如是，應當堅固發起最上精進，志求菩薩藏正法曾無棄捨，",
        "translation": "In much the same way, great enlightening beings’ practice of energy should be firmly undertaken: they should generate the highest effort and never give up their efforts in order to seek the true Teaching of the store of enlightening beings.",
        "source": "T11n0316_025:0844a04_14"
    },
    {
        "source_sentence": "發勝解行不退精進。",
        "translation": "He gives rise to the practice of resolute resolve and doesn't regress in effort.",
        "source": "T11n0316_025:0844a06_15"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_025:0844a08_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩行堅固精進行時，不惜身命，所有三千大千世界中卵生胎生濕生化生、有色無色有想無想、非有想非無想，",
        "translation": "“When great enlightening beings practice steadfast effort, they do not give up their bodies and lives. In all the great chiliocosms in which there are sentient beings born from eggs, wombs, wetlands, and apparitional beings, those with form and formlessness, those who have ideation and those without ideation, and those neither with ideation nor",
        "source": "T11n0316_025:0844a08_1"
    },
    {
        "source_sentence": "乃至墮於有情數者，於一剎那、一臘縛、一牟呼栗多，如是展轉滿一劫已，",
        "translation": "If someone falls into the category of sentient beings, for one moment, one kalpa, one waxing and waning, or one muhūrta, they'll go on like this for an eon.",
        "source": "T11n0316_025:0844a11_2"
    },
    {
        "source_sentence": "往昔已來未曾受生，今始受生獲得人身，亦當精進讀誦受持，乃至為人演說令他受持。",
        "translation": "They've never received birth in the past, and now they're newly born to attain a human body, so they should also diligently recite it and memorize it, even expounding it for others so that they'll memorize it.",
        "source": "T11n0316_025:0844a12_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844a14_4"
    },
    {
        "source_sentence": "我今樂說譬喻以明斯義。",
        "translation": "Now, I'd like to explain this meaning by using metaphors.",
        "source": "T11n0316_025:0844a15_0"
    },
    {
        "source_sentence": "譬如有人行真正行，執持利劍能禦惡友及斷身命而得全勝。",
        "translation": "It's like a person who practices true practice and holds a sharp sword that can defeat bad friends and cut off body and life and attain complete victory.",
        "source": "T11n0316_025:0844a15_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844a17_0"
    },
    {
        "source_sentence": "彼菩薩摩訶薩亦復如是，一心發起勇猛精進無怖畏心，於菩薩藏正法悉能受持。",
        "translation": "Similarly, that bodhisattva Mahāsattva singlemindedly arouses courageous effort without fear and can fully retain the true teaching of the bodhisattva store.",
        "source": "T11n0316_025:0844a17_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844a19_2"
    },
    {
        "source_sentence": "菩薩摩訶薩而能具足不退轉地精進之行，復能速疾具足無量精進之力，",
        "translation": "“Great enlightening beings can perfect the practice of effort in the stage of nonregression, and they can also quickly perfect the power of immeasurable effort.",
        "source": "T11n0316_025:0844a19_3"
    },
    {
        "source_sentence": "所謂淨心勇猛、持戒勇猛、忍辱勇猛、精進勇猛、三摩地勇猛、勝慧勇猛、勝行勇猛。",
        "translation": "They are the courage of pure mind, the courage of observance of precepts, the courage of tolerance, the courage of effort, the courage of samādhi, the courage of superior wisdom, and the courage of superior practice.",
        "source": "T11n0316_025:0844a20_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844a22_5"
    },
    {
        "source_sentence": "菩薩摩訶薩雖能如是起諸勇猛，曾無一念起殺害意，非如惡友起勇猛心而能殺害。",
        "translation": "Although bodhisattvas and mahāsattvas can thus give rise to such courageous thoughts, they never give rise to the intention to kill with a single thought, just as bad friends give rise to the intention to be courageous but are unable to kill.",
        "source": "T11n0316_025:0844a23_0"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_025:0844a25_0"
    },
    {
        "source_sentence": "我說此菩薩摩訶薩猶如梵王、如天帝釋、如妙高山而無動搖，大慈大悲及善勝解，",
        "translation": "“I teach that these great enlightening beings are like Brahma, like Indra, like the emperor of gods, like beautiful mountains, unmoving, with great benevolence, great compassion, and understanding.",
        "source": "T11n0316_025:0844a25_1"
    },
    {
        "source_sentence": "復能通達不退轉地神通境界，善知有情種種心行，心如大地一切平等，",
        "translation": "They can also perceive the sphere of mystic knowledge of the stage of nonregression. They know the various mental patterns of sentient beings, and their minds are like the great earth, equal in all ways.",
        "source": "T11n0316_025:0844a27_2"
    },
    {
        "source_sentence": "如水火風及虛空等心皆平等，復能除滅貪瞋癡等一切過失。",
        "translation": "Just as water, fire, wind, air and space are all equal in mind, it can also remove all the faults of craving, anger, delusion, and so forth.",
        "source": "T11n0316_025:0844a28_3"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_025:0844b02_0"
    },
    {
        "source_sentence": "菩薩摩訶薩譬如殑伽沙數世界滿中七寶持用布施，不如聞是大乘菩薩藏正法精進思惟而能修行，",
        "translation": "“Furthermore, the great enlightening beings are like the seven jewels that fill as many worlds as there are grains of sand in the Ganges River:",
        "source": "T11n0316_025:0844b02_1"
    },
    {
        "source_sentence": "得成阿耨多羅三藐三菩提果。",
        "translation": "They attain the fruit of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_025:0844b04_2"
    },
    {
        "source_sentence": "諸菩薩摩訶薩等，應當寂靜思惟如是修學。",
        "translation": "All bodhisattvas, mahāsattvas, and so forth should quietly contemplate and cultivate it in this way.",
        "source": "T11n0316_025:0844b05_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844b06_4"
    },
    {
        "source_sentence": "菩薩摩訶薩若能如是廣大隨順修學，即得圓滿無量廣大善根。",
        "translation": "If a bodhisattva-mahāsattva can thus cultivate this extensive and compliant cultivation, he'll attain the fulfillment of measureless and vast good roots.",
        "source": "T11n0316_025:0844b06_5"
    },
    {
        "source_sentence": "由聞如是精進波羅蜜多，而能成就最勝妙果。",
        "translation": "By hearing such a perfection of effort, they'll be able to achieve the most excellent and marvelous result.",
        "source": "T11n0316_025:0844b08_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0316_025:0844b09_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844b09_2"
    },
    {
        "source_sentence": "決定愛樂阿耨多羅三藐三菩提故。",
        "translation": "It's because they are certain to delight in unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_025:0844b09_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844b10_4"
    },
    {
        "source_sentence": "菩薩摩訶薩於菩薩藏正法中，為由聽聞讀誦書寫受持為人演說，應當發起勇猛精進。",
        "translation": "Because the bodhisattva Mahāsattva hears, recites, writes, retains, and teaches the true teaching of the bodhisattva store, he or she should give rise to courageous effort.",
        "source": "T11n0316_025:0844b10_5"
    },
    {
        "source_sentence": "如是展轉於諸險難，亦當固往而無勞苦。",
        "translation": "In this way, they will proceed in all the dangers and difficulties. They will also certainly go there without suffering or trouble.",
        "source": "T11n0316_025:0844b12_6"
    },
    {
        "source_sentence": "云何難去能去？",
        "translation": "How is it difficult to leave and be able to leave?",
        "source": "T11n0316_025:0844b13_7"
    },
    {
        "source_sentence": "所謂妙趣涅盤，令魔波旬不能得便。",
        "translation": "It's called the marvelous destiny of nirvāṇa, which makes Māra Pāpīyān unable to get an advantage over it.",
        "source": "T11n0316_025:0844b13_8"
    },
    {
        "source_sentence": "說是菩薩正士修相應行者，勇猛精進為求如是三乘涅盤之道。",
        "translation": "When it's said that this is the bodhisattva or correct person who cultivates associated practices, his courageous effort is to seek the path of nirvāṇa of these three vehicles.",
        "source": "T11n0316_025:0844b14_9"
    },
    {
        "source_sentence": "於三惡趣，令諸有情於雜染法而能斷除，於持戒忍辱諸波羅蜜多，多聞修習而求出離。",
        "translation": "In the three bad destinies, they cause sentient beings to be able to remove the defiled dharmas and seek escape from them by hearing and cultivating the perfections of observing precepts and forbearance.",
        "source": "T11n0316_025:0844b16_0"
    },
    {
        "source_sentence": "若有有情行非善業及諸懈怠，應生憐慜，皆悉令發勇猛精進。",
        "translation": "If there are sentient beings who perform unwholesome actions and lazy acts, they should be saddened and cause them all to give rise to courageous effort.",
        "source": "T11n0316_025:0844b18_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844b19_1"
    },
    {
        "source_sentence": "菩薩摩訶薩諸智增者，於懈怠有情或當遠離，於精進有情或當共住。",
        "translation": "When the bodhisattva Mahāsattva's knowledge increases, he might part with lazy sentient beings and live together with effortless sentient beings.",
        "source": "T11n0316_025:0844b19_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0316_025:0844b21_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844b21_4"
    },
    {
        "source_sentence": "唯求涅盤最上第一清淨解脫。",
        "translation": "They only seek the supreme, first pure liberation of nirvāṇa.",
        "source": "T11n0316_025:0844b21_5"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844b22_6"
    },
    {
        "source_sentence": "又菩薩摩訶薩行精進波羅蜜多時，亦令一切有情而共行之，復能利樂一切有情，",
        "translation": "“Furthermore, when great enlightening beings practice the transcendent ways of effort, they also cause all sentient beings to practice them together, and they can further benefit all sentient beings.",
        "source": "T11n0316_025:0844b22_7"
    },
    {
        "source_sentence": "善說正行普令覺悟，為令引入無上道故。」",
        "translation": "He well explains right practice so that they'll all awaken, and it's because he wants to lead them into the unsurpassed path.",
        "source": "T11n0316_025:0844b24_8"
    },
    {
        "source_sentence": "「勇猛精進悉無礙，　　常得尊高無與等，",
        "translation": "Their courageous effort is unhindered, And they always attain peerless honor.",
        "source": "T11n0316_025:0844b25_9"
    },
    {
        "source_sentence": "　於菩薩藏正法中，　　稱為任持大智者。",
        "translation": "In the enlightening being’s treasury of truth, They are called those who preserve great knowledge.",
        "source": "T11n0316_025:0844b25_9"
    },
    {
        "source_sentence": "　思惟無上正法義，　　得不思議智慧門，",
        "translation": "Thinking of the meaning of the supreme true teaching, They attain inconceivable knowledge and wisdom.",
        "source": "T11n0316_025:0844b25_9"
    },
    {
        "source_sentence": "　復於正法求出離，　　當獲如來親授記。",
        "translation": "Furthermore, if you seek escape from the right teaching, you'll be given a prediction by the Tathāgata himself.",
        "source": "T11n0316_025:0844b25_9"
    },
    {
        "source_sentence": "　勇猛修習大勝慧，　　坐菩提樹正思惟，",
        "translation": "Courageously cultivating great transcendent wisdom, They sit on the tree of enlightenment And meditate correctly.",
        "source": "T11n0316_025:0844b25_9"
    },
    {
        "source_sentence": "　令諸魔怖悉退伏，　　由持智慧精進力。",
        "translation": "Causing all the fears of demons to completely retreat, it's because of the power of maintaining wisdom and energy.",
        "source": "T11n0316_025:0844b25_9"
    },
    {
        "source_sentence": "　普現一切戒清淨，　　世間事業盡能習，",
        "translation": "Universally manifesting all precepts pure, They can practice them in all worldly undertakings.",
        "source": "T11n0316_025:0844b25_9"
    },
    {
        "source_sentence": "　復能利樂諸有情，　　具足精進無損減。」",
        "translation": "It's also able to benefit sentient beings, fully exerting effort without loss or gain.",
        "source": "T11n0316_025:0844b25_9"
    },
    {
        "source_sentence": "爾時世尊說伽陀曰：佛告舍利子：「我滅度後後五百歲，若有有情行是行時，",
        "translation": "It was then that the Bhagavat spoke these verses: The Buddha said to Śāriputra, “Five hundred years after my parinirvāṇa, if there are any sentient beings who practice in this way,",
        "source": "T11n0316_025:0844b25_9"
    },
    {
        "source_sentence": "於諸契經愛樂受持，當得無量勝慧福聚富貴尊嚴，及得如來十力、四無所畏、四正斷法、慈悲喜捨、佛十八不共法乃至一切佛法，",
        "translation": "They will love the scriptures, delight in memorizing them, and attain immeasurable superior wisdom, merit, wealth, prosperity, and honor as well as the ten powers of buddhahood, the four fearlessnesses, the four principles of right elimination, kindness, compassion, joy, and equanimity, the eighteen unique qualities of buddhas, and all",
        "source": "T11n0316_025:0844c06_10"
    },
    {
        "source_sentence": "總略而聚各各明了。",
        "translation": "They are summarized, and each group clearly understands it.",
        "source": "T11n0316_025:0844c09_11"
    },
    {
        "source_sentence": "心得清淨除遣魔事，令諸有情盡生死苦向涅盤道，復於彼時諸違順境一切棄捨。",
        "translation": "Their minds are purified, they remove demonic deeds, cause sentient beings to end the suffering of birth and death and head for the path of nirvāṇa, and at that point, they abandon all objects that are contrary to them.",
        "source": "T11n0316_025:0844c09_12"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844c11_13"
    },
    {
        "source_sentence": "若於彼時諸有情類智慧相應善巧方便，求進阿耨多羅三藐三菩提，修持淨戒、常樂多聞、習諸禪定、修智慧業及勝解脫、解脫知見進求佛法，",
        "translation": "“Furthermore, if those sentient beings at that time skillfully and expediently seek to advance to unexcelled complete perfect enlightenment, cultivating pure morality, always delighting in learning, practicing meditations, cultivating wisdom, action, liberation, the knowledge and vision of liberation, and seeking the buddha-dharma,",
        "source": "T11n0316_025:0844c11_14"
    },
    {
        "source_sentence": "及樂利樂一切有情，斷除邪見樂求正見出離輪回，修行聖道演說正法。",
        "translation": "It's the joy of benefiting all sentient beings, stopping wrong views, seeking right views, escaping rebirth, cultivating the noble path, and expounding the right teaching.",
        "source": "T11n0316_025:0844c14_15"
    },
    {
        "source_sentence": "復於彼時破諸魔障，令貪瞋癡悉皆除滅，斷無明暗令生明慧。",
        "translation": "Again, at that point, he breaks through the demonic hindrances, removes craving, anger, and delusion, ends the darkness of ignorance, and produces insight.",
        "source": "T11n0316_025:0844c16_16"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844c18_0"
    },
    {
        "source_sentence": "如是之法若能聽受，即能生長一切善根，積集成就最上精進。",
        "translation": "If someone can hear and accept such a teaching, they'll be able to grow all good roots and accumulate them into the highest level of effort.",
        "source": "T11n0316_025:0844c18_1"
    },
    {
        "source_sentence": "若能如是聽聞正法，魔不得便，而於一切佛法之中不生疑惑。",
        "translation": "If someone can thus hear the right teaching, Māra won't get an advantage over them, and they won't have doubts or doubts about all the Buddha's teachings.",
        "source": "T11n0316_025:0844c19_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844c20_3"
    },
    {
        "source_sentence": "時彼有情福力具足內心正行，當得阿耨多羅三藐三菩提。",
        "translation": "Those sentient beings then have the power of merit and are fully endowed with right internal practice, and they'll attain unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_025:0844c21_4"
    },
    {
        "source_sentence": "又此有情於諸契經而能聽誦，愛樂受持極大歡喜，於菩薩藏正法受持讀誦修行成辦甚大歡喜，",
        "translation": "“Furthermore, those sentient beings who are able to hear and recite scriptures delight in receiving and upholding them. They receive, retain, read, recite, and practice the true teaching of the enlightening being’s treasury of knowledge with great joy.",
        "source": "T11n0316_025:0844c22_5"
    },
    {
        "source_sentence": "亦復如是，我說是人能於一切如來教中而得成就。",
        "translation": "Similarly, I say that such a person can accomplish all the Tathāgata's teachings.",
        "source": "T11n0316_025:0844c24_6"
    },
    {
        "source_sentence": "設復有人不專讀誦，以因緣故暫來聽受，作意愛樂生大歡喜，亦復獲得最上第一堅固精進。",
        "translation": "Suppose there's another person who doesn't concentrate on recitation, and for whatever reason they come to hear it for a while, their attention is delighted and becomes greatly joyous, and they also attain the highest, first, and most steadfast effort.",
        "source": "T11n0316_025:0844c25_7"
    },
    {
        "source_sentence": "乃至如是於菩薩藏正法真實微妙行相，能以少分為他人說。",
        "translation": "Even so, they can teach the true and subtle practice of the bodhisattva collection of right teachings in a way that's limited to others.",
        "source": "T11n0316_025:0844c28_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0844c29_1"
    },
    {
        "source_sentence": "譬如大海水中有成熟果色香具足漂浮水上，有一丈夫見如是果，起大勇猛精進勝行入大海中，",
        "translation": "Suppose there's a ripened fruit in the great ocean water that floats on the surface of water with its color, shape, and fragrance. A man who sees such a fruit arouses great courageous effort and enters the ocean with great heroic effort.",
        "source": "T11n0316_025:0844c29_2"
    },
    {
        "source_sentence": "見水暴涌不顧沈溺，復以二手持取其果，或一或二或取三果而出大海。",
        "translation": "Seeing the water rushing, he doesn't look out to drown, and with his hand holding the fruit in his hand, he takes either one, two, or three fruits and emerges from the ocean.",
        "source": "T11n0316_025:0845a02_3"
    },
    {
        "source_sentence": "然後詣彼寂靜之處觀看是果，乃甞其味。",
        "translation": "Then he went to that quiet place and looked at the fruit, tasted its taste.",
        "source": "T11n0316_025:0845a04_4"
    },
    {
        "source_sentence": "復自念言：『我於往昔未識是果，色香美味亦復不知。』",
        "translation": "Again, he thought to himself, 'In the past, I didn't know this fruit; nor did I know its color, odor, taste, and deliciousness.'",
        "source": "T11n0316_025:0845a05_5"
    },
    {
        "source_sentence": "又作是念：『發大勇猛復往大海再取其果。』",
        "translation": "Again, he thought, 'He arouses great courage and goes back to the ocean to retrieve its fruit.'",
        "source": "T11n0316_025:0845a06_6"
    },
    {
        "source_sentence": "果乃不現，但見海水波濤暴涌，而生苦惱於時退還。",
        "translation": "The fruit didn't show up, but he saw the waves and violently rising waves in the water and retreated with pain and distress at the time.",
        "source": "T11n0316_025:0845a07_7"
    },
    {
        "source_sentence": "然念是果色香美味殊妙可愛，我於先時悔不多取。",
        "translation": "Still, I'm mindful that the color, odor, taste, and deliciousness of these fruits are so marvelous and desirable that I didn't regret not taking them in the past.",
        "source": "T11n0316_025:0845a08_8"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845a09_9"
    },
    {
        "source_sentence": "我滅度後後五百歲法欲滅時，若有有情於布施持戒勝慧精進少能信解，",
        "translation": "“Fifty years after my parinirvāṇa, when the Dharma was about to cease, if there were any sentient beings who practiced generosity, observed precepts, and had superior wisdom and energy, few of them would believe in or understand it.",
        "source": "T11n0316_025:0845a10_0"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T11n0316_025:0845a11_1"
    },
    {
        "source_sentence": "以是因緣於諸契經，聽聞稱讚受持讀誦，為人演說乃至一四句偈，為魔波旬之所嬈惱，",
        "translation": "Because of these causes and conditions, they hear the scriptures, praise them, memorize and recite them, expound a single four-line verse for others, and are tormented by Māra Pāpīyān.",
        "source": "T11n0316_025:0845a11_2"
    },
    {
        "source_sentence": "不能建立受持讀誦、興顯供養種種稱讚，由如是故悉皆棄捨。",
        "translation": "They can't establish, memorize, recite, make offerings, and various praises, and because of this, they all abandon them.",
        "source": "T11n0316_025:0845a13_3"
    },
    {
        "source_sentence": "又復展轉少分聽聞讀誦稱讚受持，於寂靜處思惟修習，為魔得便，於一切處常令退屈。",
        "translation": "He also gradually hears, recites, praises, and retains a small part of it, contemplates and cultivates it in a quiet place for Māra to get an advantage over him, and always causes him to retreat from all places.",
        "source": "T11n0316_025:0845a15_4"
    },
    {
        "source_sentence": "時彼行人作如是言：『苦哉苦哉！",
        "translation": "The practitioner then said, 'How painful! How painful!'",
        "source": "T11n0316_025:0845a17_5"
    },
    {
        "source_sentence": "我於如來無上法中為減沒者，於真實法不令我等聽聞受持，乃至於牟呼栗多時思念如來正等正覺尚不能得。』",
        "translation": "Those who think that I'm inferior to the Tathāgata in terms of the unsurpassed teaching and don't allow us to hear and retain the true teaching, even though we still can't attain it when we contemplate the Tathāgata's righteousness and perfect enlightenment during the time of Mahūrya.'",
        "source": "T11n0316_025:0845a18_6"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_025:0845a21_0"
    },
    {
        "source_sentence": "又苾芻眾為魔所持，於諸契經不能聽聞讀誦。",
        "translation": "Furthermore, the monks are held by Māra, and they can't hear or recite the sūtras.",
        "source": "T11n0316_025:0845a21_1"
    },
    {
        "source_sentence": "時魔波旬現大眾前種種毀訾：『此諸契經非佛所說，但是世間虛假文飾。』",
        "translation": "Māra Pāpīyān then appeared before the crowd and disparaged them in various ways, saying, 'These sūtras aren't taught by the Buddha but are merely worldly, false texts adorned.'",
        "source": "T11n0316_025:0845a22_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845a24_0"
    },
    {
        "source_sentence": "彼大眾中有諸苾芻聞是語已，於一切處魔力所加，悉不聽受。」",
        "translation": "After those monks in the crowd heard these words, they won't listen or accept them because of the demonic powers applied everywhere by Māra.",
        "source": "T11n0316_025:0845a24_1"
    },
    {
        "source_sentence": "「若人聞是正法已，　　令諸魔眾悉遠離，",
        "translation": "“If someone hears this right teaching, They’ll cause the Māras to be completely freed.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "　而於一切佛法中，　　決定信解除疑惑。",
        "translation": "Yet in all the Buddha’s teachings They are certain to have faith And rid themselves of doubt and confusion.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "　若或薄福諸有情，　　於此正法不能聽，",
        "translation": "Those with little virtue Are unable to hear the Teaching, And those who do not practice it.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "　為彼有情薄福故，　　聞亦不能生信解。",
        "translation": "Because those sentient beings are weak in virtue, even hearing it doesn't give rise to faith and understanding.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "　或有具足福力者，　　聽聞受持生信解，",
        "translation": "Or there are those endowed with the power of virtue Who, hearing and retaining [the teaching], develop faith and understanding.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "　於此正法少聽聞，　　能遣一切諸魔事。",
        "translation": "With little hearing or hearing of this true teaching, they can dispel all demonic deeds.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "　如是薄福諸有情，　　於此正法不生信，",
        "translation": "Such poorly endowed sentient beings Do not give rise to faith in this true teaching.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "　以不信故墮惡趣，　　猶如生盲無所見。",
        "translation": "Because they don't believe it, they'll fall into a bad destiny like being born blind and not seeing anything.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "　若有具足福力者，　　於此正法深信解，",
        "translation": "If there is anyone endowed with the power of virtue, They will deeply believe and understand this true teaching.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "　以深信故生善趣，　　速疾猶若酥投水。",
        "translation": "Because of their deep faith, they're born in a good destiny, which is as quick as throwing butter into water.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "　一類少福諸有情，　　聞法展轉生煩惱，",
        "translation": "A certain kind of sentient being with little virtue hears the teaching and develops afflictions in turn.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "　彼人長夜受苦惱，　　為愚癡故不解脫，",
        "translation": "That person suffers pain and suffering for a long time, but because of their folly they aren’t liberated.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "　於佛菩提悉棄捨，　　速疾墮落惡趣中。",
        "translation": "Abandoning all of the Buddha’s enlightenment, They will quickly fall into evil states.",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "爾時世尊說伽陀曰：「舍利子！",
        "translation": "It was then that the Bhagavān spoke to Gadha, saying, Śāriputra!",
        "source": "T11n0316_025:0845a26_0"
    },
    {
        "source_sentence": "如來有清淨潔白智慧之法。",
        "translation": "The Tathāgata has a pure, clean, white, and wise dharma.",
        "source": "T11n0316_025:0845b11_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845b11_2"
    },
    {
        "source_sentence": "於四眾中，若有一類苾芻、苾芻尼、優婆塞、優婆夷，於如來滅後法欲滅時，",
        "translation": "Among the fourfold assembly, if there are any monks, nuns, laymen, and laymen of one type, who, at the time of the nirvana of the Tathāgata, want to bring about the nirvana of the Dharma after his nirvana,",
        "source": "T11n0316_025:0845b12_0"
    },
    {
        "source_sentence": "於諸契經聽聞讀誦愛樂受持者。",
        "translation": "He who hears, reads, recites, loves, and retains the sūtras.",
        "source": "T11n0316_025:0845b13_1"
    },
    {
        "source_sentence": "若有一類有情，於一切處不能愛樂受持讀誦者。",
        "translation": "Suppose there's a certain type of sentient being who can't delight in all places to receive, retain, and recite it.",
        "source": "T11n0316_025:0845b14_2"
    },
    {
        "source_sentence": "如來於彼一一了知。",
        "translation": "The Tathāgata knows them one by one.",
        "source": "T11n0316_025:0845b15_3"
    },
    {
        "source_sentence": "又諸有情於此契經，若能聽已發起正行如理修行，當獲四種具足清淨潔白無障礙法。",
        "translation": "Furthermore, if sentient beings can listen to this sūtra and give rise to right practice and correctly cultivate it, they'll attain four kinds of unobstructed qualities that are complete, pure, clean, and white.",
        "source": "T11n0316_025:0845b16_0"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_025:0845b18_0"
    },
    {
        "source_sentence": "一者獲得具足清淨潔白戒波羅蜜多無障礙法，二者獲得常遇如來見諸妙相具足清淨潔白無障礙法，",
        "translation": "One, they attain the unobstructed state of perfect purity and whiteness in the perfection of morality; two, they attain the unobstructed state of perfect purity and whiteness in the constant presence of buddhas who see their marvelous features.",
        "source": "T11n0316_025:0845b18_1"
    },
    {
        "source_sentence": "三者得見慈氏如來獲得具足清淨潔白無障礙法，四者獲得如理相應諸善根力具足清淨潔白無障礙法。",
        "translation": "Third, they'll see the Tathāgata Maitreya and attain the unobstructed state of being fully pure and white, and fourth, they'll attain the unobstructed state of being perfectly pure and white with the power of the good roots associated with reality.",
        "source": "T11n0316_025:0845b20_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845b23_3"
    },
    {
        "source_sentence": "獲得如是四種具足清淨潔白無障礙法。",
        "translation": "They attain these four kinds of perfect, pure, white, and unobstructed dharmas.",
        "source": "T11n0316_025:0845b23_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845b24_5"
    },
    {
        "source_sentence": "若我滅後法欲滅時，於大乘行如是行相修相應行者，發起殊勝精進之行，",
        "translation": "“When the self is about to perish and the dharmas that follow it are about to perish, those who practice Mahayana teachings in such a way as to cultivate concomitant practices will give rise to superior effort.",
        "source": "T11n0316_025:0845b24_6"
    },
    {
        "source_sentence": "復於契經受持讀誦，為人演說展轉聽受，時彼有情復有十種魔事，智者應當悉皆了知，",
        "translation": "Again, there are ten kinds of demonic acts that those sentient beings experience when they memorize and recite the scriptures, expound them for others, and listen to them one after another. The wise should know all of these.",
        "source": "T11n0316_025:0845b26_7"
    },
    {
        "source_sentence": "於此魔事不應隨順，轉復發起勇猛精進成辦佛事。",
        "translation": "They shouldn't follow these demonic deeds, and they must furthermore give rise to courageous effort to accomplish the Buddha's work.",
        "source": "T11n0316_025:0845b28_8"
    },
    {
        "source_sentence": "何等名為十種魔事？",
        "translation": "What are these ten kinds of demonic acts?",
        "source": "T11n0316_025:0845b29_9"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845b29_10"
    },
    {
        "source_sentence": "若有苾芻於諸契經發起樂欲受持讀誦，時魔波旬而來嬈惱，此是第一魔事，",
        "translation": "If a monk desires to memorize and recite the scriptures with pleasure, then Māra Pāpīyān will come and disturb them. This is the first demonic act.",
        "source": "T11n0316_025:0845c01_0"
    },
    {
        "source_sentence": "智者應當於此了知，不應隨順。",
        "translation": "A wise person should understand this and not follow it.",
        "source": "T11n0316_025:0845c02_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845c03_2"
    },
    {
        "source_sentence": "若有苾芻於諸契經發起樂欲受持讀誦，時魔波旬而來嬈惱，令諸眼目生諸疾病，",
        "translation": "If a monk desires to memorize and recite the scriptures with pleasure, then Māra Pāpīyān will come and harass him, causing his eyes and eyes to become sick.",
        "source": "T11n0316_025:0845c03_3"
    },
    {
        "source_sentence": "此是第二魔事，智者應當於此了知，不應退屈。",
        "translation": "This is the second demonic deed, which wise people should understand and not regress from.",
        "source": "T11n0316_025:0845c05_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845c06_5"
    },
    {
        "source_sentence": "若有苾芻於諸契經發起樂欲受持讀誦，時魔波旬而來嬈惱，令其身分生諸病苦，",
        "translation": "If there is a bhikṣu who gives rise to delight in the scriptures and desires to memorize and recite them, then Māra Pāpīyān will come and harass him, causing illness and suffering to arise in his body.",
        "source": "T11n0316_025:0845c06_6"
    },
    {
        "source_sentence": "此是第三魔事，智者應當於此了知，不應退屈。",
        "translation": "This is the third demonic deed that wise people should know about and not regress from.",
        "source": "T11n0316_025:0845c08_7"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845c09_8"
    },
    {
        "source_sentence": "若有苾芻於諸契經發起樂欲受持讀誦，令心散亂不樂本住，此是第四魔事，",
        "translation": "If a monk gives rise to the desire to memorize and recite scriptures, causing his mind to be distracted and unhappy with their original abode, this is the fourth demonic condition.",
        "source": "T11n0316_025:0845c10_0"
    },
    {
        "source_sentence": "智者應當於此了知，不應隨順。",
        "translation": "A wise person should understand this and not follow it.",
        "source": "T11n0316_025:0845c11_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845c12_2"
    },
    {
        "source_sentence": "若有苾芻於諸契經發起樂欲受持讀誦，令其發起極忿怒心互相諍競，令諸契經不能安立，",
        "translation": "If there are monks who give rise to delight in the scriptures and desire to memorize and recite them, it will cause them to give rise to a mind of extreme anger that competes with each other and prevents the scriptures from being established.",
        "source": "T11n0316_025:0845c12_3"
    },
    {
        "source_sentence": "此是第五魔事，智者應當於此了知，不應隨順。",
        "translation": "This is the fifth demonic deed, which wise people should understand and not follow.",
        "source": "T11n0316_025:0845c14_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845c15_5"
    },
    {
        "source_sentence": "若有苾芻於諸契經發起樂欲受持讀誦，令其互相執持鬪諍俱陷王難，起惡語言利如毒箭更相損害，",
        "translation": "If there are monks who give rise to delight in the scriptures and want to memorize and recite them, causing each other to cling to fight and fall into a king's difficulty, producing harmful words as powerful as poisonous arrows that will further harm each other.",
        "source": "T11n0316_025:0845c16_0"
    },
    {
        "source_sentence": "如是行相令諸契經不得流通，由鬪諍業速疾退轉，此是第六魔事，智者應當於此了知，",
        "translation": "This is the sixth deed of Māra, which should be known by wise people.",
        "source": "T11n0316_025:0845c18_1"
    },
    {
        "source_sentence": "不應隨順。",
        "translation": "They shouldn't follow it.",
        "source": "T11n0316_025:0845c20_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845c20_3"
    },
    {
        "source_sentence": "若有苾芻於諸契經發起樂欲受持讀誦，時魔波旬而來誨誘住白衣舍，復令發起種種鬪訟，",
        "translation": "If there are monks who give rise to the pleasure of memorizing and reciting scriptures, then Māra Pāpīyān will come and instruct them to live in a white-robed dwelling, and also cause them to give rise to various kinds of quarrels and arguments.",
        "source": "T11n0316_025:0845c20_4"
    },
    {
        "source_sentence": "如是行相於諸契經不能受持、令生誹謗，由鬪訟業速疾破壞，此是第七魔事，",
        "translation": "This is the seventh demonic deed of those who practice in such a way that they are unable to memorize scriptures and cause others to slander them, and by engaging in quarrels and disputes they quickly break down.",
        "source": "T11n0316_025:0845c22_5"
    },
    {
        "source_sentence": "智者應當於此了知，不應隨順。",
        "translation": "A wise person should understand this and not follow it.",
        "source": "T11n0316_025:0845c24_6"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0845c25_7"
    },
    {
        "source_sentence": "於彼時分法欲滅時，或有少年諸苾芻眾於此法中出家未久，於諸契經愛樂受持堅固信解，",
        "translation": "At the time, when the partial teaching was about to cease, some young monks hadn't renounced home for a long time in this teaching, and they were fond of accepting and upholding scriptures and firmly believed in them.",
        "source": "T11n0316_025:0845c25_8"
    },
    {
        "source_sentence": "發阿耨多羅三藐三菩提心。",
        "translation": "He arouses the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_025:0845c27_9"
    },
    {
        "source_sentence": "時彼苾芻聞是經已，得大歡喜。",
        "translation": "After hearing this sūtra, that monk was greatly delighted.",
        "source": "T11n0316_025:0845c28_10"
    },
    {
        "source_sentence": "彼親教師乃語少年諸苾芻言：『此非佛菩提、非佛法律，不應受持。』",
        "translation": "The relative teacher then said to the young monks, 'This isn't the Buddha's enlightenment or the Buddha's teaching, so you shouldn't accept and uphold it.'",
        "source": "T11n0316_025:0845c29_11"
    },
    {
        "source_sentence": "時諸苾芻聞是語已，於少時間於佛菩提而不信受。",
        "translation": "After hearing these words, the monks didn't believe in the Buddha's enlightenment for a little while.",
        "source": "T11n0316_025:0846a01_12"
    },
    {
        "source_sentence": "又彼苾芻互相謂言：『我昔修習佛菩提法，今令我等不樂修習。』",
        "translation": "Again, those monks said to each other, 'In the past, I cultivated the Buddha's teaching of enlightenment, but now I won't be able to cultivate it.'",
        "source": "T11n0316_025:0846a02_13"
    },
    {
        "source_sentence": "所有往昔諸善根力使當斷滅，返令如是墮染法中，乃至命終生諸惡趣受大苦惱。",
        "translation": "The power of the good roots that they had in the past will be cut off, and they'll return to fall into defiled dharmas like this, even up to being born in bad destinies at the end of their life and suffering great pain and suffering.",
        "source": "T11n0316_025:0846a04_14"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0846a06_0"
    },
    {
        "source_sentence": "應知此等是魔所說，如是積集諸地獄業。",
        "translation": "You should know that these are what Māra teaches, thus accumulating the actions of hell.",
        "source": "T11n0316_025:0846a06_1"
    },
    {
        "source_sentence": "諸有情等毀謗三寶不順佛言，如來於三世中悉能了知。",
        "translation": "Sentient beings and so forth disparage the Three Treasures and don't follow the Buddha's words, and the Tathāgata can fully understand them in the three times.",
        "source": "T11n0316_025:0846a07_2"
    },
    {
        "source_sentence": "又諸有情發起精進修大乘行，如來於此亦能了知。",
        "translation": "Furthermore, sentient beings give rise to the practice of diligently cultivating the great vehicle, which the Tathāgata can also understand.",
        "source": "T11n0316_025:0846a08_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_025:0846a09_4"
    },
    {
        "source_sentence": "我今又令諸菩薩等起四種想。",
        "translation": "Now, I'll cause bodhisattvas and others to give rise to four kinds of conceptions.",
        "source": "T11n0316_025:0846a09_5"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_025:0846a10_6"
    },
    {
        "source_sentence": "一者於自身業而善調伏，二者於善修作而妙觀察，三者於他所作不樂觀察、於諸有情起大悲心，",
        "translation": "The first is to discipline one’s own actions; the second is to contemplate well-cultivated practices; the third is to meditate on what others do without delight; and the fourth is to develop great compassion toward sentient beings.",
        "source": "T11n0316_025:0846a10_7"
    },
    {
        "source_sentence": "四者於空寂處行住坐臥、於自他心隨順防護。",
        "translation": "The fourth is to guard one’s own mind and the minds of others while walking, standing, sitting, or lying in an empty place.",
        "source": "T11n0316_025:0846a12_8"
    },
    {
        "source_sentence": "如是名為起四種想。",
        "translation": "Thus, these are called the four kinds of conceptions that arise.",
        "source": "T11n0316_025:0846a14_0"
    },
    {
        "source_sentence": "佛說大乘菩薩藏正法經卷第二十五",
        "translation": "Foshuo daishi pusa zhengfa jing, vol. 25",
        "source": "T11n0316_025:0846a15_0"
    }
]