[
    {
        "source_sentence": "大寶積經卷第六十九",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 69",
        "source": "T11n0310_069:0389c06_0"
    },
    {
        "source_sentence": "北齊三藏那連提耶舍譯",
        "translation": "Northern Qi Tripiṭaka, translated by Nārāyaśas",
        "source": "T11n0310_069:0389c08_0"
    },
    {
        "source_sentence": "菩薩見實會第十六之九廣果天授記品第二十二爾時八億廣果諸天，見諸阿修羅、伽樓羅、龍及龍女、鳩槃茶、乾闥婆、夜叉、緊那羅、摩睺羅伽、訶羅伽闍天、四天王天、三十三天、夜摩天、兜率陀天、化樂天、他化自在天、梵摩天、光音天、遍淨天等供養如來，",
        "translation": "“Then the enlightening being Universally Good, seeing the buddhas of past, present, and future, said these verses: Enlightening beings see the reality assembly. Chapter 22: The Deliverance of the Teaching from the Nineteenth Heaven of Extensive Fruition At that time all the eighty-eight hundred million celestial kings of extensive fruit",
        "source": "T11n0310_069:0389c09_0"
    },
    {
        "source_sentence": "聞授記已，欣喜踊躍皆得稱心，入一一法門，從一一法門見無量法門，",
        "translation": "Having heard the prediction of enlightenment, they all rejoiced and jumped for joy. They entered into each teaching and from each teaching they saw innumerable teachings.",
        "source": "T11n0310_069:0389c15_1"
    },
    {
        "source_sentence": "於一切法門得無量辯、不斷辯、相應辯、解脫辯、無著辯、無礙辯、微細辯、甚深辯、種種辯、美妙辯、相續辯。",
        "translation": "In all the teachings, they attain measureless eloquence, inexhaustible eloquence, concomitant eloquence, liberating eloquence, unattached eloquence, unobstructed eloquence, subtle eloquence, profound eloquence, various eloquence, beautiful eloquence, and continuo",
        "source": "T11n0310_069:0389c17_2"
    },
    {
        "source_sentence": "於諸辯才皆悉知已，於如來所敬信尊重而作是言：「世尊！",
        "translation": "Knowing their eloquence, they all respected the Tathāgata and said, Bhagavān!",
        "source": "T11n0310_069:0389c19_3"
    },
    {
        "source_sentence": "有陀羅尼名無量門，若有菩薩修集是陀羅尼者，當知得彼不斷辯等，於一切境界中心不迷惑。",
        "translation": "There are dhāraṇīs called immeasurable approaches, and if a bodhisattva cultivates these dhāraṇīs, he should know that he attains their unceasing eloquence and so forth without confusion in the center of all objects.",
        "source": "T11n0310_069:0389c20_4"
    },
    {
        "source_sentence": "是諸境界無有一法非陀羅尼，是菩薩摩訶薩得是陀羅尼時，於諸法中悉得陀羅尼解辯才無礙。",
        "translation": "There's not a single thing in these realms that isn't a dhāraṇī, and when the bodhisattva Mahāsattva attains this dhāraṇī, he fully attains the unhindered power of understanding and eloquence of the dhāraṇī in all dharmas.",
        "source": "T11n0310_069:0389c22_5"
    },
    {
        "source_sentence": "若菩薩住是無量法門陀羅尼時，於五陰入、十二入入、十八界入，於諸根入、四諦入、十二因緣入，",
        "translation": "“When enlightening beings abide in these teachings of the Dharma-gate of Immeasurable Measurelessness, they enter into the five aggregates, the twelve kinds of entry, the eighteen elements, the faculties, the four truths, and the twelve causal conditions.",
        "source": "T11n0310_069:0389c25_6"
    },
    {
        "source_sentence": "於眾生入及非眾生入，於有入非有入，於取相入非取相入，於依入非依入，",
        "translation": "They are the sense-entry of sentient beings and the sense-entry of what is not sentient beings; they are the sense-entry of existence and the sense-entry of existencelessness; they are the sense-entry of apprehension and the sense-entry of non-apprehension with respect to that which exists. The sense-entry",
        "source": "T11n0310_069:0389c27_7"
    },
    {
        "source_sentence": "於空入，於我入，於相入非相入，於願入非願入，於有為入無為入，如是一切處得不壞辯才。",
        "translation": "He enters into emptiness, enters into self, enters into marks and what's not marks, enters into vows and what's not vows, enters into conditioned and unconditioned things, and thus attains indestructible eloquence in all places.",
        "source": "T11n0310_069:0389c29_8"
    },
    {
        "source_sentence": "是菩薩於陰入中得陀羅尼，所謂色陰者即非成就。",
        "translation": "This is the dhāraṇī that a bodhisattva attains in the aggregates and sense-fields, which are called form aggregates, which are not accomplished.",
        "source": "T11n0310_069:0390a02_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0390a03_10"
    },
    {
        "source_sentence": "無有少色法得成就者。",
        "translation": "There are no few form dharmas that can be accomplished.",
        "source": "T11n0310_069:0390a03_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0390a04_12"
    },
    {
        "source_sentence": "地地界性非成就。",
        "translation": "The earth element of earth is not accomplished by its own nature.",
        "source": "T11n0310_069:0390a04_13"
    },
    {
        "source_sentence": "如是水火風界性亦非成就。",
        "translation": "Thus, the nature of water, fire, and wind aren't accomplished either.",
        "source": "T11n0310_069:0390a04_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0390a05_15"
    },
    {
        "source_sentence": "地性離故，若法無體性是名非成就。",
        "translation": "Because the nature of earth is free from it, if a dharma has no essence, this is called not accompanied.",
        "source": "T11n0310_069:0390a05_16"
    },
    {
        "source_sentence": "如是水火風性自離故，以法無體性是故非成就。",
        "translation": "Thus, because the nature of water, fire, and wind are self-separated, it's because dharmas lack essence that they aren't accomplished.",
        "source": "T11n0310_069:0390a06_17"
    },
    {
        "source_sentence": "如是色非成就，以非成就故不可說名過去現在及以未來。",
        "translation": "Such form is not accomplished: because it is not accomplished. Because it cannot be said to be called past, present or future.",
        "source": "T11n0310_069:0390a07_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0390a08_19"
    },
    {
        "source_sentence": "色非有法故，是故不可得。",
        "translation": "Because form is not a dharma, it therefore cannot be acquired.",
        "source": "T11n0310_069:0390a09_0"
    },
    {
        "source_sentence": "若色不生者即是不滅，以不生滅故即不可說。",
        "translation": "If form doesn't arise, it means it doesn't cease, and because it doesn't arise and cease, it can't be explained.",
        "source": "T11n0310_069:0390a09_1"
    },
    {
        "source_sentence": "復有如是說，所有過去色現在未來色，此等和合名為色陰，其色體性亦不可得，",
        "translation": "It is further said in this way: All past, present and future material forms are combined as the aggregate matter. The essence of these forms cannot be grasped.",
        "source": "T11n0310_069:0390a10_2"
    },
    {
        "source_sentence": "何有過去現在未來？",
        "translation": "How could there be past, present, and future?",
        "source": "T11n0310_069:0390a12_3"
    },
    {
        "source_sentence": "是故色陰非是可說。",
        "translation": "Therefore, the form aggregate is not something that can be explained.",
        "source": "T11n0310_069:0390a12_4"
    },
    {
        "source_sentence": "受想行識亦復如是，是故陰入即是陀羅尼入。",
        "translation": "Feeling, conceptual identification, volition and consciousness are likewise. That is why the sense aggregate-entry is the dhāraṇī-entry.",
        "source": "T11n0310_069:0390a13_5"
    },
    {
        "source_sentence": "以陀羅尼入故，陰不可得。",
        "translation": "Because the dhāraṇī enters, the aggregates are unobtainable.",
        "source": "T11n0310_069:0390a14_6"
    },
    {
        "source_sentence": "以陰不可得故，陀羅尼亦不可得。",
        "translation": "Because the aggregates are unobtainable, the dhāraṇī is also unobtainable.",
        "source": "T11n0310_069:0390a15_7"
    },
    {
        "source_sentence": "以陀羅尼入不可得，唯是但名但用但假，但是世俗，但是言說，但是施設，",
        "translation": "Because dhāraṇī-entry is ungraspable, it's only name but function but provisional but mundane but verbal but designation.",
        "source": "T11n0310_069:0390a15_8"
    },
    {
        "source_sentence": "非陰非色亦非色入，亦非陀羅尼體性可得。",
        "translation": "It's not an aggregate, not form, not form entry, nor form entry, and not the essence of a dhāraṇī that can be obtained.",
        "source": "T11n0310_069:0390a17_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0390a18_10"
    },
    {
        "source_sentence": "所謂陰等非是作法，以非作法故無有積聚，以積聚故得名為陰。",
        "translation": "The so-called aggregates and so on are not conditioned factors: because they are not conditioned factors, there is no accumulation. Because of this accumulation, they can be called aggregates.",
        "source": "T11n0310_069:0390a18_11"
    },
    {
        "source_sentence": "譬如世間多物積聚，假名城屋舍宅殿堂、重閣樓闕窓牖欄楯、城壁女牆却敵寮孔，",
        "translation": "It's like the world where many things accumulate, which are nominally called cities, houses, mansions, halls, heavy pavilions, buildings with missing windows, walls, railings, walls, walls, women, walls, enemies, and living quarters.",
        "source": "T11n0310_069:0390a20_12"
    },
    {
        "source_sentence": "周迴具足名之為城。",
        "translation": "It's called a city because it's fully endowed with circumference.",
        "source": "T11n0310_069:0390a22_0"
    },
    {
        "source_sentence": "彼色性即不可得無有積聚，以無積聚故即便無色亦無色陰。",
        "translation": "The nature of form is that which is ungraspable and without accumulation. It is because there is no accumulation that even in the formless realm there is also a formless aggregate.",
        "source": "T11n0310_069:0390a22_1"
    },
    {
        "source_sentence": "受想行識亦復如是，性不可得無有積聚，以無積聚故即便無識亦無識陰。",
        "translation": "Feeling, conceptual identification, volition, and consciousness are also like this. Their nature is ungraspable because there is no accumulation; because there is no accumulation, even without consciousness there is no aggregate of consciousness.",
        "source": "T11n0310_069:0390a23_2"
    },
    {
        "source_sentence": "彼諸陰入應如是知。",
        "translation": "These aggregates and sense-fields should be known in this way.",
        "source": "T11n0310_069:0390a25_3"
    },
    {
        "source_sentence": "「彼眼入者是誰入？",
        "translation": "To whom does this eye sense-field belong?",
        "source": "T11n0310_069:0390a26_0"
    },
    {
        "source_sentence": "謂苦入。",
        "translation": "It's the entry of suffering.",
        "source": "T11n0310_069:0390a26_1"
    },
    {
        "source_sentence": "何者是眼？",
        "translation": "What's eye?",
        "source": "T11n0310_069:0390a26_2"
    },
    {
        "source_sentence": "謂清淨四大所造色名為眼。",
        "translation": "It means that the form created by the pure four elements is called the eye.",
        "source": "T11n0310_069:0390a26_3"
    },
    {
        "source_sentence": "何等是四大？",
        "translation": "What are the four elements?",
        "source": "T11n0310_069:0390a27_4"
    },
    {
        "source_sentence": "謂清淨地界水火風界。",
        "translation": "It's the pure earth realm, water, fire, and wind realms.",
        "source": "T11n0310_069:0390a27_5"
    },
    {
        "source_sentence": "彼淨地界性自離故，以法體不可得，彼即非成就。",
        "translation": "Because the nature of this element clean stage is self-separated, it is because the essence of a factor is ungraspable. That exactly is not accomplished.",
        "source": "T11n0310_069:0390a28_6"
    },
    {
        "source_sentence": "如是清淨水火風界體性自離，以法體不可得，彼即非成就。",
        "translation": "Thus, the essence of the pure water, fire, and wind realms is self-separated by its own nature, because the essence of dharmas are unobtainable, which means they aren't accomplished.",
        "source": "T11n0310_069:0390a29_7"
    },
    {
        "source_sentence": "如是眼入非成就，是故不可說言過去現在未來。",
        "translation": "In this way, the sense eye is not accomplished. That is why it cannot be said to be past, present or future.",
        "source": "T11n0310_069:0390b01_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0390b02_9"
    },
    {
        "source_sentence": "眼入非物。",
        "translation": "The eye enters into what's not things.",
        "source": "T11n0310_069:0390b03_10"
    },
    {
        "source_sentence": "以非物故不生不滅，若不生滅者即是不可說。",
        "translation": "It's because it's not something that doesn't arise and doesn't cease, and if it doesn't arise and cease, it's ineffable.",
        "source": "T11n0310_069:0390b03_11"
    },
    {
        "source_sentence": "如是眼不生滅，入亦不生滅，以不生滅故即是不可說。",
        "translation": "Thus, the eye doesn't arise and cease, and entry doesn't arise and cease, which is inexplicable because it doesn't arise and cease.",
        "source": "T11n0310_069:0390b04_12"
    },
    {
        "source_sentence": "應當如是知。",
        "translation": "You should know it this way.",
        "source": "T11n0310_069:0390b05_13"
    },
    {
        "source_sentence": "唯是但名但用但假，但是世俗，但是言說。",
        "translation": "They are only names but uses but metaphors; they are only worldly but verbal expressions.",
        "source": "T11n0310_069:0390b05_14"
    },
    {
        "source_sentence": "彼名名體亦離自性。",
        "translation": "They are called names and essence that are also free of their own nature.",
        "source": "T11n0310_069:0390b06_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0390b07_16"
    },
    {
        "source_sentence": "無有一法得名為眼、名為入、名為苦。",
        "translation": "There's not a single thing that gets the name eye, is called entry, and is called suffering.",
        "source": "T11n0310_069:0390b07_17"
    },
    {
        "source_sentence": "以名不可得，是故眼入亦不可得，以眼不可得即是陀羅尼入。",
        "translation": "Because names are unobtainable, the eye sense-field is also unobtainable, and because the eye is unobtainable, this is the dhāraṇī sense-field.",
        "source": "T11n0310_069:0390b08_18"
    },
    {
        "source_sentence": "是陀羅尼入亦不可得。",
        "translation": "This dhāraṇī entry is also unobtainable.",
        "source": "T11n0310_069:0390b09_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0390b10_20"
    },
    {
        "source_sentence": "性自離故，但名但用但假施設世俗言說。",
        "translation": "Because they are inherently free of their own nature, they merely use names and only nominal designations in worldly speech.",
        "source": "T11n0310_069:0390b10_21"
    },
    {
        "source_sentence": "如是以眼入入得陀羅尼，得陀羅尼已便得辯才。",
        "translation": "Thus, he enters and enters with his eyes to attain the dhāraṇī, and after attaining the dhāraṇī, he then attains eloquence.",
        "source": "T11n0310_069:0390b11_22"
    },
    {
        "source_sentence": "當知耳鼻舌身意色聲香味觸法亦皆如是。",
        "translation": "You should know that the ear, nose, tongue, body, mind, form, sound, odor, taste, touch, and dharmas are likewise.",
        "source": "T11n0310_069:0390b12_23"
    },
    {
        "source_sentence": "「於彼界入得陀羅尼眼，眼體不可得、界體不可得。",
        "translation": "In that realm, he enters the dhāraṇī eye and attains it, but the essence of the eye is unobtainable, and the essence of the realm is unobtainable.",
        "source": "T11n0310_069:0390b13_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0390b14_25"
    },
    {
        "source_sentence": "眼離眼性故、界離界性故。",
        "translation": "It's because the eye is free of the eye nature and the element is free of the elemental nature.",
        "source": "T11n0310_069:0390b14_26"
    },
    {
        "source_sentence": "以法體不可得，彼即非物。",
        "translation": "It's because the essence of dharmas can't be obtained, and they are not things.",
        "source": "T11n0310_069:0390b15_27"
    },
    {
        "source_sentence": "以非物故即非成就，非成就者不生不滅，以不生滅故彼即非過去非現在非未來，",
        "translation": "That which is not accomplished, neither arises nor perishes. Because it does not arise and perish, it exactly is neither past, nor present, nor future.",
        "source": "T11n0310_069:0390b16_0"
    },
    {
        "source_sentence": "但名但用但假，但世俗，但言說，但施設。",
        "translation": "They are only names, but functions, but metaphors; they are only worldly, but verbal expressions, but designations.",
        "source": "T11n0310_069:0390b17_1"
    },
    {
        "source_sentence": "彼名離名自性乃至施設，亦離施設自性。",
        "translation": "They're called free of the self-nature of names and even their designations, and they're also free of the self-nature of designations.",
        "source": "T11n0310_069:0390b18_2"
    },
    {
        "source_sentence": "若法無自性不可得者即是非物，以非物故即非成就，非成就者即非生滅，",
        "translation": "If a factor is ungraspable because of the absence of an essential nature, then it is not a thing. Because it is not a thing, it exactly is not accomplished. What is not accomplished means neither arising nor ceasing.",
        "source": "T11n0310_069:0390b19_3"
    },
    {
        "source_sentence": "以不生滅故彼即非過去非現在非未來。",
        "translation": "It's because they don't arise and cease that they are neither past, present, nor future.",
        "source": "T11n0310_069:0390b21_4"
    },
    {
        "source_sentence": "若於三世所不攝者，彼名即非相亦非想、非用、非假、非有為、非可說、非來非去、非可為他說、非可顯示、非可知非可識、非黑非白，",
        "translation": "If they aren’t included in the three times, then names are neither characteristics nor perceptions, not functioning, not provisional, not conditioned, not explicable, not coming and going, not something to be explained, not something to be shown, not knowable and not conscious, not black and not white.",
        "source": "T11n0310_069:0390b22_5"
    },
    {
        "source_sentence": "非窟宅離窟宅故，非至非可至故，非得非可得故，非證非可證故，非凡夫亦非凡夫地，",
        "translation": "It's because it's not a cave or a place apart from a cave, because it doesn't reach and can't be reached, because it's neither attained nor obtained, because it's neither realized nor realizable, and because it's not an extraordinary person or an extraordinary person's ground.",
        "source": "T11n0310_069:0390b25_6"
    },
    {
        "source_sentence": "非聲聞亦非聲聞地，非緣覺亦非緣覺地，非菩薩亦非菩薩地，非佛亦非佛地，",
        "translation": "neither the stage of śrāvaka nor the stage of śrāvaka, neither the stage of pratyekabuddha nor the stage of pratyekabuddha, neither the stage of bodhisattva nor the stage of bodhisattva, neither buddha nor buddha-stage.",
        "source": "T11n0310_069:0390b27_7"
    },
    {
        "source_sentence": "非地亦非非地。",
        "translation": "What's not the ground is also what's not the ground and what's not the ground.",
        "source": "T11n0310_069:0390b29_8"
    },
    {
        "source_sentence": "此即是真如、不異如、非非如，寂滅無相，但用但假。",
        "translation": "This is what is true, what is not different from suchness, and what is neither like nor different from suchness. Tranquil and signless, it functions only nominally.",
        "source": "T11n0310_069:0390b29_9"
    },
    {
        "source_sentence": "謂如來者，但世俗故說名如來，非第一義有如來也。",
        "translation": "It means that the Tathāgata is simply called a tathāgata because it's worldly, not because there's a tathāgata in the first sense.",
        "source": "T11n0310_069:0390c01_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0390c02_11"
    },
    {
        "source_sentence": "彼法不可得，故無如來。",
        "translation": "Because those dharmas are ungraspable, there's no Tathāgata.",
        "source": "T11n0310_069:0390c02_12"
    },
    {
        "source_sentence": "於彼界入，應當入如是眼耳鼻舌身意界法界意識界。",
        "translation": "In that realm, he enters the eye, ear, nose, tongue, body, mind, Dharma realm, and consciousness realms like this.",
        "source": "T11n0310_069:0390c03_13"
    },
    {
        "source_sentence": "如是一切餘界亦應知，應當如是廣入法界。",
        "translation": "Thus, all the other realms should also be known, and they should thus enter into the Dharma realm in this way.",
        "source": "T11n0310_069:0390c04_14"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0390c05_15"
    },
    {
        "source_sentence": "彼法界說言陰時，而不壞彼法界本性。",
        "translation": "When that realm of reality speaks of aggregates, it doesn't destroy the original nature of that realm of reality.",
        "source": "T11n0310_069:0390c05_16"
    },
    {
        "source_sentence": "說言入時、說言界時、說言四諦時、說言十二因緣時，亦不壞本法界體性。",
        "translation": "When he speaks of entry, when he speaks of the realm, when he speaks of the four truths, and when he speaks of the twelve causes and conditions, he doesn't destroy the essence of the original Dharma realm.",
        "source": "T11n0310_069:0390c06_17"
    },
    {
        "source_sentence": "彼法界隨所說處，一切諸法建立名字，皆不壞彼法界體性。",
        "translation": "Wherever they teach the Dharma realm, names are established for all dharmas, and they don't destroy the essence of that Dharma realm.",
        "source": "T11n0310_069:0390c08_18"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0390c09_19"
    },
    {
        "source_sentence": "譬如地界隨其所在作異名字，而不壞彼本地界性。",
        "translation": "It's like the earth element that creates a different name according to where it is, but doesn't destroy the nature of its local element.",
        "source": "T11n0310_069:0390c09_20"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0390c11_0"
    },
    {
        "source_sentence": "如是法界隨其所在作異名字，亦復不壞法界本性。",
        "translation": "Thus, the Dharma realm follows its location and creates a different name for it, which also doesn't destroy the original nature of the Dharma realm.",
        "source": "T11n0310_069:0390c11_1"
    },
    {
        "source_sentence": "如是水火風界亦復如是。",
        "translation": "So it is with the water, fire, and wind realms.",
        "source": "T11n0310_069:0390c12_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0390c12_3"
    },
    {
        "source_sentence": "譬如虛空隨其所在差別異用，而不壞彼虛空體性。",
        "translation": "It's like space, which follows the distinctions and dissimilarities in its location and doesn't destroy the essence of that space.",
        "source": "T11n0310_069:0390c13_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0390c14_1"
    },
    {
        "source_sentence": "如是法界隨其所在差別名用，而不壞彼法界體性。",
        "translation": "Thus, the Dharma realm follows the distinctions in names and functions wherever they are, but it doesn't destroy the essence of that Dharma realm.",
        "source": "T11n0310_069:0390c14_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0390c15_3"
    },
    {
        "source_sentence": "入諸根時即是入法界。",
        "translation": "When he enters the faculties, that's when he enters the Dharma realm.",
        "source": "T11n0310_069:0390c15_4"
    },
    {
        "source_sentence": "言諸根者，所謂眼根耳根鼻根舌根身根意根、男根女根命根、樂根苦根喜根憂根捨根、信根精進根念根定根慧根、未知欲知根、知根知己根。",
        "translation": "The so-called faculties are the eye faculty, the ear faculty, the nose faculty, the tongue faculty, the body faculty, the mind faculty, the male faculty, the female faculty, the life faculty, the pleasure faculty, the pain faculty, the joy faculty, the grief fac",
        "source": "T11n0310_069:0390c16_5"
    },
    {
        "source_sentence": "彼眼眼體不可得根，根體不可得。",
        "translation": "The essence of that eye and eye are unobtainable faculties, and the essence of those faculties is unobtainable.",
        "source": "T11n0310_069:0390c19_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0390c20_7"
    },
    {
        "source_sentence": "是眼離眼自性故。",
        "translation": "It's because the eye is free of the self-nature of the eye.",
        "source": "T11n0310_069:0390c20_8"
    },
    {
        "source_sentence": "以法無體性彼即非物，以非物故即非成就，非成就者彼即不生，若不生者即是不滅，",
        "translation": "Because things have no essence, they are not things; because they are not things, they are not accomplished. If they are not accomplished, they will not arise; if they do not arise, they will not perish.",
        "source": "T11n0310_069:0390c20_9"
    },
    {
        "source_sentence": "以不生滅故不可說言彼是過去現在未來。",
        "translation": "Because they don't arise and cease, it can't be said that they are past, present, or future.",
        "source": "T11n0310_069:0390c22_10"
    },
    {
        "source_sentence": "若於三世中不生滅者，彼即非眼亦非眼根，云何有用？",
        "translation": "If they don't arise and cease in the three times, then they aren't the eye and aren't the eye faculty, so how useful is it?",
        "source": "T11n0310_069:0390c23_11"
    },
    {
        "source_sentence": "應如是知。",
        "translation": "You should thus know.",
        "source": "T11n0310_069:0390c24_12"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0390c25_13"
    },
    {
        "source_sentence": "譬如空拳虛誑無物，但有名字乃至言說，於第一義中空拳亦無。",
        "translation": "It's like an empty fist that's false and devoid of things but has names or even words, and the empty fist is also absent in the ultimate truth.",
        "source": "T11n0310_069:0390c25_14"
    },
    {
        "source_sentence": "如是眼及眼根，猶如空拳，虛妄非實而現虛相誑惑凡夫，但有名字乃至言說。",
        "translation": "Thus, the eye and the eye faculty are like an empty fist, which is false and not real but shows false appearances to deceive ordinary people with names and even words.",
        "source": "T11n0310_069:0390c26_15"
    },
    {
        "source_sentence": "於第一義，眼及眼根俱不可得。",
        "translation": "In the ultimate truth, neither the eye nor the eye faculty is obtainable.",
        "source": "T11n0310_069:0390c28_16"
    },
    {
        "source_sentence": "如是世尊得一切智已，為度眾生故說名為根。",
        "translation": "Thus, the Bhagavān has attained omniscience and is called a faculty because he wants to save sentient beings.",
        "source": "T11n0310_069:0390c29_17"
    },
    {
        "source_sentence": "彼等諸根於第一義，性自離故根體皆空。",
        "translation": "In the ultimate truth, these faculties are inherently free of their own natures and therefore all have emptiness in their essence.",
        "source": "T11n0310_069:0391a01_18"
    },
    {
        "source_sentence": "其法體空者用亦虛妄，非有非實誑惑凡愚，離自性故不生不滅，不生滅者不得說言彼是過去現在未來。",
        "translation": "The essence of these dharmas is empty, and their functioning is also false, neither existent nor real, deceiving ordinary foolishness, not arising or ceasing because it's free of its own nature, and those who don't arise and cease can't say that they are past, present, or future.",
        "source": "T11n0310_069:0391a02_19"
    },
    {
        "source_sentence": "若於三世中無者彼即無名無相，非可說非可為他說、非生非可生、非已知非當知、非已聞非當聞、非識非可識、非已證非當證、非已得非當得、非已見非當見、非已到非當到。",
        "translation": "If they are nonexistent in the three times, then they are nameless and formless, neither to be explained nor to be taught, neither to be produced nor to be produced, neither to be known nor to be known, neither to have heard nor to hear, neither to be known nor to be known, neither to have realized nor to realize, neither to have attained nor to attain",
        "source": "T11n0310_069:0391a04_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0391a08_21"
    },
    {
        "source_sentence": "彼非有故。",
        "translation": "It's because they aren't existent.",
        "source": "T11n0310_069:0391a08_22"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391a09_0"
    },
    {
        "source_sentence": "譬如有人於其夢中受樂喜笑囈語遊戲。",
        "translation": "It's like when a person in a dream experiences pleasure, joy, laughter, anger, speech, and play.",
        "source": "T11n0310_069:0391a09_1"
    },
    {
        "source_sentence": "是人爾時從寐寤已，憶念夢中受樂遊戲，念已求之不見不得。",
        "translation": "At the time, that person was awake from sleep and remembered a dream in which they were enjoying pleasure and play, and after thinking about it, they asked for it but couldn't find it.",
        "source": "T11n0310_069:0391a10_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0391a11_3"
    },
    {
        "source_sentence": "彼人夢中受樂喜笑囈語遊戲尚自無實，何況寤時若見若得，無有是處。",
        "translation": "That person's dream experiences pleasure, joy, laughter, lust, words, and play are still unreal, so why wouldn't there be a place for seeing or attaining them at the time of sexual desire?",
        "source": "T11n0310_069:0391a11_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391a13_5"
    },
    {
        "source_sentence": "如是諸根猶如夢中受樂遊戲實不可得。",
        "translation": "Such faculties are like feeling pleasure and play in a dream that's really unobtainable.",
        "source": "T11n0310_069:0391a13_6"
    },
    {
        "source_sentence": "如是一切諸法體性亦不可得，以不可得故不可說言彼是過去現在未來。",
        "translation": "Thus, the essence of all dharmas is also unobtainable, and because it's unobtainable, it can't be said that they are past, present, or future.",
        "source": "T11n0310_069:0391a14_7"
    },
    {
        "source_sentence": "若於三世中不可得者，彼即不可說。",
        "translation": "If it's unobtainable in the three times, then they can't be explained.",
        "source": "T11n0310_069:0391a16_8"
    },
    {
        "source_sentence": "一切諸根當如是知。",
        "translation": "All faculties should be known in this way.",
        "source": "T11n0310_069:0391a16_9"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391a17_10"
    },
    {
        "source_sentence": "若入法界即入一切法，入一切法即是入法界。",
        "translation": "If someone enters the Dharma realm, they enter all dharmas, and entering all dharmas is entering the Dharma realm.",
        "source": "T11n0310_069:0391a17_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391a18_12"
    },
    {
        "source_sentence": "入四諦法即是入法界。",
        "translation": "Entering the Dharma of the four truths is entering the Dharma realm.",
        "source": "T11n0310_069:0391a18_13"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0310_069:0391a19_14"
    },
    {
        "source_sentence": "謂苦集滅道。",
        "translation": "They are suffering, arising, cessation, and the path.",
        "source": "T11n0310_069:0391a19_15"
    },
    {
        "source_sentence": "世尊亦說一切諸法皆悉是空，非眾生、非命、非福伽羅、非想非相。",
        "translation": "The Bhagavān also says that all dharmas are completely empty, not sentient beings, not life, not pudgala, and not conceptions or characteristics.",
        "source": "T11n0310_069:0391a19_16"
    },
    {
        "source_sentence": "我等於此法中無有疑慮。",
        "translation": "We have no doubts about this teaching.",
        "source": "T11n0310_069:0391a21_17"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391a21_18"
    },
    {
        "source_sentence": "以無眾生故亦復無苦。",
        "translation": "Because there are no sentient beings, there's also no suffering.",
        "source": "T11n0310_069:0391a22_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0391a22_1"
    },
    {
        "source_sentence": "眾生無處苦諦亦無，以無苦故集諦亦無。",
        "translation": "Because sentient beings have no place, the truth of suffering also doesn't exist, and because there's no suffering, the truth of accumulation also doesn't exist.",
        "source": "T11n0310_069:0391a22_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0391a23_3"
    },
    {
        "source_sentence": "無如是因而無果者。",
        "translation": "There's no such thing as thusness and therefore no fruit.",
        "source": "T11n0310_069:0391a23_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391a25_0"
    },
    {
        "source_sentence": "以無集故滅諦亦無。",
        "translation": "Because there's no arising, the truth of cessation also has no arising.",
        "source": "T11n0310_069:0391a25_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0391a25_2"
    },
    {
        "source_sentence": "無集諦故亦無斷集，以無滅故道諦亦無。",
        "translation": "Because of the absence of the truth of the origin, there is also no annihilation of the origin; because of the absence of cessation, the truth of the path is also absent.",
        "source": "T11n0310_069:0391a25_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0391a26_4"
    },
    {
        "source_sentence": "無有是道不斷集者。",
        "translation": "There's no such thing as a path that doesn't stop accumulating.",
        "source": "T11n0310_069:0391a26_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391a28_0"
    },
    {
        "source_sentence": "道果者謂是滅諦。",
        "translation": "The fruit of the path is called the truth of cessation.",
        "source": "T11n0310_069:0391a28_1"
    },
    {
        "source_sentence": "彼煩惱不可得斷，煩惱滅亦不可得。",
        "translation": "Those afflictions can't be stopped, and the cessation of afflictions can't be obtained either.",
        "source": "T11n0310_069:0391a28_2"
    },
    {
        "source_sentence": "以滅不可得故道亦不可得，無有如是道而無其果。",
        "translation": "Because cessation is unobtainable, the path is also unobtainable, and there's no such path that has no fruit.",
        "source": "T11n0310_069:0391a29_3"
    },
    {
        "source_sentence": "此四聖諦但是分別虛妄非有。",
        "translation": "These four noble truths are simply discriminated as false and nonexistent.",
        "source": "T11n0310_069:0391b01_4"
    },
    {
        "source_sentence": "以非有故，不可說言過去現在及以未來。",
        "translation": "Because it does not exist, one cannot say that it is past, present or future.",
        "source": "T11n0310_069:0391b02_5"
    },
    {
        "source_sentence": "若於三世中不可得者，彼即非生非滅、非相非想、非設非可設、非示非可示、非顯非可顯、非語言非可語言、非言辭非可言詞、非說非可說、非見非可見、非知非可知、非識非可識、非測非可測、非達非可達、非到非可到、非得非可得、非聞非可聞、非見非可見、非對非可對、非證非可證、非白非黑、非明非暗、非去非來、非淺非深、非清非濁、非畏非安、非縛非解、非憎非愛、非煩惱非清淨、非智非非智、非路非非路、非壞非非壞、非攝受非非攝受、非生死非非生死、非可得非不可得、非眾生非非眾生、非命非非命、非壽者非非壽者、非我非非我、非物非非物、非空非不空、非相非非相、非願非不願、非依非不依、非有為非無為、非斷非常、非邪非正、非實非妄、非妄想非非妄想、非處非非處、非宅非非宅、非知非不知、非捨非修、非生死非涅槃、非覺非不覺、非凡夫境界、非聲聞境界、非緣覺境界、非菩薩境界、非佛境界、非境界非非境界、非作非不作。",
        "translation": "若於三世中中不可得者,彼即非生非滅、非相非想、非設非可設、非示非可示、非顯非可示、非顯非可顯、非言語非可言語、非言辭非可言詞、非說非可說、非見非可可可可可可可可可可可可可可可可可",
        "source": "T11n0310_069:0391b03_6"
    },
    {
        "source_sentence": "如是入諦即是入法界，入法界已即得陀羅尼，得陀羅尼已即得辯才。",
        "translation": "Thus, entering the truth is entering the Dharma realm, and after entering the Dharma realm, he attains the dhāraṇī, and after attaining the dhāraṇī, he attains eloquence.",
        "source": "T11n0310_069:0391b22_7"
    },
    {
        "source_sentence": "「入十二因緣即是入法界，無明緣行，行緣識，識緣名色，名色緣六入，",
        "translation": "“Entry into the twelve causes and conditions is entry into the cosmos of reality. It has nescience for its object, volition for its object, consciousness for its object, name and form for its object, and name and form for its object.",
        "source": "T11n0310_069:0391b24_8"
    },
    {
        "source_sentence": "六入緣觸，觸緣受，受緣渴愛，渴愛緣取，取緣有，有緣生，生緣老死憂悲苦惱，",
        "translation": "The six sense-fields are with tangibles as supporting object, sensation as supporting object, feeling as supporting object, thirst as supporting object, thirst as supporting object, grasping as supporting object, existence as supporting object, birth as supporting object, birth as supporting object, old age and death as supporting object, sorrow and suffering as supporting object.",
        "source": "T11n0310_069:0391b25_9"
    },
    {
        "source_sentence": "是眾苦大聚。",
        "translation": "These are the great mass of suffering.",
        "source": "T11n0310_069:0391b27_10"
    },
    {
        "source_sentence": "如是無明滅則行滅，乃至憂悲苦惱滅眾苦大聚滅。",
        "translation": "Thus, when ignorance ceases, conditioned phenomena cease, and so forth, up to the cessation of sorrow and suffering and the great mass of suffering cease.",
        "source": "T11n0310_069:0391b27_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391b28_12"
    },
    {
        "source_sentence": "彼無明無明體不可得。",
        "translation": "The essence of nescience and nescience are unobtainable.",
        "source": "T11n0310_069:0391b28_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0391b29_14"
    },
    {
        "source_sentence": "性自離故。",
        "translation": "It's because the nature is self-separated.",
        "source": "T11n0310_069:0391b29_15"
    },
    {
        "source_sentence": "若法無體性彼即非物，以非物故即非成就，非成就者非生非滅，非生滅者即非過去非現在非未來。",
        "translation": "If things lack essence, they are not things, and because they aren't things, they aren't accomplished; what's not accomplished is neither arising nor ceasing, and what's not arising and ceasing is neither past, present, nor future.",
        "source": "T11n0310_069:0391b29_16"
    },
    {
        "source_sentence": "若於三世中不可得者，無名無形無相無想亦非差別，唯是但名但假但用，",
        "translation": "If it is ungraspable in the three time periods, then namelessness, formlessness, signlessness, absence of ideation, and non-difference are neither. It is only name but designation, provisional but functioning.",
        "source": "T11n0310_069:0391c03_17"
    },
    {
        "source_sentence": "但世俗，但言說，為教化一切凡夫眾生故。",
        "translation": "It's just worldly, but it's only verbal, because it teaches and transforms all ordinary sentient beings.",
        "source": "T11n0310_069:0391c04_18"
    },
    {
        "source_sentence": "彼無明於第一義實不可得，不可得者即非差別用亦不可說。",
        "translation": "That ignorance is really unobtainable in the ultimate truth, and what's unobtainable means that it doesn't have distinctive functions that can't be explained.",
        "source": "T11n0310_069:0391c05_19"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391c07_20"
    },
    {
        "source_sentence": "若是但名乃至但施設，彼即非實，唯是虛妄言說分別覺觀非定，但是戲論。",
        "translation": "If it's only names or even just designations, they aren't real, but falsely described as discriminating feelings and contemplations that aren't determined, which are just conceptual elaborations.",
        "source": "T11n0310_069:0391c07_21"
    },
    {
        "source_sentence": "彼無明若無自性者云何能生行？",
        "translation": "If that nescience has no self-nature, how can it give rise to volition?",
        "source": "T11n0310_069:0391c09_0"
    },
    {
        "source_sentence": "無明無故行亦不生。",
        "translation": "Because nescience is absent, form doesn't arise either.",
        "source": "T11n0310_069:0391c09_1"
    },
    {
        "source_sentence": "以不生故，彼即不老不病不死不流轉即不生。",
        "translation": "Because it doesn't arise, they are not old, not sick, not dead, and not transmigrating, which means they don't arise.",
        "source": "T11n0310_069:0391c10_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0391c11_3"
    },
    {
        "source_sentence": "若不生者云何有老？",
        "translation": "If it doesn't arise, then how could there be old age?",
        "source": "T11n0310_069:0391c11_4"
    },
    {
        "source_sentence": "以無老故乃至不生。",
        "translation": "It's because there's no old age... it doesn't arise.",
        "source": "T11n0310_069:0391c11_5"
    },
    {
        "source_sentence": "若不生不死者，即是一切過現未來諸佛菩提，但世俗名字非第一義，所言無明即是菩提。",
        "translation": "If someone doesn't arise and doesn't die, that's the enlightenment of all past and future buddhas, but worldly names aren't the ultimate truth, and what's called ignorance is enlightenment.",
        "source": "T11n0310_069:0391c12_6"
    },
    {
        "source_sentence": "當知諸有支亦復如是。",
        "translation": "You should know that the branches of existence are likewise.",
        "source": "T11n0310_069:0391c14_7"
    },
    {
        "source_sentence": "如是入十二因緣，當知即是入於法界。",
        "translation": "Thus, these twelve causes and conditions for entering are known as entering the Dharma realm.",
        "source": "T11n0310_069:0391c15_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391c15_1"
    },
    {
        "source_sentence": "如來不生，一切諸法亦不生，是故一切法即是如來。",
        "translation": "The Tathāgata doesn't arise, and all dharmas don't arise either; therefore, all dharmas are the Tathāgata.",
        "source": "T11n0310_069:0391c16_0"
    },
    {
        "source_sentence": "如來不滅，一切諸法亦不滅，是故一切法即是如來。",
        "translation": "The Tathāgata doesn't cease, and all dharmas don't cease; therefore, all dharmas are the Tathāgata.",
        "source": "T11n0310_069:0391c17_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391c18_2"
    },
    {
        "source_sentence": "如來無相，一切諸法亦無相，是故一切法即是如來。",
        "translation": "The Tathāgata has no marks, and all dharmas have no marks; therefore, all dharmas are the Tathāgata.",
        "source": "T11n0310_069:0391c18_3"
    },
    {
        "source_sentence": "略而言之，如是無相不可得，非垢非淨非愛非憎，法界不可識亦復不可知。",
        "translation": "In brief, it's thus formless and unobtainable, neither dirty nor pure, neither desirable nor undesirable, and the Dharma realm can't be known or known.",
        "source": "T11n0310_069:0391c19_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391c21_5"
    },
    {
        "source_sentence": "真如者即是如來。",
        "translation": "The true thusness is the Tathāgata.",
        "source": "T11n0310_069:0391c21_6"
    },
    {
        "source_sentence": "一切諸法即是真如，是故一切法即是如來。",
        "translation": "All dharmas are true thusness, so all dharmas are the Tathāgata.",
        "source": "T11n0310_069:0391c21_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391c22_8"
    },
    {
        "source_sentence": "實際者即是如來，一切諸法即是實際，是故一切法即是如來。",
        "translation": "Practice is the Tathāgata, and all dharmas are practice; therefore, all dharmas are the Tathāgata.",
        "source": "T11n0310_069:0391c23_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391c24_10"
    },
    {
        "source_sentence": "隨所法中即有如來，於其法中即有一切法，是故一切法即是如來。",
        "translation": "In each dharma, there's a Tathāgata, and in each dharma, there are all dharmas; therefore, all dharmas are the Tathāgata.",
        "source": "T11n0310_069:0391c24_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391c26_12"
    },
    {
        "source_sentence": "若有人言如來得阿耨多羅三藐三菩提者，彼諸眾生是計著見。",
        "translation": "If someone says the Tathāgata has attained supreme perfect enlightenment, those sentient beings are mistakenly attached to views.",
        "source": "T11n0310_069:0391c26_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0391c27_14"
    },
    {
        "source_sentence": "如來不二，菩提亦不二，不二者不能覺寤於不二。",
        "translation": "The Tathāgata isn't two, and so is enlightenment; those who aren't two can't perceive what's not two.",
        "source": "T11n0310_069:0391c27_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0391c29_16"
    },
    {
        "source_sentence": "若復有人作如是言：『如來轉於無上法輪。』",
        "translation": "Suppose another person says, 'The Tathāgata turns the unsurpassed wheel of the Dharma.'",
        "source": "T11n0310_069:0391c29_17"
    },
    {
        "source_sentence": "彼諸眾生是執著見。",
        "translation": "Those sentient beings are addicted to views.",
        "source": "T11n0310_069:0392a01_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0392a01_19"
    },
    {
        "source_sentence": "如來非進退。",
        "translation": "The Tathāgata doesn't advance or retreat.",
        "source": "T11n0310_069:0392a01_20"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0392a02_21"
    },
    {
        "source_sentence": "若復有人作如是言：『如來滅度無量眾生。』",
        "translation": "Suppose another person says, 'The Tathāgata ceases and saves measureless sentient beings.'",
        "source": "T11n0310_069:0392a02_22"
    },
    {
        "source_sentence": "彼等一切皆是執見。",
        "translation": "All of them are views of attachment.",
        "source": "T11n0310_069:0392a03_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0392a03_24"
    },
    {
        "source_sentence": "一切諸法實無眾生，是故無有得滅度者。",
        "translation": "All dharmas really lack sentient beings, so there's no one who has attained cessation.",
        "source": "T11n0310_069:0392a03_25"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0392a04_26"
    },
    {
        "source_sentence": "若復有人作如是言：『如來利益無量眾生。』",
        "translation": "Suppose another person says, 'The Tathāgata benefits measureless sentient beings.'",
        "source": "T11n0310_069:0392a04_27"
    },
    {
        "source_sentence": "彼等一切是取著見。",
        "translation": "All of them are views of attachment.",
        "source": "T11n0310_069:0392a05_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0392a06_29"
    },
    {
        "source_sentence": "如來不為利益眾生，亦復不為不利眾生出現於世。",
        "translation": "The Tathāgata doesn't appear in the world for the benefit of sentient beings, and he doesn't appear in the world for the benefit of unenlightened sentient beings.",
        "source": "T11n0310_069:0392a06_30"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0392a07_31"
    },
    {
        "source_sentence": "若復有人於未來世作如是言：『如來捨壽。』",
        "translation": "Suppose another person in a future life says, 'The Tathāgata abandons his life.'",
        "source": "T11n0310_069:0392a07_32"
    },
    {
        "source_sentence": "彼諸眾生皆是執見。",
        "translation": "All those sentient beings are addicted to views.",
        "source": "T11n0310_069:0392a08_33"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0392a09_34"
    },
    {
        "source_sentence": "法界無攝受亦無捨故。",
        "translation": "It's because the Dharma realm has no taking in and no equanimity.",
        "source": "T11n0310_069:0392a09_35"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0392a09_36"
    },
    {
        "source_sentence": "若復有人作如是言：『如來入於無餘涅槃界。』",
        "translation": "Suppose another person says, 'The Tathāgata enters the state of nirvāṇa without remainder.'",
        "source": "T11n0310_069:0392a10_0"
    },
    {
        "source_sentence": "彼諸眾生是計著見。",
        "translation": "Those sentient beings are conceptually attached to views.",
        "source": "T11n0310_069:0392a11_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_069:0392a11_1"
    },
    {
        "source_sentence": "法界非生死亦非涅槃。",
        "translation": "The Dharma realm is neither birth-and-death nor nirvāṇa.",
        "source": "T11n0310_069:0392a11_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0392a12_3"
    },
    {
        "source_sentence": "若復有人於我所說法能決定知者，彼諸眾生於阿耨多羅三藐三菩提皆不退轉。",
        "translation": "If another person can definitely know the teaching I teach, those sentient beings won't regress from unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_069:0392a12_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_069:0392a14_5"
    },
    {
        "source_sentence": "假使法界有其變異，是諸善男子善女人能如是信者，必定當覺無上菩提無有變退。」",
        "translation": "Suppose there's a change in the Dharma realm, and good men and good women who can thus believe will surely realize unsurpassed enlightenment without any change or retreat.",
        "source": "T11n0310_069:0392a14_6"
    },
    {
        "source_sentence": "爾時八億廣果諸天於世尊所演說自己所證法已，頭面禮足，右繞三匝却住一面，",
        "translation": "At that time the eighty-million Vaiśravaṇa gods bowed their foreheads and feet to the Bhagavat, circumambulated him three times to his right, withdrew, and remained at one side.",
        "source": "T11n0310_069:0392a16_7"
    },
    {
        "source_sentence": "「敬禮善逝知法者，　　那羅延力大導師，",
        "translation": "“Friends, venerate the well-gone One who knows the Dharma, The great teacher Nārayanaputra.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　憐愍一切勝牟尼，　　方便示現於真實。",
        "translation": "With pity for all the supreme sages, he skillfully reveals the truth.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　既自了知一切法，　　如實顯示諸世間，",
        "translation": "Knowing all things for themselves, They show the worlds as they really are:",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　稽首無量功德身，　　智慧最勝無上士。",
        "translation": "He bowed his head in respect to the boundless body of virtue, Most excellent in knowledge and wisdom, unsurpassed by any human being.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　如是真實微妙法，　　聖說相應無有異，",
        "translation": "Thus are the true and subtle teachings, Noble teachings that are associated with them without any difference.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　世尊無等大醫王，　　能令眾生法眼淨。",
        "translation": "Bhagavān, the peerless great king of doctors, can purify the Dharma eye of sentient beings.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　敷演八種真聖路，　　為得無上大菩提，",
        "translation": "They show eight kinds of true paths To attain the supreme great enlightenment.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　歸敬無量功德身，　　智慧最勝無上士。",
        "translation": "They pay homage to the body of immeasurable merit, which is the supreme in wisdom and knowledge of the unsurpassed person.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　顯示菩提正直道，　　畢定趣向大涅槃，",
        "translation": "They show enlightenment, the right path of uprightness, And complete concentration leading to great nirvana.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　獲得無等勝菩提，　　寂滅安隱最堅固。",
        "translation": "Attaining peerless supreme enlightenment, tranquil and peaceful, it's most resolute.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　度脫多億那由他，　　輪迴生死苦眾生，",
        "translation": "He liberates millions of sentient beings from the suffering of transmigration through birth and death.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　頂禮無量功德身，　　智慧最勝無上士。",
        "translation": "He pays homage to the body of immeasurable merit, which is the most supreme in wisdom and unexcelled person.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　觀察五陰悉空無，　　陰體畢竟不可得，",
        "translation": "Observing that all five aggregates are empty and nonexistent, The essence of aggregates is ultimately ungraspable.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　彼陰即體離諸觀，　　唯誑愚惑癡眾生。",
        "translation": "That aggregate, that essence, is free of contemplation, but it deceives foolish and deluded sentient beings.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　凡夫於此悉被縛，　　猶如獼猴膠所粘，",
        "translation": "Ordinary people are bound here, just like a monkey attached to glue.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　智者於斯得解脫，　　遊行無礙如空風。",
        "translation": "The wise attain liberation here, traveling unobstructed like an empty wind.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　諸界即體性自空，　　一切智人如是說，",
        "translation": "The elements are essentially self-empty by their own nature. All wise people explain in this way:",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　彼空亦空無自性，　　究竟求之不可得。",
        "translation": "Their emptiness also has no self-nature in emptiness, and ultimately they can't be sought.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　凡夫於此皆被縛，　　都由不知真實性，",
        "translation": "Ordinary people are all bound here, All because they do not know reality.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　智者觀察得解脫，　　於其三界無所著。",
        "translation": "The wise observe and attain liberation, Not clinging to any of the three realms.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　諸入無體自空寂，　　一切智人如是說，",
        "translation": "The sense-fields are insubstantial, self-empty and void; All wise people explain them thus.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　猶如空拳虛非實，　　誑惑愚癡眾生輩。",
        "translation": "It's like an empty fist that's empty but not real, which deceives and confuses foolish sentient beings.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　凡夫妄起取著心，　　皆由於法生疑惑，",
        "translation": "Ordinary people give rise to deluded thoughts of attachment, All due to doubt and confusion about the teachings.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　墜落生死皆喪壞，　　猶如商人沒巨海。",
        "translation": "They'll all fall into birth and death and be destroyed, just like a merchant sinking into a great ocean.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　彼等諸根性自空，　　畢竟推求不可得，",
        "translation": "Their faculties are inherently empty, Ultimately inconceivable.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　譬如鏡中現面像，　　其像無實畢竟空。",
        "translation": "It's like showing a face image in a mirror, whose image has no real ultimate emptiness.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　凡愚無智於此著，　　正由不知真實法，",
        "translation": "Ordinary foolish people lack knowledge and are not attached to this, precisely because they don’t know the true teaching.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　猶如眾鳥入羅網，　　亦如淵中所釣魚。",
        "translation": "It's like a multitude of birds entering a net, and it's like fishing in the abyss.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　眾生無體離生相，　　依真求之不可得，",
        "translation": "Sentient beings have no essence and are free from the characteristics of birth; Relying on truth, they cannot be sought.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　譬如壁上彩畫像，　　究竟無實眾生性。",
        "translation": "It's like a colorfully painted image on a wall that ultimately has no real nature of sentient beings.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　凡夫無智而取著，　　皆由不知真實義，",
        "translation": "Ordinary people lack knowledge and are attached, All because they don’t know the true meaning.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　智者觀彼得解脫，　　猶如卵生出於[穀-禾+卵]。",
        "translation": "A wise person observes Peter's liberation, just like an egg that comes out of the [grass-gras+egg].",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　因緣生法悉無常，　　皆悉空寂離攀緣，",
        "translation": "All things that arise from causes and conditions are impermanent; They are all empty, tranquil, free of clinging.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　譬如夢中所受樂，　　非實誑惑癡凡夫。",
        "translation": "It's like the happiness experienced in a dream that's not really crude and confusing for deluded worldlings.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　愚無智慧為彼縛，　　由不思量妄分別，",
        "translation": "Foolish people lack wisdom and are bound by it. Because they don’t think, they deludedly discriminate.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　智人觀察得解脫，　　猶如飛鳥出籠網。",
        "translation": "A wise person observes and attains liberation, just like a flying bird that emerges from a caged net.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　如佛功德不思議，　　一切諸法亦如是，",
        "translation": "As the Buddha’s virtues are inconceivable, So are all things.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　諸法無相如牟尼，　　法體寂滅如涅槃。",
        "translation": "The signlessness of all dharmas is like a sage; The essence of the dharma is tranquil and extinguished like nirvalJa.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　諸法無依如如來，　　於其三界不取著，",
        "translation": "The teachings have no basis, as the Enlightened One did: He does not cling to any of the three realms.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　是故所有成佛者，　　皆由得知此義故。",
        "translation": "That's why all those who become buddhas are able to do so because they know this meaning.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　諸法無怖如世尊，　　不起自身及他想，",
        "translation": "All things are fearless like the Bhagavān, Who doesn’t give rise to thoughts of self or others.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　諸法難思如導師，　　唯佛能知導群生。",
        "translation": "The teachings are inconceivable like a guide— Only Buddha can know and guide sentient beings.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　法無分別如善逝，　　非是凡夫心所行，",
        "translation": "The dharmas are nondiscriminating like Buddha, Not the mental states of worldlings.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　是諸如來妙境界，　　唯佛大聖能了知。",
        "translation": "These are the marvelous realms of the enlightened: Only buddhas and great sages can know them.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　若有無智作是言，　　佛證無等大菩提，",
        "translation": "If there are those without knowledge who say this, The Buddha will realize peerless great enlightenment.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　若復有人作是言，　　世尊已轉妙法輪。",
        "translation": "If another person says, Bhagavān, the Bhagavān has turned the wonderful wheel of the Dharma.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　若復有人作是言，　　善逝已度那由眾，",
        "translation": "Again, if someone says, Bhagavān, you have liberated the people of Nārāyaṇasī.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　彼悉為見之所縛，　　皆由不知真實性。",
        "translation": "They're all bound by views, all because they don't know their true nature.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　若人謂佛如是說，　　殺害行陰及與命，",
        "translation": "If someone says the Buddha teaches in this way, They harm the aggregate of volition and also life.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　若言十力入涅槃，　　利益無量眾生已。",
        "translation": "If someone says the ten powers enter nirvāṇa, they'll benefit measureless sentient beings.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　彼人一切皆執見，　　入於魔羅之所縛，",
        "translation": "They all cling to views and enter the bondage of Māra.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　不能解知真如法，　　以不知故不知佛。",
        "translation": "They can't understand and know the true teaching; because they don't know it, they don't know the Buddha.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　若有善知是非者，　　彼皆能知大導師，",
        "translation": "If there are those who well know right and wrong, They can all know the great Guide.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　當獲無上功德聚，　　成佛憐愍於世間。",
        "translation": "They will attain the unsurpassed stock of merit, become buddhas, and have compassion for the world.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　斯即真如無變易，　　一切諸法離疑惑，",
        "translation": "This is the unchanging nature of reality: All things are free from doubt and confusion.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　人中無上最勝尊，　　我等已知如是義。」",
        "translation": "Unsurpassed among humans, most excellent and honored, we've known such a meaning.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　如是廣果諸天眾，　　咸皆於法得盡知，",
        "translation": "In this way, the gods of vast realization All had complete knowledge of the teaching.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　對佛導師自演說，　　現己內心淨信解。",
        "translation": "He explains it to the Buddha's guide, expressing pure faith and understanding in his own mind.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　一切欣喜無疑慮，　　各自見已當成佛，",
        "translation": "All are joyful and without doubt, Each seeing that they’ll become buddhas.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "　此是如來微妙法，　　彼即自受導師記。",
        "translation": "This is the subtle teaching of the enlightened, which they themselves receive from their teacher.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "合掌而立，異口同聲以偈讚佛：爾時世尊知廣果諸天深信具足，於佛法中決定無疑，",
        "translation": "He joined his palms and stood upright, saying in unison with one voice, Praise to the Buddha in verse: At that time the World-honored One knew that the gods of Vaiśravaṇa were endowed with deep faith and certainty regarding the Buddha’s teaching without doubt.",
        "source": "T11n0310_069:0392a18_8"
    },
    {
        "source_sentence": "欲令大眾種善根故而現微笑。",
        "translation": "He wanted to cause the masses to cultivate good roots, so he showed a smile.",
        "source": "T11n0310_069:0392c22_9"
    },
    {
        "source_sentence": "「智慧導師功德山，　　非是無因而現笑，",
        "translation": "The Guide of Wisdom, the mountain of virtue, Is not laughed at because it is without cause.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　我從善逝親自聞，　　世尊現笑必有因。",
        "translation": "I've heard it from Sunetra himself, and the Bhagavān's present smile must have a cause.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　如來示此微笑相，　　令眾皆受清涼樂，",
        "translation": "The Buddha shows these signs of smiling, Causing all beings to experience coolness and bliss.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　天人修羅大導師，　　唯願演說笑因緣。",
        "translation": "The great guide of the gods and humans, the asura, Please explain the causes and conditions for their laughter.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　今見如來從面門，　　所現微笑甚清涼，",
        "translation": "Now I see the Buddha coming from my own face, smiling in a most pure and cool way.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　此諸眾會悉懷疑，　　一心瞻仰如來面。",
        "translation": "These assemblies all wondered, gazing at the Buddha’s face with one mind.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　大悲最勝人中上，　　願說希有微笑因，",
        "translation": "Great compassion is the supreme among humans, best of all. May it be explained as a rare cause for smiling.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　世間若得從佛聞，　　決定必除疑惑心。",
        "translation": "If the world hears from the Buddha, they'll surely remove doubt and confusion in their minds.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　世尊！彼等諸天眾，　　咸皆演說自授記，",
        "translation": "Bhagavān, those celestial beings all explained and predicted for themselves.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　以何功德獲何果？　　願說成佛神通事。",
        "translation": "By what virtue and by what fruit will they attain?",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　開演微妙梵音聲，　　唯願普斷諸有疑，",
        "translation": "He uttered the subtle, pure sound of Brahma’s voice. All he wished was to eliminate all doubt in those who had doubts.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　一切大眾聞佛說，　　皆悉踊悅甚欣喜。",
        "translation": "All the great assemblies, hearing what the Buddha taught, They all rejoiced and were overjoyed.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　斯等合掌皆一心，　　淨信瞻仰恭敬住，",
        "translation": "All of them joined their palms in unified minds, Abiding with pure faith, gazing respectfully.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　佛子天眾各思惟，　　悕求無上大菩提。",
        "translation": "The Buddha-children and gods each think, Seeking the supreme great enlightenment.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　是諸眾會有疑惑，　　唯願如來為除斷，",
        "translation": "All these assemblies have doubts and confusions. May the Enlightened One remove them!",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　必當得力知是非，　　具足成就一切智。",
        "translation": "They will surely attain the power to know right and wrong, fully perfecting omniscience.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　得聞如來八種音，　　天眾靡不皆喜悅，",
        "translation": "Hearing the eight kinds of voices of Buddha, All the celestial beings were joyful and delighted.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　當得護持如來教，　　隨順正法如說行。",
        "translation": "They will be able to preserve the teachings of the enlightened and follow the right teaching, practicing according to what they teach.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　觀察知彼天心已，　　無上大智願解說，",
        "translation": "Observing and knowing the minds of those gods, he wishes to explain it with unexcelled great knowledge.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　以是大眾生欣喜，　　於佛法中得信解。",
        "translation": "Because of this, the masses become joyful and attain faith in the Buddha’s teaching.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　今於導師願得聞，　　天眾過去所修行，",
        "translation": "I now wish to hear from the Guide The teachings practiced by the gods of the past.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　若蒙如來解說已，　　所願皆悉得滿足。",
        "translation": "If they hear the Buddha’s explanation, All their wishes will be fulfilled.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　廣果諸天如法行，　　必得成就一切智，",
        "translation": "The vastly fruitful gods who practice according to the teaching Will surely attain omniscience.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　當度世間諸群生，　　顯示真如法體性。」",
        "translation": "You will save all the sentient beings in the world and reveal the essence of the true nature of the Dharma.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "「善哉馬勝汝知時，　　今者問我正是宜。",
        "translation": "Good, Mañjuśrī, you know the time, but now it's appropriate for you to ask me.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　我為廣果諸天輩，　　於此大眾現微笑。",
        "translation": "For the sake of the Vaiśravaṇa gods, I'll show a smile in this crowd.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　今當為汝分別說，　　咸皆一心共諦聽，",
        "translation": "I will now explain it for you in detail. Listen attentively, with one mind and all together.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　所現微笑因緣義，　　汝及大眾悉得聞。",
        "translation": "The meaning of the causes and conditions for the smile you show, You and the masses will all hear it.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　如來具足一切智，　　觀察因緣有三種，",
        "translation": "The Enlightened One is endowed with omniscience. There are three kinds of observing causes and conditions:",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　二足德聚正觀已，　　而現微笑示世間。",
        "translation": "After correctly observing the two-legged cluster of virtue, he smiles and shows it to the world.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　有樂住於涅槃者，　　少智微淺願聲聞，",
        "translation": "Those who delight in abiding in nirvana have little knowledge and shallow aspirations for śrāvakas.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　復有樂住默然者，　　志求辟支佛菩提。",
        "translation": "Again, there are those who delight in remaining silent And aspire to the enlightenment of the pratyekabuddhas.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　復有樂求世導師，　　成佛大力那羅延，",
        "translation": "There are also those who delight in seeking worldly guides And become buddhas with great power, Nārayana.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　我觀彼等深信已，　　隨所樂欲而度脫。",
        "translation": "Having observed their deep faith, I liberate them according to their desires and pleasures.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　為求聲聞示現者，　　當知是其最下笑，",
        "translation": "Those who seek to be shown by the śrāvakas should know that this is their lowest laughter.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　應當知我中品笑，　　為求辟支而示現。",
        "translation": "You should know that my middle grade of laughter is shown in order to seek the pratyekabuddhas.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　馬勝當知此上笑，　　為諸天眾授佛記，",
        "translation": "Ma勝, you should know that this is the above laughter. For the sake of gods and goddesses he teaches the Buddha’s prediction:",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　我說此三解笑因，　　所謂最下及中上。",
        "translation": "I'll explain these three causes of understanding and laughter, which are called the lowest and middling.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　善解世間勝導師，　　而作微笑現瑞相，",
        "translation": "Understanding the world’s supreme Guide, They smile and show signs of blessings.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　佛知眾生欲三乘，　　願樂求證於聖果。",
        "translation": "Knowing that sentient beings want the three vehicles, the Buddha wish to happily seek and realize the noble fruit.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　為求聲聞現笑者，　　微笑光明從足沒，",
        "translation": "In order to find the śrāvakas who are smiling, The light of smile disappears from their feet.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　為求辟支所示現，　　當知笑光入臍輪。",
        "translation": "In order to seek the manifestation of the pratyekabuddhas, you should know that laughing light enters the navel wheel.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　為受無上十力者，　　其光從佛頂上入，",
        "translation": "In order to receive the supreme ten powers, That light enters from the top of the Buddha’s head.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　馬勝汝今應當知，　　微笑因緣有三種。",
        "translation": "You should now know that there are three kinds of causes and conditions for smiling.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　我向所現微笑光，　　彼光於我頂上沒，",
        "translation": "I show a smiley light to you, and that light disappears from my topknot.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　當知先所現微笑，　　悉為無上菩提記。",
        "translation": "You should know that the previously shown smile Is all assurance of unsurpassed enlightenment.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　我今當更為汝說，　　微笑復有三種因，",
        "translation": "I will now tell you something else. Again, there are three reasons for smiling:",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　善哉馬勝及大眾，　　一心靜意俱諦聽。",
        "translation": "Excellent, Mahākauṣṭhila and the assembly of monks! Listen attentively with one-pointed concentration.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　前現微笑為佛者，　　其光即從頂上入，",
        "translation": "He who smiles and becomes a buddha in front, That light enters from the top of his head.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　有光少時住身腰，　　須臾沒者為辟支。",
        "translation": "When there's light that abides in body and waist for a little while, the one who disappears in an instant is a pratyekabuddha.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　我現微笑放光明，　　暫時在於足前住，",
        "translation": "I smiled and emitted a ray of light, standing at my feet for a moment.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　斯光隨乘而變現，　　當知此為聲聞人。",
        "translation": "These lights are manifested in accordance with the vehicles: You should know that these people are śrāvakas.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　今復更說微笑因，　　馬勝諦聽有三種，",
        "translation": "Now, I'll explain the cause of smiling again. There are three kinds of superior listening:",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　導師所放諸光明，　　出已圍繞於十力。",
        "translation": "The light emitted by the Guide Is surrounded by the ten powers after emerging.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　其光既出皆踈散，　　還復速聚繞身腰，",
        "translation": "When that light emerges, they all scatter and quickly gather around their bodies and waists.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　漸漸轉復更增廣，　　亦還右繞於如來。",
        "translation": "Gradually increasing in size and width, They also circumambulate the Buddha to his right.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　有光初停後廣大，　　漸漸右繞於我身，",
        "translation": "There’s a ray of light that first stops and then grows larger, Gradually circling me to my right.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　彼光悉遍世尊形，　　與身俱等無有異。",
        "translation": "That light completely pervades the form of the Bhagavān, Equal to his body without any difference.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　其光莊嚴佛身相，　　暉赫猶如真金聚，",
        "translation": "The light adorned the features of the Buddha’s body, shining brilliantly like a real heap of gold.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　牟尼所放微笑光，　　當知此光記剎土。",
        "translation": "The smiley light emitted by the Sage, You should know that this light remembers the buddha-lands.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　有光出已猶如蓋，　　於上遍覆世尊身，",
        "translation": "A ray of light emerges like a lid that covers the body of the World-honored One.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　有光如花空中住，　　其光照曜於導師。",
        "translation": "There's a light like a flower in the sky that shines brightly and illuminates the guide.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　彼光一切皆右旋，　　三匝圍繞如來身，",
        "translation": "All the rays of light revolved to the right, circling the Buddha’s body three times.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　當知此光記壽命，　　出世大智現斯瑞。",
        "translation": "You should know that this light remembers life, and that the worldly great sage manifests this miraculous manifestation.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　斯等三種微笑光，　　善逝隨根差別現，",
        "translation": "These are the three kinds of smilelike light, Manifested by Buddha according to differences in faculties.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　馬勝汝今應當知，　　此是三種微笑因。",
        "translation": "You should now know that this is the cause of these three kinds of smiling.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　世間導師所現相，　　善知眾生深信樂，",
        "translation": "The manifest forms of worldly Guides They know well the profound faith and joy of sentient beings.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　今於如來教法中，　　汝等聞此得除疑。",
        "translation": "Now, in the teaching of the Tathāgata, you hear this to remove your doubts.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　是諸廣果天眾等，　　其數滿足有八億，",
        "translation": "These were the Vaiśravaṇa gods, Eight hundred myriads of koṭis in number.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　廣說微妙正法門，　　各於異剎得成佛。",
        "translation": "He extensively explains the subtle and true teaching, Each attaining buddhahood in different lands.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　壽命具足無有量，　　經由多劫住於世，",
        "translation": "Their life spans are immeasurable, Abiding in the world for many kalpas.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　是故如來現斯瑞，　　廣大光明五種色。",
        "translation": "That's why the Tathāgata manifests these five forms of vast light.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　此諸天眾於過去，　　三十有六僧祇劫，",
        "translation": "These gods were present in the past For thirty-six cosmic ages.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　常得值遇諸世尊，　　親承供養習諸善。",
        "translation": "They are always able to meet the world-honored ones, receive their offerings and cultivate goodness.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　又復經於三十六，　　阿僧祇劫廣修行，",
        "translation": "Again, for thirty-six Incalculably long eons he practiced extensively.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　斯等大士住世間，　　供養如來未曾倦。",
        "translation": "These great men live in the world, honoring the Tathāgata without ever getting tired of making offerings.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　思惟救度眾生故，　　數數勤修供養佛，",
        "translation": "Because they contemplate saving sentient beings, They repeatedly and diligently cultivate offerings to buddhas.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　供養世尊應其宜，　　悕求無上大菩提。",
        "translation": "It's appropriate to make offerings to the Bhagavān and seek unsurpassed great enlightenment.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　彼諸天眾未來世，　　當得作佛那羅延，",
        "translation": "Those gods will be able to become buddhas in the future.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　成妙牟尼功德山，　　其劫號曰勝金幢。",
        "translation": "He will become a mountain of the finest sages’ virtues, The kalpa of which will be called Supreme Gold Banner.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　是諸如來各自住，　　清淨莊嚴國土中，",
        "translation": "Each of these buddhas dwelled In a purely adorned land.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　彼佛同號日光輪，　　具足無量功德聚。",
        "translation": "That Buddha is also called Wheel of Sunlight, Endowed with boundless stores of virtue.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　一一如來各住世，　　經於無量那由劫，",
        "translation": "Each one of the Buddhas stayed in the world For an infinite eon.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　此諸善逝所集眾，　　無量無邊不可數。",
        "translation": "The congregation of these Buddhas is immeasurable, boundless, limitless, and incalculable.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　一一導師成佛時，　　所有聲聞弟子輩，",
        "translation": "One by one, when the Guide becomes a buddha, All the disciples and śrāvakas There will be.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　十力住經那由劫，　　算數彼眾不可盡。",
        "translation": "Ten powers abide for an eon, numbering as many eons as there are; Their numbers cannot be counted.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　若有算師悉共聚，　　亦算彼眾不能盡，",
        "translation": "If there are calculators who gather all together, they can't count all of them.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　當時所有諸菩薩，　　倍多於彼聲聞眾。",
        "translation": "The bodhisattvas and śrāvakas of that age More than doubled the number Of those who had attained buddhahood.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　皆悉發心住佛乘，　　願得當成一切智，",
        "translation": "They are all determined to abide in the buddha vehicle, Vowing to attain omniscience.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　於其清淨國土中，　　悉當成佛具十力。",
        "translation": "In their pure lands They will all become buddhas, Endowed with the ten powers.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　是諸菩薩所修行，　　皆如本師無有異，",
        "translation": "These practices of enlightening beings are all the same as their original teacher’s, without any difference.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　彼諸如來滅度後，　　正法興顯久住世。",
        "translation": "After the parinirvāṇa of those buddhas, The true teaching emerged and remained in the world for a long time.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　經於十二那由劫，　　為諸佛子所護持，",
        "translation": "For twelve billion eons They will be preserved by the offspring of Buddha.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　此諸佛法熾盛時，　　有發無上菩提心。",
        "translation": "When these buddhas’ teachings flourish, Some give rise to the supreme aspiration for enlightenment.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　其數過於恒河沙，　　皆悉勤修菩薩行，",
        "translation": "Their numbers are as numerous as the sands of the Ganges River, All diligently cultivating enlightening practice.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　彼諸善逝滅度已，　　所有一切聲聞眾。",
        "translation": "After the parinirvāṇa of those well-gone buddhas, All the śrāvakas there are.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　斯眾皆悉得涅槃，　　過於大海諸沙數，",
        "translation": "All of these beings will attain nirvana, Beyond the number of grains of sand in the great ocean.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　如是彼諸佛正法，　　具足興顯於世間。",
        "translation": "Thus are those buddhas’ true teachings Completely manifested in the world.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　饒益無量諸眾生，　　彼教如法大興盛。",
        "translation": "Benefiting measureless sentient beings, their teaching flourishes according to the teaching.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　如是聞佛所說已，　　一切大眾皆信解，",
        "translation": "Having heard these teachings of the Buddha, All the great assemblies believe and understand them.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　必當得成佛世尊，　　廣能利益諸群生。",
        "translation": "They will surely become buddhas, world-honored ones, Able to extensively benefit all living beings.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　是時眾會悉欣喜，　　頭面禮拜如來足，",
        "translation": "The whole assembly was then joyful, bowed their heads and faces at the feet of the Enlightened.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　無等恭敬於善逝，　　如法供養天人師。",
        "translation": "Equally respectful to the well-gone, they make offerings to the teacher of gods and humans in accordance with the teaching.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　是故踊躍發精進，　　猶如有人救頭燃，",
        "translation": "For this reason they rise up and make effort, Just as someone who saves a burned-out man’s hair.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　常應親近善知識，　　勤修般若波羅蜜。",
        "translation": "You should always associate with good friends And diligently practice transcendent wisdom.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　此是見實勝進行，　　汝等比丘應修習，",
        "translation": "This is the practice of insight that’s really superior. You monks should cultivate it.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "　當成無上二足尊，　　功德如山利世間。」",
        "translation": "He'll become the unsurpassed two-legged honored one, whose merit will be like a mountain of worldly benefits.",
        "source": "T11n0310_069:0392c22_10"
    },
    {
        "source_sentence": "爾時慧命馬勝以偈問世尊言：爾時世尊即以偈答慧命馬勝曰：大寶積經卷第六十九",
        "translation": "At that time, the World-honored One answered Maudgalyāyana in verse:",
        "source": "T11n0310_069:0392c22_10"
    }
]