[
    {
        "source_sentence": "文殊師利佛土嚴淨經卷上",
        "translation": "Mañjuśrī's Pure and Adorned Sutra of the Buddha-lands of Mañjuśrī, Volume 1",
        "source": "T11n0318_001:0890c05_0"
    },
    {
        "source_sentence": "西晉月氏國三藏竺法護譯",
        "translation": "Translated by Zhu Fahou, a translator of the Tripiṭaka of the Western Jin state of Yuezhi",
        "source": "T11n0318_001:0890c07_0"
    },
    {
        "source_sentence": "聞如是：一時佛遊王舍城靈鷲山，與大比丘十萬眾俱；",
        "translation": "Thus I have heard: One time the Buddha sojourned at Vulture Peak in the city of Rājagṛha accompanied by one hundred thousand great bhikṣus.",
        "source": "T11n0318_001:0890c08_0"
    },
    {
        "source_sentence": "及諸菩薩八萬四千，皆不退轉無所從生，逮得權慧神通無極，隨時而化救濟三界，",
        "translation": "And all the eighty-four thousand enlightening beings did not regress and do not arise from anything. They acquired unexcelled spiritual powers of righteousness, wisdom, and superknowledge; they instantly liberated and rescued",
        "source": "T11n0318_001:0890c09_1"
    },
    {
        "source_sentence": "其名曰：文殊師利、光世音、大勢至諸菩薩等咸來雲集。",
        "translation": "Their names were Mañjuśrī, Bhagavān, Mahāsthāmaprāpta, and other enlightening beings who had come to this assembly.",
        "source": "T11n0318_001:0890c11_2"
    },
    {
        "source_sentence": "七十二億諸天子俱，皆志大乘；",
        "translation": "All the seventy-two billion celestial beings there aspired to the Great Vehicle.",
        "source": "T11n0318_001:0890c12_3"
    },
    {
        "source_sentence": "四天王、帝釋、梵天王，各與四萬二千諸釋梵俱，悉慕大道；",
        "translation": "The four guardian gods of heaven, the deities Indra and Brahma, each with forty-two thousand Indras and Brahmas, all yearned for the great path.",
        "source": "T11n0318_001:0890c13_4"
    },
    {
        "source_sentence": "四方阿須倫王，難頭和難龍王、和倫龍王、娑竭龍王、摩那私龍王、持地龍王、阿耨達龍王、山積龍王、降魔龍王、上月龍王，",
        "translation": "The asura kings of the four directions were Nanda and Upananda, Vārāṇasī, Sāgara, manas, earth-holding dragon king, Anavatapta, mountain-accumulating dragon king, demon-conquering dragon",
        "source": "T11n0318_001:0890c14_5"
    },
    {
        "source_sentence": "如是龍王，各從其民六萬二千；",
        "translation": "Each of these nāga kings was accompanied by sixty-thousand twenty-two thousand people.",
        "source": "T11n0318_001:0890c17_6"
    },
    {
        "source_sentence": "金比鬼神、曠野鬼神、妙毛鬼神、普等鬼神、善普鬼神、善財鬼神、普像鬼神、無諍鬼神，",
        "translation": "The spirit of gold, the spirit of the wilderness, the spirit of marvelous hair, the spirit of universal equality, the spirit of goodness and universality, the spirit of good wealth, the spirit of universal images, and the spirit of no anger.",
        "source": "T11n0318_001:0890c17_7"
    },
    {
        "source_sentence": "是諸鬼王，各與等類百千眾俱來詣佛所。",
        "translation": "These kings of ghosts each came to the Buddha accompanied by hundreds of thousands of others.",
        "source": "T11n0318_001:0890c19_8"
    },
    {
        "source_sentence": "皆各稽首，以次就位，悉都專精志願經道、飢虛於法，身口意并加敬歸佛，",
        "translation": "They all bowed their heads and, in order, assumed their thrones. They all concentrated on the aspiration for enlightenment, hungered for the Teaching, and paid homage to the Buddha with body, speech, and mind.",
        "source": "T11n0318_001:0890c20_9"
    },
    {
        "source_sentence": "靖心而聽。",
        "translation": "He calms his mind and listens.",
        "source": "T11n0318_001:0890c22_10"
    },
    {
        "source_sentence": "爾時國王、太子、大臣、百官、長者、居士、民眾大小、天龍鬼王，咸共供養，",
        "translation": "It was then that the king, princes, ministers, hundreds of officials, elders, householders, people large and small, celestial dragons, and ghost kings all made offerings.",
        "source": "T11n0318_001:0890c23_0"
    },
    {
        "source_sentence": "隨其所安。",
        "translation": "He follows what he's settled.",
        "source": "T11n0318_001:0890c24_1"
    },
    {
        "source_sentence": "時佛明旦著衣持鉢與大眾俱，天龍鬼王侍從左右上虛空中，四種蓮華紛紛如雨，",
        "translation": "The next morning the Buddha was clothed, with his almsbowl and bowl in hand, accompanied by a great assembly of gods, dragons, ghosts, and kings. A Forest of Pearls from the Dharma Garden, Volume",
        "source": "T11n0318_001:0890c24_2"
    },
    {
        "source_sentence": "百千伎樂不鼓自鳴，皆作釋梵雅頌八聲，詣阿闍貰就王之請。",
        "translation": "Hundreds of thousands of musicians played without drums, all singing the eight sounds of Śākyamuni and Brahmā, and they went to Ajātaśatru at the king's invitation.",
        "source": "T11n0318_001:0890c26_3"
    },
    {
        "source_sentence": "佛顯神足光照十方，七寶蓮華隨跡處生。",
        "translation": "The Buddha manifested his miraculous feet shining in ten directions, and the seven-jeweled lotus flower grew wherever he was born.",
        "source": "T11n0318_001:0890c28_4"
    },
    {
        "source_sentence": "「其導師至神，　　所愍哀無量，",
        "translation": "Their guide is supremely compassionate, And his sympathy is immeasurable.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　方便護眾生，　　消病愈諸瘡。",
        "translation": "He skillfully protects sentient beings, curing illnesses and healing sores.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　能仁無所著，　　心寂善調和，",
        "translation": "Able to be benevolent without attachment, Their minds tranquil and well harmonious.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　彼吼護世明，　　今日欲入城。",
        "translation": "That roar protects the world's wisdom, and today I want to enter the city.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　其意已解脫，　　度生老病死，",
        "translation": "Their minds have been liberated from birth, old age, sickness, and death.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　諸天眾集會，　　各懷欣樂志，",
        "translation": "The heavenly beings assembled, Each with joy and happiness in their hearts.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　其心甚堅強，　　降魔并官屬，",
        "translation": "Their minds are so strong that they subdue Māra and his officials.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　釋師子至聖，　　尊導已來到。",
        "translation": "The Śākya lion, the supreme sage, Has already come to guide us.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　壞世眾不消，　　至真音難致，",
        "translation": "Disintegrating worlds won’t disappear, Their ultimate truth is hard to attain.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　甚猛能制御，　　行道億千劫。",
        "translation": "He's so fierce and capable of controlling it that he travels the path for billions of eons.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　意抱大慈愍，　　普護於一切，",
        "translation": "Embracing great compassion in their hearts, They protect all beings.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　今日真正覺，　　當入王舍城。",
        "translation": "Today, truly awakened, I will enter the city of Rājagṛha.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　本所行布施，　　難量無涯底，",
        "translation": "Their original practice of giving is immeasurable and limitless.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　衣食眾寶乘，　　無復有計限。",
        "translation": "There's no limit to the number of people who eat and drink from the jeweled vehicle in clothing.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　惠所愛男女，　　妻室及國界，",
        "translation": "Men and women beloved by Hui, wives, houses, countries, and boundaries.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　今彼釋師子，　　欲入國王宮。",
        "translation": "Now, that Śākya lion wants to enter the king's palace.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　宿世施手足，　　頭目及耳鼻，",
        "translation": "In the constellations, he gives his hands, feet, head, eyes, ears, nose, and nose.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　普惠無所逆，　　不貪悋重珍，",
        "translation": "Universal benevolence is not opposed, Not covetous or attached to precious things.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　總攝眾功勳，　　施一切所有，",
        "translation": "To gather all merits together, Giving to all that exists.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　尊人以是故，　　得入一切智。",
        "translation": "Because of this, the venerable person has entered into omniscience.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　常以勤修學，　　布施至戒慧，",
        "translation": "He always diligently cultivates practices, bestows generosity, upholds precepts, and wisdom.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　護戒無缺漏，　　故曰真丈夫。",
        "translation": "Protecting the precepts without fail, he's therefore called a true husband.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　逮戒照忍辱，　　持功勳無量，",
        "translation": "Obtaining the precepts, he illuminates tolerance and forbearance, maintaining immeasurable merit.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　彼寂然心定，　　今日當入城。",
        "translation": "Their minds are still and concentrated, and today they'll enter the city.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　於百千億劫，　　行精進解脫，",
        "translation": "For hundreds of thousands of myriads of koṭis of kalpas I practiced liberation by effort.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　哀傷眾生故，　　心未曾懈倦，",
        "translation": "Because they have compassion for sentient beings, their minds never become lazy.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　一心不可撿，　　已度於彼岸，",
        "translation": "Having crossed over to the other shore with a single mind that cannot be picked up,",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　音聲越梵天，　　今日欲入城。",
        "translation": "The sound transcends the Brahma heavens, and today I want to enter the city.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　其聖明道慧，　　無限不可量，",
        "translation": "The wisdom of the holy path of insight is boundless and immeasurable.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　不可得邊涯，　　假喻如虛空。",
        "translation": "The bounds of ungraspability are metaphors like space.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　人中寶如是，　　智德不可盡，",
        "translation": "Such are the treasures among men, Their knowledge and virtue inexhaustible.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　緣從達眾行，　　嚴淨至尊惠。",
        "translation": "Conditioned by the attainment of all practices, he's adorned and pure up to the point of honoring wisdom.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　因坐佛樹下，　　降魔及官屬，",
        "translation": "He sat at the foot of a buddha-treat, Overpowering Māra and his officials.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　逮無退道明，　　永安無憂慼。",
        "translation": "Attaining the insight of the path of non-backsliding, he's permanently at peace without sorrow.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　道聖轉法輪，　　所度不可極，",
        "translation": "The Noble One of the Way turns the wheel of Dharma, Unsurpassed by anyone.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　今日釋師子，　　欲入王舍城。",
        "translation": "Today, the Śākya lion wants to enter Rājagṛha.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　若有發道意，　　我當得成佛，",
        "translation": "If you give rise to the intention for enlightenment, I will become a buddha.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　處世逮究竟，　　諸相三十二。",
        "translation": "The thirty-two secondary signs are acquired in the world.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　常興意無量，　　至誠發道心，",
        "translation": "Their minds always arouse infinite aspirations, With sincerity they develop the determination for enlightenment.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　輒歸於最勝，　　供養人中聖。",
        "translation": "They'll easily return to the most superior, the noble among people who make offerings.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　欲斷婬怒癡，　　消眾塵勞穢，",
        "translation": "They want to cut off lust, anger, and delusion, To extinguish the defilements of all worldly desires.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　志降伏一切，　　無益瑕疵難，",
        "translation": "Their resolve to subdue all is useless, with flaws and difficulties.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　便宜速行詣，　　釋師子聖尊，",
        "translation": "It's a good idea to quickly go there, and the noble honored one Śāriputra, the lion of the Buddha,",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　奉貢眾好養，　　恪心不可限。",
        "translation": "I bow to all kinds of good offerings, and my mind is unremittingly pure.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　若欲生天上，　　天帝釋梵王，",
        "translation": "If they want to be born in heaven, Indra, Brahmā, or the lord of gods,",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　百千億諸天，　　所知見宗仰，",
        "translation": "Hundreds of thousands of myriads of koṭis of gods Whose knowledge and vision are esteemed by the assembly.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　常遭值安樂，　　在天不失時，",
        "translation": "They will always find peace and happiness, Abiding in heaven at the proper time.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　當詣釋師子，　　所宣辭至真。",
        "translation": "I will go to the lion of the Śākyas And proclaim my words as true as they are.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　其欲慕聖帝，　　王於四方城，",
        "translation": "They desired the emperor, who ruled over the four quarters of the empire.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　自然致七寶，　　令我逮尊貴，",
        "translation": "They will naturally bring forth the seven treasures, enabling me to attain their nobility.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　千子諸德具，　　殊桀甚勇猛，",
        "translation": "A thousand sons, endowed with virtue, The ruler is very brave and courageous.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　常勤奉事歸，　　至真大尊人。",
        "translation": "He always diligently serves and returns to the supremely great venerable person.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　若好尊者位，　　長者積財寶，",
        "translation": "If someone likes the position of a venerable, An elder accumulates wealth and treasure.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　其生業廣大，　　常遊得自在，",
        "translation": "Their karma of birth is vast, They always travel and attain freedom.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　眷屬悉豪貴，　　端正顏殊好，",
        "translation": "Their retinues are all powerful and noble, With a dignified countenance of great beauty.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　當詣釋師子，　　名好物供尊。",
        "translation": "He'll go to the Śākyamuni, who's called the honored one who makes offerings of good things.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　其有已解脫，　　方應求度者，",
        "translation": "Those who have attained liberation Only then should they seek salvation.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　咸當諦聽受，　　大聖說寂寞，",
        "translation": "They should all listen attentively and accept it. The Great Sage teaches loneliness.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　以聞甘露句，　　寂然無憂患，",
        "translation": "By hearing the words of ambrosia, They are tranquil and without sorrow.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "　人中之尊導，　　音聲甚難值。」",
        "translation": "It's the most honored guide among people, and its voice is so difficult to find.",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "有化菩薩皆坐其上，光像分明不可稱紀，遶城七匝而歎頌曰：於時王舍城中無央數眾，",
        "translation": "The apparitional bodhisattvas were all seated there, their light and images so distinct that they could not be measured. They circled the city seven times and praised it in verse, saying:",
        "source": "T11n0318_001:0890c29_5"
    },
    {
        "source_sentence": "聞此歎頌勸訓之音，莫不欣悅皆發道心，各齎眾華諸雜妙香，幢幡寶蓋伎樂百千，",
        "translation": "When they heard these verses of praise and exhortation, all rejoicingly aroused the aspiration for enlightenment. Each brought flowers and various exquisite fragrances, banners, pennants, jeweled canopies, and",
        "source": "T11n0318_001:0891c04_6"
    },
    {
        "source_sentence": "出城迎佛，稽首足下退從佛後。",
        "translation": "He left the city to meet the Buddha, bowed his head at his feet, and withdrew behind him.",
        "source": "T11n0318_001:0891c06_7"
    },
    {
        "source_sentence": "世尊入城足蹈門閫，地則尋時六反震動，箜篌樂器不鼓自鳴，婦女珠環相[改-己+亭]作聲，",
        "translation": "When the World-honored One entered the city, he stepped at the entrance of the gate with his feet on the ground. The earth quaked six times in an instant; the drums and instruments that played music were not drummed but sounded by themselves",
        "source": "T11n0318_001:0891c07_8"
    },
    {
        "source_sentence": "天雨華香其下紛紛，盲視聾聽、瘂言跛行、病愈狂正、拘躄得伸，諸被毒螫毒螫不行，",
        "translation": "The heavenly rain and the fragrance of flowers fell down like clouds. Blind, deaf, dumb, speechless, and crippled people traveled there; those who became ill were cured only when they recovered from their ailments by torture",
        "source": "T11n0318_001:0891c09_9"
    },
    {
        "source_sentence": "裸者得衣貧者得財，飛鳥走獸相和悲鳴。",
        "translation": "The naked man who obtains clothing and the poor man who obtains possessions, flying birds and walking animals are harmonious and wailing in sorrow.",
        "source": "T11n0318_001:0891c10_10"
    },
    {
        "source_sentence": "當爾之時，眾生慈心無婬怒癡，滅除貢高猜恚恨疑，和悅相向如父如母，",
        "translation": "At that point, sentient beings are compassionate and free of anger and wickedness in their minds, extinguishing the doubts of pride and suspicion, and serenely facing each other like fathers and mothers.",
        "source": "T11n0318_001:0891c11_11"
    },
    {
        "source_sentence": "如兄如弟如身如子，各各欣喜而歎頌曰：「人中之上如月盛滿，　為正導師丈夫師子。",
        "translation": "Like brothers and children, like bodies and children, they each rejoiced and praised each other, saying, Above the moon in the human realm is the lion of men who serve as correct guides.",
        "source": "T11n0318_001:0891c13_12"
    },
    {
        "source_sentence": "　世尊入城利益眾生，　普安一切盲聾視聽，　飢飽寒溫亂者得定，　貧者得富狂邪得正。",
        "translation": "The Bhagavān enters the city to benefit sentient beings, providing for all blind and deaf people who see and hear, hungry and hungry, cold and hot and disturbed people attain concentration, poor people attain prosperity, crazed and",
        "source": "T11n0318_001:0891c17_0"
    },
    {
        "source_sentence": "　諸天在上散雨華香，　作眾伎樂以為供養。",
        "translation": "The gods above showered rain, flowers, and incense, and offered offerings of music and tricks.",
        "source": "T11n0318_001:0891c21_0"
    },
    {
        "source_sentence": "　眾生慈心無三毒名，　下心悅意除憍慢情，　如父如母如弟如兄，　如身如子心同意并。",
        "translation": "The compassionate minds of sentient beings have no names like the three poisons, and their lower minds are delighted to rid themselves of arrogance, just as fathers are like mothers, brothers are like brothers, and bodies are",
        "source": "T11n0318_001:0891c23_0"
    },
    {
        "source_sentence": "　世尊法澤等潤十方，　天人群類解無希望，　功勳如是所現難量，　十方威德班宣三藏。」",
        "translation": "Bhagavān, the Dharma and so forth of the Bhagavān are equally moistened in the ten directions, gods and humans understand without hope, their merit is thus immeasurable as it appears, and the authoritative class of",
        "source": "T11n0318_001:0891c27_0"
    },
    {
        "source_sentence": "於時城中，有貴姓子名棄惡，遙覩世尊行步正齊，容儀端正威神光曜，",
        "translation": "In the city at that time there was a noble clansman named Jīvaka, who had renounced evil. The World-honored One walked upright from a distance and his appearance was dignified and dignified. His manner was dignified",
        "source": "T11n0318_001:0892a02_0"
    },
    {
        "source_sentence": "諸根寂定恬淡玄默，和雅其性如水澄渟，中表清淨猶猛師子獸中之王，",
        "translation": "Their faculties are tranquil and concentrated, serene and mysterious; their nature is as peaceful and gentle as water. The middle surface of the body is pure like that of a fierce lion, the king among animals.",
        "source": "T11n0318_001:0892a03_1"
    },
    {
        "source_sentence": "如日初出照于朝陽，譬月盛滿眾星中明，佛在大眾巍巍堂堂，相好昞著汪汪洋洋，",
        "translation": "It is as if the sun had risen at the beginning of the day and illumined the morning sky, like the moon shining brightly in all the stars. The Buddha was seated in the great congregation in a majestic hall with distinctive features",
        "source": "T11n0318_001:0892a05_2"
    },
    {
        "source_sentence": "心懷欣悅敬進迎佛，稽首足下右遶三匝，叉手自歸長跪白佛：「願聞菩薩為行幾法，",
        "translation": "They bowed their heads at the Buddha’s feet, circumambulated him three times to his right, saluted him with palms joined together, knelt down, and said to him:",
        "source": "T11n0318_001:0892a07_3"
    },
    {
        "source_sentence": "疾逮正真為最正覺，從心輒成嚴淨佛國？",
        "translation": "How can you quickly acquire the true truth as the supreme perfect enlightenment and easily accomplish the adornment and purity of the buddha land from your mind?",
        "source": "T11n0318_001:0892a09_0"
    },
    {
        "source_sentence": "唯垂愍哀分別具說。」",
        "translation": "Please have pity and explain it separately.",
        "source": "T11n0318_001:0892a09_1"
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, Good!",
        "source": "T11n0318_001:0892a10_2"
    },
    {
        "source_sentence": "棄惡菩薩！",
        "translation": "Abandon bad bodhisattvas!",
        "source": "T11n0318_001:0892a10_3"
    },
    {
        "source_sentence": "乃問如來嚴淨之德，是諸菩薩眾行殊特。",
        "translation": "He then asked, What's the Tathāgata's glorious and pure virtue that distinguishes the bodhisattvas' various practices?",
        "source": "T11n0318_001:0892a10_4"
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen attentively!",
        "source": "T11n0318_001:0892a11_5"
    },
    {
        "source_sentence": "諦受！",
        "translation": "It's received with respect!",
        "source": "T11n0318_001:0892a11_6"
    },
    {
        "source_sentence": "善思儀則。」",
        "translation": "He well considers the rules of conduct.",
        "source": "T11n0318_001:0892a12_7"
    },
    {
        "source_sentence": "棄惡菩薩一切眾會，莫不喜踊一心恭肅，皆前禮佛受教而聽。",
        "translation": "The evil bodhisattvas abandoned all the assemblies, and none of them rejoiced in their single-minded respectfulness and venerated the Buddha, bowed to him, accepted his teachings, and listened.",
        "source": "T11n0318_001:0892a12_8"
    },
    {
        "source_sentence": "佛言：「菩薩有一法行，疾成正真為最正覺，從心輒成嚴淨佛國。",
        "translation": "The Buddha said, There's a practice of the bodhisattva that quickly becomes correct and true as the most correct awakening, and it's easy to accomplish the adornment and purity of the Buddha's land from his mind.",
        "source": "T11n0318_001:0892a13_9"
    },
    {
        "source_sentence": "何謂為一？",
        "translation": "What is meant by one?",
        "source": "T11n0318_001:0892a15_10"
    },
    {
        "source_sentence": "心常哀愍濟度眾生，興發至真仁和道心。",
        "translation": "Their minds are always compassionate and help sentient beings, and they give rise to the mind of sincerity, kindness, and the path.",
        "source": "T11n0318_001:0892a15_11"
    },
    {
        "source_sentence": "何謂至真仁和道心？",
        "translation": "What's meant by the mind of utmost sincerity, kindness, and harmony in the path?",
        "source": "T11n0318_001:0892a16_12"
    },
    {
        "source_sentence": "曰，以發道心不行諸法。",
        "translation": "He said, They don't practice the teachings because they give rise to the mind of enlightenment.",
        "source": "T11n0318_001:0892a16_13"
    },
    {
        "source_sentence": "何所不行？",
        "translation": "What doesn't?",
        "source": "T11n0318_001:0892a17_14"
    },
    {
        "source_sentence": "曰，不行三垢家業諸利，志存出家不猗眾養，從心本願常崇斯法。",
        "translation": "He said, They don't practice the benefits of the three defiled family activities, abide in renunciation without relying on support, and always honor this teaching from their minds and original vows.",
        "source": "T11n0318_001:0892a17_15"
    },
    {
        "source_sentence": "何謂出家所崇法行？",
        "translation": "What's meant by the practice of renunciant Buddhism that's revered?",
        "source": "T11n0318_001:0892a19_16"
    },
    {
        "source_sentence": "曰，修正真行奉一切法。",
        "translation": "He said, They cultivate true practice and serve all dharmas.",
        "source": "T11n0318_001:0892a19_17"
    },
    {
        "source_sentence": "何謂正真一切之法？",
        "translation": "What's meant by all dharmas that are correct and true?",
        "source": "T11n0318_001:0892a20_18"
    },
    {
        "source_sentence": "曰，分別曉了陰種諸入。",
        "translation": "He said, They discern and understand the aggregates and seeds of the sense-fields.",
        "source": "T11n0318_001:0892a20_19"
    },
    {
        "source_sentence": "何謂陰種？",
        "translation": "What are the aggregates and seeds?",
        "source": "T11n0318_001:0892a21_20"
    },
    {
        "source_sentence": "何所曉了？",
        "translation": "What do they understand?",
        "source": "T11n0318_001:0892a21_21"
    },
    {
        "source_sentence": "曰，有為無為法皆是五陰，解陰如幻所著，名為知陰本空，是謂曉了幻法本寂。",
        "translation": "He said, All conditioned and unconditioned dharmas are five aggregates, and the liberation aggregate is like an illusory attachment, which is called knowing that the aggregate is inherently empty.",
        "source": "T11n0318_001:0892a21_22"
    },
    {
        "source_sentence": "從對而有剖判，本末不見，有二不見，無念亦無望想，此乃專修奉行出家，",
        "translation": "There are two kinds of views: those who do not see the original and those who do not see the derivative. They have neither thought nor any expectation, but here they exclusively practice Buddhism in order to renounce the world.",
        "source": "T11n0318_001:0892a23_23"
    },
    {
        "source_sentence": "成菩薩行不捨眾生。",
        "translation": "He accomplishes the bodhisattva's practice without abandoning sentient beings.",
        "source": "T11n0318_001:0892a25_24"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0318_001:0892a25_25"
    },
    {
        "source_sentence": "能自調已暢達諸法，爾乃習辯為諸法眾生，不得眾生亦無諸法。」",
        "translation": "After they can self-regulate themselves and master the teachings, then they'll cultivate eloquence for the sake of sentient beings who understand the teachings, and they won't attain sentient beings who don't have the teachings",
        "source": "T11n0318_001:0892a25_26"
    },
    {
        "source_sentence": "佛言：「族姓子！",
        "translation": "The Buddha said, Clansman!",
        "source": "T11n0318_001:0892a27_27"
    },
    {
        "source_sentence": "是為菩薩一法之行，疾逮正真為最正覺，從心輒成嚴淨佛國。」",
        "translation": "This is the bodhisattva's practice of one thing, which quickly attains righteousness as the most correct awakening and follows his mind to accomplish the adornment and purity of the Buddha country.",
        "source": "T11n0318_001:0892a27_28"
    },
    {
        "source_sentence": "棄惡菩薩聞佛所說欣悅踊躍，即便逮得不起法忍，身昇虛空去地七仞。",
        "translation": "The evil bodhisattva who abandoned it was delighted to hear what the Buddha taught, and even then attained the patience of not rising above the Dharma, rose up into space seven feet from the ground.",
        "source": "T11n0318_001:0892a29_0"
    },
    {
        "source_sentence": "彼時眾中覩斯變化，有二千人發無上正真道意，萬四千天人遠塵離垢諸法眼淨。",
        "translation": "At the time, there were 2,000 people in the assembly who saw this transformation and gave rise to the intention for the unsurpassed true path, and 14,000 gods and humans purified the Dharma eye that's far removed from dust and dirt.",
        "source": "T11n0318_001:0892b01_1"
    },
    {
        "source_sentence": "時佛因笑，無數光色從其口出，照於十方無量世界，還遶佛三匝從頂上入。",
        "translation": "The Buddha then smiled, and countless rays of light emerged from his mouth, illuminating measureless worlds in the ten directions, circling the Buddha three times and entering from his crown.",
        "source": "T11n0318_001:0892b03_2"
    },
    {
        "source_sentence": "「遊於諸法度無極，　　最勝至真導以力，",
        "translation": "“Furthermore, the supreme path of enlightenment transcends all dharmas And leads everywhere by the power of truth.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　皆了眾生化上智，　　唯願宣現是笑義。",
        "translation": "They all understand the supreme knowledge of sentient beings' transformation, but they only wish to proclaim this meaning of laughter.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　十力已達往過世，　　愍哀亦暢將來業，",
        "translation": "Having attained the ten powers, past and future in all worlds, With compassion he also spreads future deeds.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　悉明現在十方事，　　今用何故顯笑意？",
        "translation": "It fully explains the present events in the ten directions, so why is it used now to show a smile?",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　解於眾生之所行，　　今如師子覩諸心，",
        "translation": "Understanding what sentient beings do, they're like a lion chewing their minds.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　其智慧明無等侶，　　唯宣眾人調法御。",
        "translation": "Their wisdom and insight are peerless, Only proclaiming that all people tame the Dharma and govern it.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　諸天億姟普來集，　　咸共叉手禮至聖，",
        "translation": "All the celestial beings, hundreds of millions in number, assembled to venerate the supreme sage with palms joined.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　願演第一妙光音，　　無數眾會觀法器。",
        "translation": "May he produce the first subtle ray of light, Producing countless assemblies to contemplate the vessel of truth.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "「其慧度無極，　　世俗無疇匹，",
        "translation": "Their wisdom and liberation are boundless, Unsurpassed by the worldly.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　皆知一切人，　　善惡行所趣。",
        "translation": "They all know the destinies Of all people’s good and bad actions.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　至仁今所笑，　　願為分別義，",
        "translation": "What you're laughing at now, Maitreya, is the meaning of discernment.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　當決眾疑網，　　普宣最尊法。",
        "translation": "You will clear away the web of doubt in all beings And universally proclaim the supreme Teaching.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　今諸會大眾，　　巨億百千載，",
        "translation": "For hundreds of millions of koṭis of kalpas the great assemblies are now being held.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　以法故雲集，　　諸比丘默然。",
        "translation": "Because of the teaching, clouds gathered and the monks remained silent.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　加敬修供養，　　百千伎樂音，",
        "translation": "They pay homage and make offerings, Producing a hundred thousand sounds of music.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "　奉行靖心聽，　　唯願決眾疑。」",
        "translation": "I respectfully practice and listen with a peaceful mind, just wanting to resolve the doubts of the people.",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "賢者阿難即從坐起，偏袒右肩長跪叉手，以偈讚佛：佛告阿難：「汝乃見此棄惡菩薩住空中不？」",
        "translation": "Good man Ānanda then rose from his seat, bared his right shoulder, knelt down with his palms together, and praised the Buddha in verse: The Buddha told Ānanda, Do you see this abandoned bad bodhisattva who lives in",
        "source": "T11n0318_001:0892b05_3"
    },
    {
        "source_sentence": "對曰：「已見。」",
        "translation": "He replied, I've seen it.",
        "source": "T11n0318_001:0892b23_4"
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, Ānanda!",
        "source": "T11n0318_001:0892b24_5"
    },
    {
        "source_sentence": "是棄惡菩薩，却後六百二十萬劫當成為佛，號曰寂化音如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，",
        "translation": "This evil bodhisattva will become a buddha six hundred and twenty million world ages from now. His name will be the Tathāgata of Silent Teaching, Arhat, Completely Enlightened, Perfectly Enlightened, Perfect in Knowledge",
        "source": "T11n0318_001:0892b24_6"
    },
    {
        "source_sentence": "為佛、世尊，世界名安隱，劫名離音。",
        "translation": "For the sake of the Buddha and Bhagavān, the world is called peaceful, and the eon is called free from sound.",
        "source": "T11n0318_001:0892b27_7"
    },
    {
        "source_sentence": "其國比如阿閦如來妙樂世界，功勳嚴淨等無有異。」",
        "translation": "That country is like the world of the Tathāgata Akṣobhya's marvelous bliss, where there's no difference in merit and purity.",
        "source": "T11n0318_001:0892b28_0"
    },
    {
        "source_sentence": "佛歎是已，乃便詣王阿闍世宮，王及夫人、太子、百官，華香伎樂歡喜迎佛，",
        "translation": "Having thus praised him, the Buddha went to the palace of the king Ajātaśatru. The king, his queen, princes, and a hundred officials were joyfully greeting the Buddha with flowers, perfumes, music, and dances",
        "source": "T11n0318_001:0892b29_1"
    },
    {
        "source_sentence": "稽首足下退在佛後。",
        "translation": "He bowed his head at the feet of the Buddha and withdrew behind him.",
        "source": "T11n0318_001:0892c01_2"
    },
    {
        "source_sentence": "佛入就座，菩薩聖眾，各以次第坐如常位。",
        "translation": "The Buddha entered and took his seat, and the holy bodhisattvas each sat in order as usual.",
        "source": "T11n0318_001:0892c02_3"
    },
    {
        "source_sentence": "王覩坐定寂靖無聲，與后、太子手自斟酌百種供饍；",
        "translation": "The king sat cross-legged in meditation in peace and quietude without a sound. He offered one hundred kinds of food and drink to the queen and princes, each with his own hands serving as many kinds of offerings.",
        "source": "T11n0318_001:0892c03_4"
    },
    {
        "source_sentence": "食皆飽訖，行澡水畢，兼施琦寶好衣貢佛，別取小床在佛前坐，專心叉手聽受道教，",
        "translation": "When the food had all been eaten, they went out to bathe and water. They also presented gifts of exquisitely decorated robes and good clothes to the Buddha in order to pay homage to him. They took a small seat before the Buddha to sit",
        "source": "T11n0318_001:0892c04_5"
    },
    {
        "source_sentence": "欲化中宮及來會者。",
        "translation": "Those who want to transform the middle palace and those who come to the assembly.",
        "source": "T11n0318_001:0892c06_6"
    },
    {
        "source_sentence": "爾時王阿闍世，長跪白佛：「唯然！",
        "translation": "It was then that the king Ajātaśatru knelt down and said to the Buddha, Yes!",
        "source": "T11n0318_001:0892c06_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0318_001:0892c07_8"
    },
    {
        "source_sentence": "瞋恨厭嫉從何所生？",
        "translation": "Where did anger, hatred, and jealousy arise?",
        "source": "T11n0318_001:0892c07_9"
    },
    {
        "source_sentence": "其愚無明從何所來？",
        "translation": "Where did this foolish ignorance come from?",
        "source": "T11n0318_001:0892c08_10"
    },
    {
        "source_sentence": "慧何所滅？」",
        "translation": "What is the cessation of wisdom?",
        "source": "T11n0318_001:0892c08_11"
    },
    {
        "source_sentence": "佛告王曰：「從其吾我生瞋恨厭嫉，住於自大則生其愚，不別正諦是曰無明；",
        "translation": "The Buddha said to the king, “If one gives rise to hatred and resentment in relation to a self or of hatred toward others, then he will become deluded.",
        "source": "T11n0318_001:0892c08_12"
    },
    {
        "source_sentence": "見正從諦斯則為慧，慧除眾惡如明消冥，見正從諦亦復如是。」",
        "translation": "Seeing the right path from the truth is wisdom, and wisdom removes all evils as insight extinguishes darkness, and so is seeing the right path from the truth.",
        "source": "T11n0318_001:0892c10_13"
    },
    {
        "source_sentence": "王重啟曰：「見正從諦，願分別之。」",
        "translation": "The king again asked, See the true truth and follow it, and I'd like to discern it.",
        "source": "T11n0318_001:0892c11_14"
    },
    {
        "source_sentence": "佛言大王：「法本空無從意生形，解意無處則無去來，了一切空是為見正，",
        "translation": "The Buddha said to the great king, The essence of dharmas is emptiness, and forms don't arise from mind; understanding mind has no place, so there's no going or coming. Understanding all things as emptiness is right view",
        "source": "T11n0318_001:0892c12_15"
    },
    {
        "source_sentence": "見正不轉則曰從諦，具解如是乃曰為了。」",
        "translation": "When views correctly aren't transformed, it's called following the truth; when they are fully understood in this way, it's called comprehending.",
        "source": "T11n0318_001:0892c14_16"
    },
    {
        "source_sentence": "王聞佛言應心說法，欣然大悅善心生焉，即便歎曰：「善哉！",
        "translation": "When the king heard the Buddha's words, he taught them according to his mind and became delighted with great joy and good intentions, and he even praised them, saying, Good!",
        "source": "T11n0318_001:0892c15_17"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0318_001:0892c16_18"
    },
    {
        "source_sentence": "至未曾有，斯則如來之善言教，假令我身中壽終者，心不疑亂必能奉之。」",
        "translation": "It's unprecedented, and this is the Tathāgata's good teaching; if I were to die in my body, my mind wouldn't doubt it and would surely be able to follow it.",
        "source": "T11n0318_001:0892c16_19"
    },
    {
        "source_sentence": "佛從座起與諸大眾，即皆俱還於靈鷲山，勅諸直使布設眾座，請諸會人皆令就坐。",
        "translation": "The Buddha rose from his seat and joined the assembly of monks. They all returned to Vulture Peak, ordered their officials to prepare seats for the assembly, and invited the members of the assembly to take their seats.",
        "source": "T11n0318_001:0892c18_20"
    },
    {
        "source_sentence": "時舍利弗，承佛聖旨即從坐起，偏袒右臂長跪叉手而白佛言：「向城中棄惡菩薩，",
        "translation": "Śāriputra then, in accordance with the Buddha’s holy decree, rose from his seat. Kneeling with his right shoulder bared, he saluted the Buddha by placing his palms together and said to him:",
        "source": "T11n0318_001:0892c20_21"
    },
    {
        "source_sentence": "所問微妙嚴淨佛土，世尊即答粗舉義要，棄惡尋便受佛記拜，聞者解釋各獲果證，",
        "translation": "When the Buddha land of subtle adornment and purity that he asked about, the Bhagavān answered by summarizing the essentials of the meaning, abandoned bad discursive thought, and then accepted the Buddha’s prediction and greetings.",
        "source": "T11n0318_001:0892c22_22"
    },
    {
        "source_sentence": "意不達者咸用瞢瞢。",
        "translation": "Those who don't understand it with their minds are all using deceitfulness.",
        "source": "T11n0318_001:0892c23_23"
    },
    {
        "source_sentence": "唯願世尊，加哀重說具敷演之，令諸菩薩堅固其行，住於正道而不動轉，",
        "translation": "All we ask, World-honored One, is that you show compassion by explaining this in detail, so that enlightening beings may firmly establish their practice and abide on the right path without moving.",
        "source": "T11n0318_001:0892c24_24"
    },
    {
        "source_sentence": "成一切智降魔官屬，攝諸異學滅諸塵勞，勸化邪業使入正道，捨小乘地轉不退輪，",
        "translation": "They attain omniscience, subdue the officials of Māra, gather in heretics and extinguish their defilements, encourage wrong actions so that they can enter the right path, abandon the stages of lesser vehicles, and turn the irreversible",
        "source": "T11n0318_001:0892c26_25"
    },
    {
        "source_sentence": "具悉至願利益眾生，蒙嚴淨力致無限明，未度者度、未成者成。",
        "translation": "They are fully endowed with the supreme vow to benefit sentient beings, empowered by the power of adornment and purity to attain infinite insight, liberating those who haven't been liberated and accomplishing those who haven't",
        "source": "T11n0318_001:0892c28_0"
    },
    {
        "source_sentence": "今現眾會族姓子女，虛心樂聞唯重散說，願令法澤潤及後世，加哀慈念當為眾會。」",
        "translation": "Now, the children of the assembly's clan are happy to hear only repeatedly and repeatedly explained in vain, wishing to nourish the Dharma and future generations with compassion and kindness for the sake of the assembly.",
        "source": "T11n0318_001:0892c29_1"
    },
    {
        "source_sentence": "爾時世尊心念：「是法微妙殊特，乃是菩薩大士之業，今當班宣不宜小會，",
        "translation": "At that time the World-honored One thought to himself: This doctrine is so subtle and extraordinary as to constitute the deeds of a bodhisattva or a great bodhisattva. It should not be taught in a small assembly",
        "source": "T11n0318_001:0893a03_0"
    },
    {
        "source_sentence": "寧可現瑞感十方世界。」",
        "translation": "It's better to show the auspiciousness of the world in the ten directions.",
        "source": "T11n0318_001:0893a04_1"
    },
    {
        "source_sentence": "即如所念，便放其身毛孔之光，普照十方恒沙世界。",
        "translation": "That is, just as he thought, he radiated the light from his pores to illuminate the worlds of the sands of the Ganges in the ten directions.",
        "source": "T11n0318_001:0893a05_2"
    },
    {
        "source_sentence": "十方諸佛各遣菩薩，神智無量微妙明達，各從菩薩百億之眾，皆現神變來入忍界，",
        "translation": "The buddhas of the ten directions each sent enlightening beings with innumerable mystical knowledge and subtle insight, each accompanied by a hundred billion multitudes of enlightening beings, all manifesting mystical transformations to enter",
        "source": "T11n0318_001:0893a06_3"
    },
    {
        "source_sentence": "見能仁佛供侍拜謁，稽首佛足各自陳曰：「覩佛光瑞垂恩見接，憑恃四等聽受法說，",
        "translation": "Seeing the buddha Nengren as an offering, they bowed their heads at his feet and said to each other, “We see that the Buddha Guangming has shown kindness by seeing you.",
        "source": "T11n0318_001:0893a08_4"
    },
    {
        "source_sentence": "我本土佛而見難曰：『汝曹何為詣忍世界？",
        "translation": "Seeing the buddhas of my native land, I said to them, 'Why are you going to the world of forbearance?'",
        "source": "T11n0318_001:0893a10_5"
    },
    {
        "source_sentence": "忍土五逆剛強弊惡，貪嫉婬妬罵詈呪咀，心多瞋毒轉相傷害，麁獷[怡-台+龍]悷侜張難化，",
        "translation": "The land of Tolerance is characterized by the five heinous, rigid, strong, and wicked evils. They are greedy, jealous, angry, hateful, and intoxicated; their minds are full of malice and pois",
        "source": "T11n0318_001:0893a11_6"
    },
    {
        "source_sentence": "勿至忍界自深勞穢。』",
        "translation": "Don't go to the realm of forbearance and self-imposed defilement.'",
        "source": "T11n0318_001:0893a13_7"
    },
    {
        "source_sentence": "我等皆復重自啟曰：『力能堪任來至忍界，正使遭值眾惱諸害火燒刀割，",
        "translation": "We all again repeatedly asked, 'We're all capable of coming to the forbearance realm with strength, and right now we're confronted with numerous harms like fire, burning, swords, and cutting.",
        "source": "T11n0318_001:0893a13_8"
    },
    {
        "source_sentence": "終無恨意。",
        "translation": "There's never any feeling of anger.",
        "source": "T11n0318_001:0893a15_9"
    },
    {
        "source_sentence": "世尊及諸正士，乃能勞謙忍誨群生，願樂禮侍諮受深經。』",
        "translation": "The Bhagavān and the righteous ones are able to work with humility and tolerance to teach sentient beings, so they're willing to venerate and consult profound sūtras.'",
        "source": "T11n0318_001:0893a15_10"
    },
    {
        "source_sentence": "我本土佛乃見遣聽，重復勅曰：『往，族姓子！",
        "translation": "Seeing the buddhas of my native land, I sent them to hear it and again commanded them, 'Come, clansmen!",
        "source": "T11n0318_001:0893a16_11"
    },
    {
        "source_sentence": "從意順時，牢自持心慎勿懈疑，如我本土百千劫行，不如忍世精進一旦。』",
        "translation": "When you follow it according to your wishes, hold fast to yourself and be careful not to lazy in doubt, just like the hundreds of thousands of eons that we've practiced in our native land aren't as long as one time of worldly",
        "source": "T11n0318_001:0893a17_12"
    },
    {
        "source_sentence": "是故，世尊！",
        "translation": "Therefore, Bhagavān!",
        "source": "T11n0318_001:0893a19_13"
    },
    {
        "source_sentence": "歷恒沙界不以為遠，願聞世尊說嚴淨經，及諸正士論講要言。」",
        "translation": "I don't think it's far from the sands of the Ganges, so may I hear the Bhagavān teach the sūtras of adornment and purity and the essentials of the treatises of the saṃgha.",
        "source": "T11n0318_001:0893a19_14"
    },
    {
        "source_sentence": "「無量威德聞十方，　　光照上下恒沙界，",
        "translation": "Innumerable mighty virtues are heard in the ten directions; Their light illumines the worlds above and below, as well as the sands of the Ganges.",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　一切眾生無能稱，　　人中聖慧不可議。",
        "translation": "All sentient beings can't praise it; The noble wisdom of humans is inconceivable.",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　十方世界恒沙國，　　菩薩大眾為法會，",
        "translation": "In the worlds of the ten directions, in the lands as numerous as the grains of sand in the Ganges River, The masses of enlightening beings are religious assemblies.",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　用樂道法亦恪住，　　唯人中尊宣法訓。",
        "translation": "Those who take delight in the path of enlightenment also abide scrupulously, honored among humans as the only one who proclaims the teaching.",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　世尊名稱遍十方，　　禁戒三昧智慧然，",
        "translation": "The World-honored One’s name pervades the ten directions, Endowed with morality, absorption, concentration, and wisdom.",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　儀好無動如師子，　　猶若日光曜虛空。",
        "translation": "Their manner is immovable like a lion, Like the sun shining brightly over the sky.",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　諸天龍王及鬼神，　　其比丘眾比丘尼，",
        "translation": "The gods, dragon kings, ghosts, spirits, and other bhikṣus and bhikṣuṇīs.",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　清信士女叉手住，　　愍哀安住唯宣法。",
        "translation": "The pure faithful men and women stand with palms joined, pitifully abiding in peace only proclaiming the Dharma.",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　以知過去及當來，　　分別曉了今現在，",
        "translation": "Knowing the past and future, They discriminate and understand present and future.",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　為眾生本所應度，　　以律開化決狐疑。",
        "translation": "For the sake of sentient beings who should be liberated in the past, he enlightened them with the precepts to resolve doubts and doubts.",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　云何菩薩造立行，　　國土嚴淨光所照？",
        "translation": "How do enlightening beings create and establish practices, Illumined by the pure light of their lands?",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　何因具足眾大願？　　唯人中上宣此意。",
        "translation": "What is the reason they are endowed with these great vows and proclaim them only among humans?",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　何緣此等無貪嫉？　　何謂禁戒無所犯？",
        "translation": "What is the reason for their absence of greed and jealousy?",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　以何為眾修勤行？　　因群黎故行愍哀。",
        "translation": "What is the reason why they cultivate diligent practice for the sake of all?",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　何從奉行無數劫，　　用精進故勢力上。",
        "translation": "How could they have practiced it for countless eons Being overwhelmed by the power of effort?",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　智慧不倦脫無為，　　濟度眾生勤苦患，",
        "translation": "Their knowledge and wisdom are not weary, their liberation is unconditional; They rescue sentient beings from the hardships of suffering.",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　其意清定恒一心，　　行淨脫門住禪思。",
        "translation": "Their minds are pure and concentrated, always single-minded, They practice the door of purity and liberation, Abiding in meditation and thought.",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　修無所著如蓮華，　　云何立行消殄欲？",
        "translation": "Cultivating without attachment is like a lotus flower, so how can we establish the practice of discarding sexual desire?",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　從何奉行深妙業？　　何因志行度世法？",
        "translation": "Where did you come from to practice profound and marvelous deeds? What is your reason for setting out to save the world?",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "　何緣伏魔及兵眾，　　以降化之即成佛？」",
        "translation": "What is the reason for subduing Māra and his troops and transforming them later to become buddhas?",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "於是彌勒菩薩即從坐起偏袒右臂，長跪叉手前詣佛所，以偈歎曰：於時世尊告彌勒曰：「布法高座，",
        "translation": "Then Maitreya, the bodhisattva, rose from his seat, bared his right shoulder, knelt down with both palms joined together, and approached the Buddha. He praised him in verse:",
        "source": "T11n0318_001:0893a21_15"
    },
    {
        "source_sentence": "如來今當普為十方諸菩薩眾，敷演往古性和佛國功勳嚴淨願行法典。」",
        "translation": "Now, the Tathāgata will universally expound the Dharma scripture for the sake of all the bodhisattvas in the ten directions and present it to the ancient buddha-lands of merit and purity and vows.",
        "source": "T11n0318_001:0893b14_16"
    },
    {
        "source_sentence": "彌勒受教，即心念言：「如來何故使我施座？",
        "translation": "After receiving the instruction, Maitreya thought to himself, Why did the Tathāgata allow me to give you a seat?",
        "source": "T11n0318_001:0893b16_17"
    },
    {
        "source_sentence": "不令阿難、目連等乎？」",
        "translation": "Won't Ānanda and Maudgalyāyana be allowed to do so?",
        "source": "T11n0318_001:0893b17_18"
    },
    {
        "source_sentence": "文殊師利即知彌勒心之所念，便答彌勒：「當知如來使仁布座，說是法時，",
        "translation": "Knowing what Maitreya thought, Mañjuśrī replied to Maitreya: You should know that when the Tathāgata spread his seat in a benevolent way and taught this Dharma,",
        "source": "T11n0318_001:0893b17_19"
    },
    {
        "source_sentence": "非諸聲聞、緣覺之等所能受持，純為菩薩宣是法耳。」",
        "translation": "It's not something that śrāvakas and pratyekbuddhas can accept or uphold, but it's simply for bodhisattvas to proclaim this teaching.",
        "source": "T11n0318_001:0893b19_20"
    },
    {
        "source_sentence": "于時彌勒即如其像三昧正受，為佛設座高四百萬里，以無數寶而挍成之，",
        "translation": "At that time Maitreya, who was absorbed in concentration like the Buddha’s image, set up a seat four million li high for the Buddha and built it of innumerable precious materials.",
        "source": "T11n0318_001:0893b20_21"
    },
    {
        "source_sentence": "天繒綩綖而布其上，座之光明照此三千大千世界。",
        "translation": "The light of the throne illumined this billion-world-galactic universe.",
        "source": "T11n0318_001:0893b22_22"
    },
    {
        "source_sentence": "佛起昇座，三千世界六反震動。",
        "translation": "When the Buddha rose and ascended his seat, 3,000 worlds shook in six ways.",
        "source": "T11n0318_001:0893b23_23"
    },
    {
        "source_sentence": "於時如來告舍利弗：「菩薩有四事法具足所願。",
        "translation": "The Tathāgata then addressed Śāriputra, There are four things a bodhisattva does that fulfill his vow.",
        "source": "T11n0318_001:0893b24_24"
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are these four?",
        "source": "T11n0318_001:0893b25_25"
    },
    {
        "source_sentence": "一曰、志性仁和。",
        "translation": "The first is, the kindness and harmony of aspiration.",
        "source": "T11n0318_001:0893b25_26"
    },
    {
        "source_sentence": "二曰、愍哀眾生。",
        "translation": "The second is to pity sentient beings.",
        "source": "T11n0318_001:0893b25_27"
    },
    {
        "source_sentence": "三曰、精進不懈。",
        "translation": "The third is that they are diligent and not negligent.",
        "source": "T11n0318_001:0893b26_28"
    },
    {
        "source_sentence": "四曰、一心常安，習善親友。",
        "translation": "The fourth is that they are always at ease with one mind, cultivating good friends and relatives.",
        "source": "T11n0318_001:0893b26_29"
    },
    {
        "source_sentence": "是為四法，具足所願。」",
        "translation": "These are the four dharmas that fulfill their vows.",
        "source": "T11n0318_001:0893b27_30"
    },
    {
        "source_sentence": "佛告舍利弗：「菩薩復有一法不失所願？",
        "translation": "The Buddha told Śāriputra, Is there another thing that a bodhisattva doesn't lose his vow?",
        "source": "T11n0318_001:0893b28_0"
    },
    {
        "source_sentence": "何謂為一？",
        "translation": "What is meant by one?",
        "source": "T11n0318_001:0893b28_1"
    },
    {
        "source_sentence": "於是開士當學追慕阿閦如來宿命本行菩薩道時，志願出家樂沙門行，世世所生不違本誓，",
        "translation": "Then the enlightened one, wishing to leave home and taking delight in the practice of asceticism, did not disobey his original vow when he studied the path of enlightening beings following the past lives of the Buddha Akṣob",
        "source": "T11n0318_001:0893b29_2"
    },
    {
        "source_sentence": "乃能進至得如來號無所從生，是則菩薩第一之利用，捨家故得致十德：一者、無有貪欲放逸之態。",
        "translation": "They can then advance to the point where they attain the Tathāgata's name, which arises from nothing, which is the first use of the bodhisattva who abandons home and attains ten virtues: 1. There's no craving or",
        "source": "T11n0318_001:0893c02_3"
    },
    {
        "source_sentence": "二者、常好閑居不習憒閙。",
        "translation": "2. They always prefer to live in seclusion and don't cultivate restlessness.",
        "source": "T11n0318_001:0893c04_4"
    },
    {
        "source_sentence": "三者、常奉佛行捨遠小節。",
        "translation": "3. He always follows the Buddha's practice of equanimity in a small way.",
        "source": "T11n0318_001:0893c05_5"
    },
    {
        "source_sentence": "四者、棄捐癡冥無益之法。",
        "translation": "4. They abandon the useless dharma of delusion and ignorance.",
        "source": "T11n0318_001:0893c05_6"
    },
    {
        "source_sentence": "五者、不慕妻子家居恩愛。",
        "translation": "5. They don't crave the kindnesses of their wife and home.",
        "source": "T11n0318_001:0893c06_7"
    },
    {
        "source_sentence": "六者、釋置惡趣非法之患。",
        "translation": "6. He explains the unlawful danger of being reborn in a bad destiny.",
        "source": "T11n0318_001:0893c06_8"
    },
    {
        "source_sentence": "七者、攝取安樂天上善處。",
        "translation": "The seventh is to gather in the good place of well-being in heaven.",
        "source": "T11n0318_001:0893c07_9"
    },
    {
        "source_sentence": "八者、未曾違失宿命本德。",
        "translation": "Eighth, they never disobeyed the original virtue of past lives.",
        "source": "T11n0318_001:0893c08_0"
    },
    {
        "source_sentence": "九者、諸天愛敬常戀侍衛。",
        "translation": "Nine, the gods love and respect him as their constant attendant.",
        "source": "T11n0318_001:0893c08_1"
    },
    {
        "source_sentence": "十者、諸龍神王常擁護之。",
        "translation": "Tenth, the dragon kings always embrace them.",
        "source": "T11n0318_001:0893c09_2"
    },
    {
        "source_sentence": "是為十德。",
        "translation": "These are the ten virtues.",
        "source": "T11n0318_001:0893c09_3"
    },
    {
        "source_sentence": "若有菩薩不捨大乘、慕度眾生，常當追樂出家之業，是為一法不失所願，",
        "translation": "If there is a bodhisattva who does not give up the Great Vehicle (Mahayana) and desires to liberate sentient beings, he should always take delight in renunciation. This is one thing he wishes for.",
        "source": "T11n0318_001:0893c10_0"
    },
    {
        "source_sentence": "隨志所好致何佛土，如意輒成嚴淨佛國，是則菩薩第一善利。」",
        "translation": "To follow the Buddha land that's preferred by their aspirations and quickly become a pure buddha land as they wish is the bodhisattva's first good benefit.",
        "source": "T11n0318_001:0893c11_1"
    },
    {
        "source_sentence": "佛告舍利弗：「菩薩復有二事法，不捨所願。",
        "translation": "The Buddha told Śāriputra, Again, there are two things that bodhisattvas do that they don't abandon their vows.",
        "source": "T11n0318_001:0893c13_2"
    },
    {
        "source_sentence": "何謂為二？",
        "translation": "What are these two?",
        "source": "T11n0318_001:0893c14_0"
    },
    {
        "source_sentence": "一曰、不樂小乘不學其行，不與從事，願開度之，不說其法用教化人。",
        "translation": "1. They don't delight in the lesser vehicle, don't study its practice, don't work with it, wish to enlighten and save it, and don't teach people by using their teachings.",
        "source": "T11n0318_001:0893c14_1"
    },
    {
        "source_sentence": "二曰、常以無上正真之道，勸進眾生令成佛法。",
        "translation": "The second is that they always use the unsurpassed true path to encourage sentient beings to become buddhas and dharmas.",
        "source": "T11n0318_001:0893c15_2"
    },
    {
        "source_sentence": "是為二法。",
        "translation": "These are the two dharmas.",
        "source": "T11n0318_001:0893c16_3"
    },
    {
        "source_sentence": "勤心正真等誨不倦，則便逮受十功德福處。",
        "translation": "If someone diligently and correctly admonishes them without tire, they'll then acquire the ten meritorious places of merit.",
        "source": "T11n0318_001:0893c17_4"
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are these ten?",
        "source": "T11n0318_001:0893c18_5"
    },
    {
        "source_sentence": "一者、攝取佛土無小乘學。",
        "translation": "1. that there's no lesser vehicle training in the Buddha land of gathering in buddha lands.",
        "source": "T11n0318_001:0893c18_6"
    },
    {
        "source_sentence": "二者、純諸菩薩聖眾來會。",
        "translation": "2. purely the holy congregation of bodhisattvas who come to the assembly.",
        "source": "T11n0318_001:0893c18_7"
    },
    {
        "source_sentence": "三者、諸佛世尊常念護之。",
        "translation": "3. The buddhas and world-honored ones always guard it with mindfulness.",
        "source": "T11n0318_001:0893c19_8"
    },
    {
        "source_sentence": "四者、十方諸佛所見歎譽，稱其功德面為說法。",
        "translation": "4. They'll be praised by the buddhas of the ten directions, and they'll teach the Dharma with their faces praising their merits.",
        "source": "T11n0318_001:0893c20_9"
    },
    {
        "source_sentence": "五者、發微妙心常修正真。",
        "translation": "5. He gives rise to a subtle mind that always cultivates the truth.",
        "source": "T11n0318_001:0893c21_10"
    },
    {
        "source_sentence": "六者、不願天帝釋梵王，心常精勤志存正道。",
        "translation": "6. They don't wish that the god Indra and Brahmā kings always diligently strive to maintain the right path with their minds.",
        "source": "T11n0318_001:0893c21_11"
    },
    {
        "source_sentence": "七者、若生人間作轉輪王，主四天下以道教導。",
        "translation": "7. If he's born among humans, he becomes a wheel-turning king who governs the four continents and teaches the path.",
        "source": "T11n0318_001:0893c22_12"
    },
    {
        "source_sentence": "八者、所生之處不違道業，常見諸佛無上正真。",
        "translation": "8. Where he's born, he doesn't disobey the path and always sees the buddhas as unsurpassed true reality.",
        "source": "T11n0318_001:0893c23_13"
    },
    {
        "source_sentence": "九者、諸天人民所見愛敬。",
        "translation": "The ninth is that the gods and people love and respect him.",
        "source": "T11n0318_001:0893c24_14"
    },
    {
        "source_sentence": "十者、受不可計無量功德。",
        "translation": "10. receiving incalculable and immeasurable merit.",
        "source": "T11n0318_001:0893c25_15"
    },
    {
        "source_sentence": "是為十處。",
        "translation": "These are the ten places.",
        "source": "T11n0318_001:0893c26_16"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0318_001:0893c26_17"
    },
    {
        "source_sentence": "設能化度一佛國眾生之類，皆令致得無著果證，不如菩薩彈指之頃，勸化一人發無上正真，",
        "translation": "Even if one were to teach and liberate all the living beings of a single buddha-land so as to attain the realization of the fruit of nonattachment, it would not be as good as an enlightening being who, just as quickly as he snaps",
        "source": "T11n0318_001:0893c26_18"
    },
    {
        "source_sentence": "何況十處功德妙深，隨意所欲在取何國，如願輒成嚴淨之德。",
        "translation": "It's even more so when the merit of the ten places is marvelously profound, and whatever country he wishes to take, he'll quickly attain the virtue of adornment and purity as he wishes.",
        "source": "T11n0318_001:0893c28_19"
    },
    {
        "source_sentence": "是為二法不違本願。」",
        "translation": "These are the two dharmas that don't contradict the original vow.",
        "source": "T11n0318_001:0894a01_20"
    },
    {
        "source_sentence": "佛告舍利弗：「菩薩復有三法不失所願，能具功德嚴淨佛土。",
        "translation": "The Buddha told Śāriputra, Again, there are three things by which a bodhisattva doesn't lose his vow and is able to fulfill the merits of adorning and purifying the Buddha land.",
        "source": "T11n0318_001:0894a02_0"
    },
    {
        "source_sentence": "何謂為三？",
        "translation": "What are these three?",
        "source": "T11n0318_001:0894a03_1"
    },
    {
        "source_sentence": "一曰、尊樂閑居心習靖寂。",
        "translation": "One, the venerable person's mind cultivates calmness and quiescence in a secluded place.",
        "source": "T11n0318_001:0894a03_2"
    },
    {
        "source_sentence": "二曰、常以慇懃謹護禁戒未曾闕漏。",
        "translation": "The second is that they always guard the precepts with utmost caution and never fail to observe them.",
        "source": "T11n0318_001:0894a04_3"
    },
    {
        "source_sentence": "三曰、常惠法施無衣食望。",
        "translation": "The third is that he always bestows the Dharma with wisdom and gives without expectation of food or clothing.",
        "source": "T11n0318_001:0894a05_4"
    },
    {
        "source_sentence": "是為三法堅護禁戒行菩薩禁。",
        "translation": "These are the three ways to firmly guard the precepts and practice the bodhisattva's prohibitions.",
        "source": "T11n0318_001:0894a05_5"
    },
    {
        "source_sentence": "因此輒逮十無畏：一者、能護戒行入於城邑，若至聚落心無所難。",
        "translation": "Because of this, they'll quickly attain ten fearlessnesses: 1. They can guard the precepts and enter cities without difficulty if they go to a village.",
        "source": "T11n0318_001:0894a06_6"
    },
    {
        "source_sentence": "二者、若在眾會說法勇猛。",
        "translation": "2. If he teaches the Dharma in assemblies, he's courageous.",
        "source": "T11n0318_001:0894a07_7"
    },
    {
        "source_sentence": "三者、入眾中飯食不恐。",
        "translation": "3. He enters the congregation and doesn't fear food and drink.",
        "source": "T11n0318_001:0894a08_8"
    },
    {
        "source_sentence": "四者、在家講頌心無所懼。",
        "translation": "Fourth, there's no fear in the mind at home when he teaches a verse.",
        "source": "T11n0318_001:0894a08_9"
    },
    {
        "source_sentence": "五者、若入精舍亦無所畏。",
        "translation": "5. If he enters a monastery, he also has no fear.",
        "source": "T11n0318_001:0894a09_10"
    },
    {
        "source_sentence": "六者、居在聖眾不懷怯弱。",
        "translation": "6. Those who live in the holy congregation don't harbor timidity.",
        "source": "T11n0318_001:0894a10_11"
    },
    {
        "source_sentence": "七者、言談說事不以恐懼。",
        "translation": "7. He speaks words and talks about things without fear.",
        "source": "T11n0318_001:0894a10_12"
    },
    {
        "source_sentence": "八者、往奉師父及諸和上，恭恪不慢無畏所犯。",
        "translation": "Eighth, they go to their teachers, fathers, and other monks who are respectful, not conceited, and fearless.",
        "source": "T11n0318_001:0894a11_13"
    },
    {
        "source_sentence": "九者、若有所說常抱慈心，心不畏惡。",
        "translation": "9. If someone teaches something, they always embrace kindness and don't fear evil in their minds.",
        "source": "T11n0318_001:0894a12_14"
    },
    {
        "source_sentence": "十者、若受衣食床臥醫藥亦無所難。",
        "translation": "Tenth, there's no difficulty if he receives clothing, food, beds, bedding, and medicine.",
        "source": "T11n0318_001:0894a13_15"
    },
    {
        "source_sentence": "是為十。",
        "translation": "These are the ten.",
        "source": "T11n0318_001:0894a14_16"
    },
    {
        "source_sentence": "又加十事乃具嚴淨。",
        "translation": "It's also the addition of ten things that make it perfectly pure.",
        "source": "T11n0318_001:0894a14_17"
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are these ten?",
        "source": "T11n0318_001:0894a14_18"
    },
    {
        "source_sentence": "一者、不畏惡業。",
        "translation": "1. They aren't afraid of bad actions.",
        "source": "T11n0318_001:0894a14_19"
    },
    {
        "source_sentence": "二者、不貪親族。",
        "translation": "The second is that they don't cling to their relatives.",
        "source": "T11n0318_001:0894a15_20"
    },
    {
        "source_sentence": "三者、不求名稱。",
        "translation": "3. They don't seek fame.",
        "source": "T11n0318_001:0894a15_21"
    },
    {
        "source_sentence": "四者、不慕家種。",
        "translation": "4. They don't crave the family seed.",
        "source": "T11n0318_001:0894a16_0"
    },
    {
        "source_sentence": "五者、不姤種姓。",
        "translation": "The fifth is that they don't deceive their castes.",
        "source": "T11n0318_001:0894a16_1"
    },
    {
        "source_sentence": "六者、常知止足。",
        "translation": "6. He always knows calmness and contentment.",
        "source": "T11n0318_001:0894a16_2"
    },
    {
        "source_sentence": "七者、衣食床臥病瘦醫藥而知節限。",
        "translation": "7. He knows the restraints and limitations of clothing, food, seats, beds, and medicine for illnesses that are thin.",
        "source": "T11n0318_001:0894a17_3"
    },
    {
        "source_sentence": "八者、雖在家居歎說道法。",
        "translation": "8. Although he's at home, he praises the teaching of the path.",
        "source": "T11n0318_001:0894a17_4"
    },
    {
        "source_sentence": "九者、諸天往造稽首禮侍。",
        "translation": "Nine, the gods go to make obeisance with their heads and bowed their heads.",
        "source": "T11n0318_001:0894a18_5"
    },
    {
        "source_sentence": "十者、未曾思念非宜之想，心常念佛欣然專精，無衣食意。",
        "translation": "Tenth, he has never thought of thoughts that are not appropriate, always mindful of the Buddha with joy and concentrating his energy without any thoughts of food or clothing.",
        "source": "T11n0318_001:0894a19_6"
    },
    {
        "source_sentence": "是乃具足嚴淨佛土。",
        "translation": "This is the Buddha land that's replete with adornment and purity.",
        "source": "T11n0318_001:0894a20_7"
    },
    {
        "source_sentence": "又復十事受德名稱。",
        "translation": "Again, there are ten things that receive the name of virtue.",
        "source": "T11n0318_001:0894a20_8"
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are these ten?",
        "source": "T11n0318_001:0894a21_9"
    },
    {
        "source_sentence": "一曰、棄捨眾會不慕因緣。",
        "translation": "One, they abandon the causes and conditions for not admiring the assembly.",
        "source": "T11n0318_001:0894a21_10"
    },
    {
        "source_sentence": "二曰、常習燕處不思城邑。",
        "translation": "Second, he always cultivates his practice in Yan's place and doesn't think of cities.",
        "source": "T11n0318_001:0894a22_11"
    },
    {
        "source_sentence": "三曰、心存禪思無有邪念。",
        "translation": "3. He said, There's no mistaken thought in his mind that exists in meditation.",
        "source": "T11n0318_001:0894a22_12"
    },
    {
        "source_sentence": "四曰、不志多事憒閙之中。",
        "translation": "4. It's said that they don't aspire to many things in the midst of confusion.",
        "source": "T11n0318_001:0894a23_13"
    },
    {
        "source_sentence": "五曰、心常念佛無他之思。",
        "translation": "The fifth is that the mind always remembers the Buddha with no thoughts of others.",
        "source": "T11n0318_001:0894a23_14"
    },
    {
        "source_sentence": "六曰、不捨身安而為危害。",
        "translation": "The sixth is that they don't abandon their body and become harmful.",
        "source": "T11n0318_001:0894a24_15"
    },
    {
        "source_sentence": "七曰、淨修梵行未曾中礙。",
        "translation": "7. The purification of religious practice has never been an obstruction in the middle.",
        "source": "T11n0318_001:0894a25_16"
    },
    {
        "source_sentence": "八曰、以少事故得三昧定。",
        "translation": "Eight, It's because of a few things that he attains samādhi concentration.",
        "source": "T11n0318_001:0894a25_17"
    },
    {
        "source_sentence": "九曰、聞所說義要妙章句，識念不失。",
        "translation": "The ninth is that when he hears the meaning of what's taught, his consciousness isn't lost.",
        "source": "T11n0318_001:0894a26_18"
    },
    {
        "source_sentence": "十曰、如所聽經解義歸趣，能為人說。",
        "translation": "Tenth, it's like listening to the sūtras and understanding the meaning of the doctrine so that they can teach it for others.",
        "source": "T11n0318_001:0894a27_19"
    },
    {
        "source_sentence": "是為十法。」",
        "translation": "These are the ten teachings.",
        "source": "T11n0318_001:0894a27_20"
    },
    {
        "source_sentence": "佛告舍利弗：「復有四法不失所願。",
        "translation": "The Buddha told Śāriputra, Again, there are four things that don't lose their vows.",
        "source": "T11n0318_001:0894a28_21"
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are these four?",
        "source": "T11n0318_001:0894a28_22"
    },
    {
        "source_sentence": "一曰、菩薩所作言行相應。",
        "translation": "One, it's associated with the words and actions that bodhisattvas do.",
        "source": "T11n0318_001:0894a29_23"
    },
    {
        "source_sentence": "二曰、棄捐自大。",
        "translation": "The second is that they abandon their own greatness.",
        "source": "T11n0318_001:0894a29_24"
    },
    {
        "source_sentence": "三曰、捨於貪嫉。",
        "translation": "The third is that they abandon craving and jealousy.",
        "source": "T11n0318_001:0894b01_25"
    },
    {
        "source_sentence": "四曰、見他人安代之悅豫。",
        "translation": "Fourth, he sees the happiness of other people's peaceful deeds.",
        "source": "T11n0318_001:0894b01_26"
    },
    {
        "source_sentence": "是為四。",
        "translation": "These are the four.",
        "source": "T11n0318_001:0894b02_0"
    },
    {
        "source_sentence": "又有四事至誠諦教。",
        "translation": "There are also four other things that are taught with utmost sincerity.",
        "source": "T11n0318_001:0894b02_1"
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are these four?",
        "source": "T11n0318_001:0894b02_2"
    },
    {
        "source_sentence": "一曰、所生之處口常清淨氣優鉢香。",
        "translation": "1. The fragrance of the superior bowl in the mouth where it's produced is always pure and pure.",
        "source": "T11n0318_001:0894b02_3"
    },
    {
        "source_sentence": "二曰、言辭辯慧無所闕漏。",
        "translation": "The second is that there's nothing missing from verbal eloquence and wisdom.",
        "source": "T11n0318_001:0894b03_4"
    },
    {
        "source_sentence": "三曰、諸天世人皆保信之。",
        "translation": "3. The gods and people of the world all believe in it.",
        "source": "T11n0318_001:0894b04_5"
    },
    {
        "source_sentence": "四曰、不失好聲必獲佛音。",
        "translation": "4. He said, If he doesn't lose his good voice, he'll surely attain the Buddha's voice.",
        "source": "T11n0318_001:0894b04_6"
    },
    {
        "source_sentence": "是為四。",
        "translation": "These are the four.",
        "source": "T11n0318_001:0894b05_7"
    },
    {
        "source_sentence": "復有四法所修訓誨。",
        "translation": "Again, there are four things that are cultivated and taught by the Dharma.",
        "source": "T11n0318_001:0894b05_8"
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are these four?",
        "source": "T11n0318_001:0894b06_9"
    },
    {
        "source_sentence": "一曰、不生三趣無憎惡者。",
        "translation": "1. Those who aren't born in the three destinies and don't hate them.",
        "source": "T11n0318_001:0894b06_10"
    },
    {
        "source_sentence": "二曰、所學不慕九十六種所見迷惑。",
        "translation": "2. The ninety-six kinds of deluded views that are not admired by what's learned.",
        "source": "T11n0318_001:0894b07_0"
    },
    {
        "source_sentence": "三曰、怨家惡友不得其便。",
        "translation": "3. The enemy's bad friend won't get an advantage over them.",
        "source": "T11n0318_001:0894b07_1"
    },
    {
        "source_sentence": "四曰、天上世間咸共歸禮。",
        "translation": "The fourth says, All the gods and goddesses in the world all pay homage together.",
        "source": "T11n0318_001:0894b08_2"
    },
    {
        "source_sentence": "是為四。",
        "translation": "These are the four.",
        "source": "T11n0318_001:0894b09_0"
    },
    {
        "source_sentence": "復有四法流布訓誨。",
        "translation": "Again, there are four ways to spread the teaching of the Dharma.",
        "source": "T11n0318_001:0894b09_1"
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are these four?",
        "source": "T11n0318_001:0894b09_2"
    },
    {
        "source_sentence": "一曰、不捨布施之心，穀米踊貴因時惠施。",
        "translation": "1. Not abandoning the mind of generosity, grain and rice are so prosperous that they give generously at the right time.",
        "source": "T11n0318_001:0894b09_3"
    },
    {
        "source_sentence": "二曰、不慕世榮所有財業。",
        "translation": "The second is that they don't crave the wealth and business of worldly prosperity.",
        "source": "T11n0318_001:0894b10_4"
    },
    {
        "source_sentence": "三曰、往奉自歸禁戒之士。",
        "translation": "3. He said, Those who go there to serve themselves and return to the precepts.",
        "source": "T11n0318_001:0894b11_5"
    },
    {
        "source_sentence": "四曰、若有布施不懷貪嫉。",
        "translation": "4. If there's generosity, he doesn't harbor greed and jealousy.",
        "source": "T11n0318_001:0894b12_6"
    },
    {
        "source_sentence": "是為四。",
        "translation": "These are the four.",
        "source": "T11n0318_001:0894b12_7"
    },
    {
        "source_sentence": "復有四法，可悅他人心知止足。",
        "translation": "Again, there are four things that please others and make them feel satisfied.",
        "source": "T11n0318_001:0894b12_8"
    },
    {
        "source_sentence": "何謂為四？",
        "translation": "What are these four?",
        "source": "T11n0318_001:0894b13_9"
    },
    {
        "source_sentence": "一曰、是眾生等是為我所，吾當安之。",
        "translation": "One, it's because sentient beings and so forth are mine, and I will make them comfortable.",
        "source": "T11n0318_001:0894b13_10"
    },
    {
        "source_sentence": "二曰、斯等貪財依怙身力以為無雙，菩薩加哀施以所安，當計財業非是我侶，",
        "translation": "The second is that these cravings for possessions and relying on their physical strength are thought to be peerless, and the bodhisattva compassionately bestows what's peaceful because he thinks that financial activities aren't my",
        "source": "T11n0318_001:0894b14_11"
    },
    {
        "source_sentence": "常畏五分侵奪無期。",
        "translation": "They're always afraid of the five parts that are constantly attacked and plundered without a time limit.",
        "source": "T11n0318_001:0894b16_12"
    },
    {
        "source_sentence": "三曰、若多財寶妻子熾盛眷屬豐饒，不以信樂不戀國土，何況他人望於眾生。",
        "translation": "3. If someone has a lot of wealth and possessions, their wives are prosperous, and their retinues are abundant, they don't believe in or rely on the land, so why wouldn't others hope for sentient beings?",
        "source": "T11n0318_001:0894b16_13"
    },
    {
        "source_sentence": "四曰、志未曾求非業錢財行在諸俗。",
        "translation": "4. It's said that the intention hasn't ever been to pursue money and possessions that aren't activities in the secular world.",
        "source": "T11n0318_001:0894b18_14"
    },
    {
        "source_sentence": "是為四法。",
        "translation": "These are the four dharmas.",
        "source": "T11n0318_001:0894b19_15"
    },
    {
        "source_sentence": "菩薩行是，不失所願嚴淨佛土。」",
        "translation": "The bodhisattva's practice is thus, and he doesn't lose the Buddha land that he wishes to adorn and purify.",
        "source": "T11n0318_001:0894b19_16"
    },
    {
        "source_sentence": "佛告舍利弗：「復有五法不失所願。",
        "translation": "The Buddha told Śāriputra, Again, there are five things that don't lose their vows.",
        "source": "T11n0318_001:0894b21_0"
    },
    {
        "source_sentence": "何謂為五？",
        "translation": "What are the five?",
        "source": "T11n0318_001:0894b21_1"
    },
    {
        "source_sentence": "一曰、常樂經法勤求道義。",
        "translation": "One, the meaning of diligently seeking the path in the eternally blissful sūtras and teachings.",
        "source": "T11n0318_001:0894b22_0"
    },
    {
        "source_sentence": "二曰、知無數世所生往反。",
        "translation": "The second is that they know the goings and comings of innumerable worlds.",
        "source": "T11n0318_001:0894b22_1"
    },
    {
        "source_sentence": "三曰、以聞經法如諸佛行成就功勳。",
        "translation": "3. It's because they hear the sūtras and teachings as the buddhas practice and accomplish merit.",
        "source": "T11n0318_001:0894b23_2"
    },
    {
        "source_sentence": "四曰、所從聽經每事問義，造立何行具足疾成。",
        "translation": "4. What's the meaning of each thing he asks when he listens to the sūtras, and what actions he creates are complete and quickly accomplished.",
        "source": "T11n0318_001:0894b24_0"
    },
    {
        "source_sentence": "五曰、若聞經法尋能奉行。",
        "translation": "Fifth, if someone hears the sūtras and investigates the teachings, they'll be able to follow them.",
        "source": "T11n0318_001:0894b25_1"
    },
    {
        "source_sentence": "是為五法，不失所願嚴淨佛土。」",
        "translation": "These are the five dharmas that don't lose their desire to adorn and purify the Buddha land.",
        "source": "T11n0318_001:0894b25_2"
    },
    {
        "source_sentence": "佛告舍利弗：「復有六法不失所願。",
        "translation": "The Buddha told Śāriputra, Again, there are six things that don't lose their vows.",
        "source": "T11n0318_001:0894b27_0"
    },
    {
        "source_sentence": "何謂為六？",
        "translation": "What are these six?",
        "source": "T11n0318_001:0894b27_1"
    },
    {
        "source_sentence": "一曰、好憙布施心無慳嫉，以身施與不惜壽命，不愛妻子男女眷屬，心無希冀不懷望想。",
        "translation": "1. A mind that's fond of generosity and doesn't have stinginess or jealousy, gives with its body to someone who doesn't cherish life, doesn't love wives, men, women, and their retinues, and has no",
        "source": "T11n0318_001:0894b28_0"
    },
    {
        "source_sentence": "二曰、菩薩在家若出行學，寧失身命不犯禁戒，謹慎守護常住梵行，興發眾生以戒勸助。",
        "translation": "Second, if a bodhisattva goes to school at home, he's better to lose his body and life rather than violate the precepts, be careful to guard and always stay in the religious practice, and encourage sentient beings to give rise",
        "source": "T11n0318_001:0894c01_1"
    },
    {
        "source_sentence": "三曰、知身假借諸法如幻，堅住忍力逆對不起，設遭毒害刀杖加刑、惡罵呪咀愁惱之患，",
        "translation": "3. Knowing that the body is illusory in terms of dharmas, they firmly abide in forbearance and can't resist or oppose it, and if they experience poison, swords, sticks, torture, harsh words",
        "source": "T11n0318_001:0894c03_2"
    },
    {
        "source_sentence": "未曾起意而有恨心。",
        "translation": "I've never had an intention to give rise to anger.",
        "source": "T11n0318_001:0894c05_3"
    },
    {
        "source_sentence": "四曰、奉行精進心無所著，深念非常如救頭然，行止臥覺未曾懈廢，設火燒身心不退却。",
        "translation": "The fourth is that they practice with energy without attachment, are deeply mindful and uncontaminated like saving their heads, never lazy when walking or lying down, and don't retreat even if a fire burns their body or mind",
        "source": "T11n0318_001:0894c05_4"
    },
    {
        "source_sentence": "五曰、專心守靖寂無他念，入無生寂伏想不起，心如灰滅形如枯朽。",
        "translation": "5. He focuses his mind on guarding tranquility without other thoughts, enters into the quiescence of nonarising and doesn't conceive, and his mind is like ashes that cease and form that withers.",
        "source": "T11n0318_001:0894c07_5"
    },
    {
        "source_sentence": "六曰、見正從諦滅除邪偽，曉了三界如響如幻，法無常名如水月形，愍哀一切勸誨眾生。",
        "translation": "The sixth teaching is that views correctly cease from the truth and remove errors and falsehoods, understand that the three realms are like sounds and illusions, that things are impermanent like the shape of a moon in water, and pity all",
        "source": "T11n0318_001:0894c09_6"
    },
    {
        "source_sentence": "是為六法如願輒成，具足功德嚴淨佛國。」",
        "translation": "These are the six dharmas that are easily accomplished according to their wishes, which are replete with merit and adorn the Buddha's land of purity.",
        "source": "T11n0318_001:0894c11_7"
    },
    {
        "source_sentence": "佛告舍利弗：「復有七法不失所願。",
        "translation": "The Buddha told Śāriputra, Again, there are seven things that don't lose their vows.",
        "source": "T11n0318_001:0894c12_8"
    },
    {
        "source_sentence": "何謂為七？",
        "translation": "What are these seven?",
        "source": "T11n0318_001:0894c13_0"
    },
    {
        "source_sentence": "一曰、一切所有而以布施，所可施者亦無所獲。",
        "translation": "One, it's to give everything that exists, and there's nothing to give that can be obtained.",
        "source": "T11n0318_001:0894c13_1"
    },
    {
        "source_sentence": "二曰、奉戒不虧不想所禁。",
        "translation": "The second is that they observe the precepts without fail and don't want to be forbidden.",
        "source": "T11n0318_001:0894c14_2"
    },
    {
        "source_sentence": "三曰、勸於眾生不起法忍。",
        "translation": "3. He encourages sentient beings not to give rise to the tolerance of the Dharma.",
        "source": "T11n0318_001:0894c14_3"
    },
    {
        "source_sentence": "四曰、以精進行不得身心。",
        "translation": "Fourth, it's because the practice of effort doesn't obtain body and mind.",
        "source": "T11n0318_001:0894c15_4"
    },
    {
        "source_sentence": "五曰、成就禪定一心攝念。",
        "translation": "The fifth says, Accomplish the single-mindedness of meditation that collects mindfulness.",
        "source": "T11n0318_001:0894c16_5"
    },
    {
        "source_sentence": "六曰、具足智慧不懷希望。",
        "translation": "Sixth, he's endowed with wisdom and doesn't harbor hope.",
        "source": "T11n0318_001:0894c16_6"
    },
    {
        "source_sentence": "七曰、常志念佛捨眾希望。",
        "translation": "The seventh is that they always aspire to mindfulness of the Buddha and abandon all hopes.",
        "source": "T11n0318_001:0894c17_7"
    },
    {
        "source_sentence": "是為七法，所行具足嚴淨佛土。」",
        "translation": "These are the seven dharmas that make up the fully adorned and pure buddha land of what they practice.",
        "source": "T11n0318_001:0894c17_8"
    },
    {
        "source_sentence": "佛告舍利弗：「復有八法不失所願。",
        "translation": "The Buddha told Śāriputra, Again, there are eight things that don't lose their vows.",
        "source": "T11n0318_001:0894c19_0"
    },
    {
        "source_sentence": "何謂為八？",
        "translation": "What are the eight?",
        "source": "T11n0318_001:0894c19_1"
    },
    {
        "source_sentence": "一曰、所宣不說無益之言。",
        "translation": "The first is that what's proclaimed doesn't say useless words.",
        "source": "T11n0318_001:0894c20_0"
    },
    {
        "source_sentence": "二曰、以布施事用為莊嚴。",
        "translation": "The second is that it's adorned with the function of generosity.",
        "source": "T11n0318_001:0894c20_1"
    },
    {
        "source_sentence": "三曰、其心柔和而無麁獷。",
        "translation": "The third is that their minds are gentle and peaceful without harshness.",
        "source": "T11n0318_001:0894c21_2"
    },
    {
        "source_sentence": "四曰、恭敬法師不懷輕慢。",
        "translation": "The fourth is, 'I respect the teacher of the Dharma and don't harbor conceit.'",
        "source": "T11n0318_001:0894c21_3"
    },
    {
        "source_sentence": "五曰、常行謙恪下意順眾。",
        "translation": "5. He always conducts himself humbly and scrupulously, following the minds of others.",
        "source": "T11n0318_001:0894c22_4"
    },
    {
        "source_sentence": "六曰、性行清白而無沾污。",
        "translation": "The sixth is that their nature and conduct are pure and white but not stained.",
        "source": "T11n0318_001:0894c22_5"
    },
    {
        "source_sentence": "七曰、若不持戒知報應事。",
        "translation": "7. If someone doesn't observe precepts and know the task of retribution, they'll be disciplined.",
        "source": "T11n0318_001:0894c23_6"
    },
    {
        "source_sentence": "八曰、不自傷行不毀他人。",
        "translation": "Eight, he doesn't harm himself and doesn't disparage others.",
        "source": "T11n0318_001:0894c24_7"
    },
    {
        "source_sentence": "是為八法嚴淨佛土。」",
        "translation": "These are the eight dharmas that adorn and purify the Buddha land.",
        "source": "T11n0318_001:0894c24_8"
    },
    {
        "source_sentence": "佛告舍利弗：「復有九法不失所願。",
        "translation": "The Buddha told Śāriputra, Again, there are nine things that don't lose their vows.",
        "source": "T11n0318_001:0894c26_0"
    },
    {
        "source_sentence": "何謂為九？",
        "translation": "What are these nine?",
        "source": "T11n0318_001:0894c26_1"
    },
    {
        "source_sentence": "一曰、常護身行令不虧失。",
        "translation": "1. He always guards his bodily actions so that they aren't deficient.",
        "source": "T11n0318_001:0894c27_0"
    },
    {
        "source_sentence": "二曰、口言謹慎而無缺漏。",
        "translation": "The second is that they are verbally disciplined without fail.",
        "source": "T11n0318_001:0894c27_1"
    },
    {
        "source_sentence": "三曰、將護其意使無邪想。",
        "translation": "3. They will guard their minds so that they don't have wrong thoughts.",
        "source": "T11n0318_001:0894c28_2"
    },
    {
        "source_sentence": "四曰、棄去貪欲心無所著。",
        "translation": "Fourth, he abandons the mind of craving and has no attachment.",
        "source": "T11n0318_001:0894c28_3"
    },
    {
        "source_sentence": "五曰、刈除瞋恚心不起恨。",
        "translation": "The fifth is to remove anger and not give rise to hatred.",
        "source": "T11n0318_001:0894c29_4"
    },
    {
        "source_sentence": "六曰、滅愚冥業不為闇昧。",
        "translation": "The sixth teaching is, Cessation of foolish and obscure karma that doesn't become darkness.",
        "source": "T11n0318_001:0894c29_5"
    },
    {
        "source_sentence": "七曰、常行至誠而無欺惑。",
        "translation": "7. He always conducts himself with utmost sincerity and without deceit.",
        "source": "T11n0318_001:0895a01_6"
    },
    {
        "source_sentence": "八曰、行慈堅固心不移易。",
        "translation": "Eight, he practices kindness with a resolute mind that doesn't change.",
        "source": "T11n0318_001:0895a02_7"
    },
    {
        "source_sentence": "九曰、依善知友未曾捨遠。",
        "translation": "Nine, Relying on a well-known friend who has never abandoned it.",
        "source": "T11n0318_001:0895a02_8"
    },
    {
        "source_sentence": "是為九法嚴淨佛土。」",
        "translation": "These are the nine dharmas that adorn and purify the Buddha land.",
        "source": "T11n0318_001:0895a03_9"
    },
    {
        "source_sentence": "佛告舍利弗：「復有十法不失所願。",
        "translation": "The Buddha told Śāriputra, Again, there are ten things that don't lose their vows.",
        "source": "T11n0318_001:0895a04_0"
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are these ten?",
        "source": "T11n0318_001:0895a04_1"
    },
    {
        "source_sentence": "一曰、聞地獄苦，心懷恐懼奉修哀心。",
        "translation": "1. Hearing the suffering of hell, he harbors fear in his mind and cultivates compassion.",
        "source": "T11n0318_001:0895a05_0"
    },
    {
        "source_sentence": "二曰、聞畜生苦，亦復怖懅興隨道哀。",
        "translation": "Second, when he hears about the suffering of animals, he's also frightened and angry, and he follows the path with pity.",
        "source": "T11n0318_001:0895a05_1"
    },
    {
        "source_sentence": "三曰、聞餓鬼苦，亦復畏難發起大慈。",
        "translation": "3. Hearing about the suffering of hungry ghosts, he's also afraid that it's difficult to give rise to great compassion.",
        "source": "T11n0318_001:0895a06_2"
    },
    {
        "source_sentence": "四曰、聞天上安，亦復不喜常興大哀。",
        "translation": "The fourth says, Hearing that the heavens are peaceful, he doesn't delight in them and always arouses great compassion.",
        "source": "T11n0318_001:0895a07_3"
    },
    {
        "source_sentence": "五曰、聞於人間，穀米踊貴弊惡加害，而興慈仁。",
        "translation": "The fifth is that they hear that among the people there are grains and rice, which are so valuable and harmful that they give rise to kindness.",
        "source": "T11n0318_001:0895a08_4"
    },
    {
        "source_sentence": "六曰、心自念言：『加勤精進悉忍眾苦，乃使佛土嚴淨無量。』",
        "translation": "Sixth, he thinks to himself, 'With diligence and effort, I'll fully tolerate all the suffering that makes the Buddha's land immeasurable in terms of its adornment and purity.'",
        "source": "T11n0318_001:0895a09_5"
    },
    {
        "source_sentence": "七曰、令無三苦眾惱之患。",
        "translation": "The seventh is to cause the absence of the three kinds of suffering and the afflictions of affliction.",
        "source": "T11n0318_001:0895a10_6"
    },
    {
        "source_sentence": "八曰、使其佛土豐饒平賤。",
        "translation": "The eighth is to cause the Buddha's land to be abundant and evenly balanced.",
        "source": "T11n0318_001:0895a11_7"
    },
    {
        "source_sentence": "九曰、人民安和壽命無限。",
        "translation": "Nine, The people are peaceful and their life spans are limitless.",
        "source": "T11n0318_001:0895a11_8"
    },
    {
        "source_sentence": "十曰、皆自然生無所名屬，至成無上正真之道。",
        "translation": "Tenth, they all naturally give rise to nothing to be called belonging, which leads to the accomplishment of the unsurpassed true path.",
        "source": "T11n0318_001:0895a12_9"
    },
    {
        "source_sentence": "是為十法所願不失嚴淨佛土。」",
        "translation": "This is the vow of the ten dharmas that won't lose the adorned and pure Buddha land.",
        "source": "T11n0318_001:0895a13_10"
    },
    {
        "source_sentence": "佛告舍利弗：「菩薩執華詣如來時、若詣塔寺，當作是念：『願使眾生，",
        "translation": "The Buddha said to Śāriputra: When a bodhisattva approaches the Tathāgata with flowers in his hand, or when he visits a stupa or monastery, he should have this thought:",
        "source": "T11n0318_001:0895a15_0"
    },
    {
        "source_sentence": "心意軟淨顏貌和悅，如華軟妙形色香潔，見莫不歡、愛之欣悅。",
        "translation": "Their minds and thoughts are soft and pure, and their appearance is peaceful and pleasant, like flowers that are soft and subtle in shape and fragrant and clean, and when they see them, none of them rejoice and love them.",
        "source": "T11n0318_001:0895a16_1"
    },
    {
        "source_sentence": "願成佛時，令我國中香樹妙華周匝普遍，衣被飲食雜綵幡蓋，金銀珍寶皆自然生；",
        "translation": "I vow that when I become a buddha, all the fragrant trees and beautiful flowers of my land will pervade everywhere in my native land. My clothes will be covered with food and drink, mixed with silhouetted banners and cano",
        "source": "T11n0318_001:0895a17_2"
    },
    {
        "source_sentence": "其土人民禁戒清淨，心意柔軟和雅其性，逮深法忍神通無上。』",
        "translation": "The people of that land are pure in observing the precepts, their minds are gentle and peaceful by nature, and they acquire profound tolerance of the Dharma and supernormal abilities that are unsurpassed.'",
        "source": "T11n0318_001:0895a19_3"
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0318_001:0895a21_4"
    },
    {
        "source_sentence": "菩薩所為先人後己，念安一切如父如母，見人得安欣然代喜；",
        "translation": "The enlightening beings do what should be done by their forefathers and rely on themselves. Mindful of the well-being of all, they are like fathers and mothers; seeing people attain well-being, they delight in",
        "source": "T11n0318_001:0895a21_5"
    },
    {
        "source_sentence": "願成佛時生我國者，皆令安和無嫉妬疑，恬然入定心無念思。",
        "translation": "Those who wish to be born in my country at the time of becoming a buddha will all be peaceful and without jealousy or doubt, quietly entering concentration with no thoughts.",
        "source": "T11n0318_001:0895a22_6"
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0318_001:0895a24_7"
    },
    {
        "source_sentence": "菩薩護口未曾犯失，不可之言不加人物，語常如法非義不出；",
        "translation": "The enlightening beings guard their mouths without ever offending, not uttering words or saying anything unworthy of people. They always speak according to the truth and do not utter falsehoods.",
        "source": "T11n0318_001:0895a24_8"
    },
    {
        "source_sentence": "願成佛時生我國者，言辭柔和無有不可，語聲八種出口和雅。",
        "translation": "When he wishes to become a buddha, he's born in our country, speaks with gentleness and harmony without exception, and produces eight kinds of sounds that are harmonious.",
        "source": "T11n0318_001:0895a25_9"
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0318_001:0895a27_10"
    },
    {
        "source_sentence": "菩薩戒淨身口意善，復勸他人使行己善，令轉相教普及一切；",
        "translation": "Enlightening beings’ morality is pure in body, speech, and mind; they also encourage others to do their own good, causing them to develop characteristics that teach universally.",
        "source": "T11n0318_001:0895a27_11"
    },
    {
        "source_sentence": "願成佛時生我國者，令身口意完淨無漏，神通具足在所至湊。",
        "translation": "Those who wish to be born in our country at the time of becoming a buddha will cause their bodies, speech, and minds to be perfectly pure and uncontaminated, with supernormal abilities that are fully present wherever they go.",
        "source": "T11n0318_001:0895a29_0"
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0318_001:0895b01_1"
    },
    {
        "source_sentence": "菩薩所遊興隆道化，常以正真開度男女，未曾講論小乘之語；",
        "translation": "Enlightening beings’ excursions promote enlightenment, always liberating men and women by means of truth. They never discuss the teachings of the lesser vehicle.",
        "source": "T11n0318_001:0895b01_2"
    },
    {
        "source_sentence": "願成佛時生我國者，不聞聲聞、緣覺之行，轉不退輪、逮最正覺，令純淑行流布無極。",
        "translation": "Those who wish to be born in our country when they become buddhas won't hear the practices of śrāvakas and pratyekbuddhas, turn the wheel of nonretrogression and attain supreme perfect enlightenment, and cause pure and no",
        "source": "T11n0318_001:0895b03_3"
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0318_001:0895b04_4"
    },
    {
        "source_sentence": "若有菩薩不嫉彼供不斷他養，見人得供代之悅預；",
        "translation": "Suppose there is a bodhisattva who is not jealous of those offerings and does not cut off the support of others. When he sees someone receiving an offering, he or she will be delighted to do so.",
        "source": "T11n0318_001:0895b05_5"
    },
    {
        "source_sentence": "願成佛時生我國者，無貪嫉名皆獲法利。",
        "translation": "Those who wish to be born in our country when they become buddhas will have no craving or jealousy, and they'll all attain the benefits of the Dharma.",
        "source": "T11n0318_001:0895b06_6"
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0318_001:0895b07_7"
    },
    {
        "source_sentence": "若有菩薩不自稱善、不說人短，不講眾僧、比丘尼闕，聞見人論有如己犯；",
        "translation": "Suppose there is a bodhisattva who does not praise himself as good and does not speak of the shortcomings of others. He does not talk about the absence of any members of the sangha or bhikṣuṇī, and if he hears",
        "source": "T11n0318_001:0895b07_8"
    },
    {
        "source_sentence": "願成佛時生我國者，皆令清淨不聞罪名。",
        "translation": "Those who wish to be born in our country when they become buddhas will all be made pure and won't hear the names of sins.",
        "source": "T11n0318_001:0895b09_9"
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0318_001:0895b10_10"
    },
    {
        "source_sentence": "若有菩薩慕求經道如渴欲飲，志存正真不好異法；",
        "translation": "Suppose there is a bodhisattva who longs for the scriptures and paths like thirst, wishing to drink. He cherishes what is true but does not accept heterodox doctrines.",
        "source": "T11n0318_001:0895b10_11"
    },
    {
        "source_sentence": "願成佛時生我國者，皆樂經道慕求正法。",
        "translation": "Those who wish to be born in our country when they become buddhas will all delight in the sūtras and paths and yearn for the right teaching.",
        "source": "T11n0318_001:0895b11_12"
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0318_001:0895b12_13"
    },
    {
        "source_sentence": "若有菩薩常作音樂歌頌佛德，供養如來若塔形像，以是德本勸助學者；",
        "translation": "Suppose there is a bodhisattva who always composes music, songs, and hymns of praise for the Buddha’s virtue, offering them to buddhas or to their images in stupas. Because of this root of virtue he encourages scholars",
        "source": "T11n0318_001:0895b12_14"
    },
    {
        "source_sentence": "願成佛時，百千伎樂不鼓自鳴，演八法音聞皆欣悅，開發道心悉獲正真。",
        "translation": "At the time of their vow to become buddhas, a hundred thousand kinds of music were played without drums and self-singing, and when they played the eight sounds of the Dharma, everyone was delighted to hear them, developing the mind of enlighten",
        "source": "T11n0318_001:0895b14_15"
    },
    {
        "source_sentence": "「又，舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0318_001:0895b16_16"
    },
    {
        "source_sentence": "若有菩薩見眾生心放逸馳騁，開視正要使不憒閙；",
        "translation": "Suppose there is a bodhisattva who, seeing the minds of sentient beings scattered in thought, opens and looks upon the essentials so as not to be disturbed.",
        "source": "T11n0318_001:0895b16_17"
    },
    {
        "source_sentence": "願成佛時生我國者，使無亂志，攝念入定以禪為食，眾想寂滅皆至正覺。」",
        "translation": "Those who wish to be born in our country at the time of becoming a buddha, so that their minds aren't disturbed, gather mindfulness and enter concentration with meditation as food, and all thoughts are tranquilized until they reach right awakening.",
        "source": "T11n0318_001:0895b17_18"
    },
    {
        "source_sentence": "佛語舍利弗：「假使如來以劫之壽，咨嗟佛土成就功勳，不可究盡而譬喻之，",
        "translation": "The Buddha said to Śāriputra, Suppose the Tathāgata were to praise the merits accomplished in the Buddha's land for an eon of life, which can't be exhaustively likened to it.",
        "source": "T11n0318_001:0895b19_19"
    },
    {
        "source_sentence": "今粗為汝略舉之耳！",
        "translation": "I'll just give you a brief list of them!",
        "source": "T11n0318_001:0895b20_20"
    },
    {
        "source_sentence": "若有聞是菩薩行德，思齊慕及逮志不疑，亦當成其嚴淨佛土。」",
        "translation": "If someone hears this virtue of the bodhisattva's practice and contemplates it without doubt, they'll also become an adorned and pure buddha land.",
        "source": "T11n0318_001:0895b21_21"
    },
    {
        "source_sentence": "佛告舍利弗：「菩薩復有三法，疾逮正覺，不失所願如意即得。",
        "translation": "The Buddha told Śāriputra, Again, there are three things that bodhisattvas quickly attain right awakening and don't lose what they wish to attain.",
        "source": "T11n0318_001:0895b23_0"
    },
    {
        "source_sentence": "何謂為三？",
        "translation": "What are these three?",
        "source": "T11n0318_001:0895b24_1"
    },
    {
        "source_sentence": "一曰、所願特尊與眾不共。",
        "translation": "One, the special honored one who wishes to be uncommon with the crowd.",
        "source": "T11n0318_001:0895b24_2"
    },
    {
        "source_sentence": "二曰、所行安諦而不放逸。",
        "translation": "The second is that they practice the peaceful truth and aren't careless.",
        "source": "T11n0318_001:0895b25_3"
    },
    {
        "source_sentence": "三曰、如所聞法奉行不惓。",
        "translation": "3. They follow the teaching they've heard and don't venerate it.",
        "source": "T11n0318_001:0895b25_4"
    },
    {
        "source_sentence": "是為三。」",
        "translation": "These are the three.",
        "source": "T11n0318_001:0895b26_5"
    },
    {
        "source_sentence": "舍利弗言：「善哉！",
        "translation": "Śāriputra said, Good!",
        "source": "T11n0318_001:0895b26_6"
    },
    {
        "source_sentence": "至未曾有！",
        "translation": "It's unprecedented!",
        "source": "T11n0318_001:0895b26_7"
    },
    {
        "source_sentence": "如來善訓，道品備悉，所願成就嚴淨佛土。」",
        "translation": "The Tathāgata is well-taught, fully equipped with the qualities of the path, and he wishes to accomplish the adornment and purity of the Buddha land.",
        "source": "T11n0318_001:0895b27_8"
    },
    {
        "source_sentence": "佛告舍利弗：「如是，如是！",
        "translation": "The Buddha told Śāriputra, So it is, so it is!",
        "source": "T11n0318_001:0895b29_0"
    },
    {
        "source_sentence": "如爾所云：『如來作佛積行所致，不以飾辭巧言成道。』",
        "translation": "As you say, 'The Tathāgata creates the Buddha's accumulated practices as a result of his buddha-work and doesn't use ornamented words to skillfully explain the accomplishment of enlightenment.'",
        "source": "T11n0318_001:0895b29_1"
    },
    {
        "source_sentence": "放逸行者，自誤入冥墮四顛倒，沒生死河求出難得；",
        "translation": "Someone who acts carelessly enters into the darkness by mistake and falls into the four inversions, submerging himself in the river of birth and death; seeking escape is difficult.",
        "source": "T11n0318_001:0895c01_2"
    },
    {
        "source_sentence": "若有菩薩聞是經者，願樂奉行立不放逸，必當成就如上所教。」",
        "translation": "If a bodhisattva hears this sūtra and wishes to happily consecrate it without laxity, he'll surely accomplish what was taught above.",
        "source": "T11n0318_001:0895c02_3"
    },
    {
        "source_sentence": "於是會中，八萬四千菩薩即從坐起叉手自歸，同發聲言：「我等，世尊！",
        "translation": "During the assembly, 84,000 bodhisattvas rose from their seats, saluted each other with palms joined and said, We, Bhagavān!",
        "source": "T11n0318_001:0895c05_0"
    },
    {
        "source_sentence": "願皆奉行如佛訓教，具足所願從行得道，除去飾辭放逸之巧，備悉弘誓戒德之要，",
        "translation": "They all wish to practice as the Buddha teaches, fulfilling their vows and attaining enlightenment through practice, getting rid of ornamented language and lax skillfulness, and fully mastering the essentials of moral virtue.",
        "source": "T11n0318_001:0895c06_1"
    },
    {
        "source_sentence": "願使一切悉行敏誨，以行自嚴去眾穢操。」",
        "translation": "May I cause all to follow the wise instructions and practice self-discipline so as to remove all defiled actions.",
        "source": "T11n0318_001:0895c08_2"
    },
    {
        "source_sentence": "時佛欣笑，口中五色光出照於十方，還遶身三匝從頂上入。",
        "translation": "The Buddha then smiled joyfully, emitting five-colored light from his mouth that shone in the ten directions, circled his body three times and entered it from the top of his head.",
        "source": "T11n0318_001:0895c09_3"
    },
    {
        "source_sentence": "賢者舍利弗，前白佛言：「何因緣笑？",
        "translation": "Good man Śāriputra went forward and said to the Buddha, What's the reason for laughing?",
        "source": "T11n0318_001:0895c10_4"
    },
    {
        "source_sentence": "今佛既笑，必當有意。」",
        "translation": "Now that the Buddha's laughing, it must be intentional.",
        "source": "T11n0318_001:0895c11_5"
    },
    {
        "source_sentence": "佛告舍利弗：「汝寧見此諸族姓子師子吼不？」",
        "translation": "The Buddha told Śāriputra, Do you see the lion's roar of these clansmen?",
        "source": "T11n0318_001:0895c13_0"
    },
    {
        "source_sentence": "白言：「已見。",
        "translation": "He said, I've seen it.",
        "source": "T11n0318_001:0895c14_0"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T11n0318_001:0895c14_1"
    },
    {
        "source_sentence": "佛言：「是族姓子於後來世，竟百千劫皆當成佛，號曰淨願如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，",
        "translation": "The Buddha said: In the future a hundred thousand kalpas all these clansmen will attain buddhahood. They will be called the Tathāgata of Pure Vows, the Supreme Truth, the Completely Enlightened One, the Perfectly Enlightened",
        "source": "T11n0318_001:0895c14_2"
    },
    {
        "source_sentence": "為佛、世尊，國土嚴淨猶如西方安養之國，功勳嚴淨等無有異，其壽命等亦無差別。」",
        "translation": "For the sake of the Buddha and Bhagavān, his land is as pure as a peaceful land in the West, its merits are no different from their purity, and its longevity and so forth are no different.",
        "source": "T11n0318_001:0895c17_3"
    },
    {
        "source_sentence": "又問云：「何其壽命等亦無差別？」",
        "translation": "Again, he asked, What's the difference between their lifespans and so forth?",
        "source": "T11n0318_001:0895c19_4"
    },
    {
        "source_sentence": "佛言：「各壽十劫。」",
        "translation": "The Buddha said, Each has ten eons of life.",
        "source": "T11n0318_001:0895c19_5"
    },
    {
        "source_sentence": "爾時師子步雷音菩薩即從坐起，偏袒右肩長跪白佛言：「文殊師利童真，",
        "translation": "It was then that the bodhisattva Siṃhala got up from his seat, bared his right shoulder, knelt down long and said to the Buddha, Mañjuśrī, boy, it is truly true that all sentient beings are born in",
        "source": "T11n0318_001:0895c21_0"
    },
    {
        "source_sentence": "諸佛所歎咨嗟功德，今當久如成最正覺。」",
        "translation": "The merits praised and admired by the buddhas will now be as long as it takes to become the most perfectly enlightened.",
        "source": "T11n0318_001:0895c22_1"
    },
    {
        "source_sentence": "佛言：「汝自以是問文殊師利。」",
        "translation": "The Buddha said, This is why you're asking Mañjuśrī.",
        "source": "T11n0318_001:0895c23_2"
    },
    {
        "source_sentence": "尋如佛教，前問文殊師利：「仁尊久如，當成無上正真之道逮最正覺。」",
        "translation": "Seeking to follow Buddhism, he asked Mañjuśrī in front of him, Sir, how long will it be before you become the unsurpassed true path and attain supreme perfect enlightenment?",
        "source": "T11n0318_001:0895c24_3"
    },
    {
        "source_sentence": "文殊師利答曰：「當作是問：『仁為志學無上正真道乎？』",
        "translation": "Mañjuśrī answered, You should ask this question, 'Is it because you want to train in the unsurpassed true path?'",
        "source": "T11n0318_001:0895c25_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0318_001:0895c27_0"
    },
    {
        "source_sentence": "假使吾身學佛道者，當作斯問。",
        "translation": "Suppose I were to ask this question if I myself train in the Buddha Way.",
        "source": "T11n0318_001:0895c27_1"
    },
    {
        "source_sentence": "吾不求道，當何因成最正覺？」",
        "translation": "If I don't seek the path, what will be the cause for my attainment of perfect enlightenment?",
        "source": "T11n0318_001:0895c27_2"
    },
    {
        "source_sentence": "又問：「仁不以眾生求最正覺乎？」",
        "translation": "Again, he asked, Isn't it because sentient beings seek the most correct awakening?",
        "source": "T11n0318_001:0895c28_3"
    },
    {
        "source_sentence": "答曰：「不也！",
        "translation": "He replied, No!",
        "source": "T11n0318_001:0895c29_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0318_001:0895c29_5"
    },
    {
        "source_sentence": "眾生不可得故。",
        "translation": "It's because sentient beings are unobtainable.",
        "source": "T11n0318_001:0895c29_6"
    },
    {
        "source_sentence": "假使吾得眾生處所，當為眾生志求佛道。",
        "translation": "Suppose I were to attain the abode of sentient beings, and I would aspire to the buddha path for sentient beings.",
        "source": "T11n0318_001:0896a01_7"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T11n0318_001:0896a02_8"
    },
    {
        "source_sentence": "無有吾我人壽命故，由是之故，身無志求亦無退轉。」",
        "translation": "There's no self or self because of the life span of humans, and because of this, there's no body, no aspiration, and no turning back.",
        "source": "T11n0318_001:0896a02_9"
    },
    {
        "source_sentence": "又問：「仁不求佛慕佛法乎？」",
        "translation": "Again, he asked, Don't you seek the Buddha and venerate the Buddha's teaching?",
        "source": "T11n0318_001:0896a03_10"
    },
    {
        "source_sentence": "答曰：「不也！",
        "translation": "He replied, No!",
        "source": "T11n0318_001:0896a04_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0318_001:0896a04_12"
    },
    {
        "source_sentence": "一切諸法皆悉佛法，若使眾法無有，眾漏無受、因緣無想，是志佛道，",
        "translation": "All things are all Buddha-teachings. If you cause all things to be nonexistent, the contaminants to be without sensation and causes and conditions and no perceptions—this is the determination for enlightenment.",
        "source": "T11n0318_001:0896a04_13"
    },
    {
        "source_sentence": "解了若此逮一切法。",
        "translation": "Understanding this, suppose he apprehends all dharmas.",
        "source": "T11n0318_001:0896a06_14"
    },
    {
        "source_sentence": "又如仁問逮立佛法；",
        "translation": "“Furthermore, just as you kindly asked me to establish the buddha-dharma.",
        "source": "T11n0318_001:0896a06_15"
    },
    {
        "source_sentence": "隨仁意答。",
        "translation": "He answered with kindness.",
        "source": "T11n0318_001:0896a07_16"
    },
    {
        "source_sentence": "誰求志者？",
        "translation": "Who's seeking the intention?",
        "source": "T11n0318_001:0896a07_17"
    },
    {
        "source_sentence": "色志佛道乎？",
        "translation": "Are you interested in the buddha path with form?",
        "source": "T11n0318_001:0896a07_18"
    },
    {
        "source_sentence": "色志本淨志佛道乎？",
        "translation": "Is the originally pure aspiration for form and the originally pure aspiration for the Buddha Way?",
        "source": "T11n0318_001:0896a08_19"
    },
    {
        "source_sentence": "其色本無志佛道乎？",
        "translation": "Is their form originally devoid of aspiration for the Buddha Way?",
        "source": "T11n0318_001:0896a08_20"
    },
    {
        "source_sentence": "色自然，色悉空，色恍忽，色本淨，色寂然，以此色法志求佛道成正覺乎？」",
        "translation": "Form is natural, form is completely empty, form is impermanent, form is inherently pure, form is quiescent, and it's because of this form that you seek the Buddha Way and become perfectly enlightened?",
        "source": "T11n0318_001:0896a09_0"
    },
    {
        "source_sentence": "答曰：「不也！",
        "translation": "He replied, No!",
        "source": "T11n0318_001:0896a10_1"
    },
    {
        "source_sentence": "色不志道，本淨自然；",
        "translation": "Form and non-desire for enlightenment are inherently pure and natural.",
        "source": "T11n0318_001:0896a10_2"
    },
    {
        "source_sentence": "以空寂然，諸色法不志求道、不成正覺，法亦如是。」",
        "translation": "Because emptiness is quiescent, form and dharmas don't aspire to the path or become perfectly enlightened, and so are dharmas.",
        "source": "T11n0318_001:0896a11_3"
    },
    {
        "source_sentence": "文殊師利又問曰：「痛想行識及與識法，志求佛道乎？」",
        "translation": "Mañjuśrī also asked, Does pain, perception, volition, consciousness, and the principles of consciousness aspire to the Buddha Way?",
        "source": "T11n0318_001:0896a12_4"
    },
    {
        "source_sentence": "答曰：「不也。」",
        "translation": "He replied, No.",
        "source": "T11n0318_001:0896a13_5"
    },
    {
        "source_sentence": "文殊師利曰：「五陰識法不成正覺。",
        "translation": "Mañjuśrī said, The five aggregates of consciousness and dharmas don't become perfectly enlightened.",
        "source": "T11n0318_001:0896a13_6"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T11n0318_001:0896a14_7"
    },
    {
        "source_sentence": "其外五陰我人壽命，可言有處乎？」",
        "translation": "Can we say there's a place for the five aggregates outside of them, such as self and life?",
        "source": "T11n0318_001:0896a14_8"
    },
    {
        "source_sentence": "答曰：「不也。」",
        "translation": "He replied, No.",
        "source": "T11n0318_001:0896a15_9"
    },
    {
        "source_sentence": "文殊師利曰：「如是，我當分別，以何等法志求佛道成最正覺？」",
        "translation": "Mañjuśrī said, Thus, I will discern what kind of religious aspiration to pursue the Buddha Way and become the most perfectly enlightened?",
        "source": "T11n0318_001:0896a15_10"
    },
    {
        "source_sentence": "又問文殊師利：「其阿夷怙新學菩薩，聞是教訓，將無恐怖乎？",
        "translation": "Again, he asked Mañjuśrī, That newly trained bodhisattva Ajñātaśatru who heard this teaching won't be frightened?",
        "source": "T11n0318_001:0896a17_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0318_001:0896a18_12"
    },
    {
        "source_sentence": "仁之名號一切導首，為眾重任；",
        "translation": "The name of the compassionate one is the leader of all guides, and he receives the high commendation of the multitude.",
        "source": "T11n0318_001:0896a18_13"
    },
    {
        "source_sentence": "而今造證，為諸菩薩頒宣諸法，不志求道不成正覺。」",
        "translation": "Now, he creates the realization and proclaims the teachings for the bodhisattvas who don't aspire to the path and don't become perfectly enlightened.",
        "source": "T11n0318_001:0896a19_14"
    },
    {
        "source_sentence": "文殊師利答曰：「法界不恐，本際不懼，聞佛說法無所畏難。",
        "translation": "Mañjuśrī replied, The Dharma realm isn't feared, and there's no fear at all when you hear the Buddha teach the Dharma without any difficulty.",
        "source": "T11n0318_001:0896a20_15"
    },
    {
        "source_sentence": "其恐懼者則懷憂慼，無憂慼者則離塵埃，彼則解脫。",
        "translation": "Those who are frightened will harbor grief, and those who aren’t grieved will be freed from the dust, and they’ll be liberated.",
        "source": "T11n0318_001:0896a22_16"
    },
    {
        "source_sentence": "其以解脫則無所著，以無所著則無復轉，以無復轉則不復脫，其不脫者彼無從來，",
        "translation": "Because they are liberated, there is no attachment. Because they have no attachment whatsoever, there is no further turning [of the wheel of enlightenment]. Because there is no further turning, there is no more liberation. Those who are not libera",
        "source": "T11n0318_001:0896a23_17"
    },
    {
        "source_sentence": "以無從來亦不從去，其無從去則無所願，其無所願則無志求，其無志求則無退轉。",
        "translation": "Because there's no coming or going, and when there's no going, there's nothing to wish for, when there's nothing to wish for, there's no intention to seek, and when there's no intention to seek, there's",
        "source": "T11n0318_001:0896a25_18"
    },
    {
        "source_sentence": "以無退轉，若不退轉便不退轉，空無不轉無想不願。",
        "translation": "It's because there's no turning back, and if there's no turning back, then there's no turning back, and emptiness has no non-turning, no perception, and no wishing.",
        "source": "T11n0318_001:0896a27_19"
    },
    {
        "source_sentence": "斯本際者佛法不轉，佛法無作無有邊際，佛法無著則無所倚，佛法無行亦無精進，",
        "translation": "The Buddha’s doctrine is without attachment, so there is no basis for it; the Buddha’s doctrine has no practice and no effort.",
        "source": "T11n0318_001:0896a28_20"
    },
    {
        "source_sentence": "亦無所行無有教令，其諸佛法假有號耳。",
        "translation": "There's nothing to practice, nothing to teach, and the Buddha's teachings are nominally called that.",
        "source": "T11n0318_001:0896b01_21"
    },
    {
        "source_sentence": "又計空法無所從生、無所從來、無所從去，又計佛法不離塵勞貪怒癡垢，",
        "translation": "They also imagine that the teaching of emptiness has no origin, no source and no destination, and nothing to follow. They also imagine that the Buddha’s teaching is not free from the stain of worldly desire, hatred, folly, and delusion.",
        "source": "T11n0318_001:0896b02_22"
    },
    {
        "source_sentence": "佛法無染塵勞之行，無有吾我寂無所念，所行無念無盡不起，平等無邪則諸佛法亦無非法。",
        "translation": "The Buddha's teaching is free of defiled and uncontaminated practice, has no self or self, is quiescent and without mindfulness, doesn't think about what's done, doesn't cease indefinitely, and is equal and without error,",
        "source": "T11n0318_001:0896b03_23"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0318_001:0896b06_0"
    },
    {
        "source_sentence": "無處所故、無可行者，是曰佛法。",
        "translation": "Because there's no place and nothing to practice, this is called the Buddha-dharma.",
        "source": "T11n0318_001:0896b06_1"
    },
    {
        "source_sentence": "若有新學菩薩聞是說者，若恐怖者疾成正覺，若不恐怖不成正覺。」",
        "translation": "If there are newly trained bodhisattvas who hear this teaching, then they'll quickly become perfectly enlightened if they're afraid, and if they aren't afraid, they won't become perfectly enlightened.",
        "source": "T11n0318_001:0896b07_0"
    },
    {
        "source_sentence": "又問文殊：「為誰說是？」",
        "translation": "Again, he asked Mañjuśrī, For whom is it taught?",
        "source": "T11n0318_001:0896b08_1"
    },
    {
        "source_sentence": "文殊曰：「其恐怖者乃有妄想，以有妄想，心自念言：『我身當得成最正覺。』",
        "translation": "Mañjuśrī said, That fearful person has deluded thoughts, and because they have deluded thoughts, they think to themselves, 'My body will become the most perfectly enlightened.'",
        "source": "T11n0318_001:0896b09_0"
    },
    {
        "source_sentence": "緣是之故，便起道意志存正覺。",
        "translation": "Because of this, they then give rise to the will for enlightenment and preserve right awakening.",
        "source": "T11n0318_001:0896b10_1"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T11n0318_001:0896b11_2"
    },
    {
        "source_sentence": "從來未曾有覺成空不？」",
        "translation": "Hasn't it ever been the case that perception becomes emptiness?",
        "source": "T11n0318_001:0896b11_3"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T11n0318_001:0896b12_4"
    },
    {
        "source_sentence": "文殊又曰：「世尊不云，一切諸法等如虛空。」",
        "translation": "Mañjuśrī also said, The Bhagavān doesn't say that all dharmas are equal as space.",
        "source": "T11n0318_001:0896b12_5"
    },
    {
        "source_sentence": "答曰：「有是。」",
        "translation": "He replied, Yes, there is.",
        "source": "T11n0318_001:0896b13_6"
    },
    {
        "source_sentence": "文殊又曰：「道猶虛空等亦本無，虛空如道，道如虛空，空之與道則無有二，",
        "translation": "Mañjuśrī also said, The path is like space and so forth, which are originally nonexistent; space is like the path, and the path is like space.",
        "source": "T11n0318_001:0896b13_7"
    },
    {
        "source_sentence": "不可分別。",
        "translation": "They can't be discriminated.",
        "source": "T11n0318_001:0896b15_8"
    },
    {
        "source_sentence": "其解斯等，則無所知亦不無慧。」",
        "translation": "If they understand these things, then they don't know anything and don't lack wisdom.",
        "source": "T11n0318_001:0896b15_9"
    },
    {
        "source_sentence": "文殊師利說是語時，四千比丘漏盡意解，十二姟眾得法眼淨，九萬六千人從古以來未發道心，",
        "translation": "When Mañjuśrī had uttered these words, four thousand monks were liberated from their mental contaminants and twelve hundred bhikṣus attained purity of the Dharma eye. Ninety-six thousand people had never before conceived the thought",
        "source": "T11n0318_001:0896b16_10"
    },
    {
        "source_sentence": "皆發無上正真道意，四萬二千人逮得無所從生法忍。",
        "translation": "They all aroused the intention for the unsurpassed true path, and 42,000 people attained the tolerance of the Dharma that arises from nothing.",
        "source": "T11n0318_001:0896b18_11"
    },
    {
        "source_sentence": "文殊師利佛土嚴淨經卷上",
        "translation": "Mañjuśrī's Pure and Adorned Sutra of the Buddha-lands of Mañjuśrī, Volume 1",
        "source": "T11n0318_001:0896b20_0"
    }
]