[
    {
        "source_sentence": "大寶積經卷第九十二",
        "translation": "*Mahāmegha-sūtra, vol. 95",
        "source": "T11n0310_092:0523b23_0"
    },
    {
        "source_sentence": "大唐三藏法師菩提流志奉　詔譯",
        "translation": "Translated by imperial edict by the Tripiṭaka Master Bodhiruci奉 of the Great Tang",
        "source": "T11n0310_092:0523b25_0"
    },
    {
        "source_sentence": "發勝志樂會第二十五之二",
        "translation": "Twenty-fifth and Second Part of the Assembly on the Arousal of Supreme aspiration",
        "source": "T11n0310_092:0523b26_0"
    },
    {
        "source_sentence": "爾時彌勒菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that Maitreya Bodhisattva Mahāsattva said to the Buddha, Bhagavān!",
        "source": "T11n0310_092:0523b27_0"
    },
    {
        "source_sentence": "初業菩薩既出家已，未得慧力而欲得者，當捨何法、當修何法，未生慧力能令出生，",
        "translation": "“When enlightening beings in the first stage have renounced household life and want to attain enlightenment without having attained the power of knowledge, what teaching should they abandon and what teaching should they cultivate so that the power of knowledge which has not yet",
        "source": "T11n0310_092:0523b27_1"
    },
    {
        "source_sentence": "已生慧力能令增長？」",
        "translation": "Can the power of wisdom that has arisen cause it to grow?",
        "source": "T11n0310_092:0523b29_2"
    },
    {
        "source_sentence": "佛告彌勒菩薩言：「彌勒！",
        "translation": "The Buddha addressed Maitreya Bodhisattva, saying, Maitreya!",
        "source": "T11n0310_092:0523c01_3"
    },
    {
        "source_sentence": "初業菩薩既出家已，欲令慧力而得增長，當於利養知其過失，應須捨離。",
        "translation": "A bodhisattva of the first karma who has left home and wants to cause his power of wisdom to grow, he should know what's wrong with profit and loss and abandon it.",
        "source": "T11n0310_092:0523c01_4"
    },
    {
        "source_sentence": "若好憒閙世俗言話，耽著睡眠廣營眾務，樂諸戲論，如是過失皆應遠離。",
        "translation": "If someone likes the worldly talk of mundane sounds, indulges in drowsiness, engages in extensive activities, and enjoys conceptual elaborations, such faults should all be avoided.",
        "source": "T11n0310_092:0523c03_5"
    },
    {
        "source_sentence": "是故應捨利養修於少欲，捨諸憒閙樂於寂靜，捨諸世話觀於實義。",
        "translation": "Therefore, they should abandon benefits and cultivate few desires, abandon anger and pleasure in quiescence, abandon worldly talk and contemplate the true meaning.",
        "source": "T11n0310_092:0523c05_6"
    },
    {
        "source_sentence": "初夜後夜遠離睡眠，觀察思惟隨行修習。",
        "translation": "At the beginning and at the end of the night, he's far removed from drowsiness and observes, contemplates, follows, and cultivates it.",
        "source": "T11n0310_092:0523c06_7"
    },
    {
        "source_sentence": "捨於眾務及諸戲論，修出世道慈念眾生。",
        "translation": "He's free of all kinds of duties and conceptual elaborations, cultivates the supramundane path, and is compassionate to sentient beings.",
        "source": "T11n0310_092:0523c07_8"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0523c08_9"
    },
    {
        "source_sentence": "初業菩薩既出家已，未得慧力而欲得者，是法應捨、是法應修。",
        "translation": "A bodhisattva of the first karma who has left home and wants to attain it without attaining the power of wisdom, this is a teaching that should be abandoned and this is a teaching that should be cultivated.",
        "source": "T11n0310_092:0523c08_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_092:0523c10_11"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0523c10_12"
    },
    {
        "source_sentence": "彼諸菩薩既出家已，未得慧力而欲得者，不捨利養、不修少欲，未生慧力當令出生，",
        "translation": "Those bodhisattvas who have renounced household life and want to attain it but haven’t yet attained the power of wisdom, don’t give up gain or cultivate few desires, and those who haven’t yet arisen the power of wisdom will",
        "source": "T11n0310_092:0523c10_13"
    },
    {
        "source_sentence": "已生慧力能令增長，無有是處。",
        "translation": "The power of wisdom that has already arisen can cause it to grow, but there's no place for it.",
        "source": "T11n0310_092:0523c12_14"
    },
    {
        "source_sentence": "不捨憒閙、不住寂靜，未生慧力當令出生，已生慧力能令增長，亦無是處。",
        "translation": "If someone doesn't abandon agitation and doesn't abide in quiescence, the power of wisdom that has yet to arise will cause it to arise, and the power of wisdom that has already arisen can cause it to grow, but there's no",
        "source": "T11n0310_092:0523c13_15"
    },
    {
        "source_sentence": "不捨世話、不觀實義，未生慧力當令出生，已生慧力能令增長，無有是處。",
        "translation": "If someone doesn't abandon worldly talk and doesn't contemplate real meanings, the power of wisdom that has yet to arise will cause it to arise, and the power of wisdom that has already arisen can cause it to grow, but there's no",
        "source": "T11n0310_092:0523c14_16"
    },
    {
        "source_sentence": "初夜後夜耽著睡眠曾不覺悟，繫念思惟不捨眾務，好諸戲論，於出世道不能修行，",
        "translation": "The first watch of the night and the last watch of the night are addicted to sleep, never awakening. They concentrate on thought without relinquishing all their duties, indulge in idleness and amusement, and do not engage in world",
        "source": "T11n0310_092:0523c16_17"
    },
    {
        "source_sentence": "於諸眾生不生慈念，未生慧力當令出生，已生慧力能令增長，亦無是處。",
        "translation": "If someone doesn't give rise to thoughts of kindness for sentient beings, the power of wisdom that has yet to arise will cause them to arise, and the power of wisdom that has already arisen can cause them to grow, but there's no",
        "source": "T11n0310_092:0523c18_18"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0523c20_19"
    },
    {
        "source_sentence": "是故菩薩未得慧力而欲得者，應捨諸法當須捨離，應修諸法當須修習。",
        "translation": "Therefore, a bodhisattva who wants to attain it but hasn't yet attained the power of wisdom should abandon all dharmas and need to abandon them, and he should cultivate all dharmas and cultivate them.",
        "source": "T11n0310_092:0523c20_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_092:0523c22_21"
    },
    {
        "source_sentence": "菩薩智慧從因緣生，若無因緣終不能生，因緣和合爾乃得生。」",
        "translation": "A bodhisattva's wisdom arises from causes and conditions, but if there are no causes and conditions, it can never arise; the combination of causes and conditions will then give rise to it.",
        "source": "T11n0310_092:0523c22_22"
    },
    {
        "source_sentence": "爾時彌勒菩薩白佛言：「世尊！",
        "translation": "It was then that Maitreya said to the Buddha, Bhagavān!",
        "source": "T11n0310_092:0523c23_23"
    },
    {
        "source_sentence": "云何名為利養中過？",
        "translation": "What's called the fault in profiting?",
        "source": "T11n0310_092:0523c24_24"
    },
    {
        "source_sentence": "若觀察時，能令菩薩樂於少欲不生熱惱。」",
        "translation": "If he observes it, he'll be able to cause the bodhisattva to delight in few desires and not become feverish.",
        "source": "T11n0310_092:0523c24_25"
    },
    {
        "source_sentence": "佛言：「彌勒！",
        "translation": "The Buddha said, Maitreya!",
        "source": "T11n0310_092:0523c25_26"
    },
    {
        "source_sentence": "初業菩薩當觀利養生貪欲故，當觀利養壞失正念生瞋恚故，當觀利養念其得失生愚癡故，",
        "translation": "Because the enlightening beings in the first stage of action should contemplate gain and nourish craving; they should contemplate gain and loss because right mindfulness arouses anger; they should contemplate gain and loss because delusion arise from thoughts of gain and",
        "source": "T11n0310_092:0523c26_27"
    },
    {
        "source_sentence": "當觀利養能生高下嫉妬心故，當觀利養於親友家慳悋耽著生誑惑故，當觀利養成就愛味生諂曲故，",
        "translation": "You should observe that benefits give rise to high and low feelings of jealousy; you should observe that benefits give rise to anger and delusion because they are stingy and attached to their friends and relatives, and you should observe that benefits cultivate flat",
        "source": "T11n0310_092:0523c28_28"
    },
    {
        "source_sentence": "當觀利養捨四聖種無慚愧故，當觀利養一切諸佛所不許可、數習憍逸生高慢故，",
        "translation": "You should observe the benefits because you abandon the four noble kinds of shamelessness. You should observe the benefits because all buddhas disapprove them and repeatedly cultivate coarseness and arrogance, producing conceit.",
        "source": "T11n0310_092:0524a01_29"
    },
    {
        "source_sentence": "當觀利養於勝福田起於輕慢為魔黨故，當觀利養眾惡根本諸善壞故，當觀利養多所貪著猶霜雹故，",
        "translation": "You should observe that profit arises from the superior field of merit because it's a contempt for Māra as a party, and you should observe that profit is the root of badness and the destruction of goodness, and you should observe that profit is often cra",
        "source": "T11n0310_092:0524a03_30"
    },
    {
        "source_sentence": "當觀利養於親友家瞻候顏色生憂惱故，當觀利養愛物損壞憂心亂故，當觀利養於四念處多所忘失白法羸故，",
        "translation": "You should observe benefits because you're looking out for your friends and relatives at their homes with sadness and anguish, and you should observe benefits because you're addicted to things that harm you and have a troubled mind, and you should observe benefits",
        "source": "T11n0310_092:0524a05_31"
    },
    {
        "source_sentence": "當觀利養於四正勤多有退失、能令一切他論勝故，當觀利養自言已得神通智慧違背生故，",
        "translation": "You should observe that the four kinds of right effort are often regressed, because they can cause all others to be victorious in their arguments. You should observe that the benefits themselves say they have attained supernormal powers and wisdom, because it is contrary to",
        "source": "T11n0310_092:0524a08_32"
    },
    {
        "source_sentence": "當觀利養先得後失怨憎生故，當觀利養互相瞋嫌說其過惡多覺觀故，當觀利養為於活命營諸世業計度思惟安樂減故，",
        "translation": "It should be observed that benefits are first gained and then lost because of the arising of enemies and resentments. It should be observed that benefits are mutually hateful, telling each other about their faults and often perceive and contemplate them",
        "source": "T11n0310_092:0524a10_33"
    },
    {
        "source_sentence": "當觀利養乃至禪定解脫三昧三摩鉢底心如婬女能退失故，當觀利養捨離智斷墮於地獄、餓鬼、畜生、閻摩羅界諸惡道故，",
        "translation": "It's because the mind that observes profit and loss up to the liberation samāpatti of meditation is like a promiscuous woman who can regress, and it's because they observe profit and abandon knowledge and stop falling into hell, hungry ghosts",
        "source": "T11n0310_092:0524a13_34"
    },
    {
        "source_sentence": "當觀利養與提婆達多、烏陀洛迦同於法住墮惡道故。",
        "translation": "You should observe that benefits are the same as Devadatta and Udraka, because they abide in bad destinies like the Dharma and fall into bad destinies.",
        "source": "T11n0310_092:0524a16_35"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0524a17_36"
    },
    {
        "source_sentence": "初業菩薩如是觀察利養過失，樂於少欲不生熱惱。",
        "translation": "The first-practic bodhisattva thus observes the gains and losses, delighting in few desires that don't give rise to anguish.",
        "source": "T11n0310_092:0524a17_37"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_092:0524a19_38"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0524a19_39"
    },
    {
        "source_sentence": "少欲菩薩於一切過皆悉不生，堪為諸佛清淨法器。",
        "translation": "A bodhisattva with few desires doesn't give rise to all faults, and he's capable of being the pure Dharma vessel of the buddhas.",
        "source": "T11n0310_092:0524a19_40"
    },
    {
        "source_sentence": "而不繫屬在家出家，住於真實最勝意樂，不為卑下亦不驚怖，離諸惡道墮落畏故，",
        "translation": "They don’t belong to the householders or renunciants, and they abide in the supreme aspiration for truth. They aren’t inferior or frightened, because they are free of the fear of falling into bad destinies.",
        "source": "T11n0310_092:0524a20_41"
    },
    {
        "source_sentence": "無能映蔽捨耽味故，眾魔境界得解脫故，一切諸佛之所稱讚，諸天及人亦當愛羨。",
        "translation": "Because they can't obscure the taste of indulgence, and because they attain liberation in the realm of Māra, all the buddhas praise them, and gods and humans will also love and admire them.",
        "source": "T11n0310_092:0524a22_42"
    },
    {
        "source_sentence": "於諸禪定而不染著，住邊際故。",
        "translation": "They are not defiled and attached to the trances, because they abide at the limits.",
        "source": "T11n0310_092:0524a24_43"
    },
    {
        "source_sentence": "其心質直無有諂曲，於五欲中亦不放逸，見其過故。",
        "translation": "Their minds are straightforward and without deceit, and they don't indulge in the five desires because they see their faults.",
        "source": "T11n0310_092:0524a25_44"
    },
    {
        "source_sentence": "如說修行能住聖種，同梵行者亦當愛樂。",
        "translation": "As it's said that cultivation can abide in the noble seed, those who practice the same religious practice should also delight in it.",
        "source": "T11n0310_092:0524a26_45"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0524a27_46"
    },
    {
        "source_sentence": "若有菩薩智慧聰敏，於此功德能如是知，以勝意樂當捨利養，以勝意樂住於少欲，",
        "translation": "“If there is a bodhisattva who is wise, knowledgeable, and intelligent, knowing the merit of these qualities in this way, he or she will give up gain with superior intentions. With superior intentions, he or she will live by few desires",
        "source": "T11n0310_092:0524a27_47"
    },
    {
        "source_sentence": "為斷貪愛而發起故。」",
        "translation": "It's because they stop craving and give rise to it.",
        "source": "T11n0310_092:0524a29_48"
    },
    {
        "source_sentence": "爾時彌勒菩薩白佛言：「世尊！",
        "translation": "It was then that Maitreya said to the Buddha, Bhagavān!",
        "source": "T11n0310_092:0524a29_49"
    },
    {
        "source_sentence": "云何名為憒閙中過？",
        "translation": "What's called the fault of being a middling torpor?",
        "source": "T11n0310_092:0524b01_50"
    },
    {
        "source_sentence": "若觀察時，菩薩獨處閑靜不生熱惱。」",
        "translation": "If he observes it, the bodhisattva is alone in a quiet place and doesn't become feverish.",
        "source": "T11n0310_092:0524b02_0"
    },
    {
        "source_sentence": "佛言：「彌勒！",
        "translation": "The Buddha said, Maitreya!",
        "source": "T11n0310_092:0524b02_1"
    },
    {
        "source_sentence": "初業菩薩應當觀察，憒閙過失有二十種。",
        "translation": "A bodhisattva in the first stage of karma should observe that there are 20 kinds of debilitating faults.",
        "source": "T11n0310_092:0524b03_2"
    },
    {
        "source_sentence": "若觀察時，能令菩薩獨處閑靜不生熱惱。",
        "translation": "If he observes it, he can cause the bodhisattva to be alone in a quiet place and not become agitated.",
        "source": "T11n0310_092:0524b04_0"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0524b04_1"
    },
    {
        "source_sentence": "云何名為樂於憒閙二十種過？",
        "translation": "What are the twenty kinds of faults that are called delighting in commotion?",
        "source": "T11n0310_092:0524b05_2"
    },
    {
        "source_sentence": "一者不護身業，二者不護語業，三者不護意業，四者多饒貪欲，五者增長愚癡，",
        "translation": "They are (1) undisciplined bodily action, (2) undisciplined verbal action, (3) undisciplined mental action, (4) abundant craving and desire, and (5) increasing ignorance.",
        "source": "T11n0310_092:0524b05_3"
    },
    {
        "source_sentence": "六者耽著世話，七者離出世語，八者於非法中尊重修習，九者捨離正法，",
        "translation": "The sixth is addicted to worldly talk. The seventh abstains from worldly talk. The eighth honors and practices what is against the Dharma. The ninth abandons the true-dharma.",
        "source": "T11n0310_092:0524b07_4"
    },
    {
        "source_sentence": "十者天魔波旬而得其便，十一者於不放逸未曾修習，十二者於放逸行常懷染著，",
        "translation": "The tenth is that the god Māra Pāpīyān obtains an advantage over them. The eleventh is that he never practices indulgence, and the twelfth is that he always harbors defiled attachment to indulgence.",
        "source": "T11n0310_092:0524b09_5"
    },
    {
        "source_sentence": "十三者多諸覺觀，十四者損減多聞，十五者不得禪定，十六者無有智慧，",
        "translation": "The thirteenth is to have many feelings and contemplations, the fourteenth is to lose much learning, the fifteenth is not to attain meditation, and the sixteenth is lacking wisdom.",
        "source": "T11n0310_092:0524b11_6"
    },
    {
        "source_sentence": "十七者速疾而得非諸梵行，十八者不愛於佛，十九者不愛於法，二十者不愛於僧。",
        "translation": "17. They quickly attain what's not religious practice, 18. They don't love the Buddha, 19. They don't love the Dharma, and 20. They don't love the saṃgha.",
        "source": "T11n0310_092:0524b12_7"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0524b14_8"
    },
    {
        "source_sentence": "是為菩薩觀於憒閙二十種過。」",
        "translation": "This is the bodhisattva's observation of the 20 kinds of faults in anger and confusion.",
        "source": "T11n0310_092:0524b14_9"
    },
    {
        "source_sentence": "「捨離諸貪瞋，　　不住於憒閙，",
        "translation": "“Abandoning craving and anger, they don’t abide in hatred or agitation.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　若有專住彼，　　是過不應作。",
        "translation": "If someone were to abide exclusively there, this would be a mistake that shouldn't be done.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　憍慢及覺觀，　　皆由憒閙生，",
        "translation": "The arrogance, pride, and the perception and contemplation all arise from hatred and confusion.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　壞行無戒人，　　稱歎於憒閙。",
        "translation": "A person who breaks the precepts and doesn't observe them praises commotion and confusion.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　愚人樂世論，　　退失第一義，",
        "translation": "Foolish people delight in worldly theories and regress from the ultimate truth.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　放逸多覺觀，　　是過不應作。",
        "translation": "This is a mistake that shouldnly not be made when you're careless and often awake to contemplation.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　比丘捨多聞，　　言論不如理，",
        "translation": "A monk who gives up much learning and speaks in ways that are not reasonable.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　損減諸禪定，　　常思惟世間。",
        "translation": "Disparaging the meditations, he always contemplates the world.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　耽著思惟者，　　何得於寂靜？",
        "translation": "If someone is addicted to contemplation, how can they attain quiescence?",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　其心常散逸，　　永離於正觀。",
        "translation": "Their minds are always distracted, permanently detached from right contemplation.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　速得非梵行，　　諠雜無儀撿，",
        "translation": "They quickly attain the practice of non- celibacy, which is unclean and lacks proper etiquette.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　亦不曾愛佛，　　及愛於聖眾，",
        "translation": "Nor does he love buddhas And the holy ones.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　棄捨離欲法，　　耽著非法言。",
        "translation": "They abandon the dharmas that are free of desire and become attached to unlawful speech.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　我常捨千身，　　支分及頭目，",
        "translation": "I always abandon a thousand bodies, limbs, parts, and my head and eyes.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　為求無上道，　　聞法無厭足；",
        "translation": "In order to seek the highest path, They hear the Teaching tirelessly.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　是諸非法人，　　少聞便厭捨。",
        "translation": "These non-Buddhist people will become disillusioned with a little learning.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　我昔作國王，　　為求四句偈，",
        "translation": "Formerly I was the king of my country, Seeking a four-line verse.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　妻子及財寶，　　悉皆能施與。",
        "translation": "They can give away their wives, wealth, and possessions.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　何有於智者，　　而不勤聽法？",
        "translation": "How could there be a wise person who doesn't diligently listen to the teaching?",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　我甞捨一切，　　非法之戲論，",
        "translation": "I've abandoned everything, given up all non-Buddhist conceptual elaborations,",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　為於百千劫，　　難得解脫故；",
        "translation": "It is because it will not be easy to attain liberation For a hundred thousand kalpas.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　汝等應欣樂，　　志求微妙法。",
        "translation": "You should all be delighted and aspire to the subtle Dharma.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　若樂於解脫，　　最勝功德者，",
        "translation": "If someone delights in liberation, the most excellent virtue, they'll attain it.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　世間諸事業，　　皆所不應問。",
        "translation": "None of the world's works should be asked.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　衣食無勝利，　　亦不證涅槃，",
        "translation": "There’s no advantage in food or clothing, and they don’t realize nirvāṇa.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　當稱嘆最勝，　　善來諸比丘，",
        "translation": "You should praise the most excellent, Well-come monks!",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　應敷座令坐，　　互說諸法要。",
        "translation": "They should spread out their seats and make them sit, Teaching each other the essentials of the Dharma.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　人身甚難得，　　隨分行白法，",
        "translation": "The human body is very difficult to obtain, so one follows the white dharmas accordingly.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　讀誦及禪定，　　汝應如是問。",
        "translation": "You should ask the same questions about recitation and meditation.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　如來入涅槃，　　遺法當滅壞，",
        "translation": "When the Tathāgata enters nirvalJa, The bequeathed dharma Will cease and perish.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　比丘多放逸，　　樂眾棄閑靜，",
        "translation": "A monk is often lazy, preferring the congregation and abandoning quietude.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　為飲食利養，　　晝夜談世話。",
        "translation": "For the sake of food and drink and profit, he talks about worldly affairs day and night.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　愚人於夢中，　　驚怖而漂溺，",
        "translation": "Foolish people are frightened and drown in a dream.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　自知多毀犯，　　當墮三惡道。",
        "translation": "Knowing for themselves how many violations there are, they'll fall into the three bad destinies.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　應生歡喜心，　　獨處於閑寂，",
        "translation": "You should give rise to the mind of joy, Being alone in seclusion.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　若在阿蘭若，　　志求無上道。",
        "translation": "If he's in a forest, he wants to pursue the unsurpassed path.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　不應見人過，　　自謂最尊勝，",
        "translation": "You should not see the faults of others and call yourself the most honored one.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　憍恣放逸本，　　莫輕下劣人，",
        "translation": "The root of sexual indulgence and heedlessness is not to despise inferior people.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　彼於遺法中，　　漸次而解脫。",
        "translation": "They are gradually liberated in order Of the teachings they leave behind.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　比丘雖破戒，　　深信於三寶，",
        "translation": "Although a monk breaks the precepts, he deeply believes in the Three Treasures.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　是則解脫因，　　不應見其過。",
        "translation": "This is the cause of liberation, and you should not see its faults.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　摧伏貪瞋難，　　勿驚於放逸，",
        "translation": "To overcome the difficulty of craving and anger, don’t be frightened by laziness.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　餘習法應爾，　　是故不須說。",
        "translation": "The other accompanying mental states should be so. That is why they need not be spoken of.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　若清淨比丘，　　伺他人過失，",
        "translation": "If a pure monk investigates the faults of others,",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　是最非真實，　　不名修正法。",
        "translation": "It's the most unreal, and it's not called the correct teaching.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　如理修行者，　　當須自觀察，",
        "translation": "Those who practice it correctly should examine for themselves.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　求道諸比丘，　　捨離惡言論，",
        "translation": "The monks who seek the path Forsake harsh speech.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "　常以歡喜心，　　獨處於閑靜。」",
        "translation": "Always with joy, he's alone in a quiet place.",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "爾時世尊重說偈言：爾時彌勒菩薩復白佛言：「希有世尊！",
        "translation": "It was then that the Bhagavān spoke a verse, saying, At that point, Maitreya again said to the Buddha, Rarely, Bhagavān!",
        "source": "T11n0310_092:0524b15_10"
    },
    {
        "source_sentence": "耽著憒閙乃有如是無量過惡，退失功德無有利益，增長煩惱墮諸惡趣遠離白法。",
        "translation": "They're addicted to the noise and disturbances that have such measureless faults, regress from merit without benefit, grow in afflictions, fall into bad destinies, and part with the white dharma.",
        "source": "T11n0310_092:0525a06_11"
    },
    {
        "source_sentence": "何有菩薩求善法者，聞是過失而不樂於獨處閑靜？」",
        "translation": "How could there be a bodhisattva seeking the good Dharma who hears these faults and doesn't enjoy being alone in a quiet place?",
        "source": "T11n0310_092:0525a08_12"
    },
    {
        "source_sentence": "爾時彌勒菩薩白佛言：「世尊！",
        "translation": "It was then that Maitreya said to the Buddha, Bhagavān!",
        "source": "T11n0310_092:0525a09_13"
    },
    {
        "source_sentence": "云何名為世話中過？",
        "translation": "What's called a mistake in worldly talk?",
        "source": "T11n0310_092:0525a10_14"
    },
    {
        "source_sentence": "若觀察時，菩薩應住決定之義，由觀是義不生熱惱。」",
        "translation": "If he observes this, the bodhisattva should abide in the meaning of certainty, and because he observes this meaning, no fever arises.",
        "source": "T11n0310_092:0525a11_15"
    },
    {
        "source_sentence": "佛言：「彌勒！",
        "translation": "The Buddha said, Maitreya!",
        "source": "T11n0310_092:0525a13_0"
    },
    {
        "source_sentence": "初業菩薩應當觀察世話過失有二十種。",
        "translation": "A beginner bodhisattva should observe that there are 20 kinds of faults in worldly speech.",
        "source": "T11n0310_092:0525a13_1"
    },
    {
        "source_sentence": "若觀察時，能令菩薩住決定義，由觀是義不生熱惱。",
        "translation": "When they contemplate it, they can cause bodhisattvas to abide in certainty about its meaning, and because they contemplate this meaning, no heat or anguish arises.",
        "source": "T11n0310_092:0525a14_2"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0525a15_3"
    },
    {
        "source_sentence": "云何名為樂於世話二十種過？",
        "translation": "What are the twenty kinds of faults that are called enjoying worldly talk?",
        "source": "T11n0310_092:0525a15_4"
    },
    {
        "source_sentence": "一者心生憍恣不敬多聞，二者於諸諍論多起執著，三者失於正念如理作意，",
        "translation": "One, their minds become coarse and unworthy of the learned; two, they give rise to numerous attachments to disputes and arguments; and three, they lose right mindfulness and right attention.",
        "source": "T11n0310_092:0525a16_5"
    },
    {
        "source_sentence": "四者為所不應身多躁動，五者速疾高下壞於法忍，六者心常剛強禪定智慧曾不熏修，",
        "translation": "The fourth is that their bodies are often agitated because of what they shouldn’t be. The fifth is the swift, high, and low destruction of patience in regard to doctrine. The sixth is that their minds are always rigid",
        "source": "T11n0310_092:0525a18_0"
    },
    {
        "source_sentence": "七者非時而語言論所纏，八者不能堅固證於聖智，九者不為天龍之所恭敬，",
        "translation": "The eighth is unable to firmly realize holy knowledge. The ninth is not honored by gods and dragons.",
        "source": "T11n0310_092:0525a20_0"
    },
    {
        "source_sentence": "十者為辯才者常懷輕賤，十一者為身證者之所呵責，十二者不住正信常懷悔恨，",
        "translation": "The eleventh is criticized by witnesses. The twelfth does not abide in right faith and always harbors remorse.",
        "source": "T11n0310_092:0525a21_1"
    },
    {
        "source_sentence": "十三者心多疑惑搖動不安，十四者猶如倡伎隨逐音聲，十五者染著諸欲隨境流轉，",
        "translation": "The thirteenth is that their minds are often doubtful, agitated, and unsettled. The fourteenth is like the sound of music played in a debate. The fifteenth is that defiled desires flow naturally along with objects",
        "source": "T11n0310_092:0525a23_2"
    },
    {
        "source_sentence": "十六者不觀真實誹謗正法，十七者有所希求常不稱遂，十八者其心不調為人棄捨，",
        "translation": "The sixteenth is that they do not contemplate reality and denigrate the true teaching. The seventeenth is that they always fail to fulfill what they seek. The eighteenth is that their minds are not disciplined and they abandon others.",
        "source": "T11n0310_092:0525a25_3"
    },
    {
        "source_sentence": "十九者不知法界隨順惡友，二十者不了諸根繫屬煩惱。",
        "translation": "19. They don't know the Dharma realm and follow bad friends, and 20. They don't understand the afflictions that are bound by the faculties.",
        "source": "T11n0310_092:0525a27_4"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0525a28_5"
    },
    {
        "source_sentence": "是為菩薩樂於世話二十種過。」",
        "translation": "These are the twenty kinds of faults that bodhisattvas delight in worldly talk.",
        "source": "T11n0310_092:0525a28_6"
    },
    {
        "source_sentence": "「憍傲於多聞，　　執著諸諍論，",
        "translation": "Arrogant and arrogant, they're well-versed, clinging to disputes and arguments,",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　失念不正知，　　是名世話過。",
        "translation": "Losing mindfulness and not knowing correctly is called the fault of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　遠離正思惟，　　身心不寂靜，",
        "translation": "Being far removed from right contemplation, One’s body and mind are not at rest.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　退失於法忍，　　是名世話過。",
        "translation": "To retrogress and lose the tolerance of the Dharma is called a fault of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　其心不調順，　　遠離奢摩他，",
        "translation": "Their minds aren’t disciplined, and they’re far removed from quietude.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　及毘鉢舍那，　　是名世話過。",
        "translation": "Vipaśyanā is a transgression of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　不尊敬師長，　　愛樂於世論，",
        "translation": "They do not honor teachers and elders, And take delight in worldly theories.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　智慧不堅固，　　是名世話過。",
        "translation": "Wisdom that's not resolute, this is called the fault of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　諸天不恭敬，　　龍神亦復然，",
        "translation": "The gods are not honored, And so are the dragons and spirits.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　退失於辯才，　　是名世話過。",
        "translation": "To regress from the power of eloquence is called a fault of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　聖者常呵責，　　如是耽著人，",
        "translation": "The noble one always rebukes people who are thus addicted.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　唐捐於壽命，　　是名世話過。",
        "translation": "This is called the fault of worldly talk about giving up one’s life.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　諸行皆缺減，　　遠離大菩提，",
        "translation": "The practices are all deficient, far removed from great enlightenment.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　命終生憂苦，　　是名世話過。",
        "translation": "At the end of life, sorrow and suffering arise, which is called worldly fault.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　疑惑心動搖，　　猶如風吹草，",
        "translation": "The mind shaken by doubt and confusion, Like the wind blowing down a blade of grass.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　智慧不堅固，　　是名世話過。",
        "translation": "Wisdom that's not resolute, this is called the fault of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　譬如倡妓人，　　讚說他勇健，",
        "translation": "It's like a singer who praises the boldness of others.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　彼人亦復然，　　是名世話過。",
        "translation": "That person is likewise, which is called a fault of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　隨逐世語言，　　染著諸欲境，",
        "translation": "Following worldly speech, they're stained by the objects of desire.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　常行於邪道，　　是名世話過。",
        "translation": "Always following a wrong path is called the fault of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　希求心不遂，　　諂曲多諍論，",
        "translation": "Their desires are unfulfilled, And their flattery is much talked about.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　遠離於聖行，　　是名世話過。",
        "translation": "Being far removed from holy practices is called the fault of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　愚人得少利，　　其心常搖動，",
        "translation": "Foolish people attain little benefit, Their minds always wavering.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　如猿猴躁擾，　　是名世話過。",
        "translation": "Like a monkey that's agitated and disturbed, this is called the fault of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　智慧多退失，　　無有覺悟心，",
        "translation": "Their wisdom is often retrogressing, And they have no awareness of enlightenment.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　愚者所攝持，　　是名世話過。",
        "translation": "What's collected by foolish people is called the fault of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　迷惑於眼耳，　　乃至意亦然，",
        "translation": "Confounded by the eye and ear, it’s likewise with the mind.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　常與煩惱俱，　　是名世話過。",
        "translation": "Being always accompanied by afflictions is called the fault of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　愚人樂世話，　　盡壽常空過，",
        "translation": "Foolish people enjoy worldly talk, and their whole lives are always empty of faults.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　不如思一義，　　獲利無有邊。",
        "translation": "They don't think of a single meaning, and their benefits have no limit.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　譬如甘蔗味，　　雖不離皮節，",
        "translation": "It's like the taste of sugarcane, even though it doesn't part from the skin knuckle.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　亦不從皮節，　　而得於勝味。",
        "translation": "It doesn't come from the skin knuckle, yet it gets its superior taste.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　皮節如世話，　　義理猶勝味，",
        "translation": "The skin and knuckles are like worldly sayings, Yet their meaning is superior.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　是故捨虛言，　　思惟於實義。",
        "translation": "Therefore, they abandon false speech and contemplate the true meaning.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　智慧諸菩薩，　　能知世話過，",
        "translation": "The wise bodhisattvas Are able to know the faults of worldly talk.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　常愛樂思惟，　　第一義功德。",
        "translation": "They always delight in contemplation, Always considering the supreme virtue of truth.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　法味及義味，　　解脫第一味，",
        "translation": "The taste of doctrine and the taste of meaning are the first taste of liberation.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　誰有智慧者，　　心生不欣樂？",
        "translation": "Who has wisdom that doesn't give rise to joy in the mind?",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　是故應棄捨，　　無利諸言話，",
        "translation": "Therefore, you should abandon unbeneficial speech.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　常樂勤思惟，　　殊勝第一義。",
        "translation": "He always delights in diligently contemplating the supreme truth.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　如是第一法，　　諸佛所讚歎，",
        "translation": "Thus, this supreme teaching is Praised by the Buddhas.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "　是故明智人，　　當樂勤修習。」",
        "translation": "Therefore, it's clear that wise people should delight in diligently cultivating it.",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "爾時世尊重說偈言：爾時彌勒菩薩復白佛言：「希有世尊！",
        "translation": "It was then that the Bhagavān spoke a verse, saying, At that point, Maitreya again said to the Buddha, Rarely, Bhagavān!",
        "source": "T11n0310_092:0525a29_7"
    },
    {
        "source_sentence": "乃能善說世話過失，思惟勝義利益功德。",
        "translation": "He's able to skillfully explain the faults of worldly talk and contemplate the benefits of ultimate meaning and merit.",
        "source": "T11n0310_092:0525c15_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_092:0525c16_9"
    },
    {
        "source_sentence": "何有菩薩求於如來真實智慧，而復樂於虛誑世話？」",
        "translation": "How could there be a bodhisattva who seeks the Tathāgata's true wisdom and yet delights in false worldly talk?",
        "source": "T11n0310_092:0525c16_10"
    },
    {
        "source_sentence": "爾時彌勒菩薩而白佛言：「世尊！",
        "translation": "It was then that Maitreya said to the Buddha, Bhagavān!",
        "source": "T11n0310_092:0525c19_0"
    },
    {
        "source_sentence": "云何名為睡眠中過？",
        "translation": "What's called a fault in drowsiness?",
        "source": "T11n0310_092:0525c19_1"
    },
    {
        "source_sentence": "若觀察時，菩薩應當發起精進不生熱惱。」",
        "translation": "If he observes it, the bodhisattva should give rise to effort and not become feverish.",
        "source": "T11n0310_092:0525c20_2"
    },
    {
        "source_sentence": "佛言：「彌勒！",
        "translation": "The Buddha said, Maitreya!",
        "source": "T11n0310_092:0525c21_3"
    },
    {
        "source_sentence": "初業菩薩應當觀察睡眠過失有二十種。",
        "translation": "A beginner bodhisattva should observe that there are 20 kinds of faults in drowsiness.",
        "source": "T11n0310_092:0525c21_4"
    },
    {
        "source_sentence": "若觀察時，能令菩薩發起精進意樂無倦。",
        "translation": "When they observe them, they can cause bodhisattvas to give rise to the intention to make effort without weariness.",
        "source": "T11n0310_092:0525c22_5"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0525c23_6"
    },
    {
        "source_sentence": "云何名為樂於睡眠二十種過？",
        "translation": "What are the twenty kinds of faults that make one delight in sleep?",
        "source": "T11n0310_092:0525c23_7"
    },
    {
        "source_sentence": "一者懈怠嬾惰，二者身體沈重，三者顏色憔悴，四者增諸疾病，五者火界羸弱，",
        "translation": "They are (1) lazy and indolent, (2) torpor and dullness of body, (3) emaciated appearance, (4) increased sickness, and (5) the weakness of the fire element.",
        "source": "T11n0310_092:0525c24_8"
    },
    {
        "source_sentence": "六者食不消化，七者體生瘡疱，八者不勤修習，九者增長愚癡，十者智慧羸劣，",
        "translation": "The sixth is not digesting food; the seventh is giving rise to sores and blisters in their bodies; the eighth is not diligently cultivating practices; the ninth increases folly; and the tenth weakens wisdom.",
        "source": "T11n0310_092:0525c26_0"
    },
    {
        "source_sentence": "十一者皮膚闇濁，十二者非人不敬，十三者為行愚鈍，十四者煩惱纏縛，",
        "translation": "The eleventh is dark and unsightly skin. The twelfth is disrespected by those who are not human beings. The thirteenth is ignorant and dull-minded in their behavior. The fourteenth is bound by afflictions",
        "source": "T11n0310_092:0525c27_1"
    },
    {
        "source_sentence": "十五者隨眠覆心，十六者不樂善法，十七者白法減損，十八者行下劣行，",
        "translation": "The fifteenth is the mind covered by attachment, the sixteenth does not delight in virtuous states of mind, the seventeenth loses what belongs to virtue, and the eighteenth engages in inferior behavior.",
        "source": "T11n0310_092:0525c29_2"
    },
    {
        "source_sentence": "十九者憎嫌精進，二十者為人輕賤。",
        "translation": "19. Being disgusted with effort and 20. Being despised by others.",
        "source": "T11n0310_092:0526a02_3"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0526a03_0"
    },
    {
        "source_sentence": "是為菩薩樂於睡眠二十種過。」",
        "translation": "These are the 20 kinds of faults that make a bodhisattva happy in drowsiness.",
        "source": "T11n0310_092:0526a03_1"
    },
    {
        "source_sentence": "「身重無儀撿，　　懈怠少堪任，",
        "translation": "Their bodies are heavy and unworthy of being inspected. They are lazy and unable to be disciplined.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　顏色無光澤，　　是樂睡眠過。",
        "translation": "Their appearance lacks luster, which is the fault of blissful sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　彼人常病惱，　　風黃多積集，",
        "translation": "That person is always sick and afflicted by illness, with a lot of accumulation of wind and yellow.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　四大互違反，　　是樂睡眠過。",
        "translation": "The four elements are mutually contradictory: This is the fault of bliss and sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　飲食不消化，　　身體無光潤，",
        "translation": "Their food and drink won’t be digested, and their bodies lack light and moisture.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　聲嘶不清徹，　　是樂睡眠過。",
        "translation": "The sound that screams and doesn't penetrate is the fault of pleasant drowsiness.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　其身生瘡疱，　　晝夜常昏睡，",
        "translation": "Their bodies give rise to blisters of sores, Day and night they always sleep in the darkness.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　諸虫生機關，　　是樂睡眠過。",
        "translation": "This is the fault of pleasure and sleep when insects give rise to their organs.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　退失於精進，　　乏少諸財寶，",
        "translation": "They'll regress from their effort, lacking in possessions and treasures.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　多夢無覺悟，　　是樂睡眠過。",
        "translation": "To often dream without awakening is the fault of delighting in sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　癡網常增長，　　樂著於諸見，",
        "translation": "The net of delusion always grows, delighting in views.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　熾盛難療治，　　是樂睡眠過。",
        "translation": "The blazing and difficult to treat is the fault of delighting in sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　損減諸智慧，　　增長於愚癡，",
        "translation": "Disparaging wisdom, they increase ignorance.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　志意常下劣，　　是樂睡眠過。",
        "translation": "Their aspirations are always weak, which is the fault of pleasure and sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　彼住阿蘭若，　　常懷懈怠心，",
        "translation": "Those who live in the forest always harbor lazy thoughts.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　非人得其便，　　是樂睡眠過。",
        "translation": "If someone doesn't get an advantage, it's the fault of enjoying sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　蒙憒失正念，　　諷誦不通利，",
        "translation": "I'm sick of losing my right mindfulness, reciting it without penetrating it.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　說法多廢忘，　　是樂睡眠過。",
        "translation": "To teach the Dharma and often forget it is a fault of pleasure and sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　由癡起迷惑，　　住於煩惱中，",
        "translation": "Delusion arises from delusion, and abides in the afflictions.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　其心不安樂，　　是樂睡眠過。",
        "translation": "Their minds are unsettled and happy, which is the fault of happiness and sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　功德皆損減，　　常生憂悔心，",
        "translation": "Their virtues are all diminished, and they always give rise to sorrowful thoughts.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　增長諸煩惱，　　是樂睡眠過。",
        "translation": "Increasing afflictions is the fault of delighting in sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　遠離諸善友，　　亦不求正法，",
        "translation": "They are far removed from good friends And do not seek the true teaching.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　常行非法中，　　是樂睡眠過。",
        "translation": "To always practice what's unlawful is the fault of pleasure and sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　不欣求法樂，　　損減諸功德，",
        "translation": "They do not delight in seeking the bliss of the Dharma, Decreasing their virtues.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　遠離於白法，　　是樂睡眠過。",
        "translation": "Being far removed from the white dharma is the fault of delighting in sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　彼人心怯弱，　　恒少於歡喜，",
        "translation": "Their minds are weak-willed, Always lacking joy.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　支分多羸瘦，　　是樂睡眠過。",
        "translation": "Their limbs are often weak and thin, which is the fault of pleasant sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　自知身懈怠，　　嫉妬精進者，",
        "translation": "Knowing for themselves that their bodies are lazy, those who are jealous and diligent",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　樂說其過惡，　　是樂睡眠過。",
        "translation": "Being happy to talk about their faults is the fault of happiness and drowsiness.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　智者了其過，　　常離於睡眠，",
        "translation": "A wise person understands their faults and is always free of sleep.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　愚人增見網，　　無利損功德。",
        "translation": "Foolish people increase the web of views, which doesn't benefit or harm merit.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　智者常精進，　　勤修清淨道，",
        "translation": "The wise one always makes effort, Diligently cultivating the pure path.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　離苦得安樂，　　諸佛所稱歎。",
        "translation": "Being free of suffering and attaining well-being, they're praised by the buddhas.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　世間諸伎藝，　　及出世工巧，",
        "translation": "The worldly arts and crafts, as well as the supramundane crafts.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　皆由精進力，　　智者應修習。",
        "translation": "It's all because of the power of effort, which wise people should cultivate.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　若人趣菩提，　　了知睡眠過，",
        "translation": "If someone goes to enlightenment, Understanding the faults of drowsiness,",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　安住精進力，　　覺悟生慚愧。",
        "translation": "Abiding in the power of effort, they awaken and become ashamed.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　是故諸智者，　　常生精進心，",
        "translation": "Therefore, the wise always give rise to minds of energy.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "　捨離於睡眠，　　守護菩提種。」",
        "translation": "They abandon sleep and guard the seeds of enlightenment.",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "爾時世尊重說偈言：爾時彌勒菩薩而白佛言：「希有世尊！",
        "translation": "It was then that the Bhagavān spoke a verse, saying, At that point, Maitreya Bodhisattva said to the Buddha, Rarely, Bhagavān!",
        "source": "T11n0310_092:0526a03_2"
    },
    {
        "source_sentence": "樂著睡眠乃有如是無量過失。",
        "translation": "Being attached to pleasure and drowsiness has such measureless faults.",
        "source": "T11n0310_092:0526b16_3"
    },
    {
        "source_sentence": "若有聞者，不生憂悔厭離之心、發起精進，當知是人甚大愚癡。",
        "translation": "If someone who hears it and doesn't become sad, disillusioned, and arouses effort, you should know that person is very foolish.",
        "source": "T11n0310_092:0526b17_4"
    },
    {
        "source_sentence": "若有菩薩為欲志求阿耨多羅三藐三菩提者，聞說如是真實句義功德利益，",
        "translation": "“Furthermore, if there is a bodhisattva who wishes to seek unexcelled complete perfect enlightenment, hears and benefits from the true meaning of these words and virtues.",
        "source": "T11n0310_092:0526b19_0"
    },
    {
        "source_sentence": "於諸善法而生懈怠，不起精進住菩提分，無有是處。」",
        "translation": "There's no place for someone who becomes lazy about good qualities and doesn't make effort to abide in the factors of enlightenment.",
        "source": "T11n0310_092:0526b20_1"
    },
    {
        "source_sentence": "爾時彌勒菩薩白佛言：「世尊！",
        "translation": "It was then that Maitreya said to the Buddha, Bhagavān!",
        "source": "T11n0310_092:0526b21_2"
    },
    {
        "source_sentence": "云何名為眾務中過？",
        "translation": "What's called the fault among many duties?",
        "source": "T11n0310_092:0526b22_3"
    },
    {
        "source_sentence": "若觀察時，令諸菩薩不營眾務勤修佛道。」",
        "translation": "If he observes it, he causes the bodhisattvas not to undertake numerous tasks and diligently cultivate the Buddha Way.",
        "source": "T11n0310_092:0526b23_4"
    },
    {
        "source_sentence": "佛言：「彌勒！",
        "translation": "The Buddha said, Maitreya!",
        "source": "T11n0310_092:0526b24_5"
    },
    {
        "source_sentence": "初業菩薩應當觀察樂營眾務二十種過。",
        "translation": "A beginner bodhisattva should observe the 20 kinds of faults that delight in performing various duties.",
        "source": "T11n0310_092:0526b24_6"
    },
    {
        "source_sentence": "若觀察時，能令菩薩不營眾務勤修佛道。",
        "translation": "When they observe them, they can cause bodhisattvas to diligently cultivate the buddha path without undertaking many duties.",
        "source": "T11n0310_092:0526b25_7"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0526b26_8"
    },
    {
        "source_sentence": "云何名為二十種過？",
        "translation": "What are these twenty kinds of faults?",
        "source": "T11n0310_092:0526b26_9"
    },
    {
        "source_sentence": "一者耽著世間下劣之業，二者為諸讀誦修行比丘之所輕賤，三者亦為勤修禪定比丘之所呵責，",
        "translation": "One, they are addicted to worldly and inferior activities. Two, they are despised by the monks who recite and practice it. Three, they are also blamed by the monks who diligently practice meditation.",
        "source": "T11n0310_092:0526b26_10"
    },
    {
        "source_sentence": "四者心常發起無始生死流轉之業，五者虛食居士及婆羅門淨心信施，六者於諸財物心懷取著，",
        "translation": "The fourth is that the mind always produces beginningless, birthless, and transmigrating actions; the fifth is faithfully giving to unworthy householders and brāhmaṇas with pure minds; the sixth is harboring attachment",
        "source": "T11n0310_092:0526b29_11"
    },
    {
        "source_sentence": "七者常樂廣營世間事務，八者念其家業常懷憂歎，九者其性佷戾發言麁獷，",
        "translation": "The seventh is always happy in carrying out worldly affairs. The eighth is always grieved when he thinks of his family’s business.",
        "source": "T11n0310_092:0526c02_12"
    },
    {
        "source_sentence": "十者心常憶念勤修家業，十一者愛著諸味增長貪欲，十二者無利養處不生歡喜，",
        "translation": "The eleventh is to be attached to tastes and increase craving, and the twelfth is not to rejoice in a place where there are no profits.",
        "source": "T11n0310_092:0526c04_13"
    },
    {
        "source_sentence": "十三者多生惱害障礙之業，十四者常樂親近諸優婆塞及優婆夷，十五者但念衣食而度晝夜，",
        "translation": "The thirteenth is that they often give rise to harmful and obstructive actions. The fourteenth is always happy to associate with laymen and laywomen. The fifteenth saves day and night by simply remembering food",
        "source": "T11n0310_092:0526c06_0"
    },
    {
        "source_sentence": "十六者數問世間所作事業，十七者常樂發起非法語言，十八者恃營眾務而起憍慢，",
        "translation": "The sixteenth is to frequently ask questions about worldly occupations. The seventeenth is always delighted with producing unlawful speech. The eighteenth is arrogant and conceited because they rely on public affairs.",
        "source": "T11n0310_092:0526c08_1"
    },
    {
        "source_sentence": "十九者但求人過不自觀察，二十者於說法者心懷輕賤。",
        "translation": "19. They simply beg for faults and don't examine themselves. 20. They despise those who teach the Dharma in their minds.",
        "source": "T11n0310_092:0526c10_2"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0526c11_3"
    },
    {
        "source_sentence": "是為菩薩樂營眾務二十種過。」",
        "translation": "These are the twenty kinds of faults that bodhisattvas delight in undertaking public affairs.",
        "source": "T11n0310_092:0526c11_4"
    },
    {
        "source_sentence": "「安住下劣業，　　遠離殊勝行，",
        "translation": "Abiding in inferior actions, he’s far removed from superior practices.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　退失大利益，　　是名眾務過。",
        "translation": "To regress and lose great benefits is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　樂讀誦比丘，　　及修禪定者，",
        "translation": "The bhikṣus who delight in reciting the sutras And those who practice meditation,",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　一切皆呵責，　　是名眾務過。",
        "translation": "All of them are blamed, which is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　常行生死業，　　捨離解脫因，",
        "translation": "He always does the deeds of birth and death, Rejecting the causes of liberation.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　虛受於信施，　　是名眾務過。",
        "translation": "Falsely accepting faith and giving is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　樂受諸財寶，　　不得生憂惱，",
        "translation": "They are happy to receive wealth and treasures, but can’t give rise to grief or sorrow.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　住於下劣行，　　是名眾務過。",
        "translation": "Abiding in inferior practices is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　是人多愛染，　　往來婬女家，",
        "translation": "That person is often defiled by craving and coming and going in the house of a promiscuous woman.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　如鳥入樊籠，　　是名眾務過。",
        "translation": "Like a bird entering a cage, this is called the fault of the multitude of duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　常憂歎家業，　　恒懷熱惱心，",
        "translation": "They always grieve for their family business, Always harboring anguish in their minds.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　出言人不信，　　是名眾務過。",
        "translation": "To say that people don't believe in it is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　不受尊者教，　　違拒而輕賤，",
        "translation": "Not accepting the teaching of the venerable one, they disobey it and despise it.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　毀犯清淨戒，　　是名眾務過。",
        "translation": "To violate the pure precepts is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　其心多憶想，　　勤營於世業，",
        "translation": "Their minds are full of recollection and thoughts, Diligently engaged in worldly activities.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　不能修智斷，　　是名眾務過。",
        "translation": "To be unable to cultivate wisdom and stop it is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　貪心恒熾盛，　　樂著於諸味，",
        "translation": "Their minds are always full of craving, Always attached to taste and enjoyment.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　曾無知足心，　　是名眾務過。",
        "translation": "Being lacking the mind of knowing contentment in the past is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　得利生歡喜，　　無利便憂惱，",
        "translation": "Attaining benefits, sentient beings rejoice, and grieve when they don’t get benefits.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　貪悋無仁心，　　是名眾務過。",
        "translation": "Being greedy and un benevolent, this is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　惱害無慈愍，　　增長諸惡業，",
        "translation": "harming without kindness and pity, increasing bad actions,",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　愛蔓相纏縛，　　是名眾務過。",
        "translation": "To be tethered by the mark of craving and vines is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　遠離於師長，　　親近惡知識，",
        "translation": "Being far removed from teachers and elders, associating with bad friends,",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　擯斥持戒人，　　是名眾務過。",
        "translation": "To criticize someone who observes the precepts is called a fault of the many.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　晝夜無餘想，　　唯念求衣食，",
        "translation": "Day and night, without any other thoughts, he’s mindful of seeking food and clothing.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　不樂諸功德，　　是名眾務過。",
        "translation": "Not delighting in virtues is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　常問世間智，　　不樂出世言，",
        "translation": "He always asks questions of worldly intelligence and doesn’t delight in transmundane talk.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　耽愛於邪說，　　是名眾務過。",
        "translation": "Attachment to wrong teachings is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　自恃知眾務，　　輕慢諸比丘，",
        "translation": "Relying on their own knowledge of all affairs, they despise the monks.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　猶如狂醉人，　　是名眾務過。",
        "translation": "It's like a mad drunken man, which is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　常伺求他短，　　不自見其過，",
        "translation": "Always seeking others’ faults, They do not see their own faults.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　輕毀有德人，　　是名眾務過。",
        "translation": "To despise virtuous people is called the fault of many duties.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　如是愚癡者，　　無有善方便，",
        "translation": "Such a foolish man has no good skillful means.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　輕慢說法者，　　是名眾務過。",
        "translation": "To despise someone who teaches the Dharma with conceit is called a fault of the many.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　如是下劣業，　　具足諸過失，",
        "translation": "Such inferior actions are replete with faults and errors.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　何有智慧人，　　愛樂而修習？",
        "translation": "How could there be a wise person who loves and enjoys it and cultivates it?",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　清淨殊勝業，　　具足諸功德，",
        "translation": "Their pure and excellent deeds Are replete with virtues.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　是故有智人，　　愛樂常修習。",
        "translation": "Therefore, there are wise people who love pleasure and always cultivate it.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　若樂下劣業，　　智者當呵責，",
        "translation": "If someone enjoys inferior actions, the wise one will rebuke them.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　如人捨多財，　　貪求於少分。",
        "translation": "It's like a person who abandons many possessions and craves a small part.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　是故明智人，　　當捨下劣業，",
        "translation": "Therefore, it's clear that wise people should abandon inferior actions.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "　應求勝上法，　　諸佛常稱歎。」",
        "translation": "You should seek the superior teaching, which the buddhas always praise.",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "爾時世尊重說偈言：爾時彌勒菩薩而白佛言：「希有世尊！",
        "translation": "It was then that the Bhagavān spoke a verse, saying, At that point, Maitreya Bodhisattva said to the Buddha, Rarely, Bhagavān!",
        "source": "T11n0310_092:0526c12_5"
    },
    {
        "source_sentence": "彼諸菩薩捨離殊勝精進之業，而乃發起下劣之事，當知是人甚為少智覺慧微淺。」",
        "translation": "Those bodhisattvas who abandon superior effort and give rise to inferior things, you should know that such people have very little knowledge and are weak in awakening and wisdom.",
        "source": "T11n0310_092:0527a26_6"
    },
    {
        "source_sentence": "佛告彌勒菩薩言：「彌勒！",
        "translation": "The Buddha addressed Maitreya Bodhisattva, saying, Maitreya!",
        "source": "T11n0310_092:0527a28_7"
    },
    {
        "source_sentence": "我今實言告汝，若有菩薩不修諸行、不斷煩惱、不習禪誦、不求多聞，",
        "translation": "“Furthermore, if a bodhisattva refrains from engaging in all kinds of practices, keeps away from all afflictions, engages in neither meditation nor recitation, and does not seek learning,",
        "source": "T11n0310_092:0527a29_8"
    },
    {
        "source_sentence": "我說是人非出家者。",
        "translation": "I say this person isn't a renunciant.",
        "source": "T11n0310_092:0527b02_0"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0527b02_1"
    },
    {
        "source_sentence": "若有勤修智斷行者、智出生者、智成就者、不作世業營眾務者，我說是人住如來教。",
        "translation": "If someone diligently cultivates knowledge and stops practice, produces knowledge, accomplishes knowledge, and doesn't perform worldly activities or undertake numerous duties, I say that person is abiding in the Tathāgata's teaching.",
        "source": "T11n0310_092:0527b02_2"
    },
    {
        "source_sentence": "若有菩薩樂作世業營於眾務、為所不應，我說是人住於生死，是故菩薩不應親近。",
        "translation": "If there are bodhisattvas who happily perform worldly activities, undertake various duties, and do things that shouldn't be done, I say they abide in birth-and-death; therefore, bodhisattvas shouldn't become",
        "source": "T11n0310_092:0527b04_3"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0527b06_4"
    },
    {
        "source_sentence": "若有菩薩多營眾務，造七寶塔遍滿三千大千世界。",
        "translation": "Suppose there's a bodhisattva who often undertakes numerous tasks and creates a stūpa of seven treasures that fills 3,000 great one-thousand worlds.",
        "source": "T11n0310_092:0527b06_5"
    },
    {
        "source_sentence": "如是菩薩不能令我而生歡喜，亦非供養恭敬於我。",
        "translation": "Such a bodhisattva can't make me rejoice and doesn't offer support or respect to me.",
        "source": "T11n0310_092:0527b07_6"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0527b09_0"
    },
    {
        "source_sentence": "若有菩薩於波羅蜜相應之法，乃至受持一四句偈，讀誦修行為人演說，",
        "translation": "Suppose there is a bodhisattva who recites, practices, and teaches the Dharma associated with the transcendent ways, up to one four-line verse.",
        "source": "T11n0310_092:0527b09_1"
    },
    {
        "source_sentence": "是人乃為供養於我。",
        "translation": "That person then makes offerings to me.",
        "source": "T11n0310_092:0527b10_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_092:0527b11_3"
    },
    {
        "source_sentence": "諸佛菩提從多聞生，不從眾務而得生也。",
        "translation": "The buddhas' enlightenment arises from being well-versed, and it doesn't arise from the many tasks.",
        "source": "T11n0310_092:0527b11_4"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0527b12_5"
    },
    {
        "source_sentence": "若有菩薩勤營眾務，令彼讀誦修行演說諸菩薩等營於眾務，當知是人增長業障無諸福利。",
        "translation": "If there are bodhisattvas who diligently undertake numerous tasks and cause them to recite, cultivate, and teach the bodhisattvas to undertake many tasks, you should know that person's growth in karmic hindrances has no benefits.",
        "source": "T11n0310_092:0527b12_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_092:0527b14_7"
    },
    {
        "source_sentence": "如是所說三種福業，一切皆從智慧而生。",
        "translation": "All of these three kinds of meritorious actions explained in this way arise from wisdom.",
        "source": "T11n0310_092:0527b14_8"
    },
    {
        "source_sentence": "是故彌勒！",
        "translation": "Therefore, Maitreya!",
        "source": "T11n0310_092:0527b15_9"
    },
    {
        "source_sentence": "營事菩薩於彼讀誦修行演說諸菩薩所，不應障礙為作留難讀誦修行演說菩薩。",
        "translation": "A bodhisattva who serves the bodhisattvas there and recites, cultivates, and explains it to them shouldn't obstruct the bodhisattva who makes it difficult for him to recite, cultivate, and explain it.",
        "source": "T11n0310_092:0527b16_10"
    },
    {
        "source_sentence": "於修禪定諸菩薩所，不應障礙為作留難。",
        "translation": "At the place where bodhisattvas cultivate meditation, they shouldn't obstruct or make it difficult for them to do so.",
        "source": "T11n0310_092:0527b17_11"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0527b18_12"
    },
    {
        "source_sentence": "若一閻浮提營事菩薩，於一讀誦修行演說菩薩之所，應當親近供養承事。",
        "translation": "If there's a bodhisattva in Jambudvīpa who serves the bodhisattva, and there's a bodhisattva who reads, recites, cultivates, and explains it, they should be intimate, offered support, and",
        "source": "T11n0310_092:0527b19_0"
    },
    {
        "source_sentence": "若一閻浮提讀誦修行演說諸菩薩等，於一勤修禪定菩薩，亦當親近供養承事。",
        "translation": "If there's a bodhisattva in Jambudvīpa who recites, cultivates, and explains the teachings of those bodhisattvas, or if there's a bodhisattva who diligently cultivates meditation, they should also become intimate",
        "source": "T11n0310_092:0527b20_1"
    },
    {
        "source_sentence": "如是善業，如來隨喜、如來悅可。",
        "translation": "Such good actions, the Tathāgata follows them and the Tathāgata pleases them.",
        "source": "T11n0310_092:0527b22_2"
    },
    {
        "source_sentence": "若於勤修智慧菩薩承事供養，當獲無量福德之聚。",
        "translation": "If someone serves and makes offerings to a bodhisattva who diligently cultivates wisdom, they'll attain an immeasurable stock of merit.",
        "source": "T11n0310_092:0527b23_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_092:0527b24_4"
    },
    {
        "source_sentence": "智慧之業無上最勝，超過一切三界所行。",
        "translation": "The karma of wisdom is the highest and most superior, surpassing all the actions of the three realms.",
        "source": "T11n0310_092:0527b24_5"
    },
    {
        "source_sentence": "是故彌勒！",
        "translation": "Therefore, Maitreya!",
        "source": "T11n0310_092:0527b25_6"
    },
    {
        "source_sentence": "若有菩薩發起精進，於智慧中當勤修習。」",
        "translation": "If there are bodhisattvas who initiate effort, they'll diligently cultivate it in their wisdom.",
        "source": "T11n0310_092:0527b25_7"
    },
    {
        "source_sentence": "爾時彌勒菩薩白佛言：「世尊！",
        "translation": "It was then that Maitreya said to the Buddha, Bhagavān!",
        "source": "T11n0310_092:0527b27_0"
    },
    {
        "source_sentence": "如來善說初業菩薩樂於憒閙、世話、睡眠、眾務過失。",
        "translation": "The Tathāgata well explains that bodhisattvas in the first karma are happy with drowsiness, worldly talk, sleep, and the faults of many duties.",
        "source": "T11n0310_092:0527b27_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_092:0527b28_2"
    },
    {
        "source_sentence": "云何名為戲論中過？",
        "translation": "What's called a fallacy in conceptual elaboration?",
        "source": "T11n0310_092:0527b29_0"
    },
    {
        "source_sentence": "若觀察時，菩薩當得住於寂靜無諸諍論。」",
        "translation": "If you observe it, the bodhisattva will be able to abide in quiescence and have no disputes.",
        "source": "T11n0310_092:0527b29_1"
    },
    {
        "source_sentence": "佛言：「彌勒！",
        "translation": "The Buddha said, Maitreya!",
        "source": "T11n0310_092:0527c01_2"
    },
    {
        "source_sentence": "初業菩薩戲論過失無量無邊，我今略說有二十種。",
        "translation": "The faults and errors of the first karma bodhisattva's conceptual elaborations are immeasurable and limitless, and now I'll briefly explain that there are 20 kinds.",
        "source": "T11n0310_092:0527c01_3"
    },
    {
        "source_sentence": "云何名為二十種過？",
        "translation": "What are these twenty kinds of faults?",
        "source": "T11n0310_092:0527c02_4"
    },
    {
        "source_sentence": "一者於現在生多諸苦惱，二者增長瞋恚退失忍辱，三者為諸怨對之所惱害，",
        "translation": "They are (1) the many kinds of suffering and distress that arise in the present; (2) growing anger, hatred, regression, and forbearance; (3) being harmed by enemies.",
        "source": "T11n0310_092:0527c03_5"
    },
    {
        "source_sentence": "四者魔及魔民皆生歡喜，五者未生善根皆悉不生，六者已生善根能令退失，",
        "translation": "The fourth is that Māra and his people will all become joyous. The fifth is that the roots of virtue that have not yet arisen will not arise at all. The sixth is that the roots of virtue that have already arisen",
        "source": "T11n0310_092:0527c05_6"
    },
    {
        "source_sentence": "七者增諸鬪諍怨競之心，八者造作地獄惡趣之業，九者當得醜陋不善之果，",
        "translation": "The seventh increases the mind of fighting and enemies, the eighth creates bad actions in hell, and the ninth will attain ugly and unwholesome results.",
        "source": "T11n0310_092:0527c06_7"
    },
    {
        "source_sentence": "十者舌不柔軟言詞謇澁，十一者所受教法不能憶持，十二者於未聞經聞之不悟，",
        "translation": "The eleventh is not able to remember the doctrine they have been taught, and the twelfth is not enlightened by hearing a scripture they have not heard.",
        "source": "T11n0310_092:0527c08_8"
    },
    {
        "source_sentence": "十三者諸善知識皆悉捨離，十四者諸惡知識速當值遇，十五者修行於道難得出離，",
        "translation": "The thirteenth is to abandon all good friends; the fourth is to quickly meet bad friends; the fifteenth is to cultivate practice on the path without difficulty in getting rid of them.",
        "source": "T11n0310_092:0527c10_9"
    },
    {
        "source_sentence": "十六者不悅意語數數常聞，十七者在在所生多諸疑惑，十八者常生難處不聞正法，",
        "translation": "The sixteenth is always hearing unpleasant words repeatedly. The seventeenth is often doubtful wherever they occur. The eighteenth is always in distress and does not hear the true Dharma.",
        "source": "T11n0310_092:0527c12_10"
    },
    {
        "source_sentence": "十九者修行白法多有障礙，二十者於所受用多諸怨嫉。",
        "translation": "19. There are many obstacles to cultivating the white dharma, and 20. There are many enemies and jealousy about what they experience.",
        "source": "T11n0310_092:0527c14_11"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0527c15_12"
    },
    {
        "source_sentence": "是為菩薩耽著戲論二十種過。」",
        "translation": "These are the twenty kinds of faults that bodhisattvas cling to conceptual elaborations.",
        "source": "T11n0310_092:0527c15_13"
    },
    {
        "source_sentence": "「現生常苦惱，　　離忍多瞋恚，",
        "translation": "Their present birth is always painful and distressing, Being free of patience and full of anger.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　怨讎生害心，　　是名戲論過。",
        "translation": "Enmity and hatred give rise to harmful thoughts, which are called the fault of conceptual elaboration.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　魔及魔眷屬，　　皆生歡喜心，",
        "translation": "All the Māras and their retinues Awakened in joy.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　喪失諸善法，　　是名戲論過。",
        "translation": "Losing good qualities is called a mistake of conceptual elaboration.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　未生善不生，　　常住於鬪諍，",
        "translation": "Goodness that has yet to arise and goodness that doesn’t arise, They always remain in strife.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　造於惡趣業，　　是名戲論過。",
        "translation": "Making karma in bad destinies is called a mistake of conceptual elaboration.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　身體多醜陋，　　生於下劣家，",
        "translation": "Their bodies are mostly ugly, born in a humble home.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　發言常謇澁，　　是名戲論過。",
        "translation": "To speak words that are always angry is called a fallacy of conceptual elaboration.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　聞法不能持，　　或聞不入耳，",
        "translation": "If someone hears the teaching but can’t retain it, Or if they hear it but don’t enter it,",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　常離諸善友，　　是名戲論過。",
        "translation": "Being always free of good friends is called a fault of conceptual elaboration.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　值遇惡知識，　　於道難出離，",
        "translation": "When you meet a bad friend, it’s hard to leave the path.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　常聞不順語，　　是名戲論過。",
        "translation": "Always hearing words that are not agreeable is called a fault of conceptual elaboration.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　隨彼所生處，　　常懷疑惑心，",
        "translation": "Wherever they are born, They always harbor doubt and confusion.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　於法不能了，　　是名戲論過。",
        "translation": "Being unable to understand the teaching is called a fallacy of conceptual elaboration.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　常生八難中，　　遠離無難處，",
        "translation": "They are always born in the midst of the eight difficulties, Being far removed from the sphere of no difficulty.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　具足無利益，　　是名戲論過。",
        "translation": "Being complete and not beneficial is called a mistake of conceptual elaboration.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　於善多障礙，　　退失正思惟，",
        "translation": "They are often hindered by goodness, regressing from right contemplation,",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　所受多怨嫉，　　是名戲論過。",
        "translation": "To experience much resentment is called a fallacy of conceptual elaboration.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　如是諸過失，　　皆因戲論生，",
        "translation": "Such faults and errors all arise because of conceptual elaborations.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　是故有智人，　　速疾當遠離。",
        "translation": "That's why there are wise people who will quickly part with it.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　如是戲論者，　　難證大菩提，",
        "translation": "Those who engage in such conceptual elaborations will hardly attain great enlightenment.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　是故有智人，　　亦應不親近。",
        "translation": "Therefore, a wise person shouldn't get close to them either.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　戲論諍論處，　　多起諸煩惱，",
        "translation": "Where there are arguments and disputes, many afflictions arise.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　智者應遠離，　　當去百由旬。",
        "translation": "The wise one should be far away, One hundred yojanas from them.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　亦不近於彼，　　造立諸舍宅，",
        "translation": "Nor does he go near them, building dwellings or houses.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　是故出家人，　　不應住諍論。",
        "translation": "Therefore, renunciants shouldn't abide in arguments.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　汝等無田宅，　　妻子及僮僕，",
        "translation": "You don’t have land, homes, wives, children, or servants.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　乃至榮位等，　　何緣興諍論？",
        "translation": "Up to the level of prosperity and so forth, what is the reason we give rise to this argument?",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　出家住寂靜，　　身被於法服，",
        "translation": "Having renounced the householder’s life and remained in seclusion, His body was covered with religious robes.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　諸仙咸敬事，　　當修忍辱心。",
        "translation": "The ṛṣi should cultivate the mind of forbearance in respect and service.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　如是戲論者，　　增長毒害心，",
        "translation": "Someone who engages in this kind of conceptual elaboration Increases poisonous thoughts.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　當墮於惡趣，　　是故應修忍。",
        "translation": "You will fall into a bad destiny; Therefore you should cultivate patience.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　囚禁及繫縛，　　刑害而捶楚，",
        "translation": "They are imprisoned, bound, tortured, and beaten.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　如是等諸苦，　　皆由諍論生。",
        "translation": "Such sufferings as these All arise from argument.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　如是戲論者，　　常遇惡知識，",
        "translation": "Those who engage in such conceptual elaborations always meet bad friends.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　名稱不增長，　　曾無歡喜心。",
        "translation": "Their fame doesn't grow, and there's never been a joyous mind.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　若捨於諍論，　　無能伺其便，",
        "translation": "If you give up arguments, No one will be able to find an advantage over you.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　眷屬不乖離，　　當遇於善友。",
        "translation": "Their retinues aren't divergent, and they'll meet a good friend.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　於乘得清淨，　　業障盡無餘，",
        "translation": "They attain purity in the vehicle, Extinguishing all karmic hindrances without remainder.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　摧伏於魔軍，　　勤修忍辱行。",
        "translation": "Destroying the armies of Māra, they diligently cultivate patience and humility.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　諍論多諸過，　　無諍具功德，",
        "translation": "There are many faults in argument, and there’s no virtue in contentiousness.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "　若有修行者，　　當住於忍辱。」",
        "translation": "If someone cultivates it, they'll abide in forbearance.",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "爾時世尊重說偈言：爾時彌勒菩薩復白佛言：「希有世尊！",
        "translation": "It was then that the Bhagavān spoke a verse, saying, At that point, Maitreya again said to the Buddha, Rarely, Bhagavān!",
        "source": "T11n0310_092:0527c16_14"
    },
    {
        "source_sentence": "乃能善說如是過失，令諸菩薩生覺悟心。",
        "translation": "He's able to skillfully explain such faults and causes bodhisattvas to give rise to the mind of awakening.",
        "source": "T11n0310_092:0528b01_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_092:0528b02_16"
    },
    {
        "source_sentence": "於後末世五百歲中，頗有菩薩聞說如是諍論過失，能生憂悔離煩惱不？」",
        "translation": "In the next 500 years, will there be bodhisattvas who hear such arguments and faults in later generations and become free of afflictions if they give rise to grief and regret?",
        "source": "T11n0310_092:0528b02_17"
    },
    {
        "source_sentence": "佛告彌勒菩薩言：「彌勒！",
        "translation": "The Buddha addressed Maitreya Bodhisattva, saying, Maitreya!",
        "source": "T11n0310_092:0528b04_18"
    },
    {
        "source_sentence": "於後末世五百歲中，少有菩薩能生憂悔捨離煩惱。",
        "translation": "In the next five hundred years in the latter world, few bodhisattvas will be able to give rise to grief and repentance and abandon afflictions.",
        "source": "T11n0310_092:0528b05_19"
    },
    {
        "source_sentence": "多有菩薩其心剛強不相尊敬，懷增上慢互相是非。",
        "translation": "Many bodhisattvas have a rigid mind that doesn't respect each other and harbor excessive conceit about what's right and wrong.",
        "source": "T11n0310_092:0528b06_20"
    },
    {
        "source_sentence": "聞說如是甚深義趣殊勝功德，雖復受持讀誦演說，由是菩薩業障深重，",
        "translation": "Hearing and teaching such profound meanings lead to extraordinary virtue, even though they retain, recite, and expound them, which is why the bodhisattva’s karmic hindrances are so deep.",
        "source": "T11n0310_092:0528b07_21"
    },
    {
        "source_sentence": "不能得生殊勝功德，便於是經疑惑不信，不復受持為人演說。",
        "translation": "They can't produce extraordinary merit, so they doubt the sūtras and don't believe them, and they no longer accept or uphold them and explain them for others.",
        "source": "T11n0310_092:0528b09_22"
    },
    {
        "source_sentence": "時魔波旬見是事已，為誑惑故作比丘像，來到其所說如是言：『此諸經典皆是世俗善文詞者之所製造，",
        "translation": "When Māra the Evil One saw this, he made a monk’s image out of anguish and confusion. He came to them and said:",
        "source": "T11n0310_092:0528b10_23"
    },
    {
        "source_sentence": "非是如來之所宣說。",
        "translation": "It's not what the Tathāgata teaches.",
        "source": "T11n0310_092:0528b13_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_092:0528b13_1"
    },
    {
        "source_sentence": "此經所說功德利益汝皆不得。』",
        "translation": "You won't attain the merits and benefits of what this sūtra teaches.'",
        "source": "T11n0310_092:0528b13_2"
    },
    {
        "source_sentence": "由魔波旬如是誑惑，於此空性義利相應甚深契經，心生疑惑起諸諍論，",
        "translation": "As a result of Māra Pāpīyān's such debilitating mental disturbances, this profound scripture associated with the meaning and benefit of emptiness arouses doubt in his mind and gives rise to arguments.",
        "source": "T11n0310_092:0528b14_3"
    },
    {
        "source_sentence": "不復受持讀誦演說。",
        "translation": "He no longer receives, retains, recites, and explains it.",
        "source": "T11n0310_092:0528b16_0"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0528b16_1"
    },
    {
        "source_sentence": "彼諸愚人不能了知，由自業故不能護彼殊勝功德，自業消已決定當得如是功德。」",
        "translation": "Those foolish people can't understand it, and because of their own actions, they can't protect their extraordinary qualities; after the cessation of their own actions, they'll surely attain such qualities.",
        "source": "T11n0310_092:0528b16_2"
    },
    {
        "source_sentence": "爾時彌勒菩薩白佛言：「世尊！",
        "translation": "It was then that Maitreya said to the Buddha, Bhagavān!",
        "source": "T11n0310_092:0528b18_3"
    },
    {
        "source_sentence": "如佛所說，阿彌陀佛極樂世界功德利益。",
        "translation": "As the Buddha teaches, Amitâbha is the ultimate blissful world of merit and benefit.",
        "source": "T11n0310_092:0528b19_4"
    },
    {
        "source_sentence": "若有眾生發十種心，隨一一心專念向於阿彌陀佛，是人命終當得往生彼佛世界。",
        "translation": "If there are sentient beings who give rise to ten kinds of mind and focus their attention on Amitâbha Buddha with each mental state, they'll be reborn in that buddha-world at the end of their life.",
        "source": "T11n0310_092:0528b20_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_092:0528b22_6"
    },
    {
        "source_sentence": "何等名為發十種心？",
        "translation": "What are the ten kinds of mind that arise?",
        "source": "T11n0310_092:0528b22_7"
    },
    {
        "source_sentence": "由是心故，當得往生彼佛世界。」",
        "translation": "Because of this mind, they'll be reborn in that buddha world.",
        "source": "T11n0310_092:0528b22_8"
    },
    {
        "source_sentence": "佛告彌勒菩薩言：「彌勒！",
        "translation": "The Buddha addressed Maitreya Bodhisattva, saying, Maitreya!",
        "source": "T11n0310_092:0528b23_9"
    },
    {
        "source_sentence": "如是十心，非諸凡愚不善丈夫具煩惱者之所能發。",
        "translation": "Such ten states of mind can't be produced by ordinary, foolish, or unwholesome men with afflictions.",
        "source": "T11n0310_092:0528b24_0"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T11n0310_092:0528b25_1"
    },
    {
        "source_sentence": "一者於諸眾生起於大慈無損害心，二者於諸眾生起於大悲無逼惱心，三者於佛正法不惜身命樂守護心，",
        "translation": "They are (1) great kindness toward sentient beings without harming them, (2) great compassion toward sentient beings without oppressing them, and (3) protection of their bodies, lives, and happiness from the Buddha’s right teaching.",
        "source": "T11n0310_092:0528b25_2"
    },
    {
        "source_sentence": "四者於一切法發生勝忍無執著心，五者不貪利養恭敬尊重淨意樂心，六者求佛種智於一切時無忘失心，",
        "translation": "The fourth is to develop superior tolerance toward all things and not cling to them; the fifth is to have no desire for profit, honor, respect, or pure intentions; and the sixth is to seek the buddha-nature of knowledge without forget",
        "source": "T11n0310_092:0528b27_3"
    },
    {
        "source_sentence": "七者於諸眾生尊重恭敬無下劣心，八者不著世論於菩提分生決定心，九者種諸善根無有雜染清淨之心，",
        "translation": "The seventh is a mind that honors and respects sentient beings without inferiority; the eighth is a mind not attached to worldly theories but with certainty about the factors of enlightenment; the ninth is a mind planting roots of",
        "source": "T11n0310_092:0528c01_4"
    },
    {
        "source_sentence": "十者於諸如來捨離諸相起隨念心。",
        "translation": "Tenth, he gives rise to a mind that follows the Tathāgata's mindfulness of abandoning characteristics.",
        "source": "T11n0310_092:0528c03_5"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0528c04_6"
    },
    {
        "source_sentence": "是名菩薩發十種心。",
        "translation": "These are the ten kinds of mind that a bodhisattva gives rise to.",
        "source": "T11n0310_092:0528c04_7"
    },
    {
        "source_sentence": "由是心故，當得往生阿彌陀佛極樂世界。",
        "translation": "Because of this mind, they'll be reborn in the paradise world of Amitâbha Buddha.",
        "source": "T11n0310_092:0528c05_8"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T11n0310_092:0528c06_9"
    },
    {
        "source_sentence": "若人於此十種心中隨成一心，樂欲往生彼佛世界，若不得生無有是處。」",
        "translation": "If someone follows these ten kinds of mental states and forms a single mind with one desire to be reborn in the Buddha's world, there's no place for them to be born if they can't.",
        "source": "T11n0310_092:0528c06_10"
    },
    {
        "source_sentence": "爾時尊者阿難白佛言：「希有世尊！",
        "translation": "It was then that Venerable Ānanda said to the Buddha, Rarely, Bhagavān!",
        "source": "T11n0310_092:0528c07_11"
    },
    {
        "source_sentence": "乃能開示演說如來真實功德，發起菩薩殊勝志樂。",
        "translation": "They are able to reveal and explain the true merits of the Tathāgata and give rise to the bodhisattva's extraordinary aspiration.",
        "source": "T11n0310_092:0528c08_12"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0310_092:0528c09_13"
    },
    {
        "source_sentence": "當何名此經！",
        "translation": "What should this sūtra be called?",
        "source": "T11n0310_092:0528c10_14"
    },
    {
        "source_sentence": "我等云何受持！」",
        "translation": "How can we accept and uphold it!",
        "source": "T11n0310_092:0528c10_15"
    },
    {
        "source_sentence": "佛告阿難言：「此經名為『發起菩薩殊勝志樂』，亦名『彌勒菩薩所問』，",
        "translation": "The Buddha told Ānanda, This sūtra is called 'arouses the bodhisattva's superior aspiration' and is also called 'questioned by Maitreya Bodhisattva.'",
        "source": "T11n0310_092:0528c10_16"
    },
    {
        "source_sentence": "以是名字汝當受持。」",
        "translation": "By this name, you will receive and uphold it.",
        "source": "T11n0310_092:0528c12_17"
    },
    {
        "source_sentence": "佛說此經已，彌勒菩薩及諸聲聞，一切世間天、人、阿修羅、乾闥婆等，",
        "translation": "After the Buddha had taught this sutra, Maitreya, bodhisattvas and śrāvakas, all the gods, humans, asuras, gandharvas, and so forth of the world",
        "source": "T11n0310_092:0528c12_18"
    },
    {
        "source_sentence": "聞佛所說，皆大歡喜，信受奉行。",
        "translation": "Having heard the Buddha’s exhortation, they all rejoiced greatly and accepted it with faith.",
        "source": "T11n0310_092:0528c14_19"
    },
    {
        "source_sentence": "大寶積經卷第九十二",
        "translation": "*Mahāmegha-sūtra, vol. 95",
        "source": "T11n0310_092:0528c15_0"
    }
]