[
    {
        "source_sentence": "佛說大乘菩薩藏正法經卷第二",
        "translation": "Foshuo daishi pusa zhengfa jing, vol. 2",
        "source": "T11n0316_027:0849b20_0"
    },
    {
        "source_sentence": "十七",
        "translation": "17.",
        "source": "T11n0316_027:0849b21_0"
    },
    {
        "source_sentence": "西天譯經三藏銀青光祿大夫",
        "translation": "translated scriptures of the Western Heavens, Tripiṭaka Master銀青光祿大夫",
        "source": "T11n0316_027:0849b23_0"
    },
    {
        "source_sentence": "試光祿卿慈覺傳梵大師賜紫",
        "translation": "試光祿卿慈覺傳梵大師賜紫",
        "source": "T11n0316_027:0849b24_0"
    },
    {
        "source_sentence": "沙門臣法護等奉　詔譯",
        "translation": "translated by imperial edict by the ascetic ministers Dharmagupta and others",
        "source": "T11n0316_027:0849b25_0"
    },
    {
        "source_sentence": "精進波羅蜜多品第九之三",
        "translation": "ninth and third parts of the chapter on the perfection of effort",
        "source": "T11n0316_027:0849b26_0"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0849b27_0"
    },
    {
        "source_sentence": "「『諸有貪者於欲樂，　　一切境界無出離，",
        "translation": "'Those with craving have desires and pleasures, but there's no escape from all objects.",
        "source": "T11n0316_027:0849b27_1"
    },
    {
        "source_sentence": "　　由愚癡故非正理，　　當墮地獄惡趣中。",
        "translation": "Because it's not the correct principle because of foolishness, they'll fall into the bad destinies of hell.",
        "source": "T11n0316_027:0849b27_1"
    },
    {
        "source_sentence": "　　若於正道求出家，　　應捨受用諸欲境，",
        "translation": "If someone seeks to leave home in the right path, they should abandon the objects of desire and enjoyment.",
        "source": "T11n0316_027:0849b27_1"
    },
    {
        "source_sentence": "　　彼能開示諸正理，　　是名世間相應者。』",
        "translation": "Those who can reveal the correct principles are called those associated with the world.'",
        "source": "T11n0316_027:0849b27_1"
    },
    {
        "source_sentence": "時諸天眾對彼童子，復說伽陀曰：「舍利子！",
        "translation": "The gods then addressed the boy and again said to Gadha, Śāriputra!",
        "source": "T11n0316_027:0849b27_1"
    },
    {
        "source_sentence": "「『我今為汝天眾說，　　汝於正道未能知，",
        "translation": "'Now, I'll explain it for you gods, but you won't know the right path.",
        "source": "T11n0316_027:0849c04_2"
    },
    {
        "source_sentence": "　　如是相應真正理，　　當說令汝悉解了。』",
        "translation": "Such is the true principle associated with it, which will be explained so that you'll understand it completely.'",
        "source": "T11n0316_027:0849c04_2"
    },
    {
        "source_sentence": "時彼童子對諸天眾，復說伽陀曰：「爾時童子說是偈已，與諸大眾俱時往詣毘婆尸如來所。",
        "translation": "The boy then addressed the gods again, saying, After he spoke these verses, the boy and the assembled crowd went to the Tathāgata Vipaśyin at the same time.",
        "source": "T11n0316_027:0849c04_2"
    },
    {
        "source_sentence": "到已頭面禮足，右遶三匝却住一面，瞻仰毘婆尸如來目不暫捨。",
        "translation": "When he arrived, he bowed his head and feet, circumambulated him three times to his right, withdrew to one side, and gazed up at the Tathāgata Vipaśyin without momentarily glancing away.",
        "source": "T11n0316_027:0849c08_3"
    },
    {
        "source_sentence": "「『具足三明施甘露，　　能為世間作善利，",
        "translation": "'It's replete with the three kinds of ambrosia of giving, which can create good benefits for the world.",
        "source": "T11n0316_027:0849c09_4"
    },
    {
        "source_sentence": "　　稽首龍象師子王，　　是故我今常讚禮。",
        "translation": "I bow my head in homage to the king of dragons, elephants, and lions; For this reason I now always praise him.",
        "source": "T11n0316_027:0849c09_4"
    },
    {
        "source_sentence": "　　佛智光明甚希有，　　猶如日月照世間，",
        "translation": "The Buddha’s light of knowledge is most rare, Like the sun and moon shining in the world.",
        "source": "T11n0316_027:0849c09_4"
    },
    {
        "source_sentence": "　　亦如優曇花出現，　　堅固安住妙色相。",
        "translation": "It's also like the appearance of the udumbara flower, which is firmly abiding with marvelous form and characteristics.",
        "source": "T11n0316_027:0849c09_4"
    },
    {
        "source_sentence": "　　世間有情多重障，　　於佛聖道不能知，",
        "translation": "Sentient beings in the world are often hindered, Unable to know the Buddha’s noble path.",
        "source": "T11n0316_027:0849c09_4"
    },
    {
        "source_sentence": "　　猶若生盲愚癡人，　　不覺墮於險惡道。",
        "translation": "It's like being born to a blind and deluded person who doesn't realize that they're falling into a dangerous and bad path.",
        "source": "T11n0316_027:0849c09_4"
    },
    {
        "source_sentence": "　　願我當來成正覺，　　猶如毘婆尸世尊，",
        "translation": "May I attain perfect enlightenment in the future, Just like the World-Honored Vipaśyin.",
        "source": "T11n0316_027:0849c09_4"
    },
    {
        "source_sentence": "　　令諸有情離眾苦，　　滅三毒火得清涼。",
        "translation": "Causing sentient beings to part with all suffering, they extinguish the three poisonous fires and attain clarity and coolness.",
        "source": "T11n0316_027:0849c09_4"
    },
    {
        "source_sentence": "　　又令無量諸有情，　　隨我廣發如是願，",
        "translation": "Also, cause measureless sentient beings To follow me and give rise to this kind of vow.",
        "source": "T11n0316_027:0849c09_4"
    },
    {
        "source_sentence": "　　聞佛演說最上乘，　　悉得開示菩提道。』",
        "translation": "Hearing the Buddha teach the supreme vehicle, they'll all be able to reveal the path of enlightenment.'",
        "source": "T11n0316_027:0849c09_4"
    },
    {
        "source_sentence": "是時童子心大歡喜，說伽陀曰：「爾時童子說是偈已，又作是言：『南無毘婆尸如來、應、正等覺，",
        "translation": "The boy was greatly delighted and said to the gods: Having uttered this verse, the boy composed the following verse: Homage to the Tathāgata Vipaśyin, Arhat, Perfectly Enlightened One.",
        "source": "T11n0316_027:0849c09_4"
    },
    {
        "source_sentence": "善說法要。』",
        "translation": "He well explains the essentials of the Dharma.'",
        "source": "T11n0316_027:0849c22_5"
    },
    {
        "source_sentence": "時八萬四千俱胝人眾亦作是言：『南無毘婆尸如來、應、正等覺，善說法要。』",
        "translation": "Eighty-four thousand koṭīs of people then also said, 'Suppose the Tathāgata, Arhat, and Completely Awakened One were to skillfully explain the essentials of the Dharma.'",
        "source": "T11n0316_027:0849c22_6"
    },
    {
        "source_sentence": "如是三歎終而復始。",
        "translation": "Thus, these three kinds of praise end and continue to begin again.",
        "source": "T11n0316_027:0849c24_7"
    },
    {
        "source_sentence": "『願我當來皆得成就正等正覺，如毘婆尸如來善說法要。』",
        "translation": "'May I attain the accomplishment of perfect enlightenment in the future, just like the Tathāgata Vipaśyin who well explains the essentials of the Dharma.'",
        "source": "T11n0316_027:0849c24_8"
    },
    {
        "source_sentence": "爾時毘婆尸如來知彼童子及八萬四千俱胝人眾堪任授記，即現神變，於其面門放大光明名決定勝，",
        "translation": "Knowing that the boy and the crowd of eighty-four thousand Licchavi citizens were qualified to receive the prediction, the Tathāgata Vaiśravaṇa manifested miraculous signs and emitted a ray of light from his face called “determined victory.”",
        "source": "T11n0316_027:0849c26_0"
    },
    {
        "source_sentence": "其光復有無量種種色相，所謂青、黃、赤、白、紅、頗胝迦、金色等。",
        "translation": "The light also has measureless and various forms, which are called blue, yellow, red, white, red, mahogany, golden, and so forth.",
        "source": "T11n0316_027:0849c28_1"
    },
    {
        "source_sentence": "如是色相普遍無量世界，洞然照耀，上徹梵世至色邊際，日月光明悉皆映蔽。",
        "translation": "Such form and characteristics pervade measureless worlds, engulfed and shining, penetrating the Brahma world up to the limits of form, all reflected by the light of the sun and moon.",
        "source": "T11n0316_027:0849c29_2"
    },
    {
        "source_sentence": "其光復來至佛頂上，右旋宛轉遶百千匝，忽然不現。",
        "translation": "Again, that light came up to the top of the Buddha's head, circled him to his right a hundred thousand times, and suddenly disappeared.",
        "source": "T11n0316_027:0850a02_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_027:0850a03_4"
    },
    {
        "source_sentence": "時毘婆尸如來有一親侍苾芻，見佛神變光明事已，即從坐起整衣服，偏袒右肩右膝著地，",
        "translation": "Vipaśyin Tathāgata then had a relative who was attending the monk. Seeing the Buddha’s miraculous manifestation of his light, Vipaśyin rose from his seat, adjusted his clothes, bared his right shoulder, knelt on his right knee,",
        "source": "T11n0316_027:0850a03_5"
    },
    {
        "source_sentence": "「『毘婆尸佛大希有，　　於諸聖中量尊聖，",
        "translation": "'The Vaiśravaṇa Buddha is greatly rare. Among the sages, He's the most venerable among all the saints.",
        "source": "T11n0316_027:0850a05_6"
    },
    {
        "source_sentence": "　　我今啟問善逝尊，　　何因緣故現光明？』",
        "translation": "Now, I'll ask the venerable Sunetra, What are the causes and conditions that give rise to this light?'",
        "source": "T11n0316_027:0850a05_6"
    },
    {
        "source_sentence": "合掌向佛瞻仰尊顏，以偈問曰：「爾時苾芻復白佛言：『世尊！",
        "translation": "He joined his palms to the Buddha and looked up at his venerable countenance, asked in verse, At that point, the monk again said to the Buddha, 'Bhagavān!",
        "source": "T11n0316_027:0850a05_6"
    },
    {
        "source_sentence": "以何因緣現大神變放是光明？",
        "translation": "What are the causes and conditions for manifesting this great miraculous transformation that produces this light?",
        "source": "T11n0316_027:0850a09_7"
    },
    {
        "source_sentence": "唯願如來大慈哀慜，為我除疑敷演斯事。",
        "translation": "May the Tathāgata, with great compassion and pity, remove my doubts and explain these matters for me.",
        "source": "T11n0316_027:0850a10_8"
    },
    {
        "source_sentence": "復有無量百千人眾，現住佛前願樂欲聞，我等志心慇懃諦聽，為諸有情慈悲開示。",
        "translation": "There are also immeasurable hundreds of thousands of others who are now standing before the Buddha, wishing to hear it. We listen attentively and earnestly, with minds intent on showing sentient beings kindness and compassion.",
        "source": "T11n0316_027:0850a11_9"
    },
    {
        "source_sentence": "如來大悲為世間眼，救護一切如諸舍宅覆廕一切。",
        "translation": "The Tathāgata's great compassion is the worldly eye, which saves and protects all people like a house that covers everything.",
        "source": "T11n0316_027:0850a13_10"
    },
    {
        "source_sentence": "唯願如來大慈憐慜，斷除疑網。",
        "translation": "May the Tathāgata be greatly compassionate and remove the web of doubt!",
        "source": "T11n0316_027:0850a14_11"
    },
    {
        "source_sentence": "而諸有情過去未來現在所行想念一切行業及諸疑惑，如來於彼無不了知。",
        "translation": "The Tathāgata doesn't know all the actions and doubts of sentient beings in past, future, and present actions or thoughts, but he doesn't know them.",
        "source": "T11n0316_027:0850a15_12"
    },
    {
        "source_sentence": "又諸佛剎所有有情，於三世中一切智慧言語差別，如來於彼無不通達。",
        "translation": "Furthermore, all sentient beings in the buddha-lands have all the distinctions in wisdom and speech in the three times, and the Tathāgata comprehends them without fail.",
        "source": "T11n0316_027:0850a16_13"
    },
    {
        "source_sentence": "如來為諸法王，具足八種言音，於說法中皆得自在。",
        "translation": "The Tathāgata is the king of all dharmas, fully endowed with eight kinds of speech and sounds, and he attains mastery in teaching the Dharma.",
        "source": "T11n0316_027:0850a18_14"
    },
    {
        "source_sentence": "以何因緣現大神通放是光明？",
        "translation": "What are the causes and conditions for manifesting great supernormal powers that emit this light?",
        "source": "T11n0316_027:0850a19_15"
    },
    {
        "source_sentence": "唯願如來，斷除我等一切疑網及一切憂悲苦惱悉皆斷滅。",
        "translation": "May the Tathāgata remove all our webs of doubt and all our grief, sorrow, pain, and vexation!",
        "source": "T11n0316_027:0850a20_16"
    },
    {
        "source_sentence": "我等今者如是三請，一心專注合掌恭敬，願樂欲聞。』",
        "translation": "Now, we've thus three requests, concentrated our minds and joined our palms in respect, wishing to hear them.'",
        "source": "T11n0316_027:0850a21_17"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_027:0850a22_18"
    },
    {
        "source_sentence": "時毘婆尸如來語彼親侍苾芻言：『汝見此童子於我前住合掌立不？』",
        "translation": "The Vaiśravaṇa Tathāgata then said to his attendant monk, 'Do you see this boy standing with joined palms in front of me?'",
        "source": "T11n0316_027:0850a23_0"
    },
    {
        "source_sentence": "『唯然善逝！",
        "translation": "'Yes, Sugata!",
        "source": "T11n0316_027:0850a24_1"
    },
    {
        "source_sentence": "我今已見。』",
        "translation": "Now, I've seen it.'",
        "source": "T11n0316_027:0850a24_2"
    },
    {
        "source_sentence": "佛言：『苾芻！",
        "translation": "The Buddha said, 'Monks!",
        "source": "T11n0316_027:0850a25_0"
    },
    {
        "source_sentence": "今此童子，於往昔時已曾親近稱讚恭敬禮拜，復以衣服臥具種種湯藥供養八萬四千俱胝那由他佛，",
        "translation": "In the past this youth had been intimate with, praised, respected, and venerated these buddhas. He also offered clothing, bedding, various medicines, and bathing water to eighty-four thousand koṭis of myriads of nayutas of buddhas.",
        "source": "T11n0316_027:0850a25_1"
    },
    {
        "source_sentence": "種諸善根，為求成就正等菩提常修梵行。』",
        "translation": "He plants good roots in order to achieve perfect perfect enlightenment and always cultivates the religious practice.'",
        "source": "T11n0316_027:0850a27_2"
    },
    {
        "source_sentence": "佛言：『苾芻！",
        "translation": "The Buddha said, 'Monks!",
        "source": "T11n0316_027:0850a28_3"
    },
    {
        "source_sentence": "汝又見是八萬四千俱胝人眾於我前住合掌立不？』",
        "translation": "Do you see these 84,000 corpuscles standing in front of me with joined palms?'",
        "source": "T11n0316_027:0850a28_4"
    },
    {
        "source_sentence": "『唯然善逝！",
        "translation": "'Yes, Sugata!",
        "source": "T11n0316_027:0850a29_5"
    },
    {
        "source_sentence": "我今已見。』",
        "translation": "Now, I've seen it.'",
        "source": "T11n0316_027:0850b01_6"
    },
    {
        "source_sentence": "佛言：『彼諸人眾於過去世，皆悉曾為童子父母，生生無不從之教化，",
        "translation": "The Buddha said: In all those worlds in the past they were parents of their children, and there was no one who did not give them instruction.",
        "source": "T11n0316_027:0850b01_7"
    },
    {
        "source_sentence": "發心於後後世，願皆不受女人之身，皆能隨順修習，同發阿耨多羅三藐三菩提心。",
        "translation": "They give rise to the intention that in subsequent generations, they'll all wish to not accept a woman's body, and they'll be able to follow and cultivate it, and they'll all give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_027:0850b02_8"
    },
    {
        "source_sentence": "我今為彼授作佛記，以是因緣現大神通放是光明。』",
        "translation": "Now, I'll give them the assurance of becoming a buddha for their sake, and because of these causes and conditions, I'll show great supernormal powers and radiate this light.'",
        "source": "T11n0316_027:0850b04_9"
    },
    {
        "source_sentence": "「『汝見現前諸大眾，　　隨於童子悉來集，",
        "translation": "'Do you see the masses that are now present, gathered together with the children?",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　八萬四千俱胝數，　　一心專注聽我說，",
        "translation": "They are counted among the eighty-four thousand corpuscles, And listen with concentration to my exhortation.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　佛說法中得自在，　　我今親語汝苾芻。",
        "translation": "The Buddha has attained mastery over the teaching of the Dharma, so now I'll speak directly to you monks.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　我知童子多劫中，　　親近供養於諸佛，",
        "translation": "I know that for many eons my children Have become intimate with and honored the buddhas.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　復於無量諸佛所，　　志心堅固求出家，",
        "translation": "In the presence of innumerable buddhas, They are firmly determined to leave home.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　修持最上清淨行，　　復能利樂天人眾。",
        "translation": "Cultivating the highest pure practice, they can also benefit gods and humans.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　又此現前諸大眾，　　八萬四千俱胝數，",
        "translation": "Furthermore, these are the eighty-four thousand koṭis of buddhas that appear before the great assembly.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　生生昔曾為父母，　　教化歡喜常無間。",
        "translation": "Birth and birth were once parents in the past, Teaching and transforming joy without interruption.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　復於往昔無數劫，　　廣發無邊諸大願，",
        "translation": "For countless eons in the past They have also made boundless vows,",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　世世悉皆為父母，　　同求無上大菩提。",
        "translation": "They are all parents from generation to generation, Seeking the same unexcelled great enlightenment.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　如是安住離生死，　　應當隨我共修學，",
        "translation": "Abiding in such peace, free of birth and death, You should follow me and study together.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　志求無上妙菩提。　　我今為彼親授記，",
        "translation": "Having set out for supreme perfect enlightenment, I now give them my prediction.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　彼等決定成正覺，　　是故我現大神通。",
        "translation": "Because they are certain to attain perfect enlightenment, I manifest great supernormal powers.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　我能盡令汝心中，　　行住坐臥無疑惑，",
        "translation": "I can cause you all to think, Walking, standing, sitting, and lying down without doubt.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　汝等天龍及人眾，　　那由他數在我前，",
        "translation": "All of you devas, nāgas, humans, and bodhisattvas— Countless numbers of them are before me.",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "　　同聞為彼親授記，　　不久當成二足尊。』",
        "translation": "They've all heard that they'll soon become two-legged honored ones for their own sake and give them a prediction.'",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "爾時毘婆尸如來為彼親侍苾芻及諸人等說伽陀曰：「舍利子！",
        "translation": "It was then that the Vaiśravaṇa Tathāgata spoke to those relatives, monks, and others, saying, Sāriputta!",
        "source": "T11n0316_027:0850b06_0"
    },
    {
        "source_sentence": "「『如是八萬四千眾，　　往昔皆為我父母，",
        "translation": "'Such 84,000 people were all my parents in the past,",
        "source": "T11n0316_027:0850b24_1"
    },
    {
        "source_sentence": "　　俱時同發菩提心，　　今日父母復如何？』",
        "translation": "They all aroused the mind of enlightenment together at the same time, and what happened to their parents today?'",
        "source": "T11n0316_027:0850b24_1"
    },
    {
        "source_sentence": "時彼童子聞佛授記，歡喜踊躍，速疾往詣到父母前，發誠實語說伽陀曰：「舍利子！",
        "translation": "The boy then heard the Buddha's assurance of his prediction, rejoicing and leaping, quickly went to his parents, spoke sincerely, and said to Kāda, Śāriputra!",
        "source": "T11n0316_027:0850b24_1"
    },
    {
        "source_sentence": "「『如汝所說諸人眾，　　各各已發菩提心，",
        "translation": "'As you've said, all the people have each aroused the mind of enlightenment,",
        "source": "T11n0316_027:0850b28_2"
    },
    {
        "source_sentence": "　　我今歸依一切智，　　與汝發願無有異。",
        "translation": "I now take refuge in omniscience, No different from the vow you've made.",
        "source": "T11n0316_027:0850b28_2"
    },
    {
        "source_sentence": "　　如是進求究竟道，　　汝今身是我所生，",
        "translation": "In the same way you have pursued the ultimate path, And now you are born as a self.",
        "source": "T11n0316_027:0850b28_2"
    },
    {
        "source_sentence": "　　與汝同發真實心，　　願得菩提果成就。』",
        "translation": "Together with you, we'll arouse the true mind and wish to attain the fruit of enlightenment.'",
        "source": "T11n0316_027:0850b28_2"
    },
    {
        "source_sentence": "時彼父母而為童子說伽陀曰：「舍利子！",
        "translation": "Their parents then spoke to the boy Gadha, saying, Śāriputra!",
        "source": "T11n0316_027:0850b28_2"
    },
    {
        "source_sentence": "「『我若最先得成佛，　　誓與一切悉開示，",
        "translation": "'If I had first attained buddhahood, I would have vowed to reveal it to all.",
        "source": "T11n0316_027:0850c04_3"
    },
    {
        "source_sentence": "　　願我父母諸人眾，　　共成無上大菩提。』",
        "translation": "May my parents and other people together attain the unsurpassed great enlightenment.'",
        "source": "T11n0316_027:0850c04_3"
    },
    {
        "source_sentence": "時彼童子為自父母復說伽陀曰：「復次舍利子！",
        "translation": "The boy then spoke to his parents again, saying, Furthermore, Śāriputra!",
        "source": "T11n0316_027:0850c04_3"
    },
    {
        "source_sentence": "時毘婆尸如來為彼童子及諸人眾發如是言：『我今為汝授作佛記。",
        "translation": "The Vaiśravaṇa Tathāgata then spoke to the boy and the other people, saying, 'Now, I'll give you a prediction of becoming a buddha for you.",
        "source": "T11n0316_027:0850c07_4"
    },
    {
        "source_sentence": "勿生疑惑，善自安慰勿復異見。",
        "translation": "Don't give rise to doubt or doubt, and comfort yourself well enough not to have any different views.",
        "source": "T11n0316_027:0850c08_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0316_027:0850c09_6"
    },
    {
        "source_sentence": "汝於往昔為大自在天子，我於彼時已曾為汝授作佛記。",
        "translation": "You were the great sovereign celestial prince in the past, and I've given you a prediction of future buddhahood since then.",
        "source": "T11n0316_027:0850c09_7"
    },
    {
        "source_sentence": "過是已後經俱胝那由他劫不墮惡趣，又過俱胝那由他劫於彼轉輪聖王族姓中生，",
        "translation": "After this, they won't fall into bad destinies for a hundred million eons, and after a hundred million eons have passed, they'll be born among the clans of those wheel-turning sage kings.",
        "source": "T11n0316_027:0850c11_8"
    },
    {
        "source_sentence": "得成為佛，名曰大悲如來、阿羅訶、三藐三佛陀，具大名稱。",
        "translation": "He becomes a buddha named the Great Compassionate Tathāgata, Arhat, Samyak-saṃbuddha, and fully endowed with great fame.",
        "source": "T11n0316_027:0850c13_0"
    },
    {
        "source_sentence": "父名淨飯，離諸暗鈍。",
        "translation": "His father's name was Jīvaka, and he was free of obscurity.",
        "source": "T11n0316_027:0850c14_1"
    },
    {
        "source_sentence": "母名摩耶，離諸憂惱。",
        "translation": "His mother's name was Māya, and he was free of sorrow.",
        "source": "T11n0316_027:0850c14_2"
    },
    {
        "source_sentence": "其子爾時亦如我子，字羅睺羅。",
        "translation": "At the time, that son was also like my son, named Rāhula.",
        "source": "T11n0316_027:0850c15_3"
    },
    {
        "source_sentence": "出現世已，求成阿耨多羅三藐三菩提。",
        "translation": "After appearing in the world, he seeks to achieve unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_027:0850c16_0"
    },
    {
        "source_sentence": "於菩提道既成就已，其佛壽命滿十萬歲。",
        "translation": "Once he had accomplished the path to enlightenment, his Buddha's life span was 100,000 years old.",
        "source": "T11n0316_027:0850c16_1"
    },
    {
        "source_sentence": "彼佛光明普能照耀十萬踰繕那國土。",
        "translation": "That Buddha's light can universally illuminate 100,000 yojanas of land.",
        "source": "T11n0316_027:0850c17_2"
    },
    {
        "source_sentence": "彼世界中一切有情，有緣無緣悉皆承佛光明照觸。",
        "translation": "All sentient beings in those worlds, whether conditioned or unconditioned, all receive the Buddha's light and illuminate and touch.",
        "source": "T11n0316_027:0850c18_3"
    },
    {
        "source_sentence": "時佛光中有百俱胝、那由陀俱胝、百千那由他俱胝大聲聞眾皆來集會。",
        "translation": "In the Buddha's light, there were a hundred corpuscles, a hundred nayutas, and a hundred thousand nayutas of great śrāvakas who all came to assemble.",
        "source": "T11n0316_027:0850c19_4"
    },
    {
        "source_sentence": "復有一俱胝眾，皆是大阿羅漢，具足白法諸漏已盡，無復煩惱心得自在，",
        "translation": "And there was also a great assembly of monks, all of whom were great arhats. Endowed with the white dharmas, they had already extinguished their contaminants and no longer suffered from defilement in their minds.",
        "source": "T11n0316_027:0850c21_5"
    },
    {
        "source_sentence": "具八解脫得六神通。』",
        "translation": "He possesses the eight liberations and attains the six supernormal powers.'",
        "source": "T11n0316_027:0850c23_6"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_027:0850c23_7"
    },
    {
        "source_sentence": "如是大阿羅漢皆來集會，復有無量大菩薩眾皆來集會，復有彼佛往昔一切父母亦來集會。",
        "translation": "Thus, these great arhats all came to the assembly, and there were also measureless great bodhisattvas who came to the assembly, and there were also those buddhas and all their parents from the past who came to the assembly.",
        "source": "T11n0316_027:0850c23_8"
    },
    {
        "source_sentence": "時大悲如來說法教化無量阿僧祇有情，皆住不退轉地，於諸有情作善利已，",
        "translation": "The great compassionate Tathāgata then taught the Dharma to immeasurable incalculable numbers of sentient beings, all abiding in the stage of nonretrogression. Having done so for the benefit of sentient beings,",
        "source": "T11n0316_027:0850c25_9"
    },
    {
        "source_sentence": "即於是時入般涅盤，正法住世一俱胝歲。",
        "translation": "He then entered parinirvāṇa at that point, and the right teaching remained in the world for one koṭī of years.",
        "source": "T11n0316_027:0850c27_10"
    },
    {
        "source_sentence": "彼佛舍利於諸世間廣大流布，如我滅後流布舍利等無有異。",
        "translation": "That Buddha's relics will be widely disseminated in all the worlds, just as they will be disseminated after I cease. There's no difference between those relics and so forth.",
        "source": "T11n0316_027:0850c28_11"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_027:0851a01_12"
    },
    {
        "source_sentence": "說是語時，諸有正士發起勇猛廣大精進，而起尋伺觀察世間利樂有情心無退轉。",
        "translation": "When they say these words, there are righteous people who give rise to courageous and extensive effort and give rise to discursive examination of worldly benefits for the benefit of sentient beings without regressing in their minds.",
        "source": "T11n0316_027:0851a01_13"
    },
    {
        "source_sentence": "復有菩薩摩訶薩發起正念，轉復增勝心無間斷，志求阿耨多羅三藐三菩提。",
        "translation": "Again, there are bodhisattva-mahāsattvas who give rise to right mindfulness and further increase their minds without interruption with the intention to pursue unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_027:0851a03_14"
    },
    {
        "source_sentence": "如是經於無量阿僧祇劫，願於生死流轉之中，化利有情求佛菩提。",
        "translation": "Thus, for measureless incalculable eons, I've vowed to transform sentient beings who seek the Buddha's enlightenment while transmigrating through birth-and-death.",
        "source": "T11n0316_027:0851a04_15"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_027:0851a06_16"
    },
    {
        "source_sentence": "我於彼時亦發是願，盡生死際被精進鎧化利有情，圓滿一劫精進行願，",
        "translation": "At the time, I also made this vow to be armed with energy for the sake of sentient beings throughout all births and deaths, fulfilling the vow to carry out one eon of effort.",
        "source": "T11n0316_027:0851a06_17"
    },
    {
        "source_sentence": "勇猛精進心無退轉，願成菩提。",
        "translation": "Their minds of courageous effort and nonregression, they vow to attain enlightenment.",
        "source": "T11n0316_027:0851a08_18"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0851a08_19"
    },
    {
        "source_sentence": "云何菩薩摩訶薩不退勇猛精進？",
        "translation": "How does the bodhisattva Mahāsattva's indefatigable, courageous effort?",
        "source": "T11n0316_027:0851a09_20"
    },
    {
        "source_sentence": "若菩薩摩訶薩行不退勇猛精進行時，設見三千大千世界滿中火聚，為求如來正等菩提，",
        "translation": "“When great enlightening beings practice unregressing, courageous effort and zeal, if they see the billion-world-galactic universe filled with a mass of fire in order to seek the true enlightenment of buddhas,",
        "source": "T11n0316_027:0851a10_0"
    },
    {
        "source_sentence": "應當發起勇猛精進，入是火中而能安忍不生懈倦。",
        "translation": "You should give rise to courageous effort, enter this fire, and be able to tolerate it peacefully without laziness.",
        "source": "T11n0316_027:0851a12_1"
    },
    {
        "source_sentence": "彼諸菩薩聞是法時，即得超越圓滿一劫精進行願。",
        "translation": "When those bodhisattvas hear this teaching, they'll attain the vow to transcend the consummation of one eon of effort and undertake it.",
        "source": "T11n0316_027:0851a13_2"
    },
    {
        "source_sentence": "又諸菩薩聞是法時，於不退轉勇猛精進即得增長無量善根。",
        "translation": "Also, when bodhisattvas hear this teaching, they attain the growth of measureless good roots by not regressing and courageously exerting themselves.",
        "source": "T11n0316_027:0851a14_3"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0851a15_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩行不退轉勇猛精進時，而為利益一切有情求證涅盤，純一無雜常住堅固，",
        "translation": "“When great enlightening beings practice unregressing, courageous, and vigorous effort, they seek nirvana for the benefit of all sentient beings, purely one, without mixture, always abiding steadfastly.",
        "source": "T11n0316_027:0851a16_5"
    },
    {
        "source_sentence": "於善不善起大悲慜，於諸有情行相應行。",
        "translation": "They give rise to great compassion for what's good and unwholesome, and they act in conjunction with the actions of sentient beings.",
        "source": "T11n0316_027:0851a18_6"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0851a19_7"
    },
    {
        "source_sentence": "菩薩摩訶薩當行勇猛精進悉無懈怠，於一切處舉足下足常不離於菩提之心，",
        "translation": "“Great enlightening beings should practice heroic effort without laziness, always maintaining the aspiration for enlightenment in all places.",
        "source": "T11n0316_027:0851a19_8"
    },
    {
        "source_sentence": "觀諸三寶常在目前，亦不棄捨一切有情，亦不隨順一切煩惱。",
        "translation": "He observes that the Three Treasures are always present, doesn't abandon all sentient beings, and doesn't follow all afflictions.",
        "source": "T11n0316_027:0851a21_9"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0851a23_0"
    },
    {
        "source_sentence": "菩薩摩訶薩當行勇猛精進悉無懈怠，於已生未生諸善根力悉令回向菩提正道，",
        "translation": "“Great enlightening beings should practice heroic effort without laziness, directing the roots of goodness that have arisen and those that have yet to arise back to the right path of enlightenment.",
        "source": "T11n0316_027:0851a23_1"
    },
    {
        "source_sentence": "復令善根增長無盡。",
        "translation": "It also causes the good roots to grow inexhaustibly.",
        "source": "T11n0316_027:0851a25_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_027:0851a25_3"
    },
    {
        "source_sentence": "譬如百川流注大海其水無盡。",
        "translation": "It's like when a hundred rivers flow into the ocean and its water is inexhaustible.",
        "source": "T11n0316_027:0851a25_4"
    },
    {
        "source_sentence": "今此善根回向菩提，亦復如是無有窮盡，是故說名不退勇猛精進。",
        "translation": "Now, this good root is also likewise directed back to enlightenment, which has no limit. That's why it's called nonretrogressing and courageous effort.",
        "source": "T11n0316_027:0851a26_5"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0851a28_6"
    },
    {
        "source_sentence": "菩薩摩訶薩當行不退勇猛精進之時悉無懈怠，於諸正行一切智智積集善根，",
        "translation": "“When great enlightening beings practice nonregression and courageous effort, they do not lazy at all, accumulating roots of goodness in the omniscience of right action.",
        "source": "T11n0316_027:0851a28_7"
    },
    {
        "source_sentence": "復能利樂一切有情，是故說名不退勇猛精進。",
        "translation": "It can also benefit all sentient beings, which is why it's called nonretrogressing and courageous effort.",
        "source": "T11n0316_027:0851b01_8"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0851b03_0"
    },
    {
        "source_sentence": "我今略說菩薩摩訶薩乃至一切有情所獲福蘊，乃至有學無學聲聞緣覺所獲福蘊，",
        "translation": "I will now briefly explain the aggregate of merit attained by bodhisattvas, mahāsattvas, even all sentient beings, and so forth, up to the aggregate of merit attained by śrāvakas and pratyekbuddhas, those who are still learning and those who have no more learning to do.",
        "source": "T11n0316_027:0851b03_1"
    },
    {
        "source_sentence": "不及如來一毛端量所獲福蘊，何況如來遍身毛孔所有福蘊？",
        "translation": "It's not as great as the merit aggregate obtained by a single hairtip of the Tathāgata's hair, so why wouldn't it be like the merit aggregate that exists in the Tathāgata's pores all over his body?",
        "source": "T11n0316_027:0851b05_2"
    },
    {
        "source_sentence": "為由如來於無量劫積集修行廣大福蘊。",
        "translation": "It's because the Tathāgata accumulates and cultivates the vast aggregate of merit for measureless eons.",
        "source": "T11n0316_027:0851b06_3"
    },
    {
        "source_sentence": "設有廣大積集福蘊如實行相百分千分，不及如來一大人相，何況如來一切相好？",
        "translation": "Even if there were to be a hundredth of a thousand parts of the great accumulation of merit as it really is, it wouldn't equal the Tathāgata's large human appearance, much less all the Tathāgata's characteristics and features.",
        "source": "T11n0316_027:0851b07_4"
    },
    {
        "source_sentence": "又諸福蘊，不及如來眉間白毫一珂月相，何況百千匝中所有功德？",
        "translation": "Furthermore, the aggregate of merit is not as great as the white hair between the Tathāgata's eyebrows at the top of a white hair between his eyebrows and the mark of a single e月, let alone all the merits he possesses one hundred thousand times.",
        "source": "T11n0316_027:0851b09_5"
    },
    {
        "source_sentence": "又諸福蘊，不及如來一無見頂相，何況如來大丈夫相，乃至烏瑟膩沙諸根相好出生百千俱胝所有功德？",
        "translation": "Furthermore, the merit aggregate of merit is not as great as the Tathāgata's single signlessness at the top of his head, so why wouldn't he have the characteristics of a great man or even the attributes of the Tathāgata's faculties and features that produce hundreds of thousands of koṭis of karmic virtues?",
        "source": "T11n0316_027:0851b11_0"
    },
    {
        "source_sentence": "又諸福蘊，不及如來大法螺音一說法相，何況如來廣大法音，普能遍滿無量世界，",
        "translation": "Furthermore, the aggregate of blessings is not as great as the characteristics of a single teaching of the voice of the conch of the Teaching of the Buddha. How much less could the vast voice of the Teaching pervade an infinite number of worlds.",
        "source": "T11n0316_027:0851b13_1"
    },
    {
        "source_sentence": "令諸有情諸根調適皆生歡喜，隨其勝解得善調伏，於如是難得阿耨多羅三藐三菩提應生知解。",
        "translation": "Causing sentient beings whose faculties are well-adjusted to all become joyous, and following their resolve to attain good discipline, they should give rise to knowledge and understanding that it's difficult to attain unsurpassed, correct, and complete enlightenment in this way.",
        "source": "T11n0316_027:0851b15_2"
    },
    {
        "source_sentence": "如是菩薩於無量世界隨學如來發大音聲，普令有情悉皆得聞，被精進鎧發堅固意，",
        "translation": "“In the same way enlightening beings produce great sounds in infinite worlds following the Teaching, causing sentient beings to hear them all; armed with energy they develop firm determination.",
        "source": "T11n0316_027:0851b17_3"
    },
    {
        "source_sentence": "樂習菩薩不退勇猛精進之行。",
        "translation": "It's a pleasure to cultivate the bodhisattva's practice of nonretrogression and courageous effort.",
        "source": "T11n0316_027:0851b19_4"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0851b21_0"
    },
    {
        "source_sentence": "菩薩摩訶薩修精進行時而無退屈，假使普令三千大千世界一切有情具足成就勝解智力，",
        "translation": "“When great enlightening beings cultivate effort and practice, they do not regress—even if they were to cause all sentient beings in the billion-thousand worlds to perfect the power of knowledge of resolve.",
        "source": "T11n0316_027:0851b21_1"
    },
    {
        "source_sentence": "若諸有情於此菩薩藏正法隨順成就具足智力，比前功德，百分千分百千萬億分乃至烏波尼殺曇分，",
        "translation": "“Furthermore, if all sentient beings were to develop the power of knowledge in accordance with this collection of true teachings of enlightening beings, they would be one-thousandth as numerous as the former merits—a hundredth of a thousandth of a millionth of a trillionth of a trillionth of a trillionth of a trillionth of a trillion",
        "source": "T11n0316_027:0851b23_2"
    },
    {
        "source_sentence": "不及其一。",
        "translation": "They aren't one and the same.",
        "source": "T11n0316_027:0851b25_3"
    },
    {
        "source_sentence": "以要言之，如是三千大千世界一切有情，悉令獲得須陀洹智力、斯陀含智力、阿那含智力、阿羅漢智力，",
        "translation": "To sum up, all these sentient beings of the great manifold cosmos were caused to attain the power of knowledge of stream entry, the power of knowledge of once-returning, the power of knowledge of non-returning, and the power of knowledge of arhatship.",
        "source": "T11n0316_027:0851b26_0"
    },
    {
        "source_sentence": "又令獲得十信、十住、十行、十回向、不退轉地智力，一生補處菩薩之位，",
        "translation": "He also caused them to attain the power of knowledge of the ten stages of faith, the ten abodes, the ten practices, the ten dedications of merit, and the stage of nonretrogression. In one lifetime they were reborn as enlightening beings in the bodhisattva stage.",
        "source": "T11n0316_027:0851b28_1"
    },
    {
        "source_sentence": "乃至廣說無量世界一切有情普令獲得一生補處菩薩智力。",
        "translation": "It's even a detailed explanation of the bodhisattva's wisdom power that enables all sentient beings in measureless worlds to attain one lifetime of remediation.",
        "source": "T11n0316_027:0851b29_2"
    },
    {
        "source_sentence": "若諸有情，於如來無分別及有分別智力等，如是聽已不驚不怖，當於彼時次第樂欲甚深智力。",
        "translation": "If sentient beings who are free of discrimination about the Tathāgata and have the power of discriminating cognition and so forth, thus listen without fear or apprehension, they'll then sequentially delight in the profound cognitive power of desire at that time.",
        "source": "T11n0316_027:0851c02_3"
    },
    {
        "source_sentence": "比前功德，百分千分百千萬億分阿僧祇分乃至烏波尼殺曇分，不及其一。",
        "translation": "Compared to the previous merit, it's a hundredth of a thousand parts, a hundred trillion parts, an incalculable part, or even a part of Upanisaṭṭha, which isn't one and the same.",
        "source": "T11n0316_027:0851c04_4"
    },
    {
        "source_sentence": "而菩薩樂欲發起勇猛精進，寧棄身命頭目髓腦一切支分，於如來智力不樂暫時間斷修習。",
        "translation": "Instead, the bodhisattva's delight is to give rise to courageous effort, preferring to abandon all parts of body, life, head, eyes, marrow, and marrow, and he doesn't want to stop cultivating it for a while because of the Tathāgata's wisdom power.",
        "source": "T11n0316_027:0851c06_5"
    },
    {
        "source_sentence": "如是棄捨勇猛精進，我說是名菩薩不退精進之行。",
        "translation": "Thus abandoning courageous effort, I say this is called the bodhisattva's practice of nonretrogressing effort.",
        "source": "T11n0316_027:0851c08_6"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0851c09_7"
    },
    {
        "source_sentence": "菩薩摩訶薩應當如是修學不退轉地，乃至發起一心遍入過去未來現在一切有情無量無邊心行差別，",
        "translation": "“Great enlightening beings should thus cultivate the stage of nonregression, up to develop a single mind that enters everywhere into the infinite and boundless distinctions in mental patterns of all sentient beings of past, future, and present.",
        "source": "T11n0316_027:0851c09_8"
    },
    {
        "source_sentence": "若諸有情具足充滿貪瞋癡等一切煩惱，而復回入菩薩之心。",
        "translation": "If sentient beings are fully filled with all the afflictions of craving, anger, delusion, and so forth, they also return to enter the bodhisattva's mind.",
        "source": "T11n0316_027:0851c12_9"
    },
    {
        "source_sentence": "是時菩薩以智慧力，譬喻言辭種種推求，如是發起勇猛精進，見是色相一切有情貪瞋癡等之所燒煮。",
        "translation": "The bodhisattva then uses the power of wisdom, metaphors, words, and various inquiries, thus arouse courageous effort to see that all sentient beings with form and characteristics are burned by greed, anger, delusion, and so forth.",
        "source": "T11n0316_027:0851c13_10"
    },
    {
        "source_sentence": "是時菩薩以諸方便，普令止息一切苦惱，如彼灰燼散滅無餘，復令修習趣涅盤道，",
        "translation": "“Then the enlightening beings at that time, using various expedient means, cause all suffering to be extinguished, just as they are burned up and dispersed without remainder, and also cause them to cultivate the path of nirvana.",
        "source": "T11n0316_027:0851c16_0"
    },
    {
        "source_sentence": "我說是名菩薩不退精進之行。",
        "translation": "I say this is called the bodhisattva's practice of not regressing from effort.",
        "source": "T11n0316_027:0851c17_1"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0851c19_0"
    },
    {
        "source_sentence": "菩薩摩訶薩修不退精進行時，所謂身作業善、語作業善、意作業善，乃至所有一切精進波羅蜜多，",
        "translation": "“When great enlightening beings cultivate the practice of nonregressing energy, they do so by means of what is good in body, good in speech, and good in thought, up to all the perfections of effort.",
        "source": "T11n0316_027:0851c19_1"
    },
    {
        "source_sentence": "皆悉不離身語意業之所修習，然於三業發生精進意為最勝。",
        "translation": "They all don't part from the actions of body, speech, and thought that are cultivated, but the intention to generate effort among the three actions is the most superior.",
        "source": "T11n0316_027:0851c21_2"
    },
    {
        "source_sentence": "云何意業精進最勝？",
        "translation": "What's the most superior in terms of mental activity and effort?",
        "source": "T11n0316_027:0851c22_3"
    },
    {
        "source_sentence": "謂無分別及有分別。",
        "translation": "They are nondiscrimination and discrimination that exists.",
        "source": "T11n0316_027:0851c23_4"
    },
    {
        "source_sentence": "云何無分別？",
        "translation": "How is it nondiscriminated?",
        "source": "T11n0316_027:0851c23_5"
    },
    {
        "source_sentence": "謂菩提心。",
        "translation": "It's the mind of enlightenment.",
        "source": "T11n0316_027:0851c24_6"
    },
    {
        "source_sentence": "云何有分別？",
        "translation": "How are there distinctions?",
        "source": "T11n0316_027:0851c24_7"
    },
    {
        "source_sentence": "謂於一切有情起大悲心。",
        "translation": "It's the mind that gives rise to great compassion for all sentient beings.",
        "source": "T11n0316_027:0851c24_8"
    },
    {
        "source_sentence": "云何無分別？",
        "translation": "How is it nondiscriminated?",
        "source": "T11n0316_027:0851c25_9"
    },
    {
        "source_sentence": "謂於忍智悟無我理。",
        "translation": "It's the awakening to the principle of selflessness in the knowledge of forbearance.",
        "source": "T11n0316_027:0851c25_10"
    },
    {
        "source_sentence": "云何有分別？",
        "translation": "How are there distinctions?",
        "source": "T11n0316_027:0851c26_11"
    },
    {
        "source_sentence": "謂能攝受一切有情。",
        "translation": "It's the ability to gather in all sentient beings.",
        "source": "T11n0316_027:0851c26_12"
    },
    {
        "source_sentence": "云何無分別？",
        "translation": "How is it nondiscriminated?",
        "source": "T11n0316_027:0851c26_13"
    },
    {
        "source_sentence": "謂雖能攝受一切有情而無取相。",
        "translation": "It means that even though they can take in all sentient beings, they don't have the characteristic of grasping.",
        "source": "T11n0316_027:0851c27_14"
    },
    {
        "source_sentence": "云何有分別？",
        "translation": "How are there distinctions?",
        "source": "T11n0316_027:0851c27_15"
    },
    {
        "source_sentence": "謂厭離輪回。",
        "translation": "It's being disillusioned with freedom from the cycle of rebirth.",
        "source": "T11n0316_027:0851c28_16"
    },
    {
        "source_sentence": "無分別者，謂於三界都無所得。",
        "translation": "The absence of discrimination means that there's nothing to be attained in the three realms.",
        "source": "T11n0316_027:0851c28_17"
    },
    {
        "source_sentence": "有分別者，謂諸有財寶隨樂捨施。",
        "translation": "Someone with distinctions means that there are possessions and treasures that are given away as they please.",
        "source": "T11n0316_027:0851c29_18"
    },
    {
        "source_sentence": "無分別者，謂於布施無取於相。",
        "translation": "Nondiscrimination means that there's no grasping of characteristics in generosity.",
        "source": "T11n0316_027:0851c29_19"
    },
    {
        "source_sentence": "有分別者，謂於持戒有所積集。",
        "translation": "Someone with distinctions means that there's accumulation of observing precepts.",
        "source": "T11n0316_027:0852a01_20"
    },
    {
        "source_sentence": "無分別者，謂於持戒不取於相。",
        "translation": "The absence of discrimination means that they don't grasp characteristics in observance of precepts.",
        "source": "T11n0316_027:0852a02_21"
    },
    {
        "source_sentence": "有分別者，謂安受苦忍。",
        "translation": "Those who have distinctions are those who tolerate suffering well-being.",
        "source": "T11n0316_027:0852a03_22"
    },
    {
        "source_sentence": "無分別者，謂於剎那心無所住。",
        "translation": "The absence of discrimination means that there's nothing to abide in the momentary mind.",
        "source": "T11n0316_027:0852a03_23"
    },
    {
        "source_sentence": "有分別者，謂能發起諸善根法。",
        "translation": "Those with distinctions are the factors that can give rise to good roots.",
        "source": "T11n0316_027:0852a04_24"
    },
    {
        "source_sentence": "無分別者，謂常靜慮。",
        "translation": "The absence of discrimination is eternal meditative absorption.",
        "source": "T11n0316_027:0852a05_25"
    },
    {
        "source_sentence": "有分別者，謂於禪定有所積集。",
        "translation": "Someone with distinctions means that there's accumulation in meditation.",
        "source": "T11n0316_027:0852a05_26"
    },
    {
        "source_sentence": "無分別者，謂心常決定安住不動。",
        "translation": "The absence of discrimination means that the mind always abides with certainty and unshakable.",
        "source": "T11n0316_027:0852a06_27"
    },
    {
        "source_sentence": "有分別者，謂修聞慧而無厭足。",
        "translation": "Those with distinctions are those who cultivate the wisdom of hearing without getting tired of it.",
        "source": "T11n0316_027:0852a07_0"
    },
    {
        "source_sentence": "無分別者，謂於內心專注善巧。",
        "translation": "The absence of discrimination means focusing one's mind on skillfulness within the mind.",
        "source": "T11n0316_027:0852a07_1"
    },
    {
        "source_sentence": "有分別者，謂於聞慧廣說諸法。",
        "translation": "Those who have distinctions are those who explain the teachings extensively in terms of hearing and wisdom.",
        "source": "T11n0316_027:0852a08_2"
    },
    {
        "source_sentence": "無分別者，謂於法性都無記念。",
        "translation": "Nondiscrimination means that there's no memory of the Dharma nature at all.",
        "source": "T11n0316_027:0852a09_3"
    },
    {
        "source_sentence": "有分別者，謂於智慧有所修作。",
        "translation": "Someone with distinctions means that there's something to cultivate in wisdom.",
        "source": "T11n0316_027:0852a09_4"
    },
    {
        "source_sentence": "無分別者，謂於諸法離諸戲論。",
        "translation": "Nondiscrimination means being free of conceptual elaborations about dharmas.",
        "source": "T11n0316_027:0852a10_5"
    },
    {
        "source_sentence": "有分別者，謂於諸梵行積集修作。",
        "translation": "Those who have distinctions are those who accumulate and cultivate religious practices.",
        "source": "T11n0316_027:0852a11_6"
    },
    {
        "source_sentence": "無分別者，謂於諸慧性悉能棄捨。",
        "translation": "The absence of discrimination means that the nature of wisdom is able to completely abandon it.",
        "source": "T11n0316_027:0852a12_0"
    },
    {
        "source_sentence": "有分別者，謂於五神通而能圓滿。",
        "translation": "Someone with distinctions means that they can perfect the five supernormal powers.",
        "source": "T11n0316_027:0852a12_1"
    },
    {
        "source_sentence": "無分別者，謂盡諸有漏。",
        "translation": "The absence of discrimination means that it ends the contaminants.",
        "source": "T11n0316_027:0852a13_2"
    },
    {
        "source_sentence": "有分別者，謂於觀想而常思惟。",
        "translation": "Those with distinctions are those who always contemplate contemplations.",
        "source": "T11n0316_027:0852a14_3"
    },
    {
        "source_sentence": "無分別者，謂於內心而常正念。",
        "translation": "The absence of discrimination means always being correctly mindful within the mind.",
        "source": "T11n0316_027:0852a14_4"
    },
    {
        "source_sentence": "有分別者，謂於四正斷悉能巧妙。",
        "translation": "Someone with distinctions means that they're able to skillfully eliminate all four kinds of righteousness.",
        "source": "T11n0316_027:0852a15_5"
    },
    {
        "source_sentence": "無分別者，謂能超越一切善根。",
        "translation": "The absence of discrimination means being able to transcend all good roots.",
        "source": "T11n0316_027:0852a16_6"
    },
    {
        "source_sentence": "有分別者，謂著文字相欲求出離。",
        "translation": "Those with distinctions are those who cling to the characteristics of words and want to seek escape.",
        "source": "T11n0316_027:0852a16_7"
    },
    {
        "source_sentence": "無分別者，謂於廣大福報普遍無相。",
        "translation": "The absence of discrimination means that the vast rewards of merit are universally without marks.",
        "source": "T11n0316_027:0852a17_8"
    },
    {
        "source_sentence": "有分別者，謂於諸有情善達根宜。",
        "translation": "Those with distinctions are those who well understand the appropriateness of faculties in sentient beings.",
        "source": "T11n0316_027:0852a18_9"
    },
    {
        "source_sentence": "無分別者，謂善能觀察諸善根法而無所得。",
        "translation": "The absence of discrimination means that they are well able to observe the principles of the good roots without attaining them.",
        "source": "T11n0316_027:0852a19_10"
    },
    {
        "source_sentence": "有分別者，謂於諸力有所修習。",
        "translation": "Discrimination means that there's cultivation of the powers.",
        "source": "T11n0316_027:0852a20_11"
    },
    {
        "source_sentence": "無分別者，謂於是處無所損壞。",
        "translation": "The absence of discrimination means that there's nothing damaged or destroyed in this place.",
        "source": "T11n0316_027:0852a21_0"
    },
    {
        "source_sentence": "有分別者，謂能出生菩提分法。",
        "translation": "Those with distinctions are the factors that give rise to the factors of enlightenment.",
        "source": "T11n0316_027:0852a21_1"
    },
    {
        "source_sentence": "無分別者，謂於諸法離分別智。",
        "translation": "Nondiscriminating refers to the cognition that's free of discrimination in regard to dharmas.",
        "source": "T11n0316_027:0852a22_2"
    },
    {
        "source_sentence": "有分別者，謂於正道而能求進。",
        "translation": "Someone with distinctions means that they can seek advancement in the right path.",
        "source": "T11n0316_027:0852a23_3"
    },
    {
        "source_sentence": "無分別者，觀諸神變猶如虛空。",
        "translation": "Those who don't discriminate are observing the miraculous transformations like space.",
        "source": "T11n0316_027:0852a23_4"
    },
    {
        "source_sentence": "有分別者，謂於定門而能積集。",
        "translation": "Discrimination means that it's the ability to accumulate in the aspect of concentration.",
        "source": "T11n0316_027:0852a24_5"
    },
    {
        "source_sentence": "無分別者，謂住奢摩他而唯一境。",
        "translation": "The absence of discrimination means that they abide in quietude and have only one object.",
        "source": "T11n0316_027:0852a25_6"
    },
    {
        "source_sentence": "有分別者，謂於毘鉢舍那而有積集。",
        "translation": "Someone with distinctions means that there's accumulation in vipaśyanā.",
        "source": "T11n0316_027:0852a26_7"
    },
    {
        "source_sentence": "無分別者，謂善入法性。",
        "translation": "The absence of discrimination means that they skillfully enter the Dharma nature.",
        "source": "T11n0316_027:0852a26_8"
    },
    {
        "source_sentence": "有分別者，善能入解諸因緣法。",
        "translation": "Those with distinctions are well able to enter and understand the principles of causes and conditions.",
        "source": "T11n0316_027:0852a27_9"
    },
    {
        "source_sentence": "無分別者，謂善能了知非因緣法。",
        "translation": "The absence of discrimination means being able to well understand things that are not causes and conditions.",
        "source": "T11n0316_027:0852a28_10"
    },
    {
        "source_sentence": "有分別者，謂著勝義聲故。",
        "translation": "Someone with distinctions means that they're attached to the sound of ultimate meaning.",
        "source": "T11n0316_027:0852a28_11"
    },
    {
        "source_sentence": "無分別者，謂行正法行故。",
        "translation": "The absence of discrimination means practicing the practice of the right teaching.",
        "source": "T11n0316_027:0852a29_12"
    },
    {
        "source_sentence": "有分別者，謂莊嚴法身。",
        "translation": "Discrimination refers to the adornment of the Dharma body.",
        "source": "T11n0316_027:0852b01_13"
    },
    {
        "source_sentence": "無分別者，謂於法身離諸莊嚴。",
        "translation": "The absence of discrimination means that the Dharma body is free of adornments.",
        "source": "T11n0316_027:0852b01_14"
    },
    {
        "source_sentence": "有分別者，謂莊嚴語言。",
        "translation": "Someone who has distinctions means to adorn words.",
        "source": "T11n0316_027:0852b02_15"
    },
    {
        "source_sentence": "無分別者，謂依諸聖能常寂默。",
        "translation": "The absence of discrimination means relying on the noble ones who are able to always be silent.",
        "source": "T11n0316_027:0852b02_16"
    },
    {
        "source_sentence": "有分別者，謂依三解脫門而生樂欲。",
        "translation": "Those with distinctions are those who rely on the three gates of liberation and give rise to pleasant desires.",
        "source": "T11n0316_027:0852b03_17"
    },
    {
        "source_sentence": "無分別者，謂無增上我故。",
        "translation": "The absence of discrimination means the absence of an overweening self.",
        "source": "T11n0316_027:0852b04_18"
    },
    {
        "source_sentence": "有分別者，謂能遠離四種魔事。",
        "translation": "Those who have distinctions are those who can be free of the four kinds of demonic things.",
        "source": "T11n0316_027:0852b04_19"
    },
    {
        "source_sentence": "無分別者，謂能棄捨煩惱習氣種故。",
        "translation": "The absence of discrimination means that they are able to abandon the seeds of the habituated tendencies of affliction.",
        "source": "T11n0316_027:0852b05_20"
    },
    {
        "source_sentence": "有分別者，謂能善解巧方便故。",
        "translation": "Someone with distinctions means someone who can skillfully understand skillful means.",
        "source": "T11n0316_027:0852b06_21"
    },
    {
        "source_sentence": "無分別者，謂於智慧如實知見。",
        "translation": "The absence of discrimination means knowing and seeing wisdom as it really is.",
        "source": "T11n0316_027:0852b07_22"
    },
    {
        "source_sentence": "有分別者，謂離攀緣有所見故。",
        "translation": "Someone with distinctions means that they are free of clinging and have views.",
        "source": "T11n0316_027:0852b07_23"
    },
    {
        "source_sentence": "無分別者，謂離超越見故。",
        "translation": "The absence of discrimination means that it's free of transcendent views.",
        "source": "T11n0316_027:0852b08_24"
    },
    {
        "source_sentence": "有分別者，謂有想念見。",
        "translation": "Those with distinctions are those who have conceptions and thoughts and views.",
        "source": "T11n0316_027:0852b09_25"
    },
    {
        "source_sentence": "無分別者，謂意業見。",
        "translation": "The nondiscriminating one is the view of mental action.",
        "source": "T11n0316_027:0852b09_26"
    },
    {
        "source_sentence": "此說名為意業精進，於精進中最為殊勝，我說是名菩薩摩訶薩修不退轉精進之行。",
        "translation": "This is said to be called mental exertion, which is the most superior of all exertions, and I say this is called the practice of nonretrogressing exertion cultivated by bodhisattvas and mahāsattvas.",
        "source": "T11n0316_027:0852b10_27"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0852b13_0"
    },
    {
        "source_sentence": "如是菩薩摩訶薩行不退轉精進行時，行是五種最上極妙之法，速疾證得無上正等菩提。",
        "translation": "Thus, when the bodhisattva Mahāsattva practices with unregressing effort, he practices these five kinds of supreme and most marvelous dharmas that quickly lead to the realization of unsurpassed perfect enlightenment.",
        "source": "T11n0316_027:0852b13_1"
    },
    {
        "source_sentence": "云何五種最上極妙之法？",
        "translation": "What are the five supreme and most sublime dharmas?",
        "source": "T11n0316_027:0852b15_2"
    },
    {
        "source_sentence": "一者而常思念佛出於世，二者而能親近諸善知識，三者而常值遇好時，",
        "translation": "One, they always think of the Buddha as appearing in the world; two, they are able to associate with virtuous teachers; and three, they always encounter good times.",
        "source": "T11n0316_027:0852b15_3"
    },
    {
        "source_sentence": "四者而常積集諸善根法常令堅固，五者隨學菩薩摩訶薩具足戒品而得圓滿。",
        "translation": "Fourth, he always accumulates the good roots and always makes them firm, and fifth, he follows the training of bodhisattvas, mahāsattvas, who are fully endowed with the precepts and attain their fulfillment.",
        "source": "T11n0316_027:0852b17_4"
    },
    {
        "source_sentence": "是名五種最上極妙之法，由是菩薩速疾獲得阿耨多羅三藐三菩提。」",
        "translation": "These are called the five most excellent and most sublime dharmas that enable a bodhisattva to quickly attain supreme perfect enlightenment.",
        "source": "T11n0316_027:0852b19_5"
    },
    {
        "source_sentence": "爾時尊者舍利子重白佛言：「世尊！",
        "translation": "It was then that Venerable Śāriputra again said to the Buddha, Bhagavān!",
        "source": "T11n0316_027:0852b21_0"
    },
    {
        "source_sentence": "若諸菩薩離此五種最上極妙之法，得成阿耨多羅三藐三菩提不？」",
        "translation": "If bodhisattvas part with these five kinds of supreme and most wonderful dharmas, will they attain unsurpassed, correct, and complete enlightenment?",
        "source": "T11n0316_027:0852b21_1"
    },
    {
        "source_sentence": "佛言：「舍利子！",
        "translation": "The Buddha said, Śāriputra!",
        "source": "T11n0316_027:0852b23_2"
    },
    {
        "source_sentence": "若諸菩薩不常思念佛出於世、不能親近諸善知識、若不值遇好時、不能積集諸善根法、不令堅固，",
        "translation": "“If enlightening beings don’t always think of the Buddha as appearing in the world, don’t associate with spiritual benefactors, don’t encounter good times, don’t accumulate roots of goodness, and don’t make them firm,",
        "source": "T11n0316_027:0852b23_3"
    },
    {
        "source_sentence": "不能隨學諸菩薩摩訶薩具足戒品而不圓滿。",
        "translation": "They can't follow the bodhisattvas, mahāsattvas, who are fully endowed with the precepts and aren't perfect.",
        "source": "T11n0316_027:0852b25_4"
    },
    {
        "source_sentence": "如是遠離五種最上極妙之法，不能速疾獲得阿耨多羅三藐三菩提；",
        "translation": "In this way, being far removed from the five highest and most sublime things, they cannot quickly attain unexcelled complete perfect enlightenment.",
        "source": "T11n0316_027:0852b26_5"
    },
    {
        "source_sentence": "違而得者，無有是處。",
        "translation": "There's no place for someone who attains it in disobedience.",
        "source": "T11n0316_027:0852b28_6"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_027:0852b28_7"
    },
    {
        "source_sentence": "云何在家菩薩遠離五種之法？",
        "translation": "How are the bodhisattvas at home far removed from the five kinds of dharmas?",
        "source": "T11n0316_027:0852b29_8"
    },
    {
        "source_sentence": "所謂如王家臣住大眾中，恃其威勢恐怖多人，又語眾言：『我能為汝作種種事。』",
        "translation": "Suppose a minister of the king's family lives among the crowd and relies on his authority to frighten many people, and he says to the crowd, 'I can do various things for you.'",
        "source": "T11n0316_027:0852b29_9"
    },
    {
        "source_sentence": "但以欺誑而實不作，乃至如是安住虛誑語言等事。",
        "translation": "They simply deceive and really don't do it, even so they thus abide in such things as false speech and words.",
        "source": "T11n0316_027:0852c02_10"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_027:0852c03_11"
    },
    {
        "source_sentence": "由是虛誑不能得生諸天善趣，如是行相亦不能得值遇好時。",
        "translation": "Because of this falsehood, they can't be born in the good destinies of the gods, and such actions don't allow them to meet a good time.",
        "source": "T11n0316_027:0852c04_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_027:0852c05_1"
    },
    {
        "source_sentence": "又此行相，在家菩薩唯自具足資養等事不能利他，亦復不能值佛出世，",
        "translation": "“Furthermore, the bodhisattvas who remain householders cannot benefit others except by means of their own provisions. Nor can they meet buddhas or appear in the world.",
        "source": "T11n0316_027:0852c05_2"
    },
    {
        "source_sentence": "乃至不能速疾得成阿耨多羅三藐三菩提。",
        "translation": "They won't quickly attain unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_027:0852c07_3"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0852c09_0"
    },
    {
        "source_sentence": "又在家菩薩住城邑中，有諸障難而常嬈惱。",
        "translation": "Also, when a layman bodhisattva lives in a city, there are obstacles and difficulties that always disturb him.",
        "source": "T11n0316_027:0852c09_1"
    },
    {
        "source_sentence": "云何城邑有諸障難？",
        "translation": "What are the obstacles in cities?",
        "source": "T11n0316_027:0852c10_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_027:0852c10_3"
    },
    {
        "source_sentence": "有諸如來出世成等正覺，為諸天人阿脩羅等說法教化，初中後善，其義深遠，",
        "translation": "There are buddhas who appear in the world to perfect enlightenment and teach the Dharma to gods, humans, and asuras. The meaning of these teachings is profound and far-reaching:",
        "source": "T11n0316_027:0852c10_4"
    },
    {
        "source_sentence": "其語巧妙，具足清白梵行之相，及四部眾圍遶恭敬。",
        "translation": "Their words were skillful, endowed with the pure and white characteristics of religious practice, surrounded by the fourfold assembly and venerated.",
        "source": "T11n0316_027:0852c12_5"
    },
    {
        "source_sentence": "雖復親近供養禮拜苾芻、苾芻尼、優婆塞、優婆夷，然彼聚落城邑巷陌舍宅，",
        "translation": "Even though they may be intimate with, offer support to, and venerate monks, nuns, laymen, and laymen, yet those villages, cities, towns, lanes, roads, houses, and dwellings are not like that.",
        "source": "T11n0316_027:0852c13_6"
    },
    {
        "source_sentence": "人民國王大臣長者居士悉住其中，由是因緣不能具足清淨戒蘊，我說是名城中障難。",
        "translation": "Because of these causes and conditions, they can't fully possess the pure aggregate of morality, which I call a hindrance in the city.",
        "source": "T11n0316_027:0852c15_7"
    },
    {
        "source_sentence": "若在家菩薩如是樂著五欲，不能思念佛出於世，乃至不能速疾得成無上正等正覺。",
        "translation": "If a layman bodhisattva thus happily clings to the five desires, he can't contemplate the Buddha's appearance in the world or quickly attain unsurpassed perfect enlightenment.",
        "source": "T11n0316_027:0852c17_8"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_027:0852c20_0"
    },
    {
        "source_sentence": "在家菩薩而自宣說現行法律，復多障難。",
        "translation": "Laymen bodhisattvas themselves proclaim the present practice of the Dharma, but there are many obstacles and difficulties.",
        "source": "T11n0316_027:0852c20_1"
    },
    {
        "source_sentence": "所謂父母男女、妻妾奴婢、姊妹兄弟、朋友眷屬於長夜中而為障難。",
        "translation": "It's called a long night when parents, men, women, wives, concubines, slaves, sisters, brothers, friends, and retinues are obstructed.",
        "source": "T11n0316_027:0852c21_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_027:0852c22_3"
    },
    {
        "source_sentence": "如是之法能為在家菩薩作諸障難，亦復不樂佛出於世，乃至不能速疾得成阿耨多羅三藐三菩提。",
        "translation": "Such a teaching can create obstacles for laymen and bodhisattvas, and they also don't delight in the Buddha's appearance in the world or even quickly attain unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_027:0852c22_4"
    },
    {
        "source_sentence": "佛說大乘菩薩藏正法經卷第二十七",
        "translation": "Foshuo daishi pusa zhengfa jing, vol. twenty-seventh",
        "source": "T11n0316_027:0852c26_0"
    }
]