[
    {
        "source_sentence": "大寶積經卷第五十",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 50",
        "source": "T11n0310_050:0293a02_0"
    },
    {
        "source_sentence": "大唐三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial edict by the Tripiṭaka Master Xuanzang of the Great Tang dynasty",
        "source": "T11n0310_050:0293a04_0"
    },
    {
        "source_sentence": "菩薩藏會第十二之十六靜慮波羅蜜",
        "translation": "The Twelfth and Sixteenth Perfections of Concentration of the Bodhisattva Canon",
        "source": "T11n0310_050:0293a05_0"
    },
    {
        "source_sentence": "品第十之二",
        "translation": "the tenth and second parts of the chapter",
        "source": "T11n0310_050:0293a06_0"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0293a07_0"
    },
    {
        "source_sentence": "菩薩摩訶薩修行靜慮波羅蜜多故獲得如是無退神通！",
        "translation": "Because the bodhisattva Mahāsattva cultivates the perfection of meditation, he attains such irreversible supernormal abilities!",
        "source": "T11n0310_050:0293a07_1"
    },
    {
        "source_sentence": "善能建立智所作業。",
        "translation": "He's good at establishing the activities of cognition.",
        "source": "T11n0310_050:0293a08_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0293a09_3"
    },
    {
        "source_sentence": "當知菩薩摩訶薩得是通智！",
        "translation": "You should know that the bodhisattva Mahāsattva attains this supernormal knowledge!",
        "source": "T11n0310_050:0293a09_4"
    },
    {
        "source_sentence": "由清淨心、鮮白心、明潔心、無濁心、離隨煩惱心、善調順心、善寂靜心、善修治心，",
        "translation": "Because of their pure minds, pure and white minds, clear and pure minds, undefiled minds, minds free of secondary afflictions, well-adjusted minds, well-quiescent minds, and well-cultivated mind",
        "source": "T11n0310_050:0293a09_5"
    },
    {
        "source_sentence": "如是心相之所由生，靜慮解脫三摩地三摩鉢底之所發起。",
        "translation": "Thus, the mind's characteristics are produced by the samādhi-samāpatti of meditation and liberation that arises from it.",
        "source": "T11n0310_050:0293a11_6"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0293a13_7"
    },
    {
        "source_sentence": "是菩薩摩訶薩處於世界，故作意生，非繫縛生，不由繫縛命終受生。",
        "translation": "Because this bodhisattva Mahāsattva is in the world, attention arises because he's mindful, not from being bound or fettered, and it doesn't come from being born at the end of his life as a result of being bound",
        "source": "T11n0310_050:0293a13_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_050:0293a14_9"
    },
    {
        "source_sentence": "是菩薩摩訶薩解脫一切虛妄分別故，解脫一切非真實煩惱縛故，解脫一切顛倒妄執所依止故。",
        "translation": "It's because the bodhisattva Mahāsattva liberates himself from all false discriminations, liberates himself from all unreal afflictive bonds, and liberates himself from all mistaken deluded attachments as a basis.",
        "source": "T11n0310_050:0293a15_10"
    },
    {
        "source_sentence": "是故此菩薩摩訶薩隨現世界，解脫而生、解脫命終、解脫受生。",
        "translation": "Therefore, this bodhisattva Mahāsattva follows the world in which he's liberated and arises, his life ends at the end of liberation, and his liberation is subject to birth.",
        "source": "T11n0310_050:0293a17_11"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0293a18_12"
    },
    {
        "source_sentence": "是菩薩摩訶薩現受生已成辦大乘，圓滿一切諸佛正教，遍遊十方廣求佛法，",
        "translation": "“These great enlightening beings have now undergone birth, having perfected the Great Vehicle, fulfilling all the teachings of buddhas, and traveling everywhere in the ten directions to seek the buddha-teachings.",
        "source": "T11n0310_050:0293a18_13"
    },
    {
        "source_sentence": "雖志有所求而無取無得，隨入諸佛法即為一切法，隨入一切法即為諸佛法。",
        "translation": "Even though they want something to be sought, they don't grasp or attain it, follow the entry into the Buddha's teachings as all dharmas, and follow the entry into all dharmas as the Buddha's teachings.",
        "source": "T11n0310_050:0293a20_14"
    },
    {
        "source_sentence": "如是菩薩隨入佛法及一切法，然不隨彼法非法行。",
        "translation": "Thus, a bodhisattva follows the entry into the Buddha's teachings and all dharmas but doesn't follow those teachings or unlawful actions.",
        "source": "T11n0310_050:0293a22_15"
    },
    {
        "source_sentence": "「舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0293a24_0"
    },
    {
        "source_sentence": "菩薩摩訶薩若能如實求諸法時安住無取及無得者，是則無有一法而可入於算數。",
        "translation": "If a bodhisattva-mahāsattva can truly seek dharmas when he abides in the absence of grasping and attaining them, then there's no single thing that can be entered into calculation.",
        "source": "T11n0310_050:0293a24_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_050:0293a26_2"
    },
    {
        "source_sentence": "一切諸法超過算數道故。",
        "translation": "It's because all dharmas transcend the path of calculation.",
        "source": "T11n0310_050:0293a26_3"
    },
    {
        "source_sentence": "若能了達法平等性，是則不執法與非法。",
        "translation": "If someone can understand the equality of dharmas, then they won't cling to dharmas and non-dharmas.",
        "source": "T11n0310_050:0293a26_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_050:0293a27_5"
    },
    {
        "source_sentence": "一切諸法性無執故。",
        "translation": "It's because the nature of all dharmas has no attachment.",
        "source": "T11n0310_050:0293a28_6"
    },
    {
        "source_sentence": "若計於中而有義者，是則獲得廣大無義。",
        "translation": "If someone imagines that there's a meaning in it, then they'll attain vast meaninglessness.",
        "source": "T11n0310_050:0293a28_7"
    },
    {
        "source_sentence": "若有善能不計於義，是則義與非義不現前故，不見義者於一切處覺慧無礙。",
        "translation": "If there are good abilities that don't discriminate meaning, then meaning and non-meaning won't appear, so those who don't see meaning have unobstructed awakening and wisdom in all places.",
        "source": "T11n0310_050:0293a29_8"
    },
    {
        "source_sentence": "是菩薩摩訶薩若能如是了覺無礙，則為獲得無障礙覺，若有無障礙覺則於一切而無所著，",
        "translation": "If these great enlightening beings can understand and awaken without obstruction in this way, they will attain unobstructed awakening. And if they have unobstructed awakening, they will have no attachment to anything.",
        "source": "T11n0310_050:0293b02_9"
    },
    {
        "source_sentence": "若無所著則無所住，若無所住則無所乏，若無所乏則無癡無求，若無癡無求則無迷無惑，",
        "translation": "If there is nothing attached, there is nothing to abide in; if there is nothing to abide in, there is nothing lacking; if there is nothing lacking, there is no delusion and no seeking; if there is no delusion and no seeking, there is",
        "source": "T11n0310_050:0293b04_10"
    },
    {
        "source_sentence": "若無迷無惑則無我所，若無我所則無攝受，若無攝受則無所執，若無所執則無諍論，",
        "translation": "If there is no delusion and no mental disturbance, there is no self and nothing pertaining to self. If there is no self and nothing pertaining to self, there is no taking in. If there is no taking in, there is no clinging. If",
        "source": "T11n0310_050:0293b06_11"
    },
    {
        "source_sentence": "若無諍論是則無諍沙門之法，若有無諍沙門法者是則一切無礙無障等虛空求，",
        "translation": "If there are no arguments, then there are no arguments as a dharma of the śramaṇa. And if there are no arguments as a dharma of the śramaṇa, then all things that one seeks in space without obstructions or obstacles",
        "source": "T11n0310_050:0293b08_12"
    },
    {
        "source_sentence": "若能等彼虛空求者則不繫屬欲界色界及無色界，若於諸處無繫屬者則無色相及以形量，",
        "translation": "If they can equally seek space, then they aren't bound to the form realm and formless realms in the desire realm or formless realm. If they are unfettered in all places, then formless characteristics and formless",
        "source": "T11n0310_050:0293b10_13"
    },
    {
        "source_sentence": "若其無是色相形量則能如是隨覺，若能如是隨覺則能如是通達。",
        "translation": "If they don't have form and form, then they can thus perceive it, and if they can thus perceive it, then they can thus comprehend it.",
        "source": "T11n0310_050:0293b12_14"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0293b13_15"
    },
    {
        "source_sentence": "云何說名隨覺通達？",
        "translation": "How are they said to be called subsequently enlightened penetration?",
        "source": "T11n0310_050:0293b14_16"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0293b14_17"
    },
    {
        "source_sentence": "菩薩摩訶薩若能隨覺通達是處無有少法可得，此則說名隨覺通達。",
        "translation": "If a bodhisattva-mahāsattva can follow the perception and penetrate this place, there's no little thing to attain, and this is called following the perception and penetration.",
        "source": "T11n0310_050:0293b14_18"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0293b16_19"
    },
    {
        "source_sentence": "諸菩薩摩訶薩由平等證入如是隨覺通達故，說是菩薩摩訶薩依靜慮波羅蜜多成就希奇未曾有法。",
        "translation": "Because the bodhisattvas, mahāsattvas, and bodhisattvas equally realize and enter such a pervasive penetration, they say that this is an extraordinary and unprecedented thing that the bodhisattvas, mahāsattvas,",
        "source": "T11n0310_050:0293b16_20"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0293b19_0"
    },
    {
        "source_sentence": "云何名為菩薩摩訶薩成就希奇未曾有法？",
        "translation": "What's called a rare and unprecedented thing that the bodhisattva Mahāsattva accomplishes?",
        "source": "T11n0310_050:0293b19_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0293b20_2"
    },
    {
        "source_sentence": "菩薩摩訶薩依靜慮波羅蜜多故，雖行大慈而恒觀無我，雖行大悲而知無眾生，",
        "translation": "“Furthermore, great enlightening beings rely on the transcendent liberation of meditation. Though they practice great benevolence, yet they always contemplate selflessness; though they practice great compassion, yet they know there are no sentient beings",
        "source": "T11n0310_050:0293b20_3"
    },
    {
        "source_sentence": "雖行大喜而知無命者，雖行大捨而知無數取，雖廣行大施而心恒調順，",
        "translation": "“Although they practice great joy, yet they know there is no life”: Although they practice great relinquishment, yet they know countless grasping. Though they practice great giving extensively, their minds are always harmonious and compliant.",
        "source": "T11n0310_050:0293b22_4"
    },
    {
        "source_sentence": "雖緣境淨戒而心常寂靜，雖隨辱行忍而心無窮際，雖勤加精進而心能簡集，",
        "translation": "Their minds are always quiescent even in regard to objects and pure precepts. Though they practice humility and forbearance, their minds have no bounds. Though they diligently apply themselves with energy, the thought can concentrate.",
        "source": "T11n0310_050:0293b23_5"
    },
    {
        "source_sentence": "雖入諸靜慮而正心觀察，雖遍行智慧而心無所行，雖行四念住而心無緣念亦無作意，",
        "translation": "Though they enter all meditations, yet they correctly contemplate the mind; though they practice omniscience and wisdom, yet their mind does not do anything; though they practice the four abodes of mindfulness, yet their mind has no perceptual object or mental object.",
        "source": "T11n0310_050:0293b25_6"
    },
    {
        "source_sentence": "雖行四正斷而心無生滅，雖行如意足而心無戲論，雖行淨信而心無繫著，",
        "translation": "Though he practices the fourfold correct elimination, his mind has no arising or ceasing, though he practices supernormal abilities, his mind has no conceptual elaborations, though he practices pure faith, his mind has no attachment.",
        "source": "T11n0310_050:0293b27_7"
    },
    {
        "source_sentence": "雖行正勤而心恒遠離，雖行於念而心恒自在，雖住三摩地而心證平等，",
        "translation": "Though they practice right effort, their minds are always far removed; though they practice mindfulness, their minds are always self-contained; though they abide in concentration, their minds realize equality.",
        "source": "T11n0310_050:0293b29_8"
    },
    {
        "source_sentence": "雖行般羅若而心本無根，雖行諸力而心無摧伏，雖行覺分而解析菩提，",
        "translation": "Even though he practices prajñā, his mind has no faculties at all; even though he practices the powers, his mind is not subjugated; and even though he practices the factors of enlightenment, he analyzes and",
        "source": "T11n0310_050:0293c02_9"
    },
    {
        "source_sentence": "雖修道分而心無所修，雖行奢摩他而心恒寂滅，雖行毘鉢舍那而心無定觀，",
        "translation": "Even though they practice quietude, their minds are always quiescent; even though they practice vipaśyanā, their minds lack concentration and contemplation.",
        "source": "T11n0310_050:0293c03_10"
    },
    {
        "source_sentence": "雖修行聖諦而畢竟遍知，雖成熟眾生而心本清淨，雖攝受正法而不壞法性，",
        "translation": "Though they cultivate the holy truths, they are ultimately omniscient; though they mature sentient beings, their minds are inherently pure; though they embrace the true Teaching, they do not destroy the essence of the Teaching.",
        "source": "T11n0310_050:0293c05_11"
    },
    {
        "source_sentence": "雖淨佛國土而心等虛空，雖證無生法而心無所得，雖行不退轉地而心性無退，",
        "translation": "Though they purify the buddha-lands, their minds are equal to space; though they realize the principle of nonorigination, their minds have no attainment; though they practice the stage of nonregression, yet their minds do not regress",
        "source": "T11n0310_050:0293c07_12"
    },
    {
        "source_sentence": "雖獲諸妙相而知性無相，雖莊嚴道場而心遊三界常處周輪，雖降伏魔軍而於諸含識無所摧伏，",
        "translation": "Though they attain all subtle marks, yet they know their nature is formless. Though they adorn the site of enlightenment, yet their minds travel through the three realms and always remain circumscribed. Though they conquer the armies of Mār",
        "source": "T11n0310_050:0293c09_13"
    },
    {
        "source_sentence": "雖知諸法即菩提性而心隨覺了，雖轉法輪而心住法性無還無轉，雖復示現大般涅槃而於生死性心常平等。",
        "translation": "Although he knows that all dharmas are the essence of enlightenment, his mind follows and perceives them, although he turns the wheel of the Dharma, his mind abides in the nature of reality without returning or turning, and even though he",
        "source": "T11n0310_050:0293c11_14"
    },
    {
        "source_sentence": "如是舍利子，是名菩薩摩訶薩平等證入隨覺通達。",
        "translation": "Thus, Śāriputra, this is called the bodhisattva Mahāsattva's equally realized entry into the penetration of following enlightenment.",
        "source": "T11n0310_050:0293c13_15"
    },
    {
        "source_sentence": "如是希奇未曾有法，當知修行靜慮波羅蜜多之所成就。",
        "translation": "Such is a rare and unprecedented thing, which should be known to be accomplished by cultivating the perfection of meditation.",
        "source": "T11n0310_050:0293c15_0"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0293c17_0"
    },
    {
        "source_sentence": "何等名為菩薩摩訶薩依靜慮波羅蜜多修學菩薩靜慮之相？",
        "translation": "What's called a bodhisattva-mahāsattva who cultivates the characteristics of the bodhisattva's meditation based on the perfection of meditation?",
        "source": "T11n0310_050:0293c17_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0293c18_2"
    },
    {
        "source_sentence": "菩薩靜慮不住自性，為滿如是三摩地故。",
        "translation": "The bodhisattva's meditation doesn't abide in its own nature, so he fulfills this kind of samādhi.",
        "source": "T11n0310_050:0293c18_3"
    },
    {
        "source_sentence": "菩薩靜慮無有愛味，不為貪著自安樂故。",
        "translation": "The bodhisattva's meditation has no craving or taste, which is because he doesn't cling to his own comfort.",
        "source": "T11n0310_050:0293c19_4"
    },
    {
        "source_sentence": "菩薩靜慮緣於大悲，為斷一切眾煩惱故。",
        "translation": "The bodhisattva's meditation is conditioned by great compassion, which stops all the afflictions.",
        "source": "T11n0310_050:0293c20_5"
    },
    {
        "source_sentence": "菩薩靜慮定無退轉，緣於欲性增上性故。",
        "translation": "The bodhisattva' s meditative absorption is without falling back in samdhi: because it takes the nature of sexual passion as supporting object and has a dominant nature.",
        "source": "T11n0310_050:0293c21_6"
    },
    {
        "source_sentence": "菩薩靜慮鎣發神通，了達眾生諸心行故。",
        "translation": "The bodhisattva's meditative absorption suddenly gives rise to miraculous abilities, which are the result of comprehending the mental actions of sentient beings.",
        "source": "T11n0310_050:0293c22_7"
    },
    {
        "source_sentence": "菩薩靜慮心欣愛悅，善能顯發心自在故。",
        "translation": "The mind of a bodhisattva in meditation is delighted, because it's able to skillfully express the mastery of arousing the mind.",
        "source": "T11n0310_050:0293c23_8"
    },
    {
        "source_sentence": "菩薩靜慮了知一切三摩鉢底，映蔽一切色無色界故。",
        "translation": "The bodhisattva's meditation understands all the samāpattis because they overshadow all form and formless realms.",
        "source": "T11n0310_050:0293c24_9"
    },
    {
        "source_sentence": "菩薩靜慮是為寂靜、最勝寂靜、近於寂靜，映蔽聲聞獨覺定故。",
        "translation": "The bodhisattva's meditation is called quiescence, the most excellent quiescence, and near quiescence because it reflects the concentration of śrāvakas and solitary realizers.",
        "source": "T11n0310_050:0293c25_10"
    },
    {
        "source_sentence": "菩薩靜慮無有分別，極為究滿妙清淨故。",
        "translation": "The bodhisattva's meditation has no discrimination, which is extremely profound and subtle and pure.",
        "source": "T11n0310_050:0293c27_11"
    },
    {
        "source_sentence": "菩薩靜慮行品最勝，習氣相續永除滅故。",
        "translation": "The class of enlightening beings’ practice of meditative absorption is the most superior:",
        "source": "T11n0310_050:0293c28_12"
    },
    {
        "source_sentence": "菩薩靜慮以慧超度，超度一切諸世間故。",
        "translation": "The bodhisattva's concentration is transcended by wisdom, which transcends all the worlds.",
        "source": "T11n0310_050:0293c29_13"
    },
    {
        "source_sentence": "菩薩靜慮為諸含生欲解導首，善能度脫諸含生故。",
        "translation": "A bodhisattva's meditation is the guide for the liberation of all sentient beings who want to be liberated, and it's good at liberating sentient beings who are included.",
        "source": "T11n0310_050:0294a01_0"
    },
    {
        "source_sentence": "菩薩靜慮紹三寶種令不斷絕，以佛靜慮無窮盡故。",
        "translation": "The bodhisattva's meditation nourishes the seeds of the Three Treasures so that they don't stop, because the Buddha's meditation has no limit.",
        "source": "T11n0310_050:0294a02_1"
    },
    {
        "source_sentence": "菩薩靜慮最為高顯，三摩呬多常現前故。",
        "translation": "The bodhisattva's meditative absorption is the most lofty, because it always appears in samādhi.",
        "source": "T11n0310_050:0294a03_2"
    },
    {
        "source_sentence": "菩薩靜慮自在而轉，諸有所作善圓滿故。",
        "translation": "A bodhisattva's meditation is self-contained and develops, because what he does is well accomplished.",
        "source": "T11n0310_050:0294a04_3"
    },
    {
        "source_sentence": "菩薩靜慮是為大我，以妙智慧為大我故。",
        "translation": "The bodhisattva's meditation is the great self because subtle wisdom is the great self.",
        "source": "T11n0310_050:0294a05_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0294a06_5"
    },
    {
        "source_sentence": "如是無量菩薩靜慮，皆是菩薩摩訶薩依靜慮波羅蜜多之所集起。",
        "translation": "Such immeasurable bodhisattva meditations are all produced by bodhisattvas and mahāsattvas based on the perfection of meditation.",
        "source": "T11n0310_050:0294a06_6"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0294a08_0"
    },
    {
        "source_sentence": "菩薩摩訶薩靜慮波羅蜜多，何等之法而為前導？",
        "translation": "What is the method by which a bodhisattva-mahāsattva who practices the perfection of meditation becomes a guide?",
        "source": "T11n0310_050:0294a08_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0294a09_2"
    },
    {
        "source_sentence": "靜慮波羅蜜多者，心靜觀智以為前導，心住一緣以為前導，心無散動以為前導，",
        "translation": "The perfection of meditative absorption is that the knowledge of mental stillness and contemplation is taken as the antecedent; abiding in a single supporting objectTM*! for the awarenesses, being without scattered®*”’:",
        "source": "T11n0310_050:0294a09_3"
    },
    {
        "source_sentence": "其心安住以為前導，心奢摩他以為前導，心三摩地以為前導，三摩地根以為前導，",
        "translation": "The abiding in peace of mind is the first to be guided, the calming of mind is the first to be guided, the absorption mental concentration is the first to be guided, and the faculty samādhi is the first to be guide",
        "source": "T11n0310_050:0294a11_4"
    },
    {
        "source_sentence": "三摩地力以為前導，三摩地覺分以為前導，正三摩地以為前導，靜慮解脫以為前導，",
        "translation": "The power of concentration is the foremost guiding principle; the factors of enlightenment of concentration are the foremost guiding principle; right concentration is the foremost guiding principle; liberation from meditation is the foremost guiding princip",
        "source": "T11n0310_050:0294a13_5"
    },
    {
        "source_sentence": "九次第定以為前導，九滅除法以為前導，一切善法以為前導，伏煩惱怨以為前導，",
        "translation": "The nine graduated concentrations are the first to be led, the nine factors of cessation are the first to be led, all good factors are the first to be led, and the suppression of afflictions and enemies is the first to be led",
        "source": "T11n0310_050:0294a15_6"
    },
    {
        "source_sentence": "三摩地蘊具足圓滿以為前導，菩薩摩訶薩諸三摩地以為前導，佛薄伽梵諸三摩地以為前導。",
        "translation": "The accomplishment of the samādhi aggregate is the prior guide, the bodhisattva-mahāsattva samādhis are the prior guide, and the buddha-bhikṣu samādhis are the prior guide.",
        "source": "T11n0310_050:0294a17_7"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0294a19_8"
    },
    {
        "source_sentence": "如是等無量靜慮，皆為靜慮波羅蜜多前導之法。",
        "translation": "Such measureless meditations are all the teachings that precede the perfection of meditation as a guide.",
        "source": "T11n0310_050:0294a19_9"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0294a20_10"
    },
    {
        "source_sentence": "復有無量無邊證寂靜法，並是靜慮波羅蜜多之所前導。",
        "translation": "There are also measureless and limitless ways to realize the principle of quiescence, which are all led by the perfection of meditation.",
        "source": "T11n0310_050:0294a21_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0294a22_1"
    },
    {
        "source_sentence": "是名菩薩摩訶薩靜慮波羅蜜多。",
        "translation": "This is called the bodhisattva-mahāsattva's perfection of meditation.",
        "source": "T11n0310_050:0294a22_2"
    },
    {
        "source_sentence": "菩薩摩訶薩為阿耨多羅三藐三菩提故，當於是中發勤精進具足修學行菩薩行。」",
        "translation": "Because it's for the sake of unsurpassed, correct, and complete enlightenment, the bodhisattva Mahāsattva will then give rise to diligent effort in this place to fully cultivate the bodhisattva practice.",
        "source": "T11n0310_050:0294a23_3"
    },
    {
        "source_sentence": "「靜慮解脫到彼岸，　　勤行此行多劫海，",
        "translation": "To reach the other shore of liberation from meditation, they diligently practice this practice for many eons.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　其心清淨無濁穢，　　不染世法喻蓮花。",
        "translation": "Their minds are pure and without defilement, undefiled by worldly dharmas like the lotus flower.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　有大靜定名遍照，　　此定依修到彼岸，",
        "translation": "The great meditative absorption of great stillness is called pervasive illumination. This absorption depends on cultivation and reaches the other shore.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　又名月光淨莊嚴，　　復名電光所嚴飾。",
        "translation": "It's also called the pure adornment of moonlight, and it's also called the adorned by lightning.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名高行或心勇，　　或定名為無垢光，",
        "translation": "They may be called lofty practices, or heroic states of mind, Or they may surely be called pure light.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或戒德辦或無憂，　　或名諸法自在轉，",
        "translation": "Some are endowed with virtue in morality, some without sorrow; Some are called the unimpeded evolving of all things.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名法炬或法勇，　　或名山威法自在，",
        "translation": "It may be called the torch of truth or the power of truth, Or it may be called the mountain of authoritative freedom.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或正法智自然超，　　或持正法妙清淨，",
        "translation": "Some are naturally transcended by knowledge of right teaching; Some uphold the sublime purity of right teaching.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名觀察他心定，　　或名正法寶光明。",
        "translation": "It may be called the concentration of observing others’ minds, Or it may be called the light of the jewel of truth.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　復名滅惑嚴勝幢，　　有定名為摧魔力，",
        "translation": "It is also called the glorious banner of the extinction of afflictions. There is a certain name for the power of destroying demons:",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名斷疑及無著，　　或定名為寂靜燈，",
        "translation": "Some are called annihilation of doubt and nonattachment. Some are definitely called the lamp of tranquility.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或力高勝或十力，　　或名敬手大名稱，",
        "translation": "Some are superior in strength, some of the ten powers; Some are called honoring hands and great names.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名持山善安住，　　或蘇迷盧大明燈，",
        "translation": "Some are called “holders of the mountains,” And some are well settled; Some are like the great luminous lamps of Sumeru.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名無勝勝彼勝，　　或名智炬及慧行，",
        "translation": "Some are called ‘unsurpassed’ or ‘surpassing.’ Some are called ‘excellent.’ Some are called ‘knowledge torch’ and ‘practice of wisdom’.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或無邊智或自在，　　或名發慧寂靜定，",
        "translation": "They may be boundless knowledge or self-dependence, Or they may be called the concentration of awakening wisdom and quiescence.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名月淨日音聲，　　或那羅延摧高慢，",
        "translation": "Or it may be called the sound of the moon-pure sun, or Nārayana destroys arrogance.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或善調龍師子吼，　　或名遠離種種想，",
        "translation": "Some well-adjusted dragon lion roar, Some called being far removed from all kinds of thoughts.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名旋轉或返還，　　或無瞚眼力清淨，",
        "translation": "They may be called revolving or returning, Or they may have no anger. The power of the eye is pure:",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或定名為念諸佛，　　或名念法或念僧，",
        "translation": "Some are called mindfulness of buddhas, Some are called mindfulness of doctrine, Some are called ‘mindful’ or ‘mindful of the samgha.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名智轉或入空，　　或名無相或無願，",
        "translation": "Some are called knowledge that develops or enters emptiness, Some are called signless or wishless.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或金剛喻或靜地，　　或金剛地或高勝，",
        "translation": "It may be the adamantine metaphor or the still ground, or the adamantine ground or the high and mighty.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名山王或不瞚，　　或無邊轉或淨音，",
        "translation": "Some are called kings of mountains, Some are not angry; Some are boundless and some pure sounds.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或離煩惱或觀察，　　或虛空妙或如空，",
        "translation": "Some are free from afflictions, some observe, Some are sublime like space or like space.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或發廣大諸功德，　　或趣覺慧或念慧，",
        "translation": "Some give rise to vast virtues, Some lead to enlightenment and wisdom, Some to mindfulness and wisdom.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或辯無盡或相續，　　或無邊說詞無盡，",
        "translation": "Some of their arguments are inexhaustible, some continue; Some are boundless, some speak endlessly.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或無壞善作所作，　　或名觀察或眾悅，",
        "translation": "They may be done by indestructible good deeds, Or they may be called observing or pleasing to all.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名慈現或悲廣，　　或入歡喜或欣慶，",
        "translation": "It may be called the manifestation of kindness or vast compassion, Or it may enter joy or bliss.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或捨或脫二種礙，　　或名法光或法義，",
        "translation": "They may be abandoned or liberated from the two kinds of obstruction, Or they may be called ‘dharma-luminosity’ or ‘dharma-meaning.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或金剛幢或智海，　　或解脫堅或眾喜，",
        "translation": "Whether it’s a diamond banner or an ocean of knowledge, Or liberation is firm or the joy of many.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名智炬無動定，　　或定名曰勝蓮花，",
        "translation": "Some are called the Immutable Concentration of the Torch of Knowledge; some are called the Supreme Lotus.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或簡集法或無動，　　或名慧上及寂靜，",
        "translation": "It may be a summary collection of teachings, or unmoving, Or it may be called superior wisdom and quiescence.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或無邊光或佛海，　　或名解脫或智授，",
        "translation": "Some are boundless lights, some oceans of Buddhas; Some are called liberations, some wisdom teachings.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名如來妙莊嚴，　　或名無邊勝光焰，",
        "translation": "Some are called the Buddha’s beautiful adornments; Some are called boundless flames of supreme light.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名歡喜莊嚴土，　　或名悅豫眾生意。",
        "translation": "It may be called the land of joy and adornment, or it may be called the land of delight in business.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　有定名為一切時，　　順菩提道三摩地，",
        "translation": "There is a certain concentration called ‘all times’: the one who follows the path of enlightenment and meditates in concentration.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或定名為到彼岸，　　覺分花嚴施寶髻。",
        "translation": "Or it's definitely called reaching the other shore, with a jeweled topknot decorated with flowers of awakening.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或施甘露堅解脫，　　或風無動盛光明，",
        "translation": "Sometimes he bestows ambrosia of firm liberation, Sometimes his light shines brightly like the unmoving wind.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名海潮溝寶藏，　　諸那羅延山峯力。",
        "translation": "Or it may be called the ocean tide- ditch treasure treasury, or the mountain peaks of Nārayaṇas.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或名神通廣大義，　　妙善攝受三摩地。",
        "translation": "Or it may be called the vast meaning of mystic powers, subtly and skillfully taking in samādhi.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　或定名為大通照，　　諸佛如來之境界。",
        "translation": "Perhaps it's definitely called great penetrating illumination, the realm of the buddhas and tathāgatas.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　證得如斯寂靜定，　　及餘拘胝無有邊，",
        "translation": "Realizing such a peaceful state of concentration, As well as the other restraints, has no bounds.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　修行靜慮到彼岸，　　菩薩功德廣無量。",
        "translation": "Practicing meditation and reaching the other shore, enlightening beings’ virtues are immeasurable.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　行住恒遊靜慮境，　　其心無擾常澹泊，",
        "translation": "Their practices and abodes always travel to the realm of meditation; Their minds are not disturbed, always serene.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　若坐若臥止定中，　　無有威儀不在定。",
        "translation": "Whether he's sitting or lying in meditation, there's no manner in his concentration that doesn't abide in meditation.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　處定能發大音聲，　　以諸法性恒寂靜，",
        "translation": "They can make great sounds in the abode of concentration, Because the natures of things are always quiescent.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　無異分別無自在，　　無我無命無分別。",
        "translation": "They have no difference, no discrimination, and no sovereignty, No self, no life, and no discrimination.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　如是及餘無涯際，　　無有數量功德海，",
        "translation": "Thus, and so on, there’s no limit to the ocean of virtue; There is no measureless ocean of virtue.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "　聰叡菩薩愍含靈，　　修行靜慮到彼岸。",
        "translation": "The wise and intelligent bodhisattvas, endowed with the spirit of universal containment, Cultivate meditation to reach the other shore.",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說頌曰：般若波羅蜜多品第十一之一「復次舍利子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, saying, The eleventh chapter of the Prajñāpāramitā Chapter says, Furthermore, Śāriputra!",
        "source": "T11n0310_050:0294a25_4"
    },
    {
        "source_sentence": "云何菩薩摩訶薩般若波羅蜜多？",
        "translation": "What is the bodhisattva-mahāsattva's prajñāpāramitā?",
        "source": "T11n0310_050:0294c17_5"
    },
    {
        "source_sentence": "菩薩摩訶薩為阿耨多羅三藐三菩提故，依此勤修行菩薩行。",
        "translation": "Because of this, the bodhisattva Mahāsattva diligently cultivates the bodhisattva practice for the sake of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_050:0294c18_6"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0294c19_7"
    },
    {
        "source_sentence": "菩薩行般若波羅蜜多故，於菩薩藏微妙法門慇懃鄭重聽聞受持、若讀若誦、思擇義理，",
        "translation": "Because the bodhisattva practices the perfection of prajñāpāramitā, he repeatedly hears and retains, reads and recites, and contemplates the meaning and principle of the subtle dharma-gate of the bodhisattva",
        "source": "T11n0310_050:0294c19_8"
    },
    {
        "source_sentence": "既能通達復為他人廣宣敷演開示其要。",
        "translation": "Once he's able to comprehend it, he then explains and reveals its essentials in detail for others.",
        "source": "T11n0310_050:0294c21_9"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0294c22_10"
    },
    {
        "source_sentence": "若有菩薩摩訶薩聞我說已如法奉行，於菩薩藏微妙法門慇懃鄭重聽聞受持、讀誦研尋、通達其義，",
        "translation": "“Furthermore, if there are bodhisattva mahāsattvas who hear my teaching and practice it in accordance with the Dharma, they will reverently hear, retain, recite, study, and comprehend the meaning of the subtle doctrine of",
        "source": "T11n0310_050:0294c22_11"
    },
    {
        "source_sentence": "為他宣說廣開示已，當知是人證得如是無盡慧相。",
        "translation": "After explaining and extensively revealing it for others, you should know that person realizes the characteristic of such inexhaustible wisdom.",
        "source": "T11n0310_050:0294c25_12"
    },
    {
        "source_sentence": "舍利子，如是慧者為何等相？",
        "translation": "“O Śāriputra, what is the characteristic of wisdom like this?",
        "source": "T11n0310_050:0294c26_13"
    },
    {
        "source_sentence": "云何入證？",
        "translation": "What is entering and realizing?",
        "source": "T11n0310_050:0294c26_14"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0294c27_15"
    },
    {
        "source_sentence": "所言慧者以聞為相，菩薩之人如理證入，是故說為無盡慧相。",
        "translation": "Wisdom that's called wisdom because hearing is its characteristic, and a bodhisattva who correctly realizes it is said to be the characteristic of inexhaustible wisdom.",
        "source": "T11n0310_050:0294c27_16"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0294c28_17"
    },
    {
        "source_sentence": "如是之相，我當廣說。",
        "translation": "Such characteristics as these I will explain in detail.",
        "source": "T11n0310_050:0294c28_18"
    },
    {
        "source_sentence": "謂此相者，菩薩摩訶薩為求正法，欲樂為相、欲解為相、方便為相、善友為相、無慢為相、於多聞所恭敬為相、尊重為相、旋繞為相、謙敬為相、親覲為相、諦聞為相、承事為相、思惟為相、不亂為相、珍寶想為相、良藥想為相、息諸病想為相、念器為相、趣覺為相、樂大慧為相、證入覺為相、聞無厭足為相、捨增益為相、調順離薪為相、親近多聞者為相、於諸作事喜愛為相、身調適為相、心勇銳為相。",
        "translation": "These marks are: for the sake of seeking the true teaching, the bodhisattva Mahāsattva’s marks are desire for pleasure, desire for understanding, skillful means, good friends, no conceit, respect and veneration from learned people, reverence",
        "source": "T11n0310_050:0294c29_19"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0295a09_20"
    },
    {
        "source_sentence": "菩薩摩訶薩於聽法眾無倦聽聞為相、聽聞正義為相、聽聞正法為相、聽聞正行為相、聽聞證智為相、聽聞波羅蜜多為相、聽聞菩薩藏法為相、聽聞諸攝法為相、聽聞方便善巧為相、聽聞梵住為相、聽聞神通為相、聽聞正念正智為相、聽聞念住為相、聽聞正勝為相、聽聞神足為相、聽聞緣起為相、聽聞無常為相、聽聞苦法為相、聽聞無我為相、聽聞寂靜為相、聽聞空為相、聽聞無相為相、聽聞無願為相、聽聞無加行為相、聽聞善根加行為相。",
        "translation": "菩薩摩訶薩於聽法眾無倦聽聞為相,聽聞正義為相,聽聞正法為相,聽聞正法為相,聽聞正行為相,聽聞證智為相,聽聞波羅蜜多為相",
        "source": "T11n0310_050:0295a09_21"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0295a19_22"
    },
    {
        "source_sentence": "如是自在為相、聞法為相、對治雜染為相、制伏一切煩惱想為相、讚美智者為相、親覲聖者為相、遠離非聖為相、聽聞聖者為相、聽聞諸根為相、聽聞修習隨念為相、聽聞覺分為相、聽聞聖八支道為相、聽聞如來力無所畏大慈大悲大喜大捨無礙辯才十八不共佛法為相。",
        "translation": "Such are the characteristics of self-dependence, listening to the Dharma, antidotes to defilement, suppressing all afflictive conceptions, praising wise people as characteristics, visiting sages as characteristics, avoiding what's",
        "source": "T11n0310_050:0295a19_23"
    },
    {
        "source_sentence": "如是舍利子！",
        "translation": "So it is, Śāriputra!",
        "source": "T11n0310_050:0295a25_24"
    },
    {
        "source_sentence": "當知菩薩摩訶薩若於此聽聞即於此解了，若於此解了即於此正行。",
        "translation": "You should know that if a bodhisattva-mahāsattva hears this, he understands it here, and if he understands it here, he correctly practices it here.",
        "source": "T11n0310_050:0295a26_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_050:0295a27_26"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0295a28_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩於菩薩藏微妙法門聞相趣入，方便無量。",
        "translation": "If a bodhisattva Mahāsattva hears and enters the subtle dharma-gate of the bodhisattva store, his skillful means are immeasurable.",
        "source": "T11n0310_050:0295a28_1"
    },
    {
        "source_sentence": "吾今略說四十一種。",
        "translation": "Now, I'll briefly explain forty-one of them.",
        "source": "T11n0310_050:0295a29_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0295b01_0"
    },
    {
        "source_sentence": "何等為相？",
        "translation": "What are their characteristics?",
        "source": "T11n0310_050:0295b01_1"
    },
    {
        "source_sentence": "一者若有菩薩於此法門生欲樂者，當知此菩薩摩訶薩即為聽聞聞便解了，",
        "translation": "One, if there is a bodhisattva who desires this teaching, know that the bodhisattva Mahāsattva hears and understands it.",
        "source": "T11n0310_050:0295b01_2"
    },
    {
        "source_sentence": "既解了已便行正行。",
        "translation": "After understanding it, he then conducts himself correctly.",
        "source": "T11n0310_050:0295b03_3"
    },
    {
        "source_sentence": "二者若有菩薩於此法門生於欲解，當知此人即是聽聞解了行於正行。",
        "translation": "Second, if a bodhisattva gives rise to an understanding of desire regarding this aspect of the teaching, you should know that this person is someone who hears, understands, and practices correctly.",
        "source": "T11n0310_050:0295b03_4"
    },
    {
        "source_sentence": "三者若有菩薩於此法門方便趣入，當知此人即是聽聞解了行於正行。",
        "translation": "Third, if a bodhisattva enters this teaching with skillful means, you should know that he or she is someone who has heard, understood, and practiced correctly.",
        "source": "T11n0310_050:0295b05_5"
    },
    {
        "source_sentence": "四者若有菩薩親近善友，此人即為聽聞解了行於正行。",
        "translation": "Fourth, if a bodhisattva becomes intimate with good friends, that person hears and understands them and correctly conducts himself.",
        "source": "T11n0310_050:0295b07_0"
    },
    {
        "source_sentence": "五者若有菩薩於多聞所心無有慢，此人即為聽聞解了行於正行。",
        "translation": "5. If a bodhisattva has no conceit in his mind about what's well-versed, this person hears and understands it for the sake of correct practice.",
        "source": "T11n0310_050:0295b08_1"
    },
    {
        "source_sentence": "六者若有菩薩恭敬多聞，此人即為聽聞解了行於正行。",
        "translation": "6. If a bodhisattva respects well-versed people, that person listens and understands and practices correctly for their sake.",
        "source": "T11n0310_050:0295b09_2"
    },
    {
        "source_sentence": "七者若有菩薩於多聞者生尊重心，此人即為聽聞解了行於正行。",
        "translation": "7. If a bodhisattva gives rise to respect for well-versed people, that person hears and understands the correct practice.",
        "source": "T11n0310_050:0295b11_3"
    },
    {
        "source_sentence": "八者若有菩薩於多聞所旋遶奉敬，此人即為聽聞解了行於正行。",
        "translation": "Eighth, if a bodhisattva venerates someone who's surrounded by well-versed people, that person hears and understands them and practices correctly.",
        "source": "T11n0310_050:0295b12_4"
    },
    {
        "source_sentence": "九者若有菩薩於多聞所行謙下心，此人即為聽聞解了行於正行。",
        "translation": "(9) If there is a bodhisattva whose mind is humble regarding the practice of learned doctrine, he or she will listen to and understand it in order to engage in correct practice.",
        "source": "T11n0310_050:0295b14_5"
    },
    {
        "source_sentence": "十者若有菩薩親近多聞，此人即為聽聞解了行於正行。",
        "translation": "Tenth, if a bodhisattva becomes intimate with well-versed people, that person hears and understands the correct practice for their sake.",
        "source": "T11n0310_050:0295b15_6"
    },
    {
        "source_sentence": "十一若有菩薩於多聞所攝耳諦聽，此人即為聽聞解了行於正行。",
        "translation": "Eleventh, if a bodhisattva listens closely to the ear that's collected by well-versed people, this person hears, understands, and practices correctly.",
        "source": "T11n0310_050:0295b17_0"
    },
    {
        "source_sentence": "十二若有菩薩於多聞所承事迎逆，此人即為聽聞解了行於正行。",
        "translation": "(12) If a bodhisattva receives and opposes the services of well-versed people, that person hears, understands, and practices correctly.",
        "source": "T11n0310_050:0295b18_1"
    },
    {
        "source_sentence": "十三若有菩薩於多聞所思惟義趣心定不亂，此人即為聽聞解了行於正行。",
        "translation": "13. If a bodhisattva's mind is concentrated on the meaning of what's contemplated by well-versed people and isn't disturbed, this person hears, understands, and practices correctly.",
        "source": "T11n0310_050:0295b20_2"
    },
    {
        "source_sentence": "十四若有菩薩於多聞所起珍寶想，此人即為聽聞解了行於正行。",
        "translation": "14. If a bodhisattva gives rise to the perception of treasures that are well-versed, this person hears and understands and practices correctly.",
        "source": "T11n0310_050:0295b21_3"
    },
    {
        "source_sentence": "十五若有菩薩於多聞所起良藥想，此人即為聽聞解了行於正行。",
        "translation": "Fifteenth, if a bodhisattva gives rise to the perception of good medicine that's well-versed, this person listens and understands and practices correctly.",
        "source": "T11n0310_050:0295b23_4"
    },
    {
        "source_sentence": "十六若有菩薩於多聞所能起息滅貪瞋癡想，此人則為聽聞解了行於正行。",
        "translation": "Sixteenth, if a bodhisattva can cease the thoughts of craving, anger, and delusion in what's well-versed, then this person hears, understands, and practices correctly.",
        "source": "T11n0310_050:0295b24_5"
    },
    {
        "source_sentence": "十七若有菩薩於多聞所聞已能持，此人則為聽聞解了行於正行。",
        "translation": "17. If a bodhisattva is able to retain what's heard by well-versed people, this person hears and understands what's heard and practices correctly.",
        "source": "T11n0310_050:0295b26_6"
    },
    {
        "source_sentence": "十八若有菩薩趣覺於法，此人則為聽聞解了行於正行。",
        "translation": "18 If there are bodhisattvas who aspire to awakening to the Dharma, this person hears and understands it and correctly practices it.",
        "source": "T11n0310_050:0295b28_7"
    },
    {
        "source_sentence": "十九若有菩薩於多聞所樂其智慧，此人則為聽聞解了行於正行。",
        "translation": "19. If a bodhisattva delights in the wisdom of well-versed people, then this person hears and understands and practices correctly.",
        "source": "T11n0310_050:0295b29_8"
    },
    {
        "source_sentence": "二十若有菩薩於多聞所聞已覺悟，此人則為聽聞解了行於正行。",
        "translation": "20. If a bodhisattva has awakened to what's heard by well-versed people, then this person hears and understands and practices correctly.",
        "source": "T11n0310_050:0295c02_0"
    },
    {
        "source_sentence": "二十一若有菩薩聞無厭足，此人則為聽聞解了行於正行。",
        "translation": "(21) If there is a bodhisattva who is neither satisfied with what he has heard nor contented himself with, then this person listens and understands [what he has heard] and practices correctly.",
        "source": "T11n0310_050:0295c03_1"
    },
    {
        "source_sentence": "二十二若有菩薩聞說柁那便增長捨，此人則為聽聞解了行於正行。",
        "translation": "Twenty-two If a bodhisattva hears and explains the teaching, then he'll increase in equanimity, and this person listens and understands and practices correctly.",
        "source": "T11n0310_050:0295c04_2"
    },
    {
        "source_sentence": "二十三若有菩薩聞說尸羅便守護戒，此人則為聽聞解了行於正行。",
        "translation": "Twenty-three If a bodhisattva hears and teaches śīla, then he guards the precepts, and this person listens and understands and practices correctly.",
        "source": "T11n0310_050:0295c06_3"
    },
    {
        "source_sentence": "二十四若有菩薩聞說羼底便能修忍，此人則為聽聞解了行於正行。",
        "translation": "Twenty-fourth, if a bodhisattva can cultivate forbearance when he hears and explains the doctrine, then this person listens and understands and practices correctly.",
        "source": "T11n0310_050:0295c08_4"
    },
    {
        "source_sentence": "二十五若有菩薩聞說毘利耶便起正勤無倦精進，此人則為聽聞解了行於正行。",
        "translation": "25 If a bodhisattva hears the explanation of the vinaya and then gives rise to right effort without weariness and exertion, this person listens, understands, and correctly practices it.",
        "source": "T11n0310_050:0295c09_5"
    },
    {
        "source_sentence": "二十六若有菩薩聞說靜慮便入靜慮其心不散，此人則為聽聞解了行於正行。",
        "translation": "26. If a bodhisattva enters into meditation when he hears the explanation of meditation and doesn't disperse his mind, this person listens, understands, and practices correctly.",
        "source": "T11n0310_050:0295c11_6"
    },
    {
        "source_sentence": "二十七若有菩薩聞說般羅若，其心決定便修智慧為盡諸漏，此人則為聽聞解了行於正行。",
        "translation": "Twenty-seventh If a bodhisattva hears the teaching of prajñā and his mind is certain, then he cultivates wisdom in order to end the contaminants, and this person listens, understands, and practices correctly.",
        "source": "T11n0310_050:0295c13_7"
    },
    {
        "source_sentence": "二十八若有菩薩於多聞所生大歡喜，此人則為聽聞解了行於正行。",
        "translation": "28 If there's a bodhisattva who becomes greatly joyful when he hears much, then this person listens and understands and practices correctly.",
        "source": "T11n0310_050:0295c15_8"
    },
    {
        "source_sentence": "二十九若有菩薩聽聞法已身調適者，此人則為聽聞解了行於正行。",
        "translation": "29. If there's a bodhisattva who hears the teaching and adjusts his body after hearing it, then this person hears, understands, and practices correctly.",
        "source": "T11n0310_050:0295c17_9"
    },
    {
        "source_sentence": "三十若有菩薩聽聞法已其心勇銳，此人則為聽聞解了行於正行。",
        "translation": "30. If a bodhisattva's mind is resolute after hearing the teaching, then this person hears and understands it and correctly practices it.",
        "source": "T11n0310_050:0295c18_10"
    },
    {
        "source_sentence": "三十一若有菩薩聞大乘經心生信欲，此人則為聽聞解了行於正行。",
        "translation": "31 If a bodhisattva hears the great vehicle sūtras and gives rise to faith and desire, this person listens, understands, and practices correctly.",
        "source": "T11n0310_050:0295c20_11"
    },
    {
        "source_sentence": "三十二若有菩薩聞攝法已其心趣入，此人則為聽聞解了行於正行。",
        "translation": "Twenty-two If a bodhisattva hears the collected teaching and then enters it with his mind, this person listens, understands, and practices correctly.",
        "source": "T11n0310_050:0295c21_12"
    },
    {
        "source_sentence": "三十三若有菩薩聞說念住便即趣於身受心法，此人則為聽聞解了行於正行。",
        "translation": "33. If a bodhisattva hears, explains, and abides in mindfulness, then he's headed for body, feeling, mind, and dharmas, and this person listens, understands, and correctly practices them.",
        "source": "T11n0310_050:0295c23_13"
    },
    {
        "source_sentence": "三十四若有菩薩聞說正勝，便於惡法已生未生若背若捨，若彼善法已生未生不捨覺轉，",
        "translation": "“If there is a bodhisattva who hears and explains the correct excellence, then he will turn away from bad qualities that have arisen and those that have yet to arise and abandon them. If these good qualities have arisen and those that have",
        "source": "T11n0310_050:0295c25_14"
    },
    {
        "source_sentence": "此人則為聽聞解了行於正行。",
        "translation": "That person then hears, understands, and practices correctly.",
        "source": "T11n0310_050:0295c27_15"
    },
    {
        "source_sentence": "三十五若有菩薩聞說神足，即能奉行生身輕性、生心輕性、生欲輕性，",
        "translation": "35. If there is a bodhisattva who hears and teaches the supernormal power of enlightenment, he will be able to practice giving rise to lightness of body, lightness of mind, and lightness of desire.",
        "source": "T11n0310_050:0295c28_0"
    },
    {
        "source_sentence": "此人則為聽聞解了行於正行。",
        "translation": "That person then hears, understands, and practices correctly.",
        "source": "T11n0310_050:0295c29_1"
    },
    {
        "source_sentence": "三十六若有菩薩聞說靜慮便靜思惟其心趣入，此人則為聽聞解了行於正行。",
        "translation": "36. If a bodhisattva hears and explains meditation and then quietly contemplates its mind's entry, this person listens and understands and correctly practices it.",
        "source": "T11n0310_050:0296a01_2"
    },
    {
        "source_sentence": "三十七若有菩薩聞諸法中不輕蔑行，便於眾生起大慈心、於入苦者起大悲心、於正法所起大喜心、於不善所起大捨心，",
        "translation": "37. If a bodhisattva hears the teaching and doesn’t despise it, then he generates great compassion toward sentient beings, great compassion toward those who are suffering, great joy toward the true teaching, and great equanimity toward",
        "source": "T11n0310_050:0296a03_3"
    },
    {
        "source_sentence": "此人則為聽聞解了行於正行。",
        "translation": "That person then hears, understands, and practices correctly.",
        "source": "T11n0310_050:0296a05_4"
    },
    {
        "source_sentence": "三十八若有菩薩聞說根已，其心趣入於彼諸根，所謂信根、精進根、念根、慧根、三摩地根，",
        "translation": "38. If there is a bodhisattva who, having heard the teaching of the faculties, mentally directs his attention to and enters those faculties—the faculty of faith, the faculty of effort, the faculty of mindfulness",
        "source": "T11n0310_050:0296a06_5"
    },
    {
        "source_sentence": "此人則為聽聞解了行於正行。",
        "translation": "That person then hears, understands, and practices correctly.",
        "source": "T11n0310_050:0296a08_6"
    },
    {
        "source_sentence": "三十九若有菩薩聞說覺分，其心趣入覺悟法性，此人則為聽聞解了行於正行。",
        "translation": "38. If a bodhisattva hears the awakening factor of enlightenment and enters into the awakening to the Dharma nature with his mind, this person listens, understands, and correctly practices it.",
        "source": "T11n0310_050:0296a09_7"
    },
    {
        "source_sentence": "四十若有菩薩聞說道支，其心趣入涅槃正路，此人則為聽聞解了行於正行。",
        "translation": "40. If a bodhisattva hears and teaches the factors of the path, and his mind is directed toward the right path to enter nirvāṇa, this person listens and understands and practices correctly.",
        "source": "T11n0310_050:0296a11_8"
    },
    {
        "source_sentence": "四十一若有菩薩聞說如來力無所畏大慈大悲大喜大捨無礙辯才十八不共佛法，",
        "translation": "41. If there is a bodhisattva who hears and teaches the great compassion, great compassion, great joy, great equanimity, unhindered eloquence, and 18 unique qualities of buddhahood",
        "source": "T11n0310_050:0296a12_9"
    },
    {
        "source_sentence": "及餘無量諸佛正法皆聽聞已，其心趣入阿耨多羅三藐三菩提，此人如是如法聽聞，",
        "translation": "Having listened to the true teachings of all the other buddhas without measure, their minds are set on unexcelled, complete perfect enlightenment. Such people hear and follow the Dharma in this way:",
        "source": "T11n0310_050:0296a14_10"
    },
    {
        "source_sentence": "既聽聞已便能解了，既解了已行於正行。",
        "translation": "After hearing it, they'll be able to understand it, and after understanding it, they'll do the right action.",
        "source": "T11n0310_050:0296a16_11"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0296a17_12"
    },
    {
        "source_sentence": "我已說是四十一法趣入聞相、諸菩薩摩訶薩當於中學。",
        "translation": "I've already explained these forty-one ways to enter into the characteristics of hearing, and the bodhisattvas, mahāsattvas, will be in the middle school.",
        "source": "T11n0310_050:0296a17_13"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0296a19_14"
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩修行般若波羅蜜多聞慧本相。",
        "translation": "Thus, this is called the original aspect of the bodhisattva-mahāsattva's cultivation of the prajñāpāramitā of hearing and wisdom.",
        "source": "T11n0310_050:0296a19_15"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0296a21_0"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多行菩薩行者，應於如是大菩薩藏微妙法門，",
        "translation": "“Great enlightening beings who practice the bodhisattva practice of prajñāpāramitā should enter this subtle teaching of the great treasury of enlightenment,",
        "source": "T11n0310_050:0296a21_1"
    },
    {
        "source_sentence": "鄭重聽聞受持讀誦思惟其義通微妙法，復為他人廣分別說，是行資糧。",
        "translation": "Zheng repeatedly heard, accepted, retained, recited, and contemplated the subtle teaching of its meaning, and then explained it extensively for others, which is the accumulation of practice.",
        "source": "T11n0310_050:0296a23_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0296a24_3"
    },
    {
        "source_sentence": "云何菩薩摩訶薩於如是法而起正行？",
        "translation": "How does the bodhisattva Mahāsattva give rise to right practice in such a way?",
        "source": "T11n0310_050:0296a24_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0296a25_5"
    },
    {
        "source_sentence": "菩薩於法起正行者，所謂如說修行建立而住，是名於法而起正行。",
        "translation": "A bodhisattva who initiates correct practice with respect to the Dharma and abides based on cultivation as described, this is called initiating correct practice with respect to the Dharma.",
        "source": "T11n0310_050:0296a26_0"
    },
    {
        "source_sentence": "若復有能一切不取，是名於法而起正行。",
        "translation": "If someone else has the ability to grasp all things without grasping them, this is called initiating right practice with respect to the Dharma.",
        "source": "T11n0310_050:0296a27_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_050:0296a28_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0296a28_3"
    },
    {
        "source_sentence": "若取於法即名邪行。",
        "translation": "If someone takes the Dharma, that's called wrong practice.",
        "source": "T11n0310_050:0296a28_4"
    },
    {
        "source_sentence": "無處無位執取法人，由如是法能得出離，必無是處。",
        "translation": "There is no place and no status for the person who clings to it, and because of such a dharma that they can be liberated, there must be no place.",
        "source": "T11n0310_050:0296a29_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_050:0296b01_6"
    },
    {
        "source_sentence": "無取行人、於法無行，尚應生疑，無作用故，況取法行而非邪行？",
        "translation": "Those who practice without grasping and those who practice without the Dharma should still have doubts, because they lack efficacy, so why wouldn't they practice by grasping the Dharma but not wrongly practice it?",
        "source": "T11n0310_050:0296b01_7"
    },
    {
        "source_sentence": "是故應當不取諸法而行正行。",
        "translation": "Therefore, they should conduct themselves correctly without grasping the teachings.",
        "source": "T11n0310_050:0296b03_8"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0296b03_9"
    },
    {
        "source_sentence": "若於諸法無有障礙，是名正行。",
        "translation": "If there are no obstructions in all dharmas, this is called right practice.",
        "source": "T11n0310_050:0296b04_0"
    },
    {
        "source_sentence": "若於諸法不輕蔑者，是名正行。",
        "translation": "If someone doesn't despise the teachings, this is called right practice.",
        "source": "T11n0310_050:0296b04_1"
    },
    {
        "source_sentence": "若於諸法不取不捨不生不滅，是名正行。",
        "translation": "If someone doesn't grasp and abandon things that don't arise and don't cease, this is called right practice.",
        "source": "T11n0310_050:0296b05_2"
    },
    {
        "source_sentence": "乃至若於諸法無合無散，是名正行。",
        "translation": "Even if the dharmas are neither combined nor dispersed, this is called right practice.",
        "source": "T11n0310_050:0296b06_3"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0296b07_4"
    },
    {
        "source_sentence": "如我所說若有是處，無有少法而可見聞亦無可說，如是一切諸法非可得見、非可執取。",
        "translation": "As I've said, if there's a place where there are few things that can be seen and heard and nothing to teach, then all things like this are not to be seen or grasped.",
        "source": "T11n0310_050:0296b07_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_050:0296b09_6"
    },
    {
        "source_sentence": "一切諸法皆是一相，所謂無相。",
        "translation": "All dharmas are all one characteristic, which is called signlessness.",
        "source": "T11n0310_050:0296b09_7"
    },
    {
        "source_sentence": "「又舍利子！",
        "translation": "Again, Śāriputra!",
        "source": "T11n0310_050:0296b11_0"
    },
    {
        "source_sentence": "一切諸法性本無相。",
        "translation": "All dharmas are originally without marks in their nature.",
        "source": "T11n0310_050:0296b11_1"
    },
    {
        "source_sentence": "若有菩薩說於無相，是則無相還應可說。",
        "translation": "If a bodhisattva teaches that there are no characteristics, then the absence of characteristics should also be explained.",
        "source": "T11n0310_050:0296b11_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_050:0296b12_3"
    },
    {
        "source_sentence": "無相有相皆無相故，不可說言此為有相、此為無相。",
        "translation": "Because signlessness and signlessness are both signless, it can't be said that this is signlessness or signlessness.",
        "source": "T11n0310_050:0296b12_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0296b14_0"
    },
    {
        "source_sentence": "若有菩薩摩訶薩能悟如是一切法相，即是無相，不可得見、不可執取、如法了知，",
        "translation": "“If there is any bodhisattva-mahāsattva who can realize the characteristics of all these things, that is to say, they have no characteristics, cannot be seen, cannot be grasped, and are known according to the teachings.",
        "source": "T11n0310_050:0296b14_1"
    },
    {
        "source_sentence": "是名正行。",
        "translation": "This is called right practice.",
        "source": "T11n0310_050:0296b16_2"
    },
    {
        "source_sentence": "菩薩摩訶薩勤修如是正法行已，當於諸法證入無障照明之慧。",
        "translation": "After diligently cultivating these right teachings, the bodhisattva Mahāsattva will realize the wisdom of unobstructed illumination when he enters into all dharmas.",
        "source": "T11n0310_050:0296b16_3"
    },
    {
        "source_sentence": "如是舍利子！",
        "translation": "So it is, Śāriputra!",
        "source": "T11n0310_050:0296b17_4"
    },
    {
        "source_sentence": "是名菩薩摩訶薩般若波羅蜜多正行之相。」",
        "translation": "This is called the characteristic of the correct practice of the bodhisattva-mahāsattva prajñāpāramitā.",
        "source": "T11n0310_050:0296b18_5"
    },
    {
        "source_sentence": "「安住正行聰叡者，　　於菩薩藏善決定，",
        "translation": "Those who abide in correct practice are wise and well-determined in the treasury of enlightenment.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　此人於法不起執，　　無執取行相如是。",
        "translation": "This person doesn't cling to things, and thus they don't cling to the characteristics of their actions.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　證得諸法不為空，　　非於諸法空平等，",
        "translation": "He realizes that all things are not empty, and doesn’t equanimity toward the emptiness of things.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　又非空法有所執，　　無執正行相如是。",
        "translation": "Furthermore, it's not that the teaching of emptiness has attachment, and there's no attachment to the correct aspect of practice like this.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　於法無取亦無捨，　　亦非取法以為法，",
        "translation": "There is neither grasping of things nor relinquishment, Nor does he take things as things.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　無取是名諸法相，　　無取正行相如是。",
        "translation": "The absence of grasping is called the characteristics of all things, and so is the right practice of the absence of grasping.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　若於諸法智無礙，　　此智無有不焚燒，",
        "translation": "If one’s knowledge of all truths is unhindered, There is nothing in this knowledge that isn’t burned.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　於焚燒智無所執，　　諸法正行相如是。",
        "translation": "The knowledge of burning has no attachment: Such are the characteristics of right action of all things.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　智者安住遠離德，　　於法應起勤精進，",
        "translation": "A wise person who abides in seclusion from virtue Should give rise to diligence and zeal toward the Teaching.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　若能依止軌則行，　　爾時當入清淨門。",
        "translation": "If you can follow the rules and practice based on them, then you'll enter the pure gate.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　是清淨門通諸法，　　亦了有情諸欲解，",
        "translation": "This gate of purity penetrates all things, And also understands the desires and understandings of sentient beings.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　智者雖知無所觀，　　而能演宣如是法。",
        "translation": "A wise person, though knowing nothing to contemplate, Yet can expound such a teaching.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　於甚深法了勝義，　　常於深義勝決擇，",
        "translation": "Understanding the ultimate meaning of the profound truth, They always make a decisive determination for its ultimate meaning.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　踊現無邊功德行，　　明智多聞如大海。",
        "translation": "They manifest boundless virtuous deeds; Their knowledge and wisdom are as widely learned as the great ocean.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　於彼所說諸文義，　　究竟無能證得者，",
        "translation": "In all the syllables and meanings they teach Ultimately there is no one who can realize them.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "　以彼文義俱無邊，　　真實正行恒無動。",
        "translation": "Because their words and meanings are both boundless, Their true and correct practice always remains unmoving.",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說頌曰：「復次舍利子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Furthermore, Śāriputra!",
        "source": "T11n0310_050:0296b19_6"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，於菩薩藏微妙法門殷重聽聞，乃至為他如法說已，",
        "translation": "“When great enlightening beings practice the prajñāpāramitā, they listen attentively to the subtle teaching of the treasury of enlightenment and expound it for others.",
        "source": "T11n0310_050:0296c07_7"
    },
    {
        "source_sentence": "當知是菩薩摩訶薩於一切法獲得光明，能破一切無明黑闇及諸翳膜。",
        "translation": "You should know that this bodhisattva Mahāsattva attains light in all dharmas and can destroy all the darkness of ignorance and the coarse membranes.",
        "source": "T11n0310_050:0296c09_8"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0296c10_9"
    },
    {
        "source_sentence": "如是光明即為智慧。",
        "translation": "Such light is wisdom.",
        "source": "T11n0310_050:0296c11_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_050:0296c11_11"
    },
    {
        "source_sentence": "善不善法皆能明了如實知故。",
        "translation": "Good and unskillful qualities can all be clearly understood as they really are because they're known.",
        "source": "T11n0310_050:0296c11_12"
    },
    {
        "source_sentence": "是菩薩摩訶薩修如是法獲明慧已，乃至命難眾苦因緣，決定不造諸不善法。",
        "translation": "After cultivating such a teaching, the bodhisattva Mahāsattva attains insight and wisdom, up to the point where his life is difficult and painful for various reasons, and he's certain that he won't create unwholesome things.",
        "source": "T11n0310_050:0296c12_13"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0296c14_14"
    },
    {
        "source_sentence": "是菩薩摩訶薩為欲永滅不善法故，隨所聞法極善通達，既通達已是則說為牟尼寂靜。",
        "translation": "Because the bodhisattva Mahāsattva wants to permanently extinguish unwholesome dharmas, he follows the teachings he hears and thoroughly comprehends them, and once he has comprehended them, then he says it's called the",
        "source": "T11n0310_050:0296c14_15"
    },
    {
        "source_sentence": "如是舍利子！",
        "translation": "So it is, Śāriputra!",
        "source": "T11n0310_050:0296c16_16"
    },
    {
        "source_sentence": "是名菩薩摩訶薩修行般若波羅蜜多時正行之相。」",
        "translation": "This is called the mark of a bodhisattva-mahāsattva who correctly practices the prajñāpāramitā when he cultivates it.",
        "source": "T11n0310_050:0296c16_17"
    },
    {
        "source_sentence": "「如人入闇室，　　覆蔽絕光明，",
        "translation": "“Suppose a person enters a room of darkness, Overwhelmed and blinded by light.",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "　雖有眾色像，　　非明眼所見。",
        "translation": "Even though there are many forms and images, they aren't seen by the clear eye.",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "　如是雖有人，　　內具諸明解，",
        "translation": "Thus, even though there are people who have all these insights and understandings internally,",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "　不聞於正法，　　善惡何能曉？",
        "translation": "If they don't hear the right teaching, how can good and evil be discerned?",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "　多聞解了法，　　多聞不造惡，",
        "translation": "A well-versed one understands the teaching, and a well-versed one doesn’t do evil.",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "　多聞捨無義，　　多聞得涅槃。",
        "translation": "much-versed renunciation has no meaning, and much-versed attainment of nirvāṇa.",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "　善聽增長聞，　　聞能增長慧，",
        "translation": "Good listening increases hearing, and hearing can increase wisdom.",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "　慧能修淨義，　　得義能招樂。",
        "translation": "Wisdom cultivates the meaning of purity, and attaining meaning brings happiness.",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "　聰慧得義已，　　證現法涅槃，",
        "translation": "The wise, having attained meaning, Realize nirvana in the present life.",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "　淨覺法相應，　　證得第一樂。",
        "translation": "Concomitant with the principle of pure awakening, he realizes the first bliss.",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "　聞菩薩藏已，　　正法善安住，",
        "translation": "Having heard of the treasury of enlightening beings, They are well settled in truth.",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "　為世大光明，　　行菩提妙行。",
        "translation": "In order to be the great light of the world, he practices the marvelous practice of enlightenment.",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說頌曰：「復次舍利子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Furthermore, Śāriputra!",
        "source": "T11n0310_050:0296c17_18"
    },
    {
        "source_sentence": "菩薩摩訶薩為欲修行般若波羅蜜多故，於能受持菩薩藏經正行人所深起敬心善知識想。",
        "translation": "Because they want to cultivate the perfection of prajñāpāramitā, bodhisattvas and mahāsattvas deeply respectfully give rise to the thought of a good teacher who can accept and uphold the bodhisattva's store of sūtras",
        "source": "T11n0310_050:0297a02_19"
    },
    {
        "source_sentence": "既生想已，又於大菩薩藏微妙法門倍復尋求，令此法門轉增明淨。",
        "translation": "After they give rise to the perception, they also search twice over the subtle Dharma aspect of the great bodhisattva store and cause this Dharma aspect to become increasingly luminous and pure.",
        "source": "T11n0310_050:0297a04_20"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0297a05_21"
    },
    {
        "source_sentence": "是菩薩摩訶薩為求菩薩藏故，發生信欲、策勵正勤、撿攝其心令定安住。",
        "translation": "Because they seek the bodhisattva-mahāsattva's store of the bodhisattva, they develop faith and desire, exert right effort, and collect their minds so that they are concentrated and stable.",
        "source": "T11n0310_050:0297a06_22"
    },
    {
        "source_sentence": "是菩薩摩訶薩於四正斷方便修成，一切法中得無障礙。",
        "translation": "This is the bodhisattva Mahāsattva who cultivates the four methods of correctly eliminating all dharmas and attains unobstructedness in all dharmas.",
        "source": "T11n0310_050:0297a07_23"
    },
    {
        "source_sentence": "如是舍利子，是名菩薩摩訶薩般若波羅蜜多正行之相。」",
        "translation": "Thus, Śāriputra, this is called the characteristic of the correct practice of the bodhisattva-mahāsattva prajñāpāramit.",
        "source": "T11n0310_050:0297a09_24"
    },
    {
        "source_sentence": "「所謂說法者，　　即為善知識，",
        "translation": "“The so-called preacher of the Dharma is a good teacher,",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　恭敬聽聞法，　　安住於正行。",
        "translation": "Respectfully listening to the teaching, they'll abide in right practice.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　欲解常無退，　　精進常高勇，",
        "translation": "Their aspiration for enlightenment is always unregressing, And their vigor is always lofty and courageous.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　淨慧常修治，　　於智常安住。",
        "translation": "Their pure wisdom is always cultivated, and they always abide in knowledge.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　自然達諸法，　　不隨於信行，",
        "translation": "They naturally understand all dharmas And do not follow the ways of faith.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　以智觀於法，　　是為諸佛說。",
        "translation": "Observing the Dharma with wisdom is what the buddhas teach.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　智者分別句，　　趣義善加學，",
        "translation": "A wise person discerns the meaning of words, which are well trained in the meaning of destinies.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　於白黑品等，　　常修常遠離。",
        "translation": "They are always cultivating and always avoiding such things as whiteness, blackness, etc.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　心曾無厭倦，　　於法無退沒，",
        "translation": "Their minds are never weary, And they do not regress from the Teaching.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　身欲並輕安，　　速得心精進。",
        "translation": "Their bodies and desires are both light and peaceful, and they quickly attain mental effort.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　由聞法增智，　　智增無退念，",
        "translation": "As a result of hearing the Dharma they increase in knowledge, And their knowledge increases without any retrogression.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　智恒依念住，　　了知淨穢法。",
        "translation": "Consciousness always rests on mindfulness, Understanding the principle of purity and impurity.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　學於無上法，　　趣勝念慧力，",
        "translation": "He trains in the supreme teaching, heading for the power of superior mindfulness and wisdom.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　了眾生欲解，　　自學於長夜。",
        "translation": "Understanding that sentient beings want to understand, he trains for a long time on his own.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　學法已昇進，　　極進智清淨，",
        "translation": "Having studied the teachings, they will rise and advance. Their supremely advanced knowledge will be purified.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "　了眾生欲解，　　如解便開示。",
        "translation": "Understanding the desires of sentient beings to understand, he reveals them as they understand.",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義而說頌曰：「復次舍利子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Furthermore, Śāriputra!",
        "source": "T11n0310_050:0297a10_25"
    },
    {
        "source_sentence": "菩薩摩訶薩修行般若波羅蜜多時，於菩薩藏微妙法門如是尋求通達覺慧，",
        "translation": "“When great enlightening beings practice the prajñāpāramitā, they thus seek to penetrate and awaken the buddha-knowledge of the subtle dharmas of the enlightening being’s store.",
        "source": "T11n0310_050:0297a28_26"
    },
    {
        "source_sentence": "依是清淨善法明門，菩薩常應如是修學。",
        "translation": "Based on this clear approach of purifying good qualities, bodhisattvas should always cultivate it in this way.",
        "source": "T11n0310_050:0297b01_27"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0297b02_0"
    },
    {
        "source_sentence": "若有菩薩摩訶薩於法修學，應作是念：『二因二緣能發正見。",
        "translation": "If there are bodhisattvas, mahāsattvas who cultivate the Dharma, they should think, 'Two causes and two conditions can give rise to right view.",
        "source": "T11n0310_050:0297b02_1"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T11n0310_050:0297b03_2"
    },
    {
        "source_sentence": "所謂從他聞音及以內自如理作意。』",
        "translation": "It's called following the sounds heard from others and internally focusing on oneself according to principle.'",
        "source": "T11n0310_050:0297b03_3"
    },
    {
        "source_sentence": "彼復思惟：『從他聞音、如理作意，為何等相？』",
        "translation": "Again, he thinks, 'What's the characteristic of hearing sounds and correctly contemplating what they are from others?'",
        "source": "T11n0310_050:0297b04_4"
    },
    {
        "source_sentence": "尋重思惟：『若有樂定修相應行諸菩薩等，未曾聽聞大菩薩藏微妙法門，",
        "translation": "“If there are enlightening beings who take delight in the practice of concentration associated with cultivation, they have never heard of the subtle teaching of the great treasury of enlightening beings.",
        "source": "T11n0310_050:0297b05_5"
    },
    {
        "source_sentence": "又不聽聞聖法律教，但於三摩地中生知足想。",
        "translation": "They don't hear the noble teachings of the Dharma but simply give rise to the perception of contentment in samādhi.",
        "source": "T11n0310_050:0297b07_6"
    },
    {
        "source_sentence": "當知是人以慢力故起增上慢，我說是人不能解脫生老病死愁歎憂苦諸熱惱等。",
        "translation": "You should know that this person gives rise to excessive pride because of the power of conceit, and I say that person can't be liberated from birth, old age, illness, death, sorrow, grief, pain, fever, and so forth.",
        "source": "T11n0310_050:0297b08_7"
    },
    {
        "source_sentence": "既不脫諸熱惱等苦，豈得脫彼五門生死？",
        "translation": "Since they aren't liberated from the suffering of fever and so forth, how can they be liberated from the fivefold birth-and-death?",
        "source": "T11n0310_050:0297b10_8"
    },
    {
        "source_sentence": "為之沈溺流轉不息。",
        "translation": "They are submerged in it, and the flow doesn't stop.",
        "source": "T11n0310_050:0297b11_9"
    },
    {
        "source_sentence": "是諸眾生實非解脫而便自謂我已解脫，實未離苦而便自謂出離眾苦。",
        "translation": "These sentient beings really aren't liberated and then say to themselves, 'I've been liberated,' but they really aren't free of suffering and then claim to be free of the many kinds of suffering.",
        "source": "T11n0310_050:0297b11_10"
    },
    {
        "source_sentence": "是故如來依是人故如實說法，若能從他隨順聽聞，是則解脫諸老死等。』",
        "translation": "Therefore, the Tathāgata relies on this person to explain the teaching as it really is, and if he can follow and hear it from others, then he's liberated from old age and death.'",
        "source": "T11n0310_050:0297b13_11"
    },
    {
        "source_sentence": "「『「多聞解了法，　　多聞不造惡，",
        "translation": "Having heard the Dharma well, they understand it well; Having heard much, they do not do evil.",
        "source": "T11n0310_050:0297b14_12"
    },
    {
        "source_sentence": "　　　多聞捨無義，　　多聞得涅槃。",
        "translation": "much-versed renunciation has no meaning, and much-versed attainment of nirvāṇa.",
        "source": "T11n0310_050:0297b14_12"
    },
    {
        "source_sentence": "　　　善聽增長聞，　　聞能增長慧，",
        "translation": "Good listening increases hearing, and hearing can increase wisdom.",
        "source": "T11n0310_050:0297b14_12"
    },
    {
        "source_sentence": "　　　慧能修淨義，　　得義能招樂。",
        "translation": "Wisdom cultivates the meaning of purity, and attaining meaning brings happiness.",
        "source": "T11n0310_050:0297b14_12"
    },
    {
        "source_sentence": "　　　聰慧得義已，　　證現法涅槃，",
        "translation": "The wise, having attained meaning, Realize nirvana in the present life.",
        "source": "T11n0310_050:0297b14_12"
    },
    {
        "source_sentence": "　　　聞法淨黠慧，　　證得第一樂。」』",
        "translation": "He hears the Dharma with pure intelligence and attains the first bliss.'",
        "source": "T11n0310_050:0297b14_12"
    },
    {
        "source_sentence": "復作是言：『如我先聞薄伽梵說：「是故舍利子！",
        "translation": "Again, he said, 'Suppose I had previously heard the Bhagavān say, Therefore, Śāriputra!",
        "source": "T11n0310_050:0297b14_12"
    },
    {
        "source_sentence": "諸菩薩摩訶薩如是思已，當於大菩薩藏微妙法門，及以聖法毘奈耶教，",
        "translation": "“Those bodhisattvas and mahāsattvas who think thus should contemplate the subtle teachings of the great enlightening being’s treasury of enlightenment, as well as the teachings of the holy Dharma and the code of",
        "source": "T11n0310_050:0297b22_13"
    },
    {
        "source_sentence": "殷重聽聞受持讀誦，廣為他人敷演開示。",
        "translation": "He respectfully listens, retains, recites, and explains it extensively for others.",
        "source": "T11n0310_050:0297b23_14"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0297b25_0"
    },
    {
        "source_sentence": "若諸含識於菩薩藏微妙法門雖復聽聞，而不如理方便作意，當知是人於彼聖道不能正行。",
        "translation": "If those conscious beings who hear and contemplate the subtle teaching of the bodhisattva collection but don't correctly practice it with skillful means, you should know that person can't correctly practice the noble path.",
        "source": "T11n0310_050:0297b25_1"
    },
    {
        "source_sentence": "是故如來依是人故說正法要，作如是言，若欲解脫生老病死，當具內自如理思惟。",
        "translation": "That's why the Tathāgata relies on this person to explain the essentials of the right teaching and says, If you want to be liberated from birth, old age, illness, and death, you must fully contemplate it yourself according to principle.",
        "source": "T11n0310_050:0297b27_2"
    },
    {
        "source_sentence": "諸菩薩等應如是學。",
        "translation": "Bodhisattvas and so forth should thus train.",
        "source": "T11n0310_050:0297b29_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0297b29_4"
    },
    {
        "source_sentence": "云何名為如理方便？",
        "translation": "What's called the method of following principle?",
        "source": "T11n0310_050:0297b29_5"
    },
    {
        "source_sentence": "何等菩薩如理作意而能修學？",
        "translation": "What kind of bodhisattva can cultivate it with correct attention?",
        "source": "T11n0310_050:0297c01_6"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0297c02_7"
    },
    {
        "source_sentence": "菩薩摩訶薩如理方便者，無有一法若合若離。",
        "translation": "The bodhisattva Mahāsattva's method of following the principle is that there's no single thing that combines or separates.",
        "source": "T11n0310_050:0297c02_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_050:0297c03_9"
    },
    {
        "source_sentence": "如理方便非方便故。",
        "translation": "It's because the method of following the principle is not the method.",
        "source": "T11n0310_050:0297c03_10"
    },
    {
        "source_sentence": "又舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0297c04_0"
    },
    {
        "source_sentence": "菩薩摩訶薩若有安住如理方便及作意者，當知此相但是音聲，而此音聲性無所起亦不轉起，",
        "translation": "“Furthermore, if great enlightening beings abide in correct effort and attention, they should know that these characteristics are only sounds, whereas the nature of those sounds has no arising and no turning.",
        "source": "T11n0310_050:0297c04_1"
    },
    {
        "source_sentence": "及由彼故而發音聲。",
        "translation": "It's because of that that that sound that it gives rise to its sound.",
        "source": "T11n0310_050:0297c06_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0310_050:0297c06_3"
    },
    {
        "source_sentence": "彼一切皆不可得故。",
        "translation": "It's because all of them are unobtainable.",
        "source": "T11n0310_050:0297c07_4"
    },
    {
        "source_sentence": "又復菩薩觀是音聲前際後際，從何而生滅往何所？",
        "translation": "Again, the bodhisattva observes that this sound is before and after the end of time, where does it come from and where does it go?",
        "source": "T11n0310_050:0297c07_5"
    },
    {
        "source_sentence": "如是觀察了不可得。",
        "translation": "Such an observation is unobtainable.",
        "source": "T11n0310_050:0297c08_6"
    },
    {
        "source_sentence": "又更推求如此聲者，為在已說、為在今說、為在當說？",
        "translation": "Furthermore, if someone were to presume such a sound, would they say what has been said, what will be said now, or what will be said in the future?",
        "source": "T11n0310_050:0297c09_7"
    },
    {
        "source_sentence": "又重推求如是聲者，若已所說、若今所說、若當所說？",
        "translation": "Also, if someone repeatedly deduces such sounds, then what has been taught, what is taught now, and what will be taught?",
        "source": "T11n0310_050:0297c10_8"
    },
    {
        "source_sentence": "如是聲者，若為斷故已說、若為斷故今說、若為斷故當說？",
        "translation": "If this sound is spoken of for the sake of abandoning, it has already been spoken of. If it is spoken of now for the sake of abandoning, it will be spoken of later.",
        "source": "T11n0310_050:0297c11_9"
    },
    {
        "source_sentence": "如是聲者，若為證故已說、若為證故今說、若為證故當說？",
        "translation": "If this sound has been spoken of for the sake of realization, is it now spoken of for the sake of realization or will it be spoken of for the sake of realization?",
        "source": "T11n0310_050:0297c12_10"
    },
    {
        "source_sentence": "是菩薩如是一切尋求聲已都無得者，又更觀察，若過去相、若未來相、若現在相，",
        "translation": "“Furthermore, the enlightening being Universally Good observes past, future, and present marks of all those who seek such sounds.",
        "source": "T11n0310_050:0297c14_11"
    },
    {
        "source_sentence": "如是觀已皆不可得。",
        "translation": "After observing them in this way, they're all unobtainable.",
        "source": "T11n0310_050:0297c15_12"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0297c16_13"
    },
    {
        "source_sentence": "若菩薩摩訶薩如是正觀察時，是名如理方便作意。",
        "translation": "If a bodhisattva-mahāsattva thus correctly observes it, this is called the contemplation of skillful means according to principle.",
        "source": "T11n0310_050:0297c16_14"
    },
    {
        "source_sentence": "是故如理方便菩薩摩訶薩，於如是觀應具修學。",
        "translation": "Therefore, the bodhisattva Mahāsattva according to principle and skillful means should cultivate this kind of contemplation in detail.",
        "source": "T11n0310_050:0297c17_15"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0297c19_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩如理觀耶？",
        "translation": "What is the bodhisattva-mahāsattva's correct contemplation?",
        "source": "T11n0310_050:0297c19_1"
    },
    {
        "source_sentence": "諸菩薩等云何應學？",
        "translation": "How should bodhisattvas and so forth be trained?",
        "source": "T11n0310_050:0297c19_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0297c20_3"
    },
    {
        "source_sentence": "是菩薩摩訶薩觀一切法自性息滅，若如是觀名如理觀。",
        "translation": "This is the bodhisattva Mahāsattva observing the cessation of the self-nature of all dharmas, and if he observes them in this way, he's called observing them according to principle.",
        "source": "T11n0310_050:0297c20_4"
    },
    {
        "source_sentence": "若觀諸法自性寂靜，是則名為如理正觀。",
        "translation": "If someone observes the quiescence of the self-nature of dharmas, this is called correctly observing them according to principle.",
        "source": "T11n0310_050:0297c21_5"
    },
    {
        "source_sentence": "若觀諸法畢竟空寂，是則名為如理正觀。",
        "translation": "If someone observes that all dharmas are ultimately empty and quiescent, this is called correctly observing them according to principle.",
        "source": "T11n0310_050:0297c22_6"
    },
    {
        "source_sentence": "若觀諸法入平等性，是則名為如理正觀。",
        "translation": "If someone observes that all dharmas enter into equality, this is called correctly observing them according to principle.",
        "source": "T11n0310_050:0297c23_7"
    },
    {
        "source_sentence": "若觀諸法畢竟無生，是則名為如理正觀。",
        "translation": "If someone observes that all dharmas are ultimately unarisen, this is called correctly observing them according to principle.",
        "source": "T11n0310_050:0297c24_8"
    },
    {
        "source_sentence": "若觀諸法畢竟不生，是則名為如理正觀。",
        "translation": "If someone observes that all dharmas ultimately don't arise, this is called correctly observing them according to principle.",
        "source": "T11n0310_050:0297c25_9"
    },
    {
        "source_sentence": "若觀諸法畢竟不起，是則名為如理正觀。",
        "translation": "If someone observes that all dharmas ultimately don't arise, this is called correctly observing them according to principle.",
        "source": "T11n0310_050:0297c26_10"
    },
    {
        "source_sentence": "若觀諸法畢竟寂滅，是則名為如理正觀。",
        "translation": "If someone observes the ultimate extinction of all dharmas, this is called correctly observing them according to principle.",
        "source": "T11n0310_050:0297c27_11"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0297c28_12"
    },
    {
        "source_sentence": "是菩薩摩訶薩作是觀時，亦不見有能觀之者。",
        "translation": "When this bodhisattva Mahāsattva thus observes it, he doesn't see anyone who can observe it.",
        "source": "T11n0310_050:0297c28_13"
    },
    {
        "source_sentence": "應如是觀，所謂非觀非不觀故。",
        "translation": "They should be observed in this way: because they are said to be neither observed nor not observed.",
        "source": "T11n0310_050:0297c29_14"
    },
    {
        "source_sentence": "若有菩薩作是觀者名如理觀，若他觀者名非理觀。",
        "translation": "If a bodhisattva does this kind of contemplation, he's called observing what's according to principle, and if someone else observes it, they're called observing what's not according to principle.",
        "source": "T11n0310_050:0298a01_15"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0310_050:0298a03_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩應學如是如理方便？",
        "translation": "How should bodhisattvas, mahāsattvas, train in such a method according to principle?",
        "source": "T11n0310_050:0298a03_1"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0298a04_2"
    },
    {
        "source_sentence": "菩薩摩訶薩如理方便者，非於少法有愚迷故。",
        "translation": "The bodhisattva Mahāsattva's method of following the principle is not because he has delusion about a few things.",
        "source": "T11n0310_050:0298a04_3"
    },
    {
        "source_sentence": "如理方便者，非於少法而生障礙。",
        "translation": "A method that's according to principle is not an obstruction that arises from a few things.",
        "source": "T11n0310_050:0298a05_4"
    },
    {
        "source_sentence": "如理方便者，無有少法非解脫門。",
        "translation": "There's no little thing that isn't the gate of liberation like the method of following the principle.",
        "source": "T11n0310_050:0298a06_5"
    },
    {
        "source_sentence": "如理方便者，無有為斷少分法故發勤精進。",
        "translation": "It's because there are no conditioned dharmas that cut off a small part of the teaching and therefore give rise to diligence and effort.",
        "source": "T11n0310_050:0298a06_6"
    },
    {
        "source_sentence": "如理方便者，不為證少法故勇勵正勤。",
        "translation": "Those who practice according to principle and skillful means are courageous and correctly diligent because they don't realize the few dharmas.",
        "source": "T11n0310_050:0298a07_7"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0298a08_8"
    },
    {
        "source_sentence": "菩薩摩訶薩應以如是如理正見，如其所見正觀諸法。",
        "translation": "A bodhisattva-mahāsattva should thus correctly see things as they are and correctly contemplate them according to their views.",
        "source": "T11n0310_050:0298a09_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0298a10_1"
    },
    {
        "source_sentence": "云何名為如其所見正觀諸法？",
        "translation": "What's called correctly observing the dharmas as they see them?",
        "source": "T11n0310_050:0298a10_2"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0298a11_3"
    },
    {
        "source_sentence": "謂無所見名觀諸法。",
        "translation": "It's called observing the dharmas without seeing anything.",
        "source": "T11n0310_050:0298a11_4"
    },
    {
        "source_sentence": "何等是為無所見耶？",
        "translation": "What's the absence of views?",
        "source": "T11n0310_050:0298a11_5"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0298a12_6"
    },
    {
        "source_sentence": "無所見者名為無生，言無生者是為無起，言無起者名無所照。",
        "translation": "Those who see nothing are called nonarising, and those who say there's no arising are called nonarising; those who say there's no arising are called not illuminating anything.",
        "source": "T11n0310_050:0298a12_7"
    },
    {
        "source_sentence": "是故如來依是正法說如是言，若有菩薩觀一切行見無生時，即是趣入正性決定。",
        "translation": "Therefore, if a bodhisattva observes all conditioned things and sees nonproduction, that's when he enters into the correct nature of enlightenment.",
        "source": "T11n0310_050:0298a13_8"
    },
    {
        "source_sentence": "夫正見者謂能趣入正性決定。",
        "translation": "A correct view is defined as someone who's able to enter with certainty about the rightness of their true nature.",
        "source": "T11n0310_050:0298a15_9"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0298a16_10"
    },
    {
        "source_sentence": "彼菩薩摩訶薩作是思惟：『何因緣故當得趣入正性決定？』",
        "translation": "That bodhisattva Mahāsattva thinks, 'What causes and conditions will make it possible to enter the righteousness with certainty?'",
        "source": "T11n0310_050:0298a16_11"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0298a18_12"
    },
    {
        "source_sentence": "菩薩摩訶薩應如是學，若觀我見為平等者，即是一切諸法平等。",
        "translation": "A bodhisattva-mahāsattva should thus train, and if he observes the view of self as equality, it means that all things are equal.",
        "source": "T11n0310_050:0298a18_13"
    },
    {
        "source_sentence": "若作是觀，當知趣入正性決定。",
        "translation": "If someone observes this, they should know that the righteousness of entry is certain.",
        "source": "T11n0310_050:0298a19_14"
    },
    {
        "source_sentence": "是故諸菩薩摩訶薩若欲趣入正性決定者，當於如是大菩薩藏微妙法門，",
        "translation": "Therefore, if the bodhisattvas and mahāsattvas want to enter the true nature with certainty, they should follow this subtle teaching of the treasury of great enlightenment.",
        "source": "T11n0310_050:0298a20_15"
    },
    {
        "source_sentence": "殷重聽聞受持讀誦研窮義趣，復應為他如法廣說，便當於是法門如理方便作意修學。",
        "translation": "They should earnestly hear, retain, recite, and study the meaning of this teaching, and they should also explain it extensively for others in accordance with the teaching, so that they will then contemplate and cultivate these teachings according to their principles",
        "source": "T11n0310_050:0298a22_16"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0310_050:0298a24_17"
    },
    {
        "source_sentence": "如是名為菩薩摩訶薩為阿耨多羅三藐三菩提故修行般若波羅蜜多行菩薩行。",
        "translation": "Thus, this is called the bodhisattva-mahāsattva who cultivates the bodhisattva practice of prajñāpāramitā for the sake of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0310_050:0298a24_18"
    },
    {
        "source_sentence": "大寶積經卷第五十",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 50",
        "source": "T11n0310_050:0298a27_0"
    }
]