[
    {
        "source_sentence": "佛說大乘十法經",
        "translation": "Sutra on the Ten Teachings of the Great Vehicle",
        "source": "T11n0314_001:0764a15_0"
    },
    {
        "source_sentence": "梁扶南三藏僧伽婆羅譯",
        "translation": "Liang Translation of the Sanzang saṃghâvarāṣa in Funan",
        "source": "T11n0314_001:0764a17_0"
    },
    {
        "source_sentence": "如是我聞：一時佛住王舍城耆闍崛山中，與大比丘五千人俱，無量菩薩眾。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Mount Gṛdhrakūṭa in Rājagṛha, accompanied by five thousand great bhikṣus and an immeasurable multitude of bodhisattvas.",
        "source": "T11n0314_001:0764a18_0"
    },
    {
        "source_sentence": "爾時彼大菩薩眾中，有菩薩摩訶薩，名曰淨無垢妙淨寶月王光，集彼菩薩大眾中。",
        "translation": "Among those great bodhisattvas, there was a bodhisattva Mahāsattva named Pure, Immaculate, Wonderfully Pure Jeweled Moon King Light who assembled in that bodhisattva's congregation.",
        "source": "T11n0314_001:0764a19_1"
    },
    {
        "source_sentence": "爾時淨無垢妙淨寶月王光菩薩摩訶薩，即從坐起，捨蓮花臺往至佛所，",
        "translation": "It was then that the great enlightening being Pure, Immaculate, Sublime, Wonderfully Pure Jeweled Moon King Light of the Buddha rose from his seat and left the lotus-flower dais to go to the place where the Buddha was.",
        "source": "T11n0314_001:0764a21_2"
    },
    {
        "source_sentence": "偏袒右肩，右膝著地，合掌白佛言：「世尊！",
        "translation": "He bared his right shoulder, knelt with his right knee on the ground, joined his palms together, and said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0764a23_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0764a24_4"
    },
    {
        "source_sentence": "大乘比丘，住大乘比丘者，何故名住大乘比丘？",
        "translation": "A great vehicle monk who lives as a great vehicle monk, why is he called a monk who lives as a great vehicle monk?",
        "source": "T11n0314_001:0764a24_5"
    },
    {
        "source_sentence": "復以何義故，此大乘名曰大乘？」",
        "translation": "What is the reason this great vehicle is called the great vehicle?",
        "source": "T11n0314_001:0764a25_6"
    },
    {
        "source_sentence": "爾時世尊告淨無垢妙淨寶月王光菩薩摩訶薩言：「善哉，善哉！",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva Mahāsattva King of Pure, Immaculate, Wonderfully Pure Jeweled Moon King Light, saying, Good, good!",
        "source": "T11n0314_001:0764a26_0"
    },
    {
        "source_sentence": "淨無垢妙淨寶月王光！",
        "translation": "Pure, undefiled, marvelous, pure jeweled moon king light!",
        "source": "T11n0314_001:0764a27_1"
    },
    {
        "source_sentence": "汝能問如來此甚深妙義。",
        "translation": "You can ask the Tathāgata about this profound and marvelous meaning.",
        "source": "T11n0314_001:0764a27_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0764a28_3"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。」",
        "translation": "Consider it well, and I will explain it for you in a discriminating way.",
        "source": "T11n0314_001:0764a28_4"
    },
    {
        "source_sentence": "爾時淨無垢妙淨寶月王光菩薩白佛言：「世尊！",
        "translation": "It was then that the pure, undefiled, marvelously pure jeweled moon king of light bodhisattva said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0764a29_5"
    },
    {
        "source_sentence": "如尊教！」",
        "translation": "As the Bhagavān teaches!",
        "source": "T11n0314_001:0764b01_6"
    },
    {
        "source_sentence": "爾時世尊告淨無垢妙淨寶月王光菩薩言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the pure, undefiled, marvelously pure jeweled moon king of light bodhisattva, saying, Good sons!",
        "source": "T11n0314_001:0764b01_7"
    },
    {
        "source_sentence": "菩薩摩訶薩成就十法，名住大乘。",
        "translation": "When bodhisattvas and mahāsattvas accomplish ten things, they're called abiding in the great vehicle.",
        "source": "T11n0314_001:0764b02_8"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T11n0314_001:0764b03_9"
    },
    {
        "source_sentence": "所謂成就正信，成就行，成就性，樂菩提心，樂法，樂觀正法，行於正法及順法，",
        "translation": "They are the accomplishment of right faith, the accomplishment of practice, the accomplishment of essence, delight in the determination for enlightenment, delight in the teaching, delight in contemplation of the true teaching, and practice the true teaching and the",
        "source": "T11n0314_001:0764b03_10"
    },
    {
        "source_sentence": "遠離慢我慢等事，善好通達諸微密語，不樂聲聞及緣覺等。",
        "translation": "They are free of such things as conceit and self-conceit, well understand subtle esoteric sayings, and don't delight in śrāvakas and pratyekbuddhas.",
        "source": "T11n0314_001:0764b05_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0764b06_12"
    },
    {
        "source_sentence": "菩薩摩訶薩成就如是十法，名住大乘。",
        "translation": "When bodhisattvas and mahāsattvas accomplish these ten things, they're called abiding in the great vehicle.",
        "source": "T11n0314_001:0764b07_13"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0764b07_14"
    },
    {
        "source_sentence": "菩薩摩訶薩成就不諂曲、柔和行、柔和行，彼能信諸佛如來正真正覺無上菩提，",
        "translation": "“Great enlightening beings develop unbending, gentle, and patient practices; they are able to believe in the buddhas, Buddhas, Tathāgatas, and true enlightenment.",
        "source": "T11n0314_001:0764b08_15"
    },
    {
        "source_sentence": "善能信一念中三世諸佛智，信如來藏不斷常、不老死、不可盡，亦信實際法界、一切種智、一切種智相、諸力、無畏、不共佛法。",
        "translation": "They can well believe in the knowledge of the buddhas of the three times in a single thought, believe that the treasury of the Tathāgata doesn't stop being permanent, doesn't grow old and die, and is inexhaustible, and believe in",
        "source": "T11n0314_001:0764b09_16"
    },
    {
        "source_sentence": "復信諸佛如來不可灌頂，亦信三十二大人之相、八十妙好、圓光等法。",
        "translation": "They also believe that the buddha-tathāgatas can't be consecrated, and they also believe in the thirty-two great forms, eighty marvelous features, perfect light, and other dharmas.",
        "source": "T11n0314_001:0764b12_17"
    },
    {
        "source_sentence": "復信聲聞所說，或緣覺所說，菩薩及餘所說，亦信世間及出世間，復信正行行者，",
        "translation": "“Furthermore, they also believe what the śrāvakas teach, or what the pratyekabuddhas teach. The bodhisattvas and others teach. They also believe in both mundane and transmundane. Furthermore, they believe in the",
        "source": "T11n0314_001:0764b14_18"
    },
    {
        "source_sentence": "順行等沙門及婆羅門，亦信諸善根業報，最勝上愛果，若天、天王，若人、人王。",
        "translation": "Such śramaṇas and brāhmaṇas as Samantabhadra also believe that the karmic retribution of good roots is the most excellent and desirable fruit, whether it's heavenly or heavenly king, human or human king.",
        "source": "T11n0314_001:0764b16_19"
    },
    {
        "source_sentence": "復信不善業報最下惡，不可樂聞，不愛甚重麁過，或地獄、畜生、餓鬼等處。",
        "translation": "They also believe that the results of unwholesome actions are the lowest and evil, which they can't hear with pleasure and don't like to hear, and they may go to hell, animals, hungry ghosts, or other places like this.",
        "source": "T11n0314_001:0764b17_20"
    },
    {
        "source_sentence": "彼如是信已，遠離三法。",
        "translation": "Having thus believed, they're far removed from the three dharmas.",
        "source": "T11n0314_001:0764b19_21"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T11n0314_001:0764b20_0"
    },
    {
        "source_sentence": "所謂疑、惑、不決等事。",
        "translation": "It's called doubt, confusion, uncertainty, and other things.",
        "source": "T11n0314_001:0764b20_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0764b20_2"
    },
    {
        "source_sentence": "菩薩成就如是諸法名為正信。」",
        "translation": "A bodhisattva who accomplishes such things is called right faith.",
        "source": "T11n0314_001:0764b20_3"
    },
    {
        "source_sentence": "「信為最上乘，　　以是成正覺，",
        "translation": "Faith is the supreme vehicle, Because of which they attain perfect enlightenment.",
        "source": "T11n0314_001:0764b21_4"
    },
    {
        "source_sentence": "　是故信等事，　　智者敬親近。",
        "translation": "Therefore, such things as faith and so forth are respected and approached by the wise.",
        "source": "T11n0314_001:0764b21_4"
    },
    {
        "source_sentence": "　信為最世間，　　信者無窮乏，",
        "translation": "Faith is the most mundane, and those who believe have no limit to their faith.",
        "source": "T11n0314_001:0764b21_4"
    },
    {
        "source_sentence": "　是以信等法，　　智者正親近。",
        "translation": "That's why such things as faith and so forth are correctly approached by the wise.",
        "source": "T11n0314_001:0764b21_4"
    },
    {
        "source_sentence": "　不信善男子，　　不生諸白法，",
        "translation": "They don’t believe in good men, don’t produce white dharmas,",
        "source": "T11n0314_001:0764b21_4"
    },
    {
        "source_sentence": "　猶如焦種子，　　不生於根芽。」",
        "translation": "It's like a scorched seed that doesn't grow from its roots and buds.",
        "source": "T11n0314_001:0764b21_4"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「善男子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Good man!",
        "source": "T11n0314_001:0764b21_4"
    },
    {
        "source_sentence": "云何菩薩摩訶薩成就諸行？",
        "translation": "What are the practices accomplished by bodhisattvas, mahāsattvas?",
        "source": "T11n0314_001:0764b29_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0764b29_6"
    },
    {
        "source_sentence": "菩薩摩訶薩剃除鬚髮，以被正服，殷重信心，捨家出家。",
        "translation": "The bodhisattva Mahāsattva shaved his hair and beard, put on his proper robes, renounced the householder's life with great faith, and left home.",
        "source": "T11n0314_001:0764c01_0"
    },
    {
        "source_sentence": "出家已，習學菩薩威儀戒等諸行，或復聲聞威儀戒等諸行，亦學緣覺威儀等行。",
        "translation": "After leaving home, they'll cultivate the bodhisattva's deportment precepts and other practices, or they'll train the śrāvaka's deportment precepts and other practices, or they'll also train the de",
        "source": "T11n0314_001:0764c02_1"
    },
    {
        "source_sentence": "彼如是或以所有身口意等同習煩惱，彼一切同滅。",
        "translation": "In this way, sometimes these are with such [things] as bodily, verbal and mental defilement that is similar in relation to what they have. All of them are abandoned simultaneously.",
        "source": "T11n0314_001:0764c04_2"
    },
    {
        "source_sentence": "是中何者身所有同習煩惱？",
        "translation": "Among these, which are the afflictions that are commonly accumulated in the body?",
        "source": "T11n0314_001:0764c05_3"
    },
    {
        "source_sentence": "所謂殺生、偷盜、惡欲邪婬，刀杖瓦石等執慳悋於他動手足等，往來逃走等事，",
        "translation": "The so-called acts of taking life, stealing, sexual misconduct with bad intentions, swords, sticks, tiles, stones, etc., grasping stinginess toward others, moving their hands and feet, coming and going,",
        "source": "T11n0314_001:0764c05_4"
    },
    {
        "source_sentence": "是名身有同習煩惱。",
        "translation": "This is called a body that has the same accumulated afflictions.",
        "source": "T11n0314_001:0764c07_5"
    },
    {
        "source_sentence": "是中何者口家同習煩惱？",
        "translation": "Which of these are the verbal afflictions that are commonly cultivated in the householders?",
        "source": "T11n0314_001:0764c08_6"
    },
    {
        "source_sentence": "所謂妄語、兩舌、惡口、綺語，恒說惡語，毀謗甚深諸典。",
        "translation": "They speak falsehood, double talk, harsh words, and fancy speech, constantly speaking harsh words that disparage the profound scriptures.",
        "source": "T11n0314_001:0764c08_7"
    },
    {
        "source_sentence": "於諸尊長修梵行中廣說惡名，是名口同習煩惱。",
        "translation": "To extensively proclaim bad names among the venerable ones in the long cultivation of religious practice is called verbally accumulating afflictions together.",
        "source": "T11n0314_001:0764c09_8"
    },
    {
        "source_sentence": "是中何者意家同習煩惱？",
        "translation": "Which of these are the mental afflictions that are commonly cultivated in the mind?",
        "source": "T11n0314_001:0764c10_9"
    },
    {
        "source_sentence": "所謂慳貪、邪見、嫉妬、樂著名聞利養，親族姓慢、色慢、幼年慢、無患慢、長壽多聞慢、思惟慢，",
        "translation": "It's called the conceit of stinginess, greed, wrong views, jealousy, delight in fame and profit, pride in family names, pride in form, pride in youthfulness, conceit of being without trouble, conceit of long life",
        "source": "T11n0314_001:0764c11_10"
    },
    {
        "source_sentence": "欲覺、妄想覺、惡覺、親覺、土覺，飲食、衣服、臥具、醫藥、資用等覺，",
        "translation": "feelings of desire, deluded perception, bad perception, intimacy, land perception, food and drink, clothing, bedding, medicine, necessities, and so forth.",
        "source": "T11n0314_001:0764c13_11"
    },
    {
        "source_sentence": "著處、著乘、著床，著諸飲食、妻子男女，營作犁耬奴婢等，錢財、穀麥、倉庫、貯積等事，",
        "translation": "They wear clothing, vehicles, seats, beds, food and drink, wives, men and women, elephant carts, slaves, servants, etc., as well as money, grain, storehouses, storehouses, and other things like",
        "source": "T11n0314_001:0764c14_12"
    },
    {
        "source_sentence": "乃至著種種資用之具。",
        "translation": "They'll even put on various necessities.",
        "source": "T11n0314_001:0764c16_13"
    },
    {
        "source_sentence": "彼如是悋著已，所說事中，若失一事，便生其憂苦惱妄想等事。",
        "translation": "If they lose one thing among the things he teaches, then they'll give rise to such things as grief, pain, deluded thoughts, and other things.",
        "source": "T11n0314_001:0764c17_14"
    },
    {
        "source_sentence": "彼如是遠離愛潤心已，生於思惟。",
        "translation": "After thus being free of the mind nourished by craving, they give rise to thoughts.",
        "source": "T11n0314_001:0764c18_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0764c19_16"
    },
    {
        "source_sentence": "略說意業，猶如世間輪轉，故說意業同習氣煩惱。",
        "translation": "In brief, mental action is analogous to worldly transmigration. That is why it is said that mental action is the same as defilement influenced by habit energy.",
        "source": "T11n0314_001:0764c19_17"
    },
    {
        "source_sentence": "「彼如是離身口意業同習煩惱已，於和上所起其尊想，其阿闍梨所起和上想，",
        "translation": "“Furthermore, having been thus free of the defilements of bodily, verbal, and mental action that are similarly conditioned, they give rise to thoughts of veneration in regard to those superiors. The thought of enlightenment in regard",
        "source": "T11n0314_001:0764c20_18"
    },
    {
        "source_sentence": "於同梵行若老若少，起殷重恭敬。",
        "translation": "In the same religious practice, whether old or young, they give rise to respect and veneration.",
        "source": "T11n0314_001:0764c22_19"
    },
    {
        "source_sentence": "彼獨在空閑之處，作如是思惟：『我不應作如是，我為度一切眾生，為解一切眾生，",
        "translation": "He was alone in a quiet place, thinking: I should not do such things. For the sake of liberating all sentient beings and understanding all sentient beings,",
        "source": "T11n0314_001:0764c23_20"
    },
    {
        "source_sentence": "為令安調伏靜定眾生故發諸行。",
        "translation": "He gives rise to these practices in order to cause sentient beings who are peaceful and tranquil to be disciplined.",
        "source": "T11n0314_001:0764c25_21"
    },
    {
        "source_sentence": "然我自不調伏，不隱諸根，未為寂滅。",
        "translation": "But I myself am not disciplined, do not hide my faculties, and have not yet entered nirvana.",
        "source": "T11n0314_001:0764c26_22"
    },
    {
        "source_sentence": "我必修正行，令有見我者，必得成受調伏，亦順諸佛微妙等教，復令歡喜諸天神、龍、夜叉、乾闥婆等。』",
        "translation": "I must cultivate my practice so that those who see me will surely be disciplined, follow the subtle teachings of the buddhas, and also cause gods, dragons, yakṣas, gandharvas, and drymen to rejoice.'",
        "source": "T11n0314_001:0764c26_23"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0764c29_24"
    },
    {
        "source_sentence": "此名為菩薩慚。",
        "translation": "This is called the bodhisattva's shame.",
        "source": "T11n0314_001:0764c29_25"
    },
    {
        "source_sentence": "彼作如是思惟：『勿有令我，若道若俗，於諸威儀行中取諸過失，所謂行戒，",
        "translation": "They think, 'There's no reason for me, whether path or secular, to take faults in deportment and conduct, which are called practicing precepts.",
        "source": "T11n0314_001:0764c29_26"
    },
    {
        "source_sentence": "行不正中，或見形，或威儀行，或行資用，壽命行等。』",
        "translation": "Among the practices that aren't correct, some may see form, or they may practice with deportment, or they may practice with necessities, such as life and conduct.'",
        "source": "T11n0314_001:0765a02_27"
    },
    {
        "source_sentence": "彼如是慚愧已，日夜之中六時觀於持戒等法。",
        "translation": "After he's thus ashamed, he observes observing the observance of precepts and so forth at six times during the day and night.",
        "source": "T11n0314_001:0765a03_28"
    },
    {
        "source_sentence": "彼善持戒已，無復疑悔，令入住如來佛法中，無有休息。",
        "translation": "Having well observed the precepts, they no longer have any doubts or regrets and are led to enter the buddha-dharma of the enlightened without cease.",
        "source": "T11n0314_001:0765a04_29"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0765a05_30"
    },
    {
        "source_sentence": "此之名為菩薩愧。",
        "translation": "This is called the bodhisattva's shame.",
        "source": "T11n0314_001:0765a05_31"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0765a06_32"
    },
    {
        "source_sentence": "是名菩薩成就如是諸行。」",
        "translation": "This is called a bodhisattva who accomplishes such actions.",
        "source": "T11n0314_001:0765a06_33"
    },
    {
        "source_sentence": "「諸佛行為本，　　及聲聞弟子，",
        "translation": "“The buddhas are the source of practice, And śrāvaka disciples.",
        "source": "T11n0314_001:0765a07_34"
    },
    {
        "source_sentence": "　是故智者修，　　行行常堅固。",
        "translation": "Therefore, the wise person cultivates practice that's always resolute in terms of practice.",
        "source": "T11n0314_001:0765a07_34"
    },
    {
        "source_sentence": "　諸菩薩大智，　　行諸無畏行，",
        "translation": "Enlightening beings’ great knowledge Carry out fearless deeds.",
        "source": "T11n0314_001:0765a07_34"
    },
    {
        "source_sentence": "　令證離垢道，　　諸佛所讚歎。」",
        "translation": "They cause them to realize the path of freedom from defilement, which is praised by the buddhas.",
        "source": "T11n0314_001:0765a07_34"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「善男子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Good man!",
        "source": "T11n0314_001:0765a07_34"
    },
    {
        "source_sentence": "云何菩薩成就性？",
        "translation": "What is the accomplished nature of enlightening beings?",
        "source": "T11n0314_001:0765a12_35"
    },
    {
        "source_sentence": "佛子菩薩性成，少欲、瞋恚、愚癡等，不妬、不悋、不惱、不說麁言、不欲瞋調戲、不輕動、調和柔軟、已可親近，",
        "translation": "“Child of Buddha, the bodhisattva is naturally endowed with few desires, anger, and folly. He is neither jealousy, hatred, resentment, vexation, or displeasure; he does not",
        "source": "T11n0314_001:0765a12_36"
    },
    {
        "source_sentence": "性能成就上妙供具供養諸佛，所謂資用等財，惠施與他，具足成就手足頭目等。",
        "translation": "They are capable of accomplishing the most marvelous offerings to make offerings to the buddhas, which are called accumulating such possessions and giving them to others, fully accomplishing their hands, feet, heads, eyes, and so forth.",
        "source": "T11n0314_001:0765a14_37"
    },
    {
        "source_sentence": "若見如來或如來弟子，見已即生恭敬歡喜之心。",
        "translation": "If they see the Tathāgata or a disciple of the Tathāgata, they'll immediately become respectful and joyous when they see him.",
        "source": "T11n0314_001:0765a16_38"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0765a17_39"
    },
    {
        "source_sentence": "菩薩如是名為性成就。」",
        "translation": "Thus, the bodhisattva is called accomplished by nature.",
        "source": "T11n0314_001:0765a18_40"
    },
    {
        "source_sentence": "「相煙即知火，　　鴛鴦以顯水，",
        "translation": "The characteristic of smoke is knowing fire, and the mandarin duck shows water.",
        "source": "T11n0314_001:0765a18_41"
    },
    {
        "source_sentence": "　復相知諸性，　　菩薩大名稱。",
        "translation": "Furthermore, they know each other’s natures: This is the great name of enlightening beings.",
        "source": "T11n0314_001:0765a18_41"
    },
    {
        "source_sentence": "　柔和、不諂曲，　　捨離慳、嫉妬，",
        "translation": "Being gentle and not flattering, they abandon stinginess and jealousy.",
        "source": "T11n0314_001:0765a18_41"
    },
    {
        "source_sentence": "　愍念一切眾，　　名之為菩薩。」",
        "translation": "To pity all the sentient beings, he's called a bodhisattva.",
        "source": "T11n0314_001:0765a18_41"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「善男子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Good man!",
        "source": "T11n0314_001:0765a18_41"
    },
    {
        "source_sentence": "云何菩薩摩訶薩喜樂菩提心？",
        "translation": "What is the mind of great enlightening beings’ joy and bliss in the determination for enlightenment?",
        "source": "T11n0314_001:0765a24_42"
    },
    {
        "source_sentence": "若有菩薩摩訶薩，體性微發菩提心時，值佛菩薩或聲聞、緣覺等，教化勸發而生阿耨多羅三藐三菩提心，",
        "translation": "“Furthermore, if there are bodhisattva mahāsattvas whose essential nature is to give rise to the aspiration for enlightenment, they will meet buddhas, bodhisattvas, or śrāvakas and pratyekbuddhas",
        "source": "T11n0314_001:0765a24_43"
    },
    {
        "source_sentence": "是名喜樂初發菩提相。",
        "translation": "This is called the first sign of joy and happiness that gives rise to the characteristic of enlightenment.",
        "source": "T11n0314_001:0765a27_44"
    },
    {
        "source_sentence": "彼聞菩提及菩提功德已，即發阿耨多羅三藐三菩提心，是名第二喜樂菩提相。",
        "translation": "After hearing about the merit of enlightenment and the virtue of enlightenment, they then give rise to the mind of unsurpassed, correct, and complete enlightenment, which is called the second aspect of joyful bodhi.",
        "source": "T11n0314_001:0765a27_45"
    },
    {
        "source_sentence": "彼菩薩見諸眾生無能救護，無所歸依，孤獨無能濟拔，無覆護，無舍宅，",
        "translation": "Those bodhisattvas see that all sentient beings cannot be rescued, have no refuge, are alone and helpless, are unobstructed and protected, and lack shelter.",
        "source": "T11n0314_001:0765a29_46"
    },
    {
        "source_sentence": "無有洲已，即起悲愍心。",
        "translation": "After there's no continent, he then gives rise to compassion.",
        "source": "T11n0314_001:0765b02_47"
    },
    {
        "source_sentence": "彼發心已，作如是念：『我今為諸眾生，作救護、歸依、濟拔、覆護、舍宅洲等。』",
        "translation": "After he arouses his mind, he thinks, 'Now, for the sake of sentient beings, I'll rescue, take refuge, rescue, cover, shelter, dwelling, and so forth.'",
        "source": "T11n0314_001:0765b02_48"
    },
    {
        "source_sentence": "為彼因緣故發無上菩提心，是名第三喜樂發菩提心。",
        "translation": "For the sake of their causes and conditions, they give rise to the mind of unsurpassed enlightenment, which is called the third joyful arousal of the mind of enlightenment.",
        "source": "T11n0314_001:0765b04_49"
    },
    {
        "source_sentence": "彼若見如來或菩薩、聲聞、緣覺等滿足諸行，見已心生歡喜，愛敬安心，",
        "translation": "“Furthermore, if they see buddhas, enlightening beings, bodhisattvas, disciples, or solitary realizers fulfilling various practices, their hearts become joyous when they see them. They are honored and revered",
        "source": "T11n0314_001:0765b05_50"
    },
    {
        "source_sentence": "以是因緣發阿耨多羅三藐三菩提心，是名第四發菩提心。",
        "translation": "Because of these causes and conditions, he gives rise to the mind of unsurpassed, correct, and complete enlightenment, which is called the fourth arousal of the mind of enlightenment.",
        "source": "T11n0314_001:0765b07_51"
    },
    {
        "source_sentence": "彼菩薩為諸眾生利益安樂故，行布施、持戒、修忍，發精進，行思禪定，",
        "translation": "For the benefit and welfare of sentient beings, they practice generosity, observe precepts, cultivate forbearance, make effort, and practice contemplation and meditation.",
        "source": "T11n0314_001:0765b08_52"
    },
    {
        "source_sentence": "修正慧。",
        "translation": "It's the cultivation of wisdom.",
        "source": "T11n0314_001:0765b10_53"
    },
    {
        "source_sentence": "「云何菩薩行布施？",
        "translation": "How does a bodhisattva practice generosity?",
        "source": "T11n0314_001:0765b10_54"
    },
    {
        "source_sentence": "所謂須飲與飲，須食與食，須乘給乘，須床榻敷具者，給床榻敷具等，",
        "translation": "They are those who need drinking and drinking, food and drinking, vehicles and carriages, beds and bedding, seats and bedding, etc.",
        "source": "T11n0314_001:0765b10_55"
    },
    {
        "source_sentence": "須衣施衣，須金、銀、寶冠、環釧等諸莊嚴具，乃至己身皮肉，潤益眾生。",
        "translation": "They need robes, give robes, need gold, silver, jeweled crowns, rings, and other adornments, or even their own skin and flesh to nourish sentient beings.",
        "source": "T11n0314_001:0765b12_56"
    },
    {
        "source_sentence": "彼如是行於布施已，然彼布施迴向發阿耨多羅三藐三菩提，雖施而不生我慢等心。",
        "translation": "After they thus practice generosity, however, they dedicate their generosity back to unsurpassed, correct, and complete enlightenment, and even though they give it, they don't become self-conceited or so.",
        "source": "T11n0314_001:0765b13_57"
    },
    {
        "source_sentence": "「云何持戒？",
        "translation": "What's observing precepts?",
        "source": "T11n0314_001:0765b15_58"
    },
    {
        "source_sentence": "成就身口意業，彼捨離身口意業等已，善離能防無礙無漏，純一無雜奉持禁戒。",
        "translation": "He accomplishes bodily, verbal, and mental actions, abandons bodily, verbal, and mental actions, and so forth, well parts with what can be guarded, remains unobstructed and uncontaminated, and observes the precepts pure",
        "source": "T11n0314_001:0765b15_59"
    },
    {
        "source_sentence": "然彼持戒迴向阿耨多羅三藐三菩提，雖行持戒然不起我慢等心。",
        "translation": "Still, they observe precepts and dedicate themselves back to unsurpassed, correct, and complete enlightenment, and even though they practice observing precepts, they don't become conceited.",
        "source": "T11n0314_001:0765b17_60"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0765b19_61"
    },
    {
        "source_sentence": "云何菩薩修忍？",
        "translation": "How does a bodhisattva cultivate patience?",
        "source": "T11n0314_001:0765b19_62"
    },
    {
        "source_sentence": "彼瞋罵說，枷鎖繫閉，切割撾打，若道若俗，能忍、能容，不起諸習等煩惱。",
        "translation": "He speaks angrily and abusively, is bound by fetters and chains, cuts and beats, whether path or secular, can tolerate and allow, and doesn't give rise to such afflictions as accumulation.",
        "source": "T11n0314_001:0765b19_63"
    },
    {
        "source_sentence": "如是修忍已，然彼迴向阿耨多羅三藐三菩提，雖修忍，然不起我慢等心。",
        "translation": "After cultivating forbearance in this way, however, they return to unsurpassed, correct, and complete enlightenment, and even though they cultivate forbearance, they don't become conceited of self or pride.",
        "source": "T11n0314_001:0765b21_64"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0765b23_65"
    },
    {
        "source_sentence": "云何菩薩發精進心？",
        "translation": "What is a bodhisattva’s determination for enlightenment?",
        "source": "T11n0314_001:0765b23_66"
    },
    {
        "source_sentence": "彼作如是念：『猶如虛空界無量無邊，眾生界亦無量無邊，然此眾生界我獨無二，",
        "translation": "They think: Just as the space realm is immeasurable and limitless, so also the realm of sentient beings is immeasurable and limitless. Yet this self of sentient beings alone is nondual.",
        "source": "T11n0314_001:0765b23_67"
    },
    {
        "source_sentence": "令安無餘涅槃界中。』",
        "translation": "He causes them to be placed in the realm of nirvāṇa without remainder.'",
        "source": "T11n0314_001:0765b25_68"
    },
    {
        "source_sentence": "是以為彼因緣故發行精進，身不離身念觀受；",
        "translation": "This is the emission of energy because of these causes and conditions:",
        "source": "T11n0314_001:0765b26_0"
    },
    {
        "source_sentence": "彼觀受已，觀心心行；",
        "translation": "After observing feeling, they observe thought and thought-conduct.",
        "source": "T11n0314_001:0765b27_1"
    },
    {
        "source_sentence": "彼觀心心已，順觀諸法。",
        "translation": "After they contemplate mind and mind, they follow the contemplation of dharmas.",
        "source": "T11n0314_001:0765b27_2"
    },
    {
        "source_sentence": "彼如是善憶念觀已，為未生諸不善惡法令不生故，起欲修勤精進，持心等正行；",
        "translation": "In order to prevent the arising of bad and evil deeds that have not yet arisen, they give rise to desire, cultivate diligence, and maintain right practices such as mindfulness.",
        "source": "T11n0314_001:0765b28_3"
    },
    {
        "source_sentence": "為未生諸善法令生故，起欲修勤精進，直心等正行；",
        "translation": "In order to produce the good deeds that have yet to be produced, they give rise to desire and cultivate diligence, such right practices as straightforward mind.",
        "source": "T11n0314_001:0765b29_4"
    },
    {
        "source_sentence": "已生諸不善法為令滅故，起欲修勤精進，持心等正行；",
        "translation": "In order to extinguish the bad dharmas that have already arisen, they give rise to desire and develop diligence and energy, maintaining mental states of equanimity.",
        "source": "T11n0314_001:0765c02_5"
    },
    {
        "source_sentence": "已生諸善法為令久住故，復令增長思故，起欲修勤精進持心等正行。",
        "translation": "In order to make the good factors that have already arisen abide for a long time, and in order to further increase thinking, they give rise to the right practice of wanting to cultivate diligence, exerting effort, maintaining awarenesses, etc.",
        "source": "T11n0314_001:0765c03_6"
    },
    {
        "source_sentence": "彼發精進已，令成初如意足分，如是第二、第三乃至成第四如意足分。",
        "translation": "After they give rise to that effort, they cause the first part of their supernormal abilities to become the second, third, and even fourth parts of their supernormal abilities.",
        "source": "T11n0314_001:0765c04_7"
    },
    {
        "source_sentence": "彼成就如意分，能令住一劫若減一劫，或具足行令滿精進波羅蜜。",
        "translation": "He accomplishes the supernormal part, which can cause them to abide for an eon or less than an eon, or he fulfills the perfection of effort by fully practicing it.",
        "source": "T11n0314_001:0765c06_8"
    },
    {
        "source_sentence": "如是發精進已，然彼精進迴向阿耨多羅三藐三菩提。",
        "translation": "After thus arousing this effort, however, that effort is directed back to unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0314_001:0765c08_0"
    },
    {
        "source_sentence": "雖發如是精進，然心不生憍慢。",
        "translation": "Even though they make such an effort, their minds don't become conceited.",
        "source": "T11n0314_001:0765c09_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0765c09_2"
    },
    {
        "source_sentence": "云何菩薩思禪定行？",
        "translation": "What is a bodhisattva’s practice of reflection and meditative absorption?",
        "source": "T11n0314_001:0765c10_3"
    },
    {
        "source_sentence": "離意欲、離意滅、離欲靜，不依內、不依外，不依色，不依受、想，不依識，",
        "translation": "Being free of mental desire, free of mental cessation, and free of the quiescence of desire, he doesn’t rely on inside or outside, form or formlessness, sensation or perception or consciousness.",
        "source": "T11n0314_001:0765c10_4"
    },
    {
        "source_sentence": "不依欲、色、無色界，不依空、無相、無願，不依世間、出世間，不依布施、持戒、忍辱、精進等。",
        "translation": "They don't rely on the desire, form, formless realms, emptiness, signlessness, wishlessness, worldly and transmundane, generosity, observance of precepts, patience, effort, and so forth.",
        "source": "T11n0314_001:0765c12_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0765c13_6"
    },
    {
        "source_sentence": "乃至略說一切有想繫縛等名為禪。",
        "translation": "It's even briefly explained that all the fetters of conceptual binding and so forth are called meditation.",
        "source": "T11n0314_001:0765c14_7"
    },
    {
        "source_sentence": "如是修諸禪，然彼禪迴向阿耨多羅三藐三菩提，雖思修此禪，然不起我慢等心。",
        "translation": "He cultivates these meditations in this way, yet he dedicates those meditations to unsurpassed, correct, and complete enlightenment, and even though he contemplates cultivating them, he doesn't give rise to such thoughts as self-conceit",
        "source": "T11n0314_001:0765c14_8"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0765c16_9"
    },
    {
        "source_sentence": "云何菩薩修智？",
        "translation": "What is enlightening beings’ cultivation of knowledge?",
        "source": "T11n0314_001:0765c16_10"
    },
    {
        "source_sentence": "彼作如是念：『無量無邊眾生界令入涅槃，然無一眾生可入涅槃。』",
        "translation": "They think, 'There are measureless and limitless realms of sentient beings that cause them to enter nirvāṇa, but there's no single sentient being who can enter nirvāṇa.'",
        "source": "T11n0314_001:0765c17_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0765c18_12"
    },
    {
        "source_sentence": "如佛所說一切法，無我、無眾生、無命、無壽、無富伽羅。",
        "translation": "As the Buddha teaches, all dharmas lack self, no sentient beings, no life, no longevity, and no pudgala.",
        "source": "T11n0314_001:0765c18_13"
    },
    {
        "source_sentence": "如是修觀智，然彼智迴向阿耨多羅三藐三菩提。",
        "translation": "Thus, they cultivate the knowledge of contemplation, but their knowledge returns to unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0314_001:0765c20_14"
    },
    {
        "source_sentence": "雖觀修般若，然不起我慢等心。",
        "translation": "Even though they contemplate and cultivate prajñā, they don't give rise to such thoughts as self-conceit.",
        "source": "T11n0314_001:0765c21_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0765c21_16"
    },
    {
        "source_sentence": "如是菩薩摩訶薩樂菩提心。」",
        "translation": "Thus, the bodhisattva Mahāsattva delights in the mind of enlightenment.",
        "source": "T11n0314_001:0765c22_17"
    },
    {
        "source_sentence": "「猶如摩尼珠，　　顯於寶藏中，",
        "translation": "It's like a maṇi pearl that appears in a treasure trove,",
        "source": "T11n0314_001:0765c22_18"
    },
    {
        "source_sentence": "　師以加功用，　　倍明於本色。",
        "translation": "The teacher uses his effort to double the luminosity of the original color.",
        "source": "T11n0314_001:0765c22_18"
    },
    {
        "source_sentence": "　成就如是性，　　求正菩提心，",
        "translation": "Accomplishing such a nature, they seek right enlightenment.",
        "source": "T11n0314_001:0765c22_18"
    },
    {
        "source_sentence": "　二邊既寂靜，　　令魔不得便。」",
        "translation": "Since the two sides are quiescent, Māra won't get an advantage over them.",
        "source": "T11n0314_001:0765c22_18"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「善男子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Good man!",
        "source": "T11n0314_001:0765c22_18"
    },
    {
        "source_sentence": "云何菩薩樂法成就？",
        "translation": "How does a bodhisattva develop the blissful dharma?",
        "source": "T11n0314_001:0765c28_19"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0765c28_20"
    },
    {
        "source_sentence": "若菩薩性樂法、喜法、愛法，彼若見沙門若婆羅門，所有資用、命具、飲食等事，",
        "translation": "Suppose a bodhisattva sees an ascetic or a brāhmaṇa who enjoys the Dharma, delights in the Dharma, loves the Dharma, and loves the Dharma, and if he sees all the necessities, provisions",
        "source": "T11n0314_001:0765c28_21"
    },
    {
        "source_sentence": "彼能奉上。",
        "translation": "They'll be able to venerate it.",
        "source": "T11n0314_001:0766a01_22"
    },
    {
        "source_sentence": "彼世間所有受用等，根莖枝葉華果等，彼收已，施諸眾生。",
        "translation": "All the sensations in that world, such as roots, stems, leaves, flowers, fruits, and so forth, are collected and given to sentient beings.",
        "source": "T11n0314_001:0766a01_23"
    },
    {
        "source_sentence": "持諸法者，令往禮拜、恭敬合掌，迎接已，殷重敬納，心有所疑處，問於正義；",
        "translation": "Those who preserve the teachings are led to venerate them, joining their palms in respect and greeting them. Having greeted them, they receive them with great reverence; wherever there is doubt in their minds they ask questions of correct meaning.",
        "source": "T11n0314_001:0766a03_24"
    },
    {
        "source_sentence": "是以持法者隨所聞義，善能解釋。",
        "translation": "That's why a Dharma holder follows the meaning of what he hears and can explain it well.",
        "source": "T11n0314_001:0766a04_25"
    },
    {
        "source_sentence": "彼於聞法者起世尊想、善知識想，起同世間諸海想；",
        "translation": "Thinking of those who hear the Teaching as world-honored ones, they think of them as spiritual benefactors and give rise to thoughts that they are like the seas in the world.",
        "source": "T11n0314_001:0766a05_26"
    },
    {
        "source_sentence": "起和上想、阿闍梨想；",
        "translation": "They give rise to thoughts of superiority and thought of the preceptor.",
        "source": "T11n0314_001:0766a06_27"
    },
    {
        "source_sentence": "久失導時世間曠野生難中，能訪覓起訪覓想；",
        "translation": "When their guide has been lost for a long time they are born in the wilderness of the world in distress. They can look for and give rise to thoughts of looking for.",
        "source": "T11n0314_001:0766a07_28"
    },
    {
        "source_sentence": "久遠愚者闇閉目開故，令起覺悟想；",
        "translation": "For a long time the ignorant have been shut off in darkness, and their eyes are opened.",
        "source": "T11n0314_001:0766a08_29"
    },
    {
        "source_sentence": "墜沒世間煩惱泥中，而起濟拔之想；",
        "translation": "They plunge into the mud of worldly afflictions and give rise to thoughts of salvation.",
        "source": "T11n0314_001:0766a09_30"
    },
    {
        "source_sentence": "久遠失正路為作導師故，而起導師之想；",
        "translation": "They think of themselves as guides because they have lost the right path for a long time.",
        "source": "T11n0314_001:0766a09_31"
    },
    {
        "source_sentence": "久伏在世間牢獄能解故，而起解者想；",
        "translation": "They think of liberation because they have been imprisoned for a long time in worldly prisons and are able to do so.",
        "source": "T11n0314_001:0766a10_32"
    },
    {
        "source_sentence": "久遠著患療治故，而起良醫之想；",
        "translation": "For a long time they thought of themselves as physicians because they were attached to the treatment of their illnesses.",
        "source": "T11n0314_001:0766a11_33"
    },
    {
        "source_sentence": "以煩惱火焦滅身，令住滅故，而起大雲雨想。",
        "translation": "Because the body is burned by the fire of defilement and caused to abide in cessation, they give rise to the perception of great clouds and rain.",
        "source": "T11n0314_001:0766a12_34"
    },
    {
        "source_sentence": "彼為法，為法因故，能忍寒熱、風雨、蚊虻等，亦忍飢渴，或見他人受樂報者，",
        "translation": "For the sake of the Dharma, and for the sake of the causes of the Dharma, they're able to endure cold, heat, wind, rain, mosquitoes, gadflies, and so forth. They can also endure hunger and thi",
        "source": "T11n0314_001:0766a13_35"
    },
    {
        "source_sentence": "不起悕求樂心。",
        "translation": "He doesn't give rise to the mind that arrogates and seeks happiness.",
        "source": "T11n0314_001:0766a15_36"
    },
    {
        "source_sentence": "然作如是念：『唯我世間獨樂，而我能聞正法。』",
        "translation": "Still, he thinks, 'I'm the only one in the world who enjoys solitude, but I can hear the right teaching.'",
        "source": "T11n0314_001:0766a15_37"
    },
    {
        "source_sentence": "彼為是事故，為彼因、彼緣故，不生憂悲苦惱恨等。",
        "translation": "Because of these things, and because of their causes and conditions, they don't give rise to grief, pain, vexation, resentment, and so forth.",
        "source": "T11n0314_001:0766a16_38"
    },
    {
        "source_sentence": "彼如是離憂悲苦惱等已，發如是心：『我堪能荷負如來所說一法句故，",
        "translation": "Having been thus freed from sorrow, pity, pain, and vexation, they aroused the thought: I am able to bear the burden of one doctrine uttered by the Buddha.",
        "source": "T11n0314_001:0766a17_39"
    },
    {
        "source_sentence": "在阿鼻地獄住一劫若減一劫。』",
        "translation": "If he stays in the avīci hell for an eon or less than an eon.'",
        "source": "T11n0314_001:0766a19_40"
    },
    {
        "source_sentence": "彼如是無疲倦心已，自然不行諸行，而得一切種智，未得諸佛法而令速得。",
        "translation": "Having done so without weariness of mind, they naturally don't practice actions and attain all kinds of cognition, and they quickly attain the buddha-dharma that they haven't yet attained.",
        "source": "T11n0314_001:0766a20_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0766a21_1"
    },
    {
        "source_sentence": "以是義故，菩薩名為樂著諸法。」",
        "translation": "Because of this meaning, the bodhisattva is called delighting in dharmas.",
        "source": "T11n0314_001:0766a21_2"
    },
    {
        "source_sentence": "「大智樂諸法，　　而成諸佛子，",
        "translation": "“Great wisdom delights in all dharmas And becomes the offspring of buddhahood.",
        "source": "T11n0314_001:0766a22_3"
    },
    {
        "source_sentence": "　親近正妙法，　　而不生疲倦。",
        "translation": "Being intimate with the true and wonderful Dharma, they don't become weary.",
        "source": "T11n0314_001:0766a22_3"
    },
    {
        "source_sentence": "　敬心求正法，　　諸深心佛子，",
        "translation": "With reverence they seek the true Teaching; The profound-minded Buddha-children,",
        "source": "T11n0314_001:0766a22_3"
    },
    {
        "source_sentence": "　及以心憶持，　　亦顯正妙行。」",
        "translation": "As well as being mindfully remembered and maintained, it also reveals the right and marvelous practice.",
        "source": "T11n0314_001:0766a22_3"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「善男子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Good man!",
        "source": "T11n0314_001:0766a22_3"
    },
    {
        "source_sentence": "云何菩薩摩訶薩正觀諸法？",
        "translation": "How does the bodhisattva Mahāsattva correctly contemplate all dharmas?",
        "source": "T11n0314_001:0766a28_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0766a28_5"
    },
    {
        "source_sentence": "若菩薩作如是觀：『一切諸法猶如幻，迷惑凡夫故；",
        "translation": "Suppose a bodhisattva thinks: All things are like illusions, confusing worldlings.",
        "source": "T11n0314_001:0766a29_0"
    },
    {
        "source_sentence": "一切諸法如夢，不實故；",
        "translation": "All things are like dreams, because they are not real.",
        "source": "T11n0314_001:0766b01_1"
    },
    {
        "source_sentence": "一切諸法如水中月，非事故；",
        "translation": "All things are like the moon in water, not incidental.",
        "source": "T11n0314_001:0766b01_2"
    },
    {
        "source_sentence": "一切諸法如響，非眾生故；",
        "translation": "All things are like echoes, not sentient beings.",
        "source": "T11n0314_001:0766b02_3"
    },
    {
        "source_sentence": "一切諸法如影，計妄想故；",
        "translation": "All dharmas are like reflections, because they impute deluded conceptions.",
        "source": "T11n0314_001:0766b02_4"
    },
    {
        "source_sentence": "一切諸法如響聲，生滅壞故。",
        "translation": "All dharmas are like sounds, because they arise and cease and disintegrate.",
        "source": "T11n0314_001:0766b03_5"
    },
    {
        "source_sentence": "一切諸法生滅壞，緣假成故；",
        "translation": "All things arise, perish, and disintegrate because they are conditioned by what is provisional.",
        "source": "T11n0314_001:0766b04_6"
    },
    {
        "source_sentence": "一切諸法本不生不移，同真如體故；",
        "translation": "All dharmas are originally not produced or displaced, because they are the same as the essence of reality.",
        "source": "T11n0314_001:0766b04_7"
    },
    {
        "source_sentence": "一切諸法不滅，本不生故；",
        "translation": "All things do not perish, because they did not arise in the first place.",
        "source": "T11n0314_001:0766b05_8"
    },
    {
        "source_sentence": "一切諸法無作，無作者故；",
        "translation": "All things are unmanifest, because they have no maker.",
        "source": "T11n0314_001:0766b06_9"
    },
    {
        "source_sentence": "一切諸法如虛空，不可染故；",
        "translation": "All things are like space, because they cannot be defiled.",
        "source": "T11n0314_001:0766b06_10"
    },
    {
        "source_sentence": "一切諸法定寂滅，性不染故；",
        "translation": "All the dharmas are tranquil, because their natures are not tainted.",
        "source": "T11n0314_001:0766b07_11"
    },
    {
        "source_sentence": "一切諸法無垢，離一切諸垢故；",
        "translation": "All things are without defilement, because they are free from all defilements.",
        "source": "T11n0314_001:0766b08_12"
    },
    {
        "source_sentence": "一切諸法性滅，離煩惱故。",
        "translation": "All dharmas cease because they are free of affliction.",
        "source": "T11n0314_001:0766b08_13"
    },
    {
        "source_sentence": "一切諸法非色，不可見故；",
        "translation": "All things are not form, because they cannot be seen.",
        "source": "T11n0314_001:0766b09_14"
    },
    {
        "source_sentence": "一切諸法離心境界，無體性故；",
        "translation": "All dharmas are apart from the realm of mind, because they have no essence.",
        "source": "T11n0314_001:0766b09_15"
    },
    {
        "source_sentence": "一切諸法不住，滅諸毒故；",
        "translation": "All things do not abide, because they extinguish the poisons.",
        "source": "T11n0314_001:0766b10_16"
    },
    {
        "source_sentence": "一切諸法不可求，滅愛憎等心故；",
        "translation": "All things cannot be desired, because they annihilate such thoughts as craving and hatred.",
        "source": "T11n0314_001:0766b11_17"
    },
    {
        "source_sentence": "一切諸法無著，離煩惱境界故。",
        "translation": "All dharmas are without attachment because they are free of the realm of affliction.",
        "source": "T11n0314_001:0766b12_0"
    },
    {
        "source_sentence": "一切諸法如毒蛇，離善巧方便故；",
        "translation": "All things are like poisonous snakes, because they are free from skillful means.",
        "source": "T11n0314_001:0766b12_1"
    },
    {
        "source_sentence": "一切諸法如芭蕉，無堅實故；",
        "translation": "All dharmas are like plantains, because they lack firmness.",
        "source": "T11n0314_001:0766b13_2"
    },
    {
        "source_sentence": "一切諸法如水沫，體性弱故。』",
        "translation": "All dharmas are like bubbles of water, because their essence is weak.'",
        "source": "T11n0314_001:0766b14_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0766b14_4"
    },
    {
        "source_sentence": "菩薩如是觀名為正觀諸法。」",
        "translation": "Such a bodhisattva's contemplation is called correctly observing the dharmas.",
        "source": "T11n0314_001:0766b14_5"
    },
    {
        "source_sentence": "「一切法如幻，　　迷惑愚迷者，",
        "translation": "All things are like illusions, confused and deluded.",
        "source": "T11n0314_001:0766b16_0"
    },
    {
        "source_sentence": "　虛危猶如夢，　　汝等如是持。",
        "translation": "The unreal danger is like a dream, so you should thus maintain it.",
        "source": "T11n0314_001:0766b16_0"
    },
    {
        "source_sentence": "　法如水中月，　　亦如響等事，",
        "translation": "The Dharma is like the moon in water, And also like an echo.",
        "source": "T11n0314_001:0766b16_0"
    },
    {
        "source_sentence": "　復如影像等，　　智者諸不覺。」",
        "translation": "It's also like images and so forth, which are not perceived by wise people.",
        "source": "T11n0314_001:0766b16_0"
    },
    {
        "source_sentence": "爾時世尊，欲重宣此義，而說偈言：「善男子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Good man!",
        "source": "T11n0314_001:0766b16_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩行法順法等。",
        "translation": "How does the bodhisattva Mahāsattva practice the Dharma and follow the Dharma?",
        "source": "T11n0314_001:0766b21_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0766b21_2"
    },
    {
        "source_sentence": "若菩薩摩訶薩，觀色無常而不厭離色。",
        "translation": "Suppose a bodhisattva Mahāsattva observes that form is impermanent and doesn't tire of form.",
        "source": "T11n0314_001:0766b22_3"
    },
    {
        "source_sentence": "欲證於法已，正智助法界，同用等法善自觀入，善持彼者諸相，善思善記。",
        "translation": "Those who want to realize the teaching, correct knowledge that assists the Dharma realm, skillfully observe and enter themselves with the same qualities as they use them, skillfully maintain their characteristics, and skillfully contemplate and remember them.",
        "source": "T11n0314_001:0766b22_4"
    },
    {
        "source_sentence": "彼記此相，善持、善修、善記已，自然行法界等行，受、想、行、識亦觀無常，",
        "translation": "Having remembered these characteristics, they are well maintained, well cultivated, and well remembered. They naturally develop such formations as the realm of reality; feeling, perception, volition, and consciousness also observe impermanence.",
        "source": "T11n0314_001:0766b24_5"
    },
    {
        "source_sentence": "然不厭離識等之。",
        "translation": "However, they don't tire of being free of consciousness and so forth.",
        "source": "T11n0314_001:0766b26_6"
    },
    {
        "source_sentence": "入法界已，正智助同。",
        "translation": "After entering the Dharma realm, right knowledge assists in the same thing.",
        "source": "T11n0314_001:0766b26_7"
    },
    {
        "source_sentence": "法界等法善自觀達，亦記彼相，善持、善修、善記已，自然入法界等行，",
        "translation": "Having well observed and remembered such [teachings] as the realm of reality, they naturally enter into such practices as the realm of reality.",
        "source": "T11n0314_001:0766b27_0"
    },
    {
        "source_sentence": "如無常，苦、空、無我亦爾。",
        "translation": "Just as impermanent, so are suffering, emptiness, and selflessness.",
        "source": "T11n0314_001:0766b28_1"
    },
    {
        "source_sentence": "彼觀色無常已，於色中不生恐怖驚等。",
        "translation": "Having observed that form is impermanent, they don't become frightened and so forth in form.",
        "source": "T11n0314_001:0766b29_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0766b29_3"
    },
    {
        "source_sentence": "色是妄想顛倒所起，然彼如實知。",
        "translation": "Form is produced by deluded conceptual identification, but they really know it.",
        "source": "T11n0314_001:0766c01_4"
    },
    {
        "source_sentence": "觀受、想、行、識無常，乃至於識中，不恐不怖不驚。",
        "translation": "They observe that feeling, perception, volition, and consciousness are impermanent, and even within consciousness, they aren't afraid or frightened.",
        "source": "T11n0314_001:0766c01_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0766c02_6"
    },
    {
        "source_sentence": "識者妄想顛倒所起故，然彼如實知。",
        "translation": "Consciousness is because it is produced by deluded conceptual identification, but they really know it.",
        "source": "T11n0314_001:0766c03_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0766c03_8"
    },
    {
        "source_sentence": "譬如善巧幻師或幻師弟子，化作種種幻事，象兵、馬兵、車兵、步兵。",
        "translation": "It's like a skillful illusionist or a disciple of an illusionist who creates various illusory things, such as elephant troops, horse troops, chariot troops, and foot troops.",
        "source": "T11n0314_001:0766c04_9"
    },
    {
        "source_sentence": "彼智者見已，不生恐怖驚等。",
        "translation": "Having seen it, the wise one doesn't become frightened and so forth.",
        "source": "T11n0314_001:0766c05_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0766c06_11"
    },
    {
        "source_sentence": "彼如實知是幻師所作不實，未曾有虛誑作。",
        "translation": "They truly know that what's created by an illusionist is not real, and there's never been a false creation.",
        "source": "T11n0314_001:0766c06_12"
    },
    {
        "source_sentence": "菩薩亦如是，觀色無常已，於色中不生恐怖驚等。",
        "translation": "Similarly, bodhisattvas observe that form is impermanent and don't become frightened or terrified in form.",
        "source": "T11n0314_001:0766c07_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0766c08_14"
    },
    {
        "source_sentence": "色是妄想顛倒所起，然彼如實知，觀受、想、行、識無常已，乃至於識中不生恐怖驚等。",
        "translation": "Form is produced by deluded conceptions and mistaken thoughts, but they truly know that sensation, perception, volition, and consciousness are impermanent, even to the point where fear and fright don't arise in consciousness.",
        "source": "T11n0314_001:0766c08_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0766c10_16"
    },
    {
        "source_sentence": "識者妄想顛倒所起故，然彼如實知。」",
        "translation": "Consciousness is because it's produced by deluded conceptions and mistaken thoughts, but they truly know it.",
        "source": "T11n0314_001:0766c10_17"
    },
    {
        "source_sentence": "爾時淨無垢妙淨寶月王光菩薩白佛言：「世尊！",
        "translation": "It was then that the pure, undefiled, marvelously pure jeweled moon king of light bodhisattva said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0766c11_18"
    },
    {
        "source_sentence": "云何菩薩觀諸色無常，然不厭離色？",
        "translation": "How does a bodhisattva observe that form is impermanent but doesn't tire of form?",
        "source": "T11n0314_001:0766c12_19"
    },
    {
        "source_sentence": "而證法界已，正智觀入助法界等法。」",
        "translation": "After realizing the Dharma realm, he correctly observes and enters the Dharma realm as an aid to the Dharma realm.",
        "source": "T11n0314_001:0766c13_20"
    },
    {
        "source_sentence": "爾時世尊告淨無垢妙淨寶月王光菩薩言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the pure, undefiled, marvelously pure jeweled moon king of light bodhisattva, saying, Good sons!",
        "source": "T11n0314_001:0766c14_21"
    },
    {
        "source_sentence": "吾當為汝分別說喻。",
        "translation": "I will explain the metaphors for you separately.",
        "source": "T11n0314_001:0766c15_22"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0766c16_0"
    },
    {
        "source_sentence": "譬如有智男子，常事諸毒，善持、善覆、善惜，起我相已，種種莊嚴具貿易，",
        "translation": "Suppose there is a wise man who always uses poison, maintains it well, covers it well, and cherishes it well. Having produced his mark of self, he trades in various adornments:",
        "source": "T11n0314_001:0766c16_1"
    },
    {
        "source_sentence": "然是不食彼毒，勿令我因此事斷其正命。",
        "translation": "But don't eat that poison, and don't let me cut off their right livelihood for this reason.",
        "source": "T11n0314_001:0766c17_2"
    },
    {
        "source_sentence": "菩薩亦如是，向涅槃心，潤向涅槃，順向涅槃，近取涅槃。",
        "translation": "Similarly, bodhisattvas are directed toward nirvāṇa with minds that are directed toward nirvāṇa, nourish themselves with minds that are directed toward nirvāṇa, follow them to nirvāṇa, and approach nirvā",
        "source": "T11n0314_001:0766c18_3"
    },
    {
        "source_sentence": "然不證彼涅槃。",
        "translation": "However, they don't realize that nirvāṇa.",
        "source": "T11n0314_001:0766c19_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0766c20_5"
    },
    {
        "source_sentence": "勿令我因於此事退菩提行。",
        "translation": "Don't cause me to regress from the practice of enlightenment because of this.",
        "source": "T11n0314_001:0766c20_6"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0766c21_7"
    },
    {
        "source_sentence": "譬如有人事其火神，然彼人日夜香華等供養恭敬尊重讚歎親侍，然彼人不作是念：『我以事火供養、恭敬、尊重、讚歎，",
        "translation": "It is as if someone were to offer incense, flowers, and so forth day and night to the fire goddess, offering support, respect, reverence, veneration, and praise to their attendants. Yet that person does not think, “I am offering",
        "source": "T11n0314_001:0766c21_8"
    },
    {
        "source_sentence": "親近已，我以二手接取之。",
        "translation": "Having approached them, I picked them up with my two hands.",
        "source": "T11n0314_001:0766c23_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0766c24_10"
    },
    {
        "source_sentence": "勿令我因此事於身有苦，於心有惱。』",
        "translation": "Don't let this cause me to experience pain in body and anguish in mind because of these things.'",
        "source": "T11n0314_001:0766c24_11"
    },
    {
        "source_sentence": "菩薩如是，向涅槃心，潤向涅槃，順向涅槃，及取涅槃，然彼不證涅槃。",
        "translation": "The bodhisattva thus directs his mind toward nirvāṇa, nourishes it, follows it, and apprehends it, but he doesn't realize nirvāṇa.",
        "source": "T11n0314_001:0766c25_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0766c27_13"
    },
    {
        "source_sentence": "勿令我因此事退菩提行。」",
        "translation": "Don't cause me to regress from the practice of enlightenment because of these things.",
        "source": "T11n0314_001:0766c27_14"
    },
    {
        "source_sentence": "爾時淨無垢妙淨寶月王光菩薩白佛言：「世尊！",
        "translation": "It was then that the pure, undefiled, marvelously pure jeweled moon king of light bodhisattva said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0766c27_15"
    },
    {
        "source_sentence": "如我知世尊所說意趣，菩薩者應住世間。」",
        "translation": "As I know the meaning of what the Bhagavān teaches, bodhisattvas should abide in the world.",
        "source": "T11n0314_001:0766c28_16"
    },
    {
        "source_sentence": "佛言：「如是，如是！",
        "translation": "The Buddha said, So it is, so it is!",
        "source": "T11n0314_001:0766c29_17"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0767a01_18"
    },
    {
        "source_sentence": "菩薩應住世間。」",
        "translation": "A bodhisattva should abide in the world.",
        "source": "T11n0314_001:0767a01_19"
    },
    {
        "source_sentence": "問曰：「世尊！",
        "translation": "He asked, Bhagavān!",
        "source": "T11n0314_001:0767a01_20"
    },
    {
        "source_sentence": "云何菩薩住世間，而不以世間諸患所染？」",
        "translation": "How do bodhisattvas abide in the world and aren't stained by worldly afflictions?",
        "source": "T11n0314_001:0767a02_0"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T11n0314_001:0767a02_1"
    },
    {
        "source_sentence": "為此事故略說一喻。",
        "translation": "For this reason, I'll briefly explain a single metaphor.",
        "source": "T11n0314_001:0767a03_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0767a03_3"
    },
    {
        "source_sentence": "譬如呪術之人，以大呪術力故，諸惡毒蝄蛇等弄戲，然彼人不以此事斷其命根。",
        "translation": "It's like a man of the spell who, because of the power of his great spell, plays with bad poisonous snakes and serpents, but that person doesn't cut off their life root because of this.",
        "source": "T11n0314_001:0767a03_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0767a05_5"
    },
    {
        "source_sentence": "以彼人善通達呪術力故。",
        "translation": "It's because that person well understands the power of the spell.",
        "source": "T11n0314_001:0767a05_6"
    },
    {
        "source_sentence": "菩薩亦如是，行世間住世間，住世間已，大智方便呪力故，共諸煩惱毒蛇而居戲暴，",
        "translation": "Similarly, enlightening beings practice worldly and abide in the world. Having abide in the world, by the power of magical spells of great knowledge they live together with the venomous serpents of afflictions in play and wickedness",
        "source": "T11n0314_001:0767a06_7"
    },
    {
        "source_sentence": "亦弄行住坐臥。",
        "translation": "He's also playing, walking, standing, sitting, and lying down.",
        "source": "T11n0314_001:0767a08_8"
    },
    {
        "source_sentence": "菩薩不以此事故，於菩提而有退還。",
        "translation": "A bodhisattva doesn't regress from enlightenment because of these things.",
        "source": "T11n0314_001:0767a08_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0767a09_10"
    },
    {
        "source_sentence": "彼成就大智方便呪力故。」",
        "translation": "It's because they've accomplished the power of the great wisdom, skillful means, and spell.",
        "source": "T11n0314_001:0767a09_11"
    },
    {
        "source_sentence": "爾時淨無垢妙淨寶月王光菩薩言：「世尊！",
        "translation": "It was then that the pure, undefiled, marvelously pure jeweled moon king of light bodhisattva said, Bhagavān!",
        "source": "T11n0314_001:0767a10_12"
    },
    {
        "source_sentence": "希有，希有！",
        "translation": "Rarely, rarely!",
        "source": "T11n0314_001:0767a11_13"
    },
    {
        "source_sentence": "彼諸菩薩而能不證涅槃，復不以世間煩惱毒之所染。",
        "translation": "Those bodhisattvas are able to fail to realize nirvāṇa, and they aren't stained by the poison of worldly afflictions.",
        "source": "T11n0314_001:0767a11_14"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0767a12_15"
    },
    {
        "source_sentence": "我今歸依諸大菩薩。",
        "translation": "Now, I'll take refuge in the great bodhisattvas.",
        "source": "T11n0314_001:0767a12_16"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0767a13_17"
    },
    {
        "source_sentence": "是諸眾生成就諸善根，聞此法已，而生一歡喜心。",
        "translation": "These sentient beings have accomplished the good roots, and after hearing this teaching, they give rise to a sense of joy.",
        "source": "T11n0314_001:0767a13_18"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0767a14_19"
    },
    {
        "source_sentence": "彼善男子、善女人，諸佛已記：『若能聞此法門。』」",
        "translation": "Good men and good women, the buddhas have already written, 'If you can hear this teaching,' he said.",
        "source": "T11n0314_001:0767a14_20"
    },
    {
        "source_sentence": "佛言：「善男子！」",
        "translation": "The Buddha said, Good sons!",
        "source": "T11n0314_001:0767a15_21"
    },
    {
        "source_sentence": "說此法時，五百比丘未證無漏而得解脫。",
        "translation": "When he taught this teaching, five hundred monks were liberated without realizing the uncontaminated.",
        "source": "T11n0314_001:0767a16_0"
    },
    {
        "source_sentence": "彼得解脫已，即從坐起，偏袒右肩，右膝著地，合掌向佛，白佛言：「世尊！",
        "translation": "After he had attained liberation, Peter rose from his seat, bared his right shoulder, knelt with his right knee on the ground, joined his palms and faced the Buddha, said to him, Bhagavān!",
        "source": "T11n0314_001:0767a16_1"
    },
    {
        "source_sentence": "諸菩薩者，可敬可禮拜。」",
        "translation": "Those bodhisattvas should be honored and venerated.",
        "source": "T11n0314_001:0767a18_2"
    },
    {
        "source_sentence": "佛語諸比丘：「如是，如是！",
        "translation": "The Buddha said to the monks, So it is, so it is!",
        "source": "T11n0314_001:0767a19_3"
    },
    {
        "source_sentence": "如汝所說。」",
        "translation": "As you say.",
        "source": "T11n0314_001:0767a19_4"
    },
    {
        "source_sentence": "「敬禮諸大智，　　敬禮得無畏，",
        "translation": "“Friends of the great wise, venerate them and attain fearlessness.",
        "source": "T11n0314_001:0767a19_5"
    },
    {
        "source_sentence": "　敬禮淨諸目，　　敬禮親佛子。",
        "translation": "They venerate the pure eyes and pay respect to their relatives, the Buddha's children.",
        "source": "T11n0314_001:0767a19_5"
    },
    {
        "source_sentence": "　方便善巧故，　　及以勝妙智，",
        "translation": "Because of skillful means and supremely subtle knowledge.",
        "source": "T11n0314_001:0767a19_5"
    },
    {
        "source_sentence": "　菩薩大名稱，　　能過二乘地。",
        "translation": "The great name of the bodhisattva Can surpass the stages of the two vehicles.",
        "source": "T11n0314_001:0767a19_5"
    },
    {
        "source_sentence": "　如實知諸陰，　　謂生滅識等，",
        "translation": "They know all the aggregates as they really are, namely arising and ceasing conscious constructs, etc.",
        "source": "T11n0314_001:0767a19_5"
    },
    {
        "source_sentence": "　見世間渴仰，　　故不證涅槃。」",
        "translation": "Seeing the world's longing for it, they won't realize nirvāṇa.",
        "source": "T11n0314_001:0767a19_5"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「善男子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Good man!",
        "source": "T11n0314_001:0767a19_5"
    },
    {
        "source_sentence": "云何菩薩摩訶薩離慢及增上慢等？",
        "translation": "How does the bodhisattva Mahāsattva part with conceit and increase conceit?",
        "source": "T11n0314_001:0767a27_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0767a28_0"
    },
    {
        "source_sentence": "慢者，我自亦可，若家、若姓、若色，或復異事，金銀等資用，象兵、馬兵、步兵、車兵，",
        "translation": "Conceit means that I am able to control my own family, castes, colors, and forms, as well as different things: such necessities as gold and silver, elephant troops, horse troops, infantry, chariot troops, and",
        "source": "T11n0314_001:0767a28_1"
    },
    {
        "source_sentence": "如是心所有高下者名曰慢。",
        "translation": "Thus, what's high and low in the mind is called conceit.",
        "source": "T11n0314_001:0767a29_2"
    },
    {
        "source_sentence": "我慢者，生我身高想，若家、若姓、若色等，或金銀、財物、倉庫，象兵、馬兵、步兵、車兵，",
        "translation": "The conceit of self is the perception of self as a great being, whether it's family, surname, form, or so forth, or gold and silver, possessions, storehouses, elephant troops, horse troops, foot troops",
        "source": "T11n0314_001:0767b01_3"
    },
    {
        "source_sentence": "如是心喜高意，不下諸他者，名曰增上慢。",
        "translation": "Such a mind that's delighted with high intentions and doesn't despise others is called overweening conceit.",
        "source": "T11n0314_001:0767b03_4"
    },
    {
        "source_sentence": "菩薩捨如是等法，名曰離慢及增上慢。」",
        "translation": "A bodhisattva who abandons such things is called free of conceit and increased conceit.",
        "source": "T11n0314_001:0767b04_5"
    },
    {
        "source_sentence": "「離慢增上慢，　　常以慈心念，",
        "translation": "Being free of conceit and overweening conceit, he always thinks with kindness,",
        "source": "T11n0314_001:0767b05_6"
    },
    {
        "source_sentence": "　及常懷悲心，　　恒怖世間中，",
        "translation": "They always harbor compassion, Always fearful of the world.",
        "source": "T11n0314_001:0767b05_6"
    },
    {
        "source_sentence": "　常以行乞食，　　善說人天益。」",
        "translation": "He always practices begging for food and well explains the benefits of humans and gods.",
        "source": "T11n0314_001:0767b05_6"
    },
    {
        "source_sentence": "爾時世尊，欲重宣此義而說偈言：「善男子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Good man!",
        "source": "T11n0314_001:0767b05_6"
    },
    {
        "source_sentence": "云何菩薩摩訶薩善巧祕密語？",
        "translation": "What are the skillful esoteric sayings of the bodhisattvas and mahāsattvas?",
        "source": "T11n0314_001:0767b09_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0767b09_8"
    },
    {
        "source_sentence": "若菩薩摩訶薩，如來所說諸甚深經中祕密之教，彼不隨說取何者是祕密之教。",
        "translation": "If a bodhisattva-mahāsattva teaches the esoteric teachings in the profound sūtras taught by the Tathāgata, he doesn't follow them and grasp what's the esoteric teaching?",
        "source": "T11n0314_001:0767b10_9"
    },
    {
        "source_sentence": "如來記諸聲聞，於阿耨多羅三藐三菩提者，非如所說。」",
        "translation": "The Tathāgata remembers that śrāvakas attain supreme perfect enlightenment, but it's not as they say.",
        "source": "T11n0314_001:0767b11_10"
    },
    {
        "source_sentence": "佛語阿難：「吾患背痛不隨說取，退老患朽敗為我訪覓，侍者不隨說而取，",
        "translation": "The Buddha said to Ānanda, “I am suffering from back pain. I will not tell you how to fetch it.” [Ānanda] withdrew and lost his old age and decayed body in search of me.",
        "source": "T11n0314_001:0767b13_11"
    },
    {
        "source_sentence": "汝目連往至耆婆醫王所，取諸妙藥，不應如說取。",
        "translation": "You Maudgalyāyana, go to the physician king Jīvaka and obtain these wonderful medicines. Do not take them as you have been told.",
        "source": "T11n0314_001:0767b14_12"
    },
    {
        "source_sentence": "如來共諸外道尼揵子等，諍其諸伎，不應如說取。",
        "translation": "The Tathāgata and the non-Buddhist nuns, monks, and so forth, who disputed their tricks, shouldn't take them as they had been taught.",
        "source": "T11n0314_001:0767b15_13"
    },
    {
        "source_sentence": "如來佉陀羅刺刺足者，是事不應如說而取，提婆達多是如來久遠害者怨家，",
        "translation": "The Tathāgata caṇḍāla, who pierces his feet with a thorn, shouldn't take these things as he says, and Devadatta is the enemy of the Tathāgata who has been harming people for a long time.",
        "source": "T11n0314_001:0767b17_14"
    },
    {
        "source_sentence": "不應隨說而取。",
        "translation": "They shouldn't follow the explanation and grasp it.",
        "source": "T11n0314_001:0767b18_15"
    },
    {
        "source_sentence": "如來入舍梨耶婆羅門村，空鉢而出，不應如說而取。",
        "translation": "The Tathāgata entered the village of Śāriya and came out with an empty bowl, but he didn't take it just as he said.",
        "source": "T11n0314_001:0767b19_16"
    },
    {
        "source_sentence": "旃遮及孫陀利謗佛者，不應隨說而取。",
        "translation": "Kauṣṭhila and Sundarī denigrate the Buddha, so they shouldn't follow their explanations and grasp it.",
        "source": "T11n0314_001:0767b20_17"
    },
    {
        "source_sentence": "須那國毘羅若婆羅門，請佛至已食麥，亦不應如說而取。」",
        "translation": "The Brāhmaṇa Vairocana of Suna invited the Buddha to come and ate the wheat, so he didn't take it just as he said.",
        "source": "T11n0314_001:0767b21_18"
    },
    {
        "source_sentence": "爾時淨無垢妙淨寶月王光菩薩白佛言：「世尊！",
        "translation": "It was then that the pure, undefiled, marvelously pure jeweled moon king of light bodhisattva said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0767b22_19"
    },
    {
        "source_sentence": "世尊云何記諸聲聞當得阿耨多羅三藐三菩提？」",
        "translation": "Bhagavān, how do you predict that śrāvakas will attain supreme perfect enlightenment?",
        "source": "T11n0314_001:0767b23_20"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T11n0314_001:0767b24_21"
    },
    {
        "source_sentence": "吾記諸聲聞得無上正真正道者，以有性故。」",
        "translation": "I remember that śrāvakas attain the unsurpassed true path because they have a nature.",
        "source": "T11n0314_001:0767b25_0"
    },
    {
        "source_sentence": "淨無垢妙淨寶月王光菩薩白佛言：「世尊！",
        "translation": "The Bodhisattva Pure and Immaculate Sublime Pure Jeweled Moon King Radiance said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0767b26_0"
    },
    {
        "source_sentence": "云何諸無漏聲聞斷諸有習煩惱，設有性而成阿耨多羅三藐三菩提？」",
        "translation": "How do uncontaminated śrāvakas stop the accumulated afflictions of existence and have the nature to attain unsurpassed, correct, and complete enlightenment?",
        "source": "T11n0314_001:0767b26_1"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T11n0314_001:0767b28_2"
    },
    {
        "source_sentence": "吾今說喻。",
        "translation": "Now, I'll explain a metaphor.",
        "source": "T11n0314_001:0767b28_3"
    },
    {
        "source_sentence": "譬如灌頂轉輪聖王有子，彼欲學一切技藝等事，然是中根復非利根，彼應後學是先學，",
        "translation": "Good man, this is analogous to the case of a saintly king consecrated wheel-turning king who has a son who wishes to learn all the arts and crafts but his faculties are neither sharp nor middling. He should train later,",
        "source": "T11n0314_001:0767b29_4"
    },
    {
        "source_sentence": "應前學彼後學。",
        "translation": "You should train before and train after them.",
        "source": "T11n0314_001:0767c02_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0767c02_6"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T11n0314_001:0767c02_7"
    },
    {
        "source_sentence": "彼以此事故，可說非王子也？」",
        "translation": "Because of this, they can be said not to be princes?",
        "source": "T11n0314_001:0767c02_8"
    },
    {
        "source_sentence": "答曰：「不也！",
        "translation": "He replied, No!",
        "source": "T11n0314_001:0767c03_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0767c03_10"
    },
    {
        "source_sentence": "是善王子。」",
        "translation": "This is a good prince.",
        "source": "T11n0314_001:0767c03_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0767c04_12"
    },
    {
        "source_sentence": "菩薩亦爾，已成就中根性故修道門，先除諸煩惱障，後成阿耨多羅三藐三菩提。」",
        "translation": "So it is with bodhisattvas who have accomplished the path of cultivation because of their middling faculties, first removing the afflictive hindrances and then attaining unsurpassed, correct enlightenment.",
        "source": "T11n0314_001:0767c04_13"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0767c06_14"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T11n0314_001:0767c06_15"
    },
    {
        "source_sentence": "彼以此事故可說不成正覺？」",
        "translation": "Can they be said not to become perfectly enlightened because of this?",
        "source": "T11n0314_001:0767c06_16"
    },
    {
        "source_sentence": "答曰：「世尊！",
        "translation": "He replied, Bhagavān!",
        "source": "T11n0314_001:0767c07_17"
    },
    {
        "source_sentence": "我不見有眾生若天、若魔、若梵、若沙門、若婆羅門、人、天、阿修羅眾中說言不成正覺者，",
        "translation": "I see no gods, Māras, Brahmās, asuras, śramaṇas, brāhmaṇas, humans, gods, or asuras who say they do not attain enlightenment.",
        "source": "T11n0314_001:0767c07_18"
    },
    {
        "source_sentence": "除一闡提。」",
        "translation": "Except for icchantika.",
        "source": "T11n0314_001:0767c09_19"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T11n0314_001:0767c09_20"
    },
    {
        "source_sentence": "復聽一喻。",
        "translation": "Again, let's hear a parable.",
        "source": "T11n0314_001:0767c09_21"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0767c10_22"
    },
    {
        "source_sentence": "十地菩薩為斷諸煩惱坐於道場？",
        "translation": "In order to end the afflictions, do bodhisattvas of the tenth ground sit at the site of enlightenment?",
        "source": "T11n0314_001:0767c10_23"
    },
    {
        "source_sentence": "為不斷？」",
        "translation": "Why doesn't it stop?",
        "source": "T11n0314_001:0767c11_24"
    },
    {
        "source_sentence": "答曰：「世尊！",
        "translation": "He replied, Bhagavān!",
        "source": "T11n0314_001:0767c11_25"
    },
    {
        "source_sentence": "以斷故。」",
        "translation": "It's because it's stopped.",
        "source": "T11n0314_001:0767c11_26"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0767c11_27"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T11n0314_001:0767c11_28"
    },
    {
        "source_sentence": "彼以此，豈不成正覺？」",
        "translation": "Wouldn't they become perfectly enlightened because of this?",
        "source": "T11n0314_001:0767c12_29"
    },
    {
        "source_sentence": "答曰：「世尊！",
        "translation": "He replied, Bhagavān!",
        "source": "T11n0314_001:0767c12_30"
    },
    {
        "source_sentence": "此名為成。」",
        "translation": "This is called accomplishment.",
        "source": "T11n0314_001:0767c12_31"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T11n0314_001:0767c13_32"
    },
    {
        "source_sentence": "此亦如是。」",
        "translation": "This is likewise.",
        "source": "T11n0314_001:0767c13_33"
    },
    {
        "source_sentence": "淨無垢妙淨寶月王光菩薩白佛言：「世尊！",
        "translation": "The Bodhisattva Pure and Immaculate Sublime Pure Jeweled Moon King Radiance said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0767c13_34"
    },
    {
        "source_sentence": "云何告阿難比丘：『吾患背痛。』",
        "translation": "How did he tell the monk Ānanda, 'I'm suffering from back pain.'",
        "source": "T11n0314_001:0767c14_35"
    },
    {
        "source_sentence": "？」",
        "translation": "What is wrong with that?",
        "source": "T11n0314_001:0767c15_36"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T11n0314_001:0767c15_37"
    },
    {
        "source_sentence": "吾愍念後世眾生故說此言。",
        "translation": "I'm sad for the sentient beings of later generations and therefore say these words.",
        "source": "T11n0314_001:0767c15_38"
    },
    {
        "source_sentence": "金剛身諸佛尚患背痛，況其餘者？",
        "translation": "The Vajrapāṇi-body buddhas still suffer from back pain, so why wouldn't the rest?",
        "source": "T11n0314_001:0767c16_39"
    },
    {
        "source_sentence": "然彼愚癡眾生隨教而取，彼既自壞，亦壞於他。",
        "translation": "Still, those foolish sentient beings follow the teaching and grasp it, and as they themselves break down, so do others.",
        "source": "T11n0314_001:0767c17_0"
    },
    {
        "source_sentence": "『吾朽敗老退患，為我訪覓侍者。』",
        "translation": "'I'm rotten, decrepit, old, and regressing, so I'll look for an attendant.'",
        "source": "T11n0314_001:0767c18_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0767c18_2"
    },
    {
        "source_sentence": "我此言亦為後世所說，於我滅後，後世無弟子，故說沙門、婆羅門朽敗老退患者，",
        "translation": "Because there will be no disciples in the afterlife after my nirvana. Therefore, it is said that śramaṇas and brāhmaṇas are suffering from decay, old age, and regressing.",
        "source": "T11n0314_001:0767c18_3"
    },
    {
        "source_sentence": "如是以侍者所加身故，彼以佛聽故不生之意，為此故說如來朽敗老退患耳。」",
        "translation": "Thus, because the attendant's body is empowered by this, they don't give rise to the thought that it's because the Buddha hears and therefore explains the Tathāgata's decaying old age and regressing suffering for this reason",
        "source": "T11n0314_001:0767c20_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0767c22_5"
    },
    {
        "source_sentence": "云何，可取『汝目連，往至耆婆大醫王所取藥。』",
        "translation": "How can you take the medicine? 'You, Maudgalyāyana, go to the great king of doctors in Jīvaka and get it.'",
        "source": "T11n0314_001:0767c22_6"
    },
    {
        "source_sentence": "？」",
        "translation": "What is wrong with that?",
        "source": "T11n0314_001:0767c23_7"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0767c23_8"
    },
    {
        "source_sentence": "我此言亦為後世故說，吾諸聲聞必須諸藥，知佛聽故而無有乏。",
        "translation": "I say these words for the sake of future generations, 'My śrāvakas must have medicine, knowing that the Buddha hears them so there's no lack.'",
        "source": "T11n0314_001:0767c23_9"
    },
    {
        "source_sentence": "為此事故如來所說。",
        "translation": "It's for this reason that the Tathāgata explains it.",
        "source": "T11n0314_001:0767c25_10"
    },
    {
        "source_sentence": "彼諸愚癡眾生如所說取，如來是患身，目連比丘往至耆婆所，而不禮拜及不生恭敬，",
        "translation": "Those ignorant and deluded sentient beings grasp the Tathāgata as he teaches, which is a sick body of the Tathāgata. The monk Maudgalyāyana went to Jīvaka but didn't venerate him or show respect.",
        "source": "T11n0314_001:0767c25_11"
    },
    {
        "source_sentence": "速疾之意聞已，怱怱說其藥。",
        "translation": "Upon hearing this, the man with a sense of urgency told him to prescribe the medicine.",
        "source": "T11n0314_001:0767c27_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0767c28_13"
    },
    {
        "source_sentence": "此亦說諸欲等患，證見法者尚忘，何況凡夫？」",
        "translation": "This also explains the afflictions of desire and so forth, which are still forgotten by those who realize the teaching, so why wouldn't ordinary people?",
        "source": "T11n0314_001:0767c28_14"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0767c29_15"
    },
    {
        "source_sentence": "云何所取？",
        "translation": "What's grasped?",
        "source": "T11n0314_001:0767c29_16"
    },
    {
        "source_sentence": "『如來共諸外道尼乾子等，諍其諸伎者。』",
        "translation": "'The Tathāgata and the non-Buddhist nuns, such as Nirgrantha and others, pity those who play tricks.'",
        "source": "T11n0314_001:0767c29_17"
    },
    {
        "source_sentence": "我為後世眾生故說此言，如來尚有怨家，況於我等？",
        "translation": "I say these words for the sake of sentient beings in later generations. The Tathāgata still has an enemy family, so why wouldn't we?",
        "source": "T11n0314_001:0768a01_18"
    },
    {
        "source_sentence": "然彼愚癡眾生如實說取，如來有怨家等。",
        "translation": "Still, those foolish sentient beings truly say grasping, the Tathāgata has enemies and so forth.",
        "source": "T11n0314_001:0768a03_19"
    },
    {
        "source_sentence": "轉輪聖王微善根故，尚無諸患，況如來也，成就諸功德藏，云何所取？",
        "translation": "Because the wheel-turning sage king has weak roots of goodness, he doesn't even have any troubles, so why wouldn't the Tathāgata accomplish the store of merit? How would he take it?",
        "source": "T11n0314_001:0768a04_0"
    },
    {
        "source_sentence": "佉陀羅刺刺如來足，如來亦說過去業報，如來尚受過去業報，況餘凡夫？",
        "translation": "Gandhāra stabbed the Tathāgata's feet, and the Tathāgata also explained the results of past actions, so the Tathāgata still received the results of past actions, so why wouldn't other worldlings?",
        "source": "T11n0314_001:0768a05_1"
    },
    {
        "source_sentence": "眾生為是事故，為彼因彼緣故，示於惡業。",
        "translation": "Because of these causes and conditions, sentient beings are shown bad actions.",
        "source": "T11n0314_001:0768a07_2"
    },
    {
        "source_sentence": "為此義故，而示其業果報事。",
        "translation": "Because of this meaning, they show the results of their actions.",
        "source": "T11n0314_001:0768a08_3"
    },
    {
        "source_sentence": "然彼愚癡眾生，如實所取，佉陀羅刺刺如來足。」",
        "translation": "Still, those foolish sentient beings take it as it really is, and the caṇḍāla pierces the Tathāgata's feet.",
        "source": "T11n0314_001:0768a08_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0768a10_0"
    },
    {
        "source_sentence": "云何可取？",
        "translation": "How can it be grasped?",
        "source": "T11n0314_001:0768a10_1"
    },
    {
        "source_sentence": "『提婆達多是善知識，復是如來久遠親近是怨家者。』」",
        "translation": "'Devadatta is a good friend, and the Tathāgata's long-standing association with people who are enemies.'",
        "source": "T11n0314_001:0768a10_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0768a11_3"
    },
    {
        "source_sentence": "若無提婆達多善知識者，不顯如來諸佛功德。",
        "translation": "If someone doesn't have Devadatta as a good teacher, they won't show the merits of the buddhas of the Tathāgata.",
        "source": "T11n0314_001:0768a11_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0768a12_5"
    },
    {
        "source_sentence": "是以提婆達多善知識，共如來諍伎等道德，示怨家等事。",
        "translation": "That's why Devadatta, a good friend of the Tathāgata, shared the Tathāgata's morality of skillful means and so forth, shown enemies and other things.",
        "source": "T11n0314_001:0768a12_6"
    },
    {
        "source_sentence": "然是顯如來諸大智功德。",
        "translation": "However, this shows the great merit of the Tathāgata's great wisdom.",
        "source": "T11n0314_001:0768a14_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0768a14_8"
    },
    {
        "source_sentence": "若提婆達多承王教已，於大眾中放護財大象，此象若往堪害如來，而如來力令降伏善調。",
        "translation": "Suppose Devadatta, having received the king's instruction, releases a great elephant that protects his wealth among the masses, and if this elephant goes there, it's capable of harming the Tathāgata, but the Tathā",
        "source": "T11n0314_001:0768a15_0"
    },
    {
        "source_sentence": "爾時無量人眾見彼象調伏已，生希有希有心，即歸依三寶——所謂佛寶、法寶、僧寶——是名提婆達多善知識之相。",
        "translation": "At the time, an immeasurable number of people saw that elephant subdued, gave rise to a rare and a rare mind, and took refuge in the Three Treasures-the so-called Buddha treasure, Dharma treasure, and Saṃgha treasure",
        "source": "T11n0314_001:0768a17_1"
    },
    {
        "source_sentence": "然有愚癡之人如說而取，提婆達多者是如來怨家。",
        "translation": "Still, there are foolish people who take it as they say, and Devadatta is the Tathāgata's enemy.",
        "source": "T11n0314_001:0768a19_2"
    },
    {
        "source_sentence": "如是五百世中現菩薩行，是提婆達多所示現者，顯如來道德，然愚癡眾生隨教而取，",
        "translation": "In this way, the practice of enlightening beings is manifested in five hundred aeons. This is what Devadatta has manifested to show that reveals the virtues of buddhahood, yet ignorant sentient beings follow their instruction and grasp",
        "source": "T11n0314_001:0768a20_3"
    },
    {
        "source_sentence": "提婆達多者是如來怨家害者，以是因緣，捨身墮阿鼻地獄、餓鬼、畜生之處。",
        "translation": "Devadatta is the Tathāgata who's harmed by an enemy, and because of this cause and condition, he abandons his body and falls into avīci hell, hungry ghosthood, or animal rebirth.",
        "source": "T11n0314_001:0768a22_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0768a24_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0768a24_6"
    },
    {
        "source_sentence": "提婆達多者善集諸行，善集諸善根，以曾供養無量諸佛，於諸佛所種諸善根及大乘行，",
        "translation": "Devadatta is a skillful aggregator of practices, a skillful aggregator of roots of goodness. He has served innumerable buddhas and planted the roots of goodness and the practices of the Great Vehicle in the presence of",
        "source": "T11n0314_001:0768a24_7"
    },
    {
        "source_sentence": "正學菩提、順向菩提、不退於大菩提，近阿耨多羅三藐三菩提。",
        "translation": "He correctly trains for enlightenment, follows the path to enlightenment, doesn't regress from great enlightenment, and approaches unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0314_001:0768a26_8"
    },
    {
        "source_sentence": "是諸眾生偏起惡故，於命終後墮阿鼻地獄、餓鬼、畜生之中歷受諸苦。",
        "translation": "Because sentient beings are partial and do evil, they'll fall into the avīci hell, hungry ghosts, and animals after their lives end and experience suffering.",
        "source": "T11n0314_001:0768a28_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0768a29_10"
    },
    {
        "source_sentence": "云何所取？",
        "translation": "What's grasped?",
        "source": "T11n0314_001:0768a29_11"
    },
    {
        "source_sentence": "『如來入舍梨耶婆羅門村。』",
        "translation": "'The Tathāgata enters the village of Śāriya- brāhmaṇa.'",
        "source": "T11n0314_001:0768b01_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0768b01_13"
    },
    {
        "source_sentence": "我為愍後世故，行示此教。",
        "translation": "Because of my anger, I'll practice and show this teaching in the afterlife.",
        "source": "T11n0314_001:0768b01_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0768b02_15"
    },
    {
        "source_sentence": "無有業報而對如來。",
        "translation": "There's no karmic retribution and yet he's facing the Tathāgata.",
        "source": "T11n0314_001:0768b02_16"
    },
    {
        "source_sentence": "然我護後世故，所有乞食比丘入聚落村邑城郭王都等，以薄福力故不得其食。",
        "translation": "However, in order to protect myself in the afterlife, all those monks who are begging for food enter villages, towns, cities, castles, kingdoms, and so forth, but because of weak merit they won't get their food.",
        "source": "T11n0314_001:0768b03_17"
    },
    {
        "source_sentence": "彼爾時正憶於我：『是其佛世尊具足一切功德，空鉢而出，何況我等微薄善根？",
        "translation": "At the time, he correctly recalled to me, 'That Buddha Bhagavān is endowed with all merits and comes out with an empty bowl, so why wouldn't we have weak good roots?'",
        "source": "T11n0314_001:0768b05_0"
    },
    {
        "source_sentence": "我等以是故，心不應生退。』",
        "translation": "Because of this, we shouldn't regress in mind.'",
        "source": "T11n0314_001:0768b06_1"
    },
    {
        "source_sentence": "為此事故，如來入村空鉢而出。",
        "translation": "For this reason, the Tathāgata entered the village, emptied his bowl, and departed.",
        "source": "T11n0314_001:0768b07_2"
    },
    {
        "source_sentence": "然復所說言：『魔波旬治諸婆羅門令不給如來食。』",
        "translation": "Still, it's also said,'Māra Pāpīyān treats the Brāhmaṇas so that they won't give food to the Tathāgata.'",
        "source": "T11n0314_001:0768b08_3"
    },
    {
        "source_sentence": "不應隨說而取。",
        "translation": "They shouldn't follow the explanation and grasp it.",
        "source": "T11n0314_001:0768b09_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0768b09_5"
    },
    {
        "source_sentence": "魔無如是神力堪障施如來食。",
        "translation": "Māra doesn't have such miraculous powers to obstruct the Tathāgata's food.",
        "source": "T11n0314_001:0768b09_6"
    },
    {
        "source_sentence": "爾時諸佛神力故，令魔處處治諸婆羅門及居士等，而如來無有過咎。",
        "translation": "At the time, the buddhas' miraculous powers caused Māra to rule the Brāhmaṇas and householders everywhere, but the Tathāgata didn't blame them.",
        "source": "T11n0314_001:0768b10_7"
    },
    {
        "source_sentence": "為顯彼眾生故，如來示現此方便善巧等事。",
        "translation": "In order to show those sentient beings, the Tathāgata shows these skillful means and other things.",
        "source": "T11n0314_001:0768b12_0"
    },
    {
        "source_sentence": "爾時如來及諸聲聞，斷食之後，魔及魔民并諸餘天，觀如來心：『是沙門瞿曇及諸聲聞弟子為憂惱不？』",
        "translation": "After the Tathāgata and the śrāvakas then stopped eating, Māra, the Māra's people, and the other gods observed the Tathāgata's mind, saying, 'Is this the ascetic Gautama and the śrāvaka disc",
        "source": "T11n0314_001:0768b13_0"
    },
    {
        "source_sentence": "彼日觀如來及諸弟子，無有意恨憂惱心已，亦不高不下，如前後亦如是。",
        "translation": "On that day, he observed that the Tathāgata and his disciples had no thoughts of anger or grief, and they didn't go up or down, just as before or after.",
        "source": "T11n0314_001:0768b15_1"
    },
    {
        "source_sentence": "爾時彼眾中七千諸天子，以心歡喜，歸依於佛。",
        "translation": "At the time, 7,000 celestial beings in that crowd rejoiced and relied on the Buddha.",
        "source": "T11n0314_001:0768b16_2"
    },
    {
        "source_sentence": "如來為彼善化說妙法，彼聞法已，於如來法中得法眼淨。",
        "translation": "The Tathāgata skillfully transforms them and explains the wonderful teaching for them, and after hearing the teaching, they attain purity of the Dharma eye in the Tathāgata's teaching.",
        "source": "T11n0314_001:0768b18_0"
    },
    {
        "source_sentence": "如是如來觀後世事，佛無業報。」",
        "translation": "Thus, the Tathāgata observes that in later lives, the Buddha has no karmic retribution.",
        "source": "T11n0314_001:0768b19_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0768b20_0"
    },
    {
        "source_sentence": "云何可取？",
        "translation": "How can it be grasped?",
        "source": "T11n0314_001:0768b20_1"
    },
    {
        "source_sentence": "『旃遮孫陀利等以木器置腹上而謗如來。』」",
        "translation": "' Kauṣṭhila Suntory and others put wooden vessels on their bellies to denigrate the Tathāgata.'",
        "source": "T11n0314_001:0768b20_2"
    },
    {
        "source_sentence": "答曰：「善男子！",
        "translation": "He replied, Good man!",
        "source": "T11n0314_001:0768b21_3"
    },
    {
        "source_sentence": "如來無有業患果報。",
        "translation": "The Tathāgata doesn't have the results of karma and suffering.",
        "source": "T11n0314_001:0768b21_4"
    },
    {
        "source_sentence": "如來成就諸神通力，令旃遮孫陀利過無量恒河沙等世界，令安彼人。",
        "translation": "The Tathāgata has accomplished the miraculous powers to cause Kauṣṭhila Sundatta to cross measureless worlds as numerous as the sands of the Ganges River and make those people comfortable.",
        "source": "T11n0314_001:0768b22_5"
    },
    {
        "source_sentence": "然是如來方便力故，示現業報諸謗等事。",
        "translation": "However, it's because of the power of the Tathāgata's skillful means that he shows the results of actions and denigrates such things.",
        "source": "T11n0314_001:0768b23_6"
    },
    {
        "source_sentence": "於我法中出家者，彼被虛謗，既聞謗已，而生憂愁疑悔。",
        "translation": "If someone leaves home in my teaching, they'll be falsely denigrated, and after hearing that denigration, they'll become sad and doubtful.",
        "source": "T11n0314_001:0768b24_7"
    },
    {
        "source_sentence": "彼作如是說：『是如來成就一切諸白法，對面被謗，何況我等而不被謗？』",
        "translation": "They say, 'This is the Tathāgata who accomplishes all the white dharmas and is denigrated face-to-face, so why wouldn't we be denigrated?'",
        "source": "T11n0314_001:0768b25_8"
    },
    {
        "source_sentence": "彼爾時忍其諸謗，行清淨梵行而不成退。",
        "translation": "At that point, they tolerate their slander and practice the pure religious practice without retreating.",
        "source": "T11n0314_001:0768b27_9"
    },
    {
        "source_sentence": "旃遮孫陀利者，以惡業所牽，乃至夢中謗其如來，謗已捨身墮於惡趣。",
        "translation": "Kauṣṭhila Sundarī is drawn by bad karma and even denigrating the Tathāgata in a dream, and after denigrating him, he abandons his body and falls into a bad destiny.",
        "source": "T11n0314_001:0768b28_10"
    },
    {
        "source_sentence": "若如來知是可救者，便應救之。",
        "translation": "If the Tathāgata knows that they can be saved, he should rescue them.",
        "source": "T11n0314_001:0768b29_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0768c01_12"
    },
    {
        "source_sentence": "如來無有眾生而是可捨者。」",
        "translation": "The Tathāgata has no sentient beings but those who can abandon them.",
        "source": "T11n0314_001:0768c01_13"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0768c02_14"
    },
    {
        "source_sentence": "云何可取？",
        "translation": "How can it be grasped?",
        "source": "T11n0314_001:0768c02_15"
    },
    {
        "source_sentence": "『如來於修羅婆國毘蘭若婆羅門所，請三月安居已，唯食其麥。』」",
        "translation": "'The Tathāgata invited the Brāhmaṇa Vaiśravaṇa to stay in Sūrya for three months and only ate his wheat.'",
        "source": "T11n0314_001:0768c02_16"
    },
    {
        "source_sentence": "答曰：「如來知諸婆羅門居士等請已而不供養。",
        "translation": "He answered, The Tathāgata knows that the Brāhmaṇas and other householders won't make offerings after inviting them.",
        "source": "T11n0314_001:0768c04_17"
    },
    {
        "source_sentence": "如來知已，故往至彼。",
        "translation": "Knowing this, the Tathāgata therefore went there.",
        "source": "T11n0314_001:0768c05_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0768c05_19"
    },
    {
        "source_sentence": "所有五百匹馬者，如來并諸比丘眾食麥，彼一切盡修菩薩行，親近過去諸佛，",
        "translation": "The five hundred horses that they had were fed with wheat by the Tathāgata and the assembly of monks. All of them cultivated all the practices of enlightening beings and became intimate with the buddhas of the past.",
        "source": "T11n0314_001:0768c05_20"
    },
    {
        "source_sentence": "是以值惡知識故造諸惡業，以此事生畜生中，彼五百馬能調伏教者，名曰金剛藏菩薩，",
        "translation": "That's why they met bad friends and created bad actions. Because of this, they were born among animals. Those five hundred horses who can tame and teach them are called the Vajragarbha Bodhisattva.",
        "source": "T11n0314_001:0768c07_21"
    },
    {
        "source_sentence": "以願力故生於彼處。",
        "translation": "Because of the power of their vow, they'll be born there.",
        "source": "T11n0314_001:0768c09_22"
    },
    {
        "source_sentence": "是諸馬者，以日藏菩薩所化發菩提心，為化彼故應生彼處。",
        "translation": "These horses are the sun-store bodhisattvas who give rise to the mind of enlightenment by transforming themselves, and in order to transform them, they should be born there.",
        "source": "T11n0314_001:0768c10_23"
    },
    {
        "source_sentence": "以彼調伏馬師力故，彼一切諸馬憶本宿命，而彼現其菩提心。",
        "translation": "Because of the power of that taming horse trainer, all those horses remember their past lives and show their minds of enlightenment.",
        "source": "T11n0314_001:0768c11_24"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0768c13_0"
    },
    {
        "source_sentence": "如來愍彼五百馬故，往至彼處調伏馬師，麥者分半施佛，五百馬所有麥亦分半施諸比丘。",
        "translation": "Because the Tathāgata had pity for those five hundred horses, he went there to tame the horse trainer and gave half of the wheat to the Buddha and half of the 500 horses' worth of wheat to the monks.",
        "source": "T11n0314_001:0768c13_1"
    },
    {
        "source_sentence": "彼馬師以馬音聲，令彼五百馬，令能悔過及禮拜佛僧等。",
        "translation": "That horse master uses the sound of his horse to cause those five hundred horses to repent and venerate the buddhas, monks, and so forth.",
        "source": "T11n0314_001:0768c15_2"
    },
    {
        "source_sentence": "爾時彼三說後，彼諸馬捨身已，生兜率陀天中，彼復生天中而供養如來。",
        "translation": "After these three teachings, those horses abandoned their bodies and were born in the Tuṣita Heaven, and they were again born in that heaven to make offerings to the Tathāgata.",
        "source": "T11n0314_001:0768c16_3"
    },
    {
        "source_sentence": "如來為彼善教化說法，聞法已即不退阿耨多羅三藐三菩提。",
        "translation": "The Tathāgata well teaches and transforms the Dharma for them, and after hearing the teaching, he doesn't regress from unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0314_001:0768c18_4"
    },
    {
        "source_sentence": "彼五百馬所調伏護者，如來亦記彼當成辟支佛，號曰善調伏心。",
        "translation": "Those five hundred horses were disciplined and guarded, and the Tathāgata also predicted that they would become pratyekabuddhas, whose name was well-regulated mind.",
        "source": "T11n0314_001:0768c19_5"
    },
    {
        "source_sentence": "然復，善男子！",
        "translation": "Again, good man!",
        "source": "T11n0314_001:0768c21_6"
    },
    {
        "source_sentence": "如來無慈不備、不常者。",
        "translation": "The Tathāgata has no compassion, no preparation, and no permanence.",
        "source": "T11n0314_001:0768c21_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0768c21_8"
    },
    {
        "source_sentence": "設使如來食土木瓦石等，無三千大千世界中，有如是味及如是上味，是諸土木瓦石等。",
        "translation": "Suppose the Tathāgata eats clay, wood, tiles, stones, and so forth, and there are 3,000 great one-thousand worlds in which there's such taste and such a superior taste, these are the clays, wood",
        "source": "T11n0314_001:0768c22_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0768c24_10"
    },
    {
        "source_sentence": "如來得上妙味中之味，大人之相故。",
        "translation": "The Tathāgata attains the taste of the most sublime flavor among flavors because it's the characteristic of a great person.",
        "source": "T11n0314_001:0768c24_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0768c25_12"
    },
    {
        "source_sentence": "以此義故應如是知，如來一切諸食皆上妙味。",
        "translation": "Because of this meaning, you should thus know that all the Tathāgata's food has the highest marvelous taste.",
        "source": "T11n0314_001:0768c25_13"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0768c26_14"
    },
    {
        "source_sentence": "阿難比丘生憐愍心，如來捨轉輪王位，今既食麥。",
        "translation": "The monk Ānanda felt pity for the Tathāgata, who had relinquished his throne as wheel-turning king and now ate wheat.",
        "source": "T11n0314_001:0768c26_15"
    },
    {
        "source_sentence": "如來知阿難心已，施其一麥，故語阿難言：『汝知是何味？』",
        "translation": "Knowing Ānanda's mind, the Tathāgata gave him one grain of wheat, so he said to Ānanda, 'Do you know what flavor it is?'",
        "source": "T11n0314_001:0768c27_16"
    },
    {
        "source_sentence": "彼食已生奇特異相，語我言：『世尊！",
        "translation": "Having eaten it, he gave rise to a strange appearance and said to me, 'Bhagavān!",
        "source": "T11n0314_001:0768c28_17"
    },
    {
        "source_sentence": "我生王家長養，未曾甞如是上味。』",
        "translation": "I was born to the king's parents, and I've never tasted such a superior taste.'",
        "source": "T11n0314_001:0768c29_18"
    },
    {
        "source_sentence": "以此上味力故，阿難比丘七日受上妙快樂，而不復食。",
        "translation": "Because of the power of this superior taste, the monk Ānanda experienced a supremely wonderful happiness for seven days and didn't eat again.",
        "source": "T11n0314_001:0769a01_19"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0769a02_20"
    },
    {
        "source_sentence": "以此義故，應如是知，如來無有諸業果報。",
        "translation": "Because of this meaning, you should thus know that the Tathāgata has no karmic retribution.",
        "source": "T11n0314_001:0769a02_21"
    },
    {
        "source_sentence": "若有眾生淨持諸戒，若沙門及婆羅門，不隨本請奉施者，為彼眾生說不虛故，",
        "translation": "If there are sentient beings who purely observe the precepts, and if a renunciant or brāhmaṇa doesn't follow the original invitation to give almsgiving, it's because he explains for those sentient beings what's",
        "source": "T11n0314_001:0769a03_22"
    },
    {
        "source_sentence": "如來示此業果報事。",
        "translation": "The Tathāgata shows the results of these actions.",
        "source": "T11n0314_001:0769a05_23"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0769a06_24"
    },
    {
        "source_sentence": "汝觀如來諸身等法，是彼婆羅門請如來而不施設，如來亦說彼令不退轉。",
        "translation": "Observe the Tathāgata's bodies and other dharmas, for which that brāhmaṇa invites the Tathāgata but doesn't define them, and the Tathāgata also explains them so they won't regress.",
        "source": "T11n0314_001:0769a06_25"
    },
    {
        "source_sentence": "然，善男子！",
        "translation": "Still, good man!",
        "source": "T11n0314_001:0769a08_0"
    },
    {
        "source_sentence": "所說彼五百比丘，如來記令不退者。",
        "translation": "Those five hundred monks were taught by the Tathāgata, who instructed them not to retreat.",
        "source": "T11n0314_001:0769a08_1"
    },
    {
        "source_sentence": "復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T11n0314_001:0769a09_2"
    },
    {
        "source_sentence": "所有彼五百比丘，共如來夏坐安居中，有四十比丘，多念於欲結，靜念彼若得美食者，",
        "translation": "Those five hundred monks were sitting in the summer retreat together with the Tathāgata. Forty monks, mostly mindful of the fetters of desire, quietly thought:",
        "source": "T11n0314_001:0769a09_3"
    },
    {
        "source_sentence": "欲想、欲覺便令熾盛，彼以惡食因緣故，欲想、欲覺亦微。",
        "translation": "Desire and feelings of desire will then become intense, and because of the causes and conditions of bad food, conceptions of desire and feelings of desire will also decrease.",
        "source": "T11n0314_001:0769a11_4"
    },
    {
        "source_sentence": "既微已，彼七日七夜得阿羅漢果。",
        "translation": "For seven days and nights they will attain the fruit of arhatship.",
        "source": "T11n0314_001:0769a12_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0769a13_6"
    },
    {
        "source_sentence": "若能如是解如來所說語者，彼名為正解。",
        "translation": "If someone can understand the words spoken by the Tathāgata in this way, they're called right understanding.",
        "source": "T11n0314_001:0769a13_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0769a14_8"
    },
    {
        "source_sentence": "菩薩摩訶薩成就如是，名為善巧解如來祕密說教。」",
        "translation": "The bodhisattva Mahāsattva accomplishes this, which is called skillfully understanding the Tathāgata's esoteric teaching.",
        "source": "T11n0314_001:0769a14_9"
    },
    {
        "source_sentence": "「所說漸義教，　　及以頓說者，",
        "translation": "“The gradual doctrine that has been taught, and those who teach it in a sudden way.",
        "source": "T11n0314_001:0769a15_10"
    },
    {
        "source_sentence": "　大智諸菩薩，　　祕密故正解，",
        "translation": "The enlightening beings of great knowledge Understand correctly because they are esoteric.",
        "source": "T11n0314_001:0769a15_10"
    },
    {
        "source_sentence": "　善巧諸密語，　　舍利報說教，",
        "translation": "Skillful in esoteric sayings, Śāriputra's retribution is to teach the Dharma.",
        "source": "T11n0314_001:0769a15_10"
    },
    {
        "source_sentence": "　通達正說法，　　諸佛之所說。」",
        "translation": "He comprehends the correct teaching of the Dharma, which is taught by the buddhas.",
        "source": "T11n0314_001:0769a15_10"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：「善男子！",
        "translation": "It was then that the Bhagavān wanted to reiterate this meaning and spoke a verse, Good man!",
        "source": "T11n0314_001:0769a15_10"
    },
    {
        "source_sentence": "云何菩薩摩訶薩不喜樂聲聞、辟支佛乘？",
        "translation": "How does the bodhisattva Mahāsattva not delight in the vehicle of śrāvakas and pratyekbuddhas?",
        "source": "T11n0314_001:0769a21_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0769a22_12"
    },
    {
        "source_sentence": "若菩薩摩訶薩，或以地獄苦，餓鬼、畜生等受諸重惡，而不喜樂求聲聞涅槃。",
        "translation": "Suppose a bodhisattva-mahāsattva suffers from the suffering of hell, hungry ghosts, animals, and other heavy evils and doesn't delight in seeking the nirvāṇa of śrāvakas.",
        "source": "T11n0314_001:0769a22_13"
    },
    {
        "source_sentence": "復不念云何得厭離世間心？",
        "translation": "How can he become disillusioned with worldly thoughts if he doesn't think about them?",
        "source": "T11n0314_001:0769a24_0"
    },
    {
        "source_sentence": "令速得自在。",
        "translation": "They'll quickly attain mastery.",
        "source": "T11n0314_001:0769a24_1"
    },
    {
        "source_sentence": "亦不求少欲、少作等，復不求少欲、少作等行因。",
        "translation": "They don't seek the causes of few desires, few actions, and so forth, and they don't seek the causes of few desires, few actions, and so forth.",
        "source": "T11n0314_001:0769a24_2"
    },
    {
        "source_sentence": "彼所見諸眾生修諸善業者，菩薩佐助令成。",
        "translation": "When they see sentient beings cultivating good actions, the bodhisattva assists them to accomplish them.",
        "source": "T11n0314_001:0769a26_0"
    },
    {
        "source_sentence": "及勸諸眾生讚歎正說正示，向阿耨多羅三藐三菩提。",
        "translation": "They also encourage sentient beings to praise and praise the correct teaching and direct them toward unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0314_001:0769a27_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0769a28_1"
    },
    {
        "source_sentence": "菩薩摩訶薩成就如是諸功德，不喜樂聲聞、辟支佛乘。",
        "translation": "A bodhisattva-mahāsattva who accomplishes such virtues doesn't delight in the vehicle of śrāvakas and pratyekbuddhas.",
        "source": "T11n0314_001:0769a28_2"
    },
    {
        "source_sentence": "「化眾無疲倦，　　不退於菩提，",
        "translation": "Enlightening beings are not weary, And do not regress from enlightenment.",
        "source": "T11n0314_001:0769a29_3"
    },
    {
        "source_sentence": "　持心如山王，　　行慈心等法。」",
        "translation": "He maintains his mind like a mountain king and practices the Dharma of kindness.",
        "source": "T11n0314_001:0769a29_3"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：爾時淨無垢妙淨寶月王光菩薩白佛言：「世尊！",
        "translation": "Desiring to reiterate this meaning, the Bhagavān then spoke these verses, saying, At that point, the pure and unsullied marvelous Pure Jeweled King Moon King Light Bodhisattva said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0769a29_3"
    },
    {
        "source_sentence": "如來已說諸法，菩薩成就諸法已名為住大乘。",
        "translation": "The Tathāgata has explained the teachings, and bodhisattvas who have accomplished the teachings are called abiding in the great vehicle.",
        "source": "T11n0314_001:0769b05_4"
    },
    {
        "source_sentence": "然如來不說以何義故，名為大乘？」",
        "translation": "What's the reason the Tathāgata doesn't teach that it's called the great vehicle?",
        "source": "T11n0314_001:0769b06_5"
    },
    {
        "source_sentence": "爾時世尊告淨無垢妙淨寶月王光菩薩言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the pure, undefiled, marvelously pure jeweled moon king of light bodhisattva, saying, Good sons!",
        "source": "T11n0314_001:0769b06_6"
    },
    {
        "source_sentence": "吾今問汝，隨汝意說。",
        "translation": "Now, I'll ask you to explain it as you wish.",
        "source": "T11n0314_001:0769b08_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0769b08_8"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T11n0314_001:0769b08_9"
    },
    {
        "source_sentence": "轉輪聖王并四兵眾隨所行者，彼道以何說耶？」",
        "translation": "What does the wheel-turning sage king and his four armies say to those who follow them?",
        "source": "T11n0314_001:0769b09_10"
    },
    {
        "source_sentence": "答曰：「世尊！",
        "translation": "He replied, Bhagavān!",
        "source": "T11n0314_001:0769b10_11"
    },
    {
        "source_sentence": "名曰王道，亦名大道，名無畏道，名無障礙道，名為寂靜道。」",
        "translation": "It's called the king path, which is also called the great path, the fearless path, the unobstructed path, and the tranquil path.",
        "source": "T11n0314_001:0769b10_12"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T11n0314_001:0769b11_13"
    },
    {
        "source_sentence": "如來亦爾。",
        "translation": "The Tathāgata is likewise.",
        "source": "T11n0314_001:0769b12_14"
    },
    {
        "source_sentence": "隨所乘乘至阿耨多羅三藐三菩提，彼乘名為大乘，名為上乘，名為妙乘，",
        "translation": "Whatever vehicle they ride up to unexcelled, perfect enlightenment, that vehicle is called the great vehicle, which is called the superior vehicle, and which is called the marvelous vehicle.",
        "source": "T11n0314_001:0769b12_15"
    },
    {
        "source_sentence": "名微妙乘，名曰勝乘，名無上乘，名無惡乘，名無比乘，名無等乘，名無等等乘。",
        "translation": "It's called the subtle vehicle, which is called the superior vehicle, the unsurpassed vehicle, the bad vehicle, the peerless vehicle, the unequalled vehicle, and the unequalled vehicle.",
        "source": "T11n0314_001:0769b13_16"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0769b15_17"
    },
    {
        "source_sentence": "以此義故名為大乘。」",
        "translation": "Because of this meaning, it's called the great vehicle.",
        "source": "T11n0314_001:0769b15_18"
    },
    {
        "source_sentence": "答曰：「善哉！",
        "translation": "He replied, Good!",
        "source": "T11n0314_001:0769b16_19"
    },
    {
        "source_sentence": "大乘。",
        "translation": "The great vehicle.",
        "source": "T11n0314_001:0769b16_20"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0769b16_21"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T11n0314_001:0769b16_22"
    },
    {
        "source_sentence": "大乘。」",
        "translation": "The great vehicle.",
        "source": "T11n0314_001:0769b16_23"
    },
    {
        "source_sentence": "爾時魔王波旬作如是念：「此沙門瞿曇過吾境界，亦令餘者能過境界。",
        "translation": "It was then that Māra King Pāpīyān had this thought, This ascetic Gautama goes beyond my bounds, and he causes others to go beyond their bounds.",
        "source": "T11n0314_001:0769b17_24"
    },
    {
        "source_sentence": "若我集四兵眾共往惱亂，及不說此法故，至沙門瞿曇所。」",
        "translation": "If I gather the four armies of my army together and go into disorder, or if I don't explain this teaching, I'll go to the ascetic Gautama.",
        "source": "T11n0314_001:0769b18_25"
    },
    {
        "source_sentence": "爾時魔王波旬，將領四部兵眾，至王舍大城耆闍崛山。",
        "translation": "It was then that Māra King Pāpīyān led his fourfold army to the great city of Rājagṛha on Mount Gṛdhrakūṭa.",
        "source": "T11n0314_001:0769b19_26"
    },
    {
        "source_sentence": "爾時淨無垢妙淨寶月王光菩薩，遙見魔王波旬將領四部兵眾來，欲為此法令作妨故。",
        "translation": "It was then that the Bodhisattva Pure, Immaculate, Sublime, Wonderfully Pure Jeweled Moon King Radiant King saw Māra King Pāpīyān coming from a distance with four armies of soldiers who wanted to obstruct this",
        "source": "T11n0314_001:0769b21_27"
    },
    {
        "source_sentence": "見已作如是神力——現神力已，魔王波旬至王舍大城巷衢四道之處，作如是聲：「汝等往至王舍大城。",
        "translation": "Having manifested his supernatural powers, Māra King Pāpīyān went to the great city of Rājagṛha and made this sound at the crossroads of the four streets in the four directions, saying:",
        "source": "T11n0314_001:0769b23_28"
    },
    {
        "source_sentence": "諸仁者！",
        "translation": "Gentlemen!",
        "source": "T11n0314_001:0769b25_29"
    },
    {
        "source_sentence": "若知是如來在耆闍崛山中，為四部眾說法，初善、中善、後善，其義巧妙，",
        "translation": "“If someone knows that the Tathāgata is on Mount Gṛdhrakūṭa, teaching the Dharma to the fourfold assembly of bhikṣus: those who are good in the beginning, good in the middle, and good in the end—the meaning",
        "source": "T11n0314_001:0769b25_30"
    },
    {
        "source_sentence": "滿足白淨，說行梵行。",
        "translation": "He fulfills the white and pure, explaining the religious practice.",
        "source": "T11n0314_001:0769b27_31"
    },
    {
        "source_sentence": "是故汝等應往如來所，是以汝等於長夜，而成饒益快樂。」",
        "translation": "That's why you should go to the Tathāgata, and that's why you will become blissful for a long time.",
        "source": "T11n0314_001:0769b27_32"
    },
    {
        "source_sentence": "爾時王舍城中諸婆羅門剎利長者居士等，被魔勸已，持諸香華、塗香、末香、燒香、繒幡、寶蓋、衣服等，",
        "translation": "It was then that the brāhmaṇas, kṣatriyas, elders, householders, and others in Rājagṛha, having been encouraged by the Māra, carried fragrant flowers, ointments, powdered perfumes,",
        "source": "T11n0314_001:0769b28_33"
    },
    {
        "source_sentence": "從王舍大城出已，至耆闍崛山。",
        "translation": "After leaving the great city of Rājagṛha, he went up to Mount Gṛdhrakūṭa.",
        "source": "T11n0314_001:0769c02_34"
    },
    {
        "source_sentence": "於如來所頭面禮佛，尊重讚歎供養恭敬已，却住一面。",
        "translation": "They bowed their heads and faces to the Buddha at the place where the Tathāgata was. Having venerated, praised, offered support, and respected him, they withdrew and remained off to one side.",
        "source": "T11n0314_001:0769c02_35"
    },
    {
        "source_sentence": "魔王波旬及四兵眾，出王舍大城耆闍崛山中，至如來所已，化作天曼陀羅華而散佛上，",
        "translation": "Māra King Pāpīyān and his four divisions of the army came out of the great city of Rājagṛha in the midst of Mount Gṛdhrakūṭa. Having arrived at the place where the Buddha was, they magically produced",
        "source": "T11n0314_001:0769c04_36"
    },
    {
        "source_sentence": "散已及四部兵眾却坐一面。",
        "translation": "After they scattered, the four groups of soldiers withdrew and sat to one side.",
        "source": "T11n0314_001:0769c06_37"
    },
    {
        "source_sentence": "爾時淨無垢妙淨寶月王光菩薩，見魔波旬却坐一面，而告之言：「波旬！",
        "translation": "It was then that the Bodhisattva King of Pure, Immaculate, Marvelous Pure Jeweled Moon King Radiance saw Māra Pāpīyān and withdrew to sit at one side and addressed him, saying, Pāpīyān",
        "source": "T11n0314_001:0769c06_38"
    },
    {
        "source_sentence": "汝何故將四兵眾至如來所？」",
        "translation": "Why did you bring the four armies of soldiers to the Tathāgata?",
        "source": "T11n0314_001:0769c08_39"
    },
    {
        "source_sentence": "魔言：「吾至此為令滅此法故，及惱亂如來故。」",
        "translation": "The Māra said, I came here to cause this teaching to cease and disturb the Tathāgata.",
        "source": "T11n0314_001:0769c08_40"
    },
    {
        "source_sentence": "淨無垢妙淨寶月王光菩薩，語魔波旬言：「波旬！",
        "translation": "The Bodhisattva King of the Pure, Immaculate, Marvelous Pure Jeweled Moon King Light said to Māra Pāpīyān, Pāpīyān!",
        "source": "T11n0314_001:0769c09_41"
    },
    {
        "source_sentence": "何容煩亂如來，及以此法？",
        "translation": "What's allowed to disturb the Tathāgata and this teaching?",
        "source": "T11n0314_001:0769c11_0"
    },
    {
        "source_sentence": "汝波旬，於如來前今可悔過，勿於長夜成無利益苦報。」",
        "translation": "You, Pāpīyān, may you repent now in front of the Tathāgata and not experience unbeneficial and painful retribution for a long time.",
        "source": "T11n0314_001:0769c11_1"
    },
    {
        "source_sentence": "淨無垢妙淨寶月王光菩薩，所順說法已，魔即從坐起偏袒右肩，叉手合掌禮佛足已，",
        "translation": "After the enlightening being Pure, Immaculate, Sublime, Wonderfully Pure Jeweled Moon King Light of the Buddha had taught the Dharma in accordance with them, Māra rose from his seat, bared his right shoulder, saluted the Buddha",
        "source": "T11n0314_001:0769c12_2"
    },
    {
        "source_sentence": "於如來前而起悔過：「願世尊受我悔過！",
        "translation": "In front of the Tathāgata, he repented, saying, May the Bhagavān accept my repentance!",
        "source": "T11n0314_001:0769c14_3"
    },
    {
        "source_sentence": "我以愚癡、無智慧、不善巧，不能自知，而如來前起惡心，及欲滅如是等經。",
        "translation": "Because of my ignorance, lack of wisdom, and unskillfulness, I am unable to know for myself. Yet the Tathāgata has aroused evil thoughts in front of me and wishes to extinguish such scriptures as these.",
        "source": "T11n0314_001:0769c15_4"
    },
    {
        "source_sentence": "善哉，世尊！",
        "translation": "Excellent, Bhagavān!",
        "source": "T11n0314_001:0769c17_5"
    },
    {
        "source_sentence": "為我正受悔過等法。」",
        "translation": "For my sake, I'll correctly accept the repentance and so forth.",
        "source": "T11n0314_001:0769c17_6"
    },
    {
        "source_sentence": "佛語魔王波旬言：「吾法中增長善根，所謂若善男子善女人，為欲清淨法故，",
        "translation": "The Buddha said to Māra King Pāpīyān: In my doctrine, the roots of virtue grow. It is so-called that if a good man or woman desires pure and genuine dharmas, then he or she will cultivate",
        "source": "T11n0314_001:0769c18_7"
    },
    {
        "source_sentence": "今能悔過。」",
        "translation": "Now, I'm able to repent.",
        "source": "T11n0314_001:0769c19_8"
    },
    {
        "source_sentence": "爾時魔王波旬從坐起已，在佛前立，而白佛言：「世尊！",
        "translation": "It was then that Māra King Pāpīyān rose from his seat, stood in front of the Buddha, and said to him, Bhagavān!",
        "source": "T11n0314_001:0769c20_9"
    },
    {
        "source_sentence": "先制一切諸惱惡口等不善業道。」",
        "translation": "He first restrains all the unwholesome karmic paths of anger, bad speech, and so forth.",
        "source": "T11n0314_001:0769c21_10"
    },
    {
        "source_sentence": "佛語波旬：「如是，如是。」",
        "translation": "The Buddha said to Pāpīyān, So it is, so it is.",
        "source": "T11n0314_001:0769c22_0"
    },
    {
        "source_sentence": "波旬問曰：「如來法主，何故以波旬名而喚於我？」",
        "translation": "Pāpīyān asked, Why did the Tathāgata Dharma lord call me by the name of Pāpīyān?",
        "source": "T11n0314_001:0769c22_1"
    },
    {
        "source_sentence": "佛言：「波旬！",
        "translation": "The Buddha said, Upāsikā!",
        "source": "T11n0314_001:0769c23_2"
    },
    {
        "source_sentence": "吾今說喻。",
        "translation": "Now, I'll explain a metaphor.",
        "source": "T11n0314_001:0769c23_3"
    },
    {
        "source_sentence": "譬如長者及居士大富，財錢無窮，然彼人唯有一子愛念深重，以彼繼命為活。",
        "translation": "It's like an elderly man or a wealthy householder who has no limit to their wealth and money, but they have only one son with deep craving and thought, which takes his life as their livelihood.",
        "source": "T11n0314_001:0769c24_0"
    },
    {
        "source_sentence": "然彼一子不善調伏，心諂曲。",
        "translation": "Still, that one child isn't well disciplined, and his mind is flattering.",
        "source": "T11n0314_001:0769c25_1"
    },
    {
        "source_sentence": "彼長者及居士，若手、若杖、若捲等治，或惡言及苦語惡治，為令息彼惡故。",
        "translation": "That wealthy man or householder, whether he treats it with his hand, a stick, a roll, or the like, or with harsh words or harsh words, they do so to stop that badness.",
        "source": "T11n0314_001:0769c26_2"
    },
    {
        "source_sentence": "波旬！",
        "translation": "Pāpīyān!",
        "source": "T11n0314_001:0769c28_3"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T11n0314_001:0769c28_4"
    },
    {
        "source_sentence": "是長者居士瞋恨情治彼一子不？」",
        "translation": "Is this the elderly householder's angry feeling treating that one child?",
        "source": "T11n0314_001:0769c28_5"
    },
    {
        "source_sentence": "答曰：「世尊！",
        "translation": "He replied, Bhagavān!",
        "source": "T11n0314_001:0769c29_6"
    },
    {
        "source_sentence": "唯為成彼一子故。」",
        "translation": "It's only for the sake of forming that one child.",
        "source": "T11n0314_001:0769c29_7"
    },
    {
        "source_sentence": "佛言：「如是，波旬！",
        "translation": "The Buddha said, So it is, Pāpīyān!",
        "source": "T11n0314_001:0770a01_0"
    },
    {
        "source_sentence": "如來亦爾。",
        "translation": "The Tathāgata is likewise.",
        "source": "T11n0314_001:0770a01_1"
    },
    {
        "source_sentence": "善知眾生心、心數法，以苦惱語調伏者，為說苦惱語；",
        "translation": "To those who are well versed in the minds and mental factors of sentient beings, to pacify them with words of suffering and distress I teach words of suffering.",
        "source": "T11n0314_001:0770a01_2"
    },
    {
        "source_sentence": "應以壇治者，即以壇治；",
        "translation": "Those who should be disciplined by means of an altar should be disciplined by means of an altar.",
        "source": "T11n0314_001:0770a02_3"
    },
    {
        "source_sentence": "應以攝取者，即說攝取言；",
        "translation": "The one who should be taken in by means of taking in is speaking of taking in, that is to say, saying:",
        "source": "T11n0314_001:0770a03_4"
    },
    {
        "source_sentence": "應以色身度者，即以色身度之；",
        "translation": "To those who are to be liberated by means of the body of form, they are liberated by means of the body of form.",
        "source": "T11n0314_001:0770a04_0"
    },
    {
        "source_sentence": "應以聲、香、味、觸、法等度者，即乃至法等度之。」",
        "translation": "Those who should be liberated by such things as sound, odor, taste, touch, and dharmas, that is, they'll be liberated by such things as sounds, smells, tastes, sensations, and dharmas.",
        "source": "T11n0314_001:0770a04_1"
    },
    {
        "source_sentence": "爾時魔王波旬，從佛聞此法歡喜踊躍，復更禮佛足。",
        "translation": "When Māra King Pāpīyān heard this teaching from the Buddha, he rejoiced and jumped for joy. Again, he bowed his head at the Buddha’s feet.",
        "source": "T11n0314_001:0770a05_2"
    },
    {
        "source_sentence": "禮已，白佛言：「世尊！",
        "translation": "After paying homage, he said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0770a06_3"
    },
    {
        "source_sentence": "若有村邑聚落中說是法者，我為聽此法故，往至彼處及護此經，亦念益法師故，",
        "translation": "If there is anyone who teaches this doctrine in towns and villages, it is for the sake of listening to this doctrine that I go there and preserve this sutra. It is also because I am mindful of benefiting the Dharma teacher.",
        "source": "T11n0314_001:0770a07_4"
    },
    {
        "source_sentence": "是中多有如是瑞相。",
        "translation": "Here, there are many such miraculous signs.",
        "source": "T11n0314_001:0770a09_5"
    },
    {
        "source_sentence": "眾則寂定，離調戲、懈怠等，得上勝聽法之者，若讀、若誦、若受持、若解說，",
        "translation": "When the assembly is still and concentrated, they're free of regulation, playfulness, laziness, and so forth, and attain superior listening to the teaching if they read, recite, retain, understand, and explain it.",
        "source": "T11n0314_001:0770a09_6"
    },
    {
        "source_sentence": "身不生疲倦，心不起厭足，隨所說此法，若聽或為他廣說，如是彼轉生歡喜踊躍心。」",
        "translation": "The body doesn't become weary, the mind isn't satisfied, and whatever he teaches this teaching, if he hears it or explains it in detail for others, then he'll become joyous and ecstatic.",
        "source": "T11n0314_001:0770a11_7"
    },
    {
        "source_sentence": "爾時彼眾中有諸外道尼乾子等，彼見聞此魔王所說語已，於如來所即生歡喜踊躍之心。",
        "translation": "At the time, there were non-Buddhist Nirgranthas among those in the crowd who saw and heard what this demon king said, and they rejoiced and jumped with joy at the Tathāgata's presence.",
        "source": "T11n0314_001:0770a13_8"
    },
    {
        "source_sentence": "爾時尊者阿難白佛言：「世尊！",
        "translation": "It was then that Venerable Ānanda said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0770a15_9"
    },
    {
        "source_sentence": "何因何緣故，此諸外道聞說此法而得證忍？」",
        "translation": "What are the causes and conditions for these non-Buddhists who hear this teaching and attain the realization of forbearance?",
        "source": "T11n0314_001:0770a15_10"
    },
    {
        "source_sentence": "佛語阿難：「過去此王舍城耆闍崛山中，有佛——名曰善勝調伏多陀阿伽度、阿羅訶、三藐三佛陀——說法。",
        "translation": "The Buddha said to Ānanda, In the past, there was a buddha named Sunetra who preached the Dharma in the city of Rājagṛha on Mount Gṛdhrakūṭa.",
        "source": "T11n0314_001:0770a16_11"
    },
    {
        "source_sentence": "彼佛說法已，有諸外道為惱故來。",
        "translation": "After that Buddha taught the Dharma, there were non-Buddhist monks who came because they were disturbed.",
        "source": "T11n0314_001:0770a19_12"
    },
    {
        "source_sentence": "彼至已，聞此法，即唱『善哉！』",
        "translation": "When he arrived, he heard this teaching and called out, Good!",
        "source": "T11n0314_001:0770a19_13"
    },
    {
        "source_sentence": "而於佛所不生敬重心。",
        "translation": "Instead, they don't give rise to respectful thoughts at the Buddha's place.",
        "source": "T11n0314_001:0770a20_14"
    },
    {
        "source_sentence": "彼諸外道以此因緣力故，六萬劫不生地獄、餓鬼、畜生之中，唯生人、天之處。",
        "translation": "Because of the power of these causes and conditions, those non-Buddhists won't be born in hell, hungry ghosts, or animals for 60,000 eons, but will only be born among humans and gods.",
        "source": "T11n0314_001:0770a20_15"
    },
    {
        "source_sentence": "彼諸外道以不敬如來故，所生之處不值善知識。",
        "translation": "Because those non-Buddhists don't respect the Tathāgata, they won't meet a good teacher where they're born.",
        "source": "T11n0314_001:0770a22_16"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T11n0314_001:0770a23_17"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T11n0314_001:0770a23_18"
    },
    {
        "source_sentence": "爾時彼諸外道等豈異人乎？",
        "translation": "At that point, aren't those non-Buddhists and others different people?",
        "source": "T11n0314_001:0770a24_19"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T11n0314_001:0770a24_20"
    },
    {
        "source_sentence": "汝不應異意取。",
        "translation": "You shouldn't take it with different intentions.",
        "source": "T11n0314_001:0770a24_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0770a25_22"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T11n0314_001:0770a25_23"
    },
    {
        "source_sentence": "此諸外道尼乾子等。",
        "translation": "These non-Buddhist Nirgranthas and so forth.",
        "source": "T11n0314_001:0770a25_24"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T11n0314_001:0770a26_25"
    },
    {
        "source_sentence": "今此諸外道於如來所，生歡喜恭敬踊躍心。",
        "translation": "Now, these heretics are at the Tathāgata's place, rejoicing in respect and veneration, and jumping for joy.",
        "source": "T11n0314_001:0770a26_26"
    },
    {
        "source_sentence": "以此因故，如來今記，得阿耨多羅三藐三菩提。」",
        "translation": "Because of this cause, the Tathāgata now predicts that he'll attain unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0314_001:0770a27_27"
    },
    {
        "source_sentence": "爾時彼諸外道尼乾子等，聞受記已，心大踊躍，即得無生法忍。",
        "translation": "It was then that those non-Buddhist Nirgranthas heard the assurance and jumped for joy in their hearts, and they attained the patience of the nonarising of the Dharma.",
        "source": "T11n0314_001:0770a28_28"
    },
    {
        "source_sentence": "說此法時萬二千人遠塵離垢，得法眼淨。",
        "translation": "When he taught this teaching, 12,000 people were far removed from dust and dirt and attained purity of the Dharma eye.",
        "source": "T11n0314_001:0770a29_29"
    },
    {
        "source_sentence": "二萬眾生未曾發阿耨多羅三藐三菩提心，而發道意。",
        "translation": "Twenty thousand sentient beings have never given rise to the mind of unsurpassed, correct, and complete enlightenment but give rise to the intention for enlightenment.",
        "source": "T11n0314_001:0770b01_30"
    },
    {
        "source_sentence": "爾時尊者阿難白佛言：「世尊！",
        "translation": "It was then that Venerable Ānanda said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0770b02_31"
    },
    {
        "source_sentence": "若有善男子、善女人，聞此法讀誦、受持、廣為人說，得幾福德？」",
        "translation": "If there are good men and good women who hear this teaching, recite it, retain it, and explain it widely for others, how much merit will they attain?",
        "source": "T11n0314_001:0770b03_32"
    },
    {
        "source_sentence": "佛言：「若善男子、善女人，一切無餘眾生界，令安阿耨多羅三藐三菩提者。",
        "translation": "The Buddha said, Suppose good men and good women cause all sentient beings without remainder to attain unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0314_001:0770b04_33"
    },
    {
        "source_sentence": "若復善男子、善女人，讀誦、受持及廣為人說此經，是人倍得福德。",
        "translation": "If another good man or woman recites, retains, and extensively explains this sūtra for others, that person will attain even greater merit.",
        "source": "T11n0314_001:0770b06_34"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0770b08_0"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T11n0314_001:0770b08_1"
    },
    {
        "source_sentence": "此法能令得阿耨多羅三藐三菩提、一切種智。」",
        "translation": "This teaching can cause them to attain supreme perfect enlightenment and all kinds of cognition.",
        "source": "T11n0314_001:0770b08_2"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0770b09_3"
    },
    {
        "source_sentence": "若善男子、善女人，於此法及法師起惡心。",
        "translation": "Suppose good men and good women give rise to bad thoughts about this teaching and the teacher of the Dharma.",
        "source": "T11n0314_001:0770b09_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0770b10_5"
    },
    {
        "source_sentence": "彼善男子、善女人，得幾不饒益？」",
        "translation": "How unbeneficial are those good men and good women?",
        "source": "T11n0314_001:0770b10_6"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T11n0314_001:0770b11_7"
    },
    {
        "source_sentence": "若善男子、善女人，挑拔一切眾生目，若復有人於此法及法師起惡心，",
        "translation": "If good men and good women pull out the eyes of all sentient beings, or if there's another person who gives rise to bad thoughts about this teaching or a teacher of the Dharma,",
        "source": "T11n0314_001:0770b11_8"
    },
    {
        "source_sentence": "是人因此事得惡，復倍於前。",
        "translation": "That person's bad for this thing is even greater than the previous one.",
        "source": "T11n0314_001:0770b13_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0770b13_10"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T11n0314_001:0770b14_0"
    },
    {
        "source_sentence": "此法於一切眾生能作光明。」",
        "translation": "This teaching can make a light for all sentient beings.",
        "source": "T11n0314_001:0770b14_1"
    },
    {
        "source_sentence": "阿難白佛言：「世尊！",
        "translation": "Ānanda said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0770b14_2"
    },
    {
        "source_sentence": "此法不應不信心善男子、善女人前說。",
        "translation": "This teaching shouldn't be explained before a good man or woman who doesn't believe in it.",
        "source": "T11n0314_001:0770b15_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0770b16_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T11n0314_001:0770b16_5"
    },
    {
        "source_sentence": "應護後世諸眾生故，勿說此法，謗法業報故墮諸地獄中。」",
        "translation": "It's because they should protect sentient beings in later generations and not teach this teaching, and because of the results of their actions that denigrate the teaching, they'll fall into hell.",
        "source": "T11n0314_001:0770b16_6"
    },
    {
        "source_sentence": "佛語阿難：「應說此法。",
        "translation": "The Buddha said to Ānanda, You should explain this teaching.",
        "source": "T11n0314_001:0770b17_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0314_001:0770b18_8"
    },
    {
        "source_sentence": "彼諸眾生於阿耨多羅三藐三菩提，即以此為因。」",
        "translation": "These sentient beings are the cause of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0314_001:0770b18_9"
    },
    {
        "source_sentence": "阿難白佛言：「世尊！",
        "translation": "Ānanda said to the Buddha, Bhagavān!",
        "source": "T11n0314_001:0770b19_10"
    },
    {
        "source_sentence": "此經以何名？",
        "translation": "What is the name of this sutra?",
        "source": "T11n0314_001:0770b19_11"
    },
    {
        "source_sentence": "云何受持？」",
        "translation": "How do you receive and uphold it?",
        "source": "T11n0314_001:0770b20_12"
    },
    {
        "source_sentence": "佛語阿難：「此經名為『十法』，如是受持；",
        "translation": "The Buddha said to Ānanda: This sutra is called the ‘ten doctrines.’ They are upheld in this way:",
        "source": "T11n0314_001:0770b20_13"
    },
    {
        "source_sentence": "『淨無垢妙淨寶月王光菩薩所問』，如是受持。」",
        "translation": "'The pure, undefiled, marvelous, pure jeweled moon king of light asked by the bodhisattva, and he thus accepted it.'",
        "source": "T11n0314_001:0770b21_14"
    },
    {
        "source_sentence": "如來說此法時，尊者阿難及淨無垢妙淨寶月王光菩薩，并諸菩薩眾、比丘眾，",
        "translation": "“When the World-honored One had discoursed thus, Venerable Ānanda and the bodhisattva Candracchattra the King of Pure, Immaculate, Sublime Jewel Moonlight, together with a host of bodhisattvas",
        "source": "T11n0314_001:0770b22_15"
    },
    {
        "source_sentence": "及諸天、人、龍王、阿修羅、迦樓羅、緊那羅、摩睺羅伽等，聞佛所說，",
        "translation": "And the gods, humans, nāga kings, asuras, garuḍas, kiṃnaras, and mahoragas heard what the Buddha taught.",
        "source": "T11n0314_001:0770b23_16"
    },
    {
        "source_sentence": "歡喜奉行。",
        "translation": "They rejoice and venerate it.",
        "source": "T11n0314_001:0770b25_17"
    },
    {
        "source_sentence": "佛說大乘十法經",
        "translation": "Sutra on the Ten Teachings of the Great Vehicle",
        "source": "T11n0314_001:0770b26_0"
    }
]