[
    {
        "source_sentence": "佛說大乘菩薩藏正法經卷第三",
        "translation": "Foshuo daishi pusa zhengfa jing, vol. 3",
        "source": "T11n0316_036:0874c16_0"
    },
    {
        "source_sentence": "十六",
        "translation": "sixteen",
        "source": "T11n0316_036:0874c17_0"
    },
    {
        "source_sentence": "西天譯經三藏銀青光祿大夫",
        "translation": "translated scriptures of the Western Heavens, Tripiṭaka Master銀青光祿大夫",
        "source": "T11n0316_036:0874c19_0"
    },
    {
        "source_sentence": "試光祿卿慈覺傳梵大師賜紫沙",
        "translation": "試光祿卿慈覺傳梵大師賜紫沙 試光祿卿慈覺傳梵大師賜紫沙",
        "source": "T11n0316_036:0874c20_0"
    },
    {
        "source_sentence": "門臣法護等奉　詔譯",
        "translation": "translated by imperial edict by the disciples Dharmagupta and others",
        "source": "T11n0316_036:0874c21_0"
    },
    {
        "source_sentence": "勝慧波羅蜜多品第十一之四",
        "translation": "Eleventh and Fourth Chapter of the Chapter of the Perfection of Supreme Wisdom",
        "source": "T11n0316_036:0874c22_0"
    },
    {
        "source_sentence": "「復次舍利子！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T11n0316_036:0874c23_0"
    },
    {
        "source_sentence": "一切有學阿那含辟支佛，於此福行應先發起如是勝心，得不退轉一生補處，",
        "translation": "All learned non-returners and pratyekabuddhas should first give rise to such a superior mind in regard to these meritorious deeds, so as to attain the one-pointedness of nonretrogression for one lifetime.",
        "source": "T11n0316_036:0874c23_1"
    },
    {
        "source_sentence": "次當作佛。",
        "translation": "Next, he'll become a buddha.",
        "source": "T11n0316_036:0874c25_2"
    },
    {
        "source_sentence": "菩薩摩訶薩亦應於此發隨喜心，過去未來現在諸佛世尊此福行中一切善根亦皆隨喜，",
        "translation": "Great enlightening beings should also give rise to the mind of joyfulness in this way. All buddhas of past, future, and present buddhas and world-honored ones who practice these roots of goodness will also be joyful when they practice them.",
        "source": "T11n0316_036:0874c25_3"
    },
    {
        "source_sentence": "勸請諸佛轉妙法輪。",
        "translation": "He encourages the buddhas to turn the wonderful wheel of the Dharma.",
        "source": "T11n0316_036:0874c27_4"
    },
    {
        "source_sentence": "此福行中以一切菩提善根悉共回向。",
        "translation": "In this meritorious practice, he dedicates all the good roots of enlightenment to them together.",
        "source": "T11n0316_036:0874c27_5"
    },
    {
        "source_sentence": "未發菩提心者語令發起，已發菩提心者諸菩薩為說回向。",
        "translation": "Those who have yet to give rise to the mind of enlightenment are told to give rise to it, and those who have already given rise to the mind of enlightenment are taught by bodhisattvas to return.",
        "source": "T11n0316_036:0874c28_6"
    },
    {
        "source_sentence": "以利養攝諸貧窮，以醫藥施諸疾病，於諸怯弱亦當親近為作憐愍，於諸毀戒以法覆護，",
        "translation": "They should take care of the poor by means of material benefits, provide medicines for the ill and give them to the sick. They should also become intimate with the weak in order to show compassion toward those who are helpless, and they should protect themselves against immoral beings by means of the Dharma.",
        "source": "T11n0316_036:0875a01_7"
    },
    {
        "source_sentence": "出離罪報令住涅槃。",
        "translation": "He'll be freed from the retribution of sins and made to abide in nirvāṇa.",
        "source": "T11n0316_036:0875a03_8"
    },
    {
        "source_sentence": "於和尚阿闍梨尊重供養如佛世尊，於講法處精進勇猛。",
        "translation": "He honors and makes offerings to monks and preceptors like the Bhagavān, and he's diligent and courageous at the place where he teaches the Dharma.",
        "source": "T11n0316_036:0875a03_9"
    },
    {
        "source_sentence": "求諸法師設百由旬亦應故往，樂聞正法而無厭足。",
        "translation": "If you seek the masters of the Dharma for a hundred yojanas, you should also go there as usual, delighting in listening to the right teaching without tire.",
        "source": "T11n0316_036:0875a04_10"
    },
    {
        "source_sentence": "於說法者無所希望，常當親近恭敬供養，如己父母不生疲厭。",
        "translation": "There's nothing to hope for when someone teaches the Dharma, and they should always be intimate, respectful, and offering support like their own parents who don't become weary.",
        "source": "T11n0316_036:0875a06_11"
    },
    {
        "source_sentence": "又福行中，於身口意不生動亂、離諸過失。",
        "translation": "Also, among meritorious actions, they don't become agitated in body, speech, or mind and are free of faults.",
        "source": "T11n0316_036:0875a07_12"
    },
    {
        "source_sentence": "住佛塔廟，攝受梵福集諸善本，圓滿相好莊嚴化身。",
        "translation": "He lives in a stūpa or shrine of the Buddha, collects the good roots of Brahmā's merit and accumulates them, has perfect features and adorns his transformation body.",
        "source": "T11n0316_036:0875a08_13"
    },
    {
        "source_sentence": "離諸口過莊嚴語業，決定勝解莊嚴一心，遊戲神通莊嚴佛剎，以清淨智莊嚴法相。",
        "translation": "He's free of verbal faults, adorned with speech and action, adorned with certainty and resolve, adorned with one mind, played with supernormal powers to adorn the Buddha's buddha-stage, adorned with pure wisdom to adorn the characteristics of the Dharma.",
        "source": "T11n0316_036:0875a09_14"
    },
    {
        "source_sentence": "聞彼正法離諸障礙得無障礙，於說法者歡喜稱讚，於所說法不生執著，",
        "translation": "They hear the true teaching free of obstructions and attain unobstructedness, rejoicing and praising those who expound it. They do not cling to what they teach.",
        "source": "T11n0316_036:0875a11_15"
    },
    {
        "source_sentence": "亦無損壞如是莊嚴解脫法門。",
        "translation": "They also don't damage or destroy such an adorned liberation dharma-gate.",
        "source": "T11n0316_036:0875a13_16"
    },
    {
        "source_sentence": "以諸園林施佛及僧，如是莊嚴佛菩提樹，植諸善本憐愍一切，業惑清淨得無生滅，",
        "translation": "He gave all the parks and forests to the Buddha and the saṃgha, thus adorned the Buddha’s tree of enlightenment, planted roots of goodness, had compassion for all, was pure in action and thought, and attained nonorigination and cessation.",
        "source": "T11n0316_036:0875a13_17"
    },
    {
        "source_sentence": "如是莊嚴菩提道場。",
        "translation": "Thus, they adorn the site of the path of enlightenment.",
        "source": "T11n0316_036:0875a15_18"
    },
    {
        "source_sentence": "發無盡願施諸玩好，獲得圓滿無盡寶手。",
        "translation": "He gives rise to an inexhaustible vow to give away all the goods, and he attains the hand of perfect and inexhaustible jewels.",
        "source": "T11n0316_036:0875a16_19"
    },
    {
        "source_sentence": "遠離顰蹙平等如掌，樂施一切而先獲得面目端嚴，後諸有情共喜樂見。",
        "translation": "He's far removed from frowning like a palm and equal in equality, delights in generosity, first attains the dignity of his face and eyes, and then all sentient beings are joyful and happy to see him.",
        "source": "T11n0316_036:0875a17_20"
    },
    {
        "source_sentence": "光淨嚴飾施諸有情，而獲光明普照一切。",
        "translation": "They give their light to sentient beings with pure adornment, and they attain light that illuminates them all.",
        "source": "T11n0316_036:0875a18_21"
    },
    {
        "source_sentence": "讚美言辭非由積習，戒福德藏悉皆清淨。",
        "translation": "It's not because of accumulation that praise and words are praised, and the store of morality and virtue are all pure.",
        "source": "T11n0316_036:0875a19_22"
    },
    {
        "source_sentence": "生人天中，十善道業亦復清淨，神通變化亦不唐捐。",
        "translation": "When they're born among humans and gods, the ten good paths of action are also pure, and their miraculous abilities and transformations aren't in vain.",
        "source": "T11n0316_036:0875a20_23"
    },
    {
        "source_sentence": "順諸佛教不起分別，深心清淨平等開化，為諸有情之所愛敬。",
        "translation": "They follow the teachings of Buddhism without discriminating, are profoundly pure and equal in mind, and enlightened, beloved by all sentient beings.",
        "source": "T11n0316_036:0875a22_0"
    },
    {
        "source_sentence": "於最上法及勝解行隨力為說，而能攝受一切福行。",
        "translation": "He explains the supreme teaching and the practice of resolute understanding as he can, and he's able to collect all meritorious actions.",
        "source": "T11n0316_036:0875a23_1"
    },
    {
        "source_sentence": "又當發起一切智心，具七聖財信為先行，一切世間之所愛敬。",
        "translation": "You should also give rise to the mind of omniscience, which is preceded by faith in the seven noble treasures and beloved by all the worldly people.",
        "source": "T11n0316_036:0875a24_2"
    },
    {
        "source_sentence": "是故決定最先開導，而能圓滿一切佛法及諸善法。",
        "translation": "Therefore, it's certain that they're the first to enlighten and lead, and they can perfect all the Buddha's teachings and good qualities.",
        "source": "T11n0316_036:0875a26_0"
    },
    {
        "source_sentence": "此說是為菩薩摩訶薩福行善巧。",
        "translation": "This teaching is called the skillfulness of the bodhisattva-mahāsattva's meritorious actions.",
        "source": "T11n0316_036:0875a27_1"
    },
    {
        "source_sentence": "「云何諸菩薩智行善巧？",
        "translation": "“What is the skillfulness of enlightening beings’ knowledge and practice?",
        "source": "T11n0316_036:0875a27_2"
    },
    {
        "source_sentence": "謂於因緣發生智解。",
        "translation": "It's the knowledge and understanding that arises from causes and conditions.",
        "source": "T11n0316_036:0875a28_3"
    },
    {
        "source_sentence": "云何因緣？",
        "translation": "What are the causes and conditions?",
        "source": "T11n0316_036:0875a28_4"
    },
    {
        "source_sentence": "謂深心樂欲隨知法會，勤求善友住於佛智，不依聲聞辟支佛智，於論議師極生信樂。",
        "translation": "They are those who deeply wish to follow the Dharma assembly, diligently seek good friends and abide in the Buddha's wisdom, don't rely on the knowledge of śrāvakas and pratyekbuddhas, and give rise to great faith and happiness in the discussion teacher.",
        "source": "T11n0316_036:0875a29_5"
    },
    {
        "source_sentence": "其說法者，知彼器已內心具足，於其智慧無有慳惜，相續為說甚深妙法。",
        "translation": "He who teaches the Dharma knows that his container is already fully endowed with internally perfected mind, has no stinginess or stinginess in his wisdom, and continues to teach the profound and marvelous Dharma for him.",
        "source": "T11n0316_036:0875b02_6"
    },
    {
        "source_sentence": "彼聞法者，為作如是求法相應，則能於此智行相應。",
        "translation": "If someone who hears the teaching is thus engaged in seeking the teaching, then they're able to be associated with this knowledge and practice.",
        "source": "T11n0316_036:0875b03_7"
    },
    {
        "source_sentence": "云何求法相應？",
        "translation": "What's associated with seeking the Dharma?",
        "source": "T11n0316_036:0875b04_8"
    },
    {
        "source_sentence": "謂於法師得是少義，而於初夜後夜思擇稱量，此等云何是理非理？",
        "translation": "It means that when the teacher of the Dharma obtains this little meaning, he deliberates and weighs it during the first and second nights, so what's the principle and not the principle?",
        "source": "T11n0316_036:0875b05_9"
    },
    {
        "source_sentence": "展轉研究乃至心無所得，離諸障礙及無垢染，得出離智發真實行。",
        "translation": "He studies it in turn until his mind is ungraspable, parts with the hindrances and unsullied defilements, and attains the knowledge of liberation to give rise to true practice.",
        "source": "T11n0316_036:0875b06_10"
    },
    {
        "source_sentence": "於此甚深法、廣大法無邊法、勝外道法，智解通徹常放光明，最極高顯踰於山峯，",
        "translation": "In regard to this profound teaching, the vast teaching, the boundless teaching, and the superior teaching of non-Buddhists, his knowledge and understanding penetrate and always emit light, which is most extremely lofty and prominent, surpassing a mountain peak.",
        "source": "T11n0316_036:0875b08_11"
    },
    {
        "source_sentence": "勇猛精進不捨重擔，行殊勝行心唯一境，富樂作意不捨杜多，常樂法樂不持世行，",
        "translation": "Their courageous effort does not let go of heavy burdens, their superior practices and minds have only one object: the contemplation of wealth and bliss do not relinquish virtue. They always delight in the pleasures of the Dharma and do not follow worldly ways.",
        "source": "T11n0316_036:0875b10_12"
    },
    {
        "source_sentence": "求出世法憶念不忘隨為宣說。",
        "translation": "They seek the supramundane teachings, remember them and don't forget them, and they explain them accordingly.",
        "source": "T11n0316_036:0875b12_13"
    },
    {
        "source_sentence": "聖族弟子咸皆歡喜，開導勝緣奉持禁戒慚愧莊嚴，趣向佛道，無明暗蔽諸無智者悉自遠離，",
        "translation": "The disciples of the holy clan all rejoiced, enlightened, guided, and adorned themselves with superior conditions, upholding the precepts, guarding the precepts, and shamelessness, proceeding toward the path of buddhahood. They were hindered by ignorance and obscured by ignorance; they were separated from it all.",
        "source": "T11n0316_036:0875b12_14"
    },
    {
        "source_sentence": "而得慧眼清淨，廣大覺悟、深妙覺悟、極妙覺悟。",
        "translation": "They attain the purity of the eye of wisdom, vast enlightenment, profound and marvelous enlightenment, and ultimately marvelous enlightenment.",
        "source": "T11n0316_036:0875b14_15"
    },
    {
        "source_sentence": "以觀察智，復能分別自他功德，而使純熟圓滿清淨業報。",
        "translation": "By observing cognition, they can also discern the merits of self and others so that they are purely ripened and perfected as the results of pure actions.",
        "source": "T11n0316_036:0875b15_16"
    },
    {
        "source_sentence": "是為菩薩摩訶薩智行善巧。",
        "translation": "This is the skillfulness of the bodhisattva-mahāsattva's knowledge and conduct.",
        "source": "T11n0316_036:0875b17_17"
    },
    {
        "source_sentence": "「復次求智菩薩於法師所行四種施。",
        "translation": "“Furthermore, there are four kinds of generosity that the bodhisattva seeking wisdom gives to the Dharma teacher.",
        "source": "T11n0316_036:0875b17_18"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_036:0875b18_19"
    },
    {
        "source_sentence": "謂樺皮紙筆墨等及妙法座、一切利養、法集偈讚。",
        "translation": "It's the praise of birch skin, paper, pen and ink, such as well as the marvelous Dharma seat, all benefits, and the collection of teachings.",
        "source": "T11n0316_036:0875b18_20"
    },
    {
        "source_sentence": "是為四種，於智行中而得成辦。",
        "translation": "These are the four kinds that are accomplished in the practice of wisdom.",
        "source": "T11n0316_036:0875b20_21"
    },
    {
        "source_sentence": "又智行中於法師所，應當成就四種守護。",
        "translation": "Also, in the practice of wisdom, there are four kinds of guarding that should be accomplished at the Dharma teacher's place.",
        "source": "T11n0316_036:0875b20_22"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_036:0875b21_23"
    },
    {
        "source_sentence": "一者守護身，二者守護善，三者守護處所，四者守護所化徒眾，是名為四。",
        "translation": "The first is to guard one’s body. The second is to guard what is wholesome. The third is to guard the place where one should live. The fourth is to guard the community of disciples who are to be converted. These are called the four [factors].",
        "source": "T11n0316_036:0875b21_24"
    },
    {
        "source_sentence": "又智行中，而復成就四種重擔。",
        "translation": "Also, in the practice of wisdom, there are four kinds of heavy burdens that are accomplished.",
        "source": "T11n0316_036:0875b23_25"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_036:0875b24_26"
    },
    {
        "source_sentence": "所謂法、智、財物及與菩提，是為四種。",
        "translation": "The so-called teachings, knowledge, possessions, and enlightenment are four kinds.",
        "source": "T11n0316_036:0875b24_27"
    },
    {
        "source_sentence": "又智行中成就五力：一者信力，於法勝解。",
        "translation": "Also, in the practice of wisdom, five powers are accomplished: first, the power of faith and superior understanding of the teachings.",
        "source": "T11n0316_036:0875b25_28"
    },
    {
        "source_sentence": "二者精進力，勤求多聞。",
        "translation": "The second is the power of exertion, which diligently seeks learning.",
        "source": "T11n0316_036:0875b26_29"
    },
    {
        "source_sentence": "三者念力，於菩提心而無忘失。",
        "translation": "The third is the power of mindfulness, which is to be mindful without forgetting the mind of enlightenment.",
        "source": "T11n0316_036:0875b26_30"
    },
    {
        "source_sentence": "四者定力，於一切法決定平等。",
        "translation": "The fourth is the power of concentration, which determines equality in all dharmas.",
        "source": "T11n0316_036:0875b27_31"
    },
    {
        "source_sentence": "五者勝慧力，復樂多聞。",
        "translation": "The fifth is the power of superior wisdom, which further encourages extensive learning.",
        "source": "T11n0316_036:0875b28_32"
    },
    {
        "source_sentence": "是為五種，於智行中而得圓滿。",
        "translation": "These are the five kinds that attain their fulfillment in the practice of wisdom.",
        "source": "T11n0316_036:0875b28_33"
    },
    {
        "source_sentence": "又智行中成就四戒。",
        "translation": "Also, in the practice of wisdom, he accomplishes the four precepts.",
        "source": "T11n0316_036:0875b29_34"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_036:0875b29_35"
    },
    {
        "source_sentence": "謂真實法戒、勤求法戒、決定法戒、向菩提戒，是名為四。",
        "translation": "These are the true precepts for the Dharma, diligently seeking the Dharma, determined precepts for the Dharma, and the precepts that lead to enlightenment, which are called the four.",
        "source": "T11n0316_036:0875c01_36"
    },
    {
        "source_sentence": "又諸勤求法者，於智行中成就四忍。",
        "translation": "Also, those who diligently seek the teaching accomplish four kinds of forbearance in the practice of wisdom.",
        "source": "T11n0316_036:0875c02_37"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_036:0875c03_38"
    },
    {
        "source_sentence": "一者敝惡人來毀生罵辱，不應加報，善言悔謝；",
        "translation": "The first is that when evil people come to disparage and abuse one another, they should not be reprimanded or punished. They should apologize in good words.",
        "source": "T11n0316_036:0875c03_39"
    },
    {
        "source_sentence": "二者風日寒熱及飢渴等悉能忍受；",
        "translation": "The second is that they are able to endure all kinds of wind, cold and heat, hunger and thirst, and so on.",
        "source": "T11n0316_036:0875c04_40"
    },
    {
        "source_sentence": "三者於和尚阿闍梨隨轉給侍；",
        "translation": "The third is to attend the religious leaders and preceptors in their turn.",
        "source": "T11n0316_036:0875c05_41"
    },
    {
        "source_sentence": "四者於空無相無願三解脫門住大法忍；",
        "translation": "The fourth is to abide in the great tolerance of truth through the three liberations of emptiness, signlessness, and wishlessness.",
        "source": "T11n0316_036:0875c06_42"
    },
    {
        "source_sentence": "是為四種。",
        "translation": "These are the four kinds.",
        "source": "T11n0316_036:0875c07_43"
    },
    {
        "source_sentence": "又復成就四種精進。",
        "translation": "He also accomplishes four kinds of exertion.",
        "source": "T11n0316_036:0875c07_44"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_036:0875c07_45"
    },
    {
        "source_sentence": "所謂多聞精進、總持精進、辯說精進、正行精進，是為四種。",
        "translation": "These are the four kinds: exertion of being well-versed, exertion of maintaining [the precepts] in a concentrated way, exertion of eloquence and explanation, and exertion of right practice.",
        "source": "T11n0316_036:0875c08_46"
    },
    {
        "source_sentence": "又智行中而復成就四種勝定。",
        "translation": "Furthermore, in the practice of wisdom, he also accomplishes four kinds of superior concentration.",
        "source": "T11n0316_036:0875c09_47"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_036:0875c10_48"
    },
    {
        "source_sentence": "所謂離相寂靜、心一境性、入神通定、悟佛知見，是名為四。",
        "translation": "The so-called quiescence that's free of characteristics, the single-realm nature of mind, entry into the concentration of supernormal powers, and awakening to the Buddha's knowing and seeing are called the four.",
        "source": "T11n0316_036:0875c10_49"
    },
    {
        "source_sentence": "又智行中成就四法。",
        "translation": "Also, there are four things that are accomplished in the practice of wisdom.",
        "source": "T11n0316_036:0875c11_50"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T11n0316_036:0875c12_51"
    },
    {
        "source_sentence": "謂諸有不住、非自然性、四緣生滅是無主宰、唯一信解，是名四法。",
        "translation": "These are called the four dharmas: non-abiding, non-natured, and the four conditions for arising and ceasing that have no master and only faith and understanding.",
        "source": "T11n0316_036:0875c12_52"
    },
    {
        "source_sentence": "又復成就四種方便。",
        "translation": "Again, he accomplishes four kinds of skillful means.",
        "source": "T11n0316_036:0875c13_53"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_036:0875c14_54"
    },
    {
        "source_sentence": "一者隨轉世間，二者隨轉契經，三者隨轉於法，四者隨轉於智；",
        "translation": "The first is to follow the world; the second is to follow the scriptures; the third is to follow the teachings; and the fourth is to follow knowledge.",
        "source": "T11n0316_036:0875c14_55"
    },
    {
        "source_sentence": "是為四種，於智行中而得具足。",
        "translation": "These are the four kinds that attain their fulfillment in the practice of wisdom.",
        "source": "T11n0316_036:0875c15_56"
    },
    {
        "source_sentence": "又復成就四無礙道。",
        "translation": "They also accomplish the four unobstructed paths.",
        "source": "T11n0316_036:0875c16_57"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_036:0875c17_58"
    },
    {
        "source_sentence": "所謂波羅蜜多、七菩提分、八聖道支及一切智智，是為四種無障礙道。",
        "translation": "The so-called perfections, the seven factors of enlightenment, the eightfold noble path, and omniscience are the four kinds of unobstructed path.",
        "source": "T11n0316_036:0875c17_59"
    },
    {
        "source_sentence": "又復成就四種無厭。",
        "translation": "Again, he accomplishes four kinds of tirelessness.",
        "source": "T11n0316_036:0875c18_60"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_036:0875c19_61"
    },
    {
        "source_sentence": "謂多聞無厭、辯說無厭、尋伺無厭、智慧無厭，是名四種。",
        "translation": "These are the four kinds: those who are well-versed without tire, those who are eloquent without tire, those who are free of discursive discursive examination without tire, and those who are wise without tire.",
        "source": "T11n0316_036:0875c19_62"
    },
    {
        "source_sentence": "又智行中如是知見，而復隨順一切有情、一切剎土，即布施、持戒、忍辱、精進、禪定、勝慧、慈悲喜捨。",
        "translation": "Also, in the practice of knowing and seeing like this, they also follow all sentient beings and all buddha-lands, which are generosity, observance of precepts, forbearance, patience, effort, meditation, superior wisdom, kindness, compassion, joy, and equanimity.",
        "source": "T11n0316_036:0875c20_63"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0316_036:0875c23_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_036:0875c23_1"
    },
    {
        "source_sentence": "乃至諸菩薩決定於諸智中以是知見而為先行，彼若安住是智而得通達一切智行，",
        "translation": "Enlightening beings are definitely preceded by these knowledges and insights. If they abide in these knowledges, they’ll attain the practice of omniscience.",
        "source": "T11n0316_036:0875c23_2"
    },
    {
        "source_sentence": "諸佛威神之所護念，諸有魔等皆不得便，普為集會一切智智。",
        "translation": "Being guarded by the Buddha's authoritative power, Māra and other demons won't get an advantage, and they universally gather all kinds of wisdom and knowledge for the sake of omniscience.",
        "source": "T11n0316_036:0875c25_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_036:0875c26_4"
    },
    {
        "source_sentence": "是為菩薩摩訶薩於勝慧波羅蜜多得智行善巧。",
        "translation": "This is how a bodhisattva-mahāsattva attains the skillfulness of knowledge and conduct in the perfection of superior wisdom.",
        "source": "T11n0316_036:0875c26_5"
    },
    {
        "source_sentence": "「云何諸菩薩念處善巧？",
        "translation": "What are the skillful means of enlightening beings’ application of mindfulness?",
        "source": "T11n0316_036:0875c28_6"
    },
    {
        "source_sentence": "菩薩念處此有四種。",
        "translation": "Here, there are four kinds of bodhisattva mindfulness.",
        "source": "T11n0316_036:0875c28_7"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T11n0316_036:0875c29_8"
    },
    {
        "source_sentence": "一者以身觀身念處，二者以受觀受念處，三者以心觀心念處，四者以法觀法念處。",
        "translation": "One is the mindfulness of observing body with body as body, two are observing feelings with feelings as feelings as feelings as feelings, three are observing mind as mind with mind, and four are observing principles as principles with principles as principles.",
        "source": "T11n0316_036:0875c29_9"
    },
    {
        "source_sentence": "云何以身觀身念處？",
        "translation": "What's the mindfulness of observing body with body as body?",
        "source": "T11n0316_036:0876a02_10"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_036:0876a02_11"
    },
    {
        "source_sentence": "此諸菩薩修身觀時，觀身前際、觀身後際、觀身現在，而此身者從顛倒生、隨因緣滅，",
        "translation": "“When these enlightening beings practice contemplation of the body, they contemplate the body at the front of their bodies; they contemplate the body at the back of their bodies; they contemplate the body in the present. Yet this body is born of error and perishes according to causes and conditions.",
        "source": "T11n0316_036:0876a02_12"
    },
    {
        "source_sentence": "無動無作無自性無執取。",
        "translation": "There's no movement, no action, no self-nature, and no appropriation.",
        "source": "T11n0316_036:0876a04_13"
    },
    {
        "source_sentence": "譬如諸外山林藥草種等，從因緣生，亦無自性及無執取。",
        "translation": "It's like the seeds of medicinal plants and herbs in external mountain forests that arise from causes and conditions, which also have no self-nature and no appropriation.",
        "source": "T11n0316_036:0876a05_14"
    },
    {
        "source_sentence": "又此身者如墻壁瓦礫草木影像，謂蘊處界是無執是空、是無我我所、是無常是速朽滅、是不精實、是顛倒法、是可厭離、是不堅固。",
        "translation": "Furthermore, this body is like a reflection of walls, rubble, grass, and wood, meaning that the aggregates, fields, and realms are without attachment or emptiness, lack self and what belongs to self, are impermanent, quickly decaying, insubstantial, mistaken, disgusting, and not resolute.",
        "source": "T11n0316_036:0876a06_15"
    },
    {
        "source_sentence": "諸菩薩摩訶薩應如是觀，當樂勤求堅固之身。",
        "translation": "Bodhisattvas, mahāsattvas, should thus observe that they should delight in diligently seeking a resolute body.",
        "source": "T11n0316_036:0876a09_16"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T11n0316_036:0876a10_17"
    },
    {
        "source_sentence": "謂如來身。",
        "translation": "It's the body of the Tathāgata.",
        "source": "T11n0316_036:0876a10_18"
    },
    {
        "source_sentence": "如來身者，即法界身、金剛身、不可壞身、堅固身、於三界一切最勝妙身。",
        "translation": "The Tathāgata's body is the Dharma realm body, the adamantine body, the indestructible body, the resolute body, and all the most excellent and marvelous bodies in the three realms.",
        "source": "T11n0316_036:0876a11_19"
    },
    {
        "source_sentence": "修是觀時，當知凡夫麁重穢惡具諸過患；",
        "translation": "When cultivating this contemplation, one should know that worldlings are gross and defiled, with all their faults and distress.",
        "source": "T11n0316_036:0876a12_20"
    },
    {
        "source_sentence": "彼復能離一切過患，得獲如來最妙身相。",
        "translation": "They'll also be able to part with all their faults and attain the most marvelous physical appearance of the Tathāgata.",
        "source": "T11n0316_036:0876a13_21"
    },
    {
        "source_sentence": "又當觀念諸有情身，由何所造相續不斷？",
        "translation": "You should also contemplate the bodies of sentient beings, whereby they are created and continue unceasingly.",
        "source": "T11n0316_036:0876a14_22"
    },
    {
        "source_sentence": "謂四大種及阿賴耶識造作執持薰習功能有無量力。",
        "translation": "It means that the four major seeds and store consciousnesses create, maintain, and permeate the function of the store consciousness with measureless power.",
        "source": "T11n0316_036:0876a15_23"
    },
    {
        "source_sentence": "譬如地界、水界、火界、風界，外四大種有種種門、種種處、種種名、種種相、種種物，",
        "translation": "“Good son, the earth element, the water element, the fire element, and the wind element—the external four elements have various aspects, various locations, various names, various characteristics, and various things.",
        "source": "T11n0316_036:0876a16_24"
    },
    {
        "source_sentence": "由是一切有情任持命根。",
        "translation": "It's because all sentient beings are free to maintain the life root.",
        "source": "T11n0316_036:0876a18_25"
    },
    {
        "source_sentence": "身四大種集起亦復如是，有種種門、種種處、種種名、種種相、種種物，",
        "translation": "The same applies to the four elements of the body as kinds of accumulation: there are manifold aspects, manifold spheres, manifold names, manifold characteristic marks and manifold things.",
        "source": "T11n0316_036:0876a19_0"
    },
    {
        "source_sentence": "由是一切有情於其命根亦復任持。",
        "translation": "Consequently, all sentient beings are also capable of maintaining the life root.",
        "source": "T11n0316_036:0876a20_1"
    },
    {
        "source_sentence": "以別相觀身無常，而不厭離生死。",
        "translation": "He observes the body as impermanent in specific ways and doesn't tire of being free of birth-and-death.",
        "source": "T11n0316_036:0876a21_2"
    },
    {
        "source_sentence": "以別相觀身是苦，而不樂住涅槃。",
        "translation": "He observes the body as suffering because of distinctive characteristics and doesn't delight in abiding in nirvāṇa.",
        "source": "T11n0316_036:0876a22_3"
    },
    {
        "source_sentence": "以別相觀身無我，而不遠離化度有情。",
        "translation": "He observes the body as selfless because of distinctive characteristics, but he's not far from transforming sentient beings.",
        "source": "T11n0316_036:0876a22_4"
    },
    {
        "source_sentence": "以別相觀身空寂，而無畢竟寂滅。",
        "translation": "He observes the body as emptiness and quiescence with distinctive characteristics, yet there's no ultimate quiescence.",
        "source": "T11n0316_036:0876a23_5"
    },
    {
        "source_sentence": "以別相觀身遠離，而不捨善法。",
        "translation": "He observes the body as distinct in its characteristics and is far removed, not abandoning good qualities.",
        "source": "T11n0316_036:0876a24_6"
    },
    {
        "source_sentence": "彼能如是以身觀身者，應當了知是不堅固、是不可愛。",
        "translation": "Those who can thus observe the body with a body like this should understand that it's not resolute or undesirable.",
        "source": "T11n0316_036:0876a25_7"
    },
    {
        "source_sentence": "觀內身者而知煩惱不能容受，觀外身者了諸煩惱不共合集，而得成就清淨身業，",
        "translation": "Those who contemplate the inner body know that afflictions cannot be contained, but those who contemplate the outer body understand that afflictions are not collected in common, and they attain the accomplishment of pure bodily action.",
        "source": "T11n0316_036:0876a26_8"
    },
    {
        "source_sentence": "及得清淨莊嚴身相，為諸天人之所讚仰。",
        "translation": "They'll attain a purely adorned body that's praised by gods and humans.",
        "source": "T11n0316_036:0876a28_9"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_036:0876a29_10"
    },
    {
        "source_sentence": "是為菩薩摩訶薩得以身觀身念處。",
        "translation": "This is the place where a bodhisattva-mahāsattva attains the mindfulness of observing body as body.",
        "source": "T11n0316_036:0876a29_11"
    },
    {
        "source_sentence": "「云何諸菩薩以受觀受念處？",
        "translation": "How do bodhisattvas use sensation to contemplate the mindful abode of sensation?",
        "source": "T11n0316_036:0876b01_12"
    },
    {
        "source_sentence": "謂諸菩薩於彼一切苦樂等受，應以智慧方便善可了知，於諸樂受無貪惜意，",
        "translation": "It means that bodhisattvas should use wisdom and skillful means to understand all those feelings of pain, pleasure, and so forth, without covetousness or craving for pleasant feelings.",
        "source": "T11n0316_036:0876b01_13"
    },
    {
        "source_sentence": "若見諸惡道受苦觸時，起大悲心無緣息意，於苦樂受觸，無無明意隨念了知。",
        "translation": "When he sees painful feelings and contact in bad destinies, he arouses great compassion without the intention to calm his mind with no conditions, and when he experiences painful feelings and touches them, he doesn't have the intention to perceive nescience after each thought.",
        "source": "T11n0316_036:0876b03_14"
    },
    {
        "source_sentence": "如是苦、樂、非苦非樂得出離見。",
        "translation": "Thus, it's the view that suffering, pleasure, and neither suffering nor pleasure are liberated.",
        "source": "T11n0316_036:0876b05_15"
    },
    {
        "source_sentence": "而諸菩薩以智慧方便，於諸有情，或為成就、或為遠離。",
        "translation": "Instead, the bodhisattvas use wisdom and skillful means to either accomplish or distance themselves from sentient beings.",
        "source": "T11n0316_036:0876b06_16"
    },
    {
        "source_sentence": "然此有情於受出離無所知解，於此樂受隨樂施與，於彼苦受隨為除滅，",
        "translation": "These sentient beings, however, do not know or understand sensation and non-sensation. They give pleasure to those who are comfortable with these pleasures as well as to those who are unhappy with them. The cessation of their painful feelings is effected by doing so.",
        "source": "T11n0316_036:0876b07_17"
    },
    {
        "source_sentence": "於非苦樂受隨順一切智智得獲輕安，以大方便善巧而攝受之，為說妙法，",
        "translation": "To those who are not experiencing pain or pleasure and who follow omniscience and knowledge to attain ease, they take care of them with great skillful means and explain the wondrous Dharma.",
        "source": "T11n0316_036:0876b09_18"
    },
    {
        "source_sentence": "令諸有情亦獲輕安。",
        "translation": "It causes sentient beings to attain ease as well.",
        "source": "T11n0316_036:0876b10_19"
    },
    {
        "source_sentence": "何等因緣說如是受？",
        "translation": "What are the causes and conditions that make such feelings possible?",
        "source": "T11n0316_036:0876b11_20"
    },
    {
        "source_sentence": "謂於善成就而有樂受，於不善成就乃有苦受。",
        "translation": "It means that there's pleasant feeling when it's accomplished well, and painful feeling when it's accomplished badly.",
        "source": "T11n0316_036:0876b11_21"
    },
    {
        "source_sentence": "復於是處我人眾生壽者起種種受，所謂執受、取受、顛倒受、遍計受、惡見受、眼想受乃至意想受、色想受乃至法想受，",
        "translation": "Again, various feelings arise in relation to self, humans, sentient beings, and the duration of life of sentient beings. The so-called feeling of attachment, feeling of grasping, feeling of delusion, feeling of pervasive discrimination, feeling of bad views, feeling of what is perceived by the eye... feeling of what is perceived by the mind... feeling",
        "source": "T11n0316_036:0876b12_22"
    },
    {
        "source_sentence": "乃至眼觸為緣所生諸受。",
        "translation": "It's even the sensations that arise from visual contact as a condition.",
        "source": "T11n0316_036:0876b15_23"
    },
    {
        "source_sentence": "以要言之，乃至於內外法意觸為緣所生諸受，是中或苦、或樂、非苦非樂說名為受。",
        "translation": "To sum up, feelings that arise from internal and external mental contact as a condition are called feelings when they're either painful, or pleasant, or neither painful nor pleasant.",
        "source": "T11n0316_036:0876b16_0"
    },
    {
        "source_sentence": "「復次於總聚中，或有一受，謂一心所表。",
        "translation": "“Furthermore, in the general group, there may be one sensation that’s expressed by a single mind.",
        "source": "T11n0316_036:0876b18_0"
    },
    {
        "source_sentence": "二受，謂內外所表。",
        "translation": "The second is feeling: that which is manifested either internally or externally.",
        "source": "T11n0316_036:0876b18_1"
    },
    {
        "source_sentence": "三受，謂過去未來現在所表。",
        "translation": "The third is feeling: that which is manifested in the past, future and present.",
        "source": "T11n0316_036:0876b19_2"
    },
    {
        "source_sentence": "四受，謂四大所表。",
        "translation": "The four feelings are what is manifested by the four elements.",
        "source": "T11n0316_036:0876b19_3"
    },
    {
        "source_sentence": "五受，謂五蘊作意。",
        "translation": "The five feelings are the five aggregates of attention.",
        "source": "T11n0316_036:0876b20_4"
    },
    {
        "source_sentence": "六受，謂六處遍計。",
        "translation": "The six feelings are pervasive discrimination of the six spheres.",
        "source": "T11n0316_036:0876b20_5"
    },
    {
        "source_sentence": "七受，謂七識住處。",
        "translation": "The seven feelings are the seven abodes of consciousness.",
        "source": "T11n0316_036:0876b21_6"
    },
    {
        "source_sentence": "八受，謂八邪相應。",
        "translation": "The eight feelings are associated with the eight evils.",
        "source": "T11n0316_036:0876b21_7"
    },
    {
        "source_sentence": "九受，謂九有情居。",
        "translation": "The nine feelings are the nine abodes of sentient beings.",
        "source": "T11n0316_036:0876b22_8"
    },
    {
        "source_sentence": "十受，謂十善業道。",
        "translation": "The ten feelings are the ten good paths of action.",
        "source": "T11n0316_036:0876b22_9"
    },
    {
        "source_sentence": "乃至總略諸受種種作意，是故應知有情無量受亦無量。",
        "translation": "It should therefore be known that the feelings of sentient beings are unlimited and their feelings are also unlimited.",
        "source": "T11n0316_036:0876b22_10"
    },
    {
        "source_sentence": "又諸菩薩觀樂受時，見諸有情住生死際，令發智慧，為彼開示善不善受。",
        "translation": "Also, when bodhisattvas observe pleasant feelings, they see sentient beings living in birth-and-death and cause them to develop wisdom that reveals good and unskillful feelings for them.",
        "source": "T11n0316_036:0876b24_11"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_036:0876b25_12"
    },
    {
        "source_sentence": "是為菩薩摩訶薩以受觀受念處。",
        "translation": "This is the bodhisattva-mahāsattva's place of sensation, contemplation, and mindfulness.",
        "source": "T11n0316_036:0876b26_13"
    },
    {
        "source_sentence": "「云何諸菩薩以心觀心念處？",
        "translation": "How do bodhisattvas use mind to contemplate the mindful abode of mindfulness?",
        "source": "T11n0316_036:0876b26_14"
    },
    {
        "source_sentence": "謂諸菩薩祕密守護正念不動，觀察此心速疾生滅，無有狀貌及無住處，",
        "translation": "It means that enlightening beings secretly guard right mindfulness without moving, observing this mind as quickly arising and ceasing, with no shape or dwelling place.",
        "source": "T11n0316_036:0876b27_15"
    },
    {
        "source_sentence": "亦不在內亦不在外不在中間。",
        "translation": "It's neither inside nor outside or in between.",
        "source": "T11n0316_036:0876b29_16"
    },
    {
        "source_sentence": "知初發心最極微量遠離心相，於其方分了不能得。",
        "translation": "Knowing that the first arousal of mind is most extremely subtle and distant from the characteristics of mind, they can't clearly perceive it in its direction.",
        "source": "T11n0316_036:0876b29_17"
    },
    {
        "source_sentence": "是心所集一切善根，最極微量亦皆遠離，及無方分。",
        "translation": "These are all the roots of merit that are accumulated by awarenesses. The most extremely subtle [factors] are also all to be avoided, and they do not have directional parts.",
        "source": "T11n0316_036:0876c02_0"
    },
    {
        "source_sentence": "又於是心回向菩提。",
        "translation": "He then returned to enlightenment in his mind.",
        "source": "T11n0316_036:0876c03_1"
    },
    {
        "source_sentence": "於自體相，無心所了、無心所觀、無心所入。」",
        "translation": "In their own essence and characteristics, there's nothing that the mind comprehends, nothing that the mind observes, and nothing that the mind enters.",
        "source": "T11n0316_036:0876c03_2"
    },
    {
        "source_sentence": "佛言：「是故得成阿耨多羅三藐三菩提。",
        "translation": "The Buddha said, Therefore, he'll attain unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_036:0876c04_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T11n0316_036:0876c05_4"
    },
    {
        "source_sentence": "謂菩提心與彼善心，於其作用而不共行，又善根心與菩提心亦不共行，",
        "translation": "It means that the awarenesses of enlightenment and good awarenesses do not act in common with each other. The awarenesses of roots of goodness also do not act in common with the awarenesses of enlightenment.",
        "source": "T11n0316_036:0876c05_5"
    },
    {
        "source_sentence": "又善根心與回向心亦不共行，又回向心與菩提心及善根心悉不共行。",
        "translation": "Also, the mind of good roots and the mind of dedication of merit don't share the same practice, and the mind of dedication of merit don't share the same practice as the mind of enlightenment and the mind of bodhi and the mind of good roots.",
        "source": "T11n0316_036:0876c07_6"
    },
    {
        "source_sentence": "應當如是觀察，不生驚怖，次復獲得甚深緣起不壞因果。",
        "translation": "You should thus observe it without fear, and next you'll attain profound conditioned arising that doesn't break down causes and effects.",
        "source": "T11n0316_036:0876c08_7"
    },
    {
        "source_sentence": "然法性心即有情自性，如是還屬諸法因緣，無動無作及無主宰，彼如覆障不共相應。",
        "translation": "However, the mind with the nature of dharmas is the self-nature of sentient beings. In this way, it belongs to all factors as cause and condition; it is unmoving, unmanifest, and without sovereignty. It is like an obstruction that is not associated with a common characteristic.",
        "source": "T11n0316_036:0876c10_8"
    },
    {
        "source_sentence": "是故應知，此法性心亦不共行。",
        "translation": "Therefore, you should know that this mind by the nature of dharmas also does not act in common.",
        "source": "T11n0316_036:0876c12_9"
    },
    {
        "source_sentence": "云何法性及覆障心？",
        "translation": "What's the Dharma nature and the obstructing mind?",
        "source": "T11n0316_036:0876c12_10"
    },
    {
        "source_sentence": "法性心者，謂於是處悉無所施。",
        "translation": "Dharma-nature mind means that there's nothing to give here and there.",
        "source": "T11n0316_036:0876c13_11"
    },
    {
        "source_sentence": "若復以一切所有回向遍覆莊嚴佛剎，是心覆障。",
        "translation": "Again, if someone adorns the Buddha's buddha-stage with all the dedications of merit that they have, this is a mind-covering obstruction.",
        "source": "T11n0316_036:0876c14_12"
    },
    {
        "source_sentence": "如彼幻化於剎那頃最極寂淨，名法性心。",
        "translation": "It's like that illusory transformation that's most tranquil and pure for a moment, which is called the Dharma-nature mind.",
        "source": "T11n0316_036:0876c15_13"
    },
    {
        "source_sentence": "若復集諸禁戒回向一切迅疾神通，是心覆障。",
        "translation": "If he also collects all the forbidden precepts and dedicates them back to all the swift supernormal abilities, this is a mind-covering obstruction.",
        "source": "T11n0316_036:0876c16_14"
    },
    {
        "source_sentence": "猶如夢想畢竟盡盡無餘，名法性心。",
        "translation": "It's like a dream that ultimately ends without remainder, which is called the Dharma-nature mind.",
        "source": "T11n0316_036:0876c17_15"
    },
    {
        "source_sentence": "若復樂忍辱力乃至回向遍覆莊嚴，是心覆障。",
        "translation": "If someone also delights in the power of forbearance and even returns to pervasive adornment, this is a mind-covering obstruction.",
        "source": "T11n0316_036:0876c18_16"
    },
    {
        "source_sentence": "猶如陽焰畢竟離身心相，名法性心。",
        "translation": "It's like a mirage that's ultimately free of the characteristics of body and mind, which is called the Dharma-nature mind.",
        "source": "T11n0316_036:0876c19_17"
    },
    {
        "source_sentence": "若復發起一切精進回向圓滿一切佛法，是心覆障。",
        "translation": "If someone also gives rise to all their effort and dedicates it back to the fulfillment of all the Buddha's teachings, this is a mental obstruction.",
        "source": "T11n0316_036:0876c20_0"
    },
    {
        "source_sentence": "如水中月無執無見，名法性心。",
        "translation": "It's like the moon in water that has no attachment and no views, which is called the mind of Dharma nature.",
        "source": "T11n0316_036:0876c21_1"
    },
    {
        "source_sentence": "若復以一切禪定解脫三摩地三摩鉢底回向諸佛三昧，是為覆障。",
        "translation": "If someone returns to the buddha-samādhi with all the liberating samādhis of meditation, samāpattis, and dedications of merit, this is an obstruction.",
        "source": "T11n0316_036:0876c21_2"
    },
    {
        "source_sentence": "無色無見無對無表，名法性心。",
        "translation": "The formless mind that has no views, no opposites, and no expressions is called the Dharma-nature mind.",
        "source": "T11n0316_036:0876c23_3"
    },
    {
        "source_sentence": "若復以智分別宣說一切清淨句義回向圓滿諸佛智慧，是為覆障。",
        "translation": "If someone also explains the meaning of all pure phrases with knowledge and discernment and returns them back to the perfect wisdom of the buddhas, this is an obstruction.",
        "source": "T11n0316_036:0876c24_4"
    },
    {
        "source_sentence": "種種施設，名法性心。",
        "translation": "They are variously defined, and they're called the Dharma-nature mind.",
        "source": "T11n0316_036:0876c25_5"
    },
    {
        "source_sentence": "若復於諸善根有所間斷，是為覆障。",
        "translation": "Again, if there's an interruption of the good roots, this is a covering obstruction.",
        "source": "T11n0316_036:0876c26_6"
    },
    {
        "source_sentence": "心無因生，名法性心。",
        "translation": "The mind that arises without a cause is called the Dharma-nature mind.",
        "source": "T11n0316_036:0876c26_7"
    },
    {
        "source_sentence": "若復因菩提分法所起，是為覆障。",
        "translation": "If it's also produced because of the factors of enlightenment, this is an obstruction.",
        "source": "T11n0316_036:0876c27_8"
    },
    {
        "source_sentence": "解脫六境，名法性心。",
        "translation": "Being liberated from the six objects, it's called mind of Dharma nature.",
        "source": "T11n0316_036:0876c28_9"
    },
    {
        "source_sentence": "若復於佛境界有所斷滅，是為覆障。",
        "translation": "Again, if there's something to stop and cease in the Buddha's realm, it's an obstruction.",
        "source": "T11n0316_036:0876c28_10"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_036:0876c29_11"
    },
    {
        "source_sentence": "菩薩摩訶薩如是行以觀心行時，安住神通，得彼神通於一心中，而能了知一切有情心之所趣，",
        "translation": "“When great enlightening beings practice in this way by contemplating mental action, they abide in mystic powers and attain those spiritual powers in one mind, yet they can know the states of minds of all sentient beings.",
        "source": "T11n0316_036:0876c29_12"
    },
    {
        "source_sentence": "知已隨其本性而為說法。",
        "translation": "He knows that he's taught the Dharma according to his original nature.",
        "source": "T11n0316_036:0877a02_13"
    },
    {
        "source_sentence": "又復安住大悲，得彼大悲而能化度一切有情無有疲倦，於此觀行加持是心無盡無滅。",
        "translation": "He also abides in great compassion, attains that great compassion and can transform all sentient beings without weariness, and his contemplation and practice are applied to this mind with endlessness and cessation.",
        "source": "T11n0316_036:0877a03_14"
    },
    {
        "source_sentence": "設復入生死際斷諸繫縛，而於此心念智不起、超諸行法，一切聲聞辟支佛所不能及，",
        "translation": "Even if they were to enter the realm of birth and death and cut off all fetters, their minds and intellects wouldn’t arise in this way, transcending all conditioned phenomena that no śrāvakas or pratyekbuddhas can match.",
        "source": "T11n0316_036:0877a05_15"
    },
    {
        "source_sentence": "而得安住是心乃至圓滿一切佛法。",
        "translation": "They can then abide in this mind and even perfect all the buddha-teachings.",
        "source": "T11n0316_036:0877a07_16"
    },
    {
        "source_sentence": "是心於剎那頃能與勝慧平等相應，決定成就阿耨多羅三藐三菩提果。",
        "translation": "In a moment, this mind can be associated with the equality of superior wisdom and definitely achieve the fruit of unsurpassed, correct, and complete enlightenment.",
        "source": "T11n0316_036:0877a08_17"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T11n0316_036:0877a09_18"
    },
    {
        "source_sentence": "是名菩薩摩訶薩以心觀心念處。」",
        "translation": "This is called the mindful abode of the bodhisattva Mahāsattva observing his mind with his mind.",
        "source": "T11n0316_036:0877a10_0"
    },
    {
        "source_sentence": "佛說大乘菩薩藏正法經卷第三十六",
        "translation": "Foshuo daishi pusa zhengfa jing, vol. 36",
        "source": "T11n0316_036:0877a11_0"
    }
]