[
    {
        "source_sentence": "迦葉赴佛般涅槃經",
        "translation": "Kāśyapa-parinirvāṇa-sūtra",
        "source": "T12n0393_001:1115b03_0"
    },
    {
        "source_sentence": "東晉西域沙門竺曇無蘭譯",
        "translation": "Translated by Zhu Dharmakṣema, a monk of the Western Regions of the Eastern Jin dynasty",
        "source": "T12n0393_001:1115b05_0"
    },
    {
        "source_sentence": "昔佛在世時，摩訶迦葉於諸比丘中，最長年高，才明智慧，其身亦有金色相好；",
        "translation": "“O Mahākāśyapa, the oldest of the bhikṣus among all the bhikṣus in the assembly when the Buddha was living in the world, possessed golden-colored complexion.",
        "source": "T12n0393_001:1115b06_0"
    },
    {
        "source_sentence": "佛每說法，常與其對坐，人民見之或呼為佛師。",
        "translation": "Whenever the Buddha taught the Dharma, he always sat face-to-face with them, and when people saw him, they might call him the Buddha's teacher.",
        "source": "T12n0393_001:1115b07_1"
    },
    {
        "source_sentence": "於是迦葉乃辭佛到伊篩梨山中，一山名普能，周旋數千里，去舍衛國二萬六千里，",
        "translation": "Then Kāśyapa departed from the Buddha and came to Mount Yixi, which was called Puṇṇananthorita with a circuit of several thousand li in circuit; it was twenty-six thousand li from Sāvatthī.",
        "source": "T12n0393_001:1115b08_2"
    },
    {
        "source_sentence": "多出七寶，甘果不訾，名香好藥栴檀三種：其一種芳香，一種治人百病，",
        "translation": "It produces much of the seven kinds of treasure and sweet fruits are not salty. They are called the three kinds of sandalwood with good fragrance, medicine, and sandalwood that have one kind of fragrance and one kind to cure a hundred people’s illnesses.",
        "source": "T12n0393_001:1115b10_3"
    },
    {
        "source_sentence": "一種可用染五色。",
        "translation": "One is that they can dye the five colors.",
        "source": "T12n0393_001:1115b12_4"
    },
    {
        "source_sentence": "眾香雜藥不可稱數。",
        "translation": "The many fragrances and mixed medicines are incalculable.",
        "source": "T12n0393_001:1115b12_5"
    },
    {
        "source_sentence": "亦有走翔鳥獸，師子、虎、狼、白象、騏驎、朱雀、鳳凰。",
        "translation": "There are also flying birds and animals, such as lions, tigers, wolves, white elephants, cheetahs, red-colored birds, and phoenixes.",
        "source": "T12n0393_001:1115b13_6"
    },
    {
        "source_sentence": "或有清淨異學道士。",
        "translation": "Perhaps there are pure non-Buddhist priests.",
        "source": "T12n0393_001:1115b14_7"
    },
    {
        "source_sentence": "時有方石平正，其色如琉璃，縱廣百二十里，奇樹蔭涼華葉五色，冬夏茂盛列生石上。",
        "translation": "At that time there was a square rock of the same color as lapis lazuli, one hundred and twenty li in length and breadth. The strange trees shaded it with cool flowers and leaves of five colors growing luxuriantly on top of the rock during winter and summer seasons.",
        "source": "T12n0393_001:1115b14_8"
    },
    {
        "source_sentence": "迦葉前後教授二千弟子，皆清淨高行得羅漢者，常坐此石上，誦經行道。",
        "translation": "Kāśyapa had two thousand disciples before and after him, all pure and high-ranking arhats who had attained arhatship, always sat on this rock to recite sūtras and practice the path.",
        "source": "T12n0393_001:1115b16_9"
    },
    {
        "source_sentence": "又有清淨甘香泉水，周旋四十里，其水中則有優曇華，紺色華、紅色華、紫色華。",
        "translation": "There was also a fountain of pure sweet fragrance, forty li in circuit, where there were blue, pink, and purple flowers.",
        "source": "T12n0393_001:1115b18_10"
    },
    {
        "source_sentence": "迦葉弟子七人，同夕得夢：其一比丘，夢見其所坐方石中央分破，樹皆根拔；",
        "translation": "Seven of Kāśyapa’s disciples had the same night in which a dream occurred to them: One of the bhikṣus had a dream in which he saw his seat split apart at the center of the square rock and all the trees with their roots pulled down.",
        "source": "T12n0393_001:1115b20_11"
    },
    {
        "source_sentence": "復一比丘夢見四十里泉水皆乾竭，華悉零落；",
        "translation": "Another bhikṣu had a dream in which all the springs forty li away dried up and the flowering water disappeared.",
        "source": "T12n0393_001:1115b21_12"
    },
    {
        "source_sentence": "一比丘夢見拘羅邊坐皆傾毀；",
        "translation": "A bhikṣu dreamed that all the seats at the side of Kālāma trembled in distress.",
        "source": "T12n0393_001:1115b22_13"
    },
    {
        "source_sentence": "一比丘夢見閻浮利地皆傾陷；",
        "translation": "A bhikṣu dreamed that all the people in Jambudvīpa fell to the ground.",
        "source": "T12n0393_001:1115b23_14"
    },
    {
        "source_sentence": "一比丘夢見須彌山崩；",
        "translation": "A bhikṣu dreamed that Mount Sumeru had collapsed.",
        "source": "T12n0393_001:1115b24_15"
    },
    {
        "source_sentence": "一比丘夢見金輪王薨；",
        "translation": "A bhikṣu dreamed of the golden wheel king dying.",
        "source": "T12n0393_001:1115b24_16"
    },
    {
        "source_sentence": "一比丘夢見日月墮地，天下失明。",
        "translation": "A monk dreamed that the sun and moon fell to the ground, and the world lost its light.",
        "source": "T12n0393_001:1115b25_17"
    },
    {
        "source_sentence": "晨起各以所夢啟迦葉。",
        "translation": "Each of them rose in the morning and asked Kāśyapa about what they had dreamed.",
        "source": "T12n0393_001:1115b26_18"
    },
    {
        "source_sentence": "迦葉告言：「我曹前見光明，地時大動，卿等復得是夢，佛將般泥洹。」",
        "translation": "Kāśyapa told them, I saw a bright light in front of you, and the earth moved greatly at that time; you also had this dream where the Buddha was about to enter nirvāṇa.",
        "source": "T12n0393_001:1115b26_19"
    },
    {
        "source_sentence": "即勅諸弟子往赴俱夷那竭國。",
        "translation": "He then ordered his disciples to go to the country of Kuśinagara.",
        "source": "T12n0393_001:1115b28_20"
    },
    {
        "source_sentence": "道見一婆羅門，持文陀羅華。",
        "translation": "On the way, he saw a Brāhmaṇa holding a mandala flower in his hand.",
        "source": "T12n0393_001:1115b28_21"
    },
    {
        "source_sentence": "迦葉即問言：「卿從何來？",
        "translation": "Kāśyapa then asked, Where did you come from?",
        "source": "T12n0393_001:1115b29_22"
    },
    {
        "source_sentence": "欲何所至？",
        "translation": "Where do you want to go?",
        "source": "T12n0393_001:1115c01_23"
    },
    {
        "source_sentence": "那得是天華？」",
        "translation": "How could it be a heavenly flower?",
        "source": "T12n0393_001:1115c01_24"
    },
    {
        "source_sentence": "答言：「我從俱夷那竭國來，時佛般泥洹已經七日。",
        "translation": "He replied, I came from the country of Kuśinagara, and seven days had passed since the Buddha's parinirvāṇa.",
        "source": "T12n0393_001:1115c01_25"
    },
    {
        "source_sentence": "諸天往赴，悉持天華天香供養佛身，此華即是。」",
        "translation": "When the gods go and come, they all carry heavenly flowers and celestial incense to offer support to the Buddha's body, and this is the flower.",
        "source": "T12n0393_001:1115c02_26"
    },
    {
        "source_sentence": "迦葉聞是語，便自投於地啼泣而言：「佛今般泥洹。",
        "translation": "When Kāśyapa heard these words, he threw himself to the ground in tears and said, Now that the Buddha has entered nirvāṇa.",
        "source": "T12n0393_001:1115c03_27"
    },
    {
        "source_sentence": "三界失明，將復何依恃？」",
        "translation": "What will we rely on if the three realms are lost in insight?",
        "source": "T12n0393_001:1115c05_0"
    },
    {
        "source_sentence": "便帥將諸弟子進道，未到數百里，便見四天王及梵釋諸天，皆持七寶蓋、名香好華，",
        "translation": "The commander then led his disciples on the path. Not many hundreds of li away, he saw the four guardian gods of heaven and Brahmakāyika Heaven holding seven-jeweled canopies called fragrant lotus blossoms.",
        "source": "T12n0393_001:1115c05_1"
    },
    {
        "source_sentence": "悉往供養佛，諸天作十二部音樂，亦有阿須輪王、諸大鬼神側塞空中，",
        "translation": "They all went to make offerings to the Buddha, and the gods played twelve kinds of music. There were also asuras and great spirits flying in the sky beside them.",
        "source": "T12n0393_001:1115c07_2"
    },
    {
        "source_sentence": "又見俱夷那竭國王，及諸隣國王，各從其群僚數百萬人。",
        "translation": "He also saw the king of Kuśinagara and other neighboring kings, each accompanied by several million officials.",
        "source": "T12n0393_001:1115c09_3"
    },
    {
        "source_sentence": "見迦葉將諸弟子到，是時國貴末羅弗王，則勅國人民皆令避道，使迦葉及諸弟子得進。",
        "translation": "When he saw Kāśyapa and his disciples arrive, the country's noble king Māra Pūrva then ordered all the people of his country to avoid the path so that Kāśyapa and his disciples could advance.",
        "source": "T12n0393_001:1115c10_4"
    },
    {
        "source_sentence": "阿那律出迎相見言：「佛般泥洹已七日，耶維火不然，但待賢者到耳！」",
        "translation": "Aniruddha came out to greet them and said, Seven days after the Buddha's parinirvāṇa, Yaśodharā didn't; wait until the good man arrived!",
        "source": "T12n0393_001:1115c12_5"
    },
    {
        "source_sentence": "阿難見迦葉，便自投地啼哭不自勝。",
        "translation": "Seeing Kāśyapa, Ānanda threw himself to the ground in tears and cried uncontrollably.",
        "source": "T12n0393_001:1115c14_6"
    },
    {
        "source_sentence": "有一老比丘名波或，即止阿難言：「止止！",
        "translation": "An elderly monk named Pāyāsi stopped Ānanda and said, Stop!",
        "source": "T12n0393_001:1115c14_7"
    },
    {
        "source_sentence": "佛在時常禁制我等不得自由。",
        "translation": "When the Buddha was present, he always restrained us and prevented us from freedom.",
        "source": "T12n0393_001:1115c15_8"
    },
    {
        "source_sentence": "佛今般泥洹，吾等得自在。",
        "translation": "Now that the Buddha has entered nirvāṇa, we'll attain mastery.",
        "source": "T12n0393_001:1115c16_9"
    },
    {
        "source_sentence": "莫復啼哭。」",
        "translation": "Don't weep again.",
        "source": "T12n0393_001:1115c17_10"
    },
    {
        "source_sentence": "時有天聞波或語，即舉手搏之，迦葉便前接持，天止之，謂波或言：「佛今般泥洹，",
        "translation": "When some gods heard what Pāyāsi said, they raised their hands and whipped him. Kāśyapa came forward to receive the Buddha’s precepts but the gods stopped him. They said to Pāyāsi, “The Buddha is now passing away.",
        "source": "T12n0393_001:1115c17_11"
    },
    {
        "source_sentence": "一切失所恃，汝獨愚癡而反喜快。」",
        "translation": "All the faults are relied upon, and you're alone in your folly and rejoice instead.",
        "source": "T12n0393_001:1115c19_12"
    },
    {
        "source_sentence": "波或聞是語意解，即得阿羅漢道。",
        "translation": "Pāyāsi, having heard these words and understood what they meant, attained the path of the arhat.",
        "source": "T12n0393_001:1115c19_13"
    },
    {
        "source_sentence": "迦葉便與諸弟子頭面著地，作禮繞棺三匝悲哀而言：「我等今日不知佛頭足所在。」",
        "translation": "Kāśyapa then bowed his head and face to the ground with his disciples, circumambulated the coffin three times, and said in sorrow, Today, we don't know where the Buddha's head and feet are.",
        "source": "T12n0393_001:1115c20_14"
    },
    {
        "source_sentence": "佛威神則為出足，諸天人民莫不感傷。",
        "translation": "The Buddha's authoritative spirit then became a footstool, and all the gods and people were saddened.",
        "source": "T12n0393_001:1115c22_15"
    },
    {
        "source_sentence": "「佛為三界乘，　　度於生死淵，",
        "translation": "The Buddha is the vehicle of the three realms, crossing the abyss of birth and death.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　澹泊昇泥洹，　　微妙越世間。",
        "translation": "Their tranquility ascends to nirvāṇa, and their subtlety transcends the world.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　佛為無量明，　　照於愚癡冥，",
        "translation": "Buddha is immeasurable light, Illumining the darkness of ignorance.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　願為一切人，　　顯耀現威靈。",
        "translation": "May it be for the sake of all people, Manifesting its authoritative power.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　佛為大慈哀，　　所度無央數，",
        "translation": "The Buddha’s compassionate benevolence saves immeasurable sentient beings.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　尊體處金棺，　　清淨寂然安。",
        "translation": "Venerable One’s body is buried in a golden coffin, Pure and peaceful.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　願用優和德，　　見身色相光，",
        "translation": "May you use the virtue of superior harmony To see the light of body, form, and characteristics.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　普令天及人，　　興起無量福。",
        "translation": "Causing gods and humans everywhere To produce immeasurable merit.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　佛為開現法，　　眾生受潤澤，",
        "translation": "For the sake of revealing the teaching, the Buddha nourishes sentient beings.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　得止生死輪，　　或者入正諦，",
        "translation": "They may be able to stop the wheel of birth and death, Or enter the true truth.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　已蒙如來恩，　　頭面禮佛足。",
        "translation": "Having received the Tathāgata’s favour, They bowed their heads and feet at the Buddha’s feet.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　今但覩金棺，　　心為悲感傷，",
        "translation": "Now I just buried the coffin in gold. My heart is grieved and saddened.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　佛雖就無為，　　聖達靡不實。",
        "translation": "Although the Buddha deals with nonexistence, His noble insight is not insubstantial.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　見後有疑諦，　　出足於金棺，",
        "translation": "Seeing the later doubtful truth, he left his legs in a golden coffin.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　起分是生死，　　佛以不復愁，",
        "translation": "The aspect of arising is birth and death, but the Buddha doesn’t worry about it again.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "　法身慧常存，　　莫呼永泥洹。」",
        "translation": "The Dharma body and wisdom are always present, so don't call it eternal nirvāṇa.",
        "source": "T12n0393_001:1115c23_16"
    },
    {
        "source_sentence": "於是摩訶迦葉乃說偈讚佛言：迦葉赴佛般涅槃經",
        "translation": "Then Mahākāśyapa praised the Buddha in verse: Kāśyapa, go unto the buddha-parinirvāṇa sūtra",
        "source": "T12n0393_001:1115c23_16"
    }
]