[
    {
        "source_sentence": "佛說護國尊者所問大乘經卷第",
        "translation": "Foshuo  protecting the kingdoms of honored ones and asking questions about the great vehicle scriptures, Volume 1",
        "source": "T12n0321_003:0008c02_0"
    },
    {
        "source_sentence": "三",
        "translation": "three",
        "source": "T12n0321_003:0008c03_0"
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試鴻臚卿",
        "translation": "Xitian's Translation of the Sutra of the Tripiṭaka Treasury,朝散大夫試鴻卿",
        "source": "T12n0321_003:0008c05_0"
    },
    {
        "source_sentence": "傳法大師臣施護奉　詔譯",
        "translation": "Translated by imperial edict by the Dharma Master Zhuanfa's minister, Shi Hu Feng",
        "source": "T12n0321_003:0008c06_0"
    },
    {
        "source_sentence": "「『太子！汝當知：　　莫著於迷醉，",
        "translation": "“‘O prince, you should know: Don’t be attached to delusion and intoxication.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　於此嶮難中，　　勤求於出離。",
        "translation": "In the midst of these difficulties, they diligently seek escape.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　如佛所說言：　　若離迷醉者，",
        "translation": "As the Buddha has said: “If one is free from delusion and intoxication,",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　此人大勇猛。　　善行於律儀，",
        "translation": "This great man is courageous and well-conducted in observing the disciplinary rules.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　清淨無瑕穢，　　所見諸眾生，",
        "translation": "Pure, without blemish, All sentient beings who see it Will be like this.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　心生慈愍行，　　成佛當不久。",
        "translation": "The mind gives rise to compassionate actions, and soon he'll become a buddha.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　過去一切佛、　　現在及未來，",
        "translation": "All buddhas of the past, present and future",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　皆從眾善生，　　遠離貪、瞋、癡。",
        "translation": "They all arise from goodness and are free of craving, anger, and delusion.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　飲食及衣服、　　金、銀、摩尼寶、",
        "translation": "food, drink, clothing, gold, silver, maṇi treasures,",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　種種莊嚴具，　　捨施利眾生。",
        "translation": "Various kinds of adornments are given away for the benefit of sentient beings.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　廣歷俱胝劫，　　一心求菩提，",
        "translation": "They traveled for billions of eons, singlemindedly seeking enlightenment.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　未曾有疲懈。　　或捨於身分、",
        "translation": "They never tire of it, or give up one’s identity.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　頭、目、手、足等，　　於彼求乞人，",
        "translation": "Their heads, eyes, hands, feet, and so forth, seeking beggars there,",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　心生大歡喜。　　以此積功德，",
        "translation": "With great joy in their hearts, they accumulate these virtues.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　而成佛菩提。　　設處國王位，",
        "translation": "They will attain enlightenment and become buddhas, even if they are kings.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　豪貴而最上，　　美女及眷屬，",
        "translation": "They are the most noble and supreme, With beautiful women and their retinues.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　晝夜常圍繞，　　宮殿及國城，",
        "translation": "Day and night, they always surround the palace and the capital city.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　悉皆如幻化。　　譬如坏器等、",
        "translation": "They are all illusory, like broken vessels, etc.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　陽焰、水沫泡，　　其體不堅牢，",
        "translation": "Like mirages and bubbles of water, Their bodies are not strong or stable.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　非實、非久住。　　如是無常法，",
        "translation": "It is neither real nor eternal, and thus impermanent.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　虛妄汝當知。　　父母與妻男，",
        "translation": "You should know that it is a lie. The father, mother, wife, and children are not allowed to do so.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　誰能相救濟？　　所作善、惡業，",
        "translation": "Who can save and rescue each other?",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　是人隨業行，　　如是無數劫，",
        "translation": "Such a person acts according to his actions For countless kalpas like this.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　常沈生死海。　　亦如無目人，",
        "translation": "They are always submerged in the sea of birth and death, just like a man without eyes.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　於境而不了，　　虛受於勤勞，",
        "translation": "They don’t understand objects, And vainly endure hardship.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　終墮嶮惡趣。　　菩提最上路，",
        "translation": "They will eventually fall into a precipitous and evil destiny, the highest path of enlightenment.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　勇猛精進行，　　乃至於命終，",
        "translation": "Their courageous effort continues until the end of life.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　不生三惡道。　　佛世人難值、",
        "translation": "They will not be reborn in the three evil realms of rebirth.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　正法難得聞，　　降伏煩惱怨，",
        "translation": "The true teaching is hard to hear, overcoming afflictions and enemies.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　親近於善友，　　恒修入正道。",
        "translation": "Being intimate with good friends, they always cultivate and enter the right path.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　安住菩提心，　　不退於佛道，",
        "translation": "Abiding in the determination for enlightenment, They do not regress from the path of buddhahood.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　如是行方便，　　世間無有上。",
        "translation": "Such practice and skillful means are unsurpassed in the world.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　過去一切佛，　　捨離於親愛，",
        "translation": "All the buddhas of the past Have abandoned affection and love.",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　常處於深山，　　正念自思惟，",
        "translation": "He always remained deep in the mountains, Thinking to himself with right mindfulness:",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "　　堅固如金剛，　　志求無上道。』」",
        "translation": "It's as strong as the adamantine, and it's determined to pursue the unsurpassed path.'",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "「爾時，淨光天子而說頌曰：爾時，佛告尊者護國言：「淨光天子說此頌已，",
        "translation": "At that time, the celestial being Pure Light spoke these verses:",
        "source": "T12n0321_003:0008c07_0"
    },
    {
        "source_sentence": "彼福光太子年至十歲，智慧明達而無戲論。",
        "translation": "When he was ten years old, Prince Fukuang had wisdom and insight but didn't engage in conceptual elaborations.",
        "source": "T12n0321_003:0009a15_0"
    },
    {
        "source_sentence": "於世所有園林、花卉、流泉、浴池、歌舞、作樂而不愛著，乃至國城、宮殿、象、馬、車乘、金、銀、財寶，",
        "translation": "They don’t cling to the parks, flowers, streams, bathing ponds, songs, dances, music, or pleasures of the world, up to cities, palaces, elephants, horses, chariots, gold, silver, and other treasures.",
        "source": "T12n0321_003:0009a16_0"
    },
    {
        "source_sentence": "一切所欲之事悉皆遠離。",
        "translation": "All the things he desires are completely removed.",
        "source": "T12n0321_003:0009a17_1"
    },
    {
        "source_sentence": "一心思惟：『我身虛幻，四大假合，無有堅實，大地、諸天悉非究竟。",
        "translation": "With one thought, they think, 'My body is illusory, the four elements are nominally combined, there's no solidity, and neither the earth nor the gods are perfect.",
        "source": "T12n0321_003:0009a18_2"
    },
    {
        "source_sentence": "凡夫眾生常行非法，愚癡迷惑，分別親踈，耽著欲樂無有厭足，永處輪迴無解脫時。",
        "translation": "Ordinary sentient beings always practice what's unlawful, foolish and deluded, discriminating and intimate, addicted to desires and pleasures without getting tired of them, and permanently remaining in transmigration without a time of liberation.",
        "source": "T12n0321_003:0009a19_3"
    },
    {
        "source_sentence": "我於如是愚迷人中而乃受生。』",
        "translation": "In such a foolish man, I'll be born.'",
        "source": "T12n0321_003:0009a21_4"
    },
    {
        "source_sentence": "作是念已，志意繫心專求解脫。」",
        "translation": "After he thinks this, his mind is concentrated on seeking liberation.",
        "source": "T12n0321_003:0009a22_5"
    },
    {
        "source_sentence": "爾時，世尊復告尊者護國言：「彼發光王為其太子選擇最上淨妙福地建置一城，",
        "translation": "It was then that the World-honored One again said to the venerable protector of the kingdom, saying: King Amoghapāśavyūha built a city for his prince on the highest and most pure ground of blessedness.",
        "source": "T12n0321_003:0009a24_0"
    },
    {
        "source_sentence": "名曰愛樂。",
        "translation": "It's called 'craving pleasure.'",
        "source": "T12n0321_003:0009a25_1"
    },
    {
        "source_sentence": "其城七重，於其城中有七百街道，純以七寶、鈴鐸、真珠羅網遍覆其上。",
        "translation": "The city was built of seven stories, and there were 700 streets in it, all covered with a net of seven treasures, bells, chimes, and genuine pearls.",
        "source": "T12n0321_003:0009a26_2"
    },
    {
        "source_sentence": "復有六十眾寶妙蓋、八萬寶幢於諸街巷次第行布，一一寶幢有六萬寶索，",
        "translation": "There were also sixty thousand beautiful canopies of various jewels and eighty thousand jeweled pennants spread one after another in the street corners. Each jeweled pennant contained sixty thousand jeweled strings.",
        "source": "T12n0321_003:0009a27_3"
    },
    {
        "source_sentence": "一一寶索有十四俱胝樂器，如是樂器，微風吹動出妙音聲，如百千天樂。",
        "translation": "Each one of the jeweled cords had fourteen corpuscles of instruments, each sound like a hundred thousand heavenly sounds.",
        "source": "T12n0321_003:0009a29_4"
    },
    {
        "source_sentence": "又，於此城街巷、衢路處處各住五百童女——是諸童女身相端嚴，顏貌和悅，",
        "translation": "“Furthermore, in the streets and thoroughfares of this city there lived five hundred nymphlike maidens, each with a graceful countenance like that of a goddess.",
        "source": "T12n0321_003:0009b02_0"
    },
    {
        "source_sentence": "於諸音樂、歌舞、作倡一切悉能。",
        "translation": "He's able to play all kinds of music, sing and dance, and perform all kinds of actions.",
        "source": "T12n0321_003:0009b03_1"
    },
    {
        "source_sentence": "「時發光王勅告之曰：『令諸童女晝夜作樂，不得間斷。』",
        "translation": "The king of the arousal of light then ordered them to tell him, 'Let the children make music day and night without interruption.'",
        "source": "T12n0321_003:0009b04_2"
    },
    {
        "source_sentence": "所有四方一切人民來入此城，見斯音樂、快樂之事，奔聚看翫，令其太子心生樂著。",
        "translation": "All the people of the four directions came and entered this city, saw these music and delightful things, and rushed to see them, causing the prince's mind to become happy and attached.",
        "source": "T12n0321_003:0009b05_3"
    },
    {
        "source_sentence": "又復，王言：『所有眾生求飲食者施以飲食、求衣服者施以衣服、求花鬘塗香者施以花鬘塗香、求床榻臥具者施以床榻臥具，",
        "translation": "Again, the king said, 'All sentient beings who seek food and drink give food and drink to those who seek food; those who seek clothing give clothing to those who seek clothing; those who seek flower garlands and scented ointments give flower garlands and scented ointments to those who seek incense; and those who seek a bed or bedding give",
        "source": "T12n0321_003:0009b07_4"
    },
    {
        "source_sentence": "乃至以金、銀、摩尼、硨磲、碼碯、珊瑚、真珠、吠瑠璃等如是諸寶處處堆積，",
        "translation": "It is made of gold, silver, precious stones, pearls, emeralds, coral, genuine pearls, lapis lazuli, and the like.",
        "source": "T12n0321_003:0009b10_5"
    },
    {
        "source_sentence": "復有象、馬、車乘，皆以眾寶種種莊嚴，令一切眾生隨意受用。』",
        "translation": "There are also elephants, horses, chariots, and vehicles that are all adorned with various kinds of treasures and allow all sentient beings to enjoy them as they wish.'",
        "source": "T12n0321_003:0009b11_6"
    },
    {
        "source_sentence": "「爾時，發光王復為太子於此城中修建一宮，廣一由旬，造四門樓，戶牖、軒窗，",
        "translation": "“At that time, King Ābhāsvara had another palace built for the prince in this city, one yojana long and one yojana wide, consisting of four gates with doors, windows, terraces, and storeys.",
        "source": "T12n0321_003:0009b14_0"
    },
    {
        "source_sentence": "皆以七寶種種莊嚴。",
        "translation": "They are all adorned in various ways with the seven treasures.",
        "source": "T12n0321_003:0009b15_1"
    },
    {
        "source_sentence": "於此宮中置一大殿，用百千珍寶周匝莊挍，於殿中間安四俱胝眾寶床榻及以臥具。",
        "translation": "In this palace, there's a large hall that's surrounded by hundreds of thousands of treasures and adorned with jewelry, and in the middle of the hall are four corpuscles of jeweled beds, seats, and bedding.",
        "source": "T12n0321_003:0009b16_2"
    },
    {
        "source_sentence": "復於城中置一大園，花、菓、樹木其數甚多，蓊蔚開敷，世所希有。",
        "translation": "Again, there was a large park in the city, with plenty of flowers, fruit, and trees growing luxuriantly. This was rare to see in the world.",
        "source": "T12n0321_003:0009b18_3"
    },
    {
        "source_sentence": "於其中間排一切寶樹，光明照曜無不愛樂。",
        "translation": "Between them, there are all the jeweled trees that line up, shining brightly and brilliantly, and no one doesn't delight in them.",
        "source": "T12n0321_003:0009b19_4"
    },
    {
        "source_sentence": "「又於園中有七寶池，於池四邊有四界道，四寶所成，所謂金、銀、吠瑠璃、玻瓈。",
        "translation": "Again, there is a pool of the seven kinds of treasure in the park. On each side of the pool are four boundary paths made of the four kinds of treasure: gold, silver, vaiḍūrya, and crystal.",
        "source": "T12n0321_003:0009b20_5"
    },
    {
        "source_sentence": "於池周匝置一百八師子口，水從彼入；",
        "translation": "He surrounded the pond with one hundred and eighty-eight lion mouths, and water flowed in from them.",
        "source": "T12n0321_003:0009b22_6"
    },
    {
        "source_sentence": "復置一百八師子口，水從彼出。",
        "translation": "Again, he put the one hundred and eighth lion's mouth in his mouth, and water emerged from it.",
        "source": "T12n0321_003:0009b23_7"
    },
    {
        "source_sentence": "其中復生鉢訥摩花、烏怛鉢攞花、俱母那花、奔拏哩迦花等種種名花，",
        "translation": "In the midst of these flowers grew blue lotus blossoms, pink lotus blossoms, white lotus blossoms, red lotus blossoms, and all kinds of other precious plants.",
        "source": "T12n0321_003:0009b23_8"
    },
    {
        "source_sentence": "恒時開敷於池周匝。",
        "translation": "It's always open and spread around the pond.",
        "source": "T12n0321_003:0009b25_9"
    },
    {
        "source_sentence": "「復有八百寶樹，一一寶樹各懸寶索，一一索上有俱胝數樂器，微風吹動出妙音聲，",
        "translation": "Again, there were trees of eight hundred kinds of jewels, each endowed with its own rope, on which stood as many musical instruments as there are grains of sand in the Ganges River. The sound of their music was heard by a gentle breeze blowing down like thunder.",
        "source": "T12n0321_003:0009b26_10"
    },
    {
        "source_sentence": "令諸眾生聞者愛樂。",
        "translation": "It causes sentient beings who hear it to love it.",
        "source": "T12n0321_003:0009b28_11"
    },
    {
        "source_sentence": "復次，寶樹懸掛八十百千珍寶妙幡，又於池上置大寶網而以為蓋，覆太子身令離塵坌。",
        "translation": "“Furthermore, hanging from the jeweled trees were eighty-thousand myriads­  thousands of precious and wonderful banners. On top of the pond was also a great jeweled net that covered the prince’s body so as to keep him away from the dust motes.",
        "source": "T12n0321_003:0009b28_12"
    },
    {
        "source_sentence": "「爾時，發光王復令殿內以其七寶造四俱胝寶座，一一寶座各以五百上妙之衣敷於座上。",
        "translation": "At the time, the king of Vairocana again ordered his palace to create a four-cornered jeweled throne made of those seven treasures, and each jeweled throne was spread on top of that throne with five hundred most exquisite robes.",
        "source": "T12n0321_003:0009c02_0"
    },
    {
        "source_sentence": "於其中間置一大座，高七人量，以八十俱胝上妙寶衣敷設其上，此是福光太子所登之座。",
        "translation": "Between them was a great throne seven feet in height, spread with beautiful jeweled robes of eighty corpuscles. This was the throne ascended by Prince Light of blessedness.",
        "source": "T12n0321_003:0009c04_1"
    },
    {
        "source_sentence": "於諸座前各置香爐——純金所成——於爐周匝懸金鈴鐸及金蓮花，摩尼寶網四面嚴飾，",
        "translation": "In front of each seat he set up an incense burner made of pure gold, surrounded by golden bells, chimes, and golden lotus blossoms, adorned with nets of jewels on all four sides.",
        "source": "T12n0321_003:0009c06_2"
    },
    {
        "source_sentence": "光明照耀，晝夜三時恒爇沈香及散妙花。",
        "translation": "The light shone brightly, and during the three seasons of day and night it always emitted fragrant odors and scattered exquisite flowers.",
        "source": "T12n0321_003:0009c08_3"
    },
    {
        "source_sentence": "復於園內有九十九百千摩尼寶，一一摩尼寶廣一由旬，有大光明照一切世界。」",
        "translation": "Again, there are nine million-nine hundred thousand maṇi treasures inside the park, each maṇi treasure one yojana in width that have a great radiance that illuminates all worlds.",
        "source": "T12n0321_003:0009c09_0"
    },
    {
        "source_sentence": "爾時，世尊復告護國言：「福光太子園苑之內有種種飛鳥，鸚鵡、鴝鵒、鴛鴦、鵝、鴨、孔雀、舍利、俱枳羅鳥、俱拏羅鳥、迦陵、頻伽、命命鳥等。",
        "translation": "It was then that the Bhagavān again addressed the guardians of the kingdom, saying, There are various flying birds in Prince Fukuang's park, such as parrots, ducks, mandarin ducks, geese, ducks, foxes, porcupines, śāriputras, koṭalas, koṭalas, kalaviṅka, biṅg",
        "source": "T12n0321_003:0009c11_0"
    },
    {
        "source_sentence": "如是眾鳥俱善人言，每群飛時作微妙聲——如眾音樂而無有異，亦如天帝歡喜之園——令諸天人受妙快樂。",
        "translation": "Thus, each time the birds are flying, they make a subtle sound - just like the sounds of music without distinction, and it's like the joyful park of Indra-that causes gods and humans to experience marvelous happiness.",
        "source": "T12n0321_003:0009c14_1"
    },
    {
        "source_sentence": "「彼發光天子復為太子修饌上味飲食，逐日供給五百千車。",
        "translation": "Ābhāsvaradeva again offered the prince delicious food and drink, offering five hundred thousand chariots day after day.",
        "source": "T12n0321_003:0009c16_2"
    },
    {
        "source_sentence": "復令使命於諸城邑、聚落選取童女——年十六歲至二十歲者，色相端嚴，",
        "translation": "Again, he ordered the mission to select girls in cities and villages - those sixteen years old up to twenty years old with graceful appearance.",
        "source": "T12n0321_003:0009c18_3"
    },
    {
        "source_sentence": "諸根具足，不長、不短，不肥、不瘦，不白、不黑，身出白檀香、口出優鉢羅花香，",
        "translation": "Their faculties are endowed, neither long nor short, neither fat nor thin, neither white nor black; their bodies emit the fragrance of white sandalwood and their mouths emit the fragrance of utpala flowers.",
        "source": "T12n0321_003:0009c19_4"
    },
    {
        "source_sentence": "言詞美善，心意純直而無妬忌，善解博弈、歌舞、戲樂，乃至一切世間工巧伎藝無不悉解——如是童女得八十俱胝，",
        "translation": "Their words were beautiful and good, their minds pure and straightforward without jealousy or resentment, well versed in all kinds of games, songs, dances, and amusements, up to the knowledge of all worldly arts and crafts—thus did the girl gain eighty koṭis of gold.",
        "source": "T12n0321_003:0009c21_5"
    },
    {
        "source_sentence": "來入王城。",
        "translation": "They came and entered the king's city.",
        "source": "T12n0321_003:0009c24_6"
    },
    {
        "source_sentence": "「爾時，發光天子以此八十俱胝童女賜於太子、王自宮中所有童女復賜一俱胝、王諸親眷亦以一俱胝童女奉上太子、宰輔重臣亦以一俱胝童女奉上太子、國城庶民亦以一俱胝童女奉上太子，",
        "translation": "“At the time, the goddess Vairocana gave these eighty corpuscles of girls to the crown prince and the other girls in the king’s palace were given one corpuscle. The king’s relatives and attendants also presented one corpuscle of girls to the prince as their head; the chancellor and senior ministers also presented one corpuscle of girls to the prince as their",
        "source": "T12n0321_003:0009c25_0"
    },
    {
        "source_sentence": "如是八十四俱胝童女俱令侍從承事及歌舞作樂悅樂太子。」",
        "translation": "Thus, these eighty-four corpuscles of young girls were all ordered to serve and serve the prince with music and joy, singing and dancing.",
        "source": "T12n0321_003:0009c29_1"
    },
    {
        "source_sentence": "佛告尊者護國言：「爾時，福光太子見是事已，於其國城、宮殿、樓閣、園林、池沼、象、馬、珍寶及諸童女、歌舞唱妓種種作樂之事，",
        "translation": "The Buddha said to the venerable protector of the kingdom, “At that time Prince Puṣkarasārin, seeing these things, performed various music for the sake of the city, its palace, its mansions, its parks, its ponds, its elephants, its horses, its treasures, its boys and girls, its songs, its dances, its singing, its music",
        "source": "T12n0321_003:0010a02_0"
    },
    {
        "source_sentence": "都不愛著。",
        "translation": "They don't even cling to it.",
        "source": "T12n0321_003:0010a04_1"
    },
    {
        "source_sentence": "而自思惟：『此諸女等於我身分為大惡友，斷我善根、增諸煩惱，常處輪迴，",
        "translation": "They think to themselves, ‘These women are great bad companions for me. They cut off my roots of goodness and increase the afflictions in me.",
        "source": "T12n0321_003:0010a05_0"
    },
    {
        "source_sentence": "無有自在，譬如有人處於禁縛終不能出。』",
        "translation": "There's no self-dependence, which is like a person who's bound and never able to escape.'",
        "source": "T12n0321_003:0010a06_1"
    },
    {
        "source_sentence": "爾時，太子見此過失，於十年中於色、聲、香、味、觸五塵諸境而不愛著，",
        "translation": "At that time, seeing these faults, the prince did not cling to form, sound, odor, taste, touch, or any of the objects in the ten directions.",
        "source": "T12n0321_003:0010a07_2"
    },
    {
        "source_sentence": "一心思惟：『諸惡友眾云何捨離，而自修行得其解脫？』",
        "translation": "With one thought, he thought, 'How can bad friends abandon and cultivate themselves to attain their liberation?'",
        "source": "T12n0321_003:0010a09_3"
    },
    {
        "source_sentence": "作是念已，彼諸童女即詣王宮白父王言：『其福光太子於諸婇女、戲樂、歌舞都不顧視，",
        "translation": "Having thought thus, the princes of the goddesses went to the palace and said to their fathers: Prince Puṣkarasārin, do not pay any attention whatsoever to courtesans, musicians, singers, and dancers.",
        "source": "T12n0321_003:0010a10_4"
    },
    {
        "source_sentence": "獨坐思惟，遠離聲色。』",
        "translation": "He sits alone and contemplates, being far removed from sound and form.'",
        "source": "T12n0321_003:0010a12_5"
    },
    {
        "source_sentence": "「爾時，發光天子聞是事已，心忽驚愕，怪未曾有。",
        "translation": "“At that time, the celestial Son of Refulgence, having heard these things, was suddenly startled in his heart and wondered at unprecedented wonders.",
        "source": "T12n0321_003:0010a13_0"
    },
    {
        "source_sentence": "即時統領八萬小王及諸臣從來入太子所住宮中，見彼太子孤處宮殿，儀貌寂然，",
        "translation": "He immediately led the eighty-thousand lesser kings and their ministers into the palace where the prince was staying. They saw that the prince was alone in the palace, with a peaceful demeanor.",
        "source": "T12n0321_003:0010a14_1"
    },
    {
        "source_sentence": "涕淚悲泣，心大苦惱，迷悶躄地，良久乃蘇。",
        "translation": "They wept in tears and cried in sorrow. Their hearts were greatly distressed and they lost consciousness, fell to the ground, and revived after a long time.",
        "source": "T12n0321_003:0010a16_0"
    },
    {
        "source_sentence": "「『子為最上寶，　　云何不觀我，",
        "translation": "Why don’t you look at me?",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　憂惱心惶亂？　　云何捨所愛，",
        "translation": "How can we abandon what we hold dear and become dispassionate to others?",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　種種富樂事？　　此城妙莊嚴，",
        "translation": "The city is beautifully adorned with various kinds of riches and deeds.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　眾寶為嚴飾，　　宮殿、妙樓閣、",
        "translation": "They are adorned with various jewels, With their palaces, beautiful towers, and pavilions.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　園林及浴池、　　象、馬、七珍財、",
        "translation": "Parks, forests, bathing ponds, elephants, horses, and the seven kinds of treasure.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　衣服及飲饌，　　如是無量數，",
        "translation": "Their clothes, food and drink are immeasurable in number like this.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　而以供給之。　　復有諸童女，",
        "translation": "And some of the other maidens offered them food and drink.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　容顏甚奇妙，　　端正廣莊嚴，",
        "translation": "His countenance was marvelous, graceful and extensively adorned.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　如彼天女相。　　心性善純直，",
        "translation": "It is like the mark of a heavenly maiden whose mind is good and pure by nature.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　通達諸伎藝、　　歌舞及音樂，",
        "translation": "They comprehend all arts and crafts, singing, dancing, and music.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　人間無有比。　　所為適悅汝，",
        "translation": "There is no comparison among the people of Jambudvīpa.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　令其心快樂。　　云何無所著，",
        "translation": "They cause their minds to be happy. How can they have no attachment?",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　於斯而捨離，　　獨處於深宮，",
        "translation": "At that point, he's abandoned it and is alone in a deep palace.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　顏貌甚寂澹？　　令諸童女等，",
        "translation": "Their countenance is so peaceful and calm that it causes the maidens to think,",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　各各懷憂惱，　　如彼蓮花萎，",
        "translation": "Each one harbors sorrow, Like that lotus flower withering.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　俱來而白我。　　太子汝當知：",
        "translation": "You should know, prince, that they all came and said to me,",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　如是諸童女，　　端正俱年少，",
        "translation": "Thus, these girls were both young and handsome.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　口出優鉢香、　　身有栴檀氣，",
        "translation": "His mouth emits the fragrance of heavenly almsbowl, And his body has the air of sandalwood.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　兩目紺如蓮，　　善知人心意，",
        "translation": "Their eyes are deep blue like lotus blossoms, Knowing well the minds and thoughts of people.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　令於晝夜中，　　親近作戲樂。",
        "translation": "He causes them to become intimate and playful during the day and night.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　今汝正是時，　　於此而厭棄。",
        "translation": "Now is the right time for you to abandon it.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　於汝意云何？　　為我速宣說。",
        "translation": "What do you think?",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　又向園林中，　　安置摩尼寶，",
        "translation": "Again, he went to the garden and forest And placed the jewel treasure in it.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　九十九百千，　　各廣一由旬，",
        "translation": "It is ninety-nine hundred thousand yojanas long and one yojanas wide.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　光明普照燿。　　寶樹懸寶幡，",
        "translation": "A ray of light shone everywhere, and jeweled trees hung with jeweled banners.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　其數有八萬，　　花菓皆茂盛。",
        "translation": "There were eighty thousand trees with plenty of flowers and fruit.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　具有眾飛鳥，　　孔雀及鵝、鴨、",
        "translation": "It contains flying birds, peacocks, geese, ducks, and turtles.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　迦陵、頻迦等，　　皆出微妙音。",
        "translation": "Kalinda and Bimbisāra all produced subtle sounds.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　復於諸樹間，　　各垂於寶索，",
        "translation": "Again, among the trees, Each is draped with a jeweled rope.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　一一寶索中，　　皆有妙樂器。",
        "translation": "Each jeweled rope contains a wonderful instrument of music.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　微風吹動時，　　出於妙音聲，",
        "translation": "When a gentle breeze blows, A subtle sound emerges:",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　清響如天樂，　　云何而不戀？",
        "translation": "The clear sound is like heavenly bliss, so why isn't it attached?",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　又此諸宮殿，　　皆以眾寶成，",
        "translation": "Furthermore, these palaces are all made of various treasures.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　金、銀、摩尼珠、　　硨磲與碼碯、",
        "translation": "gold, silver, maṇi-jewels, pearls and emeralds.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　瑠璃、真珠等，　　莊嚴甚微妙。",
        "translation": "The lapis lazuli, genuine pearls, and other such adornments are extremely subtle.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　於此寶殿中，　　安置金香爐，",
        "translation": "In this jeweled hall, he placed a golden censer.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　四面垂珠網，　　俱胝細妙衣，",
        "translation": "The four sides are draped with webs of jewels, With coarse fine and exquisite garments.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　以用莊嚴上。　　晝夜三時中，",
        "translation": "In the three seasons of the day and night it is decorated with ornaments.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　長爇栴檀香，　　如彼天帝宮、",
        "translation": "The fragrance of sandalwood grows like the heavenly emperor’s palace.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　善法堂無異。　　汝今不愛樂，",
        "translation": "The hall of the fine dharma is no different from it.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　違背於父母，　　都無孝敬心，",
        "translation": "They disobey their parents And have no sense of filial piety.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　令我增苦惱。』　　言已而悲泣：",
        "translation": "It will increase my suffering and distress.’ Having said this, he wept in sorrow:",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　『為我速宣說。』　　太子見所問，",
        "translation": "'Explain it for me quickly!' The prince saw what he was asked.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　稽首白父王：　　『世間五欲境，",
        "translation": "They bowed their heads and said to their father, 'The five objects of desire in the world are like this:",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　墜墮於眾生，　　纏縛於有情，",
        "translation": "They fall into sentient beings and are bound to sentient beings.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　增長大過失，　　永處於輪迴，",
        "translation": "They grow in great errors, Always remaining in the cycle of transmigration.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　無有得出離。　　我今求解脫，",
        "translation": "There is no deliverance for me. I now seek liberation.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　發大菩提心，　　遠離諸塵染。",
        "translation": "They give rise to the great aspiration for enlightenment, Being far removed from all worldly defilements.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　一切女人身，　　眾惡不淨本，",
        "translation": "All women’s bodies Are the root of all evil and impurity.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　我觀如怨家。　　貪、瞋鎮相隨，",
        "translation": "The self is like a house of enemies, accompanied by greed and hatred.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　流浪於生死，　　牽繫諸眾生，",
        "translation": "They wander in birth and death, Trading sentient beings.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　常處大嶮路。　　又此女色相，",
        "translation": "She always lived on a precipitous path in the great mountains.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　皮膚裹不淨，　　血、肉、與骨、髓、",
        "translation": "The skin is wrapped in impure blood, flesh, bone, marrow, and mucus.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　腸、胃、大、小便、　　眵、淚、洟、唾等，",
        "translation": "intestines, stomach, urine, excretion, stool, tears, mucus, spittle, saliva, and so forth.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　如是穢惡身，　　云何令愛樂？",
        "translation": "How can such a body that's defiled and bad like this cause craving?",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　譬如毒藥樹，　　開花眾所愛，",
        "translation": "It's like a tree of poisonous medicine that blooms like flowers and is loved by everyone.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　採花毒入身，　　不覺殞其命。",
        "translation": "They gathered flowers and poison into their bodies, but they didn't feel as if they were dying.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　國城與宮殿、　　音樂及歌舞，",
        "translation": "The kingdoms, cities, palaces, music, songs, and dances.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　究竟不堅牢，　　如夢、如幻化。",
        "translation": "They are ultimately not firm, Like dreams or illusions.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　亦如春樹木，　　滋茂葉芬芳，",
        "translation": "It’s also like spring trees, With luxuriant leaves and fragrant flowers.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　纔至冬月時，　　凋落悉枯悴；",
        "translation": "In the autumn months it withers and withers.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　女人及富饒，　　不久亦如是。",
        "translation": "So it will not be long before women and wealthy people are likewise.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　愚癡狂亂心，　　常沒貪欲海，",
        "translation": "Foolish and deluded minds, They always drown in the sea of craving.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　鬪諍起憎嫉，　　互相行殺害。",
        "translation": "They fight and give rise to hatred and jealousy, killing each other.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　父王及眷屬、　　妻子并男女，",
        "translation": "Their fathers, kings, their retinues, wives, men and women,",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　於彼惡趣中，　　誰能行救濟？",
        "translation": "Who can rescue those in the evil destinies?",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　菩薩大智人，　　身心常寂靜，",
        "translation": "Enlightening beings, great wise people, Always remain silent in body and mind.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　觀彼如草木，　　不動如須彌。",
        "translation": "Observing them like grass and trees, he doesn't move like a mountain.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　常樂處深山，　　一心求正道，",
        "translation": "Deep in the mountains of eternal bliss, singlemindedly seeking the right path.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　浮世不久住，　　如山水急流。",
        "translation": "The floating world won't live long, just like a mountain of water that flows quickly.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　人命若浮雲，　　須臾即散滅，",
        "translation": "Human life is like a floating cloud, Which instantly disappears.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　墜墮三有中，　　迷沒於生死。",
        "translation": "They'll fall into the three existences and be lost in birth-and-death.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　我不著愚迷，　　遠離於虛妄，",
        "translation": "I don’t cling to foolishness and delusion, am far removed from falsehood,",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　色、聲五欲塵，　　非是菩薩境。",
        "translation": "Form and sound, the five objects of desire, Are not the sphere of enlightening beings.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　福盡無福生、　　業盡復生業，",
        "translation": "When virtue is exhausted, no virtue arises; When action is exhausted, again action arises.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　如鳥禁籠中，　　長不得自在。",
        "translation": "It's like a bird in a cage that doesn't have freedom for a long time.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　六塵如毒蛇，　　損惱於眾生；",
        "translation": "The six dust motes are like poisonous snakes, harming sentient beings.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　四大不堅實，　　猶如空聚落。",
        "translation": "The four elements are not solid, Just like a village in the sky.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　父王今當知：　　速捨虛妄境，",
        "translation": "The father should now be known as the one who quickly relinquishes unreal objects.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　歸趣真解脫，　　常運妙法船，",
        "translation": "He returns to true liberation, Always carrying the wonderful ship of truth.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　度脫於三有。　　迷者令覺悟、",
        "translation": "He liberates beings from the three realms of existence and causes those who are lost to awaken.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　禁縛得解脫、　　患苦使獲安、",
        "translation": "Being bound to bondage, they attain liberation; Being afflicted by suffering, they attain peace.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　盲者與開目、　　貧窮賜珍財，",
        "translation": "The blind man opens his eyes and gives them to the poor, who are given valuable possessions.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　悉令離憂苦。　　復為眾有情，",
        "translation": "They cause all to be freed from sorrow and suffering.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　枯竭貪愛河、　　照燭黑暗路、",
        "translation": "Withered from the river of craving, Illumining the dark path of candlelight,",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　廣布於雲雷、　　降霔甘露雨、",
        "translation": "It spreads widely in clouds and thunder, sending down sweet rain of ambrosia.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　除熱得清涼，　　成就最上智。",
        "translation": "He removes fever and attains clarity and coolness, which accomplishes the supreme knowledge.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　父王今當知：　　何人懷慈忍，",
        "translation": "The father should now be known as the one who harbors kindness and tolerance.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　而欲作怨家？　　何人具智慧，",
        "translation": "Who possesses the wisdom to become a follower of enemies?",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　怖見佛、法、僧？　　何人有眼目，",
        "translation": "Who is afraid of seeing Buddha, Dharma, or Sangha?",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　入於嶮路行？　　何人得菩提，",
        "translation": "Who will attain enlightenment if he enters a dangerous path?",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　而欲作散亂？　　如斯有智人，",
        "translation": "Do you want to cause distraction?” Such a wise person",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　必不行邪道。　　我寧上須彌，",
        "translation": "I won’t follow wrong paths, so why would I go up to Mount Sumeru?",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　投身入大海，　　於此五欲塵，",
        "translation": "I'll throw myself into the ocean, and in these five objects of desire,",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　終不生染著。　　所有諸婇女、",
        "translation": "They do not give rise to defiled attachments.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　并及於眷屬，　　請王速將歸，",
        "translation": "He and his retinue invited the king to return home quickly.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　於此勿久住。　　在家多過失，",
        "translation": "Don’t stay here for long.” At home there are many faults.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　障蔽佛菩提。　　我捨於國城、",
        "translation": "They obstruct the Buddha’s enlightenment and prevent me from attaining it.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　及諸眷屬等，　　行詣於深山，",
        "translation": "and their retinues, etc., They traveled to the deep mountains.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "　　修習清淨行，　　志求無上道。』」",
        "translation": "They cultivate pure practices and aspire to the unsurpassed path.'",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "從地而起即說頌曰：爾時，佛告尊者護國言：「彼福光太子處於寶殿，",
        "translation": "At that moment, the Buddha spoke these verses: Then the Buddha said to the venerable Dharmagupta, “That prince Puṣkarasārin was staying in the jeweled pavilion.",
        "source": "T12n0321_003:0010a16_1"
    },
    {
        "source_sentence": "是諸童女圍繞侍從，太子觀之深生厭離，於三威儀中行、住、坐時，求斷一切煩惱。",
        "translation": "Surrounded and attended by these nymphs, the prince observed them deeply disgusted, and while walking, standing, and sitting in the three comportments, he sought to end all afflictions.",
        "source": "T12n0321_003:0011b03_2"
    },
    {
        "source_sentence": "於月初八日於地而坐，正意思惟離諸塵染。",
        "translation": "On the eighth day of the first month, he sat on the ground and correctly concentrated his thoughts on ridding himself of the defilement of dust.",
        "source": "T12n0321_003:0011b04_3"
    },
    {
        "source_sentence": "「作是觀已，於中夜時忽聞空中淨光天子讚佛、讚法及苾芻眾。",
        "translation": "“After observing this, he suddenly heard the god Śubhavyūha praising the Buddha, Dharma, and the monks in the sky during the middle of the night.",
        "source": "T12n0321_003:0011b05_4"
    },
    {
        "source_sentence": "「『虛空諸天大慈愍，　　發聲稱讚讚何人？",
        "translation": "'Who are the great compassionate gods of space who give voice to praise and praise?",
        "source": "T12n0321_003:0011b07_5"
    },
    {
        "source_sentence": "　　我要歸依求出離，　　願樂聽聞為開演。』",
        "translation": "I want to take refuge and seek escape, and I'd like to hear it for the sake of enlightenment.'",
        "source": "T12n0321_003:0011b07_5"
    },
    {
        "source_sentence": "如是聞已，身毛皆竪，悲喜交并，合掌向空以頌問曰：「爾時，淨光天子於虛空中聞彼所問，",
        "translation": "Having heard these words, the hair on his body stood on end and cried out in distress. He was overcome with grief and great joy. With joined palms he looked up into the sky and asked in verse:",
        "source": "T12n0321_003:0011b07_5"
    },
    {
        "source_sentence": "「『我今稱讚大沙門，　　彼佛名曰成義意，",
        "translation": "'Now that I praise the great ascetic, That buddha's name is Satyasiddhi manas.",
        "source": "T12n0321_003:0011b11_6"
    },
    {
        "source_sentence": "　　常以十善化群迷，　　救濟孤獨諸有苦。",
        "translation": "He always uses the ten kinds of goodness to dispel delusion and rescue the suffering of those who are orphaned and alone.",
        "source": "T12n0321_003:0011b11_6"
    },
    {
        "source_sentence": "　　方便、智慧最為上，　　功德、神力無有比，",
        "translation": "Their skillful means and wisdom are supreme, incomparable in virtue and power.",
        "source": "T12n0321_003:0011b11_6"
    },
    {
        "source_sentence": "　　常有十千那由他，　　苾芻之眾恒恭敬。』",
        "translation": "There are always 10,000 nayutas, and the monks always venerate them.'",
        "source": "T12n0321_003:0011b11_6"
    },
    {
        "source_sentence": "　　太子復問淨光天：　　『有何功德及相好？",
        "translation": "The prince again asked the Pure Light gods, 'What's the merit and features of the prince?'",
        "source": "T12n0321_003:0011b11_6"
    },
    {
        "source_sentence": "　　彼佛所行菩提行，　　重為宣說我樂聞。』",
        "translation": "That Buddha's enlightened practice of enlightenment that they carry out, I'd like to hear them again and again proclaim it.'",
        "source": "T12n0321_003:0011b11_6"
    },
    {
        "source_sentence": "而為太子說所讚事，以頌答曰：「爾時，淨光天子復為太子說佛功德、相好，",
        "translation": "He spoke to the prince in praise and replied in verse: At that time, the celestial being Pure Light again told the prince about the Buddha’s virtues and distinguishing characteristics.",
        "source": "T12n0321_003:0011b11_6"
    },
    {
        "source_sentence": "「『佛頂如須彌，　　出眾而高顯；",
        "translation": "The Buddha’s peak is like a polar mountain. He emerges from the congregation yet stands tall and lofty.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　螺髮而紺青，　　右旋俱齊整；",
        "translation": "The conch is dark blue, curled to the right and aligned.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　眉間白毫光，　　照燿如千日；",
        "translation": "Between his eyebrows was a ray of white hair shining like a thousand suns.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　目紺淨分明，　　猶如青蓮葉；",
        "translation": "His eyes were deep blue and pure, clearly shining like blue lotus leaves.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　頷臆如師子，　　脣色勝頻婆；",
        "translation": "Their jaws and hair are like the color of a lion’s beak; Their complexion is superior to that of white lotus.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　齒密無缺減，　　白類如珂雪；",
        "translation": "Their teeth are dense, not missing or diminishing, white like snow.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　臍輪廣右旋，　　如淨頗[王*梨]寶；",
        "translation": "The circumference of the navel is wide and curves to the right like pure crystal.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　舌色如紅蓮，　　廣長而薄淨，",
        "translation": "The color of the tongue is like a red lotus, Extensive and long, Thin and pure.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　舒展覆面輪，　　此相最微妙。",
        "translation": "It spreads out to cover the face and wheel, This characteristic is most subtle.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　梵音而清響，　　美妙出世間，",
        "translation": "The sound of Brahma is pure and clear, beautiful and transcendent.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　一切諸天人，　　聞者皆歡喜。",
        "translation": "All the gods and humans who heard it all rejoiced.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　假使百千樂，　　莫等佛音聲，",
        "translation": "Even if there were a hundred thousand pieces of music, They wouldn’t be equal to the Buddha’s voice.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　功德廣無邊，　　能斷眾生惑，",
        "translation": "Their virtues are boundless in extent, able to cut off the afflictions of sentient beings.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　令行菩提行。　　復次諸飛鳥，",
        "translation": "It causes them to practice the practice of enlightenment.” “Furthermore, flying birds:",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　名曰緊那囉、　　鴛鴦、俱枳羅、",
        "translation": "They are called kiṃnara,  mandarin duck, koṭhila, and kumbhāra.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　嚩哩呬拏、鵝、　　具沙、俱拏羅、",
        "translation": "Kauṇḍinya, Goose, sands, koṭala, and white lotus.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　迦陵、頻伽等，　　各有色相嚴；",
        "translation": "Kalinda and Bimbisāra are each endowed with form and characteristics.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　佛相好亦然。　　佛以一言辭，",
        "translation": "So it is with the marks and embellishments of buddhahood.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　隨眾各得解，　　近遠平等聞。",
        "translation": "Each of the members of the assembly, according to their understanding, Equally heard even from near and far.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　如來法自在，　　項頸長細妙，",
        "translation": "The Tathāgata is unimpeded in the teaching, With his neck and neck long and sleek.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　量等於身分；　　臂膊而傭圓，",
        "translation": "They are the same in size as their bodies, with arms and legs spreading out like a circle.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　垂手過於膝，　　如是妙端嚴，",
        "translation": "Hanging his hand over his knees, he’s thus beautifully adorned.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　七處皆平滿。　　雙肱如象鼻，",
        "translation": "The seven parts of the body are all even and full, with both shoulders like an elephant’s trunk.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　兩腨勝鹿王；　　陰相而藏隱，",
        "translation": "The deer king Duobao surpassed [Daosun’s], concealing himself in the form of a nymph.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　猶如龍馬王；　　身毛紺右旋，",
        "translation": "He was like the king of dragons and horses, his body hair curled in a dark blue circle to the right.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　無畏如師子；　　佛頂如天蓋，",
        "translation": "Fearless like a lion, the Buddha’s head is like a heavenly canopy.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　嚴飾金色身；　　行步同牛王，",
        "translation": "His golden-colored body was beautifully adorned, and he walked like a king of bulls.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　足現千輻輪，　　莎悉帝迦相，",
        "translation": "His feet show a thousand-spoked wheel with the characteristics of a kṣatriya.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　如是廣端嚴，　　世間甚希有。",
        "translation": "Such a vast array of adornments is rare in the world.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　汝今若親近，　　有德與無德、",
        "translation": "If you now become intimate with the virtuous and the virtuless,",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　有福及無福，　　一一自當知。",
        "translation": "You should know one by one whether there’s merit or no merit.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　若有稱佛名，　　讚毀俱不著，",
        "translation": "If there is anyone who calls the Buddha’s name, They will neither praise nor disparage him.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　如蓮在水中，　　淤泥不可染。",
        "translation": "It's like a lotus in water that can't be stained by mud.",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "　　我佛大導師，　　世間無有上。』」",
        "translation": "I, the great guide of buddhas, have no equal in the world.'",
        "source": "T12n0321_003:0011b19_7"
    },
    {
        "source_sentence": "以頌答曰：佛說護國尊者所問大乘經卷第三",
        "translation": "\\",
        "source": "T12n0321_003:0011b19_7"
    }
]