[
    {
        "source_sentence": "佛說須摩提菩薩經(按《開元錄》，須摩提經亦直云須摩經)西晉三藏竺法護譯聞如是：一時佛在羅閱祇靈鳥頂山中，",
        "translation": "The Buddha taught the Sumati Bodhisattva Sutra (according to the Kaiyuan lu, the Sumati jing also simply called the Suma scripture) translated by the Western Jin Tripitaka Master Zhu Fahou. Thus heard:",
        "source": "T12n0334_001:0076b03_0"
    },
    {
        "source_sentence": "與大比丘眾千二百五十人，菩薩萬人俱。",
        "translation": "He was accompanied by one thousand two hundred and fifty bhikṣus and ten thousand bodhisattvas.",
        "source": "T12n0334_001:0076b06_1"
    },
    {
        "source_sentence": "爾時羅閱城大國，有長者號曰郁迦，郁迦有女，名須摩提，厥年八歲，",
        "translation": "At that time in the great kingdom of Rājagṛha there was an elder named Ugra. There was a woman named Sumati in Ugra, eight years old.",
        "source": "T12n0334_001:0076b07_2"
    },
    {
        "source_sentence": "歷世奉敬過去無數百千諸佛，積累功德不可稱計。",
        "translation": "Throughout the ages they honored innumerable hundreds of thousands of past buddhas and accumulated immeasurable merit.",
        "source": "T12n0334_001:0076b09_3"
    },
    {
        "source_sentence": "時須摩提從羅閱祇大國出詣靈鳥山，行到佛所，前以頭面稽首佛足，禮畢却住一面，",
        "translation": "At that time Sumati came out of the great country of Rājagṛha and went to the mountain of the spiritual birds. On arriving at the place where the Buddha was, he bowed his forehead at his feet [and] after venerating him, he withdrew and remained off to one side.",
        "source": "T12n0334_001:0076b10_4"
    },
    {
        "source_sentence": "叉手白佛言：「願欲有所問，唯佛以善權方便，解說我之所疑。」",
        "translation": "He saluted the Buddha with his palms together and said, I want to ask a question, but the Buddha is the only one who uses skillful means to explain my doubts.",
        "source": "T12n0334_001:0076b12_5"
    },
    {
        "source_sentence": "時佛默然，即知女意。",
        "translation": "The Buddha remained silent, knowing the woman’s thoughts.",
        "source": "T12n0334_001:0076b14_0"
    },
    {
        "source_sentence": "佛語須摩提：「恣所欲問，如來今當為汝具解說之，事事分別，令汝歡喜。」",
        "translation": "The Buddha said to Sumati, As long as you want to ask questions, the Tathāgata will now explain them fully for you, distinguishing and discerning things so that you'll rejoice.",
        "source": "T12n0334_001:0076b14_1"
    },
    {
        "source_sentence": "須摩提問佛言：「菩薩云何所生處，人見之常歡喜？",
        "translation": "Sumati asked the Buddha, Where do bodhisattvas are born that people always rejoice when they see them?",
        "source": "T12n0334_001:0076b16_2"
    },
    {
        "source_sentence": "云何得大富有常多財寶？",
        "translation": "How do you attain great wealth and always abundant possessions?",
        "source": "T12n0334_001:0076b17_3"
    },
    {
        "source_sentence": "云何不為他人之所別離？",
        "translation": "How is it not separated by others?",
        "source": "T12n0334_001:0076b17_4"
    },
    {
        "source_sentence": "云何不在母人腹中，常得化生千葉蓮華中立法王前？",
        "translation": "How is it that they aren't in their mother's womb, always being transformed and born in front of the Dharma king in a thousand-petaled lotus flower?",
        "source": "T12n0334_001:0076b18_5"
    },
    {
        "source_sentence": "云何得神足，從不可計億剎土，去到彼間禮諸佛？",
        "translation": "How did he attain miraculous abilities and go from incalculable millions of buddha-lands to the other directions to venerate the buddhas?",
        "source": "T12n0334_001:0076b19_6"
    },
    {
        "source_sentence": "云何得無讎怨、無侵嫉者？",
        "translation": "How can we attain the absence of anger and enmity and the absence of hostility?",
        "source": "T12n0334_001:0076b20_7"
    },
    {
        "source_sentence": "云何所說聞者信從踊躍受行？",
        "translation": "How does it say that the hearer believes, follows, and jumps up and down?",
        "source": "T12n0334_001:0076b21_8"
    },
    {
        "source_sentence": "云何得無殃罪，所作善行無能壞者？",
        "translation": "How can they attain blamelessness, and the good actions they perform can't be destroyed?",
        "source": "T12n0334_001:0076b22_9"
    },
    {
        "source_sentence": "云何魔不能得其便？",
        "translation": "How could Māra not get an advantage over them?",
        "source": "T12n0334_001:0076b23_0"
    },
    {
        "source_sentence": "云何臨壽終時佛在前立，為說經法，即令不墮苦痛之處？",
        "translation": "How did the Buddha stand before him at the time of his death, explaining the sūtras and teachings so that they won't fall into painful places?",
        "source": "T12n0334_001:0076b23_1"
    },
    {
        "source_sentence": "所問如是。」",
        "translation": "The question asked is like this.",
        "source": "T12n0334_001:0076b24_2"
    },
    {
        "source_sentence": "是時佛語須摩提：「如汝所問如來義者，善哉大快乃如是乎。",
        "translation": "The Buddha then said to Sumati, As you asked about the Tathāgata's meaning, that's how good and greatly pleasant it is.",
        "source": "T12n0334_001:0076b25_3"
    },
    {
        "source_sentence": "汝若欲聞，諦聽諦受，勤思念之，吾當解說。」",
        "translation": "If you want to hear it, listen closely and accept it, and diligently contemplate it, I'll explain it.",
        "source": "T12n0334_001:0076b26_4"
    },
    {
        "source_sentence": "時女即言：「甚善世尊！",
        "translation": "The woman then said, Very good, Bhagavān!",
        "source": "T12n0334_001:0076b27_5"
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "I'd like to hear it.",
        "source": "T12n0334_001:0076b28_0"
    },
    {
        "source_sentence": "於是須摩提受教而聽。",
        "translation": "Thereupon, Sumati accepted the teaching and listened.",
        "source": "T12n0334_001:0076b28_1"
    },
    {
        "source_sentence": "佛言：「菩薩有四事法，人見之皆歡喜。",
        "translation": "The Buddha said, There are four things that bodhisattvas have, and when people see them, they'll all rejoice.",
        "source": "T12n0334_001:0076b28_2"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T12n0334_001:0076b29_3"
    },
    {
        "source_sentence": "一者瞋恚不起，視冤家如善知識；",
        "translation": "The first is the principle of not being angry and not getting angry, regarding enemies as good friends.",
        "source": "T12n0334_001:0076b29_4"
    },
    {
        "source_sentence": "二者常有慈心向於一切；",
        "translation": "The second is that they always have a compassionate mind directed toward all.",
        "source": "T12n0334_001:0076c01_5"
    },
    {
        "source_sentence": "三者常行求索無上要法；",
        "translation": "The third is that they always practice seeking the supreme essentials.",
        "source": "T12n0334_001:0076c02_6"
    },
    {
        "source_sentence": "四者作佛形像；",
        "translation": "The fourth is to make buddha images.",
        "source": "T12n0334_001:0076c02_7"
    },
    {
        "source_sentence": "是為四法。",
        "translation": "These are the four dharmas.",
        "source": "T12n0334_001:0076c03_8"
    },
    {
        "source_sentence": "菩薩用是四事故，人見之常歡喜。」",
        "translation": "When a bodhisattva uses these four things, people will always rejoice when they see them.",
        "source": "T12n0334_001:0076c03_9"
    },
    {
        "source_sentence": "「不起恚毀本根，　　常行慈得要法，",
        "translation": "Don’t disparage your original faculties, Always practice kindness to attain the essential teachings.",
        "source": "T12n0334_001:0076c04_10"
    },
    {
        "source_sentence": "　作佛象身好潔，　　心歡喜人喜見。」",
        "translation": "He makes the Buddha's elephant body beautiful and pure, and his heart rejoices when people joyfully see it.",
        "source": "T12n0334_001:0076c04_10"
    },
    {
        "source_sentence": "佛於是說偈言：佛語須摩提：「菩薩復有四事法，得大富有。",
        "translation": "The Buddha then spoke this verse, saying, The Buddha said to Sumati, Again, there are four things that make a bodhisattva greatly wealthy.",
        "source": "T12n0334_001:0076c04_10"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T12n0334_001:0076c07_11"
    },
    {
        "source_sentence": "一者布施以時，二者與已倍悅，三者與後不復悔，四者既與不求其報；",
        "translation": "The first is the principle of giving at the proper time. The second is to be double delighted with what they have given. The third is not to regret giving it later. The fourth is not to seek rewards after giving it.",
        "source": "T12n0334_001:0076c08_12"
    },
    {
        "source_sentence": "是為四法。",
        "translation": "These are the four dharmas.",
        "source": "T12n0334_001:0076c09_13"
    },
    {
        "source_sentence": "菩薩用是四事故，得大富有常多財寶。」",
        "translation": "Because of these four things, the bodhisattva attains great wealth and always has a lot of possessions.",
        "source": "T12n0334_001:0076c10_0"
    },
    {
        "source_sentence": "「以時施無悔心，　　喜悅與無希望，",
        "translation": "Giving at the right time without regret, with joy and joy and hopelessness,",
        "source": "T12n0334_001:0076c10_1"
    },
    {
        "source_sentence": "　所作施有勇慧，　　所在處常大富。」",
        "translation": "The generosity they give has courage and wisdom, and wherever they are, they'll always be greatly wealthy.",
        "source": "T12n0334_001:0076c10_1"
    },
    {
        "source_sentence": "佛於是說偈言：佛語須摩提：「菩薩復有四事法，不為他人之所別離。",
        "translation": "The Buddha then spoke a verse, saying, The Buddha said to Sumati, Again, there are four things that bodhisattvas do that they won't be separated by others.",
        "source": "T12n0334_001:0076c10_1"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T12n0334_001:0076c15_2"
    },
    {
        "source_sentence": "一者不傳惡說鬪亂彼此，二者導愚癡者使入佛道，三者若有毀敗正法護使不絕，",
        "translation": "One, they do not transmit evil speech and fight against each other. Two, they lead those who are deluded into the path of enlightenment. Three, if they disparage the true-dharma, they protect others without ceasing.",
        "source": "T12n0334_001:0076c15_3"
    },
    {
        "source_sentence": "四者勸勉諸人教使求佛令堅不動；",
        "translation": "The fourth is to encourage others to seek enlightenment and make them firm and unshakable.",
        "source": "T12n0334_001:0076c17_4"
    },
    {
        "source_sentence": "是為四法。",
        "translation": "These are the four dharmas.",
        "source": "T12n0334_001:0076c18_5"
    },
    {
        "source_sentence": "菩薩用是四事故，不為他人所別離。」",
        "translation": "A bodhisattva uses these four things without being separated by others.",
        "source": "T12n0334_001:0076c18_6"
    },
    {
        "source_sentence": "「不傳說鬪彼此，　　道愚冥護正法，",
        "translation": "They do not talk of fighting one against the other, And they are ignorant and ignorant in their belief In order to protect the true Dharma.",
        "source": "T12n0334_001:0076c19_7"
    },
    {
        "source_sentence": "　勸進人使求佛，　　終無能別離者。」",
        "translation": "Encouraging someone to seek the Buddha, there's never anyone who can be separated from him.",
        "source": "T12n0334_001:0076c19_7"
    },
    {
        "source_sentence": "佛於是說偈言：佛語須摩提：「菩薩復有四事法，得化生千葉蓮華中立法王前。",
        "translation": "The Buddha then spoke a verse, saying, The Buddha said to Sumati, Again, there are four things that bodhisattvas do to be born transformed in front of the Dharma king in the thousand-petaled lotus flower.",
        "source": "T12n0334_001:0076c19_7"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T12n0334_001:0076c23_8"
    },
    {
        "source_sentence": "一者細擣紅蓮華、青蓮華、黃蓮華、白蓮華，合此四種末之如塵，使滿軟妙華，",
        "translation": "The first is a collection of fine, coarse red lotus blossoms, blue lotus blossoms, yellow lotus blossoms, white lotus blossoms, and mixed with these four kinds of powder like dust to make them fill up with soft, exquisite flowers.",
        "source": "T12n0334_001:0076c23_9"
    },
    {
        "source_sentence": "持是供養世尊若塔及舍利；",
        "translation": "They preserve this as an offering to the World-honored One, whether it is a stupa or a relic.",
        "source": "T12n0334_001:0076c25_10"
    },
    {
        "source_sentence": "二者不令他人起恚意；",
        "translation": "The second is to not cause others to give rise to malicious thoughts.",
        "source": "T12n0334_001:0076c26_11"
    },
    {
        "source_sentence": "三者作佛形像使坐蓮華上；",
        "translation": "The third is to make images of buddhas and cause them to sit on lotus blossoms.",
        "source": "T12n0334_001:0076c26_12"
    },
    {
        "source_sentence": "四者得最正覺便歡喜住；",
        "translation": "The fourth is the abode of joy when one attains supreme awakening.",
        "source": "T12n0334_001:0076c27_13"
    },
    {
        "source_sentence": "是為四法。",
        "translation": "These are the four dharmas.",
        "source": "T12n0334_001:0076c27_14"
    },
    {
        "source_sentence": "菩薩用是四事故，常得化生千葉蓮華中立法王前。」",
        "translation": "Because of these four things, the bodhisattva always attains transformation and is born in front of the Dharma king with a thousand-petaled lotus flower.",
        "source": "T12n0334_001:0076c28_15"
    },
    {
        "source_sentence": "「施四華滿軟妙，　　除恚恨受法義，",
        "translation": "Giving four flowers full of softness and subtlety, removes anger and resentment and receives the meaning of the teaching",
        "source": "T12n0334_001:0076c29_16"
    },
    {
        "source_sentence": "　得上覺立佛前，　　作形像生花中。」",
        "translation": "Attaining superior awakening, he stands in front of the Buddha and creates an image that grows in a flower.",
        "source": "T12n0334_001:0076c29_16"
    },
    {
        "source_sentence": "佛於是說偈言：佛語須摩提：「菩薩復有四事法，得神足，從一佛國復至一佛國。",
        "translation": "The Buddha then spoke a verse, saying, The Buddha said to Sumati, Again, there are four things that bodhisattvas do when they attain miraculous abilities and go from one Buddha-land to another Buddha-land.",
        "source": "T12n0334_001:0076c29_16"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T12n0334_001:0077a04_17"
    },
    {
        "source_sentence": "一者見人作功德不行斷絕；",
        "translation": "The first is that they are not cut off by seeing people’s virtuous deeds and their inactions.",
        "source": "T12n0334_001:0077a04_18"
    },
    {
        "source_sentence": "二者見人說法而不中止；",
        "translation": "The second is that they see others expounding the Teaching without stopping it.",
        "source": "T12n0334_001:0077a05_19"
    },
    {
        "source_sentence": "三者常然燈火於塔寺中；",
        "translation": "The third was that the lamp always burned brightly in a tower or monastery.",
        "source": "T12n0334_001:0077a05_20"
    },
    {
        "source_sentence": "四者求三昧；",
        "translation": "The fourth is seeking concentration.",
        "source": "T12n0334_001:0077a06_21"
    },
    {
        "source_sentence": "是為四法。",
        "translation": "These are the four dharmas.",
        "source": "T12n0334_001:0077a06_22"
    },
    {
        "source_sentence": "菩薩用是四事故，得神足，從一佛國至一佛國。」",
        "translation": "Because of these four things, the bodhisattva attained miraculous abilities and traveled from one Buddha's land to another Buddha's land.",
        "source": "T12n0334_001:0077a07_0"
    },
    {
        "source_sentence": "「行功德為法施，　　聞經說不中止，",
        "translation": "“The practice of virtue is giving the Dharma, and listening to the teachings of the sutras doesn’t stop.",
        "source": "T12n0334_001:0077a08_1"
    },
    {
        "source_sentence": "　常然燈於佛寺，　　入三昧遍諸國。」",
        "translation": "He always stayed at the Buddha's temple, entered samādhi, and pervaded all the countries.",
        "source": "T12n0334_001:0077a08_1"
    },
    {
        "source_sentence": "佛於是說偈言：佛語須摩提：「菩薩復有四事法，得無讎冤、無侵嫉者。",
        "translation": "The Buddha then spoke this verse, saying, The Buddha said to Sumati, Again, there are four things that bodhisattvas do that attain the absence of anger and enmity and the absence of hostility.",
        "source": "T12n0334_001:0077a08_1"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T12n0334_001:0077a12_2"
    },
    {
        "source_sentence": "一者於善知識無諛諂心，二者不慳貪妬他人物，三者見人布施助其喜。",
        "translation": "One, they don't have a flattering mind toward good friends, two, aren't stingy and greedy with other people, and three, are joyful when they see someone who gives alms to help them.",
        "source": "T12n0334_001:0077a12_3"
    },
    {
        "source_sentence": "四者見菩薩諸所作為不行誹謗；",
        "translation": "The fourth is that they see all the deeds of enlightening beings and do not slander them.",
        "source": "T12n0334_001:0077a14_4"
    },
    {
        "source_sentence": "是為四法。",
        "translation": "These are the four dharmas.",
        "source": "T12n0334_001:0077a14_5"
    },
    {
        "source_sentence": "菩薩用是四事故，常行是行，得無讎冤、無侵嫉者。」",
        "translation": "A bodhisattva who uses these four things and always conducts himself in this way will attain the absence of anger and enmity and the absence of hostility.",
        "source": "T12n0334_001:0077a15_6"
    },
    {
        "source_sentence": "「於善友無諛諂，　　不慳惜他人物，",
        "translation": "“Regarding spiritual benefactors, they are neither flattering nor deceitful, And do not be stingy with others.",
        "source": "T12n0334_001:0077a16_7"
    },
    {
        "source_sentence": "　見人施助其喜，　　行菩薩無讎冤。」",
        "translation": "Seeing someone's generosity helps them rejoice, and practicing bodhisattvas have no anger or enmity.",
        "source": "T12n0334_001:0077a16_7"
    },
    {
        "source_sentence": "佛於是說偈言：佛語須摩提：「菩薩復有四事法，其所語言，聞者信從踊躍受行。",
        "translation": "The Buddha then spoke a verse, saying, The Buddha said to Sumati, Again, there are four things that bodhisattvas do, and those who hear what they say believe and follow them, leaping and dancing and accepting it.",
        "source": "T12n0334_001:0077a16_7"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T12n0334_001:0077a20_8"
    },
    {
        "source_sentence": "一者口之所說心亦無異，二者於善知識常有至誠，三者聞人說法心不是非，",
        "translation": "The first is that their minds are not different from what they say in words. The second is always sincere toward spiritual benefactors. The third is neither right nor wrong when they hear the Dharma taught by others.",
        "source": "T12n0334_001:0077a20_9"
    },
    {
        "source_sentence": "四者若見他人請令說法不求其短；",
        "translation": "The fourth is that if they see others and ask them to expound the Teaching, they do not seek their shortcomings.",
        "source": "T12n0334_001:0077a22_10"
    },
    {
        "source_sentence": "是為四法。",
        "translation": "These are the four dharmas.",
        "source": "T12n0334_001:0077a23_11"
    },
    {
        "source_sentence": "菩薩用是四事故，其所語言，聞者信從踊躍受行。」",
        "translation": "Because of these four things, the bodhisattva uses what he teaches, and those who hear it believe and follow it with joy.",
        "source": "T12n0334_001:0077a23_12"
    },
    {
        "source_sentence": "「如所念言亦爾，　　於善友有至誠，",
        "translation": "“So it is with what’s thought and words, With utmost sincerity toward good friends.",
        "source": "T12n0334_001:0077a24_13"
    },
    {
        "source_sentence": "　聞講法不求短，　　若說經心喜踊。」",
        "translation": "He hears the teaching and doesn't seek shortness, but his mind is joyous when he teaches the sūtras.",
        "source": "T12n0334_001:0077a24_13"
    },
    {
        "source_sentence": "佛於是說偈言：佛語須摩提：「菩薩復有四事法，得無殃罪，所作善行疾得淨住。",
        "translation": "The Buddha then spoke a verse, saying, The Buddha said to Sumati, Again, there are four things that bodhisattvas do that attain blamelessness and quickly attain pure abiding based on good actions.",
        "source": "T12n0334_001:0077a24_13"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T12n0334_001:0077a29_14"
    },
    {
        "source_sentence": "一者心意所念常志於善，二者常持戒三昧智慧，三者初發菩薩意便起一切智多所度脫，",
        "translation": "The first is to always be mindful of what is good in thought and thought; the second is to always observe morality, absorption, concentration, and wisdom; and the third is to give rise to omniscience at the first sign of enlightenment.",
        "source": "T12n0334_001:0077a29_15"
    },
    {
        "source_sentence": "四者常有大慈愍於一切；",
        "translation": "The fourth is that they always have great compassion for all.",
        "source": "T12n0334_001:0077b02_16"
    },
    {
        "source_sentence": "是為四法。",
        "translation": "These are the four dharmas.",
        "source": "T12n0334_001:0077b03_17"
    },
    {
        "source_sentence": "菩薩用是四事故，得無殃罪疾得淨住。」",
        "translation": "Because of these four things, the bodhisattva attains a pure abode with no blameworthy sins.",
        "source": "T12n0334_001:0077b03_18"
    },
    {
        "source_sentence": "「常志善念廣度，　　戒等定不離慧，",
        "translation": "“Always mindful of the extensive liberation of goodness and mindfulness, such concentrations as morality don’t part from wisdom.",
        "source": "T12n0334_001:0077b04_19"
    },
    {
        "source_sentence": "　當教人一切智，　　行慈意得淨住。」",
        "translation": "You should teach people all kinds of cognition and practice the mind of kindness to attain a pure abode.",
        "source": "T12n0334_001:0077b04_19"
    },
    {
        "source_sentence": "佛於是說偈言：佛語須摩提：「菩薩復有四事法，魔不能得其便。",
        "translation": "The Buddha then spoke a verse, saying, The Buddha said to Sumati, Again, there are four things that the bodhisattva does that Māra can't get an advantage over.",
        "source": "T12n0334_001:0077b04_19"
    },
    {
        "source_sentence": "何者為四？",
        "translation": "What are these four?",
        "source": "T12n0334_001:0077b08_20"
    },
    {
        "source_sentence": "一者常念於佛，二者常精進，三者常念經法，四者常立功德；",
        "translation": "They are (1) always mindful of the Buddha; (2) always energetic; (3) always mindful of scriptures and doctrines; (4) always establishing virtue.",
        "source": "T12n0334_001:0077b08_21"
    },
    {
        "source_sentence": "是為四法。",
        "translation": "These are the four dharmas.",
        "source": "T12n0334_001:0077b09_22"
    },
    {
        "source_sentence": "菩薩用是四事故，魔不能得其便。」",
        "translation": "Because of these four things, the bodhisattva couldn't get an advantage over Māra.",
        "source": "T12n0334_001:0077b09_23"
    },
    {
        "source_sentence": "「常淨意念於佛，　　志精進在深法，",
        "translation": "“Always mindful of the Buddha with pure intentions, Always concentrating on the profound teaching With determination and effort,",
        "source": "T12n0334_001:0077b10_24"
    },
    {
        "source_sentence": "　自勗勉立功德，　　魔用是不得便。」",
        "translation": "Self-inflicted effort establishes merit, but Māra won't get an advantage over it.",
        "source": "T12n0334_001:0077b10_24"
    },
    {
        "source_sentence": "佛於是說偈言：佛語須摩提：「菩薩復有四事法，臨壽終時，佛在前立為說經法，",
        "translation": "Then the Buddha spoke these verses: The Buddha said to Sumati, Again, there are four things that a bodhisattva must do. At the end of his life, the Buddha stands before him and teaches the Dharma of the scriptures.",
        "source": "T12n0334_001:0077b10_24"
    },
    {
        "source_sentence": "令其不墮苦痛之處。",
        "translation": "It causes them not to fall into the place of pain and suffering.",
        "source": "T12n0334_001:0077b15_25"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T12n0334_001:0077b15_26"
    },
    {
        "source_sentence": "一者為一切人故，具滿諸願；",
        "translation": "The first is the fulfillment of all vows for the sake of all people.",
        "source": "T12n0334_001:0077b16_27"
    },
    {
        "source_sentence": "二者若人布施諸不足者念欲足之；",
        "translation": "The second is that if someone’s generosity is insufficient, he or she will be mindful to satisfy his or her desire.",
        "source": "T12n0334_001:0077b16_28"
    },
    {
        "source_sentence": "三者見人雜施若有短少便裨助之；",
        "translation": "The third is that when one sees people’s donations mixed up, if there are any shortcomings, he or she will assist them.",
        "source": "T12n0334_001:0077b17_29"
    },
    {
        "source_sentence": "四者常念供養於三寶；",
        "translation": "The fourth is always mindful of the offerings to the Three Treasures.",
        "source": "T12n0334_001:0077b18_30"
    },
    {
        "source_sentence": "是為四法。",
        "translation": "These are the four dharmas.",
        "source": "T12n0334_001:0077b18_31"
    },
    {
        "source_sentence": "菩薩用是四事故，臨壽終時即見諸佛，皆在前立為說經法，不令其人墮苦痛處。」",
        "translation": "When a bodhisattva uses these four things, he'll see the buddhas at the end of his life and establish them in front of him to explain the sūtras and teachings so that they won't fall into painful places.",
        "source": "T12n0334_001:0077b19_32"
    },
    {
        "source_sentence": "「為一切滿所願，　　無極哀勸足檀，",
        "translation": "For the sake of fulfilling all their wishes, they are infinitely compassionate and sufficiently encouraged.",
        "source": "T12n0334_001:0077b21_0"
    },
    {
        "source_sentence": "　以雜施致黠慧，　　供三寶得致佛。」",
        "translation": "By combining generosity with wisdom, they'll make offerings to the Three Treasures and attain Buddhahood.",
        "source": "T12n0334_001:0077b21_0"
    },
    {
        "source_sentence": "佛於是說偈言：爾時須摩提白佛言：「唯世尊！",
        "translation": "The Buddha then spoke a verse, saying, At that point, Sumeru said to the Buddha, Bhagavān!",
        "source": "T12n0334_001:0077b21_0"
    },
    {
        "source_sentence": "所說四十事，我當奉行令不缺減，悉使具足不違一事；",
        "translation": "I will practice these forty things, so as not to neglect them. I will enable them all to be fulfilled without diminishing even one thing.",
        "source": "T12n0334_001:0077b24_1"
    },
    {
        "source_sentence": "若失一義，我為斷佛劫法減眾弟子。」",
        "translation": "If you lose one thing, I'll cut off the Buddha's eon of teaching and reduce the number of disciples.",
        "source": "T12n0334_001:0077b25_2"
    },
    {
        "source_sentence": "是時大目揵連在大會中坐，即問須摩提：「此四十事，大士所行菩薩所為甚亦難，",
        "translation": "At that moment, while Mahāmaudgalyāyana was seated in the great assembly, he asked Samantabhadra: These forty things are very difficult and difficult for bodhisattvas to do, sir.",
        "source": "T12n0334_001:0077b26_3"
    },
    {
        "source_sentence": "當如汝小女何能辦之？」",
        "translation": "How can you, like your little daughter, do it?",
        "source": "T12n0334_001:0077b28_4"
    },
    {
        "source_sentence": "時須摩提答目連言：「假令我今審實能行此四十事者，三千大千國土皆當為我六反震動，",
        "translation": "Samantabhadra then answered Maudgalyāyana, saying: If I were to do these forty deeds with certainty now, the 3,000 great chiliocosms would quake six times for me.",
        "source": "T12n0334_001:0077b29_5"
    },
    {
        "source_sentence": "雨於天華，諸音樂器不鼓自鳴。」",
        "translation": "It rains on the heavenly flowers, and the musical instruments don't drum or sound themselves.",
        "source": "T12n0334_001:0077c02_6"
    },
    {
        "source_sentence": "須摩提適發是言，應時三千大千國土六反震動，即雨天華，樂器皆鳴。",
        "translation": "When Sumati spoke these words, 3,000 great one-thousand lands shook in six ways, and it rained heavenly flowers and music instruments all sounded.",
        "source": "T12n0334_001:0077c03_0"
    },
    {
        "source_sentence": "女語目連：「是則證明我之至誠，若有未來起菩薩意者亦當如是。",
        "translation": "The woman said to Maudgalyāyana, This is proof of my sincerity, and so will anyone who gives rise to the bodhisattva's intention in the future.",
        "source": "T12n0334_001:0077c04_1"
    },
    {
        "source_sentence": "我後不久亦當如如來、無所著、等正覺。",
        "translation": "Soon after me, I will also become like the Tathāgata, free from attachment and fully awakened.",
        "source": "T12n0334_001:0077c06_2"
    },
    {
        "source_sentence": "信如我言無有虛者，其在眾會皆當一等悉作金色。」",
        "translation": "Believe as I say, there's nothing false; they'll all become one equally golden when they're in the assembly.",
        "source": "T12n0334_001:0077c07_0"
    },
    {
        "source_sentence": "尋如所語輒作金色。",
        "translation": "They look as they say and quickly become golden-colored.",
        "source": "T12n0334_001:0077c08_1"
    },
    {
        "source_sentence": "於是目連即從坐起，整衣服，下右膝，叉手為佛稽首作禮，前白佛言：「今諸一切初發大意為菩薩者，",
        "translation": "Then Maudgalyāyana rose from his seat, straightened his clothes, knelt on his right knee, saluted the Buddha by joining his palms together, and bowed his head in respect.",
        "source": "T12n0334_001:0077c08_2"
    },
    {
        "source_sentence": "我當自歸為之作禮。",
        "translation": "I will pay homage to him for my own sake.",
        "source": "T12n0334_001:0077c10_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0334_001:0077c11_4"
    },
    {
        "source_sentence": "八歲女子感應如此，豈況高士摩訶薩乎？」",
        "translation": "Eight-year-old women are like this, so why wouldn't they be like the noble ones and mahāsattvas?",
        "source": "T12n0334_001:0077c11_5"
    },
    {
        "source_sentence": "是時座中有大菩薩，名文殊師利，謂須摩提言：「於何法住，所現感應乃如是乎？」",
        "translation": "At the time, there was a great bodhisattva named Mañjuśrī in his throne who said to Sumati, What's the way to live and what's the response that's being shown?",
        "source": "T12n0334_001:0077c12_6"
    },
    {
        "source_sentence": "須摩提答言：「諸法不可計數亦無所住，而仁問我住於何法？",
        "translation": "Sumati replied, All dharmas can't be counted and there's nothing to abide in, but what dharmas do you ask me to abide in?",
        "source": "T12n0334_001:0077c14_7"
    },
    {
        "source_sentence": "仁作是問，不如不問。」",
        "translation": "You're asking this question, so why don't you ask it?",
        "source": "T12n0334_001:0077c15_8"
    },
    {
        "source_sentence": "文殊師利問須摩提言：「此語言何乃致斯乎？」",
        "translation": "Mañjuśrī asked Somati, What's the reason for this statement?",
        "source": "T12n0334_001:0077c16_9"
    },
    {
        "source_sentence": "須摩提報文殊師利言：「不於諸法有所住，亦無所疑，亦不言是非。」",
        "translation": "Samantabhadra replied to Mañjuśrī, They don't abide in anything about dharmas, have no doubts, and don't say right or wrong.",
        "source": "T12n0334_001:0077c17_10"
    },
    {
        "source_sentence": "文殊師利問須摩提言：「如來本不作行乎？」",
        "translation": "Mañjuśrī asked Somati, Didn't the Tathāgata do this in the past?",
        "source": "T12n0334_001:0077c18_11"
    },
    {
        "source_sentence": "須摩提報言：「譬如月影現於水中，若夢野馬深山之響，如來本行亦如是也。」",
        "translation": "Sumati replied, It's like when the moon's shadow appears in water and if he dreams of the sound of a wild horse deep in the mountains, so is the Tathāgata's original practice.",
        "source": "T12n0334_001:0077c19_12"
    },
    {
        "source_sentence": "文殊師利問須摩提：「如仁所說，合會是事為能得佛不？」",
        "translation": "Mañjuśrī asked Somati, As you've said, is this thing that unites to attain Buddhahood?",
        "source": "T12n0334_001:0077c21_13"
    },
    {
        "source_sentence": "須摩提報言：「云何仁者謂癡黠行三事異乎？",
        "translation": "Sumati replied, What do you say, sir, that the three things of delusion and intelligence are different from each other?",
        "source": "T12n0334_001:0077c22_14"
    },
    {
        "source_sentence": "不為異也，一切諸法皆合。",
        "translation": "It's not different, because all dharmas are united.",
        "source": "T12n0334_001:0077c23_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0334_001:0077c24_16"
    },
    {
        "source_sentence": "若正法若不正法，適無所住亦無所取，亦無所放，空無有色。」",
        "translation": "Whether it's right teaching or wrong teaching, there's nothing to abide in, nothing to grasp, nothing to release, and formless emptiness without form.",
        "source": "T12n0334_001:0077c24_17"
    },
    {
        "source_sentence": "文殊師利復問須摩提：「解是義者為有幾人？」",
        "translation": "Mañjuśrī again asked Somati, How many people understand this meaning?",
        "source": "T12n0334_001:0077c25_18"
    },
    {
        "source_sentence": "須摩提報言：「夫作幻者恣意所化寧有限無？",
        "translation": "Sumati replied, Suppose someone creates an illusion that's freely transformed, but isn't it limited?",
        "source": "T12n0334_001:0077c26_19"
    },
    {
        "source_sentence": "幻師所化猶尚無限，信解此法亦如是也。」",
        "translation": "The illusionist's teaching is still infinite, and so is the faith that understands this teaching.",
        "source": "T12n0334_001:0077c27_20"
    },
    {
        "source_sentence": "文殊師利問須摩提言：「如我無化無幻，起行何法而與道合？」",
        "translation": "Mañjuśrī asked Somati, Suppose I have no transformation and no illusion, what is the method of initiating practice that's consistent with the path?",
        "source": "T12n0334_001:0077c28_21"
    },
    {
        "source_sentence": "須摩提報言：「如仁所說致為大快，一切法處亦不有，亦不不有，至於如來無合無散。」",
        "translation": "Sumati replied, As you've explained so well, it's greatly pleasant that all the places of dharmas don't exist or don't exist, and as for the Tathāgata, there's neither unity nor dispersal.",
        "source": "T12n0334_001:0078a01_22"
    },
    {
        "source_sentence": "文殊師利聞彼所說甚悅讚善，文殊師利白佛言：「甚善須摩提所說微妙，",
        "translation": "When Mañjuśrī heard this discourse, he was delighted and praised it. Then Mañjuśrī said to the Buddha:",
        "source": "T12n0334_001:0078a03_23"
    },
    {
        "source_sentence": "大可怪也，乃能深入逮得法忍，發意已來為幾何乎？」",
        "translation": "It's really marvelous that he's been able to enter deeply into the tolerance of the Dharma, and what's the amount since he arouses his mind?",
        "source": "T12n0334_001:0078a04_24"
    },
    {
        "source_sentence": "佛語文殊師利：「是須摩提發無上平等度意等住已來，積不可計，先仁之前三十億劫，",
        "translation": "The Buddha said to Mañjuśrī, This is the incalculable accumulation of the thirty koṭis of kalpas that have passed since the time when Sumati aroused the mind of unexcelled equanimity and liberation.",
        "source": "T12n0334_001:0078a06_25"
    },
    {
        "source_sentence": "仁乃於彼發無上正等度意，適甫乃入無所從生法忍，是仁本造發意時師。」",
        "translation": "Ren then arouses the intention for unsurpassed correct and perfect enlightenment in them, and when he enters it, he enters into the tolerance of the Dharma that arises from nothing, which is the teacher who originally created the intention to arouse it.",
        "source": "T12n0334_001:0078a08_26"
    },
    {
        "source_sentence": "文殊師利聞佛所說則前作禮，白須摩提言：「唯別久遠今乃講侍，與師相見得受法誨。」",
        "translation": "When Mañjuśrī heard what the Buddha taught, he paid homage in front of him and said to Sumati, It's been a long time since we've parted, but now we've seen each other and received the teaching.",
        "source": "T12n0334_001:0078a09_27"
    },
    {
        "source_sentence": "須摩提報言：「莫作是念。",
        "translation": "Sumati replied, Don't think that way.",
        "source": "T12n0334_001:0078a11_28"
    },
    {
        "source_sentence": "用何等故？",
        "translation": "What's the reason for this?",
        "source": "T12n0334_001:0078a12_29"
    },
    {
        "source_sentence": "無所從生法忍，亦無所念亦無有師。」",
        "translation": "There's no tolerance of the Dharma that arises from anything, nothing to think about, and no teacher.",
        "source": "T12n0334_001:0078a12_30"
    },
    {
        "source_sentence": "文殊師利問言：「云何不轉女人身？」",
        "translation": "Mañjuśrī asked, Why doesn't the woman's body change?",
        "source": "T12n0334_001:0078a13_31"
    },
    {
        "source_sentence": "須摩提報言：「於是無所得。",
        "translation": "Sumati replied, So there's nothing to be gained.",
        "source": "T12n0334_001:0078a14_32"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0334_001:0078a14_33"
    },
    {
        "source_sentence": "法無男無女，今者我當斷仁所疑。」",
        "translation": "The Dharma has no men and no women, so now I will cut off the doubts of kindness.",
        "source": "T12n0334_001:0078a15_34"
    },
    {
        "source_sentence": "文殊師利言：「善哉！",
        "translation": "Mañjuśrī said, Good!",
        "source": "T12n0334_001:0078a15_35"
    },
    {
        "source_sentence": "樂欲聞之。」",
        "translation": "I'm happy to hear it.",
        "source": "T12n0334_001:0078a16_36"
    },
    {
        "source_sentence": "須摩提謂文殊師利言：「如今我後亦當逮如來、無所著、等正覺、成慧行、安定、世間父、無上士、道法御、天人師、佛、天中天，",
        "translation": "Samantabhadra said to Mañjuśrī, “From now on I will also acquire the Tathāgata, who is free from attachment, fully awakened, accomplishes the practice of wisdom, is well established as the father of all beings in the world, has no superior qualities, is a teacher of gods and humans, is a buddha among gods, and belongs to the",
        "source": "T12n0334_001:0078a16_37"
    },
    {
        "source_sentence": "如是審諦，我今便當變為男子。」",
        "translation": "If you examine it this way, I'll now become a man.",
        "source": "T12n0334_001:0078a19_38"
    },
    {
        "source_sentence": "適作是語，便成男子，頭髮即墮袈裟著身，便為沙彌。",
        "translation": "When he said these words, he became a man, and his hair fell off, his robes fell on his body, and he became a novice.",
        "source": "T12n0334_001:0078a19_39"
    },
    {
        "source_sentence": "須摩提復謂文殊師利言：「審我來世當作佛時，使我國中莫有三事。",
        "translation": "Again, Sumati said to Mañjuśrī, Suppose you judge that when I become a buddha in the future, there won't be three things in my country.",
        "source": "T12n0334_001:0078a21_40"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T12n0334_001:0078a22_41"
    },
    {
        "source_sentence": "一者魔事，二者地獄，三者女人態。",
        "translation": "One is demonic deeds, two are hells, and three are women.",
        "source": "T12n0334_001:0078a22_42"
    },
    {
        "source_sentence": "若我至誠，我身當如年三十沙門。」",
        "translation": "If I were to be sincere, my body would be like a monk at the age of 30.",
        "source": "T12n0334_001:0078a23_43"
    },
    {
        "source_sentence": "時須摩提，適作是語，形體顏色如年三十。",
        "translation": "At the time, Sumati said this, his body and appearance were as old as thirty years old.",
        "source": "T12n0334_001:0078a24_44"
    },
    {
        "source_sentence": "時須摩提謂文殊師利言：「我作佛時，令我國人皆作金色，城郭及地周匝七寶，",
        "translation": "Samantabhadra then said to Mañjuśrī: When I become a buddha, all the people of my country will be golden-colored. The city walls and everything around them will be made of the seven kinds of treasure.",
        "source": "T12n0334_001:0078a25_45"
    },
    {
        "source_sentence": "有七寶樹令八種行，七寶池水四邊中外皆生七寶雜色蓮華及諸雜寶，不多不少皆悉停等。」",
        "translation": "There are seven-jeweled trees that cause eight kinds of practice, and the four sides of the seven-jeweled pond and water all give rise to seven-jeweled lotus blossoms and other mixed treasures at the four sides, not many or few, and they all stop.",
        "source": "T12n0334_001:0078a27_46"
    },
    {
        "source_sentence": "須摩提言：「如仁之國，我之剎土亦當如是。",
        "translation": "Sumati said, Just as in the land of kindness, so will my buddha-land be likewise.",
        "source": "T12n0334_001:0078a29_47"
    },
    {
        "source_sentence": "如我至誠者，今在會者當作金色。」",
        "translation": "If I'm sincere, now that I'm here at the assembly, I'll make it golden.",
        "source": "T12n0334_001:0078b01_48"
    },
    {
        "source_sentence": "適作是語，應時眾座皆作金色。",
        "translation": "When he spoke these words, all the seats in the assembly at that time became golden-colored.",
        "source": "T12n0334_001:0078b02_0"
    },
    {
        "source_sentence": "時持地神即從地出，化作天身舉聲稱揚，歎須摩提，三言：「摩訶須摩提菩薩摩訶薩得作佛時，",
        "translation": "The earth-holding spirits then emerged from the earth, transformed themselves into celestial bodies, raised their voices, and praised Sumati, saying three words, When the bodhisattva Mahā Sumati attained buddhahood,",
        "source": "T12n0334_001:0078b02_1"
    },
    {
        "source_sentence": "國土所有七寶池水樹及華實，皆當如是。」",
        "translation": "All the seven-jeweled ponds, waters, trees, and flowers in the land will be like this.",
        "source": "T12n0334_001:0078b04_2"
    },
    {
        "source_sentence": "於是佛謂文殊師利：「是須摩提菩薩摩訶薩不久當得佛，號寶德合吉祥如來、無所著、等正覺、成慧行、安定、世間父、無上士、道法御、天人師、佛、天中天。」",
        "translation": "The Buddha then said to Mañjuśrī, Soon, this is the Sumeru Bodhisattva Mahāsattva who will soon attain buddhahood and be called the Auspicious Tathāgata of Jeweled Virtue, Arhatless, Completely Awakened, Perfectly Enlightened, Practice of Wisdom, stabilizer, father of the world, unsurpassed",
        "source": "T12n0334_001:0078b05_3"
    },
    {
        "source_sentence": "佛說是經、授須摩提莂時，三十億人發無上平等度意者，皆得立不退轉；",
        "translation": "When the Buddha taught this scripture and entrusted it to Samantabhadra, thirty billion people aroused the thought of unexcelled equanimity and liberation, all attaining nonregression in their establishment.",
        "source": "T12n0334_001:0078b09_4"
    },
    {
        "source_sentence": "六萬天子悉得諸法法眼生。",
        "translation": "Sixty thousand celestial beings will all attain the eye of the Dharma of all dharmas.",
        "source": "T12n0334_001:0078b10_5"
    },
    {
        "source_sentence": "座中有五百菩薩，聞文殊師利所言甚深，意用不解中欲墮落，見須摩提所說真誠尋皆有應，",
        "translation": "There were five hundred bodhisattvas in the assembly seated there. Having heard these profound words of Mañjuśrī, they did not understand their meaning and wished to fall into the midst of them.",
        "source": "T12n0334_001:0078b11_6"
    },
    {
        "source_sentence": "即解身衣以用上佛，亦不諛諂無所希望，持是功德用自堅固，於無上平等度意，",
        "translation": "He immediately dismounted from his body and clothes to use them for the supreme buddha, did not flatter or flatter others, had no hope of gaining any rewards, was self-stereified in maintaining these virtues, and disciplined his mind with unsurpassed equanimity.",
        "source": "T12n0334_001:0078b13_7"
    },
    {
        "source_sentence": "即得住不退轉地，超九十劫，不復生死。",
        "translation": "He'll then attain the stage of abiding in nonretrogression, which transcends ninety eons and doesn't return to birth and death again.",
        "source": "T12n0334_001:0078b15_8"
    },
    {
        "source_sentence": "時佛授與五百人決：「却後十劫，劫名無塵垢，佛號固受如來、無所著、等正覺，",
        "translation": "The Buddha then gave the five hundred people a ruling, saying, Ten eons from now, when the eon is called Undefiled, the Buddha's name will be firmly accepted as the Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T12n0334_001:0078b16_9"
    },
    {
        "source_sentence": "是五百人等當生彼國，國名焰氣，當同一劫俱得作佛，皆同一字，號莊飾預知人意如來、無所著、等正覺。」",
        "translation": "These five hundred people will be born in that country, which is called the land of blazing energy, and they'll all become buddhas in the same eon, all with the same name as the Tathāgata, Arhat, Perfectly Enlightened One who adorns and knows the minds of others.",
        "source": "T12n0334_001:0078b18_10"
    },
    {
        "source_sentence": "佛謂文殊師利：「乃如是經多所饒益，如是不乎？",
        "translation": "The Buddha said to Mañjuśrī, Isn't it true that such a sūtra often benefits people?",
        "source": "T12n0334_001:0078b20_11"
    },
    {
        "source_sentence": "若今最後有菩薩摩訶薩及沙門，若善男子善女人等，求菩薩道奉行六度無極，",
        "translation": "“Furthermore, if there are any bodhisattva mahāsattvas and renunciants of the world today, good men and good women, who seek the path of enlightenment and practice the six transcendent ways without limit,",
        "source": "T12n0334_001:0078b21_12"
    },
    {
        "source_sentence": "未曉善權方便，不如書持是經諷誦讀轉，復教人常念其中事，諸欲聞者廣為解說。」",
        "translation": "Those who don't know the skillful means of good authority shouldn't write, retain this sūtra, recite it, and recite it; they should also teach others to always think about it, and those who want to hear it should explain it in detail for them.",
        "source": "T12n0334_001:0078b23_13"
    },
    {
        "source_sentence": "佛復語文殊師利：「前所不聞、本所不行如是輩菩薩者當念習持。",
        "translation": "Again, the Buddha said to Mañjuśrī, Such a group of bodhisattvas who haven't heard it before and haven't practiced it in the past should remember and cultivate it.",
        "source": "T12n0334_001:0078b25_14"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0334_001:0078b26_15"
    },
    {
        "source_sentence": "譬如轉輪聖王治於世間，當時至竟七寶不為缺減，其王壽終七寶為散。",
        "translation": "It's like when a wheel-turning sage king rules the world, seven treasures don't lack when he reaches their end and seven treasures are scattered when his king's life ends.",
        "source": "T12n0334_001:0078b27_16"
    },
    {
        "source_sentence": "如是文殊師利！",
        "translation": "Thus, Mañjuśrī!",
        "source": "T12n0334_001:0078b28_17"
    },
    {
        "source_sentence": "若佛經道住於世間者，佛七覺意終不為滅；",
        "translation": "If the Buddha’s doctrine of scriptures and path were to abide in the world, the seven kinds of awakening of enlightenment of buddhas would never cease.",
        "source": "T12n0334_001:0078b29_18"
    },
    {
        "source_sentence": "若佛法滅，覺意諸法皆為之盡。」",
        "translation": "If the Buddha's teaching ceases, all the dharmas of awakening and mind are exhausted for him.",
        "source": "T12n0334_001:0078c01_19"
    },
    {
        "source_sentence": "佛謂文殊師利：「當求無數方便，具索諸經勤學書持，為他人說教授一切，",
        "translation": "The Buddha said to Mañjuśrī, You should seek innumerable skillful means by requesting that all the scriptures be diligently studied and preserved, and teach them to others.",
        "source": "T12n0334_001:0078c01_20"
    },
    {
        "source_sentence": "廣解其義常當精進。",
        "translation": "Understanding its meaning in detail, they should always make effort.",
        "source": "T12n0334_001:0078c03_21"
    },
    {
        "source_sentence": "是為法教，若善男子善女人欲求道者，莫中有悔。」",
        "translation": "This is the teaching of the Dharma, and if good men and good women want to pursue the path, don't have regrets.",
        "source": "T12n0334_001:0078c04_0"
    },
    {
        "source_sentence": "佛說經已，須摩提菩薩、文殊師利菩薩、大目揵連等，諸天及人，其在會者阿修羅、揵沓和、持世者，",
        "translation": "After the Buddha had taught the sutra, the bodhisattvas Sumeru Bodhisattva, Mañjuśrī Bodhisattva, Mahāmaudgalyāyana Bodhisattva, and Mahāmaudgalyāyana Bodhisattva were present in the assembly.",
        "source": "T12n0334_001:0078c05_1"
    },
    {
        "source_sentence": "皆歡喜樂聞。",
        "translation": "They all rejoiced and listened joyfully.",
        "source": "T12n0334_001:0078c07_2"
    },
    {
        "source_sentence": "佛說須摩提菩薩經",
        "translation": "Sutra of Samantabhadra Bodhisattva Spoken by Buddha",
        "source": "T12n0334_001:0078c08_0"
    }
]