[
    {
        "source_sentence": "拔一切業障根本得生淨土神呪",
        "translation": "Dhāraṇī that removes all karmic hindrances and fundamentally produces the Pure Land",
        "source": "T12n0368_001:0351c03_0"
    },
    {
        "source_sentence": "(出小無量壽經)",
        "translation": "(from the Sutra of Lesser Immeasurable Life)",
        "source": "T12n0368_001:0351c04_0"
    },
    {
        "source_sentence": "劉宋天竺三藏求那跋陀羅",
        "translation": "Liu Song, the Tripiṭaka of Tianzhus, Guanabhadra",
        "source": "T12n0368_001:0351c06_0"
    },
    {
        "source_sentence": "奉　詔重譯",
        "translation": "Due to the imperial edict, he translated it again",
        "source": "T12n0368_001:0351c07_0"
    },
    {
        "source_sentence": "南無阿彌多婆夜哆(多曷切)(一)　他伽哆(都餓切)(二)　夜哆地(途賣切)(三)　夜他阿彌利(上聲)(四)　都婆毘(五)　阿彌利哆(六)　悉眈婆毘(七)　阿彌利哆(八)　毘迦蘭諦(九)　阿彌利哆(十)　毘迦蘭哆(十一)　伽彌膩(十二)　伽伽那(十三)　枳多迦隷(十四)　莎婆訶(十五)若有善男子善女人能誦此呪者，",
        "translation": "南無阿彌多婆夜哆(多切)(一)他伽哆(都餓切)(二) 夜哆地(途賣切)(三) 夜他阿彌利利(上聲)(四) 都婆毘(五) 阿彌利哆(六) 悉婆婆毘(七) 阿彌利哆(八) 毘迦蘭諦(",
        "source": "T12n0368_001:0351c08_0"
    },
    {
        "source_sentence": "阿彌陀佛常住其頂，日夜擁護，無令怨家而得其便，現世常得安隱，臨命終時任運往生。",
        "translation": "Amitâbha Buddha always stayed on top of him, protected him day and night, didn't allow enemies to get an advantage over him, and always attained peace in the present life when he died, so he was able to be reborn at his death.",
        "source": "T12n0368_001:0351c13_1"
    },
    {
        "source_sentence": "◎◎阿彌陀經不思議神力傳(附隋錄，未詳作者)：昔長安僧叡法師、慧崇、僧顯、慧通，",
        "translation": "Amitâbha Sutra: Inconceivable Biography of the Inconceivable Spiritual Powers ( appended to the Sui Record, not authored in detail): Formerly, Dharma Master Senghui of Chang'an, Hui Chong, Sengxian, and Huitong of Chang'an,",
        "source": "T12n0368_001:0351c15_2"
    },
    {
        "source_sentence": "近至後周實禪師、景禪師、西河鸞法師等數百餘人，並生西方。",
        "translation": "Recently more than several hundred people, including the Latter Zhouzhi Chan masters, Jing Chan masters, and Xihe Luan Fashi, were all born in the West.",
        "source": "T12n0368_001:0351c17_3"
    },
    {
        "source_sentence": "西河綽禪師等，因見鸞法師得生淨土，各率有緣，專修淨土之業；",
        "translation": "When they saw Masters such as Seon Master Nixihe and others attain rebirth in the Pure Land, each had an opportunity to do so. They all concentrated on cultivating the practice of the Pure Land.",
        "source": "T12n0368_001:0351c19_4"
    },
    {
        "source_sentence": "綽師又撰西方記驗，名《安樂集》流行。",
        "translation": "Master Dao also compiled other records in the West called the Anhui ji, which circulated widely.",
        "source": "T12n0368_001:0351c20_5"
    },
    {
        "source_sentence": "又晉朝遠法師，入盧山三十年不出，乃命同志白黑有一百二十三人，立誓期於西方，",
        "translation": "Also, the Master Yuan of the court of the Jin dynasty entered the Lu mountains for thirty years without leaving them. He ordered his comrades, white and black, with one hundred and twenty-three members, to make a vow to stay in the West.",
        "source": "T12n0368_001:0351c21_6"
    },
    {
        "source_sentence": "鑿山銘願。",
        "translation": "He excavated the mountain inscription and vowed.",
        "source": "T12n0368_001:0351c23_7"
    },
    {
        "source_sentence": "至陳天嘉年，盧山珍禪師，於坐時見有數百餘人，共乘七寶華舫往西方，",
        "translation": "In the tenth year of Tianjia in the Chen dynasty, when the Chan Master Lu Shanzhen was seated, he saw that more than several hundred people were traveling to the west on a seven-jeweled lotus flower boat.",
        "source": "T12n0368_001:0351c23_8"
    },
    {
        "source_sentence": "珍禪師遂求附載。",
        "translation": "Chan Master Zhen then asked him to append it.",
        "source": "T12n0368_001:0351c25_9"
    },
    {
        "source_sentence": "其船上人報云：「法師雖講得《涅槃經》，亦大不可思議緣，法師未誦得《阿彌陀經》及呪，",
        "translation": "The captain of the boat reported, “Even though you have taught us the Mahaparinirvana Sutra, it is also a great inconceivable condition for the Master not to recite it.",
        "source": "T12n0368_001:0351c25_10"
    },
    {
        "source_sentence": "所以不得同去。」",
        "translation": "That's why they can't go together.",
        "source": "T12n0368_001:0351c27_11"
    },
    {
        "source_sentence": "法師遂廢講業，日夜專誦《彌陀經》及呪，計應滿二萬遍。",
        "translation": "The Master then abandoned his lectures and devoted himself day and night to recitation of the Mahāmaudgalyāyana sūtras and dhāraṇīs, twenty thousand times in all.",
        "source": "T12n0368_001:0351c28_0"
    },
    {
        "source_sentence": "未終四七日前，夜向四更，有神人從西方送一白銀臺來空中，明過於日，",
        "translation": "Before the fourth or seventh day was over, as the night approached the fourth watch of the night, a divine being came from the west and sent up a white silver dais in the sky. The light exceeded the sun.",
        "source": "T12n0368_001:0351c29_1"
    },
    {
        "source_sentence": "告云：「法師壽終，當乘此臺往生阿彌陀國，故來相示，令知定生。」",
        "translation": "He told them, At the end of his life, the teacher of the Dharma will ride this dais to rebirth in the kingdom of Amitâbha, so he'll show it to them and let them know that he's born in meditation.",
        "source": "T12n0368_001:0352a01_2"
    },
    {
        "source_sentence": "終時白黑咸聞，空中如奏音樂，并聞異香，數月聞香氣不歇。",
        "translation": "At the end of the night everyone, both white and black, could hear it. Music was heard in the air as if they were playing music, and also a strange fragrance was smelled; and for several months the odor remained unceasing.",
        "source": "T12n0368_001:0352a03_3"
    },
    {
        "source_sentence": "其夜峯頂寺僧眾，咸見一谷內有數十炬火大如車輪。",
        "translation": "That night the monks and nuns of Fengding Monastery all saw that within a valley there were several tens of torches as big as a chariot wheel, burning brightly.",
        "source": "T12n0368_001:0352a04_4"
    },
    {
        "source_sentence": "尋驗古今，得生安樂世界者非一，多見化佛徒眾來迎靈瑞，如傳廣明，",
        "translation": "From ancient times up to the present, those who had been born in the world of peace and happiness were not all the same. Many magical buddhas and disciples came to greet spiritual manifestations as described in detail in the biographies.",
        "source": "T12n0368_001:0352a05_5"
    },
    {
        "source_sentence": "不可繁錄。",
        "translation": "It can't be recorded in detail.",
        "source": "T12n0368_001:0352a07_6"
    },
    {
        "source_sentence": "因珍禪師於此經有驗，故略述此一條以悟來哲，助成往生之志。",
        "translation": "Because Chan Master Jianzhen had testimony about this sūtra, he briefly described this one section in order to awaken the philosophers who came and help them fulfill their aspirations for rebirth.",
        "source": "T12n0368_001:0352a07_7"
    },
    {
        "source_sentence": "拔一切業障根本得生淨土神呪者，乃宋元嘉末年，求那跋陀重奉制譯，",
        "translation": "The divine spell for pulling out all the karmic hindrances and fundamentally attaining rebirth in the Pure Land was translated into Chinese by Guṇabhadra in the last year of the Yuanjia era (4.\\",
        "source": "T12n0368_001:0352a09_8"
    },
    {
        "source_sentence": "合計五十九字，一十五句。",
        "translation": "Altogether fifty-nine syllables are one and fifteen syllables.",
        "source": "T12n0368_001:0352a10_9"
    },
    {
        "source_sentence": "龍樹菩薩願生安養，夢感此咒。",
        "translation": "Nāgârjuna Bodhisattva wished to be born in peace and had a dream in which he sensed this spell.",
        "source": "T12n0368_001:0352a11_10"
    },
    {
        "source_sentence": "耶舍三藏誦此呪，天平寺銹法師從耶舍三藏口受此呪，其人云：「經本外國不來，",
        "translation": "When the Tripiṭaka of Yaśas recited this dhāraṇī, the Master Prabhūtaratna of Tianping Monastery accepted it from the mouth of the Tripiṭaka of Yaśas. The monk said, “The scripture does not come from a foreign country.",
        "source": "T12n0368_001:0352a12_11"
    },
    {
        "source_sentence": "若欲受持呪法，嚼楊枝、澡豆，漱口、然香，於佛像前胡跪合掌，日夜六時各誦三七遍，",
        "translation": "If he wishes to receive the dhāraṇī, he chews on poplar branches and soaking beans, rinses his mouth with a gentle fragrance, and puts his palms together in front of the Buddha’s image. He recites it three or seven times at six o’clock every day.",
        "source": "T12n0368_001:0352a14_12"
    },
    {
        "source_sentence": "即滅四重、五逆、十惡、謗方等罪，悉得滅除。",
        "translation": "He immediately extinguishes the four grave sins, five heinous crimes, ten bad sins, and so forth, and he'll be completely extinguished.",
        "source": "T12n0368_001:0352a16_0"
    },
    {
        "source_sentence": "現世所求皆得，不為惡鬼神所惑亂。",
        "translation": "Whatever they seek in the present life, they'll attain it without being disturbed by bad spirits or ghosts.",
        "source": "T12n0368_001:0352a16_1"
    },
    {
        "source_sentence": "若數滿二十萬遍，即感得菩提牙生，若至三十萬遍即面見阿彌陀佛。」",
        "translation": "If he recites it 20,000 times, the tooth of enlightenment will arise, and if he recites it 300,000 times, he'll see Amitâbha Buddha on his face.",
        "source": "T12n0368_001:0352a17_2"
    }
]