[
    {
        "source_sentence": "菩薩處胎經卷第七",
        "translation": "Bodhisattva's Place in the Womb Sutra, Volume 7",
        "source": "T12n0384_007:1048b12_0"
    },
    {
        "source_sentence": "姚秦涼州沙門竺佛念譯",
        "translation": "Yaoqin Liangzhou shaman Zhu Fonian's translation",
        "source": "T12n0384_007:1048b14_0"
    },
    {
        "source_sentence": "◎破邪見品第二十六",
        "translation": "Chapter 26: Refuting Wrong Views",
        "source": "T12n0384_007:1048b15_0"
    },
    {
        "source_sentence": "爾時，世尊入正定三昧，分身變化放大光明——欲令菩薩摩訶薩及四部眾，",
        "translation": "At the time, the Bhagavān entered right concentration and samādhi, transformed his body into a great radiance of light-to cause the bodhisattvas, mahāsattvas, and the fourfold assembly to",
        "source": "T12n0384_007:1048b16_0"
    },
    {
        "source_sentence": "比丘、比丘尼、優婆塞、優婆夷，破魔境界住於正地——告諸會者：「吾念過去九十一劫，",
        "translation": "Monks, bhikṣuṇīs, laymen, laymen, and laywomen who have destroyed the realm of Māra and are staying in the right place - tell the assembly members, “I am thinking of the past ninety-one world ages:",
        "source": "T12n0384_007:1048b17_1"
    },
    {
        "source_sentence": "在清明城北雪山南界，師宗五千人山中苦行。",
        "translation": "In the southern boundary of the Snow Mountains to the north of the city of Qingming, he practiced austerities in the midst of a group of five thousand people from his school.",
        "source": "T12n0384_007:1048b19_2"
    },
    {
        "source_sentence": "我於彼眾最小弟子，諷誦經典、算數、技術，天文、地理靡不綜練。",
        "translation": "Among the youngest of those disciples, I recited scriptures, calculations, and skills in astronomy and geography.",
        "source": "T12n0384_007:1048b20_3"
    },
    {
        "source_sentence": "彼眾常法，其有弟子所學已成當報師恩。",
        "translation": "If there are disciples who have completed what they've studied, they'll repay the teacher's kindness.",
        "source": "T12n0384_007:1048b21_4"
    },
    {
        "source_sentence": "時我一己亦無財物寶貨可奉上師，即跪拜謝欲下山人中乞索。",
        "translation": "At the time, I didn't have any possessions or treasures to present to the superior teacher, so I knelt down to pay my respects and begged for them among the people who wanted to go down the mountain.",
        "source": "T12n0384_007:1048b22_5"
    },
    {
        "source_sentence": "師不見聽。",
        "translation": "The teacher didn't see or hear it.",
        "source": "T12n0384_007:1048b24_6"
    },
    {
        "source_sentence": "如是再三求哀乞索，師復不聽。",
        "translation": "He repeatedly begged and begged, but the teacher wouldn't listen.",
        "source": "T12n0384_007:1048b24_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1048b25_8"
    },
    {
        "source_sentence": "以我明曉經典眾中最勝。",
        "translation": "It's because I clearly understand that I'm the best among the sūtras.",
        "source": "T12n0384_007:1048b25_9"
    },
    {
        "source_sentence": "師告我言：『吾有祕要寶藏經典，卿未諷誦。",
        "translation": "The teacher told me, 'I have a secret treasure-store scripture that you haven't recited.",
        "source": "T12n0384_007:1048b26_10"
    },
    {
        "source_sentence": "何為捨吾人間乞求？』",
        "translation": "Why would you abandon our people and beg for them?'",
        "source": "T12n0384_007:1048b27_11"
    },
    {
        "source_sentence": "爾時師即以祕要一句五百言，使我諷誦。",
        "translation": "The teacher then instructed me to recite the five hundred words of the esoteric phrase with my recitation.",
        "source": "T12n0384_007:1048b27_12"
    },
    {
        "source_sentence": "未經數日誦習已訖，即前白師：『見聽下山乞求，欲報師恩。』",
        "translation": "After a few days had passed since he had finished reciting it, he went before the master and said, 'I've heard you go down the mountain begging to repay your teacher's kindness.'",
        "source": "T12n0384_007:1048b28_13"
    },
    {
        "source_sentence": "師復不聽而告我言：『汝當學問祕讖文書，日、月、星、辰災怪禍福山移地動，",
        "translation": "Without listening, he said to me: You should study the secret texts of the esoteric scriptures. When the sun, moon, stars, and other celestial bodies are involved in calamities such as disasters, miracles, and misfortunes, the mountain of blessedness moves and the earth shakes.",
        "source": "T12n0384_007:1048b29_14"
    },
    {
        "source_sentence": "汝亦未知。",
        "translation": "You don't know either.",
        "source": "T12n0384_007:1048c02_15"
    },
    {
        "source_sentence": "何為欲捨我人間乞求？』",
        "translation": "Why do you want to abandon us and beg for them?'",
        "source": "T12n0384_007:1048c02_16"
    },
    {
        "source_sentence": "復更出經一句千言，勅教我誦讀。",
        "translation": "Again, he produced a thousand words of the sūtras and instructed me to recite them.",
        "source": "T12n0384_007:1048c03_17"
    },
    {
        "source_sentence": "又未經幾日復得成就，白師求乞欲報師恩，師復不聽。",
        "translation": "Before a few days had passed, he was again accomplished and asked the master to beg in order to repay his kindness, but the master would not allow him to do so.",
        "source": "T12n0384_007:1048c03_18"
    },
    {
        "source_sentence": "『吾更有經一句萬言，經中眾寶，卿亦未誦讀。",
        "translation": "'There's another phrase in the sūtra that says ten thousand words, and there are many treasures in the sūtras that you haven't recited or read.",
        "source": "T12n0384_007:1048c05_19"
    },
    {
        "source_sentence": "何由欲捨吾乞求？』",
        "translation": "Why do you want to abandon me and beg for it?'",
        "source": "T12n0384_007:1048c06_20"
    },
    {
        "source_sentence": "即復出經使誦讀，未經幾日已復通達，技術災怪眾星運度皆悉明了。",
        "translation": "He then produced another sūtra and asked him to recite it, but after a few days he understood it again, and the technical calamities and miracles of the stars and constellations all became clearer.",
        "source": "T12n0384_007:1048c06_21"
    },
    {
        "source_sentence": "「時師慇懃欲得留住，更無異經可以學者，即辭師下山詣村乞求。",
        "translation": "When the teacher wanted to stay, he said, There's no different scripture that can be studied, so he left his teacher and went down the mountain to the village to beg.",
        "source": "T12n0384_007:1048c08_22"
    },
    {
        "source_sentence": "見異學梵志眾五千餘人，於大聚落而共祠天。",
        "translation": "He saw that there were more than five thousand heretics and brahmins, all of whom worshiped the gods in a large village together.",
        "source": "T12n0384_007:1048c09_23"
    },
    {
        "source_sentence": "彼祠天法殺五百牸牛，五百羯羊，五百駱駝，五百匹馬，象中精健六牙成就，",
        "translation": "The deities of that shrine killed five hundred cowherds, five hundred sheep, five hundred camels, and five hundred horses. Among the elephants they were strong and had accomplished six tusks.",
        "source": "T12n0384_007:1048c10_24"
    },
    {
        "source_sentence": "五百女人，金杖一枚，金澡罐一枚，白[疊*毛]千張，金銀錢各五萬，",
        "translation": "The five hundred women had one piece of gold cane, one piece of gold bathing pot, a thousand pieces of white cotton cloth, and fifty thousand coins of gold and silver each.",
        "source": "T12n0384_007:1048c12_25"
    },
    {
        "source_sentence": "此諸寶物祠天訖當入於師。",
        "translation": "These jeweled objects will then enter the teacher after they've been worshipped by gods.",
        "source": "T12n0384_007:1048c14_26"
    },
    {
        "source_sentence": "時我下去衣裳塵垢，先在山中苦行積年披鹿皮衣，聞彼聚中異學梵志師宗五千人設大壇會，",
        "translation": "When I went down into the mountain, wearing a deerskin robe for many years of asceticism, I heard that there were five thousand heretics and brahmin teachers from different sects in the assemblies setting up a great altar-assembly.",
        "source": "T12n0384_007:1048c14_27"
    },
    {
        "source_sentence": "我即過之。",
        "translation": "I am the one who's faulty.",
        "source": "T12n0384_007:1048c16_28"
    },
    {
        "source_sentence": "時彼師長問吾：『經典技術多者得為上座，經典少者乃處下座。』",
        "translation": "That teacher then asked me, 'Those who have a lot of skillful means in the sūtras can be the superior seat, and those who have few sūtras can be the inferior seat.'",
        "source": "T12n0384_007:1048c17_29"
    },
    {
        "source_sentence": "彼師所知，不能通達祕要讖記，以我為上座。",
        "translation": "Known by that teacher, he couldn't fathom the secret essentials and took me as his superior.",
        "source": "T12n0384_007:1048c18_30"
    },
    {
        "source_sentence": "彼師瞋恚：『此為何人？",
        "translation": "The teacher became angry and said, 'Who is this person?'",
        "source": "T12n0384_007:1048c19_31"
    },
    {
        "source_sentence": "珍寶雜物今應屬我。",
        "translation": "The treasures and miscellaneous things should now belong to me.",
        "source": "T12n0384_007:1048c20_32"
    },
    {
        "source_sentence": "此人見奪，若當更生共相值遇，要當報怨，如今奪我無異。』",
        "translation": "This person sees that they'll be taken away, and if they are to meet each other again in common, they must repay their enemies; it's no different from taking me now.'",
        "source": "T12n0384_007:1048c20_33"
    },
    {
        "source_sentence": "時我即說：『邪見顛倒非真非實，分別有無為說涅槃，無生、老、病、死、無彼、無此，",
        "translation": "At that time, I said: What is wrong view is perverted. It is neither true nor false. It discriminates the conditioned and the unconditioned to speak of nirvana. There is no birth, no old age, no sickness, no death, no there-and-nothing, and no here.",
        "source": "T12n0384_007:1048c21_34"
    },
    {
        "source_sentence": "中間自相法觀清淨四無所畏，為福生天為罪地獄，慳貪餓鬼、抵債畜生，",
        "translation": "In the middle are the four pure forms of self-natured contemplation of dharmas as distinct characteristics and the four fearlessnesses, which are born for blessed gods and sin hells, stinginess, greed, hungry ghosts, and debt-paying animals.",
        "source": "T12n0384_007:1048c23_35"
    },
    {
        "source_sentence": "善惡之報如影隨形。』",
        "translation": "The results of good and bad are like shadows following form.'",
        "source": "T12n0384_007:1048c25_36"
    },
    {
        "source_sentence": "時五千人心識開悟，即請我為師。",
        "translation": "When 5,000 people's minds and consciousnesses were enlightened, they invited me to be their teacher.",
        "source": "T12n0384_007:1048c25_37"
    },
    {
        "source_sentence": "時象、馬、牛、羊、駱駝盡應殺之，而我不殺。",
        "translation": "The elephants, horses, cattle, cattle, sheep, and camels should all be killed, but I won't kill them.",
        "source": "T12n0384_007:1048c26_38"
    },
    {
        "source_sentence": "金杖澡罐我應取之，我即以與上座瞋者。",
        "translation": "I should take the golden staff and bathing pot, and I'll give it to the superior monk who's angry.",
        "source": "T12n0384_007:1048c27_39"
    },
    {
        "source_sentence": "五百女人還寄祠祀之主，五萬金錢吾取五百，五萬銀錢吾取五百，餘寄祠主。",
        "translation": "The five hundred women returned to the head of the shrine, and with fifty thousand coins, I took five hundred; with fifty thousand silver coins, I took five; and the rest was sent to the head of the shrine.",
        "source": "T12n0384_007:1048c28_40"
    },
    {
        "source_sentence": "「吾從村至村，從國至國，漸漸至清明城東門外。",
        "translation": "“From village to village, from country to country, I gradually reached the outer gate east of the city of Qingming.",
        "source": "T12n0384_007:1049a02_41"
    },
    {
        "source_sentence": "見五百梵志耆年宿德，學道日久日曝火炙形貌醜穢，吾即以五百金錢各與一枚。",
        "translation": "When I saw that the five hundred brahmins, old and virtuous, who had studied the path day after day for a long time, were exposed to fire and scorched with ugly appearances, I gave each of them one piece of food for five hundred coins.",
        "source": "T12n0384_007:1049a03_42"
    },
    {
        "source_sentence": "辭別入城，見城中人香水灑地除去塵穢，懸繒幡蓋行列端嚴皆欲出城，",
        "translation": "He entered the city at once and saw that all the people in the city were sprinkling perfume on the ground to remove dirt, hanging silhouettering banners, canopies, rows of streamers, and beautifully arrayed rows of people wishing to leave the city.",
        "source": "T12n0384_007:1049a05_43"
    },
    {
        "source_sentence": "我小前行見一女人持花七枚，我時左右顧視，求香覓花了不能得，即問此女：『汝花可得者，",
        "translation": "In front of me I saw a woman carrying seven pieces of flower garlands. Looking around at her left and right, looking for some fragrance but not getting it, I asked the woman, “Can you get these flowers?",
        "source": "T12n0384_007:1049a06_44"
    },
    {
        "source_sentence": "吾欲買之。』",
        "translation": "I want to buy it.'",
        "source": "T12n0384_007:1049a08_45"
    },
    {
        "source_sentence": "女報我言：『此花王花，佛當入城將用上佛，不可得也。』",
        "translation": "The woman reported to me, saying, 'This is the king of flowers, and the Buddha will enter the city and use the above buddha; it's unobtainable.'",
        "source": "T12n0384_007:1049a09_0"
    },
    {
        "source_sentence": "菩薩復以善權方便，更告語女：『吾有寶錢五百枚，一花百錢，若見與者，",
        "translation": "Again, the bodhisattva used skillful means to tell the woman, “I have five hundred pieces of treasure coin and one flower for a hundred coins.",
        "source": "T12n0384_007:1049a10_1"
    },
    {
        "source_sentence": "出錢相付。』",
        "translation": "Let's give each other the money.'",
        "source": "T12n0384_007:1049a11_2"
    },
    {
        "source_sentence": "女貪得寶即以五花與之。",
        "translation": "The woman craved the treasure and gave it to him with five flowers.",
        "source": "T12n0384_007:1049a12_3"
    },
    {
        "source_sentence": "行數十步，女自念言：『此人顏貌端正身披鹿皮衣，貪我五枚花不惜銀錢，",
        "translation": "After walking for several tens of paces, the woman thought to herself, “This man’s features are correct and he wears a deerskin robe. He covets five pieces of flower garlands but does not offer silver coins.",
        "source": "T12n0384_007:1049a12_4"
    },
    {
        "source_sentence": "此必有以。』",
        "translation": "There must be a reason for this.'",
        "source": "T12n0384_007:1049a14_5"
    },
    {
        "source_sentence": "迴頭喚言：『男子！",
        "translation": "He turned around and called out, saying, 'Man!",
        "source": "T12n0384_007:1049a14_6"
    },
    {
        "source_sentence": "卿用花為？』",
        "translation": "What do you use flowers for?'",
        "source": "T12n0384_007:1049a15_0"
    },
    {
        "source_sentence": "報言：『上佛。』",
        "translation": "He replied, 'Supreme Buddha.'",
        "source": "T12n0384_007:1049a15_1"
    },
    {
        "source_sentence": "時女聞佛名，即以二花持用寄我。",
        "translation": "When the woman heard the Buddha's name, she sent it to me with two flowers.",
        "source": "T12n0384_007:1049a15_2"
    },
    {
        "source_sentence": "我即出城，遙見佛來，諸天人民填塞道路，無有空缺地可禮拜。",
        "translation": "I then came out of the city and saw the Buddha coming from a distance. All the gods and people blocked the road, leaving no space to worship him.",
        "source": "T12n0384_007:1049a16_3"
    },
    {
        "source_sentence": "「『破愛憍慢心，　　能滅欲、怒、癡；",
        "translation": "Destroying the mind of craving, hatred, and conceit, they can extinguish desire, anger, and delusion.",
        "source": "T12n0384_007:1049a17_4"
    },
    {
        "source_sentence": "　　第一光相足，　　唯佛照我心。",
        "translation": "The first ray of light is sufficient for the characteristics; Only the Buddha illumines my mind.",
        "source": "T12n0384_007:1049a17_4"
    },
    {
        "source_sentence": "　　昔我所求願，　　今日得見佛；",
        "translation": "What I wished for in the past, Today I see the Buddha.",
        "source": "T12n0384_007:1049a17_4"
    },
    {
        "source_sentence": "　　今散五莖花，　　願得不退轉。",
        "translation": "Now, I'll scatter five stalks of flowers, wishing to attain nonregression.",
        "source": "T12n0384_007:1049a17_4"
    },
    {
        "source_sentence": "　　餘二非我花，　　王女寄上佛；",
        "translation": "The other two were not flowers of self, but the queen’s maidens sent them to the Buddha.",
        "source": "T12n0384_007:1049a17_4"
    },
    {
        "source_sentence": "　　無上大導師，　　見愍蹈我髮。』",
        "translation": "The unsurpassed great guide sees and follows me.'",
        "source": "T12n0384_007:1049a17_4"
    },
    {
        "source_sentence": "佛前有一汪水可受一人，吾即解髮布髮水中，即以此偈而讚歎佛：「時光明如來，",
        "translation": "In front of the Buddha there was a pool of water that could be used for one person, so I uncovered it and spread it in water. Then I praised the Buddha in verse:",
        "source": "T12n0384_007:1049a17_4"
    },
    {
        "source_sentence": "「『摩納發大心，　　曠濟無數人；",
        "translation": "Mānava aroused the great aspiration To save innumerable people.",
        "source": "T12n0384_007:1049a26_5"
    },
    {
        "source_sentence": "　　弘誓不自為，　　殖眾功德本。",
        "translation": "They make a great vow not to do anything for themselves, planting the roots of virtue in others.",
        "source": "T12n0384_007:1049a26_5"
    },
    {
        "source_sentence": "　　却後無數劫，　　五鼎五濁世；",
        "translation": "Countless eons after that, The worlds of the five directions and the five turbid realms Will be like this.",
        "source": "T12n0384_007:1049a26_5"
    },
    {
        "source_sentence": "　　成佛度眾生，　　號字釋迦文。",
        "translation": "To become a buddha and save sentient beings, his name is Śākyamuni.",
        "source": "T12n0384_007:1049a26_5"
    },
    {
        "source_sentence": "　　光相三十二，　　奇特人中尊；",
        "translation": "The thirty-two marks of a buddha’s radiance Are most remarkable and honored among men.",
        "source": "T12n0384_007:1049a26_5"
    },
    {
        "source_sentence": "　　受慧稱佛竟，　　地六反震動。",
        "translation": "After he had received the name Buddha of wisdom, the earth shook six times.",
        "source": "T12n0384_007:1049a26_5"
    },
    {
        "source_sentence": "　　諸天世人民，　　見我得記別；",
        "translation": "All the gods and people of the world Will see me And receive my predictions.",
        "source": "T12n0384_007:1049a26_5"
    },
    {
        "source_sentence": "　　常想眾結滅，　　皆願生我世。』",
        "translation": "He always perceives the cessation of all bonds and wishes to be born in my world.'",
        "source": "T12n0384_007:1049a26_5"
    },
    {
        "source_sentence": "見我心發大弘誓不可沮壞，即以偈而讚我言：「爾時，光明如來即以足蹈我髮上過，",
        "translation": "Seeing that my mind had undertaken a great vow not to be broken, he praised me in verse, saying, At that point, the Tathāgata of Light stepped on me with his feet.",
        "source": "T12n0384_007:1049a26_5"
    },
    {
        "source_sentence": "佛以神力接我五花及以我身即在虛空，餘有二花在佛左右肩上。",
        "translation": "The Buddha used his supernormal powers to take the five flowers and my body, which were in space, and two other flowers were placed on the Buddha's left and right shoulders.",
        "source": "T12n0384_007:1049b07_6"
    },
    {
        "source_sentence": "吾昔所行，破五千梵志祠天事火之具，使行正見八平等法，坐臥經行步步饒益度脫眾生，",
        "translation": "My practice in the past was to destroy the five thousand brahmins’ fire-powered articles used for worshiping deities and gods, so that they might practice righteousness and see the eightfold doctrine of equanimity. They sat, lay down, walked, and benefited sentient beings by liberating them.",
        "source": "T12n0384_007:1049b09_7"
    },
    {
        "source_sentence": "從此以來未曾墜墮三塗八難世智辯聰邊地佛後。」",
        "translation": "Ever since then, I've never fallen into the three destinies and eight difficulties of worldly wisdom and eloquence after the Buddha of the marginal land.",
        "source": "T12n0384_007:1049b11_8"
    },
    {
        "source_sentence": "爾時，座上魔界眾生，計常斷滅，言苦有樂，無常謂有常，無身謂有身，",
        "translation": "At that time sentient beings in the realm of Māra, seated on their seats, imagined permanence to be cessation and said, “Suffering has pleasure. Being impermanent means having permanence; being without a body means having a body.”",
        "source": "T12n0384_007:1049b12_9"
    },
    {
        "source_sentence": "習四顛倒不識明慧，五蓋自覆貪著利養。",
        "translation": "They are accustomed to the four kinds of mistaken craving that don't know insight and wisdom, and the five hindrances that cover themselves with greed and profit.",
        "source": "T12n0384_007:1049b14_10"
    },
    {
        "source_sentence": "「邪見非真道，　　如彼鐵[口*(隹\\/乃)]虫；",
        "translation": "A mistaken view is not the true path, Like that iron [mouth*(mouth*(mouth\\/no)] worm.",
        "source": "T12n0384_007:1049b15_11"
    },
    {
        "source_sentence": "　破骨入髓腦，　　苦痛無央數。",
        "translation": "They broke the bones and entered the marrow, which was painful and incalculable.",
        "source": "T12n0384_007:1049b15_11"
    },
    {
        "source_sentence": "　利養壞道德，　　智者所不習；",
        "translation": "The morality of gain and loss is uncultivated by the wise.",
        "source": "T12n0384_007:1049b15_11"
    },
    {
        "source_sentence": "　躬行堅固心，　　淨除無明法。」",
        "translation": "He conducts himself with a resolute mind and purifies the teaching of ignorance.",
        "source": "T12n0384_007:1049b15_11"
    },
    {
        "source_sentence": "爾時，世尊欲度斯等，邪見之人，重說頌曰：爾時，世尊說此邪見句義、味義、字義，",
        "translation": "At that time the World-honored One, wishing to liberate those who held a wrong view, spoke these verses again: The World-honored One taught this false view in terms of syllables, words, sounds, and syllables.",
        "source": "T12n0384_007:1049b15_11"
    },
    {
        "source_sentence": "說真實法，無央數百千眾生，皆發無上正真道意。",
        "translation": "He taught the true teaching, and measureless hundreds of thousands of sentient beings all aroused the intention for the unsurpassed true path.",
        "source": "T12n0384_007:1049b21_12"
    },
    {
        "source_sentence": "菩薩處胎經文殊身變化品第二十七",
        "translation": "Chapter Twenty-seventh of the Sutra on the Birthplace of the Bodhisattva in the Womb: The Transformation of Mañjuśrī's Body",
        "source": "T12n0384_007:1049b23_0"
    },
    {
        "source_sentence": "爾時，世尊無所著等正覺，入上尊定意三昧，觀察過去、當來、今現在菩薩摩訶薩劫數多少，",
        "translation": "At that point, the Bhagavān, free from attachment and fully awakened, entered the supremely venerable concentration samādhi to examine the number of eons of past, future, and present bodhisattva-mahāsattvas.",
        "source": "T12n0384_007:1049b24_0"
    },
    {
        "source_sentence": "應從一劫、二劫乃至百千無數億劫，應取般涅槃者。",
        "translation": "You should take parinirvāṇa from one eon, two eons, up to a hundred thousand or countless millions of eons.",
        "source": "T12n0384_007:1049b26_1"
    },
    {
        "source_sentence": "或有菩薩摩訶薩供養諸佛功德成就，教化眾生淨佛國土。",
        "translation": "Perhaps there's a bodhisattva-mahāsattva who has accomplished the merit of making offerings to the buddhas and teaching sentient beings to purify the Buddha's land.",
        "source": "T12n0384_007:1049b27_2"
    },
    {
        "source_sentence": "或有菩薩摩訶薩行八住童真，不取妻息除婬欲想，自住其地無父母兄弟，",
        "translation": "“Perhaps there are bodhisattva-mahasattvas practicing the eight abodes as children, not taking wives or stopping sexual desire, and living in their own land without parents or brothers.",
        "source": "T12n0384_007:1049b28_3"
    },
    {
        "source_sentence": "得成無上正真等正覺。",
        "translation": "They'll attain the unsurpassed true and perfect enlightenment.",
        "source": "T12n0384_007:1049c01_4"
    },
    {
        "source_sentence": "佛告文殊師利：「現汝古昔七十九劫於花光世界，在胎說法全身舍利。",
        "translation": "The Buddha told Mañjuśrī, Now, in the past seventy-nine eons ago, you were in the womb teaching the whole body of Śāriputra's relics in the Flower Light World.",
        "source": "T12n0384_007:1049c01_5"
    },
    {
        "source_sentence": "其土人民身長千由旬，佛身萬由旬。",
        "translation": "The people there are one thousand yojanas in height and the Buddha’s body is ten thousand yojanas in height.",
        "source": "T12n0384_007:1049c03_6"
    },
    {
        "source_sentence": "東、西、南、北、四維、上、下，無量無限不可稱計，非算師算師弟子所能籌量。",
        "translation": "The eastern, western, southern, northern, four intermediate directions, and the higher and lower directions are immeasurable, infinite, incalculable, and cannot be calculated; they cannot be calculated by a soothsayer or apprentice soothsayer.",
        "source": "T12n0384_007:1049c04_7"
    },
    {
        "source_sentence": "根本清淨汝本在彼，佛身光相示現神足，令此大會得一覩見，於如來種利益眾生。」",
        "translation": "You're fundamentally pure, originally there; the Buddha's body is shining and shows miraculous abilities, causing this great assembly to attain a debilitating view that benefits sentient beings in the Tathāgata's seed.",
        "source": "T12n0384_007:1049c05_8"
    },
    {
        "source_sentence": "「文殊本成佛，　　在胎現變化；",
        "translation": "Mañjuśrī had originally become a buddha, Yet manifested his transfiguration in the womb.",
        "source": "T12n0384_007:1049c07_9"
    },
    {
        "source_sentence": "　方身萬由旬，　　光明相炳著。",
        "translation": "His square body was ten thousand yojanas in circumference, shining brilliantly.",
        "source": "T12n0384_007:1049c07_9"
    },
    {
        "source_sentence": "　目如青蓮花，　　脣口珠火明，",
        "translation": "Their eyes are like blue lotus blossoms, their lips and mouths like jewels shining brightly.",
        "source": "T12n0384_007:1049c07_9"
    },
    {
        "source_sentence": "　方白四十齒，　　眼眴上下迎。",
        "translation": "He had forty white teeth, and his eyes stood up and down to greet him.",
        "source": "T12n0384_007:1049c07_9"
    },
    {
        "source_sentence": "　諸天、龍、鬼神，　　香花歸命禮；",
        "translation": "The gods, dragons, and spirits offered incense and flowers of homage to him.",
        "source": "T12n0384_007:1049c07_9"
    },
    {
        "source_sentence": "　今我處此胎，　　比方汝彼剎；",
        "translation": "I am now in this womb, Compared to you at that buddha-land.",
        "source": "T12n0384_007:1049c07_9"
    },
    {
        "source_sentence": "　於十六分中，　　不得如毫釐。",
        "translation": "In sixteen parts, it cannot be as small as a tiny bit.",
        "source": "T12n0384_007:1049c07_9"
    },
    {
        "source_sentence": "　如來神德化，　　通達無所礙；",
        "translation": "The enlightened one’s spiritual qualities and teachings Are unhindered in their penetration.",
        "source": "T12n0384_007:1049c07_9"
    },
    {
        "source_sentence": "　禁戒香遠布，　　諸佛悉歎譽。",
        "translation": "The fragrance of the precepts is spread far and wide, Praised by all the Buddhas.",
        "source": "T12n0384_007:1049c07_9"
    },
    {
        "source_sentence": "　此今諸來會，　　欲問難有法；",
        "translation": "At the present assembly, those who come here want to ask questions about the teaching that is difficult.",
        "source": "T12n0384_007:1049c07_9"
    },
    {
        "source_sentence": "　軟首現汝力，　　蠲除疑網結。」",
        "translation": "Weak-headed, show your strength to remove the web of doubt.",
        "source": "T12n0384_007:1049c07_9"
    },
    {
        "source_sentence": "爾時世尊即說頌曰：爾時，文殊師利菩薩摩訶薩，不離本座即以神足定力，",
        "translation": "It was then that the World-honored One uttered these verses: At that time, without leaving his seat, the bodhisattva Mahāsattva Mañjuśrī, by the power of supernormal speed and concentration,",
        "source": "T12n0384_007:1049c07_9"
    },
    {
        "source_sentence": "猶大力人屈伸臂頃，接華世界內娑呵世界釋迦牟尼母胎會中。",
        "translation": "It's like when a great man bends and extends his arm and joins the Śākyamuni in the mother-child assembly of Śākyamuni in the sahā world inside the Flowered World.",
        "source": "T12n0384_007:1049c21_10"
    },
    {
        "source_sentence": "二佛世界不相障礙，現身佛相眾好具足坐樹王下，敷演深奧最勝之法，",
        "translation": "The worlds of the two Buddhas are not mutually exclusive, manifesting buddha-figures with all their marks and embellishments. They sit at the foot of a tree, expounding the most profound and mysterious teaching.",
        "source": "T12n0384_007:1049c22_11"
    },
    {
        "source_sentence": "彼土菩薩亦來親近釋迦文佛，供養承事香花幡蓋。",
        "translation": "The bodhisattvas of that land also came to become intimate with Śākyamuni Buddha and offered incense, flowers, banners, and shrouds to him.",
        "source": "T12n0384_007:1049c24_12"
    },
    {
        "source_sentence": "釋迦文尼菩薩弟子亦彼至彼禮事供養，彼此音響說甚深妙法，共相開通無有罣礙，",
        "translation": "The disciples of the bodhisattva Śākyamuni also went there to pay their respects and make offerings, each other’s voices speaking the profound sublime Dharma. They shared one another’s understanding without obstruction or impediment.",
        "source": "T12n0384_007:1049c25_13"
    },
    {
        "source_sentence": "彼說無生此亦如是，我說意止彼亦如是，意斷、根、力、覺、道彼此無異，",
        "translation": "The same applies to the one who says that there is nonorigination. So it is with what I mean by ‘mental cessation’. The same applies to mental cessation. The elimination of thought, faculties, power, feeling and path are not different from each other.",
        "source": "T12n0384_007:1049c27_14"
    },
    {
        "source_sentence": "彼說苦空非身此亦如是。",
        "translation": "It's likewise here when they say that suffering is emptiness and not body.",
        "source": "T12n0384_007:1049c29_15"
    },
    {
        "source_sentence": "「觀內外清淨，　　緣滅想亦然；",
        "translation": "Observing internal and external purity is likewise for the cessation of perceptions.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　十方諸佛剎，　　神德無有異。",
        "translation": "The buddha-lands in the ten directions Have no different spiritual qualities:",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　皆由眾生根，　　現有妙不妙；",
        "translation": "It is all due to the faculties of sentient beings that there are subtle and unsubtle manifestations.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　計我成佛身，　　此剎為最小。",
        "translation": "This buddha-stage is the smallest among all the atoms that make up a buddha-body.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　座中有疑故，　　於胎現變化；",
        "translation": "Because there is doubt in the seat, he manifests transfiguration in the womb.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　我身如微塵，　　今在他佛國。",
        "translation": "My body is like a tiny particle of dust, but now I'm elsewhere in the Buddha's land.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　三十二相明，　　在在無不現；",
        "translation": "The thirty-two characteristics are clear, Being present everywhere without non-manifesting.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　本為能人師，　　今乃為弟子。",
        "translation": "Originally he was a teacher of the wise, but now he's a disciple.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　佛道極廣大，　　清淨無增減；",
        "translation": "The buddha path is extremely vast, Pure and without increase or decrease.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　或欲見佛身，　　二尊不竝立。",
        "translation": "If someone wants to see the Buddha's body, the two honored ones won't stand cross-legged.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　此界現受教，　　我剎見佛身；",
        "translation": "This world now receives instruction, while the self and lands see the buddha-body.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　此剎有劫燒，　　我土無壞敗。",
        "translation": "This land has a kalpa of burning, but my land doesn't break down.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　佛力悉周遍，　　眾生心非一；",
        "translation": "Buddha’s power pervades everywhere; The minds of sentient beings are not one and the same.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　眾會聽我說，　　除此更有餘。",
        "translation": "The assembly listens to my explanation, and there's nothing more to be said besides this.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　佛剎名無閡，　　佛名升仙尊；",
        "translation": "The buddha-lands are called unobstructed; The Buddha is called the honored one who ascends to enlightenment.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　國土倍復倍，　　清淨無瑕穢。",
        "translation": "The land is doubling and doubling, pure and undefiled.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　國城皆七寶，　　水精琉璃地；",
        "translation": "The kingdoms and cities are all made of the seven kinds of treasure, With lapis lazuli terraces adorned with water spirits.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　八解甘露池，　　洗浴去塵垢；",
        "translation": "The pond of ambrosia of the eight liberations Washes and bathes away dirt.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　令住無礙處，　　[火*霍]然覩大明。",
        "translation": "He causes them to live in an unobstructed place, [火*霍]然大明.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　彼升仙佛者，　　勿謂為異人；",
        "translation": "Those who ascend to the buddhahood of immortality Do not think that they are different people.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　眾會欲知者，　　我身軟首是。",
        "translation": "Those who want to know it in the assembly want to know that my body is soft and my head is soft.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　置此更有餘，　　剎土名究竟；",
        "translation": "In addition to these, there are other buddha-lands called the ultimate.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　佛名大智慧，　　過諸菩薩量；",
        "translation": "The Buddha’s name is Great Wisdom, Which surpasses the names of enlightening beings.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　彼無二乘學，　　辟支，聲聞等。",
        "translation": "There are no two-vehicle students, pratyekabuddhas, śrāvakas, and so forth.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　菩薩摩訶薩，　　無有欲怒癡；",
        "translation": "Great enlightening beings have no craving, anger, or delusion.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　根敗葉不生，　　況復有果實？",
        "translation": "When the roots are decayed, leaves won't grow, so why wouldn't there be fruit?",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　大人相具足，　　先救後自濟。",
        "translation": "A great man is endowed with characteristics, first saving and then rescuing himself.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　命如五河流，　　五使五纏結；",
        "translation": "Life is like the five rivers: The five contaminants are bound by the five envelopers.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　五盛陰唼嗽，　　輪轉五道中。",
        "translation": "The five flourishing aggregates are coughed, and they transmigrate in the five destinies.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　七使勳堅著，　　不離七生處；",
        "translation": "The seven contaminants are combined and firmly attached, Not leaving the seven spheres of birth.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　無為八正道，　　除去八邪業；",
        "translation": "The eight unconditioned paths of enlightenment Remote the eight wrong actions.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　八慧清淨觀，　　洗以八解水；",
        "translation": "The pure contemplation of the eight kinds of wisdom Is washed with the water of the eight liberations.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　八住八除入，　　有為八法道；",
        "translation": "The eightfold abode, the eightfold sense-field and the eightfold path of conditioned dharmas.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　苦法有九分，　　六趣眾生行。",
        "translation": "The law in relation to frustration has nine parts: the six destinies of beings as conditioned.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　究竟九無閡，　　莊嚴佛道樹；",
        "translation": "The ultimate nine are unobstructed, Adorning the tree of enlightenment.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　十力無畏法，　　被慈弘誓鎧。",
        "translation": "The ten powers and fearlessness of the Dharma are endowed with the armor of compassion and great vow.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　手執智慧劍，　　芟除結使林；",
        "translation": "He holds the sword of wisdom in his hand, Extinguishing the forest of fetters.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　此界諸眾生，　　貪著生貢高。",
        "translation": "The sentient beings in this realm are greedy and arrogant.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　重病離良醫，　　療治方更劇；",
        "translation": "A serious illness is separated from a good doctor, and the cure becomes even more serious.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　猶如野火熾，　　焚燒山林澤；",
        "translation": "It’s like a wildfire blazing, Burning mountains, forests, and swamps.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　隨嵐大風吹，　　焰熾何時滅？",
        "translation": "When a great wind blows in the wake of a storm, when does the blazing flame cease?",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　今我等世界，　　廣演大智慧；",
        "translation": "In this world, we now extensively expound our great knowledge.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "　我如今日身，　　大智如來是。」",
        "translation": "Today, I am the Tathāgata Mahāprajñāpāramitā.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "爾時文殊師利即說頌曰：爾時，文殊師利說此頌已。",
        "translation": "It was then that Mañjuśrī spoke a verse, saying, At the time, Mañjuśrī had spoken this verse.",
        "source": "T12n0384_007:1049c29_16"
    },
    {
        "source_sentence": "無量阿僧祇眾生，皆悉願樂生花剎土。",
        "translation": "Measureless and incalculable sentient beings all wish to be born in the flowery buddha-lands.",
        "source": "T12n0384_007:1050b16_17"
    },
    {
        "source_sentence": "時文殊師利還攝神足，現釋迦文佛菩薩弟子，國土多少還復如故。",
        "translation": "Mañjuśrī then returned to gather his spiritual feet and showed them to the disciples of Śākyamuni Buddha and bodhisattvas, and the number of lands they had returned to their original form.",
        "source": "T12n0384_007:1050b17_18"
    },
    {
        "source_sentence": "菩薩處胎經八賢聖齋品第二十八",
        "translation": "Chapter Twenty-eight of the Sutra on the Bodhisattva's Birth in the Womb, Eight Virtuous and Noble Cultivations",
        "source": "T12n0384_007:1050b20_0"
    },
    {
        "source_sentence": "爾時，座中有菩薩，名曰智積——於過去佛造眾德本降伏魔怨，善權變化莊嚴佛土，",
        "translation": "At the time, there was a bodhisattva in his seat named Zhiji who had created many virtues from past buddhas to subdue Māra's enemies and skillfully transformed himself to adorn the Buddha-lands.",
        "source": "T12n0384_007:1050b21_0"
    },
    {
        "source_sentence": "於無央數修行忍辱，忍心不闕禪行不廢，於大眾中為師子吼，獨步三界隨時上下，",
        "translation": "He cultivates tolerance and forbearance in measureless numbers without lacking patience, practices meditation without slackening, rouses the lion’s roar in the midst of the masses, walks alone in the three realms at all times, going up and down.",
        "source": "T12n0384_007:1050b22_1"
    },
    {
        "source_sentence": "靡所不入應適無方，能使山、河、石壁皆為七寶；",
        "translation": "They can cause mountains, rivers, and stone walls to all be made of the seven treasures.",
        "source": "T12n0384_007:1050b24_2"
    },
    {
        "source_sentence": "給施貧窮四事不乏，解了空觀法性清淨，分別三世威儀法則，如幻、如化、如鏡中像，",
        "translation": "He gave alms to the poor, not deficient in four things, understood emptiness and observed the purity of the essence of dharmas, discerning the three worldly rules of deportment as illusory, magical, and mirror images.",
        "source": "T12n0384_007:1050b25_3"
    },
    {
        "source_sentence": "如熱時焰如空中響；",
        "translation": "They are like the flame that burns when it is hot, like an echo in the sky.",
        "source": "T12n0384_007:1050b27_4"
    },
    {
        "source_sentence": "所將眷屬根本成就，奉持禁戒不犯毫釐——即從坐起偏露右臂右膝著地，",
        "translation": "When the members of his retinue were fundamentally accomplished, he observed the precepts and didn't violate them even a tiny bit - so he rose from his seat, bared his right shoulder, knelt with his right knee touching the ground.",
        "source": "T12n0384_007:1050b28_5"
    },
    {
        "source_sentence": "叉手合掌前白佛言：「快哉，世尊！",
        "translation": "He saluted the Buddha with joined palms and said to him, Excellent, Bhagavān!",
        "source": "T12n0384_007:1050b29_6"
    },
    {
        "source_sentence": "如來所化無不周遍，天、龍、人、鬼皆至道場，空界眾生及以胎化，所可濟度不可稱量。",
        "translation": "Gods, dragons, humans, and ghosts all went to the site of enlightenment, and sentient beings in the realm of space and those born from a mother’s womb were able to save and liberate them without measure.",
        "source": "T12n0384_007:1050c01_7"
    },
    {
        "source_sentence": "唯願世尊，分別六趣善惡之行威儀禁戒，初、中、竟善一一分別，使未學者學、未知者知。」",
        "translation": "May the Bhagavān only discern the good and bad actions, mannerisms, and prohibitions of the six destinies in order to discern the first, middle, and final goodness one by one so that those who haven't studied and those who haven't learned will know them.",
        "source": "T12n0384_007:1050c03_8"
    },
    {
        "source_sentence": "佛告智積菩薩：「善哉，善哉！",
        "translation": "The Buddha told the bodhisattva Prajñākūṭa, Good, good!",
        "source": "T12n0384_007:1050c05_9"
    },
    {
        "source_sentence": "能問如來甚深之義，今當與汝分別善惡禁戒所趣。",
        "translation": "If you can ask about the profound meaning of the Tathāgata, I will now give you a discernment of what good and bad precepts lead to.",
        "source": "T12n0384_007:1050c06_0"
    },
    {
        "source_sentence": "諦聽，諦聽！",
        "translation": "Listen attentively, and pay close attention!",
        "source": "T12n0384_007:1050c07_1"
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Consider it well!",
        "source": "T12n0384_007:1050c07_2"
    },
    {
        "source_sentence": "吾昔一時無央數劫為金翅鳥王，七寶宮殿後園浴池皆七寶成，遊戲園觀心得自在，",
        "translation": "I was once the king of birds with golden wings for innumerable kalpas. My palaces were made of the seven kinds of treasure, and all the gardens and bathing ponds behind my palaces were also made of the seven kinds of treasure.",
        "source": "T12n0384_007:1050c07_3"
    },
    {
        "source_sentence": "所行法則如轉輪聖王。",
        "translation": "The Dharma that he practices is like the wheel-turning sage king.",
        "source": "T12n0384_007:1050c09_4"
    },
    {
        "source_sentence": "內宮婦女狀如天人，於百千萬劫，時乃入海求龍為食。",
        "translation": "The women in the inner palace looked like gods and humans, and for a hundred million eons they went into the ocean to find dragons to eat.",
        "source": "T12n0384_007:1050c10_5"
    },
    {
        "source_sentence": "時彼海中有化生龍子，八日、十四日、十五日，受如來齋八禁戒法，不殺、不盜、不婬、不妄言、綺語、不勸飲酒、不聽作倡伎樂、香花、脂粉、高廣床、非時不食，",
        "translation": "On the eighth, fourteenth, and fifteenth days there was a magical dragon in that ocean. He observed the eight precepts of purification for the Tathāgata on the eighth day; he did not kill, did not steal, did not commit sexual misconduct, did not speak falsehoods, did not talk fancy words, did not drink alcohol, did",
        "source": "T12n0384_007:1050c11_6"
    },
    {
        "source_sentence": "奉持賢聖八法。",
        "translation": "They uphold the eight noble and virtuous dharmas.",
        "source": "T12n0384_007:1050c14_7"
    },
    {
        "source_sentence": "時金翅鳥王身長八千由旬，左、右翅各各長四千由旬，大海縱廣三百三十六萬里。",
        "translation": "The king garuḍa was eight thousand yojanas in height, with four thousand yojanas long on each of its left and right wings. The great ocean was three hundred and thirty-three million li long and wide.",
        "source": "T12n0384_007:1050c15_0"
    },
    {
        "source_sentence": "金翅鳥以翅斫水取龍，水未合頃銜龍飛出，金翅鳥法，欲食龍時先從尾而吞，",
        "translation": "The golden-winged bird takes the dragon by means of its wings and feeds on water. Before the water closes up, it flies out in an uncoupled manner holding the dragon in its beak; this is the way the golden-winged bird swallows it from its tail when it wants to eat the dragon.",
        "source": "T12n0384_007:1050c16_1"
    },
    {
        "source_sentence": "到須彌山北有大緣鐵樹，高十六萬里，銜龍至彼欲得食噉，求龍尾不知處，",
        "translation": "To the north of Mount Sumeru there was a great iron tree sixty thousand li in height, one hundred and sixty thousand li high. The king came to that place holding a dragon in his beak; wishing to eat it, he looked for its tail but could not find it.",
        "source": "T12n0384_007:1050c18_2"
    },
    {
        "source_sentence": "以經日夜。",
        "translation": "For days and nights, it's like this.",
        "source": "T12n0384_007:1050c20_3"
    },
    {
        "source_sentence": "明日龍出尾，語金翅鳥：『化生龍者我身是也，我不持八關齋法者，汝即灰滅我。』",
        "translation": "On the next day, the dragon emerged from its tail and said to the garuḍa, 'The transformation-born dragon is me, and if I don't observe the eight precepts for fasting, you will cease me with ashes.'",
        "source": "T12n0384_007:1050c20_4"
    },
    {
        "source_sentence": "金翅鳥聞之悔過自責：『佛之威神甚深難量。",
        "translation": "When the garuḍa heard this, it repented and said to itself, 'The Buddha's authoritative power is so profound and immeasurable.",
        "source": "T12n0384_007:1050c22_5"
    },
    {
        "source_sentence": "我有宮殿去此不遠，共我至彼以相娛樂。』",
        "translation": "My palace isn't far from here, so why wouldn't you go there with me to amuse yourself?'",
        "source": "T12n0384_007:1050c23_6"
    },
    {
        "source_sentence": "龍即隨金翅鳥至宮殿觀看。",
        "translation": "The dragon then followed the garuḍa to the palace and looked around.",
        "source": "T12n0384_007:1050c24_7"
    },
    {
        "source_sentence": "『今此眷屬不聞如來八關齋法，唯願指授禁戒威儀，若壽終後得生人中。』",
        "translation": "'Now, this family hasn't heard the Tathāgata's teaching of the eight precepts, but they only wish to instruct them on the observance of the precepts and mannerisms, so that they can be born among humans after their life ends.'",
        "source": "T12n0384_007:1050c25_0"
    },
    {
        "source_sentence": "「『七寶宮殿舍，　　莊嚴極快樂；",
        "translation": "The seven-jeweled palace and dwelling, Adorned with the utmost bliss.",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "　　行滿戒不具，　　受此金翅身。",
        "translation": "Their practice is complete and their precepts are not fulfilled, so they're given this gold-wing body.",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "　　我是龍王子，　　修道七萬劫；",
        "translation": "I am the prince of the nāga, Who will cultivate enlightenment For seventy thousand kalpas.",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "　　以針刺樹葉，　　犯戒作龍身。",
        "translation": "He pierced the leaves of a tree with a needle and violated the precepts to make a dragon's body.",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "　　我非胎生龍，　　濕生及卵生；",
        "translation": "I am not a dragon born from the womb, A wet-born one or an egg-born one.",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "　　轉身不退轉，　　興顯佛法眾。",
        "translation": "He turns his body and doesn't retreat, Showing the Buddha's Dharma congregation.",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "　　汝今受八齋，　　化汝眷屬等；",
        "translation": "Now you have undertaken the eightfold holy life, Teaching your disciples and followers.",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "　　奉禁無所犯，　　必得生善處。",
        "translation": "Being disciplined and not violating anything, they'll surely be born in a good place.",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "　　我宮在海水，　　亦以七寶成；",
        "translation": "My palace is in the ocean water, Also made of the seven treasures.",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "　　摩尼、頗梨珠，　　明月珠、金、銀，",
        "translation": "Maṇi and pāri beads, bright moon pearls, gold and silver,",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "　　可隨我到彼，　　觀看修佛事；",
        "translation": "You should follow me and go there, Observing and cultivating the buddha-work.",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "　　復益善根本，　　滋潤悉周遍。』",
        "translation": "It also benefits the roots of goodness and nourishes them all.'",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "爾時龍子具以禁戒法使讀誦，即於鳥王宮而說頌曰：「爾時，金翅鳥聞龍子所說，",
        "translation": "It was then that the dragon prince, who had been instructed to recite the sutra in accordance with the precepts, spoke a verse at the palace of the king of birds, saying, At that time, the garuḍa heard what the dragon prince said.",
        "source": "T12n0384_007:1050c26_1"
    },
    {
        "source_sentence": "受八關齋法。",
        "translation": "He was subject to the eight precepts for purifying the border.",
        "source": "T12n0384_007:1051a11_2"
    },
    {
        "source_sentence": "口自發言：『自今以後盡形壽不殺，如諸佛教。』",
        "translation": "He spoke out to himself, saying, 'From now on, I won't kill for the rest of my life, just like the Buddhist teachings.'",
        "source": "T12n0384_007:1051a11_3"
    },
    {
        "source_sentence": "金翅鳥眷屬受三自歸已，即從龍子到海宮殿，彼宮殿中有七寶塔，諸佛所說諸法深藏，",
        "translation": "The garuḍas and their retinues, having accepted the three kinds of self-restraint, departed from Nāgasena and went to the ocean palace. In that palace there was a stupa made of the seven kinds of treasures, which were deep treasuries containing all the teachings taught by the buddhas.",
        "source": "T12n0384_007:1051a12_4"
    },
    {
        "source_sentence": "別有七寶函滿中佛經，十二因緣總持三昧，見彼龍子及諸龍女，香花供養禮拜承事，",
        "translation": "There was another seven-jeweled casket full of buddha scriptures, in which were preserved twelve causes and conditions for the mastery of concentration. He saw that the dragons and their daughters offered incense, flowers, offerings, veneration, and service.",
        "source": "T12n0384_007:1051a14_5"
    },
    {
        "source_sentence": "猶如天上難檀婆那羅金殿無異。",
        "translation": "It's like the gold hall of Nanda and Upananda in heaven, where there's no difference.",
        "source": "T12n0384_007:1051a16_6"
    },
    {
        "source_sentence": "龍子語金翅鳥：『我受龍身劫壽未盡，未曾殺生嬈亂水性。』",
        "translation": "The dragon-son said to the garuḍa, 'I've undergone a dragon's body for an eon before my life has ended, and I've never killed or disturbed the water.'",
        "source": "T12n0384_007:1051a17_7"
    },
    {
        "source_sentence": "「『殺是不善行，　　減壽命中夭；",
        "translation": "'It's an unwholesome act to kill, and you'll die in the middle of life.",
        "source": "T12n0384_007:1051a18_8"
    },
    {
        "source_sentence": "　　身如朝露虫，　　見光則命終。",
        "translation": "His body is like a morning dew bug, and when he sees the light his life ends.",
        "source": "T12n0384_007:1051a18_8"
    },
    {
        "source_sentence": "　　持戒奉佛語，　　得生長壽天；",
        "translation": "Observing precepts and following the Buddha’s words, They will attain the heaven of long life.",
        "source": "T12n0384_007:1051a18_8"
    },
    {
        "source_sentence": "　　累劫積福德，　　不墮畜生道。",
        "translation": "For many kalpas they accumulated merit And did not fall into the realm of animals.",
        "source": "T12n0384_007:1051a18_8"
    },
    {
        "source_sentence": "　　今身為龍身，　　戒德清明行；",
        "translation": "In my body now I am a dragon, acting with the virtue of morality and pure and clear practice.",
        "source": "T12n0384_007:1051a18_8"
    },
    {
        "source_sentence": "　　雖墮六畜中，　　必望自濟度。』",
        "translation": "Even though they fall into the six animals, they must hope to save themselves.'",
        "source": "T12n0384_007:1051a18_8"
    },
    {
        "source_sentence": "爾時龍子復與金翅鳥，而說頌曰：「是時龍子說此頌時，龍子、龍女心開意解，",
        "translation": "It was then that the dragon son spoke these verses again to the garuḍa and said in verse, When the dragon son spoke these verses, the dragon sons and daughters were enlightened.",
        "source": "T12n0384_007:1051a18_8"
    },
    {
        "source_sentence": "壽終之後皆當生阿彌陀佛國。」",
        "translation": "After their lives end, they'll all be born in the land of Amitâbha Buddha.",
        "source": "T12n0384_007:1051a26_9"
    },
    {
        "source_sentence": "佛告智積菩薩：「我宿命所行戒德完具，得成菩薩，化現自在無所不入，",
        "translation": "The Buddha said to the bodhisattva Prajñākūṭa: In my former existences I practiced morality, perfected virtue, and attained enlightenment. There is nothing that I do not enter into in order to manifest myself freely as a bodhisattva.",
        "source": "T12n0384_007:1051a27_10"
    },
    {
        "source_sentence": "亦入於金翅鳥，亦入於龍子，亦入於魚、鼈、黿、鼉，所化如是。」",
        "translation": "They'll also enter into the garuḍas, they'll enter into the dragon children, and they'll enter into fish, turtles, crocodiles, frogs, and lions, and so forth, and they'll be transformed likewise.",
        "source": "T12n0384_007:1051a29_11"
    },
    {
        "source_sentence": "◎◎菩薩處胎經五樂品第二十九爾時，世尊觀察眾生心識所念：「欲知如來所經歷處，",
        "translation": "At that time, the World-honored One observed what sentient beings thought in their minds and perceptions:",
        "source": "T12n0384_007:1051b01_12"
    },
    {
        "source_sentence": "曾生金翅鳥中受龍子教誡，所度無量不可稱計，齊是更有餘？",
        "translation": "He was once born among the garuḍas and received the instruction of a dragon, but his salvation is immeasurable and cannot be measured. Is there any remainder in this?",
        "source": "T12n0384_007:1051b04_13"
    },
    {
        "source_sentence": "願聞其意。」",
        "translation": "May I hear your thoughts?",
        "source": "T12n0384_007:1051b05_14"
    },
    {
        "source_sentence": "佛知眾生心中所念，將欲示現本所造行身、口、意法。",
        "translation": "Knowing what sentient beings think in their minds, the Buddha wants to show the body, speech, and thought dharmas that were created in the past.",
        "source": "T12n0384_007:1051b05_15"
    },
    {
        "source_sentence": "「諸族姓子、族姓女！",
        "translation": "clansmen and clanswomen!",
        "source": "T12n0384_007:1051b07_0"
    },
    {
        "source_sentence": "聽我所說。",
        "translation": "Listen to what I teach.",
        "source": "T12n0384_007:1051b07_1"
    },
    {
        "source_sentence": "昔有天帝釋，去世已來經無數劫天福自然，於三千大千諸釋之中最尊第一。",
        "translation": "In the past, there was Śakra Devānām-Indra, who had been naturally blessed by gods for countless eons since his death and was the most honored among the 3,000 great one-thousand Śākyamunis.",
        "source": "T12n0384_007:1051b07_2"
    },
    {
        "source_sentence": "羅睺羅阿修羅王，生女端正，具足女法六十四能。",
        "translation": "Rāhula, the king of the asura kings, gave birth to a woman who was correct and endowed with the sixty-four powers of the female dharma.",
        "source": "T12n0384_007:1051b09_3"
    },
    {
        "source_sentence": "行步進止不失儀則，面如桃花色，口出言氣如優鉢蓮花香，身作牛頭栴檀香，",
        "translation": "His face was the color of a peach blossom flower; his mouth emitted the fragrance of utpala lotus flowers, and his body had the ox-head sandalwood odor.",
        "source": "T12n0384_007:1051b10_4"
    },
    {
        "source_sentence": "不長、不短、不白、不黑、不肥、不瘦具足女法。",
        "translation": "They are not tall, not short, not white, not black, not fat, not thin, and fully endowed with the female dharma.",
        "source": "T12n0384_007:1051b12_5"
    },
    {
        "source_sentence": "時釋提桓因內自思惟：『我今此宮天女眾多，顏貌端正諸天中勝，然不如彼阿須倫女。",
        "translation": "Śakra Devānām-Indra then thought to himself, 'Now that there are so many goddesses in this palace, I'm the best among the goddesses in appearance among goddesses, but it's not like those asuras.",
        "source": "T12n0384_007:1051b13_6"
    },
    {
        "source_sentence": "今我寧可集諸兵眾與彼共鬪，可得彼女給我使令。』",
        "translation": "Now, I'd better gather my troops and fight with them, so that they can get the woman to give me an order.'",
        "source": "T12n0384_007:1051b15_7"
    },
    {
        "source_sentence": "作是念已即召諸天論說鬪事。",
        "translation": "After he had this thought, he summoned the gods to discuss the matter of fighting.",
        "source": "T12n0384_007:1051b16_8"
    },
    {
        "source_sentence": "諸天白帝釋：『諸天鬪戰必不如彼，權可遣執樂神等，手執琉璃九十九絃琴及一絃琴，",
        "translation": "The gods said to Śakra, lord of the gods, “The heavenly gods will surely be at odds with each other in battle. They have the right to dispatch musicians holding ninety-nine stringed lute and one stringed lute made of lapis lazuli in their hands.",
        "source": "T12n0384_007:1051b17_9"
    },
    {
        "source_sentence": "歌歎我天受福快樂無量功德。』",
        "translation": "They sing praises to my gods for the immeasurable merit of merit and happiness that they receive.'",
        "source": "T12n0384_007:1051b19_10"
    },
    {
        "source_sentence": "諸天稱善此語可從。",
        "translation": "The gods praise it as good, and this is a word they can follow.",
        "source": "T12n0384_007:1051b19_11"
    },
    {
        "source_sentence": "即勅執樂天子般遮翼等嚴辦樂具，即於天上忽然不現，如有力士屈伸臂頃，",
        "translation": "He then ordered the celestial musician Pāṇḍikāputra to arrange his instruments of music and so forth, and he suddenly disappeared from heaven like a strong man bending his arm.",
        "source": "T12n0384_007:1051b20_12"
    },
    {
        "source_sentence": "已至阿須倫王婆呵前立。",
        "translation": "Having arrived there, the asuras stood in front of the king Vātsīputrīya.",
        "source": "T12n0384_007:1051b22_13"
    },
    {
        "source_sentence": "「『我是天帝釋，　　絕妙彈琴師；",
        "translation": "'I am Indra, the lord of gods, a most wonderful lute player.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　歌曲音相和，　　清淨聲極妙。",
        "translation": "The sounds of the songs are harmonious, With pure and sublime voices.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　如我彼天樂，　　無有憂畏想；",
        "translation": "Like the bliss of self and those gods, they have no thoughts of sorrow or fear.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　念則衣食至，　　七寶甘露珍。",
        "translation": "When he's mindful, his food and clothing arrive, which are the seven treasures of ambrosia.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　金銀床玉机，　　轉關身迴旋；",
        "translation": "Gold, silver, beds, jeweled tables, and cushions revolved in turn.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　視樂無厭足，　　天中尊第一。",
        "translation": "He is the best-looking among gods, never tiring of looking and enjoying pleasure.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　今遣我等來，　　欲說無諍行；",
        "translation": "Now you have sent us here, wanting to explain the practice of noncontention.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　并獻甘露食，　　求欲作婚姻。",
        "translation": "They also offered sweet food and begged to be married.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　我主彼宮殿，　　琦珍不可量；",
        "translation": "My lordship of that palace Is immeasurable in terms of its treasures.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　天女為眷屬，　　非千萬億數。",
        "translation": "The goddesses are their retinues, not thousands of myriadstical koṭis.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　知婆呵有女，　　應與我給使；",
        "translation": "Knowing that Vātsīputrīya had a woman, You should give her to me as your messenger.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　若不見與者，　　正爾兵眾征。』",
        "translation": "If someone doesn't see it and give it to them, they'll correctly send their troops on an expedition.'",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　須倫聞此語，　　瞋恚極熾盛：",
        "translation": "When the Sūrya heard these words, his anger became so intense that he said,",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　『小物興大意，　　乃欲有所為。",
        "translation": "'When small things give rise to great intentions, they want something to do.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　我雖無甘露，　　豫以自充飽；",
        "translation": "Although I do not have the ambrosia of immortality, I am prepared to satisfy myself with it.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "　　亦有大兵眾，　　足得相距逆。』",
        "translation": "There's also a large army of soldiers whose feet can distance themselves from each other.'",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "彈琴出聲作如是頌：「爾時，般遮翼等聞此語已即還，以此語具向天帝釋說。",
        "translation": "He played his lute and composed the following verse: At that time, after hearing these words, Paranirmita-vaśavartin and others returned. They spoke these words to Śakra Devānām-Indra in detail.",
        "source": "T12n0384_007:1051b22_14"
    },
    {
        "source_sentence": "時婆呵阿須倫王，即勅左右促集兵眾：『吾有所伐，正爾令辦各勿有疑。』",
        "translation": "Bhagavān, the king of the asuras, then commanded his left and right to gather an army of troops, saying, 'I've conquered something, so please don't have any doubts about it.'",
        "source": "T12n0384_007:1051c12_15"
    },
    {
        "source_sentence": "「『豪貴天帝釋，　　遣使般遮翼；",
        "translation": "Śakra Devānām-Indra, the ruler of the powerful gods, sent an envoy to cover his wing.",
        "source": "T12n0384_007:1051c13_16"
    },
    {
        "source_sentence": "　　歌頌出五音，　　求我為婚姻。",
        "translation": "They sing a verse in five tones, requesting me to marry them.",
        "source": "T12n0384_007:1051c13_16"
    },
    {
        "source_sentence": "　　及彼未集兵，　　我宜先集眾；",
        "translation": "And those who have not yet assembled their troops, I should first assemble the assembly.",
        "source": "T12n0384_007:1051c13_16"
    },
    {
        "source_sentence": "　　往攻不用力，　　萬得不一失。』",
        "translation": "They won't use their strength to attack, and nothing is gained or lost in ten thousand ways.'",
        "source": "T12n0384_007:1051c13_16"
    },
    {
        "source_sentence": "即以此偈向所勅說：「時彼阿須倫臣佐，聞此教已即集四兵，往詣須彌山腹，",
        "translation": "He then addressed the emperor with these verses and said to him, When those asuras heard this teaching, he gathered his four armies together and went to the foothills of Mount Sumeru.",
        "source": "T12n0384_007:1051c13_16"
    },
    {
        "source_sentence": "壞曲脚天宮，次壞風天宮，次壞馬天宮，次壞莊嚴天宮。",
        "translation": "They destroyed the palace of the curved-legged gods, the palace of the wind gods, the palace of the horse gods, and the palace of the adorned gods.",
        "source": "T12n0384_007:1051c20_17"
    },
    {
        "source_sentence": "時有天子名曰大力，詣釋提桓因所：『天王！",
        "translation": "A celestial being named Vaiśravaṇa then went to Śakra Devānām-Indra and said, 'O king of gods!",
        "source": "T12n0384_007:1051c21_18"
    },
    {
        "source_sentence": "當知阿須倫婆呵集諸兵眾，已壞四門天子。",
        "translation": "You should know that the asuras gathered their troops and destroyed the four-pronged celestial beings.",
        "source": "T12n0384_007:1051c22_19"
    },
    {
        "source_sentence": "天王！",
        "translation": "O king of gods!",
        "source": "T12n0384_007:1051c23_20"
    },
    {
        "source_sentence": "今欲如何？』",
        "translation": "What do you want now?'",
        "source": "T12n0384_007:1051c23_21"
    },
    {
        "source_sentence": "「『諸佛威神力，　　救護我今厄；",
        "translation": "'The buddhas' authoritative spiritual powers Will rescue me from this trouble.",
        "source": "T12n0384_007:1051c23_22"
    },
    {
        "source_sentence": "　　忍慧破恚怒，　　解脫安隱處。",
        "translation": "Patience and wisdom break through lust and anger, And liberation is the peaceful abode.",
        "source": "T12n0384_007:1051c23_22"
    },
    {
        "source_sentence": "　　昔我無睡眠，　　昨日忽眠寐；",
        "translation": "In the past I did not sleep, but suddenly fell asleep yesterday.",
        "source": "T12n0384_007:1051c23_22"
    },
    {
        "source_sentence": "　　此睡非吉祥，　　須倫侵我境。』",
        "translation": "This drowsiness isn't auspicious, and the lord of the gods attacked my object.'",
        "source": "T12n0384_007:1051c23_22"
    },
    {
        "source_sentence": "時天帝釋憶本所誦，口說頌曰：「爾時，天帝釋憶佛功德，須倫兵眾漸漸却退，",
        "translation": "Śakra, lord of the gods, remembered what he had recited in the past and uttered these verses: At that time, Sakka, lord of the gods, remembering the virtues of the Buddha, gradually withdrew the armies of the Trāyastriṃśa gods.",
        "source": "T12n0384_007:1051c23_22"
    },
    {
        "source_sentence": "從四門後園入池水中藕莖糸孔中藏。",
        "translation": "From the garden behind the four gates, he entered the lotus root's stem and thread hole in the water of the pond.",
        "source": "T12n0384_007:1052a01_0"
    },
    {
        "source_sentence": "時釋提桓因即勅大臣：『汝速集兵眾，吾欲逐阿須倫兵眾。』",
        "translation": "Śakra Devānām-Indra then commanded his ministers, 'Quickly gather an army of soldiers, and I want to drive the army of asuras away.'",
        "source": "T12n0384_007:1052a01_1"
    },
    {
        "source_sentence": "爾時帝釋諸臣受天王教，即集天眾從四門求覓，但見刀鎧弓箭在地，不見須倫眾。",
        "translation": "At the time, Indra's ministers were instructed by the king of gods, so they gathered a multitude of gods to search through the four gates and saw only swords, armor, bows, and arrows on the ground, but they didn't see the Sūrya people.",
        "source": "T12n0384_007:1052a03_2"
    },
    {
        "source_sentence": "轉轉前進直入阿須倫宮殿，見婆呵阿須倫女數千萬眾，不見阿須倫身，",
        "translation": "They proceeded one after another and entered directly into the palace of the asuras. Seeing hundreds of thousands of myriads of koṭis of śrāmaṇerīs, they did not see the body of the asuras.",
        "source": "T12n0384_007:1052a05_3"
    },
    {
        "source_sentence": "將諸女眾歸詣忉利天宮。",
        "translation": "He led the women back to the palace of Trāyastriṃśa gods.",
        "source": "T12n0384_007:1052a06_4"
    },
    {
        "source_sentence": "時諸阿須倫等，求哀歸命向釋提桓因：『我等愚惑，不知佛弟子神力巍巍如是，",
        "translation": "The asuras then said to Śakra, lord of the gods, “We are ignorant and do not know that the disciples of the Buddha have such a great  splendor.",
        "source": "T12n0384_007:1052a07_5"
    },
    {
        "source_sentence": "我等先祖信奉如來，聞佛有戒不取他物。",
        "translation": "We ancestors believed in the Tathāgata and heard that the Buddha had precepts, so we didn't take anything else.",
        "source": "T12n0384_007:1052a09_6"
    },
    {
        "source_sentence": "今天王釋，將我眷屬盡填天宮，非佛弟子所行法則。』",
        "translation": "Today, the king of Śākyamuni will fill up the heavenly palace with my retinue, which isn't the Dharma practiced by a disciple of the Buddha.'",
        "source": "T12n0384_007:1052a10_7"
    },
    {
        "source_sentence": "「帝釋聞之悵然不樂：『須倫此語，證我犯不與取戒，我寧當奉禁不犯偷盜。』",
        "translation": "When Indra heard this, he was disheartened and unhappy, saying, 'These words of the lord of the gods prove that I've violated the precepts and won't receive them, so I'd rather be disciplined and forbidden from stealing.'",
        "source": "T12n0384_007:1052a11_8"
    },
    {
        "source_sentence": "即還諸女。",
        "translation": "He then returned to the women.",
        "source": "T12n0384_007:1052a12_9"
    },
    {
        "source_sentence": "爾時阿須倫王，即以最所敬女奉天帝釋；",
        "translation": "It was then that the king of the asuras presented Indra, ruler of heaven, with his most honorable queen.",
        "source": "T12n0384_007:1052a13_10"
    },
    {
        "source_sentence": "天帝釋，即以美甘露與須倫。",
        "translation": "Śakra Devānām-Indra then gave it to Sūrya with sweet ambrosia.",
        "source": "T12n0384_007:1052a14_11"
    },
    {
        "source_sentence": "須倫與天和合共修行善，不殺、不盜、不婬、不欺、不飲酒、不香花脂粉、非時不食，",
        "translation": "The Sūrya and the gods harmoniously cultivate goodness together, not killing, not stealing, not engaging in sexual misconduct, not telling lies, not drinking alcohol, not smelling fragrant flowers, not ingesting fat or powder, and not eating at forbidden times.",
        "source": "T12n0384_007:1052a14_12"
    },
    {
        "source_sentence": "奉持如來三歸依法。",
        "translation": "They uphold the three refuges of the Tathāgata and follow the Dharma.",
        "source": "T12n0384_007:1052a16_13"
    },
    {
        "source_sentence": "「吾昔所行無數生中作轉輪聖王，無數生中作天帝釋，無數生中作梵天王。",
        "translation": "In my past actions, I became the wheel-turning sage king in countless births, Indra in countless births, and Brahmā in countless births.",
        "source": "T12n0384_007:1052a17_14"
    },
    {
        "source_sentence": "奉持賢聖八關齋法度難救厄，設四天下滿中火焰譬如劫燒，一心歸命稱如來名，",
        "translation": "He observed the eight precepts of goodness and holiness, saved those who were hard to save from difficulties and distress, set four continents in the midst of a great conflagration like an eon of fire, and called on the name of the Tathāgata with one-pointed dedication of life.",
        "source": "T12n0384_007:1052a18_15"
    },
    {
        "source_sentence": "持八關齋法投身入火焰不能燒，若滿中水水不能溺，八關齋者諸佛父母。」",
        "translation": "When he observes the eight precepts, he throws himself into a flame that won't burn him; if he fills it with water and doesn't drown it, the eight precepts are for the parents of the buddhas.",
        "source": "T12n0384_007:1052a20_16"
    },
    {
        "source_sentence": "菩薩處胎經緊陀羅品第三十",
        "translation": "Chapter 30 of the Kiṃnara Chapter of the Sutra on the Bodhisattva's Birth in the Womb",
        "source": "T12n0384_007:1052a23_0"
    },
    {
        "source_sentence": "爾時，座中有菩薩名曰信解脫，過去無央數阿僧祇劫為緊陀羅王，須彌山北過琉璃山，",
        "translation": "At the time, there was a bodhisattva in his seat named Faithful Deliverance who had been king of kiṃnara for measureless and incalculably long eons past, passing beyond Mount Sumeru to the north of Mount Sumeru.",
        "source": "T12n0384_007:1052a24_0"
    },
    {
        "source_sentence": "琉璃山北過小鐵圍山，鐵圍山北有大黑山，緊陀羅王在中治化。",
        "translation": "To the north of Mount Lapis is a small ring of iron, and to the north of that ring of iron is a large black mountain in which King Kiṃnara governs.",
        "source": "T12n0384_007:1052a26_0"
    },
    {
        "source_sentence": "過去無數恒沙諸佛，亦不覩見亦不聞法，亦無有聖眾教化，無日、月、星辰光明所照。",
        "translation": "In the past there were innumerable buddhas as numerous as the grains of sand in the Ganges River, who neither saw nor heard the Dharma. There were no holy beings to teach and edify them, and there was no sun, moon, or starlight shining on them.",
        "source": "T12n0384_007:1052a27_1"
    },
    {
        "source_sentence": "由昔積福一施之報，居在七寶宮殿壽命極長。",
        "translation": "Because of the merit accumulated in the past as a result of one act of giving, he stayed in the palace of the seven treasures for an extremely long life span.",
        "source": "T12n0384_007:1052a29_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1052b01_3"
    },
    {
        "source_sentence": "本在人間值遇良田，有大長者造佛塔廟。",
        "translation": "Formerly when he was living among the people, he happened to meet a good land where there was a great elder who built a stūpa and temple for the Buddha.",
        "source": "T12n0384_007:1052b01_4"
    },
    {
        "source_sentence": "此緊陀羅布施一剎柱成辦廟寺，復以淨食施彼工匠，壽終命盡作胸臆神王，",
        "translation": "This kiṃnara gave a pillar of one bhūmi to make a temple, and again he gave it to the artisan with pure food. At the end of his life, he became the chest-heaven spirit king.",
        "source": "T12n0384_007:1052b02_5"
    },
    {
        "source_sentence": "在兩山中間，自然七寶宮殿屋舍。",
        "translation": "Between the two mountains, there are naturally seven-jeweled palaces and dwellings.",
        "source": "T12n0384_007:1052b04_6"
    },
    {
        "source_sentence": "昔在人間居財無量，有一沙門中時持鉢乞食，婦見沙門在門乞食，即擎飯施與。",
        "translation": "Once, when he was living among the people with immeasurable wealth and possessions, there was an ascetic who used to carry a bowl in his mouth to solicit alms. When the woman saw the ascetic at the door to solicit alms, she offered him food.",
        "source": "T12n0384_007:1052b05_7"
    },
    {
        "source_sentence": "長者見婦與沙門食，即便瞋恚：「此何乞人瞻視我婦，當令此人手脚破壞。」",
        "translation": "Seeing the woman and the ascetic's food, the elder became angry, Why is this beggar looking at my wife? He will cause her hands and feet to break down.",
        "source": "T12n0384_007:1052b06_8"
    },
    {
        "source_sentence": "壽終之後受此醜形，八十四劫恒無手足。",
        "translation": "After his life ends, he'll experience this ugly form for eighty-four eons without arms or legs.",
        "source": "T12n0384_007:1052b08_9"
    },
    {
        "source_sentence": "在人間時學仙人法在深山中，誦習呪術能移動日月，以夜為晝以晝為夜，",
        "translation": "When he was among the people, he studied the teachings of the holy man deep in the mountains. He recited dhāraṇī spells and could move the sun and moon by day and night.",
        "source": "T12n0384_007:1052b09_10"
    },
    {
        "source_sentence": "呼吸之頃能吐出金銀七寶，能使枯樹悉生枝、葉、花、果，能使海水消竭，",
        "translation": "When he breathes, he can spit out the seven treasures of gold and silver. He can cause withered trees to give forth branches, leaves, flowers, and fruits, and he can cause the water in the ocean to evaporate.",
        "source": "T12n0384_007:1052b11_11"
    },
    {
        "source_sentence": "在火不燒，身能飛行，眼能徹視自識宿命，知他人心，耳遠聞聲，眷屬弟子五百人。",
        "translation": "When the fire isn't burned, his body can fly, his eyes can penetrate and see their own past lives, know the minds of others, and his ears can hear sounds from afar. He has five hundred disciples in his retinue.",
        "source": "T12n0384_007:1052b12_12"
    },
    {
        "source_sentence": "聞佛出世，佛名清淨光如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "When he heard that the Buddha had appeared in the world, the Buddha’s name was Vimalakīrti-nirdeśa Tathāgata, Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Unsurpassed, Tamer of Humans, Teacher of Devas and Humans,",
        "source": "T12n0384_007:1052b14_13"
    },
    {
        "source_sentence": "說微妙法初、中、竟善，大慈平等功勳難量。",
        "translation": "He teaches the subtle teaching that the first, middle, and final good qualities of the Dharma are equal to great compassion, and its merit is immeasurable.",
        "source": "T12n0384_007:1052b16_14"
    },
    {
        "source_sentence": "我將諸弟子從深山出，飛行經過王宮後園浴池，見諸采女在池洗浴。",
        "translation": "I took my disciples out of the deep mountain and flew past the park behind the royal palace to bathe in the pond, where I saw the nymphs bathing in the pond.",
        "source": "T12n0384_007:1052b17_15"
    },
    {
        "source_sentence": "我及弟子，下見婦女生染愛心，皆失神足即墮園中。",
        "translation": "When I and my disciples saw women with defiled cravings, they all lost their spiritual legs and fell into the garden.",
        "source": "T12n0384_007:1052b19_16"
    },
    {
        "source_sentence": "時我瞋恚故來求佛，失我神足。",
        "translation": "Because of my anger, I came to seek the Buddha and lost my spiritual legs.",
        "source": "T12n0384_007:1052b20_17"
    },
    {
        "source_sentence": "時采女眾見五百丈夫盡在園中，尋入白王，王勅左右：「將彼人來，我欲問之。」",
        "translation": "Seeing that the five hundred men were all in the park, the nymphs went into the king's court and told him to his aides, Bring them here; I want to question them.",
        "source": "T12n0384_007:1052b21_18"
    },
    {
        "source_sentence": "尋將詣王。",
        "translation": "He was about to go to the king.",
        "source": "T12n0384_007:1052b23_19"
    },
    {
        "source_sentence": "王問言：「卿等何人？」",
        "translation": "The king asked, Who are you?",
        "source": "T12n0384_007:1052b23_20"
    },
    {
        "source_sentence": "答曰：「我等在山學仙道人，山中誦習呪術，能移動日月，以夜為晝以晝為夜，",
        "translation": "They replied, “We are here in the mountains. We are holy men of the Way. In the mountains we recite dhāraṇī spells that move the sun and moon, making the night into day and the day into night.",
        "source": "T12n0384_007:1052b23_21"
    },
    {
        "source_sentence": "乃至耳遠聞聲，眷屬弟子五百人。",
        "translation": "Even his ears heard the sound from a distance, and he had five hundred disciples as his retinue.",
        "source": "T12n0384_007:1052b25_22"
    },
    {
        "source_sentence": "聞佛出世佛名清淨光，我將諸弟子從深山出，飛行經過王宮後園浴池，",
        "translation": "When I heard that the Buddha was a transmundane buddha named Pure Light, I flew out of the deep mountains with my disciples and went to the bathing pond behind the royal palace.",
        "source": "T12n0384_007:1052b26_23"
    },
    {
        "source_sentence": "見諸采女在池洗浴。",
        "translation": "He saw the nymphs bathing in the pond.",
        "source": "T12n0384_007:1052b27_24"
    },
    {
        "source_sentence": "我及弟子，下見婦女生染愛心，皆失神足即墮園中。」",
        "translation": "When I and my disciples saw women with defiled cravings, they all lost their spiritual legs and fell into the garden.",
        "source": "T12n0384_007:1052b28_25"
    },
    {
        "source_sentence": "時王告之曰：「汝等在深山學仙道來為久近耶？」",
        "translation": "The king then told him, Have you been studying the Way for a long time while in the deep mountains?",
        "source": "T12n0384_007:1052b29_26"
    },
    {
        "source_sentence": "答曰：「二十二小劫。」",
        "translation": "He answered, Twenty-two minor eons.",
        "source": "T12n0384_007:1052c01_27"
    },
    {
        "source_sentence": "王復問曰：「積劫學道心如死灰不動不搖，云何欲心而失神足？」",
        "translation": "The king again asked, For many eons, the mind of training in the path is like dead ashes that don't move or shake, so why does it lose its miraculous powers when it wants to do so?",
        "source": "T12n0384_007:1052c02_0"
    },
    {
        "source_sentence": "答曰：「本謂真道神靈第一，踊沒自在所念皆成。",
        "translation": "He answered, It's originally said that the true path is the first in terms of spirituality and spirit, and whatever he thinks freely after rising up and down is accomplished.",
        "source": "T12n0384_007:1052c03_1"
    },
    {
        "source_sentence": "不圖今日忽然失道，慚愧聖王隨王刑罰。」",
        "translation": "Today, I won't want to suddenly lose my way, and I'm ashamed that the noble king will follow the king's punishment.",
        "source": "T12n0384_007:1052c04_2"
    },
    {
        "source_sentence": "王告之曰：「汝本學道二十二小劫，形枯心疲所習不真，如愚惑人空中求寶，",
        "translation": "The king said to them, “You have studied the Way for twenty-two intermediate aeons. Formerly you were physically withered and exhausted, but what you practiced is not true. You are like a fool who deluded others into seeking treasure in the sky.",
        "source": "T12n0384_007:1052c05_3"
    },
    {
        "source_sentence": "於真際法不獲實相。",
        "translation": "At the true end, the Dharma doesn't obtain its true characteristics.",
        "source": "T12n0384_007:1052c07_4"
    },
    {
        "source_sentence": "汝所求師如來等正覺者，近在岳跱山中。",
        "translation": "The teacher you seek, the Tathāgata and other perfectly enlightened ones, is nearby on Mount Yuezha.",
        "source": "T12n0384_007:1052c07_5"
    },
    {
        "source_sentence": "我當將汝等往至佛所，若佛有所說當奉行之。」",
        "translation": "I'll take you to the Buddha, and if he teaches anything, I'll follow it.",
        "source": "T12n0384_007:1052c08_6"
    },
    {
        "source_sentence": "爾時大王，即嚴駕羽寶之車具五威儀，將諸眷屬及五百仙學人等，往詣岳跱山。",
        "translation": "It was then that the great king prepared a carriage of feathers and jewels, equipped with five comportments, and led his retinues and 500 sages and trainees to Mount Yuecheng.",
        "source": "T12n0384_007:1052c09_7"
    },
    {
        "source_sentence": "王即下車解劍去蓋，却五威儀步至佛所，頭面禮足在一面坐。",
        "translation": "The king immediately descended from his chariot, dismounted, dismounted with his sword, and departed the canopy. He came to the place where the Buddha was staying at one side after having saluted him by bowing his forehead and feet.",
        "source": "T12n0384_007:1052c11_8"
    },
    {
        "source_sentence": "爾時國王須臾退坐，前白佛言：「此五百人，在山學仙二十二小劫，聞佛出世欲來見佛，",
        "translation": "The king of that country then withdrew and sat down for a moment. He said to the Buddha: During the twenty-two intermediate kalpas, those five hundred śramaṇas and brāhmaṇas who had studied in the mountains heard that the Buddha had appeared in the world and wished to see him.",
        "source": "T12n0384_007:1052c12_9"
    },
    {
        "source_sentence": "飛過後宮貪著欲愛即失神足。",
        "translation": "When he flew past the rear palace, he became addicted to desire and lost his supernormal powers.",
        "source": "T12n0384_007:1052c14_10"
    },
    {
        "source_sentence": "唯願世尊，與說微妙之法，當令還復五神通道。」",
        "translation": "Please, Bhagavān, teach me the subtle Dharma and cause me to return to the five divine paths.",
        "source": "T12n0384_007:1052c15_11"
    },
    {
        "source_sentence": "佛告大王：「此五百人所行善根，成便壞敗終不究竟，本為長者，比丘乞食瞋恚言：『使汝無手足。』",
        "translation": "The Buddha told the great king, These five hundred people's good roots of practice are accomplished and then disintegrate but don't end. Originally, they were elders, and the monks begged for food with anger, saying, 'Have you no hands or feet?'",
        "source": "T12n0384_007:1052c16_12"
    },
    {
        "source_sentence": "無數劫中作胸臆神王，在大鐵圍黑山中間，雖復受報日月所不照，先在人間以剎柱施人。",
        "translation": "In countless eons, he's the king of the mind-conceiving spirit, which is in the middle of a great iron mountain surrounded by black mountains, even though it's not illuminated by the sun and moon when retribution is received, and he first gives them to someone with a pillar of blazing earth among humans.",
        "source": "T12n0384_007:1052c18_13"
    },
    {
        "source_sentence": "以一施之惠與辟支佛，後得人身於山中學仙，欲心熾盛還失神足，此緣久有非適今也。",
        "translation": "With the benefit of one donation, he gave it to the pratyekabuddha and later attained a human body as an immortal in a mountain school, but his desires became so strong that he lost his spiritual legs, which is why this condition hadn't been appropriate for the present for a long time.",
        "source": "T12n0384_007:1052c20_14"
    },
    {
        "source_sentence": "此五百人於今世命終，皆當生無怒佛所，彼佛與說生老病死十二因緣。",
        "translation": "When these five hundred people die in this world, they'll all be born at the place where the Buddha Wuwang lives, and that Buddha will explain the twelve causes of birth, old age, illness, and death to them.",
        "source": "T12n0384_007:1052c22_15"
    },
    {
        "source_sentence": "苦無苦、本集、滅、道果。",
        "translation": "Suffering has no suffering, the originally arisen, cessation, and the fruit of the path.",
        "source": "T12n0384_007:1052c24_16"
    },
    {
        "source_sentence": "亦復如是。」",
        "translation": "It's likewise.",
        "source": "T12n0384_007:1052c25_0"
    },
    {
        "source_sentence": "佛說是時王意開解，亦樂欲生無怒佛所。",
        "translation": "When the Buddha said this, the king's mind was enlightened and he also wanted to be born in the place of the Buddha who had no anger.",
        "source": "T12n0384_007:1052c25_1"
    },
    {
        "source_sentence": "爾時國王及五百仙人，即從座起禮佛而去。",
        "translation": "The king of that country and the five hundred sages then rose from their seats, bowed to the Buddha, and departed.",
        "source": "T12n0384_007:1052c26_2"
    },
    {
        "source_sentence": "菩薩處胎經香音神品第三十一",
        "translation": "Chapter 31 of the Sutra on the Bodhisattva's Birth in the Womb: The God of Fragrance and Sound",
        "source": "T12n0384_007:1052c28_0"
    },
    {
        "source_sentence": "爾時世尊知諸眾會心中所念，便入定意無形三昧，隨眾生音而濟度之。",
        "translation": "Knowing what was thought in the minds of the assembly, the Bhagavān then entered mental concentration without form samādhi and rescued them according to the sounds of sentient beings.",
        "source": "T12n0384_007:1052c29_0"
    },
    {
        "source_sentence": "「昔我人間為香音神，王一閻浮提、二閻浮提，乃至無數恒沙閻浮提。",
        "translation": "In the past, we humans were the spirits of fragrance and sound, who ruled over one Jambudvīpa, two Jambudvīpa, up to an incalculably long number of Jambudvīpa.",
        "source": "T12n0384_007:1053a01_1"
    },
    {
        "source_sentence": "男、女眷屬以香為食，衣被服飾皆悉香熏，或生北方欝單曰土、拘耶尼、弗于逮，",
        "translation": "The male and female members of the royal clan take fragrance as food, and their clothing and bedding are all perfumed with fragrance. Some may be born in Uttarakuru, Kauśinagara, or Puṇḍarīka in the north.",
        "source": "T12n0384_007:1053a03_2"
    },
    {
        "source_sentence": "在在所生為香音王，或壽一劫、二劫、三劫，乃至無數阿僧祇劫。",
        "translation": "Where it's produced, it's the king of fragrance and sound, which may have a life span of one eon, two eons, three eons, or countless incalculably long eons.",
        "source": "T12n0384_007:1053a05_0"
    },
    {
        "source_sentence": "知有佛、有法、有比丘僧，心常遠離而不親近。",
        "translation": "Knowing that there are buddhas, dharmas, and monks and nuns, their minds are always far removed from them and don't become intimate with them.",
        "source": "T12n0384_007:1053a06_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1053a07_2"
    },
    {
        "source_sentence": "貪著五樂以善香為樂，於善香中不聞餘音，但聞五欲歌歎戲樂，終日竟夜不知厭足。",
        "translation": "They crave the five pleasures and make good fragrance their pleasure, don't hear any other sounds in good fragrance, only hear the five desires singing and praising playfulness, and don't tire of it day and night.",
        "source": "T12n0384_007:1053a07_3"
    },
    {
        "source_sentence": "有善知識昔修善根，從地踊出半身人現，而告我言：『此處樂耶？",
        "translation": "A good friend who had cultivated the roots of goodness in the past emerged from the earth, half a body long, and said to me, 'Is this place pleasant?'",
        "source": "T12n0384_007:1053a09_4"
    },
    {
        "source_sentence": "何為貪著？",
        "translation": "What's craving and attachment?",
        "source": "T12n0384_007:1053a10_5"
    },
    {
        "source_sentence": "此非真實清淨之行，除去香熏可得安隱處，此香為災、為幻、為化。",
        "translation": "This is not a true and pure practice that removes fragrance and can attain a peaceful place, and this fragrance is disastrous, illusory, and transformative.",
        "source": "T12n0384_007:1053a11_6"
    },
    {
        "source_sentence": "今佛在世可往受教，得清淨香遍滿諸方。』",
        "translation": "Now that the Buddha is in the world, you can go and receive his teachings, and he'll attain a pure fragrance that fills all directions.'",
        "source": "T12n0384_007:1053a12_7"
    },
    {
        "source_sentence": "香音神王聞之極大歡喜：『善哉，善哉！",
        "translation": "The divine king Instinct Sound of Fragrance heard this and was overjoyed, saying, 'Good, good!",
        "source": "T12n0384_007:1053a13_8"
    },
    {
        "source_sentence": "善知識！",
        "translation": "Good friend!",
        "source": "T12n0384_007:1053a14_9"
    },
    {
        "source_sentence": "欲導引我示清淨香，今正是時。",
        "translation": "Now is the right time for you to guide me and show me a pure fragrance.",
        "source": "T12n0384_007:1053a14_10"
    },
    {
        "source_sentence": "佛為所在？",
        "translation": "Where is the Buddha?",
        "source": "T12n0384_007:1053a15_11"
    },
    {
        "source_sentence": "共往禮拜。』",
        "translation": "Together, we'll go and venerate him.'",
        "source": "T12n0384_007:1053a15_12"
    },
    {
        "source_sentence": "「『如來無所著，　　今在南方界；",
        "translation": "The Tathāgata is not attached to anything. He now lives in the southern boundary.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　在胎清淨觀，　　眷屬無央數。",
        "translation": "The pure contemplation in the womb has Immeasurable retinues.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　燒諸眾妙香，　　懸繒花蓋幡，",
        "translation": "They burn all kinds of exquisite incense, Hanging silhouetted flower canopies and banners.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　供養如恒沙。　　戒德甚深香，",
        "translation": "The offerings are as numerous as the grains of sand in the Ganges River, with a profound fragrance of virtue and morality.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　遍滿十方界，　　其有聞香者，",
        "translation": "Pervading all worlds in the ten directions, Those who hear the fragrance",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　盡得無上道。　　汝可將眷屬，",
        "translation": "You will attain the highest path.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　往到閻浮提，　　一心歸依尊，",
        "translation": "They go to Jambudvfpa, singlemindedly relying on the honored one.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　當自面見佛。　　佛德無邊岸，",
        "translation": "You should see the Buddha facing your own face; The virtues of buddhahood are boundless.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　各隨本所行，　　一聞三句義，",
        "translation": "Each one, according to his original practice, He hears the meaning of three phrases.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　成道不移坐。　　三空慧定力，",
        "translation": "He accomplishes enlightenment without moving his seat.’” The power of the absorptions of emptiness, wisdom, and meditation is like this:",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　十八不共法，　　大人相好具，",
        "translation": "The eighteen unique qualities are the features of great beings.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　汝後必獲之。　　紫磨金色體，",
        "translation": "You will surely obtain it later, with a purplish-gold body.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　軟細不受塵，　　法身智慧定，",
        "translation": "Subtle and subtle, they don’t accept objects; The Dharma body is the concentration of knowledge and wisdom.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　汝當悉具得。　　到彼勿懷懼，",
        "translation": "When you go there, do not be afraid.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　正心莫生疑，　　勇猛不怯弱，",
        "translation": "Don’t give rise to doubt in the right mind; Be courageous and not faint-hearted.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　便逮師子步。　　分別身心觀，",
        "translation": "He then took the steps of a lion and discerned his body and mind.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　悉解空自然，　　眼識無色本，",
        "translation": "Understanding emptiness naturally, the eye and consciousness are formless in essence.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　除對不造垢。　　當行三法門，",
        "translation": "You should practice the three kinds of doctrine:",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　現、後及中間，　　獲淨三通慧，",
        "translation": "In the present, in the future, and in the intermediate one, they attain the pure wisdom of the three supernormal knowledges.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　總持無礙法。　　無常無樂想，",
        "translation": "They preserve unhindered dharmas in all their aspects; they are impermanent, without ideation of pleasure.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　劫數造不善，　　慧火彈指燒；",
        "translation": "Countless eons have been spent doing unwholesome deeds, burning their fingers with the fire of wisdom.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　金、銀寶、琉璃，　　須彌四寶成；",
        "translation": "The jewels of gold, silver, and lapis lazuli Are made of the four treasures of Sumeru.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　劫燒火所焚，　　行報不可滅。",
        "translation": "A kalpa is burned by fire, and the results of actions can't be extinguished.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　如來在世化，　　愍彼不為己。",
        "translation": "The Tathāgata is in the world to teach, but he pitys them and doesn't do it himself.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　處處在在生，　　盡緣縛著人，",
        "translation": "Everywhere, everywhere, in birth, They are bound to all conditioned things.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　如人射虛空，　　箭窮還到地。",
        "translation": "It's like a person who shoots through space and returns to the ground with an arrow that reaches its end.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　供養諸福田，　　不選必賢聖；",
        "translation": "To make offerings to the field of blessings, One should choose no one but the wise and holy.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　亦如服毒藥，　　處處求解具，",
        "translation": "It's also like taking a poisonous medicine and seeking the means of understanding everywhere.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　毒氣轉隆盛，　　命終亦不久。",
        "translation": "The poisonous energy grows and flourishes, and so soon his life ends.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　宿有善知識，　　授以解藥具；",
        "translation": "In the past a good friend taught him the medicine for relieving poison.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　次第不選擇，　　會值解藥法。",
        "translation": "They don't discriminate in order, and they meet to understand the teaching of the medicine.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　行施作福業，　　不選擇高下；",
        "translation": "They perform meritorious acts of giving, Yet they do not choose high or low.",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "　　此福聖所譽，　　最尊為第一。』",
        "translation": "This merit is praised by sages, the most honored and the best.'",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "爾時踊出地神，即以偈告香音神曰：「時香音神王，聞踊出地神語，心開意解五體投地：『汝為我師化我童矇，",
        "translation": "At that moment, the earth goddess Daosun spoke these verses to the heavenly king Gandhamādana in verse:",
        "source": "T12n0384_007:1053a15_13"
    },
    {
        "source_sentence": "我今愚惑不別真偽，受我悔過如癡如愚。』",
        "translation": "Now, I'm foolish and confused, not distinguishing between true and false, and feeling my repentance is like delusion and folly.'",
        "source": "T12n0384_007:1053b22_14"
    },
    {
        "source_sentence": "爾時，地神即從地踊出，現佛金色身，三十二相放大光明，以神足力接香音神至於胎觀，",
        "translation": "At that moment, the earth goddess emerged from the earth and manifested the golden body of the Buddha. Her thirty-two marks emitted great rays of light. By means of spiritual power she connected the spirit Fragrant Sound with the contemplation on the mother’s womb.",
        "source": "T12n0384_007:1053b23_15"
    },
    {
        "source_sentence": "彼諸會眾無覺知者。",
        "translation": "Those in the assembly have no perception or cognition.",
        "source": "T12n0384_007:1053b25_16"
    },
    {
        "source_sentence": "佛告諸來會者：『吾從無數阿僧祇劫，能大、能小入細無礙，或在天上劫數教化，",
        "translation": "“The Buddha said to those who had gathered in the assembly: For countless eons I have been able to teach and inspire people without hindrance, whether they are small or great, for as many eons as there are living beings in heaven.",
        "source": "T12n0384_007:1053b26_0"
    },
    {
        "source_sentence": "或在人中代彼受苦，或在畜生、餓鬼、地獄，分身教化無所不入。』",
        "translation": "Perhaps they're among humans who experience suffering on their behalf, or they're in animals, hungry ghosts, or hells, and there's nothing that they can't enter into to teach and transform themselves.'",
        "source": "T12n0384_007:1053b27_1"
    },
    {
        "source_sentence": "時香音神王，及七十二億眷屬，尋發無上住不退地。」",
        "translation": "The divine king of the sound of fragrance and his 7,200 million retinues then aroused the unsurpassed abode of nonretrogression.",
        "source": "T12n0384_007:1053b29_2"
    },
    {
        "source_sentence": "菩薩處胎經地神品第三十二",
        "translation": "Chapter 32 of the Earth Gods of the Sutra on the Bodhisattva’s Birth in the Womb",
        "source": "T12n0384_007:1053c02_0"
    },
    {
        "source_sentence": "爾時，座中有菩薩名曰善業，即從座起偏露右臂右膝著地，叉手合掌前白佛言：「欲問所疑，",
        "translation": "At the time, there was a bodhisattva in his seat named Shanye. He rose from his seat, bared his right shoulder, knelt with his right knee on the ground, saluted him by joining his palms, and said to the Buddha:",
        "source": "T12n0384_007:1053c03_0"
    },
    {
        "source_sentence": "聽者敢說。」",
        "translation": "Those who hear it will dare to say it.",
        "source": "T12n0384_007:1053c05_1"
    },
    {
        "source_sentence": "佛告善業：「恣汝所問，吾當為汝一一分別。」",
        "translation": "The Buddha told Shanye, As long as you ask questions, I'll discern them one by one for you.",
        "source": "T12n0384_007:1053c05_2"
    },
    {
        "source_sentence": "善業白佛言：「云何，世尊！",
        "translation": "Sunetra said to the Buddha, Bhagavān!",
        "source": "T12n0384_007:1053c06_3"
    },
    {
        "source_sentence": "六大眾神何者為妙？",
        "translation": "What's the marvelous of the six great masses of gods?",
        "source": "T12n0384_007:1053c06_4"
    },
    {
        "source_sentence": "地、水、火、風、空、識耶？」",
        "translation": "What about earth, water, fire, wind, air, space, and consciousness?",
        "source": "T12n0384_007:1053c07_5"
    },
    {
        "source_sentence": "爾時世尊即以神足，令彼地神從地踊出在地界立，水神從水踊出水中立，",
        "translation": "At that time the World-honored One, using his supernormal power of travel, caused the earth goddess to emerge from the earth and stand on the earth realm; and the water goddess emerged from the water and stood in the water.",
        "source": "T12n0384_007:1053c07_6"
    },
    {
        "source_sentence": "火神從火踊出火中立，風神從風踊出風中立，空神從空踊出空中立，識神從識踊出識中立。",
        "translation": "The fire goddess emerges from the fire and is established in the fire; the wind goddess emerges from the wind and is established in the wind; the space goddess emerges from the sky and is established in the sky; and the consciousness goddess emerges from the consciousness and is established in the consciousness.",
        "source": "T12n0384_007:1053c09_7"
    },
    {
        "source_sentence": "佛告善業：「此六諸神汝自問之。」",
        "translation": "The Buddha told Shanye, These six gods, ask them yourself questions.",
        "source": "T12n0384_007:1053c11_8"
    },
    {
        "source_sentence": "善業菩薩即問地神：「於六大中汝為妙不？」",
        "translation": "The bodhisattva of good karma then asked the earth god, Are you marvelous among the six great beings?",
        "source": "T12n0384_007:1053c12_9"
    },
    {
        "source_sentence": "地神報言：「於六神中我為最勝。",
        "translation": "The earth gods replied, Among the six goddesses, I'm the most superior.",
        "source": "T12n0384_007:1053c13_10"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0384_007:1053c14_11"
    },
    {
        "source_sentence": "所生萬物山、河、石、壁、樹木、花果，皆依我住。",
        "translation": "All the mountains, rivers, rocks, walls, trees, flowers, and fruits that grow depend on me to live.",
        "source": "T12n0384_007:1053c14_12"
    },
    {
        "source_sentence": "一切眾生有形之類，依而得存，以是義故我為最妙。」",
        "translation": "All sentient beings with form exist based on their support, and because of this meaning, I'm the most marvelous.",
        "source": "T12n0384_007:1053c15_13"
    },
    {
        "source_sentence": "爾時，善業菩薩問水神曰：「汝於六神為最妙不？」",
        "translation": "It was then that the bodhisattva of good karma asked the water spirit, Are you the most marvelous among the six spirits?",
        "source": "T12n0384_007:1053c17_0"
    },
    {
        "source_sentence": "水神報言：「於六神中我為最勝。",
        "translation": "The water spirit replied, Among the six spirits, I'm the most superior.",
        "source": "T12n0384_007:1053c18_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0384_007:1053c18_2"
    },
    {
        "source_sentence": "若無水者，地為枯乾無有滋潤，草木、花果皆為枯燥，眾生之類有形之屬皆當渴死。",
        "translation": "If there's no water, the earth becomes withered and dry without nourishment, and grass, trees, flowers, and fruits all become withered and dry, and all kinds of sentient beings and forms will die of thirst.",
        "source": "T12n0384_007:1053c19_0"
    },
    {
        "source_sentence": "以是義故我為最勝。」",
        "translation": "Because of this meaning, I'm the most superior.",
        "source": "T12n0384_007:1053c20_1"
    },
    {
        "source_sentence": "爾時，善業菩薩次問火神：「六神之中汝為最勝不？」",
        "translation": "It was then that the bodhisattva of good karma next asked the fire deity, Are you the most superior among the six deities?",
        "source": "T12n0384_007:1053c21_2"
    },
    {
        "source_sentence": "火神報言：「於六神中我為最勝。",
        "translation": "The fire deity replied, Among the six deities, I'm the most superior.",
        "source": "T12n0384_007:1053c22_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0384_007:1053c23_4"
    },
    {
        "source_sentence": "若無火者，萬物滋長云何成熟。",
        "translation": "If there were no fire, how would all things grow and mature?",
        "source": "T12n0384_007:1053c23_5"
    },
    {
        "source_sentence": "若遇霜、雹、氷、寒、雷、電，一切眾生有形之類皆當凍死，以是義故我為最勝。」",
        "translation": "If they encounter frost, hail, ice, cold, thunder, and lightning, all sentient beings with form will be frozen and die; it's because of this that I'm the most superior.",
        "source": "T12n0384_007:1053c24_6"
    },
    {
        "source_sentence": "爾時，善業菩薩次問風神：「六神之中汝為妙不？」",
        "translation": "It was then that the bodhisattva of good karma next asked the wind god, Among the six goddesses, are you marvelous?",
        "source": "T12n0384_007:1053c25_7"
    },
    {
        "source_sentence": "風神答曰：「於六神中我為最妙。",
        "translation": "The wind god answered, Among the six goddesses, I'm the most marvelous.",
        "source": "T12n0384_007:1053c26_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0384_007:1053c27_9"
    },
    {
        "source_sentence": "若無風者，樹木、花果、根芽、莖節不得成熟，一切眾生有形之類，進止動搖皆是我風，",
        "translation": "If there's no wind, trees, flowers, fruits, roots, sprouts, and stems won't grow, and all sentient beings with form and movement are all my wind.",
        "source": "T12n0384_007:1053c27_10"
    },
    {
        "source_sentence": "以是義故我為最妙。」",
        "translation": "Because of this meaning, I'm the most wonderful.",
        "source": "T12n0384_007:1053c29_11"
    },
    {
        "source_sentence": "爾時，善業菩薩次問空神：「於六神中汝為妙不？」",
        "translation": "It was then that the bodhisattva of good karma next asked the god of emptiness, Are you marvelous among the six gods?",
        "source": "T12n0384_007:1054a01_12"
    },
    {
        "source_sentence": "空神報言：「於六神中我為最妙。",
        "translation": "The spirit of emptiness replied, Among the six spirits, I'm the most marvelous.",
        "source": "T12n0384_007:1054a02_13"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0384_007:1054a02_14"
    },
    {
        "source_sentence": "山河、石壁、樹木、花、果，一切萬物有形之類，行來進止我能含容，",
        "translation": "I can contain mountains, rivers, stone walls, trees, flowers, fruits, and all things shaped like form.",
        "source": "T12n0384_007:1054a03_15"
    },
    {
        "source_sentence": "使得調暢通達往來，以是義故我為最妙。」",
        "translation": "It's because I'm the most marvelous in terms of my ability to regulate and comprehend past and future, and for this reason I'm the most marvelous.",
        "source": "T12n0384_007:1054a04_16"
    },
    {
        "source_sentence": "爾時善業菩薩次問識神：「於六神中汝為妙不？」",
        "translation": "It was then that the bodhisattva of good karma asked the consciousness gods next, Are you marvelous among the six gods?",
        "source": "T12n0384_007:1054a05_17"
    },
    {
        "source_sentence": "識神答曰：「於六神中我為最妙。",
        "translation": "The consciousness deity answered, Among the six deities, I'm the most marvelous.",
        "source": "T12n0384_007:1054a06_18"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0384_007:1054a07_19"
    },
    {
        "source_sentence": "此五大神是我僕從我是其王，行來進止，若好、若醜，可避知避可就知就，",
        "translation": "“These great deities are my servants, and I am their king. Whether good or bad, they can be avoided or known to be avoided;",
        "source": "T12n0384_007:1054a07_20"
    },
    {
        "source_sentence": "彼皆盲冥我為眼目，以是義故我為最妙。」",
        "translation": "They're all blind and obscure me as the eye, and because of this meaning, I'm the most marvelous.",
        "source": "T12n0384_007:1054a09_21"
    },
    {
        "source_sentence": "爾時地神白善業菩薩言：「此事不然。",
        "translation": "It was then that the earth goddess said to the bodhisattva of good karma, This is not the case.",
        "source": "T12n0384_007:1054a10_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1054a10_23"
    },
    {
        "source_sentence": "恒為識神之所誑惑，不示徑路，我欲得堅[革*卬]反與柔軟；",
        "translation": "They are constantly tormented by the delusion of consciousness and do not show their paths. I wish to attain firmness, resistance, and softness.",
        "source": "T12n0384_007:1054a11_24"
    },
    {
        "source_sentence": "時復須軟反與我[革*卬]，我欲詣南反將至北，賊中之賊不過識神，",
        "translation": "I am about to go south and return north. The thief among the robbers has no idea of my whereabouts.",
        "source": "T12n0384_007:1054a12_25"
    },
    {
        "source_sentence": "自稱為王此事不然。」",
        "translation": "This is not the case for claiming to be a king.",
        "source": "T12n0384_007:1054a13_26"
    },
    {
        "source_sentence": "爾時水神白善業菩薩言：「識神所說是事不然。",
        "translation": "It was then that the water spirit said to the bodhisattva of good karma, This is not what the consciousness goddess said.",
        "source": "T12n0384_007:1054a14_27"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1054a15_28"
    },
    {
        "source_sentence": "水能潤漬成長萬物，我性須冷反與我熱，燒炙消盡永無冷性，為識所誑，",
        "translation": "Water nourishes, wets, and grows all things. The nature of self requires coolness; the opposite of self is hot. When burned or roasted, it disappears without any coldness at all.",
        "source": "T12n0384_007:1054a15_29"
    },
    {
        "source_sentence": "以是義故識言非也。」",
        "translation": "Because of this meaning, the consciousness says it's not.",
        "source": "T12n0384_007:1054a17_30"
    },
    {
        "source_sentence": "爾時火神白善業菩薩言：「識言非也。",
        "translation": "It was then that the fire deity said to the bodhisattva of good karma, Consciousness says it's not.",
        "source": "T12n0384_007:1054a17_31"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1054a18_32"
    },
    {
        "source_sentence": "火能熟物亦為光明，樹木華果隨時成長，若無火者識何所依？",
        "translation": "What is the support of consciousness if there is no fire?",
        "source": "T12n0384_007:1054a18_33"
    },
    {
        "source_sentence": "以是義故識言非也。」",
        "translation": "Because of this meaning, the consciousness says it's not.",
        "source": "T12n0384_007:1054a20_0"
    },
    {
        "source_sentence": "爾時，風神白善業菩薩言：「識言非也。",
        "translation": "It was then that the wind god said to the bodhisattva of good karma, saying, Consciousness says no.",
        "source": "T12n0384_007:1054a20_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1054a21_2"
    },
    {
        "source_sentence": "萬物成長行來進止動搖，識制止於我不令動轉。",
        "translation": "All things grow and develop, come and go, advance and cease and shake, and consciousness restrains them from being moved by me.",
        "source": "T12n0384_007:1054a21_3"
    },
    {
        "source_sentence": "以是義故識言非也。」",
        "translation": "Because of this meaning, the consciousness says it's not.",
        "source": "T12n0384_007:1054a22_4"
    },
    {
        "source_sentence": "爾時，空神白善業菩薩言：「識言非也。",
        "translation": "It was then that the god of emptiness said to the bodhisattva of good karma, Consciousness says no.",
        "source": "T12n0384_007:1054a23_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1054a23_6"
    },
    {
        "source_sentence": "我空法無物不含，含容萬品進止行來，通達無閡皆是我空，若非空者識何所依？",
        "translation": "The self of emptiness and dharmas that lack things doesn't contain anything, which contains myriad kinds of advancement and cessation and practice, comprehends that the self is emptiness without obstruction, and what does consciousness rely on if it's not emptiness?",
        "source": "T12n0384_007:1054a24_7"
    },
    {
        "source_sentence": "以是義故識言非也。」",
        "translation": "Because of this meaning, the consciousness says it's not.",
        "source": "T12n0384_007:1054a25_8"
    },
    {
        "source_sentence": "爾時，世尊問善業菩薩：「此六大所論有句義耶？",
        "translation": "At that point, the Bhagavān asked the Bodhisattva of Good Actions, Are these six great treatises in words and meanings?",
        "source": "T12n0384_007:1054a26_9"
    },
    {
        "source_sentence": "無句義耶？",
        "translation": "What's the meaning of words?",
        "source": "T12n0384_007:1054a27_10"
    },
    {
        "source_sentence": "有味義耶？",
        "translation": "Does it have taste and meaning?",
        "source": "T12n0384_007:1054a27_11"
    },
    {
        "source_sentence": "無味義耶？",
        "translation": "What is the meaning of tastelessness?",
        "source": "T12n0384_007:1054a27_12"
    },
    {
        "source_sentence": "有字義耶？",
        "translation": "Is there a word for meaning?",
        "source": "T12n0384_007:1054a28_13"
    },
    {
        "source_sentence": "無字義耶？」",
        "translation": "What's the meaning of wordlessness?",
        "source": "T12n0384_007:1054a28_14"
    },
    {
        "source_sentence": "善業菩薩白佛言：「世尊！",
        "translation": "The bodhisattva Sunetra said to the Buddha, Bhagavān!",
        "source": "T12n0384_007:1054a28_15"
    },
    {
        "source_sentence": "如五大性各各均等。",
        "translation": "It's like the five great natures, each equal in its own way.",
        "source": "T12n0384_007:1054a29_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1054a29_17"
    },
    {
        "source_sentence": "地界多者水界少者則不成就，水界多者火界少者則不成就，火界多者風界少者則不成就，",
        "translation": "If the earth element is numerous, then the water element is few; if the water element is numerous and the fire element is few, then it is not accomplished; if the fire element is numerous, then the wind element is few.",
        "source": "T12n0384_007:1054a29_18"
    },
    {
        "source_sentence": "風界多者空界少者則不成就，空界多者識界少者則不成就，五界等者識不分別則不成就。」",
        "translation": "When the wind element is numerous, the element of emptiness is few, and when the element of emptiness is numerous, the element of consciousness is few, and when the five elements are equal, the consciousness isn't distinct, then it won't be accomplished.",
        "source": "T12n0384_007:1054b02_19"
    },
    {
        "source_sentence": "「識神無形法，　　五大以為家；",
        "translation": "Consciousness, mind, and formless dharmas Are the home of the five elements.",
        "source": "T12n0384_007:1054b05_0"
    },
    {
        "source_sentence": "　分別善惡行，　　去就別真偽。",
        "translation": "Discriminating good and bad actions, they dispel the distinction between true and false.",
        "source": "T12n0384_007:1054b05_0"
    },
    {
        "source_sentence": "　識示善道處，　　永到安隱道；",
        "translation": "Consciousness shows the abode of the good path And leads forever to the peaceful path.",
        "source": "T12n0384_007:1054b05_0"
    },
    {
        "source_sentence": "　識為第六王，　　餘大最不如。」",
        "translation": "Consciousness is the sixth king, and the other great ones are most inferior.",
        "source": "T12n0384_007:1054b05_0"
    },
    {
        "source_sentence": "爾時，善業菩薩即說頌曰：佛告善業：「汝所問者皆是如來威神力故。」",
        "translation": "It was then that the bodhisattva Sunetra spoke a verse, saying, The Buddha told Sunetra, All of your questions are because of the Tathāgata's authoritative power.",
        "source": "T12n0384_007:1054b05_0"
    },
    {
        "source_sentence": "爾時，座上百七十億眾生解識深法，悉發無上正真道意。",
        "translation": "At the time, one hundred and seventy billion sentient beings on his seat understood the profound teaching and all aroused the intention for the unsurpassed true path of enlightenment.",
        "source": "T12n0384_007:1054b10_1"
    },
    {
        "source_sentence": "菩薩處胎經人品第三十三",
        "translation": "Chapter Thirty-third of the Sutra on the Birthplace of the Bodhisattva in the Womb",
        "source": "T12n0384_007:1054b13_0"
    },
    {
        "source_sentence": "爾時，座中有菩薩名曰法印，聞如來說六大眾生受五陰形，分別內外解了空無。",
        "translation": "At the time, there was a bodhisattva in his seat named Dharma Seal who heard the Tathāgata teach that the six great masses were born to receive the form of the five aggregates and discriminate between inside and outside to understand emptiness and nonexistence.",
        "source": "T12n0384_007:1054b14_0"
    },
    {
        "source_sentence": "內心生疑：「識為亂想非真實法。",
        "translation": "He had doubts within his mind, saying, Consciousness is a confused conception that's not the true teaching.",
        "source": "T12n0384_007:1054b15_1"
    },
    {
        "source_sentence": "何者是人？",
        "translation": "What's that person?",
        "source": "T12n0384_007:1054b16_2"
    },
    {
        "source_sentence": "云何是人？",
        "translation": "What's that person?",
        "source": "T12n0384_007:1054b16_3"
    },
    {
        "source_sentence": "人從何生？」",
        "translation": "Where did people come from?",
        "source": "T12n0384_007:1054b17_0"
    },
    {
        "source_sentence": "佛告法印菩薩：「善哉，善哉！",
        "translation": "The Buddha addressed the Dharma Seal Bodhisattva, Good, good!",
        "source": "T12n0384_007:1054b17_1"
    },
    {
        "source_sentence": "汝所問者，皆是諸佛威神所接。",
        "translation": "The questions you ask are all answered by the buddhas' authoritative powers.",
        "source": "T12n0384_007:1054b17_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0384_007:1054b18_3"
    },
    {
        "source_sentence": "過去無數阿僧祇恒河沙諸佛，及當來無數阿僧祇恒河沙諸佛，分別人本假號名字不可思議，",
        "translation": "Countless buddhas as numerous as grains of sand in the Ganges River in the past and countless buddhas as numerous as grains of sand in the Ganges River in the future discriminate people with originally nominal names that are inconceivable.",
        "source": "T12n0384_007:1054b18_4"
    },
    {
        "source_sentence": "非彼二乘羅漢、辟支所能籌量。",
        "translation": "They can't be measured by those two-vehicle arhats or pratyekbuddhas.",
        "source": "T12n0384_007:1054b20_5"
    },
    {
        "source_sentence": "汝今諦聽，諦聽！",
        "translation": "Listen attentively!",
        "source": "T12n0384_007:1054b21_6"
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Consider it well!",
        "source": "T12n0384_007:1054b22_0"
    },
    {
        "source_sentence": "吾當與汝具分別說。",
        "translation": "I will explain it to you in detail.",
        "source": "T12n0384_007:1054b22_1"
    },
    {
        "source_sentence": "猶如此娑呵世界閻浮提出眾生種，此事不然。",
        "translation": "It's like the kind of sentient beings that are born in Jambudvīpa in the sahā world, but this is not the case.",
        "source": "T12n0384_007:1054b22_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1054b23_3"
    },
    {
        "source_sentence": "非真實性故非人種，東弗于逮亦非人種，北欝單曰亦非人種，西拘耶尼亦非人種，",
        "translation": "They are not a human race because they do not really exist. The people of Pūrvavideha in the east are also not a human race, Uttarakuru in the north is also not a human race, and Aparagodānīya in the west is also not a human race.",
        "source": "T12n0384_007:1054b23_4"
    },
    {
        "source_sentence": "除無量壽佛及阿閦佛國，除莊嚴剎土虛空際佛，除我今日諸坐菩薩，餘諸盡非人種。",
        "translation": "Except for the Buddha of Immeasurable Life and the Buddha of Akṣobhya, except for the Buddha who adorned the buddha-lands in the space between the buddha-lands, and except for me, today's sitting bodhisattvas, the rest are all non-human beings.",
        "source": "T12n0384_007:1054b25_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1054b27_6"
    },
    {
        "source_sentence": "從本已來乃至成佛，於其中間初不為惡，此是人種；",
        "translation": "The first among them did not do evil from the beginning until they became buddhas. These people were of human race.",
        "source": "T12n0384_007:1054b27_7"
    },
    {
        "source_sentence": "猶如有人修身、口業於不修者，是謂人種。",
        "translation": "It's like someone who cultivates bodily and verbal actions but doesn't cultivate them, which is called the human race.",
        "source": "T12n0384_007:1054b29_8"
    },
    {
        "source_sentence": "受三依法於不受者，是謂人種。",
        "translation": "Those who receive the three kinds of dharmas and rely on those who don't receive them are called people.",
        "source": "T12n0384_007:1054c01_9"
    },
    {
        "source_sentence": "奉持五戒於不奉者，是謂人種。",
        "translation": "Someone who observes the five precepts and doesn't follow them is called a human being.",
        "source": "T12n0384_007:1054c01_10"
    },
    {
        "source_sentence": "修行十善於不行者，是謂人種。",
        "translation": "A person who cultivates the ten good qualities but doesn't practice them is called a human being.",
        "source": "T12n0384_007:1054c02_11"
    },
    {
        "source_sentence": "向須陀洹於不向者，是謂人種。",
        "translation": "Those who are headed toward stream entry and those who aren't headed for it are called the human race.",
        "source": "T12n0384_007:1054c03_12"
    },
    {
        "source_sentence": "得須陀洹於不得者，是謂人種。",
        "translation": "Attaining stream entry and not attaining it is called the human race.",
        "source": "T12n0384_007:1054c03_13"
    },
    {
        "source_sentence": "向斯陀含於不向者，是謂人種。",
        "translation": "Someone who goes to once-returning and contains what's not directed is called a human being.",
        "source": "T12n0384_007:1054c04_14"
    },
    {
        "source_sentence": "得斯陀含於不得者，是謂人種。",
        "translation": "Attaining once-returning contains what's not attained, which is called the human race.",
        "source": "T12n0384_007:1054c05_15"
    },
    {
        "source_sentence": "向阿那含於不向者，是謂人種。",
        "translation": "Those who are directed toward non-returners and those who aren't directed toward them are called the human race.",
        "source": "T12n0384_007:1054c06_0"
    },
    {
        "source_sentence": "得阿那含於不得者，是謂人種。",
        "translation": "Attaining non-returner and not attaining it is called the human race.",
        "source": "T12n0384_007:1054c06_1"
    },
    {
        "source_sentence": "向阿羅漢於不向者，是謂人種。",
        "translation": "A person who goes to the arhat and doesn't go there, this is called a human being.",
        "source": "T12n0384_007:1054c07_2"
    },
    {
        "source_sentence": "得阿羅漢於不得者，是謂人種。",
        "translation": "Attaining arhatship and not attaining it is called the human race.",
        "source": "T12n0384_007:1054c08_3"
    },
    {
        "source_sentence": "向辟支佛於不向者，是謂人種。",
        "translation": "A person who goes to the pratyekabuddha and doesn't go there, this is called a human being.",
        "source": "T12n0384_007:1054c08_4"
    },
    {
        "source_sentence": "得辟支佛於不得者，是謂人種。",
        "translation": "Attaining a pratyekabuddha and not attaining it is called the human race.",
        "source": "T12n0384_007:1054c09_5"
    },
    {
        "source_sentence": "向佛道者於不向者，是謂人種。",
        "translation": "Those who are headed toward the Buddha's path and those who aren't headed toward it are called human beings.",
        "source": "T12n0384_007:1054c10_6"
    },
    {
        "source_sentence": "得佛道者於不得者，是謂人種，故號人尊，如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "Those who attain the Buddha’s path and those who do not attain it are said to be a human race. For this reason they are called “honoured people.” The Tathāgata, Arhat, Perfectly Enlightened One, Perfect in Knowledge and Conduct, Perfect in Knowledge and Conduct, Well-gone One, Knower of the World, Unsurpassed One, Tamer",
        "source": "T12n0384_007:1054c10_7"
    },
    {
        "source_sentence": "是謂人種。」",
        "translation": "This is called the human race.",
        "source": "T12n0384_007:1054c13_8"
    },
    {
        "source_sentence": "佛告法印菩薩：「汝今善聽！",
        "translation": "The Buddha addressed the Dharma Seal Bodhisattva, Now listen well!",
        "source": "T12n0384_007:1054c13_9"
    },
    {
        "source_sentence": "過去諸佛於現在未來，是謂人種。",
        "translation": "The past buddhas of the present and future are called the human race.",
        "source": "T12n0384_007:1054c14_10"
    },
    {
        "source_sentence": "現在於未來，是謂人種。",
        "translation": "In the present and in the future, this is called the human race.",
        "source": "T12n0384_007:1054c15_11"
    },
    {
        "source_sentence": "未來於過去、現在，是謂人種。",
        "translation": "In the future, in the past and present, this is called the human race.",
        "source": "T12n0384_007:1054c15_12"
    },
    {
        "source_sentence": "於三世法，現在於過去、未來，最為第一。",
        "translation": "Among the dharmas of the three times, the present is the foremost, while the past and future are the best.",
        "source": "T12n0384_007:1054c16_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1054c17_14"
    },
    {
        "source_sentence": "如來於現在中能行過去、未來法。",
        "translation": "The Tathāgata can practice past and future dharmas in the present.",
        "source": "T12n0384_007:1054c17_15"
    },
    {
        "source_sentence": "何以故勝？",
        "translation": "Why is it superior?",
        "source": "T12n0384_007:1054c18_16"
    },
    {
        "source_sentence": "過去已滅、未來未至，法性自然，非過去能滅現在、未來，非未來能滅過去、現在。」",
        "translation": "When the past has ceased and the future has yet to come, the Dharma nature is natural; it's not that the past can cease the present and future, and it's not that the future can cease the past and present.",
        "source": "T12n0384_007:1054c18_17"
    },
    {
        "source_sentence": "「過去等正覺，　　遺教度眾生；",
        "translation": "Greatly enlightened ones of the past Inherited the teachings to liberate sentient beings.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　分別人根本，　　上、中、下微妙。",
        "translation": "The root of discriminating people is superior, middling, and inferior subtle.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　現在最勝佛，　　明過知未來；",
        "translation": "The supreme buddha of the present clearly knows the past and future.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　除滅前後結，　　獨照如日明。",
        "translation": "He extinguishes the former and latter fetters And shines alone like the sun.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　苦行眾生等，　　兩足及四足；",
        "translation": "Sentient beings with ascetic practices are two-legged and four-legged.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　為說甘露法，　　充滿除眾想。",
        "translation": "He teaches the Dharma of ambrosia, which fills and removes all conceptions.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　諸天十善行，　　從一二十二；",
        "translation": "The ten good deeds of the gods are from one and twenty-two.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　上天、下非天，　　功德之差降。",
        "translation": "The higher gods and the lower ones are not gods, but there's a difference in their merit.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　如來眾相具，　　行善無瑕穢；",
        "translation": "The Buddha is endowed with many characteristics, Acting well without blemish or stain.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　積德如安明，　　清淨行無垢。",
        "translation": "The accumulation of virtue is like peace and clarity, pure and undefiled in practice.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　若人生誹謗，　　言佛非真道；",
        "translation": "If someone were to slander anyone, They would say the Buddha Is not the true path.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　死入阿鼻獄，　　諸佛不能救。",
        "translation": "They'll die and go to the avīci hell, but the buddhas won't be able to save them.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　口氣腥臊臭，　　支節煩惱熱；",
        "translation": "The air in my mouth smelled foul and bad odor, My limbs were scorched with the heat of affliction.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　惡念遂熾盛，　　斯由誹謗罪。",
        "translation": "As a result, bad thoughts become intense, which are blamed for the sin of denigrating.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　行善修功德，　　識神向善處；",
        "translation": "Their practice is good and virtuous, And their consciousness goes to a good realm of existence.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　如人入池洗，　　清淨無塵垢。",
        "translation": "It's like a person who enters a pond to wash, pure and without dirt.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　羅漢、辟支佛，　　斷滅永不生；",
        "translation": "The arhats and pratyekabuddhas Will be annihilated and never reborn.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　不念吾我身，　　去離五道苦。",
        "translation": "They don't think of self or self, and they're free of the suffering of the five destinies.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　佛本所行法，　　得諸佛印可；",
        "translation": "The teaching practiced by the Buddha in the past Is approved by receiving the seals of enlightenment.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "　今得為人尊，　　故號天中天。」",
        "translation": "Now that he's honored as a human being, he's therefore called the god of gods.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "爾時，世尊即說頌曰：世尊說此頌已，語法印菩薩：「是謂人種。」",
        "translation": "It was then that the Bhagavān spoke this verse, saying, After the Bhagavān spoke this verse, he said to Dharma印 Bodhisattva, This is called the human race.",
        "source": "T12n0384_007:1054c20_18"
    },
    {
        "source_sentence": "爾時法印菩薩即從座起，偏露右臂右膝著地，叉手合掌前白佛言：「善哉，",
        "translation": "At that point, the bodhisattva Dharmodgata rose from his seat, bared his right shoulder, knelt with his right knee on the ground, joined his palms in salute, and said to the Buddha, Excellent.",
        "source": "T12n0384_007:1055a12_19"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0384_007:1055a14_20"
    },
    {
        "source_sentence": "快說斯義。",
        "translation": "I'll explain this meaning quickly.",
        "source": "T12n0384_007:1055a14_21"
    },
    {
        "source_sentence": "我等眾會，於如來所則非人種。",
        "translation": "We in the assembly are not human beings at the Tathāgata’s place.",
        "source": "T12n0384_007:1055a14_22"
    },
    {
        "source_sentence": "云何示現得為人種？」",
        "translation": "How can they be shown to become human beings?",
        "source": "T12n0384_007:1055a15_23"
    },
    {
        "source_sentence": "佛告法印菩薩：「解知諸法空無所有，無彼無此不見彼此者，是謂人種。",
        "translation": "The Buddha told Dharma-seal Bodhisattva, Understanding that the emptiness of dharmas has no existence and there's nothing here and nothing here but not seeing each other, this is called the human race.",
        "source": "T12n0384_007:1055a16_24"
    },
    {
        "source_sentence": "觀察法性無去、來、今，解知法性空寂無二，是謂人種。",
        "translation": "Observing that the nature of dharmas has no past, future, or present, understanding that the nature of dharmas is empty and quiescent without duality, this is called the human race.",
        "source": "T12n0384_007:1055a17_25"
    },
    {
        "source_sentence": "於四道果有成就者、無成就者，不見有一、亦不見二，是謂人種。",
        "translation": "In the fruit of the four paths, there's someone who has accomplished it and someone who doesn't have accomplished it, but they don't see one and don't see two, which is called the human race.",
        "source": "T12n0384_007:1055a18_26"
    },
    {
        "source_sentence": "於眾相法，不見莊嚴、亦不見不莊嚴，解了空寂非一、非二，是謂人種。",
        "translation": "They don't see adornment and don't see what's not adorned, understand that emptiness and quiescence are neither one and the same nor two, and this is called the human race.",
        "source": "T12n0384_007:1055a20_27"
    },
    {
        "source_sentence": "佛國清淨除欲、怒、癡，亦不見淨、亦不見不淨，二事虛空，是謂人種。",
        "translation": "The Buddha's land is pure, free of desire, anger, and delusion, and they don't see what's pure or impure, which are two things in space, which is called the human race.",
        "source": "T12n0384_007:1055a21_28"
    },
    {
        "source_sentence": "分別道性三十七品，有成、有敗，不見俗界有人、無人，是謂人種。",
        "translation": "The thirty-seven classes of discriminating the nature of enlightenment, which have formation and decay, don't see people in the secular realm or non-people; this is called the human race.",
        "source": "T12n0384_007:1055a23_29"
    },
    {
        "source_sentence": "發意弘誓不自為己，安處眾生住在無畏，不見有住、不見無住，二事平等，",
        "translation": "They make great determination and undertake the vow not to do anything for themselves, to place sentient beings in peace with fearlessness, not seeing any abiding or non-abiding: these two things are equal.",
        "source": "T12n0384_007:1055a24_30"
    },
    {
        "source_sentence": "是謂人種。",
        "translation": "This is called the human race.",
        "source": "T12n0384_007:1055a26_31"
    },
    {
        "source_sentence": "分別禪定心無染著，執意如空無能移動，亦不見定、亦不見不定，是謂人種。",
        "translation": "The mind of discriminating meditation without defiled attachment, the mind that clings to things like emptiness and can't move them, doesn't see concentration and doesn't see indeterminacy, and this is called the human race.",
        "source": "T12n0384_007:1055a26_32"
    },
    {
        "source_sentence": "眾生邪見導示善處，以八正法洗除心垢，亦不見正、亦不見不正，是謂人種。",
        "translation": "Sentient beings with wrong views guide and show the good places, wash away mental defilement with the eightfold right teaching, don't see what's right and don't see what's not right, and this is called the human race.",
        "source": "T12n0384_007:1055a28_33"
    },
    {
        "source_sentence": "於四部眾比丘、比丘尼、優婆塞、優婆夷，道心堅固無所戀著，不見戒行有犯、不犯，",
        "translation": "In the fourfold assembly of monks, nuns, laymen, and laywomen, their minds of enlightenment are firm and unattached, and they don’t see any violation or non-violation of the precepts.",
        "source": "T12n0384_007:1055b01_34"
    },
    {
        "source_sentence": "是謂人種。",
        "translation": "This is called the human race.",
        "source": "T12n0384_007:1055b02_35"
    },
    {
        "source_sentence": "如是法印於如來法，則為饒益利益眾生，於佛有反復，修諸功德不唐捐棄。」",
        "translation": "Thus, the Dharma mudrā is applied to the Tathāgata's teaching in order to benefit sentient beings and cultivate their merits without neglecting them.",
        "source": "T12n0384_007:1055b03_36"
    },
    {
        "source_sentence": "爾時座上百七十億眾生，皆發無上正真道意，修於人種不退轉行。",
        "translation": "At the time, there were one hundred and seventy billion sentient beings on his throne who all aroused the intention for the unsurpassed true path and cultivated the practice of nonretrogression among humans.",
        "source": "T12n0384_007:1055b04_37"
    },
    {
        "source_sentence": "菩薩處胎經行品第三十四",
        "translation": "Chapter 34 of the Practice of the Bodhisattva's Birth in the Womb Sutra",
        "source": "T12n0384_007:1055b07_0"
    },
    {
        "source_sentence": "爾時，座中有菩薩名曰造行，即從座起偏露右臂右膝著地，叉手合掌前白佛言：「善哉！",
        "translation": "At the time, there was a bodhisattva in his seat named Zouxing who rose from his seat, bared his right knee to the ground with his right shoulder on the ground, joined his palms and said to the Buddha, Good!",
        "source": "T12n0384_007:1055b08_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0384_007:1055b09_1"
    },
    {
        "source_sentence": "快說人種，非前、非後、非兩中間，行業果報以何得知？",
        "translation": "How can the karmic retribution of human beings be known if they are not born before, after, or between two?",
        "source": "T12n0384_007:1055b10_2"
    },
    {
        "source_sentence": "或過去身非今現在，或未來身非過去，或現在身非過去、未來，或內作行受外報，",
        "translation": "“Sometimes the body of a past is not what is present; sometimes the body of a future one is not what is past; sometimes the body of a present is not what is past or future; sometimes it acts inwardly and experiences an outward retribution.",
        "source": "T12n0384_007:1055b11_3"
    },
    {
        "source_sentence": "或外作行受內報，或凡夫身作行，須陀洹身受報，或須陀洹身作行，斯陀含受報，",
        "translation": "Some external actions receive their internal retribution, while some worldlings do so in the body; some [also] experience their retribution in the body of a stream-winner. Some [also] experience their retribution in the body of a stream-winner. Some [also] experience their retribution in the body of a once-returner",
        "source": "T12n0384_007:1055b13_4"
    },
    {
        "source_sentence": "或斯陀含身作行，阿那含受報，或阿那含身作行，阿羅漢身受報。",
        "translation": "Either the body of once-returner is conditioned by actions, and the non-returner receives the reward; or the body of non-returner is conditioned by actions, and the arhat is conditioned by actions.",
        "source": "T12n0384_007:1055b14_5"
    },
    {
        "source_sentence": "或有眾生得慈三昧無悲、喜、捨，或有眾生得悲無慈、喜、捨，或有眾生得喜無慈、悲、捨，",
        "translation": "“Some sentient beings attain the concentration of compassion without pity, joy, or equanimity. Some sentient beings attain pity without pity, joy, or equanimity. Some sentient beings attain joy without pity, joy, or equanimity.",
        "source": "T12n0384_007:1055b16_6"
    },
    {
        "source_sentence": "或有眾生得捨無慈、悲、喜。",
        "translation": "Sometimes there are sentient beings who attain equanimity without kindness, pity, or joy.",
        "source": "T12n0384_007:1055b18_7"
    },
    {
        "source_sentence": "或有眾生從凡夫地不向信地、法地，取須陀洹；",
        "translation": "Sometimes some sentient beings follow the stage of worldlings and do not turn to the stage of faith or the stage of doctrine, but take the srotadpanna.",
        "source": "T12n0384_007:1055b18_8"
    },
    {
        "source_sentence": "或有眾生不向信地、法地、須陀洹，取斯陀含；",
        "translation": "“Some sentient beings do not aspire to the stage of faith, the stage of doctrine, or the srotadpanna-ship. They take rebirth as a once-returner.",
        "source": "T12n0384_007:1055b20_0"
    },
    {
        "source_sentence": "或有眾生不向信地、法地、須陀洹、斯陀含，取阿那含；",
        "translation": "“Some sentient beings do not aspire to the [bodhisattva’s] state of faith, the state of the doctrine, the srotadpanna or the sakrdagamin.",
        "source": "T12n0384_007:1055b21_0"
    },
    {
        "source_sentence": "或有眾生不向信地、法地、須陀洹、斯陀含、阿那含，取阿羅漢；",
        "translation": "“Some sentient beings do not aspire to the state of faith, the state of the doctrine, the stream-entry, the sakrdagamin, the once-returner, or the anagamin.",
        "source": "T12n0384_007:1055b22_1"
    },
    {
        "source_sentence": "或有眾生不向信地、法地、須陀洹、斯陀含、阿那含、阿羅漢，取彼此阿羅漢。",
        "translation": "Suppose there are sentient beings who don't aspire to the ground of faith, the ground of the Dharma, stream entry, sakṛdāgāmin, once-returner, non-returner, or arhat, and take each other's arhats.",
        "source": "T12n0384_007:1055b23_2"
    },
    {
        "source_sentence": "或有眾生向辟支佛，還自墜落墮凡夫地，或有眾生向阿羅漢，還自墜落墮凡夫地；",
        "translation": "Sometimes some sentient beings will turn toward the pratyekabuddhas and fall back into the states of worldlings; sometimes they will turn toward arhats and fall back into the states of worldlings.",
        "source": "T12n0384_007:1055b25_3"
    },
    {
        "source_sentence": "或有眾生向阿那含，還自墜落墮凡夫地；",
        "translation": "“Some sentient beings may go to the anāgāmi-phala and fall back into the states of worldlings on their own.",
        "source": "T12n0384_007:1055b27_0"
    },
    {
        "source_sentence": "或有眾生向斯陀含，還自墜落墮凡夫地；",
        "translation": "“Some sentient beings may go to the state of once-returner and then fall back into the states of worldlings.",
        "source": "T12n0384_007:1055b27_1"
    },
    {
        "source_sentence": "或有眾生向須陀洹，還自墜落墮凡夫地；",
        "translation": "“Some sentient beings may go to the realm of stream-entry and fall back into the states of worldlings by themselves.",
        "source": "T12n0384_007:1055b28_2"
    },
    {
        "source_sentence": "或有眾生於法地退墮凡夫地，或有眾生於信地退墮凡夫地，此諸眾生於如來所皆有狐疑。",
        "translation": "Sometimes there are sentient beings who regress from the Dharma stage to the level of worldlings, or sometimes there are sentient beings who regress from the faith stage to the level of worldlings, and these sentient beings all have doubts at the Tathāgata's place.",
        "source": "T12n0384_007:1055b29_3"
    },
    {
        "source_sentence": "唯願世尊，一一分別令諸會者[火*霍]然開悟。」",
        "translation": "Please, Bhagavān, let each one of the assemblies [fire*ho] be discerned and enlightened.",
        "source": "T12n0384_007:1055c02_4"
    },
    {
        "source_sentence": "爾時世尊告造行菩薩曰：「善哉，善哉！",
        "translation": "It was then that the Bhagavān addressed the practitioner bodhisattva, Good, good!",
        "source": "T12n0384_007:1055c03_5"
    },
    {
        "source_sentence": "汝所問義，皆為當來、過去、現在，亦是諸佛行業果報。",
        "translation": "The meaning of your question is that it's the future, past, and present, which are also the results of the buddhas' actions.",
        "source": "T12n0384_007:1055c04_6"
    },
    {
        "source_sentence": "吾今一一分別，諦聽，諦聽！",
        "translation": "Now, I'll discern them one by one, listen closely, and listen closely!",
        "source": "T12n0384_007:1055c05_7"
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Consider it well!",
        "source": "T12n0384_007:1055c06_8"
    },
    {
        "source_sentence": "云何造行菩薩！",
        "translation": "What is a bodhisattva who creates practices?",
        "source": "T12n0384_007:1055c06_9"
    },
    {
        "source_sentence": "欲使如來說過去無量阿僧祇劫行業果報耶？",
        "translation": "Do you want the Tathāgata to explain the results of past actions for measureless incalculably long eons?",
        "source": "T12n0384_007:1055c07_10"
    },
    {
        "source_sentence": "欲使如來說未來無量阿僧祇劫行業果報耶？",
        "translation": "Do you want the Tathāgata to explain the results of future actions for measureless incalculably long eons?",
        "source": "T12n0384_007:1055c08_11"
    },
    {
        "source_sentence": "欲使如來說現在無量阿僧祇劫行業果報耶？」",
        "translation": "Do you want the Tathāgata to explain the results of actions for measureless incalculably long eons in the present?",
        "source": "T12n0384_007:1055c09_12"
    },
    {
        "source_sentence": "爾時造行菩薩白佛言：「世尊！",
        "translation": "It was then that the practitioner bodhisattva said to the Buddha, Bhagavān!",
        "source": "T12n0384_007:1055c10_13"
    },
    {
        "source_sentence": "且置過去、未來行業果報，欲聞如來現身行業果報。」",
        "translation": "Putting aside the results of past and future actions, he wants to hear the results of the Tathāgata's actions in his present body.",
        "source": "T12n0384_007:1055c10_14"
    },
    {
        "source_sentence": "佛告造行菩薩：「過去無數阿僧祇劫行業果報，亦是現在作。",
        "translation": "The Buddha told the practitioner bodhisattva, In countless incalculable eons in the past, the results of actions were also done in the present.",
        "source": "T12n0384_007:1055c12_0"
    },
    {
        "source_sentence": "未來無數阿僧祇劫行業果報，亦是現在作。",
        "translation": "The karmic retribution of future actions for incalculable eons is also done in the present.",
        "source": "T12n0384_007:1055c13_1"
    },
    {
        "source_sentence": "現在所作行業果報，亦是過去、未來受對因緣，今當與汝說之。",
        "translation": "The karmic retribution of action in the present is also the opposing cause and condition for past and future feelings. I will now explain this to you.",
        "source": "T12n0384_007:1055c14_2"
    },
    {
        "source_sentence": "昔我所更苦行無數，或修淨行、或修不淨行，或修天行、或修人行，初求佛道諸漏已盡，",
        "translation": "In the past I practiced innumerable ascetic practices, some pursuing pure practices, some impure practices, some heavenly practices, some human practices. When I first sought the path of enlightenment, all my defilements had been extinguished.",
        "source": "T12n0384_007:1055c15_3"
    },
    {
        "source_sentence": "神通變化[火*霍]然大悟，三界都苦唯我為樂。",
        "translation": "Their supernormal powers change [fire*ho] and yet they are greatly enlightened, and all three realms are painful but self is bliss.",
        "source": "T12n0384_007:1055c17_4"
    },
    {
        "source_sentence": "於尼連水邊六年苦行，日食一麻一米，斯由曩昔向一緣覺犯口四過，斷絕一施，",
        "translation": "For six years he practiced austerities at the bank of Nairañjāna’s river. He ate one grain of hemp and one grain of rice every day. This was due to the fact that in the distant past he had offered almsfood to one pratyekabuddha who committed four offenses by speaking falsely, cutting off one [of his regular] charity.",
        "source": "T12n0384_007:1055c18_5"
    },
    {
        "source_sentence": "今受斯報。",
        "translation": "Now, I'll receive this retribution.",
        "source": "T12n0384_007:1055c20_6"
    },
    {
        "source_sentence": "我既成佛，為五百摩納子惡聲誹謗罵詈，在諸街巷稱言，佛道非真。",
        "translation": "When I became a buddha, I spoke harshly to the five hundred manas and called out in street corners saying, 'The Buddha Way is not true.'",
        "source": "T12n0384_007:1055c20_7"
    },
    {
        "source_sentence": "時諸國人民有信、不信，信者信地、法地，不信者外凡夫，如此人等根、力成就不可沮壞。",
        "translation": "The people of the countries then had faith and didn't believe it, those who believed in the ground of faith and the ground of the Dharma, and those who didn't believe it were ordinary people outside the land, such people whose faculties and powers are perfected and can't be disrupted.",
        "source": "T12n0384_007:1055c22_8"
    },
    {
        "source_sentence": "佛出於世光明普照，地獄休息、餓鬼飽滿，在畜生者不復荷負重擔。",
        "translation": "When the Buddha emerges from the world, his light shines everywhere, and the hells are resting and hungry ghosts are full, so those in the animal kingdom don't again carry a heavy burden.",
        "source": "T12n0384_007:1055c24_9"
    },
    {
        "source_sentence": "如我弟提婆達兜以石打佛脚指出血，吾時避走東至弗于逮、北至欝單曰、西至拘耶尼，",
        "translation": "Just as my younger brother Devadatta struck the Buddha’s feet with a stone to show his blood, so too I fled and ran eastward to Pūrvavideha, north to Uttarakuru, and west to Kośinagara.",
        "source": "T12n0384_007:1055c25_10"
    },
    {
        "source_sentence": "吾復避之從忉利天上至三十二天，此石故隨逐吾，吾復避之還至故處，",
        "translation": "Again, I fled from Trāyastriṃśa Heaven to the thirty-two heavens. Because of this stone, I was driven there. Again, I fled away and returned home.",
        "source": "T12n0384_007:1055c27_11"
    },
    {
        "source_sentence": "為石所傷。",
        "translation": "He was injured by a stone.",
        "source": "T12n0384_007:1055c29_12"
    },
    {
        "source_sentence": "吾在摩竭國界晝闇園中，閑居經行，時有長者名尸利掘，請我供養，我即受請，",
        "translation": "When I was staying in the park of the country of Magadha, in the realm of the sun and moonlight, enjoying a quiet retreat and walking among the trees, an elder named Śāriputra invited me to make offerings to him.",
        "source": "T12n0384_007:1055c29_13"
    },
    {
        "source_sentence": "將阿難一人尋從我行。",
        "translation": "He led Ānanda alone to follow me.",
        "source": "T12n0384_007:1056a02_14"
    },
    {
        "source_sentence": "彼長者舍有七重門，門各有守者，過去，未來，現在諸佛常法，默然受請不受餘請。",
        "translation": "That house of the wealthy man had seven doors, each with an attendant guarding it. The buddhas of the past, present, and future always taught him the Dharma by remaining silent and accepting invitations without accepting others’ invitations.",
        "source": "T12n0384_007:1056a02_15"
    },
    {
        "source_sentence": "凡我弟子出家為道行亦應爾。",
        "translation": "So it should be with all my disciples who leave home to practice the path.",
        "source": "T12n0384_007:1056a04_16"
    },
    {
        "source_sentence": "我至彼門，尸利掘長者，於內作倡伎樂自恣，忘我在外已經日夜。",
        "translation": "When I arrived at that gate, the elder Śāriputra performed a performance of music and dancing inside to celebrate his confessional, forgetting that I had been outside for days and nights.",
        "source": "T12n0384_007:1056a05_17"
    },
    {
        "source_sentence": "佛語阿難：『汝行乞食我住此處。』",
        "translation": "The Buddha said to Ānanda, 'Go begging for food and I'll stay here.'",
        "source": "T12n0384_007:1056a06_18"
    },
    {
        "source_sentence": "時馬將從佛邊過，佛從乞食。",
        "translation": "When the horse was about to pass by the Buddha, the Buddha came begging for food.",
        "source": "T12n0384_007:1056a07_19"
    },
    {
        "source_sentence": "馬將言：『我無食，唯有熟麥當持相與。』",
        "translation": "The horse general said, 'I have nothing to eat, but I'll give it to you with cooked wheat.'",
        "source": "T12n0384_007:1056a08_20"
    },
    {
        "source_sentence": "即持熟麥施與佛，佛即受食之。",
        "translation": "He then took cooked wheat and gave it to the Buddha, who accepted it and ate it.",
        "source": "T12n0384_007:1056a09_21"
    },
    {
        "source_sentence": "時彼馬將謂為佛食。",
        "translation": "That horse then said it was the Buddha's food.",
        "source": "T12n0384_007:1056a09_22"
    },
    {
        "source_sentence": "爾時有天子名曰練精，即接食去，諸人見者謂為佛食。",
        "translation": "At the time, there was a celestial being named Linji who took food and departed, and those who saw him said it was the Buddha's food.",
        "source": "T12n0384_007:1056a10_23"
    },
    {
        "source_sentence": "然佛不食，為度彼故，故現受食。",
        "translation": "However, the Buddha doesn't eat because he wants to save them, so he now accepts food.",
        "source": "T12n0384_007:1056a11_24"
    },
    {
        "source_sentence": "如是九十日在門裏住，阿難亦九十日乞食。",
        "translation": "Thus, he stayed inside the gate for ninety days, and Ānanda also begged for food for ninety days.",
        "source": "T12n0384_007:1056a12_25"
    },
    {
        "source_sentence": "如來威神，不令國王及群臣長者知佛住此。",
        "translation": "The Tathāgata's authoritative power doesn't allow the king or his ministers and elders to know that the Buddha lives here.",
        "source": "T12n0384_007:1056a13_26"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1056a14_27"
    },
    {
        "source_sentence": "恐彼生慢興誹謗心：『佛無威神，餘人何望？』",
        "translation": "I'm afraid they'll become conceited and slanderous, saying, 'The Buddha has no authoritative power, so what can other people hope for?'",
        "source": "T12n0384_007:1056a14_28"
    },
    {
        "source_sentence": "「爾時尸利掘長者，有小因緣出外遊戲，見佛在門方問佛言：『何時至此？』",
        "translation": "It was then that the elder Śāriputra had a minor reason to go out and play outside, and when he saw the Buddha at his entrance, he asked the Buddha, 'When will you come here?'",
        "source": "T12n0384_007:1056a15_29"
    },
    {
        "source_sentence": "佛告長者：『卿前請我，我即來此，汝在內快自娛樂，今已經九十日，",
        "translation": "The Buddha said to the wealthy householder, “Come and see me. I am coming. You should enjoy yourselves inside for ninety days.",
        "source": "T12n0384_007:1056a17_30"
    },
    {
        "source_sentence": "欲還晝闇園中，得君供養食馬熟麥。』",
        "translation": "I want to return to the park in the darkness of the sun, and I'll get you to feed me with cooked wheat from a horse.'",
        "source": "T12n0384_007:1056a18_31"
    },
    {
        "source_sentence": "時尸利掘長者，極懷慚愧五體投地：『唯願世尊，垂恕不及，聽我悔過。』",
        "translation": "The elder Śāriputra then threw himself to the ground with five bodies of great shame, saying, 'All I ask, Bhagavān, is that you forgive me and allow me to repent.'",
        "source": "T12n0384_007:1056a19_32"
    },
    {
        "source_sentence": "佛告長者：『此緣久有，非適今也！』",
        "translation": "The Buddha told the elder, 'This condition has existed for a long time; it's not appropriate for the present!'",
        "source": "T12n0384_007:1056a21_0"
    },
    {
        "source_sentence": "爾時長者請佛入宮舍四事供養，佛為說法，諸塵垢盡得法眼淨。",
        "translation": "The elder then invited the Buddha to enter the palace and make offerings of four things, and the Buddha taught him the Dharma so that all the dust and dirt would be removed and the Dharma eye would become pure.",
        "source": "T12n0384_007:1056a21_1"
    },
    {
        "source_sentence": "「吾昔一時在毘舍離城，初成佛道未久，六師興盛，吾有弟子千二百五十人，",
        "translation": "“Once, when I was in Vaiśālī, not long after my first attainment of buddhahood, the six teachers flourished. I had one thousand two hundred and fifty disciples:",
        "source": "T12n0384_007:1056a23_2"
    },
    {
        "source_sentence": "一千一人皆得羅漢六通清徹。",
        "translation": "Each of the one thousand and one people attained the purity of the arhat's six supernormal powers.",
        "source": "T12n0384_007:1056a24_3"
    },
    {
        "source_sentence": "時有旃遮摩那耆女，是阿闍羅翅舍欽婆羅弟子，受師明教日來佛所，外現清信女法，",
        "translation": "At the time, there was a woman named Kauśinagara-māṇḍikā, a disciple of Ajātaśatru Kiṃpāla, who had come to see the Buddha on the day she received his instruction. Outwardly she manifested pure faith in the female Dharma.",
        "source": "T12n0384_007:1056a25_4"
    },
    {
        "source_sentence": "內受邪師教，來往周旋欲令人見，以草作腹日漸令大，後以木盂繫腹，",
        "translation": "He accepted the teaching of a heretical teacher inside, traveled around in all directions wanting to let people see him. He made a belly with grass that grew larger day by day and then fastened his belly to a wooden basin.",
        "source": "T12n0384_007:1056a27_5"
    },
    {
        "source_sentence": "狀如臨產婦女。",
        "translation": "It's shaped like a woman who's about to give birth.",
        "source": "T12n0384_007:1056a29_6"
    },
    {
        "source_sentence": "時邪師問言：『汝那得此娠？』",
        "translation": "The wrong teacher then asked, 'How did you get this pregnant woman?'",
        "source": "T12n0384_007:1056a29_7"
    },
    {
        "source_sentence": "報言：『我日往瞿曇沙門所，故有此娠。』",
        "translation": "He replied, 'Today, I went to the Gautama monk's place, so this woman was pregnant.'",
        "source": "T12n0384_007:1056b01_8"
    },
    {
        "source_sentence": "師便瞋言：『誑我弟子垂當生梵天，毀辱我弟子乃至於此。』",
        "translation": "The teacher then became angry and said, 'Again, my disciple will be born in the Brahma Heaven and disparage my disciple up here.'",
        "source": "T12n0384_007:1056b02_9"
    },
    {
        "source_sentence": "時邪師將諸弟子并此女人，往至佛所。",
        "translation": "The wrong teacher then took his disciples and this woman to the Buddha's place.",
        "source": "T12n0384_007:1056b03_10"
    },
    {
        "source_sentence": "當於爾時，如來與無央數眾而為說法，梵志至佛所高聲唱言：『此沙門瞿曇，",
        "translation": "At that time, the World-honored One was teaching the Dharma to innumerable bhikṣus. The brāhmaṇa approached the Buddha and said loudly:",
        "source": "T12n0384_007:1056b04_11"
    },
    {
        "source_sentence": "犯於婬欲，實不得道自稱言得道，所作變化皆是幻術，非真實道。』",
        "translation": "When someone commits sexual desire, they really don't attain the path and claim to have attained the path, and their transformations are illusory tricks that aren't true paths.'",
        "source": "T12n0384_007:1056b06_12"
    },
    {
        "source_sentence": "指此女人言：『眾人皆見不也，愛我此女使令有娠。』",
        "translation": "He pointed to this woman and said, 'None of them will see me, and they love this woman so that she'll become pregnant.'",
        "source": "T12n0384_007:1056b07_13"
    },
    {
        "source_sentence": "發此語已，時天帝釋化作一黃鼠，在女裙裏嚙盂繩索令盂墮地，眾人皆見，",
        "translation": "When he had uttered these words, Indra the lord of gods transformed himself into a yellow rat and flew inside the woman’s dress, clinging to the bottom of the pot. All the people saw him.",
        "source": "T12n0384_007:1056b08_14"
    },
    {
        "source_sentence": "呵責罵言：『汝等師徒謗毀聖人，促出國去。』",
        "translation": "They rebuked and scolded them, saying, 'You teachers denigrate the sage and urge him to leave the country.'",
        "source": "T12n0384_007:1056b10_15"
    },
    {
        "source_sentence": "「吾昔一時在錦毘梨國，在一樹下禪定行道，九十日不移處所。",
        "translation": "“Once long ago I was staying in Kapilavastu, meditating under a tree on the path of meditation for ninety days without moving from place to place.",
        "source": "T12n0384_007:1056b11_16"
    },
    {
        "source_sentence": "時彼六師名金那金離，有女弟子酸陀難提，興嫉妬心欲障佛功德自顯師道。",
        "translation": "At the time, those six masters were named Jinna Jinli, and there was a woman disciple named Sodhananandi who became jealous and wanted to obstruct the Buddha's virtue and reveal the teacher's path for herself.",
        "source": "T12n0384_007:1056b13_0"
    },
    {
        "source_sentence": "女言：『我能使人不供養佛，令師名聲流布無外。』",
        "translation": "The woman said, 'I can cause people not to make offerings to the Buddha so that his name will spread without exception.'",
        "source": "T12n0384_007:1056b14_1"
    },
    {
        "source_sentence": "時彼女人懷此謀心，日往佛所；",
        "translation": "The woman then, harboring this thought in her mind, went to the Buddha daily.",
        "source": "T12n0384_007:1056b15_2"
    },
    {
        "source_sentence": "經數日中，殺身埋精舍後園中。",
        "translation": "Within a few days, he killed himself and buried him in the garden behind the monastery.",
        "source": "T12n0384_007:1056b16_3"
    },
    {
        "source_sentence": "後來出死屍，言佛殺人。",
        "translation": "Later, a dead corpse came out and said that the Buddha was killing people.",
        "source": "T12n0384_007:1056b17_4"
    },
    {
        "source_sentence": "謗名流布，國人皆知。",
        "translation": "They denigrated the Buddha and spread his fame, which was widely known to all the people of the country.",
        "source": "T12n0384_007:1056b17_5"
    },
    {
        "source_sentence": "「吾昔一時左脇患風，使耆域令治。",
        "translation": "“Once, when I was suffering from a windstorm in my left hypochondrium, I ordered Jīvaka to treat it.",
        "source": "T12n0384_007:1056b18_6"
    },
    {
        "source_sentence": "耆域言：『當須牛乳、象尿，舍利沙、畢鉢尸利沙、胡椒，煮以為湯，",
        "translation": "Jīvaka said, 'You must use cow's milk and elephant urine, salted rice, sand from relics, sea salt, pippa西利沙, and pepper to cook it as hot water.",
        "source": "T12n0384_007:1056b19_7"
    },
    {
        "source_sentence": "服之則差。』",
        "translation": "When you take it, it's different.'",
        "source": "T12n0384_007:1056b20_8"
    },
    {
        "source_sentence": "「吾昔一時在他村中遊行教化，吾為馬槍刺脚，孔上下徹疼痛無量，復使耆域治之。",
        "translation": "Once, when I was traveling and teaching in another village, I stabbed my feet with a horse spear and pain from the hole up and down immeasurable, and then I ordered Jīvaka to treat it.",
        "source": "T12n0384_007:1056b20_9"
    },
    {
        "source_sentence": "「吾昔一時患頭痛，猶如兩須彌山壓頭疼痛，痛不可處。",
        "translation": "“In the past, I once had a headache that was as painful as pressing my head against two mountains in Mount Sumeru, and it didn’t hurt anywhere.",
        "source": "T12n0384_007:1056b22_10"
    },
    {
        "source_sentence": "今雖成佛諸漏已盡，諸善普集本行不朽，從無數劫修清淨行，行業果報，",
        "translation": "Even now that the defilements of enlightenment have been extinguished, the root practices of goodness and universal accumulation are not destroyed. Cultivating pure practices for countless eons, they produce the results of their actions.",
        "source": "T12n0384_007:1056b24_11"
    },
    {
        "source_sentence": "難可得離。",
        "translation": "It's difficult to get rid of.",
        "source": "T12n0384_007:1056b25_12"
    },
    {
        "source_sentence": "佛身如是，何況阿羅漢、辟支佛，能免行報耶？」",
        "translation": "The Buddha's body is like this, so why wouldn't arhats and pratyekabuddhas be able to avoid the results of their actions?",
        "source": "T12n0384_007:1056b26_13"
    },
    {
        "source_sentence": "「最勝四神足，　　住壽無數劫；",
        "translation": "The supreme four supernatural powers last for innumerable kalpas.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　天地悉壞敗，　　須彌如灰塵，",
        "translation": "All the heavens and earth will be destroyed, And Mount Sumeru like dust.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　行業追逐身，　　無處可隱藏。",
        "translation": "There's no place to hide the body chased by karma.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　我成最正覺，　　三界無等倫，",
        "translation": "I am the supremely enlightened one, peerless in all three realms.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　故受九報對，　　宿行牽連縛。",
        "translation": "Because of this, they receive the nine forms of retribution and are bound by their past actions.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　我有三昧力，　　金剛不可沮，",
        "translation": "I have the power of samādhi, which is indestructible like a diamond.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　不能避報業，　　捨而不受對。",
        "translation": "They can't avoid karmic retribution, abandon it and don't accept it.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　我今生緣盡，　　齊是更無分，",
        "translation": "Now that the condition of self is exhausted, there’s no further distinction between equal and inferior.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　永與生死別，　　更不造彼行。",
        "translation": "They'll be permanently separated from birth and death, and they won't create their actions.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　人多貪五欲，　　不謹慎放逸，",
        "translation": "Many people are greedy with the five desires, not being careful or lax.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　今世亦後世，　　常墮有憂處。",
        "translation": "In the present life and in the afterlife, they'll always fall into a place of grief.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　涅槃無所著，　　示現有為法；",
        "translation": "Nirvana has no attachment, Showing the present as a dharma.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　設復不現化，　　眾生難可度。",
        "translation": "Even if they don't manifest their transformation, sentient beings will be difficult to save.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　八等無為道，　　賢聖所行路；",
        "translation": "The eightfold unconditioned path Is the path traveled by the wise and holy.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　去離諸縛著，　　無有生滅法。",
        "translation": "Being free of the bonds and attachments, there's no such thing as arising and ceasing.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　道從無常觀，　　思惟不淨法；",
        "translation": "The path follows the contemplation of impermanence And reflects on impurity.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　一心不移動，　　成就諸相好。",
        "translation": "With one mind, he doesn’t move, Achieving the marks and embellishments.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　羅漢、辟支佛，　　償對復甚我；",
        "translation": "The arhats and pratyekabuddhas Will repay the great self.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　行業所追逐，　　何處可得免？",
        "translation": "Where can they be freed from the chase of their activities?",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　智慧舍利弗，　　常行佛功德；",
        "translation": "Śāriputra of wisdom Always practices the virtues of buddhahood.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　下腸取滅度，　　此是明白證。",
        "translation": "The lower abdomen takes the extinction of cessation, which is clearly realized.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　神足目揵連，　　步步登須彌；",
        "translation": "The divine feet of Maudgalyāyana climb up the polar mountain step by step.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　執杖梵志打，　　骨碎如芥子。",
        "translation": "A priest holding a staff beats it, and his bones are crushed like a mustard seed.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　娑竭阿羅漢，　　降伏難陀龍；",
        "translation": "The arhat Sāgara Overthrew the nāga nanda.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　臨取滅度時，　　眼睛墮無數。",
        "translation": "When he's about to enter nirvāṇa, his eyes fall countless.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　金花比丘尼，　　神德難可量；",
        "translation": "The monks and nuns of the golden flower Have immeasurable spiritual virtues.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　化作轉輪王，　　統領四天下，",
        "translation": "He transformed himself into a universal ruler Who ruled over the four quarters of earth.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　捨壽入無為，　　支節刀劍解。",
        "translation": "To abandon life and enter nonexistence, he dismounts with a knife and sword in his limbs.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　辟支名光明，　　無佛法出世，",
        "translation": "The pratyekabuddhas are called “luminosity” (prabhda). There is no buddha-dharma that emerges in the world.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　隨世盡其壽，　　鑊湯取滅度。",
        "translation": "At the end of his life, according to the time, he'll reach extinction with a cauldron of water.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　我今說現在，　　此等諸業報，",
        "translation": "These are the results of past action.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　設當說過去，　　阿僧祇佛行，",
        "translation": "Even if it were to explain the practices of incalculable buddhas of the past,",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　以劫數至劫，　　業報不可盡。",
        "translation": "To the extent of an eon, up to an eon: The retributions of actions cannot be exhausted.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　當來復有佛，　　令在此座上；",
        "translation": "In the future there will be another buddha, Enlightened One, Who will make us sit on this seat.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　亦當說業報，　　如今無有異。",
        "translation": "It should also be said that the retribution of action Is No different now.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　菩薩摩訶薩，　　精進不懈怠；",
        "translation": "“Great enlightening beings Do not lazy in their effort.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "　當急離業報，　　不與彼共俱。」",
        "translation": "You must quickly part with the results of your actions and not share them with them.",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "爾時，世尊與造行菩薩，而說頌曰：爾時，造行菩薩聞此偈已衣毛皆竪，",
        "translation": "At that time, the World-honored One spoke these verses to the bodhisattva Soṇarati:",
        "source": "T12n0384_007:1056b27_14"
    },
    {
        "source_sentence": "不樂生死周旋五道，皆發無上住不退轉地。",
        "translation": "They don't delight in birth and death, circumambulate the five destinies, and all give rise to the ground of unsurpassed abiding and non-backsliding.",
        "source": "T12n0384_007:1057a07_15"
    },
    {
        "source_sentence": "菩薩處胎經法住品第三十五",
        "translation": "Chapter 35 of the Sutra on the Dharma Abode of the Bodhisattva's Birthplace in the Womb",
        "source": "T12n0384_007:1057a09_0"
    },
    {
        "source_sentence": "爾時，世尊見眾會寂然清淨純一無雜，出廣長舌左右舐耳，放大光明上至無量阿僧祇剎土，",
        "translation": "At the time, the Bhagavān saw that the congregation was tranquil, pure, pure, and unadulterated, with a broad, long tongue licking their ears at their left and right, emanating great rays of light up to an infinite number of incalculable buddha-lands.",
        "source": "T12n0384_007:1057a10_0"
    },
    {
        "source_sentence": "眾生見光欣然踊躍歎未曾有。",
        "translation": "When sentient beings saw the light, they rejoiced and jumped in admiration like never before.",
        "source": "T12n0384_007:1057a12_1"
    },
    {
        "source_sentence": "爾時，世尊還攝光明。",
        "translation": "At that point, the Bhagavān returned to gather his light.",
        "source": "T12n0384_007:1057a12_2"
    },
    {
        "source_sentence": "佛告彌勒菩薩摩訶薩：「吾從無數阿僧祇劫已來，身、口、意淨無有瑕穢，",
        "translation": "The Buddha told Maitreya the great bodhisattva Mahāsattva: For countless incalculable eons, I have maintained purity of body, speech, and mind without blemish or stain.",
        "source": "T12n0384_007:1057a13_3"
    },
    {
        "source_sentence": "得此實相光明之報，斯由不欺妄故。」",
        "translation": "It's because they don't deceive the light of this true characteristic that they attain its reward.",
        "source": "T12n0384_007:1057a14_4"
    },
    {
        "source_sentence": "佛復告彌勒菩薩摩訶薩：「我今囑累於汝菩薩胎化經典，汝當宣傳廣宣布之。",
        "translation": "The Buddha again addressed Maitreya Bodhisattva Mahāsattva, Now, I'll entrust the scripture on your bodhisattva's fetal transformation to you, and you will proclaim it extensively.",
        "source": "T12n0384_007:1057a15_5"
    },
    {
        "source_sentence": "若有善男子、善女人諷誦此經，香花供養，搗香、末香、繒綵、花蓋、作倡伎樂，",
        "translation": "“Furthermore, if there are sons and daughters of a virtuous family who recite this sutra they should offer incense, flowers, powdered incense, silk cloth, flower canopies, music, song, and dance.",
        "source": "T12n0384_007:1057a17_6"
    },
    {
        "source_sentence": "其功德福甚多甚多。",
        "translation": "Their merits and virtues are abundant and numerous.",
        "source": "T12n0384_007:1057a19_7"
    },
    {
        "source_sentence": "若有善男子、善女人不能究竟旦暮諷誦，彈指之頃心念此經者，其功德福不可稱量。",
        "translation": "If there are good men and good women who can't recite this sūtra thoroughly in the morning and evening, and mindfully recite it when they snap their fingers, their merit and merit won't be measured.",
        "source": "T12n0384_007:1057a19_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1057a21_9"
    },
    {
        "source_sentence": "此胎經者，諸佛之父母、眾經中長，過去、當來、諸現在佛，要在母胎經中所化度眾生過於色身，",
        "translation": "“This sutra on the mother’s womb”: The buddhas of past, future, and present buddhas abide in the mother’s womb scriptures to save sentient beings.",
        "source": "T12n0384_007:1057a21_10"
    },
    {
        "source_sentence": "百倍、千倍、巨億萬倍不可稱量。」",
        "translation": "It's a hundredfold, a thousandfold, and a billion times greater than that, and it can't be measured.",
        "source": "T12n0384_007:1057a23_11"
    },
    {
        "source_sentence": "佛復告彌勒菩薩摩訶薩：「若有善男子、善女人禮事供養此經典者，欲得面見十方諸佛，",
        "translation": "Again, the Buddha said to the bodhisattva Mahāsattva Maitreya: If there are sons and daughters of a virtuous family who venerate and honor this scripture, they will be able to see the buddhas of the ten directions face to face.",
        "source": "T12n0384_007:1057a24_12"
    },
    {
        "source_sentence": "一心歸命無他異想，即時得見十方諸佛。",
        "translation": "With one mind, he returns to life with no different thoughts, and immediately sees the buddhas of the ten directions.",
        "source": "T12n0384_007:1057a26_13"
    },
    {
        "source_sentence": "若有善男子、善女人發大誓願：『我今欲使地獄休息，餓鬼、畜生無煩惱病。』",
        "translation": "Suppose there are good men and good women who make a great vow, 'Now, I want to cause the hells to rest and hungry ghosts and animals to be free of afflictive illness.'",
        "source": "T12n0384_007:1057a27_14"
    },
    {
        "source_sentence": "一心歸命諷誦此經，諸苦惱眾生皆得解脫。」",
        "translation": "He recites this sūtra with one mind and dedicates his life to chanting it, and all suffering sentient beings are liberated.",
        "source": "T12n0384_007:1057a29_15"
    },
    {
        "source_sentence": "佛復告彌勒菩薩摩訶薩：「我今緣盡無教化處，此經留住或千年，或至二千年，",
        "translation": "Again, the Buddha said to Bodhisattva Mahāsattva Maitreya: Now that I have exhausted my sphere of influence and am incapable of teaching others, this sutra remains for a thousand years or up to two thousand years.",
        "source": "T12n0384_007:1057b01_16"
    },
    {
        "source_sentence": "或至三千年，令分為三分，一分付與阿難，度我遺法弟子；",
        "translation": "Or it may be divided into three thousand years, one part to be given to Ānanda so as to save the remaining disciples of my teaching.",
        "source": "T12n0384_007:1057b02_17"
    },
    {
        "source_sentence": "一分與難陀優鉢羅龍王；",
        "translation": "One part was given to the dragon king Nanda Upāli.",
        "source": "T12n0384_007:1057b04_18"
    },
    {
        "source_sentence": "餘一分者彌勒與我宣傳；",
        "translation": "The other part is what Maitreya proclaimed to me.",
        "source": "T12n0384_007:1057b04_19"
    },
    {
        "source_sentence": "使一切眾生普得聞知，無得中斷。",
        "translation": "They cause all sentient beings to universally hear and know, but they don't attain the middle way.",
        "source": "T12n0384_007:1057b05_20"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T12n0384_007:1057b06_21"
    },
    {
        "source_sentence": "汝作佛時，汝當宣布此經，十方天下眾生，蠕動、喘息、蚑行、人物之類，",
        "translation": "When you become a buddha, you should proclaim this sutra: “The sentient beings in the worlds of the ten directions are wriggling, panting, licentious, and all kinds of people.",
        "source": "T12n0384_007:1057b06_22"
    },
    {
        "source_sentence": "皆蒙此經悉得解脫。",
        "translation": "They'll all be liberated by this sūtra.",
        "source": "T12n0384_007:1057b07_23"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T12n0384_007:1057b08_24"
    },
    {
        "source_sentence": "汝般涅槃後，此經二十一劫流布在世，然後乃斷。",
        "translation": "After you pass into parinirvāṇa, this sūtra will circulate in the world for twenty-one kalpas and then be cut off.",
        "source": "T12n0384_007:1057b08_25"
    },
    {
        "source_sentence": "若有善男子、善女人諷誦此經，心不錯亂發大弘誓，欲令眾生悉同我願，",
        "translation": "“Furthermore, if there are sons and daughters of a virtuous family who recite this scripture without confusion in their minds, they will make the great vow to cause all sentient beings to share my aspirations.",
        "source": "T12n0384_007:1057b09_26"
    },
    {
        "source_sentence": "同時俱生清淨國土，承事禮敬諸佛世尊，如願得之而無罣礙。」",
        "translation": "They are all born together in a pure land at the same time, serve and venerate the buddhas and world-honored ones, and obtain them as they wish without obstruction.",
        "source": "T12n0384_007:1057b11_27"
    },
    {
        "source_sentence": "佛復告彌勒菩薩摩訶薩：「汝當承受我教，當念佛恩。",
        "translation": "The Buddha again addressed Maitreya Bodhisattva Mahāsattva, You must accept my teaching and remember the Buddha's kindness.",
        "source": "T12n0384_007:1057b12_28"
    },
    {
        "source_sentence": "欲報佛恩者，常當一心奉持供養胎化經典，此功德、福無能宣暢。",
        "translation": "Those who want to repay the Buddha's kindness should always singlemindedly support and make offerings to the womb-transforming sūtras, for which merit and merit can't be expressed.",
        "source": "T12n0384_007:1057b13_29"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1057b15_30"
    },
    {
        "source_sentence": "此胎化經典，諸法寶藏諸佛封印，唯有如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "Only the Tathāgata, Arhat, Perfectly Enlightened One, Perfect in Knowledge and Conduct, Perfect in Well-gone One, Knower of the World, Unsurpassed One, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavat.",
        "source": "T12n0384_007:1057b15_31"
    },
    {
        "source_sentence": "能開發此印封示現眾生。",
        "translation": "He's able to develop this seal that shows sentient beings.",
        "source": "T12n0384_007:1057b18_32"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T12n0384_007:1057b18_33"
    },
    {
        "source_sentence": "當知我前後所說，三昧總持甚深經典，汝忘一字一句此過少耳！",
        "translation": "You should know that what I've taught before and after, the profound sūtras of samādhi and dhāraṇī, are too profound for you to forget a single word or phrase!",
        "source": "T12n0384_007:1057b18_34"
    },
    {
        "source_sentence": "若於此胎化經典，忘失一字一句其過甚多。",
        "translation": "If someone forgets a single word or phrase in this fetus-transformation sūtra, there are so many faults.",
        "source": "T12n0384_007:1057b20_35"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0384_007:1057b21_36"
    },
    {
        "source_sentence": "此諸佛世尊之父母也。」",
        "translation": "These are the parents of the buddhas and world-honored ones.",
        "source": "T12n0384_007:1057b21_37"
    },
    {
        "source_sentence": "爾時，世尊說是語時，普地六反震動，時座菩薩各各自相謂言：「釋迦文佛離法性不久，",
        "translation": "When the World-honored One had uttered these words, the earth shook six times in all directions. The seated bodhisattvas and buddhas said to each other:",
        "source": "T12n0384_007:1057b21_38"
    },
    {
        "source_sentence": "必當還現如本色相。」",
        "translation": "They will surely return to their original form and appearance.",
        "source": "T12n0384_007:1057b23_39"
    },
    {
        "source_sentence": "時座上有八十四億姟眾生，皆發無上住不退轉。",
        "translation": "Eighty-four billion lustful sentient beings on his seat at that time all aroused the unsurpassed abode of nonretrogression.",
        "source": "T12n0384_007:1057b24_40"
    },
    {
        "source_sentence": "時諸菩薩忽然不現各離胎化，供養釋迦文佛金棺舍利。",
        "translation": "The bodhisattvas then suddenly didn't show that they were each separated from the womb and made offerings to the golden coffin relics of Śākyamuni Buddha.",
        "source": "T12n0384_007:1057b25_41"
    },
    {
        "source_sentence": "菩薩處胎經復本形品第三十六",
        "translation": "Chapter 36 of the Sutra on the Return of the Form of the Bodhisattva to the Womb",
        "source": "T12n0384_007:1057b27_0"
    },
    {
        "source_sentence": "爾時，世尊還攝威神，在金棺裏寂然無聲，諸天燒香散花供養。",
        "translation": "At the time, the Bhagavān returned to gather his authoritative powers and remained in the golden coffin with no sound. The gods burned incense and scattered flowers as offerings.",
        "source": "T12n0384_007:1057b28_0"
    },
    {
        "source_sentence": "時大迦葉將五百弟子從摩伽提國來至佛所，聞佛今日當取滅度，悲啼[口*睪]泣不能自勝。",
        "translation": "Mahākāśyapa then came to the Buddha with five hundred of his disciples from the country of Magadha and heard that the Buddha was about to enter nirvāṇa today, weeping in sorrow [mouthing*tears] and unable to control themselves.",
        "source": "T12n0384_007:1057b29_1"
    },
    {
        "source_sentence": "爾時，世尊以天耳聞迦葉來至，即從棺裏雙出兩足，迦葉見之手捉摩捫，",
        "translation": "At that time the World-honored One, hearing from Kāśyapa’s divine ear that he was coming, immediately produced two legs from the coffin. Seeing them, Kāśyapa grasped and patted the coffin with his right hand.",
        "source": "T12n0384_007:1057c02_2"
    },
    {
        "source_sentence": "啼泣不能自勝。",
        "translation": "They cried and wept, unable to overcome themselves.",
        "source": "T12n0384_007:1057c04_3"
    },
    {
        "source_sentence": "「一切行無常，　　生者必有死；",
        "translation": "All conditioned things are impermanent; Those who are born must have death.",
        "source": "T12n0384_007:1057c04_4"
    },
    {
        "source_sentence": "　無生亦無死，　　此滅為最樂。",
        "translation": "The absence of birth and the absence of death is the greatest bliss.",
        "source": "T12n0384_007:1057c04_4"
    },
    {
        "source_sentence": "　佛所教化人，　　所度已周遍；",
        "translation": "The people the Buddha teaches and transforms Have already been liberated, pervading everywhere.",
        "source": "T12n0384_007:1057c04_4"
    },
    {
        "source_sentence": "　我行道逈絕，　　深恨不見佛。",
        "translation": "My practice of the path has been cut off, and I deeply hate not seeing the Buddha.",
        "source": "T12n0384_007:1057c04_4"
    },
    {
        "source_sentence": "　法界悉皆空，　　色身亦當爾；",
        "translation": "The realm of reality is all void, So are the form and body.",
        "source": "T12n0384_007:1057c04_4"
    },
    {
        "source_sentence": "　無有老、病、死，　　無為無所生。",
        "translation": "There's no old age, illness, or death, and nothing is produced.",
        "source": "T12n0384_007:1057c04_4"
    },
    {
        "source_sentence": "　住壽百恒沙，　　亦當歸滅度；",
        "translation": "Abiding for the duration of one hundred kalpas, They will also return to parinirvāṇa.",
        "source": "T12n0384_007:1057c04_4"
    },
    {
        "source_sentence": "　況我天尊師，　　處世著穢污。」",
        "translation": "How could it be that we, the honored teacher of gods, are attached to defilement in the world?",
        "source": "T12n0384_007:1057c04_4"
    },
    {
        "source_sentence": "爾時，迦葉普說頌曰：爾時，迦葉及五百弟子，皆遶金棺七匝在一面立。",
        "translation": "At the time, Kāśyapa universally spoke a verse, saying, At that point, Kāśyapa and his five hundred disciples all circumambulated the gold coffin seven times and stood to one side.",
        "source": "T12n0384_007:1057c04_4"
    },
    {
        "source_sentence": "爾時，阿難捉棺西北角，難陀捉東北角，諸天在後侍，直北出去雙樹四十九步，",
        "translation": "Ānanda then took the northwest corner of the coffin to the northwest, while Nanda took the northeast corner. The heavenly gods who were attending him at the rear went straight north forty-nine paces through the twin [rows of] trees.",
        "source": "T12n0384_007:1057c14_5"
    },
    {
        "source_sentence": "安厝金棺，隨沙門法，以牛頭栴檀香積金棺上；",
        "translation": "He buried the coffin in a golden coffin, according to the customs of the śramaṇas. On top of the coffin was an ox-head sandalwood incense heap of gold.",
        "source": "T12n0384_007:1057c15_6"
    },
    {
        "source_sentence": "諸梵天王、釋提桓因，將諸天眾在虛空中散花供養。",
        "translation": "The Brahmadeva kings and Śakra Devānām-Indra scattered flowers in the sky to make offerings to the gods.",
        "source": "T12n0384_007:1057c17_7"
    },
    {
        "source_sentence": "爾時，尊者迦葉，手執火然栴檀薪而耶維之；",
        "translation": "At that time, Venerable Kasyapa was holding a firewood stick of sandalwood wood in his hand and feeding it.",
        "source": "T12n0384_007:1057c18_8"
    },
    {
        "source_sentence": "八大國王爭分舍利，隨力多少各持歸供養。",
        "translation": "Eight great kings competed to share the relics, each holding them back and making offerings according to their strength.",
        "source": "T12n0384_007:1057c19_9"
    },
    {
        "source_sentence": "菩薩處胎經起塔品第三十七",
        "translation": "Chapter 37 of the Sutra on the Awakening of the Pagoda in the Womb of the Bodhisattva, Chapter 37",
        "source": "T12n0384_007:1057c21_0"
    },
    {
        "source_sentence": "爾時，八大國王：優填王、頂生王、惡生王、阿闍世王；",
        "translation": "At that time there were eight great kings: the king Udayana, the king Manojirocana, the king Sudarśana, and the king Ajatasatru.",
        "source": "T12n0384_007:1057c22_0"
    },
    {
        "source_sentence": "四大兵馬主：最豪兵馬主、容顏兵馬主、熾盛兵馬主、金剛兵馬主，此八大王共諍舍利，",
        "translation": "The four great leaders of the four great armies and horses were: the most powerful leader of the army and horses, the leader of the front-facing army and horses, the leader of the blazing army and horses, and the leader of the adamantine army and horses. These eight great kings shared the Tathāgata’s relics.",
        "source": "T12n0384_007:1057c23_1"
    },
    {
        "source_sentence": "各領兵眾列住一面。",
        "translation": "Each of them led his troops to one side in rows.",
        "source": "T12n0384_007:1057c25_2"
    },
    {
        "source_sentence": "八大王各各言：「佛舍利我應獨得之。」",
        "translation": "Each of the eight great kings said, I should obtain the Buddha's relics alone.",
        "source": "T12n0384_007:1057c25_3"
    },
    {
        "source_sentence": "有一大臣名優波吉諫言：「諸王！",
        "translation": "There was a minister named Upagupta who remonstrated, saying, Kings!",
        "source": "T12n0384_007:1057c26_4"
    },
    {
        "source_sentence": "莫[口*爭]佛舍利，應當分之普共供養，何為興兵共相征罰？」",
        "translation": "Don't [mouth*struggle] the Buddha's relics, and you should share them with him and make offerings together, so why would you raise an army to conquer each other?",
        "source": "T12n0384_007:1057c27_5"
    },
    {
        "source_sentence": "爾時釋提桓因，即現為人語諸王言：「我等諸天亦當有分，若共[口*爭]力則有勝負，",
        "translation": "Śakra, lord of the gods, said to the kings: O gods, we also have our parts. If we join hands with one another in strife, there will be a victory or defeat.",
        "source": "T12n0384_007:1057c28_6"
    },
    {
        "source_sentence": "幸可見與勿足為難。」",
        "translation": "It's fortunate that it's difficult to see and not be satisfied.",
        "source": "T12n0384_007:1058a01_7"
    },
    {
        "source_sentence": "爾時阿耨達龍王、文隣龍王、伊那鉢龍王語八王言：「我等亦應有舍利分，",
        "translation": "It was then that the dragon kings Anavatapta, Manojīva, and Yinapattra said to the eight kings, We should also have a portion of the relics.",
        "source": "T12n0384_007:1058a01_8"
    },
    {
        "source_sentence": "若不見與力足相伏。」",
        "translation": "If they don't see the characteristic of being subdued by their strength, then they'll be subdued.",
        "source": "T12n0384_007:1058a03_9"
    },
    {
        "source_sentence": "時優波吉言：「諸君且止，舍利宜共分之。」",
        "translation": "Upagupta then said, All of you, please stop, and it's advisable to share the relics together.",
        "source": "T12n0384_007:1058a03_10"
    },
    {
        "source_sentence": "即分為三分，一分與諸天，一分與龍王，一分與八王，金瓮受一石餘。",
        "translation": "They were divided into three parts, one part to be given to the gods, one part to the dragon kings, one part to the eight kings, and a little bit more than a stone was given to the golden pot.",
        "source": "T12n0384_007:1058a04_11"
    },
    {
        "source_sentence": "此臣密以蜜塗瓮裏，以瓮量即分舍利。",
        "translation": "This minister secretly rubs honey inside the pot and divides the relics according to the size of the pot.",
        "source": "T12n0384_007:1058a06_12"
    },
    {
        "source_sentence": "諸天得舍利還於天上，即起七寶塔偷婆。",
        "translation": "The gods obtained the relics and returned to heaven, where they built a seven-jeweled stūpa of stealing.",
        "source": "T12n0384_007:1058a07_13"
    },
    {
        "source_sentence": "龍得舍利還於龍宮，亦起七寶塔偷婆。",
        "translation": "When the dragon obtained the relics, he returned to the dragon's palace and built a seven-jeweled stūpa of stealing.",
        "source": "T12n0384_007:1058a08_14"
    },
    {
        "source_sentence": "八王得舍利各還本國，亦起七寶塔偷婆。",
        "translation": "When the eight kings obtained the relics, each returned to his own country and built a seven-jeweled stūpa of stealing.",
        "source": "T12n0384_007:1058a09_15"
    },
    {
        "source_sentence": "臣優波吉得著金瓮舍利三斗并瓮，亦起七寶塔偷婆。",
        "translation": "The minister Upagupta obtained three bowls of relics from the golden urn and a pot, and he also erected a seven-jeweled stūpa as a thief.",
        "source": "T12n0384_007:1058a10_16"
    },
    {
        "source_sentence": "灰及土四十九斛，起四十九七寶塔偷婆。",
        "translation": "The ashes and dirt amounted to forty-nine hu units. A stupa made of forty-nine pieces of seven kinds of jewels was built at Kapilavastu.",
        "source": "T12n0384_007:1058a11_17"
    },
    {
        "source_sentence": "當耶維處亦起七寶塔偷婆，高四十九仞，香花供養懸繒幡蓋，終日竟夜音樂聲不斷。",
        "translation": "At the place where Yava also erected a stupa of seven jewels called Kapilavastu, forty-nine feet in height, with fragrant flowers as offerings and hanging silhouetted banners and canopies. The sound of music continued day and night unceasingly.",
        "source": "T12n0384_007:1058a12_18"
    },
    {
        "source_sentence": "佛之威神令諸七寶塔各各有光明，或夜放光明與晝無異，或晝放光明與夜無異，",
        "translation": "The Buddha’s majestic power caused each of the seven-jeweled stupas to have its own light, sometimes shining brightly at night and not different from daylight, and sometimes shining brightly at day and not different from night.",
        "source": "T12n0384_007:1058a14_19"
    },
    {
        "source_sentence": "諸護塔善神各各來營護，不令惡人有觸犯者。",
        "translation": "Each of the guardians of the stūpa's good deities comes to protect it, so that bad people won't be touched by anyone who violates it.",
        "source": "T12n0384_007:1058a16_20"
    },
    {
        "source_sentence": "菩薩處胎經出經品第三十八",
        "translation": "Chapter 38 of the Sutra on the Birthplace of the Bodhisattva in the Womb",
        "source": "T12n0384_007:1058a18_0"
    },
    {
        "source_sentence": "爾時，佛取滅度已經七日七夜，時大迦葉告五百阿羅漢：「打揵椎集眾，",
        "translation": "At that time, seven days and nights after the Buddha had entered nirvana, Mahākāśyapa said to the five hundred arhats:",
        "source": "T12n0384_007:1058a19_0"
    },
    {
        "source_sentence": "卿五百人盡詣十方諸佛世界，諸有得阿羅漢六通清徹者，盡集此閻浮提詣雙樹間。",
        "translation": "All five hundred of you went to the buddha worlds in the ten directions, and those who had attained arhatship and the purity of the six supernormal powers gathered here in Jambudvīpa to the twin śāla trees.",
        "source": "T12n0384_007:1058a20_1"
    },
    {
        "source_sentence": "釋迦文尼佛今以捨壽取般涅槃，耶維已訖起七寶塔，今集眾欲得演出真性法身。",
        "translation": "Śākyamuni Buddha now takes parinirvāṇa by renouncing life, and after Yaśodharā has finished building a seven-jeweled stūpa, he's gathering the crowd to show off the true Dharma body of the Dharma body.",
        "source": "T12n0384_007:1058a22_2"
    },
    {
        "source_sentence": "汝等速集聽採微妙之言。」",
        "translation": "You must quickly gather together and listen to the subtle words that are collected.",
        "source": "T12n0384_007:1058a24_3"
    },
    {
        "source_sentence": "爾時五百阿羅漢受大迦葉教，以神足力如人屈伸臂頃，即到十方恒河沙剎土，",
        "translation": "At that time five hundred arhats, having received the instruction of Mahākāśyapa, by means of supernatural power like a man extending his arm at the speed of one yojana reached as many buddha-lands as there are grains of sand in the Ganges River in all ten directions.",
        "source": "T12n0384_007:1058a25_0"
    },
    {
        "source_sentence": "集諸羅漢得八億四千眾，來集到忍界聽受法言。",
        "translation": "The arhats assembled, accompanied by an assembly of eight hundred million four thousand bhikṣus, and came to the realm of forbearance to hear the Dharma.",
        "source": "T12n0384_007:1058a26_1"
    },
    {
        "source_sentence": "爾時，迦葉見眾已集，語優波離：「卿為維那，唱阿難下。」",
        "translation": "Seeing that the crowd had gathered, Kāśyapa said to Upāli, For you, Vairocana, call Ānanda down.",
        "source": "T12n0384_007:1058a27_2"
    },
    {
        "source_sentence": "即受教唱下阿難。",
        "translation": "He then accepted the teaching and called it down to Ānanda.",
        "source": "T12n0384_007:1058a29_3"
    },
    {
        "source_sentence": "「卿是佛侍者，今有大過於我等所，卿自知不也？」",
        "translation": "You're the Buddha's attendant, and now there's a great deal more than what we have. Do you know for yourself?",
        "source": "T12n0384_007:1058a29_4"
    },
    {
        "source_sentence": "阿難白大迦葉言：「不審有何大過於聖眾所？」",
        "translation": "Ānanda said to Mahākāśyapa, I don't know what's greater than that of the holy ones.",
        "source": "T12n0384_007:1058b01_5"
    },
    {
        "source_sentence": "迦葉告阿難言：「云何？",
        "translation": "Kāśyapa told Ānanda, What do you think?",
        "source": "T12n0384_007:1058b02_6"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T12n0384_007:1058b03_0"
    },
    {
        "source_sentence": "佛所說經，若有得道羅漢六通清徹者，修四神足多修多行，能住壽一劫有餘。",
        "translation": "The sūtras taught by the Buddha say that if someone attains the path and becomes a arhat with the purity of the six supernormal powers, cultivates the four miraculous abilities and often cultivates many practices, they'll be able to live for an additional eon.",
        "source": "T12n0384_007:1058b03_1"
    },
    {
        "source_sentence": "卿何故默然而不報佛？」",
        "translation": "Why are you silent and not reporting to the Buddha?",
        "source": "T12n0384_007:1058b04_2"
    },
    {
        "source_sentence": "時阿那律將阿難出在外，須臾復喚阿難前，還舊事具責阿難。",
        "translation": "Aniruddha then took Ānanda out and stayed outside. After a short while he called Ānanda before him again, returned to his old place, and reported the matter to Ānanda in detail.",
        "source": "T12n0384_007:1058b05_3"
    },
    {
        "source_sentence": "爾時阿難心意荒亂內自念言：「佛滅度未久，恥我乃爾！」",
        "translation": "It was then that Ānanda became mentally disturbed and thought to himself, Not long after the Buddha's passing away, shame on me!",
        "source": "T12n0384_007:1058b06_4"
    },
    {
        "source_sentence": "即思惟四意止、四意斷、四神足、五根、五力、七覺、八道，分別苦本、集、滅、道果，",
        "translation": "He then contemplates the four kinds of mental cessation, the four kinds of mental elimination, the four miraculous powers, the five faculties, the five faculties, the five powers, the seven forms of enlightenment, and the eight paths, discerning the source of suffering, accumulation, cessation, and the fruit of the path.",
        "source": "T12n0384_007:1058b08_5"
    },
    {
        "source_sentence": "即於眾前成阿羅漢，諸塵垢滅朗然大悟。",
        "translation": "That's when he becomes an arhat in front of the crowd, extinguishes the defilements and becomes perfectly enlightened.",
        "source": "T12n0384_007:1058b09_6"
    },
    {
        "source_sentence": "聖眾稱善諸天歌歎，當於爾時地六反震動，諸天散花作倡伎樂，色身滅度法身出世，",
        "translation": "The holy ones praised it and the gods sang a hymn of praise. At that moment the earth shook six times in six ways, heavenly beings scattered flowers and played music to express their delight. The form body died and the Dharma body appeared in the world.",
        "source": "T12n0384_007:1058b10_7"
    },
    {
        "source_sentence": "利益眾生多所潤及，即使阿難昇七寶高座。",
        "translation": "It's much nourished for the benefit of sentient beings, even if Ānanda ascends a high seat made of seven treasures.",
        "source": "T12n0384_007:1058b12_8"
    },
    {
        "source_sentence": "迦葉告阿難言：「佛所說法一言一字，汝勿使有缺漏。",
        "translation": "Kāśyapa told Ānanda, Don't let a single word of the Buddha's teaching be missing.",
        "source": "T12n0384_007:1058b13_9"
    },
    {
        "source_sentence": "菩薩藏者集著一處，聲聞藏者亦集著一處，戒律藏者亦著一處。」",
        "translation": "The bodhisattva store is collected in one place, the śrāvaka store is collected in another place, and the store of precepts and vinaya is collected in another place.",
        "source": "T12n0384_007:1058b14_10"
    },
    {
        "source_sentence": "爾時，阿難發聲唱言：「我聞如是一時，說佛所居處。」",
        "translation": "At that point, Ānanda raised his voice and called out, I've heard it at one time like this, saying where the Buddha lives.",
        "source": "T12n0384_007:1058b16_11"
    },
    {
        "source_sentence": "迦葉及一切聖眾，皆墮淚悲泣不能自勝，咄嗟老死如幻如化，昨日見佛今日已稱言滅為聞。",
        "translation": "Kāśyapa and all the holy monks wept in sorrow and couldn't overcome themselves, exclaiming that old age and death are illusory like illusions and transformations, and yesterday they saw the Buddha and today they called cessation as hearing.",
        "source": "T12n0384_007:1058b17_12"
    },
    {
        "source_sentence": "最初出經，胎化藏為第一，中陰藏第二，摩訶衍、方等藏第三，戒律藏第四，",
        "translation": "At the beginning of the sutras, the store of empowerment from the womb is the first; the store of intermediate existence is the second; the Mahāprajñāpāramitā-sūtra and the Equanimocana-sūtra are the third; the code of moral precepts and vinaya is the fourth.",
        "source": "T12n0384_007:1058b19_13"
    },
    {
        "source_sentence": "十住菩薩藏第五，雜藏第六，金剛藏第七，佛藏第八，是為釋迦文佛經法具足矣。",
        "translation": "These are the fifth in the store of the bodhisattvas of the ten abodes, the sixth in the miscellaneous store, the seventh in the vajra store, and the eighth in the buddha store. This is the complete collection of the teachings of the Śākyamuni Buddha’s scriptures.",
        "source": "T12n0384_007:1058b21_14"
    },
    {
        "source_sentence": "二月八日成佛，二月八日轉法輪，二月八日降魔，二月八日般涅槃。",
        "translation": "He becomes a buddha on the eighth day of the second month, turns the wheel of the Dharma on the eighth day of the second month, subdues Māra on the eighth day of the second month, and enters nirvana on the eighth day of the second month.",
        "source": "T12n0384_007:1058b23_15"
    },
    {
        "source_sentence": "菩薩處胎經卷第七",
        "translation": "Bodhisattva's Place in the Womb Sutra, Volume 7",
        "source": "T12n0384_007:1058b25_0"
    }
]