[
    {
        "source_sentence": "佛說大方廣善巧方便經卷第二",
        "translation": "Foshuo dafangguang shanqiao shanqiao jing, vol. 2",
        "source": "T12n0346_002:0169a23_0"
    },
    {
        "source_sentence": "西天譯經三藏朝奉大夫試光祿卿",
        "translation": "Xitian zhuan jing sanzang朝奉大夫試光祿卿",
        "source": "T12n0346_002:0169a25_0"
    },
    {
        "source_sentence": "傳法大師賜紫臣施護奉　詔譯",
        "translation": "Translated by imperial edict of the Master Zhuanfa, who bestowed a purple minister named Shi Hufeng",
        "source": "T12n0346_002:0169a26_0"
    },
    {
        "source_sentence": "「復次，光聚王！",
        "translation": "Furthermore, King光聚王!",
        "source": "T12n0346_002:0169a27_0"
    },
    {
        "source_sentence": "又如持明人善修瑜伽悉地法門，於祕密五種縛中而受繫縛，隨所作法不越三昧。",
        "translation": "It's also like when a person who maintains insight skillfully cultivates the method of the yoga-śeṣa dharma-gate enters into the five esoteric fetters and is bound by them, following the untransgressive samādhi of whatever they do.",
        "source": "T12n0346_002:0169a27_1"
    },
    {
        "source_sentence": "是人以一大明句力悉能斷除彼一切縛，而獲安住祕密行門。",
        "translation": "By the power of one great illuminating phrase, that person can completely remove all those bonds and attain the mysterious practice of abiding in seclusion.",
        "source": "T12n0346_002:0169a29_2"
    },
    {
        "source_sentence": "雖在繫縛中，常不離三昧。",
        "translation": "Even though he's in bondage, he always doesn't part from samādhi.",
        "source": "T12n0346_002:0169b01_3"
    },
    {
        "source_sentence": "具善巧方便菩薩摩訶薩亦復如是，於五欲境中嬉戲順行，隨其所作不壞正行。",
        "translation": "Similarly, the bodhisattva Mahāsattva who possesses skillful means plays and complies with the five objects of desire and doesn't break down right practice according to what he does.",
        "source": "T12n0346_002:0169b02_4"
    },
    {
        "source_sentence": "是菩薩以一智慧明力悉能清淨一切染法，於一切智心而能安住。",
        "translation": "This bodhisattva is able to purify all defiled dharmas with the insight power of one wisdom, and he can abide in the mind of omniscience.",
        "source": "T12n0346_002:0169b03_5"
    },
    {
        "source_sentence": "雖受五欲樂，常生梵天界。",
        "translation": "Even though they experience the five desires and pleasures, they're always born in the Brahma heaven realm.",
        "source": "T12n0346_002:0169b05_6"
    },
    {
        "source_sentence": "「光聚王！",
        "translation": "“O king of the cluster of light!",
        "source": "T12n0346_002:0169b06_7"
    },
    {
        "source_sentence": "又如世間善用劍者於其劍法巧妙精熟。",
        "translation": "It's also like someone in the world who well uses a sword and skillfully matures the method of his sword.",
        "source": "T12n0346_002:0169b06_8"
    },
    {
        "source_sentence": "是人一時隱覆利劍，獨行曠野險難之處。",
        "translation": "One time, that man hid his sharp sword and traveled alone in the wilderness of a dangerous place.",
        "source": "T12n0346_002:0169b07_9"
    },
    {
        "source_sentence": "於其中路忽見一人，單己無伴復無器仗。",
        "translation": "Suddenly he saw a man on the roadway, who was alone without companions and lacking any weapon.",
        "source": "T12n0346_002:0169b08_10"
    },
    {
        "source_sentence": "時用劍人見彼人已，生悲愍心，即相附近而謂言曰：『汝今獨行，一無伴侶又無器仗，",
        "translation": "Seeing the man with his sword, he became compassionate and pitying. He immediately approached them and said to them, “You are now traveling alone.",
        "source": "T12n0346_002:0169b09_11"
    },
    {
        "source_sentence": "將何護身？",
        "translation": "What will I protect my body?",
        "source": "T12n0346_002:0169b10_12"
    },
    {
        "source_sentence": "汝今同我隨其所往，終不令汝有所闕失。",
        "translation": "You are now the same as me, so go wherever you wish. I will never allow you to miss anything.",
        "source": "T12n0346_002:0169b11_13"
    },
    {
        "source_sentence": "若忽值遇盜賊等事，我當為汝作大救護。』",
        "translation": "If you suddenly meet thieves and thieves, I'll be a great rescue for you.'",
        "source": "T12n0346_002:0169b12_14"
    },
    {
        "source_sentence": "言已同行。",
        "translation": "He said, I'll go along with you.",
        "source": "T12n0346_002:0169b13_15"
    },
    {
        "source_sentence": "於其中路忽逢賊眾，時同行人不知此人先隱利劍，見是賊已即生怖畏。",
        "translation": "On the way, he suddenly met a group of thieves, and his companions didn't know that this man had previously hidden a sharp sword, so they became frightened when they saw him.",
        "source": "T12n0346_002:0169b13_16"
    },
    {
        "source_sentence": "時用劍人發勇猛心，無所怯懼，即出其劍與彼賊眾而共鬪敵。",
        "translation": "The man with the sword then arouses a courageous mind and doesn't fear anything, so he produces his sword and fights with the thieves.",
        "source": "T12n0346_002:0169b14_17"
    },
    {
        "source_sentence": "時彼賊眾皆悉斷命，其用劍人自護身已、復能防護彼同行者，咸得安隱過斯險難。",
        "translation": "The thieves then all cut off their lives, and after they use their swords to protect themselves and can also protect their fellow practitioners, they'll be able to escape this danger.",
        "source": "T12n0346_002:0169b16_18"
    },
    {
        "source_sentence": "具善巧方便菩薩摩訶薩亦復如是，而能具足種種方便、執智慧劍。",
        "translation": "Similarly, the bodhisattva Mahāsattva who is endowed with skillful means can possess various kinds of skillful means and carry the sword of wisdom.",
        "source": "T12n0346_002:0169b18_19"
    },
    {
        "source_sentence": "雖於五欲境嬉戲順行，終不暫令身根起放逸事，能為身根作大防護。",
        "translation": "Even though he plays and complies with the five objects of desire, he never causes the body faculty to become careless for a moment. He can act as a great guard for the body faculty.",
        "source": "T12n0346_002:0169b19_20"
    },
    {
        "source_sentence": "設於異時遇煩惱魔，菩薩亦復無所動轉，被精進鎧不生怖畏，以智慧劍斷煩惱網，",
        "translation": "Even if they encounter the demon of afflictions at different times, the enlightening beings also do not move. They are armed with zeal and don’t become frightened; they use the sword of knowledge to cut off the web of afflictions.",
        "source": "T12n0346_002:0169b21_21"
    },
    {
        "source_sentence": "悉令清淨。",
        "translation": "They all make them pure.",
        "source": "T12n0346_002:0169b23_22"
    },
    {
        "source_sentence": "菩薩常生清淨佛土。」",
        "translation": "A bodhisattva always gives rise to the pure Buddha land.",
        "source": "T12n0346_002:0169b23_23"
    },
    {
        "source_sentence": "爾時，會中有一菩薩名曰作愛，於其食時入舍衛大城而行乞食。",
        "translation": "At the time, there was a bodhisattva named Lover in the assembly who entered the great city of Śrāvastī to solicit alms while he was eating.",
        "source": "T12n0346_002:0169b24_0"
    },
    {
        "source_sentence": "時彼菩薩次第行至一長者舍，住立門側，發聲乞食。",
        "translation": "The bodhisattva then went to an elderly man's dwelling in order, stood beside the door, and raised his voice to solicit alms.",
        "source": "T12n0346_002:0169b25_1"
    },
    {
        "source_sentence": "長者有女名曰上財，顏貌端正，人所愛樂。",
        "translation": "The wealthy man had a daughter named Shangzai. She was beautiful and handsome in appearance, beloved by everyone.",
        "source": "T12n0346_002:0169b26_2"
    },
    {
        "source_sentence": "是時，彼女聞菩薩聲，即持飲食出施菩薩。",
        "translation": "When the woman heard the bodhisattva's voice, she took food and drink and gave it to the bodhisattva.",
        "source": "T12n0346_002:0169b27_3"
    },
    {
        "source_sentence": "授其食已，即於菩薩生愛樂心，若色相、若音聲而生取著，由此因緣起貪染心。",
        "translation": "After he gave them food, the bodhisattva's mind becomes attached to form and sounds that give rise to attachment, and this is the cause that gives rise to the defiled mind of desire.",
        "source": "T12n0346_002:0169b28_4"
    },
    {
        "source_sentence": "作愛菩薩見是女已，即知其念。",
        "translation": "When the Bodhisattva Kauṇḍinya saw this woman, he knew her thoughts.",
        "source": "T12n0346_002:0169c01_5"
    },
    {
        "source_sentence": "菩薩爾時於貪染法無所作意，即自思惟：「於須臾間若起一念貪染心者，",
        "translation": "At that point, the bodhisattva had no thoughts of craving or defilement and thought to himself, If he gives rise to a single thought of craving or defilement for a moment,",
        "source": "T12n0346_002:0169c02_0"
    },
    {
        "source_sentence": "是大過失。",
        "translation": "This is a great mistake.",
        "source": "T12n0346_002:0169c03_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0346_002:0169c03_2"
    },
    {
        "source_sentence": "今此女人，我於何處而生可愛？",
        "translation": "Where will this woman now become desirable to me?",
        "source": "T12n0346_002:0169c04_3"
    },
    {
        "source_sentence": "若彼眼根為可愛者，眼是無常敗壞不淨肉團，彼自性空，何所愛樂？",
        "translation": "If that eye faculty is desirable, then the eye is impermanent, decaying, impure, and lump of flesh.",
        "source": "T12n0346_002:0169c04_4"
    },
    {
        "source_sentence": "若於耳、鼻、舌、身、意根為可愛者，彼彼諸根亦復如是，自性皆空，",
        "translation": "If the faculties of ear, nose, tongue, body, and mind are desirable, those faculties are likewise, because they are empty by their own nature.",
        "source": "T12n0346_002:0169c06_5"
    },
    {
        "source_sentence": "無有實法，何所愛樂？",
        "translation": "If there is no real dharma, what should we delight in?",
        "source": "T12n0346_002:0169c07_6"
    },
    {
        "source_sentence": "如是，從足至頂、乃至內外中間，一一如實審諦觀察，是中無有少法可得。",
        "translation": "Thus, from the top of their feet up to the middle and even between them, there's no little thing to be obtained here that can be examined as it really is.",
        "source": "T12n0346_002:0169c08_7"
    },
    {
        "source_sentence": "我今如是如實觀已，於一切法悉無所有。",
        "translation": "Now, having thus truly observed it, I have no existence at all in all things.",
        "source": "T12n0346_002:0169c09_8"
    },
    {
        "source_sentence": "法無有故，即法無生。」",
        "translation": "Because dharmas lack existence, that is, dharmas lack birth.",
        "source": "T12n0346_002:0169c10_9"
    },
    {
        "source_sentence": "菩薩作是思惟時，即得無生法忍。",
        "translation": "When the bodhisattva thus reflects, he attains the tolerance of the nonarising of all dharmas.",
        "source": "T12n0346_002:0169c11_10"
    },
    {
        "source_sentence": "菩薩得是利已，心大歡喜，即於是處踊身虛空高一多羅樹，於其城中右繞七匝出舍衛大城，",
        "translation": "Having obtained these benefits, the bodhisattva was greatly delighted. Thereupon, he emerged from the great city of Sāvatthī by circumambulating it seven times on his right and then flew up into the sky so high as to reach a height of one palm tree.",
        "source": "T12n0346_002:0169c12_0"
    },
    {
        "source_sentence": "乘空往詣佛世尊所。",
        "translation": "They rode through the sky to the Buddha, the Bhagavān.",
        "source": "T12n0346_002:0169c14_1"
    },
    {
        "source_sentence": "爾時，世尊見彼作愛菩薩威德巍巍猶如鵝王，乘空自在徐緩而來。",
        "translation": "At the time, the Bhagavān saw that affectionate bodhisattva's authoritative and majestic appearance was like a king goose, riding freely and slowly in space.",
        "source": "T12n0346_002:0169c15_0"
    },
    {
        "source_sentence": "世尊見已，謂阿難言：「阿難！",
        "translation": "Seeing him, the Bhagavān said to Ānanda, Ānanda!",
        "source": "T12n0346_002:0169c16_1"
    },
    {
        "source_sentence": "汝見此作愛菩薩從空來不？」",
        "translation": "Do you see this bodhisattva who creates craving from space?",
        "source": "T12n0346_002:0169c17_2"
    },
    {
        "source_sentence": "阿難白佛言：「世尊！",
        "translation": "Ānanda said to the Buddha, Bhagavān!",
        "source": "T12n0346_002:0169c17_3"
    },
    {
        "source_sentence": "唯然已見。」",
        "translation": "Yes, I've seen it.",
        "source": "T12n0346_002:0169c18_4"
    },
    {
        "source_sentence": "佛告阿難言：「汝今當知，此菩薩者，於一切法離貪愛心，證法無生、悉無所得，",
        "translation": "The Buddha said to Ānanda: You should now know that this bodhisattva has become free of craving for all things, having realized that the Dharma is unarisen and completely ungraspable.",
        "source": "T12n0346_002:0169c18_5"
    },
    {
        "source_sentence": "而能降伏一切魔軍，廣為眾生轉正法輪。」",
        "translation": "He's able to subdue all the armies of Māra and turn the right Dharma wheel for sentient beings.",
        "source": "T12n0346_002:0169c20_6"
    },
    {
        "source_sentence": "時佛言已，而彼菩薩即住空中聽佛說法。",
        "translation": "After the Buddha said this, the bodhisattva stayed in the air and listened to the Buddha's teaching.",
        "source": "T12n0346_002:0169c21_7"
    },
    {
        "source_sentence": "是時，彼上財女人於長者舍忽然命終，生三十三天，轉女人相，得天子身。",
        "translation": "At the time, that woman of great wealth suddenly died in the elder's dwelling and was born in the thirty-three gods, transformed into a woman, and attained the body of a celestial child.",
        "source": "T12n0346_002:0169c23_0"
    },
    {
        "source_sentence": "彼天子生時，有七寶莊嚴微妙宮殿同時出現，縱廣十二由旬。",
        "translation": "When that celestial being is born, a subtle palace adorned with the seven treasures appears simultaneously, twelve yojanas long and wide.",
        "source": "T12n0346_002:0169c24_1"
    },
    {
        "source_sentence": "復有一萬四千天女眷屬同時而生。",
        "translation": "Again, there are 14,000 celestial maidens and their retinues that are born at the same time.",
        "source": "T12n0346_002:0169c26_2"
    },
    {
        "source_sentence": "是諸天女於須臾間自有智生，咸作是念：「我等今時以何善根得生於此？」",
        "translation": "In a moment's time, these goddesses had their own wisdom that arises, and they all thought, What good roots can we now give rise to here?",
        "source": "T12n0346_002:0169c26_3"
    },
    {
        "source_sentence": "即知：「先世舍衛城中，有長者女於一菩薩起染愛心。",
        "translation": "He then knew, In a previous life, there was an elderly woman in the city of Śrāvastī who had developed defiled craving for a bodhisattva.",
        "source": "T12n0346_002:0169c28_4"
    },
    {
        "source_sentence": "以是因緣，於彼命終生此天中，轉女人相而為天子。",
        "translation": "Because of these causes and conditions, they'll be born in this heaven at the end of their life and become a celestial child with the characteristics of a woman.",
        "source": "T12n0346_002:0169c29_5"
    },
    {
        "source_sentence": "彼得無量勝報神通，我等由是天子勝因緣故亦得生此。」",
        "translation": "Peter has immeasurable superior karmic retribution and supernormal abilities, and we can be born here because of the superior causes and conditions of these celestial children.",
        "source": "T12n0346_002:0170a01_6"
    },
    {
        "source_sentence": "作是念已，歡喜而住。",
        "translation": "After he had this thought, he rejoiced and stayed.",
        "source": "T12n0346_002:0170a03_7"
    },
    {
        "source_sentence": "爾時，彼新生天子即作是念：「我昔人間生染愛心，而何今時得是勝報？",
        "translation": "It was then that the newly born celestial son thought, In the past, I was born among humans with defiled cravings, but how could I now attain this superior reward?",
        "source": "T12n0346_002:0170a04_0"
    },
    {
        "source_sentence": "此因緣者，乃是作愛菩薩增上善力為開導故。",
        "translation": "These causes and conditions are because the bodhisattva who creates craving is enlightened by the superior good power of the bodhisattva.",
        "source": "T12n0346_002:0170a05_1"
    },
    {
        "source_sentence": "我今宜應往詣佛所，恭敬供養彼佛、世尊及欲瞻禮作愛菩薩。」",
        "translation": "Now, it's appropriate for me to go to the Buddha and respectfully offer support to that Buddha, Bhagavān, and the bodhisattva who wants to venerate him as a beloved one.",
        "source": "T12n0346_002:0170a06_2"
    },
    {
        "source_sentence": "爾時，彼天子作是念已，即時與諸天女眷屬持以種種殊妙香華，從彼天界來詣佛所。",
        "translation": "At the time, that celestial being had this thought, and then he came to the Buddha with his retinue of goddesses and brought various kinds of exquisitely fragrant flowers from the heavenly realm to him.",
        "source": "T12n0346_002:0170a09_0"
    },
    {
        "source_sentence": "到已，頭面禮世尊足，即於佛前合掌向空遙伸敬禮作愛菩薩，然後以彼所持眾香華等尊重恭敬供養世尊。",
        "translation": "When he arrived, he bowed his head and face at the Bhagavān's feet, joined his palms in front of the Buddha, faced the sky from a distance with respect and veneration, paid homage to the Bodhisattva who loved him, and then offered support to the Bhagavān with all the fragrant flowers and so forth he held.",
        "source": "T12n0346_002:0170a10_1"
    },
    {
        "source_sentence": "「不可思議人中尊！　　不可思議大菩提！",
        "translation": "“Venerable among inconceivable people, unfathomable great enlightenment!",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　不可思議諸佛行！　　不可思議諸佛法！",
        "translation": "Inconceivable are the practices of buddhas; inconceivable are the qualities of buddhas.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　我舍衛城長者女，　　父本立名為上財，",
        "translation": "My wife, the elder woman of Śrāvastī, Formerly known as Supratiṣṭhita by her father.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　色相端嚴眾所欽，　　父母、宗親亦愛念。",
        "translation": "Their forms and features are dignified, admired by everyone, And beloved by their parents and clanspeople.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　於一時中有佛子，　　具大威德名作愛，",
        "translation": "At one time there was a Buddha-child, Endowed with great majesty and virtue, Whose name was love.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　舍衛城中乞食行，　　次第來至於我舍。",
        "translation": "In the city of Śrāvastī, they begged for food and came to my house in order.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　我時聞彼美音聲，　　適悅歡喜即取食，",
        "translation": "When I heard that beautiful sound, I was delighted and joyful, and took food.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　持食詣彼作愛前，　　以尊重心施佛子。",
        "translation": "He takes food and goes there to make love, gives it to the Buddha's child with respect.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　我時見彼妙色相，　　心生愛染欲和合，",
        "translation": "When I saw those beautiful forms and characteristics, my mind gave rise to the confluence of desire and defilement.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　彼因緣故不能成，　　我於剎那而命斷。",
        "translation": "Because of these causes and conditions, it can't be done. My life is cut off instantaneously.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　我今不能具宣說，　　作愛佛子大因緣，",
        "translation": "I can't explain the great causes and conditions for becoming a loving Buddha-child.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　於染愛法不相應，　　令我滅已生勝處。",
        "translation": "Being unassociated with defilement and craving, they cause self to cease and give rise to a superior place.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　世尊！我雖捨前報，　　快哉斷我女人相，",
        "translation": "World-Honored One, even though I forsake my former reward, How delighted it is that you have cut off my female form!",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　轉成男子大威光；　　又復得生於天界，",
        "translation": "They become men of great splendor, and are reborn in the realm of heaven.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　與我同生諸天女，　　一萬四千為眷屬；",
        "translation": "They belonged to the same group of celestial maidens as me, numbering one thousand fourteen thousand.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　復有最上七寶嚴，　　微妙宮殿同時現。",
        "translation": "There are also the most sublime adornments of the seven treasures, Sublime palaces appearing simultaneously.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　我時發生如是心，　　此為不可思議事，",
        "translation": "At the time, I had this thought: This is inconceivable.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　我以染愛心為因，　　云何得此清淨報？",
        "translation": "By taking defiled craving as the cause, how can I attain this pure reward?",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　作愛佛子甚希有，　　亦名作喜、作光明，",
        "translation": "Making craving for the Buddha-child is very rare, Also called making joy and shining light.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　我身熾盛大威光，　　由彼勝因獲如是。",
        "translation": "My body is blazing with great majesty and splendor, And as a result of that superior cause I am like this.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　染因能成如是果，　　聲聞、緣覺不能知，",
        "translation": "Defiled causes can produce such results, but śrāvakas and pratyekbuddhas cannot know them.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　而彼乘中無此法，　　唯善逝智而能轉。",
        "translation": "But there's no such thing in that vehicle, but only the knowledge of Sugata can transform it.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　假使殑伽沙數劫，　　不能修學諸佛智，",
        "translation": "Even for as many eons as there are grains of sand in the Ganges River They will be unable to cultivate the knowledge of buddhas.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　我今無餘所樂心，　　唯求無上菩提果。",
        "translation": "I now have no other desire than to seek the supreme fruit of enlightenment.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　作愛佛子大威德，　　是我最上善知識，",
        "translation": "I am the supreme spiritual benefactor, best known for my great compassion toward all living beings.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　我因彼故得見佛，　　安住菩提無退轉。",
        "translation": "Because of them I see the Buddha, Abiding peacefully in enlightenment without regressing.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　我知修行菩提者，　　於染愛心無所著，",
        "translation": "I know that those who practice enlightenment Are not attached to defiled cravings.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　如我所轉女人相，　　普願一切為男子。",
        "translation": "As I have transformed myself into a woman, may all be men.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　我前世中命終後，　　父母親族懷悲惱，",
        "translation": "In a previous life, when I died, my parents and relatives were grieved.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　恩愛極苦所纏心，　　返於沙門生忿恚。",
        "translation": "With a mind tethered by love and affection that's extremely painful, he returns to the ascetic and becomes angry.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　我今以佛威神力，　　於剎那間詣父所，",
        "translation": "Now, by the spiritual power of the Buddha’s teaching, For a moment I am going to my father.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　隱身住空而白言：　　『勿於沙門生忿恚，",
        "translation": "He remained silent in the sky and said, “Do not become angry with the śramaṇas.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　起忿恚者大過失，　　於長夜中受苦惱。",
        "translation": "Those who give rise to anger have great faults, and for a long time they'll experience suffering and distress.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　上財女者今我是，　　已生三十三天中，",
        "translation": "The woman with the highest wealth is now me, born in the thirty-three heavens.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　轉彼女人前報相，　　得大威光天子身。",
        "translation": "The woman's former karmic retribution was transformed into the body of a great majestic celestial prince.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　父母今詣於佛所，　　應當懺彼忿恚心，",
        "translation": "Now that my parents are going to the Buddha, I should repent of their anger.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　佛是眾生大慈父，　　一切眾生所歸趣。』」",
        "translation": "The Buddha is the great compassionate father of sentient beings and the destination of all sentient beings.'",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　父母聞說佛聲已，　　即起廣大增勝心，",
        "translation": "Having heard the Buddha’s voice uttered by their parents, They immediately aroused great determination for enlightenment.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　爾時父母承佛力，　　應聲即詣於佛所。",
        "translation": "At the time, their parents, empowered by the Buddha's power, responded to his voice and went to the Buddha.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　到已頭面禮佛足，　　懺悔先起忿恚心，",
        "translation": "On arriving, they bowed their heads and feet at the Buddha’s feet. Having repented, they first aroused an angry feeling of hatred.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　白言：「我今歸依佛。」　　合掌又復伸問言：",
        "translation": "They said, “Now I take refuge in the Buddha.” folding their palms together, they again asked,",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "「佛、法、僧寶最尊勝，　　當云何作供養事？",
        "translation": "The Buddha, Dharma, and Sangha treasures are most honored. How should we make offerings to them?",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　唯佛能知我心意，　　如我所問願佛說。」",
        "translation": "Only the Buddha can know my mind and thoughts, so please tell me what I've asked.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　發是言已諦誠住，　　一心渴仰而聽受。",
        "translation": "Having uttered these words, they truly abide, singlemindedly eagerly listening and accepting them.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　佛告上財父母言：　　「汝今諦聽我所說，",
        "translation": "The Buddha said to the wealthy man’s parents, “Listen attentively to what I teach.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　若欲供養諸佛者，　　應當發起菩提心。",
        "translation": "If you want to make offerings to the buddhas, you should give rise to the mind of enlightenment.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　當知汝女上財者，　　五百生中種善根，",
        "translation": "You should know that your daughter with the highest wealth planted roots of goodness in five hundred lifetimes,",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　今轉女身為天子，　　為汝父母善開導。」",
        "translation": "Now that the woman is transformed into a celestial child, she's well enlightened for your parents.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　父母聞佛如是語，　　即發無上菩提心，",
        "translation": "Their parents heard the Buddha’s words like this And immediately aroused the aspiration for enlightenment.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　歡喜稱讚作是言：　　「人中大仙如實語。」",
        "translation": "They rejoiced and praised him, saying, The great sages among men speak as they really are.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　爾時佛告阿難言：　　「汝今證知如是事，",
        "translation": "It was then that the Buddha said to Ānanda:",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　菩薩方便不思議，　　於染心中得淨報。",
        "translation": "The bodhisattva's skillful means are inconceivable, and he attains pure rewards in a defiled mind.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　如上財女所轉相，　　一切眾生亦如是，",
        "translation": "Like the characteristics of a woman of great wealth, so are all sentient beings likewise.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　阿難！如是勝功德，　　能令眾生皆離苦。",
        "translation": "Ānanda, such excellent qualities as these Can cause sentient beings to be freed from suffering.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　今此天子勝福報，　　於染愛心常清淨，",
        "translation": "This celestial being, the supremely blessed retribution of virtue, Is always pure in defilement and craving.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　而能恭敬佛世尊，　　尊重無上菩提故。",
        "translation": "They can honor the Buddha, the Bhagavān, Because they revere supreme enlightenment.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　多劫已曾供養佛，　　於諸佛所種善根，",
        "translation": "For many eons they have honored buddhas And planted roots of goodness in the presence of those buddhas.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "　堅固安住菩提心，　　決定當得菩提果。」",
        "translation": "Abiding firmly in the mind of enlightenment, they'll surely attain the fruit of enlightenment.",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "作供養已，右繞三匝，合掌向佛說伽陀曰：爾時，尊者阿難白佛言：「世尊！",
        "translation": "After making this offering, he circumambulated the Buddha three times to his right with joined palms and said to him, Gautama, At that point, Venerable Ānanda said to the Buddha, Bhagavān!",
        "source": "T12n0346_002:0170a13_2"
    },
    {
        "source_sentence": "如我意者，譬如須彌山王眾寶所成，雖種種寶有種種色，彼黃金色而為最上。",
        "translation": "As I wish, it's like Sumeru the king of mountains made of various treasures, which although various treasures have various colors, that golden color is the most superior.",
        "source": "T12n0346_002:0170c15_3"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，若清淨心、若染污心、若住法心、若隱法心，雖種種心如是差別，",
        "translation": "“Just so it is with the minds of enlightening beings: whether pure, defiled, abiding in truth, or concealed from truth— although various minds may be like this distinction,",
        "source": "T12n0346_002:0170c17_4"
    },
    {
        "source_sentence": "彼一切智心而為最上。",
        "translation": "It's the mind of omniscience and yet the highest.",
        "source": "T12n0346_002:0170c19_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0346_002:0170c19_6"
    },
    {
        "source_sentence": "諸菩薩摩訶薩最初安住一切智心，於諸染法悉能清淨。",
        "translation": "When bodhisattvas, mahāsattvas first abide in the mind of omniscience, they can purify all defiled dharmas.",
        "source": "T12n0346_002:0170c20_0"
    },
    {
        "source_sentence": "又如有藥名曰善現，能治世間一切病苦。",
        "translation": "Also, there's a medicine named good manifestation that can treat all the illnesses and pains of the world.",
        "source": "T12n0346_002:0170c21_1"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，住一切智心已，能斷除貪、瞋、癡等諸煩惱病。」",
        "translation": "So it is with the bodhisattva-mahāsattva who abides in the mind of omniscience and can stop the afflictive illnesses of craving, anger, and delusion.",
        "source": "T12n0346_002:0170c22_2"
    },
    {
        "source_sentence": "爾時，世尊讚尊者阿難言：「善哉，阿難！",
        "translation": "It was then that the Bhagavān praised Venerable Ānanda, saying, Good, Ānanda!",
        "source": "T12n0346_002:0170c24_0"
    },
    {
        "source_sentence": "如汝所說，如是如是。」",
        "translation": "As you say, so it is.",
        "source": "T12n0346_002:0170c24_1"
    },
    {
        "source_sentence": "爾時，尊者大迦葉前白佛言：「希有，世尊！",
        "translation": "At that point, Venerable Mahākāśyapa went to the Buddha and said, Rarely, Bhagavān!",
        "source": "T12n0346_002:0170c26_0"
    },
    {
        "source_sentence": "菩薩摩訶薩能行最上寂靜之行，能於一切眾生起悲愍心，常所利益。",
        "translation": "The bodhisattva Mahāsattva can perform the supreme practice of quiescence, which enables him to give rise to compassion for all sentient beings and always benefit them.",
        "source": "T12n0346_002:0170c26_1"
    },
    {
        "source_sentence": "又復能修空、無相、無願解脫法門，不樂聲聞、緣覺之法，於一切處不離一切智心，",
        "translation": "They can also cultivate the teaching of liberation through emptiness, signlessness, and wishlessness; they do not delight in the teachings of the disciples or self-enlightened ones. In all places they do not leave the mind of omniscience.",
        "source": "T12n0346_002:0170c28_2"
    },
    {
        "source_sentence": "具不可思議善巧方便。",
        "translation": "He possesses inconceivable skillful means.",
        "source": "T12n0346_002:0171a01_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0346_002:0171a01_4"
    },
    {
        "source_sentence": "諸菩薩摩訶薩一切所行無著、無礙，於色、聲、香、味、觸境中行而不取、亦無起作。",
        "translation": "The bodhisattvas, mahāsattvas, and all their actions are unattached and unobstructed, and they act without grasping form, sound, odor, taste, touch, or objects, and they don't give rise to anything.",
        "source": "T12n0346_002:0171a01_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0346_002:0171a03_6"
    },
    {
        "source_sentence": "我今樂說譬喻明菩薩行，願佛世尊聽許我說。」",
        "translation": "Now, I'd like to explain the bodhisattva's practice in terms of metaphors and illustrations, so may the Bhagavān allow me to explain it.",
        "source": "T12n0346_002:0171a03_7"
    },
    {
        "source_sentence": "佛言：「大迦葉！",
        "translation": "The Buddha said, Mahākāśyapa!",
        "source": "T12n0346_002:0171a04_8"
    },
    {
        "source_sentence": "樂說當說，今正是時。」",
        "translation": "It's now the right time to explain it, and I'll explain it.",
        "source": "T12n0346_002:0171a05_9"
    },
    {
        "source_sentence": "大迦葉言：「世尊！",
        "translation": "Mahākāśyapa said, Bhagavān!",
        "source": "T12n0346_002:0171a05_10"
    },
    {
        "source_sentence": "譬如世間有無數百千人眾，於其曠野險難之處見有一門，而彼人眾爾時各各從其門入。",
        "translation": "It's like when there are countless hundreds of thousands of people in the world who see a door at a dangerous place in the wilderness, and each of those people enter through their door at that time.",
        "source": "T12n0346_002:0171a06_0"
    },
    {
        "source_sentence": "過是門已，次見道路，其路懸曠，險惡多難。",
        "translation": "After passing through this gate, he next saw a road that was so precipitous and difficult to cross.",
        "source": "T12n0346_002:0171a08_0"
    },
    {
        "source_sentence": "彼諸人眾見是路已，咸生怖畏。",
        "translation": "Seeing this road, the people became frightened and fearful.",
        "source": "T12n0346_002:0171a08_1"
    },
    {
        "source_sentence": "是時，有一智人具善方便，欲為多人利益安樂，即告眾言：『汝等當知，",
        "translation": "Then one wise person, endowed with skillful means and wishing to bring benefit and happiness to many people, said to the assembly:",
        "source": "T12n0346_002:0171a09_2"
    },
    {
        "source_sentence": "去此不遠有一大城。",
        "translation": "Not far from here there’s a big city.",
        "source": "T12n0346_002:0171a11_3"
    },
    {
        "source_sentence": "其城廣闊，嚴麗清淨；",
        "translation": "The city was wide and spacious, grand and pure.",
        "source": "T12n0346_002:0171a11_4"
    },
    {
        "source_sentence": "人民熾盛，安隱豐饒。",
        "translation": "The people are prosperous and peaceful and abundant.",
        "source": "T12n0346_002:0171a12_5"
    },
    {
        "source_sentence": "入彼城者，適悅快樂。",
        "translation": "Those who enter that city will be delighted and happy.",
        "source": "T12n0346_002:0171a12_6"
    },
    {
        "source_sentence": "誰當愛樂入其城中，即能遠離險難怖畏。』",
        "translation": "Who will delight in entering the city, and they'll be able to avoid danger and fear?'",
        "source": "T12n0346_002:0171a13_7"
    },
    {
        "source_sentence": "時彼眾中有一類人聞是語已，即時發言：『我今樂入。』",
        "translation": "After hearing these words, a certain group of people in the crowd immediately said, 'Now, I'd like to enter.'",
        "source": "T12n0346_002:0171a14_0"
    },
    {
        "source_sentence": "入是城已，見其豐饒、安隱、快樂，生希有想，愛著不捨，即於彼住不復樂出。",
        "translation": "Having entered this city, he saw its prosperity, peace and happiness. He thought of it as rare and attached to it but did not let go of it. So he stayed in that city and did not delight in going out.",
        "source": "T12n0346_002:0171a15_1"
    },
    {
        "source_sentence": "有一類人聞說其城，即時發言：『我亦隨順入彼城中。』",
        "translation": "When a certain group of people heard about the city, they immediately said, 'I'll follow them into that city as well.'",
        "source": "T12n0346_002:0171a16_2"
    },
    {
        "source_sentence": "是人雖入，不樂彼住，後復還出。",
        "translation": "Even though he enters, that person doesn't delight in their abode and returns back out afterward.",
        "source": "T12n0346_002:0171a18_0"
    },
    {
        "source_sentence": "又復眾中有一類人雖聞是語，不能前詣入彼城中。",
        "translation": "Again, there was a certain group of people in the crowd who heard these words but couldn't go or enter the city even if they did.",
        "source": "T12n0346_002:0171a18_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0346_002:0171a19_2"
    },
    {
        "source_sentence": "彼有智人過此城已，又復行於曠野險路。",
        "translation": "After passing through this city, that wise man again traveled on a dangerous path in the wilderness.",
        "source": "T12n0346_002:0171a20_0"
    },
    {
        "source_sentence": "出是路已，見一道徑，其徑狹小，可一尺量。",
        "translation": "After leaving this path, he saw a path that was as small as one foot in circumference.",
        "source": "T12n0346_002:0171a20_1"
    },
    {
        "source_sentence": "徑之左面有一大坑深百千肘、徑之右面復一大坑深百千肘，若或有人墮是坑者不能出離。",
        "translation": "On the left side of the pathway, there's a large pit 100,000 feet deep on the right side of the pathway, and another large pit 100,000 feet deep on the right side of the pathway; if someone falls into this pit, they can't escape.",
        "source": "T12n0346_002:0171a21_2"
    },
    {
        "source_sentence": "彼徑四向，有一類人發是聲言：『我於此處生大怖畏。』",
        "translation": "In the four directions of that path, there's a certain type of person who gives rise to this sound, saying, 'I have great fear here.'",
        "source": "T12n0346_002:0171a23_3"
    },
    {
        "source_sentence": "又復去彼狹徑不遠有四衢道，一類人眾遊履其道，隨其所向彼彼皆能見有大城；",
        "translation": "Again, not far from the narrow path there are four major thoroughfares that lead in all directions. All kinds of people travel on these streets and see the great city wherever they may be.",
        "source": "T12n0346_002:0171a25_4"
    },
    {
        "source_sentence": "如如所見，彼彼隨應而生愛樂。",
        "translation": "As they see it, craving and pleasure arise according to their responses.",
        "source": "T12n0346_002:0171a27_0"
    },
    {
        "source_sentence": "時彼智人見是狹徑已，即行其徑到安隱處。",
        "translation": "Seeing this narrow path, the wise man then went on his way to a peaceful place.",
        "source": "T12n0346_002:0171a27_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0346_002:0171a28_2"
    },
    {
        "source_sentence": "世間無數百千人者，當知即是諸愚異生。",
        "translation": "Countless hundreds of thousands of people in the world, you should know that they are ignorant and unenlightened creatures.",
        "source": "T12n0346_002:0171a28_3"
    },
    {
        "source_sentence": "「一門者，當知即是取一有身；",
        "translation": "“One aspect is to know that it is the grasping of a single existent body.",
        "source": "T12n0346_002:0171b01_0"
    },
    {
        "source_sentence": "彼曠野險難中見道路者，當知即是生死險難之路；",
        "translation": "Those who see the road in the wilderness, through danger and difficulty, should be known to be on the dangerous path of birth and death.",
        "source": "T12n0346_002:0171b01_1"
    },
    {
        "source_sentence": "其路懸曠者，當知即是無明、有、愛，為因受果極懸遠故。",
        "translation": "It should be known that this is ignorance, existence and thirst: because the cause and the fruit of feeling are extremely remote.",
        "source": "T12n0346_002:0171b02_2"
    },
    {
        "source_sentence": "彼有智人能唱導者，當知即是具善巧方便菩薩摩訶薩；",
        "translation": "Those wise people who can give instructions are, you should know, the bodhisattva mahāsattvas endowed with skill in means.",
        "source": "T12n0346_002:0171b04_3"
    },
    {
        "source_sentence": "彼大城者，即是二乘所證涅盤。",
        "translation": "That great city is the nirvāṇa realized by the two vehicles.",
        "source": "T12n0346_002:0171b05_4"
    },
    {
        "source_sentence": "有一類人入彼大城愛樂安住、不求出者，當知即是聲聞、緣覺，下劣信解，",
        "translation": "If there is a certain kind of person who enters that great city, delights in peaceful abiding and doesn’t seek to leave it, you should know that they are śrāvakas and pratyekbuddhas, with inferior faith and understanding.",
        "source": "T12n0346_002:0171b06_5"
    },
    {
        "source_sentence": "生止息想；",
        "translation": "They give rise to perceptions of calmness and stillness.",
        "source": "T12n0346_002:0171b07_6"
    },
    {
        "source_sentence": "彼一類人亦欲隨順入其城中，不樂安住、後還出者，當知即是餘諸菩薩，",
        "translation": "Those of one class who also want to go along with them into the city but don't like to stay there and then come back out, you should know that they are other bodhisattvas.",
        "source": "T12n0346_002:0171b07_7"
    },
    {
        "source_sentence": "成就最上信解心故；",
        "translation": "It is because they have perfected the supreme mind of faith and understanding.",
        "source": "T12n0346_002:0171b09_8"
    },
    {
        "source_sentence": "彼一類人雖聞是語不能前詣入其城者，當知即是少福、無智、諸外道輩。",
        "translation": "Those of one type who hear these words but can't go or enter their city, you should know that they're a group of people with little merit, no wisdom, and non-Buddhists.",
        "source": "T12n0346_002:0171b10_0"
    },
    {
        "source_sentence": "彼有智人過此城已又復出彼曠野路者，當知即是具善巧方便菩薩摩訶薩精進波羅蜜多故。",
        "translation": "That wise person who goes beyond this city and then leaves the path in the wilderness is known to be the bodhisattva Mahāsattva who possesses the perfection of skillful means and the perfection of effort.",
        "source": "T12n0346_002:0171b11_1"
    },
    {
        "source_sentence": "彼一尺量狹徑路者，當知即是最上法界；",
        "translation": "You should know that the narrow path of one foot is the highest realm of reality.",
        "source": "T12n0346_002:0171b13_2"
    },
    {
        "source_sentence": "左面坑者，當知即是彼聲聞地；",
        "translation": "You should know that the pit on the left side is the place of those śrāvakas.",
        "source": "T12n0346_002:0171b14_3"
    },
    {
        "source_sentence": "右面坑者，當知即是彼緣覺地。",
        "translation": "The right-hand pit is known to be the stage of those pratyekabuddhas.",
        "source": "T12n0346_002:0171b15_4"
    },
    {
        "source_sentence": "彼徑四面有一類人發怖畏聲者，當知即是諸天魔王及魔眷屬；",
        "translation": "On each of the four sides of this path, there is a certain kind of person who makes a terrifying noise. You should know that these are the heavenly Māra kings and their associates.",
        "source": "T12n0346_002:0171b16_5"
    },
    {
        "source_sentence": "彼四衢道者，即是四攝法門。",
        "translation": "Those four paths are the four ways to gather the Dharma.",
        "source": "T12n0346_002:0171b17_6"
    },
    {
        "source_sentence": "隨其所向彼彼皆能見大城者，當知即是彼二乘人，隨其所應見佛功德、見佛所行及佛智慧，",
        "translation": "Those who are able to see the great city wherever they go, you should know that they are people of the two vehicles. According to their capacities, they can see the Buddha’s qualities, what he does and his knowledge.",
        "source": "T12n0346_002:0171b18_7"
    },
    {
        "source_sentence": "生愛樂故；",
        "translation": "It is because they give rise to affection and pleasure.",
        "source": "T12n0346_002:0171b20_8"
    },
    {
        "source_sentence": "時彼智人到安隱處者，當知即是到一切智地。",
        "translation": "When that wise person reaches a peaceful place, you should know that he's reached the stage of omniscience.",
        "source": "T12n0346_002:0171b20_9"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0346_002:0171b21_10"
    },
    {
        "source_sentence": "如是等譬喻說者，當知皆是菩薩摩訶薩善巧方便引導眾生，是為菩薩最上勝行。",
        "translation": "You should know that all of these metaphors and explanations are the bodhisattva Mahāsattva's skillful means of guiding sentient beings, which is the most excellent practice of a bodhisattva.",
        "source": "T12n0346_002:0171b21_11"
    },
    {
        "source_sentence": "以是義故，我於菩薩摩訶薩所應敬禮。」",
        "translation": "Because of this meaning, I should venerate the bodhisattva Mahāsattva.",
        "source": "T12n0346_002:0171b23_12"
    },
    {
        "source_sentence": "爾時，世尊讚尊者大迦葉言：「善哉，善哉。",
        "translation": "It was then that the Bhagavān praised Venerable Mahākāśyapa, saying, Good, good!",
        "source": "T12n0346_002:0171b25_0"
    },
    {
        "source_sentence": "汝大迦葉善說此語。」",
        "translation": "You, Mahākāśyapa, are good at speaking these words.",
        "source": "T12n0346_002:0171b25_1"
    },
    {
        "source_sentence": "當佛如是讚迦葉時，會中有萬二千眾生得天人身，皆發阿耨多羅三藐三菩提心。",
        "translation": "When the Buddha thus praised Kāśyapa, 12,000 sentient beings in the assembly attained heavenly bodies and all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0346_002:0171b26_2"
    },
    {
        "source_sentence": "佛告大迦葉言：「汝今當知，菩薩摩訶薩具善巧方便者，已能成就無量功德，",
        "translation": "The Buddha told Mahākāśyapa, Now you should know that the bodhisattva Mahāsattva who is endowed with skillful means has already attained immeasurable virtue.",
        "source": "T12n0346_002:0171b28_3"
    },
    {
        "source_sentence": "於一切時雖有所作，不復起彼諸不善業，於自、於他遠離過失。」",
        "translation": "Even though they do something at all times, they don't again give rise to those unwholesome actions and are free of faults for themselves or others.",
        "source": "T12n0346_002:0171c01_0"
    },
    {
        "source_sentence": "爾時，智上菩薩摩訶薩於佛會中見如是事、聞如是法，又復恭敬，前白佛言：「云何，",
        "translation": "At that time the wise bodhisattva Mahāsattva, seeing such things and hearing such teachings in the Buddha’s assembly, venerated them again and said to the Buddha:",
        "source": "T12n0346_002:0171c03_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0346_002:0171c04_1"
    },
    {
        "source_sentence": "往昔為一生補處菩薩時，於彼迦葉如來法中曾作是語：『何故剃鬚髮？",
        "translation": "In the past, when he was a bodhisattva of one lifetime's worth, he once said this in the Tathāgata's teaching to Kāśyapa, 'Why did he shave his hair?'",
        "source": "T12n0346_002:0171c04_2"
    },
    {
        "source_sentence": "云何求菩提而此菩提最上難得？』",
        "translation": "How is it that seeking enlightenment is so difficult and this enlightenment is the highest and most difficult to attain?'",
        "source": "T12n0346_002:0171c06_3"
    },
    {
        "source_sentence": "昔作是語當有何義？",
        "translation": "What's the meaning of saying this in the past?",
        "source": "T12n0346_002:0171c07_4"
    },
    {
        "source_sentence": "願佛于今為我宣說。」",
        "translation": "May the Buddha now explain it for me.",
        "source": "T12n0346_002:0171c07_5"
    },
    {
        "source_sentence": "佛告智上菩薩摩訶薩言：「止，善男子！",
        "translation": "The Buddha addressed the wise bodhisattva Mahāsattva, saying, Stop, good man!",
        "source": "T12n0346_002:0171c08_6"
    },
    {
        "source_sentence": "勿作是語。",
        "translation": "Don't say that.",
        "source": "T12n0346_002:0171c09_7"
    },
    {
        "source_sentence": "當知菩薩摩訶薩隨其所行、隨有所說，非無利益。",
        "translation": "You should know that whatever the bodhisattva Mahāsattva does and whatever he teaches, it's not without benefit.",
        "source": "T12n0346_002:0171c09_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0346_002:0171c10_9"
    },
    {
        "source_sentence": "具不可思議方便菩薩見彼彼正士，隨所應住於彼彼眾生如應調伏，一切所行當知不離菩薩摩訶薩善巧方便。",
        "translation": "Endowed with inconceivable skillful means, the bodhisattva sees those who are righteous and follows them wherever they should live so that sentient beings are disciplined as they should be, knowing that all their actions don't part from the skillful means of the bodhisattva Mahāsattva.",
        "source": "T12n0346_002:0171c10_10"
    },
    {
        "source_sentence": "「復次，智上！",
        "translation": "Furthermore, Zhixiang!",
        "source": "T12n0346_002:0171c14_0"
    },
    {
        "source_sentence": "我今為汝廣說菩薩摩訶薩善巧方便甚深正法，汝應諦聽，如善作意。",
        "translation": "Now, I'll explain the profound right teaching of the bodhisattva-mahāsattva's skillful means for you in detail, so listen closely and well-consideredly.",
        "source": "T12n0346_002:0171c14_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0346_002:0171c15_2"
    },
    {
        "source_sentence": "如我往昔為菩薩時，於燃燈佛所成就不可思議方便。",
        "translation": "It's like when I was a bodhisattva in the past and accomplished inconceivable skillful means at the Burning Lamp Buddha's place.",
        "source": "T12n0346_002:0171c16_0"
    },
    {
        "source_sentence": "爾時，我於彼佛法中證得無生法忍，從是已後，我為得忍菩薩。",
        "translation": "At the time, I realized the forbearance of the nonarising of the Dharma in that Buddha's teaching, and after that, I became the bodhisattva who attained forbearance.",
        "source": "T12n0346_002:0171c17_1"
    },
    {
        "source_sentence": "為菩提故轉復精進，若一劫、若百劫，未甞懈倦、未甞厭捨、未甞失念，",
        "translation": "For the sake of enlightenment, they develop further and further effort, for an eon or a hundred eons without weariness or laziness, without weariness or indifference, without torpor or loss of mindfulness.",
        "source": "T12n0346_002:0171c18_2"
    },
    {
        "source_sentence": "數數來此輪迴趣中以善方便救度眾生，以自慧力隨諸所作悉得成就，於後邊際不作住想，",
        "translation": "In this transmigration of rebirth they save sentient beings by means of skillful means. By the power of their own wisdom they accomplish whatever they do, without any thought of dwelling in the extremes.",
        "source": "T12n0346_002:0171c20_3"
    },
    {
        "source_sentence": "為利眾生無有休息。",
        "translation": "In order to benefit sentient beings, there's no resting.",
        "source": "T12n0346_002:0171c22_4"
    },
    {
        "source_sentence": "當知此是菩薩摩訶薩善巧方便。",
        "translation": "You should know that this is the skillful means of the bodhisattva Mahāsattva.",
        "source": "T12n0346_002:0171c22_5"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T12n0346_002:0171c24_0"
    },
    {
        "source_sentence": "我為菩薩時，為菩提故，雖入聲聞寂靜三摩地，乃至入菩薩三摩地，若身、若心無出沒想；",
        "translation": "“At the time of enlightening beings, for the sake of enlightenment I entered into the state of concentration called ‘silent tranquillity’ in which all listeners are absorbed. Though I entered into the state of concentration called ‘bodhisattva-samādhi’ with neither body nor mind, there was no thought of going or coming out from it.",
        "source": "T12n0346_002:0171c24_1"
    },
    {
        "source_sentence": "雖得寂靜樂而不住著；",
        "translation": "Though they attain the bliss of tranquility, yet they do not cling to it.",
        "source": "T12n0346_002:0171c26_2"
    },
    {
        "source_sentence": "雖在三摩地而精進不懈，以六波羅蜜多、四攝法門教化眾生，諸有所作未甞懈息。",
        "translation": "Although he's in samādhi, he doesn't tirelessly exert effort and teaches sentient beings with the six perfections and four methods of collecting dharmas, and he doesn't cease doing anything.",
        "source": "T12n0346_002:0171c26_3"
    },
    {
        "source_sentence": "當知此是菩薩摩訶薩善巧方便。",
        "translation": "You should know that this is the skillful means of the bodhisattva Mahāsattva.",
        "source": "T12n0346_002:0171c28_4"
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "Again, good man!",
        "source": "T12n0346_002:0171c29_5"
    },
    {
        "source_sentence": "我為菩薩時——已得一生補處，將欲成道轉大法輪——即於兜率天宮如實觀察：『我今為當於此天中成等正覺轉法輪耶？",
        "translation": "When I'm a bodhisattva - having gained my one-birth patch, I want to become a buddha and turn the great wheel of the Dharma - I truly observe it in the palace of Tuṣita Heaven, saying, 'Now, will I turn the wheel of the Dharma in this heaven when I become perfectly awakened?'",
        "source": "T12n0346_002:0171c29_6"
    },
    {
        "source_sentence": "為人間耶？』",
        "translation": "Is for the sake of the people?'",
        "source": "T12n0346_002:0172a03_7"
    },
    {
        "source_sentence": "如是觀察，又復思惟：『我若即於天中作此利者，閻浮提人不得聞法；",
        "translation": "Observing them in this way, they also think: If I were to work for these benefits in heaven, the people of Jambudvfpa wouldn’t be able to hear the Dharma.",
        "source": "T12n0346_002:0172a03_8"
    },
    {
        "source_sentence": "若於閻浮提中作此利者，而此諸天不得聞法。",
        "translation": "If someone creates this benefit in Jambudvīpa, these gods won't hear the teaching.",
        "source": "T12n0346_002:0172a05_9"
    },
    {
        "source_sentence": "我今隨其所宜，但應下降閻浮提中成等正覺，而此諸天亦可利益。』",
        "translation": "Now, according to their appropriateness, I should simply descend into Jambudvīpa and become perfectly enlightened, and these gods will also benefit.'",
        "source": "T12n0346_002:0172a06_10"
    },
    {
        "source_sentence": "又復菩薩思惟觀察：『我若從此兜率天宮沒已下生人間，不入胎藏現受生相，",
        "translation": "“Furthermore, the bodhisattva contemplates and observes: If I were to descend from this heavenly palace in Tuṣita Heaven and rebirth among humans after having been born there, without entering the womb, I would show birth.",
        "source": "T12n0346_002:0172a07_11"
    },
    {
        "source_sentence": "於須臾間便成正覺者，彼閻浮提所有眾生當起疑念：「此釋迦菩薩從何所來？",
        "translation": "Those who quickly become perfectly enlightened in a moment will have all the sentient beings in Jambudvfpa give rise to doubtful thoughts, Where did this bodhisattva Śākyamuni come from?",
        "source": "T12n0346_002:0172a09_12"
    },
    {
        "source_sentence": "天中來耶？",
        "translation": "Is it coming from heaven?",
        "source": "T12n0346_002:0172a11_13"
    },
    {
        "source_sentence": "乾闥婆中來耶？",
        "translation": "Is it from among the gandharvas?",
        "source": "T12n0346_002:0172a11_14"
    },
    {
        "source_sentence": "變化來耶？」』",
        "translation": "Is the transformation coming?'",
        "source": "T12n0346_002:0172a11_15"
    },
    {
        "source_sentence": "以是緣故，從天中沒，下降閻浮，隨順世間，入母胎藏。",
        "translation": "Because of these conditions, he descended from the heavens and descended to Jambudvīpa, followed the world, and entered his mother’s womb.",
        "source": "T12n0346_002:0172a12_16"
    },
    {
        "source_sentence": "當知此是菩薩摩訶薩善巧方便。",
        "translation": "You should know that this is the skillful means of the bodhisattva Mahāsattva.",
        "source": "T12n0346_002:0172a13_17"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T12n0346_002:0172a15_0"
    },
    {
        "source_sentence": "菩薩雖住胎藏，世間眾生不應於此作實住想。",
        "translation": "Although the bodhisattva abides in the womb, worldly sentient beings shouldn't think of it as a real abode.",
        "source": "T12n0346_002:0172a15_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0346_002:0172a16_2"
    },
    {
        "source_sentence": "菩薩本從無垢寂靜三摩地安詳而起。",
        "translation": "The bodhisattva originally arose from the pure and tranquil samādhi of peace.",
        "source": "T12n0346_002:0172a16_3"
    },
    {
        "source_sentence": "從天中沒、下降人間、處胎受生、出家苦行，乃至坐菩提場成等正覺、降伏魔眾、轉大法輪，",
        "translation": "He descended from heaven, descended among humans, was born in the womb, renounced domestic life, and practiced austerities. Having sat on the seat of enlightenment, he became perfectly enlightened, overcame the hosts of Māra, and turned the great wheel of the Dharma.",
        "source": "T12n0346_002:0172a17_4"
    },
    {
        "source_sentence": "如是一切所作，菩薩於中清淨、無染，無動、無轉，不出、不沒。",
        "translation": "Thus, all these things that the bodhisattva does are pure and undefiled, unmoving and unchanging, neither coming out nor going in.",
        "source": "T12n0346_002:0172a19_5"
    },
    {
        "source_sentence": "以是義故，應知清淨行菩薩不實住胎藏，當知此是菩薩摩訶薩善巧方便。",
        "translation": "Because of this meaning, you should know that the purely practicing bodhisattva doesn't really abide in the womb, and you should know that this is the skillful means of the bodhisattva Mahāsattva.",
        "source": "T12n0346_002:0172a20_6"
    },
    {
        "source_sentence": "「又復何緣菩薩但現胎生、不現餘生耶？",
        "translation": "Again, what is the reason why a bodhisattva appears only in the womb and no other births?",
        "source": "T12n0346_002:0172a22_7"
    },
    {
        "source_sentence": "所謂：菩薩於一切眾生中最上、最勝，是潔白分，純一無雜。",
        "translation": "The supreme and most excellent of all sentient beings, the bodhisattva's pure and white parts are pure and unadulterated.",
        "source": "T12n0346_002:0172a23_8"
    },
    {
        "source_sentence": "以如是相現處胎生，當知此是菩薩摩訶薩善巧方便。",
        "translation": "Because such characteristics are manifested in the womb as birth, you should know that this is the skillful means of the bodhisattva Mahāsattva.",
        "source": "T12n0346_002:0172a24_9"
    },
    {
        "source_sentence": "「又復菩薩初入母胎其相云何？",
        "translation": "Again, what's the characteristic of the bodhisattva's first entry into his mother's womb?",
        "source": "T12n0346_002:0172a25_10"
    },
    {
        "source_sentence": "所謂：菩薩入母胎時內外清淨，安隱無難，不苦、不惱。",
        "translation": "It means that when a bodhisattva enters his mother's womb, he's pure inside and out, peaceful and without difficulty, neither painful nor unpleasant.",
        "source": "T12n0346_002:0172a26_11"
    },
    {
        "source_sentence": "如昔天中所受快樂，菩薩入母胎時樂受相應亦復如是，不同世人攬彼父母羯邏藍等穢污不淨為入胎相。",
        "translation": "Just as the happiness experienced in heaven in the past is associated with the bliss experienced by a bodhisattva when he enters his mother's womb, so too is the defiled and impure characteristic of entering the womb because it's different from the characteristic of worldly people who embrace their parents, such as Kālāma.",
        "source": "T12n0346_002:0172a27_12"
    },
    {
        "source_sentence": "「又復何緣菩薩於母胎中住滿十月，不增減耶？",
        "translation": "Again, what is the reason why a bodhisattva remains in his mother's womb for ten months without increasing or decreasing?",
        "source": "T12n0346_002:0172b01_13"
    },
    {
        "source_sentence": "所謂：菩薩不同世人住母胎藏日月數量有增、有減，以增、減故，胎藏不圓，",
        "translation": "The enlightening beings, unlike the people of the world, abide in the mother’s womb. The number of days and months in the sun and moon increases and decreases; because they increase and decrease, the womb is incomplete:",
        "source": "T12n0346_002:0172b02_14"
    },
    {
        "source_sentence": "諸根缺減。",
        "translation": "The faculties are deficient.",
        "source": "T12n0346_002:0172b03_15"
    },
    {
        "source_sentence": "是故，菩薩滿足十月，胎藏圓滿，諸根具足，無所增減。",
        "translation": "Therefore, when the bodhisattva fulfills ten months, his womb is full, and his faculties are endowed, there's no increase or decrease.",
        "source": "T12n0346_002:0172b04_16"
    },
    {
        "source_sentence": "當知此是菩薩摩訶薩善巧方便。",
        "translation": "You should know that this is the skillful means of the bodhisattva Mahāsattva.",
        "source": "T12n0346_002:0172b05_17"
    },
    {
        "source_sentence": "「又復何緣菩薩不樂宮殿而返於其園林中生？",
        "translation": "Again, what is the reason why the bodhisattva isn't happy in his palace and returns back to being born in that forest?",
        "source": "T12n0346_002:0172b06_18"
    },
    {
        "source_sentence": "所謂：菩薩於其長時遠離憒閙，樂寂靜處，修寂靜行，有諸天、龍、夜叉、乾闥婆等常所衛護。",
        "translation": "For a long time, the bodhisattva is far removed from torpor and noise, enjoys quiet places, cultivates tranquil practices, and is always guarded by gods, dragons, yakṣas, gandharvas, and so forth.",
        "source": "T12n0346_002:0172b07_19"
    },
    {
        "source_sentence": "菩薩欲令迦毘羅城一切人民以諸香華隨喜供養，各得瞻覩。",
        "translation": "The bodhisattva wanted to cause all the people of Kapilavastu to make offerings of incense and flowers with joy, so each would be able to see them.",
        "source": "T12n0346_002:0172b09_20"
    },
    {
        "source_sentence": "以是因緣，菩薩於其園林中生。",
        "translation": "Because of these causes and conditions, the bodhisattva was born in that forest.",
        "source": "T12n0346_002:0172b10_21"
    },
    {
        "source_sentence": "「又復何緣菩薩之母攀其樹枝生菩薩耶？",
        "translation": "Again, what is the reason why the mother of the bodhisattva climbed a branch of that tree to give birth to the bodhisattva?",
        "source": "T12n0346_002:0172b11_22"
    },
    {
        "source_sentence": "謂：菩薩母不同世間所有母人，當產生時苦受相應，得大苦惱。",
        "translation": "It means that the mother of a bodhisattva is different from all the mothers in the world, and when she's born, painful feelings are associated with great suffering and distress.",
        "source": "T12n0346_002:0172b12_23"
    },
    {
        "source_sentence": "摩耶夫人生菩薩時樂受相應，得大快樂。",
        "translation": "When a bodhisattva is born in Māya, he's associated with pleasant feelings at the time and attains great happiness.",
        "source": "T12n0346_002:0172b13_24"
    },
    {
        "source_sentence": "以是因緣，菩薩之母攀彼樹枝而生菩薩。",
        "translation": "Because of these causes and conditions, the mother of the bodhisattva climbed that tree's branch and gave birth to a bodhisattva.",
        "source": "T12n0346_002:0172b14_25"
    },
    {
        "source_sentence": "「又復何緣菩薩於母胎中能念能知彼三世事，乃至菩薩入胎、住胎等事悉能知耶？",
        "translation": "Again, what is the reason why a bodhisattva can be mindful in his mother's womb and know all the events of those three worlds, even up to the point where he can know all the events of entering the womb and abiding in the womb?",
        "source": "T12n0346_002:0172b15_26"
    },
    {
        "source_sentence": "所謂：清淨行菩薩於三界中最上、最勝，正念現前，於一切法無所忘失。",
        "translation": "That is to say, the bodhisattva Pure Actions is the highest and most superior of the three realms, with right mindfulness that's manifested, forgetting nothing about all things.",
        "source": "T12n0346_002:0172b17_27"
    },
    {
        "source_sentence": "是故，菩薩雖住胎中能念能知彼一切事。",
        "translation": "Therefore, even though a bodhisattva abides in the womb, he can be mindful and know all these things.",
        "source": "T12n0346_002:0172b19_0"
    },
    {
        "source_sentence": "「又復何緣菩薩生時唯帝釋天主而來衛護？",
        "translation": "Again, what is the reason why only Indra, the lord of gods, came to protect the Bodhisattva when he was born?",
        "source": "T12n0346_002:0172b19_1"
    },
    {
        "source_sentence": "菩薩生已即為捧接，爾時無復餘天人耶？",
        "translation": "After the bodhisattva is born, he's held it in his hand, and there are no other gods or humans at that point?",
        "source": "T12n0346_002:0172b20_2"
    },
    {
        "source_sentence": "所謂：帝釋天主先發大願：『菩薩生時為作守護。』",
        "translation": "The god Indra first makes a great vow, saying, 'When the bodhisattva is born, he'll be guardian.'",
        "source": "T12n0346_002:0172b21_3"
    },
    {
        "source_sentence": "以彼往昔善根力故，是故菩薩生時唯帝釋天主而來衛護。",
        "translation": "Because of the power of their good roots from the past, only Indra, the lord of gods, came to guard the bodhisattva when he was born.",
        "source": "T12n0346_002:0172b22_4"
    },
    {
        "source_sentence": "「又復何緣菩薩生已即於四方各行七步，不減至六、不增八耶？",
        "translation": "Again, why is it that after the bodhisattva has arisen, he walks seven steps in each of the four directions without decreasing to six or increasing to eight?",
        "source": "T12n0346_002:0172b24_5"
    },
    {
        "source_sentence": "所謂：菩薩正士神通變化隨宜方便，其相如是，由此因緣但行七步，無所增減。",
        "translation": "That is to say, the characteristics of the bodhisattva's righteous person's miraculous transformations and adaptive skillful means are like this, for which reason he only walks seven steps without increasing or decreasing.",
        "source": "T12n0346_002:0172b25_6"
    },
    {
        "source_sentence": "「又復何緣行七步已即發是言：『我於世間最尊、最勝，已能解脫老、病、死法。』",
        "translation": "Again, what's the reason he took seven steps and then said, 'I'm the most honored and superior in the world, and I've been able to liberate myself from the ways of old age, illness, and death.'",
        "source": "T12n0346_002:0172b27_7"
    },
    {
        "source_sentence": "謂此梵界諸天子眾聞菩薩生悉來瞻禮，各各隨應得其利益。",
        "translation": "It means that these celestial beings in the Brahma realm hear that bodhisattvas are born and all come to pay homage, each according to their needs and benefits.",
        "source": "T12n0346_002:0172b29_8"
    },
    {
        "source_sentence": "菩薩爾時即自思惟：『但此梵界諸天子眾得知是事，我今欲令一切普得聞知。』",
        "translation": "It was then that the bodhisattva thought to himself, 'It's just that the gods of the Brahma realm know this matter, and now I want to cause them all to hear and know it.'",
        "source": "T12n0346_002:0172c01_9"
    },
    {
        "source_sentence": "作是念已，乃發聲言：『我於世間最尊、最勝，已能解脫老、病、死法。』",
        "translation": "After he had this thought, he spoke out, saying, 'I'm the most honored and superior in the world, and I've been able to liberate myself from the dharmas of old age, illness, and death.'",
        "source": "T12n0346_002:0172c03_10"
    },
    {
        "source_sentence": "發是言時，所有三千大千世界諸天子眾及諸梵眾聞是聲已，於須臾間一切皆來至菩薩所，",
        "translation": "When he had uttered these words, all the celestial beings and Brahmā goddesses of the great manifold cosmos came to the enlightening being in an instant.",
        "source": "T12n0346_002:0172c04_11"
    },
    {
        "source_sentence": "合掌恭敬，隨喜稱讚。",
        "translation": "They joined their palms in respect and praised him accordingly.",
        "source": "T12n0346_002:0172c06_12"
    },
    {
        "source_sentence": "以是因緣，乃唱是言：『我於世間最尊、最勝。』",
        "translation": "Because of these causes and conditions, they then called out, 'I'm the most honored and superior in the world.'",
        "source": "T12n0346_002:0172c07_13"
    },
    {
        "source_sentence": "佛說大方廣善巧方便經卷第二",
        "translation": "Foshuo dafangguang shanqiao shanqiao jing, vol. 2",
        "source": "T12n0346_002:0172c09_0"
    }
]