[
    {
        "source_sentence": "摩訶摩耶經卷下(一名佛昇忉利天為母說法)簫齊沙門釋曇景譯◎爾時，",
        "translation": "Mahāmāyā-sūtra, Vol. 2 (a translation of the Dharma preached by a buddha ascending to the Heaven of the Thirty-three Gods for his mother) translated by the Śākyamuni Sramanaṇī at the time,",
        "source": "T12n0383_002:1010a24_0"
    },
    {
        "source_sentence": "世尊為波斯匿王及諸大眾說妙法已，與比丘眾前後圍遶從舍衛國漸次遊行村邑、聚落——所應度者皆悉周遍——乃至到於尼連禪河。",
        "translation": "After the Bhagavān had explained the wonderful teaching for King Prasenajit and the masses, the Bhagavān and the monks were surrounded by them in front and behind him from Sāvatthī and gradually traveled from Sāvatthī to villages and towns - all the villages that should be saved - up to the Nairañjāna River.",
        "source": "T12n0383_002:1010a27_1"
    },
    {
        "source_sentence": "于時世尊既至河已，著於浴衣入河洗浴。",
        "translation": "When the Bhagavān arrived at the river, he put on his bathing robes and went into the river to wash and bathe.",
        "source": "T12n0383_002:1010b01_2"
    },
    {
        "source_sentence": "時無量百千天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，",
        "translation": "Measureless hundreds of thousands of gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, nonhumans, and so forth.",
        "source": "T12n0383_002:1010b02_3"
    },
    {
        "source_sentence": "既見如來在河澡浴，各持種種塗香、末香而來供養。",
        "translation": "They saw that the Tathāgata was bathing in the river, and they each brought various ointments and powdered incense to offer as an offering.",
        "source": "T12n0383_002:1010b03_4"
    },
    {
        "source_sentence": "時尼連禪河側水陸虛空，一切眾生見如來身猶如明鏡，覩妙形像皆生歡喜、悉起慈心，",
        "translation": "All the sentient beings who saw the Buddha’s body as reflected in the water at the bank of the Nairañjanā River were delighted to see it, and they all conceived great compassion.",
        "source": "T12n0383_002:1010b05_0"
    },
    {
        "source_sentence": "三毒消伏不相吞食，咸發阿耨多羅三藐三菩提心。",
        "translation": "When the three poisons are subdued and not swallowed by each other, they all give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0383_002:1010b07_1"
    },
    {
        "source_sentence": "爾時，阿難即白佛言：「今此水陸虛空之中諸眾生等見佛身已，尚生歡喜發菩提心。",
        "translation": "It was then that Ānanda said to the Buddha, Now, there are sentient beings in this water, land, and sky who see the Buddha's body and still become joyful and give rise to the mind of enlightenment.",
        "source": "T12n0383_002:1010b08_2"
    },
    {
        "source_sentence": "而提婆達多生在釋宮，佛之親屬、又作沙門，口常讀誦深妙經典，而於如來恒造逆事，",
        "translation": "Devadatta, however, was born in the palace of the Śākyas. He was a relative of the Buddha and also became a śramaṇa. Throughout his lifetime he recited profound scriptures but always did evil deeds against the Tathāgata.",
        "source": "T12n0383_002:1010b10_3"
    },
    {
        "source_sentence": "破和合僧、出佛身血、教阿闍世殺害父王，日日招集豐美飲食，而自憍慢謂與佛等，",
        "translation": "They disrupted the harmonious Sangha, drew blood from the Buddha’s bodies, and taught Ajātaśatru to kill their father. Day after day they gathered together a rich and delicious food and drink but each conceited themselves as if they were giving it to the Buddha.",
        "source": "T12n0383_002:1010b12_4"
    },
    {
        "source_sentence": "為小利養以火自燒。",
        "translation": "For minor gain, he burns it himself in the fire.",
        "source": "T12n0383_002:1010b13_5"
    },
    {
        "source_sentence": "設令諸佛欲救拔之不能為益，如騾懷妊會喪身命。」",
        "translation": "Even if the buddhas want to rescue them, they won't be able to do so, like a pregnant woman who loses her body and life in an assembly.",
        "source": "T12n0383_002:1010b14_6"
    },
    {
        "source_sentence": "爾時，世尊告阿難言：「如汝所說，提婆達多恒於我所生怨害心，自造阿鼻地獄因緣，",
        "translation": "It was then that the World-honored One said to Ānanda: Just as you say, Devadatta always had hostile feelings toward me and created the causes and conditions for his rebirth in Avīci Hell.",
        "source": "T12n0383_002:1010b15_7"
    },
    {
        "source_sentence": "一切諸佛不能救脫。",
        "translation": "All the buddhas can't save and liberate them.",
        "source": "T12n0383_002:1010b17_8"
    },
    {
        "source_sentence": "我於提婆達多極生慈愍，但其不久苦業所逼。」",
        "translation": "I am extremely compassionate toward Devadatta, but he won't be pressed by painful karma for a long time.",
        "source": "T12n0383_002:1010b17_9"
    },
    {
        "source_sentence": "時提婆達多在佛左右，聞此語已心大瞋恚，即捨於佛，與其弟子往摩竭提國投阿闍世。",
        "translation": "Devadatta then stood at the Buddha's side, and after hearing these words, he became very angry and abandoned the Buddha, leaving his disciples to go to the country of Magadha and joining the Ajātaśatru.",
        "source": "T12n0383_002:1010b19_0"
    },
    {
        "source_sentence": "而於中路有諸群烏急聲鳴喚，翻飛亂擾；",
        "translation": "On the way there were many crows roaming in distress, screaming and wailing in unison.",
        "source": "T12n0383_002:1010b21_0"
    },
    {
        "source_sentence": "又逢惡牛欲觸蹈之。",
        "translation": "Again, he met a bad ox that wanted to touch and trample it.",
        "source": "T12n0383_002:1010b21_1"
    },
    {
        "source_sentence": "其諸弟子見此相已而語之言：「我等今者觀此諸瑞非為吉祥，若所去處必無利益。」",
        "translation": "Seeing these signs, the disciples said to them, Now, we're observing these signs that aren't auspicious, and if we go there, it won't be beneficial.",
        "source": "T12n0383_002:1010b22_2"
    },
    {
        "source_sentence": "提婆達多而答之言：「汝等愚癡，何所知耶？",
        "translation": "Devadatta answered them, saying, You fools, what do you know?",
        "source": "T12n0383_002:1010b24_3"
    },
    {
        "source_sentence": "但急隨我，不須多云。」",
        "translation": "Just hurry along with me, and you won't need to say much.",
        "source": "T12n0383_002:1010b25_4"
    },
    {
        "source_sentence": "既到摩竭提國，語守門者：「汝入白王，道我在此。」",
        "translation": "When he arrived in the country of Magadha, he said to the gatekeeper, Enter and tell the king that I'm here.",
        "source": "T12n0383_002:1010b25_5"
    },
    {
        "source_sentence": "時守門人即入白王。",
        "translation": "The gatekeeper then entered and reported to the king.",
        "source": "T12n0383_002:1010b26_6"
    },
    {
        "source_sentence": "阿闍世王聞提婆達多來在外已，心大瞋恚而作是言：「乃至不欲聞其名字，",
        "translation": "When King Ajātaśatru heard that Devadatta was coming from the outside, he became very angry and said,",
        "source": "T12n0383_002:1010b27_7"
    },
    {
        "source_sentence": "何況而應眼見之耶？",
        "translation": "How could it be possible to see them with the eye?",
        "source": "T12n0383_002:1010b29_8"
    },
    {
        "source_sentence": "譬如雨雹摧折草木，在地不久還自消散；",
        "translation": "It is like a hailstorm that breaks down grass and trees, which will soon return to the ground and vanish on its own.",
        "source": "T12n0383_002:1010b29_9"
    },
    {
        "source_sentence": "如此惡人亦復如是，教人行惡壞他善根，復還自敗善根種子。」",
        "translation": "So it is with such a bad person who teaches people to do evil and destroys the good roots of others, and then returns back to destroying the seeds of the good roots on his own.",
        "source": "T12n0383_002:1010c01_10"
    },
    {
        "source_sentence": "勅守門者勿聽其前。",
        "translation": "I ordered the guards at the gate not to listen before him.",
        "source": "T12n0383_002:1010c02_11"
    },
    {
        "source_sentence": "時提婆達多見阿闍世王不許前已，心大苦惱，舉手拍頭，切齒罵詈。",
        "translation": "When Devadatta saw that King Ajātaśatru didn't allow him to do so, he became greatly distressed, raised his hand and clapped his head, cut off his teeth, and scolded him.",
        "source": "T12n0383_002:1010c03_12"
    },
    {
        "source_sentence": "時優波羅比丘尼從王宮出，而於門外見提婆達多即呵之言：「汝今釋種不得熾盛，",
        "translation": "The Upāla bhikṣuṇī then came out of the king’s palace and saw Devadatta outside the door.",
        "source": "T12n0383_002:1010c04_13"
    },
    {
        "source_sentence": "於佛法中作大留礙。」",
        "translation": "They create great obstacles in the Buddha's teaching.",
        "source": "T12n0383_002:1010c06_14"
    },
    {
        "source_sentence": "時提婆達多聞此語已極大忿恚，即以手捲而打其頭，彼比丘尼尋便命終。",
        "translation": "After hearing these words, Devadatta became very angry and screamed, and he wrapped his hand around her and beat her head; that monk and nun then died.",
        "source": "T12n0383_002:1010c07_15"
    },
    {
        "source_sentence": "提婆達多又害羅漢比丘尼故，地即開裂，有大猛火纏繞其身牽入地獄。",
        "translation": "Because Devadatta had also harmed the arhat bhikṣuṇī, the earth immediately split open and a great fierce fire entangled his body, dragging it into hell.",
        "source": "T12n0383_002:1010c09_16"
    },
    {
        "source_sentence": "「譬如行惡道，　　登涉長憂怖；",
        "translation": "“Suppose someone travels in a bad path And climbs up and down with deep sorrow and fear.",
        "source": "T12n0383_002:1010c10_17"
    },
    {
        "source_sentence": "　若到平坦處，　　安隱無愁患。",
        "translation": "If someone reaches a level place, they'll be peaceful and without sorrow.",
        "source": "T12n0383_002:1010c10_17"
    },
    {
        "source_sentence": "　生死險隘路，　　眾生恒恐怖；",
        "translation": "Birth and death are dangerous paths; Sentient beings always fear them.",
        "source": "T12n0383_002:1010c10_17"
    },
    {
        "source_sentence": "　唯有涅槃道，　　行者獲安隱。",
        "translation": "Only the path of nirvāṇa exists, and practitioners attain peace.",
        "source": "T12n0383_002:1010c10_17"
    },
    {
        "source_sentence": "　我今欲至彼，　　功德常樂處。」",
        "translation": "Now, I want to go there, where merit is always blissful.",
        "source": "T12n0383_002:1010c10_17"
    },
    {
        "source_sentence": "爾時，世尊澡浴訖已，向諸比丘而說偈言：爾時，世尊說此偈已，與阿難俱至王舍城，",
        "translation": "At that moment, having bathed himself, the World-honored One said these verses to the bhikṣus: Having bathed himself, the World-honored One went with Ānanda to the city of Rājagaha.",
        "source": "T12n0383_002:1010c10_17"
    },
    {
        "source_sentence": "為眾比丘廣說諸法；",
        "translation": "He extensively expounded the teachings to the assembly of monks.",
        "source": "T12n0383_002:1010c17_18"
    },
    {
        "source_sentence": "漸次到巴連弗邑，為諸人民、長者、居士及梵志等廣說諸法；",
        "translation": "He gradually reached the town of Paryavatī and explained the teachings in detail to the citizens, wealthy householders, householders, brahmins, and religious practitioners.",
        "source": "T12n0383_002:1010c18_19"
    },
    {
        "source_sentence": "漸次復到毘耶離城，為眾離車及[木*柰]女等廣演諸法。",
        "translation": "He gradually returned to the city of Vaiśālī and extensively explained the teachings for the assembly of Licchavi and [mu*trance] women.",
        "source": "T12n0383_002:1010c19_20"
    },
    {
        "source_sentence": "爾時，世尊舉身疾生，處處皆痛，即便顧語尊者阿難：「我於今者身體皆痛，",
        "translation": "At that time, the World-honored One’s body suddenly ached and painful everywhere. Then he looked at Venerable Ānanda and said:",
        "source": "T12n0383_002:1010c21_0"
    },
    {
        "source_sentence": "唯欲捨此朽故之身。",
        "translation": "They only want to abandon this decaying body.",
        "source": "T12n0383_002:1010c22_1"
    },
    {
        "source_sentence": "阿難當知，若比丘、比丘尼得四神足，則能住壽一劫在世、若減一劫。",
        "translation": "Ānanda, you should know that if monks and nuns attain the four miraculous powers, then they can live a life span of one world age or less in the world for an eon.",
        "source": "T12n0383_002:1010c23_2"
    },
    {
        "source_sentence": "況復如來所欲自在？」",
        "translation": "How could it be that the Tathāgata has control over what he wants?",
        "source": "T12n0383_002:1010c24_3"
    },
    {
        "source_sentence": "是時阿難魔所蔽故默然無答，乃至再三亦皆默然。",
        "translation": "Because Ānanda was hindered by Māra, he remained silent and didn't answer, and even after repeating it three times, they were also silent.",
        "source": "T12n0383_002:1010c25_4"
    },
    {
        "source_sentence": "爾時，世尊語阿難言：「汝今可往到一樹下，專精思惟，正觀諸法。」",
        "translation": "It was then that the Bhagavān said to Ānanda, Now, you may go to a tree and concentrate on contemplating and correctly observing the teachings.",
        "source": "T12n0383_002:1010c26_5"
    },
    {
        "source_sentence": "時魔波旬即來佛所，稽首禮足而白佛言：「我於往昔勸請世尊入於涅槃，",
        "translation": "Māra Pāpīyān then came to the Buddha. Having saluted him by bowing his forehead at his feet, he said: Once in the past I exhorted the World-honored One to enter nirvana.",
        "source": "T12n0383_002:1010c27_6"
    },
    {
        "source_sentence": "于時世尊而答我言：『我諸弟子——比丘、比丘尼、優婆塞、優婆夷——未具足故，",
        "translation": "At that time the World-honored One answered me, saying: Because my disciples—monks, bhikṣus, bhikṣuṇīs, laymen, and laymen—are not fully ordained.",
        "source": "T12n0383_002:1010c29_7"
    },
    {
        "source_sentence": "所以未應入於涅槃。』",
        "translation": "That's why they shouldn't enter nirvāṇa.'",
        "source": "T12n0383_002:1011a01_8"
    },
    {
        "source_sentence": "世尊今者諸四部眾皆悉具足，所度已畢，唯願善逝速入涅槃。」",
        "translation": "Bhagavān, these four groups of people are now fully endowed with what they've accomplished, so may Sunetra quickly enter nirvāṇa.",
        "source": "T12n0383_002:1011a02_9"
    },
    {
        "source_sentence": "爾時，世尊即答魔言：「善哉，波旬！",
        "translation": "It was then that the Bhagavān answered Māra, Good, Pāpīyān!",
        "source": "T12n0383_002:1011a03_10"
    },
    {
        "source_sentence": "當知如來却後三月入於涅槃。」",
        "translation": "You should know that the Tathāgata will enter nirvāṇa three months after he leaves.",
        "source": "T12n0383_002:1011a04_11"
    },
    {
        "source_sentence": "時魔波旬見佛許已，歡喜踊躍不能自勝，頂禮佛足還歸天宮。",
        "translation": "When Māra Pāpīyān saw that the Buddha had given his permission, he rejoiced and jumped joyfully but could not overcome himself. He bowed his head at the Buddha’s feet and returned to the heavenly palace.",
        "source": "T12n0383_002:1011a05_12"
    },
    {
        "source_sentence": "爾時，如來既許天魔却後三月當入涅槃，即便捨於無量之壽，以神通力故住命三月。",
        "translation": "At the time, the Tathāgata had agreed with the god Māra that he would enter nirvāṇa three months after his departure, and so he gave up an immeasurable life span and stayed there for three months because of his supernormal powers.",
        "source": "T12n0383_002:1011a07_0"
    },
    {
        "source_sentence": "于時大地六種震動，日無精光、風雨違常，天龍八部莫不駭怖，來至佛所側塞空中。",
        "translation": "The earth shook in six ways, the sun lacked energy and the wind and rain were out of season. All the gods, dragons, and the eight kinds of deities came to the Buddha’s side and blocked his sky.",
        "source": "T12n0383_002:1011a08_1"
    },
    {
        "source_sentence": "時尊者阿難見此相已心驚毛竪，疾詣佛所而白佛言：「今者何緣忽有此相？」",
        "translation": "When Venerable Ānanda saw this sign, his hair stood on end and he rushed to the Buddha and said to him, What's the reason this sign suddenly appears now?",
        "source": "T12n0383_002:1011a10_2"
    },
    {
        "source_sentence": "佛告阿難：「惡魔波旬向來我所，勸請於我令入涅槃。",
        "translation": "The Buddha told Ānanda, Evil Māra Pāpīyān came to me in the past and asked me to enter nirvāṇa.",
        "source": "T12n0383_002:1011a12_3"
    },
    {
        "source_sentence": "我已許之，即便捨壽，以神力故住命三月。」",
        "translation": "After I had given my permission, I even gave up my life and stayed there for three months because of my supernormal powers.",
        "source": "T12n0383_002:1011a13_4"
    },
    {
        "source_sentence": "阿難白佛言：「世尊常說四神足人則能住壽一劫、若減一劫，隨意自在。",
        "translation": "Ānanda said to the Buddha: The World-honored One has always taught that a person who possesses the four supernormal powers can live for one world age or, if his life span decreases by one world age, he can do as he wish.",
        "source": "T12n0383_002:1011a14_5"
    },
    {
        "source_sentence": "云何如來不久住世同於諸行？」",
        "translation": "How will the Tathāgata not live in the world long enough to be the same as all the practices?",
        "source": "T12n0383_002:1011a16_6"
    },
    {
        "source_sentence": "于時如來答阿難言：「我向為汝說如此語，魔蔽汝故不知請住。",
        "translation": "The Tathāgata then answered Ānanda, I've spoken these words for you, but Māra has blinded you; therefore, he doesn't know to invite you to stay.",
        "source": "T12n0383_002:1011a17_7"
    },
    {
        "source_sentence": "我已許之，云何住壽？",
        "translation": "I have given my permission, so what is the duration of life?",
        "source": "T12n0383_002:1011a18_8"
    },
    {
        "source_sentence": "阿難當知，一切諸行法皆如是，不得常存。」",
        "translation": "Ānanda, you should know that all conditioned dharmas are like this, and they can't always exist.",
        "source": "T12n0383_002:1011a19_9"
    },
    {
        "source_sentence": "爾時，阿難聞佛此語，迷悶懊惱不能自勝，悲號啼泣深追悔責。",
        "translation": "At the time, Ānanda heard these words of the Buddha, and he was so confused and distressed that he couldn't overcome himself, weeping and wailing in sorrow and moaning with deep remorse.",
        "source": "T12n0383_002:1011a20_0"
    },
    {
        "source_sentence": "爾時，世尊與阿難俱漸次遊行到諸國界、村邑、聚落廣說諸法，所可化度不可稱計。",
        "translation": "At the time, the Bhagavān and Ānanda were gradually traveling to various countries, towns, and villages, explaining the teachings in detail, and what they can teach and save cannot be measured.",
        "source": "T12n0383_002:1011a21_1"
    },
    {
        "source_sentence": "漸次復到鳩尸那竭國力士生地熙連河側娑羅雙樹間，而語阿難：「可安繩床而令北首，",
        "translation": "He gradually returned to the kingdom of Kuśinagara and said to Ānanda, “Please arrange a rope-bed [for me] so that I can go northward.",
        "source": "T12n0383_002:1011a23_2"
    },
    {
        "source_sentence": "我今身體極大苦痛，入於中夜當取涅槃。」",
        "translation": "Now, my body is so painful that I'll enter nirvāṇa in the middle of the night.",
        "source": "T12n0383_002:1011a25_3"
    },
    {
        "source_sentence": "阿難受教，施繩床已，佛即就臥，右脇著地。",
        "translation": "Ānanda accepted the teaching and gave him a rope bed. Then the Buddha lay down with his right shoulder touching the ground.",
        "source": "T12n0383_002:1011a26_4"
    },
    {
        "source_sentence": "爾時，阿難見佛臥已，隱於佛後悲泣流淚，極大苦惱。",
        "translation": "Seeing the Buddha lying there, Ānanda went into hiding behind him in tears of grief.",
        "source": "T12n0383_002:1011a27_5"
    },
    {
        "source_sentence": "世尊即便問諸比丘：「阿難今者為在何許？」",
        "translation": "The Bhagavān then asked the monks, Where is Ānanda now?",
        "source": "T12n0383_002:1011a28_6"
    },
    {
        "source_sentence": "諸比丘言：「近在於佛後垂淚憂惱。」",
        "translation": "The monks said, Approached behind the Buddha, weep and grieve.",
        "source": "T12n0383_002:1011a29_7"
    },
    {
        "source_sentence": "如來即以大悲梵音告阿難言：「汝今不應猶如嬰兒而自啼泣。",
        "translation": "The Tathāgata then addressed Ānanda in the voice of great compassion, saying, Now, you shouldn't weep like a baby.",
        "source": "T12n0383_002:1011b01_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0383_002:1011b02_9"
    },
    {
        "source_sentence": "生死之中皆悉如此，但當專念思惟諸法。",
        "translation": "In birth and death, they're all like this, but you should focus on contemplating the teachings.",
        "source": "T12n0383_002:1011b02_10"
    },
    {
        "source_sentence": "汝從往昔看侍我來，身、口、意業極為純善，未曾見汝有毫過失。",
        "translation": "You've been attending me since the distant past, and your physical, verbal, and mental actions are so pure and good that I've never seen you have any faults.",
        "source": "T12n0383_002:1011b03_11"
    },
    {
        "source_sentence": "今者宜應勤求解脫，忍割悲心勿自煎惱。」",
        "translation": "Now, it's appropriate to diligently seek liberation and tolerate cutting off your compassionate mind so that you won't torment yourself.",
        "source": "T12n0383_002:1011b05_12"
    },
    {
        "source_sentence": "爾時，阿難而白佛言：「如來入於般涅槃後，闍維之法當云何耶？」",
        "translation": "It was then that Ānanda said to the Buddha, After the Tathāgata enters parinirvāṇa, what will be the teaching of Jāmī?",
        "source": "T12n0383_002:1011b06_13"
    },
    {
        "source_sentence": "佛告阿難：「闍維之法如轉輪聖王，取於千端新淨之[疊*毛]用纏佛身，",
        "translation": "The Buddha said to Ānanda: Just as the cakravartin is like a universal ruler who takes one thousand pieces of pure cotton cloth and wraps it around the Buddha’s body,",
        "source": "T12n0383_002:1011b07_14"
    },
    {
        "source_sentence": "香油灑灌內金棺中，又以金棺內銀棺中，又以銀棺內銅棺中，又以銅棺內鐵棺中，",
        "translation": "He poured perfumed oil into a golden coffin, placed it inside a silver coffin, a copper coffin inside a silver coffin, and an iron coffin inside a copper coffin.",
        "source": "T12n0383_002:1011b08_15"
    },
    {
        "source_sentence": "積眾香薪而用闍維，收拾舍利起立塔廟、表剎、幡蓋種種供養。」",
        "translation": "He accumulates a multitude of fragrant firewood and uses it for religious offerings, collects the relics, builds a stūpa or shrine, displays buddhas, and makes various offerings with banners and canopies.",
        "source": "T12n0383_002:1011b10_16"
    },
    {
        "source_sentence": "爾時，世尊告阿難言：「汝今入城告諸力士，道我在此，夜入涅槃，若欲來者宜自知時。」",
        "translation": "It was then that the Bhagavān addressed Ānanda, Now, enter the city and tell the strong men to tell me here that I'll enter nirvāṇa at night; it's better to know for yourself when you want to come.",
        "source": "T12n0383_002:1011b12_17"
    },
    {
        "source_sentence": "阿難受勅即便入城，街巷道路高聲唱言：「三界大師——如來、應供——今近在於雙樹之間，",
        "translation": "Ānanda, having received this edict, entered the city. The street corners and highways cried out in unison, “The great masters of the three quarters-the Tathāgata, Arhat, and Worthy of Offerings-are now standing nearby among the twin [śāla] trees.",
        "source": "T12n0383_002:1011b14_18"
    },
    {
        "source_sentence": "當於中夜而取涅槃。",
        "translation": "He'll attain nirvāṇa in the middle of the night.",
        "source": "T12n0383_002:1011b16_0"
    },
    {
        "source_sentence": "諸人若欲禮拜、供養并欲諮決，宜知是時。」",
        "translation": "If people want to venerate, make offerings, and want to consult, it's advisable to know the right time.",
        "source": "T12n0383_002:1011b16_1"
    },
    {
        "source_sentence": "時諸力士聞此語已皆大懊惱，問阿難言：「世尊滅度一何駛哉？",
        "translation": "When the strong men heard these words, they were all greatly distressed and asked Ānanda, Bhagavān, what's the speed of the Bhagavān's extinction?",
        "source": "T12n0383_002:1011b17_2"
    },
    {
        "source_sentence": "我等從今無所依怙。」",
        "translation": "From now on, we'll have nothing to rely on.",
        "source": "T12n0383_002:1011b18_3"
    },
    {
        "source_sentence": "涕淚緣路往詣佛所。",
        "translation": "He wept and went to the Buddha's place on the road.",
        "source": "T12n0383_002:1011b19_4"
    },
    {
        "source_sentence": "時熙連河側娑羅雙樹周匝縱廣四百八十里，天龍八部充塞盈滿間無空缺，",
        "translation": "The two śāla trees by the side of the Hiraṇyavatī River were four hundred and eighty li in circumference, with heavenly beings, dragons, and the eight kinds of deities filling the space.",
        "source": "T12n0383_002:1011b19_5"
    },
    {
        "source_sentence": "莫不戀慕、悲號、苦惱，咸言：「世間失於慈父。」",
        "translation": "Nothing but attachment, sorrow, lamentation, and suffering all said, The world lost its compassionate father.",
        "source": "T12n0383_002:1011b21_6"
    },
    {
        "source_sentence": "各相謂言：「我等從今方淪生死，誰拔濟者？」",
        "translation": "Each said to the other, From now on, we'll fall into birth and death, so who will rescue us?",
        "source": "T12n0383_002:1011b22_7"
    },
    {
        "source_sentence": "爾時，城中有一梵志名須跋陀羅，年百二十歲，聞佛近在雙樹之間，當於中夜而入涅槃，",
        "translation": "At the time, there was a priest named Subhadra in the city. He was one hundred and twenty years old when he heard that the Buddha was about to enter nirvana at midnight between two pairs of trees.",
        "source": "T12n0383_002:1011b23_8"
    },
    {
        "source_sentence": "即往佛所白阿難言：「我聞如來——一切智者——當於中夜而入涅槃，",
        "translation": "He went to the Buddha and said to Ānanda, “I have heard that the Tathāgata entered nirvana in the middle of the night.",
        "source": "T12n0383_002:1011b25_9"
    },
    {
        "source_sentence": "欲少決疑，唯願聽前。」",
        "translation": "I want to resolve my doubts a little, but I'd like to hear them before me.",
        "source": "T12n0383_002:1011b26_10"
    },
    {
        "source_sentence": "是時阿難心自念言：「今此梵志久習異見，必於今者與佛論議，世尊身痛而作擾亂。」",
        "translation": "Ānanda then thought to himself, Now that this priest has cultivated different views for a long time, he must have had a discussion with the Buddha now, and the Bhagavān's body is painful and disturbed.",
        "source": "T12n0383_002:1011b27_11"
    },
    {
        "source_sentence": "即便默然不聽許之，乃至三請亦復如是。",
        "translation": "Even so, he remained silent and didn't allow it, and so did the three requests.",
        "source": "T12n0383_002:1011b29_12"
    },
    {
        "source_sentence": "爾時，世尊天耳遙聞，語阿難言：「汝可聽是老梵志前，此即是吾最後弟子。」",
        "translation": "At the time, the Bhagavān heard it from a distance through his divine ears and said to Ānanda, Listen, you may hear this old brahmin before him; this is my last disciple.",
        "source": "T12n0383_002:1011c02_0"
    },
    {
        "source_sentence": "須跋陀羅既見佛已歡喜踊躍，頭面作禮。",
        "translation": "Having seen the Buddha, Subhadra was delighted and jumped for joy. He bowed his head and face in reverence.",
        "source": "T12n0383_002:1011c03_1"
    },
    {
        "source_sentence": "爾時，世尊隨應為說八正道法，即於座上得羅漢果，而白佛言：「生死苦海已蒙得過，",
        "translation": "At that time, the World-honored One taught them the eightfold doctrine of the right path. Having attained arhatship on his seat, he said to the Buddha:",
        "source": "T12n0383_002:1011c04_2"
    },
    {
        "source_sentence": "不忍當見大師涅槃，我今當先而取滅度。」",
        "translation": "If you can't tolerate it, you'll see the great master's nirvāṇa, and now I will first attain its cessation.",
        "source": "T12n0383_002:1011c06_3"
    },
    {
        "source_sentence": "即於佛前入般涅槃。",
        "translation": "That is, he enters parinirvāṇa in front of the Buddha.",
        "source": "T12n0383_002:1011c07_4"
    },
    {
        "source_sentence": "「我於諸眾生，　　應度緣今畢，",
        "translation": "I should save all sentient beings for their sake. Now, having fulfilled this purpose,",
        "source": "T12n0383_002:1011c07_5"
    },
    {
        "source_sentence": "　夜靜氣恬和，　　涅槃時已到。」",
        "translation": "The night is still and calm, and the time of nirvāṇa has come.",
        "source": "T12n0383_002:1011c07_5"
    },
    {
        "source_sentence": "爾時，世尊為諸八部一切大眾說妙法已，既至中夜，涅槃時到，而說偈言：爾時，",
        "translation": "At that time the World-honored One, having thus taught the sublime Dharma to all the eightfold assembly of bhikṣus, arrived at midnight. When the time for nirvana came, he spoke these verses:",
        "source": "T12n0383_002:1011c07_5"
    },
    {
        "source_sentence": "世尊說此偈已即入初禪，入初禪已復入二禪，入二禪已次入三禪，入三禪已次入四禪，",
        "translation": "Having uttered this verse, the World-honored One entered into the first meditative state of absorption. Entering into the first meditative state of absorption, he enters again into the second meditative state of absorption. Entering into the second meditative state of absorption, he enters in succession into the third meditative state of absorption",
        "source": "T12n0383_002:1011c12_6"
    },
    {
        "source_sentence": "入四禪已次入空處，入空處已次入識處，入識處已次入無所有處，入無所有處已次入非想非非想處，",
        "translation": "After entering the fourth trance, he enters the sphere of infinity; after entering the sphere of infinity, he enters the sphere of infinity; after entering the sphere of infinity, he enters the sphere of infinity; after entering the sphere of infinity, he enters the sphere of infinity; after entering the sphere of infinit",
        "source": "T12n0383_002:1011c14_7"
    },
    {
        "source_sentence": "入非想非非想處已次入滅盡正受。",
        "translation": "After entering the abode of neither perception nor non-perception, he then enters into the right feeling of cessation.",
        "source": "T12n0383_002:1011c16_8"
    },
    {
        "source_sentence": "時會大眾既見如來諸根不動，即便問於阿那律言：「世尊今者入涅槃未？」",
        "translation": "Seeing that the Tathāgata's faculties didn't budge, the assembly then asked Aniruddha, Bhagavān, has he entered nirvāṇa now?",
        "source": "T12n0383_002:1011c17_9"
    },
    {
        "source_sentence": "時阿那律語諸人言：「世尊今入滅盡正受。」",
        "translation": "Aniruddha then said to the people, Bhagavān, now that you've entered parinirvāṇa and rightly experienced it.",
        "source": "T12n0383_002:1011c18_10"
    },
    {
        "source_sentence": "爾時，如來出滅盡正受還入非想非非想處，出非想非非想處還入無所有處，",
        "translation": "At that point, the Tathāgata emerges from the cessation of right feeling and returns to the sphere of neither perception nor non-perception, and emerges from the sphere of neither perception nor non-perception and returns to the sphere of nothingness.",
        "source": "T12n0383_002:1011c19_11"
    },
    {
        "source_sentence": "出無所有處還入識處，出於識處還入空處，出於空處還入四禪，出於四禪還入三禪，",
        "translation": "He leaves the sphere of nothingness and returns to the sphere of consciousness; he leaves the sphere of consciousness and returns to the sphere of infinity; he leaves the sphere of infinity and returns to the fourth meditative state; he leaves the fourth meditative state and returns to the third meditative state.",
        "source": "T12n0383_002:1011c21_12"
    },
    {
        "source_sentence": "出於三禪還入二禪，出於二禪還入初禪。",
        "translation": "He emerges from the third dhyāna and returns to the second dhyāna, and emerges from the second dhyāna and returns to the first dhyāna.",
        "source": "T12n0383_002:1011c23_13"
    },
    {
        "source_sentence": "即於初禪還入二禪，出於二禪而入三禪，出於三禪而入四禪，出於四禪而入空處，",
        "translation": "In the first meditative state of absorption, he enters again into the second meditative state; leaving the second meditative state, he enters the third meditative state; leaving the third meditative state, he enters the fourth meditative state; leaving the fifth meditative state, he enters the sphere of infinite space.",
        "source": "T12n0383_002:1011c24_14"
    },
    {
        "source_sentence": "出於空處而入識處，出於識處入無所有處，出於無所有處入非想非非想處，",
        "translation": "He emerges from the realm of space and enters the realm of consciousness, emerges from the realm of consciousness and enters the realm of nothingness, and emerges from the realm of nothingness to enter the realm of neither perception nor non-perception.",
        "source": "T12n0383_002:1011c26_15"
    },
    {
        "source_sentence": "出非想非非想處入滅盡正受，則於彼處而般涅槃。",
        "translation": "When one leaves the sphere of neither-identification-nor-nonidentification and enters meditative attainment of cessation, then parinirvāṇa occurs in that sphere.",
        "source": "T12n0383_002:1011c28_16"
    },
    {
        "source_sentence": "當於爾時大地震動，天龍八部悲泣騷擾。",
        "translation": "At that time a great earthquake occurred and the gods, dragons, and the eightfold assembly cried in distress.",
        "source": "T12n0383_002:1011c29_17"
    },
    {
        "source_sentence": "「生死無真實，　　虛誑諸眾生，",
        "translation": "Birth and death have no reality, Yet they deceive all living beings.",
        "source": "T12n0383_002:1012a01_18"
    },
    {
        "source_sentence": "　今者牟尼尊，　　棄之猶涕唾。」",
        "translation": "Now, this is the Venerable Muni, who discards it like tears and spittle.",
        "source": "T12n0383_002:1012a01_18"
    },
    {
        "source_sentence": "時天帝釋及梵天王而說偈言：時諸眾生共相謂言：「如來滅度何其駛哉！",
        "translation": "Śakra Devānām-Indra and the Brahmadeva king then spoke a verse, saying, The sentient beings then said to each other, How is it so quick for the Tathāgata to cease?",
        "source": "T12n0383_002:1012a01_18"
    },
    {
        "source_sentence": "三界牢獄誰為解脫？」",
        "translation": "Who is liberation in the prison of the three realms?",
        "source": "T12n0383_002:1012a05_19"
    },
    {
        "source_sentence": "其中或有宛轉于地、或有牽絕衣服瓔珞、或拔頭髮、搥胸大叫。",
        "translation": "Some of them will turn to the ground, some will pull away their robes and jewelry, some will pull out their hair, and some will beat their chests and scream.",
        "source": "T12n0383_002:1012a06_20"
    },
    {
        "source_sentence": "爾時，阿難即便入城普告力士：「如來昨夜已入涅槃，汝等宜應供養闍維。」",
        "translation": "It was then that Ānanda went into the city and told the strong man, The Tathāgata entered nirvāṇa last night; you should make offerings to him.",
        "source": "T12n0383_002:1012a07_21"
    },
    {
        "source_sentence": "諸力士等聞此語已心大苦痛，皆悉相隨至雙樹所。",
        "translation": "After hearing these words, the strong men felt great pain in their hearts and all followed each other to the place where the two trees were.",
        "source": "T12n0383_002:1012a09_22"
    },
    {
        "source_sentence": "既見世尊已般涅槃，悶絕震慟不能自勝，即問阿難：「我等不知云何闍維如來之身？」",
        "translation": "Seeing that the Bhagavān had passed into nirvāṇa and was in distress and unable to overcome it, he asked Ānanda, We don't know what about the Tathāgata's body, Kāśyapa?",
        "source": "T12n0383_002:1012a10_23"
    },
    {
        "source_sentence": "阿難答言：「我於昨日已諮問佛，世尊遺勅令如轉輪聖王闍維之法。」",
        "translation": "Ānanda replied, Yesterday, I've already consulted the Buddha, and the Bhagavān has instructed me to follow the rules of the wheel-turning sage king's ācārya.",
        "source": "T12n0383_002:1012a12_24"
    },
    {
        "source_sentence": "阿難具為次第說之。",
        "translation": "Ānanda explained them in order.",
        "source": "T12n0383_002:1012a14_25"
    },
    {
        "source_sentence": "諸力士眾聞此語已，即便嚴辦供養之具，事事皆依阿難所說——如轉輪聖王棺殯之法。",
        "translation": "After hearing these words, the army of strong men arranged the offerings in an orderly way, according to what Ānanda had told them - just like the rules for burial at the coffin of the universal ruler's coffin.",
        "source": "T12n0383_002:1012a14_26"
    },
    {
        "source_sentence": "爾時，摩耶即於天上見五衰相：一者、頭上花萎，二者、腋下汗出，三者、頂中光滅，",
        "translation": "At that time, Māya saw five signs of decline in the heavens: first, flowers withered on his head; second, sweat came out from his armpits; and third, the light disappearing from his crown.",
        "source": "T12n0383_002:1012a16_27"
    },
    {
        "source_sentence": "四者、兩目數瞬，五者、不樂本座。",
        "translation": "4. the number of moments in both eyes, and 5. he doesn't delight in his original seat.",
        "source": "T12n0383_002:1012a18_28"
    },
    {
        "source_sentence": "又於其夜得五大惡夢：一、夢須彌山崩、四海水竭，二、夢有諸羅剎手執利刀競挑一切眾生之眼，",
        "translation": "On that night, he also had five great bad dreams: 1. a dream in which the polar mountain collapsed and all four rivers of water dried up; 2. a dream in which there were rāṣas holding sharp swords in their hands and competing for the eyes of all sentient beings.",
        "source": "T12n0383_002:1012a18_29"
    },
    {
        "source_sentence": "時有黑風吹，諸羅剎皆悉奔馳歸於雪山，三、夢欲色界諸天忽失寶冠，",
        "translation": "When a black wind blows, the rāṣas all run back to the snowy mountains. 3. In a dream, the gods of the realm of desire and form suddenly lose their jeweled crowns.",
        "source": "T12n0383_002:1012a21_30"
    },
    {
        "source_sentence": "自絕瓔珞不安本座，身無光明猶如聚墨，四、夢如意珠王在高幢上，恒雨珍寶周給一切，",
        "translation": "He cut off his jewelry and didn't sit at his original seat, and his body lacked light like a cluster of black ink. 4. In a dream, the wish-granting pearl king was on a high banner, constantly raining rare treasures to give them to everyone.",
        "source": "T12n0383_002:1012a22_31"
    },
    {
        "source_sentence": "有四毒龍口中吐火吹倒彼幢、吸如意珠，猛疾惡風吹沒深淵，五、夢有五師子從空來下嚙摩訶摩耶乳入於左脇，",
        "translation": "There are four poisonous dragons that spit out fire from their mouths to blow down the banner and suck the wish-granting pearl, which is blown into a deep abyss by a fierce wind. 5. In a dream, five lions come down from space and snatch Mahāmāyā’s milk into his left side.",
        "source": "T12n0383_002:1012a24_32"
    },
    {
        "source_sentence": "身心疼痛如被刀劍。",
        "translation": "The pain in body and mind is like being covered with a knife or sword.",
        "source": "T12n0383_002:1012a27_33"
    },
    {
        "source_sentence": "時摩訶摩耶見此夢已，即便驚寤而作是言：「我於向者眠寢之中，忽然見此非吉祥事，",
        "translation": "When Mahāmaudgalyāyana saw this dream, he became frightened and said, “I suddenly saw this un auspicious sign while lying asleep in my bed at the side of the road.",
        "source": "T12n0383_002:1012a27_34"
    },
    {
        "source_sentence": "令我身心極為愁苦。",
        "translation": "It causes my body and mind to become extremely sad and painful.",
        "source": "T12n0383_002:1012a29_35"
    },
    {
        "source_sentence": "往昔在於白淨王宮，因晝寢中得希有夢——見一天子身黃金色、乘白象王，",
        "translation": "In the past, he had a rare dream in the palace of King Śubhavyūha when he was sleeping during the day and saw a celestial being with a golden body riding on a white elephant king.",
        "source": "T12n0383_002:1012b01_36"
    },
    {
        "source_sentence": "從諸天子作妙妓樂，觀日之精入我右脇，身心安樂無有痛惱——即便懷妊悉達太子，",
        "translation": "The energy of the sun entered my right hypochondrium. My body and mind were at ease, without any pain or discomfort. Then Prince Siddhārtha conceived a new empowerment:",
        "source": "T12n0383_002:1012b02_37"
    },
    {
        "source_sentence": "光顯宗族、為世照明。",
        "translation": "It's to illuminate the lineage and illuminate the world for its illumination.",
        "source": "T12n0383_002:1012b04_38"
    },
    {
        "source_sentence": "今此五夢甚可怖畏，必是我子釋迦如來入般涅槃之惡相也。」",
        "translation": "Now, these five dreams are so terrifying that they must be bad signs for my son, the Tathāgata Śākyamuni, to enter parinirvāṇa.",
        "source": "T12n0383_002:1012b05_39"
    },
    {
        "source_sentence": "即便向餘諸天子等廣說夢中所見諸事。",
        "translation": "He then told the other celestial beings and so forth in detail about the things he saw in his dream.",
        "source": "T12n0383_002:1012b06_40"
    },
    {
        "source_sentence": "「大師最勝、天中天、　　善導一切世間者，",
        "translation": "The great teacher is supreme, a god among gods, skilled in guiding all the worlds.",
        "source": "T12n0383_002:1012b07_41"
    },
    {
        "source_sentence": "　今已為彼無常海，　　摩竭大魚之所吞，",
        "translation": "Now they've been swallowed by the great Magadhi fish in that sea of impermanence.",
        "source": "T12n0383_002:1012b07_41"
    },
    {
        "source_sentence": "　在於鳩尸那竭國，　　娑羅林中雙樹間。",
        "translation": "In the country of Kuśinagara, there's a pair of trees in the śāla forest.",
        "source": "T12n0383_002:1012b07_41"
    },
    {
        "source_sentence": "　不久當出城東門，　　種種供養而闍維，",
        "translation": "Soon you will go out of the east gates of the city And pay your respects with various offerings.",
        "source": "T12n0383_002:1012b07_41"
    },
    {
        "source_sentence": "　天、人八部眾盈溢，　　號哭震動徹三千。」",
        "translation": "The gods and humans of the eight groups overflowed, wailing and shouting, reaching 3,000.",
        "source": "T12n0383_002:1012b07_41"
    },
    {
        "source_sentence": "爾時，尊者阿那律既見棺殯如來身已，即便昇於忉利天上，往摩訶摩耶所而說是偈：時阿那律說此偈已，",
        "translation": "At that time, having seen the body of the Buddha buried in a coffin, Venerable Anuruddha ascended to Trāyastriṃśa gods and said these verses to Mahāmāyā:",
        "source": "T12n0383_002:1012b07_41"
    },
    {
        "source_sentence": "即便還下如來棺所。",
        "translation": "He then went back down to the Tathāgata's coffin.",
        "source": "T12n0383_002:1012b15_42"
    },
    {
        "source_sentence": "爾時，摩訶摩耶聞阿那律說此偈已，悶絕躄地，諸天女等以冷水灑面，",
        "translation": "At that time Mahāmaudgalyāyana, having heard these verses uttered by Anuruddha, fainted and fell to the ground in distress. The heavenly maidens sprinkled their faces with cool water:",
        "source": "T12n0383_002:1012b15_43"
    },
    {
        "source_sentence": "良久乃穌。",
        "translation": "After a long time, he came back to life.",
        "source": "T12n0383_002:1012b17_44"
    },
    {
        "source_sentence": "自拔頭髮，絕莊嚴具，悲泣垂淚而作此言：「我於昨夜得五惡夢，決定當知佛入涅槃。",
        "translation": "He pulled out his hair, cut off all his ornaments, wept in sorrow, and said, I had five bad dreams last night that will surely make me know that the Buddha is entering nirvāṇa.",
        "source": "T12n0383_002:1012b17_45"
    },
    {
        "source_sentence": "今者果見阿那律來，云已滅度在雙樹間，不久便應而就闍維。",
        "translation": "Now, when he finally saw Aniruddha coming, he said that he had been extinguished and was between the two trees, and soon enough to respond, he went to Ajari.",
        "source": "T12n0383_002:1012b19_46"
    },
    {
        "source_sentence": "何其苦哉？",
        "translation": "What's so painful?",
        "source": "T12n0383_002:1012b21_47"
    },
    {
        "source_sentence": "世間眼滅。",
        "translation": "The worldly eye ceases.",
        "source": "T12n0383_002:1012b21_48"
    },
    {
        "source_sentence": "何其疾哉？",
        "translation": "Why is it so painful?",
        "source": "T12n0383_002:1012b21_49"
    },
    {
        "source_sentence": "人天福盡。",
        "translation": "The merits of humans and gods are exhausted.",
        "source": "T12n0383_002:1012b21_50"
    },
    {
        "source_sentence": "昔日在於白淨王宮，始生七日我便命終，竟未抱育展母子情。",
        "translation": "In the past, when I was in the palace of King Śubhavyūha, I died at the age of seven days after my first birth, but I still hadn't developed the feelings of a mother and child.",
        "source": "T12n0383_002:1012b22_51"
    },
    {
        "source_sentence": "付囑摩訶波闍波提，令其姨母而乳養之，及已長大至年十九，便於中夜踰城而出，",
        "translation": "Entrusted to Mahāprajāpatī, who had his aunt nursing him with milk, and when he grew up to the age of nineteen years old, he left the city in the middle of the night.",
        "source": "T12n0383_002:1012b23_52"
    },
    {
        "source_sentence": "舉宮內外莫不悲惱。",
        "translation": "Everyone inside and outside the palace was grieved.",
        "source": "T12n0383_002:1012b25_53"
    },
    {
        "source_sentence": "既成道已開世慧眼，覆護一切猶如慈父。",
        "translation": "Having accomplished the path, he opens the eye of worldly wisdom and protects all people like a loving father.",
        "source": "T12n0383_002:1012b25_54"
    },
    {
        "source_sentence": "如何一旦便入涅槃？",
        "translation": "How can you enter nirvāṇa once?",
        "source": "T12n0383_002:1012b26_55"
    },
    {
        "source_sentence": "無常惡賊極為兇暴，而能害我正覺之子。」",
        "translation": "An impermanent thief is so fierce and violent that he can harm my righteous son.",
        "source": "T12n0383_002:1012b27_56"
    },
    {
        "source_sentence": "「於無量劫來，　　常共為母子，",
        "translation": "“For immeasurable eons, They have always been the same as mother and child.",
        "source": "T12n0383_002:1012b28_57"
    },
    {
        "source_sentence": "　汝既成正覺，　　此緣方永斷，",
        "translation": "Once you have attained perfect enlightenment, this condition will only be permanently eliminated.",
        "source": "T12n0383_002:1012b28_57"
    },
    {
        "source_sentence": "　而復於今者，　　便入般涅槃。",
        "translation": "Again, this is the one who now enters parinirvāṇa.",
        "source": "T12n0383_002:1012b28_57"
    },
    {
        "source_sentence": "　譬如高大樹，　　眾鳥依共棲，",
        "translation": "It's like a high, large tree That feeds on birds that live together.",
        "source": "T12n0383_002:1012b28_57"
    },
    {
        "source_sentence": "　晨旦各分離，　　到暮還歸集。",
        "translation": "In the morning and at dawn, they were separated, and in the evening they returned to their respective congregations.",
        "source": "T12n0383_002:1012b28_57"
    },
    {
        "source_sentence": "　與汝為母子，　　共在生死樹，",
        "translation": "Together with you, my mother and child, I'm at the tree of birth-and-death.",
        "source": "T12n0383_002:1012b28_57"
    },
    {
        "source_sentence": "　既得成道果，　　長絕此源本，",
        "translation": "Having attained the fruit of enlightenment, they'll always cut off this source and root.",
        "source": "T12n0383_002:1012b28_57"
    },
    {
        "source_sentence": "　又復取滅度，　　無有會見期。」",
        "translation": "Again, they'll attain nirvāṇa without an assembly or vision.",
        "source": "T12n0383_002:1012b28_57"
    },
    {
        "source_sentence": "即於眾中而說偈言：時摩訶摩耶說此偈已，涕泣懊惱不能自勝，與於無量諸天女等眷屬圍遶，",
        "translation": "When Mahāmaudgalyāyana had uttered these verses, she wept and cried in distress, unable to control herself. She was surrounded by countless goddesses and other celestial beings.",
        "source": "T12n0383_002:1012b28_57"
    },
    {
        "source_sentence": "作妙妓樂、燒香、散花歌頌讚歎，從空來下趣雙樹所。",
        "translation": "They made exquisite music, burned incense, scattered flowers, sang hymns of praise, and came down from the sky to where the two trees were located.",
        "source": "T12n0383_002:1012c09_58"
    },
    {
        "source_sentence": "到娑羅林中已，遙見佛棺即大悶絕不能自勝，諸天女等以水灑面然後方穌。",
        "translation": "When they arrived in the sal trees, they saw the Buddha’s coffin from a distance. They were greatly distressed and unable to control themselves. The heavenly maidens sprinkled their faces with water and then came to rest.",
        "source": "T12n0383_002:1012c10_59"
    },
    {
        "source_sentence": "前至棺所頭頂作禮，垂淚悲惱而作此言：「昔於過去無量劫來，長為母子未曾捨離，",
        "translation": "He went up to the place where the coffin was buried, bowed his head and bow with respect, wept in sorrow, and said these words: For immeasurable past eons I have never abandoned my mother or children.",
        "source": "T12n0383_002:1012c12_60"
    },
    {
        "source_sentence": "一旦於今無相見期。",
        "translation": "Once, there's no time to see each other now.",
        "source": "T12n0383_002:1012c14_61"
    },
    {
        "source_sentence": "嗚呼苦哉！",
        "translation": "That's so painful!",
        "source": "T12n0383_002:1012c15_62"
    },
    {
        "source_sentence": "眾生福盡，方當昏迷，誰為開導？」",
        "translation": "When the merits of sentient beings are exhausted, they'll be deluded; who will enlighten and guide them?",
        "source": "T12n0383_002:1012c15_63"
    },
    {
        "source_sentence": "即以天曼陀羅花、摩訶曼陀羅花、曼殊沙花、摩訶曼殊沙花用散棺上，",
        "translation": "He then spread the heavenly māndārava flowers, mahāmandārava flowers, mañjūṣaka flowers, and mahāmanjūṣaka flowers over the coffin.",
        "source": "T12n0383_002:1012c16_64"
    },
    {
        "source_sentence": "「今此雙樹間，　　天龍八部眾，",
        "translation": "Between these two śāla trees there are now Heavenly beings, dragons, and the eightfold assembly.",
        "source": "T12n0383_002:1012c17_65"
    },
    {
        "source_sentence": "　惟聞啼哭音，　　不知何所說，",
        "translation": "They only hear the sound of wailing and weeping, Not knowing what to say.",
        "source": "T12n0383_002:1012c17_65"
    },
    {
        "source_sentence": "　譬鸚鵡亂鳴，　　不能解其語。",
        "translation": "It's like a parrot that cries in disorder and can't understand its words.",
        "source": "T12n0383_002:1012c17_65"
    },
    {
        "source_sentence": "　充塞在於地，　　猶如折翮鳥，",
        "translation": "It fills the ground like a bird that breaks its wings.",
        "source": "T12n0383_002:1012c17_65"
    },
    {
        "source_sentence": "　不能起飛趣，　　如來涅槃林。",
        "translation": "They can't get up and fly to the Tathāgata's nirvāṇa forest.",
        "source": "T12n0383_002:1012c17_65"
    },
    {
        "source_sentence": "　曠劫積恩愛，　　似遮迦羅鳥，",
        "translation": "For a long time I've accumulated kindness and love, resembling the cakravartin bird.",
        "source": "T12n0383_002:1012c17_65"
    },
    {
        "source_sentence": "　今者無常風，　　吹散各異處。",
        "translation": "Now the wind of impermanence Has blown and swirled in different places.",
        "source": "T12n0383_002:1012c17_65"
    },
    {
        "source_sentence": "　在苦諸眾生，　　悕望法甘露，",
        "translation": "In the midst of suffering, sentient beings long for the ambrosia of the Dharma.",
        "source": "T12n0383_002:1012c17_65"
    },
    {
        "source_sentence": "　猶如蘭提鳥，　　渴仰待天雨。",
        "translation": "It's like a bird of the orchid that thirds and waits for heavenly rain.",
        "source": "T12n0383_002:1012c17_65"
    },
    {
        "source_sentence": "　何故便於今，　　而速入涅槃？",
        "translation": "Why do you quickly enter nirvana now?",
        "source": "T12n0383_002:1012c17_65"
    },
    {
        "source_sentence": "　潛身重棺中，　　知我來此不？」",
        "translation": "Did you know that I came here because my hidden body was heavily coffined?",
        "source": "T12n0383_002:1012c17_65"
    },
    {
        "source_sentence": "而說偈言：爾時，摩訶摩耶說此偈已，顧見如來僧伽梨衣及鉢多羅，并以錫杖右手執之、左手拍頭，",
        "translation": "Having uttered these verses, Mahāmaudgalyāyana looked at the Tathāgata’s monks’ robes and almsbowl, [and] took them in his right hand with a staff made of pewter silk, and patted their heads on the ground.",
        "source": "T12n0383_002:1012c17_65"
    },
    {
        "source_sentence": "舉身投地如太山崩，悲號慟絕而作是言：「我子昔日執著此等廣福世間利益天人，",
        "translation": "He raised his body and threw himself to the ground like a great mountain that collapses, weeping in sorrow and mourning, he said, My son, in the past, used to cling to these vast blessings for the benefit of gods and humans in the world.",
        "source": "T12n0383_002:1013a02_0"
    },
    {
        "source_sentence": "今此諸物空無有主。",
        "translation": "Now, these things are empty and have no owner.",
        "source": "T12n0383_002:1013a03_1"
    },
    {
        "source_sentence": "嗚呼苦哉，痛不可言。」",
        "translation": "Aah! That's painful; it can't be described as painful.",
        "source": "T12n0383_002:1013a04_2"
    },
    {
        "source_sentence": "時諸八部及以四眾見摩訶摩耶憂惱如是，倍更悲感淚下如雨，帝釋力故變成河流。",
        "translation": "When the eightfold assembly and the fourfold assembly saw Mahāmāyā's grief and distress like this, they became even more sad and wept with tears, and Indra transformed it into a river because of his power.",
        "source": "T12n0383_002:1013a04_3"
    },
    {
        "source_sentence": "爾時，世尊以大神力故，令諸棺蓋皆自開發，便從棺中合掌而起——如師子王初出窟時奮迅之勢——身毛孔中放千光明，",
        "translation": "At that time the World-honored One, through his great supernatural powers, caused the lids of the coffins to open by themselves. Then he rose from the coffin with his palms pressed together - just as did the lion king who emerged from the cave at the first moment of the lion' s lion' s lion' s lion' s lion' s vigor",
        "source": "T12n0383_002:1013a07_0"
    },
    {
        "source_sentence": "一一光明有千化佛，悉皆合掌向摩訶摩耶，以梵軟音問訊母言：「遠屈來下此閻浮提，",
        "translation": "Each ray of light was accompanied by a thousand apparitional buddhas, all joining their palms and facing Mahāmāyā. They greeted their mother in the Sanskrit phonetic voice, saying:",
        "source": "T12n0383_002:1013a09_1"
    },
    {
        "source_sentence": "諸行法爾，願勿啼泣。」",
        "translation": "It's true of all the practices, so please don't weep.",
        "source": "T12n0383_002:1013a11_2"
    },
    {
        "source_sentence": "「一切福田中，　　佛福田為最；",
        "translation": "Among all the fields of blessings, Buddha’s field of blessings is foremost.",
        "source": "T12n0383_002:1013a12_3"
    },
    {
        "source_sentence": "　一切諸女中，　　玉女寶為最。",
        "translation": "Among all the women, the treasured jadelike queen is the best.",
        "source": "T12n0383_002:1013a12_3"
    },
    {
        "source_sentence": "　今我所生母，　　超勝無倫比，",
        "translation": "The mother whom I will give birth to now is incomparable, beyond compare.",
        "source": "T12n0383_002:1013a12_3"
    },
    {
        "source_sentence": "　能生於三世，　　佛、法、僧之寶。",
        "translation": "They can give rise to the treasures of buddhas, Dharma, and Saṃgha in the three worlds.",
        "source": "T12n0383_002:1013a12_3"
    },
    {
        "source_sentence": "　故我從棺起，　　合掌歡喜歎，",
        "translation": "That’s why I rose from my coffin, joined my palms in joy and praised him.",
        "source": "T12n0383_002:1013a12_3"
    },
    {
        "source_sentence": "　用報所生恩，　　示我孝戀情。",
        "translation": "By using the kindness that arises from retribution, show me affection for my filial piety.",
        "source": "T12n0383_002:1013a12_3"
    },
    {
        "source_sentence": "　諸佛雖滅度，　　法、僧寶常住，",
        "translation": "Although the Buddhas have entered nirvana, The treasures of Dharma and Sangha are always abiding.",
        "source": "T12n0383_002:1013a12_3"
    },
    {
        "source_sentence": "　願母莫憂愁，　　諦觀無上行。」",
        "translation": "May your mother not be grieved, and truly observe the unsurpassed practice.",
        "source": "T12n0383_002:1013a12_3"
    },
    {
        "source_sentence": "即便為母而說偈言：爾時，世尊說此偈已，摩訶摩耶小自安慰，顏色漸悅如蓮花敷。",
        "translation": "He even spoke a verse for his mother, saying, After the Bhagavān spoke this verse, Mahāmaudgalyāyana comforted himself, and his appearance gradually became as pleasing as that of a lotus blossom.",
        "source": "T12n0383_002:1013a12_3"
    },
    {
        "source_sentence": "于時阿難見佛起已，又聞說偈，垂淚嗚咽強自抑忍，即便合掌而白佛言：「後世眾生必當問我：『世尊臨欲般涅槃時復何所說？』",
        "translation": "Seeing the Buddha arise, Ānanda heard him again say a verse, shedding tears and sobbing, forcing himself to suppress his patience. He joined his palms and said to the Buddha, All sentient beings in later generations will surely ask me, 'What else does the Bhagavān say when he's about to enter parinirvāṇa?'",
        "source": "T12n0383_002:1013a22_4"
    },
    {
        "source_sentence": "云何答之？」",
        "translation": "How do you answer them?",
        "source": "T12n0383_002:1013a25_5"
    },
    {
        "source_sentence": "佛告阿難：「汝當答言：『世尊已入般涅槃後，摩訶摩耶從天來下至金棺所。",
        "translation": "The Buddha told Ānanda, You should reply, saying, 'After the Bhagavān has entered parinirvāṇa, Mahāmaudgalyāyana came down from heaven and went to the golden coffin.",
        "source": "T12n0383_002:1013a25_6"
    },
    {
        "source_sentence": "爾時，如來為後不孝諸眾生故，從金棺出——如師子王奮迅之勢——身毛孔中放千光明，",
        "translation": "At that time the Buddha came out of the golden coffin for the sake of those living beings who were not filial to him. Like the lion king, he emerged with a thousand rays of light emanating from each pore of his body.",
        "source": "T12n0383_002:1013a27_7"
    },
    {
        "source_sentence": "一一光明有千化佛，悉皆合掌向摩訶摩耶，并又說於如上諸偈。』」",
        "translation": "Each ray of light has a thousand transformation buddhas, all joining their palms and facing Mahāmāyā with their palms together, and they also say the above-mentioned verses.'",
        "source": "T12n0383_002:1013a29_0"
    },
    {
        "source_sentence": "阿難又言：「當何名此經？",
        "translation": "Ānanda again asked, What should be the name of this sūtra?",
        "source": "T12n0383_002:1013b01_1"
    },
    {
        "source_sentence": "云何奉持？」",
        "translation": "How do you consecrate it?",
        "source": "T12n0383_002:1013b02_0"
    },
    {
        "source_sentence": "佛告阿難：「我於昔日忉利天上為母說法及摩訶摩耶夫人自有所說，今復在此母子相見。",
        "translation": "The Buddha told Ānanda, In the past, I taught the Dharma to my mother in Trāyastriṃśa godānīya Heaven and explained it to myself by Lady Mahāmaudgalyāyana, and now I'm here again to see them.",
        "source": "T12n0383_002:1013b02_1"
    },
    {
        "source_sentence": "汝可為後世諸眾生輩次第演說此經，名曰摩訶摩耶經，亦名佛昇忉利天為母說法經，",
        "translation": "\\",
        "source": "T12n0383_002:1013b04_2"
    },
    {
        "source_sentence": "又名佛臨涅槃母子相見經，如是奉持。」",
        "translation": "It's also called the Sutra of Seeing the Buddha as his mother and son approach nirvāṇa, which is thus upheld.",
        "source": "T12n0383_002:1013b06_3"
    },
    {
        "source_sentence": "「我生分已盡，　　梵行久已立，",
        "translation": "“My birth has ended, my religious practice has been established for a long time.",
        "source": "T12n0383_002:1013b07_4"
    },
    {
        "source_sentence": "　所作皆已辦，　　不受於後有。",
        "translation": "What's done has been done, and it won't arise in the future.",
        "source": "T12n0383_002:1013b07_4"
    },
    {
        "source_sentence": "　願母自安慰，　　不須苦、憂、惱。",
        "translation": "May the mother comfort herself without suffering, sorrow, or vexation.",
        "source": "T12n0383_002:1013b07_4"
    },
    {
        "source_sentence": "　一切行無常，　　住是生滅法，",
        "translation": "All conditioned things are impermanent, and duration is the law of arising and ceasing.",
        "source": "T12n0383_002:1013b07_4"
    },
    {
        "source_sentence": "　生滅既滅已，　　寂滅為最樂。」",
        "translation": "After birth and cessation cease, nirvāṇa is the greatest bliss.",
        "source": "T12n0383_002:1013b07_4"
    },
    {
        "source_sentence": "爾時，世尊說此語已，與母辭別，而說偈言：爾時，世尊說此語已即便闔棺。",
        "translation": "After speaking these words, the Bhagavān parted with his mother and said goodbye, saying in verse, After speaking these words, the Bhagavān then closed his coffin.",
        "source": "T12n0383_002:1013b07_4"
    },
    {
        "source_sentence": "三千大千世界普皆震動，摩訶摩耶及眾八部悲泣懊惱不能自勝。",
        "translation": "The 3,000 great one-thousand worlds all shook, and Mahāmaudgalyāyana and the eight groups of people cried out in distress and couldn't overcome themselves.",
        "source": "T12n0383_002:1013b14_5"
    },
    {
        "source_sentence": "摩訶摩耶問阿難言：「我子悉達臨滅度時有何教勅？」",
        "translation": "Mahāmaudgalyāyana asked Ānanda, What's the teaching at the time when my son Siddhārtha was about to enter nirvāṇa?",
        "source": "T12n0383_002:1013b16_6"
    },
    {
        "source_sentence": "阿難白言：「世尊中夜為諸比丘略說教誡，又以所說十二部經付囑尊者摩訶迦葉，",
        "translation": "Ānanda said: At midnight the World-honored One briefly instructed the bhikṣus by exhorting them, and also entrusted the twelvefold scriptures taught to Venerable Mahākāśyapa.",
        "source": "T12n0383_002:1013b17_7"
    },
    {
        "source_sentence": "亦復勅我令助宣布。」",
        "translation": "I've also instructed me to help proclaim it.",
        "source": "T12n0383_002:1013b19_8"
    },
    {
        "source_sentence": "時摩訶摩耶聞此語已又增感絕，即問阿難：「汝於往昔侍佛以來，聞世尊說如來正法幾時當滅？」",
        "translation": "After hearing these words, Mahāmaudgalyāyana became even more moved and asked Ānanda, How long have you heard the Bhagavān teach the Tathāgata's right teaching since you were an attendant of the Buddha in the past?",
        "source": "T12n0383_002:1013b19_9"
    },
    {
        "source_sentence": "阿難垂淚而便答言：「我於往昔曾聞世尊說於當來法滅之後事云：佛涅槃後，",
        "translation": "Ānanda, weeping, he said in reply, “Once long ago I heard the World-honored One tell me this story concerning the matter after the nirvana of the Dharma:",
        "source": "T12n0383_002:1013b21_10"
    },
    {
        "source_sentence": "摩訶迦葉共阿難結集法藏。",
        "translation": "Mahākāśyapa and Ānanda compiled the Dharma collection.",
        "source": "T12n0383_002:1013b23_11"
    },
    {
        "source_sentence": "事悉畢已，摩訶迦葉於狼跡山中入滅盡定，我亦當得果證，次第隨後入般涅槃，",
        "translation": "Having accomplished these things, Mahākāśyapa entered the absorption of extinction at the footprints of a wolf in the mountain range. I too will attain its fruit and enter parinirvāṇa one after another.",
        "source": "T12n0383_002:1013b24_12"
    },
    {
        "source_sentence": "當以正法付優婆掬多——善說法要如富樓那——廣說度人，又復勸化阿輸迦王，",
        "translation": "You should entrust the true teaching to Upagupta-who teaches well the essentials of the Dharma like Pūrṇa-and explain them in detail to save others. Again, you should encourage and inspire King Aśoka:",
        "source": "T12n0383_002:1013b26_13"
    },
    {
        "source_sentence": "令於佛法得堅固正信，以佛舍利廣起八萬四千諸塔。",
        "translation": "To cause them to attain firm and correct faith in the Buddha's teaching, he built 84,000 stūpas with the Buddha's relics.",
        "source": "T12n0383_002:1013b27_14"
    },
    {
        "source_sentence": "二百歲已，尸羅難陀比丘善說法要，於閻浮提度十二億人。",
        "translation": "After two hundred years, the monk Śīlabhadra taught the essentials of the Dharma well and saved 1.2 billion people in Jambudvīpa.",
        "source": "T12n0383_002:1013b29_15"
    },
    {
        "source_sentence": "三百歲已，青蓮花眼比丘善說法要，度半億人。",
        "translation": "After three hundred years, the monk blue lotus-flower eyed was able to teach the essentials of the Dharma well and saved half a billion people.",
        "source": "T12n0383_002:1013c01_16"
    },
    {
        "source_sentence": "四百歲已，牛口比丘善說法要，度一萬人。",
        "translation": "When he was four hundred years old, the monk Ox-mouthed taught the essentials of the Dharma well and saved 10,000 people.",
        "source": "T12n0383_002:1013c02_17"
    },
    {
        "source_sentence": "五百歲已，寶天比丘善說法要，度二萬人，八部眾生發阿耨多羅三藐三菩提心，",
        "translation": "At the age of five hundred, the monk Jewel-heaven taught the Dharma well and liberated twenty thousand people. Eightfold sentient beings conceived the spirit of unexcelled complete perfect enlightenment.",
        "source": "T12n0383_002:1013c03_18"
    },
    {
        "source_sentence": "正法於此便就滅盡。",
        "translation": "Here, the right teaching then ceases.",
        "source": "T12n0383_002:1013c05_19"
    },
    {
        "source_sentence": "「六百歲已，九十六種諸外道等邪見競興，破滅佛法。",
        "translation": "“After six hundred years, ninety-six kinds of mistaken views such as those of non-Buddhists will arise and destroy the Buddha’s teaching.",
        "source": "T12n0383_002:1013c05_20"
    },
    {
        "source_sentence": "有一比丘名曰馬鳴，善說法要，降伏一切諸外道輩。",
        "translation": "There was a monk named Ma Ming, who well taught the essentials of the Dharma and subjugated all the heretics.",
        "source": "T12n0383_002:1013c07_21"
    },
    {
        "source_sentence": "七百歲已，有一比丘名曰龍樹，善說法要，滅邪見幢，然正法炬。",
        "translation": "After seven hundred years, there was a monk named Nāgârjuna, who well taught the essentials of the Dharma and extinguished the banner of wrong views but the torch of the right teaching.",
        "source": "T12n0383_002:1013c08_22"
    },
    {
        "source_sentence": "八百歲後，諸比丘等樂好衣服，縱逸嬉戲，百千人中或有一兩得道果者。",
        "translation": "At the end of the eight hundredth year, all the bhikṣus gathered together and dressed themselves in beautiful clothes to enjoy their delights. Some of them were able to attain the fruit of enlightenment after a hundred thousand years.",
        "source": "T12n0383_002:1013c09_23"
    },
    {
        "source_sentence": "九百歲已，奴為比丘、婢為比丘尼。",
        "translation": "After nine hundred years old, the slave became a monk and the maidservant a bhikṣuṇī.",
        "source": "T12n0383_002:1013c11_24"
    },
    {
        "source_sentence": "一千歲已，諸比丘等聞不淨觀、阿那波那，瞋恚不欲，無量比丘若一、若兩思惟正受。",
        "translation": "After 1,000 years had passed, the monks and others heard the contemplation of impurity and anāpāna, angry and dispassionate, and measureless monks were either one- or two-mindedly contemplating right feelings.",
        "source": "T12n0383_002:1013c12_25"
    },
    {
        "source_sentence": "「千一百歲已，諸比丘等如世俗人嫁娶行媒，於大眾中毀謗毘尼。",
        "translation": "After a thousand or one hundred years, the monks and others are like worldly people who marry, train, and engage in sexual misconduct and denigrate the vinaya among the masses.",
        "source": "T12n0383_002:1013c14_0"
    },
    {
        "source_sentence": "千二百歲已，是諸比丘及比丘尼作非梵行，若有子息，男為比丘、女為比丘尼。",
        "translation": "After one thousand two hundred years old, these monks and nuns engage in non-Buddhist practices, and if there's a child at rest, the man becomes a monk and the woman a monk or nun.",
        "source": "T12n0383_002:1013c15_1"
    },
    {
        "source_sentence": "千三百歲已，袈裟變白不受染色。",
        "translation": "After one thousand three hundred years, his robes turned white and didn't accept dye.",
        "source": "T12n0383_002:1013c17_2"
    },
    {
        "source_sentence": "千四百歲已，時諸四眾猶如獵師，好樂殺生、賣三寶物。",
        "translation": "After a thousand or four hundred years, the four groups of people were like hunters who enjoyed killing and selling the Three Treasures' goods.",
        "source": "T12n0383_002:1013c18_0"
    },
    {
        "source_sentence": "千五百歲，俱睒彌國有三藏比丘善說法要，徒眾五百；",
        "translation": "At the age of one thousand five hundred, there was a Tripitaka bhikṣu in Kauśāmbī who taught the essentials of the Dharma well. There were five hundred disciples in his congregation.",
        "source": "T12n0383_002:1013c19_1"
    },
    {
        "source_sentence": "又一羅漢比丘善持戒行，徒眾五百。",
        "translation": "Another arhat monk well observed the precepts and was accompanied by five hundred disciples.",
        "source": "T12n0383_002:1013c20_2"
    },
    {
        "source_sentence": "於十五日布薩之時，羅漢比丘昇於高座說清淨法，云此所應作、此不應作。",
        "translation": "At the time of the fifteenth day's preaching, the arhat monk ascended to a high seat and explained the pure teaching, saying that this should be done and this shouldn't be done.",
        "source": "T12n0383_002:1013c21_3"
    },
    {
        "source_sentence": "彼三藏比丘弟子答羅漢言：『汝今身、口自不清淨，云何而反說是麁言？』",
        "translation": "That tripiṭaka monk disciple answered the arhat, saying, 'Now that you yourself aren't pure in body and speech, how can you say this is a crude statement?'",
        "source": "T12n0383_002:1013c23_0"
    },
    {
        "source_sentence": "羅漢答言：『我久清淨身、口、意業，無諸過惡。』",
        "translation": "The arhat answered, 'I've been pure in body, speech, and thought for a long time, with no faults or evils.'",
        "source": "T12n0383_002:1013c24_1"
    },
    {
        "source_sentence": "三藏弟子聞此語已倍更恚忿，即於座上殺彼羅漢。",
        "translation": "After hearing these words, the Tripiṭaka disciple became even more angry and killed the arhat on his seat.",
        "source": "T12n0383_002:1013c25_2"
    },
    {
        "source_sentence": "時羅漢弟子而作是言：『我師所說合於法理，云何汝等害我和上？』",
        "translation": "The arhat disciple then said, 'My teacher's teaching is consistent with the principle of the Dharma, so how could you harm me and myself?'",
        "source": "T12n0383_002:1013c26_3"
    },
    {
        "source_sentence": "即以利刀殺彼三藏。",
        "translation": "He then killed the three stores with a sharp sword.",
        "source": "T12n0383_002:1013c28_4"
    },
    {
        "source_sentence": "天龍八部莫不憂惱，惡魔波旬及外道眾踊躍歡喜，競破塔寺、殺害比丘。",
        "translation": "The gods, dragons, and the eightfold assembly were all grieved, and Māra Pāpīyān and the non-Buddhist community jumped up and down in joy, rushing to destroy the stūpa and kill the monks.",
        "source": "T12n0383_002:1013c28_5"
    },
    {
        "source_sentence": "一切經藏皆悉流移至鳩尸那竭國，阿耨達龍王悉持入海，於是佛法而滅盡也。」",
        "translation": "All the stores of scriptures all flowed to the country of Kuśinagara, and the dragon king Anavatapta carried them all into the sea, where the Buddha's teaching ceased.",
        "source": "T12n0383_002:1014a01_6"
    },
    {
        "source_sentence": "「一切皆歸滅，　　無有常安者，",
        "translation": "“All things return to cessation, and there’s no eternal peace.",
        "source": "T12n0383_002:1014a03_7"
    },
    {
        "source_sentence": "　須彌及海水，　　劫盡亦消竭，",
        "translation": "Mount Sumeru and the water of the ocean are also extinguished by the end of the kalpa.",
        "source": "T12n0383_002:1014a03_7"
    },
    {
        "source_sentence": "　世間諸豪強，　　會必還衰朽。",
        "translation": "The world's powerful people will surely return to decay when they meet.",
        "source": "T12n0383_002:1014a03_7"
    },
    {
        "source_sentence": "　我子於往昔，　　勤苦集眾行，",
        "translation": "In the past, my son, I diligently and painstakingly collected various practices.",
        "source": "T12n0383_002:1014a03_7"
    },
    {
        "source_sentence": "　故得成正覺，　　為眾說經藏。",
        "translation": "Therefore, they attain perfect enlightenment and teach the store of scriptures for the sake of all.",
        "source": "T12n0383_002:1014a03_7"
    },
    {
        "source_sentence": "　如何於爾時，　　皆悉潛沒盡？",
        "translation": "How could they all disappear at that point?",
        "source": "T12n0383_002:1014a03_7"
    },
    {
        "source_sentence": "　嗚呼！生死法，　　可畏、可厭離。」",
        "translation": "Aah! The law of birth and death is to be feared and to be abhorred from.”",
        "source": "T12n0383_002:1014a03_7"
    },
    {
        "source_sentence": "時摩訶摩耶聞此語已號哭懊惱，即向阿難而說偈言：爾時，摩訶摩耶說此偈已，",
        "translation": "After hearing these words, Mahāmaudgalyāyana wept and was overcome with distress. Hearing them, Mahāmaudgalyāyana addressed Ānanda in verse:",
        "source": "T12n0383_002:1014a03_7"
    },
    {
        "source_sentence": "語阿難言：「如來遺勅既以正法付囑尊者及摩訶迦葉，宜應精勤護持誦說。",
        "translation": "He said to Ānanda, Since the Tathāgata's legacy has entrusted the right teaching to Venerable Mahākāśyapa and Mahākāśyapa, it's appropriate to diligently guard and recite it.",
        "source": "T12n0383_002:1014a12_8"
    },
    {
        "source_sentence": "我今不忍見於如來闍維之時。」",
        "translation": "Now, I can't bear to see the Tathāgata at the time of Ajātaśatru.",
        "source": "T12n0383_002:1014a14_9"
    },
    {
        "source_sentence": "即禮佛棺，右遶七匝，涕淚號叫，還歸天上。",
        "translation": "He then bowed to the Buddha’s coffin, circled it seven times to his right, wept and cried in tears, and returned to heaven.",
        "source": "T12n0383_002:1014a15_0"
    },
    {
        "source_sentence": "于時娑羅雙樹間天人八部、比丘、比丘尼、優婆塞、優婆夷，既見如來母子相見及聞所說，",
        "translation": "When the gods and humans of the eightfold assembly, monks, bhikṣus, bhikṣuṇīs, laymen, and laywomen who lived between the two śāla trees saw that the Tathāgata’s mother and child were seeing each other and heard what he taught.",
        "source": "T12n0383_002:1014a15_1"
    },
    {
        "source_sentence": "有發無上道心者、有得須陀洹者、斯陀含者、阿那含者、阿羅漢者、或有發於辟支佛心，",
        "translation": "Those who have set their minds on the supreme path, those who have attained stream-entry, those who are once-returners, non-returners, and arhats, or those who have set their minds on the path of individual salvation.",
        "source": "T12n0383_002:1014a17_2"
    },
    {
        "source_sentence": "一切大眾受持佛語，頂戴奉行。",
        "translation": "All the people in the assembly honored the Buddha’s words and carried them out with reverence.",
        "source": "T12n0383_002:1014a19_3"
    },
    {
        "source_sentence": "摩訶摩耶經八國分舍利品第二",
        "translation": "Second Chapter of the Eight Country Part of the Mahāmāyā-sūtra, Chapter 2: Śāriputra",
        "source": "T12n0383_002:1014a21_0"
    },
    {
        "source_sentence": "爾時，波婆國末羅民眾聞佛滅度皆自念言：「今我宜往求舍利分，起塔供養。」",
        "translation": "At the time, the Mallan people of Pāvā heard that the Buddha had entered nirvāṇa and all thought to themselves, Now, I'd better go there to seek a portion of the relics and build a stūpa to make offerings.",
        "source": "T12n0383_002:1014a22_0"
    },
    {
        "source_sentence": "即下國中，嚴四種兵——象兵、馬兵、車兵、步兵——到拘尸城，遣使者言：「聞佛眾祐止此滅度，",
        "translation": "In his native land he assembled the fourfold army of elephant troops, horse troops, chariot troops, and infantry. He came to the city of Kuśinagara and dispatched an envoy, saying:",
        "source": "T12n0383_002:1014a23_1"
    },
    {
        "source_sentence": "彼亦我師，敬慕之心來請骨分，當於本國起塔供養。」",
        "translation": "They're also my teacher, so I'll respectfully request a portion of the bones and build a stūpa in my native land to make offerings.",
        "source": "T12n0383_002:1014a25_2"
    },
    {
        "source_sentence": "拘尸王答：「如是如是，誠如君言。",
        "translation": "The king of Kuśinagara replied, So it is, so it is, as you say.",
        "source": "T12n0383_002:1014a27_3"
    },
    {
        "source_sentence": "但佛世尊垂降此土於茲滅度，國內士民當自供養，遠勞諸君遺形舍利，",
        "translation": "But the Buddha, the World-honored One, descended to this land and entered nirvana here. All the officials and citizens of our country should make offerings to him. It is a great pity that you are so distant from us as to trouble us with the relics left by your ancestors.",
        "source": "T12n0383_002:1014a27_4"
    },
    {
        "source_sentence": "未得相與。」",
        "translation": "They haven't yet been given to each other.",
        "source": "T12n0383_002:1014a29_5"
    },
    {
        "source_sentence": "爾時，遮羅頗國諸跋離民、羅摩伽國拘利民眾、毘留提國婆羅門眾、迦維羅衛國釋種民眾、毘提羅國離車民眾及摩竭王阿闍世等，",
        "translation": "At the time, the people of Kapilavastu, the people of Rāmaṅga, the people of Kauśinagara, the people of Videha, the people of Vairocana, the people of Kālôdayin, the people of Kapilavastu, the people of Kapilavastu, the people of Kapilavastu, the people of Kapilavastu, the people of Kap",
        "source": "T12n0383_002:1014a29_6"
    },
    {
        "source_sentence": "聞佛如來於拘尸城雙樹林間而取滅度，皆自念言：「今我宜往求舍利分。」",
        "translation": "When they heard that the Buddha Tathāgata had entered nirvāṇa between the two forests in Kuśinagara, they all thought to themselves, Now, it's appropriate for me to go and ask for a portion of the relics.",
        "source": "T12n0383_002:1014b04_0"
    },
    {
        "source_sentence": "時諸國王、阿闍世等，各下國中，嚴四種兵，進渡恒水。",
        "translation": "The kings of the various countries and Ajātaśatru, among others, came down from their respective countries to send four kinds of troops to cross the Ganges.",
        "source": "T12n0383_002:1014b05_1"
    },
    {
        "source_sentence": "即勅婆羅門香姓：「汝持我名入拘尸城致問彼王：『諸末羅等起居輕利，",
        "translation": "He then commanded the brahman Kaṅga, bearing my name, to enter the city of Kuśinagara and ask the king questions:",
        "source": "T12n0383_002:1014b07_0"
    },
    {
        "source_sentence": "遊涉強耶。",
        "translation": "Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Strong?",
        "source": "T12n0383_002:1014b08_1"
    },
    {
        "source_sentence": "吾於賢者每相崇敬，隣境義和，曾無諍訟。",
        "translation": "I always revere the veneration of you, sir. The neighboring countries are peaceful and there has never been any dispute or controversy in our relations.",
        "source": "T12n0383_002:1014b08_2"
    },
    {
        "source_sentence": "我聞如來於君國內而取滅度，唯無上尊實我所天，故從遠來求請骨分，",
        "translation": "I have heard that the Tathāgata has entered nirvana in your country. It is only the highest and most venerable one among us gods, so we came from afar to ask for a portion of my bones.",
        "source": "T12n0383_002:1014b09_3"
    },
    {
        "source_sentence": "欲還本土起塔供養。",
        "translation": "He wanted to return to his native land and built a stūpa to make offerings.",
        "source": "T12n0383_002:1014b11_4"
    },
    {
        "source_sentence": "設以我者，舉國重寶以居共之。』」",
        "translation": "Suppose someone takes it as self and raises the country's treasured treasure to live with them.'",
        "source": "T12n0383_002:1014b12_5"
    },
    {
        "source_sentence": "時香姓婆羅門受王教已，即詣彼城語諸末羅。",
        "translation": "After receiving the king's instruction, the brāhmaṇa of fragrance went to that city and spoke to the Mallans.",
        "source": "T12n0383_002:1014b12_6"
    },
    {
        "source_sentence": "末羅聞已報香姓曰：「誠如君言。",
        "translation": "When Malla heard this, he reported it to his surname and said, It's exactly as you say.",
        "source": "T12n0383_002:1014b14_7"
    },
    {
        "source_sentence": "但為世尊垂降此土於茲滅度，國內士民自當供養。",
        "translation": "It is only because the World-honored One descended to this land and entered parinirvāṇa here. All the officials and citizens of our country should themselves make offerings to him.",
        "source": "T12n0383_002:1014b14_8"
    },
    {
        "source_sentence": "遠勞諸君，舍利叵得。」",
        "translation": "It's a long way off, gentlemen, and the relics are unobtainable.",
        "source": "T12n0383_002:1014b16_9"
    },
    {
        "source_sentence": "「法王無上尊，　　在我國涅槃，",
        "translation": "“The king of the Dharma, the supreme honored one, is in nirvana in my country.",
        "source": "T12n0383_002:1014b16_10"
    },
    {
        "source_sentence": "　我今莊嚴塔，　　安處而供養。",
        "translation": "I now adorn the stūpa, place it safely, and make offerings to it.",
        "source": "T12n0383_002:1014b16_10"
    },
    {
        "source_sentence": "　令具妙舍利，　　光明遍十方，",
        "translation": "Endowed with marvelous relics, Their light pervades the ten directions.",
        "source": "T12n0383_002:1014b16_10"
    },
    {
        "source_sentence": "　所可化眾生，　　云何得分析？」",
        "translation": "How can we analyze the sentient beings that can be transformed?",
        "source": "T12n0383_002:1014b16_10"
    },
    {
        "source_sentence": "爾時，諸國王等則集群臣眾共立義而作頌曰：爾時，諸國王說此偈已，",
        "translation": "At that time, the kings of the various countries gathered their ministers together to formulate a common doctrine and composed the following verse: Having uttered this verse, the kings of those countries",
        "source": "T12n0383_002:1014b16_10"
    },
    {
        "source_sentence": "各自思惟：「我承如來遺形舍利，得稟未來天人果報，當獲多福。」",
        "translation": "Each thought, I'll inherit the relics of the Tathāgata's legacy and attain the rewards of future gods and humans, and I'll attain much merit.",
        "source": "T12n0383_002:1014b22_11"
    },
    {
        "source_sentence": "而復告曰：「吾等和議遠來拜首，遜言求分。",
        "translation": "Again, he said, “Our councilor, we came from a long distance to pay our respects and venerate you.",
        "source": "T12n0383_002:1014b24_12"
    },
    {
        "source_sentence": "如不見以，四兵在此，不惜身命。",
        "translation": "If they don't see the reason, the four armies will be here, and they won't spare their lives.",
        "source": "T12n0383_002:1014b25_13"
    },
    {
        "source_sentence": "義而弗獲，當以力巨。」",
        "translation": "If you don't obtain the meaning, it will be because of your great strength.",
        "source": "T12n0383_002:1014b25_14"
    },
    {
        "source_sentence": "「如來大師在我國，　　不期登趣證滅度，",
        "translation": "“The great teacher of the Buddha is in my land; I do not wish to ascend to enlightenment.",
        "source": "T12n0383_002:1014b26_15"
    },
    {
        "source_sentence": "　遺留舍利如佛在，　　晝夜勤心常戀仰。",
        "translation": "The relics left behind are like the Buddha’s. Day and night they diligently cherish these relics with affection.",
        "source": "T12n0383_002:1014b26_15"
    },
    {
        "source_sentence": "　情存法海度眾生，　　冀得我今長供養，",
        "translation": "Sentient beings preserve the ocean of truth to save sentient beings, hoping to attain my present long offering.",
        "source": "T12n0383_002:1014b26_15"
    },
    {
        "source_sentence": "　遠勞諸君屈來拜，　　求覓舍利真叵得。」",
        "translation": "It's really unworthy of the trouble for you to come from afar to pay homage, and it's really unobtainable to search for a relic.",
        "source": "T12n0383_002:1014b26_15"
    },
    {
        "source_sentence": "時拘尸國即集群臣眾共立議，以偈答曰：爾時，香姓婆羅門於諸王前立在一面，",
        "translation": "The kingdom of Kusinārā gathered his ministers together to discuss the matter. He answered in verse: At that time, a brahman named Gandhamādana (i.e., Vimalakīrti) stood to one side before the various kings,",
        "source": "T12n0383_002:1014b26_15"
    },
    {
        "source_sentence": "「如來智慧大慈悲，　　哀愍三千大千界，",
        "translation": "Great compassion of the Buddha’s knowledge and compassionate compassion For the sake of sentient beings in the billion-world-galactic universe",
        "source": "T12n0383_002:1014c03_16"
    },
    {
        "source_sentence": "　其中說法遍十方，　　乃至阿僧不可說。",
        "translation": "The Dharma preached there pervades the ten directions, Until it can't be explained in terms of incalculability.",
        "source": "T12n0383_002:1014c03_16"
    },
    {
        "source_sentence": "　憐愍眾生如一子，　　恒河沙數心無息，",
        "translation": "Sentient beings with compassion are like one child, Their minds as numerous as the grains of sand in the Ganges River.",
        "source": "T12n0383_002:1014c03_16"
    },
    {
        "source_sentence": "　菩薩眷屬常往遊，　　聲聞弟子恒來我。",
        "translation": "The bodhisattva's retinue always travels, and śrāvaka disciples always come to me.",
        "source": "T12n0383_002:1014c03_16"
    },
    {
        "source_sentence": "　說法演音如共聞，　　圍遶紛綸同一說，",
        "translation": "They expound the Teaching and make their sounds as if they had heard them together, Surrounded by the same teaching everywhere.",
        "source": "T12n0383_002:1014c03_16"
    },
    {
        "source_sentence": "　天、人八部眾皆尋，　　故我現今清淨海。",
        "translation": "Gods, humans, and the eight groups of people all search for it; therefore, I am now in the pure ocean.",
        "source": "T12n0383_002:1014c03_16"
    },
    {
        "source_sentence": "　如來涅槃有舍利，　　八分分之不得惜。」",
        "translation": "The Tathāgata's nirvāṇa has a relic, and eight parts of it can't be cherished.",
        "source": "T12n0383_002:1014c03_16"
    },
    {
        "source_sentence": "長跪合掌而說偈答：時諸國王聞此偈已，心猶悵怏默然不許。",
        "translation": "He knelt down with his palms joined and spoke a verse in reply: When the kings of the countries heard this verse, their minds were still depressed and silent and didn't allow it.",
        "source": "T12n0383_002:1014c03_16"
    },
    {
        "source_sentence": "時香姓婆羅門更曉眾人、諸賢長者受佛教戒，口誦法言：「一切眾生常念欲安，",
        "translation": "The Brahman of fragrance then further awakened the people and the wise elders who had received the Buddhist precepts, reciting the teaching verbally, saying, All sentient beings always want to be comfortable,",
        "source": "T12n0383_002:1014c13_0"
    },
    {
        "source_sentence": "云何乃為諍佛舍利共相殘害？",
        "translation": "What's the harm inflicted by beating the Buddha's relics on each other?",
        "source": "T12n0383_002:1014c14_1"
    },
    {
        "source_sentence": "如來遺形廣以利益無量眾生，非止君等。",
        "translation": "The Tathāgata's bequeathed form is widely used to benefit measureless sentient beings, not just you.",
        "source": "T12n0383_002:1014c15_2"
    },
    {
        "source_sentence": "舍利今在，唯當分之。",
        "translation": "The relics are still in existence but they should be divided into two.",
        "source": "T12n0383_002:1014c16_3"
    },
    {
        "source_sentence": "何應如是？」",
        "translation": "Why should it be like this?",
        "source": "T12n0383_002:1014c17_4"
    },
    {
        "source_sentence": "眾人聞之咸稱曰善。",
        "translation": "All the people who heard it all called it good.",
        "source": "T12n0383_002:1014c17_5"
    },
    {
        "source_sentence": "尋復議言：「誰能堪為分舍利者？」",
        "translation": "Again, he asked, Who will be able to share the relics?",
        "source": "T12n0383_002:1014c17_6"
    },
    {
        "source_sentence": "皆曰：「香姓婆羅門仁智平均，可使分之。」",
        "translation": "They all said, The fragrance and family of the brāhmaṇas are equal in kindness and wisdom, so they can be divided into two.",
        "source": "T12n0383_002:1014c18_7"
    },
    {
        "source_sentence": "時諸國王即命香姓：「汝為我等分佛舍利，均作八分。」",
        "translation": "The kings of the countries then ordered their fragrant surnames, You'll divide the Buddha's relics for us into eight parts.",
        "source": "T12n0383_002:1014c19_8"
    },
    {
        "source_sentence": "於是，香姓即到骨所，頭面禮畢，取佛上牙別置一面，尋遣使者齎牙往詣阿闍世所，",
        "translation": "Thereupon, the brahman went to the place where the bones were preserved. Having venerated the Buddha by bowing his forehead and face, he took the upper tooth relic of the Buddha’s tooth relic and placed it at one side. He sent an envoy to bring the tooth relic with him to Ajātaśatru.",
        "source": "T12n0383_002:1014c20_9"
    },
    {
        "source_sentence": "語使者言：「以我所諮上白大王：『起居輕利，遊涉強耶，舍利諸國咸然以共。",
        "translation": "He said to the envoy, What I've asked is to tell the great king, 'Is it possible to rise up and live in lightness or wander about strongly?' The countries of Śāriputra will all share it with you.",
        "source": "T12n0383_002:1014c22_10"
    },
    {
        "source_sentence": "今付使者如來上牙，並可供養以慰企望。",
        "translation": "Now, I'll entrust the messenger with the Tathāgata's upper teeth, which are all available to comfort his hopes and expectations.",
        "source": "T12n0383_002:1014c24_11"
    },
    {
        "source_sentence": "明星出時集眾分之，當自奉送。』」",
        "translation": "When the star emerges, they'll gather the crowd to divide it up and send it off themselves.'",
        "source": "T12n0383_002:1014c25_12"
    },
    {
        "source_sentence": "是時，香姓別置一瓶容受石許，而分舍利均為八分。",
        "translation": "At the time, the fragrance and family were placed separately in a single pot to allow for the acceptance of the stone, and the portions of the relics were all eight parts.",
        "source": "T12n0383_002:1014c26_13"
    },
    {
        "source_sentence": "諸國納已，則告之言：「願持此瓶眾議見沾，自欲於舍起塔供養。」",
        "translation": "After the countries accepted it, they then told him, May you take this vial and tell them to see it soaked by the congregation, wanting to build a stūpa in their own house to make offerings.",
        "source": "T12n0383_002:1014c27_14"
    },
    {
        "source_sentence": "咸共以之。",
        "translation": "They all shared it with him.",
        "source": "T12n0383_002:1014c29_15"
    },
    {
        "source_sentence": "時有畢鉢村人來白眾言：「乞地焦炭起塔供養。」",
        "translation": "A man from the village of Bimbisāra then came to the crowd and said, begged for a charcoal on the ground to build a stūpa to make offerings.",
        "source": "T12n0383_002:1014c29_16"
    },
    {
        "source_sentence": "皆亦以之。",
        "translation": "They all use it as well.",
        "source": "T12n0383_002:1015a01_17"
    },
    {
        "source_sentence": "爾時，拘尸國、波婆國、遮頗國、羅摩伽國、毘流提國、迦維羅衛國、毘舍離國、摩竭國王阿闍世等得舍利分，",
        "translation": "At that time the kings of Kuśinagara, Parvata, Kapilavastu, Kapilavastu, Rāmaṅga, Videha, Kapilavastu, Vaiśālī, and King Ajātaśatru of Magadha obtained a portion of the relics.",
        "source": "T12n0383_002:1015a01_18"
    },
    {
        "source_sentence": "各歸其國起塔供養。",
        "translation": "Each returned to their country and built a stūpa to make offerings.",
        "source": "T12n0383_002:1015a04_19"
    },
    {
        "source_sentence": "香姓婆羅門持舍利瓶而歸起塔。",
        "translation": "The fragrant Brāhmaṇa of the incense family took the relics' vase and returned to build a stūpa.",
        "source": "T12n0383_002:1015a04_20"
    },
    {
        "source_sentence": "畢鉢村人得地焦炭起塔供養。",
        "translation": "The villagers of Bimbisāra obtained a charcoal from the ground and built a stūpa to make offerings.",
        "source": "T12n0383_002:1015a05_21"
    },
    {
        "source_sentence": "後有銜國異道道士求得地灰，亦還本國起塔供養。",
        "translation": "Later, there were heretics of the country of Kātyāyana who sought ashes from the ground and returned to their own country to build a stūpa to make offerings.",
        "source": "T12n0383_002:1015a06_22"
    },
    {
        "source_sentence": "摩訶摩耶經卷下",
        "translation": "Mahāmāyā-sūtra, Second Fascicle",
        "source": "T12n0383_002:1015a08_0"
    },
    {
        "source_sentence": "此經末元有八國分舍利品，約二紙半。",
        "translation": "Toward the end of this scripture there is a chapter on the relics belonging to the eight countries, consisting of two and a half sheets of paper.",
        "source": "T12n0383_002:1015a09_0"
    },
    {
        "source_sentence": "准校勘大藏，竹堂講師批該此段經文自是《涅槃》後分經文，不當在此。",
        "translation": "In accordance with the proofreading of the Mahāprajñāpāramitā, the lecturer in the bamboo hall criticized the text of this section of the sūtra because it was the text of the subsequent part of the Nirvana Sutra and shouldn't be here.",
        "source": "T12n0383_002:1015a09_1"
    },
    {
        "source_sentence": "然此已畢，「頂戴奉行」下，竺本無，當與削去。",
        "translation": "However, after this has been done, it's said that the originally nonexistent Zhu is to be given and cut off.",
        "source": "T12n0383_002:1015a11_2"
    },
    {
        "source_sentence": "奉此已除，各請詳悉。",
        "translation": "After honoring this, we'll remove it and ask each to explain it in detail.",
        "source": "T12n0383_002:1015a12_3"
    },
    {
        "source_sentence": "至元二十年三月望後二日題記。",
        "translation": "On the second day after the third month in the 20th year of Zhiyuan's reign, he wrote a title and record.",
        "source": "T12n0383_002:1015a12_4"
    },
    {
        "source_sentence": "經末有八國分舍利品，准校勘大藏，竹堂正法師云：「是《涅槃》後分，",
        "translation": "Toward the end of the Sutra there were eight national divisions of the Śāriputra chapter, according to which the Tripiṭaka was compiled into the Tripiṭaka. The Master Zheng of the Bamboo Hall said:",
        "source": "T12n0383_002:1015a14_0"
    },
    {
        "source_sentence": "不當在此。」",
        "translation": "They won't be here.",
        "source": "T12n0383_002:1015a15_1"
    },
    {
        "source_sentence": "下竺藏本元無，今削去。",
        "translation": "The originally nonexistent scriptures of the Later Zhuzang collection are now lost.",
        "source": "T12n0383_002:1015a15_2"
    },
    {
        "source_sentence": "至元二十年三月記。",
        "translation": "It was recorded in the third month of the 20th year of Zhiyuan.",
        "source": "T12n0383_002:1015a16_3"
    }
]