[
    {
        "source_sentence": "大方等無想經卷第三",
        "translation": "*Mahāmegha-sūtra, Volume 3",
        "source": "T12n0387_003:1088b13_0"
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Northern Liang Tianzhushu Sanzang translated by Dharmakṣema",
        "source": "T12n0387_003:1088b15_0"
    },
    {
        "source_sentence": "◎大雲初分陀羅尼健度第三",
        "translation": "Da雲初分陀羅尼健度第三大雲初分陀羅尼健度第三",
        "source": "T12n0387_003:1088b16_0"
    },
    {
        "source_sentence": "爾時，大雲密藏菩薩白佛言：「世尊！",
        "translation": "At that point, the great cloud of mysterious treasury bodhisattva said to the Buddha, Bhagavān!",
        "source": "T12n0387_003:1088b17_0"
    },
    {
        "source_sentence": "若有眾生，未入如是方等經者，當知是輩猶如盲、聾。",
        "translation": "If there are any sentient beings who haven't entered such a scripture, you should know that they're like blind and deaf people.",
        "source": "T12n0387_003:1088b17_1"
    },
    {
        "source_sentence": "此經中，有三十六種不退智寶，無邊心行意入陀羅尼門，即是一切諸法初門。",
        "translation": "In this sūtra, there are thirty-six kinds of nonretrogressing treasures of wisdom that enter the dhāraṇī aspect of limitless mental action, which is the first aspect of all dharmas.",
        "source": "T12n0387_003:1088b18_2"
    },
    {
        "source_sentence": "唯願如來，為是等故，廣宣分別。」",
        "translation": "May the Tathāgata, for this reason, explain it in detail and discern it.",
        "source": "T12n0387_003:1088b20_3"
    },
    {
        "source_sentence": "「佛言！",
        "translation": "The Buddha said!",
        "source": "T12n0387_003:1088b21_4"
    },
    {
        "source_sentence": "善哉善哉！",
        "translation": "Excellent, excellent!",
        "source": "T12n0387_003:1088b21_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1088b21_6"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1088b21_7"
    },
    {
        "source_sentence": "善思念之，今當為汝分別解說。",
        "translation": "Think of it well, and I will now explain it for you in a discriminating way.",
        "source": "T12n0387_003:1088b22_8"
    },
    {
        "source_sentence": "「此經中，有諸佛菩薩不退寶輪藏陀羅尼門；",
        "translation": "“In this sūtra there is the dhāraṇī aspect of the nonregression of buddhas and enlightening beings from the jewel-wheel store.",
        "source": "T12n0387_003:1088b22_9"
    },
    {
        "source_sentence": "此經復有諸佛菩薩大雲不退清淨密水陀羅尼；",
        "translation": "This scripture also contains the dhāraṇī of the great cloud of nonregression of buddhas and enlightening beings, pure and mysterious water.",
        "source": "T12n0387_003:1088b23_10"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退祕密光明陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of the great cloud of unregressing mysterious light of buddhas and enlightening beings.",
        "source": "T12n0387_003:1088b25_0"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退大雨陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of buddhas and enlightening beings not retreating from great rain.",
        "source": "T12n0387_003:1088b26_0"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退流水陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of buddhas and enlightening beings not regressing from flowing water.",
        "source": "T12n0387_003:1088b26_1"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退盡意陀羅尼；",
        "translation": "“Furthermore, there is a mental command of the great cloud of nonregression of buddhas and enlightening beings.",
        "source": "T12n0387_003:1088b27_2"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退電光陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of nonbacksliding lightning of buddhas and enlightening beings.",
        "source": "T12n0387_003:1088b28_3"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退涼電陀羅尼；",
        "translation": "“Furthermore, there is another dhāraṇī of great clouds of buddhas and enlightening beings not retreating from cool lightning.",
        "source": "T12n0387_003:1088b29_4"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退淨光陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of the great cloud of nonbacksliding pure light of buddhas and enlightening beings.",
        "source": "T12n0387_003:1088c01_5"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退彗星意陀羅尼；",
        "translation": "“Also there is the dhāraṇī of the intentions of buddhas and enlightening beings, great clouds of nonbacksliding comets.",
        "source": "T12n0387_003:1088c02_6"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退密藏光意陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of the great cloud of nonbacksliding mysterious treasury of light and thought of buddhas and enlightening beings.",
        "source": "T12n0387_003:1088c03_7"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退大呪意陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of buddhas and enlightening beings’ nonbacksliding great spell mental command.",
        "source": "T12n0387_003:1088c04_8"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退有德意陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of buddhas and enlightening beings’ virtuous aspiration for nonregression.",
        "source": "T12n0387_003:1088c05_9"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退虛空藏王陀羅尼；",
        "translation": "“Furthermore, there is another dhāraṇī of great clouds of buddhas and enlightening beings not regressing from the space-treasury king.",
        "source": "T12n0387_003:1088c06_10"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退大藥王陀羅尼；",
        "translation": "“Furthermore, there is another dhāraṇī of great clouds of buddhas and enlightening beings not regressing from the great king of healing medicine.",
        "source": "T12n0387_003:1088c07_11"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退大雨王陀羅尼；",
        "translation": "“Furthermore, there is another dhāraṇī of great clouds of buddhas and enlightening beings not retreating from the great rain shower.",
        "source": "T12n0387_003:1088c08_12"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退稱意陀羅尼；",
        "translation": "“Furthermore, there is a mental command of the great cloud of nonbacksliding praises of buddhas and enlightening beings.",
        "source": "T12n0387_003:1088c09_0"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退抧羅娑山意陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of the intentions of buddhas and enlightening beings called Great Cloud of Nonbacksliding Caustic Mountain.",
        "source": "T12n0387_003:1088c09_1"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退意行陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of nonregressing mental action of buddhas and enlightening beings.",
        "source": "T12n0387_003:1088c10_2"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退上高王陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of buddhas and enlightening beings not retreating from the highest heaven.",
        "source": "T12n0387_003:1088c11_3"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退潮王陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of buddhas and enlightening beings not regressing from the ocean.",
        "source": "T12n0387_003:1088c12_4"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退鵝王目陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of buddhas and enlightening beings not regressing from the eye of the king of geese.",
        "source": "T12n0387_003:1088c13_5"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退大海智陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of knowledge of buddhas and enlightening beings not regressing from the great ocean.",
        "source": "T12n0387_003:1088c14_6"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退甚深意王精進陀羅尼；",
        "translation": "“Furthermore, there is another dhāraṇī of the great cloud of nonregression of buddhas and enlightening beings, the profound determination for enlightenment.",
        "source": "T12n0387_003:1088c15_7"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退雨種陀羅尼；",
        "translation": "“Furthermore, there is a dhāraṇī of great clouds of buddhas and enlightening beings planting rain without retreating.",
        "source": "T12n0387_003:1088c16_8"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退地鬘陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of buddhas and enlightening beings not regressing from the earth.",
        "source": "T12n0387_003:1088c17_9"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退歡喜陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of nonbacksliding joy of buddhas and enlightening beings.",
        "source": "T12n0387_003:1088c18_10"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退世意陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of nonbacksliding worldly aspirations of buddhas and enlightening beings.",
        "source": "T12n0387_003:1088c19_11"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退不動意陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of nonbacksliding and unshakable minds of buddhas and bodhisattvas.",
        "source": "T12n0387_003:1088c20_12"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退地陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of great clouds of buddhas and enlightening beings not regressing from the earth.",
        "source": "T12n0387_003:1088c21_13"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退積聚陀羅尼；",
        "translation": "“Furthermore, there are great clouds of enlightening beings’ and buddhas’ concentration spells that do not regress.",
        "source": "T12n0387_003:1088c22_0"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退水光陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of the great cloud of nonbacksliding water light of buddhas and enlightening beings.",
        "source": "T12n0387_003:1088c22_1"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退無盡水藏陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of the great cloud of buddhas and enlightening beings not regressing from the inexhaustible water-treasury.",
        "source": "T12n0387_003:1088c23_2"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退水性月光陀羅尼；",
        "translation": "“Furthermore, there is the dhāraṇī of the moonlight of great clouds of buddhas and enlightening beings that do not recede from the water-nature of the moon.",
        "source": "T12n0387_003:1088c24_3"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退水光體陀羅尼；",
        "translation": "“Furthermore, there is another dhāraṇī of the great cloud of nonregression of buddhas and enlightening beings:",
        "source": "T12n0387_003:1088c25_4"
    },
    {
        "source_sentence": "復有諸佛菩薩大雲不退不可思意大海王陀羅尼。",
        "translation": "Again, there are great clouds of buddhas and bodhisattvas who don't regress from the inconceivable great ocean king dhāraṇī.",
        "source": "T12n0387_003:1088c26_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1088c28_0"
    },
    {
        "source_sentence": "是名三十六種不退智寶無邊心行意入陀羅尼。」",
        "translation": "These are called the thirty-six kinds of entry into the dhāraṇī of the infinite mind, practice, and thought of the nonretrogressing treasure of wisdom.",
        "source": "T12n0387_003:1088c28_1"
    },
    {
        "source_sentence": "爾時，眾中有一天女，名曰寶鬘，上昇虛空，高七多羅樹，雨種種華、塗香、末香、幡蓋、伎樂，",
        "translation": "At that time, there was a celestial maiden in the assembly named Jewel Garland. She ascended up into the sky seven thousand yojanas above the ground and rained down various kinds of flowers, scented ointments, powdered odors, canopies, banners, canopies, and music.",
        "source": "T12n0387_003:1088c29_2"
    },
    {
        "source_sentence": "「如來大醫王！　　金剛身不壞，",
        "translation": "“O great physician king, the body of the thus enlightened one is indestructible like a diamond:",
        "source": "T12n0387_003:1089a02_3"
    },
    {
        "source_sentence": "　意等慧殊勝，　　戒淨愍眾生；",
        "translation": "Their minds, intellect, etc., are superior in wisdom, And their morality pure and compassionate toward sentient beings.",
        "source": "T12n0387_003:1089a02_3"
    },
    {
        "source_sentence": "　除斷諸煩惱，　　猶如日破闇，",
        "translation": "Removing all afflictions is like the sun destroying darkness.",
        "source": "T12n0387_003:1089a02_3"
    },
    {
        "source_sentence": "　今說陀羅尼，　　如雲降大雨！」",
        "translation": "Now, I'll explain the dhāraṇī, like a cloud sending down a great rain!",
        "source": "T12n0387_003:1089a02_3"
    },
    {
        "source_sentence": "以供養佛，說偈讚曰：大雲初分密語健度第四爾時，大雲密藏菩薩言：「世尊！",
        "translation": "In homage to the Buddha, he spoke a verse in praise, saying, The first part of the great clouds' esoteric speech is the fourth strength. At that point, the great cloud-mysterious treasury bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1089a02_3"
    },
    {
        "source_sentence": "一切眾生，無明所盲，唯願如來，廣開顯示諸佛密語，然深智燈，作大明導。」",
        "translation": "All sentient beings are blinded by ignorance, so may the Tathāgata reveal the mysterious words of the buddhas in detail, but the profound lamp of wisdom will be a great guide of insight.",
        "source": "T12n0387_003:1089a08_4"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1089a10_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1089a10_6"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1089a10_7"
    },
    {
        "source_sentence": "善思念之，吾當為汝然大法燈。",
        "translation": "Consider it well, and I will give you the great lamp of the Dharma.",
        "source": "T12n0387_003:1089a11_8"
    },
    {
        "source_sentence": "此經中，有諸佛菩薩二十三種密語道迹入不狂行大法方便解脫門：斷我我所密語所入行解脫門；",
        "translation": "In this scripture there are twenty-three kinds of liberation doors through which buddhas and enlightening beings enter the path of mysterious speech, saying:",
        "source": "T12n0387_003:1089a11_9"
    },
    {
        "source_sentence": "可畏色、不可畏色、下色密語所入解脫門；",
        "translation": "It is the door of liberation entered by those who fear form, fearless form, and inferior form that are esoteric.",
        "source": "T12n0387_003:1089a14_10"
    },
    {
        "source_sentence": "貪求不得密語所入解脫門；",
        "translation": "They covet and do not obtain the door of liberation entered by esoteric teachings.",
        "source": "T12n0387_003:1089a15_0"
    },
    {
        "source_sentence": "斷界、有界、無界密語門；",
        "translation": "The door of the esoteric discourse of eliminating realms, realms of existence and non-realms.",
        "source": "T12n0387_003:1089a15_1"
    },
    {
        "source_sentence": "有無明、無無明、有無無明密語門；",
        "translation": "“Great enlightening beings have the esoteric approach of nescience, absence of nescience, and absence of nescience.",
        "source": "T12n0387_003:1089a16_2"
    },
    {
        "source_sentence": "有貪、無貪者，斷貪密語門；",
        "translation": "Those with craving and those without craving abandon the esoteric approach of cutting off greed.",
        "source": "T12n0387_003:1089a16_3"
    },
    {
        "source_sentence": "有愛、無愛者，斷愛密語門；",
        "translation": "Those with craving and those without craving are the door of mysterious speech eliminating craving.",
        "source": "T12n0387_003:1089a17_4"
    },
    {
        "source_sentence": "有繫、無繫者，斷繫密語門；",
        "translation": "Those with fetters and those without fetters are the door of mysterious speech eliminating fetters.",
        "source": "T12n0387_003:1089a18_5"
    },
    {
        "source_sentence": "有瞋、無瞋者，斷瞋密語門；",
        "translation": "“Those with hatred and those without hatred”: To eliminate the approach of malicious esoteric speech.",
        "source": "T12n0387_003:1089a18_6"
    },
    {
        "source_sentence": "有闇、無闇，有光密語門；",
        "translation": "With darkness and without darkness, there is the door of mysterious speech with light.",
        "source": "T12n0387_003:1089a19_7"
    },
    {
        "source_sentence": "有鈍、無鈍，有利、大利密語門；",
        "translation": "There are those of dullness and those of no dullness; there are those of benefit and those of great advantage.",
        "source": "T12n0387_003:1089a19_8"
    },
    {
        "source_sentence": "有破、有析、有壞密語門；",
        "translation": "There is the esoteric approach of refuting, analyzing, and disintegrating doctrine.",
        "source": "T12n0387_003:1089a20_9"
    },
    {
        "source_sentence": "有苦、有樂、無有受者密語門；",
        "translation": "This is the esoteric approach of saying “There is suffering, there is bliss, and there is no sensation”:",
        "source": "T12n0387_003:1089a21_0"
    },
    {
        "source_sentence": "有慈、無慈、無愍密語門；",
        "translation": "With kindness, without kindness and without wickedness, they have the door of mysterious speech.",
        "source": "T12n0387_003:1089a21_1"
    },
    {
        "source_sentence": "有施無受者，有大施主密語門；",
        "translation": "“There is giving and no receiving”: There is the great donor who has the door of mysterious speech.",
        "source": "T12n0387_003:1089a22_2"
    },
    {
        "source_sentence": "有罵無受者，斷罵密語門；",
        "translation": "Someone who scolds without receiving is to cut off the door of scolding esoteric speech.",
        "source": "T12n0387_003:1089a22_3"
    },
    {
        "source_sentence": "有淨、無淨，斷一切淨密語門；",
        "translation": "Both pure and impure, they cut off the door of all pure esoteric sayings.",
        "source": "T12n0387_003:1089a23_4"
    },
    {
        "source_sentence": "有等、無等，斷一切等密語門；",
        "translation": "Equanimous and unequal, they cut off all the doors of esoteric speech.",
        "source": "T12n0387_003:1089a24_5"
    },
    {
        "source_sentence": "有放逸、無放逸，斷放逸、不放逸密語門；",
        "translation": "With heedlessness and without heedlessness, they cut off the doors of secret speech of heedlessness and non-heedlessness.",
        "source": "T12n0387_003:1089a24_6"
    },
    {
        "source_sentence": "空、不空、非空、非不空如來密語門；",
        "translation": "The esoteric teachings of emptiness, nonempty, nonempty, and nonnonempty buddhas.",
        "source": "T12n0387_003:1089a25_7"
    },
    {
        "source_sentence": "常、無常、非常、非無常如來密語門；",
        "translation": "“Great enlightening beings practice the esoteric sayings of the buddhas who are permanent, impermanent, eternal, and not impermanent.",
        "source": "T12n0387_003:1089a26_8"
    },
    {
        "source_sentence": "我、無我、非我、非無我如來密語門；",
        "translation": "“Great enlightening beings practice the esoteric sayings of the buddhas: self, selflessness, nonself, and nonselflessness.",
        "source": "T12n0387_003:1089a27_9"
    },
    {
        "source_sentence": "愛、無愛、非愛、非無愛如來密語門。",
        "translation": "The Tathāgata's esoteric approach of craving, non-craving, non-craving, and non-non-craving.",
        "source": "T12n0387_003:1089a28_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1089a28_1"
    },
    {
        "source_sentence": "是名二十三種密語道迹入不狂行大法方便解脫門。」",
        "translation": "This is called the gate of liberation through the twenty-three kinds of esoteric teachings that enter the path and don't go crazy about practicing the great teaching.",
        "source": "T12n0387_003:1089a28_2"
    },
    {
        "source_sentence": "爾時，眾中有一天子，名曰眾愛，與無量天子，上昇虛空，高十七多羅樹，",
        "translation": "At that time, a celestial being in the assembly named Sanghabhavyūha and an immeasurable number of other celestial beings rose up into the sky seventeen thousand yojanas in height from the palm trees.",
        "source": "T12n0387_003:1089b01_3"
    },
    {
        "source_sentence": "「如來深密語，　　二乘所不解，",
        "translation": "The profound and esoteric teachings of the Buddha are not understood by the two vehicles.",
        "source": "T12n0387_003:1089b02_4"
    },
    {
        "source_sentence": "　為眾故宣說，　　悉令得安樂。」",
        "translation": "Explain it for the sake of the people, and they'll all attain well-being.",
        "source": "T12n0387_003:1089b02_4"
    },
    {
        "source_sentence": "雨諸華、香、幡蓋、伎樂以供養佛，說偈讚曰：大雲初分轉生有藏健度第五爾時，",
        "translation": "It rained flowers, fragrances, banners, canopies, and music to make offerings to the Buddha. They praised him in verse:",
        "source": "T12n0387_003:1089b02_4"
    },
    {
        "source_sentence": "大雲密藏菩薩言：「世尊！",
        "translation": "The great cloud-mysterious treasury bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1089b07_5"
    },
    {
        "source_sentence": "有十神通，行入有生行藏微妙光王法門。",
        "translation": "There are ten supernormal powers that practice and enter the subtle, subtle, shining king dharma-gate of the arising store of sentient beings.",
        "source": "T12n0387_003:1089b07_6"
    },
    {
        "source_sentence": "唯願如來，分別廣說。」",
        "translation": "Please, Tathāgata, explain it in detail.",
        "source": "T12n0387_003:1089b08_7"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1089b09_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1089b09_9"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1089b09_10"
    },
    {
        "source_sentence": "善思念之，吾當為汝廣宣分別。",
        "translation": "Consider them well and I will explain their distinctions in detail for you.",
        "source": "T12n0387_003:1089b09_11"
    },
    {
        "source_sentence": "此經中，有諸佛菩薩十有生樂王法門；",
        "translation": "In this scripture there is the doctrine that all buddhas and enlightening beings have ten kinds of birth:",
        "source": "T12n0387_003:1089b10_12"
    },
    {
        "source_sentence": "復有有生求喜法門；",
        "translation": "“Furthermore, there is another approach that produces the principle of seeking joy.",
        "source": "T12n0387_003:1089b11_13"
    },
    {
        "source_sentence": "復有有生虛渴法門；",
        "translation": "Again, there is the doctrine of the arising of empty thirst.",
        "source": "T12n0387_003:1089b12_0"
    },
    {
        "source_sentence": "復有有生樂說法門；",
        "translation": "Again, there is another way to give rise to joy in expounding the Teaching:",
        "source": "T12n0387_003:1089b12_1"
    },
    {
        "source_sentence": "復有有生安法門；",
        "translation": "“Furthermore, there is the doctrine of birth and peace.",
        "source": "T12n0387_003:1089b12_2"
    },
    {
        "source_sentence": "復有有生願法門；",
        "translation": "Again, there is the doctrine of the arising of vows.",
        "source": "T12n0387_003:1089b13_3"
    },
    {
        "source_sentence": "復有有生稱法門；",
        "translation": "“Furthermore, there is another aspect of the doctrine that produces what is called ‘fame’:",
        "source": "T12n0387_003:1089b13_4"
    },
    {
        "source_sentence": "復有有生體王法門；",
        "translation": "“Furthermore, there is another doctrine of the arising of the essence king.",
        "source": "T12n0387_003:1089b14_5"
    },
    {
        "source_sentence": "復有有生善王法門；",
        "translation": "“Furthermore, there is another doctrine that leads to the production of good kings.",
        "source": "T12n0387_003:1089b14_6"
    },
    {
        "source_sentence": "復有有生無善不染行藏微妙法王法門。",
        "translation": "Again, there's the subtle Dharma king dharma-gate of the store of unwholesome and undefiled practices that arises.",
        "source": "T12n0387_003:1089b15_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1089b16_8"
    },
    {
        "source_sentence": "是名十神通行入有生行藏微妙光王法門。」",
        "translation": "This is called the Dharma-gate of the Sublime King of Subtle Light from the Treasury of Birth and Conduct of the Ten Deities, which leads to the entry into the subtle light of the store of existence.",
        "source": "T12n0387_003:1089b16_9"
    },
    {
        "source_sentence": "時，大眾中有一天女，名曰愛光，以諸天華、種種雜香、幡蓋、伎樂以供養佛，",
        "translation": "In the assembly, there was a goddess named Light of Delight who offered heavenly flowers, various perfumes, banners, canopies, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1089b17_10"
    },
    {
        "source_sentence": "「我今稽首禮，　　不生於諸有，",
        "translation": "I now bow my head in homage, not rising from the world.",
        "source": "T12n0387_003:1089b18_11"
    },
    {
        "source_sentence": "　方便行諸趣，　　普為一切眾；",
        "translation": "Practicing skillful means in all realms of existence, They serve all beings everywhere.",
        "source": "T12n0387_003:1089b18_11"
    },
    {
        "source_sentence": "　如來心自在，　　是故其身常，",
        "translation": "Because the Buddha’s mind is free, That is why his body is permanent.",
        "source": "T12n0387_003:1089b18_11"
    },
    {
        "source_sentence": "　為眾轉生死，　　如華無所染。」",
        "translation": "For the sake of sentient beings, birth and death are like flowers that aren't stained by anything.",
        "source": "T12n0387_003:1089b18_11"
    },
    {
        "source_sentence": "而讚歎曰：大雲初分得轉生死業煩惱健度第六爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He praised them, saying, The first part of the great cloud attains the sixth stage of the transformation of birth-and-death karma and afflictions that are strongly liberated.",
        "source": "T12n0387_003:1089b18_11"
    },
    {
        "source_sentence": "有十生死煩惱業田得心定願藏法門。",
        "translation": "There are the ten afflictive karmic fields of birth and death that attain the mind, concentration, vows, and store dharmas.",
        "source": "T12n0387_003:1089b25_12"
    },
    {
        "source_sentence": "唯願如來，廣為眾生分別解說。」",
        "translation": "May the Tathāgata explain it in detail for sentient beings with discernment and understanding.",
        "source": "T12n0387_003:1089b26_13"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1089b27_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1089b27_15"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1089b27_16"
    },
    {
        "source_sentence": "善思念之，吾當為汝開示解說。",
        "translation": "Consider it well, and I will explain it for you.",
        "source": "T12n0387_003:1089b28_17"
    },
    {
        "source_sentence": "此經中，有得生死煩惱田果實法門；",
        "translation": "In this scripture there is the doctrine of acquiring the fruit of birth and death as a field of affliction.",
        "source": "T12n0387_003:1089b28_18"
    },
    {
        "source_sentence": "復有生死田樂王法門；",
        "translation": "“Furthermore, there is another doctrine of the king of fields of pleasure and fields of birth and death.",
        "source": "T12n0387_003:1089b29_19"
    },
    {
        "source_sentence": "復有生死莊嚴住心法門；",
        "translation": "“Furthermore, there is the mental aspect of abiding in the adornments of birth and death.",
        "source": "T12n0387_003:1089c01_20"
    },
    {
        "source_sentence": "復有生死喜地法門；",
        "translation": "“Furthermore, there is another doctrine of the joyful state of birth and death.",
        "source": "T12n0387_003:1089c01_21"
    },
    {
        "source_sentence": "復有生死期地法門；",
        "translation": "Again, there is another doctrine that explains the time periods of birth and death.",
        "source": "T12n0387_003:1089c02_22"
    },
    {
        "source_sentence": "復有生死正見法門；",
        "translation": "Again, there is the doctrine of right view in regard to birth and death.",
        "source": "T12n0387_003:1089c02_23"
    },
    {
        "source_sentence": "復有生死眴法門；",
        "translation": "Again, there is the doctrine of mundane whirl.",
        "source": "T12n0387_003:1089c03_24"
    },
    {
        "source_sentence": "復有生死衣法門；",
        "translation": "“Furthermore, there is another doctrine of the robe of birth and death.",
        "source": "T12n0387_003:1089c03_25"
    },
    {
        "source_sentence": "復有生死久住法門；",
        "translation": "Again, there is the doctrine that birth and death last a long time.",
        "source": "T12n0387_003:1089c04_26"
    },
    {
        "source_sentence": "復有生死光明法門。",
        "translation": "Again, there's the dharma-gate of the light of birth and death.",
        "source": "T12n0387_003:1089c04_27"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1089c05_0"
    },
    {
        "source_sentence": "是名十生死煩惱業田，得心定願藏法門。」",
        "translation": "This is called the Dharma teaching of the ten afflictive karmic fields of birth-and-death and the attainment of the store of mind concentration and vows.",
        "source": "T12n0387_003:1089c05_1"
    },
    {
        "source_sentence": "爾時，眾中有龍王，名曰無毒，以諸雜香、上妙諸花、幡蓋、伎樂供養於佛，",
        "translation": "At the time, there was a dragon king named Non- venomous among the crowd who offered various incenses, exquisite flowers, banners, canopies, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1089c06_2"
    },
    {
        "source_sentence": "「為諸眾生故，　　顯示生死義，",
        "translation": "For the sake of sentient beings, they show the meaning of birth and death.",
        "source": "T12n0387_003:1089c07_3"
    },
    {
        "source_sentence": "　佛無煩惱業，　　為眾故處之。」",
        "translation": "The Buddha has no afflictive karma, so he places it for the sake of sentient beings.",
        "source": "T12n0387_003:1089c07_3"
    },
    {
        "source_sentence": "即說讚曰：大雲初分智狂入健度第七爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, The first part of Mahāmaudgalyāyana's wisdom is crazy and enters the seventh stage of enlightenment.",
        "source": "T12n0387_003:1089c07_3"
    },
    {
        "source_sentence": "有十種智狂不可思議神通王所入法門，唯願如來，廣開分別。」",
        "translation": "There are ten kinds of dharmas entered by the king of inconceivable wisdom and supernormal powers, so please let the Tathāgata explain them in detail.",
        "source": "T12n0387_003:1089c11_4"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1089c13_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1089c13_6"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1089c13_7"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1089c13_8"
    },
    {
        "source_sentence": "此經中有得大安隱法門；",
        "translation": "In this sutra there is the doctrine of attainment of great peace.",
        "source": "T12n0387_003:1089c14_9"
    },
    {
        "source_sentence": "無勝勝神通王法門；",
        "translation": "There is no superior teaching of the king of mystic powers.",
        "source": "T12n0387_003:1089c15_10"
    },
    {
        "source_sentence": "無稱稱光所入法門；",
        "translation": "The door of teaching entered by the light of nameless glory.",
        "source": "T12n0387_003:1089c15_11"
    },
    {
        "source_sentence": "無量量光所入法門；",
        "translation": "Measureless is the dharma-gate into which Light enters.",
        "source": "T12n0387_003:1089c16_12"
    },
    {
        "source_sentence": "菩提時法門；",
        "translation": "The teaching of the time of enlightenment:",
        "source": "T12n0387_003:1089c16_13"
    },
    {
        "source_sentence": "期光法門；",
        "translation": "Dharma-gate of Expectation and Light;",
        "source": "T12n0387_003:1089c16_14"
    },
    {
        "source_sentence": "高梯法門；",
        "translation": "the teaching of high staircases;",
        "source": "T12n0387_003:1089c17_15"
    },
    {
        "source_sentence": "寬腹法門；",
        "translation": "the doctrine of wide- belliedness;",
        "source": "T12n0387_003:1089c17_16"
    },
    {
        "source_sentence": "持一切眾生法門；",
        "translation": "They preserve the teachings of all sentient beings.",
        "source": "T12n0387_003:1089c17_17"
    },
    {
        "source_sentence": "現在光法門。",
        "translation": "Now, he's illuminating the Dharma teaching.",
        "source": "T12n0387_003:1089c18_18"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1089c18_19"
    },
    {
        "source_sentence": "是名十種智狂不可思議神通王所入法門。」",
        "translation": "These are called the ten kinds of dharmas entered by the inconceivable king of wisdom and supernormal powers.",
        "source": "T12n0387_003:1089c18_20"
    },
    {
        "source_sentence": "於是，眾中有一天女，名曰善鬘，以種種雜華、上妙諸香、幡蓋、伎樂以供養佛，",
        "translation": "Then a goddess named Sudarśana, called Sunetra, came to the assembly and offered various kinds of flowers, exquisite perfumes, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1089c19_21"
    },
    {
        "source_sentence": "「佛心難思議！　　智身亦復然，",
        "translation": "“The mind of Buddha is inconceivable, and so is the body of knowledge.",
        "source": "T12n0387_003:1089c21_22"
    },
    {
        "source_sentence": "　為化眾生故，　　廣開此法門。」",
        "translation": "For the sake of transforming sentient beings, he widely opens this teaching.",
        "source": "T12n0387_003:1089c21_22"
    },
    {
        "source_sentence": "即說讚曰：大雲初分解脫轉福德藏法門健度第八爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, At the beginning of the great cloud, he disintegrates and transforms the store of merit into the eighth stage of the Dharma-gate of the Buddha's miraculous liberation.",
        "source": "T12n0387_003:1089c21_22"
    },
    {
        "source_sentence": "有十智甚深入無畏行法王法門，唯願如來，廣分別說。」",
        "translation": "There are ten kinds of knowledge that profoundly penetrate the fearless practice of the Dharma king's teaching, so may the Tathāgata explain it in detail.",
        "source": "T12n0387_003:1089c25_23"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1089c26_24"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1089c27_25"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1089c27_26"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1089c27_27"
    },
    {
        "source_sentence": "有解脫一切惡法法門；",
        "translation": "There is the doctrine of liberation from all evil states.",
        "source": "T12n0387_003:1089c28_28"
    },
    {
        "source_sentence": "虛空藏法門；",
        "translation": "the doctrine-gate of the store of space;",
        "source": "T12n0387_003:1089c28_29"
    },
    {
        "source_sentence": "甚深安入法門；",
        "translation": "He entered profoundly into the Teaching.",
        "source": "T12n0387_003:1089c29_30"
    },
    {
        "source_sentence": "細針法門；",
        "translation": "The teaching of the method of subtle needles;",
        "source": "T12n0387_003:1089c29_31"
    },
    {
        "source_sentence": "海不動法門；",
        "translation": "“Great enlightening beings have ten kinds of practice:",
        "source": "T12n0387_003:1089c29_32"
    },
    {
        "source_sentence": "智燈法門；",
        "translation": "the dharma-gate of the lamp of knowledge;",
        "source": "T12n0387_003:1090a01_33"
    },
    {
        "source_sentence": "身口法門；",
        "translation": "the doctrine of body and speech;",
        "source": "T12n0387_003:1090a01_34"
    },
    {
        "source_sentence": "斷入一切煩惱法門；",
        "translation": "They cut off and enter all the dharmas of afflictions.",
        "source": "T12n0387_003:1090a01_35"
    },
    {
        "source_sentence": "堅意入法門；",
        "translation": "They firmly entered the Teaching with determination.",
        "source": "T12n0387_003:1090a02_0"
    },
    {
        "source_sentence": "淨意無礙法門。",
        "translation": "The pure mind is the unobstructed dharma-gate.",
        "source": "T12n0387_003:1090a02_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090a02_2"
    },
    {
        "source_sentence": "是名十智甚深入無畏行法王法門。」",
        "translation": "This is called the Dharma gate of the ten kinds of wisdom that profoundly penetrate the fearless practice of the Dharma king.",
        "source": "T12n0387_003:1090a02_3"
    },
    {
        "source_sentence": "時，大眾中有一天女，名金光明，以種種雜華、上妙諸香、幡蓋、伎樂以供養佛，",
        "translation": "At that time a goddess named Golden Light was present in the assembly. She offered various kinds of flowers, exquisite fragrances, banners, canopies, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1090a03_4"
    },
    {
        "source_sentence": "「如來金色身，　　智寶為瓔珞，",
        "translation": "The Tathāgata’s golden-colored body Is adorned with the jewel of wisdom.",
        "source": "T12n0387_003:1090a05_5"
    },
    {
        "source_sentence": "　善法之寶聚，　　猶須彌草木。」",
        "translation": "A cluster of treasures of the good Dharma is like a mountain of grass and trees.",
        "source": "T12n0387_003:1090a05_5"
    },
    {
        "source_sentence": "即說讚曰：大雲初分解脫有德轉藏健度第九爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, At the first disintegration of the great cloud, there's the ninth liberation of the virtuous treasury of transmutation and strength.",
        "source": "T12n0387_003:1090a05_5"
    },
    {
        "source_sentence": "有十種大雲見流不可思議功德寶藏法門，唯願如來，分別解說。」",
        "translation": "There are ten kinds of great clouds that see the flow of the inconceivable treasure-store dharma-gate of merit, so may the Tathāgata explain it separately.",
        "source": "T12n0387_003:1090a09_6"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1090a11_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090a11_8"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1090a11_9"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別演說。",
        "translation": "Think of it well and I will explain it for you in detail.",
        "source": "T12n0387_003:1090a11_10"
    },
    {
        "source_sentence": "有樂慈藏法門；",
        "translation": "They delighted in the Teaching of the store of compassion.",
        "source": "T12n0387_003:1090a12_11"
    },
    {
        "source_sentence": "樂悲藏法門；",
        "translation": "They delight in the Teaching of the store of compassion.",
        "source": "T12n0387_003:1090a13_0"
    },
    {
        "source_sentence": "樂喜藏法門；",
        "translation": "They delighted in the doctrine of the store of joy.",
        "source": "T12n0387_003:1090a13_1"
    },
    {
        "source_sentence": "樂捨藏法門；",
        "translation": "They delight in the doctrine of the store of relinquishment.",
        "source": "T12n0387_003:1090a13_2"
    },
    {
        "source_sentence": "寶水流藏法門；",
        "translation": "The Teaching of the Jewel-Flowing Treasury:",
        "source": "T12n0387_003:1090a13_3"
    },
    {
        "source_sentence": "大海行法門；",
        "translation": "“Great enlightening beings practice the great ocean of principles.",
        "source": "T12n0387_003:1090a14_4"
    },
    {
        "source_sentence": "如來所說法流法門；",
        "translation": "The teachings of the enlightened one are the doctrine-gate of the Teaching that flows.",
        "source": "T12n0387_003:1090a14_5"
    },
    {
        "source_sentence": "時入藏法門；",
        "translation": "At that time, he entered the Teaching of the Tripiṭaka.",
        "source": "T12n0387_003:1090a15_6"
    },
    {
        "source_sentence": "想意寶藏入法門；",
        "translation": "“Great enlightening beings enter the Teaching by means of the jeweled treasury of ideation.",
        "source": "T12n0387_003:1090a15_7"
    },
    {
        "source_sentence": "一切大法聚法門。",
        "translation": "All the great collections of dharmas are the Dharma teachings.",
        "source": "T12n0387_003:1090a15_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090a16_9"
    },
    {
        "source_sentence": "是名十種大雲見流不可思議功德寶藏法門。」",
        "translation": "These are called the ten kinds of great clouds that see the flow of inconceivable jeweled treasury of merit.",
        "source": "T12n0387_003:1090a16_10"
    },
    {
        "source_sentence": "時，大眾中有一天子，名智愛樂，以種種雜華、上妙諸香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, a celestial being in the great assembly named Wisdom Loves Delight was honoring the Buddha with various kinds of flowers, exquisite fragrances, banners, canopies, and music.",
        "source": "T12n0387_003:1090a17_11"
    },
    {
        "source_sentence": "「如來無生滅，　　佛法難測量！",
        "translation": "The Tathāgata has no arising or ceasing, and the Buddha's teaching is immeasurable!",
        "source": "T12n0387_003:1090a19_12"
    },
    {
        "source_sentence": "　眾生無明覆，　　廣演於法界！」",
        "translation": "Sentient beings are hindered by ignorance, so explain it in detail in the Dharma realm!",
        "source": "T12n0387_003:1090a19_12"
    },
    {
        "source_sentence": "即說讚曰：大雲初分轉功德行健度第十爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, The first part of the great cloud is the tenth stage of the transformation of virtuous practice that's powerful and liberating.",
        "source": "T12n0387_003:1090a19_12"
    },
    {
        "source_sentence": "有十種雨流不可思議功德藏法門，唯願如來，分別解說。」",
        "translation": "There are ten kinds of unfathomable rain-flowing dharma-gate of the store of merit, so may the Tathāgata explain them separately.",
        "source": "T12n0387_003:1090a23_13"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1090a24_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090a25_15"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1090a25_16"
    },
    {
        "source_sentence": "善思念之。",
        "translation": "Consider it well and think of it.",
        "source": "T12n0387_003:1090a25_17"
    },
    {
        "source_sentence": "吾當為汝，廣宣分別。",
        "translation": "I will explain it in detail for you.",
        "source": "T12n0387_003:1090a26_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090a26_1"
    },
    {
        "source_sentence": "有雨網法門；",
        "translation": "There is the doctrine of rain-gathering net.",
        "source": "T12n0387_003:1090a26_2"
    },
    {
        "source_sentence": "有寶王法門；",
        "translation": "There is the doctrine of the king of treasures.",
        "source": "T12n0387_003:1090a27_0"
    },
    {
        "source_sentence": "有雨大海王法門；",
        "translation": "“Furthermore, there is the doctrine of the great ocean ruler who showers rain.",
        "source": "T12n0387_003:1090a27_1"
    },
    {
        "source_sentence": "有雨塵法門；",
        "translation": "There is the dharma-gate of rain and dust.",
        "source": "T12n0387_003:1090a27_2"
    },
    {
        "source_sentence": "有雨斷毒法門；",
        "translation": "There is the dharma-gate of stopping poison by rain; there is the dharma-gate of stopping poison by water;",
        "source": "T12n0387_003:1090a28_3"
    },
    {
        "source_sentence": "有雨滿安樂法門；",
        "translation": "There was a shower of rain filling the doors of the Teaching of peace and comfort.",
        "source": "T12n0387_003:1090a28_4"
    },
    {
        "source_sentence": "有雨體法門；",
        "translation": "There is the dharma-gate of the essence of rain.",
        "source": "T12n0387_003:1090a28_5"
    },
    {
        "source_sentence": "有雨種種正見法門；",
        "translation": "There was a rain of various doctrines of right view.",
        "source": "T12n0387_003:1090a29_6"
    },
    {
        "source_sentence": "有雨功德法門；",
        "translation": "There is the doctrine-gate of the merit of rain.",
        "source": "T12n0387_003:1090a29_7"
    },
    {
        "source_sentence": "有雨涼藥法門。",
        "translation": "There's the dharma-gate of rain and cool medicine.",
        "source": "T12n0387_003:1090a29_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090b01_9"
    },
    {
        "source_sentence": "是名十種雨流不可思議功德藏法門。」",
        "translation": "These are called the ten kinds of rain-flowing inconceivable treasury of merit.",
        "source": "T12n0387_003:1090b01_10"
    },
    {
        "source_sentence": "時，大眾中有一天子，名虛空雷，持諸華、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, a celestial being in the great assembly named Ākāśika thundered from the sky and offered flowers, perfumes, banners, canopies, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1090b02_11"
    },
    {
        "source_sentence": "「諸佛如來說，　　上妙微密藏，",
        "translation": "The buddha-tathāgatas teach the supreme, subtle, and hidden treasury:",
        "source": "T12n0387_003:1090b03_12"
    },
    {
        "source_sentence": "　能令一切眾，　　永度煩惱流，",
        "translation": "They can cause all sentient beings To permanently cross the stream of afflictions.",
        "source": "T12n0387_003:1090b03_12"
    },
    {
        "source_sentence": "　斷滅生死苦，　　一切永無餘，",
        "translation": "To extinguish the suffering of birth and death, All forever without remainder.",
        "source": "T12n0387_003:1090b03_12"
    },
    {
        "source_sentence": "　深自覺悟得，　　涅槃常樂俱。",
        "translation": "Being deeply enlightened on their own, they attain nirvāṇa with constant bliss.",
        "source": "T12n0387_003:1090b03_12"
    },
    {
        "source_sentence": "　如來天中天，　　成就無量德！",
        "translation": "The Tathāgata, the god among gods, Has perfected immeasurable virtue.",
        "source": "T12n0387_003:1090b03_12"
    },
    {
        "source_sentence": "　今說《大雲經》，　　為眾發道心。」",
        "translation": "Now, I'll explain the Mahāprajñāpāramitā-sūtra to arouse the mind of enlightenment for the sake of all.",
        "source": "T12n0387_003:1090b03_12"
    },
    {
        "source_sentence": "即說讚曰：大雲初分雲虛空生健度第十一爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, The first part of the great cloud is a cloud of space that gives rise to the eleventh moment of strength. At that point, the Great Cloud esoteric store bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1090b03_12"
    },
    {
        "source_sentence": "有十種大雲得虛空定法門，唯願如來，善分別說。」",
        "translation": "There are ten kinds of great clouds that attain the dharma-gate of space concentration, so may the Tathāgata explain it well and distinctly.",
        "source": "T12n0387_003:1090b12_13"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1090b13_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090b14_15"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1090b14_16"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1090b14_17"
    },
    {
        "source_sentence": "有善法王法門；",
        "translation": "There is the doctrine of King of Good Law.",
        "source": "T12n0387_003:1090b15_18"
    },
    {
        "source_sentence": "見性法門；",
        "translation": "the doctrine-gate of seeing one’s essence;",
        "source": "T12n0387_003:1090b15_19"
    },
    {
        "source_sentence": "智無勝王法門；",
        "translation": "“Great enlightening beings have no preeminent knowledge of the dharmas of omniscience.",
        "source": "T12n0387_003:1090b15_20"
    },
    {
        "source_sentence": "無憍慢法門；",
        "translation": "The dharma-gate of the absence of conceit.",
        "source": "T12n0387_003:1090b16_21"
    },
    {
        "source_sentence": "無盡意法門；",
        "translation": "the inexhaustible mental dharma-gate;",
        "source": "T12n0387_003:1090b16_22"
    },
    {
        "source_sentence": "不可思議法門；",
        "translation": "Unfathomable Teaching:",
        "source": "T12n0387_003:1090b16_23"
    },
    {
        "source_sentence": "無礙法門；",
        "translation": "Unobstructed Teaching:",
        "source": "T12n0387_003:1090b17_24"
    },
    {
        "source_sentence": "甚深法門；",
        "translation": "profound dharma-gate;",
        "source": "T12n0387_003:1090b17_25"
    },
    {
        "source_sentence": "質直法門；",
        "translation": "the doctrine-gate of straightforwardness in quality;",
        "source": "T12n0387_003:1090b17_26"
    },
    {
        "source_sentence": "虛空相法門。",
        "translation": "The dharma-gate of the characteristics of space.",
        "source": "T12n0387_003:1090b17_27"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090b18_28"
    },
    {
        "source_sentence": "是名十種法門。」",
        "translation": "These are called the ten kinds of dharmas.",
        "source": "T12n0387_003:1090b18_29"
    },
    {
        "source_sentence": "時，大眾中有一天女，名妙族姓，持諸香、華、幡蓋、伎樂以供養佛，",
        "translation": "At that time, there was a goddess in the great assembly named Marvelous Clan who offered perfumes, flowers, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1090b18_30"
    },
    {
        "source_sentence": "「如來深密藏，　　眾生所不解，",
        "translation": "The profound and mysterious treasury of the enlightened is not understood by sentient beings.",
        "source": "T12n0387_003:1090b20_31"
    },
    {
        "source_sentence": "　唯願為一切，　　分別令淺易。」",
        "translation": "May it only be for all of them, so that they are discriminated and made shallow.",
        "source": "T12n0387_003:1090b20_31"
    },
    {
        "source_sentence": "即說讚曰：大雲初分電光轉健度第十二爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, At the twelfth moment, the great cloud of mysterious treasury bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1090b20_31"
    },
    {
        "source_sentence": "有十種大雲電光法門，唯願如來，廣分別說。」",
        "translation": "There are ten kinds of great clouds and lightning dharma-gates, so may the Tathāgata explain them in detail.",
        "source": "T12n0387_003:1090b24_32"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1090b25_33"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090b26_34"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1090b26_35"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1090b26_36"
    },
    {
        "source_sentence": "有六通法門、功德法門、寶光法門、虛空精進法門、藏法門、戒調法門、功德藏法門、斷疑法門、琉璃意法門、清淨法門、功德甚深大海法門、壞一切結法門、金垢法門(梵本長三)。",
        "translation": "There are the six supernormal dharma-gates, the dharma-gate of merit, the dharma-gate of jeweled light, the dharma-gate of space and effort, the dharma-gate of store consciousness, the dharma-gate of morality, the dharma-gate of the store of merit, the dharma-gate of ending doubt, the dharma-gate of",
        "source": "T12n0387_003:1090b27_37"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090c01_38"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1090c02_39"
    },
    {
        "source_sentence": "時，大眾中有一天女，名曰善喜，持諸花、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, a goddess named Sudarśana in the great assembly offered flowers, perfumes, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1090c02_40"
    },
    {
        "source_sentence": "「如來大醫王！　　無身方便身，",
        "translation": "“O Great Healing King, the Tathāgata!",
        "source": "T12n0387_003:1090c03_41"
    },
    {
        "source_sentence": "　無礙如虛空，　　廣說大雲經。」",
        "translation": "Unobstructed like space, he explains the great cloud scripture in detail.",
        "source": "T12n0387_003:1090c03_41"
    },
    {
        "source_sentence": "而讚歎曰：大雲初分電轉健度第十三爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He praised them, saying, At the thirteenth time, the first part of the great cloud is transformed by a lightning flash.",
        "source": "T12n0387_003:1090c03_41"
    },
    {
        "source_sentence": "有十種寶電行法門，唯願如來，廣開分別。」",
        "translation": "There are ten kinds of precious lightning-powered practice dharmas, so may the Tathāgata reveal them in detail and discern them.",
        "source": "T12n0387_003:1090c08_42"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1090c09_43"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090c10_0"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1090c10_1"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1090c10_2"
    },
    {
        "source_sentence": "有電光寶王法門、利智慧法門、智慧能壞法門、初智法門、智海法門、法疑法門、吉祥法門、法鼓法門、須彌山法門、能壞闇法門、風等行法門(梵本長一)。",
        "translation": "There's the Dharma aspect of the jewel king of lightning, the Dharma aspect of sharp wisdom, the Dharma aspect of wisdom that destroys wisdom, the Dharma aspect of the first knowledge, the Dharma aspect of the ocean of knowledge, the Dharma aspect of doubting the Dharma, the Dharma aspect of auspiciousness, the Dharma aspect of the Dharma drum, the Dharma aspect of Mount Sumeru, the Dharma aspect of",
        "source": "T12n0387_003:1090c11_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090c14_4"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1090c14_5"
    },
    {
        "source_sentence": "爾時，眾中有一天女，名恒河神，持諸香、華、幡蓋、伎樂以供養佛，",
        "translation": "At the time, there was a goddess named Ganges River Goddess in the assembly who offered incense, flowers, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1090c14_6"
    },
    {
        "source_sentence": "「無畏、無我心，　　無貪愍眾生；",
        "translation": "Their fearlessness, their minds free of self, They have no craving or hatred for sentient beings.",
        "source": "T12n0387_003:1090c16_7"
    },
    {
        "source_sentence": "　以大方便故，　　而為一切世。",
        "translation": "Because of their great skillful means They become the leaders of all beings.",
        "source": "T12n0387_003:1090c16_7"
    },
    {
        "source_sentence": "　如來功德力，　　故令我得知，",
        "translation": "Because of the power of the Buddha’s virtue, I am told to know.",
        "source": "T12n0387_003:1090c16_7"
    },
    {
        "source_sentence": "　無上、無邊身，　　不可得思議。",
        "translation": "The unexcelled, boundless body Is Inconceivable.",
        "source": "T12n0387_003:1090c16_7"
    },
    {
        "source_sentence": "　我聞是經已，　　永斷諸煩惱！」",
        "translation": "After hearing this sūtra, I'll permanently end the afflictions!",
        "source": "T12n0387_003:1090c16_7"
    },
    {
        "source_sentence": "而讚嘆曰：大雲初分神通健度第十四爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He praised them, saying, The first part of the great cloud's miraculous abilities are powerful and liberating. At that point, the great cloud esoteric store bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1090c16_7"
    },
    {
        "source_sentence": "有十種大雲電光幻法門，惟願如來，廣分別說。」",
        "translation": "There are ten kinds of great clouds, lightning, and illusory dharma-gates, so may the Tathāgata explain them in detail.",
        "source": "T12n0387_003:1090c23_8"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1090c24_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090c25_10"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1090c25_11"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1090c25_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090c26_13"
    },
    {
        "source_sentence": "有調幻法門、調藏法門、樂法法門、求法法門、燒結法門、生一切法法門、斷諸諍訟法門、能消煩惱法門、上高法門、念無盡法門、度一切眾生法門(梵本長一)。",
        "translation": "There's the method of taming illusory dharmas, the method of taming store dharmas, the method of delighting in dharmas, the method of seeking dharmas, the method of burning fetters, the method of producing all dharmas, the method of ending disputes, the method of being able to eliminate afflictions, the method of superiority, the",
        "source": "T12n0387_003:1090c26_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1090c29_15"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1090c29_16"
    },
    {
        "source_sentence": "時，大眾中有一天女，名曰大喜，持諸華、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, a goddess named Mahāprajāpatīṇa in the great assembly offered flowers, fragrances, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1091a01_17"
    },
    {
        "source_sentence": "「如來大神通！　　其身無動轉，",
        "translation": "“World-honored One, the Tathāgata’s great supernormal power is that his body moves without moving:",
        "source": "T12n0387_003:1091a02_18"
    },
    {
        "source_sentence": "　為眾斷生死，　　故說《大雲經》。」",
        "translation": "To stop birth and death for the sake of sentient beings, he explains the Mahāprajñāpāramitā-sūtra.",
        "source": "T12n0387_003:1091a02_18"
    },
    {
        "source_sentence": "以偈讚曰：大雲初分寶雹健度第十五爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He praised them in verse, saying, At the fifteenth time, the first part of the great cloud is a hailstorm of jewels.",
        "source": "T12n0387_003:1091a02_18"
    },
    {
        "source_sentence": "有十種大神通法門，惟願如來，分別解說。」",
        "translation": "There are ten kinds of great miraculous teachings, so may the Tathāgata explain them separately.",
        "source": "T12n0387_003:1091a06_19"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1091a07_20"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091a08_0"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1091a08_1"
    },
    {
        "source_sentence": "善思念之，今當為汝分別解說。",
        "translation": "Think of it well, and I will now explain it for you in a discriminating way.",
        "source": "T12n0387_003:1091a08_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091a09_3"
    },
    {
        "source_sentence": "有寶雹法門、雹等法門、雹莊嚴王法門、雹燈法門、雹藥法門、雹同法門、雹無盡意法門、雹上上法門、雹上容法門、雹甚深法門。",
        "translation": "There's the precious hail dharma-gate, the hail dharma-gate, the hail dharma-gate, the hail dharma-gate, the hail adornment king dharma-gate, the hail lamp dharma-gate, the hail medicine dharma-gate, the haillike dharma-gate, the hail inexhaustible dharma-",
        "source": "T12n0387_003:1091a09_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091a12_5"
    },
    {
        "source_sentence": "是名十種法門。」",
        "translation": "These are called the ten kinds of dharmas.",
        "source": "T12n0387_003:1091a12_6"
    },
    {
        "source_sentence": "爾時，眾中有一天女，名曰嚴飾自喜，持諸香、華、幡蓋、伎樂以供養佛，",
        "translation": "At that time, there was a celestial maiden in the assembly named Array of Self-delight. She offered incense, flowers, banners, canopies, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1091a12_7"
    },
    {
        "source_sentence": "「世尊大雹王，　　天中天滿雨；",
        "translation": "“O Bhagavat! Great hailstorm king, The heavens in the heavens are full of rain.",
        "source": "T12n0387_003:1091a14_8"
    },
    {
        "source_sentence": "　知諸煩惱業，　　而能永斷之。",
        "translation": "Knowing the deeds of afflictions, They are able to eliminate them forever.",
        "source": "T12n0387_003:1091a14_8"
    },
    {
        "source_sentence": "　凡夫結無邊，　　輪轉受生死；",
        "translation": "Ordinary people’s fetters are boundless; They undergo birth and death in transmigration.",
        "source": "T12n0387_003:1091a14_8"
    },
    {
        "source_sentence": "　菩薩無煩惱，　　故不至諸趣。」",
        "translation": "A bodhisattva has no afflictions, so he doesn't go to the destinies.",
        "source": "T12n0387_003:1091a14_8"
    },
    {
        "source_sentence": "即說讚曰：大雲初分金剛智健度第十六爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke a verse of praise, saying, The first part of the great cloud is the sixteenth chapter of the adamantine wisdom of Vajra.",
        "source": "T12n0387_003:1091a14_8"
    },
    {
        "source_sentence": "有十智金剛行入智法門，惟願如來，廣分別說。」",
        "translation": "There are ten kinds of wisdom, the adamantine practice of entering the Dharma gate of knowledge, and may the Tathāgata explain them extensively and distinctly.",
        "source": "T12n0387_003:1091a20_9"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1091a21_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091a22_11"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1091a22_12"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1091a22_13"
    },
    {
        "source_sentence": "有神通寶聚法門、喜王法門、神通平等法門、白鵝聲法門、虛空無礙法門、藥王法門、法幢法門、甚深大海法門、不動法門、無邊光法門、不可思議法門、無量劫法門(梵本長二)。",
        "translation": "There's the Dharma teaching of the cluster of supernormal abilities, the Dharma teaching of the king of joy, the Dharma teaching of the equality of supernormal abilities, the Dharma teaching of the white goose sound, the Dharma teaching of space without obstruction, the Dharma teaching of the medicine king, the Dharma teaching of the Dharma banner, the Dharma teaching of the profound ocean, the Dharma teaching of im",
        "source": "T12n0387_003:1091a23_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091a27_15"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1091a27_16"
    },
    {
        "source_sentence": "時，大眾中有一天女，名深智愛，持諸香、華、幡蓋、伎樂以供養佛，",
        "translation": "In the assembly, there was a goddess named Deeply Wise Love who offered incense, flowers, banners, canopies, and music as an offering to the Buddha.",
        "source": "T12n0387_003:1091a27_17"
    },
    {
        "source_sentence": "「如來無上王！　　無生亦無滅，",
        "translation": "“The supreme king, the Enlightened One, has neither arising nor ceasing.",
        "source": "T12n0387_003:1091a29_0"
    },
    {
        "source_sentence": "　為諸眾生故，　　示現於生滅。",
        "translation": "For the sake of sentient beings, they show birth and cessation.",
        "source": "T12n0387_003:1091a29_0"
    },
    {
        "source_sentence": "　真實常不變，　　為眾說無我，",
        "translation": "True reality is eternal and unchanging, Explaining selflessness for the sake of all.",
        "source": "T12n0387_003:1091a29_0"
    },
    {
        "source_sentence": "　其身如金剛，　　不可得沮壞。」",
        "translation": "His body is like a vajra, which can't be broken.",
        "source": "T12n0387_003:1091a29_0"
    },
    {
        "source_sentence": "即說讚曰：大雲初分無盡健度第十七爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, The first part of the great cloud is inexhaustible and robust, number 17. At that point, the great cloud-mysterious store bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1091a29_0"
    },
    {
        "source_sentence": "有十無盡意入神通法門，惟願如來，廣分別說。」",
        "translation": "There are ten inexhaustible intentions to enter the Dharma teaching of supernormal powers, so may the Tathāgata explain them extensively and distinctly.",
        "source": "T12n0387_003:1091b06_1"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1091b07_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091b08_3"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1091b08_4"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1091b08_5"
    },
    {
        "source_sentence": "有甘露意入法門、安寶法門、樂法門、喜法門、甚深精進法門、意行法門、無盡樂法門、常喜樂法門。",
        "translation": "There's the dharma-gate of the ambrosia of mind-entry, the Dharma-gate of peace and treasure, the Dharma-gate of bliss, the Dharma-gate of joy, the Dharma-gate of joy, the Dharma-gate of profound effort, the Dharma-gate of mental functioning, the Dharma-gate of inexhaustible bliss, and the Dharma-",
        "source": "T12n0387_003:1091b09_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091b11_7"
    },
    {
        "source_sentence": "是名十法門(梵本少二)。」",
        "translation": "These are called the ten teachings of the Dharma (less than two in the Sanskrit text).",
        "source": "T12n0387_003:1091b11_8"
    },
    {
        "source_sentence": "爾時，眾中有一天女，名大寶輪，持諸香、華、幡蓋、伎樂以供養佛，",
        "translation": "At that time, there was a goddess in the assembly named Mahāprajāpatīṃśavartin, who offered perfumes, flowers, banners, canopies, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1091b11_9"
    },
    {
        "source_sentence": "「如來無貧富，　　其身無觸礙，",
        "translation": "The Tathāgata is neither rich nor poor, His body unobstructed by touch.",
        "source": "T12n0387_003:1091b13_10"
    },
    {
        "source_sentence": "　憐愍一切故，　　樂說《大乘經》。」",
        "translation": "Because of pity for all, they're happy to teach the great vehicle sūtras.",
        "source": "T12n0387_003:1091b13_10"
    },
    {
        "source_sentence": "即說讚曰：大雲初分正行健度第十八爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, At that point, the great cloud of mysterious treasury bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1091b13_10"
    },
    {
        "source_sentence": "有十正道法門，惟願如來，廣分別說。」",
        "translation": "There are ten teachings of the right path, so may the Tathāgata explain them in detail.",
        "source": "T12n0387_003:1091b17_11"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1091b18_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091b18_13"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1091b19_14"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別宣說。",
        "translation": "Consider it well and I will explain it for you in detail.",
        "source": "T12n0387_003:1091b19_15"
    },
    {
        "source_sentence": "有深廣行法門、健行法門、現力法門、健勝法門、一切天人法門、入一切時法門、不染一切時法門、一切道喜法門、斷一切惡道法門、大海常潮法門、大海神通法門(梵本長一)。",
        "translation": "There's the profound and extensive practice dharma-gate, the healthy practice dharma-gate, the manifest power dharma-gate, the healthy and superior dharma-gate, the Dharma-gate of all gods and humans, the Dharma-gate of entering all times, the Dharma-gate of not being stained by all times, the Dharma-gate of joy in all paths, the",
        "source": "T12n0387_003:1091b20_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091b23_1"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1091b24_0"
    },
    {
        "source_sentence": "爾時，眾中有一天女，名曰善得，持諸香、華、幡蓋、伎樂以供養佛，",
        "translation": "At that time a goddess named Sudarśana in the assembly offered perfumes, flowers, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1091b24_1"
    },
    {
        "source_sentence": "「如來無上尊，　　修集於正道，",
        "translation": "The Tathāgata, the supreme honored one, Cultivates and accumulates the right path.",
        "source": "T12n0387_003:1091b25_2"
    },
    {
        "source_sentence": "　雖成堅固藏，　　其心初無悋，",
        "translation": "Even though they form a sturdy store, Their minds have no anger at first.",
        "source": "T12n0387_003:1091b25_2"
    },
    {
        "source_sentence": "　慈愍於眾生，　　及為我等故，",
        "translation": "They are compassionate toward sentient beings And for us.",
        "source": "T12n0387_003:1091b25_2"
    },
    {
        "source_sentence": "　今於此寶座，　　宣說如是經。」",
        "translation": "Now, on this jeweled seat, I'll expound such a sūtra.",
        "source": "T12n0387_003:1091b25_2"
    },
    {
        "source_sentence": "即說讚曰：大雲初分師子吼健度第十九爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, At that point, the great cloud of mysterious store bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1091b25_2"
    },
    {
        "source_sentence": "有十種甚深師子吼行法門，惟願如來，分別解說。」",
        "translation": "There are ten profound ways to practice the lion's roar, so may the Tathāgata explain it separately.",
        "source": "T12n0387_003:1091c02_3"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1091c03_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091c04_5"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1091c04_6"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1091c04_7"
    },
    {
        "source_sentence": "有一切味吼法門、一切味喜法門、時神通王法門、蓮華法門、喜地法門、大喜地法門、四威儀法門、聖行法門、淨法門、一切法體法門。",
        "translation": "There's the Dharma teaching of all flavors and roars, the Dharma teaching of all flavors and joys, the Dharma teaching of the king of timely supernormal powers, the Dharma teaching of the lotus flower, the Dharma teaching of the joy ground, the Dharma teaching of the great joy ground, the Dharma teaching of the four comportments, the Dharma teaching of noble actions, the pure Dharma",
        "source": "T12n0387_003:1091c05_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091c08_9"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1091c08_10"
    },
    {
        "source_sentence": "時，大眾中有一天女，名微妙聲，持諸香、華、幡蓋、伎樂以供養佛，",
        "translation": "In the assembly, there was a goddess named Sublime Sound who offered incense, flowers, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1091c08_11"
    },
    {
        "source_sentence": "「無上智微妙，　　猶如大海水，",
        "translation": "The subtlety of the supreme knowledge is as great as the ocean water",
        "source": "T12n0387_003:1091c10_12"
    },
    {
        "source_sentence": "　其力難思議，　　故能師子吼；",
        "translation": "Because their power is inconceivable They can make the lion’s roar.",
        "source": "T12n0387_003:1091c10_12"
    },
    {
        "source_sentence": "　為諸眾生故，　　生於憐愍心，",
        "translation": "For the sake of sentient beings, they give rise to compassion.",
        "source": "T12n0387_003:1091c10_12"
    },
    {
        "source_sentence": "　今說方等經，　　其意無所畏。」",
        "translation": "Now, when he teaches the vaipulya sūtras, his mind has no fear.",
        "source": "T12n0387_003:1091c10_12"
    },
    {
        "source_sentence": "而說讚曰：大雲初分師子吼神通健度第二十爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He spoke in praise, saying, The first part of the great cloud is the twentieth of the lion's roar of supernormal strength. At that point, the great cloud esoteric store bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1091c10_12"
    },
    {
        "source_sentence": "有十師子吼神通法門，惟願如來，分別解說。」",
        "translation": "There are ten lion's roar of the Dharma teaching of supernormal abilities, so may the Tathāgata explain it clearly and distinctly.",
        "source": "T12n0387_003:1091c16_13"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1091c17_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091c18_15"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1091c18_16"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1091c18_17"
    },
    {
        "source_sentence": "有光法門、法蜂法門、法鼓法門、法寶法門、法藏法門、法力法門、法動法門、三匝法門、大地法門、難近法門、一切纓絡法門(梵本長一)。",
        "translation": "There's the Dharma aspect of light, the Dharma aspect of the Dharma bee, the Dharma aspect of the Dharma drum, the Dharma aspect of the Dharma treasure, the Dharma aspect of the Dharma store, the Dharma aspect of the Dharma power, the Dharma aspect of the Dharma movement, the Dharma aspect of the three turns, the Dharma aspect of the great ground, the Dharma aspect of difficulty to approach, and all the",
        "source": "T12n0387_003:1091c19_18"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1091c22_19"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1091c22_20"
    },
    {
        "source_sentence": "時，大眾中有一天子，名師子吼，持諸香、華、幡蓋、伎樂以供養佛，",
        "translation": "At that time, a celestial being in the great assembly named Siṃhala called “lion’s roar” offered incense, flowers, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1091c22_21"
    },
    {
        "source_sentence": "「如來無因喻，　　無勝、無有邊，",
        "translation": "“The Tathāgata has no cause and no metaphor, No superiority or limit.",
        "source": "T12n0387_003:1091c23_22"
    },
    {
        "source_sentence": "　為諸眾生故，　　方便師子吼。」",
        "translation": "For the sake of sentient beings, he skillfully rouses the lion's roar.",
        "source": "T12n0387_003:1091c23_22"
    },
    {
        "source_sentence": "而說讚曰：大雲初分善方便健度第二十一爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He spoke in praise, saying, The Twenty-first Part of the Mahāmaudgalyāyana: At that point, the Mahāmaudgalyāyana said, Bhagavān!",
        "source": "T12n0387_003:1091c23_22"
    },
    {
        "source_sentence": "有十入世間方便法門，惟願如來，廣分別說。」",
        "translation": "There are ten ways to enter the worldly path of skillful means, so may the Tathāgata explain them in detail.",
        "source": "T12n0387_003:1091c28_23"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1091c29_24"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092a01_25"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1092a01_26"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1092a01_27"
    },
    {
        "source_sentence": "有生王入法門、畢竟多方便入法門、信心入法門、師子神通法門、世界非世界法門、時一入法門善不善法門、能調惡人法門；",
        "translation": "“Great enlightening beings have ten kinds of entry: the entry of knowledge that produces kings of sentient beings; the entry of knowledge that ultimately has many skillful means; the entry of knowledge by faith; the entry of knowledge of lion’s supernormal powers; the entry of knowledge of worlds and not worlds; the entry of knowledge of all times; the entry of",
        "source": "T12n0387_003:1092a02_28"
    },
    {
        "source_sentence": "有德王入法門、得一切恭敬法門、下業行法門(梵本長一)。",
        "translation": "A virtuous king enters the Dharma teaching, attains all respectful Dharma teachings, and follows the Dharma teaching of actions (Sanskrit text long one).",
        "source": "T12n0387_003:1092a05_29"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092a06_30"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1092a06_31"
    },
    {
        "source_sentence": "是時，眾中有一天子，名婆羅呵迦，持諸華、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, there was a celestial being in the assembly named Vārāṇasī who offered flowers, perfumes, banners, canopies, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1092a06_32"
    },
    {
        "source_sentence": "「如來方便入涅槃，　　其身不動亦不滅，",
        "translation": "The Tathāgata enters nirvana skillfully, Yet his body doesn’t move or perish.",
        "source": "T12n0387_003:1092a08_33"
    },
    {
        "source_sentence": "　所入禪定難思議，　　眾生不解謂永滅。」",
        "translation": "The meditation that's entered is inconceivable, and sentient beings who don't understand it say it's permanently extinguished.",
        "source": "T12n0387_003:1092a08_33"
    },
    {
        "source_sentence": "而說讚曰：大雲初分神通健度第二十二爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He spoke in praise, saying, The first part of the great cloud's miraculous power is so powerful that it reaches 22nd At that point, the great cloud esoteric store bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1092a08_33"
    },
    {
        "source_sentence": "有十神通寶藏入法門，惟願如來，分別解說。」",
        "translation": "There are ten treasures of supernormal powers that enter the Dharma teaching, so may the Tathāgata explain them separately.",
        "source": "T12n0387_003:1092a12_34"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1092a13_35"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092a14_36"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1092a14_37"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1092a14_38"
    },
    {
        "source_sentence": "有法周羅法門、大神通法門、寶香藏法門、師子吼入聚法門、破法相法門、栴檀涼法門、無相法門、無語法門、蓮華法門、稱法門。",
        "translation": "There's the Dharma-gate of the Zhou dharma-gate, the Dharma-gate of great supernormal powers, the Dharma-gate of the jeweled fragrant storehouse, the Dharma-gate of the lion's roar entering cluster, the Dharma-gate of refuting the characteristics of the Dharma, the Dharma-gate of sandalwood cooling, the Dharma-gate",
        "source": "T12n0387_003:1092a15_39"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092a18_40"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1092a18_41"
    },
    {
        "source_sentence": "是時，眾中有一天子，名增長有德，持諸華、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, the celestial beings in the assembly, called “growth of virtue,” offered flowers, fragrances, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1092a18_42"
    },
    {
        "source_sentence": "「三千大千界，　　佛於法自在，",
        "translation": "In the universe consisting of a thousand great one-thousand worlds, The Buddha has mastery over all teachings.",
        "source": "T12n0387_003:1092a20_0"
    },
    {
        "source_sentence": "　法身不可見，　　為眾現相好。」",
        "translation": "The Dharma body can't be seen, but its appearance is good for the sake of all people.",
        "source": "T12n0387_003:1092a20_0"
    },
    {
        "source_sentence": "即說讚曰：大雲初分金翅鳥健度第二十三爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, The first part of the great cloud is the Twenty-third Chapter of the Golden-winged鳥健度爾時,大雲密藏菩薩言:「世尊!",
        "source": "T12n0387_003:1092a20_0"
    },
    {
        "source_sentence": "有十金翅鳥神通所入法門，惟願如來，分別解說。」",
        "translation": "There are ten golden-winged birds with supernormal powers that enter the Dharma teaching, so may the Tathāgata explain it clearly and distinctly.",
        "source": "T12n0387_003:1092a24_1"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1092a25_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092a26_3"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1092a26_4"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別宣示。",
        "translation": "Consider it well and I will explain it for you.",
        "source": "T12n0387_003:1092a26_5"
    },
    {
        "source_sentence": "有能壞婆修吉龍王力神通王法門、自在力入法門、喜入法門、開勇入法門、大海時入法門、能壞大山法門、能壞風力法門、長見法門、能壞一切毒法門、得寶[口*(隹\\/乃)]法門。",
        "translation": "There's the Dharma teaching that destroys the supernormal power of the dragon king Vasiṣṭha, the Dharma teaching that destroys the great mountain dharma-gate, the Dharma teaching that destroys the wind dharma-gate, the long view dharma-gate, the Dharma teaching that destroys all poisonous dharmas, and the Dharma teaching that obtains the jeweled [mouth*(",
        "source": "T12n0387_003:1092a27_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092b01_7"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1092b02_8"
    },
    {
        "source_sentence": "是時，眾中有一天子，名深淨行，持諸華、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, a celestial being in the assembly named Deeply Pure Actions offered flowers, perfumes, banners, canopies, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1092b02_9"
    },
    {
        "source_sentence": "「如來大法王，　　慧眼喻千日，",
        "translation": "The Tathāgata, the great king of the Dharma, Is likened by the eye of wisdom to a thousand suns.",
        "source": "T12n0387_003:1092b03_10"
    },
    {
        "source_sentence": "　定根金剛手，　　能壞諸煩惱。」",
        "translation": "The Vajrapāṇi of the faculty of concentration can destroy afflictions.",
        "source": "T12n0387_003:1092b03_10"
    },
    {
        "source_sentence": "即說讚曰：大雲初分大捨健度第二十四爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, The first part of the great cloud is the twenty-fourth major equanimity of Mahāprajñāpāramitā At that point, the great cloud esoteric bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1092b03_10"
    },
    {
        "source_sentence": "有十大捨時微妙神通王法門，惟願如來，分別解說。」",
        "translation": "There are ten great ways to abandon the subtle teachings of the king of supernormal powers at the time, so may the Tathāgata explain them separately.",
        "source": "T12n0387_003:1092b07_11"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1092b08_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092b09_13"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1092b09_14"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1092b09_15"
    },
    {
        "source_sentence": "有無礙力甚深法門、戒住法門、戒廣王法門、戒界王法門、寶乳流法門、功德流微妙法門、慈力流法門、忍辱流法門、喜力流法門、捨力流法門。",
        "translation": "There's the profound dharma-gate of unobstructed power, the dharma-gate of abiding in morality, the dharma-gate of extensive kingship of precepts, the dharma-gate of kingship of the precepts, the dharma-gate of jeweled milk, the subtle dharma-gate of the flow of merit, the dharma-",
        "source": "T12n0387_003:1092b10_16"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092b13_17"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1092b13_18"
    },
    {
        "source_sentence": "是時，眾中有一天子，名寶貴德，持諸花、香、幡幢、伎樂以供養佛，",
        "translation": "At that time, there was a celestial being in the assembly named Jewel Precious Virtue, who offered flowers, perfumes, banners, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1092b14_0"
    },
    {
        "source_sentence": "「禮佛無量力，　　常住不壞身，",
        "translation": "Homage to the Buddha’s immeasurable power, Who always abides in an indestructible body.",
        "source": "T12n0387_003:1092b15_1"
    },
    {
        "source_sentence": "　為諸眾生故，　　說種種法界。」",
        "translation": "For the sake of sentient beings, he explains the various Dharma realms.",
        "source": "T12n0387_003:1092b15_1"
    },
    {
        "source_sentence": "即說讚曰：大雲初分無畏健度第二十五爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, The first part of the great cloud is fearless and vigorous, number twenty-five. At that point, the great cloud esoteric store bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1092b15_1"
    },
    {
        "source_sentence": "有十無所畏大力神通所入法門，惟願如來，分別解說。」",
        "translation": "There are ten fearless, powerful, and spiritually enlightened teachings that the Tathāgata enters into, so may the Tathāgata explain them separately.",
        "source": "T12n0387_003:1092b19_2"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1092b20_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092b21_4"
    },
    {
        "source_sentence": "諦聽諦聽。",
        "translation": "Listen closely and listen closely.",
        "source": "T12n0387_003:1092b21_5"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1092b21_6"
    },
    {
        "source_sentence": "有無所畏力神通法門、不悕樂根法門、寶聚法門、十有德法門、淨浣法門、淨光行法門、淨寶光法門、喜入法門、淨等法門、電光法門。",
        "translation": "There are the Dharma teaching of fearlessness, the Dharma teaching of supernormal powers, the Dharma teaching of the faculty of not hating pleasure, the Dharma teaching of the jewel cluster, the Dharma teaching of the ten virtues, the Dharma teaching of pure washing, the Dharma teaching of pure luminous action, the Dharma teaching of pure luminous light, the Dharma teaching of pure luminous light, the",
        "source": "T12n0387_003:1092b22_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092b25_8"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1092b25_9"
    },
    {
        "source_sentence": "是時，眾中有一天子，名寶彗星，持諸華、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time a celestial being in the assembly, named Jeweled Comet, offered flowers, perfumes, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1092b25_10"
    },
    {
        "source_sentence": "「如來祕密藏，　　甚深如大海，",
        "translation": "The secret treasury of the Buddha Is as deep as the great ocean.",
        "source": "T12n0387_003:1092b27_11"
    },
    {
        "source_sentence": "　為諸眾生故，　　淨行於法界。」",
        "translation": "For the sake of sentient beings, he purely practices in the Dharma realm.",
        "source": "T12n0387_003:1092b27_11"
    },
    {
        "source_sentence": "即說讚曰：大雲初分入行健度第二十六爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, The first part of the great cloud enters into the twenty-sixth practice of strength. At that point, the great cloud esoteric store bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1092b27_11"
    },
    {
        "source_sentence": "有十入行法門，惟願如來，分別解說。」",
        "translation": "There are ten ways to enter into the practice of the Dharma, so may the Tathāgata explain them separately.",
        "source": "T12n0387_003:1092c02_12"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1092c03_13"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092c03_14"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1092c04_15"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1092c04_16"
    },
    {
        "source_sentence": "有入藏法門、正行法門、正實法門、吉稱法門、稱法門、常喜法門、日鬚法門、悲力法門、忍辱法門、常淨法門。",
        "translation": "There's the method of entering the store, the method of correct practice, the method of correct reality, the method of good fortune, the method of fame, the method of permanence, the method of joy, the method of sunbeard, the method of compassion, the method of patience, and the method of permanence and purity.",
        "source": "T12n0387_003:1092c05_17"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092c07_18"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1092c07_19"
    },
    {
        "source_sentence": "是時，眾中有一天子，名寶正光，持諸華、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, a celestial being in the assembly named Jeweled Correct Light offered flowers, perfumes, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1092c07_20"
    },
    {
        "source_sentence": "「如來智慧海，　　甚深難可測，",
        "translation": "“The ocean of wisdom of the Buddha Is so deep and difficult to fathom.",
        "source": "T12n0387_003:1092c09_21"
    },
    {
        "source_sentence": "　普為眾生故，　　今說《大雲經》。」",
        "translation": "For the sake of all sentient beings, I'll now explain the Mahāprajñāpāramitā-sūtra.",
        "source": "T12n0387_003:1092c09_21"
    },
    {
        "source_sentence": "即說偈讚曰：大雲初分至心健度第二十七爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke a verse in praise, saying, At that point, the great cloud of mysterious store bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1092c09_21"
    },
    {
        "source_sentence": "有十種至心所入法門，惟願如來，分別解說。」",
        "translation": "There are ten kinds of mentally entered dharmas, so may the Tathāgata explain them separately.",
        "source": "T12n0387_003:1092c13_22"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1092c14_23"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092c15_24"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1092c15_25"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1092c15_26"
    },
    {
        "source_sentence": "有住善界法門、大海智法門、智潮法門、神通行法門、虛空神通法門、無熱法門、初成法門、隨行法門、施喜法門、善至心法門。",
        "translation": "There's the Dharma teaching of abiding in the good realm, the Dharma teaching of oceanic wisdom, the Dharma teaching of the tide of knowledge, the Dharma teaching of supernormal abilities, the Dharma teaching of space and supernormal abilities, the Dharma teaching of heatlessness, the Dharma teaching of first becoming, the Dharma teaching of following practice, the Dharma teaching of generosity and joy, and the Dharma",
        "source": "T12n0387_003:1092c16_27"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092c18_28"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1092c19_29"
    },
    {
        "source_sentence": "是時，眾中有一天子，名波頭摩智，持諸華、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, a celestial being in the assembly named Padmasaṃjīva offered flowers, fragrances, banners, canopies, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1092c19_30"
    },
    {
        "source_sentence": "「如來無見頂，　　無勝無有上；",
        "translation": "The Enlightened One has no peak of insight, No superiority or inferiority.",
        "source": "T12n0387_003:1092c20_31"
    },
    {
        "source_sentence": "　今放大光明，　　廣為諸眾生。」",
        "translation": "Now, he emanates a great ray of light that's vast for all sentient beings.",
        "source": "T12n0387_003:1092c20_31"
    },
    {
        "source_sentence": "即說讚曰：大雲初分勇力健度第二十八爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, At the beginning, Mahāmaudgalyāyana said, Bhagavān!",
        "source": "T12n0387_003:1092c20_31"
    },
    {
        "source_sentence": "有十勇王大力微妙法門，惟願如來，分別解說。」",
        "translation": "There are ten heroic kings who have great power and subtle dharmas, so may the Tathāgata explain them separately.",
        "source": "T12n0387_003:1092c25_32"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1092c26_33"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1092c27_34"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1092c27_35"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別宣說。",
        "translation": "Consider it well and I will explain it for you in detail.",
        "source": "T12n0387_003:1092c27_36"
    },
    {
        "source_sentence": "有健勝田行法門、首楞嚴法門、勇健神通法門、健力法門、健歸法門、眾生具足法門、智堅健行法門、壞嬾墮法門、廣力法門、健調光法門、健意法門(梵本長一)。",
        "translation": "There are the Dharma teaching of the practice of resolute fields, the Dharma teaching of Śūraṃgama, the Dharma teaching of courageous supernormal powers, the Dharma teaching of strength, the Dharma teaching of returning to strength, the Dharma teaching of endowment by sentient beings, the Dharma teaching of resolute practice by wisdom, the Dharma teaching of falling into disintegration, the Dharma teaching of",
        "source": "T12n0387_003:1092c28_37"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093a02_38"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1093a02_39"
    },
    {
        "source_sentence": "是時，眾中有一天子，名曰勇武，持諸花、香、幡幢、伎樂以供養佛，",
        "translation": "At that time, there was a celestial being in the assembly called Yongwu, who offered flowers, perfumes, banners, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1093a03_40"
    },
    {
        "source_sentence": "「眷屬不可壞，　　猶如金剛寶，",
        "translation": "Their retinues are indestructible, Just like the diamond treasure.",
        "source": "T12n0387_003:1093a04_41"
    },
    {
        "source_sentence": "　摧伏魔官屬，　　為眾說是經。」",
        "translation": "To subdue the officials of Māra, he explains this sūtra for the sake of the crowd.",
        "source": "T12n0387_003:1093a04_41"
    },
    {
        "source_sentence": "即說讚曰：大雲初分善健度第二十九爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, At that point, the great cloud of mysterious treasury bodhisattva Mahāmaudgalyāyana said, Bhagavān!",
        "source": "T12n0387_003:1093a04_41"
    },
    {
        "source_sentence": "有十種善行大神通王所入法門，惟願如來，分別解說。」",
        "translation": "There are ten kinds of teachings entered by the great king of good practice and supernormal powers, so may the Tathāgata explain them separately.",
        "source": "T12n0387_003:1093a08_42"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1093a09_43"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093a10_44"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1093a10_45"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別說之。",
        "translation": "Consider it well and I will explain it to you in detail.",
        "source": "T12n0387_003:1093a10_46"
    },
    {
        "source_sentence": "有善寶調法門、善聚法門、善堂法門、善行法門、善意法門、善德法門、善淨法門、善調光法門、一切善行瓔珞法門(梵本少一)。",
        "translation": "There's the Dharma teaching of skillful tuning, the Dharma teaching of skillful clustering, the Dharma teaching of skillful halls, the Dharma teaching of skillful conduct, the Dharma teaching of skillful intentions, the Dharma teaching of skillful virtue, the Dharma teaching of skillful purity, the Dharma teaching of skillful regulation and illumination, and all the Dharma teachings of skillful practice",
        "source": "T12n0387_003:1093a11_47"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093a14_0"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1093a14_1"
    },
    {
        "source_sentence": "是時，眾中有一天女，名曰善護，持諸香、華、幡蓋、伎樂以供養佛，",
        "translation": "At that time, a goddess named Sunetra was there among the assembly. She offered incense, flowers, banners, canopies, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1093a14_2"
    },
    {
        "source_sentence": "「成就於善相，　　安坐善妙床，",
        "translation": "Accomplishing good appearances, they sit comfortably on a good and marvelous bed.",
        "source": "T12n0387_003:1093a15_3"
    },
    {
        "source_sentence": "　廣為諸眾生，　　敷演無上法。」",
        "translation": "He spreads out the unsurpassed teaching for all sentient beings.",
        "source": "T12n0387_003:1093a15_3"
    },
    {
        "source_sentence": "即說讚曰：大雲初分神通健度第三十爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, The first part of the great cloud's supernormal abilities are so strong that they reach the 30th At that point, the great cloud esoteric store bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1093a15_3"
    },
    {
        "source_sentence": "有十三神通藏得開示法門，惟願如來，分別解說。」",
        "translation": "There are 13 stores of supernormal powers that can reveal the teaching, so may the Tathāgata explain it clearly and distinctly.",
        "source": "T12n0387_003:1093a20_4"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1093a21_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093a22_6"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1093a22_7"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別宣示。",
        "translation": "Consider it well and I will explain it for you.",
        "source": "T12n0387_003:1093a22_8"
    },
    {
        "source_sentence": "有樂神通窟法門、喜神通窟法門、大喜神通窟法門、行神通窟法門、師子神通窟法門、等神通窟法門、示神通窟法門、悲神通窟法門、捨神通窟法門(梵本少四)。",
        "translation": "There's the Dharma aspect of the cave of the supernormal power of pleasure, the Dharma aspect of the cave of the supernormal power of joy, the Dharma aspect of the cave of the great supernormal power of joy, the Dharma aspect of the cave of the supernormal power of volition, the Dharma aspect of the cave of the supernormal power of lion, the Dharma aspect of the cave of equal supernormal power",
        "source": "T12n0387_003:1093a23_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093a26_10"
    },
    {
        "source_sentence": "是名十三法門。」",
        "translation": "These are called the 13 teachings of the Dharma.",
        "source": "T12n0387_003:1093a26_11"
    },
    {
        "source_sentence": "是時，眾中有一天女，名大海意，持諸華、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, there was a celestial maiden in the assembly named Oceanic Thought who offered flowers, perfumes, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1093a27_12"
    },
    {
        "source_sentence": "「菩提樹常住，　　弟子樂依止，",
        "translation": "The tree of enlightenment always abides, And the disciples delight in relying on it.",
        "source": "T12n0387_003:1093a28_13"
    },
    {
        "source_sentence": "　安根不動搖，　　故得生定牙，",
        "translation": "Because the roots of enlightenment are stable and unshakable, The tooth relic of concentration arises.",
        "source": "T12n0387_003:1093a28_13"
    },
    {
        "source_sentence": "　獲果常不變，　　是故稽首禮。」",
        "translation": "The fruit obtained is always unchanging; therefore, he pays homage by bowing his head.",
        "source": "T12n0387_003:1093a28_13"
    },
    {
        "source_sentence": "即說讚曰：大雲初分智健度第三十一爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, At that point, the great cloud of mysterious store bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1093a28_13"
    },
    {
        "source_sentence": "有十智初行法門，惟願如來，分別說之。」",
        "translation": "There's the first practice of the Dharma teaching of the ten kinds of cognition, so may the Tathāgata explain them separately.",
        "source": "T12n0387_003:1093b04_14"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1093b05_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093b05_16"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1093b06_17"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1093b06_18"
    },
    {
        "source_sentence": "有法增長法門、喜食法門、無盡意法門、貪神通法門、施舟法門、不樂世間法門、莊嚴地法門、莊嚴界法門、樂調法門、住時法門。",
        "translation": "There's the Dharma teaching of growth, the Dharma teaching of joyful eating, the Dharma teaching of inexhaustible mind, the Dharma teaching of craving supernormal abilities, the Dharma teaching of giving boats, the Dharma teaching of not delighting in the world, the Dharma teaching of adorning the earth, the Dharma teaching of adorning the realm, the Dharma teaching of enjoying discipline, and",
        "source": "T12n0387_003:1093b07_19"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093b09_20"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1093b10_21"
    },
    {
        "source_sentence": "是時，眾中有一天女，名須曼那華，持諸華、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, a goddess named Samantabhadra in the assembly offered flowers, fragrances, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1093b10_22"
    },
    {
        "source_sentence": "「如來戒無上，　　智慧無上上！",
        "translation": "The Tathāgata's precepts are unsurpassed, and his wisdom is unsurpassed!",
        "source": "T12n0387_003:1093b11_23"
    },
    {
        "source_sentence": "　憐愍眾生故，　　廣說《大雲經》。」",
        "translation": "Because of pity for sentient beings, he explains the Mahāprajñāpāramitā-sūtra in detail.",
        "source": "T12n0387_003:1093b11_23"
    },
    {
        "source_sentence": "即說讚曰：大雲初分智寶藏健度第三十二爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, The first part of the great cloud is the thirty-second chapter of the Tripiṭaka of the Jeweled Treasury of Knowledge.",
        "source": "T12n0387_003:1093b11_23"
    },
    {
        "source_sentence": "有十智寶藏法門，惟願如來，分別解說。」",
        "translation": "There's the Dharma teaching of the store of the ten kinds of wisdom, so may the Tathāgata explain it separately.",
        "source": "T12n0387_003:1093b16_24"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1093b17_25"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093b17_26"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1093b18_27"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別宣示。",
        "translation": "Consider it well and I will explain it for you.",
        "source": "T12n0387_003:1093b18_28"
    },
    {
        "source_sentence": "有善持寶藏法門、法持法門、恭敬法門、心持法門、調王法門、正精進法門、大海寶藏法門、樂吉法門、智果法門、大吉法門、成就功德法門、端正法門、持戒精進法門(梵本長三)。",
        "translation": "There's the method of maintaining the well-maintained treasure treasury, the method of maintaining the Dharma, the method of reverence, the method of mental maintenance, the method of taming kings, the method of correct effort, the method of the great jeweled treasure store, the method of happiness, the method of knowledge and fruit, the method of great fortune, the method of accomplish",
        "source": "T12n0387_003:1093b19_29"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093b22_30"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1093b23_0"
    },
    {
        "source_sentence": "是時，眾中有一天女，字蓮華鬘，持諸華、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, there was a celestial maiden named Padmavyūha among the goddesses in the assembly, holding flowers, perfumes, canopies, and music to offer to the Buddha.",
        "source": "T12n0387_003:1093b23_1"
    },
    {
        "source_sentence": "「如來大智海，　　我今至心禮，",
        "translation": "“Buddha, great ocean of knowledge, I now venerate you with sincerity.",
        "source": "T12n0387_003:1093b24_2"
    },
    {
        "source_sentence": "　深定祕密藏，　　大悲故宣說。",
        "translation": "The profound and mysterious store of concentration is taught because of great compassion.",
        "source": "T12n0387_003:1093b24_2"
    },
    {
        "source_sentence": "　如來既自獲，　　常樂我淨等，",
        "translation": "The Tathāgata has attained for himself permanence, bliss, self, purity, and so forth.",
        "source": "T12n0387_003:1093b24_2"
    },
    {
        "source_sentence": "　亦復令眾生，　　同己之所得。」",
        "translation": "It also causes sentient beings to share what they've gained.",
        "source": "T12n0387_003:1093b24_2"
    },
    {
        "source_sentence": "即說讚曰：大雲初分施健度第三十三爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, At that point, the great cloud of mysterious treasury bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1093b24_2"
    },
    {
        "source_sentence": "有十正知微妙寶藏法門，惟願如來，分別解說。」",
        "translation": "There are ten ways to correctly know the subtle treasure-store dharma-gate of the Dharma, so may the Tathāgata explain it separately.",
        "source": "T12n0387_003:1093c01_3"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1093c02_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093c03_5"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1093c03_6"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1093c03_7"
    },
    {
        "source_sentence": "有寶藏法門、淨藏法門、淨樂法門、施樂法門、施目法門、深藏法門、深法莊嚴法門、正見法門、愍一切眾生法門(梵本少一)。",
        "translation": "There's the Dharma aspect of the store of treasure, the Dharma aspect of the pure store, the Dharma aspect of purity and bliss, the Dharma aspect of generosity and bliss, the Dharma aspect of generosity, the Dharma aspect of generosity, the Dharma aspect of giving eyes, the Dharma aspect of deep treasury, the Dharma aspect of profound adornment of the Dharma, the Dharma",
        "source": "T12n0387_003:1093c04_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093c06_9"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1093c07_0"
    },
    {
        "source_sentence": "是時，眾中有一天女，字法寶樂，持諸花、香、幡蓋、伎樂以供養佛，",
        "translation": "At that time, there was a goddess in the assembly named Dharma Jewel Bliss, holding flowers, perfumes, banners, canopies, and music as offerings to the Buddha.",
        "source": "T12n0387_003:1093c07_1"
    },
    {
        "source_sentence": "「如來大施主，　　莊嚴大施聚，",
        "translation": "“The great donor of the Tathāgata Adorns the great cluster of offerings,",
        "source": "T12n0387_003:1093c08_2"
    },
    {
        "source_sentence": "　施一切眾生，　　不觀田非田。」",
        "translation": "Giving to all sentient beings doesn't contemplate what's a field or not a field.",
        "source": "T12n0387_003:1093c08_2"
    },
    {
        "source_sentence": "即說讚曰：大雲初分福田健度第三十四爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, The first part of the great cloud is the thirty-fourth section of the field of merit that's strong and liberating.",
        "source": "T12n0387_003:1093c08_2"
    },
    {
        "source_sentence": "有十種福田種子法門，惟願如來，分別解說。」",
        "translation": "There are ten kinds of seed dharma-gates of the field of merit, so may the Tathāgata explain them separately.",
        "source": "T12n0387_003:1093c12_3"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1093c13_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093c14_5"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1093c14_6"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1093c14_7"
    },
    {
        "source_sentence": "有寶行勝法門、寶流雨法門、寶行聚法門、寶功德聚法門、寶正意法門、寶目法門寶意法門、寶光法門、寶燈法門、寶電法門、無盡意法門、寶住法門、一切寶田法門(梵本長三)。",
        "translation": "There's the Dharma teaching of the superiority of the practice of treasure, the Dharma teaching of the flowing rain of treasure, the Dharma teaching of the cluster of practices of treasure, the Dharma teaching of the cluster of qualities of treasure, the Dharma teaching of the right intention of treasure, the Dharma teaching of the meaning of the Dharma teaching of the Dharma teaching of the Dharma teaching of the Dharma teaching of the Dharma teaching",
        "source": "T12n0387_003:1093c15_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093c18_9"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1093c19_10"
    },
    {
        "source_sentence": "是時，眾中有一天子，名曰寶雨，持諸香、華、幡蓋、伎樂以供養佛，",
        "translation": "At that time, there was a celestial being in the assembly named Jewel Raider, who offered incense, flowers, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1093c19_11"
    },
    {
        "source_sentence": "「諸佛等正覺，　　是世之福田，",
        "translation": "The buddhas, equally enlightened, Are fields of blessings for the world.",
        "source": "T12n0387_003:1093c20_12"
    },
    {
        "source_sentence": "　大慈悲憐愍，　　一切諸眾生，",
        "translation": "With great compassion and pity For all sentient beings,",
        "source": "T12n0387_003:1093c20_12"
    },
    {
        "source_sentence": "　能了田非田，　　故名阿梨呵。」",
        "translation": "They can understand what's a field and what's not a field, so they're called Ārya.",
        "source": "T12n0387_003:1093c20_12"
    },
    {
        "source_sentence": "即說讚曰：大雲初分正法健度第三十五爾時，大雲密藏菩薩言：「世尊！",
        "translation": "He then spoke in praise, saying, The first part of the great cloud is the thirty-fifth aspect of the strength of the right teaching. At that point, the great cloud esoteric store bodhisattva said, Bhagavān!",
        "source": "T12n0387_003:1093c20_12"
    },
    {
        "source_sentence": "有十種真實神通安樂樂王所入法門，惟願如來，分別解說。」",
        "translation": "There are ten kinds of true dharmas entered by the king of supernormal powers and bliss, so may the Tathāgata explain them separately.",
        "source": "T12n0387_003:1093c26_13"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_003:1093c28_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1093c28_1"
    },
    {
        "source_sentence": "諦聽諦聽！",
        "translation": "Listen closely, and listen closely!",
        "source": "T12n0387_003:1093c28_2"
    },
    {
        "source_sentence": "善思念之，吾當為汝分別解說。",
        "translation": "Consider it well and I will explain it to you in a discriminating way.",
        "source": "T12n0387_003:1093c28_3"
    },
    {
        "source_sentence": "有不動法門、住貌法門、不動樂法門、深住法門、不可思議聚法門、不可思議聚解脫法門、樂意法門、不可思議住法門、如來智印法門、一切大海無盡意法門。",
        "translation": "There's the Dharma aspect of immovability, the Dharma aspect of abiding appearance, the Dharma aspect of immovable bliss, the Dharma aspect of profound abiding, the Dharma aspect of inconceivable collections, the Dharma aspect of liberation from inconceivable collections, the Dharma aspect of joyful intention, the Dharma aspect of inconceivable abode, the",
        "source": "T12n0387_003:1093c29_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_003:1094a04_5"
    },
    {
        "source_sentence": "是名十法門。」",
        "translation": "These are called the ten dharma-gates.",
        "source": "T12n0387_003:1094a04_6"
    },
    {
        "source_sentence": "是時，眾中有一天子，名曰大光，持諸香、華、幡蓋、伎樂以供養佛，",
        "translation": "At that time, a celestial being in the assembly named Mahāprajāpatīṃdhara offered incense, flowers, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_003:1094a04_7"
    },
    {
        "source_sentence": "「諸佛婆伽婆，　　所說微妙法，",
        "translation": "The subtle teachings expounded by the buddhas and bodhisattvas are like this:",
        "source": "T12n0387_003:1094a06_8"
    },
    {
        "source_sentence": "　所為諸眾生，　　悉皆難思議！」",
        "translation": "All the sentient beings that are created are inconceivable!",
        "source": "T12n0387_003:1094a06_8"
    },
    {
        "source_sentence": "即說讚曰：大方等無想經卷第三",
        "translation": "He then said in praise, Mahāprajñāpāramitā-sūtra, Volume 3",
        "source": "T12n0387_003:1094a06_8"
    }
]