[
    {
        "source_sentence": "佛說大方廣善巧方便經卷第四",
        "translation": "Foshuo dafangguang shanqiao shanqiao jing, vol. 4",
        "source": "T12n0346_004:0175c02_0"
    },
    {
        "source_sentence": "西天譯經三藏朝奉大夫試光祿卿",
        "translation": "Xitian zhuan jing sanzang朝奉大夫試光祿卿",
        "source": "T12n0346_004:0175c04_0"
    },
    {
        "source_sentence": "傳法大師賜紫臣施護奉　詔譯",
        "translation": "Translated by imperial edict of the Master Zhuanfa, who bestowed a purple minister named Shi Hufeng",
        "source": "T12n0346_004:0175c05_0"
    },
    {
        "source_sentence": "「復次，智上！",
        "translation": "Furthermore, Zhixiang!",
        "source": "T12n0346_004:0175c06_0"
    },
    {
        "source_sentence": "我念過去世時有五百商人入海求寶。",
        "translation": "I remember that in a past life five hundred merchants entered the ocean to search for treasure.",
        "source": "T12n0346_004:0175c06_1"
    },
    {
        "source_sentence": "是時，別有一商人其性剛強，猛利暴惡，於海中路而忽相逢。",
        "translation": "At the time, there was another merchant whose nature was rigid and strong, fierce and violent, and suddenly they met on the road in the sea.",
        "source": "T12n0346_004:0175c07_2"
    },
    {
        "source_sentence": "彼一商人即生惡心，欲謀珍寶。",
        "translation": "That merchant then became angry and wanted to steal the treasure.",
        "source": "T12n0346_004:0175c08_3"
    },
    {
        "source_sentence": "彼自思惟：『我今宜應設其方便，悉斷彼諸商人命已，當取珍寶，還閻浮洲，",
        "translation": "They thought to themselves, ‘Should I now make an expedient plan to cut off the livelihood of these merchants?",
        "source": "T12n0346_004:0175c09_4"
    },
    {
        "source_sentence": "自受快樂。』",
        "translation": "They themselves experience happiness.'",
        "source": "T12n0346_004:0175c10_5"
    },
    {
        "source_sentence": "是時，五百商人眾中有一商主名曰善御，其性慈和，於一切人常生悲愍。",
        "translation": "At the time, there was a merchant lord named Sunetra among the five hundred merchants in the crowd, whose nature was compassionate and peaceful, and he always had compassion for all people.",
        "source": "T12n0346_004:0175c11_0"
    },
    {
        "source_sentence": "商主一時止息而臥，忽於夢中見大海神出現其相，謂商主言：『汝今當知，",
        "translation": "At one time the merchant leader of the caravan stopped and lay down. Suddenly, in a dream he saw the great sea goddess appearing to him.",
        "source": "T12n0346_004:0175c12_1"
    },
    {
        "source_sentence": "諸商眾外別有一人，其性暴惡，如是色相、如是名字。",
        "translation": "Outside the merchants, there's another person with a violent nature who has such-and-such form and names.",
        "source": "T12n0346_004:0175c14_2"
    },
    {
        "source_sentence": "彼人起賊害心欲謀珍寶，彼作是念：「應當速斷諸商人命，取其珍寶，",
        "translation": "When that man became angry and wanted to steal the treasure, he thought, You must quickly cut off the lives of the merchants and take their treasure.",
        "source": "T12n0346_004:0175c15_3"
    },
    {
        "source_sentence": "還閻浮洲，自受快樂。」",
        "translation": "I'll return to Jambudvīpa and experience happiness for myself.",
        "source": "T12n0346_004:0175c17_0"
    },
    {
        "source_sentence": "是故，我今如彼所念而先語汝，汝可思惟作何方便，令此惡人不造殺業、免地獄報，",
        "translation": "Therefore, I will now tell you what they think. What method can you consider to prevent this bad person from committing the act of killing and escape punishment in hell?",
        "source": "T12n0346_004:0175c17_1"
    },
    {
        "source_sentence": "又復商眾得全其命。",
        "translation": "Furthermore, the merchants were able to fulfill their lives.",
        "source": "T12n0346_004:0175c19_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0346_004:0175c19_3"
    },
    {
        "source_sentence": "此五百商人皆於阿耨多羅三藐三菩提已住不退轉，而彼惡人於如是住菩薩法者若造殺業，",
        "translation": "These five hundred merchants had all attained unexcelled, perfect enlightenment. But those evil people who practiced the bodhisattva-dharma in such a way would commit the sin of killing if they did so.",
        "source": "T12n0346_004:0175c20_0"
    },
    {
        "source_sentence": "永墮地獄，無有出期。",
        "translation": "They'll always fall into hell, and there's no time to leave.",
        "source": "T12n0346_004:0175c22_1"
    },
    {
        "source_sentence": "是故，汝今宜設方便，善為救度。』",
        "translation": "Therefore, now it's advisable for you to set up an expedient method that's good for salvation.'",
        "source": "T12n0346_004:0175c22_2"
    },
    {
        "source_sentence": "「爾時，善御商主從夢覺已，即作是念：『我於今時有何方便，令此惡人不造殺業、免地獄報，",
        "translation": "“At that time, having awakened from his dream, the merchant Sogavyūha thought: What method can I use now to prevent this bad man from committing the sin of killing so as to avoid suffering the retribution in hell?",
        "source": "T12n0346_004:0175c23_3"
    },
    {
        "source_sentence": "得諸商人各全其命？』",
        "translation": "Will you get all the merchants to have their lives?'",
        "source": "T12n0346_004:0175c25_4"
    },
    {
        "source_sentence": "於一日中如是思惟求善方便而未能得，乃至七日審諦思惟亦不能得。",
        "translation": "In a single day, he thus contemplates and seeks good skillful means but doesn't attain them, and even seven days of careful contemplation won't attain them.",
        "source": "T12n0346_004:0175c25_5"
    },
    {
        "source_sentence": "過七日已，即作是念：『我今無復方便可得，但當於彼興殺心者先與斷命。",
        "translation": "After seven days had passed, he thought, 'Now, there's no more method to attain it, but I'll give my life to someone who has the intention to kill.",
        "source": "T12n0346_004:0175c27_6"
    },
    {
        "source_sentence": "彼斷命故，不造殺業、免地獄報，又令餘眾得全其命。』",
        "translation": "Because they cut off their life, they don't commit the act of killing and are spared the punishment of hell, and they cause other people to attain the full fulfillment of their life.'",
        "source": "T12n0346_004:0175c29_7"
    },
    {
        "source_sentence": "如是念已而復籌量：『我若與此五百商人共斷其命，而五百人皆墮地獄。",
        "translation": "After this thought, he again calculates, 'If I were to cut off their lives with these five hundred merchants, and those five hundred people would all fall into hell.'",
        "source": "T12n0346_004:0176a01_8"
    },
    {
        "source_sentence": "我今宜應起大悲心，為救護故，自手當殺。",
        "translation": "Now, it's appropriate for me to arouse great compassion and kill myself with my own hands in order to rescue them.",
        "source": "T12n0346_004:0176a02_9"
    },
    {
        "source_sentence": "此殺因者，設於百千劫中獲地獄報亦當忍受。",
        "translation": "Even if someone were to receive the retribution of hell for a hundred thousand eons, they would tolerate it.",
        "source": "T12n0346_004:0176a03_10"
    },
    {
        "source_sentence": "但能今時以如是大悲方便令此惡人不造殺業，當免地獄無量劫苦；",
        "translation": "But if one were to cause these evil people not to commit the act of killing in this way, they would be spared the suffering of hell for an immeasurable number of kalpas.",
        "source": "T12n0346_004:0176a04_11"
    },
    {
        "source_sentence": "又令住菩薩法者諸商人眾，安隱無難。』",
        "translation": "It also causes the merchants who abide in the bodhisattva's teaching to be comfortable and without difficulty.'",
        "source": "T12n0346_004:0176a06_12"
    },
    {
        "source_sentence": "爾時，商主作是念已，即設方便乃斷其命。",
        "translation": "After he had this thought, the merchant lord then set up a method to cut off his life.",
        "source": "T12n0346_004:0176a07_13"
    },
    {
        "source_sentence": "時彼惡人既此命終得生天界。",
        "translation": "At the end of his life, that bad person will be born in the heavenly realm.",
        "source": "T12n0346_004:0176a08_14"
    },
    {
        "source_sentence": "「智上！",
        "translation": "Zhixiang!",
        "source": "T12n0346_004:0176a09_15"
    },
    {
        "source_sentence": "彼五百商人者，當知即是此賢劫中五百如來；",
        "translation": "Those five hundred merchants should be known as the five hundred tathagatas of this world age of the wise.",
        "source": "T12n0346_004:0176a09_16"
    },
    {
        "source_sentence": "是時眾中為商主者，即我身是。",
        "translation": "The merchant leader in the crowd at that time was none other than I myself.",
        "source": "T12n0346_004:0176a10_17"
    },
    {
        "source_sentence": "我於百千劫在輪迴中，以大悲心出生善巧方便，如是種種救度眾生。",
        "translation": "For a hundred thousand eons, I've been in transmigration, producing skillful means with great compassion and thus saving sentient beings in various ways.",
        "source": "T12n0346_004:0176a10_18"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T12n0346_004:0176a12_19"
    },
    {
        "source_sentence": "菩薩摩訶薩雖經百千劫在輪迴中，皆為以方便智救度眾生，勿謂菩薩摩訶薩有業障可得。",
        "translation": "Although the bodhisattva Mahāsattva spent hundreds of thousands of eons in transmigration, they all rescued sentient beings with skillful means and wisdom, not saying that the bodhisattva Mahāsattva had karmic hindrances to attain.",
        "source": "T12n0346_004:0176a12_20"
    },
    {
        "source_sentence": "是故當知，諸佛、菩薩諸所作業皆悉清淨，無復少分障累可得。",
        "translation": "Because of this, you should know that all the actions of buddhas and bodhisattvas are completely pure, with no partial hindrances to attainment.",
        "source": "T12n0346_004:0176a14_21"
    },
    {
        "source_sentence": "「智上！",
        "translation": "Zhixiang!",
        "source": "T12n0346_004:0176a16_22"
    },
    {
        "source_sentence": "又復當知，如來、應供、正等正覺是金剛不壞之身，乃至舉足、下足皆以神通方便作大利益。」",
        "translation": "Furthermore, you should also know that the Tathāgata, Worthy of Offerings, and Completely Awakened One are the indestructible body of the vajra, up to the point where they lift their legs and lower legs all work with supernormal skillful means for great benefit.",
        "source": "T12n0346_004:0176a16_23"
    },
    {
        "source_sentence": "是時，舍衛城中有二十人，忽與二十極惡知識而相值遇，是諸人等互起惡心欲相謀殺，",
        "translation": "At that time, twenty people in the city of Sāvatthī suddenly happened to meet a group of twenty extremely evil friends.",
        "source": "T12n0346_004:0176a18_24"
    },
    {
        "source_sentence": "各各伺求彼彼方便。",
        "translation": "Each one seeks each other's skillful means.",
        "source": "T12n0346_004:0176a20_25"
    },
    {
        "source_sentence": "時四十人承佛威神力故俱詣佛所，到佛所已，住立一面。",
        "translation": "Forty people then came to the Buddha through the Buddha's authoritative power, and when they arrived there, they stood to one side.",
        "source": "T12n0346_004:0176a21_0"
    },
    {
        "source_sentence": "爾時，如來、應供、正等正覺為欲化度彼四十人故，於剎那間化一大人在佛會中，",
        "translation": "At the time, the Tathāgata, Worthy of Offerings, Perfectly Enlightened One wanted to save those forty people, so he instantaneously transformed one great person into a buddha in the assembly.",
        "source": "T12n0346_004:0176a22_1"
    },
    {
        "source_sentence": "即白大目乾連言：「尊者當知，今此大地不久出現諸草木相。」",
        "translation": "He then said to Mahāmaudgalyāyana, Venerable, you should know that it won't be long before the appearance of grass and trees on this earth.",
        "source": "T12n0346_004:0176a24_2"
    },
    {
        "source_sentence": "而彼大人作是言：「時世尊即為垂其右足。」",
        "translation": "The great man then said, At the time, the Bhagavān was hanging down his right foot.",
        "source": "T12n0346_004:0176a25_3"
    },
    {
        "source_sentence": "於須臾間而此大地即生草木，各一尺量。",
        "translation": "In a moment, this earth immediately produced grass and trees one foot in each direction.",
        "source": "T12n0346_004:0176a26_4"
    },
    {
        "source_sentence": "時尊者大目乾連白佛言：「世尊！",
        "translation": "Venerable Mahāmaudgalyāyana then said to the Buddha, Bhagavān!",
        "source": "T12n0346_004:0176a27_5"
    },
    {
        "source_sentence": "今所出現草木之相，我於餘方可能見不？」",
        "translation": "Am I able to see the marks of grass and trees that appear now in other places?",
        "source": "T12n0346_004:0176a28_6"
    },
    {
        "source_sentence": "佛言：「不能。」",
        "translation": "The Buddha said, No.",
        "source": "T12n0346_004:0176a29_0"
    },
    {
        "source_sentence": "尊者大目乾連而即隨取少分草木乃自執持。",
        "translation": "Venerable Mahāmaudgalyāyana then took a small amount of grass and wood and held it himself.",
        "source": "T12n0346_004:0176a29_1"
    },
    {
        "source_sentence": "時三千大千世界皆悉震動。",
        "translation": "At the time, 3,000 great one-thousand worlds all shook.",
        "source": "T12n0346_004:0176b01_2"
    },
    {
        "source_sentence": "于是，如來、應供、正等正覺以神通力現自身相出過梵界，而此草木亦復隨從出過梵界；",
        "translation": "Then the Buddha, the Arhat, the Worthy of Offerings, and the perfectly enlightened one manifested their own marks by means of supernatural powers to go beyond the realm of Brahmā. The grass and trees also went beyond the realm of Brahmā.",
        "source": "T12n0346_004:0176b01_3"
    },
    {
        "source_sentence": "又復如來以神通力現大海中，而此草木亦隨彼住；",
        "translation": "Again, the Enlightened One manifested himself in the ocean by mystic powers, and these grasses and trees also remained there.",
        "source": "T12n0346_004:0176b03_4"
    },
    {
        "source_sentence": "又復如來以神通力入大山間，而此草木亦隨彼住。",
        "translation": "Again, the Tathāgata entered a great mountain with his supernormal powers, and these grasses and trees also stayed there.",
        "source": "T12n0346_004:0176b05_5"
    },
    {
        "source_sentence": "爾時，如來還本座已即收右足，而此草木亦安住不動。",
        "translation": "After returning to his seat, the Tathāgata then took off his right foot, but this grass and trees were also standing still without moving.",
        "source": "T12n0346_004:0176b06_6"
    },
    {
        "source_sentence": "爾時，尊者阿難白佛言：「世尊！",
        "translation": "At that point, Venerable Ānanda said to the Buddha, Bhagavān!",
        "source": "T12n0346_004:0176b08_0"
    },
    {
        "source_sentence": "如來往昔有何因緣，今現是相？」",
        "translation": "What were the causes and conditions for the Tathāgata's past appearance now?",
        "source": "T12n0346_004:0176b08_1"
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, Ānanda!",
        "source": "T12n0346_004:0176b09_2"
    },
    {
        "source_sentence": "我於往昔為大商主，入海求寶，逢惡知識，我時以大悲心而斷其命。",
        "translation": "Formerly, when I was a great merchant lord, I went into the sea to search for treasures and met some bad friends. At that time I cut off their life because of my great compassion.",
        "source": "T12n0346_004:0176b09_3"
    },
    {
        "source_sentence": "昔因緣故，今有是相。」",
        "translation": "Because of the causes and conditions of the past, there's this mark now.",
        "source": "T12n0346_004:0176b11_4"
    },
    {
        "source_sentence": "「今此所現如是相，　　不住虛空及山、海，",
        "translation": "“Now this sign that appears like this doesn’t abide in space, mountains, or oceans.",
        "source": "T12n0346_004:0176b11_5"
    },
    {
        "source_sentence": "　乃至不住諸地方，　　以宿因故如是住。」",
        "translation": "It doesn't abide in any place, and it thus abides because of past causes.",
        "source": "T12n0346_004:0176b11_5"
    },
    {
        "source_sentence": "爾時，世尊說伽陀曰：爾時，彼四十人咸作是念：「如來是大法王，無實業障可得。",
        "translation": "At the time, the Bhagavān spoke to Gadha, saying, At that point, those forty people all had this thought, The Tathāgata is the great king of the Dharma, and there are no real karmic hindrances to attain it.",
        "source": "T12n0346_004:0176b11_5"
    },
    {
        "source_sentence": "我等互起惡心自相謀害，今對佛前宜應懺悔。」",
        "translation": "We each arouse bad thoughts and plot against each other, so now it's appropriate to repent in front of the Buddha.",
        "source": "T12n0346_004:0176b16_6"
    },
    {
        "source_sentence": "作是念已，俱白佛言：「世尊！",
        "translation": "After they had this thought, they both said to the Buddha, Bhagavān!",
        "source": "T12n0346_004:0176b17_7"
    },
    {
        "source_sentence": "我等先起惡心互欲殺害。",
        "translation": "'First, we gave rise to bad thoughts and wanted to kill each other.",
        "source": "T12n0346_004:0176b17_8"
    },
    {
        "source_sentence": "是故，今時各各懺悔。」",
        "translation": "Therefore, they each repent at this time.",
        "source": "T12n0346_004:0176b18_9"
    },
    {
        "source_sentence": "爾時，世尊即為如應宣說法要，彼四十人皆得智證三昧。",
        "translation": "At the time, the Bhagavān then taught the essentials of the Dharma as they should be taught, and those forty people all attained the samādhi of knowledge and realization.",
        "source": "T12n0346_004:0176b19_0"
    },
    {
        "source_sentence": "是時，有三百二十萬眾生遠塵離垢，得法眼淨。",
        "translation": "At the time, there were 3.2 million sentient beings who were far removed from dust and dirt and attained purity of the Dharma eye.",
        "source": "T12n0346_004:0176b20_1"
    },
    {
        "source_sentence": "「智上！",
        "translation": "Zhixiang!",
        "source": "T12n0346_004:0176b21_2"
    },
    {
        "source_sentence": "以此因緣，當知諸佛如來舉足、下足皆是神通方便，作大利益，實無少分業障可得。",
        "translation": "Because of these causes and conditions, you should know that the buddha-tathāgatas lift their feet and lower legs with supernormal powers and skillful means to create great benefits, but there really isn't a single part of the karmic hindrance that can be attained.",
        "source": "T12n0346_004:0176b21_3"
    },
    {
        "source_sentence": "「又復如來已離諸病，何故一時遣諸苾芻詣耆婆所求青蓮華蘂汁？",
        "translation": "Again, once the Tathāgata has parted with his illnesses, why did he suddenly send the monks to Jīvaka's place and ask for the juice of blue lotus root?",
        "source": "T12n0346_004:0176b23_4"
    },
    {
        "source_sentence": "要當何用？",
        "translation": "What's the point of using it?",
        "source": "T12n0346_004:0176b24_5"
    },
    {
        "source_sentence": "所謂：我於一時與五百苾芻結夏未久住於林間，是時有修左囉摩婆尾迦行者住彼林側。",
        "translation": "One time, I was staying with five hundred monks in a forest not long after the summer retreat, and there was a practitioner who cultivated the practice of śrāma-vaśeṣa by the side of that forest.",
        "source": "T12n0346_004:0176b25_6"
    },
    {
        "source_sentence": "是人忽有病生，不能進止、不能調伏，即於我所求以妙藥而救其苦。",
        "translation": "That man suddenly became ill and unable to be cured or subdued, so he asked me to give him a wonderful medicine to cure his pain.",
        "source": "T12n0346_004:0176b27_7"
    },
    {
        "source_sentence": "我時作是思惟：『今不應知是病所宜。",
        "translation": "I then had this thought, 'Now, you shouldn't know that it's appropriate for the illness.",
        "source": "T12n0346_004:0176b28_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0346_004:0176b29_9"
    },
    {
        "source_sentence": "我若知其病所宜者，後末世中破壞聖心。",
        "translation": "If I know what's appropriate for his illness, I'll destroy the noble mind in the latter part of my life.",
        "source": "T12n0346_004:0176b29_10"
    },
    {
        "source_sentence": "于今設何方便得藥與療？",
        "translation": "What method would you use now to obtain medicine and treatment?",
        "source": "T12n0346_004:0176c01_11"
    },
    {
        "source_sentence": "但當令此諸苾芻眾為求其藥。』",
        "translation": "I will simply cause these monks to seek their medicine for them.'",
        "source": "T12n0346_004:0176c02_12"
    },
    {
        "source_sentence": "作是念已，即令諸苾芻詣耆婆所求青蓮華蘂汁與療其病。",
        "translation": "After he had this thought, he asked the monks to go to Jīvaka's place and give him the blue lotus root juice that he wanted to treat his illness.",
        "source": "T12n0346_004:0176c02_13"
    },
    {
        "source_sentence": "是諸苾芻雖承佛旨而未即行。",
        "translation": "Although these monks had accepted the Buddha's teaching, they didn't immediately practice it.",
        "source": "T12n0346_004:0176c04_14"
    },
    {
        "source_sentence": "爾時，淨居天子見諸苾芻已，白言：『尊者！",
        "translation": "Seeing the monks, the Śuddhodana Devānām-Indra said, 'Sir, venerable!",
        "source": "T12n0346_004:0176c05_15"
    },
    {
        "source_sentence": "汝等當如佛旨，求如是藥為作救療，勿求別藥令彼服已而趣命終。』",
        "translation": "You should follow the Buddha's instructions and seek such a medicine for your salvation, not another medicine to cause them to die after taking it.'",
        "source": "T12n0346_004:0176c06_0"
    },
    {
        "source_sentence": "諸苾芻言：『我等若行求藥違佛戒法，我等寧自喪命，終不違佛戒法而行。』",
        "translation": "The monks said, 'If we practice seeking medicine and disobey the Buddha's precepts, we'd rather lose our lives than practice in ways that don't disobey the Buddha's precepts.'",
        "source": "T12n0346_004:0176c07_1"
    },
    {
        "source_sentence": "淨居天子復白諸苾芻言：『如來是大法王，以利益心猶故現相服藥除病。",
        "translation": "The god Śuddhāvāsa again said to the monks, 'The Tathāgata is the great king of the Dharma, and he's still taking medicine in order to remove illness because he wants to benefit them.",
        "source": "T12n0346_004:0176c09_2"
    },
    {
        "source_sentence": "汝等今時何不如教？",
        "translation": "Why don't you now teach it?",
        "source": "T12n0346_004:0176c10_3"
    },
    {
        "source_sentence": "當行求藥，當行求藥。』",
        "translation": "You should seek medicine, and you should seek medicine.'",
        "source": "T12n0346_004:0176c11_4"
    },
    {
        "source_sentence": "淨居天子如是三白已，時諸苾芻息疑悔心，即詣耆婆所求如是藥。",
        "translation": "After he had made these three statements, the Śuddhāvāsadeva then stopped doubting and remorseful, went to Jīvaka and asked for such medicine.",
        "source": "T12n0346_004:0176c11_5"
    },
    {
        "source_sentence": "得是藥已授彼病人，服已除差。",
        "translation": "After he got this medicine, he gave it to the sick man, took it, and removed the difference.",
        "source": "T12n0346_004:0176c13_6"
    },
    {
        "source_sentence": "智上！",
        "translation": "Zhixiang!",
        "source": "T12n0346_004:0176c14_0"
    },
    {
        "source_sentence": "以是因緣，我為利益故乃遣苾芻求如是藥，而非如來有諸病惱。",
        "translation": "Because of these causes and conditions, I sent a monk to ask for such medicine for my benefit, but the Tathāgata doesn't have illnesses and afflictions.",
        "source": "T12n0346_004:0176c14_1"
    },
    {
        "source_sentence": "「又復如來諸福蘊中最上、最勝，何故最先執持應器入城乞食？",
        "translation": "Again, the Tathāgata is the highest and most excellent among all the aggregates of merit, so why did he first take the bowl and enter the city to solicit alms?",
        "source": "T12n0346_004:0176c15_2"
    },
    {
        "source_sentence": "所謂：如來已離諸障、無叚食想，但為愍念後末世中有諸苾芻少福德者，",
        "translation": "That is to say, the Tathāgata has parted with all hindrances and no ideation of food or nutriment, but for the sake of pitying those monks in later ages who have little virtue.",
        "source": "T12n0346_004:0176c17_0"
    },
    {
        "source_sentence": "雖入王城聚落持鉢乞食而不能得，乃生退屈，不能長時勤行乞食。",
        "translation": "Even though he entered the king's city and village to solicit alms with his bowl, he couldn't get it, so he became retrogressing and unable to diligently solicit alms for a long time.",
        "source": "T12n0346_004:0176c18_1"
    },
    {
        "source_sentence": "為令此等苾芻當於爾時作是思惟：『如來大師於諸世間福聚最勝，猶尚隨宜持鉢乞食，",
        "translation": "At that time, in order to cause these monks to think: The great teacher of the Tathāgata is the foremost among all the accumulations of merit in the world. He may as well take his almsbowl and beg for food.",
        "source": "T12n0346_004:0176c20_2"
    },
    {
        "source_sentence": "況復我今末世苾芻薄福德故，乞食所難不應生苦。",
        "translation": "It's even more so when I, a monk of the latter age, have weak virtue and beg for food that shouldn't give rise to suffering.",
        "source": "T12n0346_004:0176c22_3"
    },
    {
        "source_sentence": "但當行乞，雖復少得而亦為足。』",
        "translation": "But you should practice begging, and even though you've obtained a little, it's still enough.'",
        "source": "T12n0346_004:0176c23_4"
    },
    {
        "source_sentence": "「智上！",
        "translation": "Zhixiang!",
        "source": "T12n0346_004:0176c24_5"
    },
    {
        "source_sentence": "如來在世行乞食者，又為隨順作利益故，所謂令諸婆羅門、長者、居士，",
        "translation": "When the Tathāgata is in the world, he begs for food because he wants to benefit those who follow and serve him. This is called causing the brāhmaṇas, wealthy householders, and laymen [to do so].",
        "source": "T12n0346_004:0176c24_6"
    },
    {
        "source_sentence": "乃至一切人民，以佛威神所加持故，於現世中飲食豐足，不值飢饉之苦。",
        "translation": "Because of the Buddha's authoritative blessing, all people in the present world will have plenty of food and drink, and they won't experience the suffering of hunger.",
        "source": "T12n0346_004:0176c25_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0346_004:0176c27_8"
    },
    {
        "source_sentence": "如來在世，不令諸魔作飢饉難。",
        "translation": "When the Tathāgata is in the world, he doesn't make it difficult for Māra to starve.",
        "source": "T12n0346_004:0176c27_9"
    },
    {
        "source_sentence": "是故，如來以善方便隨順世間，雖受叚食不生愛著，不令婆羅門、長者，",
        "translation": "Therefore, the Tathāgata follows the world with good skillful means. Even though he eats coarse food, he does not give rise to craving and doesn’t allow [other] brāhmaṇas and wealthy people to do so.",
        "source": "T12n0346_004:0176c28_10"
    },
    {
        "source_sentence": "乃至一切人民及餘諸天子眾等起如是念：『沙門瞿曇於其叚食愛樂作意。』",
        "translation": "It's even when all the people and other celestial beings think, 'The ascetic Gautama likes to contemplate on his delicious food.'",
        "source": "T12n0346_004:0176c29_11"
    },
    {
        "source_sentence": "如來為令彼等不生念故，於晝夜中與苾芻眾常住三昧，依止一心，寂而無動，",
        "translation": "In order to prevent them from thinking, the Tathāgata always abides in concentration with the assembly of bhikṣus during the day and night. Relying on one mind, he remains still and unmoving.",
        "source": "T12n0346_004:0177a02_12"
    },
    {
        "source_sentence": "無高、無下，前引於後、後如於前，正念相應。",
        "translation": "It is neither high nor low. The prior one leads to the latter, and the subsequent one is as before: associated with right mindfulness.",
        "source": "T12n0346_004:0177a04_13"
    },
    {
        "source_sentence": "於一時中我住三昧，有七萬天子發清淨心禮敬於我，我即從三昧出為其如應宣說法要，",
        "translation": "At one time, while I was in samādhi, 70,000 celestial beings with pure minds bowed to me. I emerged from samādhi and taught them the Dharma essentials as they should be taught.",
        "source": "T12n0346_004:0177a05_14"
    },
    {
        "source_sentence": "彼諸天子於諸法中得法眼淨。",
        "translation": "Those celestial beings attain purity of the Dharma eye in all dharmas.",
        "source": "T12n0346_004:0177a07_15"
    },
    {
        "source_sentence": "由此因緣，是故當知，諸佛、如來現行乞食，但以善巧方便作利益故。",
        "translation": "Because of these causes and conditions, you should know that the buddhas and tathāgatas who are now begging for food simply use skillful means to benefit.",
        "source": "T12n0346_004:0177a08_0"
    },
    {
        "source_sentence": "「又復一時有贊左摩拏嚩迦於佛如來而生惡意，當墮地獄，佛為救護，",
        "translation": "Again, at one time a certain Licchavi Vimalakīrti thought to himself, “With evil intent he will fall into hell under the guidance of the buddha-tathāgata Samantabhadra.",
        "source": "T12n0346_004:0177a09_1"
    },
    {
        "source_sentence": "其事云何？",
        "translation": "What's the matter?",
        "source": "T12n0346_004:0177a11_2"
    },
    {
        "source_sentence": "所謂：如來怨親平等，無復少分障累可得，但為眾生安樂利益。",
        "translation": "That is to say, the Tathāgata's enemies and relatives are equal, no partial hindrances can be attained, but only for the benefit of the well-being of sentient beings.",
        "source": "T12n0346_004:0177a11_3"
    },
    {
        "source_sentence": "我於爾時為欲救護彼贊左摩拏嚩迦故，以我威神力令其得見兢伽沙數世界諸佛如來，",
        "translation": "At that time, wishing to protect those who praised the Tathāgata Samantabhadra, I caused them to see buddha-tathāgatas as numerous as the grains of sand in the Ganges River by my supernatural power.",
        "source": "T12n0346_004:0177a12_4"
    },
    {
        "source_sentence": "是諸如來大圓鏡智中現彼所作業。",
        "translation": "These are the tathāgatas who manifest their actions in the great perfect mirror wisdom of the Tathāgatas.",
        "source": "T12n0346_004:0177a14_5"
    },
    {
        "source_sentence": "以諸如來神通力故，令此摩拏嚩迦見自業已即生悔心，作如是言：『今於此中真實顯現，",
        "translation": "Because of the supernatural power of the buddhas’ spiritual powers, they caused these mātṛkā goddesses to see their own deeds and immediately felt remorse. They said:",
        "source": "T12n0346_004:0177a15_6"
    },
    {
        "source_sentence": "乃自思惟如來一切白法具足。",
        "translation": "He then thought to himself, The Tathāgata is fully endowed with all the white dharmas.",
        "source": "T12n0346_004:0177a17_7"
    },
    {
        "source_sentence": "云何我今但造惡業，於白法分而不能得？』",
        "translation": "How could I now only create bad karma and not attain the white dharma part?'",
        "source": "T12n0346_004:0177a18_8"
    },
    {
        "source_sentence": "彼摩拏嚩迦作是念時，即得清淨正白梵行，於其夢中見佛現身，所有先起惡意之罪皆悉銷滅，",
        "translation": "“When Mātṛkā had this thought, he attained purity in his pure and genuine practice of austerity. Seeing the Buddha appearing in his body in that dream, all sins committed previously with evil intentions were completely extinguished.",
        "source": "T12n0346_004:0177a19_9"
    },
    {
        "source_sentence": "命終已後免地獄報。",
        "translation": "After his life ends, he'll be spared the retribution of hell.",
        "source": "T12n0346_004:0177a21_10"
    },
    {
        "source_sentence": "當知皆是如來神力而為救護。",
        "translation": "You should know that they are all saved by the Tathāgata's miraculous power.",
        "source": "T12n0346_004:0177a21_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0346_004:0177a22_12"
    },
    {
        "source_sentence": "所謂：如來以大悲方便不捨眾生故。",
        "translation": "It's because the Tathāgata doesn't abandon sentient beings with great compassion and skillful means.",
        "source": "T12n0346_004:0177a22_13"
    },
    {
        "source_sentence": "「又復一時有孫那利梵志於祇陀林中，彼以因緣而斷其命。",
        "translation": "“Furthermore, once again, there was a priest named Sunarī in the Jeta grove, and for some reason he cut off his life.",
        "source": "T12n0346_004:0177a23_14"
    },
    {
        "source_sentence": "佛時不知，云何名為一切智耶？",
        "translation": "At the time, the Buddha didn't know, so what's called omniscience?",
        "source": "T12n0346_004:0177a25_0"
    },
    {
        "source_sentence": "所謂：如來無礙正智皆悉具足，無不知見，如來隨諸色相、神通等事皆以威神建立。",
        "translation": "That is to say, the Tathāgata's unhindered right knowledge is fully endowed, and there's nothing he doesn't know or see, and the Tathāgata establishes it by his authoritative power according to forms, characteristics, supernormal abilities, and other things.",
        "source": "T12n0346_004:0177a25_1"
    },
    {
        "source_sentence": "今此孫那利梵志者，佛觀是人壽量已盡，決定命終，亦非如來不能了知。",
        "translation": "Now, this Sunanī priest, the Buddha observes that this person's life span has ended and his life will surely end, but it's not something the Tathāgata can know.",
        "source": "T12n0346_004:0177a27_2"
    },
    {
        "source_sentence": "又，欲以是因緣令諸外道攝伏其心，止息自罪。",
        "translation": "They also want to use these causes and conditions to cause the non-Buddhists to subdue their minds and stop their own sins.",
        "source": "T12n0346_004:0177a29_3"
    },
    {
        "source_sentence": "爾時，如來以加持力於七夜中不入聚落。",
        "translation": "At the time, the Tathāgata didn't enter a village for seven nights because of his supernormal power.",
        "source": "T12n0346_004:0177b02_0"
    },
    {
        "source_sentence": "是時有六十俱胝天人過七夜已往詣佛所。",
        "translation": "After seven nights passed, there were 60 corpuscles of gods and humans who went to the Buddha's place.",
        "source": "T12n0346_004:0177b02_1"
    },
    {
        "source_sentence": "到佛所已，乃為隨應宣說法要，即時各得智證三昧。",
        "translation": "When they arrived at the Buddha's place, they then taught the essentials of the Dharma as appropriate, and each immediately attained the samādhi of knowledge and realization.",
        "source": "T12n0346_004:0177b03_2"
    },
    {
        "source_sentence": "「又復何緣如來昔曾於三月中食馬麥耶？",
        "translation": "Again, what is the reason why the Tathāgata once ate horse wheat for three months in the past?",
        "source": "T12n0346_004:0177b05_3"
    },
    {
        "source_sentence": "所謂：如來欲令婆羅門、長者等生希有心，又為成就利益事故。",
        "translation": "The Tathāgata wants to cause the brāhmaṇas and wealthy people to give rise to rare mental states, and it's also for the sake of accomplishing benefits.",
        "source": "T12n0346_004:0177b06_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0346_004:0177b07_5"
    },
    {
        "source_sentence": "我於一時與五百苾芻見五百馬，我觀彼馬宿世善根今已成熟。",
        "translation": "One time, I and five hundred monks saw five hundred horses, and I observed that horse's good roots in the constellation world have now matured.",
        "source": "T12n0346_004:0177b07_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0346_004:0177b09_7"
    },
    {
        "source_sentence": "此五百馬於前前世已曾為人，親近供養先佛如來，於先佛所發菩提心，",
        "translation": "These five hundred horses had been human beings since ancient times, becoming intimate with and honoring the buddhas of past buddha-lands. Their aspiration for enlightenment was born in the company of those buddhas.",
        "source": "T12n0346_004:0177b09_8"
    },
    {
        "source_sentence": "後因值遇彼惡知識破壞善法、造諸惡業，以是報應今受馬身。",
        "translation": "Later, he meets a bad friend who destroys the good Dharma and creates bad actions, and as a result of this retribution, he'll now experience the body of a horse.",
        "source": "T12n0346_004:0177b11_9"
    },
    {
        "source_sentence": "又復此五百馬往昔曾於日藏菩薩所發大誓願，以其宿世大願力故，今復值遇日藏菩薩以菩提法方便教化，",
        "translation": "“Furthermore, these five hundred horses had formerly made a great vow to the sun-store enlightening being, and by the power of their past vows they have now met the sun-store enlightening being, who teaches and inspires them with the means of awakening.",
        "source": "T12n0346_004:0177b12_10"
    },
    {
        "source_sentence": "令得度脫。",
        "translation": "He causes them to attain liberation.",
        "source": "T12n0346_004:0177b15_0"
    },
    {
        "source_sentence": "是五百馬以菩薩威力及自願力故，各能思念宿生中事。",
        "translation": "Because of the bodhisattva's authoritative power and the power of their own vows, each of these five hundred horses were able to think about past lives.",
        "source": "T12n0346_004:0177b15_1"
    },
    {
        "source_sentence": "智上！",
        "translation": "Zhixiang!",
        "source": "T12n0346_004:0177b16_2"
    },
    {
        "source_sentence": "我觀彼馬有是因緣，生悲愍心欲為化度，乃與苾芻往彼馬所，以所食麥即取食之。",
        "translation": "Observing that horse for this reason, I became compassionate and wanted to save him, so I went with the monk to his horse and took the wheat he ate as food.",
        "source": "T12n0346_004:0177b16_3"
    },
    {
        "source_sentence": "我自食已而復授彼五百苾芻。",
        "translation": "After I had eaten it myself, I then gave it to the five hundred monks.",
        "source": "T12n0346_004:0177b18_4"
    },
    {
        "source_sentence": "時五百馬以宿善根力故，見佛及苾芻眾食是馬麥，即時禮佛及諸苾芻。",
        "translation": "When the five hundred horses saw the Buddha and the monks eating this horse's wheat because of the power of their past roots of goodness, they bowed to the Buddha and the monks.",
        "source": "T12n0346_004:0177b19_5"
    },
    {
        "source_sentence": "彼五百馬過三月已皆悉命終，生兜率天，即從彼天來詣佛所，恭敬、尊重、瞻禮、供養。",
        "translation": "After three months had passed, the five hundred horses all died and were reborn in the Tuṣita Heaven. They came from that heaven to visit the Buddha with respect, reverence, veneration, veneration, greetings, and offerings.",
        "source": "T12n0346_004:0177b20_6"
    },
    {
        "source_sentence": "佛即隨應為說法要，是諸天子悉於阿耨多羅三藐三菩提住不退轉。",
        "translation": "The Buddha then taught the essentials of the Dharma for them as they should be taught, and these celestial beings all abide in unsurpassed, correct, and complete enlightenment without regressing.",
        "source": "T12n0346_004:0177b22_7"
    },
    {
        "source_sentence": "如來為令此五百馬成就如是大利益事故食馬麥。",
        "translation": "The Tathāgata causes these five hundred horses to accomplish such great benefits by eating horse wheat.",
        "source": "T12n0346_004:0177b24_8"
    },
    {
        "source_sentence": "「智上當知，所有一切飲食，如來食者皆為最上食。",
        "translation": "You should know that all the food and drink that the Tathāgata eats is the highest food.",
        "source": "T12n0346_004:0177b25_9"
    },
    {
        "source_sentence": "假使三千大千世界土及乳糖，如來食者，於是二種等無差別，皆成上味。",
        "translation": "Suppose 3,000 great one-thousand world lands and milk sugar are eaten by the Tathāgata, and there are no distinctions between these two kinds of suchness, which all become a superior taste.",
        "source": "T12n0346_004:0177b26_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0346_004:0177b28_11"
    },
    {
        "source_sentence": "如來舌根常得上味，是大人相。",
        "translation": "The Tathāgata's tongue faculty always gets a superior taste, which is the mark of a great man.",
        "source": "T12n0346_004:0177b28_12"
    },
    {
        "source_sentence": "以是緣故，當知諸佛如來凡所受食皆為最上食。",
        "translation": "Because of these reasons, you should know that the food received by all buddha-tathāgatas is the highest food.",
        "source": "T12n0346_004:0177b29_13"
    },
    {
        "source_sentence": "我時謂阿難言：『汝捨轉輪王位出家修道，於諸眾生起悲愍心。",
        "translation": "I then said to Ānanda, 'You've abandoned the position of wheel-turning king and left home to cultivate your path, and you've arisen compassion for sentient beings.",
        "source": "T12n0346_004:0177c01_14"
    },
    {
        "source_sentence": "汝今食此馬麥而得何味？』",
        "translation": "What flavor will you get from eating this horse's wheat?'",
        "source": "T12n0346_004:0177c02_15"
    },
    {
        "source_sentence": "阿難白佛言：『世尊！",
        "translation": "Ānanda said to the Buddha, 'Bhagavān!",
        "source": "T12n0346_004:0177c03_16"
    },
    {
        "source_sentence": "今此馬麥甚為希有，我雖生於王宮，昔未曾得此最上味。』",
        "translation": "Now, this horse wheat is so rare that even though I'm born in the king's palace, I've never tasted this supreme taste before.'",
        "source": "T12n0346_004:0177c03_17"
    },
    {
        "source_sentence": "是時，阿難食馬麥已，於七日中得大喜樂。",
        "translation": "After he had eaten the horse's wheat, Ānanda attained great joy and happiness for seven days.",
        "source": "T12n0346_004:0177c05_0"
    },
    {
        "source_sentence": "「智上！",
        "translation": "Zhixiang!",
        "source": "T12n0346_004:0177c05_1"
    },
    {
        "source_sentence": "我時與彼五百苾芻夏安居已，各還所止。",
        "translation": "After I had spent the summer retreat with those five hundred monks, each returned to his place.",
        "source": "T12n0346_004:0177c06_2"
    },
    {
        "source_sentence": "是時，五百苾芻眾中有四十苾芻食是馬麥，雖於其味作清淨想，還復思念諸苦糲食。",
        "translation": "At the time, there were 40 monks among the five hundred monks in the congregation who ate this horse's wheat, and although they had pure thoughts of its taste, they also thought of the painful food.",
        "source": "T12n0346_004:0177c07_0"
    },
    {
        "source_sentence": "如是思念已，於七夜中各得阿羅漢果。",
        "translation": "After thus thinking, they each attained the fruit of arhatship for seven nights.",
        "source": "T12n0346_004:0177c08_1"
    },
    {
        "source_sentence": "「智上當知，如來雖食馬麥，實非宿障報應之事，但為眾生作大利益；",
        "translation": "“Great enlightening beings should know that even though the Tathāgata ate horse wheat, it really wasn’t something to be experienced as retribution for past hindrances; he simply benefited sentient beings.",
        "source": "T12n0346_004:0177c09_2"
    },
    {
        "source_sentence": "又令諸修淨戒沙門、婆羅門生希有心；",
        "translation": "It also caused the śramaṇas and brāhmaṇas who practiced pure morality to give rise to rare thoughts.",
        "source": "T12n0346_004:0177c11_3"
    },
    {
        "source_sentence": "復令一切眾生如說能行。",
        "translation": "It also causes all sentient beings to be able to practice as described.",
        "source": "T12n0346_004:0177c12_4"
    },
    {
        "source_sentence": "當知如來一切最勝，諸所施作不壞法行。",
        "translation": "You should know that the Tathāgata is the most superior of all, bestowing indestructible Dharma practices.",
        "source": "T12n0346_004:0177c12_5"
    },
    {
        "source_sentence": "「又復何緣如來一時謂迦葉言：『我患背痛，汝可為我說七覺支法。』",
        "translation": "Again, why did the Tathāgata once say to Kāśyapa, 'I'm suffering from back pain, so you can explain the seven factors of awakening for me.'",
        "source": "T12n0346_004:0177c13_6"
    },
    {
        "source_sentence": "此因緣者，所謂：爾時，有八千天子而共集會。",
        "translation": "These causes and conditions are: At that time, there were eight thousand celestial beings assembled together.",
        "source": "T12n0346_004:0177c15_7"
    },
    {
        "source_sentence": "是諸天子先於佛、法、僧寶未生淨信，當於爾時暫聞迦葉說七覺支法，",
        "translation": "These celestial beings had not yet developed pure faith in the treasures of buddhahood, doctrine, and Sangha. At that time Kāśyapa briefly taught them the seven factors of enlightenment:",
        "source": "T12n0346_004:0177c16_8"
    },
    {
        "source_sentence": "而彼信心漸能開悟。",
        "translation": "That faith gradually enlightened them.",
        "source": "T12n0346_004:0177c17_9"
    },
    {
        "source_sentence": "即詣迦葉所，迦葉重復廣為分別七覺支法。",
        "translation": "He went to Kāśyapa, and Kāśyapa again explained the seven factors of awakening in detail.",
        "source": "T12n0346_004:0177c18_10"
    },
    {
        "source_sentence": "是八千天子即時各得智證三昧，乃自思惟：『眾生有病不能聽法，若聞法者病得銷除。",
        "translation": "Immediately, each of these 8,000 celestial beings attained the samādhi of wisdom and realization. They thought to themselves, “Some sentient beings have illnesses that prevent them from listening to the Dharma; but if they hear the Dharma, their illnesses will be healed.” The Buddha said:",
        "source": "T12n0346_004:0177c19_11"
    },
    {
        "source_sentence": "如來是大法王，猶故現病令大迦葉說七覺支法。",
        "translation": "The Tathāgata is the great king of the Dharma, and it's still because he's sick that Mahākāśyapa explains the seven factors of awakening.",
        "source": "T12n0346_004:0177c21_12"
    },
    {
        "source_sentence": "我等云何不樂聽法？』",
        "translation": "How can we not delight in listening to the teaching?'",
        "source": "T12n0346_004:0177c22_13"
    },
    {
        "source_sentence": "彼諸天子作是思惟已，即於佛法心得清淨。",
        "translation": "After they had this thought, those celestial beings then became pure in their minds about the Buddha's teaching.",
        "source": "T12n0346_004:0177c22_14"
    },
    {
        "source_sentence": "以是利益因故，如來乃現背痛令大迦葉說七覺支法。",
        "translation": "Because of this beneficial cause, the Tathāgata then showed his back pain and caused Mahākāśyapa to explain the seven factors of awakening.",
        "source": "T12n0346_004:0177c23_15"
    },
    {
        "source_sentence": "當知皆是善巧方便，實非宿障報應之事。",
        "translation": "You should know that they are all skillful means and really not the retribution of past hindrances.",
        "source": "T12n0346_004:0177c25_16"
    },
    {
        "source_sentence": "「又復何緣，昔有莊嚴幢婆羅門於一時中向佛世尊發不善語，佛於爾時不生恚礙？",
        "translation": "Again, why is it that in the past there was a brāhmaṇa named Adorned Banner who at one time spoke unwholesome words to the Buddha Bhagavān, but the Buddha didn't give rise to anger or obstruction at that time?",
        "source": "T12n0346_004:0177c26_0"
    },
    {
        "source_sentence": "所謂：如來於天人四眾大集會中已得忍、力具足，隨觀諸境不生恚礙。",
        "translation": "That is to say, the Tathāgata has already attained forbearance and powers in the four great assemblies of gods and humans, observing objects as they are without any obstruction.",
        "source": "T12n0346_004:0177c27_1"
    },
    {
        "source_sentence": "如來爾時於諸眾生住平等心、救護心、安住心、柔軟心、勇猛心。",
        "translation": "At that point, the Tathāgata abides with equanimity, protection, stability, gentleness, and boldness in regard to sentient beings.",
        "source": "T12n0346_004:0177c29_2"
    },
    {
        "source_sentence": "如來住是諸心時，有四千眾生發阿耨多羅三藐三菩提心。",
        "translation": "When the Tathāgata abides in these minds, 4,000 sentient beings give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0346_004:0178a01_3"
    },
    {
        "source_sentence": "以是利益因故，如來乃於莊嚴幢婆羅門不生恚礙。",
        "translation": "Because of this beneficial cause, the Tathāgata didn't create any obstacles in the adorned banner-banner brahman.",
        "source": "T12n0346_004:0178a03_4"
    },
    {
        "source_sentence": "當知皆是如來善巧方便，實非宿障報應之事。",
        "translation": "You should know that they are all the skillful means of the Tathāgata's skillful means, which really aren't the results of past hindrances.",
        "source": "T12n0346_004:0178a04_5"
    },
    {
        "source_sentence": "「復次，智上！",
        "translation": "Furthermore, Zhixiang!",
        "source": "T12n0346_004:0178a05_6"
    },
    {
        "source_sentence": "我念昔為菩薩時，彼提婆達多在在處處常隨於我。",
        "translation": "When I was a bodhisattva in the past, I remembered that Devadatta always followed me everywhere.",
        "source": "T12n0346_004:0178a05_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0346_004:0178a06_8"
    },
    {
        "source_sentence": "彼提婆達多雖來我所伺求嬈害，而能令我圓滿六波羅蜜多、能令無量眾生得大利益，",
        "translation": "Even though Devadatta comes to me in order to harm me, he can cause me to fulfill the six perfections and enable measureless sentient beings to attain great benefit.",
        "source": "T12n0346_004:0178a07_9"
    },
    {
        "source_sentence": "所謂若時欲令眾生得大快樂，我不能行布施攝法，提婆達多即來我所乞妻子、奴婢、頭、目、手、足，",
        "translation": "It means that if I sometimes want to cause sentient beings to attain great happiness but can't practice the collected teaching of generosity, Devadatta will come to me and beg for my wife, servants, head, eyes, hands, feet, or legs.",
        "source": "T12n0346_004:0178a09_10"
    },
    {
        "source_sentence": "我於爾時皆悉能捨。",
        "translation": "At that point, I'll be able to abandon them all.",
        "source": "T12n0346_004:0178a11_11"
    },
    {
        "source_sentence": "以能捨故，彼作是言：『如是名為難行之行，能令眾生起發善根。』",
        "translation": "Because they're able to abandon it, they say, 'Such is called an action that's difficult to practice and can cause sentient beings to give rise to good roots.'",
        "source": "T12n0346_004:0178a11_12"
    },
    {
        "source_sentence": "我作是施時，有無量眾生起愛樂心，於布施行得淨信解。",
        "translation": "When I make this gift, there are measureless sentient beings who give it with joy and desire and attain pure faith in the practice of generosity.",
        "source": "T12n0346_004:0178a13_13"
    },
    {
        "source_sentence": "又復若時我以菩提願力住淨戒行，提婆達多來詣我所欲破淨戒。",
        "translation": "Furthermore, if I were to abide in the practice of pure morality with the power of my vows for enlightenment, Devadatta would come to me and want to break the pure morality.",
        "source": "T12n0346_004:0178a14_14"
    },
    {
        "source_sentence": "我於爾時堅固不動，不壞戒行。",
        "translation": "At that point, I'll be resolute, unmoving, and not violating the precepts.",
        "source": "T12n0346_004:0178a15_15"
    },
    {
        "source_sentence": "有無量眾生見是事已，悉住清淨戒地。",
        "translation": "Countless sentient beings saw this, and they all stayed in the pure stage of morality.",
        "source": "T12n0346_004:0178a16_16"
    },
    {
        "source_sentence": "又復若時提婆達多於我起其忿恚、打、罵，我於爾時不生瞋恨，住忍辱心。",
        "translation": "Again, if Devadatta then becomes angry, beats, and scolds me, I won't become angry at that point and abide in a mind of forbearance.",
        "source": "T12n0346_004:0178a17_17"
    },
    {
        "source_sentence": "有無量眾生見是事已，皆住忍行。",
        "translation": "Countless sentient beings saw this, and they all acted with forbearance.",
        "source": "T12n0346_004:0178a19_18"
    },
    {
        "source_sentence": "所有精進、禪定、智慧等行，以提婆達多故，我皆圓滿及令無量眾生得大利益。",
        "translation": "All the practices of effort, meditation, concentration, wisdom, and so forth that I carry out because of Devadatta are all perfected by me and will cause measureless sentient beings to attain great benefit.",
        "source": "T12n0346_004:0178a19_19"
    },
    {
        "source_sentence": "「智上！",
        "translation": "Zhixiang!",
        "source": "T12n0346_004:0178a21_20"
    },
    {
        "source_sentence": "當知彼提婆達多雖於我所欲生嬈害，而能令我增長善法、為諸眾生作利益事。",
        "translation": "You should know that Devadatta, even though he wants to harm me, yet he's able to cause me to grow in good qualities and work for the benefit of sentient beings.",
        "source": "T12n0346_004:0178a21_21"
    },
    {
        "source_sentence": "是故應知，諸佛如來以善巧方便故，於諸眾生隨所施作，皆令不壞所有報應。",
        "translation": "Therefore, you should know that the buddhas and tathāgatas use skillful means to give whatever they do to sentient beings so that they don't break down their karmic retribution.",
        "source": "T12n0346_004:0178a23_22"
    },
    {
        "source_sentence": "又復如來於眾生界普遍觀察，有某眾生造如是因、得如是報，隨所觀已，",
        "translation": "Again, the Tathāgata observes all sentient beings’ realms: “Some sentient being creates such-and-such causes and receives such-and-such rewards.",
        "source": "T12n0346_004:0178a25_23"
    },
    {
        "source_sentence": "設諸方便而為化度。",
        "translation": "He sets up various methods to save them.",
        "source": "T12n0346_004:0178a27_24"
    },
    {
        "source_sentence": "「智上！",
        "translation": "Zhixiang!",
        "source": "T12n0346_004:0178a27_25"
    },
    {
        "source_sentence": "如我上說種種法門皆是最勝善巧方便，如是法門不應於彼下劣善根眾生前說。",
        "translation": "As I've explained above, the various teachings are all the most excellent skillful means, and such teachings shouldn't be explained in front of those sentient beings with inferior good roots.",
        "source": "T12n0346_004:0178a27_26"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0346_004:0178a29_27"
    },
    {
        "source_sentence": "所有眾生雖種聲聞、緣覺相應善根，而亦不能於此最勝善巧方便中如理修學。",
        "translation": "Even though all sentient beings cultivate the good roots associated with śrāvakas and pratyekbuddhas, they can't correctly cultivate these most excellent skillful means.",
        "source": "T12n0346_004:0178a29_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0346_004:0178b02_29"
    },
    {
        "source_sentence": "非法器故。",
        "translation": "It's because it's an unlawful container.",
        "source": "T12n0346_004:0178b02_30"
    },
    {
        "source_sentence": "但當為彼修菩薩法者如實宣說。",
        "translation": "It should simply be truly explained for those who cultivate the bodhisattva's teaching.",
        "source": "T12n0346_004:0178b03_0"
    },
    {
        "source_sentence": "譬如盲人，於夜分中雖有光明，亦不能見一切境相；",
        "translation": "It is like a blind man who, even though he may see light during the night, cannot see all objects and marks.",
        "source": "T12n0346_004:0178b03_1"
    },
    {
        "source_sentence": "若有目人於其夜分，得彼光明而為照耀，一切境相悉能觀見。",
        "translation": "If there's a person with eyes who obtains that light and shines it during the night, they'll be able to observe all objects and forms.",
        "source": "T12n0346_004:0178b04_2"
    },
    {
        "source_sentence": "菩薩摩訶薩亦復如是，已修菩薩最勝行法、又能具足善巧方便，所有諸佛勝行、解脫法門悉能通達。",
        "translation": "Similarly, the bodhisattva Mahāsattva has cultivated the most excellent practices of enlightening beings and is also fully endowed with skillful means. All the buddhas’ excellent practices and liberations can be comprehended by him.",
        "source": "T12n0346_004:0178b06_3"
    },
    {
        "source_sentence": "「智上！",
        "translation": "Zhixiang!",
        "source": "T12n0346_004:0178b08_4"
    },
    {
        "source_sentence": "若有志求無上菩提諸善男子、善女人，愛樂法故，縱在百千由旬之外，",
        "translation": "If there are good men and good women who aspire to unsurpassed enlightenment, even if they're beyond a hundred thousand leagues because they love the Dharma,",
        "source": "T12n0346_004:0178b08_5"
    },
    {
        "source_sentence": "若有宣說如是善巧方便法門處，而亦不怖遙遠即來聽受。",
        "translation": "If someone explains such a place of skillful means, they won't be afraid to come from afar to hear and accept it.",
        "source": "T12n0346_004:0178b10_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0346_004:0178b11_7"
    },
    {
        "source_sentence": "若人聞是法已，即得廣大光明，所行清淨，於佛法中離諸疑悔。",
        "translation": "If someone hears this teaching, they'll attain vast radiance, purify what they practice, and become free of doubt and remorse in the Buddha's teaching.",
        "source": "T12n0346_004:0178b11_8"
    },
    {
        "source_sentence": "是故當知，所有天人四眾之中，是法器者即能愛樂聽受此法；",
        "translation": "Because of this, you should know that among the fourfold assembly of gods and humans there are those who are vessels of the Dharma. They will be able to gladly hear and accept this teaching.",
        "source": "T12n0346_004:0178b13_9"
    },
    {
        "source_sentence": "非法器者雖復得聞，不生愛樂。」",
        "translation": "Even though an unenlightened vessel is heard, it doesn't give rise to pleasure.",
        "source": "T12n0346_004:0178b14_10"
    },
    {
        "source_sentence": "佛說是法時，有七萬二千眾生發阿耨多羅三藐三菩提心。",
        "translation": "When the Buddha taught this teaching, 72,000 sentient beings aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0346_004:0178b15_11"
    },
    {
        "source_sentence": "爾時，尊者阿難白佛言：「世尊！",
        "translation": "At that point, Venerable Ānanda said to the Buddha, Bhagavān!",
        "source": "T12n0346_004:0178b17_0"
    },
    {
        "source_sentence": "此經何名？",
        "translation": "What is the name of this sutra?",
        "source": "T12n0346_004:0178b17_1"
    },
    {
        "source_sentence": "我等云何受持？」",
        "translation": "How can we accept and uphold it?",
        "source": "T12n0346_004:0178b17_2"
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, Ānanda!",
        "source": "T12n0346_004:0178b18_3"
    },
    {
        "source_sentence": "此名『善巧方便波羅蜜多正法』，亦名『一切祕密最上波羅蜜多正法』。",
        "translation": "This is called the right teaching of skillful means, and it's also called the right teaching of the highest of all esoteric perfections.",
        "source": "T12n0346_004:0178b18_4"
    },
    {
        "source_sentence": "如是名字汝當受持，於後末世宣通流布，令諸眾生得大利益。」",
        "translation": "Such a name will be upheld by you, and it will be proclaimed in later generations to spread throughout the world so that sentient beings will attain great benefit.",
        "source": "T12n0346_004:0178b20_0"
    },
    {
        "source_sentence": "佛說此經已，阿難等諸聲聞，智上等諸菩薩摩訶薩，乃至世間天、人、阿修羅、乾闥婆等一切大眾，",
        "translation": "Ānanda, when the Buddha had discoursed thus: “O Ānanda! All the śrāvakas, bodhisattvas, mahāsattvas, bodhisattvas, buddhas, asuras, gandharvas, devas, humans, and other great assemblies in the world were likewise.",
        "source": "T12n0346_004:0178b22_0"
    },
    {
        "source_sentence": "聞佛所說，皆大歡喜，信受奉行。",
        "translation": "Having heard the Buddha’s exhortation, they all rejoiced greatly and accepted it with faith.",
        "source": "T12n0346_004:0178b24_1"
    },
    {
        "source_sentence": "佛說大方廣善巧方便經卷第四",
        "translation": "Foshuo dafangguang shanqiao shanqiao jing, vol. 4",
        "source": "T12n0346_004:0178b25_0"
    }
]