[
    {
        "source_sentence": "佛說如幻三昧經卷下",
        "translation": "Foshuo rui zhi sanmei jing, vol. 2",
        "source": "T12n0342_002:0144b23_0"
    },
    {
        "source_sentence": "西晉月氏國三藏竺法護譯",
        "translation": "Translated by Zhu Fahou, a translator of the Tripiṭaka of the Western Jin state of Yuezhi",
        "source": "T12n0342_002:0144b25_0"
    },
    {
        "source_sentence": "◎爾時世尊讚文殊師利曰：「善哉，善哉！",
        "translation": "It was then that the Bhagavān praised Mañjuśrī, saying, Good, good!",
        "source": "T12n0342_002:0144b26_0"
    },
    {
        "source_sentence": "乃能講論發意菩薩。",
        "translation": "He then was able to lecture on the bodhisattva who arouses his intention.",
        "source": "T12n0342_002:0144b26_1"
    },
    {
        "source_sentence": "仁已曾奉江河沙等諸佛世尊，故能暢此無極道慧。」",
        "translation": "仁已曾奉江河沙等諸佛世尊,故能暢此無極道慧。",
        "source": "T12n0342_002:0144b27_2"
    },
    {
        "source_sentence": "時舍利弗前白佛言：「向者文殊，頒宣諮嗟諸初發意菩薩之事，若有逮得無所從生法忍，",
        "translation": "Śāriputra then went before the Buddha and said to him, “O Mañjuśrī! I have entrusted you, O Mañjuśrī, with the task of exhorting those bodhisattvas who are just beginning to give rise to",
        "source": "T12n0342_002:0144b28_3"
    },
    {
        "source_sentence": "計此二者，其意等乎？」",
        "translation": "What's the point of imagining these two?",
        "source": "T12n0342_002:0144c01_4"
    },
    {
        "source_sentence": "佛言：「如是，舍利弗！",
        "translation": "The Buddha said, So it is, Śāriputra!",
        "source": "T12n0342_002:0144c02_5"
    },
    {
        "source_sentence": "誠如所云。",
        "translation": "It's really as they say.",
        "source": "T12n0342_002:0144c02_6"
    },
    {
        "source_sentence": "錠光佛時授我要決，當成無上正真之道為最正覺，於當來世無央數劫得成為佛，",
        "translation": "At the time of Dīpaṅkara Buddha, he gave me a prediction that I would attain the unsurpassed true path as the supremely perfect enlightened one and become buddha for innumerable eons to come.",
        "source": "T12n0342_002:0144c02_7"
    },
    {
        "source_sentence": "號釋迦文如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，",
        "translation": "He was called the Tathāgata Śākyamuni, the Supreme Truth, the Completely Enlightened One, the Perfectly Enlightened One, the Arhat of Knowledge and Conduct, the Well-gone One, the Understander of the World,",
        "source": "T12n0342_002:0144c04_8"
    },
    {
        "source_sentence": "號佛、世尊。",
        "translation": "They are called buddhas and world-honored ones.",
        "source": "T12n0342_002:0144c06_9"
    },
    {
        "source_sentence": "因彼發心，無所違失，應時逮得無所從生法忍。",
        "translation": "Because of their arousal of mind, there's nothing to disobey, and they should then attain the tolerance of the Dharma that doesn't arise from anything.",
        "source": "T12n0342_002:0144c06_10"
    },
    {
        "source_sentence": "是，舍利弗！",
        "translation": "Yes, Śāriputra!",
        "source": "T12n0342_002:0144c07_11"
    },
    {
        "source_sentence": "文殊師利向者所講初發意菩薩。」",
        "translation": "The first arousal of mind bodhisattva that Mañjuśrī teaches to those who are headed toward him.",
        "source": "T12n0342_002:0144c07_12"
    },
    {
        "source_sentence": "文殊白佛：「我身省察大聖說法，義之所歸，一切菩薩其發心者，名初發意。",
        "translation": "Mañjuśrī said to the Buddha, I personally examined the teaching of the great sage and what its meaning was, and it's called the first arousal of intention when all bodhisattvas aroused their minds.",
        "source": "T12n0342_002:0144c08_13"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0144c10_14"
    },
    {
        "source_sentence": "唯然，世尊！",
        "translation": "Yes, Bhagavān!",
        "source": "T12n0342_002:0144c10_15"
    },
    {
        "source_sentence": "其諸發意皆無所生，其無所生則是菩薩初發意也。」",
        "translation": "Their arousal of intention has nothing to give rise to, and the absence of anything to give rise to is the bodhisattva's first arousal of intention.",
        "source": "T12n0342_002:0144c10_16"
    },
    {
        "source_sentence": "說是語時，二萬三千人立不退轉地，當成無上正真之道，五千比丘得無起餘漏盡意解，",
        "translation": "When he uttered these words, twenty-three thousand monks established the stage of nonregression and became on the unsurpassed true path. Five thousand monks attained the liberation of mind freed from all impure influences without producing anything else",
        "source": "T12n0342_002:0144c11_17"
    },
    {
        "source_sentence": "六萬天子遠塵離垢、諸法眼淨。",
        "translation": "Sixty thousand celestial beings are far removed from the dust and dirt, and their Dharma eye is pure.",
        "source": "T12n0342_002:0144c13_18"
    },
    {
        "source_sentence": "於是耆年大迦葉前白佛言：「文殊師利所為甚難甚難，今說經典開化饒益若干眾生。」",
        "translation": "The elder Mahākāśyapa then went to the Buddha and said, Mañjuśrī's task is so difficult and difficult that now he teaches the sūtras to enlighten and benefit many sentient beings.",
        "source": "T12n0342_002:0144c15_0"
    },
    {
        "source_sentence": "文殊師利謂大迦葉：「我之所作，不為甚難。",
        "translation": "Mañjuśrī said to Mahākāśyapa, It won't be very difficult for me to do it.",
        "source": "T12n0342_002:0144c16_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0144c17_2"
    },
    {
        "source_sentence": "一切諸法皆無所作、非作非不作。",
        "translation": "All dharmas are unmanifest, neither created nor unmanifest.",
        "source": "T12n0342_002:0144c18_3"
    },
    {
        "source_sentence": "唯，大迦葉！",
        "translation": "Yes, Mahākāśyapa!",
        "source": "T12n0342_002:0144c18_4"
    },
    {
        "source_sentence": "我於諸法無作不作，亦無所捨，不度眾生，亦無所縛。",
        "translation": "I don't do anything, don't do anything, don't abandon anything, don't save sentient beings, and don't bind anything.",
        "source": "T12n0342_002:0144c19_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0144c20_6"
    },
    {
        "source_sentence": "眾生之黨，本無明故，成為眾生，故非甚難。",
        "translation": "Because the faction of sentient beings is originally ignorant, it doesn't become sentient beings, so it's not very difficult.",
        "source": "T12n0342_002:0144c20_7"
    },
    {
        "source_sentence": "向者迦葉宣言：『甚難。』",
        "translation": "The former Kāśyapa declared, 'It's very difficult.'",
        "source": "T12n0342_002:0144c21_8"
    },
    {
        "source_sentence": "吾身所作，無有甚難，亦無不難；",
        "translation": "Whatever I do, there is neither too difficult nor too difficult.",
        "source": "T12n0342_002:0144c21_9"
    },
    {
        "source_sentence": "非如來，非緣覺，非聲聞。",
        "translation": "They aren't tathāgatas, aren't pratyekbuddhas, and aren't śrāvakas.",
        "source": "T12n0342_002:0144c22_10"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T12n0342_002:0144c23_11"
    },
    {
        "source_sentence": "欲知談說甚難，欲宣至誼，凡夫所作，乃為奇異，名之甚難。",
        "translation": "They want to know that it's very difficult to talk, and they want to proclaim its supreme meaning, but what ordinary people do is rare and strange, which is called extremely difficult.",
        "source": "T12n0342_002:0144c23_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0144c24_13"
    },
    {
        "source_sentence": "唯然，迦葉！",
        "translation": "Yes, Kāśyapa!",
        "source": "T12n0342_002:0144c24_14"
    },
    {
        "source_sentence": "一切諸佛威神之力未曾違廢，亦不可得聲聞、緣覺、諸佛勢力，無獲無得，",
        "translation": "The mighty powers of all buddhas have never been disobeyed, nor can they attain the powers of śrāvakas, pratyekbuddhas, or buddhas, which are neither acquired nor attained.",
        "source": "T12n0342_002:0144c25_15"
    },
    {
        "source_sentence": "獨凡夫士乃逮此力。」",
        "translation": "Only ordinary people have attained this power.",
        "source": "T12n0342_002:0144c26_16"
    },
    {
        "source_sentence": "大迦葉曰：「於文殊意，所察云何？",
        "translation": "Mahākāśyapa said, What did Mañjuśrī think?",
        "source": "T12n0342_002:0144c27_17"
    },
    {
        "source_sentence": "諸佛所得，無得不得，非聲聞、非緣覺？」",
        "translation": "What's attained by the buddhas is neither attained nor attained, not by śrāvakas or pratyekbuddhas?",
        "source": "T12n0342_002:0144c27_18"
    },
    {
        "source_sentence": "文殊師利報大迦葉：「不得我身，無人、無壽、無形、無終，含血有志，",
        "translation": "Mañjuśrī replied to Mahākāśyapa, They won't obtain my body, which has no person, no life span, no form, no end, and contains blood and aspiration.",
        "source": "T12n0342_002:0144c28_19"
    },
    {
        "source_sentence": "不得斷滅有常之計，陰種諸入名色三界，應與不應，想與無想，興發報應現世後世，",
        "translation": "They cannot be abandoned through the eternalism of existence and impermanence. The aggregates, seeds, sense-fields, name-and-form, and the three realms are to be or not to be given, ideation and non-",
        "source": "T12n0342_002:0145a01_20"
    },
    {
        "source_sentence": "貪婬怒癡悉不得是。",
        "translation": "All craving, ill-will, anger, and delusion can't be like this.",
        "source": "T12n0342_002:0145a03_21"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T12n0342_002:0145a03_22"
    },
    {
        "source_sentence": "當解，取要言之，一切諸法無得不得，無所依猗，無受、無捨，不放施、無所教，",
        "translation": "You should understand that all things have no gain or loss, no basis or resting place, no sensation and no equanimity, no generosity and nothing to teach.",
        "source": "T12n0342_002:0145a03_23"
    },
    {
        "source_sentence": "亦無近、無所授、無所解。",
        "translation": "Nor is there anything near, nothing to teach, and nothing to understand.",
        "source": "T12n0342_002:0145a05_24"
    },
    {
        "source_sentence": "是故，迦葉！",
        "translation": "Therefore, Kāśyapa!",
        "source": "T12n0342_002:0145a06_0"
    },
    {
        "source_sentence": "當曉了此，諸凡夫士，不聞誼者乃有所得，諸佛世尊實無所得，是故所作不為甚難。",
        "translation": "You should understand that it's really ungraspable for ordinary people who don't hear the words, and therefore what they do isn't very difficult.",
        "source": "T12n0342_002:0145a06_1"
    },
    {
        "source_sentence": "諸佛、聲聞悉無造作，凡夫所為而不可及。",
        "translation": "The buddhas and śrāvakas all lack creation, which is uncommon for ordinary people to do.",
        "source": "T12n0342_002:0145a08_2"
    },
    {
        "source_sentence": "為何所作？",
        "translation": "What does it do?",
        "source": "T12n0342_002:0145a09_3"
    },
    {
        "source_sentence": "為斷滅，為計常，多所猗著，慇懃求願，心懷眾念，作與不作，或舉或下，",
        "translation": "In order to eliminate them and to think of them as eternal, they have many attachments. They earnestly seek enlightenment, but their minds harbor thoughts of doing and not doing, either upholding or downward.",
        "source": "T12n0342_002:0145a09_4"
    },
    {
        "source_sentence": "分別講說，妄想猗著，愁慼悒悒，而念免害。",
        "translation": "They discriminate and teach, deludedly conceiving of attachment, grief, and mindfulness to avoid harm.",
        "source": "T12n0342_002:0145a10_5"
    },
    {
        "source_sentence": "稽首自歸諸佛世尊，不作、不為，亦無所著，愚唯為此。",
        "translation": "They bow their heads in homage to the buddhas and world-honored ones, not doing or not doing anything, and they don't cling to anything; folly is only for this reason.",
        "source": "T12n0342_002:0145a12_0"
    },
    {
        "source_sentence": "是故所作，不以為難。」",
        "translation": "Therefore, what I've done isn't considered difficult.",
        "source": "T12n0342_002:0145a13_1"
    },
    {
        "source_sentence": "文殊師利前白佛言：「所謂無所生，其誼云何？",
        "translation": "Mañjuśrī went before the Buddha and said to him, What's the meaning of the so-called nonarising?",
        "source": "T12n0342_002:0145a13_2"
    },
    {
        "source_sentence": "為何謂乎？",
        "translation": "What's meant by that?",
        "source": "T12n0342_002:0145a14_3"
    },
    {
        "source_sentence": "云何菩薩逮得無所從生法忍？」",
        "translation": "How does a bodhisattva attain the tolerance of the Dharma that arises from nothing?",
        "source": "T12n0342_002:0145a14_4"
    },
    {
        "source_sentence": "佛告文殊：「計於諸法，無能逮得。",
        "translation": "The Buddha told Mañjuśrī, There are no dharmas that can be apprehended in terms of their number.",
        "source": "T12n0342_002:0145a15_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0145a16_6"
    },
    {
        "source_sentence": "有所得者則墮顛倒，無所得者乃逮無所從生法忍。",
        "translation": "Those who attain it will fall into error, and those who don't attain it will acquire the tolerance of the Dharma that arises from nothing.",
        "source": "T12n0342_002:0145a16_7"
    },
    {
        "source_sentence": "是故無所得者，乃謂為得。",
        "translation": "Therefore, someone who doesn't attain anything is called attaining it.",
        "source": "T12n0342_002:0145a17_8"
    },
    {
        "source_sentence": "無得、無著、無依、無猗，心如虛空，[火*霍]然無迹，是乃名曰無所從生法忍。",
        "translation": "The mind has no attainment, no attachment, no basis, and no peace, and its mind is like space, [hao] but without traces, which is called the tolerance of the Dharma that arises from nothing.",
        "source": "T12n0342_002:0145a18_9"
    },
    {
        "source_sentence": "一切諸法無所生者，諸法無主，乃曰法忍。",
        "translation": "All dharmas lack anything to give rise to, and the dharmas lack an owner, which is called forbearance of dharmas.",
        "source": "T12n0342_002:0145a19_10"
    },
    {
        "source_sentence": "於一切法，無所依猗，無求、無望，諸法無進、無退，無雙、無隻，乃曰法忍。",
        "translation": "In all dharmas, there's nothing to rely on, no seeking and no hope, no advancement and no retreat, no pair and no boat of dharmas, and it's called the Dharma forbearance.",
        "source": "T12n0342_002:0145a20_11"
    },
    {
        "source_sentence": "諸法無形，離於自然，無壞無斷，無識無塵，無言無辭，空無想願，乃曰法忍。",
        "translation": "All dharmas lack form, are free of nature, lack destruction and cessation, lack consciousness and dust, lack words and phrases, lack emptiness and perception and vows, and are called the Dharma forbearance.",
        "source": "T12n0342_002:0145a22_12"
    },
    {
        "source_sentence": "諸法離欲，寂然憺怕，法界無本，立在本際，無應不應，無想不想，無念無說，",
        "translation": "All dharmas are free from desire, tranquil and fearless, the Dharma realm has no basis, is established in its original state, there’s nothing that should be or shouldn’t be done, has no ideation or non-thought, has no thought",
        "source": "T12n0342_002:0145a24_13"
    },
    {
        "source_sentence": "無惟無思，無作無力，悉以羸劣，虛無恍惚，無固無永，無淨不淨，非常苦空，",
        "translation": "They are without ideation, without thought, without action, and without power, all because of weakness. They are neither empty nor in a state of confusion, neither fixed nor eternal, neither pure nor impure; they are unchangingly painful",
        "source": "T12n0342_002:0145a25_14"
    },
    {
        "source_sentence": "無我寂然，猶如幻化、夢中所見、影響、野馬、芭蕉、聚沫、水中之泡，",
        "translation": "The absence of self is like an illusion, like the magical creations seen in a dream, like wild horses, plantains, bubbles, and bubbles in water.",
        "source": "T12n0342_002:0145a27_15"
    },
    {
        "source_sentence": "忍解諸法為若茲也。",
        "translation": "Forbearance understands all dharmas as if they are like this.",
        "source": "T12n0342_002:0145a28_16"
    },
    {
        "source_sentence": "所可忍者，亦無所忍，一切諸法無法非法，無有異法，亦無他趣，照曜諸法，",
        "translation": "What can be tolerated is also not tolerated. All things are neither lawful nor unlawful, there are no dissimilar things, and there are no other destinies. It illumines all things.",
        "source": "T12n0342_002:0145a29_17"
    },
    {
        "source_sentence": "所解如是。",
        "translation": "What's understood is thus.",
        "source": "T12n0342_002:0145b01_18"
    },
    {
        "source_sentence": "觀此諸法名本淨恍惚，知之空無，是謂為忍。",
        "translation": "Observing that these things are called originally pure and deluded, knowing that they are empty and nonexistent, this is called forbearance.",
        "source": "T12n0342_002:0145b02_19"
    },
    {
        "source_sentence": "篤無信樂，度於氾流，不懷狐疑，不恐不懼，亦無所畏，修身正行，永不得身，",
        "translation": "They are devoid of faith and eager to save others from the floods. They do not harbor doubt or misgiving, they are neither frightened nor terrified, and have no fear. They cultivate their bodily practice in accordance with proper conduct",
        "source": "T12n0342_002:0145b03_20"
    },
    {
        "source_sentence": "不見空宅是。",
        "translation": "They don't see that it's an empty house.",
        "source": "T12n0342_002:0145b04_21"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0342_002:0145b05_22"
    },
    {
        "source_sentence": "菩薩所逮無所從生法忍，未曾廢捨一切諸想。」",
        "translation": "The bodhisattva attains the tolerance of the Dharma that arises from nothing and never abandons all conceptions.",
        "source": "T12n0342_002:0145b05_23"
    },
    {
        "source_sentence": "文殊師利復白佛言：「所謂忍者，無所毀傷，乃曰法忍。」",
        "translation": "Mañjuśrī then said to the Buddha, The so-called ninja doesn't disparage anything, but it's called tolerance of the Dharma.",
        "source": "T12n0342_002:0145b06_24"
    },
    {
        "source_sentence": "善住意天子問文殊師利：「何謂毀傷法？」",
        "translation": "The well-abiding celestial prince asked Mañjuśrī, What's meant by disparaging the Dharma?",
        "source": "T12n0342_002:0145b07_25"
    },
    {
        "source_sentence": "文殊答曰：「天子！",
        "translation": "Mañjuśrī answered, Son of God!",
        "source": "T12n0342_002:0145b08_26"
    },
    {
        "source_sentence": "欲知眼所毀傷可不可色，耳聲、鼻香、舌味、身更、意所思念可不可法。",
        "translation": "They want to know that what's disparaged by the eye can be unfathomable, and what's heard by the ear, smelled by the nose, smelled by the tongue, smelled by the body, and thought by the mind can be un",
        "source": "T12n0342_002:0145b08_27"
    },
    {
        "source_sentence": "假使，天子！",
        "translation": "Suppose, my lord!",
        "source": "T12n0342_002:0145b10_28"
    },
    {
        "source_sentence": "若有菩薩，眼見色者，永無想受，不別好醜，不懷思想，無應不應，無增無損，",
        "translation": "“If there is a bodhisattva whose eye sees form, it has no ideation or sensation at all. It does not discriminate good or bad, neither harbors thoughts, neither responds nor doesn’t respond, neither increases nor decrease",
        "source": "T12n0342_002:0145b10_29"
    },
    {
        "source_sentence": "曉了本淨，而達空慧，不念曉了，不為眾色之所毀傷；",
        "translation": "Their understanding is inherently pure, yet they comprehend emptiness with wisdom. They are not attached to understanding or slandered by all forms.",
        "source": "T12n0342_002:0145b12_30"
    },
    {
        "source_sentence": "耳、鼻、口、身、意亦復如是，而於六情無所毀傷，悉無所著。",
        "translation": "Their ears, nose, mouth, body, and mind are likewise, yet they don't disparage the six emotions, and they all have no attachment.",
        "source": "T12n0342_002:0145b13_31"
    },
    {
        "source_sentence": "此菩薩者，立於法忍，於諸生法不有妄想，於無生法亦不無想，於諸漏法亦不懷想，",
        "translation": "“These enlightening beings establish patience regarding phenomena, not entertaining deluded thoughts about things that arise. They also do not entertain thoughts about things that are unarisen, and they do not harbor thoughts about impure things.",
        "source": "T12n0342_002:0145b14_32"
    },
    {
        "source_sentence": "於無漏法亦不無想，不想罪法、不想無罪，不念有為法、不想無為法，",
        "translation": "Nor are they without ideation the pure dharmas; they don’t think of sins as sins and sinlessness as sins, and they don’t think of conditioned dharmas or unconditioned dharmas.",
        "source": "T12n0342_002:0145b16_33"
    },
    {
        "source_sentence": "不念世法、不念度世法，於此諸法無想念者，是為逮得無所從生法忍。」",
        "translation": "Not being mindful of worldly dharmas and not mindful of worldly dharmas, and having no thoughts about these dharmas, this is the way to attain the patience of the Dharma that arises from nothing.",
        "source": "T12n0342_002:0145b18_34"
    },
    {
        "source_sentence": "說是法時，六萬三千人皆發無上正真道意，萬二千菩薩逮得無所從生法忍。",
        "translation": "When he taught this teaching, 63,000 people all aroused the intention for the unsurpassed true path, and 12,000 bodhisattvas attained the tolerance of the Dharma that arises from nothing.",
        "source": "T12n0342_002:0145b19_35"
    },
    {
        "source_sentence": "於是善住意天子問文殊師利：「所謂學道入道地者，為何謂乎？」",
        "translation": "The well-abiding celestial son then asked Mañjuśrī, What's meant by so-called someone who trains in the path and enters the ground of the path?",
        "source": "T12n0342_002:0145b22_0"
    },
    {
        "source_sentence": "文殊師利告天子曰：「今仁者問入道地乎？」",
        "translation": "Mañjuśrī told the celestial prince, Now, is that kindness asking about entering the path?",
        "source": "T12n0342_002:0145b23_1"
    },
    {
        "source_sentence": "天子報曰：「願欲聞知菩薩道地。",
        "translation": "The celestial prince replied, May I hear about the bodhisattva's path?",
        "source": "T12n0342_002:0145b24_2"
    },
    {
        "source_sentence": "文殊常說有十道地，無此誼耶？」",
        "translation": "Mañjuśrī always said that there are the ten paths, but isn't there this meaning?",
        "source": "T12n0342_002:0145b25_3"
    },
    {
        "source_sentence": "文殊又報：「向者問入道地乎？」",
        "translation": "Mañjuśrī also replied, Did you ask him about entering the path?",
        "source": "T12n0342_002:0145b25_4"
    },
    {
        "source_sentence": "天子答曰：「菩薩不入十道地也。」",
        "translation": "The celestial replied, A bodhisattva doesn't enter the ten paths.",
        "source": "T12n0342_002:0145b26_5"
    },
    {
        "source_sentence": "文殊報曰：「不聞世尊說一切法猶如幻化。",
        "translation": "Mañjuśrī replied, I haven't heard the Bhagavān teach that all dharmas are like illusory transformations.",
        "source": "T12n0342_002:0145b27_6"
    },
    {
        "source_sentence": "為信此不？」",
        "translation": "Is it because you believe in this?",
        "source": "T12n0342_002:0145b28_7"
    },
    {
        "source_sentence": "答曰：「信耳。」",
        "translation": "He replied, Believe it.",
        "source": "T12n0342_002:0145b28_8"
    },
    {
        "source_sentence": "文殊報曰：「幻師所化，豈有道地具十住乎？」",
        "translation": "Mañjuśrī replied, Is there a place of enlightenment that has the ten abodes?",
        "source": "T12n0342_002:0145b28_9"
    },
    {
        "source_sentence": "天子答曰：「不也，設幻師化有所至到、有所入者，吾亦當住。",
        "translation": "The celestial replied, No, if there's an illusory teacher who teaches something that reaches and enters, I will also stay.",
        "source": "T12n0342_002:0145b29_10"
    },
    {
        "source_sentence": "世尊頒宣一切諸法悉如幻化，故無所入。",
        "translation": "The Bhagavān proclaims that all dharmas are illusory, so there's nothing to enter.",
        "source": "T12n0342_002:0145c01_11"
    },
    {
        "source_sentence": "假使，天子！",
        "translation": "Suppose, my lord!",
        "source": "T12n0342_002:0145c02_12"
    },
    {
        "source_sentence": "欲得講說入道地者，當說無入、無所至到。",
        "translation": "Those who want to teach about the stage of entering the path will explain that there's no entry and nothing to reach.",
        "source": "T12n0342_002:0145c03_13"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0145c04_0"
    },
    {
        "source_sentence": "一切諸法皆無所入，法不至法，色不入痛，痛不入色，想不入行，行不入想，",
        "translation": "All dharmas have no entry, and the Dharma doesn’t reach the Dharma; form doesn’t enter pain; pain doesn’t enter form; perception doesn’t enter volition; volition doesn’t enter perception.",
        "source": "T12n0342_002:0145c04_1"
    },
    {
        "source_sentence": "識不入色，色不入識。",
        "translation": "Consciousness doesn't enter form, and form doesn't enter consciousness.",
        "source": "T12n0342_002:0145c05_2"
    },
    {
        "source_sentence": "取要言之，皆是四種、四大所成，眼不入耳，耳不入眼，鼻、口、身、意亦復如是。",
        "translation": "To summarize, they are all formed by the four kinds and the four elements: eye doesn't enter ear, ear doesn't enter eye, and so it is with nose, mouth, body, and mind.",
        "source": "T12n0342_002:0145c06_3"
    },
    {
        "source_sentence": "身不入意，意不入身。",
        "translation": "Body doesn't enter mind, and mind doesn't enter body.",
        "source": "T12n0342_002:0145c08_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0145c08_5"
    },
    {
        "source_sentence": "是諸法者所趣各異，境界殊別，愚騃無想，無所識別，瑕穢態礙，譬如草木、瓦石、牆壁、影響之數，",
        "translation": "These dharmas are different in their aim, different in their objects, different in their objective realms, ignorant and without ideation, not distinguishing anything, like grass, trees, tile, stones, walls, influences, etc.",
        "source": "T12n0342_002:0145c08_6"
    },
    {
        "source_sentence": "而無言辭，則一種相，故無所入，無來無去。",
        "translation": "Without words, there's one kind of characteristic, so there's nothing to enter, and there's no coming or going.",
        "source": "T12n0342_002:0145c10_7"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T12n0342_002:0145c11_8"
    },
    {
        "source_sentence": "當知，若有菩薩解法如此，則於諸法無入不入，無想不想，不見入道，",
        "translation": "You should know that if there is a bodhisattva who understands the teaching in this way, then he enters and doesn’t enter any doctrine; he has no ideation or non-thought; he doesn’t see entry into the path.",
        "source": "T12n0342_002:0145c11_9"
    },
    {
        "source_sentence": "不捨道地，於無上正真道而不退轉。",
        "translation": "They don't abandon the stage of the path, and they don't regress from the unsurpassed true path.",
        "source": "T12n0342_002:0145c13_10"
    },
    {
        "source_sentence": "無所入者，住無失法。",
        "translation": "Someone who enters without anything abides in the principle of no loss.",
        "source": "T12n0342_002:0145c14_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0145c14_12"
    },
    {
        "source_sentence": "陰種諸入皆為自然，不失一切眾生真正清淨，是為菩薩入於道地。",
        "translation": "The aggregates, seeds, and sense-fields are all natural, and they don't lose the true purity of all sentient beings; this is how a bodhisattva enters the stage of the path.",
        "source": "T12n0342_002:0145c15_0"
    },
    {
        "source_sentence": "譬如幻師化作十重交絡棚閣，其時幻師化作化人，遍處其上。",
        "translation": "It's like an illusionist who transforms into a ten-story interlocking pavilion, and then an illusionist transforms into a transformation person and pervades it.",
        "source": "T12n0342_002:0145c16_1"
    },
    {
        "source_sentence": "於天子意，所志云何？",
        "translation": "What do you think, prince of gods?",
        "source": "T12n0342_002:0145c18_0"
    },
    {
        "source_sentence": "豈為有人處在重閣若入者不？」",
        "translation": "Isn't there a person in the heavy pavilion who enters it?",
        "source": "T12n0342_002:0145c18_1"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T12n0342_002:0145c19_2"
    },
    {
        "source_sentence": "文殊師利報天子曰：「菩薩十地當作是觀，亦如幻化。」",
        "translation": "Mañjuśrī replied to the celestial being, A bodhisattva in the tenth ground should contemplate like this, which is also illusory transformation.",
        "source": "T12n0342_002:0145c19_3"
    },
    {
        "source_sentence": "善住意天子問文殊師利曰：「假使人來欲得出家為沙門者，當何以化？",
        "translation": "The well-abiding celestial prince asked Mañjuśrī, Suppose someone comes to leave home and become a monk, how will they be transformed?",
        "source": "T12n0342_002:0145c20_4"
    },
    {
        "source_sentence": "何除鬚髮？",
        "translation": "What's except for the hair on your beard?",
        "source": "T12n0342_002:0145c22_5"
    },
    {
        "source_sentence": "何受具戒？",
        "translation": "How is it possible to receive the full set of precepts?",
        "source": "T12n0342_002:0145c22_6"
    },
    {
        "source_sentence": "云何教授令自謹慎？」",
        "translation": "How do you teach and cause yourself to be disciplined?",
        "source": "T12n0342_002:0145c22_7"
    },
    {
        "source_sentence": "文殊師利報善住意天子：「設使有人來詣我所為沙門者，夫族姓子若不發心欲得出家，",
        "translation": "Mañjuśrī replied to the well-abiding celestial being, Suppose someone comes to me and becomes a monk.",
        "source": "T12n0342_002:0145c23_8"
    },
    {
        "source_sentence": "我乃令卿作沙門耳。",
        "translation": "I ordered you to become an ascetic.",
        "source": "T12n0342_002:0145c25_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0145c25_10"
    },
    {
        "source_sentence": "其有建志欲出家者，心無所歸；",
        "translation": "Those who have set their minds on leaving the householder’s life will have no place to turn in their thoughts.",
        "source": "T12n0342_002:0145c25_11"
    },
    {
        "source_sentence": "其無所歸，亦無有來；",
        "translation": "There is no refuge for them, and they have no coming.",
        "source": "T12n0342_002:0145c26_12"
    },
    {
        "source_sentence": "其無從來，則無往者；",
        "translation": "If there is no source, there will be no destination.",
        "source": "T12n0342_002:0145c27_13"
    },
    {
        "source_sentence": "住一切法，無所斷絕，則住無本；",
        "translation": "If you abide in all things and have nothing to cut off, then you abide in the absence of foundation.",
        "source": "T12n0342_002:0145c27_14"
    },
    {
        "source_sentence": "其住無本，遊於法界而不動轉；",
        "translation": "He dwelled in the realm of reality without foundation and traveled throughout the cosmos unmoving.",
        "source": "T12n0342_002:0145c28_15"
    },
    {
        "source_sentence": "其於法界無所動者，則不得心；",
        "translation": "Those who are unmoving in the realm of reality do not attain mind.",
        "source": "T12n0342_002:0145c28_16"
    },
    {
        "source_sentence": "其不得心，不願出家；",
        "translation": "They do not wish to renounce the householder’s life.",
        "source": "T12n0342_002:0145c29_17"
    },
    {
        "source_sentence": "其不願出家，則不發心為沙門也。",
        "translation": "If he doesn't want to leave home, then he won't give rise to the intention to become a monk.",
        "source": "T12n0342_002:0146a01_18"
    },
    {
        "source_sentence": "其不發心為沙門者，則無所生；",
        "translation": "If someone doesn’t give rise to the intention to become a śramaṇa, nothing will arise.",
        "source": "T12n0342_002:0146a01_19"
    },
    {
        "source_sentence": "其無所生，則盡眾苦；",
        "translation": "Nothing is produced, and all suffering is extinguished.",
        "source": "T12n0342_002:0146a02_20"
    },
    {
        "source_sentence": "其盡眾苦，則究竟盡；",
        "translation": "To extinguish all kinds of suffering, they ultimately end it.",
        "source": "T12n0342_002:0146a03_21"
    },
    {
        "source_sentence": "其究竟盡，則無所盡；",
        "translation": "When they are ultimately exhausted, there is nothing to be exhausted.",
        "source": "T12n0342_002:0146a03_22"
    },
    {
        "source_sentence": "無所盡者，則不可盡；",
        "translation": "What is inexhaustible cannot be exhausted.",
        "source": "T12n0342_002:0146a04_0"
    },
    {
        "source_sentence": "其不可盡，此無所行。",
        "translation": "They can't be exhausted, and there's nothing to do here.",
        "source": "T12n0342_002:0146a04_1"
    },
    {
        "source_sentence": "天子解是，當為其人解如此義，其詣我所求欲出家，語族姓子：『勿得發心作沙門也。』",
        "translation": "If the celestial son understands this, he'll understand this meaning for that person. They come to me seeking to leave home and say to the clansman, 'Don't give rise to the intention to become a monk.'",
        "source": "T12n0342_002:0146a04_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0146a06_3"
    },
    {
        "source_sentence": "心本無起，便離闇冥。」",
        "translation": "When the mind doesn't arise in the first place, it's free of darkness.",
        "source": "T12n0342_002:0146a07_4"
    },
    {
        "source_sentence": "文殊師利復謂善住意：「假使有人來詣我所求欲出家，吾當為說：『卿族姓子！",
        "translation": "Mañjuśrī again said to the well-abiding man, Suppose someone comes to me and asks for permission to leave home, and I'll tell them, 'Your family!",
        "source": "T12n0342_002:0146a07_5"
    },
    {
        "source_sentence": "不除鬚髮，乃為善備沙門之業。』」",
        "translation": "If you don't remove your hair and beard, it's a good preparation for the ascetic's work.'",
        "source": "T12n0342_002:0146a09_6"
    },
    {
        "source_sentence": "善住意問文殊師利：「所言何謂？」",
        "translation": "The well-abiding mind asked Mañjuśrī, What's the meaning of what you say?",
        "source": "T12n0342_002:0146a10_7"
    },
    {
        "source_sentence": "文殊答曰：「如來說法，無所除去，亦無所壞。」",
        "translation": "Mañjuśrī answered, When the Tathāgata teaches the Dharma, there's nothing to remove and nothing to destroy.",
        "source": "T12n0342_002:0146a10_8"
    },
    {
        "source_sentence": "又問：「何所不除？」",
        "translation": "Again, he asked, What's not removed?",
        "source": "T12n0342_002:0146a11_9"
    },
    {
        "source_sentence": "答曰：「不除於色，亦無所壞，不除痛、想、行、識，亦無所壞。",
        "translation": "Answer: It doesn't remove form, and nothing is destroyed; it doesn't remove pain, perception, volition, or consciousness, and nothing is destroyed.",
        "source": "T12n0342_002:0146a12_10"
    },
    {
        "source_sentence": "假使念言：『我除鬚髮。』",
        "translation": "Suppose someone thinks, 'I'll remove my hair and beard.'",
        "source": "T12n0342_002:0146a13_11"
    },
    {
        "source_sentence": "則住吾我，計己有身；",
        "translation": "They then abide in self, imagining themselves to have bodies.",
        "source": "T12n0342_002:0146a13_12"
    },
    {
        "source_sentence": "不計吾我，不自貪身，則平等見也。",
        "translation": "If someone doesn't think of themselves as self and doesn't cling to their own body, then they'll see equality.",
        "source": "T12n0342_002:0146a14_13"
    },
    {
        "source_sentence": "貪著己身，乃計鬚髮，則成眾生。",
        "translation": "If they cling to their own bodies, then they'll think of their hair as sentient beings.",
        "source": "T12n0342_002:0146a15_0"
    },
    {
        "source_sentence": "想念除去，其不得我，不得他人，不我不彼，則無吾我；",
        "translation": "When thoughts and thoughts are eliminated, they do not acquire a self or another self. If one does not deny the self of others, then there is no self.",
        "source": "T12n0342_002:0146a15_1"
    },
    {
        "source_sentence": "其無吾我，不計有身，則除鬚髮。",
        "translation": "If they don't think of self as a body, then they'll remove their hair and beard.",
        "source": "T12n0342_002:0146a16_2"
    },
    {
        "source_sentence": "無思無想，其無思想，無應不應，不住若干；",
        "translation": "The absence of thought and the absence of ideation, their absence of thought, neither to be nor not to be; they do not abide in any number.",
        "source": "T12n0342_002:0146a17_3"
    },
    {
        "source_sentence": "其不住若干，則無言教；",
        "translation": "If they do not abide in one or the other, there is no discourse.",
        "source": "T12n0342_002:0146a18_4"
    },
    {
        "source_sentence": "其無言教，無進不進，無雙無隻，不貪己身，不被袈裟。",
        "translation": "They have no words or teachings, no advancement or non-advancement, no pairs or boats, no craving for their own body, and no robes.",
        "source": "T12n0342_002:0146a19_5"
    },
    {
        "source_sentence": "其袈裟者(晉言無穢垢)，其無穢垢則無所有，其無所有則無所住，其無所住則為曠然。",
        "translation": "The monk's robe (known as undefiled in the Jin language), which is undefiled, then there's nothing to abide in, and when it has nothing to abide in, it's free.",
        "source": "T12n0342_002:0146a20_6"
    },
    {
        "source_sentence": "其曠然者，乃為出家。」",
        "translation": "Those who are in the wilderness become renunciant.",
        "source": "T12n0342_002:0146a22_7"
    },
    {
        "source_sentence": "善住意天子復問文殊：「所言思念，其思念者為何謂也？」",
        "translation": "Again, the well-abiding celestial son asked Mañjuśrī, What's meant by that which is thought?",
        "source": "T12n0342_002:0146a23_0"
    },
    {
        "source_sentence": "文殊答曰：「等於諸法，無形無名，愚戇凡夫之所興念，多所望想。",
        "translation": "Mañjuśrī answered, Equal to all dharmas, there's no form or name, and foolish worldlings give rise to thoughts that have many expectations.",
        "source": "T12n0342_002:0146a24_1"
    },
    {
        "source_sentence": "故世尊曰：『其於諸法無所興造，亦無損耗，是謂思念。』」",
        "translation": "That's why the Bhagavān said, 'There's nothing that arises or creates in dharmas, and there's nothing to lose, which is called thought.'",
        "source": "T12n0342_002:0146a25_2"
    },
    {
        "source_sentence": "又問：「何所興造？」",
        "translation": "Again, he asked, What's produced?",
        "source": "T12n0342_002:0146a26_3"
    },
    {
        "source_sentence": "答曰：「天子！",
        "translation": "He replied, Son of God!",
        "source": "T12n0342_002:0146a27_4"
    },
    {
        "source_sentence": "當平等度，以度平等，其於諸法無得不得，亦無所逮，不審不行亦無不行，",
        "translation": "In order to liberate them equally, he liberates them equally. He has no gain or loss in regard to any doctrine and nothing to grasp. He doesn’t practice what he doesn’t know and doesn’t practice what he doesn’t practice",
        "source": "T12n0342_002:0146a27_5"
    },
    {
        "source_sentence": "於此諸法不興等住，不想吾我，亦復不著人、壽命、識。",
        "translation": "They don't abide equally in these things, don't think of self or self, and don't cling to people, life, or consciousness.",
        "source": "T12n0342_002:0146a29_6"
    },
    {
        "source_sentence": "眾生可意，斷滅計常，陰種諸入，想佛法眾，亦復不念是戒是毀，塵勞顛倒造立果證，",
        "translation": "Sentient beings are desirable, annihilating and imagining permanence, the aggregates and seeds of all sense-fields, perceiving the Buddha and Dharma as sentient beings. Again, they don’t think that morality",
        "source": "T12n0342_002:0146b01_7"
    },
    {
        "source_sentence": "望想求度，道跡往來，不還無著，望想緣覺，猗著正覺，是善是惡，是罪是福，",
        "translation": "They look to conceptualization and seek liberation, following the steps of the path, going and coming, not returning or regressing, without attachment. They look to conceptualization as a pratyekabuddha, being attached to right awakening, which is",
        "source": "T12n0342_002:0146b03_8"
    },
    {
        "source_sentence": "是為穿漏、是無有漏，是為俗業、是度世業，是則有為、是則無為，是則為空、無想、無願，",
        "translation": "This is transgression, this is non-transgression. This is worldly action, this is supramundane action. These are the conditioned and these are the unconditioned.",
        "source": "T12n0342_002:0146b04_9"
    },
    {
        "source_sentence": "是明無明，是為解脫，是為離欲，是為生為死，是為滅度。",
        "translation": "This is insight and nescience, which is liberation, which is freedom from desire, which is birth and death, and which is cessation.",
        "source": "T12n0342_002:0146b06_10"
    },
    {
        "source_sentence": "興造如此若干種想，如是行法修道若斯，愚戇凡夫之所念也，貢高自大癡夫所為也。",
        "translation": "They give rise to various kinds of thoughts like this, thus practicing the teaching and cultivating such practices, which are thought of by foolish worldlings and arrogantly exalting themselves as being done by great deluded people.",
        "source": "T12n0342_002:0146b08_11"
    },
    {
        "source_sentence": "是等為魔及與官屬所見陰蓋，是故如來為此黨類演出言辭，令除鬚髮，",
        "translation": "These are the aggregates that Māra and his officials see. Therefore, the Tathāgata speaks words for these groups of people so that they will remove their hair and beard.",
        "source": "T12n0342_002:0146b10_0"
    },
    {
        "source_sentence": "去於五陰，奉修五品，戒定慧，解度知見品。」",
        "translation": "He removes the five aggregates, cultivates the five classes, observes morality, concentration, wisdom, liberation, and the class of knowing and seeing.",
        "source": "T12n0342_002:0146b11_1"
    },
    {
        "source_sentence": "於是善住意天子讚文殊師利：「善哉，善哉！",
        "translation": "The well-abiding celestial son then praised Mañjuśrī, Good, good!",
        "source": "T12n0342_002:0146b13_0"
    },
    {
        "source_sentence": "快說此言，如仁者教。」",
        "translation": "Quickly say these words, as you've been taught by a kind person.",
        "source": "T12n0342_002:0146b13_1"
    },
    {
        "source_sentence": "文殊師利復謂善住意：「假使有人來求出家，吾當謂言：『若族姓子不受具戒，",
        "translation": "Mañjuśrī again said to Supratiṣṭhita, Suppose someone comes and asks a renunciant to leave home, and I say, 'If a clansman doesn't accept the full set of precepts,",
        "source": "T12n0342_002:0146b14_2"
    },
    {
        "source_sentence": "爾乃是卿善備出家。』」",
        "translation": "You're a good preparation for leaving home.'",
        "source": "T12n0342_002:0146b16_3"
    },
    {
        "source_sentence": "又問文殊：「此言何謂？」",
        "translation": "Again, he asked Mañjuśrī, What does this mean?",
        "source": "T12n0342_002:0146b16_4"
    },
    {
        "source_sentence": "答曰：「於善住意，所趣云何？",
        "translation": "He answered, What's the goal of a well-abiding mind?",
        "source": "T12n0342_002:0146b17_5"
    },
    {
        "source_sentence": "何謂具戒？",
        "translation": "What's meant by the full set of precepts?",
        "source": "T12n0342_002:0146b17_6"
    },
    {
        "source_sentence": "具戒有二：一、正真戒，二、邪偽戒。",
        "translation": "There are two kinds of precepts: 1. the correct and true precepts, and 2. the false precepts.",
        "source": "T12n0342_002:0146b18_0"
    },
    {
        "source_sentence": "何謂邪偽？",
        "translation": "What's meant by wrong and false?",
        "source": "T12n0342_002:0146b18_1"
    },
    {
        "source_sentence": "若墮顛倒。",
        "translation": "If he falls into error, then he'll fall into delusion.",
        "source": "T12n0342_002:0146b18_2"
    },
    {
        "source_sentence": "何謂顛倒？",
        "translation": "What's meant by mistaken?",
        "source": "T12n0342_002:0146b19_3"
    },
    {
        "source_sentence": "受吾我人倚於壽命，縛著斷滅而計有常；",
        "translation": "We, the self and others, relying on longevity, are bound to annihilation and think of it as eternal.",
        "source": "T12n0342_002:0146b19_4"
    },
    {
        "source_sentence": "或墮邪見，荒婬怒癡，貪欲貢高而懷自大；",
        "translation": "Or they may fall into wrong views, wickedness, hatred, anger, and delusion. Being greedy and arrogant, they harbor their own conceit.",
        "source": "T12n0342_002:0146b20_5"
    },
    {
        "source_sentence": "或于欲界色無色界而念所受，馳逸望想，墮于起滅，證明邪迹，不別善惡宜便之法，",
        "translation": "In the realm of sexual passion, in the realm of form and in the one of formlessness, it is that which is felt by thought.",
        "source": "T12n0342_002:0146b21_6"
    },
    {
        "source_sentence": "演狂悖言不識所趣，墮於無明住眾邪見。",
        "translation": "He speaks crazy and disobediently, doesn't know where he's headed, and falls into ignorance and abides in various mistaken views.",
        "source": "T12n0342_002:0146b23_7"
    },
    {
        "source_sentence": "如是法教，背於正律名之為邪。",
        "translation": "Such a teaching of the Dharma that disobeys the correct precepts is called wrong.",
        "source": "T12n0342_002:0146b24_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0146b24_9"
    },
    {
        "source_sentence": "道空平等，其平等者，菩薩所行尚不為退。",
        "translation": "The path of emptiness is equal, and its equality is that the bodhisattva's practice isn't yet retrogressive.",
        "source": "T12n0342_002:0146b25_10"
    },
    {
        "source_sentence": "假使，天子！",
        "translation": "Suppose, my lord!",
        "source": "T12n0342_002:0146b26_11"
    },
    {
        "source_sentence": "不墮惡友，不解所歸，堅固之要，於諸所受，受不當受而行馳騁，是謂邪戒。",
        "translation": "They won't fall into bad friends, don't understand where to return, and are resolute in the essentials of what they accept and what they should or shouldn't accept, and act quickly. This is called the wrong precept.",
        "source": "T12n0342_002:0146b26_12"
    },
    {
        "source_sentence": "若問年歲及所修行，而反從人受信施食；",
        "translation": "If someone asks about years, years, and what they practice, they instead accept food given as a faith offering from someone else.",
        "source": "T12n0342_002:0146b28_13"
    },
    {
        "source_sentence": "又從異人出家為沙門者，求其迎逆稽首禮節，不能除滅婬怒癡冥，是為邪戒。",
        "translation": "Also, if someone leaves home and becomes a monk from another person and asks to be greeted by them or pays homage with respect, but they can't remove the darkness of anger, anger, and delusion, this is a wrong",
        "source": "T12n0342_002:0146b29_14"
    },
    {
        "source_sentence": "何謂正戒？",
        "translation": "By what is right morality meant?",
        "source": "T12n0342_002:0146c01_15"
    },
    {
        "source_sentence": "假使修正不想平等，是謂正戒；",
        "translation": "This is reckoned to be right morality.",
        "source": "T12n0342_002:0146c02_16"
    },
    {
        "source_sentence": "一切諸法解之如空、無想、無願，是謂正戒；",
        "translation": "Understanding all things as emptiness, without ideation or wishing for anything—this is right discipline.",
        "source": "T12n0342_002:0146c02_17"
    },
    {
        "source_sentence": "於三脫門而不造證，奉行審諦，無想不想、無應不應，是謂正戒。」",
        "translation": "Not realizing the three gates of liberation and adhereing to the principle of scrutiny, without ideation or non-thought, and without response or non-should, is called right precept.",
        "source": "T12n0342_002:0146c03_18"
    },
    {
        "source_sentence": "文殊師利告善住意：「設使處婬怒癡無明恩愛，墮於貪身六十二見，或四顛倒、三品惡行、八邪九惱、九神止處、十不善業，",
        "translation": "Mañjuśrī told Shanjoli, Suppose someone is in the midst of lust, anger, delusion, ignorance, kindness, and love, falling into the sixty-two views of the body of greed, or four mistaken",
        "source": "T12n0342_002:0146c06_0"
    },
    {
        "source_sentence": "雖在其中而無所著，是謂正戒。",
        "translation": "Even though they are there, they don't cling to anything, which is called right precepts.",
        "source": "T12n0342_002:0146c08_1"
    },
    {
        "source_sentence": "譬如一切萬物百穀草木眾藥所生，皆因地出，而得長養，其地坦然無所念置，",
        "translation": "It is as if all the myriad things that grow from a hundred grains, plants, trees, and herbs came forth from the earth to nourish themselves. The earth remained unmoving without any thought whatsoever.",
        "source": "T12n0342_002:0146c09_2"
    },
    {
        "source_sentence": "亦不念言：『我所茂盛。』",
        "translation": "Nor does he think, 'I'm flourishing.'",
        "source": "T12n0342_002:0146c11_3"
    },
    {
        "source_sentence": "如是，天子！",
        "translation": "So it is, my lord!",
        "source": "T12n0342_002:0146c11_4"
    },
    {
        "source_sentence": "敢可成就至於大化，皆由戒立，具足成就建立道法三十七品，行者無想、法無所置，",
        "translation": "Whoever dared to achieve enlightenment and so forth could do so only through the principle of morality. He perfected the establishment of the thirty-seven classes of the doctrine of the path, wherein practitioners had",
        "source": "T12n0342_002:0146c11_5"
    },
    {
        "source_sentence": "不念戒具其因成就與不成也，不著欲界色無色界，其不迷惑倚三界者，",
        "translation": "They are not attached to the realm of desire, form, and formless realms; they don’t confuse those who rely on the three realms.",
        "source": "T12n0342_002:0146c13_6"
    },
    {
        "source_sentence": "是謂具戒。",
        "translation": "This is called the full set of precepts.",
        "source": "T12n0342_002:0146c15_7"
    },
    {
        "source_sentence": "若立禁戒為成等法，信為種法忍，志性清和，長育成道，建行如是，立篤信戒，",
        "translation": "If someone establishes the precept against sexual misconduct as the accomplishment of equal qualities, faith as the planting of tolerance in regard to the teachings, aspiration as purity and harmony by nature, nurturing the path for a long time,",
        "source": "T12n0342_002:0146c15_8"
    },
    {
        "source_sentence": "便得成就三十七品道法之要也，是去來今現在佛聲聞緣覺之具戒也，至三脫門，",
        "translation": "They will attain the accomplishment of the thirty-seven essentials of the path, which are the precepts for all buddhas, śrāvakas and pratyekbuddhas of past, present and future.",
        "source": "T12n0342_002:0146c17_9"
    },
    {
        "source_sentence": "度諸出家而超越去。」",
        "translation": "He saves the renunciants and transcends them.",
        "source": "T12n0342_002:0146c19_10"
    },
    {
        "source_sentence": "善住意曰：「甚善難及，文殊師利！",
        "translation": "Shanzhuo thought, Very good and difficult to match, Mañjuśrī!",
        "source": "T12n0342_002:0146c19_11"
    },
    {
        "source_sentence": "快說具戒，能如是受具足戒者，則為正禁，非為邪業。」",
        "translation": "Those who quickly explain the full set of precepts and can thus receive the full set of precepts are rightly forbidden, not wrong actions.",
        "source": "T12n0342_002:0146c20_12"
    },
    {
        "source_sentence": "文殊師利復謂善住意天子：「出家如是，具戒若此，教授所施備足如斯。",
        "translation": "Mañjuśrī again said to the well-abiding celestial son, Such is the way to leave home, such are the precepts that are included here, and so is the amount of generosity given by the instruction.",
        "source": "T12n0342_002:0146c21_13"
    },
    {
        "source_sentence": "設族姓子不發起戒，是為學戒。」",
        "translation": "If a clansman doesn't give rise to the precepts, this is called training in the precepts.",
        "source": "T12n0342_002:0146c22_14"
    },
    {
        "source_sentence": "天子問曰：「此語何謂？」",
        "translation": "The celestial prince asked, What's the meaning of these words?",
        "source": "T12n0342_002:0146c23_15"
    },
    {
        "source_sentence": "文殊答曰：「一切諸法悉無所起，亦無所受；",
        "translation": "Mañjuśrī answered: All things do not arise, nor are they received.",
        "source": "T12n0342_002:0146c24_16"
    },
    {
        "source_sentence": "其有受戒，則受吾我，亦著三界，故生其中。",
        "translation": "If someone has received the precepts, they'll receive self and be born there because they're attached to the three realms.",
        "source": "T12n0342_002:0146c25_17"
    },
    {
        "source_sentence": "於天子意所志云何，何謂為戒？」",
        "translation": "What's meant by the precepts in the mind of a celestial being?",
        "source": "T12n0342_002:0146c26_0"
    },
    {
        "source_sentence": "答曰：「將護沙門二百五十。」",
        "translation": "He answered, Two hundred and fifty will protect the ascetic.",
        "source": "T12n0342_002:0146c26_1"
    },
    {
        "source_sentence": "又問：「以何將護？」",
        "translation": "Again, he asked, What will I protect?",
        "source": "T12n0342_002:0146c27_2"
    },
    {
        "source_sentence": "答曰：「守身口意，名曰將護，二百五十備悉具禁，不為身行亦無所作。」",
        "translation": "He answered, Observing body, speech, and thought is called guarding, and the two hundred and fifty provisions are fully forbidden, not doing bodily actions or anything else.",
        "source": "T12n0342_002:0146c27_3"
    },
    {
        "source_sentence": "「亦無當作，寧可恕當有處所乎？",
        "translation": "Nor will there be anything to do, so how could he forgive it if there's a place?",
        "source": "T12n0342_002:0146c29_4"
    },
    {
        "source_sentence": "青黃白黑紅紫色耶？",
        "translation": "Is blue, yellow, white, black, red, and purple?",
        "source": "T12n0342_002:0146c29_5"
    },
    {
        "source_sentence": "所向方面？」",
        "translation": "direction to which you're headed?",
        "source": "T12n0342_002:0147a01_6"
    },
    {
        "source_sentence": "答曰：「無也。」",
        "translation": "He replied, It's not.",
        "source": "T12n0342_002:0147a01_7"
    },
    {
        "source_sentence": "又問：「何故？」",
        "translation": "Again, he asked, Why is that?",
        "source": "T12n0342_002:0147a01_8"
    },
    {
        "source_sentence": "「無所有故！",
        "translation": "Because it has no existence!",
        "source": "T12n0342_002:0147a02_9"
    },
    {
        "source_sentence": "由是之故不可恕當。」",
        "translation": "Because of this, we can't forgive him.",
        "source": "T12n0342_002:0147a02_10"
    },
    {
        "source_sentence": "問曰：「何故？」",
        "translation": "He asked, Why is that?",
        "source": "T12n0342_002:0147a02_11"
    },
    {
        "source_sentence": "答曰：「無所行故。」",
        "translation": "He answered, It's because there's nothing to practice.",
        "source": "T12n0342_002:0147a03_12"
    },
    {
        "source_sentence": "文殊又問：「其無所有，可名說乎？",
        "translation": "Mañjuśrī also asked, Is it possible to call it a teaching because it doesn't exist?",
        "source": "T12n0342_002:0147a03_13"
    },
    {
        "source_sentence": "物如是不？」",
        "translation": "Is the thing like this?",
        "source": "T12n0342_002:0147a04_14"
    },
    {
        "source_sentence": "報曰：「不能。」",
        "translation": "He replied, I can't.",
        "source": "T12n0342_002:0147a04_15"
    },
    {
        "source_sentence": "文殊答曰：「是故，天子！",
        "translation": "Mañjuśrī answered, That's why, celestial son!",
        "source": "T12n0342_002:0147a04_16"
    },
    {
        "source_sentence": "當作斯觀。",
        "translation": "You should observe it this way.",
        "source": "T12n0342_002:0147a05_17"
    },
    {
        "source_sentence": "所號禁戒不可奉受，此曰樂禁。",
        "translation": "The precepts that are called forbidden and unacceptable can't be accepted, which is called the blissful prohibition.",
        "source": "T12n0342_002:0147a05_18"
    },
    {
        "source_sentence": "為備戒德，其心清和，智慧通達，如是行者悉無所有，無能動者、永無所趣。",
        "translation": "In order to perfect the virtue of morality, their minds are pure and harmonious, and they have wisdom and insight. Such practitioners all lack existence, have no one who can move them, and never have any destination.",
        "source": "T12n0342_002:0147a06_0"
    },
    {
        "source_sentence": "戒無所獲是真諦戒，不得心處是曰淨心，不逮智慧是真智慧，心無所作不懷想念，",
        "translation": "The absence of precepts and attaining anything is the true truth of morality. Not attaining mental states is called a pure state of mind. Not acquiring wisdom is true wisdom.",
        "source": "T12n0342_002:0147a07_1"
    },
    {
        "source_sentence": "其無所生是謂護心，戒具備悉。",
        "translation": "The absence of anything that arises is called guarding the mind, and the precepts are fully present.",
        "source": "T12n0342_002:0147a09_2"
    },
    {
        "source_sentence": "如是奉戒，智慧若斯，不得心處、不念禁戒、不逮智慧，若能曉了智慧無處，",
        "translation": "Thus observing precepts like this and thus having such wisdom, they won’t attain the mindful abode, don’t think of the precepts, and don’t acquire wisdom. If they can understand that there’s no place for wisdom",
        "source": "T12n0342_002:0147a10_3"
    },
    {
        "source_sentence": "一切調和無有眾疑，識解道教，不見諸法不善之義，其於諸法不見不善，",
        "translation": "They understand the teaching of enlightenment and do not see anything unwholesome; they do not see anything unwholesome.",
        "source": "T12n0342_002:0147a11_4"
    },
    {
        "source_sentence": "則不受戒，其不受戒亦不毀禁。",
        "translation": "They won't accept the precepts, and they won't violate the precepts if they don't accept them.",
        "source": "T12n0342_002:0147a13_5"
    },
    {
        "source_sentence": "其欲學戒彼則須戒，其須戒者則不退還，其不退者彼名解脫，其解脫者則不合會，",
        "translation": "Those who want to learn the precepts will need them, and those who need precepts won't regress. Those who don't regress are called liberation, and those who are liberated won't be united.",
        "source": "T12n0342_002:0147a14_6"
    },
    {
        "source_sentence": "其不合會者彼則無漏，其無漏者則行平等，平等行者則無所得亦不受戒，",
        "translation": "Those who aren’t united are pure, while those who are pure practice impartiality. Those who practice impartiality will attain nothing and also not receive the precepts.",
        "source": "T12n0342_002:0147a16_7"
    },
    {
        "source_sentence": "是故諸法等如虛空，了虛無故。",
        "translation": "Therefore, all dharmas and so forth are like space because they perceive space as nonexistent.",
        "source": "T12n0342_002:0147a17_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0147a18_9"
    },
    {
        "source_sentence": "其虛空者則無所行。",
        "translation": "If it's empty, then there's nothing to do.",
        "source": "T12n0342_002:0147a18_10"
    },
    {
        "source_sentence": "是故，天子！",
        "translation": "Therefore, celestial son!",
        "source": "T12n0342_002:0147a19_11"
    },
    {
        "source_sentence": "學戒如此則無禁戒。",
        "translation": "If someone trains in the precepts like this, there's no forbidden precept.",
        "source": "T12n0342_002:0147a19_12"
    },
    {
        "source_sentence": "彼所戒者，何所為戒？",
        "translation": "What's the precept that they adhere to?",
        "source": "T12n0342_002:0147a19_13"
    },
    {
        "source_sentence": "其不學戒，學戒當爾，則學於空。",
        "translation": "If someone doesn't train in the precepts, and they train in the precepts accordingly, then they'll train in emptiness.",
        "source": "T12n0342_002:0147a20_14"
    },
    {
        "source_sentence": "何謂為空？",
        "translation": "What is meant by emptiness?",
        "source": "T12n0342_002:0147a21_15"
    },
    {
        "source_sentence": "不樂身口，不慕其意，無染不染，是賢聖戒。",
        "translation": "Being unhappy with body and speech, not longing for their thoughts, and being neither defiled nor undefiled is the good and noble precept.",
        "source": "T12n0342_002:0147a21_16"
    },
    {
        "source_sentence": "如是住者，則無所住，其無所住，學平等戒。",
        "translation": "When someone thus abides, there's nothing to abide in, and they don't abide in anything, and they train in the equal precepts.",
        "source": "T12n0342_002:0147a22_17"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T12n0342_002:0147a23_18"
    },
    {
        "source_sentence": "又聽。",
        "translation": "Again, listen.",
        "source": "T12n0342_002:0147a23_19"
    },
    {
        "source_sentence": "如是出家為沙門者，具戒若此禁戒之謂，其人假使飲食衣服三千大千世界其中所有，",
        "translation": "Suppose someone renounces the householder’s life and becomes a monk. He is endowed with moral precepts. If he keeps these precepts, then even if he were to offer food, drink, clothing, or property belonging to",
        "source": "T12n0342_002:0147a23_20"
    },
    {
        "source_sentence": "皆能淨畢，所食之功多所救護，終不唐舉，皆由如是淨戒所致。」",
        "translation": "They'll all be able to purify themselves, and the merit of what they eat will be so great that they won't be raised in vain; it's because of such pure precepts that they'll be saved.",
        "source": "T12n0342_002:0147a25_21"
    },
    {
        "source_sentence": "天子又問：「今者，文殊！",
        "translation": "Again, the celestial prince asked, Now, Mañjuśrī!",
        "source": "T12n0342_002:0147a26_22"
    },
    {
        "source_sentence": "為誰說此？」",
        "translation": "Who teaches this for?",
        "source": "T12n0342_002:0147a27_23"
    },
    {
        "source_sentence": "文殊答曰：「為受者施，能親順者，彼則畢淨，能逮此義，爾乃淨畢；",
        "translation": "Mañjuśrī answered: If you give to someone who receives [the precepts] and are able to follow them, then they will be completely pure. And if you can apprehend the meaning of these precepts, your purity will be complete.",
        "source": "T12n0342_002:0147a27_24"
    },
    {
        "source_sentence": "其不親、不受、不逮此義，不念、不修、不惟，誰受？",
        "translation": "If they aren't intimate, don't receive it, don't grasp its meaning, don't think about it, don't cultivate it, and don't contemplate it, who will receive it?",
        "source": "T12n0342_002:0147a28_25"
    },
    {
        "source_sentence": "誰為親近？",
        "translation": "Who will become intimate with them?",
        "source": "T12n0342_002:0147a29_26"
    },
    {
        "source_sentence": "誰能淨畢？",
        "translation": "Who can finish purifying it?",
        "source": "T12n0342_002:0147b01_27"
    },
    {
        "source_sentence": "爾乃正淨，此應諮嗟為真眾祐，一切諸法究竟悉空無所生慧，是為盡暢清淨眾祐。",
        "translation": "You're correctly pure, and this should be admired as the true blessing of the multitude of blessings, which is the wisdom that all dharmas are ultimately completely empty and nothing to give rise to, which is the perfect and pure multitude of",
        "source": "T12n0342_002:0147b01_28"
    },
    {
        "source_sentence": "凡夫之士能畢眾祐，羅漢不能。",
        "translation": "Ordinary people can fulfill the many blessings, but arhats can't.",
        "source": "T12n0342_002:0147b03_29"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0147b04_0"
    },
    {
        "source_sentence": "凡夫之士能受親近，還致識別，惟念精思：『吾曾諮受，惟察奉行。』",
        "translation": "Ordinary people who are able to be intimate and give rise to distinctions only think and reflect, 'I've been consulted before, but I'll examine and approve of it.'",
        "source": "T12n0342_002:0147b04_1"
    },
    {
        "source_sentence": "能施能慕，則能淨畢。",
        "translation": "If someone can give and admire it, they'll be able to purify it.",
        "source": "T12n0342_002:0147b05_2"
    },
    {
        "source_sentence": "云何淨畢？",
        "translation": "How are they purified?",
        "source": "T12n0342_002:0147b06_3"
    },
    {
        "source_sentence": "周旋往來，沒復還生，所生之處，淨洗諸根。",
        "translation": "Where they are born, they purify and wash their faculties.",
        "source": "T12n0342_002:0147b06_4"
    },
    {
        "source_sentence": "阿羅漢者，無有陰種諸入之義，不能周旋，何能淨畢！",
        "translation": "An arhat has no meaning of aggregates or seeds or sense-fields, and he can't circumambulate them, so how could he purify them?",
        "source": "T12n0342_002:0147b07_5"
    },
    {
        "source_sentence": "誰淨畢者？",
        "translation": "Who is the one who has finished purifying?",
        "source": "T12n0342_002:0147b08_6"
    },
    {
        "source_sentence": "其受分衛福布施主，淨三品場，然後受食。",
        "translation": "The donor who receives the portion of the precepts and bestows merit purifies the three levels of the hall, and then he accepts the food.",
        "source": "T12n0342_002:0147b08_7"
    },
    {
        "source_sentence": "何謂三品？",
        "translation": "What are the three kinds?",
        "source": "T12n0342_002:0147b09_8"
    },
    {
        "source_sentence": "一、不得我亦無受者，二、不得施者亦無所授，三、不得周旋生死處所及淨畢竟。",
        "translation": "1. those who don't attain self and don't receive it, 2. those who don't attain generosity and don't give anything, and 3. those who don't attain the ultimate purity of the abode of birth-and-de",
        "source": "T12n0342_002:0147b10_9"
    },
    {
        "source_sentence": "是為三。",
        "translation": "These are the three.",
        "source": "T12n0342_002:0147b11_10"
    },
    {
        "source_sentence": "如是淨者，無所淨畢。",
        "translation": "Thus pure, there's nothing to be purified after that.",
        "source": "T12n0342_002:0147b12_11"
    },
    {
        "source_sentence": "是故，天子！",
        "translation": "Therefore, celestial son!",
        "source": "T12n0342_002:0147b12_12"
    },
    {
        "source_sentence": "吾說斯言：『飲食被服三千大千世界所有，皆能淨畢無微翳礙。",
        "translation": "I say this, 'All the food and drink that's consumed in the 3,000 great one-thousand worlds can be purified without any obstruction.",
        "source": "T12n0342_002:0147b12_13"
    },
    {
        "source_sentence": "是為處世真正眾祐，乃為出家名曰沙門。』」",
        "translation": "This is the true blessing of being in the world, so he's a renunciant named an ascetic.'",
        "source": "T12n0342_002:0147b14_14"
    },
    {
        "source_sentence": "文殊師利復謂善住意：「求出家者，吾當告語：『若欲出家為沙門者，",
        "translation": "Mañjuśrī again said to the well-abiding man, Those who seek to leave home should tell him, 'If you want to leave home and become a monk,",
        "source": "T12n0342_002:0147b15_15"
    },
    {
        "source_sentence": "仁族姓子！",
        "translation": "benevolent clansmen!",
        "source": "T12n0342_002:0147b16_16"
    },
    {
        "source_sentence": "不處閑居，不在人間，無遠無近，不起不滅，不獨一己，不處大眾，不在會中，",
        "translation": "They don’t live in seclusion, they don’t live among people, they don’t go far or near, they don’t rise or cease, they don’t be alone, they don’t dwell in the masses, they don",
        "source": "T12n0342_002:0147b17_0"
    },
    {
        "source_sentence": "不處屏處，不行乞匃，不就人請，不著弊衣五納之服，不著居家白衣之服，",
        "translation": "They don’t dwell in seclusion, don’t practice begging, don’t accept invitations from others, don’t wear the clothes of the five patched robes made of rags, and don’t wear the white clothes of householders.",
        "source": "T12n0342_002:0147b18_1"
    },
    {
        "source_sentence": "不處曠野、不在居室，不慕少求亦不多求，不知止足亦無不足，亦無有行亦無不行，",
        "translation": "They don’t live in the wilderness or in a dwelling place, don’t seek little and don’t seek much, don’t know that stopping is enough or insufficient, and have neither practice nor no practice.",
        "source": "T12n0342_002:0147b20_2"
    },
    {
        "source_sentence": "不在限節亦無中適，不智不愚不慧不闇，行空如此，乃曰備悉。",
        "translation": "They don't know, don't be foolish, don't be foolish, don't be wise, and aren't dark, and practice emptiness like this, then they're said to be fully enlightened.",
        "source": "T12n0342_002:0147b22_3"
    },
    {
        "source_sentence": "其計我身舉動進退，若處閑居，當行分衛，察己聰慧，不離於明。』",
        "translation": "He imagines that my body is raised and moved, advances and retreats, and if he lives in a quiet place, he'll guard it separately, examine his own intelligence and not part with insight.'",
        "source": "T12n0342_002:0147b23_4"
    },
    {
        "source_sentence": "如是，天子！",
        "translation": "So it is, my lord!",
        "source": "T12n0342_002:0147b25_5"
    },
    {
        "source_sentence": "此輩伴黨，不達正真覩空慧義，是為發起，心有所存。",
        "translation": "These companions of the assembly don't understand the meaning of right, true, and crude wisdom about emptiness, which is called arousal, and their minds have something to store.",
        "source": "T12n0342_002:0147b25_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0147b26_7"
    },
    {
        "source_sentence": "於彼如此希求望想，多所著念，尚無有身，何況他人。",
        "translation": "They have such longing and expectant thoughts, are often attached to them, and don't even have a body, so why wouldn't others?",
        "source": "T12n0342_002:0147b26_8"
    },
    {
        "source_sentence": "諸法歸空，慧了無生，安復欲得，限節功勳，獨處致耶？",
        "translation": "The dharmas return to emptiness, and wisdom understands that there's no arising, so how can they be peacefully desired or attain it? Is the merit of limited effort produced only in one place?",
        "source": "T12n0342_002:0147b27_9"
    },
    {
        "source_sentence": "未之有也！",
        "translation": "It doesn't exist yet!",
        "source": "T12n0342_002:0147b29_10"
    },
    {
        "source_sentence": "是故，天子！",
        "translation": "Therefore, celestial son!",
        "source": "T12n0342_002:0147b29_11"
    },
    {
        "source_sentence": "其能如是節限平等，所修行者不求望想，吾乃謂彼知大限節。",
        "translation": "Those who practice it don't seek hope, but I say they know the great limitations.",
        "source": "T12n0342_002:0147b29_12"
    },
    {
        "source_sentence": "若使，天子！",
        "translation": "Suppose, my lord!",
        "source": "T12n0342_002:0147c01_13"
    },
    {
        "source_sentence": "節婬怒癡，了於三界、五陰、四大諸種眾，入此無極，節而知止足，不受、不捨，",
        "translation": "He enters the three realms, the five aggregates, and the four major kinds of sentient beings. Entering these [realms] without limit, he knows moderation with restraint, neither accepting them nor rejecting them.",
        "source": "T12n0342_002:0147c02_14"
    },
    {
        "source_sentence": "不以修行亦無不行，無調不調，不寂然，不令盡，其能限節如是法者，",
        "translation": "Those who are neither practicing nor not practicing, without discipline or regulation, without quiescence or extinction, can limit such teachings in moderation.",
        "source": "T12n0342_002:0147c03_15"
    },
    {
        "source_sentence": "不與三界而合同塵，彼乃名曰知限節者，所止清淨，為無所處，悉無所著。",
        "translation": "He doesn't contract with the three realms and dust, but he's called someone who knows the limitations, whose abode is pure, has no place, and has no attachment at all.",
        "source": "T12n0342_002:0147c05_16"
    },
    {
        "source_sentence": "復次，天子！",
        "translation": "Furthermore, my lord!",
        "source": "T12n0342_002:0147c07_0"
    },
    {
        "source_sentence": "如來具戒。",
        "translation": "The Tathāgata possesses the precepts.",
        "source": "T12n0342_002:0147c07_1"
    },
    {
        "source_sentence": "若有人來，欲備禁者，吾當為說。",
        "translation": "If someone comes and wants to keep the precepts, I'll explain them for them.",
        "source": "T12n0342_002:0147c07_2"
    },
    {
        "source_sentence": "若，族姓子！",
        "translation": "Yes, clansmen!",
        "source": "T12n0342_002:0147c08_3"
    },
    {
        "source_sentence": "不知苦諦，不斷習諦，不證盡諦，不奉行道，如是行者能正諦見。",
        "translation": "They do not know the truth of suffering, do not keep the truth of accumulation unceasingly, do not realize the truth of extinction, and do not practice the path. Practitioners such as these can see the true truth.",
        "source": "T12n0342_002:0147c08_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0147c10_0"
    },
    {
        "source_sentence": "真正諦者，無有苦諦，無有斷習，無習不習，亦無有盡，不為盡證，亦無有道，",
        "translation": "The true and genuine truth is that there’s no truth of suffering, no accumulation of cessation, no accumulation or non-accumulation, no end, no realization, and no path.",
        "source": "T12n0342_002:0147c10_1"
    },
    {
        "source_sentence": "無所由行。",
        "translation": "There's no reason to act.",
        "source": "T12n0342_002:0147c11_2"
    },
    {
        "source_sentence": "設族姓子不奉四意止，乃為平等。",
        "translation": "If a clansman doesn't follow the four wishes to stop, then he's equal.",
        "source": "T12n0342_002:0147c12_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0147c12_4"
    },
    {
        "source_sentence": "計無有意亦無所念，不求諸法是為己身。",
        "translation": "He imagines that there's no mind and nothing to think, and he doesn't seek dharmas as his own body.",
        "source": "T12n0342_002:0147c13_5"
    },
    {
        "source_sentence": "所建意止，其無有意、無所念者，彼無身痛、無心無法，當何所畏？",
        "translation": "When the mind that's established is stopped, there's no meaning and nothing to think about, and it has no body pain or mind and nothing to fear, so what should they fear?",
        "source": "T12n0342_002:0147c14_6"
    },
    {
        "source_sentence": "有異難乎？",
        "translation": "Is there a dissimilar objection?",
        "source": "T12n0342_002:0147c15_7"
    },
    {
        "source_sentence": "若不奉行四意止者，是為備成清白之法。",
        "translation": "If someone doesn't practice the four kinds of mental cessation, this is the way to prepare for the accomplishment of the pure and white teaching.",
        "source": "T12n0342_002:0147c15_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0147c16_9"
    },
    {
        "source_sentence": "清白法者，無有不善處在其前，亦無善法，不斷不起。",
        "translation": "The pure and white dharma is that there's no unwholesome place in front of it, and there's no wholesome dharma that doesn't arise or cease.",
        "source": "T12n0342_002:0147c16_10"
    },
    {
        "source_sentence": "不斷不起者，是為名曰平等真正安諦之義，其逮平等，爾乃名曰平等之行。",
        "translation": "Not stopping or not stopping is called the meaning of the true truth of equanimity, and when he apprehends equality, that's called equal practice.",
        "source": "T12n0342_002:0147c18_11"
    },
    {
        "source_sentence": "若，族姓子！",
        "translation": "Yes, clansmen!",
        "source": "T12n0342_002:0147c19_12"
    },
    {
        "source_sentence": "不行四神足無有放逸，行四等心、五根、五力及七覺意、八種道者，若等奉行三十七品道義之法，",
        "translation": "If someone doesn't practice the four miraculous abilities without laxity and practices the four equal mental states, the five faculties, the five powers, the seven factors of awakening, and the eight kinds of paths, then they'",
        "source": "T12n0342_002:0147c20_0"
    },
    {
        "source_sentence": "不舉不下，無言無說，是謂行道。",
        "translation": "Without raising or lowering it, without words or explanations, this is called the path of practice.",
        "source": "T12n0342_002:0147c22_1"
    },
    {
        "source_sentence": "若，族姓子！",
        "translation": "Yes, clansmen!",
        "source": "T12n0342_002:0147c22_2"
    },
    {
        "source_sentence": "志三十七道品之法，於諸音聲從賢聖教不隨水流，若能精修遵其所行，",
        "translation": "They aspire to the teachings of the thirty-seven factors of enlightenment, following the sounds and teachings of saints and sages without going along with the flow of water. If they can diligently practice what they do,",
        "source": "T12n0342_002:0147c23_3"
    },
    {
        "source_sentence": "不知諸法亦不造證。",
        "translation": "They don't know that the dharmas also don't create realization.",
        "source": "T12n0342_002:0147c24_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0147c25_5"
    },
    {
        "source_sentence": "所可言曰三十七品道類之法，假有字耳，觀其假名，因望想生。",
        "translation": "What can be said is that the thirty-seven factors of the path are nominally worded, and when we look at their nominal names, they arise in dependence on perceptions.",
        "source": "T12n0342_002:0147c25_6"
    },
    {
        "source_sentence": "計其相者，亦無有相，為水所漂，因致周旋，其周旋者無所施害。",
        "translation": "Those who imagine their characteristics also have no characteristics, and they are floating in the water that causes them to circumambulate, but those who circumambulate don't harm anything.",
        "source": "T12n0342_002:0147c27_0"
    },
    {
        "source_sentence": "除此名已，則無所得，猶如觀察此三十七道品之法，亦無所除。」",
        "translation": "After this name is removed, there's nothing to be gained, just as observing these thirty-seven factors of the path doesn't remove anything.",
        "source": "T12n0342_002:0147c28_1"
    },
    {
        "source_sentence": "天子復問文殊師利：「何謂比丘慕於修行，而獨宴處？」",
        "translation": "Again, the celestial prince asked Mañjuśrī, What's meant by a monk who loves cultivation and lives alone in a place of meditation?",
        "source": "T12n0342_002:0147c29_2"
    },
    {
        "source_sentence": "文殊答曰：「假使分別諸法一等一種門相者，譬如虛空，悉無所行，皆無眾生，",
        "translation": "Mañjuśrī answered, Suppose someone were to discern the characteristics of all dharmas as one and the same in terms of their aspects, like space, which has no action whatsoever, and there are no sentient beings.",
        "source": "T12n0342_002:0148a01_3"
    },
    {
        "source_sentence": "是謂修行。",
        "translation": "This is called cultivation.",
        "source": "T12n0342_002:0148a03_4"
    },
    {
        "source_sentence": "又修行者，不處今世、不由後世，在於三世皆無所行，至一切法，亦無所行，",
        "translation": "“Also, a practitioner does not dwell in the present life or in any of the afterlife. In all times there is nothing he practices, and so on, up to all things are also without anything he practices.",
        "source": "T12n0342_002:0148a03_5"
    },
    {
        "source_sentence": "悉了諸法虛偽無實，是謂修行。",
        "translation": "Understanding that all dharmas are false and insubstantial is called cultivation.",
        "source": "T12n0342_002:0148a05_6"
    },
    {
        "source_sentence": "其修行者，則於諸法無雙無隻，無應不應，是謂修行。」",
        "translation": "If someone cultivates it, then there are no pairs or boats of dharmas, and nothing should be done or not done; this is called cultivating it.",
        "source": "T12n0342_002:0148a06_7"
    },
    {
        "source_sentence": "時彼眾會無央數人，心懷沈吟，悉生疑結：「此為何謂？",
        "translation": "Countless people in the assembly then harbored doubts in their minds and thought, What's the meaning of this?",
        "source": "T12n0342_002:0148a07_8"
    },
    {
        "source_sentence": "當奉何行？",
        "translation": "What practice should we follow?",
        "source": "T12n0342_002:0148a08_9"
    },
    {
        "source_sentence": "何因申暢？",
        "translation": "What's the reason for explaining it?",
        "source": "T12n0342_002:0148a08_10"
    },
    {
        "source_sentence": "如來、至真、等正覺，演三脫門，得至泥洹，若能造證三十七道品之法，",
        "translation": "The Tathāgata, Arhat, Perfectly Enlightened One, expounds the three liberations and attains nirvana. If one can create and actualize the teaching of the thirty-seven factors of enlightenment,",
        "source": "T12n0342_002:0148a09_11"
    },
    {
        "source_sentence": "致滅度矣！",
        "translation": "He'll attain nirvāṇa!",
        "source": "T12n0342_002:0148a10_12"
    },
    {
        "source_sentence": "文殊師利今者所說，將無倒教亂法之兆？」",
        "translation": "What Mañjuśrī teaches now will be the sign of a disorderly teaching that's not mistaken?",
        "source": "T12n0342_002:0148a10_13"
    },
    {
        "source_sentence": "文殊師利尋時皆知，此諸比丘一切眾會心所懷疑，告舍利弗：「唯卿仁者，",
        "translation": "When Mañjuśrī looked into the matter, they all knew that these monks had doubts in their minds in all the assemblies. They said to Śāriputra:",
        "source": "T12n0342_002:0148a11_14"
    },
    {
        "source_sentence": "為眾重任，咸共信之，最大智慧，如來所歎。",
        "translation": "They all believed in it, and the Tathāgata praised them for their supreme wisdom.",
        "source": "T12n0342_002:0148a13_15"
    },
    {
        "source_sentence": "又賢者身，離欲塵法而以造證。",
        "translation": "Also, the body of a good man is free of the dust of desire and creates its realization by being free of the dust of desire.",
        "source": "T12n0342_002:0148a14_16"
    },
    {
        "source_sentence": "仁者久如逮成四諦，得造證乎三十七品及三脫門也。」",
        "translation": "Sir, it's been a long time since you acquired the four noble truths and attained the realization of the thirty-seven chapters and three gates of liberation.",
        "source": "T12n0342_002:0148a15_17"
    },
    {
        "source_sentence": "舍利弗曰：「不也！",
        "translation": "Śāriputra said, No!",
        "source": "T12n0342_002:0148a16_18"
    },
    {
        "source_sentence": "我不得法，當可造立，思惟其義，及修行者。",
        "translation": "I won't obtain the teaching, so I can create it, contemplate its meaning, and cultivate it.",
        "source": "T12n0342_002:0148a16_19"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0148a17_20"
    },
    {
        "source_sentence": "一切諸法悉無所受亦無所生，空無言教，空不證空。」",
        "translation": "All dharmas have nothing to receive and nothing to give rise to, emptiness has no words or teachings, and emptiness doesn't realize emptiness.",
        "source": "T12n0342_002:0148a17_21"
    },
    {
        "source_sentence": "說是語時，三萬比丘漏盡意解。",
        "translation": "When he spoke these words, 30,000 monks ended the contaminants and their mental liberation.",
        "source": "T12n0342_002:0148a19_22"
    },
    {
        "source_sentence": "善住意天子讚文殊師利：「審如仁者，執慧頒宣深妙法忍，興隆空行。」",
        "translation": "The well-abiding celestial son praised Mañjuśrī, Listen, you're like a kind man who clings to wisdom and proclaims profound tolerance of the fine dharma and promotes the practice of emptiness.",
        "source": "T12n0342_002:0148a20_0"
    },
    {
        "source_sentence": "文殊答曰：「吾不執慧，一切愚戇凡夫之士執求智慧。",
        "translation": "Mañjuśrī answered, I don't cling to wisdom, and all foolish mortals cling to seeking wisdom.",
        "source": "T12n0342_002:0148a21_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0148a22_2"
    },
    {
        "source_sentence": "斯等之類，執持令轉，集會二品所執，墮於地獄、餓鬼、畜生、諸天、人間，",
        "translation": "These are the kinds of people who cling, maintain, and cause others to be transformed. Those who gather these two kinds of doctrines will fall into hell, hungry ghosthood, animals, gods, and humans.",
        "source": "T12n0342_002:0148a22_3"
    },
    {
        "source_sentence": "所見牽連。",
        "translation": "What's seen leads to rebirth.",
        "source": "T12n0342_002:0148a24_4"
    },
    {
        "source_sentence": "假使，天子！",
        "translation": "Suppose, my lord!",
        "source": "T12n0342_002:0148a24_5"
    },
    {
        "source_sentence": "為諸三界展轉牽連，輪轉無際，所向非一，所生受身，各各別異，是為牽連，",
        "translation": "Because the three realms are mutually exclusive. Their transmigration has no bounds, and what it directs toward is not one and the same. The sensation body that arises is different from each other. This is called mutual influence.",
        "source": "T12n0342_002:0148a24_6"
    },
    {
        "source_sentence": "隨其宛轉，如是牽連展轉無休。",
        "translation": "As they go along, so do they lead one after the other without cease.",
        "source": "T12n0342_002:0148a26_7"
    },
    {
        "source_sentence": "由是之故，不知本際，在於生死樂苦惱根。",
        "translation": "Because of this, they don't know the original limit and are born in the faculty of pleasure, pain, and suffering in birth-and-death.",
        "source": "T12n0342_002:0148a27_8"
    },
    {
        "source_sentence": "復次，天子！",
        "translation": "Furthermore, my lord!",
        "source": "T12n0342_002:0148a28_9"
    },
    {
        "source_sentence": "愚騃無智凡夫，不聞與欲俱合，怒癡亦然，報應諸見，名色同塵，諸佛、聲聞、緣覺、菩薩，",
        "translation": "Foolish, ignorant, and ignorant worldlings do not hear that it is combined with desire. The same applies to anger and delusion. Because of their retribution, views are as numerous as atoms in name and form.",
        "source": "T12n0342_002:0148a28_10"
    },
    {
        "source_sentence": "及逮法忍，無所牽連，亦無宛轉。",
        "translation": "and the tolerance of apprehending the Dharma, there's nothing to lead, and there's nothing to change.",
        "source": "T12n0342_002:0148b01_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0148b02_12"
    },
    {
        "source_sentence": "如斯黨類，其身口心未曾起立，所展轉者不得三界，何所宛轉？",
        "translation": "Such a group of people, whose bodies, speech, and minds have never arisen or been established, can't be transformed by the three realms, so where will they be transformed?",
        "source": "T12n0342_002:0148b02_13"
    },
    {
        "source_sentence": "是故斯等牽連智慧，若更受身，無所棄捨，是執智慧。」",
        "translation": "Therefore, these are the wisdoms that lead to rebirth, and if they were to accept another body without abandoning it, this would be the wisdom of attachment.",
        "source": "T12n0342_002:0148b03_14"
    },
    {
        "source_sentence": "天子又問：「仁者所說，毀壞慧乎？」",
        "translation": "Again, the celestial prince asked, Sir, is what you've said destroying wisdom?",
        "source": "T12n0342_002:0148b04_15"
    },
    {
        "source_sentence": "答曰：「不也。」",
        "translation": "He replied, No.",
        "source": "T12n0342_002:0148b05_16"
    },
    {
        "source_sentence": "又問：「何故毀壞？",
        "translation": "Again, he asked, Why is it destroyed?",
        "source": "T12n0342_002:0148b05_17"
    },
    {
        "source_sentence": "令無所除。」",
        "translation": "It causes nothing to be removed.",
        "source": "T12n0342_002:0148b06_18"
    },
    {
        "source_sentence": "「是等學者，是毀壞慧，若不毀壞，無所除者不滅寂慧。」",
        "translation": "Such scholars are the wisdom of disparagement, and if they don't disparage and nothing is removed, they won't cease their quiescent wisdom.",
        "source": "T12n0342_002:0148b06_19"
    },
    {
        "source_sentence": "又問：「文殊！",
        "translation": "Again, he asked, Mañjuśrī!",
        "source": "T12n0342_002:0148b07_20"
    },
    {
        "source_sentence": "仁無此乎？」",
        "translation": "Isn't this the case, sir?",
        "source": "T12n0342_002:0148b07_21"
    },
    {
        "source_sentence": "答曰：「不也。」",
        "translation": "He replied, No.",
        "source": "T12n0342_002:0148b08_22"
    },
    {
        "source_sentence": "又問：「何故？」",
        "translation": "Again, he asked, Why is that?",
        "source": "T12n0342_002:0148b08_23"
    },
    {
        "source_sentence": "答曰：「其有將去覆還，有往來者則有此事，其無有往、無有還者，曉了諸法而無周旋，",
        "translation": "He replied, “If there are those who are about to go and cover back [their journeys] and those who come and go, they will have this matter. If there is neither going nor coming back, he understands all things but does not circumambulate them",
        "source": "T12n0342_002:0148b08_24"
    },
    {
        "source_sentence": "則無將去亦無覆來。」",
        "translation": "Then there's no going and no covering or coming.",
        "source": "T12n0342_002:0148b10_25"
    },
    {
        "source_sentence": "又問文殊：「何所章句為最元首？」",
        "translation": "Again, he asked Mañjuśrī, What's the most original chapter and verse?",
        "source": "T12n0342_002:0148b11_26"
    },
    {
        "source_sentence": "答曰：「如是句者，我是元首。」",
        "translation": "He answered, Such a phrase is the first one.",
        "source": "T12n0342_002:0148b11_27"
    },
    {
        "source_sentence": "又問：「何謂？」",
        "translation": "Again, he asked, What does it mean?",
        "source": "T12n0342_002:0148b12_28"
    },
    {
        "source_sentence": "文殊答曰：「若有菩薩，於一文字、一章句義而不動者，章句猶歸分別四義。",
        "translation": "Mañjuśrī answered, If a bodhisattva doesn't move the meaning of a single word or phrase without moving it, the phrase still returns to discerning the four meanings.",
        "source": "T12n0342_002:0148b12_29"
    },
    {
        "source_sentence": "何謂為四解章句？",
        "translation": "What are the four interpretations of words and phrases?",
        "source": "T12n0342_002:0148b14_30"
    },
    {
        "source_sentence": "一、常如審諦。",
        "translation": "1. constant as the truth of deliberation.",
        "source": "T12n0342_002:0148b14_31"
    },
    {
        "source_sentence": "二、了空義，知為恍忽。",
        "translation": "2. Understanding the meaning of emptiness, he knows it to be a dazzling thing.",
        "source": "T12n0342_002:0148b15_32"
    },
    {
        "source_sentence": "三、分別無形，悉無所生。",
        "translation": "3. Discrimination has no form, and nothing is produced at all.",
        "source": "T12n0342_002:0148b15_33"
    },
    {
        "source_sentence": "四、於諸所知不以為知、不以為患。",
        "translation": "4. He doesn't think of knowing and doesn't think of what's known as a danger.",
        "source": "T12n0342_002:0148b16_34"
    },
    {
        "source_sentence": "不造二事，是諸章句最為元首。」",
        "translation": "Not creating two things is the first of the chapters and phrases.",
        "source": "T12n0342_002:0148b16_35"
    },
    {
        "source_sentence": "時佛嗟歎文殊師利：「善哉，善哉！",
        "translation": "The Buddha then praised Mañjuśrī, Good, good!",
        "source": "T12n0342_002:0148b17_36"
    },
    {
        "source_sentence": "乃能班宣逮總持義。」",
        "translation": "He's able to classically proclaim the meaning of the dhāraṇī.",
        "source": "T12n0342_002:0148b18_37"
    },
    {
        "source_sentence": "文殊白佛：「我無總持。",
        "translation": "Mañjuśrī said to the Buddha, I have no dhāraṇī.",
        "source": "T12n0342_002:0148b18_38"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0148b19_39"
    },
    {
        "source_sentence": "無所得故，無可執持。",
        "translation": "Because there's nothing to attain, there's nothing to cling to.",
        "source": "T12n0342_002:0148b19_40"
    },
    {
        "source_sentence": "愚騃凡夫乃逮總持，諸佛菩薩無所獲致。",
        "translation": "Foolish mortals then acquire the dhāraṇī, and there's nothing that the buddhas and bodhisattvas attain.",
        "source": "T12n0342_002:0148b20_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0148b20_1"
    },
    {
        "source_sentence": "其迷惑者多所執持。",
        "translation": "It's often held by those who are confused.",
        "source": "T12n0342_002:0148b21_2"
    },
    {
        "source_sentence": "何所持乎？",
        "translation": "What's the support?",
        "source": "T12n0342_002:0148b21_3"
    },
    {
        "source_sentence": "依於吾我、著人壽命，執持斷滅及計有常，執壞貪婬、瞋恚、愚癡，親抱所有，",
        "translation": "Relying on self and attachment to human life, they cling to annihilation and imagine permanence, clinging to the destruction of greed, anger, hatred, and folly, and embracing possessions.",
        "source": "T12n0342_002:0148b21_4"
    },
    {
        "source_sentence": "恩愛貪身，自見五陰、四大及諸入，思想多念，而反求望，墮若干見六十二疑，",
        "translation": "The body of affection and craving, seeing for themselves the five aggregates, the four elements and the sense-fields, thinking with a lot of thought and instead seeking hope, falls into certain views and sixty-two doubts.",
        "source": "T12n0342_002:0148b23_5"
    },
    {
        "source_sentence": "有所獲致，而急執持。",
        "translation": "There's something to attain, but they quickly cling to it.",
        "source": "T12n0342_002:0148b25_6"
    },
    {
        "source_sentence": "是故，世尊！",
        "translation": "Therefore, Bhagavān!",
        "source": "T12n0342_002:0148b25_7"
    },
    {
        "source_sentence": "愚戇凡夫逮得總持。",
        "translation": "Foolish mortals attain the dhāraṇī.",
        "source": "T12n0342_002:0148b26_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0148b26_9"
    },
    {
        "source_sentence": "愚夫懷法在心念者，諸佛世尊悉無所持。",
        "translation": "If a foolish man harbors the Dharma in his mind, the buddhas and world-honored ones will have nothing to hold it.",
        "source": "T12n0342_002:0148b26_10"
    },
    {
        "source_sentence": "聲聞、緣覺、諸菩薩等，亦復若茲，是故愚夫逮得總持。」",
        "translation": "śrāvakas, pratyekbuddhas, pratyekabuddhas, and bodhisattvas are likewise, so foolish people acquire the dhāraṇī.",
        "source": "T12n0342_002:0148b27_11"
    },
    {
        "source_sentence": "於是善住意天子問文殊師利：「如向者說不得總持，當以何意化於五趣？」",
        "translation": "The well-abiding celestial son of intention then asked Mañjuśrī, As the aforementioned person said, you can't master the dhāraṇī, what will be the intention for transforming the five destinies?",
        "source": "T12n0342_002:0148b29_0"
    },
    {
        "source_sentence": "答曰：「其五趣者，無所為作。",
        "translation": "He answered, Those in the five destinies have nothing to do.",
        "source": "T12n0342_002:0148c01_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0148c02_2"
    },
    {
        "source_sentence": "吾以消除五趣終始，令其所趣不知處所。",
        "translation": "I've eliminated the beginning and end of the five destinies so that they don't know where they're headed.",
        "source": "T12n0342_002:0148c02_3"
    },
    {
        "source_sentence": "諸佛、緣覺、聲聞所趣，愚戇凡夫所不能趣。",
        "translation": "The buddhas, pratyekabuddhas, and śrāvakas go there, but foolish worldlings can't go there.",
        "source": "T12n0342_002:0148c03_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0148c04_5"
    },
    {
        "source_sentence": "愚夫比數墮於生死，諸明智者消除諸趣，道迹亦然，不離生死，況於愚戇凡夫士乎！",
        "translation": "Foolish people often fall into birth-and-death, and the wise men of insight eliminate the destinies, so do the traces of the path, which are not separate from birth-and-death, much less foolish worldlings!",
        "source": "T12n0342_002:0148c04_6"
    },
    {
        "source_sentence": "是故吾身，消除諸趣不得總持。",
        "translation": "That's why my body has removed the destinies and won't be able to maintain them in a general way.",
        "source": "T12n0342_002:0148c06_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0148c07_8"
    },
    {
        "source_sentence": "無所獲致，當何持也！」",
        "translation": "There's nothing to attain, so what should I do?",
        "source": "T12n0342_002:0148c07_9"
    },
    {
        "source_sentence": "說是語時，彼眾會中五百比丘誹謗此經而捨馳去，則以現身墮大地獄。",
        "translation": "When he spoke these words, the five hundred monks in the assembly who denigrated this sūtra and abandoned it fled, and then they fell into great hell in their present body.",
        "source": "T12n0342_002:0148c07_10"
    },
    {
        "source_sentence": "時，舍利弗報文殊師利：「且止！",
        "translation": "Śāriputra then reported to Mañjuśrī, Stop!",
        "source": "T12n0342_002:0148c09_11"
    },
    {
        "source_sentence": "勿復演此深法，五百比丘聞之狐疑不肯順入，自恣、罵詈，自謂尊豪，",
        "translation": "Don’t further expound this profound teaching. When the five hundred bhikṣus heard it, they doubted and refused to follow it. They self-indulgently made obeisance [to the Buddha] and abused him, saying that they were",
        "source": "T12n0342_002:0148c10_12"
    },
    {
        "source_sentence": "而捨馳走，誹謗心亂弘雅之典，則以現身墮大地獄。」",
        "translation": "Instead, they abandon and run away, denigrate the Hongya scriptures that disturb their minds, and then they'll fall into the great hell with their present body.",
        "source": "T12n0342_002:0148c11_13"
    },
    {
        "source_sentence": "文殊報曰：「唯，舍利弗！",
        "translation": "Mañjuśrī replied, Yes, Śāriputra!",
        "source": "T12n0342_002:0148c12_14"
    },
    {
        "source_sentence": "莫有斯言，勿懷疑網，有計是非，勿懷猶預，不見有法墮地獄者，惟察諸法無誹謗者。",
        "translation": "Don't say such things, don't doubt the web of doubt, and don't imagine right or wrong, don't harbor what's in store, don't see any dharmas that will fall into hell, but examine the dharmas without",
        "source": "T12n0342_002:0148c13_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0148c15_16"
    },
    {
        "source_sentence": "一切諸法悉無所生，屬舍利弗而宣此辭，令吾休止，不說經典。",
        "translation": "All dharmas arise from nothing at all. I belong to Śāriputra, who proclaimed these words so that I may rest and not teach the sutras.",
        "source": "T12n0342_002:0148c15_17"
    },
    {
        "source_sentence": "假使族姓子、族姓女，依著吾我想人壽命，若江沙劫供養如來承事聖眾，",
        "translation": "Suppose clansmen and clanswomen were to rely on my self as the basis for their human life span, and if they were to offer support to the Tathāgata and serve the holy ones for eons as numerous as grains of sand in the Gang",
        "source": "T12n0342_002:0148c17_0"
    },
    {
        "source_sentence": "隨其所安，皆給所乏，盡其形壽而不懈休；",
        "translation": "They provide whatever they need for their well-being, and do not rest until the end of their physical life.",
        "source": "T12n0342_002:0148c18_1"
    },
    {
        "source_sentence": "若有聞此如是像法深妙難解，一切世間所可希聞，空無相願，憺怕寂寞，",
        "translation": "If there is anyone who hears such a profound and subtle doctrine as this one, which is difficult to understand, all the people in the world will not be able to hear it. Their wishes are empty and signless, terrified by fear and",
        "source": "T12n0342_002:0148c19_2"
    },
    {
        "source_sentence": "歸於消滅，無起無滅，無人壽命，無常苦空，非身之誼，若能得聞如是輩經，",
        "translation": "If one were to hear such a scripture, they would know that the absence of arising and perishing is due to cessation, that there is no human life span, that impermanence, suffering, and emptiness are impermanent, and that",
        "source": "T12n0342_002:0148c21_3"
    },
    {
        "source_sentence": "聞之誹謗，其族姓子及族姓女墮大地獄，在大地獄忽聞此經，尋便得出，",
        "translation": "When they hear it and denigrate it, their clansmen and clanswomen will fall into the great hell. Suddenly hearing this sūtra in the great hell, they'll be able to escape.",
        "source": "T12n0342_002:0148c23_0"
    },
    {
        "source_sentence": "輒信深經而得解脫，勝善男子、善女人江河沙劫奉敬如來供養聖眾，著吾我人及計壽命，",
        "translation": "They easily believe in the profound scriptures and attain liberation, surpassing good men and good women who venerate the Tathāgata for as many eons as there are grains of sand in a river to offer support to holy beings, clinging to",
        "source": "T12n0342_002:0148c24_1"
    },
    {
        "source_sentence": "不得至道，聞是法者疾得解脫。」",
        "translation": "They won't attain the ultimate path, and those who hear this teaching will quickly attain liberation.",
        "source": "T12n0342_002:0148c26_2"
    },
    {
        "source_sentence": "◎佛讚文殊師利：「善哉，善哉！",
        "translation": "The Buddha praised Mañjuśrī, Good, good!",
        "source": "T12n0342_002:0148c27_3"
    },
    {
        "source_sentence": "誠如所言。",
        "translation": "It's really as I said.",
        "source": "T12n0342_002:0148c28_4"
    },
    {
        "source_sentence": "斯經尊妙，若現於世，與佛興出等無有異。",
        "translation": "If this sūtra is honored and marvelous, it's no different from the Buddha's appearance in the world when it appears.",
        "source": "T12n0342_002:0148c28_5"
    },
    {
        "source_sentence": "道迹往來，不逮無著，於緣覺乘、菩薩大乘而見授決，此為最尊，等無若干。",
        "translation": "The traces of the Way, past and future, are not acquired without attachment, and they're judged in the pratyekabuddha vehicle and bodhisattva great vehicle, which are the most venerable and equally unequal.",
        "source": "T12n0342_002:0148c29_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0149a01_7"
    },
    {
        "source_sentence": "不著吾我，所修平等，亦無所得，至於泥洹亦復若茲。",
        "translation": "They don't cling to self, cultivate equality, or attain it, and so forth, up to nirvāṇa is like this.",
        "source": "T12n0342_002:0149a02_8"
    },
    {
        "source_sentence": "設有念知，言有所得，則墮顛倒。」",
        "translation": "If someone has mindfulness and knows that they've attained something, then they'll fall into error.",
        "source": "T12n0342_002:0149a03_9"
    },
    {
        "source_sentence": "佛告舍利弗：「此諸比丘五百人等，在於地獄速得滅度，勝於是間愚惑百年護戒、悉知止足，",
        "translation": "The Buddha said to Śāriputra: These five hundred bhikṣus will quickly attain nirvana in hell. They are superior to the foolish and deluded monks of that time, who observed the precepts for a hundred years and were thoroughly",
        "source": "T12n0342_002:0149a04_0"
    },
    {
        "source_sentence": "墮於顛倒六十二見。",
        "translation": "They'll fall into the sixty-two mistaken views.",
        "source": "T12n0342_002:0149a06_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0149a06_2"
    },
    {
        "source_sentence": "未曾得聞此深妙法無解脫相也。",
        "translation": "I've never heard of this profound and marvelous teaching that has no sign of liberation.",
        "source": "T12n0342_002:0149a06_3"
    },
    {
        "source_sentence": "是族姓子、若族姓女，聞此深經，入耳思惟，疾逮無上正真之道，勝疑餘經，",
        "translation": "“Those sons and daughters of good families who hear this profound scripture will enter their ears to contemplate it. They will quickly attain the unsurpassed true path, overcoming doubt about other scriptures.",
        "source": "T12n0342_002:0149a07_4"
    },
    {
        "source_sentence": "迷墮顛倒。",
        "translation": "They're deluded and fall into error.",
        "source": "T12n0342_002:0149a09_5"
    },
    {
        "source_sentence": "發意頃須臾樂信此深經者，疾得解脫。」",
        "translation": "Those who quickly attain liberation when they give rise to the intention to believe in this profound sūtra for a moment of time will quickly attain liberation.",
        "source": "T12n0342_002:0149a09_6"
    },
    {
        "source_sentence": "◎◎善住意天子問文殊師利：「仁者！",
        "translation": "The well-abiding celestial prince asked Mañjuśrī, Sir!",
        "source": "T12n0342_002:0149a10_7"
    },
    {
        "source_sentence": "樂我淨修梵行無沾污乎？」",
        "translation": "Is the practice of purifying self and cultivating religious practice undefiled?",
        "source": "T12n0342_002:0149a11_8"
    },
    {
        "source_sentence": "文殊報曰：「如是，天子！",
        "translation": "Mañjuśrī replied, So it is, celestial son!",
        "source": "T12n0342_002:0149a12_9"
    },
    {
        "source_sentence": "則修梵行，設使卿身不勸梵行、不修梵行，乃為可耳？」",
        "translation": "If you don't encourage religious practice and don't cultivate religious practice, is it possible for you to do so?",
        "source": "T12n0342_002:0149a12_10"
    },
    {
        "source_sentence": "問曰：「何謂？」",
        "translation": "He asked, What does it mean?",
        "source": "T12n0342_002:0149a14_11"
    },
    {
        "source_sentence": "答曰：「其有所受，彼乃修行；",
        "translation": "He replied: When they receive something, they practice it.",
        "source": "T12n0342_002:0149a14_12"
    },
    {
        "source_sentence": "其不受者，何所行乎？",
        "translation": "What's the action of someone who doesn't accept it?",
        "source": "T12n0342_002:0149a14_13"
    },
    {
        "source_sentence": "可名行耶？」",
        "translation": "Can we call it practice?",
        "source": "T12n0342_002:0149a15_14"
    },
    {
        "source_sentence": "天子又問：「如今仁者不修梵行乎？」",
        "translation": "Again, the celestial prince asked, Now, isn't that kindness cultivating religious practice?",
        "source": "T12n0342_002:0149a15_15"
    },
    {
        "source_sentence": "文殊答曰：「不也。」",
        "translation": "Mañjuśrī answered, No.",
        "source": "T12n0342_002:0149a16_16"
    },
    {
        "source_sentence": "又問：「不淨行耶？」",
        "translation": "Again, he asked, What's the impure practice?",
        "source": "T12n0342_002:0149a16_17"
    },
    {
        "source_sentence": "答曰：「不修淨行，如天子言。",
        "translation": "He answered, They don't cultivate pure practices, just as the celestial prince said.",
        "source": "T12n0342_002:0149a17_18"
    },
    {
        "source_sentence": "以何等故不修淨行？",
        "translation": "Why are they not cultivating pure practices?",
        "source": "T12n0342_002:0149a17_19"
    },
    {
        "source_sentence": "無家居、不梵行、不受、不惑，亦無所行，亦無不梵行。",
        "translation": "There's no home, no religious practice, no sensation, no affliction, no action, and no non-Buddhist practice.",
        "source": "T12n0342_002:0149a18_20"
    },
    {
        "source_sentence": "假使學者清和梵行，悉無所行，亦無非行，爾乃名曰大淨梵行。",
        "translation": "Suppose a student of the pure and harmonious religious practice doesn't practice anything, and there are no non-practices, then that's called the great pure religious practice.",
        "source": "T12n0342_002:0149a19_21"
    },
    {
        "source_sentence": "其行，天子！",
        "translation": "What's the practice, celestial son!",
        "source": "T12n0342_002:0149a20_22"
    },
    {
        "source_sentence": "婬怒癡行乃曰正行；",
        "translation": "The practice of hatred, anger, and delusion is called right practice.",
        "source": "T12n0342_002:0149a21_0"
    },
    {
        "source_sentence": "遊於欲界色無色界，是曰清行，愍傷眾生。",
        "translation": "Traveling to the form and formless realms in the desire realm, this is called a pure practice that pities sentient beings.",
        "source": "T12n0342_002:0149a21_1"
    },
    {
        "source_sentence": "其不習行婬怒癡事，不遊三界，彼不清修，亦無所行，乃謂為行。」",
        "translation": "They don't cultivate the practice of lust, anger, and delusion, and they don't travel to the three realms; they don't cultivate them, and they don't practice anything, which is called practice.",
        "source": "T12n0342_002:0149a22_2"
    },
    {
        "source_sentence": "善住意曰：「善哉，善哉！",
        "translation": "The well-abiding mind said, Good, good!",
        "source": "T12n0342_002:0149a23_3"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0342_002:0149a24_4"
    },
    {
        "source_sentence": "所暢辯才而無罣礙。」",
        "translation": "He's fluent in eloquence and has no obstruction.",
        "source": "T12n0342_002:0149a24_5"
    },
    {
        "source_sentence": "文殊答曰：「使卿辯才亦無罣礙，得無礙辯，可得處乎。",
        "translation": "Mañjuśrī answered, So that your eloquence is also unobstructed, and if you attain unobstructed eloquence, can you get a place?",
        "source": "T12n0342_002:0149a25_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0149a26_7"
    },
    {
        "source_sentence": "計是我故，有所倚著，則為罣礙。」",
        "translation": "It's because they think of themselves as self, and whatever they rely on is an obstruction.",
        "source": "T12n0342_002:0149a26_8"
    },
    {
        "source_sentence": "文殊師利復告善住意：「欲以是像求淨梵行者，設使仁者不執刀劍，賊害一切眾生身命，",
        "translation": "Mañjuśrī again told Supratiṣṭhita, “If you wish to pursue the pure practice of austerity by means of this image, and if you do not have a sword in your hand, thieves will harm all sentient beings’ bo",
        "source": "T12n0342_002:0149a28_0"
    },
    {
        "source_sentence": "不捉矛戟瓦石大棒，自然危者乃為慈心。」",
        "translation": "If someone doesn't grasp a spear, halberd, tile, or stone stick, they'll naturally become compassionate when they're in danger.",
        "source": "T12n0342_002:0149b01_0"
    },
    {
        "source_sentence": "天子又問：「此言何謂？」",
        "translation": "Again, the celestial prince asked, What does this mean?",
        "source": "T12n0342_002:0149b01_1"
    },
    {
        "source_sentence": "文殊答曰：「所謂眾生含血之類，義所趣乎？」",
        "translation": "Mañjuśrī answered, What does it mean to say that sentient beings contain blood?",
        "source": "T12n0342_002:0149b02_2"
    },
    {
        "source_sentence": "天子報曰：「假有名耳！",
        "translation": "The celestial prince replied, pretending to have a name!",
        "source": "T12n0342_002:0149b03_3"
    },
    {
        "source_sentence": "計有吾我乃有眾生，含血之類受思想故，故曰眾生。",
        "translation": "It's called sentient being because it imagines that there's a self and then there are sentient beings, and the blood-containing type is thought of as sentient beings.",
        "source": "T12n0342_002:0149b03_4"
    },
    {
        "source_sentence": "依倚顛倒貪計有身，故曰眾生。",
        "translation": "Because sentient beings rely on the mistaken craving for a body that exists, they're called sentient beings.",
        "source": "T12n0342_002:0149b05_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0149b05_1"
    },
    {
        "source_sentence": "是故，天子！",
        "translation": "Therefore, celestial son!",
        "source": "T12n0342_002:0149b05_2"
    },
    {
        "source_sentence": "貪見吾我想人壽命，因有假號而演名字，吾當以利智慧劍而危害之。",
        "translation": "They covet to see that I think of myself as a human life span and give my names by using false names, and I will harm them with the sword of sharp wisdom.",
        "source": "T12n0342_002:0149b06_3"
    },
    {
        "source_sentence": "常以此義將養護之，令不見縛，當使[火*霍]然不知諸受之所歸趣，",
        "translation": "They will always be disciplined and protected by this doctrine, so that they won’t be bound. They will cause [fire*ho] but not know the destination of their sensations.",
        "source": "T12n0342_002:0149b07_4"
    },
    {
        "source_sentence": "無所斷除。",
        "translation": "There's nothing to remove.",
        "source": "T12n0342_002:0149b09_5"
    },
    {
        "source_sentence": "是故，天子！",
        "translation": "Therefore, celestial son!",
        "source": "T12n0342_002:0149b09_6"
    },
    {
        "source_sentence": "當解此義，除吾我想，則害眾生一切望想，不墮殺生，心不懷害。」",
        "translation": "Understand this meaning, except for self and self-view, it harms all sentient beings' hopes and perceptions, doesn't fall into killing life, and doesn't harm them in mind.",
        "source": "T12n0342_002:0149b09_7"
    },
    {
        "source_sentence": "文殊師利復謂善住意：「欲使卿身淨修梵行，若能奉犯十惡之業，亦慎一切黑冥品事，",
        "translation": "Mañjuśrī again said to the well-abiding man, I want you to purify your body and cultivate religious practice. If you are capable of committing the ten evil deeds, be careful not to do anything that is black or dark",
        "source": "T12n0342_002:0149b11_8"
    },
    {
        "source_sentence": "又復不修諸清白業。」",
        "translation": "Nor does he cultivate pure and white actions.",
        "source": "T12n0342_002:0149b13_0"
    },
    {
        "source_sentence": "善住意又問：「斯言何謂？」",
        "translation": "Again, Shanzhuo asked, What's the meaning of this statement?",
        "source": "T12n0342_002:0149b13_1"
    },
    {
        "source_sentence": "文殊答曰：「等黑冥品，等諸清白亦復若此。」",
        "translation": "Mañjuśrī answered, Equal to the black and dark chapters, equal to the white ones, it's likewise here.",
        "source": "T12n0342_002:0149b14_0"
    },
    {
        "source_sentence": "又問文殊：「黑冥品事，以何為等？」",
        "translation": "Again, he asked Mañjuśrī, What's the equality of black and dark qualities?",
        "source": "T12n0342_002:0149b15_0"
    },
    {
        "source_sentence": "答曰：「以無所作而不退沒，故曰等矣！",
        "translation": "He answered, It's because there's nothing to do that it doesn't regress, so it's called equal!",
        "source": "T12n0342_002:0149b15_1"
    },
    {
        "source_sentence": "一切諸法黑冥亦如，如黑冥等，清白亦等，無想念故。」",
        "translation": "All dharmas that are black and dark are likewise, such as black and dark, white and so forth, because there's no perception or thought.",
        "source": "T12n0342_002:0149b16_2"
    },
    {
        "source_sentence": "文殊又問：「以何緣信清白法乎？」",
        "translation": "Mañjuśrī also asked, What's the reason for believing in the pure and white teaching?",
        "source": "T12n0342_002:0149b17_3"
    },
    {
        "source_sentence": "善住意答曰：「所以信之，用其法界無本之故。」",
        "translation": "Shanzhuo Yi replied, That's why I believe it, because there's no basis for its use in the Dharma realm.",
        "source": "T12n0342_002:0149b18_4"
    },
    {
        "source_sentence": "「於善住意所趣云何？",
        "translation": "“What’s the aim of well-abiding thought?",
        "source": "T12n0342_002:0149b19_5"
    },
    {
        "source_sentence": "可使無本及與法界，修行處所往周旋乎？」",
        "translation": "Can it be that there's no root and no Dharma realm, and where does the place of cultivation go and circumambulate?",
        "source": "T12n0342_002:0149b19_6"
    },
    {
        "source_sentence": "答曰：「不也。」",
        "translation": "He replied, No.",
        "source": "T12n0342_002:0149b20_7"
    },
    {
        "source_sentence": "文殊報曰：「是故我言，設能等行黑冥品事不修清白，爾乃相可淨修梵行。」",
        "translation": "Mañjuśrī replied, Therefore, I say that if someone can equally practice black and dark deeds and not cultivate pure and white deeds, then they'll be able to purify their religious practice.",
        "source": "T12n0342_002:0149b21_8"
    },
    {
        "source_sentence": "復謂天子：「若劍擊頭，害殺斯人，乃修梵行。」",
        "translation": "Again, he said to the celestial son, If a sword strikes your head and kills someone with it, they'll cultivate the religious practice.",
        "source": "T12n0342_002:0149b22_9"
    },
    {
        "source_sentence": "問曰：「何謂也？」",
        "translation": "He asked, What does it mean?",
        "source": "T12n0342_002:0149b23_10"
    },
    {
        "source_sentence": "答曰：「害婬怒癡，自大貢高，貪嫉諛諂，多妬自恣，而受希望，痛痒思想，",
        "translation": "He replied, They harm lust, anger, delusion, pride, self-conceit, greed, jealousy, hypocrisy, flattery, much envy, self-indulgence, and experience hopes, pain, itchy",
        "source": "T12n0342_002:0149b24_11"
    },
    {
        "source_sentence": "是為，天子！",
        "translation": "This is so, celestial child!",
        "source": "T12n0342_002:0149b25_12"
    },
    {
        "source_sentence": "名曰傷害。",
        "translation": "It's called harming.",
        "source": "T12n0342_002:0149b25_13"
    },
    {
        "source_sentence": "若有修行，精進自守，貪欲心起，尋便滅除。",
        "translation": "If he cultivates it, his effort is self-controlled, and his mind arises with craving, then he'll be freed from it in an instant.",
        "source": "T12n0342_002:0149b26_14"
    },
    {
        "source_sentence": "除不與合，寂滅遠離，是謂為空，不入諸逆，曉了欲心，解如真諦本無所有。",
        "translation": "This is called emptiness, which doesn't enter into adversities, understands the mind of desire, and understands that the true truth originally has no existence.",
        "source": "T12n0342_002:0149b27_15"
    },
    {
        "source_sentence": "此心何生？",
        "translation": "Where does this mind arise?",
        "source": "T12n0342_002:0149b28_16"
    },
    {
        "source_sentence": "何所從滅？",
        "translation": "Where does cessation come from?",
        "source": "T12n0342_002:0149b29_17"
    },
    {
        "source_sentence": "誰來染污？",
        "translation": "Who came to defile it?",
        "source": "T12n0342_002:0149b29_18"
    },
    {
        "source_sentence": "誰染污者？",
        "translation": "Who is defiled?",
        "source": "T12n0342_002:0149b29_19"
    },
    {
        "source_sentence": "豈沾污乎？",
        "translation": "How could it be stained?",
        "source": "T12n0342_002:0149b29_20"
    },
    {
        "source_sentence": "復更思察，欲不可得，不見污者，亦無被染，則無所得。",
        "translation": "Again, when you further contemplate that desire is unobtainable and don't see what's defiled, it doesn't get defiled, and then there's nothing to be gained.",
        "source": "T12n0342_002:0149c01_21"
    },
    {
        "source_sentence": "其無所得則無所生，其無所生則無所捨，其無所捨則無所受，其無所受則無所習，",
        "translation": "If there is nothing to be attained, nothing will arise; if there is nothing to be produced, nothing will be abandoned; if there is nothing to be abandoned, nothing will be received; if there is nothing to be received, nothing will be practiced.",
        "source": "T12n0342_002:0149c02_22"
    },
    {
        "source_sentence": "無所習者則曰成就。",
        "translation": "Those who don't have anything to cultivate are called accomplished.",
        "source": "T12n0342_002:0149c04_23"
    },
    {
        "source_sentence": "色、痛、想、行、識亦復如是，五陰、六衰、十二因緣，不染污心。",
        "translation": "Form, pain, perception, volition, and consciousness are likewise, with the five aggregates, six decays, and twelve causes that don't stain the mind.",
        "source": "T12n0342_002:0149c04_24"
    },
    {
        "source_sentence": "其有興發如是傷害，此乃名曰殺人害傷，撾擊壞首，是為歸義。」",
        "translation": "Anyone who gives rise to such harm is called a homicide and injury, and this is the meaning of returning.",
        "source": "T12n0342_002:0149c05_25"
    },
    {
        "source_sentence": "文殊師利告善住意：「是故我言，當如是害淨修梵行，亦當離佛及法聖眾。」",
        "translation": "Mañjuśrī told Shanshou Yi, Therefore, I say that such harmful and pure cultivation of the religious practice will cause you to part with the Buddha and the noble Dharma community.",
        "source": "T12n0342_002:0149c07_26"
    },
    {
        "source_sentence": "善住意又問：「斯言何謂？」",
        "translation": "Again, Shanzhuo asked, What's the meaning of this statement?",
        "source": "T12n0342_002:0149c09_0"
    },
    {
        "source_sentence": "文殊答曰：「為道慧故。」",
        "translation": "Mañjuśrī answered, It's because of the wisdom of the path.",
        "source": "T12n0342_002:0149c09_1"
    },
    {
        "source_sentence": "又問：「令當所信？」",
        "translation": "Again, he asked, Will it be believed?",
        "source": "T12n0342_002:0149c10_0"
    },
    {
        "source_sentence": "答曰：「當信無本及與法界。」",
        "translation": "He answered, You should believe in the absence of the original and the Dharma realm.",
        "source": "T12n0342_002:0149c10_1"
    },
    {
        "source_sentence": "又問善住意：「寧可捉持無本法界？」",
        "translation": "Again, he asked what the good abode meant, How can you grasp and maintain the Dharma realm that has no root?",
        "source": "T12n0342_002:0149c11_0"
    },
    {
        "source_sentence": "答曰：「不也！」",
        "translation": "He replied, No!",
        "source": "T12n0342_002:0149c11_1"
    },
    {
        "source_sentence": "「是故我言，離於佛法。",
        "translation": "That's why I say, 'I'm free of the Buddha's teaching.'",
        "source": "T12n0342_002:0149c12_2"
    },
    {
        "source_sentence": "何謂聖眾？」",
        "translation": "What's meant by noble congregation?",
        "source": "T12n0342_002:0149c12_3"
    },
    {
        "source_sentence": "答曰：「因緣合故名曰聖眾。",
        "translation": "He answered, Because causes and conditions are united, they're called the noble congregation.",
        "source": "T12n0342_002:0149c12_4"
    },
    {
        "source_sentence": "其聖眾者無有集會，為佛弟子故曰聖眾。」",
        "translation": "There's no congregation of sages, and it's called the holy congregation because it's a disciple of the Buddha.",
        "source": "T12n0342_002:0149c13_5"
    },
    {
        "source_sentence": "又問：「於天子意，所趣云何？",
        "translation": "Again, he asked, What's the intention of the celestial son?",
        "source": "T12n0342_002:0149c14_6"
    },
    {
        "source_sentence": "其無為者無有合會，可離欲乎？」",
        "translation": "There's no conjunction of those who are unconditioned, so can they be free of desire?",
        "source": "T12n0342_002:0149c14_7"
    },
    {
        "source_sentence": "答曰：「不也。」",
        "translation": "He replied, No.",
        "source": "T12n0342_002:0149c15_8"
    },
    {
        "source_sentence": "文殊師利曰：「是故我言，若離聖眾，樂修梵行。",
        "translation": "Mañjuśrī said, Therefore, I say that if we part with the noble ones, we'll delight in cultivating religious practice.",
        "source": "T12n0342_002:0149c15_9"
    },
    {
        "source_sentence": "又復，善住！",
        "translation": "Again, well-abiding!",
        "source": "T12n0342_002:0149c16_10"
    },
    {
        "source_sentence": "其得佛者，則名著得佛聖眾，則名曰著，不為離欲。",
        "translation": "Those who attain buddhahood are called addicted to attaining the noble congregation of buddhas, and those who attain buddhahood are called addicted, not free from desire.",
        "source": "T12n0342_002:0149c17_11"
    },
    {
        "source_sentence": "其捨眾會則為離欲，所謂離欲為法界迹。」",
        "translation": "He abandons the congregation and then becomes free of desire, which is called freedom from desire as a manifestation of the Dharma realm.",
        "source": "T12n0342_002:0149c18_12"
    },
    {
        "source_sentence": "善住意天子啟文殊師利：「難及，難及！",
        "translation": "The well-abiding celestial spirit asked Mañjuśrī, Difficult to overcome, difficult to overcome!",
        "source": "T12n0342_002:0149c19_13"
    },
    {
        "source_sentence": "至未曾有。」",
        "translation": "It's unprecedented.",
        "source": "T12n0342_002:0149c20_14"
    },
    {
        "source_sentence": "文殊又曰：「天子！",
        "translation": "Mañjuśrī also said, Son of God!",
        "source": "T12n0342_002:0149c20_15"
    },
    {
        "source_sentence": "當習無反復事，勿得孝順。」",
        "translation": "You should cultivate nonretrogression and not be obedient.",
        "source": "T12n0342_002:0149c20_16"
    },
    {
        "source_sentence": "又問：「何謂為不孝順？」",
        "translation": "Again, he asked, What's meant by not being obedient?",
        "source": "T12n0342_002:0149c21_17"
    },
    {
        "source_sentence": "文殊答曰：「如是，善住意！",
        "translation": "Mañjuśrī answered, So it is, well-abiding mind!",
        "source": "T12n0342_002:0149c21_18"
    },
    {
        "source_sentence": "吾無反復，亦不無反復。」",
        "translation": "I won't repeat it, and I won't repeat it.",
        "source": "T12n0342_002:0149c22_19"
    },
    {
        "source_sentence": "善住意又問：「此言何謂？」",
        "translation": "Again, Shanshou Yi asked, What does this mean?",
        "source": "T12n0342_002:0149c22_20"
    },
    {
        "source_sentence": "文殊答曰：「其有所作，若毀傷者，各各興造若干種事，各歸異趣，受身不同各得報應，",
        "translation": "Mañjuśrī answered, Whatever they do, if they disparage each other, each creates a certain number of things, each returns to a different destiny, receives a different body, and each gets its reward.",
        "source": "T12n0342_002:0149c23_21"
    },
    {
        "source_sentence": "愚戇孝順各有所作，尋受報應著無量色。",
        "translation": "Foolish and obedient, each doing something, they should be rewarded with measureless forms.",
        "source": "T12n0342_002:0149c25_22"
    },
    {
        "source_sentence": "愚人所作，為身來患或致傷毀，所受諸見各異殊別，或著不著取捨進退，",
        "translation": "What foolish people do is either for personal reasons or to cause injury or harm, and the views they experience are each different and distinct, or they may cling to what they don’t cling to, grasping, abandoning, advancing, regressing,",
        "source": "T12n0342_002:0149c26_23"
    },
    {
        "source_sentence": "是名反復，為無反復。",
        "translation": "This is called repetition, which means there's no repetition.",
        "source": "T12n0342_002:0149c27_24"
    },
    {
        "source_sentence": "如佛世尊所演平等，謂一切法各無所作，悉無所作亦無招來，等於平等無所超度，",
        "translation": "Just as the Buddha, the World-Honored One, teaches equanimity: All things are uncreated in each and every way. They have no action whatsoever, and they do not invite anything. Equal to equanimity, there is",
        "source": "T12n0342_002:0149c28_25"
    },
    {
        "source_sentence": "亦無他受、不造他作，是則名曰為無反復。」",
        "translation": "If there's no other sensation and no other action, then it's called having no repetition.",
        "source": "T12n0342_002:0150a01_26"
    },
    {
        "source_sentence": "善住又問：「今文殊師利住於何所？",
        "translation": "Again, Shanzhai asked, Where is Mañjuśrī staying now?",
        "source": "T12n0342_002:0150a02_27"
    },
    {
        "source_sentence": "乃能說此立何法忍？」",
        "translation": "What kind of tolerance can you establish by explaining this?",
        "source": "T12n0342_002:0150a03_28"
    },
    {
        "source_sentence": "文殊答曰：「不住法忍。」",
        "translation": "Mañjuśrī answered, They don't abide in the tolerance of the Dharma.",
        "source": "T12n0342_002:0150a03_29"
    },
    {
        "source_sentence": "又問文殊：「於何所住，所宣乃爾？」",
        "translation": "Again, he asked Mañjuśrī, Where do you live and what you proclaim?",
        "source": "T12n0342_002:0150a04_30"
    },
    {
        "source_sentence": "文殊答曰：「住幻士處，身亦在彼。」",
        "translation": "Mañjuśrī answered, Abiding in the place of an illusionist, his body is also there.",
        "source": "T12n0342_002:0150a04_31"
    },
    {
        "source_sentence": "又問：「幻士所住如何？」",
        "translation": "Again, he asked, What's the place where an illusionist lives?",
        "source": "T12n0342_002:0150a05_32"
    },
    {
        "source_sentence": "答曰：「如無本住，幻士住彼。",
        "translation": "He answered, Suppose there's no original abode, and an illusionist lives there.",
        "source": "T12n0342_002:0150a06_33"
    },
    {
        "source_sentence": "如向者問：『住於何所？",
        "translation": "Suppose someone asks, 'Where are you staying?'",
        "source": "T12n0342_002:0150a06_34"
    },
    {
        "source_sentence": "而有所宣？』",
        "translation": "What's proclaimed?'",
        "source": "T12n0342_002:0150a07_35"
    },
    {
        "source_sentence": "在忍法耶？",
        "translation": "Is it the teaching of forbearance?",
        "source": "T12n0342_002:0150a07_36"
    },
    {
        "source_sentence": "所言法忍但假號耳！",
        "translation": "What's called forbearance of the Dharma is only nominally called that!",
        "source": "T12n0342_002:0150a07_37"
    },
    {
        "source_sentence": "何有住處？",
        "translation": "How could there be a dwelling place?",
        "source": "T12n0342_002:0150a08_38"
    },
    {
        "source_sentence": "諸法亦然，悉無所作亦無想念，彼無有住及與處所。",
        "translation": "So it is with all dharmas, which are completely without action and without ideation or thought: they have no abiding and no place.",
        "source": "T12n0342_002:0150a08_39"
    },
    {
        "source_sentence": "如是住者，乃為眾生頒宣道教。",
        "translation": "Those who thus abide will then proclaim the path for sentient beings.",
        "source": "T12n0342_002:0150a09_40"
    },
    {
        "source_sentence": "如來所住亦復如是，而說經義。",
        "translation": "The Tathāgata's abode is likewise, and he explains the meaning of the sūtras.",
        "source": "T12n0342_002:0150a10_41"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0150a10_42"
    },
    {
        "source_sentence": "住如無本乃有所宣，一切眾生亦復在彼，住於無本而有所說，如來無本，",
        "translation": "Those who abide in suchness have nothing to teach, and all sentient beings are also there. Those who abide in suchness have nothing to teach, but the Tathāgata has no basis.",
        "source": "T12n0342_002:0150a11_43"
    },
    {
        "source_sentence": "無本無異，一切眾生而不動轉，無本亦如，亦不動轉，猶若如來所應無本，",
        "translation": "All sentient beings do not move, and neither is the absence of a source. The same applies to the absence of a source as well as thusness, which also does not move, just as if there were no source for what should be done by",
        "source": "T12n0342_002:0150a12_44"
    },
    {
        "source_sentence": "眾生無本其亦若茲，皆一無本而無有二，而無若干故曰無本也。」",
        "translation": "If sentient beings lack the original, so it is here; they are all one without a source but have no two, and there are no different, so it's called having no source.",
        "source": "T12n0342_002:0150a14_45"
    },
    {
        "source_sentence": "善住意天子又問文殊師利：「所言沙門，為何謂乎？」",
        "translation": "Again, the well-abiding celestial prince asked Mañjuśrī, What's meant by that ascetic you say?",
        "source": "T12n0342_002:0150a16_0"
    },
    {
        "source_sentence": "文殊答曰：「非沙門、非梵志，乃為沙門。",
        "translation": "Mañjuśrī answered, It's not an ascetic or a priest, but it's an ascetic.",
        "source": "T12n0342_002:0150a17_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0150a17_2"
    },
    {
        "source_sentence": "不著欲界、不倚色界、不處無色，吾乃謂此為沙門耳。",
        "translation": "If someone doesn't cling to the desire realm, doesn't rely on the form realm, and doesn't live in the formless realm, then I'll call this a monk.",
        "source": "T12n0342_002:0150a18_3"
    },
    {
        "source_sentence": "若眼、耳、鼻、口、身、意不穿漏者，乃為沙門。",
        "translation": "If his eyes, ears, nose, mouth, body, and mind aren't contaminated, then he's a monk.",
        "source": "T12n0342_002:0150a19_4"
    },
    {
        "source_sentence": "其無志性，不與情合，無有因緣亦無不緣，乃為沙門。",
        "translation": "Because of their lack of aspiration, they aren't united with feelings, have no causes and conditions, and don't have any non-causal conditions, they become as a monk.",
        "source": "T12n0342_002:0150a20_5"
    },
    {
        "source_sentence": "又復，天子！",
        "translation": "Again, my lord!",
        "source": "T12n0342_002:0150a21_6"
    },
    {
        "source_sentence": "其不著法、不著非法，其行寂然，無是非心，忽然無迹，是謂沙門。",
        "translation": "They don’t cling to the Dharma and don’t cling to what’s not Dharma; their actions are tranquil, they have no thoughts of right or wrong, and suddenly there are no traces. This is called an ascetic.",
        "source": "T12n0342_002:0150a21_7"
    },
    {
        "source_sentence": "何者然耶？",
        "translation": "Why is it so?",
        "source": "T12n0342_002:0150a23_8"
    },
    {
        "source_sentence": "其因緣法報應之宜，妄從是生，是諸法者亦復虛偽，其不著者無縛無脫，",
        "translation": "Their causes and conditions, the appropriateness of rewards and retributions for dharmas, arise falsely from these. These things are also false; those who don’t cling to them have neither bondage nor liberation.",
        "source": "T12n0342_002:0150a23_9"
    },
    {
        "source_sentence": "是謂沙門。",
        "translation": "This is called an ascetic.",
        "source": "T12n0342_002:0150a24_10"
    },
    {
        "source_sentence": "其無有往，亦不還反，無進無退，無瘡無瘢，無傷無完，是則名曰淨修梵行。",
        "translation": "They have no going or returning, no progress or retrogression, no advancement or retreat, no sores or scars, no injury or breakage, and this is called the pure cultivation of religious practice.",
        "source": "T12n0342_002:0150a25_11"
    },
    {
        "source_sentence": "是故我言，非沙門、非梵志，乃為沙門。」",
        "translation": "That's why I say, 'It's not an ascetic or a priest but an ascetic.'",
        "source": "T12n0342_002:0150a26_12"
    },
    {
        "source_sentence": "善住意讚曰：「至未曾有，志意堅強，所頒宣者無名遊迹，亦無章句，",
        "translation": "Shanzhu wished to praise it, saying, “This is an unprecedented event. His aspirations are firm and his intentions are resolute. The preaching he proclaims has no names or traces of existence and no syllables",
        "source": "T12n0342_002:0150a27_13"
    },
    {
        "source_sentence": "其意悉達而不忽忘。」",
        "translation": "Their intentions are fully comprehended without forgetting them.",
        "source": "T12n0342_002:0150a29_14"
    },
    {
        "source_sentence": "文殊答曰：「吾意不強。",
        "translation": "Mañjuśrī answered, My intention isn't strong.",
        "source": "T12n0342_002:0150a29_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0150b01_16"
    },
    {
        "source_sentence": "身自放意，意弱不強。」",
        "translation": "My body is self-indulgent, and my mind isn't strong.",
        "source": "T12n0342_002:0150b01_17"
    },
    {
        "source_sentence": "天子又問：「斯言何謂？」",
        "translation": "Again, the celestial prince asked, What does this mean?",
        "source": "T12n0342_002:0150b01_18"
    },
    {
        "source_sentence": "答曰：「吾以恣意，在聲聞地、住緣覺界，是故放意；",
        "translation": "He replied, Because of my unrestrained mind, I am in the realm of śrāvakas and pratyekabuddhas.",
        "source": "T12n0342_002:0150b02_19"
    },
    {
        "source_sentence": "又復恣意，處諸塵勞，不惡愛欲眾冥之患，是故放意。」",
        "translation": "Again, he's unrestrained, abiding in all the worldly afflictions, and doesn't hate the darkness of craving and desire; therefore, he's careless.",
        "source": "T12n0342_002:0150b03_20"
    },
    {
        "source_sentence": "善住意讚曰：「善哉，善哉！",
        "translation": "Shanzhu wished to praise him, saying, Good, good!",
        "source": "T12n0342_002:0150b04_21"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0342_002:0150b05_22"
    },
    {
        "source_sentence": "悉由宿世供養諸佛，眾行備悉，宣如來命所說如是。」",
        "translation": "They all made offerings to the buddhas in past lives, and their practices were complete, proclaiming what the Tathāgata had taught by order.",
        "source": "T12n0342_002:0150b05_23"
    },
    {
        "source_sentence": "答曰：「吾不供養過去諸佛。",
        "translation": "He replied, I won't make offerings to the buddhas of the past.",
        "source": "T12n0342_002:0150b06_24"
    },
    {
        "source_sentence": "何者然乎？",
        "translation": "Why is it so?",
        "source": "T12n0342_002:0150b07_25"
    },
    {
        "source_sentence": "吾未曾得宿世所歷，亦無當來，不從諸佛建立法行，無作不作，是故所作而無有作，",
        "translation": "I have never experienced anything like this in my previous existences, nor will I experience anything like it in the future. I neither establish practice of the Dharma from the buddhas (i.e., enlightenment principles) nor follow their example; thus",
        "source": "T12n0342_002:0150b07_26"
    },
    {
        "source_sentence": "不備眾行。」",
        "translation": "They don't have all the practices.",
        "source": "T12n0342_002:0150b09_27"
    },
    {
        "source_sentence": "善住意又問：「文殊師利！",
        "translation": "Shanzhuo Yi asked again, Mañjuśrī!",
        "source": "T12n0342_002:0150b09_28"
    },
    {
        "source_sentence": "吾本曾聞如幻三昧，願顯定意，示所正受。」",
        "translation": "I've always heard that it's like an illusion samādhi, so may I show my concentration and show what I'm receiving.",
        "source": "T12n0342_002:0150b10_29"
    },
    {
        "source_sentence": "文殊又問：「欲得覩見如幻三昧之境界乎？」",
        "translation": "Mañjuśrī also asked, Do you want to attain a crude view that's like the realm of illusory samādhi?",
        "source": "T12n0342_002:0150b11_30"
    },
    {
        "source_sentence": "答曰：「願樂欲見。」",
        "translation": "He replied, I'd like to see it.",
        "source": "T12n0342_002:0150b12_0"
    },
    {
        "source_sentence": "文殊師利尋時如言幻意三昧而正受矣！",
        "translation": "When Mañjuśrī sought it, he spoke of the illusion samādhi and correctly received it!",
        "source": "T12n0342_002:0150b12_1"
    },
    {
        "source_sentence": "應時十方各江沙等諸佛剎土悉自然現。",
        "translation": "It's then that the buddha-lands of the rivers and sands in each of the ten directions naturally appear.",
        "source": "T12n0342_002:0150b13_2"
    },
    {
        "source_sentence": "善住意天子自覩東方江河沙等諸佛剎土，其所現者悉是文殊——或以現形若比丘像講說經典；",
        "translation": "The celestial spirit Well-abiding appears in all the buddha-lands as numerous as the grains of sand in rivers in the eastern direction. All those who appear to them are Mañjuśrī, or they may teach scriptures by manifesting themselves",
        "source": "T12n0342_002:0150b14_3"
    },
    {
        "source_sentence": "或復有現比丘尼像、優婆塞、優婆夷像，如釋、如梵、如四天王、如轉輪王色像而現；",
        "translation": "“Furthermore, some people show images of bhikṣuṇīs, laymen, and laywomen, just as the gods Indra, Brahmā, Brahma, the four guardian gods of heaven, and the universal ruler appear in",
        "source": "T12n0342_002:0150b16_4"
    },
    {
        "source_sentence": "其體或如天龍鬼神、揵沓惒、阿須倫、迦留羅、真陀羅、摩休勒色像而現其身；",
        "translation": "Their bodies may be like the forms of celestial dragons, spirits, gandharvas, asuras, garuḍas, true enlightening beings, and mahoragas.",
        "source": "T12n0342_002:0150b18_5"
    },
    {
        "source_sentence": "或復顯示禽獸飛鳥若干種色——各各現形無量，像貌好醜殊別，而為說法，",
        "translation": "Or they may show various forms of birds, animals, flying birds, and certain kinds of beings-every one in an infinite variety of forms, with different appearances, beautiful and ugly, teaching the Dharma.",
        "source": "T12n0342_002:0150b20_6"
    },
    {
        "source_sentence": "十方一一諸江沙等所現佛土，其亦俱然，等無有異，為說經典。",
        "translation": "The buddha-lands shown in each of the ten directions, such as rivers and sands, are also the same. There is no difference between them when they teach the scriptures.",
        "source": "T12n0342_002:0150b21_7"
    },
    {
        "source_sentence": "善住意見此，忻然大悅不能自勝。",
        "translation": "Shanzhu commented on this, but he was overjoyed and couldn't control himself.",
        "source": "T12n0342_002:0150b23_8"
    },
    {
        "source_sentence": "文殊師利從三昧起，善住意恭恪歸命，白文殊曰：「向者覩見諸佛國土不可稱限，",
        "translation": "When Mañjuśrī emerged from concentration, respectfully and faithfully abiding in the Buddha’s name, he said to Mañjuśrī, “I see that all buddha-lands cannot be limited.",
        "source": "T12n0342_002:0150b23_9"
    },
    {
        "source_sentence": "形像無量各各殊別而說經典。」",
        "translation": "The forms and images are immeasurable, each different, and they teach the sūtras separately.",
        "source": "T12n0342_002:0150b25_10"
    },
    {
        "source_sentence": "文殊問曰：「於天子意，所解云何？",
        "translation": "Mañjuśrī asked, What's the meaning of what the prince understands?",
        "source": "T12n0342_002:0150b26_11"
    },
    {
        "source_sentence": "東方所現為審實乎？",
        "translation": "Is what's shown in the east really true?",
        "source": "T12n0342_002:0150b27_12"
    },
    {
        "source_sentence": "八方上下有所見者為實虛耶？",
        "translation": "What's seen in the eight directions and what's seen above and below is really false?",
        "source": "T12n0342_002:0150b27_13"
    },
    {
        "source_sentence": "十方所見何方審諦？」",
        "translation": "Where can we examine the truths that are seen in the ten directions?",
        "source": "T12n0342_002:0150b28_14"
    },
    {
        "source_sentence": "善住意答曰：「悉虛不實。",
        "translation": "Shanzhuo Yi replied, They're all false and not real.",
        "source": "T12n0342_002:0150b28_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0150b29_16"
    },
    {
        "source_sentence": "一切諸法皆無所生，由如幻化，如幻士相，一切諸法退無常存，自在所作示現變化，",
        "translation": "All things do not arise from anything. Because they are like illusions, like magicians, all things regress and remain impermanent; freely manifesting themselves as they are, they appear and change.",
        "source": "T12n0342_002:0150b29_17"
    },
    {
        "source_sentence": "推極本末不生不起，亦無所滅。」",
        "translation": "They presume that the ultimate source and derivative don't arise and don't arise, and there's nothing to cease.",
        "source": "T12n0342_002:0150c02_18"
    },
    {
        "source_sentence": "文殊師利尋則讚曰：「善哉，善哉！",
        "translation": "Mañjuśrī then praised him, saying, Good, good!",
        "source": "T12n0342_002:0150c03_19"
    },
    {
        "source_sentence": "講法當然，誠如所言。」",
        "translation": "It's true that the teaching is exactly as I said.",
        "source": "T12n0342_002:0150c04_0"
    },
    {
        "source_sentence": "說是語時，彼眾會中五百菩薩，以得四禪，逮五神通，識其宿命——往古世時所作善惡尋自已覩，",
        "translation": "When he spoke these words, five hundred bodhisattvas in the assembly attained the fourth meditation and acquired five supernormal powers to know their past lives-the good and bad deeds they had done in ancient times were self-extinguis",
        "source": "T12n0342_002:0150c04_1"
    },
    {
        "source_sentence": "皆復識命曾更所作，逆害父母、殺羅漢、亂聖眾、壞佛寺，斯等罪業——本所犯惡餘殃未盡，",
        "translation": "They'll all also know that their lives have been destroyed, harming their parents, killing arhats, disturbing sages, and destroying buddha temples, which are crimes - the bad deeds they committed in the past haven't ended.",
        "source": "T12n0342_002:0150c06_2"
    },
    {
        "source_sentence": "念傷害心，倍懷憂結，志在疑網。",
        "translation": "With thoughts of harming sentient beings, he harbors the bond of grief and sets his mind on the web of doubt.",
        "source": "T12n0342_002:0150c08_3"
    },
    {
        "source_sentence": "由是之故，不能逮了此深法要，計有吾我，所據微翳，卒不肯捨，不逮法忍。",
        "translation": "Because of this, they won't be able to grasp the profound essentials of the Dharma, imagine that there's a self, and base themselves on subtle disputes, so they won't abandon them or grasp the tolerance of the Dharma.",
        "source": "T12n0342_002:0150c09_4"
    },
    {
        "source_sentence": "於時世尊，欲得開化五百菩薩，則以威神現示文殊。",
        "translation": "Bhagavān then wanted to enlighten the five hundred bodhisattvas, so he showed them to Mañjuśrī with his authoritative power.",
        "source": "T12n0342_002:0150c11_5"
    },
    {
        "source_sentence": "文殊師利即從坐起，偏出右肩，右手捉劍，走到佛所。",
        "translation": "Mañjuśrī rose from his seat, dismounted from his right shoulder, drew his sword in his right hand, and went to where the Buddha was.",
        "source": "T12n0342_002:0150c12_6"
    },
    {
        "source_sentence": "佛告文殊：「且止，且止！",
        "translation": "The Buddha told Mañjuśrī, Stop it, stop it!",
        "source": "T12n0342_002:0150c13_7"
    },
    {
        "source_sentence": "勿得造逆，當以善害。",
        "translation": "Don't do anything against them, and they will harm them with goodness.",
        "source": "T12n0342_002:0150c14_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0150c14_9"
    },
    {
        "source_sentence": "皆從心發，因心生害。",
        "translation": "They all arise from the mind, and harm arises from the mind.",
        "source": "T12n0342_002:0150c14_10"
    },
    {
        "source_sentence": "心已起頃，便成為殺。」",
        "translation": "When the mind has arisen, it becomes killing.",
        "source": "T12n0342_002:0150c15_11"
    },
    {
        "source_sentence": "時無央數諸菩薩眾各心念言：「斯一切法悉如幻耳！",
        "translation": "The countless bodhisattvas then each thought to themselves, All these things are illusory!",
        "source": "T12n0342_002:0150c15_12"
    },
    {
        "source_sentence": "彼無吾我及人壽命，其意所念察其本末，無有父母、無佛法眾，亦無作者亦無受者，",
        "translation": "They don't have self or human life, and what they think about it is to examine its origins; there are no parents, no buddha-dharma congregations, no authors, and no recipients.",
        "source": "T12n0342_002:0150c16_13"
    },
    {
        "source_sentence": "無行不行，亦無果報，意自貪身而墮顛倒，愚戇凡夫悉不能解，心反處顛倒計我父母。",
        "translation": "There's no practice or non-practice, and there's no reward, and the mind craves its own body and falls into error, foolish mortals can't understand it, and their minds are mistakenly imagining themselves as parents.",
        "source": "T12n0342_002:0150c18_14"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0150c20_15"
    },
    {
        "source_sentence": "文殊師利聰明聖達，諸佛世尊所歎功勳不可思議，道德超殊，不可逮及，",
        "translation": "Mañjuśrī was intelligent and noble, praised by the buddhas and world-honored ones. His merits were inconceivable; his morality was so extraordinary that they could not be apprehended.",
        "source": "T12n0342_002:0150c20_16"
    },
    {
        "source_sentence": "巍巍煌煌，無以為喻，深入法忍，了其本際，供養無數江河沙等諸佛大聖而宣道教，",
        "translation": "They entered deeply into the tolerance of the doctrine and, comprehending its limits, they offered support to buddhas as numerous as the number of grains of sand in countless rivers.",
        "source": "T12n0342_002:0150c22_17"
    },
    {
        "source_sentence": "於過去佛所作已辦，曉了諸法，慧無儔匹；",
        "translation": "Having accomplished what buddhas of the past had done, they comprehended all things; their knowledge and wisdom were unparalleled.",
        "source": "T12n0342_002:0150c24_18"
    },
    {
        "source_sentence": "其所說法靡不應時，見諸如來，常懷恭恪，稽首自歸。",
        "translation": "Whenever they saw the buddhas, they always honored them and bowed their heads in homage to them.",
        "source": "T12n0342_002:0150c25_19"
    },
    {
        "source_sentence": "今執利劍走向如來，佛告之曰：『且止，且止！",
        "translation": "Now, he's holding a sharp sword and heading for the Tathāgata, and the Buddha tells him, 'Stop, stop!",
        "source": "T12n0342_002:0150c26_20"
    },
    {
        "source_sentence": "文殊師利勿造逆害，當以善害。』",
        "translation": "Mañjuśrī, don't do harmful things; you will harm them with goodness.'",
        "source": "T12n0342_002:0150c27_21"
    },
    {
        "source_sentence": "若分別此，察其本際不可分別，何所佛名及法聖眾，父母羅漢及廟寺名，",
        "translation": "If we discriminate this, we can't discern the original extent of it. What are the names of the buddhas and the holy ones of the Dharma, their parents, the arhats, and the names of temples?",
        "source": "T12n0342_002:0150c28_22"
    },
    {
        "source_sentence": "其受虛無則無歸趣，亦無報應。",
        "translation": "If their sensation is empty and nonexistent, then there's no retribution or reward.",
        "source": "T12n0342_002:0150c29_23"
    },
    {
        "source_sentence": "設一切法虛無不實，所受諸法亦復虛妄，幻譬如空，亦如芭蕉、夢影、野馬，",
        "translation": "Suppose all things are false and not real, and the things they receive are also false, illusory like space, or like plantains, dream shadows, or wild horses.",
        "source": "T12n0342_002:0151a01_24"
    },
    {
        "source_sentence": "離欲虛妄而無堅固，以是之故彼無有罪亦無害者。",
        "translation": "Being free of desire is false and not resolute, and because of this, they have no faults and no harmfulness.",
        "source": "T12n0342_002:0151a03_25"
    },
    {
        "source_sentence": "誰有殺者？",
        "translation": "Who has a killer?",
        "source": "T12n0342_002:0151a04_26"
    },
    {
        "source_sentence": "何謂受殃？」",
        "translation": "What's meant by suffering misfortune?",
        "source": "T12n0342_002:0151a04_27"
    },
    {
        "source_sentence": "如是觀察，惟念本末，則能了知一切諸法，本悉清淨，皆無所生。",
        "translation": "Observing them in this way, they can only think of the beginning and end to be able to know that all dharmas are inherently pure, producing nothing at all.",
        "source": "T12n0342_002:0151a04_28"
    },
    {
        "source_sentence": "五百菩薩聞是亘然，尋時逮得無所從生法忍；",
        "translation": "When five hundred enlightening beings heard this teaching, they instantly attained the tolerance of the principle that comes from nowhere.",
        "source": "T12n0342_002:0151a06_29"
    },
    {
        "source_sentence": "有千比丘遠塵離垢，得法眼淨；",
        "translation": "A thousand monks, far removed from the dust and dirt, attained purity of the eye of enlightenment.",
        "source": "T12n0342_002:0151a07_30"
    },
    {
        "source_sentence": "五百菩薩欣然大悅，善心生焉，心戢靜思，踊在虛空，去地四丈九尺。",
        "translation": "The five hundred bodhisattvas were delighted and greatly pleased, and their good intentions arose. With an attitude of pity and quiet thought, they rose up into the sky four zhang and nine chi above the ground.",
        "source": "T12n0342_002:0151a08_31"
    },
    {
        "source_sentence": "「諸法悉如幻，　　從想而橫起，",
        "translation": "“All things are like illusions, produced horizontally from conceptions.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　成形無所有，　　諸法悉為空。",
        "translation": "Form form has no existence, All things are emptiness.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　反自發望想，　　有我而危身，",
        "translation": "Instead, they give rise to thoughts of hope for self and have a self that puts their bodies in danger.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　已識其宿命，　　所作罪甚重。",
        "translation": "Knowing their past lives, the sins they commit are too great.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　往者懷大逆，　　自圖其父母，",
        "translation": "Those who went there harbored great hatred And plotted against their own parents.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　害羅漢比丘，　　犯殃釁甚劇。",
        "translation": "To harm an arhat monk is a grave offense.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　由此重罪故，　　更苦不可計，",
        "translation": "As a result of these grave sins, even more pain is incalculable.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　今墮於疑網，　　得聽空法誼。",
        "translation": "Now that they've fallen into the web of doubt, they'll be able to hear the teaching of emptiness.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　聖尊裂結網，　　棄捐憂結創，",
        "translation": "The holy and venerable One has severed the fetters of enmity, Removing the fetters of sorrow.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　覺了於法界，　　寂無有塵勞。",
        "translation": "He perceives the realm of reality, which is quiescent and without dust or trouble.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　諸佛權方便，　　隨流接度人，",
        "translation": "The buddhas' expedient means are to follow the flow and save people.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　趣欲濟眾生，　　決除所沈吟。",
        "translation": "Those who want to save sentient beings are freed from their sinking and wailing with certainty.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　無佛無經法，　　亦不得聖眾，",
        "translation": "There are no buddhas, no scriptures, and no teachings, Nor can the holy ones.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　彼亦無父母，　　悉空而自然。",
        "translation": "They also have no parents, All empty but spontaneous.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　則無吾我人，　　無壽亦無命，",
        "translation": "Then there would be no self, no self, and no person. There would be no longevity and no life.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　無常不斷滅，　　諸法如虛空。",
        "translation": "Impermanent and unceasing, all things are like space.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　無罪無報應，　　無作無不作，",
        "translation": "There is no sin, no retribution, and no action or non-action.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　莫貪身見我，　　更歷受苦惱。",
        "translation": "Don't crave the view of self in body, and you'll experience suffering and distress.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　彼無有生者，　　亦無有死者，",
        "translation": "They have no birth and no death, And neither is there birth nor death.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　所生如幻化，　　是為諸法相。",
        "translation": "What's produced like an illusion is the characteristic of all dharmas.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　文殊大智慧，　　諸法度無極，",
        "translation": "Mañjuśrī’s great wisdom saves all dharmas without limit.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　手自執利劍，　　馳走向如來。",
        "translation": "Holding a sharp sword in his hand, he rushed toward the Tathāgata.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　佛亦如利劍，　　二事同一相，",
        "translation": "The Buddha is also like a sharp sword: Two things are the same as one characteristic.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　無生無所有，　　亦無有害者。",
        "translation": "Nothing arises, nothing exists, and there's no harmfulness.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　兩足尊見之，　　眾生所作罪，",
        "translation": "The two-legged honored one saw the sins committed by sentient beings,",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　令知殃福業，　　亦悉是空耳。",
        "translation": "Causing people to know bad and meritorious actions is also empty.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　其能達空者，　　三世無壽命，",
        "translation": "Those who can understand emptiness have no life span in the three worlds.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　因緣而合成，　　解乃無從生。",
        "translation": "When they are compiled by causes and conditions, Understanding does not arise from them.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　無罪無報應，　　亦復無苦樂，",
        "translation": "There’s no sin, no retribution, and no pain or pleasure.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　吾我亦常空，　　倚想求安隱。",
        "translation": "The self and self are also always empty, Relying on conceptions to seek peace.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　眾生處顛倒，　　亦能如本際，",
        "translation": "Where sentient beings are in error, They can also do as before.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　非常苦悉空，　　非身無所有，",
        "translation": "They are impermanent, painful, and completely empty, And have no existence in body or mind.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　其能曉如斯，　　則免三惡趣。",
        "translation": "If someone can understand it like this, they'll be spared the three bad destinies.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　諸佛無作業，　　覺者無所造，",
        "translation": "The Buddhas have no action, And the enlightened ones do not create anything.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　計罪佛亦如，　　是故名曰佛。",
        "translation": "The Buddha who imagines sin is also like this, which is why he's called a buddha.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　如佛所解達，　　明審了若此，",
        "translation": "As the Buddha understands it, So clearly and precisely do they understand it.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　識別虛無生，　　由是暢聖慧，",
        "translation": "Discrimination of space and non-origination is the exposition of holy wisdom.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　住於虛空義，　　演說無所住。",
        "translation": "Abiding in the meaning of space, he explains that there's no place to abide.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　其身如虛空，　　二事俱自然，",
        "translation": "Their bodies are like space, naturally created by both things.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　若欲求佛慧，　　彼法無罣礙。",
        "translation": "If someone wants to pursue the Buddha's wisdom, their teaching is unobstructed.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　以知此本際，　　成佛無上道，",
        "translation": "Knowing this original state, They become buddhas of the highest path.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　於世致大聖，　　度眾生苦惱。",
        "translation": "In the world, he's a great sage who saves sentient beings from suffering and distress.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　盡除因緣報，　　奉修佛大道，",
        "translation": "Extinguishing the karmic retribution of causes and conditions, they cultivate the Buddha’s path.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "　當成為法王，　　明眼乃滅度。」",
        "translation": "He'll become the king of the Dharma, and then the luminous eye will be liberated.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "以偈讚佛：五百菩薩宣是執劍經典之時，十方江河沙等佛土，六反震動，",
        "translation": "The Buddha was praised in verse: When the five hundred bodhisattvas proclaimed this scripture, rivers and sands in the ten directions shook as many buddha-lands as there were six times.",
        "source": "T12n0342_002:0151a09_32"
    },
    {
        "source_sentence": "其大光明普照世間。",
        "translation": "That great ray of light universally illuminates the world.",
        "source": "T12n0342_002:0151b26_33"
    },
    {
        "source_sentence": "其於十方諸佛大聖邊諸侍者，各自問佛：「此何威德？",
        "translation": "The attendants at the sides of the buddhas and great sages in the ten directions each asked the Buddha, What's this authoritative quality?",
        "source": "T12n0342_002:0151b26_34"
    },
    {
        "source_sentence": "地大震動，光靡不照。」",
        "translation": "The earth shakes so greatly that its light doesn't shine.",
        "source": "T12n0342_002:0151b28_35"
    },
    {
        "source_sentence": "於時，諸佛各告侍者：「族姓子知，有界名忍，佛號能仁，頒宣經道。",
        "translation": "The buddhas then each told their attendants, clansmen, know that there's a realm called forbearance, and the Buddha is called Nengren, who proclaims the sūtras and path.",
        "source": "T12n0342_002:0151b28_36"
    },
    {
        "source_sentence": "彼有菩薩，名文殊師利，成不退轉，手執利劍馳走向佛，欲得開化不達菩薩。",
        "translation": "There's a bodhisattva there named Mañjuśrī who accomplishes nonretrogression and rushes toward the Buddha with a sharp sword in his hand, wanting to enlighten and transform the bodhisattva who doesn't understand.",
        "source": "T12n0342_002:0151c01_37"
    },
    {
        "source_sentence": "因是之故，時佛大聖手執慧刀斷生死原，如應說法，勸無央數眾生之類，",
        "translation": "Because of this, the great sage Buddha then took the sword of wisdom in his hand and cut off the realm of birth and death. He taught the Dharma as it should be taught, exhorting countless sentient beings:",
        "source": "T12n0342_002:0151c02_38"
    },
    {
        "source_sentence": "使眼清淨、心得解脫，逮成法忍，學住大道。」",
        "translation": "They make their eyes pure and their minds liberated, attain the forbearance of the Dharma, and train in the great path.",
        "source": "T12n0342_002:0151c04_39"
    },
    {
        "source_sentence": "於是大世尊以方便隨建立神化，於彼眾會有新學人，德本尠薄多懷妄想，",
        "translation": "The great world-honored one then, using skillful means to establish his supernatural emanation, assembled the newly enlightened disciples in those assemblies. Their virtuous roots were weak and they often harbored delu",
        "source": "T12n0342_002:0151c05_40"
    },
    {
        "source_sentence": "不見執劍，不聞說法，佛之聖旨故令其然。",
        "translation": "They don't see someone holding a sword and don't hear the teaching, so it's because of the Buddha's noble teaching that they cause it to be so.",
        "source": "T12n0342_002:0151c07_41"
    },
    {
        "source_sentence": "時舍利弗問文殊師利：「仁於向者所作凶逆，以何為信，乃能執劍馳走向佛？」",
        "translation": "Śāriputra then asked Mañjuśrī, What is the reason you're so faithful that you can carry a sword and chase it to the Buddha?",
        "source": "T12n0342_002:0151c08_0"
    },
    {
        "source_sentence": "文殊師利答舍利弗：「如卿所言，汝所作逆不可稱載，用不能達此報償故。",
        "translation": "Mañjuśrī answered Śāriputra, As you said, what you've done is so heinous that it can't be claimed or carried, and it's because you can't get this reward.",
        "source": "T12n0342_002:0151c09_1"
    },
    {
        "source_sentence": "唯，舍利弗！",
        "translation": "Yes, Śāriputra!",
        "source": "T12n0342_002:0151c11_2"
    },
    {
        "source_sentence": "解此義者，知如幻師所造逆事，其幻化者寧有逆乎？",
        "translation": "Understanding this meaning, he knows that it's like the illusory master who creates a heinous act, so how could an illusory transformation have any heinousness?",
        "source": "T12n0342_002:0151c11_3"
    },
    {
        "source_sentence": "報償亦如。",
        "translation": "The retribution is likewise.",
        "source": "T12n0342_002:0151c12_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0151c13_0"
    },
    {
        "source_sentence": "其幻師化無有想念，諸法亦然。",
        "translation": "The illusionist's transformation has no thoughts, and so are the teachings.",
        "source": "T12n0342_002:0151c13_1"
    },
    {
        "source_sentence": "唯，舍利弗！",
        "translation": "Yes, Śāriputra!",
        "source": "T12n0342_002:0151c14_0"
    },
    {
        "source_sentence": "吾欲相問，以誠相反。",
        "translation": "I want to ask you questions, but it's because of the opposite of sincerity.",
        "source": "T12n0342_002:0151c14_1"
    },
    {
        "source_sentence": "有此劍者乎？」",
        "translation": "Is there someone with this sword?",
        "source": "T12n0342_002:0151c14_2"
    },
    {
        "source_sentence": "答曰：「不也！」",
        "translation": "He replied, No!",
        "source": "T12n0342_002:0151c15_0"
    },
    {
        "source_sentence": "「為有罪耶？」",
        "translation": "Is there a sin?",
        "source": "T12n0342_002:0151c15_1"
    },
    {
        "source_sentence": "答曰：「不也！」",
        "translation": "He replied, No!",
        "source": "T12n0342_002:0151c15_2"
    },
    {
        "source_sentence": "「唯，舍利弗！",
        "translation": "Yes, Śāriputra!",
        "source": "T12n0342_002:0151c15_3"
    },
    {
        "source_sentence": "罪業虛無，報亦虛無，罪業報應悉虛無者。",
        "translation": "Sins and actions are empty, and the rewards of sins and actions should all be empty.",
        "source": "T12n0342_002:0151c15_4"
    },
    {
        "source_sentence": "云何復欲知其處所？」",
        "translation": "How do you further want to know where it is?",
        "source": "T12n0342_002:0151c16_5"
    },
    {
        "source_sentence": "舍利弗言：「如文殊師利今者所說，無罪無報，一切諸法悉無罪報。",
        "translation": "Śāriputra said, As Mañjuśrī now explains, there's no sin or retribution, and all dharmas are completely without sinful retribution.",
        "source": "T12n0342_002:0151c17_6"
    },
    {
        "source_sentence": "此言何謂？」",
        "translation": "What does this mean?",
        "source": "T12n0342_002:0151c18_7"
    },
    {
        "source_sentence": "文殊師利言：「於意云何？",
        "translation": "Mañjuśrī said, What do you think?",
        "source": "T12n0342_002:0151c19_8"
    },
    {
        "source_sentence": "唯，舍利弗！",
        "translation": "Yes, Śāriputra!",
        "source": "T12n0342_002:0151c19_9"
    },
    {
        "source_sentence": "吾所執劍，何所鍛師推成之乎？",
        "translation": "What did the skilled smith presume to make my sword?",
        "source": "T12n0342_002:0151c19_10"
    },
    {
        "source_sentence": "誰捉持來以相授耶？」",
        "translation": "Who will take it and give it to you?",
        "source": "T12n0342_002:0151c20_11"
    },
    {
        "source_sentence": "舍利弗言：「無作此劍，無執來者以相授也，文殊師利所化現耳。」",
        "translation": "Śāriputra said, Don't make this sword; no one who holds it will give it to you; it's what Mañjuśrī teaches.",
        "source": "T12n0342_002:0151c21_0"
    },
    {
        "source_sentence": "文殊又問：「仁能見得化人處乎？",
        "translation": "Mañjuśrī also asked, Can you see the place where people are transformed?",
        "source": "T12n0342_002:0151c22_1"
    },
    {
        "source_sentence": "刀劍所在？」",
        "translation": "Where is the sword?",
        "source": "T12n0342_002:0151c23_2"
    },
    {
        "source_sentence": "「如來所言：『一切諸法悉如幻化。』",
        "translation": "The Tathāgata says, 'All dharmas are completely illusory.'",
        "source": "T12n0342_002:0151c23_3"
    },
    {
        "source_sentence": "其相無相，不可得處也！」",
        "translation": "Its characteristics have no characteristics, and it's not a place to be found!",
        "source": "T12n0342_002:0151c24_4"
    },
    {
        "source_sentence": "「唯，舍利弗！",
        "translation": "Yes, Śāriputra!",
        "source": "T12n0342_002:0151c24_5"
    },
    {
        "source_sentence": "當解斯義，如來至真亦如利劍，文殊及舍利弗亦如，無本眾生亦如，諸法亦如，",
        "translation": "You should understand that the Tathāgata’s ultimate truth is also like a sharp sword. So are Mañjuśrī and Śāriputra; so are sentient beings who have no root, and so are all dharmas.",
        "source": "T12n0342_002:0151c24_6"
    },
    {
        "source_sentence": "無本所住亦復若茲。",
        "translation": "The absence of what's originally abiding is likewise here.",
        "source": "T12n0342_002:0151c26_7"
    },
    {
        "source_sentence": "唯，舍利弗！",
        "translation": "Yes, Śāriputra!",
        "source": "T12n0342_002:0151c27_8"
    },
    {
        "source_sentence": "如一切法悉無根本，吾所興罪、報應執劍，其亦如也！",
        "translation": "Just as all dharmas lack a root, so too does the sins I commit and the rewards I receive for holding a sword are likewise!",
        "source": "T12n0342_002:0151c27_9"
    },
    {
        "source_sentence": "所積殃釁亦無本也！",
        "translation": "There's no basis for the accumulated evils!",
        "source": "T12n0342_002:0151c28_10"
    },
    {
        "source_sentence": "報應亦如也！",
        "translation": "So it is with the response!",
        "source": "T12n0342_002:0151c28_11"
    },
    {
        "source_sentence": "向舍利弗復更問言：『卿何以故，手執刀劍欲與佛諍？』",
        "translation": "Again, he asked Śāriputra, 'Why are you holding a sword in your hand and wanting to give it to the Buddha?'",
        "source": "T12n0342_002:0151c29_12"
    },
    {
        "source_sentence": "譬如修行在於閑居，勤向世尊心念不離，乃得解脫。」",
        "translation": "It's like someone who cultivates practice in a secluded place and diligently dedicates his mind to the Bhagavān without leaving it, and then they attain liberation.",
        "source": "T12n0342_002:0152a01_13"
    },
    {
        "source_sentence": "舍利弗又問：「靜思修行，云何世尊？",
        "translation": "Śāriputra again asked, What's the Bhagavān's practice of quiet contemplation?",
        "source": "T12n0342_002:0152a02_14"
    },
    {
        "source_sentence": "名曰何等？」",
        "translation": "What's the name?",
        "source": "T12n0342_002:0152a03_15"
    },
    {
        "source_sentence": "文殊答曰：「貪欲妄想則是精思修行，世尊！",
        "translation": "Mañjuśrī answered, The deluded conception of desire is the cultivation of diligence, Bhagavān!",
        "source": "T12n0342_002:0152a03_16"
    },
    {
        "source_sentence": "瞋恚愚戇欲除此三，永令無餘，寂然憺怕，爾乃亘然，不能蠲除一切塵勞，",
        "translation": "Desiring to get rid of these three, anger and ignorance, they want to permanently leave them without remainder. Quiescent and terrified, they are unable to extinguish all their defilements.",
        "source": "T12n0342_002:0152a04_17"
    },
    {
        "source_sentence": "不為世尊滅婬怒癡愛欲之難，乃為世尊貪欲意生，執此欲意一心念佛，",
        "translation": "It is not because the World-honored One wishes to extinguish the passions of lust, hatred, and folly. Rather it is because the desire for sensual pleasure has arisen in the mind of the World-honored One. He clings",
        "source": "T12n0342_002:0152a06_18"
    },
    {
        "source_sentence": "欲即消滅，恚癡亦然，而得解脫。",
        "translation": "Desire ceases, and so does anger and delusion, and they attain liberation.",
        "source": "T12n0342_002:0152a07_19"
    },
    {
        "source_sentence": "是故，舍利弗！",
        "translation": "Therefore, Śāriputra!",
        "source": "T12n0342_002:0152a08_20"
    },
    {
        "source_sentence": "如執利劍馳向世尊，如幻無害；",
        "translation": "It is as if they were holding a sharp sword and rushed toward the World-honored One, like illusions that are harmless.",
        "source": "T12n0342_002:0152a08_21"
    },
    {
        "source_sentence": "懷三毒者馳心念佛，塵勞悉除，亦如修行閑居專精，一心念佛乃得解脫。」",
        "translation": "Those harboring the three poisons rushed to mindfulness of the Buddha, and their defilements were all removed, just as they cultivated quietude and concentrated on mindfulness of the Buddha with one mind and attained liberation.",
        "source": "T12n0342_002:0152a09_22"
    },
    {
        "source_sentence": "舍利弗言：「善哉，善哉！",
        "translation": "Śāriputra said, Good, good!",
        "source": "T12n0342_002:0152a11_23"
    },
    {
        "source_sentence": "快說此言，誠如所云。」",
        "translation": "Quickly say these words, as they really are.",
        "source": "T12n0342_002:0152a11_24"
    },
    {
        "source_sentence": "爾時十方諸會菩薩啟請世尊：「唯然大聖！",
        "translation": "It was then that the bodhisattvas of the assembly in the ten directions asked the Bhagavān, Yes, Great Sage!",
        "source": "T12n0342_002:0152a12_25"
    },
    {
        "source_sentence": "勸文殊師利，願垂屈意，顧眄我等諸佛剎土，於諸剎土頒宣經道，皆令眾生解是意義。」",
        "translation": "Encouraging Mañjuśrī, I wish to bend my mind and look out for the buddha-lands of our buddhas and proclaim the sūtras and paths in those buddha-lands so that all sentient beings will understand this meaning.",
        "source": "T12n0342_002:0152a13_26"
    },
    {
        "source_sentence": "文殊師利報諸菩薩：「仁等各自察其佛土。」",
        "translation": "Mañjuśrī replied to the bodhisattvas, Sirs, Each of you should examine their own buddha land.",
        "source": "T12n0342_002:0152a15_27"
    },
    {
        "source_sentence": "諸族姓子尋時受教，各觀本土十方處所——各各皆見文殊師利，在於十方諸佛邊住，",
        "translation": "Each of them saw Mañjuśrī dwelling beside the buddhas of the ten directions.",
        "source": "T12n0342_002:0152a16_0"
    },
    {
        "source_sentence": "講說經道。",
        "translation": "He taught the sūtras and paths.",
        "source": "T12n0342_002:0152a17_1"
    },
    {
        "source_sentence": "善住意天子諮問、啟受，宣此如幻所行意義經典之要。",
        "translation": "The well-abiding celestial son asked questions and enlightened them, proclaiming the essentials of this sūtra that's like an illusory practice of meaning.",
        "source": "T12n0342_002:0152a18_2"
    },
    {
        "source_sentence": "諸菩薩等聚會亦然，不可稱計，諸天子會多少無異。",
        "translation": "So it is with the assembly of bodhisattvas and so forth, which can't be measured; the number of gods and goddesses in the assembly isn't different.",
        "source": "T12n0342_002:0152a19_3"
    },
    {
        "source_sentence": "彼諸佛國皆若干種清淨莊嚴，巍巍無量，亦如忍土等無差特——遙見如斯，",
        "translation": "Those buddha-lands all had various kinds of pure adornments, majestic and immeasurable, like the land of forbearance and so forth, without distinctions.",
        "source": "T12n0342_002:0152a20_4"
    },
    {
        "source_sentence": "莫不忻然，各各舉聲而稱揚言，以為忻慶：「文殊師利道德殊絕，威神光明智無儔匹，",
        "translation": "Each was delighted, and each raised his voice to praise it. They thought they were delighted, saying, Mañjuśrī’s moral virtue is extraordinary; his majesty, light, and wisdom are incomparable.",
        "source": "T12n0342_002:0152a22_5"
    },
    {
        "source_sentence": "威德殊邈過於日月，住此忍土而不移轉，普現十方諸佛國土。」",
        "translation": "Their authoritative qualities are so vast that they surpass the sun and moon, abide in this land of forbearance without moving, and universally manifest the buddha-lands of the ten directions.",
        "source": "T12n0342_002:0152a24_6"
    },
    {
        "source_sentence": "文殊師利於時引喻：「如族姓子幻士善學幻術，絕世而無儔匹，不起于坐，",
        "translation": "Mañjuśrī then quoted a metaphor: Just as clansmen and illusionists who are well versed in the arts of illusion have no equal in the world, so they won't get up to their seats.",
        "source": "T12n0342_002:0152a25_7"
    },
    {
        "source_sentence": "所在幻化現若干形。",
        "translation": "Where they are, they're illusory and manifest in various forms.",
        "source": "T12n0342_002:0152a27_8"
    },
    {
        "source_sentence": "菩薩如是，真學曉了般若波羅蜜，分別法幻，悉通其旨。",
        "translation": "Thus, the bodhisattva truly trains and understands the perfection of prajñā-pāramitā, discerns dharmas and illusions, and fully understands their meaning.",
        "source": "T12n0342_002:0152a27_9"
    },
    {
        "source_sentence": "在於此土，初不移轉十方佛土，諸欲見者，輒現其身於其佛界。",
        "translation": "In this land, the first buddha land of the ten directions that doesn't move is a buddha land, and those who want to see it will often show their bodies in the Buddha realm.",
        "source": "T12n0342_002:0152a28_10"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0152b01_11"
    },
    {
        "source_sentence": "一切諸法皆如幻故，由是之故所現無難。",
        "translation": "All dharmas are illusory, so it's not difficult to manifest them because of that.",
        "source": "T12n0342_002:0152b01_12"
    },
    {
        "source_sentence": "由如月殿遊行虛空，不下人間，不念往來，其光所照靡所不遍，雖有所照，",
        "translation": "Because the moonlike palace travels through space, not descending from the human realm, and does not think of past or future. The light illumines everything without pervading it, even though it illuminates something.",
        "source": "T12n0342_002:0152b02_13"
    },
    {
        "source_sentence": "亦無想念。",
        "translation": "There's also no perception or thought.",
        "source": "T12n0342_002:0152b04_14"
    },
    {
        "source_sentence": "菩薩如是，在於本際未曾移轉，普現十方諸佛之土——為現佛身、聲聞、緣覺，",
        "translation": "“In the same way, enlightening beings have never moved from their original state: they manifest everywhere in the buddha-lands of the ten directions to show buddha-bodies, disciples, and solitary realizers.",
        "source": "T12n0342_002:0152b04_15"
    },
    {
        "source_sentence": "為現轉輪、釋梵、四王，或為豪貴、貧賤、困厄身，或入三惡勤苦惱事，",
        "translation": "In order to show the wheel-turning, the Śakra Devānām-Indra, and the four kings, some become wealthy, poor, and in distress, or enter the three evil, painful, and troubled states of existence.",
        "source": "T12n0342_002:0152b06_0"
    },
    {
        "source_sentence": "或為儒林、帝王、大臣，或在外道謗佛云云，或入深山學為仙人——所現無限，",
        "translation": "Or they may become Confucian scholars, emperors, ministers, or non-Buddhists who denigrate Buddhist teachings; or they may enter deep into the mountains to study as sages and show infinity.",
        "source": "T12n0342_002:0152b07_1"
    },
    {
        "source_sentence": "一切依因，悉令得至無上正真。",
        "translation": "All the causes that are relied upon, they all allow them to attain the unsurpassed true.",
        "source": "T12n0342_002:0152b09_2"
    },
    {
        "source_sentence": "所現雖爾，亦無想念。」",
        "translation": "Even so, there's no perception or thought of what's manifested.",
        "source": "T12n0342_002:0152b09_3"
    },
    {
        "source_sentence": "爾時世尊告文殊師利：「假使有人，值遇此法而得聞者，如佛興世等無有異。",
        "translation": "It was then that the Bhagavān addressed Mañjuśrī, Suppose someone meets this teaching and hears it, just as the Buddha arises in the world without any difference.",
        "source": "T12n0342_002:0152b10_4"
    },
    {
        "source_sentence": "若有菩薩，坐於樹下當成佛道，其聞是經福等無殊，亦等道跡、往來、不還、無著。",
        "translation": "Suppose there's a bodhisattva who sits under a tree and will attain the Buddha Way, and he hears the merit of this sūtra without distinction, which is equal to the traces of the path, past and future, nonreturners,",
        "source": "T12n0342_002:0152b12_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0152b13_1"
    },
    {
        "source_sentence": "是為去來現在諸佛要道。」",
        "translation": "This is the essential path of the buddhas of the past, future, and present.",
        "source": "T12n0342_002:0152b14_0"
    },
    {
        "source_sentence": "文殊白佛：「誠如聖教，安住所化無不受教，如空無想無願平均，法等亦然。",
        "translation": "Mañjuśrī said to the Buddha, It's really like the noble teaching that abiding and transforming are neither received nor taught, just as emptiness, absence of ideation, and wishlessness are evenly balanced, and so are",
        "source": "T12n0342_002:0152b14_1"
    },
    {
        "source_sentence": "又如無本本際平等，亦如離欲定意平等，是法平等亦復若斯。」",
        "translation": "Also, just as there's no fundamental equality at the original end and equal equality in freedom from desire and concentration of mind, so it's likewise with the equality of dharmas.",
        "source": "T12n0342_002:0152b16_2"
    },
    {
        "source_sentence": "文殊師利復白佛言：「大聖垂恩，建立此法，使於後世殘末五濁悖亂之俗，",
        "translation": "Mañjuśrī then said to the Buddha: O Great Sage, you have established this doctrine so that in later ages the world may be left untouched by the degeneracy of the five turbid and oppressive customs.",
        "source": "T12n0342_002:0152b17_3"
    },
    {
        "source_sentence": "若族姓子及族姓女，學菩薩意求大乘者，耳聞此法，令諸眾生求滅度者，",
        "translation": "If there are clansmen and clanswomen who study the bodhisattva’s mind and seek the Great Vehicle, their ears hear this teaching so that sentient beings may seek liberation.",
        "source": "T12n0342_002:0152b19_4"
    },
    {
        "source_sentence": "悉當蒙是道德法明，各使得所。」",
        "translation": "They'll all be endowed with the insight of these moral principles, and each will allow them to do so.",
        "source": "T12n0342_002:0152b21_5"
    },
    {
        "source_sentence": "佛默然可。",
        "translation": "The Buddha remained silent and agreed.",
        "source": "T12n0342_002:0152b21_6"
    },
    {
        "source_sentence": "應時三千大千世界六反震動，箜篌樂器不鼓自鳴，諸華果樹及諸枯樹皆生華實，",
        "translation": "At that moment, the great manifold cosmos of the 3,000 worlds shook in six ways. Music instruments and musicians sounded without drumming; flowers, fruits, and withered trees all gave forth their blooming fruit.",
        "source": "T12n0342_002:0152b22_0"
    },
    {
        "source_sentence": "其大光明普照世間，皆蔽日月令無光曜，億百千天住於虛空，歡喜踊躍而雨眾華，",
        "translation": "That great ray of light shone everywhere in the world, obscuring the sun and moon so that they did not shine brightly. Hundreds of millions of celestial beings dwelt in the sky, joyful and ecstatic, raining down myriad flowers",
        "source": "T12n0342_002:0152b23_1"
    },
    {
        "source_sentence": "燒諸名香，復雨雜香擣香，其香芬馥翳於十方，鼓天妓樂其聲清和，悉共叉手，",
        "translation": "It burns all kinds of famous incense and also rains down a mixed fragrant odor that fills the ten directions. The sound of heavenly music is pure and harmonious, joining together like palms joined.",
        "source": "T12n0342_002:0152b25_2"
    },
    {
        "source_sentence": "異口同音，舉聲歌頌：「妙哉，妙哉！",
        "translation": "The monks spoke with one voice, raising their voices and chanting, Marvelous, wonderful!",
        "source": "T12n0342_002:0152b27_3"
    },
    {
        "source_sentence": "此法難遇。",
        "translation": "This is a difficult thing to encounter.",
        "source": "T12n0342_002:0152b28_4"
    },
    {
        "source_sentence": "文殊所講，我等僥倖得聞大化，今日再值轉法輪矣！",
        "translation": "What Mañjuśrī teaches, we've fortunately heard the great teaching, and today we'll again turn the Dharma wheel!",
        "source": "T12n0342_002:0152b28_5"
    },
    {
        "source_sentence": "閻浮利人為蒙大慶得聞是經，斯等德本終不唐舉，速近受決，當成佛道，",
        "translation": "The people of Jambudvfpa were greatly delighted to hear this scripture. Such virtuous monks and nuns did not cite it in vain but quickly received the prediction that they would attain buddhahood.",
        "source": "T12n0342_002:0152b29_6"
    },
    {
        "source_sentence": "多所開化。」",
        "translation": "There are many things that are enlightened.",
        "source": "T12n0342_002:0152c02_7"
    },
    {
        "source_sentence": "於是世尊讚諸菩薩及諸天子：「善哉，善哉！",
        "translation": "The Bhagavān then praised the bodhisattvas and celestial beings, Good, good!",
        "source": "T12n0342_002:0152c02_8"
    },
    {
        "source_sentence": "如卿等言。",
        "translation": "As you say.",
        "source": "T12n0342_002:0152c03_9"
    },
    {
        "source_sentence": "其聞是法，佛明此等當成佛道以入滅度，聞之不恐亦不懷懅，篤信愛樂，",
        "translation": "When they hear this teaching, the Buddha knows that all of them will attain buddhahood in order to enter nirvana. Having heard it, they are neither frightened by fear nor harboring hatred; they deeply believe and love it.",
        "source": "T12n0342_002:0152c03_10"
    },
    {
        "source_sentence": "不在生死，亦不滅度。」",
        "translation": "They aren't in birth-and-death, and they won't be liberated.",
        "source": "T12n0342_002:0152c05_11"
    },
    {
        "source_sentence": "文殊師利白佛言：「世尊！",
        "translation": "Mañjuśrī said to the Buddha, Bhagavān!",
        "source": "T12n0342_002:0152c05_12"
    },
    {
        "source_sentence": "所建於斯經典，今現感動，為先瑞應，然於後世普流十方。」",
        "translation": "The sūtras that were built in this scripture are now moved, as predicted by the gods of the past, but they will continue to flow throughout the ten directions in the future.",
        "source": "T12n0342_002:0152c06_13"
    },
    {
        "source_sentence": "佛言：「如是，文殊師利！",
        "translation": "The Buddha said, So it is, Mañjuśrī!",
        "source": "T12n0342_002:0152c07_14"
    },
    {
        "source_sentence": "今所瑞應皆是建立此法威恩，如來弘慈，聖旨令然一切蒙濟。」",
        "translation": "All the auspicious signs that we see now should be the authoritative benevolence of establishing this teaching, and the Tathāgata is so generous and compassionate as to cause all people to be saved by the holy decree.",
        "source": "T12n0342_002:0152c08_15"
    },
    {
        "source_sentence": "佛語文殊：「當復重顯斯深經典，佛言至誠，終不虛妄，此三脫門多所救濟，",
        "translation": "The Buddha said to Mañjuśrī: Again, you should reveal this profound scripture. The words of the Buddha are spoken with utmost sincerity and never false. These three liberations are often rescued through various means.",
        "source": "T12n0342_002:0152c09_16"
    },
    {
        "source_sentence": "當令此法後世普流。」",
        "translation": "You will cause this teaching to spread throughout the afterlife.",
        "source": "T12n0342_002:0152c11_17"
    },
    {
        "source_sentence": "文殊師利復白佛言：「我亦堪任建立此法演真章句。",
        "translation": "Mañjuśrī then said to the Buddha, I'm also capable of establishing this teaching and expounding the true chapter and verse.",
        "source": "T12n0342_002:0152c11_18"
    },
    {
        "source_sentence": "無我無人，無壽無命，無意無可，不墮斷滅，不墮計常，無有塵勞，亦無諍訟，",
        "translation": "There is no self, no person, no life, no duration, and no ideation; there is neither thought nor action. They do not fall into cessation or annihilation, they do not fall into the eternalism of attachment, they have no",
        "source": "T12n0342_002:0152c12_19"
    },
    {
        "source_sentence": "則為光顯於此經典。",
        "translation": "That's the illumination that reveals this sūtra.",
        "source": "T12n0342_002:0152c14_20"
    },
    {
        "source_sentence": "如我至誠、所言不虛，然後將來五濁之世令普流布。",
        "translation": "As I am sincere and what I say is not false, I will cause it to spread throughout the five turbid worlds in the future.",
        "source": "T12n0342_002:0152c15_21"
    },
    {
        "source_sentence": "吾今要誓，不具成佛，無法聖眾，無罪報應，無去無來。",
        "translation": "Now, I must make a vow that I won't fully become a buddha, have no no noble people, have no sins to repay, and have no going or coming.",
        "source": "T12n0342_002:0152c16_22"
    },
    {
        "source_sentence": "以此至言，令是要法於將來世皆遍流布。",
        "translation": "With these words of utmost sincerity, he causes the Dharma to be sought that it will spread everywhere in future lives.",
        "source": "T12n0342_002:0152c17_23"
    },
    {
        "source_sentence": "有了是經，而不受欲亦不離欲，無有恚癡而有慈心，無有智慧，無名無色，",
        "translation": "Having mastered this scripture, they neither experience desire nor become free of desire. They have no anger or delusion but are compassionate; they lack wisdom; they are nameless and formless.",
        "source": "T12n0342_002:0152c18_24"
    },
    {
        "source_sentence": "無緣無見，不興生死，無身不生身，無心不生念，不惟法、不意止，無五陰、無四大，",
        "translation": "They have no objects, no views, and do not give rise to birth or death. Without body they do not produce bodies, without mind they do not produce thoughts. They do not think of things as principles or mental states; they lack the five aggregates",
        "source": "T12n0342_002:0152c20_25"
    },
    {
        "source_sentence": "無諸入，眼色耳聲鼻香口味，身更心法亦復如是，不處欲界、色、無色界，",
        "translation": "The same applies to the eye, to matter, to the one of form, to the one of hearing, to the one of sound, to the one of the nose, to the one of smell and to the one of taste.",
        "source": "T12n0342_002:0152c21_26"
    },
    {
        "source_sentence": "心等如地而無憎愛，諸法不損亦無增長，則宣此經。",
        "translation": "The mind and so on are like the earth without hatred or craving, and all dharmas don't harm or grow, so they proclaim this sūtra.",
        "source": "T12n0342_002:0152c23_27"
    },
    {
        "source_sentence": "如斯經典後世普流，不在至誠，不覩審實，不讚說道，不至道果，亦無道迹，",
        "translation": "Such scriptures will be handed down in the ages to come. They are not sincere, they do not pay attention to what is true, they do not praise and teach the path, they do not reach the fruit of the path, and they have no traces",
        "source": "T12n0342_002:0152c24_28"
    },
    {
        "source_sentence": "不往來，無不還，不無著，不緣覺，無諸果證，不如來，無佛法，不無畏，",
        "translation": "They do not come or go, do not return, do not become attached, do not perceive by means of objects, do not experience results, do not be inferior, do not have the qualities of buddhahood, do not have fearlessness.",
        "source": "T12n0342_002:0152c26_29"
    },
    {
        "source_sentence": "無慧不慧，不聖不空不壽，不想不無想，不願不無願，不得果證，無見不見，",
        "translation": "They lack wisdom and don’t have wisdom, aren’t noble, aren’t empty, don’t live for long, don’t think and don’t have thoughts, don’t wish and don’t have wishes, don’t attain fruit",
        "source": "T12n0342_002:0152c27_30"
    },
    {
        "source_sentence": "不至道，無明無冥，亦無解脫，不度不無度，不彼際，不此岸，不中流，",
        "translation": "They do not reach the path of enlightenment, they lack knowledge and darkness, they lack liberation, they are not liberated or beyond liberation, they do not go to another shore, they do not come from another shore, they do not flow in",
        "source": "T12n0342_002:0152c29_31"
    },
    {
        "source_sentence": "無名無不名。",
        "translation": "There's no name, and there's no non-name.",
        "source": "T12n0342_002:0153a02_0"
    },
    {
        "source_sentence": "如是真言，當令此經後益流布。",
        "translation": "Such true words will cause this sūtra to spread further and further.",
        "source": "T12n0342_002:0153a02_1"
    },
    {
        "source_sentence": "又計是經，不應不脫，不精進無所懈，不勤力，不殆廢，以此至誠，法當普流，",
        "translation": "They think that this scripture neither should be abandoned nor relinquished, without exertion or laziness, without effort or striving, and without neglecting it. Because of their sincerity they believe that the Teaching will spread everywhere.",
        "source": "T12n0342_002:0153a03_0"
    },
    {
        "source_sentence": "往本所生，無去無來，過去無人，不度眾生，亦無滅度，人不可得，法無有起，",
        "translation": "Where there was originally something produced, there is neither going nor coming. There is no one in the past who did not save sentient beings, and there is no cessation or liberation. People cannot be obtained; phenomena cannot arise.",
        "source": "T12n0342_002:0153a04_1"
    },
    {
        "source_sentence": "亦無所滅，無有作者，亦無壞者，無將無反，不往不還，無舉無下，無當來佛，",
        "translation": "Nor is there anything to be destroyed, nothing to be done, and nothing to break down. There is no going or turning back, no going or coming, no rising or falling, and no Buddha in the future.",
        "source": "T12n0342_002:0153a06_2"
    },
    {
        "source_sentence": "如是像法無所照曜，無現在佛亦不暢法。",
        "translation": "Thus, there's nothing to illuminate the Dharma that resembles it, and there's no present Buddha or Dharma that doesn't communicate.",
        "source": "T12n0342_002:0153a08_3"
    },
    {
        "source_sentence": "以是之故，法當普流。",
        "translation": "Because of this, the Dharma will spread everywhere.",
        "source": "T12n0342_002:0153a09_4"
    },
    {
        "source_sentence": "是經所說，不戒不犯，不定不亂，不慧不愚，不解不縛，不慧見不無慧。",
        "translation": "This is what the sūtra teaches, not observing precepts or violating them, not being fixed or disturbed, not having wisdom or foolishness, not understanding or binding, not seeing without wisdom and not lacking wisdom.",
        "source": "T12n0342_002:0153a09_5"
    },
    {
        "source_sentence": "此正真言，令經普流。",
        "translation": "This is the true saying that causes the sūtras to spread everywhere.",
        "source": "T12n0342_002:0153a11_6"
    },
    {
        "source_sentence": "不施不慳，不戒不毀，不忍不諍，不進不殆，不禪不亂，不智慧不愚闇。",
        "translation": "They are neither generosity nor stinginess, neither morality nor disparagement, neither tolerance nor hatred, neither advancing nor shrinking, neither meditation nor disorder, and neither wisdom nor ignorance.",
        "source": "T12n0342_002:0153a11_7"
    },
    {
        "source_sentence": "菩薩大士！",
        "translation": "Bodhisattva Mahāprajñāpāramitā!",
        "source": "T12n0342_002:0153a13_8"
    },
    {
        "source_sentence": "此真諦言令法普流，無凡夫，無學者、無羅漢、無緣覺、無佛道，不因緣不無緣。",
        "translation": "This true truth says that it causes the Dharma to flow everywhere, with no worldlings, no scholars, no arhats, no pratyekabuddhas, and no buddhas or paths, and neither causes nor conditions.",
        "source": "T12n0342_002:0153a13_9"
    },
    {
        "source_sentence": "當令此法普流世間。",
        "translation": "You will cause this teaching to spread throughout the world.",
        "source": "T12n0342_002:0153a15_10"
    },
    {
        "source_sentence": "不坐佛樹，不轉法輪，不歎佛。",
        "translation": "They don't sit at the Buddha's tree, don't turn the wheel of the Dharma, and don't praise the Buddha.",
        "source": "T12n0342_002:0153a15_11"
    },
    {
        "source_sentence": "佛不現在，不眾生，不滅度，不如來。",
        "translation": "The Buddha doesn't appear, doesn't sentient beings, and doesn't cease to be liberated, so it's not like the Tathāgata.",
        "source": "T12n0342_002:0153a16_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0153a17_13"
    },
    {
        "source_sentence": "一切諸法永至滅度，當令此經普流世間。」",
        "translation": "All dharmas will permanently reach cessation, and this sūtra will cause it to spread throughout the world.",
        "source": "T12n0342_002:0153a17_14"
    },
    {
        "source_sentence": "文殊師利宣是建立經典要時，此三千大千世界六反震動，其大光明普照十方，",
        "translation": "When Mañjuśrī proclaimed the essentials of the scripture, these 3,000 great one-thousand worlds quaked six times and their great light shone everywhere in the ten directions.",
        "source": "T12n0342_002:0153a18_15"
    },
    {
        "source_sentence": "虛空中唱無極音：「善哉，善哉！",
        "translation": "In the sky, he called out in an infinite voice, Good, good!",
        "source": "T12n0342_002:0153a20_16"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0342_002:0153a20_17"
    },
    {
        "source_sentence": "實如要誓。",
        "translation": "It's really like the essential vow.",
        "source": "T12n0342_002:0153a21_18"
    },
    {
        "source_sentence": "假使江河沙等諸魔官屬，欲求方便毀壞此經，欲令毀散，終不能亂此微妙法，",
        "translation": "Even if the officials of Māra’s armies, as numerous as the grains of sand in a great river, wanted to use expedient means to destroy this scripture and sought to cause it to be destroyed, they could not disturb this subtle teaching.",
        "source": "T12n0342_002:0153a21_19"
    },
    {
        "source_sentence": "令不流通所以建立是要法者。",
        "translation": "It causes them not to circulate, so it's established as a teaching.",
        "source": "T12n0342_002:0153a23_20"
    },
    {
        "source_sentence": "若族姓子及族姓女，受此經典受持諷誦，聞之信樂，一切皆脫諸魔事業，",
        "translation": "If clansmen and clanswomen receive this scripture, memorize it, recite it, and hear it with faith, they’ll all be freed from the deeds of Māra.",
        "source": "T12n0342_002:0153a23_21"
    },
    {
        "source_sentence": "入佛道慧。」",
        "translation": "He enters the Buddha's wisdom of the path.",
        "source": "T12n0342_002:0153a25_22"
    },
    {
        "source_sentence": "於是彌勒菩薩前白佛言：「今日何緣地大震動，光明遍照空中暢音。」",
        "translation": "Maitreya then went before the Buddha and said to him, What's the reason the earth shakes so greatly today that its light shines everywhere in the sky and spreads its sound?",
        "source": "T12n0342_002:0153a25_23"
    },
    {
        "source_sentence": "佛告彌勒：「何用問為？",
        "translation": "The Buddha told Maitreya, What's the use of asking questions?",
        "source": "T12n0342_002:0153a27_24"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0153a27_25"
    },
    {
        "source_sentence": "志小下士不識大義，墮于憍慢，斯等長夜不得安隱。」",
        "translation": "Those of lowly aspiration who don't know the great meaning and fall into arrogance won't be able to live peacefully for a long time.",
        "source": "T12n0342_002:0153a27_26"
    },
    {
        "source_sentence": "彌勒白佛：「唯聖說之！",
        "translation": "Maitreya said to the Buddha, Only the noble one explains it!",
        "source": "T12n0342_002:0153a29_27"
    },
    {
        "source_sentence": "多所愍哀，多所安隱，必當慈念諸天人民共信樂之。」",
        "translation": "With so much pity and so much peace, you must have compassion for the gods and people who believe in them together.",
        "source": "T12n0342_002:0153a29_28"
    },
    {
        "source_sentence": "佛告彌勒：「斯經典者，四十七億百千那術諸佛，於此地上建立說之，",
        "translation": "The Buddha told Maitreya, These scriptures are established and taught on this earth by the buddhas of the four billion seventy-seven hundred million nayutas.",
        "source": "T12n0342_002:0153b01_29"
    },
    {
        "source_sentence": "皆亦文殊之所發問。",
        "translation": "They're all questions asked by Mañjuśrī.",
        "source": "T12n0342_002:0153b03_30"
    },
    {
        "source_sentence": "善住意天子與共諮啟。",
        "translation": "The well-abiding celestial being wishes to consult with him.",
        "source": "T12n0342_002:0153b03_31"
    },
    {
        "source_sentence": "彌勒來世當成無上正真之道最正覺時，復說此經，其餘賢劫諸興如來亦俱同然。」",
        "translation": "When Maitreya will attain the unsurpassed true path of supreme perfect enlightenment in a future life, he'll again explain this sūtra, and so will the other wise buddhas who emerge in the next eon.",
        "source": "T12n0342_002:0153b04_32"
    },
    {
        "source_sentence": "彌勒復問佛言：「文殊師利、善住意天子，從來久如聞此經典？」",
        "translation": "Maitreya then asked the Buddha, Mañjuśrī, well-abiding celestial son of the mind, how long has it been since you've heard this sūtra?",
        "source": "T12n0342_002:0153b06_33"
    },
    {
        "source_sentence": "佛告彌勒：「文殊師利、善住意天子，聞是法來七百萬阿僧祇劫，從普華超師子步德王光首如來、至真、等正覺所聞，",
        "translation": "The Buddha told Maitreya, Mañjuśrī and the well-abiding celestial son Sunetra had heard this teaching for seven million incalculable eons since the Tathāgata Samantabhadra, the supremely true and perfectly enlighten",
        "source": "T12n0342_002:0153b07_34"
    },
    {
        "source_sentence": "其於空中唱大音聲，淨居諸天聞講此法，各各勸助諮嗟而行，是故地動。」",
        "translation": "When they sing a loud sound in the sky, the gods of the Pure Land hear this teaching and each one encourages and admonishes them to do so, which is why the earth moves.",
        "source": "T12n0342_002:0153b10_0"
    },
    {
        "source_sentence": "彌勒菩薩復白佛言：「若族姓子及族姓女受是經者，持諷誦讀，為他人說，",
        "translation": "The Maitreya bodhisattva then said to the Buddha: If clansmen and clanswomen receive this scripture, preserve it, recite it, and teach it to others.",
        "source": "T12n0342_002:0153b11_1"
    },
    {
        "source_sentence": "得何功報？」",
        "translation": "What's the merit of attaining it?",
        "source": "T12n0342_002:0153b13_2"
    },
    {
        "source_sentence": "佛告彌勒：「於意云何？",
        "translation": "The Buddha told Maitreya, What do you think?",
        "source": "T12n0342_002:0153b13_3"
    },
    {
        "source_sentence": "過去當來今現在佛，戒、定、慧、解度、知見品，廣興布施、持戒、忍辱、精進、一心、智慧，",
        "translation": "In the past, future, and present buddhas of precepts, concentration, wisdom, liberation, knowledge and vision, he extensively promoted generosity, observance of precepts, tolerance, effort, unity of mind, and wisdom.",
        "source": "T12n0342_002:0153b14_0"
    },
    {
        "source_sentence": "使成無上正真道慧，已成當成現在成者，合此德本功祚福勳寧多不？」",
        "translation": "If someone accomplishes the unsurpassed true path of wisdom, which has been accomplished, will be accomplished, and is now accomplished, doesn't this combination of virtue, root merit, and accumulation of merit become abundant?",
        "source": "T12n0342_002:0153b15_1"
    },
    {
        "source_sentence": "彌勒曰：「多矣，世尊！",
        "translation": "Maitreya said, Yes, Bhagavān!",
        "source": "T12n0342_002:0153b17_2"
    },
    {
        "source_sentence": "不可思議，一如來德其福難計，況一切佛。",
        "translation": "It's inconceivable that the virtue of a single tathāgata is so great that its merit is difficult to calculate, much less all buddhas.",
        "source": "T12n0342_002:0153b17_3"
    },
    {
        "source_sentence": "假使德本有形像者，十方佛土不能悉受。」",
        "translation": "Even if virtue originally had form and shape, the buddha lands in the ten directions wouldn't be able to receive it.",
        "source": "T12n0342_002:0153b18_4"
    },
    {
        "source_sentence": "佛告彌勒：「我故囑累慇懃相喻，其族姓子及族姓女，聞是經典受持、諷誦、為他人說，",
        "translation": "The Buddha told Maitreya, I therefore entrusted the parable of sexual misconduct to those clansmen and clanswomen who heard this sūtra, memorized it, recited it, and taught it to others.",
        "source": "T12n0342_002:0153b19_5"
    },
    {
        "source_sentence": "福多於彼，何況奉行。",
        "translation": "Their merit is greater than that, so why wouldn't they practice it?",
        "source": "T12n0342_002:0153b21_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0342_002:0153b22_7"
    },
    {
        "source_sentence": "過去當來今現在佛之所諮講，悉由是生。」",
        "translation": "It's the origin of all the teachings that the Buddha taught in the past, future, and present.",
        "source": "T12n0342_002:0153b22_8"
    },
    {
        "source_sentence": "佛說是經時，江河沙等眾生之類發菩薩心復倍是數，逮不退轉，成得法忍、法眼淨者，",
        "translation": "When the Buddha taught this sutra, these kinds of sentient beings as numerous as grains of sand in rivers and streams arose from the bodhisattva’s mind. Moreover, doubling by this number, they acquired nonregression and",
        "source": "T12n0342_002:0153b23_9"
    },
    {
        "source_sentence": "各復倍倍。",
        "translation": "Each is further doubling and multiplying.",
        "source": "T12n0342_002:0153b25_10"
    },
    {
        "source_sentence": "如是十方悉來會者，一切菩薩忻然大悅，善心生焉，稽首佛足，歌歎此法，",
        "translation": "All the enlightening beings were greatly delighted, and their good intentions arose. They bowed at the Buddha’s feet and sang in praise of this teaching.",
        "source": "T12n0342_002:0153b25_11"
    },
    {
        "source_sentence": "僥再得聞，無以為喻。",
        "translation": "I am happy to have heard it again, but there is no analogy for it.",
        "source": "T12n0342_002:0153b27_12"
    },
    {
        "source_sentence": "忽然不現，各歸本土。",
        "translation": "Suddenly they disappeared and each returned to their native land.",
        "source": "T12n0342_002:0153b27_13"
    },
    {
        "source_sentence": "賢者阿難前白佛言：「此經名何？",
        "translation": "Good man Ānanda went forward and said to the Buddha: What is the name of this sutra?",
        "source": "T12n0342_002:0153b29_0"
    },
    {
        "source_sentence": "云何奉持？」",
        "translation": "How do you consecrate it?",
        "source": "T12n0342_002:0153b29_1"
    },
    {
        "source_sentence": "佛告阿難：「是經名曰『於一切法無起不滅三昧要品』，又名『降毀魔場』，",
        "translation": "The Buddha told Ānanda, This sūtra is called the essential chapter of samādhi that neither arises nor ceases in all dharmas, and it's also called subjugating Māra's site.",
        "source": "T12n0342_002:0153b29_2"
    },
    {
        "source_sentence": "當懷持之。",
        "translation": "You should retain it in your mind.",
        "source": "T12n0342_002:0153c02_3"
    },
    {
        "source_sentence": "又名『普遍十方定意要慧文殊師利之所講說』，又名『如幻所說』，當奉持之！",
        "translation": "It's also called'taught by Mañjuśrī of the essential wisdom of universal concentration in the ten directions,' and it's also called'taught like an illusion,' which should be upheld!",
        "source": "T12n0342_002:0153c02_4"
    },
    {
        "source_sentence": "是經典者，能調化人。",
        "translation": "This sūtra is a scripture that can tame people.",
        "source": "T12n0342_002:0153c04_5"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T12n0342_002:0153c04_6"
    },
    {
        "source_sentence": "當受持諷誦讀，為他人說。」",
        "translation": "You must memorize, chant, recite, and teach it to others.",
        "source": "T12n0342_002:0153c04_7"
    },
    {
        "source_sentence": "佛說如是，比丘、菩薩、文殊師利、善住意天子、彌勒菩薩、賢者、阿難、諸天龍神、阿須倫、世間人，",
        "translation": "The Buddha said thus: Monks, bodhisattvas, Mañjuśrī, the well-abiding celestial being Maitreya, Bodhisattva Maitreya, wise ones, Ānanda, gods, dragons, nāgas",
        "source": "T12n0342_002:0153c05_8"
    },
    {
        "source_sentence": "聞經莫不歡喜。",
        "translation": "Everyone who heard the sūtras rejoiced.",
        "source": "T12n0342_002:0153c07_9"
    },
    {
        "source_sentence": "佛說如幻三昧經卷下",
        "translation": "Foshuo rui zhi sanmei jing, vol. 2",
        "source": "T12n0342_002:0153c09_0"
    }
]