[
    {
        "source_sentence": "大般涅槃經卷第三十二",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 32",
        "source": "T12n0374_032:0554a02_0"
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Northern Liang Tianzhushu Sanzang translated by Dharmakṣema",
        "source": "T12n0374_032:0554a04_0"
    },
    {
        "source_sentence": "師子吼菩薩品第十一之六",
        "translation": "The Eleventh and Sixth Chapter of the Bodhisattva Shizi Roar",
        "source": "T12n0374_032:0554a05_0"
    },
    {
        "source_sentence": "◎師子吼菩薩言：「世尊！",
        "translation": "The lion roaring bodhisattva said, Bhagavān!",
        "source": "T12n0374_032:0554a06_0"
    },
    {
        "source_sentence": "若一切業不定得果，一切眾生悉有佛性，應當修習八聖道者，何因緣故，",
        "translation": "If all actions don't necessarily bring results, and all sentient beings all have buddha-nature, they should cultivate the eight noble paths. Why?",
        "source": "T12n0374_032:0554a06_1"
    },
    {
        "source_sentence": "一切眾生悉不得是大般涅槃？",
        "translation": "All sentient beings won't attain this great nirvāṇa?",
        "source": "T12n0374_032:0554a08_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_032:0554a08_3"
    },
    {
        "source_sentence": "若一切眾生有佛性者，即當定得阿耨多羅三藐三菩提，何須修習八聖道耶？",
        "translation": "If all sentient beings had buddha-nature, they would surely attain supreme perfect enlightenment, so why would they need to cultivate the eight noble paths?",
        "source": "T12n0374_032:0554a09_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_032:0554a10_1"
    },
    {
        "source_sentence": "如此經中說有病人，若得醫藥及瞻病人，隨病飲食，若使不得，皆悉除差。",
        "translation": "Thus, the sūtras say that if there's a sick person who obtains medicine and looks after the sick person, follows the illness with food and drink, and doesn't get it, they'll all be healed.",
        "source": "T12n0374_032:0554a10_2"
    },
    {
        "source_sentence": "一切眾生亦復如是，若遇聲聞及辟支佛、諸佛菩薩、諸善知識，若聞說法，",
        "translation": "And so it is with all sentient beings: if they encounter śrāvakas, pratyekabuddhas, buddhas, buddhas, bodhisattvas, and spiritual teachers who teach the Dharma to them.",
        "source": "T12n0374_032:0554a12_3"
    },
    {
        "source_sentence": "修習聖道。",
        "translation": "He cultivates the noble path.",
        "source": "T12n0374_032:0554a14_4"
    },
    {
        "source_sentence": "若不遇、不聞、不修習道，悉當得成阿耨多羅三藐三菩提。",
        "translation": "If someone doesn't meet, hear, and cultivate the path, they'll all attain unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_032:0554a14_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0554a15_6"
    },
    {
        "source_sentence": "以佛性故。",
        "translation": "It's because of the buddha-nature.",
        "source": "T12n0374_032:0554a16_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_032:0554a16_1"
    },
    {
        "source_sentence": "譬如日月，無有能遮，令不得至頞多山邊、四大河水不至大海、一闡提等不至地獄。",
        "translation": "It's like the sun and moon, for which there's no one who can obstruct them so that they won't reach the edge of Mount Gṛdhrakūṭa, the water of the four great rivers won't reach the ocean, and the icchantika won't reach hell.",
        "source": "T12n0374_032:0554a16_2"
    },
    {
        "source_sentence": "一切眾生亦復如是，無有能遮令不得至阿耨多羅三藐三菩提。",
        "translation": "All sentient beings are likewise, for there's nothing that can prevent them from attaining unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_032:0554a18_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0554a19_4"
    },
    {
        "source_sentence": "以佛性故。",
        "translation": "It's because of the buddha-nature.",
        "source": "T12n0374_032:0554a19_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_032:0554a20_6"
    },
    {
        "source_sentence": "以是義故，一切眾生不須修道，以佛性力故，應得阿耨多羅三藐三菩提，",
        "translation": "Because of this, all sentient beings do not need to cultivate enlightenment; because of the power of buddha-nature, they should attain unexcelled complete perfect enlightenment.",
        "source": "T12n0374_032:0554a20_7"
    },
    {
        "source_sentence": "不以修習聖道力故。",
        "translation": "It's because they don't cultivate the power of the noble path.",
        "source": "T12n0374_032:0554a21_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_032:0554a22_9"
    },
    {
        "source_sentence": "若一闡提、犯四重禁、五逆罪等，不得阿耨多羅三藐三菩提者，應須修習。",
        "translation": "If an icchantika commits one of the four grave offenses or five heinous crimes and doesn't attain unsurpassed, correct, and complete enlightenment, they should cultivate it.",
        "source": "T12n0374_032:0554a22_10"
    },
    {
        "source_sentence": "以因佛性定當得故，非因修習，然後得也。",
        "translation": "It's because the buddha-nature of cause is certain to be attained, not because it's cultivated and then attained.",
        "source": "T12n0374_032:0554a24_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_032:0554a25_12"
    },
    {
        "source_sentence": "譬如磁石，去鐵雖遠，以其力故，鐵則隨著。",
        "translation": "It's like a magnifying stone that's far removed from the iron, but because of its power, the iron follows it.",
        "source": "T12n0374_032:0554a25_13"
    },
    {
        "source_sentence": "眾生佛性亦復如是，是故不須勤修習道。」",
        "translation": "The buddha-nature of sentient beings is likewise, so they don't need to diligently cultivate the path.",
        "source": "T12n0374_032:0554a26_14"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0374_032:0554a27_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0554a27_16"
    },
    {
        "source_sentence": "如恒河邊有七種人，若為洗浴、恐畏寇賊、或為採花，則入河中。",
        "translation": "Suppose there are seven kinds of people at the edge of the Ganges River who enter the river for bathing, fearing invaders and thieves, or collecting flowers.",
        "source": "T12n0374_032:0554a27_17"
    },
    {
        "source_sentence": "第一人者入水則沈。",
        "translation": "The first person enters the water and sinks.",
        "source": "T12n0374_032:0554a29_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0554a29_19"
    },
    {
        "source_sentence": "羸無勢力，不習浮故。",
        "translation": "They are weak and powerless, because they don't cultivate floating.",
        "source": "T12n0374_032:0554a29_20"
    },
    {
        "source_sentence": "第二人者雖沒還出，出已復沒。",
        "translation": "The second person, although he disappears, comes back out and disappears again after emerging.",
        "source": "T12n0374_032:0554b01_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0554b01_22"
    },
    {
        "source_sentence": "身力大故則能還出，不習浮故出已還沒。",
        "translation": "Because the power of the body is great, it can then go back out; because it doesn't practice floating, it comes out and goes back again.",
        "source": "T12n0374_032:0554b02_23"
    },
    {
        "source_sentence": "第三人者沒已即出，出更不沒。",
        "translation": "The third person emerges after disappearing, and doesn't disappear again after emerging.",
        "source": "T12n0374_032:0554b03_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0554b03_1"
    },
    {
        "source_sentence": "身重故沒，力大故出，先習浮故，出已即住。",
        "translation": "Because the body is heavy, it sinks; because its power is great, it comes out: because of having previously accumulated floating. After coming out, it abides.",
        "source": "T12n0374_032:0554b03_2"
    },
    {
        "source_sentence": "第四人者入已便沒，沒已還出，出已即住，遍觀四方。",
        "translation": "The fourth kind of people are those who enter and then disappear after entering, return after disappearing after emerging, abide after emerging, and pervade the four directions.",
        "source": "T12n0374_032:0554b04_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0554b06_0"
    },
    {
        "source_sentence": "重故則沈，力大故還出，習浮則住，不知出處，故觀四方。",
        "translation": "Because it is heavy, it sinks; because its power is great, it comes back out; because of accumulating floating, it remains standing; and because it does not know the place where it goes out, it therefore looks in all directions.",
        "source": "T12n0374_032:0554b06_1"
    },
    {
        "source_sentence": "第五人者入已即沈，沈已便出，出已即住，住已觀方，觀已即去。",
        "translation": "The fifth person is that which sinks after entering, emerges after sinking, remains standing after emerging, looks around after standing, and departs after looking around.",
        "source": "T12n0374_032:0554b07_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0554b08_3"
    },
    {
        "source_sentence": "為怖畏故。",
        "translation": "It's because of fear.",
        "source": "T12n0374_032:0554b09_0"
    },
    {
        "source_sentence": "第六人者入已即去，淺處則住。",
        "translation": "The sixth person enters and leaves immediately after entering, and they abide in the shallow place.",
        "source": "T12n0374_032:0554b09_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0554b09_2"
    },
    {
        "source_sentence": "觀賊近遠故。",
        "translation": "It's because he observes the thief's proximity and remoteness.",
        "source": "T12n0374_032:0554b10_3"
    },
    {
        "source_sentence": "第七人者既至彼岸，登上大山，無復恐怖，離諸怨賊，受大快樂。",
        "translation": "The seventh person reaches the other shore and ascends to a great mountain, no longer fearful, free of enemies and thieves, and experiences great happiness.",
        "source": "T12n0374_032:0554b10_4"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0554b11_5"
    },
    {
        "source_sentence": "生死大河亦復如是，有七種人畏煩惱賊故，發意欲渡生死大河，出家剃髮，",
        "translation": "So it is with the great river of birth and death: there are seven kinds of people who, out of fear of the afflictions and thieves, decide to cross the great river of birth and death and renounce household life.",
        "source": "T12n0374_032:0554b12_6"
    },
    {
        "source_sentence": "身被法服。",
        "translation": "His body is covered with the Dharma robe.",
        "source": "T12n0374_032:0554b13_7"
    },
    {
        "source_sentence": "既出家已，親近惡友，隨順其教，聽受邪法，所謂眾生身者即是五蔭，",
        "translation": "Having renounced the householder’s life, they should associate with evil companions and follow their instruction. They should hear and accept wrong teachings. The so-called ‘body of sentient beings’ refers to the five kinds of shade:",
        "source": "T12n0374_032:0554b14_8"
    },
    {
        "source_sentence": "五蔭者即名五大，眾生若死永斷五大，斷五大故，何須修習善惡諸業，",
        "translation": "The five shades are called the “five elements”. When beings die, they absolutely eliminate the five elements. Because of eliminating the five elements, there is no need to cultivate wholesome or unwholesome actions.",
        "source": "T12n0374_032:0554b15_9"
    },
    {
        "source_sentence": "是故當知無有善惡及善惡報。",
        "translation": "Therefore, you should know that there are no results of good and bad or good and bad actions.",
        "source": "T12n0374_032:0554b17_10"
    },
    {
        "source_sentence": "如是則名一闡提也。",
        "translation": "Thus, it's called icchantika.",
        "source": "T12n0374_032:0554b17_11"
    },
    {
        "source_sentence": "一闡提者名斷善根，斷善根故沒生死河，不能得出。",
        "translation": "An icchantika is called someone who has cut off good roots, and because they cut off good roots, they're submerged in the river of birth-and-death and can't escape.",
        "source": "T12n0374_032:0554b18_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0554b19_13"
    },
    {
        "source_sentence": "惡業重故、無信力故，如恒河邊第一人也。",
        "translation": "Because of the seriousness of his evil deeds and lacking the power of faith, he's like the first person at the edge of the Ganges River.",
        "source": "T12n0374_032:0554b19_14"
    },
    {
        "source_sentence": "善男子，一闡提輩有六因緣，沒三惡道不能得出。",
        "translation": "Good sons, the icchantika group has six reasons why they don't leave the three bad destinies and can't escape.",
        "source": "T12n0374_032:0554b20_15"
    },
    {
        "source_sentence": "何等為六？",
        "translation": "What are these six?",
        "source": "T12n0374_032:0554b21_16"
    },
    {
        "source_sentence": "一者惡心熾盛故、二者不見後世故、三者樂習煩惱故、四者遠離善根故、五者惡業障隔故、六者親近惡知識故。",
        "translation": "1. because bad thoughts are prevalent, 2. because they don't see the afterlife, 3. because they enjoy accumulating afflictions, 4. because they're far removed from good roots, 5. because they're hindered by bad karmic hindrances, and 6. because they're close to bad friends.",
        "source": "T12n0374_032:0554b22_17"
    },
    {
        "source_sentence": "復有五事，沒三惡道。",
        "translation": "Again, there are five things that will cause you to enter the three evil destinies.",
        "source": "T12n0374_032:0554b24_18"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T12n0374_032:0554b25_19"
    },
    {
        "source_sentence": "一者於比丘邊作非法故、二者比丘尼邊作非法故、三者自在用僧鬘物故、四者母邊作非法故、五者於五部僧互生是非故。",
        "translation": "1. because it's unlawful at the side of a monk, 2. because it's unlawful at the side of a bhikṣuṇī, 3. because it freely uses property that belongs to the saṃgha, 4. because it's unlawful at the side of a mother, and 5. because it's wrong to give rise to each other among the five groups",
        "source": "T12n0374_032:0554b25_20"
    },
    {
        "source_sentence": "復有五事，沒三惡道。",
        "translation": "Again, there are five things that will cause you to enter the three evil destinies.",
        "source": "T12n0374_032:0554b28_21"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T12n0374_032:0554b28_22"
    },
    {
        "source_sentence": "一者常說無善惡果故、二者殺發菩提心眾生故、三者憙說法師過失故、四者法說非法非法說法故、五者為求法過而聽受故。",
        "translation": "1. because they always explain that there are no good and bad results, 2. because they kill sentient beings who give rise to the mind of enlightenment, 3. because they criticize the faults of the Dharma teacher, 4. because they teach what's taught according to the Dharma and not what's taught according to the Dharma, and 5. because they hear and accept it for the sake of seeking faults in",
        "source": "T12n0374_032:0554b28_23"
    },
    {
        "source_sentence": "復有三事，沒三惡道。",
        "translation": "Again, there are three things that will cause you to enter the three bad destinies.",
        "source": "T12n0374_032:0554c02_24"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T12n0374_032:0554c03_25"
    },
    {
        "source_sentence": "一謂如來無常永滅、二謂正法無常遷變、三謂僧寶可滅壞故，是故常沒三惡道中。",
        "translation": "One, it means that the Tathāgata is impermanent and permanently extinguished; two, it means that the right teaching is impermanent and transient; and three, it means that the treasures of the saṃgha can be annihilated and destroyed, so they always fall into the three bad destinies.",
        "source": "T12n0374_032:0554c03_26"
    },
    {
        "source_sentence": "「第二人者，發意欲渡生死大河，斷善根故，沒不能出。",
        "translation": "“The second person is someone who arouses the intention to cross the great river of birth-and-death, cuts off good roots, and doesn’t get out.",
        "source": "T12n0374_032:0554c05_27"
    },
    {
        "source_sentence": "所言出者，親近善友則得信心。",
        "translation": "When someone says they'll leave, they'll become intimate with good friends and attain faith.",
        "source": "T12n0374_032:0554c06_28"
    },
    {
        "source_sentence": "是信心者，信施、施果，信善、善果，信惡、惡果，信生、死、苦、無常、敗壞，",
        "translation": "“Faith”: Faith in giving, in the fruits of giving, faith in what is good and in the fruits of goodness, faith in bad and bad fruits, faith in birth, death, suffering, impermanence and disintegration.",
        "source": "T12n0374_032:0554c07_29"
    },
    {
        "source_sentence": "是名為信。",
        "translation": "This is called faith.",
        "source": "T12n0374_032:0554c08_30"
    },
    {
        "source_sentence": "以得信心修習淨戒，受持讀誦書寫解說，常樂惠施，善修智慧。",
        "translation": "They attain faith and cultivate pure precepts, memorize, recite, write, interpret, and teach, always delight in generosity, and skillfully cultivate wisdom.",
        "source": "T12n0374_032:0554c08_31"
    },
    {
        "source_sentence": "以鈍根故，復遇惡友，不能修習身、戒、心、慧，聽受邪法；",
        "translation": "Because of their dull faculties, they may encounter bad companions again. They are unable to cultivate body, precepts, mind, or wisdom and hear and accept evil teachings.",
        "source": "T12n0374_032:0554c10_32"
    },
    {
        "source_sentence": "或值惡時，處惡國土，斷諸善根。",
        "translation": "Or they may encounter bad times and live in a bad land, cutting off good roots.",
        "source": "T12n0374_032:0554c11_33"
    },
    {
        "source_sentence": "斷善根故，常沒生死，如恒河邊第二人也。",
        "translation": "Because he has cut off his good roots, he always disappears birth and death like the second person at the edge of the Ganges River.",
        "source": "T12n0374_032:0554c12_34"
    },
    {
        "source_sentence": "「第三人者，發意欲渡生死大河，斷善根故於中沈沒，親近善友得名為出，",
        "translation": "“The third person is someone who arouses the intention to cross the great river of birth and death, cuts off good roots, sinks into it, becomes intimate with good friends, and gets the name emerging.",
        "source": "T12n0374_032:0554c13_35"
    },
    {
        "source_sentence": "信於如來是一切智、常恒無變、為眾生故說無上道，一切眾生悉有佛性，",
        "translation": "They believe that the Buddha is omniscience, eternal, unchanging, and omniscient; they teach the supreme path for the sake of sentient beings. All sentient beings have buddha-nature.",
        "source": "T12n0374_032:0554c14_36"
    },
    {
        "source_sentence": "如來非滅，法、僧亦爾，無有滅壞。",
        "translation": "The Tathāgata doesn't cease, and so are the teachings and saṃgha, which lack cessation and disintegration.",
        "source": "T12n0374_032:0554c16_37"
    },
    {
        "source_sentence": "一闡提等不斷其法，終不能得阿耨多羅三藐三菩提，要當遠離然後乃得。",
        "translation": "If icchantika and others don't stop this teaching, they'll never attain unsurpassed, correct, and complete enlightenment, but they'll attain it only after they're far removed.",
        "source": "T12n0374_032:0554c17_38"
    },
    {
        "source_sentence": "以信心故修習淨戒，修習戒已，受持讀誦書寫解說十二部經，為諸眾生廣宣流布，",
        "translation": "Because of faith they cultivate pure precepts. Having cultivated these precepts, they receive, retain, recite, write, and explain twelve kinds of scriptures for the sake of sentient beings and disseminate them widely.",
        "source": "T12n0374_032:0554c18_39"
    },
    {
        "source_sentence": "樂於惠施，修習智慧，以利根故，堅住信慧，心無退轉，如恒河邊第三人也。",
        "translation": "Because of their sharp faculties they firmly abide in faith and wisdom. Their minds never regress, just like the third kind of people at the edge of the Ganges River.",
        "source": "T12n0374_032:0554c20_40"
    },
    {
        "source_sentence": "「第四人者，發意欲渡生死大河，斷善根故於中沈沒，親近善友故得信心，",
        "translation": "“The fourth person is someone who arouses the intention to cross the great river of birth and death, sinks into it because they have cut off good roots, and becomes intimate with good friends so they can attain faith.",
        "source": "T12n0374_032:0554c22_41"
    },
    {
        "source_sentence": "是名為出，得信心故，受持讀誦書寫解說十二部經，為眾生故廣宣流布，",
        "translation": "Because they have gained faith, they memorize, recite, write, and explain the twelvefold scriptures, and disseminate them widely for the sake of sentient beings.",
        "source": "T12n0374_032:0554c24_42"
    },
    {
        "source_sentence": "樂於惠施，修習智慧，以利根故堅住信慧，心無退轉，遍觀四方，觀四方者四沙門果，",
        "translation": "They delight in generosity and cultivate wisdom. Because of their sharp faculties, they firmly abide in faith and wisdom. Their minds never regress. Observing all four directions is the fruit of the four forms of Sramana-ship.",
        "source": "T12n0374_032:0554c25_43"
    },
    {
        "source_sentence": "如恒河邊第四人也。",
        "translation": "He's like the fourth person at the edge of the Ganges River.",
        "source": "T12n0374_032:0554c27_44"
    },
    {
        "source_sentence": "「第五人者，發意欲渡生死大河，斷善根故於中沈沒，親近善友故得信心，",
        "translation": "“The fifth person is someone who arouses the intention to cross the great river of birth and death, sinks into it because they have cut off good roots, become intimate with good friends, and attain faith.",
        "source": "T12n0374_032:0554c28_45"
    },
    {
        "source_sentence": "是名為出，以信心故，受持讀誦書寫解說十二部經，為眾生故廣宣流布，",
        "translation": "Because of their faith, they memorize, recite, write, and explain the twelve kinds of scriptures. For the sake of sentient beings they spread them widely.",
        "source": "T12n0374_032:0554c29_46"
    },
    {
        "source_sentence": "樂於慧施修習智慧，以利根故，堅住信慧，心無退轉，無退轉已，即便前進，",
        "translation": "Because of their sharp faculties, they firmly abide in faith and wisdom. Their minds never turn back. Having not turned back, they proceed onward.",
        "source": "T12n0374_032:0555a02_47"
    },
    {
        "source_sentence": "前進者謂辟支佛，雖能自渡，不及眾生，是名為去，如恒河邊第五人也。",
        "translation": "The one who advances means a pratyekabuddha, even though he can cross over on his own and doesn't match sentient beings, which is called going, like the fifth person at the edge of the Ganges River.",
        "source": "T12n0374_032:0555a04_48"
    },
    {
        "source_sentence": "「第六人者，發意欲渡生死大河，斷善根故於中沈沒，親近善友獲得信心，",
        "translation": "“The sixth person is someone who arouses the intention to cross the great river of birth and death, sinks there because they have cut off good roots, become intimate with good friends, and attain faith.",
        "source": "T12n0374_032:0555a05_49"
    },
    {
        "source_sentence": "得信心故名之為出，以信心故，受持讀誦書寫解說十二部經，為眾生故廣宣流布，",
        "translation": "Because of attaining faith they are called ‘emptiness.’ Because of their faith, they preserve, recite, copy, and explain twelve kinds of scriptures, and disseminate them widely for the sake of sentient beings.",
        "source": "T12n0374_032:0555a07_50"
    },
    {
        "source_sentence": "樂於惠施，修習智慧，以利根故，堅住信慧，心無退轉，無退轉已即復前進遂到淺處，",
        "translation": "They delight in generosity and cultivate wisdom. Because of their sharp faculties they firmly abide in faith and wisdom. Their minds have no turning back. Having done so without turning back, they proceed further and further until they reach a shallow place.",
        "source": "T12n0374_032:0555a09_51"
    },
    {
        "source_sentence": "到淺處已即住不去，住不去者所謂菩薩，為欲度脫諸眾生故，住觀煩惱，",
        "translation": "“After reaching a shallow place, one neither abides nor doesn’t abide. Abiding and not abiding is called ‘bodhisattva’: Because of wanting to liberate beings, he abides in the observation of defilement.",
        "source": "T12n0374_032:0555a11_52"
    },
    {
        "source_sentence": "如恒河邊第六人也。",
        "translation": "It's like the sixth person at the edge of the Ganges River.",
        "source": "T12n0374_032:0555a13_0"
    },
    {
        "source_sentence": "「第七人者，發意欲渡生死大河，斷善根故於中沈沒，親近善友獲得信心，",
        "translation": "“The seventh person is someone who arouses the intention to cross the great river of birth and death, cuts off good roots, sinks into them, becomes intimate with good friends, and attains faith.",
        "source": "T12n0374_032:0555a13_1"
    },
    {
        "source_sentence": "得信心已是名為出，以信心故，受持讀誦書寫解說十二部經，為眾生故廣宣流布，",
        "translation": "Having attained faith, they are said to have emerged. Because of their faith, they receive, preserve, recite, write, and explain twelve kinds of scriptures, and disseminate them widely for the sake of living beings.",
        "source": "T12n0374_032:0555a15_2"
    },
    {
        "source_sentence": "樂於惠施，修習智慧，以利根故，堅住信慧，心無退轉，無退轉已即便前進，",
        "translation": "They delight in generosity and cultivate wisdom. Because of their sharp faculties, they firmly abide in faith and wisdom. Their minds have no turning back. Having done so without turning back, they proceed onward.",
        "source": "T12n0374_032:0555a17_0"
    },
    {
        "source_sentence": "既前進已得到彼岸，登大高山，離諸恐怖，多受安樂。",
        "translation": "Having advanced, they reached the other shore and climbed up a great high mountain. Freed from all fears, they often experienced peace and happiness.",
        "source": "T12n0374_032:0555a18_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555a19_2"
    },
    {
        "source_sentence": "彼岸山者喻於如來，受安樂者喻佛常住，大高山者喻大涅槃。",
        "translation": "The mountain on the other side of the shore is a metaphor for the Tathāgata, the one who experiences well-being is a metaphor for the Buddha's constant presence, and the great high mountain is a metaphor for the great nirvāṇa.",
        "source": "T12n0374_032:0555a20_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555a21_4"
    },
    {
        "source_sentence": "是恒河邊如是諸人，悉具手足而不能渡。",
        "translation": "Such people as these at the edge of the Ganges River can't cross it with their hands and feet.",
        "source": "T12n0374_032:0555a21_5"
    },
    {
        "source_sentence": "一切眾生亦復如是，實有佛寶、法寶、僧寶，如來常說諸法要義，有八聖道大般涅槃，",
        "translation": "All sentient beings are also like this: there really is the treasure of buddhahood, the treasure of the doctrine, and the treasure of the sangha. The Tathagata always explains the essential meaning of the dharma-s; there is the great nirval)a of the eightfold noble path.",
        "source": "T12n0374_032:0555a22_6"
    },
    {
        "source_sentence": "而諸眾生悉不能得。",
        "translation": "All sentient beings can't attain it.",
        "source": "T12n0374_032:0555a24_7"
    },
    {
        "source_sentence": "此非我咎，亦非聖道、眾生等過。",
        "translation": "This is not the fault of self, nor is it the fault of the noble path or sentient beings.",
        "source": "T12n0374_032:0555a24_8"
    },
    {
        "source_sentence": "當知悉是煩惱過惡，以是義故，一切眾生不得涅槃。",
        "translation": "You should know that they are all the faults of affliction, and because of this meaning, all sentient beings won't attain nirvāṇa.",
        "source": "T12n0374_032:0555a25_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555a26_10"
    },
    {
        "source_sentence": "譬如良醫知病說藥，病者不服，非醫咎也。",
        "translation": "It's like a good doctor who knows illness and prescribes medicine, but the sick person doesn't take it; it's not the fault of the doctor.",
        "source": "T12n0374_032:0555a27_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555a27_1"
    },
    {
        "source_sentence": "如有施主，以其所有施一切人，有不受者非施主咎。",
        "translation": "Suppose there's a donor who gives to all people with whatever they have, and if someone doesn't accept it, it's not the fault of the donor.",
        "source": "T12n0374_032:0555a28_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555a29_3"
    },
    {
        "source_sentence": "譬如日出，幽冥皆明，盲瞽之人不見道路，非日過也。",
        "translation": "It's like when the sun comes out and all the darkness and darkness are clear, and a blind man doesn't see the road, so it's not a passing of the sun.",
        "source": "T12n0374_032:0555a29_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b01_5"
    },
    {
        "source_sentence": "如恒河水能除渴乏，渴者不飲，非水咎也。",
        "translation": "It's like the water of the Ganges River that removes thirst, and those who are thirsty won't drink it; it's not the fault of the water.",
        "source": "T12n0374_032:0555b01_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b02_7"
    },
    {
        "source_sentence": "譬如大地，普生果實，平等無二，農夫不種，非地過也。",
        "translation": "It's like the great land that produces all kinds of fruits equally and without distinction, and it's not a mistake for farmers to plant them on the ground.",
        "source": "T12n0374_032:0555b02_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b04_9"
    },
    {
        "source_sentence": "如來普為一切眾生廣開分別十二部經，眾生不受，非如來咎。",
        "translation": "The Tathāgata opens twelve extensively discriminating scriptures for all sentient beings, and sentient beings don't accept them; it's not the fault of the Tathāgata.",
        "source": "T12n0374_032:0555b04_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b05_11"
    },
    {
        "source_sentence": "若修道者，即得阿耨多羅三藐三菩提。",
        "translation": "If someone cultivates it, they'll attain unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_032:0555b05_12"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b06_13"
    },
    {
        "source_sentence": "汝言眾生悉有佛性，應得阿耨多羅三藐三菩提，如磁石者。",
        "translation": "You say that all sentient beings have buddha-nature and should attain supreme perfect enlightenment like a magical stone.",
        "source": "T12n0374_032:0555b06_14"
    },
    {
        "source_sentence": "善哉，善哉！",
        "translation": "Excellent, excellent!",
        "source": "T12n0374_032:0555b08_15"
    },
    {
        "source_sentence": "以有佛性因緣力故，得阿耨多羅三藐三菩提；",
        "translation": "Because of the causal power of buddha-nature they attain unexcelled complete perfect enlightenment.",
        "source": "T12n0374_032:0555b08_16"
    },
    {
        "source_sentence": "若言不須修聖道者，是義不然。",
        "translation": "If someone says they don't need to cultivate the noble path, this doesn't make sense.",
        "source": "T12n0374_032:0555b09_17"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b10_18"
    },
    {
        "source_sentence": "譬如有人行於曠野，渴乏遇井，其井幽深，雖不見水，當知必有。",
        "translation": "It's like a person who travels in the wilderness and becomes thirsty when he meets a well, which is so deep that even though he doesn't see water, it should be known to exist.",
        "source": "T12n0374_032:0555b10_19"
    },
    {
        "source_sentence": "是人方便，求覓罐綆，汲取則見。",
        "translation": "That person's skillful means are to search for a pot of food and drink, and when they draw it, they'll see it.",
        "source": "T12n0374_032:0555b11_20"
    },
    {
        "source_sentence": "佛性亦爾，一切眾生雖復有之，要須修習無漏聖道，然後得見。",
        "translation": "The buddha-nature is likewise, and even though all sentient beings have it, they must cultivate the uncontaminated noble path before they can see it.",
        "source": "T12n0374_032:0555b12_21"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b14_0"
    },
    {
        "source_sentence": "如有胡麻則得見油，離諸方便則不得見，甘蔗亦爾。",
        "translation": "Just as sesame obtains oil when it is viewed, whereas sugarcane cannot be seen apart from skillful means.",
        "source": "T12n0374_032:0555b14_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b15_2"
    },
    {
        "source_sentence": "如三十三天、北欝單越，雖是有法，若無善業、神通道力，則不能見。",
        "translation": "For example, even though the thirty-three gods and northern Uttarakuru have good qualities, if they don't have good actions and the power of the spiritual path, they won't see them.",
        "source": "T12n0374_032:0555b15_3"
    },
    {
        "source_sentence": "地中草根及地下水，以地覆故，眾生不見。",
        "translation": "The roots of grass and water in the ground are covered by the earth, so sentient beings don't see them.",
        "source": "T12n0374_032:0555b17_4"
    },
    {
        "source_sentence": "佛性亦爾，不修聖道，故不得見。",
        "translation": "The buddha-nature is also like this: because it does not cultivate the noble path and therefore cannot be seen.",
        "source": "T12n0374_032:0555b18_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b18_1"
    },
    {
        "source_sentence": "如汝所說，世有病人，若遇瞻病，良醫好藥，隨病飲食，及以不遇，悉得差者。",
        "translation": "As you say, there are sick people in the world who will be cured if they meet someone who looks after their illnesses, good doctors and good medicines, food and drink that accord with their illnesses, and those who won't encounter them.",
        "source": "T12n0374_032:0555b18_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b20_3"
    },
    {
        "source_sentence": "我為六住諸菩薩等說如是義。",
        "translation": "I explain this meaning for the bodhisattvas in the six abodes and so forth.",
        "source": "T12n0374_032:0555b20_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b21_5"
    },
    {
        "source_sentence": "譬如虛空，於諸眾生，非內非外，非內外故亦無罣礙，眾生佛性亦復如是。",
        "translation": "Just as space is neither internal nor external to sentient beings, and because it's neither internal nor external, there's no obstruction, so is the buddha-nature of sentient beings likewise.",
        "source": "T12n0374_032:0555b21_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b23_7"
    },
    {
        "source_sentence": "譬如有人，財在異方，雖不現前隨意受用，有人問之，則言我許。",
        "translation": "It's like a person whose possessions are in another place, and even though they don't show up to receive them as they wish, someone asks them, saying, 'I approve.'",
        "source": "T12n0374_032:0555b23_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0555b24_9"
    },
    {
        "source_sentence": "以定有故。",
        "translation": "It's because they are definitely present.",
        "source": "T12n0374_032:0555b25_10"
    },
    {
        "source_sentence": "眾生佛性亦復如是，非此非彼，以定得故，言一切有。",
        "translation": "The buddha-nature of sentient beings is likewise, neither this nor that: because they are definitely acquired.",
        "source": "T12n0374_032:0555b25_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555b26_12"
    },
    {
        "source_sentence": "譬如眾生，造作諸業，若善、若惡、非內、非外，如是業性，非有、非無，",
        "translation": "“Good son, it is like the case of sentient beings who create actions that are neither good nor bad, neither internal nor external—the nature of action in this way is neither existent nor nonexistent.",
        "source": "T12n0374_032:0555b26_13"
    },
    {
        "source_sentence": "亦復非是本無今有、非無因出、非此作此受、此作彼受、彼作彼受、無作無受，",
        "translation": "Nor is it the case that what was nonexistent in the past exists now, or that there is a non-causal coming forth, or that neither this sensation nor that sensation creates this sensation, that this sensation creates that sensation, that this sensation creates that sensation, that this sensation creates that sensation, or that which is unmanifest and without sensation.",
        "source": "T12n0374_032:0555b28_14"
    },
    {
        "source_sentence": "時節和合而得果報。",
        "translation": "When the seasons are combined, they attain their fruition.",
        "source": "T12n0374_032:0555b29_15"
    },
    {
        "source_sentence": "眾生佛性亦復如是，亦復非是本無今有、非內非外、非有非無、非此非彼，",
        "translation": "The buddha-nature of sentient beings is also like this: neither is it originally nonexistent, nor does it exist now; neither is it internal nor external, neither existent nor nonexistent, neither here nor there.",
        "source": "T12n0374_032:0555c01_16"
    },
    {
        "source_sentence": "非餘處來、非無因緣、亦非一切眾生不見，有諸菩薩時節因緣和合得見。",
        "translation": "It's not something that comes from other places, doesn't lack causes and conditions, and isn't seen by all sentient beings; there are bodhisattvas who attain views when the seasons come together with causes and conditions.",
        "source": "T12n0374_032:0555c02_17"
    },
    {
        "source_sentence": "時節者所謂十住菩薩摩訶薩修八聖道，於諸眾生得平等心，爾時得見，",
        "translation": "The seasons are called the ten abodes of the bodhisattva-mahāsattva who cultivates the eight noble paths and attains equanimity toward sentient beings.",
        "source": "T12n0374_032:0555c04_18"
    },
    {
        "source_sentence": "不名為作。",
        "translation": "It's not called doing.",
        "source": "T12n0374_032:0555c06_19"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c06_20"
    },
    {
        "source_sentence": "汝言如磁石者，是義不然。",
        "translation": "You say it's like a magnifying stone, but that doesn't make sense.",
        "source": "T12n0374_032:0555c06_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0555c07_22"
    },
    {
        "source_sentence": "石不吸鐵。",
        "translation": "A stone doesn't absorb iron.",
        "source": "T12n0374_032:0555c07_23"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_032:0555c07_24"
    },
    {
        "source_sentence": "無心業故。",
        "translation": "It's because there's no mental action.",
        "source": "T12n0374_032:0555c07_25"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c08_0"
    },
    {
        "source_sentence": "異法有故異法出生，異法無故異法滅壞，無有作者無有壞者。",
        "translation": "Because dissimilar dharmas exist, dissimilar dharmas arise; because dissimilar dharmas don't exist, dissimilar dharmas cease and disintegrate; there's no author and no breaker.",
        "source": "T12n0374_032:0555c08_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c09_2"
    },
    {
        "source_sentence": "猶如猛火不能焚薪，火出薪壞，名為焚薪。",
        "translation": "It's like a fierce fire that can't burn wood, and when the fire exits and the wood breaks down, it's called burning wood.",
        "source": "T12n0374_032:0555c09_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c10_4"
    },
    {
        "source_sentence": "譬如葵藿隨日而轉，而是葵藿亦無敬心、無識、無業，異法性故而自迴轉。",
        "translation": "It's like a sunflower that grows in response to the sun, but the sunflower also has no respect, no consciousness, and no karma, and it turns around on its own because it's different from the Dharma nature.",
        "source": "T12n0374_032:0555c10_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c12_6"
    },
    {
        "source_sentence": "如芭蕉樹，因雷增長，是樹無耳、無心、意、識，異法有故異法增長，",
        "translation": "Like a plantain tree that grows due to thunder, this tree has neither ears nor mind, thought, thought, or consciousness. Because dissimilar things exist, dissimilar things grow.",
        "source": "T12n0374_032:0555c12_7"
    },
    {
        "source_sentence": "異法無故異法滅壞。",
        "translation": "Because the dissimilar dharmas are absent, the dissimilar dharmas cease and disintegrate.",
        "source": "T12n0374_032:0555c14_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c14_9"
    },
    {
        "source_sentence": "如阿叔迦樹，女人摩觸花為之出，是樹無心亦無覺觸，異法有故異法出生，",
        "translation": "Like the asoka tree, when a woman touches a flower and causes it to grow, this tree has no mind and no feeling or touch. Because different things exist, different things are produced.",
        "source": "T12n0374_032:0555c14_10"
    },
    {
        "source_sentence": "異法無故異法滅壞。",
        "translation": "Because the dissimilar dharmas are absent, the dissimilar dharmas cease and disintegrate.",
        "source": "T12n0374_032:0555c16_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c16_12"
    },
    {
        "source_sentence": "如橘得尸，果則滋多，而是橘樹無心無觸，異法有故異法滋多，異法無故異法滅壞。",
        "translation": "It's like an orange that obtains a corpse, and its fruit grows abundantly; instead, the orange tree has no mind and no touch, different things exist so different things are abundant, and different things cease and perish because different things don't exist.",
        "source": "T12n0374_032:0555c17_13"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c19_0"
    },
    {
        "source_sentence": "如安石榴塼骨糞故，果實繁茂，安石榴樹亦無心觸，異法有故異法出生，",
        "translation": "It's like planting a pomegranate tree because its fruit grows abundant, and neither does the pomegranate tree have mental contact. Because different things exist, different things are produced.",
        "source": "T12n0374_032:0555c19_1"
    },
    {
        "source_sentence": "異法無故異法滅壞。",
        "translation": "Because the dissimilar dharmas are absent, the dissimilar dharmas cease and disintegrate.",
        "source": "T12n0374_032:0555c20_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c21_3"
    },
    {
        "source_sentence": "磁石吸鐵亦復如是，異法有故異法出生，異法無故異法滅壞。",
        "translation": "So it is with a magnifying stone that sucks iron. If there are dissimilar things, then dissimilar things will arise; if there are no dissimilar things, then dissimilar things will cease and perish.",
        "source": "T12n0374_032:0555c21_4"
    },
    {
        "source_sentence": "眾生佛性亦復如是，不能吸得阿耨多羅三藐三菩提。",
        "translation": "The buddha-nature of sentient beings is likewise, and they can't attain unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_032:0555c22_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c24_6"
    },
    {
        "source_sentence": "無明不能吸取諸行，行亦不能吸取識也，亦得名為無明緣行、行緣於識，",
        "translation": "nescience can't draw in formations, and formations can't draw in consciousness. They can also be called formations conditioned by nescience and formations conditioning consciousness.",
        "source": "T12n0374_032:0555c24_7"
    },
    {
        "source_sentence": "有佛無佛，法界常住。",
        "translation": "With buddhas and no buddhas, the Dharma realm always abides.",
        "source": "T12n0374_032:0555c25_8"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c27_0"
    },
    {
        "source_sentence": "若言佛性住眾生中者。",
        "translation": "If it's said that the buddha-nature abides among sentient beings, then...",
        "source": "T12n0374_032:0555c27_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c27_2"
    },
    {
        "source_sentence": "常法無住，若有住處即是無常。",
        "translation": "The eternal dharmas lack abiding, and if there are abiding places, they are impermanent.",
        "source": "T12n0374_032:0555c27_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0555c28_4"
    },
    {
        "source_sentence": "如十二因緣無定住處，若有住處，十二因緣不得名常。",
        "translation": "If there are twelve causes and conditions that don't have a fixed abode, then if there is an abode, the twelve causes and conditions can't be called permanent.",
        "source": "T12n0374_032:0555c28_5"
    },
    {
        "source_sentence": "如來法身亦無住處，法界、法入、法陰、虛空，悉無住處。",
        "translation": "The Tathāgata's Dharma body also has no abiding place, and the Dharma realm, Dharma entry, Dharma aggregate, and space all have no abiding place.",
        "source": "T12n0374_032:0556a01_0"
    },
    {
        "source_sentence": "佛性亦爾，都無住處。",
        "translation": "So it is with the buddha-nature, which has no dwelling place at all.",
        "source": "T12n0374_032:0556a02_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556a02_2"
    },
    {
        "source_sentence": "譬如四大，力雖均等，有堅、有熱、有濕、有動，有重、有輕、有赤、有白、有黃、有黑，",
        "translation": "Good man, this is analogous to the fact that even though the force of the four elements is evenly balanced, they may be hard, hot, moist, or moving; they may be heavy, light, red, white, yellow, or black.",
        "source": "T12n0374_032:0556a02_3"
    },
    {
        "source_sentence": "而是四大亦無有業，異法界故各不相似。",
        "translation": "Rather, the four elements are also devoid of action. Because they are different from the realm of reality, they are not one and the same.",
        "source": "T12n0374_032:0556a04_4"
    },
    {
        "source_sentence": "佛性亦爾，異法界故，時至則現。",
        "translation": "The buddha-nature is also like this, because it's different from the Dharma realm, and when it arrives, it appears.",
        "source": "T12n0374_032:0556a05_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556a06_6"
    },
    {
        "source_sentence": "一切眾生不退佛性故，名之為有，阿毘跋致故、以當有故、決定得故、定當見故，",
        "translation": "Because all sentient beings do not regress from buddha-nature, they are said to exist: because of the abhidharma, because of future existence, because of certain attainment and because of certain vision.",
        "source": "T12n0374_032:0556a06_7"
    },
    {
        "source_sentence": "是故名為一切眾生悉有佛性。",
        "translation": "Therefore, it's called that all sentient beings have buddha-nature.",
        "source": "T12n0374_032:0556a08_8"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556a08_9"
    },
    {
        "source_sentence": "譬如有王告一大臣，汝牽一象以示盲者。",
        "translation": "It's like when a king tells a minister, Take an elephant and show it to the blind man.",
        "source": "T12n0374_032:0556a09_0"
    },
    {
        "source_sentence": "爾時大臣受王勅已，多集眾盲，以象示之。",
        "translation": "After the minister had received the king's command, many blind people gathered together and showed him an elephant.",
        "source": "T12n0374_032:0556a09_1"
    },
    {
        "source_sentence": "時彼眾盲各以手觸，大臣即還而白王言：『臣已示竟。』",
        "translation": "When each of those blind men touched it with their hands, the ministers returned and said to the king, 'I've shown it to you.'",
        "source": "T12n0374_032:0556a10_2"
    },
    {
        "source_sentence": "爾時大王即喚眾盲各各問言：『汝見象耶？』",
        "translation": "It was then that the great king summoned the blind men and asked each of them, 'Do you see the elephant?'",
        "source": "T12n0374_032:0556a12_3"
    },
    {
        "source_sentence": "眾盲各言：『我已得見。』",
        "translation": "The blind people each said, 'I've seen it.'",
        "source": "T12n0374_032:0556a13_0"
    },
    {
        "source_sentence": "王言：『象為何類？』",
        "translation": "The king said, 'What kind of elephant is it?'",
        "source": "T12n0374_032:0556a13_1"
    },
    {
        "source_sentence": "其觸牙者，即言象形如蘆菔根；",
        "translation": "To touch a tooth is to say that it is shaped like an elephant, resembling the roots of a reed.",
        "source": "T12n0374_032:0556a13_2"
    },
    {
        "source_sentence": "其觸耳者，言象如箕；",
        "translation": "When they touch their ears, words and elephants are like windows.",
        "source": "T12n0374_032:0556a14_3"
    },
    {
        "source_sentence": "其觸頭者，言象如石；",
        "translation": "When touching the head, he speaks of an elephant as a stone.",
        "source": "T12n0374_032:0556a15_0"
    },
    {
        "source_sentence": "其觸鼻者，言象如杵；",
        "translation": "He who touches his nose speaks of an elephant like a pounder.",
        "source": "T12n0374_032:0556a15_1"
    },
    {
        "source_sentence": "其觸脚者，言象如木臼；",
        "translation": "When touching his feet, he speaks of elephant like a wooden mortar.",
        "source": "T12n0374_032:0556a15_2"
    },
    {
        "source_sentence": "其觸脊者，言象如床；",
        "translation": "The one touching the back is said to be an elephant like a chair.",
        "source": "T12n0374_032:0556a16_3"
    },
    {
        "source_sentence": "其觸腹者，言象如甕；",
        "translation": "When he touches his belly, he speaks of elephant like a jar.",
        "source": "T12n0374_032:0556a16_4"
    },
    {
        "source_sentence": "其觸尾者，言象如繩。",
        "translation": "When he touches his tail, he speaks of an elephant like a rope.",
        "source": "T12n0374_032:0556a17_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556a17_6"
    },
    {
        "source_sentence": "如彼眾盲，不說象體，亦非不說。",
        "translation": "Like those blind people who don't explain the elephant's body, it's not because they don't explain it.",
        "source": "T12n0374_032:0556a18_7"
    },
    {
        "source_sentence": "若是眾相，悉非象者，離是之外，更無別象。",
        "translation": "If these are all characteristics, they aren't elephants, and there's no separate elephant apart from them.",
        "source": "T12n0374_032:0556a18_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556a19_9"
    },
    {
        "source_sentence": "王喻如來正遍知也，臣喻方等大涅槃經，象喻佛性，盲喻一切無明眾生。",
        "translation": "The king is a metaphor for the Tathāgata's correct omniscience, the minister is a metaphor for the Mahāparinirvāṇa-sūtra, the elephant is a metaphor for the buddha-nature, and blindness is a metaphor for all ignorant sentient beings.",
        "source": "T12n0374_032:0556a19_10"
    },
    {
        "source_sentence": "「是諸眾生聞佛說已，或作是言：『色是佛性。",
        "translation": "“After hearing what the Buddha teaches, some sentient beings may say, ‘Form is buddha-nature.",
        "source": "T12n0374_032:0556a21_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0556a22_12"
    },
    {
        "source_sentence": "是色雖滅，次第相續，是故獲得無上如來三十二相。",
        "translation": "Even though these forms cease, they continue one after another. That is why the thirty-two marks of the supreme tathagatas are acquired.",
        "source": "T12n0374_032:0556a22_13"
    },
    {
        "source_sentence": "如來色常，如來色者常不斷故，是故說色名為佛性。",
        "translation": "The Tathāgata's form is permanent, and the Tathāgata's form is permanent because it doesn't stop. That's why form is called buddha-nature.",
        "source": "T12n0374_032:0556a23_14"
    },
    {
        "source_sentence": "譬如真金，質雖遷變，色常不異，或時作釧，作鎞、作盤，然其黃色初無改易。",
        "translation": "It's like true gold, whose color always remains the same even though its quality changes, or sometimes it's made into a necklace, a bowl, or a tray, but its color doesn't change at first.",
        "source": "T12n0374_032:0556a25_0"
    },
    {
        "source_sentence": "眾生佛性亦復如是，質雖無常，而色是常，以是故說，色為佛性。』",
        "translation": "The buddha-nature of sentient beings is likewise, and although their quality is impermanent, form is permanent; therefore, it's said that form is the buddha-nature.'",
        "source": "T12n0374_032:0556a26_1"
    },
    {
        "source_sentence": "或有說言：『受是佛性。",
        "translation": "Some people say that sensation is the buddha-nature.",
        "source": "T12n0374_032:0556a28_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0556a28_3"
    },
    {
        "source_sentence": "受因緣故，獲得如來真實之樂，如來受者謂畢竟受、第一義受。",
        "translation": "Because of the causes and conditions for feeling, they attain the Tathāgata's true happiness, and the Tathāgata's feeling refers to final feeling and ultimate feeling.",
        "source": "T12n0374_032:0556a28_4"
    },
    {
        "source_sentence": "眾生受性雖復無常，然其次第相續不斷，是故獲得如來常受。",
        "translation": "Even though the nature of sentient beings' sensation is impermanent, its sequence doesn't continue without interruption; therefore, they attain the eternal sensation of the Tathāgata.",
        "source": "T12n0374_032:0556b01_5"
    },
    {
        "source_sentence": "譬如有人姓憍尸迦，人雖無常，而姓是常，經千萬世無有改易。",
        "translation": "It's like when a person's family name is Kauśika, even though they are impermanent, their family name is permanent, and there's no change for thousands of years.",
        "source": "T12n0374_032:0556b02_6"
    },
    {
        "source_sentence": "眾生佛性亦復如是，以是故說受為佛性。』",
        "translation": "The buddha-nature of sentient beings is likewise, which is why it's called sensation as the buddha-nature.'",
        "source": "T12n0374_032:0556b04_0"
    },
    {
        "source_sentence": "又有說言：『想是佛性。",
        "translation": "It's also said, 'Conception is the buddha-nature.",
        "source": "T12n0374_032:0556b04_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0556b05_2"
    },
    {
        "source_sentence": "想因緣故，獲得如來真實之想。",
        "translation": "Because of the causes and conditions of perception, they attain the true perception of the Tathāgata.",
        "source": "T12n0374_032:0556b05_3"
    },
    {
        "source_sentence": "如來想者名無想想，無想想者非眾生想、非男女想，亦非色受想行識想、非想斷想，",
        "translation": "The conception of Buddha is called ‘without conceptual thought’. “Without conceptual thought” is neither the conception of beings, nor the conception of men and women. It is also not the conception of matter, feeling, perception, volition, consciousness, or cessation [of thought].",
        "source": "T12n0374_032:0556b06_4"
    },
    {
        "source_sentence": "眾生之想雖復無常，以想次第相續不斷，故得如來常恒之想。",
        "translation": "Although the conceptions of sentient beings are impermanent, it's because their conceptions continue in sequence and don't stop, so they attain the conception that the Tathāgata is permanent and eternal.",
        "source": "T12n0374_032:0556b08_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556b09_6"
    },
    {
        "source_sentence": "譬如眾生十二因緣，眾生雖滅而因緣常。",
        "translation": "It's like the twelve causes and conditions of sentient beings, whose causes and conditions are constant even though they cease.",
        "source": "T12n0374_032:0556b09_7"
    },
    {
        "source_sentence": "眾生佛性亦復如是，以是故說想為佛性。』",
        "translation": "The buddha-nature of sentient beings is likewise, which is why it's called conception as buddha-nature.'",
        "source": "T12n0374_032:0556b10_8"
    },
    {
        "source_sentence": "又有說言：『行為佛性。",
        "translation": "It's also said that they practice the buddha-nature.",
        "source": "T12n0374_032:0556b11_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0556b12_10"
    },
    {
        "source_sentence": "行名壽命，壽因緣故，獲得如來常住壽命。",
        "translation": "Practice is called life span, and because of the causes and conditions of longevity, they attain the Tathāgata's eternally abiding life span.",
        "source": "T12n0374_032:0556b12_11"
    },
    {
        "source_sentence": "眾生壽命雖復無常、而壽次第相續不斷，故得如來真實常壽。",
        "translation": "Although the life spans of sentient beings are impermanent, their lifespans continue in order and don't stop, so they attain the Tathāgata's true eternal life span.",
        "source": "T12n0374_032:0556b13_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556b14_13"
    },
    {
        "source_sentence": "譬如十二部經，聽者、說者雖復無常，而是經典常存不變。",
        "translation": "It's like the twelve kinds of sūtras that although the listener and speaker are impermanent, the sūtras are always present and don't change.",
        "source": "T12n0374_032:0556b14_14"
    },
    {
        "source_sentence": "眾生佛性亦復如是，以是故說，行為佛性。』",
        "translation": "The buddha-nature of sentient beings is likewise, which is why it's called the buddha-nature of practice.'",
        "source": "T12n0374_032:0556b16_15"
    },
    {
        "source_sentence": "又有說言：『識為佛性。",
        "translation": "It's also said, 'Consciousness is the buddha-nature.",
        "source": "T12n0374_032:0556b17_16"
    },
    {
        "source_sentence": "識因緣故，獲得如來平等之心。",
        "translation": "Because of the causes and conditions of consciousness, they attain the equal mind of the Tathāgata.",
        "source": "T12n0374_032:0556b17_17"
    },
    {
        "source_sentence": "眾生意識雖復無常，而識次第相續不斷，故得如來真實常心。",
        "translation": "Although the thinking consciousnesses of sentient beings are impermanent, their sequential sequence of consciousnesses doesn't stop, so they attain the true eternal mind of the Tathāgata.",
        "source": "T12n0374_032:0556b18_18"
    },
    {
        "source_sentence": "如火熱性，火雖無常，熱非無常。",
        "translation": "Just as fire is with the nature of heat: although fire is impermanent, heat is not impermanent.",
        "source": "T12n0374_032:0556b19_19"
    },
    {
        "source_sentence": "眾生佛性亦復如是，以是故說識為佛性。』",
        "translation": "The buddha-nature of sentient beings is likewise, and it's because of this that consciousness is called the buddha-nature.'",
        "source": "T12n0374_032:0556b20_20"
    },
    {
        "source_sentence": "「又有說言：『離陰有我，我是佛性。",
        "translation": "Again, it's said, 'There's a self apart from the aggregates, which is the buddha-nature.",
        "source": "T12n0374_032:0556b21_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0556b22_0"
    },
    {
        "source_sentence": "我因緣故，獲得如來八自在我。",
        "translation": "Because of these causes and conditions, I've attained the eight self-contained qualities of the Tathāgata.",
        "source": "T12n0374_032:0556b22_1"
    },
    {
        "source_sentence": "有諸外道說言去來、見聞、悲喜，語說為我，如是我相雖復無常，而如來我真實是常。",
        "translation": "Some non-Buddhists say that the past and future, what's seen and heard, and pity and joy are self, and they speak of self as self. Although this mark of self is impermanent, the Tathāgata's true self is permanent.",
        "source": "T12n0374_032:0556b22_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556b24_3"
    },
    {
        "source_sentence": "如陰入界雖復無常，而名是常，眾生佛性亦復如是。",
        "translation": "Just as although the aggregates and sense-fields are impermanent, they're called permanent, so is the buddha-nature of sentient beings likewise.",
        "source": "T12n0374_032:0556b24_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556b26_5"
    },
    {
        "source_sentence": "如彼盲人各各說象，雖不得實，非不說象。",
        "translation": "It's like that blind man who each explains an elephant, even though he can't get the truth, it's not because he doesn't explain an elephant.",
        "source": "T12n0374_032:0556b26_6"
    },
    {
        "source_sentence": "說佛性者亦復如是，非即六法、不離六法。",
        "translation": "It's likewise when someone explains the buddha-nature, which isn't the six dharmas or not separate from the six dharmas.",
        "source": "T12n0374_032:0556b27_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556b28_8"
    },
    {
        "source_sentence": "是故我說眾生佛性，非色不離色，乃至非我，不離我。",
        "translation": "That's why I say that sentient beings are buddha-natured, not form and not separate from form, up to what's not self and not separate from self.",
        "source": "T12n0374_032:0556b28_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556b29_10"
    },
    {
        "source_sentence": "有諸外道雖說有我，而實無我。",
        "translation": "Although some non-Buddhists say that there is a self, in reality there is no self.",
        "source": "T12n0374_032:0556b29_11"
    },
    {
        "source_sentence": "眾生我者，即是五陰，離陰之外更無別我。",
        "translation": "The self of sentient beings refers to the five aggregates, and there's no separate self apart from the aggregates.",
        "source": "T12n0374_032:0556c01_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556c02_13"
    },
    {
        "source_sentence": "譬如莖葉、鬚臺合為蓮花，離是之外更無別花，眾生我者亦復如是。",
        "translation": "It's like when the stems, leaves, and beard are combined into a lotus flower, and there's no separate flower apart from that, so it's likewise with sentient beings and self.",
        "source": "T12n0374_032:0556c02_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556c04_15"
    },
    {
        "source_sentence": "譬如牆壁、草木和合，名之為舍，離是之外，更無別舍。",
        "translation": "It's like when walls and grass are combined, which is called a dwelling, and there's no separate dwelling apart from it.",
        "source": "T12n0374_032:0556c04_16"
    },
    {
        "source_sentence": "如佉陀羅樹、波羅奢樹、尼拘陀樹、欝曇鉢樹和合為林，離是之外更無別林。",
        "translation": "It's like when the caṇḍāla tree, pārāśa tree, nyagrodha tree, and gandharva tree combine to form a forest, and there's no separate forest apart from that.",
        "source": "T12n0374_032:0556c05_17"
    },
    {
        "source_sentence": "譬如車兵、象馬步兵和合為軍，離是之外更無別軍。",
        "translation": "It's like when an army of chariot troops, elephants, horses, and foot soldiers combine to form an army, and there's no separate army apart from that.",
        "source": "T12n0374_032:0556c07_18"
    },
    {
        "source_sentence": "譬如五色雜線和合，名之為綺，離是之外更無別綺。",
        "translation": "It's like a combination of the five colors and mixed threads that's called fancy, and there's no separate fancy apart from this.",
        "source": "T12n0374_032:0556c08_19"
    },
    {
        "source_sentence": "如四姓和合名為大眾，離是之外更無別眾。",
        "translation": "For example, the conjunction of the four castes is called a congregation, and there are no separate congregations apart from that.",
        "source": "T12n0374_032:0556c09_20"
    },
    {
        "source_sentence": "眾生我者亦復如是，離五陰外更無別我。",
        "translation": "The self of sentient beings is likewise: apart from the five aggregates, there is no separate self.",
        "source": "T12n0374_032:0556c10_21"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556c11_22"
    },
    {
        "source_sentence": "如來常住，則名為我。",
        "translation": "When the Tathāgata always abides, it's called self.",
        "source": "T12n0374_032:0556c11_23"
    },
    {
        "source_sentence": "如來法身無邊無礙，不生不滅，得八自在，是名為我。",
        "translation": "The Tathāgata's Dharma body has no limit and no obstruction, doesn't arise or cease, and attains the eight kinds of mastery, which are called self.",
        "source": "T12n0374_032:0556c12_0"
    },
    {
        "source_sentence": "眾生真實無如是我及以我所，但以必定當得畢竟第一義空，故名佛性。』",
        "translation": "Sentient beings really have no such-and-such self and what belongs to self, but they are called buddha-nature because they will surely attain the ultimate emptiness of the ultimate truth.'",
        "source": "T12n0374_032:0556c13_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0556c14_2"
    },
    {
        "source_sentence": "大慈大悲名為佛性。",
        "translation": "Great kindness and great compassion are called the buddha-nature.",
        "source": "T12n0374_032:0556c14_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0556c15_4"
    },
    {
        "source_sentence": "大慈大悲常隨菩薩，如影隨形，一切眾生必定當得大慈大悲，是故說言一切眾生悉有佛性。",
        "translation": "Great kindness and great compassion always follow bodhisattvas, just as a shadow follows a form, and all sentient beings will surely attain great kindness and great compassion; therefore, it's said that all sentient beings have buddha-nature.",
        "source": "T12n0374_032:0556c15_5"
    },
    {
        "source_sentence": "大慈大悲者名為佛性，佛性者名為如來。",
        "translation": "Great kindness and great compassion are called buddha-nature, and buddha-nature is called the Tathāgata.",
        "source": "T12n0374_032:0556c17_6"
    },
    {
        "source_sentence": "大喜大捨名為佛性。",
        "translation": "Great joy and great equanimity are called the buddha-nature.",
        "source": "T12n0374_032:0556c18_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0556c19_8"
    },
    {
        "source_sentence": "菩薩摩訶薩若不能捨二十五有，則不能得阿耨多羅三藐三菩提。",
        "translation": "If bodhisattvas and mahāsattvas can't abandon the twenty-five existences, then they won't attain unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_032:0556c19_9"
    },
    {
        "source_sentence": "以諸眾生必當得故，是故說言一切眾生悉有佛性。",
        "translation": "Because sentient beings will surely attain it, it's therefore said that all sentient beings have buddha-nature.",
        "source": "T12n0374_032:0556c20_10"
    },
    {
        "source_sentence": "大喜大捨者即是佛性，佛性者即是如來。",
        "translation": "The great joy and great equanimity are the buddha-nature, and the buddha-nature is the Tathāgata.",
        "source": "T12n0374_032:0556c21_11"
    },
    {
        "source_sentence": "「佛性者名大信心。",
        "translation": "The buddha-nature is called great faith.",
        "source": "T12n0374_032:0556c22_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0556c23_13"
    },
    {
        "source_sentence": "以信心故，菩薩摩訶薩則能具足檀波羅蜜乃至般若波羅蜜。",
        "translation": "Because of faith, the bodhisattva Mahāsattva can then perfect the perfection of the perfection of giving and even the perfection of wisdom.",
        "source": "T12n0374_032:0556c23_14"
    },
    {
        "source_sentence": "一切眾生必定當得大信心故，是故說言一切眾生悉有佛性。",
        "translation": "Because all sentient beings will surely attain great faith, it's therefore said that all sentient beings have buddha-nature.",
        "source": "T12n0374_032:0556c24_15"
    },
    {
        "source_sentence": "大信心者即是佛性，佛性者即是如來，佛性者名一子地。",
        "translation": "A great faith is the buddha-nature, a buddha-nature is the Tathagata. The buddha-nature is what I call the stage of one offspring.",
        "source": "T12n0374_032:0556c26_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0556c27_17"
    },
    {
        "source_sentence": "以一子地因緣故，菩薩則於一切眾生得平等心。",
        "translation": "Because of the causes and conditions for a single child, the bodhisattva attains equanimity toward all sentient beings.",
        "source": "T12n0374_032:0556c27_18"
    },
    {
        "source_sentence": "一切眾生必定當得一子地故，是故說言一切眾生悉有佛性。",
        "translation": "Because all sentient beings will surely attain the stage of a single offspring, it's therefore said that all sentient beings all have buddha-nature.",
        "source": "T12n0374_032:0556c28_19"
    },
    {
        "source_sentence": "一子地者即是佛性，佛性者即是如來。",
        "translation": "The single stage of a child is the buddha-nature, and the buddha-nature is the Tathāgata.",
        "source": "T12n0374_032:0557a01_20"
    },
    {
        "source_sentence": "「佛性者名第四力。",
        "translation": "The buddha-nature is called the fourth power.",
        "source": "T12n0374_032:0557a02_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0557a02_22"
    },
    {
        "source_sentence": "以第四力因緣故，菩薩則能教化眾生。",
        "translation": "Because of the causes and conditions of the fourth power, bodhisattvas are able to teach sentient beings.",
        "source": "T12n0374_032:0557a02_23"
    },
    {
        "source_sentence": "一切眾生必定當得第四力故，是故說言一切眾生悉有佛性。",
        "translation": "Because all sentient beings will surely attain the fourth power, it's therefore said that all sentient beings have buddha-nature.",
        "source": "T12n0374_032:0557a03_24"
    },
    {
        "source_sentence": "第四力者即是佛性，佛性者即是如來。",
        "translation": "The fourth power is buddha-nature, and buddha-nature is the Tathagata.",
        "source": "T12n0374_032:0557a05_0"
    },
    {
        "source_sentence": "「佛性者名十二因緣。",
        "translation": "The buddha-nature is called the twelve causes and conditions.",
        "source": "T12n0374_032:0557a05_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0557a06_2"
    },
    {
        "source_sentence": "以因緣故，如來常住。",
        "translation": "Because of these causes and conditions, the Tathāgata always abides.",
        "source": "T12n0374_032:0557a06_3"
    },
    {
        "source_sentence": "一切眾生定有如是十二因緣，是故說言一切眾生悉有佛性。",
        "translation": "All sentient beings definitely have these twelve causes and conditions; therefore, it's said that all sentient beings all have buddha-nature.",
        "source": "T12n0374_032:0557a07_0"
    },
    {
        "source_sentence": "十二因緣即是佛性，佛性者即是如來。",
        "translation": "The twelve causes and conditions are the buddha-nature, and the buddha-nature is the Tathāgata.",
        "source": "T12n0374_032:0557a08_1"
    },
    {
        "source_sentence": "「佛性者名四無礙智。",
        "translation": "The buddha-nature is called the four kinds of unhindered cognition.",
        "source": "T12n0374_032:0557a09_2"
    },
    {
        "source_sentence": "以四無礙因緣故說字義無礙，字義無礙故能化眾生。",
        "translation": "Because of four proximate reasons, syllables and meanings are spoken of as proximate. Because words and meanings are proximate, they can transform sentient beings.",
        "source": "T12n0374_032:0557a09_3"
    },
    {
        "source_sentence": "四無礙者即是佛性，佛性者即是如來。",
        "translation": "The four unobstructed ones are the buddha-nature, and the buddha-nature is the Tathagata.",
        "source": "T12n0374_032:0557a11_0"
    },
    {
        "source_sentence": "「佛性者名頂三昧，以修如是頂三昧故，則能總攝一切佛法，是故說言頂三昧者名為佛性。",
        "translation": "The buddha-nature is called the summit samādhi, because cultivating such a summit samādhi enables it to gather all the buddha-teachings. That's why it's called the buddha-nature because it's called the summit samādhi.",
        "source": "T12n0374_032:0557a11_1"
    },
    {
        "source_sentence": "十住菩薩修是三昧未得具足，雖見佛性而不明了。",
        "translation": "The bodhisattvas in the ten abodes cultivate this samādhi that hasn't yet been perfected, even though they see the buddha-nature but don't understand it.",
        "source": "T12n0374_032:0557a13_2"
    },
    {
        "source_sentence": "一切眾生必定得故，是故說言一切眾生悉有佛性。",
        "translation": "Because all sentient beings will surely attain it, it's therefore said that all sentient beings have buddha-nature.",
        "source": "T12n0374_032:0557a15_3"
    },
    {
        "source_sentence": "「善男子，如上所說種種諸法，一切眾生定當得故，是故說言一切眾生悉有佛性。",
        "translation": "Good sons, the various dharmas explained above will surely be attained by all sentient beings, so it's therefore said that all sentient beings have buddha-nature.",
        "source": "T12n0374_032:0557a16_4"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0557a18_5"
    },
    {
        "source_sentence": "我若說色是佛性者，眾生聞已則生邪倒，以邪倒故命終則生阿鼻地獄。",
        "translation": "If I say form is buddha-nature, sentient beings hear it and then become mistaken, and at the end of life because of their mistakenness, they'll be born in avīci hell.",
        "source": "T12n0374_032:0557a18_6"
    },
    {
        "source_sentence": "如來說法為斷地獄，是故不說色是佛性，乃至說識亦復如是。",
        "translation": "The Tathāgata teaches the Dharma in order to end hell, so it's not said that form is buddha-nature, and so it's said that consciousness is likewise.",
        "source": "T12n0374_032:0557a19_7"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0557a21_8"
    },
    {
        "source_sentence": "若有眾生了佛性者，則不須修道；",
        "translation": "If there are any sentient beings who understand buddha-nature, they do not need to cultivate enlightenment.",
        "source": "T12n0374_032:0557a21_9"
    },
    {
        "source_sentence": "十住菩薩修八聖道，少見佛性，況不修者而得見耶？",
        "translation": "A bodhisattva in the tenth abode cultivates the eightfold noble path and rarely sees the buddha-nature, so why wouldn't someone who cultivates it see it?",
        "source": "T12n0374_032:0557a22_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0557a23_11"
    },
    {
        "source_sentence": "如文殊師利諸菩薩等，已無量世修習聖道了知佛性，云何聲聞辟支佛等能知佛性？",
        "translation": "Just as Mañjuśrī and the bodhisattvas have cultivated the noble path for measureless years to know the buddha-nature, how can śrāvakas and pratyekbuddhas know the buddha-nature?",
        "source": "T12n0374_032:0557a23_12"
    },
    {
        "source_sentence": "若諸眾生欲得了了知佛性者，應當一心受持讀誦、書寫解說、供養恭敬、尊重讚歎是涅槃經，",
        "translation": "If sentient beings want to comprehend the buddha-nature, they should wholeheartedly memorize, recite, write, interpret, teach, honor, venerate, revere, and praise this nirvana scripture.",
        "source": "T12n0374_032:0557a25_13"
    },
    {
        "source_sentence": "見有受持乃至讚歎如是經者，應當以好房舍衣服飲食臥具病瘦醫藥而供給之，",
        "translation": "If you see anyone who preserves or even praises such a scripture, you should provide them with good living quarters, clothing, food, drink, bedding, and medicine for sickness and thinness.",
        "source": "T12n0374_032:0557a27_14"
    },
    {
        "source_sentence": "兼復讚歎禮拜問訊。",
        "translation": "They also praised him, venerated him, and greeted him.",
        "source": "T12n0374_032:0557a29_15"
    },
    {
        "source_sentence": "善男子，若有已於過去無量無邊世中，親近供養無量諸佛深種善根，然後乃得聞是經名。",
        "translation": "Good sons, if someone had been intimate with and honored measureless buddhas in measureless and limitless worlds in the past and planted profound roots of goodness, then they'd be able to hear the name of this sūtra.",
        "source": "T12n0374_032:0557b01_16"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0557b03_17"
    },
    {
        "source_sentence": "佛性不可思議，佛、法、僧寶亦不可思議，一切眾生悉有佛性而不能知，",
        "translation": "The buddha-nature is inconceivable, and the treasures of Buddha, Dharma, and Sangha are also inconceivable. All sentient beings have buddha-nature but cannot know it.",
        "source": "T12n0374_032:0557b03_18"
    },
    {
        "source_sentence": "是亦不可思議。",
        "translation": "This is also inconceivable.",
        "source": "T12n0374_032:0557b04_19"
    },
    {
        "source_sentence": "如來常樂我淨之法亦不可思議，一切眾生能信如是大涅槃經亦不可思議。」",
        "translation": "The Tathāgata's eternal bliss of self and pure dharmas is also inconceivable, and all sentient beings who can believe in such a great nirvāṇa sūtra are also inconceivable.",
        "source": "T12n0374_032:0557b05_20"
    },
    {
        "source_sentence": "師子吼菩薩言：「世尊！",
        "translation": "The lion roaring bodhisattva said, Bhagavān!",
        "source": "T12n0374_032:0557b07_0"
    },
    {
        "source_sentence": "如佛所說，一切眾生能信如是大涅槃經不可思議者。",
        "translation": "As the Buddha teaches, all sentient beings can believe that such a great nirvāṇa sūtra is inconceivable.",
        "source": "T12n0374_032:0557b07_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_032:0557b08_2"
    },
    {
        "source_sentence": "是大眾中有八萬五千億人，於是經中不生信心，是故有能信是經者，名不可思議。」",
        "translation": "Eighty-five thousand million people in this crowd didn't give rise to faith in the sūtras, so those who could believe in these sūtras were called inconceivable.",
        "source": "T12n0374_032:0557b08_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0557b10_4"
    },
    {
        "source_sentence": "如是諸人於未來世亦當定得信是經典，見於佛性，得阿耨多羅三藐三菩提。」",
        "translation": "Such people will surely attain faith in this sūtra in the future, see the buddha-nature, and attain unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_032:0557b10_5"
    },
    {
        "source_sentence": "◎◎師子吼言：「世尊！",
        "translation": "Śrīmālā roared and said, Bhagavān!",
        "source": "T12n0374_032:0557b12_6"
    },
    {
        "source_sentence": "云何不退菩薩自知決定有不退心？」",
        "translation": "How does the nonretrogressing bodhisattva know for himself that there's a mind that doesn't regress?",
        "source": "T12n0374_032:0557b13_7"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T12n0374_032:0557b14_8"
    },
    {
        "source_sentence": "菩薩摩訶薩當以苦行自試其心，日食一胡麻，經一七日，粳米、菉豆、麻子、粟[麾-毛+黍]及以白豆，",
        "translation": "“Great enlightening beings should test their own minds with austerities and eat a grain of sesame every day for one or seven days, along with millet, rice, pulse, green beans, hemp seeds, millet [coarse - hair + millet] and white beans.",
        "source": "T12n0374_032:0557b14_9"
    },
    {
        "source_sentence": "亦復如是各一七日。",
        "translation": "It's likewise for one or seven days each.",
        "source": "T12n0374_032:0557b16_10"
    },
    {
        "source_sentence": "食一麻時，作是思惟：『如是苦行，都無利益。",
        "translation": "When he eats a single grain of hemp, he thinks, 'Such and such painful actions are not beneficial.'",
        "source": "T12n0374_032:0557b17_11"
    },
    {
        "source_sentence": "無利益事，尚能為之，況有利益而當不作？",
        "translation": "If there's no benefit, they can still do it, so why wouldn't they do it if there's a benefit?",
        "source": "T12n0374_032:0557b18_12"
    },
    {
        "source_sentence": "於無利益心能堪忍不退不轉，是故定得阿耨多羅三藐三菩提。』",
        "translation": "Being able to tolerate and not retreat or turn away from the mind that has no benefit, he'll surely attain unsurpassed, correct, and complete enlightenment.'",
        "source": "T12n0374_032:0557b19_0"
    },
    {
        "source_sentence": "如是等日修苦行時，一切皮肉消瘦、皺減，如斷生瓠，置之日中，其目欠陷，",
        "translation": "Thus, when they practice austerities on a daily basis, all their skin and flesh lose its thinness and wrinkledness, like cutting off the growth of abscesses and placing them in the middle of the sun, with their eyes trapped.",
        "source": "T12n0374_032:0557b20_1"
    },
    {
        "source_sentence": "如井底星，肉盡肋出，如朽草屋，脊骨連現如重線塼，所坐之處如馬蹄跡。",
        "translation": "It's like the star at the bottom of a well whose flesh is exhausted and its ribs come out; it's like a rotten grass house with back bones that are lined up like heavy thread, and where it sits is like a horse's hooves.",
        "source": "T12n0374_032:0557b22_2"
    },
    {
        "source_sentence": "欲坐則伏，欲起則偃，雖受如是無利益苦，然不退於菩提之心。",
        "translation": "When they want to sit, they are subdued; when they want to rise, they are dismounted. Although they experience such unbeneficial pains, yet they do not turn away from the determination for enlightenment.",
        "source": "T12n0374_032:0557b23_3"
    },
    {
        "source_sentence": "「復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_032:0557b25_4"
    },
    {
        "source_sentence": "菩薩摩訶薩為破眾苦、施安樂故，乃至能捨內外財物及其身命，如棄芻草。",
        "translation": "It's because the bodhisattva Mahāsattva breaks through all suffering and bestows well-being, even to the point where he can abandon internal and external possessions and his body and life like throwing away a sheep's herd.",
        "source": "T12n0374_032:0557b25_5"
    },
    {
        "source_sentence": "若能不惜是身命者，如是菩薩自知必定有不退心，我定當得阿耨多羅三藐三菩提。",
        "translation": "If someone can not cherish this body and life, then the bodhisattva knows for themselves that they must have a mind that doesn't regress, and I will surely attain unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_032:0557b27_6"
    },
    {
        "source_sentence": "「復次菩薩為法因緣，剜身為燈，[疊*毛]纏皮肉，蘇油灌之，燒以為炷。",
        "translation": "“Furthermore, for the sake of the Dharma cause and condition, the bodhisattva plucks out his body as a lamp, wraps it in [a pile of *hair] skin and flesh, pours oil over it, burns it to make a bubble.",
        "source": "T12n0374_032:0557b29_7"
    },
    {
        "source_sentence": "菩薩爾時受是大苦，自呵其心而作是言：『如是苦者，於地獄苦，百千萬分未是一分。",
        "translation": "At the time, the bodhisattva suffered this great pain, rebuked his own mind, and said, 'Such pain is a hundred million parts of the suffering in hell that's not even a part.",
        "source": "T12n0374_032:0557c01_8"
    },
    {
        "source_sentence": "汝於無量百千劫中受大苦惱都無利益，汝若不能受是輕苦，云何而能於地獄中救苦眾生？』",
        "translation": "For measureless hundreds of thousands of eons, you've suffered great pain and suffering for no benefit; if you can't experience this light suffering, how could you be able to save the suffering sentient beings in hell?'",
        "source": "T12n0374_032:0557c03_9"
    },
    {
        "source_sentence": "菩薩摩訶薩作是觀時，身不覺苦，其心不退不動不轉。",
        "translation": "When the bodhisattva Mahāsattva observes this, his body doesn't experience pain, and his mind doesn't retreat, doesn't move, and doesn't turn.",
        "source": "T12n0374_032:0557c05_10"
    },
    {
        "source_sentence": "菩薩爾時應深自知，我定當得阿耨多羅三藐三菩提。",
        "translation": "At that point, the bodhisattva should profoundly know for himself that I will surely attain supreme perfect enlightenment.",
        "source": "T12n0374_032:0557c06_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0557c08_12"
    },
    {
        "source_sentence": "菩薩爾時具足煩惱未有斷者，為法因緣，能以頭目、髓腦、手足、血肉施於眾生，",
        "translation": "“At that time the enlightening beings were supplied with all their afflictions, yet they had not abandoned them. For the sake of the Dharma and for the sake of sentient beings they gave their heads, eyes, marrow, bones, hands, feet, flesh, blood, and so on:",
        "source": "T12n0374_032:0557c08_13"
    },
    {
        "source_sentence": "以釘釘身，投巖赴火。",
        "translation": "He nailed his body with nails and cast it into the cliff to enter the fire.",
        "source": "T12n0374_032:0557c10_14"
    },
    {
        "source_sentence": "菩薩爾時雖受如是無量眾苦，若心不退不動不轉，菩薩當知我今定有不退之心，",
        "translation": "“Even though the bodhisattva at that time endured these immeasurable forms of suffering, if his mind didn’t regress and doesn’t move or evolve, you should know that I now definitely have a mind that doesn’t regress.",
        "source": "T12n0374_032:0557c10_15"
    },
    {
        "source_sentence": "當得阿耨多羅三藐三菩提。",
        "translation": "He'll attain supreme perfect enlightenment.",
        "source": "T12n0374_032:0557c12_16"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0557c13_17"
    },
    {
        "source_sentence": "菩薩摩訶薩為破一切眾生苦惱，願作麁大畜生之身，以身血肉施於眾生，",
        "translation": "“Great enlightening beings, in order to destroy the torments of all sentient beings, wish to be born as great animals and give their flesh and blood to sentient beings.",
        "source": "T12n0374_032:0557c13_18"
    },
    {
        "source_sentence": "眾生取時復生憐愍，菩薩爾時閉氣不喘，示作死相，令彼取者不生殺害疑網之想。",
        "translation": "When sentient beings take it, they'll again become compassionate, and the bodhisattva then closes his breath without panting and shows a sign of death so that those who take it won't give rise to the perception of killing and doubtful webs of doubt.",
        "source": "T12n0374_032:0557c14_19"
    },
    {
        "source_sentence": "菩薩雖受畜生之身，終不造作畜生之業。",
        "translation": "Although a bodhisattva receives the body of an animal, he never creates or acts like an animal.",
        "source": "T12n0374_032:0557c16_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0557c17_21"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0557c17_22"
    },
    {
        "source_sentence": "菩薩既得不退心已，終不造作三惡道業。",
        "translation": "Once a bodhisattva has attained the mind of nonretrogression, he'll never create the actions of the three bad destinies.",
        "source": "T12n0374_032:0557c18_23"
    },
    {
        "source_sentence": "菩薩摩訶薩若未來世有微塵等惡業果報不定受者，以大願力為眾生故而悉受之。",
        "translation": "If bodhisattvas, mahāsattvas, and those who will indeterminately experience the results of bad actions like dusty particles in future lives, they'll all experience them because of the power of their great vow for the sake of sentient beings.",
        "source": "T12n0374_032:0557c19_24"
    },
    {
        "source_sentence": "譬如病人，為鬼所著，藏隱身中，以呪力故，即時相現，或語或喜、或瞋或罵、或啼或哭。",
        "translation": "It's like when a sick person is attached to a ghost and hides it in their body because of the power of the spell, either by saying or joyfully, angrily or abusively, weeping or wailing.",
        "source": "T12n0374_032:0557c21_0"
    },
    {
        "source_sentence": "菩薩摩訶薩未來之世三惡道業亦復如是，菩薩摩訶薩受熊身時，常為眾生演說正法。",
        "translation": "Similarly, when the bodhisattva Mahāsattva receives a bear's body, he always explains the right teaching for sentient beings.",
        "source": "T12n0374_032:0557c22_1"
    },
    {
        "source_sentence": "或受迦賓闍羅鳥身，為諸眾生說正法。",
        "translation": "Or they may receive the body of a Kāśmīra bird and teach the right teaching to sentient beings.",
        "source": "T12n0374_032:0557c24_2"
    },
    {
        "source_sentence": "故受瞿陀身、鹿身、兔身、象身、羖羊身、獼猴、白鴿、金翅鳥、龍蛇之身，",
        "translation": "They therefore receive the bodies of a gandharva, a deer, a rabbit, an elephant, a cow, a sheep, a rhesus monkey, a white pigeon, a garuḍa, a dragon, and a snake.",
        "source": "T12n0374_032:0557c25_3"
    },
    {
        "source_sentence": "受如是等畜生身時，終不造作畜生惡業，常為其餘畜生、眾生，演說正法，",
        "translation": "When they receive the bodies of these animals, they never commit any bad animal actions. They always expound the true Dharma for the sake of other animals and sentient beings.",
        "source": "T12n0374_032:0557c27_4"
    },
    {
        "source_sentence": "令彼聞法速得轉離畜生身故。",
        "translation": "It causes them to hear the Dharma and quickly attain freedom from the body of an animal.",
        "source": "T12n0374_032:0557c28_5"
    },
    {
        "source_sentence": "菩薩爾時雖受畜生身不作惡業，當知必定有不退心。",
        "translation": "Although the bodhisattva at that point received the body of an animal and didn't do bad actions, he should know that he must have a mind that doesn't regress.",
        "source": "T12n0374_032:0557c29_6"
    },
    {
        "source_sentence": "「菩薩摩訶薩於飢饉世見餓眾生，作龜魚身無量由延，復作是願：『願諸眾生取我肉時，",
        "translation": "“When great enlightening beings see hungry sentient beings in the world of hunger, they make tortoises and fish whose bodies are immeasurable yojanas long. They also make this vow:",
        "source": "T12n0374_032:0558a01_7"
    },
    {
        "source_sentence": "隨取隨生，因食我肉離飢渴苦，一切悉發阿耨多羅三藐三菩提心。』",
        "translation": "Whatever they take and produce, they'll be freed from the suffering of hunger and thirst by eating my flesh and all give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T12n0374_032:0558a03_8"
    },
    {
        "source_sentence": "菩薩發願：『若有因我離飢渴者，未來之世，速得遠離二十五有飢渴之患。』",
        "translation": "The bodhisattva gives rise to the vow, 'If there's a cause for me to part with hunger and thirst, in the future world, I'll quickly be freed from the twenty-five afflictions of hunger and thirst.'",
        "source": "T12n0374_032:0558a05_9"
    },
    {
        "source_sentence": "菩薩摩訶薩受如是苦，心不退者，當知必定得阿耨多羅三藐三菩提。",
        "translation": "When a bodhisattva-mahāsattva experiences such suffering and doesn't retreat with his mind, he should know that he'll surely attain unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_032:0558a07_0"
    },
    {
        "source_sentence": "「復次菩薩於疾疫世見病苦者，作是思惟：『如藥樹王，若有病者，取根取莖、取枝取葉、取花取果、取皮取膚悉得愈病，",
        "translation": "“Furthermore, the bodhisattva observes the sickness and suffering of those in the world afflicted by epidemics. He thinks thus:",
        "source": "T12n0374_032:0558a08_1"
    },
    {
        "source_sentence": "願我此身亦復如是，若有病者，聞聲、觸身、服食血肉乃至骨髓，病悉除愈；",
        "translation": "May this body of mine also be likewise. If someone is ill, if they hear sound or touch my body, eat flesh and blood, or even bone marrow, their illnesses will all be cured.",
        "source": "T12n0374_032:0558a11_2"
    },
    {
        "source_sentence": "願諸眾生食我肉時，不生惡心如食子肉；",
        "translation": "May all sentient beings, when they eat my flesh, not give rise to bad thoughts like eating the flesh of a child.",
        "source": "T12n0374_032:0558a12_3"
    },
    {
        "source_sentence": "我治病已，常為說法，願彼信受，思惟轉教。』",
        "translation": "After I heal my illness, I'll always explain the teaching for them, wishing to believe and accept it, and contemplate and teach it.'",
        "source": "T12n0374_032:0558a13_4"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_032:0558a14_5"
    },
    {
        "source_sentence": "菩薩具足煩惱雖受身苦，其心不退不動不轉，當知必定得不退心，成阿耨多羅三藐三菩提。",
        "translation": "Although a bodhisattva is fully afflicted by affliction and experiences physical suffering, his mind doesn't retreat, doesn't move, and doesn't turn, you should know that he'll surely attain nonretrogressing mind and achieve unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_032:0558a14_6"
    },
    {
        "source_sentence": "「復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_032:0558a17_7"
    },
    {
        "source_sentence": "若有眾生為鬼所病，菩薩見已即作是言：『願作鬼身、大身、健身、多眷屬身，",
        "translation": "If there are any sentient beings who suffer from the disease of ghosthood, on seeing them the bodhisattva immediately says these words:",
        "source": "T12n0374_032:0558a17_8"
    },
    {
        "source_sentence": "使彼聞見病得除愈。』",
        "translation": "That way, they'll hear and see their illnesses and be healed.'",
        "source": "T12n0374_032:0558a19_0"
    },
    {
        "source_sentence": "菩薩摩訶薩為眾生故勤修苦行，雖有煩惱，不污其心。",
        "translation": "The bodhisattva Mahāsattva diligently cultivates ascetic practices for the sake of sentient beings, and even though they have afflictions, they don't stain their minds.",
        "source": "T12n0374_032:0558a19_1"
    },
    {
        "source_sentence": "「復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_032:0558a20_2"
    },
    {
        "source_sentence": "菩薩摩訶薩雖復修行六波羅蜜，亦不求於六波羅蜜果。",
        "translation": "Although the bodhisattva Mahāsattva still cultivates the six perfections, he doesn't seek the fruit of the six perfections.",
        "source": "T12n0374_032:0558a21_0"
    },
    {
        "source_sentence": "修行無上六波羅蜜時，作是願言：『我今以此六波羅蜜施一切眾生，一一眾生受我施已，",
        "translation": "When they practice the highest of the six transcendent ways, they make this vow, saying, ‘Now that I have given these six transcendent ways to all sentient beings, each and every sentient being who receives them from me.",
        "source": "T12n0374_032:0558a22_1"
    },
    {
        "source_sentence": "悉令得成阿耨多羅三藐三菩提，我亦自為六波羅蜜勤修苦行、受諸苦惱，",
        "translation": "I myself also diligently practice asceticism for the sake of the six transcendent ways, enduring all kinds of pain and suffering.",
        "source": "T12n0374_032:0558a24_2"
    },
    {
        "source_sentence": "當受苦時，願我不退菩提之心。』",
        "translation": "When you're suffering, may I not regress from the mind of enlightenment.'",
        "source": "T12n0374_032:0558a26_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0558a26_1"
    },
    {
        "source_sentence": "菩薩摩訶薩作是願時，是名不退菩提之相。",
        "translation": "When the bodhisattva Mahāsattva makes this vow, this is called the mark of not regressing from enlightenment.",
        "source": "T12n0374_032:0558a26_2"
    },
    {
        "source_sentence": "「復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_032:0558a27_3"
    },
    {
        "source_sentence": "菩薩摩訶薩不可思議。",
        "translation": "The bodhisattva Mahāsattva is inconceivable.",
        "source": "T12n0374_032:0558a28_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0558a28_5"
    },
    {
        "source_sentence": "菩薩摩訶薩深知生死多諸罪過，觀大涅槃有大功德，為諸眾生處在生死、受種種苦，",
        "translation": "“Great enlightening beings, knowing well the many sins and errors of birth and death, observe that great nirvana has great merit. For sentient beings there is birth and death and all kinds of suffering.",
        "source": "T12n0374_032:0558a28_6"
    },
    {
        "source_sentence": "心無退轉，是名菩薩不可思議。",
        "translation": "The absence of retrogression in mind is called the bodhisattva's inconceivability.",
        "source": "T12n0374_032:0558b01_7"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_032:0558b02_8"
    },
    {
        "source_sentence": "菩薩摩訶薩無有因緣而生憐愍，實不受恩而常施恩，雖施於恩而不求報，",
        "translation": "“Great enlightening beings have no causes or conditions to show compassion, and though they really don’t accept kindness, they always give kindness; even though they give kindness, they don’t seek reward.",
        "source": "T12n0374_032:0558b02_9"
    },
    {
        "source_sentence": "是故復名不可思議。",
        "translation": "Therefore, it's also called inconceivable.",
        "source": "T12n0374_032:0558b04_10"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_032:0558b05_0"
    },
    {
        "source_sentence": "或有眾生為自利益修諸苦行，菩薩摩訶薩為利他故修行苦行，是名自利，",
        "translation": "“When some sentient beings practice austerities for their own benefit, great enlightening beings practice them for the benefit of others: this is called self-benefiting.",
        "source": "T12n0374_032:0558b05_1"
    },
    {
        "source_sentence": "是故復名不可思議。",
        "translation": "Therefore, it's also called inconceivable.",
        "source": "T12n0374_032:0558b07_0"
    },
    {
        "source_sentence": "「復次菩薩具足煩惱，為壞怨親所受諸苦，修平等心，是故復名不可思議。",
        "translation": "Furthermore, the bodhisattva is endowed with afflictions, cultivates equanimity in order to destroy the sufferings experienced by enemies and relatives, and therefore is also called inconceivable.",
        "source": "T12n0374_032:0558b08_0"
    },
    {
        "source_sentence": "復次菩薩若見諸惡不善眾生，若訶責、若軟語、若驅擯、若捨之，有惡性者現為軟語，",
        "translation": "“Furthermore, if a bodhisattva sees evil and unwholesome sentient beings, he or she scolds, speaks softly, drives away, or turns away those who have bad intentions.",
        "source": "T12n0374_032:0558b09_1"
    },
    {
        "source_sentence": "有憍慢者現為大慢，而其內心實無憍慢，是名菩薩方便不可思議。",
        "translation": "Those who have arrogance are now greatly conceited, but they really have no arrogance in their minds, which is called the bodhisattva's method that's inconceivable.",
        "source": "T12n0374_032:0558b11_2"
    },
    {
        "source_sentence": "復次菩薩具足煩惱少財物時，而求者多，心不迮小，是名菩薩不可思議。",
        "translation": "Furthermore, when a bodhisattva has few possessions that are afflicted by affliction and many people who seek them but their minds aren't stingy or small, this is called the bodhisattva's inconceivable.",
        "source": "T12n0374_032:0558b13_3"
    },
    {
        "source_sentence": "復次菩薩於佛出時，知佛功德，為眾生故，於無佛處受邊地身，如盲如聾、如跛如躄，",
        "translation": "“Furthermore, the enlightening beings know the Buddha’s virtues at the time of his emergence. For the sake of sentient beings, they receive bodies as if they were blind, deaf, dumb, or crippled, from a place where there are no buddhas:",
        "source": "T12n0374_032:0558b14_4"
    },
    {
        "source_sentence": "是名菩薩不可思議。",
        "translation": "This is called the bodhisattva's inconceivability.",
        "source": "T12n0374_032:0558b16_5"
    },
    {
        "source_sentence": "復次菩薩深知眾生所有罪過，為度脫故常與共行，雖隨其意罪垢不污，",
        "translation": "“Furthermore, enlightening beings know the sins of sentient beings and always work with them for their liberation. Though they may do as they wish, yet they are not stained by the stain of sin.",
        "source": "T12n0374_032:0558b17_6"
    },
    {
        "source_sentence": "是故復名不可思議。",
        "translation": "Therefore, it's also called inconceivable.",
        "source": "T12n0374_032:0558b18_7"
    },
    {
        "source_sentence": "「復次菩薩了了知見，無眾生相、無煩惱污、無修習道離煩惱者，雖為菩提無菩提行，",
        "translation": "“Furthermore, the bodhisattva understands and sees that there are no characteristics of sentient beings, no afflictions, no defilements, and no paths of cultivation or freedom from afflictions. Although he does so for the sake of enlightenment, he has no practice of enlightenment.",
        "source": "T12n0374_032:0558b20_0"
    },
    {
        "source_sentence": "亦無成就菩提行者，無有受苦及破苦者，而亦能為眾生壞苦行菩提行，",
        "translation": "Nor is there anyone who has perfected the practice of enlightenment. There is no one who experiences suffering or breaks through suffering, yet he can also for sentient beings undertake the practice of enlightenment by destroying the practice of suffering.",
        "source": "T12n0374_032:0558b21_1"
    },
    {
        "source_sentence": "是故復名不可思議。",
        "translation": "Therefore, it's also called inconceivable.",
        "source": "T12n0374_032:0558b23_2"
    },
    {
        "source_sentence": "復次菩薩受後邊身，處兜率天，是亦名為不可思議。",
        "translation": "Furthermore, when the bodhisattva receives a rear body and goes to Tuṣita Heaven, this is also called inconceivable.",
        "source": "T12n0374_032:0558b24_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0558b25_1"
    },
    {
        "source_sentence": "兜率陀天，欲界中勝，在下天者其心放逸，在上天者諸根闇鈍，是故名勝。",
        "translation": "The Tuṣita gods are superior in the desire realm, and those in the lower heavens have carelessness of mind; those in the higher heavens have dull faculties, which is why they're called superior.",
        "source": "T12n0374_032:0558b25_2"
    },
    {
        "source_sentence": "修施修戒，得上下身；",
        "translation": "Practicing giving and practicing morality, they attain higher and lower bodies.",
        "source": "T12n0374_032:0558b27_0"
    },
    {
        "source_sentence": "修施戒定，得兜率身。",
        "translation": "He cultivates generosity, observes precepts, and concentration, and attains the body of Tuṣita.",
        "source": "T12n0374_032:0558b27_1"
    },
    {
        "source_sentence": "一切菩薩毀呰諸有、破壞諸有，終不造作兜率天業，受彼天身。",
        "translation": "All bodhisattvas disparage all existences and destroy all existences, never committing the actions of the gods in Tuṣita Heaven and receiving their bodies.",
        "source": "T12n0374_032:0558b27_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0558b29_3"
    },
    {
        "source_sentence": "菩薩若處其餘諸有，亦能教化成就眾生，實無欲心而生欲界，是故復名不可思議。",
        "translation": "If bodhisattvas are in other existences, they can also teach and cultivate sentient beings who accomplish them, really give rise to the desire realm without a desire mind, which is why they're again called inconceivable.",
        "source": "T12n0374_032:0558b29_4"
    },
    {
        "source_sentence": "菩薩摩訶薩生兜率天，有三事勝：一者命、二者色、三者名。",
        "translation": "When the bodhisattva Mahāsattva is born in Tuṣita Heaven, there are three things that are superior: first, life, second, form, and third, name.",
        "source": "T12n0374_032:0558c02_5"
    },
    {
        "source_sentence": "菩薩摩訶薩實不求於命、色、名稱，雖無求心而所得勝。",
        "translation": "The bodhisattva Mahāsattva really doesn't seek life, form, or fame, and although he doesn't seek mind, he attains superiority.",
        "source": "T12n0374_032:0558c03_6"
    },
    {
        "source_sentence": "菩薩摩訶薩深樂涅槃，然有因緣亦勝，是故復名不可思議。",
        "translation": "The bodhisattva Mahāsattva profoundly delights in nirvāṇa, but there are causes and conditions that are also superior; therefore, it's also called inconceivable.",
        "source": "T12n0374_032:0558c04_7"
    },
    {
        "source_sentence": "菩薩摩訶薩如是三事雖勝諸天，而諸天等於菩薩所，終不生於瞋心、妬心、憍慢之心，",
        "translation": "Although the bodhisattva Mahāsattva is superior to the gods in these three ways, the gods never give rise to anger, jealousy, or arrogance at the bodhisattva's place.",
        "source": "T12n0374_032:0558c06_8"
    },
    {
        "source_sentence": "常生喜心，菩薩於天亦不憍慢，是故復名不可思議。",
        "translation": "Because they always give rise to joy, the bodhisattva doesn't become conceited with respect to gods, which is why it's also called inconceivable.",
        "source": "T12n0374_032:0558c08_9"
    },
    {
        "source_sentence": "菩薩摩訶薩不造命業，而於彼天畢竟壽命，是名命勝。",
        "translation": "When a bodhisattva-mahāsattva doesn't create life, but his life ends in that heaven, this is called the superiority of life.",
        "source": "T12n0374_032:0558c09_10"
    },
    {
        "source_sentence": "亦無色業，而妙色身光明遍滿，是名色勝。",
        "translation": "It's also formless action, yet the marvelous form body is filled with light, which is called form that's superior.",
        "source": "T12n0374_032:0558c10_11"
    },
    {
        "source_sentence": "菩薩摩訶薩處彼天宮，不樂五欲，唯為法事，是故名稱充滿十方，是名名勝。",
        "translation": "When the bodhisattva Mahāsattva lives in that celestial palace, he doesn't delight in the five desires but only serves the Dharma; therefore, his reputation fills the ten directions, which is called name and name superior.",
        "source": "T12n0374_032:0558c11_12"
    },
    {
        "source_sentence": "是故復名不可思議。",
        "translation": "Therefore, it's also called inconceivable.",
        "source": "T12n0374_032:0558c13_13"
    },
    {
        "source_sentence": "「菩薩摩訶薩下兜率天，是時大地六種震動，是故復名不可思議。",
        "translation": "The bodhisattva Mahāsattva descends to the Tuṣita Heaven when the earth shakes in six ways, which is why it's also called inconceivable.",
        "source": "T12n0374_032:0558c13_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_032:0558c15_15"
    },
    {
        "source_sentence": "菩薩下時，欲色諸天悉來侍送，發大音聲讚歎菩薩，以口風氣故令地動。",
        "translation": "When the bodhisattva descended, the gods of Kāmadhātu all came to escort him, and they spoke in a loud voice praising the bodhisattva, causing the earth to shake because of the wind and energy of their mouths.",
        "source": "T12n0374_032:0558c15_16"
    },
    {
        "source_sentence": "復有菩薩人中象王，人中象王名為龍王，龍王初入胎時，有諸龍王在此地下或怖、或喜，",
        "translation": "Again, there is a bodhisattva who is the king of elephants among humans. The king of elephants among humans is called the king of dragons. When the king of dragons first enters the womb, some of the kings of dragons may be fearful or delighted when they are in the earth.",
        "source": "T12n0374_032:0558c17_0"
    },
    {
        "source_sentence": "是故大地六種震動，是故復名不可思議。",
        "translation": "That is why the earth shakes in six ways. That is why it is further said to be inconceivable.",
        "source": "T12n0374_032:0558c19_0"
    },
    {
        "source_sentence": "「菩薩摩訶薩知入胎時、住時、出時、知父、知母，不淨不污，如帝釋髻青色寶珠，",
        "translation": "“The great enlightening being knows when he enters the womb, when he abides, when he emerges, knowing his father and mother, neither pure nor impure, like Indra’s topknot of a blue-colored jewel.",
        "source": "T12n0374_032:0558c19_1"
    },
    {
        "source_sentence": "是故復名不可思議。",
        "translation": "Therefore, it's also called inconceivable.",
        "source": "T12n0374_032:0558c21_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0558c22_3"
    },
    {
        "source_sentence": "大涅槃經亦復如是，不可思議。",
        "translation": "The Great Nirvana Sutra is likewise, inconceivable.",
        "source": "T12n0374_032:0558c22_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0558c23_0"
    },
    {
        "source_sentence": "譬如大海，有八不思議。",
        "translation": "It's like the ocean, which has eight inconceivable qualities.",
        "source": "T12n0374_032:0558c23_1"
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T12n0374_032:0558c23_2"
    },
    {
        "source_sentence": "一者漸漸轉深、二者深難得底、三者同一醎味、四者潮不過限、五者有種種寶藏、六者大身眾生在中居住、七者不宿死尸、八者一切萬流大雨投之不增不減。",
        "translation": "One, it gradually becomes deeper and deeper; two, it's difficult to find a bottom that's deep; three, the same crude taste; four, the tide has no limit; five, there are stores of various treasures; six, large-bodied sentient beings live there; seven, they don't dwell in dead corpses; eight, all the",
        "source": "T12n0374_032:0558c24_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0558c27_1"
    },
    {
        "source_sentence": "漸漸轉深有三事。",
        "translation": "Gradually, there are three things that gradually develop depth.",
        "source": "T12n0374_032:0558c27_2"
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are these three?",
        "source": "T12n0374_032:0558c28_3"
    },
    {
        "source_sentence": "一者眾生福力、二者順風而行、三者河水入故，乃至不增不減亦各有三。",
        "translation": "1. the power of sentient beings' virtue, 2. walking in accord with the wind, and 3. because river water enters it, up to the point where it doesn't increase or decrease, there are three.",
        "source": "T12n0374_032:0558c28_4"
    },
    {
        "source_sentence": "「是大涅槃微妙經典亦復如是，有八不思議：一者漸漸深。",
        "translation": "So it is with this subtle scripture of the great nirvāṇa, which has eight inconceivable parts:",
        "source": "T12n0374_032:0559a01_5"
    },
    {
        "source_sentence": "所謂優婆塞戒、沙彌戒、比丘戒、菩薩戒，須陀洹果、斯陀含果、阿那含果、阿羅漢果、辟支佛果、菩薩果、阿耨多羅三藐三菩提果，",
        "translation": "It's called the fruit of stream entry, the fruit of once-returning, the fruit of non-returning, the fruit of arhatship, the fruit of pratyekabuddhahood, the fruit of bodhisattvahood, and the fruit of unsurpassed, correct, perfect enlightenment.",
        "source": "T12n0374_032:0559a02_6"
    },
    {
        "source_sentence": "是涅槃經說如是等法，是名漸漸深，是故此經名漸漸深。",
        "translation": "The Nirvana Sutra teaches that such things are gradually profound. That is why this sutra is called gradually profound.",
        "source": "T12n0374_032:0559a05_7"
    },
    {
        "source_sentence": "「二者深難得底。",
        "translation": "“Second, it’s a profound and difficult to fathom.",
        "source": "T12n0374_032:0559a06_8"
    },
    {
        "source_sentence": "如來世尊不生不滅，不得阿耨多羅三藐三菩提，不轉法輪，不食不受，",
        "translation": "The Bhagavat, the Tathāgata, neither arises nor perishes, attains highest, complete enlightenment, doesn’t turn the wheel of the Dharma, and doesn’t eat or receive food.",
        "source": "T12n0374_032:0559a06_9"
    },
    {
        "source_sentence": "不行惠施，是故名為常樂我淨。",
        "translation": "They don't practice generosity, which is therefore called permanence, bliss, self, and purity.",
        "source": "T12n0374_032:0559a08_10"
    },
    {
        "source_sentence": "一切眾生悉有佛性，佛性非色不離於色，非受想行識乃至不離於識，是常可見，",
        "translation": "All sentient beings all have buddha-nature. The buddha-nature is neither form nor formless apart from form; it is not feeling, perception, volition, or consciousness, up to the point where it is not separate from consciousness—this is eternal and visible.",
        "source": "T12n0374_032:0559a09_11"
    },
    {
        "source_sentence": "了因非作因。",
        "translation": "It's the cause of knowing and not the cause of doing.",
        "source": "T12n0374_032:0559a10_12"
    },
    {
        "source_sentence": "須陀洹乃至辟支佛當得阿耨多羅三藐三菩提，亦無煩惱，亦無住處，雖無煩惱不名為常，",
        "translation": "Sudarśana or even a pratyekabuddha will attain anuttarii samyaksarrzbodhi, which also has no afflictions and no dwelling place. Even though it has no afflictions, it is not called permanence.",
        "source": "T12n0374_032:0559a11_13"
    },
    {
        "source_sentence": "是故名深。",
        "translation": "That's why it's called profound.",
        "source": "T12n0374_032:0559a13_14"
    },
    {
        "source_sentence": "復有甚深，於是經中或時說我、或說無我，或時說常、或說無常，或時說淨、或說不淨，",
        "translation": "Again, there is another profound meaning: sometimes the sūtra speaks of self, sometimes selflessness, sometimes permanence, sometimes impermanence, sometimes purity, sometimes impurity.",
        "source": "T12n0374_032:0559a13_15"
    },
    {
        "source_sentence": "或時說樂、或時說苦，或時說空、或說不空，或說一切有、或說一切無，",
        "translation": "Sometimes it is said to be pleasant; sometimes it is said to be painful; sometimes it is said to be empty; sometimes it is said to be nonempty; sometimes it is said to exist in all things; sometimes it is said to be nonexistent.",
        "source": "T12n0374_032:0559a15_16"
    },
    {
        "source_sentence": "或說三乘、或說一乘，或說五陰即是佛性、金剛三昧及以中道、首楞嚴三昧、十二因緣、第一義空、慈悲平等，",
        "translation": "They may teach the three vehicles, or they may teach the one vehicle, or they may teach that the five aggregates are buddha-nature, adamantine concentration and the middle way, śūraṃgama concentration, twelve causes and conditions, emptiness of the ultimate truth, and equality of kindness and pity.",
        "source": "T12n0374_032:0559a16_17"
    },
    {
        "source_sentence": "於諸眾生頂智信心，知諸根力，一切法中無罣礙智，雖有佛性不說決定，",
        "translation": "The supreme knowledge and faith in all sentient beings, knowing the power of their faculties, unhindered knowledge in all things, even though they have buddha-nature, they don’t teach certainty.",
        "source": "T12n0374_032:0559a19_18"
    },
    {
        "source_sentence": "是故名深。",
        "translation": "That's why it's called profound.",
        "source": "T12n0374_032:0559a21_19"
    },
    {
        "source_sentence": "「三者一味。",
        "translation": "The third is the single flavor.",
        "source": "T12n0374_032:0559a21_20"
    },
    {
        "source_sentence": "一切眾生同有佛性，皆同一乘、同一解脫、一因、一果、同一甘露，一切當得常樂我淨，",
        "translation": "All sentient beings have the same buddha-nature, but they all share the same vehicle, the same liberation, the same cause, the same effect, and the same ambrosia—all will attain permanence, bliss, self, self, and purity.",
        "source": "T12n0374_032:0559a21_21"
    },
    {
        "source_sentence": "是名一味。",
        "translation": "This is called the single flavor.",
        "source": "T12n0374_032:0559a23_22"
    },
    {
        "source_sentence": "「四者潮不過限。",
        "translation": "Fourth, the tide is not limited.",
        "source": "T12n0374_032:0559a23_23"
    },
    {
        "source_sentence": "如是經中制諸比丘，不得受畜八不淨物。",
        "translation": "Thus, the sūtras say that monks are not allowed to accept or store eight impure things.",
        "source": "T12n0374_032:0559a24_0"
    },
    {
        "source_sentence": "若我弟子有能受持讀誦書寫解說分別是大涅槃微妙經典，寧失身命終不犯之，",
        "translation": "If any of my disciples were to memorize, recite, write, interpret, and explain this subtle scripture of the Great Nirvana, they would rather lose their lives than violate it.",
        "source": "T12n0374_032:0559a24_1"
    },
    {
        "source_sentence": "是名潮不過限。",
        "translation": "This is called a tide that has no limit.",
        "source": "T12n0374_032:0559a26_2"
    },
    {
        "source_sentence": "「五者有種種寶藏。",
        "translation": "“Fifth, there are various stores of treasure.",
        "source": "T12n0374_032:0559a27_3"
    },
    {
        "source_sentence": "是經即是無量寶藏。",
        "translation": "This sūtra is an immeasurable store of treasure.",
        "source": "T12n0374_032:0559a27_4"
    },
    {
        "source_sentence": "所言寶者，謂四念處、四正勤、四如意分、五根、五力、七覺分、八聖道分，",
        "translation": "What's called treasure refers to the four abodes of mindfulness, the fourfold correct effort, the four factors of supernormal power, the five faculties, the five powers, the seven factors of awakening, and the eight noble factors of the path.",
        "source": "T12n0374_032:0559a28_5"
    },
    {
        "source_sentence": "嬰兒行、聖行、梵行、天行，諸善方便、眾生佛性、菩薩功德、如來功德、聲聞功德、緣覺功德、六波羅蜜、無量三昧、無量智慧，",
        "translation": "“Great enlightening beings practice the ways of the unenlightened, practice the ways of the holy, practice the ways of the Brahmas, and practice the teachings of the gods; they practice good means for sentient beings, their buddha-nature, the virtues of enlightening beings, the virtues of buddhas, the virtues of buddhas, the virtu",
        "source": "T12n0374_032:0559a29_6"
    },
    {
        "source_sentence": "是名寶藏。",
        "translation": "This is called the jeweled store.",
        "source": "T12n0374_032:0559b03_7"
    },
    {
        "source_sentence": "「六者大身眾生所居住處。",
        "translation": "Sixth, the great body is the place where sentient beings live.",
        "source": "T12n0374_032:0559b03_8"
    },
    {
        "source_sentence": "大身眾生者謂佛菩薩，大智慧故名大眾生，大身故、大心故、大莊嚴故、大調伏故、大方便故、大說法故、大勢力故、大徒眾故、大神通故、大慈悲故、常不變故、一切眾生無罣礙故、容受一切諸眾生故，",
        "translation": "“Many beings with a great body are buddhas and bodhisattvas. Because of their great wisdom, they are called ‘many beings’: because of the great body, because of the great mind, because of the great adornment, because of the great discipline, because of the great effort, because of the great doctrine, because of the great power, because of the great community of disc",
        "source": "T12n0374_032:0559b04_9"
    },
    {
        "source_sentence": "是名大身眾生所居之處。",
        "translation": "This is called the place where large-bodied sentient beings live.",
        "source": "T12n0374_032:0559b08_10"
    },
    {
        "source_sentence": "「七者不宿死尸。",
        "translation": "“Seven, he won’t stay in a dead corpse.",
        "source": "T12n0374_032:0559b09_11"
    },
    {
        "source_sentence": "死尸者，謂一闡提、犯四重禁、五無間罪、誹謗方等，非法說法、法說非法，",
        "translation": "A dead corpse refers to an icchantika who commits one of the four grave offenses, five unremitting crimes, slanderous evil, speaks a teaching that's not true and speaks a teaching that's not true.",
        "source": "T12n0374_032:0559b09_12"
    },
    {
        "source_sentence": "受畜八種不淨之物，佛物、僧物隨意而用，或於比丘、比丘尼所作非法事，",
        "translation": "They accept and store eight kinds of impure things, the Buddha's property and the property of the saṃgha as they wish, or do unlawful things for monks and nuns.",
        "source": "T12n0374_032:0559b11_13"
    },
    {
        "source_sentence": "是名死尸。",
        "translation": "This is called a dead corpse.",
        "source": "T12n0374_032:0559b12_14"
    },
    {
        "source_sentence": "是涅槃經離如是等，是故名為不宿死尸。",
        "translation": "It's because the Nirvāṇa-sūtra is free of such things, so it's called not staying in a dead corpse.",
        "source": "T12n0374_032:0559b13_15"
    },
    {
        "source_sentence": "「八者不增不減。",
        "translation": "Eight, it doesn't increase or decrease.",
        "source": "T12n0374_032:0559b14_16"
    },
    {
        "source_sentence": "無邊際故、無始終故、非色故、非作故、常住故、不生滅故、一切眾生悉平等故、一切法性同一性故，",
        "translation": "Because there is no limit, because there is no beginning and end, because it is not form, because it is not made, because it always abides, because it does not arise or cease, because all beings are completely equal, because the essence of all things is one and the same.",
        "source": "T12n0374_032:0559b14_17"
    },
    {
        "source_sentence": "是名無增減，是故此經如彼大海有八不思議。」",
        "translation": "This is called having no increase or decrease, which is why this sūtra says that there are eight inconceivable things like the ocean.",
        "source": "T12n0374_032:0559b16_18"
    },
    {
        "source_sentence": "◎◎師子吼言：「世尊！",
        "translation": "Śrīmālā roared and said, Bhagavān!",
        "source": "T12n0374_032:0559b17_19"
    },
    {
        "source_sentence": "若言如來不生不滅名為深者，一切眾生有四種生：卵生、胎生、濕生、化生，",
        "translation": "If someone says that the Tathāgata neither arises nor ceases and is called profound, they mean that all sentient beings are born in four ways:",
        "source": "T12n0374_032:0559b18_20"
    },
    {
        "source_sentence": "是四種生，人中具有。",
        "translation": "These are the four kinds of birth among humans.",
        "source": "T12n0374_032:0559b20_0"
    },
    {
        "source_sentence": "如施婆羅比丘、優婆施婆羅比丘、彌迦羅長者母、尼拘陀長者母、半闍羅長者母，",
        "translation": "“Furthermore, reverend Mahāprajāpatī Gautamī, it is like the mother of a charitable brahmin or a pious brahmin. The same applies to the mothers of wealthy householders:",
        "source": "T12n0374_032:0559b20_1"
    },
    {
        "source_sentence": "各五百子同於卵生，當知人中則有卵生。",
        "translation": "Each of the five hundred offspring is the same as an egg-born, and you should know that among humans there's an egg-born.",
        "source": "T12n0374_032:0559b22_2"
    },
    {
        "source_sentence": "濕生者如佛所說，我於往昔作菩薩時，作頂生王及手生王；",
        "translation": "The arising of moisture is as has been said by the Buddha. In the past, when I was an enlightening being, I became the king of hair that grows on the top of my head and the king of hands.",
        "source": "T12n0374_032:0559b23_3"
    },
    {
        "source_sentence": "如今所說，菴羅樹女、迦不多樹女，當知人中則有濕生。",
        "translation": "You should know that among humans there are those born from moisture, such as the Trāyastriṃśa goddesses and Kātyāyana goddesses.",
        "source": "T12n0374_032:0559b24_4"
    },
    {
        "source_sentence": "劫初之時，一切眾生皆悉化生。",
        "translation": "At the beginning of the kalpa, all sentient beings are born by transformation.",
        "source": "T12n0374_032:0559b25_5"
    },
    {
        "source_sentence": "如來世尊得八自在，何因緣故不化生耶？」",
        "translation": "The Bhagavān, the Tathāgata, has attained eight kinds of unimpededness, so why isn't he born by transformation?",
        "source": "T12n0374_032:0559b26_6"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T12n0374_032:0559b27_7"
    },
    {
        "source_sentence": "一切眾生四生所生，得聖法已，不得如本卵生、濕生。",
        "translation": "All sentient beings are born in the four forms of birth, and after attaining the noble dharma, they can't be born like the originally egg-born or moisture-born.",
        "source": "T12n0374_032:0559b27_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0559b28_9"
    },
    {
        "source_sentence": "劫初眾生皆悉化生，當爾之時佛不出世。",
        "translation": "At the beginning of the kalpa, all sentient beings are born by transformation, and at that time the Buddha doesn't appear in the world.",
        "source": "T12n0374_032:0559b29_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0559c01_0"
    },
    {
        "source_sentence": "若有眾生遇病苦時，須醫須藥。",
        "translation": "If there are sentient beings who experience illness and suffering, they need a doctor or medicine.",
        "source": "T12n0374_032:0559c01_1"
    },
    {
        "source_sentence": "劫初之時，眾生化生，雖有煩惱，其病未發，是故如來不出其世。",
        "translation": "At the beginning of the kalpa, sentient beings are born by transformation, and although they have afflictions, their illnesses haven't yet arisen; therefore, the Tathāgata doesn't appear in that world.",
        "source": "T12n0374_032:0559c01_2"
    },
    {
        "source_sentence": "劫初眾生身心非器，是故如來不出其世。",
        "translation": "Because the bodies and minds of sentient beings at the beginning of the kalpa are not vessels, the Tathāgata doesn't appear in their world.",
        "source": "T12n0374_032:0559c03_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0559c04_4"
    },
    {
        "source_sentence": "如來世尊所有事業勝諸眾生，所謂種姓、眷屬、父母。",
        "translation": "The Tathāgata Bhagavān's activities are superior to those of sentient beings, which are called castes, dependents, and parents.",
        "source": "T12n0374_032:0559c04_5"
    },
    {
        "source_sentence": "以殊勝故，凡所說法人皆信受，是故如來不受化生。",
        "translation": "Because of their superiority, everyone who teaches the Dharma believes and accepts it; therefore, the Tathāgata doesn't undergo birth by transformation.",
        "source": "T12n0374_032:0559c05_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0559c06_7"
    },
    {
        "source_sentence": "一切眾生父作子業，子作父業。",
        "translation": "All sentient beings' father acts as a son, and the son acts as a father.",
        "source": "T12n0374_032:0559c06_8"
    },
    {
        "source_sentence": "如來世尊若受化身則無父母，若無父母，云何能令一切眾生作諸善業？",
        "translation": "Bhagavān, if the Tathāgata receives a transformation body, then there are no parents, and if there are no parents, how can he cause all sentient beings to perform good actions?",
        "source": "T12n0374_032:0559c07_9"
    },
    {
        "source_sentence": "是故如來不受化身。",
        "translation": "Therefore, the Tathāgata doesn't accept the transformation body.",
        "source": "T12n0374_032:0559c09_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0559c09_11"
    },
    {
        "source_sentence": "佛正法中有二種護：一者內，二者外。",
        "translation": "In the Buddha's true teaching, there are two kinds of protection: one is internal and two are external.",
        "source": "T12n0374_032:0559c09_12"
    },
    {
        "source_sentence": "內護者所謂戒禁，外護者族親眷屬。",
        "translation": "An internal protector is called a precept, and an external protector is a relative or member of the family.",
        "source": "T12n0374_032:0559c10_13"
    },
    {
        "source_sentence": "若佛如來受化身者，則無外護，是故如來不受化身。",
        "translation": "If the Buddha Tathāgata receives the transformation body, then there's no external protection; therefore, the Tathāgata doesn't accept the transformation body.",
        "source": "T12n0374_032:0559c11_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0559c12_15"
    },
    {
        "source_sentence": "有人恃姓而生憍慢，如來為欲破如是慢故，生在貴姓，不受化身。",
        "translation": "Some people rely on their castes and become conceited, but because the Tathāgata wants to break through such conceit, they're born in a noble castle and won't accept the transformation body.",
        "source": "T12n0374_032:0559c12_16"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_032:0559c14_17"
    },
    {
        "source_sentence": "如來世尊有真父母，父名淨飯，母名摩耶，而諸眾生猶言是幻，云何當受化生之身？",
        "translation": "Bhagavān, the Tathāgata has true parents whose father's name is Jīvaka and his mother's name is Māya, but sentient beings still say it's illusory, so how will they be subject to the body of transformation?",
        "source": "T12n0374_032:0559c14_18"
    },
    {
        "source_sentence": "若受化身，云何得有碎身舍利？",
        "translation": "If someone receives a transformation body, how can they have a broken body or relic?",
        "source": "T12n0374_032:0559c16_19"
    },
    {
        "source_sentence": "如來為益眾生福德故，碎其身而令供養，是故如來不受化身。",
        "translation": "Because the Tathāgata benefits sentient beings for their merit, he shatters their bodies and makes offerings to them. That's why the Tathāgata doesn't accept the transformation body.",
        "source": "T12n0374_032:0559c17_20"
    },
    {
        "source_sentence": "一切諸佛悉無化生，云何獨令我受化身？」",
        "translation": "All buddhas lack apparitional birth, so why would I be the only one to receive the transformation body?",
        "source": "T12n0374_032:0559c18_21"
    },
    {
        "source_sentence": "「如來無量功德聚，　　我今不能廣宣說，",
        "translation": "“The Buddha’s immeasurable store of virtue cannot be described in detail.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　今為眾生演一分，　　唯願哀愍聽我說。",
        "translation": "I now teach one part for sentient beings, Please have mercy on me and listen to my explanation.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　眾生無明闇中行，　　具受無邊百種苦，",
        "translation": "Sentient beings walk in the darkness of ignorance, Suffering boundless hundreds of kinds of pain.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　世尊能令遠離之，　　是故世稱為大悲。",
        "translation": "The Bhagavān can cause them to be far removed, which is why the world calls it great compassion.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　眾生往返生死繩，　　放逸迷荒無安樂，",
        "translation": "Sentient beings return to the rope of birth and death, Lost in carelessness and confusion, with no peace or comfort.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　如來能施眾安樂，　　是故永斷生死繩。",
        "translation": "The Tathāgata can bestow peace and comfort on all, so he permanently ends the rope of birth-and-death.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　佛能施眾安樂故，　　自於己樂不貪樂，",
        "translation": "Because the Buddha can bestow peace and happiness on beings, He enjoys his own happiness without covetousness.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　為諸眾生修苦行，　　是故世間興供養。",
        "translation": "For the sake of sentient beings who practice austerities, the world produces offerings.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　見他受苦身戰動，　　處在地獄不覺痛，",
        "translation": "Seeing others suffer pain, their bodies shaken and trembling, They remain in hell without feeling pain.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　為諸眾生受大苦，　　是故無勝無有量。",
        "translation": "Because sentient beings experience great suffering, it's therefore unsurpassed and immeasurable.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　如來為眾修苦行，　　成就具足滿六度，",
        "translation": "The Enlightened One practices austerities for the sake of living beings, Achieving the full accomplishment of the six transcendences.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　心處邪風不傾動，　　是故能勝世大士。",
        "translation": "The wrong wind in the mind doesn't blow, so it can overpower worldly great men.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　眾生常欲得安樂，　　而不知修安樂因，",
        "translation": "Sentient beings always want to attain well-being, Yet they do not know the cause of cultivating well-being.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　如來能教令修習，　　猶如慈父愛一子。",
        "translation": "The Tathāgata can teach and cause them to cultivate it, just like a loving father who loves one child.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　佛見眾生煩惱患，　　心苦如母念病子，",
        "translation": "Seeing sentient beings afflicted by afflictions, The Buddha’s mind is as painful as a mother Who thinks of her sick child.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　常思離病諸方便，　　是故此身繫屬他。",
        "translation": "He always thinks about ways to be free of illness; therefore, this body is bound to others.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　一切眾生行諸苦，　　其心顛倒以為樂，",
        "translation": "All sentient beings undergo all kinds of suffering, Their minds mistakenly considering it to be happiness.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　如來演說真苦樂，　　是故稱號為大悲。",
        "translation": "The Tathāgata expounds true suffering and happiness, so he's called great compassion.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　世間皆處無明[聲-耳+卵]，　　無有智嘴能破之，",
        "translation": "Everywhere in the world there is ignorance: There is no wise mouth that can destroy it.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　如來智嘴能啄壞，　　是故名為最大子。",
        "translation": "The Tathāgata's wise mouth can peck and break it; therefore, it's called the greatest child.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　不為三世所攝持，　　無有名字及假號，",
        "translation": "They are not upheld by the three time periods, And have no names or designations.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　覺知涅槃甚深義，　　是故稱佛為大覺。",
        "translation": "Knowing the profound meaning of nirvāṇa, they therefore call buddhas great enlightened.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　有河洄澓沒眾生，　　無明所盲不知出，",
        "translation": "There are rivers that swamp sentient beings, Who are blinded by ignorance and do not know how to escape.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　如來自渡能渡彼，　　是故稱佛大船師。",
        "translation": "The Tathāgata's ferry can cross over there; therefore, he's called the Buddha's great boat captain.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　能知一切諸因果，　　亦復通達盡滅道，",
        "translation": "Knowing all causes and effects, They also comprehend the path to cessation.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　常施眾生病苦藥，　　是故世稱大醫王。",
        "translation": "He always gave medicine for the ill and painful illnesses of all beings; For this reason he is called Great Healing King in the world.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　外道邪見說苦行，　　因是能得無上樂，",
        "translation": "Non-Buddhist mistaken views say that ascetic practice is the cause for attaining unsurpassed happiness.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　如來演說真樂行，　　能令眾生受快樂。",
        "translation": "The Buddha expounds the practice of true bliss, Able to cause sentient beings to experience happiness.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　如來世尊破邪道，　　開示眾生正真路，",
        "translation": "The Bhagavat, the Tathāgata, breaks down wrong paths And reveals the true path to sentient beings.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　行是道者得安樂，　　是故稱佛為導師。",
        "translation": "Those who practice this path attain well-being; therefore, they're called buddhas as guides.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　非自非他之所作，　　亦非共作無因作，",
        "translation": "They are not done by themselves, nor by others. They are also not done in common, or without cause.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　如來所說苦受事，　　勝於一切諸外道。",
        "translation": "The fact that the Tathāgata teaches about painful feelings is superior to all non-Buddhist teachings.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　成就具足戒定慧，　　亦以此法教眾生，",
        "translation": "Accomplishing perfect morality, meditation, and wisdom, They also teach sentient beings these teachings.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　以法施時無妬悋，　　是故稱佛無緣悲。",
        "translation": "Because there's no jealousy when giving the Dharma, they're called buddhas with unconditional compassion.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　無所造作無因緣，　　獲得無因無果報，",
        "translation": "Nothing is created, nothing is conditioned, and there’s no cause or condition; They attain the absence of cause and result.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　是故一切諸智者，　　稱說如來不求報。",
        "translation": "That's why all wise people praise the Tathāgata and don't seek reward.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　常共世間放逸行，　　而身不為放逸污，",
        "translation": "They always associate with worldly indulgence, Yet their bodies are not stained by indulgence.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　是故名為不思議，　　世間八法不能污。",
        "translation": "Therefore, it's called inconceivable that eight worldly dharmas can't be defiled.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　如來世尊無怨親，　　是故其心常平等，",
        "translation": "The Buddha, the World-Honored One, has no enemies or friends; Therefore his mind is always impartial.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "　我師子吼讚大悲，　　能吼無量師子吼。」◎",
        "translation": "My lion roar praises great compassion, and I can roar an immeasurable lion's roar.",
        "source": "T12n0374_032:0559c19_22"
    },
    {
        "source_sentence": "爾時師子吼菩薩合掌長跪，右膝著地，以偈讚佛：大般涅槃經卷第三十二",
        "translation": "At that moment the bodhisattva Siṃhala then knelt with his palms pressed together and, kneeling with his right knee touching the ground, praised the Buddha in verse:",
        "source": "T12n0374_032:0559c19_22"
    }
]