[
    {
        "source_sentence": "大般涅槃經卷第二十五",
        "translation": "Mahāparinirvāṇa-sūtra, Volume 25",
        "source": "T12n0374_025:0510b10_0"
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Northern Liang Tianzhushu Sanzang translated by Dharmakṣema",
        "source": "T12n0374_025:0510b12_0"
    },
    {
        "source_sentence": "光明遍照高貴德王菩薩品第十之五",
        "translation": "Tenth and Fifth Chapter of the Bodhisattva King of All-Illumining Radiance, the Most Noble and Virtuous King",
        "source": "T12n0374_025:0510b13_0"
    },
    {
        "source_sentence": "「復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_025:0510b14_0"
    },
    {
        "source_sentence": "云何菩薩摩訶薩修大涅槃微妙經典，具足成就第七功德？",
        "translation": "How did the bodhisattva Mahāsattva cultivate the subtle scripture of the great nirvāṇa and fully accomplish the seventh virtue?",
        "source": "T12n0374_025:0510b14_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0510b15_2"
    },
    {
        "source_sentence": "菩薩摩訶薩修大涅槃微妙經典，作是思惟：『何法能為大般涅槃而作近因？』",
        "translation": "The bodhisattva Mahāsattva cultivates the subtle scripture of great nirvāṇa and thinks, 'What is the way to create proximate causes for great parinirvāṇa?'",
        "source": "T12n0374_025:0510b15_3"
    },
    {
        "source_sentence": "菩薩即知有四種法，為大涅槃而作近因。",
        "translation": "The bodhisattva then knows that there are four kinds of dharmas that serve as proximate causes for great nirvāṇa.",
        "source": "T12n0374_025:0510b17_4"
    },
    {
        "source_sentence": "若言勤修一切苦行，是大涅槃近因緣者，是義不然。",
        "translation": "If someone says that diligently cultivating all ascetic practices is the proximate cause and condition for great nirvāṇa, this doesn't make sense.",
        "source": "T12n0374_025:0510b18_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_025:0510b19_6"
    },
    {
        "source_sentence": "若離四法得涅槃者，無有是處。",
        "translation": "If someone were to part with these four things and attain nirvāṇa, there wouldn't be a place for them.",
        "source": "T12n0374_025:0510b19_7"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T12n0374_025:0510b20_8"
    },
    {
        "source_sentence": "一者親近善友，二者專心聽法，三者繫念思惟，四者如法修行。",
        "translation": "One, they become intimate with good friends, two, concentrate their minds on listening to the Dharma, three, fix their thoughts and contemplations, and four, cultivate practice according to the teaching.",
        "source": "T12n0374_025:0510b20_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0510b22_10"
    },
    {
        "source_sentence": "譬如有人身遇眾病，若熱若冷、虛勞下瘧、眾邪鬼毒，到良醫所，良醫即為隨病說藥。",
        "translation": "It's like when a person's body is afflicted by various illnesses, whether feverish or cold, unremitting malaria and the poison of many evil ghosts, and they go to a good doctor who explains the medicine for their illness.",
        "source": "T12n0374_025:0510b22_11"
    },
    {
        "source_sentence": "是人至心善受醫教，隨教合藥，如法服之，服已病愈，身得安樂。",
        "translation": "That person wholeheartedly and skillfully receives the doctor’s instruction. He administers the medicine in accordance with what is prescribed, taking it according to the proper rules. After taking it, his illness is cured and he feels well.",
        "source": "T12n0374_025:0510b24_12"
    },
    {
        "source_sentence": "有病之人，喻諸菩薩，大良醫者喻善知識，良醫所說喻方等經，善受醫教喻善思惟方等經義，",
        "translation": "A sick person is a metaphor for bodhisattvas. Great physicians are a metaphor for good friends. What good physicians preach is a metaphor for the well-balanced scriptures. Being well versed in the teachings of physicians is a metaphor for reflecting well on the meaning of the well-balanced scriptures.",
        "source": "T12n0374_025:0510b25_13"
    },
    {
        "source_sentence": "隨教合藥喻如法修行三十七助道之法，病除愈者喻滅煩惱，得安樂者喻得涅槃、常、樂、我、淨。",
        "translation": "To follow the teachings, the combined medicine is a metaphor for cultivating the thirty-seven factors of the path in accordance with the teachings, and to remove illness and heal it is a metaphor for extinguishing afflictions, and attaining well-being is a metaphor for attaining nirvāṇa, permanence, bliss, self, self",
        "source": "T12n0374_025:0510b27_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0510c01_0"
    },
    {
        "source_sentence": "譬如有王，欲如法治，令民安樂，諮諸智臣，其法云何？",
        "translation": "Good man, it is analogous to a king who wishes to rule the country according to the Dharma in order to bring peace and happiness to his subjects by consulting with wise ministers. What does this mean?",
        "source": "T12n0374_025:0510c01_1"
    },
    {
        "source_sentence": "諸臣即以先王舊法而為說之。",
        "translation": "The ministers then explained the old teaching of the former king's teaching for him.",
        "source": "T12n0374_025:0510c02_2"
    },
    {
        "source_sentence": "王既聞已，至心信行，如法治國，無諸怨敵，是故令民安樂無患。",
        "translation": "Having heard this, the king wholeheartedly believed and carried out the rule of the country according to the Dharma; there were no enemies or enemies in his kingdom. Because of this he caused the people to live in peace and without trouble.",
        "source": "T12n0374_025:0510c03_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0510c04_4"
    },
    {
        "source_sentence": "王者喻諸菩薩，諸智臣者喻善知識，智臣為王所說治法喻十二部經，王既聞已至心信行，",
        "translation": "The king is a metaphor for bodhisattvas, and the wise ministers are a metaphor for good men of learning. The wise ministers taught the king twelve kinds of scriptures on the principles of governance as their parables. Having heard them, the king wholeheartedly believed and practiced them.",
        "source": "T12n0374_025:0510c04_5"
    },
    {
        "source_sentence": "喻諸菩薩繫心思惟十二部經所有深義，如法治國喻諸菩薩如法修行，所謂六波羅蜜，",
        "translation": "It's a metaphor for all the profound meanings of the twelve scriptures that bodhisattvas focus their minds on and contemplate, just as they do in the land of rule. It's a metaphor for all bodhisattvas cultivating practice according to the Dharma, which is called the six perfections.",
        "source": "T12n0374_025:0510c06_6"
    },
    {
        "source_sentence": "以能修習六波羅蜜故無諸怨敵，喻諸菩薩已離諸結煩惱惡賊，得安樂者喻諸菩薩得大涅槃常樂我淨。",
        "translation": "Because they can cultivate the six perfections, there are no enemies and opponents, which is a metaphor for bodhisattvas who have parted with the bonds of affliction and bad thieves and attain well-being, and it's a metaphor for bodhisattvas who attain great nirvāṇa and always delight in self and purity.",
        "source": "T12n0374_025:0510c08_7"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0510c12_0"
    },
    {
        "source_sentence": "譬如有人遇惡癩病，有善知識而語之言：『汝若能到須彌山邊，病可得差。",
        "translation": "It's like a person who has a bad leprosy and has good friends who say to him, 'If you can reach the side of Mount Sumeru, your illness will be cured.",
        "source": "T12n0374_025:0510c12_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_025:0510c13_2"
    },
    {
        "source_sentence": "彼有良藥，味如甘露，若能服者，病無不愈。』",
        "translation": "They have a good medicine that tastes like ambrosia, and if they can take it, their illness won't be healed.'",
        "source": "T12n0374_025:0510c14_3"
    },
    {
        "source_sentence": "其人至心信是事已，即往彼山採服甘露，其病除愈，身得安樂。",
        "translation": "Having sincerely believed this, they went to the other mountain to collect and take some sweet dew. The ill man was cured and his body became comfortable.",
        "source": "T12n0374_025:0510c15_0"
    },
    {
        "source_sentence": "惡癩病者喻諸凡夫，善知識者喻諸菩薩摩訶薩等，至心信受喻四無量心，",
        "translation": "Bad leprosy is a metaphor for worldlings, good friends are a metaphor for bodhisattvas and mahāsattvas, and sincere faith is a metaphor for the four immeasurable states of mind.",
        "source": "T12n0374_025:0510c16_1"
    },
    {
        "source_sentence": "須彌山者喻八聖道，甘露味者喻於佛性，癩病除愈喻離煩惱，得安樂者喻得涅槃常樂我淨。",
        "translation": "Mount Sumeru is a metaphor for the eight noble paths, the taste of ambrosia is a metaphor for the buddha-nature, the healing of leprosy is a metaphor for freedom from affliction, and attaining well-being is a metaphor for attaining nirvāṇa with permanence, bliss, self, and purity.",
        "source": "T12n0374_025:0510c18_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0510c20_3"
    },
    {
        "source_sentence": "譬如有人畜諸弟子聰明大智，是人晝夜常教不倦。",
        "translation": "Suppose there's a person who keeps his disciples intelligent and greatly wise, and that person always teaches them day and night without tire.",
        "source": "T12n0374_025:0510c20_4"
    },
    {
        "source_sentence": "諸菩薩等亦復如是，一切眾生有信不信，而常教化無有疲厭。",
        "translation": "Similarly, all sentient beings have faith and don't believe it, but they always teach and transform without weariness.",
        "source": "T12n0374_025:0510c21_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0510c24_0"
    },
    {
        "source_sentence": "善知識者，所謂菩薩、佛、辟支佛、聲聞、人中信方等者。",
        "translation": "A good teacher refers to bodhisattvas, buddhas, pratyekabuddhas, śrāvakas, and those among humans who believe in equality.",
        "source": "T12n0374_025:0510c24_1"
    },
    {
        "source_sentence": "何故名為善知識耶？",
        "translation": "Why is it called a good friend?",
        "source": "T12n0374_025:0510c25_2"
    },
    {
        "source_sentence": "善知識者能教眾生遠離十惡，修行十善，以是義故，名善知識。",
        "translation": "A good teacher can teach sentient beings to part with the ten bad qualities and cultivate the ten good qualities, which is why they're called a good teacher.",
        "source": "T12n0374_025:0510c25_3"
    },
    {
        "source_sentence": "復次善知識者，如法而說、如說而行。",
        "translation": "Furthermore, a good teacher is someone who speaks and acts according to the teaching in accordance with the teaching.",
        "source": "T12n0374_025:0510c27_4"
    },
    {
        "source_sentence": "云何名為如法而說、如說而行？",
        "translation": "What's called speaking according to the teaching and practicing according to the teaching?",
        "source": "T12n0374_025:0510c28_5"
    },
    {
        "source_sentence": "自不殺生，教人不殺，乃至自行正見，教人正見，若能如是則得名為真善知識。",
        "translation": "If they themselves don't kill sentient beings, teach others not to kill, or even cultivate right view on their own and teach others right view, then if they can do so, they'll be called truly good teachers.",
        "source": "T12n0374_025:0510c28_6"
    },
    {
        "source_sentence": "自修菩提，亦能教人修行菩提，以是義故，名善知識。",
        "translation": "He cultivates enlightenment himself and can also teach others to cultivate enlightenment, which is why he's called a good teacher.",
        "source": "T12n0374_025:0511a01_7"
    },
    {
        "source_sentence": "自能修行信、戒、布施、多聞、智慧，亦能教人信、戒、布施、多聞、智慧，",
        "translation": "They themselves can cultivate faith, discipline, generosity, learning, and wisdom. They can also teach others faith, discipline, generosity, learning, and wisdom.",
        "source": "T12n0374_025:0511a02_8"
    },
    {
        "source_sentence": "復以是義名善知識。",
        "translation": "Again, it's because of this meaning that they're called good teachers.",
        "source": "T12n0374_025:0511a04_9"
    },
    {
        "source_sentence": "善知識者，有善法故。",
        "translation": "A good teacher is someone who has good qualities.",
        "source": "T12n0374_025:0511a04_10"
    },
    {
        "source_sentence": "何等善法？",
        "translation": "What's a good dharma?",
        "source": "T12n0374_025:0511a05_11"
    },
    {
        "source_sentence": "所作之事不求自樂，常為眾生而求於樂，見他有過不訟其短，口常宣說純善之事，",
        "translation": "The things they do not seek their own happiness. They always seek happiness for the sake of sentient beings. Seeing faults in others, they don’t dispute their faults. They always expound words that are pure and genuinely good.",
        "source": "T12n0374_025:0511a05_12"
    },
    {
        "source_sentence": "以是義故，名善知識。",
        "translation": "Because of this meaning, they're called good teachers.",
        "source": "T12n0374_025:0511a07_13"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0511a08_0"
    },
    {
        "source_sentence": "如空中月，從初一日至十五日漸漸增長。",
        "translation": "It's like the moon in the sky that grows gradually from the first day of the month until the fifteenth day.",
        "source": "T12n0374_025:0511a08_1"
    },
    {
        "source_sentence": "善知識者亦復如是，令諸學人漸遠惡法，增長善法。",
        "translation": "Good friends are likewise, enabling students to gradually distance themselves from bad qualities and increase good qualities.",
        "source": "T12n0374_025:0511a09_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0511a10_3"
    },
    {
        "source_sentence": "若有親近善知識者，本未有戒、定、慧、解脫、解脫知見，即便有之，",
        "translation": "If someone were to associate with a good teacher, they wouldn’t have the precepts, concentration, wisdom, liberation, and knowledge and vision of liberation in the first place, and even then they would have them.",
        "source": "T12n0374_025:0511a10_4"
    },
    {
        "source_sentence": "未具足者，則得增廣。",
        "translation": "Those who aren't fully endowed will then attain increase in breadth.",
        "source": "T12n0374_025:0511a11_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0511a12_6"
    },
    {
        "source_sentence": "以其親近善知識故，因是親近，復得了達十二部經甚深之義。",
        "translation": "Because they became intimate with good friends, and because of that intimacy they also comprehended the profound meanings of the twelve kinds of scriptures.",
        "source": "T12n0374_025:0511a12_7"
    },
    {
        "source_sentence": "若能聽是十二部經甚深義者，名為聽法，聽法者則是大乘方等經典，聽方等經名真聽法，",
        "translation": "Those who are able to hear the profound meaning of these twelve kinds of scriptures are called ‘hearers of the Dharma.’ Hearing the Dharma is a scripture of the Mahayana well-balanced, and listening to well-balanced scriptures is called ‘truly hearing the Dharma.’",
        "source": "T12n0374_025:0511a13_8"
    },
    {
        "source_sentence": "真聽法者即是聽受大涅槃經，大涅槃中聞有佛性、如來畢竟不般涅槃，",
        "translation": "The true hearer of the Dharma is someone who hears and accepts the Great Nirvana scripture. In that great nirvana, they hear that there is buddha-nature and that the Tathāgata ultimately does not enter nirvana.",
        "source": "T12n0374_025:0511a16_0"
    },
    {
        "source_sentence": "是故名為專心聽法，專心聽法名八聖道，以八聖道能斷貪欲、瞋恚愚癡，",
        "translation": "That is why it is called ‘silently listening to the doctrine with concentration.’ Silently listening to the doctrine with concentration is said to be the eightfold noble path. The eightfold noble path enables one to abandon greed, hatred, folly, and ignorance.",
        "source": "T12n0374_025:0511a17_1"
    },
    {
        "source_sentence": "故名聽法。",
        "translation": "That's why it's called listening to the teaching.",
        "source": "T12n0374_025:0511a19_2"
    },
    {
        "source_sentence": "夫聽法者，名十一空，以此諸空，於一切法不作相貌。",
        "translation": "Those who listen to the teaching are called the eleven kinds of emptiness, and because of these emptinesses, they don't make appearances in all dharmas.",
        "source": "T12n0374_025:0511a19_3"
    },
    {
        "source_sentence": "夫聽法者名初發心，乃至究竟阿耨多羅三藐三菩提心。",
        "translation": "He who listens to the teaching is called the first arousal of mind, up to the ultimate mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_025:0511a20_4"
    },
    {
        "source_sentence": "以因初心得大涅槃，不以聞故得大涅槃，以修習故得大涅槃。",
        "translation": "It's because of the first attainment that great nirvāṇa is attained, not because of hearing that great nirvāṇa is attained, and because of cultivation that great nirvāṇa is attained.",
        "source": "T12n0374_025:0511a22_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0511a24_0"
    },
    {
        "source_sentence": "譬如病人，雖聞醫教及藥名字不能愈病，以服食故能得差病。",
        "translation": "It's like a patient who can't be cured of illness even though he hears the doctor's instructions or the names of medicines, and it's because he takes food that he's able to get rid of illness.",
        "source": "T12n0374_025:0511a24_1"
    },
    {
        "source_sentence": "雖聽十二深因緣法，不能得斷一切煩惱，要以繫念，善思惟故，能得除斷，",
        "translation": "Even though they hear the teaching of the twelve profound reasons, they can’t cut off all their afflictions; it’s only by being concentrated and well-contemplated that they can get rid of them.",
        "source": "T12n0374_025:0511a25_2"
    },
    {
        "source_sentence": "是名第三繫念思惟。",
        "translation": "This is called the third contemplation of being bound to mindfulness.",
        "source": "T12n0374_025:0511a27_3"
    },
    {
        "source_sentence": "復以何義，名繫念思惟？",
        "translation": "What does it mean to be mindful and reflecting?",
        "source": "T12n0374_025:0511a27_4"
    },
    {
        "source_sentence": "所謂三三昧：空三昧、無相三昧、無作三昧。",
        "translation": "The so-called three samādhis: the samādhi of emptiness, the samādhi of signlessness, and the samādhi of noncontrivance.",
        "source": "T12n0374_025:0511a28_5"
    },
    {
        "source_sentence": "空者於二十五有不見一實，無作者於二十五有不作願求，無相者無有十相，",
        "translation": "“Emptiness” does not see one reality regarding twenty-five forms of existence. There is no author who does not make a vow regarding twenty-five forms of existence. The signless one has no ten signs:",
        "source": "T12n0374_025:0511a29_6"
    },
    {
        "source_sentence": "所謂色相、聲相、香相、味相、觸相、生相、住相、滅相、男相、女相，",
        "translation": "They are the characteristic of form, the characteristic of sound, the characteristic of smell, the characteristic of taste, the characteristic of touch, the characteristic of birth, the characteristic of abiding, the characteristic of cessation, the characteristic of male and the characteristic of female.",
        "source": "T12n0374_025:0511b01_7"
    },
    {
        "source_sentence": "修習如是三三昧者，是名菩薩繫念思惟。",
        "translation": "Cultivating these three kinds of concentration is called a bodhisattva's mindfulness and contemplation.",
        "source": "T12n0374_025:0511b03_8"
    },
    {
        "source_sentence": "云何名為如法修行？",
        "translation": "What's called cultivating practice according to the teaching?",
        "source": "T12n0374_025:0511b04_9"
    },
    {
        "source_sentence": "如法修行即是修行檀波羅蜜乃至般若波羅蜜，知陰入界真實之相，亦如聲聞、緣覺、諸佛，",
        "translation": "To cultivate practice in accordance with the teachings is to cultivate the perfection of giving and even the perfection of wisdom, knowing the true characteristics of aggregates and sense-fields, just as śrāvakas, pratyekbuddhas, and buddhas do.",
        "source": "T12n0374_025:0511b04_10"
    },
    {
        "source_sentence": "同於一道而般涅槃。",
        "translation": "It's the same as parinirvāṇa with one path.",
        "source": "T12n0374_025:0511b06_11"
    },
    {
        "source_sentence": "法者即是常樂我淨、不生不老、不病不死、不飢不渴、不苦不惱、不退不沒。",
        "translation": "The Dharma is permanence, bliss, self, purity, neither arising nor old age, neither illness nor death, neither hunger nor thirst, neither pain nor vexation, and neither retreating nor sinking.",
        "source": "T12n0374_025:0511b07_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0511b08_13"
    },
    {
        "source_sentence": "解大涅槃甚深義者，則知諸佛終不畢竟入於涅槃。",
        "translation": "Those who understand the profound meaning of great nirvāṇa know that the buddhas never enter nirvāṇa after all.",
        "source": "T12n0374_025:0511b08_14"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0511b11_0"
    },
    {
        "source_sentence": "第一真實善知識者，所謂菩薩、諸佛世尊。",
        "translation": "The first true and good teacher is called the bodhisattvas and world-honored buddhas.",
        "source": "T12n0374_025:0511b11_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0511b12_2"
    },
    {
        "source_sentence": "常以三種善調御故。",
        "translation": "It's because he always uses three kinds of skillful regulation.",
        "source": "T12n0374_025:0511b12_3"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T12n0374_025:0511b12_4"
    },
    {
        "source_sentence": "一者畢竟軟語，二者畢竟呵責，三者軟語呵責。",
        "translation": "One is to speak softly after all, two are to criticize after all, and three are to criticize by speaking softly.",
        "source": "T12n0374_025:0511b13_0"
    },
    {
        "source_sentence": "以是義故，菩薩諸佛即是真實善知識也。",
        "translation": "Because of this meaning, the bodhisattvas and buddhas are truly good teachers.",
        "source": "T12n0374_025:0511b14_1"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_025:0511b15_0"
    },
    {
        "source_sentence": "佛及菩薩為大醫故，名善知識。",
        "translation": "Because the Buddha and bodhisattvas are great physicians, they're called good teachers.",
        "source": "T12n0374_025:0511b15_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0511b16_0"
    },
    {
        "source_sentence": "知病、知藥、應病授藥故。",
        "translation": "It's because he knows the illness, knows the medicine, and prescribes medicine for the illness that should be treated.",
        "source": "T12n0374_025:0511b16_1"
    },
    {
        "source_sentence": "譬如良醫，善八種術，先觀病相。",
        "translation": "It's like a good doctor who knows the eight kinds of techniques and first observes the characteristics of illness.",
        "source": "T12n0374_025:0511b16_2"
    },
    {
        "source_sentence": "相有三種。",
        "translation": "There are three kinds of characteristics.",
        "source": "T12n0374_025:0511b17_3"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T12n0374_025:0511b17_4"
    },
    {
        "source_sentence": "謂風、熱、水。",
        "translation": "It's wind, heat, and water.",
        "source": "T12n0374_025:0511b17_5"
    },
    {
        "source_sentence": "有風病者，授之蘇油。",
        "translation": "If someone has a wind condition, he'll give them soap oil.",
        "source": "T12n0374_025:0511b18_6"
    },
    {
        "source_sentence": "熱病之人，授之石蜜。",
        "translation": "For someone with a fever, he'll give them rock honey.",
        "source": "T12n0374_025:0511b18_7"
    },
    {
        "source_sentence": "水病之人，授之薑湯。",
        "translation": "For someone with water sickness, he'll give them green and red-hot soup.",
        "source": "T12n0374_025:0511b19_8"
    },
    {
        "source_sentence": "以知病根，授藥得差，故名良醫。",
        "translation": "Because he knows the root of his illness and prescribes medicine to make sure it's cured, he's called a good doctor.",
        "source": "T12n0374_025:0511b19_9"
    },
    {
        "source_sentence": "佛及菩薩亦復如是，知諸凡夫病有三種：一者貪欲，二者瞋恚，三者愚癡。",
        "translation": "Buddhas and bodhisattvas are likewise, knowing that there are three kinds of illnesses for worldlings: 1. desire, 2. anger, and 3. folly.",
        "source": "T12n0374_025:0511b20_10"
    },
    {
        "source_sentence": "貪欲病者教觀骨相，瞋恚病者觀慈悲相，愚癡病者觀十二緣相。",
        "translation": "The disease of attachment to sensual pleasure teaches the contemplation of the characteristics of bones, the disease of anger observes the characteristics of kindness and pity, and the disease of folly observes the characteristics of twelve conditions.",
        "source": "T12n0374_025:0511b21_11"
    },
    {
        "source_sentence": "以是義故，諸佛菩薩名善知識。",
        "translation": "Because of this meaning, the buddhas and bodhisattvas are called good teachers.",
        "source": "T12n0374_025:0511b23_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0511b24_13"
    },
    {
        "source_sentence": "如大船師，善渡人故，名大船師。",
        "translation": "Like a great boat captain, he's called a great boat captain because he skillfully crosses people.",
        "source": "T12n0374_025:0511b24_14"
    },
    {
        "source_sentence": "諸佛菩薩亦復如是，度諸眾生生死大海。",
        "translation": "The buddhas and bodhisattvas are likewise, liberating sentient beings from the great ocean of birth-and-death.",
        "source": "T12n0374_025:0511b25_15"
    },
    {
        "source_sentence": "以是義故，名善知識。",
        "translation": "Because of this meaning, they're called good teachers.",
        "source": "T12n0374_025:0511b26_0"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_025:0511b26_1"
    },
    {
        "source_sentence": "因佛菩薩，令諸眾生具足修得善法根本故。",
        "translation": "It's because the buddhas and bodhisattvas cause sentient beings to fully cultivate the root of good qualities.",
        "source": "T12n0374_025:0511b26_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0511b27_3"
    },
    {
        "source_sentence": "譬如雪山，乃是種種微妙上藥根本之處。",
        "translation": "It's like a snowy mountain that's the root of various subtle and superior medicines.",
        "source": "T12n0374_025:0511b27_4"
    },
    {
        "source_sentence": "佛及菩薩亦復如是，悉是一切善根本處。",
        "translation": "So it is with buddhas and bodhisattvas, who are all the roots of all goodness.",
        "source": "T12n0374_025:0511b28_5"
    },
    {
        "source_sentence": "以是義故，名善知識。",
        "translation": "Because of this meaning, they're called good teachers.",
        "source": "T12n0374_025:0511b29_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0511c01_7"
    },
    {
        "source_sentence": "雪山之中有上香藥，名曰娑呵，有人見之，得壽無量，無有病苦，雖有四毒不能中傷，",
        "translation": "In the midst of the Himalayas there is a wonderful fragrant medicine called svāhā. People who see it will attain an immeasurable life span and be free from illness and suffering. Even though they may experience four kinds of poison, they won’t be harmed.",
        "source": "T12n0374_025:0511c01_8"
    },
    {
        "source_sentence": "若有觸者增長壽命滿百二十，若有念者得宿命智。",
        "translation": "If someone touches it, their life span increases to one hundred and twenty years, and if they're mindful, they attain knowledge of past lives.",
        "source": "T12n0374_025:0511c03_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0511c04_10"
    },
    {
        "source_sentence": "藥勢力故。",
        "translation": "It's because of the power of the medicine.",
        "source": "T12n0374_025:0511c04_11"
    },
    {
        "source_sentence": "諸佛菩薩亦復如是，若有見者，即得斷除一切煩惱，雖有四魔不能干亂，",
        "translation": "And so it is with the buddhas and bodhisattvas. If there are any who see them, they will be able to eliminate all their defilements. Although there are four demons, they cannot get in trouble.",
        "source": "T12n0374_025:0511c04_12"
    },
    {
        "source_sentence": "若有觸者命不可夭、不生不死、不退不沒。",
        "translation": "If someone touches it, their life won't die, they won't be born or die, and they won't retreat or disappear.",
        "source": "T12n0374_025:0511c06_13"
    },
    {
        "source_sentence": "所謂觸者，若在佛邊聽受妙法。",
        "translation": "The so-called touch is when someone hears the marvelous teaching at the Buddha's side.",
        "source": "T12n0374_025:0511c07_14"
    },
    {
        "source_sentence": "若有念者，得阿耨多羅三藐三菩提。",
        "translation": "If someone has mindfulness, they'll attain unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_025:0511c08_15"
    },
    {
        "source_sentence": "以是義故，諸佛菩薩名善知識。",
        "translation": "Because of this meaning, the buddhas and bodhisattvas are called good teachers.",
        "source": "T12n0374_025:0511c09_16"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0511c09_17"
    },
    {
        "source_sentence": "如香山中，有阿那婆踏多池水，由是池故，有四大河，所謂恒河、辛頭、私陀、博叉。",
        "translation": "It is like the case of the Anavatapta Lake in the middle of a mountain of fragrance. Because of this lake there are four large rivers, namely, the Ganges, the Indus, the Sita, and the Pakṣa.",
        "source": "T12n0374_025:0511c09_18"
    },
    {
        "source_sentence": "世間眾生常作是言：『若有罪者，浴此四河，眾罪得滅。』",
        "translation": "Sentient beings in the world always say, 'If there's a sin, bathe these four rivers and all sins will be extinguished.'",
        "source": "T12n0374_025:0511c11_19"
    },
    {
        "source_sentence": "當知此言虛妄不實，除此已往何等為實？",
        "translation": "You should know that these words are false and not real, but what is real apart from this?",
        "source": "T12n0374_025:0511c12_20"
    },
    {
        "source_sentence": "諸佛菩薩是乃為實。",
        "translation": "The buddhas and bodhisattvas are real.",
        "source": "T12n0374_025:0511c13_21"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_025:0511c14_22"
    },
    {
        "source_sentence": "若人親近，則得滅除一切眾罪。",
        "translation": "If someone becomes intimate, they'll be able to extinguish all their sins.",
        "source": "T12n0374_025:0511c14_23"
    },
    {
        "source_sentence": "以是義故，名善知識。",
        "translation": "Because of this meaning, they're called good teachers.",
        "source": "T12n0374_025:0511c15_24"
    },
    {
        "source_sentence": "「復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_025:0511c15_25"
    },
    {
        "source_sentence": "譬如大地，所有藥木、一切叢林、百穀甘蔗、花果之屬，值天炎旱將欲枯死，",
        "translation": "It's like when all the medicinal trees, all the jungles, hundreds of grains, sweet sugarcane, and flowers and fruits on the ground are about to dry up in a heavenly drought.",
        "source": "T12n0374_025:0511c16_0"
    },
    {
        "source_sentence": "難陀龍王及婆難陀，憐愍眾生，從大海出，降澍甘雨，一切叢林、百穀草木滋潤還生。",
        "translation": "The nāga kings Nanda and Upananda, out of pity for sentient beings, emerged from the great ocean and showered sweet rain that moistened all the jungles and hundreds of grains, plants, trees, and shrubs and returned to life.",
        "source": "T12n0374_025:0511c17_1"
    },
    {
        "source_sentence": "一切眾生亦復如是，所有善根將欲消滅，諸佛菩薩生大慈悲，從智慧海降甘露雨，",
        "translation": "All sentient beings are likewise, their good roots about to be extinguished. The buddhas and enlightening beings produce great compassion and shower the rain of immortality from the ocean of knowledge.",
        "source": "T12n0374_025:0511c19_2"
    },
    {
        "source_sentence": "令諸眾生具足還得十善之法。",
        "translation": "It causes sentient beings to be fully endowed and return to the ten good qualities.",
        "source": "T12n0374_025:0511c21_3"
    },
    {
        "source_sentence": "以是義故，諸佛菩薩名善知識。",
        "translation": "Because of this meaning, the buddhas and bodhisattvas are called good teachers.",
        "source": "T12n0374_025:0511c22_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0511c22_5"
    },
    {
        "source_sentence": "譬如良醫善八種術，見諸病人不觀種姓、端正好醜、錢財寶貨，悉為治之，",
        "translation": "Good man, this is analogous to a good physician skilled in eight kinds of skillful means who sees that the ill are unable to control their castes, mannerisms, beauty, and ugliness, as well as money, possessions, and precious things.",
        "source": "T12n0374_025:0511c23_0"
    },
    {
        "source_sentence": "是故世稱為大良醫。",
        "translation": "That's why they're called great good doctors in the world.",
        "source": "T12n0374_025:0511c24_1"
    },
    {
        "source_sentence": "諸佛菩薩亦復如是，見諸眾生有煩惱病，不觀種姓、端正好醜、錢財寶貨，",
        "translation": "The buddhas and bodhisattvas are also like this: they see that all sentient beings have afflictive illnesses, but they don't look at their castes, good looks, ugliness, money, possessions, or treasures.",
        "source": "T12n0374_025:0511c25_2"
    },
    {
        "source_sentence": "生慈愍心，悉為說法，眾生聞已煩惱病除。",
        "translation": "Being compassionate, they all teach the Dharma for sentient beings, and after hearing it, their afflictions and illnesses are removed.",
        "source": "T12n0374_025:0511c26_3"
    },
    {
        "source_sentence": "以是義故，諸佛菩薩名善知識。",
        "translation": "Because of this meaning, the buddhas and bodhisattvas are called good teachers.",
        "source": "T12n0374_025:0511c27_4"
    },
    {
        "source_sentence": "以是親近善友因緣，則得近於大般涅槃。",
        "translation": "Because of these causes and conditions of being intimate with good friends, they'll attain near parinirvāṇa.",
        "source": "T12n0374_025:0511c28_5"
    },
    {
        "source_sentence": "「云何菩薩聽法因緣而得近於大般涅槃？",
        "translation": "How does a bodhisattva listen to the causes and conditions of the Dharma and attain nirvāṇa that are proximate to great parinirvāṇa?",
        "source": "T12n0374_025:0512a01_0"
    },
    {
        "source_sentence": "一切眾生以聽法故，則具信根，得信根故，樂行布施、持戒、忍辱、精進、禪定、智慧，",
        "translation": "All sentient beings, because they hear the Dharma, are endowed with the faculty of faith. Because they have attained the faculty of faith, they delight in practicing generosity, observance of precepts, patience, effort, meditation, and wisdom.",
        "source": "T12n0374_025:0512a01_1"
    },
    {
        "source_sentence": "得須陀洹果乃至佛果，是故當知得諸善法，皆是聽法因緣勢力。",
        "translation": "Attaining the fruit of stream entry and even the fruit of Buddhahood, therefore, you should know that the attainment of good qualities is the power of the causes and conditions for listening to the teachings.",
        "source": "T12n0374_025:0512a03_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0512a05_3"
    },
    {
        "source_sentence": "譬如長者惟有一子，遣至他國市易所須，示其道路通塞之處，而復誡之：『若遇婬女，",
        "translation": "Suppose an elderly man has only one child who goes to another country to buy what he needs at a marketplace, shows him the road leading through a blockage, and admonishes him again:",
        "source": "T12n0374_025:0512a05_4"
    },
    {
        "source_sentence": "慎莫親愛，若親愛者，喪身殞命及以財寶。",
        "translation": "Don't be intimate; if you are intimate, you'll lose your body, life, and possessions.",
        "source": "T12n0374_025:0512a07_5"
    },
    {
        "source_sentence": "弊惡之人，亦莫交遊。』",
        "translation": "Those who are bad and evil shouldn't travel together either.'",
        "source": "T12n0374_025:0512a08_6"
    },
    {
        "source_sentence": "其子敬順父之教勅，身心安樂，多獲寶貨。",
        "translation": "The prince obeyed his father’s instructions and found peace and comfort in body and mind, acquiring a great deal of valuable goods.",
        "source": "T12n0374_025:0512a08_7"
    },
    {
        "source_sentence": "菩薩摩訶薩為諸眾生敷演法要亦復如是，示諸眾生及四部眾諸道通塞，",
        "translation": "So it is with the great enlightening beings who expound the essentials of the Teaching for sentient beings, showing sentient beings and the fourfold assembly the obstacles to all paths.",
        "source": "T12n0374_025:0512a09_8"
    },
    {
        "source_sentence": "是諸眾生以聞法故，遠離諸惡，具足善法。",
        "translation": "Because sentient beings hear the Dharma, they're free of bad qualities and fully endowed with good qualities.",
        "source": "T12n0374_025:0512a11_9"
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this meaning, it's the cause and condition for listening to the teaching that they'll attain near parinirvāṇa.",
        "source": "T12n0374_025:0512a12_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0512a13_11"
    },
    {
        "source_sentence": "譬如明鏡照人面像，無不明了。",
        "translation": "It's like a bright mirror that illuminates the image of a person's face and doesn't understand it.",
        "source": "T12n0374_025:0512a13_12"
    },
    {
        "source_sentence": "聽法明鏡亦復如是，有人照之，則見善惡明了無翳。",
        "translation": "It's likewise with the mirror that hears the teaching and clarifies it, and when someone illuminates it, they see good and evil and clearly understand without dispute.",
        "source": "T12n0374_025:0512a14_13"
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this meaning, it's the cause and condition for listening to the teaching that they'll attain near parinirvāṇa.",
        "source": "T12n0374_025:0512a15_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0512a16_15"
    },
    {
        "source_sentence": "譬如估客，欲至寶渚，不知道路，有人示之，其人隨語，即至寶渚，多獲諸珍不可稱計。",
        "translation": "It's like an appraiser who wants to reach a jeweled island but doesn't know the path, and someone shows him the way. The man follows his words and arrives at the jeweled island, where he obtains many treasures that can't be measured.",
        "source": "T12n0374_025:0512a16_16"
    },
    {
        "source_sentence": "一切眾生亦復如是，欲至善處採取道寶，不知其路通塞之處，菩薩示之，",
        "translation": "So it is with all sentient beings who want to go to a good place to gather the treasure of the path, but they don’t know where their path leads and blocks them.",
        "source": "T12n0374_025:0512a18_17"
    },
    {
        "source_sentence": "眾生隨已得至善處，獲得無上大涅槃寶。",
        "translation": "Sentient beings follow the way to a good place and attain the unsurpassed great treasure of nirvāṇa.",
        "source": "T12n0374_025:0512a20_18"
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this meaning, it's the cause and condition for listening to the teaching that they'll attain near parinirvāṇa.",
        "source": "T12n0374_025:0512a21_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0512a21_1"
    },
    {
        "source_sentence": "譬如醉象，狂騃暴惡，多欲殺害。",
        "translation": "It's like an intoxicated elephant that's crazy and violent, often wanting to kill.",
        "source": "T12n0374_025:0512a22_2"
    },
    {
        "source_sentence": "有調象師，以大鐵鈎，鈎斲其頂，即時調順，惡心都盡。",
        "translation": "Some tamer of the elephants hooked their heads with a large iron hook and they were immediately tamed. Their evil intentions were all gone.",
        "source": "T12n0374_025:0512a22_3"
    },
    {
        "source_sentence": "一切眾生亦復如是，貪欲、瞋恚、愚癡、醉故，欲多造惡，諸菩薩等，",
        "translation": "All sentient beings are likewise. Because of their craving, hatred, folly, and intoxication, they often do evil deeds out of desire.",
        "source": "T12n0374_025:0512a24_0"
    },
    {
        "source_sentence": "以聞法鈎，斲之令住，更不得起造諸惡心。",
        "translation": "Because he hears the teaching, he hooks it and causes it to abide, and he doesn't give rise to bad thoughts again.",
        "source": "T12n0374_025:0512a25_1"
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this meaning, it's the cause and condition for listening to the teaching that they'll attain near parinirvāṇa.",
        "source": "T12n0374_025:0512a26_2"
    },
    {
        "source_sentence": "是故我於處處經中說：『我弟子專心聽受十二部經，則離五蓋、修七覺分，",
        "translation": "That is why I teach everywhere in the sutras: If my disciples concentrate their minds on listening to and accepting these twelve kinds of scriptures, they will be freed from the five hindrances and cultivate the seven factors of awakening.",
        "source": "T12n0374_025:0512a27_3"
    },
    {
        "source_sentence": "以是修習七覺分故，則得近於大般涅槃。』",
        "translation": "Because they cultivate these seven factors of awakening, they'll attain near parinirvāṇa.'",
        "source": "T12n0374_025:0512a29_0"
    },
    {
        "source_sentence": "以聽法故須陀洹人離諸恐怖。",
        "translation": "Because they listen to the teaching, stream-winners are freed from their fears.",
        "source": "T12n0374_025:0512a29_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_025:0512b01_2"
    },
    {
        "source_sentence": "須達長者身遇重病，心大愁怖，聞舍利弗說須陀洹有四功德、十種慰喻，",
        "translation": "When the householder Sudarśana was seriously ill and greatly distressed, he heard Śāriputra explain that there were four virtues and ten kinds of comforting metaphors for stream-entry.",
        "source": "T12n0374_025:0512b01_3"
    },
    {
        "source_sentence": "聞是事已，恐怖即除。",
        "translation": "After hearing this, their fears will be removed.",
        "source": "T12n0374_025:0512b03_4"
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this meaning, it's the cause and condition for listening to the teaching that they'll attain near parinirvāṇa.",
        "source": "T12n0374_025:0512b04_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0512b04_1"
    },
    {
        "source_sentence": "開法眼故。",
        "translation": "It's because it opens the Dharma eye.",
        "source": "T12n0374_025:0512b05_2"
    },
    {
        "source_sentence": "世有三人：一者無目，二者一目，三者二目。",
        "translation": "There are three kinds of people in the world: first, those without eyes; second, those with one eye; and third, those with two eyes.",
        "source": "T12n0374_025:0512b05_3"
    },
    {
        "source_sentence": "言無目者常不聞法，一目之人雖暫聞法其心不住，二目之人專心聽受如聞而行。",
        "translation": "When it's said that someone without eyes always doesn't hear the Dharma, a person with one eye who temporarily hears the Dharma doesn't stop thinking, and people with two eyes focus their minds on listening and feeling as they hear and act.",
        "source": "T12n0374_025:0512b06_4"
    },
    {
        "source_sentence": "以聽法故，得知世間如是三人。",
        "translation": "Because of listening to the teaching, they'll know that these are the three kinds of people in the world.",
        "source": "T12n0374_025:0512b08_5"
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this meaning, it's the cause and condition for listening to the teaching that they'll attain near parinirvāṇa.",
        "source": "T12n0374_025:0512b08_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0512b09_7"
    },
    {
        "source_sentence": "如我昔於拘尸那城，時舍利弗身遇病苦，我時顧命阿難比丘廣為說法。",
        "translation": "Suppose I was in the city of Kuśinagara when Śāriputra was ill and suffering, and I then ordered the monk Ānanda to teach him the Dharma extensively.",
        "source": "T12n0374_025:0512b10_0"
    },
    {
        "source_sentence": "時舍利弗聞是事已，告四弟子：『汝舁我床往至佛所，我欲聽法。』",
        "translation": "After hearing this, Śāriputra told the four disciples, 'Take my bed and go to the Buddha's place; I want to hear the teaching.'",
        "source": "T12n0374_025:0512b11_1"
    },
    {
        "source_sentence": "時四弟子即共舁往。",
        "translation": "The four disciples then went there together.",
        "source": "T12n0374_025:0512b13_2"
    },
    {
        "source_sentence": "既得聞法，聞法力故，所苦除差，身得安隱。",
        "translation": "Having heard the Dharma, through the power of hearing the Dharma, they will be freed from their sufferings and attain peace and comfort.",
        "source": "T12n0374_025:0512b13_3"
    },
    {
        "source_sentence": "以是義故，聽法因緣則得近於大般涅槃。",
        "translation": "Because of this meaning, it's the cause and condition for listening to the teaching that they'll attain near parinirvāṇa.",
        "source": "T12n0374_025:0512b14_4"
    },
    {
        "source_sentence": "「云何菩薩思惟因緣而得近於大般涅槃？",
        "translation": "How does a bodhisattva contemplate causes and conditions that will bring him close to great nirvāṇa?",
        "source": "T12n0374_025:0512b16_0"
    },
    {
        "source_sentence": "因是思惟，心得解脫。",
        "translation": "Because of this contemplation, his mind is liberated.",
        "source": "T12n0374_025:0512b16_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0512b17_2"
    },
    {
        "source_sentence": "一切眾生常為五欲之所繫縛，以思惟故悉得解脫。",
        "translation": "All sentient beings are always bound by the five desires, and because of their contemplation they attain liberation.",
        "source": "T12n0374_025:0512b17_3"
    },
    {
        "source_sentence": "以是義故，思惟因緣則得近於大般涅槃。",
        "translation": "Because of this meaning, they contemplate causes and conditions that will bring them close to great nirvāṇa.",
        "source": "T12n0374_025:0512b18_4"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_025:0512b19_5"
    },
    {
        "source_sentence": "一切眾生常為常、樂、我、淨四法之所顛倒，以思惟故，得見諸法無常、無樂、無我、無淨，",
        "translation": "All sentient beings are always deluded by the four dharmas of permanence, bliss, self, and purity. Through reflection they can see that all things are impermanent, dispassionate, selfless, selfless, and impure.",
        "source": "T12n0374_025:0512b20_0"
    },
    {
        "source_sentence": "如是見已四倒即斷。",
        "translation": "After this view, the four errors are stopped.",
        "source": "T12n0374_025:0512b21_1"
    },
    {
        "source_sentence": "以是義故，思惟因緣則得近於大般涅槃。",
        "translation": "Because of this meaning, they contemplate causes and conditions that will bring them close to great nirvāṇa.",
        "source": "T12n0374_025:0512b22_2"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_025:0512b23_3"
    },
    {
        "source_sentence": "一切諸法有四種相。",
        "translation": "All dharmas have four kinds of characteristics.",
        "source": "T12n0374_025:0512b23_4"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T12n0374_025:0512b24_5"
    },
    {
        "source_sentence": "一者生相，二者老相，三者病相，四者滅相。",
        "translation": "One is the characteristic of birth, two are the characteristic of old age, three are the characteristic of illness, and four are the characteristic of cessation.",
        "source": "T12n0374_025:0512b24_6"
    },
    {
        "source_sentence": "以是四相，能令一切凡夫眾生至須陀洹生大苦惱；",
        "translation": "Because of these four characteristics they can cause all worldlings and sentient beings up to the state of stream-entry to experience great suffering and distress.",
        "source": "T12n0374_025:0512b25_7"
    },
    {
        "source_sentence": "若能繫念善思惟者，雖遇此四，不生於苦。",
        "translation": "If someone can fix their thoughts and well contemplate, then even though they encounter these four, suffering doesn't arise.",
        "source": "T12n0374_025:0512b26_8"
    },
    {
        "source_sentence": "以是義故，思惟因緣則得近於大般涅槃。",
        "translation": "Because of this meaning, they contemplate causes and conditions that will bring them close to great nirvāṇa.",
        "source": "T12n0374_025:0512b27_9"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_025:0512b28_10"
    },
    {
        "source_sentence": "一切善法無不因於思惟而得。",
        "translation": "All good qualities are attained without fail because of contemplation.",
        "source": "T12n0374_025:0512b28_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0512b29_12"
    },
    {
        "source_sentence": "有人雖於無量無邊阿僧祇劫專心聽法，若不思惟，終不能得阿耨多羅三藐三菩提。",
        "translation": "Even though someone focuses their mind on listening to the Dharma for measureless, limitless, and incalculable eons, if they don't contemplate it, they'll never attain unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_025:0512b29_13"
    },
    {
        "source_sentence": "以是義故，思惟因緣則得近於大般涅槃。",
        "translation": "Because of this meaning, they contemplate causes and conditions that will bring them close to great nirvāṇa.",
        "source": "T12n0374_025:0512c02_14"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_025:0512c03_15"
    },
    {
        "source_sentence": "若有眾生信佛、法、僧，無有變易，而生恭敬，當知皆是繫念思惟因緣力故，",
        "translation": "If there are any sentient beings who believe in the Buddha, Dharma, and Sangha without changing or honoring them, know that it is all due to the causal power of recollection and reflection.",
        "source": "T12n0374_025:0512c03_16"
    },
    {
        "source_sentence": "因得斷除一切煩惱。",
        "translation": "It's the result of attaining the cessation of all afflictions.",
        "source": "T12n0374_025:0512c05_17"
    },
    {
        "source_sentence": "以是義故，思惟因緣則得近於大般涅槃。",
        "translation": "Because of this meaning, they contemplate causes and conditions that will bring them close to great nirvāṇa.",
        "source": "T12n0374_025:0512c05_18"
    },
    {
        "source_sentence": "「云何菩薩如法修行？",
        "translation": "How does a bodhisattva practice in accordance with the Dharma?",
        "source": "T12n0374_025:0512c07_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0512c07_1"
    },
    {
        "source_sentence": "斷諸惡法，修習善法，是名菩薩如法修行。",
        "translation": "To stop bad qualities and cultivate good qualities is called a bodhisattva's practice of following the Dharma.",
        "source": "T12n0374_025:0512c07_2"
    },
    {
        "source_sentence": "復次云何如法修行？",
        "translation": "Furthermore, how are they cultivated according to the teaching?",
        "source": "T12n0374_025:0512c08_3"
    },
    {
        "source_sentence": "見一切法空無所有，無常、無樂、無我、無淨，以是見故，寧捨身命，",
        "translation": "They see emptiness of all things as nonexistent, impermanent, unhappy, selfless, and impure. Because of these views, they would rather give up body and life.",
        "source": "T12n0374_025:0512c09_4"
    },
    {
        "source_sentence": "不犯禁戒，是名菩薩如法修行。",
        "translation": "Not violating the forbidden precepts is called a bodhisattva's cultivation of practice according to the Dharma.",
        "source": "T12n0374_025:0512c10_5"
    },
    {
        "source_sentence": "復次云何如法修行？",
        "translation": "Furthermore, how are they cultivated according to the teaching?",
        "source": "T12n0374_025:0512c11_6"
    },
    {
        "source_sentence": "修有二種：一者真實，二者不實。",
        "translation": "There are two kinds of cultivation: one, real and two, insubstantial.",
        "source": "T12n0374_025:0512c11_7"
    },
    {
        "source_sentence": "不實者，不知涅槃、佛性、如來、法、僧、實相、虛空等相，是名不實。",
        "translation": "Someone who doesn't know nirvāṇa, buddha-nature, the Tathāgata, dharmas, saṃgha, real characteristics, space, and other characteristics is called someone who doesn't really know.",
        "source": "T12n0374_025:0512c12_8"
    },
    {
        "source_sentence": "云何真實？",
        "translation": "What is reality?",
        "source": "T12n0374_025:0512c13_9"
    },
    {
        "source_sentence": "能知涅槃、佛性、如來、法、僧、實相、虛空等相，是名真實。",
        "translation": "Being able to know nirvāṇa, buddha-nature, the Tathāgata, dharmas, saṃgha, real characteristics, space, and other characteristics is called reality.",
        "source": "T12n0374_025:0512c14_0"
    },
    {
        "source_sentence": "云何名為知涅槃相？",
        "translation": "What's called knowing the characteristics of nirvāṇa?",
        "source": "T12n0374_025:0512c15_1"
    },
    {
        "source_sentence": "涅槃之相凡有八事。",
        "translation": "The marks of nirvāṇa have eight things in common.",
        "source": "T12n0374_025:0512c15_2"
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T12n0374_025:0512c16_3"
    },
    {
        "source_sentence": "一者盡、二善性、三實、四真、五常、六樂、七我、八淨，是名涅槃。",
        "translation": "The first is cessation, the second goodness, the third reality, the fourth truth, the fifth permanence, the sixth bliss, the seventh self, and the eighth purity—all these are called nirvāṇa.",
        "source": "T12n0374_025:0512c16_4"
    },
    {
        "source_sentence": "復有八事。",
        "translation": "Again, there are eight things.",
        "source": "T12n0374_025:0512c17_5"
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T12n0374_025:0512c17_6"
    },
    {
        "source_sentence": "一者解脫、二者善性、三者不實、四者不真、五者無常、六者無樂、七者無我、八者無淨。",
        "translation": "One is liberation, two are good qualities, three are unreal, four are unreal, five are impermanent, six are without happiness, seven are without self, and eight are without purity.",
        "source": "T12n0374_025:0512c18_7"
    },
    {
        "source_sentence": "復有六相：一者解脫、二者善性、三者不實、四者不真、五者安樂、六者清淨。",
        "translation": "Again, there are six characteristics: one, liberation; two, goodness; three, insubstantiality; four, insubstantiality; five, well-being; and six, purity.",
        "source": "T12n0374_025:0512c20_8"
    },
    {
        "source_sentence": "若有眾生依世俗道，斷煩惱者，如是涅槃，則有八事解脫不實。",
        "translation": "If there are sentient beings who rely on the secular path to end afflictions, then nirvāṇa like this has eight things that make liberation insubstantial.",
        "source": "T12n0374_025:0512c21_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0512c23_10"
    },
    {
        "source_sentence": "以不常故。",
        "translation": "It's because it's impermanent.",
        "source": "T12n0374_025:0512c23_11"
    },
    {
        "source_sentence": "以無常故則無有實，無有實故則無有真，雖斷煩惱，以還起故，無常、無我、無樂、無淨，",
        "translation": "Because of being impermanent, there is no real thing. And because of being insubstantial, there is no real thing. Although one has abandoned defilement, it is because they arise again and again that which is impermanent, selfless, blissless, and impure.",
        "source": "T12n0374_025:0512c23_12"
    },
    {
        "source_sentence": "是名涅槃解脫八事。",
        "translation": "These are called the eight things that make nirvāṇa and liberation possible.",
        "source": "T12n0374_025:0512c25_13"
    },
    {
        "source_sentence": "云何六相？",
        "translation": "What are the six characteristics?",
        "source": "T12n0374_025:0512c25_14"
    },
    {
        "source_sentence": "聲聞緣覺斷煩惱故，名為解脫，而未能得阿耨多羅三藐三菩提，故名為不實。",
        "translation": "Because śrāvakas and pratyekbuddhas stop afflictions, they're called liberation, but they can't attain unsurpassed, correct, and complete enlightenment, so they're called insubstantial.",
        "source": "T12n0374_025:0512c26_15"
    },
    {
        "source_sentence": "以不實故，名為不真。",
        "translation": "Because it's not real, it's called not true.",
        "source": "T12n0374_025:0512c27_16"
    },
    {
        "source_sentence": "未來之世當得阿耨多羅三藐三菩提，故名無常。",
        "translation": "In a future life, he'll attain unsurpassed, correct, and complete enlightenment, which is therefore called impermanent.",
        "source": "T12n0374_025:0512c28_17"
    },
    {
        "source_sentence": "以得無漏八聖道故，名為淨樂。",
        "translation": "Because they attain the uncontaminated eight noble paths, they're called pure and happy.",
        "source": "T12n0374_025:0512c29_18"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513a01_19"
    },
    {
        "source_sentence": "若如是知，是知涅槃，不名佛性、如來、法、僧、實相、虛空。",
        "translation": "If someone knows it this way, they know that nirvāṇa isn't called buddha-nature, tathāgata, dharmas, saṃgha, real characteristics, or space.",
        "source": "T12n0374_025:0513a01_20"
    },
    {
        "source_sentence": "「云何菩薩知於佛性？",
        "translation": "How does a bodhisattva know the buddha-nature?",
        "source": "T12n0374_025:0513a03_0"
    },
    {
        "source_sentence": "佛性有六。",
        "translation": "The buddha-nature has six.",
        "source": "T12n0374_025:0513a03_1"
    },
    {
        "source_sentence": "何等為六？",
        "translation": "What are these six?",
        "source": "T12n0374_025:0513a03_2"
    },
    {
        "source_sentence": "一常、二淨、三實、四善、五當見、六真。",
        "translation": "1. constancy, 2. purity, 3. reality, 4. goodness, 5. what should be seen, and 6. truth.",
        "source": "T12n0374_025:0513a03_3"
    },
    {
        "source_sentence": "復有七事：一者可證，餘六如上，是名菩薩知於佛性。",
        "translation": "Again, there are seven things: first, they can be realized, and the other six are as above. This is called a bodhisattva who knows the buddha-nature.",
        "source": "T12n0374_025:0513a04_4"
    },
    {
        "source_sentence": "「云何菩薩知如來相？",
        "translation": "How do bodhisattvas know the characteristics of the Tathāgata?",
        "source": "T12n0374_025:0513a06_0"
    },
    {
        "source_sentence": "如來即是覺相善相，常樂我淨、解脫、真實、示道可見，是名菩薩知如來相。",
        "translation": "The Tathāgata is the characteristic of feeling, the characteristic of goodness, permanence, bliss, self, purity, liberation, reality, and the manifestation of the path—this is called a bodhisattva who knows the characteristics of the Tathāgata.",
        "source": "T12n0374_025:0513a06_1"
    },
    {
        "source_sentence": "「云何菩薩知於法相？",
        "translation": "How does a bodhisattva know the characteristics of things?",
        "source": "T12n0374_025:0513a09_0"
    },
    {
        "source_sentence": "法者若善、不善，若常、不常，若樂、不樂，若我、無我，若淨、不淨，",
        "translation": "“Furthermore, if a doctrine is good or bad, permanent or impermanent, pleasant or unpleasant, self or selfless or pure or impure,",
        "source": "T12n0374_025:0513a09_1"
    },
    {
        "source_sentence": "若知、不知，若解、不解，若真、不真，若修、不修，若師、非師，若實、不實，",
        "translation": "If he knows or doesn’t know, understands or doesn’t understand, is true or not true, cultivates or doesn’t cultivate, is a teacher or not a teacher, and is real or not real.",
        "source": "T12n0374_025:0513a10_2"
    },
    {
        "source_sentence": "是名菩薩知於法相。",
        "translation": "This is called a bodhisattva who knows the characteristics of dharmas.",
        "source": "T12n0374_025:0513a12_3"
    },
    {
        "source_sentence": "「云何菩薩知於僧相？",
        "translation": "How do bodhisattvas know the characteristics of the saṃgha?",
        "source": "T12n0374_025:0513a13_0"
    },
    {
        "source_sentence": "僧者若常樂我淨，是弟子相；",
        "translation": "If the samgha is eternal, blissful, self and pure, this is the characteristic of a disciple.",
        "source": "T12n0374_025:0513a13_1"
    },
    {
        "source_sentence": "可見之相，善、真、不實。",
        "translation": "The visible characteristics are good, true, and insubstantial.",
        "source": "T12n0374_025:0513a14_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0513a14_3"
    },
    {
        "source_sentence": "一切聲聞得佛道故。",
        "translation": "It's because all śrāvakas attain the Buddha Way.",
        "source": "T12n0374_025:0513a14_4"
    },
    {
        "source_sentence": "何故名真？",
        "translation": "Why is it called true?",
        "source": "T12n0374_025:0513a15_5"
    },
    {
        "source_sentence": "悟法性故。",
        "translation": "It's because they awaken to the Dharma nature.",
        "source": "T12n0374_025:0513a15_6"
    },
    {
        "source_sentence": "是名菩薩知於僧相。",
        "translation": "This is called a bodhisattva who knows the characteristics of the saṃgha.",
        "source": "T12n0374_025:0513a15_7"
    },
    {
        "source_sentence": "「云何菩薩知於實相？",
        "translation": "How does a bodhisattva know the true characteristics?",
        "source": "T12n0374_025:0513a17_0"
    },
    {
        "source_sentence": "實相者，若常、無常，若樂、無樂，若我、無我，若淨、無淨，若善、不善，",
        "translation": "“True characteristic marks are permanent and impermanent, pleasant and unpleasant, self and selfless, pure and impure, wholesome and unwholesome.",
        "source": "T12n0374_025:0513a17_1"
    },
    {
        "source_sentence": "若有、若無，若涅槃、非涅槃，若解脫、非解脫，若知、不知，若斷、不斷，",
        "translation": "If there is and if there isn’t, whether nirvana or non-nirvana, liberation or non-liberation, knows and doesn’t know, stops and doesn’t stop.",
        "source": "T12n0374_025:0513a18_2"
    },
    {
        "source_sentence": "若證、不證，若修、不修，若見、不見，是名實相，非是涅槃、佛性、如來、法、僧、虛空，",
        "translation": "Whatever realizes and doesn’t realize, whatever cultivates and doesn’t cultivate, and whatever sees and doesn’t see—these are called true characteristics, not nirvana, buddha-nature, the Tathāgata, Dharma, Sangha, or space.",
        "source": "T12n0374_025:0513a20_3"
    },
    {
        "source_sentence": "是名菩薩因修如是大涅槃故，知於涅槃、佛性、如來、法、僧、實相、虛空等法，",
        "translation": "This is called a bodhisattva who, because of cultivating this kind of great nirvana, knows the buddha-nature, the Buddha-nature, the Tathāgata, the Dharma, the Sangha, reality and space.",
        "source": "T12n0374_025:0513a21_4"
    },
    {
        "source_sentence": "差別之相。",
        "translation": "It's the characteristic of distinction.",
        "source": "T12n0374_025:0513a23_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513a24_0"
    },
    {
        "source_sentence": "菩薩摩訶薩修大涅槃微妙經典，不見虛空。",
        "translation": "The bodhisattva Mahāsattva cultivates the subtle scripture of great nirvāṇa and doesn't see space.",
        "source": "T12n0374_025:0513a24_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0513a25_2"
    },
    {
        "source_sentence": "佛及菩薩雖有五眼所不見故。",
        "translation": "Although the Buddha and bodhisattvas have five eyes, they can't see them.",
        "source": "T12n0374_025:0513a25_3"
    },
    {
        "source_sentence": "惟有慧眼乃能見之，慧眼所見無法可見，故名為見。",
        "translation": "Only the eye of wisdom is able to see it, and what's seen by the eye of wisdom can't be seen, so it's called seeing.",
        "source": "T12n0374_025:0513a26_4"
    },
    {
        "source_sentence": "若是無物名虛空者，如是虛空乃名為實，以是實故則名常無，以常無故，",
        "translation": "If the absence of things were to be called space, then space would be called real space. Because it is real, it is called eternal because it is eternal and nonexistent.",
        "source": "T12n0374_025:0513a27_5"
    },
    {
        "source_sentence": "無樂、我、淨。",
        "translation": "There's no pleasure, self, or purity.",
        "source": "T12n0374_025:0513a28_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513a29_7"
    },
    {
        "source_sentence": "空名無法，無法名空，譬如世間無物名空。",
        "translation": "Emptiness is called nonexistence, and nonexistence is called emptiness, just as the absence of things in the world is called emptiness.",
        "source": "T12n0374_025:0513a29_8"
    },
    {
        "source_sentence": "虛空之性亦復如是，無所有故名為虛空。",
        "translation": "The nature of space is likewise, which is called space because it has no existence.",
        "source": "T12n0374_025:0513b01_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513b02_10"
    },
    {
        "source_sentence": "眾生之性與虛空性俱無實性。",
        "translation": "The nature of sentient beings and the nature of space are both devoid of real nature.",
        "source": "T12n0374_025:0513b02_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0513b03_12"
    },
    {
        "source_sentence": "如人說言，除滅有物然後作空，而是虛空實不可作。",
        "translation": "It's like someone who says, 'Except for the cessation of things that are existent and then create emptiness, space really can't be created.'",
        "source": "T12n0374_025:0513b03_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0513b04_14"
    },
    {
        "source_sentence": "無所有故。",
        "translation": "It's because it has no existence.",
        "source": "T12n0374_025:0513b04_15"
    },
    {
        "source_sentence": "以無有故，當知無空。",
        "translation": "Because there's nothing, you should know that there's no emptiness.",
        "source": "T12n0374_025:0513b04_16"
    },
    {
        "source_sentence": "是虛空性，若可作者則名無常，若無常者不名虛空。",
        "translation": "It's the nature of space, which is called impermanent if it can be created, and it's not called space if it's impermanent.",
        "source": "T12n0374_025:0513b05_17"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513b06_18"
    },
    {
        "source_sentence": "如世間人說言虛空無色、無礙、常不變易，是故世稱虛空之法，為第五大。",
        "translation": "Just as people in the world say that space is formless, unobstructed, eternal, and unchanging, this is why the world calls the teaching of space the fifth great dharma.",
        "source": "T12n0374_025:0513b06_19"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513b08_20"
    },
    {
        "source_sentence": "而是虛空實無有性，以光明故，故名虛空，實無虛空。",
        "translation": "Instead, space really has no nature, and because it's light, it's called space, but there really is no space.",
        "source": "T12n0374_025:0513b08_21"
    },
    {
        "source_sentence": "猶如世諦，實無其性，為眾生故，說有世諦。",
        "translation": "It's like the conventional truth that really has no nature, and for the sake of sentient beings it's said to have a conventional truth.",
        "source": "T12n0374_025:0513b09_22"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513b10_23"
    },
    {
        "source_sentence": "涅槃之體亦復如是，無有住處，直是諸佛斷煩惱處，故名涅槃，涅槃即是常、樂、我、淨，",
        "translation": "The essence of nirvana is also like this: there is no dwelling place. It is precisely the place where the Buddhas cut off defilement; therefore, it is called nirvana. Nirvana means permanence, bliss, self, and purity.",
        "source": "T12n0374_025:0513b10_24"
    },
    {
        "source_sentence": "涅槃雖樂，非是受樂，乃是上妙寂滅之樂。",
        "translation": "Although nirvāṇa is blissful, it's not the bliss of sensation but the bliss of the supreme and marvelous tranquility.",
        "source": "T12n0374_025:0513b12_25"
    },
    {
        "source_sentence": "諸佛如來有二種樂：一寂滅樂，二覺知樂。",
        "translation": "The buddha-tathāgatas have two kinds of happiness: the happiness of extinction and the happiness of awakening.",
        "source": "T12n0374_025:0513b13_26"
    },
    {
        "source_sentence": "實相之體有三種樂：一者受樂，二寂滅樂，三覺知樂。",
        "translation": "There are three kinds of happiness in the essence of reality: 1. experiencing happiness, 2. extinguishing happiness, and 3. perceiving happiness.",
        "source": "T12n0374_025:0513b14_27"
    },
    {
        "source_sentence": "佛性一樂，以當見故，得阿耨多羅三藐三菩提時，名菩提樂。」",
        "translation": "The buddha-nature is one bliss, and when he attains unsurpassed, correct, and complete enlightenment because he sees it, it's called the bliss of enlightenment.",
        "source": "T12n0374_025:0513b15_28"
    },
    {
        "source_sentence": "爾時光明遍照高貴德王菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that the Bodhisattva Mahāsattva King of Universal Illumination, the noble king of virtue, said to the Buddha, Bhagavān!",
        "source": "T12n0374_025:0513b18_0"
    },
    {
        "source_sentence": "若煩惱斷處是涅槃者，是事不然。",
        "translation": "If the sphere of cessation of defilement is nirvana, this is not right.",
        "source": "T12n0374_025:0513b19_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0513b19_2"
    },
    {
        "source_sentence": "如來往昔初成佛道至尼連禪河邊，爾時魔王與其眷屬到於佛所，而作是言：『世尊！",
        "translation": "When the Tathāgata had first attained buddhahood in the past and arrived at the bank of the Nairañjanā River, Māra King and his retinue came to the Buddha and said, 'Bhagavān!",
        "source": "T12n0374_025:0513b20_3"
    },
    {
        "source_sentence": "涅槃時到何故不入？』",
        "translation": "Why won't you enter when the time of nirvāṇa comes?'",
        "source": "T12n0374_025:0513b22_0"
    },
    {
        "source_sentence": "佛告魔王：『我今未有多聞弟子，善持禁戒，聰明利智，能化眾生，是故不入。』",
        "translation": "The Buddha told the king of Māra, 'Now, I'm not a well-versed disciple who well observes the precepts, is sharp and wise, and can transform sentient beings; therefore, I won't enter.'",
        "source": "T12n0374_025:0513b22_1"
    },
    {
        "source_sentence": "若言煩惱斷滅之處是涅槃者，諸菩薩等於無量劫已斷煩惱，何故不得稱為涅槃？",
        "translation": "If someone says that it's nirvāṇa where the afflictions are stopped, then why can't it be called nirvāṇa when bodhisattvas and so forth have stopped afflictions for measureless eons?",
        "source": "T12n0374_025:0513b24_2"
    },
    {
        "source_sentence": "俱是斷處，何緣獨稱諸佛有之，菩薩無耶？",
        "translation": "Why do the buddhas alone claim that they exist, whereas the bodhisattvas do not?",
        "source": "T12n0374_025:0513b26_0"
    },
    {
        "source_sentence": "若斷煩惱非涅槃者，何故如來昔告生名婆羅門言：『我今此身即是涅槃。』",
        "translation": "If stopping afflictions isn't nirvāṇa, why did the Tathāgata tell Śākyamuni in the past, saying, 'Now that this body of mine is nirvāṇa.'",
        "source": "T12n0374_025:0513b27_0"
    },
    {
        "source_sentence": "如來昔時在毘舍離國，魔復啟請：『如來昔以未有弟子多聞、持戒、聰明、利智、能化眾生，",
        "translation": "Formerly, when the Tathāgata was living in Vaiśālī, Māra said to him: Once again, the Tathāgata had no disciples who were well-versed, observant of the precepts, intelligent, knowledgeable, and capable of transforming sentient beings.",
        "source": "T12n0374_025:0513b28_1"
    },
    {
        "source_sentence": "不入涅槃。",
        "translation": "They won't enter nirvāṇa.",
        "source": "T12n0374_025:0513c01_2"
    },
    {
        "source_sentence": "今已具足，何故不入？』",
        "translation": "Now that they're complete, why won't they enter?'",
        "source": "T12n0374_025:0513c01_3"
    },
    {
        "source_sentence": "如來爾時即告魔言：『汝今莫生悒遲之想，却後三月吾當涅槃。』",
        "translation": "The Tathāgata then addressed Māra, saying, 'Now, don't give rise to the perception of dejection; three months from now, I will enter nirvāṇa.'",
        "source": "T12n0374_025:0513c02_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0513c03_5"
    },
    {
        "source_sentence": "若使滅度非涅槃者，何故如來自期三月當般涅槃？",
        "translation": "If cessation isn't nirvāṇa, then why does the Tathāgata have a three-month time period when he'll attain parinirvāṇa?",
        "source": "T12n0374_025:0513c03_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0513c05_7"
    },
    {
        "source_sentence": "若斷煩惱是涅槃者，如來往昔，初在道場菩提樹下斷煩惱時，便是涅槃，",
        "translation": "\\",
        "source": "T12n0374_025:0513c05_8"
    },
    {
        "source_sentence": "何故復言却後三月當般涅槃？",
        "translation": "Why does it again say that he will attain parinirvāṇa three months from now?",
        "source": "T12n0374_025:0513c06_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0513c07_10"
    },
    {
        "source_sentence": "若使爾時是涅槃者，云何方為拘尸那城諸力士等，說言後夜當般涅槃？",
        "translation": "If it were to be nirvāṇa at that point, then where would the strong men in Kuśinagara say they'll enter nirvāṇa one night later?",
        "source": "T12n0374_025:0513c07_11"
    },
    {
        "source_sentence": "如來誠實，云何出是虛妄之言？」",
        "translation": "The Tathāgata is sincere, so how can he produce such false words?",
        "source": "T12n0374_025:0513c09_12"
    },
    {
        "source_sentence": "爾時世尊告光明遍照高貴德王菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva Mahāsattva King of Universal Illumination, the noble king of virtue, and said, Good man!",
        "source": "T12n0374_025:0513c11_0"
    },
    {
        "source_sentence": "若言如來得廣長舌，當知如來於無量劫已離妄語。",
        "translation": "If someone says the Tathāgata has attained a broad and long tongue, they should know that the Tathāgata has been free of false speech for measureless eons.",
        "source": "T12n0374_025:0513c12_1"
    },
    {
        "source_sentence": "一切諸佛及諸菩薩，凡所發言，誠諦無虛。",
        "translation": "All the words uttered by all buddhas and bodhisattvas are spoken with utmost sincerity, without falsehood.",
        "source": "T12n0374_025:0513c13_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513c14_3"
    },
    {
        "source_sentence": "如汝所言，波旬往昔啟請於我入涅槃者，善男子！",
        "translation": "As you say, Pāpīyān asked me to enter nirvāṇa in the past, good man!",
        "source": "T12n0374_025:0513c14_4"
    },
    {
        "source_sentence": "而是魔王真實不知涅槃定相。",
        "translation": "Instead, the king of Māra really doesn't know the concentration aspect of nirvāṇa.",
        "source": "T12n0374_025:0513c15_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0513c16_6"
    },
    {
        "source_sentence": "波旬意謂，不化眾生，默然而住，便是涅槃。",
        "translation": "Pāpīyān's idea is that it's nirvāṇa when he doesn't transform sentient beings and remains silent.",
        "source": "T12n0374_025:0513c16_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513c17_8"
    },
    {
        "source_sentence": "譬如世人，見人不言，無所造作，便謂是人，如死無異。",
        "translation": "It's like when people in the world see a person who doesn't say anything, and they don't create anything, then they say this person is like death without any difference.",
        "source": "T12n0374_025:0513c17_9"
    },
    {
        "source_sentence": "魔王波旬亦復如是，意謂如來不化眾生，默無所說，便謂如來入般涅槃。",
        "translation": "Māra King Pāpīyān is likewise, meaning that the Tathāgata doesn't transform sentient beings and remains silent without explaining anything, so he says the Tathāgata enters parinirvāṇa.",
        "source": "T12n0374_025:0513c18_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513c20_11"
    },
    {
        "source_sentence": "如來不說佛、法、眾僧無差別相，惟說常住清淨二法無差別耳。",
        "translation": "The Tathāgata doesn't say that buddhas, dharmas, and saṃgha are without distinctive characteristics, but he says that the two dharmas of permanence and purity are without distinctive characteristics.",
        "source": "T12n0374_025:0513c20_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513c22_13"
    },
    {
        "source_sentence": "佛亦不說佛及佛性、涅槃無差別相，惟說常恒不變無差別耳。",
        "translation": "The Buddha also doesn't say that buddhas, buddha-natures, and nirvāṇa have no distinctive characteristics, but only that they are constant and unchanging without distinctions.",
        "source": "T12n0374_025:0513c22_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513c23_15"
    },
    {
        "source_sentence": "佛亦不說涅槃、實相無差別相，惟說常有實不變易無差別耳。",
        "translation": "The Buddha also doesn't say that nirvāṇa and its true characteristics have no distinctive characteristics, but says that there are always real and immutable things without distinctions.",
        "source": "T12n0374_025:0513c24_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0513c25_1"
    },
    {
        "source_sentence": "爾時我諸聲聞弟子，生於諍訟，如拘睒彌諸惡比丘，違反我教多犯禁戒，",
        "translation": "At the time, my śrāvaka disciples were in dispute, like the bad monks in Kauśāmbī who disobeyed my teaching and often violated the precepts.",
        "source": "T12n0374_025:0513c25_2"
    },
    {
        "source_sentence": "受不淨物，貪求利養。",
        "translation": "They receive impure things and covet profits.",
        "source": "T12n0374_025:0513c27_3"
    },
    {
        "source_sentence": "向諸白衣而自讚歎我得無漏，謂須陀洹果乃至我得阿羅漢果，毀辱於他，",
        "translation": "They praise themselves to the white-robed and praise themselves for attaining the uncontaminated, meaning that they disparage others who attain the fruit of stream entry or even the fruit of arhatship on their own.",
        "source": "T12n0374_025:0513c27_4"
    },
    {
        "source_sentence": "於佛、法、僧、戒律、和上，不生恭敬。",
        "translation": "They have no respect for the Buddha, Dharma, Saṃgha, precepts, vinaya, or upāsaka.",
        "source": "T12n0374_025:0513c29_5"
    },
    {
        "source_sentence": "公於我前言如是物佛所聽畜，如是等物佛不聽畜。",
        "translation": "You've said before me that such things are allowed to be stored by the Buddha, and such things are not allowed to be stored by the Buddha.",
        "source": "T12n0374_025:0514a01_6"
    },
    {
        "source_sentence": "我亦語言如是等物我實不聽，復反我言如是等物實是佛聽。",
        "translation": "I also say that such things as these are really what I won't hear, and then I say they are really what the Buddha hears.",
        "source": "T12n0374_025:0514a02_7"
    },
    {
        "source_sentence": "如是惡人不信我言，為是等故，我告波旬，汝莫悒遲，却後三月當般涅槃。",
        "translation": "Such a bad person doesn't believe my words, so for this reason I told Pāpīyān, Don't be late; three months from now, he'll attain parinirvāṇa.",
        "source": "T12n0374_025:0514a03_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514a05_9"
    },
    {
        "source_sentence": "因如是等惡比丘故，令諸聲聞、受學弟子，不見我身，不聞我法，便言如來入於涅槃。",
        "translation": "Because of these bad monks, the śrāvakas and trainees won't see me or hear my teaching, so they say that the Tathāgata enters nirvāṇa.",
        "source": "T12n0374_025:0514a05_10"
    },
    {
        "source_sentence": "惟諸菩薩能見我身，常聞我法，是故不言我入涅槃。",
        "translation": "Only bodhisattvas can see my body and always hear my teaching; therefore, they don't say that I enter nirvāṇa.",
        "source": "T12n0374_025:0514a07_11"
    },
    {
        "source_sentence": "聲聞弟子雖復發言如來涅槃，而我實不入於涅槃。",
        "translation": "Although śrāvaka disciples may still say the Tathāgata's nirvāṇa, I really won't enter nirvāṇa.",
        "source": "T12n0374_025:0514a08_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514a09_13"
    },
    {
        "source_sentence": "若我所有聲聞弟子說言如來入涅槃者，當知是人非我弟子，是魔伴黨，",
        "translation": "If any of my śrāvaka disciples were to say, “The Tathāgata has entered nirvana,” you should know that they are not my disciples. They are the companions of Māra.",
        "source": "T12n0374_025:0514a10_14"
    },
    {
        "source_sentence": "邪見惡人，非正見也。",
        "translation": "A bad person with wrong views is not a right view.",
        "source": "T12n0374_025:0514a11_15"
    },
    {
        "source_sentence": "若言如來不入涅槃，當知是人真我弟子，非魔伴黨，正見之人，非惡邪也。",
        "translation": "If someone says the Tathāgata won't enter nirvāṇa, they should know that this person is really my disciple, not Māra or any of his associates, and a righteous man who doesn't have bad views.",
        "source": "T12n0374_025:0514a12_16"
    },
    {
        "source_sentence": "「善男子，我初不見弟子之中，有言如來不化眾生，默然而住，名般涅槃也。",
        "translation": "Good man, for the first time I have never seen anyone among my disciples who says that the Tathagata does not edify living beings but remains silent. This is what I call parinirvii a.a.",
        "source": "T12n0374_025:0514a14_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514a15_1"
    },
    {
        "source_sentence": "譬如長者，多有子息，捨至他方，未得還頃，諸子並謂父已死矣。",
        "translation": "It's like an elderly man who has many children who leave home and go to another place, but before they return, the children all say their father has died.",
        "source": "T12n0374_025:0514a15_2"
    },
    {
        "source_sentence": "而是長者實亦不死，諸子顛倒，皆生死想。",
        "translation": "But the wealthy man really didn't die, and the children were all mistakenly born with the perception of birth-and-death.",
        "source": "T12n0374_025:0514a17_3"
    },
    {
        "source_sentence": "聲聞弟子亦復如是，不見我故，便謂如來已於拘尸那城娑羅雙樹間而般涅槃，",
        "translation": "So it is with the śrāvaka disciples. Because they do not see me, they say that the Tathāgata entered parinirvāṇa at the foot of two śāla trees in Kuśinagara’s city.",
        "source": "T12n0374_025:0514a18_4"
    },
    {
        "source_sentence": "而我實不般涅槃也，聲聞弟子生涅槃想。",
        "translation": "But I really don't attain parinirvāṇa, and śrāvaka disciples give rise to the perception of nirvāṇa.",
        "source": "T12n0374_025:0514a20_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514a20_1"
    },
    {
        "source_sentence": "譬如明燈，有人覆之，餘不知者，謂燈已滅，而是明焰，實亦不滅，以不知故生於滅想。",
        "translation": "It's like a bright lamp that someone covers it but doesn't know anything else, which means the lamp has ceased but the bright flame doesn't really cease, and because they don't know it, they give rise to the perception of cessation.",
        "source": "T12n0374_025:0514a21_2"
    },
    {
        "source_sentence": "聲聞弟子亦復如是，雖有慧目，以煩惱覆，令心顛倒，不見真身，而便生於滅度之想，",
        "translation": "“So it is with the disciples of the śrāvakas. Although they have the eye of wisdom, their minds are overwhelmed by afflictions and caused to be misconstrued. They do not see their true bodies but instead give rise to thoughts of extinction.",
        "source": "T12n0374_025:0514a23_0"
    },
    {
        "source_sentence": "而我實不取滅度也。",
        "translation": "I really don't grasp cessation.",
        "source": "T12n0374_025:0514a24_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514a26_0"
    },
    {
        "source_sentence": "如生盲人不見日月，以不見故，不知晝夜明闇之相，以不知故，便說無有日月之實。",
        "translation": "It's like a blind person born blind who doesn't see the sun and moon because they don't see them and doesn't know the day and night's brightness and darkness, and because they don't know it, they say there's no real sun and moon.",
        "source": "T12n0374_025:0514a26_1"
    },
    {
        "source_sentence": "實有日月，盲者不見，以不見故，生於倒想，言無日月。",
        "translation": "There really is a sun and moon, but the blind don't see them; because they don't see them, they give rise to mistaken thoughts that there are no sun and moon.",
        "source": "T12n0374_025:0514a28_2"
    },
    {
        "source_sentence": "聲聞弟子亦復如是，如彼生盲，不見如來，便謂如來入於涅槃，如來實不入於涅槃，",
        "translation": "\\",
        "source": "T12n0374_025:0514a29_3"
    },
    {
        "source_sentence": "以倒想故，生如是心。",
        "translation": "It's because of mistaken perception that such a mind arises.",
        "source": "T12n0374_025:0514b02_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514b02_5"
    },
    {
        "source_sentence": "譬如雲霧覆蔽日月，癡人便言無有日月，日月實有，直以覆故，眾生不見。",
        "translation": "It's like a cloud of mist that covers the sun and moon, and a foolish man says there's no sun and moon, but the sun and moon really exist because they are directly covered, so sentient beings won't see them.",
        "source": "T12n0374_025:0514b02_6"
    },
    {
        "source_sentence": "聲聞弟子亦復如是，以諸煩惱覆智慧眼，不見如來，便言如來入於滅度。",
        "translation": "A śrāvaka disciple is likewise, because he covers his eye of wisdom with afflictions and doesn't see the Tathāgata, so he says the Tathāgata enters nirvāṇa.",
        "source": "T12n0374_025:0514b04_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514b06_8"
    },
    {
        "source_sentence": "直是如來現嬰兒行，非滅度也。",
        "translation": "It's simply the Tathāgata's manifesting as a baby, not cessation.",
        "source": "T12n0374_025:0514b06_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514b06_10"
    },
    {
        "source_sentence": "如閻浮提，日入之時，眾生不見，以黑山障故，而是日性，實無沒入，",
        "translation": "It is like the sun in Jambudvfpa. When the sun enters it, beings do not see it; because of the obstacle of the black mountains they do not really perceive it.",
        "source": "T12n0374_025:0514b07_11"
    },
    {
        "source_sentence": "眾生不見，生沒入想。",
        "translation": "When sentient beings don't see it, they give rise to perceptions of entry and non-entry.",
        "source": "T12n0374_025:0514b08_12"
    },
    {
        "source_sentence": "聲聞弟子亦復如是，為諸煩惱山所障故，不見我身，以不見故，便於如來生滅度想，",
        "translation": "\\",
        "source": "T12n0374_025:0514b09_13"
    },
    {
        "source_sentence": "而我實不趣滅度也。",
        "translation": "I really don't aspire to nirvāṇa.",
        "source": "T12n0374_025:0514b10_14"
    },
    {
        "source_sentence": "「是故我於毘舍離國告波旬言，却後三月我當涅槃。",
        "translation": "That's why I told Pāpīyān in Vaiśālī, saying, Three months from now, I will enter nirvāṇa.",
        "source": "T12n0374_025:0514b12_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514b13_1"
    },
    {
        "source_sentence": "如來玄見迦葉菩薩却後三月善根當熟，亦見香山須跋陀羅竟安居已當至我所，",
        "translation": "The Tathāgata profoundly saw that three months after the bodhisattva Kasyapa had departed, his roots of virtue would mature. He also saw that Mount Gandhamādana and Subhadra would come to me when he had settled there.",
        "source": "T12n0374_025:0514b13_2"
    },
    {
        "source_sentence": "是故我告魔王波旬，却後三月當般涅槃。",
        "translation": "That's why I told Māra King Pāpīyān, who will attain parinirvāṇa three months from now.",
        "source": "T12n0374_025:0514b15_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514b16_4"
    },
    {
        "source_sentence": "有諸力士，其數五百，終竟三月，亦當得發阿耨多羅三藐三菩提心，我為是故，",
        "translation": "\\",
        "source": "T12n0374_025:0514b16_5"
    },
    {
        "source_sentence": "告波旬言，却後三月當般涅槃。",
        "translation": "He told Pāpīyān, Three months from now, he'll enter parinirvāṇa.",
        "source": "T12n0374_025:0514b18_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514b18_7"
    },
    {
        "source_sentence": "純陀等輩及五百梨車、菴羅果女，却後三月，無上道心善根成熟，為是等故，",
        "translation": "Three months later, the women of Cunda and the five hundred Licchavi maidens who were born in that assembly had perfected their roots of virtue.",
        "source": "T12n0374_025:0514b19_0"
    },
    {
        "source_sentence": "我告波旬，却後三月當般涅槃。",
        "translation": "I told Pāpīyān that he would enter final nirvana three months from now.",
        "source": "T12n0374_025:0514b20_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514b21_2"
    },
    {
        "source_sentence": "須那剎多親近外道尼乾子等，我為說法滿十二年，彼人邪見，不信不受，",
        "translation": "For twelve years I have taught the Dharma to non-Buddhist Nirgranthas, who hold a wrong view and do not believe or reject it.",
        "source": "T12n0374_025:0514b21_3"
    },
    {
        "source_sentence": "我知是人邪見根栽，却後三月定可斫伐，我為是故告波旬言，却後三月當般涅槃。",
        "translation": "I know that this man planted his roots of wrong views, and three months from now he will surely fall into nirvāṇa. For this reason I told Pāpīyān, “Three months from now he will enter final nirvana.” The Buddha said:",
        "source": "T12n0374_025:0514b23_4"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514b26_0"
    },
    {
        "source_sentence": "何因緣故我於往昔尼連河邊告魔波旬，我今未有多智弟子，是故不得入涅槃者？",
        "translation": "For what reason did I tell Māra Pāpīyān at the bank of the Nairañjanā River in the past that now I am not a learned disciple and therefore cannot enter nirvana?",
        "source": "T12n0374_025:0514b26_1"
    },
    {
        "source_sentence": "我時欲為五比丘等，於波羅[木*奈]轉法輪故。",
        "translation": "At the time, I wanted to turn the Dharma wheel for the sake of five monks and so forth because I wanted to turn the Dharma wheel at Benares [munai].",
        "source": "T12n0374_025:0514b28_2"
    },
    {
        "source_sentence": "復次欲為五比丘等，所謂耶奢、富那、毘摩羅闍、憍梵波提、須婆睺。",
        "translation": "Furthermore, they want to be the five monks and so forth, which are called Yaśas, Pūrṇa, Vimalakīra, Upanpati, and Suppositories.",
        "source": "T12n0374_025:0514b29_0"
    },
    {
        "source_sentence": "次復欲為郁伽長者等五十人。",
        "translation": "Next, he wants to be the elder Ugra and other fifty people.",
        "source": "T12n0374_025:0514c01_1"
    },
    {
        "source_sentence": "次復欲為摩伽陀國頻婆娑羅王等無量人天。",
        "translation": "Next, he wants to become the king of Bimbisāra in the country of Magadha and other measureless humans and gods.",
        "source": "T12n0374_025:0514c02_2"
    },
    {
        "source_sentence": "次復欲為優樓頻螺迦葉門徒五百比丘。",
        "translation": "Next, he wanted to be the five hundred monks of Uruvilvā-Kāśyapa's disciples.",
        "source": "T12n0374_025:0514c03_3"
    },
    {
        "source_sentence": "次復欲為那提迦葉、伽耶迦葉兄弟二人及五百弟子。",
        "translation": "Next, he wants to be a follower of the two brothers Nādikāśyapa and Gayā kāśyapa and five hundred disciples.",
        "source": "T12n0374_025:0514c04_4"
    },
    {
        "source_sentence": "次復欲為舍利弗、目犍連等二百五十比丘轉妙法輪。",
        "translation": "Next, he wanted to turn the wonderful Dharma wheel for two hundred and fifty monks like Śāriputra and Maudgalyāyana.",
        "source": "T12n0374_025:0514c05_5"
    },
    {
        "source_sentence": "是故我告魔王波旬不般涅槃。",
        "translation": "That's why I told Māra King Pāpīyān that he won't attain nirvāṇa.",
        "source": "T12n0374_025:0514c06_6"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514c08_0"
    },
    {
        "source_sentence": "有名涅槃非大涅槃。",
        "translation": "It's called nirvāṇa and not great nirvāṇa.",
        "source": "T12n0374_025:0514c08_1"
    },
    {
        "source_sentence": "云何涅槃非大涅槃？",
        "translation": "What is nirvana that's not great nirvāṇa?",
        "source": "T12n0374_025:0514c08_2"
    },
    {
        "source_sentence": "不見佛性而斷煩惱，是名涅槃非大涅槃。",
        "translation": "Not seeing the buddha-nature and stopping afflictions is called nirvāṇa, not great nirvāṇa.",
        "source": "T12n0374_025:0514c09_3"
    },
    {
        "source_sentence": "以不見佛性故，無常、無我，惟有樂、淨。",
        "translation": "Because they don't see the buddha-nature, there's impermanence and selflessness, but there's happiness and purity.",
        "source": "T12n0374_025:0514c10_4"
    },
    {
        "source_sentence": "以是義故，雖斷煩惱，不得名為大般涅槃也。",
        "translation": "Because of this meaning, even though they stop the afflictions, they can't be called great parinirvāṇa.",
        "source": "T12n0374_025:0514c10_5"
    },
    {
        "source_sentence": "若見佛性能斷煩惱，是則名為大涅槃也。",
        "translation": "If someone sees the Buddha's ability to end afflictions, this is called great nirvāṇa.",
        "source": "T12n0374_025:0514c11_6"
    },
    {
        "source_sentence": "以見佛性故，得名為常樂我淨，以是義故，斷除煩惱，亦得稱為大般涅槃。",
        "translation": "Because they see the buddha-nature, they're called permanence, bliss, self, self, and purity, and because of this meaning, they cut off their afflictions and can also be called great parinirvāṇa.",
        "source": "T12n0374_025:0514c12_7"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514c15_0"
    },
    {
        "source_sentence": "涅者言不，槃者言織，不織之義名為涅槃。",
        "translation": "The word nirvāṇa means not, and the word parinirvāṇa means weaving; the meaning of not weaving is called nirvāṇa.",
        "source": "T12n0374_025:0514c15_1"
    },
    {
        "source_sentence": "槃又言覆，不覆之義乃名涅槃。",
        "translation": "Nirvāṇa also means to cover, and the meaning of not covering is called nirvāṇa.",
        "source": "T12n0374_025:0514c16_2"
    },
    {
        "source_sentence": "槃言去來，不去不來乃名涅槃。",
        "translation": "The word nirvāṇa means going and coming, and it's called nirvāṇa when it doesn't go or doesn't come.",
        "source": "T12n0374_025:0514c16_3"
    },
    {
        "source_sentence": "槃者言取，不取之義乃名涅槃。",
        "translation": "Nirvāṇa refers to grasping, and the meaning of not grasping is called nirvāṇa.",
        "source": "T12n0374_025:0514c17_4"
    },
    {
        "source_sentence": "槃言不定，定無不定乃名涅槃。",
        "translation": "Nirvāṇa means indeterminate, and it's called nirvāṇa when there's neither concentration nor indeterminate.",
        "source": "T12n0374_025:0514c18_5"
    },
    {
        "source_sentence": "槃言新故，無新故義乃名涅槃。",
        "translation": "The meaning of nirvāṇa is to say that it's new because there's nothing new, and the meaning of nirvāṇa is called nirvāṇa because there's nothing new.",
        "source": "T12n0374_025:0514c19_6"
    },
    {
        "source_sentence": "槃言障礙，無障礙義乃名涅槃。",
        "translation": "When nirvāṇa is called obstruction, the meaning of nonobstruction is called nirvāṇa.",
        "source": "T12n0374_025:0514c19_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514c20_8"
    },
    {
        "source_sentence": "有憂羅迦迦毘羅弟子等言，槃者名相，無相之義乃名涅槃。",
        "translation": "Some Uraka Kapilavastu disciples and others say that nirvāṇa refers to names and marks, but the meaning of signlessness is called nirvāṇa.",
        "source": "T12n0374_025:0514c20_9"
    },
    {
        "source_sentence": "善男子，槃者言有，無有之義乃名涅槃。",
        "translation": "Good man, 'parinirvāṇa' means 'existence.' The meaning of 'nonexistence' is called nirvāṇa.",
        "source": "T12n0374_025:0514c22_0"
    },
    {
        "source_sentence": "槃名和合，無和合義乃名涅槃。",
        "translation": "Nirvāṇa is called a conjunction, but the absence of a conjunction is called nirvāṇa.",
        "source": "T12n0374_025:0514c22_1"
    },
    {
        "source_sentence": "槃者言苦，無苦之義乃名涅槃。",
        "translation": "Nirvāṇa means suffering, and the meaning of no suffering is called nirvāṇa.",
        "source": "T12n0374_025:0514c23_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514c24_3"
    },
    {
        "source_sentence": "斷煩惱者不名涅槃，不生煩惱乃名涅槃。",
        "translation": "What stops afflictions isn't called nirvāṇa, and what doesn't give rise to afflictions is called nirvāṇa.",
        "source": "T12n0374_025:0514c24_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0514c25_5"
    },
    {
        "source_sentence": "諸佛如來煩惱不起是名涅槃，所有智慧於法無礙是為如來。",
        "translation": "The buddhas and tathāgatas whose afflictions don't arise is called nirvāṇa, and the wisdom that exists without obstruction in regard to the teachings is called the Tathāgata.",
        "source": "T12n0374_025:0514c25_6"
    },
    {
        "source_sentence": "如來非是凡夫、聲聞、緣覺、菩薩，是名佛性。",
        "translation": "The Tathāgata isn't a worldling, śrāvaka, pratyekabuddha, or bodhisattva, which is called buddha-nature.",
        "source": "T12n0374_025:0514c27_0"
    },
    {
        "source_sentence": "如來身心智慧，遍滿無量無邊阿僧祇土，無所障礙，是名虛空。",
        "translation": "The Tathāgata's body, mind, and wisdom pervade measureless, limitless, and incalculable lands without obstruction, which is called space.",
        "source": "T12n0374_025:0514c27_1"
    },
    {
        "source_sentence": "如來常住無有變易，名曰實相。",
        "translation": "The Tathāgata always abides without change, which is called the true characteristic.",
        "source": "T12n0374_025:0514c29_2"
    },
    {
        "source_sentence": "以是義故，如來實不畢竟涅槃。",
        "translation": "Because of this meaning, the Tathāgata really doesn't attain final nirvāṇa.",
        "source": "T12n0374_025:0515a01_0"
    },
    {
        "source_sentence": "是名菩薩修大涅槃微妙經典，具足成就第七功德「復次善男子！",
        "translation": "This is called the seventh merit of a bodhisattva who cultivates the subtle scripture of great nirvāṇa and fully accomplishes it.",
        "source": "T12n0374_025:0515a01_1"
    },
    {
        "source_sentence": "云何菩薩摩訶薩修大涅槃微妙經典，具足成就第八功德？",
        "translation": "How does the bodhisattva Mahāsattva cultivate the subtle scripture of the great nirvāṇa, which fully accomplishes the eighth virtue?",
        "source": "T12n0374_025:0515a03_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0515a04_3"
    },
    {
        "source_sentence": "菩薩摩訶薩修大涅槃，除斷五事，遠離五事，成就六事，修習五事，守護一事，",
        "translation": "“When great enlightening beings cultivate great nirvana, they abandon five things, distance themselves from five things, accomplish six things, practice five things, and guard one thing.",
        "source": "T12n0374_025:0515a04_4"
    },
    {
        "source_sentence": "親近四事，信順一實，心善解脫，慧善解脫。",
        "translation": "Being intimate with four things, they believe in the single reality, their mind is well liberated, and their wisdom is well liberated.",
        "source": "T12n0374_025:0515a06_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0515a08_0"
    },
    {
        "source_sentence": "云何菩薩除斷五事？",
        "translation": "What are the five things that a bodhisattva removes?",
        "source": "T12n0374_025:0515a08_1"
    },
    {
        "source_sentence": "所謂五陰，色受想行識。",
        "translation": "The so-called five aggregates are form, feeling, perception, volition, and consciousness.",
        "source": "T12n0374_025:0515a08_2"
    },
    {
        "source_sentence": "所言陰者其義何謂？",
        "translation": "What does the expression aggregate mean?",
        "source": "T12n0374_025:0515a09_3"
    },
    {
        "source_sentence": "能令眾生生死相續、不離重檐，分散聚合三世所攝，求其義理了不可得，",
        "translation": "It can cause sentient beings to continue birth and death without leaving the heavy eaves, scatter and gather into the three worlds, but its meaning is ungraspable in principle.",
        "source": "T12n0374_025:0515a09_4"
    },
    {
        "source_sentence": "以是諸義，故名為陰。",
        "translation": "Because of these meanings, they're called aggregates.",
        "source": "T12n0374_025:0515a11_5"
    },
    {
        "source_sentence": "菩薩摩訶薩雖見色陰，不見其相。",
        "translation": "Although the bodhisattva Mahāsattva sees the form aggregate, he doesn't see its characteristics.",
        "source": "T12n0374_025:0515a11_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0515a12_7"
    },
    {
        "source_sentence": "於十色中推求其性悉不可得，為世界故說言為陰。",
        "translation": "They are all ungraspable in the ten forms, and they are said to be aggregates because they are worlds.",
        "source": "T12n0374_025:0515a12_8"
    },
    {
        "source_sentence": "受有百八，雖見受陰，初無受相。",
        "translation": "Although there are one hundred and eight feelings, although the aggregate of feeling is seen, at first it has no characteristic marks of feeling.",
        "source": "T12n0374_025:0515a13_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0515a14_10"
    },
    {
        "source_sentence": "受雖百八，理無定實，是故菩薩不見受陰，想行識等亦復如是。",
        "translation": "Although there are one hundred and eight feelings, the principle has no fixed reality. That is why the bodhisattva does not see the aggregate of feeling. The same applies to such [things] as conceptual thought, volition, consciousness, etc.",
        "source": "T12n0374_025:0515a14_11"
    },
    {
        "source_sentence": "菩薩摩訶薩深見五陰，是生煩惱之根本也，以是義故，方便令斷。",
        "translation": "The bodhisattva Mahāsattva deeply sees that the five aggregates are the root of the afflictions that arise, and it's because of this meaning that he skillfully causes them to be stopped.",
        "source": "T12n0374_025:0515a16_12"
    },
    {
        "source_sentence": "「云何菩薩遠離五事？",
        "translation": "How are the bodhisattvas free of five things?",
        "source": "T12n0374_025:0515a18_0"
    },
    {
        "source_sentence": "所謂五見。",
        "translation": "It's called the five views.",
        "source": "T12n0374_025:0515a18_1"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T12n0374_025:0515a18_2"
    },
    {
        "source_sentence": "一者身見，二者邊見，三者邪見，四者戒取，五者見取。",
        "translation": "They are (1) belief in a self, (2) belief in extremes, (3) wrong views, (4) adherence to precepts, and (5) adherence to particular views.",
        "source": "T12n0374_025:0515a18_3"
    },
    {
        "source_sentence": "因是五見，生六十二見，因是諸見，生死不絕，是故菩薩防之不近。",
        "translation": "Because of these five views, sixty-two views arise, and because of these views, birth and death don't end; therefore, the bodhisattva prevents them from being approached.",
        "source": "T12n0374_025:0515a20_4"
    },
    {
        "source_sentence": "「云何菩薩成就六事？",
        "translation": "How do bodhisattvas accomplish six things?",
        "source": "T12n0374_025:0515a22_0"
    },
    {
        "source_sentence": "謂六念處。",
        "translation": "These are the six abodes of mindfulness.",
        "source": "T12n0374_025:0515a22_1"
    },
    {
        "source_sentence": "何等為六？",
        "translation": "What are these six?",
        "source": "T12n0374_025:0515a22_2"
    },
    {
        "source_sentence": "一者念佛，二者念法，三者念僧，四者念天，五者念施，六者念戒，是名菩薩成就六事。",
        "translation": "One is mindfulness of the Buddha, two are mindfulness of the Dharma, three are mindfulness of the saṃgha, four are mindfulness of gods, five are mindfulness of generosity, and six are mindfulness of precepts—these are called the six things a bodhisattva accomplishes.",
        "source": "T12n0374_025:0515a22_3"
    },
    {
        "source_sentence": "「云何菩薩修習五事？",
        "translation": "How do bodhisattvas cultivate five things?",
        "source": "T12n0374_025:0515a25_0"
    },
    {
        "source_sentence": "所謂五定：一者知定，二者寂定，三者身心受快樂定，四者無樂定，五者首楞嚴定。",
        "translation": "The so-called five concentrations are: 1. the concentration of knowing, 2. the concentration of quiescence, 3. the concentration of bliss experienced in body and mind, 4. the concentration of no pleasure, and 5. the concentration of śūraṃgama.",
        "source": "T12n0374_025:0515a25_1"
    },
    {
        "source_sentence": "修習如是五種定心，則得近於大般涅槃，是故菩薩勤心修習。",
        "translation": "When cultivating these five kinds of concentrated mind, they'll attain great parinirvāṇa; therefore, the bodhisattva diligently cultivates it with a concentrated mind.",
        "source": "T12n0374_025:0515a27_2"
    },
    {
        "source_sentence": "「云何菩薩守護一事？",
        "translation": "How does a bodhisattva guard one thing?",
        "source": "T12n0374_025:0515a29_0"
    },
    {
        "source_sentence": "謂菩提心。",
        "translation": "It's the mind of enlightenment.",
        "source": "T12n0374_025:0515a29_1"
    },
    {
        "source_sentence": "菩薩摩訶薩常勤守護是菩提心，猶如世人守護一子，亦如瞎者護餘一目，",
        "translation": "Great enlightening beings always diligently guard this determination for enlightenment, just as the world protects one child, or like a blind man guarding another eye.",
        "source": "T12n0374_025:0515a29_2"
    },
    {
        "source_sentence": "如行壙野守護導者。",
        "translation": "It's like walking in the wilderness and guarding a guide.",
        "source": "T12n0374_025:0515b02_3"
    },
    {
        "source_sentence": "菩薩守護菩提之心，亦復如是，因護如是菩提心故，得阿耨多羅三藐三菩提，",
        "translation": "The enlightening being who guards the determination for enlightenment is also like this: because of protecting such a determination for enlightenment, he attains unexcelled complete perfect enlightenment.",
        "source": "T12n0374_025:0515b02_4"
    },
    {
        "source_sentence": "因得阿耨多羅三藐三菩提故，常、樂、我、淨具足而有，即是無上大般涅槃，",
        "translation": "Because they attain unexcelled complete perfect enlightenment, permanence, bliss, self, and purity exist. This is the unsurpassed great liberation.",
        "source": "T12n0374_025:0515b04_5"
    },
    {
        "source_sentence": "是故菩薩守護一法。",
        "translation": "Therefore, the bodhisattva guards one thing.",
        "source": "T12n0374_025:0515b06_6"
    },
    {
        "source_sentence": "「云何菩薩親近四事？",
        "translation": "How does a bodhisattva become intimate with four things?",
        "source": "T12n0374_025:0515b07_0"
    },
    {
        "source_sentence": "謂四無量心。",
        "translation": "These are the four immeasurable mental states.",
        "source": "T12n0374_025:0515b07_1"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T12n0374_025:0515b07_2"
    },
    {
        "source_sentence": "一者大慈，二者大悲，三者大喜，四者大捨。",
        "translation": "The first is great kindness, the second great compassion, the third great joy, and the fourth great equanimity.",
        "source": "T12n0374_025:0515b08_0"
    },
    {
        "source_sentence": "因是四心，能令無量無邊眾生發菩提心，是故菩薩繫心親近。",
        "translation": "Because these four minds can cause measureless and limitless sentient beings to give rise to the mind of enlightenment, the bodhisattva's mind is fettered and intimate.",
        "source": "T12n0374_025:0515b08_1"
    },
    {
        "source_sentence": "「云何菩薩信順一實？",
        "translation": "How does a bodhisattva believe in the single reality?",
        "source": "T12n0374_025:0515b10_2"
    },
    {
        "source_sentence": "菩薩了知一切眾生皆歸一道，一道者謂大乘也。",
        "translation": "The bodhisattva understands that all sentient beings return to one path, and one path is the great vehicle.",
        "source": "T12n0374_025:0515b10_3"
    },
    {
        "source_sentence": "諸佛菩薩為眾生故，分之為三，是故菩薩信順不逆。",
        "translation": "Because the buddhas and bodhisattvas are divided into three for the sake of sentient beings, it's because the bodhisattvas believe in and don't oppose them.",
        "source": "T12n0374_025:0515b11_4"
    },
    {
        "source_sentence": "「云何菩薩心善解脫？",
        "translation": "How is the mind of a bodhisattva well liberated?",
        "source": "T12n0374_025:0515b14_0"
    },
    {
        "source_sentence": "貪、恚、癡心永斷滅故，是名菩薩心善解脫。",
        "translation": "Because the mind of craving, anger, and delusion are permanently eliminated, this is called a bodhisattva's mind that's well liberated.",
        "source": "T12n0374_025:0515b14_1"
    },
    {
        "source_sentence": "「云何菩薩慧善解脫？",
        "translation": "What is enlightening beings’ liberation by means of knowledge?",
        "source": "T12n0374_025:0515b16_0"
    },
    {
        "source_sentence": "菩薩摩訶薩於一切法知無障礙，是名菩薩慧善解脫。",
        "translation": "The bodhisattva Mahāsattva's unobstructed knowledge of all dharmas is called the bodhisattva's good liberation of wisdom.",
        "source": "T12n0374_025:0515b16_1"
    },
    {
        "source_sentence": "因慧解脫昔所不聞而今得聞，昔所不見而今得見，昔所不到而今得到。」",
        "translation": "Because of the liberation of wisdom, they didn't hear what they hadn't heard in the past and now hear it; what they didn't see in the past but now see it; and what they didn't see in the past but now attain it.",
        "source": "T12n0374_025:0515b17_2"
    },
    {
        "source_sentence": "爾時光明遍照高貴德王菩薩摩訶薩言：「世尊！",
        "translation": "It was then that the great bodhisattva Mahāsattva King of Universal Illumination, the noble king of virtue, said, Bhagavān!",
        "source": "T12n0374_025:0515b19_3"
    },
    {
        "source_sentence": "如佛所說心解脫者，是義不然。",
        "translation": "As the Buddha has said, ‘the mind is liberated’: This does not make sense.",
        "source": "T12n0374_025:0515b20_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0515b21_5"
    },
    {
        "source_sentence": "心本無繫。",
        "translation": "The mind is originally unfettered.",
        "source": "T12n0374_025:0515b21_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_025:0515b21_7"
    },
    {
        "source_sentence": "是心本性，不為貪欲、瞋恚、愚癡諸結所繫。",
        "translation": "It's the mind's original nature, which isn't bound by the bonds of desire, anger, or folly.",
        "source": "T12n0374_025:0515b21_8"
    },
    {
        "source_sentence": "若本無繫，云何而言心善解脫？",
        "translation": "If they are originally unfettered, how can they be said to be liberation of the mind?",
        "source": "T12n0374_025:0515b22_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515b23_10"
    },
    {
        "source_sentence": "若心本性不為貪結之所繫者，何等因緣而能得繫？",
        "translation": "If the mind itself isn't bound by the bond of craving, what causes and conditions will cause it to be bound?",
        "source": "T12n0374_025:0515b23_11"
    },
    {
        "source_sentence": "如人搆角，本無乳相，雖加功力，乳無由出。",
        "translation": "It's like when a person makes horns, which originally lack the characteristic of milk, and although they apply effort, there's no way to produce milk.",
        "source": "T12n0374_025:0515b24_12"
    },
    {
        "source_sentence": "搆乳之者，不得如是，加功雖少，乳則多出。",
        "translation": "Someone who pours milk into it can't do so, and although the effort is small, much milk comes out of it.",
        "source": "T12n0374_025:0515b25_13"
    },
    {
        "source_sentence": "心亦如是，本無貪者，今云何有？",
        "translation": "The mind is also like this. If there were no craving in the past, how could there be it now?",
        "source": "T12n0374_025:0515b26_14"
    },
    {
        "source_sentence": "若本無貪，後方有者，諸佛菩薩本無貪相，今悉應有。",
        "translation": "If there were no craving in the past and only craving will arise later, then buddhas and bodhisattvas who did not have the characteristic of craving in the past would all exist now.",
        "source": "T12n0374_025:0515b27_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515b28_16"
    },
    {
        "source_sentence": "譬如石女，本無子相，雖加功力無量因緣，子不可得。",
        "translation": "It's like a stone woman who originally lacks the characteristics of a child, but even though she exerts measureless effort for measureless reasons, the child can't be obtained.",
        "source": "T12n0374_025:0515b28_17"
    },
    {
        "source_sentence": "心亦如是，本無貪相，雖造眾緣，貪無由生。",
        "translation": "So it is with the mind, which originally lacks the characteristic of craving. Although it creates all kinds of conditions, there is no reason for craving to arise.",
        "source": "T12n0374_025:0515b29_18"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515c01_19"
    },
    {
        "source_sentence": "如攢濕木，火不可得。",
        "translation": "It's like moistened wood that can't get fire.",
        "source": "T12n0374_025:0515c01_20"
    },
    {
        "source_sentence": "心亦如是，雖復攢求，貪不可得。",
        "translation": "The mind is also like this: even though it may be covetous, its cravings are ungraspable.",
        "source": "T12n0374_025:0515c02_21"
    },
    {
        "source_sentence": "云何貪結能繫於心？",
        "translation": "How are the bonds of craving able to bind the mind?",
        "source": "T12n0374_025:0515c03_22"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515c03_23"
    },
    {
        "source_sentence": "譬如押沙，油不可得。",
        "translation": "It's like holding sand and oil that can't be obtained.",
        "source": "T12n0374_025:0515c03_24"
    },
    {
        "source_sentence": "心亦如是，雖復押之，貪不可得。",
        "translation": "The mind is likewise, even though it's still attached to it, its craving won't be obtained.",
        "source": "T12n0374_025:0515c04_25"
    },
    {
        "source_sentence": "當知貪、心，二理各異，設復有之，何能污心？",
        "translation": "You should know that the two principles of craving and mind are distinct, but if they existed, how could they defile the mind?",
        "source": "T12n0374_025:0515c04_26"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515c05_27"
    },
    {
        "source_sentence": "譬如有人，安橛於空，終不得住。",
        "translation": "It's like a person who settles in emptiness and can't stay there after all.",
        "source": "T12n0374_025:0515c05_28"
    },
    {
        "source_sentence": "安貪於心，亦復如是，種種因緣，不能令貪繫縛於心。",
        "translation": "The same applies to peace and attachment regarding awarenesses: manifold reasons do not let craving be bound to awarenesses.",
        "source": "T12n0374_025:0515c06_29"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515c07_30"
    },
    {
        "source_sentence": "若心無貪名解脫者，諸佛菩薩何故不拔虛空中刺？",
        "translation": "If the mind has no craving and is called liberation, why don't the buddhas and bodhisattvas pull out the thorns in space?",
        "source": "T12n0374_025:0515c07_31"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515c09_32"
    },
    {
        "source_sentence": "過去世心，不名解脫。",
        "translation": "The minds of the past are not called liberation.",
        "source": "T12n0374_025:0515c09_33"
    },
    {
        "source_sentence": "未來世心，亦無解脫。",
        "translation": "In the mind of a future existence, there is no deliverance.",
        "source": "T12n0374_025:0515c09_34"
    },
    {
        "source_sentence": "現在世心，不與道共。",
        "translation": "The present worldly mind isn't shared with the path.",
        "source": "T12n0374_025:0515c10_35"
    },
    {
        "source_sentence": "何等世心名得解脫？",
        "translation": "What's the name for worldly mind that attains liberation?",
        "source": "T12n0374_025:0515c10_36"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515c11_37"
    },
    {
        "source_sentence": "如過去燈不能滅闇，未來世燈亦不滅闇，現在世燈復不滅闇。",
        "translation": "Just as a past lamp cannot extinguish darkness, a future lamp does not extinguish darkness, and a present lamp does not extinguish darkness.",
        "source": "T12n0374_025:0515c11_38"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0515c12_39"
    },
    {
        "source_sentence": "明之與闇，二不並故。",
        "translation": "Luminosity and darkness are not the same as one another.",
        "source": "T12n0374_025:0515c12_40"
    },
    {
        "source_sentence": "心亦如是，云何而言心得解脫？",
        "translation": "So it is with the mind. How can one say that the mind is liberated?",
        "source": "T12n0374_025:0515c13_41"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515c14_0"
    },
    {
        "source_sentence": "貪亦是有，若貪無者，見女相時，不應生貪；",
        "translation": "Also, craving is present. If craving were non-existent, no craving would arise at the moment of seeing the marks of a woman.",
        "source": "T12n0374_025:0515c14_1"
    },
    {
        "source_sentence": "若因女相，而得生者，當知是貪，真實而有，以有貪故，墮三惡道。",
        "translation": "If someone is born because of the mark of a woman, you should know that this is craving, which really exists, and it's because there's craving that they'll fall into the three bad destinies.",
        "source": "T12n0374_025:0515c15_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515c16_3"
    },
    {
        "source_sentence": "譬如有人，見畫女像，亦復生貪，以生貪故，得種種罪；",
        "translation": "Good man, this is analogous to someone who sees a woman depicted in the portrait and also develops craving. Because of that craving they commit various sins.",
        "source": "T12n0374_025:0515c16_4"
    },
    {
        "source_sentence": "若本無貪，云何見畫而生於貪？",
        "translation": "If there were no craving in the first place, how would craving arise from views and drawings?",
        "source": "T12n0374_025:0515c17_5"
    },
    {
        "source_sentence": "若心無貪，云何如來說言菩薩心得解脫？",
        "translation": "If the mind has no craving, how does the Tathāgata say that the bodhisattva's mind is liberated?",
        "source": "T12n0374_025:0515c18_6"
    },
    {
        "source_sentence": "若心有貪，云何見相然後方生，不見相者則不生也？",
        "translation": "If the mind has craving, then how can it arise only after seeing characteristics? If it doesn't see characteristics, then it won't arise.",
        "source": "T12n0374_025:0515c19_7"
    },
    {
        "source_sentence": "我今現見有惡果報，當知有貪，瞋恚、愚癡亦復如是。",
        "translation": "Now that I've seen bad consequences in the past, you should know that there's craving, and so are anger and folly.",
        "source": "T12n0374_025:0515c20_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515c21_9"
    },
    {
        "source_sentence": "譬如眾生，有身無我，而諸凡夫，橫計我想，雖有我想，不墮三惡。",
        "translation": "It's like when sentient beings have bodies and no self, but ordinary people arbitrarily conceptualize themselves as self, and even though they have self, they don't fall into the three bad qualities.",
        "source": "T12n0374_025:0515c21_10"
    },
    {
        "source_sentence": "云何貪者，於無女相而起女想，墮三惡道？",
        "translation": "What's craving that gives rise to the perception of women in the absence of female characteristics and falls into the three bad destinies?",
        "source": "T12n0374_025:0515c23_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515c24_12"
    },
    {
        "source_sentence": "譬如攢木而生於火，然是火性眾緣中無，以何因緣而得生耶？",
        "translation": "It's like when a tree grows and fire arises, but the nature of fire doesn't exist in all conditions, so what are the causes and conditions that give rise to it?",
        "source": "T12n0374_025:0515c24_13"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515c25_14"
    },
    {
        "source_sentence": "貪亦如是，色中無貪，香味觸法亦復無貪，云何於色、香、味、觸、法，",
        "translation": "The same applies to craving. There is no craving regarding matter; neither is there craving regarding smell, taste, touch, or dharmas. How then are form, odor, taste, touch and dharmas?",
        "source": "T12n0374_025:0515c26_0"
    },
    {
        "source_sentence": "生於貪耶？",
        "translation": "Does it arise from craving?",
        "source": "T12n0374_025:0515c27_1"
    },
    {
        "source_sentence": "若眾緣中悉無貪者，云何眾生獨生於貪？",
        "translation": "If there's no craving among all the conditions, then how could sentient beings give rise to craving alone?",
        "source": "T12n0374_025:0515c27_2"
    },
    {
        "source_sentence": "諸佛菩薩而不生耶？",
        "translation": "Are the buddhas and bodhisattvas unarisen?",
        "source": "T12n0374_025:0515c28_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_025:0515c29_4"
    },
    {
        "source_sentence": "心亦不定，若心定者，無有貪欲、瞋恚、愚癡。",
        "translation": "The mind is also indeterminate. When the mind is concentrated, there is no craving, hatred, or folly.",
        "source": "T12n0374_025:0515c29_5"
    },
    {
        "source_sentence": "若不定者，云何而言心得解脫？",
        "translation": "If it's indeterminate, then how can we say that the mind is liberated?",
        "source": "T12n0374_025:0516a01_6"
    },
    {
        "source_sentence": "貪亦不定，若不定者，云何因之生三惡趣？",
        "translation": "Also greed is indeterminate. If it is indeterminate, then through what cause are the three woeful courses of rebirth produced?",
        "source": "T12n0374_025:0516a01_7"
    },
    {
        "source_sentence": "貪者、境界，二俱不定。",
        "translation": "Both greed and the object are unfixed.",
        "source": "T12n0374_025:0516a02_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0516a03_9"
    },
    {
        "source_sentence": "俱緣一色，或生於貪、或生於瞋、或生愚癡，是故貪者及與境界二俱不定，",
        "translation": "Or it may give rise to greed, or to hatred, or to ignorance. That is why greed and its objects are not always the same:",
        "source": "T12n0374_025:0516a03_10"
    },
    {
        "source_sentence": "若俱不定，何故如來說言菩薩修大涅槃心得解脫？」",
        "translation": "If neither is determined, why does the Tathāgata say that a bodhisattva cultivates great nirvāṇa and attains liberation?",
        "source": "T12n0374_025:0516a05_11"
    },
    {
        "source_sentence": "◎◎爾時世尊告光明遍照高貴德王菩薩摩訶薩言：「善哉，善哉！",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva Mahāsattva King of Universal Illumination, the supremely noble king of virtue, and said, Good, good!",
        "source": "T12n0374_025:0516a06_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516a08_13"
    },
    {
        "source_sentence": "心亦不為貪結所繫、亦非不繫，非是解脫、非不解脫，非有、非無，非現在、非過去、非未來。",
        "translation": "Nor is the mind bound by the bond of desire, nor unfettered; it is neither liberation nor non-liberation, neither existent nor nonexistent, neither present nor past nor future.",
        "source": "T12n0374_025:0516a08_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0516a10_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516a10_16"
    },
    {
        "source_sentence": "一切諸法無有自性故。",
        "translation": "All dharmas lack an own-nature.",
        "source": "T12n0374_025:0516a10_17"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516a11_18"
    },
    {
        "source_sentence": "有諸外道作如是言：『因緣和合則有果生，若眾緣中本無生性而能生者，",
        "translation": "Some non-Buddhists say: When causes and conditions are combined, there is the arising of an effect.",
        "source": "T12n0374_025:0516a11_19"
    },
    {
        "source_sentence": "虛空不生亦應生果。",
        "translation": "If space doesn't arise, the result should also arise.",
        "source": "T12n0374_025:0516a13_20"
    },
    {
        "source_sentence": "虛空不生非是因故，以眾緣中本有果性，是故合集而得生果。",
        "translation": "Because space that does not arise is not the cause, it has the nature of fruit in the first place among all conditions. That is why the fruit of arising is obtained by combining and accumulating.",
        "source": "T12n0374_025:0516a13_21"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_025:0516a15_22"
    },
    {
        "source_sentence": "如提婆達欲造牆壁，則取泥土，不取彩色。",
        "translation": "It's like when Devadatta wants to build a wall, he takes mud and doesn't take color.",
        "source": "T12n0374_025:0516a15_23"
    },
    {
        "source_sentence": "欲造畫像，則集彩色，不取草木。",
        "translation": "If they want to paint an image, they gather colorful colors and don't take grass or trees.",
        "source": "T12n0374_025:0516a16_24"
    },
    {
        "source_sentence": "作衣取縷，不取泥木。",
        "translation": "He made robes to take thread and didn't take mud or wood.",
        "source": "T12n0374_025:0516a17_0"
    },
    {
        "source_sentence": "作舍取泥，不取縷線。",
        "translation": "He made a dwelling to take the mud and didn't take thread.",
        "source": "T12n0374_025:0516a17_1"
    },
    {
        "source_sentence": "以人取故，當知是中各能生果，以能生果故，當知因中必先有性，若無性者一物之中應當出生一切諸物。",
        "translation": "Because they are grasped by humans, you should know that each of these can produce its own fruit. Because it is able to produce its own fruit, you should know that among causes there must first be a nature. If there were no nature, all things would have to arise within one thing.",
        "source": "T12n0374_025:0516a17_2"
    },
    {
        "source_sentence": "若是可取、可作、可出，當知是中必先有果。",
        "translation": "If they are desirable, desirable, desirable to be done, and desirable to be done, you should know that there must first be an effect.",
        "source": "T12n0374_025:0516a20_3"
    },
    {
        "source_sentence": "若無果者，人則不取、不作、不出。",
        "translation": "If there's no fruit, then people won't take it, don't do it, and don't leave it.",
        "source": "T12n0374_025:0516a21_4"
    },
    {
        "source_sentence": "惟有虛空無取、無作，故能出生一切萬物。",
        "translation": "Only space exists without grasping or doing anything, so it can give rise to all things.",
        "source": "T12n0374_025:0516a22_0"
    },
    {
        "source_sentence": "以有因故，如尼拘陀子作尼拘陀樹，乳有醍醐，縷中有布，泥中有瓶。』",
        "translation": "Because there's a cause, it's like the Nirgrantha child making a Nirgrantha tree, where there's ghee in milk, cloth in thread, and a pot in mud.'",
        "source": "T12n0374_025:0516a22_1"
    },
    {
        "source_sentence": "善男子，一切凡夫無明所盲作是定說，色有著義，心有貪性。",
        "translation": "Good man, all the worldlings blinded by ignorance are said to be in this absorption. There is an attachment with respect to physical matter:",
        "source": "T12n0374_025:0516a24_2"
    },
    {
        "source_sentence": "復言：『凡夫心有貪性、亦解脫性，遇貪因緣心則生貪，若遇解脫心則解脫。』",
        "translation": "Again, he said, 'The mind of ordinary people has the nature of craving and the nature of liberation, and when they encounter the causes and conditions of craving, then greed arises, and if they encounter the mind of liberation, then they're liberated.'",
        "source": "T12n0374_025:0516a25_3"
    },
    {
        "source_sentence": "雖作此說，是義不然。",
        "translation": "Although this explanation is given, it does not make sense.",
        "source": "T12n0374_025:0516a27_4"
    },
    {
        "source_sentence": "有諸凡夫復作是言：『一切因中，悉無有果。",
        "translation": "Ordinary people also say, 'In all causes, there's no fruit at all.'",
        "source": "T12n0374_025:0516a27_5"
    },
    {
        "source_sentence": "因有二種：一者微細，二者麁大。",
        "translation": "There are two kinds of causes: the first is subtle, and the second is coarse.",
        "source": "T12n0374_025:0516a28_6"
    },
    {
        "source_sentence": "細即是常，麁則無常。",
        "translation": "What's subtle is permanent, and what's crude is impermanent.",
        "source": "T12n0374_025:0516a29_7"
    },
    {
        "source_sentence": "從微細因轉成麁因，從此麁因轉復成果。",
        "translation": "From the subtle cause, there proceeds the debilitating cause; from this debilitating cause, there proceeds the fruit.",
        "source": "T12n0374_025:0516b01_8"
    },
    {
        "source_sentence": "麁無常故，果亦無常。』",
        "translation": "Because anger is impermanent, the result is also impermanent.'",
        "source": "T12n0374_025:0516b02_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516b02_1"
    },
    {
        "source_sentence": "有諸凡夫復作是言：『心亦無因，貪亦無因，以時節故則生貪心。』",
        "translation": "Some worldlings also say, 'There's no cause for the mind, and there's no cause for craving; it's because of time and season that a craving arises.'",
        "source": "T12n0374_025:0516b02_2"
    },
    {
        "source_sentence": "如是等輩，以不能知心因緣故，輪迴六趣，具受生死。",
        "translation": "Such a group of people, because they can't know the causes and conditions of mind, are reborn in the six destinies, and all experience birth-and-death.",
        "source": "T12n0374_025:0516b04_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516b05_4"
    },
    {
        "source_sentence": "譬如枷犬，繫之於柱，終日繞柱，不能得離。",
        "translation": "It's like a dog in a fetter that's tied to a pillar and spends the whole day around it, but it can't get free of it.",
        "source": "T12n0374_025:0516b05_5"
    },
    {
        "source_sentence": "一切凡夫亦復如是，被無明枷繫生死柱，繞二十五有，不能得離。",
        "translation": "All ordinary people are likewise, bound by the fetters of ignorance and the pillar of birth-and-death, surrounded by twenty-five existences, unable to part with it.",
        "source": "T12n0374_025:0516b06_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516b07_7"
    },
    {
        "source_sentence": "譬如有人墮於圊廁，既得出已，而復還入。",
        "translation": "It's like a person who falls into a dirty toilet and goes back in again after emerging from it.",
        "source": "T12n0374_025:0516b08_0"
    },
    {
        "source_sentence": "如人病差，還為病因。",
        "translation": "It's like when a person's illness is healed, it's still the cause of the illness.",
        "source": "T12n0374_025:0516b08_1"
    },
    {
        "source_sentence": "如人涉路，值空曠處，既得過已，而復還來。",
        "translation": "It's like a person traveling on the road who meets an empty and uninhabited place, and after passing through it, they come back again.",
        "source": "T12n0374_025:0516b09_2"
    },
    {
        "source_sentence": "又如淨洗，還塗泥土。",
        "translation": "It's also like washing clean and returning it to the mud.",
        "source": "T12n0374_025:0516b10_3"
    },
    {
        "source_sentence": "一切凡夫亦復如是，已得解脫，無所有處。",
        "translation": "All worldlings are likewise, having attained liberation, which has no existence.",
        "source": "T12n0374_025:0516b10_4"
    },
    {
        "source_sentence": "唯未得脫非非想處，而復還來至三惡趣。",
        "translation": "Only those who haven't yet attained liberation from the state of neither perception nor non-perception will return to the three bad destinies.",
        "source": "T12n0374_025:0516b11_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0516b12_6"
    },
    {
        "source_sentence": "一切凡夫惟觀於果，不觀因緣，如犬逐塊，不逐於人。",
        "translation": "All worldlings only contemplate results and don't contemplate causes and conditions, like a dog chasing a lump that doesn't chase people.",
        "source": "T12n0374_025:0516b12_7"
    },
    {
        "source_sentence": "凡夫之人亦復如是，惟觀於果，不觀因緣，以不觀故，從非想退還三惡趣。",
        "translation": "Ordinary people are also like this, observing only the result and not the causes and conditions, and because they don't observe them, they retreat from the three bad destinies of non-thought.",
        "source": "T12n0374_025:0516b14_8"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516b16_0"
    },
    {
        "source_sentence": "諸佛菩薩終不定說，因中有果、因中無果、及有無果、非有非無果。",
        "translation": "The buddhas and bodhisattvas never say with certainty that there's an effect within a cause, no effect within a cause, neither an effect without effect, nor neither an effect nor no effect.",
        "source": "T12n0374_025:0516b16_1"
    },
    {
        "source_sentence": "若言因中先定有果、及定無果、定有無果、定非有非無果，當知是等皆魔伴黨，",
        "translation": "When stating: “In causes, there is first the fruit of samdhi and in samdhi there is no fruit; in samdhi there is no fruit; in samdhi there is no fruit; in samdhi there is neither-existence-nor-nonexistence-of-fruit”; it should be known that these are all companions of Mara.",
        "source": "T12n0374_025:0516b17_2"
    },
    {
        "source_sentence": "繫屬於魔，即是愛人；",
        "translation": "They belong to the realm of Māra. That is, they are cravingful people.",
        "source": "T12n0374_025:0516b19_3"
    },
    {
        "source_sentence": "如是愛人，不能永斷生死繫縛，不知心相及以貪相。",
        "translation": "Such a craving person can't permanently end the fetters of birth-and-death and doesn't know the characteristics of mind or the characteristics of craving.",
        "source": "T12n0374_025:0516b19_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516b21_5"
    },
    {
        "source_sentence": "諸佛菩薩顯示中道。",
        "translation": "The buddhas and bodhisattvas show the middle way.",
        "source": "T12n0374_025:0516b21_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0516b21_7"
    },
    {
        "source_sentence": "雖說諸法非有非無，而不決定。",
        "translation": "Even though it is said that all factors are neither existent nor nonexistent, they are not determined.",
        "source": "T12n0374_025:0516b21_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_025:0516b22_9"
    },
    {
        "source_sentence": "因眼、因色、因明、因心、因念，識則得生，是識決定不在眼中、色中、明中、心中、念中，",
        "translation": "Consciousness can arise by reason of the eye, by reason of form, by reason of form, by reason of light, by reason of mind, and by reason of thought. This consciousness is not necessarily present in the eye, in form, in the intellect, in the mind, or in thought.",
        "source": "T12n0374_025:0516b22_10"
    },
    {
        "source_sentence": "亦非中間、非有、非無，從緣生故，名之為有，無自性故名之為無，是故如來說言諸法非有、非無。",
        "translation": "Neither is it intermediate, neither existent nor nonexistent; because it arises from conditions, it is called existence; because it has no self-nature, it is called nonexistence. That is why the Tathāgata teaches that all dharmas are neither existent nor nonexistent.",
        "source": "T12n0374_025:0516b24_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516b26_12"
    },
    {
        "source_sentence": "諸佛菩薩終不定說心有淨性及不淨性，淨不淨性，心無住處故。",
        "translation": "The buddhas and bodhisattvas never say with certainty that mind has the nature of purity and the nature of impurity, because there is no dwelling place for it.",
        "source": "T12n0374_025:0516b26_13"
    },
    {
        "source_sentence": "從緣生貪，故說非無，本無貪性，故說非有。",
        "translation": "Because craving arises from conditions, it is said not to be nonexistent. Because there is no nature of craving in the first place, it is said not to exist.",
        "source": "T12n0374_025:0516b28_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516b29_15"
    },
    {
        "source_sentence": "從因緣故心則生貪，從因緣故心則解脫。",
        "translation": "Because of causes and conditions, the mind becomes greedy; because of causes and conditions, the mind is liberated.",
        "source": "T12n0374_025:0516b29_16"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516c01_17"
    },
    {
        "source_sentence": "因緣有二：一者隨於生死，二者隨大涅槃。",
        "translation": "There are two kinds of causes and conditions: one, following birth and death, and two, following the great nirvāṇa.",
        "source": "T12n0374_025:0516c01_18"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516c03_0"
    },
    {
        "source_sentence": "有因緣故，心共貪生共貪俱滅，有共貪生不共貪滅，有不共貪生共貪俱滅，",
        "translation": "Because there are reasons why craving arises together with awarenesses and disappears together with craving; craving arises together with craving, and neither does not arise together with craving.",
        "source": "T12n0374_025:0516c03_1"
    },
    {
        "source_sentence": "有不共貪生不共貪滅。",
        "translation": "What's not shared with craving arises and what's not shared with craving ceases.",
        "source": "T12n0374_025:0516c04_2"
    },
    {
        "source_sentence": "「云何心共貪生共貪俱滅？",
        "translation": "What is the mind that arises together with craving and ceases together with craving?",
        "source": "T12n0374_025:0516c06_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516c06_1"
    },
    {
        "source_sentence": "若有凡夫未斷貪心、修習貪心，如是之人，心共貪生心共貪滅。",
        "translation": "If there are worldlings who haven't yet stopped the mind of craving and cultivated the mind of craving, such people will be born with craving in their mind and cease with craving in their mind.",
        "source": "T12n0374_025:0516c06_2"
    },
    {
        "source_sentence": "一切眾生不斷貪心，心共貪生心共貪滅。",
        "translation": "All sentient beings don't stop craving their minds, and the mind shared with craving arises and the mind shared with craving ceases.",
        "source": "T12n0374_025:0516c08_3"
    },
    {
        "source_sentence": "如欲界眾生，一切皆有初地味禪，若修、不修，常得成就，遇因緣故，",
        "translation": "All sentient beings in the realm of sexual passion all have the first meditative absorption with relishing as their object. If one cultivates it or does not cultivate it, they will always attain enlightenment:",
        "source": "T12n0374_025:0516c09_4"
    },
    {
        "source_sentence": "即便得之，言因緣者謂火災也。",
        "translation": "Even then they'll attain it, which is called a fire disaster when it's called a cause.",
        "source": "T12n0374_025:0516c10_5"
    },
    {
        "source_sentence": "一切凡夫亦復如是，若修、不修，心共貪生，心共貪滅。",
        "translation": "All worldlings are also like this: when they cultivate it or do not cultivate it, craving arises together with mind and cessation of craving is associated with mind.",
        "source": "T12n0374_025:0516c11_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_025:0516c12_7"
    },
    {
        "source_sentence": "不斷貪故。",
        "translation": "It's because they don't stop craving.",
        "source": "T12n0374_025:0516c12_8"
    },
    {
        "source_sentence": "「云何心共貪生不共貪滅？",
        "translation": "What's the mind that produces co-craving and doesn't cease co-craving?",
        "source": "T12n0374_025:0516c13_0"
    },
    {
        "source_sentence": "聲聞弟子有因緣故，生於貪心，畏貪心故，修白骨觀，是名心共貪生不共貪滅。",
        "translation": "A śrāvaka disciple who has causes and conditions that give rise to the mind of desire and fears the mind of desire and cultivates the contemplation of white bones, which is called the cessation of co-craving in common with mind and co-craving in common with mind.",
        "source": "T12n0374_025:0516c13_1"
    },
    {
        "source_sentence": "復有心共貪生不共貪滅，如聲聞人未證四果，有因緣故生於貪心，證四果時貪心得滅，",
        "translation": "Good man, there are also states of mind in which covetousness arose together with awarenesses and disappeared without covetousness. Just as the sravakas do not realize the four fruits yet, but have causes and conditions that give rise to thoughts of greed. At the moment they realize the four fruits, their thought covetousness disappears.",
        "source": "T12n0374_025:0516c15_2"
    },
    {
        "source_sentence": "是名心共貪生不共貪滅。",
        "translation": "This is called the cessation of craving that arises in common with mind and not in common with craving.",
        "source": "T12n0374_025:0516c17_3"
    },
    {
        "source_sentence": "菩薩摩訶薩得不動地時，心共貪生不共貪滅。",
        "translation": "When the bodhisattva Mahāsattva attains the ground of immovability, his mind shares craving with co-arising and doesn't share the cessation of craving.",
        "source": "T12n0374_025:0516c17_4"
    },
    {
        "source_sentence": "「云何不共貪生共貪俱滅？",
        "translation": "What's the mutual cessation of not-common craving that arises and common craving that ceases?",
        "source": "T12n0374_025:0516c19_0"
    },
    {
        "source_sentence": "若菩薩摩訶薩斷貪心已，為眾生故示現有貪，以示現故，能令無量無邊眾生諮受善法，",
        "translation": "“If great enlightening beings, having abandoned craving, show it to sentient beings for the sake of them; and because they show it, they can cause measureless and limitless sentient beings to consult and receive the Teaching.",
        "source": "T12n0374_025:0516c19_1"
    },
    {
        "source_sentence": "具足成就，是名不共貪生共貪俱滅。",
        "translation": "Being fully accomplished, it's called not co-arising with craving and co-ceasing with craving.",
        "source": "T12n0374_025:0516c21_2"
    },
    {
        "source_sentence": "「云何不共貪生不共貪滅？",
        "translation": "What is the arising of craving that is not common to all and the cessation of craving that is not common to all?",
        "source": "T12n0374_025:0516c23_0"
    },
    {
        "source_sentence": "謂阿羅漢、緣覺、諸佛，除不動地其餘菩薩，是名不共貪生不共貪滅。",
        "translation": "It means that arhats, pratyekabuddhas, and buddhas, except for the other bodhisattvas in the immovable stage, are called not co-arising from covetousness and not co-ceasing from covetousness.",
        "source": "T12n0374_025:0516c23_1"
    },
    {
        "source_sentence": "以是義故，諸佛菩薩不決定說心性本淨、性本不淨。",
        "translation": "Because of this meaning, the buddhas and bodhisattvas don't necessarily say that the mind is inherently pure in nature and inherently impure in nature.",
        "source": "T12n0374_025:0516c25_2"
    },
    {
        "source_sentence": "「善男子，是心不與貪結和合，亦復不與瞋癡和合。",
        "translation": "“Good son, this mind isn’t combined with the bond of craving and neither is it combined with the bond of anger or delusion.",
        "source": "T12n0374_025:0516c26_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0516c27_4"
    },
    {
        "source_sentence": "譬如日月，雖為烟塵、雲霧及羅睺羅之所覆蔽，以是因緣令諸眾生不能得見，",
        "translation": "It is as if the sun and moon were to be obscured by smoke, dust, clouds, mist, or flames. Because of these causes and conditions living beings would not be able to see them.",
        "source": "T12n0374_025:0516c27_5"
    },
    {
        "source_sentence": "雖不可見日月之性，終不與彼五翳和合。",
        "translation": "Even though it doesn't show the nature of the sun and moon, it never combines with those five patches.",
        "source": "T12n0374_025:0516c29_6"
    },
    {
        "source_sentence": "心亦如是，以因緣故，生於貪結。",
        "translation": "The same applies to awarenesses: because of reasons, the fetter attachment arises.",
        "source": "T12n0374_025:0517a01_7"
    },
    {
        "source_sentence": "眾生雖說心與貪合，而是心性實不與合。",
        "translation": "Although sentient beings say that mind and craving are united, the nature of mind is really not united.",
        "source": "T12n0374_025:0517a02_0"
    },
    {
        "source_sentence": "若是貪心即是貪性，若是不貪即不貪性，不貪之心不能為貪，貪結之心不能不貪。",
        "translation": "If it's a mind that's craving, then it's the nature of craving; if it's not craving, then it's the nature of being free of craving; a mind that's not craving can't become craving; and a mind that's bound by craving can't be free of craving.",
        "source": "T12n0374_025:0517a02_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0517a04_2"
    },
    {
        "source_sentence": "以是義故，貪欲之結不能污心。",
        "translation": "Because of this meaning, the bond of craving can't defile the mind.",
        "source": "T12n0374_025:0517a05_0"
    },
    {
        "source_sentence": "諸佛菩薩永破貪結，是故說言心得解脫。",
        "translation": "The buddhas and bodhisattvas permanently break the bond of craving, so they're said to be liberated by their minds.",
        "source": "T12n0374_025:0517a05_1"
    },
    {
        "source_sentence": "一切眾生從因緣故，生於貪結，從因緣故，心得解脫。",
        "translation": "All sentient beings give rise to the bond of desire because of causes and conditions, and it's because of causes and conditions that their minds are liberated.",
        "source": "T12n0374_025:0517a06_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0517a08_0"
    },
    {
        "source_sentence": "譬如雪山懸峻之處，人與獼猴俱不能行。",
        "translation": "It's like a place where the snowy mountains are so high that people and monkeys can't walk.",
        "source": "T12n0374_025:0517a08_1"
    },
    {
        "source_sentence": "或復有處，獼猴能行，人不能行。",
        "translation": "Again, there may be a place where a monkey can walk but no human being can walk.",
        "source": "T12n0374_025:0517a09_2"
    },
    {
        "source_sentence": "或復有處，人與獼猴二俱能行。",
        "translation": "Sometimes there's another place where a person and two monkeys can walk.",
        "source": "T12n0374_025:0517a09_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0517a10_4"
    },
    {
        "source_sentence": "人與獼猴能行處者，如諸獵師，純以黐膠，置之案上用捕獼猴。",
        "translation": "A place where people and rhesus monkeys can walk is like hunters who simply put a piece of glue on a desk to catch the rhesus monkey.",
        "source": "T12n0374_025:0517a10_5"
    },
    {
        "source_sentence": "獼猴癡故，往手觸之，觸已粘手，欲脫手故，以脚踏之，脚復隨著。",
        "translation": "The monkey, out of delusion, touched it with his hands and then stuck his hands together. Because he wished to get rid of his hands, he stepped on it with his feet and carried it again.",
        "source": "T12n0374_025:0517a12_6"
    },
    {
        "source_sentence": "欲脫脚故，以口齧之，口復粘著，如是五處悉無得脫。",
        "translation": "Because they want to get rid of their feet, they eat them with their mouths and stick them back in their mouths, but these five places are all unable to get rid of them.",
        "source": "T12n0374_025:0517a13_7"
    },
    {
        "source_sentence": "於是獵師以杖貫之，負還歸家。",
        "translation": "The hunter then put his staff through it and carried it back home.",
        "source": "T12n0374_025:0517a14_8"
    },
    {
        "source_sentence": "雪山嶮處喻佛菩薩所得正道。",
        "translation": "The precipitous place on the snowy mountain is a metaphor for the right path attained by the buddhas and bodhisattvas.",
        "source": "T12n0374_025:0517a15_9"
    },
    {
        "source_sentence": "獼猴者喻諸凡夫。",
        "translation": "The rhesus monkey is a metaphor for worldlings.",
        "source": "T12n0374_025:0517a16_10"
    },
    {
        "source_sentence": "獵師者喻魔波旬。",
        "translation": "The hunter is a metaphor for Māra Pāpīyān.",
        "source": "T12n0374_025:0517a16_11"
    },
    {
        "source_sentence": "黐膠者喻貪欲結。",
        "translation": "It's a metaphor for the bond of craving.",
        "source": "T12n0374_025:0517a16_12"
    },
    {
        "source_sentence": "人與獼猴俱不行者，喻諸凡夫、魔王波旬俱不能行。",
        "translation": "A person who doesn't practice with a monkey is a metaphor for the fact that ordinary people and Māra King Pāpīyān can't practice either.",
        "source": "T12n0374_025:0517a17_13"
    },
    {
        "source_sentence": "獼猴能行，人不能者，喻諸外道有智慧者，諸惡魔等雖以五欲不能繫縛。",
        "translation": "It's a metaphor for those non-Buddhists who have wisdom, and even though bad demons and so forth can't bind them with the five desires, they can do so.",
        "source": "T12n0374_025:0517a18_14"
    },
    {
        "source_sentence": "人與獼猴俱能行者，一切凡夫及魔波旬常處生死不能修行，凡夫之人五欲所縛，",
        "translation": "All worldlings and Māra-pāpīyān can't practice in the eternal realm of birth and death, but worldlings are bound by the five desires.",
        "source": "T12n0374_025:0517a20_15"
    },
    {
        "source_sentence": "令魔波旬自在將去，如彼獵師黐捕獼猴，檐負歸家。",
        "translation": "He ordered Māra Pāpīyān to go away freely, just as the hunter caught a monkey and carried it on his eaves and returned home.",
        "source": "T12n0374_025:0517a22_16"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0517a24_0"
    },
    {
        "source_sentence": "譬如國王安住己界，身心安樂，若至他界，則得眾苦。",
        "translation": "It's like a king who lives in his own realm with peace and comfort in body and mind, and if he goes to another realm, he'll experience all kinds of suffering.",
        "source": "T12n0374_025:0517a24_1"
    },
    {
        "source_sentence": "一切眾生亦復如是，若能自住於己境界，則得安樂，若至他界則遇惡魔，",
        "translation": "So it is with all sentient beings. If they can abide within their own sphere, they will attain well-being; but if they go to another sphere, they will encounter evil demons.",
        "source": "T12n0374_025:0517a25_2"
    },
    {
        "source_sentence": "受諸苦惱。",
        "translation": "They experience suffering and distress.",
        "source": "T12n0374_025:0517a27_0"
    },
    {
        "source_sentence": "自境界者謂四念處，他境界者謂五欲也。",
        "translation": "The self-realm refers to four applications of mindfulness. The other realms are the five kinds of desire.",
        "source": "T12n0374_025:0517a27_1"
    },
    {
        "source_sentence": "云何名為繫屬於魔？",
        "translation": "What's called being bound to Māra?",
        "source": "T12n0374_025:0517a28_2"
    },
    {
        "source_sentence": "有諸眾生無常見常、常見無常，苦見於樂、樂見於苦，不淨見淨、淨見不淨，",
        "translation": "“Some sentient beings have neither eternalism nor eternity, and they see happiness as happiness or suffering as happiness. They see impurity as pure and purity as impurity.",
        "source": "T12n0374_025:0517a28_3"
    },
    {
        "source_sentence": "無我見我、我見無我，非實解脫橫見解脫、真實解脫見非解脫，非乘見乘、乘見非乘，",
        "translation": "The view of selflessness and the view of selflessness are not really liberation, but the view of liberation through oversight and true liberation is not liberation. They don’t see the vehicle as a vehicle or the vehicle as a vehicle.",
        "source": "T12n0374_025:0517b01_4"
    },
    {
        "source_sentence": "如是之人名繫屬魔，繫屬魔者心不清淨。",
        "translation": "Such a person is called bound to Māra, and those who are bound to Māra aren't pure in mind.",
        "source": "T12n0374_025:0517b03_5"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_025:0517b04_6"
    },
    {
        "source_sentence": "若見諸法真實是有，總別定相。",
        "translation": "If one sees that all dharmas really exist, they are always and exclusively determined characteristics.",
        "source": "T12n0374_025:0517b04_7"
    },
    {
        "source_sentence": "當知是人，若見色時，便作色相，乃至見識亦作識相，見男男相、見女女相、見日日相、見月月相、見歲歲相、見陰陰相、見入入相、見界界相，",
        "translation": "You should know that when a man sees form, he creates the characteristic marks of form. Up to when he sees consciousness, he also creates the characteristic marks of consciousness. He sees the characteristics of male and female; he sees the characteristics of day and night; he sees the characteristics of months and months; he sees the character",
        "source": "T12n0374_025:0517b05_8"
    },
    {
        "source_sentence": "如是見者，名繫屬魔。",
        "translation": "Such a view is called being bound to Māra.",
        "source": "T12n0374_025:0517b08_9"
    },
    {
        "source_sentence": "繫屬魔者心不清淨。",
        "translation": "The mind that's bound to Māra is impure.",
        "source": "T12n0374_025:0517b08_10"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_025:0517b09_11"
    },
    {
        "source_sentence": "若見我是色、色中有我、我中有色、色屬於我，乃至見我是識、識中有我、我中有識、識屬於我，",
        "translation": "If someone sees that self is form, there’s self in form, and there’s form in self, and form belongs to self; or if they see that self is consciousness, there’s self in consciousness, consciousness exists in self, and consciousness exists in self, and consciousness belongs to self.",
        "source": "T12n0374_025:0517b09_12"
    },
    {
        "source_sentence": "如是見者，繫屬於魔，非我弟子。",
        "translation": "Such a view is bound to Māra, not my disciple.",
        "source": "T12n0374_025:0517b11_13"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0517b12_14"
    },
    {
        "source_sentence": "我聲聞弟子遠離如來十二部經，修習種種外道典籍，不修出家、寂滅之法，",
        "translation": "My śrāvaka disciples have distanced themselves from the twelvefold scriptures of the Tathāgata and practiced various non-Buddhist texts. They did not practice renunciation or the path to nirvana.",
        "source": "T12n0374_025:0517b12_15"
    },
    {
        "source_sentence": "純營世俗在家之事。",
        "translation": "They're simply engaged in worldly and lay affairs at home.",
        "source": "T12n0374_025:0517b14_16"
    },
    {
        "source_sentence": "何等名為在家事也？",
        "translation": "What's called a householder's business?",
        "source": "T12n0374_025:0517b14_17"
    },
    {
        "source_sentence": "受畜一切不淨之物，奴婢、田宅、象馬、車乘、駝驢鷄犬、獼猴猪羊、種種穀麥，",
        "translation": "They accept and store all kinds of impure things, such as male and female servants, fields, elephants, horses, chariots, camels, mules, foxes, dogs, rhesus monkeys, pigs, sheep, various grains and wheat.",
        "source": "T12n0374_025:0517b15_18"
    },
    {
        "source_sentence": "遠離師、僧，親附白衣，違反聖教，向諸白衣作如是言：『佛聽比丘受畜種種不淨之物。』",
        "translation": "They're far removed from their teacher and saṃgha, personally attach themselves to white robes, violate the noble teaching, and say to the white robes, 'The Buddha hears that monks accept various impure things that are stored.'",
        "source": "T12n0374_025:0517b16_19"
    },
    {
        "source_sentence": "是名修習在家之事。",
        "translation": "This is called cultivating the affairs of a householder.",
        "source": "T12n0374_025:0517b18_20"
    },
    {
        "source_sentence": "有諸弟子不為涅槃，但為利養，親近聽受十二部經，招提僧物及僧鬘物，",
        "translation": "Some of his disciples did not seek nirvana but simply for profit. They became intimate with and listened to the twelve kinds of scriptures, summoned the property belonging to the sangha (monks) as well as the property belonging to the sangha.",
        "source": "T12n0374_025:0517b19_21"
    },
    {
        "source_sentence": "衣著食噉，如自己有，慳惜他家，及以稱譽、親近國王及諸王子，卜筮吉凶推步盈虛，",
        "translation": "They wear food and clothing as if they own them, are stingy with other people's homes, and partake of praise, being intimate with kings and princes, predicting good and bad fortune and pushing their steps into space.",
        "source": "T12n0374_025:0517b20_22"
    },
    {
        "source_sentence": "圍碁六博摴蒱投壺，親近比丘尼及諸處女，畜二沙彌，常遊屠獵、酤酒之家，",
        "translation": "He gambled in the six-square chess and threw it into a pot. Being intimate with bhikṣuṇīs and other women, he kept two śrāmaṇeras and always traveled to the house of butchery, hunting, and eating wine.",
        "source": "T12n0374_025:0517b22_23"
    },
    {
        "source_sentence": "及旃陀羅所住之處，種種販賣、手自作食、受使隣國通致信命，如是之人當知即是魔之眷屬，",
        "translation": "And wherever the caṇḍāla dwells, variously selling their goods, eating with their own hands, and receiving envoys from neighboring countries to share their faith, such people should be known to be Māra’s retinues.",
        "source": "T12n0374_025:0517b24_24"
    },
    {
        "source_sentence": "非我弟子。",
        "translation": "It's not my disciple.",
        "source": "T12n0374_025:0517b26_25"
    },
    {
        "source_sentence": "以是因緣，心共貪生、心共貪滅。",
        "translation": "Because of these causes and conditions, co-craving arises in the mind and co-craving ceases in the mind.",
        "source": "T12n0374_025:0517b26_26"
    },
    {
        "source_sentence": "乃至癡心，共生共滅亦復如是。",
        "translation": "It's likewise with the mind of delusion that arises and ceases together.",
        "source": "T12n0374_025:0517b27_27"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_025:0517b28_28"
    },
    {
        "source_sentence": "以是因緣，心性不淨、亦非不淨，是故我說心得解脫。",
        "translation": "Because of these causes and conditions, the mind is inherently impure and neither pure nor impure; therefore, I say that the mind attainments are liberated.",
        "source": "T12n0374_025:0517b28_29"
    },
    {
        "source_sentence": "若有不受不畜一切不淨之物，為大涅槃受持、讀誦十二部經，書寫解說，",
        "translation": "If there is anyone who receives and recites twelve kinds of scriptures, writes, interprets, and teaches them for the sake of great nirvana without accepting or storing anything impure.",
        "source": "T12n0374_025:0517b29_30"
    },
    {
        "source_sentence": "當知是等，真我弟子，不行惡魔波旬境界，即是修習三十七品，以修習故，",
        "translation": "You should know that these are truly my disciples who don't practice the realm of Māra Pāpīyān, which is to cultivate thirty-seven classes because they cultivate them.",
        "source": "T12n0374_025:0517c02_31"
    },
    {
        "source_sentence": "不共貪生、不共貪滅，是名菩薩修大涅槃微妙經典，具足成就第八功德。",
        "translation": "What's not shared with craving that arises and what's not shared with craving that ceases is called a bodhisattva cultivating the subtle scripture of great nirvāṇa, which fully accomplishes the eighth virtue.",
        "source": "T12n0374_025:0517c03_32"
    },
    {
        "source_sentence": "◎大般涅槃經卷第二十五",
        "translation": "*Mahāparinirvāṇa-sūtra, Volume 25",
        "source": "T12n0374_025:0517c05_33"
    }
]