[
    {
        "source_sentence": "大方等無想經卷第四",
        "translation": "*Mahāmegha-sūtra, Volume 4",
        "source": "T12n0387_004:1094a12_0"
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Northern Liang Tianzhushu Sanzang translated by Dharmakṣema",
        "source": "T12n0387_004:1094a14_0"
    },
    {
        "source_sentence": "大雲初分如來涅槃健度第三十六",
        "translation": "The Thirty-sixth Chapter of the Tathāgata's Nirvāṇa in the First Part of the Great Cloud",
        "source": "T12n0387_004:1094a15_0"
    },
    {
        "source_sentence": "於是，眾中有大梵王，名曰健行，持諸供具，供養於佛，合掌恭敬，右遶三匝，",
        "translation": "Thereupon, there was a great Brahmā king in the assembly called健行, bearing various offerings and honoring the Buddha. He joined his palms in reverence and circumambulated him three times to his right.",
        "source": "T12n0387_004:1094a16_0"
    },
    {
        "source_sentence": "上昇虛空，高七多羅樹，白佛言：「世尊！",
        "translation": "They rose up into the sky, seven palm trees in height, and said to the Buddha, Bhagavān!",
        "source": "T12n0387_004:1094a17_1"
    },
    {
        "source_sentence": "大乘經典，凡有幾種三昧總持，所修行道祕蜜之藏，樂說無礙？",
        "translation": "“World-honored One, how many kinds of scriptures of the Mahayana are found in samddhis and dhāraṇīs? They are the secret treasury of the path cultivated by those who practice samddhis.",
        "source": "T12n0387_004:1094a18_2"
    },
    {
        "source_sentence": "如來境界國土世間，復有幾種？",
        "translation": "Of how many forms are the worlds and lands belonging to the sphere of a buddha?",
        "source": "T12n0387_004:1094a19_3"
    },
    {
        "source_sentence": "如來大慈、憐愍一切，故我今日，敢生此問，願二足尊，哀矜宣說。",
        "translation": "Because the Tathāgata has great compassion and pity for all people, today I dare to ask this question. May the venerable two-legged one express it in sympathy!",
        "source": "T12n0387_004:1094a20_4"
    },
    {
        "source_sentence": "說已，我當頂戴受持。」",
        "translation": "After you say this, I'll carry it on my head and accept it.",
        "source": "T12n0387_004:1094a22_5"
    },
    {
        "source_sentence": "「善哉大梵王，　　問佛真實義，",
        "translation": "“Splendid, Great king of Brahmā, Is it true that you ask the buddhas about their meaning?",
        "source": "T12n0387_004:1094a22_6"
    },
    {
        "source_sentence": "　佛當如實答，　　廣度諸眾生。",
        "translation": "The Buddha will answer in truth, Liberating all sentient beings.",
        "source": "T12n0387_004:1094a22_6"
    },
    {
        "source_sentence": "　應當至心聽，　　恭敬而尊重，",
        "translation": "You should listen with utmost sincerity, With respect and reverence.",
        "source": "T12n0387_004:1094a22_6"
    },
    {
        "source_sentence": "　一一方等經，　　恒沙義難解。",
        "translation": "The meaning of the sūtras in one direction is as difficult to understand as the sands of the Ganges River.",
        "source": "T12n0387_004:1094a22_6"
    },
    {
        "source_sentence": "　如來大法王，　　廣開闡法界，",
        "translation": "The great king of the teachings, the enlightened one, Has extensively illuminated the realm of reality.",
        "source": "T12n0387_004:1094a22_6"
    },
    {
        "source_sentence": "　佛得總持法，　　非二乘所解。",
        "translation": "The Buddha has attained the Dharma of total maintenance, which is not understood by the two vehicles.",
        "source": "T12n0387_004:1094a22_6"
    },
    {
        "source_sentence": "時，有天子名無盡意，在大眾中，承佛威神，即為梵天而說偈言：「大梵！",
        "translation": "At the time, there was a celestial being named Inexhaustible intention who was in the midst of the crowd and, imbued with the Buddha's authoritative power, spoke a verse for Brahmā, saying, Great Brahmā!",
        "source": "T12n0387_004:1094a22_6"
    },
    {
        "source_sentence": "大乘經義，非惟一種，乃至萬種。",
        "translation": "The meaning of the Great Vehicle scriptures is not just one kind, up to ten thousand kinds.",
        "source": "T12n0387_004:1094b01_7"
    },
    {
        "source_sentence": "假使有人，智如阿難，所得壽命，如恒河沙，不能受持知其義理。",
        "translation": "Suppose someone's wisdom is like Ānanda, and the life span they attain is like the sands of the Ganges River, but they can't memorize it or know its meaning.",
        "source": "T12n0387_004:1094b01_8"
    },
    {
        "source_sentence": "復使是人，其舌辯利，數如恒沙，說亦不盡。",
        "translation": "Furthermore, such a person's tongue is eloquent and sharp, as numerous as the number of grains of sand in the Ganges River, and he doesn't stop speaking.",
        "source": "T12n0387_004:1094b03_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0387_004:1094b04_10"
    },
    {
        "source_sentence": "是大乘經，其義深邃，不可思議，不可稱量，境界難知，過去未來現在諸佛，",
        "translation": "The meaning of this Mahayana scripture is profound, inconceivable, immeasurable, and difficult to fathom. All buddhas of the past, future, and present are likewise.",
        "source": "T12n0387_004:1094b04_11"
    },
    {
        "source_sentence": "說其句義猶不可盡。",
        "translation": "It's still inexhaustible to explain its meaning.",
        "source": "T12n0387_004:1094b06_12"
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0387_004:1094b06_13"
    },
    {
        "source_sentence": "譬如醫師，為療病故，所說藥方，亦不能盡。",
        "translation": "It's like a physician who explains prescriptions for medicine in order to treat illnesses, but they can't finish them.",
        "source": "T12n0387_004:1094b06_14"
    },
    {
        "source_sentence": "諸佛世尊，亦復如是。",
        "translation": "So it is with the buddhas and world-honored ones.",
        "source": "T12n0387_004:1094b07_15"
    },
    {
        "source_sentence": "梵天！",
        "translation": "Brahmā!",
        "source": "T12n0387_004:1094b08_16"
    },
    {
        "source_sentence": "譬如女人，惟有一子，欲令長大，漸令服蘇，諸佛世尊亦復如是。",
        "translation": "Good man, this is analogous to a woman who has only one child and wishes to bring him up to adulthood but gradually brings him back to life. The buddhas and world-honored ones are also like this.",
        "source": "T12n0387_004:1094b08_17"
    },
    {
        "source_sentence": "梵天已為眾生興發此問，我當至心聽受其義。」",
        "translation": "Having raised this question for sentient beings, the Brahma gods will wholeheartedly hear and accept its meaning.",
        "source": "T12n0387_004:1094b09_18"
    },
    {
        "source_sentence": "爾時，大雲密藏菩薩白佛言：「世尊！",
        "translation": "At that point, the great cloud of mysterious treasury bodhisattva said to the Buddha, Bhagavān!",
        "source": "T12n0387_004:1094b11_0"
    },
    {
        "source_sentence": "此經中說四百三昧，其義甚深，難可得解，惟願如來，分別解說。」",
        "translation": "This sūtra explains 400 samādhis, whose meaning is so profound that it's difficult to understand; may the Tathāgata explain them separately.",
        "source": "T12n0387_004:1094b11_1"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_004:1094b13_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_004:1094b13_3"
    },
    {
        "source_sentence": "如汝所問，欲療眾生雜惡、穢垢，令得忍辱、正信之心，正精進心、念心、定心，",
        "translation": "“As you ask, wishing to cure sentient beings of their defilements and impurities, enabling them to attain forbearance, right faith, right effort, mindfulness, concentration, and absorption,",
        "source": "T12n0387_004:1094b13_4"
    },
    {
        "source_sentence": "欲令未來薄福之人，生福德故，故發此問。",
        "translation": "They want to cause people of little merit in the future to give rise to virtue, so they ask this question.",
        "source": "T12n0387_004:1094b15_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_004:1094b16_6"
    },
    {
        "source_sentence": "若有國土、城邑、聚落四部之眾，受持、讀誦、書寫、解說如是經者，",
        "translation": "“If there are any lands, cities, or villages where the fourfold assembly preserves, recites, writes, and explains such scriptures,",
        "source": "T12n0387_004:1094b16_7"
    },
    {
        "source_sentence": "時旱則雨，雨過則止。",
        "translation": "When there's drought, it rains, and when the rain goes down, it stops.",
        "source": "T12n0387_004:1094b17_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_004:1094b18_9"
    },
    {
        "source_sentence": "隨有國土，其中眾生受持、讀誦、書寫、解說、聽此經者，當知是人得金剛身。",
        "translation": "In any land where there are sentient beings who preserve, recite, write, explain, and listen to this sūtra, you should know that such people will attain the adamantine body.",
        "source": "T12n0387_004:1094b18_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0387_004:1094b20_11"
    },
    {
        "source_sentence": "是經典中，有神呪故。",
        "translation": "It's because there's a divine spell in this sūtra.",
        "source": "T12n0387_004:1094b20_12"
    },
    {
        "source_sentence": "為眾生故，三世諸佛，悉共宣說：「郁究隷　牟究隷　頭坻　比頭坻　陀尼羯坻　陀那賴坻　陀那僧塔兮「若有四眾，",
        "translation": "For the sake of sentient beings, the buddhas of the three times all taught it together, Ucchuṣa, Mucilinda, Duṣprasāha, Piṣṭacāritra, Dhāraṇīkaṭṭika, Dhāraṇīpāda, and Dhāraṇīsaṃta.",
        "source": "T12n0387_004:1094b20_13"
    },
    {
        "source_sentence": "讀誦此呪，則為諸佛之所稱讚。",
        "translation": "Reciting this dhāraṇī, they'll be praised by the buddhas.",
        "source": "T12n0387_004:1094b24_14"
    },
    {
        "source_sentence": "若有國土，欲祈雨者，六齋之日，其王應當淨自洗浴，供養三寶，尊重、讚嘆稱龍王名。",
        "translation": "If there's a land that wants to pray for rain, the king should bathe himself cleanly on the sixth day of purification, offer support to the Three Treasures, venerate and praise them, and call themselves the name of the dragon king.",
        "source": "T12n0387_004:1094b24_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_004:1094b26_16"
    },
    {
        "source_sentence": "四大之性，可令變易；",
        "translation": "The nature of the four elements is able to cause change.",
        "source": "T12n0387_004:1094b27_0"
    },
    {
        "source_sentence": "誦持此呪，天不降雨，無有是處。",
        "translation": "If someone recites this dhāraṇī, the gods won't send rain, but there's no place for it.",
        "source": "T12n0387_004:1094b27_1"
    },
    {
        "source_sentence": "汝先所問四百三昧義，至心諦聽，當為汝說。",
        "translation": "Listen attentively and earnestly. I will explain for you the meaning of the four hundred forms of concentration that you have previously asked about.",
        "source": "T12n0387_004:1094b28_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_004:1094b29_3"
    },
    {
        "source_sentence": "此經中，有諸佛菩薩甚深淨水大海三昧，非諸聲聞、緣覺所知，故名甚深；",
        "translation": "In this scripture there is the profound concentration of buddhas and enlightening beings in the great ocean of pure water, which is not known to śrāvakas or pratyekabuddhas. Therefore it is called profound.",
        "source": "T12n0387_004:1094b29_4"
    },
    {
        "source_sentence": "能斷一切生死、渴乏，故名淨水；",
        "translation": "It is called pure water because it can cut off all the cravings and thirsts of birth and death.",
        "source": "T12n0387_004:1094c02_0"
    },
    {
        "source_sentence": "邊不可得，故名大海；",
        "translation": "Because its limits are ungraspable, it is called the great ocean.",
        "source": "T12n0387_004:1094c02_1"
    },
    {
        "source_sentence": "諸佛世尊，同平等故，故名三昧。",
        "translation": "Because the buddhas and world-honored ones are the same and equal, they're therefore called samādhi.",
        "source": "T12n0387_004:1094c03_2"
    },
    {
        "source_sentence": "若有菩薩，具是三昧，則得常樂我淨之身，得多聞海、多聞寶藏，於菩提心，",
        "translation": "If there are bodhisattvas who possess this concentration, they’ll attain permanence, bliss, self, and purity in their bodies. They’ll attain the ocean of much learning and the treasury of much learning, and will for enlightenment.",
        "source": "T12n0387_004:1094c03_3"
    },
    {
        "source_sentence": "無有動轉，不退佛慧常住之身，無有變易、心無疑礙，不離法雨，常遇三寶，",
        "translation": "They are unshakable, they do not regress from the body of Buddha’s wisdom, which always abides. Their bodies have no change, and their minds have no doubt or obstruction. They don’t part from the rain of the Teaching; they always encounter the Three Treasures.",
        "source": "T12n0387_004:1094c05_4"
    },
    {
        "source_sentence": "值善知識，成就一切真正福德。",
        "translation": "When they meet a good teacher, they'll attain all the true merits.",
        "source": "T12n0387_004:1094c07_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_004:1094c07_6"
    },
    {
        "source_sentence": "汝當受持如是三昧。",
        "translation": "You must accept and uphold this kind of concentration.",
        "source": "T12n0387_004:1094c08_7"
    },
    {
        "source_sentence": "持已，則得具足成就無量功德。",
        "translation": "After maintaining it, they'll attain the full accomplishment of measureless merit.",
        "source": "T12n0387_004:1094c08_8"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T12n0387_004:1094c09_9"
    },
    {
        "source_sentence": "復有甚深淨水大海所入三昧，無有三昧而能宣說是三昧相，故名甚深；",
        "translation": "Again, there is another profound concentration entered by the great ocean of pure water. There is no such concentration and yet it can expound the characteristics of this concentration. That is why it is called profound.",
        "source": "T12n0387_004:1094c09_10"
    },
    {
        "source_sentence": "洗濯生死，故名為水；",
        "translation": "It is called water because it washes away birth and death.",
        "source": "T12n0387_004:1094c11_11"
    },
    {
        "source_sentence": "無能得底，故曰大海；",
        "translation": "Because there is no bottom that can reach it, it is called the great ocean.",
        "source": "T12n0387_004:1094c11_12"
    },
    {
        "source_sentence": "得不動身，常樂我淨，故名為入；",
        "translation": "Attaining the immovable body, permanence, bliss, self, and purity is therefore called entry.",
        "source": "T12n0387_004:1094c12_13"
    },
    {
        "source_sentence": "畢竟故，故名三昧。",
        "translation": "Because it is the ultimate, it is called samdhi.",
        "source": "T12n0387_004:1094c12_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_004:1094c13_15"
    },
    {
        "source_sentence": "若有菩薩，具是三昧，則能變為諸天形像。",
        "translation": "If there are bodhisattvas who possess this concentration, then they can transform themselves into the forms of gods.",
        "source": "T12n0387_004:1094c13_16"
    },
    {
        "source_sentence": "見事梵者，即作梵像，為破梵事而心不著；",
        "translation": "To those who serve the god Brahmā, they instantly form an image of the god. In order to destroy the deeds of Brahmā, their minds do not cling [to anything].",
        "source": "T12n0387_004:1094c14_17"
    },
    {
        "source_sentence": "見事自在天，作自在天像；",
        "translation": "In the sky of service to gods they made images of self-dependent gods.",
        "source": "T12n0387_004:1094c15_18"
    },
    {
        "source_sentence": "見事八臂，作八臂像；",
        "translation": "When they saw the eight-armed figures, they looked like eight-armed images.",
        "source": "T12n0387_004:1094c16_0"
    },
    {
        "source_sentence": "見事建馱，作建馱像；",
        "translation": "When he saw the monk Candra, he made an image of Candra.",
        "source": "T12n0387_004:1094c16_1"
    },
    {
        "source_sentence": "見事天母，作天母像；",
        "translation": "They worshiped the goddess and made an image of her in the form of their mother.",
        "source": "T12n0387_004:1094c17_0"
    },
    {
        "source_sentence": "見事鬼者，即作鬼像。",
        "translation": "When they see a ghost, they'll make an image of the ghost.",
        "source": "T12n0387_004:1094c17_1"
    },
    {
        "source_sentence": "雖示如是種種形像，為壞彼見，心實無著。",
        "translation": "Even though he shows various forms like these, in order to destroy their views, his mind really has no attachment.",
        "source": "T12n0387_004:1094c17_2"
    },
    {
        "source_sentence": "見有屠者，即現屠像，為欲化彼，令不殺生，酒家乃至旃陀羅像，亦復如是；",
        "translation": "When they see a butcher, they immediately manifest an image of the butcher in order to transform them so that they will not kill living beings. The same applies up to the images of wine houses and even caṇḍāla as well.",
        "source": "T12n0387_004:1094c18_3"
    },
    {
        "source_sentence": "見有博弈、戲笑之處，悉現其像，為斷貧窮。",
        "translation": "Seeing a place of games and amusement, they all showed their images in order to eliminate poverty.",
        "source": "T12n0387_004:1094c20_4"
    },
    {
        "source_sentence": "現畜、妻息、奴婢、僕從，而其內心，常修梵行，雖服寶飾，心常清淨。",
        "translation": "Their minds are always engaged in religious practice, and though they wear jewel ornaments their minds are always pure.",
        "source": "T12n0387_004:1094c21_5"
    },
    {
        "source_sentence": "示現服食甘美眾膳，內常法喜，以自充潤。",
        "translation": "He shows that he eats delicious food and enjoys a variety of delicious dishes, always rejoicing in the Dharma to nourish himself.",
        "source": "T12n0387_004:1094c22_6"
    },
    {
        "source_sentence": "入諸婬舍，為化欲惡、諸不善者。",
        "translation": "He enters the monasteries to convert those who have bad and unskillful desires.",
        "source": "T12n0387_004:1094c23_7"
    },
    {
        "source_sentence": "博士、卜噬、鳥鷲之身，乃至一切畜生雜類，亦復現入一切形殘，身不具足，",
        "translation": "The bodies of doctors, arhats, birds, and eagles, as well as all the various kinds of animals and creatures, also appear to enter into all forms but are not endowed with them.",
        "source": "T12n0387_004:1094c24_8"
    },
    {
        "source_sentence": "為欲宣說，身過患故；",
        "translation": "They want to expound it, because of physical faults and distress.",
        "source": "T12n0387_004:1094c26_9"
    },
    {
        "source_sentence": "乃至九十五種邪道，隨示其像，破彼見故。",
        "translation": "It's because the ninety-five kinds of wrong paths are shown in their images, and they refute their views.",
        "source": "T12n0387_004:1094c26_10"
    },
    {
        "source_sentence": "示現自身四百四病，為治眾生內外病故；",
        "translation": "They manifest themselves as four hundred and four diseases, curing the internal and external sicknesses of sentient beings.",
        "source": "T12n0387_004:1094c27_11"
    },
    {
        "source_sentence": "讀誦外書，解種種語。",
        "translation": "He reads and recites non-Buddhist books and understands various words.",
        "source": "T12n0387_004:1094c28_12"
    },
    {
        "source_sentence": "示現奴婢、僕從、男女、老少之像，及示生老病死等像，為欲調伏諸眾生故。",
        "translation": "It's because they show images of servants, servants, men, women, old age, illness, death, and so forth in order to tame sentient beings.",
        "source": "T12n0387_004:1094c28_13"
    },
    {
        "source_sentence": "能解一切鳥獸等語，現作香、華、藥草、果蓏。",
        "translation": "He's able to understand all the words of birds, animals, and so forth, and now he produces fragrance, flowers, medicinal plants, and fruit garlands.",
        "source": "T12n0387_004:1095a01_14"
    },
    {
        "source_sentence": "或示王身、王子、大臣、長者身像，或示沙門、婆羅門像，帝釋天王、轉輪聖王、日月等像。",
        "translation": "They may show the king's body, princes, ministers, elders, or images of ascetics and priests, Indra, divine kings, wheel-turning sage kings, suns and moons, and so forth.",
        "source": "T12n0387_004:1095a02_15"
    },
    {
        "source_sentence": "所以示現四大天王，為欲擁護四天下故。",
        "translation": "That's why the four great celestial kings are shown, because they want to protect the four worlds.",
        "source": "T12n0387_004:1095a04_16"
    },
    {
        "source_sentence": "示現諸佛自在神通，終不畢竟入於涅槃。",
        "translation": "They show that the buddhas have unimpeded supernormal powers, and they never enter nirvāṇa after all.",
        "source": "T12n0387_004:1095a05_17"
    },
    {
        "source_sentence": "變作眾色，不壞色性。",
        "translation": "It transforms into all forms without destroying the nature of form.",
        "source": "T12n0387_004:1095a06_18"
    },
    {
        "source_sentence": "雖得往生諸佛淨土，終不分別國土之相。",
        "translation": "Even though they've been reborn in the pure land of the buddhas, they never discriminate the characteristics of their lands.",
        "source": "T12n0387_004:1095a06_19"
    },
    {
        "source_sentence": "獲得諸佛甚深三昧，而於法界，無所分別。",
        "translation": "They attain the profound samādhi of the buddhas, yet they don't discriminate anything in the Dharma realm.",
        "source": "T12n0387_004:1095a07_20"
    },
    {
        "source_sentence": "為人天主，心無憍慢。",
        "translation": "Being the lord of humans and gods, he has no conceit in his mind.",
        "source": "T12n0387_004:1095a08_21"
    },
    {
        "source_sentence": "雖說夢事，不見夢相。",
        "translation": "Even though it's said to be a dream, it doesn't see the characteristics of a dream.",
        "source": "T12n0387_004:1095a09_22"
    },
    {
        "source_sentence": "外現魔事，實無魔業。",
        "translation": "demonic deeds are manifested externally, but there really is no demonic action.",
        "source": "T12n0387_004:1095a09_23"
    },
    {
        "source_sentence": "行於世間，世法不污，猶如蓮華，處污不染。",
        "translation": "He practices in the world but doesn't defile worldly dharmas, just like a lotus flower that abides where it's defiled and doesn't stain.",
        "source": "T12n0387_004:1095a10_24"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_004:1095a11_0"
    },
    {
        "source_sentence": "如是之果，名為成就甚深大海所入三昧。」",
        "translation": "Such a result is called the accomplishment of the samādhi entered by the profound ocean.",
        "source": "T12n0387_004:1095a11_1"
    },
    {
        "source_sentence": "爾時，眾中有婆羅門，名曰善德，白佛言：「世尊！",
        "translation": "At the time, there was a Brāhmaṇa named Sunetra among the crowd who said to the Buddha, Bhagavān!",
        "source": "T12n0387_004:1095a12_2"
    },
    {
        "source_sentence": "如來之法，甚深祕密，為諸眾生，分別演說。",
        "translation": "The teaching of the Tathāgata is so profound and esoteric that it's explained separately for sentient beings.",
        "source": "T12n0387_004:1095a13_3"
    },
    {
        "source_sentence": "而是薄福、鈍根、愚癡提婆達多，不聽不受，不知恩分，純與六群弊惡比丘，",
        "translation": "Instead, the poorly endowed, dull-rooted, and ignorant Devadatta would not listen or accept it. They did not know the extent of their kindness but simply gave it to six groups of bad and evil bhikṣus.",
        "source": "T12n0387_004:1095a14_4"
    },
    {
        "source_sentence": "同其所行，增長地獄，出佛身血，破壞眾僧。",
        "translation": "Whatever they do, the hell grows larger and produces the blood of the Buddha’s body that destroys the Sangha.",
        "source": "T12n0387_004:1095a15_5"
    },
    {
        "source_sentence": "生於釋種，增長憍慢，實非人類，強名為人，察其行迹，畜生無別。",
        "translation": "They are born in the Śākya clan and grow arrogant, not really human beings but forcing themselves to be called human beings. Observing their traces of behavior, they are no different from animals.",
        "source": "T12n0387_004:1095a16_6"
    },
    {
        "source_sentence": "復從無量阿僧祇世，常於如來生惡逆心，其有施者，無有果報，自所修善，",
        "translation": "“Furthermore, from immeasurable incalculable aeons ago I always had malicious thoughts toward the enlightened ones. Those who made donations to them had no reward; they cultivated their own goodness and practiced others’ goodness.",
        "source": "T12n0387_004:1095a18_7"
    },
    {
        "source_sentence": "亦不成就，如尼乾子等無差別。",
        "translation": "They also don't accomplish them, just like Nirgrantha and so forth, with no distinctions.",
        "source": "T12n0387_004:1095a19_8"
    },
    {
        "source_sentence": "尼乾子說無受、無施，提婆達多，亦復如是，真是魔黨，非佛眷屬。",
        "translation": "Nirgrantha teaches that there's no sensation and no giving, and so does Devadatta, who really is a Māra party and not a follower of the Buddha.",
        "source": "T12n0387_004:1095a20_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0387_004:1095a21_10"
    },
    {
        "source_sentence": "常於如來，起害心故。",
        "translation": "It's because they always give rise to harmful thoughts about the Tathāgata.",
        "source": "T12n0387_004:1095a22_0"
    },
    {
        "source_sentence": "雖名沙門，無沙門義。",
        "translation": "Although it's called an ascetic, it doesn't have the meaning of ascetic.",
        "source": "T12n0387_004:1095a22_1"
    },
    {
        "source_sentence": "猶如袈裟裹覆利刀，實是禿人，名為無命，所有徒眾，亦復如是。",
        "translation": "It's like the monk's robe wrapped around a sharp sword that's really a baldie, which is called lifeless, and so are all the disciples.",
        "source": "T12n0387_004:1095a22_2"
    },
    {
        "source_sentence": "實非世尊，作世尊想。",
        "translation": "They really aren't the Bhagavān, and they conceptualize them as Bhagavān.",
        "source": "T12n0387_004:1095a24_3"
    },
    {
        "source_sentence": "世尊如來，若是一切智者，何故聽此弊惡之人，出家剃髮，受具足戒？",
        "translation": "Bhagavān, if the Tathāgata is omniscience, why would he listen to this bad man who leaves home and shaves his hair and receives the full set of precepts?",
        "source": "T12n0387_004:1095a24_4"
    },
    {
        "source_sentence": "如來所說，普令眾生生於善根，是人何故獨不得生？",
        "translation": "The Tathāgata teaches that it causes all sentient beings to give rise to good roots, so why wouldn't this person be born alone?",
        "source": "T12n0387_004:1095a26_5"
    },
    {
        "source_sentence": "如來慈哀，常以樂說，為諸眾生，廣宣正法，聞者蒙潤，善根開敷。",
        "translation": "The Tathāgata is compassionate and always speaks with joy. For the sake of sentient beings he extensively expounds the true-dharma. Those who hear it are nourished, and their good roots are developed.",
        "source": "T12n0387_004:1095a27_6"
    },
    {
        "source_sentence": "提婆達多，何故不得預斯利益？",
        "translation": "Devadatta, why wouldn't you be able to anticipate this benefit?",
        "source": "T12n0387_004:1095a28_7"
    },
    {
        "source_sentence": "如來性淨、身淨、心淨、眷屬應淨，何故眾中，而有此輩？」",
        "translation": "If the Tathāgata's nature is pure, his body is pure, his mind is pure, and his followers should be pure, why are there these people in the congregation?",
        "source": "T12n0387_004:1095a29_8"
    },
    {
        "source_sentence": "爾時，大雲密藏菩薩，承佛神力，語善德言：「善哉善哉！",
        "translation": "At the time, the great cloud of mysterious treasury bodhisattva, imbued with the Buddha's miraculous powers, said to Sunetra, Good, good!",
        "source": "T12n0387_004:1095b01_9"
    },
    {
        "source_sentence": "大婆羅門、一切聲聞、辟支佛等，於是事中，都不能問；",
        "translation": "The great brāhmaṇas, all the śrāvakas and pratyekabuddhas were unable to ask questions about these matters.",
        "source": "T12n0387_004:1095b03_0"
    },
    {
        "source_sentence": "汝今乃能諮問是義。",
        "translation": "Now, you're able to ask about this meaning.",
        "source": "T12n0387_004:1095b04_1"
    },
    {
        "source_sentence": "至心諦聽！",
        "translation": "Listen attentively!",
        "source": "T12n0387_004:1095b04_2"
    },
    {
        "source_sentence": "我當承佛威神、道力，為汝廣說。",
        "translation": "I will inherit the Buddha’s authoritative power and the power of enlightenment and explain it to you.",
        "source": "T12n0387_004:1095b04_3"
    },
    {
        "source_sentence": "「汝不應言提婆達多不知恩分。",
        "translation": "You shouldn't say that Devadatta doesn't know the portion of kindness.",
        "source": "T12n0387_004:1095b05_4"
    },
    {
        "source_sentence": "是人知恩，非不知也。",
        "translation": "That person knows kindness, not doesn't he know it.",
        "source": "T12n0387_004:1095b06_5"
    },
    {
        "source_sentence": "雖與六群，同其所行，不名為惡。",
        "translation": "Even though they're the same as the six groups of people who practice them, they aren't called bad.",
        "source": "T12n0387_004:1095b06_6"
    },
    {
        "source_sentence": "提婆達多，不可思議，所修業行，皆同如來。",
        "translation": "Devadatta is inconceivable, and the actions he cultivates are all the same as those of the Tathāgata.",
        "source": "T12n0387_004:1095b07_7"
    },
    {
        "source_sentence": "如來業行，即是提婆達多業行。",
        "translation": "The Tathāgata's karmic conduct is Devadatta's karmic conduct.",
        "source": "T12n0387_004:1095b08_8"
    },
    {
        "source_sentence": "一切眾生，不能開顯如來、世尊真實功德；",
        "translation": "All sentient beings cannot reveal the true virtues of buddhas and world-honored ones.",
        "source": "T12n0387_004:1095b09_9"
    },
    {
        "source_sentence": "提婆達多能開示人，令阿僧祇無量眾生，安住善根。",
        "translation": "Devadatta can enlighten people and cause incalculable numbers of sentient beings to abide in good roots.",
        "source": "T12n0387_004:1095b10_0"
    },
    {
        "source_sentence": "如來業行，非地獄種，云何而言提婆達多是地獄人？",
        "translation": "The Tathāgata's actions and deeds aren't the type of hell, so why does he say Devadatta is a hell-dweller?",
        "source": "T12n0387_004:1095b11_1"
    },
    {
        "source_sentence": "汝言同於六群所行。",
        "translation": "You say it's the same as what the six groups of people do.",
        "source": "T12n0387_004:1095b12_2"
    },
    {
        "source_sentence": "汝今當知，六群比丘，實非弊惡，所行之法，亦同佛行。",
        "translation": "You should now know that these six groups of monks are not really bad or evil. The Dharma they practice is the same as that practiced by the Buddha.",
        "source": "T12n0387_004:1095b12_3"
    },
    {
        "source_sentence": "「大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1095b14_0"
    },
    {
        "source_sentence": "如來身血，實無有出，提婆達多亦不能出。",
        "translation": "The blood of the Tathāgata's body really didn't spill, and Devadatta couldn't spill it either.",
        "source": "T12n0387_004:1095b14_1"
    },
    {
        "source_sentence": "若言樹影有出血者，無有是處。",
        "translation": "If someone says there's bleeding in the shadow of a tree, there's no place for it.",
        "source": "T12n0387_004:1095b15_2"
    },
    {
        "source_sentence": "如來之身，亦復如是。",
        "translation": "So it is with the body of the Tathāgata.",
        "source": "T12n0387_004:1095b15_3"
    },
    {
        "source_sentence": "若言出血，當知即是善權方便、不可思議。",
        "translation": "If you say it's bleeding, you should know that it's the skillful means of good authority and inconceivability.",
        "source": "T12n0387_004:1095b16_4"
    },
    {
        "source_sentence": "大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1095b17_5"
    },
    {
        "source_sentence": "釋迦如來種性，清淨如紺琉璃，所有弟子，無有毀禁。",
        "translation": "The Śākyamuni Tathāgata's seed nature is pure like a violet lapis lazuli, and there are no disciples who violate the precepts.",
        "source": "T12n0387_004:1095b17_6"
    },
    {
        "source_sentence": "我亦不見，如來弟子有破戒者。",
        "translation": "I don't see anyone among the disciples of the Tathāgata who breaks the precepts.",
        "source": "T12n0387_004:1095b18_7"
    },
    {
        "source_sentence": "如來所說，無上正法，實令聞者，生於善根，非不生也。",
        "translation": "The unsurpassed true teaching taught by the Tathāgata really causes those who hear it to give rise to good roots, not non-arising.",
        "source": "T12n0387_004:1095b19_8"
    },
    {
        "source_sentence": "如來大眾，成就持戒，悉入佛境，徒眾、眷屬，如栴檀林，純以栴檀而為圍遶，",
        "translation": "The great assembly of the enlightened, having perfected their observance of precepts, all entered the Buddha’s realm. All the members of the sangha and their retinues were like sandalwood groves surrounded by sandalwood trees.",
        "source": "T12n0387_004:1095b20_9"
    },
    {
        "source_sentence": "不可沮壞，如金剛山，亦不見有能得壞者。",
        "translation": "They can't be broken, just like the adamantine mountain, and they don't see anyone who can break it.",
        "source": "T12n0387_004:1095b22_10"
    },
    {
        "source_sentence": "有怖畏者，則可破壞；",
        "translation": "If there is fear, it can be destroyed.",
        "source": "T12n0387_004:1095b23_11"
    },
    {
        "source_sentence": "如來弟子，永無憂怖，若無憂怖，云何可壞？",
        "translation": "The disciples of the Tathāgata never have sorrow or fear. If they do not have sorrow or fear, how could they be destroyed?",
        "source": "T12n0387_004:1095b23_12"
    },
    {
        "source_sentence": "不可破壞，如師子群，如來法王，如師子王，純以師子而為眷屬。",
        "translation": "They can't be destroyed like a group of lions, and the Tathāgata is the king of the Dharma, like a lion king, who simply takes lions as his retinue.",
        "source": "T12n0387_004:1095b24_13"
    },
    {
        "source_sentence": "如是眷屬，難可測度，非是聲聞、緣覺境界，不可毀滅，如灰覆火。",
        "translation": "Such an assembly of followers is difficult to fathom. It is not the sphere of sravakas or pratyekabuddhas and cannot be annihilated, like ashes covering a fire.",
        "source": "T12n0387_004:1095b26_14"
    },
    {
        "source_sentence": "如來無上一切智人，若聽剃髮，受具戒者，終無毀禁。",
        "translation": "If the Tathāgata, the supreme omniscience of all wise people, listens to shaving and receives the full set of precepts, there's never a violation of the precepts.",
        "source": "T12n0387_004:1095b27_15"
    },
    {
        "source_sentence": "一切眾生，皆入如來所知境界，是故如來名一切智。",
        "translation": "All sentient beings all enter the sphere known by the Tathāgata, which is why the Tathāgata is called omniscience.",
        "source": "T12n0387_004:1095b28_16"
    },
    {
        "source_sentence": "提婆達多，具足如是，不名壞僧。",
        "translation": "Devadatta, who is fully endowed like this, isn't called a broken monk.",
        "source": "T12n0387_004:1095b29_17"
    },
    {
        "source_sentence": "「大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1095c01_18"
    },
    {
        "source_sentence": "假使千萬無量諸魔，亦不能壞。",
        "translation": "Even if there were a thousand and an incalculable number of Māras, they wouldn't be able to destroy them.",
        "source": "T12n0387_004:1095c01_19"
    },
    {
        "source_sentence": "若言弊惡提婆達多壞眾僧者，當知即是善方便也，云何而言行同畜生？",
        "translation": "If someone says that bad Devadatta disrupts the saṃgha, they should know that this is a good method, so how can they say they're practicing like an animal?",
        "source": "T12n0387_004:1095c02_20"
    },
    {
        "source_sentence": "提婆達多，真實生於釋迦如來淨種姓中，不生畜生。",
        "translation": "Devadatta is really born among the pure castes of the Śākyamuni Tathāgata, and he doesn't give rise to animals.",
        "source": "T12n0387_004:1095c04_21"
    },
    {
        "source_sentence": "若言釋種作諸惡者，無有是處。",
        "translation": "If someone says the Śākyamunis do evil, there's no place for them.",
        "source": "T12n0387_004:1095c05_22"
    },
    {
        "source_sentence": "提婆達多所行惡行，為欲顯示釋迦如來功德力故。",
        "translation": "The bad actions done by Devadatta are intended to show the power of the merits of the Śākyamuni Tathāgata.",
        "source": "T12n0387_004:1095c06_0"
    },
    {
        "source_sentence": "釋種中生名禿人者，亦無是處。",
        "translation": "There's no place for someone born in the Śākyamuni family who's called a baldie.",
        "source": "T12n0387_004:1095c07_1"
    },
    {
        "source_sentence": "提婆達多，善能護持解脫淨戒，云何而言尼乾子耶？",
        "translation": "Devadatta is well able to uphold the pure precepts of liberation, so how can he say he's a Nirgrantha?",
        "source": "T12n0387_004:1095c07_2"
    },
    {
        "source_sentence": "有惡欲者乃名惡人，提婆達多心無惡欲，云何而言惡比丘耶？",
        "translation": "Those with bad desires are called bad people. Devadatta has no bad desires in his mind, so how can he say that he's a bad monk?",
        "source": "T12n0387_004:1095c09_3"
    },
    {
        "source_sentence": "修行如來善方便者，提婆達多即其人也。",
        "translation": "He who cultivates the Tathāgata's good skillful means, Devadatta is that person.",
        "source": "T12n0387_004:1095c10_4"
    },
    {
        "source_sentence": "「大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1095c11_5"
    },
    {
        "source_sentence": "若有人言：『提婆達多集地獄業。』",
        "translation": "Suppose someone says, 'Devadatta gathers the karma of hell.'",
        "source": "T12n0387_004:1095c11_6"
    },
    {
        "source_sentence": "當知即是菩薩業也！",
        "translation": "You should know that this is bodhisattva action!",
        "source": "T12n0387_004:1095c12_7"
    },
    {
        "source_sentence": "菩薩業者，即是神通，為化眾生，故在地獄，當知實亦不處地獄。",
        "translation": "The bodhisattva's actions are supernormal powers, which are intended to transform sentient beings so they're in hell, but you should know that they really aren't in hell.",
        "source": "T12n0387_004:1095c12_8"
    },
    {
        "source_sentence": "譬如二人，道路共行，後各別去，一東一西。",
        "translation": "It's like two people walking together on the road, each going separately after the other, one east and one west.",
        "source": "T12n0387_004:1095c14_9"
    },
    {
        "source_sentence": "若言是人，故和合者，亦無是處；",
        "translation": "If you claim that it is a human being, there is no reason for combining them.",
        "source": "T12n0387_004:1095c15_10"
    },
    {
        "source_sentence": "若言如來、提婆達多，相遠離者，亦無是處。",
        "translation": "If it's said that the Tathāgata and Devadatta are separate from each other, there's no place for them.",
        "source": "T12n0387_004:1095c15_11"
    },
    {
        "source_sentence": "「大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1095c16_12"
    },
    {
        "source_sentence": "有人殺生，造作惡業，法應無量百千世中，地獄受果；",
        "translation": "If someone kills living beings and commits evil deeds, they are bound by the law to experience retribution in hell for countless hundreds of thousands of world ages.",
        "source": "T12n0387_004:1095c17_13"
    },
    {
        "source_sentence": "有人修善，法應無量百千世中，天上受報。",
        "translation": "If someone cultivates goodness, the Dharma should be rewarded in heaven for measureless hundreds of thousands of world ages.",
        "source": "T12n0387_004:1095c18_14"
    },
    {
        "source_sentence": "有修善者，地獄受果；",
        "translation": "Those who cultivate wholesomeness experience retribution in hell.",
        "source": "T12n0387_004:1095c19_15"
    },
    {
        "source_sentence": "行惡之人，天上受報。",
        "translation": "A person who does evil receives the retribution in heaven.",
        "source": "T12n0387_004:1095c19_16"
    },
    {
        "source_sentence": "此乃諸佛如來境界，非諸聲聞、緣覺所知。",
        "translation": "These are the realms of buddhas and tathāgatas, not known by śrāvakas or pratyekbuddhas.",
        "source": "T12n0387_004:1095c20_17"
    },
    {
        "source_sentence": "如來成就無量、微妙、真實功德，云何而言提婆達多能壞佛身？",
        "translation": "The Tathāgata has accomplished immeasurable, subtle, and true merits, so how can we say that Devadatta destroys the Buddha's body?",
        "source": "T12n0387_004:1095c21_18"
    },
    {
        "source_sentence": "實無量世中，於如來所，生惡逆心，提婆達多實無害心。",
        "translation": "In a truly immeasurable number of worlds, bad thoughts arose in the Tathāgata's presence, and Devadatta really had no harmful thoughts.",
        "source": "T12n0387_004:1095c22_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0387_004:1095c23_20"
    },
    {
        "source_sentence": "是人真實決定，了知善惡報故。",
        "translation": "That person's true determination is because they know the results of good and bad actions.",
        "source": "T12n0387_004:1095c23_21"
    },
    {
        "source_sentence": "知一念惡，無量世中，地獄受報。",
        "translation": "Knowing one thought of evil, they'll be reborn in hell for an immeasurable number of worlds.",
        "source": "T12n0387_004:1095c24_22"
    },
    {
        "source_sentence": "以是義故，提婆達多，終不造惡。",
        "translation": "Because of this, Devadatta never did evil.",
        "source": "T12n0387_004:1095c25_23"
    },
    {
        "source_sentence": "「如來已於無量世中，永斷諸惡，云何眾生能於如來起惡心耶？",
        "translation": "The Tathāgata has permanently eliminated evil in measureless worlds, so how can sentient beings give rise to bad thoughts about the Tathāgata?",
        "source": "T12n0387_004:1095c26_24"
    },
    {
        "source_sentence": "若言：『提婆達多是地獄人。』",
        "translation": "Suppose someone says, 'Devadatta is a hell-bent person.'",
        "source": "T12n0387_004:1095c27_25"
    },
    {
        "source_sentence": "云何得與如來法王同一種姓？",
        "translation": "How can they be of the same caste as the Tathāgata Dharma King?",
        "source": "T12n0387_004:1095c28_26"
    },
    {
        "source_sentence": "地獄眾生得與如來同眷屬者，亦無是處。",
        "translation": "It is also unreasonable that the sentient beings in hell should be allowed to have the same retinue as the Tathāgata.",
        "source": "T12n0387_004:1095c28_27"
    },
    {
        "source_sentence": "若言：『提婆達多，無量世中，造作諸惡，應無量世，地獄受報。』",
        "translation": "If someone says, 'Devadatta, there are measureless worlds that create bad things in measureless worlds, and there should be measureless worlds where the retribution of hell is received.'",
        "source": "T12n0387_004:1095c29_28"
    },
    {
        "source_sentence": "云何得與如來一處？",
        "translation": "How can they be in one place with the Tathāgata?",
        "source": "T12n0387_004:1096a02_0"
    },
    {
        "source_sentence": "若與如來同一處者，當知是人，非是弊惡。",
        "translation": "If someone is in the same place as the Tathāgata, you should know that they're not bad or evil.",
        "source": "T12n0387_004:1096a02_1"
    },
    {
        "source_sentence": "若提婆達多真實惡人，云何得與如來和合？",
        "translation": "If Devadatta is really a bad person, how can he be in harmony with the Tathāgata?",
        "source": "T12n0387_004:1096a03_2"
    },
    {
        "source_sentence": "「如彼二人，東、西路乖，理無和合。",
        "translation": "“Suppose those two people are at odds on the east and west paths, and there’s no harmony in principle.",
        "source": "T12n0387_004:1096a04_3"
    },
    {
        "source_sentence": "提婆達多隨順佛語，聞東則東，不違聖旨，云何當名地獄人耶？",
        "translation": "Devadatta followed the Buddha's words, and when he heard east, he went east; not contrary to the noble teaching, how could he be called a hell-dwelling person?",
        "source": "T12n0387_004:1096a05_4"
    },
    {
        "source_sentence": "若令至東，故違西去，則不得名非地獄人。",
        "translation": "If he causes them to go east and therefore goes west in disobedience, they won't be called someone who isn't a prisoner.",
        "source": "T12n0387_004:1096a06_5"
    },
    {
        "source_sentence": "若言：『提婆達多地獄人』者，是無惡人。",
        "translation": "If someone says, 'Devadatta is a hell-bent person,' they're not a bad person.",
        "source": "T12n0387_004:1096a07_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0387_004:1096a08_7"
    },
    {
        "source_sentence": "地者，名人；",
        "translation": "“Earth”: Celestial beings.",
        "source": "T12n0387_004:1096a08_8"
    },
    {
        "source_sentence": "獄者，名天；",
        "translation": "The hells are called heavens.",
        "source": "T12n0387_004:1096a08_9"
    },
    {
        "source_sentence": "往來人天，名地獄人。",
        "translation": "The humans and gods of the past and future are called hell-dwellers.",
        "source": "T12n0387_004:1096a09_10"
    },
    {
        "source_sentence": "復次！",
        "translation": "Furthermore!",
        "source": "T12n0387_004:1096a09_11"
    },
    {
        "source_sentence": "地者，名常；",
        "translation": "“Earth” is called ‘ permanence’.",
        "source": "T12n0387_004:1096a09_12"
    },
    {
        "source_sentence": "獄名無相，提婆達多亦常無相，故名地獄。",
        "translation": "Hell is called signless because Devadatta also always has no signs, and therefore it's called hell.",
        "source": "T12n0387_004:1096a09_13"
    },
    {
        "source_sentence": "復次！",
        "translation": "Furthermore!",
        "source": "T12n0387_004:1096a10_14"
    },
    {
        "source_sentence": "地，名為樂；",
        "translation": "The earth is called bliss.",
        "source": "T12n0387_004:1096a10_15"
    },
    {
        "source_sentence": "獄者，名斷；",
        "translation": "A hell is called stopping.",
        "source": "T12n0387_004:1096a11_16"
    },
    {
        "source_sentence": "樂斷生死，故名地獄。",
        "translation": "It is called hell because it delights in abandoning birth and death.",
        "source": "T12n0387_004:1096a11_17"
    },
    {
        "source_sentence": "復次！",
        "translation": "Furthermore!",
        "source": "T12n0387_004:1096a11_18"
    },
    {
        "source_sentence": "地者，名善方便；",
        "translation": "The stages are called ‘good effort’.",
        "source": "T12n0387_004:1096a12_0"
    },
    {
        "source_sentence": "獄，名能說說善方便，故名地獄。",
        "translation": "Hell is called hell because it can be explained by means of skillful means; therefore, it is called hell.",
        "source": "T12n0387_004:1096a12_1"
    },
    {
        "source_sentence": "「大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1096a13_2"
    },
    {
        "source_sentence": "如來世尊有善方便，復能宣說不名地獄，云何得名提婆達多為地獄人？",
        "translation": "Bhagavān, the Tathāgata has good skillful means to explain that they aren't called hells, so how could they be called Devadatta as a hell being?",
        "source": "T12n0387_004:1096a13_3"
    },
    {
        "source_sentence": "提婆達多所有境界，實非聲聞、緣覺所知。",
        "translation": "The realms that Devadatta has are really not known by śrāvakas or pratyekbuddhas.",
        "source": "T12n0387_004:1096a15_0"
    },
    {
        "source_sentence": "大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1096a15_1"
    },
    {
        "source_sentence": "如來世尊，常所稱讚『黃頭大士』，即是提婆達多比丘。",
        "translation": "The Tathāgata Bhagavān, the Bhagavān, always praised the great man with a yellow head, is the monk Devadatta.",
        "source": "T12n0387_004:1096a16_2"
    },
    {
        "source_sentence": "六群比丘，亦大菩薩，提婆達多與共同行，云何得名地獄人耶？",
        "translation": "Six groups of monks, who are also great bodhisattvas, and Devadatta walk together with them, so how can they be called hell-dwellers?",
        "source": "T12n0387_004:1096a17_3"
    },
    {
        "source_sentence": "如栴檀樹，栴檀圍遶；",
        "translation": "It is like a sandalwood tree surrounded by sandalwood trees.",
        "source": "T12n0387_004:1096a18_4"
    },
    {
        "source_sentence": "如香象蹴踏，非驢所堪，還是香象之所能忍。",
        "translation": "It's like a fragrant elephant kicking and treading, which isn't capable of being tolerated by a donkey but can be tolerated by a fragrant elephant.",
        "source": "T12n0387_004:1096a19_5"
    },
    {
        "source_sentence": "大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1096a20_6"
    },
    {
        "source_sentence": "如來、世尊、大香象王，亦復如是。",
        "translation": "The Tathāgata, the Bhagavān, and the great fragrant elephant king are likewise.",
        "source": "T12n0387_004:1096a20_7"
    },
    {
        "source_sentence": "所說深義，非是二乘之所能知，還是香象諸大菩薩，乃能受持。",
        "translation": "The profound meaning of what's taught is not something that the two vehicles can know, but it's only when great bodhisattvas like fragrant elephants are able to receive and uphold it.",
        "source": "T12n0387_004:1096a21_8"
    },
    {
        "source_sentence": "提婆達多，成就如是無量功德，汝應懺悔、恭敬、供養、尊重、讚歎。",
        "translation": "Devadatta has accomplished such an immeasurable amount of merit, which you should repent, venerate, offer support, honor, and praise.",
        "source": "T12n0387_004:1096a22_9"
    },
    {
        "source_sentence": "「大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1096a24_0"
    },
    {
        "source_sentence": "比丘、比丘尼、優婆塞、優婆夷，能知提婆達多功德，了了不疑，當知是人，",
        "translation": "You should know that monks, nuns, laymen, and laymen who are able to know the virtues of Devadatta without perception or doubt.",
        "source": "T12n0387_004:1096a24_1"
    },
    {
        "source_sentence": "真佛弟子，得佛功德二分之一，得佛一目，得佛半身。",
        "translation": "A true disciple of the Buddha attains one-sixth of the Buddha's merit, and if he attains one eye of the Buddha, he attains half a Buddha's body.",
        "source": "T12n0387_004:1096a25_2"
    },
    {
        "source_sentence": "大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1096a27_0"
    },
    {
        "source_sentence": "提婆達多所有功德，一切眾生，所不能知；",
        "translation": "The virtues of Devadatta were unknowable to all sentient beings.",
        "source": "T12n0387_004:1096a27_1"
    },
    {
        "source_sentence": "如來功德，所有境界，一切眾生，亦不能知，復不能見如來法身。",
        "translation": "All sentient beings cannot know the sphere of the Buddha’s virtues, nor can they see the Dharma body of the enlightened.",
        "source": "T12n0387_004:1096a28_2"
    },
    {
        "source_sentence": "「大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1096a29_3"
    },
    {
        "source_sentence": "提婆達多，真實能知，如來所有微妙功德，聲聞、緣覺實所不知。",
        "translation": "Devadatta is truly able to know, and the subtle virtues of the Tathāgata's possessions are really unknown to śrāvakas and pratyekbuddhas.",
        "source": "T12n0387_004:1096a29_4"
    },
    {
        "source_sentence": "惟有提婆達多，了了不疑，亦能示現如來所現無量神通，能示眾生如來所行，",
        "translation": "Only Devadatta, without perception or doubt, can show the infinite spiritual powers manifested by the enlightened. He can show sentient beings what the enlightened do.",
        "source": "T12n0387_004:1096b02_5"
    },
    {
        "source_sentence": "知佛如來所有國土。",
        "translation": "He knows all the lands of the Buddha Tathāgata's land.",
        "source": "T12n0387_004:1096b04_0"
    },
    {
        "source_sentence": "提婆達多，是大丈夫，如來所遊，在在處處，提婆達多，亦隨逐行。",
        "translation": "Devadatta is a great man, whom the Tathāgata travels to wherever he may be. Devadatta also follows him.",
        "source": "T12n0387_004:1096b04_1"
    },
    {
        "source_sentence": "以是義，故名大丈夫。",
        "translation": "Because of this meaning, he's called a great man.",
        "source": "T12n0387_004:1096b05_2"
    },
    {
        "source_sentence": "諸佛如來，境界甚深，祕密之言，不可思議！",
        "translation": "The buddha-tathāgatas have profound spheres, and their esoteric sayings are inconceivable!",
        "source": "T12n0387_004:1096b06_3"
    },
    {
        "source_sentence": "惟有提婆達多比丘，能得了知。",
        "translation": "Only the monk Devadatta knows this.",
        "source": "T12n0387_004:1096b07_4"
    },
    {
        "source_sentence": "如來今者，當開密語，仁可善聽！」",
        "translation": "Now, the Tathāgata will reveal his esoteric sayings, so listen well!",
        "source": "T12n0387_004:1096b08_0"
    },
    {
        "source_sentence": "「假使魔波旬，　　其數無有量，",
        "translation": "“Suppose Māra Pāpīyān, whose number is immeasurable,",
        "source": "T12n0387_004:1096b08_1"
    },
    {
        "source_sentence": "　盡其神通力，　　不能壞眾僧。",
        "translation": "To the extent of their supernatural powers They cannot destroy the Sangha.",
        "source": "T12n0387_004:1096b08_1"
    },
    {
        "source_sentence": "　如來無上尊！　　大慈憐愍心，",
        "translation": "The Tathāgata, the supreme honored one, has great compassion and kindness.",
        "source": "T12n0387_004:1096b08_1"
    },
    {
        "source_sentence": "　為諸眾生故，　　示現業果報。」",
        "translation": "For the sake of sentient beings, they show the results of their actions.",
        "source": "T12n0387_004:1096b08_1"
    },
    {
        "source_sentence": "爾時，大眾異口同音，而讚頌曰：爾時，世尊讚歎大雲密藏菩薩摩訶薩言：「善哉善哉！",
        "translation": "At that point, the masses spoke with one voice and praised him, saying, At that point, the Bhagavān praised the great cloud-mysterious store bodhisattva Mahāsattva, saying, Good, good!",
        "source": "T12n0387_004:1096b08_1"
    },
    {
        "source_sentence": "汝今快說，提婆達多真實功德，一切聲聞、辟支佛等，不能解了大乘方等功德勢力。",
        "translation": "Now, you must quickly explain that Devadatta's true merit is so great that all śrāvakas and pratyekbuddhas can't understand the power of the great vehicle's relative merit.",
        "source": "T12n0387_004:1096b15_2"
    },
    {
        "source_sentence": "汝將欲壞一切眾生所有疑心，是故開顯提婆達多菩薩功德。",
        "translation": "You will want to destroy the doubts of all sentient beings, so you'll reveal the virtues of Devadatta Bodhisattva.",
        "source": "T12n0387_004:1096b17_3"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T12n0387_004:1096b19_0"
    },
    {
        "source_sentence": "此經復有諸佛菩薩深進大海水潮三昧，若有菩薩，成就、具足是三昧者，",
        "translation": "“Furthermore, in this scripture there are buddhas and bodhisattvas who enter deeply into the great ocean of concentration called ‘tide-samādhi.’ If a bodhisattva accomplishes and perfects this concentration,",
        "source": "T12n0387_004:1096b19_1"
    },
    {
        "source_sentence": "須彌山王，高大堅鞕，能以口吹，令其碎破猶如微塵，入葶藶糩，而亭歷糩亦不增長。",
        "translation": "Mount Sumeru, the king of mountains, is as high and strong as a tiny particle of dust. It can blow with its mouth to cause it to break apart like atoms that enter into mounds but neither does the mound grow in size.",
        "source": "T12n0387_004:1096b20_2"
    },
    {
        "source_sentence": "四大天王，亦不驚怖、不破、不壞，不自覺知，所安之處，三十三天，",
        "translation": "The four great celestial kings were not frightened, did not break down, and did not disintegrate. They did not know for themselves where the thirty-three gods dwelled.",
        "source": "T12n0387_004:1096b22_3"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T12n0387_004:1096b24_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_004:1096b24_5"
    },
    {
        "source_sentence": "是名菩薩成就具足深進大海水潮三昧。",
        "translation": "This is called the bodhisattva's accomplishment of the profound ocean-ocean tide samādhi.",
        "source": "T12n0387_004:1096b24_6"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T12n0387_004:1096b25_7"
    },
    {
        "source_sentence": "若有菩薩成就具足是三昧者，以四大海水入一毛孔，不嬈黿鼉、龜龍魚鼈水性之屬，",
        "translation": "Suppose there is a bodhisattva who, having perfected this concentration, enters into one pore with the four great oceans of water without disturbing the water-quality of turtles, tortoises, nāgas, and frogs.",
        "source": "T12n0387_004:1096b25_8"
    },
    {
        "source_sentence": "壽命如常，無有損夭。",
        "translation": "Their life spans are as usual and there is no danger of dying.",
        "source": "T12n0387_004:1096b27_9"
    },
    {
        "source_sentence": "諸龍王、阿修羅、乾闥婆，不自覺知，所至之處。",
        "translation": "The dragon kings, asuras, and gandharvas didn't know for themselves where they were going.",
        "source": "T12n0387_004:1096b28_10"
    },
    {
        "source_sentence": "能以三千大千世界，安置右掌，斷取大地，如陶家輪，擲置他方恒沙界外，",
        "translation": "He can place the 3,000 great one-thousand worlds in his right palm, cut off the earth and take it away like a potter’s wheel and toss it outside the realm of the sands of the Ganges.",
        "source": "T12n0387_004:1096b29_11"
    },
    {
        "source_sentence": "其中眾生，都不覺有往來之想；",
        "translation": "The sentient beings therein did not even perceive the thought of going or coming.",
        "source": "T12n0387_004:1096c01_12"
    },
    {
        "source_sentence": "取彼世界安置此土，亦復如是。」",
        "translation": "So it is when you take that world and place it in this land.",
        "source": "T12n0387_004:1096c02_13"
    },
    {
        "source_sentence": "爾時，善德以諸香、華、幡蓋、伎樂供養於佛，合掌恭敬，白佛言：「世尊大慈，",
        "translation": "It was then that Sudarśana offered incense, flowers, banners, canopies, and music to the Buddha. Paying respect with joined palms, he said to him:",
        "source": "T12n0387_004:1096c04_0"
    },
    {
        "source_sentence": "憐愍一切如羅睺羅，今欲啟請，惟願聽許。」",
        "translation": "I have pity for all of them like Rāhula, and now I want to ask permission, so please listen.",
        "source": "T12n0387_004:1096c05_1"
    },
    {
        "source_sentence": "爾時，世尊默然不答。",
        "translation": "At that point, the Bhagavān remained silent and didn't answer.",
        "source": "T12n0387_004:1096c06_2"
    },
    {
        "source_sentence": "是時，眾中有梨車童子，名曰一切眾生樂見，語善德言：「如來默然，",
        "translation": "At that time, there was a Licchavi youth in the assembly, named Sarvasaṃdarśana.",
        "source": "T12n0387_004:1096c07_0"
    },
    {
        "source_sentence": "已不相許。",
        "translation": "They won't allow each other.",
        "source": "T12n0387_004:1096c08_1"
    },
    {
        "source_sentence": "我今當答，隨疑致問。」",
        "translation": "I will now answer, and ask questions according to your doubts.",
        "source": "T12n0387_004:1096c08_2"
    },
    {
        "source_sentence": "婆羅門言：「梨車！",
        "translation": "The Brāhmaṇa said, Licchavi!",
        "source": "T12n0387_004:1096c09_3"
    },
    {
        "source_sentence": "我曾從他，聞如是義：『若能供養如來舍利如芥子許，福報應得忉利天主。』",
        "translation": "I once heard this from someone else, saying, 'If you can make offerings to the Tathāgata's relics like a mustard seed, the reward of good fortune will be that you'll attain the lord of Trāyastriṃśa Heaven.'",
        "source": "T12n0387_004:1096c09_4"
    },
    {
        "source_sentence": "梨車！",
        "translation": "Licchavi Vimalakīrti!",
        "source": "T12n0387_004:1096c11_5"
    },
    {
        "source_sentence": "是《大雲經》，其義甚深，如來密語，難可得解，非諸聲聞、緣覺所知，",
        "translation": "The meaning of this Mahāprajñāpāramitā-sūtra is so profound that it is difficult to understand the esoteric sayings of the Tathāgata, which are not known by śrāvakas and pratyekbuddhas.",
        "source": "T12n0387_004:1096c11_6"
    },
    {
        "source_sentence": "何況我等邊地之人？",
        "translation": "How could it be possible for us, the people of marginal lands?",
        "source": "T12n0387_004:1096c12_7"
    },
    {
        "source_sentence": "我今欲得如來舍利如芥子許，恭敬禮拜，冀處忉利，為彼天主。",
        "translation": "I now wish to obtain the relics of the Tathāgata as small as a grain of mustard seed. With respect and veneration, I hope to live in Trāyastriṃśa Heaven as lord of that heaven.",
        "source": "T12n0387_004:1096c13_8"
    },
    {
        "source_sentence": "我從昔來，常有此願。」",
        "translation": "Since the distant past, I've always had this vow.",
        "source": "T12n0387_004:1096c14_9"
    },
    {
        "source_sentence": "「假使恒河中，　　駛流生蓮花，",
        "translation": "“Suppose a lotus blossom were to grow in the Ganges River.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　拘抧羅鳥白，　　舍利乃可得；",
        "translation": "The koṭina bird is white, but the relics can be obtained.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　假使龜生毛，　　任作僧伽梨，",
        "translation": "Suppose a turtle grows hair and leaves it to make a monk's robe.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　冬日能消氷，　　舍利乃可得；",
        "translation": "If one can remove the ice in the winter, One will be able to obtain the relics.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　假使蚊子脚，　　堪任作橋梁，",
        "translation": "Suppose a  mosquito's feet are capable of building a bridge,",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　能度一切眾，　　舍利乃可得；",
        "translation": "If you can save all the people, The relics will be obtained.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　假使水中蛭，　　忽然生白齒，",
        "translation": "Suppose there's a leech in water that suddenly produces white teeth,",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　大如香象牙，　　舍利乃可得；",
        "translation": "The relics are as large as fragrant elephant tusks, And they can be obtained.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　假使兔生角，　　堪任作梯橙，",
        "translation": "Suppose a rabbit gives rise to horns and is capable of becoming a ladder or an orange.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　高至淨居天，　　舍利乃可得；",
        "translation": "The relic bones can be found as high as the highest heaven in the realm of the Pure Land.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　假使鼠、蟲等，　　緣於兔角梯，",
        "translation": "Suppose rats, insects, and so forth are conditioned by the horns of a rabbit's ladder.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　在上而食月，　　舍利乃可得；",
        "translation": "If you go upward and eat for a month, You will be able to obtain the relics.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　假使蠅能飲，　　鍾石淳好酒，",
        "translation": "Even if the flies were able to drink it, The crystal and stones would be pure and good wine.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　迷荒而耽醉，　　舍利乃可得；",
        "translation": "Being lost in the wilderness and addicted to drunkenness, The relics can be obtained.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　假使驢口脣，　　形如頻婆果，",
        "translation": "Suppose a donkey's mouth and lips are shaped like the fruit of vipaśyanā,",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　善能歌詠舞，　　舍利乃可得；",
        "translation": "Able to sing and dance well, the relics can be obtained.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　假使烏角鵄，　　同共一樹棲，",
        "translation": "Suppose a crow with horns and ants were to live together in the same tree.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　飲食不相離，　　舍利乃可得；",
        "translation": "When the food and drink are not separated, The relics can be obtained.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　假使棘刺葉，　　周遍覆三千，",
        "translation": "Even if it were covered with thorns and thorn leaves, It would cover the whole trichiliocosm.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　大千世界上，　　舍利乃可得；",
        "translation": "In the great chiliocosm, The relics can be found.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　假使小舟船，　　能載須彌山，",
        "translation": "Suppose a small boat can carry Mount Sumeru.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　度於大海水，　　舍利乃可得；",
        "translation": "By crossing the great sea, one can obtain the relics.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　假使小鳥雀，　　[口*(隹\\/乃)]銜大香山，",
        "translation": "Suppose a small bird were to [mouth*(an\\/nai)] call it the great fragrant mountain.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　移置於他處，　　舍利乃可得。」",
        "translation": "If you move it to another place, the relics will be obtained.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "「善哉！梨車子！　　能知深方便，",
        "translation": "“Splendid, Licchavi Ratnākara, that you are able to know profound skill in means.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　今當至心聽，　　我說佛功德。",
        "translation": "Listen attentively as I explain the virtues of buddhahood.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　佛境難思議，　　所得已畢竟；",
        "translation": "The realm of buddhahood is inconceivable; It has already been attained.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　諸佛常無變，　　是故無生處；",
        "translation": "Because the Buddhas are always unchanging, Therefore they have no place of birth.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　諸佛色平等，　　是名佛法界；",
        "translation": "The equality of all buddhas’ forms is called the buddha-dharma realm.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　如來非作法，　　亦復非有生；",
        "translation": "The Enlightened One does not create things, Nor does he have birth.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　如來金剛身，　　不可得破壞，",
        "translation": "The adamantine body of the enlightened cannot be broken.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　以是故舍利，　　真實不可得。",
        "translation": "Because of this, the relics are really ungraspable.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　如來無舍利，　　乃至如芥子，",
        "translation": "The Tathāgata has no relics, even like a mustard seed.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　無有血、肉、骨，　　云何有舍利？",
        "translation": "If there's no blood, flesh, or bone, how could there be a relic?",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　如來為眾生，　　現受方便身，",
        "translation": "For the sake of sentient beings, the Tathāgata now receives the body of skillful means.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　諸佛身常住，　　法界亦復然。",
        "translation": "The bodies of the Buddhas are always abiding, So is the realm of reality.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　隨應諸眾生，　　方便為說法，",
        "translation": "He teaches the Dharma to sentient beings according to their needs, using skillful means.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　亦隨其所宜，　　而現種種身。",
        "translation": "They also manifest various bodies According to their needs and capacities.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　若佛有慈愍，　　普及諸眾生，",
        "translation": "If the Buddha has compassion, He extends it to all sentient beings.",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "　何故不見為，　　分身施舍利？」",
        "translation": "Why don't you see that it's for the sake of dividing your body into a gift of relics?",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "爾時，梨車即說偈言：時，婆羅門即說偈頌，答梨車言：爾時，眾中有一天女，",
        "translation": "At that moment, the Licchavi Vimalakīrti spoke these verses:",
        "source": "T12n0387_004:1096c15_10"
    },
    {
        "source_sentence": "名曰淨光，復以香、華、幡蓋、伎樂供養於佛，合掌恭敬，白佛言：「世尊！",
        "translation": "His name was Jingwang, and he also offered incense, flowers, banners, canopies, and music to the Buddha, joined his palms in respect, and said to him, Bhagavān!",
        "source": "T12n0387_004:1097a28_11"
    },
    {
        "source_sentence": "如是二賢，成就甚深、微妙智慧，能開如來祕密之藏，從何處來？",
        "translation": "Thus, these two good men had perfected profound and subtle wisdom that opened the secret treasury of the enlightened. Where did they come from?",
        "source": "T12n0387_004:1097a29_12"
    },
    {
        "source_sentence": "惟願演說！」",
        "translation": "May it be explained!",
        "source": "T12n0387_004:1097b02_13"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_004:1097b02_14"
    },
    {
        "source_sentence": "天女！",
        "translation": "Dear goddess!",
        "source": "T12n0387_004:1097b02_15"
    },
    {
        "source_sentence": "汝為眾生，故問是義，諦聽諦聽！",
        "translation": "Because you ask this question for the sake of sentient beings, listen closely and carefully!",
        "source": "T12n0387_004:1097b03_16"
    },
    {
        "source_sentence": "吾當說之。",
        "translation": "I will explain it.",
        "source": "T12n0387_004:1097b03_17"
    },
    {
        "source_sentence": "如是二人，是佛真子；",
        "translation": "These two people are the true offspring of Buddha.",
        "source": "T12n0387_004:1097b04_0"
    },
    {
        "source_sentence": "如香象王，是大丈夫。",
        "translation": "It's like the fragrant elephant king, which is a great man.",
        "source": "T12n0387_004:1097b04_1"
    },
    {
        "source_sentence": "為眾生故，樂處生死；",
        "translation": "For the sake of sentient beings they experience birth and death in happy places.",
        "source": "T12n0387_004:1097b04_2"
    },
    {
        "source_sentence": "知恩報恩，我所護念。",
        "translation": "Knowing kindness and repaying kindness, I'll guard it.",
        "source": "T12n0387_004:1097b05_3"
    },
    {
        "source_sentence": "善能護持諸佛種姓，為佛重任熾燃法燈。",
        "translation": "He's good at preserving the seed castes of the buddhas, and he blazes the lamp of the Dharma for the Buddha's sake.",
        "source": "T12n0387_004:1097b05_4"
    },
    {
        "source_sentence": "「天女！",
        "translation": "“O goddess!",
        "source": "T12n0387_004:1097b06_5"
    },
    {
        "source_sentence": "過去無量億那由他阿僧祇劫，爾時有佛，號同性燈如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "In the past, incalculable millions of eons ago, there was a Buddha named Samantabhadra Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Unsurpassed, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavān.",
        "source": "T12n0387_004:1097b06_6"
    },
    {
        "source_sentence": "時，閻浮提多有眾生，無量無邊，不可算數，悉皆成就安隱快樂，無諸飢渴、苦惱等患。",
        "translation": "At the time, there were so many sentient beings in Jambudvīpa, who were immeasurable, limitless, and incalculable, all accomplishing peace and happiness without hunger, thirst, pain, and other afflictions.",
        "source": "T12n0387_004:1097b09_7"
    },
    {
        "source_sentence": "其地廣博，清淨嚴事，廣縱六萬八千由旬，多有諸城七萬八千，一一大城，",
        "translation": "The ground is wide and extensive, pure and beautifully adorned. Sixty-eight thousand yojanas in width and sixty-eight thousand yojanas long and wide, it consists of seventy-eight thousand cities.",
        "source": "T12n0387_004:1097b11_8"
    },
    {
        "source_sentence": "七寶所作，其城四壁，有九萬却敵。",
        "translation": "The four walls of the city were made of the seven kinds of treasure and contained 90,000 resisting enemies.",
        "source": "T12n0387_004:1097b13_9"
    },
    {
        "source_sentence": "「爾時，大城名曰寶聚，即是今之王舍城也。",
        "translation": "“At the time, the great city was named Baoju, which is the present-day Rājagṛha.",
        "source": "T12n0387_004:1097b15_0"
    },
    {
        "source_sentence": "時寶聚城有八萬千億人，同姓燈佛出生彼城，彼城所有無量眾生，悉發阿耨多羅三藐三菩提心，",
        "translation": "At that time there were eighty-thousand myriads of koṭis of people in the city Jeweled Mass. The buddha Dīpaṅkara Buddha, a buddha named Candracchattra, was born in that city. Innumerable sentient beings in that city all conceived the spirit of unexcelled, perfect enlightenment.",
        "source": "T12n0387_004:1097b15_1"
    },
    {
        "source_sentence": "成就神通，人中象王。",
        "translation": "He had perfected his supernatural powers and was the elephant king among men.",
        "source": "T12n0387_004:1097b18_2"
    },
    {
        "source_sentence": "「天女！",
        "translation": "“O goddess!",
        "source": "T12n0387_004:1097b18_3"
    },
    {
        "source_sentence": "爾時，如來在大眾中，作師子吼，宣說如是大雲經典。",
        "translation": "At the time, the Tathāgata was in the midst of the crowd, making a lion's roar and proclaiming this great cloud scripture.",
        "source": "T12n0387_004:1097b18_4"
    },
    {
        "source_sentence": "時，彼城中有王，名曰大精進龍王，王有夫人，名曰護法，有一大臣，",
        "translation": "At that time, there was a king named Mahāsudassana-nāga-rāja in that city. The king had a queen named Dharmapāla, who was the first wife of the king.",
        "source": "T12n0387_004:1097b19_5"
    },
    {
        "source_sentence": "名法林聚。",
        "translation": "It's called the Dharma forest cluster.",
        "source": "T12n0387_004:1097b21_6"
    },
    {
        "source_sentence": "爾時，國王與其夫人及其大臣，往彼佛所，供養恭敬，合掌作禮，右遶三匝，",
        "translation": "The king of that country, together with his wife and ministers, went to the place where the Buddha was staying. After paying their respects to him, they joined their palms in prostration and circumambulated him three times to his right.",
        "source": "T12n0387_004:1097b21_7"
    },
    {
        "source_sentence": "却坐一面。",
        "translation": "He sat to one side.",
        "source": "T12n0387_004:1097b23_8"
    },
    {
        "source_sentence": "爾時，同姓燈佛，知大精進龍王心中所念，放大光明，名無所畏。",
        "translation": "Knowing what he thought in his mind, the great zealous dragon king, the lamp-light buddha of the same name and surname, radiated a bright light called fearlessness.",
        "source": "T12n0387_004:1097b23_9"
    },
    {
        "source_sentence": "王遇此光，心得法喜。",
        "translation": "When the king saw this ray of light, he was delighted at heart and his mind was filled with joy in regard to the Dharma.",
        "source": "T12n0387_004:1097b24_10"
    },
    {
        "source_sentence": "爾時，大臣承佛神力，白佛言：『世尊！",
        "translation": "At that point, the minister, relying on the Buddha's miraculous powers, said to the Buddha, 'Bhagavān!",
        "source": "T12n0387_004:1097b25_11"
    },
    {
        "source_sentence": "如來舍利為可得不？』",
        "translation": "Is the relics of the Tathāgata obtainable?'",
        "source": "T12n0387_004:1097b26_12"
    },
    {
        "source_sentence": "爾時，世尊默然不答。",
        "translation": "At that point, the Bhagavān remained silent and didn't answer.",
        "source": "T12n0387_004:1097b26_13"
    },
    {
        "source_sentence": "「天女！",
        "translation": "“O goddess!",
        "source": "T12n0387_004:1097b27_0"
    },
    {
        "source_sentence": "爾時，大王為正法故，即共大臣，翻覆往反，論講舍利。",
        "translation": "It was then that the great king, for the sake of the right teaching, went back and forth with his ministers to discuss Śāriputra's relics.",
        "source": "T12n0387_004:1097b27_1"
    },
    {
        "source_sentence": "時佛聞已，即讚歎言：『善哉善哉！』",
        "translation": "After hearing this, the Buddha praised it, saying, 'Good, good!'",
        "source": "T12n0387_004:1097b28_2"
    },
    {
        "source_sentence": "彼佛眾中，有大弟子，字摩訶男，心生善欲，而作是念：『善哉！",
        "translation": "Among those buddhas, there was a great disciple named Mahāprajñāpāramitā, whose mind gave rise to good desires and thought, 'Good!'",
        "source": "T12n0387_004:1097b29_3"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T12n0387_004:1097c01_4"
    },
    {
        "source_sentence": "善解如來甚深法界。』",
        "translation": "He well understands the profound Dharma realm of the Tathāgata.'",
        "source": "T12n0387_004:1097c01_5"
    },
    {
        "source_sentence": "時，佛即為時會大眾，說王所解深法妙義，大眾已聞，皆生驚疑。",
        "translation": "The Buddha then assembled the crowd for the occasion and explained the marvelous meaning of the profound teaching that the king understood. Having heard it, the crowd became frightened and doubted.",
        "source": "T12n0387_004:1097c01_6"
    },
    {
        "source_sentence": "時，佛即告諸大眾言：『此王功德，不可思議，深不可測，非是汝等，",
        "translation": "Then the Buddha said to the great assembly: The virtues of this king are inconceivable, profound and unfathomable. It is not yours.",
        "source": "T12n0387_004:1097c03_7"
    },
    {
        "source_sentence": "所能得解。』",
        "translation": "He's able to attain understanding.'",
        "source": "T12n0387_004:1097c04_8"
    },
    {
        "source_sentence": "爾時，大王聞佛稱讚己之功德，心大歡喜，即起供養，右遶千匝，以採寶華，",
        "translation": "At that time, having heard the Buddha praise his merits, the great king was greatly delighted. Then he made offerings to the Buddha and circumambulated him one thousand times to his right in order to gather precious flowers.",
        "source": "T12n0387_004:1097c05_0"
    },
    {
        "source_sentence": "用散佛上，而復讚嘆，即發願言：『未來當有釋迦如來興出於世，以大方便示法滅時，",
        "translation": "They scattered it over the Buddha and again praised him. They then made the following vow: In the future there will be a buddha named Sakka Tathāgata who appears in the world to show us with great skillful means how the Dharma may cease.",
        "source": "T12n0387_004:1097c06_1"
    },
    {
        "source_sentence": "我當於中出家修道，受持淨戒，具大勢力。",
        "translation": "I will renounce the householder’s life in this monastery and practice Buddhism. Observing pure precepts, I will be endowed with great vigor.",
        "source": "T12n0387_004:1097c08_2"
    },
    {
        "source_sentence": "見有破戒、行惡比丘，我當驅擯，至於邊方無佛法處。",
        "translation": "If I see any monks who have broken the precepts and committed evil deeds, I will drive them away and drive them to the perimeter where there is no buddha-dharma.",
        "source": "T12n0387_004:1097c09_3"
    },
    {
        "source_sentence": "為正法故，不惜身命。』",
        "translation": "For the sake of the right teaching, he doesn't spare his life.'",
        "source": "T12n0387_004:1097c10_4"
    },
    {
        "source_sentence": "爾時，大臣復作是願：『釋迦如來以大方便現涅槃已，我當於中作大國王，",
        "translation": "At that time, the ministers again made this vow: Once the Buddha has manifested nirvana through great skillful means, I will be king among them.",
        "source": "T12n0387_004:1097c11_5"
    },
    {
        "source_sentence": "護持如來無上正法。",
        "translation": "He protects the unsurpassed true teaching of the Tathāgata.",
        "source": "T12n0387_004:1097c12_6"
    },
    {
        "source_sentence": "見惡比丘，唱令驅出；",
        "translation": "When they saw evil bhikṣus, they called out to expel them.",
        "source": "T12n0387_004:1097c13_7"
    },
    {
        "source_sentence": "有持法者，恭敬供養。』",
        "translation": "Those who uphold the teaching will be honored and offered support.'",
        "source": "T12n0387_004:1097c13_8"
    },
    {
        "source_sentence": "是時，夫人復作是願：『釋迦如來出現之時，令我勢力，能伏邪見。』",
        "translation": "The lady then again made this vow, 'When the Tathāgata Śākyamuni appears, let me have the power to subdue wrong views.'",
        "source": "T12n0387_004:1097c14_9"
    },
    {
        "source_sentence": "時，摩訶男復作是願：『使我爾時，為彼如來作大弟子，得大神通，於佛功德，",
        "translation": "“At that time Mahāprajāpatīṇa again made the following vow:",
        "source": "T12n0387_004:1097c15_10"
    },
    {
        "source_sentence": "能師子吼。』",
        "translation": "He can make a lion's roar.'",
        "source": "T12n0387_004:1097c17_11"
    },
    {
        "source_sentence": "「天女！",
        "translation": "“O goddess!",
        "source": "T12n0387_004:1097c17_12"
    },
    {
        "source_sentence": "如是四人，今於我世，為法重任。",
        "translation": "Thus, these four people are now in my world, which is a heavy burden for the Dharma.",
        "source": "T12n0387_004:1097c17_13"
    },
    {
        "source_sentence": "不但今日，方於未來，復當護持我之正法。」",
        "translation": "Not only today, but in the future, you'll also protect my right teaching.",
        "source": "T12n0387_004:1097c18_14"
    },
    {
        "source_sentence": "是時，天女即白佛言：「我今未知，如是四人，斯為是誰？",
        "translation": "The goddess then said to the Buddha, Now I don't know who these four people are.",
        "source": "T12n0387_004:1097c19_15"
    },
    {
        "source_sentence": "惟願如來，說其名字。」",
        "translation": "May the Tathāgata explain his name.",
        "source": "T12n0387_004:1097c20_16"
    },
    {
        "source_sentence": "佛言：「善哉天女！",
        "translation": "The Buddha said, Good, goddess!",
        "source": "T12n0387_004:1097c20_17"
    },
    {
        "source_sentence": "至心諦聽諦聽！",
        "translation": "Listen attentively, and listen attentively!",
        "source": "T12n0387_004:1097c21_18"
    },
    {
        "source_sentence": "吾當為汝，分別解說。",
        "translation": "I will explain it for you in a discriminating way.",
        "source": "T12n0387_004:1097c21_19"
    },
    {
        "source_sentence": "爾時大臣，即今善德婆羅門是。",
        "translation": "The minister at that time was the present-day Bhadanta Brahman.",
        "source": "T12n0387_004:1097c22_20"
    },
    {
        "source_sentence": "是婆羅門，於我滅後百二十年，王閻浮提，字阿叔迦，住於波梨弗羅城中，",
        "translation": "One hundred and twenty years after my nirvana, that brahman king of Jambudvfpa, named Asoka, lived in the city of Pariputra.",
        "source": "T12n0387_004:1097c22_21"
    },
    {
        "source_sentence": "姓無邪氏，得轉輪王所有福德二分之一，於閻浮提得大自在；",
        "translation": "Their clansmen were free from wickedness. They obtained one-sixth of the virtues of universal monarchs and attained great sovereignty in Jambudvfpa.",
        "source": "T12n0387_004:1097c24_22"
    },
    {
        "source_sentence": "護持正法，大師子吼，為法流布，大得舍利，供養、恭敬、尊重、讚嘆，",
        "translation": "In order to preserve the true-dharma, the great lion roars and spreads it for the sake of the dharma. He obtains a great deal of relics that are offered in homage, respected, venerated, honored, and praised.",
        "source": "T12n0387_004:1097c25_23"
    },
    {
        "source_sentence": "見惡比丘，治令修善。」",
        "translation": "Seeing bad monks, he treats them and causes them to cultivate goodness.",
        "source": "T12n0387_004:1097c27_24"
    },
    {
        "source_sentence": "天女復言：「惟願解說。」",
        "translation": "The goddess again said, Please explain it.",
        "source": "T12n0387_004:1097c27_25"
    },
    {
        "source_sentence": "爾時，佛告天女：「且待須臾，我今先當說汝因緣。」",
        "translation": "It was then that the Buddha addressed the goddess, Wait a moment, for which I'll first explain your causes and conditions.",
        "source": "T12n0387_004:1097c28_26"
    },
    {
        "source_sentence": "是時，天女聞是說已，即生慚愧，低頭伏地。",
        "translation": "After hearing these words, the goddess became ashamed and bowed her head to the ground.",
        "source": "T12n0387_004:1097c29_27"
    },
    {
        "source_sentence": "佛即讚言：「善哉善哉！",
        "translation": "The Buddha then praised him, saying, Good, good!",
        "source": "T12n0387_004:1098a01_28"
    },
    {
        "source_sentence": "夫慚愧者，即是眾生善法衣服。",
        "translation": "Ashamedness is the clothing of sentient beings who are good-dharma.",
        "source": "T12n0387_004:1098a01_29"
    },
    {
        "source_sentence": "天女！",
        "translation": "Dear goddess!",
        "source": "T12n0387_004:1098a02_30"
    },
    {
        "source_sentence": "時王夫人，即汝身是。",
        "translation": "The king's wife then, that is, you yourself.",
        "source": "T12n0387_004:1098a02_31"
    },
    {
        "source_sentence": "汝於彼佛，暫得一聞《大涅槃經》，以是因緣，今得天身，值我出世，",
        "translation": "Because of these causes and conditions, you have now attained the body of a heavenly being to appear in the world just as I did.",
        "source": "T12n0387_004:1098a03_0"
    },
    {
        "source_sentence": "復聞深義，捨是天形，即以女身，當王國土，得轉輪王所統領處四分之一；",
        "translation": "Having heard the profound doctrine again, he relinquished his heavenly form and assumed the form of a woman. The king’s land became one-quarter of the territory ruled by wheel-turning kings.",
        "source": "T12n0387_004:1098a04_1"
    },
    {
        "source_sentence": "得大自在，受持五戒，作優婆夷，教化所屬城邑、聚落，男子、女人、大小。",
        "translation": "They attain great freedom, observe the five precepts, become laymen, and teach cities and villages that belong to them, men, women, and large and small.",
        "source": "T12n0387_004:1098a06_2"
    },
    {
        "source_sentence": "受持五戒，守護正法，摧伏外道諸邪異見。",
        "translation": "He observes the five precepts, guards the right teaching, and suppresses the mistaken and divergent views of non-Buddhists.",
        "source": "T12n0387_004:1098a07_3"
    },
    {
        "source_sentence": "汝於爾時，實是菩薩，為化眾生，現受女身。",
        "translation": "At the time, you were really a bodhisattva who manifested yourself as a woman in order to transform sentient beings.",
        "source": "T12n0387_004:1098a08_4"
    },
    {
        "source_sentence": "是時王者，即今一切眾生樂見梨車子。",
        "translation": "The king then, that is, all sentient beings now delight in seeing Licchavi.",
        "source": "T12n0387_004:1098a09_5"
    },
    {
        "source_sentence": "是深達正法甚深之義，能開如來微密法藏，護持佛法，無所虧損。",
        "translation": "This profoundly understands the profound meaning of the true teaching and can open the Tathāgata's subtle, esoteric store of the Dharma that protects the Buddha's teaching without fail.",
        "source": "T12n0387_004:1098a10_6"
    },
    {
        "source_sentence": "時摩訶男者，即今大雲密藏菩薩是，得我真身二分之一，知恩報恩，護持正法，",
        "translation": "“At that time Mahāprajāpatīṇa, the great enlightening being Great Cloud of Mysterious Treasury, who had attained one-sixth of the two parts of my true body, knew kindness and repayed kindness, preserving the true teaching.",
        "source": "T12n0387_004:1098a11_7"
    },
    {
        "source_sentence": "能答深義，無所滯礙。",
        "translation": "They can answer the profound meaning without any obstruction.",
        "source": "T12n0387_004:1098a13_8"
    },
    {
        "source_sentence": "天女！",
        "translation": "Dear goddess!",
        "source": "T12n0387_004:1098a14_9"
    },
    {
        "source_sentence": "我今此眾，雖有上智大迦葉等，不能宣辯甚深之義，如大雲密藏菩薩摩訶薩也。」",
        "translation": "Although there are people like Mahākāśyapa and others of superior wisdom in this assembly, I can't explain the profound meaning of it, just like the great bodhisattva Mahāsattva of the Mysterious Treasury of Clouds.",
        "source": "T12n0387_004:1098a14_10"
    },
    {
        "source_sentence": "爾時，眾中有一天子，字曰奇才，與千天子，即起向佛，以諸華、香、幡蓋、伎樂供養於佛，",
        "translation": "At that time, one of the celestial beings in the assembly, named Qiqiao (“extraordinary talent”), together with a thousand other celestial beings, rose and faced the Buddha. They offered flowers, perfumes, banners, canopies, and music to the Buddha.",
        "source": "T12n0387_004:1098a17_0"
    },
    {
        "source_sentence": "「大海可度量，　　須彌可稱知，",
        "translation": "The great ocean can be measured, and the polar mountain can be known.",
        "source": "T12n0387_004:1098a18_1"
    },
    {
        "source_sentence": "　如來法境界，　　難可得思議！」",
        "translation": "The realm of the Tathāgata's teaching is inconceivable!",
        "source": "T12n0387_004:1098a18_1"
    },
    {
        "source_sentence": "合掌恭敬，以偈讚佛：說是法時，無數千人發阿耨多羅三藐三菩提心。",
        "translation": "They joined their palms in respect and praised the Buddha in verse, saying, When he taught this teaching, countless thousands of people aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0387_004:1098a18_1"
    },
    {
        "source_sentence": "爾時，如來告善德言：「善哉善哉！",
        "translation": "It was then that the Tathāgata addressed Sunetra, saying, Good, good!",
        "source": "T12n0387_004:1098a24_0"
    },
    {
        "source_sentence": "大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1098a24_1"
    },
    {
        "source_sentence": "汝今善發歡喜之心，得無上果。",
        "translation": "Now, you well arouse the mind of joy and attain the unsurpassed fruit.",
        "source": "T12n0387_004:1098a24_2"
    },
    {
        "source_sentence": "大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1098a25_3"
    },
    {
        "source_sentence": "從是南去，度三十萬恒河沙等世界，彼有世界，名須曼那，有佛世尊，",
        "translation": "Going south from here, he crossed 300,000 worlds as numerous as the grains of sand in the Ganges River. There was a world there called Samantabhadra, where the World-honored Buddha resided.",
        "source": "T12n0387_004:1098a25_4"
    },
    {
        "source_sentence": "號淨光祕密如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "He was called the Secret Tathāgata of Pure Light, Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavat.",
        "source": "T12n0387_004:1098a27_5"
    },
    {
        "source_sentence": "常住在世，為化眾生，轉正法輪。",
        "translation": "He always abides in the world, turning the wheel of the right Dharma for the sake of transforming sentient beings.",
        "source": "T12n0387_004:1098a29_6"
    },
    {
        "source_sentence": "從彼南去，復度五十萬恒河沙等世界，彼有世界，名法喜寶，佛號法藏如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "Going south from there, he crossed another fifty-thousand thousand worlds as numerous as the grains of sand in the Ganges River. There was a world named Jewel of Joy in the Dharma Treasury (Dharmakośa), where the buddhas were called “Tathāgata, Arhat, Perfectly Enlightened One, Perfect in Knowledge and Conduct Perfect",
        "source": "T12n0387_004:1098a29_7"
    },
    {
        "source_sentence": "常住在世，為化眾生，轉正法輪。",
        "translation": "He always abides in the world, turning the wheel of the right Dharma for the sake of transforming sentient beings.",
        "source": "T12n0387_004:1098b04_0"
    },
    {
        "source_sentence": "從彼南去，復過六十萬恒河沙世界，彼有世界，名一切池，佛號師子吼神足王如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "“There is a world named All Ponds. The Buddha there is called Lion Roaring King of Mystic Feet, the Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct Perfect in Knowledge, Well-gone, Knower of the World, Unsurpassed, Tamer of Humans, Teacher of Devas and Humans, teacher of gods,",
        "source": "T12n0387_004:1098b04_1"
    },
    {
        "source_sentence": "常住在世，為化眾生，轉正法輪。",
        "translation": "He always abides in the world, turning the wheel of the right Dharma for the sake of transforming sentient beings.",
        "source": "T12n0387_004:1098b08_2"
    },
    {
        "source_sentence": "從彼南去，復過三十六萬恒河沙等世界，彼有世界，名曰華幡，佛號高須彌，",
        "translation": "“South of here, beyond the worlds equal in number to the sands of thirty-six million Ganges Rivers, there is a world called Flower Banner. The Buddha there is called高須彌.",
        "source": "T12n0387_004:1098b08_3"
    },
    {
        "source_sentence": "十號具足，乃至轉正法輪。",
        "translation": "The ten epithets are complete, up to the turning of the right wheel of the Dharma.",
        "source": "T12n0387_004:1098b10_4"
    },
    {
        "source_sentence": "從彼南去，復過八十萬恒河沙等世界，彼有世界，名曰寶手，佛號法護，",
        "translation": "Going south from there, he passed another eighty-thousand thousand worlds equal in number to the sands of the Ganges River. There was a world there called Jewel Hand, with a Buddha called Dharmapāla.",
        "source": "T12n0387_004:1098b11_5"
    },
    {
        "source_sentence": "十號具足，乃至轉正法輪。",
        "translation": "The ten epithets are complete, up to the turning of the right wheel of the Dharma.",
        "source": "T12n0387_004:1098b12_6"
    },
    {
        "source_sentence": "「大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1098b13_7"
    },
    {
        "source_sentence": "如是諸佛世界，嚴淨其土，無有山陵、塠埠、石沙、穢惡。",
        "translation": "Thus, all the buddha worlds are adorned and purified in their land, which has no mountains, mounds, whirlpools, rocks, sand, or defilement.",
        "source": "T12n0387_004:1098b13_8"
    },
    {
        "source_sentence": "其地柔軟，如迦陵伽衣。",
        "translation": "The ground is as soft as a kaḷāraṅga robe.",
        "source": "T12n0387_004:1098b14_9"
    },
    {
        "source_sentence": "世無五濁，亦無女身、二乘之人，乃至無有二乘之名、女人名字，純諸菩薩摩訶薩等，",
        "translation": "There are no five turbidities in the world, and there are no female bodies or two-vehicle people, nor even the names of the two vehicles or women, purely bodhisattvas, mahāsattvas, etc.",
        "source": "T12n0387_004:1098b15_10"
    },
    {
        "source_sentence": "甘樂大乘、護持大乘、樂說大乘。",
        "translation": "They are fond of the great vehicle, preserve the great vehicle, and delight in explaining the great vehicle.",
        "source": "T12n0387_004:1098b17_11"
    },
    {
        "source_sentence": "「大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1098b17_12"
    },
    {
        "source_sentence": "若有善男子、善女人，受持如是諸佛名號，墮三惡道者，無有是處；",
        "translation": "If there were any sons and daughters of a virtuous family who preserved the names of these buddhas and fell into the three evil destinies, it would be impossible.",
        "source": "T12n0387_004:1098b18_0"
    },
    {
        "source_sentence": "必定當得阿耨多羅三藐三菩提。",
        "translation": "They'll surely attain supreme perfect enlightenment.",
        "source": "T12n0387_004:1098b19_1"
    },
    {
        "source_sentence": "大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1098b20_2"
    },
    {
        "source_sentence": "以是義故，我涅槃後，是經當於南方國土，廣行流布。",
        "translation": "Because of this meaning, after my nirvāṇa, this sūtra will be widely circulated in the southern land.",
        "source": "T12n0387_004:1098b20_3"
    },
    {
        "source_sentence": "正法欲滅餘四十年，當至北方，北方有王，名曰安樂，見有受持、書寫經卷，",
        "translation": "In the northern direction there was a king named Anuruddha, who lived for another forty years before the true-dharma disappeared. He saw that he had received and copied fascicles of the scripture.",
        "source": "T12n0387_004:1098b21_4"
    },
    {
        "source_sentence": "讀、誦、說者，隨時給施，四事無乏。",
        "translation": "Those who read, recite, and explain it will be given at any time to them, and they won't lack four things.",
        "source": "T12n0387_004:1098b23_5"
    },
    {
        "source_sentence": "爾時，北方當有八萬四千眾生，受持是經卷。",
        "translation": "At the time, 84,000 sentient beings in the north would accept and uphold this sūtra scroll.",
        "source": "T12n0387_004:1098b24_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_004:1098b25_0"
    },
    {
        "source_sentence": "若有人聞如是經已，捨放遠離，無有是處。",
        "translation": "If someone hears a sutra like this and abandons it, there's no place for them to abandon it or leave it.",
        "source": "T12n0387_004:1098b25_1"
    },
    {
        "source_sentence": "若有善男子、善女人，頂戴、受持諸佛名號，若中兵毒、水火、盜賊，",
        "translation": "If there are good men and good women wearing headgear and bearing the names of the buddhas, or if they're attacked by poison, water, fire, or thieves,",
        "source": "T12n0387_004:1098b26_2"
    },
    {
        "source_sentence": "無有是處，除其宿業。",
        "translation": "There's no such place except for their past actions.",
        "source": "T12n0387_004:1098b27_3"
    },
    {
        "source_sentence": "復次，大婆羅門！",
        "translation": "Furthermore, great brāhmaṇa!",
        "source": "T12n0387_004:1098b28_0"
    },
    {
        "source_sentence": "若內四部，若外眾生，為供養故，為怖畏故，為壞法故，奉持如是諸佛名號，",
        "translation": "For the sake of their offerings, for fear and in order to destroy the dharma they preserve the names of these buddhas.",
        "source": "T12n0387_004:1098b28_1"
    },
    {
        "source_sentence": "終不墮於三惡道中，若至三惡，無有是處。」",
        "translation": "They'll never fall into the three bad destinies, and there's no place for them if they reach the three bad destinies.",
        "source": "T12n0387_004:1098c01_0"
    },
    {
        "source_sentence": "爾時，善德復作是言：「世尊！",
        "translation": "It was then that Sunetra again said, Bhagavān!",
        "source": "T12n0387_004:1098c02_0"
    },
    {
        "source_sentence": "若有眾生，聞是經名，尚得如是無量善利，況有受持、讀誦、書寫、解說之者？",
        "translation": "If there are sentient beings who hear the names of these sūtras, they'll still attain such immeasurable good benefits, so why wouldn't there be those who memorize, recite, write, and explain them?",
        "source": "T12n0387_004:1098c02_1"
    },
    {
        "source_sentence": "若得聞彼諸佛名號，則為已得無上大寶，阿耨多羅三藐三菩提已在其手，",
        "translation": "If they hear the names of those buddhas, they’ll attain the unsurpassed great treasure that is unexcelled complete perfect enlightenment in their hands.",
        "source": "T12n0387_004:1098c04_2"
    },
    {
        "source_sentence": "諸佛如來已到其舍。",
        "translation": "The buddha-tathāgatas and tathāgatas have arrived at their dwelling.",
        "source": "T12n0387_004:1098c05_3"
    },
    {
        "source_sentence": "其地金剛，其身亦爾，心堅不動，不可移轉。",
        "translation": "The earth is thus adamantine, and so is the body. The mind is firm and unshakable; it cannot be moved.",
        "source": "T12n0387_004:1098c06_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0387_004:1098c07_5"
    },
    {
        "source_sentence": "我今亦當恭敬供養如是之人。」",
        "translation": "Now, I will also venerate and offer support to such a person.",
        "source": "T12n0387_004:1098c07_6"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0387_004:1098c08_7"
    },
    {
        "source_sentence": "大婆羅門！",
        "translation": "Great brāhmaṇa!",
        "source": "T12n0387_004:1098c08_8"
    },
    {
        "source_sentence": "汝今善知、善解如來功德之力。",
        "translation": "Now, you well know and understand the power of the Tathāgata's merit.",
        "source": "T12n0387_004:1098c08_9"
    },
    {
        "source_sentence": "若有眾生，聞彼佛名，敬信不疑，無諸怖畏，所謂王怖、人怖、鬼怖，",
        "translation": "If there are any sentient beings who hear the names of those buddhas and reverently believe in them without doubt, they will be free from fear—the fear of kings, the fear of humans, and the fear of ghosts.",
        "source": "T12n0387_004:1098c09_10"
    },
    {
        "source_sentence": "無諸疾病。",
        "translation": "There are no illnesses.",
        "source": "T12n0387_004:1098c10_11"
    },
    {
        "source_sentence": "常為諸佛學道弟子、八部鬼神，及其眷屬之所守護，諸佛所念。」",
        "translation": "They are always guarded by the disciples of the path of the buddhas, the eight groups of ghosts and spirits, and their retinues, and they're thought of by the buddhas.",
        "source": "T12n0387_004:1098c11_12"
    },
    {
        "source_sentence": "爾時，眾中有乾闥婆王，名曰喜見，從座而起，往至佛所，合掌恭敬白佛言：「世尊！",
        "translation": "At the time, there was a king of gandharvas in the crowd named Joyful Vision who rose from his seat, went to the Buddha, joined his palms and respectfully said to him, Bhagavān!",
        "source": "T12n0387_004:1098c13_0"
    },
    {
        "source_sentence": "如來滅後，何等眾生，能受持是經，廣令流布？",
        "translation": "After the parinirvāṇa of the Tathāgata, which sentient beings will be able to preserve this sūtra and spread it widely?",
        "source": "T12n0387_004:1098c14_1"
    },
    {
        "source_sentence": "何等眾生，不能受持，令法毀滅？」",
        "translation": "What kinds of sentient beings can't uphold it and cause the Dharma to be destroyed?",
        "source": "T12n0387_004:1098c15_2"
    },
    {
        "source_sentence": "爾時，如來默然不答。",
        "translation": "At that point, the Tathāgata remained silent and didn't answer.",
        "source": "T12n0387_004:1098c16_3"
    },
    {
        "source_sentence": "時，大迦葉語喜見言：「善男子！",
        "translation": "Mahākāśyapa then said to the joyful man, Good man!",
        "source": "T12n0387_004:1098c16_4"
    },
    {
        "source_sentence": "如來真實無有涅槃，法無滅盡，云何而言：『如來滅後，誰受是經？』」",
        "translation": "The Tathāgata really has no nirvāṇa, and the Dharma doesn't cease; how can he say, 'After the Tathāgata ceases, who will receive this sūtra?'",
        "source": "T12n0387_004:1098c17_5"
    },
    {
        "source_sentence": "喜見王言：「大德！",
        "translation": "Joy saw the king and said, Mañjuśrī!",
        "source": "T12n0387_004:1098c19_0"
    },
    {
        "source_sentence": "一切眾生，狂愚無智，惟願大德，宣說如來所以不滅；",
        "translation": "All sentient beings are deluded and ignorant, wishing only for great virtue to expound the reasons why the enlightened ones do not perish.",
        "source": "T12n0387_004:1098c19_1"
    },
    {
        "source_sentence": "一切眾生，癡闇所覆，願燃法燈，令得開明。",
        "translation": "All sentient beings, shrouded in the darkness of ignorance, wish to burn the lamp of truth so that they may attain enlightenment.",
        "source": "T12n0387_004:1098c20_2"
    },
    {
        "source_sentence": "我於未來，亦當廣為一切眾生，開發是義。",
        "translation": "In the future, I will also extensively develop this meaning for all sentient beings.",
        "source": "T12n0387_004:1098c21_3"
    },
    {
        "source_sentence": "惟願大德，哀愍故說！」",
        "translation": "May the great virtuous one say it out of pity!",
        "source": "T12n0387_004:1098c22_4"
    },
    {
        "source_sentence": "大迦葉言：「善男子！",
        "translation": "Mahākāśyapa said, Good man!",
        "source": "T12n0387_004:1098c22_5"
    },
    {
        "source_sentence": "如來法身，不名肉身。",
        "translation": "The Tathāgata's Dharma body isn't called a physical body.",
        "source": "T12n0387_004:1098c23_6"
    },
    {
        "source_sentence": "佛身金剛，非破壞身，成就具足無量功德方便之身，不名食身，如是之身，",
        "translation": "The body of the Buddha is adamantine, not a broken body. He has developed a body endowed with immeasurable virtue and skill in means, which is neither food nor such a body.",
        "source": "T12n0387_004:1098c23_7"
    },
    {
        "source_sentence": "云何言滅？」",
        "translation": "How can it be called cessation?",
        "source": "T12n0387_004:1098c25_8"
    },
    {
        "source_sentence": "喜見王言：「大德！",
        "translation": "Joy saw the king and said, Mañjuśrī!",
        "source": "T12n0387_004:1098c25_9"
    },
    {
        "source_sentence": "我今定知，如來世尊，方便涅槃，非畢竟滅。」",
        "translation": "Now, I'm certain to know that the Tathāgata, Bhagavān, is skillfully liberated, not completely extinguished.",
        "source": "T12n0387_004:1098c26_0"
    },
    {
        "source_sentence": "爾時，迦葉讚喜見言：「善哉善哉！",
        "translation": "At that point, Kāśyapa praised the view and said, Good, good!",
        "source": "T12n0387_004:1098c26_1"
    },
    {
        "source_sentence": "實如所說。",
        "translation": "It's really as explained.",
        "source": "T12n0387_004:1098c27_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0387_004:1098c27_3"
    },
    {
        "source_sentence": "大海可量，如來功德不可稱知。」",
        "translation": "The great ocean is immeasurable, and the Tathāgata's virtue can't be called known.",
        "source": "T12n0387_004:1098c28_4"
    },
    {
        "source_sentence": "喜見王言：「如來何時當畢竟滅？」",
        "translation": "King Joyful Seeing said, When will the Tathāgata ultimately cease?",
        "source": "T12n0387_004:1098c28_5"
    },
    {
        "source_sentence": "大迦葉言：「假使一切所有眾生，乃至蚊蟻，悉得阿耨多羅三藐三菩提，",
        "translation": "Mahākāśyapa said, Suppose all sentient beings, even mosquitoes and ants, were to attain supreme perfect enlightenment.",
        "source": "T12n0387_004:1098c29_6"
    },
    {
        "source_sentence": "入於涅槃，如來爾時，乃當涅槃。」",
        "translation": "Entering nirvāṇa, the Tathāgata will then enter nirvāṇa at that point.",
        "source": "T12n0387_004:1099a02_7"
    },
    {
        "source_sentence": "喜見王言：「大德！",
        "translation": "Joy saw the king and said, Mañjuśrī!",
        "source": "T12n0387_004:1099a02_8"
    },
    {
        "source_sentence": "如來成就如是無量無邊功德，一切眾生，何故不發阿耨多羅三藐三菩提心？",
        "translation": "The Tathāgata has accomplished such measureless and limitless merits, so why don't all sentient beings give rise to the mind of unsurpassed, correct, and complete enlightenment?",
        "source": "T12n0387_004:1099a03_9"
    },
    {
        "source_sentence": "苦哉苦哉！",
        "translation": "How painful! How painful!",
        "source": "T12n0387_004:1099a04_10"
    },
    {
        "source_sentence": "眾生薄福，不知如來常住不變金剛之身，非雜食身。",
        "translation": "Sentient beings with little merit don't know that the Tathāgata always abides in the adamantine body, which doesn't change, and isn't a body of mixed food.",
        "source": "T12n0387_004:1099a05_11"
    },
    {
        "source_sentence": "大德！",
        "translation": "O great virtuous one!",
        "source": "T12n0387_004:1099a06_12"
    },
    {
        "source_sentence": "如是之身，惟佛能知，非諸聲聞、緣覺所及。」",
        "translation": "Such a body is known only by buddhas, not by śrāvakas or pratyekbuddhas.",
        "source": "T12n0387_004:1099a06_13"
    },
    {
        "source_sentence": "迦葉復言：「善男子！",
        "translation": "Kāśyapa again said, Good man!",
        "source": "T12n0387_004:1099a08_0"
    },
    {
        "source_sentence": "一切眾生，悉有佛性，得菩提心。」",
        "translation": "All sentient beings have buddha-nature and attain the mind of enlightenment.",
        "source": "T12n0387_004:1099a08_1"
    },
    {
        "source_sentence": "「如來不涅槃，　　真法無有滅，",
        "translation": "The Tathāgata does not pass into nirvalJa: There is no destruction of the true dharma.",
        "source": "T12n0387_004:1099a09_2"
    },
    {
        "source_sentence": "　為諸眾生故，　　示現有滅度；",
        "translation": "For the sake of sentient beings They manifest nirvana.",
        "source": "T12n0387_004:1099a09_2"
    },
    {
        "source_sentence": "　如來常不滅，　　為眾方便說，",
        "translation": "The Enlightened One is eternal and never extinguished; He teaches it for the sake of sentient beings.",
        "source": "T12n0387_004:1099a09_2"
    },
    {
        "source_sentence": "　如來不思議，　　法僧亦復然！」◎",
        "translation": "The Tathāgata is inconceivable, and so are the Dharma and saṃgha!",
        "source": "T12n0387_004:1099a09_2"
    },
    {
        "source_sentence": "說是法時，二萬二千天子，發阿耨多羅三藐三菩提心，異口同音而說偈言：大方等無想經卷第四",
        "translation": "When he had discoursed thus, twenty-two thousand celestial beings conceived the spirit of unexcelled, complete perfect enlightenment and uttered the following verses in unison:",
        "source": "T12n0387_004:1099a09_2"
    }
]