[
    {
        "source_sentence": "如來莊嚴智慧光明入一切佛境",
        "translation": "the Tathāgata's adorned wisdom and illumination of wisdom enter all buddha-realms",
        "source": "T12n0357_001:0239a07_0"
    },
    {
        "source_sentence": "界經卷上",
        "translation": "Yijie jing, vol. 1",
        "source": "T12n0357_001:0239a08_0"
    },
    {
        "source_sentence": "元魏天竺三藏曇摩流支譯",
        "translation": "Translated by Dharmaruci, the Tripiṭaka Master of Tianzhus, Yuan Wei dynasty",
        "source": "T12n0357_001:0239a10_0"
    },
    {
        "source_sentence": "如是我聞：一時婆伽婆住王舍城鷲頭山中第四重上法界藏殿，與大比丘眾二萬五十人俱——皆是阿羅漢，",
        "translation": "Thus I have heard: One time, Bhagavān was staying at Rājagaha in the fourth storey of the treasury house of the cosmos on Vulture Peak in the city of Vaiśālī, accompanied by twenty-five thousand bhikṣus, all arhats.",
        "source": "T12n0357_001:0239a11_0"
    },
    {
        "source_sentence": "諸漏已盡，無復煩惱，心得自在，善得心解脫、善得慧解脫，心善調伏，",
        "translation": "Having extinguished the defilements, they are free from all afflictions. Their minds have attained freedom of thought and well-understood liberation by means of knowledge; their thoughts are well disciplined.",
        "source": "T12n0357_001:0239a13_1"
    },
    {
        "source_sentence": "人中大龍，應作者作、所作已辦，離諸重檐，逮得己利，盡諸有結，善得正智，",
        "translation": "The great dragon among humans, the author of what should be done and what should be done, parts with the heavy eaves, apprehends his own benefits, ends the bonds of existence, and well attains right knowledge.",
        "source": "T12n0357_001:0239a14_2"
    },
    {
        "source_sentence": "心解脫一切、心得自在，到第一彼岸。",
        "translation": "The mind is liberated from everything, and the mind attaines mastery, reaching the first and second shores.",
        "source": "T12n0357_001:0239a16_3"
    },
    {
        "source_sentence": "復有阿若拘隣等八大聲聞而為上首。",
        "translation": "Again, there are eight great śrāvakas like Ājñāta Kauṇḍinya who are the leaders.",
        "source": "T12n0357_001:0239a18_0"
    },
    {
        "source_sentence": "復有菩薩摩訶薩七十二億那由他，其名曰：文殊師利法王子菩薩摩訶薩、善財功德菩薩摩訶薩、佛勝德菩薩摩訶薩、藥王菩薩摩訶薩、藥上菩薩摩訶薩等。",
        "translation": "“There were also bodhisattva mahāsattvas as numerous as seventy-two koṭis of nayutas, called Mañjuśrī the Dharma Prince Bodhisattva Mahāsattva, Sudarśana the Virtuous Bodhisattva Mahāsattva, Buddha Supreme Virtue Bodhisattva Mahāsattva, King of Healing Bodhisattva Mahāsattva, and",
        "source": "T12n0357_001:0239a18_1"
    },
    {
        "source_sentence": "皆住不退轉地，轉大法輪，善能諮問大方廣寶積法門，位階十地，究竟法雲，",
        "translation": "They all abide in the stage of nonregression and turn the great wheel of the Dharma. They are able to skillfully consult wide and extensive scriptures, stores of jewels; they have ten stages one after another, perfecting the cloud of doctrine.",
        "source": "T12n0357_001:0239a22_2"
    },
    {
        "source_sentence": "智慧高大如須彌山，善修習空、無相、無願，心不生相，一切皆得大甚深法、智慧光明、皆悉成就佛威儀行。",
        "translation": "Their wisdom is as high and lofty as Mount Sumeru, they skillfully cultivate emptiness, signlessness, and wishlessness, their minds don't give rise to marks, and all attain the great and profound Dharma, the light of wisdom, and the accomplishment of the Buddha's authoritative conduct.",
        "source": "T12n0357_001:0239a24_3"
    },
    {
        "source_sentence": "此諸菩薩摩訶薩眾，皆是諸佛神力所加，從於他方百千萬億那由他諸佛世界而來集會，",
        "translation": "These great assemblies of enlightening beings were all produced by the spiritual power of the Buddhas, coming from hundreds of thousands of myriads of koṭis of nayutas of buddha-worlds in other directions.",
        "source": "T12n0357_001:0239a26_4"
    },
    {
        "source_sentence": "皆得成就諸神通業、皆悉安住法性實際。",
        "translation": "They'll all attain the accomplishment of supernormal actions, and they'll all abide in the reality of the Dharma nature.",
        "source": "T12n0357_001:0239a28_5"
    },
    {
        "source_sentence": "爾時，世尊作如是念：「我今轉于無上法輪，欲令諸菩薩摩訶薩速疾生於大智慧力，",
        "translation": "At that time the World-honored One had this thought:",
        "source": "T12n0357_001:0239b01_0"
    },
    {
        "source_sentence": "又復欲令恒河沙等諸世界中有大威德、大神通力菩薩來集。」",
        "translation": "Again, I want to cause the bodhisattvas of great authority and great supernormal powers to assemble in worlds like the Ganges River.",
        "source": "T12n0357_001:0239b02_1"
    },
    {
        "source_sentence": "時佛世尊復作是念：「我為說大方廣法門，欲現瑞相放大光明。",
        "translation": "Again, the Bhagavān then had this thought, I'll explain the vast and extensive Dharma teaching for you, wanting to show a miraculous appearance and radiate a bright light.",
        "source": "T12n0357_001:0239b04_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0357_001:0239b05_3"
    },
    {
        "source_sentence": "欲令一切諸來菩薩摩訶薩等皆悉諮問我所說法。」",
        "translation": "I want to cause all the bodhisattvas, mahāsattvas, and others who have come to ask questions about what I teach.",
        "source": "T12n0357_001:0239b05_4"
    },
    {
        "source_sentence": "爾時，世尊念已，放大光明雲，普照十方阿僧祇不可思議三千大千微塵數等世界。",
        "translation": "At the time, the Bhagavān had this thought, and he magnified a cloud of light that shone everywhere in an inconceivable 3,000 great one-thousandth number of worlds in the ten directions.",
        "source": "T12n0357_001:0239b08_0"
    },
    {
        "source_sentence": "即時十方一一世界十十不可數佛國土百千萬億那由他微塵數等菩薩摩訶薩俱來雲集。",
        "translation": "Immediately, the bodhisattvas and mahāsattvas from each of the ten incalculable buddha-lands in each of the ten worlds in the ten directions gathered together into a cloud of hundreds of thousands of myriads of koṭis of nayutas of tiny dust motes.",
        "source": "T12n0357_001:0239b09_1"
    },
    {
        "source_sentence": "一一菩薩各以菩薩神通力故，所有一切不可思議最勝供養供養諸佛。",
        "translation": "Each of these bodhisattvas, by the power of their bodhisattva's supernormal abilities, made all the inconceivable and most excellent offerings to the buddhas that they had.",
        "source": "T12n0357_001:0239b12_0"
    },
    {
        "source_sentence": "彼諸菩薩一一各以本願力故，在如來前昇蓮華座，至心觀佛，瞻仰而住。",
        "translation": "Each of those bodhisattvas, because of the power of their original vow, ascended a lotus seat in front of the Tathāgata and stood there gazing at the Buddha with sincerity.",
        "source": "T12n0357_001:0239b13_1"
    },
    {
        "source_sentence": "即時法界藏殿上有大寶蓮華藏高座從地踊出，縱廣億那由他阿僧祇由旬。",
        "translation": "Immediately there was a great jeweled lotus-treasury high seat in the hall of the treasury of the Dharma realm's store, rising out of the ground and measuring hundreds of millions of yojanas long and an incalculable number of yojanas wide.",
        "source": "T12n0357_001:0239b16_0"
    },
    {
        "source_sentence": "其華形相上下相稱，以一切光明摩尼寶為體，電光摩尼寶為周匝欄楯，",
        "translation": "The shape of the flower was made of all kinds of radiant jewels, and its railings were embellished with lightning-colored jewel railings.",
        "source": "T12n0357_001:0239b17_1"
    },
    {
        "source_sentence": "不可思議光明摩尼寶為莖，不可思議摩尼寶以為眷屬，過諸譬喻光明摩尼寶以為垂纓，",
        "translation": "The jewel of inconceivable light is its stem, the jewel of inconceivable light is its base, the jewel of inconceivable light is its retinue, and the jewel of inconceivable light surpasses all metaphors.",
        "source": "T12n0357_001:0239b19_2"
    },
    {
        "source_sentence": "自在王摩尼寶以為羅網，種種摩尼寶以為間錯，懸諸無量寶蓋幢幡。",
        "translation": "The sovereign king's maṇi treasures are made into a net of jewels, and various maṇi treasures are interspersed with them, hanging from an infinite variety of jeweled canopies, banners, and streamers.",
        "source": "T12n0357_001:0239b21_3"
    },
    {
        "source_sentence": "彼大寶蓮華藏高座周匝俱放十阿僧祇百千萬億那由他光明。",
        "translation": "That great jeweled lotus-treasury high seat is surrounded by ten incalculable hundreds of thousands of myriads of koṭis of nayutas of rays of light.",
        "source": "T12n0357_001:0239b23_0"
    },
    {
        "source_sentence": "是光爾時遍照十方無量世界，即時十方，於一一方有十億不可說佛國土，",
        "translation": "At that time the light illumined infinite worlds in the ten directions, and instantly there were billions of untold buddha-lands in one direction in all ten directions.",
        "source": "T12n0357_001:0239b24_1"
    },
    {
        "source_sentence": "百千萬億那由他微塵數等天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、四大天王、釋提桓因、梵天王等皆來集會。",
        "translation": "Hundreds of thousands of myriads of koṭis of nayutas of dusty numbers of gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, the four great heavenly kings, Śakra Devānām-Indra, and Brahmā came to this assembly.",
        "source": "T12n0357_001:0239b26_2"
    },
    {
        "source_sentence": "彼諸天等各各皆乘寶殿樓閣，一一皆有不可思議阿僧祇天女作百千萬億那由他種種伎樂娛樂，",
        "translation": "Each of those celestial beings each rode in a jeweled hall or tower, and each had an inconceivable number of heavenly maidens performing hundreds of thousands of myriads of koṭis of nayutas of various kinds of music and amusements.",
        "source": "T12n0357_001:0239b28_3"
    },
    {
        "source_sentence": "而來到於佛所。",
        "translation": "They came to the Buddha's place.",
        "source": "T12n0357_001:0239c02_4"
    },
    {
        "source_sentence": "復有諸天、龍等，各各皆乘華殿樓閣來詣佛所。",
        "translation": "Again, there were gods and dragons, each riding in a flowery hall or tower, who came to the Buddha.",
        "source": "T12n0357_001:0239c02_5"
    },
    {
        "source_sentence": "復有諸天、龍等，各各皆乘憂羅伽娑羅栴檀香殿樓閣來詣佛所。",
        "translation": "Again, there were gods and dragons, each riding on a tower of the sandalwood-scented hall in Urakasara, who came to the Buddha's place.",
        "source": "T12n0357_001:0239c03_6"
    },
    {
        "source_sentence": "復有諸天、龍等，各各皆乘真珠寶殿樓閣來詣佛所。",
        "translation": "Again, there were gods and dragons, each riding in a hall or tower of true jewels, who came to the Buddha.",
        "source": "T12n0357_001:0239c05_7"
    },
    {
        "source_sentence": "復有諸天、龍等，各各皆乘種種綵殿樓閣來詣佛所。",
        "translation": "Again, there were gods and dragons, each riding in a variety of multicolored pavilions and towers, who came to the Buddha.",
        "source": "T12n0357_001:0239c06_8"
    },
    {
        "source_sentence": "復有諸天、龍等，各各皆乘金剛光明摩尼寶殿樓閣來詣佛所。",
        "translation": "Again, there were gods and dragons, each riding in a jeweled hall or tower of adamantine radiance from the vajra, who came to the Buddha.",
        "source": "T12n0357_001:0239c07_9"
    },
    {
        "source_sentence": "復有諸天、龍等，各各皆乘閻浮那提金寶殿樓閣來詣佛所。",
        "translation": "Again, there were gods and dragons, each riding a golden-jeweled pavilion tower in Jambudvīpa, who came to the Buddha.",
        "source": "T12n0357_001:0239c08_10"
    },
    {
        "source_sentence": "復有諸天、龍等，各各皆乘集一切光明摩尼寶殿樓閣來詣佛所。",
        "translation": "Again, there were gods and dragons, each of whom assembled all the jeweled halls and towers of the maṇi-jeweled palace of light and came to the Buddha.",
        "source": "T12n0357_001:0239c10_11"
    },
    {
        "source_sentence": "復有諸天、龍等，各各皆乘自在王摩尼寶珠殿樓閣來詣佛所。",
        "translation": "Again, there were gods and dragons, each riding on a jeweled pavilion of the sovereign king's maṇi-jeweled jeweled palace and tower, who came to the Buddha.",
        "source": "T12n0357_001:0239c11_12"
    },
    {
        "source_sentence": "復有諸天、龍等，各各皆乘如意寶珠殿樓閣來詣佛所。",
        "translation": "Again, there were gods and dragons, each riding from their wish-granting jeweled pavilions and towers, who came to the Buddha.",
        "source": "T12n0357_001:0239c13_13"
    },
    {
        "source_sentence": "復有諸天、龍等，各各皆乘帝釋王頸下瓔珞摩尼寶珠殿樓閣來詣佛所。",
        "translation": "Again, there were gods and dragons, each riding the emperor's king's necklace under his neck in a jeweled maṇi-jeweled palace to the Buddha's presence.",
        "source": "T12n0357_001:0239c14_14"
    },
    {
        "source_sentence": "復有諸天、龍等，各各皆乘持清淨大海普放千光明大摩尼寶珠殿樓閣來詣佛所。",
        "translation": "Again, there were gods and dragons, each holding a pure ocean that universally radiated a thousand rays of light from the great maṇi jeweled palace and tower pavilion coming to the Buddha's presence.",
        "source": "T12n0357_001:0239c16_0"
    },
    {
        "source_sentence": "如是等輩，各各皆有不可思議阿僧祇天女，作百千萬億那由他種種伎樂娛樂，",
        "translation": "Each of these assemblies each had inconceivably many heavenly maidens, performing hundreds of thousands of myriads of koṭis of nayutas of various music and dances.",
        "source": "T12n0357_001:0239c17_1"
    },
    {
        "source_sentence": "而來到於佛所。",
        "translation": "They came to the Buddha's place.",
        "source": "T12n0357_001:0239c19_2"
    },
    {
        "source_sentence": "到已，俱作過一切世間不可思議、不可稱、不可量、不可數種種伎樂，",
        "translation": "Inconceivable, immeasurable, immeasurable, incalculable, and countless kinds of music transcending all worlds.",
        "source": "T12n0357_001:0239c20_3"
    },
    {
        "source_sentence": "供養如來。",
        "translation": "They make offerings to the Tathāgata.",
        "source": "T12n0357_001:0239c21_4"
    },
    {
        "source_sentence": "彼諸天等以本願力，隨座所須自然具足，却坐一面，至心觀佛，瞻仰而住。",
        "translation": "Because of the power of their original vow, those gods naturally fulfilled whatever seats they needed and withdrew to sit at one side. They gazed earnestly at the Buddha, looked up in admiration, and remained there.",
        "source": "T12n0357_001:0239c21_5"
    },
    {
        "source_sentence": "爾時，三千大千世界大地即成閻浮檀金，種種摩尼寶樹莊嚴世界，種種天華樹、種種衣服樹、種種憂羅伽娑羅栴檀樹、種種香樹莊嚴世界，",
        "translation": "At that time, the earth of the great manifold cosmos of the 3,000 great one-thousand worlds became Jambudvfpa gold, a world adorned with various maṇi-jeweled trees, and a world adorned with various celestial flowering trees, various garment trees, various emerald sandalwood trees, and various fragrant trees.",
        "source": "T12n0357_001:0239c24_0"
    },
    {
        "source_sentence": "電光摩尼寶以為羅網，遍覆三千大千世界，建大寶幢，懸諸幡蓋。",
        "translation": "Jewels of lightning and maṇi jewels formed the mesh, covering the great chiliocosm with a network of three thousand great one-thousand worlds, built great jeweled banners and hung canopies of pennants.",
        "source": "T12n0357_001:0239c27_1"
    },
    {
        "source_sentence": "彼諸樹中一一皆有百千萬億那由他阿僧祇天女，皆現半身，兩手俱持百千萬億諸寶瓔珞供養而住。",
        "translation": "In each of those trees there were hundreds of thousands of myriads of koṭis of nayutas of incalculable celestial maidens, each with half a body and holding millions of jeweled necklaces in both hands to offer support.",
        "source": "T12n0357_001:0239c28_2"
    },
    {
        "source_sentence": "「我依佛力生，　　本願今成就，",
        "translation": "“I rely on the Buddha’s power to give rise to my original vow, which has now been fulfilled.",
        "source": "T12n0357_001:0240a02_0"
    },
    {
        "source_sentence": "　願人王來坐，　　奉戴兩足尊。",
        "translation": "May the king of humans come and sit, carrying the two-legged honored one.",
        "source": "T12n0357_001:0240a02_0"
    },
    {
        "source_sentence": "　我此身唯寶，　　華淨眾所樂，",
        "translation": "This body of mine is only treasure, Flowery and pure, pleasing to all.",
        "source": "T12n0357_001:0240a02_0"
    },
    {
        "source_sentence": "　寶成由佛力，　　願尊滿我願，",
        "translation": "The jewel is formed by the Buddha’s power. May Your Holiness fulfill my vow!",
        "source": "T12n0357_001:0240a02_0"
    },
    {
        "source_sentence": "　坐師子華藏，　　嚴世界及我，",
        "translation": "Sitting in the lion’s lotus-treasury, He adorned the world and self.",
        "source": "T12n0357_001:0240a02_0"
    },
    {
        "source_sentence": "　說法多眾聞，　　逮得師子座。",
        "translation": "He preached the Dharma for many people, and he attained the lion's seat.",
        "source": "T12n0357_001:0240a02_0"
    },
    {
        "source_sentence": "　我身千光明，　　照無量世界，",
        "translation": "A thousand rays of light from my body illumine infinite worlds.",
        "source": "T12n0357_001:0240a02_0"
    },
    {
        "source_sentence": "　願尊坐我上，　　生我歡喜心。",
        "translation": "May the venerable one sit on me, and give rise to my joy!",
        "source": "T12n0357_001:0240a02_0"
    },
    {
        "source_sentence": "　於此說法處，　　已坐八億佛，",
        "translation": "At this place where the Buddha preached the Dharma, Eight hundred million buddhas were already seated.",
        "source": "T12n0357_001:0240a02_0"
    },
    {
        "source_sentence": "　願尊今速坐，　　攝受利益我。」",
        "translation": "May the Bhagavān now quickly sit down and take care of me for my benefit.",
        "source": "T12n0357_001:0240a02_0"
    },
    {
        "source_sentence": "爾時，彼大寶蓮華藏大師子座中出妙音聲而說偈言：爾時，世尊從本座起，",
        "translation": "At that time the great jeweled lotus-treasury treasury lion emerged from his seat and said in verse, “Then the World-honored One rose from his seat.",
        "source": "T12n0357_001:0240a02_0"
    },
    {
        "source_sentence": "即昇大寶蓮華藏大師子座結加趺坐，觀察一切菩薩摩訶薩眾，欲為菩薩說勝妙法，",
        "translation": "He ascended to the great jeweled lotus-treasury lion seat, sat cross-legged on it, and surveyed all the hosts of enlightening beings who wished to teach the supremely sublime teaching for the enlightening beings.",
        "source": "T12n0357_001:0240a14_1"
    },
    {
        "source_sentence": "即便現相。",
        "translation": "It's even manifested in form.",
        "source": "T12n0357_001:0240a16_2"
    },
    {
        "source_sentence": "即時一切菩薩摩訶薩眾作是思惟：「文殊師利法王子應為我等諮問如來、應、正遍知不生不滅法門，",
        "translation": "Immediately, all the bodhisattva mahāsattvas had this thought, Mañjuśrī, prince of the Dharma, should consult us about the teachings of the Tathāgata, Arhat, Perfectly Enlightened One that neither arise nor cease.",
        "source": "T12n0357_001:0240a16_3"
    },
    {
        "source_sentence": "以我等輩從久遠來已曾聞此勝妙法門。」",
        "translation": "It's because we've heard this wonderful dharma-gate for a long time.",
        "source": "T12n0357_001:0240a18_4"
    },
    {
        "source_sentence": "爾時，文殊師利法王子見如來相、知諸菩薩摩訶薩眾心思惟已，即白佛言：「世尊！",
        "translation": "Seeing the Tathāgata's characteristics and knowing the minds of the bodhisattva-mahāsattvas, Mañjuśrī, the prince of the Dharma, said to the Buddha, Bhagavān!",
        "source": "T12n0357_001:0240a19_5"
    },
    {
        "source_sentence": "何等法門名不生不滅？」",
        "translation": "What is the dharma-gate called neither arising nor ceasing?",
        "source": "T12n0357_001:0240a21_6"
    },
    {
        "source_sentence": "「佛說無生滅，　　彼釋何等相？",
        "translation": "The Buddha teaches that there is neither arising nor ceasing. What does he mean by this?",
        "source": "T12n0357_001:0240a22_7"
    },
    {
        "source_sentence": "　何法不生滅？　　願說喻相應。",
        "translation": "What dharmas are not arisen or perishing?",
        "source": "T12n0357_001:0240a22_7"
    },
    {
        "source_sentence": "　菩薩為智慧，　　承諸佛神力，",
        "translation": "Enlightening beings, for the sake of wisdom, Inherit the spiritual powers of the Buddhas.",
        "source": "T12n0357_001:0240a22_7"
    },
    {
        "source_sentence": "　無量世界來，　　願說勝妙法。」",
        "translation": "They come from measureless worlds, wishing to teach the most wonderful Dharma.",
        "source": "T12n0357_001:0240a22_7"
    },
    {
        "source_sentence": "即說偈言：爾時，佛告文殊師利法王子言：「善哉善哉。",
        "translation": "He then spoke a verse, saying, At that point, the Buddha addressed Mañjuśrī, the prince of the Dharma, saying, Good, good!",
        "source": "T12n0357_001:0240a22_7"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240a27_8"
    },
    {
        "source_sentence": "汝能問佛此甚深義。",
        "translation": "You can ask the Buddha about this profound meaning.",
        "source": "T12n0357_001:0240a28_9"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240a28_10"
    },
    {
        "source_sentence": "汝為安隱無量眾生、能與無量眾生種種快樂，復能憐愍無量眾生、廣能利益無量眾生、與無量眾生人天之樂、為諸菩薩摩訶薩等究竟佛地。",
        "translation": "For the peace of measureless sentient beings and the various happinesses you can give to measureless sentient beings, you can also have compassion for measureless sentient beings, benefit measureless sentient beings in detail, share the happiness of measureless sentient beings with humans and gods, and ultimately reach the Buddhahood of bodhisattvas, mahāsattvas, and so for",
        "source": "T12n0357_001:0240a28_11"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240b03_12"
    },
    {
        "source_sentence": "汝於此義莫驚、怖畏。",
        "translation": "Don't be frightened or terrified by this meaning.",
        "source": "T12n0357_001:0240b03_13"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240b03_14"
    },
    {
        "source_sentence": "我為汝說不生不滅法，當依智解。",
        "translation": "I'll explain for you the principle of neither arising nor ceasing, which should be based on knowledge and understanding.",
        "source": "T12n0357_001:0240b04_15"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240b04_16"
    },
    {
        "source_sentence": "不生不滅法者，即是如來、應、正遍知。",
        "translation": "A dharma that doesn't arise and doesn't cease is the Tathāgata, Arhat, and Perfectly Enlightened One.",
        "source": "T12n0357_001:0240b05_17"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240b06_0"
    },
    {
        "source_sentence": "譬如大地大毘琉璃所成，形相猶如三十三天所住之處。",
        "translation": "It's like the great vaiḍūrya of the earth, which is shaped like the place where the thirty-three gods live.",
        "source": "T12n0357_001:0240b06_1"
    },
    {
        "source_sentence": "彼大地中見三十三天釋提桓因并善法堂影現分明，及見天王釋提桓因天中所有五欲境界、戲樂等事，",
        "translation": "In that great ground they saw the thirty-three gods, Śakra Devānām-Indra and the reflection of the hall of the fine dharma clearly manifested, and they saw all the objects of the five desire realms and pleasures of the celestial king, Śakra Devānām-Indra, in the heavens.",
        "source": "T12n0357_001:0240b07_2"
    },
    {
        "source_sentence": "一切皆見。",
        "translation": "All of them are seen.",
        "source": "T12n0357_001:0240b09_3"
    },
    {
        "source_sentence": "爾時，諸天唱告一切男子、女人、童男、童女，作如是言：『汝等可來觀此天王釋提桓因善法之堂及天王所有五欲境界、戲樂之具。』",
        "translation": "It was then that the gods called out to all the men, women, boys, and girls, saying, 'Come and see this heavenly king, Śakra Devānām-Indra, the hall of good qualities, the five objects of desire realms, and the playthings for enjoyment of pleasure.'",
        "source": "T12n0357_001:0240b10_4"
    },
    {
        "source_sentence": "復作是言：『諸善男子、善女人等！",
        "translation": "Again, he said, 'Good men and good women!",
        "source": "T12n0357_001:0240b13_0"
    },
    {
        "source_sentence": "汝當布施、持戒、種諸善根，皆當得此善法堂處及以天中五欲境界、戲樂之具，",
        "translation": "You should give alms, observe precepts, and plant roots of goodness. All of you should attain this abode of enlightenment hall as well as the five realms of desire in heaven and the requisites for amusement.",
        "source": "T12n0357_001:0240b13_1"
    },
    {
        "source_sentence": "當作天王，并得果報及神通力，如釋提桓因，隨其所有五欲境界，畢竟成就、必得受用。』",
        "translation": "He'll become a heavenly king, and he'll attain the fruitful rewards and supernormal powers, just like Śakra Devānām-Indra, who follows the five objects of desire that are possessed by him and will surely experience them after all.'",
        "source": "T12n0357_001:0240b15_2"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240b17_3"
    },
    {
        "source_sentence": "爾時，彼諸善男子、善女人、童男、童女等，於彼大毘琉璃地中見三十三天釋提桓因善法之堂及五欲境界、戲樂之具影現分明，",
        "translation": "At the time, those good men, good women, boys, girls, and boys saw in that great vaiḍūrya ground the thirty-three gods, Śakra, lord of the gods, clearly manifesting the hall of the fine dharma, the realm of the five desires, and the objects of play and pleasure.",
        "source": "T12n0357_001:0240b17_4"
    },
    {
        "source_sentence": "即各散華，合掌供養，作如是言：『如彼釋提桓因身并善法堂及彼天中五欲境界，",
        "translation": "They each scattered flowers, joined their palms to offer support, and said these words:",
        "source": "T12n0357_001:0240b20_5"
    },
    {
        "source_sentence": "我亦應得。』",
        "translation": "I should also attain it.'",
        "source": "T12n0357_001:0240b22_6"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240b22_7"
    },
    {
        "source_sentence": "而彼眾生皆悉不知三十三天善法之堂、釋提桓因及五欲境界如是等事，",
        "translation": "But those sentient beings did not know the thirty-three celestial realms of the universe Sahā, the hall of the fine dharma of the thirty-three gods, the lord of the gods of Rūpadhātu, or anything like that.",
        "source": "T12n0357_001:0240b22_8"
    },
    {
        "source_sentence": "一切皆依大毘琉璃地中而現。",
        "translation": "All of them are manifested in the great vaiḍūrya ground.",
        "source": "T12n0357_001:0240b24_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0357_001:0240b25_10"
    },
    {
        "source_sentence": "大毘琉璃地清淨故，一切影像悉現其中。",
        "translation": "Because the great vaiḍūrya ground is pure, all images are reflected in it.",
        "source": "T12n0357_001:0240b25_11"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240b26_12"
    },
    {
        "source_sentence": "而彼眾生為求天王帝釋身故，所有修行布施、持戒、種諸善根，皆悉迴向三十三天。",
        "translation": "Those sentient beings cultivate generosity, observe precepts, and plant good roots because they seek the body of Indra, the king of gods, and all of them return to the thirty-three gods.",
        "source": "T12n0357_001:0240b26_13"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240b28_14"
    },
    {
        "source_sentence": "而大毘琉璃地中實無有彼三十三天善法堂、釋提桓因及以五欲境界等事，",
        "translation": "But in the great vaiḍūrya there really is no such thing as the hall of the teachings of the thirty-three gods, the lord of the gods, or the realm of desire.",
        "source": "T12n0357_001:0240b28_15"
    },
    {
        "source_sentence": "以大毘琉璃寶地清淨鏡像現故。",
        "translation": "It's because the pure mirror image of the great vaiḍūrya jeweled ground is manifested.",
        "source": "T12n0357_001:0240c01_16"
    },
    {
        "source_sentence": "彼三十三天善法之堂、釋提桓因五欲境界，以不實故，不生、不滅，以大毘琉璃寶地清淨鏡像現故。",
        "translation": "That hall of the thirty-three gods' good dharma and Śakra Devānām-Indra's five desire realms are unreal because they don't arise or cease, and it's because the pure mirror images of the great vaiḍūrya jeweled ground appear.",
        "source": "T12n0357_001:0240c02_17"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240c04_18"
    },
    {
        "source_sentence": "如是，如是。",
        "translation": "So it is, so it is.",
        "source": "T12n0357_001:0240c04_19"
    },
    {
        "source_sentence": "一切眾生依清淨心如實修行見如來身，文殊師利！",
        "translation": "All sentient beings see the Tathāgata's body based on the pure mind as it really is and cultivate it, Mañjuśrī!",
        "source": "T12n0357_001:0240c04_20"
    },
    {
        "source_sentence": "一切眾生依如來加力故見如來身。",
        "translation": "All sentient beings see the Tathāgata's body based on the Tathāgata's empowerment.",
        "source": "T12n0357_001:0240c06_21"
    },
    {
        "source_sentence": "而如來身不實，不生、不滅，非有物、非無物，非可見、非不可見，非可觀、非不可觀，",
        "translation": "The body of the Tathāgata is insubstantial, neither arising nor ceasing, neither existent nor nonexistent, neither visible nor invisible, neither observable nor unobservable.",
        "source": "T12n0357_001:0240c06_22"
    },
    {
        "source_sentence": "非有心、非無心，非可思議、非不可思議，非有、非無。",
        "translation": "It's neither existent nor nonexistent, neither inconceivable nor inconceivable, and neither existent nor nonexistent.",
        "source": "T12n0357_001:0240c08_23"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240c09_24"
    },
    {
        "source_sentence": "一切眾生依於如來清淨法身鏡像力故得見如來清淨法身，奉施寶衣、散華、燒香，",
        "translation": "All sentient beings, relying on the mirrorlike power of the Buddha’s pure reality body, are able to see the Buddha’s pure reality body. They offer jeweled robes, scatter flowers, and burn incense.",
        "source": "T12n0357_001:0240c10_25"
    },
    {
        "source_sentence": "合掌供養而作是言：『我亦應得如來、應、正遍知清淨法身。』",
        "translation": "He joined his palms and made an offering, saying, 'I should also attain the pure Dharma body of the Tathāgata, Arhat, and Perfectly Enlightened One.'",
        "source": "T12n0357_001:0240c11_26"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240c13_27"
    },
    {
        "source_sentence": "而彼一切眾生為求如來清淨法身，布施、持戒、種諸善根，以此善根求如來智，",
        "translation": "All those sentient beings, seeking the Buddha’s pure body of teaching, provide charity, observe precepts, and plant roots of goodness; by these roots of goodness they seek enlightened knowledge.",
        "source": "T12n0357_001:0240c13_28"
    },
    {
        "source_sentence": "迴向阿耨多羅三藐三菩提。",
        "translation": "He returns to unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0357_001:0240c15_29"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240c16_0"
    },
    {
        "source_sentence": "如彼大毘琉璃地鏡像中三十三天帝釋王身不動、不生，心不戲論、不分別、不分別無分別，",
        "translation": "“Furthermore, reverend Śakra, the king of the thirty-three gods in that great mirror image of Vaiśravaṇa’s body is neither moved nor aroused, and his mind is not debating, not discriminating, not conceptualizing, and not apprehending.",
        "source": "T12n0357_001:0240c16_1"
    },
    {
        "source_sentence": "不思、無思，不思議、無念，寂滅、寂靜，不生、不滅，不可見、不可聞、不可嗅、不可味、不可觸，",
        "translation": "They are without thought and without thought, inconceivable and without thought. They are neither produced nor extinguished, they cannot be seen, heard, smelled, tasted, or touched.",
        "source": "T12n0357_001:0240c18_2"
    },
    {
        "source_sentence": "無諸相，不可覺、不可知。",
        "translation": "There are no characteristics, and they can't be perceived or known.",
        "source": "T12n0357_001:0240c20_3"
    },
    {
        "source_sentence": "如是，文殊師利！",
        "translation": "So it is, Mañjuśrī!",
        "source": "T12n0357_001:0240c20_4"
    },
    {
        "source_sentence": "如來、應、正遍知清淨法身亦復如是，不動、不生，心不戲論、不分別、不分別無分別，",
        "translation": "So it is with the pure Dharma body of Buddha, Arhat, Perfectly Enlightened One: his mind neither moves nor arises, and he has no conceptual elaboration, no distinction, and no discrimination.",
        "source": "T12n0357_001:0240c21_5"
    },
    {
        "source_sentence": "不思、無思，不思議、無念，寂滅、寂靜，不生、不滅，不可見、不可聞、不可嗅、不可味、不可觸，",
        "translation": "They are without thought and without thought, inconceivable and without thought. They are neither produced nor extinguished, they cannot be seen, heard, smelled, tasted, or touched.",
        "source": "T12n0357_001:0240c22_6"
    },
    {
        "source_sentence": "無諸相，不可覺、不可知。",
        "translation": "There are no characteristics, and they can't be perceived or known.",
        "source": "T12n0357_001:0240c24_7"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0240c26_0"
    },
    {
        "source_sentence": "如來法身不生、不滅，不去、不來，以此為體，如鏡中像。",
        "translation": "The Tathāgata's Dharma body doesn't arise or cease, doesn't go or come, and takes this as its essence like an image in a mirror.",
        "source": "T12n0357_001:0240c26_1"
    },
    {
        "source_sentence": "世間所見，隨諸眾生種種信力，如來示現種種異身：隨彼眾生感有長短，",
        "translation": "Whatever the world sees, according to the various faiths of sentient beings, the Enlightened One manifests various different bodies: According to the length and shortness of those sentient beings’ feelings,",
        "source": "T12n0357_001:0240c27_2"
    },
    {
        "source_sentence": "如來現身命有修促；",
        "translation": "The present body and life of a buddha are conditioned by spiritual practice.",
        "source": "T12n0357_001:0240c29_3"
    },
    {
        "source_sentence": "隨彼眾生於大菩提有能信力，如來現身；",
        "translation": "According to the power of those sentient beings’ faith in great enlightenment, the Buddha manifested his body.",
        "source": "T12n0357_001:0240c29_4"
    },
    {
        "source_sentence": "隨彼眾生聞法能信受，如來現身；",
        "translation": "When sentient beings hear the Teaching and are able to believe it, the enlightened one manifests his body.",
        "source": "T12n0357_001:0241a01_5"
    },
    {
        "source_sentence": "隨彼眾生信心能知三乘之法，如來現身；",
        "translation": "According to the faith of those sentient beings who were able to know the teachings of the three vehicles, the Buddha manifested his body.",
        "source": "T12n0357_001:0241a02_6"
    },
    {
        "source_sentence": "隨彼眾生得解脫力，如來現身。",
        "translation": "According to the power of liberation attained by those sentient beings, the Tathāgata manifests his body.",
        "source": "T12n0357_001:0241a03_7"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241a04_0"
    },
    {
        "source_sentence": "譬如虛空有大妙法鼓，依三十三天功德力生，離善法堂，在虛空中，過一切諸天眼識境界，",
        "translation": "“Furthermore, it is as if there were a great drum of the Teaching in space, built by relying on the power of the virtues of the thirty-three gods. Being separated from the hall of good teaching, it would remain in space, beyond the realm of all celestial eyes and consciousnesses.",
        "source": "T12n0357_001:0241a04_1"
    },
    {
        "source_sentence": "不可見、不可觀。",
        "translation": "They can't be seen or contemplated.",
        "source": "T12n0357_001:0241a06_2"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241a06_3"
    },
    {
        "source_sentence": "彼大妙法鼓於何時出聲？",
        "translation": "At what time does the great and wonderful drum of the Dharma make its sound?",
        "source": "T12n0357_001:0241a06_4"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241a07_5"
    },
    {
        "source_sentence": "以彼諸天耽著五欲境界，常不捨離，增長放逸，不入善法堂聞法思義。",
        "translation": "Because those gods are addicted to the five objects of desire, they always don't abandon them, increase in carelessness, and don't enter the hall of good qualities to hear the meaning of Dharma and contemplate it.",
        "source": "T12n0357_001:0241a07_6"
    },
    {
        "source_sentence": "釋提桓因亦耽著五欲境界，常不捨離，增長放逸，不入善法堂，不昇高座為天說法。",
        "translation": "Śakra, lord of the gods, is also addicted to the realm of the five desires. He always does not abandon it and increases in carelessness. He does not enter a good dharma hall or ascend a high seat to preach the Dharma for the gods.",
        "source": "T12n0357_001:0241a09_7"
    },
    {
        "source_sentence": "爾時，彼大妙法鼓——不可見、不可觀，過眼境界——住虛空中出妙法聲。",
        "translation": "At the time, that great marvelous dharma drum- which can't be seen or contemplated and transcends the eye realm- stood in space and produced a wonderful dharma sound.",
        "source": "T12n0357_001:0241a11_8"
    },
    {
        "source_sentence": "彼妙法聲遍聞三十三天而作是言：『諸天當知，一切色、聲、香、味、觸、法皆悉無常，",
        "translation": "The voice of the sublime teaching pervaded the thirty-three heavens and said, “Deities, know that all forms, sounds, smells, tastes, touch, and dharmas are impermanent.",
        "source": "T12n0357_001:0241a12_9"
    },
    {
        "source_sentence": "莫行放逸，天報速退。",
        "translation": "Don't practice carelessness, and the heavenly rewards will quickly retreat.",
        "source": "T12n0357_001:0241a14_10"
    },
    {
        "source_sentence": "諸天當知，一切行苦、一切行空、一切行無我。",
        "translation": "The gods should know that all conditioned things are painful, all conditioned things are empty, and all conditioned things are without self.",
        "source": "T12n0357_001:0241a14_11"
    },
    {
        "source_sentence": "是故，諸天莫行放逸。",
        "translation": "Therefore, gods don't act carelessly.",
        "source": "T12n0357_001:0241a15_12"
    },
    {
        "source_sentence": "若退天報，生餘苦處。",
        "translation": "If he regresses from the heavenly retribution, he'll be born in another painful place.",
        "source": "T12n0357_001:0241a16_13"
    },
    {
        "source_sentence": "諸天當共議法、樂法、喜法、味法、順法、念法。",
        "translation": "The gods will discuss the Dharma, the Dharma of pleasure, the Dharma of joy, the Dharma of enjoyment, the Dharma of flavor, the Dharma of obedience, and the Dharma of mindfulness together.",
        "source": "T12n0357_001:0241a16_14"
    },
    {
        "source_sentence": "諸天若欲不捨天報、五欲境界，應正修行。』",
        "translation": "If gods want to not abandon the heavenly rewards and the five objects of desire, they should correctly cultivate them.'",
        "source": "T12n0357_001:0241a17_15"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241a18_16"
    },
    {
        "source_sentence": "彼法鼓聲，不可見、無色，不分別、無分別，過眼境界，不生、不滅，",
        "translation": "The sound of that drum of truth is invisible and formless, without distinction or discrimination; beyond the realm of the eye, it neither arises nor perishes.",
        "source": "T12n0357_001:0241a19_0"
    },
    {
        "source_sentence": "離音聲、語言，離心意、意識。",
        "translation": "They're free of sounds and words, and they're free of mind, thought, and consciousness.",
        "source": "T12n0357_001:0241a20_1"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241a20_2"
    },
    {
        "source_sentence": "爾時，三十三天聞妙鼓聲，即入善法堂，議法、樂法、喜法、味法、順法、念法，",
        "translation": "At that time the thirty-three gods heard the sound of a wonderful drum and immediately entered the hall called Sudharma. They discussed the Dharma, delighted in the Dharma, delighted in the Dharma, delighted in the Dharma, delighted in the Dharma, enjoyed the Dharma, followed the Dharma, and remembered the Dharma.",
        "source": "T12n0357_001:0241a21_3"
    },
    {
        "source_sentence": "如說修行。",
        "translation": "It's as explained in the cultivation of practice.",
        "source": "T12n0357_001:0241a22_4"
    },
    {
        "source_sentence": "於彼天退，生餘勝處。",
        "translation": "Withdrawn from that heaven, they'll be born in another superior place.",
        "source": "T12n0357_001:0241a23_0"
    },
    {
        "source_sentence": "釋提桓因亦入善法堂，昇法高座，為諸天說法。",
        "translation": "Śakra Devānām-Indra also entered the hall of the fine dharma, ascended the high seat of the Dharma, and taught the Dharma to the gods.",
        "source": "T12n0357_001:0241a23_1"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241a25_0"
    },
    {
        "source_sentence": "若阿修羅共彼諸天鬪戰之時，三十三天力弱退散。",
        "translation": "When the asuras fight with the gods, the Trāyastriṃśa gods retreat in weakness.",
        "source": "T12n0357_001:0241a25_1"
    },
    {
        "source_sentence": "爾時，法鼓於虛空中出如是聲，阿修羅聞甚大驚怖，退入大海。",
        "translation": "At the time, the Dharma drum made this kind of sound in the sky, and the asuras were terrified when they heard it and retreated into the ocean.",
        "source": "T12n0357_001:0241a26_2"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241a28_0"
    },
    {
        "source_sentence": "彼大法鼓，無形相、無作者，不可見、不可觀，元無實、不可思議，無心、無相，",
        "translation": "That great drum of teaching has no shape or form and no maker; it cannot be seen or contemplated. It is inherently insubstantial, inconceivable, without mind or marks.",
        "source": "T12n0357_001:0241a28_1"
    },
    {
        "source_sentence": "無色、無聲，無體、無二，過眼境界。",
        "translation": "The absence of form and sound, the absence of essence and nonduality transcends the realm of the eye.",
        "source": "T12n0357_001:0241a29_2"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241b01_3"
    },
    {
        "source_sentence": "三十三天依本行業，彼大妙鼓空中出聲，令彼諸天遠離一切諸障、憂惱，",
        "translation": "In the heaven of the thirty-three gods, depending on their original karma, that great marvelous drum produces a sound in the sky that causes those gods to be freed from all hindrances and sorrow.",
        "source": "T12n0357_001:0241b01_4"
    },
    {
        "source_sentence": "無染、寂靜。",
        "translation": "They are undefiled and quiescent.",
        "source": "T12n0357_001:0241b03_5"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241b03_6"
    },
    {
        "source_sentence": "如彼空中大法鼓，身不可見、不可觀，元無實、不可思議，無心、無相，",
        "translation": "“Furthermore, just as the great drum of teaching in space is invisible and cannot be seen or perceived, it has no essence, no reality, no ideation, no mind, and no signs.",
        "source": "T12n0357_001:0241b03_7"
    },
    {
        "source_sentence": "無色、無聲，無物、無二，過眼境界，依本行業，法鼓出聲，令三十三天遠離一切諸障、憂惱，",
        "translation": "The thirty-three gods are formless, soundless, nonsubstantial, and nondual. Beyond the [realm of] vision, depending on their original activity, the drum of Dharma produces sound that enables the thirty-three gods to be freed from all hindrances and distress.",
        "source": "T12n0357_001:0241b05_8"
    },
    {
        "source_sentence": "無染、寂靜。",
        "translation": "They are undefiled and quiescent.",
        "source": "T12n0357_001:0241b07_9"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241b07_10"
    },
    {
        "source_sentence": "如三十三天心放逸時，彼妙法鼓出大音聲，令三十三天遠離一切諸障、憂惱，",
        "translation": "“Furthermore, just as when the thirty-three gods’ minds are lazy, the drum of the sublime Teaching produces a loud sound that enables the thirty-three gods to be freed from all hindrances and grief.",
        "source": "T12n0357_001:0241b07_11"
    },
    {
        "source_sentence": "無染、寂靜。",
        "translation": "They are undefiled and quiescent.",
        "source": "T12n0357_001:0241b09_12"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241b09_13"
    },
    {
        "source_sentence": "如是，如來、應、正遍知清淨法身，一切世間所不能見，元無實、不可思議，",
        "translation": "Thus, the pure Dharma body of the Tathāgata, Arhat, Perfectly Enlightened One cannot be seen by any worldlings; it is unreal and inconceivable.",
        "source": "T12n0357_001:0241b10_14"
    },
    {
        "source_sentence": "無心、無相，無色、無體、無二，過眼境界。",
        "translation": "The absence of mind and marks, formlessness, bodylessness, and nonduality transcend the realm of the eye.",
        "source": "T12n0357_001:0241b11_15"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241b12_16"
    },
    {
        "source_sentence": "如彼眾生依本業行，隨心能信得聞法聲，而彼法聲能令眾生遠離一切諸障、憂惱，",
        "translation": "Just as those sentient beings, relying on their original actions and deeds, can faithfully hear the sound of the Dharma according to their mentalities, whereas that sound of the Dharma enables sentient beings to be freed from all hindrances and sorrow.",
        "source": "T12n0357_001:0241b12_17"
    },
    {
        "source_sentence": "無染、寂靜。",
        "translation": "They are undefiled and quiescent.",
        "source": "T12n0357_001:0241b14_18"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241b14_19"
    },
    {
        "source_sentence": "彼清淨法身無說、無體，而諸眾生依善根業力聞妙法聲，謂如來說法、謂世間有佛。",
        "translation": "The pure Dharma body has no explanation and no essence, yet sentient beings rely on the karmic power of good roots to hear the sound of the wonderful Dharma, which means the Tathāgata teaches the Dharma and says there are buddhas in the world.",
        "source": "T12n0357_001:0241b15_20"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241b16_21"
    },
    {
        "source_sentence": "一切眾生聞如來聲，能得一切樂具，已信者令得正解，聞聲正解是如來身。",
        "translation": "All sentient beings who hear the Tathāgata's voice can attain all the instruments of pleasure, and those who have faith will attain correct understanding, and hearing sound and correct understanding are the Tathāgata's body.",
        "source": "T12n0357_001:0241b17_22"
    },
    {
        "source_sentence": "初發心菩薩及一切凡夫眾生聞如來說法、觀察如來，增長一切善根。",
        "translation": "The first-arousal bodhisattva and all worldly sentient beings who hear the Tathāgata teach the Dharma and observe the Tathāgata will grow all good roots.",
        "source": "T12n0357_001:0241b18_23"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241b20_24"
    },
    {
        "source_sentence": "如來、應、正遍知清淨法身不生、不滅，應如是知。",
        "translation": "The Tathāgata, Arhat, and Perfectly Enlightened One know that the pure Dharma body doesn't arise or cease, and they should thus know it.",
        "source": "T12n0357_001:0241b20_25"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241b21_26"
    },
    {
        "source_sentence": "譬如初夏，依諸眾生本業力故，大地所有種子、穀、草、叢林、藥木出生增長，",
        "translation": "It's like the first summer, when all the seeds, grains, grass, plants, trees, shrubs, and medicinal trees grow in the land based on the power of the original actions of sentient beings.",
        "source": "T12n0357_001:0241b22_0"
    },
    {
        "source_sentence": "為與眾生資生樂具。",
        "translation": "It's for the purpose of providing sentient beings with the necessities and instruments of happiness.",
        "source": "T12n0357_001:0241b23_1"
    },
    {
        "source_sentence": "上虛空中出如是風，如是風者能生大雲；",
        "translation": "“Such-and-such wind blows upward in space and produces great clouds.",
        "source": "T12n0357_001:0241b24_2"
    },
    {
        "source_sentence": "生大雲者能澍大雨；",
        "translation": "A great cloud that grows is able to pour down a great rain.",
        "source": "T12n0357_001:0241b25_3"
    },
    {
        "source_sentence": "澍大雨者能滿大地；",
        "translation": "The great rain pourer is able to fill the earth.",
        "source": "T12n0357_001:0241b25_4"
    },
    {
        "source_sentence": "滿大地者能令一切諸種滋茂。",
        "translation": "A person who fills the great earth can cause all kinds to flourish.",
        "source": "T12n0357_001:0241b26_5"
    },
    {
        "source_sentence": "爾時，一切閻浮提人皆大歡喜，生大踊躍而作是言：『此是大雲、此是大雨。』",
        "translation": "At that point, all the people in Jambudvīpa were greatly joyful, gave rise to great eloquence, and said, 'This is a great cloud or this is a great rain.'",
        "source": "T12n0357_001:0241b26_6"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241b28_7"
    },
    {
        "source_sentence": "於虛空中天不雨時，閻浮提人作如是言：『無雲、無雨。』",
        "translation": "When it doesn't rain in the sky, the people of Jambudvīpa say, 'There's no cloud and no rain.'",
        "source": "T12n0357_001:0241b28_8"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241b29_9"
    },
    {
        "source_sentence": "隨何時中普興大雲、遍澍大雨，時諸眾生咸作是言：『希有，大雲。",
        "translation": "At any given time, great clouds arose and poured down rain all over the sky.",
        "source": "T12n0357_001:0241c01_10"
    },
    {
        "source_sentence": "希有，大雨。",
        "translation": "Rarely it rains heavily.",
        "source": "T12n0357_001:0241c02_11"
    },
    {
        "source_sentence": "普澍大雨充滿大地。』",
        "translation": "It pours down a great rain that fills the earth.'",
        "source": "T12n0357_001:0241c02_12"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c03_13"
    },
    {
        "source_sentence": "而彼虛空無雲、無雨。",
        "translation": "And that space has no clouds and no rain.",
        "source": "T12n0357_001:0241c03_14"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c03_15"
    },
    {
        "source_sentence": "依因於風，彼虛空中能生大雲、能生大雨。",
        "translation": "Depending on the cause of wind, great clouds and rain can arise in space.",
        "source": "T12n0357_001:0241c04_16"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c05_17"
    },
    {
        "source_sentence": "依因於風，彼虛空中無雲、無雨。",
        "translation": "Depending on the causes of the wind, there are no clouds or rain in the sky.",
        "source": "T12n0357_001:0241c05_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0357_001:0241c06_0"
    },
    {
        "source_sentence": "以依眾生本業力故。",
        "translation": "It's because they rely on the power of the original karma of sentient beings.",
        "source": "T12n0357_001:0241c06_1"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c06_2"
    },
    {
        "source_sentence": "如彼水聚於虛空中，風因緣住，依風而雨，而世間人稱言雲雨。",
        "translation": "It's like that water cluster in space where the wind abides for causes and conditions, and rain comes down depending on the wind, while people in the world call it a cloud or rain.",
        "source": "T12n0357_001:0241c06_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0357_001:0241c08_4"
    },
    {
        "source_sentence": "以依眾生本業力故，於虛空中澍大雨聚，充滿大地。",
        "translation": "By relying on the power of sentient beings' original karmic forces, they pour a great cloud of rain in space that fills the earth.",
        "source": "T12n0357_001:0241c08_5"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c09_6"
    },
    {
        "source_sentence": "彼虛空中無雲、無雨。",
        "translation": "There are no clouds or rain in the sky.",
        "source": "T12n0357_001:0241c09_7"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c10_8"
    },
    {
        "source_sentence": "彼大雲雨自性不生、不滅，離心意、意識，離去、來相。",
        "translation": "That great cloud of rain doesn't arise or cease by its own nature, is free of mind, thought, and consciousness, and has no past or future characteristics.",
        "source": "T12n0357_001:0241c10_9"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c11_10"
    },
    {
        "source_sentence": "如是，諸菩薩摩訶薩依過去善根、修諸善行聞佛說法，得無障礙道；",
        "translation": "“In the same way, great enlightening beings hear the Teaching from buddhas by relying on past roots of goodness and cultivating good practices to attain unobstructed paths.",
        "source": "T12n0357_001:0241c11_11"
    },
    {
        "source_sentence": "一切眾生、一切聲聞、辟支佛等種諸善根，求涅槃道。",
        "translation": "All sentient beings, all śrāvakas and pratyekbuddhas cultivate good roots and seek the path of nirvāṇa.",
        "source": "T12n0357_001:0241c13_12"
    },
    {
        "source_sentence": "世間眾生便謂：『如來、應、正遍知出現於世，如來說法皆是真語、如語、不異語。』",
        "translation": "The worldly sentient beings then said, 'The Tathāgata, Arhat, and Perfectly Enlightened One appear in the world, and the Tathāgata teaches that all true words, such words, and not different words are true words.'",
        "source": "T12n0357_001:0241c14_13"
    },
    {
        "source_sentence": "而諸天人稱言如來，文殊師利！",
        "translation": "The gods and humans then called it the Tathāgata, Mañjuśrī!",
        "source": "T12n0357_001:0241c16_14"
    },
    {
        "source_sentence": "以依眾生善根力故法身出聲，而諸天人作如是言：『如來說法。』",
        "translation": "Because of the power of sentient beings' good roots, the Dharma body produces sounds, and gods and humans say, 'The Tathāgata teaches the Dharma.'",
        "source": "T12n0357_001:0241c17_15"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c18_16"
    },
    {
        "source_sentence": "實無如來。",
        "translation": "There really isn't a tathāgata.",
        "source": "T12n0357_001:0241c18_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0357_001:0241c19_0"
    },
    {
        "source_sentence": "如來法身，無相、離相，無處、離處，不實、不生、不滅。",
        "translation": "The Tathāgata's Dharma body has no marks and is free of marks, no place and no location, which are not real, not arisen, and not ceased.",
        "source": "T12n0357_001:0241c19_1"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c20_2"
    },
    {
        "source_sentence": "而彼如來樂說辯才，為天人說法無有窮盡，隨所應聞皆令開解。",
        "translation": "The Tathāgata delights in explaining the power of eloquence and teaches the Dharma to gods and humans without limit, enabling them to understand whatever they should hear.",
        "source": "T12n0357_001:0241c20_3"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c21_4"
    },
    {
        "source_sentence": "始發心菩薩及以一切毛道凡夫，依於眾生本業力故，應見如來入涅槃者，",
        "translation": "Enlightening beings who have just set out for enlightenment, as well as all the ordinary people with hair on their bodies, should see the Buddha enter nirvana because they rely upon the power of past actions of sentient beings.",
        "source": "T12n0357_001:0241c22_5"
    },
    {
        "source_sentence": "如來即便入於涅槃，不可得見。",
        "translation": "Even if the Tathāgata enters nirvāṇa, he won't be able to see it.",
        "source": "T12n0357_001:0241c23_6"
    },
    {
        "source_sentence": "而彼眾生起如是心，便謂：『如來畢竟涅槃。』",
        "translation": "When those sentient beings give rise to this kind of mind, they say, 'The Tathāgata has finally entered nirvāṇa.'",
        "source": "T12n0357_001:0241c24_7"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c25_8"
    },
    {
        "source_sentence": "如來、應正遍知不生、不死，不起、不滅。",
        "translation": "The Tathāgata, Arhat, Perfectly Enlightened One knows that they don't arise and don't die, and they don't arise or cease.",
        "source": "T12n0357_001:0241c25_9"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c26_10"
    },
    {
        "source_sentence": "如來、應、正遍知無始世來，證於常住大般涅槃。",
        "translation": "The Tathāgata, Arhat, and Perfectly Enlightened One came from beginningless time to realize the eternally abiding great nirvāṇa of parinirvāṇa.",
        "source": "T12n0357_001:0241c26_11"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c27_12"
    },
    {
        "source_sentence": "如彼大雲不實、不生、不滅，虛妄故有，而諸眾生念想假名雲、雨如是。",
        "translation": "Like those great clouds that are not real, don't arise, and don't cease, they exist because they're false, but sentient beings conceptualize them as nominal clouds and rain in the same way.",
        "source": "T12n0357_001:0241c28_13"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0241c29_14"
    },
    {
        "source_sentence": "如來不實、不生、不滅，本來不生，而諸眾生隨其心想，聞如來、應、正遍知現有說法。",
        "translation": "The Tathāgata doesn't really exist, doesn't arise, and doesn't cease, and originally doesn't arise, but sentient beings follow their mental perceptions and hear the Tathāgata, Arhat, and Perfectly Enlightened One presently expounding the Dharma.",
        "source": "T12n0357_001:0241c29_15"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242a03_0"
    },
    {
        "source_sentence": "譬如大自在梵天王於十百千萬三千大千諸世界中自在無礙，下觀一切諸天宮殿，",
        "translation": "“Furthermore, it is as if the great sovereign lord of Brahmā were to reside freely and unobstructed in one hundreds of millions of billions of myriads of trillions of worlds. Below him he surveyed all the celestial palaces:",
        "source": "T12n0357_001:0242a03_1"
    },
    {
        "source_sentence": "乃至觀於四天王等。",
        "translation": "It's even observing the four heavenly kings and so forth.",
        "source": "T12n0357_001:0242a05_2"
    },
    {
        "source_sentence": "爾時，彼大自在梵天王於彼十百千萬三千大千諸世界中為自在主，觀於一切諸天宮殿。",
        "translation": "At the time, that great sovereign Brahma king of Brahmā was the unimpeded lord of all the celestial palaces and halls in those billions of worlds.",
        "source": "T12n0357_001:0242a05_3"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242a07_4"
    },
    {
        "source_sentence": "時宮殿中一切諸天各各捨於五欲境界、一切伎樂，捨諸欲念，生大恭敬心，",
        "translation": "All the gods in the palace at that time relinquished all their objects and pleasures of the five realms of desire. They relinquished all kinds of music and entertained themselves with a sense of craving, feeling great reverence and respect.",
        "source": "T12n0357_001:0242a07_5"
    },
    {
        "source_sentence": "合掌供養大梵天王，瞻仰而住。",
        "translation": "They joined their palms to offer support to the great Brahmadeva king, who stood there gazing respectfully.",
        "source": "T12n0357_001:0242a09_6"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242a10_7"
    },
    {
        "source_sentence": "而彼大自在梵天王於彼一切諸宮殿中暫時而現。",
        "translation": "That great sovereign Brahmā appears temporarily in all those palaces for a while.",
        "source": "T12n0357_001:0242a10_8"
    },
    {
        "source_sentence": "爾時諸天為生梵世，所有善根迴向梵天。",
        "translation": "At that point, the gods are born in the Brahma world and dedicate their good roots to the Brahma heavens for the sake of sentient beings.",
        "source": "T12n0357_001:0242a11_9"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242a12_10"
    },
    {
        "source_sentence": "彼大自在梵天王十百千萬三千大千諸世界主，不退梵天，住持梵宮，依自在願住持力故、一切眾生善根力故，",
        "translation": "The great sovereign brahma king of the ten million, three thousand great one-thousand world leaders and the nonregressing brahma gods abide in the palace of Brahmā because of the power of maintaining by relying on their independent vows and the power of the roots of goodness of all sentient beings.",
        "source": "T12n0357_001:0242a12_11"
    },
    {
        "source_sentence": "應化梵天，日日觀察。",
        "translation": "The Nirmāṇarati Brahmadeva observes it day after day.",
        "source": "T12n0357_001:0242a15_12"
    },
    {
        "source_sentence": "一切天宮下至四天王天，各各捨於五欲境界、一切伎樂，捨諸欲念，生大恭敬心，",
        "translation": "All the celestial palaces of all the gods, down to the four heavenly kings, each relinquished their five objects of desire and all their pleasures, relinquished thoughts of desire, and conceived great reverence.",
        "source": "T12n0357_001:0242a15_13"
    },
    {
        "source_sentence": "合掌供養大梵天王，瞻仰而住。",
        "translation": "They joined their palms to offer support to the great Brahmadeva king, who stood there gazing respectfully.",
        "source": "T12n0357_001:0242a17_14"
    },
    {
        "source_sentence": "而彼大自在梵天王於彼一切諸宮殿中暫時現身，於本處不動。",
        "translation": "That great sovereign Brahmā manifested his body for a while in all those palaces, but he didn't move from his original place.",
        "source": "T12n0357_001:0242a18_15"
    },
    {
        "source_sentence": "彼時諸天為生梵世，所有善根迴向梵天。",
        "translation": "In order to be born in the Brahma world, the gods then dedicate all their good roots to the Brahma heavens.",
        "source": "T12n0357_001:0242a19_16"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242a20_17"
    },
    {
        "source_sentence": "而於彼處無實梵天。",
        "translation": "In that place, there's no real Brahma Heaven.",
        "source": "T12n0357_001:0242a20_18"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242a21_19"
    },
    {
        "source_sentence": "彼梵天空、彼梵天無、不實，無名字、無音聲，無住處、無體，不思議、無相，",
        "translation": "The Brahma heavens and the other Brahma heavens are nonexistent, insubstantial, nameless, voiceless, without abode, bodyless, inconceivable, formless.",
        "source": "T12n0357_001:0242a21_20"
    },
    {
        "source_sentence": "離心意、意識，不生、不滅。",
        "translation": "Being free of mind, thought, and consciousness, they don't arise or cease.",
        "source": "T12n0357_001:0242a23_21"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242a23_22"
    },
    {
        "source_sentence": "彼大梵天依本願善根住持力故、依彼諸天善根住持力故，於彼一切諸宮殿中暫時現身。",
        "translation": "Because of the power of maintaining roots of goodness from their original vow, and because of the power of maintaining roots of goodness from those gods, the Mahābrahmā gods temporarily manifested their bodies in all those palaces.",
        "source": "T12n0357_001:0242a23_23"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242a26_0"
    },
    {
        "source_sentence": "而彼諸天不知梵天身空、無、不實，無名字、無音聲，無住處、無體，",
        "translation": "The gods did not know that the bodies of the Brahmā gods are empty, nonexistent, or insubstantial; they have no names, no sounds, no dwelling places, and no bodies.",
        "source": "T12n0357_001:0242a26_1"
    },
    {
        "source_sentence": "不思議、無相，離心意、意識，不生、不滅。",
        "translation": "They are inconceivable, signless, and apart from mind, thought, and consciousness, they don't arise or cease.",
        "source": "T12n0357_001:0242a27_2"
    },
    {
        "source_sentence": "「如是，文殊師利！",
        "translation": "So it is, Mañjuśrī!",
        "source": "T12n0357_001:0242a28_3"
    },
    {
        "source_sentence": "如來、應、正遍知空、無、不實，無名字、無音聲，無住處、無體，不思議、無相，",
        "translation": "The Tathāgata, Arhat, Perfectly Enlightened One knows emptiness, nonexistence, and insubstantiality; it has no names, no sounds, no dwelling places, no bodies, is inconceivable, and has no marks.",
        "source": "T12n0357_001:0242a28_4"
    },
    {
        "source_sentence": "離心意、意識，不生、不滅亦復如是。",
        "translation": "Free of mind, thought, and consciousness, it doesn't arise or cease, so it is likewise.",
        "source": "T12n0357_001:0242b01_5"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242b02_6"
    },
    {
        "source_sentence": "如來、應、正遍知依彼菩薩本願行力住持初發心菩薩、住一切聲聞、辟支佛乘。",
        "translation": "The Tathāgata, Arhat, and Perfectly Enlightened One relied on the power of their bodhisattva's past vows and practices to support the first-arisen bodhisattva who abided in the vehicle of all śrāvakas and pratyekbuddhas.",
        "source": "T12n0357_001:0242b02_7"
    },
    {
        "source_sentence": "依一切毛道凡夫善根力故，如來應現百千萬相好莊嚴之身，如鏡中像，",
        "translation": "Because of the power of all the roots of goodness of ordinary people on the pores of their hair, the Tathāgata should manifest a body adorned with hundreds of thousands of myriads of koṭis of marks like a reflection in a mirror.",
        "source": "T12n0357_001:0242b04_8"
    },
    {
        "source_sentence": "本處不動。",
        "translation": "The original place doesn't move.",
        "source": "T12n0357_001:0242b05_9"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242b06_10"
    },
    {
        "source_sentence": "初發心菩薩、一切聲聞、辟支佛及毛道凡夫，不知如來、應、正遍知空、無、不實、不可觀，",
        "translation": "The first-arousal bodhisattvas, all śrāvakas, pratyekabuddhas, and worldlings of the hairy path did not know that the Tathāgata, Arhat, Perfectly Enlightened One is empty, nonexistent, unreal, and invisible.",
        "source": "T12n0357_001:0242b06_11"
    },
    {
        "source_sentence": "無名字、無音聲，無住處、無體，不思議、無相，離心意、意識，不生、不滅。",
        "translation": "There are no names, no sounds, no dwelling places, no bodies, inconceivable, and no marks, and apart from mind, thought, and consciousness, they don't arise or cease.",
        "source": "T12n0357_001:0242b08_12"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242b09_13"
    },
    {
        "source_sentence": "而如來百千萬億種種相好、莊嚴之身具足，如來一切種種諸威儀行，隨諸眾生種種信故，",
        "translation": "The hundreds of thousands of myriads of koṭis of buddha-bodies of the Enlightened are endowed with various marks and embellishments, their bodies adorned in all kinds of ways. All the various deportments of the Enlightened are carried out according to the various faiths of living beings.",
        "source": "T12n0357_001:0242b09_14"
    },
    {
        "source_sentence": "出大妙聲為眾生說法，能令眾生遠離一切諸障、憂惱，無染、寂靜，而如來一切平等捨心無分別、無異心。",
        "translation": "He produces a great subtle sound to teach the Dharma for sentient beings, able to cause sentient beings to be free of all hindrances and grief, undefiled and quiescent, while the Tathāgata equally abandons all minds without discrimination or distinction and has no different mind.",
        "source": "T12n0357_001:0242b11_15"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242b14_16"
    },
    {
        "source_sentence": "以是義故，言不生、不滅者，是名如來。」",
        "translation": "Because of this meaning, it's called the Tathāgata when he says that what doesn't arise and doesn't cease.",
        "source": "T12n0357_001:0242b14_17"
    },
    {
        "source_sentence": "「如來常不生，　　諸法亦復然，",
        "translation": "The Tathāgata is eternal and unarisen, So are all things.",
        "source": "T12n0357_001:0242b15_18"
    },
    {
        "source_sentence": "　世間無實法，　　愚癡妄取相。",
        "translation": "The world has no real dharmas, and foolish people falsely grasp their characteristics.",
        "source": "T12n0357_001:0242b15_18"
    },
    {
        "source_sentence": "　無漏善法中，　　無如及如來，",
        "translation": "In uncontaminated wholesome dharmas, there’s no suchness or a tathāgata.",
        "source": "T12n0357_001:0242b15_18"
    },
    {
        "source_sentence": "　依彼善法力，　　現世如鏡像。",
        "translation": "Relying on the power of that good dharma, it's like a mirror image in the present world.",
        "source": "T12n0357_001:0242b15_18"
    },
    {
        "source_sentence": "爾時，世尊而說偈言：「文殊師利！",
        "translation": "It was then that the Bhagavān spoke a verse, saying, Mañjuśrī!",
        "source": "T12n0357_001:0242b15_18"
    },
    {
        "source_sentence": "譬如日光初出，先照最大山王，次照斫迦婆羅山、摩訶斫迦婆羅山，次照餘大山，",
        "translation": "It's like when the sun first comes out, it first shines on the greatest mountain king, then on Mount Cakravāḍa and Mount Mahācakravāḍa, and then it shines on the other great mountains.",
        "source": "T12n0357_001:0242b20_19"
    },
    {
        "source_sentence": "次照餘黑山，次照高原、堆阜，後照深谷、卑下之處。",
        "translation": "The second illuminates the other black mountains, the second illuminates the high plains and mounds, and the second illuminates the deep valleys and lowlands.",
        "source": "T12n0357_001:0242b22_20"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242b23_21"
    },
    {
        "source_sentence": "而彼日光不分別、無分別、不思惟。",
        "translation": "That sunbeam doesn't discriminate, doesn't discriminate, and doesn't contemplate.",
        "source": "T12n0357_001:0242b23_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0357_001:0242b24_23"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242b24_24"
    },
    {
        "source_sentence": "彼日光明無心意、意識，不生、不滅，無相、離相，無念、離念，無戲論、無障礙、離障礙，",
        "translation": "The light of that sun has no mind or thought and no consciousness, neither arising nor perishing; it has no marks or signlessness, no thought or thoughtlessness, no conceptual elaborations, no obstruction or obstruction.",
        "source": "T12n0357_001:0242b24_25"
    },
    {
        "source_sentence": "不住此岸、不住彼岸，不高、不下，不縛、不脫，不知、非不知，無煩惱、非無煩惱，",
        "translation": "They don’t abide on this shore or on the other shore; they don’t ascend or descend, aren’t bound or liberated, don’t know or don’t know, have no afflictions or no afflictions.",
        "source": "T12n0357_001:0242b26_26"
    },
    {
        "source_sentence": "非實、非不實，不在此岸、不在彼岸，不在陸地、不在水中，不在兩岸、不在中流，",
        "translation": "They are neither real nor unreal, not on shore or at another shore, not on land or in water, not on both sides or in the middle of the river.",
        "source": "T12n0357_001:0242b28_27"
    },
    {
        "source_sentence": "無覺、離覺，無色、非無色。",
        "translation": "The absence of perception and the absence of perception are formless and not formless.",
        "source": "T12n0357_001:0242b29_28"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242c01_29"
    },
    {
        "source_sentence": "依於大地有高、下、中，日光隨地有高、下、中。",
        "translation": "Depending on the ground, there's high, low, and middle of the earth, and there's high, low, and middle of the sunlight that follows the ground.",
        "source": "T12n0357_001:0242c01_30"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242c02_31"
    },
    {
        "source_sentence": "如來、應正遍知亦復如是，不分別、無分別、不思惟。",
        "translation": "So it is with the Tathāgata, Arhat, Perfectly Enlightened One, who doesn't discriminate, doesn't discriminate, and doesn't think.",
        "source": "T12n0357_001:0242c02_32"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242c03_33"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0357_001:0242c04_34"
    },
    {
        "source_sentence": "如來、應、正遍知離心意、意識，不生、不滅，無相、離相，無念、離念，",
        "translation": "“The Tathāgata, Arhat, Perfectly Enlightened One knows that apart from mind and thought consciousness, there is neither arising nor ceasing.",
        "source": "T12n0357_001:0242c04_35"
    },
    {
        "source_sentence": "無戲論、離戲論，無熱惱、離熱惱，不住此岸、不住彼岸，不高、不下，",
        "translation": "He has no conceptual elaborations and is free of conceptual elaborations. He has no fever and is free of fever. He does not dwell on this shore or on the other shore. He neither ascends nor descends.",
        "source": "T12n0357_001:0242c05_36"
    },
    {
        "source_sentence": "不縛、不脫，不知、非不知，無煩惱、非無煩惱，非實語者、非不實語者，",
        "translation": "They are not bound or liberated, do not know or don’t know, have no afflictions or non-afflictions, and speak neither truly nor falsely.",
        "source": "T12n0357_001:0242c07_37"
    },
    {
        "source_sentence": "不在此岸、不在彼岸，不在陸地、不在水中，不在兩岸、不在中流，非一切知者、非無一切知者，",
        "translation": "They are not on this shore or on the other shore; they are not on land or in water; they are not on both sides or in midstream. They are neither omniscience nor nonknowledgeless.",
        "source": "T12n0357_001:0242c08_38"
    },
    {
        "source_sentence": "非覺者、非無覺者，非行者、非無行者，非修習者、非無修習者，非念者、非無念者，",
        "translation": "What’s not perceived and what’s not perceived, what’s not practiced and what’s not practiced, what’s not cultivated and what’s not cultivated, what’s not mindful and what’s not mindless.",
        "source": "T12n0357_001:0242c10_39"
    },
    {
        "source_sentence": "非有心者、非無心者，離心者、非離心者，無意者、非無意者，非害者、非無害者，",
        "translation": "What’s not with mind and what’s not without mind, what’s free from mind and what’s not free from mind, what’s without mind and what’s not without mind, what’s neither harmful nor harmless.",
        "source": "T12n0357_001:0242c12_40"
    },
    {
        "source_sentence": "非名者、非無名者，非色者、非無色者，非說者、非無說者，非假名者、非無假名者，",
        "translation": "What’s not name and what’s not nameless, what’s not form and what’s not formless, what’s not explanation and what’s not without explanation, what’s not nominal and what’s not without nominal names.",
        "source": "T12n0357_001:0242c14_41"
    },
    {
        "source_sentence": "非可見者、非不可見者，體性如是、非不如是，非說道者、非無說道者，",
        "translation": "What’s not visible and what’s not invisible: the essential nature is thus; what’s not dissimilar is not so. “The one who doesn’t teach the path” does not say ‘the path’ or ‘one who doesn’t teach the path’.",
        "source": "T12n0357_001:0242c15_42"
    },
    {
        "source_sentence": "非證果者、非無證果者，非分別者、非無分別者，非離分別者、非無離分別者。",
        "translation": "Those who aren't realizing the fruit and those who aren't without realizing the fruit, those who aren't discriminating and those who aren't free of discrimination, and those who aren't free of discrimination and aren't free of discrimination.",
        "source": "T12n0357_001:0242c17_43"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242c19_44"
    },
    {
        "source_sentence": "依彼無邊法界眾生上、中、下性，如來放大智日光輪普照眾生亦復如是。",
        "translation": "Relying on the higher, middle, and lower natures of those sentient beings in the boundless realm of reality, the Tathāgata emanates great wisdom that illuminates all sentient beings likewise.",
        "source": "T12n0357_001:0242c19_45"
    },
    {
        "source_sentence": "初照一切諸菩薩等清淨直心大乘山王，次復照於住辟支佛乘，次復照於住聲聞乘，",
        "translation": "The first illumines all bodhisattvas equally with pure, straightforward minds like the great vehicle king of mountains; the second further illumines those who abide in the vehicle of the pratyekabuddhas; and the second further illumines those who abide in the vehicle of the śrāvakas.",
        "source": "T12n0357_001:0242c21_0"
    },
    {
        "source_sentence": "次復照於隨所能信善行眾生，次復照於乃至住邪聚眾生，皆為如來一切智日光輪所照，",
        "translation": "They also illumine all sentient beings who are capable of believing in virtuous practices, and they also illumine those who are not endowed with goodness. All the buddhas’ bodhisattva-teachings to sentient beings have been illuminated by the sunlight of omniscience of buddhas.",
        "source": "T12n0357_001:0242c22_1"
    },
    {
        "source_sentence": "為畢竟利益一切眾生、為生未來一切善根、為令增長一切善根。",
        "translation": "It's for the ultimate benefit of all sentient beings, to produce all good roots in the future, and to cause all good roots to grow.",
        "source": "T12n0357_001:0242c25_0"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242c26_1"
    },
    {
        "source_sentence": "如來於彼一切事中平等捨心，無分別、無異心。",
        "translation": "The Tathāgata's mind is equally equanimous in all those things, with no distinctions or differences.",
        "source": "T12n0357_001:0242c26_2"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242c27_3"
    },
    {
        "source_sentence": "諸佛如來智日光輪無如是心：『我為此眾生說於妙法，而不為彼眾生說法。』",
        "translation": "The buddhas and tathāgatas have no such mind, saying, 'I teach the wonderful Dharma for these sentient beings but don't teach it for those sentient beings.'",
        "source": "T12n0357_001:0242c28_0"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0242c29_1"
    },
    {
        "source_sentence": "諸佛如來無有如是分別之心：『此眾生信上法、此眾生信中法、此眾生信下法，",
        "translation": "The buddha-tathāgatas have no such discriminating thoughts: ‘This sentient being believes in the higher Dharma, this sentient being believes in the middle Dharma, and this sentient being believes in the inferior Dharma.",
        "source": "T12n0357_001:0242c29_2"
    },
    {
        "source_sentence": "此眾生信正法、此眾生信邪法。』",
        "translation": "These sentient beings believe in the right teaching and these sentient beings believe in the wrong teaching.'",
        "source": "T12n0357_001:0243a02_3"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243a03_4"
    },
    {
        "source_sentence": "諸佛如來無如是心：『此眾生信上法，為說大乘；",
        "translation": "“Buddhas and buddha-tathāgatas do not have the thought:",
        "source": "T12n0357_001:0243a03_5"
    },
    {
        "source_sentence": "此眾生信中法，為說緣覺乘；",
        "translation": "To those sentient beings who believe in the teaching of the middle way they teach the vehicle of enlightenment.",
        "source": "T12n0357_001:0243a04_6"
    },
    {
        "source_sentence": "此眾生信下法，為說聲聞乘；",
        "translation": "These sentient beings believe in inferior teachings and teach the vehicle of the hearers.",
        "source": "T12n0357_001:0243a05_7"
    },
    {
        "source_sentence": "此眾生信正行，為說清淨心法；",
        "translation": "These sentient beings believe in right practice and teach the principles of pure mind.",
        "source": "T12n0357_001:0243a06_0"
    },
    {
        "source_sentence": "乃至此眾生信邪行，隨所應聞而為說法。』",
        "translation": "Even these sentient beings believe in wrong practices and teach the Dharma according to what they should hear.'",
        "source": "T12n0357_001:0243a06_1"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243a07_2"
    },
    {
        "source_sentence": "諸佛如來智日光輪無有如是分別之心。",
        "translation": "The buddhas, tathāgatas, and wisdom sunlight wheels of the Tathāgata have no such discriminating mind.",
        "source": "T12n0357_001:0243a07_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0357_001:0243a08_4"
    },
    {
        "source_sentence": "諸佛如來智日光輪遠離一切分別、異分別及諸戲論。",
        "translation": "The buddha-tathāgata's wheel of wisdom, the sunlight of the Tathāgata, is free of all discriminations, dissimilarities, and conceptual elaborations.",
        "source": "T12n0357_001:0243a09_5"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243a10_6"
    },
    {
        "source_sentence": "依諸眾生種種善根，諸佛如來智日光輪種種別異。",
        "translation": "Depending on the various good roots of sentient beings, the buddhas, tathāgatas, and sunlight wheels of wisdom of the buddhas differ in various ways.",
        "source": "T12n0357_001:0243a10_7"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243a12_0"
    },
    {
        "source_sentence": "譬如大海中有如意寶珠懸置高幢上，隨何等何等眾生念、須何等何等事，",
        "translation": "It's like the wish-granting jewel in the ocean hanging from a high banner, according to what kinds of sentient beings are mindful and what kinds of things they need.",
        "source": "T12n0357_001:0243a12_1"
    },
    {
        "source_sentence": "如是如是聞彼摩尼寶珠出聲。",
        "translation": "Thus and so thus, he hears the sound of that maṇi-jeweled pearl emanating.",
        "source": "T12n0357_001:0243a13_2"
    },
    {
        "source_sentence": "而彼摩尼寶珠不分別、無分別、不思惟，無心、離心，離心意、意識。",
        "translation": "That maṇi treasure pearl doesn't discriminate, doesn't discriminate, and doesn't contemplate, has no mind and is free of mind, and is free of mind, thought, and consciousness.",
        "source": "T12n0357_001:0243a14_3"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243a16_4"
    },
    {
        "source_sentence": "如來亦復如是，不分別、無分別、不思惟，無心、離心，離心意、意識，",
        "translation": "The Tathāgata is also like this: he has no discrimination, no distinction, and no reflection. He has neither thought nor absence of thought; he is apart from thought and thought-concomitance.",
        "source": "T12n0357_001:0243a16_5"
    },
    {
        "source_sentence": "不可測量、離諸測量，不得、離得，貪不能轉、瞋不能轉、癡不能轉，",
        "translation": "They can’t be measured, are free of measurements, don’t attain and are free of attainment, cannot be developed by craving, cannot be developed by anger, and cannot be developed by delusion.",
        "source": "T12n0357_001:0243a17_6"
    },
    {
        "source_sentence": "不實、不妄，非常、非不常，非照、非不照，非明、非不明，非覺者、非不覺者，",
        "translation": "They are neither real nor false, neither eternal nor impermanent, neither illuminating nor not illuminating, neither clear nor unclear, neither perceiving nor not perceiving.",
        "source": "T12n0357_001:0243a19_7"
    },
    {
        "source_sentence": "不生、不滅，不思議、不可思議，無體、離體，不可取、不可捨，不可戲論、不可說、離諸言說，",
        "translation": "They do not arise or cease, are inconceivable or inconceivable, have no essence or essenceless essence, cannot be grasped or abandoned, cannot be discussed, cannot be explained, and are free of all explanations.",
        "source": "T12n0357_001:0243a20_8"
    },
    {
        "source_sentence": "不喜、離喜，無生，不可數、離諸數量，不去、無去、去寂，絕一切諸趣、離一切言說，",
        "translation": "They are neither joyful nor dispassionate, they are free of joy and non-arisen, they are countless and without number, they don’t go, they don’t depart, they go away, they become silent, they cut off all destinies, they are free of all explanations.",
        "source": "T12n0357_001:0243a22_9"
    },
    {
        "source_sentence": "不可見、不可觀、不可取，非虛空、非不虛空，非可見、非可說，非和合、非離和合，",
        "translation": "What’s invisible, unseen, undefiled, and undefiled is neither space nor non-space; it’s not visible, cannot be seen, cannot be spoken of, is not compounded, is not separate from compounding.",
        "source": "T12n0357_001:0243a24_10"
    },
    {
        "source_sentence": "非作、非造、非示，非染、非可清淨，非名、非色，非相、非無相，非業、非業報，",
        "translation": "They are not made, not made, not shown, not defiled, not purified, not named, not form, not marks, not signless, not action, not the result of action.",
        "source": "T12n0357_001:0243a26_0"
    },
    {
        "source_sentence": "非過去、非未來、非現在，非有煩惱、非無煩惱，非諍、非不諍，非聲、離一切聲、無言，",
        "translation": "They are neither past, nor future, nor present, neither with affliction nor without affliction, neither debilitating nor non-debilitating, not sound, free of all sounds, and without words.",
        "source": "T12n0357_001:0243a27_1"
    },
    {
        "source_sentence": "無相、離一切相，非內、非外、亦非中間。",
        "translation": "Being without marks and free of all marks, it's not internal, not external, and not in between.",
        "source": "T12n0357_001:0243a29_2"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243b01_3"
    },
    {
        "source_sentence": "而如來寶珠清淨直心，懸大慈悲高幢之上，隨何等何等眾生信、何等何等眾生行，",
        "translation": "The Buddha’s jeweled pearl was pure and straightforward-minded, hanging over the high banner of great compassion. Whatever sentient beings there were who believed in it, and whatever sentient beings practiced it.",
        "source": "T12n0357_001:0243b01_4"
    },
    {
        "source_sentence": "聞如是如是說法聲。",
        "translation": "He hears the sound of thus and thus teaching the Dharma.",
        "source": "T12n0357_001:0243b03_5"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243b03_6"
    },
    {
        "source_sentence": "如來於一切事平等捨心，無分別、無異心。",
        "translation": "The Tathāgata's mind is equally equanimous in all things, with no distinctions or differences.",
        "source": "T12n0357_001:0243b04_0"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243b05_0"
    },
    {
        "source_sentence": "譬如響聲，從他而出，眾生得聞。",
        "translation": "It's like the sound of a resonant sound that comes out from another, and sentient beings hear it.",
        "source": "T12n0357_001:0243b05_1"
    },
    {
        "source_sentence": "而彼響聲非過去、非未來、非現在，非內、非外、非二中間可得，非生、非滅，",
        "translation": "And the sound of that echo is not past, not future, not present, not internal, not external, not intermediate between two, not arising and not ceasing.",
        "source": "T12n0357_001:0243b05_2"
    },
    {
        "source_sentence": "非斷、非常，非知、非不知，非覺、非不覺，非明、非不明，非縛、非脫，",
        "translation": "It is neither annihilated nor eternal, neither known nor unknown, neither perceived nor not perceived, neither luminous nor indeterminate, neither bound nor liberated.",
        "source": "T12n0357_001:0243b07_3"
    },
    {
        "source_sentence": "非毀、非不毀，非念、非不念，非處、非不處，非住、非不住，非地界、非水界、非火界、非風界，",
        "translation": "neither disparaging nor not disparaging, neither mindfulness nor non-mindfulness, neither a place nor an unplaced place, neither abiding nor not abiding, neither earth realm nor water realm nor fire realm nor wind realm.",
        "source": "T12n0357_001:0243b08_4"
    },
    {
        "source_sentence": "非有為、非無為，非戲論、非不戲論，非聲、非不聲，非見、非不見，",
        "translation": "It is neither conditioned nor unconditioned. It is neither conceptual thought nor nonconceptual thought. It is neither sound nor soundless. It is neither seen nor not seen.",
        "source": "T12n0357_001:0243b10_5"
    },
    {
        "source_sentence": "非字、非言、非離言語，非稱量、離稱量，非相、離相，非寂靜、非離寂靜，",
        "translation": "What’s not words, what’s not words, what’s not words, what’s not language, what’s not measurement, what’s not measurement, what’s not marks, what’s not marks, what’s not signlessness, what’s not quiescent, and what’s not quiescent.",
        "source": "T12n0357_001:0243b12_6"
    },
    {
        "source_sentence": "非長、非短，非心、非不心，非觀、非不觀，非可見相、非不可見相，",
        "translation": "They are neither long nor short, neither thought nor non-thought, neither contemplation nor non-contemplation, neither visible nor invisible.",
        "source": "T12n0357_001:0243b13_7"
    },
    {
        "source_sentence": "非空、非不空、自體空，非可念、非不可念、離可念，非可覺、非不可覺，",
        "translation": "What’s not empty, what’s not nonempty, what’s emptiness in essence, what’s not to be thought of, what’s not to be thought of, what’s not to be thought of, what’s not to be thought of, what’s not to be thought of, and what’s not to be felt.",
        "source": "T12n0357_001:0243b14_8"
    },
    {
        "source_sentence": "離心意、意識，一切處平等，無分別、離異分別，過三世。",
        "translation": "Being free of mind, thought, and consciousness, all places are equal, without discrimination or different discrimination, transcending the three times.",
        "source": "T12n0357_001:0243b16_9"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243b17_10"
    },
    {
        "source_sentence": "而彼響聲隨種種眾生，種種言音聞種種響。",
        "translation": "The sounds of those sounds follow various kinds of sentient beings, and they speak various sounds and hear various sounds.",
        "source": "T12n0357_001:0243b17_11"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243b18_12"
    },
    {
        "source_sentence": "如來、應、正遍知說法音聲亦復如是，非過去、非未來、非現在，非內、非外、非二中間可得，",
        "translation": "“So it is with the articulated sounds of the teachings of Buddha: they are not past, not future, not present, not internal, not external, and not to be found in between.",
        "source": "T12n0357_001:0243b19_13"
    },
    {
        "source_sentence": "非生、非滅，非斷、非常，非知、非不知，非覺、非不覺，非明、非不明，",
        "translation": "neither arising nor ceasing, neither annihilation nor impermanence, neither knowing nor not knowing, neither feeling nor not feeling, neither insight nor non-thought.",
        "source": "T12n0357_001:0243b21_14"
    },
    {
        "source_sentence": "非縛、非脫，非毀、非不毀，非念、非不念，非處、非不處，非住、非不住，",
        "translation": "It is neither bound nor liberated, neither disparaged nor not disparaged, neither mindful nor not mindful, neither in a place nor out of place, neither abiding nor not abiding.",
        "source": "T12n0357_001:0243b22_15"
    },
    {
        "source_sentence": "非地界、非水界、非火界、非風界，非有為、非無為，非戲論、非不戲論，",
        "translation": "It’s not the earth realm, not the water realm, not the fire realm, not the wind realm, not the conditioned and not the unconditioned, not conceptualizing or not conceptualizing.",
        "source": "T12n0357_001:0243b23_16"
    },
    {
        "source_sentence": "非聲、非不聲，非見、非不見，非字、非言、非離言語，非稱量、離稱量，",
        "translation": "What’s not sound, what’s not sound, what’s not seeing, what’s not seeing, what’s not seeing, what’s not words, what’s not speech, what’s not measured, and what’s not measured.",
        "source": "T12n0357_001:0243b25_17"
    },
    {
        "source_sentence": "非相、離相，非寂靜、非離寂靜，非長、非短，非心、非不心，非觀、非不觀，",
        "translation": "They are not characteristics, they are free from characteristics, they are not quiescent, they are not separate from quiescence, they are not long or short, they are not mindful or not mindful, they are not contemplating or not contemplating.",
        "source": "T12n0357_001:0243b26_18"
    },
    {
        "source_sentence": "非可見相、非不可見相，非空、非不空、自體空，非可念、非不可念、離可念，",
        "translation": "What’s not visible, what’s not invisible, what’s not empty, what’s not nonempty, what’s empty of its own essence, what’s not mindful, what’s not unmindful, and what’s free from mindfulness.",
        "source": "T12n0357_001:0243b28_19"
    },
    {
        "source_sentence": "非可覺、非不可覺，離心意、意識，一切處平等，無分別、離異分別，",
        "translation": "They are neither to be apprehended nor not to be apprehended; they are free of mind, thought, or consciousness. All places are equal, without discrimination, and free from di›erence.",
        "source": "T12n0357_001:0243b29_20"
    },
    {
        "source_sentence": "過三世。",
        "translation": "It's beyond the three worlds.",
        "source": "T12n0357_001:0243c02_21"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243c02_22"
    },
    {
        "source_sentence": "隨種種眾生種種信、種種解，聞於如來、應、正遍知如是如是說法音聲。",
        "translation": "According to the various kinds of sentient beings who have various faiths and understandings, they hear the sounds of the Tathāgata, Arhat, and Perfectly Enlightened One thus and thus explaining the teaching.",
        "source": "T12n0357_001:0243c02_23"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243c04_24"
    },
    {
        "source_sentence": "譬如大地，住持萬物，生長一切穀、麥、果、蓏、草、木、樹林，建立成就。",
        "translation": "It's like the great earth, which sustains all things and produces all grains, wheat, fruit, millet, grass, trees, and forests that are established and accomplished.",
        "source": "T12n0357_001:0243c04_25"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243c05_26"
    },
    {
        "source_sentence": "而彼大地不分別、無異分別，一切處平等，無分別、無異分別心、無心，",
        "translation": "And the great earth is without discrimination, without dissimilarity or distinction: all places are equal, without discrimination, without dissimilarity, and with neither discriminating thought nor nonthought.",
        "source": "T12n0357_001:0243c06_27"
    },
    {
        "source_sentence": "離心意、意識。",
        "translation": "They're free of mind, thought, and consciousness.",
        "source": "T12n0357_001:0243c07_28"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243c07_29"
    },
    {
        "source_sentence": "如來、應、正遍知亦復如是，依於如來、應、正遍知，住持一切眾生，",
        "translation": "The Tathāgata, Arhat, Perfectly Enlightened One is also like this: relying on the Tathāgata, Arhat, Perfectly Enlightened One, he abides in and sustains all sentient beings.",
        "source": "T12n0357_001:0243c08_30"
    },
    {
        "source_sentence": "生長一切善根，建立成就一切聲聞、辟支佛、菩薩及諸外道種種異見、尼犍子等從於邪見，",
        "translation": "They cultivate all roots of goodness, establishing the accomplishment of all śrāvakas, pratyekabuddhas, bodhisattvas, non-Buddhists, various heretical views, Nirgranthas, and so forth from wrong views.",
        "source": "T12n0357_001:0243c09_31"
    },
    {
        "source_sentence": "乃至邪定聚眾生所有諸善根。",
        "translation": "It's even the good roots that are possessed by sentient beings in the wrong concentration aggregate.",
        "source": "T12n0357_001:0243c11_32"
    },
    {
        "source_sentence": "彼諸善根皆是如來、應、正遍知之所住持，皆依如來、應、正遍知而得生長、建立成就。",
        "translation": "Those good roots are all maintained by the Tathāgata, Arhat, and Completely Enlightened One, and they all grow and establish themselves based on the Tathāgata, Arhat, and Completely Enlightened One.",
        "source": "T12n0357_001:0243c12_33"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243c15_0"
    },
    {
        "source_sentence": "而如來、應、正遍知離一切分別，無分別、異分別念，離一切心意、意識，",
        "translation": "Rather, the Enlightened One is free of all discrimination, without distinctions or dissimilarities in his thoughts. He is free of all thoughts and consciousnesses.",
        "source": "T12n0357_001:0243c15_1"
    },
    {
        "source_sentence": "不可觀、離諸觀，不可見、離諸見，不可思惟、離諸思惟，不可念、離諸念，",
        "translation": "They are inconceivable, free of contemplation, invisible, and free of views; they are inconceivable, free of contemplation, inconceivable, and free of thought.",
        "source": "T12n0357_001:0243c16_2"
    },
    {
        "source_sentence": "心平等、無平等捨，一切處無分別、離異分別。",
        "translation": "The mind is equal and without equal equanimity, and there's no discrimination in all places and no discrimination of difference.",
        "source": "T12n0357_001:0243c18_3"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243c20_0"
    },
    {
        "source_sentence": "譬如虛空，一切處平等，無分別、異分別，不生、不滅，非過去、非未來、非現在，",
        "translation": "“Just as space is equal in all respects, without distinctions or dissimilarities, neither arising nor ceasing, neither past, nor future, nor present.",
        "source": "T12n0357_001:0243c20_1"
    },
    {
        "source_sentence": "不可見、不可戲論，無色，不可示、不可表，不可觸、不可護，不可量、離思量，",
        "translation": "They are invisible, cannot be seen, cannot be discussed, and formless; they cannot be shown or shown, cannot be touched, cannot be protected, cannot be measured, and cannot be separated from thought.",
        "source": "T12n0357_001:0243c21_2"
    },
    {
        "source_sentence": "不可譬喻、離諸譬喻，無住處、不可取，離眼識道、離心意、意識，無相、無字，",
        "translation": "“Without metaphors and without metaphors, there is no dwelling place or grasping; apart from the eye, consciousness, path, mind, and consciousness, there is signlessness and wordlessness.",
        "source": "T12n0357_001:0243c23_3"
    },
    {
        "source_sentence": "無聲、無念，無取、無捨，不可轉、不可換，離言語道，一切處住、一切處入。",
        "translation": "They have no sound, no thought, no apprehension, and no equanimity, can't change or exchange, are free of the path of words, abide in all places, and enter everywhere.",
        "source": "T12n0357_001:0243c25_4"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243c26_5"
    },
    {
        "source_sentence": "如諸眾生，以依地有高、下、中故，而言虛空有高、下、中，而彼虛空無高、下、中。",
        "translation": "Suppose sentient beings say that space is high, low, and middling because they rely on the ground for height, low, and middling, but that space has no height, low, or middling.",
        "source": "T12n0357_001:0243c26_6"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0243c28_7"
    },
    {
        "source_sentence": "如來、應、正遍知亦復如是，於一切處平等，無分別、異分別，不生、不滅，",
        "translation": "So it is with the Buddhas, Arhats, and Perfectly Enlightened Ones: they are equal in all respects, without distinctions or dissimilarities, neither arising nor ceasing.",
        "source": "T12n0357_001:0243c28_8"
    },
    {
        "source_sentence": "非過去、非未來、非現在，不可見、不可戲，無色，不可示、不可表，",
        "translation": "They are neither past, nor future, nor present; they cannot be seen or acted upon. They are formless, and cannot be shown or indicated.",
        "source": "T12n0357_001:0244a01_9"
    },
    {
        "source_sentence": "不可觸、不可護，不可量、離思量，不可譬喻、離諸譬喻，無住處、不可取，",
        "translation": "They cannot be touched, cannot be guarded, cannot be measured, cannot be separated from thought, cannot be compared or separated from all metaphors, have no dwelling place or grasping.",
        "source": "T12n0357_001:0244a02_10"
    },
    {
        "source_sentence": "離眼識道、離心意、意識，無相、無字，無聲、無念，無取、無捨，不可轉、不可換，",
        "translation": "Being free of the path of vision, consciousness, mind, and consciousness, it has no marks, no words, no sound, no thought, no apprehension, no equanimity, cannot be turned or changed.",
        "source": "T12n0357_001:0244a04_11"
    },
    {
        "source_sentence": "離言語道，一切處住、一切處入。",
        "translation": "He's free of the path of words, abiding in all places and entering into all places.",
        "source": "T12n0357_001:0244a05_12"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0244a06_13"
    },
    {
        "source_sentence": "依眾生心有高、下、中故，見如來有高、下、中，而實如來無高、下、中。",
        "translation": "Depending on the minds of sentient beings, there's height, descent, and middling, and they see that the Tathāgata has height, descent, and middling, but in truth the Tathāgata has no height, descent, or middling.",
        "source": "T12n0357_001:0244a06_14"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0244a08_15"
    },
    {
        "source_sentence": "如來無如是心：『此眾生有下信心，我示下形色；",
        "translation": "The Tathāgata does not think, “These sentient beings have inferior faith.",
        "source": "T12n0357_001:0244a08_16"
    },
    {
        "source_sentence": "此眾生有中信心，我示中形色；",
        "translation": "These sentient beings have middle faith. I show them form in the midst of form.",
        "source": "T12n0357_001:0244a09_17"
    },
    {
        "source_sentence": "此眾生有上信心，我示上形色。』",
        "translation": "These sentient beings have superior faith, and I show them superior form.'",
        "source": "T12n0357_001:0244a10_18"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0244a10_19"
    },
    {
        "source_sentence": "如來說法亦復如是。",
        "translation": "The Tathāgata teaches the Dharma in much the same way.",
        "source": "T12n0357_001:0244a11_20"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0244a11_21"
    },
    {
        "source_sentence": "如來無如是心：『此眾生有下信心，我為說聲聞法；",
        "translation": "The Tathāgata does not think, “Those sentient beings who have lowly faith I teach the śrāvaka dharma for them.",
        "source": "T12n0357_001:0244a11_22"
    },
    {
        "source_sentence": "此眾生有中信心，我為說辟支佛法；",
        "translation": "Because these sentient beings have middle-ground faith. I teach the way of the pratyekabuddhas for them.",
        "source": "T12n0357_001:0244a12_23"
    },
    {
        "source_sentence": "此眾生有上信心，我為說大乘法。』",
        "translation": "These sentient beings have superior faith, and I teach the great vehicle teaching for them.'",
        "source": "T12n0357_001:0244a13_24"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T12n0357_001:0244a14_25"
    },
    {
        "source_sentence": "如來無如是心：『此眾生信布施故，我為說檀波羅蜜；",
        "translation": "Because these sentient beings believe in giving, I teach them the transcendent practice of giving.",
        "source": "T12n0357_001:0244a14_26"
    },
    {
        "source_sentence": "此眾生信持戒故，我為說尸波羅蜜；",
        "translation": "Because these sentient beings believe in and keep the precepts, I teach them the transcendent practice of morality.",
        "source": "T12n0357_001:0244a15_27"
    },
    {
        "source_sentence": "此眾生信忍辱故，我為說羼提波羅蜜；",
        "translation": "Because these sentient beings believe in forbearance, I teach them the transcendent tolerance of hatred.",
        "source": "T12n0357_001:0244a16_28"
    },
    {
        "source_sentence": "此眾生信精進故，我為說毘梨耶波羅蜜；",
        "translation": "Because of these sentient beings’ faith and effort, I teach the transcendent vision to them.",
        "source": "T12n0357_001:0244a17_29"
    },
    {
        "source_sentence": "此眾生信禪定故，我為說禪波羅蜜；",
        "translation": "Because these sentient beings believe in meditative absorption, I teach them the transcendent meditation.",
        "source": "T12n0357_001:0244a18_30"
    },
    {
        "source_sentence": "此眾生信智慧故，我為說般若波羅蜜。』",
        "translation": "Because these sentient beings believe in wisdom, I explain the perfection of prajñā for them.'",
        "source": "T12n0357_001:0244a19_31"
    },
    {
        "source_sentence": "如來莊嚴智慧光明入一切佛境界經卷上",
        "translation": "Tathāgata's Adornment of Wisdom and Light of Wisdom Entering the Realm of All Buddhas Sutra, Volume 1",
        "source": "T12n0357_001:0244a21_0"
    }
]