[
    {
        "source_sentence": "大般涅槃經卷第二十一",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 21",
        "source": "T12n0374_021:0487a03_0"
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Northern Liang Tianzhushu Sanzang translated by Dharmakṣema",
        "source": "T12n0374_021:0487a05_0"
    },
    {
        "source_sentence": "光明遍照高貴德王菩薩品第十之一",
        "translation": "Chapter 11 of the Tenth Chapter of the Bodhisattva King of All-Illumining Radiance, the Supremely Noble King of Virtue",
        "source": "T12n0374_021:0487a06_0"
    },
    {
        "source_sentence": "爾時世尊告光明遍照高貴德王菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva Mahāsattva King of Universal Illumination, the noble king of virtue, and said, Good man!",
        "source": "T12n0374_021:0487a07_0"
    },
    {
        "source_sentence": "若有菩薩摩訶薩修行如是大涅槃經，得十事功德，不與聲聞辟支佛共，",
        "translation": "“If there are bodhisattva mahāsattvas who practice the Mahaparinirvana-sūtra like this and attain the ten meritorious virtues of enlightenment, they won’t be with śrāvakas or pratyekabuddhas",
        "source": "T12n0374_021:0487a08_1"
    },
    {
        "source_sentence": "不可思議，聞者驚怪，非內、非外、非難、非易、非相、非非相、非是世法、無有相貌、世間所無。",
        "translation": "It's not internal, not external, not difficult, not easy, not characterized, not not not not characterized, not a worldly dharma, not without form, and not what's absent in the world.",
        "source": "T12n0374_021:0487a09_2"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T12n0374_021:0487a11_3"
    },
    {
        "source_sentence": "一者有五，何等為五？",
        "translation": "One is that there are five. What are the five?",
        "source": "T12n0374_021:0487a12_4"
    },
    {
        "source_sentence": "一者所不聞者而能得聞，二者聞已能為利益，三者能斷疑惑之心，四者慧心正直無曲，",
        "translation": "They are (1) enabling those who have not heard to hear what they can hear, (2) benefiting those who have heard it after hearing it, (3) cutting off doubt and confusion in their minds, and (4) having the intellect of wisdom upright and unbending",
        "source": "T12n0374_021:0487a12_5"
    },
    {
        "source_sentence": "五者能知如來密藏，是為五事。",
        "translation": "Five, being able to know the tathāgata's esoteric treasury—these are the five things.",
        "source": "T12n0374_021:0487a14_6"
    },
    {
        "source_sentence": "何等不聞而能得聞？",
        "translation": "How can they hear without hearing?",
        "source": "T12n0374_021:0487a15_7"
    },
    {
        "source_sentence": "所謂甚深微密之藏，一切眾生悉有佛性，佛、法、眾僧無有差別，三寶性相常樂我淨，",
        "translation": "It is the profound, subtle, and mysterious treasury that all sentient beings possess buddha-nature. There is no distinction between Buddha, Dharma, or Sangha. The essence and characteristics of the Three Jewels are always",
        "source": "T12n0374_021:0487a15_8"
    },
    {
        "source_sentence": "一切諸佛無有畢竟入涅槃者，常住無變。",
        "translation": "All buddhas have no ultimate entry into nirvāṇa, which is always abiding and unchanging.",
        "source": "T12n0374_021:0487a17_9"
    },
    {
        "source_sentence": "如來涅槃，非有非無、非有為非無為、非有漏非無漏、非色非不色、非名非不名、非相非不相、非有非不有、非物非不物、非因非果、非待非不待、非明非闇、非出非不出、非常非不常、非斷非不斷、非始非終、非過去、非未來、非現在、非陰非不陰、非入非不入、非界非不界、非十二因緣非不十二因緣，",
        "translation": "The Tathāgata's nirvāṇa is neither existent nor nonexistent, neither conditioned nor unconditioned, neither contaminated nor uncontaminated, neither form nor formless, neither name nor non-form, neither characteristic nor",
        "source": "T12n0374_021:0487a18_10"
    },
    {
        "source_sentence": "如是等法甚深微密，昔所不聞而能得聞。",
        "translation": "Such teachings are so profound and subtle that they weren't heard in the past but could be heard.",
        "source": "T12n0374_021:0487a25_11"
    },
    {
        "source_sentence": "復有不聞，所謂一切外道經書、四毘陀論、毘伽羅論、衛世師論、迦毘羅論，",
        "translation": "Furthermore, there are those who have not heard the doctrines of all the non-Buddhist scriptures, the theories of the Four Vedas, the theories of the Vinaya, the theories of the vinaya, the theories of the Vai",
        "source": "T12n0374_021:0487a26_12"
    },
    {
        "source_sentence": "一切呪術、醫方、伎藝，日月博蝕、星宿運變、圖書讖記。",
        "translation": "All the spells, healing methods, and arts of skillful means are described in terms of the eclipse of the sun and moon, the stars and constellations that change with each passing day, as well as the descriptions and cartographies.",
        "source": "T12n0374_021:0487a27_13"
    },
    {
        "source_sentence": "如是等經初未曾聞祕密之義，今於此經而得知之。",
        "translation": "These are the first secret meanings of such sūtras that I've never heard before, but now I'll know them from this sūtra.",
        "source": "T12n0374_021:0487a29_0"
    },
    {
        "source_sentence": "復有十一部經，除毘佛略，亦無如是深密之義，今因此經而得知之。",
        "translation": "There are eleven other scriptures besides the Vaibhāraṇa, which also have no profound meaning like this. We can now know them from these scriptures.",
        "source": "T12n0374_021:0487b01_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0487b02_2"
    },
    {
        "source_sentence": "是名不聞而能得聞。",
        "translation": "This is called being able to hear without hearing and yet be able to hear.",
        "source": "T12n0374_021:0487b02_3"
    },
    {
        "source_sentence": "「聞已利益者，若能聽受是大涅槃經，悉能具知一切方等大乘經典甚深義味。",
        "translation": "Those who have heard it will benefit if they can hear and accept this great nirvāṇa sūtra, which enables them to fully know the profound meaning and flavor of all the well-balanced great vehicle scriptures.",
        "source": "T12n0374_021:0487b03_4"
    },
    {
        "source_sentence": "譬如男女，於明淨鏡，見其色像，了了分明。",
        "translation": "It's like a man or woman who sees his form in a clear mirror and understands it clearly.",
        "source": "T12n0374_021:0487b05_5"
    },
    {
        "source_sentence": "大涅槃鏡亦復如是，菩薩執之，悉得明見大乘經典甚深之義。",
        "translation": "The Great Nirvana mirror is likewise, and the bodhisattva who holds it clearly sees the profound meaning of the great vehicle scriptures.",
        "source": "T12n0374_021:0487b06_6"
    },
    {
        "source_sentence": "亦如有人在闇室中執大炬火，悉見諸物。",
        "translation": "It's also like a person in a dark room holding a large torch and seeing all the things.",
        "source": "T12n0374_021:0487b07_7"
    },
    {
        "source_sentence": "大涅槃炬亦復如是，菩薩執之，得見大乘深奧之義。",
        "translation": "The great torch of nirvana is likewise, and the bodhisattva who holds it will be able to see the profound meaning of the great vehicle.",
        "source": "T12n0374_021:0487b08_8"
    },
    {
        "source_sentence": "亦如日出，有千光明，悉能照了諸山幽闇，令一切人遠見諸物。",
        "translation": "It is also like when the sun comes out and has a thousand rays of light that can illuminate the darkness of the mountains, causing all people to see things from afar.",
        "source": "T12n0374_021:0487b09_9"
    },
    {
        "source_sentence": "是大涅槃清淨慧日亦復如是，照了大乘深邃之處，令二乘人遠見佛道。",
        "translation": "This is also the case with the pure day of wisdom of the great nirvāṇa, which illuminates the profound place of the great vehicle and causes adherents of the two vehicles to see the Buddha's path from afar.",
        "source": "T12n0374_021:0487b11_10"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_021:0487b12_11"
    },
    {
        "source_sentence": "以能聽受是大涅槃微妙經典故。",
        "translation": "It's because they can hear and accept this subtle scripture of the great nirvāṇa.",
        "source": "T12n0374_021:0487b12_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0487b13_13"
    },
    {
        "source_sentence": "若有菩薩摩訶薩聽受如是大涅槃經，得知一切諸法名字。",
        "translation": "Suppose there's a bodhisattva Mahāsattva who hears and accepts such a great nirvāṇa sūtra and knows the names of all dharmas.",
        "source": "T12n0374_021:0487b13_14"
    },
    {
        "source_sentence": "若能書寫、讀誦通利、為他廣說、思惟其義，則知一切諸法義理。",
        "translation": "If someone can write, recite, penetrate, explain, and contemplate its meaning for others, then they'll know the meaning of all dharmas.",
        "source": "T12n0374_021:0487b15_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0487b16_16"
    },
    {
        "source_sentence": "其聽受者，唯知名字，不知其義；",
        "translation": "The only thing they hear and receive is the Sanskrit phonetic name, but they do not know its meaning.",
        "source": "T12n0374_021:0487b16_17"
    },
    {
        "source_sentence": "若能書寫、受持讀誦、為他廣說、思惟其義，則能知義。",
        "translation": "If someone can write, memorize, recite, explain it in detail for others, and contemplate its meaning, then they'll be able to know its meaning.",
        "source": "T12n0374_021:0487b17_18"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_021:0487b18_19"
    },
    {
        "source_sentence": "聽是經者，聞有佛性，未能得見；",
        "translation": "Those who listen to this sutra hear that buddha-nature exists but are unable to see it.",
        "source": "T12n0374_021:0487b19_0"
    },
    {
        "source_sentence": "書寫讀誦、為他廣說、思惟其義、則得見之。",
        "translation": "When they write, recite, explain it in detail for others, and contemplate its meaning, they'll be able to see it.",
        "source": "T12n0374_021:0487b19_1"
    },
    {
        "source_sentence": "聽是經者，聞有檀名，未能得見檀波羅蜜；",
        "translation": "Those who listened to this scripture heard the name of sandalwood and were unable to attain the transcendent vision of giving.",
        "source": "T12n0374_021:0487b20_2"
    },
    {
        "source_sentence": "書寫讀誦、為他廣說、思惟其義，則能得見檀波羅蜜，乃至般若波羅蜜亦復如是。",
        "translation": "When they write, recite, explain it in detail for others, and contemplate its meaning, they'll be able to see the perfection of giving, and so will the perfection of prajñāpāramitā.",
        "source": "T12n0374_021:0487b21_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0487b23_4"
    },
    {
        "source_sentence": "菩薩摩訶薩若能聽是大涅槃經，則知法知義，具二無礙，於諸沙門、婆羅門等，",
        "translation": "If bodhisattvas and mahāsattvas can hear this great nirvana sūtra, then they will know the teaching and know its meaning. They will be endowed with both kinds of unhinderedness.",
        "source": "T12n0374_021:0487b23_5"
    },
    {
        "source_sentence": "若天、魔、梵、一切世中，得無所畏，開示分別十二部經，演說其義，",
        "translation": "If gods, Māras, Brahmās, and all the other worldly beings attain fearlessness, they will reveal twelve kinds of scriptures that discriminate and explain their meanings.",
        "source": "T12n0374_021:0487b25_6"
    },
    {
        "source_sentence": "無有差違，不從他聞，而能自知，近於阿耨多羅三藐三菩提。",
        "translation": "They know for themselves without hearing from others, and they are close to unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_021:0487b26_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0487b28_8"
    },
    {
        "source_sentence": "是名聞已，能為利益。",
        "translation": "This is called being able to benefit after hearing it.",
        "source": "T12n0374_021:0487b28_9"
    },
    {
        "source_sentence": "「斷疑心者，疑有二種：一者疑名，二者疑義。",
        "translation": "“When someone stops doubting, there are two kinds of doubt: first, doubting names and second, doubting meanings.",
        "source": "T12n0374_021:0487b28_10"
    },
    {
        "source_sentence": "聽是經者，斷疑名心；",
        "translation": "Those who listen to this discourse are called ‘minds’ because they dispel doubt.",
        "source": "T12n0374_021:0487b29_11"
    },
    {
        "source_sentence": "思惟義者，斷疑義心。",
        "translation": "The meaning of contemplation is the mind that stops doubting the meaning.",
        "source": "T12n0374_021:0487c01_12"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_021:0487c01_13"
    },
    {
        "source_sentence": "疑有五種：一者疑佛定涅槃不？",
        "translation": "There are five kinds of doubt: 1. Is there doubt about the Buddha's concentration and nirvāṇa?",
        "source": "T12n0374_021:0487c01_14"
    },
    {
        "source_sentence": "二者疑佛是常住不？",
        "translation": "Second, do you doubt that the Buddha is eternally abiding?",
        "source": "T12n0374_021:0487c02_15"
    },
    {
        "source_sentence": "三者疑佛是真樂不？",
        "translation": "Third, do you doubt that the Buddha is truly blissful?",
        "source": "T12n0374_021:0487c03_16"
    },
    {
        "source_sentence": "四者疑佛是真淨不？",
        "translation": "Fourth, do you doubt that the Buddha is truly pure?",
        "source": "T12n0374_021:0487c03_17"
    },
    {
        "source_sentence": "五者疑佛是實我不？",
        "translation": "The fifth is to doubt that the Buddha is really a self or not.",
        "source": "T12n0374_021:0487c04_18"
    },
    {
        "source_sentence": "聽是經者，疑佛涅槃則得永斷；",
        "translation": "Those who listened to this scripture doubted that the Buddha’s nirvana would enable them to be permanently eliminated.",
        "source": "T12n0374_021:0487c04_19"
    },
    {
        "source_sentence": "書寫讀誦、為他廣說、思惟其義，四疑永斷。",
        "translation": "By writing, reciting, explaining it in detail for others, and contemplating its meaning, the four doubts are permanently eliminated.",
        "source": "T12n0374_021:0487c05_20"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_021:0487c06_21"
    },
    {
        "source_sentence": "疑有三種：一疑聲聞為有、為無？",
        "translation": "There are three kinds of doubt: first, doubting whether śrāvakas exist or don't?",
        "source": "T12n0374_021:0487c06_22"
    },
    {
        "source_sentence": "二疑緣覺為有、為無？",
        "translation": "The second is to doubt whether pratyekabuddha exists or does not exist?",
        "source": "T12n0374_021:0487c07_23"
    },
    {
        "source_sentence": "三疑佛乘為有、為無？",
        "translation": "The third is to doubt whether the Buddha vehicle exists or doesn't exist?",
        "source": "T12n0374_021:0487c07_24"
    },
    {
        "source_sentence": "聽是經者，如是三疑永滅無餘；",
        "translation": "Those who hear this scripture will have these three doubts forever extinguished without remainder.",
        "source": "T12n0374_021:0487c08_25"
    },
    {
        "source_sentence": "書寫讀誦、為他廣說、思惟其義，則能了知一切眾生悉有佛性。",
        "translation": "By writing, reciting, explaining it in detail for others, and contemplating its meaning, they can then understand that all sentient beings have buddha-nature.",
        "source": "T12n0374_021:0487c08_26"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_021:0487c10_27"
    },
    {
        "source_sentence": "若有眾生不聞如是大涅槃經，其心多疑，所謂若常、無常，若樂、不樂，",
        "translation": "If there are any sentient beings who do not hear such a scripture of the Great Nirvana, their minds will be filled with doubt. They will say, “If it is permanent or impermanent, and if it is pleasant or unpleasant,",
        "source": "T12n0374_021:0487c10_28"
    },
    {
        "source_sentence": "若淨、不淨，若我、無我，若命、非命，若眾生、非眾生，若畢竟、不畢竟，",
        "translation": "If it’s pure or impure, if it’s self or selfless, if it’s life or not life, if it’s sentient or not sentient, and if it’s ultimate or not ultimate,",
        "source": "T12n0374_021:0487c12_29"
    },
    {
        "source_sentence": "若他世、若過世，若有、若無，若苦、若非苦，若集、若非集，若道、若非道，",
        "translation": "Whether in another world or beyond, whether existent or nonexistent, painful or not painful, accumulated or not accumulated, path or not path:",
        "source": "T12n0374_021:0487c13_30"
    },
    {
        "source_sentence": "若滅、若非滅，若法、若非法，若善、若非善，若空、若非空，聽是經者，",
        "translation": "If it ceases or doesn’t cease, if it’s Dharma or non-dharma, if it’s good or not good, if it’s empty or not empty, and if it’s listening to this sutra,",
        "source": "T12n0374_021:0487c14_31"
    },
    {
        "source_sentence": "如是諸疑悉得永斷。",
        "translation": "Such doubts can all be permanently eliminated.",
        "source": "T12n0374_021:0487c16_32"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_021:0487c16_33"
    },
    {
        "source_sentence": "若有不聞如是經者，復有種種眾多疑心，所謂色是我耶？",
        "translation": "If someone doesn't hear such a sūtra, they'll also have various kinds of doubtful thoughts, saying, 'Is form the self?'",
        "source": "T12n0374_021:0487c17_34"
    },
    {
        "source_sentence": "受想行識是我耶？",
        "translation": "Is feeling, perception, volition, and consciousness the self?",
        "source": "T12n0374_021:0487c18_35"
    },
    {
        "source_sentence": "眼能見耶？",
        "translation": "Can the eye see?",
        "source": "T12n0374_021:0487c18_36"
    },
    {
        "source_sentence": "我能見耶？",
        "translation": "Can I see it?",
        "source": "T12n0374_021:0487c19_37"
    },
    {
        "source_sentence": "乃至識能知耶？",
        "translation": "Can consciousness know it?",
        "source": "T12n0374_021:0487c19_38"
    },
    {
        "source_sentence": "我能知耶？",
        "translation": "Can I know it?",
        "source": "T12n0374_021:0487c19_39"
    },
    {
        "source_sentence": "色受報耶？",
        "translation": "What's the reward of form?",
        "source": "T12n0374_021:0487c19_40"
    },
    {
        "source_sentence": "我受報耶？",
        "translation": "Will I receive the retribution?",
        "source": "T12n0374_021:0487c20_41"
    },
    {
        "source_sentence": "乃至識受報耶？",
        "translation": "Or is it the sensation of consciousness as retribution?",
        "source": "T12n0374_021:0487c20_42"
    },
    {
        "source_sentence": "我受報耶？",
        "translation": "Will I receive the retribution?",
        "source": "T12n0374_021:0487c20_43"
    },
    {
        "source_sentence": "色至他世耶？",
        "translation": "Is form up to another world?",
        "source": "T12n0374_021:0487c20_44"
    },
    {
        "source_sentence": "我至他世耶？",
        "translation": "Will I go to another world?",
        "source": "T12n0374_021:0487c21_45"
    },
    {
        "source_sentence": "乃至識亦如是。",
        "translation": "It's likewise with consciousness.",
        "source": "T12n0374_021:0487c21_46"
    },
    {
        "source_sentence": "生死之法有始有終耶？",
        "translation": "Do the dharmas of birth and death have beginnings and ends?",
        "source": "T12n0374_021:0487c21_47"
    },
    {
        "source_sentence": "無始無終耶？",
        "translation": "Is there beginninglessness and no end?",
        "source": "T12n0374_021:0487c22_48"
    },
    {
        "source_sentence": "聽是經者，如是等疑亦得永斷。",
        "translation": "Those who listen to this sūtra will also permanently end such doubts.",
        "source": "T12n0374_021:0487c22_49"
    },
    {
        "source_sentence": "復有人疑，一闡提人、犯四重禁、作五逆罪、謗方等經，如是等輩有佛性耶？",
        "translation": "Again, some people wonder whether the icchantikas, those who violate the four grave prohibitions, commit the five heinous crimes, and denigrate the well-balanced sūtras have buddha-nature in such groups.",
        "source": "T12n0374_021:0487c23_50"
    },
    {
        "source_sentence": "無佛性耶？",
        "translation": "Is there no buddha-nature?",
        "source": "T12n0374_021:0487c25_51"
    },
    {
        "source_sentence": "聽是經者，如是等疑悉得永斷。",
        "translation": "Those who listen to this sūtra will permanently end such doubts.",
        "source": "T12n0374_021:0487c25_52"
    },
    {
        "source_sentence": "復有人疑，世間有邊耶？",
        "translation": "Again, some people wonder: Is the world finite?",
        "source": "T12n0374_021:0487c26_0"
    },
    {
        "source_sentence": "世間無邊耶？",
        "translation": "Is the world limitless?",
        "source": "T12n0374_021:0487c26_1"
    },
    {
        "source_sentence": "有十方世界耶？",
        "translation": "Is there a world in the ten directions?",
        "source": "T12n0374_021:0487c26_2"
    },
    {
        "source_sentence": "無十方世界耶？",
        "translation": "Is there no world in the ten directions?",
        "source": "T12n0374_021:0487c27_3"
    },
    {
        "source_sentence": "聽是經者，如是等疑亦得永斷，是名能斷疑惑之心。",
        "translation": "Those who listen to this sūtra will also permanently end such doubts, which is called the mind that's capable of ending doubt and doubt.",
        "source": "T12n0374_021:0487c27_4"
    },
    {
        "source_sentence": "「慧心正直無邪曲者，心若有疑，則所見不正。",
        "translation": "“When the mind of wisdom is upright and without error, if there are doubts in the mind, then what’s seen isn’t right.",
        "source": "T12n0374_021:0487c28_5"
    },
    {
        "source_sentence": "一切凡夫若不得聞是大涅槃微妙經典，所見邪曲，乃至聲聞辟支佛人，",
        "translation": "All ordinary people who fail to hear this subtle scripture of the Great Nirvana will see errors and distortions, even as many as śrāvakas and pratyekbuddhas.",
        "source": "T12n0374_021:0487c29_6"
    },
    {
        "source_sentence": "所見亦曲。",
        "translation": "What's seen is also twisted.",
        "source": "T12n0374_021:0488a02_7"
    },
    {
        "source_sentence": "云何名為一切凡夫所見邪曲？",
        "translation": "What's called the mistaken distortion seen by all worldlings?",
        "source": "T12n0374_021:0488a02_8"
    },
    {
        "source_sentence": "於有漏中見常樂我淨；",
        "translation": "In the midst of the taints, they see permanence, bliss, self, and purity.",
        "source": "T12n0374_021:0488a03_9"
    },
    {
        "source_sentence": "於如來所，見無常、苦、不淨、無我；",
        "translation": "In the presence of the enlightened one, they see impermanence, suffering, impurity, and selflessness.",
        "source": "T12n0374_021:0488a03_10"
    },
    {
        "source_sentence": "見有眾生、壽命、知見；",
        "translation": "They see the existence of sentient beings, life span and knowledge and vision.",
        "source": "T12n0374_021:0488a04_11"
    },
    {
        "source_sentence": "計非有想非無想處，以為涅槃；",
        "translation": "They think of liberation as the sphere of neither ideation nor non-ideation.",
        "source": "T12n0374_021:0488a05_0"
    },
    {
        "source_sentence": "見自在天有八聖道；",
        "translation": "There are eight holy paths in the celestial realm of views of sovereignty.",
        "source": "T12n0374_021:0488a05_1"
    },
    {
        "source_sentence": "有見、斷見；",
        "translation": "There is the view of existence and the view of annihilation.",
        "source": "T12n0374_021:0488a06_2"
    },
    {
        "source_sentence": "如是等見，名為邪曲。",
        "translation": "Such views are called mistaken views.",
        "source": "T12n0374_021:0488a06_3"
    },
    {
        "source_sentence": "菩薩摩訶薩若得聞是大涅槃經，修行聖行，則得斷除如是邪曲。",
        "translation": "If bodhisattvas and mahāsattvas hear this great nirvāṇa sūtra and cultivate noble practices, they'll be able to remove such mistaken errors.",
        "source": "T12n0374_021:0488a06_4"
    },
    {
        "source_sentence": "云何名為聲聞緣覺邪曲見耶？",
        "translation": "What's called a mistaken view of śrāvakas and pratyekbuddhas?",
        "source": "T12n0374_021:0488a08_5"
    },
    {
        "source_sentence": "見於菩薩從兜率下，化乘白象，降神母胎，父名淨飯，母曰摩耶。",
        "translation": "He saw that the Bodhisattva descended from Tuṣita in a white elephant and descended to his mother’s womb. His father’s name was Jīvaka and his mother’s name was Maya.",
        "source": "T12n0374_021:0488a09_6"
    },
    {
        "source_sentence": "迦毘羅城處胎滿足十月而生，生未至地，帝釋捧接，難陀龍王及婆難陀吐水而浴，",
        "translation": "The city of Kapilavastu was in the womb for a full ten months and then came back to earth. When they were born, Indra touched them with his arm; Nanda-nānda (Śakra), king of the nāga kings, and Up",
        "source": "T12n0374_021:0488a10_7"
    },
    {
        "source_sentence": "摩尼跋陀大鬼神王執持寶蓋，隨後侍立，地神化花以承其足，四方各行滿足七步。",
        "translation": "The great spirit king Maṇibhadra, holding the jeweled canopy, followed it and stood behind him. The earth goddess transformed flowers to carry his feet; each of the four directions traveled seven paces in all directions.",
        "source": "T12n0374_021:0488a12_8"
    },
    {
        "source_sentence": "到於天廟，令諸天像悉起承迎。",
        "translation": "When he arrived at the deva temple, he ordered all the deva images to rise and greet him.",
        "source": "T12n0374_021:0488a14_9"
    },
    {
        "source_sentence": "阿私陀仙抱持占相，既占相已，生大悲苦，自傷當終不覩佛興。",
        "translation": "The sage Asita held the divination signs in his arms and, having done so, gave rise to great compassion and suffering, and when he wounds himself, he'll never see the Buddha arise.",
        "source": "T12n0374_021:0488a15_0"
    },
    {
        "source_sentence": "詣師學書、算計、射禦、圖讖、伎藝。",
        "translation": "He went to the teacher to study books, arithmetic, archery, painting, and arts and crafts.",
        "source": "T12n0374_021:0488a16_1"
    },
    {
        "source_sentence": "處在深宮，六萬婇女娛樂受樂。",
        "translation": "In the deep palace sixty thousand licentious women amuse themselves and enjoy pleasure.",
        "source": "T12n0374_021:0488a17_2"
    },
    {
        "source_sentence": "出城遊觀至迦毘羅園，道見老人乃至沙門法服而行，還至宮中見諸婇女形體狀貌，",
        "translation": "He came out of the city and went on a pleasure excursion to Kapilavastu, where he saw some old ladies dressed in religious robes, some of whom were also śramaṇas. On arriving at the palace, he saw the women’s",
        "source": "T12n0374_021:0488a17_3"
    },
    {
        "source_sentence": "猶如枯骨，所有宮殿塚墓無異。",
        "translation": "It's like a dried-up bone, with all the palaces and tomb mounds there are no different.",
        "source": "T12n0374_021:0488a19_4"
    },
    {
        "source_sentence": "厭惡出家夜半踰城，至欝陀伽、阿羅邏等大仙人所，聞說識處及非有想非無想處。",
        "translation": "He renounced the householder’s life out of hatred and at midnight he crossed the city. At midnight he came to the place where the great sages such as Gandhāra and Ārāḍa had heard that it was the sphere of",
        "source": "T12n0374_021:0488a20_5"
    },
    {
        "source_sentence": "既聞是已，諦觀是處，是非常、苦、不淨、無我，捨至樹下，具修苦行滿足六年。",
        "translation": "Having heard this, he examined the place carefully and observed that it was marvelous, painful, impure, and without self. He abandoned it and went to the foot of a tree to practice austerities for six years.",
        "source": "T12n0374_021:0488a22_6"
    },
    {
        "source_sentence": "知是苦行不能得成阿耨多羅三藐三菩提，爾時復到阿利跋提河中洗浴，",
        "translation": "Knowing that this ascetic practice wouldn’t enable them to attain unexcelled, perfect enlightenment, they then went back into the Acacia River to wash and bathe.",
        "source": "T12n0374_021:0488a24_0"
    },
    {
        "source_sentence": "受牧牛女所奉乳糜，受已轉至菩提樹下，破魔波旬得成阿耨多羅三藐三菩提。",
        "translation": "Accepting the milk gruel offered by the cowherd woman, he accepted it and went to the foot of the bodhi tree, destroyed Māra Pāpīyān, and attained unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_021:0488a25_1"
    },
    {
        "source_sentence": "於波羅[木*柰]為五比丘初轉法輪，乃至於此拘尸那城入般涅槃。",
        "translation": "He first turned the wheel of the Dharma for five monks at Vārāṇasī and entered parinirvāṇa in this city of Kuśinagara.",
        "source": "T12n0374_021:0488a27_2"
    },
    {
        "source_sentence": "如是等見，是名聲聞緣覺曲見。",
        "translation": "Such views are called the view of śrāvakas and pratyekbuddhas.",
        "source": "T12n0374_021:0488a28_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0488a29_4"
    },
    {
        "source_sentence": "菩薩摩訶薩聽受如是大涅槃經。",
        "translation": "The bodhisattva Mahāsattva hears and accepts such a great nirvāṇa sūtra.",
        "source": "T12n0374_021:0488a29_5"
    },
    {
        "source_sentence": "悉得斷除如是等見；",
        "translation": "They all attain annihilation of such views.",
        "source": "T12n0374_021:0488b01_6"
    },
    {
        "source_sentence": "若能書寫、讀誦通利、為他演說、思惟其義，則得正直無邪曲見。",
        "translation": "If someone can write, recite, penetrate, explain, and contemplate its meaning for others, they'll attain righteousness and the absence of mistaken views.",
        "source": "T12n0374_021:0488b02_7"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0488b03_8"
    },
    {
        "source_sentence": "菩薩摩訶薩修行如是大涅槃經，諦知菩薩無量劫來，不從兜率降神母胎，",
        "translation": "“When great enlightening beings practice this Mahaparinirvana-sutra, they truly know that for immeasurable kalpas the enlightening being has not descended from Tuṣita into the mother’s womb.",
        "source": "T12n0374_021:0488b03_9"
    },
    {
        "source_sentence": "乃至拘尸那城入般涅槃，是名菩薩摩訶薩正直之見。",
        "translation": "Up to entering parinirvāṇa in the city of Kuśinagara is called the bodhisattva-mahāsattva's righteous and upright view.",
        "source": "T12n0374_021:0488b05_10"
    },
    {
        "source_sentence": "能知如來深密義者，所謂即是大般涅槃，一切眾生悉有佛性，懺四重禁、除謗法心、盡五逆罪、滅一闡提，",
        "translation": "Those who can know the profound and esoteric meaning of the Tathāgata are called mahāparinirvāṇa. All sentient beings have buddha-nature, confessing the four grave offenses, getting rid of the mind that slanders the Dharma,",
        "source": "T12n0374_021:0488b06_11"
    },
    {
        "source_sentence": "然後得成阿耨多羅三藐三菩提，是名甚深祕密之義。",
        "translation": "Only then will they attain anuttarii samyaksarrzbodhi, which is called profound and esoteric meaning.",
        "source": "T12n0374_021:0488b08_12"
    },
    {
        "source_sentence": "復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_021:0488b10_13"
    },
    {
        "source_sentence": "云何復名甚深之義？",
        "translation": "How could it be called profound?",
        "source": "T12n0374_021:0488b10_14"
    },
    {
        "source_sentence": "雖知眾生實無有我，而於未來不失業果；",
        "translation": "Though they know sentient beings really have no self, yet they do not lose the results of past actions in the future.",
        "source": "T12n0374_021:0488b10_15"
    },
    {
        "source_sentence": "雖知五陰於此滅盡，善惡之業終不敗亡；",
        "translation": "Even though they know that the five aggregates are extinguished there, good and evil deeds never perish.",
        "source": "T12n0374_021:0488b11_16"
    },
    {
        "source_sentence": "雖有諸業不得作者；",
        "translation": "Even though there are actions, they cannot be done.",
        "source": "T12n0374_021:0488b12_17"
    },
    {
        "source_sentence": "雖有至處無有去者；",
        "translation": "Although there is an arrival, there is no departure.",
        "source": "T12n0374_021:0488b13_18"
    },
    {
        "source_sentence": "雖有繫縛無受縛者；",
        "translation": "Even though there are fetters, there are no fetters of feeling.",
        "source": "T12n0374_021:0488b13_19"
    },
    {
        "source_sentence": "雖有涅槃亦無滅者；",
        "translation": "Even though there is nirvana, there is no cessation.",
        "source": "T12n0374_021:0488b14_20"
    },
    {
        "source_sentence": "是名甚深祕密之義。」",
        "translation": "This is called the profound, esoteric meaning.",
        "source": "T12n0374_021:0488b14_21"
    },
    {
        "source_sentence": "爾時光明遍照高貴德王菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that the Bodhisattva Mahāsattva King of Universal Illumination, the noble king of virtue, said to the Buddha, Bhagavān!",
        "source": "T12n0374_021:0488b15_22"
    },
    {
        "source_sentence": "如我解佛所說，聞不聞義，是義不然。",
        "translation": "As I understand what the Buddha teaches, it doesn't mean to hear or not hear.",
        "source": "T12n0374_021:0488b16_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_021:0488b17_24"
    },
    {
        "source_sentence": "法若有者便應定有，法若無者便應定無，無不應生、有不應滅。",
        "translation": "If there are dharmas, then they should definitely exist; if there are no dharmas, then they should definitely not exist; nonexistence should not arise and existence should not cease.",
        "source": "T12n0374_021:0488b17_25"
    },
    {
        "source_sentence": "如其聞者是則為聞，若不聞者則為不聞，云何而言聞所不聞？",
        "translation": "If someone hears it, they'll hear it; if they don't hear it, they won't hear it, so how can they say they hear what they don't hear?",
        "source": "T12n0374_021:0488b18_26"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0488b20_27"
    },
    {
        "source_sentence": "若不可聞是為不聞，若已聞者則更不聞。",
        "translation": "If they can't hear it, they won't hear it; if they have heard it, they won't hear it again.",
        "source": "T12n0374_021:0488b20_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_021:0488b21_29"
    },
    {
        "source_sentence": "已得聞故。",
        "translation": "It's because they've heard it.",
        "source": "T12n0374_021:0488b21_30"
    },
    {
        "source_sentence": "云何而言聞所不聞？",
        "translation": "How can it be said that what's heard is not heard?",
        "source": "T12n0374_021:0488b21_31"
    },
    {
        "source_sentence": "譬如去者，到則不去，去則不到。",
        "translation": "It's like going, which doesn't go when it arrives and doesn't come when it goes.",
        "source": "T12n0374_021:0488b22_32"
    },
    {
        "source_sentence": "亦如生已不生、不生不生。",
        "translation": "It's also like having arisen and not arising and not arising and not arising and not arising.",
        "source": "T12n0374_021:0488b22_33"
    },
    {
        "source_sentence": "得已不得、不得不得。",
        "translation": "After attaining it, they won't attain it and won't have to attain it.",
        "source": "T12n0374_021:0488b23_34"
    },
    {
        "source_sentence": "聞已不聞、不聞不聞亦復如是。",
        "translation": "It's likewise with someone who hears but doesn't hear and doesn't hear and doesn't hear after hearing.",
        "source": "T12n0374_021:0488b23_35"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0488b24_36"
    },
    {
        "source_sentence": "若不聞聞者，一切眾生未有菩提即應有之，未得涅槃亦應得之，未見佛性應見佛性，",
        "translation": "If someone doesn’t hear and hear, all sentient beings who don’t have enlightenment should have it, those who haven’t attained nirvāṇa should attain it, and those who haven’t seen buddha-nature should see buddh",
        "source": "T12n0374_021:0488b24_37"
    },
    {
        "source_sentence": "云何復言十住菩薩雖見佛性未得明了？",
        "translation": "How does it further say that even though bodhisattvas in the ten abodes see the buddha-nature, they haven't clearly comprehended it?",
        "source": "T12n0374_021:0488b26_38"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0488b27_39"
    },
    {
        "source_sentence": "若不聞聞者，如來往昔從誰得聞？",
        "translation": "If someone doesn't hear and hear, where did the Tathāgata hear it from in the past?",
        "source": "T12n0374_021:0488b27_40"
    },
    {
        "source_sentence": "若言得聞，何故如來於《阿含》中復言無師？",
        "translation": "If someone says they've heard it, why does the Tathāgata say there's no teacher in the Āgamas?",
        "source": "T12n0374_021:0488b28_41"
    },
    {
        "source_sentence": "若不聞不聞，如來得成阿耨多羅三藐三菩提者，一切眾生不聞不聞，亦應得成阿耨多羅三藐三菩提。",
        "translation": "If someone doesn't hear and doesn't hear, the Tathāgata will attain unsurpassed, correct, and complete enlightenment, and all sentient beings who don't hear and don't hear should also attain unsurpassed, correct",
        "source": "T12n0374_021:0488b29_42"
    },
    {
        "source_sentence": "如來若當不聞如是大涅槃經見佛性者，一切眾生不聞是經亦應得見。",
        "translation": "If the Tathāgata doesn't hear such a great nirvāṇa sūtra and see the buddha-nature, all sentient beings who don't hear this sūtra will also see it.",
        "source": "T12n0374_021:0488c02_43"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0488c04_44"
    },
    {
        "source_sentence": "凡是色者，或有可見，或不可見。",
        "translation": "Whenever there's form, it might be visible or invisible.",
        "source": "T12n0374_021:0488c04_45"
    },
    {
        "source_sentence": "聲亦如是，或是可聞，或不可聞。",
        "translation": "Sound is likewise, whether it's heard or not heard.",
        "source": "T12n0374_021:0488c05_46"
    },
    {
        "source_sentence": "是大涅槃非色非聲，云何而言可得見聞？",
        "translation": "This is the great nirvāṇa that's neither form nor sound, so how can it be said to be visible and heard?",
        "source": "T12n0374_021:0488c05_47"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0488c06_48"
    },
    {
        "source_sentence": "過去已滅則不可聞，未來未至亦不可聞，現在聽時則不名聞，聞已聲滅更不可聞。",
        "translation": "If the past has ceased, then they won't be heard, and if they haven't yet arrived in the future, they won't be heard. When they hear it now, they aren't called hearing, and after hearing it, the sound ceases and",
        "source": "T12n0374_021:0488c07_0"
    },
    {
        "source_sentence": "是大涅槃亦非過去、未來、現在，若非三世，則不可說，若不可說則不可聞，",
        "translation": "This mahiiparinirviir:za is neither past, nor future, nor present. If it were not for the three periods of time, there would be something ineffable. And if it were ineffable, there would be nothing to be heard.",
        "source": "T12n0374_021:0488c08_1"
    },
    {
        "source_sentence": "云何而言菩薩修是大涅槃經，聞所不聞？」",
        "translation": "How can it be said that a bodhisattva cultivates this great nirvāṇa sūtra and hears what he doesn't hear?",
        "source": "T12n0374_021:0488c10_2"
    },
    {
        "source_sentence": "爾時世尊讚光明遍照高貴德王菩薩摩訶薩言：「善哉，善哉！",
        "translation": "It was then that the Bhagavān praised the Bodhisattva Mahāsattva King of Universal Illumination, the supremely noble king of virtue, said, Good, good!",
        "source": "T12n0374_021:0488c12_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0488c13_1"
    },
    {
        "source_sentence": "汝今善知一切諸法，如幻如焰、如乾闥婆城、畫水之跡、亦如泡沫、芭蕉之樹空無有實，",
        "translation": "Good man, you now well know that all things are like illusions, like flames, like mirages, like clouds of water, like bubbles, like the sky of a plantain tree, without substance.",
        "source": "T12n0374_021:0488c13_2"
    },
    {
        "source_sentence": "非命非我，無有苦樂，如十住菩薩之所知見。」",
        "translation": "It's neither life nor self, and there's no pain or pleasure, just like the knowing and seeing of bodhisattvas in the ten abodes.",
        "source": "T12n0374_021:0488c15_3"
    },
    {
        "source_sentence": "時大眾中忽然之頃有大光明，非青見青、非黃見黃、非赤見赤、非白見白，",
        "translation": "Suddenly, there was a great ray of light in the midst of the masses that looked blue but not blue, yellow but not yellow, red but not red, white but not white.",
        "source": "T12n0374_021:0488c16_4"
    },
    {
        "source_sentence": "非色見色、非明見明、非見而見。",
        "translation": "They don't see form when they see form, don't see insight when they see insight, and don't see it when they see it.",
        "source": "T12n0374_021:0488c18_5"
    },
    {
        "source_sentence": "爾時大眾遇斯光已，身心快樂，譬如比丘入師子王定。",
        "translation": "At the time, when the masses saw this light, their bodies and minds were blissful, like a monk entering the lion king's concentration.",
        "source": "T12n0374_021:0488c18_6"
    },
    {
        "source_sentence": "爾時文殊師利菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that Mañjuśrī Bodhisattva Mahāsattva said to the Buddha, Bhagavān!",
        "source": "T12n0374_021:0488c20_0"
    },
    {
        "source_sentence": "今此光明誰之所放？」",
        "translation": "Who will emit this light now?",
        "source": "T12n0374_021:0488c20_1"
    },
    {
        "source_sentence": "爾時如來默然不說。",
        "translation": "It was then that the Tathāgata remained silent and didn't speak.",
        "source": "T12n0374_021:0488c21_2"
    },
    {
        "source_sentence": "迦葉菩薩復問文殊師利：「何因緣故，有此光明照於大眾？」",
        "translation": "Kāśyapa again asked Mañjuśrī, What is the reason this light shines to the masses?",
        "source": "T12n0374_021:0488c21_3"
    },
    {
        "source_sentence": "文殊師利默然不答。",
        "translation": "Mañjuśrī remained silent and didn't answer.",
        "source": "T12n0374_021:0488c23_4"
    },
    {
        "source_sentence": "爾時無邊身菩薩復問迦葉菩薩：「今此光明誰之所有？」",
        "translation": "It was then that the Bodhisattva of Limitless Body again asked Kāśyapa, Who owns this light now?",
        "source": "T12n0374_021:0488c23_5"
    },
    {
        "source_sentence": "迦葉菩薩默然不說。",
        "translation": "Kāśyapa Bodhisattva remained silent and didn't explain it.",
        "source": "T12n0374_021:0488c24_6"
    },
    {
        "source_sentence": "淨住王子菩薩復問無邊身菩薩：「何因緣故，是大眾中有此光明？」",
        "translation": "The prince bodhisattva Jīvaka again asked the Bodhisattva Bodhisattva of Boundless Body, What are the reasons why this light is present in the masses?",
        "source": "T12n0374_021:0488c25_7"
    },
    {
        "source_sentence": "無邊身菩薩默然不說。",
        "translation": "Bodhisattvas of the boundless body are silent and don't explain it.",
        "source": "T12n0374_021:0488c26_8"
    },
    {
        "source_sentence": "如是五百菩薩皆亦如是，雖相諮問然無答者。",
        "translation": "So it was with these five hundred bodhisattvas, who asked questions but didn't answer them even though they were consulting each other.",
        "source": "T12n0374_021:0488c27_9"
    },
    {
        "source_sentence": "爾時世尊問文殊師利言：「文殊師利！",
        "translation": "It was then that the Bhagavān asked Mañjuśrī, Mañjuśrī!",
        "source": "T12n0374_021:0488c28_10"
    },
    {
        "source_sentence": "何因緣故，是大眾中有此光明？」",
        "translation": "What are the causes and conditions for this light being present in the masses?",
        "source": "T12n0374_021:0488c29_11"
    },
    {
        "source_sentence": "文殊師利言：「世尊！",
        "translation": "Mañjuśrī said, Bhagavān!",
        "source": "T12n0374_021:0489a01_0"
    },
    {
        "source_sentence": "如是光明名為智慧，智慧者即是常住，常住之法無有因緣，云何佛問何因緣故有是光明？",
        "translation": "Such a light is called wisdom, and wisdom is the eternally abiding thing. The eternally abiding dharmas have no causes or conditions, so how did the Buddha ask why this light exists?",
        "source": "T12n0374_021:0489a01_1"
    },
    {
        "source_sentence": "是光明者名大涅槃，大涅槃者則名常住，常住之法不從因緣，云何佛問何因緣故有是光明？",
        "translation": "This light is called great nirvāṇa, and the great nirvāṇa is called eternally abiding. The eternally abiding dharma doesn't follow causes and conditions, so how did the Buddha ask what causes and conditions make this light possible?",
        "source": "T12n0374_021:0489a03_2"
    },
    {
        "source_sentence": "是光明者即是如來，如來者即是常住，常住之法不從因緣，云何如來問於因緣？",
        "translation": "This light is the Tathāgata, and the Tathāgata is the eternally abiding dharma. The eternally abiding dharma doesn't come from causes and conditions, so how does the Tathāgata ask about causes and conditions?",
        "source": "T12n0374_021:0489a05_3"
    },
    {
        "source_sentence": "光明者名大慈大悲，大慈大悲者名為常住，常住之法不從因緣，云何如來問於因緣？",
        "translation": "That light is called great kindness and great compassion, and great kindness and great compassion are called eternally abiding. The principle of eternally abiding doesn't follow causes and conditions, so how does the Tathāgata ask about causes and conditions?",
        "source": "T12n0374_021:0489a07_4"
    },
    {
        "source_sentence": "光明者即是念佛，念佛者是名常住，常住之法不從因緣，云何如來問於因緣？",
        "translation": "That light is mindfulness of Buddha, and mindfulness of Buddha is called eternally abiding. The principle of eternally abiding doesn't follow causes and conditions, so how did the Tathāgata ask about causes and conditions?",
        "source": "T12n0374_021:0489a09_5"
    },
    {
        "source_sentence": "光明者即是一切聲聞緣覺不共之道，聲聞緣覺不共之道即名常住，常住之法不從因緣，",
        "translation": "Light is the unique path of all śrāvakas and pratyekbuddhas. The unique path of all śrāvakas and pratyekabuddhas is called eternally abiding. The eternally abiding dharma does not come from causes or conditions.",
        "source": "T12n0374_021:0489a11_6"
    },
    {
        "source_sentence": "云何如來問於因緣？",
        "translation": "How did the Tathāgata ask about causes and conditions?",
        "source": "T12n0374_021:0489a13_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0489a13_8"
    },
    {
        "source_sentence": "亦有因緣，因滅無明則得熾然阿耨多羅三藐三菩提燈。」",
        "translation": "There are also causes and conditions that cause the cessation of ignorance to attain the blazing lamp of unsurpassed, correct, and complete enlightenment.",
        "source": "T12n0374_021:0489a13_9"
    },
    {
        "source_sentence": "佛言：「文殊師利！",
        "translation": "The Buddha said, Mañjuśrī!",
        "source": "T12n0374_021:0489a15_10"
    },
    {
        "source_sentence": "汝今莫入諸法甚深第一義諦，應以世諦而解說之。」",
        "translation": "Now, don't enter the profound ultimate truth of all dharmas; you should explain it in terms of the conventional truth.",
        "source": "T12n0374_021:0489a15_11"
    },
    {
        "source_sentence": "文殊師利言：「世尊！",
        "translation": "Mañjuśrī said, Bhagavān!",
        "source": "T12n0374_021:0489a16_12"
    },
    {
        "source_sentence": "於此東方過二十恒河沙等世界，有佛世界名曰不動，其佛住處，縱廣正等足滿一萬二千由旬，",
        "translation": "To the east of here, beyond as many worlds as there are grains of sand in twenty Ganges Rivers, is a buddha-world called Akṣobhya. This buddha abode extends twelve thousand yojanas in width and depth",
        "source": "T12n0374_021:0489a17_0"
    },
    {
        "source_sentence": "其地七寶，無有土石，平正柔軟無諸溝坑，其諸樹木四寶所成，金、銀、琉璃及以頗梨，",
        "translation": "The land is made of the seven kinds of treasure and there are no earthen or stone stones. It is even and peaceful, without any ditches or pits. All its trees and shrubs are made of the four kinds of treasure: gold",
        "source": "T12n0374_021:0489a19_1"
    },
    {
        "source_sentence": "花果茂盛無時不有，若有眾生聞其花香，身心安樂，譬如比丘入第三禪。",
        "translation": "Flowers and fruits flourish, and there's no time when they don't exist. If sentient beings hear the fragrance of those flowers, their bodies and minds are at peace, like a monk entering the third dhyāna.",
        "source": "T12n0374_021:0489a21_2"
    },
    {
        "source_sentence": "周匝復有三千大河，其水微妙，八味具足，若有眾生在中浴者，所得喜樂，",
        "translation": "It is surrounded by three thousand great rivers, the water of which is subtle and endowed with the eight flavors. If any living being bathe in them, they’ll experience delight and happiness.",
        "source": "T12n0374_021:0489a22_3"
    },
    {
        "source_sentence": "譬如比丘入第二禪。",
        "translation": "It's like a monk who enters the second dhyāna.",
        "source": "T12n0374_021:0489a24_4"
    },
    {
        "source_sentence": "其河多有種種諸花，優鉢羅花、波頭摩花、拘物頭花、分陀利花、香花、大香花、微妙香花、常花、一切眾生無遮護花。",
        "translation": "In that river there were many kinds of flowers, such as the utpala flower, padma flower, kumuda flower, puṇḍarīka flower, white lotus flower, fragrant flower, large fragrant flower,",
        "source": "T12n0374_021:0489a24_5"
    },
    {
        "source_sentence": "其河兩岸亦有眾花，所謂阿提目多伽花、占婆花、波吒羅花、婆師羅花、摩利迦花、大摩利迦花、新摩利迦花、須摩那迦花、由提迦花、檀[少\\/兔]迦利花、常花、一切眾生無遮護花。",
        "translation": "On both banks of the river there were also various kinds of flowers, such as the adhimuktaka flower, the占婆花,波吒羅花,婆師羅花,摩利迦花,大摩利迦花,新摩利迦花",
        "source": "T12n0374_021:0489a27_6"
    },
    {
        "source_sentence": "底布金沙。",
        "translation": "The bottom is covered with gold sand.",
        "source": "T12n0374_021:0489b02_7"
    },
    {
        "source_sentence": "有四梯梐，金、銀、琉璃、雜色頗梨。",
        "translation": "There are four ladders, which are made of gold, silver, beryl, and crystal in various colors.",
        "source": "T12n0374_021:0489b02_8"
    },
    {
        "source_sentence": "多有眾鳥遊集其上，復有無量虎狼、師子、諸惡鳥獸，其心相視，猶如赤子。",
        "translation": "Many birds roam above it, and there are countless tigers, wolves, lions, and other evil birds and animals that look at each other with their minds like a red child.",
        "source": "T12n0374_021:0489b03_0"
    },
    {
        "source_sentence": "彼世界中一切無有犯重禁者、誹謗正法及一闡提五逆等罪。",
        "translation": "In all those worlds, there's no offense that violates the grave prohibitions, denigrates the right teaching, or commits the five heinous crimes of icchantika and icchantika.",
        "source": "T12n0374_021:0489b04_1"
    },
    {
        "source_sentence": "其土調適，無有寒熱、飢渴、苦惱，無貪、欲、恚、放逸、嫉妬，無有日月、晝夜、時節，",
        "translation": "In that land there is neither cold, heat, hunger, thirst, or pain. There is neither thirst, desire, hatred, wickedness, laziness, nor jealousy. There is neither day nor night, nor season",
        "source": "T12n0374_021:0489b06_2"
    },
    {
        "source_sentence": "猶如第二忉利天上。",
        "translation": "It's like the second heaven in Trāyastriṃśa Heaven.",
        "source": "T12n0374_021:0489b07_3"
    },
    {
        "source_sentence": "其土人民等有光明，各各無有憍慢之心，一切悉是菩薩大士，皆得神通具大功德，",
        "translation": "All of them were great enlightening beings who had attained the great virtue of mystic knowledge.",
        "source": "T12n0374_021:0489b08_4"
    },
    {
        "source_sentence": "其心悉皆尊重正法，乘於大乘、愛念大乘、貪樂大乘、護惜大乘，大慧成就得大總持，",
        "translation": "Their minds all honored the true teaching, relied on the Great Vehicle, loved the Great Vehicle, yearned for the Great Vehicle, cherished the Great Vehicle, and treasured the Great Vehicle. They had perfected great wisdom and attained great mastery.",
        "source": "T12n0374_021:0489b10_5"
    },
    {
        "source_sentence": "心常憐愍一切眾生。",
        "translation": "His mind is always compassionate to all sentient beings.",
        "source": "T12n0374_021:0489b11_6"
    },
    {
        "source_sentence": "其佛號曰滿月光明如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "The buddha was called the Tathāgata of the Full Moonlike Light, Worthy of Offerings, Perfectly Enlightened, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed, Tamer of Humans",
        "source": "T12n0374_021:0489b12_7"
    },
    {
        "source_sentence": "隨所住處，有所講宣，其土眾生，無不得聞為琉璃光菩薩摩訶薩講宣如是大涅槃經。」",
        "translation": "Wherever they live, there's something to teach, and no sentient being in that land can hear such a great nirvāṇa sūtra taught by the Bodhisattva Mahāsattva of Lapis Light.",
        "source": "T12n0374_021:0489b14_8"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T12n0374_021:0489b16_9"
    },
    {
        "source_sentence": "菩薩摩訶薩若能修行大涅槃經，所不聞者皆悉得聞。",
        "translation": "If bodhisattvas and mahāsattvas can cultivate the great nirvāṇa sūtras, they'll hear them if they don't hear them.",
        "source": "T12n0374_021:0489b16_10"
    },
    {
        "source_sentence": "彼琉璃光菩薩摩訶薩問滿月光明佛，亦如此間光明遍照高貴德王菩薩摩訶薩所問，",
        "translation": "The bodhisattva Mahāsattva of Lapis Light asked the Buddha Candracchattraprabha, and so did the bodhisattva Mahāsattva Universal Illumination King of Noble Virtue ask.",
        "source": "T12n0374_021:0489b17_11"
    },
    {
        "source_sentence": "等無有異。",
        "translation": "There's no difference between the same and different.",
        "source": "T12n0374_021:0489b19_12"
    },
    {
        "source_sentence": "彼滿月光明佛即告琉璃光菩薩言：『善男子！",
        "translation": "The Buddha of the Light of the Full Moon then addressed the Lapis Lazuli Radiance Bodhisattva, saying, 'Good man!",
        "source": "T12n0374_021:0489b20_13"
    },
    {
        "source_sentence": "西方去此二十恒河沙佛土，彼有世界名曰娑婆，其土多有山陵、堆阜、土沙礫石、荊蕀毒刺、周遍充滿，",
        "translation": "In the west, beyond these buddha-lands as numerous as twenty times the number of grains of sand in the Ganges River, there is a world called Sahā. The land is full of hills, mounds, mounds, dirt, sand,",
        "source": "T12n0374_021:0489b21_14"
    },
    {
        "source_sentence": "常有飢渴、寒熱苦惱。",
        "translation": "They always suffer from hunger and thirst, cold and heat.",
        "source": "T12n0374_021:0489b23_15"
    },
    {
        "source_sentence": "其土人民，不能恭敬沙門、婆羅門、父母師長，貪著非法，欲於非法，",
        "translation": "The people of that land are unable to respect the śramaṇas, brāhmaṇas, parents, teachers, and elders. They covet what is against the Dharma and seek what is against the Dharma.",
        "source": "T12n0374_021:0489b23_16"
    },
    {
        "source_sentence": "修行邪法，不信正法，壽命短促，有行姦詐王者治之，王雖有國不知滿足，",
        "translation": "They practice false doctrines and do not believe in the true Dharma. Their life spans are short, and some who commit adultery against the king rule over them. Although the king has a country, he does not know how to fulfill it.",
        "source": "T12n0374_021:0489b25_17"
    },
    {
        "source_sentence": "於他所有生貪利心，興師相伐枉死者眾。",
        "translation": "They give rise to a desire for profit from what's possessed by others, and they arouse the teacher to conquer the multitude of those who die in vain.",
        "source": "T12n0374_021:0489b27_18"
    },
    {
        "source_sentence": "王者修行如是非法，四天善神心無歡喜，故降災旱，穀米不登，人民多病，",
        "translation": "Because the king practiced in such an unlawful way, the good deities of the four heavens did not rejoice at all. For this reason they caused calamity and drought; grain and rice would not rise up to the ground and most of the",
        "source": "T12n0374_021:0489b28_0"
    },
    {
        "source_sentence": "苦惱無量。",
        "translation": "The suffering and distress are immeasurable.",
        "source": "T12n0374_021:0489b29_1"
    },
    {
        "source_sentence": "彼中有佛，號釋迦牟尼如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "There was a buddha there called the Tathāgata Śākyamuni, Worthy of Offerings, Perfectly Enlightened, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed, Tamer of Humans",
        "source": "T12n0374_021:0489b29_2"
    },
    {
        "source_sentence": "大悲純厚，愍眾生故，於拘尸那城娑羅雙樹間，為諸大眾敷演如是大涅槃經。",
        "translation": "Because of his great compassion for sentient beings, he spread out the Mahāparinirvāṇa-sūtra like this among the two śāla trees in Kuśinagara and taught it to the masses.",
        "source": "T12n0374_021:0489c03_3"
    },
    {
        "source_sentence": "彼有菩薩，名光明遍照高貴德王，已問斯事，如汝無異。",
        "translation": "There's a bodhisattva named King of Universal Illumination, the noble king of virtue, who has asked about this matter, just as you did.",
        "source": "T12n0374_021:0489c04_4"
    },
    {
        "source_sentence": "佛今答之，汝可速往，自當得聞。』」",
        "translation": "Now, the Buddha will answer it, so you can quickly go there and hear it for yourself.'",
        "source": "T12n0374_021:0489c06_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0489c06_6"
    },
    {
        "source_sentence": "彼琉璃光菩薩聞是事已，與八萬四千菩薩摩訶薩欲來至此，故先現瑞，",
        "translation": "Having heard these words, the bodhisattva Light of the Lapis Lazuli and eighty-four thousand other great bodhisattvas manifested thus:",
        "source": "T12n0374_021:0489c06_7"
    },
    {
        "source_sentence": "以此因緣，有此光明，是名因緣，亦非因緣。」",
        "translation": "Because of these causes and conditions, this light exists, which are called causes and conditions and not causes and conditions.",
        "source": "T12n0374_021:0489c08_8"
    },
    {
        "source_sentence": "爾時琉璃光菩薩與八萬四千諸菩薩俱，持諸幡蓋、香花瓔珞、種種伎樂、倍勝於前，",
        "translation": "It was then that the enlightening being Light of Lapis Lazuli, accompanied by eighty-four thousand other enlightening beings, carried banners, canopies, fragrant flowers, jewelry, and various kinds of music,",
        "source": "T12n0374_021:0489c09_9"
    },
    {
        "source_sentence": "俱來至此拘尸那城娑羅雙樹間，以己所持供養之具供養於佛，頭面禮足，",
        "translation": "They all came to the place between the two śāla trees in Kuśinagara and offered their offerings to the Buddha, bowing at his feet with their foreheads and faces.",
        "source": "T12n0374_021:0489c11_10"
    },
    {
        "source_sentence": "合掌恭敬，右繞三匝，修敬已畢，却坐一面。",
        "translation": "He joined his palms in reverence and circumambulated the Buddha three times to his right. Having done so, he withdrew and sat to one side.",
        "source": "T12n0374_021:0489c13_11"
    },
    {
        "source_sentence": "爾時世尊問彼菩薩：「善男子！",
        "translation": "It was then that the Bhagavān asked those bodhisattvas, Good sons!",
        "source": "T12n0374_021:0489c15_0"
    },
    {
        "source_sentence": "汝為到來，為不到來？」",
        "translation": "Do you come or don't come?",
        "source": "T12n0374_021:0489c15_1"
    },
    {
        "source_sentence": "琉璃光菩薩言：「世尊！",
        "translation": "The Bodhisattva of Lapis Light said, Bhagavān!",
        "source": "T12n0374_021:0489c16_2"
    },
    {
        "source_sentence": "到亦不來，不到亦不來，我觀是義都無有來。",
        "translation": "When they arrive, they don't come; when they don't arrive, they don't come; and I observe that this meaning has no coming at all.",
        "source": "T12n0374_021:0489c16_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0489c17_4"
    },
    {
        "source_sentence": "諸行若常，亦復不來，若是無常亦無有來。",
        "translation": "If conditioned forces are permanent, they also don't come, and if they are impermanent, there's no coming either.",
        "source": "T12n0374_021:0489c17_5"
    },
    {
        "source_sentence": "若人見有眾生性者，有來、不來；",
        "translation": "If someone sees the existence of sentient beings, there is coming and no coming.",
        "source": "T12n0374_021:0489c18_6"
    },
    {
        "source_sentence": "我今不見眾生定性，云何當言有來、不來？",
        "translation": "Now that I don't see the determined nature of sentient beings, how can I say there's a coming or no coming?",
        "source": "T12n0374_021:0489c19_7"
    },
    {
        "source_sentence": "有憍慢者見有去來，無憍慢者則無去來；",
        "translation": "Those with arrogance see that there is coming and going, but those without arrogance have neither coming nor going.",
        "source": "T12n0374_021:0489c20_8"
    },
    {
        "source_sentence": "有取行者見有去來，無取行者則無去來；",
        "translation": "Those who act on grasping see that there is coming and going; those who do not act on grasping have neither coming nor going.",
        "source": "T12n0374_021:0489c21_9"
    },
    {
        "source_sentence": "若見如來畢竟涅槃則有去來，不見如來畢竟涅槃則無去來；",
        "translation": "If one sees the ultimate nirvana of Buddha, there is going and coming; but if one does not see the ultimate nirvana of Buddha, there is no going or coming.",
        "source": "T12n0374_021:0489c22_10"
    },
    {
        "source_sentence": "不聞佛性則有去來，聞佛性者則無去來；",
        "translation": "If one does not hear the buddha-nature, there will be coming and going; but if one hears the buddha-nature, there will be no coming or going.",
        "source": "T12n0374_021:0489c23_11"
    },
    {
        "source_sentence": "若見聲聞辟支佛人有涅槃者則有去來，不見聲聞辟支佛人有涅槃者則無去來；",
        "translation": "If one sees that the śrāvakas and pratyekabuddhas have nirvana, there is going and coming; but if one does not see that the śrāvakas and pratyekabuddhas have nirvana, there is no going or",
        "source": "T12n0374_021:0489c24_12"
    },
    {
        "source_sentence": "若見聲聞辟支佛人常樂我淨則有去來，若不見者則無去來；",
        "translation": "If one sees that śrāvakas and pratyekabuddhas are always blissful, self-indulgent, and pure, there is going and coming; but if one does not see them, there is no going or coming.",
        "source": "T12n0374_021:0489c26_13"
    },
    {
        "source_sentence": "若見如來無常樂我淨則有去來，若見如來常樂我淨則無去來。",
        "translation": "If someone sees that the Tathāgata is impermanent, blissful, selfless, and pure, then there's going and coming, and if they see that the Tathāgata is permanent, blissful, selfless, and pure, then",
        "source": "T12n0374_021:0489c27_14"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0489c29_15"
    },
    {
        "source_sentence": "且置斯事，欲有所問，唯垂哀愍，少見聽許。」",
        "translation": "I want to ask a question about this matter, so please have mercy on me and allow me to do so.”",
        "source": "T12n0374_021:0489c29_16"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T12n0374_021:0490a01_17"
    },
    {
        "source_sentence": "隨意所問，今正是時，我當為汝分別解說。",
        "translation": "Whatever you wish to ask, now is the right time. I will explain it for you in a discriminating way.",
        "source": "T12n0374_021:0490a01_18"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T12n0374_021:0490a02_19"
    },
    {
        "source_sentence": "諸佛難值，如優曇花，法亦如是難可得聞，十二部經中方等復難，是故應當專心聽受。」",
        "translation": "It's difficult to meet the buddhas, like the udumbara flower, and it's also difficult to hear the teaching; twelve sūtras are equally difficult, so you should concentrate on listening and accepting them.",
        "source": "T12n0374_021:0490a02_20"
    },
    {
        "source_sentence": "時琉璃光菩薩摩訶薩，既蒙聽許兼被誡勅，即白佛言：「世尊！",
        "translation": "Having heard the permission and been instructed, the Bodhisattva Mahāsattva of Lapis Light then said to the Buddha, Bhagavān!",
        "source": "T12n0374_021:0490a04_21"
    },
    {
        "source_sentence": "云何菩薩摩訶薩有能修行大涅槃經聞所不聞？」",
        "translation": "How does a bodhisattva-mahāsattva have the ability to cultivate the great nirvāṇa sūtras that are heard and not heard?",
        "source": "T12n0374_021:0490a06_22"
    },
    {
        "source_sentence": "爾時如來讚言：「善哉，善哉！",
        "translation": "It was then that the Tathāgata praised him, saying, Good, good!",
        "source": "T12n0374_021:0490a07_23"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490a07_24"
    },
    {
        "source_sentence": "汝今欲盡如是大乘大涅槃海，正復值我能善解說。",
        "translation": "Now, if you want to end this great vehicle ocean of great nirvāṇa, I'll explain it well.",
        "source": "T12n0374_021:0490a08_0"
    },
    {
        "source_sentence": "汝今所有疑網、毒鏃，我為大醫，能善拔出。",
        "translation": "I am the great physician who can remove this web of doubt and poisonous disease that you have now.",
        "source": "T12n0374_021:0490a09_1"
    },
    {
        "source_sentence": "汝於佛性猶未明了，我有慧炬，能為照明。",
        "translation": "You still do not understand the buddha-nature, but I have a torch of wisdom that can illuminate it.",
        "source": "T12n0374_021:0490a10_2"
    },
    {
        "source_sentence": "汝今欲度生死大河，我能為汝作大船師。",
        "translation": "Now, if you want to cross the great river of birth and death, I can become a great ship captain for you.",
        "source": "T12n0374_021:0490a11_3"
    },
    {
        "source_sentence": "汝於我所生父母想，我亦於汝生赤子心。",
        "translation": "You give rise to thoughts of parents for me, and I give rise to thoughts of children for you.",
        "source": "T12n0374_021:0490a12_0"
    },
    {
        "source_sentence": "汝心今者貪正法寶，值我多有能相惠施。",
        "translation": "Your mind now clings to the treasure of the true Dharma, and when you meet me, there are many people who can give generously to each other.",
        "source": "T12n0374_021:0490a12_1"
    },
    {
        "source_sentence": "諦聽，諦聽！",
        "translation": "Listen attentively, and pay close attention!",
        "source": "T12n0374_021:0490a13_2"
    },
    {
        "source_sentence": "善思念之！",
        "translation": "Consider it well!",
        "source": "T12n0374_021:0490a14_3"
    },
    {
        "source_sentence": "吾當為汝分別宣釋。",
        "translation": "I will explain it separately for you.",
        "source": "T12n0374_021:0490a14_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490a14_5"
    },
    {
        "source_sentence": "欲聽法者，今正是時，若聞法已，當生敬信，至心聽受恭敬尊重，於正法所莫求其過，",
        "translation": "Those who wish to hear the Dharma should now be able to do so. Having heard the Dharma, they should give rise to reverence and faith, wholeheartedly listen [to it] with respect and veneration, and not seek faults in the true Dharma.",
        "source": "T12n0374_021:0490a15_0"
    },
    {
        "source_sentence": "莫念貪欲、瞋恚、愚癡，莫覩法師種姓好惡。",
        "translation": "Don't be mindful of craving, anger, and folly, and don't pity the goodness and badness of the Dharma teacher's family.",
        "source": "T12n0374_021:0490a16_1"
    },
    {
        "source_sentence": "既聞法已莫生憍慢，莫為恭敬、名譽、利養，當為度世甘露法利。",
        "translation": "Having heard the Dharma, don't become conceited, and don't venerate it for its respect, fame, or profit, so you can save the world with the benefits of the ambrosia of the Dharma.",
        "source": "T12n0374_021:0490a17_2"
    },
    {
        "source_sentence": "亦莫生念：『我聽法已先自度身然後度人，先自解身然後解人，先自安身然後安人，",
        "translation": "“Having listened to the Dharma, let me first liberate my own body and then others’ bodies. First I myself will be liberated, and then others will be liberated.",
        "source": "T12n0374_021:0490a19_3"
    },
    {
        "source_sentence": "先自涅槃然後令人而得涅槃。』",
        "translation": "First, he himself becomes nirvāṇa and then he causes others to attain nirvāṇa.'",
        "source": "T12n0374_021:0490a21_4"
    },
    {
        "source_sentence": "於佛、法、僧，應生等想；",
        "translation": "They think of buddhas, doctrines, and samgha as equal.",
        "source": "T12n0374_021:0490a21_5"
    },
    {
        "source_sentence": "於生死中生大苦想；",
        "translation": "They think of birth and death as great suffering.",
        "source": "T12n0374_021:0490a22_6"
    },
    {
        "source_sentence": "於大涅槃應生常樂我淨之想；",
        "translation": "In the Great Nirvana one should think of permanence, bliss, self, and purity.",
        "source": "T12n0374_021:0490a22_7"
    },
    {
        "source_sentence": "先為他人，然後為身；",
        "translation": "They do so first for the sake of others and then for their own sake.",
        "source": "T12n0374_021:0490a23_8"
    },
    {
        "source_sentence": "當為大乘莫為二乘，於一切法當無所住，亦莫專執一切法相，於諸法中莫生貪相，",
        "translation": "They should be teachers of the Great Vehicle and not adherents of the two vehicles. They should have no abiding in anything, and they should not cling exclusively to the characteristics of things. They should not give rise to covetousness toward things.",
        "source": "T12n0374_021:0490a23_9"
    },
    {
        "source_sentence": "常生知法、見法之相。",
        "translation": "They always give rise to the characteristic of knowing the teaching and seeing the teaching.",
        "source": "T12n0374_021:0490a25_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490a26_11"
    },
    {
        "source_sentence": "汝能如是至心聽法，是則名為聞所不聞。",
        "translation": "If you can thus wholeheartedly listen to the teaching, this is called what's heard and not heard.",
        "source": "T12n0374_021:0490a26_12"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490a27_13"
    },
    {
        "source_sentence": "有不聞聞、有不聞不聞、有聞不聞、有聞聞。",
        "translation": "There are those who don't hear and hear, those who don't hear and don't hear, those who hear and don't hear, and those who hear and hear.",
        "source": "T12n0374_021:0490a27_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490a28_15"
    },
    {
        "source_sentence": "如不生生、不生不生、生不生、生生，如不到到、不到不到、到不到、到到。」",
        "translation": "It's like when something that doesn't arise is produced, what doesn't arise is produced, what doesn't arise is produced, and what doesn't arise is produced; it's like when something doesn't reach, doesn't",
        "source": "T12n0374_021:0490a28_16"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0490b01_17"
    },
    {
        "source_sentence": "云何不生生？」",
        "translation": "How does it not give rise to birth?",
        "source": "T12n0374_021:0490b01_18"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490b01_19"
    },
    {
        "source_sentence": "安住世諦，初出胎時，是名不生生。",
        "translation": "When he abides in the conventional truth, this is called not being born when he first emerges from the womb.",
        "source": "T12n0374_021:0490b02_0"
    },
    {
        "source_sentence": "云何不生不生？",
        "translation": "How are they not produced and not produced?",
        "source": "T12n0374_021:0490b02_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490b03_2"
    },
    {
        "source_sentence": "是大涅槃無有生相，是名不生不生。",
        "translation": "This is the great nirvāṇa that has no characteristic of arising, which is called neither arising nor not arising.",
        "source": "T12n0374_021:0490b03_3"
    },
    {
        "source_sentence": "云何生不生？",
        "translation": "How are they produced and not produced?",
        "source": "T12n0374_021:0490b04_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490b04_5"
    },
    {
        "source_sentence": "世諦死時是名生不生。",
        "translation": "When the conventional truth dies, it's called birth and non-birth.",
        "source": "T12n0374_021:0490b04_6"
    },
    {
        "source_sentence": "云何生生？",
        "translation": "What's birth and birth?",
        "source": "T12n0374_021:0490b05_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490b05_8"
    },
    {
        "source_sentence": "一切凡夫是名生生。",
        "translation": "All worldlings are called birth-and-birth.",
        "source": "T12n0374_021:0490b05_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_021:0490b06_10"
    },
    {
        "source_sentence": "生生不斷故。",
        "translation": "It's because birth and birth don't continue.",
        "source": "T12n0374_021:0490b06_11"
    },
    {
        "source_sentence": "一切有漏念念生故，是名生生。",
        "translation": "Because all contaminants arise in every moment of thought, this is called arising.",
        "source": "T12n0374_021:0490b06_12"
    },
    {
        "source_sentence": "四住菩薩名生不生。",
        "translation": "The fourth abode bodhisattva is called arising and not arising.",
        "source": "T12n0374_021:0490b07_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_021:0490b07_14"
    },
    {
        "source_sentence": "生自在故，是名生不生。",
        "translation": "Because it arises freely, this is called what arises and doesn't arise.",
        "source": "T12n0374_021:0490b07_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490b08_16"
    },
    {
        "source_sentence": "是名內法。",
        "translation": "These are called internal dharmas.",
        "source": "T12n0374_021:0490b08_17"
    },
    {
        "source_sentence": "云何外法？",
        "translation": "What are the external dharmas?",
        "source": "T12n0374_021:0490b08_18"
    },
    {
        "source_sentence": "未生生、未生未生、生未生、生生。",
        "translation": "What's yet to be produced produces, what's yet to be produced and what's yet to be produced, what's yet to be produced and what's yet to be produced.",
        "source": "T12n0374_021:0490b09_19"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490b09_20"
    },
    {
        "source_sentence": "譬如種子，未生牙時，得四大和合、人功作業、然後乃生，是名未生生。",
        "translation": "It's like a seed that when it doesn't grow a tooth, the four elements are combined, human effort is exerted, and then it grows, which is called unarisen birth.",
        "source": "T12n0374_021:0490b10_0"
    },
    {
        "source_sentence": "云何未生未生？",
        "translation": "How are they not yet produced and not yet produced?",
        "source": "T12n0374_021:0490b11_1"
    },
    {
        "source_sentence": "譬如敗種及未遇緣，如是等輩，名未生未生。",
        "translation": "It's like a defeated seed or a condition that has yet to be met, and such a group of people are called those who haven't yet arisen and haven't yet arisen.",
        "source": "T12n0374_021:0490b11_2"
    },
    {
        "source_sentence": "云何生未生？",
        "translation": "What's produced and what's not produced?",
        "source": "T12n0374_021:0490b12_3"
    },
    {
        "source_sentence": "如牙生已而不增長，是名生未生。",
        "translation": "It's like a tooth that has arisen but doesn't grow after it arises, which is called arising and not arising.",
        "source": "T12n0374_021:0490b13_4"
    },
    {
        "source_sentence": "云何生生？",
        "translation": "What's birth and birth?",
        "source": "T12n0374_021:0490b14_0"
    },
    {
        "source_sentence": "如牙增長，若生不生則無增長。",
        "translation": "It's like growing a tooth, and if it arises or doesn't arise, then there won't be growth.",
        "source": "T12n0374_021:0490b14_1"
    },
    {
        "source_sentence": "如是一切有漏，是名外法生生。」",
        "translation": "Thus, all these contaminants are called the arising of external dharmas.",
        "source": "T12n0374_021:0490b15_0"
    },
    {
        "source_sentence": "琉璃光菩薩摩訶薩白佛言：「世尊！",
        "translation": "The Bodhisattva Mahāsattva of Lapis Light said to the Buddha, Bhagavān!",
        "source": "T12n0374_021:0490b15_1"
    },
    {
        "source_sentence": "有漏之法若有生者，為是常耶？",
        "translation": "If there are contaminated dharmas that arise, is it permanent?",
        "source": "T12n0374_021:0490b16_2"
    },
    {
        "source_sentence": "是無常乎？",
        "translation": "Is it impermanent?",
        "source": "T12n0374_021:0490b17_3"
    },
    {
        "source_sentence": "生若是常，有漏之法則無有生；",
        "translation": "If arising were permanent, there would be no arising for impure dharmas.",
        "source": "T12n0374_021:0490b17_4"
    },
    {
        "source_sentence": "生若無常，則有漏是常。",
        "translation": "If birth is impermanent, then the contaminants are permanent.",
        "source": "T12n0374_021:0490b18_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0490b18_6"
    },
    {
        "source_sentence": "若生能自生，生無自性；",
        "translation": "When arising is able to arise by itself, there is no self-nature of arising.",
        "source": "T12n0374_021:0490b18_7"
    },
    {
        "source_sentence": "若能生他，以何因緣不生無漏？",
        "translation": "If they can give rise to others, what are the causes and conditions that don't give rise to the pure?",
        "source": "T12n0374_021:0490b19_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0490b20_0"
    },
    {
        "source_sentence": "若未生時有生者，云何於今乃名為生？",
        "translation": "If there's birth when it doesn't yet arise, then how is it called birth now?",
        "source": "T12n0374_021:0490b20_1"
    },
    {
        "source_sentence": "若未生時無生者，何故不說虛空為生？」",
        "translation": "If there's no birth when it has yet to arise, why isn't space described as birth?",
        "source": "T12n0374_021:0490b21_0"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T12n0374_021:0490b21_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490b22_2"
    },
    {
        "source_sentence": "不生生不可說、生生亦不可說、生不生亦不可說、不生不生亦不可說、生亦不可說、不生亦不可說，",
        "translation": "neither arising nor non-arising can be explained, neither arising nor non-arising can be explained, neither non-arising nor arising can be explained, neither arising nor non-arising can be explained, neither arising nor",
        "source": "T12n0374_021:0490b22_3"
    },
    {
        "source_sentence": "有因緣故，亦可得說。",
        "translation": "Because there are causes and conditions, they can also be explained.",
        "source": "T12n0374_021:0490b24_4"
    },
    {
        "source_sentence": "云何不生生不可說？",
        "translation": "How is it that nonarising and arising are inexpressible?",
        "source": "T12n0374_021:0490b25_5"
    },
    {
        "source_sentence": "不生名為生，云何可說！",
        "translation": "What doesn't arise is called birth, so how can it be explained?",
        "source": "T12n0374_021:0490b25_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_021:0490b26_7"
    },
    {
        "source_sentence": "以其生故。",
        "translation": "It's because it arises.",
        "source": "T12n0374_021:0490b26_8"
    },
    {
        "source_sentence": "云何生生不可說？",
        "translation": "How is it that birth and birth are inexpressible?",
        "source": "T12n0374_021:0490b26_9"
    },
    {
        "source_sentence": "生生故生，生生故不生，亦不可說。",
        "translation": "Because of being produced, it is produced; because of being produced, it is not produced. Nor can they be spoken of.",
        "source": "T12n0374_021:0490b26_10"
    },
    {
        "source_sentence": "云何生不生不可說？",
        "translation": "How can what is produced and what is not produced be inexpressible?",
        "source": "T12n0374_021:0490b27_11"
    },
    {
        "source_sentence": "生即名為生，生不自生，故不可說。",
        "translation": "Birth is what is called ‘birth’. Because birth does not arise by itself, it cannot be spoken of.",
        "source": "T12n0374_021:0490b28_12"
    },
    {
        "source_sentence": "云何不生不生不可說？",
        "translation": "How can it not arise and not arise be inexpressible?",
        "source": "T12n0374_021:0490b28_13"
    },
    {
        "source_sentence": "不生者名為涅槃，涅槃不生故不可說！",
        "translation": "What doesn't arise is called nirvāṇa, and because nirvāṇa doesn't arise, it can't be explained!",
        "source": "T12n0374_021:0490b29_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_021:0490c01_15"
    },
    {
        "source_sentence": "以修道得故。",
        "translation": "It's because it's attained by cultivating the path.",
        "source": "T12n0374_021:0490c01_16"
    },
    {
        "source_sentence": "云何生亦不可說？",
        "translation": "How can birth also be explained?",
        "source": "T12n0374_021:0490c01_17"
    },
    {
        "source_sentence": "以生無故。",
        "translation": "It's because birth is nonexistent.",
        "source": "T12n0374_021:0490c02_18"
    },
    {
        "source_sentence": "云何不生不可說？",
        "translation": "How could it not arise and be ineffable?",
        "source": "T12n0374_021:0490c02_19"
    },
    {
        "source_sentence": "以有得故。",
        "translation": "It's because there's attainment.",
        "source": "T12n0374_021:0490c02_20"
    },
    {
        "source_sentence": "云何有因緣故亦可得說？",
        "translation": "How can it be explained because there are causes and conditions?",
        "source": "T12n0374_021:0490c03_21"
    },
    {
        "source_sentence": "十因緣法為生作因，以是義故，亦可得說。",
        "translation": "The ten causes and conditions are factors that act as the efficient cause for birth. Because of this meaning, they can also be spoken of.",
        "source": "T12n0374_021:0490c03_22"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490c04_23"
    },
    {
        "source_sentence": "汝今莫入甚深空定。",
        "translation": "Don't enter the profound concentration of emptiness now.",
        "source": "T12n0374_021:0490c04_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_021:0490c05_25"
    },
    {
        "source_sentence": "大眾鈍故。",
        "translation": "It's because the masses are dull.",
        "source": "T12n0374_021:0490c05_26"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490c05_27"
    },
    {
        "source_sentence": "有為之法生亦是常，以住無常，生亦無常；",
        "translation": "Conditioned factors arising are also permanent: because they abide in impermanence, birth is also impermanent.",
        "source": "T12n0374_021:0490c05_28"
    },
    {
        "source_sentence": "住亦是常，以生生故，住亦無常；",
        "translation": "Abiding is also impermanent because it arises, and so too does abiding.",
        "source": "T12n0374_021:0490c06_29"
    },
    {
        "source_sentence": "異亦是常，以法無常，異亦無常；",
        "translation": "Differences are also permanence: because things are impermanent, differences are also impermanent.",
        "source": "T12n0374_021:0490c07_30"
    },
    {
        "source_sentence": "壞亦是常，以本無今有故，壞亦無常。",
        "translation": "Decay is also impermanent because it was nonexistent in the past and now exists, and so is decay.",
        "source": "T12n0374_021:0490c08_31"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490c09_32"
    },
    {
        "source_sentence": "以性故生、住、異、壞皆悉是常，念念滅故不可說常，是大涅槃能斷滅故，",
        "translation": "It is by their nature that birth, duration, dissimilarity and decay are all permanent. Because they cease moment after moment, it cannot be said to be permanent: because it is the great nirvana which can abandon them.",
        "source": "T12n0374_021:0490c09_33"
    },
    {
        "source_sentence": "故名無常。",
        "translation": "Therefore, it's called impermanent.",
        "source": "T12n0374_021:0490c10_34"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0490c11_35"
    },
    {
        "source_sentence": "有漏之法未生之時，已有生性，故生能生。",
        "translation": "When impure dharmas are not produced yet, they already have the nature of arising; therefore, birth is able to arise.",
        "source": "T12n0374_021:0490c11_36"
    },
    {
        "source_sentence": "無漏之法本無生性，是故生不能生。",
        "translation": "Pure dharmas are originally without the nature of arising, so birth can't arise.",
        "source": "T12n0374_021:0490c12_37"
    },
    {
        "source_sentence": "如火有本性，遇緣則發。",
        "translation": "It's like fire with its original nature, which arises when it meets conditions.",
        "source": "T12n0374_021:0490c13_0"
    },
    {
        "source_sentence": "眼有見性，因色、因明、因心故見。",
        "translation": "The eye has the nature of seeing: it is seen because of matter, because of insight and because of awarenesses.",
        "source": "T12n0374_021:0490c13_1"
    },
    {
        "source_sentence": "眾生生法，亦復如是，由本有性，遇業因緣，父母和合，則便有生。」",
        "translation": "The law of sentient beings' birth is likewise, because there's originally a nature that meets the causes and conditions for karma, and when parents are united, then there's birth.",
        "source": "T12n0374_021:0490c14_2"
    },
    {
        "source_sentence": "爾時琉璃光菩薩摩訶薩及八萬四千菩薩摩訶薩，聞是法已，踊在虛空，",
        "translation": "It was then that the great enlightening being Light of the Lapis Lazuli, together with eighty-four thousand other great enlightening beings, heard this teaching and flew up into the sky.",
        "source": "T12n0374_021:0490c15_3"
    },
    {
        "source_sentence": "高七多羅樹，恭敬合掌，而白佛言：「世尊！",
        "translation": "The palms joined in respect and said to the Buddha, Bhagavān!",
        "source": "T12n0374_021:0490c17_4"
    },
    {
        "source_sentence": "我蒙如來慇懃教誨，因大涅槃始得悟解，聞所不聞。",
        "translation": "Having received the humble instruction of the Tathāgata, I attained awakening and understanding as a result of the great nirvāṇa, which I have never heard before.",
        "source": "T12n0374_021:0490c18_5"
    },
    {
        "source_sentence": "亦令八萬四千菩薩深解諸法，不生生等。",
        "translation": "It also causes 84,000 bodhisattvas to deeply understand the dharmas, such as nonarising and so forth.",
        "source": "T12n0374_021:0490c19_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0490c20_7"
    },
    {
        "source_sentence": "我今已解，斷諸疑網。",
        "translation": "Now that I have understood it, I've cut off the web of doubt.",
        "source": "T12n0374_021:0490c20_8"
    },
    {
        "source_sentence": "然此會中有一菩薩，名曰無畏，復欲諮稟，唯垂聽許。」",
        "translation": "Still, there's a bodhisattva named fearlessness in this assembly who wants to consult and give his permission.",
        "source": "T12n0374_021:0490c20_9"
    },
    {
        "source_sentence": "爾時世尊告無畏菩薩：「善男子！",
        "translation": "It was then that the Bhagavān addressed the fearless bodhisattva, Good sons!",
        "source": "T12n0374_021:0490c22_10"
    },
    {
        "source_sentence": "隨意問難，吾當為汝分別解說。」",
        "translation": "As you wish, I'll explain it for you with discernment and explanation.",
        "source": "T12n0374_021:0490c22_11"
    },
    {
        "source_sentence": "爾時無畏菩薩與六萬(一本云與八萬)四千諸菩薩等，俱從座起，更整衣服，",
        "translation": "It was then that the fearless bodhisattva Avalokiteśvara arose from his seat together with sixty thousand other bodhisattvas equal in number to the eighty-thousand buddha-bodhisattvas.",
        "source": "T12n0374_021:0490c23_12"
    },
    {
        "source_sentence": "長跪合掌而白佛言：「世尊！",
        "translation": "Kneeling down with joined palms, he said to the Buddha, Bhagavān!",
        "source": "T12n0374_021:0490c25_0"
    },
    {
        "source_sentence": "此土眾生當造何業，而得生彼不動世界？",
        "translation": "What actions will the sentient beings of this land do to be born in that immovable world?",
        "source": "T12n0374_021:0490c25_1"
    },
    {
        "source_sentence": "其土菩薩云何而得智慧成就、人中象王、有大威德，具修諸行，利智捷疾，",
        "translation": "“World-honored One, how did the bodhisattvas of that land attain wisdom and perfect knowledge? Among the people there were elephant kings and greatly majestic enlightening beings. They cultivated all kinds of practices to",
        "source": "T12n0374_021:0490c26_2"
    },
    {
        "source_sentence": "聞則能解？」",
        "translation": "When you hear it, you can understand it?",
        "source": "T12n0374_021:0490c28_3"
    },
    {
        "source_sentence": "「不害眾生命，　　堅持諸禁戒，",
        "translation": "Not killing sentient beings, they uphold the precepts and observe the restraints.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　受佛微妙教，　　則生不動國。",
        "translation": "Accepting the Buddha’s subtle teaching, They will be born in the immovable land.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　不奪他人財，　　常施惠一切，",
        "translation": "They don’t steal the property of others, Always bestow blessings on all.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　造招提僧坊，　　則生不動國。",
        "translation": "If you build a monastic monastery in Zhaoti, You will be born in the land of Akṣobhya.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　不犯他婦女，　　自妻不非時，",
        "translation": "They won’t violate the law against other women, and their own wives won’t marry at an ungodly hour.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　施持戒臥具，　　則生不動國。",
        "translation": "Giving to observe precepts and bedding, they'll be born in the land of immovability.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　不為自他故，　　求利及恐怖，",
        "translation": "They don’t seek profit and fear for the sake of self or others.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　慎口不妄語，　　則生不動國。",
        "translation": "Be careful not to speak falsehood, And you’ll be born in the immovable land.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　莫壞善知識，　　遠離惡眷屬，",
        "translation": "Don't destroy good friends, be far removed from bad associates,",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　口常和合語，　　則生不動國。",
        "translation": "If one always speaks harmoniously, One will be born in the immovable land.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　如諸菩薩等，　　常離於惡口，",
        "translation": "Like bodhisattvas and so forth, they always abstain from harsh speech.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　所說人樂聞，　　則生不動國。",
        "translation": "The people who hear what they teach and enjoy listening Are born in the immovable land.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　乃至於戲笑，　　不說非時語，",
        "translation": "Even when they're laughing, they don't speak at an ungodly hour.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　謹慎常時說，　　則生不動國。",
        "translation": "If you are careful and always explain it correctly, You will be born in the immovable land.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　見他得利養，　　常生歡喜心，",
        "translation": "Seeing others attain benefits, they always become joyous.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　不起嫉妬結，　　則生不動國。",
        "translation": "If you don’t form the bond of jealousy, Then you’ll be born in the immovable state.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　不惱於眾生，　　常生於慈心，",
        "translation": "They do not harm sentient beings, Always producing compassion.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　不生方便惡，　　則生不動國。",
        "translation": "If they don’t give rise to the evil of skillful means, Then they’ll give rise to the immovable state.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　邪見言無施，　　父母及去來，",
        "translation": "Wrong views say there's no giving, parents and the past and future.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　不起如是見，　　則生不動國。",
        "translation": "If someone doesn't give rise to such views, they'll be born in the land of immovability.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　曠路作好井，　　種殖果樹林，",
        "translation": "A good well has been built at the side of the road, planted in a fruit-growing forest.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　常施乞者食，　　則生不動國。",
        "translation": "If they always give food to beggars, They'll be born in the land of Akṣobhya.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　若於佛法僧，　　供養一香燈，",
        "translation": "If you offer a single fragrant lamp to the Buddha, Dharma, and Saṃgha,",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　乃至獻一花，　　則生不動國。",
        "translation": "Even if you offer a single flower, You'll be born in the immovable land.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　若為恐怖故，　　利養及福德，",
        "translation": "If it's because of fear, profit and possessions and virtue will always be the same.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　書是經一偈，　　則生不動國。",
        "translation": "To write this one verse of the sutra is to give rise to the land of Akṣobhya.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　若為悕利福，　　能於一日中，",
        "translation": "If it's for the sake of debilitating merit, he can in a single day...",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　讀誦是經典，　　則生不動國。",
        "translation": "Reciting this scripture, they'll be born in the land of Akṣobhya.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　若為無上道，　　一日一夜中，",
        "translation": "In one day and night, for the sake of the highest path,",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　受持八戒齋，　　則生不動國。",
        "translation": "By observing the eight precepts, they'll be born in the land of Akṣobhya.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　不與犯重禁，　　同共一處住，",
        "translation": "They won't be allowed to violate a grave prohibition and live together in one place.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　呵謗方等者，　　則生不動國。",
        "translation": "If someone denigrates the well-balanced, they'll be born in the land of immovability.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　若能施病者，　　乃至於一果，",
        "translation": "If you can give to someone who's sick, even for a single fruit,",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　歡喜而瞻視，　　則生不動國。",
        "translation": "Rejoicing and gazing joyfully, they'll be born in the land of Akṣobhya.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　不犯僧鬘物，　　善守於佛物，",
        "translation": "They don't violate the property of the saṃgha and well guard the Buddha's property.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　塗掃佛僧地，　　則生不動國。",
        "translation": "If one sweeps the Buddha’s and Sangha’s land, One will be reborn in the immovable state.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　造像及佛塔，　　猶如大拇指，",
        "translation": "They build images and buddha-tales, just like thumbs.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　常生歡喜心，　　則生不動國。",
        "translation": "If one always gives rise to joy, Then one will be born in the immovable land.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　若為是經典，　　自身及財寶，",
        "translation": "If someone were to make this sūtra for themselves and their possessions,",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　施於說法者，　　則生不動國。",
        "translation": "Giving to someone who teaches the Dharma, they'll be born in the immovable land.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　若能聽書寫，　　受持及讀誦，",
        "translation": "If someone can hear, write, memorize, and recite it,",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "　諸佛祕密藏，　　則生不動國。」",
        "translation": "The secret treasury of the buddhas, then he'll be born in the immovable land.",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "爾時世尊即說偈言：爾時無畏菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that the Bhagavān spoke a verse, saying, At that point, the fearless bodhisattva Mahāsattva said to the Buddha, Bhagavān!",
        "source": "T12n0374_021:0490c28_4"
    },
    {
        "source_sentence": "我今已知所造業緣得生彼國。",
        "translation": "Now, I've known that the karmic conditions created will allow me to be born in that country.",
        "source": "T12n0374_021:0491b13_5"
    },
    {
        "source_sentence": "是光明遍照高貴德王菩薩摩訶薩，普為憐愍一切眾生，先所諮問，如來若說，",
        "translation": "“Furthermore, the great enlightening being Universal Illumination of this light is the supremely noble King of Virtue. For the sake of compassion toward all sentient beings, he first consults and inquires—if the Enlighten",
        "source": "T12n0374_021:0491b14_6"
    },
    {
        "source_sentence": "則能利益、安樂，人、天、阿修羅、乾闥婆、迦樓羅、緊那羅、摩睺羅伽等。」",
        "translation": "Then they can benefit and bring comfort to humans, gods, asuras, gandharvas, garuḍas, kiṃnaras, mahoragas, and so forth.",
        "source": "T12n0374_021:0491b16_7"
    },
    {
        "source_sentence": "爾時世尊即告光明遍照高貴德王菩薩：「善哉，善哉！",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva King of Universal Illumination and Noble Virtue, Good, good!",
        "source": "T12n0374_021:0491b17_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0491b18_9"
    },
    {
        "source_sentence": "汝今於此當至心聽，吾當為汝分別解說。",
        "translation": "Here now, you must listen attentively. I will explain it clearly and distinctly for you.",
        "source": "T12n0374_021:0491b19_10"
    },
    {
        "source_sentence": "有因緣故，未到不到。",
        "translation": "Because there are causes and conditions, they haven't arrived or won't arrive.",
        "source": "T12n0374_021:0491b20_11"
    },
    {
        "source_sentence": "有因緣故，不到到。",
        "translation": "Because there are causes and conditions, they don't reach them.",
        "source": "T12n0374_021:0491b20_12"
    },
    {
        "source_sentence": "有因緣故，到不到。",
        "translation": "Because there are causes and conditions, they arrive and don't.",
        "source": "T12n0374_021:0491b20_13"
    },
    {
        "source_sentence": "有因緣故，到到。",
        "translation": "It's because there are causes and conditions that they arrive.",
        "source": "T12n0374_021:0491b21_14"
    },
    {
        "source_sentence": "何因緣故未到不到？",
        "translation": "What are the reasons for not arriving and not arriving?",
        "source": "T12n0374_021:0491b21_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0491b22_16"
    },
    {
        "source_sentence": "夫不到者是大涅槃，凡夫未到，以有貪欲、瞋恚、愚癡故，身業、口業不清淨故，",
        "translation": "Those who don’t attain it are the great nirvana. Ordinary people who have not yet attained it because they have craving, hatred, and folly, and because bodily action and verbal action are impure.",
        "source": "T12n0374_021:0491b22_17"
    },
    {
        "source_sentence": "及受一切不淨物故，犯四重故，謗方等故，一闡提故，五逆罪故，以是義故，",
        "translation": "It is because of feeling all impure things: because of the fourfold transgressions, because of blaming equanimity and icchantika; because of five heinous sins: because of this meaning.",
        "source": "T12n0374_021:0491b24_18"
    },
    {
        "source_sentence": "未到不到。",
        "translation": "They haven't arrived or haven't arrived yet.",
        "source": "T12n0374_021:0491b25_19"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0491b25_20"
    },
    {
        "source_sentence": "何因緣故不到到？",
        "translation": "What are the reasons why they don't reach it?",
        "source": "T12n0374_021:0491b26_21"
    },
    {
        "source_sentence": "不到者名大涅槃。",
        "translation": "Those who don't attain it are called great nirvāṇa.",
        "source": "T12n0374_021:0491b26_22"
    },
    {
        "source_sentence": "何義故到？",
        "translation": "What does it mean to arrive?",
        "source": "T12n0374_021:0491b26_23"
    },
    {
        "source_sentence": "永斷貪欲瞋恚愚癡身口惡故，不受一切不淨物故，不犯四重故，不謗方等經故，",
        "translation": "Because they permanently eliminate craving, anger, hatred, folly, and the evil of body and speech, because they do not accept anything impure, because they do not violate the four grave precepts, and because they do not slander",
        "source": "T12n0374_021:0491b27_24"
    },
    {
        "source_sentence": "不作一闡提故，不作五逆罪故，以是義故，名不到到。",
        "translation": "It's because they don't do icchantika and don't commit the five heinous crimes, and because of this meaning, they're called unattainable.",
        "source": "T12n0374_021:0491b29_0"
    },
    {
        "source_sentence": "須陀洹者八萬劫到，斯陀含者六萬劫到，阿那含者四萬劫到，阿羅漢者二萬劫到，",
        "translation": "The srotadpanna [comes] for eighty thousand kalpas, the sakṛdāgāmin [comes] for sixty thousand kalpas, the anāgāmin [comes] for for forty thousand kalpas, and the arhat [com",
        "source": "T12n0374_021:0491c01_1"
    },
    {
        "source_sentence": "辟支佛者十千劫到，以是義故，名不到到。",
        "translation": "A pratyekabuddha arrives after 10,000 eons, and because of this meaning, it's called not arriving.",
        "source": "T12n0374_021:0491c03_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0491c04_0"
    },
    {
        "source_sentence": "何因緣故名到不到？",
        "translation": "What is the reason it is called arriving and not arriving?",
        "source": "T12n0374_021:0491c04_1"
    },
    {
        "source_sentence": "到者名為二十五有，一切眾生常為無量煩惱諸結之所覆蔽，往來不離，",
        "translation": "Those who arrive at it are called the twenty-five existences. All sentient beings are constantly shrouded by the fetters of immeasurable afflictions, coming and going without separation.",
        "source": "T12n0374_021:0491c04_2"
    },
    {
        "source_sentence": "猶如輪轉，是名為到。",
        "translation": "It's like a wheel turning, which is called arriving.",
        "source": "T12n0374_021:0491c06_3"
    },
    {
        "source_sentence": "聲聞、緣覺及諸菩薩已得永離，故名不到。",
        "translation": "śrāvakas, pratyekbuddhas, and bodhisattvas who have permanently parted with it are therefore called unattainable.",
        "source": "T12n0374_021:0491c06_4"
    },
    {
        "source_sentence": "為欲化度諸眾生故，示現在中，亦名為到。",
        "translation": "In order to save sentient beings, it's also called arriving because it's shown in the present.",
        "source": "T12n0374_021:0491c07_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0491c08_6"
    },
    {
        "source_sentence": "何因緣故名為到到？",
        "translation": "What are the causes and conditions that make it called arriving?",
        "source": "T12n0374_021:0491c08_7"
    },
    {
        "source_sentence": "到者即是二十五有，一切凡夫、須陀洹乃至阿那含，煩惱因緣故，名到到。",
        "translation": "Attaining refers to the twenty-five existences, which are called arriving because of the afflictive causes and conditions of all worldlings, stream entrants, and even non-returners.",
        "source": "T12n0374_021:0491c09_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0491c11_0"
    },
    {
        "source_sentence": "聞所不聞亦復如是，有不聞聞、有不聞不聞、有聞不聞、有聞聞。",
        "translation": "It's likewise with what's heard and not heard, which is heard and not heard, heard and not heard, heard and not heard, heard and not heard, and heard and not heard.",
        "source": "T12n0374_021:0491c11_1"
    },
    {
        "source_sentence": "云何不聞聞？",
        "translation": "How is it not heard?",
        "source": "T12n0374_021:0491c12_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0491c12_3"
    },
    {
        "source_sentence": "不聞者名大涅槃。",
        "translation": "Those who don't hear it are called great nirvāṇa.",
        "source": "T12n0374_021:0491c13_4"
    },
    {
        "source_sentence": "何故不聞？",
        "translation": "Why isn't it heard?",
        "source": "T12n0374_021:0491c13_5"
    },
    {
        "source_sentence": "非有為故、非音聲故、不可說故。",
        "translation": "It's because it's not conditioned, not sound, and ineffable.",
        "source": "T12n0374_021:0491c13_6"
    },
    {
        "source_sentence": "云何亦聞？",
        "translation": "How are they also heard?",
        "source": "T12n0374_021:0491c14_7"
    },
    {
        "source_sentence": "得聞名故，所謂常樂我淨，以是義故，名不聞聞。」",
        "translation": "Because they hear names, they're called permanence, bliss, self, self, and purity, and because of this meaning, they're called not hearing.",
        "source": "T12n0374_021:0491c14_8"
    },
    {
        "source_sentence": "爾時光明遍照高貴德王菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that the Bodhisattva Mahāsattva King of Universal Illumination, the noble king of virtue, said to the Buddha, Bhagavān!",
        "source": "T12n0374_021:0491c15_9"
    },
    {
        "source_sentence": "如佛所說大涅槃者不可得聞，云何復言常樂我淨而可得聞？",
        "translation": "Just as the Buddha teaches that great nirvāṇa cannot be heard, so how could he say that permanence, bliss, self, and purity can be heard?",
        "source": "T12n0374_021:0491c16_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_021:0491c18_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0491c18_12"
    },
    {
        "source_sentence": "斷煩惱者名得涅槃，若未斷者名為不得，以是義故涅槃之性本無今有。",
        "translation": "A person who stops the afflictions is called attaining nirvāṇa, and someone who hasn't stopped them yet is called not attaining them; it's because of this meaning that the nature of nirvāṇa was originally nonexistent",
        "source": "T12n0374_021:0491c18_13"
    },
    {
        "source_sentence": "若世間法本無今有則名無常，譬如瓶等，本無今有，已有還無，故名無常。",
        "translation": "If worldly dharmas were originally nonexistent but now exist, then they're called impermanent, like a pot or so, which was nonexistent in the past but exists now, and which already exists but returns to nonexistence because of being non",
        "source": "T12n0374_021:0491c20_14"
    },
    {
        "source_sentence": "涅槃亦爾，云何說言常樂我淨？",
        "translation": "So it is with nirvāṇa, so how can we say permanence, bliss, self, and purity?",
        "source": "T12n0374_021:0491c21_15"
    },
    {
        "source_sentence": "復次世尊！",
        "translation": "Furthermore, Bhagavān!",
        "source": "T12n0374_021:0491c22_16"
    },
    {
        "source_sentence": "凡因莊嚴而得成者，悉名無常。",
        "translation": "All those who attain it because of adornment are all called impermanent.",
        "source": "T12n0374_021:0491c22_17"
    },
    {
        "source_sentence": "涅槃若爾，應是無常。",
        "translation": "If that were so, nirvana would be impermanent.",
        "source": "T12n0374_021:0491c23_18"
    },
    {
        "source_sentence": "何等因緣？",
        "translation": "What are the causes and conditions?",
        "source": "T12n0374_021:0491c24_19"
    },
    {
        "source_sentence": "所謂三十七品、六波羅蜜、四無量心、觀於骨相阿那波那、六念處、破析六大、如是等法，",
        "translation": "They are the thirty-seven qualities, the six perfections, the four immeasurable states of mind, the contemplation of the characteristics of bones and anāpānas, the six abodes of mindfulness, the refutation of the six",
        "source": "T12n0374_021:0491c24_20"
    },
    {
        "source_sentence": "皆是成就涅槃因緣，故名無常。",
        "translation": "They are all the causes and conditions for accomplishing nirvāṇa, so they're called impermanent.",
        "source": "T12n0374_021:0491c26_21"
    },
    {
        "source_sentence": "復次世尊！",
        "translation": "Furthermore, Bhagavān!",
        "source": "T12n0374_021:0491c27_0"
    },
    {
        "source_sentence": "有名無常。",
        "translation": "There's existence and impermanence.",
        "source": "T12n0374_021:0491c27_1"
    },
    {
        "source_sentence": "若涅槃是有，亦應無常。",
        "translation": "If nirvāṇa were to exist, it would also be impermanent.",
        "source": "T12n0374_021:0491c27_2"
    },
    {
        "source_sentence": "如佛昔於阿含中說，聲聞、緣覺、諸佛世尊皆有涅槃，以是義故名為無常。",
        "translation": "As the Buddha explained in the Āgamas in the past, śrāvakas, pratyekbuddhas, and buddhas and world-honored ones all have nirvāṇa, and it's because of this meaning that they're called impermanent.",
        "source": "T12n0374_021:0491c28_0"
    },
    {
        "source_sentence": "復次世尊！",
        "translation": "Furthermore, Bhagavān!",
        "source": "T12n0374_021:0491c29_1"
    },
    {
        "source_sentence": "可見之法名為無常，如佛先說，見涅槃者則得斷除一切煩惱。",
        "translation": "The dharmas that can be seen are called impermanent, as the Buddha previously explained, and those who see nirvāṇa will then be freed from all afflictions.",
        "source": "T12n0374_021:0491c29_2"
    },
    {
        "source_sentence": "復次世尊！",
        "translation": "Furthermore, Bhagavān!",
        "source": "T12n0374_021:0492a02_3"
    },
    {
        "source_sentence": "譬如虛空，於諸眾生等無障礙，故名為常。",
        "translation": "It's like space, which is unobstructed by sentient beings and so forth, so it's called permanent.",
        "source": "T12n0374_021:0492a02_4"
    },
    {
        "source_sentence": "若使涅槃是常等者，何故眾生有得不得？",
        "translation": "If nirvāṇa were eternal and so forth, why would sentient beings have attained it or not?",
        "source": "T12n0374_021:0492a03_5"
    },
    {
        "source_sentence": "涅槃若爾，於諸眾生不平等者，則不名常。",
        "translation": "If that's the case with nirvāṇa, then it won't be called permanent if it's unequal to sentient beings.",
        "source": "T12n0374_021:0492a04_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0492a05_7"
    },
    {
        "source_sentence": "譬如百人共有一怨，若害此怨，則多人受樂。",
        "translation": "It's like when a hundred people have one enemy together, and if they harm this enemy, many people will experience happiness.",
        "source": "T12n0374_021:0492a05_8"
    },
    {
        "source_sentence": "若使涅槃是平等法，一人得時應多人得，一人斷結應多人亦斷，若不如是，",
        "translation": "If nirvana were to be the law of equality, then when one person attains it, many should attain it. When one person breaks the fetters, many should also break them.",
        "source": "T12n0374_021:0492a06_9"
    },
    {
        "source_sentence": "云何名常？",
        "translation": "What's called permanence?",
        "source": "T12n0374_021:0492a08_10"
    },
    {
        "source_sentence": "譬如有人恭敬、供養、尊重、讚歎國王、王子、父母、師長，則得利養，",
        "translation": "“Furthermore, it is like the case of a man who respects, honors, venerates, and praises kings, princes, parents, teachers, and elders, thereby gaining material support.",
        "source": "T12n0374_021:0492a08_11"
    },
    {
        "source_sentence": "是不名常。",
        "translation": "It's not called eternal.",
        "source": "T12n0374_021:0492a09_12"
    },
    {
        "source_sentence": "涅槃亦爾，不名為常。",
        "translation": "So it is with nirvāṇa, which isn't called permanence.",
        "source": "T12n0374_021:0492a10_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_021:0492a10_14"
    },
    {
        "source_sentence": "如佛昔於阿含經中告阿難言：『若有人能恭敬涅槃，則得斷結，受無量樂。』",
        "translation": "As the Buddha told Ānanda in the Āgamas in the past, 'If someone can venerate nirvāṇa, they'll be able to cut off the bonds and experience measureless happiness.'",
        "source": "T12n0374_021:0492a10_15"
    },
    {
        "source_sentence": "以是義故，不名為常。",
        "translation": "Because of this meaning, it's not called permanent.",
        "source": "T12n0374_021:0492a12_16"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T12n0374_021:0492a12_17"
    },
    {
        "source_sentence": "若涅槃中有常樂我淨名者，不名為常。",
        "translation": "If there's a name for permanence, bliss, self, and purity in nirvāṇa, it's not called permanence.",
        "source": "T12n0374_021:0492a13_18"
    },
    {
        "source_sentence": "如其無者，云何可說？」",
        "translation": "If it doesn't exist, how can it be explained?",
        "source": "T12n0374_021:0492a13_19"
    },
    {
        "source_sentence": "爾時世尊告光明遍照高貴德王菩薩摩訶薩言：「涅槃之體非本無今有，",
        "translation": "It was then that the Bhagavat addressed the bodhisattva mahāsattva King of All-Illumining Universal Illumination, the noble king of virtue, saying: The essence of nirvana is not originally nonexistent but now exists",
        "source": "T12n0374_021:0492a15_0"
    },
    {
        "source_sentence": "若涅槃體本無今有者，則非無漏、常住之法。",
        "translation": "If the essence of nirvāṇa was originally nonexistent but now exists, then it's not an uncontaminated, eternally abiding dharma.",
        "source": "T12n0374_021:0492a16_1"
    },
    {
        "source_sentence": "有佛無佛，性相常住，以諸眾生煩惱覆故，不見涅槃，便謂為無。",
        "translation": "Because sentient beings are covered by afflictions, they don't see nirvāṇa and then say it's nonexistent.",
        "source": "T12n0374_021:0492a17_2"
    },
    {
        "source_sentence": "菩薩摩訶薩以戒、定、慧，勤修其心，斷煩惱已，便得見之。",
        "translation": "Great enlightening beings diligently cultivate their minds with morality, concentration, and wisdom; having cut off afflictions, they are able to see them.",
        "source": "T12n0374_021:0492a19_3"
    },
    {
        "source_sentence": "當知涅槃是常住法，非本無今有，是故為常。",
        "translation": "You should know that nirvāṇa is a permanently abiding dharma, which wasn't originally nonexistent but now exists; therefore, it's permanent.",
        "source": "T12n0374_021:0492a20_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0492a21_5"
    },
    {
        "source_sentence": "如闇室中井，種種七寶，人亦知有，闇故不見。",
        "translation": "It's like a well in a dark room with various seven treasures that people know exist, but they don't see them because of their darkness.",
        "source": "T12n0374_021:0492a21_6"
    },
    {
        "source_sentence": "有智之人，善知方便，然大明燈，持往照了，悉得見之。",
        "translation": "A wise person well knows the skillful means, but a great luminous lamp that shines brightly when held and illuminates it, they'll all see it.",
        "source": "T12n0374_021:0492a22_7"
    },
    {
        "source_sentence": "是人於此終不生念，水及七寶本無今有。",
        "translation": "That person never gives rise to the thought that water and the seven treasures didn't exist in the past but now exist.",
        "source": "T12n0374_021:0492a23_8"
    },
    {
        "source_sentence": "涅槃亦爾，本自有之，非適今也，煩惱闇故，眾生不見。",
        "translation": "So it is with nirvāṇa, which existed in the past and isn't appropriate for the present; because of the darkness of affliction, sentient beings don't see it.",
        "source": "T12n0374_021:0492a24_9"
    },
    {
        "source_sentence": "大智如來以善方便燃智慧燈，令諸菩薩得見涅槃常樂我淨，是故智者於此涅槃，",
        "translation": "The Buddha Mahāprajñāpāramitā Tathāgata uses skillful means to light the lamp of wisdom, enabling bodhisattvas to see that nirvāṇa is always blissful, self-possessed, and pure. Therefore,",
        "source": "T12n0374_021:0492a25_10"
    },
    {
        "source_sentence": "不應說言本無今有。",
        "translation": "It shouldn't be said that it was originally nonexistent and now exists.",
        "source": "T12n0374_021:0492a27_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0492a28_12"
    },
    {
        "source_sentence": "汝言因莊嚴故得成涅槃應無常者，是亦不然。",
        "translation": "You say that nirvāṇa should be impermanent because of its adornment, but this is also not the case.",
        "source": "T12n0374_021:0492a28_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_021:0492a29_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0492a29_15"
    },
    {
        "source_sentence": "涅槃之體，非生非出、非實非虛、非作業生、非是有漏有為之法、非聞非見、非墮非死、非別異相、亦非同相、非往非還、非去來今、非一非多、非長非短、非圓非方、非尖非斜、非有相非無相、非名非色、非因非果、非我我所，",
        "translation": "The essence of nirvāṇa is neither arising nor emerging, neither real nor false, not produced by action, not contaminated or conditioned dharmas, neither hearing nor seeing, neither falling nor dying, neither distinct nor di",
        "source": "T12n0374_021:0492a29_16"
    },
    {
        "source_sentence": "以是義故，涅槃是常，恒不變易，是以無量阿僧祇劫修集善法，以自莊嚴，",
        "translation": "Because of this meaning, nirvana is permanent, constant, unchanging. That is why they cultivate and accumulate wholesome states for immeasurable aeons in order to adorn themselves.",
        "source": "T12n0374_021:0492b05_17"
    },
    {
        "source_sentence": "然後乃見。",
        "translation": "Then they'll see it.",
        "source": "T12n0374_021:0492b07_18"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0492b07_19"
    },
    {
        "source_sentence": "譬如地下有八味水，一切眾生而不能得，有智之人施功穿掘，則便得之；",
        "translation": "It is as if there were water with eight different flavors underground that all living beings could not obtain. A wise man, by bestowing merit on someone who digs up the water, would be able to obtain it.",
        "source": "T12n0374_021:0492b07_20"
    },
    {
        "source_sentence": "涅槃亦爾。",
        "translation": "So it is with nirvāṇa.",
        "source": "T12n0374_021:0492b09_21"
    },
    {
        "source_sentence": "譬如盲人不見日月，良醫療之則便得見，而是日月非是本無今有；",
        "translation": "It is like the case of a blind man who does not see the sun and moon. A good physician will then be able to see him. Rather, the sun and moon are not originally nonexistent but exist now.",
        "source": "T12n0374_021:0492b09_22"
    },
    {
        "source_sentence": "涅槃亦爾，先自有之非適今也。",
        "translation": "So it is with nirvāṇa, which existed in the past but isn't appropriate for the present.",
        "source": "T12n0374_021:0492b11_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0492b11_1"
    },
    {
        "source_sentence": "如人有罪，繫之囹圄，久乃得出，還家得見父母兄弟、妻子眷屬；",
        "translation": "Good man, it is like someone guilty of a crime who has been imprisoned for a long time and then released. Having returned home, they may see their parents, brothers, wife, children, and other members of their family.",
        "source": "T12n0374_021:0492b11_2"
    },
    {
        "source_sentence": "涅槃亦爾。",
        "translation": "So it is with nirvāṇa.",
        "source": "T12n0374_021:0492b13_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0492b13_4"
    },
    {
        "source_sentence": "汝言因緣故，涅槃之法應無常者，是亦不然。",
        "translation": "You say that the dharma of nirvāṇa should be impermanent because of causes and conditions, but this is also not the case.",
        "source": "T12n0374_021:0492b13_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T12n0374_021:0492b14_6"
    },
    {
        "source_sentence": "善男子，因有五種。",
        "translation": "Good man, there are five kinds of causes:",
        "source": "T12n0374_021:0492b14_7"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T12n0374_021:0492b15_8"
    },
    {
        "source_sentence": "一者生因，二者和合因，三者住因，四者增長因，五者遠因。",
        "translation": "One is the cause of arising, two are the cause of conjunction, three are the cause of abiding, four are the cause of growth, and five are the cause of distancing.",
        "source": "T12n0374_021:0492b15_9"
    },
    {
        "source_sentence": "云何生因？",
        "translation": "What is the arising cause?",
        "source": "T12n0374_021:0492b16_10"
    },
    {
        "source_sentence": "生因者即是業煩惱等，及外諸草木子，是名生因。",
        "translation": "The producing cause is action, defilement, etc., and the external grass and trees are called the producing cause.",
        "source": "T12n0374_021:0492b17_11"
    },
    {
        "source_sentence": "云何和合因？",
        "translation": "What is the combined cause?",
        "source": "T12n0374_021:0492b18_12"
    },
    {
        "source_sentence": "如善與善心和合，不善與不善心和合，無記與無記心和合，是名和合因。",
        "translation": "Good is combined with good awarenesses; bad and bad awarenesses are combined; neutral and neutral awarenesses are combined. This is the name of the combined cause.",
        "source": "T12n0374_021:0492b18_13"
    },
    {
        "source_sentence": "云何住因？",
        "translation": "What's the abiding cause?",
        "source": "T12n0374_021:0492b20_14"
    },
    {
        "source_sentence": "如下有柱，屋則不墮；",
        "translation": "If there is a pillar below it, the house will not fall down.",
        "source": "T12n0374_021:0492b20_15"
    },
    {
        "source_sentence": "山河樹木，因大地故而得住立；",
        "translation": "Mountains, rivers, and trees are established by reason of the earth.",
        "source": "T12n0374_021:0492b20_16"
    },
    {
        "source_sentence": "內有四大、無量煩惱，眾生得住；",
        "translation": "Within them there are the four elements of great defilement and immeasurable defilement, which sentient beings can abide by.",
        "source": "T12n0374_021:0492b21_17"
    },
    {
        "source_sentence": "是名住因。",
        "translation": "This is called the abiding cause.",
        "source": "T12n0374_021:0492b22_18"
    },
    {
        "source_sentence": "云何增長因？",
        "translation": "What are the causes of growth?",
        "source": "T12n0374_021:0492b22_19"
    },
    {
        "source_sentence": "因緣衣服飲食等故，令眾生增長；",
        "translation": "They cause sentient beings to grow by means of such causes and conditions as clothing, food, drink, and so forth.",
        "source": "T12n0374_021:0492b22_20"
    },
    {
        "source_sentence": "如外種子，火所不燒，鳥所不食，則得增長；",
        "translation": "Just as external seeds can grow without being burned by fire and without being eaten by birds.",
        "source": "T12n0374_021:0492b23_21"
    },
    {
        "source_sentence": "如諸沙門、婆羅門等，依因和上、善知識等而得增長；",
        "translation": "“Good son, it is like the case of those śramaṇas and brāhmaṇas who rely upon causal concomitance, such as superiors or good friends, to attain enlightenment.",
        "source": "T12n0374_021:0492b24_22"
    },
    {
        "source_sentence": "如因父母，子得增長；",
        "translation": "It is as if a child were to grow by reason of his parents.",
        "source": "T12n0374_021:0492b25_23"
    },
    {
        "source_sentence": "是名增長因。",
        "translation": "This is called a growing cause.",
        "source": "T12n0374_021:0492b26_24"
    },
    {
        "source_sentence": "云何遠因？",
        "translation": "What's the distant cause?",
        "source": "T12n0374_021:0492b26_25"
    },
    {
        "source_sentence": "譬如因呪，鬼不能害，毒不能中；",
        "translation": "It is like a magic spell that cannot be harmed by ghosts and cannot be stung by poison.",
        "source": "T12n0374_021:0492b26_26"
    },
    {
        "source_sentence": "依憑國王，無有盜賊；",
        "translation": "They rely on the kings of their countries and have no thieves or robbers.",
        "source": "T12n0374_021:0492b27_27"
    },
    {
        "source_sentence": "如芽依因地、水、火、風等；",
        "translation": "It is like a sprout that depends on the earth, water, fire, wind, etc.",
        "source": "T12n0374_021:0492b27_28"
    },
    {
        "source_sentence": "如水攢及人，為蘇遠因；",
        "translation": "For example, water and man are the distant causes of sorrow.",
        "source": "T12n0374_021:0492b28_29"
    },
    {
        "source_sentence": "如明色等，為識遠因；",
        "translation": "They are the distant causes of consciousness, just as visible matter is the distant cause of sound.",
        "source": "T12n0374_021:0492b29_0"
    },
    {
        "source_sentence": "父母精血，為眾生遠因；",
        "translation": "Parental semen and blood are the distant causes of sentient beings.",
        "source": "T12n0374_021:0492b29_1"
    },
    {
        "source_sentence": "如時節等悉名遠因。",
        "translation": "They're all called distant causes like seasons and so forth.",
        "source": "T12n0374_021:0492c01_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0492c01_1"
    },
    {
        "source_sentence": "涅槃之體非是如是五因所成，云何當言是無常因？",
        "translation": "The essence of nirvāṇa isn't thus formed by these five causes, so how could it be said to be an impermanent cause?",
        "source": "T12n0374_021:0492c01_2"
    },
    {
        "source_sentence": "「復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T12n0374_021:0492c02_3"
    },
    {
        "source_sentence": "復有二因：一者作因，二者了因。",
        "translation": "Again, there are two kinds of causes: first, the efficient cause; second, the perception cause.",
        "source": "T12n0374_021:0492c03_4"
    },
    {
        "source_sentence": "如陶師輪繩，是名作因。",
        "translation": "It's like the potter's wheel rope, which is called a producing cause.",
        "source": "T12n0374_021:0492c03_5"
    },
    {
        "source_sentence": "如燈燭等照闇中物，是名了因。",
        "translation": "It's like a candle or so forth that illuminates things in the darkness, which are called the comprehending cause.",
        "source": "T12n0374_021:0492c04_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0492c05_7"
    },
    {
        "source_sentence": "大涅槃者，不從作因而有，唯有了因。",
        "translation": "A great nirvāṇa doesn't arise from action, but only from an understanding of the cause.",
        "source": "T12n0374_021:0492c05_8"
    },
    {
        "source_sentence": "了因者，所謂三十七助道法、六波羅蜜，是名了因。",
        "translation": "Understanding causes are the so-called thirty-seven factors that aid in the path and the six perfections, which are called understanding causes.",
        "source": "T12n0374_021:0492c06_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0492c07_10"
    },
    {
        "source_sentence": "布施者是涅槃因，非大涅槃因，檀波羅蜜乃得名為大涅槃因。",
        "translation": "Giving is the cause of nirvāṇa and not the cause of great nirvāṇa, but the perfection of giving can be called the cause of great nirvāṇa.",
        "source": "T12n0374_021:0492c07_11"
    },
    {
        "source_sentence": "三十七品是涅槃因，非大涅槃因，無量阿僧祇助菩提法，乃得名為大涅槃因。」",
        "translation": "The thirty-seven factors are the cause of nirvāṇa, not the cause of great nirvāṇa, and measureless and incalculable numbers of factors that aid in enlightenment can be called the cause of great nirvāṇa.",
        "source": "T12n0374_021:0492c08_12"
    },
    {
        "source_sentence": "◎◎爾時光明遍照高貴德王菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that the Bodhisattva Mahāsattva King of Universal Illumination, the noble king of virtue, said to the Buddha, Bhagavān!",
        "source": "T12n0374_021:0492c10_13"
    },
    {
        "source_sentence": "云何布施不得名為檀波羅蜜？",
        "translation": "How can generosity not be called the perfection of giving?",
        "source": "T12n0374_021:0492c12_14"
    },
    {
        "source_sentence": "云何布施而得名之檀波羅蜜？",
        "translation": "What is the name of the perfection of giving that's attained?",
        "source": "T12n0374_021:0492c12_15"
    },
    {
        "source_sentence": "乃至般若云何不得名為般若波羅蜜？",
        "translation": "How can it even be called prajñā-pāramitā if it's prajñā?",
        "source": "T12n0374_021:0492c13_16"
    },
    {
        "source_sentence": "云何得名為般若波羅蜜？",
        "translation": "How can it be called prajñā-pāramitā?",
        "source": "T12n0374_021:0492c14_17"
    },
    {
        "source_sentence": "云何名涅槃？",
        "translation": "What's called nirvāṇa?",
        "source": "T12n0374_021:0492c15_18"
    },
    {
        "source_sentence": "云何名大涅槃？」",
        "translation": "What is called great nirvāṇa?",
        "source": "T12n0374_021:0492c15_19"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T12n0374_021:0492c16_0"
    },
    {
        "source_sentence": "菩薩摩訶薩修行方等大般涅槃，不聞布施，不見布施，不聞檀波羅蜜，",
        "translation": "“When great enlightening beings cultivate the practice of liberation, they don’t hear generosity, don’t see generosity, and don’t hear the transcendent giving of giving.",
        "source": "T12n0374_021:0492c16_1"
    },
    {
        "source_sentence": "不見檀波羅蜜，乃至不聞般若，不見般若，不聞般若波羅蜜，不見般若波羅蜜，",
        "translation": "He doesn't see the perfection of giving, doesn't hear the perfection of prajñā and doesn't see the perfection of prajñā, doesn't hear the perfection of prajñā and doesn't see the perfection of prajñā",
        "source": "T12n0374_021:0492c17_2"
    },
    {
        "source_sentence": "不聞涅槃，不見涅槃，不聞大涅槃，不見大涅槃。",
        "translation": "They don't hear nirvāṇa and don't see nirvāṇa, and they don't hear great nirvāṇa and don't see great nirvāṇa.",
        "source": "T12n0374_021:0492c19_3"
    },
    {
        "source_sentence": "菩薩摩訶薩修大涅槃，知見法界，解了實相空無所有，無有和合覺知之相，",
        "translation": "“Great enlightening beings cultivate great nirvana, knowing and seeing the realm of reality, comprehending that true characteristics are void, have no existence, lack unity, and perceive characteristics.",
        "source": "T12n0374_021:0492c20_4"
    },
    {
        "source_sentence": "得無漏相、無所作相、如幻化相、熱時炎相、乾闥婆城、虛空之相。",
        "translation": "They attain uncontaminated characteristics, unmanifest characteristics, illusory characteristics, characteristics that are like illusions, characteristics that are hot when it's hot, characteristics of the city of Gandhāra",
        "source": "T12n0374_021:0492c22_5"
    },
    {
        "source_sentence": "菩薩爾時得如是相，無貪恚癡，不聞不見，是名菩薩摩訶薩真實之相、安住實相。",
        "translation": "At that point, the bodhisattva attains such characteristics without craving, ill-will, or delusion and doesn't hear or see them, which is called the true characteristics of the bodhisattva Mahāsattva and the",
        "source": "T12n0374_021:0492c23_6"
    },
    {
        "source_sentence": "菩薩摩訶薩自知此是檀，此是檀波羅蜜，乃至此是般若，此是般若波羅蜜，",
        "translation": "The bodhisattva Mahāsattva knows for himself that this is sandalwood, which is the perfection of giving, up to this is prajñā, which is the perfection of wisdom.",
        "source": "T12n0374_021:0492c25_7"
    },
    {
        "source_sentence": "此是涅槃，此是大涅槃。",
        "translation": "This is nirvāṇa, and this is great nirvāṇa.",
        "source": "T12n0374_021:0492c27_8"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0492c28_0"
    },
    {
        "source_sentence": "云何是施，非波羅蜜？",
        "translation": "What's generosity that's not the perfection?",
        "source": "T12n0374_021:0492c28_1"
    },
    {
        "source_sentence": "見有乞者，然後乃與，是名為施，非波羅蜜。",
        "translation": "To see a beggar and then give it to him is called giving, not the pāramitā.",
        "source": "T12n0374_021:0492c28_2"
    },
    {
        "source_sentence": "若無乞者，開心自施，是則名為檀波羅蜜。",
        "translation": "If someone doesn't beg and gives it to themselves, this is called the perfection of giving.",
        "source": "T12n0374_021:0492c29_3"
    },
    {
        "source_sentence": "若時時施，是名為施，非波羅蜜。",
        "translation": "If someone gives from time to time, this is called giving, not the pāramitā.",
        "source": "T12n0374_021:0493a01_4"
    },
    {
        "source_sentence": "若修常施，是則名為檀波羅蜜。",
        "translation": "If someone cultivates constant giving, this is called the perfection of giving.",
        "source": "T12n0374_021:0493a02_5"
    },
    {
        "source_sentence": "若施他已，還生悔心，是名為施，非波羅蜜。",
        "translation": "If someone gives to others and then returns with regret, this is called giving, not the pāramitā.",
        "source": "T12n0374_021:0493a02_6"
    },
    {
        "source_sentence": "施已不悔，是則名為檀波羅蜜。",
        "translation": "After giving it, he doesn't repent, which is called the perfection of giving.",
        "source": "T12n0374_021:0493a03_7"
    },
    {
        "source_sentence": "菩薩摩訶薩於財物中生四怖心，王、賊、水、火，歡喜施與，是則名為檀波羅蜜。",
        "translation": "When a bodhisattva-mahāsattva becomes frightened by the four fears about possessions and rejoices in giving them to kings, thieves, water, and fire, this is called the perfection of giving.",
        "source": "T12n0374_021:0493a04_8"
    },
    {
        "source_sentence": "若望報施，是名為施，非波羅蜜。",
        "translation": "If someone expects to receive a reward for giving, this is called giving, not the pāramitā.",
        "source": "T12n0374_021:0493a06_9"
    },
    {
        "source_sentence": "施不望報，是則名為檀波羅蜜。",
        "translation": "Giving without expecting reward is called the perfection of giving.",
        "source": "T12n0374_021:0493a07_0"
    },
    {
        "source_sentence": "若為恐怖、名聞、利養、家法相續、天上五欲，為憍慢故、為勝他故、為知識故、為來報故，",
        "translation": "Because of fear, because of fame and learning, because of gain, because of the continuance of the doctrine of the house, because of the five higher realms of sexual passion in heaven, because of arrogance, because of overpowering others, because of knowledge",
        "source": "T12n0374_021:0493a07_1"
    },
    {
        "source_sentence": "如市易法。",
        "translation": "It's like the market-easing dharma.",
        "source": "T12n0374_021:0493a09_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0493a09_3"
    },
    {
        "source_sentence": "如人種樹，為得蔭涼，為得花果及以材木。",
        "translation": "It's like when a person plants a tree to get shade, flowers, fruits, and lumber for the sake of coolness.",
        "source": "T12n0374_021:0493a10_4"
    },
    {
        "source_sentence": "若人修行如是等施，是名為施，非波羅蜜。",
        "translation": "If someone cultivates such kinds of giving, this is called giving, not the perfection.",
        "source": "T12n0374_021:0493a11_5"
    },
    {
        "source_sentence": "菩薩摩訶薩修行如是大涅槃者，不見施者、受者、財物，不見時節、不見福田及非福田，",
        "translation": "“When great enlightening beings practice this kind of great nirvana, they don’t see donors, recipients, or property; they don’t see seasons, and they don’t see fields of merit or non-fields of merit.",
        "source": "T12n0374_021:0493a12_0"
    },
    {
        "source_sentence": "不見因、不見緣、不見果報，不見作者、不見受者、不見多、不見少、不見淨、不見不淨，",
        "translation": "They don’t see causes, don’t see conditions, and don’t see results; they don’t see authors, don’t see recipients, don’t see many, don’t see few, don’t see pure, and don’t",
        "source": "T12n0374_021:0493a13_1"
    },
    {
        "source_sentence": "不輕受者、己身、財物，不見見者、不見不見者，不計己、他，唯為方等大般涅槃常住法故修行布施，",
        "translation": "Those who don’t despise what they receive, their own bodies and possessions, don’t see what they don’t see, don’t think of themselves or others, and practice generosity only for the sake of the eternally abiding principle of",
        "source": "T12n0374_021:0493a15_2"
    },
    {
        "source_sentence": "為利一切諸眾生故而行布施，為斷一切眾生煩惱故行於施，為諸眾生不見受者施者財物故行於施。",
        "translation": "It's for the sake of benefiting all sentient beings that they practice generosity, for the sake of ending the afflictions of all sentient beings that they practice generosity, and for the sake of the property of those sentient beings who don'",
        "source": "T12n0374_021:0493a17_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0493a20_4"
    },
    {
        "source_sentence": "譬如有人，墮大海水，抱持死屍，則得度脫；",
        "translation": "Good man, this is analogous to someone who falls into the great ocean and carries a dead corpse in his arms.",
        "source": "T12n0374_021:0493a20_5"
    },
    {
        "source_sentence": "菩薩摩訶薩修大涅槃行布施時，亦復如是，如彼死屍。",
        "translation": "It's likewise when bodhisattvas, mahāsattvas, cultivate great nirvāṇa and practice generosity, just like that dead corpse.",
        "source": "T12n0374_021:0493a21_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0493a22_7"
    },
    {
        "source_sentence": "譬如有人，閉在深獄，門戶堅牢，唯有廁孔，便從中出到無礙處；",
        "translation": "Good man, this is analogous to someone who is locked up in a deep hell whose doors and windows are firmly fastened. There is only a latrine that leads them out through which to reach an unobstructed place.",
        "source": "T12n0374_021:0493a22_8"
    },
    {
        "source_sentence": "菩薩摩訶薩修大涅槃行布施時，亦復如是。",
        "translation": "It's likewise when bodhisattvas, mahāsattvas, cultivate great nirvāṇa and practice generosity.",
        "source": "T12n0374_021:0493a24_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0493a25_10"
    },
    {
        "source_sentence": "譬如貴人恐怖急厄，更無恃怙，依旃陀羅；",
        "translation": "Good man, this is analogous to a noble person who fears an impending danger and does not rely on the caṇḍāla for help.",
        "source": "T12n0374_021:0493a25_11"
    },
    {
        "source_sentence": "菩薩摩訶薩修大涅槃，行於布施亦復如是。",
        "translation": "So it is with the bodhisattva Mahāsattva who cultivates great nirvāṇa and practices generosity.",
        "source": "T12n0374_021:0493a26_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0493a27_13"
    },
    {
        "source_sentence": "譬如病人為除病苦得安樂故服食不淨；",
        "translation": "“Good man, it is analogous to a sick man who eats impure food in order to remove the pain of illness and attain well-being.",
        "source": "T12n0374_021:0493a27_14"
    },
    {
        "source_sentence": "菩薩摩訶薩修大涅槃行於布施亦復如是。",
        "translation": "So it is with the bodhisattva Mahāsattva who cultivates great nirvāṇa and practices generosity.",
        "source": "T12n0374_021:0493a28_15"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0493a29_16"
    },
    {
        "source_sentence": "如婆羅門值穀勇貴，為壽命故食噉狗肉；",
        "translation": "It is as if a brave brahman were to find grain and eat the flesh of a hog or dog for the sake of longevity.",
        "source": "T12n0374_021:0493a29_17"
    },
    {
        "source_sentence": "菩薩摩訶薩修大涅槃行於布施亦復如是。",
        "translation": "So it is with the bodhisattva Mahāsattva who cultivates great nirvāṇa and practices generosity.",
        "source": "T12n0374_021:0493b01_18"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T12n0374_021:0493b02_19"
    },
    {
        "source_sentence": "大涅槃中如是之事，從無量劫來不聞而聞，尸羅、尸羅波羅蜜，乃至般若、般若波羅蜜，",
        "translation": "Such things as these in the great nirvāṇa have been heard but not heard for measureless eons, śīla and śīla-pāramitā, up to prajñā and prajñā-pāramitā.",
        "source": "T12n0374_021:0493b02_20"
    },
    {
        "source_sentence": "如佛雜花經中廣說。",
        "translation": "It's as explained in detail in the Buddha's Miscellaneous Flower Scripture.",
        "source": "T12n0374_021:0493b04_21"
    },
    {
        "source_sentence": "◎大般涅槃經卷第二十一",
        "translation": "*Mahāparinirvāṇa-sūtra, Volume 21",
        "source": "T12n0374_021:0493b05_22"
    }
]