[
    {
        "source_sentence": "大方等大集經卷第二十二",
        "translation": "*Mahāmegha-sūtra, Volume 22",
        "source": "T13n0397_022:0154a12_0"
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Northern Liang Tianzhushu Sanzang translated by Dharmakṣema",
        "source": "T13n0397_022:0154a14_0"
    },
    {
        "source_sentence": "虛空目分第十之一初聲聞品第一",
        "translation": "The First Chapter of the Eleventh Part of the Eye of Space",
        "source": "T13n0397_022:0154a15_0"
    },
    {
        "source_sentence": "爾時，世尊故在欲色二界中間大寶坊中，與無量比丘僧諸大菩薩，圍遶說法。",
        "translation": "At the time, the Bhagavān was therefore in a great jeweled hall between the two realms of desire and form, surrounded by measureless monks, saṃgha, and great bodhisattvas who taught the Dharma.",
        "source": "T13n0397_022:0154a16_0"
    },
    {
        "source_sentence": "時舍利弗、目揵連等，出家未久，以舍利弗、目連因緣，說聲聞法雜四真諦。",
        "translation": "Not long after Śāriputra and Maudgalyāyana had renounced the householder’s life, for this reason they taught the śrāvaka doctrine that it is a combination of the four noble truths.",
        "source": "T13n0397_022:0154a17_1"
    },
    {
        "source_sentence": "爾時，眾中有諸人輩，本是外道，諸根闇鈍自謂有智，起大憍慢，增長色慢、欲慢、無明慢、勝慢、非法慢，",
        "translation": "At the time, there were some people in the assembly who were originally non-Buddhist. Their faculties were dark and dull and said to themselves, “I am wise.” They became greatly arrogant and grew conceited of form",
        "source": "T13n0397_022:0154a19_2"
    },
    {
        "source_sentence": "未得第二第三第四沙門果證。",
        "translation": "They haven't yet attained the second, third, and fourth ascetic realizations.",
        "source": "T13n0397_022:0154a21_3"
    },
    {
        "source_sentence": "是故如來為如是等，宣說中道，為離如是惡煩惱故。",
        "translation": "Therefore, the Tathāgata proclaims the middle way for such and such reasons in order to be free of such bad afflictions.",
        "source": "T13n0397_022:0154a22_4"
    },
    {
        "source_sentence": "如來說是中道義時，如是諸人各各論說斷見、我見。",
        "translation": "When the Tathāgata explains this meaning of the middle way, each of these people discusses and explains the view of nihilism and the view of self.",
        "source": "T13n0397_022:0154a23_5"
    },
    {
        "source_sentence": "爾時，世尊即作是念：「哀哉！",
        "translation": "At that point, the Bhagavān then had this thought, Alas!",
        "source": "T13n0397_022:0154a24_6"
    },
    {
        "source_sentence": "諸人本外道故，雖入佛法猶生大慢，於未得中而生得想，於未知中而生知想，",
        "translation": "People, originally non-Buddhist, though entering the buddha-dharma, still have great conceit. They give rise to perceptions of attainment when they haven’t yet attained it, and they give rise to perceptions of knowing",
        "source": "T13n0397_022:0154a25_7"
    },
    {
        "source_sentence": "於如來法中而不修行。",
        "translation": "They don't cultivate it in the Tathāgata's teaching.",
        "source": "T13n0397_022:0154a27_8"
    },
    {
        "source_sentence": "雖順四諦，而不能得四無礙智，乃至不得第四果證。」",
        "translation": "Even though they follow the four noble truths, they can't attain the four kinds of unhindered cognition or even realize the fourth realization.",
        "source": "T13n0397_022:0154a27_9"
    },
    {
        "source_sentence": "爾時，世尊二手舉捉瞻婆華鬘，發大誓願，以願力故，於華鬘中出生四寶：一、帝釋寶；",
        "translation": "At that time the World-honored One, holding the flower garland of campaka in his hand, made a great vow:",
        "source": "T13n0397_022:0154a28_10"
    },
    {
        "source_sentence": "二、天光寶；",
        "translation": "The second was the treasure of celestial light.",
        "source": "T13n0397_022:0154b01_11"
    },
    {
        "source_sentence": "三、金剛光寶；",
        "translation": "The third treasure is the diamond-like jewel of adamantine light.",
        "source": "T13n0397_022:0154b02_12"
    },
    {
        "source_sentence": "四、勝諸光寶。",
        "translation": "4. superior to the luminous treasures.",
        "source": "T13n0397_022:0154b02_13"
    },
    {
        "source_sentence": "一一寶中出大光明，遍照此間娑婆世界，光明出已擲之虛空。",
        "translation": "In each jewel a great ray of light emerges, illuminating all the worlds here and there in the sahā worlds; after emitting this ray of light, they toss it into the sky.",
        "source": "T13n0397_022:0154b02_14"
    },
    {
        "source_sentence": "「雖除鬚髮不去結，　　被服染衣不離染，",
        "translation": "“Even if one removes the hair on his beard and doesn’t form a knot, If he wears dyed clothes that aren’t dyed,",
        "source": "T13n0397_022:0154b04_15"
    },
    {
        "source_sentence": "　示佛為師不隨教，　　如是之人污大眾。",
        "translation": "Showing the Buddha to be a teacher and not following his teachings, such people defile the masses.",
        "source": "T13n0397_022:0154b04_15"
    },
    {
        "source_sentence": "　如來宣說正法時，　　而復不能至心聽，",
        "translation": "When the Enlightened One expounds the Teaching, They cannot even listen attentively.",
        "source": "T13n0397_022:0154b04_15"
    },
    {
        "source_sentence": "　是人不得真實義，　　亦不能離諸煩惱。",
        "translation": "That person doesn't attain true meaning, and they can't be free of the afflictions.",
        "source": "T13n0397_022:0154b04_15"
    },
    {
        "source_sentence": "　若能覩見實法性，　　是能破壞無明慢；",
        "translation": "If one can coarsely see the true essence of things, One can destroy ignorance and conceit.",
        "source": "T13n0397_022:0154b04_15"
    },
    {
        "source_sentence": "　若有親近善知識，　　是人速得甘露味；",
        "translation": "If one becomes intimate with spiritual benefactors, One will quickly attain the taste of immortality.",
        "source": "T13n0397_022:0154b04_15"
    },
    {
        "source_sentence": "　若能呵責於生死，　　是則能得到彼岸；",
        "translation": "If one can criticize birth and death, Then one can reach the other shore.",
        "source": "T13n0397_022:0154b04_15"
    },
    {
        "source_sentence": "　是人具足戒多聞，　　亦具禪定智慧聚。",
        "translation": "That person is endowed with the precepts and well-versed, and he's also endowed with the store of meditation and wisdom.",
        "source": "T13n0397_022:0154b04_15"
    },
    {
        "source_sentence": "　若人欲壞煩惱魔，　　遠離陰魔及死魔，",
        "translation": "If someone wants to destroy the demon of affliction, they're far removed from the demon of aggregates and the demon of death.",
        "source": "T13n0397_022:0154b04_15"
    },
    {
        "source_sentence": "　摧伏天魔諸眷屬，　　常當親近無上尊。」",
        "translation": "To subdue the retinues of gods and Māra, they'll always become intimate with the unsurpassed honored one.",
        "source": "T13n0397_022:0154b04_15"
    },
    {
        "source_sentence": "時華鬘中說是偈言：說是偈已，聲聞弟子有憍慢者，咸作是念：「如來知我並有污心，",
        "translation": "Having uttered these verses, the śrāvaka disciples with arrogance thought: The Tathāgata knows that all of us have defiled minds.",
        "source": "T13n0397_022:0154b04_15"
    },
    {
        "source_sentence": "是故為我說如是偈。」",
        "translation": "That's why I spoke such a verse for you.",
        "source": "T13n0397_022:0154b16_16"
    },
    {
        "source_sentence": "即時心中生大慚愧；",
        "translation": "Immediately great shame arose in their minds.",
        "source": "T13n0397_022:0154b16_17"
    },
    {
        "source_sentence": "及四天下佛諸弟子，亦復如是生慚愧心，於一念頃悉來集會。",
        "translation": "And so did the disciples of the Buddhas of the four continents, all with shame and a sense of shame. In an instant they all came to this assembly.",
        "source": "T13n0397_022:0154b17_18"
    },
    {
        "source_sentence": "爾時，無量百千萬億聲聞大眾悉來聚集。",
        "translation": "At the time, measureless hundreds of thousands of myriads of koṭis of śrāvakas gathered together.",
        "source": "T13n0397_022:0154b18_19"
    },
    {
        "source_sentence": "於是佛知眾會已定，即為宣說雜四真諦。",
        "translation": "Knowing that the assembly had been fixed, the Buddha then taught the four mixed true truths for them.",
        "source": "T13n0397_022:0154b19_20"
    },
    {
        "source_sentence": "時此寶鬘直往南方，過九萬二千恒河沙等諸佛世界，彼有世界名金剛光藏，",
        "translation": "To the south, to the southeast of this jeweled pillar, beyond as many buddha-worlds as there are sands in ninety-two thousand Ganges Rivers, is a world called Diamond Matrix Treasury.",
        "source": "T13n0397_022:0154b20_21"
    },
    {
        "source_sentence": "其土眾生具足五滓。",
        "translation": "The sentient beings in that land are fully endowed with the five dregs.",
        "source": "T13n0397_022:0154b22_22"
    },
    {
        "source_sentence": "有佛、世尊，號金剛光明功德如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "There was a buddha, a world-honored one, called the Tathāgata Vajrapradīpagongde gongde (“Tathāgata of Diamond Light”), Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct, Well-go",
        "source": "T13n0397_022:0154b22_23"
    },
    {
        "source_sentence": "亦為四眾宣說如是雜四真諦法。",
        "translation": "He also explains to the fourfold assembly this mixed teaching of the four true truths.",
        "source": "T13n0397_022:0154b25_24"
    },
    {
        "source_sentence": "而彼會中有諸菩薩、聲聞四眾：比丘、比丘尼、優婆塞、優婆夷，見是寶鬘大光明已，",
        "translation": "At that assembly, there were bodhisattvas and śrāvakas in the fourfold assembly: monks, nuns, laymen, and laymen. Seeing this great ray of light emanating from the jeweled silhouet",
        "source": "T13n0397_022:0154b25_25"
    },
    {
        "source_sentence": "觀察四方。",
        "translation": "He observes the four directions.",
        "source": "T13n0397_022:0154b27_26"
    },
    {
        "source_sentence": "仰見寶鬘在佛頂上虛空中住，即白佛言：「世尊！",
        "translation": "When he saw the jeweled garland in the sky above the Buddha's head, he said to the Buddha, Bhagavān!",
        "source": "T13n0397_022:0154b27_27"
    },
    {
        "source_sentence": "如是寶鬘從何處來？",
        "translation": "Where did this treasure garland come from?",
        "source": "T13n0397_022:0154b29_0"
    },
    {
        "source_sentence": "誰之所遣？」",
        "translation": "Who sent it?",
        "source": "T13n0397_022:0154b29_1"
    },
    {
        "source_sentence": "彼佛答曰：「善男子！",
        "translation": "The Buddha answered, Good man!",
        "source": "T13n0397_022:0154b29_2"
    },
    {
        "source_sentence": "北方去此，九萬二千恒河沙等諸佛世界，彼有世界名曰娑婆。",
        "translation": "To the north of here, there are ninety-thousand two thousand worlds equal in number to the sands of the Ganges River and other buddha worlds. There is a world called Sahā.",
        "source": "T13n0397_022:0154c01_3"
    },
    {
        "source_sentence": "有佛、世尊，號釋迦牟尼如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "There was a buddha, a world-honored one, named Śākyamuni the Tathāgata, Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Unsurpassed",
        "source": "T13n0397_022:0154c02_4"
    },
    {
        "source_sentence": "亦為具足五滓眾生宣說開示雜四諦法，如我今於此土無異。",
        "translation": "He also taught and revealed the teachings of the four composite truths to sentient beings endowed with the five defilements, just as I now do in this land.",
        "source": "T13n0397_022:0154c04_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_022:0154c06_6"
    },
    {
        "source_sentence": "彼佛世界所有眾生，甚大癡闇麁獷輕躁，生大憍慢多作惡業難調難解，",
        "translation": "All the sentient beings in those buddha-worlds were greatly deluded, dark, coarse, and impetuous, producing great arrogance. They often did evil deeds that were difficult to control and difficult to understand.",
        "source": "T13n0397_022:0154c06_7"
    },
    {
        "source_sentence": "是故釋迦牟尼如來為此大集，於大集中演說正法，為壞如是諸大惡事。",
        "translation": "That's why the Tathāgata Śākyamuni explains the right teaching in this great assembly for the sake of this great assembly and explains the right teaching in the great assembly in order to destroy these kinds of great bad things.",
        "source": "T13n0397_022:0154c07_8"
    },
    {
        "source_sentence": "彼世界中所有眾生，於未得中而作得想，於未證中而作證想，於未修中而作修想。",
        "translation": "All the sentient beings in those worlds think of attaining what they haven't attained, realize what they haven't realized, and cultivate what they haven't cultivated.",
        "source": "T13n0397_022:0154c09_9"
    },
    {
        "source_sentence": "是故彼佛為大眾說法，如法修行，為壞如是大憍慢故，為得盡智及無生智，",
        "translation": "That is why that buddha teaches the Dharma to the masses and practices it according to the Dharma. In order to dispel such great arrogance, he attains knowledge of destruction and knowledge of nonorigination.",
        "source": "T13n0397_022:0154c11_10"
    },
    {
        "source_sentence": "將欲宣說虛空目法行。",
        "translation": "He's about to explain the practice of the teaching of the eye of space.",
        "source": "T13n0397_022:0154c13_11"
    },
    {
        "source_sentence": "為得聲聞緣覺佛果，欲開如來無上法藏。",
        "translation": "In order to attain the buddhahood of śrāvakas and pratyekbuddhas, they want to open the Tathāgata's unsurpassed dharma store.",
        "source": "T13n0397_022:0154c13_12"
    },
    {
        "source_sentence": "是故彼佛遣此寶鬘，從我索欲。",
        "translation": "That's why the Buddha sent this jeweled arrow to ask for it from me.",
        "source": "T13n0397_022:0154c14_13"
    },
    {
        "source_sentence": "我今與之，并欲以是法目陀羅尼贈彼為信。",
        "translation": "Now, I'll give it to them, and I want to present this Dharma-mouth dhāraṇī as faith.",
        "source": "T13n0397_022:0154c15_14"
    },
    {
        "source_sentence": "能作無量微妙大明，能乾一切諸惡煩惱，能持一切所聞不忘，能淨一切心之垢污，",
        "translation": "They are able to produce infinitely subtle great light, able to dry up all bad afflictions, able to retain what they hear and not forget, able to purify the defilements of all minds.",
        "source": "T13n0397_022:0154c16_15"
    },
    {
        "source_sentence": "能護一切諸善禁戒，能入一切大智慧中，能護一切無上三昧，能護己心生他喜心，",
        "translation": "They are able to uphold all virtuous precepts; they can enter all great knowledge and wisdom; they can uphold all the supreme concentrations; they can guard their own minds and give rise to the joy of others.",
        "source": "T13n0397_022:0154c18_16"
    },
    {
        "source_sentence": "受持聖法遠離諸病，所求之法如願即得。",
        "translation": "Accepting and upholding the noble teaching, he's far removed from illnesses, and the Dharma he seeks will be obtained as he wishes.",
        "source": "T13n0397_022:0154c20_17"
    },
    {
        "source_sentence": "增長一切資生所須，亦能長養一切善根，能調惡王及以四姓，諸惡鬼神鳥獸水虫，",
        "translation": "They increase all necessities of daily life and can also nourish all roots of goodness. They can tame evil kings, the four kinds of castes, bad spirits, ghosts, birds, animals, water creatures, and insect",
        "source": "T13n0397_022:0154c21_18"
    },
    {
        "source_sentence": "護持一切諸善根本，能得如來一切諸法，乃至能得十八不共。",
        "translation": "Protecting all good roots, they can attain all the Tathāgata's teachings, up to the point where they can attain 18 distinctive qualities.",
        "source": "T13n0397_022:0154c23_0"
    },
    {
        "source_sentence": "是故我今欲遣如是法目陀羅尼至彼世界與釋迦如來。」",
        "translation": "That's why I now want to send such a Dharma-mouth dhāraṇī to that world and give it to the Śākyamuni Tathāgata.",
        "source": "T13n0397_022:0154c24_1"
    },
    {
        "source_sentence": "即告金剛山童子言：「善男子！",
        "translation": "He then addressed the Vajra Mountain boy, Good sons!",
        "source": "T13n0397_022:0154c25_2"
    },
    {
        "source_sentence": "汝可往彼娑婆世界，稱我名字問訊彼佛，金剛光明功德如來，以此法目陀羅尼門遠贈世尊。」",
        "translation": "You may go to that sahā world, call me by my name, and greet that Buddha, the Tathāgata of Vajragarbha's Merit, who presents this dharma-mouth dhāraṇī as a distant gift to the Bhagavān",
        "source": "T13n0397_022:0154c26_3"
    },
    {
        "source_sentence": "金剛山童子言：「世尊！",
        "translation": "The Vajra Mountain boy said, Bhagavān!",
        "source": "T13n0397_022:0154c28_4"
    },
    {
        "source_sentence": "善哉，善哉！",
        "translation": "Excellent, excellent!",
        "source": "T13n0397_022:0154c29_0"
    },
    {
        "source_sentence": "我亦欲往禮覲彼佛，并欲啟受所未曾聞虛空目法門。」",
        "translation": "I also want to go there to pay homage to that Buddha and want to enlighten him with the teaching of the space-eye eye, which I've never heard before.",
        "source": "T13n0397_022:0154c29_1"
    },
    {
        "source_sentence": "爾時，復有六萬億菩薩摩訶薩八十千億聲聞大眾，同聲而言：「世尊！",
        "translation": "At that point, another 60,000 billion bodhisattvas, mahāsattvas, eighty thousand million śrāvakas, and a multitude of śrāvakas all said with one voice, Bhagavān!",
        "source": "T13n0397_022:0155a01_2"
    },
    {
        "source_sentence": "我等亦欲詣彼世界禮覲彼佛，并欲啟受所未曾聞虛空目法門，唯願如來加我神力令得往返。」",
        "translation": "We also want to go to that world and pay homage to the Buddha, and we want to enlighten him with the Dharma teaching of the space-eye eye that we've never heard before, so may the Tathāgata give us my supernormal powers to make",
        "source": "T13n0397_022:0155a03_0"
    },
    {
        "source_sentence": "彼佛答言：「善哉，善哉！",
        "translation": "The Buddha answered, Good, good!",
        "source": "T13n0397_022:0155a05_1"
    },
    {
        "source_sentence": "諸善男子！",
        "translation": "“O sons of the virtuous!",
        "source": "T13n0397_022:0155a05_2"
    },
    {
        "source_sentence": "宜知是時。",
        "translation": "You should know that this is the right time.",
        "source": "T13n0397_022:0155a06_0"
    },
    {
        "source_sentence": "是金剛山童子者，能調伏汝，即是汝等善知識也。」",
        "translation": "This is the Vajra Mountain boy who can subdue you, which is your good friend.",
        "source": "T13n0397_022:0155a06_1"
    },
    {
        "source_sentence": "爾時，彼佛即告金剛山童子言：「善男子！",
        "translation": "It was then that the Buddha addressed the Vajra Mountain boy, saying, Good man!",
        "source": "T13n0397_022:0155a07_2"
    },
    {
        "source_sentence": "諦聽，諦聽！",
        "translation": "Listen attentively, and pay close attention!",
        "source": "T13n0397_022:0155a08_3"
    },
    {
        "source_sentence": "我當為汝宣說如是法目陀羅尼。」",
        "translation": "I will explain this Dharma-mouth dhāraṇī for you.",
        "source": "T13n0397_022:0155a08_4"
    },
    {
        "source_sentence": "即說呪曰：◎「阿[(口*皮)\\/女](一)　阿[(口*皮)\\/女](二)　阿[(口*皮)\\/女](三)　若那蛇咤(四)　摩訶摩呿(五)　三摩呿呿[(口*皮)\\/女][(口*皮)\\/女](六)　樹提(七)　阿咃(八)　那[(口*皮)\\/女]那蛇濘(九)　佛闍羅哆(十)　安豆賴哆(十一)　闍邏迦哆(十二)　阿那耨德叉(十三)　凡浮婆(十四)　那婆荼婆(十五)　勒叉盧戰那(十六)　莎致呿婆(十七)　陀邏尼叉闍(十八)　波邏迦啅婆(十九)　鞞那叉(二十)　婆那鞞吼(二十一)　阿那迦呿(二十二)　戰荼咩修(二十三)　波陀呿多(二十四)　修盧遮那(二十五)　盧戰那婆(二十六)　盧遮蛇若婆婆斯(二十七)　莎呵(二十八)「善男子！",
        "translation": "即說呪曰:◎「阿[(口*皮)\\/女](一) 阿[(口*皮)\\/女](一) 阿[(口*皮)\\/女](一) 阿[(口*皮)",
        "source": "T13n0397_022:0155a09_5"
    },
    {
        "source_sentence": "汝當受持讀誦書寫是陀羅尼，往彼世界問訊釋迦牟尼如來。",
        "translation": "You must memorize, recite, write, and copy this dhāraṇī, and go to that world to greet the Tathāgata Śākyamuni.",
        "source": "T13n0397_022:0155a18_6"
    },
    {
        "source_sentence": "如我辭曰：『四部弟子樂受法不？",
        "translation": "As I said, 'Are the four groups of disciples happy to receive the teaching?'",
        "source": "T13n0397_022:0155a19_7"
    },
    {
        "source_sentence": "四姓之人能供養不？",
        "translation": "Can people of the four castes make offerings?",
        "source": "T13n0397_022:0155a20_8"
    },
    {
        "source_sentence": "眾生之心不濁亂不？",
        "translation": "Is the mind of sentient beings not turbid and disturbed?",
        "source": "T13n0397_022:0155a20_9"
    },
    {
        "source_sentence": "常能親近於如來不？",
        "translation": "Can you always become intimate with the Tathāgata?",
        "source": "T13n0397_022:0155a21_10"
    },
    {
        "source_sentence": "復能尊重讚嘆佛不？",
        "translation": "Can you venerate and praise the Buddha?",
        "source": "T13n0397_022:0155a21_11"
    },
    {
        "source_sentence": "增廣流布佛正法不？",
        "translation": "Will it increase and spread the Buddha's right teaching?",
        "source": "T13n0397_022:0155a22_12"
    },
    {
        "source_sentence": "金剛光明功德如來，以此法目陀羅尼門遠贈世尊，能作大明，乾焦一切諸惡煩惱，",
        "translation": "The Tathāgata of the Virtue of the Diamond-illumining Buddha bestowed this dharma-mouth dhāraṇī teaching from afar on the Bhagavān, able to make a great luminosity that would dry up all bad afflictions.",
        "source": "T13n0397_022:0155a22_13"
    },
    {
        "source_sentence": "乃至獲得如來十八不共之法。』」",
        "translation": "They'll attain the eighteen distinctive qualities of the Tathāgata.'",
        "source": "T13n0397_022:0155a24_14"
    },
    {
        "source_sentence": "時，金剛山童子受持、讀誦、書寫如是陀羅尼已，告諸大眾：「若欲往彼娑婆世界覲見釋迦牟尼如來，",
        "translation": "After memorizing, reciting, and writing these dhāraṇīs, the boy Vajraśekhara told the great assembly, “If you wish to go to that sahā world to see the Tathāgata Śākyamuni,",
        "source": "T13n0397_022:0155a25_15"
    },
    {
        "source_sentence": "并欲啟受所未曾聞虛空目法門者，應當遠離一切色想，亦莫念於分別之相。",
        "translation": "Those who want to enlighten those who have never heard the teaching of the eye of space-eye, should be free of all forms and conceptions and don't think about discriminating characteristics.",
        "source": "T13n0397_022:0155a27_16"
    },
    {
        "source_sentence": "常當修集虛空之相，遠離一切取捨等相，放捨一切塵勞等相，解諸結縛專念虛空。」",
        "translation": "They should always cultivate the characteristic of accumulating space, part with all forms of attachment and equanimity, abandon all forms of defilement and so forth, and understand the fetters and focus on emptiness in mindfulness of space.",
        "source": "T13n0397_022:0155a29_17"
    },
    {
        "source_sentence": "爾時，大眾咸作是言：「善哉，善哉！",
        "translation": "At that point, the whole crowd said, Good, good!",
        "source": "T13n0397_022:0155b02_18"
    },
    {
        "source_sentence": "善男子！」",
        "translation": "Good sons!",
        "source": "T13n0397_022:0155b02_19"
    },
    {
        "source_sentence": "即前禮佛，禮已繫念觀虛空相，於一念頃即來至此娑婆世界，覲見釋迦牟尼如來。",
        "translation": "After paying homage to the Buddha, he's mindful of observing the characteristics of space after bowing, and in a moment of thought, he comes to this sahā world to see the Tathāgata Śākyamuni.",
        "source": "T13n0397_022:0155b03_20"
    },
    {
        "source_sentence": "頭面禮足供養恭敬，尊重讚歎右遶三匝，却在一面合掌而立。",
        "translation": "He bowed his head and feet, offered support and respect, venerated and praised him three times to his right, withdrew to one side, joined his palms, and stood.",
        "source": "T13n0397_022:0155b05_0"
    },
    {
        "source_sentence": "是時，寶鬘復往西方，過八萬億諸佛世界，彼有世界，名曰慧闇，具足五滓。",
        "translation": "At that time the jeweled bell then proceeded again to the west, past eighty-thousand myriads of koṭis of buddha worlds. There was a world there called the “darkness of wisdom” which contained five kinds of",
        "source": "T13n0397_022:0155b06_1"
    },
    {
        "source_sentence": "有佛、世尊，號曰智幢如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "There was a buddha, a world-honored one, named Banner of Knowledge Tathāgata, Arhat, Completely Enlightened One, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed, Tam",
        "source": "T13n0397_022:0155b08_2"
    },
    {
        "source_sentence": "亦為四眾宣說如是雜四諦法。",
        "translation": "He also explains these mixed teachings of the four noble truths for the four groups of people.",
        "source": "T13n0397_022:0155b10_3"
    },
    {
        "source_sentence": "彼時會中有諸菩薩、聲聞四眾：比丘、比丘尼、優婆塞、優婆夷，見是寶鬘大光明已，",
        "translation": "In that assembly, there were bodhisattvas and śrāvakas in the fourfold assembly: monks, bhikṣus, bhikṣuṇīs, laymen, and laywomen. Seeing this great ray of light",
        "source": "T13n0397_022:0155b10_4"
    },
    {
        "source_sentence": "觀察四方。",
        "translation": "He observes the four directions.",
        "source": "T13n0397_022:0155b12_5"
    },
    {
        "source_sentence": "仰見寶鬘在佛頂上虛空中住，即白佛言：「世尊！",
        "translation": "When he saw the jeweled garland in the sky above the Buddha's head, he said to the Buddha, Bhagavān!",
        "source": "T13n0397_022:0155b12_6"
    },
    {
        "source_sentence": "如是寶鬘從何處來？",
        "translation": "Where did this treasure garland come from?",
        "source": "T13n0397_022:0155b14_0"
    },
    {
        "source_sentence": "誰之所遣？」",
        "translation": "Who sent it?",
        "source": "T13n0397_022:0155b14_1"
    },
    {
        "source_sentence": "彼佛答言：「善男子！",
        "translation": "The Buddha answered, Good man!",
        "source": "T13n0397_022:0155b14_2"
    },
    {
        "source_sentence": "東方去此，八萬億諸佛世界，彼有世界名曰娑婆，具足五滓。",
        "translation": "To the east of here, in eighty-thousand myriads of koṭis of buddha worlds, there's a world named sahāsāra, which is fully endowed with five dregs.",
        "source": "T13n0397_022:0155b15_3"
    },
    {
        "source_sentence": "有佛、世尊，號釋迦牟尼十號具足，亦為四眾宣說開示雜四諦法。",
        "translation": "There are buddhas and world-honored ones named Śākyamuni, whose ten epithets are complete, who also explain the teaching of the mixed four noble truths to the four groups of people.",
        "source": "T13n0397_022:0155b16_4"
    },
    {
        "source_sentence": "如我今於此土無異，乃至欲開如來法藏。",
        "translation": "Just as I am now no different from this land, even if I want to open the Tathāgata's store of the Dharma.",
        "source": "T13n0397_022:0155b18_5"
    },
    {
        "source_sentence": "是故彼佛遣此寶鬘，從我索欲。",
        "translation": "That's why the Buddha sent this jeweled arrow to ask for it from me.",
        "source": "T13n0397_022:0155b19_6"
    },
    {
        "source_sentence": "我今與之，并欲贈彼淨目陀羅尼，能作大明乾焦煩惱，乃至能得如來十八不共之法。",
        "translation": "I'll give it to him now, and I want to give him the pure-eyed dhāraṇī that will greatly clarify the afflictions of dryness and defilement, so that he can attain the 18 unique qualities of the Tathā",
        "source": "T13n0397_022:0155b19_7"
    },
    {
        "source_sentence": "是故我今，欲遣如是淨目陀羅尼至彼世界贈彼如來。」",
        "translation": "That's why I now want to send such a pure-eyed dhāraṇī to that world and present it to the Tathāgata.",
        "source": "T13n0397_022:0155b21_8"
    },
    {
        "source_sentence": "彼佛即告勝幢童子：「汝可往彼娑婆世界稱我名字問訊彼佛，并以如是淨目陀羅尼門，",
        "translation": "That Buddha then said to the boy Vaiśeṣika, Go to that sahā world and call it by my name to greet that Buddha, and use the dhāraṇī of pure eyes like this:",
        "source": "T13n0397_022:0155b22_9"
    },
    {
        "source_sentence": "遠相贈遺。」",
        "translation": "They'll be given to each other from afar.",
        "source": "T13n0397_022:0155b24_10"
    },
    {
        "source_sentence": "時彼眾中復有無量菩薩、聲聞，同聲而言：「善哉！",
        "translation": "Among those people, there were also measureless bodhisattvas and śrāvakas in the crowd who said with one voice, Good!",
        "source": "T13n0397_022:0155b25_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0155b26_12"
    },
    {
        "source_sentence": "我等亦欲詣彼世界禮覲彼佛，并欲聽受所未曾聞虛空目法門。」",
        "translation": "We also want to go to that world and pay homage to that Buddha, and we want to hear and accept the teaching of the space-eye eye as we've never heard before.",
        "source": "T13n0397_022:0155b26_13"
    },
    {
        "source_sentence": "乃至彼佛即說呪曰：◎「蜜呵(一)　蜜呵(二)　蜜呵(三)　蜜呵(四)　阿婆蜜呵(五)　薩多蜜呵(六)　修婆舍蜜呵(七)　那婆蜜呵(八)　修破婆(九)　阿能伽提比叉(十)　闍蛇私羅(十一)　那羅烏難(十二)　呿婆波囉(十三)　那邏邏禪(十四)　修叉(十五)　翅奢私羅(十六)　阿婆羅私摩(十七)　摩訶廁提闍那(十八)　阿那叉陀(十九)　阿婆呿伽(二十)　那由多文陀(二十一)　娑婆邏(二十二)　阿若伽伽(二十三)　薩遮首留婆竭婆車那(二十四)　莎呵(二十五)「善男子！",
        "translation": "乃至彼佛即說呪曰::「蜜呵(一) 蜜呵(二) 蜜呵(三) 蜜呵(四) 阿婆蜜呵(五) 薩多蜜呵(六) 修婆舍蜜呵(七",
        "source": "T13n0397_022:0155b27_14"
    },
    {
        "source_sentence": "汝當受持、讀誦、書寫是陀羅尼，往彼世界。」",
        "translation": "You must memorize, recite, and write this dhāraṇī and go to that world.",
        "source": "T13n0397_022:0155c07_15"
    },
    {
        "source_sentence": "乃至一面合掌而立。",
        "translation": "It goes so far as to stand at one side with joined palms.",
        "source": "T13n0397_022:0155c08_16"
    },
    {
        "source_sentence": "是時，寶鬘復至北方，過九萬九億諸佛世界，彼有世界名曰為常，具足五滓。",
        "translation": "At the time, the jeweled garland returned to the north and passed through ninety-nine hundred million buddha worlds, where there was a world named constancy that contained five dregs.",
        "source": "T13n0397_022:0155c08_17"
    },
    {
        "source_sentence": "有佛、世尊，號發光功德，十號具足，亦為四眾宣說開示雜四諦法。",
        "translation": "There are buddhas and world-honored ones whose names emanate the light of virtue and whose ten epithets are replete, who also explain to the fourfold assembly the teaching that reveals the mixed dharma of the four truths.",
        "source": "T13n0397_022:0155c10_18"
    },
    {
        "source_sentence": "而彼會中有諸菩薩、聲聞四眾：比丘、比丘尼、優婆塞、優婆夷，見是寶鬘大光明已，",
        "translation": "At that assembly, there were bodhisattvas and śrāvakas in the fourfold assembly: monks, nuns, laymen, and laymen. Seeing this great ray of light emanating from the jeweled silhouet",
        "source": "T13n0397_022:0155c11_19"
    },
    {
        "source_sentence": "觀察四方。",
        "translation": "He observes the four directions.",
        "source": "T13n0397_022:0155c13_20"
    },
    {
        "source_sentence": "仰見寶鬘在佛頂上虛空中住，即白佛言：「世尊！",
        "translation": "When he saw the jeweled garland in the sky above the Buddha's head, he said to the Buddha, Bhagavān!",
        "source": "T13n0397_022:0155c13_21"
    },
    {
        "source_sentence": "如是寶鬘，從何處來？",
        "translation": "Where did this jeweled garland come from?",
        "source": "T13n0397_022:0155c14_22"
    },
    {
        "source_sentence": "誰之所遣？」",
        "translation": "Who sent it?",
        "source": "T13n0397_022:0155c15_23"
    },
    {
        "source_sentence": "彼佛答言：「善男子！",
        "translation": "The Buddha answered, Good man!",
        "source": "T13n0397_022:0155c15_24"
    },
    {
        "source_sentence": "南方去此，九萬九億諸佛世界，彼有世界名曰娑婆，具足五滓。",
        "translation": "To the south of here, in ninety-nine hundred million buddha worlds, there's a world named Sahā, which has all the five dregs.",
        "source": "T13n0397_022:0155c16_25"
    },
    {
        "source_sentence": "有佛、世尊，號釋迦牟尼，十號具足，亦為四眾宣說開示雜四諦法，如我今於此土無異。",
        "translation": "There are buddhas and world-honored ones named Śākyamuni, endowed with the ten epithets, who also explain to the fourfold assembly the teaching of the composite of the four truths, just as I am now in this",
        "source": "T13n0397_022:0155c17_26"
    },
    {
        "source_sentence": "乃至欲開如來法藏，是故遣此四寶華鬘，從我索欲。",
        "translation": "It's because he wants to open the Tathāgata's store of the Dharma, so he sends these four-jeweled flower garland and asks me for it.",
        "source": "T13n0397_022:0155c19_27"
    },
    {
        "source_sentence": "我今與之，并欲贈彼光目陀羅尼，能作大明乾焦煩惱，乃至，能得如來十八不共之法。",
        "translation": "I'll give it to him now, and I want to give him the Guangmu dhāraṇī, which will greatly clarify the afflictions of dryness and defilement, so that he can attain the 18 unique qualities of the Tathā",
        "source": "T13n0397_022:0155c20_28"
    },
    {
        "source_sentence": "是故我今，欲遣如是光目陀羅尼，至彼世界贈彼如來。」",
        "translation": "That's why I now want to send such a dhāraṇī of luminous eyes like this to that world and present it to the Tathāgata.",
        "source": "T13n0397_022:0155c22_29"
    },
    {
        "source_sentence": "彼佛即告勝意童子：「善男子！",
        "translation": "The Buddha then addressed the boy Vaiśravaṇa, Good sons!",
        "source": "T13n0397_022:0155c23_30"
    },
    {
        "source_sentence": "汝可往彼娑婆世界，稱我名字問訊彼佛，以是光目陀羅尼遠相贈遺。」",
        "translation": "You may go to that sahā world, call it by my name, and greet the Buddha there; this is the distant gift of the Guangmu dhāraṇī.",
        "source": "T13n0397_022:0155c24_31"
    },
    {
        "source_sentence": "時彼眾中，復有無量菩薩、聲聞，同聲而言：「善哉！",
        "translation": "Among those people, there were also measureless bodhisattvas and śrāvakas in the assembly who all said, Good!",
        "source": "T13n0397_022:0155c26_32"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0155c27_33"
    },
    {
        "source_sentence": "我等亦欲詣彼世界禮覲彼佛，并欲啟受所未曾聞虛空目法門。」",
        "translation": "We also want to go there in the world to pay homage to that Buddha and want to enlighten him with the teaching of the eye of space, which we've never heard before.",
        "source": "T13n0397_022:0155c27_34"
    },
    {
        "source_sentence": "乃至彼佛即說此陀羅尼：◎「闍婆摩(一)　闍婆摩(二)　闍婆摩(三)　阿拘盧吒(四)　比婆闍婆(五)　摩訶陀摩(六)　呿婆(七)　阿邏闍(八)　散菩陀若呿婆(九)　阿邏闍[(口*皮)\\/女]婆(十)　三牟婆邏[(口*皮)\\/女]婆(十一)　三摩邏[(口*皮)\\/女][(口*皮)\\/女](十二)　闍[(口*皮)\\/女][(口*皮)\\/女][(口*皮)\\/女][(口*皮)\\/女](十三)　闍提叉蛇婆婆(十四)　摩希闍婆涅畔陀(十五)　比牟遮婆婆(十六)　那蛇那婆婆(十七)　遮颰婆婆(十八)　輸盧多婆婆(十九)　其浪那婆婆(二十)　鞾婆婆(二十一)　迦蛇婆婆(二十二)　質多婆婆(二十三)　三牟陀婆婆(二十四)　提邏那婆婆(二十五)　瞋那修留提婆婆(二十六)　莎呵「善男子！",
        "translation": "乃至彼佛即說此陀羅羅尼:◎「闍婆摩(一) 闍婆摩(二) 闍婆摩(三) 阿拘盧吒(四) 比婆闍婆(五) 摩訶陀摩(六",
        "source": "T13n0397_022:0155c28_35"
    },
    {
        "source_sentence": "汝當受持、讀誦、書寫是陀羅尼往彼世界。」",
        "translation": "You must memorize, recite, and write this dhāraṇī and go to that world.",
        "source": "T13n0397_022:0156a10_36"
    },
    {
        "source_sentence": "乃至一面合掌而立。",
        "translation": "It goes so far as to stand at one side with joined palms.",
        "source": "T13n0397_022:0156a11_37"
    },
    {
        "source_sentence": "是時，寶鬘復至東方，去此六萬千億佛土，彼有世界名曰寶頂，具足五滓。",
        "translation": "“Then the holy man came to the east and departed sixty-thousand myriadstical koṭis of buddha lands from here. There was a world called the jeweled peak, which contained five kinds of debris.",
        "source": "T13n0397_022:0156a11_38"
    },
    {
        "source_sentence": "有佛號曰寶蓋光明功德，十號具足，亦為四眾宣說開示雜四諦法。",
        "translation": "There was a buddha named Jeweled Canopy of Light and Virtue, endowed with the ten epithets, who also taught the teachings of the fourfold truth to the fourfold assembly.",
        "source": "T13n0397_022:0156a13_39"
    },
    {
        "source_sentence": "而彼會中有諸菩薩、聲聞四眾：比丘，比丘尼，優婆塞，優婆夷，見是寶鬘大光明已，",
        "translation": "At that assembly, there were bodhisattvas and śrāvakas in the fourfold assembly: monks, bhikṣus, bhikṣuṇīs, laymen, and laywomen. Seeing this great ray of light",
        "source": "T13n0397_022:0156a14_40"
    },
    {
        "source_sentence": "觀察四方。",
        "translation": "He observes the four directions.",
        "source": "T13n0397_022:0156a16_41"
    },
    {
        "source_sentence": "仰見寶鬘在佛頂上虛空中住，即白佛言：「如是寶鬘從何處來？",
        "translation": "When he saw the jeweled garland in the sky above the Buddha's head, he said to the Buddha, Where did this jeweled garland come from?",
        "source": "T13n0397_022:0156a16_42"
    },
    {
        "source_sentence": "誰之所遣？」",
        "translation": "Who sent it?",
        "source": "T13n0397_022:0156a18_43"
    },
    {
        "source_sentence": "彼佛答言：「西方去此，六萬千億諸佛世界，彼有世界，名曰娑婆，具足五滓。",
        "translation": "The Buddha answered, In the west, there are sixty thousand million buddha worlds away from here, and there's a world named sahāsā that has all five dregs.",
        "source": "T13n0397_022:0156a18_44"
    },
    {
        "source_sentence": "有佛、世尊，號釋迦牟尼十號具足，亦為四眾宣說開示雜四諦法。",
        "translation": "There are buddhas and world-honored ones named Śākyamuni, whose ten epithets are complete, who also explain the teaching of the mixed four noble truths to the four groups of people.",
        "source": "T13n0397_022:0156a20_45"
    },
    {
        "source_sentence": "如我今於此土無異，乃至欲開如來法藏，是故遣此四寶華鬘，從我索欲。",
        "translation": "Just as I now have no difference in this land, even if I want to open the Tathāgata's store of the Dharma, so send these four-jeweled lotus flower garland and ask for it from me.",
        "source": "T13n0397_022:0156a21_46"
    },
    {
        "source_sentence": "我今與之，并欲贈彼聖目陀羅尼，能作大明乾燋煩惱。",
        "translation": "Now, I'll give it to him, and I want to give him the noble eye dhāraṇī, which will greatly clarify the afflictions of dryness and defilement.",
        "source": "T13n0397_022:0156a23_47"
    },
    {
        "source_sentence": "乃至能得如來十八不共之法。",
        "translation": "It's even the ability to attain the 18 distinctive qualities of the Tathāgata.",
        "source": "T13n0397_022:0156a24_48"
    },
    {
        "source_sentence": "是故，我今欲遣如是聖目陀羅尼至彼世界贈彼如來。」",
        "translation": "Therefore, I now want to send such a noble-eyed dhāraṇī to that world and present it to the Tathāgata.",
        "source": "T13n0397_022:0156a25_49"
    },
    {
        "source_sentence": "即告虛空聲童子：「善男子！",
        "translation": "He then addressed the boy Ākāśagarbha, Good man!",
        "source": "T13n0397_022:0156a26_50"
    },
    {
        "source_sentence": "汝可往彼娑婆世界，稱我名字，問訊彼佛，并以如是聖目陀羅尼遠相贈遺。」",
        "translation": "You may go to that sahā world, call me by my name, greet that Buddha, and give him such a distant legacy of the noble eye dhāraṇī.",
        "source": "T13n0397_022:0156a26_51"
    },
    {
        "source_sentence": "乃至復有無量菩薩、聲聞大眾，同音而言：「善哉！",
        "translation": "Even more, there are measureless bodhisattvas and śrāvakas in the great assembly who all say with one voice, Good!",
        "source": "T13n0397_022:0156a28_52"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0156a29_53"
    },
    {
        "source_sentence": "我等亦欲詣彼世界禮覲彼佛，并欲啟受所未曾聞虛空目法門。」",
        "translation": "We also want to go there in the world to pay homage to that Buddha and want to enlighten him with the teaching of the eye of space, which we've never heard before.",
        "source": "T13n0397_022:0156a29_54"
    },
    {
        "source_sentence": "乃至彼佛即說此陀羅尼：◎「阿羅摩(一)　阿羅摩(二)　阿羅摩(三)　闍蛇邏闍(四)　首路羅闍(五)　伽闍手(六)　[(口*皮)\\/女]邏遮羅(七)　阿尼遮(八)　阿呿莎邏(九)　呿伽莎闍那(十)　那烏訶(十一)　那邏咃(十二)　那烏訶(十三)　摩醯首邏遮摩(十四)　阿摩昵(十五)　呵蛇莎利邏(十六)　遮颼遮摩(十七)　遮颼散遮颼那(十八)　那[(口*皮)\\/女](十九)　那婆摩闍(二十)　阿[(口*皮)\\/女]呿[(口*皮)\\/女](二十一)　車婆那婆呿伽禪頭(二十二)　娑羅戰陀羅(二十三)　摩醯首邏尼羅那[(口*皮)\\/女](二十四)　薩陀摩叉蛇(二十五)　莎呵「善男子！",
        "translation": "乃至彼佛即說此陀羅羅尼:◎「阿羅摩(一) 阿羅摩(二) 阿羅摩(三) 闍蛇邏闍(四) 首路羅闍(五) 伽闍手(六)",
        "source": "T13n0397_022:0156b02_55"
    },
    {
        "source_sentence": "汝當受持、讀誦、書寫是陀羅尼往彼世界。」",
        "translation": "You must memorize, recite, and write this dhāraṇī and go to that world.",
        "source": "T13n0397_022:0156b11_56"
    },
    {
        "source_sentence": "乃至一面合掌而立。",
        "translation": "It goes so far as to stand at one side with joined palms.",
        "source": "T13n0397_022:0156b12_57"
    },
    {
        "source_sentence": "時四童子變此世界地平如掌，香華幡蓋七寶具足，為供養佛。",
        "translation": "The four children then transformed the ground of this world into a palm, and their fragrant flowers, banners, canopies, and seven treasures were offered to the Buddha.",
        "source": "T13n0397_022:0156b12_58"
    },
    {
        "source_sentence": "一切天宮、阿修羅宮悉為震動，諸天悅豫多受喜樂，咸以香華、七寶、幡蓋、種種伎樂，",
        "translation": "All the celestial palaces and the asura palaces were shaken, and the delighted gods experienced great joy and happiness. They all offered fragrant flowers, seven kinds of treasure, banners, canopies, and various kinds of music",
        "source": "T13n0397_022:0156b14_0"
    },
    {
        "source_sentence": "供養於佛。",
        "translation": "They make offerings to the Buddha.",
        "source": "T13n0397_022:0156b15_1"
    },
    {
        "source_sentence": "「佛是清淨大法王，　　為諸眾生說甘露，",
        "translation": "“Buddha is the pure great king of teaching, Teaching the ambrosia of truth to sentient beings.",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "　於諸眾生心如地，　　大寶商主愍一切。",
        "translation": "The minds of sentient beings are like earth, and the great treasured merchant lord pitys all of them.",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "　為眾生說清淨法，　　令離諸苦及煩惱，",
        "translation": "He teaches the pure teaching for sentient beings, freeing them from suffering and afflictions.",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "　如來心等如虛空，　　其語微妙知真道。",
        "translation": "The minds of the enlightened are like space; Their words subtly know the true path.",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "　具足戒禁及智慧，　　永滅煩惱降甘露，",
        "translation": "They are endowed with morality, discipline, and wisdom, Forever extinguishing afflictions and descending the ambrosia of immortality.",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "　為渴法者出惡世，　　智炬大明能壞闇。",
        "translation": "For the sake of those who thirst for the teaching, he emerges from the bad world, and the great luminosity of the torch of wisdom destroys darkness.",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "　雖無修集八聖道，　　及以證得解脫者，",
        "translation": "Even though there is no one who cultivates the eightfold holy path And realizes liberation.",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "　如來猶故生憐愍，　　施諸人天淨法眼。",
        "translation": "The Tathāgata is likewise compassionate, bestowing the pure Dharma eye on humans and gods.",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "　能度眾生生死岸，　　能施無上七財寶，",
        "translation": "He can save sentient beings from the shore of birth and death, bestow unexcelled seven treasures.",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "　能令眾生悔生死，　　具修三十七助道。",
        "translation": "Being able to cause sentient beings to repent birth and death, they cultivate the thirty-seven auxiliary paths.",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "　法寶久失佛今示，　　是故得名無上尊，",
        "translation": "The jewel of the Teaching has been lost for a long time, but now it's shown by the Buddha. That's why he's called the unsurpassed honored one.",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "　四方眾生已大集，　　唯願憐愍轉法輪。」",
        "translation": "The sentient beings in the four directions have already assembled, so please have mercy on them and turn the Dharma wheel.",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "時四童子作如是等，供養佛已，上昇虛空高七多羅樹，各執四寶說偈讚歎：爾時，",
        "translation": "After making these offerings to the Buddha, the four children rose up into the sky from the seven-thousand palm trees in height and each held the four treasures and praised them in verse: At that time,",
        "source": "T13n0397_022:0156b16_2"
    },
    {
        "source_sentence": "一切無量大眾心生歡喜，各作是言：「如是無量無邊眾生從何處來？",
        "translation": "All the boundless masses of people were overjoyed, each saying, Where did these measureless and limitless sentient beings come from?",
        "source": "T13n0397_022:0156c01_3"
    },
    {
        "source_sentence": "威儀清淨具無量德，慚愧智慧皆悉成就。",
        "translation": "Their manner was pure and endowed with immeasurable virtue, and their shame and wisdom were all perfected.",
        "source": "T13n0397_022:0156c02_4"
    },
    {
        "source_sentence": "我從昔來未曾覩見如是妙色五通大仙。」",
        "translation": "Since the distant past, I've never seen such a marvelous-colored great sage of the five supernormal powers.",
        "source": "T13n0397_022:0156c03_5"
    },
    {
        "source_sentence": "爾時，世尊告憍陳如比丘：「憍陳如！",
        "translation": "It was then that the Bhagavān addressed the monk Kauṇḍinya, Kauṇḍinya!",
        "source": "T13n0397_022:0156c04_6"
    },
    {
        "source_sentence": "四方多有無量菩薩悉來集會，為聽法故，今當至心清淨其意。」",
        "translation": "In the four directions, there are many measureless bodhisattvas who have gathered together to hear the teaching, and now they will wholeheartedly purify their minds.",
        "source": "T13n0397_022:0156c05_7"
    },
    {
        "source_sentence": "爾時，世尊以微妙音告四童子：「諸善男子！",
        "translation": "It was then that the Bhagavān addressed the four children in a subtle voice, Good men!",
        "source": "T13n0397_022:0156c06_8"
    },
    {
        "source_sentence": "善來，甚快！",
        "translation": "Come, good man, very nice of you!",
        "source": "T13n0397_022:0156c07_9"
    },
    {
        "source_sentence": "從何方面何處而來？」",
        "translation": "Where did it come from and where did it come from?",
        "source": "T13n0397_022:0156c08_0"
    },
    {
        "source_sentence": "時四童子敬禮佛足，周匝圍遶。",
        "translation": "The four children then bowed at the Buddha’s feet and circumambulated him.",
        "source": "T13n0397_022:0156c08_1"
    },
    {
        "source_sentence": "爾時，金剛山童子言：「世尊！",
        "translation": "It was then that the Vajra Mountain boy said, Bhagavān!",
        "source": "T13n0397_022:0156c09_2"
    },
    {
        "source_sentence": "南方去此，九萬二千億恒河沙等諸佛世界。",
        "translation": "To the south of here, there are ninety-two thousand million buddha worlds equal in number to the sands of the Ganges River.",
        "source": "T13n0397_022:0156c09_3"
    },
    {
        "source_sentence": "彼有世界，名金剛光藏，具足五滓。",
        "translation": "There's a world there named the Vajragarbha Treasury of Light, which is replete with five dregs.",
        "source": "T13n0397_022:0156c10_4"
    },
    {
        "source_sentence": "有佛、世尊，號金剛光明功德如來，十號具足，今現在為諸眾生，宣說開示雜四諦法。",
        "translation": "There was a buddha and a world-honored one named the Tathāgata of Vajragarbha's Light of Virtue, whose ten epithets were complete, who now taught and revealed the Dharma of the four mixed truths for sentient being",
        "source": "T13n0397_022:0156c11_5"
    },
    {
        "source_sentence": "彼佛勸我至此世界，問訊世尊，并欲聽受虛空目法門。",
        "translation": "That Buddha encouraged me to come to this world, greeted the Bhagavān, and wanted to hear and accept the teaching of the Ākāśagarbha eye.",
        "source": "T13n0397_022:0156c13_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0156c14_7"
    },
    {
        "source_sentence": "彼金剛光明功德如來，致敬慇懃，問訊世尊。",
        "translation": "The Tathāgata Vajraśekhara Kauṇḍinya paid his respects and greeted the Bhagavān.",
        "source": "T13n0397_022:0156c15_0"
    },
    {
        "source_sentence": "并遺如是陀羅尼，能作大光明乾焦煩惱。",
        "translation": "It's also a left-over dhāraṇī like this that creates great light and dries up the afflictions.",
        "source": "T13n0397_022:0156c16_0"
    },
    {
        "source_sentence": "乃至能得如來十八不共之法。」",
        "translation": "It's even possible to attain the 18 distinctive qualities of the Tathāgata.",
        "source": "T13n0397_022:0156c17_0"
    },
    {
        "source_sentence": "即於佛前說如是呪。",
        "translation": "He then spoke this mantra in front of the Buddha.",
        "source": "T13n0397_022:0156c17_1"
    },
    {
        "source_sentence": "乃至四童子亦復如是。",
        "translation": "It's likewise with the four children.",
        "source": "T13n0397_022:0156c18_2"
    },
    {
        "source_sentence": "說是呪已，其地即時六種震動。",
        "translation": "After he spoke this dhāraṇī, the ground immediately shook in six ways.",
        "source": "T13n0397_022:0156c18_3"
    },
    {
        "source_sentence": "一切龍王各作是言：「我等亦當共至佛所。」",
        "translation": "All the dragon kings each said, We'll go to the Buddha together, too.",
        "source": "T13n0397_022:0156c19_4"
    },
    {
        "source_sentence": "爾時，東方有二龍王：一名、牛護，二名、寶護，是二龍王與六萬龍王。",
        "translation": "At the time, there were two dragon kings in the east: one, Niuhu, two names, and Baohu, these two dragon kings and 60,000 dragon kings.",
        "source": "T13n0397_022:0156c20_5"
    },
    {
        "source_sentence": "南方亦二：一名、為月，二名、婆修，與七萬龍王來至佛所，頭面敬禮，",
        "translation": "In the southern direction there are also two: first, the moon. The second name is Vasiṣṭha; together with seventy thousand nāga kings he comes before the Buddha and venerates him by bowing his forehead to his feet.",
        "source": "T13n0397_022:0156c21_6"
    },
    {
        "source_sentence": "前白佛言：「世尊！",
        "translation": "He said to the Buddha, Bhagavān!",
        "source": "T13n0397_022:0156c23_7"
    },
    {
        "source_sentence": "我等皆能受持、讀誦、書寫如是法目陀羅尼。",
        "translation": "We can all memorize, recite, and write such a dharma-mouth dhāraṇī.",
        "source": "T13n0397_022:0156c23_8"
    },
    {
        "source_sentence": "若有比丘、比丘尼、優婆塞、優婆夷，受持、讀誦、書寫如是法目陀羅尼者，",
        "translation": "“Furthermore, if there are monks, nuns, laymen, and laymen who preserve, recite, and copy such a dharma-by-dharma dhāraṇī,",
        "source": "T13n0397_022:0156c24_9"
    },
    {
        "source_sentence": "我等皆當誠心守護。」",
        "translation": "We will all guard it with sincerity.",
        "source": "T13n0397_022:0156c26_10"
    },
    {
        "source_sentence": "西方、北方亦復如是。",
        "translation": "So it is with the West and the North.",
        "source": "T13n0397_022:0156c26_11"
    },
    {
        "source_sentence": "爾時世界一一各有十萬龍王，來至佛所頭面禮敬。",
        "translation": "At the time, 100,000 dragon kings in each of the worlds came to the Buddha's place and bowed their heads and faces.",
        "source": "T13n0397_022:0156c27_12"
    },
    {
        "source_sentence": "爾時，龜茲國土有一龍王，名曰海德，是阿那婆達多龍王弟，與九萬龍王。",
        "translation": "At the time, there was a dragon king named Haidatta in the land of Kauṣṭhila who was the younger brother of Anavatapta and 60,000 other dragon kings.",
        "source": "T13n0397_022:0156c28_13"
    },
    {
        "source_sentence": "于闐國土有一龍王，名樂藏寶，亦是阿那婆達多龍王弟，與萬八千龍王。",
        "translation": "In the land of Kauṇḍinya there was a dragon king named Blissful Treasury Jewel, who was also the younger brother of Anavatapta and 18,000 other dragon kings.",
        "source": "T13n0397_022:0157a01_14"
    },
    {
        "source_sentence": "波羅越國有一龍王，名曰山德，亦是阿那婆達多龍王弟，與二萬龍王。",
        "translation": "In the country of Vārāṇasī there was a dragon king named Shandatta, who was also the younger brother of Anavatapta and twenty thousand other dragon kings.",
        "source": "T13n0397_022:0157a02_15"
    },
    {
        "source_sentence": "師子國土有一龍王，名曰寶藏，與四萬八千龍王。",
        "translation": "In the land of Siṃhala there was a dragon king named Jewel Treasury, together with forty-eight thousand dragon kings.",
        "source": "T13n0397_022:0157a04_16"
    },
    {
        "source_sentence": "毘茶國土有一龍王，名曰長髮，與四萬二千龍王。",
        "translation": "In the land of Videha there was a dragon king named Chang, together with forty-two thousand dragon kings.",
        "source": "T13n0397_022:0157a05_17"
    },
    {
        "source_sentence": "念蜜奢山有一龍王，名曰婆修吉，與八千龍王。",
        "translation": "There was a dragon king named Vasu吉 on the mountain of Nandiśaila, together with 8,000 dragon kings.",
        "source": "T13n0397_022:0157a06_18"
    },
    {
        "source_sentence": "烏萇國土有一龍王，名阿鉢羅羅，與二萬五千龍王。",
        "translation": "In the land of Udyāna there was a dragon king named Apalāla, together with 25,000 dragon kings.",
        "source": "T13n0397_022:0157a07_19"
    },
    {
        "source_sentence": "乾陀羅國有一龍王，名伊羅鉢多，與三萬龍王。",
        "translation": "In the country of Gandhāra there was a dragon king named Airāvapta and 30,000 dragon kings.",
        "source": "T13n0397_022:0157a09_20"
    },
    {
        "source_sentence": "真丹國土有一龍王，名曰三角，與萬八千龍王。",
        "translation": "In the land of Zhentan there was a dragon king named Jiao, together with 18,000 dragon kings.",
        "source": "T13n0397_022:0157a10_21"
    },
    {
        "source_sentence": "難陀龍王、優波難陀龍王，亦與無量龍王，共至佛所，頭面禮敬，白佛言：「世尊！",
        "translation": "Nanda-nāga-nāga-rāja and Upananda-nāga-rāja, together with innumerable other nāga kings, approached the Buddha. They bowed their foreheads and faces in respect and said to him:",
        "source": "T13n0397_022:0157a11_22"
    },
    {
        "source_sentence": "我等皆能受持、讀誦、書寫如是陀羅尼門，乃至不忘不失一字。」",
        "translation": "We can all memorize, recite, and copy the dhāraṇī teachings like this, even without forgetting a single word.",
        "source": "T13n0397_022:0157a13_23"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T13n0397_022:0157a14_24"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_022:0157a15_0"
    },
    {
        "source_sentence": "汝等真實能護正法。」",
        "translation": "You truly can protect the right teaching.",
        "source": "T13n0397_022:0157a15_1"
    },
    {
        "source_sentence": "爾時，世尊告正語天女：「天女！",
        "translation": "It was then that the Bhagavān addressed the goddess Correctly speaking, Goddess!",
        "source": "T13n0397_022:0157a15_2"
    },
    {
        "source_sentence": "汝能守護我正法不？」",
        "translation": "Can you guard my right teaching?",
        "source": "T13n0397_022:0157a16_3"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0157a16_4"
    },
    {
        "source_sentence": "如來在世及滅度後，是陀羅尼流布之處我當守護，有受持者隨其所求我當與之。",
        "translation": "When the Tathāgata is in the world and after his parinirvāṇa, I will guard this dhāraṇī where it's disseminated, and if there are recipients who follow their requests, I will give it to them.",
        "source": "T13n0397_022:0157a17_0"
    },
    {
        "source_sentence": "若復有欲見我身者，我當現之。",
        "translation": "If there's another person who wants to see me, I will show them.",
        "source": "T13n0397_022:0157a18_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0157a19_2"
    },
    {
        "source_sentence": "若有比丘、比丘尼、優婆塞、優婆夷欲見我者，當淨其身，持戒精進，",
        "translation": "If there are any monks, nuns, laymen, or laywomen who want to see me, they should purify their bodies and observe precepts and make effort.",
        "source": "T13n0397_022:0157a19_3"
    },
    {
        "source_sentence": "於一日中三時洗浴，斷食三日，獨在靜處，若佛像邊、若在塔中、若處靜室，",
        "translation": "For three days he bathed at three o’clock in the middle of the day and for three days he abstained from eating. He remained alone in a secluded place, either by the side of an image of the Buddha or in a stupa or in",
        "source": "T13n0397_022:0157a21_4"
    },
    {
        "source_sentence": "以妙香華、種種幡蓋，及諸味漿供養於佛。",
        "translation": "They presented the Buddha with exquisitely fragrant flowers, various banners and canopies, and various flavors of wine.",
        "source": "T13n0397_022:0157a23_0"
    },
    {
        "source_sentence": "面正東向，讀誦如是陀羅尼句：「『[(口*皮)\\/女]吒置(一)　[(口*皮)\\/女]吒置(二)　休婁(三)　休婁(四)　屯豆婁(五)　屯豆婁(六)　呿吒(七)　呿吒(八)　比莎訶』「是時，",
        "translation": "He faced east and recited this dhāraṇī phrase, saying, '[(mouth*皮)\\/女]吒置(1) [(mouth*皮)\\/女]吒置(2) 休婁(3) 休婁(4) 屯豆婁(3) 屯",
        "source": "T13n0397_022:0157a23_1"
    },
    {
        "source_sentence": "四眾誦是陀羅尼已，我當隨諸四眾之所願，求我悉當令一切成就。",
        "translation": "After the fourfold assembly recites this dhāraṇī, I will follow the wishes of the fourfold assembly and ask me to make them all come true.",
        "source": "T13n0397_022:0157a27_2"
    },
    {
        "source_sentence": "若我不來，即為欺誑十方諸佛，亦莫令我成阿耨多羅三藐三菩提。」",
        "translation": "If I don't come, I'll deceive the buddhas of the ten directions and won't be allowed to attain unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0397_022:0157a28_3"
    },
    {
        "source_sentence": "爾時，佛告羅睺阿修羅王、毘摩質多阿修羅王、毘婁遮那阿修羅王：「我今以此淨目陀羅尼，",
        "translation": "It was then that the Buddha addressed the asura king Rāmaudgalyāyana, the asura king Vimalacitra, and the asura king Videcana, saying:",
        "source": "T13n0397_022:0157b01_4"
    },
    {
        "source_sentence": "付囑汝等。",
        "translation": "I'll entrust it to you.",
        "source": "T13n0397_022:0157b03_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_022:0157b03_6"
    },
    {
        "source_sentence": "汝有大力，若有眾生不信三寶，能令信故。」",
        "translation": "You have great power, and if there are sentient beings who don't believe in the Three Treasures, you can cause them to believe.",
        "source": "T13n0397_022:0157b03_7"
    },
    {
        "source_sentence": "諸阿修羅言：「善哉！",
        "translation": "The asuras said, Good!",
        "source": "T13n0397_022:0157b04_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0157b05_9"
    },
    {
        "source_sentence": "我等護持。",
        "translation": "We will protect it.",
        "source": "T13n0397_022:0157b05_10"
    },
    {
        "source_sentence": "若有四眾、比丘、比丘尼、優婆塞、優婆夷，若佛在世、若滅度後，受持、讀誦、書寫廣說是陀羅尼，",
        "translation": "If there are fourfold assemblies, monks, bhikṣus, bhikṣuṇīs, laymen and laywomen who preserve, recite, and copy this dhāraṇī extensively while the Buddha is in the",
        "source": "T13n0397_022:0157b05_11"
    },
    {
        "source_sentence": "我於是等能施八事。",
        "translation": "These are the eight things that I can give.",
        "source": "T13n0397_022:0157b07_12"
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T13n0397_022:0157b08_13"
    },
    {
        "source_sentence": "一者、健行；",
        "translation": "The first is the vigorous practice.",
        "source": "T13n0397_022:0157b08_14"
    },
    {
        "source_sentence": "二者、樂聽受法；",
        "translation": "The second is that they delight in listening to and receiving the Teaching.",
        "source": "T13n0397_022:0157b08_15"
    },
    {
        "source_sentence": "三者、心無怖畏；",
        "translation": "The third is that their minds are free from fear.",
        "source": "T13n0397_022:0157b09_16"
    },
    {
        "source_sentence": "四、者常明無闇；",
        "translation": "The fourth is that they always have light and no darkness.",
        "source": "T13n0397_022:0157b09_17"
    },
    {
        "source_sentence": "五者、善願具足；",
        "translation": "The fifth is that they are endowed with good aspirations.",
        "source": "T13n0397_022:0157b09_18"
    },
    {
        "source_sentence": "六者、解脫；",
        "translation": "The sixth is liberation.",
        "source": "T13n0397_022:0157b10_19"
    },
    {
        "source_sentence": "七者、具足辯才；",
        "translation": "The seventh is that they are endowed with the power of elucidation.",
        "source": "T13n0397_022:0157b10_20"
    },
    {
        "source_sentence": "八者、善法增長。",
        "translation": "8. the growth of good qualities...",
        "source": "T13n0397_022:0157b10_21"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0157b11_22"
    },
    {
        "source_sentence": "若阿修羅父母、兄弟、妻子、眷屬，惱是人者，我等當治。",
        "translation": "If the asura's parents, brothers, wives, wife, and dependents harm this person, we will treat them.",
        "source": "T13n0397_022:0157b11_23"
    },
    {
        "source_sentence": "若我不於此世界中護佛法者，則為欺誑十方諸佛。」",
        "translation": "If I don't protect the Buddha's teaching in this world, then I'll deceive the buddhas of the ten directions.",
        "source": "T13n0397_022:0157b12_24"
    },
    {
        "source_sentence": "爾時，世尊觀四眾已，告憍陳如比丘：「憍陳如！",
        "translation": "After observing the four groups of people, the Bhagavān then addressed Kauṇḍinya the monk, Kauṇḍinya!",
        "source": "T13n0397_022:0157b13_25"
    },
    {
        "source_sentence": "一切大眾甚樂聞法，無量世界、無量眾生悉為法故來集於此，咸皆欲知法行方便，",
        "translation": "All the great assemblies were delighted to hear the Dharma. Innumerable worlds and beings from innumerable sentient beings had come here for the sake of the Dharma, all wanting to know how to practice the teaching.",
        "source": "T13n0397_022:0157b14_26"
    },
    {
        "source_sentence": "成大智慧，遠離貪欲一切煩惱，真實了知法行方便。」",
        "translation": "They become greatly enlightened, are free of all the afflictions of craving, and truly understand the method of practicing the Dharma.",
        "source": "T13n0397_022:0157b16_27"
    },
    {
        "source_sentence": "時憍陳如白佛言：「善哉！",
        "translation": "Kauṇḍinya then said to the Buddha, Good!",
        "source": "T13n0397_022:0157b18_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0157b18_1"
    },
    {
        "source_sentence": "誠如聖教。",
        "translation": "It's really like the noble teaching.",
        "source": "T13n0397_022:0157b18_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0157b18_3"
    },
    {
        "source_sentence": "四方世界無量菩薩悉持四佛所與欲來，并欲啟受虛空目法行。",
        "translation": "In the worlds of the four directions, there are measureless bodhisattvas who all hold the four buddhas' wishes and want to inspire them to receive the practice of the space-eye Dharma.",
        "source": "T13n0397_022:0157b19_4"
    },
    {
        "source_sentence": "今正是時，唯垂憐愍，為眾生故而宣說之。",
        "translation": "Now is precisely the right time, so please have mercy and explain it for the sake of sentient beings.",
        "source": "T13n0397_022:0157b20_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0157b21_6"
    },
    {
        "source_sentence": "所言法行，法行比丘。",
        "translation": "It's called practicing the Dharma, and it's a monk who practices the Dharma.",
        "source": "T13n0397_022:0157b21_7"
    },
    {
        "source_sentence": "云何名為法行比丘？",
        "translation": "What's called a monk who practices the Dharma?",
        "source": "T13n0397_022:0157b22_8"
    },
    {
        "source_sentence": "唯願世尊，分別演說法行比丘。」",
        "translation": "Please, Bhagavān, let's discern the monks who teach and practice the Dharma.",
        "source": "T13n0397_022:0157b22_9"
    },
    {
        "source_sentence": "佛言：「憍陳如！",
        "translation": "The Buddha said, Kauṇḍinya!",
        "source": "T13n0397_022:0157b23_10"
    },
    {
        "source_sentence": "至心諦聽當為汝說。",
        "translation": "Listen attentively and with utmost attention. I will explain it to you.",
        "source": "T13n0397_022:0157b23_11"
    },
    {
        "source_sentence": "若有比丘，讀誦如來十二部經，謂修多羅乃至優婆提舍，是名樂讀，不名法行。",
        "translation": "If there are monks who read and recite the twelve scriptures of the Tathāgata, which are called sūtra or even up to upāsaka, this is called happy reading and not called religious practice.",
        "source": "T13n0397_022:0157b24_12"
    },
    {
        "source_sentence": "復有比丘，讀誦如來十二部經，樂為四眾敷揚廣說，是名樂說，不名法行。",
        "translation": "Again, if there are monks who read and recite the twelvefold scriptures of the Tathāgata and delight in expounding them extensively for the sake of the fourfold assembly, this is called eloquence and aren't",
        "source": "T13n0397_022:0157b26_13"
    },
    {
        "source_sentence": "復有比丘，讀誦如來十二部經，能廣演說思惟其義，是名思惟，不名法行。",
        "translation": "Again, if there are monks who recite the twelvefold scriptures of the Tathāgata and can extensively explain and contemplate their meanings, this is called contemplation and not Dharma practice.",
        "source": "T13n0397_022:0157b27_14"
    },
    {
        "source_sentence": "復有比丘，受持讀誦十二部經，演說思惟觀其義理，是名樂觀，不名法行。",
        "translation": "Again, there are monks who preserve and recite twelve kinds of scriptures, expound and contemplate their meanings and principles, which are called blissful contemplation and not the practice of the Dharma.",
        "source": "T13n0397_022:0157b29_15"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0157c02_16"
    },
    {
        "source_sentence": "若有比丘能觀身心，心不貪著外一切相，謙虛下意不生憍慢，不以愛水溉灌業田，",
        "translation": "Suppose there is a monk who observes body and mind; his mind is not attached to anything external. He remains humble, without conceit or pride, and he does not irrigate the soil of his business with water that pleases him.",
        "source": "T13n0397_022:0157c02_17"
    },
    {
        "source_sentence": "亦不於中種識種子。",
        "translation": "Nor does he plant the seeds of consciousness in them.",
        "source": "T13n0397_022:0157c04_18"
    },
    {
        "source_sentence": "滅覺觀心境界都息，永離煩惱其心寂靜，如是比丘，我則說之名為法行。",
        "translation": "To cease perception and contemplation, the mind's objective realm is completely calm, and his mind is permanently free of affliction and quiescent, such a monk, I call it the practice of the Dharma.",
        "source": "T13n0397_022:0157c04_19"
    },
    {
        "source_sentence": "如是比丘，若欲獲得聲聞菩提、緣覺菩提、如來菩提，即能得之。",
        "translation": "Thus, if a monk wants to attain the enlightenment of the śrāvakas, the enlightenment of pratyekbuddhas, and the enlightenment of the tathāgatas, he can attain it.",
        "source": "T13n0397_022:0157c06_20"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0157c08_21"
    },
    {
        "source_sentence": "如工陶師埏埴調泥，置之輪上隨意成器，法行比丘亦復如是。",
        "translation": "Just as a potter or potter mixes clay with mud and puts it on a wheel to form a pot at will, so does a monk who practices the Dharma do the same.",
        "source": "T13n0397_022:0157c08_22"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0157c09_23"
    },
    {
        "source_sentence": "若有比丘修法行者，當觀三事：一者、身；",
        "translation": "If there is a monk who practises the doctrine, he should observe three things:",
        "source": "T13n0397_022:0157c10_0"
    },
    {
        "source_sentence": "二者、受；",
        "translation": "The second is sensation.",
        "source": "T13n0397_022:0157c10_1"
    },
    {
        "source_sentence": "三者、心。",
        "translation": "3. mind.",
        "source": "T13n0397_022:0157c11_2"
    },
    {
        "source_sentence": "觀三事已，得二種智：一者、盡智；",
        "translation": "Having observed these three things, they attain two kinds of knowledge:",
        "source": "T13n0397_022:0157c11_3"
    },
    {
        "source_sentence": "二者、無生智。",
        "translation": "2. cognition of nonproduction.",
        "source": "T13n0397_022:0157c12_4"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0157c12_5"
    },
    {
        "source_sentence": "云何盡智？",
        "translation": "What's the cognition of exhaustion?",
        "source": "T13n0397_022:0157c12_6"
    },
    {
        "source_sentence": "云何無生智？",
        "translation": "What's the cognition of nonarising?",
        "source": "T13n0397_022:0157c12_7"
    },
    {
        "source_sentence": "知盡煩惱名為盡智，知盡有支名無生智。",
        "translation": "Knowing the extinction of afflictions is called knowledge of extinction, and knowing the extinction of branches of existence is called nonarising knowledge.",
        "source": "T13n0397_022:0157c13_8"
    },
    {
        "source_sentence": "復次，無行行智名曰盡智，無行果智名無生智；",
        "translation": "“Furthermore, knowledge of conditioned states without formations is called ‘knowledge of destruction’; knowledge of the fruit of conditioned states without formations is called ‘knowledge of nonorigination’.",
        "source": "T13n0397_022:0157c14_9"
    },
    {
        "source_sentence": "盡諸使智名曰盡智，盡煩惱智名無生智。",
        "translation": "Knowledge of the extinction of all contaminants is called ‘knowledge of destruction’; knowledge of the extinction of defilement is called ‘knowledge of nonorigination’.",
        "source": "T13n0397_022:0157c15_10"
    },
    {
        "source_sentence": "復次，知盡諸行名曰盡智，盡一切有名無生智；",
        "translation": "“Furthermore, knowledge of the exhaustion of conditioned states is what is called ‘knowledge of destruction’.",
        "source": "T13n0397_022:0157c16_11"
    },
    {
        "source_sentence": "分別盡物是名盡智，知諸縛解名無生智；",
        "translation": "Discriminating and exhausting things is called ‘knowledge of destruction’. Knowing the liberation from all bonds is called ‘knowledge of nonorigination’.",
        "source": "T13n0397_022:0157c17_12"
    },
    {
        "source_sentence": "知盡根界名曰盡智，知盡緣界名無生智。",
        "translation": "Knowing the limit of faculties is called ‘knowledge of destruction’; knowing the limit of supporting objects is called ‘knowledge of nonorigination’.",
        "source": "T13n0397_022:0157c18_13"
    },
    {
        "source_sentence": "不覺觀煩惱名曰盡智，不覺觀果報名無生智。",
        "translation": "When they don't perceive and contemplate afflictions, it's called the cognition of exhaustion, and when they don't perceive and contemplate the results, they record the cognition of nonproduction.",
        "source": "T13n0397_022:0157c19_14"
    },
    {
        "source_sentence": "復次，盡三地智名曰盡智，盡一切漏名無生智。",
        "translation": "Furthermore, knowledge of the destruction of all impure influences is called ‘knowledge of nonorigination’.",
        "source": "T13n0397_022:0157c20_15"
    },
    {
        "source_sentence": "復次，我生已盡梵行清淨，名曰盡智，更無餘有名無生智。",
        "translation": "Furthermore, the purity of the religious practice that I've ended after being born is called the knowledge of ending it, and there's no other name for the knowledge of nonproduction.",
        "source": "T13n0397_022:0157c21_16"
    },
    {
        "source_sentence": "如是二智即名一智，亦名一行知於三道。",
        "translation": "Thus, these two kinds of cognition are called one cognition, and they're also called one-line cognition of the three paths.",
        "source": "T13n0397_022:0157c22_17"
    },
    {
        "source_sentence": "「若有比丘能斷三道，是名法行，能作是觀，是觀心受。",
        "translation": "“If a monk can cut off the three paths, this is called practicing the Dharma, and if he can contemplate them, this is contemplation of mind as sensation.",
        "source": "T13n0397_022:0157c23_18"
    },
    {
        "source_sentence": "「云何比丘能觀察身？",
        "translation": "How can a monk observe his body?",
        "source": "T13n0397_022:0157c24_19"
    },
    {
        "source_sentence": "若有比丘觀息出入，是名觀身、觀受、觀心。",
        "translation": "If a monk observes breathing out and breathing in and out, this is called observing body, feeling and mind.",
        "source": "T13n0397_022:0157c25_20"
    },
    {
        "source_sentence": "「云何名為觀息出入？",
        "translation": "“What’s called observing breathing in and out?",
        "source": "T13n0397_022:0157c26_21"
    },
    {
        "source_sentence": "息入出者，名阿那波那，入名阿那，出名波那，觀於出入如門如向。",
        "translation": "Cessation of breathing in and breathing out is called ānapāna, entry is called āna, exit is called pāna, and he observes that emission and entry are as gates and directions.",
        "source": "T13n0397_022:0157c26_22"
    },
    {
        "source_sentence": "若有比丘能如是觀，是名法行。",
        "translation": "If a monk can thus contemplate, this is called the practice of the Dharma.",
        "source": "T13n0397_022:0157c28_23"
    },
    {
        "source_sentence": "若有比丘能觀能數，隨息入出冷暖長短，若遍滿身，繫心鼻端，能觀新故，",
        "translation": "Suppose there is a monk who observes the number of breaths that can be counted, entering and exhaling according to their inbreaths, cold and warm, long and short. If he pervades his body, fixing his mind at the",
        "source": "T13n0397_022:0157c28_24"
    },
    {
        "source_sentence": "分別諸相能觀生壞，求舍摩他善入於定，亦能觀察息之麁細，乃至觀於內身，",
        "translation": "Discriminating characteristics, they can observe birth and decay. Seeking cessation, they enter concentration by seeking calmness. They can also observe the grossness and subtlety of breath as well as their internal bodies.",
        "source": "T13n0397_022:0158a01_25"
    },
    {
        "source_sentence": "身作身想，是名比丘修於法行。",
        "translation": "To conceptualize body as body is called a monk who cultivates the practice of the Dharma.",
        "source": "T13n0397_022:0158a03_26"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0158a04_27"
    },
    {
        "source_sentence": "修數息時獲得二事：一者、離惡覺觀；",
        "translation": "At the moment of cultivating breath counting, two things are acquired:",
        "source": "T13n0397_022:0158a04_28"
    },
    {
        "source_sentence": "二者、觀息相貌。",
        "translation": "The second is to contemplate the appearance of calmness.",
        "source": "T13n0397_022:0158a05_29"
    },
    {
        "source_sentence": "修集隨時亦得二事：一者、專念念心；",
        "translation": "At the time of cultivation and accumulation, they also obtain two things:",
        "source": "T13n0397_022:0158a05_30"
    },
    {
        "source_sentence": "二者、離善覺觀。",
        "translation": "The second is that they are free of the contemplation of good awakening.",
        "source": "T13n0397_022:0158a06_31"
    },
    {
        "source_sentence": "觀於冷暖亦得二事：一者、分別出入；",
        "translation": "Observing cold and heat also obtains two things:",
        "source": "T13n0397_022:0158a06_32"
    },
    {
        "source_sentence": "二者、觀心數相。",
        "translation": "The second is to contemplate the characteristics of mind as number.",
        "source": "T13n0397_022:0158a07_33"
    },
    {
        "source_sentence": "修觀身時亦得二事：一者、身輕；",
        "translation": "When one cultivates contemplation of the body, also two things are obtained:",
        "source": "T13n0397_022:0158a08_0"
    },
    {
        "source_sentence": "二者、心輕。",
        "translation": "The second is the lightness of mind.",
        "source": "T13n0397_022:0158a08_1"
    },
    {
        "source_sentence": "轉觀生滅亦得二事：一者、知一切法是無常相；",
        "translation": "The evolving contemplation of arising and ceasing also obtains two things:",
        "source": "T13n0397_022:0158a08_2"
    },
    {
        "source_sentence": "二者、知一切法是無樂相。",
        "translation": "Second, they know that all dharmas lack the characteristic of happiness.",
        "source": "T13n0397_022:0158a10_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_022:0158a10_1"
    },
    {
        "source_sentence": "法行比丘念入出息繫心一處。",
        "translation": "A monk who practices the Dharma is mindful of entering, exhaling, and exhaling with one place of concentration in his mind.",
        "source": "T13n0397_022:0158a10_2"
    },
    {
        "source_sentence": "云何數減？",
        "translation": "What's the number of decreases?",
        "source": "T13n0397_022:0158a11_3"
    },
    {
        "source_sentence": "二數為一，三數為二，乃至十數為九，是名數減。",
        "translation": "The number of two is counted as one, the number of three is counted as two, and up to the number of ten is counted as nine.",
        "source": "T13n0397_022:0158a11_4"
    },
    {
        "source_sentence": "「云何數增？",
        "translation": "What's the number that increases?",
        "source": "T13n0397_022:0158a12_5"
    },
    {
        "source_sentence": "一數為二，乃至九數為十，是名數增。",
        "translation": "A number of one is counted as two, and up to nine are counted as ten, which is called an increase in number.",
        "source": "T13n0397_022:0158a13_6"
    },
    {
        "source_sentence": "何故修增？",
        "translation": "Why does cultivation increase?",
        "source": "T13n0397_022:0158a13_7"
    },
    {
        "source_sentence": "壞一切覺觀故。",
        "translation": "It's because it destroys all perception and contemplation.",
        "source": "T13n0397_022:0158a14_8"
    },
    {
        "source_sentence": "得初禪時觀息入出，及以心相。",
        "translation": "When he attains the first dhyāna, he observes calming inward and outward breathing and the characteristics of his mind.",
        "source": "T13n0397_022:0158a14_9"
    },
    {
        "source_sentence": "「初禪五支：一、覺；",
        "translation": "The first trance is composed of five members:",
        "source": "T13n0397_022:0158a15_10"
    },
    {
        "source_sentence": "二、觀；",
        "translation": "The second is contemplation.",
        "source": "T13n0397_022:0158a15_11"
    },
    {
        "source_sentence": "三、離生喜；",
        "translation": "The third is that joy arises from separation.",
        "source": "T13n0397_022:0158a15_12"
    },
    {
        "source_sentence": "四者、受樂；",
        "translation": "The fourth is that they experience happiness.",
        "source": "T13n0397_022:0158a16_13"
    },
    {
        "source_sentence": "五者、定。",
        "translation": "5. concentration.",
        "source": "T13n0397_022:0158a16_14"
    },
    {
        "source_sentence": "具五支時離貪恚癡。",
        "translation": "When he has the five limbs, he's free of craving, ill-will, and delusion.",
        "source": "T13n0397_022:0158a16_15"
    },
    {
        "source_sentence": "若有比丘具足五支，是名法行，遠離五事成就五事，修集梵行成大功德。",
        "translation": "If a monk is endowed with five limbs, this is called ‘practicing the doctrine.’ Being far removed from these five things and accomplishing these five things, he practices and accumulates religious practice to attain great merit.",
        "source": "T13n0397_022:0158a17_0"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0158a18_1"
    },
    {
        "source_sentence": "若有比丘能得二禪，名為法行。",
        "translation": "If a monk can attain the second dhyāna, it's called practice of the Dharma.",
        "source": "T13n0397_022:0158a18_2"
    },
    {
        "source_sentence": "若有比丘觀息出入，繫心一處遠離喜樂，得第三禪不喜不樂。",
        "translation": "Suppose a monk observes breathing out and breathing in, ties his mind to one place and secludes himself from joy and happiness, and attains the third dhyāna with neither joy nor happiness.",
        "source": "T13n0397_022:0158a19_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_022:0158a21_4"
    },
    {
        "source_sentence": "一心繫念息入出已，遠離喜樂得第四禪。",
        "translation": "After one mind is bound to mindfulness and calming, he parts with joy and happiness and attains the fourth dhyāna.",
        "source": "T13n0397_022:0158a21_5"
    },
    {
        "source_sentence": "若有比丘觀息入出，則觀五陰；",
        "translation": "If there is a monk who observes breathing in and breathing out, he observes the five aggregates.",
        "source": "T13n0397_022:0158a22_6"
    },
    {
        "source_sentence": "若觀五陰，是名法行。",
        "translation": "If he observes the five aggregates, this is called the practice of the Dharma.",
        "source": "T13n0397_022:0158a23_0"
    },
    {
        "source_sentence": "「若比丘見一切法行生滅，乃至見一切煩惱生滅，是名法忍。",
        "translation": "“Suppose a monk sees the arising and ceasing of all practices of dharmas, or sees the arising and ceasing of all afflictions, and this is called patience with regard to dharmas.",
        "source": "T13n0397_022:0158a23_1"
    },
    {
        "source_sentence": "若比丘見眼空，乃至見意識空，是名空忍。",
        "translation": "If a monk sees the emptiness of the eye and even sees the emptiness of consciousness, this is called the tolerance of emptiness.",
        "source": "T13n0397_022:0158a24_2"
    },
    {
        "source_sentence": "若比丘見眼無相，乃至見意識無相，是名無相忍。",
        "translation": "If a monk sees that the eye has no marks and even sees that consciousness has no marks, this is called the forbearance of signlessness.",
        "source": "T13n0397_022:0158a25_3"
    },
    {
        "source_sentence": "若比丘不願於眼乃至意識，是名無願忍。",
        "translation": "If a monk doesn't want the eye or even the consciousness, this is called the forbearance of wishlessness.",
        "source": "T13n0397_022:0158a26_4"
    },
    {
        "source_sentence": "若比丘觀苦異樂異不苦不樂異，是名中諦忍。",
        "translation": "If a monk observes that what's painful is different, what's pleasant is different, and what's neither painful nor pleasant is different, this is called the tolerance of the middle truth.",
        "source": "T13n0397_022:0158a27_5"
    },
    {
        "source_sentence": "若為眾生行於生死，如是名為隨上諦忍。",
        "translation": "If they practice birth and death for sentient beings, this is called the tolerance of following the higher truth.",
        "source": "T13n0397_022:0158a28_6"
    },
    {
        "source_sentence": "「云何隨忍、隨根、隨力、隨於覺觀，乃至隨涅槃？",
        "translation": "“How do they follow forbearance, faculties, powers, perceptions and contemplations, up to nirvāṇa?",
        "source": "T13n0397_022:0158a29_7"
    },
    {
        "source_sentence": "於如是法心不著者，是名信忍，是名為信，不名信根。",
        "translation": "Someone whose mind isn't attached to such things is called a faithful forbearance, which is called faith and not the faculty of faith.",
        "source": "T13n0397_022:0158b01_8"
    },
    {
        "source_sentence": "若攝身心不令造惡，是為精進，不名進根。",
        "translation": "If he collects body and mind and doesn't allow them to create evil, this is called the faculty of effort, which isn't called the faculty of effort.",
        "source": "T13n0397_022:0158b03_9"
    },
    {
        "source_sentence": "若能專念如是等法，是名為念，不名念根。",
        "translation": "If someone can concentrate on mindfulness of such things, this is called mindfulness and not the faculty of mindfulness.",
        "source": "T13n0397_022:0158b04_10"
    },
    {
        "source_sentence": "心心數法能繫一緣，是名為定，不名定根。",
        "translation": "Mind and mental factors can be bound to one supporting object: this is called samdhi. It is not called the faculty samdhi.",
        "source": "T13n0397_022:0158b05_11"
    },
    {
        "source_sentence": "若能不觀如是等相，是名為慧，不名慧根。",
        "translation": "If someone can not contemplate such characteristics, this is called wisdom and not the faculty of wisdom.",
        "source": "T13n0397_022:0158b06_0"
    },
    {
        "source_sentence": "若觀如是無根，是名法行。",
        "translation": "If someone observes such a lack of faculties, this is called the practice of the Dharma.",
        "source": "T13n0397_022:0158b06_1"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0158b08_0"
    },
    {
        "source_sentence": "若有比丘觀於頂法、世第一法，觀三解脫空無相願無常苦空，是名法行，",
        "translation": "If there is a monk who contemplates emptiness, signlessness, wishes for impermanence, and the emptiness of suffering with regard to the top teachings and the highest worldly factor, and observes that the three liberations are void,",
        "source": "T13n0397_022:0158b08_1"
    },
    {
        "source_sentence": "是名空三昧。",
        "translation": "This is called the samādhi of emptiness.",
        "source": "T13n0397_022:0158b09_2"
    },
    {
        "source_sentence": "如是三昧，緣無受命、緣無自在。",
        "translation": "Thus, this samādhi has no conditions for receiving life and no self-dependence for conditions.",
        "source": "T13n0397_022:0158b10_3"
    },
    {
        "source_sentence": "無相三昧，緣盡緣壞、緣滅緣厭。",
        "translation": "The signless samādhi is conditioned by exhaustion, conditioned by disintegration, and conditioned by cessation, conditioned by disenchantment.",
        "source": "T13n0397_022:0158b10_4"
    },
    {
        "source_sentence": "無願三昧，緣於甘露非甘露行，有甘露行非緣甘露；",
        "translation": "The samādhi of wishlessness is conditioned by what is the realm of immortality and not by what is the realm of immortality; there is what is the realm of immortality and not by what is unreal.",
        "source": "T13n0397_022:0158b11_5"
    },
    {
        "source_sentence": "有空三昧緣於甘露非甘露行，有甘露行非緣甘露；",
        "translation": "The samādhi of emptiness has as its object nectar and not nectar, and the samādhi of ambrosia has as its object nectar and not nectar.",
        "source": "T13n0397_022:0158b12_6"
    },
    {
        "source_sentence": "無相三昧緣於甘露非甘露行，有甘露行非緣甘露。",
        "translation": "The signless samādhi is conditioned by the practice of ambrosia that's not ambrosia and has the practice of ambrosia that's not conditioned by ambrosia.",
        "source": "T13n0397_022:0158b14_7"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0158b15_8"
    },
    {
        "source_sentence": "若有比丘緣慧滅莊嚴入無願三昧，是名緣於甘露非甘露行。",
        "translation": "If a monk enters the wishless concentration conditioned by the cessation of wisdom and the adornment of wishlessness, this is called conditioned by the practice of ambrosia and what's not ambrosia.",
        "source": "T13n0397_022:0158b15_9"
    },
    {
        "source_sentence": "若有比丘緣慧滅而得解脫，名甘露行非緣甘露。",
        "translation": "If a monk attains liberation conditioned by the cessation of wisdom, it's called the practice of ambrosia and not conditioned by ambrosia.",
        "source": "T13n0397_022:0158b16_10"
    },
    {
        "source_sentence": "空與無相亦復如是。",
        "translation": "So it is with emptiness and signlessness.",
        "source": "T13n0397_022:0158b18_11"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0158b18_12"
    },
    {
        "source_sentence": "若有比丘能如是觀，是名法行。",
        "translation": "If a monk can thus contemplate, this is called the practice of the Dharma.",
        "source": "T13n0397_022:0158b18_13"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0158b19_14"
    },
    {
        "source_sentence": "若有比丘觀受、觀心，是名法行。",
        "translation": "If a monk contemplates feeling and contemplates mind, this is called the practice of the Dharma.",
        "source": "T13n0397_022:0158b19_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_022:0158b20_16"
    },
    {
        "source_sentence": "能壞我見二十種故。",
        "translation": "It's because they can destroy 20 kinds of views of self.",
        "source": "T13n0397_022:0158b20_17"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0158b21_18"
    },
    {
        "source_sentence": "斷見我見各有五種，色斷乃至識斷，是名五斷見；",
        "translation": "The view of annihilation and the view of self each have five forms. Cessation of matter up to cessation of consciousness are called ‘five views of annihilation’.",
        "source": "T13n0397_022:0158b21_19"
    },
    {
        "source_sentence": "色我乃至識我，是名五我見。",
        "translation": "The self of form and even the self of consciousness are called the five views of self.",
        "source": "T13n0397_022:0158b22_20"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0158b23_21"
    },
    {
        "source_sentence": "五種斷見分別則有四十四種：十六種說想，八說無想，八說非想非非想，",
        "translation": "In relation to the five forms of annihilation and vision, there are then fourty-four forms: sixteen forms that are said to be conceptual identification, eight that are said to be without conceptual identification, and eight that are said to be neither",
        "source": "T13n0397_022:0158b23_22"
    },
    {
        "source_sentence": "六說種種想，六種說斷，是名四十四種。",
        "translation": "The sixth is said to be manifold conceptual identification. Six forms are said to be abandoned. These are called forty-four forms.",
        "source": "T13n0397_022:0158b25_23"
    },
    {
        "source_sentence": "我見分別十八：四定說我，四種說邊，四說異事，六說無求三昧。",
        "translation": "The view of self is to be differentiated as eighteen: four are said to be self in four samdhis, four are said to be extremes in four ways, four are said to be di›erences, and six are said to be the samadhi of no",
        "source": "T13n0397_022:0158b26_0"
    },
    {
        "source_sentence": "是名六十二見。",
        "translation": "These are called the sixty-two views.",
        "source": "T13n0397_022:0158b27_1"
    },
    {
        "source_sentence": "二十我見因緣，能生四百四種煩惱，為離如是諸煩惱故，觀於身心是名法行，",
        "translation": "Twenty-four kinds of defilement can arise because of the causes and conditions of self-view. In order to be freed from these defilements, contemplation of body and mind is called ‘practice of the doctrine’.",
        "source": "T13n0397_022:0158b27_2"
    },
    {
        "source_sentence": "如是比丘能觀身心。",
        "translation": "Thus, a monk can observe body and mind.",
        "source": "T13n0397_022:0158b29_3"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0158c01_4"
    },
    {
        "source_sentence": "云何八人？",
        "translation": "What are the eight?",
        "source": "T13n0397_022:0158c01_5"
    },
    {
        "source_sentence": "云何決定？",
        "translation": "How are they determined?",
        "source": "T13n0397_022:0158c01_6"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0158c01_7"
    },
    {
        "source_sentence": "斷見之人言一念斷，常見之人言八忍斷，是二種人俱得決定，後離煩惱俱亦無妨。",
        "translation": "When someone who stops views says one thought is stopped, and a common person says eight tolerances are stopped, these two kinds of people attain certainty together, and there's no obstruction if they part with the afflictions later.",
        "source": "T13n0397_022:0158c02_0"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0158c03_1"
    },
    {
        "source_sentence": "能得八忍是名八人，得十六心是名決定，是名如法。",
        "translation": "Being able to attain eight tolerances is called an eighth person, and attaining sixteen mental states is called certainty, which is called following the teaching.",
        "source": "T13n0397_022:0158c04_2"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0158c05_3"
    },
    {
        "source_sentence": "若有比丘成出入息，即得八人名，亦名決定。",
        "translation": "If a monk accomplishes the names of eight people when he exits and inhales, it's also called certainty.",
        "source": "T13n0397_022:0158c05_4"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0158c06_5"
    },
    {
        "source_sentence": "若有比丘成就數息，即得信根乃至慧根。",
        "translation": "If a monk accomplishes the number of breaths, he'll attain the faculty of faith and even the faculty of wisdom.",
        "source": "T13n0397_022:0158c06_6"
    },
    {
        "source_sentence": "若得五根，即得世間第一法。",
        "translation": "If someone attains the five faculties, they'll attain the first worldly dharma.",
        "source": "T13n0397_022:0158c07_7"
    },
    {
        "source_sentence": "如是比丘，能破一切疑網之心，是名真實修集聖行。",
        "translation": "Such a monk who can break through all the webs of doubt is called someone who truly cultivates noble practices.",
        "source": "T13n0397_022:0158c08_8"
    },
    {
        "source_sentence": "若有比丘成就苦智，則斷十種煩惱，是名修初無漏心觀。",
        "translation": "If a monk has accomplished the knowledge of suffering and then stops ten kinds of afflictions, this is called cultivating the first uncontaminated mental contemplation.",
        "source": "T13n0397_022:0158c09_9"
    },
    {
        "source_sentence": "爾時，次第觀無願三昧，觀無願時修三十七助道之法，是名無漏定智，",
        "translation": "At that point, he's observing the concentration of wishlessness in order and cultivating the thirty-seven factors that aid in the path when observing wishlessness, which are called uncontaminated concentration and wisdom.",
        "source": "T13n0397_022:0158c10_10"
    },
    {
        "source_sentence": "得苦法忍、苦法智、集法忍、集法智。",
        "translation": "They attain the tolerance of suffering as a dharma, the cognition of suffering as a dharma, the tolerance of accumulation as a dharma, and the cognition of accumulation as a dharma.",
        "source": "T13n0397_022:0158c12_11"
    },
    {
        "source_sentence": "爾時，觀於色界五陰、無色界四陰，如欲界苦，色無色界亦復如是。",
        "translation": "At that point, he observes the five aggregates in the form realm and the four aggregates in the formless realm as suffering in the desire realm, and so it is with the form and formless realms.",
        "source": "T13n0397_022:0158c13_12"
    },
    {
        "source_sentence": "如是觀已，斷色無色十八種煩惱。",
        "translation": "Having observed them in this way, he stops the 18 kinds of afflictions of form and formlessness.",
        "source": "T13n0397_022:0158c14_13"
    },
    {
        "source_sentence": "十八種斷已，作是思惟：『如是諸苦從何業來？",
        "translation": "Having eliminated these 18 kinds, he thinks, 'Where did this kind of suffering come from?'",
        "source": "T13n0397_022:0158c15_14"
    },
    {
        "source_sentence": "誰之所造？』",
        "translation": "Who created it?'",
        "source": "T13n0397_022:0158c16_15"
    },
    {
        "source_sentence": "作是觀已，了知『是苦從愛因緣，我若不拔如是愛根必當生苦。』",
        "translation": "After observing this, he knows that it's painful because of the causes and conditions of craving, and if I don't pull out such a root of craving, pain will surely arise.'",
        "source": "T13n0397_022:0158c16_16"
    },
    {
        "source_sentence": "是故觀集。",
        "translation": "Therefore, it's the collection of contemplation.",
        "source": "T13n0397_022:0158c18_17"
    },
    {
        "source_sentence": "作是觀已，斷七煩惱。",
        "translation": "After observing this, he stops the seven afflictions.",
        "source": "T13n0397_022:0158c18_18"
    },
    {
        "source_sentence": "觀欲界集已，色無色界亦復如是。",
        "translation": "After observing the accumulation in the desire realm, it's likewise in the form and formless realms.",
        "source": "T13n0397_022:0158c19_19"
    },
    {
        "source_sentence": "如是觀已，得比忍、比智，作是觀時斷十二煩惱。",
        "translation": "After observing it this way, he attains the twelve afflictions of comparative tolerance and comparative cognition that are stopped when he observes it.",
        "source": "T13n0397_022:0158c19_20"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0158c20_21"
    },
    {
        "source_sentence": "具八忍者是名見法，斷三界集已，復作是觀：何因緣故斷於苦集？",
        "translation": "Having abandoned the arising of the three realms, he further observes: What is the reason for abandoning the arising of frustration?",
        "source": "T13n0397_022:0158c21_22"
    },
    {
        "source_sentence": "為安樂故，夫安樂者即是滅諦。",
        "translation": "For the sake of well-being, well-being is the truth of cessation.",
        "source": "T13n0397_022:0158c22_23"
    },
    {
        "source_sentence": "爾時，初觀欲界滅諦，得滅法忍，斷七煩惱，色無色界亦復如是。",
        "translation": "At that point, the first observes the truth of cessation in the realm of sexual passion, acquires patience regarding the law in relation to cessation and abandons seven defilements. The same applies to the realm of form and to the one of",
        "source": "T13n0397_022:0158c23_24"
    },
    {
        "source_sentence": "作是觀已，得滅比忍，滅十二煩惱。",
        "translation": "After observing this, he attains the comparative forbearance of cessation and extinguishes the twelve afflictions.",
        "source": "T13n0397_022:0158c24_25"
    },
    {
        "source_sentence": "復作是觀：何因緣故得是比忍？",
        "translation": "Again, he observes this: What are the causes and conditions for attaining this comparative tolerance?",
        "source": "T13n0397_022:0158c25_26"
    },
    {
        "source_sentence": "因修八道，以八正道力故，知欲界苦集滅諦，色無色界苦集滅諦。",
        "translation": "Because of the cultivation of eight paths, because of the power of the eightfold noble path, they know the truths of suffering, arising, and ceasing in the realm of desire and the truths of suffering, accumulation, and cessation in",
        "source": "T13n0397_022:0158c26_27"
    },
    {
        "source_sentence": "爾時次生道法忍，得已能斷八種煩惱。",
        "translation": "At that moment, patience regarding the law in relation to the path successively arises. Having acquired it, one is able to abandon eight forms of defilement.",
        "source": "T13n0397_022:0158c27_28"
    },
    {
        "source_sentence": "爾時，復觀色無色界，得道比忍，斷十四煩惱。",
        "translation": "At that point, he also observes the form and formless realms, attains the relative tolerance of the path, and ends the 14 afflictions.",
        "source": "T13n0397_022:0158c28_29"
    },
    {
        "source_sentence": "以修集故，遠離八十八種煩惱，是名決定得須陀洹果，是名十六心，是名必得菩提，",
        "translation": "Being free of the eighty-eight kinds of defilement by cultivating accumulation is called definitely attaining the fruit of stream entry. These are called the sixteen mental states, which are called certain to attain awakening.",
        "source": "T13n0397_022:0158c29_30"
    },
    {
        "source_sentence": "是七往來斷一切苦。",
        "translation": "These are the seven past and future afflictions that cut off all suffering.",
        "source": "T13n0397_022:0159a02_31"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0159a03_32"
    },
    {
        "source_sentence": "有人從信決定，有人從法決定，有人從一生得須陀洹果，乃至得阿羅漢。",
        "translation": "Some people are determined by faith, some are determined by the Dharma, and some attain the fruit of stream entry from one lifetime until they attain arhatship.",
        "source": "T13n0397_022:0159a03_33"
    },
    {
        "source_sentence": "有人入信根乃至慧根，有人修定，有人修慧，有人得初禪乃至四禪，入決定觀，",
        "translation": "Some people enter the faculty of faith up to the faculty of wisdom. Some develop concentration, some develop wisdom. Some attain the first trance up to the fourth trance and enter meditative absorption on certainty.",
        "source": "T13n0397_022:0159a05_34"
    },
    {
        "source_sentence": "觀一切行無常次第生滅，遠離一切凡夫之法。",
        "translation": "He observes that all conditioned things are impermanent, arise and cease in order, and is far removed from all the dharmas of worldlings.",
        "source": "T13n0397_022:0159a06_35"
    },
    {
        "source_sentence": "有人觀一切行無常苦空不淨，不得自在無有寂靜，從緣而生從緣而滅。",
        "translation": "Some people observe that all conditioned things are impermanent, painful, empty, and impure, don't attain mastery, lack quiescence, arise from conditions and cease from conditions.",
        "source": "T13n0397_022:0159a07_36"
    },
    {
        "source_sentence": "作是觀已，得寂靜滅諦，是名比丘如法而行。",
        "translation": "After observing this, he attains the noble truth of quiescence and cessation, which is called a monk who practices according to the teaching.",
        "source": "T13n0397_022:0159a09_37"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0159a10_38"
    },
    {
        "source_sentence": "如來了知一切眾生諸根利鈍，亦知一切眾生心性諸煩惱性，是名如來隨應眾生而為說法，",
        "translation": "The Tathāgata knows the sharpness and dullness of all sentient beings’ faculties, and he also knows the mental patterns and afflictive tendencies of all sentient beings. This is how the Tathāgata explains the Dharma to senti",
        "source": "T13n0397_022:0159a10_39"
    },
    {
        "source_sentence": "隨諸煩惱宣說對治，是故得名薩婆若智。",
        "translation": "Following the afflictions that are proclaimed as antidotes, it's therefore called sarvajña cognition.",
        "source": "T13n0397_022:0159a12_40"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0159a14_0"
    },
    {
        "source_sentence": "我涅槃後有諸弟子，受持如來十二部經，書寫讀誦，顛倒解義、顛倒宣說，",
        "translation": "“After my nirvana there will be disciples who preserve the twelve kinds of scriptures of the Tathāgata. They will write and recite them, mistakenly interpreting meanings and preaching them.",
        "source": "T13n0397_022:0159a14_1"
    },
    {
        "source_sentence": "以倒解說覆隱法藏，以覆法故名曇摩毱多。",
        "translation": "It's called Dharmagupta because it mistakenly explains that it covers the hidden treasure of the Dharma, and it's called Dharmagupta because it covers the Dharma.",
        "source": "T13n0397_022:0159a15_2"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0159a16_3"
    },
    {
        "source_sentence": "我涅槃後我諸弟子，受持如來十二部經讀誦書寫，而復讀誦書說外典，",
        "translation": "“After my nirvana we disciples will preserve the twelvefold scriptures of the Tathāgata, recite and copy them, and also recite and teach non-Buddhist scriptures.",
        "source": "T13n0397_022:0159a17_4"
    },
    {
        "source_sentence": "受有三世及以內外，破壞外道善解論義，說一切性悉得受戒，凡所問難悉能答對，",
        "translation": "There are three times of feeling and internal and external, destroying non-Buddhist doctrines that well understand the meaning of treatises. They teach that all beings by their own nature can receive the precepts. They are able to answer any question or difficulty",
        "source": "T13n0397_022:0159a18_5"
    },
    {
        "source_sentence": "是故名為薩婆帝婆。",
        "translation": "That's why it's called sarvadeva.",
        "source": "T13n0397_022:0159a20_6"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0159a21_7"
    },
    {
        "source_sentence": "我涅槃後我諸弟子，受持如來十二部經書寫讀誦，說無有我及以受者，",
        "translation": "“After my nirvana, the disciples of mine will preserve and recite the twelvefold scripture of the Tathāgata. They will teach that there is neither a self nor anyone else who receives it.",
        "source": "T13n0397_022:0159a21_8"
    },
    {
        "source_sentence": "轉諸煩惱猶如死屍，是故名為迦葉毘部。",
        "translation": "The turning of the afflictions is like a dead corpse, which is why it's called Kāśyapa-bhibhūmi.",
        "source": "T13n0397_022:0159a23_0"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0159a24_0"
    },
    {
        "source_sentence": "我涅槃後我諸弟子，受持如來十二部經，讀誦書寫，不作地相水火風相虛空識相，",
        "translation": "“After my nirvana we disciples will preserve the twelvefold scriptures of the Tathāgata, recite and copy them. They will not depict earth, water, fire, wind, space, space, or consciousness.",
        "source": "T13n0397_022:0159a24_1"
    },
    {
        "source_sentence": "是故名為彌沙塞部。",
        "translation": "That's why it's called the Miṣā塞 school.",
        "source": "T13n0397_022:0159a26_2"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0159a26_3"
    },
    {
        "source_sentence": "我涅槃後我諸弟子，受持如來十二部經，讀誦書寫，皆說有我不說空相，",
        "translation": "“After my nirvana, all of my disciples will preserve the twelve kinds of scriptures of the Tathāgata. They will recite and copy them; they will all teach that there is a self and not that I teach emptiness.",
        "source": "T13n0397_022:0159a26_4"
    },
    {
        "source_sentence": "猶如小兒，是故名為婆嗟富羅。",
        "translation": "It's like a small child; therefore, it's called Vātsīputrīya.",
        "source": "T13n0397_022:0159a28_5"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0159a29_6"
    },
    {
        "source_sentence": "我涅槃後我諸弟子，受持如來十二部經，讀誦書寫，廣博遍覽五部經書，",
        "translation": "“After my nirvana we disciples will preserve the twelvefold scriptures of the Tathāgata, recite and copy them, and extensively and thoroughly study the five collections of scriptures.",
        "source": "T13n0397_022:0159a29_7"
    },
    {
        "source_sentence": "是故名為摩訶僧祇。",
        "translation": "Therefore, it's called a great incalculable eon.",
        "source": "T13n0397_022:0159b02_8"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_022:0159b02_9"
    },
    {
        "source_sentence": "如是五部雖各別異，而皆不妨諸佛法界及大涅槃。",
        "translation": "Although each of these five divisions is distinct, it's not possible for all the buddhas in the Dharma realm and great nirvāṇa to do so.",
        "source": "T13n0397_022:0159b02_10"
    },
    {
        "source_sentence": "「云何名為隨於信行？",
        "translation": "What's called following the practice of faith?",
        "source": "T13n0397_022:0159b03_11"
    },
    {
        "source_sentence": "若信三寶具足信根，從信根因緣入於決定，得須陀洹果、斯陀含果、阿那含果，",
        "translation": "If someone believes that the Three Treasures are replete with the faculty of faith and enters certainty from the causes and conditions of the faculty of faith, they'll attain the fruit of stream entry, the fruit of once-returning, and",
        "source": "T13n0397_022:0159b04_12"
    },
    {
        "source_sentence": "過色無色界，得阿羅漢果。",
        "translation": "He goes beyond the form and formless realms and attains the fruit of arhatship.",
        "source": "T13n0397_022:0159b06_13"
    },
    {
        "source_sentence": "從信得解名信解脫，亦名一分，亦名身證，名慧解脫，是名隨信行。",
        "translation": "Attaining understanding from faith is called the liberation of faith, which is also called one part, and it's also called physical realization, which is called the liberation of wisdom, which is called the practice of following faith.",
        "source": "T13n0397_022:0159b06_14"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0159b08_15"
    },
    {
        "source_sentence": "云何名為隨於法行？",
        "translation": "What's called following the practice of the Dharma?",
        "source": "T13n0397_022:0159b08_16"
    },
    {
        "source_sentence": "若有從法入於決定，具足慧根，得須陀洹果、斯陀含果、阿那含果，過色無色界，",
        "translation": "If someone enters certainty from the teaching and possesses the faculty of wisdom, they'll attain the fruit of stream entry, the fruit of once-returning, and the fruit of non-returning, passing beyond the form and formless realms",
        "source": "T13n0397_022:0159b09_0"
    },
    {
        "source_sentence": "得阿羅漢果，是名見、到二分解脫，亦名身證慧得解脫，心得解脫得滅盡定，",
        "translation": "Attaining the fruit of arhatship is called seeing and arriving at the two liberations, which are also called attaining liberation through bodily realization and wisdom. The mind as liberated attains the concentration of cessation.",
        "source": "T13n0397_022:0159b10_1"
    },
    {
        "source_sentence": "是故名為二分解脫。",
        "translation": "Therefore, they're called the two liberations of disintegration.",
        "source": "T13n0397_022:0159b12_2"
    },
    {
        "source_sentence": "是名無學解脫，是名法行，是名成就觀身乃至成就法法觀，是名成就毘婆舍那及奢摩他。",
        "translation": "This is called accomplishing the contemplation body and even accomplishing the contemplation of principles and phenomena, which is called accomplishing vipaśyanā and śamatha.",
        "source": "T13n0397_022:0159b13_0"
    },
    {
        "source_sentence": "「云何名為奢摩他？",
        "translation": "What's called calming?",
        "source": "T13n0397_022:0159b15_1"
    },
    {
        "source_sentence": "奢摩他者，名之為滅。",
        "translation": "The cessation of quietude is called cessation.",
        "source": "T13n0397_022:0159b15_2"
    },
    {
        "source_sentence": "能滅貪心、瞋心、亂心，名奢摩他。",
        "translation": "It's called calming mind because it can cease craving, anger, and confusion.",
        "source": "T13n0397_022:0159b16_0"
    },
    {
        "source_sentence": "云何名為奢摩他相？",
        "translation": "What's called the characteristic of calmness?",
        "source": "T13n0397_022:0159b16_1"
    },
    {
        "source_sentence": "能滅貪相及瞋癡相，名奢摩他相。",
        "translation": "Being able to cease the characteristic of craving and the characteristic of anger and delusion is called the characteristic of calmness.",
        "source": "T13n0397_022:0159b17_2"
    },
    {
        "source_sentence": "云何名為隨奢摩他入於決定？",
        "translation": "What's called following calmness and entering into certainty?",
        "source": "T13n0397_022:0159b18_0"
    },
    {
        "source_sentence": "若能隨修舍摩他行，尊重讚歎，向奢摩他方便莊嚴，是則名為奢摩他相。",
        "translation": "If someone can cultivate the practice of calmness, venerate and praise it, and skillfully adorn themselves toward calmness, this is called the characteristic of calmness.",
        "source": "T13n0397_022:0159b18_1"
    },
    {
        "source_sentence": "若有比丘，深自思惟：『我之貪心唯觀不淨乃能壞之，瞋恚之心慈能壞之，",
        "translation": "Suppose there is a monk who deeply thinks to himself, “My mind of greed can only be destroyed by observing impurity, and it can be destroyed by being angry and compassionate.",
        "source": "T13n0397_022:0159b20_2"
    },
    {
        "source_sentence": "十二因緣能壞愚癡。』",
        "translation": "Twelve causes and conditions can destroy folly.'",
        "source": "T13n0397_022:0159b22_3"
    },
    {
        "source_sentence": "是名奢摩他相。",
        "translation": "This is called the characteristic of calmness.",
        "source": "T13n0397_022:0159b22_4"
    },
    {
        "source_sentence": "「云何名為毘婆舍那？",
        "translation": "What's called vipaśyanā?",
        "source": "T13n0397_022:0159b23_0"
    },
    {
        "source_sentence": "若修聖慧，能觀五陰次第生滅，是名毘婆舍那。",
        "translation": "If someone cultivates noble wisdom and can observe the sequential arising and ceasing of the five aggregates, this is called vipaśyanā.",
        "source": "T13n0397_022:0159b23_1"
    },
    {
        "source_sentence": "復次，若觀諸法皆如法性，實性實相真實了知，是名毘婆舍那。",
        "translation": "Furthermore, if someone observes all dharmas as they are by their Dharma nature and truly understands their true nature and true characteristics, this is called vipaśyanā.",
        "source": "T13n0397_022:0159b24_2"
    },
    {
        "source_sentence": "云何名為毘婆舍那相？",
        "translation": "What's called the mark of vipaśyanā?",
        "source": "T13n0397_022:0159b25_3"
    },
    {
        "source_sentence": "若能成就具足念心，觀一切行從緣而生從緣而滅，一切行無自在無作無受，",
        "translation": "If they can perfect the mind of complete mindfulness and observe all conditioned things that arise from conditions and cease from conditions, all conditioned things have no self-dependence, are unmanifest, are uncreated, and are without sensation.",
        "source": "T13n0397_022:0159b26_4"
    },
    {
        "source_sentence": "是名毘婆舍那相。",
        "translation": "This is called the mark of vipaśyanā.",
        "source": "T13n0397_022:0159b28_5"
    },
    {
        "source_sentence": "云何名為從毘婆舍那入於決定？",
        "translation": "What's called entering certainty from Vipaśyanā?",
        "source": "T13n0397_022:0159b28_6"
    },
    {
        "source_sentence": "至心念於毘婆舍那，恭敬尊重向莊嚴道，是名從毘婆舍那入於決定。",
        "translation": "To wholeheartedly contemplate Vipaśyanā and respectfully venerate and lead the path of adornment is called entering from Vipaśyanā into certainty.",
        "source": "T13n0397_022:0159b29_7"
    },
    {
        "source_sentence": "「云何名為出法攝心非滅法攝心？",
        "translation": "What's called the mind that produces dharmas that are collected and not the mind that are collected by cessation of dharmas?",
        "source": "T13n0397_022:0159c02_8"
    },
    {
        "source_sentence": "若比丘能觀心出因緣，乃至一切行出因緣，是名出法攝心非滅法攝心。",
        "translation": "If a monk can observe the causes and conditions for the mind's escape, up to the causes and conditions for the escape of all conditioned things, this is called the mind that exits the Dharma and doesn't cease the cessation of the Dharma.",
        "source": "T13n0397_022:0159c02_9"
    },
    {
        "source_sentence": "云何名為滅法攝心非出法攝心？",
        "translation": "What's called the mind that's collected by cessation of dharmas and not the mind that's collected by renunciation of dharmas?",
        "source": "T13n0397_022:0159c04_10"
    },
    {
        "source_sentence": "若比丘能深觀察滅心因緣，乃至一切行滅因緣，是名滅法攝心非出法攝心。",
        "translation": "If a monk can deeply observe the causes and conditions for the cessation of mind, up to the causes and conditions for the cessation of all conditioned things, this is called collecting the mind that ceases dharmas and not collecting the mind that",
        "source": "T13n0397_022:0159c05_11"
    },
    {
        "source_sentence": "云何名為非出法攝心非滅法攝心。",
        "translation": "What's called a mind that isn't included in the outflowing dharmas and not a mind that's included in the cessation dharmas?",
        "source": "T13n0397_022:0159c07_0"
    },
    {
        "source_sentence": "若比丘能觀心性眼性乃至識性，是名非出法攝心非滅法攝心。",
        "translation": "If a monk can observe the mind's nature, the eye nature and even the consciousness nature, this is called a mind that isn't included in the mind that doesn't emerge from the Dharma and not a mind that's included in the cessation",
        "source": "T13n0397_022:0159c07_1"
    },
    {
        "source_sentence": "「云何緣攝心非思惟攝心？",
        "translation": "What are the conditions that gather the mind and not the contemplation that collects the mind?",
        "source": "T13n0397_022:0159c09_2"
    },
    {
        "source_sentence": "若比丘能觀出息不觀入息，是名緣攝心非思惟攝心。",
        "translation": "If a monk observes exhaling and doesn't observe inhaling, this is called observing the mind that's collected by conditions and not contemplating the mind that's collected by contemplation.",
        "source": "T13n0397_022:0159c09_3"
    },
    {
        "source_sentence": "云何名為思惟攝心非緣攝心？",
        "translation": "What's called contemplating collecting the mind and not collecting the mind as a condition?",
        "source": "T13n0397_022:0159c11_4"
    },
    {
        "source_sentence": "若比丘觀於入息，是名思惟攝心非緣攝心。",
        "translation": "If a monk observes inhalation, this is called contemplating collecting the mind and not collecting the mind as a condition.",
        "source": "T13n0397_022:0159c11_5"
    },
    {
        "source_sentence": "云何名為非緣攝心非思惟攝心？",
        "translation": "What's called a mind that isn't conditioned by taking in what's collected and not contemplating what's collected?",
        "source": "T13n0397_022:0159c12_6"
    },
    {
        "source_sentence": "若比丘觀於心性眼性，乃至意性，是名非緣攝非思惟攝。",
        "translation": "If a monk observes the mind's nature as eye, or even the mind's nature as mind, this is called not taking in by conditions and not taking in by contemplation.",
        "source": "T13n0397_022:0159c13_7"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0159c15_0"
    },
    {
        "source_sentence": "若比丘能攝心者，則得八十諸三昧門，及修三解脫門。",
        "translation": "If a monk can collect his mind, then he'll attain the eighty samādhis and cultivate the three liberations.",
        "source": "T13n0397_022:0159c15_1"
    },
    {
        "source_sentence": "若比丘觀過去身，及修莊嚴，觀身見身，是名修無願解脫門。",
        "translation": "If a monk observes the body of the past and cultivates adornment, observing the body and seeing the body, this is called the liberation gate of cultivating wishlessness.",
        "source": "T13n0397_022:0159c16_2"
    },
    {
        "source_sentence": "若比丘觀過去身已，唯見於心而不見身，及修莊嚴觀身見身，是名修無相解脫門。",
        "translation": "If a monk observes the body of the past, sees only the mind and doesn't see the body, and cultivates adornment to observe the body and see the body, this is called the liberation gate of cultivating signlessness.",
        "source": "T13n0397_022:0159c17_3"
    },
    {
        "source_sentence": "若比丘觀過去身已，亦不見作及以作者，作者無身、身無作者，修莊嚴道觀身見身，",
        "translation": "“Furthermore, if a monk observes past bodies and doesn’t see what they are made or what they are made to be made. The creator has no body and the body has no creator. He cultivates the path of adornment and observes",
        "source": "T13n0397_022:0159c19_4"
    },
    {
        "source_sentence": "是名修空解脫門。",
        "translation": "This is called the liberation gate of cultivating emptiness.",
        "source": "T13n0397_022:0159c21_5"
    },
    {
        "source_sentence": "觀受心法亦如是。",
        "translation": "It's likewise with the mind and dharmas that are observed and received.",
        "source": "T13n0397_022:0159c22_6"
    },
    {
        "source_sentence": "「復次，憍陳如！",
        "translation": "Furthermore, Kauṇḍinya!",
        "source": "T13n0397_022:0159c22_7"
    },
    {
        "source_sentence": "三解脫門修莊嚴觀，觀一切行不出不滅，出已則滅滅無所至，不至去來，",
        "translation": "He cultivates the contemplation of adornment through the three doors of liberation, observing that all conditioned things neither arise nor cease. Having emerged, cessation and extinction have no bounds; they do not go or come",
        "source": "T13n0397_022:0159c22_8"
    },
    {
        "source_sentence": "是名莊嚴無願解脫門。",
        "translation": "This is called the liberation gate of adorning wishlessness.",
        "source": "T13n0397_022:0159c24_9"
    },
    {
        "source_sentence": "「復次，觀未來世諸行未出，若行未出則無有滅，是名莊嚴無願解脫門。",
        "translation": "“Furthermore, observing future actions that haven’t yet emerged and those that have not yet emerged without cessation is called the liberation gate of adorning wishlessness.",
        "source": "T13n0397_022:0159c25_0"
    },
    {
        "source_sentence": "不畢竟盡，畢竟盡者則無生滅，若無生滅即畢竟盡，若畢竟盡即空因緣，",
        "translation": "If there is no arising or ceasing, it exactly is the ultimate exhaustion. If there is an absolute exhaustion, it exactly is the cause and condition for emptiness.",
        "source": "T13n0397_022:0159c26_1"
    },
    {
        "source_sentence": "若如是觀畢竟盡者，是名莊嚴空解脫門。",
        "translation": "If such contemplation is ultimately exhausted, this is called the liberation gate of adorning emptiness.",
        "source": "T13n0397_022:0159c28_2"
    },
    {
        "source_sentence": "若觀諸行是畢竟盡即無生滅，若無生滅即無有空。",
        "translation": "If he observes that conditioned forces are ultimately exhausted, then there's no arising and ceasing, and if there's no arising and ceasing, then there's no emptiness.",
        "source": "T13n0397_022:0159c29_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_022:0160a01_4"
    },
    {
        "source_sentence": "先有後無，名之為空。",
        "translation": "The first exists and the last does not, which is called emptiness.",
        "source": "T13n0397_022:0160a01_5"
    },
    {
        "source_sentence": "若本無者，則無後無。",
        "translation": "If it were nonexistent in the beginning, there would be nonexistence and nonexistence afterwards.",
        "source": "T13n0397_022:0160a02_6"
    },
    {
        "source_sentence": "若無後無，云何名空？",
        "translation": "If there is nonexistence, then how can it be called emptiness?",
        "source": "T13n0397_022:0160a02_7"
    },
    {
        "source_sentence": "若無行者即是無為，畢竟盡者非是有為亦非無為，空亦非行亦非無行，",
        "translation": "If it is conditioned, then it is unconditioned. The ultimate exhaustion neither is conditioned nor unconditioned; emptiness neither is conditioned nor unconditioned.",
        "source": "T13n0397_022:0160a03_8"
    },
    {
        "source_sentence": "是故畢竟盡者非有為攝非無為攝，是名莊嚴無相解脫門。",
        "translation": "Therefore, it's called the liberation gate of adorning signlessness because what's ultimately exhausted isn't included in conditioned and isn't included in non-conditioned.",
        "source": "T13n0397_022:0160a04_9"
    },
    {
        "source_sentence": "若一切行畢竟盡者即是涅槃，非過去未來現在，是故非過去行滅名為涅槃，",
        "translation": "When all formations are absolutely extinguished, exactly this is nirvana. It is not past, future or present. That is why the cessation of what is not past formations is called nirvana.",
        "source": "T13n0397_022:0160a06_10"
    },
    {
        "source_sentence": "非未來現在行滅名為涅槃。",
        "translation": "It's not called nirvāṇa when future and present actions cease.",
        "source": "T13n0397_022:0160a07_11"
    },
    {
        "source_sentence": "須陀洹人見是涅槃，乃至阿羅漢人見是涅槃。",
        "translation": "A stream entrant sees it as nirvāṇa, and even an arhat sees it as nirvāṇa.",
        "source": "T13n0397_022:0160a08_12"
    },
    {
        "source_sentence": "「云何名苦諦？",
        "translation": "What's called the noble truth of suffering?",
        "source": "T13n0397_022:0160a09_13"
    },
    {
        "source_sentence": "觀一切行不見第一諦，觀一切因不見第二諦，觀一切滅不見第三諦，觀一切道不見第四諦。",
        "translation": "Observing all formations doesn't see the first truth, observing all causes doesn't see the second truth, observing all cessations doesn't see the third truth, and observing all paths doesn't see the fourth truth.",
        "source": "T13n0397_022:0160a09_14"
    },
    {
        "source_sentence": "「云何名生？",
        "translation": "What's called birth?",
        "source": "T13n0397_022:0160a12_15"
    },
    {
        "source_sentence": "本無後有，是名為生。",
        "translation": "The originally nonexistent and subsequently existent are called arising.",
        "source": "T13n0397_022:0160a12_16"
    },
    {
        "source_sentence": "云何名滅？",
        "translation": "What's called cessation?",
        "source": "T13n0397_022:0160a12_17"
    },
    {
        "source_sentence": "有已還無，是名為滅。",
        "translation": "After existing, it returns to nonexistence, which is called cessation.",
        "source": "T13n0397_022:0160a13_0"
    },
    {
        "source_sentence": "無有出滅，是名為盡。",
        "translation": "When there's no escape or cessation, this is called exhaustion.",
        "source": "T13n0397_022:0160a13_1"
    },
    {
        "source_sentence": "何因緣故？",
        "translation": "What are the reasons for this?",
        "source": "T13n0397_022:0160a13_2"
    },
    {
        "source_sentence": "無有出滅名之為道，道有六行，修非修，行非行，知非知。",
        "translation": "There are no paths of liberation or cessation that are called paths, and the path has six practices, which are cultivated or not cultivated, practiced or not practiced, and known or not known.",
        "source": "T13n0397_022:0160a14_3"
    },
    {
        "source_sentence": "若有比丘，能見如是生滅法者，是人能厭一切諸行，能見一切行無常相。",
        "translation": "If there are monks who can see such things as arising and ceasing, that person will be able to become disillusioned with all formations and be able to see the impermanent characteristics of all formations.",
        "source": "T13n0397_022:0160a15_4"
    },
    {
        "source_sentence": "「云何無常相非無常法？",
        "translation": "What are the characteristics of impermanence that are not impermanent dharmas?",
        "source": "T13n0397_022:0160a17_5"
    },
    {
        "source_sentence": "若有相雜初無漏根行，若有相雜無願解脫門行，若有空相苦相不淨相無我相，",
        "translation": "If there are characteristics of emptiness, characteristics of suffering, characteristics of impurity, and characteristics of selflessness, if there are characteristics of the first pure faculty with mixed characteristics, if there are",
        "source": "T13n0397_022:0160a17_6"
    },
    {
        "source_sentence": "是名無常相非無常法。",
        "translation": "These are called impermanent characteristics that aren't impermanent dharmas.",
        "source": "T13n0397_022:0160a19_7"
    },
    {
        "source_sentence": "云何無常法非無常相？",
        "translation": "What are impermanent dharmas that aren't impermanent characteristics?",
        "source": "T13n0397_022:0160a20_8"
    },
    {
        "source_sentence": "所謂三界色相乃至法相，是名倒相、是名捨相，非無常相，是名無常法非無常相。",
        "translation": "The so-called form characteristics of the three realms and even the characteristics of dharmas are called mistaken characteristics, equanimous characteristics, and not impermanent characteristics, which are called impermanent dhar",
        "source": "T13n0397_022:0160a20_9"
    },
    {
        "source_sentence": "云何無常相亦無常法？",
        "translation": "What are the characteristics of impermanence that are also impermanent dharmas?",
        "source": "T13n0397_022:0160a22_10"
    },
    {
        "source_sentence": "所謂一切眾生未得決定，以世俗道入諸三昧，隨法相忍，是名無常相亦無常法。",
        "translation": "It means that all sentient beings who haven't yet attained certainty enter samādhi with the conventional path and tolerate it according to the characteristics of things, which are called impermanent characteristics and impermanent dharmas.",
        "source": "T13n0397_022:0160a23_11"
    },
    {
        "source_sentence": "云何非無常相非無常法？",
        "translation": "What are the characteristics that are not impermanent and what are not impermanent qualities?",
        "source": "T13n0397_022:0160a24_12"
    },
    {
        "source_sentence": "所謂寂靜常相、解脫淨相，是名非無常相非無常法。",
        "translation": "The so-called eternal characteristic of quiescence and the pure characteristic of liberation are called what's not impermanent and what's not impermanent.",
        "source": "T13n0397_022:0160a25_13"
    },
    {
        "source_sentence": "「云何名為得第一諦？",
        "translation": "What's called attaining the first truth?",
        "source": "T13n0397_022:0160a26_14"
    },
    {
        "source_sentence": "所謂觀於六根五陰猶如鏡像，名得第一諦。",
        "translation": "The so-called contemplation of the five aggregates of the six faculties as mirror images is called the attainment of the first truth.",
        "source": "T13n0397_022:0160a27_15"
    },
    {
        "source_sentence": "「云何一心觀於四諦？",
        "translation": "What are the four noble truths of single-minded contemplation?",
        "source": "T13n0397_022:0160a28_16"
    },
    {
        "source_sentence": "若觀諸行悉是苦因，以苦因故可見可滅、可得遠離，如是名為心緣無漏，",
        "translation": "If one observes that conditioned forces are all causes of suffering, and that because of the causes of suffering they can be seen to cease and obtain detachment, this is called an uncontaminated mental supporting object.",
        "source": "T13n0397_022:0160a28_17"
    },
    {
        "source_sentence": "是故一心獲得四諦，名離有漏心得解脫。",
        "translation": "Because of this, the acquisition of four truths by one awareness is called ‘liberation of the mind free from impure influences’.",
        "source": "T13n0397_022:0160b01_18"
    },
    {
        "source_sentence": "若有比丘觀於心心，是名無願解脫門觀心心，已觀十二事：一者、業；",
        "translation": "If there is a monk who observes the mind and its mental states, this is called ‘ observing the mind and its states through the liberation gate of wishlessness.’ Having observed twelve things:",
        "source": "T13n0397_022:0160b02_19"
    },
    {
        "source_sentence": "二者、行；",
        "translation": "The second is conditioned.",
        "source": "T13n0397_022:0160b03_20"
    },
    {
        "source_sentence": "三者、苦；",
        "translation": "The third is suffering.",
        "source": "T13n0397_022:0160b04_0"
    },
    {
        "source_sentence": "四者、空；",
        "translation": "The fourth is emptiness.",
        "source": "T13n0397_022:0160b04_1"
    },
    {
        "source_sentence": "五者、壞；",
        "translation": "The fifth is disintegration.",
        "source": "T13n0397_022:0160b04_2"
    },
    {
        "source_sentence": "六者、不自在；",
        "translation": "The sixth is that they are not independent.",
        "source": "T13n0397_022:0160b04_3"
    },
    {
        "source_sentence": "七者、過去；",
        "translation": "The seventh is the past.",
        "source": "T13n0397_022:0160b04_4"
    },
    {
        "source_sentence": "八者、現在；",
        "translation": "The eighth is the present.",
        "source": "T13n0397_022:0160b05_5"
    },
    {
        "source_sentence": "九者、未來；",
        "translation": "The ninth is the future.",
        "source": "T13n0397_022:0160b05_6"
    },
    {
        "source_sentence": "十者、因緣；",
        "translation": "The tenth are causes and conditions.",
        "source": "T13n0397_022:0160b05_7"
    },
    {
        "source_sentence": "十一者、無作；",
        "translation": "The eleventh is that which is unmanifest.",
        "source": "T13n0397_022:0160b05_8"
    },
    {
        "source_sentence": "十二者、無受。",
        "translation": "12. The absence of sensation.",
        "source": "T13n0397_022:0160b06_9"
    },
    {
        "source_sentence": "是名見於心心，名無願解脫門。",
        "translation": "This is called the liberation gate of seeing mind and mind, which is called the liberation through wishlessness.",
        "source": "T13n0397_022:0160b06_10"
    },
    {
        "source_sentence": "「若有比丘觀察是心，無有心主無出入者，無能遠離無可遠離，是名見於心心得空解脫門。",
        "translation": "“Suppose a monk observes this mind, which has no mind as its subject and no entry or exit, and there’s no one who can get rid of it and no one who can get rid of it. This is called the liberation gate of empti",
        "source": "T13n0397_022:0160b07_11"
    },
    {
        "source_sentence": "若觀無有入定之心，而得遠離一切煩惱，無因緣故煩惱不生，是名遠離見於心心得無相解脫門。",
        "translation": "If someone observes that there's no mind that enters concentration and attains freedom from all afflictions, and the afflictions don't arise because there are no causes or conditions, this is called the liberation gate of being free of the markless",
        "source": "T13n0397_022:0160b09_12"
    },
    {
        "source_sentence": "若如是觀，即得遠離有漏之心，得無漏解脫。",
        "translation": "If someone observes it this way, they'll be freed from the contaminated mind and attain uncontaminated liberation.",
        "source": "T13n0397_022:0160b11_13"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0160b12_14"
    },
    {
        "source_sentence": "一切有為諸行無有決定，若不定者，云何而得入於定聚？",
        "translation": "All conditioned forces lack certainty. If they are not determined, how can one enter the state of concentration?",
        "source": "T13n0397_022:0160b12_15"
    },
    {
        "source_sentence": "若言觀察於三世已得入定聚者，是義不然。",
        "translation": "If someone says they've observed the three worlds and have entered the concentration class, this doesn't mean that they've entered the concentration class.",
        "source": "T13n0397_022:0160b14_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_022:0160b15_17"
    },
    {
        "source_sentence": "過去已盡，未來未出，現在無常，三世觀異，云何得入正定聚耶？",
        "translation": "The past has ended, the future has yet to emerge, the present is impermanent, and the three worlds are observed differently. How can one enter the class of right concentration?",
        "source": "T13n0397_022:0160b15_18"
    },
    {
        "source_sentence": "是故一切異觀性不決定。",
        "translation": "Therefore, the nature of all different contemplations isn't determined.",
        "source": "T13n0397_022:0160b17_0"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0160b17_1"
    },
    {
        "source_sentence": "譬如殿堂有四梯橙。",
        "translation": "It's like a hall with four ladders and an orange.",
        "source": "T13n0397_022:0160b17_2"
    },
    {
        "source_sentence": "若言不由初第一橙至四橙者，無有是處；",
        "translation": "If you claim that it does not proceed from the first orange up to the fourth, there is no reason for this.",
        "source": "T13n0397_022:0160b18_3"
    },
    {
        "source_sentence": "登初橙時亦不得名登第四已，如是四橙亦不名一。",
        "translation": "When ascending the first orange, it can't be called ascending the fourth, and thus these four oranges won't be called one.",
        "source": "T13n0397_022:0160b19_4"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0160b20_5"
    },
    {
        "source_sentence": "若是四諦即一諦者，可一心得。",
        "translation": "If these four truths are the same as one truth, then it is possible to have one awareness.",
        "source": "T13n0397_022:0160b20_6"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0160b21_7"
    },
    {
        "source_sentence": "觀時亦異、得時亦異。",
        "translation": "The time of contemplation is also different, and the time of attainment is also different.",
        "source": "T13n0397_022:0160b21_8"
    },
    {
        "source_sentence": "觀時異者，因果盡壞；",
        "translation": "When observing the difference in time, cause and effect completely disintegrate.",
        "source": "T13n0397_022:0160b21_9"
    },
    {
        "source_sentence": "得時異者，苦智集智滅智道智。",
        "translation": "“The moment of acquisition is different”: Knowledge of frustration, knowledge of the origin, knowledge of cessation and knowledge of the path.",
        "source": "T13n0397_022:0160b22_10"
    },
    {
        "source_sentence": "若有比丘觀行無常，是苦無我不淨無住，是漏結緣是一切有，是名繫縛。",
        "translation": "If a monk observes that conditioned phenomena are impermanent and that they are painful, selfless, impure, and nonabiding, this is called the contamination-binding condition that has all existences as its condition, which is called the",
        "source": "T13n0397_022:0160b23_11"
    },
    {
        "source_sentence": "是故不求諸陰諸行，厭一切行樂求涅槃，至心思惟涅槃功德，深樂寂靜不惜身命，",
        "translation": "Therefore they do not seek the aggregates or conditioned states of being, are disillusioned with all conditioned things, and delight in seeking nirvana. They concentrate their minds on the virtues of nirvana, deeply enjoying peace and",
        "source": "T13n0397_022:0160b24_12"
    },
    {
        "source_sentence": "修奢摩他毘婆舍那，是名比丘修集法行。",
        "translation": "Cultivating quietude and vision is called a monk who cultivates the practice of collecting the Dharma.",
        "source": "T13n0397_022:0160b26_13"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0160b27_14"
    },
    {
        "source_sentence": "云何比丘心能見心？",
        "translation": "How does a monk's mind see his mind?",
        "source": "T13n0397_022:0160b27_15"
    },
    {
        "source_sentence": "若有比丘能觀察心，心是無常是生滅法，是名比丘心能見心，如是比丘修空三昧。",
        "translation": "If a monk can observe that mind is impermanent and arises and ceases, this is called a monk whose mind can see mind, and such a monk cultivates the samādhi of emptiness.",
        "source": "T13n0397_022:0160b28_16"
    },
    {
        "source_sentence": "云何名空？",
        "translation": "What's called emptiness?",
        "source": "T13n0397_022:0160c01_17"
    },
    {
        "source_sentence": "陰入界空，諦空實空，十二因緣空，性空。",
        "translation": "The aggregates and sense-fields are emptiness, the truths are emptiness and real emptiness, the twelve causes and conditions are emptiness, and the nature is emptiness.",
        "source": "T13n0397_022:0160c01_18"
    },
    {
        "source_sentence": "云何陰空？",
        "translation": "What are the aggregates of emptiness?",
        "source": "T13n0397_022:0160c02_19"
    },
    {
        "source_sentence": "所謂色空無我我所，乃至識空無我我所，是名陰空；",
        "translation": "The so-called emptiness of form is without self and what belongs to self, up to the emptiness of consciousness is without self and what belongs to self - these are called ‘empty aggregates’.",
        "source": "T13n0397_022:0160c02_20"
    },
    {
        "source_sentence": "入界二空亦復如是。",
        "translation": "It's likewise with the two kinds of emptiness in the sense-entering realm.",
        "source": "T13n0397_022:0160c04_0"
    },
    {
        "source_sentence": "云何諦空？",
        "translation": "What is emptiness of the truths?",
        "source": "T13n0397_022:0160c04_1"
    },
    {
        "source_sentence": "所謂苦諦無得無捨，乃至道諦亦復如是。",
        "translation": "The so-called truth of suffering has neither attainment nor equanimity, and so it is with the truth of the path.",
        "source": "T13n0397_022:0160c04_2"
    },
    {
        "source_sentence": "云何實空？",
        "translation": "What is real emptiness?",
        "source": "T13n0397_022:0160c05_3"
    },
    {
        "source_sentence": "一切法中無有覺觀我及我所，是名實空。",
        "translation": "In all dharmas, there's no perception or contemplation of self and what belongs to self, which is called true emptiness.",
        "source": "T13n0397_022:0160c05_4"
    },
    {
        "source_sentence": "云何十二因緣空？",
        "translation": "What are the twelve causes and conditions for emptiness?",
        "source": "T13n0397_022:0160c06_5"
    },
    {
        "source_sentence": "十二因緣即是十二有支，觀十二支無我我所，是名十二因緣空。",
        "translation": "The twelve causes and conditions are the twelve components of existence, and observing that the twelve components lack self and what belongs to self is called the emptiness of the twelve causes and conditions.",
        "source": "T13n0397_022:0160c07_6"
    },
    {
        "source_sentence": "云何性空？",
        "translation": "What is emptiness by nature?",
        "source": "T13n0397_022:0160c08_7"
    },
    {
        "source_sentence": "若有比丘，觀於眼空無我我所，乃至意空亦復如是，是名法行能觀心心。",
        "translation": "If there's a monk who observes that the eye is empty of self and what belongs to self, and so is the mind empty of mind, this is called someone who practices the Dharma and can observe mind and mind.",
        "source": "T13n0397_022:0160c09_8"
    },
    {
        "source_sentence": "如是比丘不見眾生、壽命、士夫、某甲，知諸法性、真解世諦，為流布故說陰入界，",
        "translation": "Thus, a monk who doesn’t see sentient beings, life spans, men, or certain persons knows the nature of dharmas and truly understands the conventional truth. For the sake of spreading it, he explains the aggregates",
        "source": "T13n0397_022:0160c10_9"
    },
    {
        "source_sentence": "知一切法性無出滅。",
        "translation": "He knows that the nature of all dharmas has no escape or cessation.",
        "source": "T13n0397_022:0160c12_10"
    },
    {
        "source_sentence": "如是比丘能度生死，能知一切苦集滅道、能斷煩惱。",
        "translation": "Thus, a monk who can save sentient beings from birth and death knows all suffering, accumulation, cessation, paths, and the way to end afflictions.",
        "source": "T13n0397_022:0160c13_11"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0160c14_12"
    },
    {
        "source_sentence": "若有比丘修集法行，知一切法從因緣生從因緣滅。",
        "translation": "Suppose there's a monk who cultivates the practice of collecting dharmas and knows that all dharmas arise from causes and conditions and cease from causes and conditions.",
        "source": "T13n0397_022:0160c14_13"
    },
    {
        "source_sentence": "如是比丘得三解脫知色真相。",
        "translation": "Thus, a monk who has attained the three liberations knows the truth of form.",
        "source": "T13n0397_022:0160c15_14"
    },
    {
        "source_sentence": "色真相者，所謂礙相、受受相、想覺相、行行相、識知相，是名真知一切法相，",
        "translation": "The reality of form is the so-called characteristic of obstruction, the characteristic of feeling, the characteristic of sensation, the characteristic of perception, the characteristic of feeling, the characteristic of volition, and the characteristic of consciousness",
        "source": "T13n0397_022:0160c16_15"
    },
    {
        "source_sentence": "如是觀已得空解脫門；",
        "translation": "Having observed in this way, they attain the liberation gate of emptiness.",
        "source": "T13n0397_022:0160c18_16"
    },
    {
        "source_sentence": "見一切法無作受者壽命自在，唯見無常苦無我等，是名得無願解脫門；",
        "translation": "Those who see all things as uncreated receivers have sovereignty over their life spans, but they see only impermanence, suffering, selflessness, etc. This is called the acquisition of wishless liberation.",
        "source": "T13n0397_022:0160c18_17"
    },
    {
        "source_sentence": "觀一切法無生無滅，是名得無相解脫門。",
        "translation": "Observing that all things lack arising and ceasing is called the liberation gate of marklessness.",
        "source": "T13n0397_022:0160c20_18"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0160c21_19"
    },
    {
        "source_sentence": "法行比丘能得神通，無惡覺觀，口終不說四種惡過，無有鬪諍不聽惡言。",
        "translation": "A monk who practices the Dharma can attain supernormal powers, have no bad feelings or contemplations, never say four kinds of bad things in his mouth, and have no fighting or listening to bad words.",
        "source": "T13n0397_022:0160c21_20"
    },
    {
        "source_sentence": "爾時即得遠離五蓋、增五善根，是法行比丘獲得初禪。",
        "translation": "At that point, he'll be free of the five hindrances and increase the five good roots, and this monk who practices the Dharma will attain the first dhyāna.",
        "source": "T13n0397_022:0160c23_21"
    },
    {
        "source_sentence": "入初禪已欲得身通，繫心鼻端觀息入出，深見九萬九千毛孔息之出入。",
        "translation": "After entering the first dhyāna, he wants to attain bodily supernormal powers, ties his mind around the end of his nose and nose, observes breathing in and out, and deeply sees ninety-nine thousand pores of his",
        "source": "T13n0397_022:0160c24_22"
    },
    {
        "source_sentence": "見身悉空，乃至四大亦復如是。",
        "translation": "Seeing the body as completely empty, it's likewise with the four elements.",
        "source": "T13n0397_022:0160c26_23"
    },
    {
        "source_sentence": "如是觀已，遠離色相獲得神通，乃至四禪亦復如是。",
        "translation": "After observing it this way, he's far removed form and attained supernormal abilities, and so it's likewise with the fourth dhyāna.",
        "source": "T13n0397_022:0160c27_24"
    },
    {
        "source_sentence": "「云何法行比丘獲得眼通？",
        "translation": "How does a monk who practices the Dharma attain supernormal vision?",
        "source": "T13n0397_022:0160c28_25"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0160c28_26"
    },
    {
        "source_sentence": "若有比丘觀息出入真實見色，既見色已作是思惟：『如我所見三世諸色，",
        "translation": "Suppose there is a monk who, observing breathing in and out, perceives form as it really is. Having seen form, he thinks:",
        "source": "T13n0397_022:0160c29_27"
    },
    {
        "source_sentence": "意欲得見隨意即見。』",
        "translation": "They want to see what they want, and they'll see it as they wish.'",
        "source": "T13n0397_022:0161a01_28"
    },
    {
        "source_sentence": "乃至四禪亦復如是。",
        "translation": "It's likewise with the fourth dhyāna.",
        "source": "T13n0397_022:0161a02_29"
    },
    {
        "source_sentence": "「云何法行比丘得天耳通？",
        "translation": "How does a monk who practices the Dharma attain divine hearing?",
        "source": "T13n0397_022:0161a02_30"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0161a03_31"
    },
    {
        "source_sentence": "若有比丘得初禪時，觀息出入已次第觀聲，乃至四禪亦復如是。",
        "translation": "Suppose a monk at the time of the first trance observes breathing, going in and out, and after observing sounds one after another. The same applies up to the fourth trance.",
        "source": "T13n0397_022:0161a03_32"
    },
    {
        "source_sentence": "「云何法行比丘得他心智？",
        "translation": "How does a monk who practices the Dharma attain knowledge of the minds of others?",
        "source": "T13n0397_022:0161a05_0"
    },
    {
        "source_sentence": "若有比丘觀息出入得初禪時，修奢摩他毘婆舍那，是名他心智，乃至四禪亦復如是。",
        "translation": "If a monk observes breathing in and out when he attains the first dhyāna and cultivates quietude and vipaśyanā, this is called knowledge of the minds of others, and so it's likewise with the fourth dhy",
        "source": "T13n0397_022:0161a05_1"
    },
    {
        "source_sentence": "「云何法行比丘得宿命智？",
        "translation": "How does a monk who practices the Dharma attain knowledge of past lives?",
        "source": "T13n0397_022:0161a07_2"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0161a08_3"
    },
    {
        "source_sentence": "若有比丘觀息出入，得初禪時獲得眼通，得眼通已，觀於初有迦羅羅時，",
        "translation": "Suppose there is a monk who, observing breathing in and breathing out, acquires vision at the moment of the first trance. Having acquired vision at the moment when he observes the initial existence of a kalala,",
        "source": "T13n0397_022:0161a08_4"
    },
    {
        "source_sentence": "乃至五陰生滅、無量劫中五陰生滅，乃至四禪亦復如是。",
        "translation": "It's likewise with the arising and ceasing of the five aggregates and the arising and ceasing of the five aggregates in measureless eons, up to the fourth dhyāna.",
        "source": "T13n0397_022:0161a10_5"
    },
    {
        "source_sentence": "「所言禪者何故名禪？",
        "translation": "What's called meditation? Why is it called meditation?",
        "source": "T13n0397_022:0161a11_6"
    },
    {
        "source_sentence": "疾故名禪，疾大疾，住大住，靜寂靜，觀滅遠離是名為禪。",
        "translation": "It's called meditation because of its illness, and it's called meditation when he's sick and greatly ill, abiding in great abiding, being calm and tranquil, observing cessation and seclusion is called meditation.",
        "source": "T13n0397_022:0161a11_7"
    },
    {
        "source_sentence": "初禪者亦名具足，亦名遠離。",
        "translation": "The first trance is also called ‘with fulfilment’. It is also called ‘seclusion’.",
        "source": "T13n0397_022:0161a13_8"
    },
    {
        "source_sentence": "云何具足？",
        "translation": "How are they complete?",
        "source": "T13n0397_022:0161a13_9"
    },
    {
        "source_sentence": "云何遠離？",
        "translation": "How are they separated?",
        "source": "T13n0397_022:0161a14_10"
    },
    {
        "source_sentence": "言遠離者，遠離五蓋。",
        "translation": "The expression'remote' means to be far removed from the five hindrances.",
        "source": "T13n0397_022:0161a14_11"
    },
    {
        "source_sentence": "言具足者，具足五支，所謂覺、觀、喜、安、定。",
        "translation": "When it's called complete, it's the five components are complete, which are called feeling, contemplation, joy, peace, and concentration.",
        "source": "T13n0397_022:0161a14_12"
    },
    {
        "source_sentence": "云何名覺？",
        "translation": "What's called awakening?",
        "source": "T13n0397_022:0161a15_13"
    },
    {
        "source_sentence": "如心覺大覺、思惟大思惟，觀於心性是名為覺。",
        "translation": "Just as the mind perceives great enlightenment and contemplates great reflection, observing the mind's nature is called perception.",
        "source": "T13n0397_022:0161a16_0"
    },
    {
        "source_sentence": "云何名觀？",
        "translation": "What's called contemplation?",
        "source": "T13n0397_022:0161a17_1"
    },
    {
        "source_sentence": "若觀心行大行遍行隨意，是名為觀。",
        "translation": "If he observes the mind's great practice of pervasively practicing mental action, this is called contemplation.",
        "source": "T13n0397_022:0161a17_2"
    },
    {
        "source_sentence": "云何為喜？",
        "translation": "What is joy?",
        "source": "T13n0397_022:0161a18_3"
    },
    {
        "source_sentence": "如真實知大知心動至心，是名為喜。",
        "translation": "Knowing the mind as it really is and greatly knowing the mind's movement to concentrate on the mind, this is called joy.",
        "source": "T13n0397_022:0161a18_4"
    },
    {
        "source_sentence": "云何為安？",
        "translation": "What's peace?",
        "source": "T13n0397_022:0161a19_5"
    },
    {
        "source_sentence": "所謂身安心安受安，受於樂觸，是名為安。",
        "translation": "The so-called body that's peaceful and experiences peace, and feeling pleasant sensations are called peace.",
        "source": "T13n0397_022:0161a19_6"
    },
    {
        "source_sentence": "云何為定？",
        "translation": "What's concentration?",
        "source": "T13n0397_022:0161a20_7"
    },
    {
        "source_sentence": "若心住大住不亂，於緣不謬無有顛倒，是名為定。",
        "translation": "If the mind abides in a great abode and isn't disturbed, and there's no mistakenness about conditions, this is called concentration.",
        "source": "T13n0397_022:0161a20_8"
    },
    {
        "source_sentence": "第二禪者，同離五事，所謂五蓋，具足三支：一喜、二安、三定。",
        "translation": "The so-called five hindrances are supplied with three members: one is satisfaction, two are peace and three are samdhi.",
        "source": "T13n0397_022:0161a22_0"
    },
    {
        "source_sentence": "入第三禪，亦離五事，具足五支：一者、念；",
        "translation": "Entering the third trance, they are also free from five things. They are supplied with five members:",
        "source": "T13n0397_022:0161a23_1"
    },
    {
        "source_sentence": "二者、捨；",
        "translation": "The second is equanimity.",
        "source": "T13n0397_022:0161a24_2"
    },
    {
        "source_sentence": "三者、慧；",
        "translation": "The third is wisdom.",
        "source": "T13n0397_022:0161a24_3"
    },
    {
        "source_sentence": "四者、安；",
        "translation": "The fourth is peace.",
        "source": "T13n0397_022:0161a24_4"
    },
    {
        "source_sentence": "五者、定。",
        "translation": "5. concentration.",
        "source": "T13n0397_022:0161a24_5"
    },
    {
        "source_sentence": "入第四禪，亦離五事，具足四支：一者、念；",
        "translation": "Entering the fourth trance, they are also free from five things. They are supplied with four members:",
        "source": "T13n0397_022:0161a25_0"
    },
    {
        "source_sentence": "二者、捨；",
        "translation": "The second is equanimity.",
        "source": "T13n0397_022:0161a25_1"
    },
    {
        "source_sentence": "三者、不苦不樂；",
        "translation": "The third is that they are neither painful nor pleasant.",
        "source": "T13n0397_022:0161a26_2"
    },
    {
        "source_sentence": "四者、定。",
        "translation": "4. concentration.",
        "source": "T13n0397_022:0161a26_3"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0161a26_4"
    },
    {
        "source_sentence": "若有比丘具足四禪，是名法行。",
        "translation": "If a monk is endowed with the fourth meditative state of absorption, this is called religious practice.",
        "source": "T13n0397_022:0161a26_5"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0161a27_6"
    },
    {
        "source_sentence": "若有比丘觀身厭患，遠離身相一切身觸喜觸樂觸，分別色陰遠離色陰，",
        "translation": "“Suppose a monk observes that the body is disillusioned with distancing himself from all bodily characteristics, physical contact, delights in touching and enjoys touching, and discriminates form aggregates as form aggregates by",
        "source": "T13n0397_022:0161a27_7"
    },
    {
        "source_sentence": "觀無量空處，是名法行比丘入空處定，是名比丘修集法行。",
        "translation": "To contemplate the sphere of immeasurable emptiness is called a monk who practices the Dharma and enters the concentration of the sphere of emptiness, which is called a monk cultivating the practice of accumulating the Dharma.",
        "source": "T13n0397_022:0161a29_8"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0161b01_9"
    },
    {
        "source_sentence": "云何比丘得識處定？",
        "translation": "How does a monk attain the concentration of the locus of consciousness?",
        "source": "T13n0397_022:0161b02_0"
    },
    {
        "source_sentence": "若有比丘修舍摩他、毘婆舍那，觀心意識，自知此身不受，知三受已，",
        "translation": "“Suppose there is a monk who, while practicing calm abiding or insight, observes the mind and its states of consciousness. He knows for himself that this body is not undergoing these three sensations and knows that after undergoing them,",
        "source": "T13n0397_022:0161b02_1"
    },
    {
        "source_sentence": "得遠離是三種受，是故名為得識處定，是名法行。",
        "translation": "Attaining separation from these three kinds of sensation is therefore called attaining the concentration of the consciousness realm, which is called the Dharma practice.",
        "source": "T13n0397_022:0161b04_2"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0161b05_3"
    },
    {
        "source_sentence": "云何比丘得少識處定？",
        "translation": "How does a monk attain the concentration of the sphere of little consciousness?",
        "source": "T13n0397_022:0161b05_4"
    },
    {
        "source_sentence": "若有比丘觀三世空，知一切法行亦生亦滅，空處識處亦生亦滅，作是觀已次第觀識：我今觀識亦非識非非識，",
        "translation": "“Furthermore, if a monk observes the emptiness of all times and knows that all formations of dharmas arise and cease at the same time, and so do the spacelike consciousnesses arise and cease at the same",
        "source": "T13n0397_022:0161b05_5"
    },
    {
        "source_sentence": "若非識者是名寂靜。",
        "translation": "If it's not consciousness, then it's called quiescence.",
        "source": "T13n0397_022:0161b08_6"
    },
    {
        "source_sentence": "我今云何永斷此識？",
        "translation": "How can I now permanently eliminate this consciousness?",
        "source": "T13n0397_022:0161b08_7"
    },
    {
        "source_sentence": "作是觀已得少識處，是名比丘得少識處定。",
        "translation": "After observing this, he attains the sphere of little consciousness, which is called a monk who has attained the concentration of the sphere of little consciousness.",
        "source": "T13n0397_022:0161b09_8"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0161b10_9"
    },
    {
        "source_sentence": "云何比丘獲得非想非非想定？",
        "translation": "How does a monk attain the concentration of neither perception nor non-perception?",
        "source": "T13n0397_022:0161b10_10"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0161b11_11"
    },
    {
        "source_sentence": "若有比丘有非心想，作是順忍：『我今此想是苦是漏、是瘡是癕、是不寂靜。",
        "translation": "Suppose a monk has an ideation that’s not mind and makes this kind of obedient tolerance: ‘Now, this ideation of self is painful because it’s contaminated, sores because it’s coarse, and not quiescent.",
        "source": "T13n0397_022:0161b11_12"
    },
    {
        "source_sentence": "若我能斷如是非想及非非想，是名寂靜。』",
        "translation": "If I can stop what's perceived as right or wrong and what's perceived as right, this is called quiescence.'",
        "source": "T13n0397_022:0161b13_13"
    },
    {
        "source_sentence": "若有比丘，能斷如是非想非非想，是名獲得無想解脫門。",
        "translation": "If there are monks who can cut off such thoughts as right and wrong, and neither right nor wrong, is called attaining the liberation gate of thoughtlessness.",
        "source": "T13n0397_022:0161b14_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_022:0161b15_15"
    },
    {
        "source_sentence": "法行比丘作是思惟：『若有受想、若有識想、若有觸想、若有空、若有識、若有非想非非想，",
        "translation": "The bhikṣus who practiced the doctrine thought: If there is perception of feeling, perception of consciousness, perception of touch, perception of emptiness, perception of consciousness, and neither perception nor non-per",
        "source": "T13n0397_022:0161b15_16"
    },
    {
        "source_sentence": "如是等想名為麁想。",
        "translation": "Such conceptions are called crude conceptions.",
        "source": "T13n0397_022:0161b17_17"
    },
    {
        "source_sentence": "我今若修無想三昧，則能永斷如是等想。』",
        "translation": "Now, if I cultivate the samādhi of no-thought, I'll be able to permanently end such thoughts.'",
        "source": "T13n0397_022:0161b18_18"
    },
    {
        "source_sentence": "是故見於非想非非想為寂靜處，如是見已，入非想非非想定。",
        "translation": "Therefore, seeing what's neither perception nor non-perception as a place of quiescence and having seen it in this way, he enters the concentration that's neither perception nor non-perception.",
        "source": "T13n0397_022:0161b19_19"
    },
    {
        "source_sentence": "「若得非想非非想定已，不愛不貪能破無明，破無明已，名為獲得阿羅漢果。",
        "translation": "If someone attains neither perception nor non-perception, neither perception nor non-perception, and doesn't crave or desire to break through ignorance, and after breaking through ignorance, they'll attain the fruit of the arhat",
        "source": "T13n0397_022:0161b20_20"
    },
    {
        "source_sentence": "前三種定，二道所斷；",
        "translation": "The first three states of absorption are to be abandoned through the two paths.",
        "source": "T13n0397_022:0161b22_21"
    },
    {
        "source_sentence": "後第四定，終不可以世俗道斷。",
        "translation": "In the latter fourth absorption, they can never be abandoned through the worldly path.",
        "source": "T13n0397_022:0161b22_22"
    },
    {
        "source_sentence": "凡夫離於非想非非想處，無麁煩惱，亦有十法，所謂：一受、二想、三行、四觸、五思惟、六欲、七解、八念、九定、十慧。",
        "translation": "Ordinary people who are free of anger and affliction in the sphere of neither perception nor non-perception have ten things: (1) sensation, (2) perception, (3) volition, (4) touch, (5) attention, (6) desire, (7) resolve, (8) mindfulness,",
        "source": "T13n0397_022:0161b23_23"
    },
    {
        "source_sentence": "云何為受？",
        "translation": "What is sensation?",
        "source": "T13n0397_022:0161b26_24"
    },
    {
        "source_sentence": "所謂識受。",
        "translation": "It's called consciousness and sensation.",
        "source": "T13n0397_022:0161b26_25"
    },
    {
        "source_sentence": "云何為想？",
        "translation": "What's perception?",
        "source": "T13n0397_022:0161b26_26"
    },
    {
        "source_sentence": "所謂識想。",
        "translation": "It's called consciousness and perception.",
        "source": "T13n0397_022:0161b26_27"
    },
    {
        "source_sentence": "云何為行？",
        "translation": "What's practice?",
        "source": "T13n0397_022:0161b27_28"
    },
    {
        "source_sentence": "所謂法行。",
        "translation": "It's called the practice of the Dharma.",
        "source": "T13n0397_022:0161b27_29"
    },
    {
        "source_sentence": "云何為觸？",
        "translation": "What is contact?",
        "source": "T13n0397_022:0161b27_30"
    },
    {
        "source_sentence": "所謂意觸。",
        "translation": "It's called mental contact.",
        "source": "T13n0397_022:0161b27_31"
    },
    {
        "source_sentence": "云何為思？",
        "translation": "What's thought?",
        "source": "T13n0397_022:0161b28_32"
    },
    {
        "source_sentence": "所謂法思。",
        "translation": "It's called contemplation of the Dharma.",
        "source": "T13n0397_022:0161b28_33"
    },
    {
        "source_sentence": "云何為欲？",
        "translation": "What's desire?",
        "source": "T13n0397_022:0161b28_34"
    },
    {
        "source_sentence": "所謂欲入出定。",
        "translation": "It's called the concentration of wanting to enter and exit.",
        "source": "T13n0397_022:0161b28_35"
    },
    {
        "source_sentence": "云何為解？",
        "translation": "What's understanding?",
        "source": "T13n0397_022:0161b29_36"
    },
    {
        "source_sentence": "所謂法解。",
        "translation": "It's called understanding the teaching.",
        "source": "T13n0397_022:0161b29_37"
    },
    {
        "source_sentence": "云何為念？",
        "translation": "What's mindfulness?",
        "source": "T13n0397_022:0161b29_38"
    },
    {
        "source_sentence": "所謂念三昧。",
        "translation": "It's called mindfulness samādhi.",
        "source": "T13n0397_022:0161b29_39"
    },
    {
        "source_sentence": "云何為定？",
        "translation": "What's concentration?",
        "source": "T13n0397_022:0161c01_40"
    },
    {
        "source_sentence": "所謂心如法住。",
        "translation": "It's called the mind abiding according to the teaching.",
        "source": "T13n0397_022:0161c01_41"
    },
    {
        "source_sentence": "云何為慧？",
        "translation": "What is wisdom?",
        "source": "T13n0397_022:0161c01_42"
    },
    {
        "source_sentence": "所謂慧根慧力，觀向四果行，乃至得阿羅漢果，觀於生滅及空三昧，觀於四大如四毒蛇。",
        "translation": "It's called the wisdom faculty of wisdom and the power of wisdom, which contemplates the four fruitful actions up to the attainment of arhatship, observes birth and cessation and the samādhi of emptiness, and observes the",
        "source": "T13n0397_022:0161c02_43"
    },
    {
        "source_sentence": "如是十法，第四空處具足而有，以其無有麁煩惱故，一切凡夫謂是涅槃。",
        "translation": "Thus, these ten dharmas exist in the fourth sphere of emptiness because they are not accompanied by anger or defilement. All worldlings think that this is nirvana.",
        "source": "T13n0397_022:0161c04_44"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0161c05_45"
    },
    {
        "source_sentence": "若有比丘修集聖道，厭離四禪及四空處，觀於滅定莊嚴之道，作是思惟：『諸出入息悉是無常，",
        "translation": "Suppose there is a monk who, while practicing the holy path of accumulation, is disillusioned with the four meditations and the four spheres of infinite space. Observing the path adorned by cessation and concentration, he thinks",
        "source": "T13n0397_022:0161c06_46"
    },
    {
        "source_sentence": "我若能斷出入息者，即是安樂。』",
        "translation": "If I can stop exhaling and inhaling, it's peaceful.'",
        "source": "T13n0397_022:0161c08_47"
    },
    {
        "source_sentence": "是故一切諸行因緣悉滅，受滅乃至慧滅，覺觀滅故，陰入界滅、貪恚癡滅、一切心數法滅、一切非心數法亦滅，",
        "translation": "Therefore, all the causes and conditions for conditioned forces are completely extinguished, sensation is extinguished... wisdom is extinguished, feelings and perceptions are extinguished, aggregates and sense-fields are extinguished,",
        "source": "T13n0397_022:0161c08_48"
    },
    {
        "source_sentence": "是名不與凡夫共法，非是世法是無學法。",
        "translation": "This is called a teaching that's not shared with worldlings, which isn't worldly dharmas or post-learning dharmas.",
        "source": "T13n0397_022:0161c11_49"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0161c12_50"
    },
    {
        "source_sentence": "若須陀洹、斯陀含，終不能得如是滅定。",
        "translation": "If he were a stream entrant or once-returner, he wouldn't be able to attain this concentration of cessation.",
        "source": "T13n0397_022:0161c12_51"
    },
    {
        "source_sentence": "若次第得須陀洹果，亦不能得，若須陀洹捨是身已，得阿羅漢果，亦不能得。",
        "translation": "If he sequentially attains the fruit of stream entry, he can't attain it, and if stream entry abandons this body, he can't attain the fruit of arhatship after attaining it.",
        "source": "T13n0397_022:0161c13_52"
    },
    {
        "source_sentence": "若有具足八解脫者，是人能得。",
        "translation": "If someone is endowed with the eight liberations, they'll be able to attain them.",
        "source": "T13n0397_022:0161c15_53"
    },
    {
        "source_sentence": "「憍陳如！",
        "translation": "Kauṇḍinya thus!",
        "source": "T13n0397_022:0161c16_0"
    },
    {
        "source_sentence": "若使如來窮劫盡劫說是法目陀羅尼法乃能窮盡，是名法無礙智。",
        "translation": "If the Tathāgata explains this dharma-mouth dhāraṇī teaching for an entire eon, then he'll be able to exhaust it, which is called unhindered knowledge of the Dharma.",
        "source": "T13n0397_022:0161c16_1"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0161c17_2"
    },
    {
        "source_sentence": "如是法目陀羅尼者，不可思議。",
        "translation": "Such a dharma-mouth dhāraṇī is inconceivable.",
        "source": "T13n0397_022:0161c17_3"
    },
    {
        "source_sentence": "憍陳如！",
        "translation": "Kauṇḍinya!",
        "source": "T13n0397_022:0161c18_4"
    },
    {
        "source_sentence": "假使有人，能以兔毛渧數知海水渧，不能數知法目陀羅尼所有功德。",
        "translation": "Suppose there's a person who can use the hair on a rabbit's neck to know the number of arrows in the water, but they can't count the merits of the Dharma eye dhāraṇī.",
        "source": "T13n0397_022:0161c18_5"
    },
    {
        "source_sentence": "若除如來欲說盡者無有是處，乃至一切娑婆世界微塵亦爾。」",
        "translation": "If the Tathāgata doesn't want to explain it completely, there's no place for it, and so are all the tiny dust motes in the sahā world.",
        "source": "T13n0397_022:0161c20_6"
    },
    {
        "source_sentence": "爾時，世尊告金剛山童子言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the Vajra Mountain boy, saying, Good sons!",
        "source": "T13n0397_022:0161c21_7"
    },
    {
        "source_sentence": "汝所持來法目陀羅尼，吾今所說頗有異不？」",
        "translation": "Is the Dharma-mouth dhāraṇī that you've brought, isn't there a difference between what I'm teaching now?",
        "source": "T13n0397_022:0161c22_8"
    },
    {
        "source_sentence": "「不也。",
        "translation": "“No, they won’t.",
        "source": "T13n0397_022:0161c23_9"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0161c23_10"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_022:0161c24_0"
    },
    {
        "source_sentence": "如是說不？」",
        "translation": "Is it explained like this?",
        "source": "T13n0397_022:0161c24_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0161c24_2"
    },
    {
        "source_sentence": "實如是說。」",
        "translation": "It's really like this explanation.",
        "source": "T13n0397_022:0161c24_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_022:0161c24_4"
    },
    {
        "source_sentence": "若有人能受持如是法，讀誦書寫廣為人說，當知是人常為一切人、天、龍、神、阿修羅、乾闥婆、迦樓羅、緊那羅、摩睺羅伽等之所守護，",
        "translation": "If there are people who can receive and uphold this teaching, recite it, write it, and extensively explain it to others, know that such people are always guarded by all humans, gods, dragons, spirits, asuras, gandharvas",
        "source": "T13n0397_022:0161c25_0"
    },
    {
        "source_sentence": "一切四魔不能得其便，度煩惱河入八正道。」",
        "translation": "All four Māras can't get an advantage over them and cross the river of affliction into the eightfold right path.",
        "source": "T13n0397_022:0161c27_1"
    },
    {
        "source_sentence": "金剛山童子言：「善哉，善哉！",
        "translation": "The Vajra Mountain boy said, Good, good!",
        "source": "T13n0397_022:0161c29_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_022:0161c29_1"
    },
    {
        "source_sentence": "實如聖教。」",
        "translation": "It's really like the noble teaching.",
        "source": "T13n0397_022:0161c29_2"
    },
    {
        "source_sentence": "爾時，世尊告憍陳如：「若比丘、比丘尼、優婆塞、優婆夷，修行是法無能壞者，",
        "translation": "At the time, the Bhagavān addressed Kauṇḍinya thus: If monks, nuns, laymen, and laymen cultivate this teaching without being able to break it down,",
        "source": "T13n0397_022:0162a01_0"
    },
    {
        "source_sentence": "是名施光能淨寂靜，無有行處、無濁無動、無有舍宅、無少無多，名至處行、細行、堅行，",
        "translation": "This is called the practice, subtle practice, subtle practice, and steadfast practice of giving that can purify quiescence, which has no place for practice, no turbidity, no movement, no dwelling place, and no little or much.",
        "source": "T13n0397_022:0162a02_1"
    },
    {
        "source_sentence": "能壞四魔及四魔眾、一切邪見，度生死河入智慧海，常為諸聖之所讚歎，",
        "translation": "He was able to destroy the four Māras and all their wrong views. He crossed the river of birth and death and entered the ocean of wisdom, always being praised by the saints.",
        "source": "T13n0397_022:0162a04_2"
    },
    {
        "source_sentence": "得近如來所入之處。",
        "translation": "They can approach the place where the Tathāgata enters.",
        "source": "T13n0397_022:0162a06_3"
    },
    {
        "source_sentence": "雖復未斷一切煩惱，亦得上身無上菩提、上色、上力、上辯、上念、上慧、上處；",
        "translation": "Even though they have not yet abandoned all defilements, still they attain the highest bodily enlightenment, higher form, higher power, higher eloquence, higher thought, higher wisdom, and higher state.",
        "source": "T13n0397_022:0162a06_4"
    },
    {
        "source_sentence": "或得典領作四域王、若三二一；",
        "translation": "Or they may become rulers of the four quarters, or three, two, or one.",
        "source": "T13n0397_022:0162a08_5"
    },
    {
        "source_sentence": "若作帝釋，乃至得作他化自在王；",
        "translation": "If they become Indra, they can be the sovereign kings of others’ emanations.",
        "source": "T13n0397_022:0162a09_6"
    },
    {
        "source_sentence": "若作梵王；",
        "translation": "Suppose he becomes king of Brahma.",
        "source": "T13n0397_022:0162a09_7"
    },
    {
        "source_sentence": "若復獲得菩提樹下金剛之床，梵音深遠其心平等，得大悲心得舍摩他，",
        "translation": "If they also attain the adamantine seat beneath the tree of enlightenment, the sound of Brahma deeply distant from their minds and equanimity, they’ll attain a great compassionate state of calmness.",
        "source": "T13n0397_022:0162a10_8"
    },
    {
        "source_sentence": "壞諸煩惱名無上尊。」",
        "translation": "To destroy the afflictions is called the unsurpassed honored one.",
        "source": "T13n0397_022:0162a11_9"
    },
    {
        "source_sentence": "說是法時，舍利弗、目揵連等，於一坐處得阿羅漢果。",
        "translation": "When he taught this teaching, Śāriputra, Maudgalyāyana, and others attained the fruit of arhatship in one seat.",
        "source": "T13n0397_022:0162a12_10"
    },
    {
        "source_sentence": "爾時，一切世人、諸天而讚歎言：「如來功德不可思議，無量眾生得須陀洹果、斯陀含果、阿那含果、阿羅漢果，",
        "translation": "It was then that all the people of the world and gods praised him, saying, “The Tathāgata’s virtues are inconceivable. Innumerable sentient beings have attained the fruit of stream entry, the fruit of once-",
        "source": "T13n0397_022:0162a13_11"
    },
    {
        "source_sentence": "發阿耨多羅三藐三菩提心。」",
        "translation": "He gives rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0397_022:0162a15_12"
    },
    {
        "source_sentence": "爾時，四天王及功德天白佛言：「世尊！",
        "translation": "It was then that the four celestial kings and the gods of merit said to the Buddha, Bhagavān!",
        "source": "T13n0397_022:0162a16_13"
    },
    {
        "source_sentence": "隨是經典所流布處，我當護其四部弟子，及其國土、城邑、村落、諸王、人民。」",
        "translation": "Wherever this sūtra is disseminated, I will protect the four groups of my disciples, their lands, cities, villages, kings, and people.",
        "source": "T13n0397_022:0162a17_14"
    },
    {
        "source_sentence": "大方等大集經卷第二十二",
        "translation": "*Mahāmegha-sūtra, Volume 22",
        "source": "T13n0397_022:0162a20_0"
    },
    {
        "source_sentence": "◎「阿[(口*皮)\\/女](一)　阿[(口*皮)\\/女]阿[(口*皮)\\/女](二)　蘘那蛇沙吒(三)　摩訶摩呿(四)　摩訶咃娑婆娑(五)　樹喻低(六)　阿咃(七)　那[(口*皮)\\/女]那咃禰(八)　佛闍囉[糸*多](九)　安縷瀨[糸*多](十)　闍羅迦咃(十一)　阿那耨得叉(十二)　滼復婆(十三)　那[(口*皮)\\/女][口*荼][(口*皮)\\/女](十四)　勒叉魯遮那(十五)　莎吒呿[(口*皮)\\/女](十六)　陀羅尼茂闍(十七)　波囉伽啅[(口*皮)\\/女](十八)　鞞那廁(十九)　婆那鞞哹(二十)　阿那迦咃(二十一)　栴茶咩脩(二十二)　婆羅呿多(二十三)　脩魯遮那(二十四)　魯遮那[(口*皮)\\/女](二十五)　魯遮蛇蘘[(口*皮)\\/女][(口*皮)\\/女]斯(二十六)　莎訶(二十七)」◎「勿力呵(一)　勿力呵(二)　勿力呵(三)　勿力呵(四)　阿[(口*皮)\\/女]勿力呵(五)　薩[多*也]勿力呵(六)　修[(口*皮)\\/女]奢勿力呵(七)　那婆勿力呵(八)　修頗[(口*皮)\\/女](九)　阿能伽(十)　柢比叉(十一)　闍蛇私羅(十二)　那[(口*皮)\\/女]噢[日*男](十三)　呿伽鉢羅(十四)　那囉那讇(十五)　宿沙(十六)　翅奢私羅(十七)　阿[(口*皮)\\/女]羅思羅(十八)　摩訶迫坻闍那(十九)　阿那閃陀羅(二十)　阿婆呿伽(二十一)　那猶多閃陀羅(二十二)　娑頗囉(二十三)　阿蘘伽伽(二十四)　那囉拏(二十五)　娑遮(二十六)　守留多竭婆侈那(二十七)　莎呵(二十八)」◎「闍[(口*皮)\\/女]摩(一)　闍[(口*皮)\\/女]摩(二)　闍婆摩(三)　阿駒盧吒(四)　比[(口*皮)\\/女]闍婆(五)　摩訶陀摩[(口*皮)\\/女]呿(六)　阿囉闍(七)　珊菩陀(八)　蘘呿[(口*皮)\\/女](九)　阿囉闍[(口*皮)\\/女][(口*皮)\\/女](十)　囉闍[(口*皮)\\/女][(口*皮)\\/女](十一)　闍坻叉蛇[(口*皮)\\/女][(口*皮)\\/女](十二)　摩醯闍[(口*皮)\\/女]尼畔陀(十三)　比牟遮[(口*皮)\\/女][(口*皮)\\/女](十四)　那囉蛇拏[(口*皮)\\/女][(口*皮)\\/女](十五)　斫啾[(口*皮)\\/女][(口*皮)\\/女](十六)　輸盧多[(口*皮)\\/女][(口*皮)\\/女](十七)　輸盧多[(口*皮)\\/女][(口*皮)\\/女](十八)　伽恨拏[(口*皮)\\/女][(口*皮)\\/女](十九)　嗜貺[(口*皮)\\/女][(口*皮)\\/女](二十)　迦蛇[(口*皮)\\/女][(口*皮)\\/女](二十一)　質多[(口*皮)\\/女][(口*皮)\\/女](二十二)　娑茂陀囉[(口*皮)\\/女][(口*皮)\\/女](二十三)　[革*亟]囉拏[(口*皮)\\/女][(口*皮)\\/女](二十四)　叱那修留坻[(口*皮)\\/女][(口*皮)\\/女](二十五)　莎呵(二十六)」◎「阿羅摩(一)　阿羅摩(二)　阿羅摩(三)　闍蛇囉闍(四)　字犁蛇囉闍(五)　伽闍哹(六)　[(口*皮)\\/女]囉闍羅(七)　阿那遮(八)　阿呿莎囉(九)　呿伽莎闍那(十)　那烏呵(十一)　那囉蛇那烏呵(十二)　摩醯濕波羅遮摩(十三)　阿摩昵呵(十四)　阿蛇[(口*皮)\\/女]利羅(十五)　斫啾遮摩(十六)　斫啾娑斫啾那(十七)　那[(口*皮)\\/女]那[(口*皮)\\/女]摩闍(十八)　阿[(口*皮)\\/女]呿[(口*皮)\\/女](十九)　車[(口*皮)\\/女]那[(口*皮)\\/女](二十)　呿伽禪縷(二十一)　娑囉旃陀囉(二十二)　摩醯濕波羅昵羅那[(口*皮)\\/女](二十三)　娑檀摩叉蛇(二十四)　莎呵(二十五)」",
        "translation": "◎ 「阿[(口*皮)\\/女](一) 阿[(口*皮)\\/女]阿[(口*皮)\\/女]阿[(口*皮)\\/女]阿[(口*皮)\\/女]",
        "source": "T13n0397_022:0162a21_0"
    }
]