[
    {
        "source_sentence": "大方等大集經卷第四十四",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 44",
        "source": "T13n0397_044:0289a19_0"
    },
    {
        "source_sentence": "隋天竺三藏那連提耶舍譯",
        "translation": "Translated by the Sui translation of the Tripiṭaka of India, translated by Nārayaśas",
        "source": "T13n0397_044:0289a21_0"
    },
    {
        "source_sentence": "◎日藏分中三歸濟龍品第十二",
        "translation": "The Twelfth Chapter of the Treatise on the Three Refuges in the Part of the Sun-Store",
        "source": "T13n0397_044:0289a22_0"
    },
    {
        "source_sentence": "爾時，空中自然而雨種種香華、種種寶衣、種種音樂、種種歌舞充滿虛空，",
        "translation": "At that time, various kinds of fragrant flowers, various kinds of jeweled robes, and various kinds of music and songs naturally rained down from the sky to fill the sky.",
        "source": "T13n0397_044:0289a23_0"
    },
    {
        "source_sentence": "一切天、龍、夜叉、羅剎及阿修羅悉皆恭敬。",
        "translation": "All the gods, dragons, yakṣas, rāṣṭrapālas, and asuras venerate him.",
        "source": "T13n0397_044:0289a24_1"
    },
    {
        "source_sentence": "爾時，世尊與諸大眾菩薩聲聞左右圍繞前後隨從，從須彌頂蹈龍身橋，",
        "translation": "At that time the World-honored One was surrounded by a great assembly of bodhisattvas, disciples, and śrāvakas, following behind him from one side to the other as they climbed the bridge over the polar mountain.",
        "source": "T13n0397_044:0289a25_2"
    },
    {
        "source_sentence": "下佉羅坻聖人住處，梵天所敷寶師子座，坐於彼座。",
        "translation": "At the place where the holy man Śakra lives, there's a jeweled lion seat spread out by Brahmā and sitting on that seat.",
        "source": "T13n0397_044:0289a27_3"
    },
    {
        "source_sentence": "時虛空中一切天、龍、夜叉、羅剎，并阿修羅、緊那羅等各設供養，種種香末、種種華香、種種寶衣以散佛上，",
        "translation": "All the gods, nāgas, yakṣas, and rāṣasasas in the sky offered various kinds of perfumes, powders, flowers, fragrances, and jeweled robes to the Buddha.",
        "source": "T13n0397_044:0289a28_4"
    },
    {
        "source_sentence": "右繞三匝禮已而坐。",
        "translation": "After circumambulating him three times to his right, he bowed and sat down.",
        "source": "T13n0397_044:0289b01_5"
    },
    {
        "source_sentence": "爾時，娑伽羅龍王白佛言：「世尊！",
        "translation": "It was then that the dragon king Sāgara said to the Buddha, Bhagavān!",
        "source": "T13n0397_044:0289b02_6"
    },
    {
        "source_sentence": "何因緣故，我等一切在龍中生？」",
        "translation": "What are the causes and conditions for all of us being born among dragons?",
        "source": "T13n0397_044:0289b02_7"
    },
    {
        "source_sentence": "佛言：「龍王！",
        "translation": "The Buddha said, Dragon king!",
        "source": "T13n0397_044:0289b03_8"
    },
    {
        "source_sentence": "諦聽，諦聽！",
        "translation": "Listen attentively, and pay close attention!",
        "source": "T13n0397_044:0289b03_9"
    },
    {
        "source_sentence": "我今為王分別廣說。",
        "translation": "Now, I'll explain it in detail for the king.",
        "source": "T13n0397_044:0289b04_10"
    },
    {
        "source_sentence": "有十種業來生龍中。",
        "translation": "There are ten kinds of karma that come to be born among dragons.",
        "source": "T13n0397_044:0289b04_11"
    },
    {
        "source_sentence": "何者為十？",
        "translation": "What are these ten?",
        "source": "T13n0397_044:0289b05_12"
    },
    {
        "source_sentence": "有諸眾生行六波羅蜜，欲得阿耨多羅三藐三菩提覺，亦願欲得無惡障礙，",
        "translation": "If there are sentient beings who practice the six transcendent ways and want to attain the awakening of unexcelled, perfect enlightenment, they also want to attain it without any obstruction.",
        "source": "T13n0397_044:0289b05_13"
    },
    {
        "source_sentence": "或復欲得多修布施以時捨施，願因緣故來生龍中。",
        "translation": "Or they might want to cultivate generosity for a lot of time and abandon it at the right time, wishing to be born among dragons because of causes and conditions.",
        "source": "T13n0397_044:0289b07_14"
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "Furthermore, dragon king!",
        "source": "T13n0397_044:0289b08_15"
    },
    {
        "source_sentence": "或有眾生於大乘中修行捨施，福德果報因緣故願生龍中。",
        "translation": "Sometimes there are sentient beings who cultivate generosity in the great vehicle and wish to be born among dragons because of the causes and conditions for the rewards of merit.",
        "source": "T13n0397_044:0289b08_16"
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "Furthermore, dragon king!",
        "source": "T13n0397_044:0289b09_17"
    },
    {
        "source_sentence": "或有眾生為阿耨多羅三藐三菩提故行於布施，福報雖多不能清淨，怖畏地獄、餓鬼、畜生中因緣，",
        "translation": "Sometimes there are sentient beings who practice generosity for the sake of unsurpassed, correct, and complete enlightenment, but though their rewards of merit are numerous, they can't be purified, fearing the causes and conditions of hell, hungry",
        "source": "T13n0397_044:0289b10_18"
    },
    {
        "source_sentence": "故願生龍中。",
        "translation": "That's why he wished to be born among dragons.",
        "source": "T13n0397_044:0289b12_19"
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "Furthermore, dragon king!",
        "source": "T13n0397_044:0289b12_20"
    },
    {
        "source_sentence": "有諸眾生欲行阿耨多羅三藐三菩提時，生高心大慢力因緣，故願生龍中。",
        "translation": "When sentient beings want to practice unsurpassed, correct, and complete enlightenment, they give rise to the causes and conditions of arrogance and great conceit, so they wish to be born among dragons.",
        "source": "T13n0397_044:0289b12_21"
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "Furthermore, dragon king!",
        "source": "T13n0397_044:0289b14_22"
    },
    {
        "source_sentence": "有諸眾生發菩提願行阿耨多羅三藐三菩提時，多生瞋恚恨他眾生，以瞋忿向彼地獄、餓鬼、畜生生因緣故長起瞋忿，",
        "translation": "When there are sentient beings who give rise to the vow for enlightenment and practice unsurpassed, correct, and complete enlightenment, they often become angry with other sentient beings. Because of their anger and resentment direct",
        "source": "T13n0397_044:0289b14_23"
    },
    {
        "source_sentence": "如是死已願生龍中。",
        "translation": "After he dies like this, he wishes to be born among dragons.",
        "source": "T13n0397_044:0289b17_24"
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "Furthermore, dragon king!",
        "source": "T13n0397_044:0289b17_25"
    },
    {
        "source_sentence": "有諸眾生求於小乘，欲得福田覓聖人中，捨布施報福德供養，如是因緣自願力故來生龍中。",
        "translation": "If there are sentient beings who seek the lesser vehicle, want to attain a field of merit and look out for noble people, abandon the rewards of generosity, merit, and offerings, they'll be born among dragons because of the power",
        "source": "T13n0397_044:0289b18_26"
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "Furthermore, dragon king!",
        "source": "T13n0397_044:0289b20_27"
    },
    {
        "source_sentence": "有諸眾生嫉妬慢故，彼業因緣來生龍中。",
        "translation": "Because there are sentient beings who are jealous and arrogant, they're born among dragons because of the causes and conditions of their actions.",
        "source": "T13n0397_044:0289b20_28"
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "Furthermore, dragon king!",
        "source": "T13n0397_044:0289b21_29"
    },
    {
        "source_sentence": "有諸眾生多起憍慢饒於語言，以彼自業來生龍中。",
        "translation": "Some sentient beings often become conceited and speak arrogantly, and because of their own actions they're born among dragons.",
        "source": "T13n0397_044:0289b21_30"
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "Furthermore, dragon king!",
        "source": "T13n0397_044:0289b22_31"
    },
    {
        "source_sentence": "有諸眾生不信佛法僧寶，又不供給和上阿闍梨及餘大德，又不供養父母二親，",
        "translation": "If there are sentient beings who don't believe in the treasures of the Buddha, Dharma, and Saṃgha, or don't offer support to their superior preceptors and other great virtues, or don't offer support to their parents and relatives",
        "source": "T13n0397_044:0289b23_32"
    },
    {
        "source_sentence": "於中種種瞋忿毒心愛憎憍慢癡因緣故，於福田中邪錯行故，以是業緣來生龍中。",
        "translation": "Because of the various causes and conditions of anger, anger, poison, craving, hatred, pride, and delusion, and because of wrong actions in the field of merit, they're born among dragons because of these karmic conditions.",
        "source": "T13n0397_044:0289b24_33"
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "Furthermore, dragon king!",
        "source": "T13n0397_044:0289b26_34"
    },
    {
        "source_sentence": "有諸眾生種種癡慢惡業力多、福德力少，心怖畏故願生龍中。",
        "translation": "If there are sentient beings with various kinds of delusion and conceit, the power of bad karma is strong and the power of merit is weak, and their minds are frightened, so they wish to be born among dragons.",
        "source": "T13n0397_044:0289b27_35"
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "Furthermore, dragon king!",
        "source": "T13n0397_044:0289b28_36"
    },
    {
        "source_sentence": "有諸眾生妄語兩舌惡口無慈，此三業緣故而生龍中。」",
        "translation": "If there are sentient beings who speak falsely and duplicitously, speak harshly, and lack kindness, they'll be born among dragons because of these three karmic conditions.",
        "source": "T13n0397_044:0289b28_37"
    },
    {
        "source_sentence": "佛言：「龍王！",
        "translation": "The Buddha said, Dragon king!",
        "source": "T13n0397_044:0289b29_38"
    },
    {
        "source_sentence": "以此十種業因緣故，來龍中生。",
        "translation": "Because of these ten kinds of karmic causes and conditions, they came to be born among dragons.",
        "source": "T13n0397_044:0289c01_39"
    },
    {
        "source_sentence": "「復次，龍王！",
        "translation": "Furthermore, dragon king!",
        "source": "T13n0397_044:0289c01_40"
    },
    {
        "source_sentence": "復有三業因緣而生龍中。",
        "translation": "Again, there are three karmic causes and conditions that give rise to being born among dragons.",
        "source": "T13n0397_044:0289c02_41"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T13n0397_044:0289c02_42"
    },
    {
        "source_sentence": "有諸眾生，堅固惡業造身口意，彼業熟故生地獄中經無量劫，受大極苦難得解脫，",
        "translation": "“Some sentient beings create their bodies, speech, and thought with firm bad karma. Because of the maturation of their deeds, they are reborn in hell for measureless eons, where it is difficult to liberate themselves from the great suffering that",
        "source": "T13n0397_044:0289c03_43"
    },
    {
        "source_sentence": "雖免大業小業未盡生於龍中，或畜生中，或餓鬼中，以此三惡業因緣故來生龍中。」",
        "translation": "Even though they're free of the three bad karmic causes and conditions of great karma and minor karma that have yet to end, they'll be born among dragons, animals, or hungry ghosts because of these three bad karmic causes and conditions.",
        "source": "T13n0397_044:0289c05_0"
    },
    {
        "source_sentence": "時娑伽羅龍復白佛言：「如是，世尊！",
        "translation": "Sāgara-nāga then again said to the Buddha, So it is, Bhagavān!",
        "source": "T13n0397_044:0289c06_1"
    },
    {
        "source_sentence": "而此龍中，或有諸龍所受樂報猶如諸天，或有餘龍受樂如人，有如餓鬼、如畜生者，",
        "translation": "Among these dragons, some are like gods who experience pleasant rewards like goddesses; some are like human beings and some are like hungry ghosts or animals.",
        "source": "T13n0397_044:0289c07_2"
    },
    {
        "source_sentence": "或有餘龍如地獄中受大辛苦。」",
        "translation": "Perhaps there are other dragons like those in hell who experience great suffering.",
        "source": "T13n0397_044:0289c09_3"
    },
    {
        "source_sentence": "說是事已，時娑伽羅大龍王子名青蓮華面前白佛言：「世尊！",
        "translation": "After he explained this, the great dragon prince Sāgara named blue lotus said to the Buddha in front of him, Bhagavān!",
        "source": "T13n0397_044:0289c10_4"
    },
    {
        "source_sentence": "我何惡業罪因緣故來生龍中，身大端正，所有色觸或復衣裳及坐臥處，",
        "translation": "“World-honored One, why am I born among the nāgas for the sake of sins caused by evil deeds? My body is large and handsome.",
        "source": "T13n0397_044:0289c11_5"
    },
    {
        "source_sentence": "於一切時我身受用猶如火燒，常無衣服赤體而行？",
        "translation": "At all times, my body experiences and functions like a fire burning, always walking without clothing or red bodies?",
        "source": "T13n0397_044:0289c13_6"
    },
    {
        "source_sentence": "如我父王樂受最勝，如轉輪王果報不異？」",
        "translation": "It's like my father, the king, who enjoys the pleasure of feeling the most superior, and it's like a wheel-turning king whose karmic reward isn't different?",
        "source": "T13n0397_044:0289c14_7"
    },
    {
        "source_sentence": "佛言華面：「諦聽，諦聽！",
        "translation": "The Buddha said to the flower face, Listen closely, and listen closely!",
        "source": "T13n0397_044:0289c15_8"
    },
    {
        "source_sentence": "善思念之。",
        "translation": "Consider it well and think of it.",
        "source": "T13n0397_044:0289c15_9"
    },
    {
        "source_sentence": "今當為汝說於本事。",
        "translation": "Now, I will explain this matter for you.",
        "source": "T13n0397_044:0289c16_10"
    },
    {
        "source_sentence": "乃往過去三十一劫，有佛世尊名曰尸棄多陀阿伽度、阿羅訶、三藐三佛陀。",
        "translation": "In the past, thirty-one eons ago, there was a buddha Bhagavān named Śikhin Tathāgata Agada, Arhat, Samyakṣobhya Buddha.",
        "source": "T13n0397_044:0289c16_11"
    },
    {
        "source_sentence": "時彼世中有王名曰裴多富沙。",
        "translation": "At the time, there was a king named Peiduo Fuṣa in that world.",
        "source": "T13n0397_044:0289c18_12"
    },
    {
        "source_sentence": "彼富沙王於三月中供養彼佛，并及無量百千須陀洹、斯陀含、阿那含、阿羅漢，",
        "translation": "In the course of three months, King Pūrvavideha honored that buddha with offerings to him, along with immeasurable hundreds of thousands of stream entrants, once-returners, non-returners, and arhats.",
        "source": "T13n0397_044:0289c18_13"
    },
    {
        "source_sentence": "并大菩薩摩訶薩眾，以種種衣服飲食湯藥而供給之，至心聽法。",
        "translation": "They were accompanied by a great multitude of bodhisattvas and mahāsattvas who offered various kinds of clothing, food, drink, hot water, and medicine to them, wholeheartedly listening to the teaching.",
        "source": "T13n0397_044:0289c20_14"
    },
    {
        "source_sentence": "既聞法已，即發阿耨多羅三藐三菩提心。",
        "translation": "Having heard the teaching, he then aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0397_044:0289c22_15"
    },
    {
        "source_sentence": "如是三月設供養已，彼富沙王為尸棄佛及餘眾僧造立寺舍，施種種衣飲食湯藥床臥被褥具足豐饒。",
        "translation": "Thus, after setting up an offering for three months, that wealthy man built a monastery for Śikhin Buddha and the other monks, providing various kinds of clothing, food, drink, bathing, medicine, beds, bedding, bedding,",
        "source": "T13n0397_044:0289c23_0"
    },
    {
        "source_sentence": "彼富沙王第一太子名裴多娑樹帝，彼娑樹帝見佛聞法，於流轉中生大怖畏，",
        "translation": "The first prince of the king of Pūrvavideha was named Padmavyūha. Seeing the Buddha and hearing the Dharma, Padmavyūha became greatly frightened in the midst of the flow [of phenomena].",
        "source": "T13n0397_044:0289c25_1"
    },
    {
        "source_sentence": "從父王邊禮拜諮啟，請欲就佛願求出家。",
        "translation": "He came from his father's side to pay homage and inquire, requesting permission to leave home with the Buddha's vow.",
        "source": "T13n0397_044:0289c27_2"
    },
    {
        "source_sentence": "王報子言：『欲往隨意，任汝出家。』",
        "translation": "The king replied to his son, 'I want to go as you wish, so I'll let you leave home.'",
        "source": "T13n0397_044:0289c28_3"
    },
    {
        "source_sentence": "既出家已，又白父言：『我欲父王寺上停止。』",
        "translation": "After leaving home, he also said to his father, 'I want to stop at my father's monastery.'",
        "source": "T13n0397_044:0289c28_4"
    },
    {
        "source_sentence": "富沙王言：『亦隨汝意，住彼寺中。』",
        "translation": "The king of Fuṣa said, 'Also, follow your wishes and stay at that temple.'",
        "source": "T13n0397_044:0289c29_5"
    },
    {
        "source_sentence": "「時尸棄佛眾僧弟子，在彼寺中坐臥受用敷噉飲食，彼富沙子裴多樹帝妬嫉心生，",
        "translation": "When Śikhin Buddha's disciples of the saṃgha were seated and lying down in that temple to receive food and drink from a bed, that rich man Pṛthagjana became jealous of them.",
        "source": "T13n0397_044:0290a01_6"
    },
    {
        "source_sentence": "忿彼舊住佛弟子眾恒瞋罵之。",
        "translation": "He became angry with the old Buddhist disciples who lived there and constantly reviled at him.",
        "source": "T13n0397_044:0290a03_7"
    },
    {
        "source_sentence": "時彼眾僧被瞋罵已悉皆離寺，彼娑樹帝見僧去已，生歡喜心即自念言：『彼去者好，",
        "translation": "Seeing the monks leaving, Sāriputta was overjoyed and thought to himself, “That’s a good idea for them to leave.",
        "source": "T13n0397_044:0290a04_8"
    },
    {
        "source_sentence": "我大安隱。』",
        "translation": "I'm greatly peaceful.'",
        "source": "T13n0397_044:0290a05_9"
    },
    {
        "source_sentence": "「眾僧去已，時娑樹帝恣用寺內衣服飲食，有餘人來即不聽住。",
        "translation": "When the saṃgha departed, Śākyamuni gave his food and clothing to the monks inside the temple freely, but some other people came and didn't allow them to stay.",
        "source": "T13n0397_044:0290a06_10"
    },
    {
        "source_sentence": "彼娑樹帝具造如是諸惡業已，命終之後生大地獄中，經無量千萬那由他歲受諸火燒；",
        "translation": "After having done all these bad deeds, Śāriputra was born in the great hell at the end of his life and spent measureless millions of myriads of nayutas of years being burned by the fire.",
        "source": "T13n0397_044:0290a07_11"
    },
    {
        "source_sentence": "地獄得脫生餓鬼中，復經無量百千萬歲而受辛苦；",
        "translation": "Being liberated from the hells and reborn in the realms of hungry ghosts continues to endure torment for countless millions of years.",
        "source": "T13n0397_044:0290a09_12"
    },
    {
        "source_sentence": "餓鬼中死還墮地獄；",
        "translation": "They die in the realm of hungry ghosts and return to hell.",
        "source": "T13n0397_044:0290a10_13"
    },
    {
        "source_sentence": "脫地獄已生餓鬼中，如是經由三十一劫。",
        "translation": "After liberating themselves from hell and being born among hungry ghosts, they pass through thirty-one eons like this.",
        "source": "T13n0397_044:0290a11_14"
    },
    {
        "source_sentence": "汝等諸龍諦聽諦受，其娑樹帝於流轉中，具足如是受諸辛苦。」",
        "translation": "All of you dragons, listen closely and accept it; those śaśuṇīs in the flowing stream are fully subject to such hardships.",
        "source": "T13n0397_044:0290a12_15"
    },
    {
        "source_sentence": "佛言：「華面！",
        "translation": "The Buddha said, Flowerface!",
        "source": "T13n0397_044:0290a13_16"
    },
    {
        "source_sentence": "彼娑樹帝者豈異人乎？",
        "translation": "Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is",
        "source": "T13n0397_044:0290a13_17"
    },
    {
        "source_sentence": "即汝身是也。",
        "translation": "That's your body.",
        "source": "T13n0397_044:0290a14_18"
    },
    {
        "source_sentence": "乃往過去惡業因緣故，生大地獄、餓鬼、畜生輪轉受苦，經是三十一大劫中備受眾苦未曾暫捨，",
        "translation": "Because of the causes and conditions of their past evil deeds, they were born in great hells, hungry ghosts, and animal rebirths to experience suffering. For thirty-one major aeons they have endured all kinds of",
        "source": "T13n0397_044:0290a14_19"
    },
    {
        "source_sentence": "餘殘業故來生龍中受是惡報。」",
        "translation": "Because of the remaining residual karma, he'll be born among dragons and experience this bad retribution.",
        "source": "T13n0397_044:0290a16_20"
    },
    {
        "source_sentence": "時華面龍聞是語已大聲啼哭，舉身自投四支布地，禮拜白佛作如是言：「我今至心從佛懺悔，",
        "translation": "Having heard these words, the flowery-faced dragon wept and wailed in a loud voice. Hearing them, he lifted his body up and prostrated himself on the four sides of the ground. After venerating the Buddha, he",
        "source": "T13n0397_044:0290a17_21"
    },
    {
        "source_sentence": "我大癡惑大慢愚曚，不解方便差別好惡造是罪業，低頭合掌至心發露不敢覆藏。",
        "translation": "I'm greatly deluded and deluded, greatly conceited and foolish, don't understand the distinction between good and evil in terms of skillful means, commit this sinful action, bow my head with joined palms, and",
        "source": "T13n0397_044:0290a19_22"
    },
    {
        "source_sentence": "如來世尊！",
        "translation": "Bhagavān, the Tathāgata!",
        "source": "T13n0397_044:0290a21_23"
    },
    {
        "source_sentence": "我今至誠入於骨髓，歸佛歸法歸比丘僧，從今發意乃至壽盡，於是時中作優婆塞。」",
        "translation": "Now, I sincerely enter into the bone marrow, returning to the Buddha and Dharma and the monks and nuns, and from now until my life ends, I'll become a layman at that time.",
        "source": "T13n0397_044:0290a21_24"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T13n0397_044:0290a23_25"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_044:0290a24_26"
    },
    {
        "source_sentence": "汝今有於地獄、餓鬼惡道業報，如是至心歸依我者得盡彼業，此中死已值彌勒佛得於人身，",
        "translation": "If you now have the results of your actions in hells, hungry ghosts, and evil destinies, and thus wholeheartedly rely on me, you'll be able to end those actions. After dying here, you'll meet Mai",
        "source": "T13n0397_044:0290a24_27"
    },
    {
        "source_sentence": "於彌勒佛法中出家證羅漢果。」",
        "translation": "In the midst of Maitreya's teaching, he leaves home and realizes the fruit of the arhat.",
        "source": "T13n0397_044:0290a26_28"
    },
    {
        "source_sentence": "佛言：「華面！",
        "translation": "The Buddha said, Flowerface!",
        "source": "T13n0397_044:0290a27_29"
    },
    {
        "source_sentence": "莫更狐疑，時彼裴多富沙人王，於三月中以種種資生供養尸棄如來，及諸菩薩聲聞眾故今得此報，",
        "translation": "Don't doubt it again. For three months, the king of Pūrvavideha made offerings to Śikhin Tathāgata and the bodhisattvas and śrāvakas with various necessities for their support, and now they've received this reward",
        "source": "T13n0397_044:0290a27_30"
    },
    {
        "source_sentence": "受娑伽羅大龍王身猶如天樂，三十一劫不生三惡，常生天人受如是報。",
        "translation": "They experience the body of the great dragon king Sāgara as if it were heavenly bliss, and for thirty-one eons no three evils arise, and they're always born among gods and humans who experience this kind of retribution",
        "source": "T13n0397_044:0290a29_31"
    },
    {
        "source_sentence": "彼亦為於阿耨多羅三藐三菩提行因緣故，來此龍中願欲得生。」",
        "translation": "It's also because of the causes and conditions for the practice of unsurpassed, correct, and complete enlightenment that they came to this dragon and wished to be born.",
        "source": "T13n0397_044:0290b02_32"
    },
    {
        "source_sentence": "說是語時，一切諸龍皆大懊惱悔往先咎，悉於佛前至心供養。",
        "translation": "When he spoke these words, all the dragons were greatly distressed and repented of their past sins, and they all made offerings with sincerity in front of the Buddha.",
        "source": "T13n0397_044:0290b03_33"
    },
    {
        "source_sentence": "◎◎爾時，眾中有一盲龍名曰頗羅機梨奢，舉聲大哭作如是言：「大聖世尊！",
        "translation": "At the time, there was a blind dragon in the crowd named Bhārakūṭīśa, raising his voice and wailing loudly, saying, Great sage, Bhagavān!",
        "source": "T13n0397_044:0290b05_34"
    },
    {
        "source_sentence": "願救濟我，願救濟我。",
        "translation": "May you save me, and may you save me!",
        "source": "T13n0397_044:0290b07_35"
    },
    {
        "source_sentence": "諸佛慈悲憐愍一切，我今身中受大苦惱，日夜常為種種諸蟲、小蛇、蝦蟇之所唼食，",
        "translation": "The buddhas have compassion and pity for all of us. I am now suffering great pain and distress in my body, being constantly eaten by various insects, small snakes, and frogs day and night.",
        "source": "T13n0397_044:0290b08_36"
    },
    {
        "source_sentence": "居熱水中無暫時樂。」",
        "translation": "There's no temporary bliss in the hot water.",
        "source": "T13n0397_044:0290b09_37"
    },
    {
        "source_sentence": "佛言：「梨奢！",
        "translation": "The Buddha said, Riṣa!",
        "source": "T13n0397_044:0290b10_38"
    },
    {
        "source_sentence": "汝過去世於佛法中曾為比丘，毀破禁戒內懷欺詐，外現種種善相威儀，",
        "translation": "In a past life, you were once a monk in the Buddha’s religion. You violated the precepts and committed fraudulent deeds within but you now display various good signs and dignified demeanor on the outside.",
        "source": "T13n0397_044:0290b10_39"
    },
    {
        "source_sentence": "廣貪眷屬弟子眾多，名聲四遠莫不聞知。",
        "translation": "He had a large retinue of disciples who were widely greedy, and his reputation spread far and wide. None of them could not hear him.",
        "source": "T13n0397_044:0290b12_40"
    },
    {
        "source_sentence": "彼諸弟子如是說言：『我和上得阿羅漢果。』",
        "translation": "Those disciples thus said, 'I and the above will attain the fruit of arhatship.'",
        "source": "T13n0397_044:0290b13_41"
    },
    {
        "source_sentence": "以是因緣多得供養，得供養已，獨受用之，見持戒人反惡加說。",
        "translation": "Because of these causes and conditions, they'll often receive offerings, and after making offerings, they'll experience them alone, seeing the person who upholds the precepts and speak harshly against them.",
        "source": "T13n0397_044:0290b14_42"
    },
    {
        "source_sentence": "彼人懊惱，如是念言：『世世生中願我所在食汝身肉。』",
        "translation": "Being distressed, that person thus thinks, 'In worldly births, I wish to eat your flesh wherever I am.'",
        "source": "T13n0397_044:0290b15_43"
    },
    {
        "source_sentence": "如是惡業死生龍中，是汝前身，眾生願故食噉汝身，惡業因緣得此盲報住熱水中。",
        "translation": "Thus, because of bad actions, you died and were born among dragons, which was your former body; the sentient beings wished to eat and devoured you, and because of bad actions they got this blind retribution by staying in hot water.",
        "source": "T13n0397_044:0290b16_44"
    },
    {
        "source_sentence": "又於過去無量劫中，在融赤銅地獄之中，常為諸蟲之所食噉。」",
        "translation": "Also, in measureless eons in the past, they've been in the red copper hell of melting and always been eaten by insects.",
        "source": "T13n0397_044:0290b18_45"
    },
    {
        "source_sentence": "爾時，龍眾聞此語已，憂愁啼哭作如是言：「我等今者，皆悉至心咸共懺悔，",
        "translation": "At that moment, having heard these words, the great assembly of dragons wept and cried in distress. They said:",
        "source": "T13n0397_044:0290b20_46"
    },
    {
        "source_sentence": "願令此苦速得解脫。」",
        "translation": "May I cause this suffering to quickly attain liberation.",
        "source": "T13n0397_044:0290b21_47"
    },
    {
        "source_sentence": "爾時，如來出金色手摩彼龍面作如是言：「汝等諦聽，我於過去曾作國王名曰善眼，",
        "translation": "At that moment, the Tathāgata emerged from his golden-colored hand and stroked the dragon’s face. He said: “Listen attentively. In the past I was once a king named Sunetra.",
        "source": "T13n0397_044:0290b22_48"
    },
    {
        "source_sentence": "是時有一盲婆羅門，來從我乞求索一眼，我時歡喜兩眼皆與。",
        "translation": "At the time, there was a blind Brāhmaṇa who came to me and begged for one eye, and I rejoiced when I gave him both eyes.",
        "source": "T13n0397_044:0290b24_49"
    },
    {
        "source_sentence": "若我此言誠不虛者，令汝梨奢清淨眼生，一切諸罪悉皆除盡。」",
        "translation": "If my words are sincere and not false, I'll cause you to give rise to a pure eye that's quiet and pure, and all your sins will be removed.",
        "source": "T13n0397_044:0290b25_50"
    },
    {
        "source_sentence": "即說呪曰：「多絰咃　斫芻佉婆　娑蘭那佉婆　羯磨佉婆　阿難闍那　毘囉闍佉破　蘭多若摩　尼婆羅那都夜　阿鞞栴陀羅　樹低　頻頭輸第　吃利波輸第頗羅輸第　阿誓　多誓　多隸　多隸　婆細陀索繼陀索繼嗚盧羅避　摩訶嗚盧羅避　帝腹阿邏多那婆羅帝莎呵」爾時，",
        "translation": "He then spoke the dhāraṇī, saying, Tathāgata, Bhikṣu Upāsaka, Sāraṇa Upāsaka, Kāma Upāsaka, Ānanda Upāsaka, Ānanda Upāsaka, Vairocana Upāsaka,",
        "source": "T13n0397_044:0290b27_0"
    },
    {
        "source_sentence": "世尊說此實淨眼陀羅尼已，彼梨奢龍得清淨眼，餘五萬三千龍亦得淨眼，",
        "translation": "After the Bhagavat had explained this dhāraṇī of the true eye of purity, that Licchavi Nāga obtained a pure eye. The other fifty-three thousand Nāgas also obtained a pure eye.",
        "source": "T13n0397_044:0290c06_1"
    },
    {
        "source_sentence": "及餘八十四那由他夜叉、鳩槃茶、餓鬼、薜荔多、毘舍遮、人、非人等，",
        "translation": "and the other eighty-four nayutas, such as yakṣas, kumbhāṇḍas, hungry ghosts, gandharvas, piśācīs, humans, nonhumans, etc.",
        "source": "T13n0397_044:0290c07_2"
    },
    {
        "source_sentence": "罪垢消滅皆得淨眼。",
        "translation": "The stain of sin ceases, and they all attain the pure eye.",
        "source": "T13n0397_044:0290c09_3"
    },
    {
        "source_sentence": "「看彼十力世導師，　　能使諸龍眼清淨，",
        "translation": "“Look at the Ten-Powered Guide of the World, Who can purify the eyes of all the enlightening beings.",
        "source": "T13n0397_044:0290c09_4"
    },
    {
        "source_sentence": "　今生若不得值佛，　　諸失眼者常盲冥。」",
        "translation": "If he doesn't meet the Buddha in his present birth, those who lose their eyes will always be blind and deluded.",
        "source": "T13n0397_044:0290c09_4"
    },
    {
        "source_sentence": "爾時，善德天子向佛合掌，而說偈言：爾時，世尊告長老憍陳如：「汝可持此淨眼陀羅尼呪。",
        "translation": "At that point, the celestial son of good qualities joined his palms to the Buddha and said in verse, At that point, the Bhagavān addressed the elder Kauṇḍinya, You may maintain this dhāraṇī spell for the pure",
        "source": "T13n0397_044:0290c09_4"
    },
    {
        "source_sentence": "若有眾生過去惡業，於今現在或當來世，或四大病，或惡人呪，或因毒藥，",
        "translation": "Suppose there are sentient beings who have done evil deeds in the past, either in the present or future lives. They may be afflicted by the four major illnesses, cursed by evil people, or on account of poisonous medicines",
        "source": "T13n0397_044:0290c14_5"
    },
    {
        "source_sentence": "以此緣故即便失目。",
        "translation": "Because of this condition, they even lost their eyes.",
        "source": "T13n0397_044:0290c15_6"
    },
    {
        "source_sentence": "如是眾生，應當誦此淨眼陀羅尼，自悔過去所造惡業，於諸眾生起大慈悲，",
        "translation": "Such sentient beings should recite this dhāraṇī of the pure eye to repent of their past bad actions and give rise to great compassion toward sentient beings.",
        "source": "T13n0397_044:0290c16_7"
    },
    {
        "source_sentence": "至心念佛捨於餘事，七七日中晝夜六時以手拭眼，以是因緣得清淨眼。",
        "translation": "He wholeheartedly thought of the Buddha and abandoned other things, wiped his eyes with his hands at six o'clock during the seventh day and night for seventy-seven days, and because of these causes and conditions, he attained pure eyes.",
        "source": "T13n0397_044:0290c18_8"
    },
    {
        "source_sentence": "「若有眾生於過去世作諸惡業。",
        "translation": "“Suppose there are sentient beings who did bad actions in a past life.",
        "source": "T13n0397_044:0290c19_9"
    },
    {
        "source_sentence": "或毀於法或謗聖人，於說法者為作障礙，或抄寫經洗脫文字，或損壞他眼或暗蔽他，",
        "translation": "They may disparage the teachings or denigrate sages, or they may act as obstacles to those who teach the Dharma. Or they may copy scriptures and wash away their words, or they may damage others’ eyes or blind others.",
        "source": "T13n0397_044:0290c20_10"
    },
    {
        "source_sentence": "此業緣故今得盲報。",
        "translation": "Because of these karmic conditions, they'll now attain the reward of blindness.",
        "source": "T13n0397_044:0290c22_11"
    },
    {
        "source_sentence": "如是重惡業因緣故，七七日中不得差者，應當抄寫此陀羅尼，至心誦持悔過彼業。",
        "translation": "Because of the causes and conditions of these serious bad actions, they won't be allowed to change for seventy-seven days, so they should copy this dhāraṇī, wholeheartedly recite it, and repent of their actions.",
        "source": "T13n0397_044:0290c22_12"
    },
    {
        "source_sentence": "復以海沫、甘草、呵梨勒、阿摩羅、毘醯羅此五種藥擣末蜜和，盛著舊龜甲中以久年蘇火上煎已，",
        "translation": "Again, he mixed these five kinds of medicinal powder and honey together with sea bubbles, sweet herbs, vārilā, amala, and vihīra. He placed them in the old turtle’s armor and boiled them over",
        "source": "T13n0397_044:0290c24_13"
    },
    {
        "source_sentence": "誦此陀羅尼一千八遍，以呪此藥用塗眼上，捨諸緣事七七日中念佛造像，",
        "translation": "Recite this dhāraṇī one thousand and eight times, apply this medicine to your eyes with a spell for the Buddha's remedy, and paint it on them. For seven days and seven nights you will abandon all conditioned things and make an image of the Buddha",
        "source": "T13n0397_044:0290c27_14"
    },
    {
        "source_sentence": "至心發願，時彼眾生惡業消盡得清淨眼。",
        "translation": "When they wholeheartedly make a vow, the bad karma of those sentient beings will be extinguished and they'll attain pure eyes.",
        "source": "T13n0397_044:0290c28_15"
    },
    {
        "source_sentence": "若有財者并營寺舍，隨力所辦布施資生，如是一切惡業皆盡，於當來世無量生中常不失眼。」",
        "translation": "If someone with wealth also builds a temple and provides for the necessities of giving according to their abilities, then all bad actions will be ended, and in measureless births in future lives they won't lose their eyes.",
        "source": "T13n0397_044:0290c29_16"
    },
    {
        "source_sentence": "爾時，一切諸龍眾等作如是言：「南無南無大悲世尊，能施三世眾生利益，",
        "translation": "It was then that all the other dragons and others said, “O Bhagavān! Great compassionate one, you are able to bestow benefits on sentient beings in the three worlds.",
        "source": "T13n0397_044:0291a02_17"
    },
    {
        "source_sentence": "失眼得明，一切惡業清淨無垢。」",
        "translation": "When they lose their eyes and attain insight, all bad actions are pure and undefiled.",
        "source": "T13n0397_044:0291a04_18"
    },
    {
        "source_sentence": "「世尊能除諸罪垢，　　猶如大河洗一切，",
        "translation": "Bhagavān, you can remove the stain of sins like a great river that washes away everything.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　悉知眾生種種行，　　是故稱佛眾中尊。",
        "translation": "Knowing the various practices of sentient beings, they're therefore called the most honored among the buddhas.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　我所居停住澤中，　　大野枯泉無有水，",
        "translation": "I live in the swamp wherever I am, but there is no water in the dried-up springs of the great wilderness.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　熱風吹身劇於火，　　形體屋舍臭難堪，",
        "translation": "A hot wind blows their bodies into the fire, Their form and substance like a house smell unbearable.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　八千億年住於彼，　　曾無一日受歡樂，",
        "translation": "For eight hundred myriads of koṭis of years I dwelled there, Never experiencing pleasure for a single day.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　常為眾生所食噉，　　眷屬大小悉皆然。」",
        "translation": "They're always eaten by sentient beings, and so are their followers, both large and small, likewise.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "「若有眾生造諸罪，　　而復修營於福德，",
        "translation": "“If there are sentient beings who commit sins And further cultivate virtue,",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　建立寺舍施鍾鈴，　　種種飲食供養僧，",
        "translation": "They built temples, gave bells and chimes, And offered various food and drink to the sangha.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　以此雜福因緣故，　　在所生中隨業受。",
        "translation": "Because of these mixed causes and conditions of merit, they're received according to their actions in the place where they're born.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　造惡苦辛如地獄，　　施食快樂似天堂，",
        "translation": "Making evil painful and pungent like hell, Giving food and happiness resembles heaven.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　或復來生於龍中，　　緣彼善業因緣故。",
        "translation": "Or they may again come and be born among dragons, Conditioned by the causes and conditions of their good actions.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　於龍頭中自然出，　　希有如意妙寶王，",
        "translation": "From the top of the dragon’s head emerges a rare wish-granting jewel king.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　所欲念者皆隨意，　　種種果報皆悉具。",
        "translation": "Whatever one wishes for, he does as he wishes; All the various rewards are fully present.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　雖處枯泉及旱澤，　　能出上妙清流水，",
        "translation": "Even though they live in withered springs and drought-stricken swamps, They can produce the finest, clear, flowing water.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　清淨虛空布密雲，　　地平如掌泉池湧，",
        "translation": "Pure space is covered with dense clouds, The ground is as level as a pond in the palm of your hand.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　行住坐臥所在處，　　皆能應念生諸水。",
        "translation": "Wherever he walks, stands, sits, and lies, He can give rise to water in response to his thoughts.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　若有一切諸眾生，　　雖復能得於人身，",
        "translation": "If there are all sentient beings, Even if they can attain a human body,",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　備造種種罪惡業，　　不能供養於三寶，",
        "translation": "They commit various sins and evil deeds And are unable to make offerings to the Three Treasures.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　死後眾苦皆聚集，　　地獄餓鬼具受之。",
        "translation": "After death, all kinds of suffering will gather together, and hell, hungry ghosts, and ghosts will suffer from it.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　設復得為龍王身，　　所有眷屬并妻子，",
        "translation": "Suppose he were to obtain the body of a dragon king, All his attendants and their wives.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　貧窮饑餓諸熱惱，　　頂上無有如意寶，",
        "translation": "Their poverty, hunger, thirst, and fever Have no wish-granting jewel on their heads.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　居住空澤多毒蟲，　　枯涸常乾無有水。",
        "translation": "They live in empty swamps, full of poisonous insects, dried up and always dry, with no water.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　如是皆由過去世，　　曾於佛法作比丘，",
        "translation": "All of this is due to the fact that in a past life I was once a bhikṣu who practiced the buddha-dharma.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　或見蘭若苦行人，　　嫉妬慳心惜飲食，",
        "translation": "Or they may see the ascetic practitioners in a forest, With jealousy and stinginess cherishing food and drink.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　遠客比丘來寄止，　　瞋忿懷怒心不喜，",
        "translation": "A monk from a distant land came to stay there, angry and wrathful, displeased.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　檀越平等施飲食，　　於中遮止便罵詈。",
        "translation": "The donor gives food and drink equally, and when he stops there, he ridicules it.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　設有清淨好流水，　　屎尿糞穢滿其中，",
        "translation": "Suppose there’s pure and good-flowing water, Filled with excrement, urine, dung, and filth.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　所有居住行坐處，　　一切臭穢皆不淨，",
        "translation": "All the places where they live, walk, and sit Are all smelly and impure.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　或有清淨持戒者，　　如是見已皆遠離。",
        "translation": "Some people who are pure in observance of the precepts Have all been far removed from such views.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　若有餘處好人聞，　　無心欲來於此者，",
        "translation": "If there are any other places where good people hear, They will come here without mind or desire.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　彼人惡業因緣故，　　死墮地獄無量世，",
        "translation": "Because of the causes and conditions of their evil deeds, they die and fall into hell for an infinite number of ages.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　灰河沸屎燒赤銅，　　無量億年受楚毒。",
        "translation": "A river of ashes boils and burns red copper, and it's painful and poisonous for measureless millions of years.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　如是餓鬼中饑渴，　　生曾不聞漿水名，",
        "translation": "Thus, among hungry ghosts who are hungry and thirsty, They've never heard the name of milk or water in birth.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　餘報復生龍道中，　　具足多年受辛苦。",
        "translation": "For the rest, they'll be reborn in the dragon path again, fully endowed with many years of suffering.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　雖得龍身常饑餓，　　在所生處空無水，",
        "translation": "Even though the body of a dragon is always hungry, there's no water in the sky where it's born.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　或在枯澤惡焦山，　　絕水常乾無飲食，",
        "translation": "Or they may be in a barren marsh on a badly scorched mountain, Always drying up water and no food or drink.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　死已數入地獄中，　　大火熱惱充遍身。",
        "translation": "After death, they'll often go into hell, and their bodies will be filled with a great fire of fever.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　在彼經於無量歲，　　如是循還餓鬼中，",
        "translation": "For an infinite number of years, they'll thus follow and return to the hungry ghost.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　自非修禪能救濟，　　禮拜供養佛如來。",
        "translation": "They don't themselves cultivate meditation to save and rescue, venerate and make offerings to the Buddha as a tathāgata.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　持戒智慧學多聞，　　精進捨於慳慢想，",
        "translation": "Observing precepts, being wise and learned, they diligently abandon the notion of stinginess and conceit.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　妬嫉毒心最為惡，　　此業因緣須斷除，",
        "translation": "The poisonous mind of jealousy is the worst evil. It is the cause and condition for this action that needs to be abandoned.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "　憶念死時受是殃，　　決定無疑早懺悔。」",
        "translation": "Remembering this misfortune at the time of death, they'll surely repent without doubt.",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "爾時，有龍名曰青色，大聲唱喚而說偈言：爾時，世尊說偈答言：爾時，",
        "translation": "At that time, there was a dragon called “blue-colored.” Then the World-honored One uttered these verses:",
        "source": "T13n0397_044:0291a05_19"
    },
    {
        "source_sentence": "如來說是偈已，彼龍眾中二十六億諸餓龍等，念過去身皆悉雨淚，作如是言：「唯願哀愍救濟於我。",
        "translation": "After the Tathāgata spoke this verse, Twenty-six billion hungry dragons among those dragons and others in the assembly of dragons remembered that they had all rained tears from their past bodies and said, Please have mercy and",
        "source": "T13n0397_044:0291b21_20"
    },
    {
        "source_sentence": "大悲世尊！",
        "translation": "Great compassion, Bhagavān!",
        "source": "T13n0397_044:0291b23_21"
    },
    {
        "source_sentence": "我等憶念過去世時，於佛法中雖得出家，備造如是種種惡業，以惡業故經無量身在三惡道，",
        "translation": "World-Honored One, we remember that in a past time when we renounced household life to follow the buddha-dharma, we committed various evil deeds like this and so forth. Because of these evil deeds we passed away in",
        "source": "T13n0397_044:0291b23_22"
    },
    {
        "source_sentence": "亦以餘報故生在龍中受極大苦，如青色龍我亦如是。」",
        "translation": "It's also because of other karmic retribution that they're born among dragons and experience extreme pain, just as I am like a blue-colored dragon.",
        "source": "T13n0397_044:0291b25_23"
    },
    {
        "source_sentence": "爾時，世尊語諸龍言：「汝可持水洗如來足，令汝殃罪漸得除滅。」",
        "translation": "It was then that the Bhagavān said to the dragons, Take water and wash the Tathāgata's feet with it so that your sins will gradually be removed.",
        "source": "T13n0397_044:0291b27_0"
    },
    {
        "source_sentence": "時一切龍以手掬水，水皆成火變作大石，滿於手中生大猛炎，棄已復生如是至七。",
        "translation": "All the dragons then scooped up water with their hands, and the water became fire and turned into a large stone, filled it with great ferocity in their hands, and after discarding it, it again gave rise to such-and-seven",
        "source": "T13n0397_044:0291b28_1"
    },
    {
        "source_sentence": "一切龍眾見如是已，驚怖懊惱啼泣雨淚。",
        "translation": "Seeing this, all the dragons were frightened and distressed, weeping and raining tears.",
        "source": "T13n0397_044:0291c01_2"
    },
    {
        "source_sentence": "佛告諸龍：「汝造罪業得是惡報，修善業人受於好果，我今教汝說真實誓。",
        "translation": "The Buddha told the dragons, You've done a bad action that brings bad consequences and those who cultivate good actions will receive good results, so now I'll teach you to make a true vow.",
        "source": "T13n0397_044:0291c02_3"
    },
    {
        "source_sentence": "若佛導師憐愍一切，於諸眾生平等無二，此言不虛，願我諸龍火炎時滅。」",
        "translation": "If the Buddha's guide has compassion for all sentient beings and is equal and nondual to them, this statement isn't false; may my dragons be extinguished in the hot season of fire.",
        "source": "T13n0397_044:0291c03_4"
    },
    {
        "source_sentence": "作是誓已，火炎皆滅。",
        "translation": "After he made this vow, the fire and flames all went out.",
        "source": "T13n0397_044:0291c05_5"
    },
    {
        "source_sentence": "時餓龍等乃至八過，以手捧水洗如來足，至心懺悔：「我從今日更不造惡。」",
        "translation": "The hungry dragon and others then had eight faults, picked up water with their hands to wash the Tathāgata's feet with water, and repented wholeheartedly, From today, I won't do evil again.",
        "source": "T13n0397_044:0291c06_0"
    },
    {
        "source_sentence": "如是懺已，各白佛言：「如來大慈願救濟我。」",
        "translation": "After repenting in this way, they each said to the Buddha, The Tathāgata's great compassionate vow is to save me.",
        "source": "T13n0397_044:0291c07_1"
    },
    {
        "source_sentence": "佛言：「諸龍！",
        "translation": "The Buddha said, dragons!",
        "source": "T13n0397_044:0291c08_2"
    },
    {
        "source_sentence": "汝此惡業有餘未盡，彌勒佛世當得人身，值佛出家精進持戒得羅漢果。」",
        "translation": "If this bad action of yours hasn't ended, Maitreya Buddha will attain personal status in the world and meet the Buddha, leave home, diligently observe precepts, and attain the fruit of the arhat.",
        "source": "T13n0397_044:0291c08_3"
    },
    {
        "source_sentence": "時諸龍等得宿命心，自念過業啼泣雨面，各如是言：「我憶往昔於佛法中，",
        "translation": "The dragons then became aware of their past destinies and thought of their past actions, weeping and raining tears on their faces. Each of them said, “I remember that in the past when I was practicing the buddha-dharma (i.",
        "source": "T13n0397_044:0291c10_4"
    },
    {
        "source_sentence": "或為俗人親屬因緣，或復聽法來去因緣，所有信心，捨施種種華果飲食，",
        "translation": "They may give various kinds of flowers, fruits, food, and drink for the sake of their relatives in the secular world, or they may listen to the teaching for the sake of the causes and conditions of coming and going.",
        "source": "T13n0397_044:0291c12_5"
    },
    {
        "source_sentence": "共諸比丘依次而食。」",
        "translation": "Together with the monks, they ate in order.",
        "source": "T13n0397_044:0291c13_6"
    },
    {
        "source_sentence": "或有說云：「我曾喫噉四方眾僧華果飲食。」",
        "translation": "Some people say, I once ate the flowers, fruits, and food of the saṃgha in the four directions.",
        "source": "T13n0397_044:0291c14_7"
    },
    {
        "source_sentence": "或有說言：「我往寺舍布施眾僧；",
        "translation": "Some people said, “I go to a monastery and make offerings to the sangha.",
        "source": "T13n0397_044:0291c15_8"
    },
    {
        "source_sentence": "或復禮拜，如是喫噉。」",
        "translation": "Or they may also venerate it and thus eat it.",
        "source": "T13n0397_044:0291c16_9"
    },
    {
        "source_sentence": "或復說言：「我毘婆尸如來法中曾作俗人。」",
        "translation": "Or they might also say, I was once a layman in the Tathāgata's teaching of Vipaśyin.",
        "source": "T13n0397_044:0291c16_10"
    },
    {
        "source_sentence": "或復有說：「我尸棄佛如來法中曾作俗人。」",
        "translation": "Some people also say, I once became a layman in the Tathāgata's teaching of Śikhin Buddha.",
        "source": "T13n0397_044:0291c17_11"
    },
    {
        "source_sentence": "或復有說：「我毘葉婆如來法中曾作俗人。」",
        "translation": "Some people also say, I was once a layman in the Tathāgata's teaching of Vaiśravaṇa.",
        "source": "T13n0397_044:0291c18_12"
    },
    {
        "source_sentence": "或復有說：「我迦羅拘村駄佛法之中曾作俗人。」",
        "translation": "Or another person might say, I was once a layman in the Kālākośinagara Buddha's teaching.",
        "source": "T13n0397_044:0291c19_13"
    },
    {
        "source_sentence": "或復有說：「我迦那迦牟尼佛法之中曾作俗人。」",
        "translation": "Some people also say, I once became a layman in the teaching of Kanakamuni Buddha.",
        "source": "T13n0397_044:0291c20_14"
    },
    {
        "source_sentence": "或復有說：「我迦葉佛如來法中曾作俗人。」",
        "translation": "Some people also say, I Kāśyapa Buddha once became a layman in the Tathāgata's teaching.",
        "source": "T13n0397_044:0291c21_15"
    },
    {
        "source_sentence": "或復有說：「我釋迦牟尼佛法之中曾作俗人；",
        "translation": "Some other practitioners assert, “I was once a layman in the buddha-dharma of Śākyamuni Buddha.",
        "source": "T13n0397_044:0291c22_16"
    },
    {
        "source_sentence": "或以親舊問訊，因緣；",
        "translation": "Or they may exchange greetings with their relatives and old friends, according to the causes and conditions.",
        "source": "T13n0397_044:0291c23_17"
    },
    {
        "source_sentence": "或復來去聽法因緣，往還寺舍。",
        "translation": "Or they may come and go again to listen to the causes and conditions of the Dharma, going back and forth from one monastery to another.",
        "source": "T13n0397_044:0291c24_18"
    },
    {
        "source_sentence": "有信心人供養僧故，捨施華果種種飲食。",
        "translation": "Because faithful people make offerings to the saṃgha, they give up flowers, fruits, and various foods.",
        "source": "T13n0397_044:0291c24_19"
    },
    {
        "source_sentence": "比丘得已迴施於我我得便食。",
        "translation": "After he gets it, the monk returns it to me and gives it to me. I'll then eat it.",
        "source": "T13n0397_044:0291c25_20"
    },
    {
        "source_sentence": "彼業因緣，於地獄中經無量劫，大猛火中或燒或煮，或飲洋銅，或吞鐵丸。",
        "translation": "Because of the causes and conditions of their actions, they spent measureless eons in hell, either burned or cooked, drank hot copper, or swallowed an iron ball in a great fierce fire.",
        "source": "T13n0397_044:0291c26_21"
    },
    {
        "source_sentence": "從地獄出墮畜生中，捨畜生身生餓鬼中，如是種種備受辛苦。",
        "translation": "They emerge from hell and fall into the animal kingdom, abandon their bodies as animals and be born among hungry ghosts, thus being subject to various kinds of hardships.",
        "source": "T13n0397_044:0291c28_22"
    },
    {
        "source_sentence": "惡業未盡，生此龍中常受苦惱，熱水爛身熱風吹體，熱沙熱土熱糞熱灰，",
        "translation": "Before their evil deeds have ended, they'll be born among these dragons and always experience pain and suffering. Their bodies are scorched by hot water, blown away by hot air, hot sand, hot dirt, hot dung, hot ashes",
        "source": "T13n0397_044:0291c29_23"
    },
    {
        "source_sentence": "食入口中變成銅汁或作鐵丸。",
        "translation": "In the food's mouth, it turns into copper juice or becomes an iron ball.",
        "source": "T13n0397_044:0292a02_24"
    },
    {
        "source_sentence": "於一切時，所食之物，入口口焦，入咽咽爛，入腹腹然，直過墮地遍體穿穴，",
        "translation": "At all times the food they eat enters into their mouths and throats, goes straight up through their bellies and stomachs, drops to the ground, penetrates throughout their bodies, and digests.",
        "source": "T13n0397_044:0292a02_25"
    },
    {
        "source_sentence": "受如是苦不可堪忍，惟願如來慈哀救濟。」",
        "translation": "Such suffering is intolerable, so may the Tathāgata be compassionate and rescue them.",
        "source": "T13n0397_044:0292a04_26"
    },
    {
        "source_sentence": "佛告諸龍：「此之惡業與盜佛物等無差別，比丘逆業其罪如半，然此罪報受未盡故難可得脫。",
        "translation": "The Buddha told the dragons, There's no difference between this bad action and stealing the Buddha's property, etc., and the monk's heinous act is like half a sin, but it's difficult to be freed because the retribution for",
        "source": "T13n0397_044:0292a05_27"
    },
    {
        "source_sentence": "汝等今當盡受三歸一心修善，以此緣故於賢劫中值最後佛名曰樓至，於彼佛世罪得除滅。」",
        "translation": "Now, you must all accept the three refuges and cultivate wholesomeness with a single mind of unity; for this reason, in the good eon, you'll meet the last Buddha named Ruci, who will remove your sins in that Buddha's",
        "source": "T13n0397_044:0292a07_28"
    },
    {
        "source_sentence": "時諸龍等聞是語已，皆悉至心盡其形壽各受三歸。",
        "translation": "When the dragons and others heard these words, they all wholeheartedly accepted the three refuges for as long as their bodies and lives.",
        "source": "T13n0397_044:0292a09_29"
    },
    {
        "source_sentence": "時彼眾中有盲龍女，口中膖爛滿諸雜蟲狀如屎尿，乃至穢惡猶若婦人根中不淨臊臭難看，",
        "translation": "In the midst of that crowd, there was a blind dragon-maiden whose mouth was fragrant and full of all sorts of worms in the shape of excrement and urine, or dirty like a woman's faculties that were imp",
        "source": "T13n0397_044:0292a10_30"
    },
    {
        "source_sentence": "種種噬食膿血流出，一切身分常為蚊虻、諸惡毒蠅之所唼食，身體臭處難可見聞。",
        "translation": "Various kinds of devourers and pus and blood flow out, and all their bodies are always eaten by mosquitoes, gadflies, and bad poisonous flies that can't be seen or heard where their bodies smell bad.",
        "source": "T13n0397_044:0292a13_0"
    },
    {
        "source_sentence": "爾時，世尊以大悲心見彼龍婦眼盲困苦，如是問言：「妹何緣故得此惡身，",
        "translation": "At that time the World-honored One, overwhelmed with great compassion and seeing the dragon queen’s eyes blind and distressed, asked her in this way:",
        "source": "T13n0397_044:0292a14_1"
    },
    {
        "source_sentence": "於過去世曾為何業？」",
        "translation": "What actions did you do in a past life?",
        "source": "T13n0397_044:0292a16_2"
    },
    {
        "source_sentence": "龍婦答言：「世尊！",
        "translation": "The dragon woman replied, Bhagavān!",
        "source": "T13n0397_044:0292a17_0"
    },
    {
        "source_sentence": "我今此身眾苦逼迫無暫時停，設復欲言而不能說。",
        "translation": "'Now, this body of mine is constantly oppressed by suffering and doesn't stop for a while, and even if I want to say it again, I can't say it.",
        "source": "T13n0397_044:0292a17_1"
    },
    {
        "source_sentence": "我念過去三十六億於百千年生惡龍中受如是苦，乃至日夜剎那不停，為我往昔九十一劫於毘婆尸佛法之中作比丘尼，",
        "translation": "I remember that in the past three billion six hundred million years ago I was born among evil dragons and suffered these kinds of pain for a hundred thousand years. Day and night, without ceasing, day and night, I served as a bhikṣuṇī",
        "source": "T13n0397_044:0292a18_2"
    },
    {
        "source_sentence": "思念欲事過於醉人，雖復出家不能如法。",
        "translation": "He thinks of the things he wants more than a drunken man, and even though he leaves home, he can't follow the teaching.",
        "source": "T13n0397_044:0292a21_3"
    },
    {
        "source_sentence": "於伽藍內敷施床褥，數數犯於非梵行事，以快欲心生大樂受，或貪求他物多受信施。",
        "translation": "In the monastery, he spreads out a bed or bedding inside the monastery, repeatedly violates non-Buddhist practices, experiences great pleasure with joy and desire, or clings to other things and often accepts faithful gifts.",
        "source": "T13n0397_044:0292a22_4"
    },
    {
        "source_sentence": "以如是故於九十一劫，常不得受天人之身，恒三惡道受諸燒煮。」",
        "translation": "Because of this, for ninety-one eons, they'll always be unable to receive the bodies of gods and humans, and they'll always suffer burns in the three bad destinies.",
        "source": "T13n0397_044:0292a24_5"
    },
    {
        "source_sentence": "佛又問言：「若如是者，此中劫盡妹何處生？」",
        "translation": "The Buddha again asked, If that's the case, where will my sister be born here when the eon ends?",
        "source": "T13n0397_044:0292a25_6"
    },
    {
        "source_sentence": "龍婦答言：「我以過去業力因緣生餘世界，彼處劫盡，惡業風吹還來生此。」",
        "translation": "The dragon woman answered, I was born in another world because of the causes and conditions of past karma, and when that world's eon ends, a wind of bad karma blows back to this place.",
        "source": "T13n0397_044:0292a26_7"
    },
    {
        "source_sentence": "時彼龍婦說此語已，作如是言：「大悲世尊！",
        "translation": "After speaking these words, the dragon woman said, Great compassion, Bhagavān!",
        "source": "T13n0397_044:0292a28_8"
    },
    {
        "source_sentence": "願救濟我，願救濟我！」",
        "translation": "May I be rescued, may I be rescued!",
        "source": "T13n0397_044:0292a29_9"
    },
    {
        "source_sentence": "爾時，世尊以手掬水，告龍女言：「此水名為瞋陀留脂藥和，我今誠實發言語汝，",
        "translation": "At that moment, the World-honored One scooped up some water with his hands and said to the dragon maidens: This water is called ‘Hitra’s Body.’ “With sincerity I am now telling you this:",
        "source": "T13n0397_044:0292a29_10"
    },
    {
        "source_sentence": "我於往昔為救鴿故棄捨身命，終不疑念起慳惜心，此言若實，令汝惡患悉皆除差。」",
        "translation": "In the past, I abandoned my body and life for the sake of saving a pigeon and never doubted or thought of being stingy; if this statement is true, it will remove all your bad afflictions.",
        "source": "T13n0397_044:0292b02_11"
    },
    {
        "source_sentence": "時佛世尊以口含水，灑彼盲龍婦女之身，一切惡患臭處皆差。",
        "translation": "The Bhagavān then put water in his mouth and sprinkled it on the body of that blind dragon woman, and all bad and foul smells and pains were eliminated.",
        "source": "T13n0397_044:0292b04_12"
    },
    {
        "source_sentence": "既得差已，作是說言：「我今於佛乞受三歸。」",
        "translation": "After he had received the instruction, he said, Now, I'll beg the Buddha to accept the three refuges.",
        "source": "T13n0397_044:0292b05_13"
    },
    {
        "source_sentence": "是時，世尊，即為龍女授三歸依。",
        "translation": "The Bhagavān then gave the three refuges to the dragon-maiden.",
        "source": "T13n0397_044:0292b06_14"
    },
    {
        "source_sentence": "時彼眾中復有一龍，種種臭惡一切諸蟲，滿其口中及咽喉內膿血流出，",
        "translation": "Again, there was another dragon in the assembly. All kinds of foul-smelling insects filled their mouths and throats with pus and blood pouring out from their throats.",
        "source": "T13n0397_044:0292b07_15"
    },
    {
        "source_sentence": "有見聞者皆悉捨去。",
        "translation": "Those who see and hear it will all abandon it.",
        "source": "T13n0397_044:0292b09_16"
    },
    {
        "source_sentence": "時佛見已，即便問言：「善男子！",
        "translation": "Seeing it, the Buddha then asked, Good man!",
        "source": "T13n0397_044:0292b09_17"
    },
    {
        "source_sentence": "汝於過去作何惡業受如是報？」",
        "translation": "What bad actions did you do in the past that resulted this kind of retribution?",
        "source": "T13n0397_044:0292b10_18"
    },
    {
        "source_sentence": "彼龍張口，於其口內出種種蟲，膿血流溢猶如熱火。",
        "translation": "When that dragon opens its mouth, various worms emerge from within it, and pus and blood flow like hot fire.",
        "source": "T13n0397_044:0292b11_0"
    },
    {
        "source_sentence": "雖復張口，竟不能言，即還閉口。",
        "translation": "Even though he opened his mouth, he couldn't say anything, so he closed his mouth again.",
        "source": "T13n0397_044:0292b12_1"
    },
    {
        "source_sentence": "「汝以過去盜因緣，　　輕戲聖人受是報；",
        "translation": "Because of the causes and conditions of thieving in the past, You were a frivolous sage who received this retribution.",
        "source": "T13n0397_044:0292b12_2"
    },
    {
        "source_sentence": "　至誠聽我此實言，　　即得清涼滅諸苦。」",
        "translation": "Listen with sincerity to my true words, and you'll attain clarity and coolness and cease suffering.",
        "source": "T13n0397_044:0292b12_2"
    },
    {
        "source_sentence": "爾時，世尊即為彼龍而說偈言：爾時，世尊說實語已，即以少水瀉龍口中，",
        "translation": "Then the World-honored One spoke these verses to the dragon: At that moment, having uttered these words of truth, the World-honored One poured a little water into the dragon’s mouth.",
        "source": "T13n0397_044:0292b12_2"
    },
    {
        "source_sentence": "火及蟲膿悉皆滅盡。",
        "translation": "The fire and the pus of insects all cease.",
        "source": "T13n0397_044:0292b16_3"
    },
    {
        "source_sentence": "龍口清涼，作如是言：「大聖如來！",
        "translation": "The dragon's mouth was clear and cool, and he said, Great sage, Tathāgata!",
        "source": "T13n0397_044:0292b17_4"
    },
    {
        "source_sentence": "我憶過去迦葉佛時，曾作俗人在田犁地。",
        "translation": "I recall that in the past, at the time of Kāśyapa Buddha, I was once a layman in a field or plow.",
        "source": "T13n0397_044:0292b18_5"
    },
    {
        "source_sentence": "有一比丘，來從我乞求五十錢，我時報言：『聽待穀熟當與汝食。』",
        "translation": "A monk came to me and begged for fifty coins, and I told him, 'Listen while the grain is cooked; I'll give you food.'",
        "source": "T13n0397_044:0292b19_6"
    },
    {
        "source_sentence": "比丘復言：『若當五十不可得者，願乞十文。』",
        "translation": "Again, the monk said, 'If there are fifty things that are unobtainable, I'd like to ask for ten words.'",
        "source": "T13n0397_044:0292b20_7"
    },
    {
        "source_sentence": "我於爾時瞋彼比丘，而語之言：『乃至十錢亦不相與。』",
        "translation": "At the time, I became angry with that monk and said to him, 'Even for ten coins, we won't give it to each other.'",
        "source": "T13n0397_044:0292b21_8"
    },
    {
        "source_sentence": "時彼比丘心生懊惱。",
        "translation": "That monk then became distressed.",
        "source": "T13n0397_044:0292b22_9"
    },
    {
        "source_sentence": "又於餘時往寺舍中入樹林下，輒便盜取現在僧物十菴羅果而私食之。",
        "translation": "At other times, he went to a monastery and entered a forest under a tree in the forest, stole ten kinds of fruit from the property of the present-day saṃgha, and ate it privately.",
        "source": "T13n0397_044:0292b23_10"
    },
    {
        "source_sentence": "彼業因緣地獄受苦，惡業未盡生野澤中作餓龍身，常為種種諸蟲食噉，",
        "translation": "Because of the causes and conditions of those actions, they'll suffer in hell, and before their bad actions are ended, they'll be born in a wild marsh as a hungry dragon, always feeding on various insects.",
        "source": "T13n0397_044:0292b24_11"
    },
    {
        "source_sentence": "膿血流溢饑渴苦惱。",
        "translation": "Pus and blood flowed over him, and he suffered from hunger and thirst.",
        "source": "T13n0397_044:0292b26_12"
    },
    {
        "source_sentence": "又彼比丘以瞋忿心惡業緣故，死便即作小毒龍身，生我腋下[口*束]於我血，",
        "translation": "Again, that monk died because of the evil deeds of his anger and wrath. He was then reborn as a small poisonous dragon in the form of a poisonous serpent; he gave rise to my armpit [mouth*",
        "source": "T13n0397_044:0292b27_0"
    },
    {
        "source_sentence": "熱氣觸身不可堪忍，是故我身熱膿血滿。」",
        "translation": "It's unbearable to touch my body with feverish energy; therefore, my body is filled with feverish pus and blood.",
        "source": "T13n0397_044:0292b28_1"
    },
    {
        "source_sentence": "龍白佛言：「大悲世尊！",
        "translation": "The dragon said to the Buddha, Bhagavān!",
        "source": "T13n0397_044:0292b29_2"
    },
    {
        "source_sentence": "唯願慈哀救濟於我，令我脫彼怨家毒龍。」",
        "translation": "Please be compassionate and rescue me, so that I'll be freed from the poisonous dragons of those enemies.",
        "source": "T13n0397_044:0292c01_3"
    },
    {
        "source_sentence": "爾時，世尊以手抄水，發誠實語，作如是言：「我曾往昔於饑饉世，爾時願作大身眾生長廣無量，",
        "translation": "At that time the World-honored One drew water from his hand and, speaking sincerely, said these words: Once in the past, when I was hungry, I wished to create a large body of immeasurable stature.",
        "source": "T13n0397_044:0292c02_0"
    },
    {
        "source_sentence": "以神通力於虛空中唱如是言：『彼野澤中有大身蟲名曰不瞋，汝等可往取其身肉以為飲食，",
        "translation": "With supernatural powers, they called out in the sky, saying: In that wild marsh there is a large-bodied worm named Sadāparvata. Go get its flesh and bones to feed it.",
        "source": "T13n0397_044:0292c04_1"
    },
    {
        "source_sentence": "可得不饑。』",
        "translation": "It's possible to be without hunger.'",
        "source": "T13n0397_044:0292c06_2"
    },
    {
        "source_sentence": "時彼世中人、非人等，聞此聲已一切悉往競取食之。」",
        "translation": "People and non-people in those worlds then heard this sound and all went to compete for food to eat it.",
        "source": "T13n0397_044:0292c06_3"
    },
    {
        "source_sentence": "說是真實諦信語時，彼龍腋下小龍即出。",
        "translation": "When he spoke these words of faith in the true truth, the small dragon under that dragon's armpit emerged.",
        "source": "T13n0397_044:0292c07_4"
    },
    {
        "source_sentence": "時此二龍俱白佛言：「世尊！",
        "translation": "These two dragons then both said to the Buddha, Bhagavān!",
        "source": "T13n0397_044:0292c08_5"
    },
    {
        "source_sentence": "我等久近離此龍身解脫殃罪？」",
        "translation": "How long have we been separated from this dragon's body and liberated from the blameworthiness of suffering?",
        "source": "T13n0397_044:0292c09_6"
    },
    {
        "source_sentence": "佛告龍言：「此業大重次五無間。",
        "translation": "The Buddha told the dragon, This action is so serious that it's followed by five kinds of unremitting karma.",
        "source": "T13n0397_044:0292c09_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_044:0292c10_8"
    },
    {
        "source_sentence": "若有四方常住僧物，或現前僧物，篤信檀越重心施物，或華或果或樹或園，",
        "translation": "If there are property belonging to the saṃgha, which always abides in the four directions, or property belonging to the saṃgha that is presented to them, and if they believe in giving it with affection as donors, such as flowers, fruits",
        "source": "T13n0397_044:0292c10_9"
    },
    {
        "source_sentence": "飲食資生床褥敷具疾病湯藥一切所須，私自費用或持出外，乞與知識親里白衣，",
        "translation": "They provide food, drink, bedding, beds, mattresses, bedding, medicine for the ill, and all other necessities of life. At their own expense or by taking them outside, they beg to be given to their relatives in white robes",
        "source": "T13n0397_044:0292c12_10"
    },
    {
        "source_sentence": "此罪重於阿鼻地獄所受果報。",
        "translation": "This sin is heavier than the retribution received in Avīci Hell.",
        "source": "T13n0397_044:0292c14_11"
    },
    {
        "source_sentence": "是故汝等可受三歸，歸三寶已乃可得住於冷水中，如是三稱三受，身即安隱得入水中。」",
        "translation": "That's why you can accept the three refuges, and after returning to the Three Treasures, you can then abide in cold water; thus, these are the three calls for the three sensations, and your bodies will be able to enter the water",
        "source": "T13n0397_044:0292c15_12"
    },
    {
        "source_sentence": "「寧以利刀自割身，　　支節身分肌膚肉，",
        "translation": "Rather you should cut your own bodies with a sharp sword, skinning the flesh on your limbs and chest.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　所有信心捨施物，　　俗人食者實為難。",
        "translation": "It's really difficult for a layman to give away the things he gives with faith, and it's really difficult for someone who eats.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　寧吞大赤熱鐵丸，　　而使口中光焰出，",
        "translation": "Rather you should swallow a great red hot iron ball And cause light and flame to emanate from your mouth.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　所有眾僧飲食具，　　不應於外私自用。",
        "translation": "All the food and drink provisions for the assembly of monks Should not be used privately or externally.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　寧以大火若須彌，　　以手捉持而自食，",
        "translation": "Rather take a great fire like Mount Sumeru, hold it in your hand and eat it for yourself.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　其有在家諸俗人，　　不應輒食施僧食。",
        "translation": "If there are laypeople at home, they shouldn't eat and give food to the saṃgha as an offering.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　寧以利刀自屠膾，　　身體皮膜而自噉，",
        "translation": "They would rather be slaughtered and tortured by themselves with a sharp sword, Having their bodies covered with skin and flesh.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　其有在家諸俗人，　　不應受取僧雜食。",
        "translation": "If there are laypeople who live at home, they shouldn't accept the food of the saṃgha and take it.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　寧以自身投於彼，　　滿室大火猛焰中，",
        "translation": "I'd rather throw myself into that place, Filling my room with a great fire and blazing flame.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　其有在家俗人輩，　　不應坐臥僧床席。",
        "translation": "If there are laypeople and secular people, they shouldn't sit or lie on the saṃgha's bed or seat.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　寧以火熱炎鐵錐，　　拳手握持便焦爛，",
        "translation": "It's better to use a hot iron cone, and when you hold it with your fist and hand, it's scorched.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　其有在家俗人等，　　不應私用於僧物。",
        "translation": "If there are laypeople, laymen, and so forth, They should not privately use the property of the Sangha.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　寧以勝利好刀枮，　　而自臠切其身肉，",
        "translation": "They would rather kill themselves with a superior sword than cut their own flesh.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　勿於出家清淨人，　　發起一念瞋恚心。",
        "translation": "Don't give rise to a single thought of anger toward renunciant and pure people.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　寧以自手挑兩眼，　　捐棄投之擲於地，",
        "translation": "Rather, he picks out the two eyes with his own hand and throws them to the ground.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　其有習行善法者，　　不應懷忿瞋心視。",
        "translation": "Those who practice the good Dharma shouldn't harbor anger or look at them with anger.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　寧以熱鐵鍱其身，　　東西起動行坐臥，",
        "translation": "They would rather eat their bodies with hot iron, Carrying them to the east and west, Walking, sitting, or lying down.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　不應瞋忿心妬嫉，　　而著眾僧淨施衣。",
        "translation": "You should not be angry and jealous And wear the robes of pure giving for the sake of the Sangha.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　寧飲灰汁鹹鹵水，　　熱沸爍口猶如火，",
        "translation": "They prefer to drink ashes, juice, salty water, and salty water. Their mouths are boiled like fire in the midst of heat.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "　不應懷貪毒惡心，　　服食眾僧淨施藥。」",
        "translation": "You shouldn't harbor a mind of greed, poisonousness, or badness, and take food from the saṃgha to give medicine purely.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "爾時，世尊即為諸龍而說偈言：爾時，世尊說此偈已，一萬四千諸龍眾等悉受三歸，",
        "translation": "Then the World-honored One spoke these verses to the nāgas: At that time, after having uttered these verses, the assembly of one thousand fourteen thousand nāgas undertook the three kinds of rebirth.",
        "source": "T13n0397_044:0292c17_13"
    },
    {
        "source_sentence": "所有過去現在業報諸苦惱中而得解脫，深信三寶其心不退。",
        "translation": "Being liberated from all the sufferings and afflictions of past and present karmic retribution, they deeply believe in the Three Treasures and their minds don't regress.",
        "source": "T13n0397_044:0293a10_14"
    },
    {
        "source_sentence": "復有八十億諸龍眾等，亦於三寶起歸敬心。",
        "translation": "Also, there are eight billion dragons and others who also give rise to reverence for the Three Treasures.",
        "source": "T13n0397_044:0293a11_15"
    },
    {
        "source_sentence": "爾時，世尊告憍陳如：「汝觀此等諸惡眾生自誑其心，或以怖畏貧窮因緣，",
        "translation": "It was then that the World-honored One said to Kauṇḍinya:",
        "source": "T13n0397_044:0293a12_16"
    },
    {
        "source_sentence": "或於惡道生於恐畏修行善法，或作比丘所得種種資生之具，皆是信心檀越所施，",
        "translation": "They may become frightened by fear in the evil destinies and practice the good Dharma, or they may become a monk who obtains various necessities that are all given by faithful donors.",
        "source": "T13n0397_044:0293a14_17"
    },
    {
        "source_sentence": "而是眾生或自食噉，或與他人或共眾人，盜竊隱藏私處自用，如是業故墮三惡道久受勤苦。",
        "translation": "Rather, sentient beings may eat food for themselves, give it to others or share it with others, steal it, hide it, and privately use it for themselves, and because of such actions they fall into the three bad destinies and experience long-lasting",
        "source": "T13n0397_044:0293a16_18"
    },
    {
        "source_sentence": "復有眾生，貧窮下賤不得自在，是故出家望得富饒解脫安樂。",
        "translation": "Again, there are sentient beings who are poor and inferior and don't attain self-dependence, so they leave home hoping to attain prosperity and liberation and peace.",
        "source": "T13n0397_044:0293a18_19"
    },
    {
        "source_sentence": "既出家已，懈怠嬾墮不讀誦經，禪慧精勤捨而不習，樂知僧事。",
        "translation": "Having renounced the householder’s life, he became indolent and fell into idleness. He did not recite sutras; his practice of Chan [Seon\\/Zen] with diligence abstained from chanting them; and took delight",
        "source": "T13n0397_044:0293a19_20"
    },
    {
        "source_sentence": "「復有比丘晝夜精勤樂修善法，讀誦經典坐禪習慧不捨須臾，以是因緣感諸四輩種種供養。",
        "translation": "Again, there are monks who diligently cultivate the good Dharma day and night, recite sūtras, sit in meditation, practice wisdom, and don't abandon it for a single moment. Because of these causes and conditions, they bring various offerings to the four groups",
        "source": "T13n0397_044:0293a21_21"
    },
    {
        "source_sentence": "時知事人得利養已，或自私食或復盜與親舊俗人，以是等緣久處惡道出已還入，",
        "translation": "When they know that their servants have gained profit, they may eat for themselves or steal and give it to their relatives and old laypeople. Because of these conditions, they've been in a bad path for a long time, leaving and returning after emer",
        "source": "T13n0397_044:0293a23_22"
    },
    {
        "source_sentence": "如是愚瞑不見當來果報輕重。",
        "translation": "Thus, he's ignorant and doesn't see the relative seriousness of future rewards.",
        "source": "T13n0397_044:0293a25_23"
    },
    {
        "source_sentence": "我今戒勅沙門弟子，念法住持不得自稱我是沙門真法行人，猗眾僧故。",
        "translation": "Now, I precept an ascetic disciple who's mindful of the teaching and doesn't abide in it to claim to be an ascetic or true practitioner of the teaching because he disturbs the saṃgha.",
        "source": "T13n0397_044:0293a25_24"
    },
    {
        "source_sentence": "他信施物，或餅或果或菜或華，但是眾僧所食之物，不得輒與一切俗人，",
        "translation": "If someone else believes in giving things like cakes, fruits, vegetables, or flowers, but what the saṃgha eats, they can't easily give them to all the laypeople.",
        "source": "T13n0397_044:0293a27_25"
    },
    {
        "source_sentence": "亦不得云此是我物別眾而食；",
        "translation": "Nor can they say, “This is my property; it belongs to a certain group of people and I am eating it.",
        "source": "T13n0397_044:0293a29_26"
    },
    {
        "source_sentence": "又亦不得以眾僧物貯積，興生種種販賣云有利益招世譏嫌，又亦不得出貴收賤與世爭利；",
        "translation": "Nor should they store up the goods of the Sangha and produce various kinds of merchandising, saying that profit is to be gained in order to invite criticism from the world. Nor should they give away their valuables or collect what is less valuable and compete",
        "source": "T13n0397_044:0293a29_27"
    },
    {
        "source_sentence": "又亦不得為於飲食及僧因緣，使諸眾生墮三惡道，應須勸引安善法中，",
        "translation": "Also, they should not cause sentient beings to fall into the three evil destinies for the sake of food, drink, or the saṃgha. They should be encouraged to lead a peaceful life in the good Dharma.",
        "source": "T13n0397_044:0293b02_28"
    },
    {
        "source_sentence": "令比丘眾真信三寶，攝諸眾生乃至父母，令得安隱置三解脫。」",
        "translation": "It causes the monks and others to truly believe in the Three Treasures, gathering in sentient beings and even their parents so that they can attain the three liberations of peace.",
        "source": "T13n0397_044:0293b04_29"
    },
    {
        "source_sentence": "◎大集經卷第四十四",
        "translation": "*Mahāmegha-sūtra, Volume 44",
        "source": "T13n0397_044:0293b06_0"
    }
]