[
    {
        "source_sentence": "佛說海意菩薩所問淨印法門經",
        "translation": "Foshuo haiyi pusa suowen jingying famen jing",
        "source": "T13n0400_001:0473c04_0"
    },
    {
        "source_sentence": "卷第一",
        "translation": "Vol. 1",
        "source": "T13n0400_001:0473c05_0"
    },
    {
        "source_sentence": "譯經三藏朝散大夫試鴻臚卿光梵大師賜紫沙門臣惟淨等奉　詔譯如是我聞：一時，",
        "translation": "Thus have I heard. At one time, when the transla­ tion of the scriptures was undertaken by the Tripitaka Master Vaiśravaṇa, to be done before the assembly of monks and laymen who had received the imperial edict from the great teacher Vimalakīrti:",
        "source": "T13n0400_001:0473c07_0"
    },
    {
        "source_sentence": "世尊住於如來神通境界大寶莊嚴最勝道場大菩薩宮中——而彼道場皆是如來威神建立，",
        "translation": "Bhagavān, the World-honored One was staying at the great jeweled site of enlightenment in the sphere of the superknowledges of the Tathāgata in the palace of the great bodhisattva Mahāprajāpatīṣṭacāritra.",
        "source": "T13n0400_001:0473c09_1"
    },
    {
        "source_sentence": "積集廣大勝福莊嚴，圓滿廣大福智妙行，現轉一切佛法勝報，顯示如來無邊神變加持之力，",
        "translation": "They accumulate vast adornments of supreme virtue, perfect great practices of virtue and knowledge, manifest the excellent rewards of all buddha-teachings, show the power of the Buddha’s boundless magical empowering empowerment.",
        "source": "T13n0400_001:0473c11_2"
    },
    {
        "source_sentence": "善入無礙境界大智，一切見者生大喜悅；",
        "translation": "Great knowledge entering well into the unobstructed realm of reality, great joy and delight arose in all who saw.",
        "source": "T13n0400_001:0473c13_3"
    },
    {
        "source_sentence": "入念慧行普遍運行無動妙智，於無邊劫修集無量眾功德聚；",
        "translation": "“Great enlightening beings’ practice of mindfulness and wisdom universally develop unshakable subtle knowledge, cultivating measureless stores of virtue over boundless eons.",
        "source": "T13n0400_001:0473c14_4"
    },
    {
        "source_sentence": "而佛世尊，現證諸法平等覺道，轉妙法輪，能善調伏無邊學眾，已於諸法得大自在；",
        "translation": "The Buddha, the World-honored One, having now realized the path of equal enlightenment regarding all things, turning the wheel of the sublime teaching, able to skillfully tame boundless learners, has attained great freedom in regard to all things.",
        "source": "T13n0400_001:0473c15_5"
    },
    {
        "source_sentence": "善知一切眾生心意及諸根性，已能到於最上彼岸；",
        "translation": "They know the minds, thoughts, and faculties of all sentient beings well; they are able to reach the utmost shore.",
        "source": "T13n0400_001:0473c17_6"
    },
    {
        "source_sentence": "善斷一切種子習氣，得無發悟佛身輕安。",
        "translation": "He well eliminates all the karmic impressions of seeds and attains a light and peaceful body that doesn't give rise to awakening.",
        "source": "T13n0400_001:0473c19_7"
    },
    {
        "source_sentence": "是時與大苾芻之眾六百八十萬人俱，皆住近心，悉斷一切煩惱種習，皆是如來法王之子；",
        "translation": "At that time he was accompanied by six million and eighty thousand bhikṣus, all of whom were disciples of the Buddha. All of them had abandoned the seeds of all defilements in their minds; they were all the offspring of the enlightened ones, the heirs of the King of Truth.",
        "source": "T13n0400_001:0473c20_0"
    },
    {
        "source_sentence": "能善出生諸無所得甚深法行，身相端嚴威儀圓備，作大福田正智具足。",
        "translation": "They can skillfully produce profound, ungraspable practices of the Dharma, their bodies are dignified and fully endowed with deportment, and they become great fields of merit and full of right knowledge.",
        "source": "T13n0400_001:0473c22_1"
    },
    {
        "source_sentence": "復有無量無數不思議無等比不可說不可說諸大菩薩摩訶薩眾，悉獲無所得菩薩智忍，",
        "translation": "“Furthermore, there were countless great enlightening beings, inconceivable, incomparable, incomparable, and untold numbers of great enlightening beings who had attained the tolerance of knowledge of enlightening beings’ attainments.",
        "source": "T13n0400_001:0473c23_2"
    },
    {
        "source_sentence": "已超菩薩灌頂之位，而能游戲無加行位菩薩神通，得無盡陀羅尼及諸菩薩陀羅尼門；",
        "translation": "Having gone beyond the state of coronation of enlightening beings, they can play with the spiritual powers of enlightening beings at the stage of nonexertion. They attain inexhaustible spells as well as all the practices of enlightening beings.",
        "source": "T13n0400_001:0473c25_3"
    },
    {
        "source_sentence": "於諸菩薩首楞嚴王三摩地中而得自在，一切眾生歡喜樂見；",
        "translation": "They attain mastery in the concentration of enlightening beings’ state of great spiritual command, and all sentient beings are delighted to see them.",
        "source": "T13n0400_001:0473c27_4"
    },
    {
        "source_sentence": "已得菩薩諸無礙解，出生菩薩無發悟行，深心安住殊妙莊嚴。",
        "translation": "Having attained the unobstructed understanding of enlightening beings, they give rise to enlightening practices without awakening and deeply abide in marvelous adornment.",
        "source": "T13n0400_001:0473c29_5"
    },
    {
        "source_sentence": "其名曰：無盡藏菩薩摩訶薩、無量慧菩薩摩訶薩、無邊慧菩薩摩訶薩、無緣觀菩薩摩訶薩、常精進菩薩摩訶薩、精進慧菩薩摩訶薩、無斷辯才菩薩摩訶薩、無著無畏積菩薩摩訶薩、畢竟義慧菩薩摩訶薩。",
        "translation": "Their names were Inexhaustible Treasury Bodhisattva Mahāsattva, Immeasurable Wisdom Bodhisattva Mahāsattva, Bodhisattva Mahāsattva of Infinite Wisdom, Bodhisattva Mahāsattva of Boundless Wisdom, Bodhisattva Mahāsattva of Conditionless Contemplation, Bodhisattva Mahā",
        "source": "T13n0400_001:0474a01_6"
    },
    {
        "source_sentence": "如是等無量無數不思議無等比不可說不可說諸大菩薩摩訶薩眾而共集會。",
        "translation": "Such are measureless, countless, inconceivable, peerless, incomparable, and ineffable great bodhisattva-mahāsattva congregations that assemble together.",
        "source": "T13n0400_001:0474a06_7"
    },
    {
        "source_sentence": "爾時世尊，以菩薩行位，方便出生無障礙門甚深正法，而用莊嚴諸菩薩道，",
        "translation": "At that time the Bhagavat, in the state of bodhisattva-practicing, skillfully produced the profound true teaching of unobstructed dharmas and adorned the paths of enlightening beings by means of them.",
        "source": "T13n0400_001:0474a09_0"
    },
    {
        "source_sentence": "成辦一切佛法力、無畏等真實智行，入一切法最上自在總持印門；",
        "translation": "Accomplishing the practice of true knowledge of all buddhas’ powers of teaching, their fearlessnesses, and so on, they entered the door of unimpeded universally-holding mudrā of mastery of all truths.",
        "source": "T13n0400_001:0474a10_1"
    },
    {
        "source_sentence": "入無礙解，決定出生大神通智妙境界門，宣示一切不退轉輪，普攝諸乘住平等理；",
        "translation": "Entering unhindered understanding, they definitely produce the boundless realm of great spiritual knowledge. They show all those who do not turn back the wheel of enlightening beings and embrace all vehicles to abide in equanimity.",
        "source": "T13n0400_001:0474a12_2"
    },
    {
        "source_sentence": "混入法界無分別性，隨諸眾生根性意樂開示演說。",
        "translation": "They enter the realm of reality without discriminating, revealing and expounding it according to the faculties, natures, intentions, and inclinations of sentient beings.",
        "source": "T13n0400_001:0474a14_3"
    },
    {
        "source_sentence": "隨知真實決定正法，破諸魔境；",
        "translation": "They know the true and determined right teaching, destroying all demonic realms.",
        "source": "T13n0400_001:0474a15_4"
    },
    {
        "source_sentence": "以深固法理，止息一切煩惱見等。",
        "translation": "Because it deeply establishes the principle of dharmas, it stops all afflictive views and so forth.",
        "source": "T13n0400_001:0474a16_0"
    },
    {
        "source_sentence": "入無著慧，宣說普遍廣大迴向善方便智。",
        "translation": "He enters into the wisdom of nonattachment and proclaims the knowledge of universally vast dedication of good skillful means.",
        "source": "T13n0400_001:0474a16_1"
    },
    {
        "source_sentence": "入一切佛平等性智，以無著加持法門如實決定宣說諸法。",
        "translation": "He enters the knowledge of the equality of all buddhas and explains the teachings with the unattached, empowering dharma-gate as they really are with certainty.",
        "source": "T13n0400_001:0474a17_2"
    },
    {
        "source_sentence": "於無分別、非無分別悉入平等，覺了甚深緣生之法，積集無量福智妙行。",
        "translation": "In nondiscriminating and nondiscriminating, they all enter equality, perceive the profound conditioned dharmas that arise by accumulating measureless meritorious and marvelous actions.",
        "source": "T13n0400_001:0474a19_3"
    },
    {
        "source_sentence": "佛身、語、心平等莊嚴，隨知一切念慧行等無盡慧門，以四聖諦理顯示聲聞乘法；",
        "translation": "The body, speech, and mind of buddhas are equally adorned. Understanding the inexhaustible doors of knowledge of all thoughts, wisdom, practices, and so on, they show the teachings of the vehicle of disciples by means of the principles of the four noble truths.",
        "source": "T13n0400_001:0474a20_4"
    },
    {
        "source_sentence": "以覺了身、心、智顯示緣覺乘法；",
        "translation": "By perception and understanding body, mind, and wisdom they show the teachings of the vehicle of enlightenment.",
        "source": "T13n0400_001:0474a22_5"
    },
    {
        "source_sentence": "以得一切智灌頂顯示大乘之法。",
        "translation": "By attaining the consecration of omniscience, he shows the great vehicle teaching.",
        "source": "T13n0400_001:0474a23_6"
    },
    {
        "source_sentence": "入一切法自在理中，出生如來無邊功德。",
        "translation": "Entering into the unimpeded principle of all dharmas, they give rise to the limitless merits of the Tathāgata.",
        "source": "T13n0400_001:0474a24_0"
    },
    {
        "source_sentence": "是故如來開示演說，施設表了，分別解釋，顯明宣暢。",
        "translation": "Therefore, the Tathāgata reveals and explains, defines and expresses, discerns and explains, and clearly proclaims it.",
        "source": "T13n0400_001:0474a24_1"
    },
    {
        "source_sentence": "爾時世尊，將說如是廣大甚深決定法時，忽然於此三千大千世界之中大水充滿，",
        "translation": "At that time, the World-honored One, just as he was about to expound such a vast and profound teaching of certainty, suddenly poured water all over this billion-world-galactic universe.",
        "source": "T13n0400_001:0474a27_0"
    },
    {
        "source_sentence": "猶如大海，下至地界，上至大寶莊嚴最勝道場。",
        "translation": "It's like the great ocean that goes down to the earth realm and rises up to the most excellent site of enlightenment adorned with great treasures.",
        "source": "T13n0400_001:0474a28_1"
    },
    {
        "source_sentence": "又如劫壞水災現時，一切三千大千世界，大水充滿，下至水輪混如一海，",
        "translation": "“Furthermore, just as when the calamity of floods occurs at the time of the cosmic age of destruction, all the great manifold cosmos is filled with a mass of water that flows down to the sphere of water like a sea.",
        "source": "T13n0400_001:0474b01_0"
    },
    {
        "source_sentence": "今此大水亦復如是。",
        "translation": "So it is with this great body of water.",
        "source": "T13n0400_001:0474b02_1"
    },
    {
        "source_sentence": "然此三千大千世界，如是大水一切充滿，其中國土城邑聚落及諸人民，",
        "translation": "In this billion-world-galactic universe, however, that great water fills all the cities, towns, villages, and people there.",
        "source": "T13n0400_001:0474b03_2"
    },
    {
        "source_sentence": "悉無所壞亦無障礙，及閻浮提諸四大洲乃至大海須彌山等，欲界諸天一切宮殿，",
        "translation": "They are all indestructible and unobstructed, as well as the four great continents of Jambudvfpa, up to the great ocean, Mount Sumeru, and all the palaces of the gods of the realm of desire.",
        "source": "T13n0400_001:0474b04_3"
    },
    {
        "source_sentence": "悉無少分損壞障礙。",
        "translation": "They all lack the hindrance of partial damage and destruction.",
        "source": "T13n0400_001:0474b06_4"
    },
    {
        "source_sentence": "先現如是相已，後復於此大水之中，出現俱胝那庾多百千廣大蓮花。",
        "translation": "After first displaying such a sign, he then appeared in the middle of this great water as many hundreds of millions of large lotus flowers as there are trillions of koṭinayutas.",
        "source": "T13n0400_001:0474b07_5"
    },
    {
        "source_sentence": "其花高顯，瑠璃為莖，帝青為枝，閻浮檀金而為其葉，吉祥藏寶以為其鬚，",
        "translation": "The flowers are high and prominent, with stems made of lapis lazuli. Tejaprabhā’s blue is its branch; the leaves are of jambu-gold; the precious treasure house of auspicious signs has golden hair on their beards.",
        "source": "T13n0400_001:0474b08_6"
    },
    {
        "source_sentence": "馬瑙為臺，真珠交絡；",
        "translation": "The terrace is made of agate and interlocked with genuine pearls.",
        "source": "T13n0400_001:0474b10_7"
    },
    {
        "source_sentence": "一一花有無數俱胝多百千葉，其葉量廣一俱盧舍。",
        "translation": "Each flower has countless koṭis of hundreds of thousands of leaves, and each leaf is one krośa in width.",
        "source": "T13n0400_001:0474b11_0"
    },
    {
        "source_sentence": "是諸蓮花於大寶莊嚴最勝道場中，涌現虛空，高一多羅樹，一切大眾坐蓮花上，",
        "translation": "These lotus flowers rose up into the sky from the great jewel-adorned, most excellent site of enlightenment, rising as high as a palm tree. All the masses sat on the lotus blossoms.",
        "source": "T13n0400_001:0474b12_1"
    },
    {
        "source_sentence": "於蓮花中隨其色相放大光明，是光普照十方無量阿僧祇佛剎。",
        "translation": "In the lotus flower, he emanates a great ray of light that illuminates measureless incalculable buddha-lands in the ten directions according to their colors and characteristics.",
        "source": "T13n0400_001:0474b14_2"
    },
    {
        "source_sentence": "此諸光明廣照耀時，而此會中一切大眾歎未曾有，合掌恭敬咸作是言：「今現如是希有瑞相，",
        "translation": "When these rays of light shone widely, the whole assembly marveled at this unprecedented phenomenon. They joined their palms in respect and said:",
        "source": "T13n0400_001:0474b15_3"
    },
    {
        "source_sentence": "將非世尊說妙法邪？」",
        "translation": "Will it not be the Bhagavān who teaches the wonderful Dharma?",
        "source": "T13n0400_001:0474b17_4"
    },
    {
        "source_sentence": "爾時，慈氏菩薩摩訶薩，見是廣大神變事已，即於所坐蓮花臺上，偏袒右肩右膝著地，",
        "translation": "At that time the great bodhisattva Maitreya, seeing these vast miraculous displays, stood on the lotus-flower dais where he was seated, bared his right shoulder and knelt with his right knee touching the ground.",
        "source": "T13n0400_001:0474b19_0"
    },
    {
        "source_sentence": "合掌向佛恭敬頂禮，而白佛言：「世尊！",
        "translation": "He joined his palms and bowed to the Buddha with respect and said to him, Bhagavān!",
        "source": "T13n0400_001:0474b20_1"
    },
    {
        "source_sentence": "何故今時先現是相？",
        "translation": "Why is this characteristic manifested first at the present time?",
        "source": "T13n0400_001:0474b21_2"
    },
    {
        "source_sentence": "而此三千大千世界之中大水充滿混如一海，其中復現俱胝那庾多百千蓮花高顯。",
        "translation": "In the middle of these 3,000 great one-thousand worlds, a great deal of water fills them up like a sea, and within it are shown hundreds of thousands of lotus blossoms as high as an ocean.",
        "source": "T13n0400_001:0474b22_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0400_001:0474b24_4"
    },
    {
        "source_sentence": "昔所未聞，昔所未見，如是廣大希有神變，願佛為說。」",
        "translation": "I've never heard or seen such a vast and rare miraculous transformation in the past, so may the Buddha explain it for me.",
        "source": "T13n0400_001:0474b24_5"
    },
    {
        "source_sentence": "佛告慈氏菩薩言：「慈氏當知！",
        "translation": "The Buddha told Maitreya Bodhisattva, Maitreya, you should know!",
        "source": "T13n0400_001:0474b26_0"
    },
    {
        "source_sentence": "下方去此佛剎，過十佛剎不可說俱胝那庾多百千微塵等數諸佛剎土，有世界名無量功德寶無垢殊妙莊嚴，",
        "translation": "“Below this buddha-land, past as many buddha-lands as atoms in untold millions of buddha-lands, there is a world called Pure Adornment of the Immeasurable Jewel of Virtue.",
        "source": "T13n0400_001:0474b26_1"
    },
    {
        "source_sentence": "彼土有佛，號海勝持慧遊戲出高神通如來、應供、正等正覺，今現住彼說法教化。",
        "translation": "In that land, there's a buddha named the Tathāgata of Supreme retaining Wisdom who plays and produces high supernormal powers, Worthy of Offerings, and Completely Awakened, who now lives there to teach and transform.",
        "source": "T13n0400_001:0474b29_2"
    },
    {
        "source_sentence": "彼有菩薩名曰海意，與出過算數諸大菩薩摩訶薩眾，將同來此娑婆世界，",
        "translation": "There was an enlightening being there named Hayagrīva, together with countless great assemblies of bodhisattvas and mahāsattvas, who were about to come to this sahā world.",
        "source": "T13n0400_001:0474c01_3"
    },
    {
        "source_sentence": "瞻禮恭敬供養於我，又復於我所說法中而有所問；",
        "translation": "They pay their respects to me and make offerings to me, and also ask questions about the doctrine I teach.",
        "source": "T13n0400_001:0474c03_4"
    },
    {
        "source_sentence": "以是因緣，先現瑞相。」",
        "translation": "Because of these causes and conditions, they first show their auspicious appearance.",
        "source": "T13n0400_001:0474c04_5"
    },
    {
        "source_sentence": "爾時，尊者舍利子白佛言：「世尊！",
        "translation": "At that point, Venerable Śāriputra said to the Buddha, Bhagavān!",
        "source": "T13n0400_001:0474c06_0"
    },
    {
        "source_sentence": "彼海意菩薩去此甚遠，何故世尊說彼菩薩能聞此會佛說法邪？」",
        "translation": "That ocean-thought bodhisattva is so far away from here, why did the Bhagavān say that bodhisattva could hear this assembly of buddhas teach the Dharma?",
        "source": "T13n0400_001:0474c06_1"
    },
    {
        "source_sentence": "佛言：「舍利子！",
        "translation": "The Buddha said, Śāriputra!",
        "source": "T13n0400_001:0474c08_2"
    },
    {
        "source_sentence": "如汝今時於我前聞所說正法，海意菩薩雖復住於彼世界中，而能聞我所說之法，",
        "translation": "“Furthermore, just as you have now heard the true teaching from me, so even though the bodhisattva Hayagrīva lives in those worlds, he is still able to hear my teaching.",
        "source": "T13n0400_001:0474c08_3"
    },
    {
        "source_sentence": "亦復如是。",
        "translation": "It's likewise.",
        "source": "T13n0400_001:0474c10_4"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T13n0400_001:0474c10_5"
    },
    {
        "source_sentence": "又如汝今現前觀我及諸大眾，彼海意菩薩能見我身及諸大眾，亦復如是。」",
        "translation": "Also, just as you're now observing me and the masses in front of you, so can that oceanic mind bodhisattva see my body and the masses, which is likewise.",
        "source": "T13n0400_001:0474c10_6"
    },
    {
        "source_sentence": "舍利子言：「希有世尊！",
        "translation": "Śāriputra said, Rarely, Bhagavān!",
        "source": "T13n0400_001:0474c12_7"
    },
    {
        "source_sentence": "諸菩薩摩訶薩所有神通智力不可思議，而彼海意菩薩居于極遠剎中，能以無障礙眼見此色相，",
        "translation": "The spiritual powers of the great enlightening beings are inconceivable, yet those oceanic-minded bodhisattvas who live in the remotest buddha-lands can see these forms with unobstructed eyes",
        "source": "T13n0400_001:0474c13_8"
    },
    {
        "source_sentence": "無障礙耳聞此音聲。",
        "translation": "The unobstructed ear hears this sound.",
        "source": "T13n0400_001:0474c15_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0400_001:0474c15_10"
    },
    {
        "source_sentence": "若有聞是諸菩薩摩訶薩不可思議功德威神者，其誰不發阿耨多羅三藐三菩提心？」",
        "translation": "If someone hears about the inconceivable power of these bodhisattva-mahāsattvas, who wouldn't give rise to the mind of unsurpassed, correct, and complete enlightenment?",
        "source": "T13n0400_001:0474c16_0"
    },
    {
        "source_sentence": "尊者舍利子作是說時，二萬四千天子皆發阿耨多羅三藐三菩提心。",
        "translation": "When Venerable Śāriputra spoke these words, 24,000 celestial beings all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0400_001:0474c17_1"
    },
    {
        "source_sentence": "爾時，海意菩薩摩訶薩與彼出過算數諸大菩薩摩訶薩眾，恭敬圍繞，同時瞻仰彼佛世尊海勝持慧遊戲出高神通如來已，",
        "translation": "At the time, the ocean-minded bodhisattva Mahāsattva and those great bodhisattva mahāsattvas who surpassed him in number were respectfully surrounded by a multitude of great bodhisattva mahāsattvas. They all gazed at the buddha world-honored Tathāgata Supremely Enlightened One Who emerged from the Ocean of Wisdom",
        "source": "T13n0400_001:0474c20_0"
    },
    {
        "source_sentence": "即受教勅，承彼如來神足通力，及無加行菩薩已辦神通，於一念間瞬目之頃，",
        "translation": "Having thus instructed them, the enlightening being Universally Good, imbued with the supernormal power of the feet of the Buddha, and having mastered all his supernormal powers, instantly closed his eyes in an instant.",
        "source": "T13n0400_001:0474c22_1"
    },
    {
        "source_sentence": "於彼世界隱伏身相，即時於此娑婆世界大寶莊嚴最勝道場中，涌現虛空，",
        "translation": "In that world, concealing their bodily marks, they instantly appeared in space at the most excellent site of enlightenment adorned with great jewels in this sahā world.",
        "source": "T13n0400_001:0474c24_2"
    },
    {
        "source_sentence": "高一多羅樹，於最高廣蓮花臺上師子座中安詳而坐；",
        "translation": "At the top of the highest, wide lotus-flowered terrace he sat peacefully on a lion seat.",
        "source": "T13n0400_001:0474c26_3"
    },
    {
        "source_sentence": "餘諸菩薩亦各處于蓮花臺座。",
        "translation": "The other bodhisattvas are also each seated on a lotus-flower dais.",
        "source": "T13n0400_001:0474c27_4"
    },
    {
        "source_sentence": "下方世界無量無數諸佛剎中，復有無量無數菩薩之眾，隨從海意菩薩而來聽法。",
        "translation": "In the world below, there are measureless and countless buddha-lands, and there are also measureless and countless bodhisattvas who come to listen to the teachings following the oceanic mind Bodhisattva.",
        "source": "T13n0400_001:0474c28_5"
    },
    {
        "source_sentence": "是時大寶莊嚴最勝道場中所有十方世界普來集會一切菩薩摩訶薩眾，皆悉處于蓮花臺座，",
        "translation": "At that time all the great enlightening beings of the ten directions, assembled on lotus-flower pedestals and seats in the most excellent site of enlightenment, adorned with great jewels.",
        "source": "T13n0400_001:0475a01_6"
    },
    {
        "source_sentence": "周匝充滿，殊妙奇特。",
        "translation": "It is surrounded and filled with marvelous wonders.",
        "source": "T13n0400_001:0475a03_7"
    },
    {
        "source_sentence": "而彼一切諸來大眾，心生歡喜，悉得清淨，歎未曾有，合掌頂禮彼諸菩薩。",
        "translation": "The whole assembly of those who had come to the monastery was delighted, and they all attained purity. They praised this unprecedented experience and joined their palms in homage to the enlightening beings.",
        "source": "T13n0400_001:0475a03_8"
    },
    {
        "source_sentence": "時海意菩薩，以彼無量功德寶無垢殊妙莊嚴世界之中諸勝妙花，其花名為無憂適悅愛樂喜見，",
        "translation": "“At that time the enlightening being Oceanic intends to adorn those worlds with flowers of infinite virtue, pure and beautiful arrays of jewels. That flower is called Sadnessless Pleasing Delight in Joyful Vision.",
        "source": "T13n0400_001:0475a05_9"
    },
    {
        "source_sentence": "量廣一俱盧舍，花有無數多百千葉，隨其所應供養如來，令諸菩薩一切見者深心無垢，",
        "translation": "It was one krośa in size and width, with countless hundreds of thousands of petals spreading like flowers. They honored the buddhas as they wished, causing all enlightening beings who saw them to be deeply without blemish in their minds.",
        "source": "T13n0400_001:0475a07_10"
    },
    {
        "source_sentence": "宿世善根悉得清淨，是諸眾會皆生歡喜悅意愛樂。",
        "translation": "All the good roots of past lives are purified, and all the congregations at that assembly become joyous, delighted, and craving.",
        "source": "T13n0400_001:0475a09_11"
    },
    {
        "source_sentence": "花有光明，復有妙香，此諸勝花於世尊前作供養已，復雨廣大殊妙花雨。",
        "translation": "The flowers had light and a wonderful fragrance, and after these superior flowers had made offerings to the Bhagavān in front of him, they again rained down a vast, marvelous flowery rain.",
        "source": "T13n0400_001:0475a10_12"
    },
    {
        "source_sentence": "其一一花可七人量，遍布充滿大寶莊嚴最勝道場，一切大眾悉得離生喜樂禪悅之味；",
        "translation": "Each of those flowers, about seven persons in size, pervaded the most sublime site of enlightenment, adorned with great jewels, and all the masses attained the taste of detachment, bliss, meditation, and delight.",
        "source": "T13n0400_001:0475a12_13"
    },
    {
        "source_sentence": "空中自然擊種種鼓鼓出微妙可愛之音，一切大眾聞者悉得禪定妙樂。",
        "translation": "The sky naturally beats various drums in the air and produces subtle and pleasing sounds, and all the masses who hear them will attain the marvelous bliss of meditation.",
        "source": "T13n0400_001:0475a14_14"
    },
    {
        "source_sentence": "爾時，海意菩薩摩訶薩，作如是等供養事已，從空而下，頭面著地禮世尊足，",
        "translation": "“At that time the great enlightening being Oceanic intention, having done these kinds of offerings, descended from the sky with his head and face on the ground to bow at the feet of the World-honored One.",
        "source": "T13n0400_001:0475a17_0"
    },
    {
        "source_sentence": "右繞七匝合掌恭敬，住立佛前，作是白言：「世尊！",
        "translation": "He circumambulated the Buddha seven times to his right, joined his palms in respect, stood before the Buddha, and said:",
        "source": "T13n0400_001:0475a18_1"
    },
    {
        "source_sentence": "海勝持慧游戲出高神通如來，問訊世尊釋迦牟尼如來，少病少惱，起居輕利，",
        "translation": "The World-honored One, the Enlightened One with lofty supernormal powers, who emerged from the ocean of transcendent wisdom and playfulness, greeted the World-honored Tathāgata Śākyamuni. With few illnesses and little affliction, he stood up and took his seat at ease.",
        "source": "T13n0400_001:0475a19_2"
    },
    {
        "source_sentence": "勢力安不？",
        "translation": "Is the power peaceful?",
        "source": "T13n0400_001:0475a21_3"
    },
    {
        "source_sentence": "得妙樂邪？」",
        "translation": "What's wrong with attaining marvelous bliss?",
        "source": "T13n0400_001:0475a21_4"
    },
    {
        "source_sentence": "時彼同來一切菩薩，悉從空下，亦各頭面禮佛足已，右繞七匝，各各還復本座而坐。",
        "translation": "All the bodhisattvas who had come with them all came down from the sky, bowed their heads and feet at each other's feet, circled him seven times to his right, returned to their seats, and sat down.",
        "source": "T13n0400_001:0475a22_5"
    },
    {
        "source_sentence": "爾時，此三千界有大梵王，名大悲思惟，居此梵世此四大洲無憂安隱，",
        "translation": "At the time, there was a great Brahma king in these 3,000 worlds named Great Compassionate Meditation, who lived in this Brahma world and these four major continents without sorrow or peace.",
        "source": "T13n0400_001:0475a25_0"
    },
    {
        "source_sentence": "忽然見是三千大千世界，大水充滿混如一海。",
        "translation": "Suddenly, he saw this 3,000 great one-thousand worlds, filled with as much water as a single ocean.",
        "source": "T13n0400_001:0475a26_1"
    },
    {
        "source_sentence": "復有俱胝那庾多百千廣大蓮花高顯出現種種勝相，及此道場菩薩充滿。",
        "translation": "Also, there are hundreds of thousands of koṭīs of vast lotus blossoms as high as a hundred thousand yojanas that show various superior features and are filled with bodhisattvas at this site of enlightenment.",
        "source": "T13n0400_001:0475a27_2"
    },
    {
        "source_sentence": "見是相已即自思惟：「劫火未然壞相，安有大水充滿？",
        "translation": "Seeing these signs, he thought to himself, Before the fire of the kalpa breaks out, how could there be a large body of water that fills it?",
        "source": "T13n0400_001:0475a29_3"
    },
    {
        "source_sentence": "此復何緣，將非如來神變力邪？",
        "translation": "Again, what is the reason for this? Is it not due to the supernatural power of the Tathāgata?",
        "source": "T13n0400_001:0475b01_4"
    },
    {
        "source_sentence": "我今宜往問佛世尊，此希有相，何因何緣？」",
        "translation": "Now, it's appropriate for me to go there and ask the Bhagavān, what is this rare characteristic of the Buddha, why and why?",
        "source": "T13n0400_001:0475b02_5"
    },
    {
        "source_sentence": "時大悲思惟大梵天王作是念已，即與六萬八千梵眾隱于梵界，恭敬圍繞，",
        "translation": "Having thought thus, King Mahābrahmā and his sixty-eight thousand companions in the great compassionate assembly of Brahmā gods entered the world of Brahmā.",
        "source": "T13n0400_001:0475b03_6"
    },
    {
        "source_sentence": "來詣大寶莊嚴最勝道場佛世尊前，住虛空中，曲躬合掌頂禮世尊，作是白言：「世尊！",
        "translation": "They came to the most excellent site of enlightenment, adorned with great jewels, in front of the Buddha, the World-honored One. Abiding in space, they bowed their heads at the feet of the World-honored One and said:",
        "source": "T13n0400_001:0475b04_7"
    },
    {
        "source_sentence": "何故今此三千大千世界大水充滿混如一海，復有俱胝那庾多百千廣大蓮花高顯而出，",
        "translation": "And why is the great water of this billion-world-galactic universe so vast as to be like a single ocean, with hundreds of thousands of myriads of koṭis of lotus blossoms rising high?",
        "source": "T13n0400_001:0475b06_8"
    },
    {
        "source_sentence": "及諸菩薩大士皆悉處于蓮花座上，而此三千大千世界一切國土城邑聚落諸人民眾，",
        "translation": "And the great enlightening beings and bodhisattvas were all seated on lotus- blossom thrones, whereas in this billion-world-galactic universe there were cities, towns, villages, kingdoms, nations, and people.",
        "source": "T13n0400_001:0475b08_9"
    },
    {
        "source_sentence": "及閻浮提四大洲等欲界天宮，乃至大海須彌諸山，悉無損壞亦無障礙。",
        "translation": "And the four great continents of Jambudvīpa and other heavenly palaces in the realm of desire, as well as the great oceans and mountains on Mount Sumeru, all are not damaged or obstructed.",
        "source": "T13n0400_001:0475b10_10"
    },
    {
        "source_sentence": "如是等相甚為希有，此何因緣？",
        "translation": "Such characteristics are extremely rare. What is the reason for this?",
        "source": "T13n0400_001:0475b12_11"
    },
    {
        "source_sentence": "復何神力？",
        "translation": "What other supernatural powers are there?",
        "source": "T13n0400_001:0475b13_12"
    },
    {
        "source_sentence": "願佛為說。」",
        "translation": "May the Buddha teach it for them.",
        "source": "T13n0400_001:0475b13_13"
    },
    {
        "source_sentence": "爾時佛告大悲思惟梵天言：「大梵當知！",
        "translation": "It was then that the Buddha addressed the great compassionate contemplation Brahma gods, saying, Great Brahma, you should know!",
        "source": "T13n0400_001:0475b14_0"
    },
    {
        "source_sentence": "下方世界有佛剎，名無量功德寶無垢殊妙莊嚴，其佛世尊，號海勝持慧游戲出高神通如來。",
        "translation": "In the world below, there's a buddha-stage named Immeasurable Virtue Jewel of Immeasurable Merit, undefiled and marvelously beautifully adorned, where the Bhagavān is called the Tathāgata who plays out with high supernormal powers in the name of Ocean of Supreme retaining Wisdom.",
        "source": "T13n0400_001:0475b14_1"
    },
    {
        "source_sentence": "彼有菩薩名曰海意，與出過算數諸大菩薩摩訶薩眾，而共來此娑婆世界，",
        "translation": "There was an enlightening being there named Hayagrīva, together with countless great assemblies of bodhisattvas and mahāsattvas, who came to this sahā world.",
        "source": "T13n0400_001:0475b17_0"
    },
    {
        "source_sentence": "瞻禮恭敬供養於我；",
        "translation": "They pay their respects to me and venerate me with reverence.",
        "source": "T13n0400_001:0475b18_1"
    },
    {
        "source_sentence": "又復於此廣大集會正法之中而有所問。",
        "translation": "Again, there's a question asked in this vast collection of the right teaching.",
        "source": "T13n0400_001:0475b19_2"
    },
    {
        "source_sentence": "是彼菩薩神通之力，於此世界先現瑞相。」",
        "translation": "It's because of the power of that bodhisattva's supernormal abilities that he first manifested miraculous signs in this world.",
        "source": "T13n0400_001:0475b20_3"
    },
    {
        "source_sentence": "梵天白佛言：「世尊！",
        "translation": "The Brahmadeva said to the Buddha, Bhagavān!",
        "source": "T13n0400_001:0475b21_4"
    },
    {
        "source_sentence": "大集會中所有正法，今尚說邪？」",
        "translation": "What's the right teaching that exists in the great assembly, and is it still explained as wrong now?",
        "source": "T13n0400_001:0475b21_5"
    },
    {
        "source_sentence": "佛言：「大梵！",
        "translation": "The Buddha said, Great Brahmā!",
        "source": "T13n0400_001:0475b22_6"
    },
    {
        "source_sentence": "諸佛境界不可思議，所有如來智慧辯才及威神力，不應限量。",
        "translation": "The sphere of buddhas is inconceivable, and the Tathāgata's wisdom, eloquence, and authoritative powers should not be limited.",
        "source": "T13n0400_001:0475b22_7"
    },
    {
        "source_sentence": "汝或見於如來默然，勿謂無說。",
        "translation": "You may see the Tathāgata remaining silent, but don't say nothing.",
        "source": "T13n0400_001:0475b24_8"
    },
    {
        "source_sentence": "而我常為十方世界所來菩薩，廣大宣說決定正法。」",
        "translation": "I'm always a bodhisattva from the worlds in the ten directions who extensively explains the right teaching with certainty.",
        "source": "T13n0400_001:0475b24_9"
    },
    {
        "source_sentence": "爾時，大悲思惟大梵天王復白佛言：「世尊！",
        "translation": "At that point, the great compassionate contemplation of Mahābrahmā again said to the Buddha, Bhagavān!",
        "source": "T13n0400_001:0475b27_0"
    },
    {
        "source_sentence": "佛所說言現神變者海意菩薩，其誰是邪？」",
        "translation": "Who is the bodhisattva who says that he's manifesting miraculous transformations as a sea-minded bodhisattva, and who is wrong?",
        "source": "T13n0400_001:0475b27_1"
    },
    {
        "source_sentence": "佛言：「大梵！",
        "translation": "The Buddha said, Great Brahmā!",
        "source": "T13n0400_001:0475b28_2"
    },
    {
        "source_sentence": "今此會中有大蓮花廣十由旬，花中有臺，臺上復有眾寶莊嚴師子之座，",
        "translation": "In this assembly there is a great lotus flower, ten yojanas wide and ten yojanas in width. Within the flower is a terrace; on that terrace is also a lion seat adorned with all kinds of jewels.",
        "source": "T13n0400_001:0475b29_3"
    },
    {
        "source_sentence": "座中有一菩薩大士處于其上，身真金色相好端嚴，唯除如來，餘諸菩薩所有身相皆能映攝，",
        "translation": "On the throne was a great enlightening being seated, with golden-colored bodies as if they were buddha-figures. Above him there was an enlightening being named Sarvasaṃdarśana, whose body was purely golden in color and adorned with all the marks of greatness except for the Tathāgata.",
        "source": "T13n0400_001:0475c01_4"
    },
    {
        "source_sentence": "有無數千菩薩之眾圍繞頂禮者，汝可見不？」",
        "translation": "Do you see that there are countless thousands of bodhisattvas surrounded and venerating him?",
        "source": "T13n0400_001:0475c03_5"
    },
    {
        "source_sentence": "答言：「已見。」",
        "translation": "He replied, I've seen it.",
        "source": "T13n0400_001:0475c04_6"
    },
    {
        "source_sentence": "佛言：「大梵！",
        "translation": "The Buddha said, Great Brahmā!",
        "source": "T13n0400_001:0475c05_7"
    },
    {
        "source_sentence": "圓具如是神通相者，即是海意菩薩。」",
        "translation": "Perfectly endowed with such a characteristic of supernormal powers, that's the oceanic mind bodhisattva.",
        "source": "T13n0400_001:0475c05_8"
    },
    {
        "source_sentence": "是時大悲思惟梵天，乃向海意菩薩恭敬頂禮已，即白佛言：「世尊！",
        "translation": "After paying homage to the ocean-minded bodhisattva with respect and veneration, he said to the Buddha, Bhagavān!",
        "source": "T13n0400_001:0475c06_9"
    },
    {
        "source_sentence": "若有眾生得聞如是海意菩薩名字之者，當知是人得大善利。",
        "translation": "If there are any sentient beings who hear the names of these oceanic bodhisattvas, know that they'll attain great good benefits.",
        "source": "T13n0400_001:0475c07_10"
    },
    {
        "source_sentence": "我於今日聞此菩薩大士名字，得見菩薩如是色相，深自欣慶快得善利。」",
        "translation": "Today, when I hear the name of this bodhisattva-mahāsattva, I'll see such a form and characteristics of the bodhisattva, and I'll be deeply delighted and happy to attain good fortune.",
        "source": "T13n0400_001:0475c09_11"
    },
    {
        "source_sentence": "梵天復白佛言：「世尊！",
        "translation": "The Brahmadeva again said to the Buddha, Bhagavān!",
        "source": "T13n0400_001:0475c10_12"
    },
    {
        "source_sentence": "此大集會正法當住為久如邪？」",
        "translation": "How long will this great assembly of the right teaching be abiding?",
        "source": "T13n0400_001:0475c11_13"
    },
    {
        "source_sentence": "佛言：「大梵！",
        "translation": "The Buddha said, Great Brahmā!",
        "source": "T13n0400_001:0475c11_14"
    },
    {
        "source_sentence": "今此正法，隨佛壽量久近而住。",
        "translation": "Now, this right teaching follows the Buddha's longevity and abides for a long time.",
        "source": "T13n0400_001:0475c12_15"
    },
    {
        "source_sentence": "佛涅槃後，有諸菩薩，於此正法受持讀誦，廣為佗人開示演說。",
        "translation": "After the nirvāṇa of the Buddha, there were bodhisattvas who accepted and recited this true teaching and taught it extensively for the people of Tuṣita.",
        "source": "T13n0400_001:0475c12_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0400_001:0475c14_17"
    },
    {
        "source_sentence": "大梵！",
        "translation": "Great Brahmā!",
        "source": "T13n0400_001:0475c14_18"
    },
    {
        "source_sentence": "所有過去、未來、現在世中諸佛菩提從此中出。」",
        "translation": "The enlightenment of all the buddhas of the past, future, and present worlds comes from here.",
        "source": "T13n0400_001:0475c14_19"
    },
    {
        "source_sentence": "爾時，海意菩薩摩訶薩，承佛神力，普為此會一切大眾生歡喜故；",
        "translation": "At that time the great enlightening being Oceanic Mind, imbued with the spiritual power of the Buddha, was gladdening all the masses at this assembly for the sake of sentient beings everywhere.",
        "source": "T13n0400_001:0475c16_0"
    },
    {
        "source_sentence": "及為大悲思惟大梵天王起信敬故；",
        "translation": "It is also for the sake of great compassion and contemplation that Great Brahma, king of the gods, gives rise to faith and reverence.",
        "source": "T13n0400_001:0475c17_1"
    },
    {
        "source_sentence": "復為莊嚴此正法故；",
        "translation": "They also want to adorn this true teaching.",
        "source": "T13n0400_001:0475c18_2"
    },
    {
        "source_sentence": "亦為顯示己之智慧辯才力故；",
        "translation": "They also want to show their own power of knowledge and eloquence.",
        "source": "T13n0400_001:0475c18_3"
    },
    {
        "source_sentence": "「下方過於塵數剎，　　有佛剎名功德嚴；",
        "translation": "In the nadir, beyond as many buddha-lands as atoms in all lands, Is a buddha-land called Array of Virtue.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　彼佛化主現居中，　　其名海勝神通慧。",
        "translation": "That buddha-transforming lord who lives there now is called the ocean of superior supernormal wisdom.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　剎中眾德皆圓具，　　菩薩依止無所畏；",
        "translation": "The virtues of the buddhas are all perfect, Enlightening beings rely on them without fear.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　其佛如來說法門，　　我等聞已能持受。",
        "translation": "That buddha-tathāgata teaches the Dharma teaching, which we can retain and accept after hearing it.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　我等故來茲剎土，　　瞻仰敬禮十力尊；",
        "translation": "For this reason we have come to this buddha-land, To venerate and revere the Ten-Powered One.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　其諸菩薩此所來，　　佛大牛王各伸問。",
        "translation": "Those bodhisattvas came here, and the Buddha, the great ox king, each asked a question.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　我今禮此法王已，　　亦禮無比佛大智；",
        "translation": "Now, having venerated this king of truth, I also venerate the incomparable great knowledge of buddhas.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　所應供養隨所施，　　廣伸供養佛正覺。",
        "translation": "They should make offerings according to what they give, Extensively extending their offerings to the Buddha and right awakening.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　若能觀佛色、無色，　　離受離行亦離識；",
        "translation": "If one can observe the Buddha’s form and formlessness, One will be free of feeling, action, and consciousness.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　三種領納此亦無，　　是中潔白常清淨。",
        "translation": "These three kinds of grasping are also absent here, which are pure and always pure in purity.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　若無色相及種好，　　是為正觀佛世尊；",
        "translation": "If formless characteristics and seed goodness Are the correct observation of Buddha, World-Honored One.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　慧眼清淨照法身，　　乃見無垢真實義。",
        "translation": "The eye of wisdom is pure and illumines the body of reality, Seeing the true meaning of undefiled truth.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　若法無取亦無捨，　　二邊無我、無我所；",
        "translation": "If things are without grasping and also without relinquishment, the two extremes have no self and nothing pertaining to self.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　安住內入性寂然，　　止息心外諸所取。",
        "translation": "Abiding peacefully within, entering by nature, they are quiescent, Extinguishing the grasping outside of mind.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　有無分別、離分別，　　是心寂默如虛空；",
        "translation": "Existence and nondiscrimination, freedom from discrimination, Is the mind as silent as space.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　即能供養諸世尊，　　於正法幢善建立。",
        "translation": "That is, they can make offerings to the world-honored ones and skillfully establish the banner of the right teaching.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　若觀諸法猶如幻，　　此中施、受二皆空；",
        "translation": "If one observes that all things are like illusions, then both giving and receiving are void.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　雖知造作本所無，　　亦不捨離於諸法。",
        "translation": "Even though they know the creation is originally nonexistent, They don’t abandon things.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　而不決定求菩提，　　又不決定住生、死；",
        "translation": "They do not necessarily seek enlightenment, And they do not necessarily abide in birth and death.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　亦無施者無慳心，　　遠離施中諸過失。",
        "translation": "Also, there's no donor who has no stinginess and no stinginess, and he's far removed from the faults in giving.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　止息調寂身、語、心，　　隨行三業無逼惱；",
        "translation": "He calms and tames body, speech, and mind, Acting in accord with the practice of the three actions without being oppressed.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　除諸煩惱息燒然，　　利智諸根常寂靜。",
        "translation": "He rids himself of the afflictions that are stilled, and his sharp faculties are always quiescent.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　雖知菩提無所得，　　不捨眾生住無我；",
        "translation": "Though they know enlightenment is ungraspable, They do not abandon sentient beings and abide in selflessness.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　為度破戒諸眾生，　　修持廣大淨戒行。",
        "translation": "In order to save sentient beings who break the precepts, he cultivates the practice of extensive pure morality.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　覺了諸法剎那性，　　亦不為諸境所壞；",
        "translation": "Understanding the instantaneous nature of all things, They are not destroyed by objects.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　內心寂靜若虛空，　　外觀世間猶如幻。",
        "translation": "Their internal minds are as tranquil as space, Yet their appearance in the world is like magic.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　節節支解於身分，　　亦復不起瞋恚心；",
        "translation": "Each and every one of them understands their identity, Nor does he give rise to angry thoughts.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　乃至坐樹成菩提，　　堅持忍行佛所說。",
        "translation": "Even sitting in a tree to attain enlightenment, he insists on tolerating what the Buddha teaches.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　能觀諸法如水月，　　如泡、如幻、如陽焰；",
        "translation": "They can observe all phenomena are like the moon in water, Like bubbles, illusions, mirages, and mirages.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　了知無壽亦無人，　　及無摩拏嚩迦等。",
        "translation": "They know that there's no longevity and no person, and they don't have mokṣaka and so forth.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　菩提眾生雖無得，　　為利他故求菩提；",
        "translation": "Though enlightened sentient beings have no attainment, they seek enlightenment for the benefit of others.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　若聞此理怖不生，　　是中能發精進行。",
        "translation": "If someone hears this principle and fear doesn't arise, they're able to give rise to the practice of effort.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　若能於心無所著，　　乃於外境不生厭；",
        "translation": "If one can be unattached to mind, Then one will not become disillusioned with external objects.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　知他眾生心所行，　　於三世中隨順轉。",
        "translation": "Knowing the mental actions of other sentient beings, they follow them in the three worlds.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　令諸魔眾不能知，　　心之所行隨所轉；",
        "translation": "Causing the hosts of demons to be unable to know, The mind acts according to what it does.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　到於彼岸善住心，　　圓滿禪定神通慧。",
        "translation": "Reaching the other shore, they well abide in mind and perfect meditation with supernormal wisdom.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　我聞諸佛所說法，　　隨所聞已能受持；",
        "translation": "I hear the teachings of buddhas, And can retain whatever I hear.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　設經無邊劫數中，　　佛之辯才不能斷。",
        "translation": "Even if it were to pass through boundless eons, the Buddha's eloquence wouldn't be able to stop it.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　復於一切佛法中，　　眾生無墮亦無著；",
        "translation": "Furthermore, in all the Buddha’s teachings Sentient beings do not fall into or cling to them.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　具智慧藏有力尊，　　三界自在寂默者。",
        "translation": "The powerful honored one who possesses the store of wisdom and is freely silent in the three realms.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　能到所到二俱離，　　是中無去亦無來；",
        "translation": "The one who reaches and the one who arrives are both separated, Within which there is neither going nor coming.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　隨諸眾生心所行，　　所向無住亦無動。",
        "translation": "According to the mental actions of sentient beings, they don’t abide or move wherever they are directed.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　雖到彼岸具眾德，　　亦於眾德無取相；",
        "translation": "Though they reach the other shore, endowed with virtues, They also have no marks of grasping virtue.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　無比釋迦大牛王，　　是故我今伸頂禮。",
        "translation": "Unparalleled is the great ox king Śākyamuni, so now I bow my head in homage.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　如日清淨大明曜，　　能蔽螢光、星宿光；",
        "translation": "Like the purity of the sun shining brightly, it can obscure the light of fireflies and the light of constellations.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　又如劫火映諸明，　　上騰梵世下至地。",
        "translation": "It's also like when the fire of an eon reflects all the lights, ascending up to the Brahma world and down to the ground.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　復如須彌大山王，　　持地亦持諸山等；",
        "translation": "Again, it is like the great polar mountain of Mount Sumeru Which holds the earth and also other mountains.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　釋迦牛王毫相中，　　最勝光明出三界。",
        "translation": "Among the tiny features of the Buddha’s ox king, Supreme light emerges from the three realms.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　十方一切菩薩眾，　　皆從百佛剎中來；",
        "translation": "All the hosts of enlightening beings in the ten directions Have all come from a hundred buddha-lands.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　瞻佛色相及威光，　　一切皆生大歡喜。",
        "translation": "Observing the Buddha’s form, features, and majestic light, They all become greatly joyful.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　隨諸眾生心意願，　　如來各各為開示；",
        "translation": "Depending on the mentalities and wishes of sentient beings, The enlightened one reveals them to each.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　我知如來大威神，　　故從本土來斯剎。",
        "translation": "Knowing the great majestic power of the Buddha, I came from my native land to this buddha.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　佛以一音演說法，　　隨諸眾生各知解；",
        "translation": "The Buddha teaches the Dharma in one voice, According to the understanding of sentient beings according to their knowledge and understanding.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　乃至眾生差別音，　　如來普為隨宜說。",
        "translation": "Up to the different sounds of sentient beings, The Enlightened One teaches them as appropriate for all.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　一切眾生意差別，　　如塵如沙尚可數；",
        "translation": "All the differences in business activities of sentient beings Are as numerous as dust and sand.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　牟尼種種妙音聲，　　量等虛空不可數。",
        "translation": "The various subtle sounds of the Buddha’s music Are as great as space, incalculable.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　虛空不能度其邊，　　眾生不能窮其數；",
        "translation": "Space can’t save them; Sentient beings can’t measure their number.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　乃至生死先際中，　　亦復不能知其限。",
        "translation": "Even at the frontier of birth and death, they can't know their limits.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　虛空邊量眾生數，　　生死先際尚可知；",
        "translation": "The bounds of space are measured by the number of sentient beings; The former limits of birth and death can still be known.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　諸佛戒、定、慧境中，　　畢竟不能知少分。",
        "translation": "The buddhas, in the realms of morality, meditation, and wisdom, Ultimately can’t know even a small part.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　眾生無量咸歸命，　　牛王法主人中尊；",
        "translation": "Countless sentient beings all take refuge in him, Most Honored among the Masters of the Teaching, Ox King.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　多劫精修眾德嚴，　　色相邊際無比度。",
        "translation": "For many eons they diligently cultivate the adornment of virtues; Their forms and characteristics are beyond compare.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　我佛具大威神力，　　遍知眾生諸信解；",
        "translation": "I Buddha am endowed with great spiritual power, Knowing all sentient beings’ beliefs and understandings.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "　見此希有難思尊，　　頂禮善調諸趣者。」◎",
        "translation": "Seeing this rare and inconceivable honored one, he pays homage to the well-adjusted destinies.",
        "source": "T13n0400_001:0475c19_4"
    },
    {
        "source_sentence": "即時同彼高廣蓮花及師子座，俱涌虛空高七多羅樹，乃於空中說伽陀曰：佛說海意菩薩所問淨印法門經卷第一",
        "translation": "Immediately, on the same footing as those high and wide lotus flowers and lion seats in the sky, together with the seven palm trees so high that they rose to a height of one hundred thousand yojanas, he spoke these verses:",
        "source": "T13n0400_001:0475c19_4"
    }
]