[
    {
        "source_sentence": "大集大虛空藏菩薩所問經卷第",
        "translation": "*Mahāmegha-sūtra of the Questions Asked by the Bodhisattva Mahāprajñāpāramitā",
        "source": "T13n0404_002:0617b16_0"
    },
    {
        "source_sentence": "二",
        "translation": "two",
        "source": "T13n0404_002:0617b17_0"
    },
    {
        "source_sentence": "開府儀同三司特進試鴻臚卿肅國",
        "translation": "The founding officials of the monastery were the same as the three ministers, and they specially testified to the sovereignty of Hongqian's kingdom.",
        "source": "T13n0404_002:0617b19_0"
    },
    {
        "source_sentence": "公食邑三千戶賜紫贈司空謚大鑑",
        "translation": "3,000 families of the gongshou community were given purple as a gift to the minister Kongqiao dajian",
        "source": "T13n0404_002:0617b20_0"
    },
    {
        "source_sentence": "正號大廣智大興善寺三藏沙門",
        "translation": "He was the Sanzang shaman of Daegwangzhi Daxingshansi.",
        "source": "T13n0404_002:0617b21_0"
    },
    {
        "source_sentence": "不空奉　詔譯",
        "translation": "Amoghapāśa interpretation of the imperial edict",
        "source": "T13n0404_002:0617b22_0"
    },
    {
        "source_sentence": "爾時，世尊復告大虛空藏菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Bhagavān again addressed the great space store bodhisattva Mahāsattva, saying, Good sons!",
        "source": "T13n0404_002:0617b23_0"
    },
    {
        "source_sentence": "菩薩成就四法，修行淨戒波羅蜜多猶若虛空。",
        "translation": "The bodhisattva accomplishes four things and cultivates the perfection of pure morality like space.",
        "source": "T13n0404_002:0617b24_1"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T13n0404_002:0617b25_2"
    },
    {
        "source_sentence": "所謂：知身如影像；",
        "translation": "They know the body is like an image:",
        "source": "T13n0404_002:0617b25_3"
    },
    {
        "source_sentence": "知聲如谷響；",
        "translation": "They know all sounds are like the sound of a valley.",
        "source": "T13n0404_002:0617b25_4"
    },
    {
        "source_sentence": "知心如幻化；",
        "translation": "They know the mind is like illusion.",
        "source": "T13n0404_002:0617b26_5"
    },
    {
        "source_sentence": "知慧如虛空。",
        "translation": "Knowing wisdom is like space.",
        "source": "T13n0404_002:0617b26_6"
    },
    {
        "source_sentence": "是為菩薩成就四法，修行淨戒波羅蜜多猶若虛空。",
        "translation": "These are the four things a bodhisattva accomplishes when cultivating the perfection of pure morality like space.",
        "source": "T13n0404_002:0617b26_7"
    },
    {
        "source_sentence": "「復次，若菩薩成就八法，能淨修行淨戒波羅蜜多。",
        "translation": "“Furthermore, if a bodhisattva accomplishes eight things, he can purify the cultivation of the perfection of pure morality.",
        "source": "T13n0404_002:0617b28_0"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T13n0404_002:0617b29_1"
    },
    {
        "source_sentence": "所謂：不離菩提心，戒清淨故；",
        "translation": "They are not separate from the determination for enlightenment, because morality is pure.",
        "source": "T13n0404_002:0617b29_2"
    },
    {
        "source_sentence": "離聲聞、緣覺心得無限量心，戒清淨故；",
        "translation": "Their minds are free from the awarenesses of sravakas and pratyekabuddhas, because their moral precepts are pure.",
        "source": "T13n0404_002:0617c01_0"
    },
    {
        "source_sentence": "不捨一切學處，智慧清淨故；",
        "translation": "They do not abandon all places of learning, because their knowledge and wisdom are pure.",
        "source": "T13n0404_002:0617c01_1"
    },
    {
        "source_sentence": "於一切處受生，願清淨故；",
        "translation": "They receive birth in all places because their vows are pure.",
        "source": "T13n0404_002:0617c02_2"
    },
    {
        "source_sentence": "於戒不緩任運無作，行清淨故；",
        "translation": "They are not lax in observing precepts, because their practice is pure.",
        "source": "T13n0404_002:0617c03_3"
    },
    {
        "source_sentence": "迴向菩提，魔羅心清淨故；",
        "translation": "They dedicate themselves to enlightenment because the minds of Māra’s demons are pure.",
        "source": "T13n0404_002:0617c03_4"
    },
    {
        "source_sentence": "心無熱惱，煩惱清淨故；",
        "translation": "The mind is without fever or torpor, because its afflictions are pure.",
        "source": "T13n0404_002:0617c04_5"
    },
    {
        "source_sentence": "大願圓滿，菩提清淨故。",
        "translation": "The great vow is fulfilled, because enlightenment is pure.",
        "source": "T13n0404_002:0617c04_6"
    },
    {
        "source_sentence": "是為菩薩成就八法，能淨修行淨戒波羅蜜多。",
        "translation": "These are the eight things a bodhisattva accomplishes that enable him to purify and cultivate the perfection of pure morality.",
        "source": "T13n0404_002:0617c05_7"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0617c06_8"
    },
    {
        "source_sentence": "譬如虛空清淨，菩薩持戒清淨亦爾；",
        "translation": "Just as space is pure, so also enlightening beings’ observance of precepts is pure.",
        "source": "T13n0404_002:0617c06_9"
    },
    {
        "source_sentence": "譬如虛空無有垢穢，菩薩持戒無垢亦爾；",
        "translation": "Just as space has no dirt, so does enlightening beings’ observance of precepts have no dirt.",
        "source": "T13n0404_002:0617c07_10"
    },
    {
        "source_sentence": "譬如虛空寂靜不亂，菩薩持戒寂靜亦爾；",
        "translation": "Just as space is silent and unconfused, so also the peace of enlightening beings’ observance of precepts is likewise.",
        "source": "T13n0404_002:0617c08_11"
    },
    {
        "source_sentence": "譬如虛空無有邊際，菩薩持戒無邊亦爾；",
        "translation": "Just as space has no bounds, so does enlightening beings’ observance of precepts have no bound.",
        "source": "T13n0404_002:0617c09_12"
    },
    {
        "source_sentence": "譬如虛空無有繫屬，菩薩持戒無繫亦爾；",
        "translation": "Just as space has no bound to anything, so also does enlightening beings who keep the precepts have no bound.",
        "source": "T13n0404_002:0617c10_13"
    },
    {
        "source_sentence": "譬如虛空無有執著，菩薩持戒離著亦爾；",
        "translation": "Just as space has no attachment, so does enlightening beings observe precepts and are free from attachment.",
        "source": "T13n0404_002:0617c11_14"
    },
    {
        "source_sentence": "譬如虛空無可積集，菩薩持戒無積亦爾；",
        "translation": "Just as space has no accumulation, so also does enlightening beings who keep the precepts have no accumulation.",
        "source": "T13n0404_002:0617c12_15"
    },
    {
        "source_sentence": "譬如虛空不離於性，菩薩持戒不離亦爾；",
        "translation": "Just as space is not separate from its nature, so also does enlightening beings keep the precepts without separation.",
        "source": "T13n0404_002:0617c13_16"
    },
    {
        "source_sentence": "譬如虛空其性常住，菩薩持戒常住亦爾；",
        "translation": "Just as space is inherently eternal, so are enlightening beings who keep the precepts eternally.",
        "source": "T13n0404_002:0617c14_17"
    },
    {
        "source_sentence": "譬如虛空究竟無盡，菩薩持戒無盡亦爾；",
        "translation": "Just as space is ultimately inexhaustible, so are enlightening beings’ observance of precepts inexhaustible.",
        "source": "T13n0404_002:0617c15_18"
    },
    {
        "source_sentence": "譬如虛空無有形相，菩薩持戒離相亦爾；",
        "translation": "Just as space has no form or shape, so also does enlightening beings who keep precepts have formlessness.",
        "source": "T13n0404_002:0617c16_0"
    },
    {
        "source_sentence": "譬如虛空無有來、往，菩薩持戒無動亦爾；",
        "translation": "Just as space has no coming or going, so does enlightening beings keep the precepts unshakably.",
        "source": "T13n0404_002:0617c16_1"
    },
    {
        "source_sentence": "譬如虛空無有戲論，菩薩持戒離戲亦爾；",
        "translation": "Just as space is free of conceptual elaborations, so are enlightening beings who keep precepts and abstain from conceptual elaborations.",
        "source": "T13n0404_002:0617c17_2"
    },
    {
        "source_sentence": "譬如虛空遠離諸漏，菩薩持戒無漏亦爾；",
        "translation": "Just as space is free of all impure influences, so are enlightening beings who keep the precepts uncontaminated.",
        "source": "T13n0404_002:0617c18_3"
    },
    {
        "source_sentence": "譬如虛空無所為作，菩薩持戒無為亦爾；",
        "translation": "Just as space is unconstructed, so also does enlightening beings who keep precepts are unconstructed.",
        "source": "T13n0404_002:0617c19_4"
    },
    {
        "source_sentence": "譬如虛空無有變易，菩薩持戒不變亦爾；",
        "translation": "Just as space has no change, so does enlightening beings keep the precepts unchangingly.",
        "source": "T13n0404_002:0617c20_5"
    },
    {
        "source_sentence": "譬如虛空無有分別，菩薩持戒無取亦爾；",
        "translation": "Just as space has no discrimination, so does enlightening beings observe precepts without grasping.",
        "source": "T13n0404_002:0617c21_6"
    },
    {
        "source_sentence": "譬如虛空遍一切處，菩薩持戒周遍亦爾；",
        "translation": "Just as space pervades all places, so does enlightening beings’ observance of precepts pervade everywhere.",
        "source": "T13n0404_002:0617c22_7"
    },
    {
        "source_sentence": "譬如虛空無有破壞，菩薩持戒無犯亦爾；",
        "translation": "Just as space is not broken, so are enlightening beings who keep the precepts without violating them.",
        "source": "T13n0404_002:0617c23_8"
    },
    {
        "source_sentence": "譬如虛空無有高下，菩薩持戒平等亦爾；",
        "translation": "Just as space has no height or width, so also does enlightening beings observe the precepts equally.",
        "source": "T13n0404_002:0617c24_9"
    },
    {
        "source_sentence": "譬如虛空性離於染，菩薩持戒無染亦爾。",
        "translation": "Just as space is inherently free of defilement, so the bodhisattva observes precepts without defilement.",
        "source": "T13n0404_002:0617c25_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0617c26_11"
    },
    {
        "source_sentence": "是為菩薩修行淨戒波羅蜜多猶若虛空。」",
        "translation": "This is the bodhisattva's cultivation of the perfection of pure morality like space.",
        "source": "T13n0404_002:0617c26_12"
    },
    {
        "source_sentence": "「護戒寂靜心無垢，　　能除熱惱無所得；",
        "translation": "Protecting the precepts with a tranquil mind without defilement Can remove fever and ungraspable afflictions.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　身、語、意業無瑕疵，　　一切律儀皆具足。",
        "translation": "Their bodily, verbal, and mental actions are flawless; All their restraints are fulfilled.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　智者不以戒憍逸，　　內心恒寂而無亂；",
        "translation": "The wise one, not due to idleness or laxity in observing the precepts, Is always silent and unconfused within himself.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　智者常依菩提心，　　而於心意不染著。",
        "translation": "A wise person always relies on the mind of enlightenment And doesn’t cling to thought or thought.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　遠離諸業無思慮，　　如是不生諸分別；",
        "translation": "Being far removed from actions and without thought, Thus they do not give rise to discriminations.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　既離青、黃及赤、白，　　亦不住於名色中。",
        "translation": "Since they're free of blue, yellow, red, and white, they don't abide in name-and-form.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　無取、無捨、無染心，　　譬如虛空無障礙；",
        "translation": "The absence of grasping, the absence of equanimity, and the absence of defiled states of mind Is like space without obstruction.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　此戒智者所稱讚，　　不見所讚諸句義。",
        "translation": "This is praised by the wise one of morality, who doesn't see the meaning of the phrases he praises.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　是戒能令心寂靜，　　亦能寂靜諸煩惱；",
        "translation": "These precepts can make the mind quiescent, And they can also extinguish all afflictions.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　悉得止觀之邊際，　　了然顯現得解脫。",
        "translation": "They all attain the limits of calming and insight, Understanding and clearly revealing their attainment of liberation.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　解脫諸縛之聖者，　　悉皆安住於尸羅；",
        "translation": "The holy ones who are liberated from the bonds of bondage All dwell in śīla.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　是故戒為勝解脫，　　亦為菩提根本句。",
        "translation": "Therefore morality is the supreme liberation, And also the fundamental phrase of enlightenment.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　諸有杜多居蘭若，　　小欲喜足絕貪求；",
        "translation": "There are those who live in the forests of dust, having few desires and no cravings.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　遠離憒閙而住禪，　　心獲輕安離煩惱。",
        "translation": "He's far removed from the noise and disturbances and abides in meditation, attaining ease of mind and freedom from afflictions.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　如是戒是為根本，　　思惟寂靜解脫句；",
        "translation": "These precepts are the foundation, The phrase contemplation of peace and liberation.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　是故尸羅為莊嚴，　　一切處為安樂道。",
        "translation": "Therefore śīla is adorned, and all places are the path of well-being.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　亦令遠離於散動，　　斷諸煩惱及諸見；",
        "translation": "They also cause them to be far removed from distraction, Extinguishing afflictions and views.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　慈心遍布如虛空，　　能靜邊執令清淨。",
        "translation": "The mind of kindness pervades like space, Able to pacify attachment and make it pure.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　決定不捨菩提故，　　而於菩提無分別；",
        "translation": "Because they are certain not to give up enlightenment, Yet they have no discrimination about enlightenment.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "　智者若具如是德，　　皆由於戒到彼岸。",
        "translation": "If wise people possess such virtues, they'll all reach the other shore based on the precepts.",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "爾時，世尊說伽他曰：「善男子！",
        "translation": "It was then that the Bhagavān addressed him, Good man!",
        "source": "T13n0404_002:0617c27_13"
    },
    {
        "source_sentence": "若菩薩成就四法，修行忍辱波羅蜜多猶若虛空。",
        "translation": "If a bodhisattva accomplishes four things, he cultivates the perfection of forbearance like space.",
        "source": "T13n0404_002:0618a19_14"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T13n0404_002:0618a20_15"
    },
    {
        "source_sentence": "所謂：他罵不報，知語如虛空；",
        "translation": "They are like space when others scold them and do not retaliate.",
        "source": "T13n0404_002:0618a20_16"
    },
    {
        "source_sentence": "他打不報，知身如虛空；",
        "translation": "They know their bodies are like space when others strike them without retribution.",
        "source": "T13n0404_002:0618a21_17"
    },
    {
        "source_sentence": "他瞋不報，知心如虛空；",
        "translation": "They know the minds of others are like space.",
        "source": "T13n0404_002:0618a21_18"
    },
    {
        "source_sentence": "掉戲不報，知意如虛空。",
        "translation": "Their agitation and playfulness aren't rewarded, and their knowing minds are like space.",
        "source": "T13n0404_002:0618a22_19"
    },
    {
        "source_sentence": "是為菩薩成就四法，修行忍辱波羅蜜多猶若虛空。",
        "translation": "These are the four things a bodhisattva accomplishes when cultivating the perfection of forbearance like space.",
        "source": "T13n0404_002:0618a22_20"
    },
    {
        "source_sentence": "「復次，若菩薩成就八法，能淨修行忍辱波羅蜜多。",
        "translation": "Furthermore, if a bodhisattva accomplishes eight things, he'll be able to purify the cultivation of the perfection of forbearance.",
        "source": "T13n0404_002:0618a24_0"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T13n0404_002:0618a25_1"
    },
    {
        "source_sentence": "所謂：於諸有情心無限礙猶若虛空，修行忍辱得清淨故；",
        "translation": "Their minds are infinite and unobstructed toward sentient beings, like space, because they cultivate patience and attain purity.",
        "source": "T13n0404_002:0618a25_2"
    },
    {
        "source_sentence": "於諸利養不生貪著猶若虛空，修行忍辱得清淨故；",
        "translation": "They do not cling to profits and enjoyments like space, because by cultivating patience they attain purity.",
        "source": "T13n0404_002:0618a26_3"
    },
    {
        "source_sentence": "於諸有情利益平等猶若虛空，修行忍辱得清淨故；",
        "translation": "The equality of benefiting sentient beings is like space, because by cultivating forbearance one attains purity.",
        "source": "T13n0404_002:0618a27_4"
    },
    {
        "source_sentence": "身、心無壞猶若虛空，修行忍辱得清淨故；",
        "translation": "The body and mind are un broken like space, because by cultivating patience one attains purity.",
        "source": "T13n0404_002:0618a29_0"
    },
    {
        "source_sentence": "離諸惑結猶若虛空，修行忍辱得清淨故；",
        "translation": "Being free of the fetters of passions is like space, because by cultivating patience one attains purity.",
        "source": "T13n0404_002:0618a29_1"
    },
    {
        "source_sentence": "離所觀境猶若虛空，修行忍辱得清淨故；",
        "translation": "Being free of objects they contemplate is like space, because by cultivating patience and humility one attains purity.",
        "source": "T13n0404_002:0618b01_2"
    },
    {
        "source_sentence": "觀諸法性不生、不滅猶若虛空，修行忍辱得清淨故；",
        "translation": "Observing the nature of all dharmas as neither arising nor perishing is like space, because by cultivating patience and humility one attains purity.",
        "source": "T13n0404_002:0618b02_3"
    },
    {
        "source_sentence": "於色、無色以慈遍緣猶若虛空，修行忍辱得清淨故。",
        "translation": "Because form and formlessness are pervasively conditioned by kindness like space, cultivating patience and humility obtains purity.",
        "source": "T13n0404_002:0618b04_0"
    },
    {
        "source_sentence": "是為菩薩成就八法，能淨修行忍辱波羅蜜多猶若虛空。",
        "translation": "These are the eight things a bodhisattva accomplishes that can purify the cultivation of forbearance and the perfection of forbearance like space.",
        "source": "T13n0404_002:0618b05_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0618b06_2"
    },
    {
        "source_sentence": "復有八法，能諦觀察修行忍辱波羅蜜多。",
        "translation": "Again, there are eight things that can truly observe the cultivation of the perfection of forbearance.",
        "source": "T13n0404_002:0618b06_3"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T13n0404_002:0618b07_4"
    },
    {
        "source_sentence": "所謂性空忍辱，不壞諸見故；",
        "translation": "The so-called tolerance of emptiness by nature is patience because it does not destroy views.",
        "source": "T13n0404_002:0618b07_5"
    },
    {
        "source_sentence": "無相忍辱，不遣於相故；",
        "translation": "Forbearance without marks is because it does not reject marks.",
        "source": "T13n0404_002:0618b08_6"
    },
    {
        "source_sentence": "無願忍辱，不捨菩提故；",
        "translation": "They have no desire or forbearance, because they do not give up enlightenment.",
        "source": "T13n0404_002:0618b09_0"
    },
    {
        "source_sentence": "無行忍辱，不盡有為故；",
        "translation": "They have no practice or forbearance because they do not exhaust conditioned things.",
        "source": "T13n0404_002:0618b09_1"
    },
    {
        "source_sentence": "無生忍辱，不住無為故；",
        "translation": "Forbearance of nonorigination is because they do not abide in the unconditioned.",
        "source": "T13n0404_002:0618b10_2"
    },
    {
        "source_sentence": "無起忍辱，不住生滅故；",
        "translation": "They do not engender forbearance, because they do not abide in arising or ceasing.",
        "source": "T13n0404_002:0618b10_3"
    },
    {
        "source_sentence": "無有情忍辱，不壞體性故；",
        "translation": "There are no sentient beings who tolerate humility, because they do not destroy their essence.",
        "source": "T13n0404_002:0618b11_4"
    },
    {
        "source_sentence": "如如忍辱，不壞三世故。",
        "translation": "Forbearance of thusness and thusness doesn't destroy the three worlds.",
        "source": "T13n0404_002:0618b11_5"
    },
    {
        "source_sentence": "如是，善男子！",
        "translation": "So it is, good man!",
        "source": "T13n0404_002:0618b12_6"
    },
    {
        "source_sentence": "是為八種諦察法忍能修忍辱波羅蜜多。",
        "translation": "These are the eight kinds of forbearance that investigates the Dharma and cultivates the perfection of forbearance.",
        "source": "T13n0404_002:0618b12_7"
    },
    {
        "source_sentence": "「又，善男子！",
        "translation": "Again, good man!",
        "source": "T13n0404_002:0618b13_8"
    },
    {
        "source_sentence": "行忍辱波羅蜜多時，若有毀罵於我，我當忍受，名我忍辱，非忍辱波羅蜜多。",
        "translation": "When he practices the perfection of forbearance, if someone disparages me, I will tolerate it, which is called self-forbearance and not the perfection of forbearance.",
        "source": "T13n0404_002:0618b13_9"
    },
    {
        "source_sentence": "若見罵者及以罵法，我當忍受，名我忍辱，非忍辱波羅蜜多。",
        "translation": "If I see someone who ridicules and abuses the Dharma, I will tolerate it, which is called self-forbearance, not the perfection of forbearance.",
        "source": "T13n0404_002:0618b15_10"
    },
    {
        "source_sentence": "住無諍行是音聲忍辱，非忍辱波羅蜜多。",
        "translation": "To abide in the practice of no anger is to tolerate sound and not the perfection of forbearance.",
        "source": "T13n0404_002:0618b16_11"
    },
    {
        "source_sentence": "作是加行彼我俱空，思惟忍受彼我無常，思惟忍受，此名施設忍辱，非忍辱波羅蜜多。",
        "translation": "Doing so, they contemplate the emptiness of both self and self in terms of applied practices, contemplate tolerating that self as impermanent and contemplate tolerating it, and this is called establishing forbearance, which isn't the perfection of forbearance.",
        "source": "T13n0404_002:0618b17_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0618b19_13"
    },
    {
        "source_sentence": "都不見有能行、所行。",
        "translation": "They don't see anything that can or can't be done.",
        "source": "T13n0404_002:0618b19_14"
    },
    {
        "source_sentence": "譬如大娑羅林，若復有人手持利斧，入彼林中斫其枝葉，彼樹終無一念之心，",
        "translation": "It's like a great sal trees forest, and if another person carries a sharp axe in their hand and enters that forest to slice its branches and leaves, that tree will never have a single thought.",
        "source": "T13n0404_002:0618b20_15"
    },
    {
        "source_sentence": "彼為能斫、此為所斫，不生憎愛。",
        "translation": "They are the subject of anger and this is the object of anger, and they don't become hateful.",
        "source": "T13n0404_002:0618b22_16"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0618b22_17"
    },
    {
        "source_sentence": "菩薩摩訶薩行忍辱波羅蜜多時，亦復如是無有憎愛，無能分別、無所分別，",
        "translation": "“Furthermore, when great enlightening beings practice the perfection of forbearance, they also have no desire or hatred, no discrimination and no discrimination whatsoever.",
        "source": "T13n0404_002:0618b22_18"
    },
    {
        "source_sentence": "是為菩薩修行忍辱波羅蜜多猶若虛空。」",
        "translation": "This is the bodhisattva's cultivation of the perfection of forbearance like space.",
        "source": "T13n0404_002:0618b24_19"
    },
    {
        "source_sentence": "「盡智無生清淨忍，　　於境不染意成就；",
        "translation": "The pure forbearance of the knowledge of extinction and nonorigination Is Accompanied by unstained mind in regard to objects.",
        "source": "T13n0404_002:0618b25_20"
    },
    {
        "source_sentence": "　內、外寂靜無所依，　　心淨忍辱虛空等。",
        "translation": "Both internal and external tranquility have no basis: The mind is pure, enduring humility like space.",
        "source": "T13n0404_002:0618b25_20"
    },
    {
        "source_sentence": "　是身如影、如草木，　　心形如幻無真實；",
        "translation": "This body is like a reflection, like grass or trees; The form of the mind is like an illusion, not real.",
        "source": "T13n0404_002:0618b25_20"
    },
    {
        "source_sentence": "　是法性空無所見，　　身、心變異等於彼。",
        "translation": "The essence of dharmas is void, and nothing is seen: Such are the transformations of bodies and minds as these.",
        "source": "T13n0404_002:0618b25_20"
    },
    {
        "source_sentence": "　設有毀、譽無喜、怒，　　無所分別、無高下；",
        "translation": "If there is disparagement, praise, no joy or anger, There is no discrimination of what is superior and what is inferior.",
        "source": "T13n0404_002:0618b25_20"
    },
    {
        "source_sentence": "　知忍如地、如門閫，　　依教忍辱度有情。",
        "translation": "Knowing that forbearance is like the ground and gate, they rely on tolerance and humility to save sentient beings.",
        "source": "T13n0404_002:0618b25_20"
    },
    {
        "source_sentence": "　雖知一切法性空，　　無人、無我、無壽命；",
        "translation": "Though they know the essence of all things is void, They have no person, no self, and no life span.",
        "source": "T13n0404_002:0618b25_20"
    },
    {
        "source_sentence": "　不違因緣及造作，　　此忍最為真實行。",
        "translation": "Not contradicting causes and conditions or creations, this forbearance is the most true practice.",
        "source": "T13n0404_002:0618b25_20"
    },
    {
        "source_sentence": "　聞彼惡言不瞋恚，　　知語言性如虛空；",
        "translation": "They hear their evil words and aren’t angry, Knowing the nature of speech is like space.",
        "source": "T13n0404_002:0618b25_20"
    },
    {
        "source_sentence": "　修習身、心空亦然，　　當淨有情修此忍。",
        "translation": "Cultivating body and mind as well as emptiness, they should purify sentient beings and cultivate this forbearance.",
        "source": "T13n0404_002:0618b25_20"
    },
    {
        "source_sentence": "爾時，世尊說伽他曰：「善男子！",
        "translation": "It was then that the Bhagavān addressed him, Good man!",
        "source": "T13n0404_002:0618b25_20"
    },
    {
        "source_sentence": "云何菩薩修行精進波羅蜜多猶若虛空？",
        "translation": "How does a bodhisattva cultivate the perfection of effort like space?",
        "source": "T13n0404_002:0618c08_21"
    },
    {
        "source_sentence": "若菩薩成就四法，修行精進波羅蜜多猶若虛空。",
        "translation": "Suppose a bodhisattva accomplishes four things and cultivates the perfection of effort like space when he cultivates the perfection of effort.",
        "source": "T13n0404_002:0618c09_22"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T13n0404_002:0618c10_23"
    },
    {
        "source_sentence": "所謂：勤修善根，知一切法未成就故；",
        "translation": "They diligently cultivate roots of goodness, because they know all things have not yet been perfected.",
        "source": "T13n0404_002:0618c10_24"
    },
    {
        "source_sentence": "於諸佛所作大供養，了知如來身平等故；",
        "translation": "They make great offerings to all buddhas because they know the body of enlightened ones is equal.",
        "source": "T13n0404_002:0618c11_25"
    },
    {
        "source_sentence": "常樂成就無量有情，知諸有情無所得故；",
        "translation": "Countless sentient beings are always happy to develop, because they know all sentient beings have nothing to attain.",
        "source": "T13n0404_002:0618c12_26"
    },
    {
        "source_sentence": "從諸佛所受持正法，不見諸法所厭離故。",
        "translation": "They receive and uphold the right teaching from the buddhas, because they don't see or become disillusioned with the teaching.",
        "source": "T13n0404_002:0618c13_27"
    },
    {
        "source_sentence": "是為菩薩成就四法，修行精進波羅蜜多猶若虛空。",
        "translation": "These are the four things a bodhisattva accomplishes when he cultivates the perfection of effort like space.",
        "source": "T13n0404_002:0618c14_28"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T13n0404_002:0618c15_29"
    },
    {
        "source_sentence": "若菩薩成就八法，能淨修行精進波羅蜜多。",
        "translation": "If a bodhisattva accomplishes eight things, he'll be able to purify the perfection of effort.",
        "source": "T13n0404_002:0618c15_30"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T13n0404_002:0618c16_31"
    },
    {
        "source_sentence": "由莊嚴身，勤行精進，知身如影，像無所得故；",
        "translation": "Because of their adorned body, they diligently practice and make effort. They know the body is like a reflection, because images are ungraspable.",
        "source": "T13n0404_002:0618c16_32"
    },
    {
        "source_sentence": "由莊嚴語，勤行精進，知語如露，性無所得故；",
        "translation": "Because of their adorned speech, they diligently practice and make effort. They know speech is like space because by its nature they do not attain anything.",
        "source": "T13n0404_002:0618c17_33"
    },
    {
        "source_sentence": "由莊嚴心，勤行精進，得致於定，知心無所得故；",
        "translation": "Because of their adorned minds, they diligently practice and make effort to attain concentration, because they know the mind is ungraspable.",
        "source": "T13n0404_002:0618c18_34"
    },
    {
        "source_sentence": "為具諸波羅蜜分，勤行精進，展轉修習，思惟無所得故；",
        "translation": "In order to fulfill the aids to enlightenment, they diligently practice and exert effort, cultivating them one after another, thinking of them as ungraspable.",
        "source": "T13n0404_002:0618c19_35"
    },
    {
        "source_sentence": "由成就一切菩提分法，勤行精進，菩提性相，思惟無所得故；",
        "translation": "Because they have perfected all the factors of enlightenment, diligently practicing and exerting themselves. The essence and characteristics of enlightenment are ungraspable in their contemplation.",
        "source": "T13n0404_002:0618c21_36"
    },
    {
        "source_sentence": "為淨佛土，勤行精進，知諸佛國等於虛空，無所得故；",
        "translation": "In order to purify the buddha-lands they diligently practice and make effort, knowing that all buddha-lands are equal to space because there is nothing to be gained.",
        "source": "T13n0404_002:0618c22_37"
    },
    {
        "source_sentence": "為成就一切所聞悉皆能持，勤行精進，知所聞法猶如響應，究竟無所得故；",
        "translation": "In order to perfect the ability to retain all they hear, they diligently undertake effort. They know that the teachings they hear are like echoes, because ultimately they have no attainment.",
        "source": "T13n0404_002:0618c23_38"
    },
    {
        "source_sentence": "為成就一切佛法故，勤行精進，知諸法界平等一相，思惟無所得故。",
        "translation": "In order to perfect all buddha-teachings, they diligently practice zealously, knowing the equality of all realms of reality as one single characteristic, because their contemplation is ungraspable.",
        "source": "T13n0404_002:0618c25_39"
    },
    {
        "source_sentence": "是為菩薩成就八法，能淨修行精進波羅蜜多。",
        "translation": "These are the eight things a bodhisattva accomplishes that enable him to purify the perfection of effort.",
        "source": "T13n0404_002:0618c26_40"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0618c28_0"
    },
    {
        "source_sentence": "菩薩復有二種精進，所謂：加行精進；",
        "translation": "“Furthermore, enlightening beings have two kinds of effort:",
        "source": "T13n0404_002:0618c28_1"
    },
    {
        "source_sentence": "限齊精進。",
        "translation": "It's limited to exertion.",
        "source": "T13n0404_002:0618c29_0"
    },
    {
        "source_sentence": "以加行精進策身、口、意，修習成就一切善法，無有所住，思惟無所得故。",
        "translation": "It's because the body, speech, and mind are disciplined by applied effort, cultivating and accomplishing all good qualities, there's nothing to abide in, and contemplation has no gain.",
        "source": "T13n0404_002:0618c29_1"
    },
    {
        "source_sentence": "以限齊精進應住不出、不入，隨順法界無所去來，則如虛空，無所得故。",
        "translation": "Because it's limited to the amount of effort that should abide, doesn't arise, and doesn't enter, and follows the Dharma realm without going or coming, then it's like space because there's nothing to be gained.",
        "source": "T13n0404_002:0619a01_2"
    },
    {
        "source_sentence": "如虛空無色於諸有情成就所作，菩薩精進亦復如是，依諸佛法成就一切有情事故。",
        "translation": "Just as space and formlessness are created by the accomplishment of all sentient beings, so is the bodhisattva's effort likewise, which accomplishes the tasks of all sentient beings based on the Buddha's teachings.",
        "source": "T13n0404_002:0619a03_3"
    },
    {
        "source_sentence": "如虛空含容一切色，菩薩精進含容一切有情，離一切見亦復如是。",
        "translation": "Just as space contains all forms, the bodhisattva's effort contains all sentient beings, and so it is when he parts with all views.",
        "source": "T13n0404_002:0619a05_4"
    },
    {
        "source_sentence": "如虛空一切草木生長無根、無住，菩薩精進生長一切佛法，不住我見亦復如是。",
        "translation": "Just as all the grass and trees in space grow without roots or abiding, so does the bodhisattva's exertion grow all the Buddha's teachings, and he doesn't abide in self or view likewise.",
        "source": "T13n0404_002:0619a07_0"
    },
    {
        "source_sentence": "如虛空遍一切處無所動搖，菩薩精進遍一切善法，無所動相亦復如是。",
        "translation": "Just as space pervades all places without moving anything, so does the bodhisattva's exertion pervade all good qualities, and so is the characteristic of nothing moving likewise.",
        "source": "T13n0404_002:0619a08_1"
    },
    {
        "source_sentence": "如虛空等現種種色，菩薩精進等為有情，示現修習平等思惟，皆無所得亦復如是。",
        "translation": "Just as space and so forth manifest various forms, so does the bodhisattva's effort and so forth show that they cultivate equal contemplation for sentient beings, which are all unobtainable.",
        "source": "T13n0404_002:0619a10_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0619a12_3"
    },
    {
        "source_sentence": "是為菩薩修行精進波羅蜜多猶若虛空。」",
        "translation": "This is the bodhisattva's cultivation of the perfection of effort like space.",
        "source": "T13n0404_002:0619a12_4"
    },
    {
        "source_sentence": "「勇猛所生精進力，　　無悋於身及命財；",
        "translation": "The power of energy generated by heroic effort Has no ill will toward body, life, or possessions.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　能行威德大菩提，　　於諸有情恒利益。",
        "translation": "Able to practice authoritative great enlightenment, They always benefit sentient beings.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　往昔所修功德利，　　不生厭倦常修習；",
        "translation": "The virtues and benefits cultivated in the past They never gave rise to weariness, always cultivating.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　愛樂解脫諸有情，　　於諸如來常供養。",
        "translation": "Sentient beings who delight in liberation Always make offerings to the enlightened ones.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　願遊無量諸佛剎，　　推伏一切諸魔羅；",
        "translation": "May they travel to infinite buddha-lands, Overpowering all demons.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　常樂給施一切人，　　常樂護持於淨戒，",
        "translation": "It’s always pleasant to give to all people, Always glad to guard pure precepts.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　常樂大慈相應忍，　　常樂勤集諸善根，",
        "translation": "He always delights in patience associated with great kindness, Always delights in diligently accumulating roots of goodness.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　思惟無量禪定心，　　以大智慧常觀察，",
        "translation": "Thinking of the mind of infinite meditation, They always contemplate with great knowledge.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　無量慈心捨瞋恚，　　功德利益正修行；",
        "translation": "With boundless kindness and compassion, they abandon anger And correctly practice virtuous benefits.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　於身、於命無所慳，　　善能解脫諸煩惱。",
        "translation": "Without stinginess in body or life, he's well able to liberate himself from the afflictions.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　常修無我空解脫，　　離相、無相大威德；",
        "translation": "They always cultivate selfless emptiness and liberation, Free from signs and signless, of great power.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　永離諸見修菩提，　　如幻、陽焰觀自性。",
        "translation": "Being permanently free of views and cultivating enlightenment, he contemplates his own nature like an illusion or mirage.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　樂說空法無思慮，　　依世淨行讀諸經；",
        "translation": "They delight in explaining the principle of emptiness without thought, Relying on worldly pure practices to recite scriptures.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　於法、無法二俱亡，　　不捨音聲及文字。",
        "translation": "They perish in both the Dharma and non-dharma, not abandoning sounds and words.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　於世常說諸經典，　　讚佛功德亦無邊；",
        "translation": "Always expounding scriptures in the world, They praise the virtues of buddhas boundlessly.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　有情心行既難量，　　智者應生大精進。",
        "translation": "Since the mental actions of sentient beings are difficult to measure, the wise should give rise to great effort.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　悟於無量有情性，　　不滯於生及不生；",
        "translation": "Enlightened by the boundless nature of sentient beings, They do not cling to birth or non-birth.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "　能以無邊精進心，　　常習度生諸淨法。",
        "translation": "With boundless energy, they can always cultivate the pure ways of liberation.",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "爾時，世尊說伽他曰：「善男子！",
        "translation": "It was then that the Bhagavān addressed him, Good man!",
        "source": "T13n0404_002:0619a13_5"
    },
    {
        "source_sentence": "云何菩薩修行禪定波羅蜜多猶若虛空？",
        "translation": "How does a bodhisattva cultivate the perfection of meditation like space?",
        "source": "T13n0404_002:0619b03_6"
    },
    {
        "source_sentence": "若菩薩成就四法，修行禪定波羅蜜多猶若虛空。",
        "translation": "Suppose a bodhisattva accomplishes four things and cultivates the perfection of meditation like space when he cultivates the perfection of meditation.",
        "source": "T13n0404_002:0619b04_7"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T13n0404_002:0619b05_8"
    },
    {
        "source_sentence": "所謂：安心於內，內心無所見；",
        "translation": "They are said to be at ease within, not seeing anything in their minds.",
        "source": "T13n0404_002:0619b05_9"
    },
    {
        "source_sentence": "制心於外，外心無所得；",
        "translation": "The restrained mind is external, while the outward mind has no acquisition.",
        "source": "T13n0404_002:0619b06_10"
    },
    {
        "source_sentence": "由自心平等故，知一切有情心亦平等；",
        "translation": "Because their own minds are equal, they know that the minds of all sentient beings are also equal.",
        "source": "T13n0404_002:0619b06_11"
    },
    {
        "source_sentence": "彼心及平等思惟，證知皆如幻化。",
        "translation": "That mind and equal contemplation realize that they're all illusory.",
        "source": "T13n0404_002:0619b07_12"
    },
    {
        "source_sentence": "是為菩薩成就四法，修行禪定波羅蜜多猶若虛空。",
        "translation": "These are the four things a bodhisattva accomplishes when he cultivates the perfection of meditation like space.",
        "source": "T13n0404_002:0619b08_13"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T13n0404_002:0619b09_14"
    },
    {
        "source_sentence": "若菩薩成就八法，能淨修行禪定波羅蜜多。",
        "translation": "If a bodhisattva accomplishes eight things, he'll be able to purify the perfection of meditation.",
        "source": "T13n0404_002:0619b09_15"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T13n0404_002:0619b10_16"
    },
    {
        "source_sentence": "所謂：不依蘊而修禪定；",
        "translation": "They cultivate meditation without relying on the aggregates.",
        "source": "T13n0404_002:0619b10_17"
    },
    {
        "source_sentence": "不依處而修禪定；",
        "translation": "They cultivate meditation without relying on anything.",
        "source": "T13n0404_002:0619b11_18"
    },
    {
        "source_sentence": "不依界而修禪定；",
        "translation": "They cultivate meditation without relying on worlds or realms.",
        "source": "T13n0404_002:0619b11_19"
    },
    {
        "source_sentence": "不依現世而修禪定；",
        "translation": "They do not rely on the present world to cultivate meditation.",
        "source": "T13n0404_002:0619b12_20"
    },
    {
        "source_sentence": "不依他世而修禪定；",
        "translation": "They do not rely on other worlds to cultivate meditation.",
        "source": "T13n0404_002:0619b12_21"
    },
    {
        "source_sentence": "不依欲界而修禪定；",
        "translation": "They do not rely on the realm of desire and cultivate meditative absorption.",
        "source": "T13n0404_002:0619b13_22"
    },
    {
        "source_sentence": "不依色界而修禪定；",
        "translation": "They do not rely on the realm of form to develop meditative absorption.",
        "source": "T13n0404_002:0619b13_23"
    },
    {
        "source_sentence": "不依無色界而修禪定。",
        "translation": "They don't rely on the formless realm and cultivate meditation.",
        "source": "T13n0404_002:0619b14_24"
    },
    {
        "source_sentence": "是為菩薩成就八法，能淨修行禪定波羅蜜多猶若虛空。",
        "translation": "These are the eight things a bodhisattva accomplishes that can purify the cultivation of the perfection of meditation like space.",
        "source": "T13n0404_002:0619b14_25"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T13n0404_002:0619b16_0"
    },
    {
        "source_sentence": "菩薩以專注心禪定清淨。",
        "translation": "The bodhisattva focuses his mind on the purity of meditation.",
        "source": "T13n0404_002:0619b16_1"
    },
    {
        "source_sentence": "云何專注？",
        "translation": "How do they concentrate?",
        "source": "T13n0404_002:0619b16_2"
    },
    {
        "source_sentence": "於法名字不除、不加，無變異、無差別，無損、無益，無取、無捨，無暗、無明，",
        "translation": "The names of the teachings are neither removed nor added, without change or distinction, without loss or gain, without grasping or relinquishing, without darkness or light.",
        "source": "T13n0404_002:0619b17_3"
    },
    {
        "source_sentence": "無分別、非不分別，無想、無作意，無一、無二亦無無一二，無動、無思、無戲論，",
        "translation": "They have neither discrimination nor non-discrimination, no ideation nor non-thought; they are without oneness, without duality, and without unity or distinction. They have no movement, no thought, and no conceptual elaboration.",
        "source": "T13n0404_002:0619b18_4"
    },
    {
        "source_sentence": "無積聚亦無無積聚，不思惟一切相，心無所住，名為專注。",
        "translation": "Without accumulation, there's no accumulation, and without accumulation, he doesn't contemplate all characteristics, and his mind has no place to abide, which is called concentration.",
        "source": "T13n0404_002:0619b20_5"
    },
    {
        "source_sentence": "專注心不流散，於色、眼、色識遠離故自相清淨；",
        "translation": "The concentrated mind is not scattered. Because form, eye, and material consciousness are separated from each other, their specific characteristics are purified.",
        "source": "T13n0404_002:0619b21_6"
    },
    {
        "source_sentence": "觀行專注心不流散，於聲、耳、聲識遠離故自相清淨；",
        "translation": "The practice of contemplation is concentrated, the mind not scattered; its specific characteristics are pure because it is far removed from sound, hearing, and consciousness of sound.",
        "source": "T13n0404_002:0619b22_7"
    },
    {
        "source_sentence": "專注心不流散，於香、鼻、香識遠離故自相清淨；",
        "translation": "They concentrate their minds and are not distracted. Because they are far removed from smell, nose, or consciousness of smell, their distinctive characteristics are pure.",
        "source": "T13n0404_002:0619b23_8"
    },
    {
        "source_sentence": "專注心不流散，於味、舌、味識遠離故自相清淨；",
        "translation": "They concentrate their minds without distraction, being free from taste, tongue, and consciousness of taste. Because they are detached from taste, the distinctive characteristics are pure.",
        "source": "T13n0404_002:0619b24_9"
    },
    {
        "source_sentence": "專注心不流散，於觸、身、觸識遠離故自相清淨；",
        "translation": "The concentrated mind is not scattered, because its specific characteristics are purified by separation from contact, body, and sense consciousness.",
        "source": "T13n0404_002:0619b25_10"
    },
    {
        "source_sentence": "專注心不流散，於法、意、法識遠離故自相清淨。",
        "translation": "The concentrated mind isn't distracted, and its distinctive characteristics are pure because it's free of dharmas, thoughts, and consciousnesses that are dharmas.",
        "source": "T13n0404_002:0619b27_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0619b28_1"
    },
    {
        "source_sentence": "譬如虛空，於劫燒時不為所燒，於水災時不為所濕。",
        "translation": "It's like space that isn't burned when an eon is burned and isn't wet when a water disaster occurs.",
        "source": "T13n0404_002:0619b28_2"
    },
    {
        "source_sentence": "如是菩薩修習禪定，不為一切諸煩惱火之所焚燒；",
        "translation": "Thus enlightening beings cultivate meditation without being burned by the fire of all afflictions.",
        "source": "T13n0404_002:0619b29_3"
    },
    {
        "source_sentence": "一切解脫等持、等至，諸禪定水之所漂溺。",
        "translation": "All liberations such as equipoise and equipoise are submerged in the waters of meditation.",
        "source": "T13n0404_002:0619c01_4"
    },
    {
        "source_sentence": "常無間雜，令散動有情安住禪定，而於禪定不生愛味，出定亦然，無復障礙。",
        "translation": "They are always uninterrupted, causing scattered sentient beings to abide in meditative absorption, yet they don't give rise to the taste of desire in meditation, and so is their exiting concentration without further obstruction.",
        "source": "T13n0404_002:0619c02_5"
    },
    {
        "source_sentence": "於諸聖人常現寂靜，非聖人所勤成就之。",
        "translation": "He always shows quiescence to sages, but it's not something the noble person diligently accomplishes.",
        "source": "T13n0404_002:0619c04_6"
    },
    {
        "source_sentence": "常令定心住於平等，不平等者說法化導。",
        "translation": "He always causes his concentrated mind to abide in equality, and those who aren't equal teach the Dharma and guide it.",
        "source": "T13n0404_002:0619c05_7"
    },
    {
        "source_sentence": "不見平等及不平等，於等、不等亦不相違。",
        "translation": "They don't see equality and none of equality, and they aren't at odds with equality and none.",
        "source": "T13n0404_002:0619c06_8"
    },
    {
        "source_sentence": "心無有礙猶如虛空，是故名為修禪定者；",
        "translation": "The mind is unobstructed like space. That is why it is called someone cultivating meditative absorption.",
        "source": "T13n0404_002:0619c07_9"
    },
    {
        "source_sentence": "亦名勝慧修禪定者；",
        "translation": "They are also called those who cultivate meditative absorption with superior wisdom.",
        "source": "T13n0404_002:0619c08_10"
    },
    {
        "source_sentence": "亦名不住識修禪定者。",
        "translation": "It's also called someone who doesn't abide in consciousness and cultivates meditation.",
        "source": "T13n0404_002:0619c08_11"
    },
    {
        "source_sentence": "由此定故，而彼菩薩獲得如是無住禪定猶若虛空。」",
        "translation": "Because of this concentration, that bodhisattva attains such an unabiding meditation like space.",
        "source": "T13n0404_002:0619c09_12"
    },
    {
        "source_sentence": "「善護諸根修靜慮，　　常定不著於有情；",
        "translation": "He well guards his faculties and cultivates meditation, Always concentrating without attachment to sentient beings.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　等引平等度世間，　　於內、於外常安住。",
        "translation": "Equanimous equality leads to the liberation of the world, which always abides peacefully inside and out.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　不依於蘊及處、界，　　遠離境界住寂靜；",
        "translation": "They do not rely on the aggregates, locations, or realms, Abiding in quiescence far removed from objects.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　智者其心常在禪，　　於等、不等皆平等。",
        "translation": "A wise person's mind is always in meditation, and equal and unequal are both equal.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　達於法界無高下，　　見心與意皆寂靜；",
        "translation": "Attaining the realm of reality, there is no high or low, Seeing mind and thought are both quiescent.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　為令世間成就故，　　示現諸禪及變易。",
        "translation": "In order to cause the world to be accomplished, they show meditations and transformations.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　彼無變易及禪定，　　自在心趣亦復然；",
        "translation": "Their unchanging and meditative states of concentration, So are their free minds and paths.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　現境無色禪定中，　　示現欲界亦如是。",
        "translation": "The same applies to manifesting objects and to the one of formless trance, Manifesting the realm of sexual passion.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　皆為有情成就故，　　彼復不著於有情；",
        "translation": "Because they are all accomplished for the sake of sentient beings, They also do not cling to sentient beings.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　境界如空、如幻化，　　陽炎、水月、夢及雲。",
        "translation": "The objective realm is like space or illusion, Like the sun, water, moon, dreams, and clouds.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　已知禪定及世間，　　即轉世心成智慧；",
        "translation": "Knowing meditation and worldly, They instantly turn the minds of all beings into wisdom.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　不能覆蔽於心故，　　則得生於自在心。",
        "translation": "Because they can’t obstruct the mind, They are able to give rise to a self-contained mind.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　了達禪定及神通，　　遊歷遍於俱胝剎；",
        "translation": "Understanding meditation and mystic powers, They traveled all over the continents.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　普能供養於諸佛，　　無知惑障悉斷除。",
        "translation": "Being able to universally make offerings to the buddhas, they completely remove the afflictive hindrance of ignorance.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　諸根調伏意寂然，　　度奢摩他無分別；",
        "translation": "Their faculties are subdued, their minds quiescent, And they liberate themselves from thoughtlessness without discrimination.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　世間及意俱清淨，　　常恒智力寂亦然。",
        "translation": "The world and mind are both pure, As is the power of eternal knowledge and voidness.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　以無所得住平等，　　故名平等遍無相；",
        "translation": "Because they abide in ungraspable equality, They are said to be equal and pervade signlessness.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "　若於平等無所住，　　是故名為得定者。",
        "translation": "If there's no abiding in equality, that's why it's called someone who attains concentration.",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "爾時，世尊說伽他曰：「善男子！",
        "translation": "It was then that the Bhagavān addressed him, Good man!",
        "source": "T13n0404_002:0619c11_0"
    },
    {
        "source_sentence": "云何菩薩修行般若波羅蜜多猶若虛空？",
        "translation": "How does a bodhisattva cultivate the perfection of wisdom like space?",
        "source": "T13n0404_002:0620a01_1"
    },
    {
        "source_sentence": "若菩薩成就四法，修行般若波羅蜜多猶若虛空。",
        "translation": "Suppose a bodhisattva accomplishes four things and cultivates the perfection of prajñāpāramitā like space.",
        "source": "T13n0404_002:0620a02_2"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T13n0404_002:0620a03_3"
    },
    {
        "source_sentence": "所謂：由虛空清淨故，入一切有情清淨；",
        "translation": "Because space is pure, entering all sentient beings is pure.",
        "source": "T13n0404_002:0620a03_4"
    },
    {
        "source_sentence": "由智清淨故，入一切識清淨；",
        "translation": "Because knowledge is purified, the entry into all conscious constructs is purified.",
        "source": "T13n0404_002:0620a04_5"
    },
    {
        "source_sentence": "由法界清淨故，入我、人、有情、壽者清淨；",
        "translation": "Because the realm of reality is purified, the sense-field self, humans, sentient beings, and life spans are purified.",
        "source": "T13n0404_002:0620a04_6"
    },
    {
        "source_sentence": "由義清淨故，入一切文字清淨。",
        "translation": "Because the meaning is purified, all words that enter it are purified.",
        "source": "T13n0404_002:0620a05_7"
    },
    {
        "source_sentence": "是為菩薩成就四法，修行般若波羅蜜多猶若虛空。",
        "translation": "These are the four things that bodhisattvas accomplish when they cultivate the perfection of prajñāpāramitā like space.",
        "source": "T13n0404_002:0620a06_8"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T13n0404_002:0620a08_0"
    },
    {
        "source_sentence": "若菩薩成就八法，能淨修行般若波羅蜜多。",
        "translation": "If a bodhisattva accomplishes eight things, he can purify the cultivation of the perfection of prajñāpāramitā.",
        "source": "T13n0404_002:0620a08_1"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T13n0404_002:0620a09_2"
    },
    {
        "source_sentence": "所謂：勤集一切善法，不著常見；",
        "translation": "They diligently accumulate all good qualities, not clinging to the conventional.",
        "source": "T13n0404_002:0620a09_3"
    },
    {
        "source_sentence": "勤斷一切不善法，不著斷見；",
        "translation": "They diligently eliminate all unwholesome states, not clinging to views of annihilation.",
        "source": "T13n0404_002:0620a10_4"
    },
    {
        "source_sentence": "知緣起法而不違於無生法忍；",
        "translation": "They know the principle of dependent origination and do not disobey the tolerance of the nonorigination of things.",
        "source": "T13n0404_002:0620a10_5"
    },
    {
        "source_sentence": "現四無礙解而不著於四辯；",
        "translation": "They manifest the four unhindered understandings and are not attached to the four kinds of explanation.",
        "source": "T13n0404_002:0620a11_6"
    },
    {
        "source_sentence": "善能決擇四鄔馱南，不見無常、苦、無我、寂靜；",
        "translation": "He was able to skillfully discriminate the four continents, not seeing impermanence, suffering, selflessness, or quiescence.",
        "source": "T13n0404_002:0620a12_7"
    },
    {
        "source_sentence": "善說業果而亦不動；",
        "translation": "They speak well of the fruits of action, yet they do not move.",
        "source": "T13n0404_002:0620a13_8"
    },
    {
        "source_sentence": "於無業果住無戲論；",
        "translation": "They abide in the absence of results of action, without conceptual elaborations.",
        "source": "T13n0404_002:0620a13_9"
    },
    {
        "source_sentence": "智常顯說一切法句差別之相；",
        "translation": "Their knowledge always reveals the distinctive characteristics of all teachings.",
        "source": "T13n0404_002:0620a14_10"
    },
    {
        "source_sentence": "善得一切淨法光明；",
        "translation": "They attain the light of all pure teachings.",
        "source": "T13n0404_002:0620a14_11"
    },
    {
        "source_sentence": "於諸有情說於清淨及雜染法。",
        "translation": "He teaches the pure and defiled dharmas to sentient beings.",
        "source": "T13n0404_002:0620a15_12"
    },
    {
        "source_sentence": "是為菩薩成就八法能淨修行般若波羅蜜多。",
        "translation": "These are the eight things that a bodhisattva accomplishes to purify the cultivation of prajñāpāramitā.",
        "source": "T13n0404_002:0620a16_13"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0620a17_14"
    },
    {
        "source_sentence": "當知般若是清淨句，能摧惡覺故；",
        "translation": "You should know that prajñā is a pure phrase, because it destroys bad thoughts.",
        "source": "T13n0404_002:0620a17_15"
    },
    {
        "source_sentence": "是無變異句，自相清淨故；",
        "translation": "This is the phrase unchanging, because its specific characteristics are pure.",
        "source": "T13n0404_002:0620a18_16"
    },
    {
        "source_sentence": "是無分別句，無可限齊故；",
        "translation": "They are nondiscriminating phrases, because there is no limitation.",
        "source": "T13n0404_002:0620a18_17"
    },
    {
        "source_sentence": "是如實句，性真實故；",
        "translation": "These sentences are as they really are, because their nature is real.",
        "source": "T13n0404_002:0620a19_18"
    },
    {
        "source_sentence": "是諦句，無動搖故；",
        "translation": "It is a statement of truth because it does not budge.",
        "source": "T13n0404_002:0620a19_19"
    },
    {
        "source_sentence": "是誠實句，無虛誑故；",
        "translation": "They are words of sincerity, because there is no falsehood in them.",
        "source": "T13n0404_002:0620a20_20"
    },
    {
        "source_sentence": "是聰慧句，解諸縛故；",
        "translation": "This is the phrase wise, because it frees one from all bonds.",
        "source": "T13n0404_002:0620a20_21"
    },
    {
        "source_sentence": "是滿足句，聖者功德故；",
        "translation": "This is the phrase ‘complete’ because of the noble one’s merit.",
        "source": "T13n0404_002:0620a21_22"
    },
    {
        "source_sentence": "是通達句，善能觀察故；",
        "translation": "These are the sentences of penetration, because they can be well observed.",
        "source": "T13n0404_002:0620a21_23"
    },
    {
        "source_sentence": "是第一義句，無所言說故；",
        "translation": "This is the first meaningful phrase, because there is nothing to be said.",
        "source": "T13n0404_002:0620a22_24"
    },
    {
        "source_sentence": "是平等句，無差別故；",
        "translation": "This is the phrase equality because there is no distinction.",
        "source": "T13n0404_002:0620a22_25"
    },
    {
        "source_sentence": "是堅牢句，不可壞故；",
        "translation": "This is the phrase firm, because it cannot be broken.",
        "source": "T13n0404_002:0620a23_26"
    },
    {
        "source_sentence": "是不動句，無所依故；",
        "translation": "It is an unmoving phrase because it has no basis.",
        "source": "T13n0404_002:0620a23_27"
    },
    {
        "source_sentence": "是金剛句，能穿鑿故；",
        "translation": "This is the adamantine phrase, because it penetrates.",
        "source": "T13n0404_002:0620a24_28"
    },
    {
        "source_sentence": "是濟度句，所作已辦故；",
        "translation": "This is the phrase ‘to save’ because what should be done has already been done.",
        "source": "T13n0404_002:0620a24_29"
    },
    {
        "source_sentence": "是清淨句，性無染故；",
        "translation": "This is a pure phrase, because its nature is without defilement.",
        "source": "T13n0404_002:0620a25_30"
    },
    {
        "source_sentence": "是無暗句，明無所得故；",
        "translation": "This is the phrase without darkness, because light has no attainment.",
        "source": "T13n0404_002:0620a25_31"
    },
    {
        "source_sentence": "是無二句，無有建立故；",
        "translation": "These are not two phrases, because there is no establishment.",
        "source": "T13n0404_002:0620a26_32"
    },
    {
        "source_sentence": "是盡句，究竟盡滅故；",
        "translation": "This is the phrase exhaustion, because it completely extinguishes.",
        "source": "T13n0404_002:0620a26_33"
    },
    {
        "source_sentence": "是無盡句，無為常住故；",
        "translation": "These are inexhaustible phrases because the unconditioned is eternally abiding.",
        "source": "T13n0404_002:0620a27_34"
    },
    {
        "source_sentence": "是無為句，非生、滅所攝故；",
        "translation": "It is an unconditioned phrase, because it does not include arising and ceasing.",
        "source": "T13n0404_002:0620a27_35"
    },
    {
        "source_sentence": "是空句，最清淨故；",
        "translation": "This is the phrase emptiness because it is the purest.",
        "source": "T13n0404_002:0620a28_36"
    },
    {
        "source_sentence": "是虛空句，無障礙故；",
        "translation": "The phrase space is unobstructed.",
        "source": "T13n0404_002:0620a28_37"
    },
    {
        "source_sentence": "是虛空道句，無行迹故；",
        "translation": "This is the phrase of the path of space, because there are no traces of practice.",
        "source": "T13n0404_002:0620a29_38"
    },
    {
        "source_sentence": "是無所得句，自性無故；",
        "translation": "This is an ungraspable phrase, because its intrinsic nature is nonexistent.",
        "source": "T13n0404_002:0620a29_39"
    },
    {
        "source_sentence": "是智句，智、識無二故；",
        "translation": "This is a sentence of knowledge, because knowledge and consciousness are not two.",
        "source": "T13n0404_002:0620b01_40"
    },
    {
        "source_sentence": "是無摧句，離對治故；",
        "translation": "This is the statement that there is no destruction because it is free from antidote.",
        "source": "T13n0404_002:0620b01_41"
    },
    {
        "source_sentence": "是無身句，無轉易故；",
        "translation": "This is the absence of bodily statements because there is no transmutation.",
        "source": "T13n0404_002:0620b02_42"
    },
    {
        "source_sentence": "是苦遍知句，離遍計苦故；",
        "translation": "This is the sentence pervasive knowing of suffering because it is free from pervasive discriminating suffering.",
        "source": "T13n0404_002:0620b02_43"
    },
    {
        "source_sentence": "是集斷句，害貪欲故；",
        "translation": "This is the phrase ‘to be abandoned through accumulation’ because it harms craving.",
        "source": "T13n0404_002:0620b03_44"
    },
    {
        "source_sentence": "是證滅句，究竟無生故；",
        "translation": "This is the sentence that actualizes cessation, because ultimately there is no arising.",
        "source": "T13n0404_002:0620b03_45"
    },
    {
        "source_sentence": "是修道句，入無二道故；",
        "translation": "This is the phrase ‘to be cultivated’ because one enters the path of nonduality.",
        "source": "T13n0404_002:0620b04_46"
    },
    {
        "source_sentence": "是佛陀句，能生正覺故；",
        "translation": "The phrase buddha is able to produce true awakening.",
        "source": "T13n0404_002:0620b04_47"
    },
    {
        "source_sentence": "是達摩句，究竟離欲故。",
        "translation": "This is the dharma phrase, because it's ultimately free of desire.",
        "source": "T13n0404_002:0620b05_48"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0620b05_49"
    },
    {
        "source_sentence": "如是等類句義差別，智慧光明不屬於他，於所說法隨入少分，都無分別及所分別，",
        "translation": "The light of knowledge does not belong to others. He follows and penetrates the doctrine taught in a limited way, without any discrimination or conceptualization whatsoever.",
        "source": "T13n0404_002:0620b05_50"
    },
    {
        "source_sentence": "是名修行般若波羅蜜多猶若虛空。」",
        "translation": "This is called cultivating the perfection of prajñāpāramitā like space.",
        "source": "T13n0404_002:0620b07_51"
    },
    {
        "source_sentence": "「明慧能斷煩惱習，　　示現作業及因緣，",
        "translation": "“Knowing wisdom can cut off the accumulation of afflictions, Showing actions and causes and conditions.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　不依我見及有情，　　不住壽者并人相，",
        "translation": "They don’t rely on views of self or sentient beings, And they don’t abide in the characteristics of living beings or humans.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　於我、無我二俱離，　　顯說般若到真源。",
        "translation": "Being free of both self and selflessness, he explains that prajñā goes to the true source.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　般若能摧於所有，　　般若能度於瀑流，",
        "translation": "Prajñā can destroy all that exists, And prajñā can cross over the flowing stream.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　般若能作清淨因，　　般若能安勝解脫，",
        "translation": "Prajñā can be the pure cause, and prajñā can bring peace and liberation.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　淨慧能離諸纏蓋，　　於蘊、處、界悉遍知。",
        "translation": "Pure wisdom can be freed from the hindrances of the afflictions, Knowing all about aggregates, fields, and realms.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　明慧照曜三界空，　　於能、所相皆解脫；",
        "translation": "Understanding and wisdom illumining the emptiness of the three realms, They are liberated from all subjective and objective marks.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　修行般若令清淨，　　一切世間無所著；",
        "translation": "Cultivating practice of wisdom to make it pure, They have no attachment in all worlds.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　通達能行般若行，　　常修淨慧照真空。",
        "translation": "Understanding the practice of prajñā that can be practiced, he always cultivates pure wisdom to illuminate the vacuum.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　五眼清淨五根明，　　能除五趣淨五蘊；",
        "translation": "The five eyes are pure, the five faculties are clear, They can get rid of the five states and purify the five aggregates.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　至於彼岸常安住，　　入於法界亦復然；",
        "translation": "As far as the other shore, always abiding peacefully, So does entering the realm of reality.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　平等猶若大虛空，　　高廣善順於佛智。",
        "translation": "Equanimous like the great space, tall and wide, it well follows the Buddha's wisdom.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　於得、無得二俱離，　　能示中道甘露門；",
        "translation": "Being separated from both attainment and non-attainment, they can show the middle way as an ambrosia of immortality.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　隨順聖人之所行，　　善能分別、無分別。",
        "translation": "Following the practices of sages, they can skillfully discriminate and have no discrimination.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　能知苦、集斷貪愛，　　修道、示滅顯無為；",
        "translation": "They can know suffering and accumulation, cut off craving, And practice and show cessation to reveal the unconditioned.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　成就實智慧光明，　　故了三世無來、去。",
        "translation": "Accomplishing the light of true wisdom and knowledge, he therefore understands that there's no coming or going in the three times.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　於諸剎土皆平等，　　諸法寂靜等亦然；",
        "translation": "In all lands they are equal, As are the quiescence and tranquility of all things.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "　了諸有情無我、人，　　是則真修智慧者。",
        "translation": "Understanding that sentient beings lack self and person, this is the true cultivation of wisdom.",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "爾時世尊說伽他曰：「善男子！",
        "translation": "It was then that the Bhagavān addressed him, Good man!",
        "source": "T13n0404_002:0620b08_52"
    },
    {
        "source_sentence": "云何菩薩修行福德猶若虛空？",
        "translation": "How does a bodhisattva's cultivation of virtue become like space?",
        "source": "T13n0404_002:0620b28_53"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0620b28_54"
    },
    {
        "source_sentence": "一切法性猶如虛空，以菩提心而為種子，所修福聚皆不捨離於菩提心；",
        "translation": "The essence of all things is like space, being the seed of the determination for enlightenment; the stores of virtue cultivated do not give up the determination for enlightenment.",
        "source": "T13n0404_002:0620b29_55"
    },
    {
        "source_sentence": "積集善根而皆迴向薩婆若海，由是獲得無量福德皆如虛空。",
        "translation": "He accumulates good roots and dedicates them all to the ocean of sarvajña, and because of this he attains measureless merit like space.",
        "source": "T13n0404_002:0620c01_56"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0620c03_57"
    },
    {
        "source_sentence": "菩薩應當發如是心，虛空無量故，感招福聚亦復無量。",
        "translation": "Bodhisattvas should give rise to this kind of mind, because space is immeasurable and the accumulation of merit that brings about it is also immeasurable.",
        "source": "T13n0404_002:0620c03_58"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0404_002:0620c04_59"
    },
    {
        "source_sentence": "由意無量故福亦無量；",
        "translation": "Because thought is immeasurable, merit is also immeasurable.",
        "source": "T13n0404_002:0620c04_60"
    },
    {
        "source_sentence": "菩薩於彼應作是觀。",
        "translation": "A bodhisattva should observe it this way.",
        "source": "T13n0404_002:0620c05_61"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0620c05_62"
    },
    {
        "source_sentence": "復有十種無量莊嚴，菩薩應滿如是福聚。",
        "translation": "Again, there are ten kinds of immeasurable adornments that should fill the bodhisattva's stock of merit like this.",
        "source": "T13n0404_002:0620c05_63"
    },
    {
        "source_sentence": "云何為十？",
        "translation": "What are these ten?",
        "source": "T13n0404_002:0620c06_64"
    },
    {
        "source_sentence": "所謂：無量身莊嚴，相好圓滿故；",
        "translation": "They are the adornments of immeasurable bodies, because their marks and embellishments are perfect.",
        "source": "T13n0404_002:0620c07_65"
    },
    {
        "source_sentence": "無量語莊嚴，隨說法輪皆清淨故；",
        "translation": "They are the adornment of infinite speech, being purified by following the exposition of truth.",
        "source": "T13n0404_002:0620c07_66"
    },
    {
        "source_sentence": "無量心莊嚴，通達一切有情心故；",
        "translation": "They are adorned with infinite minds because they comprehend the minds of all sentient beings.",
        "source": "T13n0404_002:0620c08_67"
    },
    {
        "source_sentence": "無量行智莊嚴，成熟無量諸有情故；",
        "translation": "They are adorned by knowledge of infinite practices, developing infinite sentient beings.",
        "source": "T13n0404_002:0620c09_68"
    },
    {
        "source_sentence": "無量行相莊嚴，淨無量佛剎故；",
        "translation": "They are adorned with infinite forms of practice, purifying infinite buddha-lands.",
        "source": "T13n0404_002:0620c10_69"
    },
    {
        "source_sentence": "無量福德、禪定、精進莊嚴，成滿無量佛威儀故；",
        "translation": "They are adorned with immeasurable virtue, meditation and zeal, perfecting the deportment of buddhas of infinity.",
        "source": "T13n0404_002:0620c10_70"
    },
    {
        "source_sentence": "無量大菩提場莊嚴，應滿一切相及行故；",
        "translation": "Countless great adornments of the site of enlightenment should fulfill all characteristics and practices.",
        "source": "T13n0404_002:0620c11_71"
    },
    {
        "source_sentence": "無量無遮施會莊嚴，成滿無量佛毫相故；",
        "translation": "They are boundless and unobstructed, adorned by the assembly of giving, because they embody the characteristics of infinite buddhas.",
        "source": "T13n0404_002:0620c12_72"
    },
    {
        "source_sentence": "無量恭敬無我莊嚴，成滿如來無見頂相故；",
        "translation": "They are the adornments of immeasurable reverence and selflessness, because they fulfill the characteristics of the Buddha’s peak of non-vision.",
        "source": "T13n0404_002:0620c13_73"
    },
    {
        "source_sentence": "無量無間定心莊嚴，成滿無量無諂曲心順淨意故。",
        "translation": "The mind adorned with unlimited and unremitting concentration becomes fulfilled because it follows the pure intention of a mind free of flattery and dishonesty.",
        "source": "T13n0404_002:0620c14_74"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0620c15_75"
    },
    {
        "source_sentence": "是為十種無量莊嚴。",
        "translation": "These are the ten kinds of immeasurable adornment.",
        "source": "T13n0404_002:0620c16_76"
    },
    {
        "source_sentence": "菩薩若能如是發廣大心猶如虛空，所獲福德如虛空故。",
        "translation": "If bodhisattvas can thus give rise to a vast mind like space, the merit they attain will be like space.",
        "source": "T13n0404_002:0620c16_77"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0620c18_0"
    },
    {
        "source_sentence": "云何菩薩修行智慧猶如虛空？",
        "translation": "How does a bodhisattva's cultivation of wisdom resemble space?",
        "source": "T13n0404_002:0620c18_1"
    },
    {
        "source_sentence": "若菩薩遍緣一切有情，有欲心、無欲心如實知；",
        "translation": "If enlightening beings pervade all sentient beings, they truly know the minds with desire and the minds without desire.",
        "source": "T13n0404_002:0620c18_2"
    },
    {
        "source_sentence": "有瞋心、無瞋心如實知；",
        "translation": "“Great enlightening beings truly know the mind with anger and the mind without anger.",
        "source": "T13n0404_002:0620c19_3"
    },
    {
        "source_sentence": "有癡心、無癡心如實知；",
        "translation": "“Great enlightening beings truly know the mind with delusion and the mind without delusion.",
        "source": "T13n0404_002:0620c20_4"
    },
    {
        "source_sentence": "有雜染心、無雜染心如實知；",
        "translation": "“Great enlightening beings know as they really are the minds with defiled mental states and the minds without defiled mental states.",
        "source": "T13n0404_002:0620c21_0"
    },
    {
        "source_sentence": "自既離欲，復能為他補特伽羅說調伏欲法；",
        "translation": "Having themselves become dispassionate, they are also able to teach other persons the methods of civilizing desire for personal salvation.",
        "source": "T13n0404_002:0620c21_1"
    },
    {
        "source_sentence": "自既離瞋，復能為他補特伽羅說調伏瞋法；",
        "translation": "Being free of anger themselves, they are also able to teach others the methods for overcoming anger.",
        "source": "T13n0404_002:0620c22_2"
    },
    {
        "source_sentence": "自既離癡，復能為他補特伽羅說調伏癡法；",
        "translation": "Being themselves free of delusion, they are also able to teach others the methods for overcoming delusion.",
        "source": "T13n0404_002:0620c23_3"
    },
    {
        "source_sentence": "自離雜染，復能為他說調伏一切諸煩惱法；",
        "translation": "Being themselves free from defilement, they are also able to tame all afflictive states for others.",
        "source": "T13n0404_002:0620c24_4"
    },
    {
        "source_sentence": "不見有貪、瞋、癡煩惱者為下劣心，離貪、瞋、癡煩惱者為勝上心。",
        "translation": "Those who don't see the afflictions of craving, anger, and delusion are inferior mental states, and those who are free of the afflictions of craving, anger, and delusion are superior mental states.",
        "source": "T13n0404_002:0620c25_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0404_002:0620c27_6"
    },
    {
        "source_sentence": "以彼菩薩於不二法界清淨法門以證知故；",
        "translation": "It is because those enlightening beings realize the pure dharmas of the nondual realm of reality.",
        "source": "T13n0404_002:0620c27_7"
    },
    {
        "source_sentence": "如是法界即貪、瞋、癡界；",
        "translation": "In this way, the element of factors arising with every awareness is the realm of greed, the realm of hatred and the one of delusion.",
        "source": "T13n0404_002:0620c28_8"
    },
    {
        "source_sentence": "如是法界即離染界。",
        "translation": "Thus, the Dharma realm is free of the defiled realm.",
        "source": "T13n0404_002:0620c28_9"
    },
    {
        "source_sentence": "是故法界與一切法互相涉入，法界即法、法即法界，無所不遍。",
        "translation": "Therefore, the Dharma realm and all dharmas are interpenetrated, and the Dharma realm is the Dharma and dharmas are the Dharma realm, and there's nothing that they don't pervade.",
        "source": "T13n0404_002:0620c29_10"
    },
    {
        "source_sentence": "若知我界即知法界，法界、我界無有二故。",
        "translation": "If someone knows the self realm, they'll know the Dharma realm, and the Dharma realm and self realm are not two.",
        "source": "T13n0404_002:0621a01_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0404_002:0621a02_12"
    },
    {
        "source_sentence": "我清淨故法界清淨，如是一切法清淨故。",
        "translation": "Because the self is purified, the Dharma realm is purified, and so are all dharmas purified.",
        "source": "T13n0404_002:0621a02_13"
    },
    {
        "source_sentence": "光顯容受亦無容受，離於一切相無相故。",
        "translation": "Also, the tolerance of light and manifestation is without tolerance because apart from all characteristics, there are no characteristics.",
        "source": "T13n0404_002:0621a03_14"
    },
    {
        "source_sentence": "無所安立，猶如虛空，名無礙智。",
        "translation": "Nothing is established, just like space, which is called unobstructed cognition.",
        "source": "T13n0404_002:0621a04_15"
    },
    {
        "source_sentence": "由無礙智了一切法無所障礙，是為菩薩修行智慧猶如虛空。",
        "translation": "Because unhindered cognition understands all dharmas without obstruction, this is the bodhisattva's cultivation of wisdom like space.",
        "source": "T13n0404_002:0621a05_16"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621a07_0"
    },
    {
        "source_sentence": "云何菩薩佛所印可佛隨念？",
        "translation": "How does the bodhisattva Buddha seal what he approves of and follows his thoughts?",
        "source": "T13n0404_002:0621a07_1"
    },
    {
        "source_sentence": "所謂：念無漏戒，是戒佛隨念；",
        "translation": "Mindfulness of the pure precepts is the mental command of the Buddhadess of Morality.",
        "source": "T13n0404_002:0621a07_2"
    },
    {
        "source_sentence": "一切法平等不散，是定佛隨念；",
        "translation": "The equality and nondispersal of all things is the mental command of the Buddha in absorption.",
        "source": "T13n0404_002:0621a08_3"
    },
    {
        "source_sentence": "一切法無所分別，是慧佛隨念；",
        "translation": "The nondiscrimination of all things is the Buddha of Wisdom’s subsequent thought.",
        "source": "T13n0404_002:0621a09_4"
    },
    {
        "source_sentence": "不住於二心，是解脫佛隨念；",
        "translation": "Not abiding in two minds, is the mindfulness of buddhas of liberation.",
        "source": "T13n0404_002:0621a09_5"
    },
    {
        "source_sentence": "不著一切智，是解脫知見佛隨念；",
        "translation": "Not clinging to omniscience, they are the consciousnesses of liberation, knowing and seeing Buddha.",
        "source": "T13n0404_002:0621a10_6"
    },
    {
        "source_sentence": "三世平等不動，是力佛隨念；",
        "translation": "The unshakable equality of all times is the power of Buddha’s mindfulness.",
        "source": "T13n0404_002:0621a11_7"
    },
    {
        "source_sentence": "不住一切漏，是無所畏佛隨念；",
        "translation": "Not abiding in all taints, they are the heedfulness of fearless buddhas.",
        "source": "T13n0404_002:0621a11_8"
    },
    {
        "source_sentence": "如是當念佛身所有一切功德，皆是佛隨念，法界平等無所分別。",
        "translation": "Thus, all the merits of the Buddha's body that will be remembered in this way are all the Buddha's mindfulness, and the Dharma realm is equal without discrimination.",
        "source": "T13n0404_002:0621a12_9"
    },
    {
        "source_sentence": "「復次，佛隨念，念佛所有色自性清淨，由見色自性清淨故，無念智隨至，",
        "translation": "“Furthermore, as soon as the Buddha is mindful of these thoughts, all the forms inherent in mindfulness of the Buddha are purified by their own nature. Because they see that the essential nature of form is purified, there is no subsequent thought or cognition.",
        "source": "T13n0404_002:0621a14_10"
    },
    {
        "source_sentence": "乃至受、想、行、識，見識自性清淨故，無念智隨至。",
        "translation": "It's because the self-nature of feeling, perception, volition, and consciousness are purified by seeing that consciousness is inherently pure, and there's no mindfulness or cognition that follows.",
        "source": "T13n0404_002:0621a15_11"
    },
    {
        "source_sentence": "如是十二處、十八界亦復如是。",
        "translation": "So it is with these twelve places and the eighteen elements.",
        "source": "T13n0404_002:0621a16_12"
    },
    {
        "source_sentence": "由一切法自性智故，最殊勝慧一切作意，遠離一切見纏。",
        "translation": "Because of the knowledge of the essential nature of all dharmas, his supreme wisdom is free of all contemplations and he's free of all bonds of views.",
        "source": "T13n0404_002:0621a17_13"
    },
    {
        "source_sentence": "遠離如是，知色無垢濁，念無垢濁，是謂佛所印可佛隨念。",
        "translation": "Being far removed from such things, knowing form is without stain and mindfulness is without stain, this is called the Buddha's seal of approval that can be followed by the Buddha.",
        "source": "T13n0404_002:0621a18_14"
    },
    {
        "source_sentence": "「復次，佛隨念，謂念於佛行、住、坐、臥一切威儀，不生執著；",
        "translation": "“Furthermore, the Buddha follows mindfulness: being mindful of all manner of deportment of buddhas’ walking, standing, sitting, and lying down, without forming attachment.",
        "source": "T13n0404_002:0621a20_15"
    },
    {
        "source_sentence": "於佛說法、於佛寂嘿不生執著，亦不執著念與非念。",
        "translation": "They don't cling to the Buddha who teaches the Dharma and the Buddha's quiescence, and they don't cling to mindfulness or non-mindfulness.",
        "source": "T13n0404_002:0621a21_16"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0404_002:0621a22_17"
    },
    {
        "source_sentence": "佛無念、無作意、非色、非相、非法、非非法，由一切相緣慮不現行故。",
        "translation": "The Buddha has no thought, no intention, no form, no marks, no characteristics, no non-dharma, and no non-dharma because all marks are conditioned by thoughts that don't arise.",
        "source": "T13n0404_002:0621a22_18"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621a24_19"
    },
    {
        "source_sentence": "是名佛所印可佛隨念。",
        "translation": "This is called the Buddha's seal of approval that allows the Buddha to follow it.",
        "source": "T13n0404_002:0621a24_20"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621a25_0"
    },
    {
        "source_sentence": "云何菩薩佛所印可法隨念？",
        "translation": "What's a bodhisattva who follows the mindfulness of the Dharma that's sealed by the Buddha?",
        "source": "T13n0404_002:0621a25_1"
    },
    {
        "source_sentence": "法名離欲，於法無染故，亦無法隨念。",
        "translation": "The dharmas are called being free of desire because they aren't defiled by the dharmas, and there's no ability to follow them.",
        "source": "T13n0404_002:0621a25_2"
    },
    {
        "source_sentence": "法名無阿賴耶，於法無隱沒故，亦無法隨念。",
        "translation": "The Dharma name is without store consciousness, and because there's no concealment in the Dharma, there's no mindfulness of it.",
        "source": "T13n0404_002:0621a26_3"
    },
    {
        "source_sentence": "法名寂靜，以無心、意、識染著故，亦無法隨念。",
        "translation": "The dharmas are called quiescence because there's no mind, mind, or consciousness that's defiled and attached, and there's no ability to follow them.",
        "source": "T13n0404_002:0621a27_4"
    },
    {
        "source_sentence": "法名無相，於法無隨相識故，亦無法隨念。",
        "translation": "Because dharmas are called formless, there's no consciousness that follows characteristics in dharmas, and there's no mindfulness that follows characteristics.",
        "source": "T13n0404_002:0621a28_5"
    },
    {
        "source_sentence": "法名無為，於法無施設住故，亦無法隨念。",
        "translation": "Because dharmas are called unconditioned, they don't have a fixed abode in terms of dharmas, and there's no mindfulness that follows them.",
        "source": "T13n0404_002:0621a29_6"
    },
    {
        "source_sentence": "「復次，法隨念，若念無間斷不起法想，即入正位證無生忍，觀一切法本來不生無法可證，",
        "translation": "“Furthermore, when one is mindful of the doctrine, he immediately enters into the state of realization of the tolerance of nonarising. He observes that all things are inherently unarisen and cannot be apprehended.",
        "source": "T13n0404_002:0621b01_7"
    },
    {
        "source_sentence": "即是一切學、無學、緣覺、菩薩，正等菩提所證之處。",
        "translation": "It's the place where all trainees, post-learners, pratyekabuddhas, and bodhisattvas attain perfect enlightenment.",
        "source": "T13n0404_002:0621b03_8"
    },
    {
        "source_sentence": "如是一切聖所證解脫法，亦無自性。",
        "translation": "Thus, all the dharmas of liberation realized by sages also have no self-nature.",
        "source": "T13n0404_002:0621b04_9"
    },
    {
        "source_sentence": "是為菩薩佛所印可法隨念。",
        "translation": "This is the method of following the mind that's sealed by the bodhisattva Buddha.",
        "source": "T13n0404_002:0621b05_10"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621b07_0"
    },
    {
        "source_sentence": "云何菩薩佛所印可僧伽隨念？",
        "translation": "How can the bodhisattva Buddha's seal be followed by the saṃgha?",
        "source": "T13n0404_002:0621b07_1"
    },
    {
        "source_sentence": "僧名無為，彼不可以造作而作，而無現行身、語、意業，但是施設而有所行。",
        "translation": "The saṃgha is called nonproductivity because they can't create and do it, but they don't perform physical, verbal, or mental actions that are manifested, but simply define and have something to do.",
        "source": "T13n0404_002:0621b07_2"
    },
    {
        "source_sentence": "是無為僧，離施設住、超諸言論。",
        "translation": "This is an unconstructed saṃgha that's free of defined abode and transcends all discourse.",
        "source": "T13n0404_002:0621b09_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621b10_4"
    },
    {
        "source_sentence": "是為佛所印可僧伽隨念。",
        "translation": "This is the Buddha's seal that allows the saṃgha to follow it.",
        "source": "T13n0404_002:0621b10_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621b11_0"
    },
    {
        "source_sentence": "云何菩薩佛所印可捨隨念？",
        "translation": "How can the bodhisattva Buddha's seal be abandoned and followed by mindfulness?",
        "source": "T13n0404_002:0621b11_1"
    },
    {
        "source_sentence": "所謂捨於一切所依資具，及捨於法亦無所捨，此名最勝捨。",
        "translation": "The so-called abandonment of all the necessities that are relied upon and the abandonment of all dharmas, which also have nothing to abandon, is called the most excellent abandonment.",
        "source": "T13n0404_002:0621b11_2"
    },
    {
        "source_sentence": "於一切法無取、無捨亦無所求，無有緣慮、非無緣慮，彼無心行亦無施設，",
        "translation": "“In all things there is neither grasping nor relinquishing, and nothing to be desired. There are no perceptual objects that have perceptual objects as objects or perceptual objects that do not have perceptual objects. They lack mental functioning and also lack conceptualization.",
        "source": "T13n0404_002:0621b13_3"
    },
    {
        "source_sentence": "亦不住於識，不生於心以無住心故；",
        "translation": "They also do not abide in consciousness, because they do not give rise to thought.",
        "source": "T13n0404_002:0621b14_4"
    },
    {
        "source_sentence": "名為佛所印可捨隨念。",
        "translation": "It's called the Buddha's seal that can be relinquished and followed by mindfulness.",
        "source": "T13n0404_002:0621b15_5"
    },
    {
        "source_sentence": "復次，菩薩捨隨念者，以所修行迴向平等薩婆若智，不見菩提為所隨念。",
        "translation": "Furthermore, when a bodhisattva abandons mindfulness of following, he dedicates his cultivation to the equality of sarvajña wisdom and doesn't see enlightenment as his mindfulness.",
        "source": "T13n0404_002:0621b16_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0404_002:0621b17_7"
    },
    {
        "source_sentence": "以薩婆若與彼隨念性無二故。",
        "translation": "It's because the nature of sarvajña and their mindfulness are not two.",
        "source": "T13n0404_002:0621b18_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621b18_1"
    },
    {
        "source_sentence": "如是法智相應，是名菩薩佛所印可捨隨念。",
        "translation": "Thus, when associated with the knowledge of the Dharma, this is called a bodhisattva's Buddha-seal that can be abandoned and followed by mindfulness.",
        "source": "T13n0404_002:0621b18_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621b19_3"
    },
    {
        "source_sentence": "云何菩薩佛所印可戒隨念？",
        "translation": "How can a bodhisattva be mindful of the precepts that are sealed by a buddha?",
        "source": "T13n0404_002:0621b20_4"
    },
    {
        "source_sentence": "戒名無為，無漏、無礙，永息功用成就一切禁戒，無識、無相亦不住心作三摩地，",
        "translation": "The precepts are called unconditioned, uncontaminated, unobstructed, permanently ceasing effort to accomplish all the forbidden precepts, consciousnessless, signless, and not abiding in mind or concentration.",
        "source": "T13n0404_002:0621b20_5"
    },
    {
        "source_sentence": "最勝所依亦是發生淨慧根本。",
        "translation": "The most excellent basis is also the root of the pure wisdom that arises.",
        "source": "T13n0404_002:0621b22_6"
    },
    {
        "source_sentence": "離於戲論及解脫相，亦無二種分別之相。",
        "translation": "Being free of the characteristics of conceptual elaborations and liberation, they also have no two kinds of discriminating characteristics.",
        "source": "T13n0404_002:0621b23_7"
    },
    {
        "source_sentence": "智者所讚，無有現色，能息煩惱亦無施設，安樂隨行，亦無對治一切分別。",
        "translation": "They are praised by wise people because they have no manifest forms, can extinguish afflictions, don't define them, follow the practice of well-being, and have no antidote to all discriminations.",
        "source": "T13n0404_002:0621b24_8"
    },
    {
        "source_sentence": "菩薩常於如是類戒無有垢濁，是名菩薩佛所印可戒隨念。",
        "translation": "A bodhisattva who always observes these kinds of precepts without stain and turbidity is called a bodhisattva Buddha who follows the mindfulness that can be sealed by morality.",
        "source": "T13n0404_002:0621b25_9"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621b28_0"
    },
    {
        "source_sentence": "云何菩薩佛所印可天隨念？",
        "translation": "How can the bodhisattvas and buddhas be sealed by the gods to follow their thoughts?",
        "source": "T13n0404_002:0621b28_1"
    },
    {
        "source_sentence": "應隨念二種天：一者、五淨居天，有聖者故；",
        "translation": "The first is the five celestial abodes of purity, because they are sacred.",
        "source": "T13n0404_002:0621b28_2"
    },
    {
        "source_sentence": "二者、覩史多天，以一生補處菩薩在彼天故。",
        "translation": "The second is the Tuṣita Heaven, because the bodhisattva who will be reborn in that heaven with a new birth.",
        "source": "T13n0404_002:0621b29_3"
    },
    {
        "source_sentence": "「復次，此一生補處菩薩住彼天宮，有十種頂法。",
        "translation": "“Furthermore, there are ten kinds of topknot dharmas for this bodhisattva who lives in the heavenly palace in the supplementary abode of one lifetime.",
        "source": "T13n0404_002:0621c01_4"
    },
    {
        "source_sentence": "何者為十？",
        "translation": "What are these ten?",
        "source": "T13n0404_002:0621c02_5"
    },
    {
        "source_sentence": "所謂：一切波羅蜜中，般若波羅蜜多而為其頂；",
        "translation": "Among all the transcendent ways, the transcendent practice of wisdom is their summit.",
        "source": "T13n0404_002:0621c03_6"
    },
    {
        "source_sentence": "一切神通之中，不退神通而為其頂；",
        "translation": "Among all his supernormal powers, he is the foremost of those who do not regress from their spiritual powers.",
        "source": "T13n0404_002:0621c04_7"
    },
    {
        "source_sentence": "一切地中，唯灌頂地而為其頂；",
        "translation": "Among all the stages, only the stage of coronation is their summit.",
        "source": "T13n0404_002:0621c05_0"
    },
    {
        "source_sentence": "一切菩提分法之中，不退正見勝三摩地而為其頂；",
        "translation": "Among all the factors of enlightenment, nonbacksliding right view is their summit, with supreme concentration of insight.",
        "source": "T13n0404_002:0621c05_1"
    },
    {
        "source_sentence": "一切無礙解中，義辯無礙而為其頂；",
        "translation": "At the top of all unhindered understandings are their unhindered explanations of meaning.",
        "source": "T13n0404_002:0621c06_2"
    },
    {
        "source_sentence": "一切智中，無著、無礙智而為其頂；",
        "translation": "Among all knowledges, unattached and unhindered knowledge is their summit.",
        "source": "T13n0404_002:0621c07_3"
    },
    {
        "source_sentence": "一切根中，知上、中、下根無礙智而為其頂；",
        "translation": "Among all faculties, unhindered knowledge knowing the higher, middle, and lower faculties is their summit.",
        "source": "T13n0404_002:0621c08_4"
    },
    {
        "source_sentence": "一切力無畏中，照耀隨入智而為其頂；",
        "translation": "Among all the powers and fearlessnesses of enlightenment, Radiance follows knowledge and becomes its summit.",
        "source": "T13n0404_002:0621c09_5"
    },
    {
        "source_sentence": "一切眼中，佛眼觀察一切佛法，了如掌內而為其頂；",
        "translation": "In all eyes the Buddha’s eye observes all buddha-teachings, comprehending them as if they were within his palm and forming his crown.",
        "source": "T13n0404_002:0621c10_6"
    },
    {
        "source_sentence": "坐菩提場中當成正覺，一剎那心相應正慧而為其頂。",
        "translation": "Sitting on the site of enlightenment, he'll become perfectly enlightened, and right wisdom associated with his mind for one moment will be his peak.",
        "source": "T13n0404_002:0621c11_7"
    },
    {
        "source_sentence": "是為十種頂法之相，應隨念之。",
        "translation": "These are the ten kinds of characteristics of the top dharmas that should be remembered accordingly.",
        "source": "T13n0404_002:0621c12_8"
    },
    {
        "source_sentence": "若菩薩得是念已，見則不亂隨眠纏，不亂作意戲論，不亂於如是類。",
        "translation": "If a bodhisattva has attained this thought, then he's not disturbed by the afflictions of latent tendencies in views, isn't disturbed by contemplation and playfulness, and isn't disturbed by such things.",
        "source": "T13n0404_002:0621c13_9"
    },
    {
        "source_sentence": "念無垢濁，應當如是隨念彼天。",
        "translation": "When they're mindful of the undefiled, they should thus be mindful of that god.",
        "source": "T13n0404_002:0621c15_10"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621c15_11"
    },
    {
        "source_sentence": "是名菩薩佛所印可天隨念。",
        "translation": "This is called the bodhisattva Buddha's seal of approval that can be followed by gods and mindfulness.",
        "source": "T13n0404_002:0621c16_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621c17_0"
    },
    {
        "source_sentence": "云何菩薩所行諸行等於涅槃？",
        "translation": "How are the practices carried out by bodhisattvas equal to nirvāṇa?",
        "source": "T13n0404_002:0621c17_1"
    },
    {
        "source_sentence": "涅槃名寂靜，悉除一切煩惱，滅一切受，離一切所緣，出蘊、處、界，",
        "translation": "The name of nirvana is quiescence, which completely removes all afflictions, extinguishes all sensations, parts with all perceptual objects, and emerges from the aggregates, fields, and realms.",
        "source": "T13n0404_002:0621c17_2"
    },
    {
        "source_sentence": "即彼正士獲得涅槃平等。",
        "translation": "That's when that righteous man attains the equality of nirvāṇa.",
        "source": "T13n0404_002:0621c19_3"
    },
    {
        "source_sentence": "以本願力遊戲大悲，方便智慧得如來加持故，善修智慧意樂清淨，住於如幻妙三摩地，",
        "translation": "Because of the power of their original vow to play with great compassion, they attain the empowerment of enlightenment by means of knowledge and skill in means. They cultivate pure mental command for knowledge and abide in concentrations like illusions, subtle absorptions.",
        "source": "T13n0404_002:0621c19_4"
    },
    {
        "source_sentence": "悉知有情煩惱生死皆如幻化，示現受生，由此能斷諸生死縛，無所染污，",
        "translation": "They know all sentient beings’ afflictions, births, and deaths are like illusions; they manifest birth. Through this they are able to cut off the bondage of birth and death without defilement.",
        "source": "T13n0404_002:0621c21_5"
    },
    {
        "source_sentence": "名曰涅槃。",
        "translation": "It's called nirvāṇa.",
        "source": "T13n0404_002:0621c23_6"
    },
    {
        "source_sentence": "既得自在，不生而生，無所不生亦無所生，常在涅槃不斷生死，而成熟有情無有休息。",
        "translation": "Having attained mastery, he doesn't give birth and gives birth, has nothing that doesn't give birth and nothing that doesn't give birth, always abides in nirvāṇa without stopping birth and death, and develops sentient beings without resting.",
        "source": "T13n0404_002:0621c23_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621c25_8"
    },
    {
        "source_sentence": "此名菩薩大悲方便雙智慧門。",
        "translation": "This is called the gate of the bodhisattva's great compassion, skillful means, and wisdom.",
        "source": "T13n0404_002:0621c25_9"
    },
    {
        "source_sentence": "若菩薩住此門者，獲得涅槃平等行菩薩行。",
        "translation": "If a bodhisattva abides in this approach, he'll attain nirvāṇa and equally practice the bodhisattva's practice.",
        "source": "T13n0404_002:0621c26_10"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621c27_11"
    },
    {
        "source_sentence": "云何菩薩，善知一切有情行相？",
        "translation": "How does a bodhisattva know the conduct of all sentient beings well?",
        "source": "T13n0404_002:0621c27_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0621c28_13"
    },
    {
        "source_sentence": "菩薩有八萬四千行，是於根本鄔馱南句。",
        "translation": "The bodhisattva has 84,000 practices, which are the fundamental words of the udāna.",
        "source": "T13n0404_002:0621c28_14"
    },
    {
        "source_sentence": "有情行相，無量差別、不可思議、不可言說，唯佛能知，非諸聲聞、緣覺所了，",
        "translation": "The characteristics of sentient beings’ actions are immeasurable, different, inconceivable, and inexpressible. Only Buddha knows them; they cannot be apprehended by sravakas or pratyekabuddhas.",
        "source": "T13n0404_002:0621c29_15"
    },
    {
        "source_sentence": "亦非菩薩之所能了。",
        "translation": "Nor can a bodhisattva understand it.",
        "source": "T13n0404_002:0622a02_16"
    },
    {
        "source_sentence": "彼菩薩蒙佛加持及自智力，隨知一切有情行相。",
        "translation": "That bodhisattva receives the Buddha's blessing and his own power of knowledge, knowing the actions of all sentient beings as they go along.",
        "source": "T13n0404_002:0622a02_17"
    },
    {
        "source_sentence": "所謂：如是自性相，如是行相，如是因相，如是緣相，如是作相，如是和合相，",
        "translation": "Such are the characteristic marks of self-nature, such are the characteristic marks of conditioned states, such are the characteristic marks of causes, such are the characteristic marks of conditions, such are the characteristic marks of construction, such are the characteristic marks of conjunction.",
        "source": "T13n0404_002:0622a03_18"
    },
    {
        "source_sentence": "或種種相離相、欲相，瞋相、癡相、等分相，地獄相、傍生相、琰魔界相、天相、人相，",
        "translation": "They may have various characteristics that are free from characteristics, characteristics of desire, characteristics of anger, characteristics of delusion, and so forth, characteristics of hell, characteristics of animals, characteristics of the realm of Māra, characteristics of gods, and characteristics of humans.",
        "source": "T13n0404_002:0622a05_19"
    },
    {
        "source_sentence": "或聲聞尼夜摩相、或緣覺尼夜摩相、或佛尼夜摩相，或遠因相、中因相、近因相，",
        "translation": "It may be the mark of śrāvaka nuns, it may be the mark of pratyekabuddha nuns, it may be the mark of buddha- Nuns, or it may be the mark of Buddhist nuns, or it may be the mark of distant causes, middle causes, or proximate causes.",
        "source": "T13n0404_002:0622a07_20"
    },
    {
        "source_sentence": "如是有情一切行相如實知之，除一切智不被摧伏。",
        "translation": "Thus, all the characteristics of sentient beings' actions are truly known, and except for omniscience, they aren't destroyed.",
        "source": "T13n0404_002:0622a08_21"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0404_002:0622a10_22"
    },
    {
        "source_sentence": "是為菩薩善知一切有情行相。",
        "translation": "This is a bodhisattva who well knows the conduct of all sentient beings.",
        "source": "T13n0404_002:0622a10_23"
    },
    {
        "source_sentence": "大集虛空藏菩薩所問經卷第二",
        "translation": "*Mahāmegha-sūtra, Questions Asked by the Bodhisattva Ākāśagarbha",
        "source": "T13n0404_002:0622a11_0"
    },
    {
        "source_sentence": "丙午歲高麗國大藏都監奉　勅雕造",
        "translation": "In the third year of the Liang dynasty, during the reign of Emperor Ming (rstivāda), the great treasury superintendent of the empire was ordered to carve the image.",
        "source": "T13n0404_002:0622a12_0"
    }
]