[
    {
        "source_sentence": "大乘大集地藏十輪經卷第十",
        "translation": "Dasheng daji zhizang shilun jing, vol. 10",
        "source": "T13n0411_010:0772a24_0"
    },
    {
        "source_sentence": "三藏法師玄奘奉　詔譯",
        "translation": "Sanzang fashi Xuanzang Feng imperial edict translating",
        "source": "T13n0411_010:0772a26_0"
    },
    {
        "source_sentence": "福田相品第七之二",
        "translation": "seventh and second parts of the chapter on the characteristics of the field of merit",
        "source": "T13n0411_010:0772a27_0"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T13n0411_010:0772a28_0"
    },
    {
        "source_sentence": "菩薩摩訶薩，復有般若大甲冑輪。",
        "translation": "Again, the bodhisattva Mahāsattva has the great armor wheel of prajñāpāramitā.",
        "source": "T13n0411_010:0772a28_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩成就此輪，從初發心，一切五欲皆能除斷，超勝一切聲聞、獨覺，",
        "translation": "“If great enlightening beings accomplish this wheel, they can remove all the five desires from the first determination for enlightenment and become free of them, surpassing all listeners and solitary realizers.",
        "source": "T13n0411_010:0772a29_2"
    },
    {
        "source_sentence": "普為一切聲聞、獨覺、作大福田。",
        "translation": "It's a great field of merit for all śrāvakas, pratyekbuddhas, and buddhas.",
        "source": "T13n0411_010:0772b01_3"
    },
    {
        "source_sentence": "一切聲聞、獨覺乘等，皆應供養承事守護。",
        "translation": "All śrāvakas, pratyekbuddhas, and so forth should be offered support and guarded.",
        "source": "T13n0411_010:0772b02_4"
    },
    {
        "source_sentence": "云何般若大甲冑輪？",
        "translation": "What is the great armor wheel of prajñā?",
        "source": "T13n0411_010:0772b03_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_010:0772b04_0"
    },
    {
        "source_sentence": "菩薩般若有二種相：一者、世間；",
        "translation": "“Enlightening beings’ liberation has two kinds:",
        "source": "T13n0411_010:0772b04_1"
    },
    {
        "source_sentence": "二者、出世間。",
        "translation": "The second is that it transcends the world.",
        "source": "T13n0411_010:0772b04_2"
    },
    {
        "source_sentence": "云何菩薩世間般若？",
        "translation": "What is the bodhisattva's worldly prajñā?",
        "source": "T13n0411_010:0772b05_3"
    },
    {
        "source_sentence": "謂：諸菩薩唯依讀誦、書寫、聽聞，為他演說三乘正法；",
        "translation": "They are as follows: All enlightening beings rely on recitation, writing, and listening to expound the true teaching of the three vehicles for others.",
        "source": "T13n0411_010:0772b05_4"
    },
    {
        "source_sentence": "欲求除滅一切眾生無明黑暗；",
        "translation": "They want to extinguish the darkness of ignorance of all sentient beings.",
        "source": "T13n0411_010:0772b06_5"
    },
    {
        "source_sentence": "欲求發起一切眾生大慧光明。",
        "translation": "They want to give rise to the great wisdom and light of all sentient beings.",
        "source": "T13n0411_010:0772b07_6"
    },
    {
        "source_sentence": "謂：於如來所說種種與聲聞乘相應正法，精勤讀誦、聽聞、書寫、為他演說，",
        "translation": "They are: exerting themselves to recite, hear, copy, and teach the various doctrines taught by the Buddha associated with the vehicle of the disciples;",
        "source": "T13n0411_010:0772b08_7"
    },
    {
        "source_sentence": "勸正修行。",
        "translation": "He encourages correct cultivation.",
        "source": "T13n0411_010:0772b10_0"
    },
    {
        "source_sentence": "或於如來所說種種與獨覺乘相應正法，精勤讀誦、聽聞、書寫、為他演說，",
        "translation": "Or they might diligently recite, hear, write, and teach the various teachings of the Buddha associated with the vehicle of individual illumination for others.",
        "source": "T13n0411_010:0772b10_1"
    },
    {
        "source_sentence": "勸正修行。",
        "translation": "He encourages correct cultivation.",
        "source": "T13n0411_010:0772b11_2"
    },
    {
        "source_sentence": "或於如來所說種種與無上乘相應正法，精勤讀誦、聽聞、書寫、為他演說，",
        "translation": "Or they might diligently recite, hear, write, and teach the various teachings of the Buddha associated with the highest vehicle to others.",
        "source": "T13n0411_010:0772b12_3"
    },
    {
        "source_sentence": "勸正修行。",
        "translation": "He encourages correct cultivation.",
        "source": "T13n0411_010:0772b13_4"
    },
    {
        "source_sentence": "不求賢聖無漏道支、不求聖道、不求聖道所攝解脫、不行寂靜真實般若，",
        "translation": "They don't seek the uncontaminated factors of the good and noble paths, the noble paths, the liberations included in the noble paths, and the true and real prajñāpāramitā that doesn't practice quiesc",
        "source": "T13n0411_010:0772b14_5"
    },
    {
        "source_sentence": "常行有見、有相般若。",
        "translation": "He always conducts himself with views and formless prajñāpāramitā.",
        "source": "T13n0411_010:0772b15_6"
    },
    {
        "source_sentence": "如是般若有取、有著，是名菩薩世間般若。",
        "translation": "If such a prajñā has grasping and attachment, this is called the bodhisattva's worldly prajñā.",
        "source": "T13n0411_010:0772b16_7"
    },
    {
        "source_sentence": "如是般若，共諸聲聞、獨覺乘等，此不名為大甲冑輪，亦不由此名為菩薩摩訶薩也，",
        "translation": "Such prajñā, which is common to śrāvakas and pratyekbuddhas like this, isn't called the great armor wheel, and it doesn't therefore be called the bodhisattva-mahāsattva.",
        "source": "T13n0411_010:0772b17_8"
    },
    {
        "source_sentence": "及名一切聲聞、獨覺、真實福田。",
        "translation": "It's also called the true field of merit for all śrāvakas, solitary realizers, and true practitioners.",
        "source": "T13n0411_010:0772b19_9"
    },
    {
        "source_sentence": "云何菩薩出世般若？",
        "translation": "What is a bodhisattva’s supramundane prajñā?",
        "source": "T13n0411_010:0772b20_0"
    },
    {
        "source_sentence": "謂：諸菩薩精勤修習菩提道時，隨力讀誦、聽聞、書寫、為他演說，三乘正法。",
        "translation": "It means that when bodhisattvas diligently cultivate the path to enlightenment, they read, hear, write, and explain the right teachings of the three vehicles for others as they can.",
        "source": "T13n0411_010:0772b20_1"
    },
    {
        "source_sentence": "而於其中依無所得方便而住，無所行動、無所思惟、無有根本。",
        "translation": "They abide there on the basis of ungraspable skillful means, with no movement, no thought, and no root.",
        "source": "T13n0411_010:0772b22_2"
    },
    {
        "source_sentence": "以如虛空心、普寂滅心、無增減慧、無取著心、無生滅心、無退轉心、法平等心、真如心、實際心、法界心、無我心、無分別心、寂滅安忍離分別心，",
        "translation": "Because the mind of space, the mind of universal quiescence, the mind without increase or decrease, the mind without attachment, the mind without arising or ceasing, the mind without retrogression, the mind of equality of things, the mind of truth, the mind",
        "source": "T13n0411_010:0772b23_3"
    },
    {
        "source_sentence": "善巧安住無成壞地，善巧安住無住、無著、勝妙慧地。",
        "translation": "They skillfully abide in the stage of no formation and no disintegration, and skillfully abide in the stage of no abiding, no attachment, and superior marvelous wisdom.",
        "source": "T13n0411_010:0772b26_4"
    },
    {
        "source_sentence": "如是般若無取、無著，是名菩薩出世般若大甲冑輪。",
        "translation": "Such prajñā without grasping or attachment is called the bodhisattva's great armor-wheel of supramundane prajñāpāramitā.",
        "source": "T13n0411_010:0772b28_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_010:0772b29_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩成此般若大甲冑輪，從初發心，一切五欲皆能除斷，得名菩薩摩訶薩也。",
        "translation": "If a bodhisattva-mahāsattva accomplishes this great armor wheel of prajñā, and from the first arousal of his mind, he can remove all five desires and be called a bodhisattva-mahāsattva.",
        "source": "T13n0411_010:0772b29_2"
    },
    {
        "source_sentence": "超勝一切聲聞、獨覺，普為一切聲聞、獨覺、作大福田。",
        "translation": "He surpasses all śrāvakas and pratyekbuddhas and creates a great field of merit for all śrāvakas and pratyekbuddhas.",
        "source": "T13n0411_010:0772c02_3"
    },
    {
        "source_sentence": "一切聲聞、獨覺乘等，皆應供養承事守護。",
        "translation": "All śrāvakas, pratyekbuddhas, and so forth should be offered support and guarded.",
        "source": "T13n0411_010:0772c03_4"
    },
    {
        "source_sentence": "「復次，善男子！",
        "translation": "Furthermore, good man!",
        "source": "T13n0411_010:0772c05_0"
    },
    {
        "source_sentence": "菩薩摩訶薩，復有善巧方便大甲冑輪。",
        "translation": "Again, the bodhisattva Mahāsattva has a great armor wheel of skillful means.",
        "source": "T13n0411_010:0772c05_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩成就此輪，從初發心，一切五欲皆能除斷，超勝一切聲聞、獨覺，",
        "translation": "“If great enlightening beings accomplish this wheel, they can remove all the five desires from the first determination for enlightenment and become free of them, surpassing all listeners and solitary realizers.",
        "source": "T13n0411_010:0772c06_2"
    },
    {
        "source_sentence": "普為一切聲聞、獨覺，作大福田。",
        "translation": "It's a great field of merit for all śrāvakas and pratyekbuddhas.",
        "source": "T13n0411_010:0772c08_0"
    },
    {
        "source_sentence": "一切聲聞、獨覺乘等，皆應供養承事守護。",
        "translation": "All śrāvakas, pratyekbuddhas, and so forth should be offered support and guarded.",
        "source": "T13n0411_010:0772c08_1"
    },
    {
        "source_sentence": "云何名為善巧方便大甲冑輪？",
        "translation": "What's called the great armor wheel of skillful means?",
        "source": "T13n0411_010:0772c09_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_010:0772c10_3"
    },
    {
        "source_sentence": "菩薩善巧方便有二種相：一者、世間；",
        "translation": "“The skillful means of enlightening beings has two kinds:",
        "source": "T13n0411_010:0772c10_4"
    },
    {
        "source_sentence": "二者、出世間。",
        "translation": "The second is that it transcends the world.",
        "source": "T13n0411_010:0772c11_5"
    },
    {
        "source_sentence": "云何名為菩薩世間善巧方便？",
        "translation": "What's called a bodhisattva's worldly skillful means?",
        "source": "T13n0411_010:0772c11_6"
    },
    {
        "source_sentence": "謂：諸菩薩或為自利、或為他利、或為俱利，常懷彼此，示現種種工巧伎術，",
        "translation": "It means that enlightening beings, whether for their own benefit, for the benefit of others, or for the benefit of both, always embrace each other and show various arts and skills.",
        "source": "T13n0411_010:0772c12_7"
    },
    {
        "source_sentence": "為自及他得成熟故，承事供養諸佛世尊、或諸菩薩、或諸獨覺、或諸聲聞、或母或父、或諸病者、或諸羸劣無依怙者，",
        "translation": "For the sake of self and others attain maturity, they serve and honor the buddhas, world-honored ones, or bodhisattvas, or solitary realizers, or śrāvakas, or mothers, fathers, or sick people, or",
        "source": "T13n0411_010:0772c14_8"
    },
    {
        "source_sentence": "若見厄難臨被害者，種種勤苦方便救濟，以四攝事成熟有情。",
        "translation": "If they see a victim who's in distress and difficulty approaching, they rescue him with various kinds of exertion and skillful means to ripen sentient beings by using four ways to gather support.",
        "source": "T13n0411_010:0772c16_9"
    },
    {
        "source_sentence": "是諸菩薩自住大乘，於諸聲聞及獨覺乘非大乘器、若諸聲聞及獨覺乘根未熟者，",
        "translation": "These bodhisattvas themselves abide in the great vehicle, and they aren't vessels of the great vehicle for the śrāvakas and solitary realizers who don't ride the vehicle, or if the śrāvakas and solitary realizers",
        "source": "T13n0411_010:0772c18_10"
    },
    {
        "source_sentence": "為說微妙甚深法教令其修學；",
        "translation": "I elucidate the subtle and profound teachings of the Teaching so that they may be cultivated.",
        "source": "T13n0411_010:0772c20_11"
    },
    {
        "source_sentence": "或勸勤修諸聖靜慮；",
        "translation": "Or they may encourage the diligent cultivation of holy meditations.",
        "source": "T13n0411_010:0772c21_0"
    },
    {
        "source_sentence": "或為開示最勝義諦，勸令修行，超四顛倒，覺悟四種無墮法性；",
        "translation": "Or they may reveal the ultimate truth, exhorting and encouraging practice, transcending the four errors, awakening to the four kinds of unfalling dharmas.",
        "source": "T13n0411_010:0772c21_1"
    },
    {
        "source_sentence": "或令趣入四無礙解；",
        "translation": "Or they may cause one to enter into the four unhindered understandings.",
        "source": "T13n0411_010:0772c22_2"
    },
    {
        "source_sentence": "或復乃至勸令安住四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支、有餘、無餘道及道果；",
        "translation": "It may also lead to the establishment of the four abodes of mindfulness, the four forms of right abandonment, the four spiritual powers, the five faculties, the five powers, the seven factors of virtual enlightenment, the eightfold noble",
        "source": "T13n0411_010:0772c23_3"
    },
    {
        "source_sentence": "趣入巧智，令其成熟。",
        "translation": "He enters into the knowledge of skillful means to bring them to maturity.",
        "source": "T13n0411_010:0772c25_4"
    },
    {
        "source_sentence": "若諸有情貪求名稱、利養、富貴，諸根躁擾，善根未熟，勸令讀誦諸阿笈摩及毘奈耶、阿毘達磨；",
        "translation": "If sentient beings covet fame, profit and wealth, their faculties are agitated, and their roots of goodness have not matured yet, they are encouraged to recite the scriptures, vinaya, and abhidharma.",
        "source": "T13n0411_010:0772c26_5"
    },
    {
        "source_sentence": "或勸讀誦除佛所說順解脫論，令其成熟。",
        "translation": "Or they may encourage recitation, remove what the Buddha teaches, and follow the Treatise on Liberation to bring them to maturity.",
        "source": "T13n0411_010:0772c28_6"
    },
    {
        "source_sentence": "若諸有情不樂布施，勸令惠捨種種珍財，令其成熟。",
        "translation": "If sentient beings don't delight in generosity, they are encouraged to give away various treasures and make them mature.",
        "source": "T13n0411_010:0772c29_7"
    },
    {
        "source_sentence": "若諸有情暴惡不仁，勸令修學四種梵住。",
        "translation": "If sentient beings are violent and unjust, they're encouraged to cultivate the four kinds of religious abodes.",
        "source": "T13n0411_010:0773a01_8"
    },
    {
        "source_sentence": "若諸有情心多忿恚，勸令修忍。",
        "translation": "If the minds of sentient beings are full of anger, they're encouraged to cultivate forbearance.",
        "source": "T13n0411_010:0773a02_9"
    },
    {
        "source_sentence": "若諸有情心多懈怠，勸修精進。",
        "translation": "If sentient beings are often lazy in mind, they're encouraged to cultivate effort.",
        "source": "T13n0411_010:0773a03_10"
    },
    {
        "source_sentence": "若諸有情心多散亂，勸修靜慮。",
        "translation": "If the minds of sentient beings are often distracted, they're encouraged to cultivate meditation.",
        "source": "T13n0411_010:0773a03_11"
    },
    {
        "source_sentence": "若諸有情具足惡慧，為說正法，謂以記說教誡方便，令其成熟。",
        "translation": "If sentient beings are endowed with bad wisdom, they teach the right teaching for them, which is to record and explain the method of admonishment so that they'll mature.",
        "source": "T13n0411_010:0773a04_12"
    },
    {
        "source_sentence": "若諸有情不敬三寶具無依行，勸受三歸令敬三寶、或勸受學近事律儀、或勸受學近住律儀，",
        "translation": "If sentient beings don't revere the Three Treasures and have no basis for practice, they may be encouraged to accept the three refuges and cause them to revere the Three Treasures, or they may be encouraged to train in the near observance of",
        "source": "T13n0411_010:0773a06_13"
    },
    {
        "source_sentence": "令其成熟。",
        "translation": "It causes them to mature.",
        "source": "T13n0411_010:0773a08_14"
    },
    {
        "source_sentence": "或勸修習種種工巧伎術業處，令其成熟。",
        "translation": "Or they may encourage the cultivation of various arts, crafts, andoccupations to cause them to mature.",
        "source": "T13n0411_010:0773a08_15"
    },
    {
        "source_sentence": "如是等菩薩摩訶薩，種種世間巧方便智，過殑伽沙菩薩摩訶薩，以是一切書論、工巧、伎術、業處、加行、精進、巧方便智，",
        "translation": "“Such great enlightening beings, surpassing the buddhas of the Ganges by their knowledge of skill in means and knowledge of all kinds of worldly arts and sciences, are like sand grains. Because they have this knowledge of all writings,",
        "source": "T13n0411_010:0773a09_16"
    },
    {
        "source_sentence": "摧伏一切外道異學。",
        "translation": "They will subdue all non-Buddhist and heretical students.",
        "source": "T13n0411_010:0773a12_17"
    },
    {
        "source_sentence": "如是名為菩薩世間善巧方便。",
        "translation": "This is called a bodhisattva’s worldly skillful means.",
        "source": "T13n0411_010:0773a12_18"
    },
    {
        "source_sentence": "此巧方便，共諸聲聞、獨覺乘等，亦作一切佛法依因，亦是善巧諸行依處，",
        "translation": "These skillful means, in common with the vehicles of sravakas and pratyekabuddhas, also act as the supporting causes for all buddha-teachings. They are also the bases of skillful practices.",
        "source": "T13n0411_010:0773a13_19"
    },
    {
        "source_sentence": "亦是善巧任運無思滅退墮法。",
        "translation": "It's also the method of skillfully removing and regressing without thought.",
        "source": "T13n0411_010:0773a15_20"
    },
    {
        "source_sentence": "「又善男子！",
        "translation": "Again, good man!",
        "source": "T13n0411_010:0773a15_21"
    },
    {
        "source_sentence": "若諸菩薩不依明師、不依善友，修行世間善巧方便，是諸菩薩愚於世間善巧方便，",
        "translation": "If bodhisattvas cultivate worldly skillful means without relying on wise teachers or good friends, this is a foolish way for bodhisattvas to be skillful in worldly skillful means.",
        "source": "T13n0411_010:0773a16_22"
    },
    {
        "source_sentence": "向諸惡趣，不能隨順安住出世巧方便智，亦非一切真實福田。",
        "translation": "They're headed toward bad destinies, can't follow and abide in supramundane skillful means and wisdom, and they aren't all true fields of merit.",
        "source": "T13n0411_010:0773a18_0"
    },
    {
        "source_sentence": "不能善巧知諸有情根行差別，以於善巧方便愚故，為諸聲聞、及獨覺乘、非大乘器及於大乘根未熟者，",
        "translation": "They can't skillfully know the differences in faculties and actions of sentient beings because they're ignorant of skillful means, so for the sake of śrāvakas and solitary realizers who aren't great vehicle vessels or those whose",
        "source": "T13n0411_010:0773a19_1"
    },
    {
        "source_sentence": "宣說大乘，令其修學。",
        "translation": "He teaches the great vehicle and causes them to cultivate it.",
        "source": "T13n0411_010:0773a22_0"
    },
    {
        "source_sentence": "又為大乘法器有情，宣說聲聞、獨覺乘法，令修聲聞、獨覺乘行。",
        "translation": "Also, for sentient beings who are the Dharma vessel of the great vehicle, he teaches the teachings of the śrāvaka and pratyekabuddha vehicle so that they will cultivate the practice of the śrāvaka and pratyekabuddha vehicle.",
        "source": "T13n0411_010:0773a22_1"
    },
    {
        "source_sentence": "為獨覺乘法器有情，說聲聞乘，令其修習聲聞乘行。",
        "translation": "He teaches the śrāvaka vehicle for the sake of sentient beings who are the Dharma vessel of the solitary realizer vehicle and causes them to cultivate the practice of the śrāvaka vehicle.",
        "source": "T13n0411_010:0773a24_0"
    },
    {
        "source_sentence": "為聲聞乘法器有情，說生死法，令其愛著，不為宣說厭生死法。",
        "translation": "He teaches the teaching of birth-and-death for the sake of sentient beings who are the Dharma vessel of the śrāvaka vehicle, causes them to cling to it and doesn't proclaim the teaching of birth-and-death as a",
        "source": "T13n0411_010:0773a25_1"
    },
    {
        "source_sentence": "又於善巧方便愚故，若諸有情樂行殺生，廣說乃至執著邪見，為彼宣說甚深大乘，",
        "translation": "Also, because of the folly of skillful means, if there are sentient beings who delight in killing living beings and explain it extensively or even cling to wrong views, they will proclaim the profound Great Vehicle for them.",
        "source": "T13n0411_010:0773a26_2"
    },
    {
        "source_sentence": "不為宣說生死流轉，死此生彼，眾苦果報，令其厭怖，離諸惡法。",
        "translation": "They don't explain the transmigration of birth-and-death, death here and birth there, or the results of suffering that cause them to become disillusioned with it and part with bad qualities.",
        "source": "T13n0411_010:0773a28_3"
    },
    {
        "source_sentence": "又於善巧方便愚故，乃至若諸有情，樂修淨戒，令修布施。",
        "translation": "It's also because of the folly of skillful means, even if sentient beings are delighted to cultivate pure precepts and cause them to cultivate generosity.",
        "source": "T13n0411_010:0773b01_4"
    },
    {
        "source_sentence": "若諸有情，樂修安忍；",
        "translation": "Suppose sentient beings delight in cultivating patience.",
        "source": "T13n0411_010:0773b02_5"
    },
    {
        "source_sentence": "勸捨安忍，令修淨戒。",
        "translation": "He encourages them to abandon patience and cause them to cultivate pure morality.",
        "source": "T13n0411_010:0773b03_6"
    },
    {
        "source_sentence": "若諸有情，樂修精進；",
        "translation": "If sentient beings delight in cultivating enlightenment, they will enter the realm of buddhahood.",
        "source": "T13n0411_010:0773b03_7"
    },
    {
        "source_sentence": "勸捨精進，令修安忍。",
        "translation": "They are encouraged to abandon effort and cause cultivation of patience.",
        "source": "T13n0411_010:0773b04_8"
    },
    {
        "source_sentence": "若諸有情，樂修靜慮；",
        "translation": "If sentient beings delight in meditative absorption, they will attain enlightenment.",
        "source": "T13n0411_010:0773b04_9"
    },
    {
        "source_sentence": "勸捨靜慮，令修精進。",
        "translation": "He exhorts them to abandon meditation and cause them to cultivate effort.",
        "source": "T13n0411_010:0773b05_10"
    },
    {
        "source_sentence": "若諸有情，樂修般若；",
        "translation": "If all sentient beings delight in cultivating enlightenment, they will attain supreme enlightenment.",
        "source": "T13n0411_010:0773b05_11"
    },
    {
        "source_sentence": "勸捨般若，令修靜慮。",
        "translation": "He encourages the cultivation of meditation by abandoning prajñā.",
        "source": "T13n0411_010:0773b06_12"
    },
    {
        "source_sentence": "「如是菩薩愚於世間善巧方便，不能真實利樂有情，與諸有情為惡知識。",
        "translation": "Thus, the bodhisattva is ignorant of the skillful means in the world that can't truly benefit sentient beings and become bad friends with sentient beings.",
        "source": "T13n0411_010:0773b06_13"
    },
    {
        "source_sentence": "此巧方便依有所得、有所執著，如是名為菩薩世間善巧方便。",
        "translation": "These skillful means rely on what's gained and attached to, which is thus called the bodhisattva's skillful means in the world.",
        "source": "T13n0411_010:0773b08_14"
    },
    {
        "source_sentence": "如是世間善巧方便，共諸聲聞、獨覺乘等，此不名為大甲冑輪，亦不由此名為菩薩摩訶薩也，",
        "translation": "Thus, these worldly skillful means of skillful means shared with śrāvakas and pratyekbuddhas' vehicles aren't called the great armor wheel, nor are they called bodhisattva-mahāsattvas because of this.",
        "source": "T13n0411_010:0773b10_0"
    },
    {
        "source_sentence": "及名一切聲聞、獨覺、真實福田。",
        "translation": "It's also called the true field of merit for all śrāvakas, solitary realizers, and true practitioners.",
        "source": "T13n0411_010:0773b12_1"
    },
    {
        "source_sentence": "「云何名為菩薩出世善巧方便？",
        "translation": "What's called a bodhisattva's supramundane skillful means?",
        "source": "T13n0411_010:0773b12_2"
    },
    {
        "source_sentence": "謂：諸菩薩但為利他，不為自利，示現種種工巧伎術。",
        "translation": "It means that bodhisattvas simply want to benefit others and not themselves, and they show various arts and skills.",
        "source": "T13n0411_010:0773b13_3"
    },
    {
        "source_sentence": "為成熟他，承事供養諸佛世尊、或諸菩薩、或諸獨覺、或諸聲聞、或母、或父、或諸病者、或諸羸劣無依怙者，",
        "translation": "In order to develop others, they serve and honor the buddhas, world-honored ones, or bodhisattvas, or self-enlightened ones, or śrāvakas, or mothers, fathers, or those who are sick, or weak",
        "source": "T13n0411_010:0773b14_4"
    },
    {
        "source_sentence": "若見厄難臨被害者，種種勤苦方便救濟，以四攝事成熟有情，隨其意樂，",
        "translation": "To those who are in distress they rescue them by means of various kinds of methods. By means of the four means of salvation they develop sentient beings according to their mentalities and inclinations,",
        "source": "T13n0411_010:0773b17_5"
    },
    {
        "source_sentence": "隨其根器，為諸有情宣說正法。",
        "translation": "According to their faculties and abilities, they teach the right teaching for sentient beings.",
        "source": "T13n0411_010:0773b18_6"
    },
    {
        "source_sentence": "又能漸次勸諸聲聞修獨覺乘，勸諸獨覺修習大乘。",
        "translation": "They can also gradually encourage śrāvakas to cultivate the solitary realizer vehicle and encourage solitary realizers to cultivate the great vehicle.",
        "source": "T13n0411_010:0773b19_7"
    },
    {
        "source_sentence": "若於聲聞及獨覺乘根未熟者，為說厭離生死苦法，令其修學厭離生死，",
        "translation": "Those who have not yet matured their faculties for the vehicles of the disciples and solitary realizers he teaches to become disillusioned with the painful state of birth-and-death, so that they may practice becoming disillusioned with birth",
        "source": "T13n0411_010:0773b20_8"
    },
    {
        "source_sentence": "欣求涅槃。",
        "translation": "They delight in seeking nirvāṇa.",
        "source": "T13n0411_010:0773b22_9"
    },
    {
        "source_sentence": "若諸有情，樂行殺生，廣說乃至樂著邪見，隨其根性，或為宣說，生死流轉，",
        "translation": "If sentient beings delight in taking life and explain it extensively, up to they delight in wrong views. According to their faculties or natures, some preach the cycle of birth-and-death.",
        "source": "T13n0411_010:0773b22_10"
    },
    {
        "source_sentence": "死此生彼，眾苦果報，令其厭怖離諸惡法；",
        "translation": "Death here and birth there brings all kinds of painful retribution, causing them to become disillusioned with bad states.",
        "source": "T13n0411_010:0773b24_11"
    },
    {
        "source_sentence": "或為宣說，與聲聞乘相應正法；",
        "translation": "Some I help by expounding the right doctrine associated with the vehicle of the disciples.",
        "source": "T13n0411_010:0773b25_12"
    },
    {
        "source_sentence": "或為宣說，與獨覺乘相應正法；",
        "translation": "Some I help by expounding the right doctrine associated with the vehicle of individual illumination.",
        "source": "T13n0411_010:0773b26_13"
    },
    {
        "source_sentence": "或為宣說，無上乘中淺近之法；",
        "translation": "Some I help by explaining the shallow teachings of the unexcelled vehicle.",
        "source": "T13n0411_010:0773b27_14"
    },
    {
        "source_sentence": "令漸修學。",
        "translation": "He causes them to gradually cultivate it.",
        "source": "T13n0411_010:0773b27_15"
    },
    {
        "source_sentence": "若諸有情已樂布施。",
        "translation": "Suppose sentient beings have enjoyed generosity.",
        "source": "T13n0411_010:0773b28_16"
    },
    {
        "source_sentence": "為說勝上受持淨戒，令其修學；",
        "translation": "I elucidate the supreme acceptance of pure precepts, enabling them to cultivate practice.",
        "source": "T13n0411_010:0773b28_17"
    },
    {
        "source_sentence": "廣說乃至若諸有情已樂靜慮，為說勝上無漏聖道所攝般若，令其修學。",
        "translation": "It's explained in detail, even if sentient beings already delight in meditation, to explain the superior prajñā that's included in the uncontaminated noble path and cause them to cultivate it.",
        "source": "T13n0411_010:0773b29_18"
    },
    {
        "source_sentence": "此巧方便依無所得、無所執著，如是名為菩薩出世善巧方便大甲冑輪。",
        "translation": "This skillful means relies on nothing to be gained and nothing to cling to, which is thus called the great armor wheel of the bodhisattva's skillful means of supramundane skillful means.",
        "source": "T13n0411_010:0773c01_19"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_010:0773c03_20"
    },
    {
        "source_sentence": "若菩薩摩訶薩成就如是善巧方便大甲冑輪，從初發心，一切五欲皆能除斷，",
        "translation": "“Furthermore, if great enlightening beings accomplish these kinds of skillful means for the development of such an armor-wheel, from the first determination they will be able to eliminate all five desires.",
        "source": "T13n0411_010:0773c03_21"
    },
    {
        "source_sentence": "得名菩薩摩訶薩也。",
        "translation": "They'll be called bodhisattvas and mahāsattvas.",
        "source": "T13n0411_010:0773c05_22"
    },
    {
        "source_sentence": "超勝一切聲聞、獨覺，普為一切聲聞、獨覺、作大福田。",
        "translation": "He surpasses all śrāvakas and pratyekbuddhas and creates a great field of merit for all śrāvakas and pratyekbuddhas.",
        "source": "T13n0411_010:0773c06_23"
    },
    {
        "source_sentence": "一切聲聞、獨覺乘等，皆應供養承事守護。」",
        "translation": "All śrāvakas, pratyekbuddhas, and so forth should be offered support and guarded.",
        "source": "T13n0411_010:0773c07_24"
    },
    {
        "source_sentence": "「所修慧有二，　　世間出世間，",
        "translation": "“There are two kinds of wisdom that are cultivated: mundane and supramundane.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　取著名世間，　　無取著出世。",
        "translation": "They cling to the well-known world and don't cling to what comes out of the world.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　修善巧方便，　　依二種差別，",
        "translation": "Cultivating skillful means relies on two kinds of distinctions:",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　有所得世間，　　無所得出世。",
        "translation": "The world has attained what is attained, but the ungraspable transcends the world.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　若唯說一乘，　　是名惡說法，",
        "translation": "If someone teaches only the One Vehicle, this is called a bad doctrine.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　不能自成熟，　　亦不能度他。",
        "translation": "They can't ripen themselves, and they can't save others.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　一向惡眾生，　　為說三乘教，",
        "translation": "For the sake of sentient beings who are always evil, He teaches the teachings of the three vehicles.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　是則為愚癡，　　不名摩訶薩。",
        "translation": "Then they're foolish and not called mahāsattvas.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　有堪趣三乘，　　欣求聞正法，",
        "translation": "Those who are able to enter the three vehicles And wish to hear the true teaching.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　為說樂生死，　　非為智者相；",
        "translation": "In order to explain the bliss of birth and death, it is not the characteristic of a wise person.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　專意諦思惟，　　隨根欲教化，",
        "translation": "He concentrates his mind on contemplation, Teaching according to faculties and desires.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　此善巧方便，　　智者所稱譽；",
        "translation": "This skillful means is praised by the wise.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　眾生雖有惡，　　而堪入三乘，",
        "translation": "Though sentient beings have evil, yet they are able to enter the three vehicles.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "　隨根器教導，　　令解脫眾惡。",
        "translation": "He teaches according to the capacities of his faculties, freeing them from all evils.",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "爾時，世尊欲重顯此義而說頌曰：「復次，善男子！",
        "translation": "At that point, the Bhagavān wanted to reiterate this meaning and spoke a verse, saying, Furthermore, good man!",
        "source": "T13n0411_010:0773c08_25"
    },
    {
        "source_sentence": "菩薩摩訶薩，復有大慈大甲冑輪，若菩薩摩訶薩成就此輪，從初發心，",
        "translation": "“Furthermore, the great compassionate enlightening being has another great armor-wheel of great benevolence:",
        "source": "T13n0411_010:0773c24_26"
    },
    {
        "source_sentence": "一切五欲皆能除斷，超勝一切聲聞、獨覺，普為一切聲聞、獨覺、作大福田。",
        "translation": "He's able to remove all five desires, surpassing all śrāvakas and pratyekbuddhas, and he creates a great field of merit for all śrāvakas and pratyekbuddhas.",
        "source": "T13n0411_010:0773c25_27"
    },
    {
        "source_sentence": "一切聲聞、獨覺乘等，皆應供養承事守護。",
        "translation": "All śrāvakas, pratyekbuddhas, and so forth should be offered support and guarded.",
        "source": "T13n0411_010:0773c27_28"
    },
    {
        "source_sentence": "云何大慈大甲冑輪？",
        "translation": "What's the great compassionate, great armor-wheel?",
        "source": "T13n0411_010:0773c28_29"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_010:0773c29_0"
    },
    {
        "source_sentence": "慈有二種，謂：法緣慈、有情緣慈。",
        "translation": "There are two kinds of kindness: conditioned by factors, there is compassion; conditioned by beings, there is compassion.",
        "source": "T13n0411_010:0773c29_1"
    },
    {
        "source_sentence": "法緣慈者，名為大慈，名大甲冑。",
        "translation": "The conditioned kindness of the Dharma is called great kindness, which is called great armor.",
        "source": "T13n0411_010:0773c29_2"
    },
    {
        "source_sentence": "有情緣慈，不名大慈，非大甲冑。",
        "translation": "Sentient beings are conditioned by kindness, which isn't called great kindness or great armor.",
        "source": "T13n0411_010:0774a01_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0411_010:0774a02_4"
    },
    {
        "source_sentence": "有情緣慈，共諸聲聞、獨覺乘等。",
        "translation": "Sentient beings are conditioned by kindness, shared with śrāvakas and solitary realizers in the vehicle.",
        "source": "T13n0411_010:0774a02_5"
    },
    {
        "source_sentence": "聲聞、獨覺為自利樂，不為有情精勤修習有情緣慈。",
        "translation": "śrāvakas and pratyekbuddhas aim for self-benefit and don't diligently cultivate the conditioned compassion of sentient beings for the sake of sentient beings.",
        "source": "T13n0411_010:0774a03_6"
    },
    {
        "source_sentence": "聲聞、獨覺為自寂靜、為自涅槃、為滅自惑、為滅自結，不為有情精勤修習有情緣慈。",
        "translation": "śrāvakas and pratyekbuddhas cultivate the conditional love of sentient beings for their own quiescence, for their own nirvāṇa, to extinguish their own afflictions, and to extinguish their own bonds in order",
        "source": "T13n0411_010:0774a04_7"
    },
    {
        "source_sentence": "是故，此慈不名大慈，非大甲冑。",
        "translation": "Therefore, this kindness isn't called great kindness, not great armor.",
        "source": "T13n0411_010:0774a06_8"
    },
    {
        "source_sentence": "其法緣慈，不共聲聞、獨覺乘等，唯諸菩薩摩訶薩眾所能修行。",
        "translation": "The Dharma conditioned by kindness is not shared with the śrāvakas, pratyekbuddhas, and so forth, but only bodhisattvas, mahāsattvas, and others can cultivate it.",
        "source": "T13n0411_010:0774a07_9"
    },
    {
        "source_sentence": "菩薩摩訶薩普為利樂一切有情，精勤修習此法緣慈。",
        "translation": "The bodhisattva Mahāsattva diligently cultivates this conditional compassion for the benefit of all sentient beings for the sake of the welfare of all sentient beings.",
        "source": "T13n0411_010:0774a08_10"
    },
    {
        "source_sentence": "菩薩摩訶薩普為一切有情寂靜，及得涅槃滅煩惱結，精勤修習此法緣慈。",
        "translation": "The bodhisattva Mahāsattva diligently cultivates this causal compassion for the sake of the tranquility of all sentient beings and the attainment of nirvāṇa, extinguishing the afflictive bonds, and diligently cultiva",
        "source": "T13n0411_010:0774a10_11"
    },
    {
        "source_sentence": "是故，此慈名為大慈，是大甲冑。",
        "translation": "That's why this kindness is called great kindness, which is a great armor.",
        "source": "T13n0411_010:0774a11_12"
    },
    {
        "source_sentence": "又諸菩薩修法緣慈，不依諸蘊、不依諸處、不依諸界、不依念住，乃至不依道支、不依欲界、不依色界、不依無色界、不依此世、不依他世、不依此岸、不依彼岸、不依得、不依不得。",
        "translation": "Also, bodhisattvas cultivate the conditioned compassion for the sake of the Dharma without relying on the aggregates, without relying on places, without relying on realms, without relying on mindfulness, and without relying on",
        "source": "T13n0411_010:0774a12_13"
    },
    {
        "source_sentence": "如是菩薩修法緣慈，超諸聲聞、獨覺乘地，是名菩薩法緣大慈大甲冑輪。",
        "translation": "Thus, when a bodhisattva cultivates the conditioned compassion of the Dharma and transcends the stages of śrāvakas and pratyekbuddhas in the vehicle, this is called the great armor-wheel of great compassion that's",
        "source": "T13n0411_010:0774a17_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_010:0774a18_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩成此大慈大甲冑輪，從初發心，一切五欲皆能除斷，得名菩薩摩訶薩也。",
        "translation": "If a bodhisattva-mahāsattva accomplishes this great compassionate, great armor-armed wheel of great compassion and is able to remove all five desires from the first arousal of his mind, he'll be called a bodhi",
        "source": "T13n0411_010:0774a18_2"
    },
    {
        "source_sentence": "超勝一切聲聞、獨覺，普為一切聲聞、獨覺、作大福田。",
        "translation": "He surpasses all śrāvakas and pratyekbuddhas and creates a great field of merit for all śrāvakas and pratyekbuddhas.",
        "source": "T13n0411_010:0774a20_3"
    },
    {
        "source_sentence": "一切聲聞、獨覺乘等，皆應供養承事守護。」",
        "translation": "All śrāvakas, pratyekbuddhas, and so forth should be offered support and guarded.",
        "source": "T13n0411_010:0774a22_4"
    },
    {
        "source_sentence": "「聲聞及獨覺，　　修有情緣慈，",
        "translation": "śrāvakas and pratyekbuddhas cultivate the compassion that takes sentient beings as objects,",
        "source": "T13n0411_010:0774a23_5"
    },
    {
        "source_sentence": "　心帶十三過，　　唯求自利樂。",
        "translation": "The mind has thirteen faults, seeking only self-benefit and happiness.",
        "source": "T13n0411_010:0774a23_5"
    },
    {
        "source_sentence": "　菩薩大名稱，　　普為諸有情，",
        "translation": "Enlightening beings’ great name is For the sake of all sentient beings.",
        "source": "T13n0411_010:0774a23_5"
    },
    {
        "source_sentence": "　修不共大慈，　　心離十三過；",
        "translation": "Cultivating uncommon great compassion, His mind is free of the thirteen faults.",
        "source": "T13n0411_010:0774a23_5"
    },
    {
        "source_sentence": "　心除十三垢，　　為趣大菩提，",
        "translation": "Their minds are rid of the thirteen impurities, In order to attain great enlightenment.",
        "source": "T13n0411_010:0774a23_5"
    },
    {
        "source_sentence": "　修法緣大慈，　　成福田非遠；",
        "translation": "Cultivating the Dharma conditioned by great compassion Is not far from becoming a field of blessings.",
        "source": "T13n0411_010:0774a23_5"
    },
    {
        "source_sentence": "　安住十三力，　　出過諸有情，",
        "translation": "Abiding in the thirteen powers, he transcends all sentient beings.",
        "source": "T13n0411_010:0774a23_5"
    },
    {
        "source_sentence": "　猶如師子王，　　超勝諸禽獸；",
        "translation": "He’s like a lion king Who surpasses all birds and beasts.",
        "source": "T13n0411_010:0774a23_5"
    },
    {
        "source_sentence": "　降伏十三怨，　　離斷常邊執，",
        "translation": "He subdues the thirteen enemies and is free of clinging to annihilation and permanence.",
        "source": "T13n0411_010:0774a23_5"
    },
    {
        "source_sentence": "　心無有染濁，　　速證大菩提。",
        "translation": "Their minds are free of defilement, and they quickly realize great enlightenment.",
        "source": "T13n0411_010:0774a23_5"
    },
    {
        "source_sentence": "爾時，世尊重顯此義而說頌曰：「復次，善男子！",
        "translation": "At that point, the Bhagavān revealed this meaning and spoke a verse, saying, Furthermore, good man!",
        "source": "T13n0411_010:0774a23_5"
    },
    {
        "source_sentence": "菩薩摩訶薩，復有大悲大甲冑輪，若菩薩摩訶薩成就此輪，從初發心，",
        "translation": "“Furthermore, great enlightening beings have great compassion and great armorlike wheels. If great enlightening beings accomplish these wheels from the very first determination for enlightenment,",
        "source": "T13n0411_010:0774b05_6"
    },
    {
        "source_sentence": "一切五欲皆能除斷，超勝一切聲聞、獨覺，普為一切聲聞、獨覺、作大福田。",
        "translation": "He's able to remove all five desires, surpassing all śrāvakas and pratyekbuddhas, and he creates a great field of merit for all śrāvakas and pratyekbuddhas.",
        "source": "T13n0411_010:0774b06_7"
    },
    {
        "source_sentence": "一切聲聞、獨覺乘等，皆應供養承事守護。",
        "translation": "All śrāvakas, pratyekbuddhas, and so forth should be offered support and guarded.",
        "source": "T13n0411_010:0774b08_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T13n0411_010:0774b09_9"
    },
    {
        "source_sentence": "一切聲聞、獨覺乘等，但為己身得利樂故而修行悲，不欲普為一切有情得利樂故修行大悲。",
        "translation": "All śrāvakas and pratyekbuddhas simply cultivate compassion for the sake of gaining benefit and happiness for themselves, and they don't want to cultivate great compassion for the sake of gaining benefit and happiness for all sentient beings.",
        "source": "T13n0411_010:0774b09_10"
    },
    {
        "source_sentence": "菩薩摩訶薩不為己身得利樂故而修行悲，但欲普為一切有情得利樂故修行大悲。",
        "translation": "The bodhisattva Mahāsattva doesn't cultivate compassion for the sake of gaining benefit and happiness for himself, but he cultivates great compassion because he wants to attain benefit and happiness for all sentient beings.",
        "source": "T13n0411_010:0774b12_0"
    },
    {
        "source_sentence": "是故，菩薩成就大悲大甲冑輪，超勝一切聲聞、獨覺，普為一切聲聞、獨覺、作大福田。",
        "translation": "Therefore, the bodhisattva accomplishes the great compassionate great armor wheel of great compassion that surpasses all śrāvakas and pratyekbuddhas and creates a great field of merit for all śrāvakas and pratyekbuddhas",
        "source": "T13n0411_010:0774b14_1"
    },
    {
        "source_sentence": "一切聲聞、獨覺乘等，皆應供養承事守護。",
        "translation": "All śrāvakas, pratyekbuddhas, and so forth should be offered support and guarded.",
        "source": "T13n0411_010:0774b16_0"
    },
    {
        "source_sentence": "是菩薩摩訶薩普為饒益諸有情故，行四攝事而成熟之。",
        "translation": "This is the bodhisattva Mahāsattva who, for the sake of benefiting all sentient beings, performs the four gathering tasks and develops them.",
        "source": "T13n0411_010:0774b16_1"
    },
    {
        "source_sentence": "謂：由大悲，普為利樂諸有情故，行布施攝，能捨一切珍寶、財物、禽獸、僕使、國城、妻子、乃至身命無所悋惜。",
        "translation": "It means that it's because of great compassion for the benefit of all sentient beings that they practice generosity, and they can give up all rare treasures, possessions, animals, servants, cities, wives, or even their bodies and lives without",
        "source": "T13n0411_010:0774b18_2"
    },
    {
        "source_sentence": "行無所得為方便故，不見一切所化有情、不見施者、不見受者、不見施物、不見施行、不見施行所得果報，",
        "translation": "Because practice without obtaining is the method, they don't see all the sentient beings they teach, don't see donors, don't see recipients, don't see things given, don't see actions, and don't see the results",
        "source": "T13n0411_010:0774b20_3"
    },
    {
        "source_sentence": "乃至不見無所得行。",
        "translation": "It doesn't even see the practice of nonobtainment.",
        "source": "T13n0411_010:0774b23_4"
    },
    {
        "source_sentence": "如是大悲普為利樂諸有情故，行愛語攝、行利行攝、行同事攝，隨其所應如上廣說，",
        "translation": "In this way great compassion is universally for the benefit and welfare of all sentient beings; it is categorized as affectionate speech by action, beneficial action by action, and fellow practitioner by action. As appropriate, it is explained in detail above",
        "source": "T13n0411_010:0774b23_5"
    },
    {
        "source_sentence": "乃至不見無所得行。",
        "translation": "It doesn't even see the practice of nonobtainment.",
        "source": "T13n0411_010:0774b25_6"
    },
    {
        "source_sentence": "是菩薩摩訶薩，常以最勝能調伏心、能寂靜心、無數量心、不行一切蘊處界心所生無動無住大悲大甲冑輪，",
        "translation": "“Furthermore, these great enlightening beings always use the supremely subdued mind that’s capable of self-control, the tranquil mind that’s capable of quiescence, the incalculable mind that doesn’t abide in all",
        "source": "T13n0411_010:0774b26_7"
    },
    {
        "source_sentence": "成熟一切所化有情心無厭倦，如是名為菩薩大悲大甲冑輪，不共一切聲聞、獨覺。",
        "translation": "To ripen the minds of all the sentient beings they teach without weariness is thus called the bodhisattva's great compassionate armor-wheel of great compassion, which isn't shared with all śrāvakas and soli",
        "source": "T13n0411_010:0774b28_8"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_010:0774c01_9"
    },
    {
        "source_sentence": "若菩薩摩訶薩成此大悲大甲冑輪，從初發心，一切五欲皆能除斷，得名菩薩摩訶薩也。",
        "translation": "If a bodhisattva-mahāsattva accomplishes this great compassionate, great armor-armed wheel of great compassion and can remove all five desires from the first arousal of mind, he'll be called a bodhisattva-",
        "source": "T13n0411_010:0774c01_10"
    },
    {
        "source_sentence": "超勝一切聲聞、獨覺，普為一切聲聞、獨覺、作大福田。",
        "translation": "He surpasses all śrāvakas and pratyekbuddhas and creates a great field of merit for all śrāvakas and pratyekbuddhas.",
        "source": "T13n0411_010:0774c03_11"
    },
    {
        "source_sentence": "一切聲聞、獨覺乘等，皆應供養承事守護。」",
        "translation": "All śrāvakas, pratyekbuddhas, and so forth should be offered support and guarded.",
        "source": "T13n0411_010:0774c05_12"
    },
    {
        "source_sentence": "「甚深微妙法，　　所成之大悲，",
        "translation": "The profound and subtle teaching is the great compassion that’s formed by the great compassion",
        "source": "T13n0411_010:0774c06_0"
    },
    {
        "source_sentence": "　難測類虛空，　　無色無安住。",
        "translation": "It's difficult to fathom the type of space, which has no form and no peaceful abode.",
        "source": "T13n0411_010:0774c06_0"
    },
    {
        "source_sentence": "　菩薩大精進，　　具杜多功德，",
        "translation": "Enlightening beings’ great effort Is endowed with numerous virtues.",
        "source": "T13n0411_010:0774c06_0"
    },
    {
        "source_sentence": "　勝智成大悲，　　勇健超諸世。",
        "translation": "Their superior wisdom becomes great compassion, and their courage surpasses the world.",
        "source": "T13n0411_010:0774c06_0"
    },
    {
        "source_sentence": "　無依怙有情，　　生死苦穢縛，",
        "translation": "Sentient beings who have no support Are bound by the suffering and defilement of birth and death.",
        "source": "T13n0411_010:0774c06_0"
    },
    {
        "source_sentence": "　大悲水沐浴，　　令解脫眾苦。",
        "translation": "He bathed in the water of great compassion, freed from all suffering.",
        "source": "T13n0411_010:0774c06_0"
    },
    {
        "source_sentence": "　菩薩行大悲，　　能竭生死海，",
        "translation": "Enlightening beings’ practice of great compassion Can dry up the sea of birth and death.",
        "source": "T13n0411_010:0774c06_0"
    },
    {
        "source_sentence": "　非諸聲聞眾，　　及獨覺所行。",
        "translation": "They aren't practiced by śrāvakas or solitary realizers.",
        "source": "T13n0411_010:0774c06_0"
    },
    {
        "source_sentence": "　眾生貪恚癡，　　迷謬墮惡趣，",
        "translation": "Sentient beings are greedy, angry, and deluded, Being led astray into evil destinies.",
        "source": "T13n0411_010:0774c06_0"
    },
    {
        "source_sentence": "　濯以大悲水，　　脫苦得蕭然。",
        "translation": "Wash it with the water of great compassion, and you'll be freed from suffering and attain desolateness.",
        "source": "T13n0411_010:0774c06_0"
    },
    {
        "source_sentence": "爾時，世尊重顯此義而說頌曰：「復次，善男子！",
        "translation": "At that point, the Bhagavān revealed this meaning and spoke a verse, saying, Furthermore, good man!",
        "source": "T13n0411_010:0774c06_0"
    },
    {
        "source_sentence": "菩薩摩訶薩，復有能引遍滿虛空、無量無邊、廣大眾具辭無礙解，一切佛法、諸三摩地、諸陀羅尼堅固大忍大甲冑輪。",
        "translation": "Again, there are bodhisattvas and mahāsattvas who can lead the vast multitude of people to pervade space, measureless and limitless, and have unhindered understanding of all the Buddha's teachings, samādhis, dhāraṇ",
        "source": "T13n0411_010:0774c17_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩成就此輪，從初發心，一切五欲皆能除斷，超勝一切聲聞、獨覺，",
        "translation": "“If great enlightening beings accomplish this wheel, they can remove all the five desires from the first determination for enlightenment and become free of them, surpassing all listeners and solitary realizers.",
        "source": "T13n0411_010:0774c19_2"
    },
    {
        "source_sentence": "普為一切聲聞、獨覺作大福田。",
        "translation": "They universally create great fields of merit for all śrāvakas and pratyekbuddhas.",
        "source": "T13n0411_010:0774c21_3"
    },
    {
        "source_sentence": "一切聲聞、獨覺乘等，皆應供養承事守護。",
        "translation": "All śrāvakas, pratyekbuddhas, and so forth should be offered support and guarded.",
        "source": "T13n0411_010:0774c22_4"
    },
    {
        "source_sentence": "「云何菩薩摩訶薩能引遍滿虛空、無量無邊、廣大眾具辭無礙解，一切佛法、諸三摩地、諸陀羅尼堅固大忍大甲冑輪？",
        "translation": "How can the bodhisattva Mahāsattva lead the vast multitude of people who pervade space, are immeasurable and limitless, and have unhindered understanding of all the Buddha's teachings, samādhis, dhāraṇīs",
        "source": "T13n0411_010:0774c23_5"
    },
    {
        "source_sentence": "謂：諸菩薩於一切法審諦照察，如明月光遍滿虛空，其心平等，無依、無相、無住、無染，",
        "translation": "It means that enlightening beings scrutinize all things with certainty, like the light of the moon shining everywhere in space. Their minds are impartial, without support, without signs, without abode, and without defilement.",
        "source": "T13n0411_010:0774c25_6"
    },
    {
        "source_sentence": "普於一切三摩地門、陀羅尼門心無行動。",
        "translation": "The mind is unmoving in all the samādhi-gates and dhāraṇī-gates.",
        "source": "T13n0411_010:0774c27_7"
    },
    {
        "source_sentence": "於諸眼色、眼識、眼觸，離意染著，心無行動。",
        "translation": "They are free of mentally defiled attachment to form, eye consciousness, and eye contact, and their minds have no movement.",
        "source": "T13n0411_010:0774c28_8"
    },
    {
        "source_sentence": "於眼觸緣生內三受，或樂、或苦、或非苦樂，心常寂定，無所取著。",
        "translation": "With three internal sensations that arise from the conditions of eye contact, whether pleasant, painful, or neither-unpleasant-nor-unpleasant, his mind is always tranquil and concentrated, not clinging to anything.",
        "source": "T13n0411_010:0774c29_9"
    },
    {
        "source_sentence": "於諸耳聲、耳識、耳觸，於諸鼻香、鼻識、鼻觸，於諸舌味、舌識、舌觸，",
        "translation": "“With respect to the sounds of the ear, consciousness of the ear, and contact with the ear; with respect to the odor of the nose, consciousness of the nose, and contact with the nose; with respect to the tastes of the",
        "source": "T13n0411_010:0775a02_10"
    },
    {
        "source_sentence": "於諸身觸、身識、身觸，於諸意法、意識、意觸，廣說亦爾。",
        "translation": "bodily contact, bodily consciousness and bodily contact. The same applies to mental factors, to the thinking consciousness and to mental contact:",
        "source": "T13n0411_010:0775a03_11"
    },
    {
        "source_sentence": "普於一切心、意、識中，心常寂定，無所取著。",
        "translation": "In all minds, thoughts, and consciousnesses, his mind is always quiescent and concentrated, with no attachment.",
        "source": "T13n0411_010:0775a05_12"
    },
    {
        "source_sentence": "於心、意、識所生三受，或樂、或苦、或非苦樂，心常寂定，無所取著。",
        "translation": "In the three sensations that arise from mind, thought, and consciousness, whether pleasant, painful, or neither-unpleasant-nor-unpleasant, his mind is always tranquil and concentrated, not clinging to anything.",
        "source": "T13n0411_010:0775a06_13"
    },
    {
        "source_sentence": "普於三世諸蘊、界、處一切品類，皆無取著，心無行動。",
        "translation": "They have no attachment or attachment to all kinds of aggregates, realms, or locations in the three times, and their minds don't act.",
        "source": "T13n0411_010:0775a07_14"
    },
    {
        "source_sentence": "普於一切三界、三行、三觸、三受、三根、三乘、三律儀、三解脫一切品類，",
        "translation": "In all the three realms, three practices, three touches, three sensations, three faculties, three vehicles, three disciplines, and three liberations of all kinds.",
        "source": "T13n0411_010:0775a08_15"
    },
    {
        "source_sentence": "其心寂靜，無住、無相、無所取著，平等而住。",
        "translation": "Their minds are quiescent, without abiding, without marks, and without attachment, and they abide equally.",
        "source": "T13n0411_010:0775a10_16"
    },
    {
        "source_sentence": "普於一切布施、淨戒、安忍、精進、靜慮般若波羅蜜多，心無行動，寂靜而住。",
        "translation": "In all the perfections of generosity, pure morality, patience, effort, meditation, and wisdom, their minds don't move, and they abide in quiescence.",
        "source": "T13n0411_010:0775a11_17"
    },
    {
        "source_sentence": "「如是，普於四念住、四正斷、四神足、五根、五力、七等覺支、八聖道支，",
        "translation": "“So it is with the four abodes of mindfulness, the four correct eliminations, the four miraculous powers, the five faculties, the five powers, the seven factors of virtual enlightenment, and the eight noble factors of the path.",
        "source": "T13n0411_010:0775a12_18"
    },
    {
        "source_sentence": "心無行動，寂靜而住。",
        "translation": "The mind has no movement and abides in quiescence.",
        "source": "T13n0411_010:0775a14_19"
    },
    {
        "source_sentence": "普於一切九次第定，心無行動，寂靜而住。",
        "translation": "In all the nine graduated concentrations, his mind has no movement and abides in quiescence.",
        "source": "T13n0411_010:0775a14_20"
    },
    {
        "source_sentence": "又於三行無障法智道支道體所引作用，皆無取著，心無行動。",
        "translation": "Also, in the three practices that are unobstructed by the path of knowledge of dharmas and the path of the branch of enlightenment, they all act as projected by the essence of the path, without grasping or clinging, and",
        "source": "T13n0411_010:0775a15_21"
    },
    {
        "source_sentence": "於阿賴耶、非阿賴耶，有取、無取、有漏、無漏、此岸、彼岸、小大無量、作與不作、善惡無記諸品類中，",
        "translation": "In the store consciousnesses and in the non-store consciousnesses, there's grasping, taking what's not grasped, contaminated, uncontaminated, this shore, that shore, small, large, immeasurable,",
        "source": "T13n0411_010:0775a17_22"
    },
    {
        "source_sentence": "心無行動，寂靜而住。",
        "translation": "The mind has no movement and abides in quiescence.",
        "source": "T13n0411_010:0775a19_23"
    },
    {
        "source_sentence": "普於一切大慈、大悲、善巧方便、成熟有情，乃至十地、三不護、四無所畏，",
        "translation": "In all great compassion, great compassion, skill in means, and the development of sentient beings, up to the tenth stage, the third undiscipline, and the fourth fearlessness.",
        "source": "T13n0411_010:0775a19_24"
    },
    {
        "source_sentence": "乃至十八不共佛法，一切品類，皆無取著，心無所動，寂靜而住。",
        "translation": "Up to the eighteen unique qualities of buddhahood, all kinds without attachment, their minds unmoving, they abide in quiescence.",
        "source": "T13n0411_010:0775a21_25"
    },
    {
        "source_sentence": "「菩薩摩訶薩由此輪故，能永息除三受過失，能永寂滅一切分別，能永遠離一切法相，",
        "translation": "“Because of these wheels, great enlightening beings can forever extinguish the faults of the three sensations; they can forever eliminate all discrimination and be forever free from all characteristics of things.",
        "source": "T13n0411_010:0775a22_26"
    },
    {
        "source_sentence": "復能安住能引一切虛空眼頂諸三摩地、諸陀羅尼善巧方便大甲冑輪。",
        "translation": "He's also able to abide in the great armor-wheel of skillful means that can guide all the samādhis and dhāraṇīs at the top of the eye of space.",
        "source": "T13n0411_010:0775a24_27"
    },
    {
        "source_sentence": "菩薩安住如是輪故，一切過去所引未盡惡不善業、無暇惡趣、諸有諸趣、死生諸業，",
        "translation": "Because the bodhisattva abides in such a wheel, all the bad and unwholesome actions that were projected in the past are not yet ended, bad and unwholesome actions, absence of leisure and bad destinies, states of existence and",
        "source": "T13n0411_010:0775a26_28"
    },
    {
        "source_sentence": "皆能除滅令盡無餘，不受果報。",
        "translation": "They can all be removed and extinguished so that they're exhausted without remainder, and they don't experience the results.",
        "source": "T13n0411_010:0775a28_29"
    },
    {
        "source_sentence": "「又善男子！",
        "translation": "Again, good man!",
        "source": "T13n0411_010:0775a29_30"
    },
    {
        "source_sentence": "譬如世界火災將起，五日出時，一切世間小池、大池、小河、大河、小海、大海水，",
        "translation": "Good man, this is analogous to a world in which the calamity of fire is about to begin. When five suns arise, all the small ponds, large ponds, small rivers, big rivers, shallow seas, and great waters",
        "source": "T13n0411_010:0775a29_31"
    },
    {
        "source_sentence": "皆枯竭滅盡無餘。",
        "translation": "They all wither and perish without remainder.",
        "source": "T13n0411_010:0775b02_32"
    },
    {
        "source_sentence": "如是菩薩成就能引遍滿虛空、無量無邊、廣大眾具辭無礙解，一切佛法、諸三摩地、諸陀羅尼堅固大忍大甲冑輪，",
        "translation": "“In this way the enlightening beings have perfected all the qualities of buddhas, and they are able to lead space everywhere, without measure or limit. The great assemblies speak with unhindered understanding. All Buddha teachings, all concentrations,",
        "source": "T13n0411_010:0775b02_33"
    },
    {
        "source_sentence": "復能安住能引一切虛空眼頂諸三摩地、諸陀羅尼善巧方便大甲冑輪。",
        "translation": "He's also able to abide in the great armor-wheel of skillful means that can guide all the samādhis and dhāraṇīs at the top of the eye of space.",
        "source": "T13n0411_010:0775b05_34"
    },
    {
        "source_sentence": "一切過去所引未盡惡不善業、無暇惡趣、諸有諸趣、死生諸業，皆能除滅令盡無餘，",
        "translation": "All the bad and unwholesome karmas projected in the past that have not yet been exhausted, the absence of leisurely evil destinies, the states of existence, and the karmas of death and birth can all be removed and extinguis",
        "source": "T13n0411_010:0775b06_35"
    },
    {
        "source_sentence": "不受果報。",
        "translation": "They won't receive the results of their actions.",
        "source": "T13n0411_010:0775b08_36"
    },
    {
        "source_sentence": "「又善男子！",
        "translation": "Again, good man!",
        "source": "T13n0411_010:0775b08_37"
    },
    {
        "source_sentence": "譬如世界水災起時，於此三千大千世界、諸小世界、各四大洲、八萬小渚、妙高山王及諸山等，",
        "translation": "“Furthermore, it is as if the waters of a great manifold cosmos were to pour forth and all the worlds in that universe were to be filled with floods like thunder.",
        "source": "T13n0411_010:0775b09_38"
    },
    {
        "source_sentence": "皆為灰水浸爛銷盡令無有餘。",
        "translation": "They are all submerged in ashes and water, soaked up and completely extinguished that there's nothing left.",
        "source": "T13n0411_010:0775b11_39"
    },
    {
        "source_sentence": "如是菩薩成就能引遍滿虛空、無量無邊、廣大眾具辭無礙解，一切佛法、諸三摩地、諸陀羅尼堅固大忍大甲冑輪，",
        "translation": "“In this way the enlightening beings have perfected all the qualities of buddhas, and they are able to lead space everywhere, without measure or limit. The great assemblies speak with unhindered understanding. All Buddha teachings, all concentrations,",
        "source": "T13n0411_010:0775b12_0"
    },
    {
        "source_sentence": "復能安住能引一切虛空眼頂諸三摩地、諸陀羅尼善巧方便大甲冑輪。",
        "translation": "He's also able to abide in the great armor-wheel of skillful means that can guide all the samādhis and dhāraṇīs at the top of the eye of space.",
        "source": "T13n0411_010:0775b14_1"
    },
    {
        "source_sentence": "一切過去所引未盡惡不善業、無暇惡趣、諸有諸趣、死生諸業，皆能除滅，",
        "translation": "All the evil and unwholesome deeds that had not yet ended, bad and unwholesome deeds inflicted by all beings of the past, wicked states of whirl where there is no time for them, rebirth",
        "source": "T13n0411_010:0775b16_2"
    },
    {
        "source_sentence": "令盡無餘不受果報。",
        "translation": "It causes them to end without remainder and not experience the results of their actions.",
        "source": "T13n0411_010:0775b17_3"
    },
    {
        "source_sentence": "「又善男子！",
        "translation": "Again, good man!",
        "source": "T13n0411_010:0775b18_4"
    },
    {
        "source_sentence": "譬如黑暗遍滿虛空，朗日出時皆能除滅。",
        "translation": "It's like when darkness pervades space and the bright sun rises, they can all be removed.",
        "source": "T13n0411_010:0775b18_5"
    },
    {
        "source_sentence": "如是菩薩成就能引遍滿虛空、無量無邊、廣大眾具辭無礙解，一切佛法，",
        "translation": "“Thus enlightening beings accomplish all the buddha-teachings that can lead to the pervading of space, infinity, boundlessness, vastness, speech, and unhindered understanding of all Buddha teachings.",
        "source": "T13n0411_010:0775b19_6"
    },
    {
        "source_sentence": "諸三摩地，諸陀羅尼堅固大忍大甲冑輪，復能安住能引一切虛空眼頂諸三摩地、諸陀羅尼善巧方便大甲冑輪。",
        "translation": "The samādhis, dhāraṇīs, and great armor-wheels of resolute great forbearance and great armor can also abide in the great armor-wheel of skillful means that can lead all the celestial eye-",
        "source": "T13n0411_010:0775b21_7"
    },
    {
        "source_sentence": "發起無邊虛空智日，能永除滅自身四倒無明黑暗。",
        "translation": "He gives rise to the day of limitless space wisdom, which can permanently remove the darkness of his own four errors of ignorance.",
        "source": "T13n0411_010:0775b23_8"
    },
    {
        "source_sentence": "一切過去所引未盡惡不善業、無暇惡趣、諸有諸趣、死生諸業，皆能除滅令盡無餘，",
        "translation": "All the bad and unwholesome karmas projected in the past that have not yet been exhausted, the absence of leisurely evil destinies, the states of existence, and the karmas of death and birth can all be removed and extinguis",
        "source": "T13n0411_010:0775b24_9"
    },
    {
        "source_sentence": "不受果報。",
        "translation": "They won't receive the results of their actions.",
        "source": "T13n0411_010:0775b26_10"
    },
    {
        "source_sentence": "又由此故，於諸佛法增進自在常無退轉，不復隨順惡友力行。",
        "translation": "Because of this, he's always unregressing in improving his mastery over the Buddha's teachings and no longer compliant with bad friends' powerful actions.",
        "source": "T13n0411_010:0775b27_0"
    },
    {
        "source_sentence": "常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧。",
        "translation": "They always attain it and don't part from seeing all the buddhas, bodhisattvas, śrāvakas, and disciples, don't part from hearing the Dharma, don't part from being intimate with them, and make offerings to",
        "source": "T13n0411_010:0775b28_1"
    },
    {
        "source_sentence": "於諸功德心常無厭，乃至菩提恒無間斷，又常不離念佛思惟，乃至夢中亦無暫廢。",
        "translation": "Their minds are always unwearied by virtues, and their minds are always uninterrupted until they reach enlightenment, and they always think of the Buddha without leaving them, even in a dream.",
        "source": "T13n0411_010:0775c01_2"
    },
    {
        "source_sentence": "「又善男子！",
        "translation": "Again, good man!",
        "source": "T13n0411_010:0775c03_3"
    },
    {
        "source_sentence": "云何菩薩摩訶薩能引遍滿虛空、無量無邊、廣大眾具辭無礙解，一切佛法、諸三摩地、諸陀羅尼堅固大忍大甲冑輪？",
        "translation": "How can the bodhisattva Mahāsattva lead the vast and unobstructed understanding of all the Buddha's teachings, samādhis, dhāraṇīs, firmness, great forbearance, and great armor wheels that pervad",
        "source": "T13n0411_010:0775c03_4"
    },
    {
        "source_sentence": "謂：諸菩薩入初靜慮乃至第四靜慮，入無邊虛空處乃至非想非非想處，",
        "translation": "They are as follows: Enlightening beings enter the first concentration up to the fourth concentration; they enter the sphere of infinite space, up to the sphere of neither thought nor nonthought.",
        "source": "T13n0411_010:0775c06_5"
    },
    {
        "source_sentence": "入滅受想定，住此定中，一切三受、三行、斷滅，心無行動，諸受，想、思、觸、作意等，",
        "translation": "When one enters into the absorption of extinction called ‘sensation-conception’ and abides in this absorption, all three forms of feeling, three aspects, are abandoned. The mind has no movement. All feelings, conceptual",
        "source": "T13n0411_010:0775c07_6"
    },
    {
        "source_sentence": "悉皆斷滅。",
        "translation": "They are all completely eliminated.",
        "source": "T13n0411_010:0775c09_7"
    },
    {
        "source_sentence": "安住此定，或一日夜，或復乃至七七日夜，受定味食。",
        "translation": "He abides in this concentration for one day and night, or for another day and night up to seventy-seven days and nights, and he receives the taste food of concentration.",
        "source": "T13n0411_010:0775c09_8"
    },
    {
        "source_sentence": "從此定起，其心寂靜，無所取著，宴然而住。",
        "translation": "When they arise from this absorption, their minds are quiescent, free of attachment, and they live in repose.",
        "source": "T13n0411_010:0775c10_9"
    },
    {
        "source_sentence": "復入勝義究竟空定，住此定中其心平等，無所取著猶若虛空。",
        "translation": "Again, he enters the ultimate emptiness concentration of ultimate meaning and abides in this concentration, where his mind is equanimous, with no attachment like space.",
        "source": "T13n0411_010:0775c11_10"
    },
    {
        "source_sentence": "身諸毛孔皆出霜液，狀如昴星，滅除一切欝烝結縛。",
        "translation": "Every pore of his body emits frost, resembling the shape of a Pleiades, and he extinguishes all the bonds of anger.",
        "source": "T13n0411_010:0775c13_11"
    },
    {
        "source_sentence": "從此定起得正憶念，最勝喜樂充遍其身。",
        "translation": "From this concentration, they attain right mindfulness and the supreme bliss pervades their bodies.",
        "source": "T13n0411_010:0775c14_12"
    },
    {
        "source_sentence": "如大自在天子入現一切樂定，身諸毛孔皆遍受樂。",
        "translation": "It's like the great self-willed celestial son who enters and manifests all the pleasant concentrations, and his body and hair pores are all filled with happiness.",
        "source": "T13n0411_010:0775c15_13"
    },
    {
        "source_sentence": "「如是菩薩樂觸其身便思念佛，思念佛故則唯見佛，不見餘相。",
        "translation": "Thus, the bodhisattva delights in touching his body and then thinks of the Buddha, and because he thinks of the Buddha, he sees only the Buddha and doesn't see any other characteristics.",
        "source": "T13n0411_010:0775c16_14"
    },
    {
        "source_sentence": "菩薩爾時，若念一佛則見一佛；",
        "translation": "“At that time the enlightening beings think of one buddha and see a buddha.",
        "source": "T13n0411_010:0775c18_15"
    },
    {
        "source_sentence": "若念多佛則見多佛；",
        "translation": "If one is mindful of many buddhas, he sees many buddhas.",
        "source": "T13n0411_010:0775c19_16"
    },
    {
        "source_sentence": "若念小身佛則見小身佛；",
        "translation": "If one is mindful of buddhas with small bodies, they will see buddhas with small bodies.",
        "source": "T13n0411_010:0775c19_17"
    },
    {
        "source_sentence": "若念大身佛則見大身佛；",
        "translation": "If one is mindful of a buddha of the great body, he sees a buddha of the great body.",
        "source": "T13n0411_010:0775c20_18"
    },
    {
        "source_sentence": "若念無量身佛則見無量身佛；",
        "translation": "If one is mindful of the Buddha of Immeasurable body, one will see the Buddha of Immeasurable body.",
        "source": "T13n0411_010:0775c20_19"
    },
    {
        "source_sentence": "若念自身為佛身相，則見自身同於佛身，眾相圓滿；",
        "translation": "If one thinks of oneself as the characteristics of a buddha-body, then one sees that oneself is the same as the buddha-body, with all marks perfected.",
        "source": "T13n0411_010:0775c21_20"
    },
    {
        "source_sentence": "若念他身為佛身相，則見他身同於佛身，眾相圓滿；",
        "translation": "If one is mindful of the characteristics of other bodies as buddha-bodies, one will see that others’ bodies are the same as those of buddhas, with all their characteristics complete.",
        "source": "T13n0411_010:0775c22_21"
    },
    {
        "source_sentence": "若念一切情、非情數所有色像為佛身相，則見一切情、非情數所有色像皆同佛身眾相圓滿，",
        "translation": "“Furthermore, if one were to think of all the forms and images that are possessed by all sentient beings and those that are not sentient beings as the characteristics of the Buddha’s body, one would see that all forms and",
        "source": "T13n0411_010:0775c24_22"
    },
    {
        "source_sentence": "不見其餘一切色像。",
        "translation": "They don't see all the other forms and images.",
        "source": "T13n0411_010:0775c26_23"
    },
    {
        "source_sentence": "菩薩爾時便作是念：『一切諸法、一切色像，皆如幻等，諦實不虛。",
        "translation": "At that point, the bodhisattva then had this thought, 'All dharmas and all forms are illusory and so forth, which are true and not false.",
        "source": "T13n0411_010:0775c26_24"
    },
    {
        "source_sentence": "我今復應皆悉斷滅，一切三受、三行等法，令無有餘。』",
        "translation": "Now, I should also completely eliminate all the three sensations and three practices so that there are no remaining dharmas.'",
        "source": "T13n0411_010:0775c28_25"
    },
    {
        "source_sentence": "作是念已入滅盡定，住此定中，如心所期皆盡斷滅。",
        "translation": "Having thought this, he enters the absorption of total extinction and abides in that absorption.",
        "source": "T13n0411_010:0775c29_26"
    },
    {
        "source_sentence": "受定味食，或一七日夜、或二七日夜、或三四五六七八九十七日夜、或經無量百千俱胝那庾多劫，",
        "translation": "They receive food of the taste of meditation for one day and night, for seven days and nights, for two days and nights, for three, four, five, six, seven, eight, or nine days and nights, or for an infinite number of e",
        "source": "T13n0411_010:0776a01_27"
    },
    {
        "source_sentence": "隨力所能，安住此定，受定味食。",
        "translation": "They abide in this absorption according to the power of their faculties and receive the nourishment of that absorption.",
        "source": "T13n0411_010:0776a03_28"
    },
    {
        "source_sentence": "從此定起，其心寂靜，無所取著，宴然而住。",
        "translation": "When they arise from this absorption, their minds are quiescent, free of attachment, and they live in repose.",
        "source": "T13n0411_010:0776a04_29"
    },
    {
        "source_sentence": "復入勝義究竟空定，廣說如前，乃至思念佛身相已，知一切法、一切色像，",
        "translation": "“Furthermore, entering the ultimate concentration of ultimate emptiness of ultimate meaning, he knows all things and all forms as they are by contemplating the characteristics of buddha-bodies.",
        "source": "T13n0411_010:0776a05_30"
    },
    {
        "source_sentence": "皆如幻等，諦實不虛。",
        "translation": "They are all like illusions and so forth, which are true in truth and not false.",
        "source": "T13n0411_010:0776a07_31"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_010:0776a07_32"
    },
    {
        "source_sentence": "是名菩薩摩訶薩能引遍滿虛空、無量無邊、廣大眾具辭無礙解，一切佛法、諸三摩地、諸陀羅尼堅固大忍大甲冑輪。",
        "translation": "This is called a bodhisattva-mahāsattva who can lead the vast, immeasurable, limitless, and extensive masses of people with unhindered understanding of all the Buddha's teachings, samādhis, dhāraṇ",
        "source": "T13n0411_010:0776a08_33"
    },
    {
        "source_sentence": "菩薩摩訶薩成就此輪，則能安住能引一切虛空眼頂諸三摩地、諸陀羅尼善巧方便大甲冑輪。",
        "translation": "When the bodhisattva Mahāsattva accomplishes this wheel, then he's able to abide and guide all the great armor wheel of skillful means that produces the three samādhis at the top of the sky eye and the dhāraṇī",
        "source": "T13n0411_010:0776a10_34"
    },
    {
        "source_sentence": "住此輪故，發起無邊虛空智日，能永除滅自身四倒無明黑暗。",
        "translation": "Because they abide in this wheel, they give rise to the sun of infinite space wisdom and can permanently remove their own four mistaken darknesses of ignorance.",
        "source": "T13n0411_010:0776a12_35"
    },
    {
        "source_sentence": "一切過去所引未盡惡不善業、無暇惡趣、諸有諸趣、死生諸業，皆能除滅令盡無餘，",
        "translation": "All the bad and unwholesome karmas projected in the past that have not yet been exhausted, the absence of leisurely evil destinies, the states of existence, and the karmas of death and birth can all be removed and extinguis",
        "source": "T13n0411_010:0776a14_36"
    },
    {
        "source_sentence": "不受果報。",
        "translation": "They won't receive the results of their actions.",
        "source": "T13n0411_010:0776a16_37"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_010:0776a16_38"
    },
    {
        "source_sentence": "若菩薩摩訶薩成就此輪，從初發心，一切五欲皆能除斷，超勝一切聲聞、獨覺，",
        "translation": "“If great enlightening beings accomplish this wheel, they can remove all the five desires from the first determination for enlightenment and become free of them, surpassing all listeners and solitary realizers.",
        "source": "T13n0411_010:0776a16_39"
    },
    {
        "source_sentence": "普為一切聲聞、獨覺、作大福田。",
        "translation": "It's a great field of merit for all śrāvakas, pratyekbuddhas, and buddhas.",
        "source": "T13n0411_010:0776a18_40"
    },
    {
        "source_sentence": "一切聲聞、獨覺乘等，皆應供養承事守護。",
        "translation": "All śrāvakas, pratyekbuddhas, and so forth should be offered support and guarded.",
        "source": "T13n0411_010:0776a19_41"
    },
    {
        "source_sentence": "由此輪故，於諸佛法增進自在常無退轉，不復隨順惡友力行。",
        "translation": "Because of this wheel, he's always unregressing in improving his mastery over the Buddha's teachings, and he doesn't follow bad friends' powerful actions again.",
        "source": "T13n0411_010:0776a20_42"
    },
    {
        "source_sentence": "常得不離見一切佛，及諸菩薩、聲聞弟子，不離聞法、不離親近供養眾僧。",
        "translation": "They always attain it and don't part from seeing all the buddhas, bodhisattvas, śrāvakas, and disciples, don't part from hearing the Dharma, don't part from being intimate with them, and make offerings to",
        "source": "T13n0411_010:0776a21_43"
    },
    {
        "source_sentence": "於諸功德心常無厭，乃至菩提恒無間斷，又常不離念佛思惟，乃至夢中亦無暫廢。",
        "translation": "Their minds are always unwearied by virtues, and their minds are always uninterrupted until they reach enlightenment, and they always think of the Buddha without leaving them, even in a dream.",
        "source": "T13n0411_010:0776a23_44"
    },
    {
        "source_sentence": "如是菩薩福德、智慧速疾圓滿，不久安住清淨佛國，證得無上正等菩提。",
        "translation": "Thus, the bodhisattva's virtue and wisdom are quickly perfected, and soon he'll abide in the pure Buddha land and realize unsurpassed perfect enlightenment.",
        "source": "T13n0411_010:0776a25_45"
    },
    {
        "source_sentence": "於彼佛國一切有情，皆受化生色相如佛，煩惱微薄皆住大乘。」",
        "translation": "All sentient beings in those buddha-lands are all subject to the form and characteristics of transformation as buddhas, and their afflictions are weak, so they all abide in the great vehicle.",
        "source": "T13n0411_010:0776a27_46"
    },
    {
        "source_sentence": "「欲成諸法器，　　斷一切煩惱，",
        "translation": "Desiring to become a vessel of the Dharma, They will cut off all afflictions.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　常趣入真空，　　眾事無難作；",
        "translation": "They always go into the void, Entering all things without difficulty.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　為斷諸有縛，　　當勤修等持，",
        "translation": "In order to cut off the bonds of existence, one should diligently cultivate equipoise.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　功德定相應，　　必獲難思慧。",
        "translation": "Concomitant with the concentration of merit, they'll surely attain inconceivable wisdom.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　修靜慮無色，　　滅定真空觀，",
        "translation": "He cultivates formless meditation, extinguishes concentration, and observes the vacuum of emptiness.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　起念佛勝智，　　能盡一切惡；",
        "translation": "Arising from the supreme knowledge of mindfulness of buddhas, They can extinguish all evil.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　有無一切法，　　破以真空觀，",
        "translation": "All things that exist and don’t exist are destroyed by the contemplation of emptiness.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　永離諸惡趣，　　常得見諸佛。",
        "translation": "Being permanently free of bad destinies, they always see the buddhas.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　善修真空觀，　　勤學諸善法，",
        "translation": "He well cultivates the contemplation of emptiness and diligently studies all good qualities.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　供養一切佛，　　速當成佛果；",
        "translation": "Making offerings to all buddhas They will quickly attain buddhahood.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　為有情親友，　　滅除煩惱病，",
        "translation": "For the sake of sentient beings and friends, he extinguishes the afflictions and illnesses.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　速住淨佛國，　　證得大菩提。",
        "translation": "Abiding quickly in the pure buddha land, They’ll realize great enlightenment.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　眾生如佛相，　　遍滿於佛土，",
        "translation": "Sentient beings are like the Buddha’s form, Pervading all buddha-lands.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "　皆趣求佛乘，　　離聲聞獨覺。」",
        "translation": "They all aspire to the Buddha vehicle and part with śrāvakas and pratyekbuddhas.",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "爾時，世尊重顯此義而說頌曰：大乘大集地藏十輪經獲益囑累品第八佛說如是大法門時，",
        "translation": "At that time the Bhagavat, expressing his meaning in this way, spoke these verses: When the Buddha had discoursed thus taught the great doctrine of the ten wheels of the Mahāyāna Abhidharma-mahāvibhāga,",
        "source": "T13n0411_010:0776a28_47"
    },
    {
        "source_sentence": "於眾會中有殑伽沙等菩薩摩訶薩，過去久習念佛思惟，今聞世尊所說念佛修觀方便，",
        "translation": "In the assembly there were bodhisattva mahāsattvas as numerous as grains of sand in the Ganges River, who had long practiced mindfulness of buddhas and contemplated on them for a long time in the past. Now they heard the World-honor",
        "source": "T13n0411_010:0776b16_48"
    },
    {
        "source_sentence": "皆得念佛三摩地門。",
        "translation": "They'll all attain the approach of mindfulness of the Buddha's samādhi.",
        "source": "T13n0411_010:0776b18_49"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞是法已，皆得一切定命華鬘陀羅尼門。",
        "translation": "Furthermore, there are measureless and limitless sentient beings who hear this teaching and attain the dhāraṇī aspect of all the flower garlands of concentration and life after hearing it.",
        "source": "T13n0411_010:0776b19_0"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，皆得一切首楞伽摩電光依止陀羅尼門。",
        "translation": "Furthermore, there are measureless and limitless sentient beings who hear what the Buddha teaches and all attain the dhāraṇī approach of relying on the lightning-power of all Śūraṃgama's teachings.",
        "source": "T13n0411_010:0776b20_1"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，皆得一切法自在轉光明依止順忍。",
        "translation": "Also, there are measureless and limitless sentient beings who hear what the Buddha teaches and attain the forbearance of self-containedly transforming the light of all dharmas as their support.",
        "source": "T13n0411_010:0776b22_2"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，遠塵離垢，於諸法中生淨法眼，得預流果。",
        "translation": "Again, there are measureless and limitless sentient beings who hear what the Buddha teaches, become far removed from dust and dirt, produce pure Dharma eye in all dharmas, and attain the fruit of stream-winner.",
        "source": "T13n0411_010:0776b23_3"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，得一來果。",
        "translation": "Again, there are measureless and limitless sentient beings who hear what the Buddha teaches and attain the fruit of the once-returner.",
        "source": "T13n0411_010:0776b25_4"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，得不還果。",
        "translation": "Again, there are measureless and limitless sentient beings who hear what the Buddha teaches and attain the fruit of nonreturner.",
        "source": "T13n0411_010:0776b26_5"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，皆得最上阿羅漢果。",
        "translation": "Also, there are measureless and limitless sentient beings who hear what the Buddha teaches and all attain the highest arhatship.",
        "source": "T13n0411_010:0776b27_6"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，心求出離三界牢獄，依佛出家趣入正法。",
        "translation": "Again, there are measureless and limitless sentient beings who hear what the Buddha teaches, mentally seeking to escape from the prison of the three realms and relying on the Buddha to leave home and enter the right teaching.",
        "source": "T13n0411_010:0776b28_7"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，盡壽安住十善業道，依聲聞乘發心不退。",
        "translation": "Again, there are measureless and limitless sentient beings who hear what the Buddha teaches, abide in the ten good paths of action for the rest of their lives, rely on the śrāvaka vehicle to arouse their minds and not retreat",
        "source": "T13n0411_010:0776c01_8"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，盡壽安住十善業道，依獨覺乘發心不退。",
        "translation": "Again, there are measureless and limitless sentient beings who hear what the Buddha teaches, abide in the ten good paths of action for the rest of their lives, rely on the solitary realizer vehicle, arouse their minds, and don",
        "source": "T13n0411_010:0776c03_9"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，盡壽安住十善業道，依大乘中發阿耨多羅三藐三菩提心，",
        "translation": "“Furthermore, there are also infinite and boundless sentient beings who, hearing the Buddha’s exhortation, abide for the rest of their entire life in the ten good paths of action. Relying on the Great Vehicle, they",
        "source": "T13n0411_010:0776c04_10"
    },
    {
        "source_sentence": "不復退轉。",
        "translation": "They won't regress again.",
        "source": "T13n0411_010:0776c07_11"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，得世正見，由此正見，除滅一切往惡趣因煩惱惡業，",
        "translation": "“Furthermore, there are also infinite and boundless sentient beings who, hearing what the Buddha teaches, attain right view in the world. Because of right view, they will be able to extinguish all the evil deeds of",
        "source": "T13n0411_010:0776c07_12"
    },
    {
        "source_sentence": "增長一切向善趣因正願善業。",
        "translation": "It increases all the good actions that lead to a good destiny as a result of right vow.",
        "source": "T13n0411_010:0776c09_13"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，皆受三歸，安住近事，近住淨戒，樂供養佛、樂聽聞法、樂奉事僧，",
        "translation": "“Furthermore, there are also infinite and boundless sentient beings who hear the Buddha’s exhortation. They all receive the three kinds of rebirth:",
        "source": "T13n0411_010:0776c10_14"
    },
    {
        "source_sentence": "晝夜精勤，曾無懈廢。",
        "translation": "Day and night he exerted himself diligently without laziness.",
        "source": "T13n0411_010:0776c12_15"
    },
    {
        "source_sentence": "復有無量無邊眾生，聞佛所說，遠離一切邪趣、邪歸、惡意、惡業，於佛法中得決定信，",
        "translation": "“Furthermore, there are also infinite and boundless sentient beings who hear what the Buddha teaches, become free of all wrong paths, wrong refuges, wrong intentions, and wrong actions, and attain certain faith in the Buddha’s",
        "source": "T13n0411_010:0776c12_16"
    },
    {
        "source_sentence": "棄捨家法，清淨出家。",
        "translation": "He renounced the householder’s life and became a pure renunciant.",
        "source": "T13n0411_010:0776c14_17"
    },
    {
        "source_sentence": "爾時，世尊告虛空藏菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the Ākāśagarbha Bodhisattva Mahāsattva, Good sons!",
        "source": "T13n0411_010:0776c16_0"
    },
    {
        "source_sentence": "吾今持此地藏十輪大記法門，付囑汝手，汝當受持，廣令流布。",
        "translation": "Now, I'll take this ten-wheeled dharma-gate of the great memory of the store of earth and entrust it to you. You must accept and uphold it and spread it widely.",
        "source": "T13n0411_010:0776c17_0"
    },
    {
        "source_sentence": "若諸眾生於此法門，有能讀誦、思惟其義、為他解說、住正行者，汝當為彼守護十法，",
        "translation": "If there are sentient beings who can recite this teaching, contemplate its meaning, explain it to others, and abide in correct practice—you should protect ten things for them.",
        "source": "T13n0411_010:0776c18_1"
    },
    {
        "source_sentence": "令於長夜利益安樂。",
        "translation": "It causes them to benefit and bring comfort for a long time.",
        "source": "T13n0411_010:0776c20_2"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T13n0411_010:0776c20_3"
    },
    {
        "source_sentence": "一者、為彼守護，一切財位令無損乏；",
        "translation": "The first is that they protect all their possessions so that they are not in distress.",
        "source": "T13n0411_010:0776c21_4"
    },
    {
        "source_sentence": "二者、為彼守護，一切怨敵令不侵害；",
        "translation": "The second is that they protect others and prevent all enemies from attacking them.",
        "source": "T13n0411_010:0776c22_5"
    },
    {
        "source_sentence": "三者、為彼守護，令捨一切邪見、邪歸、十惡業道；",
        "translation": "The third is to protect others, causing them to abandon all wrong views, wrong refuges, and the ten evil courses of action.",
        "source": "T13n0411_010:0776c23_0"
    },
    {
        "source_sentence": "四者、為彼守護，令免一切身、語、讁罰；",
        "translation": "The fourth is to protect others and enable them to be freed from all bodily, verbal, and sexual misdeeds.",
        "source": "T13n0411_010:0776c24_1"
    },
    {
        "source_sentence": "五者、為彼守護，遮斷一切謗毀輕弄；",
        "translation": "The fifth is that they should protect others and prevent all criticism and slander.",
        "source": "T13n0411_010:0776c24_2"
    },
    {
        "source_sentence": "六者、為彼守護，令於一切軌範、尸羅皆得無犯；",
        "translation": "The sixth is to protect others, enabling them to attain freedom from transgressions in all the codes and disciplines.",
        "source": "T13n0411_010:0776c25_3"
    },
    {
        "source_sentence": "七者、為彼守護，令悉除滅一切非人、四大乖反、非時老病；",
        "translation": "The seventh is to protect them and cause them all to be freed from all kinds of non-human beings, the four great divergences, and untimely old age and sickness.",
        "source": "T13n0411_010:0776c26_4"
    },
    {
        "source_sentence": "八者、為彼守護，不遭一切非時非理災橫夭歿；",
        "translation": "The eighth is that they should be guarded so as not to experience all kinds of untimely and unreasonable disasters, such as sudden death.",
        "source": "T13n0411_010:0776c28_5"
    },
    {
        "source_sentence": "九者、為彼守護，命欲終時，得見一切諸佛色像；",
        "translation": "The ninth was that when they wished to protect them, at the end of their life they would be able to see the forms and images of all buddhas.",
        "source": "T13n0411_010:0776c29_6"
    },
    {
        "source_sentence": "十者、為彼守護，令其終後，往生善趣，利益安樂。",
        "translation": "10. He guards them so that after their death, they'll be reborn in a good destiny for their benefit and happiness.",
        "source": "T13n0411_010:0777a01_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0411_010:0777a02_8"
    },
    {
        "source_sentence": "若諸有情於此法門，有能讀誦、思惟其義、為他解說、住正行者，汝當為彼，",
        "translation": "If there are any sentient beings who can recite this teaching, contemplate its meaning, explain it to others, and abide in correct practice—you should do so for their sake.",
        "source": "T13n0411_010:0777a02_9"
    },
    {
        "source_sentence": "勤加守護如是十法，令於長夜利益安樂。」",
        "translation": "They diligently guard these ten things so that they will bring benefit and happiness for a long time.",
        "source": "T13n0411_010:0777a04_10"
    },
    {
        "source_sentence": "時，虛空藏菩薩摩訶薩白佛言：「唯然，世尊！",
        "translation": "The Ākāśagarbha Bodhisattva Mahāsattva then said to the Buddha, Yes, Bhagavān!",
        "source": "T13n0411_010:0777a05_11"
    },
    {
        "source_sentence": "我當受持如是法門，廣令流布。",
        "translation": "I will preserve this doctrine and spread it widely.",
        "source": "T13n0411_010:0777a06_12"
    },
    {
        "source_sentence": "若諸有情於此法門，有能讀誦、思惟其義、為他解說、住正行者，我當為彼守護十法，",
        "translation": "If there are any sentient beings who can recite this teaching, contemplate its meaning, explain it to others, and abide in correct practice—I will protect ten principles for them.",
        "source": "T13n0411_010:0777a07_0"
    },
    {
        "source_sentence": "令於長夜利益安樂。」",
        "translation": "It will bring benefit and happiness for a long time.",
        "source": "T13n0411_010:0777a09_0"
    },
    {
        "source_sentence": "時，薄伽梵說是經已，於眾會中，虛空藏菩薩摩訶薩、地藏菩薩摩訶薩、金剛藏菩薩摩訶薩、好疑問菩薩摩訶薩、天藏大梵等，",
        "translation": "After the Bhagavān had taught this sūtra, the bodhisattva Mahāsattva Ākāśagarbha, the bodhisattva Mahāsattva Kṣitigarbha, the bodhisattva Mahāsattva Vajragarbha, the",
        "source": "T13n0411_010:0777a10_0"
    },
    {
        "source_sentence": "及諸天、龍、藥叉、健達縛、阿素洛、揭路荼、緊捺洛、莫呼洛伽、人、非人等，",
        "translation": "and the gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, humans, nonhumans, and so forth.",
        "source": "T13n0411_010:0777a12_1"
    },
    {
        "source_sentence": "一切大眾聞佛所說，皆大歡喜信受奉行。",
        "translation": "All the masses heard what the Buddha taught, and they all rejoiced greatly in faith and accepted it and carried it out.",
        "source": "T13n0411_010:0777a14_2"
    },
    {
        "source_sentence": "大乘大集地藏十輪經卷第十",
        "translation": "Dasheng daji zhizang shilun jing, vol. 10",
        "source": "T13n0411_010:0777a16_0"
    },
    {
        "source_sentence": "大乘大集地藏十輪經序",
        "translation": "Preface to the Ten Wheels of the Mahāyāna Dhāraṇī of the Tripiṭaka of the Great Vehicle",
        "source": "T13n0411_010:0777a17_0"
    },
    {
        "source_sentence": "昔者旭照高山天宮，御一乘之駕，流暉原隰鹿苑，轉四諦之輪，雖復發軫分逵而塗無亂轍，",
        "translation": "Formerly the moon shone over the celestial palace of the high mountains and drove the carriages of the One Vehicle. The rivers blazed in the plains and streamed to the Deer Preserve, turning the wheel of the teaching",
        "source": "T13n0411_010:0777a18_0"
    },
    {
        "source_sentence": "一雲普洽而卉木各茂。",
        "translation": "A single cloud spreads everywhere, and the flowers and trees each grow luxuriantly.",
        "source": "T13n0411_010:0777a20_1"
    },
    {
        "source_sentence": "自鵠林變色、慧日寢光，達學電謝以息肩，真人長往而寂慮，且前賢述聖，",
        "translation": "From the time of the bird in the forest, his complexion changed and his sun of wisdom disappeared. He was well versed in Buddhist teachings but he did not practice meditation on the Buddha’s doctrine.",
        "source": "T13n0411_010:0777a20_2"
    },
    {
        "source_sentence": "難令各解，後進孤陋，更異親承。",
        "translation": "It's difficult to make them understand each other, and later they'll advance into the lonely and unenlightened, even more different from their own relatives.",
        "source": "T13n0411_010:0777a22_3"
    },
    {
        "source_sentence": "況乎正法既往、久當像末，定慧與福德異時，醇化與澆風殊運，然則一乘三乘之駕，",
        "translation": "It is even more so when the true-dharma has passed away and will soon perish in the form of a buddha. When concentration, wisdom, and virtue are at odds with each other, alcoholic edification differs from pouring down wind; yet it is",
        "source": "T13n0411_010:0777a23_4"
    },
    {
        "source_sentence": "安可以同其轍哉？",
        "translation": "How can we be the same as their ways?",
        "source": "T13n0411_010:0777a25_0"
    },
    {
        "source_sentence": "若識時來在數藥性勿違，然後可以清沈痼之宿疾、體權實之同歸矣。",
        "translation": "If you know the nature of the number of medicines at the time and don't disobey them, then you can clear away the past illnesses of torpor and affliction and return to the same place in terms of their essence, right and wrong.",
        "source": "T13n0411_010:0777a25_1"
    },
    {
        "source_sentence": "十輪經者，則此土末法之教也。",
        "translation": "The Shilun jing refers to the teaching of the final dharma in this land.",
        "source": "T13n0411_010:0777a27_0"
    },
    {
        "source_sentence": "何以明之？",
        "translation": "How can we explain this?",
        "source": "T13n0411_010:0777a27_1"
    },
    {
        "source_sentence": "佛以末法惡時、去聖浸遠，敗根比之坏器，空見借喻生盲，沈醉五欲類石田之不苗，",
        "translation": "The Buddha, at the time of the evil of the degenerate Dharma, going far from the holy ones, destroyed his faculties and compared himself to a broken vessel. Seeing emptiness as a metaphor for blindness, he became drunk",
        "source": "T13n0411_010:0777a27_2"
    },
    {
        "source_sentence": "放肆十惡似臭身之垢穢。",
        "translation": "They indulge in the ten evil deeds that resemble the filthy and foul-smelling body.",
        "source": "T13n0411_010:0777a29_3"
    },
    {
        "source_sentence": "故此經能濯臭身、開盲目、陶坏器、沃石田，是以菩薩示聲聞之形，象王敬出家之服，",
        "translation": "Because this scripture was able to bathe the foul-smelling body, dispel blindness, pound broken vessels, and fertilize rocky fields. This is why the bodhisattva showed the form of a śrāvaka and the elephant",
        "source": "T13n0411_010:0777b01_4"
    },
    {
        "source_sentence": "以此幢相化彼無慚，顯二事之護持，成三乘之道果。",
        "translation": "With this banner, they'll be transformed into wucan and show the protection of both things, which will become the fruit of the path of the three-vehicle teaching.",
        "source": "T13n0411_010:0777b03_5"
    },
    {
        "source_sentence": "故經曰：「為令此土三寶種姓威德熾盛久住世故。」",
        "translation": "That's why the sūtra says, It's because it causes the three treasured castes of this land to be so powerful and prosperous that they will remain in the world for a long time.",
        "source": "T13n0411_010:0777b04_6"
    },
    {
        "source_sentence": "又曰：「摧滅一切諸眾生類猶如金剛堅固煩惱。」",
        "translation": "He also said, Destroying all sentient beings is like the afflictions of adamantine afflictions.",
        "source": "T13n0411_010:0777b05_7"
    },
    {
        "source_sentence": "然則三寶久住，顯教傳於末法，金剛煩惱，驗障異乎一乘。",
        "translation": "Still, the Three Treasures have been abiding for a long time, revealing that the teaching is transmitted to the final teaching, and the vajra afflictions are different from those of the One Vehicle in terms of their karmic hindrances.",
        "source": "T13n0411_010:0777b06_8"
    },
    {
        "source_sentence": "尋舊經之來，年代蓋久，但譜第遺目，傳人失記。",
        "translation": "The origin of the old scriptures is unknown for a long time but they are preserved in genealogical records and lost by tradition.",
        "source": "T13n0411_010:0777b07_9"
    },
    {
        "source_sentence": "翻譯之主既往，來茲之日罕聞，同我者失魄於真彩，異我者大笑於淡味，",
        "translation": "When the translator of the scripture had gone away, it was rare to hear such a thing on my returning day. Those who agreed with me lost their spirit in regard to true colors and those who disagreed with me laughed loudly at the tastelessness",
        "source": "T13n0411_010:0777b09_10"
    },
    {
        "source_sentence": "謬以千里，能勿悲乎？",
        "translation": "It's a thousand miles away, so why wouldn't you be sad?",
        "source": "T13n0411_010:0777b10_11"
    },
    {
        "source_sentence": "夫極曜文天，或蔽虧於薄霧，至言軌物，時淪滯於廣辯。",
        "translation": "The most brilliant celestial beings may be blinded by the thin mist, but when they speak and guide things, they're sometimes stuck in extensive eloquence.",
        "source": "T13n0411_010:0777b11_12"
    },
    {
        "source_sentence": "鍼石一違，有死生之巨痛。",
        "translation": "A sharp needle and a stone are at odds with each other, and there's the great pain of death and birth.",
        "source": "T13n0411_010:0777b12_13"
    },
    {
        "source_sentence": "纖毫錯學，有升墜之異塗。",
        "translation": "Even the slightest mistaken student has a different destiny of rising and falling.",
        "source": "T13n0411_010:0777b13_14"
    },
    {
        "source_sentence": "其可易乎？",
        "translation": "How could it be easy?",
        "source": "T13n0411_010:0777b13_15"
    },
    {
        "source_sentence": "屬有三藏玄奘法師者，始則學架東朝，末乃訪道西域，輕一生之性命，",
        "translation": "It belonged to the Tripitaka Master Xuanzang, who began his studies in the Eastern Court and ended up visiting the Western Regions of the Way. He despised life for a single lifetime.",
        "source": "T13n0411_010:0777b13_16"
    },
    {
        "source_sentence": "涉數萬之艱難。",
        "translation": "It involves tens of thousands of difficulties.",
        "source": "T13n0411_010:0777b15_17"
    },
    {
        "source_sentence": "果能竭溟渤以索亡珠，蹈龍宮而窮祕藏，吞法流於智海，瓶寫無遺，受道氣於檀林，",
        "translation": "He was able to exhaust the ocean of dharmas in order to retrieve the lost pearl, traveled from the palace of the nāga kings to the secret treasury, and swallowed the flow of the Dharma in the ocean of wisdom.",
        "source": "T13n0411_010:0777b15_18"
    },
    {
        "source_sentence": "香風更馥。",
        "translation": "The fragrant breeze became even more fragrant.",
        "source": "T13n0411_010:0777b17_19"
    },
    {
        "source_sentence": "至於因明三量、聲論八音，莫不究立破之源，窮字轉之本。",
        "translation": "As for the causes and explanations of the three measures and the eight sounds of the sound theory, none of them establish the source of refutation and explain the root of the evolving of the word in terms of exhaustion.",
        "source": "T13n0411_010:0777b18_20"
    },
    {
        "source_sentence": "如來所說、菩薩所傳，已來未來一朝備集。",
        "translation": "The teachings of the Tathāgata and those transmitted by the bodhisattvas will be collected in the future one day.",
        "source": "T13n0411_010:0777b19_21"
    },
    {
        "source_sentence": "昉以薄業不偶真應，幸達聖制亂於未肇，後賢傳燈於既夕，遂使定死餘命冀反魂於法藥，",
        "translation": "Because of his weak karma, he did not match the true response. He was fortunate to have mastered the holy law and suppressed disorder in what had not yet been done. Later [Buddhist] sages transmitted the lamp on the evening after sun",
        "source": "T13n0411_010:0777b20_22"
    },
    {
        "source_sentence": "昏野迷方期還轅於覺道。",
        "translation": "In the darkness of the wilderness, he's lost his way and returns to the path of enlightenment.",
        "source": "T13n0411_010:0777b22_23"
    },
    {
        "source_sentence": "於是染翰操紙杜絕外慮，務詳至教釋彼紛執，疇諮法主重啟梵文。",
        "translation": "He then dyed his writing paper and cut off external thoughts, investigated the disputed attachments in detail, consulted the Dharma lord, and revisited the Sanskrit texts.",
        "source": "T13n0411_010:0777b23_0"
    },
    {
        "source_sentence": "粵以永徽二年歲次辛亥正月乙未，盡其年十二月甲寅翻譯始畢，凡八品十卷。",
        "translation": "In the first month of the second year of the Yonghui period, at the end of the twelfth month in that year, the transla­ tion began with eight fascicles and ten fascicles.",
        "source": "T13n0411_010:0777b24_1"
    },
    {
        "source_sentence": "以今所翻比諸舊本，舊本已有今更詳明，舊本所無斯文具載。",
        "translation": "Because the present translation compares with the old versions, the old version already exists and is now further explained in detail, but there's no such text in the old version.",
        "source": "T13n0411_010:0777b26_2"
    },
    {
        "source_sentence": "於是處座伉談者，響法雷而吐辯，靜慮通微者，鏡玄波而照心；",
        "translation": "Those who sat on the seat and engaged in discourse at that place echoed the thunder of the Teaching and spoke eloquently, while those who were absorbed in meditation had their minds illumined by a mysterious wave reflect",
        "source": "T13n0411_010:0777b27_3"
    },
    {
        "source_sentence": "頂火暴腹之徒，戢螢暉於慧日，喜足謙懷之侶，騰高節於清風矣。",
        "translation": "The fire on the top of their heads and the fierce hunger in their abdomen are like flames, while the lion’s roar is like the bright light of the sun of wisdom. Those who are delighted with legs and humble mind",
        "source": "T13n0411_010:0777b29_4"
    },
    {
        "source_sentence": "前佛既往，後佛未興，庶此教長懸永濟來者。",
        "translation": "Since the former Buddha had departed and the latter Buddha hadn't yet arisen, let's leave this teaching as long as it lasts to save those who come.",
        "source": "T13n0411_010:0777c01_5"
    },
    {
        "source_sentence": "弘道之士，如何勿思！",
        "translation": "How can a man of the great Way not think about it?",
        "source": "T13n0411_010:0777c02_6"
    },
    {
        "source_sentence": "大乘大集地藏十輪經卷十",
        "translation": "Dasheng daji zhizang shilun jing, vol. 10",
        "source": "T13n0411_010:0777c04_0"
    }
]