[
    {
        "source_sentence": "大方等大集經卷第四十",
        "translation": "*Mahāmegha-sūtra, Volume 40",
        "source": "T13n0397_040:0266c02_0"
    },
    {
        "source_sentence": "隋天竺三藏那連提耶舍譯",
        "translation": "Translated by the Sui translation of the Tripiṭaka of India, translated by Nārayaśas",
        "source": "T13n0397_040:0266c04_0"
    },
    {
        "source_sentence": "◎日藏分護持品第六",
        "translation": "The Sixth Chapter on the Protection of the Sun-Store Part",
        "source": "T13n0397_040:0266c05_0"
    },
    {
        "source_sentence": "爾時，一切諸天大王并其眷屬、一切龍王、一切夜叉王、阿修羅王、迦樓羅王、緊陀羅王、摩睺羅伽王、薜荔多王、毘舍遮王、富單那王，",
        "translation": "At the time, all the great celestial kings and their retinues, all the dragon kings, all the yakṣa kings, asura kings, garuḍa kings, kiṃnara kings, mahoraga kings,",
        "source": "T13n0397_040:0266c06_0"
    },
    {
        "source_sentence": "乃至迦吒富單那等一切諸王，各并眷屬禮拜於佛，同心合掌，作如是言：「世尊！",
        "translation": "All the kings of Kāṭaputra and Pūrṇa, each with their retinues, paid homage to the Buddha, joined their palms in unison, said, Bhagavān!",
        "source": "T13n0397_040:0266c09_0"
    },
    {
        "source_sentence": "我等從今在在處處，若有比丘或比丘尼、諸優婆塞及優婆夷，但有信心若男若女，",
        "translation": "From now on, wherever we may be, if there are any monks, nuns, laymen, or laywomen who believe in either male or female.",
        "source": "T13n0397_040:0266c10_1"
    },
    {
        "source_sentence": "能作如是念不淨觀寂滅三昧，如前佛說善根因緣得攝心住者，我等一切天諸眷屬，",
        "translation": "Those who can create this kind of mindful and impure contemplation of cessation samādhi, as the Buddha said earlier, by the causes and conditions of good roots they'll attain the abode of collecting their minds, and we all the god",
        "source": "T13n0397_040:0266c12_2"
    },
    {
        "source_sentence": "乃至清淨信心之人，或男或女，常當救濟猶如導師，令彼身心及其眷屬為作供養，",
        "translation": "Even those of pure faith, whether male or female, should always be rescued like a guide, causing their bodies and minds and their retinues to make offerings for them.",
        "source": "T13n0397_040:0266c14_3"
    },
    {
        "source_sentence": "衣食、床鋪、臥具、湯藥、種種資生所須皆與，如是具足令其安隱，更不愁於一十五種濁惡之事。",
        "translation": "He gives them whatever they need for clothing, food, beds, bedding, bedding, bathing water and medicine, and various necessities, thus providing them with such things to make them comfortable, and he doesn't worry about the fifteen kinds",
        "source": "T13n0397_040:0266c16_4"
    },
    {
        "source_sentence": "設復有者，我等於中常共加護。",
        "translation": "Suppose there's another one, and we'll always guard it together.",
        "source": "T13n0397_040:0266c18_5"
    },
    {
        "source_sentence": "何者名為十五濁心？",
        "translation": "What are these called the fifteen turbid states of mind?",
        "source": "T13n0397_040:0266c19_6"
    },
    {
        "source_sentence": "所謂或以石撩，或以杖打，或以刀斫，或以槊貫，或毒藥中，或崖上擲，",
        "translation": "They may pull it with a stone, beat it with a stick, slice it with a knife, penetrate it with a spear, throw it into poisonous medicine, or tosss it up a cliff.",
        "source": "T13n0397_040:0266c19_7"
    },
    {
        "source_sentence": "或復惡人，或復不信，或四大動，我為作護；",
        "translation": "Again, I will protect those who are wicked, those who do not believe in doctrine, and the four great elements of the body.",
        "source": "T13n0397_040:0266c21_8"
    },
    {
        "source_sentence": "或以惡心送彼人所好飲食湯藥者，我為作護；",
        "translation": "I also provide protection for those who with evil intentions give them good food, drink, warm water, and medicine.",
        "source": "T13n0397_040:0266c22_9"
    },
    {
        "source_sentence": "貪瞋、妬嫉、兩舌、惡口，如是惡事欲相加者，我為作護；",
        "translation": "To those who are attached to greed, hatred, jealousy, hypocrisy, double talk, and harsh words—these kinds of evil deeds I want to protect.",
        "source": "T13n0397_040:0266c23_10"
    },
    {
        "source_sentence": "或有惡人用濁惡心，以諸衣鉢、床臥、鋪具、病患湯藥常作檀越；",
        "translation": "“Sometimes there are evil people who, out of a defiled mind, always make donations with their robes, bowls, beds, bedding, and medicine for the ill.",
        "source": "T13n0397_040:0266c24_11"
    },
    {
        "source_sentence": "或勸化他，或自親舊為供養者，彼諸惡事我為作護；",
        "translation": "I am the protector of those who do evil deeds, whether they are encouraging others or honoring their own relatives and friends.",
        "source": "T13n0397_040:0266c25_12"
    },
    {
        "source_sentence": "或復怨家，或復惡鬼，如是等惡我為作護；",
        "translation": "They may be protected by enemies, or by ghosts, or by evil spirits. Such evil selves as these I will protect them.",
        "source": "T13n0397_040:0266c27_13"
    },
    {
        "source_sentence": "或毒中護，或惡天子，或內國土，或外國土，如是賊起，我為作護。",
        "translation": "Some are protected by poison, some by evil deities, some in their own land, some in foreign lands; such thieves arise and I protect them.",
        "source": "T13n0397_040:0266c28_0"
    },
    {
        "source_sentence": "此十五種濁惡之事。",
        "translation": "These are the fifteen kinds of defiled and bad things.",
        "source": "T13n0397_040:0266c29_1"
    },
    {
        "source_sentence": "「或比丘，或比丘尼，或優婆塞，或優婆夷，或餘信心男子、女人，或今現在或復當來，",
        "translation": "“Some monks, some nuns, some laymen, some laymen, some laywomen, some other faithful men and women, either now or in the future.",
        "source": "T13n0397_040:0266c29_2"
    },
    {
        "source_sentence": "乃至劫盡末法世時。",
        "translation": "It's until the end of the eon at the end of the Dharma world.",
        "source": "T13n0397_040:0267a02_3"
    },
    {
        "source_sentence": "何者名為末法世時？",
        "translation": "What's called the time of the final age of the Dharma?",
        "source": "T13n0397_040:0267a03_4"
    },
    {
        "source_sentence": "謂讀誦人無不依於波羅提木叉道中行。",
        "translation": "It means that a person who recites it doesn't rely on the path in the prātimokṣa path.",
        "source": "T13n0397_040:0267a03_5"
    },
    {
        "source_sentence": "若不坐禪則不能得於三摩提，乃至不得第四之果，乃至不得寂滅三昧，",
        "translation": "If he doesn’t sit in meditation, he won’t attain concentration or even the fourth realization, or even the concentration of cessation.",
        "source": "T13n0397_040:0267a04_6"
    },
    {
        "source_sentence": "是則名為末法世時。",
        "translation": "This is called the time of the final Dharma world.",
        "source": "T13n0397_040:0267a06_7"
    },
    {
        "source_sentence": "若如上說，初夜後夜不曾睡眠，讀誦是經或坐禪定，如是住者，彼諸眷屬、比丘、比丘尼、優婆塞、優婆夷，",
        "translation": "If someone, as explained above, doesn’t sleep during the first watch of the night or in the latter watch of the night, recites this sutra or sits in meditation, and thus abides, those members of the sangha, monks, nuns,",
        "source": "T13n0397_040:0267a06_8"
    },
    {
        "source_sentence": "乃至信心或男或女、一切眷屬乃至住處，或復聚落都邑國城，或阿蘭若處，",
        "translation": "It's even a place of faith for men, women, all their followers, or where they live, or another village, town, country, city, or a forest.",
        "source": "T13n0397_040:0267a09_9"
    },
    {
        "source_sentence": "或聚落主家，隨所在處有此十五濁者，我盡救濟為作擁護，令是諸惡一切悉除。",
        "translation": "Or if there are these fifteen turbidities in the homes of village chiefs, wherever they are, I'll rescue them and protect them so that all those bad things will be removed.",
        "source": "T13n0397_040:0267a10_10"
    },
    {
        "source_sentence": "「於何聚落有福德人常住之處？",
        "translation": "“In which village does a virtuous person always live?",
        "source": "T13n0397_040:0267a12_11"
    },
    {
        "source_sentence": "或多人住或一人住，乃至復有一日一夜修福德者，乃至一日一夜所住處者，",
        "translation": "“Sometimes there are many people staying, sometimes one person stays. Up to when there are further days and nights of cultivation of virtue, up to where they live for a day and a night:",
        "source": "T13n0397_040:0267a13_12"
    },
    {
        "source_sentence": "或復城邑或聚落家，我皆救濟為作護助，不令其人經於惡事，無問一切諸檀越家，",
        "translation": "In cities, towns, villages, and houses I rescue and protect them so that they do not experience misfortune. Without asking any of the donors’ households for anything.",
        "source": "T13n0397_040:0267a15_13"
    },
    {
        "source_sentence": "或復剎利，或婆羅門、毘舍、首陀，或男，或女、小男、小女，一切救濟常為守護不令入惡。",
        "translation": "Again, some kṣatriyas, some brāhmaṇas, viśeṣas, and śūdras, some men, some women, young men, and girls, are always protected by all the aids so that they won't enter evil",
        "source": "T13n0397_040:0267a17_14"
    },
    {
        "source_sentence": "若有如是修福德者身心精進，若有人供養禮拜恭敬種種供給，或為造房或大寺舍，",
        "translation": "If someone cultivates virtue in this way, they'll have physical and mental effort, and if someone makes offerings to them, venerates them, honors them, and makes various offerings, building houses or large temples for them.",
        "source": "T13n0397_040:0267a19_15"
    },
    {
        "source_sentence": "或林或苑或作衣裳，食飲所須坐臥處所，或復病患湯藥針灸種種醫療，",
        "translation": "Whether in a forest or a park, they may make clothing, eat and drink what’s necessary for sitting and lying down, or treat illnesses with hot water, medicine, needles, and various treatments.",
        "source": "T13n0397_040:0267a21_16"
    },
    {
        "source_sentence": "如是檀越，我等如是十五濁中一切悉護。",
        "translation": "Thus, donors, we thus completely protect all of these fifteen turbidities.",
        "source": "T13n0397_040:0267a22_17"
    },
    {
        "source_sentence": "「若有胎藏妊娠女人，供養如是福德人時，我等護持無時暫捨。",
        "translation": "If there's a woman in the womb who's pregnant and makes offerings to such a person of virtue, we will guard and maintain them at no time for a moment.",
        "source": "T13n0397_040:0267a23_18"
    },
    {
        "source_sentence": "設諸惡人及以惡鬼欲加惡者，迴彼惡心悉令歡喜，如是兒女在在處處修福德者、念善根者為他愛敬，",
        "translation": "Suppose bad people or evil spirits want to add evil, and they turn their bad thoughts around and make them all rejoice. Such children and women cultivate virtue everywhere and those who are mindful of good roots are liked by others.",
        "source": "T13n0397_040:0267a25_19"
    },
    {
        "source_sentence": "或餘眾生勸助讚美，或復家人稱說其名，或呪結索擁護眾生，或教福德或教捨惡，",
        "translation": "They may be encouraged by other sentient beings to praise them, or they may be called by their names by their family members, or they may cast spells and fetters to protect sentient beings, or they may teach merit or abandon evil.",
        "source": "T13n0397_040:0267a27_20"
    },
    {
        "source_sentence": "我等於彼如是眾生，十五濁中常親護持，諸惡鬼神不得其便。",
        "translation": "Among those sentient beings like this, we'll always be closely guarded by the fifteen turbidities, and bad spirits won't get an advantage over them.",
        "source": "T13n0397_040:0267a29_21"
    },
    {
        "source_sentence": "「若有如是修福德者，或人非人能信其語如教而行，如是一切我等亦護。",
        "translation": "“If someone cultivates virtue in this way, or if they can believe their words and practice them as they are taught, then all of us will also protect them.",
        "source": "T13n0397_040:0267b01_22"
    },
    {
        "source_sentence": "若有惡人，於彼行者修福人中，或瞋，或罵，或欲加惡或生障礙者，如是等輩諸惡眾生，",
        "translation": "If there are bad people who cultivate goodness among those practitioners, or become angry or ridicule them, or want to add evil or create obstacles, then such a group of bad sentient beings",
        "source": "T13n0397_040:0267b03_23"
    },
    {
        "source_sentence": "我等不護是惡眾生。",
        "translation": "We won't protect these bad sentient beings.",
        "source": "T13n0397_040:0267b05_24"
    },
    {
        "source_sentence": "「十五濁事不得護者名字云何？",
        "translation": "What are the names of the fifteen turbid things that can't be guarded?",
        "source": "T13n0397_040:0267b05_25"
    },
    {
        "source_sentence": "十五濁者：第一惡患；",
        "translation": "The fifteenth defilement is the first evil danger.",
        "source": "T13n0397_040:0267b06_26"
    },
    {
        "source_sentence": "第二失於自在；",
        "translation": "The second is the loss of sovereignty.",
        "source": "T13n0397_040:0267b07_0"
    },
    {
        "source_sentence": "第三散失種種資生；",
        "translation": "The third is the dispersal of various necessities.",
        "source": "T13n0397_040:0267b07_1"
    },
    {
        "source_sentence": "第四身中四肢種種割截，或眼或耳口鼻手足，或復斫頭；",
        "translation": "The fourth was a body in which the four limbs of the body were variously cut off, some with eyes, some with ears, some with ears, some with mouth, nose, hands, feet, or some with coarse hair.",
        "source": "T13n0397_040:0267b07_2"
    },
    {
        "source_sentence": "第五失於所愛妻子及諸眷屬；",
        "translation": "The fifth is the loss of beloved wives, children, and their attendants.",
        "source": "T13n0397_040:0267b09_3"
    },
    {
        "source_sentence": "第六失於官位；",
        "translation": "The sixth is lost in official positions.",
        "source": "T13n0397_040:0267b09_4"
    },
    {
        "source_sentence": "第七失居家；",
        "translation": "The seventh is the failure to live at home.",
        "source": "T13n0397_040:0267b10_5"
    },
    {
        "source_sentence": "第八為諸怨家所侵；",
        "translation": "The eighth is attacked by enemies.",
        "source": "T13n0397_040:0267b10_6"
    },
    {
        "source_sentence": "第九心常憂愁；",
        "translation": "The ninth mental state is always grieved.",
        "source": "T13n0397_040:0267b10_7"
    },
    {
        "source_sentence": "第十瞋於剎利心常行惡；",
        "translation": "The tenth is an anger directed at the kṣatriyas, always doing evil in their minds.",
        "source": "T13n0397_040:0267b11_8"
    },
    {
        "source_sentence": "第十一邦邑國城眾生濁惡；",
        "translation": "Eleventh, the cities and towns are turbid and evil to all beings.",
        "source": "T13n0397_040:0267b11_9"
    },
    {
        "source_sentence": "第十二諸偷盜來失種種物；",
        "translation": "The twelfth is that various things are stolen and lost by thieves.",
        "source": "T13n0397_040:0267b12_10"
    },
    {
        "source_sentence": "第十三自家婦女恒相鬪諍；",
        "translation": "Thirteenth, the women of their own households always fight with each other.",
        "source": "T13n0397_040:0267b13_11"
    },
    {
        "source_sentence": "第十四國土賊盜他國賊來；",
        "translation": "Thieves from the fourteenth land stole from thieves of other lands.",
        "source": "T13n0397_040:0267b13_12"
    },
    {
        "source_sentence": "第十五短命速死。",
        "translation": "The fifteenth is a short life that quickly dies.",
        "source": "T13n0397_040:0267b14_13"
    },
    {
        "source_sentence": "若惡眾生有如是十五種事，我等不護。」",
        "translation": "If bad sentient beings have these fifteen kinds of things, we won't protect them.",
        "source": "T13n0397_040:0267b14_14"
    },
    {
        "source_sentence": "富伽羅等言：「若復有人雖修福業不受善語恒起惡瞋，欲為造福德者作諸惡事，",
        "translation": "Pukkuṭaka and others said, Suppose another person cultivates good actions but doesn't accept good words and constantly becomes angry because they want to do bad things for someone who creates merit.",
        "source": "T13n0397_040:0267b15_15"
    },
    {
        "source_sentence": "種種福中為作障礙。",
        "translation": "In various kinds of merit, it's an obstruction.",
        "source": "T13n0397_040:0267b17_16"
    },
    {
        "source_sentence": "若有如是諸惡眾生來歸於我，望呪術中得種種力，如是呪中種種法用雖具足有，",
        "translation": "If there are bad sentient beings like this who come to me and rely on various kinds of magical spells to attain various kinds of powers, such magical spells will have all kinds of dharmas and functions, even though they",
        "source": "T13n0397_040:0267b18_17"
    },
    {
        "source_sentence": "我等於彼如是眾生不加不護不與其力亦不救濟。",
        "translation": "We thus don't give these sentient beings our support, protect them, share their strength, and rescue them.",
        "source": "T13n0397_040:0267b20_0"
    },
    {
        "source_sentence": "若彼眾生意欲規求望得如是如是之物，我亦不與。",
        "translation": "If those businessmen want to regulate and hope to obtain such-and-such things, I won't give them.",
        "source": "T13n0397_040:0267b21_1"
    },
    {
        "source_sentence": "若有眾生於常修常命福德之人，生瞋作惡種種障礙者，如是我等亦如上說。",
        "translation": "If there are sentient beings who become angry and create various kinds of hindrances for those who always cultivate the merit of eternal life, then we're likewise as explained above.",
        "source": "T13n0397_040:0267b22_2"
    },
    {
        "source_sentence": "或復今世及未來中，能依此法憶念修行；",
        "translation": "In the present life or in the future, they will be able to remember and practice these teachings.",
        "source": "T13n0397_040:0267b24_3"
    },
    {
        "source_sentence": "及法欲盡，常有諸天、龍神，乃至迦吒富單那等，惡心瞋忿無有慈悲，",
        "translation": "And when the Dharma is about to end, there will always be gods, dragons, spirits, and so forth, including Kāṭaputra and Kauṇḍinya, with bad intentions, anger, and wrath, and no compassion.",
        "source": "T13n0397_040:0267b25_4"
    },
    {
        "source_sentence": "不樂當來妙好之身，不畏三塗惡道果報。",
        "translation": "They don't delight in the marvelous body of the future, and they don't fear the results of the bad destinies of the three destinies.",
        "source": "T13n0397_040:0267b26_5"
    },
    {
        "source_sentence": "若有如是造福德人，樂阿蘭若種諸善根，或住塜間，或復樹下，或在寺舍，",
        "translation": "Suppose there’s a person who has created merit in this way, delighting in the āraṇya and planting roots of virtue; sometimes he stays among trees, sometimes under tree stumps, sometimes in temple buildings.",
        "source": "T13n0397_040:0267b27_6"
    },
    {
        "source_sentence": "或屍陀林行住處所，福德之人悉如上說，天、龍乃至迦吒富單那惡見惡心，",
        "translation": "Or wherever they walk and live in the cemetery, all the virtuous people are as described above. Gods, dragons, up to Kāṭapūrṇa have bad views and bad thoughts,",
        "source": "T13n0397_040:0267b29_7"
    },
    {
        "source_sentence": "此福德之人是處住止，或身心濁或奪精氣，或被行人供養檀越，我諸天、龍乃至迦吒富單那等，",
        "translation": "These people of great virtue abide in these places, either because their bodies and minds are turbid or deprived of vitality, or because they're offered support by practitioners like me, gods, dragons, nāgas, kaṭ",
        "source": "T13n0397_040:0267c01_8"
    },
    {
        "source_sentence": "離慈悲心不知恩報，於當來生不怖惡道，垢濁身心奪其精氣，唯除過去極重惡業，",
        "translation": "Being dispassionate and compassionate, they do not know the repayment of their kindness. They will be born in the future in a fearless realm of rebirth. Their defiled bodies and minds snatch their vitality",
        "source": "T13n0397_040:0267c04_9"
    },
    {
        "source_sentence": "此惡業中非可得護。",
        "translation": "Among these bad actions, they can't be guarded.",
        "source": "T13n0397_040:0267c06_10"
    },
    {
        "source_sentence": "「若我天、龍乃至迦吒富單那等應可得護而不護者，現世則為欺誑一切三世諸佛，",
        "translation": "“If we gods, dragons, nāgas, and even kaṭapūrṇas could be disciplined or not disciplined, then in the present life we would deceive all the buddhas of the three times.",
        "source": "T13n0397_040:0267c06_11"
    },
    {
        "source_sentence": "於流轉中不見羅漢及辟支佛，常令我身不成福器不得涅槃。」",
        "translation": "In the midst of transmigration, they don't see arhats or pratyekabuddhas, and they always cause my body to become a vessel of merit and not attain nirvāṇa.",
        "source": "T13n0397_040:0267c08_12"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T13n0397_040:0267c09_13"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_040:0267c10_14"
    },
    {
        "source_sentence": "汝能如是發於此心，亦如一切三世諸佛過去世時修行，無異紹三寶種竪立法幢光照法母，",
        "translation": "You can give rise to this determination in the same way as all the buddhas of past, present, and future practices of past ages have been practiced by all the buddhas of past, present, and future. They are no different from the enlightening",
        "source": "T13n0397_040:0267c10_15"
    },
    {
        "source_sentence": "汝等如是則為供養一切三世十方諸佛。",
        "translation": "You are thus making offerings to all the buddhas of the three times and ten directions.",
        "source": "T13n0397_040:0267c12_16"
    },
    {
        "source_sentence": "汝善男子！",
        "translation": "You, good man!",
        "source": "T13n0397_040:0267c13_17"
    },
    {
        "source_sentence": "或男、或女能作如是勤精進心，於正法中好守護者，如是法行富伽羅故，",
        "translation": "If a man or woman can make such an intense effort and likes to guard the true teaching, it's because they thus practice the teaching as a practitioner of purgatory.",
        "source": "T13n0397_040:0267c13_18"
    },
    {
        "source_sentence": "常護常念常供給足。",
        "translation": "He always guards, always thinks, and always provides for them.",
        "source": "T13n0397_040:0267c15_19"
    },
    {
        "source_sentence": "如是眾生於流轉中，常得尊貴和合眷屬，常受安樂不經辛苦，乃至速成阿耨多羅三藐三菩提道。",
        "translation": "Such sentient beings always attain noble, harmonious retinues in their transmigration, always experience peace and comfort without suffering, and quickly achieve the path of unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0397_040:0267c15_20"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_040:0267c18_21"
    },
    {
        "source_sentence": "汝等求樂不求於苦，是故應當常勤精進，作諸善根。」",
        "translation": "You seek happiness and don't seek suffering; therefore, you should always diligently exert effort to create good roots.",
        "source": "T13n0397_040:0267c18_22"
    },
    {
        "source_sentence": "諸天等言：「善哉，善哉！",
        "translation": "The gods and others said, Good, good!",
        "source": "T13n0397_040:0267c19_23"
    },
    {
        "source_sentence": "我從今日如是修習如是發心。」",
        "translation": "From today, I thus cultivate and thus arouse my mind.",
        "source": "T13n0397_040:0267c19_24"
    },
    {
        "source_sentence": "爾時此娑婆界，有於惡心諸餓鬼等，常仰食噉一切眾生精氣血肉以為生活。",
        "translation": "At the time, there were evil-minded hungry ghosts in this sahā realm who always looked up to all sentient beings' vitality, blood, and flesh for their livelihood.",
        "source": "T13n0397_040:0267c20_25"
    },
    {
        "source_sentence": "如是鬼等無量阿僧祇，同白佛言：「世尊！",
        "translation": "Innumerable incalculable ghosts and others like this all said to the Buddha, Bhagavān!",
        "source": "T13n0397_040:0267c22_26"
    },
    {
        "source_sentence": "我等惡業罪報所招，常噉於人肉血精氣以活性命。",
        "translation": "As a result of the results of bad actions and sins, we always burned human flesh, blood, and vital energy to live.",
        "source": "T13n0397_040:0267c23_27"
    },
    {
        "source_sentence": "今日發心入佛法住，為佛弟子，更不造惡不生惡念。",
        "translation": "Today, he arouses the intention to enter the Buddha's abode of entering the Buddha's teaching and becomes a disciple of the Buddha, not creating bad thoughts or bad thoughts.",
        "source": "T13n0397_040:0267c24_28"
    },
    {
        "source_sentence": "若佛弟子如佛今說不淨觀法，常如是修如是習行一種無異，若我不如富伽羅心所在念者，",
        "translation": "If a disciple of the Buddha, just as the Buddha now teaches the Dharma of contemplation on impurity, always thus cultivates and thus practices these kinds of accumulations one-by-one without distinction, then if I don't",
        "source": "T13n0397_040:0267c25_29"
    },
    {
        "source_sentence": "令於我眼黑暗常盲，一切四肢不能動轉，又不具足身中五根。",
        "translation": "They cause my eyes to be always blind in darkness, and all four limbs can't move or turn, and they don't have the five faculties in their body.",
        "source": "T13n0397_040:0267c27_30"
    },
    {
        "source_sentence": "我等亦如富伽羅，護此福德人并其施主，造立寺舍房室樹林園菀浴池，",
        "translation": "We also, Pukkuṭika, protecting these blessed people and their benefactors, built temples, dwellings, houses, forests, parks, ponds, and bathing ponds.",
        "source": "T13n0397_040:0267c29_31"
    },
    {
        "source_sentence": "衣鉢、飲食、臥具、倚床、湯藥一切所須，如是檀越我等亦護。」",
        "translation": "All the necessities for clothing, bowls, food and drink, bedding, reclining beds, and medicine are thus protected by us as donors.",
        "source": "T13n0397_040:0268a01_32"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T13n0397_040:0268a03_33"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_040:0268a03_34"
    },
    {
        "source_sentence": "汝好發心，常當如是莫令放逸。」",
        "translation": "You should always give rise to good intentions like this, so don't let them become careless.",
        "source": "T13n0397_040:0268a03_35"
    },
    {
        "source_sentence": "爾時，牢固地天從座而起作，如是言：「世尊！",
        "translation": "It was then that the firm ground god rose from his seat and made this statement, saying, Bhagavān!",
        "source": "T13n0397_040:0268a05_0"
    },
    {
        "source_sentence": "若佛弟子常攝五根，如佛今說不淨觀法，如是繫念至心行時，我等地天為此行者，",
        "translation": "If a disciple of the Buddha always embraces the five faculties, just as the Buddha now explains the method of contemplation on impurity, and thus practices with mindfulness and zeal, I and other gods like me will do so.",
        "source": "T13n0397_040:0268a05_1"
    },
    {
        "source_sentence": "常出地味滋潤，彼人令其身中增益壽命，是地精氣充溢因緣，行者身中得色、得力、得念、得喜、得精進、得大智慧。」",
        "translation": "When he always produces the taste of the earth and nourishes it, that person causes his body to increase its life span, which is the cause for the ground's vitality being overflowing, and practitioners attain form, strength, mindfulness, joy",
        "source": "T13n0397_040:0268a07_2"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T13n0397_040:0268a10_3"
    },
    {
        "source_sentence": "汝大檀越能發是心，真是佛子，從佛口生從法化生，與如是食益於彼身，",
        "translation": "You, great donor, are really the heirs of the buddhas. Arisen from the Buddha’s mouth and being reborn by means of the Dharma, you give them food like this to increase their physical well-being.",
        "source": "T13n0397_040:0268a10_4"
    },
    {
        "source_sentence": "此福因緣速於大乘成就滿足。」",
        "translation": "These meritorious causes and conditions will quickly fulfill the accomplishment of the great vehicle.",
        "source": "T13n0397_040:0268a12_5"
    },
    {
        "source_sentence": "爾時，眾中有大德天，復從座起前白佛言：「世尊！",
        "translation": "At the time, there was a god of great virtue in the crowd who rose again from his seat and said to the Buddha, Bhagavān!",
        "source": "T13n0397_040:0268a14_0"
    },
    {
        "source_sentence": "若有如是法行比丘佛弟子等，彼諸檀越或以種種金銀寶珠、種種資生、種種穀米具足供給。",
        "translation": "If there are monks, buddha disciples, and so forth who practice the Dharma in this way, those donors may make offerings of various kinds of gold, silver, precious pearls, various necessities, and various grains and rice",
        "source": "T13n0397_040:0268a15_1"
    },
    {
        "source_sentence": "若諸弟子如佛所說不淨觀法，乃至寂滅三昧空門如是繫念，從於初夜至中後夜坐臥行立，",
        "translation": "If the disciples thus concentrate their thoughts on the contemplation of impurity as taught by the Buddha, up to the concentration of extinction through the gate of emptiness in the samādhi of tranquility, from the first watch of the night until",
        "source": "T13n0397_040:0268a17_2"
    },
    {
        "source_sentence": "如是念法心無外緣。",
        "translation": "Thus, the mind of mindfulness of dharmas has no external conditions.",
        "source": "T13n0397_040:0268a19_3"
    },
    {
        "source_sentence": "彼諸檀越為營寺舍，或造一屋、或一樹林、或復衣食坐臥床鋪，病患湯藥種種資生常供給之。",
        "translation": "Those donors built a house, a tree forest, or other clothing, food, seats, beds, and bedding for the monastery's dwelling, and provided them with various necessities for sickness, bathing, and medicine.",
        "source": "T13n0397_040:0268a19_4"
    },
    {
        "source_sentence": "彼得如是無乏少，己身得安隱無有憂愁，心常歡喜得好福田成就法器。",
        "translation": "Peter thus has no lack, attains peace and comfort for himself without sorrow, always rejoicing in his heart to attain a good field of merit that accomplishes the Dharma vessel.",
        "source": "T13n0397_040:0268a21_5"
    },
    {
        "source_sentence": "如是施已，當來之世得大果報，深心樂法不生惡道不造惡法。",
        "translation": "After giving in this way, they'll attain great rewards in future lives, profoundly delight in the Dharma and won't be born in a bad path or create bad qualities.",
        "source": "T13n0397_040:0268a23_6"
    },
    {
        "source_sentence": "我如是護，彼人即得修慈悲心，如是種種勝妙善根增長不減。」",
        "translation": "I thus protect them, and they then attain the mind of cultivating kindness and compassion, thus increasing and not decreasing their various excellent good roots.",
        "source": "T13n0397_040:0268a24_7"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T13n0397_040:0268a26_8"
    },
    {
        "source_sentence": "大檀越！",
        "translation": "Great donor!",
        "source": "T13n0397_040:0268a26_9"
    },
    {
        "source_sentence": "此是汝等精進之心，於大乘中速能增長福德之力。」",
        "translation": "This is the mind of your effort that quickly increases the power of merit in the great vehicle.",
        "source": "T13n0397_040:0268a26_10"
    },
    {
        "source_sentence": "爾時，眾中金剛力士復白佛言：「世尊如來說此大集經已，諸大檀越并眷屬眾，",
        "translation": "It was then that the Vajrapāṇi warrior among the assembly again said to the Buddha, Bhagavān, after the Tathāgata had taught this great collection of scriptures, the great donors and their retinues",
        "source": "T13n0397_040:0268a28_11"
    },
    {
        "source_sentence": "各各發心護持佛法利益眾生。",
        "translation": "Each one of them arouses the intention to protect the Buddha's teaching and benefit sentient beings.",
        "source": "T13n0397_040:0268b01_0"
    },
    {
        "source_sentence": "彼因緣故，此娑婆界佛剎之中，法母照曜增進光明。」",
        "translation": "Because of those causes and conditions, the Dharma mother shines brightly and increases in light here in the Buddha's buddha-stage in the sahā realm.",
        "source": "T13n0397_040:0268b01_1"
    },
    {
        "source_sentence": "爾時，彌勒菩薩摩訶薩為欲利益於未來故，即於眾中問金剛力士言：「善男子！",
        "translation": "At that point, Maitreya's bodhisattva Mahāsattva wanted to benefit the future, so he asked the Vajra warrior among the crowd, Good man!",
        "source": "T13n0397_040:0268b02_2"
    },
    {
        "source_sentence": "何者為虛空之法？",
        "translation": "What's the teaching of space?",
        "source": "T13n0397_040:0268b04_3"
    },
    {
        "source_sentence": "此可見不？",
        "translation": "Is this visible?",
        "source": "T13n0397_040:0268b05_4"
    },
    {
        "source_sentence": "若不可見此事云何？」",
        "translation": "What happens if you can't see this thing?",
        "source": "T13n0397_040:0268b05_5"
    },
    {
        "source_sentence": "又復問言：「何者名為諸法和合？」",
        "translation": "Again, he asked, What's called the convergence of dharmas?",
        "source": "T13n0397_040:0268b05_6"
    },
    {
        "source_sentence": "金剛力士報彌勒言：「實際之岸不可見故，此和合法亦不可見。」",
        "translation": "The Vajrapāṇi warrior replied to Maitreya, Because the actual shore of reality is invisible, this harmony and legality are also invisible.",
        "source": "T13n0397_040:0268b06_7"
    },
    {
        "source_sentence": "彌勒又問：「善男子！",
        "translation": "Maitreya also asked, Good man!",
        "source": "T13n0397_040:0268b07_8"
    },
    {
        "source_sentence": "何者名為真實虛空不和合法？」",
        "translation": "What's called real space that's not compatible with the law?",
        "source": "T13n0397_040:0268b08_9"
    },
    {
        "source_sentence": "金剛力士報彌勒言：「彼中無異。」",
        "translation": "The Vajra warrior replied to Maitreya, There's no difference between them.",
        "source": "T13n0397_040:0268b09_10"
    },
    {
        "source_sentence": "彌勒又問：「善男子！",
        "translation": "Maitreya also asked, Good man!",
        "source": "T13n0397_040:0268b09_11"
    },
    {
        "source_sentence": "何者名為虛空之法？",
        "translation": "What's called the teaching of space?",
        "source": "T13n0397_040:0268b10_12"
    },
    {
        "source_sentence": "何者名為不和合法？」",
        "translation": "What's called disobedience and legality?",
        "source": "T13n0397_040:0268b10_13"
    },
    {
        "source_sentence": "金剛力士報彌勒言：「不動不生法界入事，是故不異。」",
        "translation": "The Vajrapāṇi warrior replied to Maitreya, They don't move or arise in the Dharma realm and enter things; therefore, they aren't different.",
        "source": "T13n0397_040:0268b11_14"
    },
    {
        "source_sentence": "彌勒又問：「善男子！",
        "translation": "Maitreya also asked, Good man!",
        "source": "T13n0397_040:0268b12_15"
    },
    {
        "source_sentence": "云何名為有為無為、漏無漏法？」",
        "translation": "What's called conditioned, unconditioned, contaminated, and uncontaminated dharmas?",
        "source": "T13n0397_040:0268b12_16"
    },
    {
        "source_sentence": "金剛力士報彌勒言：「如本真實如是如如性無有異，漏無漏法虛空和合是故不異。」",
        "translation": "The Vajrapāṇi warrior replied to Maitreya, As is the originally true nature of thusness and thusness as thusness, there's no difference in their nature; the combination of contaminated and uncontaminated dharmas",
        "source": "T13n0397_040:0268b13_17"
    },
    {
        "source_sentence": "彌勒又問：「善男子！",
        "translation": "Maitreya also asked, Good man!",
        "source": "T13n0397_040:0268b15_18"
    },
    {
        "source_sentence": "何者名為真實如如漏無漏法？」",
        "translation": "What's called the true and thusness of contaminated and uncontaminated dharmas?",
        "source": "T13n0397_040:0268b15_19"
    },
    {
        "source_sentence": "金剛力士報彌勒言：「虛空合故真實如如，非是漏法非無漏法。」",
        "translation": "The Vajrapāṇi warrior replied to Maitreya, Because space is combined, it's truly thusness, not contaminated or uncontaminated dharmas.",
        "source": "T13n0397_040:0268b16_20"
    },
    {
        "source_sentence": "彌勒又問：「善男子！",
        "translation": "Maitreya also asked, Good man!",
        "source": "T13n0397_040:0268b17_21"
    },
    {
        "source_sentence": "何者名為虛空和合法？」",
        "translation": "What's called the reconciling of space and reality?",
        "source": "T13n0397_040:0268b18_22"
    },
    {
        "source_sentence": "金剛力士報彌勒言：「一切諸法離於障礙，和合故空非集非散。",
        "translation": "The Vajrapāṇi warrior replied to Maitreya, All dharmas are free of obstructions, and because they are combined, emptiness is neither accumulated nor dispersed.",
        "source": "T13n0397_040:0268b18_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_040:0268b20_24"
    },
    {
        "source_sentence": "體性不失故。",
        "translation": "It's because the essence and nature aren't lost.",
        "source": "T13n0397_040:0268b20_25"
    },
    {
        "source_sentence": "而彼空中亦不可得物及空故，故名空法。",
        "translation": "Because things and emptiness can't be obtained in that space, it's therefore called the teaching of emptiness.",
        "source": "T13n0397_040:0268b20_26"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_040:0268b21_27"
    },
    {
        "source_sentence": "一切法中此方便故，當知一切如如體性，體性本來是空故空，如是萬法和合故空，",
        "translation": "Because of this method in all dharmas, you should know that all thusness is the essence of thusness, which is inherently empty because its essence is emptiness, and suchness is emptiness because it's the conjunction of",
        "source": "T13n0397_040:0268b21_28"
    },
    {
        "source_sentence": "想離想故此空非想，非想亦空。",
        "translation": "Because perception is free of perception, this emptiness is neither perception nor non-perception, and neither perception nor non-perception is empty.",
        "source": "T13n0397_040:0268b23_29"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_040:0268b24_30"
    },
    {
        "source_sentence": "如是一切和合法空不可說故，一切諸法體性爾故。",
        "translation": "Thus, all such harmonious dharmas are inexpressible because they are empty of dharmas, and the essence of all dharmas is thus.",
        "source": "T13n0397_040:0268b24_31"
    },
    {
        "source_sentence": "此如是法，非沙門造，非羅漢造，非辟支佛造，非菩薩造，非如來造，",
        "translation": "These teachings are not created by renunciants, they are not created by arhats, they are not created by pratyekabuddhas, they are not created by bodhisattvas, and they are not created by buddhas.",
        "source": "T13n0397_040:0268b25_32"
    },
    {
        "source_sentence": "如是如是真實如如，漏無漏法一切皆空，和合法故，非相離故，非異法故。",
        "translation": "All impure and pure dharmas are emptiness because they are harmonious, lawful, not separate, not different from each other.",
        "source": "T13n0397_040:0268b27_33"
    },
    {
        "source_sentence": "彌勒菩薩！",
        "translation": "Maitreya Bodhisattva!",
        "source": "T13n0397_040:0268b28_34"
    },
    {
        "source_sentence": "如是當知。」",
        "translation": "You should know it like this.",
        "source": "T13n0397_040:0268b29_35"
    },
    {
        "source_sentence": "爾時，金剛力士說是法已，無量眾生曾於過去學空來者，一切惡業悉皆除盡遠塵離垢，",
        "translation": "After the Vajrapāṇi had taught this teaching, measureless sentient beings who had studied emptiness in the past were rid of all bad actions and become far removed from dust and dirt.",
        "source": "T13n0397_040:0268b29_36"
    },
    {
        "source_sentence": "於諸法中得法眼淨；",
        "translation": "Among all things, they attain purity of the eye of truth.",
        "source": "T13n0397_040:0268c02_37"
    },
    {
        "source_sentence": "九十二那由他眾生，於此法中發阿耨多羅三藐三菩提心；",
        "translation": "Ninety-two thousand sentient beings aroused the determination for unexcelled complete perfect enlightenment in these teachings.",
        "source": "T13n0397_040:0268c02_38"
    },
    {
        "source_sentence": "無量眾生亦得住於不退轉道，究竟阿耨多羅三藐三菩提。",
        "translation": "Measureless sentient beings can also abide in the path of nonregression and ultimately attain unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0397_040:0268c04_39"
    },
    {
        "source_sentence": "◎大方等大集經日藏分◎佛現神通品第七爾時，頻婆娑羅王聞佛說此不淨觀法，",
        "translation": "At that time, the king Bimbisāra heard the Buddha teach this method of contemplation on impurity.",
        "source": "T13n0397_040:0268c05_40"
    },
    {
        "source_sentence": "一切大眾各欲護持，踊躍歡喜，即從座起，前白佛言：「世尊！",
        "translation": "Each of the great assemblies, wanting to preserve it, jumped and rejoiced, rose from their seats, went before the Buddha, said, Bhagavān!",
        "source": "T13n0397_040:0268c07_41"
    },
    {
        "source_sentence": "如是法門福德最勝不可思議，今此國土娑婆世界佛剎之中，無量諸大菩薩摩訶薩，",
        "translation": "Innumerable great bodhisattvas and mahāsattvas of the ten directions were present in the buddha-lands of the sahā worlds in this land.",
        "source": "T13n0397_040:0268c09_42"
    },
    {
        "source_sentence": "所可成就光明妙色，我從本來初未曾見初未曾聞。",
        "translation": "The marvelous form of the light that can be produced, which I've never seen or heard since the beginning.",
        "source": "T13n0397_040:0268c11_43"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_040:0268c12_44"
    },
    {
        "source_sentence": "是菩薩光悉能遍照大千世界，乃至有頂亦皆充滿。",
        "translation": "This bodhisattva's light can completely illuminate a thousand worlds, even the top of existence, and fill them all.",
        "source": "T13n0397_040:0268c12_45"
    },
    {
        "source_sentence": "我今眼中不覩餘色，但見於此娑婆世界佛剎之中乃至大小諸鐵圍山悉滿光明。",
        "translation": "Now, I don't see any other form in my eyes but see the light filling the buddha-lands of this sahā world and even large and small iron mountains.",
        "source": "T13n0397_040:0268c13_46"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_040:0268c15_47"
    },
    {
        "source_sentence": "如是菩薩摩訶薩等，若得近於阿耨多羅三藐三菩提者，其光云何？",
        "translation": "Thus, what's the light that bodhisattvas, mahāsattvas, and so forth attain if they approach unsurpassed, correct, and complete enlightenment?",
        "source": "T13n0397_040:0268c15_48"
    },
    {
        "source_sentence": "如來入於三昧所放光明相復云何？",
        "translation": "“World-honored One, what is the characteristic of the light emitted by the Tathāgata’s entry into absorption?",
        "source": "T13n0397_040:0268c17_49"
    },
    {
        "source_sentence": "如來光明我得見不？",
        "translation": "Can I see the Tathāgata's light?",
        "source": "T13n0397_040:0268c18_0"
    },
    {
        "source_sentence": "緣彼光明復得見於其餘佛剎種種妙好奇特事不？」",
        "translation": "Can you also see the various kinds of marvelous wonders and special things in other buddha-lands based on that light?",
        "source": "T13n0397_040:0268c18_1"
    },
    {
        "source_sentence": "佛言：「如是，如是。",
        "translation": "The Buddha said, So it is, so it is.",
        "source": "T13n0397_040:0268c19_2"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T13n0397_040:0268c20_0"
    },
    {
        "source_sentence": "若有菩薩成就無上菩提道者，其光能照十方世界。",
        "translation": "If there are bodhisattvas who have accomplished the unsurpassed path to enlightenment, their light can illuminate the worlds of the ten directions.",
        "source": "T13n0397_040:0268c20_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_040:0268c21_2"
    },
    {
        "source_sentence": "能於如來境界之中，行大福德莊嚴力故；",
        "translation": "They are able to practice in the realm of buddhahood, by the power of the adornment of great virtue.",
        "source": "T13n0397_040:0268c21_3"
    },
    {
        "source_sentence": "於過去世菩薩行中，成就具足大福德力莊嚴法故；",
        "translation": "In the practice of enlightening beings of past ages they perfected the adornments of great virtue and power.",
        "source": "T13n0397_040:0268c22_4"
    },
    {
        "source_sentence": "一切菩薩修行善根多增長故；",
        "translation": "All enlightening beings cultivate practice because their roots of goodness often grow.",
        "source": "T13n0397_040:0268c23_5"
    },
    {
        "source_sentence": "具無量福生於佛家，親近無上菩提道故；",
        "translation": "They are born in the house of buddhahood endowed with immeasurable virtue, because they draw near to the supreme path of enlightenment.",
        "source": "T13n0397_040:0268c24_6"
    },
    {
        "source_sentence": "畢竟無上菩提妙道，於不可宣說如來智力奮迅，遠離一切障礙，佛境界中勝疾智故；",
        "translation": "The ultimate path of unexcelled enlightenment is the sublime path of ineffable power of knowledge of buddhas, far removed from all obstructions, because of the supreme speed of knowledge in the sphere of buddhahood.",
        "source": "T13n0397_040:0268c25_7"
    },
    {
        "source_sentence": "入佛智慧正法果故；",
        "translation": "Because they enter the fruit of buddha-knowledge and true teaching.",
        "source": "T13n0397_040:0268c27_8"
    },
    {
        "source_sentence": "分別過去無量劫來無邊佛法境界依故；",
        "translation": "Because they discriminate the boundless buddha-dharma realm of past and future innumerable eons.",
        "source": "T13n0397_040:0268c27_9"
    },
    {
        "source_sentence": "此地最勝轉妙法輪，一切自在所可得身，如是福德無罣礙故；",
        "translation": "In this stage the supreme turning of the wheel of the fine Teaching is most remarkable, being a body to be obtained freely by all. Because such virtues are unobstructed.",
        "source": "T13n0397_040:0268c28_10"
    },
    {
        "source_sentence": "獲得清淨真實法故；",
        "translation": "They attain purity because of attaining the true teaching.",
        "source": "T13n0397_040:0269a01_11"
    },
    {
        "source_sentence": "所可修習到彼岸故；",
        "translation": "It is cultivated, because it reaches the other shore.",
        "source": "T13n0397_040:0269a01_12"
    },
    {
        "source_sentence": "未來世業已得盡故；",
        "translation": "Because future actions have already been exhausted.",
        "source": "T13n0397_040:0269a02_13"
    },
    {
        "source_sentence": "通達一切眾生善根，永斷一切煩惱習故；",
        "translation": "They comprehend the roots of goodness of all sentient beings, forever eliminating all habits of afflictions.",
        "source": "T13n0397_040:0269a02_14"
    },
    {
        "source_sentence": "離於障礙住佛界中，是故光明悉能遍照十方世界。",
        "translation": "Because they are free from obstructions and live in the Buddha realm, their light can illuminate all worlds in the ten directions.",
        "source": "T13n0397_040:0269a03_15"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T13n0397_040:0269a04_16"
    },
    {
        "source_sentence": "如是隨佛功德光明力故，亦能覩見一切十方無量無數阿僧祇佛。」",
        "translation": "Thus, it's because of the power of the Buddha's authoritative luminosity that they can also see measureless and countless incalculable buddhas in all ten directions.",
        "source": "T13n0397_040:0269a04_17"
    },
    {
        "source_sentence": "王言：「世尊！",
        "translation": "The king said, Bhagavān!",
        "source": "T13n0397_040:0269a06_18"
    },
    {
        "source_sentence": "我今欲見如是十方無量無數阿僧祇佛，并諸菩薩摩訶薩及聲聞眾。」",
        "translation": "Now, I want to see measureless and countless incalculable buddhas like these in the ten directions, as well as bodhisattvas, mahāsattvas, and śrāvakas.",
        "source": "T13n0397_040:0269a06_19"
    },
    {
        "source_sentence": "時頻婆娑羅王隨從眷屬有無量億諸眾生等，異口同音復白佛言：「如是，",
        "translation": "The king of Bimbisāra, accompanied by his retinues and countless millions of sentient beings, spoke with one voice to the Buddha in unison and said, So it is.",
        "source": "T13n0397_040:0269a08_20"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T13n0397_040:0269a09_21"
    },
    {
        "source_sentence": "亦願如來示現我等諸佛境界，過去所行福德莊嚴離障礙事，我等見已發歡喜心。」",
        "translation": "May the Tathāgata also show us the sphere of the buddhas, the merits and adornments of past actions that are free of obstruction, and we'll become joyous when we see them.",
        "source": "T13n0397_040:0269a09_22"
    },
    {
        "source_sentence": "爾時，世尊告阿若憍陳如：「汝等大眾、在家、出家、聲聞弟子，皆各繫念深心思惟，",
        "translation": "At that time the World-honored One said to Ājñātakauṇḍinya: All of you, bhikṣus, householders, renunciants, and śrāvaka disciples, keep this thought in deep thought:",
        "source": "T13n0397_040:0269a12_0"
    },
    {
        "source_sentence": "以自善根力入於禪定，我於今者亦欲入於如來三昧。」",
        "translation": "Because of the power of my own good roots, I enter meditation, and now I want to enter the Tathāgata's concentration as well.",
        "source": "T13n0397_040:0269a13_1"
    },
    {
        "source_sentence": "當于爾時，此佛剎中天、龍、夜叉，乃至一切人及非人，或有見四諦者，",
        "translation": "At the time, there were gods, dragons, yakṣas, and even all the people and non-people in this Buddha's buddha-stage, some of whom saw the four truths.",
        "source": "T13n0397_040:0269a15_0"
    },
    {
        "source_sentence": "或有得順忍者，或於三乘得不退者，如是眾生皆結加坐亦入禪定。",
        "translation": "Sometimes there are those who attain the nirvāṇa of following, or sometimes they attain nonretrogression in the three vehicles, and such sentient beings all sit cross-legged and enter meditation.",
        "source": "T13n0397_040:0269a16_1"
    },
    {
        "source_sentence": "復有眾生於三寶中得信敬心，亦復如是入於禪定。",
        "translation": "Again, if there are sentient beings who attain faith and respect in the Three Treasures, they'll enter meditation in the same way.",
        "source": "T13n0397_040:0269a18_0"
    },
    {
        "source_sentence": "爾時，世尊即入一切如來境界日月三昧，行智廣大悉能遍覆一切虛空，",
        "translation": "At that time the World-honored One entered the concentration called ‘samādhi of the moon and the sun in all realms of buddhahood.’ The knowledge of past, present, and future actions was so vast that it could cover all space.",
        "source": "T13n0397_040:0269a19_1"
    },
    {
        "source_sentence": "能令一切智慧眾生皆生歡喜。",
        "translation": "It can cause all sentient beings with wisdom to become joyous.",
        "source": "T13n0397_040:0269a20_2"
    },
    {
        "source_sentence": "如是三昧不可計量不可覩見，非諸聲聞及辟支佛，乃至十方恒河沙等補處菩薩之所能知，",
        "translation": "Such concentration is immeasurable and cannot be measured or seen. It cannot be known by any śrāvakas, pratyekabuddhas, bodhisattvas, buddhas, or bodhisattvas of the ten directions, even if they were to",
        "source": "T13n0397_040:0269a21_3"
    },
    {
        "source_sentence": "唯佛如來乃能得之，是名如來境界三昧。",
        "translation": "Only the Buddha-tathāgata can attain it, which is called the Tathāgata's sphere samādhi.",
        "source": "T13n0397_040:0269a23_4"
    },
    {
        "source_sentence": "如來如是入三昧已，此娑婆世界三千大千百億四天下，百億須彌山，百億日月乃至百億諸有頂天，",
        "translation": "“After the Buddha had entered concentration in this way, these sahā worlds were filled with three thousand great one-thousand myriads of koṭis of worlds, ten billion mountains of polar mountains, ten billion suns and moons",
        "source": "T13n0397_040:0269a24_5"
    },
    {
        "source_sentence": "皆悉影現入佛身中。",
        "translation": "All of them are fully manifested in the Buddha's body.",
        "source": "T13n0397_040:0269a26_6"
    },
    {
        "source_sentence": "如是娑婆世界一切佛剎入佛身已，其中所有一切眾生——地獄餓鬼及以畜生，",
        "translation": "Thus, all the buddha-lands of this sahā world have entered into the Buddha’s body. All the sentient beings therein—hell, hungry ghosts, and animals—",
        "source": "T13n0397_040:0269a27_7"
    },
    {
        "source_sentence": "或天、或人——彼諸眾生或身、或心，有苦受者皆得除滅，一切自在悉生歡喜，",
        "translation": "“Either gods or humans—those sentient beings who experience pain in their bodies or minds all attain its cessation, and all freely become joyful.",
        "source": "T13n0397_040:0269a29_8"
    },
    {
        "source_sentence": "譬如比丘入第三禪得具足樂。",
        "translation": "It's like a monk who enters the third dhyāna and attains complete bliss.",
        "source": "T13n0397_040:0269b01_9"
    },
    {
        "source_sentence": "爾時，一切諸大菩薩摩訶薩眾，先在座中入三昧者皆從定起，從定起已見佛光明，",
        "translation": "At that moment, all the great bodhisattva mahāsattvas who had entered concentration while they were already seated rose from concentration and, having risen from concentration, saw the Buddha’s light.",
        "source": "T13n0397_040:0269b02_10"
    },
    {
        "source_sentence": "見光明已自所有光尋滅不現。",
        "translation": "After seeing the light, his own light disappears and doesn't appear.",
        "source": "T13n0397_040:0269b04_11"
    },
    {
        "source_sentence": "如是聲聞及佛弟子，乃至一切諸天、人眾入禪定者各各皆起。",
        "translation": "Thus, śrāvakas and buddha disciples, as well as all the gods and humans who enter meditation each arise.",
        "source": "T13n0397_040:0269b05_12"
    },
    {
        "source_sentence": "彼諸大眾身心得樂，譬如比丘入第三禪。",
        "translation": "It's like a monk who enters the third dhyāna.",
        "source": "T13n0397_040:0269b06_13"
    },
    {
        "source_sentence": "爾時，一切無量眾生生大歡喜，踊躍無量不可思議未曾聞見。",
        "translation": "At the time, measureless sentient beings all became greatly joyful, jumped up and down, and had never heard or seen anything inconceivable.",
        "source": "T13n0397_040:0269b07_14"
    },
    {
        "source_sentence": "又其六根一切清淨現佛身中，或坐、或行、或住、或臥，復見如來一一毛孔出無量光。",
        "translation": "Furthermore, all the purities of those six faculties are manifested in the Buddha's body, whether he's sitting, walking, standing, or lying down, and he also sees measureless light emanating from each pore of his hair.",
        "source": "T13n0397_040:0269b08_15"
    },
    {
        "source_sentence": "譬如十方恒河沙等日月光明，亦如一切恒河沙等大摩尼珠，亦如恒河沙等十地菩薩摩訶薩眾，",
        "translation": "“Furthermore, just as the light of the sun and moon are equal to the number of grains of sand in the Ganges River in the ten directions, so are all the jewels equal to the number of grains of sand in the Ganges",
        "source": "T13n0397_040:0269b10_16"
    },
    {
        "source_sentence": "一時普放大焰光明。",
        "translation": "At once, it universally radiates the flame's light.",
        "source": "T13n0397_040:0269b13_0"
    },
    {
        "source_sentence": "如是光明悉能遍照十方佛土，如是如來一一毛孔所出光明，處處皆滿於十方剎最為殊勝。",
        "translation": "Such a ray of light can illuminate all the buddha lands in the ten directions, and such a ray of light emanating from each pore of the Tathāgata fills all the buddha-lands in the ten directions everywhere, which are most distinguished.",
        "source": "T13n0397_040:0269b13_1"
    },
    {
        "source_sentence": "爾時，十方一切諸佛，於其剎中自在而住，各為大眾異口同音稱讚我名，",
        "translation": "At that time, all the buddhas of the ten directions were freely abiding in those buddha-lands, each praised my name with different utterances for the masses.",
        "source": "T13n0397_040:0269b15_2"
    },
    {
        "source_sentence": "「汝觀具足功德滿，　　憐彼一切諸眾生，",
        "translation": "Observe that you are endowed with virtue, compassionate to all sentient beings.",
        "source": "T13n0397_040:0269b17_3"
    },
    {
        "source_sentence": "　智慧大力能拔除，　　釋迦如來勝中最。",
        "translation": "Wise and powerful, he's able to remove it, which is the most superior of the Śākyamuni Tathāgatas.",
        "source": "T13n0397_040:0269b17_3"
    },
    {
        "source_sentence": "　慈悲心故放此光，　　一切佛剎皆充滿，",
        "translation": "Because of compassion they radiate this light, Filling all buddha-lands with it.",
        "source": "T13n0397_040:0269b17_3"
    },
    {
        "source_sentence": "　又愍是諸眾生故，　　令其悉現於身中。",
        "translation": "It's also because of these sentient beings that they cause them to all appear in their bodies.",
        "source": "T13n0397_040:0269b17_3"
    },
    {
        "source_sentence": "　一一佛剎滿光明，　　眾生見者皆歡喜，",
        "translation": "Each buddha-land is full of light, All the sentient beings who see it are joyful.",
        "source": "T13n0397_040:0269b17_3"
    },
    {
        "source_sentence": "　發心清淨悉牢固，　　得勝無上實菩提。",
        "translation": "The determination for enlightenment is pure and all-steadfast, attaining unsurpassed true enlightenment.",
        "source": "T13n0397_040:0269b17_3"
    },
    {
        "source_sentence": "　汝等若有得神通，　　一切宜應急疾往，",
        "translation": "If you have attained supernatural powers, All of you should quickly go there.",
        "source": "T13n0397_040:0269b17_3"
    },
    {
        "source_sentence": "　恭敬接足稽首禮，　　釋迦師子最勝尊。",
        "translation": "They bowed their heads at his feet in respect and greeted the Most Excellent Honorable One, the Śākya lion.",
        "source": "T13n0397_040:0269b17_3"
    },
    {
        "source_sentence": "　若有未得神通者，　　向彼低頭遙禮拜，",
        "translation": "If there are those who have not yet attained supernatural powers, venerate them from a distance with their heads bowed.",
        "source": "T13n0397_040:0269b17_3"
    },
    {
        "source_sentence": "　速起菩提真智念，　　得見牟尼正覺身。」",
        "translation": "Quickly give rise to the mind of enlightenment and true wisdom, and you'll see the body of Samantabhadra as perfectly enlightened.",
        "source": "T13n0397_040:0269b17_3"
    },
    {
        "source_sentence": "說於此偈：爾時，十方一切諸佛各於其國說如是偈，慈悲教化諸眾生故。",
        "translation": "He spoke this verse: At the time, all the buddhas of the ten directions each spoke this verse in their own country, because they compassionately teach sentient beings.",
        "source": "T13n0397_040:0269b17_3"
    },
    {
        "source_sentence": "又以如來過去修行願力莊嚴具足滿故，彼諸佛剎一一如來，亦有無量恒河沙等諸大菩薩摩訶薩眾，",
        "translation": "“Furthermore, because the Buddha’s past vows of cultivation had been fulfilled, each buddha in each of those buddha-lands also had an assembly of great enlightening beings as numerous as the grains of sand in the Gang",
        "source": "T13n0397_040:0269b29_4"
    },
    {
        "source_sentence": "并大弟子、聲聞比丘，復有無量億恒河沙諸天，及龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊陀羅、摩睺羅伽等，",
        "translation": "And the great disciples and śrāvaka bhikṣus, as well as innumerable hundreds of millions of koṭis of Ganges River gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, ki",
        "source": "T13n0397_040:0269c02_5"
    },
    {
        "source_sentence": "無量大眾圍遶彼佛，各乘神通俱來詣此娑婆世界。",
        "translation": "An immeasurable number of people surrounded the Buddha, each with their supernormal powers, came to this sahā world.",
        "source": "T13n0397_040:0269c05_0"
    },
    {
        "source_sentence": "到此剎已向於如來，頭面接足右遶三匝。",
        "translation": "After arriving at this buddha, he faced the Tathāgata, bowed his head and feet, circumambulated him three times to his right.",
        "source": "T13n0397_040:0269c06_1"
    },
    {
        "source_sentence": "右遶畢已，各齎持來一切所有種種寶物、種種寶衣、種種袈裟、種種瓔珞、種種幡蓋、種種雜華、種種熏香、種種塗香、種種音樂、種種讚歎、種種歌舞供養如來。",
        "translation": "Having circumambulated them to their right, they each brought all the various treasures, various jeweled clothing, various reddish-brown robes, various jewelry, various canopies, various mixed flowers, various perfumes, various ointments, various",
        "source": "T13n0397_040:0269c07_2"
    },
    {
        "source_sentence": "設供養已，與其眷屬各還所住。",
        "translation": "After making an offering, he and his retinue return to where they're staying.",
        "source": "T13n0397_040:0269c10_3"
    },
    {
        "source_sentence": "時諸眾生在娑婆界佛身中者，皆悉見之。",
        "translation": "All the sentient beings who were then in the Buddha's body in the sahā realm saw it.",
        "source": "T13n0397_040:0269c11_4"
    },
    {
        "source_sentence": "見已歡喜，復受無量無邊快樂。",
        "translation": "Having seen it, they rejoice and further experience measureless and limitless happiness.",
        "source": "T13n0397_040:0269c12_5"
    },
    {
        "source_sentence": "又諸眾生得見十方一切諸佛，於其剎土坐金剛座而演說法。",
        "translation": "Also, sentient beings can see all the buddhas of the ten directions and teach the Dharma while sitting on their vajra seats in those buddha-lands.",
        "source": "T13n0397_040:0269c12_6"
    },
    {
        "source_sentence": "又見諸佛各各剎中於自坐處，為諸眾生說此世界釋迦如來一切功德，有大名稱大智慧力，",
        "translation": "In each buddha-land he saw the buddhas, each seated in their respective buddha-lands, expounding to sentient beings all the attributes of the Buddha Śākyamuni of this world.",
        "source": "T13n0397_040:0269c14_7"
    },
    {
        "source_sentence": "福德莊嚴，具大精進大慈悲力教化眾生。",
        "translation": "It's adorned with merit and virtue, endowed with great effort, great compassion, and the power to teach sentient beings.",
        "source": "T13n0397_040:0269c16_8"
    },
    {
        "source_sentence": "彼諸剎中無量阿僧祇恒河沙等眾生，發阿耨多羅三藐三菩提心，於自剎中得受記別，",
        "translation": "Countless sentient beings in those buddha-lands, as numerous as the grains of sand in countless Ganges Rivers, aroused the determination for unexcelled, complete perfect enlightenment and attained distinctions in their own buddh",
        "source": "T13n0397_040:0269c17_9"
    },
    {
        "source_sentence": "無量眾生於緣覺乘得受記別。",
        "translation": "Measureless sentient beings attain distinctive assurance in the pratyekabuddha vehicle.",
        "source": "T13n0397_040:0269c19_10"
    },
    {
        "source_sentence": "彼諸大眾亦見此土一切眾生入於佛身，亦得如是受於記別。",
        "translation": "Those masses also saw all the sentient beings in this land who entered the Buddha's body, and they were likewise given a distinctive assurance.",
        "source": "T13n0397_040:0269c20_11"
    },
    {
        "source_sentence": "其中眾生或有受樂或有受苦，一切皆現釋迦如來身內住止。",
        "translation": "The sentient beings in them may experience pleasure or suffering, and all of them show the Tathāgata Śākyamuni's abiding inside their bodies.",
        "source": "T13n0397_040:0269c21_12"
    },
    {
        "source_sentence": "若空五濁佛剎眾生得見如來，及見十方無量無數說法諸佛，一一如來各有無量無數眾生恭敬圍遶，",
        "translation": "If there are sentient beings in the five turbid buddha-lands of emptiness and illusion attain vision of buddhas, or if they see the buddhas of the ten directions teaching infinitely and countless truths, each buddha will be sur",
        "source": "T13n0397_040:0269c22_13"
    },
    {
        "source_sentence": "見已起大愛敬生歡喜心。",
        "translation": "Having seen it, he gives rise to great love and respect and becomes joyous.",
        "source": "T13n0397_040:0269c25_14"
    },
    {
        "source_sentence": "彼諸眾生一切身中，所有惡受悉得除捨安隱快樂。",
        "translation": "All the bad feelings in all those sentient beings' bodies will be completely removed, and they'll attain peace and happiness.",
        "source": "T13n0397_040:0269c25_15"
    },
    {
        "source_sentence": "若不空五濁剎者，十地菩薩摩訶薩等，教化眾生故，隨何剎中得見於佛。",
        "translation": "If there are five nonempty and turbid buddhas, the tenth-stage bodhisattvas, mahāsattvas, and so forth teach sentient beings, wherever they can see the Buddha in any buddha.",
        "source": "T13n0397_040:0269c27_0"
    },
    {
        "source_sentence": "見已生信，得信心已聽受妙法。",
        "translation": "Having seen it, they give rise to faith, and having attained faith, they hear and accept the wonderful teaching.",
        "source": "T13n0397_040:0269c28_1"
    },
    {
        "source_sentence": "「十方諸佛同一乘，　　成就善根故來此，",
        "translation": "“Buddhas of the ten directions are one vehicle, coming here because they have perfected their roots of goodness.",
        "source": "T13n0397_040:0269c29_2"
    },
    {
        "source_sentence": "　離佛及餘菩薩眾，　　更無如是大德人。",
        "translation": "Apart from the Buddha and other enlightening beings, There is no one of great virtue like this.",
        "source": "T13n0397_040:0269c29_2"
    },
    {
        "source_sentence": "　汝等一一諸眾生，　　速發菩提無上道，",
        "translation": "Each of you sentient beings hasten to enlightenment on the supreme path.",
        "source": "T13n0397_040:0269c29_2"
    },
    {
        "source_sentence": "　若不勇猛勤精進，　　流轉苦海無出期。",
        "translation": "If they don't have the courage and diligence to exert themselves, there's no time to go out in the ocean of suffering.",
        "source": "T13n0397_040:0269c29_2"
    },
    {
        "source_sentence": "　汝等宜應一切來，　　速隨於我相逐往，",
        "translation": "It’s better for you all to come, quickly follow me and go with me.",
        "source": "T13n0397_040:0269c29_2"
    },
    {
        "source_sentence": "　供養人中釋師子，　　頂禮右遶彼世尊。」",
        "translation": "Among those who make offerings, the Śāriputra lion bows his head and circumambulates the Bhagavān to his right.",
        "source": "T13n0397_040:0269c29_2"
    },
    {
        "source_sentence": "彼諸菩薩各於彼處化作佛身，以一音聲滿一切剎，各各異口同說偈言：時諸菩薩摩訶薩等化作佛身說此偈已，",
        "translation": "Each of those bodhisattvas magically created a buddha-body in that place, filling all the buddha-bodies with one sound, each spoke differently and together in verse, saying, “Then the bodhisattvas, mahāsattvas,",
        "source": "T13n0397_040:0269c29_2"
    },
    {
        "source_sentence": "各與無量無邊恒河沙數得神通力一切眾生俱來詣此，見釋迦牟尼佛，見已右遶三匝。",
        "translation": "Each of them, accompanied by an infinite number of sentient beings who had attained miraculous powers as numerous as the sands of the Ganges River in measureless and limitless numbers, came to this place and saw Śākyamuni Buddha",
        "source": "T13n0397_040:0270a08_3"
    },
    {
        "source_sentence": "遶已各持齎來，種種寶物、種種寶衣、種種音聲、種種歌舞，以用供養釋迦如來。",
        "translation": "After circumambulating them, they each brought various treasures, various jeweled clothing, various sounds, and various songs and dances to offer to the Śākyamuni Tathāgata.",
        "source": "T13n0397_040:0270a10_4"
    },
    {
        "source_sentence": "供養畢已，悉發阿耨多羅三藐三菩提心。",
        "translation": "After they had completed their offerings, they all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0397_040:0270a12_5"
    },
    {
        "source_sentence": "或有眾生於辟支佛乘而發願者，如是悉得不退轉道。",
        "translation": "If there are sentient beings who make the vow to be born in the vehicle of the pratyekabuddha, they'll all attain the path of nonretrogression in this way.",
        "source": "T13n0397_040:0270a13_6"
    },
    {
        "source_sentence": "彼諸眾生又皆各各得種種忍、種種陀羅尼、種種善根，得已各還本剎。",
        "translation": "Each of those sentient beings also attained various kinds of forbearance, various dhāraṇīs, and various good roots, and after attaining them, they returned to their own buddha.",
        "source": "T13n0397_040:0270a14_7"
    },
    {
        "source_sentence": "或有菩薩化作辟支佛身，或復化作阿羅漢身，或復化作梵天王身，或復化作帝釋天身，",
        "translation": "“Some bodhisattvas may transform themselves into the forms of pratyekabuddhas, or they may transform themselves into the forms of arhats, or they may transform themselves into the forms of Brahmā, or they may transform themselves into the",
        "source": "T13n0397_040:0270a16_8"
    },
    {
        "source_sentence": "或復化作四天王身，或復化作那羅延身，或復化作摩醯首羅，或復化作自在天身，",
        "translation": "They may also be transformed into the bodies of the four heavenly kings, or they may again be transformed into the bodies of Nārāyana, or they may again be transformed into the bodies of Mahesvara, or they may again be transformed",
        "source": "T13n0397_040:0270a18_9"
    },
    {
        "source_sentence": "或復化作星宿天身，或復化作阿修羅身，或復化作轉輪聖王，如是種種龍身鬼身，",
        "translation": "They may transform themselves into the bodies of celestial beings, or they may transform themselves into the bodies of asuras, or they may transform themselves into the bodies of wheel-turning sage kings. Such are the various forms of dragons and",
        "source": "T13n0397_040:0270a20_10"
    },
    {
        "source_sentence": "隨所在處佛剎之中。",
        "translation": "Wherever they are, they're in the buddha-stage.",
        "source": "T13n0397_040:0270a22_11"
    },
    {
        "source_sentence": "若有眾生樂見阿羅漢身，見羅漢已歡喜受法。",
        "translation": "Suppose there are sentient beings who delight in seeing the arhat's body and see that the arhat has joyfully received the teaching after seeing it.",
        "source": "T13n0397_040:0270a22_12"
    },
    {
        "source_sentence": "彼諸菩薩摩訶薩等，為欲教化諸眾生故，即於彼中作羅漢身，為彼眾生說種種法。",
        "translation": "Because those bodhisattvas, mahāsattvas, and so forth want to teach sentient beings, they create the arhat's body in them and explain various dharmas for those sentient beings.",
        "source": "T13n0397_040:0270a23_13"
    },
    {
        "source_sentence": "彼諸眾生見大光明及釋迦佛，得見佛已心中愛敬生大歡喜，具足六根滿一切願，",
        "translation": "“When those sentient beings saw Mahaprabha and the buddha Shakyamuni, their hearts were filled with joy when they saw him. They possessed the six faculties and fulfilled all their vows.",
        "source": "T13n0397_040:0270a25_14"
    },
    {
        "source_sentence": "惡業皆盡悉樂受生。",
        "translation": "All bad actions are ended, and they're all happy to be born.",
        "source": "T13n0397_040:0270a27_15"
    },
    {
        "source_sentence": "又彼菩薩摩訶薩等，於佛剎中化作如是阿羅漢身，說法教化大福德聚，",
        "translation": "“Furthermore, those great enlightening beings and bodhisattvas at the buddha-lands magically created such an arhat-body, expounding the teaching of truth in order to produce a great stock of virtue.",
        "source": "T13n0397_040:0270a27_16"
    },
    {
        "source_sentence": "「眾生久處流轉中，　　愚癡不知出要道，",
        "translation": "Sentient beings have been in the midst of transmigration for a long time, Foolishly ignorant of the essential path of liberation.",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "　以諸種種罪業故，　　得此生死苦惱身，",
        "translation": "Because of various sins and actions, they attain this painful body of birth-and-death.",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "　是故應速捨惡心，　　邪見顛倒諸煩惱。",
        "translation": "Therefore, you should quickly abandon bad thoughts and the afflictions of wrong views and delusion.",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "　早度有流到彼岸，　　云何汝等不覺知？",
        "translation": "Early crossing the river and reaching the other shore, why don't you realize it?",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "　難見導師今已見，　　難得人身今已得，",
        "translation": "It’s hard to see the Guide, who has now seen it; It’s hard to find a human being who has already attained it.",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "　難遇善友今逢值，　　難聞正法今得聞，",
        "translation": "It’s hard to meet a good friend, and now it’s hard to find one; hard to hear the true teaching, but now you can hear it.",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "　是故汝等應至心，　　速發無上菩提道，",
        "translation": "Therefore you should wholeheartedly set out for the supreme path of enlightenment.",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "　出離一切生死獄，　　證佛微妙功德身。",
        "translation": "He leaves all the hells of birth and death And realizes the subtle, virtuous body of buddhahood.",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "　若能永離兩種邪，　　所謂斷常等二見，",
        "translation": "If one can forever be free of these two kinds of errors, the so-called views of annihilation and permanence, etc.",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "　知於一切行無我，　　如是名入正觀門。",
        "translation": "Knowing all conditioned things are without self, this is called entering the gate of right contemplation.",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "　愛行取入有於生，　　智水洗除悉令淨，",
        "translation": "There’s birth in craving, action, grasping, and sense-entry; The water of knowledge washes away all and makes them pure.",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "　同共往詣娑婆國，　　恭敬供養釋師子。」",
        "translation": "Together, we'll go to the country of Sāvatthī and venerate and make offerings to the Śākyamuni.",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "具足成就善根力故，能以一音遍一切剎，作諸言辭說如是偈：時諸菩薩摩訶薩等如是化作阿羅漢身說此偈已，",
        "translation": "Because they are endowed with the power of accomplishing roots of goodness, they can pervade all buddha-lands with one voice and utter words like these verses: “Then the bodhisattvas, mahāsattvas, and so on",
        "source": "T13n0397_040:0270a29_17"
    },
    {
        "source_sentence": "與於無量恒河沙等得神通力一切眾生，俱共發引來到此剎。",
        "translation": "Together with all the sentient beings who attain miraculous powers like the infinite number of grains of sand in the Ganges River, they all come to this buddha.",
        "source": "T13n0397_040:0270b15_18"
    },
    {
        "source_sentence": "到已頭面頂禮釋迦牟尼如來并其眷屬，恭敬圍遶三匝佛已，出所齎來種種寶物、種種寶衣、種種袈裟、種種瓔珞、種種傘蓋、種種幢幡、種種寶華、種種寶香、種種音樂偈讚歌舞，",
        "translation": "On arriving, they bowed their heads and faces to the Buddha Śākyamuni and his retinues, venerated him, circumambulated him three times, produced various precious things, various precious robes, various reddish-brown robes,",
        "source": "T13n0397_040:0270b16_19"
    },
    {
        "source_sentence": "以用供養釋迦如來。",
        "translation": "It's used to make offerings to the Tathāgata Śākyamuni.",
        "source": "T13n0397_040:0270b20_20"
    },
    {
        "source_sentence": "供養畢已各還自剎，到自剎已坐於自座，各為於己眾稱楊讚說釋迦如來，",
        "translation": "Having paid their respects, they each returned to their own buddha-field. Having arrived at their own buddha-field and having taken their seats in their own thrones, they praised the Buddha Śākyamuni for the sake of their own assembly",
        "source": "T13n0397_040:0270b20_21"
    },
    {
        "source_sentence": "作如是言：「釋迦如來，憐愍教化一切眾生，能與眾生一切利益。」",
        "translation": "He said, The Tathāgata Śākyamuni is compassionate and teaches all sentient beings, and he's able to give all benefits to sentient beings.",
        "source": "T13n0397_040:0270b22_22"
    },
    {
        "source_sentence": "是諸菩薩各自眾中如是稱說，彼眾聞已悉皆讚歎釋迦如來，既讚歎已無量無數阿僧祇眾生，",
        "translation": "Each of these bodhisattvas thus exhorted the Buddha in his congregation. Having heard him exhort, they all praised the buddha-tathāgata Śākyamuni; and having thus praised him, countless, immeasurable",
        "source": "T13n0397_040:0270b24_0"
    },
    {
        "source_sentence": "發阿耨多羅三藐三菩提心。",
        "translation": "He arouses the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T13n0397_040:0270b26_1"
    },
    {
        "source_sentence": "或復有於辟支佛乘而發心者，或復有於聲聞乘中而發心者，各各乘中得不退道。",
        "translation": "Sometimes there's someone who arouses the mind in the pratyekabuddha vehicle, or sometimes there's someone who arouses the mind in the śrāvaka vehicle, and they each attain the path of nonretrogression in each vehicle.",
        "source": "T13n0397_040:0270b26_2"
    },
    {
        "source_sentence": "有得種種陀羅尼忍種種善根，亦見此土娑婆佛剎諸眾生等入釋迦如來身中。",
        "translation": "Those who have attained various kinds of dhāraṇī forbearance and various good roots also see sentient beings in sahā buddha bases in this land enter the body of the Śākyamuni Tathāgata.",
        "source": "T13n0397_040:0270b28_3"
    },
    {
        "source_sentence": "是諸眾生見此不可思議神德變已，無量阿僧祗恒河沙等眾生，皆發阿耨多羅三藐三菩提心。",
        "translation": "When these sentient beings saw this inconceivable miraculous transformation of mystic virtue, measureless and incalculable numbers of sentient beings like the sands of the Ganges River all aroused the mind of unsurpassed, correct",
        "source": "T13n0397_040:0270c01_4"
    },
    {
        "source_sentence": "其中或有發聲聞辟支佛心者，各於自乘得不退轉；",
        "translation": "Some of them had developed the minds of śrāvakas and pratyekabuddhas, each attaining nonregression in their own vehicle.",
        "source": "T13n0397_040:0270c03_5"
    },
    {
        "source_sentence": "或有作於轉輪聖王微妙之身得受記別。",
        "translation": "Perhaps there's someone who makes a distinction in the subtle body of the wheel-turning sage king and receives assurance.",
        "source": "T13n0397_040:0270c04_6"
    },
    {
        "source_sentence": "◎大方等大集經卷第四十",
        "translation": "*Mahāmegha-sūtra, Volume 40",
        "source": "T13n0397_040:0270c05_7"
    }
]