[
    {
        "source_sentence": "大方等大集經卷第二十八",
        "translation": "*Mahāmegha-sūtra, Volume 28",
        "source": "T13n0397_028:0192a21_0"
    },
    {
        "source_sentence": "宋涼州沙門智嚴共寶雲譯",
        "translation": "Song Dynasty Translation by Zhiyan, a monk of Liangzhou and translated by Bao Yun",
        "source": "T13n0397_028:0192a23_0"
    },
    {
        "source_sentence": "無盡意菩薩品第十二之二",
        "translation": "The Twelfth and Second Part of the Chapter of the Bodhisattva of Inexhaustible Mind",
        "source": "T13n0397_028:0192a24_0"
    },
    {
        "source_sentence": "◎爾時，舍利弗語無盡意言：「善哉，善哉！",
        "translation": "At that point, Śāriputra said inexhaustibly, Good, good!",
        "source": "T13n0397_028:0192a25_0"
    },
    {
        "source_sentence": "唯，善男子！",
        "translation": "Yes, good man!",
        "source": "T13n0397_028:0192a25_1"
    },
    {
        "source_sentence": "汝已快說菩薩羼提波羅蜜而不可盡。",
        "translation": "You've quickly explained the bodhisattva's perfection of kṣatriya, but it can't be exhausted.",
        "source": "T13n0397_028:0192a26_2"
    },
    {
        "source_sentence": "唯願仁者，當說菩薩毘梨耶波羅蜜，如諸菩薩所得無盡毘梨耶波羅蜜。」",
        "translation": "Please, my dear friend, you should explain the bodhisattva's vīrya-pāramitā, which is like the inexhaustible vīrya-pāramitā obtained by bodhisattvas.",
        "source": "T13n0397_028:0192a27_3"
    },
    {
        "source_sentence": "無盡意言：「唯，舍利弗！",
        "translation": "The inexhaustible mind said, Yes, Śāriputra!",
        "source": "T13n0397_028:0192a28_4"
    },
    {
        "source_sentence": "菩薩具足八事，修行精進而不可盡。",
        "translation": "The bodhisattva is fully endowed with eight things, and his cultivation of effort can't be exhausted.",
        "source": "T13n0397_028:0192a29_5"
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T13n0397_028:0192b01_0"
    },
    {
        "source_sentence": "發大莊嚴而無有盡，積集勇進而不可盡，修行諸善而不可盡，教化眾生而不可盡，",
        "translation": "They give rise to great adornment without end; their accumulation and development of courage are inexhaustible. The practice of virtue is inexhaustible, and the edification of sentient beings is inexhaustible.",
        "source": "T13n0397_028:0192b01_1"
    },
    {
        "source_sentence": "助道功德而不可盡，助無上智而不可盡，助無上慧而不可盡，集助佛法而不可盡。",
        "translation": "They are inexhaustible in assisting the virtues of the path, inexhaustible in assisting unsurpassed wisdom, inexhaustible in assisting unsurpassed wisdom, and inexhaustible in accumulating the Buddha's teachings.",
        "source": "T13n0397_028:0192b03_2"
    },
    {
        "source_sentence": "「云何菩薩莊嚴無盡？",
        "translation": "How is the adornment of enlightening beings inexhaustible?",
        "source": "T13n0397_028:0192b05_3"
    },
    {
        "source_sentence": "於諸生死心不疲倦，不計劫數當成佛道，若干劫在而作莊嚴，若干劫在不作莊嚴，",
        "translation": "Their minds aren’t weary of birth and death, and they don’t count the number of eons to attain buddhahood. They adorn themselves for as many eons as there are living beings, and they don’t adorn themselves for as many eons as there are living beings.",
        "source": "T13n0397_028:0192b05_4"
    },
    {
        "source_sentence": "菩薩莊嚴所經劫數不可稱計。",
        "translation": "The number of eons that the bodhisattva's adornment has passed cannot be measured.",
        "source": "T13n0397_028:0192b07_5"
    },
    {
        "source_sentence": "如從今日至生死，本為一日一夜，如是三十日為一月，十二月為一歲，",
        "translation": "\\",
        "source": "T13n0397_028:0192b08_6"
    },
    {
        "source_sentence": "於是百千萬歲，一發道心一見如來，如是發心，所見諸佛如恒沙數。",
        "translation": "At that point, for a hundred million years, one arouses the mind of enlightenment and one sees the Tathāgata, and thus arouses the mind like this, seeing buddhas as numerous as the sands of the Ganges.",
        "source": "T13n0397_028:0192b09_7"
    },
    {
        "source_sentence": "於爾所佛邊，方得知一眾生心行，如是遍知一切眾生心之所行猶不退沒，",
        "translation": "At the side of those buddhas, they can know the mental patterns of a single sentient being and thus know the mental patterns of all sentient beings without ever retreating.",
        "source": "T13n0397_028:0192b11_8"
    },
    {
        "source_sentence": "是則名曰不懈莊嚴無盡莊嚴。",
        "translation": "This is called the inexhaustible adornment that doesn't rely on adornment.",
        "source": "T13n0397_028:0192b13_0"
    },
    {
        "source_sentence": "經於如是見佛發心，知他眾生心所行時，常修具足檀波羅蜜、尸波羅蜜、羼提波羅蜜、毘梨耶波羅蜜、禪波羅蜜、般若波羅蜜，",
        "translation": "When he thus sees the Buddha's arousal of mind and knows what other sentient beings are doing in their minds, he always cultivates the perfection of the perfection of the perfection of generosity, the perfection of śīla-pāramitā, the perfection of kṣatriya, the perfection ofvīrya, the perfection of pāramitā, the perfection of meditation, and the perfection of",
        "source": "T13n0397_028:0192b13_1"
    },
    {
        "source_sentence": "修集一切助菩提法。",
        "translation": "He cultivates all the factors that aid in enlightenment.",
        "source": "T13n0397_028:0192b16_2"
    },
    {
        "source_sentence": "具修相好、十力、無畏、不共之法，具修一切諸佛法故，是名不懈莊嚴無盡莊嚴。",
        "translation": "Because they cultivate all the characteristics, ten powers, fearlessness, and unique qualities, and because they cultivate all the Buddha's teachings, this is called an inexhaustible adornment that doesn't rely on adornment.",
        "source": "T13n0397_028:0192b17_3"
    },
    {
        "source_sentence": "若有菩薩聞作是說，不驚不怖不畏，當知是菩薩不懈精進，是名菩薩莊嚴無盡。",
        "translation": "If a bodhisattva who hears this teaching and isn't frightened or terrified by it, you should know that this is a bodhisattva who doesn't lack effort, which is called a bodhisattva whose adornment has no limit.",
        "source": "T13n0397_028:0192b18_4"
    },
    {
        "source_sentence": "「云何菩薩勇進無盡？",
        "translation": "How does a bodhisattva's courageous effort have no limit?",
        "source": "T13n0397_028:0192b20_5"
    },
    {
        "source_sentence": "若三千大千世界滿中盛火，為見佛故，要當從是火中而過。",
        "translation": "If 3,000 great one-thousand worlds are filled with fire, it's because they see the Buddha that they'll have to pass through this fire.",
        "source": "T13n0397_028:0192b21_6"
    },
    {
        "source_sentence": "若為聞法、教化眾生、安止眾生於善法故，亦應如是從火中過，是名菩薩勇進無盡。",
        "translation": "If someone hears the teaching, teaches sentient beings, and pacifies sentient beings for the sake of the good teaching, they should also thus emerge from the fire like this, which is called a bodhisattva's inexhaustible courageous effort.",
        "source": "T13n0397_028:0192b22_7"
    },
    {
        "source_sentence": "何因緣故，名曰勇進？",
        "translation": "What are the causes and conditions that make it called courageous effort?",
        "source": "T13n0397_028:0192b24_8"
    },
    {
        "source_sentence": "常為他故，為靜他故，為調伏他故，為滅盡他故，常不懈慢堅牢不退，",
        "translation": "They are always for the sake of others, to pacify others, to tame others, and to extinguish others. They are always unremitting, not conceited, steadfast, firm, and undaunted.",
        "source": "T13n0397_028:0192b24_9"
    },
    {
        "source_sentence": "心善安止於大悲中，常勤精進而為眾生，故名勇進。",
        "translation": "Their minds are well settled in great compassion, and they always diligently exert themselves for the sake of sentient beings; therefore, they're called courageous.",
        "source": "T13n0397_028:0192b26_10"
    },
    {
        "source_sentence": "菩薩行時，步步御心悉向菩提，常觀眾生為化度故，雖作是觀不起煩惱，",
        "translation": "“When enlightening beings practice, they proceed step-by-step with self-control over their minds and all turn toward enlightenment. They always observe sentient beings for the sake of liberation; even though they do so, they contemplate thus to prevent affliction.",
        "source": "T13n0397_028:0192b27_11"
    },
    {
        "source_sentence": "是名菩薩勇進無盡。",
        "translation": "This is called a bodhisattva's inexhaustible courageous effort.",
        "source": "T13n0397_028:0192b29_12"
    },
    {
        "source_sentence": "「云何菩薩修習無盡？",
        "translation": "How does a bodhisattva's cultivation have no limit?",
        "source": "T13n0397_028:0192c01_0"
    },
    {
        "source_sentence": "如所發起一切善心，常願菩提，是名菩薩修集無盡。",
        "translation": "As they give rise to all good thoughts and always wish for enlightenment, this is called a bodhisattva's cultivation of inexhaustibility.",
        "source": "T13n0397_028:0192c01_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_028:0192c02_2"
    },
    {
        "source_sentence": "以諸善根迴向阿耨多羅三藐三菩提，初無盡故。",
        "translation": "Because the good roots are directed back to unsurpassed, correct, and complete enlightenment, the first one is inexhaustible.",
        "source": "T13n0397_028:0192c02_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0192c04_0"
    },
    {
        "source_sentence": "譬如天雨，一渧之水墮大海中，其渧雖微終無滅盡。",
        "translation": "It's like when a drop of rain from the sky falls into the ocean, and even though it's small, it doesn't cease.",
        "source": "T13n0397_028:0192c04_1"
    },
    {
        "source_sentence": "菩薩善根願向菩提，亦復如是無有滅盡。",
        "translation": "So it is with the bodhisattva's good roots and vows that lead to enlightenment, which have no end.",
        "source": "T13n0397_028:0192c05_2"
    },
    {
        "source_sentence": "修集善根者，所謂正迴向修集善根，為護眾生修集善根，為隨眾生諸所須故修集善根，",
        "translation": "Cultivating and accumulating roots of goodness means cultivating roots of goodness with right dedication. They cultivate and accumulate roots of goodness in order to protect sentient beings, and they cultivate and accumulate roots of goodness in order to follow the needs of sentient beings.",
        "source": "T13n0397_028:0192c06_3"
    },
    {
        "source_sentence": "為欲成就一切智故修集善根，是名菩薩修集無盡。",
        "translation": "To cultivate the accumulation of good roots because they want to achieve omniscience, this is called a bodhisattva's cultivation of inexhaustibility.",
        "source": "T13n0397_028:0192c08_4"
    },
    {
        "source_sentence": "「云何菩薩教化無盡？",
        "translation": "How is the bodhisattva's teaching inexhaustible?",
        "source": "T13n0397_028:0192c10_0"
    },
    {
        "source_sentence": "眾生之性不可稱計，菩薩於中不應稱計。",
        "translation": "The nature of sentient beings can't be measured, and bodhisattvas shouldn't measure it.",
        "source": "T13n0397_028:0192c10_1"
    },
    {
        "source_sentence": "若言一日教化三千大千世界滿中眾生，如是計數乃至無量不可思議不可稱劫教化眾生者，",
        "translation": "If someone says one day he teaches and transforms 3,000 great one-thousand worlds in a single day to fill them with sentient beings, such a calculation goes so far as to teach and transform sentient beings for measureless, inconceivable, incalculable eons.",
        "source": "T13n0397_028:0192c11_2"
    },
    {
        "source_sentence": "雖作如是教化眾生，不可稱計不可思議，於眾生分猶未是教化百分千分百千分百千萬分，",
        "translation": "Even though they teach sentient beings in this way, they can't be measured or counted as inconceivable, and yet the share of sentient beings isn't even a hundredth part, a thousandth part, a hundredth part, a hundredth part, a hundredth part, or a hundredth part of a million parts.",
        "source": "T13n0397_028:0192c13_3"
    },
    {
        "source_sentence": "乃至算數譬喻所知眾生。",
        "translation": "It's even a calculation of the number of metaphors that know sentient beings.",
        "source": "T13n0397_028:0192c15_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_028:0192c16_5"
    },
    {
        "source_sentence": "是眾生性無量無邊，不可稱計、不可思議。",
        "translation": "The nature of sentient beings is immeasurable, limitless, incalculable, and inconceivable.",
        "source": "T13n0397_028:0192c16_6"
    },
    {
        "source_sentence": "若菩薩聞作是說，不驚不怖不畏，當知是菩薩勤修精進，是名菩薩教化無盡。",
        "translation": "If a bodhisattva hears such a teaching and isn't frightened or terrified by it, you should know that this is a bodhisattva who diligently cultivates effort, which is called a bodhisattva's inexhaustible instruction.",
        "source": "T13n0397_028:0192c17_7"
    },
    {
        "source_sentence": "「云何菩薩助道無盡？",
        "translation": "How is the bodhisattva's aid to the path inexhaustible?",
        "source": "T13n0397_028:0192c19_8"
    },
    {
        "source_sentence": "菩薩所修助道功德無量無邊，菩薩於中不應限量。",
        "translation": "The merit of the aids to the path cultivated by bodhisattvas is immeasurable and limitless, and bodhisattvas shouldn't limit themselves to them.",
        "source": "T13n0397_028:0192c19_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_028:0192c20_10"
    },
    {
        "source_sentence": "一切眾生所有功德，若去來、現在，及聲聞緣覺所有功德，於佛世尊始是成就一毛孔功德。",
        "translation": "All the merits of all sentient beings, whether past, future, or present, as well as the merits of śrāvakas and pratyekbuddhas, are first accomplished by the Bhagavān in terms of the merit of a single pore.",
        "source": "T13n0397_028:0192c21_0"
    },
    {
        "source_sentence": "如是一一毛孔所有功德，乃至一切毛孔功德，聚集成就始成如來一隨形好。",
        "translation": "Thus, the merit of one single pore and all the merits of all pores are gathered together and accomplished to form the Tathāgata's single secondary appearance.",
        "source": "T13n0397_028:0192c23_1"
    },
    {
        "source_sentence": "如是一一隨形好等，乃至一切隨形好功德，聚集成就如是成就如來一相。",
        "translation": "Thus, each one of these secondary characteristics and so forth, up to the merit of all secondary characteristics, are gathered together to accomplish such-and-such accomplishment of the Tathāgata's single characteristic.",
        "source": "T13n0397_028:0192c24_2"
    },
    {
        "source_sentence": "如是一一相至三十相，聚集如是三十相百倍功德，始成如來眉間毫相。",
        "translation": "Thus, each one of these marks up to the thirty marks gathered together like these thirty marks with a hundredfold merit, and they begin to form the tuft of hair between the Tathāgata's eyebrows.",
        "source": "T13n0397_028:0192c26_3"
    },
    {
        "source_sentence": "乃至修集倍是毫相百千功德，始成如來無見頂相。",
        "translation": "Up to the cultivation and accumulation of doubling these marks are a hundred thousand merits that begin to create the Tathāgata's invisible topknot.",
        "source": "T13n0397_028:0192c28_4"
    },
    {
        "source_sentence": "是名菩薩助道功德無盡。",
        "translation": "This is called the bodhisattva's inexhaustible merit of assisting the path.",
        "source": "T13n0397_028:0192c29_5"
    },
    {
        "source_sentence": "「云何菩薩助智無盡？",
        "translation": "How is the bodhisattva's auxiliary knowledge inexhaustible?",
        "source": "T13n0397_028:0193a01_6"
    },
    {
        "source_sentence": "菩薩所修助智無量無邊，菩薩於中不應限數。",
        "translation": "The aids to knowledge cultivated by bodhisattvas are immeasurable and limitless, and bodhisattvas shouldn't count them.",
        "source": "T13n0397_028:0193a01_7"
    },
    {
        "source_sentence": "若三千大千世界所有眾生，如一信行所成就智，如是信行，比一法行所成就智，",
        "translation": "If all sentient beings in the great manifold cosmos were to attain knowledge based on one practice of faith, such a practice of faith would be less than the knowledge attained by one practice of the Dharma.",
        "source": "T13n0397_028:0193a02_8"
    },
    {
        "source_sentence": "百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "A hundred parts, a thousand parts, a hundred thousand parts, and a hundred million parts are unfathomable even in terms of calculations and metaphors.",
        "source": "T13n0397_028:0193a04_9"
    },
    {
        "source_sentence": "若三千大千世界眾生悉為法行，比一八人所成就智，百分千分百千分百千萬分，",
        "translation": "If all sentient beings in the 3,000 great one-thousand worlds were to practice the Dharma, it would be a hundredth of a thousand parts, a hundred thousand parts, a hundred thousand parts, a hundred thousand parts, and a million parts higher than the knowledge accomplished by one or eight people.",
        "source": "T13n0397_028:0193a05_10"
    },
    {
        "source_sentence": "乃至算數譬喻所不能及。",
        "translation": "It's beyond the ability of calculation and metaphor.",
        "source": "T13n0397_028:0193a07_11"
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉為八人智，比一須陀洹所成就智，百分千分百千分百千萬分，",
        "translation": "If all the sentient beings in the 3,000 great one-thousand worlds had all eight kinds of human cognition, it would be a hundredth part, a thousand parts, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part.",
        "source": "T13n0397_028:0193a08_12"
    },
    {
        "source_sentence": "乃至算數譬喻所不能及。",
        "translation": "It's beyond the ability of calculation and metaphor.",
        "source": "T13n0397_028:0193a10_13"
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉為須陀洹智，比一斯陀含所成就智，百分千分百千分百千萬分，",
        "translation": "If all sentient beings in the 3,000 great one-thousand worlds were to attain the knowledge of stream entry, it would be a hundredth part, a thousandth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a",
        "source": "T13n0397_028:0193a10_14"
    },
    {
        "source_sentence": "乃至算數譬喻所不能及。",
        "translation": "It's beyond the ability of calculation and metaphor.",
        "source": "T13n0397_028:0193a13_15"
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉為斯陀含智，比一阿那含所成就智，百分千分百千分百千萬分，",
        "translation": "If all the sentient beings in the 3,000 great one-thousand worlds were to attain the knowledge of once-returning, it would be a hundredth part, a thousandth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth part, a hundredth",
        "source": "T13n0397_028:0193a13_16"
    },
    {
        "source_sentence": "乃至算數譬喻所不能及。",
        "translation": "It's beyond the ability of calculation and metaphor.",
        "source": "T13n0397_028:0193a15_17"
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉為阿那含智，比一阿羅漢所成就智，百分千分百千分百千萬分，",
        "translation": "If all sentient beings in the 3,000 great one-thousand worlds were to become non-returners with knowledge, it would be a hundredth of a thousandth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of",
        "source": "T13n0397_028:0193a16_18"
    },
    {
        "source_sentence": "乃至算數譬喻所不能及。",
        "translation": "It's beyond the ability of calculation and metaphor.",
        "source": "T13n0397_028:0193a18_19"
    },
    {
        "source_sentence": "若三千大千世界所有眾生，悉為阿羅漢智，比一緣覺所成就智，百分千分百千分百千萬分，",
        "translation": "If all the sentient beings in the 3,000 great one-thousand worlds were to become arhats, it would be a hundredth of a thousandth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundred",
        "source": "T13n0397_028:0193a19_20"
    },
    {
        "source_sentence": "乃至算數譬喻所不能及。",
        "translation": "It's beyond the ability of calculation and metaphor.",
        "source": "T13n0397_028:0193a21_21"
    },
    {
        "source_sentence": "若三千大千世界所有眾生，悉成緣覺智，比一百劫菩薩所成就智，百分千分百千分百千萬分，",
        "translation": "If all the sentient beings in the 3,000 great one-thousand worlds were to attain the knowledge of pratyekabuddhas, it would be a hundredth of a thousand parts, a hundred thousand parts, a hundred thousand parts, and a hundred million parts higher than the knowledge accomplished by enlightening beings over one hundred eons.",
        "source": "T13n0397_028:0193a21_22"
    },
    {
        "source_sentence": "乃至算數譬喻所不能及。",
        "translation": "It's beyond the ability of calculation and metaphor.",
        "source": "T13n0397_028:0193a24_23"
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉為百劫菩薩所成就智，比一得忍菩薩所成就智，",
        "translation": "If all sentient beings in the great manifold cosmos were to attain the knowledge accomplished by enlightening beings for a hundred eons, it would be as much as the knowledge accomplished by an enlightening being who has attained patience.",
        "source": "T13n0397_028:0193a24_24"
    },
    {
        "source_sentence": "百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "A hundred parts, a thousand parts, a hundred thousand parts, and a hundred million parts are unfathomable even in terms of calculations and metaphors.",
        "source": "T13n0397_028:0193a26_25"
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉為得忍菩薩所成就智，比一不退菩薩所成就智，",
        "translation": "If all sentient beings in the great manifold cosmos were to attain the knowledge accomplished by the enlightening being Patience, it would be equal to the knowledge accomplished by a single irreversible enlightening being.",
        "source": "T13n0397_028:0193a27_26"
    },
    {
        "source_sentence": "百分千分百千分百千萬分，乃至算數譬喻所不能及。",
        "translation": "A hundred parts, a thousand parts, a hundred thousand parts, and a hundred million parts are unfathomable even in terms of calculations and metaphors.",
        "source": "T13n0397_028:0193a29_27"
    },
    {
        "source_sentence": "若三千大千世界所有眾生悉得不退菩薩智，比一補處菩薩所成就智，百分千分百千分百千萬分，",
        "translation": "If all sentient beings in the 3,000 great one-thousand worlds were to attain the nonregressing bodhisattva's knowledge, it would be a hundredth of a thousandth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a hundredth of a",
        "source": "T13n0397_028:0193b01_28"
    },
    {
        "source_sentence": "乃至算數譬喻所不能及。",
        "translation": "It's beyond the ability of calculation and metaphor.",
        "source": "T13n0397_028:0193b04_29"
    },
    {
        "source_sentence": "若無量無邊世界眾生悉如補處所成就智，比一如來是處非處智，百分千分百千分百千萬分，",
        "translation": "If the sentient beings of measureless and boundless worlds all accomplished knowledge like patchwork, it would be one-thousandth, one-thousandth, one-thousandth, one-thousandth, one-thousandth, one-thousandth, one-thousandth, one-thousandth, one-thousand",
        "source": "T13n0397_028:0193b04_30"
    },
    {
        "source_sentence": "乃至算數譬喻所不能及。",
        "translation": "It's beyond the ability of calculation and metaphor.",
        "source": "T13n0397_028:0193b06_31"
    },
    {
        "source_sentence": "總說如來諸力、無畏、不共之法，亦復如是。",
        "translation": "It's likewise with the general explanation of the Tathāgata's powers, fearlessnesses, and unique qualities.",
        "source": "T13n0397_028:0193b07_32"
    },
    {
        "source_sentence": "若菩薩聞作是說，不驚不怖不畏，當知是菩薩勤行精進。",
        "translation": "If a bodhisattva hears such a teaching and isn't frightened or terrified by it, you should know that this is a bodhisattva who diligently practices effort.",
        "source": "T13n0397_028:0193b08_33"
    },
    {
        "source_sentence": "是名菩薩助智無盡。",
        "translation": "This is called a bodhisattva's inexhaustible knowledge of the aids.",
        "source": "T13n0397_028:0193b09_34"
    },
    {
        "source_sentence": "「云何菩薩助慧無盡？",
        "translation": "How is the bodhisattva's aid to wisdom inexhaustible?",
        "source": "T13n0397_028:0193b10_35"
    },
    {
        "source_sentence": "一切眾生所有心行不可窮盡，菩薩於中不應計數。",
        "translation": "All the mental actions of all sentient beings can't be exhausted, and bodhisattvas shouldn't count them.",
        "source": "T13n0397_028:0193b10_36"
    },
    {
        "source_sentence": "若過去未來現在眾生所有心行，若有人於一念中具如是等三世眾生所有心行，",
        "translation": "“Furthermore, if someone possesses in a single thought all the mental states of sentient beings of past, future, and present, he or she will be endowed with these mental states of sentient beings of all times.",
        "source": "T13n0397_028:0193b11_37"
    },
    {
        "source_sentence": "如是念念皆亦如是具諸心行。",
        "translation": "Each thought in this way is likewise endowed with mental formations.",
        "source": "T13n0397_028:0193b13_38"
    },
    {
        "source_sentence": "如一人心中所具心行，一切無量無邊眾生皆亦如是。",
        "translation": "Just as one person's mind is endowed with mental functioning in his mind, so are all the measureless and limitless sentient beings likewise.",
        "source": "T13n0397_028:0193b14_39"
    },
    {
        "source_sentence": "若過去未來現在眾生，所有貪婬瞋恚愚癡及諸煩惱，若有一人於一念中具如是等三世眾生所有煩惱，",
        "translation": "“Furthermore, suppose there is a man who possesses in one thought all the desires, hatred, delusions, and afflictions of past, future, and present sentient beings.",
        "source": "T13n0397_028:0193b15_40"
    },
    {
        "source_sentence": "如是念念皆亦如是具諸煩惱無量無邊。",
        "translation": "Each thought in this way is likewise endowed with the afflictions that are immeasurable and limitless.",
        "source": "T13n0397_028:0193b18_0"
    },
    {
        "source_sentence": "如一人心中所具諸結，一切無量無邊眾生皆亦如是。",
        "translation": "Just as the bonds that are contained in a single person's mind, so are all the limitless and limitless sentient beings likewise.",
        "source": "T13n0397_028:0193b18_1"
    },
    {
        "source_sentence": "菩薩於中生慧光明，一念慧光無諸塵翳，悉照過去未來現在眾生煩惱諸心所緣境界生住滅相無有遺餘，",
        "translation": "In them the enlightening being produces light of wisdom, and in a single thought of light of wisdom there is no dust or dirt. It illumines all past, future, and present sentient beings with the characteristics of birth, existence, and cessation as objects of afflictions, without leaving any residue.",
        "source": "T13n0397_028:0193b20_2"
    },
    {
        "source_sentence": "是菩薩於諸眾生三世相應諸煩惱等無不盡知。",
        "translation": "This is the bodhisattva's inexhaustible knowledge of the afflictions and so forth that are associated with the three worlds of sentient beings.",
        "source": "T13n0397_028:0193b22_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0193b23_4"
    },
    {
        "source_sentence": "譬如虛空無所不覆，菩薩慧光亦復如是無所不照。",
        "translation": "Just as space is unobstructed by anything, so too does the enlightening being’s light of wisdom illuminate everything.",
        "source": "T13n0397_028:0193b23_5"
    },
    {
        "source_sentence": "若菩薩聞作是說，不驚不怖不畏，當知是菩薩勤行精進。",
        "translation": "If a bodhisattva hears such a teaching and isn't frightened or terrified by it, you should know that this is a bodhisattva who diligently practices effort.",
        "source": "T13n0397_028:0193b25_6"
    },
    {
        "source_sentence": "是名菩薩助慧無盡。",
        "translation": "This is called the bodhisattva's inexhaustible wisdom of assisting others.",
        "source": "T13n0397_028:0193b26_7"
    },
    {
        "source_sentence": "「云何菩薩修集助佛法無盡？",
        "translation": "How does a bodhisattva's cultivation and accumulation of the Buddha's teachings help the Buddha's teachings without end?",
        "source": "T13n0397_028:0193b27_0"
    },
    {
        "source_sentence": "菩薩所行修助佛法無量無邊。",
        "translation": "The cultivation of the bodhisattva's practice assists the Buddha's teaching that is immeasurable and limitless.",
        "source": "T13n0397_028:0193b27_1"
    },
    {
        "source_sentence": "若菩薩於中不應限量，從初發心至坐道場，於其中間，修行具足六波羅蜜，",
        "translation": "If a bodhisattva doesn’t have limited scope, he should go from the first arousal of mind to sit at the seat of enlightenment and cultivate the six transcendent ways among them.",
        "source": "T13n0397_028:0193b28_2"
    },
    {
        "source_sentence": "修行具足諸助道法。",
        "translation": "He cultivates the practice that's replete with the factors that aid in the path.",
        "source": "T13n0397_028:0193c01_3"
    },
    {
        "source_sentence": "如是一切發心修行一切善根，不可稱計悉助佛法，是名菩薩修助佛法而無有盡。",
        "translation": "Thus, all those who arouse their minds and cultivate all good roots that can't be called fully assisting the Buddha's teachings are called bodhisattvas cultivating the aids to the Buddha's teachings without limit.",
        "source": "T13n0397_028:0193c01_4"
    },
    {
        "source_sentence": "是名菩薩八事修行精進無盡。",
        "translation": "These are called the eight things that make a bodhisattva’s effort of cultivation inexhaustible.",
        "source": "T13n0397_028:0193c03_5"
    },
    {
        "source_sentence": "「復次，舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T13n0397_028:0193c05_0"
    },
    {
        "source_sentence": "菩薩精進亦不可盡。",
        "translation": "The bodhisattva's effort can't be exhausted, either.",
        "source": "T13n0397_028:0193c05_1"
    },
    {
        "source_sentence": "若身善業、若口善業、若意善業常勤不住。",
        "translation": "Whether it's good physical actions, good verbal actions, or good mental actions, they always strive and don't abide.",
        "source": "T13n0397_028:0193c05_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_028:0193c06_3"
    },
    {
        "source_sentence": "菩薩所作精進，常與身口意相應。",
        "translation": "The effort that the bodhisattva makes is always associated with body, speech, and thought.",
        "source": "T13n0397_028:0193c06_4"
    },
    {
        "source_sentence": "雖身口精進皆由於心，心為增上。",
        "translation": "Although bodily and verbal effort are all due to awarenesses, awarenesses are predominant.",
        "source": "T13n0397_028:0193c07_5"
    },
    {
        "source_sentence": "「云何菩薩心精進耶？",
        "translation": "“What is the mental exertion of a bodhisattva?",
        "source": "T13n0397_028:0193c08_6"
    },
    {
        "source_sentence": "所謂心始心終。",
        "translation": "It's called the beginning of mind and the end of mind.",
        "source": "T13n0397_028:0193c09_0"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c09_1"
    },
    {
        "source_sentence": "初發心故；",
        "translation": "Because they are the first to give rise to mind.",
        "source": "T13n0397_028:0193c09_2"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c09_3"
    },
    {
        "source_sentence": "菩提心寂滅故。",
        "translation": "It's because the mind of enlightenment is tranquil.",
        "source": "T13n0397_028:0193c10_4"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c10_5"
    },
    {
        "source_sentence": "於諸眾生起大悲故；",
        "translation": "It is because great compassion arises for sentient beings.",
        "source": "T13n0397_028:0193c10_6"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c11_7"
    },
    {
        "source_sentence": "無我人故。",
        "translation": "It's because there's no self or person.",
        "source": "T13n0397_028:0193c11_8"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c11_9"
    },
    {
        "source_sentence": "攝眾生故；",
        "translation": "It is to embrace sentient beings.",
        "source": "T13n0397_028:0193c11_10"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c12_11"
    },
    {
        "source_sentence": "不取諸法故。",
        "translation": "It's because they don't grasp the dharmas.",
        "source": "T13n0397_028:0193c12_12"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c12_13"
    },
    {
        "source_sentence": "不厭生死故；",
        "translation": "Because they do not reject birth and death.",
        "source": "T13n0397_028:0193c13_0"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c13_1"
    },
    {
        "source_sentence": "無三界故。",
        "translation": "It's because there are no three realms.",
        "source": "T13n0397_028:0193c13_2"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c13_3"
    },
    {
        "source_sentence": "捨所有故；",
        "translation": "It is because they abandon all that exists.",
        "source": "T13n0397_028:0193c14_4"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c14_5"
    },
    {
        "source_sentence": "無所輕故。",
        "translation": "It's because there's nothing to despise.",
        "source": "T13n0397_028:0193c14_6"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c14_7"
    },
    {
        "source_sentence": "受持戒故；",
        "translation": "Because they receive and keep the precepts.",
        "source": "T13n0397_028:0193c15_8"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c15_9"
    },
    {
        "source_sentence": "不持戒故。",
        "translation": "It's because they don't observe precepts.",
        "source": "T13n0397_028:0193c15_10"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c15_11"
    },
    {
        "source_sentence": "修行忍故；",
        "translation": "Because they cultivate patience.",
        "source": "T13n0397_028:0193c16_12"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c16_13"
    },
    {
        "source_sentence": "無忿諍故。",
        "translation": "It's because there's no anger.",
        "source": "T13n0397_028:0193c16_14"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c16_15"
    },
    {
        "source_sentence": "發行諸善故；",
        "translation": "It is because it produces goodness.",
        "source": "T13n0397_028:0193c17_16"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c17_17"
    },
    {
        "source_sentence": "獨不雜故。",
        "translation": "It's because it's alone and not mixed.",
        "source": "T13n0397_028:0193c17_18"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c17_19"
    },
    {
        "source_sentence": "修集定故；",
        "translation": "Because they cultivate the absorption of accumulation.",
        "source": "T13n0397_028:0193c18_20"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c18_21"
    },
    {
        "source_sentence": "心清淨故。",
        "translation": "It's because the mind is pure.",
        "source": "T13n0397_028:0193c18_22"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c18_23"
    },
    {
        "source_sentence": "多聞無厭故；",
        "translation": "They are well learned because they do not tire of learning.",
        "source": "T13n0397_028:0193c19_24"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c19_25"
    },
    {
        "source_sentence": "善思惟故。",
        "translation": "It's because they well contemplate.",
        "source": "T13n0397_028:0193c19_26"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c20_0"
    },
    {
        "source_sentence": "習問義故；",
        "translation": "Because of being accustomed to questions and meanings.",
        "source": "T13n0397_028:0193c20_1"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c20_2"
    },
    {
        "source_sentence": "法無言說故。",
        "translation": "It's because dharmas lack words and explanations.",
        "source": "T13n0397_028:0193c20_3"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c21_4"
    },
    {
        "source_sentence": "求智慧故；",
        "translation": "It is because they seek wisdom.",
        "source": "T13n0397_028:0193c21_5"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c21_6"
    },
    {
        "source_sentence": "斷戲論故。",
        "translation": "It's because they stop conceptual elaborations.",
        "source": "T13n0397_028:0193c21_7"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c22_8"
    },
    {
        "source_sentence": "修四梵行故；",
        "translation": "They cultivate the four practices of austerity.",
        "source": "T13n0397_028:0193c22_9"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c22_10"
    },
    {
        "source_sentence": "捨真智故。",
        "translation": "It's because they abandon true cognition.",
        "source": "T13n0397_028:0193c22_11"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c23_12"
    },
    {
        "source_sentence": "具五通故；",
        "translation": "They are endowed with the five supernormal knowledges:",
        "source": "T13n0397_028:0193c23_13"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c23_14"
    },
    {
        "source_sentence": "具漏盡故。",
        "translation": "It's because the contaminants have ended.",
        "source": "T13n0397_028:0193c23_15"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c24_16"
    },
    {
        "source_sentence": "發念處故；",
        "translation": "It is the seat of mindfulness.",
        "source": "T13n0397_028:0193c24_17"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c24_18"
    },
    {
        "source_sentence": "念無思惟故。",
        "translation": "It's because mindfulness is without contemplation.",
        "source": "T13n0397_028:0193c24_19"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c25_20"
    },
    {
        "source_sentence": "發正勤故；",
        "translation": "It is due to the arousal of right effort.",
        "source": "T13n0397_028:0193c25_21"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c25_22"
    },
    {
        "source_sentence": "脫善不善故。",
        "translation": "It's because they're liberated from what's good and unwholesome.",
        "source": "T13n0397_028:0193c25_23"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c26_24"
    },
    {
        "source_sentence": "發如意分故；",
        "translation": "It is because they give rise to the state of supernormal power.",
        "source": "T13n0397_028:0193c26_25"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c26_26"
    },
    {
        "source_sentence": "具報得故。",
        "translation": "It's because the full reward is attained.",
        "source": "T13n0397_028:0193c27_27"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c27_28"
    },
    {
        "source_sentence": "發諸根方便故；",
        "translation": "It is because they develop the faculties and means of enlightenment.",
        "source": "T13n0397_028:0193c27_29"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c27_30"
    },
    {
        "source_sentence": "觀諸根法故。",
        "translation": "It's because he observes the faculties and dharmas.",
        "source": "T13n0397_028:0193c28_31"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c28_32"
    },
    {
        "source_sentence": "集諸力故；",
        "translation": "It is because of the accumulation of all powers.",
        "source": "T13n0397_028:0193c28_33"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0193c29_0"
    },
    {
        "source_sentence": "智不壞故。",
        "translation": "It's because knowledge doesn't break down.",
        "source": "T13n0397_028:0193c29_1"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0193c29_2"
    },
    {
        "source_sentence": "發助菩提分故；",
        "translation": "They give rise to the aids to enlightenment.",
        "source": "T13n0397_028:0193c29_3"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a01_4"
    },
    {
        "source_sentence": "善知分別諸學方便故。",
        "translation": "It's because they well know the method of discerning training.",
        "source": "T13n0397_028:0194a01_5"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0194a01_6"
    },
    {
        "source_sentence": "求助道法故；",
        "translation": "They seek to aid in the Teaching of enlightenment.",
        "source": "T13n0397_028:0194a02_7"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a02_8"
    },
    {
        "source_sentence": "無進趣故。",
        "translation": "It's because there's no advancement.",
        "source": "T13n0397_028:0194a02_9"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0194a03_0"
    },
    {
        "source_sentence": "求寂滅故；",
        "translation": "It is because they seek nirvana.",
        "source": "T13n0397_028:0194a03_1"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a03_2"
    },
    {
        "source_sentence": "心永寂滅故。",
        "translation": "It's because the mind is permanently extinguished.",
        "source": "T13n0397_028:0194a03_3"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0194a04_4"
    },
    {
        "source_sentence": "發起慧故；",
        "translation": "It is because they produce wisdom.",
        "source": "T13n0397_028:0194a04_5"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a04_6"
    },
    {
        "source_sentence": "善知法故。",
        "translation": "It's because they well know the teaching.",
        "source": "T13n0397_028:0194a04_7"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0194a05_8"
    },
    {
        "source_sentence": "覺知因故；",
        "translation": "Because it is the cause of perception and knowledge.",
        "source": "T13n0397_028:0194a05_9"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a05_10"
    },
    {
        "source_sentence": "善知因故。",
        "translation": "It's because they well know the causes.",
        "source": "T13n0397_028:0194a05_11"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0194a06_12"
    },
    {
        "source_sentence": "從他聞故；",
        "translation": "Because it is heard from others.",
        "source": "T13n0397_028:0194a06_13"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a06_14"
    },
    {
        "source_sentence": "於諸法中無放逸故。",
        "translation": "It's because there's no carelessness in all dharmas.",
        "source": "T13n0397_028:0194a06_15"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0194a07_16"
    },
    {
        "source_sentence": "發嚴飾故；",
        "translation": "Because they give rise to adornment.",
        "source": "T13n0397_028:0194a07_17"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a07_18"
    },
    {
        "source_sentence": "知身性故。",
        "translation": "It's because they know the nature of the body.",
        "source": "T13n0397_028:0194a08_19"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0194a08_20"
    },
    {
        "source_sentence": "莊嚴口故；",
        "translation": "Because they adorn their mouths.",
        "source": "T13n0397_028:0194a08_21"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a08_22"
    },
    {
        "source_sentence": "聖默然故。",
        "translation": "It's because the noble one is silent.",
        "source": "T13n0397_028:0194a09_23"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0194a09_24"
    },
    {
        "source_sentence": "行三脫故；",
        "translation": "Because they practice the three liberations.",
        "source": "T13n0397_028:0194a09_25"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a09_26"
    },
    {
        "source_sentence": "無所作故。",
        "translation": "It's because there's nothing to do.",
        "source": "T13n0397_028:0194a10_27"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0194a10_28"
    },
    {
        "source_sentence": "降四魔故；",
        "translation": "It is because they subdue the four devils.",
        "source": "T13n0397_028:0194a10_29"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a10_30"
    },
    {
        "source_sentence": "捨結習故。",
        "translation": "It's because they abandon the bond of accumulation.",
        "source": "T13n0397_028:0194a11_31"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0194a11_32"
    },
    {
        "source_sentence": "知方便故；",
        "translation": "Because they know the means of liberation.",
        "source": "T13n0397_028:0194a11_33"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a11_34"
    },
    {
        "source_sentence": "了於慧故。",
        "translation": "It's because they understand wisdom.",
        "source": "T13n0397_028:0194a12_35"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0194a12_36"
    },
    {
        "source_sentence": "善知發故；",
        "translation": "Because they know well the arousal of enlightenment.",
        "source": "T13n0397_028:0194a12_37"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a12_38"
    },
    {
        "source_sentence": "善知度故。",
        "translation": "It's because they well know and liberate.",
        "source": "T13n0397_028:0194a13_39"
    },
    {
        "source_sentence": "云何心始？",
        "translation": "What's the beginning of mind?",
        "source": "T13n0397_028:0194a13_40"
    },
    {
        "source_sentence": "知世俗故；",
        "translation": "Because they know the conventional.",
        "source": "T13n0397_028:0194a13_41"
    },
    {
        "source_sentence": "云何心終？",
        "translation": "What is the end of thought?",
        "source": "T13n0397_028:0194a13_42"
    },
    {
        "source_sentence": "善知真諦故。",
        "translation": "It's because they well know the true truth.",
        "source": "T13n0397_028:0194a14_43"
    },
    {
        "source_sentence": "是名菩薩心精進也。",
        "translation": "This is called a bodhisattva's mental exertion.",
        "source": "T13n0397_028:0194a14_44"
    },
    {
        "source_sentence": "是心具足精進無盡故說始終。",
        "translation": "It's because the mind is replete with inexhaustible effort that it's explained from beginning to end.",
        "source": "T13n0397_028:0194a14_45"
    },
    {
        "source_sentence": "菩薩具足如是作相，而心未常住於作業，是菩薩於諸業相知而故作。",
        "translation": "A bodhisattva who possesses such a mark of doing and doesn't always abide in actions with his mind, this is a bodhisattva who knows the marks of actions and therefore does them.",
        "source": "T13n0397_028:0194a15_46"
    },
    {
        "source_sentence": "云何菩薩知而故作？",
        "translation": "How does a bodhisattva knowingly do so?",
        "source": "T13n0397_028:0194a17_47"
    },
    {
        "source_sentence": "為諸善根故。",
        "translation": "It's because of the good roots.",
        "source": "T13n0397_028:0194a17_48"
    },
    {
        "source_sentence": "為諸眾生修大悲故不離有為，為一切佛真妙智故不隨生死，是名菩薩摩訶薩毘梨耶波羅蜜而不可盡。」",
        "translation": "For the sake of sentient beings cultivating great compassion, they don't part with conditioned things and for the sake of the true marvelous knowledge of all buddhas they don't follow birth and death, which is called the bodhisattva-mahāsattva's inexhaustible prajñāpāramitā.",
        "source": "T13n0397_028:0194a18_0"
    },
    {
        "source_sentence": "說是法時，七十那由他諸天及人發阿耨多羅三藐三菩提心，三萬二千菩薩摩訶薩得無生法忍。",
        "translation": "When he taught this teaching, seventy-thousand gods and humans aroused the mind of unsurpassed, correct, and complete enlightenment, and thirty-two thousand bodhisattvas and mahāsattvas attained the forbearance of the nonarising of the Dharma.",
        "source": "T13n0397_028:0194a20_1"
    },
    {
        "source_sentence": "◎◎爾時，舍利弗語無盡意言：「善哉，善哉！",
        "translation": "At that point, Śāriputra said inexhaustibly, Good, good!",
        "source": "T13n0397_028:0194a22_2"
    },
    {
        "source_sentence": "唯，善男子！",
        "translation": "Yes, good man!",
        "source": "T13n0397_028:0194a23_3"
    },
    {
        "source_sentence": "仁已快說菩薩毘梨耶波羅蜜而不可盡。",
        "translation": "You've quickly explained the bodhisattva's pārājika-pāramitā, but it can't be exhausted.",
        "source": "T13n0397_028:0194a24_4"
    },
    {
        "source_sentence": "唯願仁者，當說菩薩禪波羅蜜，如諸菩薩所得無盡禪波羅蜜。」",
        "translation": "Please, my dear friend, explain the bodhisattva's perfection of meditation, just as the bodhisattvas attain the inexhaustible perfection of meditation.",
        "source": "T13n0397_028:0194a25_5"
    },
    {
        "source_sentence": "無盡意言：「若菩薩摩訶薩以十六事修行禪定而無有盡，不與聲聞辟支佛共。",
        "translation": "The inexhaustible intention said, Suppose a bodhisattva Mahāsattva cultivates meditation with 16 things that have no limit and doesn't share it with śrāvakas and pratyekbuddhas.",
        "source": "T13n0397_028:0194a26_6"
    },
    {
        "source_sentence": "何等十六？",
        "translation": "What are these sixteen?",
        "source": "T13n0397_028:0194a28_7"
    },
    {
        "source_sentence": "菩薩修定無有吾我，具足如來諸禪定故；",
        "translation": "Enlightening beings’ cultivation of concentration has no self, because they are endowed with the meditations of buddhas.",
        "source": "T13n0397_028:0194a28_8"
    },
    {
        "source_sentence": "菩薩修定不味不著，不求己樂故；",
        "translation": "Enlightening beings cultivate concentration without taste or attachment, because they do not seek their own happiness.",
        "source": "T13n0397_028:0194a29_9"
    },
    {
        "source_sentence": "菩薩修定行於大悲，斷諸眾生煩惱結故；",
        "translation": "Enlightening beings’ practice of concentration is based on great compassion, getting rid of the bonds of afflictions of sentient beings.",
        "source": "T13n0397_028:0194b01_10"
    },
    {
        "source_sentence": "菩薩修定增益諸禪觀，見欲界諸過患故；",
        "translation": "Enlightening beings cultivate concentration and increase meditative contemplation, because they see the faults and distress of the realm of desire.",
        "source": "T13n0397_028:0194b02_11"
    },
    {
        "source_sentence": "菩薩修定具諸通業，為知眾生諸心行故；",
        "translation": "Enlightening beings cultivate all the activities of concentration, because they know sentient beings’ mental patterns.",
        "source": "T13n0397_028:0194b03_12"
    },
    {
        "source_sentence": "菩薩修定其心柔軟，於眾生中得自在故；",
        "translation": "Enlightening beings’ cultivation of concentration makes their minds flexible, because they attain mastery over sentient beings.",
        "source": "T13n0397_028:0194b04_13"
    },
    {
        "source_sentence": "菩薩修定諸禪三昧善知入出，過於色界無色界故；",
        "translation": "“Enlightening beings cultivate concentration and meditative absorptions, well knowing entry and exit because they are beyond the realm of form and beyond the one of formlessness.",
        "source": "T13n0397_028:0194b05_0"
    },
    {
        "source_sentence": "菩薩修定其心寂滅，勝於二乘諸禪三昧故；",
        "translation": "Enlightening beings’ cultivation of concentration makes their minds tranquil, surpassing the meditations and concentrations of the two vehicles.",
        "source": "T13n0397_028:0194b06_1"
    },
    {
        "source_sentence": "菩薩修定更無有發，畢竟已作故；",
        "translation": "There is no further arousal of the enlightening beings’ cultivation of concentration, because they have already done it after all.",
        "source": "T13n0397_028:0194b07_2"
    },
    {
        "source_sentence": "菩薩修定無諸衰耗，善斷除滅諸習氣故；",
        "translation": "Enlightening beings cultivate concentration without weariness, because they skillfully eliminate and extinguish the habit energy.",
        "source": "T13n0397_028:0194b08_0"
    },
    {
        "source_sentence": "菩薩修定常入智慧，過諸世間到彼岸故；",
        "translation": "Enlightening beings cultivate concentration and always enter wisdom, transcending all worlds to reach the other shore.",
        "source": "T13n0397_028:0194b08_1"
    },
    {
        "source_sentence": "菩薩修定為知眾生心，度脫一切諸眾生故；",
        "translation": "Enlightening beings cultivate concentration to know the minds of sentient beings, because they liberate all sentient beings.",
        "source": "T13n0397_028:0194b09_2"
    },
    {
        "source_sentence": "菩薩修定不斷三寶種，具足無盡諸禪定故；",
        "translation": "Enlightening beings’ cultivation of concentration does not stop the seeds of the three treasures, because they are endowed with inexhaustible meditations.",
        "source": "T13n0397_028:0194b10_3"
    },
    {
        "source_sentence": "菩薩修定無有退失，其心常定無諸錯謬故；",
        "translation": "Enlightening beings cultivate concentration without regressing, because their minds are always concentrated and free from error.",
        "source": "T13n0397_028:0194b11_4"
    },
    {
        "source_sentence": "菩薩修定而得自在，具足一切諸善法故；",
        "translation": "Enlightening beings cultivate concentration and attain mastery because they are endowed with all good qualities.",
        "source": "T13n0397_028:0194b13_0"
    },
    {
        "source_sentence": "菩薩修定內善思惟，斷入出息得勝智故。",
        "translation": "A bodhisattva cultivates good contemplation within concentration because he stops entering and exhaling and attains superior cognition.",
        "source": "T13n0397_028:0194b13_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0194b14_2"
    },
    {
        "source_sentence": "是名菩薩以十六事修行禪定而無有盡，不與聲聞辟支佛共。",
        "translation": "This is called a bodhisattva who cultivates meditation with 16 things without limit and doesn't share it with śrāvakas and pratyekbuddhas.",
        "source": "T13n0397_028:0194b15_3"
    },
    {
        "source_sentence": "「云何名為菩薩修定，具諸通智故？",
        "translation": "What's called a bodhisattva cultivating concentration because he possesses the supernormal knowledges?",
        "source": "T13n0397_028:0194b16_4"
    },
    {
        "source_sentence": "云何為通？",
        "translation": "What is supernormal knowledge?",
        "source": "T13n0397_028:0194b17_5"
    },
    {
        "source_sentence": "云何為智？",
        "translation": "What is knowledge?",
        "source": "T13n0397_028:0194b17_6"
    },
    {
        "source_sentence": "若見諸色相是名為通，若知一切色盡法性而不證盡是名為智。",
        "translation": "If he sees the characteristics of form, this is called supernormal knowledge; if he knows the Dharma nature of all forms and doesn't realize their exhaustion, this is called cognition.",
        "source": "T13n0397_028:0194b17_7"
    },
    {
        "source_sentence": "若聞音聲是名為通，解了三世一切音聲無言辭相是名為智。",
        "translation": "If someone hears sounds, this is called supernormal knowledge, and understands all sounds in the three times without words or marks of speech is called cognition.",
        "source": "T13n0397_028:0194b19_8"
    },
    {
        "source_sentence": "若知一切眾生心行是名為通，若知心行悉皆滅盡不證於滅是名為智。",
        "translation": "If someone knows that the mental actions of all sentient beings are called supernormal knowledge, and if they know that all mental actions cease completely and don't realize cessation, this is called cognition.",
        "source": "T13n0397_028:0194b20_9"
    },
    {
        "source_sentence": "若念過去是名為通，若知三世無有罣礙是名為智。",
        "translation": "If mindfulness of the past is called supernormal knowledge, and if one knows that there are no obstructions in the three times, this is called wisdom.",
        "source": "T13n0397_028:0194b22_10"
    },
    {
        "source_sentence": "若能遍至諸佛世界是名為通，若知佛界同虛空相是名為智。",
        "translation": "If they can pervade all the buddha worlds, this is called penetration, and if they know that the buddha realm has the same characteristics as space, this is called cognition.",
        "source": "T13n0397_028:0194b23_11"
    },
    {
        "source_sentence": "若求諸法無破壞相是名為通，若不見法是名為智。",
        "translation": "If someone seeks the dharmas without destructive characteristics, this is called penetration, and if they don't see the dharmas, this is called cognition.",
        "source": "T13n0397_028:0194b24_12"
    },
    {
        "source_sentence": "若不壞世間是名為通，若不雜行是名為智。",
        "translation": "If the world doesn't break down, it's called supernormal knowledge, and if it doesn't mix with practice, it's called wisdom.",
        "source": "T13n0397_028:0194b26_13"
    },
    {
        "source_sentence": "若過梵釋護世天王是名為通，過於二乘學無學智，是名為智。",
        "translation": "If someone goes beyond Brahmā and Śakra, the world-protecting celestial king, this is called supernormal cognition, and they go beyond the knowledge of training and post-learning in the two vehicles, which is called wisdom.",
        "source": "T13n0397_028:0194b27_14"
    },
    {
        "source_sentence": "是名菩薩修行禪定通智差別。",
        "translation": "These are called the distinctions in the bodhisattva's cultivation of the shared wisdom of meditation.",
        "source": "T13n0397_028:0194b28_15"
    },
    {
        "source_sentence": "「唯，舍利弗！",
        "translation": "Yes, Śāriputra!",
        "source": "T13n0397_028:0194c01_0"
    },
    {
        "source_sentence": "菩薩若知一切眾生煩惱亂心，是故修集諸禪定法，助成住心。",
        "translation": "If bodhisattvas know that all sentient beings have afflicted and disturbed minds, they therefore cultivate the methods of meditation to help them become abiding minds.",
        "source": "T13n0397_028:0194c01_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0194c02_2"
    },
    {
        "source_sentence": "如是眾生煩惱心亂，菩薩於中善修聚集助成禪定，令此禪定住平等心，",
        "translation": "Thus, when sentient beings’ minds are troubled by afflictions, enlightening beings skillfully cultivate assemblages therein to aid in the accomplishment of meditation and cause these meditations to abide in equanimity.",
        "source": "T13n0397_028:0194c02_3"
    },
    {
        "source_sentence": "是名菩薩修行禪定。",
        "translation": "This is called a bodhisattva's cultivation of meditation.",
        "source": "T13n0397_028:0194c04_4"
    },
    {
        "source_sentence": "「若住眾生平等智中，是名為定。",
        "translation": "If someone abides in the equanimous wisdom of sentient beings, this is called concentration.",
        "source": "T13n0397_028:0194c05_5"
    },
    {
        "source_sentence": "心行平等，性相平等、畢竟平等、發行平等，是名為定。",
        "translation": "The equality of mind and volition, the equality of nature and characteristics, the equality of ultimate equality, and the equality of emanation are called concentration.",
        "source": "T13n0397_028:0194c05_6"
    },
    {
        "source_sentence": "住於施戒忍辱精進禪定智慧及諸法等，是名為定。",
        "translation": "To abide in generosity, morality, forbearance, patience, effort, meditation, wisdom, and dharmas is called concentration.",
        "source": "T13n0397_028:0194c07_0"
    },
    {
        "source_sentence": "如定等者則眾生等，眾生等者則諸法等，入如是等是名為定。",
        "translation": "Just as such [things] as concentration and so on are sentient beings and so on. Such [things] as sentient beings are the dharmas and so on. Entering such [things] as these is called concentration.",
        "source": "T13n0397_028:0194c08_1"
    },
    {
        "source_sentence": "如是等定則等於空，等於空者則眾生等，眾生等者則諸法等，入如是等是名為定。",
        "translation": "Such concentrations are the same as emptiness, and when they are the same as emptiness, then sentient beings are the same. When sentient beings are the same, then all dharmas are the same. Entering such-and-such is called concentration.",
        "source": "T13n0397_028:0194c09_2"
    },
    {
        "source_sentence": "如空等者則無相等，無相等者則無願等，無願等者則無作等，無作等者則眾生等，",
        "translation": "Just as such [things] as emptiness, etc., are without characteristics and so on; the absence of characteristics and so on, means the absence of such [things] as wishes. The absence of such [things] as wishes means the absence of such [things] as action, etc.",
        "source": "T13n0397_028:0194c11_3"
    },
    {
        "source_sentence": "眾生等者則諸法等，入如是等是名為定。",
        "translation": "When sentient beings and so forth, then all dharmas and so forth enter into such-and-such is called concentration.",
        "source": "T13n0397_028:0194c13_4"
    },
    {
        "source_sentence": "自心等故他心亦等，是名為定。",
        "translation": "Because their own minds are equal, the minds of others are also equal. This is called samdhi.",
        "source": "T13n0397_028:0194c14_5"
    },
    {
        "source_sentence": "一切等者，所謂利衰如地水火風，得是等心心如虛空，無有高下常住不動，",
        "translation": "All things are like earth, water, fire, and wind. The acquisition of these minds is like space: there is neither high nor low, always abiding or not-abiding.",
        "source": "T13n0397_028:0194c15_6"
    },
    {
        "source_sentence": "所行威儀常定不轉，本性自爾不恌不高，自在無畏寂默無言，知義知法知時非時，",
        "translation": "Their deportment is always determined and unchanging. By their own nature they are not coarse or lofty; free, fearless, silent, without words, they know meanings and know principles, knowing time and non-time.",
        "source": "T13n0397_028:0194c16_7"
    },
    {
        "source_sentence": "隨世所行不雜於世，捨世八法滅一切結，遠離憒閙樂於獨處。",
        "translation": "Whatever he does in the world, he doesn't mix it with the world, abandons the eight worldly dharmas and extinguishes all bonds, parts with anger and happiness in a solitary place.",
        "source": "T13n0397_028:0194c18_8"
    },
    {
        "source_sentence": "「菩薩如是修行諸法，於諸禪定心安止住離世所作，是菩薩以方便慧入禪波羅蜜，",
        "translation": "“Thus do enlightening beings practice all the teachings, settling their minds in meditation and abiding in seclusion from worldly things: this is how enlightening beings enter the transcendent meditation of skillful means and wisdom.",
        "source": "T13n0397_028:0194c20_9"
    },
    {
        "source_sentence": "入禪定時生大悲心為諸眾生，是名方便；",
        "translation": "Producing great compassion for sentient beings at the time of entering meditation is called skillful means.",
        "source": "T13n0397_028:0194c22_10"
    },
    {
        "source_sentence": "其心永寂，是名為慧。",
        "translation": "Their minds are permanently quiescent, which is called wisdom.",
        "source": "T13n0397_028:0194c23_0"
    },
    {
        "source_sentence": "入時念佛，是名方便；",
        "translation": "Mindfulness of Buddha at the moment of entering is called ‘manifest effort’.",
        "source": "T13n0397_028:0194c23_1"
    },
    {
        "source_sentence": "不依止禪，是名為慧。",
        "translation": "Not relying on meditation, this is called wisdom.",
        "source": "T13n0397_028:0194c23_2"
    },
    {
        "source_sentence": "入時攝取一切善法，是名方便；",
        "translation": "Taking in all wholesome factors at the moment of entering is called ‘manifest effort’.",
        "source": "T13n0397_028:0194c24_3"
    },
    {
        "source_sentence": "不分別法性，是名為慧。",
        "translation": "Not discriminating the nature of dharmas is called wisdom.",
        "source": "T13n0397_028:0194c25_4"
    },
    {
        "source_sentence": "入時趣向莊嚴佛身，是名方便；",
        "translation": "To dedicate oneself at the moment of entering to adorning the buddha-body is called ‘manifesting means’.",
        "source": "T13n0397_028:0194c25_5"
    },
    {
        "source_sentence": "於佛法身不生分別，是名為慧。",
        "translation": "Not discriminating with respect to the Buddha's Dharma body, which doesn't give rise to distinctions, is called wisdom.",
        "source": "T13n0397_028:0194c26_6"
    },
    {
        "source_sentence": "入時念佛聲如梵音，是名方便；",
        "translation": "Mindfulness of the Buddha’s voice at the moment of entering is as a Sanskrit sound: this is called ‘manifest effort’.",
        "source": "T13n0397_028:0194c27_7"
    },
    {
        "source_sentence": "於法性中無言說相，是名為慧。",
        "translation": "The absence of verbal characteristics in the Dharma-nature is called wisdom.",
        "source": "T13n0397_028:0194c27_8"
    },
    {
        "source_sentence": "入時受持心如金剛，是名方便；",
        "translation": "Accepting and maintaining mind at the moment of entering is like a diamond. This is called ‘manifest effort’.",
        "source": "T13n0397_028:0194c28_9"
    },
    {
        "source_sentence": "思惟諸法本性不亂，是名為慧。",
        "translation": "To contemplate the original nature of dharmas that aren't disturbed is called wisdom.",
        "source": "T13n0397_028:0194c29_10"
    },
    {
        "source_sentence": "入時不捨本所誓願教化眾生，是名方便；",
        "translation": "When they enter, they do not give up their original vow to teach and transform sentient beings. This is called skillful means.",
        "source": "T13n0397_028:0195a01_11"
    },
    {
        "source_sentence": "於一切法思惟無我，是名為慧。",
        "translation": "To contemplate the absence of self in all things is called wisdom.",
        "source": "T13n0397_028:0195a02_12"
    },
    {
        "source_sentence": "入時思惟一切善根，是名方便；",
        "translation": "To contemplate all roots of goodness at the moment of entering is called ‘manifest effort’.",
        "source": "T13n0397_028:0195a02_13"
    },
    {
        "source_sentence": "思惟善根性無所住，是名為慧。",
        "translation": "To contemplate that the nature of good roots has no abiding, which is called wisdom.",
        "source": "T13n0397_028:0195a03_14"
    },
    {
        "source_sentence": "入時遍觀諸佛世界，是名方便；",
        "translation": "To pervade all buddha worlds at the time of entering is called skillful means.",
        "source": "T13n0397_028:0195a04_15"
    },
    {
        "source_sentence": "見諸佛界同於虛空，是名為慧。",
        "translation": "Seeing that the buddha realm is the same as space is called wisdom.",
        "source": "T13n0397_028:0195a05_0"
    },
    {
        "source_sentence": "入時莊嚴菩提道場，是名方便；",
        "translation": "To adorn the site of enlightenment at the time of entry is called skillful means.",
        "source": "T13n0397_028:0195a05_1"
    },
    {
        "source_sentence": "觀所莊嚴同於寂滅，是名為慧。",
        "translation": "What's adorned by contemplation is the same as cessation, which is called wisdom.",
        "source": "T13n0397_028:0195a06_2"
    },
    {
        "source_sentence": "入時欲轉無上法輪，是名方便；",
        "translation": "To want to turn the wheel of the unexcelled teaching at the moment of entering is called ‘manifest effort’.",
        "source": "T13n0397_028:0195a07_3"
    },
    {
        "source_sentence": "思惟法輪無轉不轉，是名為慧。",
        "translation": "To contemplate the Dharma wheel without turning or not turning is called wisdom.",
        "source": "T13n0397_028:0195a07_4"
    },
    {
        "source_sentence": "入時一向修助覺分，是名方便；",
        "translation": "To always cultivate the factors of assisting enlightenment at the moment of entering is called ‘manifest effort’.",
        "source": "T13n0397_028:0195a08_5"
    },
    {
        "source_sentence": "為知眾生諸熱惱心，是故修集如來禪定，知一切法相應不相應有相無相一切相續，",
        "translation": "In order to know the minds of sentient beings who are tormented by feverish thoughts, they therefore cultivate and accumulate the meditation of buddhas. They know all things that are associated with each other as well as not conjoined with each other; they have characteristics and signs but no characteristics at all.",
        "source": "T13n0397_028:0195a09_6"
    },
    {
        "source_sentence": "隨順菩薩決定思惟，是名為慧。",
        "translation": "Following the bodhisattva's determined contemplation is called wisdom.",
        "source": "T13n0397_028:0195a11_7"
    },
    {
        "source_sentence": "是名菩薩入於禪定方便慧也。",
        "translation": "This is called the bodhisattva's wisdom of entering meditation with skillful means.",
        "source": "T13n0397_028:0195a12_8"
    },
    {
        "source_sentence": "如是菩薩，禪波羅蜜方便智慧，二事俱行得佛法器，一切諸魔不能破壞。」",
        "translation": "Thus, the bodhisattva's skillful means and wisdom of the perfection of meditation combine to attain the Buddha's Dharma vessel in both ways, which all Māra can't destroy.",
        "source": "T13n0397_028:0195a12_9"
    },
    {
        "source_sentence": "說是法時，三萬二千菩薩得日燈三昧。",
        "translation": "When he taught this teaching, 32,000 bodhisattvas attained the concentration of the sunlight samādhi.",
        "source": "T13n0397_028:0195a14_10"
    },
    {
        "source_sentence": "「何因緣故名日燈三昧？",
        "translation": "What is the reason it's called sunlight samādhi?",
        "source": "T13n0397_028:0195a15_11"
    },
    {
        "source_sentence": "譬如日出，燈火月光星宿諸明悉不復現。",
        "translation": "It's like when the sun rises, the light of lamps, fire, moonlight, stars, and constellations don't appear again.",
        "source": "T13n0397_028:0195a15_12"
    },
    {
        "source_sentence": "菩薩大士得是定已，先所修智一切二乘學與無學，及餘眾生所得諸智，",
        "translation": "Having attained this concentration, the bodhisattva-mahāsattva first cultivates knowledge of all the two vehicles that are learned and post learners, as well as the knowledges attained by other sentient beings.",
        "source": "T13n0397_028:0195a16_13"
    },
    {
        "source_sentence": "皆亦如是悉不復現，是名日燈三昧。",
        "translation": "They are all likewise, and they don't appear again, which is called the concentration of the sunlight samādhi.",
        "source": "T13n0397_028:0195a18_14"
    },
    {
        "source_sentence": "「菩薩住於禪波羅蜜，即於無量百千種種諸禪三昧而得自在，今於此中當說少分，",
        "translation": "The bodhisattva abides in the perfection of meditation, attains mastery over measureless hundreds of thousands of various meditations and concentrations. Here I will explain a little bit:",
        "source": "T13n0397_028:0195a19_15"
    },
    {
        "source_sentence": "其名曰：電燈三昧、淨三昧、月光三昧、淨莊嚴三昧、日光三昧、不可思議三昧、勇出三昧、照明三昧、無垢光明三昧、功德光明三昧、一切法中得自在三昧、吉道三昧、無憂三昧、堅稱三昧、勇出如須彌山等三昧、法炬三昧、法健三昧、法尊三昧、自在知一切法三昧、住法聚三昧、總持法淨三昧、隨知他心行三昧、法幢瓔珞三昧、燒一切煩惱三昧、破四魔力三昧、十力聲勇健三昧、無礙斷礙三昧、手燈三昧、施得名聞三昧、持地三昧、住無我如須彌山三昧、勝諸明智三昧、智焰三昧、生慧三昧、修禪三昧、無量自在三昧、心調伏無我無我所成就三昧、水月三昧、日聲三昧、無有高下如佛三昧、離相三昧、如善調象師子遊戲三昧、念佛三昧、念法得智自在無礙三昧、無退不退三昧、不眴三昧、勝淨光無我三昧、空三昧、無相三昧、無願三昧、住心平等三昧、金剛三昧、增上三昧、無能勝三昧、旋三昧、淨聲三昧、善分別三昧、離煩惱三昧、廣大如空三昧、入諸功德三昧、念意進覺三昧、勇慧三昧、辯無盡三昧、語無盡三昧、總持三昧、不忘三昧、善作三昧、觀一切世三昧、善知所樂三昧、生踊躍三昧、勇慈心淨三昧、大悲根本三昧、入喜三昧、捨離三纏三昧、法義三昧、法作三昧、智炬三昧、智海三昧、不波蕩三昧、一切心喜三昧、調伏三昧、解脫智三昧、已自在三昧、法場金剛幢三昧、蓮華三昧、蓮華增上三昧、離世法三昧、不動三昧、慧增上三昧、諸佛所念首楞嚴三昧、無諍三昧、火三昧、火明三昧、解脫勝智三昧、莊嚴佛身三昧、遍照三昧、入眾生心歡喜三昧、順助道三昧、莊嚴諸波羅蜜三昧、寶鬘三昧、與諸覺華三昧、與解脫果三昧、甘露三昧、速疾如風三昧、實際三昧、遮海濤三昧、山相搏三昧、廣大神足三昧、見無量諸佛三昧、聞持三昧、不亂三昧、一念智無量功德海淨三昧，",
        "translation": "Their names were Lamp of Lightning Samādhi, Pure Samādhi, Moonlight Samādhi, Pure Adornment Samādhi, Sunlight Samādhi, Inconceivable Samādhi, Courageous Emit Samādhi, Illumination Samādhi, Undefiled Light Samādhi, Luminous Light of Virtue Samādhi, Mastery of All Truths",
        "source": "T13n0397_028:0195a21_16"
    },
    {
        "source_sentence": "如是等不可計那由他諸三昧，入禪波羅蜜時悉得清淨。",
        "translation": "These incalculable millions of such samādhis are all purified when they enter the perfection of meditation.",
        "source": "T13n0397_028:0195b29_17"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0195c01_18"
    },
    {
        "source_sentence": "是名菩薩修行禪定而不可盡。」",
        "translation": "This is called a bodhisattva's cultivation of meditation that can't be exhausted.",
        "source": "T13n0397_028:0195c01_19"
    },
    {
        "source_sentence": "爾時，舍利弗語無盡意言：「善哉，善哉！",
        "translation": "At that point, Śāriputra said with inexhaustible intent, Good, good!",
        "source": "T13n0397_028:0195c03_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_028:0195c03_1"
    },
    {
        "source_sentence": "仁已快說菩薩禪波羅蜜。",
        "translation": "You've quickly explained the bodhisattva's perfection of meditation.",
        "source": "T13n0397_028:0195c04_2"
    },
    {
        "source_sentence": "唯願仁者，當說菩薩般若波羅蜜，如諸菩薩所得無盡般若波羅蜜。",
        "translation": "Please, my dear friend, you should explain the bodhisattva's perfection of prajñāpāramitā, just like the inexhaustible perfection of prajñāpāramitā attained by bodhisattvas.",
        "source": "T13n0397_028:0195c04_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_028:0195c06_4"
    },
    {
        "source_sentence": "般若波羅蜜，云何行？",
        "translation": "What's the practice of prajñā-pāramitā?",
        "source": "T13n0397_028:0195c06_5"
    },
    {
        "source_sentence": "云何入？」",
        "translation": "How do you enter?",
        "source": "T13n0397_028:0195c06_6"
    },
    {
        "source_sentence": "無盡意言：「唯，舍利弗！",
        "translation": "The inexhaustible mind said, Yes, Śāriputra!",
        "source": "T13n0397_028:0195c07_7"
    },
    {
        "source_sentence": "般若波羅蜜，如聞修行善入思惟。」",
        "translation": "The prajñāpāramitā is like hearing, cultivating, and well-entering contemplation.",
        "source": "T13n0397_028:0195c07_8"
    },
    {
        "source_sentence": "舍利弗言：「唯，善男子！",
        "translation": "Śāriputra said, Yes, good man!",
        "source": "T13n0397_028:0195c08_9"
    },
    {
        "source_sentence": "云何如聞修行？」",
        "translation": "How is it like hearing and cultivating?",
        "source": "T13n0397_028:0195c08_10"
    },
    {
        "source_sentence": "無盡意言：「聞者具八十行。",
        "translation": "The inexhaustible mind said, Those who hear it have the eighty practices.",
        "source": "T13n0397_028:0195c09_11"
    },
    {
        "source_sentence": "何等八十？",
        "translation": "What are the eighty?",
        "source": "T13n0397_028:0195c09_12"
    },
    {
        "source_sentence": "欲修行順心行、畢竟心行、常發起行、親近善友行、無憍慢行、不放逸行、恭敬行、隨順教行、從善語行、數往法師所行、至心聽法行、善思惟行、不亂心行、勤進心行、生寶想行、起藥想行、除諸病行、念器行、進覺行、意喜行、入覺行、聞無厭行、增長捨行、調智行、親近多聞行、發歡喜行、身輕悅行、心柔和行、聞無疲倦行、聞義行、聞法行、聞威儀行、聞他說行、聞所未聞行、聞諸通行、不求餘乘行、聞諸波羅蜜行、聞菩薩藏行、聞諸攝法行、聞方便行、聞四梵行、聞念正智行、聞生方便行、聞無生方便行、觀不淨行、思惟慈行、觀因緣行、觀無常行、觀苦行、觀無我行、觀寂滅行、觀空行、觀無相行、觀無願行、觀無作行、作善行、持真實行、不失行、好惡住處防護心行、勤進無懈行、善分別諸法行、知諸煩惱非伴侶行、護諸善法自伴侶行、降伏煩惱非伴侶行、親近正法財行、斷諸貧窮行、智者所讚行、欣樂利根行、眾聖所勸行、令非聖者生歡喜行、觀諸諦行、觀陰過患行、思量有為多過患行、思義行、不作一切惡行、自利利他行、隨順增進諸善業行、進增上行、得一切佛法行。",
        "translation": "They want to cultivate practices that are compliant with the mind, ultimately compliant, always arousing practices, associating with good friends, not conceited, not lax, respectful practices, following the teachings, speaking well, frequently going to Dharma masters, wholeheartedly listening to the Dharma, well-considered practices, unconfused practices, diligent",
        "source": "T13n0397_028:0195c10_13"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0196a04_0"
    },
    {
        "source_sentence": "是名菩薩如其所聞具八十行。",
        "translation": "This is called a bodhisattva who possesses the eighty practices as he hears them.",
        "source": "T13n0397_028:0196a04_1"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T13n0397_028:0196a05_0"
    },
    {
        "source_sentence": "菩薩摩訶薩，行般若波羅蜜，具三十二事善入思惟。",
        "translation": "The bodhisattva Mahāsattva practices the perfection of prajñā, which contains thirty-two things that are well entered into and contemplated.",
        "source": "T13n0397_028:0196a05_1"
    },
    {
        "source_sentence": "何等三十二？",
        "translation": "What are the thirty-two?",
        "source": "T13n0397_028:0196a06_2"
    },
    {
        "source_sentence": "善入受持定、善入分別慧、善入心柔和、善入身獨行、善入十二緣、善入不斷、善入不常、善入因緣生法、善入無眾生無命無人、善入無來去住處、善入無進不斷因果、善入空不懈、善入無相不廢、善入無願不捨、善入不證空無相無願、善入生諸禪三昧、善入不隨禪定生、善入生諸通智、善入不證無漏法、善入內觀法、善入不證決定、善入思量有為法過患、善入不著有為法、善入觀一切眾生無我而不捨大悲、善入一切趣諸怖畏處、善入雖生諸趣非業故生、善入離欲、善入不證離欲法、善入捨所樂欲、善入不捨法樂、善入捨一切戲論諸覺、善入不捨方便諸觀。",
        "translation": "善入受持定、善入分別慧、善入心柔和、善入身獨行、善入十二緣、善入不斷、善入不常、善入因緣生法、善入無眾生無命無人、善入無來去住處、善入無進不斷因果、善入空不懈、善入無相不廢、善入無願不",
        "source": "T13n0397_028:0196a06_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0196a19_4"
    },
    {
        "source_sentence": "是名菩薩行般若波羅蜜三十二事善入思惟。",
        "translation": "This is called a bodhisattva who practices the thirty-two things of prajñāpāramitā and well enters into contemplation.",
        "source": "T13n0397_028:0196a19_5"
    },
    {
        "source_sentence": "「又復，善思惟者，所謂善順句。",
        "translation": "“Furthermore, good reflection is what’s called a well-contemplated phrase.",
        "source": "T13n0397_028:0196a21_0"
    },
    {
        "source_sentence": "善順句者，是不始句，是不終句，是不住句，是無依句，是不動句，是不猗句，",
        "translation": "Good and agreeable phrases are phrases that don’t start, phrases that don’t end, phrases that don’t abide, phrases that have no basis, phrases that don’t move, and phrases that don’t rest.",
        "source": "T13n0397_028:0196a21_1"
    },
    {
        "source_sentence": "是平等句，是非等句，是真實句，是正真句，是不變句，是清淨句，是永寂句，",
        "translation": "This is the phrase of equality, this is the phrase of righteousness, this is the phrase of reality, this is the phrase of truth, this is the phrase of correctness, this is the phrase of unchangingness, this is the phrase of purity, this is the phrase of eternalism.",
        "source": "T13n0397_028:0196a23_2"
    },
    {
        "source_sentence": "是不然句，是不舉句，是不下句，是不滅句，是不增句，是不共句，是不戲論句，",
        "translation": "What’s not a non-word, what’s not raised, what’s not falling down, what’s not extinguished, what’s not increased, what’s not shared, and what’s not discussed.",
        "source": "T13n0397_028:0196a25_3"
    },
    {
        "source_sentence": "是如句，是不如句，是如非如句，是非如非不如句，是如實句，是三世平等句，",
        "translation": "The phrase “as it is,” the phrase “not as it is,” the phrase “as it is and not as it is,” the phrase “as it is and not not not as it is,” the phrase “as it really is,” the phrase “equality of all times.”",
        "source": "T13n0397_028:0196a27_0"
    },
    {
        "source_sentence": "是三際句，是不住色句，是不住受想行識句，是不住地大句，是不住水火風句，",
        "translation": "These are the phrases of the three realms that don’t abide in form. These are the phrases that don’t abide in feeling, perception, volition, and consciousness. These are the large phrases that don’t abide in earth. These are the phrases that don’t abide in water, fire, wind, or wind.",
        "source": "T13n0397_028:0196a28_1"
    },
    {
        "source_sentence": "是不住眼界色界眼識界句，是不住耳界聲界耳識界句，是不住鼻界香界鼻識界句，",
        "translation": "This is the phrase that doesn't abide in the eye realm, form realm, eye consciousness realm, and eye consciousness realm in the eye realm. This is the phrase that doesn't abide in the ear realm, sound realm, or ear consciousness realm in the ear realm.",
        "source": "T13n0397_028:0196b01_2"
    },
    {
        "source_sentence": "是不住舌界味界舌識界句，是不住身界觸界身識界句，是不住意界法界意識界句，",
        "translation": "These are the phrases that don’t abide in the element of tongue, in the element of taste, in the element of tongue, and in the element of consciousness. These are the phrases that don’t abide in the element body realm, the element of touch, the element of body, and the element of consciousness. These are the phrases that don’t abide",
        "source": "T13n0397_028:0196b03_3"
    },
    {
        "source_sentence": "是念義句，是念智句，是了義經句，是念法句，是名菩薩善入思惟。",
        "translation": "This is the sentence of mindfulness of meaning, this is the sentence of mindfulness of wisdom, this is the sentence of comprehending the meaning of the sūtras, and this is the sentence of mindfulness of the Dharma, which is called a bodhisattva who well enters into contemplation.",
        "source": "T13n0397_028:0196b05_4"
    },
    {
        "source_sentence": "「又復，善思惟者，所謂一切諸法若我、無我，如是諸法隨順觀察。",
        "translation": "“Furthermore, a good contemplation is that all things are observed in accordance with such things if they are self or selfless.",
        "source": "T13n0397_028:0196b08_0"
    },
    {
        "source_sentence": "若知眾生無有我者，即是隨順觀察諸法。",
        "translation": "If someone knows that sentient beings lack self, they're observing the dharmas accordingly.",
        "source": "T13n0397_028:0196b09_1"
    },
    {
        "source_sentence": "如是觀察即是善入思惟。",
        "translation": "Observing it this way is well-entered contemplation.",
        "source": "T13n0397_028:0196b10_2"
    },
    {
        "source_sentence": "如善思惟，即是思惟生死涅槃同一法界，觀是二句無有差別，如是見者是名勤進善入思惟。",
        "translation": "To contemplate that birth-and-death and nirvāṇa are the same realm of reality, observe these two phrases without distinction, and thus see them as such is called diligently and well-adjusted contemplation.",
        "source": "T13n0397_028:0196b10_3"
    },
    {
        "source_sentence": "若觀黑法及以白法二性平等無有差別，是名勤進善入思惟。",
        "translation": "If someone observes the equality of the two natures of black dharmas and white dharmas without distinctions, this is called diligently and well-entered contemplation.",
        "source": "T13n0397_028:0196b13_4"
    },
    {
        "source_sentence": "若觀諸枙及以無枙不動不恃，是名勤進善入思惟。",
        "translation": "If he observes anger and the absence of anger, doesn't move or rely on it, this is called diligently and well-entered contemplation.",
        "source": "T13n0397_028:0196b14_5"
    },
    {
        "source_sentence": "若菩薩起善思惟，為諸眾生而不捨離，於諸法相亦不分別，是名菩薩發善思惟。",
        "translation": "If a bodhisattva gives rise to good thoughts that are not abandoned for the sake of sentient beings and doesn't discriminate among the characteristics of things, this is called a bodhisattva who gives rise to good thoughts.",
        "source": "T13n0397_028:0196b15_6"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0196b17_7"
    },
    {
        "source_sentence": "如聞行者，如是得入報善思惟，是名為慧。",
        "translation": "As someone who practices based on hearing and thus attains the reward of good contemplation, this is called wisdom.",
        "source": "T13n0397_028:0196b17_8"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T13n0397_028:0196b19_0"
    },
    {
        "source_sentence": "菩薩慧者，有十六法不於中住。",
        "translation": "A bodhisattva's wisdom is that there are 16 things that don't abide in it.",
        "source": "T13n0397_028:0196b19_1"
    },
    {
        "source_sentence": "云何十六？",
        "translation": "What are the sixteen?",
        "source": "T13n0397_028:0196b19_2"
    },
    {
        "source_sentence": "不住無明、行、識、名色、六入、觸、受、愛、取、有、生、老死，乃至不住無明滅至生死滅；",
        "translation": "They do not abide in nescience, in volition, in consciousness, in name-and-form, in the six sense-fields, in contact, sensation, craving, clinging, existence, birth, old age and death. They do not abide from the cessation of nescience up to the cessation of birth and death.",
        "source": "T13n0397_028:0196b20_3"
    },
    {
        "source_sentence": "不住根本身見，乃至不住六十二見；",
        "translation": "They do not abide in the view of fundamental body, up to they do not abide in the sixtytwo views.",
        "source": "T13n0397_028:0196b21_4"
    },
    {
        "source_sentence": "不住高下，乃至不住世法、利衰、毀譽、稱譏、苦樂；",
        "translation": "They do not abide in high or low, up to they do not abide in worldly dharmas, profit or loss, praise or blame, fame or blameworthiness or suffering or happiness.",
        "source": "T13n0397_028:0196b22_5"
    },
    {
        "source_sentence": "不住慢慢、增上慢、勝慢、我慢、下慢、憍慢、邪慢，乃至不住二十煩惱；",
        "translation": "“Great enlightening beings do not abide in self-conceit, conceit of superiority, conceit of excellence, conceit of self, conceit of inferiority, conceit of arrogance, conceit of hypocrisy, or conceit of evil.",
        "source": "T13n0397_028:0196b23_6"
    },
    {
        "source_sentence": "不住因貪所起諸結，若麁、若細、若上中下，乃至不住貪欲所起一切諸結；",
        "translation": "They do not abide in fetters generated by craving as the cause for all fetters, whether coarse, fine, excessive, middling, or inferior; they do not abide in all fetters generated by desire as the cause for all fetters.",
        "source": "T13n0397_028:0196b25_7"
    },
    {
        "source_sentence": "不住癡闇、覆蓋諸礙，乃至不住因癡所起一切諸結；",
        "translation": "They do not abide in the darkness of delusion, obscuring all obstructions, and they do not abide in all the fetters created by delusion as their cause.",
        "source": "T13n0397_028:0196b26_8"
    },
    {
        "source_sentence": "不住婬欲、愛濁，不住陰死、煩惱、天魔，乃至不住因魔所起諸魔事等；",
        "translation": "“Great enlightening beings do not abide in the defilement of sexual desire or craving; they do not abide in the demons of the aggregates, death, afflictions, and heavenly demons. They do not abide in the works of demons that are caused by those demons.",
        "source": "T13n0397_028:0196b28_0"
    },
    {
        "source_sentence": "不住我人、眾生、壽命、養育、士夫，乃至不住取眾生相；",
        "translation": "They do not dwell on self, people, sentient beings, life spans, nurturing, or personalities. They do not dwell on grasping the characteristics of sentient beings.",
        "source": "T13n0397_028:0196b29_1"
    },
    {
        "source_sentence": "不住業障、報障、法障、煩惱障、諸見障，乃至不住一切習氣；",
        "translation": "They do not abide in the obstacle of action, the obstacle of retribution, the obstacle of doctrine, the obstacle of defilement, or the obstacle of views, up to the obstacle of all habit energy.",
        "source": "T13n0397_028:0196c01_2"
    },
    {
        "source_sentence": "不住思想、憶想、分別想、緣相想境界見聞覺知，乃至不住一切諸結；",
        "translation": "They do not abide in thoughts, recollections, conceptualizations, discriminations, perceptions of characteristics, or perceptions of objects; they see, hear, perceive, and know. They do not abide in all fetters.",
        "source": "T13n0397_028:0196c03_0"
    },
    {
        "source_sentence": "不住隨眾生心行智，乃至不住八萬四千法聚；",
        "translation": "They do not abide in knowledge of the mental patterns of sentient beings according to their mentalities, up to as many as eighty-four thousand dharmas.",
        "source": "T13n0397_028:0196c04_1"
    },
    {
        "source_sentence": "不住慳貪、布施、破戒、持戒、瞋恚、忍辱、懈怠、精進、亂意、禪定、愚癡、智慧，",
        "translation": "They don’t abide in stinginess, greed, generosity, breaking precepts, observance of precepts, anger, forbearance, laziness, diligence, distraction, meditation, folly, and wisdom.",
        "source": "T13n0397_028:0196c05_2"
    },
    {
        "source_sentence": "乃至不住諸波羅蜜伴非伴等；",
        "translation": "They do not abide in the companions of the transcendent ways, etc.",
        "source": "T13n0397_028:0196c07_3"
    },
    {
        "source_sentence": "不住定亂、邪正、善不善、世間、出世間、可作、不可作、有漏、無漏、有為、無為、黑法、白法、生死涅槃，",
        "translation": "They do not abide in the states of absorption, error, right and wrong, good or bad, mundane or transmundane, worldly or non-worldly, to be done or not done, impure or pure, conditioned or unconditioned, black or white, birth-and-death or nirvana.",
        "source": "T13n0397_028:0196c07_4"
    },
    {
        "source_sentence": "乃至不住一切諸法伴非伴等；",
        "translation": "They do not abide in all things as companions, or non-companions.",
        "source": "T13n0397_028:0196c09_5"
    },
    {
        "source_sentence": "不住眾生異相、諸乘異相、佛界異相、諸佛異相、諸法異相、聖眾異相，",
        "translation": "They don’t abide in the different characteristics of sentient beings, the different characteristics of vehicles, the different characteristics of buddha-realms, the different characteristics of buddhas, the different characteristics of Buddhas, the different characteristics of dharmas, or the different characteristics of noble beings.",
        "source": "T13n0397_028:0196c10_6"
    },
    {
        "source_sentence": "乃至不住一切異相；",
        "translation": "They do not abide in all dissimilarities.",
        "source": "T13n0397_028:0196c11_7"
    },
    {
        "source_sentence": "不住知不知、識不識、世諦真諦，乃至不住一切諸相。",
        "translation": "They don't abide in knowing and not knowing, consciousness and not consciousness, the true truth of the conventional truth, or even all characteristics.",
        "source": "T13n0397_028:0196c12_8"
    },
    {
        "source_sentence": "「所謂菩薩思惟慧者，無聞、無行、無身、無相、無形、無為，如是真慧，",
        "translation": "“The so-called bodhisattva’s wisdom of reflection is without hearing, without action, without body, without marks, without form, and without conditioning.",
        "source": "T13n0397_028:0196c13_9"
    },
    {
        "source_sentence": "不住一切憶想、思惟、心作、止住、名字異相。",
        "translation": "They don't abide in all thoughts, contemplations, mental actions, stopping and abiding, names, or different characteristics.",
        "source": "T13n0397_028:0196c14_10"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0196c15_11"
    },
    {
        "source_sentence": "是名菩薩真智慧者不住如是十六法中。",
        "translation": "This is called a bodhisattva's true wisdom that doesn't abide in these 16 dharmas.",
        "source": "T13n0397_028:0196c16_12"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T13n0397_028:0196c17_0"
    },
    {
        "source_sentence": "云何菩薩慧者，處所具八方便？",
        "translation": "What are the eight kinds of skillful means that are possessed by a bodhisattva who is endowed with wisdom?",
        "source": "T13n0397_028:0196c17_1"
    },
    {
        "source_sentence": "何等八？",
        "translation": "What are the eight?",
        "source": "T13n0397_028:0196c17_2"
    },
    {
        "source_sentence": "諸陰方便、諸界方便、諸入方便、諸諦方便、諸緣方便、三世方便、諸乘方便、諸法方便。",
        "translation": "The skillful means of the aggregates, the skillful means of the elements, the skillful means of the senses, the skillful means of the truths, the skillful means of the conditions, the skillful means of the three times, the skillful means of the vehicles, and the skillful means of the teachings.",
        "source": "T13n0397_028:0196c18_3"
    },
    {
        "source_sentence": "「云何諸陰方便？",
        "translation": "What are the aggregates of skillful means?",
        "source": "T13n0397_028:0196c20_4"
    },
    {
        "source_sentence": "若說諸陰如沫如泡，如熱時焰，如芭蕉樹，如幻如夢，如呼聲響，如鏡中像，",
        "translation": "If we say that the aggregates are like foam, like bubbles, like flames when it’s hot, like plantain trees, like illusions, like dreams, like screaming and wailing sounds, like images in a mirror.",
        "source": "T13n0397_028:0196c20_5"
    },
    {
        "source_sentence": "如影如化色，如水沫如水沫性，非我非眾生，非命非人，色亦如是，能如是知，",
        "translation": "Just as the reflection is like magical form, just as the foam of water is like the nature of the foam of water. It is neither self nor beings, neither life nor person. The same applies to matter. They can know in this way:",
        "source": "T13n0397_028:0196c22_6"
    },
    {
        "source_sentence": "是名菩薩觀色方便。",
        "translation": "This is called the bodhisattva's method of observing form.",
        "source": "T13n0397_028:0196c24_7"
    },
    {
        "source_sentence": "「受喻如泡，想喻如焰，行如芭蕉，識喻如幻，如泡如焰如芭蕉幻性，",
        "translation": "“The metaphor of sensation is like a bubble, the metaphor of perception is like a flame, the metaphor of volition is like a plantain, the metaphor of consciousness is like an illusion, and the metaphor of bubble is like a flame, which is like the illusory nature of a plantain.",
        "source": "T13n0397_028:0196c24_8"
    },
    {
        "source_sentence": "無我無眾生，無命無人，受想行識亦復如是，能如是知，是名菩薩觀受想行識方便。",
        "translation": "The absence of self and sentient beings, the absence of life and no person, sensation, perception, volition, and consciousness are likewise, and they can thus know them, which is called the bodhisattva's method of observing feeling, perception, volition, and consciousness.",
        "source": "T13n0397_028:0196c26_9"
    },
    {
        "source_sentence": "「諸陰如夢如響，如像如影，如化如化等性，無我無眾生無命無人，是諸陰等亦復如是，",
        "translation": "“The aggregates are like dreams, echoes, images, reflections, magic tricks, emanations, and so forth. They lack self, sentient beings, life, and people. The same applies to the aggregates, etc.",
        "source": "T13n0397_028:0196c28_10"
    },
    {
        "source_sentence": "能如是知，是名菩薩觀陰方便。",
        "translation": "Being able to know it this way is called the bodhisattva's method of observing the aggregates.",
        "source": "T13n0397_028:0197a01_11"
    },
    {
        "source_sentence": "「所謂陰者即世間相，世間相者是可壞相。",
        "translation": "“The so-called aggregates are worldly marks, and worldly marks are destructible marks.",
        "source": "T13n0397_028:0197a01_12"
    },
    {
        "source_sentence": "如可壞相即無常性、苦性、無我性、寂滅性。",
        "translation": "The characteristic that can be destroyed is the nature of impermanence, the nature of suffering, the nature of selflessness, and the nature of cessation.",
        "source": "T13n0397_028:0197a02_13"
    },
    {
        "source_sentence": "能如是知，是名菩薩觀陰方便。",
        "translation": "Being able to know it this way is called the bodhisattva's method of observing the aggregates.",
        "source": "T13n0397_028:0197a03_14"
    },
    {
        "source_sentence": "「云何菩薩知界方便？",
        "translation": "What is a bodhisattva’s method of knowing the elements?",
        "source": "T13n0397_028:0197a04_15"
    },
    {
        "source_sentence": "法界、地界、水火風界，是法界中無有堅相濕相熱相動相，法界眼界耳界鼻舌身意界，",
        "translation": "The element of factors arising with every awareness has no solid characteristic marks, no humid characteristic marks, no heat characteristic marks and no moving characteristic marks.",
        "source": "T13n0397_028:0197a04_16"
    },
    {
        "source_sentence": "是法界中無有見相聞相嗅相別相覺相知相。",
        "translation": "In the Dharma realm, there's no seeing characteristic, hearing characteristic, smelling characteristic, distinct characteristic, feeling characteristic, or knowing characteristic.",
        "source": "T13n0397_028:0197a06_17"
    },
    {
        "source_sentence": "法界色界聲香味觸法，是法界中，無眼可見相、耳可聞相、鼻可嗅相、舌可別相、身可覺相、意可知相。",
        "translation": "In the Dharma realm and form realm, sounds, smells, tastes, and tactile dharmas are in the Dharma realm, which lack the characteristics that can be seen by the eye, heard by the ear, smelled by the nose, distinguished by the tongue, perceived by the body, and known by the mind.",
        "source": "T13n0397_028:0197a07_18"
    },
    {
        "source_sentence": "法界眼識界耳鼻舌身意識界，是法界中，無眼識知色，乃至無意識知法。",
        "translation": "In the Dharma realm, the eye consciousness realm, ear, nose, tongue, body, and consciousness realm are in the Dharma realm, but there's no eye consciousness that knows form or even no consciousness that knows things.",
        "source": "T13n0397_028:0197a10_19"
    },
    {
        "source_sentence": "法界色界法界非色作相，乃至法界亦復如是。",
        "translation": "The Dharma realm, form realm, and Dharma realm that aren't form-forming characteristics of the Dharma realm and even the Dharma realm are likewise.",
        "source": "T13n0397_028:0197a12_0"
    },
    {
        "source_sentence": "法界我界無二無別。",
        "translation": "The self realm of the Dharma realm is neither two nor distinct.",
        "source": "T13n0397_028:0197a13_1"
    },
    {
        "source_sentence": "法界欲界色界無色界我界生死界涅槃界無二無別，法界虛空界，一切法界我界空界，",
        "translation": "The Dharma realm, the desire realm, form realm, form realm, form realm, formless realm, self realm, birth-and-death realm, and nirvāṇa realms are not two and don’t have distinctions, the space realm of the Dharma realm, the self realm of all dharmas, the self realm of all dharmas",
        "source": "T13n0397_028:0197a13_2"
    },
    {
        "source_sentence": "無相無願無作不出不生無所有等如涅槃。",
        "translation": "The absence of marks, the absence of wishes, the absence of what's done, non-arising, nothingness, and so forth are like nirvāṇa.",
        "source": "T13n0397_028:0197a15_3"
    },
    {
        "source_sentence": "虛空涅槃及一切法，等無有二。",
        "translation": "Space, nirvāṇa, and all dharmas are not two.",
        "source": "T13n0397_028:0197a16_4"
    },
    {
        "source_sentence": "如是無量有為法界入無為界，能如是知如是說者，是名菩薩知界方便。",
        "translation": "Such an immeasurable, conditioned realm of dharmas that enters the unconditioned realm and can thus know and thus explain it is called a bodhisattva's method of knowing the realm.",
        "source": "T13n0397_028:0197a17_5"
    },
    {
        "source_sentence": "「云何菩薩觀入方便？",
        "translation": "How does a bodhisattva contemplate the method of entering?",
        "source": "T13n0397_028:0197a19_0"
    },
    {
        "source_sentence": "如佛所說，眼空、我空、我所空。",
        "translation": "As the Buddha explains, the eye is empty, self is empty, and what belongs to self is empty.",
        "source": "T13n0397_028:0197a19_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_028:0197a20_2"
    },
    {
        "source_sentence": "是眼性中無我無我所，耳鼻舌身意空亦復如是。",
        "translation": "In the eye-nature, there's no self and nothing that belongs to self, and so is the emptiness of ear, nose, tongue, body, and mind.",
        "source": "T13n0397_028:0197a20_3"
    },
    {
        "source_sentence": "觀是入者見一切法，若善不善，無有二相，是名菩薩觀入方便。",
        "translation": "Observing that this entry is seeing all dharmas, whether good or bad, without two characteristics, is called the bodhisattva's method of observing entry.",
        "source": "T13n0397_028:0197a21_4"
    },
    {
        "source_sentence": "若眼入色入，若見眼色離欲，不證離欲法，是名菩薩觀入方便。",
        "translation": "If the eye enters form, and if he sees form of the eye that's free of desire and doesn't realize the principle of freedom from desire, this is called the bodhisattva's method of observing entry.",
        "source": "T13n0397_028:0197a22_5"
    },
    {
        "source_sentence": "耳入聲入鼻入香入舌入味入身入觸入意入法入，若見離欲，不證離欲法，",
        "translation": "If someone’s ear enters sound, nose enters odor, tongue enters taste, body enters touch, mind enters thought, and dharmas enter. If they see nonattachment but don’t realize nonattachment,",
        "source": "T13n0397_028:0197a24_6"
    },
    {
        "source_sentence": "是名菩薩觀入方便。",
        "translation": "This is called the bodhisattva's method of observing and entering.",
        "source": "T13n0397_028:0197a26_7"
    },
    {
        "source_sentence": "「所謂入者，若聖入非聖入。",
        "translation": "“The so-called entry refers to what’s entered by the noble and what’s not entered by the noble.",
        "source": "T13n0397_028:0197a26_8"
    },
    {
        "source_sentence": "云何聖入？",
        "translation": "What's the noble entry?",
        "source": "T13n0397_028:0197a27_9"
    },
    {
        "source_sentence": "若修集道。",
        "translation": "Suppose someone cultivates the path of accumulation.",
        "source": "T13n0397_028:0197a27_10"
    },
    {
        "source_sentence": "云何非聖入，不修集道？",
        "translation": "What's not the noble entry that doesn't cultivate the path of accumulation?",
        "source": "T13n0397_028:0197a27_11"
    },
    {
        "source_sentence": "若菩薩住道，於不修道者生大悲心不捨入道，是名菩薩觀入方便。",
        "translation": "If a bodhisattva abides in the path and gives rise to great compassion for those who don't cultivate it and doesn't abandon entry into the path, this is called a bodhisattva's method of observing entry.",
        "source": "T13n0397_028:0197a28_12"
    },
    {
        "source_sentence": "「云何菩薩觀諦方便？",
        "translation": "What's a bodhisattva's method of observing the truths?",
        "source": "T13n0397_028:0197b01_0"
    },
    {
        "source_sentence": "所謂甚深難入。",
        "translation": "It's called profound and difficult to enter.",
        "source": "T13n0397_028:0197b01_1"
    },
    {
        "source_sentence": "云何難入？",
        "translation": "How is it difficult to enter?",
        "source": "T13n0397_028:0197b01_2"
    },
    {
        "source_sentence": "若苦智、集智、滅智、道智。",
        "translation": "Suppose there's knowledge of suffering, knowledge of accumulation, knowledge of cessation, and knowledge of the path.",
        "source": "T13n0397_028:0197b02_3"
    },
    {
        "source_sentence": "苦智者觀陰無生，集智者觀斷愛因，滅智者觀無明等諸煩惱無有和合，",
        "translation": "The knowledge of suffering observes the aggregates as non-origination. The knowledge of the origin observes the cause of abandoning thirst. The knowledge of cessation observes that such defilements as ignorance have no conjunction with one another.",
        "source": "T13n0397_028:0197b02_4"
    },
    {
        "source_sentence": "道智者得平等觀，於一切法無所倚著。",
        "translation": "A person of knowledge of the path attains equanimous contemplation and has no attachment to all dharmas.",
        "source": "T13n0397_028:0197b04_5"
    },
    {
        "source_sentence": "菩薩若於四聖諦中作如是觀，而不取證，為化眾生，是名菩薩觀諦方便。",
        "translation": "If a bodhisattva thus observes the four noble truths but doesn't grasp their realization and transform sentient beings, this is called the bodhisattva's method of observing the truths.",
        "source": "T13n0397_028:0197b05_6"
    },
    {
        "source_sentence": "「復有三諦。",
        "translation": "Again, there are three noble truths.",
        "source": "T13n0397_028:0197b06_7"
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are these three?",
        "source": "T13n0397_028:0197b07_8"
    },
    {
        "source_sentence": "俗諦、第一義諦、相諦。",
        "translation": "They are the conventional truth, the ultimate truth, and the mark truth.",
        "source": "T13n0397_028:0197b07_9"
    },
    {
        "source_sentence": "云何俗諦？",
        "translation": "What is the conventional truth?",
        "source": "T13n0397_028:0197b07_10"
    },
    {
        "source_sentence": "若世間所用語言、文字、假名法等。",
        "translation": "Suppose the world uses words, words, names, dharmas, and so forth that are nominal.",
        "source": "T13n0397_028:0197b08_11"
    },
    {
        "source_sentence": "云何第一義諦？",
        "translation": "What is the ultimate truth?",
        "source": "T13n0397_028:0197b08_12"
    },
    {
        "source_sentence": "乃至無有心行，何況當有言語文字。",
        "translation": "Even if there's no mental action, how could there be words or words?",
        "source": "T13n0397_028:0197b09_13"
    },
    {
        "source_sentence": "云何相諦？",
        "translation": "What is the truth of characteristics?",
        "source": "T13n0397_028:0197b10_14"
    },
    {
        "source_sentence": "觀一切相同於一相，一相者即是無相。",
        "translation": "He observes that all are the same as one characteristic, and that one characteristic is signless.",
        "source": "T13n0397_028:0197b10_15"
    },
    {
        "source_sentence": "菩薩隨順俗諦而不厭倦，觀第一義諦而不取證，觀諸相諦一相無相，是名菩薩觀諦方便。",
        "translation": "A bodhisattva who follows the conventional truth but doesn't tire of it, observes the ultimate truth but doesn't grasp its realization, and observes the single-form and marklessness of the truth of characteristics is called the bodhisattva's method of observing the truths.",
        "source": "T13n0397_028:0197b11_16"
    },
    {
        "source_sentence": "「復有二諦。",
        "translation": "Again, there are two truths.",
        "source": "T13n0397_028:0197b13_17"
    },
    {
        "source_sentence": "何等二？",
        "translation": "What are these two?",
        "source": "T13n0397_028:0197b13_18"
    },
    {
        "source_sentence": "俗諦、第一義諦。",
        "translation": "The conventional truth and the ultimate truth.",
        "source": "T13n0397_028:0197b13_19"
    },
    {
        "source_sentence": "何等俗諦？",
        "translation": "What are the conventional truths?",
        "source": "T13n0397_028:0197b14_20"
    },
    {
        "source_sentence": "若說苦集道諦。",
        "translation": "If he teaches the truth of suffering, accumulation, and the path, then...",
        "source": "T13n0397_028:0197b14_21"
    },
    {
        "source_sentence": "若世間語言、文字、假名法等。",
        "translation": "Suppose worldly language, words, words, nominal dharmas, and so forth.",
        "source": "T13n0397_028:0197b14_22"
    },
    {
        "source_sentence": "云何第一義諦？",
        "translation": "What is the ultimate truth?",
        "source": "T13n0397_028:0197b15_23"
    },
    {
        "source_sentence": "若於涅槃法終不忘失。",
        "translation": "If he doesn't forget the teaching of nirvāṇa, then he won't forget it.",
        "source": "T13n0397_028:0197b15_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_028:0197b16_25"
    },
    {
        "source_sentence": "如與法界其性常故，菩薩隨俗不生厭倦，觀第一義而不取證。",
        "translation": "Because the nature of thusness and the Dharma realm are constant, the bodhisattva follows the conventional without becoming disillusioned, observing the ultimate truth but not grasping its realization.",
        "source": "T13n0397_028:0197b16_26"
    },
    {
        "source_sentence": "「復有一諦。",
        "translation": "“There’s another truth.",
        "source": "T13n0397_028:0197b18_27"
    },
    {
        "source_sentence": "何等為一？",
        "translation": "What's one?",
        "source": "T13n0397_028:0197b18_28"
    },
    {
        "source_sentence": "於一切法無所倚著，為化眾生現有所著，是名菩薩觀諦方便。",
        "translation": "Being unattached to all dharmas and maintaining an attachment in order to transform sentient beings is called the bodhisattva's method of observing the truths.",
        "source": "T13n0397_028:0197b18_29"
    },
    {
        "source_sentence": "「復次，五陰苦。",
        "translation": "“Furthermore, the five aggregates are painful.",
        "source": "T13n0397_028:0197b20_30"
    },
    {
        "source_sentence": "若見五陰苦相，是名為苦觀。",
        "translation": "If he sees the characteristics of the five aggregates as suffering, this is called observing suffering.",
        "source": "T13n0397_028:0197b20_31"
    },
    {
        "source_sentence": "苦即空，是名苦智觀苦聖諦。",
        "translation": "Suffering is emptiness, which is called the noble truth of observing suffering with knowledge of suffering.",
        "source": "T13n0397_028:0197b21_32"
    },
    {
        "source_sentence": "若觀五陰諸煩惱愛因見因，是名為集。",
        "translation": "If someone observes the causes of desire for the afflictive causes of the five aggregates and the causes of views, this is called accumulation.",
        "source": "T13n0397_028:0197b21_33"
    },
    {
        "source_sentence": "若觀愛因見因，不取不著不希不求，是名集智觀集聖諦。",
        "translation": "If he observes the cause of craving and the cause of seeing, doesn't grasp or cling to it, doesn't desire or seek it, this is called the noble truth of accumulating wisdom that observes accumulation.",
        "source": "T13n0397_028:0197b22_34"
    },
    {
        "source_sentence": "若五陰畢竟盡相，過去已滅，未來未生，現在不住，是名為滅，能如是知，",
        "translation": "If the characteristics of the five aggregates are ultimately extinguished, if they were already extinguished in the past, will not arise in the future, and do not abide in the present, this is called cessation.",
        "source": "T13n0397_028:0197b23_35"
    },
    {
        "source_sentence": "是名滅智觀滅聖諦。",
        "translation": "This is called the wisdom of cessation that observes the noble truth of cessation.",
        "source": "T13n0397_028:0197b25_36"
    },
    {
        "source_sentence": "若得道者證集滅智比智知已，是名為道。",
        "translation": "If someone who has attained the path realizes the knowledge of accumulation and cessation and knows it with subsequent knowledge, this is called the path.",
        "source": "T13n0397_028:0197b26_37"
    },
    {
        "source_sentence": "若於是中悉見空性，是名道智觀道聖諦。",
        "translation": "If someone fully sees emptiness in this, this is called the noble truth of the path's wisdom and contemplation of the path.",
        "source": "T13n0397_028:0197b27_38"
    },
    {
        "source_sentence": "若能如是觀四聖諦，是名菩薩觀諦方便。",
        "translation": "If someone can thus contemplate the four noble truths, this is called a bodhisattva's method of contemplating the truths.",
        "source": "T13n0397_028:0197b28_0"
    },
    {
        "source_sentence": "「若一切受，是名為苦。",
        "translation": "“Suppose all sensations are called painful.",
        "source": "T13n0397_028:0197b28_1"
    },
    {
        "source_sentence": "若於諸受思惟分別，是名苦智觀苦聖諦，受因和合是名為集。",
        "translation": "If they contemplate and discern sensations, this is called the noble truth of observing suffering with knowledge of suffering, and the conjunction of sensation as cause is called accumulation.",
        "source": "T13n0397_028:0197b29_2"
    },
    {
        "source_sentence": "若於受因知如真實，是名集智觀集聖諦。",
        "translation": "If he knows the causes of sensation as they really are, this is called the noble truth of accumulating wisdom and observing accumulation.",
        "source": "T13n0397_028:0197c01_3"
    },
    {
        "source_sentence": "若除諸受無受者受，觀受滅盡不證於滅，為化眾生，是名滅智觀滅聖諦。",
        "translation": "If someone excepts sensation and non-sensation, observes the cessation of sensation and doesn't realize cessation, and in order to transform sentient beings, this is called the noble truth of observing cessation with knowledge of cessation.",
        "source": "T13n0397_028:0197c02_4"
    },
    {
        "source_sentence": "若有所受，是名為道。",
        "translation": "If there's something to receive, this is called the path.",
        "source": "T13n0397_028:0197c04_5"
    },
    {
        "source_sentence": "雖有和合猶如筏喻，不為所受不求於道，是名道智觀道聖諦。",
        "translation": "Although there's a combination, it's like the metaphor of a raft, which doesn't receive or seek the path, and this is called the noble truth of observing the path with knowledge of the path.",
        "source": "T13n0397_028:0197c04_6"
    },
    {
        "source_sentence": "作如是知，見四聖諦清淨平等，是名菩薩觀諦方便。",
        "translation": "To know in this way and see the pure equality of the four noble truths is called the bodhisattva's method of observing the truths.",
        "source": "T13n0397_028:0197c06_7"
    },
    {
        "source_sentence": "「復次，略說生苦是名為苦。",
        "translation": "“Furthermore, it's briefly explained that the suffering of arising is called suffering.",
        "source": "T13n0397_028:0197c07_8"
    },
    {
        "source_sentence": "若觀於生，是名苦智觀苦聖諦。",
        "translation": "If someone observes birth, this is called observing the noble truth of suffering with knowledge of suffering.",
        "source": "T13n0397_028:0197c08_9"
    },
    {
        "source_sentence": "生從因緣，是名為集。",
        "translation": "Arising from causes and conditions, this is called accumulation.",
        "source": "T13n0397_028:0197c08_10"
    },
    {
        "source_sentence": "若觀有非有，是名集智觀集聖諦。",
        "translation": "If someone observes what's existent and what's not existent, this is called the noble truth of observing accumulation with knowledge of accumulation.",
        "source": "T13n0397_028:0197c09_11"
    },
    {
        "source_sentence": "一切生非生，是即非滅，若法不生即無有滅，是名為滅。",
        "translation": "All that arises and doesn't arise, which is not cessation, and if things don't arise, then there's no cessation, which is called cessation.",
        "source": "T13n0397_028:0197c10_12"
    },
    {
        "source_sentence": "若觀此滅即是滅智觀滅聖諦。",
        "translation": "If he observes that cessation is cessation, then the knowledge of cessation observes the noble truth of cessation.",
        "source": "T13n0397_028:0197c11_13"
    },
    {
        "source_sentence": "若如是等，推求稱量思惟分別，是名為道。",
        "translation": "If such things are sought, measured, contemplated, and discriminated, this is called the path.",
        "source": "T13n0397_028:0197c12_14"
    },
    {
        "source_sentence": "若滅如是求稱量等，入法門者，是名道智觀道聖諦。",
        "translation": "If someone ceases to thus seek fame and so forth and enters the dharma-gate, this is called the path's wisdom that observes the noble truth of the path.",
        "source": "T13n0397_028:0197c13_0"
    },
    {
        "source_sentence": "若住於智不證聖諦，是名菩薩觀諦方便。",
        "translation": "If someone abides in knowledge and doesn't realize the noble truths, this is called a bodhisattva's method of observing the truths.",
        "source": "T13n0397_028:0197c14_1"
    },
    {
        "source_sentence": "「云何菩薩觀緣方便？",
        "translation": "What is the bodhisattva's method of contemplating cognition?",
        "source": "T13n0397_028:0197c15_2"
    },
    {
        "source_sentence": "集不善思惟故無明集，無明集故行集，行集故識集，識集故名色集，名色集故六入集，",
        "translation": "because of the accumulation of ignorance, there is the origin of formations; because of the accumulation of formations, there is the origin of consciousness; because of the accumulation of consciousness, there is the origin of name-and-form; because of the accumulation of name-and-form, there are the six sense-fields.",
        "source": "T13n0397_028:0197c15_3"
    },
    {
        "source_sentence": "六入集故觸集，觸集故受集，受集故愛集，愛集故取集，取集故有集，",
        "translation": "Because of the six sense-fields, there is the coming together of tangibles; because of the coming together of tangibles, there is the coming together of feelings; because of the coming together of feelings, there is the coming together of desires; because of the coming together of desires, there is the coming together of grasping; because of the coming together of grasping, there is the coming together.",
        "source": "T13n0397_028:0197c17_4"
    },
    {
        "source_sentence": "有集故生集，生集故老死集，老死集故憂悲苦惱集。",
        "translation": "Because of the accumulation, there is the accumulation of birth; because of the accumulation of birth, there is the accumulation of old age and death; because of the accumulation of old age and death, sorrow, lamentation, pain and vexation are accumulated.",
        "source": "T13n0397_028:0197c19_5"
    },
    {
        "source_sentence": "若知如是諸苦聚集，是名菩薩觀緣方便。",
        "translation": "If someone knows that such sufferings are gathered together, this is called the bodhisattva's method of contemplating conditions.",
        "source": "T13n0397_028:0197c20_6"
    },
    {
        "source_sentence": "若住如是諸法聚集，則不長養，無所作，無諍訟，無有主，無所屬，無繫縛。",
        "translation": "If someone abides in such a collection of dharmas, they won't grow, do nothing, have no disputes, have no owner, have no belonging, and are not bound by fetters.",
        "source": "T13n0397_028:0197c21_7"
    },
    {
        "source_sentence": "所謂若因善法、因不善法、因不動法、若因向涅槃法，如是等法如實分別。",
        "translation": "It's called the true discernment of good qualities, unskillful qualities, immovable qualities, and those who are headed toward nirvāṇa because of such qualities.",
        "source": "T13n0397_028:0197c23_8"
    },
    {
        "source_sentence": "若諸眾生根量齊限，因是諸根所作諸業，若有受報及非受報，善知其因聚集方便，",
        "translation": "If the faculties of sentient beings are limited in their capacities, and it's because of these faculties that actions are performed, whether they experience rewards or non-retribution, they well know the method of gathering causes.",
        "source": "T13n0397_028:0197c24_9"
    },
    {
        "source_sentence": "是名菩薩觀緣方便。",
        "translation": "This is called the bodhisattva's method of contemplating cognition.",
        "source": "T13n0397_028:0197c26_10"
    },
    {
        "source_sentence": "「不善思惟滅則無明滅，無明滅故行滅，行滅故識滅，識滅故名色滅，",
        "translation": "“When there is cessation of bad contemplation, there is cessation of ignorance; when there is cessation of ignorance, there is cessation of conditioned forces; when there is cessation of conditioned forces, there is cessation of consciousness; and when there is cessation of name and form, there is cessation of name-and-form.",
        "source": "T13n0397_028:0197c27_11"
    },
    {
        "source_sentence": "名色滅故六入滅，六入滅故觸滅，觸滅故受滅，受滅故愛滅，愛滅故取滅，",
        "translation": "Because of the cessation of name and form, six sense-fields are extinguished: because of the cessation of the six sense-fields, contact is extinguished; because of the cessation of contact, feeling is extinguished; because of the cessation of feeling, thirst is extinguished; because of the cessation of thirst, gras",
        "source": "T13n0397_028:0197c28_12"
    },
    {
        "source_sentence": "取滅故有滅，有滅故生滅，生滅故老死滅，老死滅故憂悲苦惱諸苦聚滅。",
        "translation": "Because of the cessation of grasping, there is cessation; because of the cessation of existence, birth ceases; because of the cessation of birth, old age and death cease; because of the cessation of old age and death, sorrow and suffering and the mass of suffering cease.",
        "source": "T13n0397_028:0198a01_13"
    },
    {
        "source_sentence": "若知如是諸苦聚滅，是名菩薩觀緣方便。",
        "translation": "If someone knows the cessation of such painful clusters, this is called a bodhisattva's method of contemplating cognition.",
        "source": "T13n0397_028:0198a03_14"
    },
    {
        "source_sentence": "「一切諸法屬因屬緣屬和合；",
        "translation": "All things belong to causes, to conditions, and to conjunctions.",
        "source": "T13n0397_028:0198a04_0"
    },
    {
        "source_sentence": "若法屬因緣和合，是法則不屬我人眾生壽命；",
        "translation": "If a factor belongs to the conjunction of causes and conditions, then this factor does not belong to the life spans of self, human beings, or sentient beings.",
        "source": "T13n0397_028:0198a04_1"
    },
    {
        "source_sentence": "若法不屬我人眾生壽命則不入法數，能如是知是名菩薩觀緣方便。",
        "translation": "If the Dharma doesn't belong to self and the lives of sentient beings, then they won't enter into the number of dharmas, and if they can thus know it, this is called the bodhisattva's method of contemplating conditions.",
        "source": "T13n0397_028:0198a05_2"
    },
    {
        "source_sentence": "若菩薩所修諸法，為助菩提安止菩提，如是諸緣悉見滅盡，而不取證為化眾生，",
        "translation": "If the things cultivated by enlightening beings are conducive to enlightenment, so that they may attain enlightenment and abide in enlightenment, then all such conditions will be seen as extinguished, but they will not apprehend or realize them for the instruction of sentient beings.",
        "source": "T13n0397_028:0198a07_3"
    },
    {
        "source_sentence": "是名菩薩觀緣方便。",
        "translation": "This is called the bodhisattva's method of contemplating cognition.",
        "source": "T13n0397_028:0198a09_4"
    },
    {
        "source_sentence": "「云何觀三世方便？",
        "translation": "What's the method of observing the three times?",
        "source": "T13n0397_028:0198a09_5"
    },
    {
        "source_sentence": "若念過去己身他身，善不善心心數法，不善心法呵責毀呰，善心數法悉以迴向無上菩提，",
        "translation": "If someone thinks of their own body and others’ bodies in the past, wholesome or unwholesome thoughts and mental factors, unwholesome thoughts and mental factors that rebuke or disparage them, and wholesome thoughts and mental factors all lead back to unsurpassed enlightenment.",
        "source": "T13n0397_028:0198a10_0"
    },
    {
        "source_sentence": "是名菩薩觀過去方便。",
        "translation": "This is called a bodhisattva's method of observing the past.",
        "source": "T13n0397_028:0198a12_1"
    },
    {
        "source_sentence": "若未來世心心數法，一向專念菩提之道，若起善心願悉迴向無上菩提，",
        "translation": "If in the future they always concentrate on the path of enlightenment, and if they give rise to good intentions and vows, they will all return to unsurpassed enlightenment.",
        "source": "T13n0397_028:0198a12_2"
    },
    {
        "source_sentence": "所有不善心心數法不令入心，發如是願，是名菩薩觀未來方便。",
        "translation": "To have unwholesome mental states and mental factors that aren't allowed to enter the mind and make such a vow is called a bodhisattva observing future skillful means.",
        "source": "T13n0397_028:0198a14_3"
    },
    {
        "source_sentence": "若現在世心心數法，善思惟等所作諸業，悉以迴向無上菩提，是名菩薩觀現在方便。",
        "translation": "If he skillfully contemplates and so forth the actions of mind and mental factors in the present world and dedicates them all to unsurpassed enlightenment, this is called a bodhisattva's method of observing the present.",
        "source": "T13n0397_028:0198a15_4"
    },
    {
        "source_sentence": "作如是方便，是名菩薩觀三世方便。",
        "translation": "To do so is called a bodhisattva's method of observing the three worlds.",
        "source": "T13n0397_028:0198a17_5"
    },
    {
        "source_sentence": "「復次，善解三世空無所有。",
        "translation": "“Furthermore, they well understand that the emptiness of the three worlds has no existence.",
        "source": "T13n0397_028:0198a18_6"
    },
    {
        "source_sentence": "若作是觀觀三世空智慧力故，若於三世諸佛所種無量功德，悉以迴向無上菩提方便力故，",
        "translation": "If one does so because of the power of knowledge and wisdom of contemplating emptiness of all times, if one plants innumerable virtues in the buddhas of past, present, and future by dedicating them to unexcelled enlightenment through the power of skillful means,",
        "source": "T13n0397_028:0198a19_7"
    },
    {
        "source_sentence": "如是方便，是名菩薩觀三世方便。",
        "translation": "Such a method is called the bodhisattva's method of observing the three times.",
        "source": "T13n0397_028:0198a21_8"
    },
    {
        "source_sentence": "「復次，雖見過去盡法不至未來，而常修善精勤不懈；",
        "translation": "“Furthermore, though they see all things of the past and do not go to the future, yet always cultivate wholesome effort without slackening.",
        "source": "T13n0397_028:0198a22_9"
    },
    {
        "source_sentence": "觀未來法雖無生出，不捨精進願向菩提；",
        "translation": "Observing future things, even though there is no birth or emergence, they do not give up their energy and vows to proceed toward enlightenment.",
        "source": "T13n0397_028:0198a23_10"
    },
    {
        "source_sentence": "觀現在法雖念念滅，其心不忘發趣菩提。",
        "translation": "Even though they observe the present dharmas in mindfulness and cessation, their mind doesn't forget them and set out for enlightenment.",
        "source": "T13n0397_028:0198a24_11"
    },
    {
        "source_sentence": "如是方便，是名菩薩觀三世方便。",
        "translation": "Such a method is called the bodhisattva's method of observing the three times.",
        "source": "T13n0397_028:0198a25_12"
    },
    {
        "source_sentence": "過去已滅、未來未至、現在不住，雖如是觀心心數法生滅散壞，而常不捨聚集善根助菩提法，",
        "translation": "Having ceased in the past, not yet arriving in the future, and not abiding in the present, they thus observe mind and mental states as arising and perishing and disintegrating, yet they always don’t abandon the factors conducive to enlightenment that accumulate roots of goodness.",
        "source": "T13n0397_028:0198a26_0"
    },
    {
        "source_sentence": "如是方便，是名菩薩觀三世方便。",
        "translation": "Such a method is called the bodhisattva's method of observing the three times.",
        "source": "T13n0397_028:0198a28_1"
    },
    {
        "source_sentence": "「復次，若諸神通，念過去世所作善根，念已迴向無上菩提，念未來世未生善根，",
        "translation": "“Furthermore, if those spiritual powers are mindful of the good roots created in past lives and dedicate them back to unsurpassed enlightenment after being mindful, and they’re mindful of the good roots not yet produced in future lives,",
        "source": "T13n0397_028:0198a29_0"
    },
    {
        "source_sentence": "願心所圖如意成就，現在世中常生善根，專念不懈迴向無上菩提之道。",
        "translation": "May the mind's intention be accomplished as intended, always producing good roots in the present life, focusing on the path of unsurpassed enlightenment without relying or dedicating themselves back to it.",
        "source": "T13n0397_028:0198b01_1"
    },
    {
        "source_sentence": "如是方便，是名菩薩觀三世方便。",
        "translation": "Such a method is called the bodhisattva's method of observing the three times.",
        "source": "T13n0397_028:0198b03_2"
    },
    {
        "source_sentence": "「復次，若化眾生，念過去世所作善根助道功德，所謂隨眾生心應可化者，",
        "translation": "“Furthermore, if someone were to teach sentient beings the merit of the path of mindfulness of past good roots cultivated by those who practice them, they would be able to teach according to the minds of sentient beings.",
        "source": "T13n0397_028:0198b04_3"
    },
    {
        "source_sentence": "如其所樂悉已化訖。",
        "translation": "They've completed their transformation according to their wishes.",
        "source": "T13n0397_028:0198b05_4"
    },
    {
        "source_sentence": "若未來世所有眾生，或須見佛及諸聖人而得度者，隨形應適悉令得度。",
        "translation": "If all sentient beings in the future need to see buddhas and sages and attain salvation, they'll be liberated according to their form and appropriateness.",
        "source": "T13n0397_028:0198b06_5"
    },
    {
        "source_sentence": "若現在世所有眾生，若應聞法應見神力，亦隨所應皆悉化之，隨所教化諸眾生已，",
        "translation": "If all sentient beings in the present world should hear the teaching and see its spiritual powers, he also teaches them according to their capacities. Having taught and educated those sentient beings according to what they need,",
        "source": "T13n0397_028:0198b07_6"
    },
    {
        "source_sentence": "則於三世成自他利，如是之利悉為菩提具無礙智。",
        "translation": "Then, in the three times, they accomplish their own and others' benefits, and such benefits are all enlightenment with unobstructed cognition.",
        "source": "T13n0397_028:0198b09_7"
    },
    {
        "source_sentence": "如是方便，是名菩薩觀三世方便。",
        "translation": "Such a method is called the bodhisattva's method of observing the three times.",
        "source": "T13n0397_028:0198b11_8"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T13n0397_028:0198b12_0"
    },
    {
        "source_sentence": "云何菩薩觀諸乘方便？",
        "translation": "How does a bodhisattva observe the means of the vehicles?",
        "source": "T13n0397_028:0198b12_1"
    },
    {
        "source_sentence": "世有三乘。",
        "translation": "There are three vehicles in the world.",
        "source": "T13n0397_028:0198b12_2"
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are these three?",
        "source": "T13n0397_028:0198b13_0"
    },
    {
        "source_sentence": "聲聞乘、緣覺乘、大乘。",
        "translation": "The śrāvaka vehicle, the pratyekabuddha vehicle, and the great vehicle.",
        "source": "T13n0397_028:0198b13_1"
    },
    {
        "source_sentence": "「復有二乘。",
        "translation": "Again, there are the two vehicles.",
        "source": "T13n0397_028:0198b13_2"
    },
    {
        "source_sentence": "何等二？",
        "translation": "What are these two?",
        "source": "T13n0397_028:0198b14_0"
    },
    {
        "source_sentence": "天乘、人乘。",
        "translation": "The heavenly vehicle and the human vehicle.",
        "source": "T13n0397_028:0198b14_1"
    },
    {
        "source_sentence": "云何菩薩觀聲聞乘？",
        "translation": "What is a bodhisattva’s observation of the vehicle of the sravakas?",
        "source": "T13n0397_028:0198b14_2"
    },
    {
        "source_sentence": "佛未出世無聲聞乘。",
        "translation": "Before the Buddha appeared in the world, there was no śrāvaka vehicle.",
        "source": "T13n0397_028:0198b14_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_028:0198b15_4"
    },
    {
        "source_sentence": "從他聞法生於正見。",
        "translation": "They hear the teaching from others and give rise to right view.",
        "source": "T13n0397_028:0198b15_5"
    },
    {
        "source_sentence": "所謂聞者持戒威儀，戒威儀具故戒聚具足，戒聚具足已定聚具足，定聚具足已慧聚具足，",
        "translation": "The so-called hearer observes the precepts with deportment of morality. Because he is supplied with the precepts, the group of moral precepts is supplied; after the group of precepts is supplied, the group of concentration is supplied; after the group of concentration is supplied, the group of wisdom is supplied.",
        "source": "T13n0397_028:0198b16_6"
    },
    {
        "source_sentence": "慧聚具足已解脫聚具足，解脫聚具足已解脫知見聚具足。",
        "translation": "The aggregate of wisdom is complete, the aggregate of liberation is complete, and the aggregate of knowledge and vision of liberation is complete when the aggregate of liberation is complete.",
        "source": "T13n0397_028:0198b18_7"
    },
    {
        "source_sentence": "如是方便，是名菩薩觀聲聞乘方便。",
        "translation": "Such a method is called the bodhisattva's method of observing the śrāvaka vehicle.",
        "source": "T13n0397_028:0198b19_8"
    },
    {
        "source_sentence": "「復次，觀聲聞乘，若善不善及不動行，心常毀呰厭離三界，觀一切行無常苦無我寂滅涅槃，",
        "translation": "“Furthermore, they contemplate the vehicle of the śrāvakas: whether it’s good, bad, or immovable; their minds always disparage and dislike the three realms; they contemplate all formations as impermanent, painful, selfless, tranquil, and nirvana.",
        "source": "T13n0397_028:0198b20_9"
    },
    {
        "source_sentence": "乃至一念不悕受生，常懷怖懼心不甘樂，觀陰如怨界如毒蛇，入如空聚，",
        "translation": "He observes that the aggregates are like an enemy realm like a poisonous snake, and enters them like a cluster of empty space.",
        "source": "T13n0397_028:0198b22_10"
    },
    {
        "source_sentence": "於一切趣不願受生。",
        "translation": "In all destinies, they don't wish to be born.",
        "source": "T13n0397_028:0198b24_11"
    },
    {
        "source_sentence": "若能如是開示分別，是名菩薩觀聲聞乘方便。",
        "translation": "If someone can thus reveal and discern it, this is called a bodhisattva observing the method of the śrāvaka vehicle.",
        "source": "T13n0397_028:0198b24_12"
    },
    {
        "source_sentence": "「云何菩薩觀緣覺乘方便？",
        "translation": "What is the bodhisattva's method of observing the vehicle of pratyekabuddha?",
        "source": "T13n0397_028:0198b25_13"
    },
    {
        "source_sentence": "若緣覺出世，觀其所行如實知之，緣覺所行出過聲聞所有功德，欲精進不放逸，",
        "translation": "If a pratyekabuddha emerges from the world and observes what he does, he knows it as it really is. The practice of a pratyekabuddha surpasses all the virtues of śrāvakas; he desires effort and doesn’t indulge in laziness.",
        "source": "T13n0397_028:0198b26_14"
    },
    {
        "source_sentence": "持戒少聞不多供養諸佛世尊給侍使令，以中根故。",
        "translation": "He observes the precepts with little learning and doesn't often make offerings to the Bhagavān, who gives them to his attendants and messengers because of his middle faculty.",
        "source": "T13n0397_028:0198b28_15"
    },
    {
        "source_sentence": "常有厭心，所作眾事皆悉尠少，厭患憒閙常樂遠離，獨住空閑威儀庠序，",
        "translation": "They are always disillusioned with all kinds of things they do. They are always happy to be far away from trouble and disturbance. They live alone in a quiet, secluded place; their manner is dignified and peaceful.",
        "source": "T13n0397_028:0198b29_16"
    },
    {
        "source_sentence": "出入凝重安心靜默簡於人事，能為眾生現世福田，其心翫樂觀十二緣，",
        "translation": "He enters and emerges, concentrating his attention on peacefulness, quietude, and simplicity of mind. For sentient beings he can be a field of blessings in the present life for sentient beings. Their minds delight in contemplating twelve conditions:",
        "source": "T13n0397_028:0198c01_17"
    },
    {
        "source_sentence": "常念一法出世涅槃，數遊禪定不從他聞，自然覺了少分境界，因緣悟道故名緣覺。",
        "translation": "He always thinks of a single teaching that transcends the world and nirvāṇa, repeatedly travels to meditation without hearing it from others, naturally perceives a small part of his objective realm, and is called pratyekabuddha because he awakens to the path with causes and conditions.",
        "source": "T13n0397_028:0198c03_18"
    },
    {
        "source_sentence": "若能如是開示分別，是名菩薩觀緣覺乘方便。",
        "translation": "If someone can thus reveal and discern it, this is called a bodhisattva observing the method of the pratyekabuddha vehicle.",
        "source": "T13n0397_028:0198c05_19"
    },
    {
        "source_sentence": "「云何菩薩觀大乘方便？",
        "translation": "How does a bodhisattva observe the great vehicle skillful means?",
        "source": "T13n0397_028:0198c06_20"
    },
    {
        "source_sentence": "其乘無量，今於此中當說少分。",
        "translation": "Their vehicles are immeasurable, and I'll explain a small part of them here.",
        "source": "T13n0397_028:0198c07_21"
    },
    {
        "source_sentence": "是乘無量，悉能容受一切眾生，無罣礙故；",
        "translation": "This vehicle is immeasurable, able to contain all sentient beings without obstruction.",
        "source": "T13n0397_028:0198c07_22"
    },
    {
        "source_sentence": "是乘增長一切善根，令無量眾生得受用故；",
        "translation": "This vehicle develops all roots of goodness, enabling infinite sentient beings to experience it.",
        "source": "T13n0397_028:0198c08_23"
    },
    {
        "source_sentence": "是乘具足諸波羅蜜，能隨眾生心行化故；",
        "translation": "This vehicle is endowed with the transcendent ways, being able to transform sentient beings according to their mental patterns.",
        "source": "T13n0397_028:0198c09_24"
    },
    {
        "source_sentence": "是乘能過助道之法，進趣無礙至道場故；",
        "translation": "This vehicle is able to go beyond the factors assisting enlightenment, because it proceeds unhindered in all directions and reaches the terrace of enlightenment.",
        "source": "T13n0397_028:0198c10_25"
    },
    {
        "source_sentence": "是乘平等無礙光明照於一切，無量眾生悉堪受故；",
        "translation": "This vehicle impartially illuminates all with unobstructed light, because infinite sentient beings are able to receive it.",
        "source": "T13n0397_028:0198c11_26"
    },
    {
        "source_sentence": "是乘無畏過怯弱道，悉能示現諸佛法故；",
        "translation": "This vehicle has no fear and is beyond the path of weakness, being able to show all the buddha-teachings.",
        "source": "T13n0397_028:0198c12_27"
    },
    {
        "source_sentence": "是乘能壞一切諸魔外道邪眾，了十二緣，建立佐助菩提幢故；",
        "translation": "This vehicle can destroy all the demons and heretics, because it understands the twelve conditions by establishing the banner of aid to enlightenment.",
        "source": "T13n0397_028:0198c13_28"
    },
    {
        "source_sentence": "是乘能除一切諸邊有無斷常因緣諸見所起煩惱障礙，覆蓋疑網調戲，得佛無礙真智慧故；",
        "translation": "This vehicle is able to remove all the obstacles of afflictions that arise in all extremes as causes and conditions of nonabandonment and permanence, because it covers the web of doubt and regulates playfulness, attaining unhindered true knowledge of buddhas.",
        "source": "T13n0397_028:0198c15_29"
    },
    {
        "source_sentence": "是乘富足具諸珍寶，真實不虛能益眾生，大悲勇猛本願成就故；",
        "translation": "This vehicle is endowed with all treasures, genuine and not false, able to benefit sentient beings, because of having fulfilled the original vow of great compassion and boldness.",
        "source": "T13n0397_028:0198c17_30"
    },
    {
        "source_sentence": "是乘具足十力無畏不共之法，相好嚴身身口意故。",
        "translation": "It's the vehicle that possesses the ten powers, fearlessness, and unique qualities of the ten powers, which are characterized by adorning body, body, speech, and thought.",
        "source": "T13n0397_028:0198c18_31"
    },
    {
        "source_sentence": "如是方便，是名菩薩觀大乘方便。",
        "translation": "Such a method is called the bodhisattva's method of observing the great vehicle.",
        "source": "T13n0397_028:0198c20_32"
    },
    {
        "source_sentence": "「云何菩薩觀一切法方便？",
        "translation": "How does a bodhisattva contemplate the skillful means of all dharmas?",
        "source": "T13n0397_028:0198c20_33"
    },
    {
        "source_sentence": "所謂若有為、若無為，菩薩於中善知方便。",
        "translation": "It's called whether it's conditioned or unconditioned, and the bodhisattva well knows the skillful means of doing so.",
        "source": "T13n0397_028:0198c21_34"
    },
    {
        "source_sentence": "云何善觀有為方便？",
        "translation": "What is the skillful means of observing conditioned things well?",
        "source": "T13n0397_028:0198c22_35"
    },
    {
        "source_sentence": "所有身善業、口善業、意善業，願以迴向無上菩提，是名有為方便。",
        "translation": "To have good physical actions, good verbal actions, and good mental actions that wish to be directed back to unsurpassed enlightenment is called a conditioned method.",
        "source": "T13n0397_028:0198c22_36"
    },
    {
        "source_sentence": "若觀身口意業同菩提相，迴向菩提，是名菩薩觀無為方便。",
        "translation": "If someone observes that bodily, verbal, and mental actions are the same as the characteristics of enlightenment and dedicates themselves back to enlightenment, this is called a bodhisattva's method of observing nothingness.",
        "source": "T13n0397_028:0198c24_37"
    },
    {
        "source_sentence": "「復次，有為方便，若能聚集五波羅蜜，是名有為方便。",
        "translation": "“Furthermore, conditioned skillful means is called conditioned skillful means if it can gather the five perfections.",
        "source": "T13n0397_028:0198c25_38"
    },
    {
        "source_sentence": "雖知般若波羅蜜其性無為，於所聚集終無厭賤，要欲具足諸波羅蜜，深解善根同無漏菩提，",
        "translation": "Even though they know that the nature of the perfection of wisdom is unconditional, they never tire of or despise those who gather there. They want to perfect the perfections and deeply understand that the roots of goodness are the same as pure enlightenment.",
        "source": "T13n0397_028:0198c27_39"
    },
    {
        "source_sentence": "而猶願成一切種智，是名菩薩無為方便。",
        "translation": "They still wish to attain all kinds of cognition, which is called the bodhisattva's method of nonproductivity.",
        "source": "T13n0397_028:0198c29_40"
    },
    {
        "source_sentence": "「復次，有為方便，住於無礙平等心中，以四攝法攝取眾生，是名有為方便。",
        "translation": "“Furthermore, conditioned skillful means that abides in an unobstructed and equal mind and takes care of sentient beings with the four methods of gathering in sentient beings is called conditioned skillful means.",
        "source": "T13n0397_028:0199a01_41"
    },
    {
        "source_sentence": "云何無為方便？",
        "translation": "What's the unconditioned method?",
        "source": "T13n0397_028:0199a02_42"
    },
    {
        "source_sentence": "善解眾生無我無人無所悕求，知四攝法同無為解脫，而能迴向一切種智，",
        "translation": "They know that the four means of unification are the same as liberation from nonexistence, yet they can turn to all kinds of knowledge.",
        "source": "T13n0397_028:0199a03_43"
    },
    {
        "source_sentence": "是名無為方便。",
        "translation": "This is called the method of nonproductivity.",
        "source": "T13n0397_028:0199a04_44"
    },
    {
        "source_sentence": "「復次，有為方便，若諸煩惱生死相續斷令不起，所有善根助菩提者令不斷絕，",
        "translation": "“Furthermore, if conditioned states of affliction and birth-and-death are continually eliminated so that they don’t arise, and if all the good roots that contribute to enlightenment are eliminated so that they don’t arise,",
        "source": "T13n0397_028:0199a05_45"
    },
    {
        "source_sentence": "乃至不行少煩惱分，是名有為方便。",
        "translation": "Up to not practicing the parts with few afflictions is called conditioned skillful means.",
        "source": "T13n0397_028:0199a07_46"
    },
    {
        "source_sentence": "云何無為方便？",
        "translation": "What's the unconditioned method?",
        "source": "T13n0397_028:0199a07_47"
    },
    {
        "source_sentence": "雖觀空無相無願，知此三空即助道方便故能不證，是名無為方便。",
        "translation": "Although he observes emptiness, signlessness, and wishlessness, he knows that these three kinds of emptiness are the method for assisting the path and therefore can't realize them, which is called the method of nonproductivity.",
        "source": "T13n0397_028:0199a08_48"
    },
    {
        "source_sentence": "「復次，有為方便，雖在三界不為三界煩惱所污，是名有為方便。",
        "translation": "“Furthermore, conditioned skillful means that although it exists in the three realms and isn’t defiled by the afflictions of the three realms, this is called conditioned skillful means.",
        "source": "T13n0397_028:0199a09_49"
    },
    {
        "source_sentence": "云何無為方便？",
        "translation": "What's the unconditioned method?",
        "source": "T13n0397_028:0199a11_50"
    },
    {
        "source_sentence": "雖出三界不證於出，是名無為方便。",
        "translation": "Even though he leaves the three realms, he doesn't realize emancipation, which is called the method of nonproductivity.",
        "source": "T13n0397_028:0199a11_51"
    },
    {
        "source_sentence": "如佛所說，知諸法方便則能具足一切種智。",
        "translation": "As the Buddha teaches, knowing all dharmas and skillful means can then fully possess all kinds of cognition.",
        "source": "T13n0397_028:0199a12_52"
    },
    {
        "source_sentence": "何以故，一切種智無量無邊，具足正念慧方便故，是故名為一切法方便。",
        "translation": "Because all kinds of knowledge are immeasurable and limitless because they are endowed with the skillful means of right mindfulness, wisdom, and so on. That is why it is called ‘the skillful means of all factors’.",
        "source": "T13n0397_028:0199a13_53"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0199a15_54"
    },
    {
        "source_sentence": "是名菩薩智慧所緣八方便也。",
        "translation": "These are called the eight skillful means that are the objects of the bodhisattva's wisdom.",
        "source": "T13n0397_028:0199a15_55"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T13n0397_028:0199a16_0"
    },
    {
        "source_sentence": "是八方便能攝菩薩無盡智慧。",
        "translation": "These are the eight kinds of skillful means that can gather the bodhisattva's inexhaustible wisdom.",
        "source": "T13n0397_028:0199a16_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0199a16_2"
    },
    {
        "source_sentence": "是慧能解，觀了善法不善法故；",
        "translation": "This wisdom can understand, because it perceives wholesome and unwholesome states.",
        "source": "T13n0397_028:0199a17_3"
    },
    {
        "source_sentence": "是慧如箭，善射法故；",
        "translation": "This wisdom is like an arrow, because it skillfully shoots the dharma.",
        "source": "T13n0397_028:0199a17_4"
    },
    {
        "source_sentence": "是慧財行，聖法現在故；",
        "translation": "They are the means of enlightenment because they manifest the holy Teaching.",
        "source": "T13n0397_028:0199a18_5"
    },
    {
        "source_sentence": "是慧真解，斷除諸見煩惱障礙諸覆蓋故；",
        "translation": "It is the true liberation of wisdom, because it removes the obscurations of views and afflictive hindrances.",
        "source": "T13n0397_028:0199a19_0"
    },
    {
        "source_sentence": "是慧定願，悉能滿足本所求故；",
        "translation": "It is the vow of wisdom and concentration, being able to fulfill what one had originally desired.",
        "source": "T13n0397_028:0199a19_1"
    },
    {
        "source_sentence": "是慧消融，能除煩惱諸焦熱故；",
        "translation": "This wisdom disappears and is fused, because it can remove the burning heat of the defilements.",
        "source": "T13n0397_028:0199a20_2"
    },
    {
        "source_sentence": "是慧悅豫，不斷法樂故；",
        "translation": "It is the joy of wisdom, because it does not cut off the bliss of the Teaching.",
        "source": "T13n0397_028:0199a21_3"
    },
    {
        "source_sentence": "是慧正念，了所緣義故；",
        "translation": "It is the right mindfulness of wisdom because it perceives objectreferents.",
        "source": "T13n0397_028:0199a21_4"
    },
    {
        "source_sentence": "是慧安住，具三十七助道法故；",
        "translation": "It is the abode of wisdom, because it contains the thirty-seven factors conducive to enlightenment.",
        "source": "T13n0397_028:0199a22_5"
    },
    {
        "source_sentence": "是慧得相，如所行乘能具足故；",
        "translation": "This is the characteristic of the acquisition of wisdom, because it can be fulfilled by means of the vehicle in which one practices.",
        "source": "T13n0397_028:0199a23_6"
    },
    {
        "source_sentence": "是慧解相，性智照故；",
        "translation": "They are the characteristic of wisdom and understanding, because by their nature knowledge illumines.",
        "source": "T13n0397_028:0199a24_0"
    },
    {
        "source_sentence": "是慧能度，過諸流故；",
        "translation": "This wisdom is able to cross over, because it goes beyond the streams.",
        "source": "T13n0397_028:0199a24_1"
    },
    {
        "source_sentence": "是慧能進，成正定決定故；",
        "translation": "It is the power of wisdom that advances, because it settles right concentration with certainty.",
        "source": "T13n0397_028:0199a25_0"
    },
    {
        "source_sentence": "是慧正見，具足一切諸善法故；",
        "translation": "This is wisdom and right view, because they are endowed with all wholesome states.",
        "source": "T13n0397_028:0199a25_1"
    },
    {
        "source_sentence": "是慧歡喜，墮煩惱者能拔濟故；",
        "translation": "This wisdom is rejoicing, because it can rescue those who have fallen into the defilements.",
        "source": "T13n0397_028:0199a26_2"
    },
    {
        "source_sentence": "是慧殊勝，得頂法故；",
        "translation": "This wisdom is superior because it acquires the highest state of enlightenment.",
        "source": "T13n0397_028:0199a27_3"
    },
    {
        "source_sentence": "是慧微妙，自然覺故；",
        "translation": "It is the subtlety of wisdom, because it is spontaneously awakened.",
        "source": "T13n0397_028:0199a27_4"
    },
    {
        "source_sentence": "是慧不行，不近三世故；",
        "translation": "This wisdom does not proceed: because it does not approach the three periods of time.",
        "source": "T13n0397_028:0199a28_5"
    },
    {
        "source_sentence": "是慧攝取，具一切方便故；",
        "translation": "It is the acquisition of wisdom, because it contains all means of liberation.",
        "source": "T13n0397_028:0199a28_6"
    },
    {
        "source_sentence": "是慧能斷，過諸思想故；",
        "translation": "This wisdom is able to eliminate them, because it goes beyond thought.",
        "source": "T13n0397_028:0199a29_7"
    },
    {
        "source_sentence": "是慧不放逸，捨離闇曚故；",
        "translation": "This wisdom is not heedless because it abandons darkness and ignorance.",
        "source": "T13n0397_028:0199a29_8"
    },
    {
        "source_sentence": "是慧初始，發行一切諸善法故；",
        "translation": "This is the first beginning of wisdom, because it produces all wholesome states.",
        "source": "T13n0397_028:0199b01_9"
    },
    {
        "source_sentence": "是慧能發，具諸乘故；",
        "translation": "This wisdom can give rise to it because it is endowed with the teachings of the vehicles.",
        "source": "T13n0397_028:0199b02_10"
    },
    {
        "source_sentence": "是慧照明，除無明網故；",
        "translation": "It is the light of wisdom, because it removes the web of ignorance.",
        "source": "T13n0397_028:0199b02_11"
    },
    {
        "source_sentence": "是慧與眼，一切眾生如其所解得明了故；",
        "translation": "Because all sentient beings attain clarity and comprehension according to their understanding.",
        "source": "T13n0397_028:0199b03_12"
    },
    {
        "source_sentence": "是慧無依，過眼色故；",
        "translation": "This wisdom has no support, because it is beyond the visible matter of the eye.",
        "source": "T13n0397_028:0199b04_13"
    },
    {
        "source_sentence": "是慧第一義，出真實故；",
        "translation": "It is the foremost meaning of wisdom, because it reveals reality.",
        "source": "T13n0397_028:0199b04_14"
    },
    {
        "source_sentence": "是慧無諍，善分別故；",
        "translation": "This wisdom has no ill-will, because it discerns well.",
        "source": "T13n0397_028:0199b05_15"
    },
    {
        "source_sentence": "是慧明了，向智門故；",
        "translation": "It is the insight that understands, because it proceeds toward the gate of knowledge.",
        "source": "T13n0397_028:0199b05_16"
    },
    {
        "source_sentence": "是慧無盡，能遍行故；",
        "translation": "This wisdom is inexhaustible because it can act everywhere.",
        "source": "T13n0397_028:0199b06_17"
    },
    {
        "source_sentence": "是慧不逆，見十二緣故；",
        "translation": "This wisdom is not contrary: because it sees twelve reasons.",
        "source": "T13n0397_028:0199b06_18"
    },
    {
        "source_sentence": "是慧解脫，諸纏繫縛悉善斷故；",
        "translation": "It is the liberation of wisdom, because all fetters and bonds are well abandoned.",
        "source": "T13n0397_028:0199b07_19"
    },
    {
        "source_sentence": "是慧不雜，離於一切障礙法故。",
        "translation": "This wisdom is not mixed, because it's free of all obstructive dharmas.",
        "source": "T13n0397_028:0199b08_20"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T13n0397_028:0199b09_0"
    },
    {
        "source_sentence": "一切眾生所有心行，如是智慧悉能照達，如眾生心行慧思智、諸煩惱門，",
        "translation": "All sentient beings’ mental patterns are illumined by this knowledge. Just as sentient beings’ mental patterns, wisdom, deliberation, and the gates of affliction are illuminated by all kinds of knowledge:",
        "source": "T13n0397_028:0199b09_1"
    },
    {
        "source_sentence": "如是智慧皆悉觀了。",
        "translation": "Such wisdom is fully observed and comprehended.",
        "source": "T13n0397_028:0199b10_2"
    },
    {
        "source_sentence": "若聲聞、緣覺、菩薩、如來所有智慧，是菩薩悉能遍學。",
        "translation": "If there's wisdom possessed by śrāvakas, pratyekbuddhas, bodhisattvas, and tathāgatas, this is the bodhisattva who can fully train.",
        "source": "T13n0397_028:0199b11_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T13n0397_028:0199b12_4"
    },
    {
        "source_sentence": "是名菩薩無盡之慧，以是無盡慧具無盡智。」",
        "translation": "This is called the bodhisattva's inexhaustible wisdom, and it's because of this inexhaustible wisdom that he has inexhaustible wisdom.",
        "source": "T13n0397_028:0199b12_5"
    },
    {
        "source_sentence": "說是法時，三萬二千菩薩善根熟者得無生法忍。",
        "translation": "When he teaches this teaching, 32,000 bodhisattvas whose good roots are ripe attain the tolerance of the nonarising of phenomena.",
        "source": "T13n0397_028:0199b13_6"
    },
    {
        "source_sentence": "大方等大集經卷第二十八",
        "translation": "*Mahāmegha-sūtra, Volume 28",
        "source": "T13n0397_028:0199b15_0"
    }
]