[
    {
        "source_sentence": "大方廣十輪經卷第二",
        "translation": "Dafangguang shilun jing, vol. 2",
        "source": "T13n0410_002:0686a05_0"
    },
    {
        "source_sentence": "失譯人名今附北涼錄",
        "translation": "The names of the lost translators are now appended to the record of Northern Liang",
        "source": "T13n0410_002:0686a07_0"
    },
    {
        "source_sentence": "諸天女問四大品第二",
        "translation": "Second Chapter: The Goddesses' Questions to the Four Great Elements",
        "source": "T13n0410_002:0686a08_0"
    },
    {
        "source_sentence": "爾時，地藏菩薩廣說如是大記莂經時，佉羅堤耶山六種震動，一切音樂不鼓自鳴，",
        "translation": "At the time, when Kṣitigarbha Bodhisattva had extensively taught this Mahāprajñāpāramitā-sūtra, six kinds of trembling shook Mount Kharoṣṭhī, and all the sounds didn't drum or sound themselves.",
        "source": "T13n0410_002:0686a09_0"
    },
    {
        "source_sentence": "雨眾寶華，一切大眾皆悉戰慄生希有想。",
        "translation": "It rained flowers of all kinds of jewels, and all the masses trembled in fear with rare feelings.",
        "source": "T13n0410_002:0686a11_0"
    },
    {
        "source_sentence": "爾時，功德天女、功德樂天女、妙音聲天女、堅固地神天、未曾有天、大光明天，",
        "translation": "At that time, the goddesses of virtue, the goddesses of virtue and bliss, the goddesses of marvelous sound, the earth goddesses of firmness, the unprecedented gods, and the great luminous celestial beings.",
        "source": "T13n0410_002:0686a12_0"
    },
    {
        "source_sentence": "如是等天以為上首，與一萬八千及餘大自在鬼神，從坐而起，合掌向佛，",
        "translation": "Such gods as these were the leaders, accompanied by one million eighty-eight thousand and other great sovereign spirits. Having risen from their seats, they joined their palms and faced the Buddha.",
        "source": "T13n0410_002:0686a13_1"
    },
    {
        "source_sentence": "白佛言：「希有，世尊！",
        "translation": "He said to the Buddha, Rarely, Bhagavān!",
        "source": "T13n0410_002:0686a15_2"
    },
    {
        "source_sentence": "希有，善逝！",
        "translation": "Rarely, Sugata!",
        "source": "T13n0410_002:0686a15_3"
    },
    {
        "source_sentence": "我等雖於四大得自在力，而不能知四大根本初、中、後相起滅因緣，不識怨憎，",
        "translation": "Even though we have attained sovereignty over the four elements, we cannot know the causes and conditions for the arising and ceasing of the primary elements at the beginning, in the middle, or after. We are not aware of enemies or foes.",
        "source": "T13n0410_002:0686a16_4"
    },
    {
        "source_sentence": "不知是善、不善乃至親友。",
        "translation": "They don't know they're good, unskillful, or even friends and relatives.",
        "source": "T13n0410_002:0686a18_5"
    },
    {
        "source_sentence": "若善男子，得是甚深般若波羅蜜，能善分別如是四大初、中、後相，知諸生滅。」",
        "translation": "If good sons attain this profound prajñāpāramitā, they'll be able to skillfully discern the first, middle, and last characteristics of these four major forms and know their arising and ceasing.",
        "source": "T13n0410_002:0686a18_6"
    },
    {
        "source_sentence": "佛言：「如是，如是！",
        "translation": "The Buddha said, So it is, so it is!",
        "source": "T13n0410_002:0686a21_0"
    },
    {
        "source_sentence": "天女！",
        "translation": "Dear goddess!",
        "source": "T13n0410_002:0686a21_1"
    },
    {
        "source_sentence": "此善男子，得甚深般若波羅蜜，善知四大初、中、後者。",
        "translation": "This good man has attained the profound prajñāpāramitā and knows well the beginning, middle, and end of the four elements.",
        "source": "T13n0410_002:0686a21_2"
    },
    {
        "source_sentence": "譬如善神有如意珠，能雨種種無量寶雨有大利益。",
        "translation": "It's like when a good deity has a wish-granting pearl that rains down various kinds of immeasurable precious rain with great benefits.",
        "source": "T13n0410_002:0686a22_3"
    },
    {
        "source_sentence": "如是，善女天！",
        "translation": "So it is, Good Goddess!",
        "source": "T13n0410_002:0686a24_0"
    },
    {
        "source_sentence": "此善男子復能雨於種種覺意無量諸寶，皆悉遍施一切眾生。",
        "translation": "This good man can also rain down various kinds of boundless treasures on the minds of enlightened beings and give them to all sentient beings.",
        "source": "T13n0410_002:0686a24_1"
    },
    {
        "source_sentence": "「譬如寶渚能出無量若干種寶；",
        "translation": "“Good man, it is analogous to a jeweled island that produces an infinite variety of different kinds of treasure.",
        "source": "T13n0410_002:0686a26_0"
    },
    {
        "source_sentence": "是善男子滿足種種覺意等寶亦復如是。",
        "translation": "Good sons, it's likewise with the treasure of fulfilling various kinds of awakening and so forth.",
        "source": "T13n0410_002:0686a26_1"
    },
    {
        "source_sentence": "譬如波利質多羅樹，華初開時光色妙好；",
        "translation": "It is like the color of a pārijātaka tree whose flowers bloom at the first sign of enlightenment.",
        "source": "T13n0410_002:0686a27_2"
    },
    {
        "source_sentence": "如是善男子以無量佛法而自莊嚴亦復如是。",
        "translation": "So it is with good sons who adorn themselves with measureless buddha-teachings.",
        "source": "T13n0410_002:0686a28_3"
    },
    {
        "source_sentence": "如師子王於一切眾生中無能驚者；",
        "translation": "Like the lion king, there is no one among all sentient beings who can be frightened.",
        "source": "T13n0410_002:0686a29_4"
    },
    {
        "source_sentence": "如是善男子於諸眾中亦復如是得無所畏。",
        "translation": "Thus, good sons, you'll also attain fearlessness among the crowd like this.",
        "source": "T13n0410_002:0686b01_5"
    },
    {
        "source_sentence": "「譬如日出滅一切闇；",
        "translation": "“Suppose the sun comes out and extinguishes all darkness.",
        "source": "T13n0410_002:0686b03_0"
    },
    {
        "source_sentence": "如是善男子能除眾生一切諂曲、結、使之闇亦復如是。",
        "translation": "So it is with good sons who can remove the darkness of all the flattering, fetters, and tendencies of sentient beings.",
        "source": "T13n0410_002:0686b03_1"
    },
    {
        "source_sentence": "譬如明月照四天下，能令迷者還得正道；",
        "translation": "It is as if the bright moon shone over the four quarters of the earth and caused those who had lost their way to return to the right path.",
        "source": "T13n0410_002:0686b04_2"
    },
    {
        "source_sentence": "如是善男子能令未入三乘迷於生死曠野道者，皆使迴向得其正道安住三乘。",
        "translation": "Such good sons can cause those who haven't yet entered the three vehicles to be lost in the path of birth-and-death and the wilderness, and they will all return to their right path and abide in the three vehicles.",
        "source": "T13n0410_002:0686b05_3"
    },
    {
        "source_sentence": "「譬如大地百穀種子及諸藥木，一切眾生悉依增長；",
        "translation": "“Good man, this is analogous to the seeds of a hundred different kinds of grains and medicinal trees growing on the earth that all sentient beings rely on.",
        "source": "T13n0410_002:0686b08_0"
    },
    {
        "source_sentence": "如是善男子，一切助道諸餘善法皆得增長。",
        "translation": "Thus, good sons, all the other good qualities that aid in the path will grow.",
        "source": "T13n0410_002:0686b09_1"
    },
    {
        "source_sentence": "「譬如須彌山王能善堅固，安住一切令無增減；",
        "translation": "“Suppose the polar mountain is able to be good and steadfast, abiding in all things without increase or decrease.",
        "source": "T13n0410_002:0686b11_0"
    },
    {
        "source_sentence": "如是善男子，安住佛法而不捨於一切眾生，善根堅固無有缺減不令漏失。",
        "translation": "Thus, good sons, they abide in the Buddha's teaching and don't abandon all sentient beings, their good roots are resolute, without deficiency or loss, and they don't allow themselves to be contaminated.",
        "source": "T13n0410_002:0686b12_1"
    },
    {
        "source_sentence": "「譬如虛空，一切眾生行住出入依止而住；",
        "translation": "“Good man, it is analogous to space where all sentient beings abide by the support of their movements, coming and going, leaving and entering.",
        "source": "T13n0410_002:0686b14_0"
    },
    {
        "source_sentence": "如是善男子，一切眾生亦皆依止，增長一切無量功德。」",
        "translation": "Thus, good sons, all sentient beings also rely on them to increase all their measureless merit.",
        "source": "T13n0410_002:0686b14_1"
    },
    {
        "source_sentence": "爾時，一切大眾聞是地藏菩薩名號，生希有心得未曾有，恭敬尊重皆大歡喜，",
        "translation": "At that moment, when the whole assembly heard the name of this enlightening being Earth-Store Bodhisattva, it gave rise to an unprecedented feeling of joy and reverence.",
        "source": "T13n0410_002:0686b17_0"
    },
    {
        "source_sentence": "皆悉諦觀地藏菩薩目不暫捨。",
        "translation": "They all fully observe the bodhisattva's eyes of the earth store without momentarily abandoning them.",
        "source": "T13n0410_002:0686b18_1"
    },
    {
        "source_sentence": "「頭陀功德盡和合，　　諸聲聞眾無異相，",
        "translation": "The virtues of the ascetic are all combined, and the disciples have no distinctive characteristics.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　地藏菩薩真大士，　　為禮世尊而來此。",
        "translation": "Earth-Store Bodhisattva, the true great man, has come here to pay homage to the Bhagavān.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　度三惡趣諸苦惱，　　為禮世尊而來此，",
        "translation": "Having crossed the three evil destinies of suffering and distress, they came here in homage to the World-honored One.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　諸天普雨無量種，　　皆為供養世尊故。",
        "translation": "The gods universally rain boundless kinds, All for the sake of honoring the World-honored One.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　而諦觀察於四方，　　離垢照明天帝釋；",
        "translation": "He observes the four directions with certainty: Undefiled Illumination is Indra, ruler of gods.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　合掌一心向於佛，　　皆欲勸請於世尊。",
        "translation": "They joined their palms and faced the Buddha with one mind, wanting to encourage and invoke the Bhagavān.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　我今欲見此大眾，　　摩尼寶珠出光明；",
        "translation": "I now want to see this great assembly, the jeweled pearl emitting its light.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　一切福田最廣大，　　悉見光明而普照。",
        "translation": "The field of all virtues is most vast, All seen and illumined by light.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　世尊神通光明照，　　今為誰故而顯現？",
        "translation": "Bhagavān, for whose sake is the Bhagavān illuminated by the light of his supernormal powers shown here?",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　諸來大眾最勇猛？　　地藏至此真佛子。",
        "translation": "Among the most courageous of all the great assemblies, this is really the Buddha-child Kṣitigarbha.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　伏藏七寶滿足施，　　佛藏珍寶是無畏；",
        "translation": "The Buddha’s treasury of jewels is fearlessness.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　種子即是大菩薩，　　一切眾生之商主。",
        "translation": "The seeds are the great bodhisattva, Who is the merchant lord of all sentient beings.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　此主能生佛法寶，　　大功德海而精進；",
        "translation": "This lord is able to produce the jewel of the Buddha’s teaching. With great oceans of virtues he exerts himself energetically.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　大悲體性甚聰哲，　　能救一切眾生苦。",
        "translation": "The essence of great compassion is very clever and wise, able to save all sentient beings from suffering.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　亦能救度諸怖畏。　　譬如明月示正道，",
        "translation": "It is like the moon in the morning, which shows the right path.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　能生善根如大地，　　亦如金剛摧諸結，",
        "translation": "The roots of goodness that can arise are like the earth, Like diamond destroying all fetters.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　為大施主解脫寶，　　漂諸煩惱如大水；",
        "translation": "They become great benefactors, jewels of liberation, Floating the afflictions like a great river.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　如蓋普覆煩惱熱，　　亦如良醫除眾病，",
        "translation": "Like a canopy covering the fever of afflictions, And like a skilled physician curing all illnesses.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　於一食頃讚地藏，　　過諸菩薩百億劫。",
        "translation": "In a single meal, they praised the earth treasure more than ten billion eons past the enlightening beings.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　如諸智者無量德，　　是故地藏大名稱，",
        "translation": "Just as the wise have immeasurable virtues, That’s why the earth-store is so greatly renowned.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　煩惱繫縛諸眾生，　　皆令遠離得解脫；",
        "translation": "Sentient beings bound by afflictions They cause to be far removed And attain liberation.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　得首楞嚴大三昧，　　能度諸禪至彼岸。",
        "translation": "Attaining the great śūraṃgama-samādhi, he can cross over to the other shore of meditation.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　十二因緣悉清淨，　　其智廣大如虛空；",
        "translation": "The twelve causes and conditions are all pure, Their knowledge as vast as space.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　無量佛國諸眾生，　　皆悉能滅黑闇聚。",
        "translation": "The sentient beings of infinite buddha-lands Will all be able to extinguish the mass of darkness.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　而於一切四禪中，　　遍觀佛國修諸行；",
        "translation": "In all four meditations They contemplate the buddha-lands everywhere And cultivate various practices.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　能令眾生入三昧，　　皆悉得離煩惱熱。",
        "translation": "They can cause sentient beings to enter concentration, All attaining freedom from the fever of afflictions.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　眾生過去惡業故，　　常處刀、兵、疾疫劫；",
        "translation": "Sentient beings, because of their evil deeds in the past, Were always subject to swords, armies, and epidemics.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　於此世間受苦惱，　　彼善男子能救脫。",
        "translation": "In this world, they experience suffering and distress, but those good men can rescue them.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　一切六道諸眾生，　　常為苦惱之所逼；",
        "translation": "All sentient beings in the six realms of rebirth Are constantly oppressed by suffering and distress.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　當悉歸命於地藏，　　當令苦惱悉消滅。",
        "translation": "They should all return to the earth treasure and cause suffering and distress to completely cease.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　眾生輪轉沒諸苦，　　互相殘賊起鬪諍；",
        "translation": "Sentient beings transmigrate without suffering; They harm each other and fight among thieves.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　若能歸命地藏者，　　令彼鬪諍皆悉忍。",
        "translation": "If someone can give their lives to the store of earth, they'll cause them to tolerate all their quarrels.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　趣於三惡甚可畏，　　所求不得常苦惱；",
        "translation": "The course of the three evils is terrifying; What they seek cannot be obtained, always painful.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　亦當歸命於地藏，　　一切皆得除怖畏。",
        "translation": "You should also pay homage to the earth treasure, and all will be freed from fear.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　若修持戒及念定，　　欲得多聞智慧者；",
        "translation": "If someone cultivates precepts and mindfulness of concentration And wants to acquire much learning and wisdom,",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　皆當歸命於地藏，　　隨心所願悉滿足。",
        "translation": "They should all take refuge in the earth treasure, Fulfilling their wishes according to their hearts.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　欲得如是諸功德，　　及以工巧善種子；",
        "translation": "They want to attain such virtues And skillfully plant good seeds.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　皆當歸命於地藏，　　令彼所願悉滿足。",
        "translation": "They should all return to the earth treasure and cause their wishes to be fulfilled.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　一切藥、穀諸福田，　　乃至欲求男、女等；",
        "translation": "All the medicines, grains, fields of blessings, And even desires for men and women.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　皆當歸命於地藏，　　令彼所願悉滿足。",
        "translation": "They should all return to the earth treasure and cause their wishes to be fulfilled.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　若欲修行諸功德，　　一切所有依大地；",
        "translation": "If you want to practice virtue, You should cultivate all the qualities That are found in all the foundations of enlightenment.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　藥、穀滋茂而潤澤，　　亦因地藏得增長。",
        "translation": "Herbs and grains flourish and are moistened, and it's also because of the earth store that they grow.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　結業煩惱所覆障，　　造作十惡諸不善；",
        "translation": "They are hindered by the bonds of action and afflictions, Producing the ten bad and unwholesome actions.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　皆當歸命於地藏，　　悉除結使重惡罪。",
        "translation": "They should all return to the earth treasure and completely remove the bonds that cause serious bad sins.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　能以正法示眾生，　　作種種形隨應說；",
        "translation": "They can show sentient beings the right teaching, Producing various forms according to their needs.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　具修布施諸功德，　　欲救眾生起大悲。",
        "translation": "Cultivating the virtues of generosity, they want to save sentient beings and arouse great compassion.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　假使滿足於百劫，　　不可分別其功德；",
        "translation": "Even if they fulfill a hundred eons, They cannot discriminate their virtues.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "　是名功德之大藏，　　一切皆當供養之。」",
        "translation": "This is called the great store of merit, and all of them should be offered to it.",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "爾時，世尊欲重宣此義，而說偈言：佛說大方廣十輪經發問本業斷結品第三爾時，",
        "translation": "At that time the World-honored One, wanting to elaborate on the meaning of this further, spoke these verses:",
        "source": "T13n0410_002:0686b19_2"
    },
    {
        "source_sentence": "地藏菩薩摩訶薩，從座而起整其衣服，長跪叉手右膝著地，合掌向佛白言：「世尊！",
        "translation": "The Earth-Store Bodhisattva Mahāsattva rose from his seat, adjusted his robes, knelt down long enough to place his right knee on the ground, joined his palms and said to the Buddha, Bhagavān!",
        "source": "T13n0410_002:0687a12_3"
    },
    {
        "source_sentence": "如我今者欲發少問，唯願聽許，時為解說。」",
        "translation": "Just as I now want to ask a few questions, I simply wish to hear them and explain them for you at the right time.",
        "source": "T13n0410_002:0687a14_0"
    },
    {
        "source_sentence": "佛言：「汝是真善丈夫，為欲顯示一切眾生無礙智慧，亦令他人作大丈夫；",
        "translation": "The Buddha said: You are truly a good man. In order to show the unhindered wisdom of all sentient beings you also cause others to become great men.",
        "source": "T13n0410_002:0687a15_0"
    },
    {
        "source_sentence": "若有所問隨汝意答，勿生疑難。",
        "translation": "If you have questions, answer them as you wish, and don't give rise to doubt or difficulty.",
        "source": "T13n0410_002:0687a16_1"
    },
    {
        "source_sentence": "如來今日當為解說，令汝歡喜。」",
        "translation": "Today, the Tathāgata will explain it for you and make you rejoice.",
        "source": "T13n0410_002:0687a17_2"
    },
    {
        "source_sentence": "「曾於十三劫，　　修行佛福田；",
        "translation": "“For thirteen eons I cultivated the practice of enlightenment as a field of blessings.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　飢饉與疾疫，　　悉為眾生滅。",
        "translation": "Hungryness, famine, and pestilence all cease for sentient beings.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　為億諸佛等，　　造不思議供；",
        "translation": "They make inconceivable offerings for the sake of billions of buddhas.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　今見大會集，　　清淨眾俱來。",
        "translation": "Now we see the great assembly, All pure and genuine, coming together.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　聰哲勤精進，　　皆來至此會；",
        "translation": "All the wise and diligent people Have come to this assembly.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　一時而雲集，　　無有諸濁惡。",
        "translation": "When the clouds gather at once, there's no turbidity or evil.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　濁世多譏嫌，　　作惡損淨行；",
        "translation": "The polluted world often criticizes and disparages them, Doing evil to harm the pure.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　云何不善識，　　擾亂毀威儀，",
        "translation": "How can they not be well informed, Disturbing and disfiguring their manner?",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　皆與惡逆俱，　　誹謗於正法；",
        "translation": "They are all accompanied by evil and hostility, denigrating the true teaching.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　毀訾諸賢聖，　　妄著於斷常。",
        "translation": "They disparage the wise and saintly, And deludedly cling to nihilism and eternalism.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　造作十惡業，　　不畏後世苦；",
        "translation": "They commit the ten evil deeds And are not afraid of suffering in the afterlife.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　破壞三乘法，　　諂曲趣惡道。",
        "translation": "Disrupting the teachings of the three vehicles, they flatter and lead to bad destinies.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　無明蔽其目，　　貪嫉多姦偽；",
        "translation": "Their eyes are blinded by ignorance, And their cravings and jealousy are full of hypocrisy.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　云何轉法輪，　　解脫諸諂曲？",
        "translation": "How does he turn the wheel of the Dharma and liberate himself from flattery?",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　煩惱金剛俱，　　云何得斷離？",
        "translation": "How can the afflictions that are accompanied by the adamantine and how can they be abandoned?",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　云何為總持？　　忍辱能柔和。",
        "translation": "What is the dhāraṇī?",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　此集未曾有，　　令我值世將；",
        "translation": "This assembly is unprecedented, Causing me to meet the generals of the world.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　諸處未曾見，　　如是之大眾。",
        "translation": "Never have I seen such a great multitude in any place.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　具足頭陀行，　　久修菩提道；",
        "translation": "They are endowed with ascetic practices And have cultivated the path of enlightenment for a long time.",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "　云何於此處，　　成佛轉法輪？」",
        "translation": "How did you become a buddha here and turn the wheel of the Dharma?",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "爾時，地藏菩薩以偈問曰：爾時，佛告地藏菩薩：「善哉，善哉！",
        "translation": "At that point, Kṣitigarbha Bodhisattva asked in verse, At that point, the Buddha addressed Kṣitigarbha Bodhisattva, Good, good!",
        "source": "T13n0410_002:0687a18_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0687b10_4"
    },
    {
        "source_sentence": "汝於過去恒河沙佛所已問此義。",
        "translation": "You've already asked about this meaning at the place where the Buddha of the Ganges River was in the past.",
        "source": "T13n0410_002:0687b10_5"
    },
    {
        "source_sentence": "如是之法汝亦曾聞，具智慧行功德滿足，以方便力渡於彼岸。",
        "translation": "You have also heard such a teaching, and you are endowed with the virtue of wisdom and conduct. By the power of skillful means you cross over to the other shore.",
        "source": "T13n0410_002:0687b11_6"
    },
    {
        "source_sentence": "汝為成就諸餘眾生安樂利益故，亦欲令一切菩薩摩訶薩眾滿足一切方便伏藏，",
        "translation": "“Furthermore, in order to develop the well-being and benefit of all sentient beings, you also want to cause all enlightening beings to fulfill all their stores of skillful means.",
        "source": "T13n0410_002:0687b13_7"
    },
    {
        "source_sentence": "為具六波羅蜜，欲滿一切智海；",
        "translation": "In order to fulfill the six transcendent ways, they want to fill the ocean of omniscience.",
        "source": "T13n0410_002:0687b15_8"
    },
    {
        "source_sentence": "為迴諸帝王使不墮惡道，欲令十方世界三寶熾盛正法久住，以是義故問於如來。",
        "translation": "In order to turn back the emperors and kings so they won't fall into bad destinies, wanting to cause the three treasures in the worlds of the ten directions to blaze with the right teaching to abide for a long time, he asks the Tathāgata because of this meaning.",
        "source": "T13n0410_002:0687b16_9"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0687b18_10"
    },
    {
        "source_sentence": "汝今諦聽，諦聽！",
        "translation": "Listen attentively!",
        "source": "T13n0410_002:0687b18_11"
    },
    {
        "source_sentence": "當為汝說。」",
        "translation": "I will explain it for you.",
        "source": "T13n0410_002:0687b18_12"
    },
    {
        "source_sentence": "地藏菩薩白佛言：「唯然，世尊！",
        "translation": "The Earth-Store Bodhisattva said to the Buddha, Yes, Bhagavān!",
        "source": "T13n0410_002:0687b18_13"
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "I'd like to hear it.",
        "source": "T13n0410_002:0687b19_14"
    },
    {
        "source_sentence": "佛言：「此是如來過去本誓願力成就十輪，如此國土有五濁惡世，一切淨法皆悉損減。",
        "translation": "The Buddha said, These are the ten wheels accomplished by the power of the Tathāgata's past vows, such as when there were five turbid bad worlds in his land and all the pure dharmas were completely diminished.",
        "source": "T13n0410_002:0687b19_15"
    },
    {
        "source_sentence": "離聖七財遠諸智人，為斷常網之所覆障。",
        "translation": "They're free of the noble seven possessions and far removed from wise people, and they're cut off from the eternal web of obstruction.",
        "source": "T13n0410_002:0687b21_16"
    },
    {
        "source_sentence": "載惡道車不畏後世，常處無明黑闇之中。",
        "translation": "Carrying the chariot of evil destinies, they won't fear future lives, and they'll always be in the darkness of ignorance.",
        "source": "T13n0410_002:0687b22_17"
    },
    {
        "source_sentence": "具行十惡能造五逆，誹謗正法毀訾賢聖，遠離一切諸善功德成就惡法。",
        "translation": "Being endowed with the ten bad qualities, they can commit five heinous acts, denigrate the right teaching and disparage the noble ones, part with all good qualities, and achieve bad qualities.",
        "source": "T13n0410_002:0687b23_18"
    },
    {
        "source_sentence": "能於如是多惡世界，悉令安隱得無所畏，成就先聖最勝之法，能轉法輪制諸怨敵，",
        "translation": "They can cause all to be peaceful and attain fearlessness in such many evil worlds, perfect the supreme qualities of former sages, turn the wheel of the Teaching, and conquer enemies.",
        "source": "T13n0410_002:0687b25_19"
    },
    {
        "source_sentence": "皆悉降伏摧滅煩惱猶如金剛，令諸眾生安住三乘阿鞞跋致地。",
        "translation": "They all completely subdue and destroy afflictions like adamantine, causing sentient beings to abide in the stage of the three-vehicle abhidharma.",
        "source": "T13n0410_002:0687b27_20"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0687c01_0"
    },
    {
        "source_sentence": "譬如有人遠離功德，世界國土或自境內，而有軍起；",
        "translation": "Good man, it is analogous to someone who is far removed from virtue. An army may appear in his own world or within his own territory.",
        "source": "T13n0410_002:0687c01_1"
    },
    {
        "source_sentence": "或為隣國外來強兵之所踐害；",
        "translation": "Or they may be attacked by strong armies from neighboring countries.",
        "source": "T13n0410_002:0687c02_2"
    },
    {
        "source_sentence": "憂愁惱亂種種鬪諍，及諸諂偽欺誑妄語有種種病；",
        "translation": "Depressed and distressed, various kinds of quarrels and hypocritical deceit and false speech have various diseases.",
        "source": "T13n0410_002:0687c03_3"
    },
    {
        "source_sentence": "愚闇所蔽目視不了，為童子鬼魍魅所持；",
        "translation": "They are blinded by the darkness of ignorance, unable to see with their eyes; they are led by the spirits and demons of youth.",
        "source": "T13n0410_002:0687c04_4"
    },
    {
        "source_sentence": "阿鉢摩羅之所惑著，身體乾枯狂亂失心；",
        "translation": "Being deluded and attached by the abhidharma, his body withered and his mind was in distress.",
        "source": "T13n0410_002:0687c05_5"
    },
    {
        "source_sentence": "諸根醜陋手足不具，常乏財產無有福祿，不為一切之所憙樂；",
        "translation": "Their faculties are ugly, and their hands and feet are not provided for them. They always lack property and have no blessed wealth. They are not delighted by anyone.",
        "source": "T13n0410_002:0687c06_6"
    },
    {
        "source_sentence": "多歸異道起諸邪見，心意顛倒趣三惡道。",
        "translation": "They often take refuge in heretical paths and give rise to wrong views, and their minds are mistakenly headed for the three bad destinies.",
        "source": "T13n0410_002:0687c07_7"
    },
    {
        "source_sentence": "如是國土多諸耆舊，以為輔相臣佐吏民，爵祿有序而與同好不相侵害。",
        "translation": "Thus, there are many senior citizens in the land who serve as assistants, ministers, and officials, and their grades and salaries are ordered so that they don't attack each other with equal goodness.",
        "source": "T13n0410_002:0687c08_8"
    },
    {
        "source_sentence": "如是建國，則有無量種種明制調伏人民，施、戒、慈、忍威儀具足，難行苦行一切備滿；",
        "translation": "When a country is founded in this way, there will be an infinite variety of various ways to discipline and tame the people. They will be endowed with generosity, morality, kindness, patience, and deportment, and they will be fully equipped with all difficult and painful practices.",
        "source": "T13n0410_002:0687c10_9"
    },
    {
        "source_sentence": "以如是福德因緣，眾生諸根皆悉具足，身體長大威德熾盛相好端嚴，常為一切尊重恭敬，",
        "translation": "Because of such causes and conditions of virtue, sentient beings are fully endowed with all their faculties. Their bodies grow in stature, preeminent, powerful, blazing, beautiful, and dignified; they are always honored and revered by everyone.",
        "source": "T13n0410_002:0687c12_10"
    },
    {
        "source_sentence": "皆共親友仁性寬慈聰敏多智。",
        "translation": "They all share the same friend, friend, kindness, generosity, kindness, intelligence, and wisdom.",
        "source": "T13n0410_002:0687c14_11"
    },
    {
        "source_sentence": "若有尊重及諸王子備此德者，以諸香湯，調和冷暖以用洗浴，著鮮淨衣其光如寶。",
        "translation": "If there are honored ones and princes who possess this virtue, they'll wash themselves with scented bathing water, mix it with warmth and coldness, put on fresh and pure clothing that shines like treasure.",
        "source": "T13n0410_002:0687c15_12"
    },
    {
        "source_sentence": "頂上復有如是寶珠真金華鬘，手繫素繒種種華鬘、金、銀、真珠以為璫環，",
        "translation": "On the crown of his head was a jewel like this, made of gold and silver ornaments. His hands joined together to form a circle of silk, decorated with various kinds of flower garlands, golden, silver, and genuine pearls.",
        "source": "T13n0410_002:0687c17_13"
    },
    {
        "source_sentence": "雜寶珠網而作臂指，種種環玔如是等寶莊嚴其身。",
        "translation": "He made a web of mixed jewels to make his arm and fingers, various rings and ornaments such as these adorned his body.",
        "source": "T13n0410_002:0687c19_14"
    },
    {
        "source_sentence": "先所奉事天及諸仙一切帝釋，悉皆聽許敷置高座；",
        "translation": "All the gods and all the Indras who had previously served them, as well as all the sages and emperors, were permitted to set up high seats.",
        "source": "T13n0410_002:0687c20_15"
    },
    {
        "source_sentence": "如前父王登尊位時。",
        "translation": "It's like the time when his father, the king, ascended to the throne.",
        "source": "T13n0410_002:0687c21_16"
    },
    {
        "source_sentence": "昇如是座紹王位已，一切龍王、天帝、阿修羅帝、鳩槃茶帝，是前父王所有鍾鼓，",
        "translation": "When he ascended the throne, all the dragon kings, celestial kings, asuras, and kumbhāṇḍavartins were the bells and drums of their former fathers.",
        "source": "T13n0410_002:0687c22_17"
    },
    {
        "source_sentence": "今受位時亦擊此鼓。",
        "translation": "Now, when he receives the throne, he also beats this drum.",
        "source": "T13n0410_002:0687c24_18"
    },
    {
        "source_sentence": "如是音聲遍滿城邑，一切剎利、婆羅門、毘舍、首陀，澡浴身體著鮮淨衣，",
        "translation": "All the kṣatriyas, brāhmaṇas, piśācīs, and śūdras bathed their bodies and put on fresh, clean clothes.",
        "source": "T13n0410_002:0687c24_19"
    },
    {
        "source_sentence": "種種諸寶，繒蓋、幢幡、金、銀、摩尼真珠、珊瑚、琉璃、珂貝，一切珍寶，",
        "translation": "It was made of various precious substances, such as silk canopies, banners, pennants, gold, silver, crystal, coral, lapis lazuli, and seashell jewels.",
        "source": "T13n0410_002:0687c26_20"
    },
    {
        "source_sentence": "以新王立，見有如是吉祥等相故種種獻奉。",
        "translation": "Because the new king established it, he saw that such auspicious and other characteristics were offered in various ways.",
        "source": "T13n0410_002:0687c27_21"
    },
    {
        "source_sentence": "「爾時，新王紹灌頂位，先王所置宿舊先臣，隨其所能各為職司。",
        "translation": "At the time, the new king assumed the position of consecration, and the old and former ministers whom the late king had appointed were each made officials according to their abilities.",
        "source": "T13n0410_002:0687c28_22"
    },
    {
        "source_sentence": "若己國內自有軍興，及以隣國起諸兵眾，隨有怨敵悉皆殄滅，守護己國無諸毀損，",
        "translation": "If he has an army in his own country, or if he raises an army in a neighboring country, they'll be annihilated by whatever enemies there are, guarding his country without harming it.",
        "source": "T13n0410_002:0688a01_23"
    },
    {
        "source_sentence": "善增眷屬更相親友。",
        "translation": "He well increases his retinue, furthering his friends and relatives.",
        "source": "T13n0410_002:0688a03_24"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0688a04_0"
    },
    {
        "source_sentence": "若能如是，名為初輪灌頂王位。",
        "translation": "If someone can do so, they're called the first wheel-turning king of consecration.",
        "source": "T13n0410_002:0688a04_1"
    },
    {
        "source_sentence": "於其國土得安樂住初伏怨敵，壽命長遠守護身命。",
        "translation": "In that land, they'll attain peaceful abiding and first subdue enemies, have a long life span, and guard their bodies and lives.",
        "source": "T13n0410_002:0688a04_2"
    },
    {
        "source_sentence": "如是，如是！",
        "translation": "So it is, so it is!",
        "source": "T13n0410_002:0688a06_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0688a06_4"
    },
    {
        "source_sentence": "若人處於五濁諸惡世界，遠離於佛，是故此中一切眾生，心多瞋恚更相侵逼，",
        "translation": "If someone were to live in the five turbid and evil worlds, they would be far removed from the buddhas. That is why all sentient beings here would become angry and oppress each other.",
        "source": "T13n0410_002:0688a06_5"
    },
    {
        "source_sentence": "一切人民皆悉愁惱。",
        "translation": "All the people were grieved.",
        "source": "T13n0410_002:0688a08_6"
    },
    {
        "source_sentence": "愚闇癡冥起於斷、常，種種鬪訟、貪嫉、諂偽，作諸欺誑悉具十惡，取著眾生惱亂人民，",
        "translation": "The darkness of ignorance and delusion arise in the realms of cessation and permanence. They engage in various disputes, greed, jealousy, hypocrisy, deceitfulness, flattery, dishonesty, false speech, all committing the ten kinds of evil, clinging to sentient beings and disturbing the people.",
        "source": "T13n0410_002:0688a08_7"
    },
    {
        "source_sentence": "種種煩惱及諸過患，是故遠離甚深法眼，為瞋恚病之所擾害。",
        "translation": "Because of various afflictions and faults, they're far removed from the profound eye of the Dharma and are harmed by the disease of anger.",
        "source": "T13n0410_002:0688a10_8"
    },
    {
        "source_sentence": "心常遠離棄捨真實一切法味，意想散亂譏訶善法樂所愛味，常為煩惱及諸邪見惑網所覆。",
        "translation": "Their minds are always far removed from the true taste of all the flavors of the Dharma, their thoughts scatter and disparage the flavor beloved by the happiness of good qualities, and they're always tethered by the web of afflictions and mistaken views.",
        "source": "T13n0410_002:0688a12_9"
    },
    {
        "source_sentence": "歸依六師傷敗聖道趣向三惡。",
        "translation": "They take refuge in the six masters who harm and defeat the noble path and head toward the three bad destinies.",
        "source": "T13n0410_002:0688a14_10"
    },
    {
        "source_sentence": "有諸菩薩摩訶薩，已曾親近、供養過去無量諸佛，能度一切智慧大海，",
        "translation": "“There are enlightening beings who have served and honored innumerable buddhas of the past, able to cross the ocean of all knowledge.",
        "source": "T13n0410_002:0688a15_11"
    },
    {
        "source_sentence": "安住諸佛所行之道，皆悉集會到於我所。",
        "translation": "Abiding in the path practiced by the buddhas, they all gathered together and came to me.",
        "source": "T13n0410_002:0688a17_0"
    },
    {
        "source_sentence": "汝以修集種種布施，善能調伏成就苦行遠離諸惡，久修諸佛難行苦行。",
        "translation": "Because you cultivate various kinds of generosity, you're well able to tame and accomplish ascetic practices that are painful, part with badness, and have long cultivated the difficult ascetic practices of the buddhas.",
        "source": "T13n0410_002:0688a18_0"
    },
    {
        "source_sentence": "常念智慧、方便、福德、大慈、大悲莊嚴瓔珞廣大伏藏，一切禪定、總持、忍辱，",
        "translation": "He was always mindful of the great store of wisdom, skill in means, virtue, great benevolence, great compassion, great compassion, adornment, and great compassion, all meditations, concentrations, general maintenances, and tolerances.",
        "source": "T13n0410_002:0688a19_1"
    },
    {
        "source_sentence": "諸地大海皆已具足，不生諂誑幻偽之心。",
        "translation": "The earth and the great ocean are all fully endowed, and they don't give rise to flattering, illusory, or hypocritical thoughts.",
        "source": "T13n0410_002:0688a21_2"
    },
    {
        "source_sentence": "身相柔和滿足忍辱，而常善順以自莊嚴，皆悉近於一切智海。",
        "translation": "Their bodies and features are gentle and peaceful, they have patience and humility, yet always well-compounded with self-adornment, all approaching the ocean of omniscience.",
        "source": "T13n0410_002:0688a22_3"
    },
    {
        "source_sentence": "其色盛妙光明具足，能為一切聲聞、辟支佛作大導師；",
        "translation": "Their color was abundant and replete with subtle light, enabling them to become great leaders for all śrāvakas and pratyekabuddhas.",
        "source": "T13n0410_002:0688a23_4"
    },
    {
        "source_sentence": "亦與一切生死怖畏眾生為作安慰。",
        "translation": "It's also a comfort for all the sentient beings who fear birth and death.",
        "source": "T13n0410_002:0688a25_5"
    },
    {
        "source_sentence": "即是拘樓孫佛、拘那含牟尼佛、迦葉佛如是等如來之子，於賢劫中最為上首。",
        "translation": "That is, he's the son of Krakucchanda Buddha, Kanakamuni Buddha, Kanakamuni Buddha, Kāśyapa Buddha, and so forth, the most eminent among the buddhas in the good eon.",
        "source": "T13n0410_002:0688a25_6"
    },
    {
        "source_sentence": "以禪定智水而自洗浴，著慚愧衣，是最勝大仙所行之處；",
        "translation": "To wash and bathe oneself with the water of meditation, wisdom, and shamelessness is the most distinguished place where great sages practice.",
        "source": "T13n0410_002:0688a27_7"
    },
    {
        "source_sentence": "亦是解脫功德華鬘；",
        "translation": "It is also a flower garland of the virtues of liberation.",
        "source": "T13n0410_002:0688a29_8"
    },
    {
        "source_sentence": "亦名一切種智無生真實而自莊嚴；",
        "translation": "It is also called self-adorned by the reality of omniscience as nonorigination.",
        "source": "T13n0410_002:0688a29_9"
    },
    {
        "source_sentence": "是三善行能為三界作密雲蓋已，於過去一切佛土善得安住，處於金剛三昧之座。",
        "translation": "After these three good practices can create a mysterious cloud cover for the three realms, they'll be well settled in all the buddha-lands of the past and sit on the vajra samādhi throne.",
        "source": "T13n0410_002:0688b01_10"
    },
    {
        "source_sentence": "亦於過去聲聞、辟支佛所，安置尊座四念處座；",
        "translation": "Also in the presence of the Buddhas of the past they placed the seats of enlightenment on the four seats of mindfulness at the sites of concentration.",
        "source": "T13n0410_002:0688b03_11"
    },
    {
        "source_sentence": "亦是先佛所安置座。",
        "translation": "It's also the seat that was previously placed by the Buddha.",
        "source": "T13n0410_002:0688b04_12"
    },
    {
        "source_sentence": "於一切智渚住於菩提，能轉法輪紹三寶種令使不絕，擊於法鼓出大音聲遍滿三界。",
        "translation": "In the island of omniscience, he abides in enlightenment, turns the wheel of the Dharma and creates the seeds of the three treasures so that they don't stop, strikes the Dharma drum and produces a great sound that fills the three realms.",
        "source": "T13n0410_002:0688b05_0"
    },
    {
        "source_sentence": "以此法輪聲使諸天人、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，",
        "translation": "Because of this sound of the wheel of the Dharma, gods, humans, asuras, garuḍas, kiṃnaras, mahoragas, humans, nonhumans, and so forth.",
        "source": "T13n0410_002:0688b07_1"
    },
    {
        "source_sentence": "鳩槃茶、富單那、迦吒富單那、餓鬼、毘舍闍，皆以四聖諦寂滅之相而自莊嚴。",
        "translation": "The kumbhāṇḍas, pūtanas, kaṭapātanas, hungry ghosts, and piśācīs all adorn themselves with the characteristics of the tranquility of the four noble truths.",
        "source": "T13n0410_002:0688b08_2"
    },
    {
        "source_sentence": "三轉十二行法輪，昔所未轉如今轉之，一切沙門婆羅門，若天、若魔、若梵皆不能轉，",
        "translation": "All the śramaṇas and brāhmaṇas, whether gods, Māras, Brahmās, or Brahmās, cannot turn the wheel of the Dharma consisting of these teachings.",
        "source": "T13n0410_002:0688b10_3"
    },
    {
        "source_sentence": "為欲利益安樂一切諸天人故。",
        "translation": "It's because they want to bring benefit and comfort to all gods and humans.",
        "source": "T13n0410_002:0688b12_4"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0688b14_0"
    },
    {
        "source_sentence": "是名轉於初輪。",
        "translation": "This is called turning the first wheel.",
        "source": "T13n0410_002:0688b14_1"
    },
    {
        "source_sentence": "若今世、後世是處、非處如實而知，到於安隱無畏之處，一切怨敵自然降伏。",
        "translation": "If they truly know what's right and wrong in the present and future lives, they'll reach a place of peace and fearlessness where all enemies will naturally be subdued.",
        "source": "T13n0410_002:0688b14_2"
    },
    {
        "source_sentence": "如實而知能轉梵輪，處處現於五濁惡世。",
        "translation": "Knowing it as it really is, they can turn the Brahma wheel and appear everywhere in the five turbid and bad worlds.",
        "source": "T13n0410_002:0688b16_3"
    },
    {
        "source_sentence": "諸弟子等正師子吼，若作五逆罪業眾生成就十惡，如是人等碎諸煩惱猶如金剛，",
        "translation": "If the disciples and so forth correctly roar the lion's roar, and if they commit the five heinous crimes, sentient beings accomplish the ten evils, such people and so forth will break down the afflictions like a vajra.",
        "source": "T13n0410_002:0688b17_4"
    },
    {
        "source_sentence": "斷諸有漏令得解脫，隨其所欲安置三乘住不退地。",
        "translation": "He stops the contaminants so that they attain liberation and places the three vehicles in the stage of nonretrogression according to their desires.",
        "source": "T13n0410_002:0688b19_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0688b21_0"
    },
    {
        "source_sentence": "譬如有人初登王位，受灌頂已，觀察去、來三世若干等種無量王事；",
        "translation": "“Good man, this is analogous to someone who, having ascended the throne for the first time and received his coronation, observes the various kingly affairs of past, present, and future innumerable times.",
        "source": "T13n0410_002:0688b21_1"
    },
    {
        "source_sentence": "而以智慧觀察業因一切果報，隨其性相而置爵位。",
        "translation": "Instead, he observes the causes and consequences of all actions with wisdom and establishes a title according to their characteristics.",
        "source": "T13n0410_002:0688b22_2"
    },
    {
        "source_sentence": "以此三業故，令其國土增長安樂，隣國怨敵悉皆摧伏。",
        "translation": "Because of these three actions, their land grows more peaceful and prosperous, and neighboring countries and enemies are all destroyed.",
        "source": "T13n0410_002:0688b24_0"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T13n0410_002:0688b25_1"
    },
    {
        "source_sentence": "如灌頂王剎利，為護命故防備怨敵與他戰鬪，經營王宮及諸國土一切奉祿人民產業；",
        "translation": "It is like the case of the kṣatriya king Concentration King who, in order to protect his life, defends himself from enemies and fights with others.",
        "source": "T13n0410_002:0688b25_2"
    },
    {
        "source_sentence": "是名灌頂大王成就第二輪。",
        "translation": "This is called the second wheel of the accomplishment of the consecration of the great king.",
        "source": "T13n0410_002:0688b27_3"
    },
    {
        "source_sentence": "隣國怨敵不能侵害，守護身命長壽安樂。",
        "translation": "Unable to be attacked by enemies in neighboring countries, they guard their bodies, lives, long life, and well-being.",
        "source": "T13n0410_002:0688b28_4"
    },
    {
        "source_sentence": "如是，善男子！",
        "translation": "So it is, good man!",
        "source": "T13n0410_002:0688b29_5"
    },
    {
        "source_sentence": "如來始成佛道得無上智，過去、未來、現在一切法眼，亦如三世諸佛所得法眼。",
        "translation": "When the Tathāgata first became a buddha and attained unsurpassed knowledge, he had the eye for all dharmas in the past, future, and present, just like the Dharma eye that the buddhas of the three times had attained.",
        "source": "T13n0410_002:0688b29_6"
    },
    {
        "source_sentence": "故修行正法，為欲觀察一切業報差別之相，具深法眼分別業因，能令善根一切熾盛長夜安隱；",
        "translation": "They therefore practice the right teaching, wanting to observe the distinctive characteristics of the results of all actions. Endowed with the profound eye of truth and discriminating causes of action, they can cause all roots of goodness to flourish and remain peaceful for a long time.",
        "source": "T13n0410_002:0688c02_7"
    },
    {
        "source_sentence": "悉使眾生成就種種無量之樂；",
        "translation": "They all cause sentient beings to develop various immeasurable pleasures.",
        "source": "T13n0410_002:0688c04_8"
    },
    {
        "source_sentence": "能使一切外道怨敵自然降伏。",
        "translation": "They can cause all the enemies of non-Buddhists to naturally subdue them.",
        "source": "T13n0410_002:0688c05_9"
    },
    {
        "source_sentence": "「何等為三業？",
        "translation": "“What are the three kinds of action?",
        "source": "T13n0410_002:0688c07_0"
    },
    {
        "source_sentence": "坐禪、誦經、營理僧事。",
        "translation": "He sat in meditation, recited scriptures, and attended to the affairs of the saṃgha.",
        "source": "T13n0410_002:0688c07_1"
    },
    {
        "source_sentence": "云何為禪？",
        "translation": "What is meditation?",
        "source": "T13n0410_002:0688c07_2"
    },
    {
        "source_sentence": "禪有十種。",
        "translation": "There are ten kinds of meditation.",
        "source": "T13n0410_002:0688c08_3"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T13n0410_002:0688c08_4"
    },
    {
        "source_sentence": "第一知身；",
        "translation": "The first is the body of knowledge.",
        "source": "T13n0410_002:0688c08_5"
    },
    {
        "source_sentence": "知身六入；",
        "translation": "He knows the six bodily sense-fields.",
        "source": "T13n0410_002:0688c08_6"
    },
    {
        "source_sentence": "知我、我所；",
        "translation": "They know self and what belongs to self.",
        "source": "T13n0410_002:0688c09_7"
    },
    {
        "source_sentence": "知業因為因自在受生；",
        "translation": "They know the causes of action and are freely subject to rebirth as causes.",
        "source": "T13n0410_002:0688c09_8"
    },
    {
        "source_sentence": "知種種愛無明黑闇；",
        "translation": "They know all kinds of craving, ignorance, darkness, and darkness.",
        "source": "T13n0410_002:0688c10_0"
    },
    {
        "source_sentence": "知所親愛無有真實，屬眾因緣欲苦相續流注不絕，為滅此等令悉除斷。",
        "translation": "Knowing that their cravings are unreal, they belong to all kinds of causes and conditions. Desire and suffering continue unaceasingly in an unbroken stream for the sake of extinguishing them so as to get rid of them completely.",
        "source": "T13n0410_002:0688c10_1"
    },
    {
        "source_sentence": "「云何為業流？",
        "translation": "“What is the stream of karma?",
        "source": "T13n0410_002:0688c13_0"
    },
    {
        "source_sentence": "觀察一切三種業行，是名業流。",
        "translation": "Observing all three kinds of karmic actions is called the stream of karma.",
        "source": "T13n0410_002:0688c13_1"
    },
    {
        "source_sentence": "生死無際愛因緣有，是名煩惱流。",
        "translation": "The craving for birth and death without limit has causes and conditions, which are called the flow of affliction.",
        "source": "T13n0410_002:0688c14_2"
    },
    {
        "source_sentence": "煩惱因緣故，無明和合能生名色；",
        "translation": "Because of the causes and conditions of defilement, name and form are able to arise through the conjunction of ignorance.",
        "source": "T13n0410_002:0688c14_3"
    },
    {
        "source_sentence": "名色和合因緣故能生六入；",
        "translation": "Because of the conjunction of names and forms as causes and conditions, six sense-fields can arise:",
        "source": "T13n0410_002:0688c15_4"
    },
    {
        "source_sentence": "六入因緣故能生觸；",
        "translation": "Because of the causes and conditions of the six sense-fields, contact can arise.",
        "source": "T13n0410_002:0688c16_5"
    },
    {
        "source_sentence": "觸因緣故能生受；",
        "translation": "Feeling is able to give rise to sensation because of the causes and conditions of touch.",
        "source": "T13n0410_002:0688c16_6"
    },
    {
        "source_sentence": "受因緣故能生後有；",
        "translation": "Because of the causes and conditions for feeling, later existences can arise.",
        "source": "T13n0410_002:0688c17_7"
    },
    {
        "source_sentence": "後有因緣故能生生；",
        "translation": "Subsequently, there are causes and conditions that give rise to birth.",
        "source": "T13n0410_002:0688c17_8"
    },
    {
        "source_sentence": "生因緣故能生老、病、死、苦；",
        "translation": "Because of the causes and conditions of birth, old age, sickness, death, and suffering can arise.",
        "source": "T13n0410_002:0688c18_9"
    },
    {
        "source_sentence": "是名苦流。",
        "translation": "This is called the stream of suffering.",
        "source": "T13n0410_002:0688c18_10"
    },
    {
        "source_sentence": "如是三流皆從愛生。",
        "translation": "These three streams all arise from craving.",
        "source": "T13n0410_002:0688c19_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0410_002:0688c19_12"
    },
    {
        "source_sentence": "因無明業，愛為水潤，為欲枯涸此三流故，樂觀無常名無常忍。",
        "translation": "Because of ignorance and karma, craving is moistened by water and dried up by desire, and because these three streams dry up, it's called the impermanent forbearance that delights in observing impermanence.",
        "source": "T13n0410_002:0688c19_13"
    },
    {
        "source_sentence": "能觀無常、苦、空、無我，信一切法愚癡無智；",
        "translation": "They can observe impermanence, suffering, emptiness, and selflessness; they believe all things are ignorant and without knowledge.",
        "source": "T13n0410_002:0688c21_14"
    },
    {
        "source_sentence": "如幻、如炎、如水中月、如夢，空、無相、無願；",
        "translation": "They are like illusions, like fire, like the moon in water, like dreams, empty, signless, and wishless.",
        "source": "T13n0410_002:0688c22_15"
    },
    {
        "source_sentence": "寂滅無生、空無諸相；",
        "translation": "Tranquil extinction has no arising, and space has no characteristics.",
        "source": "T13n0410_002:0688c23_16"
    },
    {
        "source_sentence": "常觀五陰空、無相、無願；",
        "translation": "They always observe the emptiness, signlessness, and wishlessness of the five aggregates.",
        "source": "T13n0410_002:0688c23_17"
    },
    {
        "source_sentence": "隨順忍樂觀察出息、入息，繫念安般增數、減數；",
        "translation": "They follow patience and bliss, observing exhalation and exhalation; they meditate on breathing in and breathing out, with increasing and decreasing mindfulness.",
        "source": "T13n0410_002:0688c24_18"
    },
    {
        "source_sentence": "觀住、觀滅、并觀住滅；",
        "translation": "He observed continuance, cessation and also observed continuance and cessation.",
        "source": "T13n0410_002:0688c25_19"
    },
    {
        "source_sentence": "還數有二種：意與覺觀俱滅；",
        "translation": "4.5.29 There are two kinds of calculation of the number of returns:",
        "source": "T13n0410_002:0688c25_20"
    },
    {
        "source_sentence": "於覺觀取出息、入息相；",
        "translation": "He perceives and observes the characteristics of exhalation and exhalation-entry.",
        "source": "T13n0410_002:0688c26_21"
    },
    {
        "source_sentence": "減數有二：依止有出能除覺觀，出息、入息取其相貌。",
        "translation": "There are two ways to subtract from the number: relying on the fact that there's an exhalation that removes perception and contemplation, and exhaling and inhaling take their appearance.",
        "source": "T13n0410_002:0688c27_22"
    },
    {
        "source_sentence": "觀住有二種：觀出、入息，見其滅想心能住定。",
        "translation": "There are two kinds of observing and abiding: observing exhalation and inhalation, observing that the cessation of perception and mind can abide in concentration.",
        "source": "T13n0410_002:0688c28_23"
    },
    {
        "source_sentence": "滅有二種：盡除諸結深淨於見，修出入息觀察五陰。",
        "translation": "There are two kinds of cessation: the extinguishing of fetters and the profound purification of views, which cultivates the five aggregates of observing inhalation and exhalation.",
        "source": "T13n0410_002:0688c29_24"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0410_002:0689a01_25"
    },
    {
        "source_sentence": "此出入息名色盛陰；",
        "translation": "These aggregates of exhalation and inhalation are called the material flourishing aggregate.",
        "source": "T13n0410_002:0689a02_26"
    },
    {
        "source_sentence": "亦名受、想、行、識等盛陰；",
        "translation": "They are also called the flourishing aggregates of feeling, perception, volition, and consciousness.",
        "source": "T13n0410_002:0689a02_27"
    },
    {
        "source_sentence": "是名五盛陰種種不相應相。",
        "translation": "These are called the various non-associated characteristics of the five flourishing aggregates.",
        "source": "T13n0410_002:0689a03_28"
    },
    {
        "source_sentence": "「復有五種：非新、非故、非有、非聚、非言，如是五種。",
        "translation": "Again, there are five kinds: not new, not old, not existing, not agglomerated, and not verbal.",
        "source": "T13n0410_002:0689a04_0"
    },
    {
        "source_sentence": "以此五陰觀三種業，以此三業觀究竟盡。",
        "translation": "These five aggregates are observed as three kinds of actions, and these three actions are observed as the ultimate end.",
        "source": "T13n0410_002:0689a05_1"
    },
    {
        "source_sentence": "復觀六處，有我、我所，有業，無明為田，愛為濕潤，究竟滅盡。",
        "translation": "Again, he observes that the self and what belongs to self exist in six sense-fields. There is karma with ignorance as its field, craving as its moisture, and ultimately cessation of craving.",
        "source": "T13n0410_002:0689a06_2"
    },
    {
        "source_sentence": "以是觀察，具四念處，修集滿足，四念處、四正勤、四如意足、五根、五力、七覺分、八聖道分，",
        "translation": "Because of these observations, he has the four abodes of mindfulness that are endowed with cultivation and accumulation, the four abodes of mindfulness, the fourfold correct effort, the four supernormal powers, the five faculties, the five powers, the seven factors of awakening, and the eightfold noble path.",
        "source": "T13n0410_002:0689a07_3"
    },
    {
        "source_sentence": "乃至能滿十八不共法，得無生忍及一切智，具足首楞嚴三昧。",
        "translation": "He's able to fulfill 18 distinctive qualities, attain the tolerance of nonarising and omniscience, and possess the śūraṃgama-samādhi.",
        "source": "T13n0410_002:0689a09_4"
    },
    {
        "source_sentence": "修出、入息安般三昧，滿足一切正法住處。",
        "translation": "He cultivates the samādhi of calming inhalation and exhalation, fulfilling all the abodes of the right teachings.",
        "source": "T13n0410_002:0689a11_5"
    },
    {
        "source_sentence": "若能如是修諸禪定，則是供養過去、未來一切諸佛，是名佛子，從佛口生、從正法生。",
        "translation": "If someone can thus cultivate meditation in this way, they're an offering to all the buddhas of the past and future. This is called a son of the Buddha who comes from the Buddha's mouth and comes from the right teaching.",
        "source": "T13n0410_002:0689a12_6"
    },
    {
        "source_sentence": "有能如此善修禪者，或是大士諸菩薩等；",
        "translation": "Someone who can skillfully practice meditation in this way is either a great person or a bodhisattva.",
        "source": "T13n0410_002:0689a14_7"
    },
    {
        "source_sentence": "或是漏盡辟支、羅漢如所修集；",
        "translation": "Or they may be collected as practised by the pratyekabuddhas and arhats who have extinguished their contaminants.",
        "source": "T13n0410_002:0689a15_8"
    },
    {
        "source_sentence": "是名菩薩摩訶薩，則能滿足十八不共法具一切智。",
        "translation": "This is called a bodhisattva-mahāsattva who can fulfill the 18 distinctive qualities and possess omniscience.",
        "source": "T13n0410_002:0689a15_9"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0689a18_0"
    },
    {
        "source_sentence": "是人不久當得阿耨多羅三藐三菩提，亦是三世如來世尊甚深法眼。",
        "translation": "That person will soon attain supreme perfect enlightenment, and they're also the profound Dharma eye of the Bhagavān, the Tathāgata of the three times.",
        "source": "T13n0410_002:0689a18_1"
    },
    {
        "source_sentence": "滿足業行觀察果報，安住眾生於十種禪定。",
        "translation": "Fulfilling the results of observing actions and practices, they settle sentient beings in ten kinds of meditation.",
        "source": "T13n0410_002:0689a19_2"
    },
    {
        "source_sentence": "如是，善男子！",
        "translation": "So it is, good man!",
        "source": "T13n0410_002:0689a20_3"
    },
    {
        "source_sentence": "則能轉於如來所轉禪定法輪。",
        "translation": "Then he'll be able to turn the Dharma wheel of meditation that the Tathāgata turns.",
        "source": "T13n0410_002:0689a21_4"
    },
    {
        "source_sentence": "彼善男子，云何修於如來誦習？",
        "translation": "How does that good man cultivate the recitation of the Tathāgata?",
        "source": "T13n0410_002:0689a21_5"
    },
    {
        "source_sentence": "若有比丘、比丘尼、優婆塞、優婆夷，善男子！",
        "translation": "If there are monks, nuns, laymen, and laymen, good man!",
        "source": "T13n0410_002:0689a22_6"
    },
    {
        "source_sentence": "有少信心微薄善根，於世諦中善根未熟，令彼眾生於初、中、後夜，以時誦習修禪喜悅求無上智。",
        "translation": "Those with little faith who have weak good roots of faith and haven't matured their good roots in the conventional truth cause those sentient beings to recite, cultivate, meditate, delight in meditation, and seek unsurpassed knowledge at the beginning, middle, and end of the night.",
        "source": "T13n0410_002:0689a23_7"
    },
    {
        "source_sentence": "我於爾時安置大乘修習禪定，讀誦、受持、種種供養，自誦、教人誦，",
        "translation": "At the time, I was setting up the great vehicle to cultivate meditation, reciting it, retaining it, making various offerings, reciting it myself, and teaching others to recite it.",
        "source": "T13n0410_002:0689a26_8"
    },
    {
        "source_sentence": "自說、教人說，自供養、教人供養，自住大乘亦教人住大乘，互相教化滅諸煩惱；",
        "translation": "Teaching themselves and teaching others to teach, they make offerings to themselves and teach others to make offerings. Abiding themselves in the Great Vehicle, they also teach others to abide in the Great Vehicle, teaching one another to extinguish all afflictions.",
        "source": "T13n0410_002:0689a27_9"
    },
    {
        "source_sentence": "皆為得於無上道利，亦欲滅諸眾生無量等苦，亦為得入無所畏處涅槃之城。",
        "translation": "They all want to attain the benefits of the unsurpassed path, want to extinguish the measureless sufferings of sentient beings, and want to enter the city of nirvāṇa where there's no fear.",
        "source": "T13n0410_002:0689a29_10"
    },
    {
        "source_sentence": "若有眾生樂求辟支佛者，為說十二因緣法。",
        "translation": "If there are sentient beings who delight in seeking pratyekabuddhas, he explains the twelve causal dharmas for them.",
        "source": "T13n0410_002:0689b02_11"
    },
    {
        "source_sentence": "樂求聲聞者，為說百千四種阿含，及與無量阿毘曇等教，令誦習如說修行。",
        "translation": "Those who delight in seeking śrāvakas are taught one hundred thousand four kinds of abhidharma sūtras and immeasurable abhidharma teachings, so that they may recite them as they are taught and practice them.",
        "source": "T13n0410_002:0689b03_12"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0689b05_13"
    },
    {
        "source_sentence": "是名如來修誦習輪。",
        "translation": "This is called the wheel of cultivating recitation by the Tathāgata.",
        "source": "T13n0410_002:0689b05_14"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0689b06_15"
    },
    {
        "source_sentence": "若有鈍根眾生，為欲發起善根因緣，懈怠、少智、忘失正念，貪著住處、衣服、飲食、四事供養，",
        "translation": "Suppose there are some sentient beings with dull faculties who want to develop the causes and conditions for good roots but are lazy, lack knowledge, forgetful, and right mindfulnessless, craving dwelling places, clothing, food and drink, and the four kinds of offerings.",
        "source": "T13n0410_002:0689b06_16"
    },
    {
        "source_sentence": "遠離一切諸善知識；",
        "translation": "They are far removed from all good teachers.",
        "source": "T13n0410_002:0689b08_17"
    },
    {
        "source_sentence": "如此眾生，教令勸化料理僧事及與佛法和上阿闍梨故，是善男子！",
        "translation": "It's because such sentient beings are taught and encouraged to lead the affairs of the saṃgha and serve as superior preceptors who harmonize with the Buddha's teachings, which is good man!",
        "source": "T13n0410_002:0689b09_0"
    },
    {
        "source_sentence": "則為安置如來勸化營事福處。",
        "translation": "He then places it in the place where the Tathāgata encourages and transforms people to perform meritorious service.",
        "source": "T13n0410_002:0689b10_1"
    },
    {
        "source_sentence": "如是善男子，如實知於修習業法。",
        "translation": "Thus, good sons, they truly know the way to cultivate karma.",
        "source": "T13n0410_002:0689b11_2"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0689b12_3"
    },
    {
        "source_sentence": "是名第二佛輪，具足三業成熟眾生輪，到於安隱無畏之處，能師子吼轉梵法輪，",
        "translation": "This is called the second buddha-wheel of enlightenment. Endowed with the three practices to develop sentient beings, he reaches a state of peace and fearlessness where he can roar the lion’s roar in order to turn the wheel of the teaching of the holy Dharma.",
        "source": "T13n0410_002:0689b12_4"
    },
    {
        "source_sentence": "令諸外敵皆悉降伏，如實能知眾生因緣。",
        "translation": "They cause all external enemies to be completely subdued, and they can truly know the causes and conditions of sentient beings.",
        "source": "T13n0410_002:0689b14_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0689b16_0"
    },
    {
        "source_sentence": "譬如灌頂剎利王，沙門、婆羅門、毘舍、首陀，諦善觀察誰有勇健，種種伎能，",
        "translation": "It is like the case with the coronation of a kṣatriya king. The śramaṇas, brāhmaṇas, ascetics, piśācīs, and śūdras are observed to be brave and valiant in their various abilities.",
        "source": "T13n0410_002:0689b16_1"
    },
    {
        "source_sentence": "多聞、持戒；",
        "translation": "They are learned and observant of the precepts.",
        "source": "T13n0410_002:0689b17_2"
    },
    {
        "source_sentence": "善知分別有功德者，方便、智慧，能勤精進堅固不退，種種福德而自莊嚴。",
        "translation": "Those who well know that discrimination has merit are those whose skillful means and wisdom can diligently exert effort, be resolute and not retreat, and adorn themselves with various virtues.",
        "source": "T13n0410_002:0689b18_3"
    },
    {
        "source_sentence": "於是眾中作灌頂剎利王，隨其相貌，金、銀、珍寶、倉庫、穀帛，及諸田宅、奴婢、僕使，",
        "translation": "In the midst of the assembly, he made a coronation as king of the kṣatriyas, adorned with gold, silver, precious treasures, storehouses, grain, silk cloth, land, houses, slaves, servants, and messengers according to their appearance.",
        "source": "T13n0410_002:0689b19_4"
    },
    {
        "source_sentence": "皆悉給與此國。",
        "translation": "They'll all be given to this country.",
        "source": "T13n0410_002:0689b21_5"
    },
    {
        "source_sentence": "若有於眾生中能持戒者，如此眾生亦給短乏。",
        "translation": "If there are sentient beings who can observe precepts, such sentient beings will also be given a shortage.",
        "source": "T13n0410_002:0689b22_0"
    },
    {
        "source_sentence": "若有眾生不持戒者，少於精進、懈怠、懶惰、忘失正念，無慈愍心亦無返復，",
        "translation": "“If there are any sentient beings who do not keep the precepts but lack zeal, laziness, idleness, sloth, forgetfulness, and right mindfulness, they lack kindness and compassion and will not return.",
        "source": "T13n0410_002:0689b23_1"
    },
    {
        "source_sentence": "不畏後世在欲淤泥。",
        "translation": "They won't fear future lives in the mud of desire.",
        "source": "T13n0410_002:0689b24_2"
    },
    {
        "source_sentence": "如是灌頂剎利大王，隨其事相謫罰安慰，或以教令謫罰、或以繫閉謫罰、或以財物謫罰、或復有奪種種產業、或有罰其鞭杖、或有截其支節、或有斬其身首，",
        "translation": "Thus, the consecrated great king of the kṣatriyas is disciplined and comforted by punishment according to their deeds, either by telling them to be punished, or by imposing fetters on them, or by punishing them with property, or by taking away various property, or by punishing them with whipping sticks, cutting off their limbs,",
        "source": "T13n0410_002:0689b25_3"
    },
    {
        "source_sentence": "有如是等無量教授；",
        "translation": "There are innumerable such teachings.",
        "source": "T13n0410_002:0689b29_4"
    },
    {
        "source_sentence": "是名灌頂剎利大王第三輪也。",
        "translation": "This is called the third wheel of the consecration of the great king Śāriputra.",
        "source": "T13n0410_002:0689b29_5"
    },
    {
        "source_sentence": "能令增益己之國土，降伏一切諸惡外敵，守護身命令得長壽。",
        "translation": "They can cause to increase their own land, subdue all bad external enemies, and guard their bodies so that they'll attain long life.",
        "source": "T13n0410_002:0689c01_6"
    },
    {
        "source_sentence": "「如是，如是！",
        "translation": "“So it is, so it is!",
        "source": "T13n0410_002:0689c03_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0689c04_0"
    },
    {
        "source_sentence": "若我聲聞弟子，離於智慧、方便、福德及諸調伏，忘失正念亂心放逸，",
        "translation": "“Suppose my śrāvaka disciples are free of wisdom, skillful means, virtue, and the disciplines, forgetting right mindfulness, disturbed by heedlessness.",
        "source": "T13n0410_002:0689c04_1"
    },
    {
        "source_sentence": "歸依於我，我知體性隨其相貌而調伏之。",
        "translation": "They take refuge in self, and I know their essence and nature and tame them according to their appearance.",
        "source": "T13n0410_002:0689c05_2"
    },
    {
        "source_sentence": "若有貢高難可調伏，心不恭敬不堅持戒，為法久住而調伏之。",
        "translation": "If there's a tribute that's difficult to subdue, the mind doesn't respect and doesn't adhere to precepts, and it's disciplined by abiding for a long time because of the Dharma.",
        "source": "T13n0410_002:0689c06_3"
    },
    {
        "source_sentence": "若起心念，教令心悔，又須言語而謫罰者，驅令下意終不與語。",
        "translation": "If someone gives rise to mental thoughts, teaches them to repent, and requires words to punish them, they'll be expelled and made to say nothing at all.",
        "source": "T13n0410_002:0689c08_4"
    },
    {
        "source_sentence": "亦於僧中謫罰令其禮拜，呵詰嫌責不同僧利。",
        "translation": "They'll also be punished among the saṃgha, ordered to venerate them, and criticized and disparaged for being different from the benefits of the saṃgha.",
        "source": "T13n0410_002:0689c09_5"
    },
    {
        "source_sentence": "或在僧前四體投地自歸伏罪，或時驅出不得共住。",
        "translation": "Sometimes they may throw themselves to the ground in front of the saṃgha and subdue their sins, or sometimes they'll be expelled and won't be allowed to live together.",
        "source": "T13n0410_002:0689c11_0"
    },
    {
        "source_sentence": "我知眾生種種體性，心所趣向，能生信解。",
        "translation": "I know the various essence-natures of sentient beings, their mental patterns and inclinations, and can give rise to faith and understanding.",
        "source": "T13n0410_002:0689c12_1"
    },
    {
        "source_sentence": "為利彼故，除其黑闇、乾竭駛流，得涅槃樂，為欲調伏破戒眾生，廣說諸經地獄等苦。",
        "translation": "In order to benefit them, he removes their darkness and dryness, dries up the fast flowing stream of extinction, attains the bliss of nirvāṇa, and explains in detail the sufferings of scriptures, hells, etc., for the sake of taming sentient beings who break the precepts.",
        "source": "T13n0410_002:0689c13_2"
    },
    {
        "source_sentence": "若有眾生能起信敬淨意方便，隨彼體相說諸善根，為具善故乃至令得到無畏城。",
        "translation": "If there are sentient beings who can give rise to faith, respect, and purity of mind, they'll explain the good roots according to their essence and characteristics, so that they will attain the fearless city because they possess goodness.",
        "source": "T13n0410_002:0689c15_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0689c17_4"
    },
    {
        "source_sentence": "是名第三輪也。",
        "translation": "This is called the third wheel.",
        "source": "T13n0410_002:0689c17_5"
    },
    {
        "source_sentence": "以如是輪，隨彼眾生得種種解，修行諸業悉具善本，使得安隱到無畏處，",
        "translation": "By means of such a wheel, they follow those sentient beings who attain various understandings, cultivate good roots in all their actions, and lead them peacefully to the sphere of fearlessness.",
        "source": "T13n0410_002:0689c18_0"
    },
    {
        "source_sentence": "如彼賢聖轉佛法輪，外道怨敵自然降伏，能師子吼。",
        "translation": "Suppose that good and noble person turns the Buddha's wheel of the Dharma, naturally subdues the enemies of non-Buddhists and can roar a lion's roar.",
        "source": "T13n0410_002:0689c19_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0689c22_0"
    },
    {
        "source_sentence": "譬如灌頂剎利大王，於國人民有若干種邪歸、邪見、邪解、邪出家，或於吉相專修如此，",
        "translation": "It's like the consecration of a great king of the kṣatriyas who has certain kinds of wrong refuge, wrong view, wrong understanding, and wrong renunciation among the people of his country, or who focuses on cultivating such auspicious signs.",
        "source": "T13n0410_002:0689c22_1"
    },
    {
        "source_sentence": "無量苦惱傷害眾生。",
        "translation": "They cause measureless suffering and harm sentient beings.",
        "source": "T13n0410_002:0689c24_2"
    },
    {
        "source_sentence": "灌頂大王以先王舊法，為彼眾生令專修學斷除倒見，先王舊善治國之法亦使修行。",
        "translation": "The Consecration Great King used the old teachings of the former king to cause those sentient beings to focus on cultivating and cultivating the elimination of mistaken views, and the old teachings of the former king's good governance of the country also caused them to cultivate them.",
        "source": "T13n0410_002:0689c24_3"
    },
    {
        "source_sentence": "灌頂剎利大王制法，令諸眾生悉同一意俱共調伏，同一悕望同所樂欲，",
        "translation": "The great king of the kṣatriyas consecrates and disciplines all sentient beings, enabling them to be harmoniously subdued with one mind, having the same hope and the same aspiration.",
        "source": "T13n0410_002:0689c26_4"
    },
    {
        "source_sentence": "同共歸趣皆令和合。",
        "translation": "Together, they all return to the same destination and cause them to be united.",
        "source": "T13n0410_002:0689c28_5"
    },
    {
        "source_sentence": "隨順先王舊國之法聽受詔命，皆共隨伏同奉國法。",
        "translation": "They all complied with the customs of their former kingdom and listened to the imperial edict, and they all followed and subdued them together in accordance with the national law.",
        "source": "T13n0410_002:0689c29_0"
    },
    {
        "source_sentence": "爾時，灌頂剎利大王，常與國人同其飲食而共戲樂，不相疑猜心相體信共行王法，",
        "translation": "At the time, the consecrated great king of the kṣatriyas always shared the same food and drink with the people of his country and played together, not doubting each other or speculating among themselves. They all believed in each other’s theories and practiced the king’s teaching.",
        "source": "T13n0410_002:0690a01_1"
    },
    {
        "source_sentence": "是名灌頂大王第四輪也。",
        "translation": "This is called the fourth wheel of the consecration of the great king.",
        "source": "T13n0410_002:0690a03_2"
    },
    {
        "source_sentence": "「以如是輪能令己國悉得增長，并制怨敵皆悉降伏，能保國土守護壽命。",
        "translation": "Because such a wheel can cause his own country to grow, subdue all enemies and opponents, and he can protect his land and guard his life.",
        "source": "T13n0410_002:0690a04_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0690a05_1"
    },
    {
        "source_sentence": "如來世尊，見諸眾生有若干種邪歸、邪見、悕樂邪業。",
        "translation": "Bhagavān, the Tathāgata sees that sentient beings have certain kinds of mistaken refuge, mistaken views, and crude and pleasant mistaken actions.",
        "source": "T13n0410_002:0690a05_2"
    },
    {
        "source_sentence": "觀諸眾生，以是因緣，己於過去諸佛如來在大眾前，數數開示佛法因果，",
        "translation": "Because of these causes and conditions, he observed the buddhas of the past who were present before the great assembly to show them innumerable times the causality of the Buddha’s teaching.",
        "source": "T13n0410_002:0690a07_3"
    },
    {
        "source_sentence": "說六波羅蜜修行正道，說佛、法、僧三寶聖種，數數顯現一切業報，示教利喜而將導之，",
        "translation": "They teach the six transcendent ways, cultivate right paths, and explain the holy lineages of Buddha, Dharma, and Sangha, the three treasures, repeatedly revealing the results of all actions, teaching, benefiting, and joyfully guiding them.",
        "source": "T13n0410_002:0690a09_0"
    },
    {
        "source_sentence": "令諸邪見悉得解脫，及與四眾亦皆解脫。",
        "translation": "They cause all wrong views to attain liberation, and they and the four groups of people are also liberated.",
        "source": "T13n0410_002:0690a11_1"
    },
    {
        "source_sentence": "具修善行柔和調順，遊戲四念處，於諸解脫知見正道，悉得快樂令法久住。",
        "translation": "He cultivates good actions, is gentle and harmonious, plays in the four abodes of mindfulness, knows and sees the right path to liberation, and attains happiness so that the teaching will abide for a long time.",
        "source": "T13n0410_002:0690a12_2"
    },
    {
        "source_sentence": "使三寶種終不斷絕，乃至四正勤、四如意足、五根、五力、七覺分、八聖道分，",
        "translation": "They cause the seeds of the three treasures never to be cut off, up to the fourfold correct effort, the four supernormal powers, the five faculties, the five powers, the seven factors of enlightenment, and the eight noble factors of the path.",
        "source": "T13n0410_002:0690a13_3"
    },
    {
        "source_sentence": "一切禪定解脫知見，悉得自在遊戲無礙。",
        "translation": "All the knowledge and vision of liberation from meditation, they all attain unobstructed freedom and play without obstruction.",
        "source": "T13n0410_002:0690a15_4"
    },
    {
        "source_sentence": "如是，善男子！",
        "translation": "So it is, good man!",
        "source": "T13n0410_002:0690a16_5"
    },
    {
        "source_sentence": "是名如來第四輪也。",
        "translation": "This is called the fourth wheel of the Tathāgata.",
        "source": "T13n0410_002:0690a16_6"
    },
    {
        "source_sentence": "「如來成就如是輪故，令諸眾生一切歸依，皆修善業同其知見，安隱快樂悉令住於無畏之地。",
        "translation": "Because the Tathāgata accomplishes such a wheel, he causes all sentient beings to take refuge in it, cultivates good actions that are the same as their knowing and seeing, and makes them all live in the fearless land with peace and happiness.",
        "source": "T13n0410_002:0690a18_0"
    },
    {
        "source_sentence": "高勝大仙所證之處轉佛法輪，一切沙門、婆羅門、諸梵魔天所不能轉。",
        "translation": "Where the Vaiśeṣika Great Sage realizes it, he turns the Buddha's Dharma wheel, which all ascetics, priests, and Brahmā gods can't turn.",
        "source": "T13n0410_002:0690a20_1"
    },
    {
        "source_sentence": "摧伏天魔一切外道，於四眾中能師子吼。",
        "translation": "He subdued all the non-Buddhist gods and demons, and he was able to roar the lion's roar among the four groups of people.",
        "source": "T13n0410_002:0690a21_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0690a23_0"
    },
    {
        "source_sentence": "譬如灌頂大王，能令己國及他人民，若自妻色心無厭足。",
        "translation": "It's like a consecrated great king who can cause his own country and the people of others to have their own wife, form, and mind without weariness.",
        "source": "T13n0410_002:0690a23_1"
    },
    {
        "source_sentence": "於他產業并諸妻色皆生貪著，守護城郭禁諸雜物，國土村邑及以王宮，",
        "translation": "They become greedy with respect to the property of others and their wives, guarding cities, forbidden things, land, villages, kingdoms, and palaces.",
        "source": "T13n0410_002:0690a24_2"
    },
    {
        "source_sentence": "乃至戍邏皆悉遮制緻密堅固。",
        "translation": "Even the garrison is completely obstructed, restrained, dense, and strong.",
        "source": "T13n0410_002:0690a26_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0690a27_0"
    },
    {
        "source_sentence": "是名第五灌頂大王禁制輪也。",
        "translation": "This is called the fifth consecration of the great king's wheel of forbidden discipline.",
        "source": "T13n0410_002:0690a27_1"
    },
    {
        "source_sentence": "「時灌頂王，如是成就輪已，能令外諸怨敵皆悉降伏，亦使己國常得增長救護身命。",
        "translation": "After thus accomplishing the wheel, the consecrated king then can cause all the external enemies to be completely subdued and his own country to always grow in strength to rescue and protect their lives.",
        "source": "T13n0410_002:0690a28_0"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0690b02_0"
    },
    {
        "source_sentence": "如來多陀阿伽度，能令魔王波旬，九十五種眾邪外道，及諸無量一切眾生，",
        "translation": "The Tathāgata’s liberation by means of the doctrine of the path is able to cause Māra King Pāpīyān and ninety-five kinds of heretics, as well as countless other sentient beings.",
        "source": "T13n0410_002:0690b02_1"
    },
    {
        "source_sentence": "於己產業心無厭足，乃至欲害我故，以火坑毒飯，推山欲壓，放其醉象，",
        "translation": "They are not satisfied with their own property, and even if they want to harm me, they pluck the mountain into a fire pit for poisonous rice in order to crush it.",
        "source": "T13n0410_002:0690b03_2"
    },
    {
        "source_sentence": "或拔利劍，以如是等而逐於我，或以塵穢而坌於佛，或以婬慾而謗如來，",
        "translation": "They may pull out sharp swords and chase after me with such things, or they may attack the Buddha with dirty words, or they may criticize the Buddha with lustful desires.",
        "source": "T13n0410_002:0690b05_3"
    },
    {
        "source_sentence": "或言非人亦非丈夫，如是種種誹謗毀呰，而口惡罵於佛、法、僧，為諸利養眾因緣故，",
        "translation": "Or they may say it's neither human nor husband, and thus variously denigrate and disparage the Buddha, Dharma, and Saṃgha, verbally abuse them for the sake of profiting the causes and conditions of all people.",
        "source": "T13n0410_002:0690b07_4"
    },
    {
        "source_sentence": "而生嫉妬誹謗聲聞。",
        "translation": "Instead, they become jealous and denigrate śrāvakas.",
        "source": "T13n0410_002:0690b09_5"
    },
    {
        "source_sentence": "如來世尊善守六根住四梵處，教諸聲聞，或以四念處，以四辯才，為說聲聞三解脫門。",
        "translation": "The Tathāgata, the Bhagavān, well guards the six faculties and abides in the four abodes of Brahmā, teaching śrāvakas to explain the three liberations of śrāvakas through the four abodes of mindfulness or by the four powers of eloquence.",
        "source": "T13n0410_002:0690b10_6"
    },
    {
        "source_sentence": "如是，如來有若干種，或以世間法及出世間法，能令一切如實而知。",
        "translation": "Thus, there are several kinds of tathāgatas who can cause all to be known as they really are by means of worldly dharmas and transmundane dharmas.",
        "source": "T13n0410_002:0690b12_7"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0410_002:0690b14_0"
    },
    {
        "source_sentence": "是名如來第五輪也。",
        "translation": "This is called the fifth wheel of the Tathāgata.",
        "source": "T13n0410_002:0690b14_1"
    },
    {
        "source_sentence": "「如來修如是輪，以出世間智，令他眾生種種歸依，皆同產業共其知見，",
        "translation": "The Tathāgata cultivates such a wheel in order to transcend worldly wisdom, enabling other sentient beings to variously rely on it. They all share the same property and common knowledge and vision.",
        "source": "T13n0410_002:0690b15_0"
    },
    {
        "source_sentence": "安隱快樂住無所畏。",
        "translation": "He's peaceful and happy, abiding in fearlessness.",
        "source": "T13n0410_002:0690b16_1"
    },
    {
        "source_sentence": "是諸高勝大仙居處轉佛法輪，沙門、婆羅門、諸梵魔天所不能轉，悉能摧伏一切天魔及諸外道，",
        "translation": "In the abode of these supreme great sages, they turn the wheel of the Buddha’s teaching. No śramaṇas, brāhmaṇas, or Brahmā gods can turn it. They are able to subdue all heavenly Māras and heretics.",
        "source": "T13n0410_002:0690b17_2"
    },
    {
        "source_sentence": "於四眾中能師子吼。",
        "translation": "Among the four groups of people, he can roar the lion's roar.",
        "source": "T13n0410_002:0690b19_3"
    },
    {
        "source_sentence": "大方廣十輪經卷第二",
        "translation": "Dafangguang shilun jing, vol. 2",
        "source": "T13n0410_002:0690b21_0"
    }
]