[
    {
        "source_sentence": "大方等大集經卷第五十五",
        "translation": "*Mahāmegha-sūtra, Volume 35",
        "source": "T13n0397_055:0362c02_0"
    },
    {
        "source_sentence": "高齊天竺三藏那連提耶舍譯",
        "translation": "Translated by the translator Nārāyaśas of the Tripiṭaka of Gaoqi Tianzhusa",
        "source": "T13n0397_055:0362c04_0"
    },
    {
        "source_sentence": "月藏分第十二分布閻浮提品第十七",
        "translation": "The Twelfth Part of the Collection of the Moon, Chapter XVII of the Distribution of Jambudvīpa",
        "source": "T13n0397_055:0362c05_0"
    },
    {
        "source_sentence": "爾時，世尊既知一切諸來大眾於三寶所皆生深信、尊重、敬仰，得未曾有，",
        "translation": "At that time, the World-honored One knew that all the multitudes of those who had come to see him were filled with great faith in and reverence and veneration toward the teachings of the Triple Gem. They attained unprecedented marvels.",
        "source": "T13n0397_055:0362c06_0"
    },
    {
        "source_sentence": "更不信事諸餘天已，告他化自在天王、化樂天王、兜率陀天王、須夜摩天王、帝釋天王、四大天王及諸眷屬、娑伽羅龍王、阿那婆達多龍王、羅睺羅阿修羅王、毘摩質多羅阿修羅王、睒婆利阿修羅王、跋持毘盧遮那阿修羅王、大樹緊那羅王、樂欲乾闥婆軍將、檀提鳩槃茶軍將、因陀羅夜叉軍將、寒葉餓鬼王、垂脣毘舍遮王、阿那竭囉富單那王、巷路喚聲迦吒富單那王等，",
        "translation": "Having no longer believed in any of the other gods, he told the other Mahāprajñāpāramitā heavenly kings, Mahāprajñāpāramitā heavenly kings, Mahāprajñāpāramitā heavenly kings, Mahāprajñāpāramitā heavenly kings, Mahāprajñāpāramitā heavenly kings, Mahāprajñā",
        "source": "T13n0397_055:0362c07_1"
    },
    {
        "source_sentence": "作如是言：「諸仁者！",
        "translation": "He said, Gentlemen!",
        "source": "T13n0397_055:0362c16_2"
    },
    {
        "source_sentence": "汝等一切如是勸我，分布安置此閻浮提一切國土、城邑、宮殿、王都、聚落、山巖、寺舍、園池、曠野、諸樹林間，",
        "translation": "All of you thus encourage me to distribute and place this Jambudvīpa among all the lands, cities, palaces, kingdoms, towns, villages, mountains, monasteries, parks, ponds, wilderness, and forests.",
        "source": "T13n0397_055:0362c16_3"
    },
    {
        "source_sentence": "付囑護持勿令有惡。",
        "translation": "He entrusts it to the guardian so that there won't be evil.",
        "source": "T13n0397_055:0362c19_4"
    },
    {
        "source_sentence": "又令大地精氣、眾生精氣、正法精氣增長熾然。",
        "translation": "It also causes the vital energy of the great earth, the vital energy of sentient beings, and the vital energy of the right teaching to grow and become blazing.",
        "source": "T13n0397_055:0362c19_5"
    },
    {
        "source_sentence": "佛正法眼久住於世，紹三寶種使不斷絕，損減惡趣增益善道，令此閻浮提一切安隱豐樂可樂。",
        "translation": "The Buddha's right eye of the Dharma has been in the world for a long time, introducing the seeds of the three treasures so that they won't be cut off, reducing bad destinies and increasing good destinies, so that all people in Jambudvīpa will have peace, prosperity, happiness, and happiness.",
        "source": "T13n0397_055:0362c20_6"
    },
    {
        "source_sentence": "以是因緣，我今分布此四天下，囑汝一切諸大天王、一切龍王，乃至一切迦吒富單那王，",
        "translation": "Because of this cause and condition, I will now distribute these four continents to you. Entrust them to all the great celestial kings, all the dragon kings, and so on, up to all the kaṭa-putra kings.",
        "source": "T13n0397_055:0362c23_0"
    },
    {
        "source_sentence": "汝等各應發心捨離眷屬，分布安置護持養育，并汝諸天一切眷屬，乃至迦吒富單那王、一切眷屬，",
        "translation": "You should each give rise to the intention to abandon your retinues, distribute, place, protect, and nourish them, along with all your heavenly retinues, up to the king of Kāṭaputra and all his retinues.",
        "source": "T13n0397_055:0362c25_0"
    },
    {
        "source_sentence": "亦令於此閻浮提中一切國土乃至樹林，分布安置護持養育。",
        "translation": "He also causes all the lands and even forests in this Jambudvīpa to distribute, place, maintain, and nurture them.",
        "source": "T13n0397_055:0363a02_1"
    },
    {
        "source_sentence": "是故汝等諸大天王及諸眷屬，乃至迦吒富單那王及諸眷屬，於閻浮提皆應誠心隨喜讚歎，",
        "translation": "Therefore, you great celestial kings and their retinues, as well as the king Kāṭapūtana and his retinues, should wholeheartedly rejoice and praise him in Jambudvīpa.",
        "source": "T13n0397_055:0363a03_2"
    },
    {
        "source_sentence": "莫瞋莫恨亦莫生怒。」",
        "translation": "Don't be angry, don't hate, and don't become angry.",
        "source": "T13n0397_055:0363a05_3"
    },
    {
        "source_sentence": "爾時，所有一切菩薩摩訶薩、色界諸天、欲界天人、一切龍眾、一切乾闥婆，",
        "translation": "At that time, all the bodhisattva mahāsattvas, gods of the realm of form, gods and humans of the realm of desire, all the dragons, and all the gandharvas were present.",
        "source": "T13n0397_055:0363a07_0"
    },
    {
        "source_sentence": "乃至一切迦吒富單那等諸來大眾，皆悉合掌各作是言：「我等一切誠心隨喜敬受佛教，",
        "translation": "All the assembled monks and nuns, including Kāṭakūṭa and Samantabhadra, joined their palms and said: We wholeheartedly accept this teaching with joy and reverence.",
        "source": "T13n0397_055:0363a08_1"
    },
    {
        "source_sentence": "如佛世尊分布安置此閻浮提。",
        "translation": "Suppose the Bhagavān distributes and places them here in Jambudvīpa.",
        "source": "T13n0397_055:0363a10_2"
    },
    {
        "source_sentence": "我等發心受佛教勅護持養育，佛正法眼令得熾然。」",
        "translation": "We arouse the intention to receive the Buddha's command to preserve and nurture it, so that the Buddha's right eye of the Dharma will become blazing.",
        "source": "T13n0397_055:0363a11_3"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T13n0397_055:0363a12_4"
    },
    {
        "source_sentence": "妙丈夫！",
        "translation": "Marvelous man!",
        "source": "T13n0397_055:0363a13_0"
    },
    {
        "source_sentence": "汝等應當如是誠心說欲隨喜。」",
        "translation": "You should thus sincerely explain the desire to follow it with joy.",
        "source": "T13n0397_055:0363a13_1"
    },
    {
        "source_sentence": "爾時，世尊告彼法食喜食禪食諸天言：「此四天下大海水中八萬洲渚一切國土，",
        "translation": "At that time the World-honored One said to the gods of the Dharma-eating, Joyful Eating, and Meditation-Eating heavens: “In the great waters of the four quarters of the earth there are eighty thousand small continents in all their various countries.",
        "source": "T13n0397_055:0363a14_0"
    },
    {
        "source_sentence": "汝等法食喜食禪食諸天，應當護持養育我法，住法比丘如法順法，發心修行三業相應，",
        "translation": "You gods who eat the food of the Dharma, delight in eating it, and meditate on it should preserve and nourish our dharma. Monks who abide by the Dharma and follow the Dharma according to the Dharma, arouse their minds and practice it. It is associated with three karmic activities:",
        "source": "T13n0397_055:0363a15_1"
    },
    {
        "source_sentence": "剃除鬚髮身著袈裟，汝等應當護持養育。」",
        "translation": "Shave off your hair and beard, put on the reddish-brown robes, and you should guard and nourish them.",
        "source": "T13n0397_055:0363a17_2"
    },
    {
        "source_sentence": "時，彼法食喜食禪食諸天各作是言：「我當護持大海水中八萬洲渚一切國土諸佛正法。",
        "translation": "The gods of the Dharma-eating, joy-eating, and Chan-eating heavens then each said, I will protect the right teachings of the buddhas of all the 80,000 islands in all lands in the ocean's water.",
        "source": "T13n0397_055:0363a18_3"
    },
    {
        "source_sentence": "若佛弟子，乃至不畜婦女、畜生、田宅、資產，我等皆當護持養育。」",
        "translation": "If a disciple of the Buddha doesn't possess women, animals, land, homes, or property, we will all guard and nurture them.",
        "source": "T13n0397_055:0363a20_4"
    },
    {
        "source_sentence": "爾時，世尊讚彼天言：「善哉，善哉！」",
        "translation": "It was then that the Bhagavān praised the gods, saying, Good, good!",
        "source": "T13n0397_055:0363a23_0"
    },
    {
        "source_sentence": "一切大眾亦復讚言：「善哉，善哉！」",
        "translation": "All the people in the assembly also praised it, saying, Good, good!",
        "source": "T13n0397_055:0363a23_1"
    },
    {
        "source_sentence": "爾時，世尊告月藏菩薩摩訶薩言：「了知清淨士！",
        "translation": "It was then that the Bhagavān addressed the moon store bodhisattva Mahāsattva, saying, Understand, pure man!",
        "source": "T13n0397_055:0363a25_0"
    },
    {
        "source_sentence": "若我住世諸聲聞眾，戒具足、捨具足、聞具足、定具足、慧具足、解脫具足、解脫知見具足，",
        "translation": "“If all the śrāvakas in my world are endowed with perfect morality, perfect renunciation, perfect learning, perfect concentration, perfect wisdom, perfect liberation, and perfect knowledge and vision of liberation,",
        "source": "T13n0397_055:0363a26_1"
    },
    {
        "source_sentence": "我之正法熾然在世，乃至一切諸天人等，亦能顯現平等正法。",
        "translation": "My right teaching is blazing in the world, and all gods and humans can also show equally the right teaching.",
        "source": "T13n0397_055:0363a28_2"
    },
    {
        "source_sentence": "於我滅後五百年中，諸比丘等猶於我法解脫堅固；",
        "translation": "In the five hundred years after my nirvana, those monks and others remained steadfast in their liberation from our teachings.",
        "source": "T13n0397_055:0363a29_3"
    },
    {
        "source_sentence": "次五百年，我之正法禪定三昧得住堅固；",
        "translation": "In the next five hundred years my true teaching of meditation and concentration became firm.",
        "source": "T13n0397_055:0363b01_4"
    },
    {
        "source_sentence": "次五百年，讀誦多聞得住堅固；",
        "translation": "For the next five hundred years he recited extensively and gained stability in learning.",
        "source": "T13n0397_055:0363b02_5"
    },
    {
        "source_sentence": "次五百年，於我法中多造塔寺得住堅固；",
        "translation": "In the next five hundred years, many stupas and temples were built in my religion to make their existence firm.",
        "source": "T13n0397_055:0363b03_6"
    },
    {
        "source_sentence": "次五百年，於我法中鬪諍言訟白法隱沒損減堅固。",
        "translation": "In the next five hundred years, there will be disputes and arguments within my teaching that won't subdue the seclusion of the teaching and make it firm.",
        "source": "T13n0397_055:0363b04_7"
    },
    {
        "source_sentence": "「了知清淨士！",
        "translation": "Understand, pure man!",
        "source": "T13n0397_055:0363b05_8"
    },
    {
        "source_sentence": "從是以後於我法中，雖復剃除鬚髮身著袈裟，毀破禁戒行不如法假名比丘。",
        "translation": "From then on, even though he shaved his hair and body and put on the reddish-brown monk's robes, he disregarded the forbidden precepts and practiced disobeying the teaching, and he was nominally called a monk.",
        "source": "T13n0397_055:0363b05_9"
    },
    {
        "source_sentence": "如是破戒名字比丘，若有檀越捨施供養護持養育，我說是人猶得無量阿僧祇大福德聚。",
        "translation": "Thus, if a monk who breaks the precepts is called a donor and abandons generosity, makes offerings, protects, maintains, and nourishes them, I say that person will still attain an immeasurable amount of incalculable great stock of merit.",
        "source": "T13n0397_055:0363b07_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_055:0363b09_11"
    },
    {
        "source_sentence": "猶能饒益多眾生故，何況我今現在於世？",
        "translation": "It's still able to benefit many sentient beings, so why wouldn't I be present in the world now?",
        "source": "T13n0397_055:0363b09_12"
    },
    {
        "source_sentence": "「譬如真金為無價寶，若無真金銀為無價，若無銀者鍮石無價，若無鍮石偽寶無價，",
        "translation": "“Suppose genuine gold is priceless, and if there’s no genuine gold, silver is priceless; if there’s no silver, brass or stone is priceless; and if there’s no brass or stone, fake treasure is priceless.",
        "source": "T13n0397_055:0363b10_13"
    },
    {
        "source_sentence": "若無偽寶赤白銅鐵白鑞鉛錫為無價寶。",
        "translation": "If there's no fake treasure, red, white, copper, iron, white, pewter, lead, and tin are priceless treasures.",
        "source": "T13n0397_055:0363b12_14"
    },
    {
        "source_sentence": "如是一切諸世間中佛寶無上，若無佛寶緣覺無上，若無緣覺羅漢無上，",
        "translation": "Thus, the Buddha treasure is unsurpassed in all worlds. If there were no Buddha treasure, pratyekabuddhas would be unsurpassed; if there were no pratyekabuddhas, arhats would be unsurpassed.",
        "source": "T13n0397_055:0363b13_15"
    },
    {
        "source_sentence": "若無羅漢諸餘聖眾以為無上，若無聖眾得定凡夫以為無上，若無得定淨持戒者以為無上，",
        "translation": "If there aren't arhats, the other noble ones are considered unsurpassed, if there aren't no noble ones who attain concentration and worldlings are considered unsurpassed, and if there are no sages who attain concentration and pure observance of precepts that are pure, they're considered unsurpassed.",
        "source": "T13n0397_055:0363b15_16"
    },
    {
        "source_sentence": "若無淨戒污戒比丘以為無上，若無污戒剃除鬚髮身著袈裟名字比丘為無上寶，",
        "translation": "If a monk who doesn't observe pure precepts and defiled precepts takes it as the unsurpassed, and if he doesn't observe unsullied precepts and shaves his hair, beard, body, robe, and name-calling monks as the unsurpassed treasure,",
        "source": "T13n0397_055:0363b17_17"
    },
    {
        "source_sentence": "比餘九十五種異道最尊第一，應受世供為物福田。",
        "translation": "Among the other ninety-five kinds of heretics, the most venerable and foremost are those who should receive worldly offerings as a field of merit for property.",
        "source": "T13n0397_055:0363b19_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_055:0363b20_19"
    },
    {
        "source_sentence": "能示眾生可怖畏故。",
        "translation": "It's because it can show sentient beings what they fear.",
        "source": "T13n0397_055:0363b20_20"
    },
    {
        "source_sentence": "若有護持養育安置是人，不久得住忍地。」",
        "translation": "If someone protects, nourishes, and houses this person, they'll soon be able to stay in the stage of forbearance.",
        "source": "T13n0397_055:0363b21_21"
    },
    {
        "source_sentence": "爾時，世尊告六欲諸天言：「汝等應如過去佛時所分得分當勤護持，復於此四天下時時之中勤加思惟佛正法義，",
        "translation": "At that time the World-honored One said to the gods of the six heavens: Just as in the past buddha-fields were divided equally, you should diligently preserve and uphold them. You should also diligently reflect on the meaning of the Buddha’s true doctrine from time to time in these four quarters of the earth.",
        "source": "T13n0397_055:0363b23_0"
    },
    {
        "source_sentence": "為令我法得久住故，紹三寶種不斷絕故。」",
        "translation": "In order to cause my teaching to abide for a long time, the seeds of the Three Treasures won't be cut off.",
        "source": "T13n0397_055:0363b25_1"
    },
    {
        "source_sentence": "時彼諸天各作是言：「唯然受教。」",
        "translation": "The gods then each said, Yes, I'll accept the teaching.",
        "source": "T13n0397_055:0363b26_2"
    },
    {
        "source_sentence": "爾時，世尊讚言：「善哉，善哉！」",
        "translation": "It was then that the Bhagavān praised him, saying, Good, good!",
        "source": "T13n0397_055:0363b27_3"
    },
    {
        "source_sentence": "一切大眾亦復讚言：「善哉，善哉！」",
        "translation": "All the people in the assembly also praised it, saying, Good, good!",
        "source": "T13n0397_055:0363b28_4"
    },
    {
        "source_sentence": "爾時，世尊告四天王言：「汝等及諸眷屬，應如過去佛時所分得分，還作護持安置養育我之正法。」",
        "translation": "It was then that the Bhagavān addressed the four celestial kings, saying, You and your retinues, you should share what you've shared with the past buddhas and return to safeguarding, placing, and nurturing my right teaching.",
        "source": "T13n0397_055:0363b29_0"
    },
    {
        "source_sentence": "時四天王各作是言：「唯然受教。」",
        "translation": "The four heavenly kings then each said, Yes, I'll accept the teaching.",
        "source": "T13n0397_055:0363c02_1"
    },
    {
        "source_sentence": "佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "The Buddha and the crowd all praised him, saying, Good, good!",
        "source": "T13n0397_055:0363c02_2"
    },
    {
        "source_sentence": "爾時，世尊告乾闥婆等言：「諸仁者！",
        "translation": "It was then that the Bhagavān addressed the gandharvas and others, saying, Gentlemen!",
        "source": "T13n0397_055:0363c04_0"
    },
    {
        "source_sentence": "汝等及諸天仙，於優曇林、菴羅林、閻浮林、呵黎勒林、阿摩羅林、蒱萄林，",
        "translation": "You and the other heavenly sages are in the forest of the udumbara tree, the forest of ambrosia, the forest of Jambudvīpa, the forest of pārijātaka, the forest of amala, and the forest of grapes.",
        "source": "T13n0397_055:0363c04_1"
    },
    {
        "source_sentence": "如是等林於中而住，復共四天王宮諸天子等，為我佛法得久住故，應當思惟佛正法義。」",
        "translation": "Such forests and other celestial beings who live there together with the gods in the palaces of the four heavenly kings and so forth should contemplate the meaning of the Buddha's right teaching because they've long abided by my Buddha-dharma.",
        "source": "T13n0397_055:0363c06_2"
    },
    {
        "source_sentence": "時乾闥婆等咸言：「如是。",
        "translation": "The gandharvas and others then all said, So it is.",
        "source": "T13n0397_055:0363c08_3"
    },
    {
        "source_sentence": "大德婆伽婆！",
        "translation": "Venerable Bhagavān!",
        "source": "T13n0397_055:0363c08_4"
    },
    {
        "source_sentence": "唯然受教。」",
        "translation": "Yes, I'll accept the teaching.",
        "source": "T13n0397_055:0363c09_5"
    },
    {
        "source_sentence": "佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "The Buddha and the crowd all praised him, saying, Good, good!",
        "source": "T13n0397_055:0363c09_6"
    },
    {
        "source_sentence": "爾時，世尊告娑伽羅龍王、難陀龍王、婆難陀龍王、善現龍王、婆樓那龍王、婆修吉龍王、得叉迦龍王、阿難陀龍王、阿樓那龍王、歲星龍王言：「汝等各在大海之中住本宮殿，",
        "translation": "At that time the World-honored One said to the nāga king Sāgara, the nāga king Nanda, the nāga king Upananda, the nāga king Upananda, the nāga king Sudarśana, the nāga king Varuṇa, the nāga king Vasiṣṭacāritra, the nāga king Takshaka, the nāga king Ānanda, the",
        "source": "T13n0397_055:0363c11_0"
    },
    {
        "source_sentence": "護持養育我之正法。」",
        "translation": "He protects and nourishes the right teaching for me.",
        "source": "T13n0397_055:0363c14_1"
    },
    {
        "source_sentence": "時龍王等各作是言：「唯然受教。」",
        "translation": "The dragon kings and others then each said, Yes, I'll accept the teaching.",
        "source": "T13n0397_055:0363c15_2"
    },
    {
        "source_sentence": "佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "The Buddha and the crowd all praised him, saying, Good, good!",
        "source": "T13n0397_055:0363c16_0"
    },
    {
        "source_sentence": "爾時，世尊告阿那婆達多龍王、善住龍王、清脇龍王、摩利尼龍王、優婆羅龍王、乾闥婆龍王、雲池龍王、主雹龍王、摩奚曼多龍王、美音龍王言：「汝等各住本宮護持養育我之正法。」",
        "translation": "It was then that the Bhagavān addressed the dragon king Anavatapta, the dragon king Shanshou, the dragon king Qingyao, the dragon king Mārinī, the dragon king Upāli, the dragon king Qianzhouva, the dragon king Yunqi, the dragon king lord hail, the dragon king Mahāmantaka, and the",
        "source": "T13n0397_055:0363c17_0"
    },
    {
        "source_sentence": "時龍王等各作是言：「唯然受教。」",
        "translation": "The dragon kings and others then each said, Yes, I'll accept the teaching.",
        "source": "T13n0397_055:0363c20_1"
    },
    {
        "source_sentence": "佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "The Buddha and the crowd all praised him, saying, Good, good!",
        "source": "T13n0397_055:0364a01_2"
    },
    {
        "source_sentence": "爾時，世尊告鳩槃茶檀提大將、優婆檀提大將、迦羅迦大將、摩訶鉢賒大將、摩呼陀遮利大將、堀求尼大將、婆朱賒尼大將、鴦崛盧大將、鞞羅差大將、一眉大將言：「汝等各住本宮護持養育我之正法。」",
        "translation": "It was then that the Bhagavān addressed the generals Kumārajīva, Upanandi, Upanandi, Kālôdayi, Mahāprajāpatī, Mahāprajāpatī, Mahāprajāpatī, Mahāprajāpatī, Mahāprajāpatī, Mahāprajāpatī, Mahāprajāpatī, Mahāprajāpa",
        "source": "T13n0397_055:0364a03_0"
    },
    {
        "source_sentence": "時鳩槃茶大將等，各作是言：「唯然受教。」",
        "translation": "The generals of Kumārajīva and so forth then each said, Yes, I'll accept the teaching.",
        "source": "T13n0397_055:0364a07_1"
    },
    {
        "source_sentence": "佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "The Buddha and the crowd all praised him, saying, Good, good!",
        "source": "T13n0397_055:0364a08_2"
    },
    {
        "source_sentence": "爾時，世尊告因陀夜叉大將、蘇摩大將、婆樓那大將、波闍鉢帝大將、跋羅頭婆闍大將、伊奢那大將、旃檀那大將、月眼大將、婆多竭梨大將、奚摩跋多大將言：「汝等各住本宮護持養育我之正法。」",
        "translation": "It was then that the Bhagavān addressed the generals of Indra, Sumeru, Upananda, Vārāṇasī, Vajrapāṇi, Bṛhatphala, Vaiśravaṇa, Īśāna, Kaṇḍana, Yugjana, Bhadrika, and Kṣemabhadra, saying, You're each staying in your own palace to preserve",
        "source": "T13n0397_055:0364a10_0"
    },
    {
        "source_sentence": "時夜叉大將等各作是言：「唯然受教。",
        "translation": "The generals of the yakṣas and others then each said, Yes, they'll accept the teaching.",
        "source": "T13n0397_055:0364a14_1"
    },
    {
        "source_sentence": "大德婆伽婆！",
        "translation": "Venerable Bhagavān!",
        "source": "T13n0397_055:0364a15_2"
    },
    {
        "source_sentence": "我等護持養育安置世尊正法，及住法比丘供給所須，乃至剃髮不持戒者，",
        "translation": "World-honored One, we preserve and nurture the true-dharma of the World-honored One. As well as those monks who abide by the dharma, we provide whatever they need. We shave off all those who do not keep the precepts.",
        "source": "T13n0397_055:0364a15_3"
    },
    {
        "source_sentence": "亦復供給一切所須。",
        "translation": "They also provide whatever they need.",
        "source": "T13n0397_055:0364a17_4"
    },
    {
        "source_sentence": "為令佛法得久住故，紹三寶種不斷絕故，三種精氣得增長故，休息一切鬪諍、言訟、怨讐、疫病、飢饉短乏、非時亢旱、曜宿失度為斷除故，",
        "translation": "In order to cause the Buddha-dharma to abide for a long time, because it perpetually nourishes the seeds of the Three Jewels; in order to increase the vitality of the three kinds of energy; in order to eliminate all forms of fighting, verbal argumentation, enmity, epidemics, hunger, thirst, drought, and constellations.",
        "source": "T13n0397_055:0364a17_5"
    },
    {
        "source_sentence": "乃至世尊聲聞弟子三業相應不積聚者，當勤養育。」",
        "translation": "Even if the Bhagavān's śrāvaka disciples are associated with the three activities and don't accumulate them, they should diligently nurture them.",
        "source": "T13n0397_055:0364a20_6"
    },
    {
        "source_sentence": "爾時，世尊讚言：「善哉，善哉！",
        "translation": "At that point, the Bhagavān praised him, saying, Good, good!",
        "source": "T13n0397_055:0364a22_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_055:0364a22_1"
    },
    {
        "source_sentence": "汝等如是為利益安樂一切三界眾生故。」",
        "translation": "Do you do so for the benefit and welfare of all sentient beings in the three realms?",
        "source": "T13n0397_055:0364a22_2"
    },
    {
        "source_sentence": "及一切大眾，亦復讚言：「善哉，善哉！」",
        "translation": "And all the people in the crowd also praised it, saying, Good, good!",
        "source": "T13n0397_055:0364a23_3"
    },
    {
        "source_sentence": "爾時，世尊告一切畢利多依曠野住者、一切毘舍遮依空舍住者、一切富單那依野田住者、一切迦吒富單那依於塜間及廁邊住者言：「汝等各於住處護持養育我之正法。」",
        "translation": "It was then that the Bhagavān addressed all the people who lived in the wilderness in Pilinda, all the people who lived in Vaiśālī's house, all the people who lived in the wilderness in Pūrṇa's field, and all the people who lived in Kāṭapūrṇa's field at the entrance to the monastery or near the toilet, saying",
        "source": "T13n0397_055:0364a25_0"
    },
    {
        "source_sentence": "時畢利多等各作是言：「唯然受教。」",
        "translation": "The pratyekabuddhas then each said, Yes, I'll accept the teaching.",
        "source": "T13n0397_055:0364a28_1"
    },
    {
        "source_sentence": "佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "The Buddha and the crowd all praised him, saying, Good, good!",
        "source": "T13n0397_055:0364a29_2"
    },
    {
        "source_sentence": "爾時，世尊復作是言：「諸仁者！",
        "translation": "It was then that the Bhagavān again said, Gentlemen!",
        "source": "T13n0397_055:0364b02_0"
    },
    {
        "source_sentence": "所有諸天、乾闥婆、緊那羅、夜叉、羅剎、龍王、阿修羅、鳩槃茶，如昔世尊所分得分國土城邑聚落舍宅，",
        "translation": "All the gods, devas, gandharvas, kinnaras, yakṣas, rāṣṭrapālas, nāga kings, asuras, and kumbhāṇḍas that the Bhagavān divided his land, cities, towns, villages, and mansions in the past",
        "source": "T13n0397_055:0364b02_1"
    },
    {
        "source_sentence": "隨所得處為作護持安置養育，我當隨喜，一切大眾亦復隨喜。",
        "translation": "Wherever I obtain it, I'll make it safe, maintain it, place it, and nurture it, and I'll follow it, and all the masses will also follow it.",
        "source": "T13n0397_055:0364b04_2"
    },
    {
        "source_sentence": "若復有諸天、龍、夜叉乃至迦吒富單那等，如昔世尊所分得分國土城邑，",
        "translation": "Again, if there are gods, dragons, yakṣas, kaṭapūrṇas, and so forth, just as the Bhagavān has divided up land and cities in the past,",
        "source": "T13n0397_055:0364b06_3"
    },
    {
        "source_sentence": "不正護持安置養育者，我當轉付諸餘天龍，令其安置護持養育，各隨國土善作護持。",
        "translation": "If someone doesn't correctly guard, place, and nourish them, I will entrust it to the other gods and dragons, causing them to be placed, protected, and nurtured, each according to their own land and well-maintained.",
        "source": "T13n0397_055:0364b08_0"
    },
    {
        "source_sentence": "「我今以波羅奈國付囑善髮乾闥婆千眷屬，阿尼羅夜叉仙五百眷屬，須質多羅阿修羅無量眷屬，",
        "translation": "“Now, I entrust the kingdom of Vārāṇasī to a thousand members of the retinue of the good gandharvas, five hundred members of the retinue of the Aniruddhas, and an immeasurable number of members of the retinue of the asuras.",
        "source": "T13n0397_055:0364b09_1"
    },
    {
        "source_sentence": "德叉迦龍王百眷屬，大黑天女五百眷屬，汝等護持養育波羅奈國，為令我法得久住故，",
        "translation": "The dragon king Takshaka has a hundred members of his retinue, and the great black celestial maidens have five hundred members of their retinues. You should protect and nourish the country of Sorana in order to make my teaching endure for a long time.",
        "source": "T13n0397_055:0364b12_2"
    },
    {
        "source_sentence": "紹三寶種不斷絕故，遮障一切惡眾生故。」",
        "translation": "It's because the seeds of the Three Treasures are not cut off, and it's because they hinder all bad sentient beings.",
        "source": "T13n0397_055:0364b14_3"
    },
    {
        "source_sentence": "時善髮乾闥婆、阿尼羅夜叉仙、須質多羅阿修羅、德叉迦龍王、大黑天女等，",
        "translation": "Then Sudarśana, Aniruddha, the yakṣa sage Sucitara, the asura Kauṣṭhila, the dragon king Takshaka, and the great black celestial maiden.",
        "source": "T13n0397_055:0364b15_4"
    },
    {
        "source_sentence": "各與眷屬咸作是言：「大德婆伽婆！",
        "translation": "Each of them and their retinues all said, Bhadrapāla!",
        "source": "T13n0397_055:0364b16_5"
    },
    {
        "source_sentence": "我等護持養育安置波羅奈國周遍土境，遮障不饒益、養育饒益者，乃至遮障一切不善諸惡眾生。」",
        "translation": "We protect, nourish, and place them in the pervading land of Vārāṇasī, obstructing those who aren't benefited by hindrances and nurturing those who are benefited by nurturing, and even obstructing all unwholesome and bad sentient beings.",
        "source": "T13n0397_055:0364b17_6"
    },
    {
        "source_sentence": "爾時，世尊讚言：「善哉，善哉！」",
        "translation": "It was then that the Bhagavān praised him, saying, Good, good!",
        "source": "T13n0397_055:0364b20_0"
    },
    {
        "source_sentence": "諸來大眾亦復讚言：「善哉，善哉！」",
        "translation": "The assembled crowd also praised it, saying, Good, good!",
        "source": "T13n0397_055:0364b20_1"
    },
    {
        "source_sentence": "爾時，世尊以迦毘羅婆國付囑火護緊那羅仙千眷屬、拘翅羅聲乾闥婆萬眷屬、婆闥跋帝夜叉大將千眷屬、奢摩那遲阿修羅二萬眷屬、跋那牟支龍王一萬眷屬、摩訶鉢奢鳩槃茶大將五百眷屬、栴遲栴茶梨二大天女各一萬眷屬：「汝等共護迦毘羅婆國，",
        "translation": "At the time, the Bhagavān had entrusted the kingdom of Kapilavastu with a thousand members of the fire-protecting kiṃnara sage's retinue, ten thousand members of the Kauśinagara śrāvaka gandharva retinue, one thousand members of the great general Upagupta Yakṣa's retinue, twenty thousand members of the 20,000 members of the",
        "source": "T13n0397_055:0364b22_0"
    },
    {
        "source_sentence": "乃至遮障諸惡眾生。」",
        "translation": "It will even shield bad sentient beings from the hindrances.",
        "source": "T13n0397_055:0364b27_1"
    },
    {
        "source_sentence": "彼等一切皆作是言：「我等及諸眷屬，護持養育迦毘羅婆國周遍土境，",
        "translation": "They all said, We and our retinues will protect and nourish the kingdom of Kapilavastu throughout the whole land.",
        "source": "T13n0397_055:0364b28_2"
    },
    {
        "source_sentence": "乃至遮障諸惡眾生。」",
        "translation": "It will even shield bad sentient beings from the hindrances.",
        "source": "T13n0397_055:0364b29_3"
    },
    {
        "source_sentence": "佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "The Buddha and the crowd all praised him, saying, Good, good!",
        "source": "T13n0397_055:0364c01_4"
    },
    {
        "source_sentence": "爾時，世尊以摩伽陀國付囑善住炎光天子千眷屬、優波羅乾闥婆千眷屬、樂聲阿修羅千眷屬、善臂龍王善意龍王各萬眷屬、孔雀味阿修羅五百眷屬、拘那羅大夜叉三千眷屬、軍毘羅夜叉百千眷屬、十象鳩槃茶大將百千眷屬、懆惡天女奪意天女各十千眷屬：「汝等共護摩伽陀國，",
        "translation": "At the time, the Bhagavān had entrusted the kingdom of Magadha with a thousand retinues of the well-abiding celestial deity Sunetra, one thousand retinues of the celestial deity Upagupta gandharva, one thousand retinues of the celestial deity Suprabuddha, one thousand retinues of the celestial deity Sudarśana",
        "source": "T13n0397_055:0364c03_0"
    },
    {
        "source_sentence": "乃至遮障諸惡眾生。」",
        "translation": "It will even shield bad sentient beings from the hindrances.",
        "source": "T13n0397_055:0364c09_1"
    },
    {
        "source_sentence": "佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "The Buddha and the crowd all praised him, saying, Good, good!",
        "source": "T13n0397_055:0364c10_0"
    },
    {
        "source_sentence": "爾時，世尊以拘薩羅國付囑迷提羯那天子千眷屬、樂勝乾闥婆大將十千眷屬、烏麻緊那羅千眷屬、具德龍王千眷屬、弗沙鉢帝阿修羅五百眷屬、婆樓那夜叉大將婆樓那王夜叉大將各五萬眷屬、那荼迦鳩槃荼五百眷屬、摩尼毘梨天女千眷屬：「汝等共護拘薩羅國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Kośala with a thousand retinues of the Mahākramaṇa Maitreya's thousand retinues, 10,000 retinues of the general Prabhūtaratna, 10,000 retinues of the thousand retinues of the great general Uruma Kiṃnara, 1,000 retinues of the thousand retinues of the dragon king Kauṣṭhila,",
        "source": "T13n0397_055:0364c11_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0364c17_1"
    },
    {
        "source_sentence": "爾時，世尊以鴦伽國付囑月音天子萬眷屬、樂欲乾闥婆大將霑浮樓乾闥婆大將各十千眷屬、阿摩羅軍緊那羅五百眷屬、師子藏阿修羅五百眷屬、旃檀大夜叉力幢大夜叉各五千眷屬、奴羅車鳩槃荼二千五百眷屬、摩訶迦梨天女二千五百眷屬：「汝等共護鴦伽國土。」",
        "translation": "At the time, the Bhagavān entrusted the moon-soaring celestial son with ten thousand retinues of myriad retinues in Aṅga, 10,000 retinues for each of the generals of Jambudvīpa and Jambudvīpa, five hundred retinues for each of the five thousand retinues of Āmāra軍 Kiṃnara, five hundred retinues for each of the",
        "source": "T13n0397_055:0364c19_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0364c25_1"
    },
    {
        "source_sentence": "爾時，世尊以般遮羅國付囑羅拏時天子五百眷屬、樂歌乾闥婆七百眷屬、摩葉緊那羅千眷屬、般支迦夜叉將五千眷屬、安闍瞿波阿修羅千眷屬、樂法鳩槃茶五百眷屬、左黑天女王鬘天女各二千五百眷屬：「汝等共護般遮羅國。」",
        "translation": "At the time, the Bhagavān entrusted the five hundred members of the five hundred members of the five hundred members of the five hundred members of the five hundred members of the five hundred members of the five hundred members of the five hundred members of the five hundred members of the five hundred members of the five hundred members of the five hundred members of the five hundred members of the five hundred members of the five hundred members of",
        "source": "T13n0397_055:0364c27_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365a03_1"
    },
    {
        "source_sentence": "爾時，世尊以蘇摩國付囑寶髻天子五千眷屬、摩頭曼多乾闥婆千眷屬、勝縷緊那羅千眷屬、優波般遮迦夜叉將二千眷屬、黑龍王千眷屬、知欲阿修羅千眷屬、鳩羅婆鳩槃茶六百眷屬、斯多天女博叉天女各五百眷屬：「汝等共護蘇摩國土。」",
        "translation": "At the time, the Bhagavān entrusted the five thousand retinues of the jeweled-topknot celestial beings with the land of Sumeru, the 5,000 retinues of the Mahāmandhara gandharva thousand retinues, the 5,000 retinues of the superior thread kiṃnara thousand retinues, the 2,000 retinues of Upāsaka Kāśyapa Yakṣa",
        "source": "T13n0397_055:0365a05_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365a10_1"
    },
    {
        "source_sentence": "爾時，世尊以阿濕婆國付囑盧醯奴天子千二百眷屬、流水乾闥婆千眷屬、摩尼拓羅夜叉軍將五千眷屬、阿周羅阿修羅六百眷屬、日光龍王無量眷屬、摩尼拓利鳩槃茶五百眷屬、不可取天女馬勝天女各二千五百眷屬：「汝等共護阿濕婆國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Aśva with a thousand two hundred retinues of the celestial sons of Śākyamuni, a thousand retinues of the dry-water gandharvas, 5,000 retinues of the five thousand retinues of the generals of the maṇi-tulā yakṣa army, 600 retinues of the six hundred retin",
        "source": "T13n0397_055:0365a12_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365a17_1"
    },
    {
        "source_sentence": "爾時，世尊以摩偷羅國付囑善擇天子十千眷屬、靜明乾闥婆千眷屬、遊梯迦緊那羅二百眷屬、勝欲夜叉乘人大夜叉各千五百眷屬、無垢龍王千眷屬、伽楞拓利阿修羅千眷屬、墨色鳩槃茶千眷屬、奪意天女二千眷屬：「汝等共護摩偷羅國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Kapilavastu with  10,000 retinues of the good-choosing celestial sons, 1,000 retinues of the Jīvaka gandharva, 2,000 retinues of the two hundred retinues of Kārttika kiṃnara, 1,000 retinues of each of the 1,500 retinues of the Mahāprajñā",
        "source": "T13n0397_055:0365a19_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365a24_1"
    },
    {
        "source_sentence": "爾時，世尊以支提耶國付囑善賢天子五百眷屬、阿吒迦乾闥婆五百眷屬、無垢緊那羅千眷屬、除結夜叉無結夜叉各五百眷屬、妙賢龍千眷屬、普竹阿修羅五百眷屬、牛王鳩槃茶三百眷屬、勝優波羅天女千眷屬：「汝等共護支提耶國。」",
        "translation": "At the time, the Bhagavān entrusted the five hundred retinues of the good and virtuous celestial sons in the kingdom of caitya, the five hundred retinues of the five hundred retinues of the aṭaka gandharva, the five hundred retinues of the five hundred retinues of the undefiled kiṃnara, the five hundred retinues of the five hundred",
        "source": "T13n0397_055:0365a26_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365b02_1"
    },
    {
        "source_sentence": "爾時，世尊以婆蹉國付囑月光天子十千眷屬、蓮華香乾闥婆千眷屬、摩陀那果緊那羅五千眷屬、大果夜叉五千眷屬、阿樓那龍千眷屬、惡樹阿修羅百眷屬、葉眼鳩槃茶五百眷屬、阿那迦華天女千眷屬：「汝等共護婆蹉國土。」",
        "translation": "At the time, the Bhagavān entrusted the ten thousand retinues of the moon-shining celestial son with the kingdom of Vātsīputra, the one thousand retinues of the lotus-incense gandharva, the five thousand retinues of the five thousand retinues of the maṇḍāna-fruit kiṃnara, the five thousand retinues of the",
        "source": "T13n0397_055:0365b04_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365b09_1"
    },
    {
        "source_sentence": "爾時，世尊以賒耶國付囑摩醯首羅天仙五千眷屬、不酒乾闥婆千眷屬、離垢緊那羅千眷屬、因陀羅夜叉蘇摩夜叉各二千五百眷屬、善現龍千眷屬、牟真隣陀阿修羅王五百眷屬、優波檀提鳩槃茶訖利迦賒鳩槃茶各二千五百眷屬、鬼子母天女善護天女各萬眷屬：「汝等共護賒耶國土。」",
        "translation": "At the time, the Bhagavān entrusted the five thousand retinues of the gods and sages Mahêśvara with the kingdom of Kauśinagara, the 5,000 retinues of the goddess Mahêśvara, the 5,000 retinues of the goddess Mahêśvara, the 5,000 retinues of the goddess Mahêśvara, the 5,000 retin",
        "source": "T13n0397_055:0365b10_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365b16_1"
    },
    {
        "source_sentence": "爾時，世尊以優禪尼國付囑月雲天子五百眷屬、門牟乾闥婆千眷屬、摩尼耳乾闥婆五百眷屬、五惡夜叉千眷屬、山臂龍王五百眷屬、木手阿修羅三百眷屬、善現鳩槃茶五百眷屬、毛齒天女千眷屬：「汝等共護優禪尼國。」",
        "translation": "At the time, the Bhagavān entrusted the five hundred retinues of the moon-cloud celestial sons, the five thousand retinues of the five bad yakṣas, the five thousand retinues of the mountain-armed dragon king, the five hundred retinues of the three hundred retinues of the wooden-handed asura, the five hundred retinues of the five hundred",
        "source": "T13n0397_055:0365b18_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365b23_0"
    },
    {
        "source_sentence": "爾時，世尊以修羅吒國付囑法華天子百千眷屬、具欲乾闥婆將萬眷屬、山怖緊那羅仙一百眷屬、難陀龍王十千眷屬、驢眼阿修羅五百眷屬、善燈大夜叉千眷屬、大肚鳩槃茶將千眷屬、安隱天女千眷屬：「汝等共護修羅吒國。」",
        "translation": "At the time, the Bhagavān entrusted a hundred thousand members of the Dharma Flower Deity's retinue with the kingdom of Shuraṭṭa, ten thousand members of the retinue of the dragon king Nanda, five hundred members of the retinue of the donkey-eyed asura, a thousand members of the retinue of the great yakṣa of the good lamp, a",
        "source": "T13n0397_055:0365b24_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365b29_1"
    },
    {
        "source_sentence": "爾時，世尊以摩訶羅仛(丑加反)國付囑孔雀髮天子五百眷屬、樂欲乾闥婆虎就乾闥婆各五百眷屬、乳味緊那羅百眷屬、主水龍王千眷屬、樂寶阿修羅五百眷屬、羖羝脚大夜叉軍那羅大夜叉各千眷屬、鉢頭摩迦鳩槃茶大將五百眷屬、婆樓尼大天女五千眷屬：「汝等共護摩訶羅仛國。」",
        "translation": "At the time, the Bhagavān entrusted the five hundred members of the Mahāratṛṣa kingdom to the five hundred members of the Mahāratṛṣa gods, the five hundred members of the Mahāratṛṣa king's household, the five hundred members of the Mahāratṛṣa king's household, the five hundred members of the Mahāratṛṣ",
        "source": "T13n0397_055:0365c02_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365c08_1"
    },
    {
        "source_sentence": "爾時，世尊以輸盧那國付囑千金天子千眷屬、善脇乾闥婆千眷屬、白色緊那羅五百眷屬、世辯夜叉千眷屬、大富鳩槃茶五百眷屬、極惡天女摩尼果天女各五百眷屬：「汝等共護輸盧那國。」",
        "translation": "It was then that the Bhagavān entrusted the kingdom of Śūrya to a thousand golden celestial sons with a thousand retinues, a thousand retinues of good-armed gandharvas, five hundred retinues of white kiṃnaras, a thousand retinues of worldly yakṣas, five hundred retinues of great wealthy kumbhāṇḍas, and five hundred",
        "source": "T13n0397_055:0365c10_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365c14_1"
    },
    {
        "source_sentence": "爾時，世尊以摩尼讇鞞國付囑華音天子五百眷屬、那羅延乾闥婆二百眷屬、摩醯首羅華緊那羅三百眷屬、團眼夜叉五百眷屬、波羅奈子阿修羅百眷屬、赤目鳩槃茶百眷屬、雪王天女百眷屬：「汝等共護摩尼讇(市瞻反)鞞國。」",
        "translation": "At the time, the Bhagavān entrusted the five hundred retinues of the Flower-Sound Celestial Son, two hundred retinues of Nārāyaṇa-gṛdhrakūṭa, 300 retinues of Mahêśvara-kāṇḍa, 500 retinues of Pūrṇasī asura, 100 retinues of the red-eyed kumbhāṇḍa,",
        "source": "T13n0397_055:0365c16_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365c21_1"
    },
    {
        "source_sentence": "爾時，世尊以波吒羅弗國付囑娑羅流支天子千眷屬、人華乾闥婆五百眷屬、摩尼瞿沙緊那羅三百眷屬、聲佉流支夜叉五百眷屬、娑羅地阿修羅五百眷屬、尸利瞿沙龍八百眷屬、浮流尼鳩槃茶百眷屬、毘樓池天女五百眷屬：「汝等共護波吒羅弗國。」",
        "translation": "At the time, the Bhagavān entrusted the country of Pāṭaliputra with a thousand retinues of the celestial sons of the Sāraruci gods, five hundred retinues of the human flower gandharvas, 300 retinues of the three hundred retinues of the Maṇi Goṣa kiṃnara, 500 retinues of the śrāvaka yakṣa",
        "source": "T13n0397_055:0365c22_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0365c27_1"
    },
    {
        "source_sentence": "(次鴦伽國下)爾時，世尊以乾陀羅國付囑火布天子三千眷屬、喜歌乾闥婆千眷屬、大勝緊那羅五百眷屬、師子髮夜叉五百眷屬、伊羅鉢龍王千眷屬、賢力龍王千眷屬、精氣主阿修羅五百眷屬、猨猴聲鳩槃茶百眷屬、摩尼天女頻頭天女各千眷屬：「汝等共護乾陀羅國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Gandhāra with the 3,000 retinues of the fire deities, the thousand retinues of the joy-singing gandharvas, the five hundred retinues of the great victorious kiṃnara gods, the five hundred retinues of the lion yakṣas, the thousand retinues of the irapa dragon king",
        "source": "T13n0397_055:0365c28_2"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366a05_3"
    },
    {
        "source_sentence": "爾時，世尊以阿槃提國付囑師子愛天子五千眷屬、摩羅曼多乾闥婆二千眷屬、勝目緊那羅百眷屬、蘇摩夜叉地行夜叉各千眷屬、氷加羅阿修羅三千眷屬、婆私陀荼龍千眷屬、軍那羅叉鳩槃茶百眷屬、憂波羅天女流泉天女各二千眷屬：「汝等共護阿槃提國。」",
        "translation": "At the time, the Bhagavān entrusted the five thousand retinues of the lion-craving celestial beings in Āpāda with the five thousand retinues of the lion-craving celestial beings in the kingdom of Āpāda, two thousand retinues of the Māra-maṇḍa-gṛdhrakūṭa, two thousand retinues of",
        "source": "T13n0397_055:0366a07_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366a13_0"
    },
    {
        "source_sentence": "爾時，世尊以婆樓挐跋帝國付囑雞娑利天子千眷屬、眾綵乾闥婆五百眷屬、博叉流支緊那羅二百眷屬、迦茶龍王憂波迦荼龍王各二千眷屬、毘摩阿修羅百眷屬、月焱鳩槃茶三百眷屬、自護天女摩尼頻頭天女各千眷屬：「汝等共護婆樓挐跋帝國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Vārāṇasī with a thousand retinues of Kṣālīputra gods, five hundred retinues of Kātyāyana and Upagupta dragon kings, two thousand retinues of Vimalakīrti, a hundred retinues of Vimalakīrti, 300 retinues of Kauṇḍapāṇḍa",
        "source": "T13n0397_055:0366a14_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366a19_1"
    },
    {
        "source_sentence": "爾時，世尊以帝跋尼國付囑師子齒天子五千眷屬、薩陀曼多乾闥婆五百眷屬、牟尼薩羅緊那羅百眷屬、摩尼賢夜叉滿賢夜叉各二千五百眷屬、鐵耳阿修羅五百眷屬、阿槃多鳩槃茶百眷屬、薩市尼天女般支天女各千眷屬：「汝等共護帝跋尼國。」",
        "translation": "At the time, the Bhagavān entrusted the five thousand retinues of the lion-toothed celestial being with the kingdom of Tivānī, the five thousand retinues of the gods and goddesses of Sātamāṇḍarī, the five hundred retinues of the five hundred retinues of Samantabhaṅga, two thousand five hundred retinues of each of",
        "source": "T13n0397_055:0366a21_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366a26_1"
    },
    {
        "source_sentence": "爾時，世尊以瞻波國付囑香雲天子并諸天仙一千眷屬、德鬘乾闥婆二百眷屬、求籌遮緊那羅百眷屬、堅毛夜叉五千眷屬、迦那迦阿修羅百眷屬、善現鳩槃茶近現鳩槃茶各五萬眷屬、什目天女五百眷屬：「汝等共護瞻波國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Campā to the gods and celestial sages named Gandhāra with 1,000 retinues of incense cloud deities and 1,000 retinues of celestial sages, 200 retinues of virtuous gandharvas, 100 retinues of Kauṣṭhila kiṃnara, 5,000 retinues of firm-haired yakṣa",
        "source": "T13n0397_055:0366a28_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366b04_1"
    },
    {
        "source_sentence": "爾時，世尊以悉都那國付囑赤雲天子千眷屬、霑浮樓乾闥婆五百眷屬、摩尼遮婆緊那羅百眷屬、難勝夜叉千眷屬、泥荼鳩支阿修羅五百眷屬、鞞[少\\/兔]迦鳩槃茶百眷屬、靜默天女善目天女各一千五百眷屬：「汝等共護悉都那國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Siddhârtha with a thousand retinues of the red cloud celestial sons, five hundred retinues of the Jambudvīpa goddesses, five hundred retinues of the Maheśvara kiṃnara, one thousand retinues of the difficult-to-overcome yakṣa, five hundred retinues of the nir",
        "source": "T13n0397_055:0366b05_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366b10_1"
    },
    {
        "source_sentence": "爾時，世尊以西地國付囑山眼天子二百眷屬、法喜乾闥婆百眷屬、藪支羅婆緊那羅百眷屬、大身夜叉千眷屬、執刀阿修羅百眷屬、止流鳩槃茶三百眷屬、金光天女黑光天女各二千五百眷屬：「汝等共護西地國土。」",
        "translation": "At the time, the Bhagavān entrusted two hundred retinues to the goddess of the mountain eye in the western land, one hundred retinues to the goddess of Dharma喜乾婆, one hundred retinues to the great-bodied yakṣa thousand retinues, one hundred retinues to the sword-wielding asuras, one hundred retinues to the three hundred retinues",
        "source": "T13n0397_055:0366b11_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366b15_1"
    },
    {
        "source_sentence": "爾時，世尊以富樓沙富羅國付囑阿羅脯斯天子千眷屬、難提乾闥婆百眷屬、淨眾緊那羅百眷屬、摩尼華夜叉千眷屬、迦荼龍王阿婆羅羅龍王各二千五百眷屬、大怖伽樓羅百眷屬、訖多孫地阿修羅五百眷屬、燒竹鳩槃茶五百眷屬、多盧斯天女三目天女各五百眷屬：「汝等共護富樓沙富羅國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Pūrousepura to the thousand retinues of the gods of Ārāprosy, the one thousand retinues of the three-eyed celestial maidens of Rūpadhātu, the one hundred retinues of the pure kiṃnaras, the one thousand retinues of the maṇi-flower yakṣa, the two",
        "source": "T13n0397_055:0366b17_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366b23_1"
    },
    {
        "source_sentence": "爾時，世尊以烏場國土付囑習音天子五百眷屬、華光乾闥婆三百眷屬、善怖緊那羅百眷屬、迦羅婆提夜叉五百眷屬、郎浮羅龍三百眷屬、遮曼池阿修羅百眷屬、曼陀果鳩槃荼百眷屬、呵梨帝天女染賢天女各五百眷屬：「汝等共護烏場國土。」",
        "translation": "At the time, the Bhagavān entrusted the five hundred retinues of the Śākyamuni gods in the land of Wuchang, 300 retinues of the three hundred retinues of the flower-shining gandharva, 300 retinues of the one hundred retinues of the well- terrified kiṃnara, 500 retinues of the five hundred retinues of the Kālô",
        "source": "T13n0397_055:0366b25_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366c01_1"
    },
    {
        "source_sentence": "爾時，世尊以寄薩離國付囑黑色天子千眷屬、金色乾闥婆百眷屬、跋那牟至緊那羅八十眷屬、散髮夜叉五百眷屬、力天龍王百眷屬、那佉遮利阿修羅百眷屬、無垢聲鳩槃茶八十眷屬、勝鍼天女蠍天女各五百眷屬：「汝等共護寄薩離國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Sāriputta with a thousand members of the Black God's retinue, a hundred members of the golden-colored gandharva retinue, eighty members of the retinue of Upagupta kiṃnara, five hundred members of the retinue of Saṃyakṣa, a hundred members of the retinue of the power",
        "source": "T13n0397_055:0366c03_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366c08_1"
    },
    {
        "source_sentence": "爾時，世尊以金性國付囑禪那離沙婆天子五百眷屬、摩那婆乾闥婆百眷屬、善稱緊那羅百眷屬、禪那離沙婆夜叉五百眷屬、寶冠阿修羅百眷屬、香意鳩槃茶八十眷屬：「汝等共護金性國土。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of gold nature to the five hundred retinues of the celestial sons of Cundarāva, the one hundred retinues of manabha gandharvas, the one hundred retinues of well-called kiṃnaras, the five hundred retinues of Cundarāva yakṣas, the one hundred retinues of jeweled",
        "source": "T13n0397_055:0366c10_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366c14_1"
    },
    {
        "source_sentence": "爾時，世尊以摩都羅國付囑歌讚天子百眷屬、五髻乾闥婆五百眷屬、威德緊那羅八十眷屬、堅鉾夜叉五百眷屬、氷伽羅阿修羅五百眷屬、賢目鳩槃茶百眷屬、霑浮樓天女五百眷屬：「汝等共護摩都羅國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Mathurā with a hundred retinues of singing praises to the celestial sons, five buddhas, five hundred retinues of gandharvas, eighty retinues of powerful kiṃnaras, five hundred retinues of hard-boating yakṣas, five hundred retinues of icy asuras, five hundred retin",
        "source": "T13n0397_055:0366c16_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366c20_1"
    },
    {
        "source_sentence": "爾時，世尊以藪離迦國付囑財目天子千眷屬、善頂乾闥婆百眷屬、賒摩鳩斯緊那羅五百眷屬、堅固夜叉五百眷屬、耶婆那夜叉千眷屬、無畏緊那羅百眷屬、跋羅頭婆闍夜叉五百眷屬、嚪婆何利阿修羅八百眷屬、瞿伽叉鳩槃茶三百眷屬、嚪婆何利羅剎五百眷屬、釋迦羅剎五百眷屬：「汝等共護藪離迦國。」",
        "translation": "At the time, the Bhagavān had entrusted the kingdom of Śulīyaka with a thousand retinues of the celestial being Kauṇḍinya, a hundred retinues of the good-ding gandharvas, five hundred retinues of the five hundred retinues of the āmakūṭas, five hundred retinues of the five hundred retinues of the firm yakṣas, one",
        "source": "T13n0397_055:0366c22_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0366c29_0"
    },
    {
        "source_sentence": "爾時，世尊以般遮囊伽羅國付囑婆婆叉天子千眷屬、月光乾闥婆百眷屬、圍目夜叉千眷屬、大雲阿修羅五百眷屬、訶奴闍鳩槃茶百眷屬、摩尼枳薩梨天女五百眷屬、多摩羅婆利天女千眷屬：「汝等共護般遮囊伽羅國。」",
        "translation": "At the time, the Bhagavān entrusted the thousand retinues of the Bakṣa Devānām-Indra gods, the hundred retinues of the moonlight gandharvas, the thousand retinues of the perimeter yakṣas, the five hundred retinues of the great cloud asura gods, the hundred retinues of the hungry kumbhāṇḍas, the five hundred",
        "source": "T13n0397_055:0367a01_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367a06_0"
    },
    {
        "source_sentence": "爾時，世尊以波斯國付囑檀[少\\/兔]師天子五千眷屬、拘毘羅乾闥婆三千眷屬、梨鞞摩師緊那羅千眷屬、住勇夜叉五百眷屬、那摩羅王夜叉五百眷屬、菴羅提他乾闥婆千眷屬、伊沙那時緊那羅千眷屬、竭娑拘支鳩槃茶四千眷屬、那羅斯羅剎五千眷屬、呵梨達羅剎二千眷屬：「汝等共護波斯國土。」",
        "translation": "At the time, the Bhagavān had entrusted the kingdom of Prasenajit with five thousand members of the assembly of the celestial deities named Dharma [lesser\\/rabbit] and the five thousand members of the assembly of the gods named Indra; the three thousand members of the assembly of Kaubila-gṛha; the 3,000 members of the",
        "source": "T13n0397_055:0367a07_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367a13_1"
    },
    {
        "source_sentence": "爾時，世尊以勅勤國土付囑佉樓那天子千眷屬、妙好乾闥婆五百眷屬、帝利迦緊那羅五百眷屬、三鉢夜叉二萬眷屬、怖畏夜叉十千眷屬、休流歇龍千眷屬、金耳阿修羅千眷屬、善林樹鳩槃茶千眷屬、金枳(金支反)薩羅羅剎五千眷屬：「汝等共護勅勤國土。」",
        "translation": "At the time, the Bhagavān entrusted the thousand members of the asura's retinue, the five hundred members of the wonderfully beautiful gandharva retinue, the five hundred members of the Tīrika kiṃnara retinue, 20,000 members of the 20,000 members of the 20,000 members of the 20,000 members of the 20,000 members of the 20,000 members of the 300-",
        "source": "T13n0397_055:0367a15_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367a20_1"
    },
    {
        "source_sentence": "爾時，世尊以叵耶那國付囑海怖天子千眷屬、那茶浮乾闥婆百眷屬、馬目緊那羅百眷屬、華齒夜叉二千眷屬、大齒夜叉千眷屬、憂波羅耳龍五百眷屬、動手阿修羅百眷屬、解脫鳩槃茶百眷屬、質摩只薩梨羅剎女五百眷屬、黑闇羅剎護門羅剎各二千五百眷屬、月光羅剎千眷屬：「汝等共護叵耶那國。」",
        "translation": "At the time, the Bhagavān had entrusted the kingdom of Kauśinagara with a thousand retinues of the gods of the sea of fear, one thousand retinues of the hundred retinues of Nāgârjuna-gṛdhrakūṭa, one hundred retinues of the horse-eye kiṃnara, two thousand retinues of the flower-toothed ya",
        "source": "T13n0397_055:0367a22_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367a28_1"
    },
    {
        "source_sentence": "爾時世尊以尸利耶摩國付囑黑髮天子百眷屬、金臂乾闥婆八十眷屬、風響緊那羅百眷屬、阿樓那夜叉千眷屬、八髮夜叉千眷屬、上踊龍王百眷屬、快作阿修羅百眷屬、香筒鳩槃荼五百眷屬、黑澤天女五百眷屬：「汝等共護尸利耶摩國。」",
        "translation": "It was then that the Bhagavān entrusted the kingdom of Śrīyama with a hundred retinues of the black celestial beings, 80 retinues of the golden-armed gandharvas, 100 retinues of the wind-sounding kiṃnara, 1,000 retinues of the aruṇa yakṣa thousand retinues, 8,000 retinues of the eight yakṣa thousand retinues",
        "source": "T13n0397_055:0367b01_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367b06_1"
    },
    {
        "source_sentence": "爾時，世尊以跋離迦國付囑赤銅色天子八百眷屬、媚眼乾闥婆百眷屬、鍼黑緊那羅百眷屬、牟耳夜叉五千眷屬、黟羅羯那龍百眷屬、息牛阿修羅百眷屬、阿毘拏薩利鳩槃茶五百眷屬、長苗天女妙勝天女各五百眷屬：「汝等共護跋離迦國。」",
        "translation": "At the time, the Bhagavān entrusted the eight hundred retinues of the red-copper celestial sons, the one hundred retinues of the pleasing-eyed gandharvas, the one hundred retinues of the amputated black kiṃnara, the five thousand retinues of the mouth-mouth yakṣa, the one hundred retinues of the hellocana dragon",
        "source": "T13n0397_055:0367b08_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367b13_1"
    },
    {
        "source_sentence": "爾時，世尊以罽賓那國付囑怖黑天子五十眷屬、五音乾闥婆千眷屬、水性緊那羅五百眷屬、廣執夜叉三萬眷屬、長生夜叉流雲解脫夜叉各二千五百眷屬、睺羅荼龍十千眷屬、欝金阿修羅千眷屬、陀樓跋尼鳩槃茶五百眷屬、正辯天女千眷屬、園林羅剎女十千眷屬：「汝等共護罽賓那國。」",
        "translation": "At the time, the Bhagavān entrusted the fifty retinues of the fearful black celestial beings in Kāśmīra, the five-voice gandharva thousand retinues, the five-thousand retinues of the water-natured kiṃnara, the 30,000 retinues of the extensively attached nightcrawler, the 2,500 retin",
        "source": "T13n0397_055:0367b15_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367b21_1"
    },
    {
        "source_sentence": "爾時，世尊以憂羅賒國付囑那羅摩乾闥婆百眷屬、五怖夜叉二千眷屬、尸利沙夜叉千眷屬：「汝等共護憂羅賒國。」",
        "translation": "It was then that the Bhagavān entrusted the kingdom of Urāṇasī with a hundred retinues of Nārama-gṛdhrakūṭa, two thousand retinues of the five fearsome yakṣas, and one thousand retinues of the Śāriputra yakṣas, saying, You all together protect the kingdom of Urāṇasī.",
        "source": "T13n0397_055:0367b23_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367b25_1"
    },
    {
        "source_sentence": "爾時，世尊以佉羅婆羅國付囑時蘭那乾闥婆百眷屬、華寶夜叉千眷屬、善樂目龍千眷屬、怖人鳩槃茶五百眷屬、順欲天女百眷屬；",
        "translation": "At that time the World-honored One entrusted the empire of Uttarakuru to the assembly of one hundred members of the assembly, namely, the rāṇa gandharvas and their retinues, the lotus treasure yakṣas (thousand members), the nāgas with one thousand members, the ghostly kumbhāṇḍas with five hundred members, and the",
        "source": "T13n0397_055:0367b27_0"
    },
    {
        "source_sentence": "「汝等共護佉羅婆羅國。」",
        "translation": "Together, you will protect the country of Kaḷārapura.",
        "source": "T13n0397_055:0367c01_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367c01_1"
    },
    {
        "source_sentence": "爾時，世尊以阿疎居迦國付囑牟尼佉利夜叉二千眷屬、好施羅剎千眷屬、婆稚龍五百眷屬、止雲鳩槃荼百眷屬、呵梨帝羅剎女千眷屬：「汝等共護阿疎居迦國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Aśoka to the  2,000 retinues of Muniṣṭrī Yakṣa, the thousand retinues of Kauṇḍinya, the five hundred retinues of Vātsī-nāga, the 100 retinues of Kālôdayin, the thousand retinues of Śākyamuni, and the thousand retinues of Hāritī R",
        "source": "T13n0397_055:0367c03_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367c06_1"
    },
    {
        "source_sentence": "爾時，世尊以達羅陀國付囑鞞婆達利乾闥婆百眷屬、道路夜叉黃頭夜叉勇健夜叉各千眷屬、跋陀龍王二千眷屬、孔雀毛龍王百眷屬、生解天女毛羅闍利天女各二百五十眷屬：「汝等共護達羅陀國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Darodha with a hundred members of the ten thousand members of the saṃ retinues of Nāgârjuna-dṛṣṭi gandharva, one thousand members of the twelve thousand members of the saṃ retinues of Bhadra-nāgaṇḍa, one hundred members of the saṃ retinues of Mahākau",
        "source": "T13n0397_055:0367c08_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367c12_1"
    },
    {
        "source_sentence": "爾時，世尊以弗梨沙國付囑奪意夜叉戒賢夜叉各五百眷屬、雲腹龍王三百眷屬、離惡鳩槃茶八十眷屬、搔跋質羅天女百眷屬：「汝等共護弗梨沙國。」",
        "translation": "At the time, the Bhagavān entrusted the state of Vṛjiṣa to the five hundred retinues of each of the five hundred retinues of the demonic yakṣas who snatched away their minds, the eighty retinues of the yakṣas who were disciplined and virtuous, the 300 retinues of the three hundred retinues of the cloud-bellied dragon king",
        "source": "T13n0397_055:0367c14_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367c17_1"
    },
    {
        "source_sentence": "爾時，世尊以伽賒國付囑持華乾闥婆摩睺羅伽乾闥婆各千眷屬、金枳(金支反)持夜叉毘持夜叉各二百五十眷屬、光掌龍王勝奪龍王各五百眷屬、阿樓尼天女華目天女各二百五十眷屬：「汝等共護伽賒國土。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Kātyāyana with a thousand members of the saṃ retinues of the goddess Mahāmaudgalyāyana and one thousand members of the saṃ retinue of the goddess Ā Rūpadhāturāṣṭrapāla, two hundred fifty members of the saṃ retinues of the goddess Mahāma",
        "source": "T13n0397_055:0367c19_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367c23_1"
    },
    {
        "source_sentence": "爾時，世尊以遮居迦國付囑劍婆羅龍王五百眷屬、極惡鳩槃茶百眷屬、那朱波毘舍遮百眷屬、星目羅剎女五百眷屬、天鎧餓鬼將二百眷屬、歇惡夜叉三百眷屬：「汝等共護遮居迦國。」",
        "translation": "At the time, the Bhagavān entrusted the five hundred retinues of the five hundred retinues of the sword dragon king Śubhavyūha, the hundred retinues of the hundred retinues of the most evil kumbhāṇḍa, the hundred retinues of the hundred retinues of the one hundred retinues of Na朱波比舍遮, the five hundred retinues of",
        "source": "T13n0397_055:0367c25_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0367c29_1"
    },
    {
        "source_sentence": "爾時，世尊以簁堤國付囑具足龍王善道龍王各百眷屬、堅目鳩槃茶百眷屬、八毘那耶迦天女一百眷屬、道神天女尸利天女各二百五十眷屬、珂貝天女安住天女各五十眷屬：「汝等共護簁堤國土。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Kauṇḍinya with a hundred retinues from each of the dragon kings of the full-featured dragon kings and the dragon kings of good destinies, a hundred retinues from each of the one hundred retinues of the eight vinayaka goddesses, two hundred and fifty retinues from each",
        "source": "T13n0397_055:0368a01_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0368a05_1"
    },
    {
        "source_sentence": "爾時，世尊以沙勒國付囑髮色天子百眷屬、護國乾闥婆百眷屬、佛護夜叉助雹夜叉各五百眷屬、孔雀項龍王百眷屬、山目龍女五百眷屬、訖利波賒鳩槃茶五百眷屬、持德天女龍護天女各二百五十眷屬：「汝等共護沙勒國土。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of Śāriputra with a hundred retinues of the colorful celestial beings, a hundred retinues of goddesses protecting the kingdom, a hundred retinues of gandharvas, five hundred retinues of buddhas protecting yakṣas and hail-bearing yakṣas, a hundred retinues of peacock",
        "source": "T13n0397_055:0368a07_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0368a12_1"
    },
    {
        "source_sentence": "爾時，世尊以于填國土付囑難勝天子千眷屬、散脂夜叉大將十千眷屬、羖羊脚大夜叉八千眷屬、金華鬘夜叉五百眷屬、熱舍龍王千眷屬、阿那緊首天女十千眷屬、他難闍梨天女五千眷屬：「毘沙門王神力所加，",
        "translation": "At the time, the Bhagavān had entrusted a thousand retinues to the celestial maidens of Anavatapta Heaven in the land of Jambudvīpa, 10,000 retinues to the general of the Saṃdhinirmita-vaśavartin yakṣas, 10,000 retinues to the eight thousand retinues of the large sheep-legged yakṣas, 8,000 retinues to",
        "source": "T13n0397_055:0368a13_0"
    },
    {
        "source_sentence": "共汝護持于填國土。」",
        "translation": "Together with you, we'll protect and uphold it in the land of填國土.",
        "source": "T13n0397_055:0368a17_1"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0368a18_2"
    },
    {
        "source_sentence": "爾時，世尊以龜茲國土付囑牟鎧天子千眷屬、黃頭大夜叉千眷屬、厭財羅剎女千眷屬、睺護大夜叉千眷屬、踈齒鳩槃茶千眷屬、尸利遮吒羅剎鹿齒羅剎各五百眷屬：「汝等共護龜茲國土。」",
        "translation": "At the time, the Bhagavān entrusted the land of Kauṣṭhila with a thousand retinues of the armor gods' sons, a thousand retinues of the yellow-headed great yakṣas, a thousand retinues of the disliked-causal Rāṣṭrapāla women, a thousand retinues of the guarding great yakṣas, a thousand retinues of the",
        "source": "T13n0397_055:0368a20_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉。」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0368a24_1"
    },
    {
        "source_sentence": "爾時，世尊以婆樓迦國付囑騫茶夜叉千眷屬、阿婆迦利鳩槃茶百眷屬、垂乳羅剎千眷屬：「汝等共護婆樓迦國。」",
        "translation": "It was then that the Bhagavān entrusted the kingdom of Vārāṇasī with a thousand members of the kṣatriya retinues, a hundred members of the abhikṣupāṇḍa retinue, and a thousand members of the milk-draining Rāṣṭrapāla retinue, saying, You all together protect the kingdom of Vārāṇasī.",
        "source": "T13n0397_055:0368a26_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0368a28_1"
    },
    {
        "source_sentence": "爾時，世尊以奚周迦國付囑王活乾闥婆五百眷屬、奚卑羅龍百眷屬：「汝等共護奚周迦國。」",
        "translation": "It was then that the Bhagavān entrusted the king of Hezhouka with the five hundred retinues of King Jīvaka and the five hundred retinues of Kāśyapa and the one hundred retinues of Kapilavastu, All of you, protect the kingdom of Hezhouka together.",
        "source": "T13n0397_055:0368b01_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0368b03_1"
    },
    {
        "source_sentence": "爾時，世尊以億尼國付囑勇健執蠡大夜叉將千眷屬、象耳龍王三千眷屬、吉迦知羅剎女雪池羅剎女各二千五百眷屬：「汝等共護億尼國土。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of the hundred million nuns to the great yakṣa Brahmā Śrīgarbha with a thousand retinues, the 3,000 retinues of the elephant-eared dragon king, the 3,000 retinues of the rāṣasasasas and the two thousand five hundred retinues of the rāṣasasasas",
        "source": "T13n0397_055:0368b04_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0368b07_1"
    },
    {
        "source_sentence": "爾時，世尊以鄯善國付囑阿羅知天子百眷屬、阿沙迦夜叉五千眷屬、無著羅剎女十千眷屬：「汝等共護鄯善國土。」",
        "translation": "It was then that the Bhagavān entrusted the hundreds of his retinues, 5,000 retinues of asākya yakṣas, 10,000 retinues of arhat goddesses, and 10,000 retinues of unattached Rāṣṭrapāla women with the good land of Kauśinagara, saying, Together, you should protect the good land of Kauśinagara.",
        "source": "T13n0397_055:0368b09_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0368b11_1"
    },
    {
        "source_sentence": "爾時，世尊以緊那羅國付囑赤目大夜叉十千眷屬、不動鳩槃茶千眷屬：「汝等共護緊那羅國。」",
        "translation": "At the time, the Bhagavān entrusted the kingdom of kiṃnara to 10,000 retinues of the great red-eyed yakṣas and 10,000 retinues of Akṣobhya Kumārajīva, saying, You're all protecting the kingdom of kiṃnara together.",
        "source": "T13n0397_055:0368b13_0"
    },
    {
        "source_sentence": "乃至佛及大眾咸皆讚言：「善哉，善哉！」",
        "translation": "Up to the Buddha and the masses all praised it, saying, Good, good!",
        "source": "T13n0397_055:0368b15_1"
    },
    {
        "source_sentence": "爾時，世尊以震旦國付囑毘首羯磨天子五千眷屬、迦毘羅夜叉大將五千眷屬、法護夜叉大將五千眷屬、堅目夜叉大將五千眷屬、大目夜叉大將五千眷屬、勇健軍夜叉大將五千眷屬、摩尼跋陀夜叉大將五千眷屬、賢滿夜叉大將五千眷屬、持威德夜叉大將五千眷屬、阿荼薄拘夜叉大將五千眷屬、般支迦夜叉大將五千眷屬、婆修吉龍王五千眷屬、須摩那果龍王五千眷屬、弗沙毘摩龍王五千眷屬、呵梨帝鬼子母天五千眷屬、伊羅婆雌大天女五千眷屬、雙瞳目大天女五千眷屬：「汝等賢首！",
        "translation": "At the time, the Bhagavān had entrusted five thousand members of the retinue of Vaiśravaṇa with the kingdom of China; five thousand members of the general Kapilavastu’s retinue; five thousand members of the general Dharmagupta’s retinue; five thousand members of the general Nirmāṇarati’s retinue; five thousand members of the general Mahāmaud",
        "source": "T13n0397_055:0368b16_0"
    },
    {
        "source_sentence": "皆共護持震旦國土。",
        "translation": "They all shared the same protection of the land of China.",
        "source": "T13n0397_055:0368b27_1"
    },
    {
        "source_sentence": "於彼所有一切觸惱、鬪諍、怨讐、忿競、言訟、兩陣交戰、飢饉、疫病、非時風雨、氷寒毒熱悉令休息，",
        "translation": "He caused them to rest from all their irritations, quarrels, enemies, angers, disputes, arguments, battles, famine, epidemics, unseasonable wind and rain, ice, cold, poisonous, and heat.",
        "source": "T13n0397_055:0368b28_2"
    },
    {
        "source_sentence": "遮障不善諸惡眾生瞋恚麁獷，苦辛澁觸無味等物悉令休息，令我法眼得久住故，",
        "translation": "It obstructs unwholesome sentient beings with anger and harshness, causing them to cease all kinds of things that are painful, pungent, tasteless, and so forth, thereby enabling my Dharma eye to abide for a long time.",
        "source": "T13n0397_055:0368c01_3"
    },
    {
        "source_sentence": "紹三寶種不斷絕故，三種精氣得增長故，利益安樂諸天人故，勤加護持。",
        "translation": "Because the seeds of the Three Jewels are not cut off, and because the three kinds of vital energy grow; because they bring benefit and happiness to gods and humans, they diligently protect them.",
        "source": "T13n0397_055:0368c03_0"
    },
    {
        "source_sentence": "以是因緣，汝等今世及以後世常得安樂。」",
        "translation": "Because of these causes and conditions, you'll always attain well-being in the present and future lives.",
        "source": "T13n0397_055:0368c04_1"
    },
    {
        "source_sentence": "毘首羯磨天子及與眷屬、迦毘羅大夜叉、法護夜叉、堅目夜叉、大目夜叉、勇健夜叉、摩尼跋陀夜叉、賢滿夜叉、持威德夜叉、阿荼薄拘夜叉、般支迦夜叉，",
        "translation": "Vaiśravaṇa and his retinues, the great yakṣas Kapilavastu, Dharmagupta, hard-eyed yakṣa, Mahāmaudgalyāyana, courageous yakṣa, maṇibhadra yakṣa, Samantabhadra yakṣa, maintaining authority yakṣa, āḍakūṭa yakṣa, paṇḍikā yakṣa.",
        "source": "T13n0397_055:0368c05_2"
    },
    {
        "source_sentence": "及與眷屬，婆修吉龍王、須摩那果龍王、弗沙毘摩龍王及與眷屬，呵梨帝鬼子母天、伊羅婆雌天女、雙瞳目天女及與眷屬，",
        "translation": "The dragon king Vasiṣṭha, the dragon king Sumanāgupta, the dragon king Puṣyamitra, the dragon king Puṣyamitra and their retinues, the goddesses Hāritī, the goddesses mother of ghosts, the goddesses Erāvattiya, the goddesses twin-piled-eyed eyes and their retinues.",
        "source": "T13n0397_055:0368c08_3"
    },
    {
        "source_sentence": "各作是言：「大德婆伽婆！",
        "translation": "Each of them said, Bhagavān!",
        "source": "T13n0397_055:0368c11_4"
    },
    {
        "source_sentence": "我等共護震旦國土，休息一切鬪諍乃至增長三種精氣。",
        "translation": "Together we will protect the land of China, cease all quarrels and disputes, and even increase the three kinds of vital energy.",
        "source": "T13n0397_055:0368c12_5"
    },
    {
        "source_sentence": "我等勤加護持養育，乃至世尊聲聞弟子三業相應不積聚者，倍復安置護持養育。」",
        "translation": "We diligently guard and nurture it, even if the Bhagavān's śrāvaka disciples who aren't accumulating what's associated with the three activities of karma are doubly placed to guard and nurture it.",
        "source": "T13n0397_055:0368c13_6"
    },
    {
        "source_sentence": "爾時，世尊讚言：「善哉，善哉！",
        "translation": "At that point, the Bhagavān praised him, saying, Good, good!",
        "source": "T13n0397_055:0368c16_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T13n0397_055:0368c16_1"
    },
    {
        "source_sentence": "汝應如是護持我法。」",
        "translation": "You should thus guard my teaching.",
        "source": "T13n0397_055:0368c16_2"
    },
    {
        "source_sentence": "諸來大眾亦復隨喜讚言：「善哉，善哉！」",
        "translation": "The great multitude of people who came also rejoiced and praised it, saying, Good, good!",
        "source": "T13n0397_055:0368c17_3"
    },
    {
        "source_sentence": "「諸仁者！",
        "translation": "Gentlemen!",
        "source": "T13n0397_055:0368c19_0"
    },
    {
        "source_sentence": "我以閻浮提一切國土，付囑諸天、乾闥婆、緊那羅、夜叉、龍王、阿修羅、鳩槃茶、諸天女等，",
        "translation": "I entrusted all the kingdoms of Jambudvfpa to the gods, gandharvas, kiṃnaras, yakṣas, nāga kings, asuras, kumbhāṇḍas, and other heavenly maidens.",
        "source": "T13n0397_055:0368c19_1"
    },
    {
        "source_sentence": "各令安置護持養育一切眾生。",
        "translation": "Each one causes them to place and protect all sentient beings.",
        "source": "T13n0397_055:0368c21_2"
    },
    {
        "source_sentence": "是故汝等諸大龍王不得分者，應當容忍莫恨。",
        "translation": "That's why you great dragon kings who won't be allowed to share it should tolerate it and not hate it.",
        "source": "T13n0397_055:0368c21_3"
    },
    {
        "source_sentence": "所謂娑伽羅龍王、阿那婆沓多龍王、伊羅跋龍王、婆樓那龍王、善住龍王、德叉迦龍王、恒河龍王、辛頭龍王、博叉龍王、私陀龍王、提首尼龍王、摩醯謨遮利龍王、金脇龍王、跋致蘇多龍王、弗婆鉢賒龍王、眾色雲龍王、拘那跋帝龍王、阿斯多龍王、遮彌羅龍王、香山龍王、那羅延面龍王、婆婆牟支龍王、那陀叉龍王，",
        "translation": "The so-called dragon king Sāgara, the dragon king Anavatapta, the dragon king Airāvatī, the dragon king Avalokitêśvara, the dragon king Varuṇa, the dragon king Shanshita, the dragon king Dekṣaka, the dragon king Ganges, the dragon king Xintou, the dragon king Bakṣa, the dragon",
        "source": "T13n0397_055:0368c22_4"
    },
    {
        "source_sentence": "如是等一百八十萬諸大龍王，住閻浮提不得分者，應當容忍莫恨。",
        "translation": "Such are the  1.8 million great dragon kings who live in Jambudvīpa and can't be divided, so they should tolerate it and not hate it.",
        "source": "T13n0397_055:0369a01_5"
    },
    {
        "source_sentence": "汝等各住本宮護持養育我之正法，當作利益一切眾生行。",
        "translation": "Each of you will stay in your own palace to preserve and nurture the right teaching for me, which will benefit all sentient beings.",
        "source": "T13n0397_055:0369a02_6"
    },
    {
        "source_sentence": "以是因緣，汝等今世及以後世自利利他。",
        "translation": "Because of these causes and conditions, you have benefited yourself and others in the present and future lives.",
        "source": "T13n0397_055:0369a04_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_055:0369a05_0"
    },
    {
        "source_sentence": "彼諸天、龍、乾闥婆、緊那羅、夜叉、阿修羅、鳩槃茶、天女、羅剎女等，",
        "translation": "Those goddesses, dragons, gandharvas, kiṃnaras, yakṣas, asuras, kumbhāṇḍas, heavenly maidens, rāṣṭrapāla maidens,",
        "source": "T13n0397_055:0369a05_1"
    },
    {
        "source_sentence": "隨其國土昔所住處，彼諸天龍乃至天女，為護彼彼諸國土故，安置養育一切眾生。",
        "translation": "Depending on where their lands used to live in the past, those gods and dragons or goddesses were placed there to nurture all sentient beings for the sake of protecting those lands.",
        "source": "T13n0397_055:0369a06_2"
    },
    {
        "source_sentence": "「是故汝等大夜叉王不得分者，應當容忍莫恨。",
        "translation": "Therefore, you great yakṣa kings who won't be allowed to share it should tolerate it and not hate it.",
        "source": "T13n0397_055:0369a08_3"
    },
    {
        "source_sentence": "所謂箭毛夜叉、賒羅毘夜叉、迦吒首利夜叉、婆羅目企夜叉、婆羅稚夜叉、婆摩羅夜叉、其梨迦吒夜叉、由梯迦夜叉、其梨呵夜叉、滿面夜叉、迦賒毘提夜叉、護國夜叉、樓迦夜叉、箭爪夜叉、波那流支夜叉、狼爪夜叉、師子怖夜叉、阿樓尼夜叉、修羅闍毘夜叉、阿茶闍梨夜叉、得叉梨師夜叉、灰手夜叉、蘇摩那虎夜叉、羅摩那時夜叉、惡叉尼棄羅夜叉、質多羅夜叉、佛護夜叉，",
        "translation": "所謂箭毛夜叉、羅毘夜叉、迦吒首利夜叉、婆羅目企夜叉、婆羅稚夜叉、婆摩羅夜叉、其梨迦吒夜叉、由梯迦夜叉、其梨呵夜叉、滿面夜叉、迦毘提夜叉、護國夜叉、樓迦夜叉、箭爪夜叉、波那",
        "source": "T13n0397_055:0369a09_4"
    },
    {
        "source_sentence": "如是等八頻婆羅諸夜叉大將，依閻浮提種種寺舍、園林、泉池、山巖、林藪、樹下安住不得分者，",
        "translation": "These eight generals of the yakṣa generals of Bimbisāra rely on the various temples, groves, springs, ponds, mountains, cliffs, forests, and trees in Jambudvfpa to abide there. They can't be separated.",
        "source": "T13n0397_055:0369a18_5"
    },
    {
        "source_sentence": "應當容忍莫恨，隨所住處乃至山林樹下各住本處，護持養育我之正法，",
        "translation": "You should tolerate and not resent it. Wherever you live, whether in the mountains, forests, or trees, wherever you are, upholding and nurturing the true-dharma of self.",
        "source": "T13n0397_055:0369a20_6"
    },
    {
        "source_sentence": "利益安樂一切眾生行。",
        "translation": "It's for the benefit and comfort of all sentient beings who practice.",
        "source": "T13n0397_055:0369a21_7"
    },
    {
        "source_sentence": "以是因緣，汝等今世及以後世自利利他。",
        "translation": "Because of these causes and conditions, you have benefited yourself and others in the present and future lives.",
        "source": "T13n0397_055:0369a22_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_055:0369a23_9"
    },
    {
        "source_sentence": "彼諸天、龍、乾闥婆、緊那羅、夜叉、阿修羅、鳩槃茶、天女、羅剎女等，",
        "translation": "Those goddesses, dragons, gandharvas, kiṃnaras, yakṣas, asuras, kumbhāṇḍas, heavenly maidens, rāṣṭrapāla maidens,",
        "source": "T13n0397_055:0369a23_10"
    },
    {
        "source_sentence": "隨其國土昔所住處，彼諸天龍乃至天女為護彼彼諸國土故，安置養育一切眾生。",
        "translation": "Depending on where their lands used to live in the past, those gods and dragons or goddesses were placed there to nurture all sentient beings for the sake of protecting those lands.",
        "source": "T13n0397_055:0369a24_11"
    },
    {
        "source_sentence": "「是故汝等諸阿修羅王不得分者，應當容忍莫恨。",
        "translation": "Therefore, you asura kings who won't be allowed to share it should tolerate it and not hate it.",
        "source": "T13n0397_055:0369a26_12"
    },
    {
        "source_sentence": "所謂羅睺羅阿修羅王、毘摩質多羅阿修羅王、波羅陀阿修羅王、睒婆利阿修羅王、牟真隣陀阿修羅王、須質多羅阿修羅王、跋稚毘盧遮那阿修羅王、悉利羅耆阿修羅王、黟羅跋支阿修羅王、瞿摩闍毘阿修羅王、毘茶叉阿修羅王、那耶遮利阿修羅王、伽闍彌羅阿修羅王、初羅檀茶阿修羅王、阿斯末羅阿修羅王、迦摩跌知阿修羅王、婆羅乾荼阿修羅王、畢他摩尼阿修羅王、波羅那佉阿修羅王、薩婆鴦伽叉阿修羅王、訖賒婆睺阿修羅王，",
        "translation": "所謂羅羅阿修羅王、毘摩質多羅阿修羅王、波羅陀阿修羅王、婆利阿修羅王、牟真隣陀阿修羅王、須質多羅阿修羅王、跋稚毘盧遮那阿修羅王、悉利羅耆阿修羅王、羅跋支阿修羅王、瞿摩闍毘",
        "source": "T13n0397_055:0369a27_13"
    },
    {
        "source_sentence": "如是等六萬那由他阿修羅王住閻浮提不得分者，應當容忍莫恨，各住本宮護持養育我之正法，",
        "translation": "In this way, those sixty thousand nayutas of the asura kings who live in Jambudvfpa and do not receive their allowances should be patient and not resentful. They each stay in their own palace to preserve and nourish our true-dharma.",
        "source": "T13n0397_055:0369b08_14"
    },
    {
        "source_sentence": "當作利益一切眾生行。",
        "translation": "He'll perform actions for the benefit of all sentient beings.",
        "source": "T13n0397_055:0369b11_15"
    },
    {
        "source_sentence": "以是因緣，汝等今世及以後世自利利他。",
        "translation": "Because of these causes and conditions, you have benefited yourself and others in the present and future lives.",
        "source": "T13n0397_055:0369b11_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T13n0397_055:0369b12_17"
    },
    {
        "source_sentence": "彼諸天、龍、乾闥婆、緊那羅、夜叉、阿修羅、鳩槃茶、天女、羅剎女等，",
        "translation": "Those goddesses, dragons, gandharvas, kiṃnaras, yakṣas, asuras, kumbhāṇḍas, heavenly maidens, rāṣṭrapāla maidens,",
        "source": "T13n0397_055:0369b12_18"
    },
    {
        "source_sentence": "隨其國土昔所住處，彼諸天龍乃至天女為護彼彼諸國土故，安置養育一切眾生。",
        "translation": "Depending on where their lands used to live in the past, those gods and dragons or goddesses were placed there to nurture all sentient beings for the sake of protecting those lands.",
        "source": "T13n0397_055:0369b14_19"
    },
    {
        "source_sentence": "「是故汝等諸大天女應當容忍莫恨。",
        "translation": "Therefore, you great celestial maidens should tolerate it and not hate it.",
        "source": "T13n0397_055:0369b16_20"
    },
    {
        "source_sentence": "所謂歇大天女、造光天女、地解天女、增護天女、解脫天女、增水天女、少熱天女、淨目天女、饒財天女、寶藏天女、摩尼爪天女、黑繩天女、隨時天女、王頂天女、天水天女、眼目天女、蓮華天女、憂曇婆羅天女、賒尸天女、明炬目天女、善意天女、難勝天女、勝目天女，",
        "translation": "They are the great goddesses of cessation, the goddesses of created light, the goddesses of earthly liberation, the goddesses of increasing protection, the goddesses of liberation, the goddesses of increasing water, the goddesses of little fever, the goddesses of pure eyes, the goddesses of abundant wealth, the goddesses of jewel",
        "source": "T13n0397_055:0369b16_21"
    },
    {
        "source_sentence": "如是等六十二百千諸大天女，依閻浮提種種塔寺、城邑、聚落、園林、泉池、河邊、山谷、大海邊住不得分者，",
        "translation": "These sixty-two hundred thousand great celestial maidens lived in the various towers, temples, cities, villages, parks, forests, fountains, rivers, valleys, and oceans of Jambudvfpa.",
        "source": "T13n0397_055:0369b22_22"
    },
    {
        "source_sentence": "汝等隨所住處各各於彼護持養育我之正法，汝等於彼所有怖畏、鬪諍、怨讎、飢饉、疫病、他方怨敵、非時風雨、氷寒毒熱悉令休息，",
        "translation": "“Friends, wherever you live, preserve and nurture the true-dharma for me. You will be freed from all fears, quarrels, enemies, hunger, famine, epidemics, hostilities, uncookedness, wind, rain, ice, cold, heat, poison, and cold.",
        "source": "T13n0397_055:0369b25_23"
    },
    {
        "source_sentence": "遮障不善諸惡眾生瞋恚麁獷，苦辛澁觸無味等物悉令休息，令我法眼久住世間，",
        "translation": "They obstruct unwholesome sentient beings with anger and harshness, cause them to cease all kinds of things that are painful, pungent, tasteless, and so forth, and cause my Dharma eye to remain in the world for a long time.",
        "source": "T13n0397_055:0369b28_24"
    },
    {
        "source_sentence": "紹三寶種不令斷絕，三種精氣增長熾然，利益安樂諸天人故勤加護持。",
        "translation": "He nourishes the seeds of the Three Treasures so that they won't be cut off, and the three kinds of vitality grow in fervor for the benefit and welfare of gods and humans, so he diligently guards them.",
        "source": "T13n0397_055:0369b29_25"
    },
    {
        "source_sentence": "以是因緣，汝等今世及以後世常得利益安樂眾生。」",
        "translation": "Because of these causes and conditions, you'll always attain benefit and well-being for sentient beings in the present and future lives.",
        "source": "T13n0397_055:0369c02_26"
    },
    {
        "source_sentence": "時彼六十二百千天女白佛言：「大德婆伽婆！",
        "translation": "The sixty-two hundred thousand celestial maidens then said to the Buddha, Bhagavān!",
        "source": "T13n0397_055:0369c03_27"
    },
    {
        "source_sentence": "我等護持養育佛法，休息鬪諍，增長一切三種精氣，乃至世尊聲聞弟子三業相應無所積聚者，",
        "translation": "World-honored One, we preserve and nurture the buddha-dharma, rest from strife and enmity, and increase all our three kinds of vital energy. Up to the point where there is no accumulation by the Bhagavat, śrāvaka disciple who is bound by the threefold action:",
        "source": "T13n0397_055:0369c04_28"
    },
    {
        "source_sentence": "我等勤加護持養育。」",
        "translation": "We diligently guard, maintain, and nourish them.",
        "source": "T13n0397_055:0369c06_29"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T13n0397_055:0369c07_30"
    },
    {
        "source_sentence": "善女人輩！",
        "translation": "Good women!",
        "source": "T13n0397_055:0369c07_31"
    },
    {
        "source_sentence": "汝等應當如是護持。」",
        "translation": "You should thus guard it.",
        "source": "T13n0397_055:0369c08_0"
    },
    {
        "source_sentence": "諸來大眾皆亦隨喜讚言：「善哉，善哉！」",
        "translation": "The assembled crowd also rejoiced and praised it, saying, Good, good!",
        "source": "T13n0397_055:0369c08_1"
    },
    {
        "source_sentence": "爾時，世尊復告一切諸天、乾闥婆乃至諸大天女言：「我今與汝息諸諍訟大陀羅尼心，",
        "translation": "At that point, the Bhagavān again addressed all the gods, the gandharvas, and even the great celestial maidens, saying, Now, I will give you a great dhāraṇī to stop your disputes.",
        "source": "T13n0397_055:0369c10_0"
    },
    {
        "source_sentence": "汝等以此陀羅尼心故，各於己國若曜宿失度，攝諸眾生令得敬信，一切鬪諍悉得休息。」",
        "translation": "Because of this dhāraṇī mind, each of you will be able to gather all sentient beings in your own country if they lose their salvation in the past or future lives and cause them to attain respect and faith so that all fights can be stopped.",
        "source": "T13n0397_055:0369c11_1"
    },
    {
        "source_sentence": "作是語已，即說呪曰：「哆地夜他　摩陀那　摩陀那　瞿摩陀那阿婆摩多　阿兮摩多　摩陀那佉　阿差摩坻波羅　賒摩帝　阿唎婆三摩摩帝尼佉摩帝　波賒摩帝　蘇遮囉拏摩帝阿毘婆摩帝　阿囉毘婆摩帝　悉陀頞他摩帝　叉婆摩帝　蘇婆呵」爾時，",
        "translation": "After he said this, he spoke the dhāraṇī, saying, Tathāgata-datta, mātyāyana, mātyāyana, āmadhāna, abhidharma, abhidharma, abhidharma, abhidharma, abhidharma, abhidharma, abhidharma, abhidharma, abhidharma, abhidharma",
        "source": "T13n0397_055:0369c13_2"
    },
    {
        "source_sentence": "娑婆世界主大梵天王，從坐而起向佛合掌頭面作禮而作是言：「大德婆伽婆！",
        "translation": "The lord of the sahā world, the great Brahma king, rose from his seat and faced the Buddha with his palms pressed together, bowed his head and face, and said, Bhadrapāla!",
        "source": "T13n0397_055:0369c21_3"
    },
    {
        "source_sentence": "我今復以大陀羅尼，降諸惡龍及惡鬼神，護持國土，遮障一切諸惡眾生。」",
        "translation": "Now, I'll use the great dhāraṇī to subdue bad dragons and bad spirits, protect my land, and shield all bad sentient beings.",
        "source": "T13n0397_055:0369c22_4"
    },
    {
        "source_sentence": "作是語已，即說呪曰：「哆地夜他　曇無囉牟嘍囉牟嘍　那伽牟嘍　那伽牟嘍　阿藪囉牟嘍　藥叉牟嘍鳩槃茶牟嘍　浮單那牟嘍　迦吒富單那牟嘍　阿耶婆牟嘍侯呵侯呵牟嘍　呵呵呵呵　牟厨帝藥叉牟嘍囉婆呵囉婆呵　囉婆呵　薩婆烏闍囉婆呵　蘇婆呵」爾時，",
        "translation": "After he said this, he spoke the dhāraṇī, saying, Tathāgata, Dharmakṣema, Dharmakṣema, Dharmakṣema, Dharmakṣema, Dharmakṣema, Dharmakṣema, Dharmakṣema, Dharmakṣema, Dharmakṣema, Dharmakṣema, Dharmakṣema, Dharmakṣema, Dharmakṣema, Dharmakṣ",
        "source": "T13n0397_055:0369c24_5"
    },
    {
        "source_sentence": "所有諸天、龍王、鳩槃茶、餓鬼、毘舍遮、富單那、迦吒富單那飲血食肉者，",
        "translation": "All the gods, nāga kings, kumbhāṇḍas, hungry ghosts, viśācīs, pratyekabuddhas, and kaṭapūrṇas who drink blood and eat flesh.",
        "source": "T13n0397_055:0370a02_6"
    },
    {
        "source_sentence": "皆悉驚怖憂愁恐懼，向佛合掌頭面禮足，而作是言：「唯願世尊，大悲覆護，",
        "translation": "They were all terrified and grieved, bowed their foreheads at the Buddha’s feet, and said: O World-honored One, may your great compassion cover us.",
        "source": "T13n0397_055:0370a03_7"
    },
    {
        "source_sentence": "我等云何復得存活？」",
        "translation": "How will we be able to survive?",
        "source": "T13n0397_055:0370a05_8"
    },
    {
        "source_sentence": "佛言：「汝等且莫憂愁，大地所有華果、五穀、藥草眾味清淨未食墮落地者，",
        "translation": "The Buddha said, Don't worry, for the flowers, fruits, five grains, and medicinal plants that are found in the earth have all tasted so purely that they haven't yet fallen to the ground.",
        "source": "T13n0397_055:0370a05_9"
    },
    {
        "source_sentence": "如是華果眾味精氣汝等食之足得活命。",
        "translation": "Such are the flavors, essences, and energy of flowers and fruits that you eat to attain your livelihood.",
        "source": "T13n0397_055:0370a07_10"
    },
    {
        "source_sentence": "若復有人作食清淨遺落在地，汝等亦當食其精氣而自充濟。",
        "translation": "If another person makes food pure and leaves it on the ground, you must also nourish their vitality and help yourself.",
        "source": "T13n0397_055:0370a08_11"
    },
    {
        "source_sentence": "復有我諸聲聞弟子修禪定者，以己善根呪願，汝等亦得色力精氣豐盛，",
        "translation": "“Furthermore, if there are my śrāvaka disciples who practice meditation by means of the dhāraṇī of their own roots of goodness, you too will attain physical strength and vitality with abundant energy.",
        "source": "T13n0397_055:0370a09_12"
    },
    {
        "source_sentence": "眷屬朋黨具足勢力。",
        "translation": "Their retinues and friends are fully endowed with power.",
        "source": "T13n0397_055:0370a11_13"
    },
    {
        "source_sentence": "若有施主施我弟子寺舍、園林、田地舍宅稱名呪願，汝當於彼與欲隨喜護持養育，",
        "translation": "If there's a donor who gives my disciple a monastery, a garden, a forest, or a farmhouse that's called a dhāraṇī vow, you must give it to him and want to follow his joy, uphold it, and nurture it.",
        "source": "T13n0397_055:0370a11_14"
    },
    {
        "source_sentence": "以是事故汝等宮殿當得增長。",
        "translation": "Because of this, your palaces will grow.",
        "source": "T13n0397_055:0370a13_15"
    },
    {
        "source_sentence": "若有施主施我弟子飲食衣服臥具湯藥受取之時稱名呪願，汝亦隨喜，以彼呪願汝隨喜故，",
        "translation": "If a donor gives food, drink, clothing, bedding, water, and medicine to my disciple who receives it, you'll likewise rejoice when he calls it a spell or vow, because that spell or vow will cause you to rejoice.",
        "source": "T13n0397_055:0370a14_16"
    },
    {
        "source_sentence": "汝等便得壽命增長、顏容增長、安樂增長、朋黨增長、勢力增長，汝等晝夜應當精勤護持養育如是施主及以受者。」",
        "translation": "You will then attain an increase in life span, an increase in appearance, an increase in well-being, an increase in friends, and an increase in strength, and you should diligently guard and nurture such a donor and recipient day and night.",
        "source": "T13n0397_055:0370a16_17"
    },
    {
        "source_sentence": "「兩足大法王，　　觀眾作是言：",
        "translation": "The two-legged great king of the Dharma, the assembled crowd said,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　帝釋汝問我，　　各隨與其分。",
        "translation": "Tīrṣa, ask me for my share, and I'll give you each one a share.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　天龍鳩槃茶，　　夜叉修羅剎，",
        "translation": "The devas, nāgas, kumbhāṇḍas, yakṣas, and rāṣas.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　閻浮諸國土，　　城邑眾聚落，",
        "translation": "In Jambudvīpa there are many cities, towns, villages, and monasteries.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　曠野諸樹林，　　山巖井泉池，",
        "translation": "In the wilderness, there are trees and forests, mountains, cliffs, wells, springs, and ponds.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　法眼得久住，　　諸惡令休息。",
        "translation": "The divine eye of the Teaching remains for a long time, Causing evil beings to rest.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　豐饒悉可樂，　　為於閻浮提，",
        "translation": "Their prosperity and well-being are all delightful For the sake of Jambudvīpa.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　四天中鬼神，　　付囑勤護持，",
        "translation": "The spirits of the four heavens Entrust to diligently preserve it.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　汝等捨眷屬，　　我復更分布。",
        "translation": "You have abandoned your followers, and I'll again distribute them.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　莫瞋怒嫉妬，　　與欲當隨喜，",
        "translation": "Don't become angry, angry, or jealous, and rejoice with desire.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　法喜禪味食。　　如是諸天眾，",
        "translation": "The Dharma is delighted with the taste of meditation and eats it.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　一切皆悉起，　　咸作如是言：",
        "translation": "All of them all arise: They all make the following statement:",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　我等為正法，　　護持閻浮提，",
        "translation": "We preserve Jambudvfpa for the sake of the true-dharma.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　聲聞具持戒，　　不為積聚者，",
        "translation": "śrāvakas fully observe the precepts, not accumulating them.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　剃頭不持戒，　　欲令法眼增，",
        "translation": "They don’t observe precepts, wanting to increase the eye of enlightenment.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　我等皆至心，　　勤加護養育。",
        "translation": "We wholeheartedly strive To protect and nourish them.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　導師告彼言：　　正法我滅後，",
        "translation": "The Guide told them, “After the parinirvāṇa of the self of the true-dharma,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　具滿五百年，　　堅固住解脫。",
        "translation": "For the full five hundred years, they'll firmly abide in liberation.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　五百年禪誦，　　五百造塔寺，",
        "translation": "He recited it in meditation for five hundred years and built five hundred stupas at temples.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　至後五百年，　　堅住於鬪諍。",
        "translation": "For the next five hundred years he remained firmly in battle.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　後時有剃頭，　　破戒無羞恥，",
        "translation": "At some point later, there's a head that breaks the precepts without shame.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　供養如是輩，　　亦得無量福。",
        "translation": "Making offerings to such a group will also bring immeasurable merit.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　譬如金無價，　　除金至銀寶，",
        "translation": "It's like gold that has no price, except for gold and silver treasures.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　鍮石偽銅鐵，　　白鑞及鉛錫，",
        "translation": "It's made of brass, stone, fake copper, iron, white zinc, lead, and tin.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　世間若無寶，　　錫鑞為最上。",
        "translation": "If there were no treasures in the world, a pearl of tin would be the highest.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　佛寶亦如是，　　最尊獨第一，",
        "translation": "The Buddha treasure is also like this, Most honored and unique.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　次寶辟支佛，　　羅漢餘證果，",
        "translation": "Next, the jeweled pratyekabuddhas, arhats, and other realized buddhas.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　得定淨持戒，　　破戒名字僧，",
        "translation": "Attaining concentration and pure observance of precepts, breaking the precepts is called a monk.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　深信求解脫，　　若能供養彼，",
        "translation": "If someone deeply believes in seeking liberation and can make offerings to them,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　不久住忍地，　　必速證菩提。",
        "translation": "Soon abiding in the stage of forbearance, they'll surely quickly realize enlightenment.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　六欲諸天子，　　寶國諸鬼神，",
        "translation": "The gods of the six desire heavens, the jeweled kingdom spirits,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　住林乾闥婆，　　海中十大龍，",
        "translation": "They live in the forest, like gandharvas and the ten great dragons of the ocean.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　十大鳩槃茶，　　夜叉十神通，",
        "translation": "The ten great kumbhāṇḍas, the yakṣas, and the ten supernormal powers.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　各住本宮殿，　　護持我正法。",
        "translation": "Each of them stayed in their own palace, preserving my true teaching.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　餓鬼住曠野，　　毘舍遮空室，",
        "translation": "Hungry ghosts live in the wilderness, Vaiśravaṇa's empty room,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　富單依野田，　　迦吒塚間住，",
        "translation": "Pūrṇa relied on a wild field and lived in the tomb of Kāṭa.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　如是各隨喜，　　依分皆護持。",
        "translation": "Each of these is thus joyful, and they all guard their parts accordingly.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　依分不正護，　　復勤惱於他，",
        "translation": "Their support is not well guarded, and they also diligently harm others.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　我以如是等，　　更轉付餘天。",
        "translation": "Because of these things, I'll pass them on to the other gods.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　諸龍夜叉眾，　　乾闥緊那羅，",
        "translation": "The dragons and yakṣas, the gandharvas and kiṃnaras,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　天女修羅等，　　羅剎鳩槃荼，",
        "translation": "The goddesses and so forth, Rāṣṭrapāla the kumbhāṇḍa,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　普遍諸國土，　　安置護養育。",
        "translation": "They pervade all lands, placing them in care and nurturing.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　迦毘波羅奈，　　摩伽拘薩羅，",
        "translation": "Kapilavastu, Mahākauṣṭhila,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　般遮鴦伽國，　　蘇摩阿濕婆，",
        "translation": "In the country of Parinirvāṇa and Aṅga, it's called Suma aśva.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　摩偷支提國，　　婆蹉及賒耶，",
        "translation": "Mātṛkātī, Vātsīputrīya and Kanyakubja.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　羅吒憂禪尼，　　羅仛輸盧那，",
        "translation": "Rāṣṭrapāla, the goddess of meditation, Rāṣṭrapāla,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　摩尼讇鞞國，　　乾陀波吒羅，",
        "translation": "The kingdom of Maṇiṣṭhila, Gandhārapāṭala,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　般提婆樓帝，　　跋尼悉都那，",
        "translation": "(Skt. panti-valokiteśvara, Upanissa Siddhāna,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　瞻波鉢浮尼，　　富樓沙富羅，",
        "translation": "Campāpāda-puṇi, Furuṣapura,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　烏場寄薩梨，　　金性摩都羅，",
        "translation": "The udumbara tree is entrusted to Sāriputta, the golden-natured mahoraga,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　波斯勅勤土，　　般遮囊伽羅，",
        "translation": "Prasenajit commands the land of diligence, parinirvāṇa-kaṅkara,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　尸利耶摩國，　　叵耶藪利迦，",
        "translation": "In the country of Ślīyama, in the kingdom of Vaiśravaṇa,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　罽賓跋利國，　　佉羅憂羅賒，",
        "translation": "The country of Kaśmīra and the country of Uttarakuru,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　伽賒遮居國，　　達羅弗離沙，",
        "translation": "In the country of Kātyāyana, there’s the village of Dharmapuriṣṭha.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　簁提沙勒國，　　婆樓兮周迦，",
        "translation": "The country of Kaṇḍisara is surrounded by Vārāṇasī.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　于填及鄯善，　　龜茲緊那羅，",
        "translation": "Udayana and Kauṣṭhila are good, Kucika and kiṃnara.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　震旦等國土，　　護持令安置。",
        "translation": "In the earthquakes and so forth, he protects and orders them to be placed.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　於此一切國，　　諸龍無分者，",
        "translation": "In all these lands, The dragons have no part:",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　一百八十萬，　　夜叉等無分，",
        "translation": "One hundred and eighty million, such as yakṣas and so forth have no parts.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　及八頻婆羅，　　修羅不得分，",
        "translation": "and the eight vibhāras, which the asura can't share.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　六萬那由他，　　天女等無分，",
        "translation": "Sixty thousand nayutas, goddesses and so forth have no parts.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　六十二百千。　　我今悉謝汝，",
        "translation": "Sixty-two hundred thousand. I now thank you for all of them.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　各住本宮殿，　　護持我正法。",
        "translation": "Each of them stayed in their own palace, preserving my true teaching.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　當與汝神呪，　　遮障惡眾生，",
        "translation": "I will give you a divine spell to shield evil sentient beings.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　休息諸惱害，　　一切鬪諍訟，",
        "translation": "He rests from all harmfulnesses, All the quarrels and disputes,",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　亢旱及水潦，　　病儉諸賊寇，",
        "translation": "drought drought and floods, disease and famine, thieves and invaders.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　增長三精氣，　　諸惡令休息，",
        "translation": "They increase the three vital energies, Causing evil to rest.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　護持我正法，　　熾然三寶種。",
        "translation": "They preserve my true teaching, blazing with the seeds of the Three Treasures.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　聲聞諸比丘，　　三業常相應，",
        "translation": "śrāvakas and bhikṣus are always associated with the three karmic activities.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　剃頭不持戒，　　一切皆護持。",
        "translation": "They shave their heads and don't observe precepts, but they all uphold them.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　為諸聲聞故，　　具捨諸田宅，",
        "translation": "For the sake of the śrāvakas, he gave up all his land and homes.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　飲食及湯藥，　　一切有所須，",
        "translation": "Whatever you need for food, drink, hot water, and medicine.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "　如是諸施主，　　汝等護養育。」",
        "translation": "Thus, these donors, you must protect and nurture them.",
        "source": "T13n0397_055:0370a20_0"
    },
    {
        "source_sentence": "爾時，世尊欲重明此義而說偈言：大方等大集經卷第五十五",
        "translation": "At that time, wishing to elaborate on the meaning of this further, the Buddha said in verse:",
        "source": "T13n0397_055:0370a20_0"
    }
]