[
    {
        "source_sentence": "大方等大集經卷第六十",
        "translation": "*Mahāmegha-sūtra, Volume 60",
        "source": "T13n0397_060:0401a21_0"
    },
    {
        "source_sentence": "高齊天竺三藏那連提耶舍譯",
        "translation": "Translated by the translator Nārāyaśas of the Tripiṭaka of Gaoqi Tianzhusa",
        "source": "T13n0397_060:0401a23_0"
    },
    {
        "source_sentence": "十方菩薩品之二",
        "translation": "Two Parts of the Chapter on the Bodhisattvas of the Ten Directions",
        "source": "T13n0397_060:0401a24_0"
    },
    {
        "source_sentence": "佛言：「菩薩坐禪數息不得定意、得定意不久，但坐不斷本罪故使禪不安。」",
        "translation": "The Buddha said, A bodhisattva doesn't attain concentration for a long time while he's sitting in meditation and doesn't attain concentration for a long time, but his seat doesn't stop because of the original sin that causes meditation to become rest",
        "source": "T13n0397_060:0401a25_0"
    },
    {
        "source_sentence": "菩薩自言：「我何因緣本罪不斷？」",
        "translation": "The bodhisattva said to himself, What are the causes and conditions for my original sins not being stopped?",
        "source": "T13n0397_060:0401a26_1"
    },
    {
        "source_sentence": "佛言：「用菩薩坐不校計斷生死，故令本罪不斷。」",
        "translation": "The Buddha said, Because the bodhisattva's seat doesn't calculate birth and death by stopping birth and death, it causes the original sin not to continue.",
        "source": "T13n0397_060:0401a27_2"
    },
    {
        "source_sentence": "佛言：「欲斷本罪者，當斷當來生死意，當滅本罪生死意。」",
        "translation": "The Buddha said, If you want to stop the original sin, you must stop the mind of birth-and-death in the future and extinguish the mind of birth-and-death in the original sin.",
        "source": "T13n0397_060:0401a28_3"
    },
    {
        "source_sentence": "諸菩薩問佛言：「何等當斷當來生死意、當滅本罪生死意？」",
        "translation": "The bodhisattvas asked the Buddha, What's the intention to cut off future birth-and-death and extinguish the original sin of birth-and-death?",
        "source": "T13n0397_060:0401a29_4"
    },
    {
        "source_sentence": "佛言：「心所動為本罪轉得因緣，為當來生死罪。",
        "translation": "The Buddha said, What's moved by the mind is the cause and condition for the original sin to be transformed into a future sin of birth-and-death.",
        "source": "T13n0397_060:0401b01_5"
    },
    {
        "source_sentence": "要當斷當來生死乃應菩薩。」",
        "translation": "Only when he stops future birth and death should he become a bodhisattva.",
        "source": "T13n0397_060:0401b03_0"
    },
    {
        "source_sentence": "諸菩薩皆稽首言：「願佛當復為我解當來生死罪。」",
        "translation": "The bodhisattvas all bowed their heads and said, May the Buddha again understand for me the sin of future birth-and-death.",
        "source": "T13n0397_060:0401b03_1"
    },
    {
        "source_sentence": "佛告諸菩薩：「心所動得因緣合，中有盛百八生死。",
        "translation": "The Buddha told the bodhisattvas, When the causes and conditions for moving the mind come together, there's one hundred and eight births and deaths in it.",
        "source": "T13n0397_060:0401b04_2"
    },
    {
        "source_sentence": "菩薩要當斷是盛百八生死；",
        "translation": "The essentials of enlightening beings’ annihilation are the one hundred and eight forms of birth and death.",
        "source": "T13n0397_060:0401b05_3"
    },
    {
        "source_sentence": "菩薩意所動得因緣，不能遠意，中有盛百八生死，菩薩要當斷是盛百八生死。",
        "translation": "The bodhisattva's mind is moved by the causes and conditions for attaining it, but he can't get rid of the 108 births and deaths that flourish in his mind, and the bodhisattva must stop these 108 births and",
        "source": "T13n0397_060:0401b06_4"
    },
    {
        "source_sentence": "「菩薩為本識動，復欲識中有盛百八生死，菩薩要當斷是盛百八生死。",
        "translation": "When the bodhisattva's original consciousness moves, there are 108 births and deaths floating in the desire consciousness, and when the bodhisattva stops them, there are 108 births and deaths floating in the conscious",
        "source": "T13n0397_060:0401b08_5"
    },
    {
        "source_sentence": "「轉入眼，菩薩眼所見好色為本，好色動欲分別中有盛百八生死，菩薩要當斷是盛百八生死；",
        "translation": "“The enlightening being’s eye is founded on the seeing of good and bad images by the bodhisattva. Good and bad images, movement and desire are present in one hundred and eight forms of birth and death; when a bodhisattva abandons",
        "source": "T13n0397_060:0401b09_6"
    },
    {
        "source_sentence": "眼所見中色為本，中色動欲分別中有盛百八生死，菩薩要當斷是盛百八生死；",
        "translation": "What is seen by the eye, it is with matter as basis. With matter in the middle, there are one hundred and eight forms of birth and death that occur in the discrimination of movement and desire. If enlightening beings were to eliminate this, they would",
        "source": "T13n0397_060:0401b12_0"
    },
    {
        "source_sentence": "眼所見惡色為本，惡色動欲分別中有盛百八生死，菩薩要當斷是盛百八生死。",
        "translation": "Bad form that's seen by the eye is the root, and there are 108 births and deaths in bad form, movement, desire, and discrimination, which bodhisattvas must stop because they have 108 births and deaths.",
        "source": "T13n0397_060:0401b13_1"
    },
    {
        "source_sentence": "「轉入耳，菩薩耳所聞好聲為本，好聲動欲分別中有盛百八生死，菩薩要當斷是盛百八生死；",
        "translation": "Entering and entering the ear is the root of the good sounds that are heard by the bodhisattva’s ear. The sound of these good sounds moves within one hundred and eight forms of birth and death in the discrimination of desire.",
        "source": "T13n0397_060:0401b15_2"
    },
    {
        "source_sentence": "耳所聞中聲為本，中聲動欲分別中有盛百八生死，菩薩要當斷是盛百八生死；",
        "translation": "The sound of what the ear hears from the middle is the root, and within that sound there are one hundred and eight forms of birth and death in the discrimination of craving.",
        "source": "T13n0397_060:0401b17_3"
    },
    {
        "source_sentence": "耳所聞惡聲為本，惡聲動欲分別中有盛百八生死，菩薩要當斷是盛百八生死。",
        "translation": "Bad sounds heard by the ear are the root, and bad sounds that move in the discrimination of desire contain a hundred and eight births and deaths, which are the one hundred and eight births and deaths that bodhisattvas must stop.",
        "source": "T13n0397_060:0401b19_4"
    },
    {
        "source_sentence": "「轉入鼻，菩薩鼻所聞好香為本，好香動欲分別中有盛百八生死，菩薩要當斷是盛百八生死；",
        "translation": "“When one turns to the nose and enters it, a good odor that is heard by the bodhisattva’s nose is the foundation of his body. Within this good odor, there are one hundred and eight forms of birth and death",
        "source": "T13n0397_060:0401b21_5"
    },
    {
        "source_sentence": "鼻所聞中香為本，中香動欲分別中有盛百八生死，菩薩要當斷是盛百八生死；",
        "translation": "The middle odor that the nose perceives is the root, and within this middle odor there are one hundred and eight forms of birth-and-death.",
        "source": "T13n0397_060:0401b23_6"
    },
    {
        "source_sentence": "鼻所聞惡臭為本，惡臭動欲分別中有盛百八生死，菩薩要當斷是盛百八生死。",
        "translation": "The bad odor that the nose hears is the root, and there's a hundred and eight births and deaths in the discrimination of bad odors and desires, which are the one hundred and eight births and deaths that the bodhisattva",
        "source": "T13n0397_060:0401b25_7"
    },
    {
        "source_sentence": "「轉入口，菩薩口所得美味好語言為本，美味好語言動欲分別中有盛百八生死，",
        "translation": "\\",
        "source": "T13n0397_060:0401b27_8"
    },
    {
        "source_sentence": "菩薩要當斷是盛百八生死；",
        "translation": "The essentials of enlightening beings’ annihilation are the one hundred and eight forms of birth and death.",
        "source": "T13n0397_060:0401b29_0"
    },
    {
        "source_sentence": "口所得中味中語言為本，中味中語言動欲分別中有盛百八生死，菩薩要當斷是盛百八生死；",
        "translation": "The middle taste of verbal action is the root, and within that middle taste there are one hundred and eight forms of birth and death. When enlightening beings abandon it, they will be filled with one hundred and eight forms of birth and death.",
        "source": "T13n0397_060:0401b29_1"
    },
    {
        "source_sentence": "口所得惡味惡語言為本，惡味惡語言動欲分別中有盛百八生死，菩薩要當斷是盛百八生死。",
        "translation": "Bad taste and bad speech that's verbally obtained are the root, and bad taste and bad speech that moves in the discrimination of desire contain one hundred and eight births and deaths, which are the full set of one hundred and eight births and deaths",
        "source": "T13n0397_060:0401c02_2"
    },
    {
        "source_sentence": "「轉入身，身所得好細軟可身為本，細軟動欲分別中有盛百八生死，菩薩要當斷是盛百八生死；",
        "translation": "“In the body of enlightening beings, gross and subtle sensations acquired by the body are the foundation of the body. The differentiation of fine and subtle sensations is the root of one hundred and eight forms of birth-and-death.",
        "source": "T13n0397_060:0401c05_0"
    },
    {
        "source_sentence": "身所得中細軟為本，中細軟動欲分別中有盛百八生死，菩薩要當斷是盛百八生死；",
        "translation": "The middle subtle and minor bodily attainments are the root, while the middle subtle and minor bodily cravings have within them one hundred and eight forms of birth and death.",
        "source": "T13n0397_060:0401c07_1"
    },
    {
        "source_sentence": "身所得惡麁堅苦痛不可身為本，惡麁堅苦痛不可身動欲分別中有盛百八生死，",
        "translation": "The pain and suffering of bad abscesses that are obtained from the body cannot be the origin of the body, and the pain and suffering of bad abscesses can't be the basis of the body.",
        "source": "T13n0397_060:0401c09_2"
    },
    {
        "source_sentence": "菩薩要當斷是盛百八生死。」",
        "translation": "The bodhisattva's essential point of cessation is the completion of one hundred and eight births and deaths.",
        "source": "T13n0397_060:0401c11_3"
    },
    {
        "source_sentence": "佛言：「菩薩要當斷是乃應菩薩，不斷者不應為菩薩，如是尚未解。」",
        "translation": "The Buddha said, If a bodhisattva wants to stop this, then he should be a bodhisattva, and if he doesn't stop it, he shouldn't be a bodhisattva; thus, he hasn't understood it yet",
        "source": "T13n0397_060:0401c11_4"
    },
    {
        "source_sentence": "諸菩薩報佛言：「我已解因緣。」",
        "translation": "The bodhisattvas replied to the Buddha, I've understood the causes and conditions.",
        "source": "T13n0397_060:0401c13_5"
    },
    {
        "source_sentence": "諸菩薩言：「我聞佛所說，我一切不墮罪中。」",
        "translation": "The bodhisattvas said, I've heard what the Buddha teaches, and I won't fall into sin.",
        "source": "T13n0397_060:0401c13_6"
    },
    {
        "source_sentence": "佛問諸菩薩：「汝寧見菩薩髠頭剔鬚作沙門者不？」",
        "translation": "The Buddha asked the bodhisattvas, Do you see a bodhisattva who shaved his hair and beard to become a monk?",
        "source": "T13n0397_060:0401c14_7"
    },
    {
        "source_sentence": "諸菩薩言：「然見作沙門。」",
        "translation": "The bodhisattvas said, Still, they're seen as as ascetics.",
        "source": "T13n0397_060:0401c15_8"
    },
    {
        "source_sentence": "佛問諸菩薩：「沙門當髠頭剔鬚時，沙門頭鬚了盡[歹*斯]不？」",
        "translation": "The Buddha asked the bodhisattvas, When the ascetic shaves his hair and beard at the end of his hair, does the ascetic's hair and beard completely [gṛha*s]?",
        "source": "T13n0397_060:0401c16_9"
    },
    {
        "source_sentence": "諸菩薩言：「盡[歹*斯]。」",
        "translation": "The bodhisattvas said, Enough [such*s].",
        "source": "T13n0397_060:0401c17_10"
    },
    {
        "source_sentence": "佛言：「當盡[歹*斯]時，沙門寧願復欲使頭鬚生不？」",
        "translation": "The Buddha said, When [this] ends, would the ascetic wish to have his hair and beard grow again?",
        "source": "T13n0397_060:0401c18_11"
    },
    {
        "source_sentence": "諸菩薩言：「沙門不願使生。」",
        "translation": "The bodhisattvas said, An ascetic doesn't wish to be born.",
        "source": "T13n0397_060:0401c19_12"
    },
    {
        "source_sentence": "佛問諸菩薩：「頭鬚髮何以故復生？」",
        "translation": "The Buddha asked the bodhisattvas, What's the reason for your hair and beard to grow back?",
        "source": "T13n0397_060:0401c19_13"
    },
    {
        "source_sentence": "諸菩薩言：「自然生，沙門亦不使生。」",
        "translation": "The bodhisattvas said, It's naturally produced, and the ascetic doesn't cause it to be produced either.",
        "source": "T13n0397_060:0401c20_14"
    },
    {
        "source_sentence": "佛言：「沙門頭鬚髮生，寧能自知日長幾分？」",
        "translation": "The Buddha said, How long does the ascetic's hair and beard grow, so how much longer can he know for himself?",
        "source": "T13n0397_060:0401c21_15"
    },
    {
        "source_sentence": "諸菩薩報佛言：「沙門頭鬚髮生，不能自知日長幾分？」",
        "translation": "The bodhisattvas replied to the Buddha, An ascetic's hair and beard grow, so he can't know for himself how many parts a day long it is?",
        "source": "T13n0397_060:0401c22_16"
    },
    {
        "source_sentence": "佛言：「菩薩不能自覺微微盛百八罪行，譬如沙門自有頭髮生不知日長幾分；",
        "translation": "The Buddha said: A bodhisattva cannot perceive for himself the subtlety of one hundred and eight kinds of sinful deeds.",
        "source": "T13n0397_060:0401c23_17"
    },
    {
        "source_sentence": "如是菩薩罪坐不能自知，言我無罪者云何？」",
        "translation": "Thus, the bodhisattva's sinful seat can't know for himself, so what happens when he says I'm sinless?",
        "source": "T13n0397_060:0401c25_18"
    },
    {
        "source_sentence": "佛問諸菩薩：「寧有是不？」",
        "translation": "The Buddha asked the bodhisattvas, How could there be none?",
        "source": "T13n0397_060:0401c26_19"
    },
    {
        "source_sentence": "諸菩薩即稽首慚受行。",
        "translation": "The bodhisattvas then bowed their heads in shame and accepted the practice.",
        "source": "T13n0397_060:0401c26_20"
    },
    {
        "source_sentence": "諸菩薩報佛言：「願佛當復為我解。」",
        "translation": "The bodhisattvas replied to the Buddha, May the Buddha again understand for me.",
        "source": "T13n0397_060:0401c28_0"
    },
    {
        "source_sentence": "佛言：「菩薩不可自怙言我無罪、罪滅。」",
        "translation": "The Buddha said, A bodhisattva shouldn't rely on himself to say that I'm blameless and sins are extinguished.",
        "source": "T13n0397_060:0401c28_1"
    },
    {
        "source_sentence": "佛言：「要校計百八本罪滅不滅。」",
        "translation": "The Buddha said, It's necessary to calculate the 108 original sins that are extinguished and not extinguished.",
        "source": "T13n0397_060:0401c29_2"
    },
    {
        "source_sentence": "菩薩問佛：「何等為百八本罪滅不滅？」",
        "translation": "The bodhisattva asked the Buddha, What are the 108 original sins that are extinguished and not extinguished?",
        "source": "T13n0397_060:0402a01_3"
    },
    {
        "source_sentence": "佛言：「菩薩心生轉便滅，滅中有百八後世當復生受不滅。",
        "translation": "The Buddha said, When a bodhisattva's mind arises and develops, it ceases, and in the midst of cessation there are one hundred and eight subsequent lives that will again give rise to sensation and not cease.",
        "source": "T13n0397_060:0402a02_4"
    },
    {
        "source_sentence": "「轉入意，意生轉復滅，滅中有百八後世當復生受不滅。",
        "translation": "In the midst of cessation, there are 108 feelings that will arise again and don't cease in later lifetimes.",
        "source": "T13n0397_060:0402a03_5"
    },
    {
        "source_sentence": "「轉入識，識生轉復滅，滅中有百八後世當復生受不滅。",
        "translation": "“Consciousness arises and ceases again, and in the midst of that cessation, there are 108 sensations that will arise again and don’t cease in later lives.",
        "source": "T13n0397_060:0402a04_6"
    },
    {
        "source_sentence": "「轉入眼，眼所見好色生轉便滅，滅中有百八後世當復生受不滅；",
        "translation": "“In the eye, visible matter seen by the eye arises and perishes. Within that which perishes, there are one hundred and eight [factors]:",
        "source": "T13n0397_060:0402a05_7"
    },
    {
        "source_sentence": "眼所見中色生轉便滅，滅中有百八後世當復生受不滅；",
        "translation": "When form is seen by the eye, it immediately disappears when it arises and develops. Within cessation, there are one hundred and eight:",
        "source": "T13n0397_060:0402a07_8"
    },
    {
        "source_sentence": "眼所見惡色生轉便滅，滅中有百八後世當復生受不滅。",
        "translation": "When bad forms seen by the eye arise and develop, they cease. Within cessation, there are one hundred and eight [forms] that will again arise and be experienced in subsequent lifetimes but not cease.",
        "source": "T13n0397_060:0402a08_9"
    },
    {
        "source_sentence": "「轉入耳，耳所聞好聲生轉便滅，滅中有百八後世當復生受不滅；",
        "translation": "In the cessation of sound, there are one hundred and eight [factors] that will arise again in the world after death.",
        "source": "T13n0397_060:0402a09_10"
    },
    {
        "source_sentence": "耳所聞中聲生轉便滅，滅中有百八後世當復生受不滅；",
        "translation": "Within that which is heard by the organ of hearing, sound arises and then disappears; within that which is extinguished, there are one hundred and eight:",
        "source": "T13n0397_060:0402a11_11"
    },
    {
        "source_sentence": "耳所聞惡聲生轉便滅，滅中有百八後世當復生受不滅。",
        "translation": "When bad sounds that are heard by the ear arise and develop, they cease. Within cessation, there will be one hundred and eight [factors] in which sensation arises and does not cease.",
        "source": "T13n0397_060:0402a12_12"
    },
    {
        "source_sentence": "「轉入鼻，鼻所聞好香生轉便滅，滅中有百八後世當復生受不滅；",
        "translation": "“In the midst of cessation, there are 108 fragrances that will arise and not cease in one hundred and eight future lives.",
        "source": "T13n0397_060:0402a14_0"
    },
    {
        "source_sentence": "鼻所聞中香生轉便滅，滅中有百八後世當復生受不滅；",
        "translation": "When the nose smells a certain odor, it perishes as soon as it arises. Within that extinction, there are one hundred and eight [factors]:",
        "source": "T13n0397_060:0402a15_1"
    },
    {
        "source_sentence": "鼻所聞惡臭生轉便滅，滅中有百八後世當復生受不滅。",
        "translation": "The bad odor the nose hears when it arises and then ceases, and in its cessation, there are 108 feelings that will arise again and don't cease afterward.",
        "source": "T13n0397_060:0402a16_2"
    },
    {
        "source_sentence": "「轉入口，口所得美味好語言生轉便滅，滅中有百八後世當復生受不滅；",
        "translation": "In the cessation of mind, there are one hundred and eight [factors] that will be experienced in a hundred and eighty-fourth time.",
        "source": "T13n0397_060:0402a18_3"
    },
    {
        "source_sentence": "口所得中味中語言生轉便滅，滅中有百八後世當復生受不滅；",
        "translation": "Within cessation, there will be one hundred and eight in the afterlife.",
        "source": "T13n0397_060:0402a19_4"
    },
    {
        "source_sentence": "口所得惡味惡語言生轉便滅，滅中有百八後世當復生受不滅。",
        "translation": "When bad tastes and bad speech that are verbally obtained arise, they cease, and in the midst of cessation, there are one hundred and eight later times when they will again arise and be received and not cease.",
        "source": "T13n0397_060:0402a21_5"
    },
    {
        "source_sentence": "「轉入身，身所得好細軟可身生轉便滅，滅中有百八後世當復生受不滅；",
        "translation": "“In the body that evolves and enters, all the fine and fine physical sensations acquired by the body arise and perish as soon as they arise. Within cessation, there are one hundred and eight:",
        "source": "T13n0397_060:0402a22_6"
    },
    {
        "source_sentence": "身所得中細軟生轉便滅，滅中有百八後世當復生受不滅；",
        "translation": "In the midst of cessation, there are one hundred and eight feelings that will arise again and not be destroyed.",
        "source": "T13n0397_060:0402a24_7"
    },
    {
        "source_sentence": "身所得惡麁堅苦痛不可身生轉便滅，滅中有百八後世當復生受不滅。」",
        "translation": "The bad anguish and pain that comes from the body can't be produced by the body and then ceases, and in cessation there are a hundred and eight later times when it's experienced and doesn't cease.",
        "source": "T13n0397_060:0402a25_8"
    },
    {
        "source_sentence": "菩薩言：「我何以故罪生復滅？",
        "translation": "The bodhisattva said, Why did I cause sins to arise and cease again?",
        "source": "T13n0397_060:0402a27_9"
    },
    {
        "source_sentence": "何以故我了不見？」",
        "translation": "Why is it that I don't see it?",
        "source": "T13n0397_060:0402a27_10"
    },
    {
        "source_sentence": "佛問諸菩薩：「汝曹心寧轉不？」",
        "translation": "The Buddha asked the bodhisattvas, How will your mind turn?",
        "source": "T13n0397_060:0402a28_11"
    },
    {
        "source_sentence": "諸菩薩報佛言：「我心轉生，設我心不轉生，亦不能與佛共語。」",
        "translation": "The bodhisattvas replied to the Buddha, My mind is changing birth, and if my mind isn't changing birth, I won't be able to speak with the Buddha.",
        "source": "T13n0397_060:0402a29_12"
    },
    {
        "source_sentence": "佛問諸菩薩言：「若心生時寧還自覺心生不？」",
        "translation": "The Buddha asked the bodhisattvas, Would you rather return to your own mind when it arises?",
        "source": "T13n0397_060:0402b01_13"
    },
    {
        "source_sentence": "諸菩薩言：「我但識見因緣時，不覺初起生時。」",
        "translation": "The bodhisattvas said, I only perceive the causes and conditions when I see them, but I don't perceive the time of their first arising.",
        "source": "T13n0397_060:0402b02_14"
    },
    {
        "source_sentence": "佛言：「如汝所說，尚不能知心初生時，何能無罪？」",
        "translation": "The Buddha said, As you say, how can it be blameless if you still can't know when the mind first arises?",
        "source": "T13n0397_060:0402b03_15"
    },
    {
        "source_sentence": "佛說如是，諸菩薩皆慚稽首受行。",
        "translation": "When the Buddha said this, the bodhisattvas all bowed their heads in shame and accepted it.",
        "source": "T13n0397_060:0402b04_16"
    },
    {
        "source_sentence": "諸菩薩報佛言：「為我解微太促，願佛更復為我解。」",
        "translation": "The bodhisattvas replied to the Buddha, It's too late for me to understand it, so may the Buddha again understand it for me.",
        "source": "T13n0397_060:0402b06_0"
    },
    {
        "source_sentence": "佛問諸菩薩言：「汝曹生以來，寧能覺身中溫熱有幾所火？",
        "translation": "The Buddha asked the bodhisattvas, Since you were born, how could you have perceived how many kinds of fire in your body that are warm and hot?",
        "source": "T13n0397_060:0402b07_1"
    },
    {
        "source_sentence": "覺身中寒有幾所風？",
        "translation": "How many gusts of wind does he feel when it's cold in his body?",
        "source": "T13n0397_060:0402b08_2"
    },
    {
        "source_sentence": "合身中有幾所水？」",
        "translation": "How much water is there in the combined body?",
        "source": "T13n0397_060:0402b08_3"
    },
    {
        "source_sentence": "諸菩薩言：「我不能還自具分別知多少？」",
        "translation": "The bodhisattvas said, Can't I return with my own discernment and know how much?",
        "source": "T13n0397_060:0402b09_4"
    },
    {
        "source_sentence": "佛言：「若不知多少，寧知寒熱為水火不？」",
        "translation": "The Buddha said, If you don't know how much, would you know whether cold or hot is water or fire?",
        "source": "T13n0397_060:0402b10_5"
    },
    {
        "source_sentence": "諸菩薩報佛言：「我知寒熱有水火。」",
        "translation": "The bodhisattvas replied to the Buddha, I know that there's water and fire in cold and heat.",
        "source": "T13n0397_060:0402b11_6"
    },
    {
        "source_sentence": "佛言：「汝尚知寒熱水火，何以故不知多少？」",
        "translation": "The Buddha said, You still know the amount of cold, hot water and fire, so why don't you know it?",
        "source": "T13n0397_060:0402b11_7"
    },
    {
        "source_sentence": "諸菩薩言：「我但能覺寒熱，不能知多少？」",
        "translation": "The bodhisattvas said, I can only perceive cold and heat, but I can't know how much?",
        "source": "T13n0397_060:0402b12_8"
    },
    {
        "source_sentence": "佛言：「菩薩不自覺心生正受罪百八罪多少，譬如不覺寒熱水火不知火生以來多少。",
        "translation": "The Buddha said, A bodhisattva doesn't realize for himself how many sins the one hundred and eight sins that arise in his mind are directly experienced as sins, which is like not realizing the number of sins since cold, hot water and fire",
        "source": "T13n0397_060:0402b13_9"
    },
    {
        "source_sentence": "菩薩不自知心轉生以來多少。",
        "translation": "The bodhisattva doesn't know for himself how much time it's been since the mind's turning birth.",
        "source": "T13n0397_060:0402b15_10"
    },
    {
        "source_sentence": "如是菩薩但能覺枝不能覺根，如是菩薩罪入空中尚未解。」",
        "translation": "Such a bodhisattva can only perceive the branches and not the faculties, and such a bodhisattva sins into the air without yet understanding them.",
        "source": "T13n0397_060:0402b16_11"
    },
    {
        "source_sentence": "諸菩薩皆稽首問佛：「願更為我解罪入空中。」",
        "translation": "The bodhisattvas all bowed their heads and asked the Buddha, May I be released from my sins and enter the sky?",
        "source": "T13n0397_060:0402b17_12"
    },
    {
        "source_sentence": "佛言：「菩薩有百八罪，入空中不可見。",
        "translation": "The Buddha said, A bodhisattva has a hundred and eight sins that can't be seen when he enters the sky.",
        "source": "T13n0397_060:0402b18_13"
    },
    {
        "source_sentence": "何等為百八罪？",
        "translation": "What are the 108 sins?",
        "source": "T13n0397_060:0402b19_14"
    },
    {
        "source_sentence": "若菩薩心有所念，生空中復滅空中，中有百八罪不可見心生滅。",
        "translation": "If a bodhisattva's mind has thoughts, arises in the air and ceases again in the air, and there are 108 sins that can't be seen in the mind as it arises or ceases.",
        "source": "T13n0397_060:0402b19_15"
    },
    {
        "source_sentence": "譬如人語有聲不可見，要為有聲在空中但不可見。",
        "translation": "It's like when there's sound in human speech that can't be seen, and if there's sound in the air but it can't be seen.",
        "source": "T13n0397_060:0402b21_16"
    },
    {
        "source_sentence": "「轉入意，意生空中復滅空中，中有百八罪不可見。",
        "translation": "When he turns to the mind, his mind arises in the air and ceases again in the air, and there are 108 sins that can't be seen.",
        "source": "T13n0397_060:0402b22_17"
    },
    {
        "source_sentence": "「轉入識，識生空中復滅空中，中有百八罪不可見。",
        "translation": "When he turns into consciousness, his consciousness arises in the air and ceases in the air, and there are 108 sins that can't be seen.",
        "source": "T13n0397_060:0402b23_18"
    },
    {
        "source_sentence": "「轉入眼，眼所見好色，生空中復滅空中，中有百八罪不可見；",
        "translation": "“When one turns to the eye and enters it, a good color seen by the eye arises in the sky and disappears again in the sky.",
        "source": "T13n0397_060:0402b24_19"
    },
    {
        "source_sentence": "眼所見中色，生空中復滅空中，中有百八罪不可見；",
        "translation": "When form is seen by the eye, it arises in space and perishes again in space. Within this form one hundred and eight sins cannot be seen.",
        "source": "T13n0397_060:0402b26_20"
    },
    {
        "source_sentence": "眼所見惡色，生空中復滅空中，中有百八罪不可見。",
        "translation": "When bad form seen by the eye arises in the air and ceases again in the air, there are 108 sins that can't be seen.",
        "source": "T13n0397_060:0402b27_21"
    },
    {
        "source_sentence": "「轉入耳，耳所聞好聲，生空中復滅空中，中有百八罪不可見；",
        "translation": "“When one turns to the ear and enters it, a pleasing sound that is heard by the ear arises in midair and ceases in midair.",
        "source": "T13n0397_060:0402b28_22"
    },
    {
        "source_sentence": "耳所聞中聲，生空中復滅空中，中有百八罪不可見；",
        "translation": "What the ear hears in the middle is sound, which arises in space and ceases in space. The one hundred and eight sins within it cannot be seen.",
        "source": "T13n0397_060:0402b29_23"
    },
    {
        "source_sentence": "耳所聞惡聲，生空中復滅空中，中有百八罪不可見。",
        "translation": "The bad sound heard by the ear arises in the air and ceases again in the air, and there are 108 sins that can't be seen.",
        "source": "T13n0397_060:0402c02_24"
    },
    {
        "source_sentence": "「轉入鼻，鼻所聞好香，生空中復滅空中，中有百八罪不可見；",
        "translation": "When one turns and enters the nose, a pleasant fragrance that is smelled by the nose arises in midair and disappears again in midair.",
        "source": "T13n0397_060:0402c03_25"
    },
    {
        "source_sentence": "鼻所聞中香，生空中復滅空中，中有百八罪不可見；",
        "translation": "When the nose smells a certain odor, it arises in the air and perishes in the air. The one hundred and eight sins within are invisible.",
        "source": "T13n0397_060:0402c04_26"
    },
    {
        "source_sentence": "鼻所聞惡臭，生空中復滅空中，中有百八罪不可見。",
        "translation": "When the nose hears a bad odor, it arises in the air and ceases again in the air, and there are 108 sins that can't be seen.",
        "source": "T13n0397_060:0402c05_27"
    },
    {
        "source_sentence": "「轉入口，口所得美味好語言生，空中復滅空中，中有百八罪不可見；",
        "translation": "When he turns to his mouth, the delicious food obtained from his mouth is produced and then disappears into the air. There are one hundred and eight sins that cannot be seen.",
        "source": "T13n0397_060:0402c06_28"
    },
    {
        "source_sentence": "口所得中味中語言，生空中復滅空中，中有百八罪不可見；",
        "translation": "When one speaks of the medium taste of what is obtained by mouth, it arises in midair and ceases in midair. One hundred and eight sins are not visible.",
        "source": "T13n0397_060:0402c08_29"
    },
    {
        "source_sentence": "口所得惡味惡語言，生空中復滅空中，中有百八罪不可見。",
        "translation": "When bad tastes and bad speech that are obtained by mouth arise in the air and cease in the air, there are 108 sins that can't be seen.",
        "source": "T13n0397_060:0402c09_30"
    },
    {
        "source_sentence": "「轉入身，身所得好細軟可身，生空中復滅空中，中有百八罪不可見；",
        "translation": "When one turns around and enters his body, the fine and fine parts of his body are acquired. His body is born in space but then perishes in space. One hundred and eight sins can no longer be seen.",
        "source": "T13n0397_060:0402c11_31"
    },
    {
        "source_sentence": "身所得中細軟，生空中復滅空中，中有百八罪不可見；",
        "translation": "The intermediate and minor bodily possessions are born in the sky, perish in the sky, and belong to one hundred and eight sins that cannot be seen.",
        "source": "T13n0397_060:0402c12_32"
    },
    {
        "source_sentence": "身所得惡麁堅苦痛不可身，生空中復滅空中，中有百八罪不可見。」",
        "translation": "The bad anger that comes from the body is so strong and painful that it can't be seen, and when it arises in the air and ceases in the air, there are a hundred and eight sins.",
        "source": "T13n0397_060:0402c13_33"
    },
    {
        "source_sentence": "佛告諸菩薩：「若不見罪生空中，亦不見滅空中，如是諸菩薩尚未應解。」",
        "translation": "The Buddha told the bodhisattvas, If they don't see sin arising in the air and ceasing in the air, such bodhisattvas shouldn't understand it yet.",
        "source": "T13n0397_060:0402c15_34"
    },
    {
        "source_sentence": "諸菩薩言：「如是我為覺知解。」",
        "translation": "The bodhisattvas said, Thus is I perceiving and understanding.",
        "source": "T13n0397_060:0402c17_35"
    },
    {
        "source_sentence": "佛問諸菩薩：「若何因緣覺，諸菩薩何以故不常坐禪？",
        "translation": "The Buddha asked the bodhisattvas, If there are causes for pratyekabuddhas, why don't bodhisattvas always sit in meditation?",
        "source": "T13n0397_060:0402c17_36"
    },
    {
        "source_sentence": "何以故復飛行到十方佛所？」",
        "translation": "Why is it that they'll again fly to the buddhas of the ten directions?",
        "source": "T13n0397_060:0402c18_37"
    },
    {
        "source_sentence": "菩薩言：「用我有本願故，不得不行耳。」",
        "translation": "The bodhisattva said, Because I have this original vow, I won't have to do it.",
        "source": "T13n0397_060:0402c19_38"
    },
    {
        "source_sentence": "佛言：「如若有本願到十方佛所，何因緣坐禪棄罪？",
        "translation": "The Buddha said, Suppose someone had originally vowed to go to the buddhas of the ten directions, what would be the reason for sitting in meditation and abandoning sin?",
        "source": "T13n0397_060:0402c20_39"
    },
    {
        "source_sentence": "設令汝坐禪棄罪，本願當滅。」",
        "translation": "If you were to sit in meditation and abandon sins, the original vow would cease.",
        "source": "T13n0397_060:0402c21_40"
    },
    {
        "source_sentence": "諸菩薩言：「我坐禪但滅當來罪耳，我未滅本願罪。」",
        "translation": "The bodhisattvas said, I'll only extinguish the sins of future sins while sitting in meditation, but I haven't extinguished the sins of my past vows.",
        "source": "T13n0397_060:0402c22_41"
    },
    {
        "source_sentence": "佛問諸菩薩：「若曹從無數劫以來所作過去生死罪當滅不？」",
        "translation": "The Buddha asked the bodhisattvas, Will the sins of past births and deaths that I've done since countless eons be extinguished?",
        "source": "T13n0397_060:0402c23_42"
    },
    {
        "source_sentence": "諸菩薩言：「我當滅過去無數劫本罪。」",
        "translation": "The bodhisattvas said, I will extinguish the original sins of countless eons in the past.",
        "source": "T13n0397_060:0402c24_43"
    },
    {
        "source_sentence": "佛言：「若尚能滅無數劫本罪，何以故獨不滅本願罪？」",
        "translation": "The Buddha said, If you can still extinguish the original sins of countless eons, why wouldn't you extinguish the sins of your original vow alone?",
        "source": "T13n0397_060:0402c25_44"
    },
    {
        "source_sentence": "諸菩薩言：「佛問我是，我不能卒解。」",
        "translation": "The bodhisattvas said, When the Buddha asks about me, I can't understand it at once.",
        "source": "T13n0397_060:0402c26_45"
    },
    {
        "source_sentence": "佛言：「如是若曹為未解，何以故言我解？」",
        "translation": "The Buddha said, Thus, if Cao hadn't understood it, why would he say I understand it?",
        "source": "T13n0397_060:0402c27_46"
    },
    {
        "source_sentence": "諸菩薩皆稽首慚受行。",
        "translation": "The bodhisattvas all bowed their heads in shame and accepted the practice.",
        "source": "T13n0397_060:0402c28_47"
    },
    {
        "source_sentence": "諸菩薩報佛言：「佛雖為我解，我尚未解。",
        "translation": "The bodhisattvas replied to the Buddha, Although the Buddha understands it for me, I haven't understood it yet.",
        "source": "T13n0397_060:0402c29_0"
    },
    {
        "source_sentence": "願佛當復為我解，當復何等行？」",
        "translation": "May the Buddha again understand for me, and what else will he do?",
        "source": "T13n0397_060:0402c29_1"
    },
    {
        "source_sentence": "佛言：「諸菩薩行道無數劫以來，意生死本意。",
        "translation": "The Buddha said, Since the bodhisattvas have practiced the path for countless eons, their minds have been born and died in the original mind.",
        "source": "T13n0397_060:0403a01_2"
    },
    {
        "source_sentence": "譬如菓實種著土中生大樹，已成大樹，樹上生百種億億枝，枝生億億萬葉，",
        "translation": "It's like planting fruit seeds in the soil and growing a large tree, which has grown into a large tree, with hundreds of kinds of billions of branches growing on top of that tree, and billions of millions of leaves growing",
        "source": "T13n0397_060:0403a02_3"
    },
    {
        "source_sentence": "枝枝生億億萬實，一實者當復轉生一樹。",
        "translation": "Each branch produces billions of myriads of koṭis of realities, and one real thing will again grow another tree.",
        "source": "T13n0397_060:0403a04_4"
    },
    {
        "source_sentence": "菩薩坐禪棄我本罪，譬如取樹葉一一滅之，取實一一滅之，便不復種生；",
        "translation": "The enlightening beings in meditation abandon their original sins, as if they were to take the leaves of a tree and annihilate them one by one; but when they have taken the fruit of that tree and annihilated it one by one, no longer plant",
        "source": "T13n0397_060:0403a05_5"
    },
    {
        "source_sentence": "取枝一一滅之，如是葉實枝滅盡了[歹*斯]但有根。",
        "translation": "He takes a branch and extinguishes it one by one, and thus the leaves and real branches cease to be [this*s] but there are faculties.",
        "source": "T13n0397_060:0403a06_6"
    },
    {
        "source_sentence": "根者為譬，如本願一意所起本罪意，譬如樹根枝葉生當復滅之，不滅者當長養，",
        "translation": "The roots are an analogy: just as the original sinful intention arises from a single thought of the former vow. It is like a tree whose roots, branches, leaves, and roots give rise to something that will be destroyed once more",
        "source": "T13n0397_060:0403a08_0"
    },
    {
        "source_sentence": "實復生滅者不復生。",
        "translation": "What really arises and ceases again doesn't arise again.",
        "source": "T13n0397_060:0403a09_1"
    },
    {
        "source_sentence": "菩薩守意，譬如守樹根，不得使樹枝葉實生，生為增當來罪，滅者為不增當來罪，",
        "translation": "It's like guarding the roots of a tree that doesn't allow its branches and leaves to really grow, which increase future sins when they grow and don't increase future sins when they die.",
        "source": "T13n0397_060:0403a10_2"
    },
    {
        "source_sentence": "為滅本罪。",
        "translation": "It's to extinguish the original sin.",
        "source": "T13n0397_060:0403a12_3"
    },
    {
        "source_sentence": "如是菩薩本罪未盡者，常當念百八不捨盡。」",
        "translation": "Thus, a bodhisattva who hasn't ended his original sins should always be mindful of the 108 kinds of things he doesn't abandon.",
        "source": "T13n0397_060:0403a12_4"
    },
    {
        "source_sentence": "諸菩薩稽首言：「願佛為我解我不解。」",
        "translation": "The bodhisattvas bowed their heads and said, May the Buddha understand for me that I don't understand.",
        "source": "T13n0397_060:0403a13_5"
    },
    {
        "source_sentence": "佛言：「不捨盡心有所念，生念還盡，百八便盡，是為不捨盡。",
        "translation": "The Buddha said, If someone doesn't abandon mental thoughts that have arisen without ceasing and returns to cessation with thoughts that arise without ceasing, then the 108 will cease, which is called not abandoning.",
        "source": "T13n0397_060:0403a14_6"
    },
    {
        "source_sentence": "「轉入意，意生念還盡，百八便盡，是為不捨盡。",
        "translation": "When he turns around and enters his mind, the thoughts that arise in his mind are again exhausted, and the 108 will be exhausted; this is called not abandoning it.",
        "source": "T13n0397_060:0403a15_7"
    },
    {
        "source_sentence": "「轉入識，識生念還盡，百八便盡，是為不捨盡。",
        "translation": "When he turns to enter consciousness, the mindfulness that arises from consciousness returns to its end, and the 108 are then ended; this is called not abandoning it.",
        "source": "T13n0397_060:0403a16_8"
    },
    {
        "source_sentence": "「轉入眼，眼所見好色念還盡，百八便盡，是為不捨盡；",
        "translation": "“When one turns to the eye and enters it, all the good images seen by the eye are exhausted. One hundred and eight of them will be exhausted. This is called not giving up.",
        "source": "T13n0397_060:0403a17_9"
    },
    {
        "source_sentence": "眼所見中色念還盡，百八便盡，是為不捨盡；",
        "translation": "When form and thought in what is seen by the eye are exhausted, one hundred and eight [factors] will be exhausted. This is called ‘exhaustion of not abandoning’.",
        "source": "T13n0397_060:0403a18_10"
    },
    {
        "source_sentence": "眼所見惡色念還盡，百八便盡，是為不捨盡。",
        "translation": "When the mindfulness of seeing bad forms with the eye returns to its end, and the 108 are ended, this is called not abandoning it.",
        "source": "T13n0397_060:0403a19_11"
    },
    {
        "source_sentence": "「轉入耳，耳所聞好聲念還盡，百八便盡，是為不捨盡；",
        "translation": "“When you turn and enter your ears, all the good sounds that you hear in your ears will come to an end. One hundred and eight of them will then be exhausted.",
        "source": "T13n0397_060:0403a20_12"
    },
    {
        "source_sentence": "耳所聞中聲念還盡，百八便盡，是為不捨盡；",
        "translation": "When the sound and thought in what is heard by the ears are exhausted, one hundred and eight of them will be exhausted. That is to say, they will not be exhausted.",
        "source": "T13n0397_060:0403a21_13"
    },
    {
        "source_sentence": "耳所聞惡聲念還盡，百八便盡，是為不捨盡。",
        "translation": "When the bad sounds and thoughts he hears in his ears are still extinguished, one hundred and eight of them are then extinguished, which is called not abandoning it.",
        "source": "T13n0397_060:0403a22_14"
    },
    {
        "source_sentence": "「轉入鼻，鼻所聞好香念還盡，百八便盡，是為不捨盡；",
        "translation": "“When one turns to the nose and enters it, all the good odors that one perceives by the nose are exhausted. One hundred and eight [factors] then disappear.",
        "source": "T13n0397_060:0403a23_15"
    },
    {
        "source_sentence": "鼻所聞中香念還盡，百八便盡，是為不捨盡；",
        "translation": "When the thought of odor in what the nose hears is exhausted, one hundred and eight are exhausted. That is to say, it is not exhausted.",
        "source": "T13n0397_060:0403a25_16"
    },
    {
        "source_sentence": "鼻所聞惡臭念還盡，百八便盡，是為不捨盡。",
        "translation": "When the bad odor that the nose hears is still extinguished, one hundred and eight of them are then extinguished, which is called not relinquishing.",
        "source": "T13n0397_060:0403a26_17"
    },
    {
        "source_sentence": "「轉入口，口所得美味好語言念還盡，百八便盡，是為不捨盡；",
        "translation": "“When one turns to the inhalation, all the good and delicious food obtained by mouth is exhausted. One hundred and eight [factors] are then exhausted; this is called not giving up.",
        "source": "T13n0397_060:0403a27_18"
    },
    {
        "source_sentence": "口所得中味中語言念還盡，百八便盡，是為不捨盡；",
        "translation": "When the verbally acquired one-hundred and eight [factors] are completely exhausted, this is called ‘exhaustion of not abandoning’.",
        "source": "T13n0397_060:0403a28_19"
    },
    {
        "source_sentence": "口所得惡味惡語言念還盡，百八便盡，是為不捨盡。",
        "translation": "When the bad tastes and bad words he obtains from his mouth are exhausted, one hundred and eight of them will be exhausted, which is called not abandoning it.",
        "source": "T13n0397_060:0403a29_20"
    },
    {
        "source_sentence": "「轉入身，身所得好細軟可身念還盡，百八便盡，是為不捨盡；",
        "translation": "“When one turns around and enters the body, all the fine and fine qualities gained by the body are exhausted. One hundred and eight [factors] will then be exhausted.",
        "source": "T13n0397_060:0403b01_21"
    },
    {
        "source_sentence": "身所得中細軟念還盡，百八便盡，是為不捨盡；",
        "translation": "When the subtle and minor awarenesses acquired by the body are again exhausted, one hundred and eight of them will be exhausted. This is called not giving up.",
        "source": "T13n0397_060:0403b03_22"
    },
    {
        "source_sentence": "身所得惡麁堅苦痛不可身念還盡，百八便盡，是為不捨盡。",
        "translation": "When the bad anguish and pain that he's received in his body is so intense and painful that it can't be recalled, the 108 will then end, which is called not abandoning it.",
        "source": "T13n0397_060:0403b04_23"
    },
    {
        "source_sentence": "如是菩薩不捨盡，便入百八淨。」",
        "translation": "Thus, the bodhisattva doesn't abandon it and enter one hundred and eight purifications.",
        "source": "T13n0397_060:0403b05_24"
    },
    {
        "source_sentence": "佛說如是，諸菩薩皆歡喜稽首受行。",
        "translation": "When the Buddha spoke thus, all the bodhisattvas joyfully bowed their heads and accepted the practice.",
        "source": "T13n0397_060:0403b06_25"
    },
    {
        "source_sentence": "諸菩薩復稽首問佛言：「為何等為百八淨？」",
        "translation": "Again, the bodhisattvas bowed their heads and asked the Buddha, What are the 108 purifications?",
        "source": "T13n0397_060:0403b08_0"
    },
    {
        "source_sentence": "佛言：「若有菩薩心起生出念，即還入滅為入淨，為滅百八不捨淨。",
        "translation": "The Buddha said, Suppose there's a bodhisattva whose mind arises and produces thoughts that return to cessation in order to enter purity and cease one hundred and eight without abandoning purity.",
        "source": "T13n0397_060:0403b08_1"
    },
    {
        "source_sentence": "「轉入意，意生出即還入滅為入淨，為滅百八不捨淨。",
        "translation": "When he turns his mind to enter, his mind arises and exits, which is when he returns to enter and ceases as purity of entry and the 108 unremitting purity of cessation as purity of cessation.",
        "source": "T13n0397_060:0403b10_2"
    },
    {
        "source_sentence": "「轉入識，識生出即還入滅為入淨，為滅百八不捨淨。",
        "translation": "When he turns to enter consciousness, the arising and ceasing of consciousness is purified by returning to entry and cessation, and it's purified by ceasing one hundred and eight things without abandoning them.",
        "source": "T13n0397_060:0403b11_3"
    },
    {
        "source_sentence": "「轉入眼，眼所見好色生出，即還入滅為入淨，為滅百八不捨淨；",
        "translation": "“The enlightening beings enter the eye by means of the power of vision, and when they see good images produced by the eye, their entry and extinction are purified; in order to be purified one hundred and eighty-eight times without giving up",
        "source": "T13n0397_060:0403b12_4"
    },
    {
        "source_sentence": "眼所見中色生出，即還入滅為入淨，為滅百八不捨淨；",
        "translation": "What is seen by the eye, form arises and perishes. That which enters back into cessation is transmigra tion; in order to be extinguished one hundred and eight [factors] do not pass away as transmigra tion.",
        "source": "T13n0397_060:0403b14_5"
    },
    {
        "source_sentence": "眼所見惡色生出，即還入滅為入淨，為滅百八不捨淨。",
        "translation": "When bad forms that are seen by the eye arise and cease, it's purified by returning to entry and cessation, and it's purified by ceasing one hundred and eight of them without abandoning them.",
        "source": "T13n0397_060:0403b15_6"
    },
    {
        "source_sentence": "「轉入耳，耳所聞好聲生出，即還入滅為入淨，為滅百八不捨淨；",
        "translation": "“Entry into and extinction of the ear is purified by entering it, and one hundred and eight [factors] that are not abandoned in order to eliminate it are purified.",
        "source": "T13n0397_060:0403b16_7"
    },
    {
        "source_sentence": "耳所聞中聲生出，即還入滅為入淨，為滅百八不捨淨；",
        "translation": "When sound arises and ceases in what the organ of hearing hears, that is to say, it enters back into cessation as entry and one hundred and eight pure states of nonabandonment as cessation.",
        "source": "T13n0397_060:0403b18_8"
    },
    {
        "source_sentence": "耳所聞惡聲生出，即還入滅為入淨，為滅百八不捨淨。",
        "translation": "What's heard by the ear as bad sounds arise and cease, that is, it returns to entry and cessation as entry into purity and doesn't abandon purity in order to cease one hundred and eight.",
        "source": "T13n0397_060:0403b19_9"
    },
    {
        "source_sentence": "「轉入鼻，鼻所聞好香生出，即還入滅為入淨，為滅百八不捨淨；",
        "translation": "“When one turns to the nose and enters it, a pleasant odor that the nose perceives arises and exhales. It immediately returns back to its original state of cessation in order to purify its state of entry and ceases",
        "source": "T13n0397_060:0403b20_10"
    },
    {
        "source_sentence": "鼻所得中香生出，即還入滅為入淨，為滅百八不捨淨；",
        "translation": "The middle odor that is perceived by the nose arises and perishes. Entering and extinguishing are said to be entering; in order to cease, one hundred and eight [factors] of nonabandonment are purified.",
        "source": "T13n0397_060:0403b22_11"
    },
    {
        "source_sentence": "鼻所聞惡臭生出，即還入滅為入淨，為滅百八不捨淨。",
        "translation": "When bad odor that the nose hears and produces, it returns to entry and extinguishes as entry for purity, and one hundred and eight parts of cessation don't abandon purity for purity.",
        "source": "T13n0397_060:0403b23_12"
    },
    {
        "source_sentence": "「轉入口，口所得美味好語言生出，即還入滅為入淨，為滅百八不捨淨；",
        "translation": "“Then, turning from one mouth to the next, he eats and exhales delicious food obtained from his mouth. He immediately returns to cessation in order to enter purity, and for the sake of extinguishing it he does not",
        "source": "T13n0397_060:0403b24_13"
    },
    {
        "source_sentence": "口所得中味中語言生出，即還入滅為入淨，為滅百八不捨淨；",
        "translation": "In the midst of the sweet taste obtained by mouth, verbal action arises and perishes. That is to say, it enters back into cessation in order to be purified; one hundred and eight [factors] that do not give up in order",
        "source": "T13n0397_060:0403b26_14"
    },
    {
        "source_sentence": "口所得惡味惡語言生出，即還入滅為入淨，為滅百八不捨淨。",
        "translation": "When bad tastes and bad speech that are obtained by mouth arise and cease, it's purified by returning to cessation as entry and purified by ceasing one hundred and eight kinds of pure non-abandonment.",
        "source": "T13n0397_060:0403b27_15"
    },
    {
        "source_sentence": "「轉入身，身所得好細軟可身生出，即還入滅為入淨，為滅百八不捨淨；",
        "translation": "“When one turns to enter the body, all the fine and fine bodily characteristics that are acquired by the body arise and perish. That is, when one returns to enter and extinguishes, this is entering purity; in order",
        "source": "T13n0397_060:0403b29_16"
    },
    {
        "source_sentence": "身所得中細軟生出，即還入滅為入淨，為滅百八不捨淨；",
        "translation": "The middle subtle and minor ones acquired by the body that arise and perish at the same time are transmigratory. That is, when one returns to entry or extinction, it is transmigratory; in order to extinguish one hundred",
        "source": "T13n0397_060:0403c01_17"
    },
    {
        "source_sentence": "身所得惡麁堅苦痛不可身生出，即還入滅為入淨，為滅百八不捨淨。",
        "translation": "The bad anguish and hard pain that he receives from his body can't arise or cease in his body, so he returns to enter and extinguishes it for the sake of entering purity and extinguishes 108 unremitting",
        "source": "T13n0397_060:0403c02_18"
    },
    {
        "source_sentence": "菩薩行如是不捨淨，便能精還百八應戒。」",
        "translation": "If a bodhisattva thus practices without abandoning purity, he'll be able to refrain from one hundred and eight precepts.",
        "source": "T13n0397_060:0403c04_19"
    },
    {
        "source_sentence": "佛說如是，諸菩薩皆歡喜受行。",
        "translation": "When the Buddha teaches this, all bodhisattvas are delighted to receive and practice it.",
        "source": "T13n0397_060:0403c05_20"
    },
    {
        "source_sentence": "諸菩薩復稽首問佛言：「何等精還百八應戒？」",
        "translation": "Again, the bodhisattvas bowed their heads and asked the Buddha, What's the one hundred and eight precepts that should be practiced with energy?",
        "source": "T13n0397_060:0403c07_0"
    },
    {
        "source_sentence": "佛言：「諸菩薩行道心起，即精還滅百八，為還應戒。",
        "translation": "The Buddha said, Bodhisattvas who practice the path with mind arising, that is, when their energy returns and ceases a hundred and eight, they return to the precepts accordingly.",
        "source": "T13n0397_060:0403c08_0"
    },
    {
        "source_sentence": "「轉入意，意生即精還滅百八，為還應戒。",
        "translation": "When he turns to the mind and enters it, his mind arises, which is one hundred and eight times when his energy returns and ceases, in order to return to the precepts.",
        "source": "T13n0397_060:0403c09_1"
    },
    {
        "source_sentence": "「轉入識，識生即精還滅百八，為還應戒。",
        "translation": "When he transmigrates into consciousness, the consciousness arises, which is the one hundred and eighth cessation of excretion, so he returns to the precepts accordingly.",
        "source": "T13n0397_060:0403c10_0"
    },
    {
        "source_sentence": "「轉入眼，眼所見好色生，即精還滅百八，為還應戒；",
        "translation": "When the organ of sight proceeds to an eye, a good visible matter seen by the eye arises. That is, one hundred and eight [factors] return when the semen disappears.",
        "source": "T13n0397_060:0403c10_1"
    },
    {
        "source_sentence": "眼所見中色生，即精還滅百八，為還應戒；",
        "translation": "When form arises within that which is seen by the eye, one hundred and eight [factors] exactly are extinguished.",
        "source": "T13n0397_060:0403c12_2"
    },
    {
        "source_sentence": "眼所見惡色生，即精還滅百八，為還應戒。",
        "translation": "When bad form arises from what the eye sees, that's when the semen returns and ceases a hundred and eight, so it should be returned to the precepts.",
        "source": "T13n0397_060:0403c13_0"
    },
    {
        "source_sentence": "「轉入耳，耳所聞好聲生，即精還滅百八，為還應戒；",
        "translation": "When one turns and enters the ear, a good sound arises from what is heard by the ear. That is, one hundred and eight [factors] return to cessation of exhalation in order to return to conform with the precepts.",
        "source": "T13n0397_060:0403c13_1"
    },
    {
        "source_sentence": "耳所聞中聲生，即精還滅百八，為還應戒；",
        "translation": "When sound arises in the middle of that which is heard by the organ of hearing, one hundred and eight are extinguished.",
        "source": "T13n0397_060:0403c15_2"
    },
    {
        "source_sentence": "耳所聞惡聲生，即精還滅百八，為還應戒。",
        "translation": "When bad sounds arise from what the ear hears, that's when the spirit returns and ceases one hundred and eight, so they should return to the precepts.",
        "source": "T13n0397_060:0403c16_0"
    },
    {
        "source_sentence": "「轉入鼻，鼻所聞好香生，即精還滅百八，為還應戒；",
        "translation": "When one turns to the nose and enters it, a pleasant odor that is heard by the nose arises. One hundred and eight [factors] are observed in return when the semen ceases.",
        "source": "T13n0397_060:0403c16_1"
    },
    {
        "source_sentence": "鼻所聞中香生，即精還滅百八，為還應戒；",
        "translation": "When an odor arises in the interior of the nose and is smelled by the nose, one hundred and eight [factors] immediately cease.",
        "source": "T13n0397_060:0403c18_2"
    },
    {
        "source_sentence": "鼻所聞惡臭生，即精還滅百八，為還應戒。",
        "translation": "When bad odor arises from what the nose hears, that's when the semen returns and ceases a hundred and eight, so it should be returned to the precepts.",
        "source": "T13n0397_060:0403c19_0"
    },
    {
        "source_sentence": "「轉入口，口所得美味好語言生，即精還滅百八，為還應戒；",
        "translation": "When he turns to his mouth, the delicious food obtained from his mouth is said to arise. One hundred and eight [bodhisattvas] return with semen and extinguish one hundred and eight precepts in order to receive it back.",
        "source": "T13n0397_060:0403c19_1"
    },
    {
        "source_sentence": "口所得中味中語言生，即精還滅百八，為還應戒；",
        "translation": "When verbal action arises in the midst of a subtle taste, that is to say, one hundred and eight ndriyas return with exhalation or exhalation.",
        "source": "T13n0397_060:0403c21_2"
    },
    {
        "source_sentence": "口所得惡味惡語言生，即精還滅百八，為還應戒。",
        "translation": "When bad tastes and bad words that are verbally obtained arise, that's when the semen returns to cessation with 108 precepts for the sake of returning it.",
        "source": "T13n0397_060:0403c22_3"
    },
    {
        "source_sentence": "「轉入身，身所得好細軟可身生，即精還滅百八，為還應戒；",
        "translation": "When one turns and enters the body, all the good and subtle bodily sensations acquired by the body are produced. That is to say, one hundred and eight [factors] of arousal and cessation of semen occur in order to return",
        "source": "T13n0397_060:0403c23_4"
    },
    {
        "source_sentence": "身所得中細軟生，即精還滅百八，為還應戒；",
        "translation": "The middle subtle and minor forms of bodily endowment, that is, the one hundred and eight cessations of exhalation and emission of energy.",
        "source": "T13n0397_060:0403c24_5"
    },
    {
        "source_sentence": "身所得惡麁堅苦痛不可身生，即精還滅百八，為還應戒。」",
        "translation": "The bad anguish and pain that comes from the body can't be produced by the body, which is when the semen returns and ceases a hundred and eight, so you should follow the precepts for returning.",
        "source": "T13n0397_060:0403c25_6"
    },
    {
        "source_sentence": "佛說如是，諸菩薩皆歡喜受行。",
        "translation": "When the Buddha teaches this, all bodhisattvas are delighted to receive and practice it.",
        "source": "T13n0397_060:0403c27_7"
    },
    {
        "source_sentence": "佛言：「諸菩薩以精還應戒便進行入道。」",
        "translation": "The Buddha said, Bodhisattvas who return with effort and follow the precepts will then enter the path.",
        "source": "T13n0397_060:0403c28_0"
    },
    {
        "source_sentence": "諸菩薩問佛言：「何等為精還戒便進行入道？」",
        "translation": "The bodhisattvas asked the Buddha, What's the practice of entering the path for the sake of returning precepts?",
        "source": "T13n0397_060:0403c28_1"
    },
    {
        "source_sentence": "佛言：「菩薩心有所念從心盡力，盡所念滅百八，是為進行入道。",
        "translation": "The Buddha said, Whatever thoughts a bodhisattva has in his mind, he follows the mind's exertion and extinguishes one hundred and eight of those thoughts, which is to practice entering the path.",
        "source": "T13n0397_060:0403c29_2"
    },
    {
        "source_sentence": "「轉入意，意有所念從意盡力，盡所念滅百八，是為進行入道。",
        "translation": "To enter the mind by proceeding, to have thoughts that follow the mind, and to exert all one’s effort in order to eliminate a hundred and eight kinds of thoughts is to progress on the path of entering.",
        "source": "T13n0397_060:0404a02_3"
    },
    {
        "source_sentence": "「轉入識，識有所識從識盡力，盡所識滅百八，是為進行入道。",
        "translation": "Entering consciousness and realizing that consciousness has some consciousness, the consciousness follows the power of consciousness to exhaust all one hundred and eight forms of consciousness, this is called entering the path of practice.",
        "source": "T13n0397_060:0404a03_4"
    },
    {
        "source_sentence": "「轉入眼，眼所見好色，從好色盡力，盡好色滅百八，是為進行入道；",
        "translation": "“Entry into the eye: when the eye sees good matter, it exerts all its power from good matter and destroys one hundred and eight [factors] of good matter. This is entering practice.",
        "source": "T13n0397_060:0404a05_5"
    },
    {
        "source_sentence": "眼所見中色，從中色盡力，盡中色滅百八，是為進行入道；",
        "translation": "When the eye sees secondary matter in the intermediate state, it proceeds from secondary matter and extinguishes one hundred and eight [factors] by means of the exhaustion of this power.",
        "source": "T13n0397_060:0404a06_6"
    },
    {
        "source_sentence": "眼所見惡色，從惡色盡力，盡惡色滅百八，是為進行入道。",
        "translation": "When the eye sees bad forms, it exhausts its power from bad forms and extinguishes 108 bad forms, which is to enter the path of practice.",
        "source": "T13n0397_060:0404a07_7"
    },
    {
        "source_sentence": "「轉入耳，耳所聞好聲，從好聲盡力，盡好聲滅百八，是為進行入道；",
        "translation": "“Entry into the ears, hearing good sounds through the ears and exerting all one’s strength from those good sounds to eliminate a hundred and eight [factors]—this is entering practice.",
        "source": "T13n0397_060:0404a09_8"
    },
    {
        "source_sentence": "耳所聞中聲，從中聲盡力，盡中聲滅百八，是為進行入道；",
        "translation": "When the middle sound heard by the ear is exhausted, one exerts all one’s efforts from the middle sound. At the end of the middle sound, one hundred and eight [factors] cease. This is entering on the path of effort.",
        "source": "T13n0397_060:0404a10_9"
    },
    {
        "source_sentence": "耳所聞惡聲，從惡聲盡力，盡惡聲滅百八，是為進行入道。",
        "translation": "When bad sounds are heard by the ear, he exerts all his efforts from bad sounds and extinguishes 108 bad sounds. This is called entering the path of practice.",
        "source": "T13n0397_060:0404a11_10"
    },
    {
        "source_sentence": "「轉入鼻，鼻所聞好香，從好香盡力，盡好香滅百八，是為進行入道；",
        "translation": "“Entry into the nose: when the nose perceives good odors, it exerts itself with all its strength to extinguish one hundred and eight [factors of] good odors. This is entering practice.",
        "source": "T13n0397_060:0404a13_11"
    },
    {
        "source_sentence": "鼻所聞中香，從中香盡力，盡中香滅百八，是為進行入道；",
        "translation": "When the nose perceives a neutral odor, it exerts all its power to extinguish one hundred and eight [factors] from that neutral odor. This is entering on the path of effort.",
        "source": "T13n0397_060:0404a14_12"
    },
    {
        "source_sentence": "鼻所聞惡臭，從惡臭盡力，盡惡臭滅百八，是為進行入道。",
        "translation": "When the nose hears bad odor, it exerts itself with all its might to extinguish one hundred and eight [factors] of bad odor. This is called entering the path in order to proceed.",
        "source": "T13n0397_060:0404a16_0"
    },
    {
        "source_sentence": "「轉入口，口所得美味好語言，從美味好語言盡力，盡美味好語言滅百八，",
        "translation": "“Turning from mouth to mouth, he speaks words of delicious flavors and appetizing sounds that are obtained by mouth, exerting his best effort with words of delicious flavors and appetizing sounds, and stops speaking one hundred and",
        "source": "T13n0397_060:0404a17_1"
    },
    {
        "source_sentence": "是為進行入道；",
        "translation": "This is enlightening beings’ practice of entry into the path.",
        "source": "T13n0397_060:0404a18_2"
    },
    {
        "source_sentence": "口所得中味中語言，從中味中語言盡力，盡中味中語言滅百八，是為進行入道；",
        "translation": "He speaks in the middle of a medium taste obtained by mouth, exerts all his efforts in speaking in the middle of a medium taste, and when he has exhausted one hundred and eight [factors] to cease speaking in the middle of a medium taste,",
        "source": "T13n0397_060:0404a19_3"
    },
    {
        "source_sentence": "口所得惡味惡語言，從惡味惡語言盡力，盡惡味惡語言滅百八，是為進行入道。",
        "translation": "When bad words of bad taste and bad speech obtained from mouth, he exerts his efforts to stop the 108 bad words of bad taste and bad speech, which are called the path of entering.",
        "source": "T13n0397_060:0404a21_4"
    },
    {
        "source_sentence": "「轉入身，身所得好細軟可身，從好細濡可身盡力，盡好細軟可身滅百八，",
        "translation": "“When he turns around and enters his body, the goodness and fineness of his body are appeased to him, and when he exerts all his mighty effort from the goodness and fineness of his body that is appeased to",
        "source": "T13n0397_060:0404a22_5"
    },
    {
        "source_sentence": "是為進行入道；",
        "translation": "This is enlightening beings’ practice of entry into the path.",
        "source": "T13n0397_060:0404a24_6"
    },
    {
        "source_sentence": "身所得中細軟，從中細軟盡力，盡中細軟滅百八，是為進行入道；",
        "translation": "The intermediate subtle and minor ones acquired by the body are to be abandoned through the exertion of the middle subtle and minor, and one hundred and eight arise from the cessation of the middle subtle and minor. This is the path of en",
        "source": "T13n0397_060:0404a24_7"
    },
    {
        "source_sentence": "身所得惡麁堅苦痛不可身，從惡麁堅苦痛不可身盡力，盡惡麁堅苦痛不可身滅百八，",
        "translation": "The pain and suffering of bad abscesses that arise from the body are unbearable to the body, and it's not possible to exhaust the strength of the body with bad abscesses, and it's not possible to extinguish the hundred and eight",
        "source": "T13n0397_060:0404a26_8"
    },
    {
        "source_sentence": "是為進行入道。」",
        "translation": "This is the path of practice and entry.",
        "source": "T13n0397_060:0404a28_9"
    },
    {
        "source_sentence": "佛言：「進行入道便能忍持行戒。」",
        "translation": "The Buddha said, They'll then be able to tolerate the observance of the precepts as they enter the path.",
        "source": "T13n0397_060:0404a28_10"
    },
    {
        "source_sentence": "諸菩薩問佛言：「何等為忍持行戒？」",
        "translation": "The bodhisattvas asked the Buddha, What's forbearance that observes the precepts?",
        "source": "T13n0397_060:0404b01_0"
    },
    {
        "source_sentence": "佛言：「菩薩已能當能忍持戒不離戒，如是乃應菩薩行。",
        "translation": "The Buddha said, Once a bodhisattva can tolerate observing the precepts and not parting from them, then he should practice as a bodhisattva.",
        "source": "T13n0397_060:0404b01_1"
    },
    {
        "source_sentence": "菩薩心動當忍百八不得令轉，是為忍心忍行戒。",
        "translation": "When the bodhisattva's mind moves, he tolerates one hundred and eight things that can't be caused to change, which is the morality of forbearance.",
        "source": "T13n0397_060:0404b03_0"
    },
    {
        "source_sentence": "「轉入意，意有所念，當從意忍不得令轉，百八便不得行，是為忍行戒。",
        "translation": "When he enters and turns his mind, whatever thoughts he has in his mind, he must tolerate it from the mind so that it doesn't turn, and 108 then he won't practice it.",
        "source": "T13n0397_060:0404b04_1"
    },
    {
        "source_sentence": "「轉入識，識有所識，當從識忍不得令轉，百八便不得行，是為忍識忍行戒。",
        "translation": "When he enters into consciousness, there's consciousness and some consciousness that should be tolerated from consciousness and not allow it to change, and 108 then he won't practice it.",
        "source": "T13n0397_060:0404b05_2"
    },
    {
        "source_sentence": "「轉入眼，眼所見好色，從好色當忍不得令轉，百八便不得行，是為忍好色忍行戒；",
        "translation": "“When one turns and enters the eye, when the eye sees good forms, it should tolerate those good forms and not allow them to be turned. One hundred and eight then cannot proceed. This is patience with respect to such [forms] as",
        "source": "T13n0397_060:0404b07_3"
    },
    {
        "source_sentence": "眼所見中色，從中色當忍不得令轉，百八便不得行，是為忍中色忍行戒；",
        "translation": "When the eye sees an object of medium form, it cannot be made to arise; one hundred and eight [factors] then cannot proceed.",
        "source": "T13n0397_060:0404b09_4"
    },
    {
        "source_sentence": "眼所見惡色，從惡色當忍不得令轉，百八便不得行，是為忍惡色忍行戒。",
        "translation": "When the eye sees bad forms, it must tolerate them from bad forms and not allow them to change, and one hundred and eight of them won't be allowed to do so.",
        "source": "T13n0397_060:0404b10_5"
    },
    {
        "source_sentence": "「轉入耳，耳所聞好聲，從好聲當忍不得令轉，百八便不得行，是為忍好聲忍行戒；",
        "translation": "These are the ten precepts that relate to forbearance, patience, tolerance, and practice. “When one turns his or her ears [to hear] a good sound with their ears, he or she will not allow it to be turned;",
        "source": "T13n0397_060:0404b12_6"
    },
    {
        "source_sentence": "耳所聞中聲，從中聲當忍不得令轉，百八便不得行，是為忍中聲忍行戒；",
        "translation": "When the ear hears a sound in the middle of the sound, it is tolerated and not allowed to proceed; when one hundred and eight [factors] are present, it is not allowed to proceed.",
        "source": "T13n0397_060:0404b14_7"
    },
    {
        "source_sentence": "耳所聞惡聲，從惡聲當忍不得令轉，百八便不得行，是為忍惡聲忍行戒。",
        "translation": "When the ear hears bad sounds, they must tolerate them from bad sounds and not allow them to be turned around, and one hundred and eight of them won't be able to do so.",
        "source": "T13n0397_060:0404b16_0"
    },
    {
        "source_sentence": "「轉入鼻，鼻所聞好香，從好香當忍不得令轉，百八便不得行，是為忍好香忍行戒；",
        "translation": "“When one turns to the nose and enters it, a good odor is heard by the nose. When one follows that good odor, he should tolerate it and not allow it to be turned; but when one hundred and eight [factors",
        "source": "T13n0397_060:0404b17_1"
    },
    {
        "source_sentence": "鼻所聞中香，從中香當忍不得令轉，百八便不得行，是為忍中香忍行戒；",
        "translation": "When the nose smells a neutral odor, it should be tolerated and not allowed to proceed; one hundred and eight [factors] then are not allowed to act. This is the morality of forbearance in tolerating the practice of patience regarding",
        "source": "T13n0397_060:0404b19_2"
    },
    {
        "source_sentence": "鼻所聞惡臭，從惡臭當忍不得令轉，百八便不得行，是為忍惡臭忍行戒。",
        "translation": "When the nose hears a bad odor, it can't be tolerated from that bad odor, and one hundred and eight of them won't do so; this is the precept for tolerating the practice of patience in tolerating bad o",
        "source": "T13n0397_060:0404b21_3"
    },
    {
        "source_sentence": "「轉入口，口所得美味好語言當忍不得令轉，百八便不得行，是為美味好語言忍行戒；",
        "translation": "\\",
        "source": "T13n0397_060:0404b22_4"
    },
    {
        "source_sentence": "口所得中味中語言，從中味中語言當忍不得令轉，百八便不得行，是為忍中味中語言忍行戒；",
        "translation": "This is the morality of forbearance, patience, tolerance, and acting [against false] speech in middling flavors obtained by mouth. When speaking in middling flavors, one should tolerate it without causing it to be",
        "source": "T13n0397_060:0404b24_5"
    },
    {
        "source_sentence": "口所得惡味惡語言當忍不得令轉，百八便不得行，是為忍惡味惡語言忍行戒。",
        "translation": "You must tolerate bad sounds and bad words obtained from your mouth and not allow them to be turned around, and you won't do one hundred and eight of them. This is the precept for tolerating bad sounds and bad words and tolerating the practice",
        "source": "T13n0397_060:0404b26_6"
    },
    {
        "source_sentence": "「轉入身，身所得好細軟可身，從好細軟可身當忍不得令轉，百八便不得行，",
        "translation": "Again, Ānanda, one hundred and eight [factors] are not allowed to proceed when one turns inside the body:",
        "source": "T13n0397_060:0404b28_7"
    },
    {
        "source_sentence": "是為忍好細軟可身忍行戒；",
        "translation": "These are the precepts of patience, goodness, subtlety, gentleness, and forbearance.",
        "source": "T13n0397_060:0404c01_8"
    },
    {
        "source_sentence": "身所得中細軟，從中細軟當忍不得令轉，百八便不得行，是為忍中細軟忍行戒；",
        "translation": "The middle subtle and minor ones acquired by the body are tolerated, while the middle subtle and minor ones should be tolerated. One hundred and eight cannot proceed. This is the one hundred and eighth precept of patience.",
        "source": "T13n0397_060:0404c02_9"
    },
    {
        "source_sentence": "身所得惡麁堅苦痛不可身，從惡麁堅苦痛不可身當忍不得令轉，百八便不得行，",
        "translation": "The pain and suffering of bad abscesses that arise from the body are unbearable to the body, and one hundred and eight can't walk because they can't tolerate it.",
        "source": "T13n0397_060:0404c03_10"
    },
    {
        "source_sentence": "是為惡麁堅苦痛不可身忍行戒。」",
        "translation": "This is the precept of not tolerating bad anger, hard suffering, pain, and unbearable physical actions.",
        "source": "T13n0397_060:0404c05_11"
    },
    {
        "source_sentence": "佛言：「是為菩薩十校計。」",
        "translation": "The Buddha said, These are the bodhisattva's ten calculations.",
        "source": "T13n0397_060:0404c06_12"
    },
    {
        "source_sentence": "佛言：「菩薩復有十校計。」",
        "translation": "The Buddha said, Again, there are ten ways to calculate for bodhisattvas.",
        "source": "T13n0397_060:0404c08_0"
    },
    {
        "source_sentence": "諸菩薩稽首問佛：「何等為十校計？」",
        "translation": "The bodhisattvas bowed their heads and asked the Buddha, What are the ten calculations?",
        "source": "T13n0397_060:0404c08_1"
    },
    {
        "source_sentence": "佛言：「菩薩當能耐辱，能耐辱便入道。」",
        "translation": "The Buddha said, A bodhisattva will be able to endure humility, and if he can endure humility, then he'll enter the path.",
        "source": "T13n0397_060:0404c09_2"
    },
    {
        "source_sentence": "諸菩薩問佛：「何等為耐辱入道？」",
        "translation": "The bodhisattvas asked the Buddha, What's the way to tolerate humility and enter the path?",
        "source": "T13n0397_060:0404c10_3"
    },
    {
        "source_sentence": "佛言：「菩薩心有所念，當辱心不得令念，便辱百八罪不得勝，是為辱心入道。",
        "translation": "The Buddha said, When a bodhisattva's mind has thoughts, he humiliates his mind and doesn't allow it to be so humiliated that one hundred and eight sins won't be overcome; this is the path of humiliating his mind and en",
        "source": "T13n0397_060:0404c10_4"
    },
    {
        "source_sentence": "「轉入意，意有所念，當辱意不得令念，便辱百八罪不得勝，是為辱意入道。",
        "translation": "When he turns to enter the mind, his mind has thoughts, and when he doesn't allow those thoughts to be honored, then he insults a hundred or eight sins and doesn't overcome them.",
        "source": "T13n0397_060:0404c12_5"
    },
    {
        "source_sentence": "「轉入識，識有所念，當辱識不得令念，便辱百八罪不得勝，是為辱識入道。",
        "translation": "When he turns to enter consciousness, his consciousness has thoughts, and when he insults consciousnesses that can't be made to think, he insults a hundred or eight sins that can't be overcome, which is called the path",
        "source": "T13n0397_060:0404c14_6"
    },
    {
        "source_sentence": "「轉入眼，眼所見好色，當辱好色不得令念，便辱百八不得勝，是為辱好色入道；",
        "translation": "When he turns and enters his eyes, the eye sees beautiful forms. If he humiliates these beautiful forms but doesn’t allow them to be seen, then he humiliates one hundred and eight and doesn’t overcome them.",
        "source": "T13n0397_060:0404c15_7"
    },
    {
        "source_sentence": "眼所見中色，當辱中色不得令念，便辱百八不得勝，是為辱中色入道；",
        "translation": "When the eye sees an intermediate form, it should humiliate a middle form and not allow it to be remembered, and then humiliating one hundred and eight cannot overcome it. This is entering the path by humiliating medium form.",
        "source": "T13n0397_060:0404c17_8"
    },
    {
        "source_sentence": "眼所見惡色，當辱惡色不得令念，便辱百八不得勝，是為辱惡色入道。",
        "translation": "When the eye sees bad forms, it dishonors bad forms and doesn't allow them to be remembered, and then it dishonors one hundred and eight and doesn't overcome them.",
        "source": "T13n0397_060:0404c19_9"
    },
    {
        "source_sentence": "「轉入耳，耳所聞好聲，當辱好聲不得令念，便辱百八不得勝，是為辱好聲入道；",
        "translation": "When one turns the wheel and enters his ears, hearing good sounds through his ears. If he humiliates these good sounds but does not allow them to be heard, then he humiliates one hundred and eight and is unable to overcome them.",
        "source": "T13n0397_060:0404c20_10"
    },
    {
        "source_sentence": "耳所聞中聲，當辱中聲不得令念，便辱百八不得勝，是為辱中聲入道；",
        "translation": "When the middle voice heard in one’s ear is disrespectful to the middle voice and does not allow it to be heard, thereby disrespecting one hundred and eight [factors] and not being able to overcome them. This is called entering the path by",
        "source": "T13n0397_060:0404c22_11"
    },
    {
        "source_sentence": "耳所聞惡聲，當辱惡聲不得令念，便辱百八不得勝，是為辱惡聲入道。",
        "translation": "If someone hears bad sounds in their ears and doesn't allow them to be heard, then they'll humiliate one hundred and eight people and won't be able to overcome them. This is the path of humiliating bad sounds that enter the path.",
        "source": "T13n0397_060:0404c24_12"
    },
    {
        "source_sentence": "「轉入鼻，鼻所聞好香，當辱好香不得令念，便辱百八不得勝，是為辱好香入道；",
        "translation": "Again, when one turns to the nose and smells a good odor with his nose, he should disrespect that good odor and not allow it to be remembered. If he disrespects one hundred and eight [factors] without success, this is",
        "source": "T13n0397_060:0404c25_13"
    },
    {
        "source_sentence": "鼻所聞中香，當辱中香不得令念，便辱百八不得勝，是為辱中香入道；",
        "translation": "When the nose hears a neutral fragrance, it should dishonor that neutral fragrance and not allow it to be remembered. And if one dishonors one hundred and eight [factors] without being able to overcome them, this is called entering",
        "source": "T13n0397_060:0404c27_14"
    },
    {
        "source_sentence": "鼻所聞惡臭，當辱惡臭不得令念，便辱百八不得勝，是為辱惡臭入道。",
        "translation": "When the nose hears a bad odor, it must humiliate that bad odor and won't allow it to be remembered, and then one hundred and eight insults won't be victorious.",
        "source": "T13n0397_060:0404c29_15"
    },
    {
        "source_sentence": "「轉入口，口所得美味好語言，當辱美味好語言不得令念，便辱百八不得勝，",
        "translation": "When he turns to his mouth, speaks words that are delicious and good-tasting, insults words that are delicious and good-tasting, doesn't allow them to be remembered, then insults one hundred and eight and doesn't",
        "source": "T13n0397_060:0405a01_16"
    },
    {
        "source_sentence": "是為辱美味好語言入道；",
        "translation": "This is to humiliate, delicious, and speak well before entering the path.",
        "source": "T13n0397_060:0405a03_17"
    },
    {
        "source_sentence": "口所得中味中語言，當辱中味中語言不得令念，便辱百八不得勝，是為辱中味中語言入道；",
        "translation": "When one speaks words that are of a neutral taste but do not cause others to think of them, and then humiliating one hundred and eight cannot be victorious. This is called entering the path by humiliating [someone] with words that are of a neutral taste",
        "source": "T13n0397_060:0405a04_18"
    },
    {
        "source_sentence": "口所得惡味惡語言不得令念，便辱百八不得勝，是為辱惡味惡語言入道。",
        "translation": "If he doesn't allow the bad taste of bad speech obtained from his mouth to be remembered, then he insults 108 people and doesn't win, which is called insulting the path by speaking bad words that have a bad taste.",
        "source": "T13n0397_060:0405a06_19"
    },
    {
        "source_sentence": "「轉入身，身所得好細軟可身，當辱好細軟可身不得令念，便辱百八不得勝，",
        "translation": "Again, Ānanda, as soon as one has turned around and entered a body that is neither pleasant nor disagreeable to the body, he or she will humiliate another person with a body that is neither pleasant nor disagreeable. He or she will then humiliate",
        "source": "T13n0397_060:0405a07_20"
    },
    {
        "source_sentence": "是為辱細軟可身入道；",
        "translation": "This is called entering the path through humility, subtlety, and gentleness.",
        "source": "T13n0397_060:0405a09_21"
    },
    {
        "source_sentence": "身所得中細軟，當辱中細軟不得令念，便辱百八不得勝，是為辱中細軟入道；",
        "translation": "The middle subtle and the weak are acquired by the body. If one humiliates the middle subtle and the weak but does not allow them to be touched, then he humiliates 108 and does not overcome them. This is called humiliating the middle sub",
        "source": "T13n0397_060:0405a10_22"
    },
    {
        "source_sentence": "身所得惡麁堅苦痛不可身，當辱惡麁堅苦痛不可身不得令念，便辱百八不得勝，",
        "translation": "If he doesn't allow the body to be touched by bad mannerisms that are hard and painful, or if he humiliates himself with bad mannerisms that are hard and painful so that he can't think of them, then he'll humiliate",
        "source": "T13n0397_060:0405a11_23"
    },
    {
        "source_sentence": "是為辱惡麁堅苦痛不可身入道。」",
        "translation": "This is a humiliation that's harsh, coarse, and painful, so you can't enter the path with your body.",
        "source": "T13n0397_060:0405a13_24"
    },
    {
        "source_sentence": "佛言：「菩薩行如是，為應菩薩忍戒行，菩薩以忍辱便得百八合道願，",
        "translation": "The Buddha said, Thus does the bodhisattva practice in response to the bodhisattva’s practice of forbearance and morality.",
        "source": "T13n0397_060:0405a14_25"
    },
    {
        "source_sentence": "便得百八本信入道，便得百八出癡入慧，便得百八歡喜還滅，便得百八佛悲心，",
        "translation": "They’ll attain one hundred and eight fundamental faiths entering the path, one hundred and eight liberations from delusion entering wisdom, one hundred and eight joys returning to cessation, and one hundred and eight compassionate states of Buddhahood.",
        "source": "T13n0397_060:0405a16_26"
    },
    {
        "source_sentence": "便得百八未得佛道愁。",
        "translation": "They'll then attain the sadness of one hundred and eight who haven't attained the Buddha Way.",
        "source": "T13n0397_060:0405a17_27"
    },
    {
        "source_sentence": "「何等為佛百八悲心？",
        "translation": "“What are the one hundred and eight compassionate states of mind of the Buddha?",
        "source": "T13n0397_060:0405a18_28"
    },
    {
        "source_sentence": "何等為百八未得佛道愁？",
        "translation": "What are the 108 griefs of those who haven't yet attained the Buddha Way?",
        "source": "T13n0397_060:0405a18_29"
    },
    {
        "source_sentence": "謂菩薩得佛悲心，念十方泥犁中人難得度脫。",
        "translation": "It means a bodhisattva attains the Buddha's compassionate mind and is mindful that it's difficult for people in the mud plows in the ten directions to be liberated.",
        "source": "T13n0397_060:0405a19_30"
    },
    {
        "source_sentence": "謂菩薩得佛悲心，念禽獸蜎飛蠕動難得度脫。",
        "translation": "It means that when a bodhisattva attains the Buddha's compassionate mind, he's mindful of birds and animals flying and wriggling but it's difficult to escape.",
        "source": "T13n0397_060:0405a20_31"
    },
    {
        "source_sentence": "謂菩薩得佛悲心，念薜荔中餓鬼難得度脫。",
        "translation": "It means that when a bodhisattva attains the Buddha's compassionate mind, he's mindful of the hungry ghosts in Kauṇḍinya and has difficulty liberating them.",
        "source": "T13n0397_060:0405a21_32"
    },
    {
        "source_sentence": "謂菩薩得佛悲心，念二十八天及諸天長壽憍樂不知苦習難得度脫。",
        "translation": "It means that when a bodhisattva attains the Buddha's compassionate mind, he's mindful of the 28 gods and goddesses who have long life and bliss but don't know that it's difficult to save them from",
        "source": "T13n0397_060:0405a22_33"
    },
    {
        "source_sentence": "謂菩薩得佛悲心，念世間帝王豪貴難得度脫。",
        "translation": "It means that when a bodhisattva attains the Buddha's compassionate mind, he's mindful of the world's emperor's nobleness and difficulty in liberation.",
        "source": "T13n0397_060:0405a24_34"
    },
    {
        "source_sentence": "謂菩薩得佛悲心，念世間癡人不解難得度脫。",
        "translation": "It means that when a bodhisattva attains the Buddha's compassionate mind, he's mindful of worldly deluded people who don't understand and have difficulty liberating them.",
        "source": "T13n0397_060:0405a25_35"
    },
    {
        "source_sentence": "謂菩薩得佛悲心，念世間人多癡難得度脫。",
        "translation": "It means a bodhisattva attains the Buddha's compassionate mind, which is mindful that worldly people are often deluded and difficult to liberate.",
        "source": "T13n0397_060:0405a26_36"
    },
    {
        "source_sentence": "謂菩薩得佛悲心，念十方五道一切五道一切同法難得度脫。",
        "translation": "It means that when a bodhisattva attains the Buddha's compassionate mind, he's mindful of the five paths in the ten directions, all five paths, and all the same things in the five paths are difficult to liberate",
        "source": "T13n0397_060:0405a27_37"
    },
    {
        "source_sentence": "如是菩薩為得佛悲心，便得佛愁。",
        "translation": "Thus, in order to attain the Buddha's compassionate mind, the bodhisattva then attains the Buddha's sorrow.",
        "source": "T13n0397_060:0405a28_38"
    },
    {
        "source_sentence": "謂菩薩念十方五道勤苦難得度脫愁，菩薩已悲已愁百八愛復增多，如是菩薩不可用百八愛增多故不悲愁。」",
        "translation": "It means that a bodhisattva is mindful of the hardships of the five paths in the ten directions and how difficult it is to overcome and liberate from sorrow, and once he's sad and grieved, one hundred and eight love",
        "source": "T13n0397_060:0405a29_39"
    },
    {
        "source_sentence": "佛言：「我但用十方五道勤苦悲愁故得佛，是為菩薩未得佛百八悲，是為菩薩未得佛百八愁。」",
        "translation": "The Buddha said, This is the one hundred and eight compassions of a bodhisattva who hasn't yet attained buddhahood because they've only used the five paths of suffering and sorrow in the ten directions to attain buddhahood",
        "source": "T13n0397_060:0405b03_40"
    },
    {
        "source_sentence": "佛言：「復有菩薩未得佛百八惱。」",
        "translation": "The Buddha said, Again, there are 108 afflictions of a bodhisattva who hasn't yet attained buddhahood.",
        "source": "T13n0397_060:0405b05_41"
    },
    {
        "source_sentence": "諸菩薩問佛言：「何等為菩薩百八惱？」",
        "translation": "The bodhisattvas asked the Buddha, What are the 108 afflictions of a bodhisattva?",
        "source": "T13n0397_060:0405b06_0"
    },
    {
        "source_sentence": "佛言：「謂菩薩未得佛，見十方泥犁中人拷掠毒痛，欲往度脫不能度脫便生惱。",
        "translation": "The Buddha said, Suppose a bodhisattva who hasn't yet attained buddhahood sees people in the mud plows in the ten directions tortured and pained with poison and wants to be liberated but can't be liberated,",
        "source": "T13n0397_060:0405b06_1"
    },
    {
        "source_sentence": "謂菩薩未得佛，見禽獸蜎飛蠕動及人民轉相拷掠毒痛相殺，菩薩欲度不能度便生惱。",
        "translation": "It means that a bodhisattva who hasn't yet attained buddhahood sees birds, animals, ants, wriggling creatures, and people torturing each other, poisonous pain, and killing each other, and the bo",
        "source": "T13n0397_060:0405b08_2"
    },
    {
        "source_sentence": "謂菩薩未得佛，見薜荔餓鬼無所食，欲度脫不能度便生惱。",
        "translation": "It means a bodhisattva who hasn't yet attained Buddhahood and sees that the hungry ghosts of Kauśinagara have nothing to eat, and anger arises when he wants to be liberated but can't be liberated.",
        "source": "T13n0397_060:0405b10_3"
    },
    {
        "source_sentence": "謂菩薩未得作佛，見世間人所作惡貪婬瞋恚烹殺祠祀貪利強盜快心恣意，",
        "translation": "It means that a bodhisattva who has yet to become a buddha sees worldly bad cravings, anger, hatred, cooking, killing, sacrifice, greed, violence, thievery, and happiness created by people in the",
        "source": "T13n0397_060:0405b11_4"
    },
    {
        "source_sentence": "見是曹人死生五道苦痛無有斷絕。",
        "translation": "Seeing this, the Cao people die and are born in the five destinies of pain and suffering without cessation.",
        "source": "T13n0397_060:0405b13_5"
    },
    {
        "source_sentence": "雖上為諸天無有別異，要五道死生苦痛，便不時得佛便生惱，便增盛百八愛行，",
        "translation": "Even though there are no distinctions among the gods above, if they die in the five destinies and experience pain and suffering, then when they don't attain Buddhahood, anguish will arise, and 108 kinds of craving will increase.",
        "source": "T13n0397_060:0405b14_6"
    },
    {
        "source_sentence": "是為菩薩未得佛百八惱。",
        "translation": "These are the 108 afflictions of a bodhisattva who hasn't yet attained buddhahood.",
        "source": "T13n0397_060:0405b16_7"
    },
    {
        "source_sentence": "謂菩薩未得佛經要百八黠，未得佛泥洹要。」",
        "translation": "It means a bodhisattva hasn't yet attained the essentials of the Buddha's sūtras and 108 skillfulnesses, and he hasn't yet attained the essentials of the Buddha's nirvāṇa.",
        "source": "T13n0397_060:0405b16_8"
    },
    {
        "source_sentence": "諸菩薩復問佛：「何等為百八得佛經黠？」",
        "translation": "Again, the bodhisattvas asked the Buddha, What are the 108 ways to attain the wisdom of the Buddha's sūtras?",
        "source": "T13n0397_060:0405b17_9"
    },
    {
        "source_sentence": "佛言：「謂菩薩能自護六情百八不行，為得佛經黠。」",
        "translation": "The Buddha said, Suppose a bodhisattva can protect himself from the one hundred and eight things he doesn't do with his six emotions in order to attain the intelligence of the Buddha's sūtras.",
        "source": "T13n0397_060:0405b18_10"
    },
    {
        "source_sentence": "「何等為未得佛泥洹要？」",
        "translation": "What are the essentials of nirvāṇa that have yet to be attained by the Buddha?",
        "source": "T13n0397_060:0405b19_11"
    },
    {
        "source_sentence": "佛言：「謂菩薩未得佛，未得泥洹要。」",
        "translation": "The Buddha said, It means a bodhisattva hasn't yet attained buddhahood and hasn't yet attained the essentials of nirvāṇa.",
        "source": "T13n0397_060:0405b20_12"
    },
    {
        "source_sentence": "佛言：「諸菩薩當校計百八出罪要，便得入泥洹要。」",
        "translation": "The Buddha said, All bodhisattvas will calculate the one hundred and eight essentials for expelling sins so that they can enter the essentials of nirvāṇa.",
        "source": "T13n0397_060:0405b21_13"
    },
    {
        "source_sentence": "菩薩復問佛言：「何等為出罪要便得入泥洹要？」",
        "translation": "Again, the bodhisattva asked the Buddha, What's the essential way to escape from sin and then enter nirvāṇa?",
        "source": "T13n0397_060:0405b22_14"
    },
    {
        "source_sentence": "佛言：「謂菩薩所念為罪出要當滅，滅者為得入泥洹要，一切六情百八滅，",
        "translation": "The Buddha said, Suppose a bodhisattva's thoughts are about sins that will be extinguished in the essentials of entering nirvāṇa, and when they cease, he attains the essentials of entering nirvāṇa",
        "source": "T13n0397_060:0405b23_15"
    },
    {
        "source_sentence": "亦為入泥洹要，是為菩薩出百八罪入泥洹要，是為菩薩十校計。」",
        "translation": "It's also the essential way to enter nirvāṇa, which is the bodhisattva's essential way to escape the 108 sins and enter nirvāṇa, and this is the bodhisattva's ten ways to calculate.",
        "source": "T13n0397_060:0405b25_16"
    },
    {
        "source_sentence": "佛言：「菩薩復有十校計：第一、菩薩相聚會，但當校計百八當令盡，",
        "translation": "The Buddha said, Again, there are ten ways to calculate the number of bodhisattvas: first, when the bodhisattvas gather together, they should simply calculate the 108 that will be ended.",
        "source": "T13n0397_060:0405b27_0"
    },
    {
        "source_sentence": "當求入慧出罪，便應菩薩法；",
        "translation": "They should seek to enter into wisdom and extinguish sins, then they should follow the teaching of enlightening beings.",
        "source": "T13n0397_060:0405b28_1"
    },
    {
        "source_sentence": "二者、當校計菩薩百八求入空法，便出罪空法，是為菩薩百八校計出罪入道空；",
        "translation": "These are the one hundred and eight ways a bodhisattva proofreads the emptiness of the path by expudiating the doctrine of emptiness.",
        "source": "T13n0397_060:0405b29_2"
    },
    {
        "source_sentence": "三者、菩薩當校計百八罪法初起空生時，當知校計滅歸空時，是為菩薩校計百八生滅，",
        "translation": "3. The bodhisattva should calculate the one hundred and eight sins at the time when emptiness first arises, knowing that they are calculated to cease and return to emptiness. This is the bodhisattva’s calculation of the one",
        "source": "T13n0397_060:0405c01_3"
    },
    {
        "source_sentence": "為合空以知生滅，是為菩薩諦校計；",
        "translation": "To combine emptiness in order to know arising and ceasing is the analytical calculation of enlightening beings’ truth.",
        "source": "T13n0397_060:0405c03_4"
    },
    {
        "source_sentence": "四者、菩薩當校計百八持空法解盡法。」",
        "translation": "4. The bodhisattva will calculate the one hundred and eight ways to maintain emptiness and understand the exhaustion of dharmas.",
        "source": "T13n0397_060:0405c04_5"
    },
    {
        "source_sentence": "諸菩薩復問佛：「何等為持空法解盡法？」",
        "translation": "Again, the bodhisattvas asked the Buddha, What's the way to maintain emptiness and understand the end of dharmas?",
        "source": "T13n0397_060:0405c05_6"
    },
    {
        "source_sentence": "佛言：「菩薩一切知十方所有本末皆空已，知空知所有當復滅盡。",
        "translation": "The Buddha said, All the bodhisattvas know that all the beginnings and ends in the ten directions are empty, and knowing emptiness and knowing what exists will again cease.",
        "source": "T13n0397_060:0405c06_7"
    },
    {
        "source_sentence": "菩薩知盡以為諦，即不復貪百八。",
        "translation": "The bodhisattva knows that it's the truth of exhaustion, which means he no longer clings to 108.",
        "source": "T13n0397_060:0405c08_0"
    },
    {
        "source_sentence": "不復行著欲，菩薩能自解當知盡，是為菩薩校計持空法解盡法，是為菩薩校計百八解盡應法。",
        "translation": "A bodhisattva who no longer practices attachment to desire and can understand for himself that he should know the end of it is a bodhisattva who calibrates the method of understanding the end of emptiness by maintaining emptiness, which is a",
        "source": "T13n0397_060:0405c08_1"
    },
    {
        "source_sentence": "「五者、菩薩當校計百八盡法不復生，已知不復生，是為菩薩校計盡法不復生已知不復生法；",
        "translation": "“Fifth, the enlightening beings should calculate the one hundred and eight principles of extinction as not arising again; they know they will not arise again.",
        "source": "T13n0397_060:0405c10_2"
    },
    {
        "source_sentence": "六者、菩薩當校計百八盡，當得泥洹長生不復滅不死，菩薩得是校計自知苦，",
        "translation": "6. The bodhisattva will calculate the one hundred and eight ends, and he'll attain nirvāṇa for a long time to come without ceasing or dying.",
        "source": "T13n0397_060:0405c13_3"
    },
    {
        "source_sentence": "是為菩薩法知泥洹樂校計法；",
        "translation": "“This is enlightening beings’ way of knowing the principle of nirvana and enjoying the method of calculation.",
        "source": "T13n0397_060:0405c14_4"
    },
    {
        "source_sentence": "七者、菩薩當校計知百八盡泥洹念，是為菩薩知泥洹校計相念；",
        "translation": "The seventh is that enlightening beings should calculate and know the one hundred and eight kinds of cessation of mindfulness of nirvana. This is enlightening beings’ calculating mindfulness of knowing the characteristics of nirvana.",
        "source": "T13n0397_060:0405c15_5"
    },
    {
        "source_sentence": "八者、菩薩當校計百八滅盡捨相念不復念，是為菩薩百八捨相念不復念校計；",
        "translation": "The eighth is that the enlightening beings should calculate the one hundred and eight forms of cessation, abandoning thoughts and no more thoughts. This is the enlightening being’s calculation of the one hundred and eight forms of equanim",
        "source": "T13n0397_060:0405c17_0"
    },
    {
        "source_sentence": "九者、菩薩當校計所念不盡便生雜相念，以知雜相念，當校計泥洹無所有，",
        "translation": "The ninth is that the bodhisattva should examine and calculate what’s thought of inexhaustible, and then give rise to thoughts of mixed characteristics. Because he knows these thoughts of mixed characteristics, he should examine and calcula",
        "source": "T13n0397_060:0405c18_1"
    },
    {
        "source_sentence": "何以故復有雜相念當復滅，是為菩薩知雜相念校計；",
        "translation": "This is enlightening beings’ calculation based on knowledge of the mixture of images.",
        "source": "T13n0397_060:0405c20_2"
    },
    {
        "source_sentence": "十者、菩薩當校計自知滅無所有，長受泥洹相，泥洹長生不復滅，是為菩薩校計受泥洹相。",
        "translation": "Tenth, the bodhisattva should calculate that he knows for himself that cessation has no existence and that he'll experience the characteristic of nirvāṇa for a long time, and that nirvāṇa will arise for a long time and",
        "source": "T13n0397_060:0405c21_3"
    },
    {
        "source_sentence": "是為菩薩十校計。」",
        "translation": "These are the bodhisattva's ten calculations.",
        "source": "T13n0397_060:0405c23_4"
    },
    {
        "source_sentence": "佛言：「菩薩復有十校計。」",
        "translation": "The Buddha said, Again, there are ten ways to calculate for bodhisattvas.",
        "source": "T13n0397_060:0405c25_0"
    },
    {
        "source_sentence": "諸菩薩問佛：「何等為菩薩十校計？」",
        "translation": "The bodhisattvas asked the Buddha, What are the bodhisattva's ten calculations?",
        "source": "T13n0397_060:0405c25_1"
    },
    {
        "source_sentence": "佛言：「一者、菩薩自知百八罪，亦當為十方人說百八罪，亦當為人說十方生死五道苦痛，",
        "translation": "The Buddha said: First, if a bodhisattva knows one hundred and eight sins for himself, he should also tell others in the ten directions of one hundred and eight sins. He should also tell others of the pain and suffering of the five realms of birth",
        "source": "T13n0397_060:0405c26_2"
    },
    {
        "source_sentence": "常當為十方人說萬物成敗本末生死無所有，是為菩薩一校計；",
        "translation": "To always tell the people of the ten directions that all things becoming and decaying, beginning and end, birth and death, have no existence is a composite designation for enlightening beings.",
        "source": "T13n0397_060:0405c28_3"
    },
    {
        "source_sentence": "二者、菩薩當校計十方成敗牽證用示人，是為菩薩牽證校計解人法；",
        "translation": "The second is that enlightening beings should calculate the becoming and decay of all things in the ten directions, leading to their realization and showing it to others. This is enlightening beings’ way of calculating people’s understanding by projecting",
        "source": "T13n0397_060:0405c29_4"
    },
    {
        "source_sentence": "三者、菩薩當校計十方人所有皆坐貪故著，以貪著皆為癡，菩薩常當為人解貪著解人癡，",
        "translation": "3. The bodhisattva should calculate that all the possessions of people in the ten directions are seated in craving because they're attached, and with craving and attachment, they're all deluded.",
        "source": "T13n0397_060:0406a02_5"
    },
    {
        "source_sentence": "菩薩亦當持貪癡還自況，我未知菩薩道時貪癡亦劇，是菩薩得是校計；",
        "translation": "The enlightening beings also should maintain craving and delusion and return to their own state. I do not know that at the moment of the path of enlightening beings, craving and delusion are also serious. This is how the enlightening",
        "source": "T13n0397_060:0406a04_6"
    },
    {
        "source_sentence": "常當慈心解人貪癡，是為菩薩校計；",
        "translation": "Always be compassionate and understanding the cravings and delusions of others. This is enlightening beings’ calculation.",
        "source": "T13n0397_060:0406a06_0"
    },
    {
        "source_sentence": "四者、菩薩常當校計百八牽十方癡人作證。」",
        "translation": "4. The bodhisattva always  calibrates the one hundred and eight drags of deluded people in the ten directions to realize it.",
        "source": "T13n0397_060:0406a06_1"
    },
    {
        "source_sentence": "諸菩薩復問佛：「何等為牽十方癡人作證？」",
        "translation": "Again, the bodhisattvas asked the Buddha, What's the realization of leading deluded people in the ten directions?",
        "source": "T13n0397_060:0406a07_2"
    },
    {
        "source_sentence": "佛言：「十方人所念皆坐百八癡，故菩薩去百八乃為不癡。",
        "translation": "The Buddha said, All the thoughts people in the ten directions have a hundred and eight delusions, so the bodhisattva departs from a hundred and eight and becomes not deluded.",
        "source": "T13n0397_060:0406a08_3"
    },
    {
        "source_sentence": "菩薩失行百八行便為癡，常當牽十方癡人作證不得失行，是為菩薩校計法。",
        "translation": "A bodhisattva who loses one hundred and eight practices becomes deluded, and he always leads deluded people in the ten directions to realize that they can't lose practice. This is the method of the bodhisattva's calculation",
        "source": "T13n0397_060:0406a10_4"
    },
    {
        "source_sentence": "「五者、菩薩當復校計百八牽十方阿羅漢作證者。」",
        "translation": "5. The bodhisattva will again  calibrate the 108 arhats who lead the arhats of the ten directions to realize it.",
        "source": "T13n0397_060:0406a11_5"
    },
    {
        "source_sentence": "諸菩薩言：「復校計百八牽阿羅漢作證云何？」",
        "translation": "The bodhisattvas said, What's the realization of the one hundred and eightfold led arhat?",
        "source": "T13n0397_060:0406a13_0"
    },
    {
        "source_sentence": "佛言：「菩薩失行但坐貪著，故當牽阿羅漢泥洹去無所有。",
        "translation": "The Buddha said, A bodhisattva's lack of practice is simply sitting and craving, so he'll lead an arhat into nirvāṇa away from nothing.",
        "source": "T13n0397_060:0406a14_0"
    },
    {
        "source_sentence": "我何為所念失行？",
        "translation": "What's the mistaken practice of mindfulness of self?",
        "source": "T13n0397_060:0406a15_1"
    },
    {
        "source_sentence": "何為當坐是苦所念？",
        "translation": "Why is the seat of future existence to be thought of as that which is painful?",
        "source": "T13n0397_060:0406a15_2"
    },
    {
        "source_sentence": "牽阿羅漢泥洹常作證，是為菩薩校計法。",
        "translation": "To lead the arhats to nirvāṇa and always realize it is the bodhisattva's method of calculation.",
        "source": "T13n0397_060:0406a16_3"
    },
    {
        "source_sentence": "「六者、若復失行，當校計百八牽辟支佛泥洹無所有作證，是為菩薩校計法；",
        "translation": "“The sixth is that if there are any further errors in practice, one should calculate the nirvana of the hundred and eight leading pratyekabuddhas as having no existence to realize.",
        "source": "T13n0397_060:0406a17_4"
    },
    {
        "source_sentence": "七者、菩薩若失行，當復校計百八無所有，當牽十方過去佛泥洹無所有，",
        "translation": "7. If the bodhisattva loses his practice, he'll again calculate a hundred or eight things that have nothing, and he'll lead the buddhas of the past nirvāṇa in the ten directions into nirvāṇa without anything.",
        "source": "T13n0397_060:0406a18_5"
    },
    {
        "source_sentence": "十方過去佛皆我師，皆取泥洹去，我何為失行行在世間？",
        "translation": "The buddhas of the past in the ten directions were all my teachers, and they all took nirvāṇa and departed, so why did I lose my practice in the world?",
        "source": "T13n0397_060:0406a20_6"
    },
    {
        "source_sentence": "菩薩已牽證便還攝行，是為菩薩牽證校計法；",
        "translation": "Enlightening beings who have been led by realization return to collect practice. This is the method of enlightening beings’ analytical inquiry leading to realization.",
        "source": "T13n0397_060:0406a21_7"
    },
    {
        "source_sentence": "八者、菩薩復失行，當復牽現在十方佛亦當泥洹去，常當牽自證，已自證當即還行，",
        "translation": "8. When the bodhisattva again loses his practice, he'll again lead the buddhas of the ten directions in the present to nirvāṇa and depart, always leading himself to realize it, and then returning to practice after realizing it.",
        "source": "T13n0397_060:0406a22_8"
    },
    {
        "source_sentence": "是為菩薩百八牽證還行校計法；",
        "translation": "These are the one hundred and eight methods of calculating enlightening beings’ realization of return.",
        "source": "T13n0397_060:0406a24_9"
    },
    {
        "source_sentence": "九者、菩薩當校計百八復失行。」",
        "translation": "Nine, the bodhisattva will calculate one hundred and eight further errors of practice.",
        "source": "T13n0397_060:0406a25_10"
    },
    {
        "source_sentence": "佛言：「我今作釋迦文佛，我所主天地帝王人民皆屬我，自在飛行大威神，",
        "translation": "The Buddha said, “I now become the buddha Śākyamuni. My lordship over heaven and earth, ruler of all people, belongs to me.",
        "source": "T13n0397_060:0406a26_11"
    },
    {
        "source_sentence": "我要般泥洹去歸無所有，常當牽我作證，常當堅意求佛，持我作證意不轉，",
        "translation": "I want to enter final nirvana and return to nonexistence, always leading me to realize it. Always seeking buddhahood with firmness of mind, maintaining my realization without turning away from it.",
        "source": "T13n0397_060:0406a27_12"
    },
    {
        "source_sentence": "轉者為失行，便墮盛百八愛行中，是為菩薩校計。",
        "translation": "To turn is to lose practice and fall into the 108 cravings that flourish in practice, which is a bodhisattva's calculation.",
        "source": "T13n0397_060:0406a29_13"
    },
    {
        "source_sentence": "「十者、菩薩常當盡力却貪，令不得受求，受求者為不應菩薩，菩薩諦求分別思惟我所校計，",
        "translation": "Tenth, a bodhisattva should always exert all his might to dispel craving so that neither he receives nor asks for anything.",
        "source": "T13n0397_060:0406b01_14"
    },
    {
        "source_sentence": "是為菩薩五十校計。」",
        "translation": "This is the bodhisattva's fifty calculations.",
        "source": "T13n0397_060:0406b03_15"
    },
    {
        "source_sentence": "佛言：「諸菩薩行安般守意常苦失行，無有不失行。」",
        "translation": "The Buddha said, There's no practice that isn't lost when bodhisattvas practice well-being and guard their minds with constant painfulness.",
        "source": "T13n0397_060:0406b04_16"
    },
    {
        "source_sentence": "時諸菩薩問佛：「何以故？",
        "translation": "The bodhisattvas then asked the Buddha, Why is that?",
        "source": "T13n0397_060:0406b05_17"
    },
    {
        "source_sentence": "我曹作菩薩常苦失行。」",
        "translation": "I'm a bodhisattva who always suffers from the practice of suffering and loss.",
        "source": "T13n0397_060:0406b05_18"
    },
    {
        "source_sentence": "佛言：「菩薩不厭生死苦習故，不自覺生死習故，不諦知生死盡無所有，",
        "translation": "The Buddha said: Because bodhisattvas are not disgusted by the arising of suffering in birth and death, because they do not realize for themselves the arising of birth and death, and because they do not truly know that birth and death have no existence.",
        "source": "T13n0397_060:0406b06_19"
    },
    {
        "source_sentence": "不諦知有佛泥洹道故。」",
        "translation": "It's because they don't truly know that there's the Buddha's path of nirvāṇa.",
        "source": "T13n0397_060:0406b08_20"
    },
    {
        "source_sentence": "佛言：「諸菩薩不可自用作菩薩道故貢高勝十方人。」",
        "translation": "The Buddha said, Bodhisattvas shouldn't use themselves to create the bodhisattva path and therefore be arrogant and superior to people in the ten directions.",
        "source": "T13n0397_060:0406b08_21"
    },
    {
        "source_sentence": "佛言：「未得佛生死苦習未與盡合未與道合，常有身體苦痛，亦有寒熱苦，",
        "translation": "The Buddha said, Before attaining buddhahood, the painful accumulation of birth-and-death has yet to be united with exhaustion and not united with enlightenment, and there's always pain and suffering in body as well as pain",
        "source": "T13n0397_060:0406b09_22"
    },
    {
        "source_sentence": "亦有飢渴苦惱不能斷，如是菩薩未可自怙其善。」",
        "translation": "There's also hunger and thirst that can't be stopped because of the suffering and distress, so a bodhisattva like this can't rely on his own goodness.",
        "source": "T13n0397_060:0406b11_23"
    },
    {
        "source_sentence": "佛言：「我未得佛時，自謂智慧無能及者，自謂知禪無能及者，自謂知細微滅心無有及者。」",
        "translation": "The Buddha said, When I hadn't yet attained Buddhahood, I thought to myself that wisdom was unmatched, knew meditation was unmatched, and thought to myself that there was no match for the subtle and subtle cessation of mind.",
        "source": "T13n0397_060:0406b12_24"
    },
    {
        "source_sentence": "佛言：「我已立身作釋迦文佛，還自校計作菩薩時所知。",
        "translation": "The Buddha said, I've established myself as Śākyamuni Buddha and then calculated what I knew when I became a bodhisattva.",
        "source": "T13n0397_060:0406b14_25"
    },
    {
        "source_sentence": "譬如一菩薩智，今已作佛有所知；",
        "translation": "“Good man, this is analogous to the knowledge of one bodhisattva who has now become a buddha and knows something.",
        "source": "T13n0397_060:0406b15_26"
    },
    {
        "source_sentence": "譬如十方佛國中，所有萬物菩薩。」",
        "translation": "It's like the bodhisattvas of all things that exist in the buddha lands of the ten directions.",
        "source": "T13n0397_060:0406b16_27"
    },
    {
        "source_sentence": "佛言：「十方佛所有菩薩智慧，未能得一方佛一小塵智。」",
        "translation": "The Buddha said, All the bodhisattva wisdom possessed by the buddhas of the ten directions can't attain a tiny particle of knowledge of the buddhas in one direction.",
        "source": "T13n0397_060:0406b17_28"
    },
    {
        "source_sentence": "菩薩即稽首問佛言：「我曹癡，何以多不能及佛一塵智？」",
        "translation": "The bodhisattva then bowed his head and asked the Buddha, Why is it that so many of my delusions can't match the Buddha's one-pointed wisdom?",
        "source": "T13n0397_060:0406b18_29"
    },
    {
        "source_sentence": "佛言：「用汝不厭生死苦習故，不早取佛故，不知細微意故，不知滅本斷根故。",
        "translation": "The Buddha said, Because you don't tire of the painful accumulation of birth and death, don't quickly grasp the Buddha, don't know subtle thoughts, and don't know the originally eliminated faculty of cessation.",
        "source": "T13n0397_060:0406b19_30"
    },
    {
        "source_sentence": "汝曹盡力精進行，亦當知十方佛智慧。」",
        "translation": "You should also know the wisdom of the buddhas of the ten directions as you exert all your energy and effort.",
        "source": "T13n0397_060:0406b21_31"
    },
    {
        "source_sentence": "諸菩薩問佛：「我何因緣生死多如是？」",
        "translation": "The bodhisattvas asked the Buddha, What are the causes and conditions for my many births and deaths like this?",
        "source": "T13n0397_060:0406b22_32"
    },
    {
        "source_sentence": "佛言：「汝曹不諦行安般守意三十七品經十二問三向中微意，不知分別校計生死百八中細微意，",
        "translation": "The Buddha said, You don't know the subtle meaning of twelve questions in the thirty-seven chapters of the sutra on practicing peacefulness and guarding against error, or the subtle meaning of one hundred and eight subtle meanings in",
        "source": "T13n0397_060:0406b23_33"
    },
    {
        "source_sentence": "故使生死多、難得佛。」",
        "translation": "That's why birth and death are so numerous and difficult to attain Buddhahood.",
        "source": "T13n0397_060:0406b25_34"
    },
    {
        "source_sentence": "佛言：「汝心未起時，中有五百四十百八愛行。",
        "translation": "The Buddha said, When your mind isn't yet arisen, there are 5,040,28 loves and actions.",
        "source": "T13n0397_060:0406b26_0"
    },
    {
        "source_sentence": "心轉作意，中有五百四十百八愛行。",
        "translation": "Among the five hundred and forty-eight cravings, there are five hundred and forty-eight in the mind that transforms into contemplation.",
        "source": "T13n0397_060:0406b27_0"
    },
    {
        "source_sentence": "「意轉作識，中有五百四十百八愛行。",
        "translation": "In the mind that transforms into consciousness, there are five hundred and forty-eight acts of love.",
        "source": "T13n0397_060:0406b27_1"
    },
    {
        "source_sentence": "「轉入眼，眼所見好色，中有五百四十百八愛行；",
        "translation": "“When one turns to the eye, there are five hundred and forty-eight kinds of craving among the fine forms seen by the eye.",
        "source": "T13n0397_060:0406b28_2"
    },
    {
        "source_sentence": "眼所見中色，中有五百四十百八愛行；",
        "translation": "Among the forms seen by the eye, there are five hundred and forty-eight kinds of craving.",
        "source": "T13n0397_060:0406b29_3"
    },
    {
        "source_sentence": "眼所見惡色，中有五百四十百八愛行。",
        "translation": "Among the bad forms seen by the eye, there are five hundred and forty-eight cravings.",
        "source": "T13n0397_060:0406c01_4"
    },
    {
        "source_sentence": "「轉入耳，耳所聞好聲，中有五百四十百八愛行；",
        "translation": "“Entry into the ears consists of five hundred and forty-eight kinds of delightful sounds that are heard by the ears.",
        "source": "T13n0397_060:0406c02_5"
    },
    {
        "source_sentence": "耳所聞中聲，中有五百四十百八愛行；",
        "translation": "Among the sounds heard by the ear, there are five hundred and forty-eight kinds of craving.",
        "source": "T13n0397_060:0406c03_6"
    },
    {
        "source_sentence": "耳所聞惡聲，中有五百四十百八愛行。",
        "translation": "Among the bad sounds heard by the ear, there are 5,040,28 cravings and actions.",
        "source": "T13n0397_060:0406c04_7"
    },
    {
        "source_sentence": "「轉入鼻，鼻所聞好香，中有五百四十百八愛行；",
        "translation": "“When one turns to the nose, there are five hundred and forty-eight kinds of craving in the sweet odor that the nose perceives.",
        "source": "T13n0397_060:0406c05_8"
    },
    {
        "source_sentence": "鼻所聞中香，中有五百四十百八愛行；",
        "translation": "Among the fragrances smelled by the nose, there were five hundred and forty-eight kinds of craving.",
        "source": "T13n0397_060:0406c06_9"
    },
    {
        "source_sentence": "鼻所聞惡臭，中有五百四十百八愛行。",
        "translation": "The bad odor the nose smells contains five hundred and forty-eight kinds of craving.",
        "source": "T13n0397_060:0406c07_10"
    },
    {
        "source_sentence": "「轉入口，口所得好味好語言，中有五百四十百八愛行；",
        "translation": "“In each of the five continents there are five hundred and forty-eight kinds of delightful behavior, such as going from one place to another, enjoying a good taste or engaging in pleasant conversation.",
        "source": "T13n0397_060:0406c08_11"
    },
    {
        "source_sentence": "口所得中味中語言，中有五百四十百八愛行；",
        "translation": "Among the medium-taste and medium-mouthed words obtained by mouth, there are five hundred and forty-eight cravings.",
        "source": "T13n0397_060:0406c09_12"
    },
    {
        "source_sentence": "口所得惡味惡語言，中有五百四十百八愛行。",
        "translation": "Among the bad tastes and bad words that are verbally obtained, there are five hundred and forty-eight kinds of craving.",
        "source": "T13n0397_060:0406c10_13"
    },
    {
        "source_sentence": "「轉入身，身所得好細軟可身，中有五百四十百八愛行；",
        "translation": "“In the body of entering, there are five hundred and forty-eight kinds of craving among the fine and fine bodily sensations that are found in the body.",
        "source": "T13n0397_060:0406c11_14"
    },
    {
        "source_sentence": "身所得中細軟，中有五百四十百八愛行；",
        "translation": "Among the medium subtle and minor bodily forms of enlightenment, there are five hundred and forty-eight kinds of inclination.",
        "source": "T13n0397_060:0406c12_15"
    },
    {
        "source_sentence": "身所得惡麁堅苦痛不可身，中有五百四十百八愛行。」",
        "translation": "What's obtained in the body is bad, coarse, hard, painful, and unwholesome, and there are 5,040,800 cravings in it.",
        "source": "T13n0397_060:0406c13_16"
    },
    {
        "source_sentence": "佛言：「一心中有五百四十百八愛行，五百四十百八愛行中，一愛者當受一生死，",
        "translation": "The Buddha said: In one mind, there are five hundred and forty-eight kinds of craving. Among the five hundred and forty-eight kinds of craving, a single kind of craving is bound to experience life and",
        "source": "T13n0397_060:0406c14_17"
    },
    {
        "source_sentence": "一愛者當受一身，如是不盡五百四十為受五百四十生死身。",
        "translation": "A single craving is to receive one body, and thus it's the body of five hundred and forty births that doesn't end in five hundred and forty.",
        "source": "T13n0397_060:0406c16_18"
    },
    {
        "source_sentence": "意亦爾、識亦爾，好色亦爾、中色亦爾、惡色亦爾，好聲亦爾、中聲亦爾、惡聲亦爾，",
        "translation": "So it is with thought and consciousness, so it is with good forms, so it is with middle forms, so it is with bad forms, so it is with good sounds, so it is with middle sounds, so it is with bad sounds.",
        "source": "T13n0397_060:0406c18_19"
    },
    {
        "source_sentence": "好香亦爾、中香亦爾、惡臭亦爾，美味好語言亦爾、中味中語言亦爾、惡味惡語言亦爾，",
        "translation": "The same applies to sweet smell, to neutral smell, and to bad smell; the same applies to delicious smell, to agreeable smell, to neutral smell, and to unpleasant smell.",
        "source": "T13n0397_060:0406c19_20"
    },
    {
        "source_sentence": "好細軟可身亦爾、中細軟亦爾、惡麁堅苦痛不可身亦爾。」",
        "translation": "Good, fine, subtle, soft, and desirable bodies are likewise, medium, subtle, and gentle, and bad, crude, hard, painful, and un desirable bodies are likewise.",
        "source": "T13n0397_060:0406c21_21"
    },
    {
        "source_sentence": "佛問諸菩薩：「寧知是不？」",
        "translation": "The Buddha asked the bodhisattvas, How do you know it's not?",
        "source": "T13n0397_060:0406c23_22"
    },
    {
        "source_sentence": "諸菩薩言：「聞佛說皆知。」",
        "translation": "The bodhisattvas said, They'll all know what the Buddha teaches.",
        "source": "T13n0397_060:0406c23_23"
    },
    {
        "source_sentence": "佛言諸菩薩：「汝曹寧信有是無？」",
        "translation": "The Buddha said to the bodhisattvas, Do you Cunda believe there's this or that?",
        "source": "T13n0397_060:0406c24_24"
    },
    {
        "source_sentence": "諸菩薩言：「信有是。",
        "translation": "The bodhisattvas said, Believe it to be so.",
        "source": "T13n0397_060:0406c24_25"
    },
    {
        "source_sentence": "眾不疑，但不解。」",
        "translation": "The crowd didn't doubt, but they didn't understand.",
        "source": "T13n0397_060:0406c25_26"
    },
    {
        "source_sentence": "佛問諸菩薩；",
        "translation": "The Buddha asked the enlightening beings:",
        "source": "T13n0397_060:0406c25_27"
    },
    {
        "source_sentence": "「汝曹發起來至我所，寧知汝意中幾轉？",
        "translation": "You have arisen and come to me, so how many times do you know what you're thinking?",
        "source": "T13n0397_060:0406c26_0"
    },
    {
        "source_sentence": "汝聞我造說經以來，知汝意幾轉？」",
        "translation": "Do you know how many times you've changed since you heard the sūtras I created and taught?",
        "source": "T13n0397_060:0406c26_1"
    },
    {
        "source_sentence": "諸菩薩報佛言：「不知幾轉。」",
        "translation": "The bodhisattvas replied to the Buddha, I don't know how many turns it takes.",
        "source": "T13n0397_060:0406c27_2"
    },
    {
        "source_sentence": "佛問諸菩薩：「何以故不知幾轉？」",
        "translation": "The Buddha asked the bodhisattvas, Why doesn't he know how many turns?",
        "source": "T13n0397_060:0406c28_3"
    },
    {
        "source_sentence": "諸菩薩言：「我聞佛說經，歡喜不知覺幾轉。」",
        "translation": "The bodhisattvas said, When I hear the Buddha teach the sūtras, I'm overjoyed and don't know how many times I'll awaken.",
        "source": "T13n0397_060:0406c28_4"
    },
    {
        "source_sentence": "佛言：「汝曹來至今不覺意轉墮生死，譬如是摩竭國中塵不知多少。",
        "translation": "The Buddha said, Up to now, you haven't perceived the intention to fall into birth-and-death, which is like the dust in Magadha that doesn't know how much.",
        "source": "T13n0397_060:0406c29_5"
    },
    {
        "source_sentence": "菩薩但坐失行，不自知覺生死多少，是故不即時得佛。」",
        "translation": "A bodhisattva simply sits and doesn't know for himself the amount of birth-and-death, so he doesn't immediately attain Buddhahood.",
        "source": "T13n0397_060:0407a02_6"
    },
    {
        "source_sentence": "諸菩薩各各稽首歡喜受行。",
        "translation": "Each of the bodhisattvas bowed their heads and joyfully accepted the practice.",
        "source": "T13n0397_060:0407a03_7"
    },
    {
        "source_sentence": "諸菩薩各各稽首言：「未聞佛五十校計時，自用不失行，聞佛解五十校計，",
        "translation": "Each of the bodhisattvas bowed their heads and said, When they hadn't heard the Buddha's fifty calculations, they used their own practice without losing it.",
        "source": "T13n0397_060:0407a05_0"
    },
    {
        "source_sentence": "自知失行。」",
        "translation": "He knows for himself that he's lost his practice.",
        "source": "T13n0397_060:0407a06_1"
    },
    {
        "source_sentence": "佛言：「汝亦失行，亦不失行。」",
        "translation": "The Buddha said, You've also lost your practice, and you haven't lost your practice.",
        "source": "T13n0397_060:0407a06_2"
    },
    {
        "source_sentence": "菩薩復問：「何以失行，亦不失行？」",
        "translation": "Again, the bodhisattva asked, What's the reason for losing practice and not losing practice?",
        "source": "T13n0397_060:0407a07_3"
    },
    {
        "source_sentence": "佛言：「汝至十方佛前自貢高自譽言，我解無有是五十校計罪，便墮罪失行，",
        "translation": "The Buddha said: You should go before the buddhas of the ten directions to exalt yourself and praise yourselves. I understand that there are no more than fifty kinds of crimes against one another, so you will fall into them.",
        "source": "T13n0397_060:0407a08_4"
    },
    {
        "source_sentence": "是為亦失行。」",
        "translation": "This is also a failure of practice.",
        "source": "T13n0397_060:0407a09_5"
    },
    {
        "source_sentence": "佛言：「不失行者，菩薩至十方佛前，常當自慚，身體自慚、生死自慚，",
        "translation": "The Buddha said, Those who don't lose their practice should always be conscientious when bodhisattvas go to the buddhas of the ten directions, with their bodies shameful and birth-and-death shameful.",
        "source": "T13n0397_060:0407a10_6"
    },
    {
        "source_sentence": "生墮罪不能校計知，常持五十校計還自慚，是為菩薩不失行，不自慚者常失行。」",
        "translation": "If a bodhisattva doesn't lose his practice when he gives rise to sins that can't be calculated and always maintains fifty calculations and returns to shame himself, this is called a bodhisattva who doesn't",
        "source": "T13n0397_060:0407a11_7"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T13n0397_060:0407a13_8"
    },
    {
        "source_sentence": "諸菩薩各各自慚，各各自悔，各各自念：「滅盡非常苦空非身。」",
        "translation": "Each of the bodhisattvas was ashamed, each repented, and each thought, Cessation is neither permanent nor painful, and emptiness is not body.",
        "source": "T13n0397_060:0407a13_9"
    },
    {
        "source_sentence": "諸菩薩聞經皆大歡喜，前為佛作禮，頭面著佛足，受行而去。",
        "translation": "The bodhisattvas who had heard the sūtras were all greatly delighted, bowed to the Buddha, put their heads and feet at his feet, and departed.",
        "source": "T13n0397_060:0407a15_10"
    },
    {
        "source_sentence": "大集經卷第六十",
        "translation": "Daji jing, vol. 60",
        "source": "T13n0397_060:0407a17_0"
    }
]