[
    {
        "source_sentence": "說無垢稱經卷第一",
        "translation": "Shuo wuglishheng jing, vol. 1",
        "source": "T14n0476_001:0557c03_0"
    },
    {
        "source_sentence": "大唐三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial edict by the Tripiṭaka Master Xuanzang of the Great Tang dynasty",
        "source": "T14n0476_001:0557c05_0"
    },
    {
        "source_sentence": "序品第一",
        "translation": "Preface Chapter 1",
        "source": "T14n0476_001:0557c06_0"
    },
    {
        "source_sentence": "如是我聞：一時薄伽梵住廣嚴城菴羅衛林，與大苾芻眾八千人俱、菩薩摩訶薩三萬二千——皆為一切眾望所識，",
        "translation": "Thus I have heard: One time, the Bhagavān was staying at Vaiśravaṇa’s mango grove in the great city of Vaiśravaṇa, accompanied by eight thousand bhikṣus and thirty-two thousand bodhisattva mahāsattvas.",
        "source": "T14n0476_001:0557c07_0"
    },
    {
        "source_sentence": "大神通業修已成辦，諸佛威德常所加持，善護法城能攝正法，以大師子吼聲敷演，",
        "translation": "Having cultivated great supernatural deeds, he is always supported by the spiritual powers of buddhas. Skillfully protecting the city of truth, he can embrace the true teaching and expound it with the roar of the lion’s roar.",
        "source": "T14n0476_001:0557c09_1"
    },
    {
        "source_sentence": "美音遐振周遍十方，為諸眾生不請善友，紹三寶種能使不絕，降伏魔怨、制諸外道，",
        "translation": "His wondrous sound pervaded the ten directions, benefiting sentient beings without inviting good companions. He fostered the seeds of the Triple Gem so as to cause them not to be cut off. He subdued Māra’s enemies and oppressed heretics.",
        "source": "T14n0476_001:0557c11_2"
    },
    {
        "source_sentence": "永離一切障及蓋纏，念定、總持無不圓滿，建立無障解脫智門，逮得一切無斷殊勝念慧等持陀羅尼辯；",
        "translation": "“Great enlightening beings develop the door of knowledge of unobstructed liberation, forever free from all obstacles and obscurations. Their mindfulness, concentration, and mastery are never dissatisfied. They establish the door of knowledge of unobstructed liberation and attain the equanimity of nondestruction in all respects.",
        "source": "T14n0476_001:0557c13_3"
    },
    {
        "source_sentence": "皆獲第一布施、調伏寂靜尸羅、安忍、正勤、靜慮、般若、方便、善巧、妙願力、智波羅蜜多，",
        "translation": "They all attain the first kind of generosity, the morality of discipline and quiescence, patience, right effort, meditation, wisdom, skillful means, skillful means, the power of mysterious vows, and the perfection of knowledge.",
        "source": "T14n0476_001:0557c16_4"
    },
    {
        "source_sentence": "成無所得不起法忍，已能隨轉不退法輪，咸得無相妙印所印，善知有情諸根勝劣，",
        "translation": "Having perfected the ungraspable tolerance of non-origination, they are able to follow and turn the irreversible wheel of teaching. They all attain signlessness as stamped by a wonderful mudrā. They know well the superiority and inferiority of sentient beings’ faculties.",
        "source": "T14n0476_001:0557c18_0"
    },
    {
        "source_sentence": "一切大眾所不能伏，而能調御得無所畏；",
        "translation": "All the great assemblies cannot be subdued, yet they can be tamed and attain fearlessness.",
        "source": "T14n0476_001:0557c19_1"
    },
    {
        "source_sentence": "已積無盡福智資糧，相好嚴身色像第一，捨諸世間所有飾好，名稱高遠踰於帝釋，",
        "translation": "Having accumulated inexhaustible stores of merit and knowledge, he was the best-looking among all the adornments of the world. His fame surpassed that of Indra.",
        "source": "T14n0476_001:0557c20_2"
    },
    {
        "source_sentence": "意樂堅固猶若金剛；",
        "translation": "Their aspiration was as firm as a diamond.",
        "source": "T14n0476_001:0557c22_3"
    },
    {
        "source_sentence": "於諸佛法得不壞信、流法寶光、澍甘露雨，於眾言音微妙第一，於深法義廣大緣起；",
        "translation": "They attain unshakable faith in all buddha-teachings, flow the light of the jewels of truth, and pour down the rain of immortality. Their words and sounds are subtle and most subtle; they profoundly explain the meaning of doctrine and extensively develop causality.",
        "source": "T14n0476_001:0557c23_4"
    },
    {
        "source_sentence": "已斷二邊見習相續，演法無畏猶師子吼，其所講說乃如雷震，不可稱量過稱量境；",
        "translation": "Having cut off the two extreme views and habits, they continue to expound the Teaching without fear, like a lion’s roar. The doctrine they teach is like thunder, which cannot be measured or overrated.",
        "source": "T14n0476_001:0557c25_5"
    },
    {
        "source_sentence": "集法寶慧為大導師，正直審諦柔和微密，妙達諸法難見難知；",
        "translation": "He had the wisdom of accumulating the jewels of the Teaching as his great guide. He was upright, deliberate, gentle, subtle, and mysterious, marvelously comprehending all things that are difficult to see and difficult to know.",
        "source": "T14n0476_001:0557c27_6"
    },
    {
        "source_sentence": "甚深實義隨入一切，有趣無趣意樂所歸，獲無等等佛智灌頂，近力無畏不共佛法；",
        "translation": "The profound, true meaning follows all, is interesting, has no destination or destination and goes to where it belongs. They attain the coronation of incomparable buddha-knowledge, approaching power, fearlessness, and unique qualities of buddhas.",
        "source": "T14n0476_001:0557c28_7"
    },
    {
        "source_sentence": "已除所有怖畏惡趣，復超一切險穢深坑，永棄緣起金剛刀仗，常思示現諸有趣生；",
        "translation": "Having gotten rid of all fears and bad destinies, they also go beyond all the deep pits of danger and defilement. They permanently abandon conditioned vajra swords and battles and always contemplate manifesting various forms of birth.",
        "source": "T14n0476_001:0558a01_8"
    },
    {
        "source_sentence": "為大醫王善知方術，應病與藥，愈疾施安；",
        "translation": "Because the king of great physicians is well versed in the prescriptions and treatments, he gives medicine to those who are ill and provides comfort to those who are cured.",
        "source": "T14n0476_001:0558a03_9"
    },
    {
        "source_sentence": "無量功德皆成就、無量佛土皆嚴淨，其見聞者無不蒙益；",
        "translation": "Innumerable virtues are all perfected, and innumerable buddha-lands are all adorned and purified; those who see or hear them will not fail to benefit.",
        "source": "T14n0476_001:0558a04_10"
    },
    {
        "source_sentence": "諸有所作亦不唐捐，設經無量百千俱胝那庾多劫讚其功德亦不能盡——其名曰：等觀菩薩、不等觀菩薩、等不等觀菩薩、定神變王菩薩、法自在菩薩、法幢菩薩、光幢菩薩、光嚴菩薩、大嚴菩薩、寶峯菩薩、辯峯菩薩、寶手菩薩、寶印手菩薩、常舉手菩薩、常下手菩薩、常延頸菩薩、常喜根菩薩、常喜王菩薩、無屈辯菩薩、虛空藏菩薩、執寶炬菩薩、寶吉祥菩薩、寶施菩薩、帝網菩薩、光網菩薩、無障靜慮菩薩、慧峯菩薩、天王菩薩、壞魔菩薩、電天菩薩、現神變王菩薩、峯相等嚴菩薩、師子吼菩薩、雲雷音菩薩、山相擊王菩薩、香象菩薩、大香象菩薩、常精進菩薩、不捨善軛菩薩、妙慧菩薩、妙生菩薩、蓮花勝藏菩薩、三摩地王菩薩、蓮花嚴菩薩、觀自在菩薩、得大勢菩薩、梵網菩薩、寶杖菩薩、無勝菩薩、勝魔菩薩、嚴土菩薩、金髻菩薩、珠髻菩薩、慈氏菩薩、妙吉祥菩薩、珠寶蓋菩薩，",
        "translation": "They are called Bodhisattvas of Equanimous Contemplation, Bodhisattvas of Impartial Contemplation, Bodhisattvas of Impartial Contemplation, Bodhisattvas of Impartial Contemplation, Bodhisattvas of Impartial Contemplation, King of Meditation and Miraculous Displays, Bodhisattvas of Mastery of the Teaching,",
        "source": "T14n0476_001:0558a05_11"
    },
    {
        "source_sentence": "如是等上首菩薩摩訶薩三萬二千。",
        "translation": "Thus, these are the thirty-thousand bodhisattvas and mahāsattvas of the highest rank.",
        "source": "T14n0476_001:0558a23_12"
    },
    {
        "source_sentence": "復有萬梵，持髻梵王而為上首，從本無憂四大洲界為欲瞻禮供養世尊及聽法故來在會坐；",
        "translation": "Ten thousand Brahmās were also present in the assembly, led by King Topknot Brahmā. Formerly free from sorrow, they came from the four continents of the Four Great Oceans to this assembly because they wished to pay homage and make offerings to the World-honored One as well as to hear the Teaching.",
        "source": "T14n0476_001:0558a24_13"
    },
    {
        "source_sentence": "復有萬二千天帝，各從餘方四大洲界亦為瞻禮供養世尊及聽法故來在會坐；",
        "translation": "Also there were twelve thousand celestial rulers, each from the four continents in the other directions, who also came to this assembly and sat down to pay their respects to the World-honored One and hear his teaching.",
        "source": "T14n0476_001:0558a26_14"
    },
    {
        "source_sentence": "并餘大威力諸天、龍、藥叉、健達縛、阿素洛、揭路荼、緊捺洛、莫呼洛伽、釋、梵、護世等悉來會坐；",
        "translation": "The other great and mighty gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kinnaras, mahoragas, Brahmās, world protectors, and so on.",
        "source": "T14n0476_001:0558a28_15"
    },
    {
        "source_sentence": "及諸四眾——苾芻、苾芻尼、鄔波索迦、鄔波斯迦——俱來會坐。",
        "translation": "He was joined by the fourfold assembly of bhikṣus, bhikṣuṇīs, upāsaka, and upāsikā.",
        "source": "T14n0476_001:0558b01_16"
    },
    {
        "source_sentence": "爾時，世尊無量百千諸來大眾恭敬圍繞而為說法——譬如大寶妙高山王處于大海巍然逈出——踞大師子勝藏之座，",
        "translation": "At that time the World-honored One, surrounded by an assembly of countless hundreds of thousands of disciples, taught the Dharma to them with reverence, resembling great jeweled sublime high mountains rising up and down from the great ocean. He was seated on the throne of the supreme treasury of buddhahood of the enlightening being",
        "source": "T14n0476_001:0558b03_0"
    },
    {
        "source_sentence": "顯耀威光蔽諸大眾。",
        "translation": "It manifests its authoritative radiance and blinds the masses.",
        "source": "T14n0476_001:0558b05_1"
    },
    {
        "source_sentence": "時廣嚴城有一菩薩，離呫毘種，名曰寶性，與離呫毘五百童子各持一蓋，",
        "translation": "At that time there was an enlightening being in Vaiśālī, of the Licchavi caste, named Jewel-Nature, and five hundred young Licchavis, each holding a canopy.",
        "source": "T14n0476_001:0558b06_2"
    },
    {
        "source_sentence": "七寶莊嚴，往菴羅林詣如來所，各以其蓋奉上世尊，奉已頂禮世尊雙足，",
        "translation": "They each presented their canopies to the World-honored One and, having offered them to him, bowed at his feet.",
        "source": "T14n0476_001:0558b07_3"
    },
    {
        "source_sentence": "右繞七匝却住一面。",
        "translation": "He circled it seven times to the right and withdrew to one side.",
        "source": "T14n0476_001:0558b09_4"
    },
    {
        "source_sentence": "佛之威神令諸寶蓋合成一蓋，遍覆三千大千世界，而此世界廣長之相悉於中現。",
        "translation": "The Buddha's authoritative power causes the jeweled canopies to form a single canopy that covers 3,000 great one-thousand worlds, and the vast and long characteristics of this world all appear in it.",
        "source": "T14n0476_001:0558b10_5"
    },
    {
        "source_sentence": "又，此三千大千世界所有大寶妙高山王、一切雪山、目真隣陀山、摩訶目真隣陀山、香山、寶山、金山、黑山、輪圍山、大輪圍山、大海、江河、陂泉、池沼，",
        "translation": "“Furthermore, all the great jeweled high mountains of this billion-world-galactic universe—the Himalayan mountains, Mucilinda mountains, Mahāmucilinda mountains, Fragrant mountains, Jewel mountains, Mountains of gold, black mountains, circular mountains, great circular mountains, oceans, rivers, lakes, ponds, and",
        "source": "T14n0476_001:0558b12_0"
    },
    {
        "source_sentence": "及百俱胝四大洲渚、日、月、星辰、天宮、龍宮、諸尊神宮，并諸國邑、王都、聚落，",
        "translation": "and the four great continents of the hundred corpuscles, the sun, moon, stars, celestial palaces, heavenly palaces, dragon palaces, holy palaces, as well as cities, kingdoms, and villages.",
        "source": "T14n0476_001:0558b15_1"
    },
    {
        "source_sentence": "如是皆現此寶蓋中。",
        "translation": "They're all present in this jeweled canopy.",
        "source": "T14n0476_001:0558b17_0"
    },
    {
        "source_sentence": "又，十方界諸佛、如來所說正法皆如響應，於此蓋內無不見聞。",
        "translation": "Furthermore, all the buddhas and tathāgatas in the ten directions who teach the right teaching are like an echo, and there's nothing to be seen or heard inside this lid.",
        "source": "T14n0476_001:0558b17_1"
    },
    {
        "source_sentence": "時諸大眾覩佛神力，歡喜踊躍，歎未曾有，合掌禮佛瞻仰尊顏，目不暫捨默然而住。",
        "translation": "Seeing the Buddha's miraculous power, the masses rejoiced and jumped in admiration, praised his unprecedentedness, joined their palms, saluted him, looked at his venerable countenance, didn't look away, and remained silent for a moment.",
        "source": "T14n0476_001:0558b19_0"
    },
    {
        "source_sentence": "「目淨脩廣妙端嚴，　　皎如青紺蓮花葉，",
        "translation": "Their eyes are wide and beautifully adorned, As brilliant as the leaves of blue lotus blossoms.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　已證第一淨意樂，　　勝奢摩陀到彼岸。",
        "translation": "Having realized the first pure aspiration, he surpasses calmness and reaches the other shore.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　久積無邊清淨業，　　獲得廣大勝名聞，",
        "translation": "Having accumulated boundless pure deeds for a long time, They attain great fame and learning.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　故我稽首大沙門，　　開導希夷寂路者。",
        "translation": "That's why I bow my head in homage to the great ascetic and guide him on the quiet path of Xiyi.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　既見大聖以神變，　　普現十方無量土，",
        "translation": "Seeing the Great Sage’s mystical display, They manifest infinite lands in the ten directions.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　其中諸佛演說法，　　於是一切悉見聞。",
        "translation": "The buddhas there teach the Dharma, And all of them are seen and heard.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　法王法力超群生，　　常以法財施一切，",
        "translation": "The King of Truth, the power of truth surpassing all sentient beings, Always bestows enlightenment wealth on all.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　能善分別諸法相，　　觀第一義摧怨敵，",
        "translation": "They can skillfully analyze the characteristics of all things, Observing the ultimate truth to vanquish enemies.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　已於諸法得自在，　　是故稽首此法王。",
        "translation": "Having attained mastery over all dharmas, he therefore pays homage to this king of the Dharma.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　說法不有亦不無，　　一切皆得因緣立，",
        "translation": "The teaching of the Dharma is neither existent nor nonexistent, All can be established by causes and conditions.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　無我、無造、無受者，　　善惡之業亦不亡。",
        "translation": "The absence of self, the absence of creation, and the absence of sensation doesn't mean that good and bad actions don't die.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　始在佛樹降魔力，　　得甘露滅勝菩提，",
        "translation": "At the foot of the tree of enlightenment he subdued all demons And attained supreme enlightenment, the extinction of immortality.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　此中非心意受行，　　外道、群邪所不測。",
        "translation": "Here, it's not the mind that receives and acts with thought, which non-Buddhists and wrongdoers can't fathom.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　三轉法輪於大千，　　其輪能寂本性寂，",
        "translation": "Three turns of the wheel of teaching in a great chiliocosm, The wheel which can extinguish beings’ original quiescence.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　希有法智天人證，　　三寶於是現世間。",
        "translation": "Rarely is the Dharma wisdom of gods and humans realized, whereupon the Three Treasures appear in the world.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　以斯妙法濟群生，　　無思、無怖、常安寂，",
        "translation": "Because of these subtle teachings he saves all sentient beings. He has no thought, no fear, and is always at ease.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　度生、老、死大醫王，　　稽首無邊功德海。",
        "translation": "The great king of doctors who liberate beings from birth, old age, and death pays homage to the boundless ocean of virtue.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　八法不動如山王，　　於善、不善俱慈愍，",
        "translation": "The eightfold doctrine is immovable like a mountain king, compassionate toward both good and evil.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　心行如空平等住，　　孰不承敬此能仁？",
        "translation": "Mind and action are like space, equally abiding, so who wouldn't respect this kindness?",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　以斯微蓋奉世尊，　　於中普現三千界，",
        "translation": "Because of this tiny canopy offered to the World-honored One, Three thousand worlds are manifested therein:",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　諸天、龍、神宮殿等，　　故禮智見功德身。",
        "translation": "The gods, dragons, celestial palaces, and so forth therefore venerate the body of merit by seeing wisdom.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　十力神變示世間，　　一切皆如光影等，",
        "translation": "The ten powers of mystic transformation show the world, All like light and shadow.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　眾覩驚歎未曾有，　　故禮十力大智見。",
        "translation": "The multitude was greatly surprised and marveled at this unprecedented thing, so they venerated the great wisdom of the ten powers.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　眾會瞻仰大牟尼，　　靡不心生清淨信，",
        "translation": "The whole assembly venerated the Great Sage, All mentally producing pure faith.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　各見世尊在其前，　　斯則如來不共相；",
        "translation": "Each sees the World-honored One before them— This is the unique characteristic of the Enlightened.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　佛以一音演說法，　　眾生隨類各得解，",
        "translation": "The Buddha expounds the Teaching in one voice: Sentient beings, each according to their type, attain understanding.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　皆謂世尊同其語，　　斯則如來不共相；",
        "translation": "They all said that the World-honored One agreed with their words, And this is the unique characteristic of buddhas.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　佛以一音演說法，　　眾生各各隨所解，",
        "translation": "The Buddha expounds the Teaching in one voice: Sentient beings each teach according to their understanding.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　普得受行獲其利，　　斯則如來不共相；",
        "translation": "Attaining the benefit of receiving and practicing universally, This is the unique characteristic of buddhas.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　佛以一音演說法，　　或有恐畏或歡喜，",
        "translation": "The Buddha teaches the Dharma in one voice To those who fear or rejoice.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　或生厭離或斷疑，　　斯則如來不共相。",
        "translation": "Sometimes they become disillusioned, sometimes they part with or abandon doubt— Such are the unique characteristics of buddhas.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　稽首十力諦勇猛、　　稽首已得無怖畏、",
        "translation": "They bow their heads in respect to the ten powers of truth and courage. Having bowed their heads in respect, they attain fearlessness.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　稽首至定不共法、　　稽首一切大導師、",
        "translation": "He bowed his head to the uncommon Dharma of ultimate concentration, and bowed his head to all the great leaders.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　稽首能斷眾結縛、　　稽首已住於彼岸、",
        "translation": "He bowed his head in homage and was able to sever all bonds. Having bowed his head in homage, he remained on the other shore.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　稽首普濟苦群生、　　稽首不依生死趣。",
        "translation": "He pays homage to all the suffering sentient beings, bowing his head and not relying on the destinies of birth and death.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　已到有情平等趣，　　善於諸趣心解脫，",
        "translation": "Having arrived at the equal destinies of sentient beings, they’re well liberated in all destinies and minds.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　牟尼如是善修空，　　猶如蓮花不著水。",
        "translation": "The Muni thus skillfully cultivates emptiness, just like a lotus flower that doesn't cling to water.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　一切相遣無所遣、　　一切願滿無所願，",
        "translation": "All marks are rejected, nothing is rejected; All vows fulfilled, nothing is wished for.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "　大威神力不思議，　　稽首如空無所住。」",
        "translation": "His great authority and supernormal powers are inconceivable, and he bows his head like space without dwelling anywhere.",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "爾時，寶性即於佛前右膝著地，合掌恭敬，以妙伽他而讚佛曰：爾時，",
        "translation": "At that moment, the jewel-like one knelt with his right knee touching the ground in front of the Buddha. He greeted him with joined palms and praised him with these beautiful verses:",
        "source": "T14n0476_001:0558b21_0"
    },
    {
        "source_sentence": "寶性說此伽他讚世尊已，復白佛言：「如是五百童子菩薩皆已發趣阿耨多羅三藐三菩提，",
        "translation": "Having praised the World-honored One with these verses, Jealousy again said to the Buddha: Such five hundred children and bodhisattvas have all set out for supreme perfect enlightenment.",
        "source": "T14n0476_001:0559a04_1"
    },
    {
        "source_sentence": "彼咸問我嚴淨佛土。",
        "translation": "They all asked me about the adornment and purity of the Buddha land.",
        "source": "T14n0476_001:0559a06_2"
    },
    {
        "source_sentence": "唯願如來哀愍，為說淨佛土相。",
        "translation": "I entreat you, World-honored One, to have mercy on me and show me the characteristics of a pure buddha-lands.",
        "source": "T14n0476_001:0559a06_3"
    },
    {
        "source_sentence": "云何菩薩修淨佛土？」",
        "translation": "How does a bodhisattva cultivate the pure Buddha land?",
        "source": "T14n0476_001:0559a07_4"
    },
    {
        "source_sentence": "作是語已，佛言：「寶性！",
        "translation": "After he said this, the Buddha said, Jewel-Nature!",
        "source": "T14n0476_001:0559a08_5"
    },
    {
        "source_sentence": "善哉善哉，汝今乃能為諸菩薩請問如來淨佛土相及問菩薩修淨佛土。",
        "translation": "Good, good! Good, you're now able to question the bodhisattvas about the Tathāgata's characteristics of the pure Buddha land and ask them about the bodhisattva's cultivation of the pure Buddha land.",
        "source": "T14n0476_001:0559a08_6"
    },
    {
        "source_sentence": "汝今諦聽，善思念之，當為汝等分別解說。」",
        "translation": "Now, listen closely and well-consider it, and you will explain it for your discernment.",
        "source": "T14n0476_001:0559a10_7"
    },
    {
        "source_sentence": "於是寶性及諸菩薩咸作是言：「善哉，世尊！",
        "translation": "The Jewel-Nature and the bodhisattvas then all said, Good, Bhagavān!",
        "source": "T14n0476_001:0559a11_8"
    },
    {
        "source_sentence": "唯願為說，我等今者皆希聽受。」",
        "translation": "Please explain it for us; we now all want to hear and accept it.",
        "source": "T14n0476_001:0559a12_9"
    },
    {
        "source_sentence": "爾時，世尊告眾菩薩：「諸有情土是為菩薩嚴淨佛土。",
        "translation": "It was then that the Bhagavān addressed the bodhisattvas, The land of sentient beings is the Buddha land of the bodhisattva's adornment and purity.",
        "source": "T14n0476_001:0559a13_10"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0476_001:0559a14_11"
    },
    {
        "source_sentence": "諸善男子！",
        "translation": "“O sons of the virtuous!",
        "source": "T14n0476_001:0559a14_12"
    },
    {
        "source_sentence": "一切菩薩隨諸有情增長饒益，即便攝受嚴淨佛土；",
        "translation": "All enlightening beings, following the growth of sentient beings and benefiting them, even embrace the buddha-lands of purity.",
        "source": "T14n0476_001:0559a14_13"
    },
    {
        "source_sentence": "隨諸有情發起種種清淨功德，即便攝受嚴淨佛土；",
        "translation": "In accordance with the various pure virtues produced by sentient beings, they even receive adornment and purity from buddha-lands.",
        "source": "T14n0476_001:0559a16_0"
    },
    {
        "source_sentence": "隨諸有情應以如是嚴淨佛土而得調伏，即便攝受如是佛土；",
        "translation": "In accordance with the ways sentient beings should be disciplined by means of such a buddha-land of adornment and purity, they will even embrace such a buddha-land.",
        "source": "T14n0476_001:0559a17_1"
    },
    {
        "source_sentence": "隨諸有情應以如是嚴淨佛土悟入佛智，即便攝受如是佛土；",
        "translation": "Sentient beings who enter buddha-knowledge by awakening to the buddha-lands of such adornment and purity are even able to embrace those buddha-lands.",
        "source": "T14n0476_001:0559a18_2"
    },
    {
        "source_sentence": "隨諸有情應以如是嚴淨佛土起聖根行，即便攝受如是佛土。",
        "translation": "Sentient beings should thus adorn and purify the Buddha's land with such noble faculties and practices, and they'll even take in such a Buddha land.",
        "source": "T14n0476_001:0559a20_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0476_001:0559a21_4"
    },
    {
        "source_sentence": "諸善男子！",
        "translation": "“O sons of the virtuous!",
        "source": "T14n0476_001:0559a22_5"
    },
    {
        "source_sentence": "菩薩攝受嚴淨佛土，皆為有情增長、饒益、發起種種清淨功德。",
        "translation": "The bodhisattvas who take in the Buddha land of adornment and purity all develop, benefit, and give rise to various pure virtues for sentient beings.",
        "source": "T14n0476_001:0559a22_6"
    },
    {
        "source_sentence": "諸善男子！",
        "translation": "“O sons of the virtuous!",
        "source": "T14n0476_001:0559a23_7"
    },
    {
        "source_sentence": "譬如有人欲於空地造立宮室，或復莊嚴隨意無礙，若於虛空終不能成。",
        "translation": "It's like a person who wants to build a palace in an empty place or adorn it at will without obstruction, but they can't do so in space.",
        "source": "T14n0476_001:0559a24_8"
    },
    {
        "source_sentence": "菩薩如是，知一切法皆如虛空，唯為有情增長、饒益、生淨功德，即便攝受如是佛土。",
        "translation": "Thus, the bodhisattva knows that all things are like space, and it's only for the sake of sentient beings who grow, benefit, and produce pure virtue that he takes in such a Buddha land.",
        "source": "T14n0476_001:0559a25_9"
    },
    {
        "source_sentence": "攝受如是淨佛土者非於空也。",
        "translation": "He who collects such a pure Buddha land doesn't take it from emptiness.",
        "source": "T14n0476_001:0559a27_10"
    },
    {
        "source_sentence": "「復次，寶性！",
        "translation": "Furthermore, Jewel-Nature!",
        "source": "T14n0476_001:0559a29_0"
    },
    {
        "source_sentence": "汝等當知：發起無上菩提心土是為菩薩嚴淨佛土，菩薩證得大菩提時，",
        "translation": "You should know that this is the buddha-land of enlightening beings’ supreme determination for enlightenment.",
        "source": "T14n0476_001:0559a29_1"
    },
    {
        "source_sentence": "一切發起大乘有情來生其國；",
        "translation": "All the sentient beings who had undertaken the Great Vehicle came to be born in that land.",
        "source": "T14n0476_001:0559b02_0"
    },
    {
        "source_sentence": "純意樂土是為菩薩嚴淨佛土，菩薩證得大菩提時，所有不諂、不誑有情來生其國；",
        "translation": "Pure land of aspiration is the Buddha land of enlightening beings’ adornment and purity. When enlightening beings realize great enlightenment, all those who are not flattering or deceitful come to be born in that buddha land.",
        "source": "T14n0476_001:0559b02_1"
    },
    {
        "source_sentence": "善加行土是為菩薩嚴淨佛土，菩薩證得大菩提時，發起住持妙善加行一切有情來生其國；",
        "translation": "The land of skillful application is the Buddha land of enlightening beings’ adornment and purity. When enlightening beings attain great enlightenment, all sentient beings who are engaged in maintaining good application come to be born in their buddha-lands.",
        "source": "T14n0476_001:0559b04_2"
    },
    {
        "source_sentence": "上意樂土是為菩薩嚴淨佛土，菩薩證得大菩提時，具足成就善法有情來生其國；",
        "translation": "“The higher aspiration land is the buddha land of enlightening beings’ adornment and purity. When enlightening beings attain great awakening, sentient beings who have perfected good qualities are born in that land.",
        "source": "T14n0476_001:0559b06_3"
    },
    {
        "source_sentence": "修布施土是為菩薩嚴淨佛土，菩薩證得大菩提時，一切能捨財法有情來生其國；",
        "translation": "Cultivating the land of giving is the Buddha land of enlightening beings’ adornment and purity. When enlightening beings realize great awakening, all sentient beings who can relinquish possessions and doctrine are born in that buddha land.",
        "source": "T14n0476_001:0559b08_4"
    },
    {
        "source_sentence": "修淨戒土是為菩薩嚴淨佛土，菩薩證得大菩提時，圓滿成就十善業道意樂有情來生其國；",
        "translation": "The land of pure morality is the buddha-lands of enlightening beings. When enlightening beings realize great enlightenment, sentient beings who have perfected the aspiration for the ten paths of good action come and are born in their buddha-lands.",
        "source": "T14n0476_001:0559b10_5"
    },
    {
        "source_sentence": "修安忍土是為菩薩嚴淨佛土，菩薩證得大菩提時，三十二相莊嚴其身、堪忍柔和寂靜有情來生其國；",
        "translation": "The cultivation of patience is the Buddha land of enlightening beings’ adornment and purity. When enlightening beings attain great enlightenment, their bodies are adorned with the thirty-two marks; they can tolerate sentient beings who are peaceful and quiescent coming to be born in that buddha land.",
        "source": "T14n0476_001:0559b12_6"
    },
    {
        "source_sentence": "修精進土是為菩薩嚴淨佛土，菩薩證得大菩提時，諸善勇猛精進有情來生其國；",
        "translation": "Cultivating the land of energy is enlightening beings’ pure buddha-lands. When enlightening beings attain great awakening, good and courageous energetic sentient beings come to be born in their buddha-lands.",
        "source": "T14n0476_001:0559b15_7"
    },
    {
        "source_sentence": "修靜慮土是為菩薩嚴淨佛土，菩薩證得大菩提時，具足成就正念、正知、正定有情來生其國；",
        "translation": "“The land of meditation is the buddha-land of enlightening beings’ pure adornment. When enlightening beings realize great enlightenment, they are born in that buddha-land to sentient beings who have perfected right mindfulness, right knowledge, and right concentration.",
        "source": "T14n0476_001:0559b17_8"
    },
    {
        "source_sentence": "修般若土是為菩薩嚴淨佛土，菩薩證得大菩提時，一切已入正定有情來生其國；",
        "translation": "The cultivation of wisdom is the buddha land of enlightening beings’ adornment and purity. When enlightening beings realize great awakening, all those who have entered right concentration are born in that buddha land.",
        "source": "T14n0476_001:0559b19_9"
    },
    {
        "source_sentence": "四無量土是為菩薩嚴淨佛土，菩薩證得大菩提時，常住慈悲喜捨有情來生其國；",
        "translation": "These four immeasurable lands are the buddha-lands of enlightening beings’ adornment and purity. When enlightening beings realize great enlightenment, they always abide in kindness, compassion, joy, and relinquishment to sentient beings and are born in those lands.",
        "source": "T14n0476_001:0559b21_10"
    },
    {
        "source_sentence": "四攝事土是為菩薩嚴淨佛土，菩薩證得大菩提時，諸有解脫所攝有情來生其國；",
        "translation": "“The fourth is the buddha-lands of gathering in service. This is the buddha-lands of enlightening beings’ adornment and purity. When enlightening beings realize great enlightenment, sentient beings who are included in liberation are born in that buddha-land.",
        "source": "T14n0476_001:0559b23_11"
    },
    {
        "source_sentence": "巧方便土是為菩薩嚴淨佛土，菩薩證得大菩提時，善巧觀察諸法有情來生其國；",
        "translation": "The land of skillful means is the Buddha land of enlightening beings’ adornment and purity. When enlightening beings attain great awakening, they skillfully observe all things as sentient beings come to be born there.",
        "source": "T14n0476_001:0559b25_12"
    },
    {
        "source_sentence": "修三十七菩提分土是為菩薩嚴淨佛土，菩薩證得大菩提時，通達一切念、住正斷、神足、根、力、覺支、道支圓滿有情來生其國；",
        "translation": "Cultivating the thirty-seven factors of enlightenment is a buddha land of adornment and purity for enlightening beings. When enlightening beings realize great awakening, they comprehend that all sentient beings who are mindful, who are abiding in correct elimination, who have supernormal powers, faculties, faculties, powers,",
        "source": "T14n0476_001:0559b27_13"
    },
    {
        "source_sentence": "修迴向土是為菩薩嚴淨佛土，菩薩證得大菩提時，其國具足眾德莊嚴；",
        "translation": "Cultivating dedication is the buddha land of enlightening beings’ adornment and purity. When enlightening beings attain great awakening, those lands are replete with the adornment of virtues.",
        "source": "T14n0476_001:0559b29_14"
    },
    {
        "source_sentence": "善說息除八無暇土是為菩薩嚴淨佛土，菩薩證得大菩提時，其國永離惡趣無暇；",
        "translation": "This is the buddha land of enlightening beings’ purification. When enlightening beings realize great enlightenment, their lands will be forever free from bad states of woefulness and have no leisure time.",
        "source": "T14n0476_001:0559c02_15"
    },
    {
        "source_sentence": "自守戒行不譏彼土是為菩薩嚴淨佛土，菩薩證得大菩提時，其國無有犯禁之名；",
        "translation": "This is the buddha land of enlightening beings’ pure purity. When enlightening beings realize great enlightenment, there is no offense in that buddha-land.",
        "source": "T14n0476_001:0559c04_16"
    },
    {
        "source_sentence": "十善業道極清淨土是為菩薩嚴淨佛土，菩薩證得大菩提時，壽量決定大富梵行、所言誠諦、常以軟語、眷屬不離、善宣密意、離諸貪欲、心無瞋恚、正見有情來生其國。",
        "translation": "The land of the purity of the ten paths of good action is the buddha land of the bodhisattva's adornment, and when the bodhisattva realizes great enlightenment, sentient beings with great longevity, great wealth, religious practice, sincerity in what they say, constant soft speech, no separation from their retinues, well-expressed hidden intention",
        "source": "T14n0476_001:0559c06_17"
    },
    {
        "source_sentence": "「諸善男子！",
        "translation": "Good sons!",
        "source": "T14n0476_001:0559c11_0"
    },
    {
        "source_sentence": "如是，菩薩隨發菩提心則有純淨意樂，隨其純淨意樂則有妙善加行，隨其妙善加行則有增上意樂，",
        "translation": "“In the same way, enlightening beings have pure aspirations that follow the determination for enlightenment; those with pure aspirations have subtle and virtuous application of practices; those with subtle and virtuous application of practices have superior aspirations.",
        "source": "T14n0476_001:0559c11_1"
    },
    {
        "source_sentence": "隨其增上意樂則有止息，隨其止息則有發起，隨其發起則有迴向，隨其迴向則有寂靜，",
        "translation": "Depending on the superior attitude, there is stillness of mind; depending on the calmness of mind, there is arousal; depending on the arousal, there is dedication; and depending on the dedication, there is quiescence.",
        "source": "T14n0476_001:0559c13_2"
    },
    {
        "source_sentence": "隨其寂靜則有清淨有情，隨其清淨有情則有嚴淨佛土，隨其嚴淨佛土則有清淨法教，",
        "translation": "In accordance with their quiescence, there are pure sentient beings; in accordance with their pure sentient beings, there are pure buddha-lands; in accordance with their pure buddha-lands, there are pure teachings of the Dharma.",
        "source": "T14n0476_001:0559c15_3"
    },
    {
        "source_sentence": "隨其清淨法教即有清淨妙福，隨其清淨妙福則有清淨妙慧，隨其清淨妙慧則有清淨妙智，",
        "translation": "As is pure doctrine, so is pure virtue. As is pure virtue, so is pure wisdom. As is pure wisdom, so is pure knowledge.",
        "source": "T14n0476_001:0559c17_4"
    },
    {
        "source_sentence": "隨其清淨妙智則有清淨妙行，隨其清淨妙行則有清淨自心，隨其清淨自心則有清淨諸妙功德。",
        "translation": "According to their pure and marvelous knowledge, they'll have pure and marvelous actions, according to their pure and marvelous actions, they'll have a pure self-mind, and according to their pure self-mind, they'll have pure and marvelous virtues.",
        "source": "T14n0476_001:0559c20_5"
    },
    {
        "source_sentence": "「諸善男子！",
        "translation": "Good sons!",
        "source": "T14n0476_001:0559c23_0"
    },
    {
        "source_sentence": "是故，菩薩若欲勤修嚴淨佛土，先應方便嚴淨自心。",
        "translation": "Therefore, if a bodhisattva wants to diligently cultivate the adornment and purity of the Buddha land, he or she should first skillfully adorn and purify their own minds.",
        "source": "T14n0476_001:0559c23_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0476_001:0559c24_2"
    },
    {
        "source_sentence": "隨諸菩薩自心嚴淨，即得如是嚴淨佛土。」",
        "translation": "As the bodhisattvas purify their own minds, they'll attain such an adorned and pure Buddha land.",
        "source": "T14n0476_001:0559c24_3"
    },
    {
        "source_sentence": "爾時，舍利子承佛威神作如是念：「若諸菩薩心嚴淨故，佛土嚴淨；",
        "translation": "At that time Śāriputra, imbued with the Buddha’s spiritual power, had this thought:",
        "source": "T14n0476_001:0559c26_0"
    },
    {
        "source_sentence": "而我世尊行菩薩時心不嚴淨故，是佛土雜穢若此？」",
        "translation": "It's because my mind wasn't pure when the Bhagavān was practicing bodhisattva, so is this the defilement of the Buddha-lands like this?",
        "source": "T14n0476_001:0559c27_1"
    },
    {
        "source_sentence": "佛知其念即告之言：「於意云何？",
        "translation": "Knowing this thought, the Buddha told him, What do you think?",
        "source": "T14n0476_001:0559c28_2"
    },
    {
        "source_sentence": "世間日、月豈不淨耶？",
        "translation": "Aren't the sun and moon in the world impure?",
        "source": "T14n0476_001:0559c29_3"
    },
    {
        "source_sentence": "而盲不見。」",
        "translation": "But the blind don't see it.",
        "source": "T14n0476_001:0560a01_0"
    },
    {
        "source_sentence": "對曰：「不也。",
        "translation": "He replied, No.",
        "source": "T14n0476_001:0560a01_1"
    },
    {
        "source_sentence": "是盲者過，非日月咎。」",
        "translation": "This is the fault of a blind man, not the fault of the sun and moon.",
        "source": "T14n0476_001:0560a01_2"
    },
    {
        "source_sentence": "佛言：「如是，眾生罪故不見世尊佛土嚴淨，非如來咎。",
        "translation": "The Buddha said, Thus, it's not the fault of the Tathāgata that sentient beings don't see the Bhagavān's buddha land as perfectly pure because of their sins.",
        "source": "T14n0476_001:0560a02_0"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T14n0476_001:0560a03_1"
    },
    {
        "source_sentence": "我土嚴淨而汝不見。」",
        "translation": "My land is adorned and pure, but you don't see it.",
        "source": "T14n0476_001:0560a03_2"
    },
    {
        "source_sentence": "爾時，持髻梵王語舍利子：「勿作是意謂此佛土為不嚴淨。",
        "translation": "It was then that the Brahmā king Mahāprajāpatīṇa said to Śāriputra, Don't think this is a way to say that this Buddha land isn't pure.",
        "source": "T14n0476_001:0560a04_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0476_001:0560a05_1"
    },
    {
        "source_sentence": "如是佛土最極嚴淨。」",
        "translation": "Thus, the Buddha land is most extremely pure.",
        "source": "T14n0476_001:0560a05_2"
    },
    {
        "source_sentence": "舍利子言：「大梵天王！",
        "translation": "Śāriputra said, Great king of Brahmā!",
        "source": "T14n0476_001:0560a06_3"
    },
    {
        "source_sentence": "今此佛土嚴淨云何？」",
        "translation": "What's the adornment and purity of this Buddha land now?",
        "source": "T14n0476_001:0560a06_4"
    },
    {
        "source_sentence": "持髻梵言：「唯，舍利子！",
        "translation": "The bearer of the topknot said, Yes, Śāriputra!",
        "source": "T14n0476_001:0560a07_0"
    },
    {
        "source_sentence": "譬如他化自在天宮有無量寶功德莊嚴，我見世尊釋迦牟尼佛土嚴淨有無量寶功德莊嚴亦復如是。」",
        "translation": "Just as the palace of the Paranirmita-vaśavartin has an immeasurable amount of jeweled merit and adornment, so too do I see that the Bhagavān, Śākyamuni Buddha's land of adornment and purity has an immeasurable amount of jeweled merit and adornment.",
        "source": "T14n0476_001:0560a07_1"
    },
    {
        "source_sentence": "舍利子言：「大梵天王！",
        "translation": "Śāriputra said, Great king of Brahmā!",
        "source": "T14n0476_001:0560a09_2"
    },
    {
        "source_sentence": "我見此土其地高下——丘陵、坑坎、毒刺、沙礫、土石、諸山——穢惡充滿。」",
        "translation": "I see that this land is high and low - hills, pits, poisonous thorns, sand, gravel, dirt, rocks, and mountains - and it's filled with filthy and evil.",
        "source": "T14n0476_001:0560a10_3"
    },
    {
        "source_sentence": "持髻梵言：「唯，大尊者！",
        "translation": "The topknot-holding Brahmā said, Yes, great venerable!",
        "source": "T14n0476_001:0560a11_4"
    },
    {
        "source_sentence": "心有高下不嚴淨故，謂佛智慧意樂亦爾，故見佛土為不嚴淨。",
        "translation": "Because the mind is high and low, it's not pure, meaning that the Buddha's wisdom and aspirations are likewise, so he sees the Buddha land as not pure.",
        "source": "T14n0476_001:0560a12_5"
    },
    {
        "source_sentence": "若諸菩薩於諸有情其心平等、功德嚴淨，謂佛智慧意樂亦爾，便見佛土最極嚴淨。」",
        "translation": "If bodhisattvas' minds are equal to sentient beings and their merits are perfectly pure, meaning that the Buddha's wisdom and aspirations are likewise, then they'll see that the Buddha's land is most perfectly pure.",
        "source": "T14n0476_001:0560a13_6"
    },
    {
        "source_sentence": "爾時，世尊知諸大眾心懷猶豫，便以足指按此大地。",
        "translation": "Knowing that the minds of the masses were hesitant, the Bhagavān then pressed this earth with his feet.",
        "source": "T14n0476_001:0560a15_7"
    },
    {
        "source_sentence": "即時三千大千世界無量百千妙寶莊嚴，譬如功德寶莊嚴佛無量功德寶莊嚴土。",
        "translation": "Immediately, the 3,000 great one-thousand worlds are adorned with measureless hundreds of thousands of marvelous treasures, like the Buddha's immeasurable land adorned with jewels of merit.",
        "source": "T14n0476_001:0560a17_0"
    },
    {
        "source_sentence": "一切大眾歎未曾有，而皆自見坐寶蓮華。",
        "translation": "All the people in the assembly marveled at this unprecedented occurrence, and they all saw themselves sitting on jeweled lotus flowers.",
        "source": "T14n0476_001:0560a18_1"
    },
    {
        "source_sentence": "爾時，世尊告舍利子：「汝見如是眾德莊嚴淨佛土不？」",
        "translation": "It was then that the Bhagavān addressed Śāriputra, Do you see such a pure Buddha land adorned with virtues like this?",
        "source": "T14n0476_001:0560a20_0"
    },
    {
        "source_sentence": "舍利子言：「唯然，世尊！",
        "translation": "Śāriputra said, Yes, Bhagavān!",
        "source": "T14n0476_001:0560a21_1"
    },
    {
        "source_sentence": "本所不見、本所不聞，今此佛土嚴淨悉現。」",
        "translation": "What wasn't seen in the past and what wasn't heard in the past is now fully manifested in this Buddha land as its adornment and purity.",
        "source": "T14n0476_001:0560a21_2"
    },
    {
        "source_sentence": "告舍利子：「我佛國土常淨若此，為欲成熟下劣有情，是故示現無量過失雜穢土耳。",
        "translation": "He told Śāriputra, My Buddha land is always pure like this because I want to ripen inferior sentient beings, so I'll show them a defiled land with measureless faults.",
        "source": "T14n0476_001:0560a22_3"
    },
    {
        "source_sentence": "舍利子！",
        "translation": "“O Śāriputra!",
        "source": "T14n0476_001:0560a24_4"
    },
    {
        "source_sentence": "譬如三十三天共寶器食，隨業所招其食有異。",
        "translation": "It's like when the thirty-three gods share a precious container of food, and their food differs according to the actions they take.",
        "source": "T14n0476_001:0560a24_5"
    },
    {
        "source_sentence": "如是，舍利子！",
        "translation": "So it is, Sāriputta!",
        "source": "T14n0476_001:0560a26_0"
    },
    {
        "source_sentence": "無量有情生一佛土，隨心淨穢所見有異，若人心淨便見此土無量功德妙寶莊嚴。」",
        "translation": "Measureless sentient beings give rise to a single Buddha land that differs according to the purity and defilement of their minds, and if their minds are pure, they'll see this land as adorned with measureless merit and marvelous treasures.",
        "source": "T14n0476_001:0560a26_1"
    },
    {
        "source_sentence": "當佛現此嚴淨土時，寶性所將五百童子一切皆得無生法忍、八萬四千諸有情類皆發無上正等覺心。",
        "translation": "When the Buddha manifested this adorned pure land, the five hundred children led by Jewel-Nature all attained the forbearance of the nonarising of the Dharma and 84,000 sentient beings aroused the mind of unsurpassed perfect enlightenment.",
        "source": "T14n0476_001:0560a28_2"
    },
    {
        "source_sentence": "時佛、世尊即攝神足，於是世界還復如故。",
        "translation": "The Buddha and the Bhagavān then gathered his spiritual feet, and the world returned to its original form.",
        "source": "T14n0476_001:0560b01_3"
    },
    {
        "source_sentence": "求聲聞乘三萬二千諸天及人，知有為法皆悉無常，遠塵離垢得法眼淨；",
        "translation": "Seeking the vehicle of śrāvakas, thirty-two thousand celestial beings and humans learned that all conditioned things are impermanent; far removed from dust and dirt, they attained purity of the eye of truth.",
        "source": "T14n0476_001:0560b02_4"
    },
    {
        "source_sentence": "八千苾芻永離諸漏，心善解脫。",
        "translation": "Eight thousand monks were permanently freed from the contaminants, and their minds were well liberated.",
        "source": "T14n0476_001:0560b04_5"
    },
    {
        "source_sentence": "說無垢稱經顯不思議方便善巧品第二爾時，廣嚴城中有大菩薩，離呫毘種，",
        "translation": "At that time there was a great bodhisattva living in Vaiśravaṇa’s city, namely the Licchavi Vimalakīrti.",
        "source": "T14n0476_001:0560b05_0"
    },
    {
        "source_sentence": "名無垢稱，已曾供養無量諸佛，於諸佛所深殖善根，得妙辯才、具無生忍、逮諸總持、遊戲神通，",
        "translation": "He had served innumerable buddhas, planted roots of goodness in the presence of those buddhas, attained marvelous eloquence, perfected tolerance free from birth, mastered all means of unification, and developed supernormal powers.",
        "source": "T14n0476_001:0560b06_1"
    },
    {
        "source_sentence": "獲無所畏摧魔怨力。",
        "translation": "They attain fearlessness and the power to subdue Māra's enemies.",
        "source": "T14n0476_001:0560b09_2"
    },
    {
        "source_sentence": "入深法門善於智度，通達方便大願成滿，明了有情意樂及行，善知有情諸根勝劣。",
        "translation": "He enters the profound teaching that's well liberated by knowledge, comprehends the accomplishment of the great vow of skillful means, understands the intentions and actions of sentient beings, and well knows the superiority and inferiority of their faculties.",
        "source": "T14n0476_001:0560b09_3"
    },
    {
        "source_sentence": "智度成辦，說法淳熟，於大乘中決定修習，於所作業能善思量。",
        "translation": "Having perfected the perfection of wisdom and knowledge, he teaches the Dharma that's pure and ripe, cultivates it with certainty in the great vehicle, and is able to skillfully contemplate what he does.",
        "source": "T14n0476_001:0560b11_4"
    },
    {
        "source_sentence": "住佛威儀，入心慧海，諸佛咨嗟稱揚顯說，釋、梵、護世常所禮敬，為欲成熟諸有情故，",
        "translation": "They abide in the Buddha’s comportment, entering into the ocean of mind and intellect. The buddhas exhort, praise, and expound these teachings; they are always revered by Sakra, Brahmā, and the world-protectors because they want to develop sentient beings.",
        "source": "T14n0476_001:0560b13_0"
    },
    {
        "source_sentence": "以善方便居廣嚴城。",
        "translation": "He lived in the extensively adorned city with good skillful means.",
        "source": "T14n0476_001:0560b15_0"
    },
    {
        "source_sentence": "具無盡財，攝益貧窮、無依、無怙；",
        "translation": "They had inexhaustible riches to provide for the poor, helpless, and helpless.",
        "source": "T14n0476_001:0560b15_1"
    },
    {
        "source_sentence": "具清淨戒，攝益一切有犯有越；",
        "translation": "They are endowed with pure morality, benefiting all those who transgress.",
        "source": "T14n0476_001:0560b16_2"
    },
    {
        "source_sentence": "以調順忍攝益瞋恨、暴嫉、楚毒；",
        "translation": "By means of the tolerance of self-control they harm anger, hatred, jealousy, and cruelty.",
        "source": "T14n0476_001:0560b17_0"
    },
    {
        "source_sentence": "以大精進攝益一切懈怠懶惰；",
        "translation": "By means of great zeal they subdue all the lazy and indolent.",
        "source": "T14n0476_001:0560b17_1"
    },
    {
        "source_sentence": "安住靜慮、正念解脫、等持等至，攝益一切諸有亂心；",
        "translation": "Abiding peacefully in meditative absorption, right mindfulness, liberation, equipoise of equanimity, and so on, they bring benefit to all the troubled minds.",
        "source": "T14n0476_001:0560b18_2"
    },
    {
        "source_sentence": "以正決擇攝益一切妄見、惡慧。",
        "translation": "By correctly discriminating, they gather in all deluded views and bad wisdom.",
        "source": "T14n0476_001:0560b19_3"
    },
    {
        "source_sentence": "雖為白衣而具沙門威儀功德，雖處居家不著三界，示有妻子常修梵行，",
        "translation": "Even though they are white-robed, yet endowed with the deportment of śramaṇas and brāhmaṇas, while living at home they do not cling to the three realms. They show that their wives and children always practice the holy life.",
        "source": "T14n0476_001:0560b20_4"
    },
    {
        "source_sentence": "現有眷屬常樂遠離。",
        "translation": "It's the existence of dependents who are always happy to be far removed.",
        "source": "T14n0476_001:0560b22_5"
    },
    {
        "source_sentence": "雖服寶飾而以相好莊嚴其身、雖現受食而以靜慮等至為味、雖同樂著博弈嬉戲而實恒為成熟有情、雖稟一切外道軌儀而於佛法意樂不壞、雖明一切世間書論而於內苑賞玩法樂、雖現一切邑會眾中而恒為最說法上首。",
        "translation": "Even though he wears jewel ornaments, his body is adorned with marks and features, even though he presents food and receives food, it's the taste of meditation and so forth, even though he's equally fond of gambling and playful, but he really always serves to ripen sentient beings, even though he produces all the rituals of non-Buddhists",
        "source": "T14n0476_001:0560b22_6"
    },
    {
        "source_sentence": "為隨世教於尊卑等所作事業示無與乖，雖不希求世間財寶，然於俗利示有所習。",
        "translation": "In order to follow the worldly teachings, they show that there's no discrepancy with respect to the works done by superiors and inferiors, even though they don't seek worldly possessions, but they show some accumulation for mundane gain.",
        "source": "T14n0476_001:0560b28_7"
    },
    {
        "source_sentence": "為益含識遊諸市衢、為護群生理諸王務、入講論處導以大乘、入諸學堂誘開童蒙、入諸婬舍示欲之過，",
        "translation": "In order to increase the consciousness of sentient beings, he traveled to various markets and thoroughfares in order to protect all living beings. He guarded the king’s duties with physiological protection. He entered lecture halls to expound the Great Vehicle (Mahayana), entered study halls to entice children into learning. He entered monastic dwellings",
        "source": "T14n0476_001:0560c01_8"
    },
    {
        "source_sentence": "為令建立正念正知遊諸伎樂。",
        "translation": "He causes them to establish right mindfulness, right knowledge, and playfulness.",
        "source": "T14n0476_001:0560c04_9"
    },
    {
        "source_sentence": "若在長者，長者中尊為說勝法；",
        "translation": "If he were among the wealthy, the honored one among the wealthy would preach the supreme Dharma for him.",
        "source": "T14n0476_001:0560c04_10"
    },
    {
        "source_sentence": "若在居士，居士中尊斷其貪著；",
        "translation": "If they are householders, the most honored among householders will cut off their craving.",
        "source": "T14n0476_001:0560c05_11"
    },
    {
        "source_sentence": "若在剎帝利，剎帝利中尊教以忍辱；",
        "translation": "If he were in kṣatriya, the most honorable among kṣatriyas would teach him patience.",
        "source": "T14n0476_001:0560c06_12"
    },
    {
        "source_sentence": "若在婆羅門，婆羅門中尊除其我慢；",
        "translation": "If one were to stay among the brahmans, he would be honored as a brahman among brahmans and rid himself of self-conceit.",
        "source": "T14n0476_001:0560c07_13"
    },
    {
        "source_sentence": "若在大臣，大臣中尊教以正法；",
        "translation": "If he were among ministers, the most honored among ministers would teach him the true teaching.",
        "source": "T14n0476_001:0560c08_14"
    },
    {
        "source_sentence": "若在王子，王子中尊示以忠孝；",
        "translation": "If he were to be a prince, the prince would be honored and shown loyalty.",
        "source": "T14n0476_001:0560c08_15"
    },
    {
        "source_sentence": "若在內官，內官中尊化正宮女；",
        "translation": "If he were to be in the inner sanctum, the palace maid among the inner sanctums would be honored and transformed.",
        "source": "T14n0476_001:0560c09_16"
    },
    {
        "source_sentence": "若在庶人，庶人中尊修相似福殊勝意樂；",
        "translation": "If he were among common people, the venerable among common people would cultivate a superior attitude of similar virtue.",
        "source": "T14n0476_001:0560c10_17"
    },
    {
        "source_sentence": "若在梵天，梵天中尊示諸梵眾靜慮差別；",
        "translation": "If one is in the brahma-heaven, the honored one in the brahma-heaven will show the brahma-heavens the differences in meditation.",
        "source": "T14n0476_001:0560c11_18"
    },
    {
        "source_sentence": "若在帝釋，帝釋中尊示現自在悉皆無常；",
        "translation": "If he were Indra, the supreme among Indras, who manifested sovereignty, they would all be impermanent.",
        "source": "T14n0476_001:0560c12_19"
    },
    {
        "source_sentence": "若在護世，護世中尊守護一切利益安樂。",
        "translation": "If someone protects the world, they'll be honored in protecting the world and guarding all benefits and well-being.",
        "source": "T14n0476_001:0560c13_20"
    },
    {
        "source_sentence": "是無垢稱以如是等不可思議無量善巧方便慧門饒益有情，其以方便現身有疾。",
        "translation": "This is the unsullied praise that benefits sentient beings with such inconceivable and immeasurable skillful means and wisdom, and they're sick because of the method of manifesting their bodies.",
        "source": "T14n0476_001:0560c14_21"
    },
    {
        "source_sentence": "以其疾故，國王、大臣、長者、居士、婆羅門等，及諸王子并餘官屬無數千人，",
        "translation": "Because of his illness, innumerable thousands of kings, ministers, elders, householders, priests, brahmans, princes, and other officials were sick.",
        "source": "T14n0476_001:0560c16_22"
    },
    {
        "source_sentence": "皆往問疾。",
        "translation": "They all went there to ask about illness.",
        "source": "T14n0476_001:0560c17_23"
    },
    {
        "source_sentence": "時無垢稱因以身疾廣為說法，言：「諸仁者！",
        "translation": "The Licchavi Vimalakīrti then explained the teaching widely for him because of his illness, saying, Gentlemen!",
        "source": "T14n0476_001:0560c18_24"
    },
    {
        "source_sentence": "是四大種所合成身，無常、無強、無堅、無力。",
        "translation": "It is a body composed of the four elements, which are impermanent, insubstantial, not strong, not hard, and not powerful.",
        "source": "T14n0476_001:0560c19_25"
    },
    {
        "source_sentence": "朽故迅速，不可保信，為苦、為惱、眾病之器，多諸過患、變壞之法。",
        "translation": "Because it decays quickly, they can't be trusted. They are vessels for suffering, distress, and illness, with many faults and dharmas that change and disintegrate.",
        "source": "T14n0476_001:0560c20_26"
    },
    {
        "source_sentence": "諸仁者！",
        "translation": "Gentlemen!",
        "source": "T14n0476_001:0560c21_27"
    },
    {
        "source_sentence": "如此之身，其聰慧者所不為怙。",
        "translation": "Such a body is not for the wise to rely on.",
        "source": "T14n0476_001:0560c21_28"
    },
    {
        "source_sentence": "是身如聚沫不可撮摩、是身如浮泡不得久立、是身如陽焰從諸煩惱渴愛所生、是身如芭蕉都無有實、是身如幻從顛倒起、是身如夢為虛妄見、是身如影從業緣現、是身如響屬諸因緣、是身如雲須臾變滅、是身如電念念不住、是身無主為如地、是身無我為如水、是身無有情為如火、是身無命者為如風、是身無有補特伽羅與虛空等、是身不實四大為家、是身為空離我我所、是身無知如草木等、是身無作風力所轉、是身不淨穢惡充滿、是身虛偽雖假覆蔽飲食將養必歸磨滅、是身多患四百四病之所集成、是身易壞如水隧級常為朽老之所逼迫、是身無定為要當死、是身如怨害周遍毒蛇之所充滿、是身如空聚諸蘊界處所共合成。",
        "translation": "是身如聚沫不可撮摩,是身如浮泡不能久立,是身如陽焰從諸 afflictions求愛所生所生,是身如芭蕉都無實,是身如幻從顛倒起起,是身如夢為虛妄見,是身如影從業緣現,是身如響屬諸因緣、是身如雲須",
        "source": "T14n0476_001:0560c22_29"
    },
    {
        "source_sentence": "「諸仁者！",
        "translation": "Gentlemen!",
        "source": "T14n0476_001:0561a09_30"
    },
    {
        "source_sentence": "於如是身應生厭離，於如來身應起欣樂。",
        "translation": "Being disillusioned with such a body, they should become disillusioned with the Tathāgata's body and give rise to delight in the Tathāgata's body.",
        "source": "T14n0476_001:0561a09_31"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0476_001:0561a10_32"
    },
    {
        "source_sentence": "如來身者，無量善法共所集成，從修無量殊勝福德智慧所生，從修無量勝戒定慧解脫解脫知見所生，",
        "translation": "The body of Buddha is the boundless accumulation of virtuous factors. It is produced from the cultivation of immeasurable merit and wisdom. It is the boundless knowledge and vision that arise from the cultivation of immeasurable morality, meditation, wisdom, liberation, and dispassion.",
        "source": "T14n0476_001:0561a10_33"
    },
    {
        "source_sentence": "從修慈悲喜捨所生，從修布施、調伏寂靜戒、忍、精進、靜慮、解脫、等持等至、般若、方便、願、力、智生，",
        "translation": "They arise from the cultivation of kindness, compassion, pity, joy, and equanimity; they arise from the cultivation of generosity, discipline, quiescence, morality, patience, effort, meditation, liberation, equipoise, wisdom, prajñā, skillful means, vows, powers, and knowledge.",
        "source": "T14n0476_001:0561a13_34"
    },
    {
        "source_sentence": "從修一切到彼岸生，修六通生，修三明生，修三十七菩提分生，修止觀生，",
        "translation": "They arise from cultivating everything up to the other shore; they arise from cultivating the six higher faculties; they arise from cultivating the three knowledges; they arise from cultivating the thirty-seven factors of enlightenment; and they arise from cultivating calming and insight.",
        "source": "T14n0476_001:0561a15_35"
    },
    {
        "source_sentence": "從修十力、四無畏生，從修十八不共法生，從斷一切不善法、集一切善法生，",
        "translation": "They arise from the cultivation of the ten powers and four fearlessnesses, from the cultivation of the eighteen unique qualities, and they arise from the elimination of all unwholesome qualities and the accumulation of all wholesome qualities.",
        "source": "T14n0476_001:0561a17_36"
    },
    {
        "source_sentence": "從修諦實不放逸生，從修無量清淨業生。",
        "translation": "It arises from cultivating the truth of nonfrivolity, and it arises from cultivating immeasurable pure actions.",
        "source": "T14n0476_001:0561a19_37"
    },
    {
        "source_sentence": "「諸仁者！",
        "translation": "Gentlemen!",
        "source": "T14n0476_001:0561a20_38"
    },
    {
        "source_sentence": "如來之身功德如是，汝等皆應發心求證。",
        "translation": "The merit of the Tathāgata's body is like this, so you should all arouse your minds and seek to realize it.",
        "source": "T14n0476_001:0561a20_39"
    },
    {
        "source_sentence": "汝等欲得如是之身、息除一切有情病者，當發阿耨多羅三藐三菩提心。」",
        "translation": "If you want to attain such a body and calm the illnesses of all sentient beings, you must give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T14n0476_001:0561a21_40"
    },
    {
        "source_sentence": "是無垢稱為諸集會來問疾者如應說法，令無數千人皆發阿耨多羅三藐三菩提心。",
        "translation": "This is the immaculate teaching that causes countless thousands of people to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T14n0476_001:0561a23_41"
    },
    {
        "source_sentence": "說無垢稱經卷第一",
        "translation": "Shuo wuglishheng jing, vol. 1",
        "source": "T14n0476_001:0561a26_0"
    }
]