[
    {
        "source_sentence": "阿闍世王授決經",
        "translation": "Ajātaśatru-sūtra",
        "source": "T14n0509_001:0777a20_0"
    },
    {
        "source_sentence": "西晉沙門釋法炬譯",
        "translation": "Translated by the Western Jin Dynasty Translation of the Ascetic Shi Fahou",
        "source": "T14n0509_001:0777a22_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在羅閱祇國耆闍崛山中。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Mount Gṛdhrakūṭa in Rājagṛha.",
        "source": "T14n0509_001:0777a23_0"
    },
    {
        "source_sentence": "時阿闍世王請佛，飯食已訖，佛還祇洹。",
        "translation": "King Ajātaśatru then invited the Buddha, and after he had finished his meal, the Buddha returned to Jīvaka.",
        "source": "T14n0509_001:0777a23_1"
    },
    {
        "source_sentence": "王與祇婆議曰：「今日請佛，佛飯已竟，更復所宜？」",
        "translation": "The king and Jīvaka discussed it with him, saying, Today, I've invited the Buddha, and after he finishes his meal, what else is appropriate?",
        "source": "T14n0509_001:0777a24_2"
    },
    {
        "source_sentence": "祇婆言：「惟多然燈也。」",
        "translation": "Jīvaka said, It's just a lot of light.",
        "source": "T14n0509_001:0777a25_3"
    },
    {
        "source_sentence": "於是王乃勅具百斛麻油膏，從宮門至祇洹精舍。",
        "translation": "The king then ordered a hundred cubic feet of hemp oil and ointment to be supplied, and they went from the palace gate to the Jetavana monastery.",
        "source": "T14n0509_001:0777a26_4"
    },
    {
        "source_sentence": "時有貧窮老母，常有至心欲供養佛而無資財，見王作此功德乃更感激，",
        "translation": "At the time, there was a poor old mother who always wanted to make offerings to the Buddha but didn't have any money. Seeing the king perform this meritorious act, she became even more grateful.",
        "source": "T14n0509_001:0777a27_5"
    },
    {
        "source_sentence": "行乞得兩錢，以至麻油家買膏。",
        "translation": "He begged for two coins to go to the sesame oil house to buy some ointment.",
        "source": "T14n0509_001:0777a29_6"
    },
    {
        "source_sentence": "膏主曰：「母人大貧窮，乞得兩錢，何不買食以自連繼，用此膏為？」",
        "translation": "The owner of the plaster said, My mother is poor and begs for two coins, so why doesn't she buy food to continue on her own and use this plaster for her?",
        "source": "T14n0509_001:0777a29_7"
    },
    {
        "source_sentence": "母曰：「我聞佛生難值，百劫一遇。",
        "translation": "His mother said, “I have heard that it is difficult to meet a buddha.",
        "source": "T14n0509_001:0777b02_8"
    },
    {
        "source_sentence": "我幸逢佛世而無供養，今日見王作大功德，巍巍無量激起我意，雖實貧窮故欲然一燈，",
        "translation": "Good man, it is fortunate that I have encountered buddhas in the world but have not offered any offerings to them. Today when I see a king of great virtue who is so lofty and immeasurable as to arouse my mind, even though he may be truly poor, I want to keep the light of one lamp.",
        "source": "T14n0509_001:0777b03_9"
    },
    {
        "source_sentence": "為後世根本者也。」",
        "translation": "It's the root of later generations.",
        "source": "T14n0509_001:0777b05_10"
    },
    {
        "source_sentence": "於是膏主知其至意，與兩錢膏應得二合，特益三合凡得五合。",
        "translation": "Knowing his intention, the owner of the plaster knew that he would give two units of oil for two coins, and he specially benefited from three units to get five units.",
        "source": "T14n0509_001:0777b05_11"
    },
    {
        "source_sentence": "母則往，當佛前然之。",
        "translation": "The mother then departed and went to the Buddha's presence, leaving him behind.",
        "source": "T14n0509_001:0777b07_12"
    },
    {
        "source_sentence": "心計此膏不足半夕，乃自誓言：「若我後世得道如佛，膏當通夕光明不消。」",
        "translation": "He thought that this ointment wouldn't be enough for half an hour, and then vowed, If I attain the path in a later life like the Buddha, the ointment will penetrate through the night without disappearing.",
        "source": "T14n0509_001:0777b07_13"
    },
    {
        "source_sentence": "作禮而去。",
        "translation": "He paid homage and departed.",
        "source": "T14n0509_001:0777b09_14"
    },
    {
        "source_sentence": "王所然燈或滅、或盡，雖有人侍恒不周匝；",
        "translation": "The light of the king’s lamp may go out or not, but even if there were to be an attendant, it would not reach all directions.",
        "source": "T14n0509_001:0777b09_15"
    },
    {
        "source_sentence": "老母所然一燈，光明特朗，殊勝諸燈通夕不滅，膏又不盡。",
        "translation": "The old mother had a single lamp of extraordinarily bright light that did not go out all night long, and the anointed oil did not run out.",
        "source": "T14n0509_001:0777b10_16"
    },
    {
        "source_sentence": "至明朝旦，母復來前頭面作禮，叉手却住。",
        "translation": "On the morning, at dawn, his mother came before him again, bowed her forehead and face, saluted him with palms joined, and withdrew.",
        "source": "T14n0509_001:0777b11_17"
    },
    {
        "source_sentence": "佛告目連：「天今已曉，可滅諸燈。」",
        "translation": "The Buddha told Maudgalyāyana, Now that it's dawn, the gods can extinguish the lamps.",
        "source": "T14n0509_001:0777b13_0"
    },
    {
        "source_sentence": "目連承教，以次滅諸燈，燈皆已滅，惟此母一燈三滅不滅，便舉袈裟以扇之，",
        "translation": "Having been instructed, Maudgalyāyana successively extinguished all the lamps. The lights had all gone out but the mother’s one lamp did not go out three times. Then she lifted up her reddish-brown robe and fanned it.",
        "source": "T14n0509_001:0777b13_1"
    },
    {
        "source_sentence": "燈光益明；",
        "translation": "The light of the lamp became increasingly bright.",
        "source": "T14n0509_001:0777b15_2"
    },
    {
        "source_sentence": "乃以威神引隨藍風以次吹燈，老母燈更盛猛，乃上照梵天，傍照三千世界悉見其光。",
        "translation": "He then led the flame to follow the blue wind and blew the lamp one after the other. The old mother’s lamp became even more powerful, so that it shone upward in the brahma-heaven and illuminated the 3,000 worlds beside it all with its light.",
        "source": "T14n0509_001:0777b15_3"
    },
    {
        "source_sentence": "佛告目連：「止！",
        "translation": "The Buddha told Maudgalyāyana, Stop!",
        "source": "T14n0509_001:0777b17_4"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T14n0509_001:0777b17_5"
    },
    {
        "source_sentence": "此當來佛之光明功德，非汝威神所毀滅。",
        "translation": "These will be the light and virtues of the future buddhas, not destroyed by your authoritative power.",
        "source": "T14n0509_001:0777b18_0"
    },
    {
        "source_sentence": "此母宿命供養百八十億佛已，從前佛受決，務以經法教授開化人民，未暇修檀，",
        "translation": "This mother had in her previous existence made offerings to one hundred and eighty koṭis of buddhas, receiving their predictions from the former buddha. She was devoted to teaching the people by means of scriptures and doctrines; she did not have time to cultivate giving.",
        "source": "T14n0509_001:0777b18_1"
    },
    {
        "source_sentence": "故今貧窮無有財寶。",
        "translation": "Therefore, they're now poor and have no possessions or treasure.",
        "source": "T14n0509_001:0777b20_2"
    },
    {
        "source_sentence": "却後三十劫，功德成滿當得作佛，號曰須彌燈光如來、至真，世界無有日月，",
        "translation": "In thirty world ages he will attain buddhahood. His name will be Samantabhadra Tathāgata and Arhat, the Supreme Truth; there will be no sun or moon in this world.",
        "source": "T14n0509_001:0777b21_3"
    },
    {
        "source_sentence": "人民身中皆有大光，宮室眾寶光明相照如忉利天上。」",
        "translation": "In the bodies of the people, there's a great radiance in them all, and the palace is as shining as the Trāyastriṃśa gods.",
        "source": "T14n0509_001:0777b22_4"
    },
    {
        "source_sentence": "老母聞決歡喜，即時輕舉身昇虛空，去地百八十丈，來下頭面作禮而去。",
        "translation": "The old mother was delighted to hear this, and immediately lifted her body up into the air. One hundred and eighty-eight zhang above the ground, she came down, bowed her head and face, and departed.",
        "source": "T14n0509_001:0777b24_5"
    },
    {
        "source_sentence": "王聞之，問祇婆曰：「我作功德巍巍如此，而佛不與我決；",
        "translation": "When the king heard this, he asked Jīvaka, “I am so lofty in my virtue that the Buddha has not given me a ruling.",
        "source": "T14n0509_001:0777b25_6"
    },
    {
        "source_sentence": "此母然一燈便受決。",
        "translation": "This mother, however, had a lamp and then accepted the ruling.",
        "source": "T14n0509_001:0777b27_7"
    },
    {
        "source_sentence": "何以爾也？」",
        "translation": "Why is that?",
        "source": "T14n0509_001:0777b27_8"
    },
    {
        "source_sentence": "祇婆曰：「王所作雖多，心不專一，不如此母注心於佛也。」",
        "translation": "Jīvaka said, Although there are so many things the king does, his mind isn't concentrated on one thing; it's not like a mother who focuses her mind on the Buddha.",
        "source": "T14n0509_001:0777b27_9"
    },
    {
        "source_sentence": "乃更往請佛。",
        "translation": "He then went back to the Buddha and invited him.",
        "source": "T14n0509_001:0777b29_0"
    },
    {
        "source_sentence": "宿勅諸園監，各令晨採好華，早送入宮至中。",
        "translation": "The night gods ordered the guardians of the monastery to gather good flowers in the morning and bring them to the palace at an early hour.",
        "source": "T14n0509_001:0777b29_1"
    },
    {
        "source_sentence": "佛便晨出祇洹，徐徐緩行，隨道為人民說法，投日中至宮。",
        "translation": "The Buddha came out of Jīvaka in the morning, walked slowly and gradually, taught the Dharma to the people on his way, and entered the palace by daylight.",
        "source": "T14n0509_001:0777c01_2"
    },
    {
        "source_sentence": "有一園監持華適出園巷，正與佛會於大道之衢，聞佛說經一心歡喜，即以所持華悉散佛上，",
        "translation": "There was a flower kept by the superintendent of the park, who came out of the park and proceeded in an assembly with the Buddha at the crossroads of the great path. Having heard the Buddha expound the scripture, he wholeheartedly rejoiced and scattered all the flowers he held over the Buddha.",
        "source": "T14n0509_001:0777c02_3"
    },
    {
        "source_sentence": "花皆住於空中當佛頭上。",
        "translation": "The flowers all stand in the sky above the Buddha's head.",
        "source": "T14n0509_001:0777c04_4"
    },
    {
        "source_sentence": "佛即授決曰：「汝已供養九十億佛，却後百四十劫，汝當為佛，號曰覺華如來。」",
        "translation": "The Buddha then gave a decree, saying, You've already offered support to nine billion buddhas, but after one hundred and forty eons, you will become a buddha named the Flower of Enlightenment Tathāgata.",
        "source": "T14n0509_001:0777c05_5"
    },
    {
        "source_sentence": "其人歡喜，即時輕舉身昇虛空，來下作禮畢，即更自念：「我王為人性大嚴急，",
        "translation": "Rejoicing, they immediately lifted their bodies up into the air and came down to pay homage. Having done so, they thought to themselves:",
        "source": "T14n0509_001:0777c07_6"
    },
    {
        "source_sentence": "故宿勅我齋戒將華，當以供佛，而我悉自以上佛，空手而往，必當殺我。」",
        "translation": "That's why the constellation has instructed me to observe the precepts with flowers and make offerings to the Buddha, but I will surely kill myself if I go up there without my own hands.",
        "source": "T14n0509_001:0777c08_7"
    },
    {
        "source_sentence": "便徑歸家，置空華箱於戶外，入告婦言：「我朝來未食，王今當殺我，",
        "translation": "So he went home and placed an empty flower box outside the door. Entering it, he said to his wife, “I have not yet eaten this morning.",
        "source": "T14n0509_001:0777c10_8"
    },
    {
        "source_sentence": "急為具食。」",
        "translation": "I'll quickly prepare food for you.",
        "source": "T14n0509_001:0777c12_0"
    },
    {
        "source_sentence": "婦聞大惶，懅曰：「王何故相殺？」",
        "translation": "When the woman heard this, she was greatly frightened and asked, Why did the king kill you?",
        "source": "T14n0509_001:0777c12_1"
    },
    {
        "source_sentence": "便為婦本末說之。",
        "translation": "He then explained the original and derivative parts of the woman's story.",
        "source": "T14n0509_001:0777c12_2"
    },
    {
        "source_sentence": "婦即出，至竈下具食，天帝釋便以天華滿空箱中。",
        "translation": "The woman then left and went to the bottom of the almsbowl to prepare food, and Indra filled the empty box with heavenly flowers.",
        "source": "T14n0509_001:0777c13_3"
    },
    {
        "source_sentence": "婦持食還，見戶外箱中華滿如故，光色非凡，即以告夫。",
        "translation": "When the woman returned with her food, she saw that the outside box was filled with food as usual and its color was extraordinary. So she told her husband.",
        "source": "T14n0509_001:0777c14_4"
    },
    {
        "source_sentence": "夫出戶視，知是天花，心大歡喜，止不復食便持華入。",
        "translation": "Knowing that it was a heavenly flower, the husband was greatly delighted. After stopping and not eating again, he took the flower and went in.",
        "source": "T14n0509_001:0777c15_5"
    },
    {
        "source_sentence": "王適出迎佛，道與王相逢。",
        "translation": "When the king came out to meet the Buddha, he met with the king on the road.",
        "source": "T14n0509_001:0777c16_6"
    },
    {
        "source_sentence": "王見華大好，世間希有，即問監曰：「我園中大有此好華乃爾，而汝前後不送上，",
        "translation": "Seeing that the flowers were so big and beautiful as to be rare in the world, the king asked the treasurer, “There is such a large flower in my garden. Why don’t you send it up?",
        "source": "T14n0509_001:0777c17_7"
    },
    {
        "source_sentence": "汝罪應死，寧知之不？」",
        "translation": "You should die for your sins, so how could you know them?",
        "source": "T14n0509_001:0777c19_8"
    },
    {
        "source_sentence": "監曰：「大王！",
        "translation": "The superintendent said, Great king!",
        "source": "T14n0509_001:0777c19_9"
    },
    {
        "source_sentence": "園中無有此華。",
        "translation": "There's no such flower in the garden.",
        "source": "T14n0509_001:0777c20_0"
    },
    {
        "source_sentence": "臣朝早將園華道路逢佛，不勝歡喜，盡以上佛，即授與我決。",
        "translation": "Early in the morning I approached the Buddha on the road leading to the pleasure grove. Being overjoyed, I gave him all of the above-mentioned buddhas my predictions.",
        "source": "T14n0509_001:0777c20_1"
    },
    {
        "source_sentence": "知當殺故，過家索食，比其頃出視空箱中，復見此華；",
        "translation": "Knowing that he was about to be killed, the king came home and begged for food. Soon afterward he went out of his house to look inside the empty box but found this flower again.",
        "source": "T14n0509_001:0777c21_2"
    },
    {
        "source_sentence": "必是天華，非園所有。",
        "translation": "It must be a heavenly flower that doesn't exist in the garden.",
        "source": "T14n0509_001:0777c22_3"
    },
    {
        "source_sentence": "今我生既卑賤，為王守園，拘制縣官不得行道；",
        "translation": "Now that I am born into a lowly and unworthy family, I am the king’s guardian of the forest.",
        "source": "T14n0509_001:0777c23_4"
    },
    {
        "source_sentence": "一已授決，正爾而死，必生天上，十方佛前無所拘制，可得恣意行道。",
        "translation": "Once they've given their ruling, they'll surely be born in heaven and have no restraints before the buddhas of the ten directions, so they can practice the path as freely as they wish.",
        "source": "T14n0509_001:0777c24_5"
    },
    {
        "source_sentence": "王若相殺，我無所在也。」",
        "translation": "If the king kills each other, I have no place to be.",
        "source": "T14n0509_001:0777c26_6"
    },
    {
        "source_sentence": "王聞授決，便生慚怖，肅然毛竪，即起作禮，長跪懺悔。",
        "translation": "On hearing the instruction, the king became ashamed and frightened. With his hair standing on end in reverence, he stood up to pay homage and knelt down to repent.",
        "source": "T14n0509_001:0777c26_7"
    },
    {
        "source_sentence": "佛至宮，飯食已訖，呪願而去。",
        "translation": "When the Buddha arrived at the palace, he finished his meal and departed on a magical vow.",
        "source": "T14n0509_001:0777c27_8"
    },
    {
        "source_sentence": "王復問祇婆曰：「我前請佛，而老母受決；",
        "translation": "The king again asked Jīvaka, “I invited the Buddha before me, but my old mother accepted the invitation.",
        "source": "T14n0509_001:0777c28_9"
    },
    {
        "source_sentence": "今日設福，而園監受決；",
        "translation": "Today we wish to perform meritorious deeds, but the park superintendent receives the ordination.",
        "source": "T14n0509_001:0777c29_10"
    },
    {
        "source_sentence": "我獨何故初無所獲？",
        "translation": "Why is it that I alone have nothing to gain in the first place?",
        "source": "T14n0509_001:0778a01_0"
    },
    {
        "source_sentence": "心甚於悒，當復宜作何等功德耶？」",
        "translation": "What merit would it be advisable to create again when the mind is so gross?",
        "source": "T14n0509_001:0778a01_1"
    },
    {
        "source_sentence": "祇婆曰：「王雖頻日設福，但用國藏之財，使人民之力，心或貢高、意或瞋恚，",
        "translation": "Jīvaka said, “Even if the king frequently performs meritorious deeds, he uses the riches of his state treasury to enable the people to become arrogant and arrogant in their minds or angry in their thoughts.",
        "source": "T14n0509_001:0778a02_2"
    },
    {
        "source_sentence": "故未得決。",
        "translation": "Therefore, it hasn't yet been decided.",
        "source": "T14n0509_001:0778a03_3"
    },
    {
        "source_sentence": "今宜割損身中自供之具，并脫瓔珞七寶珠環以作寶華，當與夫人、太子併力合掌，",
        "translation": "Your majesty, it is advisable to cut off the ornaments that you have offered for yourselves in your body and remove the necklace of seven-jeweled pearls so as to make a j eweled flower. You should join your palms together with both hands at the same time:",
        "source": "T14n0509_001:0778a04_4"
    },
    {
        "source_sentence": "自就功勤一心上佛，佛照王至誠必得決也。」",
        "translation": "If you were to singlemindedly concentrate on the Buddha in terms of merit and diligence, the king Prabhāsvara would surely attain certainty with sincerity.",
        "source": "T14n0509_001:0778a06_5"
    },
    {
        "source_sentence": "於是王減徹廚膳晝夜齋戒，脫身上諸寶，合聚諸師曰前作華，王及夫人、太子皆自著手，",
        "translation": "The king then ate less, cooked his food thoroughly, observed the precepts day and night, took off all the treasures from his body, gathered the masters together, and said, “Decorate flowers.” The king, his wife, and the princes all put their hands on themselves.",
        "source": "T14n0509_001:0778a07_6"
    },
    {
        "source_sentence": "至九十日所作悉成，勅外駕當往上佛。",
        "translation": "On the ninetyth day, everything he did was accomplished, and he ordered an outsider to go up to the Buddha.",
        "source": "T14n0509_001:0778a09_7"
    },
    {
        "source_sentence": "傍臣白言：「聞佛前到鳩夷那竭國，已般泥洹也。」",
        "translation": "The attendant ministers said, I've heard that the Buddha went to Kuśinagara in front of me and has passed into nirvāṇa.",
        "source": "T14n0509_001:0778a10_8"
    },
    {
        "source_sentence": "王聞心大悲號，涕淚哽咽曰：「我故至心手作此華，佛雖般泥洹，我故當齎詣耆闍崛山，",
        "translation": "When the king heard this, his heart was overcome with great sorrow and cried out in tears, saying, “With my sincerity I handed down these flowers. Although the Buddha has entered nirvana, I will carry them to Mount Gṛdhrakūṭa.",
        "source": "T14n0509_001:0778a11_9"
    },
    {
        "source_sentence": "以上佛坐處，展馳我意也。」",
        "translation": "The above Buddha's seat is a place where he spreads out my mind.",
        "source": "T14n0509_001:0778a13_10"
    },
    {
        "source_sentence": "祇婆曰：「佛者，無身亦無泥洹，亦不常住無滅無在；",
        "translation": "Jīvaka said: A buddha has no body and no nirvana. Nor does he always abide, nor does he cease, nor does he dwell.",
        "source": "T14n0509_001:0778a13_11"
    },
    {
        "source_sentence": "惟至心者為得見佛，佛雖在世間，無至心者為不見佛，大王至誠乃爾，",
        "translation": "Only those who are mindful will be able to see the Buddha. Although the Buddha is in the world, those who are not mindful will not see him. So it is with the king’s sincerity.",
        "source": "T14n0509_001:0778a14_12"
    },
    {
        "source_sentence": "佛雖般泥洹，往必見佛。」",
        "translation": "Even though the Buddha is parinirvāṇa, he'll surely see the Buddha when he goes there.",
        "source": "T14n0509_001:0778a16_13"
    },
    {
        "source_sentence": "便至耆闍崛山中，見佛且悲且喜，垂淚而進，頭面作禮，以七寶華前散佛上，",
        "translation": "He went to Mount Gṛdhrakūṭa and saw that the Buddha was both grieved and joyous. With tears falling in his eyes he advanced, bowed his head and face, and scattered seven-jeweled flowers in front of him.",
        "source": "T14n0509_001:0778a17_14"
    },
    {
        "source_sentence": "華皆住空中化成寶蓋正當佛上，佛便授與王決曰：「却後八萬劫，劫名喜觀，",
        "translation": "The flowers all stayed in the sky, transforming themselves into jeweled canopies just above the Buddha. The Buddha then gave them to the king and said:",
        "source": "T14n0509_001:0778a18_15"
    },
    {
        "source_sentence": "王當為佛，佛號淨其所部如來，剎土名華王，時人民壽四十小劫。」",
        "translation": "The king will become a buddha, the Buddha will be called Jīvaka Tathāgata of his school, and the buddha's land will be called King of Flowers, with a life span of forty minor eons.",
        "source": "T14n0509_001:0778a20_16"
    },
    {
        "source_sentence": "阿闍世王太子，名旃陀和利，時年八歲，見父授決甚大歡喜，即脫身上眾寶以散佛上曰：「願淨其所部作佛時，",
        "translation": "The prince Ajātaśatru, whose name was Candravardhana, when he was eight years old, rejoiced greatly when he saw his father give him a decree. He took off all the treasures from his body and scattered them over the Buddha, saying:",
        "source": "T14n0509_001:0778a22_0"
    },
    {
        "source_sentence": "我作金輪聖王得供養佛，佛般泥洹後，我當承續為佛。」",
        "translation": "I'll become the golden-wheeled sage king who makes offerings to the Buddha, and after he parinirvāṇa, I will continue to be the Buddha.",
        "source": "T14n0509_001:0778a24_1"
    },
    {
        "source_sentence": "其所散寶，化為交露帳正覆佛上。",
        "translation": "The treasures he scattered were transformed into a cross-shaped canopy that covered the Buddha.",
        "source": "T14n0509_001:0778a25_2"
    },
    {
        "source_sentence": "佛言：「必如汝願，王為佛時必當作金輪聖王，壽終便上生兜率天上，",
        "translation": "The Buddha said, It must be as you wish. When the king becomes a buddha, he will surely become a sage king of the golden wheel. At the end of his life, he will be reborn in Tuṣita Heaven.",
        "source": "T14n0509_001:0778a26_3"
    },
    {
        "source_sentence": "壽盡便下作佛，在藥王剎土教授，佛號栴檀，人民壽命國土所有，皆如淨其所部。」",
        "translation": "When his life came to an end, he became a buddha and taught in the Dharma king's buddha land. The Buddha's name was sandalwood, and all the people living in the land possessed it just as they purified their own group.",
        "source": "T14n0509_001:0778a28_4"
    },
    {
        "source_sentence": "佛時授決適竟，王及旃陀和利前為佛作禮，便[火*霍]然不見佛所在。",
        "translation": "When the Buddha had completed his prediction, the king and Candrapāṇi paid homage to the Buddha in front of him, then [Fire*Ho] but they didn't see where he was.",
        "source": "T14n0509_001:0778b01_0"
    },
    {
        "source_sentence": "阿闍世王授決經",
        "translation": "Ajātaśatru-sūtra",
        "source": "T14n0509_001:0778b03_0"
    }
]