[
    {
        "source_sentence": "佛說長者法志妻經",
        "translation": "Foshuo zhuan fazhi wives jing",
        "source": "T14n0572_001:0944b19_0"
    },
    {
        "source_sentence": "失譯人名今附涼錄",
        "translation": "The name of the lost translator is now appended to the Liang lu",
        "source": "T14n0572_001:0944b21_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛國祇樹給孤獨園，與大比丘千二百五十、菩薩萬人俱。",
        "translation": "Thus I have heard: One time, when the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī, accompanied by one thousand two hundred and fifty great bhikṣus and ten thousand bodhi",
        "source": "T14n0572_001:0944b22_0"
    },
    {
        "source_sentence": "佛時清旦，著衣持鉢入城分衛，比丘菩薩皆悉侍從。",
        "translation": "At dawn, the Buddha put on his robes, took his bowl, and entered the city to guard it. The monks and bodhisattvas all attended him.",
        "source": "T14n0572_001:0944b23_1"
    },
    {
        "source_sentence": "諸天龍神及香音神、無善之神、鳳凰神、山神執樂神王，皆散華燒香，",
        "translation": "The devas, nāgas, yakṣas, gandharvas, as well as the spirits of fragrance and sound, wicked spirits, bad spirits, phoenixes, and mountain spirits all scattered flowers and burned incense.",
        "source": "T14n0572_001:0944b24_2"
    },
    {
        "source_sentence": "「從無數億劫，　　積行難可量，",
        "translation": "“Since innumerable hundreds of millions of eons ago, The accumulation of practices has been immeasurable.",
        "source": "T14n0572_001:0944b26_3"
    },
    {
        "source_sentence": "　慈愍于眾生，　　使發大道行。",
        "translation": "With compassion for sentient beings, he causes them to give rise to the practice of the great path.",
        "source": "T14n0572_001:0944b26_3"
    },
    {
        "source_sentence": "　三界猶如化，　　一切悉空無，",
        "translation": "The three realms are like phantoms, All empty and nonexistent.",
        "source": "T14n0572_001:0944b26_3"
    },
    {
        "source_sentence": "　能曉了此慧，　　度脫諸十方。",
        "translation": "Understanding this wisdom, he's liberated from the ten directions.",
        "source": "T14n0572_001:0944b26_3"
    },
    {
        "source_sentence": "　三十二相明，　　姿好八十種，",
        "translation": "The thirty-two characteristics are clear, and the eighty-eight kinds of appearance.",
        "source": "T14n0572_001:0944b26_3"
    },
    {
        "source_sentence": "　口出萬億音，　　功德自嚴容。",
        "translation": "Myriads of koṭis of voices emanate from my mouth, A glorious and self-adorned appearance.",
        "source": "T14n0572_001:0944b26_3"
    },
    {
        "source_sentence": "　雖處現三界，　　開示三道場，",
        "translation": "Even though they appear in the three realms, They reveal the three sites of enlightenment.",
        "source": "T14n0572_001:0944b26_3"
    },
    {
        "source_sentence": "　三垢今已滅，　　除于三世殃。",
        "translation": "Now that the three defilements have ceased, he's removed the evils of the three worlds.",
        "source": "T14n0572_001:0944b26_3"
    },
    {
        "source_sentence": "　心如明月珠，　　處欲無所著，",
        "translation": "The mind is like the bright moon-pearl, With no attachment to objects or desires.",
        "source": "T14n0572_001:0944b26_3"
    },
    {
        "source_sentence": "　等行離愛憎，　　一切無適莫。」",
        "translation": "Equanimous practice is free of craving and hatred, and there's nothing suitable for it.",
        "source": "T14n0572_001:0944b26_3"
    },
    {
        "source_sentence": "鼓諸音樂歌歎佛德，而說頌曰：於是，人民聞歌頌佛德，一國集會觀佛行來，",
        "translation": "The drums and instruments sang in praise of the Buddha’s virtue, saying these verses: Thereupon, when the people heard the Buddha’s virtues chanted in song, they assembled in one country to contemplate the coming and going of",
        "source": "T14n0572_001:0944b26_3"
    },
    {
        "source_sentence": "舉動進止法則安徐，威容之顏猶星中月、如日初出，普照天下無所罣礙。",
        "translation": "He was calm and peaceful in every way, his imposing countenance like the moon among the stars or the sun rising at the beginning of the day. He shone unobstructed throughout the sky without obstruction.",
        "source": "T14n0572_001:0944c10_0"
    },
    {
        "source_sentence": "譬如梵王處諸天中，如天帝釋處忉利宮諸天中尊，猶須彌山現于大海，",
        "translation": "It's like when the king of Brahmā is among the gods, or Indra is in the palace of the Trāyastriṃśa gods and the most honored among the gods, just as Mount Sumeru appears in the ocean.",
        "source": "T14n0572_001:0944c11_1"
    },
    {
        "source_sentence": "四域之中安不可動，歡喜踊躍叉手歸命。",
        "translation": "The four quarters of the empire were peaceful and unmoving, and they rejoiced and jumped for joy. They saluted with palms joined and returned to their lives.",
        "source": "T14n0572_001:0944c13_2"
    },
    {
        "source_sentence": "佛至長者法志門外，進到中閤，放大光明皆照十方。",
        "translation": "When the Buddha arrived outside the gate of the elder's religious aspiration, he entered the inner sanctum and emitted a great ray of light that shone in all ten directions.",
        "source": "T14n0572_001:0944c14_3"
    },
    {
        "source_sentence": "時長者妻嚴莊床座，文飾身形眾寶瓔珞，服栴檀香面彩顏貌，五色焜煌謂可保常。",
        "translation": "The elder's wife adorned her bed and seat, decorated her body with a multitude of jeweled jewelry, wore sandalwood incense, had a colorful appearance, and was five-colored and shining, which is said to be",
        "source": "T14n0572_001:0944c15_4"
    },
    {
        "source_sentence": "奴客婢使小有過失，撾捶苦毒不問曲直。",
        "translation": "The slaves, guests, and maidservants have minor faults, and they're tormented with pain and suffering without asking questions that are straight and crooked.",
        "source": "T14n0572_001:0944c17_5"
    },
    {
        "source_sentence": "遙見佛明超于日光，心自念言：「此之顯耀，非類日月、釋梵諸天凡俗之光，",
        "translation": "From a distance, he saw that the Buddha’s brightness surpassed the light of the sun. He thought to himself, “This brilliant light is not similar to that of the sun and moon, nor to that of the gods or Brahmā gods,",
        "source": "T14n0572_001:0944c18_6"
    },
    {
        "source_sentence": "其明清涼安隱無量，我身蒙之一切無患，不飢不渴自然飽滿，云何行杖加於僕從？」",
        "translation": "It's so clear, cool, peaceful, and immeasurable that my body is covered with all kinds of fearlessness, and I naturally fill it up without hunger or thirst, so how can I walk on a staff and add servants to",
        "source": "T14n0572_001:0944c19_7"
    },
    {
        "source_sentence": "速趣向閤覩見世尊，相好威耀難可為喻，諸根寂定無有衰入，猶七寶山晃晃巍巍，",
        "translation": "They quickly proceed to see the World-honored One. Their features are beautiful and imposing, difficult to describe. Their faculties are tranquil and without decrepitude; they are like a lofty shining mountain of the seven kinds of treasure.",
        "source": "T14n0572_001:0944c21_8"
    },
    {
        "source_sentence": "慚懼悲喜稽首佛足：「悔過殃釁，所犯無狀，既為女人，不能自責，瞋喜由己，",
        "translation": "Being embarrassed and fearful, he bowed his head at the Buddha’s feet in sorrow and pity. He repented of his evil deeds and forbade him to commit any offense. Since he was a woman, he",
        "source": "T14n0572_001:0944c23_9"
    },
    {
        "source_sentence": "今首罪舋不敢藏匿。」",
        "translation": "Now, the chief offender doesn't dare to hide it.",
        "source": "T14n0572_001:0944c25_10"
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, Good!",
        "source": "T14n0572_001:0944c25_11"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T14n0572_001:0944c26_12"
    },
    {
        "source_sentence": "汝獲善利離一切衰，見身殃咎改往修來，人身難得佛經難值，億世時有。",
        "translation": "You'll attain good benefits and be freed from all decay, see the body as bad and blameless, change past and future, cultivate it again and again, and a human body that's difficult to find and the Buddha's sūtras are",
        "source": "T14n0572_001:0944c26_13"
    },
    {
        "source_sentence": "所以墮女人身中者何？",
        "translation": "What's the reason they fall into the female body?",
        "source": "T14n0572_001:0944c27_14"
    },
    {
        "source_sentence": "婬欲姿態在於其中，不能修身放心恣意，嫉妬多口貪于形貌而自恃怙。",
        "translation": "Their lustful appearances and attitudes are there, but they can't cultivate self-confidence in their bodies, become jealous of verbally greedy appearances, and rely on themselves.",
        "source": "T14n0572_001:0944c28_15"
    },
    {
        "source_sentence": "世間無常，豪富威勢須臾間耳，當視諸下猶如赤子，豪富貧賤如月進退，",
        "translation": "The world is impermanent, and wealthy and powerful are like a moon advancing and retreating.",
        "source": "T14n0572_001:0945a01_0"
    },
    {
        "source_sentence": "若日出沒水火風起不久則衰，一切道俗皆從心興。",
        "translation": "If the sun rises and sets, water, fire, and wind don't arise for a long time, and then they weaken, all the monks and laypeople rise from their minds.",
        "source": "T14n0572_001:0945a02_1"
    },
    {
        "source_sentence": "上天、人間、地獄、餓鬼、畜生之類皆由己耳；",
        "translation": "The gods, humans, hells, hungry ghosts, and animals all came from their own ears.",
        "source": "T14n0572_001:0945a03_2"
    },
    {
        "source_sentence": "佛、天中天、緣覺、聲聞，亦復如是。",
        "translation": "So it is with the buddhas, gods among gods, pratyekabuddhas, and śrāvakas.",
        "source": "T14n0572_001:0945a04_3"
    },
    {
        "source_sentence": "今我斯身三十二相、八十種好，徹覩十方悉從解達。」",
        "translation": "Now, this body of mine has thirty-two marks and eighty kinds of beauty, which penetrate the ten directions from their understanding.",
        "source": "T14n0572_001:0945a05_4"
    },
    {
        "source_sentence": "女聞佛言歡喜無量，重自歸命責己朦冥，唯受不及開化未聞無上之誨。",
        "translation": "The woman heard the Buddha's words and rejoiced immeasurably, heavily taking refuge in her own life and blaming herself for being deluded, but she only received the unsurpassed teaching that didn't enlightenment and hadn'",
        "source": "T14n0572_001:0945a06_5"
    },
    {
        "source_sentence": "佛言：「施行十善義：身不殺盜婬，口不妄言、兩舌、綺語、惡口，意不嫉、恚、癡；",
        "translation": "The Buddha said: There are ten wholesome practices: abstention from killing, stealing, sexual misconduct, speaking falsehoods, divisive speech, hypocrisy, flattery, harsh speech, and not being jealous, hatred, or",
        "source": "T14n0572_001:0945a08_6"
    },
    {
        "source_sentence": "當奉六度：布施、持戒、忍辱、精進、一心、智慧；",
        "translation": "You should uphold six perfections: generosity, keeping the precepts, patience, effort, unity of mind, and wisdom.",
        "source": "T14n0572_001:0945a10_0"
    },
    {
        "source_sentence": "遵四等心：慈、悲、喜、護，普弘大哀，自致得三十二相、八十種好。",
        "translation": "He follows the four kinds of mind: kindness, pity, pity, joy, and protection, which universally express great compassion and attain the thirty-two characteristics and eighty kinds of beauty for themselves.",
        "source": "T14n0572_001:0945a10_1"
    },
    {
        "source_sentence": "乃為奴客婢使，教以辛苦生死罪福，示語三塗之患難也，誡以道禁義理之事，",
        "translation": "He then instructed his servants and maidservants to teach them about the sins and merits of birth and death through hardship, telling them about the troubles and difficulties of the three evil destinies, admonishing them with the principles of the",
        "source": "T14n0572_001:0945a12_2"
    },
    {
        "source_sentence": "勝于撾杖。",
        "translation": "They're superior to those who lay down their staff.",
        "source": "T14n0572_001:0945a14_3"
    },
    {
        "source_sentence": "「莊嚴瓔珞有四事。",
        "translation": "There are four things that adorn the necklace.",
        "source": "T14n0572_001:0945a14_4"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T14n0572_001:0945a14_5"
    },
    {
        "source_sentence": "一曰、篤信；",
        "translation": "The first is faith.",
        "source": "T14n0572_001:0945a15_0"
    },
    {
        "source_sentence": "二曰、戒禁；",
        "translation": "The second is the precept against immorality.",
        "source": "T14n0572_001:0945a15_1"
    },
    {
        "source_sentence": "三曰、三昧；",
        "translation": "The third is samādhi.",
        "source": "T14n0572_001:0945a15_2"
    },
    {
        "source_sentence": "四曰、智慧；",
        "translation": "The fourth is wisdom.",
        "source": "T14n0572_001:0945a15_3"
    },
    {
        "source_sentence": "是為四事。",
        "translation": "These are the four things.",
        "source": "T14n0572_001:0945a16_0"
    },
    {
        "source_sentence": "菩薩自莊嚴心計大乘，無男無女猶如幻化，畫師所作隨意輒成，曉了空慧一切本淨，",
        "translation": "The enlightening beings themselves adorn their minds with conceptions of the Great Vehicle, conceiving that there is neither male nor female as if they were magical illusions. Whatever the painter wishes to do, he does so at will.",
        "source": "T14n0572_001:0945a16_1"
    },
    {
        "source_sentence": "得無名身四無所畏，四事不護獨步三界度脫一切。」",
        "translation": "He attains the four fearlessnesses of the nameless body and the four things he doesn't guard, walking alone in the three realms and liberating all.",
        "source": "T14n0572_001:0945a18_2"
    },
    {
        "source_sentence": "女聞佛教心開踊躍，即發無上正真道意，立不退轉地。",
        "translation": "When the woman heard the Buddha's teaching, her mind was enlightened and she immediately aroused the intention for the unsurpassed true path and established the stage of nonretrogression.",
        "source": "T14n0572_001:0945a19_3"
    },
    {
        "source_sentence": "時天帝釋來在佛後，謂女言曰：「佛道難得，不如求轉女為男日月天帝轉輪聖王。」",
        "translation": "When Śakra came to the Buddha's presence, he said to the woman, The Buddha Way is difficult to attain, so why wouldn't you ask him to turn the woman into a man and become the wheel-turning sage king Sun and Moon, Indra",
        "source": "T14n0572_001:0945a20_4"
    },
    {
        "source_sentence": "「天帝日月王，　　轉輪四域主，",
        "translation": "Indra, king of the sun and moon, ruler of the four quarters,",
        "source": "T14n0572_001:0945a22_5"
    },
    {
        "source_sentence": "　威勢無幾間，　　不可久恃怙。",
        "translation": "There's no long period of authority, so you can't rely on it for a long time.",
        "source": "T14n0572_001:0945a22_5"
    },
    {
        "source_sentence": "　在豪如朝露，　　夢中有所覩，",
        "translation": "They're as great as morning dew, and there's something in their dreams that disturbs them.",
        "source": "T14n0572_001:0945a22_5"
    },
    {
        "source_sentence": "　覺以忽滅盡，　　不知所湊處。",
        "translation": "Their feelings suddenly cease, and they don't know where they're collected.",
        "source": "T14n0572_001:0945a22_5"
    },
    {
        "source_sentence": "　五陰如幻化，　　三界由己作，",
        "translation": "The five aggregates are like magic tricks, created by themselves in the three realms.",
        "source": "T14n0572_001:0945a22_5"
    },
    {
        "source_sentence": "　三世以平等，　　道心無等侶。",
        "translation": "Because the three worlds are equal, there's no equal in the mind of enlightenment.",
        "source": "T14n0572_001:0945a22_5"
    },
    {
        "source_sentence": "　諦解作是了，　　誰男何所女？",
        "translation": "Truth understands and makes this understanding: Who is male and what is female?",
        "source": "T14n0572_001:0945a22_5"
    },
    {
        "source_sentence": "　天帝聞斯言，　　默然無所語。」",
        "translation": "When the emperor heard these words, he remained silent and didn't say anything.",
        "source": "T14n0572_001:0945a22_5"
    },
    {
        "source_sentence": "於是女以偈頌曰：佛言：「善哉！",
        "translation": "The woman then composed a verse in verse, saying, Good!",
        "source": "T14n0572_001:0945a22_5"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T14n0572_001:0945b02_6"
    },
    {
        "source_sentence": "誠如所云，三處如幻化、影響、野馬、水月、芭蕉，俗人不解計有吾我，",
        "translation": "Just as you say, the three places are like magic tricks, influences, wild horses, the moon in water, and plantains. The common people do not understand that there is a self:",
        "source": "T14n0572_001:0945b02_7"
    },
    {
        "source_sentence": "便倚三界不能自濟。」",
        "translation": "They then rely on the three realms and can't help themselves.",
        "source": "T14n0572_001:0945b03_8"
    },
    {
        "source_sentence": "女心即解變為男子，踊在虛空下禮佛足。",
        "translation": "The woman's mind then resolved to become a man and jumped up into the sky to bow at the Buddha's feet.",
        "source": "T14n0572_001:0945b04_9"
    },
    {
        "source_sentence": "佛告女曰：「汝於後世恒沙來劫當得作佛，號無垢王如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師、佛，",
        "translation": "The Buddha said to the queen, “In the ages to come you will become a buddha. You will be called King Vimalakīrti Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone",
        "source": "T14n0572_001:0945b05_10"
    },
    {
        "source_sentence": "號天中天，世曰光淨。」",
        "translation": "He's called the god among gods, and the world calls him radiant and pure.",
        "source": "T14n0572_001:0945b07_11"
    },
    {
        "source_sentence": "時來會者諸天人民無央數千，見此變應，皆發無上正真道意。",
        "translation": "At the time, there were countless thousands of gods and people in the assembly who saw this transformation and responded, all arousing the intention for the unsurpassed true path.",
        "source": "T14n0572_001:0945b08_12"
    },
    {
        "source_sentence": "時長者妻一切下使，前白佛言：「尊者、卑者本寧異乎？」",
        "translation": "The elder's wife and all the envoys went before the Buddha and said to him, How are the venerable and inferior beings originally different?",
        "source": "T14n0572_001:0945b09_13"
    },
    {
        "source_sentence": "佛言：「一切本無，隨心所存。",
        "translation": "The Buddha said, All things are originally nonexistent, but they exist according to the mind.",
        "source": "T14n0572_001:0945b11_0"
    },
    {
        "source_sentence": "雖為下使，發心為道可得成佛；",
        "translation": "Even though they are inferior envoys, the determination for enlightenment is the path by which they can attain buddhahood.",
        "source": "T14n0572_001:0945b11_1"
    },
    {
        "source_sentence": "既為尊豪，恣心憍慢，不離惡趣地獄、餓鬼、畜生之中。",
        "translation": "Because they're so noble and arrogant, their minds are self-indulgent and conceited, and they won't part with the bad destinies of hell, hungry ghosts, or animals.",
        "source": "T14n0572_001:0945b12_2"
    },
    {
        "source_sentence": "猶月增減如樹盛衰，一切非常無一可賴，唯道深慧乃可保常，猶如虛空無進無退。」",
        "translation": "It's like when the moon increases and decreases like a tree growing and weakening, there's no single thing to rely on that's impermanent, but only the profound wisdom of the path can maintain permanence, just as space has",
        "source": "T14n0572_001:0945b13_3"
    },
    {
        "source_sentence": "時諸下使踊躍欣豫發大道意，變為男子得不起忍。",
        "translation": "The lower envoys then jumped up and down in joy and aroused the intention for the great path, transforming themselves into men who attain patience that didn't arise.",
        "source": "T14n0572_001:0945b15_4"
    },
    {
        "source_sentence": "佛告阿難：「五陰無處，六情無根，十二因緣而無端緒，四大寄因，何所是人？」",
        "translation": "The Buddha told Ānanda, The five aggregates have no place, the six emotions have no faculties, the twelve causes and conditions have no beginning, and the four elements send their causes, so what is this person?",
        "source": "T14n0572_001:0945b16_5"
    },
    {
        "source_sentence": "佛說如是，莫不歡喜。",
        "translation": "The Buddha spoke thus, and none of them rejoiced.",
        "source": "T14n0572_001:0945b18_6"
    },
    {
        "source_sentence": "佛說長者法志妻經",
        "translation": "Foshuo zhuan fazhi wives jing",
        "source": "T14n0572_001:0945b19_0"
    }
]