[
    {
        "source_sentence": "佛說文殊師利般涅槃經",
        "translation": "Foshuo weishili pin nirvāṇa jing",
        "source": "T14n0463_001:0480b03_0"
    },
    {
        "source_sentence": "西晉居士聶道真譯",
        "translation": "Translated by the courtier Nie Daozhen of the Western Jin dynasty",
        "source": "T14n0463_001:0480b05_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在舍衛國祇樹給孤獨園，與大比丘僧八千人俱，長老舍利弗、大目揵連、摩訶迦葉、摩訶迦旃延，",
        "translation": "Thus I have heard. At one time the Buddha was staying at Jeta’s Grove Monastery in Sāvatthī, accompanied by eight thousand bhikṣus and monks, including elders Śāriputra, Mahāmaud",
        "source": "T14n0463_001:0480b06_0"
    },
    {
        "source_sentence": "如是等眾上首者也；",
        "translation": "They are the leaders of these assemblies.",
        "source": "T14n0463_001:0480b08_1"
    },
    {
        "source_sentence": "復有菩薩摩訶薩十六人等，賢劫千菩薩彌勒為上首；",
        "translation": "“Furthermore, there were sixteen great enlightening beings, led by Maitreya, who was the leader of a thousand enlightening beings in the world age of Universal Good.",
        "source": "T14n0463_001:0480b09_2"
    },
    {
        "source_sentence": "復有他方菩薩千二百人，觀世音菩薩而為上首。",
        "translation": "There were also twelve hundred bodhisattvas from other directions, led by Avalokiteśvara Bodhisattva.",
        "source": "T14n0463_001:0480b10_3"
    },
    {
        "source_sentence": "爾時，世尊於後夜分，入于三昧，其三昧名一切光。",
        "translation": "At the time, the Bhagavān entered samādhi in the latter part of the night, and that samādhi is called omniscience.",
        "source": "T14n0463_001:0480b11_4"
    },
    {
        "source_sentence": "入三昧已，舉身皆放金色光明，其光大盛，照祇陀林猶若金色，迴旋宛轉照文殊房，",
        "translation": "Having entered concentration, they all emitted golden light from their bodies. That light was so great that it shone as brightly as a golden color in the Jeta grove, circling and turning to illuminate the entirety of Manjushri’s quarters",
        "source": "T14n0463_001:0480b12_5"
    },
    {
        "source_sentence": "化為七重金臺，一一臺上有五百化佛臺中經行。",
        "translation": "He transformed them into seven-story golden terraces, and on each terrace there were five hundred transformations of the Buddha's altar in which he walked.",
        "source": "T14n0463_001:0480b14_6"
    },
    {
        "source_sentence": "時，文殊師利房前，自然化生五百七寶蓮華，圓若車輪，白銀為莖，阿茂咤馬瑙以為其臺，",
        "translation": "At that time, in front of the room of Mañjuśrī, five hundred and seven kinds of jeweled lotus blossoms were spontaneously produced by Manjushri. The flower was shaped like a carriage wheel with white silver stem",
        "source": "T14n0463_001:0480b15_7"
    },
    {
        "source_sentence": "雜色真珠以為花鬚，其花有光照佛精舍，從精舍出，還入文殊師利房。",
        "translation": "A mixed-colored genuine pearl is used as the flower beard, and that flower has a shining light that illuminates the Buddha's monastery. It comes out of the monastery and returns to Mañjuśrī",
        "source": "T14n0463_001:0480b17_8"
    },
    {
        "source_sentence": "爾時，會中有菩薩摩訶薩，名跋陀波羅，此瑞現時，跋陀波羅即從房出，",
        "translation": "At that time there was an assembly of bodhisattva mahāsattvas called Bhadrapāla in the assembly hall. When this omen appeared, Bhadrapāla came out of his room.",
        "source": "T14n0463_001:0480b19_9"
    },
    {
        "source_sentence": "禮佛精舍，到阿難房，告阿難言：「汝應知時，今夜世尊現神通相，為饒益眾生，",
        "translation": "He worshipped the Buddha’s monastery and came to Ānanda’s quarters. He said to Ānanda: You should know that tonight the World-honored One manifests his supernormal powers in order to benefit sentient beings,",
        "source": "T14n0463_001:0480b20_10"
    },
    {
        "source_sentence": "故說妙法，汝鳴揵椎。」",
        "translation": "That's why you teach the wonderful teaching, and you sound the gong.",
        "source": "T14n0463_001:0480b22_11"
    },
    {
        "source_sentence": "爾時，阿難白言：「大士！",
        "translation": "It was then that Ānanda said, Great man!",
        "source": "T14n0463_001:0480b22_12"
    },
    {
        "source_sentence": "世尊今者入深禪定，未被勅旨云何集眾？」",
        "translation": "Bhagavān, now that you've entered deep meditation and haven't been commanded to do so, how will you gather the crowd?",
        "source": "T14n0463_001:0480b23_13"
    },
    {
        "source_sentence": "作是語時，舍利弗至阿難所告言：「法弟！",
        "translation": "When he spoke these words, Śāriputra went to Ānanda and told him, Dharma brother!",
        "source": "T14n0463_001:0480b24_14"
    },
    {
        "source_sentence": "宜時集眾。」",
        "translation": "It's appropriate to gather the crowd at the right time.",
        "source": "T14n0463_001:0480b25_15"
    },
    {
        "source_sentence": "爾時，阿難入佛精舍，為佛作禮，未舉頭頃，空中有聲告阿難言：「速集眾僧。」",
        "translation": "It was then that Ānanda entered the Buddha's monastery and paid homage to him. Before he raised his head, a voice in the air said to Ānanda, Quickly gather the saṃgha.",
        "source": "T14n0463_001:0480b25_16"
    },
    {
        "source_sentence": "阿難聞已，即大歡喜，鳴揵椎集眾，如此音聲遍舍衛國，上聞有頂，釋梵護世天王與無數天子，",
        "translation": "Having heard it, Ānanda was greatly delighted. He sounded the thunder and assembled the assembly. The sound reached everywhere in Sāvatthī, reaching as far as the top of the lotus tree at the top of the",
        "source": "T14n0463_001:0480b27_17"
    },
    {
        "source_sentence": "將天花香詣祇陀林。",
        "translation": "He took the heavenly flowers and incense to the Jetavana Grove.",
        "source": "T14n0463_001:0480b29_18"
    },
    {
        "source_sentence": "爾時，世尊從三昧起，即便微笑，有五色光從佛口出，此光出時，祇洹精舍變成琉璃。",
        "translation": "At the time, the Bhagavān rose from his samādhi and smiled, and a five-colored light emerged from the Buddha's mouth. When this light emerged, the Jetavana monastery turned into lapis lazuli.",
        "source": "T14n0463_001:0480b29_19"
    },
    {
        "source_sentence": "爾時，文殊師利法王子，入佛精舍為佛作禮，一一膝上生五蓮華，文殊佛前合指掌時，",
        "translation": "It was then that the Dharma prince Mañjuśrī entered the Buddha’s monastery to pay his respects to him. On each knee of his feet grew five lotus blossoms, and as he joined his palms in front",
        "source": "T14n0463_001:0480c02_20"
    },
    {
        "source_sentence": "手十指端及手掌文，出十千金色蓮花以散佛上，化成七寶大蓋，懸諸幢幡，",
        "translation": "Ten thousand golden lotus blossoms scattered on the Buddha’s feet, transforming them into great canopies of the seven kinds of treasure and hanging banners and pennants.",
        "source": "T14n0463_001:0480c04_21"
    },
    {
        "source_sentence": "十方無量諸佛菩薩映現蓋中，繞佛三匝，却住一面。",
        "translation": "Countless buddhas and bodhisattvas of the ten directions are reflected in the canopy, circumambulate the Buddha three times, and withdrew to one side.",
        "source": "T14n0463_001:0480c06_22"
    },
    {
        "source_sentence": "爾時，跋陀波羅即從座起整衣服，為佛作禮，長跪合掌白佛言：「世尊！",
        "translation": "It was then that Bhadrapāla rose from his seat, straightened his clothes, paid homage to the Buddha, knelt down with joined palms, and said to him, Bhagavān!",
        "source": "T14n0463_001:0480c08_0"
    },
    {
        "source_sentence": "是文殊師利法王子，已曾親近百千諸佛，在此娑婆世界施作佛事，於十方面變現自在，",
        "translation": "This crown prince of the Dharma, Mañjuśrī, who had already become intimate with hundreds of thousands of buddhas, performed buddha-works here in this sahā world and manifested himself freely in all ten directions.",
        "source": "T14n0463_001:0480c09_1"
    },
    {
        "source_sentence": "却後久遠當般涅槃。」",
        "translation": "It'll be a long time before he reaches parinirvāṇa.",
        "source": "T14n0463_001:0480c11_2"
    },
    {
        "source_sentence": "佛告跋陀波羅：「此文殊師利有大慈悲，生於此國多羅聚落梵德婆羅門家。",
        "translation": "The Buddha told Bhadrapāla, This Mañjuśrī had great compassion and was born in the brahma family of Brahmā Maitreya in this country's Tārā village.",
        "source": "T14n0463_001:0480c12_3"
    },
    {
        "source_sentence": "其生之時，家內屋宅化如蓮華，從母右脇出，身紫金色，墮地能語如天童子，",
        "translation": "When he was born, his house transformed like a lotus flower. He came out of his mother’s right hypochondrium with a purplish-gold body that fell to the ground and could speak as if he were a heavenly youth.",
        "source": "T14n0463_001:0480c13_4"
    },
    {
        "source_sentence": "有七寶蓋隨覆其上。",
        "translation": "It was covered with a canopy of seven treasures.",
        "source": "T14n0463_001:0480c15_5"
    },
    {
        "source_sentence": "詣諸仙人求出家法，諸婆羅門九十五種、諸論議師無能酬對，唯於我所出家學道，",
        "translation": "He approached the holy ones and asked them to renounce the householder’s life. The brahmans of ninety-five types and the śāstra masters were unable to reply, saying, “We should renounce our householder’s life",
        "source": "T14n0463_001:0480c16_0"
    },
    {
        "source_sentence": "住首楞嚴三昧，以此三昧力故，於十方面——或現初生、出家、滅度、入般涅槃、現分舍利——饒益眾生。",
        "translation": "He abides in the śūraṃgama-samādhi, and because of the power of this samādhi, he gives benefit to sentient beings in ten directions - sometimes manifesting first birth, leaving home, cessation, entering parinirvāṇa",
        "source": "T14n0463_001:0480c17_1"
    },
    {
        "source_sentence": "如是大士久住首楞嚴，佛涅槃後四百五十歲，當至雪山，為五百仙人宣暢敷演十二部經，",
        "translation": "Thus, the great man had lived in Śūraṃgama for a long time. Four hundred and fifty years after the nirvana of the Buddha he would go up into the Himalayan Mountains to expound twelve kinds of scriptures to five hundred ho",
        "source": "T14n0463_001:0480c20_2"
    },
    {
        "source_sentence": "教化成熟五百仙人，令得不退轉，與諸神仙作比丘像，飛騰空中至本生地，",
        "translation": "He instructs and develops the five hundred holy ones, enabling them to attain irreversibility. Accompanied by other holy ones he takes the form of a bhikṣu and flees up into the sky to his native land.",
        "source": "T14n0463_001:0480c22_3"
    },
    {
        "source_sentence": "於空野澤尼拘樓陀樹下，結加趺坐，入首楞嚴三昧，三昧力故，身諸毛孔出金色光，",
        "translation": "He sat cross-legged at the foot of a nyagrodha tree in the open fields and entered śūraṃgama samādhi. Because of the power of his absorption, golden light emanated from all his hair pores.",
        "source": "T14n0463_001:0480c24_4"
    },
    {
        "source_sentence": "其光遍照十方世界度有緣者，五百仙人，各皆見火從身毛孔出。",
        "translation": "That light shone everywhere in the worlds of the ten directions to save those with conditions, and each of the five hundred sages saw fire coming out of their hair pores.",
        "source": "T14n0463_001:0480c26_5"
    },
    {
        "source_sentence": "是時，文殊師利身如紫金山，正長丈六，圓光嚴顯，面各一尋，於圓光內有五百化佛，",
        "translation": "At that time, the body of Mañjuśrī was like a mountain of purple gold. It was exactly sixteen feet in height and endowed with circular light. Each hair on its face was one fathom long. Within the circular light were five hundred",
        "source": "T14n0463_001:0480c27_6"
    },
    {
        "source_sentence": "一一化佛有五化菩薩，以為侍者。",
        "translation": "Each transformation buddha has five transformation bodhisattvas who serve as their attendants.",
        "source": "T14n0463_001:0480c29_7"
    },
    {
        "source_sentence": "其文殊冠毘楞伽寶之所嚴飾，有五百種色，一一色中，日月星辰諸天龍宮，",
        "translation": "The crown of Mañjuśrī, adorned with the jewels of Vairocana, had five hundred colors. In each color were the palaces of the sun, moons, stars, and celestial beings:",
        "source": "T14n0463_001:0481a01_8"
    },
    {
        "source_sentence": "世間眾生所希見事，皆於中現。",
        "translation": "All the things that sentient beings in the world want to see are manifested there.",
        "source": "T14n0463_001:0481a03_0"
    },
    {
        "source_sentence": "眉間白毫右旋宛轉，流出化佛入光網中。",
        "translation": "The white hair between his eyebrows curled to the right and flowed out, and the apparitional Buddha entered the net of light.",
        "source": "T14n0463_001:0481a03_1"
    },
    {
        "source_sentence": "舉身光明焰焰相次，一一焰中有五摩尼珠，一一摩尼珠各有異光，異色分明，",
        "translation": "In each flame there were five jewels, each of which had a different light that was distinct in color.",
        "source": "T14n0463_001:0481a04_2"
    },
    {
        "source_sentence": "其眾色中化佛菩薩不可具說。",
        "translation": "The transformation buddhas and bodhisattvas in those forms can't be described in detail.",
        "source": "T14n0463_001:0481a06_3"
    },
    {
        "source_sentence": "左手執鉢，右手擎持大乘經典，現此相已光火皆滅，化琉璃像。",
        "translation": "In his left hand he holds the almsbowl, while in his right hand he holds the Mahayana scriptures. Having manifested these signs, the light and fire all go out, transforming themselves into lapis lazuli images.",
        "source": "T14n0463_001:0481a07_4"
    },
    {
        "source_sentence": "於左臂上有十佛印，一一印中有十佛像，說佛名字了了分明。",
        "translation": "On his left arm, there are the ten buddha seals on his left shoulder, and each seal contains an image of the ten buddhas, saying their names clearly and distinctly.",
        "source": "T14n0463_001:0481a08_5"
    },
    {
        "source_sentence": "於右臂上有七佛印，一一印中有七佛像，七佛名字了了分明。",
        "translation": "On the right arm, there are seven buddha seals on his right shoulder, and each seal contains seven images of the Buddha, whose names are clearly delineated.",
        "source": "T14n0463_001:0481a10_6"
    },
    {
        "source_sentence": "身內心處有真金像，結加趺坐，正長六尺在蓮華上，四方皆現。」",
        "translation": "Within his body and mind, there's a truly golden image sitting cross-legged, exactly six feet long, on top of the lotus flower, appearing in all four directions.",
        "source": "T14n0463_001:0481a11_7"
    },
    {
        "source_sentence": "佛告跋陀波羅：「是文殊師利，有無量神通、無量變現，不可具記，我今略說，",
        "translation": "The Buddha said to Bhadrapāla: This crown prince Mañjuśrī possesses immeasurable supernatural powers and immeasurable manifestations that cannot be described in detail here.",
        "source": "T14n0463_001:0481a12_8"
    },
    {
        "source_sentence": "為未來世盲瞑眾生，若有眾生但聞文殊師利名，除却十二億劫生死之罪；",
        "translation": "If there are any sentient beings who merely hear the name of Mañjuśrī in future ages, they will be freed from the sin of transmigration through birth and death for one billion two hundred million kalpas.",
        "source": "T14n0463_001:0481a14_9"
    },
    {
        "source_sentence": "若禮拜供養者，生生之處恒生諸佛家，為文殊師利威神所護。",
        "translation": "If someone venerates and makes offerings, they'll always be born in the homes of the buddhas where they're born, protected by Mañjuśrī's authoritative power.",
        "source": "T14n0463_001:0481a16_10"
    },
    {
        "source_sentence": "是故眾生，當懃繫念念文殊像，念文殊像法，先念琉璃像，念琉璃像者如上所說，",
        "translation": "Therefore, sentient beings should fix their thoughts on the statue of Mañjuśrī and think of the teaching for the statue of Mañjuśrī. First, they should think of a lapis lazuli image. The person who is mindful of",
        "source": "T14n0463_001:0481a17_11"
    },
    {
        "source_sentence": "一一觀之皆令了了；",
        "translation": "He observed them one by one and made them all understand.",
        "source": "T14n0463_001:0481a19_12"
    },
    {
        "source_sentence": "若未得見，當誦持首楞嚴，稱文殊師利名一日至七日，文殊必來至其人所。",
        "translation": "If someone hasn't seen it, they should recite and preserve the Śūraṃgama-samādhi, which is called Mañjuśrī for one day or seven days, and Mañjuśrī will surely come to that person.",
        "source": "T14n0463_001:0481a20_13"
    },
    {
        "source_sentence": "若復有人宿業障者，夢中得見，夢中見者，於現在身若求聲聞，以見文殊師利故，",
        "translation": "“Furthermore, if there is another person with the obstruction of past actions who sees it in a dream and sees it in a dream, then when seeking śrāvakahood in the present body because he sees Mañjuśrī,",
        "source": "T14n0463_001:0481a21_14"
    },
    {
        "source_sentence": "得須陀洹乃至阿那含；",
        "translation": "They attain the state of stream-enterer (srotaāpanna) and so on up to the anāgāmi-phala.",
        "source": "T14n0463_001:0481a23_15"
    },
    {
        "source_sentence": "若出家人見文殊師利者，已得見故，一日一夜成阿羅漢；",
        "translation": "If a renunciant sees Mañjuśrī, he attains arhatship in one day and night.",
        "source": "T14n0463_001:0481a24_16"
    },
    {
        "source_sentence": "若有深信方等經典，是法王子於禪定中，為說深法；",
        "translation": "If there are those who deeply believe in the well-balanced scriptures, this prince of the Dharma will expound the profound Dharma for them in meditation.",
        "source": "T14n0463_001:0481a25_17"
    },
    {
        "source_sentence": "亂心多者，於其夢中為說實義，令其堅固，於無上道得不退轉。」",
        "translation": "Those whose minds are often disturbed will explain the true meaning in their dreams, make them firm and attain irreversibility on the unsurpassed path.",
        "source": "T14n0463_001:0481a26_18"
    },
    {
        "source_sentence": "佛告跋陀波羅：「此文殊師利法王子，若有人念，若欲供養修福業者，",
        "translation": "The Buddha said to Bhadrapāla, “O Mañjuśrī, prince of the Dharma, if there is anyone who thinks:",
        "source": "T14n0463_001:0481a28_19"
    },
    {
        "source_sentence": "即自化身，作貧窮孤獨苦惱眾生，至行者前。",
        "translation": "That is, he transforms himself into a body that creates poor, isolated, and suffering sentient beings who go to the practitioner's presence.",
        "source": "T14n0463_001:0481a29_20"
    },
    {
        "source_sentence": "若有人念文殊師利者，當行慈心，行慈心者即是得見文殊師利。",
        "translation": "If someone is mindful of Mañjuśrī, they should practice kindness, and if they practice kindness, they'll attain insight into Mañjuśrī.",
        "source": "T14n0463_001:0481b02_0"
    },
    {
        "source_sentence": "是故智者當諦觀文殊師利三十二相、八十種好，作是觀者，首楞嚴力故，",
        "translation": "Therefore, wise people should truly contemplate the thirty-two characteristics and eighty kinds of beauty of Mañjuśrī. Those who do so will observe them because of the power of Śūryamuni’s adornment.",
        "source": "T14n0463_001:0481b03_1"
    },
    {
        "source_sentence": "當得疾疾見文殊師利。",
        "translation": "He'll be sick and ill and see Mañjuśrī.",
        "source": "T14n0463_001:0481b05_2"
    },
    {
        "source_sentence": "作此觀者名為正觀，若他觀者名為邪觀。",
        "translation": "Those who contemplate this are called right contemplation, and those who contemplate others are called wrong contemplations.",
        "source": "T14n0463_001:0481b05_3"
    },
    {
        "source_sentence": "佛滅度後一切眾生，其有得聞文殊師利名者、見形像者，百千劫中不墮惡道；",
        "translation": "All sentient beings who hear the name of Mañjuśrī and see his images after the parinirvāṇa will not fall into evil for a hundred thousand kalpas.",
        "source": "T14n0463_001:0481b06_4"
    },
    {
        "source_sentence": "若有受持讀誦文殊師利名者，設有重障，不墮阿鼻極惡猛火，常生他方清淨國土，",
        "translation": "If there is anyone who receives, retains, recites, and venerates the name of Mañjuśrī, if there are serious obstacles, he won’t fall into the avīci hell or be born elsewhere in another pure land.",
        "source": "T14n0463_001:0481b08_5"
    },
    {
        "source_sentence": "值佛聞法得無生忍。」",
        "translation": "He meets the Buddha and hears the Dharma and attains the tolerance of nonproduction.",
        "source": "T14n0463_001:0481b10_6"
    },
    {
        "source_sentence": "說是語時，五百比丘遠塵離垢成阿羅漢，無量諸天發菩提心，願常隨從文殊師利。",
        "translation": "When he spoke these words, five hundred monks became arhats far removed from the dust and dirt, and measureless gods aroused the mind of enlightenment, vowing to always follow Mañjuśrī.",
        "source": "T14n0463_001:0481b10_7"
    },
    {
        "source_sentence": "爾時跋陀波羅白佛言：「世尊！",
        "translation": "It was then that Bhadrapāla said to the Buddha, Bhagavān!",
        "source": "T14n0463_001:0481b12_8"
    },
    {
        "source_sentence": "是文殊舍利，誰當於上起七寶塔？」",
        "translation": "Who will build a seven-jeweled stūpa on top of this Mañjuśrī?",
        "source": "T14n0463_001:0481b13_9"
    },
    {
        "source_sentence": "佛告跋陀波羅：「香山有八大鬼神，自當擎去置香山中金剛山頂上，無量諸天龍神夜叉常來供養，",
        "translation": "The Buddha told Bhadrapāla, On Mount Gandhamādana there are eight great spirits who will themselves lift it up and place it on the top of Mount Gandhamādana.",
        "source": "T14n0463_001:0481b14_10"
    },
    {
        "source_sentence": "大眾集時像恒放光，其光演說苦空、無常、無我等法。",
        "translation": "When the masses gathered, the image always emitted light, which explained the teachings of suffering, emptiness, impermanence, selflessness, and other dharmas.",
        "source": "T14n0463_001:0481b16_11"
    },
    {
        "source_sentence": "跋陀波羅！",
        "translation": "Bhadrapāla!",
        "source": "T14n0463_001:0481b17_12"
    },
    {
        "source_sentence": "此法王子得不壞身，我今語汝，汝好受持廣為一切諸眾生說。」",
        "translation": "This prince of the Dharma attains an indestructible body, so I'll tell you now; please accept and uphold it and explain it widely for all sentient beings.",
        "source": "T14n0463_001:0481b18_13"
    },
    {
        "source_sentence": "說是語時，跋陀波羅等諸大菩薩，舍利弗等諸大聲聞、天龍八部，聞佛所說皆大歡喜，",
        "translation": "When he had uttered these words, the great bodhisattvas like Bhadrapāla and the great śrāvakas like Śāriputra heard what the Buddha taught with great joy.",
        "source": "T14n0463_001:0481b19_14"
    },
    {
        "source_sentence": "禮佛而去。",
        "translation": "He bowed to the Buddha and departed.",
        "source": "T14n0463_001:0481b21_15"
    },
    {
        "source_sentence": "佛說文殊師利般涅槃經",
        "translation": "Foshuo weishili pin nirvāṇa jing",
        "source": "T14n0463_001:0481b22_0"
    }
]