[
    {
        "source_sentence": "佛為阿支羅迦葉自化作苦經",
        "translation": "Sutra on the Self-transformation of the Buddha as suffering for Acala Kāśyapa",
        "source": "T14n0499_001:0768b19_0"
    },
    {
        "source_sentence": "失譯",
        "translation": "lost translation",
        "source": "T14n0499_001:0768b21_0"
    },
    {
        "source_sentence": "如是我聞：一時，佛住王舍城耆闍崛山。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Mount Gṛdhrakūṭa in Rājagṛha.",
        "source": "T14n0499_001:0768b22_0"
    },
    {
        "source_sentence": "爾時世尊，晨朝著衣持鉢，出耆闍崛山，入王舍城乞食。",
        "translation": "It was then that the Bhagavān, wearing his robe and bowl in the morning, left Mount Gṛdhrakūṭa and entered Rājagṛha to solicit alms.",
        "source": "T14n0499_001:0768b22_1"
    },
    {
        "source_sentence": "時有阿支羅迦葉，為營小事，出王舍城，向耆闍崛山。",
        "translation": "At that time an asura-kāśyapa, engaged in minor duties, came out of Rājagṛha and headed for Mount Gṛdhrakūṭa.",
        "source": "T14n0499_001:0768b24_2"
    },
    {
        "source_sentence": "遙見世尊，見已詣佛所，白佛言：「瞿曇！",
        "translation": "Seeing the Bhagavān from a distance, he went to the Buddha and said to him, Gautama!",
        "source": "T14n0499_001:0768b25_3"
    },
    {
        "source_sentence": "欲有所問，寧有閑暇，見答與不？」",
        "translation": "If you want to ask a question, why don't you have the leisure time to see and answer it?",
        "source": "T14n0499_001:0768b26_4"
    },
    {
        "source_sentence": "佛告迦葉：「今非論時，我今入城乞食，來還則是其時，當為汝說。」",
        "translation": "The Buddha told Kāśyapa, Now is not the time to discuss it; now is the right time for me to enter the city to solicit alms.",
        "source": "T14n0499_001:0768b27_5"
    },
    {
        "source_sentence": "第二亦如是說，第三復問：「瞿曇何為我作留難？",
        "translation": "The second also said in the same way, and the third again asked, Why did Gautama make it difficult for me to stay?",
        "source": "T14n0499_001:0768b28_6"
    },
    {
        "source_sentence": "瞿曇云何有異？",
        "translation": "How is it different from what the Gautama teaches?",
        "source": "T14n0499_001:0768b29_7"
    },
    {
        "source_sentence": "我今欲有所問，為我解說。」",
        "translation": "Now, if I want to ask a question, explain it for me.",
        "source": "T14n0499_001:0768c01_0"
    },
    {
        "source_sentence": "佛告阿支羅迦葉：「隨汝所問。」",
        "translation": "The Buddha told Acala Kāśyapa, Follow what you ask.",
        "source": "T14n0499_001:0768c01_1"
    },
    {
        "source_sentence": "阿支羅迦葉白佛言：「云何瞿曇，苦自作耶？」",
        "translation": "Acala Kāśyapa said to the Buddha, What's the painful self-creation of Gautama?",
        "source": "T14n0499_001:0768c02_2"
    },
    {
        "source_sentence": "佛告迦葉：「苦自作者，此是無記。」",
        "translation": "The Buddha told Kāśyapa, This is indeterminate for the self-causation of suffering.",
        "source": "T14n0499_001:0768c03_3"
    },
    {
        "source_sentence": "迦葉復問：「云何瞿曇，苦他作耶？」",
        "translation": "Kāśyapa again asked, What is the Gautama that's painful to others?",
        "source": "T14n0499_001:0768c04_0"
    },
    {
        "source_sentence": "佛告迦葉：「苦他作者，此亦無記。」",
        "translation": "The Buddha told Kāśyapa, This is also indeterminate for someone who suffers from other authors.",
        "source": "T14n0499_001:0768c04_1"
    },
    {
        "source_sentence": "迦葉復問：「苦自他作耶？」",
        "translation": "Kāśyapa again asked, Is it painful for self and others to do it?",
        "source": "T14n0499_001:0768c05_2"
    },
    {
        "source_sentence": "佛告迦葉：「苦自他作，此亦無記。」",
        "translation": "The Buddha told Kāśyapa, This is also indeterminate because it's painful for self and others to do it.",
        "source": "T14n0499_001:0768c06_3"
    },
    {
        "source_sentence": "迦葉復問：「云何瞿曇，苦非自非他無因作耶？」",
        "translation": "Kāśyapa again asked, How does the Gautama say that suffering is neither self nor other without a cause?",
        "source": "T14n0499_001:0768c06_4"
    },
    {
        "source_sentence": "佛告迦葉：「苦非自非他無因作者，此亦無記。」",
        "translation": "The Buddha told Kāśyapa, Suffering is neither self nor other without a cause or author, and this is also indeterminate.",
        "source": "T14n0499_001:0768c07_5"
    },
    {
        "source_sentence": "迦葉復問：「瞿曇！",
        "translation": "Kāśyapa again asked, Gautama!",
        "source": "T14n0499_001:0768c08_6"
    },
    {
        "source_sentence": "所問苦自作耶？",
        "translation": "What's asked, is it self-created by suffering?",
        "source": "T14n0499_001:0768c09_7"
    },
    {
        "source_sentence": "答言無記。",
        "translation": "The answer is that it's indeterminate.",
        "source": "T14n0499_001:0768c09_8"
    },
    {
        "source_sentence": "他作耶？",
        "translation": "Do they do it for others?",
        "source": "T14n0499_001:0768c09_9"
    },
    {
        "source_sentence": "自他作耶？",
        "translation": "Do they do it for themselves or for others?",
        "source": "T14n0499_001:0768c10_10"
    },
    {
        "source_sentence": "非自非他無因作耶？",
        "translation": "What's not self and what's not done by others without a cause?",
        "source": "T14n0499_001:0768c10_11"
    },
    {
        "source_sentence": "答言無記。",
        "translation": "The answer is that it's indeterminate.",
        "source": "T14n0499_001:0768c10_12"
    },
    {
        "source_sentence": "今無此苦耶？」",
        "translation": "Is there no such suffering now?",
        "source": "T14n0499_001:0768c11_13"
    },
    {
        "source_sentence": "佛告迦葉：「非無此苦，然有此苦。」",
        "translation": "The Buddha told Kāśyapa, It's not that there's no such suffering, but there's such suffering.",
        "source": "T14n0499_001:0768c11_14"
    },
    {
        "source_sentence": "迦葉白佛言：「善哉瞿曇！",
        "translation": "Kāśyapa said to the Buddha, Good, Gautama!",
        "source": "T14n0499_001:0768c12_15"
    },
    {
        "source_sentence": "說有此苦，為我說法，令我知苦見苦。」",
        "translation": "Explaining that there's this kind of suffering, he teaches me the Dharma so that I know and see suffering.",
        "source": "T14n0499_001:0768c12_16"
    },
    {
        "source_sentence": "佛告迦葉：「若受即自受者，我應說苦自作；",
        "translation": "The Buddha said to Kasyapa: If sensation is self-accompanied, then I should explain that suffering is self-caused.",
        "source": "T14n0499_001:0768c13_17"
    },
    {
        "source_sentence": "若他受他即受者，是則他作；",
        "translation": "If someone else receives and something else exactly receives, it is what someone else does.",
        "source": "T14n0499_001:0768c14_18"
    },
    {
        "source_sentence": "若受自受受他受復與苦者，如是者自他作，我亦不說；",
        "translation": "If one experiences self-accompaniment, experiences what is felt by someone else and further experiences what is unsatisfactoriness?*”: such [things] are made by oneself or by someone else. Neither do I say this.",
        "source": "T14n0499_001:0768c15_19"
    },
    {
        "source_sentence": "若不因自他無因而生苦者，我亦不說。",
        "translation": "If suffering doesn't arise because of self and others without cause, I won't explain it either.",
        "source": "T14n0499_001:0768c16_20"
    },
    {
        "source_sentence": "離此諸邊，說其中道。",
        "translation": "Being free of these extremes, he teaches the path within.",
        "source": "T14n0499_001:0768c17_21"
    },
    {
        "source_sentence": "如來說法，此有故彼有，此起故彼起，謂緣無明行乃至純大苦聚集；",
        "translation": "The Tathāgata teaches the doctrine that it is because of this existence that they are present, and because of the arising of these beings that they arise. That is to say, by reason of the conditioned forces of ignorance up to the pure mass of great suffering.",
        "source": "T14n0499_001:0768c17_22"
    },
    {
        "source_sentence": "無明滅則行滅，乃至純大苦聚滅。」",
        "translation": "When nescience ceases, conditioned phenomena cease, and so forth, up to the pure extinction of the great mass of suffering.",
        "source": "T14n0499_001:0768c19_23"
    },
    {
        "source_sentence": "佛說此經已，阿支羅迦葉遠塵離垢，得法眼淨。",
        "translation": "After the Buddha taught this sūtra, Acala Kāśyapa was far removed from dust and dirt and attained purity of the Dharma eye.",
        "source": "T14n0499_001:0768c20_24"
    },
    {
        "source_sentence": "時阿支羅迦葉，見法得法，知法入法，度諸狐疑，不由他知，不因他度，",
        "translation": "At that time the asura-kāśyapa saw the Dharma and attained the Dharma. Knowing the Dharma and entering the Dharma, he overcame the doubts of the wicked. He was not known by anyone else and liberated himself through [the power of] others.",
        "source": "T14n0499_001:0768c21_25"
    },
    {
        "source_sentence": "於正法律，心得無畏，合掌白佛言：「世尊！",
        "translation": "Having attained fearlessness in regard to the right teaching, he joined his palms and said to the Buddha, Bhagavān!",
        "source": "T14n0499_001:0768c22_26"
    },
    {
        "source_sentence": "我今已度，我從今日，歸依佛、歸依法、歸依僧，盡形壽作優婆塞，證知我。」",
        "translation": "Now that I've been liberated, from today onward, I take refuge in the Buddha, Dharma, and saṃgha, and spend my whole life as a layman who knows me.",
        "source": "T14n0499_001:0768c23_27"
    },
    {
        "source_sentence": "阿支羅迦葉聞佛所說，歡喜隨喜，作禮而去。",
        "translation": "Having heard the Buddha’s exhortation, Acirakaśyapa was delighted and rejoiced. Hearing it, he bowed to the Buddha and departed.",
        "source": "T14n0499_001:0768c25_28"
    },
    {
        "source_sentence": "時阿支羅迦葉辭世尊去，不久為護犢牸牛所觸殺，於命終時，諸根清淨，",
        "translation": "At that time the asura Kassapa departed from the World-honored One. Soon afterward he was slaughtered by Vātsīputrīya and his faculties became purified at the end of his life.",
        "source": "T14n0499_001:0768c26_29"
    },
    {
        "source_sentence": "顏色鮮白。",
        "translation": "His color was pure white.",
        "source": "T14n0499_001:0768c28_30"
    },
    {
        "source_sentence": "爾時世尊，入城乞食。",
        "translation": "It was then that the Bhagavān entered the city to solicit alms.",
        "source": "T14n0499_001:0768c28_31"
    },
    {
        "source_sentence": "時有眾多比丘，亦入王舍城乞食，聞有傳說，阿支羅迦葉從世尊聞法，",
        "translation": "At that time a large group of monks also entered the city of Rājagṛha to solicit alms. They heard some sayings, “Asura Kassapa heard the Dharma from the World-honored One.",
        "source": "T14n0499_001:0768c29_32"
    },
    {
        "source_sentence": "辭去不久，為牛所觸殺，於命終時，諸根清淨，顏色鮮白。",
        "translation": "Soon after his departure, he was touched by an ox and killed. At the time of his death his faculties were pure and white in color.",
        "source": "T14n0499_001:0769a01_33"
    },
    {
        "source_sentence": "諸比丘乞食已還出，舉衣鉢洗足，詣世尊所，稽首禮足，退座一面，白佛言：「世尊！",
        "translation": "Having begged for food, the bhikṣus withdrew. They put away their robes and bowls, washed their feet, and approached the World-honored One. After paying respect by bowing at his feet, they withdrew to one side from their seats and said to the Buddha:",
        "source": "T14n0499_001:0769a03_34"
    },
    {
        "source_sentence": "我今晨朝，眾多比丘，入城乞食，聞阿支羅迦葉從世尊聞法律，辭去不久，",
        "translation": "“Early this morning, when the assembly of monks had entered the city to solicit almsfood, I heard that Acala Kassapa had heard the Dharma from the World-honored One and was about to depart.",
        "source": "T14n0499_001:0769a04_35"
    },
    {
        "source_sentence": "為護犢牛所觸殺，於命終時，諸根清淨，顏色鮮白。",
        "translation": "In order to protect them from being touched and killed by a cow, his faculties are pure and his color is pure white when he dies.",
        "source": "T14n0499_001:0769a06_36"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T14n0499_001:0769a07_37"
    },
    {
        "source_sentence": "彼生何趣？",
        "translation": "To what destinies will they be born?",
        "source": "T14n0499_001:0769a07_38"
    },
    {
        "source_sentence": "何處受生？",
        "translation": "Where will they be born?",
        "source": "T14n0499_001:0769a08_39"
    },
    {
        "source_sentence": "彼何所得？」",
        "translation": "What did they attain?",
        "source": "T14n0499_001:0769a08_40"
    },
    {
        "source_sentence": "佛告諸比丘：「彼已見法知法，次法不受於法，已般涅槃，汝等當往供養其身。」",
        "translation": "The Buddha told the monks, They've seen the Dharma and known the Dharma, followed the Dharma and didn't accept the Dharma, and they've entered parinirvāṇa; you must go there to make offerings to their bodies.",
        "source": "T14n0499_001:0769a08_41"
    },
    {
        "source_sentence": "爾時，世尊為阿支羅迦葉受第一記。",
        "translation": "At the time, the Bhagavān accepted the first prediction for Acala Kāśyapa.",
        "source": "T14n0499_001:0769a10_42"
    },
    {
        "source_sentence": "佛說為阿支羅迦葉自化作苦經一卷",
        "translation": "Sutra on the Self-transformation of Acala Kāśyapa into suffering by the Buddha, one volume",
        "source": "T14n0499_001:0769a12_0"
    }
]