[
    {
        "source_sentence": "佛說摩達國王經",
        "translation": "Sutra on the King of Mathu",
        "source": "T14n0519_001:0792c03_0"
    },
    {
        "source_sentence": "宋居士沮渠京聲譯",
        "translation": "Song Dynasty Translation by Juqu Jingsheng, a layman of the Song dynasty",
        "source": "T14n0519_001:0792c05_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在羅閱祇竹園中，與千二百五十比丘俱。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Rājagṛha’s Bamboo Grove accompanied by one thousand two hundred and fifty bhikṣus.",
        "source": "T14n0519_001:0792c06_0"
    },
    {
        "source_sentence": "時有國王，號名摩達王，時當出軍征討，選國中人民，數百萬人，皆應赴從。",
        "translation": "At the time, there was a king named King Mādatta, who was about to leave his army and attack it, selecting millions of people in his country to follow him.",
        "source": "T14n0519_001:0792c07_1"
    },
    {
        "source_sentence": "時有比丘，已得羅漢道，到其國分衛，並見錄，將詣王宮門。",
        "translation": "At that time a certain monk had already attained the path of the arhat. Having arrived in that country, he was divided into two divisions to guard it. Seeing this record, they all went to the entrance of the royal palace gate.",
        "source": "T14n0519_001:0792c09_2"
    },
    {
        "source_sentence": "王有馬監，令比丘養視官馬，勤苦七日。",
        "translation": "The king had a horse superintendent, who ordered the monks to keep watch over the official horses and endured seven days of hardship.",
        "source": "T14n0519_001:0792c10_3"
    },
    {
        "source_sentence": "王後身自臨視軍陣，比丘見王，即於其前，輕舉飛翔，上住空中，現其威神。",
        "translation": "Seeing the king, the bhikṣu flew up in front of him. The king was standing in midair and manifested his supernatural powers.",
        "source": "T14n0519_001:0792c11_4"
    },
    {
        "source_sentence": "王便恐怖，叩頭悔過：「我實愚癡，不別真偽，推問國內，誰令神人為是者，",
        "translation": "Fearful, the king bowed his head in shame and repented. “I am really ignorant and do not distinguish right from wrong.",
        "source": "T14n0519_001:0792c13_5"
    },
    {
        "source_sentence": "今當有所治殺。」",
        "translation": "Now, there will be something to treat killing.",
        "source": "T14n0519_001:0792c14_6"
    },
    {
        "source_sentence": "比丘告王言：「非王及國人過也，自我宿命，行道常供養師，我時為師設飯，",
        "translation": "The bhikṣu said to the king, “It is not the fault of the king or his countrymen. They may have done so by themselves in former existences and they always practiced Buddhism in order to support their teacher. At that time I prepared a meal for him.",
        "source": "T14n0519_001:0792c15_7"
    },
    {
        "source_sentence": "師謂我言：『且先澡手已乃當飯。』",
        "translation": "The teacher told me, 'First, wash your hands and then you'll eat.'",
        "source": "T14n0519_001:0792c16_8"
    },
    {
        "source_sentence": "我愚癡，心念言：『師亦不養官馬，何故不預澡手？』",
        "translation": "Foolishly, I thought to myself, 'The teacher doesn't raise official horses, so why doesn't he wash his hands?'",
        "source": "T14n0519_001:0792c17_9"
    },
    {
        "source_sentence": "師即謂我言：『汝今念此輕耳，後重如何？』",
        "translation": "The teacher then said to me, 'Now, what's the weight of this lightness in your mind?'",
        "source": "T14n0519_001:0792c18_10"
    },
    {
        "source_sentence": "我聞是語，便愁憂。",
        "translation": "When I heard these words, I became sad and grieved.",
        "source": "T14n0519_001:0792c19_11"
    },
    {
        "source_sentence": "師知其意，便念言：『我會當泥洹，何故令人惱耶？』",
        "translation": "Knowing what he meant, the teacher thought, 'I'll go into nirvāṇa, so why would I disturb him?'",
        "source": "T14n0519_001:0792c20_0"
    },
    {
        "source_sentence": "即以其夜三更時般泥洹。",
        "translation": "He then entered parinirvāṇa at three o'clock that night.",
        "source": "T14n0519_001:0792c21_1"
    },
    {
        "source_sentence": "從來久遠，各更生死，今用是故，受其宿殃，養馬七日。",
        "translation": "For a long time each of them had been reborn again and again, but now it is for this reason that they suffered the misfortune of being born in the past and raised their horses for seven days.",
        "source": "T14n0519_001:0792c21_2"
    },
    {
        "source_sentence": "夫善惡行，輒有殃福，如影隨形。」",
        "translation": "Good and bad actions are easily accompanied by misfortune and fortune, like shadows following form.",
        "source": "T14n0519_001:0792c22_3"
    },
    {
        "source_sentence": "王聞比丘說罪福，意解歡喜，乞得歸命於神人。",
        "translation": "Having heard the bhikṣu exhort on sins and meritorious deeds, the king was overjoyed at heart and begged permission to return to live with the gods.",
        "source": "T14n0519_001:0792c23_4"
    },
    {
        "source_sentence": "比丘告言：「卿當自歸於佛，佛為三界師。」",
        "translation": "The monks told him, You should return to the Buddha for yourself, and the Buddha is the teacher of the three realms.",
        "source": "T14n0519_001:0792c24_5"
    },
    {
        "source_sentence": "王及國人民，皆隨比丘到佛所，稽首為佛作禮，受五戒作優婆塞。",
        "translation": "The king and the people of his country all followed the monks to the Buddha, bowed their heads in homage to him, received the five precepts, and became laymen.",
        "source": "T14n0519_001:0792c25_6"
    },
    {
        "source_sentence": "佛便為王及人民，現相好威神，光曜天地，復為說無常苦空。",
        "translation": "The Buddha then manifested his beautiful features and mighty powers to illuminate heaven and earth for the king and his people, and he also explained the emptiness of impermanence and suffering for them.",
        "source": "T14n0519_001:0792c27_7"
    },
    {
        "source_sentence": "王於是便得須陀洹道，國中人民，皆受五戒十善，歸命三尊，月日齋戒，",
        "translation": "The king then attained the path of stream entry, and all the people of his country received the five precepts and ten wholesome practices. They revered the names of the Three Revered Ones and observed them on a daily basis for one month.",
        "source": "T14n0519_001:0792c28_8"
    },
    {
        "source_sentence": "以為常法。",
        "translation": "They think it's an eternal dharma.",
        "source": "T14n0519_001:0793a01_9"
    },
    {
        "source_sentence": "阿難整衣服，作禮白佛言：「是王及國中人民，見佛聞經即解。",
        "translation": "Ānanda adjusted his clothes, paid homage, and said to the Buddha, That king and the people of his country saw the Buddha and heard the sūtras and understood them.",
        "source": "T14n0519_001:0793a01_10"
    },
    {
        "source_sentence": "何以故？」",
        "translation": "Why is it so?",
        "source": "T14n0519_001:0793a02_11"
    },
    {
        "source_sentence": "佛言：「及昔摩父佛時，是比丘作沙門，王時為優婆塞，淨意供養三日，",
        "translation": "The Buddha said, “Formerly this bhikṣu became a śramaṇa at the time of Māfu Buddha. At that time the king was a layman and offered pure offerings to him for three days.",
        "source": "T14n0519_001:0793a03_12"
    },
    {
        "source_sentence": "令我所在處常得其福，今已得度世之道，今來會此，聞經便得須陀洹道。」",
        "translation": "That will cause me to always attain their merit wherever I am, and now that I've attained the path of worldly salvation, I'll come here to hear the sūtras and then attain the stream entry path.",
        "source": "T14n0519_001:0793a04_13"
    },
    {
        "source_sentence": "四輩弟子、天龍鬼神，聞經歡喜，前為佛作禮而去。",
        "translation": "The four groups of disciples, gods, dragons, and ghosts rejoiced when they heard the sūtras. They bowed to the Buddha and departed.",
        "source": "T14n0519_001:0793a06_14"
    },
    {
        "source_sentence": "佛說摩達國王經",
        "translation": "Sutra on the King of Mathu",
        "source": "T14n0519_001:0793a08_0"
    }
]