[
    {
        "source_sentence": "佛說越難經",
        "translation": "Foshuo yueshan jing",
        "source": "T14n0537_001:0820b11_0"
    },
    {
        "source_sentence": "西晉居士聶承遠譯",
        "translation": "Translated by the courtier of the Western Jin, Nie Chengyuan",
        "source": "T14n0537_001:0820b13_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在波羅奈私國，賢者飛鳥聚。",
        "translation": "Thus I have heard: One time, while the Buddha was staying in the private country of Vārāṇasī, the good man flew a group of birds.",
        "source": "T14n0537_001:0820b14_0"
    },
    {
        "source_sentence": "彼時，國中有四姓長者，名曰越難，大豪富珍奇珠寶、牛馬、田宅甚眾多。",
        "translation": "At the time, there were four wealthy householders in the country named Yueyan, who were greatly wealthy and possessed rare jewels, cattle, horses, and a large amount of land and property.",
        "source": "T14n0537_001:0820b15_1"
    },
    {
        "source_sentence": "難為人慳貪嫉妬，不信道德、不喜布施。",
        "translation": "It's difficult for people who are stingy, greedy, jealous, and unfaithful to morality and generosity.",
        "source": "T14n0537_001:0820b16_2"
    },
    {
        "source_sentence": "日未沒，常勅門監，有來乞匃者，勿得通也。",
        "translation": "Before the sun had gone down, he always instructed the superintendent of the gates not to allow those who came to beg for food to pass through.",
        "source": "T14n0537_001:0820b17_3"
    },
    {
        "source_sentence": "難有一子，名曰栴檀，亦復慳貪。",
        "translation": "It was difficult to find a son named Sandalwood, who was also stingy and greedy.",
        "source": "T14n0537_001:0820b19_0"
    },
    {
        "source_sentence": "難後壽盡，還生其國中，為盲乞婦作子。",
        "translation": "After his life came to an end, he returned to his native land and became a child for the blind beggar's wife.",
        "source": "T14n0537_001:0820b19_1"
    },
    {
        "source_sentence": "其夫言：「汝身有重病，今復懷軀，我貧窮無以衣食，汝便自去。」",
        "translation": "The husband said, You're seriously ill, and now you're carrying your body; I'm poor and don't have money for clothing or food, so go away by yourself.",
        "source": "T14n0537_001:0820b20_2"
    },
    {
        "source_sentence": "婦受教出門外，未遠得大聚糞，便止其中。",
        "translation": "The woman was instructed to leave the house and went out. Not far away she obtained a large heap of excrement, so she stayed there.",
        "source": "T14n0537_001:0820b22_3"
    },
    {
        "source_sentence": "至九月生一子，兩目復盲，其母行乞食養之。",
        "translation": "In the ninth month he gave birth to a child whose eyes were blind in both eyes, and his mother begged for food to nourish him.",
        "source": "T14n0537_001:0820b23_4"
    },
    {
        "source_sentence": "至年七歲，其母言：「我養汝大久，且自行拄杖，取食器行乞，當自悲言：『世間貧者最為苦惱，",
        "translation": "When he was seven years old, his mother said to him, “I have been raising you for a long time.",
        "source": "T14n0537_001:0820b24_5"
    },
    {
        "source_sentence": "今我薄命生貧家，兩目復盲無所見，復為人所輕易，今有乞我少所飲食，",
        "translation": "Now that I am born in a poor family with little life, my eyes are blinded by the sight of both eyes and do not see anything.",
        "source": "T14n0537_001:0820b26_6"
    },
    {
        "source_sentence": "愈我飢者，譬如天雨，渴者得飲。』」",
        "translation": "The more hungry I become, it's like a rain from the gods who are thirsty and get to drink.'",
        "source": "T14n0537_001:0820b28_7"
    },
    {
        "source_sentence": "兒聞母說如是，便行家家乞匃，復到栴檀家。",
        "translation": "When the boy heard his mother say this, he went home to beg for alms and went back to the sandalwood house.",
        "source": "T14n0537_001:0820b28_8"
    },
    {
        "source_sentence": "其子適到，時守門者適小出，盲兒徑入前到中庭，如母教說之。",
        "translation": "When his son arrived, the gatekeeper approached him and came out at dawn. The crippled child went in front of him to the courtyard as his mother had told him.",
        "source": "T14n0537_001:0820b29_9"
    },
    {
        "source_sentence": "時，栴檀在高觀上聞其語，大怒呼守門者問之：「誰內此盲乞兒者？」",
        "translation": "When the sandalwood monk heard his words in the high observation hall, he became furious and called out to the gatekeeper and asked him, Who's inside this blind beggar?",
        "source": "T14n0537_001:0820c02_10"
    },
    {
        "source_sentence": "門監大恐怖，即牽盲兒撲於門外，傷其頭面，復折右臂，壞其食器飯散其地，",
        "translation": "The superintendent of the gate was greatly frightened. He pulled the crippled boy outside the gate and threw him to the ground, injuring his head and face, then broke his right shoulder, disfiguring the food container and dispersing it on the ground.",
        "source": "T14n0537_001:0820c03_11"
    },
    {
        "source_sentence": "身體大痛。",
        "translation": "Their bodies are greatly painful.",
        "source": "T14n0537_001:0820c05_12"
    },
    {
        "source_sentence": "兒呼悲啼，其母聞之，即走到兒所言：「何等弊人嬈我子者？",
        "translation": "The boy cried out in distress, and when his mother heard it, she went to him and said, What's the bad man who disturbed my child?",
        "source": "T14n0537_001:0820c06_0"
    },
    {
        "source_sentence": "我子尚小，兩目復盲，有何等過，乃取如是，何壹感天？」",
        "translation": "My son is still small and blind in both eyes, so what's wrong with taking it like this? How could he touch the gods?",
        "source": "T14n0537_001:0820c07_1"
    },
    {
        "source_sentence": "兒對母言：「我到此門中乞，有高聲人，呼多力人，牽撲傷我，身體大痛如是，",
        "translation": "The boy said to his mother, “I am coming at this door to beg for alms. A man with a loud voice cries out and calls out to the strong man, pulling and beating me. My body is as painful as this.",
        "source": "T14n0537_001:0820c08_2"
    },
    {
        "source_sentence": "今且死不久。」",
        "translation": "Now, it won't be long before death.",
        "source": "T14n0537_001:0820c10_3"
    },
    {
        "source_sentence": "時門上有守神，便謂之言：「汝得是痛，尚為小耳，其大在後。",
        "translation": "There was a guardian deity at the gate who said to him, “Your pain is so great that it will be as small as an ear and its size will be as large behind you.",
        "source": "T14n0537_001:0820c10_4"
    },
    {
        "source_sentence": "汝坐前世有財不布施，故得勤苦。",
        "translation": "You sat in a previous life with wealth and didn't give alms, so you were subject to hardship.",
        "source": "T14n0537_001:0820c12_5"
    },
    {
        "source_sentence": "世間富貴無有常，富貴而不布施，如無有財等也，死更苦痛。",
        "translation": "The world's wealth and prosperity are impermanent, and their wealth and prosperity don't give generosity, like the absence of possessions and so forth, and death is further painful and painful.",
        "source": "T14n0537_001:0820c13_0"
    },
    {
        "source_sentence": "乃愁悔，當復何益？」",
        "translation": "What's the use of being sad and remorseful?",
        "source": "T14n0537_001:0820c14_1"
    },
    {
        "source_sentence": "時觀者甚眾多，各各自語，其聲遠聞。",
        "translation": "At the time, there were so many observers who each spoke their own words, whose voices were heard far and wide.",
        "source": "T14n0537_001:0820c14_2"
    },
    {
        "source_sentence": "佛時從念道覺，與諸比丘俱入城分衛。",
        "translation": "When the Buddha awakened from mindfulness of the path, he entered the city with the monks to guard it.",
        "source": "T14n0537_001:0820c16_0"
    },
    {
        "source_sentence": "佛問阿難：「是何等聲？",
        "translation": "The Buddha asked Ānanda, What's that sound?",
        "source": "T14n0537_001:0820c16_1"
    },
    {
        "source_sentence": "怱怱乃如是。」",
        "translation": "It's just like this.",
        "source": "T14n0537_001:0820c17_2"
    },
    {
        "source_sentence": "阿難便白佛，說盲子母本事已，便叉手白佛：「願哀矜到此兒所。」",
        "translation": "Ānanda then said to the Buddha, After explaining the past lives of the blind boy's mother, he saluted him with his palms together and said to him, May I take pity on this child?",
        "source": "T14n0537_001:0820c17_3"
    },
    {
        "source_sentence": "佛默然不應。",
        "translation": "The Buddha remained silent and didn't respond.",
        "source": "T14n0537_001:0820c19_4"
    },
    {
        "source_sentence": "分衛還飯已，便往視之。",
        "translation": "After he returned to his meal, the guards went to see him.",
        "source": "T14n0537_001:0820c19_5"
    },
    {
        "source_sentence": "見盲兒創痛，以手摩其頭，目便即開，折傷處即愈，因自識宿命。",
        "translation": "When he saw that the blind boy was suffering from pain, he touched his head with his hand and then opened his eyes. The broken wound healed immediately because he knew for himself the events of his past life.",
        "source": "T14n0537_001:0820c20_6"
    },
    {
        "source_sentence": "佛問：「汝是前世長者字難不？」",
        "translation": "The Buddha asked, Is this the name of the elder in a previous life that's difficult?",
        "source": "T14n0537_001:0821a01_7"
    },
    {
        "source_sentence": "對言：「是也。」",
        "translation": "He replied, Yes.",
        "source": "T14n0537_001:0821a02_8"
    },
    {
        "source_sentence": "佛告阿難：「人居世間甚懃苦愚癡，一世父子不相識知。」",
        "translation": "The Buddha told Ānanda, People live in the world with great anguish and suffering and folly, and in one life, fathers and sons don't know each other.",
        "source": "T14n0537_001:0821a03_0"
    },
    {
        "source_sentence": "　　「人求子索財，　　於此二事中，",
        "translation": "A man seeking his children’s wealth asks for their property. In these two things,",
        "source": "T14n0537_001:0821a05_0"
    },
    {
        "source_sentence": "　甚憂勤苦痛，　　他人而得果。",
        "translation": "They are greatly distressed, diligent, painful, and suffering, And others attain their fruit.",
        "source": "T14n0537_001:0821a05_0"
    },
    {
        "source_sentence": "　有身不能保，　　何況子與財？",
        "translation": "There's a body that can't be preserved, so why wouldn't the children and possessions?",
        "source": "T14n0537_001:0821a05_0"
    },
    {
        "source_sentence": "　譬如夏月暑，　　息止樹下涼，",
        "translation": "It's like the summer months when it's hot, calming and cooling under a tree.",
        "source": "T14n0537_001:0821a05_0"
    },
    {
        "source_sentence": "　須臾當復去，　　世間無有常。」",
        "translation": "In a moment, he'll depart again, for the world is impermanent.",
        "source": "T14n0537_001:0821a05_0"
    },
    {
        "source_sentence": "爾時佛說經，解散其意：阿難白佛：「此兒命盡，當趣何道？」",
        "translation": "It was then that the Buddha spoke the sūtra and dispersed his thoughts: Ānanda said to the Buddha, Where will this boy go when his life ends?",
        "source": "T14n0537_001:0821a05_0"
    },
    {
        "source_sentence": "佛言：「當入大泥梨中一宿。」",
        "translation": "The Buddha said, You'll enter the great nirvāṇa for one night.",
        "source": "T14n0537_001:0821a11_1"
    },
    {
        "source_sentence": "佛說是經時，八萬餘人皆棄三垢得法眼。",
        "translation": "When the Buddha taught this sutra, more than 80,000 people abandoned the three defilements and attained the Dharma eye.",
        "source": "T14n0537_001:0821a12_2"
    },
    {
        "source_sentence": "諸弟子皆歡喜，為佛作禮而去。",
        "translation": "The disciples all rejoiced, bowed to the Buddha, and departed.",
        "source": "T14n0537_001:0821a13_3"
    },
    {
        "source_sentence": "佛說越難經",
        "translation": "Foshuo yueshan jing",
        "source": "T14n0537_001:0821a14_0"
    }
]