[
    {
        "source_sentence": "佛說八吉祥神呪經",
        "translation": "Sutra on the Eight Auspicious God Dhāraṇī",
        "source": "T14n0427_001:0072b03_0"
    },
    {
        "source_sentence": "吳月氏優婆塞支謙譯",
        "translation": "Wu Yuezhi Upāsaka, translated by Zhi Qian",
        "source": "T14n0427_001:0072b05_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在羅閱祇耆闍崛山中，與千二百五十比丘俱，菩薩千人皆彌勒等。",
        "translation": "Thus I have heard: One time, when the Buddha was staying at Rājagṛdhrakūṭa in the mountains, accompanied by one thousand two hundred and fifty bhikṣus, a thousand bodhisattvas, all Mai",
        "source": "T14n0427_001:0072b06_0"
    },
    {
        "source_sentence": "佛告賢者舍利弗及諸比丘：「皆一心聽！」",
        "translation": "The Buddha told the good man Śāriputra and the monks, Listen with one mind!",
        "source": "T14n0427_001:0072b07_1"
    },
    {
        "source_sentence": "佛告賢者舍利弗：「東方去是一恒沙，有佛名安隱囑累滿具足王如來、至真、無所著、最正覺，",
        "translation": "The Buddha said to the venerable Śāriputra: To the east, on the eastern shore of the Ganges River, there is a buddha named peacefully instructed King Pūrṇasamud galyayana, Tathāgata, Arhat,",
        "source": "T14n0427_001:0072b08_2"
    },
    {
        "source_sentence": "今現在說法，其世界名曰滿所願聚。",
        "translation": "Now, when he teaches the Dharma, that world is called the fulfillment of the wish-granting cluster.",
        "source": "T14n0427_001:0072b10_3"
    },
    {
        "source_sentence": "「去是二恒沙，有佛名紺琉璃具足王如來、無所著、最正覺，今現在說法，",
        "translation": "Vimalakīrti: There is a buddha named Paramarthasamudgata, the Tathāgata whose name is Aparinirmita-vaśavartin; he is free of attachment and fully awakened. He teaches the Dharma in this way",
        "source": "T14n0427_001:0072b11_4"
    },
    {
        "source_sentence": "其世界名曰慈哀光明。",
        "translation": "The world is called the light of compassion.",
        "source": "T14n0427_001:0072b13_5"
    },
    {
        "source_sentence": "「去是三恒沙，有佛名勸助眾善具足王如來、無所著、最正覺，今現在說法，",
        "translation": "“In the past there was a buddha named Mahāprajñāpāramitā-paripṛcchā(sūtra) called Mahāprajāpaṅkara Tathāgata, free from attachment and fully awakened. He now teaches the",
        "source": "T14n0427_001:0072b13_6"
    },
    {
        "source_sentence": "其世界名曰歡喜快樂。",
        "translation": "The world is called Joy and happiness.",
        "source": "T14n0427_001:0072b15_7"
    },
    {
        "source_sentence": "「去是四恒沙，有佛名曰無憂德具足王如來、無所著、最正覺，今現在說法，",
        "translation": "“There is a buddha named King Aśoka, the Tathāgata whose qualities are perfect. He has no attachment and is supremely enlightened. He teaches the Dharma in this way:",
        "source": "T14n0427_001:0072b16_0"
    },
    {
        "source_sentence": "其世界名曰一切樂入。",
        "translation": "The world is called All Pleasant Entry.",
        "source": "T14n0427_001:0072b17_1"
    },
    {
        "source_sentence": "「去是五恒沙，有佛名藥師具足王如來、無所著、最正覺，今現在說法，",
        "translation": "\\",
        "source": "T14n0427_001:0072b18_2"
    },
    {
        "source_sentence": "其世界名曰滿一切珍寶法。",
        "translation": "The world is called the Dharma that fulfills all treasures.",
        "source": "T14n0427_001:0072b19_3"
    },
    {
        "source_sentence": "「去是六恒沙，有佛名曰蓮華具足王如來、無所著、最正覺，今現在說法，",
        "translation": "“In the past there was a buddha named Padmavyūha-paripṛcchā(sūtra) Tathāgata, who was free from attachment and fully awakened. He now teaches the Dharma like this:",
        "source": "T14n0427_001:0072b20_4"
    },
    {
        "source_sentence": "其世界名曰滿香名聞。",
        "translation": "The world is called the full fragrance of fame and reputation.",
        "source": "T14n0427_001:0072b22_0"
    },
    {
        "source_sentence": "「去是七恒沙，有佛名算擇合會具足王如來、無所著、最正覺，今現在說法，",
        "translation": "“In the past there was a buddha named Mahāprajāpathāma-paripṛcchā(sūtra), the Tathāgata, free from attachment and fully awakened. He now teaches the Dharma like this:",
        "source": "T14n0427_001:0072b22_1"
    },
    {
        "source_sentence": "其世界名曰一切解說音聲遠聞。",
        "translation": "The world is called All Understanding and Explaining Sounds, which are heard far and wide.",
        "source": "T14n0427_001:0072b24_2"
    },
    {
        "source_sentence": "「去是八恒沙，有佛名解散一切縛具足王如來、無所著、最正覺，今現在說法，",
        "translation": "\\",
        "source": "T14n0427_001:0072b24_3"
    },
    {
        "source_sentence": "其世界名曰一切解脫。」",
        "translation": "That world is called all liberations.",
        "source": "T14n0427_001:0072b26_4"
    },
    {
        "source_sentence": "佛告賢者舍利弗：「此諸佛如來、無所著、過四道不受、最正覺，其國土清淨，",
        "translation": "The Buddha said to the venerable Śāriputra: These buddha-tathāgatas are free from attachment, transcend the four realms of rebirth, and are supremely enlightened.",
        "source": "T14n0427_001:0072b28_0"
    },
    {
        "source_sentence": "無五濁、無愛欲、無意垢。",
        "translation": "There are no five defilements, no craving and desire, and no mental stains.",
        "source": "T14n0427_001:0072b29_1"
    },
    {
        "source_sentence": "若有善男子、善女人，聞此八佛及國土名，受持奉行諷誦，廣為他人解說其義者，",
        "translation": "“Furthermore, if there are sons and daughters of a virtuous family who hear the names of these eight buddhas and their lands, uphold them, practice them, and recite them, and explain their meanings to others in detail,",
        "source": "T14n0427_001:0072c01_2"
    },
    {
        "source_sentence": "終不愚癡，口之所言，無有失誤，相好具足，無所缺減，無央數年不為乏少。",
        "translation": "They are never stupid, and whatever they say in words is without error or omission. Their features are endowed with all the marks and embellishments; there is nothing missing from them. For countless years they do not become lazy.",
        "source": "T14n0427_001:0072c03_0"
    },
    {
        "source_sentence": "「是人終不墮太山地獄、餓鬼、畜生中也，是人終不望取羅漢、辟支佛道而般泥洹，",
        "translation": "“That person will never fall into the hell of Mount Tai, into the realms of hungry ghosts or animals. That person will never hope to attain parinirvāṇa by following the path of the arhats and pratyekabuddhas.",
        "source": "T14n0427_001:0072c04_1"
    },
    {
        "source_sentence": "必當逮得無上平等之道，常遇陀隣尼，常行菩薩道，得功德無量。",
        "translation": "They'll surely attain the unsurpassed path of equality, always meet a dhāraṇī, always practice the bodhisattva path, and attain measureless merit.",
        "source": "T14n0427_001:0072c06_2"
    },
    {
        "source_sentence": "「第一四天王常擁護之，不為縣官所拘錄，不為盜賊所中傷，不為天龍、鬼神所觸嬈，",
        "translation": "The first and the fourth heavenly kings always protect them, not being harmed by thieves or robbers, without being attacked by gods, dragons, or spirits.",
        "source": "T14n0427_001:0072c08_0"
    },
    {
        "source_sentence": "閱叉鬼神、蠱道鬼神、若人、若非人，皆不能害殺得其便也，除其宿命不請。",
        "translation": "The yakṣa spirits, the demons of the path of delusion, humans and nonhumans can't harm or kill them to get an advantage over them, except for those who aren't invited by their past lives.",
        "source": "T14n0427_001:0072c09_1"
    },
    {
        "source_sentence": "「若有疾病、水火、烏鳴、惡夢、諸魔所嬈，恐怖衣毛竪時，常當讀是八吉祥神呪經呪之，",
        "translation": "“If there is sickness, water, fire, crows, nightmares, bad dreams, or demons disturbing you, and if your hair stands on end in fear, you should always recite these eight auspicious dhāraṇī spells to",
        "source": "T14n0427_001:0072c11_2"
    },
    {
        "source_sentence": "即得除愈。」",
        "translation": "He'll then be healed.",
        "source": "T14n0427_001:0072c13_3"
    },
    {
        "source_sentence": "「若有持是經，　　八佛國土名，",
        "translation": "If there is anyone who preserves this sutra, The names of the eight buddha-lands will be revealed.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　不墮三惡處，　　疾得無上道。",
        "translation": "They won't fall into the three bad places and quickly attain the unsurpassed path.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　自覺發道意，　　見佛即開解，",
        "translation": "Self-enlightened, they give rise to the intention for enlightenment. Seeing the Buddha, they immediately awaken and understand.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　中外常歡喜，　　供養心恭敬。",
        "translation": "Both inside and outside the palace were always joyful. They offered offerings of respect and reverence.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　億劫阿僧祇，　　行惡悉消除，",
        "translation": "Hundreds of millions of eons and incalculable eons Have been completely annihilated By doing evil deeds.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　持是八吉祥，　　速得明解教。",
        "translation": "Holding these eight auspicious signs, he'll quickly attain the teaching of insight.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　供事是經者，　　千葉華中生，",
        "translation": "The one who serves this sūtra Is born among a thousand petals of flowers.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　珍寶為其出，　　色像好無上。",
        "translation": "Precious treasures are produced for them, and their appearance is unsurpassed in form and beauty.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　人聞是尊經，　　尊敬信樂者，",
        "translation": "People hear this venerable sūtra and revere those who believe in it.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　奉持諷誦讀，　　清淨無放逸。",
        "translation": "He recites and recites it with reverence, pure and without heedlessness.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　女人信是經，　　敬慎無諛諂。",
        "translation": "A woman who believes in this sūtra is respectful and cautious without deceit.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　棄女為男子，　　聰明常黠慧，",
        "translation": "They abandon women for men, Being intelligent and always wise.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　奉持八佛名，　　出入賊不害。",
        "translation": "He honors the names of the eight buddhas and doesn't harm thieves who leave or enter.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　刀兵水火毒，　　諸邪不能干，",
        "translation": "Swords, armies, water, and fire are poisonous; No evil can harm them.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　愛樂奉是經，　　諸魔不得便。",
        "translation": "They love and delight in honoring this sūtra, but Māra won't get an advantage over them.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　鬼神諸官屬，　　無能嬈亂者，",
        "translation": "None of the officials, ghosts, spirits, or deities Can disturb it.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　飛行到諸剎，　　所在大豐樂。",
        "translation": "They fly to all the buddha-lands, Wherever they are, With great prosperity and happiness.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　心意正無邪，　　見佛大歡喜，",
        "translation": "Their minds and thoughts are correct, without error; They see the Buddha with great joy.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　所生常遇佛，　　等心奉事之。",
        "translation": "Those who are born always meet buddhas and serve them with equanimity.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　一切眾惡除，　　疾得泥洹道，",
        "translation": "All the evils are removed, and they quickly attain the path of nirvāṇa.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　精進無懈怠，　　去離諸緣著。",
        "translation": "He exerts himself without laziness, getting rid of conditioned attachments.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　為人朴直儒，　　奉持八佛名，",
        "translation": "As a native and straightforward Confucian, he honored the names of the eight buddhas.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　勇猛降眾魔，　　其力如金剛。",
        "translation": "Their power is like that of a diamond, Forcing the demons to be subdued.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　端正相好具，　　一切莫能當，",
        "translation": "Their features are correct and beautiful, No one can match them at all.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　布施無慳貪，　　巨億萬家生。",
        "translation": "Giving without stinginess or greed Is born in billions of myriad houses.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　盜賊及怨家，　　自然皆消除，",
        "translation": "Stealing, thieves, and enemies will all naturally be eliminated.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　疾病縣官事，　　烏鳴諸惡夢，",
        "translation": "The officials of the diseased prefecture, crows and bad dreams are heard.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　持是八佛名，　　呪之即除愈。",
        "translation": "Holding these names of the eight buddhas, he'll be cured by cursing them.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　奉持是經者，　　彌勒菩薩等，",
        "translation": "Those who preserve this sutra, Maitreya Bodhisattva and so forth,",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　第一四天王，　　常共擁護之。",
        "translation": "The first and the fourth heavenly kings always protect them together.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　所願皆可得，　　踊躍大歡喜，",
        "translation": "All their wishes can be obtained, They dance and rejoice greatly.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "　一心信樂者，　　福德亦如是。」",
        "translation": "Those who are single-mindedly faithful and happy, so are their merits.",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "是時，佛說偈言：爾時，諸菩薩：颰陀和菩薩、羅憐那竭菩薩、橋曰兜菩薩、那羅達菩薩、須深彌菩薩、摩訶須和薩和菩薩、因祗達菩薩、和輪調菩薩，",
        "translation": "Then the Buddha spoke these verses: At that time, the bodhisattvas Candraprabha Bodhisattva, Rājagṛha Bodhisattva, Bhīkṣu Bodhisattva, Nārada Bodhisattva, Sudarś",
        "source": "T14n0427_001:0072c13_4"
    },
    {
        "source_sentence": "是八人求道已來無央數劫，於今未取佛，願言：「使十方天下、人民皆得佛道。",
        "translation": "These eight people had been seeking the path for an incalculable number of eons, but now they hadn't taken the Buddha, so they vowed to say, So that all the worlds and people in the ten directions will attain the Buddha Way.",
        "source": "T14n0427_001:0073a20_5"
    },
    {
        "source_sentence": "若有急疾，皆當呼我八人名字，即得解脫；",
        "translation": "Anyone with an urgent illness should call me by the names of my eight companions, and I will be released.",
        "source": "T14n0427_001:0073a21_6"
    },
    {
        "source_sentence": "壽命欲終時，我八人便當飛往迎逆之。」",
        "translation": "When his life is about to end, the eight of us will flee to meet him.",
        "source": "T14n0427_001:0073a22_7"
    },
    {
        "source_sentence": "諸菩薩彌勒等、第一四天王，皆白佛言：「吾當擁護持八吉祥神呪經者，",
        "translation": "The bodhisattvas Maitreya and the first four celestial kings all said to the Buddha, I will embrace those who preserve the eight auspicious dhāraṇī scriptures.",
        "source": "T14n0427_001:0073a23_8"
    },
    {
        "source_sentence": "與我并力令諸疾病皆得除愈。」",
        "translation": "Give me my help and power to make all the illnesses heal.",
        "source": "T14n0427_001:0073a25_9"
    },
    {
        "source_sentence": "佛說經已，舍利弗、彌勒菩薩，及諸比丘、天龍、鬼神、阿須倫王，皆大歡喜樂聞。",
        "translation": "After the Buddha had taught the sūtras, Śāriputra, Maitreya Bodhisattva, and the monks, gods, dragons, ghosts, and asuras were all greatly delighted to hear them.",
        "source": "T14n0427_001:0073a26_0"
    },
    {
        "source_sentence": "佛說八吉祥神呪經",
        "translation": "Sutra on the Eight Auspicious God Dhāraṇī",
        "source": "T14n0427_001:0073a28_0"
    }
]