[
    {
        "source_sentence": "金色童子因緣經卷第十二",
        "translation": "Sutra on the Causes and Conditions of the Golden-colored Boy, Volume 12",
        "source": "T14n0550_012:0891b03_0"
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫",
        "translation": "translated scriptures of the Western Heaven, Sanzang朝散大夫",
        "source": "T14n0550_012:0891b04_0"
    },
    {
        "source_sentence": "試鴻臚卿傳梵大師賜紫",
        "translation": "試鴻卿傳梵大師賜紫, which is given to the great master Brahmā.",
        "source": "T14n0550_012:0891b05_0"
    },
    {
        "source_sentence": "沙門臣法護等奉　詔譯",
        "translation": "translated by imperial edict by the ascetic ministers Dharmagupta and others",
        "source": "T14n0550_012:0891b06_0"
    },
    {
        "source_sentence": "「『色相謙柔眾德具，　　圓成妙好普莊嚴，",
        "translation": "Their forms are humble and gentle, endowed with virtue, Perfectly formed, beautiful, adorned everywhere.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　自捨如來大覺尊，　　餘無等比最上士。",
        "translation": "He abandons himself to the Tathāgata, the great enlightened honored one, and the other peerless supreme person.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　佛聖言說無與等，　　佛聰利智亦無等，",
        "translation": "The Buddha’s words are incomparable. The Buddha’s intelligence and knowledge are also incomparable.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　佛聖解了復無同，　　佛大牟尼無比類。",
        "translation": "The Buddha’s noble understanding is also not the same: The Buddha, Great Sage, has no equal.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　佛大法器無與等，　　佛勝妙樂亦無等，",
        "translation": "The Buddha’s great vessel of teaching is peerless, And the Buddha’s supreme bliss is also peerless.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　佛善調柔復無同，　　佛極尊勝無比類。",
        "translation": "The Buddha's goodness and gentleness are also not the same, but the Buddha's supreme superiority is peerless.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　佛為大師無與等，　　佛為世父亦無等，",
        "translation": "The Buddha is unequaled as a great teacher, and neither is the Buddha equal to him.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　佛為善友復無同，　　佛為親愛無比類。",
        "translation": "The Buddha is another good friend, and there's no similarity; the Buddha's affection for them is peerless.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　無我無怖無不伏，　　無染遠離於憒閙，",
        "translation": "They have no self, no fear, and no non-subjectivity; Undefiled, they are free from clamor.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　已超三有險難中，　　無怨無患常清淨。",
        "translation": "They have already transcended the three dangers and difficulties of existence, Being without enemies or afflictions, always pure.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　清淨善調殊妙相，　　念力具足大自在，",
        "translation": "Pure and well-adjusted, with marvelous characteristics, Endowed with the power of mindfulness, they have great freedom.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　普開眾生利益門，　　佛最勝上無等比。",
        "translation": "Unlocking the door of benefit for all sentient beings, The Buddha is supreme and peerless.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　總略真實眾德聚，　　所說最勝如法儀，",
        "translation": "They are a summary of the true aggregate of virtues, Most excellent as they are taught according to the rules.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "　　佛為三界無上尊，　　汝應信受此功德。』",
        "translation": "The Buddha is the unsurpassed honored one of the three realms, so you should believe and accept this merit.'",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "「時，優婆塞復說伽陀曰：「時，守田人聞彼優婆塞說是如來勝功德已，",
        "translation": "“Then the layman Upāsaka said further to Gautama: Having heard these words of praise from the Tathāgata, the villagers in the fields at that time were filled with joy and reverence.",
        "source": "T14n0550_012:0891b07_0"
    },
    {
        "source_sentence": "發生淨信身毛喜豎，即作是言：『彼妙耳商主以一豆餅奉上毘婆尸如來，",
        "translation": "Having developed pure faith, the hair on his body hair stood on end and he said: That merchant of fine ears presented to the Tathāgata Vibhāsikā a loaf of rice cake with a bean curd.",
        "source": "T14n0550_012:0891b23_0"
    },
    {
        "source_sentence": "種植最上清淨施田，於剎那間商主，即得離諸貧苦，仗佛神力，以極少物淨心行施願力所資，",
        "translation": "He plants the highest pure field of giving, and in a moment's time, the merchant owner will be freed from poverty and suffering, relying on the Buddha's miraculous power to provide for it with the power of his vow to give with",
        "source": "T14n0550_012:0891b24_1"
    },
    {
        "source_sentence": "以是勝因獲如意寶。",
        "translation": "Because of this superior cause, they'll attain the wish-granting treasure.",
        "source": "T14n0550_012:0891b26_2"
    },
    {
        "source_sentence": "今毘婆尸如來、應供、正等正覺，經俱胝那庾多百千劫中，不得值遇極難得見，",
        "translation": "The Tathāgata Vipaśyin, Arhat, Perfectly Enlightened One, cannot be seen again and again for hundreds of thousands of koṭis of kalpas.",
        "source": "T14n0550_012:0891b27_3"
    },
    {
        "source_sentence": "而佛世尊於百千劫中，修成無上廣大最勝利益眾生無量福行，隨起悲心，",
        "translation": "For hundreds of thousands of eons the Buddha, the World-honored One, cultivating unexcelled, vast, and supremely great virtuous deeds for the benefit of sentient beings, developed a compassionate mind.",
        "source": "T14n0550_012:0891b29_4"
    },
    {
        "source_sentence": "廣以方便救度眾生，生死煩惱毒蛇所蠚墜墮極苦，慈心愛念猶如親友。",
        "translation": "He saves sentient beings widely with skillful means, falls into the great pain of birth-and-death, afflictions, and poisonous snakes, and is like a friend or relative.",
        "source": "T14n0550_012:0891c01_5"
    },
    {
        "source_sentence": "而我今者家無財物，雖久力營曾無小畜，然以淨心將自守田所得之食，",
        "translation": "But now my household has no property. Although I have been engaged in farming and raising livestock for a long time, yet with a pure mind I am going to keep the rice crops that I obtain by guarding my fields.",
        "source": "T14n0550_012:0891c03_6"
    },
    {
        "source_sentence": "雖極微小持用奉上。",
        "translation": "Even though it's extremely subtle, it's maintained and used as a consecration.",
        "source": "T14n0550_012:0891c05_7"
    },
    {
        "source_sentence": "又當發願，普願一切眾生皆得最上意願圓滿。』",
        "translation": "You must also make a vow to universally wish that all sentient beings will attain the fulfillment of the supreme aspiration.'",
        "source": "T14n0550_012:0891c05_8"
    },
    {
        "source_sentence": "彼守田人發是言時，毘婆尸如來、應供、正等正覺，即以神力現住其前。",
        "translation": "When the guard of the fields spoke these words, the Tathāgata Vipaśyin, Worthy of Offerings, and Completely Enlightened One appeared in front of him with supernormal powers.",
        "source": "T14n0550_012:0891c06_9"
    },
    {
        "source_sentence": "「時守田人見佛世尊，威德殊特昔未曾覩，身相端嚴猶若金山，其光晃耀映蔽日月。",
        "translation": "The people guarding the fields then saw the Bhagavān, whose authoritative qualities were so extraordinary that they had never been seen before. His body was as imposing and handsome as a mountain of gold, shining brilliantly like the sun and",
        "source": "T14n0550_012:0891c08_10"
    },
    {
        "source_sentence": "見已，即時發生最上廣大信樂，以清淨心持所有食，奉上世尊毘婆尸如來、應供、正等正覺清淨鉢中。",
        "translation": "Having seen this, he immediately developed the highest and most vast faith and happiness, maintained his food with a pure mind, presented it to the Bhagavān Vipaśyin Tathāgata, Worthy of Offerings, and Completely Enlightened One in",
        "source": "T14n0550_012:0891c10_11"
    },
    {
        "source_sentence": "「『以此施佛所獲福，　　願我過於此生後，",
        "translation": "'This is the merit gained by giving to the Buddha, so may I attain it after this birth.",
        "source": "T14n0550_012:0891c12_12"
    },
    {
        "source_sentence": "　　當起最上悲愍心，　　普觀眾生作利益。",
        "translation": "You should give rise to the supreme compassionate mind, Observing all sentient beings for their benefit.",
        "source": "T14n0550_012:0891c12_12"
    },
    {
        "source_sentence": "　　如佛所證無上道，　　如佛相好眾圓成，",
        "translation": "As the Buddha has realized the supreme path, So are the Buddha’s features perfected.",
        "source": "T14n0550_012:0891c12_12"
    },
    {
        "source_sentence": "　　我當成佛亦復然，　　普獲一切無等法。",
        "translation": "So it will be with me when I become a buddha, Obtaining all the peerless qualities.",
        "source": "T14n0550_012:0891c12_12"
    },
    {
        "source_sentence": "　　如佛宣說於正法，　　如佛成就一切智，",
        "translation": "As the Buddha teaches the true teaching, So does he perfect omniscience.",
        "source": "T14n0550_012:0891c12_12"
    },
    {
        "source_sentence": "　　我當得果亦復然，　　具一切智善說法。",
        "translation": "So it will be with me who will attain the fruit, Who is endowed with omniscience and well-explained.",
        "source": "T14n0550_012:0891c12_12"
    },
    {
        "source_sentence": "　　如佛降伏魔軍已，　　善轉清淨大法輪，",
        "translation": "Just as the Buddha, having conquered the armies of demons, Skillfully turns the pure great wheel of teaching.",
        "source": "T14n0550_012:0891c12_12"
    },
    {
        "source_sentence": "　　我當得果事還同，　　降伏魔軍宣正法。",
        "translation": "I'll attain the same result, subdue the armies of Māra and proclaim the right teaching.",
        "source": "T14n0550_012:0891c12_12"
    },
    {
        "source_sentence": "　　佛於生死大海中，　　自度度他皆出離，",
        "translation": "In the great ocean of birth and death, The Buddha saves himself and others; They are all liberated.",
        "source": "T14n0550_012:0891c12_12"
    },
    {
        "source_sentence": "　　我當亦度諸眾生，　　出離同歸無上道。』",
        "translation": "I will also save sentient beings, leaving and returning to the unsurpassed path together.'",
        "source": "T14n0550_012:0891c12_12"
    },
    {
        "source_sentence": "施已，加復極生淨信，頂禮佛足發大誓願，說伽陀曰：「爾時，毘婆尸如來、應供、正等正覺，",
        "translation": "Having given the almsbowl, he further developed pure faith and bowed his head at the Buddha’s feet. He made a great vow by bowing his forehead to the Buddha’s feet and said to Gautama: At that time the Tathāgata",
        "source": "T14n0550_012:0891c12_12"
    },
    {
        "source_sentence": "即發甚深廣大雲吼音聲，為守田人而授記言：『善男子！",
        "translation": "He then produced the sound of a profound, vast cloud roar and gave an assurance to the guards of the fields, saying, 'Good man!",
        "source": "T14n0550_012:0891c24_13"
    },
    {
        "source_sentence": "汝於來世當得作佛，號一切義成，為三界師具大威德，以勝上力降伏魔軍，",
        "translation": "In the future you will become a buddha called Sarvasaṃdarśana. You will be the teacher of the three quarters, endowed with great prestige and virtue; you will conquer the armies of Māra by your supreme power.",
        "source": "T14n0550_012:0891c26_0"
    },
    {
        "source_sentence": "如佛所行施作佛事。』",
        "translation": "As the Buddha does, he gives alms to create buddha-works.'",
        "source": "T14n0550_012:0891c27_1"
    },
    {
        "source_sentence": "時，毘婆尸如來為守田人授阿耨多羅三藐三菩提記已，還復本處。",
        "translation": "After the Tathāgata Vaiśravaṇa had given him the assurance of unsurpassed, correct, and complete enlightenment as a field protector, he returned to his original place.",
        "source": "T14n0550_012:0891c28_2"
    },
    {
        "source_sentence": "「彼滿度摩城一切人眾，普聞其事，乃至國王聞是事已，念守田人善根力故，",
        "translation": "“All the people in that city of Pūrvavideha heard this story, and when the king heard it, he thought to himself, ‘This is because of the power of the good roots of those guarding the fields.",
        "source": "T14n0550_012:0892a01_0"
    },
    {
        "source_sentence": "王乃嚴整車駕來詣守田人所，發信重心，嚴以寶象上安其座，勅令彼人而乘于象，",
        "translation": "The king then prepared his chariot and came to the place where the guards of the fields were. Arousing great faith, they arranged their seats on a richly decorated jeweled elephant and ordered those guards to ride on it",
        "source": "T14n0550_012:0892a02_1"
    },
    {
        "source_sentence": "同復王宮授王半位。",
        "translation": "Together, they returned to the palace and gave the king half his throne.",
        "source": "T14n0550_012:0892a04_2"
    },
    {
        "source_sentence": "時守田人即白王言：『如王之命非臣所欲，如臣志樂願求出家淨修梵行。』",
        "translation": "The guard of the fields then said to the king, 'Such is not what the king's order wants from a minister, just as he wishes to leave home and purely cultivate the religious practice.'",
        "source": "T14n0550_012:0892a05_3"
    },
    {
        "source_sentence": "其王即時勅從志願，王乃復宮。",
        "translation": "The king immediately ordered him to comply with his vow, and the king returned to his palace.",
        "source": "T14n0550_012:0892a06_4"
    },
    {
        "source_sentence": "「時守田人即於毘婆尸佛法中求佛出家，乃至盡壽修持梵行，其後命終生化樂天。",
        "translation": "The guard of the fields then sought to leave home in Vaiśravaṇa's teaching and left home, up to cultivating religious practice for the rest of his life, and was born in the Nirmāṇarati Heaven at the end of his life.",
        "source": "T14n0550_012:0892a07_5"
    },
    {
        "source_sentence": "乃至最後彼妙相童子，以具勝德故眾共冊立，如王法儀統臨王位，經六萬歲正法治化，",
        "translation": "At the end, that boy Marvelous Characteristics was elected by the assembly because of his superior virtue. For sixty thousand years he ruled over the throne in accordance with the king’s deportment and disciplined himself according to the",
        "source": "T14n0550_012:0892a09_6"
    },
    {
        "source_sentence": "謝世之後生兜率天。」",
        "translation": "After he passed away, he was born in Tuṣita Heaven.",
        "source": "T14n0550_012:0892a11_7"
    },
    {
        "source_sentence": "爾時，尊者阿難告阿闍世王言：「大王！",
        "translation": "It was then that Venerable Ānanda addressed King Ajātaśatru, saying, Great king!",
        "source": "T14n0550_012:0892a11_8"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T14n0550_012:0892a12_9"
    },
    {
        "source_sentence": "彼毘婆尸佛法中妙相王者，豈異人乎？",
        "translation": "That king of marvelous characteristics among the teachings of Vipaśyin Buddha is no different from anyone.",
        "source": "T14n0550_012:0892a12_10"
    },
    {
        "source_sentence": "即此金色苾芻是。",
        "translation": "This is the golden monk.",
        "source": "T14n0550_012:0892a13_11"
    },
    {
        "source_sentence": "其王昔見毘婆尸如來，以貧窮故，脫身所被一小衣片而用施佛，施已即發廣大誓願，",
        "translation": "Formerly the king saw Vipaśyin Tathāgata and, because of his poverty, gave away a small piece of cloth he wore for the Buddha’s use. Having given it to him, the king immediately made an extensive vow:",
        "source": "T14n0550_012:0892a14_12"
    },
    {
        "source_sentence": "由斯善業於天人中受勝妙樂，處處所生身皆金色，有金色衣自然覆體，",
        "translation": "As a result of these good deeds, the gods and humans will experience supreme marvelous bliss. Wherever they are born, their bodies all become golden-colored, with golden robes that naturally cover their bodies.",
        "source": "T14n0550_012:0892a16_13"
    },
    {
        "source_sentence": "生時天雨眾妙天花，乃至于今具大福德，身有妙衣旋脫旋生，具諸勝相。",
        "translation": "When he's born, the god rains down a multitude of marvelous celestial flowers, and even now he's endowed with great merit, his body has wonderful clothing that grows freely and turns around, which has superior characteristics",
        "source": "T14n0550_012:0892a17_14"
    },
    {
        "source_sentence": "彼時妙耳商主者，即今日照商主是；",
        "translation": "The merchant leader Marvelous Ear at that time was the merchant leader Illumination today.",
        "source": "T14n0550_012:0892a19_15"
    },
    {
        "source_sentence": "彼時妙耳商主之妻，即今日照商主妻是；",
        "translation": "The wife of the merchant leader Marvelous Ear at that time was today the wife of the merchant leader Illumination.",
        "source": "T14n0550_012:0892a20_16"
    },
    {
        "source_sentence": "彼時女使者，即今迦尸孫那利童女是；",
        "translation": "The maidservants of that time were the present-day Kaśinagara girl.",
        "source": "T14n0550_012:0892a21_17"
    },
    {
        "source_sentence": "彼時家童者，即今勇戾大臣是。」",
        "translation": "That boy of his family at the time was the present-day courageous minister.",
        "source": "T14n0550_012:0892a22_18"
    },
    {
        "source_sentence": "爾時，阿闍世王復白尊者阿難言：「此金色苾芻復造何業？",
        "translation": "At that point, King Ajātaśatru again said to Venerable Ānanda, What actions did this golden-colored monk do again?",
        "source": "T14n0550_012:0892a23_0"
    },
    {
        "source_sentence": "昔無過咎，為人虛妄構以染緣，置鐵叉上將殞其命。",
        "translation": "In the past, without fault or blame, he was falsely constructed by people for defiled reasons and placed on an iron trident, about to die.",
        "source": "T14n0550_012:0892a24_1"
    },
    {
        "source_sentence": "又復何因，旋即出家證阿羅漢果？」",
        "translation": "Again, what is the cause for turning away from home and realizing the fruit of arhatship?",
        "source": "T14n0550_012:0892a25_2"
    },
    {
        "source_sentence": "尊者答言：「大王！",
        "translation": "The venerable replied, Great king!",
        "source": "T14n0550_012:0892a26_3"
    },
    {
        "source_sentence": "過去世中有佛出世，名為妙月如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "In a past world, there was a Buddha who appeared in the world named Marvelous Moon Tathāgata, Worthy of Offerings, Perfectly Enlightened, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpass",
        "source": "T14n0550_012:0892a26_4"
    },
    {
        "source_sentence": "是時有一國，城外有僧寺眾所棲止，中一苾芻善說法要。",
        "translation": "At the time, there was a country outside the city where there were many monks and nuns living in monasteries, and one of them was a monk who well taught the essentials of the Dharma.",
        "source": "T14n0550_012:0892a29_0"
    },
    {
        "source_sentence": "是時，城中諸婆羅門及長者等皆來聽法，利養供給咸共臻集。",
        "translation": "At the time, all the brāhmaṇas and elders in the city came to listen to the teaching, providing benefits and offerings, and they all gathered together.",
        "source": "T14n0550_012:0892b01_1"
    },
    {
        "source_sentence": "「乃至其後復有苾芻，名曰無勝，來止此寺，加復明利而善說法，辯才無礙，",
        "translation": "“After that, another monk named Wusheng came to this monastery and stayed there. He was endowed with insight and eloquence and his eloquence was unhindered.",
        "source": "T14n0550_012:0892b02_2"
    },
    {
        "source_sentence": "言詞流澤音聲清美。",
        "translation": "His words flowed, and his voice was pure and beautiful.",
        "source": "T14n0550_012:0892b04_3"
    },
    {
        "source_sentence": "時諸人眾咸悉來詣無勝苾芻之所，聽受說法，其所演說初中後善文義深遠，",
        "translation": "The people then all came to the place where the invincible bhikṣu was and listened to his exhortation. The doctrine he taught was profound in both its meaning and its subtlety, from beginning to end with well-balanced explanation",
        "source": "T14n0550_012:0892b04_4"
    },
    {
        "source_sentence": "純一清白梵行之相。",
        "translation": "It's purely the characteristic of the pure and white religious practice.",
        "source": "T14n0550_012:0892b06_5"
    },
    {
        "source_sentence": "是時，四遠人眾聞已信慕，飲食衣服座臥之具，病緣醫藥皆悉供給，而彼先來說法苾芻，",
        "translation": "At that time the people of the four distant regions had all heard this and believed in it. They provided food, drink, clothing, seats, bedding, and medicine for curing their illnesses. The bhikṣu Bhikṣu preached the Dharma",
        "source": "T14n0550_012:0892b07_6"
    },
    {
        "source_sentence": "所獲利養由斯間絕。",
        "translation": "It's because of this that the benefits and nourishments are cut off.",
        "source": "T14n0550_012:0892b09_7"
    },
    {
        "source_sentence": "「是時，說法苾芻即自思惟：『今無勝苾芻同止于此，於我利養必當間絕。",
        "translation": "At that point, the Dharma preaching monk then thought to himself, 'Now, there's no superior monk who stays here together, and my benefits will surely be cut off.",
        "source": "T14n0550_012:0892b09_8"
    },
    {
        "source_sentence": "又復由此利養絕故，彼多聞智者及諸信士，豈非於我不尊敬邪？』",
        "translation": "Furthermore, because these benefits are cut off, aren't those well-versed wise men and believers who don't respect me?'",
        "source": "T14n0550_012:0892b11_9"
    },
    {
        "source_sentence": "乃生怖畏。",
        "translation": "They then became frightened.",
        "source": "T14n0550_012:0892b12_10"
    },
    {
        "source_sentence": "念已，即時虛構方計用遮其事。",
        "translation": "After he had thought about it, he immediately created a false designation to conceal that thing.",
        "source": "T14n0550_012:0892b12_11"
    },
    {
        "source_sentence": "故往召一婆羅門童女，使其來還妄起染緣，謗訕於彼無勝苾芻。",
        "translation": "That's why he summoned a Brāhmaṇa girl in the past to cause her to come back and falsely create defiled conditions, denigrating and scolding him as an unsurpassed monk.",
        "source": "T14n0550_012:0892b13_12"
    },
    {
        "source_sentence": "是時童女如命而行。",
        "translation": "The girl then did as she was told.",
        "source": "T14n0550_012:0892b15_13"
    },
    {
        "source_sentence": "其後一日彼說法苾芻與諸苾芻共會，僧房門首如常語論，童女忽來而謂眾曰：『汝出家人中豈有非梵行邪？",
        "translation": "One day, the Dharma preaching bhikṣu and the other bhikṣus were assembled together at the entrance of the monks' quarters to discuss the discussion as usual. The girl suddenly came along and said to the crowd, 'Is there anything wrong",
        "source": "T14n0550_012:0892b15_14"
    },
    {
        "source_sentence": "所以然者？",
        "translation": "Why is this so?",
        "source": "T14n0550_012:0892b18_15"
    },
    {
        "source_sentence": "彼無勝苾芻向者於我逼以染緣，梵行人中此非道理。』",
        "translation": "This is not reasonable among religious practitioners who say, 'That unsurpassed monk who's directing his attention to me for the sake of being oppressed by defiled.'",
        "source": "T14n0550_012:0892b18_16"
    },
    {
        "source_sentence": "「時諸苾芻聞已掩耳，謂童女言：『莫作是說！",
        "translation": "After hearing it, the monks covered their ears and said to the girl, 'Don't say that!'",
        "source": "T14n0550_012:0892b19_17"
    },
    {
        "source_sentence": "勿使他人聞此惡言。』",
        "translation": "Don't let others hear these bad words.'",
        "source": "T14n0550_012:0892b20_18"
    },
    {
        "source_sentence": "唯說法苾芻出不善語謗彼無勝苾芻，謂言：『如實不善所作。』",
        "translation": "Only the Dharma preaching monk speaks unwholesomely and denigrates that unsurpassed monk, saying, 'It's really unwholesome to do.'",
        "source": "T14n0550_012:0892b21_19"
    },
    {
        "source_sentence": "乃至其後展轉聞于無勝苾芻。",
        "translation": "Up to that point, they'll gradually hear it from the unsurpassed monk.",
        "source": "T14n0550_012:0892b22_20"
    },
    {
        "source_sentence": "彼人聞已，即作是言：『彼說法苾芻何故於我發是語邪？』",
        "translation": "After hearing it, that person says, 'Why did that monk who teaches the Dharma say this to me?'",
        "source": "T14n0550_012:0892b23_21"
    },
    {
        "source_sentence": "言已，即詣彼苾芻所。",
        "translation": "After he said so, he went to that monk's place.",
        "source": "T14n0550_012:0892b24_22"
    },
    {
        "source_sentence": "到已，謂言：『我於尊者無所觸嬈，何出惡言固相譏毀？』",
        "translation": "When he arrived, he said, 'I'm not disturbed by the venerable, so why would I say bad words and criticize him?'",
        "source": "T14n0550_012:0892b24_23"
    },
    {
        "source_sentence": "時說法苾芻轉起恚心，復出惡言增加呵毀，謂言：『汝有此罪，後當應受鐵叉之苦。』",
        "translation": "The Dharma preaching monk then became angry and spoke harshly, saying, 'If you commit this sin, you'll be subject to the suffering of the iron fetters in the future.'",
        "source": "T14n0550_012:0892b26_0"
    },
    {
        "source_sentence": "「時無勝苾芻聞已自念：『如斯行業壞修行法。』",
        "translation": "After hearing it, the unsurpassed monk then thought to himself, 'Such actions destroy the practice of cultivation.'",
        "source": "T14n0550_012:0892b27_1"
    },
    {
        "source_sentence": "知是事已，即自收舉衣鉢受用出離其寺，詣一樹下隨意棲止。",
        "translation": "Knowing this, he took his robe and bowl, put them away for use, left the monastery, went to a tree, and settled there as he wished.",
        "source": "T14n0550_012:0892b28_2"
    },
    {
        "source_sentence": "是時，四眾見已，即同奔逐勸誘欲令迴復，竟不從命。",
        "translation": "When the fourfold assembly saw this, they all ran together to exhort and tempt each other so that they would turn back but did not obey their orders.",
        "source": "T14n0550_012:0892c01_3"
    },
    {
        "source_sentence": "時說法苾芻後自惟忖：『我今所作誠為不善，以利養因起惡趣業，如是審思心極追悔，",
        "translation": "Then the bhikṣu who preached the Dharma thought to himself, “What I am doing now is truly unwholesome. It is because of profit and gain that I have done evil deeds leading to bad rebirths.",
        "source": "T14n0550_012:0892c02_4"
    },
    {
        "source_sentence": "我應詣彼求其懺罪。』",
        "translation": "I should go there to ask them to repent of my sins.'",
        "source": "T14n0550_012:0892c04_5"
    },
    {
        "source_sentence": "念已，即時速出其寺，訪尋尊者無勝苾芻，深自毀責滿目淚流，猶如稚童啼哀莫止。",
        "translation": "Immediately after he thought this, he quickly left the monastery and went out to search for the Venerable Unsurpassed Bhikṣu, who deeply reproached himself with tears running down his eyes like a young child crying in sorrow",
        "source": "T14n0550_012:0892c04_6"
    },
    {
        "source_sentence": "「是時，無數百千諸婆羅門、長者等眾咸覩是事，到已即時前詣無勝苾芻，",
        "translation": "Countless hundreds of thousands of brāhmaṇas, wealthy householders, and other members of the sangha all wondered at this matter. On arriving there, they immediately went before the supreme bhikṣu.",
        "source": "T14n0550_012:0892c06_7"
    },
    {
        "source_sentence": "頂禮雙足，作是白言：『尊者！",
        "translation": "He bowed his head at their feet and said, 'Venerable!",
        "source": "T14n0550_012:0892c08_8"
    },
    {
        "source_sentence": "我今懺罪願尊忍可，我如稚童，我如愚夫，我不明了，貪利養故造不善業，",
        "translation": "World-Honored One, I now repent of my sins and beg you to tolerate them. I am like a young child; I am like a foolish man. I do not understand. Because I covet gain and profit, I commit unwhole",
        "source": "T14n0550_012:0892c08_9"
    },
    {
        "source_sentence": "以虛妄緣出不善語，謗訕尊者深為罪咎！",
        "translation": "It's deeply sinful to speak unwholesome words for false reasons and denigrate the venerable!",
        "source": "T14n0550_012:0892c10_10"
    },
    {
        "source_sentence": "深為罪咎！",
        "translation": "It's deeply sinful!",
        "source": "T14n0550_012:0892c11_11"
    },
    {
        "source_sentence": "尊者悲心願垂忍可。』",
        "translation": "Venerable, with compassion, I wish to tolerate it.'",
        "source": "T14n0550_012:0892c11_12"
    },
    {
        "source_sentence": "「無勝苾芻答言：『大德！",
        "translation": "The unsurpassed monk replied, 'O great virtuous one!",
        "source": "T14n0550_012:0892c12_13"
    },
    {
        "source_sentence": "我已忍可，我今但為心厭憒閙，棲止樹下跏趺宴坐，端身正念修寂靜行。』",
        "translation": "I've tolerated it, but now I'm just disillusioned with the noise and disturbance of my mind, sit quietly under a tree in meditation, and cultivate quiescent practices with correct mindfulness.'",
        "source": "T14n0550_012:0892c12_14"
    },
    {
        "source_sentence": "說是語已，時無勝苾芻發生最上厭離之心，靜念世間誠堪驚懼，遷流謝滅諸行不停，",
        "translation": "When he had uttered these words, the unsurpassed bhikṣu became overweeningly disgusted and thought to himself, “The world is truly frightened.",
        "source": "T14n0550_012:0892c14_15"
    },
    {
        "source_sentence": "五眾循環生死流轉，乃至帝釋諸天供養稱讚皆非究竟。",
        "translation": "The five groups of people cycle through birth-and-death and continue to transmigrate, even up to the god Indra's heavenly offerings and praises are not perfect.",
        "source": "T14n0550_012:0892c16_16"
    },
    {
        "source_sentence": "念已，即時兩翼騰驤狀如鵝王，高舉空中清淨潔白，一切大眾咸悉瞻覩，",
        "translation": "When he thought thus, his two wings rose high like a lion’s wing, hovering as high as the sky. All the people in the great assembly gazed at him.",
        "source": "T14n0550_012:0892c17_17"
    },
    {
        "source_sentence": "發生最上淨信之心，即於空中現諸神變。",
        "translation": "He gives rise to the supremely pure mind of faith, which manifests miraculous transformations in the sky.",
        "source": "T14n0550_012:0892c19_18"
    },
    {
        "source_sentence": "「時說法苾芻見是事已，即作是言：『苦哉！",
        "translation": "After seeing this, the Dharma preaching monk said, 'Sad!'",
        "source": "T14n0550_012:0892c20_19"
    },
    {
        "source_sentence": "我今云何於此大仙聖者而興譏毀？』",
        "translation": "How can I now criticize this great sage and noble person?'",
        "source": "T14n0550_012:0892c21_20"
    },
    {
        "source_sentence": "言已，悶絕僵仆于地。",
        "translation": "After he said this, he fell to the ground in distress and crippled.",
        "source": "T14n0550_012:0892c22_0"
    },
    {
        "source_sentence": "「是時，妙月如來、應供、正等正覺，知是事已，起悲愍心念此苾芻，",
        "translation": "“At that time, the Tathāgata Marvelous Moon, Arhat, Perfectly Enlightened One, knowing this matter, aroused compassion and thought of the monk Sadāparibhūta.",
        "source": "T14n0550_012:0892c23_0"
    },
    {
        "source_sentence": "無令嘔血而致命終，即運神力來現其前。",
        "translation": "They were not allowed to vomit blood and die, so they came before them with miraculous powers.",
        "source": "T14n0550_012:0892c24_1"
    },
    {
        "source_sentence": "而佛世尊乃舒清淨綱鞔百福相手，為彼苾芻摩觸頭頂善安慰之；",
        "translation": "The Buddha, the World-honored One, then stretched out a pure rope of one hundred merits to comfort that bhikṣu by touching his hair and head.",
        "source": "T14n0550_012:0892c25_2"
    },
    {
        "source_sentence": "而彼苾芻佛手觸時，還得本心即獲輕安，苾芻旋起乃於佛前諦誠懺悔。",
        "translation": "When that monk touches the Buddha with his hand, he returns to his original mind and immediately attains ease, and the monk rises up and repents in front of the Buddha.",
        "source": "T14n0550_012:0892c26_3"
    },
    {
        "source_sentence": "「『士夫處世間，　　口出惡言詞，",
        "translation": "'Suppose a man were to live in the world and speak harsh words.",
        "source": "T14n0550_012:0892c29_0"
    },
    {
        "source_sentence": "　　其猶利刀斧，　　斷割於自身。",
        "translation": "They're like sharp swords and axes cutting their own bodies off.",
        "source": "T14n0550_012:0892c29_0"
    },
    {
        "source_sentence": "　　應讚而起謗，　　應謗而起讚，",
        "translation": "What should be praised gives rise to criticism, and what should be denigrated gives rise to criticism.",
        "source": "T14n0550_012:0892c29_0"
    },
    {
        "source_sentence": "　　惡語由口生，　　所出自不覺。",
        "translation": "Bad words arise from speech and are not perceived by the person who speaks them.",
        "source": "T14n0550_012:0892c29_0"
    },
    {
        "source_sentence": "　　起惡心初小，　　如博弈輸財，",
        "translation": "To give rise to bad thoughts in the first moment of thought is like playing a chess and transferring money.",
        "source": "T14n0550_012:0892c29_0"
    },
    {
        "source_sentence": "　　此中大惡興，　　謂謗阿羅漢。",
        "translation": "Here, a great evil arises: denigrating the arhat.",
        "source": "T14n0550_012:0892c29_0"
    },
    {
        "source_sentence": "　　心起毀謗因，　　眾生墮惡趣，",
        "translation": "Their minds give rise to the cause of disparagement, and sentient beings fall into bad destinies.",
        "source": "T14n0550_012:0892c29_0"
    },
    {
        "source_sentence": "　　心起清淨因，　　眾生往善趣。』",
        "translation": "The mind gives rise to pure causes, and sentient beings go to a good destiny.'",
        "source": "T14n0550_012:0892c29_0"
    },
    {
        "source_sentence": "「爾時，妙月如來普為大眾說伽陀曰：「爾時，妙月如來廣為四眾宣說妙法，",
        "translation": "At that time, the Tathāgata Marvelous Moon spoke these verses to the great assembly: At that time, the Tathāgata Marvelous Moon extensively taught the wonderful Dharma to the fourfold assembly.",
        "source": "T14n0550_012:0892c29_0"
    },
    {
        "source_sentence": "示教利喜已，還復本處。」",
        "translation": "After showing the benefits and joy of the teaching, they return to their original place.",
        "source": "T14n0550_012:0893a09_1"
    },
    {
        "source_sentence": "復次，尊者阿難告阿闍世王言：「大王！",
        "translation": "Furthermore, Venerable Ānanda addressed King Ajātaśatru, saying, Great king!",
        "source": "T14n0550_012:0893a11_0"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T14n0550_012:0893a11_1"
    },
    {
        "source_sentence": "彼時說法苾芻者豈異人乎？",
        "translation": "Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is",
        "source": "T14n0550_012:0893a12_2"
    },
    {
        "source_sentence": "即此金色苾芻是。",
        "translation": "This is the golden monk.",
        "source": "T14n0550_012:0893a12_3"
    },
    {
        "source_sentence": "昔於無勝苾芻之所起虛妄緣，惡言謗訕得果聖人，由是業報五百生中墮大地獄，",
        "translation": "In the past, when a false condition was created by an invincible monk, he spoke harshly and slandered the noble person who attained fruition, and because of this karmic retribution he fell into the great hell for five hundred lifetimes",
        "source": "T14n0550_012:0893a13_4"
    },
    {
        "source_sentence": "一一獄中受苦報盡，復五百生墮餓鬼趣，復五百生墮畜生趣，彼彼報盡後五百生得生人間，",
        "translation": "When the retribution of suffering in each hell ends, they'll again fall into the hungry ghost realm for another five hundred lifetimes and fall into the animal realm for another five hundred lifetimes, and when that retribution ends, they'll be",
        "source": "T14n0550_012:0893a15_5"
    },
    {
        "source_sentence": "一一生中本每愆罪。",
        "translation": "In one lifetime, he originally committed the sin of sexual misconduct.",
        "source": "T14n0550_012:0893a17_6"
    },
    {
        "source_sentence": "為人虛妄構以染緣，登鐵叉上受大苦惱，乃至于今惡業報盡，最後為彼勇戾大臣，",
        "translation": "For the sake of someone who falsely creates conditions that are defiled, they ascend an iron fork to experience great suffering and distress, until now when the retribution of bad actions has ended, and in the end they become their bold minister.",
        "source": "T14n0550_012:0893a17_7"
    },
    {
        "source_sentence": "枉執罪染置鐵叉上，我以神力救令得脫。",
        "translation": "They in vain cling to the stain of sin and place it on an iron fork, and I use my supernormal powers to save them so they'll be liberated.",
        "source": "T14n0550_012:0893a19_8"
    },
    {
        "source_sentence": "「大王！",
        "translation": "Great king!",
        "source": "T14n0550_012:0893a20_9"
    },
    {
        "source_sentence": "是人由斯罪業，故招苦果，昔以善根於妙月如來法中淨信出家修持梵行，",
        "translation": "Because of these sins and actions, this man will incur the result of suffering. In the past he renounced domestic life to practice austerity on the basis of pure faith in the Dharma of the Tathāgata Samantabhadra (i.e., the teaching",
        "source": "T14n0550_012:0893a20_10"
    },
    {
        "source_sentence": "由斯善業於今釋迦如來法中清淨出家，斷諸煩惱證阿羅漢果。",
        "translation": "Because of these good actions, he now becomes a pure renunciant in the Tathāgata's teaching and cuts offs the afflictions to realize the fruit of arhatship.",
        "source": "T14n0550_012:0893a22_11"
    },
    {
        "source_sentence": "「是故，大王！",
        "translation": "Therefore, great king!",
        "source": "T14n0550_012:0893a23_12"
    },
    {
        "source_sentence": "世間眾生寧自受苦，不應於他起謗訕心，自怖惡名不應令他亦招惡譽，",
        "translation": "Sentient beings in the world would rather suffer for themselves than criticize others. They fear bad repute and should not allow others to also bring bad repute.",
        "source": "T14n0550_012:0893a23_13"
    },
    {
        "source_sentence": "若自受樂即當分與他人樂事。」",
        "translation": "If he receives happiness for himself, then he'll share the happiness of others.",
        "source": "T14n0550_012:0893a25_14"
    },
    {
        "source_sentence": "尊者阿難說是法時，有無數百千眾生獲大勝利，或有證得須陀洹果者，",
        "translation": "When Venerable Ānanda had discoursed thus the Dharma, countless hundreds of thousands of living beings attained great benefit. Some were able to realize the state of stream-enterer (srotaāpanna).",
        "source": "T14n0550_012:0893a26_15"
    },
    {
        "source_sentence": "或得斯陀含果者，或得阿那含果者，或得阿羅漢果者，或發阿耨多羅三藐三菩提心者，",
        "translation": "Some may attain the fruit of once-returning, some may attain the fruit of non-returning, some may attain the fruit of arhatship, some may give rise to the mind of unexcelled, perfect enlightenment.",
        "source": "T14n0550_012:0893a27_16"
    },
    {
        "source_sentence": "或發聲聞菩提心者，或發歸向心受近事戒者；",
        "translation": "They may give rise to the aspiration for enlightenment of śrāvakas, or they may give rise to the aspiration for dedication of merit and receive the precepts in relation to deeds.",
        "source": "T14n0550_012:0893a29_17"
    },
    {
        "source_sentence": "又復會中有但知佛可信、知法可歸、知僧可奉者。",
        "translation": "Again, there are people in the assembly who simply know that the Buddha can be believed, know that the Dharma can be returned, and know that the saṃgha can serve him.",
        "source": "T14n0550_012:0893b02_0"
    },
    {
        "source_sentence": "爾時，日照商主即於會中右膝著地，肅恭合掌前白尊者阿難言：「尊者！",
        "translation": "At that point, the merchant lord Sun Shining went to the assembly, knelt with his right knee on the ground, joined his palms in respect, and said to Venerable Ānanda, Venerable!",
        "source": "T14n0550_012:0893b04_0"
    },
    {
        "source_sentence": "我昔曾發願言，欲於自舍延請世尊及苾芻眾，備以飲食微伸供養，一一苾芻各以價直百千上妙之衣而用奉施。",
        "translation": "In the past, I once made a vow that I would invite the Bhagavān and the congregation of monks from Śākyamuni to offer food and drink as modest offerings to each one of those monks with hundreds of thousands of rare robes worth",
        "source": "T14n0550_012:0893b05_1"
    },
    {
        "source_sentence": "苦哉尠福！",
        "translation": "That's painful, Kauṣṭhila!",
        "source": "T14n0550_012:0893b08_2"
    },
    {
        "source_sentence": "今佛世尊已入涅槃，我今至誠請尊者等諸苾芻眾，舍中供養。」",
        "translation": "Now that the Bhagavān has entered nirvāṇa, I sincerely invite the venerable and other monks to make offerings in my dwelling.",
        "source": "T14n0550_012:0893b08_3"
    },
    {
        "source_sentence": "尊者告言：「善哉！",
        "translation": "The venerable told him, Good!",
        "source": "T14n0550_012:0893b09_4"
    },
    {
        "source_sentence": "商主！",
        "translation": "Lord of the merchants!",
        "source": "T14n0550_012:0893b10_5"
    },
    {
        "source_sentence": "隨汝所願，我當同彼盡閻浮提，所有一切釋迦如來聲聞弟子，咸悉來集赴汝所請。」",
        "translation": "According to your wishes, I'll go along with them throughout Jambudvīpa, and all the śrāvaka disciples of the Śākyamuni Tathāgata and śrāvakas who are there will come and assemble as you ask.",
        "source": "T14n0550_012:0893b10_6"
    },
    {
        "source_sentence": "是時，日照商主滿其所願心大歡喜，即時嚴絜國城內外，除去一切土石沙礫，",
        "translation": "At that moment, the merchant lord Sun Shining, having fulfilled his wish, was greatly delighted. Immediately he adorned the whole empire of Jambudvīpa, both inside and outside the city walls, to remove all the dirt",
        "source": "T14n0550_012:0893b12_7"
    },
    {
        "source_sentence": "豎立幢幡，觸處遍灑旃檀香水，垂諸花纓眾寶嚴飾，燒眾名香散諸妙花，",
        "translation": "They erect banners and pennants, sprinkling sandalwood perfume everywhere wherever they touch it. draped with flowers and garlands adorned with jewels, burning names and fragrances and scattering exquisite flowers.",
        "source": "T14n0550_012:0893b13_8"
    },
    {
        "source_sentence": "如是殊特廣嚴布已。",
        "translation": "Thus, it's especially extensive and well-arranged.",
        "source": "T14n0550_012:0893b15_9"
    },
    {
        "source_sentence": "備設種種清淨最上香美飲食，至明旦時施設妙好茵褥床座，間布清淨妙香水瓶，",
        "translation": "They provided various kinds of pure, supremely fragrant food and drink. At sunrise they arranged exquisitely beautiful cushions, bedding, seats, and Between them were spread pure, exquisitely fragrant bottles of perfume.",
        "source": "T14n0550_012:0893b16_10"
    },
    {
        "source_sentence": "食時將至，遣人奉白尊者阿難：「飯食已辦，願尊降赴。」",
        "translation": "When the meal was about to arrive, he sent someone to report to Venerable Ānanda, The food and drink have been prepared, so may the venerable one descend.",
        "source": "T14n0550_012:0893b17_11"
    },
    {
        "source_sentence": "是時，尊者阿難即以神力踊身空中，放金色光普徧照耀此贍部洲，空中自然鳴擊乾稚，",
        "translation": "Then the venerable Ānanda emerged from his body and flew up into the sky by magic, emanating a golden light that shone everywhere over Jambudvipa.",
        "source": "T14n0550_012:0893b19_12"
    },
    {
        "source_sentence": "振發大聲出如是言：「所有世尊一切聲聞大眾其得通者，各各以自神力來赴所請。",
        "translation": "They raised a loud voice and said, Bhagavān, all the śrāvakas and masses who have attained supernormal abilities are each requested by their own miraculous powers.",
        "source": "T14n0550_012:0893b21_13"
    },
    {
        "source_sentence": "諸凡夫眾假以尊者阿難神力，亦悉來赴。」",
        "translation": "Ordinary people may also come and go with the miraculous power of Venerable Ānanda.",
        "source": "T14n0550_012:0893b23_0"
    },
    {
        "source_sentence": "是時，一切聲聞眾等聞乾稚中所出言已，各從彼彼所住方處，謂忉利天，",
        "translation": "At that time, all the śrāvakas heard the discourse uttered in the abhidharma-samuccaya. Each of them came from one place to another and stayed there:",
        "source": "T14n0550_012:0893b23_1"
    },
    {
        "source_sentence": "及大雪山、大野山、摩羅山、佉禰囉山、香醉山、妙高山、持雙山、持軸山、儞民陀囉山，",
        "translation": "and the great snow-capped mountains, the great wilderness mountains, the mola mountains, the kāra mountains, the fragrant mountains, the marvelous high mountains, the twin peaks, the ax-holding mountain",
        "source": "T14n0550_012:0893b25_2"
    },
    {
        "source_sentence": "并諸園林樹下州城河池，及彼大海仙人住處，乃至路傍空舍棄屍林等，",
        "translation": "It's surrounded by parks, forests, trees, towns, rivers, ponds, and other great sages living in the ocean, up to empty houses at roadsides, abandoned corpse groves, and so forth",
        "source": "T14n0550_012:0893b27_3"
    },
    {
        "source_sentence": "如是等處大苾芻眾從三摩地起，於剎那間各踊空中，如阿輸迦花，青黃赤白彩雲遍覆，",
        "translation": "The great assemblies of bhikṣus emerged from samādhi and, at each moment, rose up into the sky like the blue, yellow, red, white, and variegated clouds covering the sky.",
        "source": "T14n0550_012:0893b29_0"
    },
    {
        "source_sentence": "自空徐來入王舍大城，於剎那間內外充滿三俱胝數，其類有三：一者、漏盡眾；",
        "translation": "They came from space and gradually entered the great city of Rājagṛha, filling it for an instant, inside and out, as many times as there are three corpuscles. There were three kinds:",
        "source": "T14n0550_012:0893c02_0"
    },
    {
        "source_sentence": "二者、有學眾；",
        "translation": "The second is the assembly of those who are still learning.",
        "source": "T14n0550_012:0893c03_1"
    },
    {
        "source_sentence": "三者、凡夫善眾。",
        "translation": "3. The good multitude of worldlings.",
        "source": "T14n0550_012:0893c04_2"
    },
    {
        "source_sentence": "是時，尊者阿難及諸大眾既至會已，上中下位依次而坐。",
        "translation": "At that time, having arrived at the assembly, Venerable Ānanda and the members of the assembly were seated in ascending, middle, and descending order.",
        "source": "T14n0550_012:0893c04_3"
    },
    {
        "source_sentence": "時日照商主普遍觀察眾坐已定，即以最上清淨飲食自手持奉，尊者阿難及諸大眾飯食已訖，",
        "translation": "The merchant lord Suniṣṭha then observed all the people in the assembly. Having settled his seat, he offered the food and drink of the utmost purity to Venerable Ānanda and the members of the assembly.",
        "source": "T14n0550_012:0893c05_4"
    },
    {
        "source_sentence": "各滌應器，商主即時復以價值百千上妙三衣，而欲奉施尊者等眾，發清淨心瞻仰之際。",
        "translation": "Each washed his bowl, and the merchant owner immediately offered a hundred thousand of the three most sublime robes to the venerable and other members of the congregation in order to give them to them, giving rise to pure minds that looked up with admiration.",
        "source": "T14n0550_012:0893c07_5"
    },
    {
        "source_sentence": "時金色苾芻知其父意，即作是言：「我今為父助行施法。」",
        "translation": "Knowing what his father wanted, the golden monk then said, Now, I'll help my father perform the act of giving.",
        "source": "T14n0550_012:0893c09_6"
    },
    {
        "source_sentence": "言已，於剎那間即脫自身所被金色三衣，次第奉施彼尊者等三俱胝眾，",
        "translation": "After that, within a split second, he took off the three golden robes he wore on his body and presented them to the venerable one in order of the three corpuscles.",
        "source": "T14n0550_012:0893c11_7"
    },
    {
        "source_sentence": "旋脫旋生衣無竭盡。",
        "translation": "There's no limit to the number of robes that are produced by circumambulation and liberation.",
        "source": "T14n0550_012:0893c12_8"
    },
    {
        "source_sentence": "是時，空中百千天眾俱發聲言：「奇哉！",
        "translation": "At that point, a hundred thousand celestial beings in the sky all spoke out, saying, Marvelous!",
        "source": "T14n0550_012:0893c13_9"
    },
    {
        "source_sentence": "奇哉！",
        "translation": "How marvelous!",
        "source": "T14n0550_012:0893c14_10"
    },
    {
        "source_sentence": "甚為希有。」",
        "translation": "That's very rare.",
        "source": "T14n0550_012:0893c14_11"
    },
    {
        "source_sentence": "空中復奏種種天樂，雨眾天花。",
        "translation": "The sky also played various heavenly music and rained down heavenly flowers.",
        "source": "T14n0550_012:0893c14_12"
    },
    {
        "source_sentence": "爾時，諸方來會一切大眾，國主阿闍世王等，宮嬪眷屬臣佐吏民，舉熙怡目見是事已，",
        "translation": "At the time, all the people from various directions came to this assembly. The sovereign Ajātaśatru and others, as well as the palace officials, their retinues, ministers, assistants, and officials, raised their joyful eyes",
        "source": "T14n0550_012:0893c15_13"
    },
    {
        "source_sentence": "咸悉歎言：「善哉！",
        "translation": "They all praised him, saying, Good!",
        "source": "T14n0550_012:0893c17_14"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T14n0550_012:0893c17_15"
    },
    {
        "source_sentence": "甚為希有。」",
        "translation": "That's very rare.",
        "source": "T14n0550_012:0893c17_16"
    },
    {
        "source_sentence": "又復三讚是言：「奇哉！",
        "translation": "Again, he praised it three times, saying, Marvelous!",
        "source": "T14n0550_012:0893c17_17"
    },
    {
        "source_sentence": "植福果報殊勝。",
        "translation": "The rewards for planting goodness are superior.",
        "source": "T14n0550_012:0893c18_18"
    },
    {
        "source_sentence": "奇哉！",
        "translation": "How marvelous!",
        "source": "T14n0550_012:0893c18_19"
    },
    {
        "source_sentence": "諸福有大力能。",
        "translation": "The merits have great power.",
        "source": "T14n0550_012:0893c18_20"
    },
    {
        "source_sentence": "奇哉！",
        "translation": "How marvelous!",
        "source": "T14n0550_012:0893c19_21"
    },
    {
        "source_sentence": "布施深固福田。",
        "translation": "Giving is a deeply rooted field of merit.",
        "source": "T14n0550_012:0893c19_22"
    },
    {
        "source_sentence": "是故應知，若植施種勝報不虛，諸有智者審觀，如是福果報事，其誰不植清淨施田。」",
        "translation": "Therefore, you should know that if you plant the seeds of generosity with superior rewards that aren't false, wise people will carefully examine such meritorious rewards and see who won't plant the pure field of giving.",
        "source": "T14n0550_012:0893c19_23"
    },
    {
        "source_sentence": "如是言已，無數百千人眾合掌頂禮，俱發聲言：「南無佛陀邪！」",
        "translation": "After he said this, countless hundreds of thousands of people joined their palms and bowed their heads together, all raising their voices and saying, Namo Buddha!",
        "source": "T14n0550_012:0893c21_24"
    },
    {
        "source_sentence": "爾時，尊者阿難普為大眾廣說布施清淨之法，日照商主即從座起，右膝著地向尊者阿難，",
        "translation": "At that time, Venerable Ānanda had extensively taught the pure doctrine of generosity and purity to the assembly. The merchant Supratishthita rose from his seat, knelt with his right knee on the ground",
        "source": "T14n0550_012:0893c23_0"
    },
    {
        "source_sentence": "合掌頂禮三白是言：「尊者！",
        "translation": "He joined his palms and bowed his head three times, saying, Venerable!",
        "source": "T14n0550_012:0893c25_1"
    },
    {
        "source_sentence": "我今獲覩如是勝相，非父、非母、非王、非天、非親屬朋友、非沙門婆羅門所能施作。",
        "translation": "Now, I've acquired such a superior characteristic that it's not the father, mother, king, god, relative, friend, or ascetic or brāhmaṇa who can give it to me.",
        "source": "T14n0550_012:0893c25_2"
    },
    {
        "source_sentence": "唯尊者悲心善救拔我，如我昔日以恩愛心泣淚如海，尊者神力枯涸愛源。」",
        "translation": "Only the Venerable's compassionate mind is able to rescue me, just as I did in the past, weeping with kindness like a sea of tears, and the Venerable's miraculous power dries up the source of",
        "source": "T14n0550_012:0893c27_3"
    },
    {
        "source_sentence": "「尊者已離生老死，　　天上人中皆供養，",
        "translation": "Venerable, you’ve parted with birth, old age, and death. All the gods and humans in heaven make offerings to you.",
        "source": "T14n0550_012:0893c29_4"
    },
    {
        "source_sentence": "　千生難得見聖尊，　　今見無虛勝果利。」",
        "translation": "It's difficult for a thousand sentient beings to see the noble honored one, but now they see the unsurpassed reward of nonfaithfulness.",
        "source": "T14n0550_012:0893c29_4"
    },
    {
        "source_sentence": "作是言已，說伽陀曰：時尊者阿難廣為一切諸來會眾，如應說法示教利喜。",
        "translation": "After he spoke these words, he said to Kātyāyana, At the time, Venerable Ānanda was teaching and benefiting all the people who came to the assembly as they should explain the teaching.",
        "source": "T14n0550_012:0893c29_4"
    },
    {
        "source_sentence": "作佛事已，會中無數百千天人，及王舍城一切大眾，咸發淨心歸命頂禮，",
        "translation": "After performing these buddha-works, countless hundreds of thousands of celestial beings and all the great assemblies in Rājagṛha paid homage with pure aspirations.",
        "source": "T14n0550_012:0894a04_5"
    },
    {
        "source_sentence": "作如是言：「我等今者各獲善利。」",
        "translation": "They said, Now, we'll each attain good benefits.",
        "source": "T14n0550_012:0894a05_6"
    },
    {
        "source_sentence": "言已，即時從座而起，出離會中。",
        "translation": "After he said this, he rose from his seat and left the assembly.",
        "source": "T14n0550_012:0894a06_7"
    },
    {
        "source_sentence": "金色童子因緣經卷第十二",
        "translation": "Sutra on the Causes and Conditions of the Golden-colored Boy, Volume 12",
        "source": "T14n0550_012:0894a08_0"
    }
]