[
    {
        "source_sentence": "維摩詰所說經卷下",
        "translation": "Second Fascicle of the Sutra Spoken by Vimalakīrti",
        "source": "T14n0475_003:0552a03_0"
    },
    {
        "source_sentence": "姚秦三藏鳩摩羅什譯",
        "translation": "Yaoqin Sanzang Kumārajīva Translation",
        "source": "T14n0475_003:0552a04_0"
    },
    {
        "source_sentence": "香積佛品第十",
        "translation": "10. The Tenth Chapter of the Buddha-Chapter on the Collection of Fragrance",
        "source": "T14n0475_003:0552a05_0"
    },
    {
        "source_sentence": "於是舍利弗心念：「日時欲至，此諸菩薩當於何食？」",
        "translation": "Śāriputra then thought to himself, Where will these bodhisattvas eat when the sun is about to come?",
        "source": "T14n0475_003:0552a06_0"
    },
    {
        "source_sentence": "時維摩詰知其意而語言：「佛說八解脫，仁者受行，豈雜欲食而聞法乎？",
        "translation": "Knowing what he meant, the Licchavi Vimalakīrti said, The Buddha taught the eight liberations, so how could you hear the teaching if you were to eat together with desire?",
        "source": "T14n0475_003:0552a07_1"
    },
    {
        "source_sentence": "若欲食者，且待須臾，當令汝得未曾有食。」",
        "translation": "If you want to eat, wait a moment and I will cause you to get an unprecedented amount of food.",
        "source": "T14n0475_003:0552a08_2"
    },
    {
        "source_sentence": "時維摩詰即入三昧，以神通力示諸大眾，上方界分過四十二恒河沙佛土，",
        "translation": "At that moment the Licchavi Vimalakīrti entered concentration and, through his supernatural powers, showed the great assembly of bhikṣus the buddha-lands beyond as many buddha-lands as there are sands in forty-two",
        "source": "T14n0475_003:0552a09_3"
    },
    {
        "source_sentence": "有國名眾香，佛號香積，今現在，其國香氣，比於十方諸佛世界人、天之香，",
        "translation": "There is a country called Sarvagandhasugandhā named after the Buddha, whose name is Sugandhakūṭa. The fragrance of this country now far surpasses that of all the buddha worlds and heavenly beings in the ten directions.",
        "source": "T14n0475_003:0552a11_4"
    },
    {
        "source_sentence": "最為第一。",
        "translation": "It's the most superior.",
        "source": "T14n0475_003:0552a13_5"
    },
    {
        "source_sentence": "彼土無有聲聞、辟支佛名，唯有清淨大菩薩眾，佛為說法。",
        "translation": "In that land there are no śrāvakas or pratyekabuddhas called śrāvakas and pratyekabuddhas but only the pure great bodhisattvas, for whom the Buddha teaches.",
        "source": "T14n0475_003:0552a13_6"
    },
    {
        "source_sentence": "其界一切，皆以香作樓閣，經行香地，苑園皆香，其食香氣，周流十方無量世界。",
        "translation": "All the worlds in those continents all made towers of fragrance, walking up and down on scented earth. The trees and parks were all filled with fragrance, and their food and odors pervaded measureless worlds in the ten direction",
        "source": "T14n0475_003:0552a14_7"
    },
    {
        "source_sentence": "時彼佛與諸菩薩方共坐食，有諸天子皆號香嚴，悉發阿耨多羅三藐三菩提心，",
        "translation": "The Buddha and the bodhisattvas then sat down to eat together, and some celestial beings called themselves fragrant adornments all aroused the mind of unexcelled complete perfect enlightenment.",
        "source": "T14n0475_003:0552a16_8"
    },
    {
        "source_sentence": "供養彼佛及諸菩薩，此諸大眾莫不目見。",
        "translation": "To make offerings to those buddhas and bodhisattvas, the masses here all saw them with their eyes.",
        "source": "T14n0475_003:0552a18_9"
    },
    {
        "source_sentence": "時維摩詰問眾菩薩言：「諸仁者！",
        "translation": "Vimalakīrti then asked the bodhisattvas, Gentlemen!",
        "source": "T14n0475_003:0552a19_10"
    },
    {
        "source_sentence": "誰能致彼佛飯？」",
        "translation": "Who will be able to bring that Buddha's food?",
        "source": "T14n0475_003:0552a20_11"
    },
    {
        "source_sentence": "以文殊師利威神力故，咸皆默然。",
        "translation": "Because of the authoritative power of Mañjuśrī, they all remained silent.",
        "source": "T14n0475_003:0552a20_12"
    },
    {
        "source_sentence": "維摩詰言：「仁此大眾，無乃可恥？」",
        "translation": "Vimalakīrti said, Sir, there's nothing to be ashamed of in this crowd?",
        "source": "T14n0475_003:0552a21_13"
    },
    {
        "source_sentence": "文殊師利曰：「如佛所言，勿輕未學。」",
        "translation": "Mañjuśrī said, Just as the Buddha said, don't despise someone who hasn't studied.",
        "source": "T14n0475_003:0552a22_14"
    },
    {
        "source_sentence": "於是維摩詰不起于座，居眾會前，化作菩薩，相好光明，威德殊勝，蔽於眾會，",
        "translation": "Then the Licchavi Vimalakīrti, not rising from his seat but remaining in front of the assembly, magically transformed himself into an enlightening being with distinctive characteristics and rays of light whose majesty surpass",
        "source": "T14n0475_003:0552a23_15"
    },
    {
        "source_sentence": "而告之曰：「汝往上方界分，度如四十二恒河沙佛土，有國名眾香，佛號香積，",
        "translation": "He told them, “Go up to the higher boundary and cross over as many buddha-lands as there are sands in forty-two Ganges rivers. There is a land called Sangha fragrance (Skt. sangha).",
        "source": "T14n0475_003:0552a25_16"
    },
    {
        "source_sentence": "與諸菩薩方共坐食。",
        "translation": "He and the bodhisattvas then sat down to eat together.",
        "source": "T14n0475_003:0552a26_17"
    },
    {
        "source_sentence": "汝往到彼，如我辭曰：『維摩詰稽首世尊足下！",
        "translation": "Go and go there, just as I said, 'The Licchavi Vimalakīrti bowed down at the feet of the Bhagavān!'",
        "source": "T14n0475_003:0552a27_18"
    },
    {
        "source_sentence": "致敬無量，問訊起居，少病少惱，氣力安不？",
        "translation": "Their respect is immeasurable. They greet each other and bow their respects to them. Are you feeling well, with little illness or discomfort?",
        "source": "T14n0475_003:0552a28_19"
    },
    {
        "source_sentence": "願得世尊所食之餘，當於娑婆世界施作佛事，令此樂小法者得弘大道，",
        "translation": "May the World-honored One give whatever else he needs for his food to perform buddha-works in the sahā world, so that those who delight in lesser teachings may attain great enlightenment.",
        "source": "T14n0475_003:0552a29_20"
    },
    {
        "source_sentence": "亦使如來名聲普聞。』」",
        "translation": "It also causes the Tathāgata's name to be heard everywhere.'",
        "source": "T14n0475_003:0552b02_21"
    },
    {
        "source_sentence": "時化菩薩即於會前，昇于上方，舉眾皆見其去，到眾香界，禮彼佛足，",
        "translation": "The apparitional bodhisattva then ascended to the top of the mountain in front of the assembly. All the members of the assembly saw him leave, and when they arrived at the realm of fragrance they bowed at the Buddha’s",
        "source": "T14n0475_003:0552b02_22"
    },
    {
        "source_sentence": "又聞其言：「維摩詰稽首世尊足下！",
        "translation": "Again, he heard him say, Vimalakīrti bowed his head at the feet of the Bhagavān!",
        "source": "T14n0475_003:0552b04_23"
    },
    {
        "source_sentence": "致敬無量，問訊起居，少病少惱，氣力安不？",
        "translation": "Their respect is immeasurable. They greet each other and bow their respects to them. Are you feeling well, with little illness or discomfort?",
        "source": "T14n0475_003:0552b05_24"
    },
    {
        "source_sentence": "願得世尊所食之餘，欲於娑婆世界施作佛事，使此樂小法者得弘大道，",
        "translation": "“May the World-honored One give whatever he needs for food to perform buddha-works in the world of Sāvatthī, so that those who delight in lesser doctrines may attain great enlightenment.",
        "source": "T14n0475_003:0552b06_25"
    },
    {
        "source_sentence": "亦使如來名聲普聞。」",
        "translation": "It also causes the Tathāgata's name to be heard everywhere.",
        "source": "T14n0475_003:0552b07_26"
    },
    {
        "source_sentence": "彼諸大士見化菩薩，歎未曾有：「今此上人從何所來？",
        "translation": "When those great men saw the transformation bodhisattva, they marveled at what had never happened before, Where did this person come from?",
        "source": "T14n0475_003:0552b08_27"
    },
    {
        "source_sentence": "娑婆世界為在何許？",
        "translation": "Where is the sahā world?",
        "source": "T14n0475_003:0552b09_28"
    },
    {
        "source_sentence": "云何名為樂小法者？」",
        "translation": "What's called a person who enjoys the lesser teaching?",
        "source": "T14n0475_003:0552b10_29"
    },
    {
        "source_sentence": "即以問佛。",
        "translation": "He then asked the Buddha.",
        "source": "T14n0475_003:0552b10_30"
    },
    {
        "source_sentence": "佛告之曰：「下方度如四十二恒河沙佛土，有世界名娑婆，佛號釋迦牟尼，",
        "translation": "The Buddha said to them, “There are buddha-lands as numerous as the grains of sand in forty-two Ganges Rivers; there is a world called Sahā (i.e., Jambudvīpa), where the Buddha Śākyamuni lives",
        "source": "T14n0475_003:0552b10_31"
    },
    {
        "source_sentence": "今現在。",
        "translation": "Now, it's present.",
        "source": "T14n0475_003:0552b12_32"
    },
    {
        "source_sentence": "於五濁惡世，為樂小法眾生敷演道教；",
        "translation": "In the troubled world of the five corruptions, they develop and expound the Teaching for the sake of sentient beings who delight in inferior doctrines.",
        "source": "T14n0475_003:0552b12_33"
    },
    {
        "source_sentence": "彼有菩薩名維摩詰，住不可思議解脫，為諸菩薩說法，故遣化來，稱揚我名，",
        "translation": "There was an enlightening being there named Vimalakīrti, who lived in inconceivable liberation and taught the Dharma to those enlightening beings.",
        "source": "T14n0475_003:0552b13_34"
    },
    {
        "source_sentence": "并讚此土，令彼菩薩增益功德。」",
        "translation": "They praise this land and cause the bodhisattvas to increase their merit.",
        "source": "T14n0475_003:0552b15_35"
    },
    {
        "source_sentence": "彼菩薩言：「其人何如，乃作是化？",
        "translation": "The bodhisattva said, What's the way that person does this transformation?",
        "source": "T14n0475_003:0552b16_36"
    },
    {
        "source_sentence": "德力無畏，神足若斯！」",
        "translation": "Their virtue, power, and fearlessness are like the miraculous abilities!",
        "source": "T14n0475_003:0552b17_0"
    },
    {
        "source_sentence": "佛言：「甚大！",
        "translation": "The Buddha said, Very great!",
        "source": "T14n0475_003:0552b17_1"
    },
    {
        "source_sentence": "一切十方皆遣化往，施作佛事，饒益眾生。」",
        "translation": "All the people in the ten directions are sent and transformed to perform buddha-works to benefit sentient beings.",
        "source": "T14n0475_003:0552b17_2"
    },
    {
        "source_sentence": "於是香積如來以眾香鉢盛滿香飯，與化菩薩。",
        "translation": "The Tathāgata of Fragrance then filled his incense bowl with a large amount of fragrant rice and gave it to the transformation bodhisattva.",
        "source": "T14n0475_003:0552b18_3"
    },
    {
        "source_sentence": "時彼九百萬菩薩俱發聲言：「我欲詣娑婆世界供養釋迦牟尼佛，并欲見維摩詰等諸菩薩眾。」",
        "translation": "Nine million bodhisattvas then all spoke out, saying, I want to go to the sahā world to make offerings to Śākyamuni Buddha and want to see the bodhisattvas like Vimalakīrti.",
        "source": "T14n0475_003:0552b19_4"
    },
    {
        "source_sentence": "佛言：「可往。",
        "translation": "The Buddha said, You can go there.",
        "source": "T14n0475_003:0552b22_5"
    },
    {
        "source_sentence": "攝汝身香，無令彼諸眾生起惑著心。",
        "translation": "It collects the fragrance of your body and doesn't cause those sentient beings to become confused and attached.",
        "source": "T14n0475_003:0552b22_6"
    },
    {
        "source_sentence": "又當捨汝本形，勿使彼國求菩薩者，而自鄙恥。",
        "translation": "Also, you must abandon your original form and not allow those in other countries who seek bodhisattvahood to despise themselves.",
        "source": "T14n0475_003:0552b23_7"
    },
    {
        "source_sentence": "又汝於彼莫懷輕賤，而作礙想。",
        "translation": "Also, don't harbor despise them and create obstructive thoughts about them.",
        "source": "T14n0475_003:0552b24_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0475_003:0552b25_9"
    },
    {
        "source_sentence": "十方國土，皆如虛空。",
        "translation": "The lands in the ten directions are all like space.",
        "source": "T14n0475_003:0552b25_10"
    },
    {
        "source_sentence": "又諸佛為欲化諸樂小法者，不盡現其清淨土耳！」",
        "translation": "Furthermore, the buddhas don't show their pure land in full for those who want to teach the pleasures of the lesser Dharma!",
        "source": "T14n0475_003:0552b25_11"
    },
    {
        "source_sentence": "時化菩薩既受鉢飯，與彼九百萬菩薩俱，承佛威神，及維摩詰力，於彼世界，",
        "translation": "When the apparitional bodhisattva had accepted the bowl and food, he was accompanied by nine million other bodhisattvas. Influenced by the Buddha’s supernatural power and the power of the Licchavi Vimalakīr",
        "source": "T14n0475_003:0552b27_0"
    },
    {
        "source_sentence": "忽然不現，須臾之間，至維摩詰舍。",
        "translation": "Suddenly, he disappeared. In a moment' s time, he arrived at the house of Vimalakīrti.",
        "source": "T14n0475_003:0552b28_1"
    },
    {
        "source_sentence": "時維摩詰即化作九百萬師子之座，嚴好如前，諸菩薩皆坐其上。",
        "translation": "The Licchavi Vimalakīrti then magically created nine million lion seats, as beautifully arrayed as before, on which all the bodhisattvas were seated.",
        "source": "T14n0475_003:0552b29_2"
    },
    {
        "source_sentence": "是化菩薩以滿鉢香飯與維摩詰，飯香普熏毘耶離城，及三千大千世界。",
        "translation": "This transformation bodhisattva gave a bowl full of incense and rice to Vimalakīrti, and the fragrance of that rice permeated the city of Vaiśālī and 3,000 great one-thousand worlds.",
        "source": "T14n0475_003:0552c02_3"
    },
    {
        "source_sentence": "時毘耶離婆羅門、居士等，聞是香氣，身意快然，歎未曾有！",
        "translation": "When the Brāhmaṇas and householders of Vaiśālī heard this fragrance, their bodies and minds were overjoyed and praised it as unprecedented!",
        "source": "T14n0475_003:0552c03_4"
    },
    {
        "source_sentence": "於是長者主月蓋從八萬四千人，來入維摩詰舍。",
        "translation": "Then the householder Candracchattra, accompanied by eighty-four thousand people, entered the house of Vimalakīrti.",
        "source": "T14n0475_003:0552c05_5"
    },
    {
        "source_sentence": "見其室中菩薩甚多，諸師子座，高廣嚴好，皆大歡喜，禮眾菩薩及大弟子，",
        "translation": "Seeing that there were many enlightening beings in the room, all seated on lion seats high and wide and beautifully arrayed, they rejoiced greatly. They bowed to the host of enlightening beings and their great disc",
        "source": "T14n0475_003:0552c06_6"
    },
    {
        "source_sentence": "却住一面。",
        "translation": "He stayed to one side.",
        "source": "T14n0475_003:0552c08_0"
    },
    {
        "source_sentence": "諸地神、虛空神及欲、色界諸天，聞此香氣，亦皆來入維摩詰舍。",
        "translation": "When earth gods, space gods, and the gods of the desire realm and form realm heard this sound, they all came into the house of Vimalakīrti when they entered it.",
        "source": "T14n0475_003:0552c08_1"
    },
    {
        "source_sentence": "時維摩詰語舍利弗等諸大聲聞：「仁者可食，如來甘露味飯，大悲所熏，",
        "translation": "The Licchavi Vimalakīrti then said to Śāriputra and the other great śrāvakas, Good men, you may eat this delicious food of the Tathāgata’s ambrosia, which is perfumed by compassion.",
        "source": "T14n0475_003:0552c09_2"
    },
    {
        "source_sentence": "無以限意食之，使不消也。」",
        "translation": "There's no reason to eat it with a limited intention that won't be digested.",
        "source": "T14n0475_003:0552c11_3"
    },
    {
        "source_sentence": "有異聲聞念：「是飯少，而此大眾人人當食？」",
        "translation": "Some heretic śrāvakas thought, That's a little food, but will this crowd of people eat it?",
        "source": "T14n0475_003:0552c11_4"
    },
    {
        "source_sentence": "化菩薩曰：「勿以聲聞小德小智，稱量如來無量福慧！",
        "translation": "The transformation bodhisattva said, Don't use śrāvakas of little virtue and little wisdom to praise the Tathāgata's measureless merit and wisdom!",
        "source": "T14n0475_003:0552c12_5"
    },
    {
        "source_sentence": "四海有竭，此飯無盡！",
        "translation": "The four seas are inexhaustible, and this food has no limit!",
        "source": "T14n0475_003:0552c14_6"
    },
    {
        "source_sentence": "使一切人食，揣若須彌，乃至一劫，猶不能盡。",
        "translation": "It causes all people to eat, and they can't finish it even for an eon like Mount Sumeru.",
        "source": "T14n0475_003:0552c14_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0475_003:0552c15_8"
    },
    {
        "source_sentence": "無盡戒、定、智慧、解脫、解脫知見功德具足者，所食之餘，終不可盡。」",
        "translation": "If someone is fully endowed with the inexhaustible virtues of morality, concentration, wisdom, liberation, and the knowledge and vision of liberation, the rest of what they eat will never be exhausted.",
        "source": "T14n0475_003:0552c15_9"
    },
    {
        "source_sentence": "於是鉢飯悉飽眾會，猶故不[歹*斯]。",
        "translation": "The bowls and rice were then all full for the assembly, but they still didn't [ghostly*s].",
        "source": "T14n0475_003:0552c17_10"
    },
    {
        "source_sentence": "其諸菩薩、聲聞、天、人，食此飯者，身安快樂，譬如一切樂莊嚴國諸菩薩也；",
        "translation": "Those bodhisattvas, śrāvakas, devas, and humans who eat this food will be physically at ease, just like all the enlightening beings in the land of blissful adornment.",
        "source": "T14n0475_003:0552c18_11"
    },
    {
        "source_sentence": "又諸毛孔皆出妙香，亦如眾香國土諸樹之香。",
        "translation": "It also emits a wonderful fragrance from all its hair pores, just like the fragrance of many fragrant trees and trees in the land.",
        "source": "T14n0475_003:0552c19_12"
    },
    {
        "source_sentence": "爾時維摩詰問眾香菩薩：「香積如來以何說法？」",
        "translation": "It was then that the Licchavi Vimalakīrti asked the fragrant bodhisattva, Where did the Tathāgata Sugandhakūṭa teach?",
        "source": "T14n0475_003:0552c21_0"
    },
    {
        "source_sentence": "彼菩薩曰：「我土如來無文字說，但以眾香令諸天、人得入律行。",
        "translation": "The bodhisattva said, In my land, the Tathāgata doesn't speak words but uses various fragrances to cause gods and humans to enter into the precepts.",
        "source": "T14n0475_003:0552c22_1"
    },
    {
        "source_sentence": "菩薩各各坐香樹下，聞斯妙香，即獲一切德藏三昧。",
        "translation": "Each of the bodhisattvas sat under an incense tree and smelled this wonderful fragrance, which caused them to attain the samādhi of the store of all virtues.",
        "source": "T14n0475_003:0552c23_2"
    },
    {
        "source_sentence": "得是三昧者，菩薩所有功德皆悉具足。」",
        "translation": "Attaining this concentration, the bodhisattva's merits are fully present.",
        "source": "T14n0475_003:0552c24_3"
    },
    {
        "source_sentence": "彼諸菩薩問維摩詰：「今世尊釋迦牟尼以何說法？」",
        "translation": "The bodhisattvas asked Vimalakīrti, Now, Bhagavān, what is the teaching of Śākyamuni?",
        "source": "T14n0475_003:0552c25_4"
    },
    {
        "source_sentence": "維摩詰言：「此土眾生剛強難化，故佛為說剛強之語以調伏之。",
        "translation": "Vimalakīrti said, Because the sentient beings in this land are so rigid and difficult to be transformed, the Buddha speaks strong words for them to tame them.",
        "source": "T14n0475_003:0552c26_5"
    },
    {
        "source_sentence": "言是地獄、是畜生、是餓鬼，是諸難處，是愚人生處；",
        "translation": "They say, “This is hell, this is an animal, this is a hungry ghost. This is the place where there are difficulties and these are the places where ignorant people live.",
        "source": "T14n0475_003:0552c28_6"
    },
    {
        "source_sentence": "是身邪行，是身邪行報；",
        "translation": "This is bodily misconduct, which is the retribution of bodily misconduct.",
        "source": "T14n0475_003:0552c29_7"
    },
    {
        "source_sentence": "是口邪行，是口邪行報；",
        "translation": "Bad verbal action is the retribution of bad verbal action.",
        "source": "T14n0475_003:0552c29_8"
    },
    {
        "source_sentence": "是意邪行，是意邪行報；",
        "translation": "This is mental misconduct; this is the retribution for mental misconduct.",
        "source": "T14n0475_003:0553a01_9"
    },
    {
        "source_sentence": "是殺生，是殺生報；",
        "translation": "Taking life is the retribution for taking life.",
        "source": "T14n0475_003:0553a01_10"
    },
    {
        "source_sentence": "是不與取，是不與取報；",
        "translation": "What is not given is grasped, and what is not given is the retribution for grasping.",
        "source": "T14n0475_003:0553a02_11"
    },
    {
        "source_sentence": "是邪婬，是邪婬報；",
        "translation": "This is sexual misconduct, which is the retribution of sexual misconduct.",
        "source": "T14n0475_003:0553a02_12"
    },
    {
        "source_sentence": "是妄語，是妄語報；",
        "translation": "This is false speech, and this is the retribution of false speech.",
        "source": "T14n0475_003:0553a03_13"
    },
    {
        "source_sentence": "是兩舌，是兩舌報；",
        "translation": "This is backbiting, the retribution of backbiting.",
        "source": "T14n0475_003:0553a03_14"
    },
    {
        "source_sentence": "是惡口，是惡口報；",
        "translation": "This is harsh speech, which is the retribution of harsh speech.",
        "source": "T14n0475_003:0553a04_15"
    },
    {
        "source_sentence": "是無義語，是無義語報；",
        "translation": "This is meaningless speech, and this is the retribution of meaningless speech.",
        "source": "T14n0475_003:0553a04_16"
    },
    {
        "source_sentence": "是貪嫉，是貪嫉報；",
        "translation": "This is greed and jealousy; this is the retribution of greed and jealousy.",
        "source": "T14n0475_003:0553a05_17"
    },
    {
        "source_sentence": "是瞋惱，是瞋惱報；",
        "translation": "Anger is the retribution for anger.",
        "source": "T14n0475_003:0553a05_18"
    },
    {
        "source_sentence": "是邪見，是邪見報；",
        "translation": "This is wrong view and this is the retribution of wrong view.",
        "source": "T14n0475_003:0553a05_19"
    },
    {
        "source_sentence": "是慳悋，是慳悋報；",
        "translation": "This is the retribution of being stingy and greedy.",
        "source": "T14n0475_003:0553a06_20"
    },
    {
        "source_sentence": "是毀戒，是毀戒報；",
        "translation": "Disparaging the precepts is the retribution for disparaging the precepts.",
        "source": "T14n0475_003:0553a06_21"
    },
    {
        "source_sentence": "是瞋恚，是瞋恚報；",
        "translation": "This is retribution for hatred.",
        "source": "T14n0475_003:0553a07_22"
    },
    {
        "source_sentence": "是懈怠，是懈怠報；",
        "translation": "Laziness is the retribution of laziness.",
        "source": "T14n0475_003:0553a07_23"
    },
    {
        "source_sentence": "是亂意，是亂意報；",
        "translation": "Distraction is the retribution of distraction.",
        "source": "T14n0475_003:0553a07_24"
    },
    {
        "source_sentence": "是愚癡，是愚癡報；",
        "translation": "This is ignorance, which is the retribution of ignorance.",
        "source": "T14n0475_003:0553a08_25"
    },
    {
        "source_sentence": "是結戒，是持戒，是犯戒；",
        "translation": "This is the precept of restraint, this is the precept of keeping, and this is the precept of transgression.",
        "source": "T14n0475_003:0553a08_26"
    },
    {
        "source_sentence": "是應作，是不應作；",
        "translation": "This should be done and that which should not be done.",
        "source": "T14n0475_003:0553a09_27"
    },
    {
        "source_sentence": "是障礙，是不障礙；",
        "translation": "This is an obstruction, but it is not an obstruction.",
        "source": "T14n0475_003:0553a09_28"
    },
    {
        "source_sentence": "是得罪，是離罪；",
        "translation": "This is acquiring blameworthiness, and that is getting rid of blameworthiness.",
        "source": "T14n0475_003:0553a10_29"
    },
    {
        "source_sentence": "是淨，是垢；",
        "translation": "This is purity and that is filth.",
        "source": "T14n0475_003:0553a10_30"
    },
    {
        "source_sentence": "是有漏，是無漏；",
        "translation": "What is pure is impure, and what is pure.",
        "source": "T14n0475_003:0553a10_31"
    },
    {
        "source_sentence": "是邪道，是正道；",
        "translation": "This is wrong path and this is right path.",
        "source": "T14n0475_003:0553a11_32"
    },
    {
        "source_sentence": "是有為，是無為；",
        "translation": "Conditioned things are conditioned, but unconditioned things are conditioned.",
        "source": "T14n0475_003:0553a11_33"
    },
    {
        "source_sentence": "是世間，是涅槃。",
        "translation": "This is the world, and this is nirvāṇa.",
        "source": "T14n0475_003:0553a11_34"
    },
    {
        "source_sentence": "以難化之人，心如猨猴，故以若干種法，制御其心，乃可調伏。",
        "translation": "Because the minds of those who are difficult to convert are like a rhesus monkey, they can be disciplined by controlling their minds in various ways.",
        "source": "T14n0475_003:0553a12_35"
    },
    {
        "source_sentence": "譬如象馬，[怡-台+龍]悷不調，加諸楚毒，乃至徹骨，然後調伏。",
        "translation": "It's like an elephant or horse that doesn't regulate its movement, and it adds pain and poison until it penetrates the bones and then subdues it.",
        "source": "T14n0475_003:0553a13_36"
    },
    {
        "source_sentence": "如是剛強難化眾生，故以一切苦切之言，乃可入律。」",
        "translation": "Thus, because it's so rigid and difficult to transform sentient beings, it's possible to enter the precepts with all painful words.",
        "source": "T14n0475_003:0553a14_37"
    },
    {
        "source_sentence": "彼諸菩薩聞說是已，皆曰：「未曾有也！",
        "translation": "When those bodhisattvas heard this, they all said, Never before!",
        "source": "T14n0475_003:0553a16_38"
    },
    {
        "source_sentence": "如世尊釋迦牟尼佛，隱其無量自在之力，乃以貧所樂法，度脫眾生；",
        "translation": "“Just as the buddha Śākyamuni Buddha, the World-honored One, by concealing his immeasurable power of freedom, liberated sentient beings from their poverty and destitution by means of the Dharma they cherished.",
        "source": "T14n0475_003:0553a16_39"
    },
    {
        "source_sentence": "斯諸菩薩亦能勞謙，以無量大悲，生是佛土。」",
        "translation": "These bodhisattvas can also laboriously and humbly give rise to this buddha land with measureless great compassion.",
        "source": "T14n0475_003:0553a18_40"
    },
    {
        "source_sentence": "維摩詰言：「此土菩薩於諸眾生大悲堅固，誠如所言。",
        "translation": "Vimalakīrti said, In this land, the bodhisattva's great compassion for sentient beings is resolute, and it's really as he said.",
        "source": "T14n0475_003:0553a19_41"
    },
    {
        "source_sentence": "然其一世饒益眾生，多於彼國百千劫行。",
        "translation": "In one lifetime, however, he benefited sentient beings for hundreds of thousands of eons in that country.",
        "source": "T14n0475_003:0553a20_42"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0475_003:0553a21_43"
    },
    {
        "source_sentence": "此娑婆世界有十事善法，諸餘淨土之所無有。",
        "translation": "This sahā world has ten good qualities that are found in all the other pure lands.",
        "source": "T14n0475_003:0553a22_44"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T14n0475_003:0553a23_45"
    },
    {
        "source_sentence": "以布施攝貧窮，以淨戒攝毀禁，以忍辱攝瞋恚，以精進攝懈怠，以禪定攝亂意，",
        "translation": "By means of generosity they subdue poverty; by means of pure morality they subdue immorality; by means of patience they subdue anger; by means of zeal they subdue laziness; by means of meditation they subdue",
        "source": "T14n0475_003:0553a23_46"
    },
    {
        "source_sentence": "以智慧攝愚癡，說除難法度八難者，以大乘法度樂小乘者，以諸善根濟無德者，",
        "translation": "To those who by means of wisdom subdue folly and explain the eight difficulties to be overcome by removing the teachings that are difficult, to those who overcome the pleasures of the lesser vehicle with the teachings of the Great Vehicle, and to those",
        "source": "T14n0475_003:0553a25_47"
    },
    {
        "source_sentence": "常以四攝成就眾生，是為十。」",
        "translation": "These are the ten that always accomplish sentient beings by means of the four gathering in sentient beings.",
        "source": "T14n0475_003:0553a27_48"
    },
    {
        "source_sentence": "彼菩薩曰：「菩薩成就幾法？",
        "translation": "The bodhisattva said, How many things does a bodhisattva accomplish?",
        "source": "T14n0475_003:0553a28_49"
    },
    {
        "source_sentence": "於此世界行無瘡疣，生于淨土。」",
        "translation": "In this world, he walks without sores and warts and is born in the Pure Land.",
        "source": "T14n0475_003:0553a28_50"
    },
    {
        "source_sentence": "維摩詰言：「菩薩成就八法，於此世界行無瘡疣，生于淨土。",
        "translation": "Vimalakīrti said, A bodhisattva who accomplishes eight things and practices in this world without sores or warts will be born in the Pure Land.",
        "source": "T14n0475_003:0553a29_51"
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T14n0475_003:0553b01_52"
    },
    {
        "source_sentence": "饒益眾生，而不望報；",
        "translation": "They benefit sentient beings without expecting reward or reward.",
        "source": "T14n0475_003:0553b02_53"
    },
    {
        "source_sentence": "代一切眾生受諸苦惱，所作功德盡以施之；",
        "translation": "All sentient beings were saved from suffering and distress by giving all the virtues of their deeds.",
        "source": "T14n0475_003:0553b02_54"
    },
    {
        "source_sentence": "等心眾生，謙下無礙；",
        "translation": "Sentient beings of the same mind were humble and unobstructed.",
        "source": "T14n0475_003:0553b03_55"
    },
    {
        "source_sentence": "於諸菩薩視之如佛；",
        "translation": "They looked upon the enlightening beings as buddhas.",
        "source": "T14n0475_003:0553b04_56"
    },
    {
        "source_sentence": "所未聞經，聞之不疑；",
        "translation": "They had never heard a scripture before, and when they heard it they did not doubt it.",
        "source": "T14n0475_003:0553b04_57"
    },
    {
        "source_sentence": "不與聲聞而相違背；",
        "translation": "They do not disobey śrāvakas.",
        "source": "T14n0475_003:0553b05_58"
    },
    {
        "source_sentence": "不嫉彼供，不高己利，而於其中調伏其心；",
        "translation": "They are not jealous of their offerings and do not give up their own gains, yet they tame their minds toward those offerings.",
        "source": "T14n0475_003:0553b05_59"
    },
    {
        "source_sentence": "常省己過，不訟彼短，恒以一心求諸功德，是為八法。」",
        "translation": "Always reflecting on your own faults and not blaming their shortcomings, always singlemindedly seeking merit with one mind, these are the eight dharmas.",
        "source": "T14n0475_003:0553b06_60"
    },
    {
        "source_sentence": "維摩詰、文殊師利於大眾中說是法時，百千天、人皆發阿耨多羅三藐三菩提心，",
        "translation": "When the Licchavi Vimalakīrti and the crown prince Mañjuśrī had thus taught these teachings to the assembly, hundreds of thousands of gods and humans conceived the spirit of unexcelled, perfect enlighten",
        "source": "T14n0475_003:0553b08_61"
    },
    {
        "source_sentence": "十千菩薩得無生法忍。",
        "translation": "Ten thousand bodhisattvas attain the tolerance of the nonarising of the Dharma.",
        "source": "T14n0475_003:0553b10_62"
    },
    {
        "source_sentence": "維摩詰所說經菩薩行品第十一",
        "translation": "Chapter Eleven: The Bodhisattva Practices of the Scripture Spoken by Vimalakīrti",
        "source": "T14n0475_003:0553b11_0"
    },
    {
        "source_sentence": "是時佛說法於菴羅樹園，其地忽然廣博嚴事，一切眾會皆作金色。",
        "translation": "When the Buddha preached the Dharma in the mango grove, the ground suddenly became so vast and magnificent that all the congregations at the assembly were all made of gold.",
        "source": "T14n0475_003:0553b12_0"
    },
    {
        "source_sentence": "阿難白佛言：「世尊！",
        "translation": "Ānanda said to the Buddha, Bhagavān!",
        "source": "T14n0475_003:0553b13_1"
    },
    {
        "source_sentence": "以何因緣，有此瑞應？",
        "translation": "What are the causes and conditions for this miraculous response?",
        "source": "T14n0475_003:0553b14_0"
    },
    {
        "source_sentence": "是處忽然廣博嚴事，一切眾會皆作金色。」",
        "translation": "Suddenly, this place is vast and extensive, and all the assemblies are made of gold.",
        "source": "T14n0475_003:0553b14_1"
    },
    {
        "source_sentence": "佛告阿難：「是維摩詰、文殊師利，與諸大眾恭敬圍繞，發意欲來，故先為此瑞應。」",
        "translation": "The Buddha told Ānanda, It's because Vimalakīrti and Mañjuśrī were surrounded by the crowd of people with respect and desire to come, so they first responded to this auspicious sign.",
        "source": "T14n0475_003:0553b15_2"
    },
    {
        "source_sentence": "於是維摩詰語文殊師利：「可共見佛，與諸菩薩禮事供養。」",
        "translation": "The Licchavi Vimalakīrti then said to Mañjuśrī, Let's see the Buddha together and venerate and make offerings to the bodhisattvas.",
        "source": "T14n0475_003:0553b17_3"
    },
    {
        "source_sentence": "文殊師利言：「善哉！",
        "translation": "Mañjuśrī said, Good!",
        "source": "T14n0475_003:0553b18_4"
    },
    {
        "source_sentence": "行矣！",
        "translation": "It's done!",
        "source": "T14n0475_003:0553b19_5"
    },
    {
        "source_sentence": "今正是時。」",
        "translation": "Now is the right time.",
        "source": "T14n0475_003:0553b19_6"
    },
    {
        "source_sentence": "維摩詰即以神力，持諸大眾并師子座，置於右掌，往詣佛所。",
        "translation": "The Licchavi Vimalakīrti then, using his supernatural powers, took the great assembly of bhikṣus and the lion seat in his right hand and went to the place where the Buddha was.",
        "source": "T14n0475_003:0553b19_7"
    },
    {
        "source_sentence": "到已著地，稽首佛足，右遶七匝，一心合掌，在一面立；",
        "translation": "Having arrived there, he touched the ground and bowed his head at the Buddha’s feet. After circumambulating him seven times to his right, he joined his palms in unison and stood to one side.",
        "source": "T14n0475_003:0553b20_8"
    },
    {
        "source_sentence": "其諸菩薩即皆避座，稽首佛足，亦繞七匝，於一面立；",
        "translation": "The enlightening beings then all withdrew from their seats, bowed at the Buddha’s feet, also circumambulated him seven times, and stood to one side.",
        "source": "T14n0475_003:0553b22_9"
    },
    {
        "source_sentence": "諸大弟子、釋、梵、四天王等，亦皆避座，稽首佛足，在一面立。",
        "translation": "The great disciples, the Śākyamunis, Brahmās, and the four heavenly kings all avoided their seats, bowed their heads at the Buddha's feet, and stood to one side.",
        "source": "T14n0475_003:0553b23_10"
    },
    {
        "source_sentence": "於是世尊如法慰問諸菩薩已，各令復坐，即皆受教。",
        "translation": "The Bhagavān then comforted the bodhisattvas in accordance with the teaching, caused them to each return to their seats, and they all accepted the teaching.",
        "source": "T14n0475_003:0553b24_11"
    },
    {
        "source_sentence": "眾坐已定，佛語舍利弗：「汝見菩薩大士，自在神力之所為乎？」",
        "translation": "After the crowd had settled, the Buddha said to Śāriputra, Do you see what the bodhisattva-mahāsattva does with his unimpeded supernormal powers?",
        "source": "T14n0475_003:0553b25_12"
    },
    {
        "source_sentence": "「唯然，已見！」",
        "translation": "Yes, I've seen it!",
        "source": "T14n0475_003:0553b27_13"
    },
    {
        "source_sentence": "「於汝意云何？」",
        "translation": "What do you think?",
        "source": "T14n0475_003:0553b27_14"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T14n0475_003:0553b27_15"
    },
    {
        "source_sentence": "我覩其為不可思議，非意所圖，非度所測。」",
        "translation": "I see that it's inconceivable, not intended by my mind or fathomed by me.",
        "source": "T14n0475_003:0553b28_16"
    },
    {
        "source_sentence": "爾時阿難白佛言：「世尊！",
        "translation": "It was then that Ānanda said to the Buddha, Bhagavān!",
        "source": "T14n0475_003:0553b29_17"
    },
    {
        "source_sentence": "今所聞香，自昔未有，是為何香？」",
        "translation": "What's the fragrance we've heard now that hasn't existed since the distant past?",
        "source": "T14n0475_003:0553b29_18"
    },
    {
        "source_sentence": "佛告阿難：「是彼菩薩毛孔之香。」",
        "translation": "The Buddha told Ānanda, This is the fragrance of that bodhisattva's pores.",
        "source": "T14n0475_003:0553c01_19"
    },
    {
        "source_sentence": "於是舍利弗語阿難言：「我等毛孔亦出是香。」",
        "translation": "Śāriputra then said to Ānanda, That's the fragrance that emanates from our pores.",
        "source": "T14n0475_003:0553c02_20"
    },
    {
        "source_sentence": "阿難言：「此所從來？」",
        "translation": "Ānanda said, Where did this come from?",
        "source": "T14n0475_003:0553c03_21"
    },
    {
        "source_sentence": "曰：「是長者維摩詰，從眾香國，取佛餘飯，於舍食者，一切毛孔皆香若此。」",
        "translation": "He said, This is the elder Vimalakīrti who took the rest of the Buddha's food from the land of many fragrant countries and ate it in his dwelling, and all his pores are as fragrant as these.",
        "source": "T14n0475_003:0553c03_22"
    },
    {
        "source_sentence": "阿難問維摩詰：「是香氣住當久如？」",
        "translation": "Ānanda asked Vimalakīrti, How long will this fragrance stay?",
        "source": "T14n0475_003:0553c05_23"
    },
    {
        "source_sentence": "維摩詰言：「至此飯消。」",
        "translation": "Vimalakīrti said, When he arrived here, the rice disappeared.",
        "source": "T14n0475_003:0553c06_24"
    },
    {
        "source_sentence": "曰：「此飯久如當消？」",
        "translation": "He said, How long will this food be digested?",
        "source": "T14n0475_003:0553c06_25"
    },
    {
        "source_sentence": "曰：「此飯勢力至于七日，然後乃消。",
        "translation": "He said, “The power of this food lasts for seven days and then disappears.",
        "source": "T14n0475_003:0553c07_26"
    },
    {
        "source_sentence": "又阿難！",
        "translation": "Again, Ānanda!",
        "source": "T14n0475_003:0553c07_27"
    },
    {
        "source_sentence": "若聲聞人未入正位，食此飯者，得入正位，然後乃消；",
        "translation": "If a śrāvaka has not entered the proper state but eats this food, he will enter the proper state and after that it will be digested.",
        "source": "T14n0475_003:0553c08_28"
    },
    {
        "source_sentence": "已入正位，食此飯者，得心解脫，然後乃消；",
        "translation": "Those who have entered the proper state and eat this food will attain mental liberation, and after that it will be digested.",
        "source": "T14n0475_003:0553c09_29"
    },
    {
        "source_sentence": "若未發大乘意，食此飯者，至發意乃消；",
        "translation": "Those who have not yet undertaken the determination for the Great Vehicle and eat this food will be eliminated as soon as they have undertaken it.",
        "source": "T14n0475_003:0553c10_30"
    },
    {
        "source_sentence": "已發意食此飯者，得無生忍，然後乃消；",
        "translation": "Those who have already decided to eat this food will attain the tolerance of nonproduction, and it will be digested after that.",
        "source": "T14n0475_003:0553c11_31"
    },
    {
        "source_sentence": "已得無生忍，食此飯者，至一生補處，然後乃消。",
        "translation": "Having attained the tolerance of nonproduction, he eats this rice and goes to a place where he'll be reborn for one lifetime before it disappears.",
        "source": "T14n0475_003:0553c12_32"
    },
    {
        "source_sentence": "譬如有藥，名曰上味，其有服者，身諸毒滅，然後乃消。",
        "translation": "Good man, it is analogous to the case of a medicine called “excellent taste.” If one were to take this medicine, the poison would be eliminated in his body but not before it disappeared.",
        "source": "T14n0475_003:0553c13_33"
    },
    {
        "source_sentence": "此飯如是，滅除一切諸煩惱毒，然後乃消。」",
        "translation": "This rice is like this, which removes all the poison of the afflictions and then disappears.",
        "source": "T14n0475_003:0553c14_34"
    },
    {
        "source_sentence": "阿難白佛言：「未曾有也，世尊！",
        "translation": "Ānanda said to the Buddha, Never has it happened, Bhagavān!",
        "source": "T14n0475_003:0553c15_35"
    },
    {
        "source_sentence": "如此香飯能作佛事。」",
        "translation": "This kind of fragrant rice can perform buddha-works.",
        "source": "T14n0475_003:0553c16_36"
    },
    {
        "source_sentence": "佛言：「如是，如是！",
        "translation": "The Buddha said, So it is, so it is!",
        "source": "T14n0475_003:0553c16_37"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T14n0475_003:0553c17_38"
    },
    {
        "source_sentence": "或有佛土以佛光明而作佛事，有以諸菩薩而作佛事，有以佛所化人而作佛事，",
        "translation": "“Some buddha-lands accomplish buddha-work by means of the light of buddhas, some do buddha-work by means of enlightening beings, some do buddha-work by means of bodhisattvas, some do buddha-work by",
        "source": "T14n0475_003:0553c17_39"
    },
    {
        "source_sentence": "有以菩提樹而作佛事，有以佛衣服、臥具而作佛事，有以飯食而作佛事，",
        "translation": "Some did buddha-work with the tree of enlightenment; some did buddha-work with the robes and bedding of Buddha; some did buddha-work with food and drink; some did buddha-work with ornaments.",
        "source": "T14n0475_003:0553c19_40"
    },
    {
        "source_sentence": "有以園林臺觀而作佛事，有以三十二相、八十隨形好而作佛事，有以佛身而作佛事，",
        "translation": "Some do buddha-work by means of gardens, forests, terraces, and pavilions; some do buddha-work by means of the thirty-two marks and eighty secondary signs; some do buddha-work by means",
        "source": "T14n0475_003:0553c21_0"
    },
    {
        "source_sentence": "有以虛空而作佛事；",
        "translation": "Some do buddha-work by means of space.",
        "source": "T14n0475_003:0553c23_1"
    },
    {
        "source_sentence": "眾生應以此緣得入律行。",
        "translation": "Because of this condition, sentient beings should attain the practice of entry into the precepts.",
        "source": "T14n0475_003:0553c23_2"
    },
    {
        "source_sentence": "有以夢、幻、影、響、鏡中像、水中月、熱時炎，如是等喻而作佛事。",
        "translation": "Some people perform buddha-works with such metaphors as dreams, illusions, shadows, echoes, images in a mirror, the moon in water, and heat when it's hot.",
        "source": "T14n0475_003:0553c24_3"
    },
    {
        "source_sentence": "有以音聲、語言、文字而作佛事。",
        "translation": "Some do buddha-work with sounds, words, and words.",
        "source": "T14n0475_003:0553c25_4"
    },
    {
        "source_sentence": "或有清淨佛土、寂寞無言、無說、無示、無識、無作、無為，而作佛事。",
        "translation": "Sometimes there's a pure Buddha land, lonely, without words, without explanation, without indication, without consciousness, without action, and without doing anything, that does buddha-work.",
        "source": "T14n0475_003:0553c26_5"
    },
    {
        "source_sentence": "如是，阿難！",
        "translation": "So it is, Ānanda!",
        "source": "T14n0475_003:0553c27_6"
    },
    {
        "source_sentence": "諸佛威儀進止，諸所施為，無非佛事。",
        "translation": "The buddhas' deportment, advancement, and the things they give are nothing other than buddha-works.",
        "source": "T14n0475_003:0553c28_0"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T14n0475_003:0553c28_1"
    },
    {
        "source_sentence": "有此四魔，八萬四千諸煩惱門，而諸眾生為之疲勞，諸佛即以此法而作佛事，",
        "translation": "These four Māras have these eighty-four thousand kinds of defilement, and sentient beings are tormented by them. The buddhas do buddha-work in this way:",
        "source": "T14n0475_003:0553c29_0"
    },
    {
        "source_sentence": "是名入一切諸佛法門。",
        "translation": "This is called entering all the buddhas' teachings.",
        "source": "T14n0475_003:0554a01_1"
    },
    {
        "source_sentence": "菩薩入此門者，若見一切淨好佛土，不以為喜，不貪不高；",
        "translation": "“When enlightening beings enter this door, if they see all the pure and beautiful buddha-lands, they do not rejoice or crave them.",
        "source": "T14n0475_003:0554a02_2"
    },
    {
        "source_sentence": "若見一切不淨佛土，不以為憂，不礙不沒；",
        "translation": "If they see all the impure buddha-lands, they do not think of them as sorrow; they are not obstructed or disturbed.",
        "source": "T14n0475_003:0554a03_3"
    },
    {
        "source_sentence": "但於諸佛生清淨心，歡喜恭敬，未曾有也！",
        "translation": "They simply give rise to a pure mind of reverence and respect for the buddhas, rejoicing and honoring them as never before!",
        "source": "T14n0475_003:0554a04_4"
    },
    {
        "source_sentence": "諸佛如來功德平等！",
        "translation": "The merits of the buddha-tathāgatas are equal!",
        "source": "T14n0475_003:0554a05_5"
    },
    {
        "source_sentence": "為化眾生故，而現佛土不同。",
        "translation": "In order to transform sentient beings, they manifest different buddha-lands.",
        "source": "T14n0475_003:0554a06_6"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T14n0475_003:0554a07_7"
    },
    {
        "source_sentence": "汝見諸佛國土，地有若干，而虛空無若干也；",
        "translation": "You see that in the buddha-lands there are many different kinds of earth, but space has no different kind.",
        "source": "T14n0475_003:0554a07_8"
    },
    {
        "source_sentence": "如是見諸佛色身有若干耳，其無礙慧無若干也。",
        "translation": "Thus, they see that the form bodies of the buddhas have certain parts, and their unhindered wisdom has no different parts.",
        "source": "T14n0475_003:0554a08_9"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T14n0475_003:0554a09_10"
    },
    {
        "source_sentence": "諸佛色身、威相、種性，戒、定、智慧、解脫、解脫知見，力、無所畏、不共之法、大慈、大悲，",
        "translation": "The buddhas have form bodies, mighty characteristics, and seed natures, morality, concentration, wisdom, liberation, knowledge and vision of liberation, power, fearlessness, unique qualities, great kindness, great compassion, great com",
        "source": "T14n0475_003:0554a09_11"
    },
    {
        "source_sentence": "威儀所行，及其壽命，說法教化，成就眾生，淨佛國土，具諸佛法，悉皆同等，",
        "translation": "Their deportment, their conduct, their duration of life, and the teachings they teach enable them to develop sentient beings. They purify buddha-lands and embody all the qualities of buddhahood equally.",
        "source": "T14n0475_003:0554a11_12"
    },
    {
        "source_sentence": "是故名為三藐三佛陀，名為多陀阿伽度，名為佛陀。",
        "translation": "That's why it's called samyak-saṃbuddha, which is called the tathāgatagarbha and is called buddha.",
        "source": "T14n0475_003:0554a13_13"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T14n0475_003:0554a14_14"
    },
    {
        "source_sentence": "若我廣說此三句義，汝以劫壽，不能盡受；",
        "translation": "If I were to explain in detail the meaning of these three phrases, you would be unable to receive them all for an eon.",
        "source": "T14n0475_003:0554a14_15"
    },
    {
        "source_sentence": "正使三千大千世界滿中眾生，皆如阿難多聞第一，得念總持，此諸人等，",
        "translation": "The sentient beings who fill the great manifold cosmos are all like Ānanda, foremost in learning and at the foremost in memory.",
        "source": "T14n0475_003:0554a15_16"
    },
    {
        "source_sentence": "以劫之壽，亦不能受。",
        "translation": "For the duration of an kalpa, they can't receive it either.",
        "source": "T14n0475_003:0554a17_17"
    },
    {
        "source_sentence": "如是，阿難！",
        "translation": "So it is, Ānanda!",
        "source": "T14n0475_003:0554a17_18"
    },
    {
        "source_sentence": "諸佛阿耨多羅三藐三菩提，無有限量，智慧辯才不可思議。」",
        "translation": "The buddhas' unsurpassed, correct, and complete enlightenment has no limit, and their wisdom and eloquence are inconceivable.",
        "source": "T14n0475_003:0554a17_19"
    },
    {
        "source_sentence": "阿難白佛言：「我從今已往，不敢自謂以為多聞。」",
        "translation": "Ānanda said to the Buddha, From now on, I won't dare to claim to be well-versed.",
        "source": "T14n0475_003:0554a19_20"
    },
    {
        "source_sentence": "佛告阿難：「勿起退意！",
        "translation": "The Buddha told Ānanda, Don't retreat!",
        "source": "T14n0475_003:0554a20_21"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0475_003:0554a20_22"
    },
    {
        "source_sentence": "我說汝於聲聞中為最多聞，非謂菩薩。",
        "translation": "I say you're the most learned among śrāvakas, not bodhisattvas.",
        "source": "T14n0475_003:0554a21_23"
    },
    {
        "source_sentence": "且止，阿難！",
        "translation": "Come on, Ānanda!",
        "source": "T14n0475_003:0554a22_24"
    },
    {
        "source_sentence": "其有智者不應限度諸菩薩也；",
        "translation": "Those who are wise should not limit themselves to liberating enlightening beings.",
        "source": "T14n0475_003:0554a22_25"
    },
    {
        "source_sentence": "一切海淵尚可測量，菩薩禪定、智慧、總持、辯才一切功德不可量也。",
        "translation": "All the ocean's depths can still be measured, and all the merits of a bodhisattva's meditation, wisdom, absorption, and eloquence are immeasurable.",
        "source": "T14n0475_003:0554a23_26"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T14n0475_003:0554a24_27"
    },
    {
        "source_sentence": "汝等捨置菩薩所行，是維摩詰一時所現神通之力。",
        "translation": "You should abandon what you practice as bodhisattvas because it is the miraculous power of the one-pointed concentration shown by Vimalakīrti.",
        "source": "T14n0475_003:0554a24_28"
    },
    {
        "source_sentence": "一切聲聞、辟支佛於百千劫，盡力變化所不能作。」",
        "translation": "All śrāvakas and pratyekbuddhas can't do it for a hundred thousand eons with the power of transformation.",
        "source": "T14n0475_003:0554a26_0"
    },
    {
        "source_sentence": "爾時眾香世界菩薩來者，合掌白佛言：「世尊！",
        "translation": "It was then that the bodhisattva coming from the world of myriad fragrances joined his palms and said to the Buddha, Bhagavān!",
        "source": "T14n0475_003:0554a28_0"
    },
    {
        "source_sentence": "我等初見此土，生下劣想，今自悔責，捨離是心。",
        "translation": "When we first saw this land, we gave rise to the idea of inferiority. We now repent and forsake this thought.",
        "source": "T14n0475_003:0554a29_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0475_003:0554b01_1"
    },
    {
        "source_sentence": "諸佛方便，不可思議！",
        "translation": "The buddhas' skillful means are inconceivable!",
        "source": "T14n0475_003:0554b01_2"
    },
    {
        "source_sentence": "為度眾生故，隨其所應，現佛國異。",
        "translation": "In order to save sentient beings, he manifested the differences in the Buddha's land according to their needs.",
        "source": "T14n0475_003:0554b01_3"
    },
    {
        "source_sentence": "唯然世尊！",
        "translation": "Yes, Bhagavān!",
        "source": "T14n0475_003:0554b02_4"
    },
    {
        "source_sentence": "願賜少法，還於彼土，當念如來。」",
        "translation": "May I bestow a little teaching, return to that land, and think of the Tathāgata.",
        "source": "T14n0475_003:0554b02_5"
    },
    {
        "source_sentence": "佛告諸菩薩：「有盡無盡解脫法門，汝等當學。",
        "translation": "The Buddha told the bodhisattvas, There's an endless and inexhaustible liberation dharma-gate that you should study.",
        "source": "T14n0475_003:0554b03_6"
    },
    {
        "source_sentence": "何謂為盡？",
        "translation": "What's meant by exhaustion?",
        "source": "T14n0475_003:0554b04_7"
    },
    {
        "source_sentence": "謂有為法；",
        "translation": "Conditioned things are conditioned.",
        "source": "T14n0475_003:0554b05_8"
    },
    {
        "source_sentence": "何謂無盡？",
        "translation": "What's meant by inexhaustible?",
        "source": "T14n0475_003:0554b05_9"
    },
    {
        "source_sentence": "謂無為法。",
        "translation": "They are the unconditioned dharmas.",
        "source": "T14n0475_003:0554b05_10"
    },
    {
        "source_sentence": "如菩薩者，不盡有為，不住無為。",
        "translation": "Suppose a bodhisattva doesn't exhaust the conditioned and doesn't abide in the unconditioned.",
        "source": "T14n0475_003:0554b05_11"
    },
    {
        "source_sentence": "「何謂不盡有為？",
        "translation": "By what is inexhaustible conditioned?",
        "source": "T14n0475_003:0554b06_12"
    },
    {
        "source_sentence": "謂不離大慈，不捨大悲；",
        "translation": "They are not separate from great compassion and not giving up great compassion.",
        "source": "T14n0475_003:0554b07_0"
    },
    {
        "source_sentence": "深發一切智心，而不忽忘；",
        "translation": "They deeply develop the determination for omniscience without forgetting it.",
        "source": "T14n0475_003:0554b07_1"
    },
    {
        "source_sentence": "教化眾生，終不厭倦；",
        "translation": "They teach sentient beings, never getting tired of it.",
        "source": "T14n0475_003:0554b08_2"
    },
    {
        "source_sentence": "於四攝法，常念順行；",
        "translation": "They always think and act according to the four methods of salvation.",
        "source": "T14n0475_003:0554b08_3"
    },
    {
        "source_sentence": "護持正法，不惜軀命；",
        "translation": "They preserve the true teaching and do not cherish their bodies or lives.",
        "source": "T14n0475_003:0554b09_4"
    },
    {
        "source_sentence": "種諸善根，無有疲厭。",
        "translation": "They plant the roots of goodness without weariness.",
        "source": "T14n0475_003:0554b09_5"
    },
    {
        "source_sentence": "志常安住，方便迴向；",
        "translation": "Their resolve always abiding peacefully, they skillfully dedicate it back to others.",
        "source": "T14n0475_003:0554b10_6"
    },
    {
        "source_sentence": "求法不懈，說法無悋；",
        "translation": "They seek the Teaching without slackening, expounding the truth freely.",
        "source": "T14n0475_003:0554b10_7"
    },
    {
        "source_sentence": "勤供諸佛。",
        "translation": "They diligently make offerings to the buddhas.",
        "source": "T14n0475_003:0554b11_8"
    },
    {
        "source_sentence": "故入生死而無所畏；",
        "translation": "They therefore enter birth and death without fear.",
        "source": "T14n0475_003:0554b11_9"
    },
    {
        "source_sentence": "於諸榮辱，心無憂喜；",
        "translation": "They had no sorrow or joy in their hearts at all the honors and disgraces.",
        "source": "T14n0475_003:0554b12_10"
    },
    {
        "source_sentence": "不輕未學，敬學如佛；",
        "translation": "They do not despise those who have not studied yet, reverently following the ways of the Buddha.",
        "source": "T14n0475_003:0554b12_11"
    },
    {
        "source_sentence": "墮煩惱者，令發正念，於遠離樂，不以為貴；",
        "translation": "Those who have fallen into the defilements are caused to give rise to right mindfulness, not believing that detachment from happiness is an important thing.",
        "source": "T14n0475_003:0554b13_12"
    },
    {
        "source_sentence": "不著己樂，慶於彼樂。",
        "translation": "They don't cling to their own happiness, and they rejoice in the happiness of others.",
        "source": "T14n0475_003:0554b14_13"
    },
    {
        "source_sentence": "在諸禪定，如地獄想；",
        "translation": "Those in meditation are like the perception of hell.",
        "source": "T14n0475_003:0554b14_14"
    },
    {
        "source_sentence": "於生死中，如園觀想；",
        "translation": "In the midst of birth and death, he contemplates like a garden.",
        "source": "T14n0475_003:0554b15_15"
    },
    {
        "source_sentence": "見來求者，為善師想；",
        "translation": "Seeing those who come to ask for it is thought of as teachers.",
        "source": "T14n0475_003:0554b15_16"
    },
    {
        "source_sentence": "捨諸所有，具一切智想；",
        "translation": "They relinquish all possessions and conceive of omniscience.",
        "source": "T14n0475_003:0554b16_17"
    },
    {
        "source_sentence": "見毀戒人，起救護想；",
        "translation": "They see those who break the precepts and give rise to thoughts of salvation.",
        "source": "T14n0475_003:0554b16_18"
    },
    {
        "source_sentence": "諸波羅蜜，為父母想；",
        "translation": "The transcendent ways are thought of as parents.",
        "source": "T14n0475_003:0554b17_19"
    },
    {
        "source_sentence": "道品之法，為眷屬想。",
        "translation": "The factors of enlightenment are the perception of dependents.",
        "source": "T14n0475_003:0554b17_20"
    },
    {
        "source_sentence": "發行善根，無有齊限；",
        "translation": "There is no limitation in the number of roots of goodness they produce.",
        "source": "T14n0475_003:0554b18_21"
    },
    {
        "source_sentence": "以諸淨國嚴飾之事，成己佛土；",
        "translation": "They adorned their buddha-lands with the embellishments of pure lands.",
        "source": "T14n0475_003:0554b18_22"
    },
    {
        "source_sentence": "行無限施，具足相好；",
        "translation": "They practice unlimited giving, endowed with the marks and embellishments of greatness.",
        "source": "T14n0475_003:0554b19_23"
    },
    {
        "source_sentence": "除一切惡，淨身口意。",
        "translation": "He rids himself of all evil and purifies body, speech, and thought.",
        "source": "T14n0475_003:0554b20_24"
    },
    {
        "source_sentence": "生死無數劫，意而有勇；",
        "translation": "Countless eons passed in birth and death, yet their minds possessed courage.",
        "source": "T14n0475_003:0554b20_25"
    },
    {
        "source_sentence": "聞佛無量德，志而不倦。",
        "translation": "They hear of the Buddha’s immeasurable virtues and never tire of their aspirations.",
        "source": "T14n0475_003:0554b21_26"
    },
    {
        "source_sentence": "以智慧劍，破煩惱賊；",
        "translation": "With the sword of wisdom they conquer the thieves of afflictions.",
        "source": "T14n0475_003:0554b21_27"
    },
    {
        "source_sentence": "出陰界入，荷負眾生，永使解脫。",
        "translation": "The outflowing aggregates, elements, and sense-fields bear the burden on sentient beings and permanently cause them to be liberated.",
        "source": "T14n0475_003:0554b22_28"
    },
    {
        "source_sentence": "以大精進，摧伏魔軍，常求無念實相智慧行；",
        "translation": "With great zeal they subdue the armies of demons and always seek the practice of knowledge and wisdom that has no awareness of reality.",
        "source": "T14n0475_003:0554b23_29"
    },
    {
        "source_sentence": "於世間法少欲知足，於出世間求之無厭，而不捨世間法，不壞威儀法而能隨俗。",
        "translation": "They have few desires and are satisfied with worldly dharmas, seek transcendent dharmas without tire, don't abandon worldly dharmas, don't break the rules of deportment, and can follow the conventional.",
        "source": "T14n0475_003:0554b24_30"
    },
    {
        "source_sentence": "起神通慧，引導眾生，得念總持，所聞不忘。",
        "translation": "He produces supernormal wisdom that guides sentient beings, attains mindfulness and the mastery of concentration, and doesn't forget what he hears.",
        "source": "T14n0475_003:0554b26_31"
    },
    {
        "source_sentence": "善別諸根，斷眾生疑；",
        "translation": "They are skilled in distinguishing faculties, dispelling the doubts of sentient beings.",
        "source": "T14n0475_003:0554b27_32"
    },
    {
        "source_sentence": "以樂說辯，演法無礙。",
        "translation": "With delight in explanation and eloquence, they expound the Teaching unhindered.",
        "source": "T14n0475_003:0554b27_33"
    },
    {
        "source_sentence": "淨十善道，受天、人福；",
        "translation": "They purify the ten wholesome paths and receive heavenly and human blessings.",
        "source": "T14n0475_003:0554b28_34"
    },
    {
        "source_sentence": "修四無量，開梵天道。",
        "translation": "He cultivates the four immeasurables and opens up the path of the Brahma gods.",
        "source": "T14n0475_003:0554b28_35"
    },
    {
        "source_sentence": "勸請說法，隨喜讚善，得佛音聲；",
        "translation": "They were encouraged to expound the Teaching, rejoicing in it and praising it; they attained the voice of Buddha.",
        "source": "T14n0475_003:0554b29_36"
    },
    {
        "source_sentence": "身口意善，得佛威儀。",
        "translation": "Their bodies, speech, and minds are good, and they attain the Buddha's dignified manner.",
        "source": "T14n0475_003:0554c01_0"
    },
    {
        "source_sentence": "深修善法，所行轉勝；",
        "translation": "They deeply cultivate wholesome states, and the practices they undertake become superior.",
        "source": "T14n0475_003:0554c01_1"
    },
    {
        "source_sentence": "以大乘教，成菩薩僧；",
        "translation": "By the teaching of the Great Vehicle they became bodhisattvas and monks.",
        "source": "T14n0475_003:0554c02_0"
    },
    {
        "source_sentence": "心無放逸，不失眾善。",
        "translation": "Their minds are not lazy, and they don't lose all goodness.",
        "source": "T14n0475_003:0554c02_1"
    },
    {
        "source_sentence": "行如此法，是名菩薩不盡有為。",
        "translation": "To practice such a teaching is called a bodhisattva who doesn't end conditioned things.",
        "source": "T14n0475_003:0554c03_2"
    },
    {
        "source_sentence": "「何謂菩薩不住無為？",
        "translation": "What does it mean that a bodhisattva doesn't abide in nonproductivity?",
        "source": "T14n0475_003:0554c03_3"
    },
    {
        "source_sentence": "謂修學空，不以空為證；",
        "translation": "They cultivate emptiness but do not regard emptiness as proof.",
        "source": "T14n0475_003:0554c04_4"
    },
    {
        "source_sentence": "修學無相、無作，不以無相、無作為證；",
        "translation": "They cultivate signlessness and unmanifestness, not realizing them by signlessness or unmanifestness.",
        "source": "T14n0475_003:0554c05_0"
    },
    {
        "source_sentence": "修學無起，不以無起為證。",
        "translation": "Cultivation of nonarising doesn't take nonarising as proof.",
        "source": "T14n0475_003:0554c05_1"
    },
    {
        "source_sentence": "觀於無常，而不厭善本；",
        "translation": "Observing impermanence, they do not reject the roots of goodness.",
        "source": "T14n0475_003:0554c06_2"
    },
    {
        "source_sentence": "觀世間苦，而不惡生死；",
        "translation": "They observe worldly suffering but do not evil births and deaths.",
        "source": "T14n0475_003:0554c07_3"
    },
    {
        "source_sentence": "觀於無我，而誨人不倦；",
        "translation": "Observing selflessness, they never tire of teaching others.",
        "source": "T14n0475_003:0554c07_4"
    },
    {
        "source_sentence": "觀於寂滅，而不永滅；",
        "translation": "They contemplate extinction but not eternal extinction.",
        "source": "T14n0475_003:0554c08_5"
    },
    {
        "source_sentence": "觀於遠離，而身心修善；",
        "translation": "They contemplate detachment, yet cultivate wholesomeness in body and mind.",
        "source": "T14n0475_003:0554c08_6"
    },
    {
        "source_sentence": "觀無所歸，而歸趣善法；",
        "translation": "Observing nothing to rely on, they turn to wholesome states.",
        "source": "T14n0475_003:0554c09_7"
    },
    {
        "source_sentence": "觀於無生，而以生法荷負一切；",
        "translation": "Observing nonorigination, they carry the burden of all things by the principle of birth.",
        "source": "T14n0475_003:0554c10_0"
    },
    {
        "source_sentence": "觀於無漏，而不斷諸漏；",
        "translation": "Observing the uncontaminated, they do not stop the contaminants.",
        "source": "T14n0475_003:0554c10_1"
    },
    {
        "source_sentence": "觀無所行，而以行法教化眾生；",
        "translation": "Observing nothing to practice, they lead and inspire sentient beings by the principles of practice.",
        "source": "T14n0475_003:0554c11_2"
    },
    {
        "source_sentence": "觀於空無，而不捨大悲；",
        "translation": "Observing emptiness as nonexistent, they do not give up great compassion.",
        "source": "T14n0475_003:0554c12_3"
    },
    {
        "source_sentence": "觀正法位，而不隨小乘；",
        "translation": "They observe the state of true doctrine but do not follow the lesser vehicle.",
        "source": "T14n0475_003:0554c12_4"
    },
    {
        "source_sentence": "觀諸法虛妄，無牢無人、無主無相，本願未滿，而不虛福德、禪定、智慧。",
        "translation": "He observes that all dharmas are false, have no place, no person, no owner, and no marks, and his original vow hasn't been fulfilled, so he doesn't denigrate virtue, meditation, or wisdom.",
        "source": "T14n0475_003:0554c13_5"
    },
    {
        "source_sentence": "修如此法，是名菩薩不住無為。",
        "translation": "Cultivating such a teaching is called a bodhisattva who doesn't abide in nothingness.",
        "source": "T14n0475_003:0554c14_6"
    },
    {
        "source_sentence": "「又具福德故，不住無為；",
        "translation": "“Furthermore, because they are endowed with virtue, they do not dwell in the uncompounded.",
        "source": "T14n0475_003:0554c15_7"
    },
    {
        "source_sentence": "具智慧故，不盡有為。",
        "translation": "Because they are endowed with wisdom, they don't exhaust the conditioned.",
        "source": "T14n0475_003:0554c16_8"
    },
    {
        "source_sentence": "大慈悲故，不住無為；",
        "translation": "Because of great compassion, they do not dwell in the unconditioned.",
        "source": "T14n0475_003:0554c16_9"
    },
    {
        "source_sentence": "滿本願故，不盡有為。",
        "translation": "Because they fulfill their original vow, they don't end the conditioned.",
        "source": "T14n0475_003:0554c17_10"
    },
    {
        "source_sentence": "集法藥故，不住無為；",
        "translation": "Because they gather the medicine of the Teaching, they do not dwell in unconditioned things.",
        "source": "T14n0475_003:0554c17_11"
    },
    {
        "source_sentence": "隨授藥故，不盡有為。",
        "translation": "It's because they follow the prescription of medicine and don't end conditioned things.",
        "source": "T14n0475_003:0554c18_12"
    },
    {
        "source_sentence": "知眾生病故，不住無為；",
        "translation": "Because they know all beings are sick, they do not dwell in the unconditioned.",
        "source": "T14n0475_003:0554c18_13"
    },
    {
        "source_sentence": "滅眾生病故，不盡有為。",
        "translation": "It's because they extinguish the illnesses of sentient beings and don't end conditioned things.",
        "source": "T14n0475_003:0554c19_14"
    },
    {
        "source_sentence": "諸正士菩薩以修此法，不盡有為、不住無為，是名盡無盡解脫法門，汝等當學！」",
        "translation": "Good men and bodhisattvas cultivate this teaching so that they don't end the conditioned and don't abide in the unconditioned, which is called the Dharma-gate of ending the inexhaustible liberation, and you should study it!",
        "source": "T14n0475_003:0554c19_15"
    },
    {
        "source_sentence": "爾時彼諸菩薩聞說是法，皆大歡喜，以眾妙華、若干種色、若干種香，",
        "translation": "Those bodhisattvas were greatly delighted when they heard this teaching. They offered various kinds of exquisite flowers, various colors, and various fragrances to the Licchavi Vimalakīrti:",
        "source": "T14n0475_003:0554c21_16"
    },
    {
        "source_sentence": "散遍三千大千世界，供養於佛，及此經法，并諸菩薩已，稽首佛足，歎未曾有！",
        "translation": "They scattered throughout the great manifold cosmos and offered offerings to the Buddha, this teaching of the scripture as well as other enlightening beings. Having done so, they bowed their heads at the Buddha’s feet and exclaimed in",
        "source": "T14n0475_003:0554c23_17"
    },
    {
        "source_sentence": "言：「釋迦牟尼佛乃能於此善行方便。」",
        "translation": "He said, Śākyamuni Buddha is able to skillfully practice these good deeds.",
        "source": "T14n0475_003:0554c25_18"
    },
    {
        "source_sentence": "言已，忽然不現，還到彼國。",
        "translation": "After saying this, he suddenly disappeared and returned to that country.",
        "source": "T14n0475_003:0554c26_19"
    },
    {
        "source_sentence": "維摩詰所說經見阿閦佛品第十二",
        "translation": "Vimalakīrti's Exposition of the Sutra on Seeing Akṣobhya, Chapter 12",
        "source": "T14n0475_003:0554c27_0"
    },
    {
        "source_sentence": "爾時世尊問維摩詰：「汝欲見如來，為以何等觀如來乎？」",
        "translation": "It was then that the Bhagavān asked Vimalakīrti, Do you want to see the Tathāgata, so what is the way to contemplate the Tathāgata?",
        "source": "T14n0475_003:0554c28_0"
    },
    {
        "source_sentence": "維摩詰言：「如自觀身實相，觀佛亦然。",
        "translation": "Vimalakīrti said, Just as he observes the true characteristics of his own body, so does he observe the Buddha.",
        "source": "T14n0475_003:0554c29_1"
    },
    {
        "source_sentence": "我觀如來前際不來，後際不去，今則不住。",
        "translation": "I observe that the Tathāgata doesn’t come at former ends and doesn’t go at latter ends, but now he doesn’t.",
        "source": "T14n0475_003:0555a01_2"
    },
    {
        "source_sentence": "不觀色，不觀色如，不觀色性。",
        "translation": "They don't contemplate form, don't contemplate form as form, and don't contemplate the nature of form.",
        "source": "T14n0475_003:0555a02_3"
    },
    {
        "source_sentence": "不觀受、想、行、識，不觀識如，不觀識性，非四大起，同於虛空。",
        "translation": "They don't contemplate feeling, perception, volition, and consciousness, don't contemplate consciousness as it is, and don't contemplate the nature of consciousness, which doesn't arise from the four elements and is the",
        "source": "T14n0475_003:0555a03_0"
    },
    {
        "source_sentence": "六入無積，眼、耳、鼻、舌、身、心已過；",
        "translation": "The six sense-fields are without accumulation: the eye, the ear, the nose, the tongue, the body, and the mind have already passed.",
        "source": "T14n0475_003:0555a04_1"
    },
    {
        "source_sentence": "不在三界，三垢已離。",
        "translation": "They aren't in the three realms, and they're free of the three defilements.",
        "source": "T14n0475_003:0555a05_2"
    },
    {
        "source_sentence": "順三脫門，具足三明，與無明等。",
        "translation": "It follows the three gates of liberation, which are replete with the three insights, and it's like ignorance.",
        "source": "T14n0475_003:0555a05_3"
    },
    {
        "source_sentence": "不一相、不異相，不自相、不他相，非無相、非取相。",
        "translation": "They are not with one characteristic mark or different characteristic marks, not with specific characteristic marks or other characteristic marks, not without characteristic marks or apprehending characteristic marks.",
        "source": "T14n0475_003:0555a06_4"
    },
    {
        "source_sentence": "不此岸，不彼岸，不中流，而化眾生。",
        "translation": "He doesn’t go to this shore, doesn’t go to another shore, and doesn’t go in the middle of the river, yet he transforms sentient beings.",
        "source": "T14n0475_003:0555a07_5"
    },
    {
        "source_sentence": "觀於寂滅，亦不永滅。",
        "translation": "He observes that cessation doesn't permanently cease, either.",
        "source": "T14n0475_003:0555a08_6"
    },
    {
        "source_sentence": "不此不彼；",
        "translation": "neither this nor that;",
        "source": "T14n0475_003:0555a09_7"
    },
    {
        "source_sentence": "不以此，不以彼。",
        "translation": "It's not because of this, and it's not because of that.",
        "source": "T14n0475_003:0555a09_8"
    },
    {
        "source_sentence": "不可以智知，不可以識識。",
        "translation": "They can't be known by cognition, and they can't be discerned by consciousness.",
        "source": "T14n0475_003:0555a09_9"
    },
    {
        "source_sentence": "無晦無明，無名無相，無強無弱，非淨非穢。",
        "translation": "The absence of obscurity and ignorance, the absence of names and marks, the absence of strength and weakness, and neither purity nor defilement.",
        "source": "T14n0475_003:0555a10_10"
    },
    {
        "source_sentence": "不在方，不離方；",
        "translation": "They do not dwell in directions, but they don’t leave directions.",
        "source": "T14n0475_003:0555a11_11"
    },
    {
        "source_sentence": "非有為，非無為。",
        "translation": "It is neither conditioned nor unconditioned.",
        "source": "T14n0475_003:0555a11_12"
    },
    {
        "source_sentence": "無示無說。",
        "translation": "There's nothing to show and nothing to teach.",
        "source": "T14n0475_003:0555a12_13"
    },
    {
        "source_sentence": "不施不慳，不戒不犯，不忍不恚，不進不怠，不定不亂，不智不愚，不誠不欺，",
        "translation": "They are neither generosity nor stinginess, neither morality nor immorality, neither tolerance nor hatred, neither progress nor laziness, neither concentration nor disorder, neither wisdom nor folly, neither sincerity nor hypocrisy",
        "source": "T14n0475_003:0555a12_14"
    },
    {
        "source_sentence": "不來不去，不出不入，一切言語道斷。",
        "translation": "He doesn't come or go, doesn't leave or enter, and stops all verbal paths.",
        "source": "T14n0475_003:0555a14_15"
    },
    {
        "source_sentence": "非福田，非不福田；",
        "translation": "They are neither fields of blessings nor fields of evil.",
        "source": "T14n0475_003:0555a15_16"
    },
    {
        "source_sentence": "非應供養，非不應供養；",
        "translation": "What should not be offered and what should not be offered.",
        "source": "T14n0475_003:0555a15_17"
    },
    {
        "source_sentence": "非取非捨。",
        "translation": "It's neither grasped nor equanimous.",
        "source": "T14n0475_003:0555a16_18"
    },
    {
        "source_sentence": "非有相，非無相。",
        "translation": "They are not with characteristics and not without characteristics.",
        "source": "T14n0475_003:0555a16_19"
    },
    {
        "source_sentence": "同真際，等法性。",
        "translation": "They are the same as the realm of reality, which is equal to the nature of dharmas.",
        "source": "T14n0475_003:0555a17_20"
    },
    {
        "source_sentence": "不可稱，不可量，過諸稱量。",
        "translation": "They can't be measured, and they can't be measured, which is beyond measurement.",
        "source": "T14n0475_003:0555a17_21"
    },
    {
        "source_sentence": "非大非小，非見非聞，非覺非知，離眾結縛。",
        "translation": "It's neither large nor small, neither seen nor heard, neither perceived nor known, and free of the many fetters.",
        "source": "T14n0475_003:0555a18_22"
    },
    {
        "source_sentence": "等諸智，同眾生，於諸法無分別。",
        "translation": "Equanimous cognition is the same as sentient beings, and there's no discrimination in regard to dharmas.",
        "source": "T14n0475_003:0555a19_23"
    },
    {
        "source_sentence": "一切無失，無濁無惱，無作無起，無生無滅。",
        "translation": "All are without loss, without turbidity or disturbance, without action or arising, without birth or cessation.",
        "source": "T14n0475_003:0555a20_24"
    },
    {
        "source_sentence": "無畏無憂，無喜無厭無著。",
        "translation": "They have no fear and no sorrow, no joy, no disillusionment, and no attachment.",
        "source": "T14n0475_003:0555a21_25"
    },
    {
        "source_sentence": "無已有，無當有，無今有。",
        "translation": "Nothing exists already, nothing will exist, and nothing exists now.",
        "source": "T14n0475_003:0555a21_26"
    },
    {
        "source_sentence": "不可以一切言說分別顯示。",
        "translation": "They can't be discriminated and shown in all words.",
        "source": "T14n0475_003:0555a22_27"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T14n0475_003:0555a23_28"
    },
    {
        "source_sentence": "如來身為若此，作如是觀。",
        "translation": "If the Tathāgata's body is like this, he observes it in this way.",
        "source": "T14n0475_003:0555a23_29"
    },
    {
        "source_sentence": "以斯觀者，名為正觀；",
        "translation": "Those who contemplate in this way are called right contemplation.",
        "source": "T14n0475_003:0555a23_30"
    },
    {
        "source_sentence": "若他觀者，名為邪觀。」",
        "translation": "If someone else observes it, they're called observing wrongly.",
        "source": "T14n0475_003:0555a24_31"
    },
    {
        "source_sentence": "爾時舍利弗問維摩詰：「汝於何沒而來生此？」",
        "translation": "It was then that Śāriputra asked the Licchavi Vimalakīrti, Where did you die and come to be born here?",
        "source": "T14n0475_003:0555a25_0"
    },
    {
        "source_sentence": "維摩詰言：「汝所得法有沒生乎？」",
        "translation": "Vimalakīrti said, Is there a nonarising of the Dharma you've attained?",
        "source": "T14n0475_003:0555a26_0"
    },
    {
        "source_sentence": "舍利弗言：「無沒生也。」",
        "translation": "Śāriputra said, There's nothing that doesn't arise.",
        "source": "T14n0475_003:0555a26_1"
    },
    {
        "source_sentence": "「若諸法無沒生相，云何問言：『汝於何沒而來生此？』",
        "translation": "If all dharmas lack the characteristic of disappearance and arising, how can you ask, 'Where did you disappear and come to be born here?'",
        "source": "T14n0475_003:0555a27_2"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T14n0475_003:0555a28_3"
    },
    {
        "source_sentence": "譬如幻師，幻作男女，寧沒生耶？」",
        "translation": "It's like an illusionist who creates illusions for men and women, so how could he not be born?",
        "source": "T14n0475_003:0555a28_4"
    },
    {
        "source_sentence": "舍利弗言：「無沒生也。",
        "translation": "Śāriputra said, There's nothing that doesn't arise.",
        "source": "T14n0475_003:0555a29_5"
    },
    {
        "source_sentence": "汝豈不聞佛說諸法如幻相乎？」",
        "translation": "Haven't you heard the Buddha teach that all dharmas are illusory?",
        "source": "T14n0475_003:0555a29_6"
    },
    {
        "source_sentence": "答曰：「如是！",
        "translation": "He replied, So it is!",
        "source": "T14n0475_003:0555b01_7"
    },
    {
        "source_sentence": "若一切法如幻相者！",
        "translation": "If all dharmas are illusory, then...",
        "source": "T14n0475_003:0555b01_8"
    },
    {
        "source_sentence": "云何問言：『汝於何沒而來生此？』",
        "translation": "How do you ask, 'Where did you die and come to be born here?'",
        "source": "T14n0475_003:0555b02_9"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T14n0475_003:0555b03_10"
    },
    {
        "source_sentence": "沒者為虛誑法，敗壞之相；",
        "translation": "Disappearance is the characteristic of hypocrisy and decay.",
        "source": "T14n0475_003:0555b03_11"
    },
    {
        "source_sentence": "生者為虛誑法，相續之相。",
        "translation": "Birth is a false dharma, the characteristic of continuity.",
        "source": "T14n0475_003:0555b03_12"
    },
    {
        "source_sentence": "菩薩雖沒，不盡善本；",
        "translation": "“Although enlightening beings have gone down, they do not exhaust the roots of goodness.",
        "source": "T14n0475_003:0555b04_13"
    },
    {
        "source_sentence": "雖生，不長諸惡。」",
        "translation": "Even though it arises, it doesn't grow badness.",
        "source": "T14n0475_003:0555b05_14"
    },
    {
        "source_sentence": "是時佛告舍利弗：「有國名妙喜，佛號無動。",
        "translation": "The Buddha then addressed Śāriputra, There's a country named Miaoji, and the Buddha's name is Akṣobhya.",
        "source": "T14n0475_003:0555b05_15"
    },
    {
        "source_sentence": "是維摩詰於彼國沒，而來生此。」",
        "translation": "That Vimalakīrti disappeared from that country and came to be born here.",
        "source": "T14n0475_003:0555b06_16"
    },
    {
        "source_sentence": "舍利弗言：「未曾有也。",
        "translation": "Śāriputra said, Never has there been such a thing.",
        "source": "T14n0475_003:0555b07_17"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T14n0475_003:0555b07_18"
    },
    {
        "source_sentence": "是人乃能捨清淨土，而來樂此多怒害處。」",
        "translation": "That person then can abandon the pure land and come to enjoy this place where there's much anger and harmfulness.",
        "source": "T14n0475_003:0555b07_19"
    },
    {
        "source_sentence": "維摩詰語舍利弗：「於意云何？",
        "translation": "Vimalakīrti said to Śāriputra, What do you think?",
        "source": "T14n0475_003:0555b08_20"
    },
    {
        "source_sentence": "日光出時與冥合乎？」",
        "translation": "When the sunlight comes out, is it combined with darkness?",
        "source": "T14n0475_003:0555b09_21"
    },
    {
        "source_sentence": "答曰：「不也！",
        "translation": "He replied, No!",
        "source": "T14n0475_003:0555b10_0"
    },
    {
        "source_sentence": "日光出時，即無眾冥。」",
        "translation": "When the sun comes out, there's no multitude of darkness.",
        "source": "T14n0475_003:0555b10_1"
    },
    {
        "source_sentence": "維摩詰言：「夫日何故行閻浮提？」",
        "translation": "Vimalakīrti said, Why do you travel to Jambudvīpa on a day?",
        "source": "T14n0475_003:0555b10_2"
    },
    {
        "source_sentence": "答曰：「欲以明照，為之除冥。」",
        "translation": "He answered, I want to illuminate it with insight and remove the darkness for its sake.",
        "source": "T14n0475_003:0555b11_3"
    },
    {
        "source_sentence": "維摩詰言：「菩薩如是！",
        "translation": "Vimalakīrti said, So it is with the bodhisattva!",
        "source": "T14n0475_003:0555b12_4"
    },
    {
        "source_sentence": "雖生不淨佛土，為化眾生故，不與愚闇而共合也，但滅眾生煩惱闇耳！」",
        "translation": "Even though they're born in an impure Buddha land, they don't combine with the darkness of ignorance for the sake of transforming sentient beings and simply extinguishing the darkness of afflictions that afflict sentient beings!",
        "source": "T14n0475_003:0555b12_5"
    },
    {
        "source_sentence": "是時大眾渴仰，欲見妙喜世界無動如來，及其菩薩、聲聞之眾。",
        "translation": "The masses then longed to see the Tathāgata Akṣobhya in the world of Marvelous Joy, and so did the bodhisattvas and śrāvakas.",
        "source": "T14n0475_003:0555b14_6"
    },
    {
        "source_sentence": "佛知一切眾會所念，告維摩詰言：「善男子！",
        "translation": "Knowing what all the members of the assembly thought, the Buddha told Vimalakīrti, Good man!",
        "source": "T14n0475_003:0555b15_7"
    },
    {
        "source_sentence": "為此眾會，現妙喜國無動如來，及諸菩薩、聲聞之眾，眾皆欲見。」",
        "translation": "To this assembly, he presents the land of Marvelous Joy, the Akṣobhya Tathāgata, and the bodhisattvas and śrāvakas all want to see it.",
        "source": "T14n0475_003:0555b16_8"
    },
    {
        "source_sentence": "於是維摩詰心念：「吾當不起于座，接妙喜國，鐵圍山川溪谷江河，大海泉源，",
        "translation": "Then the Licchavi Vimalakīrti thought to himself, “Without rising from his seat, I should reach the land of Marvelous Joy, which is surrounded by iron mountains, rivers, streams, streams, lakes,",
        "source": "T14n0475_003:0555b18_9"
    },
    {
        "source_sentence": "須彌諸山，及日月星宿、天龍鬼神梵天等宮，并諸菩薩、聲聞之眾，城邑聚落，",
        "translation": "Sumeru mountains, the sun, moons, stars, constellations, celestial beings, dragons, ghosts, Brahmā gods, and other palaces, as well as bodhisattvas and śrāvakas.",
        "source": "T14n0475_003:0555b20_0"
    },
    {
        "source_sentence": "男女大小，乃至無動如來，及菩提樹，諸妙蓮華，能於十方作佛事者；",
        "translation": "Men and women, large and small, up to the unmoving buddhas and the trees of enlightenment and the wonderful lotus blossoms are able to perform buddha-work in all directions.",
        "source": "T14n0475_003:0555b21_1"
    },
    {
        "source_sentence": "三道寶階從閻浮提，至忉利天，以此寶階，諸天來下，悉為禮敬無動如來，",
        "translation": "From Jambudvfpa up to the Trāyastriṃśa gods, these jeweled staircases brought heavenly beings down to pay their respects to the Tathāgata Akṣobhya.",
        "source": "T14n0475_003:0555b23_2"
    },
    {
        "source_sentence": "聽受經法。",
        "translation": "They listened to the sūtras and received the teachings.",
        "source": "T14n0475_003:0555b25_0"
    },
    {
        "source_sentence": "閻浮提人，亦登其階，上昇忉利，見彼諸天。",
        "translation": "The people of Jambudvīpa also climbed up the staircase and ascended to Trāyastriṃśa Heaven, where they saw the gods there.",
        "source": "T14n0475_003:0555b25_1"
    },
    {
        "source_sentence": "妙喜世界成就如是無量功德，上至阿迦膩吒天，下至水際；",
        "translation": "In the world Marvelous Joy such immeasurable virtues were accomplished, ascending up to the celestial realm of Akaniṣṭha and down to the watery edge.",
        "source": "T14n0475_003:0555b26_2"
    },
    {
        "source_sentence": "以右手斷取，如陶家輪，入此世界，猶持華鬘，示一切眾。」",
        "translation": "He takes it off with his right hand like the potter's wheel and enters this world, holding a flower garland to show it to all the people.",
        "source": "T14n0475_003:0555b27_3"
    },
    {
        "source_sentence": "作是念已，入於三昧，現神通力，以其右手斷取妙喜世界，置於此土。",
        "translation": "After he had this thought, he entered samādhi and manifested his supernormal powers, cut off the world of Marvelous Joy with his right hand, and placed it in this land.",
        "source": "T14n0475_003:0555b29_4"
    },
    {
        "source_sentence": "彼得神通菩薩及聲聞眾，并餘天、人，俱發聲言：「唯然世尊！",
        "translation": "Peter, the bodhisattva of supernormal powers, the śrāvakas, and the other gods and humans all spoke out, saying, Yes, Bhagavān!",
        "source": "T14n0475_003:0555c01_5"
    },
    {
        "source_sentence": "誰取我去！",
        "translation": "Who took me away?",
        "source": "T14n0475_003:0555c03_0"
    },
    {
        "source_sentence": "願見救護。」",
        "translation": "May I see you rescue and protect me?",
        "source": "T14n0475_003:0555c03_1"
    },
    {
        "source_sentence": "無動佛言：「非我所為，是維摩詰神力所作。」",
        "translation": "The Akṣobhya Buddha said, It's not my doing; it's the work of Vimalakīrti's supernormal power.",
        "source": "T14n0475_003:0555c03_2"
    },
    {
        "source_sentence": "其餘未得神通者，不覺不知己之所往。",
        "translation": "The rest who haven't yet attained supernormal abilities don't perceive or know where they're going.",
        "source": "T14n0475_003:0555c04_3"
    },
    {
        "source_sentence": "妙喜世界，雖入此土，而不增減，於是世界亦不迫隘，如本無異。",
        "translation": "Although the world of Marvelous Joy enters this land, it doesn't increase or decrease, and neither does the world there, which isn't crowded or small, as before.",
        "source": "T14n0475_003:0555c05_4"
    },
    {
        "source_sentence": "爾時釋迦牟尼佛告諸大眾：「汝等且觀妙喜世界無動如來，其國嚴飾，",
        "translation": "It was then that the Buddha Śākyamuni said to the great assembly:",
        "source": "T14n0475_003:0555c08_0"
    },
    {
        "source_sentence": "菩薩行淨，弟子清白。」",
        "translation": "The bodhisattva's practice is pure, and his disciples are pure and white.",
        "source": "T14n0475_003:0555c09_1"
    },
    {
        "source_sentence": "皆曰：「唯然已見。」",
        "translation": "They all said, Yes, I've seen it.",
        "source": "T14n0475_003:0555c10_2"
    },
    {
        "source_sentence": "佛言：「若菩薩欲得如是清淨佛土，當學無動如來所行之道。」",
        "translation": "The Buddha said, If bodhisattvas want to attain such a pure buddha land, they should train in the path practiced by the Akṣobhya Tathāgata.",
        "source": "T14n0475_003:0555c10_3"
    },
    {
        "source_sentence": "現此妙喜國時，娑婆世界十四那由他人，發阿耨多羅三藐三菩提心，皆願生於妙喜佛土。",
        "translation": "When this land of marvelous joy is manifested, 14 nayutas in the sahā world give rise to the mind of unsurpassed, correct enlightenment and all wish to be born in the Buddha land of marvelous joy.",
        "source": "T14n0475_003:0555c11_4"
    },
    {
        "source_sentence": "釋迦牟尼佛即記之曰：「當生彼國。」",
        "translation": "Śākyamuni Buddha then wrote to him, You'll be born in that country.",
        "source": "T14n0475_003:0555c13_5"
    },
    {
        "source_sentence": "時妙喜世界於此國土所應饒益，其事訖已，還復本處，舉眾皆見。",
        "translation": "At the time, the world of Marvelous Joy was supposed to give benefits in this land, and after finishing that task, he returned to his original place, where all the assembled people saw him.",
        "source": "T14n0475_003:0555c14_6"
    },
    {
        "source_sentence": "佛告舍利弗：「汝見此妙喜世界及無動佛不？」",
        "translation": "The Buddha told Śāriputra, Do you see this marvelous joy world and the Akṣobhya Buddha?",
        "source": "T14n0475_003:0555c16_7"
    },
    {
        "source_sentence": "「唯然已見，世尊！",
        "translation": "“Yes, Bhagavān!",
        "source": "T14n0475_003:0555c17_8"
    },
    {
        "source_sentence": "願使一切眾生得清淨土，如無動佛；",
        "translation": "May all sentient beings attain the pure land, like the Buddha Akṣobhya.",
        "source": "T14n0475_003:0555c17_9"
    },
    {
        "source_sentence": "獲神通力，如維摩詰。",
        "translation": "They attain supernormal powers like the bodhisattva Vimalakīrti.",
        "source": "T14n0475_003:0555c18_10"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T14n0475_003:0555c19_11"
    },
    {
        "source_sentence": "我等快得善利，得見是人親近供養。",
        "translation": "We'll quickly attain good benefits, and we'll be able to see this person approach and make offerings to him.",
        "source": "T14n0475_003:0555c19_12"
    },
    {
        "source_sentence": "其諸眾生，若今現在，若佛滅後，聞此經者，亦得善利；",
        "translation": "Those sentient beings who hear this scripture, whether in the present or after the nirvana of buddhas, will also gain good benefits.",
        "source": "T14n0475_003:0555c20_13"
    },
    {
        "source_sentence": "況復聞已信解，受持讀誦解說，如法修行。",
        "translation": "How much more so when they hear it, believe in it, memorize it, recite it, understand it, and practice it according to the teaching.",
        "source": "T14n0475_003:0555c21_14"
    },
    {
        "source_sentence": "若有手得是經典者，便為已得法寶之藏；",
        "translation": "If there is anyone with hands who obtains this scripture, they will have already obtained the treasury of the jewels of the Dharma.",
        "source": "T14n0475_003:0555c22_15"
    },
    {
        "source_sentence": "若有讀誦解釋其義，如說修行，即為諸佛之所護念；",
        "translation": "Anyone who recites or explains the meaning of these teachings and practices as they are taught will be protected by the Buddhas.",
        "source": "T14n0475_003:0555c23_16"
    },
    {
        "source_sentence": "其有供養如是人者，當知即為供養於佛；",
        "translation": "Those who make offerings to people like this should be known as those who make offerings to the Buddha.",
        "source": "T14n0475_003:0555c24_17"
    },
    {
        "source_sentence": "其有書持此經卷者，當知其室即有如來；",
        "translation": "Those who write and preserve these fascicles of scripture should be known to have a tathagata in their room.",
        "source": "T14n0475_003:0555c25_18"
    },
    {
        "source_sentence": "若聞是經能隨喜者，斯人即為取一切智；",
        "translation": "If someone hears this scripture and is able to follow it, that person will attain omniscience.",
        "source": "T14n0475_003:0555c26_19"
    },
    {
        "source_sentence": "若能信解此經，乃至一四句偈，為他說者，當知此人，即是受阿耨多羅三藐三菩提記。」",
        "translation": "If someone can believe this sūtra, even a single four-line verse, and explain it for others, you should know that they'll receive the assurance of unsurpassed, correct, and complete enlightenment.",
        "source": "T14n0475_003:0555c27_20"
    },
    {
        "source_sentence": "維摩詰所說經法供養品第十三",
        "translation": "Chapter 13: Making Offerings to the Dharma and Doctrine of the Scriptures taught by Vimalakīrti",
        "source": "T14n0475_003:0556a01_0"
    },
    {
        "source_sentence": "爾時釋提桓因於大眾中白佛言：「世尊！",
        "translation": "It was then that Śakra Devānām-Indra said to the Buddha in the crowd, Bhagavān!",
        "source": "T14n0475_003:0556a02_0"
    },
    {
        "source_sentence": "我雖從佛及文殊師利聞百千經，未曾聞此不可思議，自在神通，決定實相經典。",
        "translation": "Although I've heard hundreds of thousands of sūtras from the Buddha and Mañjuśrī, I've never heard this inconceivable scripture, which has unimpeded supernormal abilities that determine true characteristics.",
        "source": "T14n0475_003:0556a02_1"
    },
    {
        "source_sentence": "如我解佛所說義趣，若有眾生聞是經法，信解受持讀誦之者，必得是法不疑，",
        "translation": "If any sentient beings hear this doctrine of the scripture and believe in it, retain it, recite it, and understand it, they will surely attain that doctrine without doubt.",
        "source": "T14n0475_003:0556a04_2"
    },
    {
        "source_sentence": "何況如說修行？",
        "translation": "How much more so when it's cultivated as explained?",
        "source": "T14n0475_003:0556a06_3"
    },
    {
        "source_sentence": "斯人即為閉眾惡趣開諸善門，常為諸佛之所護念；",
        "translation": "That is, in order to shut off the evil destinies and open the gates of goodness, they are always guarded by the buddhas.",
        "source": "T14n0475_003:0556a07_4"
    },
    {
        "source_sentence": "降伏外學，摧滅魔怨；",
        "translation": "They subdue non-Buddhist learning and annihilate Māra’s enemies.",
        "source": "T14n0475_003:0556a08_5"
    },
    {
        "source_sentence": "修治菩提，安處道場；",
        "translation": "They cultivate enlightenment and settle on the terrace of enlightenment.",
        "source": "T14n0475_003:0556a08_6"
    },
    {
        "source_sentence": "履踐如來所行之跡。",
        "translation": "They walked on the traces of what the Tathāgata had done.",
        "source": "T14n0475_003:0556a09_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T14n0475_003:0556a09_8"
    },
    {
        "source_sentence": "若有受持讀誦如說修行者，我當與諸眷屬供養給事；",
        "translation": "If there is anyone who receives, retains, recites, and practices the teaching as it has been taught, I will provide support and service to them along with my dependents.",
        "source": "T14n0475_003:0556a09_9"
    },
    {
        "source_sentence": "所在聚落城邑、山林曠野，有是經處，我亦與諸眷屬，聽受法故共到其所；",
        "translation": "In the villages, towns, mountains, forests, and wilderness wherever this sutra was to be found, I also went there together with my retinues in order to hear it.",
        "source": "T14n0475_003:0556a11_10"
    },
    {
        "source_sentence": "其未信者，當令生信；",
        "translation": "Those who do not yet believe should be led to give rise to faith.",
        "source": "T14n0475_003:0556a12_11"
    },
    {
        "source_sentence": "其已信者，當為作護。」",
        "translation": "Those who have faith will be guarded for them.",
        "source": "T14n0475_003:0556a13_12"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T14n0475_003:0556a13_13"
    },
    {
        "source_sentence": "天帝！",
        "translation": "O ruler of gods!",
        "source": "T14n0475_003:0556a14_14"
    },
    {
        "source_sentence": "如汝所說，吾助爾喜。",
        "translation": "As you say, I'll help you rejoice.",
        "source": "T14n0475_003:0556a14_15"
    },
    {
        "source_sentence": "此經廣說過去、未來、現在諸佛不可思議阿耨多羅三藐三菩提。",
        "translation": "This sūtra explains in detail the unfathomable unsurpassed, correct, and complete enlightenment of past, future, and present buddhas.",
        "source": "T14n0475_003:0556a14_16"
    },
    {
        "source_sentence": "是故，天帝！",
        "translation": "Therefore, prince of gods!",
        "source": "T14n0475_003:0556a16_17"
    },
    {
        "source_sentence": "若善男子、善女人，受持、讀誦、供養是經者，即為供養去、來、今佛。",
        "translation": "If good men and good women memorize, recite, and make offerings to this sūtra, they'll make offerings to the buddhas of past, future, and present.",
        "source": "T14n0475_003:0556a16_18"
    },
    {
        "source_sentence": "「天帝！",
        "translation": "Emperor Tiandi!",
        "source": "T14n0475_003:0556a18_19"
    },
    {
        "source_sentence": "正使三千大千世界如來滿中，譬如甘蔗、竹[竺-二+韋]、稻麻、叢林；",
        "translation": "It is exactly like sugarcane, bamboo [Zhu-ji+Wei], rice and hemp, or a jungle forest.",
        "source": "T14n0475_003:0556a18_20"
    },
    {
        "source_sentence": "若有善男子、善女人，或一劫、或減一劫，恭敬尊重，讚歎供養，奉諸所安，",
        "translation": "If there are good men and good women, whether for an eon or less than an eon, they will be honored, praised, offered support, and offered peace.",
        "source": "T14n0475_003:0556a19_21"
    },
    {
        "source_sentence": "至諸佛滅後，以一一全身舍利起七寶塔，縱廣一四天下，高至梵天，表剎莊嚴；",
        "translation": "After the parinirvāṇa of all these buddhas, they built seven-jeweled stupas with relics of their bodies, one by one, spreading as far and wide as four or five worlds, rising as high as the Brahma heavens to show",
        "source": "T14n0475_003:0556a21_22"
    },
    {
        "source_sentence": "以一切華香、瓔珞、幢幡、伎樂微妙第一，若一劫、若減一劫，而供養之。",
        "translation": "He'll be honored with flowers, incense, jewelry, banners, pennants, and tricks that are subtly the most subtle of all, whether for an eon or less than an eon.",
        "source": "T14n0475_003:0556a22_23"
    },
    {
        "source_sentence": "於天帝意云何，其人植福，寧為多不？」",
        "translation": "What do you think about the emperor's intention that those people plant good fortune, so why wouldn't they be numerous?",
        "source": "T14n0475_003:0556a24_24"
    },
    {
        "source_sentence": "釋提桓因言：「多矣，世尊！",
        "translation": "Śakra Devānām-Indra said, Yes, Bhagavān!",
        "source": "T14n0475_003:0556a25_25"
    },
    {
        "source_sentence": "彼之福德，若以百千億劫，說不能盡。」",
        "translation": "If they were to explain their merits for a hundred thousand million eons, they wouldn't be able to exhaust them.",
        "source": "T14n0475_003:0556a25_26"
    },
    {
        "source_sentence": "佛告天帝：「當知是善男子、善女人，聞是不可思議解脫經典，信解受持，",
        "translation": "The Buddha said to Indra, “You should know that these sons and daughters of a virtuous family who hear this scripture of the inconceivable liberation will faithfully memorize and retain it.",
        "source": "T14n0475_003:0556a26_27"
    },
    {
        "source_sentence": "讀誦修行，福多於彼。",
        "translation": "Those who recite it and practice it will have more merit than those of other buddhas.",
        "source": "T14n0475_003:0556a28_28"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0475_003:0556a28_29"
    },
    {
        "source_sentence": "諸佛菩提皆從是生；",
        "translation": "The enlightenment of all buddhas is born from this.",
        "source": "T14n0475_003:0556a29_30"
    },
    {
        "source_sentence": "菩提之相不可限量，以是因緣福不可量。」",
        "translation": "The marks of enlightenment can't be limited, and because of these causes and conditions, merit can't be measured.",
        "source": "T14n0475_003:0556a29_31"
    },
    {
        "source_sentence": "佛告天帝：「過去無量阿僧祇劫，時世有佛，號曰藥王如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "The Buddha told Indra, In an immeasurable incalculable eon ago, there was a Buddha in the world named Bhaiṣajyarāja Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-go",
        "source": "T14n0475_003:0556b02_0"
    },
    {
        "source_sentence": "世界名大莊嚴，劫曰莊嚴，佛壽二十小劫；",
        "translation": "The world is called Great Adornment, with an eon called Adornment; the Buddha’s life span is twenty intermediate kalpas.",
        "source": "T14n0475_003:0556b04_1"
    },
    {
        "source_sentence": "其聲聞僧三十六億那由他；",
        "translation": "The number of śrāvaka monks there amounted to three billion six hundred million nayutas.",
        "source": "T14n0475_003:0556b05_2"
    },
    {
        "source_sentence": "菩薩僧有十二億。",
        "translation": "There were 1.2 billion bodhisattvas and saṃgha.",
        "source": "T14n0475_003:0556b06_3"
    },
    {
        "source_sentence": "天帝！",
        "translation": "O ruler of gods!",
        "source": "T14n0475_003:0556b06_4"
    },
    {
        "source_sentence": "是時有轉輪聖王，名曰寶蓋，七寶具足，主四天下。",
        "translation": "At the time, there was a wheel-turning sage king named Jeweled Canopy, endowed with seven treasures, ruling over the four continents.",
        "source": "T14n0475_003:0556b06_5"
    },
    {
        "source_sentence": "王有千子，端正勇健，能伏怨敵。",
        "translation": "The king had a thousand sons, all of whom were brave and valiant and capable of defeating enemies.",
        "source": "T14n0475_003:0556b08_6"
    },
    {
        "source_sentence": "「爾時寶蓋與其眷屬供養藥王如來，施諸所安，至滿五劫。",
        "translation": "It was then that the jeweled lid and his retinues made offerings to the Tathāgata Bhaiṣajyarāja, who bestowed peace on them for five eons.",
        "source": "T14n0475_003:0556b08_7"
    },
    {
        "source_sentence": "過五劫已，告其千子：『汝等亦當如我，以深心供養於佛。』",
        "translation": "After five eons had passed, he told his thousand sons, 'You should also like me make profound offerings to the Buddha with your hearts.'",
        "source": "T14n0475_003:0556b10_8"
    },
    {
        "source_sentence": "於是千子受父王命，供養藥王如來，復滿五劫，一切施安。",
        "translation": "The one thousand sons then accepted the king's order to make offerings to the Tathāgata Bhaiṣajyarāja, and after another five eons, they all gave peace.",
        "source": "T14n0475_003:0556b11_9"
    },
    {
        "source_sentence": "其王一子，名曰月蓋，獨坐思惟：『寧有供養殊過此者？』",
        "translation": "That king's son, named Moon Canopy, sat alone and thought, 'Should there be an offering that's greater than this?'",
        "source": "T14n0475_003:0556b12_10"
    },
    {
        "source_sentence": "以佛神力，空中有天曰：『善男子！",
        "translation": "Due to the Buddha's miraculous power, a god in the sky said, 'Good man!",
        "source": "T14n0475_003:0556b14_11"
    },
    {
        "source_sentence": "法之供養勝諸供養。』",
        "translation": "The offerings of the Dharma are superior to the offerings.'",
        "source": "T14n0475_003:0556b14_12"
    },
    {
        "source_sentence": "即問：『何謂法之供養？』",
        "translation": "He asked, 'What's meant by making offerings to the Dharma?'",
        "source": "T14n0475_003:0556b15_13"
    },
    {
        "source_sentence": "天曰：『汝可往問藥王如來，當廣為汝說法之供養。』",
        "translation": "The gods said, 'You may go and ask the Tathāgata Bhaiṣajyarāja, who will extensively explain the teaching for you as an offering.'",
        "source": "T14n0475_003:0556b15_14"
    },
    {
        "source_sentence": "「即時月蓋王子行詣藥王如來，稽首佛足，却住一面，白佛言：『世尊！",
        "translation": "Immediately the prince Candracchattra approached the Tathāgata Bhaiṣajyarāja, bowed his head at the Buddha's feet, withdrew to one side, and said to the Buddha, 'Bhagavān!",
        "source": "T14n0475_003:0556b17_15"
    },
    {
        "source_sentence": "諸供養中，法供養勝。",
        "translation": "Among the offerings, the Dharma offering is the best.",
        "source": "T14n0475_003:0556b18_16"
    },
    {
        "source_sentence": "云何為法供養？』",
        "translation": "What's an offering of the Dharma?'",
        "source": "T14n0475_003:0556b19_17"
    },
    {
        "source_sentence": "佛言：『善男子！",
        "translation": "The Buddha said, 'Good sons!",
        "source": "T14n0475_003:0556b19_18"
    },
    {
        "source_sentence": "法供養者，諸佛所說深經，一切世間難信難受，微妙難見，清淨無染，",
        "translation": "An offering of the Dharma is a profound scripture taught by the buddhas, hard to believe and hard to accept in all worlds, subtle and hard to see, pure and undefiled.",
        "source": "T14n0475_003:0556b19_19"
    },
    {
        "source_sentence": "非但分別思惟之所能得。",
        "translation": "It's not something that can be attained only by discriminating and contemplating.",
        "source": "T14n0475_003:0556b21_20"
    },
    {
        "source_sentence": "菩薩法藏所攝，陀羅尼印印之。",
        "translation": "It's included in the bodhisattva's store of the Dharma, and it's sealed with the dhāraṇī mudrā.",
        "source": "T14n0475_003:0556b22_21"
    },
    {
        "source_sentence": "至不退轉，成就六度，善分別義，順菩提法，眾經之上。",
        "translation": "Up to the point where he doesn't regress, he accomplishes the six perfections, skillfully discerns their meaning, and follows the principles of enlightenment, which are found above all the sūtras.",
        "source": "T14n0475_003:0556b22_22"
    },
    {
        "source_sentence": "入大慈悲，離眾魔事，及諸邪見。",
        "translation": "Entering great compassion, they're free of demonic deeds and wrong views.",
        "source": "T14n0475_003:0556b24_23"
    },
    {
        "source_sentence": "順因緣法，無我，無人，無眾生，無壽命，空、無相、無作、無起。",
        "translation": "Consistent with causes and conditions, the Dharma has no self, no person, no sentient beings, no life, no emptiness, no marks, no action, and no arising.",
        "source": "T14n0475_003:0556b24_24"
    },
    {
        "source_sentence": "能令眾生坐於道場，而轉法輪，諸天、龍神、乾闥婆等，所共歎譽。",
        "translation": "They can cause sentient beings to sit at the site of enlightenment and turn the wheel of the Dharma, which is praised by gods, dragons, nāgas, gandharvas, and so forth.",
        "source": "T14n0475_003:0556b26_25"
    },
    {
        "source_sentence": "能令眾生入佛法藏，攝諸賢聖一切智慧。",
        "translation": "They can cause sentient beings to enter the Buddha's treasury of the Dharma and gather all the wisdom of the noble ones.",
        "source": "T14n0475_003:0556b27_26"
    },
    {
        "source_sentence": "說眾菩薩所行之道，依於諸法實相之義。",
        "translation": "He explains the path practiced by all bodhisattvas, relying on the true meaning of the true characteristics of dharmas.",
        "source": "T14n0475_003:0556b28_27"
    },
    {
        "source_sentence": "明宣無常、苦、空、無我、寂滅之法，能救一切毀禁眾生；",
        "translation": "They clearly proclaim the teaching of impermanence, suffering, emptiness, selflessness, and extinction, able to rescue all sentient beings who have broken the precepts.",
        "source": "T14n0475_003:0556b29_28"
    },
    {
        "source_sentence": "諸魔外道及貪著者，能使怖畏；",
        "translation": "Non-Buddhist demons and those attached to craving can cause fear.",
        "source": "T14n0475_003:0556c01_29"
    },
    {
        "source_sentence": "諸佛賢聖所共稱歎。",
        "translation": "They are praised by the buddhas, good men, and sages.",
        "source": "T14n0475_003:0556c02_30"
    },
    {
        "source_sentence": "背生死苦，示涅槃樂，十方三世諸佛所說。",
        "translation": "They turn their backs on the suffering of birth and death and show the bliss of nirvāṇa, as taught by the buddhas of the ten directions and three times.",
        "source": "T14n0475_003:0556c02_31"
    },
    {
        "source_sentence": "若聞如是等經，信解受持讀誦，以方便力，為諸眾生分別解說，顯示分明，",
        "translation": "If they hear such scriptures, believe and understand them, memorize and recite them, and by the power of skillful means explain them to sentient beings in a discriminating way, revealing and clarifying them.",
        "source": "T14n0475_003:0556c03_32"
    },
    {
        "source_sentence": "守護法故，是名法之供養。",
        "translation": "Because they guard the Dharma, this is called making offerings to the Dharma.",
        "source": "T14n0475_003:0556c05_33"
    },
    {
        "source_sentence": "又於諸法如說修行，隨順十二因緣，離諸邪見，得無生忍；",
        "translation": "“Furthermore, they cultivate practice of all doctrines in accordance with the teachings, following twelve causes and conditions:",
        "source": "T14n0475_003:0556c06_34"
    },
    {
        "source_sentence": "決定無我無有眾生，而於因緣果報無違無諍，離諸我所。",
        "translation": "It's certain that there's no self and no sentient beings, yet there's no contradiction or dispute about causes, conditions, results, or rewards, and it's free of self and possessions.",
        "source": "T14n0475_003:0556c07_35"
    },
    {
        "source_sentence": "依於義，不依語；",
        "translation": "They rely on meaning and not on words.",
        "source": "T14n0475_003:0556c09_36"
    },
    {
        "source_sentence": "依於智，不依識；",
        "translation": "They rely on knowledge and not on consciousness.",
        "source": "T14n0475_003:0556c09_37"
    },
    {
        "source_sentence": "依了義經，不依不了義經；",
        "translation": "They rely on fully revealed doctrine and not on doctrine that does not reveal the doctrine.",
        "source": "T14n0475_003:0556c09_38"
    },
    {
        "source_sentence": "依於法，不依人。",
        "translation": "They rely on the Dharma and not on people.",
        "source": "T14n0475_003:0556c10_39"
    },
    {
        "source_sentence": "隨順法相，無所入，無所歸。",
        "translation": "They follow the characteristics of dharmas, have no entry and no refuge.",
        "source": "T14n0475_003:0556c11_0"
    },
    {
        "source_sentence": "無明畢竟滅故，諸行亦畢竟滅；",
        "translation": "Because ignorance absolutely ceases, conditioned states of being also absolutely cease.",
        "source": "T14n0475_003:0556c11_1"
    },
    {
        "source_sentence": "乃至生畢竟滅故，老死亦畢竟滅。",
        "translation": "Because birth absolutely ceases, old age and death also absolutely cease.",
        "source": "T14n0475_003:0556c12_2"
    },
    {
        "source_sentence": "作如是觀，十二因緣，無有盡相，不復起見，是名最上法之供養。』」",
        "translation": "Making such an observation that the twelve causes and conditions have no endless characteristics and no longer give rise to views is called making offerings to the supreme Dharma.'",
        "source": "T14n0475_003:0556c13_3"
    },
    {
        "source_sentence": "佛告天帝：「王子月蓋從藥王佛聞如是法，得柔順忍。",
        "translation": "The Buddha told the emperor, Prince Candracchattra heard this teaching from the Medicine King Buddha and attained gentle forbearance.",
        "source": "T14n0475_003:0556c15_0"
    },
    {
        "source_sentence": "即解寶衣嚴身之具，以供養佛，白佛言：『世尊！",
        "translation": "He then untied the jeweled robes and adorned his body, made offerings to the Buddha, and said to him, 'Bhagavān!",
        "source": "T14n0475_003:0556c16_1"
    },
    {
        "source_sentence": "如來滅後，我當行法供養，守護正法。",
        "translation": "After the parinirvāṇa of the Tathāgata, I will make offerings to the Dharma and preserve the true-dharma.",
        "source": "T14n0475_003:0556c17_2"
    },
    {
        "source_sentence": "願以威神加哀建立，令我得降魔怨，修菩薩行。』",
        "translation": "May it be established with authoritative compassion and pity so that I can subdue Māra's enemies and cultivate the bodhisattva practice.'",
        "source": "T14n0475_003:0556c18_3"
    },
    {
        "source_sentence": "佛知其深心所念，而記之曰：『汝於末後，守護法城。』",
        "translation": "Knowing what he deeply thought, the Buddha remembered it and wrote to him, saying, 'After the end, you will guard the city of the Dharma.'",
        "source": "T14n0475_003:0556c19_4"
    },
    {
        "source_sentence": "天帝！",
        "translation": "O ruler of gods!",
        "source": "T14n0475_003:0556c20_5"
    },
    {
        "source_sentence": "時王子月蓋，見法清淨，聞佛授記，以信出家，修集善法；",
        "translation": "The prince Candracchattra, seeing that the Dharma was pure and genuine, having heard the Buddha’s prediction of enlightenment, renounced household life out of faith and practiced the right path.",
        "source": "T14n0475_003:0556c20_6"
    },
    {
        "source_sentence": "精進不久，得五神通，逮菩薩道，得陀羅尼，無斷辯才。",
        "translation": "Soon after making this effort, he attained the five supernatural powers, acquired the bodhisattva path, and mastered the dhāraṇī. He never lost his eloquence of elucidation.",
        "source": "T14n0475_003:0556c22_7"
    },
    {
        "source_sentence": "於佛滅後，以其所得神通、總持、辯才之力，滿十小劫，藥王如來所轉法輪隨而分布。",
        "translation": "In ten intermediate kalpas after the parinirvāṇa of the Buddha, he distributed the wheel of the Dharma taught by the Tathāgata Bhaiṣajyarāja Bodhisattva in accordance with the power of his supernormal knowledge, omniscience, and eloque",
        "source": "T14n0475_003:0556c23_8"
    },
    {
        "source_sentence": "月蓋比丘以守護法，勤行精進，即於此身，化百萬億人於阿耨多羅三藐三菩提，",
        "translation": "The monk Candracchattra, protecting the dharma and exerting himself energetically, inspired millions of living beings in this body to attain unexcelled complete perfect enlightenment.",
        "source": "T14n0475_003:0556c25_9"
    },
    {
        "source_sentence": "立不退轉；",
        "translation": "They establish nonregression.",
        "source": "T14n0475_003:0556c27_10"
    },
    {
        "source_sentence": "十四那由他人，深發聲聞、辟支佛心；",
        "translation": "Fourteenth, the people of Jambudvfpa deeply aroused the minds of śrāvakas and pratyekabuddhas.",
        "source": "T14n0475_003:0556c27_11"
    },
    {
        "source_sentence": "無量眾生得生天上。",
        "translation": "Measureless sentient beings can be born in heaven.",
        "source": "T14n0475_003:0556c28_12"
    },
    {
        "source_sentence": "天帝！",
        "translation": "O ruler of gods!",
        "source": "T14n0475_003:0556c28_13"
    },
    {
        "source_sentence": "時王寶蓋豈異人乎？",
        "translation": "Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is",
        "source": "T14n0475_003:0556c28_14"
    },
    {
        "source_sentence": "今現得佛，號寶炎如來；",
        "translation": "In the present life he has attained buddhahood, whose name is Jewel Flame Tathāgata.",
        "source": "T14n0475_003:0556c29_15"
    },
    {
        "source_sentence": "其王千子，即賢劫中千佛是也。",
        "translation": "The king's thousand sons are the thousand buddhas of the good eon.",
        "source": "T14n0475_003:0556c29_16"
    },
    {
        "source_sentence": "從迦羅鳩孫駄為始得佛，最後如來號曰樓至。",
        "translation": "From Kālakūṭa, the first to attain buddhahood was Sunetra, and the last Tathāgata was named Ruci.",
        "source": "T14n0475_003:0557a01_17"
    },
    {
        "source_sentence": "月蓋比丘，即我身是。",
        "translation": "The monk Candracchattra is none other than myself.",
        "source": "T14n0475_003:0557a02_18"
    },
    {
        "source_sentence": "如是，天帝！",
        "translation": "So it is, prince of gods!",
        "source": "T14n0475_003:0557a03_19"
    },
    {
        "source_sentence": "當知此要，以法供養於諸供養為上為最，第一無比。",
        "translation": "You should know that these essentials are the best of all offerings to the Dharma and the highest among all offerings, unsurpassed by anyone.",
        "source": "T14n0475_003:0557a03_20"
    },
    {
        "source_sentence": "是故天帝！",
        "translation": "That's why, Emperor!",
        "source": "T14n0475_003:0557a04_21"
    },
    {
        "source_sentence": "當以法之供養，供養於佛。」",
        "translation": "You should make offerings of the Dharma and make offerings to the Buddha.",
        "source": "T14n0475_003:0557a05_0"
    },
    {
        "source_sentence": "維摩詰所說經囑累品第十四",
        "translation": "Chapter Fourteen of the Entrustment of the Scripture Spoken by Vimalakīrti",
        "source": "T14n0475_003:0557a06_0"
    },
    {
        "source_sentence": "於是佛告彌勒菩薩言：「彌勒！",
        "translation": "The Buddha then addressed Maitreya Bodhisattva, saying, Maitreya!",
        "source": "T14n0475_003:0557a07_0"
    },
    {
        "source_sentence": "我今以是無量億阿僧祇劫所集阿耨多羅三藐三菩提法，付囑於汝。",
        "translation": "I now entrust to you this teaching of unsurpassed, correct, and complete enlightenment that I've collected for measureless millions of incalculable eons.",
        "source": "T14n0475_003:0557a07_1"
    },
    {
        "source_sentence": "如是輩經，於佛滅後末世之中，汝等當以神力，廣宣流布於閻浮提，無令斷絕。",
        "translation": "In the final age after the parinirvāṇa of the Buddha, you should use your supernatural powers to spread widely throughout Jambudvfpa so that they will not be cut off.",
        "source": "T14n0475_003:0557a09_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0475_003:0557a11_3"
    },
    {
        "source_sentence": "未來世中，當有善男子、善女人，及天、龍、鬼神、乾闥婆、羅剎等，",
        "translation": "In the future, there will be good men and good women, gods, dragons, ghosts, spirits, gandharvas, rāṣas, and so forth.",
        "source": "T14n0475_003:0557a11_4"
    },
    {
        "source_sentence": "發阿耨多羅三藐三菩提心，樂于大法；",
        "translation": "They give rise to the determination for unexcelled complete perfect enlightenment and delight in the great teaching.",
        "source": "T14n0475_003:0557a12_5"
    },
    {
        "source_sentence": "若使不聞如是等經，則失善利。",
        "translation": "If someone doesn't hear such sūtras, they'll lose good benefits.",
        "source": "T14n0475_003:0557a13_6"
    },
    {
        "source_sentence": "如此輩人，聞是等經，必多信樂，發希有心，當以頂受，隨諸眾生所應得利，",
        "translation": "Such a group of people who hear this kind of scripture will surely have great faith in it. They will give rise to rare thoughts and accept it with their heads, according to the benefits that sentient beings should attain.",
        "source": "T14n0475_003:0557a14_7"
    },
    {
        "source_sentence": "而為廣說。",
        "translation": "It's explained in detail for you.",
        "source": "T14n0475_003:0557a16_8"
    },
    {
        "source_sentence": "「彌勒當知！",
        "translation": "You should know, Maitreya!",
        "source": "T14n0475_003:0557a16_9"
    },
    {
        "source_sentence": "菩薩有二相。",
        "translation": "Bodhisattvas have two characteristics.",
        "source": "T14n0475_003:0557a16_10"
    },
    {
        "source_sentence": "何謂為二？",
        "translation": "What are these two?",
        "source": "T14n0475_003:0557a17_11"
    },
    {
        "source_sentence": "一者，好於雜句文飾之事；",
        "translation": "The first is that they are fond of mixed words, phrases, and syllables.",
        "source": "T14n0475_003:0557a17_12"
    },
    {
        "source_sentence": "二者，不畏深義如實能入。",
        "translation": "The second is that they aren't afraid of the profound meaning and can truly enter it.",
        "source": "T14n0475_003:0557a17_13"
    },
    {
        "source_sentence": "若好雜句文飾事者，當知是為新學菩薩；",
        "translation": "Those who like to adorn themselves with mixed words and phrases should be known as newly training enlightening beings.",
        "source": "T14n0475_003:0557a18_14"
    },
    {
        "source_sentence": "若於如是無染無著甚深經典，無有恐畏，能入其中，聞已心淨，受持讀誦，",
        "translation": "“Furthermore, those who have no fear of such profound scriptures that are untainted and unattached will be able to enter into them. Having heard them, their minds will be pure; they will memorize, retain, and recite them",
        "source": "T14n0475_003:0557a19_15"
    },
    {
        "source_sentence": "如說修行，當知是為久修道行。",
        "translation": "You should know that this is the practice of cultivating enlightenment for a long time.",
        "source": "T14n0475_003:0557a21_16"
    },
    {
        "source_sentence": "「彌勒！",
        "translation": "“O Maitreya!",
        "source": "T14n0475_003:0557a22_17"
    },
    {
        "source_sentence": "復有二法，名新學者，不能決定於甚深法。",
        "translation": "Again, there are two things that are called new learners who can't determine the profound teaching.",
        "source": "T14n0475_003:0557a22_18"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T14n0475_003:0557a23_19"
    },
    {
        "source_sentence": "一者，所未聞深經，聞之驚怖生疑，不能隨順，毀謗不信，而作是言：『我初不聞。",
        "translation": "The first is that those who have never heard a profound teaching but are frightened by what they hear and doubtful, unable to follow it, disparaging it or not believing in it, say, 'I didn't hear it at first.",
        "source": "T14n0475_003:0557a23_20"
    },
    {
        "source_sentence": "從何所來？』",
        "translation": "Where did it come from?'",
        "source": "T14n0475_003:0557a25_21"
    },
    {
        "source_sentence": "二者，若有護持解說如是深經者，不肯親近、供養、恭敬，或時於中說其過惡。",
        "translation": "Second, if someone protects and understands the profound sūtras and explains them like this, they won't become intimate, offer support, or venerate them, or sometimes speak of their faults.",
        "source": "T14n0475_003:0557a25_22"
    },
    {
        "source_sentence": "有此二法，當知是為新學菩薩，為自毀傷，不能於深法中，調伏其心。",
        "translation": "These two things should be known as newly trained bodhisattvas who disparage themselves and aren't able to tame their minds in the profound Dharma.",
        "source": "T14n0475_003:0557a27_23"
    },
    {
        "source_sentence": "「彌勒！",
        "translation": "“O Maitreya!",
        "source": "T14n0475_003:0557a29_24"
    },
    {
        "source_sentence": "復有二法，菩薩雖信解深法，猶自毀傷，而不能得無生法忍。",
        "translation": "Again, there are two things that bodhisattvas believe in and understand the profound Dharma but still disparage themselves, yet they can't attain the tolerance of the nonarising of the Dharma.",
        "source": "T14n0475_003:0557a29_25"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T14n0475_003:0557b01_26"
    },
    {
        "source_sentence": "一者，輕慢新學菩薩，而不教誨；",
        "translation": "The first is that they despise newly trained enlightening beings and do not teach them.",
        "source": "T14n0475_003:0557b01_27"
    },
    {
        "source_sentence": "二者，雖解深法，而取相分別。",
        "translation": "2. Although they understand profound dharmas, they grasp characteristics and discriminate them.",
        "source": "T14n0475_003:0557b02_28"
    },
    {
        "source_sentence": "是為二法。」",
        "translation": "These are the two things.",
        "source": "T14n0475_003:0557b03_29"
    },
    {
        "source_sentence": "彌勒菩薩聞說是已，白佛言：「世尊！",
        "translation": "After hearing this, Maitreya said to the Buddha, Bhagavān!",
        "source": "T14n0475_003:0557b04_0"
    },
    {
        "source_sentence": "未曾有也。",
        "translation": "It's unprecedented.",
        "source": "T14n0475_003:0557b04_1"
    },
    {
        "source_sentence": "如佛所說，我當遠離如斯之惡，奉持如來無數阿僧祇劫所集阿耨多羅三藐三菩提法。",
        "translation": "As the Buddha has taught, I will be far removed from such evil and uphold the teaching of unsurpassed, correct, and complete enlightenment collected by the Tathāgata over countless incalculably long eons.",
        "source": "T14n0475_003:0557b05_2"
    },
    {
        "source_sentence": "若未來世善男子、善女人求大乘者，當令手得如是等經，與其念力，使受持讀誦、為他廣說。",
        "translation": "If there are good men and good women in the future who seek the great vehicle, they should cause them to obtain such sūtras in their hands, give them the power of mindfulness, make them memorize, recite, and explain them widely for others.",
        "source": "T14n0475_003:0557b07_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T14n0475_003:0557b09_4"
    },
    {
        "source_sentence": "若後末世，有能受持讀誦、為他說者，當知皆是彌勒神力之所建立。」",
        "translation": "If there are people in later generations who can memorize, recite, and preach for others, you should know that they'll all be established by Maitreya's supernormal power.",
        "source": "T14n0475_003:0557b09_5"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T14n0475_003:0557b11_0"
    },
    {
        "source_sentence": "彌勒！",
        "translation": "Maitreya!",
        "source": "T14n0475_003:0557b11_1"
    },
    {
        "source_sentence": "如汝所說，佛助爾喜。」",
        "translation": "As you say, the Buddha will help you rejoice.",
        "source": "T14n0475_003:0557b11_2"
    },
    {
        "source_sentence": "於是一切菩薩合掌白佛：「我等亦於如來滅後，十方國土廣宣流布阿耨多羅三藐三菩提法，",
        "translation": "Then all the bodhisattvas joined their palms and said to the Buddha: “After the parinirvāṇa of the Enlightened One, we too will spread widely throughout the lands of the ten directions the teaching of unexcelled, complete",
        "source": "T14n0475_003:0557b12_0"
    },
    {
        "source_sentence": "復當開導諸說法者，令得是經。」",
        "translation": "You will also enlighten those who teach the Dharma and make them attain this sūtra.",
        "source": "T14n0475_003:0557b14_1"
    },
    {
        "source_sentence": "爾時四天王白佛言：「世尊！",
        "translation": "It was then that the four celestial kings said to the Buddha, Bhagavān!",
        "source": "T14n0475_003:0557b15_0"
    },
    {
        "source_sentence": "在在處處、城邑聚落、山林曠野，有是經卷，讀誦解說者，我當率諸官屬，",
        "translation": "Wherever there are such fascicles of scriptures, cities, villages, mountains, forests, and wilderness, I will lead the officials who recite and explain them.",
        "source": "T14n0475_003:0557b15_1"
    },
    {
        "source_sentence": "為聽法故，往詣其所，擁護其人，面百由旬，令無伺求得其便者。」",
        "translation": "For the sake of listening to the teaching, he goes to them, protects them, and faces them for a hundred yojanas so that there's no one who wants to get an advantage over them.",
        "source": "T14n0475_003:0557b17_2"
    },
    {
        "source_sentence": "是時佛告阿難：「受持是經，廣宣流布。」",
        "translation": "The Buddha then addressed Ānanda, Accept this sūtra and spread it widely.",
        "source": "T14n0475_003:0557b19_0"
    },
    {
        "source_sentence": "阿難言：「唯然！",
        "translation": "Ānanda said, Yes!",
        "source": "T14n0475_003:0557b19_1"
    },
    {
        "source_sentence": "我已受持要者。",
        "translation": "I've already received the essentials of maintaining it.",
        "source": "T14n0475_003:0557b20_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T14n0475_003:0557b20_3"
    },
    {
        "source_sentence": "當何名斯經？」",
        "translation": "What should this sūtra be called?",
        "source": "T14n0475_003:0557b20_4"
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, Ānanda!",
        "source": "T14n0475_003:0557b21_5"
    },
    {
        "source_sentence": "是經名為『維摩詰所說』，亦名『不可思議解脫法門』，如是受持。」",
        "translation": "This sūtra is called 'Exlained by Vimalakīrti,' and it's also called the inconceivable liberation dharma-gate, which is thus received and maintained.",
        "source": "T14n0475_003:0557b21_6"
    },
    {
        "source_sentence": "佛說是經已，長者維摩詰、文殊師利、舍利弗、阿難等，及諸天、人、阿修羅一切大眾，",
        "translation": "After the Buddha had taught this sutra, the great Licchavi Vimalakīrti, Mañjuśrī, Śāriputra, Ānanda, and all the gods, humans, and asuras of the assembly were present.",
        "source": "T14n0475_003:0557b22_7"
    },
    {
        "source_sentence": "聞佛所說，皆大歡喜。",
        "translation": "They all heard what the Buddha taught and were greatly delighted.",
        "source": "T14n0475_003:0557b24_8"
    },
    {
        "source_sentence": "維摩詰經卷下",
        "translation": "Vimalakīrti-nirdeśa-sūtra, Volume II",
        "source": "T14n0475_003:0557b26_0"
    }
]