[
    {
        "source_sentence": "如來示教勝軍王經",
        "translation": "Sutra of the Teachings of the Tathāgata, the King of victorious armies",
        "source": "T14n0515_001:0786c18_0"
    },
    {
        "source_sentence": "大唐三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial edict by the Tripiṭaka Master Xuanzang of the Great Tang dynasty",
        "source": "T14n0515_001:0786c20_0"
    },
    {
        "source_sentence": "如是我聞：一時，薄伽梵在室羅筏住誓多林給孤獨園，與其無量大苾芻眾、天人等俱。",
        "translation": "Thus I have heard: One time, the Bhagavān was staying at Śrāvastī in Jeta’s Grove, Anāthapiṇḍada’s Park, accompanied by an immeasurable large assembly of monks and gods.",
        "source": "T14n0515_001:0786c21_0"
    },
    {
        "source_sentence": "爾時，憍薩羅主勝軍大王，尊位威德皆悉成就，為欲瞻仰請問佛故，嚴駕出城往如來所。",
        "translation": "At the time, the lord of Kośala, the victorious army king, his honorable position and authoritative qualities all perfected, and because he wanted to venerate and question the Buddha, he ordered a carriage to leave the city and go to the Tathāgata's place.",
        "source": "T14n0515_001:0786c22_1"
    },
    {
        "source_sentence": "乘至下處步進入園，遙見世尊坐一樹下端嚴殊妙，諸根閑寂其心宴然，",
        "translation": "From a distance he saw the World-honored One seated at the foot of a tree. His hair stood on end and his senses were tranquil; his mind was absorbed in contemplation.",
        "source": "T14n0515_001:0787a01_2"
    },
    {
        "source_sentence": "已能善得最上調順寂止究竟，已能善到第一調順寂止彼岸，善能密護降伏諸根，",
        "translation": "Having well attained the ultimate tranquility of supreme harmony, they can reach the other shore of the first tranquility of harmony. They can skillfully guard and subdue their faculties.",
        "source": "T14n0515_001:0787a03_3"
    },
    {
        "source_sentence": "為丈夫龍、丈夫牛王、丈夫良馬，清淨無撓如澄泉池，威德熾盛光明照曜如大金山，",
        "translation": "For the sake of strong dragons, strong cattle kings, strong horses, and strong men they are as pure and unobstructed as clear springs and ponds. Their mighty virtue blazing brightly shines like a great golden mountain.",
        "source": "T14n0515_001:0787a05_4"
    },
    {
        "source_sentence": "有三十二大丈夫相圓滿莊嚴，八十隨好間飾支體。",
        "translation": "It has the thirty-two marks of a great being, perfectly adorned, and embellished with eighty secondary signs.",
        "source": "T14n0515_001:0787a07_5"
    },
    {
        "source_sentence": "時，勝軍王遙見佛已，心喜踊躍不能自勝，便即脫去剎帝利種灌頂大王隨身所有五標尊飾：一者、頂上寶冠；",
        "translation": "When the victorious army king saw the Buddha from a distance, he was overjoyed and jumped for joy but could not control himself. So he dismounted to leave the royal cakravartin of the kṣatriya lineage and carried on his body all the five kinds of adornments of greatness:",
        "source": "T14n0515_001:0787a08_6"
    },
    {
        "source_sentence": "二者、所執神劍；",
        "translation": "The second is the divine sword that they hold.",
        "source": "T14n0515_001:0787a11_7"
    },
    {
        "source_sentence": "三者、眾寶傘蓋；",
        "translation": "The third is the umbrella of myriad jewels.",
        "source": "T14n0515_001:0787a11_8"
    },
    {
        "source_sentence": "四者、末尼扇拂；",
        "translation": "The fourth is the exhalation with a fan made of manas.",
        "source": "T14n0515_001:0787a11_9"
    },
    {
        "source_sentence": "五者、織成寶履。",
        "translation": "The fifth is the weaving of jeweled footwear.",
        "source": "T14n0515_001:0787a12_10"
    },
    {
        "source_sentence": "既去是已詣如來所，到已頂禮世尊雙足，右繞三匝退坐一面。",
        "translation": "Having departed, he approached the Tathāgata. Having arrived there, he bowed his head at the Buddha’s feet and, circumambulating him three times to his right, withdrew to one side.",
        "source": "T14n0515_001:0787a12_11"
    },
    {
        "source_sentence": "爾時，勝軍大王坐一面已，而白佛言：「大悲世尊！",
        "translation": "It was then that the victorious army king sat to one side and said to the Buddha, Greatly compassionate Bhagavān!",
        "source": "T14n0515_001:0787a14_0"
    },
    {
        "source_sentence": "惟願如來哀愍教授，惟願善逝哀愍教誡，令我長夜證於大義利益安樂。」",
        "translation": "May the Tathāgata have mercy on me and teach me, and may the Bhagavān have mercy on me and admonish me so that I'll realize the benefit and comfort of great meaning for a long time.",
        "source": "T14n0515_001:0787a15_1"
    },
    {
        "source_sentence": "爾時，世尊告大王曰：「善哉，善哉！",
        "translation": "It was then that the Bhagavān addressed the great king, Good, good!",
        "source": "T14n0515_001:0787a17_0"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T14n0515_001:0787a17_1"
    },
    {
        "source_sentence": "汝今乃能請問如來如是大義。",
        "translation": "Now, you're able to ask the Tathāgata about such a great meaning.",
        "source": "T14n0515_001:0787a17_2"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T14n0515_001:0787a18_3"
    },
    {
        "source_sentence": "汝今為大國主，應以正法勿以邪法，應隨法行勿隨非法。",
        "translation": "Now that you're the king of a great country, you should follow the right teaching and not the wrong teaching, and you should practice according to the teaching and not according to what's unlawful.",
        "source": "T14n0515_001:0787a18_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0515_001:0787a20_0"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0787a20_1"
    },
    {
        "source_sentence": "若有國王或諸王等，棄捨正法以諸邪法而作國王，彼於現在為諸聖賢之所訶毀，",
        "translation": "If there are kings or other kings who abandon the true teaching and become kings because of wrong teachings, they will be reprimanded by the noble ones in the present.",
        "source": "T14n0515_001:0787a20_2"
    },
    {
        "source_sentence": "後致憂悔，身壞命終墮諸惡趣，生地獄中受諸劇苦；",
        "translation": "As a result, they will later be grieved and regretted. At the breaking up of the body at death they will fall into various evil destinies and be reborn in hell to suffer all kinds of cruel tortures.",
        "source": "T14n0515_001:0787a22_3"
    },
    {
        "source_sentence": "又若國王或諸王等，棄捨邪法以其正法而作國王，彼於現在為眾聖賢之所稱讚，",
        "translation": "Also, if kings or other kings abandon wrong teachings and become kings based on their right teaching, they'll be praised by the noble ones in the present.",
        "source": "T14n0515_001:0787a23_4"
    },
    {
        "source_sentence": "後無憂悔，身壞命終超昇善趣，生諸天中受諸妙樂。",
        "translation": "Later, without sorrow or regret, he'll be born in a good destiny when his body breaks up and his life ends, and he'll be born among the gods and experience marvelous happiness.",
        "source": "T14n0515_001:0787a25_5"
    },
    {
        "source_sentence": "「大王！",
        "translation": "Great king!",
        "source": "T14n0515_001:0787a27_0"
    },
    {
        "source_sentence": "譬如父母憐愍於子，心常欲令離苦得樂；",
        "translation": "“Furthermore, it is analogous to a father and mother who have compassion for their children. Their minds always want to free them from suffering and give them happiness.",
        "source": "T14n0515_001:0787a27_1"
    },
    {
        "source_sentence": "王亦應爾，於諸國邑所有眾生，僮僕、作使、輔臣、僚佐，應以諸佛所說四攝而授受之。",
        "translation": "The king should also do so, for all the sentient beings in the cities, servants, messengers, assistants, and officials should be entrusted with the four gatherings taught by the buddhas.",
        "source": "T14n0515_001:0787a28_2"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T14n0515_001:0787b01_3"
    },
    {
        "source_sentence": "一者、布施；",
        "translation": "The first is generosity.",
        "source": "T14n0515_001:0787b01_4"
    },
    {
        "source_sentence": "二者、愛語；",
        "translation": "The second is affectionate speech.",
        "source": "T14n0515_001:0787b01_5"
    },
    {
        "source_sentence": "三者、利行；",
        "translation": "The third is beneficial action.",
        "source": "T14n0515_001:0787b01_6"
    },
    {
        "source_sentence": "四者、同事。",
        "translation": "4. co-workers.",
        "source": "T14n0515_001:0787b02_7"
    },
    {
        "source_sentence": "如是善攝國邑眾生，僮僕、作使、輔臣、僚佐，攝於二義同事同歸。",
        "translation": "Thus, they skillfully gather all the sentient beings in their countries, servants, messengers, assistants, and officials, who are collected into two meanings and work together to share the same refuge.",
        "source": "T14n0515_001:0787b02_8"
    },
    {
        "source_sentence": "何等二義？",
        "translation": "What are these two meanings?",
        "source": "T14n0515_001:0787b03_9"
    },
    {
        "source_sentence": "一者、現在；",
        "translation": "The first is the present.",
        "source": "T14n0515_001:0787b03_10"
    },
    {
        "source_sentence": "二者、未來。",
        "translation": "The second is future.",
        "source": "T14n0515_001:0787b04_11"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0787b05_0"
    },
    {
        "source_sentence": "譬如男子或諸女人，於其夢中夢心所見，可愛園林可愛山谷，可愛國邑并諸異類，",
        "translation": "“Furthermore, it is like the case of a man or woman who has a dream in which he or she sees beautiful forests, beautiful mountains, beautiful valleys, beautiful cities, and various kinds of strange creatures.",
        "source": "T14n0515_001:0787b05_1"
    },
    {
        "source_sentence": "彼夢覺已所見皆無。",
        "translation": "What they see after awakening in a dream is nonexistent.",
        "source": "T14n0515_001:0787b07_2"
    },
    {
        "source_sentence": "如是，大王！",
        "translation": "So it is, great king!",
        "source": "T14n0515_001:0787b07_3"
    },
    {
        "source_sentence": "國祚身命虛偽無常，一切皆如夢之所見。",
        "translation": "The kingdom's body and life are false and impermanent, and everything is like a dream that sees them.",
        "source": "T14n0515_001:0787b07_4"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0787b08_5"
    },
    {
        "source_sentence": "王富貴樂、王自在樂、王愛欲樂，及餘所受諸欲樂具，所謂象馬車步諸軍宮殿，",
        "translation": "The king's wealth and prosperity, the king's sovereignty, the king's desires and pleasures, and the other things he receives are called elephants, horses, chariots, vehicles, armies, palaces, and palaces.",
        "source": "T14n0515_001:0787b09_6"
    },
    {
        "source_sentence": "后妃太子諸王，輔臣僚佐防衛士眾，父母兄弟姊妹妻妾，男女大小僮僕作使國邑眾生，",
        "translation": "The queens, princes, princes, ministers, assistants, officials, soldiers, guards, parents, brothers, sisters, wives, concubines, male and female servants, messengers, kingdoms, cities, and other sentient beings.",
        "source": "T14n0515_001:0787b10_7"
    },
    {
        "source_sentence": "金銀珍寶末尼真珠，衣服財穀庫藏等物，如是所有諸欲樂具，於命終時皆當棄捨，",
        "translation": "At the end of his life, he'll discard gold, silver, precious treasures, maṇi jewels, clothing, possessions, storehouses, and other things like these objects of desire and pleasure.",
        "source": "T14n0515_001:0787b12_8"
    },
    {
        "source_sentence": "獨往後世無一相隨。",
        "translation": "There's no single characteristic that follows them alone in the afterlife.",
        "source": "T14n0515_001:0787b14_9"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0787b16_0"
    },
    {
        "source_sentence": "如上所說一切樂具，非常非恒不可保信，皆變易法迅速不停，流轉移動終歸壞滅，",
        "translation": "As explained above, all the means of enjoyment are neither eternal nor eternal and cannot be maintained or believed in. All things change quickly and ceaselessly; they continue to change and eventually disintegrate.",
        "source": "T14n0515_001:0787b16_1"
    },
    {
        "source_sentence": "念念遷謝後為灰燼，究竟同趣滅盡之門，是失壞法有諸怖畏、有諸災橫、多諸愁惱，",
        "translation": "Each thought passes away and then becomes ashes, ultimately the same as the path to cessation of extinction. This is the principle of loss and destruction, which has fears, dangers, and many sorrows.",
        "source": "T14n0515_001:0787b18_2"
    },
    {
        "source_sentence": "皆是墜墮零落斷壞離散之法。",
        "translation": "They are all falling, scattered, and disintegrating dharmas.",
        "source": "T14n0515_001:0787b20_3"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0787b21_0"
    },
    {
        "source_sentence": "譬如樹林先見開華，尋復結果後還無果，先見其葉榮茂青翠，尋復萎黃後皆凋落。",
        "translation": "It's like a forest that first sees the blooming flowers and then returns without fruit. First, it sees its leaves flourish and grow green, and then they wither and fade after all of them.",
        "source": "T14n0515_001:0787b21_1"
    },
    {
        "source_sentence": "如是，大王！",
        "translation": "So it is, great king!",
        "source": "T14n0515_001:0787b23_2"
    },
    {
        "source_sentence": "國祚身命，王富貴樂、王自在樂、王愛欲樂，及餘所愛諸欲樂具，所謂象馬車步軍等，",
        "translation": "The king's throne, body, and life, the king's wealth, prosperity, nobility, sovereignty, desire, pleasure, and other delightful objects of desire are called elephants, horses, chariots, foot soldiers, and so forth.",
        "source": "T14n0515_001:0787b23_3"
    },
    {
        "source_sentence": "廣說乃至皆是墜墮零落斷壞離散之法，亦復如是。",
        "translation": "It's likewise explained in detail up to the point where they all fall into a scattered state of cessation and disintegration.",
        "source": "T14n0515_001:0787b25_4"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0787b27_0"
    },
    {
        "source_sentence": "如大火聚，先見熾然復極熾然，轉遍熾然後皆洞然，雖久熾盛終歸滅盡。",
        "translation": "It's like a great cluster of fire that first sees the blazing and then becomes extremely blazing, and after becoming completely blazing, they're all engulfed. Even though it's blazing for a long time, it will eventually cease.",
        "source": "T14n0515_001:0787b27_1"
    },
    {
        "source_sentence": "如是，大王！",
        "translation": "So it is, great king!",
        "source": "T14n0515_001:0787b28_2"
    },
    {
        "source_sentence": "國祚身命，王富貴樂、王自在樂、王愛欲樂，及餘所受諸欲樂具，所謂象馬車步軍等，",
        "translation": "The king's wealth and prosperity, the king's happiness, the king's happiness of sovereignty, the king's happiness of desire, and the other necessities that he receives are called elephants, horses, chariots, foot soldiers, and so forth.",
        "source": "T14n0515_001:0787b29_3"
    },
    {
        "source_sentence": "廣說乃至皆是墜墮零落斷壞離散之法，亦復如是。",
        "translation": "It's likewise explained in detail up to the point where they all fall into a scattered state of cessation and disintegration.",
        "source": "T14n0515_001:0787c02_4"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0787c04_0"
    },
    {
        "source_sentence": "如日月輪，有大神用具大勢力，放大光明以自莊嚴，遍照世間終歸隱沒。",
        "translation": "It's like the sun and moon wheel, which has great supernormal powers that are endowed with great momentum, emanate great light to adorn themselves, illuminate the world, and ultimately go into hiding.",
        "source": "T14n0515_001:0787c04_1"
    },
    {
        "source_sentence": "如是，大王！",
        "translation": "So it is, great king!",
        "source": "T14n0515_001:0787c05_2"
    },
    {
        "source_sentence": "國祚身命，王富貴樂、王自在樂、王愛欲樂，及餘所受諸欲樂具，所謂象馬車步軍等，",
        "translation": "The king's wealth and prosperity, the king's happiness, the king's happiness of sovereignty, the king's happiness of desire, and the other necessities that he receives are called elephants, horses, chariots, foot soldiers, and so forth.",
        "source": "T14n0515_001:0787c06_3"
    },
    {
        "source_sentence": "廣說乃至皆是墜墮零落斷壞離散之法，亦復如是。",
        "translation": "It's likewise explained in detail up to the point where they all fall into a scattered state of cessation and disintegration.",
        "source": "T14n0515_001:0787c08_4"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0787c10_0"
    },
    {
        "source_sentence": "譬如大雲遍覆虛空，暴風疾雷掣電注雨，震動天地須臾散滅。",
        "translation": "It's like a great cloud covering the sky, a storm of wind, thunder, lightning, and rain that shakes heaven and earth and disintegrates in a moment.",
        "source": "T14n0515_001:0787c10_1"
    },
    {
        "source_sentence": "如是，大王！",
        "translation": "So it is, great king!",
        "source": "T14n0515_001:0787c11_2"
    },
    {
        "source_sentence": "國祚身命，王富貴樂、王自在樂、王愛欲樂，及餘所受諸欲樂具，所謂象馬車步軍等，",
        "translation": "The king's wealth and prosperity, the king's happiness, the king's happiness of sovereignty, the king's happiness of desire, and the other necessities that he receives are called elephants, horses, chariots, foot soldiers, and so forth.",
        "source": "T14n0515_001:0787c11_3"
    },
    {
        "source_sentence": "廣說乃至皆是墜墮零落斷壞離散之法，亦復如是。",
        "translation": "It's likewise explained in detail up to the point where they all fall into a scattered state of cessation and disintegration.",
        "source": "T14n0515_001:0787c13_4"
    },
    {
        "source_sentence": "是故，大王！",
        "translation": "Therefore, great king!",
        "source": "T14n0515_001:0787c15_5"
    },
    {
        "source_sentence": "應善勤修，隨無常觀、隨盡滅觀，於自命終常當驚懼，為大國王應以正法勿以非法，",
        "translation": "You should cultivate well and diligently the contemplation of impermanence and the contemplation of total cessation. At the end of your life you should always be frightened by fear. Being a great king, you should follow the right teaching and not the wrong one.",
        "source": "T14n0515_001:0787c15_6"
    },
    {
        "source_sentence": "應隨法行勿隨非法。",
        "translation": "You should practice according to the Dharma and not according to what's not the Dharma.",
        "source": "T14n0515_001:0787c17_7"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0787c18_0"
    },
    {
        "source_sentence": "如四大山從四方來，牢固堅密無有缺漏無諸間隙，周匝充遍總一合成，",
        "translation": "It is like the case of the four great mountains that come from the four directions, which are firm and unbreakable, without gaps or gaps. Their circumference fills all together into a single conglomeration.",
        "source": "T14n0515_001:0787c18_1"
    },
    {
        "source_sentence": "上盡虛空下窮地際，其中所有一切草木枝條花葉，及諸有情蠢動之類皆被磨滅，",
        "translation": "All the grass, trees, branches, leaves, flowers, and other sentient beings therein will be crushed and destroyed.",
        "source": "T14n0515_001:0787c19_2"
    },
    {
        "source_sentence": "難以決勇而可逃避，難以勢力而能抗拒，難以呪術財貨藥物而可禁止。",
        "translation": "It's difficult to escape with resolve, difficult to resist with strength, and difficult to prohibit with spells, possessions, goods, and medicines.",
        "source": "T14n0515_001:0787c21_3"
    },
    {
        "source_sentence": "如是，大王！",
        "translation": "So it is, great king!",
        "source": "T14n0515_001:0787c23_4"
    },
    {
        "source_sentence": "世有四種大怖畏事，各來磨滅一切眾生，難以決勇而可逃避，難以勢力而能抗拒，",
        "translation": "In the world there are four great fears, each of which comes to harm and destroy all sentient beings. It is difficult for them to be determined and brave enough to flee; it is difficult for them to resist by force.",
        "source": "T14n0515_001:0787c23_5"
    },
    {
        "source_sentence": "難以呪術財貨藥物而能禁止。",
        "translation": "It's difficult to spell, possessions, goods, and medicines that can be prohibited.",
        "source": "T14n0515_001:0787c25_6"
    },
    {
        "source_sentence": "「云何四種大怖畏事？",
        "translation": "(5) What is the fourfold great fear?",
        "source": "T14n0515_001:0787c26_7"
    },
    {
        "source_sentence": "大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0787c26_8"
    },
    {
        "source_sentence": "一者、老來逼害，磨滅眾生少壯；",
        "translation": "The first is that old age oppresses and harms them, crushing the vigor of sentient beings.",
        "source": "T14n0515_001:0787c26_9"
    },
    {
        "source_sentence": "二者、病來逼害，磨滅眾生調適；",
        "translation": "The second is that they are oppressed by the coming of sickness and harmful, grinding away sentient beings’ well-being.",
        "source": "T14n0515_001:0787c27_10"
    },
    {
        "source_sentence": "三者、死來逼害，磨滅眾生壽命；",
        "translation": "The third is that they harm sentient beings in the coming of death and crush their vitality.",
        "source": "T14n0515_001:0787c28_11"
    },
    {
        "source_sentence": "四者、衰來逼害，磨滅眾生興盛。",
        "translation": "The fourth is that they are oppressed by decay and harmful, grinding away sentient beings and flourishing.",
        "source": "T14n0515_001:0787c29_12"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0788a01_0"
    },
    {
        "source_sentence": "譬如師子為眾獸王，入鹿群中搏取一鹿，若噉未噉自在無難。",
        "translation": "It's like when a lion becomes the king of all animals and enters a herd of deer to wrestle a deer, but if he fights or doesn't fight freely, there's no difficulty.",
        "source": "T14n0515_001:0788a01_1"
    },
    {
        "source_sentence": "其鹿爾時先所騰勇，入師子口無復能為。",
        "translation": "At the time, that deer was so brave and courageous that it entered the lion's mouth and couldn't do anything.",
        "source": "T14n0515_001:0788a02_2"
    },
    {
        "source_sentence": "如是，大王！",
        "translation": "So it is, great king!",
        "source": "T14n0515_001:0788a03_3"
    },
    {
        "source_sentence": "一切眾生既入無常師子王口，所有勢力無復能為。",
        "translation": "All sentient beings have entered the mouth of the impermanent lion king, and there's no other power that can do it.",
        "source": "T14n0515_001:0788a03_4"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0788a05_5"
    },
    {
        "source_sentence": "譬如有人勇健多力毒箭所中，一切威猛皆悉摧滅。",
        "translation": "It's like a person who's bold and powerful, and when they're attacked by a poisonous arrow, all their might and strength are completely destroyed.",
        "source": "T14n0515_001:0788a05_6"
    },
    {
        "source_sentence": "如是，大王！",
        "translation": "So it is, great king!",
        "source": "T14n0515_001:0788a06_7"
    },
    {
        "source_sentence": "一切眾生剛強佷戾，死箭所中無復勢力、無復救護、無所歸依、無所投竄，",
        "translation": "All sentient beings are bound by the arrow of death and have no power, no protection, no refuge, and nothing to throw away.",
        "source": "T14n0515_001:0788a06_8"
    },
    {
        "source_sentence": "臨欲捨命解支節時，血肉枯竭心胸熱惱，焦渴所逼張口大息，手足紛亂無所堪能，",
        "translation": "When he was about to give up his life and dismember the limbs, his flesh and blood dried up, his heart and chest were overcome with feverish distress, his mouth choked by hunger and thirst, his hands and feet in disarray, unable to move.",
        "source": "T14n0515_001:0788a08_9"
    },
    {
        "source_sentence": "無有勢力涎涕交流，大小便利穢污身體，六根閉塞喉顙哽噎喘息逾急，",
        "translation": "There's no power to exchange saliva and tears, the body defiled by excretion and urination, the six faculties are shut off, and the throat is choked, choked, and panting more than anxiously.",
        "source": "T14n0515_001:0788a10_10"
    },
    {
        "source_sentence": "良醫拱手棄諸妙藥。",
        "translation": "The good doctor folded his hand and discarded the wonderful medicines.",
        "source": "T14n0515_001:0788a12_0"
    },
    {
        "source_sentence": "其所飲噉美味珍饌無不悉捨，偃臥床枕臨往異趣淪沒無際，生老病死無常瀑流，",
        "translation": "Their food and drink are all delicious and delicious, and they don’t fail to relinquish it. They lie down on their beds or pillows, approach different destinies without limit, and sink into birth, old age, sickness, and death—all impermanent floods that flow like rivers.",
        "source": "T14n0515_001:0788a12_1"
    },
    {
        "source_sentence": "至臨終位餘命無幾，業有力故後有現前。",
        "translation": "When reaching the state of final nirvana, there is not long for the remaining duration of life. Because karmic forces are strong, later existences are present.",
        "source": "T14n0515_001:0788a14_2"
    },
    {
        "source_sentence": "甚大怖畏琰魔王使，廣大黑闇夜分所吞，出息入息最後將滅，唯獨一身無有第二及餘伴侶，",
        "translation": "He was terrified and frightened. The demon king Diem, the messenger of great fear, was swallowed by the vast darkness of night. His inhalation and exhalation were about to cease at the very last moment. There was only one body alone; there was no second or any other companion.",
        "source": "T14n0515_001:0788a15_3"
    },
    {
        "source_sentence": "奄背此生歸於後世。",
        "translation": "They'll turn their backs on this life and return to the afterlife.",
        "source": "T14n0515_001:0788a17_4"
    },
    {
        "source_sentence": "是大移轉趣大叢林，入大黑闇遊大曠野，泛大溟海業風所飄，往無標記冥寞方所，",
        "translation": "This great commotion proceeded toward a great jungle, entering the great darkness of darkness and traveling in great wilderness, floating on the great sea of action and being blown by the wind. They went to this place where there was no sign of existence, where they lived in seclusion.",
        "source": "T14n0515_001:0788a17_5"
    },
    {
        "source_sentence": "當於爾時無異救護、無異歸依、無異投竄，唯除正法。",
        "translation": "At that point, there's no difference in rescue, no difference in refuge, and no difference in entry, except for the right teaching.",
        "source": "T14n0515_001:0788a19_6"
    },
    {
        "source_sentence": "大王！",
        "translation": "Great king!",
        "source": "T14n0515_001:0788a21_7"
    },
    {
        "source_sentence": "彼於爾時，唯有正法能為救護、能為宮室、能作歸依，是所奔趣是所投竄，",
        "translation": "At that point, only the right teaching can rescue them, can protect their palace, and can provide refuge for them. This is where they run and this is where they flee.",
        "source": "T14n0515_001:0788a21_8"
    },
    {
        "source_sentence": "能拔眾生出生死苦。",
        "translation": "It can remove the suffering of birth-and-death for sentient beings.",
        "source": "T14n0515_001:0788a22_9"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0788a23_10"
    },
    {
        "source_sentence": "譬如有人寒苦所逼，唯有煖火日光衣等，所能止息而可獲安；",
        "translation": "Good man, it is analogous to someone who is tormented by cold and suffering. It is only warmth, fire, sun, light, clothing, etc., that can make him feel at ease through the power of calming his body.",
        "source": "T14n0515_001:0788a23_11"
    },
    {
        "source_sentence": "熱苦所逼唯林泉等；",
        "translation": "The only thing oppressed by heat and suffering is forests and streams, etc.",
        "source": "T14n0515_001:0788a24_12"
    },
    {
        "source_sentence": "若涉遠道唯清涼陰；",
        "translation": "If one travels the distant path, there is only the shade of clarity and coolness.",
        "source": "T14n0515_001:0788a25_13"
    },
    {
        "source_sentence": "若渴所逼唯清冷水；",
        "translation": "If they are oppressed by thirst, the only thing they need is clear, cool water.",
        "source": "T14n0515_001:0788a25_14"
    },
    {
        "source_sentence": "若飢所逼唯多美膳，若病所逼惟良醫藥及供侍者；",
        "translation": "If they are hungry and oppressed by hunger, they have only plenty of delicious food. If they are sick and oppressed by illness, they take only good medicines and attendants as their offerings.",
        "source": "T14n0515_001:0788a26_15"
    },
    {
        "source_sentence": "若怖所逼惟強伴侶。",
        "translation": "If he's afraid and oppressed by fear, he'll only have a strong companion.",
        "source": "T14n0515_001:0788a27_16"
    },
    {
        "source_sentence": "如是，大王！",
        "translation": "So it is, great king!",
        "source": "T14n0515_001:0788a28_17"
    },
    {
        "source_sentence": "一切眾生死箭所中，無復勢力、無復救護、無所歸依、無所投竄，臨欲捨命解支節時，",
        "translation": "All sentient beings in the arrow of death have no power, no protection, no refuge, and no place to throw themselves. When they are about to give up their life and dismember their limbs,",
        "source": "T14n0515_001:0788a28_18"
    },
    {
        "source_sentence": "血肉枯竭心胸熱惱，焦渴所逼張口太息，手足紛亂無所堪能，廣說乃至彼於爾時唯有正法，",
        "translation": "Their flesh and blood dry up, their hearts and chests feverish, their mouths overwhelmed by hunger and thirst, their hands and feet in disarray, unable to do anything. They explain this extensively until they realize that there is only the true teaching at that time.",
        "source": "T14n0515_001:0788b01_19"
    },
    {
        "source_sentence": "能為救護、能為宮室、能作歸依，是所奔趣是所投竄，能拔眾生出生死苦。",
        "translation": "Being able to rescue, protect, serve as a palace, and take refuge is the path that's pursued and the path that's cast, which removes the suffering of birth-and-death for sentient beings.",
        "source": "T14n0515_001:0788b03_20"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0515_001:0788b05_21"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0788b06_0"
    },
    {
        "source_sentence": "如是身者，雖加守護雖久洗飾，雖以眾多上妙飲食恣意飽滿，及至臨終，",
        "translation": "Such a body is guarded, washed and adorned for a long time, fed with many kinds of delicious food and drink at will until it reaches its end.",
        "source": "T14n0515_001:0788b06_1"
    },
    {
        "source_sentence": "要當不免飢渴所逼而便捨命。",
        "translation": "They won't be able to escape being tormented by hunger and thirst and then abandon their lives.",
        "source": "T14n0515_001:0788b07_2"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0788b09_0"
    },
    {
        "source_sentence": "如是身者，雖常澡浴，塗香末香熏香花鬘隨意嚴飾，由此自體穢漏成故，",
        "translation": "Such a body, even though always bathed and bathing, is adorned with ointments, powders, perfumes, flowers, garlands, and ornaments as they wish. This is due to the formation of impure influences in its own body:",
        "source": "T14n0515_001:0788b09_1"
    },
    {
        "source_sentence": "臨捨命時，終必歸於不淨臭穢。",
        "translation": "When he's about to relinquish his life, he'll surely return to something impure and smelly.",
        "source": "T14n0515_001:0788b10_2"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0788b12_0"
    },
    {
        "source_sentence": "如是身者，雖以種種上妙衣服覆蔽纏裹，由此自身諸不淨物所合成故，",
        "translation": "Such a body is enclosed by various kinds of sublime clothing, because it is made up of the impure substances of one’s own body.",
        "source": "T14n0515_001:0788b12_1"
    },
    {
        "source_sentence": "於命終時，要當不淨種種流出。",
        "translation": "At the time of death, there must be various kinds of impure and impure outflows.",
        "source": "T14n0515_001:0788b13_2"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0788b15_0"
    },
    {
        "source_sentence": "如是身者，雖處宮室后妃婇女內官美人眷屬圍遶，作眾伎樂種種倡伎，",
        "translation": "Such a body is surrounded by palace ladies, queens, court ladies, women, officials, and other beautiful people who perform various kinds of music and dances.",
        "source": "T14n0515_001:0788b15_1"
    },
    {
        "source_sentence": "以自娛樂歡喜快樂，臨命終時，自見惡相，要當驚怖憂悲苦惱。",
        "translation": "Because they amuse themselves with joy and happiness, when their life ends, they'll see bad appearances for themselves, and they'll be frightened, grieved, and pained.",
        "source": "T14n0515_001:0788b16_2"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0788b19_0"
    },
    {
        "source_sentence": "如是身者，雖處宮室綵飾圖畫殿閣樓臺，戶牖軒窓重關密掩，種種香花以自嚴飾，",
        "translation": "Such a body, even though it's in a palace decorated with silhouettering and drawing halls, pavilions, towers, buildings, windows, heavy barriers, and esoteric shrines, various fragrant flowers adorn themselves.",
        "source": "T14n0515_001:0788b19_1"
    },
    {
        "source_sentence": "種種燈燭增光照明，施設珍奇屏障帷幄，燒眾名香散諸妙花，香花寶瓶處處陳列，",
        "translation": "Various kinds of lamps, candles, increasing light and illumination, adorned with jeweled curtains and drapes, burned names and fragrances, scattered exquisite flowers, and displayed incense, flowers, precious vases, and arrays were offered everywhere.",
        "source": "T14n0515_001:0788b21_2"
    },
    {
        "source_sentence": "安置種種金銀琉璃眾寶床座，敷設上妙氍氀錦繡文蓐花氈，床座兩頭俱置丹枕，",
        "translation": "They placed various kinds of golden, silver, lapis lazuli, and other precious beds and seats; they were covered with exquisitely woven cloth made of brocaded silk or embroidered cotton cloth. The two ends of the beds and seats were lined with sandalwood pillows.",
        "source": "T14n0515_001:0788b23_3"
    },
    {
        "source_sentence": "覆以上妙綺帊錦衾，寤寐安寢歡娛耽著，於命終後無所覺知，或送屍骸置於葬所，",
        "translation": "They covered their bodies with fine silk and brocade, slept, lay asleep, and indulged in addictive pleasures. At the end of life they had no ideation; some sent their corpses off to be buried.",
        "source": "T14n0515_001:0788b25_4"
    },
    {
        "source_sentence": "烏鵲鵰鷲狐狼野干，餓狗鵄梟諸惡禽獸爭共食噉，骨肉膿血鬚髮糞穢，",
        "translation": "Bad animals such as crows, maggots, eagles, eagles, foxes, wolves, hungry dogs, hawks, and bad birds fight with each other to eat it. Their bones, flesh, pus, blood, hair, beards, and mucus are dirty.",
        "source": "T14n0515_001:0788b26_5"
    },
    {
        "source_sentence": "流溢地上臭處可惡。",
        "translation": "It flows over the ground in a foul-smelling place that's bad.",
        "source": "T14n0515_001:0788b28_6"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0788b29_0"
    },
    {
        "source_sentence": "如是身者，先常乘馭香象駿馬眾寶輦輿，擊鼓吹貝作大音樂，眾寶傘蓋隨侍於後，",
        "translation": "Such a body is always riding on carriages made of incense, elephants, mules, horses, jeweled carriages, and palanquins. It beats drums and blows shells to make great music, while behind it are accompanied by umbrellas decorated with the finest treasures.",
        "source": "T14n0515_001:0788b29_1"
    },
    {
        "source_sentence": "執持扇拂掩映搖動，無量勇健象軍馬軍車軍步軍導從前後，防衛左右百千臣僚竭誠敬奉，",
        "translation": "He held the fan, wiped it out, covered its reflection, and shook it. The countless heroic elephant troops, horse troops, chariot troops, and infantry followed him before and after to protect his enemies. Hundreds of thousands of his ministers and officials stood beside him with all their sincerity and respect.",
        "source": "T14n0515_001:0788c02_2"
    },
    {
        "source_sentence": "城邑士庶合掌驚歎。",
        "translation": "The citizens of the cities joined their palms in wonder.",
        "source": "T14n0515_001:0788c04_3"
    },
    {
        "source_sentence": "雖受如是勝妙果報自在榮華，不久要當瞑目辟手無復動搖，橫屍偃仰喪車輿上，",
        "translation": "Even though he had received such a remarkable reward of freedom and prosperity, before long he would close his eyes and hands and no longer shake. His corpse would hover upright on the top of his carriage or moped.",
        "source": "T14n0515_001:0788c04_4"
    },
    {
        "source_sentence": "眾人荷挽出大城門，父母妻子兄弟姊妹作使僮僕群僚輔佐，親屬內人隨從左右，",
        "translation": "Their parents, wives, brothers, sisters, messengers, servants, officials, and assistants came out of the great city gates.",
        "source": "T14n0515_001:0788c06_5"
    },
    {
        "source_sentence": "心纏憂惱頭髮被散，舉手拍頭椎胸悲噎，哀感崩慟皆言：『苦哉！』",
        "translation": "Their minds are tethered by grief, their hair is scattered, their hands are raised, their heads are clapped and beaten, their chests are crushed in sorrow, and they all say, 'How painful!'",
        "source": "T14n0515_001:0788c08_6"
    },
    {
        "source_sentence": "城邑國人覩之號慕。",
        "translation": "The cities and nations of the kingdoms honored him with their names and admired him.",
        "source": "T14n0515_001:0788c10_7"
    },
    {
        "source_sentence": "隨送葬所，或有露屍施諸禽獸，鳥鵲餓狗鵰鷲鵄梟，狐狼野干及諸惡獸，",
        "translation": "At the place where they were buried, some gave their bare corpses to birds and animals, birds, maggots, hungry dogs, eagles, eagles, eagles, hawks, foxes, wolves, wild geese, and other bad animals.",
        "source": "T14n0515_001:0788c10_8"
    },
    {
        "source_sentence": "楂掣食噉骨肉狼籍，風飃日曝雨漬霜封，支節解散零落異所；",
        "translation": "The grapes eat the bones, flesh, and flesh of the wolves. When the wind blows they are exposed to rain and frost; their limbs are dismembered and scattered in a strange place.",
        "source": "T14n0515_001:0788c12_9"
    },
    {
        "source_sentence": "或有積薪以火焚葬，筋骨焦爛血肉消化，臭煙熢[火*孛]四面充塞，",
        "translation": "Or there may be an accumulation of firewood that is burned and buried in the fire. The sinews, bones, tendons, flesh, and blood are scorched and burned away but not digested, with foulsmelling smoke filling all directions.",
        "source": "T14n0515_001:0788c13_10"
    },
    {
        "source_sentence": "火滅骨消灰飛塵散；",
        "translation": "When the fire goes out, the bones are extinguished; flying dust is scattered.",
        "source": "T14n0515_001:0788c15_11"
    },
    {
        "source_sentence": "或有掘地埋殯墳陵，經歷多時肉消骨腐。",
        "translation": "Some people dig up the ground to bury themselves in a burial mound, and after many years their flesh disappears and their bones are decayed.",
        "source": "T14n0515_001:0788c15_12"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0788c17_0"
    },
    {
        "source_sentence": "此身如是變壞無常，一切眾生及以諸行皆悉如是，非常非恒不可保信，",
        "translation": "This body thus evolves and disintegrates, impermanent. All living beings and all conditioned things are like this: neither eternal nor eternal, incapable of being sustained or believed.",
        "source": "T14n0515_001:0788c17_1"
    },
    {
        "source_sentence": "皆變易法迅速不停，流轉移動終歸壞滅，念念遷謝後為灰燼，究竟同趣滅盡之門，",
        "translation": "All the dharmas that change quickly and ceaselessly, which ultimately return to decay and extinction in each moment of thought as they flow and turn into ashes after passing away, are ultimately part of the same path of cessation.",
        "source": "T14n0515_001:0788c18_2"
    },
    {
        "source_sentence": "是失壞法，有諸怖畏有諸災橫多諸愁惱，皆是墜墮零落斷壞離散之法。",
        "translation": "This is the method of loss and disintegration, which has fears and calamities and numerous griefs, and it's all the method of falling into scattered states that cut off and disintegrate.",
        "source": "T14n0515_001:0788c20_3"
    },
    {
        "source_sentence": "「是故，大王！",
        "translation": "Therefore, great king!",
        "source": "T14n0515_001:0788c23_0"
    },
    {
        "source_sentence": "應善勤修，隨無常觀、隨盡滅觀，勿為貪欲之所染污，勿為瞋恚之所鼓動，",
        "translation": "They should diligently practice contemplation of impermanence and contemplation of extinction, not being stained by craving or agitated by hatred.",
        "source": "T14n0515_001:0788c23_1"
    },
    {
        "source_sentence": "勿為愚癡之所覆蔽，勿復耽染王富貴樂，勿復耽染王自在樂，勿復耽染王愛欲樂，",
        "translation": "Don’t be hindered by ignorance; don’t again indulge in the king’s wealth, prosperity, and happiness; don’t again indulge in the king’s unimpeded happiness; don’t again indulge in the king’s desire for pleasure.",
        "source": "T14n0515_001:0788c24_2"
    },
    {
        "source_sentence": "勿復耽染及餘所受諸欲樂具。",
        "translation": "Don't again become addicted to the objects of desire and pleasure that are received by others.",
        "source": "T14n0515_001:0788c26_3"
    },
    {
        "source_sentence": "應當滅除財命憍逸，應當驚懼無常死魔，不與人期奄忽而至。",
        "translation": "You should extinguish the demon of wealth, life, and debauchery, and you should be frightened by the demon of impermanent death that doesn't go along with people and suddenly arrive.",
        "source": "T14n0515_001:0788c27_4"
    },
    {
        "source_sentence": "為大國主，應以正法勿以非法，應隨法行勿隨非法，應愍眾生皆如一子，",
        "translation": "As the sovereign of a great kingdom, you should follow the right teaching and not what’s against the Dharma. You should practice according to the teaching and not what’s against the Dharma. You should pity sentient beings as if they were one child.",
        "source": "T14n0515_001:0788c28_5"
    },
    {
        "source_sentence": "應當至誠護持佛法，紹隆三寶勿復餘顧。",
        "translation": "You should wholeheartedly preserve the Buddha's teaching and promote the Three Treasures without any concern for others.",
        "source": "T14n0515_001:0789a01_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T14n0515_001:0789a02_7"
    },
    {
        "source_sentence": "生死海中流轉無始，唯佛正法是大津梁，千萬億劫實難值故。",
        "translation": "In the ocean of birth and death, there's no beginning when it flows, but only the Buddha's right teaching is the great river bridge, which is really difficult to meet for a thousand billion eons.",
        "source": "T14n0515_001:0789a02_8"
    },
    {
        "source_sentence": "「大王當知！",
        "translation": "Great king, you should know!",
        "source": "T14n0515_001:0789a05_0"
    },
    {
        "source_sentence": "我終不說獲得世間諸欲樂具，積聚受用名富貴者，我說獲得諸佛正法聖慧財寶積聚受用，",
        "translation": "I don't say that someone who acquires the accumulated enjoyment of worldly objects of desire and pleasure is called wealthy, but I say they attain the accumulated enjoyment of the treasures of the Buddha' s true dharma, holy wisdom, and possessions.",
        "source": "T14n0515_001:0789a05_1"
    },
    {
        "source_sentence": "乃名圓滿真富貴者。",
        "translation": "He's called someone who has perfected true wealth and prosperity.",
        "source": "T14n0515_001:0789a07_2"
    },
    {
        "source_sentence": "是故，大王！",
        "translation": "Therefore, great king!",
        "source": "T14n0515_001:0789a07_3"
    },
    {
        "source_sentence": "應當厭離世間所有諸欲樂具，應當願求諸佛正法聖慧財寶。」",
        "translation": "You should become disillusioned with the world's desires and pleasures, and you should wish to seek the treasures of the Buddha's noble wisdom of right teaching.",
        "source": "T14n0515_001:0789a08_4"
    },
    {
        "source_sentence": "時薄伽梵說是經已，憍薩羅主勝軍大王，及諸世間天人等眾，聞佛所說皆大歡喜，",
        "translation": "When the Bhagavān had taught this discourse, the lord of Kośala, the arch king Vaiśravaṇa, and the gods and humans of the world heard what the Buddha taught. They all rejoiced greatly.",
        "source": "T14n0515_001:0789a09_5"
    },
    {
        "source_sentence": "信受奉行。",
        "translation": "They believe and accept it and venerate it.",
        "source": "T14n0515_001:0789a11_6"
    },
    {
        "source_sentence": "如來示教勝軍王經",
        "translation": "Sutra of the Teachings of the Tathāgata, the King of victorious armies",
        "source": "T14n0515_001:0789a12_0"
    }
]