[
    {
        "source_sentence": "佛說阿鳩留經",
        "translation": "Foshuo akūṭa jing",
        "source": "T14n0529_001:0804a25_0"
    },
    {
        "source_sentence": "僧祐錄云安公古典經今附漢錄",
        "translation": "Sengyou lu Yun's classical scriptures of An Gong are now appended to the Han lu",
        "source": "T14n0529_001:0804a27_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛國祇樹給孤獨園。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T14n0529_001:0804a28_0"
    },
    {
        "source_sentence": "佛告諸比丘言：「昔者有賈客，名阿鳩留，居處甚富，金銀珍寶，奴婢眾多。",
        "translation": "The Buddha told the monks, In the past, there was a merchant named Anuruddha, who lived in a very wealthy place with gold and silver treasures and many servants.",
        "source": "T14n0529_001:0804a28_1"
    },
    {
        "source_sentence": "阿鳩留不信有後世生，作善不得善，作惡不得惡。",
        "translation": "Anuruddha doesn't believe there's a later life, doing good and not good, and doing evil and not evil.",
        "source": "T14n0529_001:0804b01_2"
    },
    {
        "source_sentence": "阿鳩留言：『人死後身地外地、身水外水、身火外火、身風外風，身皆共和合，",
        "translation": "Ākūṭa's Commentary: After the death of a human being, earth moves outward from his body; water moves outward from his body in water; fire moves outward from his body in water; and wind moves outward from his body in wind. Their bodies are all combined together.",
        "source": "T14n0529_001:0804b02_3"
    },
    {
        "source_sentence": "人死後終不復生也。",
        "translation": "A human being will never be born again after death.",
        "source": "T14n0529_001:0804b04_4"
    },
    {
        "source_sentence": "人所作善惡，心所念、口所言、身所行，皆當棄捐，後不復生。』",
        "translation": "Whatever good and evil people do, whatever thoughts they have in their minds, words they speak, or actions they take in their bodies will all be discarded and no longer arise.'",
        "source": "T14n0529_001:0804b05_5"
    },
    {
        "source_sentence": "「時，阿鳩留持財貨數千萬，與賈客五百人俱行。",
        "translation": "At the time, Akṣobhya was carrying tens of thousands of millions of possessions and walking with five hundred merchants.",
        "source": "T14n0529_001:0804b06_6"
    },
    {
        "source_sentence": "阿鳩留最尊豪相隨行賈客，當經劇道無水草處，所持糧食、水草皆已盡，",
        "translation": "Ākūṭa, the most venerable and powerful of the asura kings, accompanied by some merchants who were traveling with him, went down a dangerous path where there was neither water nor grass. All the food and water and grass they carried had been exhausted.",
        "source": "T14n0529_001:0804b07_7"
    },
    {
        "source_sentence": "行一日、二日不見水草，行三日、四日不見水草。",
        "translation": "If he travels for one day or two days, he doesn't see water and grass, and on three days or four days, he doesn't see water and grass.",
        "source": "T14n0529_001:0804b09_8"
    },
    {
        "source_sentence": "賈客皆恐怖言：『今我皆悉當於此荒澤中餓死耶！』",
        "translation": "The merchants and guests were all frightened, saying, 'Now, will we all die of hunger in this wild marsh?'",
        "source": "T14n0529_001:0804b10_9"
    },
    {
        "source_sentence": "各自啼哭，呼父母妻子。",
        "translation": "Each of them cried out in tears and called their parents, wives, and children.",
        "source": "T14n0529_001:0804b11_10"
    },
    {
        "source_sentence": "「阿鳩留遣騎四布，行求水草。",
        "translation": "Anuruddha sent four horsemen to search for water and grass.",
        "source": "T14n0529_001:0804b11_11"
    },
    {
        "source_sentence": "阿鳩留自行遙見一樹，樹葉青青果蓏繁熾，自念此樹下猶當有水，便前趣樹。",
        "translation": "Anuruddha saw a tree from a distance as he went on his own, with blue leaves and green fruits shining brightly. He thought to himself, “There will still be water beneath this tree.” So he proceeded toward the tree.",
        "source": "T14n0529_001:0804b12_12"
    },
    {
        "source_sentence": "見一男子，端正無比，遙見阿鳩留騎馬來前，迎趣之，言：『多賀來到，",
        "translation": "He saw a man incomparably handsome. From a distance he saw Akṣobhya coming before him on horseback, greeting him with these words:",
        "source": "T14n0529_001:0804b14_13"
    },
    {
        "source_sentence": "在所求索。』",
        "translation": "They're seeking what they seek.'",
        "source": "T14n0529_001:0804b16_14"
    },
    {
        "source_sentence": "阿鳩留見樹下人答之，即大喜，如得更生。",
        "translation": "When Anuruddha saw the man under the tree and answered, he was greatly delighted, just as if he had been reborn.",
        "source": "T14n0529_001:0804b16_15"
    },
    {
        "source_sentence": "樹下人言：『從何所來？",
        "translation": "The people under the tree said, 'Where did you come from?'",
        "source": "T14n0529_001:0804b17_16"
    },
    {
        "source_sentence": "欲所之到？』",
        "translation": "Where do you want to go?'",
        "source": "T14n0529_001:0804b17_17"
    },
    {
        "source_sentence": "阿鳩留言：『索救我命及五百人畜生命。』",
        "translation": "Akṣobhya's commentary says, 'Save my life and the five hundred animals that live on it.'",
        "source": "T14n0529_001:0804b18_18"
    },
    {
        "source_sentence": "樹下人言：『欲何求索？』",
        "translation": "The people under the tree said, 'What do you want to ask for?'",
        "source": "T14n0529_001:0804b19_0"
    },
    {
        "source_sentence": "言：『我欲得水。』",
        "translation": "He said, 'I want to get water.'",
        "source": "T14n0529_001:0804b19_1"
    },
    {
        "source_sentence": "樹下人便舉右手，水從五指端出，如流泉，甚香味，語阿鳩留言：『自極飲。』",
        "translation": "People under the tree then raised their right hand, and water emerged from the tip of their five fingers like a flowing spring with a great fragrance, saying to Akṣobhya, 'I'll drink it for myself.'",
        "source": "T14n0529_001:0804b19_2"
    },
    {
        "source_sentence": "飲已復從索飯，樹下人便舉右手，美食從指端出。",
        "translation": "After he had drunk it, he again asked for food from the tree, and a man under the tree raised his right hand, whose delicious food came out from the tip of his finger.",
        "source": "T14n0529_001:0804b21_3"
    },
    {
        "source_sentence": "「阿鳩留得飽食已，便舉聲大啼哭。",
        "translation": "After he had enough to eat, Akṣobhya raised his voice and cried out in tears.",
        "source": "T14n0529_001:0804b22_4"
    },
    {
        "source_sentence": "樹下人因問：『仁者啼哭為？』",
        "translation": "The people under the tree then asked, 'Sir, what's the reason weeping and wailing?'",
        "source": "T14n0529_001:0804b23_5"
    },
    {
        "source_sentence": "阿鳩留言：『我等伴五百人及畜生，從三四日以來，皆不得飲食，飢餓甚極，",
        "translation": "Ākūṭa had this message: For three or four days, all the five hundred companions and the animals that accompanied us were starving and hungry.",
        "source": "T14n0529_001:0804b24_6"
    },
    {
        "source_sentence": "命在須臾，是故我啼哭耳。』",
        "translation": "My life is in an instant; therefore, I'm weeping and wailing.'",
        "source": "T14n0529_001:0804b25_7"
    },
    {
        "source_sentence": "樹下人語阿鳩留：『若行將五百人及畜生來，我悉為若飽之。』",
        "translation": "The people under the tree said to Akūṭa, 'If five hundred people and animals come along with me, I'll satisfy them.'",
        "source": "T14n0529_001:0804b26_8"
    },
    {
        "source_sentence": "「阿鳩留即馳行，呼伴人語之言：『勿復憂也，已得飲食處，隨我去來。』",
        "translation": "Akkula then chased off and called out to his companions, saying, 'Don't worry again; you've found a place to eat and drink, follow me here.'",
        "source": "T14n0529_001:0804b27_9"
    },
    {
        "source_sentence": "伴人大喜，便隨去到樹下，皆叉手，為樹下人作禮。",
        "translation": "The companions were greatly delighted, so they went along to the foot of the tree and saluted him by joining their palms together.",
        "source": "T14n0529_001:0804b29_10"
    },
    {
        "source_sentence": "樹下人問言：『欲何得？』",
        "translation": "The people under the tree asked, 'What do you want?'",
        "source": "T14n0529_001:0804c01_11"
    },
    {
        "source_sentence": "人皆言：『大飢渴。』",
        "translation": "Everyone said, 'Great hunger and thirst.'",
        "source": "T14n0529_001:0804c02_12"
    },
    {
        "source_sentence": "樹下人即復舉右手五指端，即復大水出，水如流泉，人馬畜生皆飲；",
        "translation": "People at the foot of the tree then raised their five fingers with their right hand and immediately another large volume of water poured out. The water was like a flowing fountain for humans, horses, and animals to drink.",
        "source": "T14n0529_001:0804c02_13"
    },
    {
        "source_sentence": "復從索飯，樹下人復舉右手五指端，出名美飲食與之，五百人及畜生皆飽滿。",
        "translation": "Again, he asked for food, and the man under the tree again raised his five fingers with his right hand at the end of his fifth finger and gave him a delicious food and drink that was called nourishment. The five hundred people and the animals were all satisfied.",
        "source": "T14n0529_001:0804c04_14"
    },
    {
        "source_sentence": "「樹下人因問：『五百人等，卿皆欲至到，何等求索？』",
        "translation": "The people under the tree then asked, 'Five hundred people, you're all about to arrive, so what are they seeking?'",
        "source": "T14n0529_001:0804c05_15"
    },
    {
        "source_sentence": "賈人言：『我皆欲到大海，求索珍寶。』",
        "translation": "The merchants said, 'We all want to go to the ocean and search for treasure.'",
        "source": "T14n0529_001:0804c07_0"
    },
    {
        "source_sentence": "樹下人因問：『卿皆欲索珍寶者，便可從我手中出。』",
        "translation": "The man under the tree asked, 'If you all want to ask for treasures, then you can get them out of my hand.'",
        "source": "T14n0529_001:0804c07_1"
    },
    {
        "source_sentence": "樹下人便舉右手，從五指端出金銀、水精、琉璃、珊瑚、虎魄、白珠，",
        "translation": "The man under the tree then raised his right hand and produced gold, silver, crystal, lapis lazuli, coral, tiger spirit, and white pearls from the tip of his five fingers.",
        "source": "T14n0529_001:0804c08_2"
    },
    {
        "source_sentence": "人便斂取，取各自重如去。",
        "translation": "The people then retreated and took it, each one as heavy as if he had gone.",
        "source": "T14n0529_001:0804c10_3"
    },
    {
        "source_sentence": "「樹下人語阿鳩留：『持此金銀歸鄉里，用布施貧窮者，欲得飯者飯之，",
        "translation": "The people under the tree said to Ākūṭa, 'Take this gold and silver and return it to your native land. Give it to the poor and those who want to get food to feed them.",
        "source": "T14n0529_001:0804c11_0"
    },
    {
        "source_sentence": "欲得金銀、錢財、衣被者極與之。",
        "translation": "Those who want to obtain gold, silver, money, possessions, or clothing will give it to them at most.",
        "source": "T14n0529_001:0804c12_1"
    },
    {
        "source_sentence": "令道人皆呪願我，令我得其福，令我手中出琦物，又多使我早脫此荒澤中。』",
        "translation": "He causes the practitioners of the Way to all pray to me so that I'll attain their fortune, cause me to produce rare things in my hand, and often cause me to quickly escape from this wild marsh.'",
        "source": "T14n0529_001:0804c13_2"
    },
    {
        "source_sentence": "「阿鳩留聞此語大驚怖，便以頭面著地，問：『仁者為何等人乎？",
        "translation": "Having heard these words, Akṣobhya was greatly frightened and bowed his head and face to the ground. He asked, “Sir, what sort of people are you?",
        "source": "T14n0529_001:0804c15_3"
    },
    {
        "source_sentence": "是天耶？",
        "translation": "Is this heaven?",
        "source": "T14n0529_001:0804c16_4"
    },
    {
        "source_sentence": "龍耶？",
        "translation": "Is a dragon?",
        "source": "T14n0529_001:0804c16_5"
    },
    {
        "source_sentence": "鬼神耶？",
        "translation": "Is a ghost?",
        "source": "T14n0529_001:0804c16_6"
    },
    {
        "source_sentence": "是人耶？』",
        "translation": "Is this person?'",
        "source": "T14n0529_001:0804c17_0"
    },
    {
        "source_sentence": "「樹下人言：『我亦非天、亦非龍、亦非鬼、亦非人，我是豪薜荔也。",
        "translation": "The people under the tree said, 'I'm neither a god, nor a dragon, nor a ghost, nor a human being, but I'm a豪荔.",
        "source": "T14n0529_001:0804c17_1"
    },
    {
        "source_sentence": "我前世時，於國中大貧窮，常在城門下坐，雖貧窮心淨潔，愛樂沙門道人，",
        "translation": "In a previous life, I was greatly impoverished in my country and always sat at the entrance of the city gates. Although poor and destitute, I maintained a pure and clean mind and took delight in religious practitioners who were ascetics.",
        "source": "T14n0529_001:0804c18_2"
    },
    {
        "source_sentence": "我貧窮不能施人，見他人布施，代其喜。",
        "translation": "I am poor and unable to give [to others]. When I see someone else giving alms, I rejoice on their behalf.",
        "source": "T14n0529_001:0804c20_3"
    },
    {
        "source_sentence": "時迦葉佛般泥洹去，諸比丘來從我乞匃食，我應比丘言：「我無所有。」",
        "translation": "When Kāśyapa Buddha's parinirvāṇa was over, the monks came to beg for food from me, and I should be the monk who said, 'I have nothing.'",
        "source": "T14n0529_001:0804c21_4"
    },
    {
        "source_sentence": "但遙指示城中，某家善可得飯，某家不善不可得飯。",
        "translation": "They simply pointed from a distance to the city, saying, 'Some house is good for getting food, and some house isn't good for getting food.'",
        "source": "T14n0529_001:0804c22_5"
    },
    {
        "source_sentence": "比丘乞來出，我見有所得，即歡喜。",
        "translation": "The monk begged me to come and go. Seeing that I had gained something, he rejoiced.",
        "source": "T14n0529_001:0804c24_6"
    },
    {
        "source_sentence": "又迦葉佛般泥洹去，其國王名為基立，為迦葉佛起七寶塔，我輒持手著其上言：「令我得其福。」",
        "translation": "When Kāśyapa Buddha parinirvāṇa departed, the king of that country was named基立 and built a seven-jeweled stūpa for Kāśyapa Buddha, and I simply put my hand on top of it and said, Let me attain its merit.",
        "source": "T14n0529_001:0804c24_7"
    },
    {
        "source_sentence": "王上好物於佛塔，我輒持手著之言：「使我得其福。」",
        "translation": "The king offered good things to the Buddha's stūpa, and I simply held them in my hand and said, Let me attain their merit.",
        "source": "T14n0529_001:0804c27_8"
    },
    {
        "source_sentence": "但用貧故未曾齋，飯食無時又飲酒，是故死後，以作豪薜荔耳。",
        "translation": "But because they are poor and do not eat or drink alcohol at the proper time, it is said that after their deaths they will be reborn as a holy brahman.",
        "source": "T14n0529_001:0804c28_9"
    },
    {
        "source_sentence": "但用我前世見人作善，代其歡喜，手著其物上，是故令我五指端在所出；",
        "translation": "Instead, they rejoice when they see me doing good deeds in former existences. They put my hand on the object and cause me to stand at the end of their five fingers wherever I go.",
        "source": "T14n0529_001:0804c29_10"
    },
    {
        "source_sentence": "但用生時未曾齋，故使我作是間薜荔。』",
        "translation": "It's just that there's no time for purification when it's used, so I'll make this kind of uncooked rice.'",
        "source": "T14n0529_001:0805a02_11"
    },
    {
        "source_sentence": "「阿鳩留自念言：『我前不信有後世生、作善不得善，作惡不得惡。",
        "translation": "Anuruddha thought to himself, 'In the past, I didn't believe there would be a later life that produces goodness and doesn't obtain goodness, and creates evil and doesn't obtain evil.",
        "source": "T14n0529_001:0805a03_12"
    },
    {
        "source_sentence": "今我眼見，是為審有後世，復生審有作善得善、作惡得惡。",
        "translation": "Now that I see it with my own eyes, this is the judgment that there will be a later life. Again, there will be a judgment that what's done well will become good and what's done bad will become evil.",
        "source": "T14n0529_001:0805a04_13"
    },
    {
        "source_sentence": "從今日以去，歸鄉里，快當作善，布施與人，恣所求索，人有欲得金銀、珍寶、飲食、衣被者，",
        "translation": "From this day forth, they return to their native land and do good deeds. They give whatever they wish freely to anyone who asks for gold or silver, rare treasures, food and drink, or cloth coverings.",
        "source": "T14n0529_001:0805a06_0"
    },
    {
        "source_sentence": "皆與之，不逆人也。』",
        "translation": "They'll all give it to him, and he won't go against anyone.'",
        "source": "T14n0529_001:0805a07_1"
    },
    {
        "source_sentence": "「阿鳩留歸到鄉里，語一國中人：『誰有欲得金銀、珍寶、衣被、飲食者，",
        "translation": "Ākūṭa returned to his native land and said to the people of that country: Whoever wishes to obtain gold, silver, rare treasures, clothing, bedding, or food and drink.",
        "source": "T14n0529_001:0805a08_2"
    },
    {
        "source_sentence": "恣所求索，皆來取之。』",
        "translation": "Whatever he asks for, he'll get it.'",
        "source": "T14n0529_001:0805a09_3"
    },
    {
        "source_sentence": "如是布施無央數，日日飯八萬四千道人，但瀾汗流出門，人用擿船而行。",
        "translation": "Such donations were incalculable, and every day they fed the eighty-four thousand monks of the Way. Their sweat poured forth from their mouths but everyone traveled on a ferryboat to receive them.",
        "source": "T14n0529_001:0805a10_4"
    },
    {
        "source_sentence": "阿鳩留作善極意，死後便上第二忉利天上作天人，去離天帝座四百八十里。",
        "translation": "Anuruddha did so with good intentions, and after his death he ascended to the second heaven in Trāyastriṃśa Heaven to become a celestial being, four hundred and eighty li from the throne of Indra.",
        "source": "T14n0529_001:0805a12_5"
    },
    {
        "source_sentence": "「其國中有乞匃女人，名曰[女*參]，以善心持一杅米粥，與沙門摩訶迦葉。",
        "translation": "“In that country, there was a beggar woman named [woman*companion] who, with good intentions, took a grain of rice gruel and gave it to the ascetic Mahākāśyapa.",
        "source": "T14n0529_001:0805a13_6"
    },
    {
        "source_sentence": "女人死後，亦生忉利天上作天人，在天帝釋邊第三座，復勝餘天五事。",
        "translation": "After the woman dies, she's also born in Trāyastriṃśa Heaven as a god and becomes a god at the third seat beside Śakra Devānām-Indra, which is superior to the other gods in five ways.",
        "source": "T14n0529_001:0805a15_7"
    },
    {
        "source_sentence": "何謂五事？",
        "translation": "By what are these five things meant?",
        "source": "T14n0529_001:0805a17_8"
    },
    {
        "source_sentence": "一者、長壽；",
        "translation": "The first is long life.",
        "source": "T14n0529_001:0805a17_9"
    },
    {
        "source_sentence": "二者、端正；",
        "translation": "The second is correct.",
        "source": "T14n0529_001:0805a17_10"
    },
    {
        "source_sentence": "三者、安樂；",
        "translation": "The third is well-being.",
        "source": "T14n0529_001:0805a18_0"
    },
    {
        "source_sentence": "四者、智慧；",
        "translation": "The fourth is wisdom.",
        "source": "T14n0529_001:0805a18_1"
    },
    {
        "source_sentence": "五者、威神，勝於餘天。",
        "translation": "The fifth is their awesome deity, surpassing those of other heavenly beings.",
        "source": "T14n0529_001:0805a18_2"
    },
    {
        "source_sentence": "「後佛母忽故，生忉利天。",
        "translation": "“After that, the Buddha’s mother suddenly died and was reborn in Trāyastriṃśa Heaven.",
        "source": "T14n0529_001:0805a19_0"
    },
    {
        "source_sentence": "時佛天上為母說經。",
        "translation": "The Buddha then ascended to the heavens and taught the sūtras for his mother.",
        "source": "T14n0529_001:0805a19_1"
    },
    {
        "source_sentence": "說經已，佛母及諸天無央數，皆得須陀洹道。",
        "translation": "After he taught the sūtras, the mother of the Buddha and the gods were incalculably numerous, and they all attained the stream entry path.",
        "source": "T14n0529_001:0805a20_0"
    },
    {
        "source_sentence": "佛因見阿鳩留布施與人，遠在天帝釋邊，四百八十里坐；",
        "translation": "When the Buddha saw Akūṭa giving alms to someone, he was seated four hundred and eighty li from the side of Śakra Devānām-Indra in the distance.",
        "source": "T14n0529_001:0805a21_1"
    },
    {
        "source_sentence": "復見乞匃女人，持米粥與沙門摩訶迦葉，在天帝釋邊第三座，又勝餘天五事。",
        "translation": "Again, he saw a beggar woman carrying rice gruel and giving it to the ascetic Mahākāśyapa in the third seat beside Śakra, who was superior to the other gods in five ways.",
        "source": "T14n0529_001:0805a22_2"
    },
    {
        "source_sentence": "佛見悉皆識知，即遙呼阿鳩留言：『布施善人來相見。』",
        "translation": "The Buddha saw that they all knew, and he called Akūṭa from a distance to leave a message, saying, 'Come see me, you donor.'",
        "source": "T14n0529_001:0805a24_3"
    },
    {
        "source_sentence": "阿鳩留即來前，持頭面著地，為佛作禮，白佛言：『我布施大眾多，但得凡人耳，",
        "translation": "Ākūṭa came before him, touched his forehead and face to the ground. After venerating the Buddha with his palms joined together in respect, he said to him: O great benefactor! I have given a great deal of alms but [only] because I am an ordinary person.",
        "source": "T14n0529_001:0805a25_4"
    },
    {
        "source_sentence": "不得須陀洹、斯陀含、阿那含、阿羅漢、辟支佛，佛道也。",
        "translation": "They won't attain stream entry, sakṛdāgāmin, non-returner, arhat, or pratyekabuddha, which is the Buddha Way.",
        "source": "T14n0529_001:0805a27_5"
    },
    {
        "source_sentence": "今見乞匃女人，持米粥與沙門摩訶迦葉，今世在帝釋邊第三坐，又勝餘天五事。』",
        "translation": "Now, I've seen a beggar woman carrying rice gruel and giving it to the ascetic Mahākāśyapa who's sitting next to Indra in the third seat in this world, and she's superior to the other gods in five ways.'",
        "source": "T14n0529_001:0805a28_6"
    },
    {
        "source_sentence": "人持小物與摩訶迦葉，得福乃爾，是故身自致豪貴如此。」",
        "translation": "A person who gives a small thing to Mahākāśyapa and attains merit is thus blessed; therefore, his own body becomes so noble like this.",
        "source": "T14n0529_001:0805b01_7"
    },
    {
        "source_sentence": "天便為佛，作禮而去。",
        "translation": "The gods then paid homage to the Buddha and departed.",
        "source": "T14n0529_001:0805b02_8"
    },
    {
        "source_sentence": "佛說阿鳩留經",
        "translation": "Foshuo akūṭa jing",
        "source": "T14n0529_001:0805b04_0"
    }
]