[
    {
        "source_sentence": "金色童子因緣經卷第五",
        "translation": "Sutra on the Causes and Conditions of the Golden-colored Boy, Volume 5",
        "source": "T14n0550_005:0873a10_0"
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫",
        "translation": "translated scriptures of the Western Heaven, Sanzang朝散大夫",
        "source": "T14n0550_005:0873a12_0"
    },
    {
        "source_sentence": "試鴻臚卿傳梵大師賜紫",
        "translation": "試鴻卿傳梵大師賜紫, which is given to the great master Brahmā.",
        "source": "T14n0550_005:0873a13_0"
    },
    {
        "source_sentence": "沙門臣法護等奉　詔譯",
        "translation": "translated by imperial edict by the ascetic ministers Dharmagupta and others",
        "source": "T14n0550_005:0873a14_0"
    },
    {
        "source_sentence": "爾時日照商主，聞說如是多種事已，心意破壞，極大憂苦之所逼惱，悶絕躃地，",
        "translation": "At that time the merchant owner Illumination of the Sun, having heard these various things explained to him, was overcome with distress and tormented by extreme grief and sorrow.",
        "source": "T14n0550_005:0873a15_0"
    },
    {
        "source_sentence": "以水灑面，良久乃蘇。",
        "translation": "He sprinkled his face with water and came back to life after a long time.",
        "source": "T14n0550_005:0873a16_1"
    },
    {
        "source_sentence": "徐坐涕泣，發如是言：「苦哉！",
        "translation": "He sat quietly, weeping and wailing, and said, That's painful!",
        "source": "T14n0550_005:0873a17_2"
    },
    {
        "source_sentence": "苦哉！",
        "translation": "How painful!",
        "source": "T14n0550_005:0873a17_3"
    },
    {
        "source_sentence": "我唯一子，今將命殞。」",
        "translation": "I'm the only child, and now I'm about to die.",
        "source": "T14n0550_005:0873a17_4"
    },
    {
        "source_sentence": "「苦哉！我子熙怡眼，　　苦哉！族中大莊嚴，",
        "translation": "“Sunfortunately, my son’s eye is blissful.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　我為汝父福尠微，　　為害汝故大號哭。",
        "translation": "Because your father's merit is weak, I wailed and wept aloud for the sake of harming you.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　我為汝故心離散，　　于今迷轉於諸方，",
        "translation": "For your sake, my mind has been distracted, and now I'm deluded in all directions.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　與汝別離火熾然，　　苦哉！焚燒我心意。",
        "translation": "Being separated from you is like a blazing fire, which burns my mind and thoughts.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　汝是調善有智人，　　增上愛樂悲愍者，",
        "translation": "You're a well-adjusted, wise person with increased love and compassion.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　我為汝父極惡人，　　招汝今時多厄難。",
        "translation": "Because your father is a most evil person, I'll invite you into many difficulties at the present time.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　汝子當日初生時，　　我獲喜樂無等比，",
        "translation": "When your child is born on that first day, I will experience peerless joy and happiness.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　而今與汝將別離，　　憂火燒心極炎熾。",
        "translation": "Now that I'm about to part with you, my mind is burned by the fire of grief and my heart is extremely hot.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　苦哉！王者及臣輔，　　無悲愍心無分別，",
        "translation": "The king and his ministers have no compassion, pity, or discrimination.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　見斯具足法律人，　　不能為此審詳辯。",
        "translation": "Seeing this person who's fully endowed with the Dharma, they can't explain it in detail for him.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　苦哉！大國為人主，　　無悲愍心具顯彰，",
        "translation": "That great kingdom is the ruler of people, With no compassion or pity to show it.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　不能如是審詳明，　　因汝輕棄於我子。",
        "translation": "I can't explain it in detail like this because you despise my child.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　世間最勝賢善人，　　終不隱昧於心意，",
        "translation": "The most excellent people in the world, wise and virtuous, Are never hidden from their minds.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　有德之子眾所知，　　為害汝故大號哭。",
        "translation": "The sons of virtuous people, known by everyone, Weep and wail greatly for the sake of harming you.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　此大城隍諸聖賢，　　于今離散當何在？",
        "translation": "Where are the sages and good men of this great city goddess, who are now separated?",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　照燭如是有德人，　　臨刑戮時願放捨。",
        "translation": "Such a virtuous person like this shines the candle and wishes to be released when he's about to die.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　帝釋天主并護世，　　及餘大威德諸天，",
        "translation": "Indra, the lord of the gods and world protectors, As well as the other greatly majestic gods,",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　咸願少開悲愍心，　　今為我子善救護。",
        "translation": "They all wish to awaken a little compassion and pity, and now I'll rescue my child with goodness.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　大力成就禁戒仙，　　及餘寂默諸仙等，",
        "translation": "The greatly accomplished sages of the precepts and the other silent sages,",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "　頂禮為開悲愍心，　　今為我子作救護。」",
        "translation": "I bow my head in homage for the sake of opening my compassionate mind, and now I'll serve as a savior for my child.",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "言已，又復舉聲號哭，說伽陀曰：爾時，日照商主說是伽陀已，善慧忽生，",
        "translation": "Having said this, he raised his voice and cried out in tears. He said to Kātyāyana, “At that time the merchant Sun Illumining the World-honored One told him:",
        "source": "T14n0550_005:0873a18_5"
    },
    {
        "source_sentence": "乃自惟忖：「我今悲號唐捐無益，我聞有佛世尊功德無量，普盡世間同一親愛，",
        "translation": "He thought to himself, “I now wail in sorrow and cannot help but cry out in distress. I have heard that the Buddha, the World-honored One, whose merit is immeasurable, pervades all worlds with one and the same kind of affection.",
        "source": "T14n0550_005:0873b11_6"
    },
    {
        "source_sentence": "起大悲心隨念而應。",
        "translation": "He gives rise to the mind of great compassion and responds accordingly.",
        "source": "T14n0550_005:0873b13_7"
    },
    {
        "source_sentence": "彼佛世尊，諸無主者為作主宰，無救護者為作救護，無歸投者為作歸投，",
        "translation": "Bhagavān, those without lordship are their leaders; those without protectors are their protectors; those without protectors are their protectors; and those without refuge are their refuges.",
        "source": "T14n0550_005:0873b14_8"
    },
    {
        "source_sentence": "無趣向者為作趣向。",
        "translation": "Those who don't have an aim are directed toward it in order to make an aim.",
        "source": "T14n0550_005:0873b15_9"
    },
    {
        "source_sentence": "「又佛世尊，世間一切難苦險難逼惱眾生，彼等常生極大怖畏，我佛慈悲善為救度，",
        "translation": "“Furthermore, Bhagavān, all the sentient beings in the world are oppressed by suffering and distress, and they constantly experience great fear. I, the Buddha, am compassionate and able to rescue them.",
        "source": "T14n0550_005:0873b16_10"
    },
    {
        "source_sentence": "如彼海中涉渡商客，遇摩竭大魚極生怖畏，當怖畏時，彼思念佛，而佛應念即為救度。",
        "translation": "Suppose there's a merchant wading in the ocean who encounters a great fish of Magadha and becomes terrified, and when he's terrified, he thinks of the Buddha, and the Buddha saves him with that thought.",
        "source": "T14n0550_005:0873b18_11"
    },
    {
        "source_sentence": "「又如央掘摩羅，殺害千人唯一不殺，而後欲殺其母，母怖斷命，佛以方便善為救度。",
        "translation": "“Furthermore, it is like the case of Aṅgulimālya who kills a thousand people with only one exception: he does not kill them but later wishes to kill his mother. The mother fears killing her and the Buddha saves her by means of skillful means.",
        "source": "T14n0550_005:0873b20_12"
    },
    {
        "source_sentence": "又如宿世怨縛強力受夜叉身，所謂曠野夜叉、執持夜叉等，為飲食故行於世間，",
        "translation": "“Furthermore, it is like the case of those in former ages who were strongly fettered by enemies and receive the bodies of yakṣas. The so-called wild yakṣas, yakṣas holding swords, etc., act in the world for the sake of food and drink.",
        "source": "T14n0550_005:0873b21_13"
    },
    {
        "source_sentence": "殺害無數百千眾生。",
        "translation": "He killed countless hundreds of thousands of sentient beings.",
        "source": "T14n0550_005:0873b23_14"
    },
    {
        "source_sentence": "是諸夜叉食人血肉，貪其惡味，[口*尃]咂舐掠現惡舌相，堅長利牙蹙頞醜面，",
        "translation": "These yakṣas eat human flesh and blood, craving its bad taste. [Their mouths*mouths] swallowing and licking it, displaying bad tongues that are long and hard, with sharp fangs and twitching their ugly faces.",
        "source": "T14n0550_005:0873b24_15"
    },
    {
        "source_sentence": "近逼於人甚可怖畏，彼等眾生佛善救度。",
        "translation": "They're closely oppressed by people who are terrifying, and those sentient beings are well liberated by the Buddha.",
        "source": "T14n0550_005:0873b25_16"
    },
    {
        "source_sentence": "彼佛世尊善為我子度斯艱苦，若佛世尊以大悲心，最上愛念諸眾生者，",
        "translation": "“Furthermore, if the Buddha, the Bhagavat, were to save all sentient beings from their miseries by means of great compassion, how could he do so?",
        "source": "T14n0550_005:0873b26_17"
    },
    {
        "source_sentence": "惟願自然知我所念。」",
        "translation": "Please let me know what I'm thinking naturally.",
        "source": "T14n0550_005:0873b28_18"
    },
    {
        "source_sentence": "日照商主作是念時，其傍有一信善優婆塞，商主問言：「仁者！",
        "translation": "When the merchant owner Sun Shining had this thought, there was a faithful and good layman beside him, and the merchant owner asked, Sir!",
        "source": "T14n0550_005:0873b28_19"
    },
    {
        "source_sentence": "今佛世尊當何所在？」",
        "translation": "Where will the Bhagavān now be?",
        "source": "T14n0550_005:0873c01_20"
    },
    {
        "source_sentence": "「今此世間大導師，　　能與世間最上樂，",
        "translation": "“Now this great Guide of the world Is able to bestow the highest happiness on beings in the world.",
        "source": "T14n0550_005:0873c01_21"
    },
    {
        "source_sentence": "　於諸世間同一親，　　彼佛大師已入滅。",
        "translation": "In all the worlds they are one and the same: That great teacher of Buddha Has entered into extinction.",
        "source": "T14n0550_005:0873c01_21"
    },
    {
        "source_sentence": "　無明照者作明照，　　無歸向者為所歸，",
        "translation": "The illumination of nescience produces the illumination of insight, and the dedication of non-refoulement is the refuge.",
        "source": "T14n0550_005:0873c01_21"
    },
    {
        "source_sentence": "　佛日光明已暗冥，　　油盡燈然所不及。」",
        "translation": "The Buddha's sunlight has become darkened, and the oil-consuming lamp isn't as bright as it is.",
        "source": "T14n0550_005:0873c01_21"
    },
    {
        "source_sentence": "時優婆塞即審思念佛世尊已，涕淚悲泣哽咽其聲，即說伽陀，答商主言：是時，",
        "translation": "The layman thought of the World-honored One, weeping and sobbing in sorrow. Then he said to the merchant:",
        "source": "T14n0550_005:0873c01_21"
    },
    {
        "source_sentence": "日照商主聞佛世尊已入涅槃，倍復悲苦憂箭射心，悶絕躃地，以水灑面，",
        "translation": "Having heard that the Buddha, the World-honored One, had entered nirvana, the merchant proprietor Sun Illumination felt even more grieved and distressed. His heart was pierced by the sound of an arrow fired from his chest. He fell to the ground in agony and poured water over his face.",
        "source": "T14n0550_005:0873c08_22"
    },
    {
        "source_sentence": "良久乃蘇。",
        "translation": "After a long while he came back to life.",
        "source": "T14n0550_005:0873c09_23"
    },
    {
        "source_sentence": "「苦哉！法王一切智，　　能除過失眾怨聚，",
        "translation": "“O Great King of Truth, how painful it is that all-knowledged omniscient One Is able to remove the clusters of enemies with their faults.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　今已棄捨無歸人，　　世尊已滅我何作？",
        "translation": "Now that I've abandoned someone who has no refuge, what will the Bhagavān do after extinguishing me?",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　苦哉！最上勝所行，　　一切眾生同一愛，",
        "translation": "The supreme practice is that all sentient beings have one and the same craving:",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　悉能和合諸別離，　　導師開示涅槃路。",
        "translation": "Able to harmonize all distinctions, The Guide teaches the path of nirvana.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　苦哉！云何此世間，　　無明蓋覆於淨眼？",
        "translation": "How is it that this world Is covered by the blindness of ignorance, obscuring the pure eye?",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　眾生若離於世尊，　　生死輪轉無窮盡。",
        "translation": "If sentient beings part with the Bhagavān, their transmigration through birth and death will have no limit.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　佛從寂滅道中來，　　最上悲愍大勇猛，",
        "translation": "The Buddha, coming from the path of nirvana, Is supremely compassionate and greatly courageous.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　若此世間今無依，　　復何主宰為依怙？",
        "translation": "If this world now has no support, what is the ruler to rely on?",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　一切皆從正法生，　　從法出生諸佛子，",
        "translation": "All things arise from the true teaching; The heirs of buddhahood arise from the teaching.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　佛子今已離世間，　　復有何人作依怙？",
        "translation": "Son of Buddha, now that you have left the world, How could there be anyone to rely on?",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　眾生多種真實意，　　佛能拔苦悉圓成，",
        "translation": "The various real intentions of sentient beings— Buddha can remove suffering, and all are perfected.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　開明眾生所愛周，　　還復虛空歸寂默。",
        "translation": "Enlightenment is loved by sentient beings, and space returns to quiescence.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　一切人眾皆同等，　　聞佛所說勇銳生，",
        "translation": "All the people were equal, brave and courageous, born from hearing the Buddha’s words.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　今佛世尊已涅槃，　　復有何人宣正法？",
        "translation": "Now that the Bhagavat has entered nirvalJa, How could anyone proclaim the true-dharma?",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　苦哉！世間人天等，　　悉無光明皆破壞，",
        "translation": "How painful! All the worlds, humans, gods, and so on, Are completely devoid of light; They are all destroyed.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　聖尊出世最極難，　　佛大牟尼今已逝。",
        "translation": "It is most difficult for the holy and honored One to appear in the world. The Buddha Great Sage has now passed away.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　聞佛聖尊已涅槃，　　所愛正法亦隨滅，",
        "translation": "They hear that the Buddha, holy and honored One, has entered nirvana And their craving for truth also vanishes.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　一切眾生樂法深，　　復有何人善施作？",
        "translation": "All sentient beings are delighted with the depth of the Dharma, so who else would give well?",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　悲心一味大無畏，　　大悲愍者所依止，",
        "translation": "The one flavor of compassion is great fearlessness. Great compassion is the basis for those who are saddened.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　一切功德普能成，　　滅已後復何所得？",
        "translation": "All virtues are universally formed, but what will be attained after they cease?",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　何名三界作利益，　　所謂發起大悲心，",
        "translation": "What's called the benefit of the three realms, which is called the arousal of great compassion?",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　悲愍即是真實智，　　平等依止於捨行。",
        "translation": "Compassion and pity are true knowledge, Equally relying on the practice of equanimity.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　苦哉！佛大功德寶，　　經俱胝劫所積集，",
        "translation": "Great is the Buddha’s treasure of great virtue, accumulated over a billion kalpas.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　依止難地即銷亡，　　所有正法亦墜墮。",
        "translation": "Relying on the difficult ground, they'll disappear, and all the right teachings will fall into it.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　世尊導師離世間，　　苦哉！無明所闇蔽，",
        "translation": "The Bhagavat, the Guide, has left the world— How painful it is that you have been blinded by ignorance.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　此世此生險難中，　　勤力所成皆破壞。",
        "translation": "This world is born in danger and difficulty, And whatever it does with diligence breaks down.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　大哉！最勝即佛寶，　　一何今時悉離散？",
        "translation": "The supreme one is the treasure of buddhahood, so why would it all be scattered at this time?",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　深可傷悲諸世間，　　發起一切破壞事。",
        "translation": "It's deeply pitiable to the worlds that give rise to all kinds of disruptive things.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　佛滅苾芻眾亦空，　　譬如群牛失其母，",
        "translation": "Like a herd of cows that has lost its mother.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　諸有智者覩斯緣，　　誰不心生大悲惱？",
        "translation": "Those who are wise see this as a cause, but who doesn't give rise to great compassion and anguish in their minds?",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　全身委地伸敬奉，　　頂禮世尊離塵足，",
        "translation": "whole body entrusted to the ground, extending respect and veneration, bowed my head at the feet of the World-honored One.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　佛日光明已暗冥，　　我等後無所歸向。",
        "translation": "The Buddha’s sun is already shining in the darkness; We will never turn our backs on it.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　無常大事極慘毒，　　一切眾生平等受，",
        "translation": "The great matter of impermanence is extremely miserable and poisonous, Equally experienced by all sentient beings.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　佛亦今時被汝侵，　　故令我今無救護。",
        "translation": "The Buddha too has now been attacked by you, so I won't be able to protect him.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　八正道法如妙藥，　　能治煩惱病根源，",
        "translation": "The eightfold right path is like a wondrous medicine, Healing the roots of affliction and disease.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　大師！大悲！大醫王！　　于今亦墮無常數。",
        "translation": "Great teacher, great compassionate king of healers, you too have now fallen into the category of impermanent.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　苦哉！無悲極迅速，　　世尊慈父已入滅，",
        "translation": "The World-Honored One, who is so compassionate toward his fathers that he has entered parinirvāṇa, does not have compassion.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　一切世間悉暗冥，　　何人為開明照眼？",
        "translation": "All worlds are completely dark, so who will open their eyes and illuminate them?",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　苦哉！世尊已入滅，　　我子心寶將不還，",
        "translation": "The World-honored One has entered nirvana. My beloved son, the treasured one whose mind is free from defilement, will not return.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　今子臨當刑戮時，　　願佛來救斯厄難。",
        "translation": "Now, when my son is about to be executed, may the Buddha come and save him from this difficulty.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　世尊普救諸苦惱，　　一切最勝所歸趣，",
        "translation": "The Bhagavat saves all suffering and distress, the supreme refuge of all.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　我子無依命欲亡，　　惟願今時垂救度。",
        "translation": "My son has no support and wants to die, so may he be saved at this time.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　若我今日得善利，　　如大威德之所說，",
        "translation": "If I were to attain good benefits today, just as the great and mighty one has taught,",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "　令我諸愛不散離，　　是即獲得最上語。」",
        "translation": "To cause my cravings not to disperse is to attain the supreme speech.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "扶持漸起，向佛世尊涅槃方處，高聲號哭說伽陀曰：日照商主以如是等悲切語言說伽陀已，",
        "translation": "At the place where the Buddha, the World-honored One, was about to enter nirvana, he cried out in a loud voice and said to the hermit Gautama, “The merchant Sun Illumination has told me this kind of compassionate saying.",
        "source": "T14n0550_005:0873c10_0"
    },
    {
        "source_sentence": "復謂優婆塞言：「佛諸弟子大聲聞中，佛以教法付何人已入般涅槃？」",
        "translation": "Again, he said to the layman, Among the great śrāvakas among the disciples of the Buddha, which person has entered parinirvāṇa with the Buddha's teaching?",
        "source": "T14n0550_005:0874a27_1"
    },
    {
        "source_sentence": "優婆塞言：「商主！",
        "translation": "The upāsaka said, Merchant lord!",
        "source": "T14n0550_005:0874a29_2"
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen attentively!",
        "source": "T14n0550_005:0874a29_3"
    },
    {
        "source_sentence": "我佛世尊以其教法，付囑尊者大迦葉已入般涅槃；",
        "translation": "“World-honored One, I, the Buddha, have entrusted this teaching to Venerable Mahākāśyapa, who has entered final nirvana.",
        "source": "T14n0550_005:0874a29_4"
    },
    {
        "source_sentence": "彼尊者大迦葉，如世尊勅以其教法付囑尊者阿難已，次入涅槃。",
        "translation": "Venerable Mahākāśyapa, just as the Bhagavān had instructed him to entrust the teachings of that teaching to Venerable Ānanda, he then entered nirvāṇa.",
        "source": "T14n0550_005:0874b02_5"
    },
    {
        "source_sentence": "今時，即是尊者阿難大威德者任持教法，而彼尊者悲心如佛，能於彼彼國城聚落一切方處，",
        "translation": "Venerable Ānanda, the great and mighty venerable one, is thus entrusted with the upholding of the teaching. And yet that venerable one, mind imbued with compassion like a buddha, can teach everywhere in all cities, towns, provinces, kingdoms, and villages.",
        "source": "T14n0550_005:0874b03_6"
    },
    {
        "source_sentence": "調伏攝化一切眾生，於眾生中，若有未種諸善根者，方便攝化令種善根，",
        "translation": "He disciplines and develops all sentient beings. If there are any among sentient beings who have not planted roots of goodness yet, he skillfully collects and develops them so that they will plant roots of goodness.",
        "source": "T14n0550_005:0874b05_7"
    },
    {
        "source_sentence": "已能積集一切善根得相續者，使令成熟；",
        "translation": "Those who are able to accumulate all roots of goodness and attain continuity cause them to mature.",
        "source": "T14n0550_005:0874b07_8"
    },
    {
        "source_sentence": "已能成熟諸善根者，使其得度；",
        "translation": "Those who are able to develop the roots of goodness they enable to attain liberation.",
        "source": "T14n0550_005:0874b08_9"
    },
    {
        "source_sentence": "若有縈纏煩惱病者，為說正法勝甘露藥令其除愈，猶如醫王。",
        "translation": "If someone has a disease that's tethered by afflictions, he explains the superior ambrosia of the right teaching to them and causes them to be healed, just like the king of doctors.",
        "source": "T14n0550_005:0874b09_10"
    },
    {
        "source_sentence": "「又為一切煩惱黑暗所覆眾生，宣說正法，清淨光明破煩惱暗，譬如日天出語光明和合調順，",
        "translation": "“Furthermore, for the sake of sentient beings hindered by the darkness of all afflictions, he teaches the true teaching. The pure light that dispels the darkness of afflictions is like the convergence and harmonious harmony of the emanating light of the sun and the heavenly gods.",
        "source": "T14n0550_005:0874b10_11"
    },
    {
        "source_sentence": "狀俱母陀花開發可愛，猶如月天。",
        "translation": "It's shaped like the lotus blossom of a kumbhūṣa flower, just like the moon god.",
        "source": "T14n0550_005:0874b12_12"
    },
    {
        "source_sentence": "常以正法教授調伏諸小國王，如轉輪聖王。",
        "translation": "He always taught and disciplined the kings of small countries with the right teaching, like a wheel-turning sage king.",
        "source": "T14n0550_005:0874b13_13"
    },
    {
        "source_sentence": "以自智慧勝妙辯才，攝伏一切邪異外道群鹿之眾，猶如師子。",
        "translation": "With his own wisdom and superior marvelous eloquence, he subdued all the deer of heretical non-Buddhist teachings like a lion.",
        "source": "T14n0550_005:0874b14_14"
    },
    {
        "source_sentence": "指示法律開導一切，猶如導師。",
        "translation": "He instructs the Dharma and enlightens all, just like a teacher who guides.",
        "source": "T14n0550_005:0874b15_15"
    },
    {
        "source_sentence": "廣為眾生宣說正法增益法財，猶如商主。",
        "translation": "He extensively explains the right teaching for sentient beings and increases the wealth of the Dharma, just like a merchant owner.",
        "source": "T14n0550_005:0874b16_16"
    },
    {
        "source_sentence": "普令一切種植善種覆廕增長，猶如大雲。",
        "translation": "It causes all planting good seeds to cover and grow, just like a great cloud.",
        "source": "T14n0550_005:0874b17_17"
    },
    {
        "source_sentence": "教示損益猶如父母。",
        "translation": "They teach and show the gains and losses like parents.",
        "source": "T14n0550_005:0874b18_18"
    },
    {
        "source_sentence": "諸有一切難調眾生善為調伏，未得度者令其得度，未安隱者令得安隱，",
        "translation": "He disciplines all living beings who are difficult to tame, enabling those who have not been liberated to attain liberation and enabling those who are not yet liberated to attain peace.",
        "source": "T14n0550_005:0874b18_19"
    },
    {
        "source_sentence": "未涅槃者令住涅槃，一切險惡艱苦逼迫彼彼眾生大怖畏者，令其脫免。",
        "translation": "Those who haven't yet entered nirvāṇa will be made to abide in nirvāṇa, and all the great fears of those sentient beings who are oppressed by danger and suffering will be freed.",
        "source": "T14n0550_005:0874b20_20"
    },
    {
        "source_sentence": "「總略而言，彼聖尊者有大威力，一切佛事皆悉能作，隨念能應，如汝今時，",
        "translation": "“In sum, that holy venerable one has great power and is able to do all the buddha-works at will. Just as you are doing now,",
        "source": "T14n0550_005:0874b22_21"
    },
    {
        "source_sentence": "子之厄難隨汝所念，能為救度。」",
        "translation": "The troubles and difficulties of the child follow your thoughts, and you can save them.",
        "source": "T14n0550_005:0874b23_22"
    },
    {
        "source_sentence": "爾時，日照商主聞是語已，如還命人宛轉驚惶，即作是言：「仁者！",
        "translation": "After hearing these words, the merchant lord Suniṣṭha heard them, and as soon as he returned to his men, he became frightened and said, Sir!",
        "source": "T14n0550_005:0874b25_0"
    },
    {
        "source_sentence": "彼尊者阿難今在何處？」",
        "translation": "Where is that Venerable Ānanda now?",
        "source": "T14n0550_005:0874b26_1"
    },
    {
        "source_sentence": "優婆塞言：「商主！",
        "translation": "The upāsaka said, Merchant lord!",
        "source": "T14n0550_005:0874b26_2"
    },
    {
        "source_sentence": "尊者阿難今在毘耶離城菴羅樹園。」",
        "translation": "Venerable Ānanda is now in the palm tree grove of Vaiśālī's city.",
        "source": "T14n0550_005:0874b27_3"
    },
    {
        "source_sentence": "如是言已，日照商主即起，恭敬膝輪著地，向毘耶離城合掌頂禮，滿目淚流，",
        "translation": "Having uttered these words, the merchant lord Sun Illumination rose at once, respectfully knelt with his knees joined to the ground, saluted the city of Vaiśālī by joining his palms, and bowed his head in veneration. His eyes were covered with tears.",
        "source": "T14n0550_005:0874b28_4"
    },
    {
        "source_sentence": "作是白言：「尊者大慈！",
        "translation": "He made this statement, saying, Venerable Mahāprajāpatī!",
        "source": "T14n0550_005:0874b29_5"
    },
    {
        "source_sentence": "我子今時有別離苦，憂惱逼迫無所伸告，我今罄以極切心誠悲泣哀祈尊者阿難，",
        "translation": "Venerable Ānanda, my son is suffering from separation and distress. Being grieved and oppressed, I cannot tell him anything. With utmost sincerity and compassion, I weep and pray to Venerable Ānanda:",
        "source": "T14n0550_005:0874c01_6"
    },
    {
        "source_sentence": "願垂救護。」",
        "translation": "May you be saved and protected.",
        "source": "T14n0550_005:0874c03_7"
    },
    {
        "source_sentence": "「今此尊者最勝上，　　眾生心意悉明解，",
        "translation": "“Now this venerable one is supremely superior. The minds and thoughts of sentient beings are all clearly understood.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　如意如願普能知，　　願今聽我說是事。",
        "translation": "Being able to know all according to wishes and vows, may I now hear you tell me about this matter.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　我佛世尊已入滅，　　佛諸弟子有大威，",
        "translation": "World-honored One, we Buddhas have entered nirvana. The disciples of the Buddhas have great power.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　尊者多聞無等倫，　　能持如來清淨教，",
        "translation": "Venerable One, well-versed and unequalled, Is able to preserve the pure teaching of the enlightened.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　善安慰我逼惱心，　　復為世間所歸向，",
        "translation": "He comforts the oppressed mind of self, And to which he turns for refuge in the world.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　常樂利益於眾生，　　願今觀察如是事。",
        "translation": "They always delight in benefiting sentient beings, May they now observe such things.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　今時我子以何緣，　　云何如是將致害？",
        "translation": "What's the reason for my son now that he's like this, and what's the reason it's going to cause harm?",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　我今危逼子無依，　　願師威神作救護。",
        "translation": "Now that I'm in danger, my son has no support, so may the teacher and his authoritative powers rescue him.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　若或聖者不住世，　　無復可得利眾生，",
        "translation": "If some noble ones don’t abide in the world, There is no longer any possibility of benefiting sentient beings.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　信善之人欲害時，　　非師何人能放捨？",
        "translation": "When a person of faith and goodness wants to harm, how can someone who's not a teacher let go of it?",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　留身住世利群品，　　能善任持佛正法，",
        "translation": "Remaining in the world for the benefit of all beings, they can skillfully maintain the Buddha’s true teaching.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　現前應起悲愍心，　　攝受救護於我子。",
        "translation": "In the present, you should give rise to compassion and pity, taking care of and protecting my child.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　我諸方計無所成，　　今無歸趣復無救，",
        "translation": "I do not think there is anything to be done in all directions, and now I have no refuge or salvation.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　父子同陷憂泥中，　　尊者悲心願提拔。",
        "translation": "Both father and son are trapped in the mire of sorrow, but the venerable is compassionate and wishes to be liberated.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　我今悚怖深啟告，　　師利世間餘何有？",
        "translation": "Now, I'm frightened and profoundly instructed, Where else is there a teacher in the world?",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　釋迦牟尼師所言，　　今如闇中現光照，",
        "translation": "The Buddha Śākyamuni said: Just as the light that shines in the darkness illuminates,",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　唯除尊者作善利，　　餘復無人能救護。",
        "translation": "Only the venerable one does good benefits, and there's no one else who can rescue him.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　惟願尊者速降臨，　　應起悲心救我子，",
        "translation": "I entreat you, venerable one, to quickly descend upon us. You should be compassionate and save our children.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　為子憂心如怨執，　　惡人侵嬈難堪任，",
        "translation": "Their children’s sorrowful minds are like enemies holding grudges. Evil people harm them and make it difficult to endure.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "　我及妻子悉無依，　　願歡喜尊施歡喜。」",
        "translation": "I and my wife have nothing to rely on, so may the venerable donor rejoice and rejoice.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "即時，商主說伽陀曰：日照商主說是伽陀，時尊者阿難悲心增益，晝三夜三即為思念，",
        "translation": "At that moment, the merchant leader said to Ānanda, “The merchant leader Candracchattra says this is a khadira.” Then Venerable Ānanda grew more and more compassionate.",
        "source": "T14n0550_005:0874c03_8"
    },
    {
        "source_sentence": "以聲聞中所得天眼普觀世間，何法是增？",
        "translation": "With the divine eye attained by śrāvakas, which universally observes the world with their divine eye, what's the increase?",
        "source": "T14n0550_005:0874c25_9"
    },
    {
        "source_sentence": "何法是減？",
        "translation": "What is decrease?",
        "source": "T14n0550_005:0874c26_10"
    },
    {
        "source_sentence": "何者險惡？",
        "translation": "What's dangerous?",
        "source": "T14n0550_005:0874c26_11"
    },
    {
        "source_sentence": "何者難苦？",
        "translation": "What's difficult and painful?",
        "source": "T14n0550_005:0874c26_12"
    },
    {
        "source_sentence": "何者逼迫？",
        "translation": "What's oppressed?",
        "source": "T14n0550_005:0874c27_13"
    },
    {
        "source_sentence": "何者具有險惡艱苦逼迫等事？",
        "translation": "What's the existence of dangerous, bad, difficult, and oppressive things?",
        "source": "T14n0550_005:0874c27_14"
    },
    {
        "source_sentence": "何者微小？",
        "translation": "What's subtle?",
        "source": "T14n0550_005:0874c28_15"
    },
    {
        "source_sentence": "何者漸增？",
        "translation": "What's gradually increasing?",
        "source": "T14n0550_005:0874c28_16"
    },
    {
        "source_sentence": "何者廣大？",
        "translation": "What's vast?",
        "source": "T14n0550_005:0874c28_17"
    },
    {
        "source_sentence": "何者惡趣道中我當提拔？",
        "translation": "What's the path of bad destinies in which I will be liberated?",
        "source": "T14n0550_005:0874c28_18"
    },
    {
        "source_sentence": "何者天中善趣及解脫道我當安立？",
        "translation": "What are the good destinies and paths of liberation that I will establish in heaven?",
        "source": "T14n0550_005:0874c29_19"
    },
    {
        "source_sentence": "何者欲泥所陷沒處我當親手隨與拔除？",
        "translation": "What's the place where I'll go and remove it with my own hands from the place where I fell into the mud of desire?",
        "source": "T14n0550_005:0875a01_20"
    },
    {
        "source_sentence": "何者遠離聖財我當令其聖財增廣？",
        "translation": "Why is it that apart from the noble possessions, I will cause their noble possessions to increase?",
        "source": "T14n0550_005:0875a02_21"
    },
    {
        "source_sentence": "尊者阿難常為眾生如是觀察，與尊者舍利子等無有異。",
        "translation": "Venerable Ānanda always observed it this way for sentient beings, no different from that of Venerable Śāriputra and so forth.",
        "source": "T14n0550_005:0875a03_22"
    },
    {
        "source_sentence": "即時，尊者以淨天眼觀彼金色童子，昔種善根勝行成熟，然為險惡艱苦逼惱縈纏。",
        "translation": "Immediately, the venerable looked at that golden boy with the pure divine eye and saw that he had planted good roots in the past to achieve superior maturity, but he was tethered by danger, suffering, and oppression.",
        "source": "T14n0550_005:0875a05_0"
    },
    {
        "source_sentence": "見已，即時尊者乃舒如象王臂，速於國主阿闍世王所居宮闕殿宇之上，",
        "translation": "Immediately after seeing this, the venerable one spread out his arm like an elephant king’s and quickly flew up to the top of the palace where the sovereign Ajātaśatru lived.",
        "source": "T14n0550_005:0875a06_1"
    },
    {
        "source_sentence": "隱身不現，但於空中彈指警覺。",
        "translation": "Their hidden body doesn't appear, but they snap their fingers in the air to alert them.",
        "source": "T14n0550_005:0875a08_2"
    },
    {
        "source_sentence": "其王爾時方處殿中歡娛沈惑，忽聞空中有聲，作如是言：「大王！",
        "translation": "At that point, the king was staying in the palace amused and confused, and suddenly heard a voice in the air say, Great king!",
        "source": "T14n0550_005:0875a09_3"
    },
    {
        "source_sentence": "汝作不善，彼金色童子都無過失，王自不能審細詳察。",
        "translation": "That golden-colored boy has nothing wrong with you, and the king himself can't examine it in detail.",
        "source": "T14n0550_005:0875a10_4"
    },
    {
        "source_sentence": "今時遣出王舍大城，詣棄屍林中而令棄置將欲殺害，大王宜今速止斯事。」",
        "translation": "Now, he's sending out the great city of Rājagṛha and going to abandon it in the corpse's forest and causing it to be abandoned because he wants to kill it, so it's advisable for the king to quickly stop this.",
        "source": "T14n0550_005:0875a11_5"
    },
    {
        "source_sentence": "爾時，阿闍世王聞其空中尊者阿難語已，即速旋動驚懼，頂禮尊者阿難。",
        "translation": "At the time, King Ajātaśatru heard what Venerable Ānanda said in the air, quickly moved in fear and bowed his head to Venerable Ānanda.",
        "source": "T14n0550_005:0875a14_0"
    },
    {
        "source_sentence": "乃起于殿舉發大聲，普告四方，作如是言：「汝等審聽，速往棄屍林中，",
        "translation": "He rose from his seat in the hall, raised his voice, and said to the four quarters, Listen attentively.",
        "source": "T14n0550_005:0875a15_1"
    },
    {
        "source_sentence": "宣示我語：『彼金色童子當勿殺害，速宜放捨。』",
        "translation": "He told me, 'That golden boy won't be killed; it's better to let him go quickly.'",
        "source": "T14n0550_005:0875a17_2"
    },
    {
        "source_sentence": "汝等眾中能往告者，我當出彼金藏而賜於汝，及當與汝五大聚落。」",
        "translation": "Those of you in the assembly who can go there and tell them, I'll give you out of that gold treasure and give it to you, and I'll give it to your five great villages.",
        "source": "T14n0550_005:0875a18_3"
    },
    {
        "source_sentence": "時多人眾聞王宣示，人所愛念金色童子令其放捨。",
        "translation": "Many people then heard the king's announcement, and their beloved golden-colored boy was released.",
        "source": "T14n0550_005:0875a20_0"
    },
    {
        "source_sentence": "時百千人奔走而出，競欲告語。",
        "translation": "Hundreds of thousands of people then ran out running, competing to tell him.",
        "source": "T14n0550_005:0875a21_1"
    },
    {
        "source_sentence": "當如是時，四監逐官同諸膾宰，驅行金色童子，已到棄屍林中。",
        "translation": "At the time, the four superintendents and officials, together with the executioners, expelled the golden-colored boy and went to the corpse-abandonment grove.",
        "source": "T14n0550_005:0875a21_2"
    },
    {
        "source_sentence": "時彼迦尸孫那利女有自親識知友，具以種種青黃赤白妙好之衣而為莊嚴，",
        "translation": "That Kāśi-sunālī woman then had intimate friends of her own, adorned them with various beautiful blue, yellow, red, and white robes.",
        "source": "T14n0550_005:0875a23_3"
    },
    {
        "source_sentence": "安布輿乘入棄屍林中，時彼知識於是方處聚積其柴欲布柴籠。",
        "translation": "He placed his carriage and went into the abandoned corpse's forest, and then that friend gathered a large amount of firewood from that place and wanted to build a wooden cage.",
        "source": "T14n0550_005:0875a25_4"
    },
    {
        "source_sentence": "是時，諸膾宰言：「汝等于今未宜安布所用柴籠，小待須臾，當俟我等為其童子安布叉已，",
        "translation": "They said, “You should not set up the cages of fire that will be used for these wooden chariots.",
        "source": "T14n0550_005:0875a27_0"
    },
    {
        "source_sentence": "我即殺之。",
        "translation": "I then killed him.",
        "source": "T14n0550_005:0875a29_0"
    },
    {
        "source_sentence": "然後以此金色童子，與彼迦尸孫那利女同處焚燒。」",
        "translation": "Then, this golden boy will be burned in the same place as that Kāśinagara's daughter.",
        "source": "T14n0550_005:0875a29_1"
    },
    {
        "source_sentence": "如是言已，時諸膾宰即舉其叉安之在地。",
        "translation": "After he said this, the executioners then lifted his fork and placed it on the ground.",
        "source": "T14n0550_005:0875b01_2"
    },
    {
        "source_sentence": "爾時，金色童子觀見彼叉既在地已，即思念母，極大逼切滿目垂淚：「我今與母即見別離，",
        "translation": "At that moment, the golden-colored boy observed that he had already landed on the ground and thought of his mother. His eyes were covered with extreme constriction and he wept in tears, “I am now separated from my mother.",
        "source": "T14n0550_005:0875b03_0"
    },
    {
        "source_sentence": "我母今時在何方處？",
        "translation": "Where is my mother now?",
        "source": "T14n0550_005:0875b05_0"
    },
    {
        "source_sentence": "我母昔時或於中夜失其懷抱，暫不見我即生極苦。",
        "translation": "My mother used to lose her embrace in the middle of the night, and when she doesn't see me for a moment, extreme pain arises.",
        "source": "T14n0550_005:0875b05_1"
    },
    {
        "source_sentence": "又念我母唯我一子，今既別離母命何存？",
        "translation": "Again, he thought to himself, “My mother is only my only child. Now that I am separated from my mother, how can I live?",
        "source": "T14n0550_005:0875b06_2"
    },
    {
        "source_sentence": "苦哉！",
        "translation": "How painful!",
        "source": "T14n0550_005:0875b07_3"
    },
    {
        "source_sentence": "我今實無福力，招感於母與我別離，子母今時俱受大苦。」",
        "translation": "Now, I really don't have the power of good fortune to bring about separation from my mother and me, and both my sons and mothers are now undergoing great suffering.",
        "source": "T14n0550_005:0875b07_4"
    },
    {
        "source_sentence": "時諸膾宰開掘於地，將立其叉，互相議言：「汝諸膾宰，何人能為金色童子舉叉安立？」",
        "translation": "The executioners then dug into the ground and were about to posit their crossbows, debating among themselves, saying, Who among you executioners will be able to posit your crossbows for the golden boy?",
        "source": "T14n0550_005:0875b09_0"
    },
    {
        "source_sentence": "互各推排汝當安立。",
        "translation": "Each one is deduced from the other, and you will establish it.",
        "source": "T14n0550_005:0875b10_1"
    },
    {
        "source_sentence": "中一人言：「我今頭痛風恙所侵，不能舉立。」",
        "translation": "One of them said, Now, I'm afflicted by a headache or windstorm and can't stand up.",
        "source": "T14n0550_005:0875b11_2"
    },
    {
        "source_sentence": "中一人言：「我今背痛。」",
        "translation": "One of them said, Now, I'm suffering from back pain.",
        "source": "T14n0550_005:0875b12_3"
    },
    {
        "source_sentence": "一言：「我今兩脇疼痛。」",
        "translation": "He said, Now, I'm suffering from pain in both sides.",
        "source": "T14n0550_005:0875b12_4"
    },
    {
        "source_sentence": "一言：「我今腹有所痛。」",
        "translation": "He said, Now, there's pain in my belly.",
        "source": "T14n0550_005:0875b13_5"
    },
    {
        "source_sentence": "彼諸膾宰各言所苦互欲避之，不忍施作無義利事。",
        "translation": "Each of those executioners said that they were suffering and wanted to avoid each other, but they didn't tolerate giving or doing anything meaningless for their benefit.",
        "source": "T14n0550_005:0875b13_6"
    },
    {
        "source_sentence": "金色童子因緣經卷第五",
        "translation": "Sutra on the Causes and Conditions of the Golden-colored Boy, Volume 5",
        "source": "T14n0550_005:0875b15_0"
    }
]