[
    {
        "source_sentence": ".[.,;灌頂經卷第十二]",
        "translation": ".[.,;Consecration Sutra, Volume 12]",
        "source": "T14n0451_001:0409a03_0"
    },
    {
        "source_sentence": "藥師琉璃光七佛本願功德經卷",
        "translation": "Yaoshi liuzhi guanqifo benyuan gongde jing",
        "source": "T14n0451_001:0409a04_0"
    },
    {
        "source_sentence": "上",
        "translation": "superior",
        "source": "T14n0451_001:0409a05_0"
    },
    {
        "source_sentence": "大唐三藏沙門義淨於佛光內寺譯",
        "translation": "Translated by the Tripiṭaka Master Yijing, a great Tang samādhisattva of the Tripiṭaka, at Fongguangnesa",
        "source": "T14n0451_001:0409a07_0"
    },
    {
        "source_sentence": "如是我聞：一時，薄伽梵遊化諸國，至廣嚴城，在樂音樹下，與大苾芻眾八千人俱，",
        "translation": "Thus I have heard: One time, when the Bhagavān was traveling through various countries to edify people, he arrived at Vaiśālī and stayed under a tree in Jeta’s Grove. He was accompanied by an assembly of eight thousand bhikṣus (monks).",
        "source": "T14n0451_001:0409a08_0"
    },
    {
        "source_sentence": "菩薩摩訶薩三萬六千，其名曰：曼殊室利菩薩、觀自在菩薩、慈氏菩薩、善現菩薩、大慧菩薩、明慧菩薩、山峯菩薩、辯峯菩薩、持妙高峯菩薩、不空超越菩薩、微妙音菩薩、常思惟菩薩、執金剛菩薩，",
        "translation": "“There were thirty-six thousand great enlightening beings called Manjushri Bodhisattva, Avalokitêśvara Bodhisattva, Maitreya Bodhisattva, Sudarśana Bodhisattva, Mahāprajāpatī Bodhisattva, Mahāprajāpatī Bodhisattva, Mahāprajāpatī Bodhisattva, Mahāp",
        "source": "T14n0451_001:0409a09_1"
    },
    {
        "source_sentence": "如是等諸大菩薩而為上首，及諸國王、大臣、婆羅門、居士、天龍八部，",
        "translation": "Such great bodhisattvas as these were the leaders, and the kings, ministers, brāhmaṇas, householders, gods, dragons, and eight groups of people.",
        "source": "T14n0451_001:0409a14_2"
    },
    {
        "source_sentence": "人、非人等，無量大眾恭敬圍遶，而為說法，初、中、後善，文義巧妙，",
        "translation": "People and non-people alike, surrounded by an immeasurable multitude of veneration, taught the Dharma to them. The beginning, middle, and end [of the discourse] were good, with subtle meanings and precise syllables.",
        "source": "T14n0451_001:0409a15_3"
    },
    {
        "source_sentence": "純一圓滿，清淨鮮白，梵行之相，示教利喜，皆令具足微妙行願，趣大菩提。",
        "translation": "They are pure, perfect, pure, pure, pure, and pure, with the characteristics of religious practice they show, teach, benefit, and delight, enabling them all to fulfill their subtle practical vows and proceed to great enlightenment.",
        "source": "T14n0451_001:0409a17_4"
    },
    {
        "source_sentence": "爾時，曼殊室利法王子菩薩摩訶薩，承佛威神，從座而起，偏袒右肩，",
        "translation": "At that time the great enlightening being Manjushri, the prince of the Teaching, the bodhisattva Mahāsattva who had attained buddhahood, having undergone the Buddha’s supernatural power, rose from his seat and bared his right shoulder.",
        "source": "T14n0451_001:0409a20_0"
    },
    {
        "source_sentence": "右膝著地，合掌恭敬，而白佛言：「世尊！",
        "translation": "He knelt with his right knee on the ground, joined his palms in respect, and said to the Buddha, Bhagavān!",
        "source": "T14n0451_001:0409a21_1"
    },
    {
        "source_sentence": "今有無量人天大眾，為聽法故，皆已雲集。",
        "translation": "Now there are an immeasurable number of people and gods who have assembled in this great assembly to hear the Dharma.",
        "source": "T14n0451_001:0409a22_2"
    },
    {
        "source_sentence": "惟佛世尊，從初發意，乃至於今，所有無量塵沙數劫諸佛剎土，無不知見。",
        "translation": "Only the Buddha, the Bhagavat, did not know or perceive all the buddha-lands that had been in existence for as many eons as there are grains of dust in the ocean of worlds from the first inspiration up to the present.",
        "source": "T14n0451_001:0409a23_3"
    },
    {
        "source_sentence": "願為我等及未來世像法眾生，慈悲演說諸佛名號、本願功德、國土莊嚴、善巧方便差別之相，",
        "translation": "“Furthermore, to us and to all sentient beings who will be born in the future like this buddha, may they compassionately teach the names of buddhas, the virtues of their past vows, the adornments of their lands, and the distinctive characteristics of their skillful means.",
        "source": "T14n0451_001:0409a25_4"
    },
    {
        "source_sentence": "令諸聞者，業障消除，乃至菩提，得不退轉。」",
        "translation": "It causes those who hear it to remove the karmic hindrances and even attain enlightenment without regressing.",
        "source": "T14n0451_001:0409a27_5"
    },
    {
        "source_sentence": "爾時，世尊讚曼殊室利菩薩言：「善哉！",
        "translation": "It was then that the Bhagavān praised Mañjuśrī Bodhisattva, saying, Good!",
        "source": "T14n0451_001:0409a28_6"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T14n0451_001:0409a29_7"
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0409a29_8"
    },
    {
        "source_sentence": "汝以大悲愍念無量業障有情，種種疾病、憂悲苦惱，得安樂故，勸請我說諸佛名號、本願功德、國土莊嚴。",
        "translation": "Because you have great compassion and pity for the immeasurable karmic hindrances of sentient beings who suffer from various illnesses, grief, sorrow, pain, and suffering and attain well-being, encourage me to explain the names of the buddhas, the merits of their original vows, and the adornments of their lands.",
        "source": "T14n0451_001:0409a29_9"
    },
    {
        "source_sentence": "此由如來威神之力，令發斯問。",
        "translation": "This is due to the authoritative power of the Tathāgata, who caused this question to be asked.",
        "source": "T14n0451_001:0409b03_10"
    },
    {
        "source_sentence": "汝今諦聽，極善思惟，當為汝說。」",
        "translation": "Listen attentively now, and consider it very well; you will explain it for me.",
        "source": "T14n0451_001:0409b03_11"
    },
    {
        "source_sentence": "曼殊室利言：「惟願為說，我等樂聞。」",
        "translation": "Mañjuśrī said, Please explain it for us, and we'll be happy to hear it.",
        "source": "T14n0451_001:0409b04_12"
    },
    {
        "source_sentence": "佛告曼殊室利：「東方去此，過四弶伽河沙佛土，有世界名曰無勝，佛號善名稱吉祥王如來、應、正等覺、明行圓滿、善逝、世間解、無上丈夫、調御士、天人師、佛、世尊，",
        "translation": "The Buddha told Mañjuśrī, “To the east of here, beyond the buddha lands as numerous as the sands of four Ganges Rivers in the eastern direction, there is a world called Wusheng (“Invincible”), which is called Shanming jiaosheng jing tathagatas (Good Name Auspicious King Tathāgata, Arhat, Perfectly Enlighten",
        "source": "T14n0451_001:0409b06_0"
    },
    {
        "source_sentence": "有無量億眾，不退菩薩之所圍遶，安住七寶勝妙莊嚴師子之座，現在說法。",
        "translation": "There were immeasurable millions of people, surrounded by nonregressing bodhisattvas, who settled on a lion seat beautifully adorned with the seven treasures and were now teaching the Dharma.",
        "source": "T14n0451_001:0409b09_1"
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0409b11_2"
    },
    {
        "source_sentence": "彼佛國土清淨嚴飾，縱廣正等百千踰繕那，以贍部金而為其地，平正柔軟，",
        "translation": "The land of that buddha-land was pure and beautifully adorned, one hundred thousand yojanas in width and depth, evenly spaced; the earth was made of jambiiled gold, flat and pliant.",
        "source": "T14n0451_001:0409b11_3"
    },
    {
        "source_sentence": "氣如天香；",
        "translation": "The air is like a heavenly fragrance.",
        "source": "T14n0451_001:0409b13_4"
    },
    {
        "source_sentence": "無諸惡趣及女人名，亦無瓦礫、沙石、棘刺；",
        "translation": "There are no evil destinies and the names of women, and there is no rubble, sand, stones, or thorns.",
        "source": "T14n0451_001:0409b13_5"
    },
    {
        "source_sentence": "寶樹行列，花果滋繁；",
        "translation": "Jeweled trees stood in rows, with plenty of flowers and fruit.",
        "source": "T14n0451_001:0409b14_6"
    },
    {
        "source_sentence": "多有浴池，皆以金銀、真珠、雜寶而為砌飾。",
        "translation": "There are many bathing ponds, all decorated with gold, silver, genuine pearls, and mixed treasures.",
        "source": "T14n0451_001:0409b15_7"
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0409b16_8"
    },
    {
        "source_sentence": "彼國菩薩皆於七寶蓮花化生。",
        "translation": "The bodhisattvas of those countries are all born in the seven-jeweled lotus flower.",
        "source": "T14n0451_001:0409b16_9"
    },
    {
        "source_sentence": "是故，淨信善男子、善女人，皆當願生彼佛國土。",
        "translation": "Therefore, good men and good women of pure faith should all wish to be born in that Buddha's land.",
        "source": "T14n0451_001:0409b17_10"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0409b18_11"
    },
    {
        "source_sentence": "彼佛如來、應、正等覺，從初發心行菩薩道時，發八大願。",
        "translation": "When the Buddha Tathāgata, Arhat, and Completely Awakened One first arouse their minds to practice the bodhisattva path, they give rise to eight great vows.",
        "source": "T14n0451_001:0409b18_12"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T14n0451_001:0409b19_13"
    },
    {
        "source_sentence": "「第一大願：願我來世得無上菩提時，若有眾生，為諸病苦逼切其身，",
        "translation": "“Great enlightening beings’ first great vow is that when I attain supreme awakening in the future, if there are sentient beings whose bodies are oppressed by illness and suffering,",
        "source": "T14n0451_001:0409b21_0"
    },
    {
        "source_sentence": "熱病、諸瘧、蠱道、厭魅、起屍鬼等之所惱害；",
        "translation": "They are afflicted by feverish illnesses, various kinds of malaria, the paths of delusion, disgusting spells, and corpse-producing ghosts.",
        "source": "T14n0451_001:0409b22_1"
    },
    {
        "source_sentence": "若能至心稱我名者，由是力故，所有病苦悉皆消滅，乃至證得無上菩提。",
        "translation": "If someone can wholeheartedly call me by my name, it's because of this power that all illnesses and pains will cease until they realize unsurpassed enlightenment.",
        "source": "T14n0451_001:0409b23_2"
    },
    {
        "source_sentence": "「第二大願：願我來世得菩提時，若有眾生，盲聾、瘖瘂、白癩、瘨狂，",
        "translation": "“Second great vow: May I attain enlightenment in a future life if there are any sentient beings who are blind, deaf, dumb, hoarse, white, leprosy, and crippled.",
        "source": "T14n0451_001:0409b26_0"
    },
    {
        "source_sentence": "眾病所困；",
        "translation": "They are afflicted by various diseases.",
        "source": "T14n0451_001:0409b27_1"
    },
    {
        "source_sentence": "若能至心稱我名者，由是力故，諸根具足，眾病消滅，乃至菩提。",
        "translation": "If someone can wholeheartedly call me by my name, it's because of this power that their faculties are endowed, and all illnesses cease until they attain enlightenment.",
        "source": "T14n0451_001:0409b27_2"
    },
    {
        "source_sentence": "「第三大願：願我來世得菩提時，若有眾生，為貪、瞋、癡之所纏逼，",
        "translation": "“Third great vow: May I attain enlightenment in the future, and if there are sentient beings who are tormented by craving, anger, and delusion,",
        "source": "T14n0451_001:0409c01_0"
    },
    {
        "source_sentence": "造無間罪及諸惡行，誹謗正法，不修眾善，當墮地獄，受諸苦痛；",
        "translation": "Those who commit unremitting sins and evil deeds, slander the true-dharma, and do not cultivate good deeds will fall into hell to suffer pain and suffering.",
        "source": "T14n0451_001:0409c02_1"
    },
    {
        "source_sentence": "若能至心稱我名者，由是力故，令無間罪及諸業障，悉皆消滅，無有眾生墮惡趣者，",
        "translation": "If someone can wholeheartedly call me by my name, it's because of this power that unremitting sins and karmic hindrances will all cease, and there won't be any sentient beings who fall into a bad destiny.",
        "source": "T14n0451_001:0409c04_2"
    },
    {
        "source_sentence": "常受人天殊勝安樂，乃至菩提。",
        "translation": "They'll always experience superior comfort from humans and gods up to enlightenment.",
        "source": "T14n0451_001:0409c06_3"
    },
    {
        "source_sentence": "「第四大願：願我來世得菩提時，若有眾生，少乏衣食、瓔珞、臥具、財貨、珍寶、香花、伎樂；",
        "translation": "“The fourth great vow is that when I attain enlightenment in the future, if there are any sentient beings with little need for food and clothing, jewelry, bedding, possessions, treasures, precious things, fragrant flowers, or music and dance.",
        "source": "T14n0451_001:0409c07_0"
    },
    {
        "source_sentence": "若能至心稱我名者，由是力故，所乏資生皆得充足，乃至菩提。",
        "translation": "If someone can wholeheartedly call me by my name, it's because of this power that they'll be able to satisfy their lack of necessities and even attain enlightenment.",
        "source": "T14n0451_001:0409c08_1"
    },
    {
        "source_sentence": "「第五大願：願我來世得菩提時，若有眾生，或被枷鎖繫縛其身，及以鞭撻，",
        "translation": "“The fifth great vow is that when I attain enlightenment in the future, if there are sentient beings whose bodies are fettered and bound by fetters or whipped,",
        "source": "T14n0451_001:0409c11_0"
    },
    {
        "source_sentence": "受諸苦惱；",
        "translation": "They experience all kinds of pain and suffering.",
        "source": "T14n0451_001:0409c12_1"
    },
    {
        "source_sentence": "若能至心稱我名者，由是力故，所有苦楚皆得解脫，乃至菩提。",
        "translation": "If someone can wholeheartedly call me by my name, it's because of this power that they'll be liberated from all suffering and attain enlightenment.",
        "source": "T14n0451_001:0409c13_0"
    },
    {
        "source_sentence": "「第六大願：願我來世得菩提時，若有眾生，於險難處，為諸惡獸，熊羆、師子、虎豹、豺狼、蚖蛇、蝮蠍之所侵惱，",
        "translation": "“The sixth great vow is that when I attain enlightenment in a future life, if there are sentient beings in dangerous places who are attacked by evil animals such as lion seals, lions, tigers, leopards, jackals, wolves, snakes, vipers, and scorpions,",
        "source": "T14n0451_001:0409c15_0"
    },
    {
        "source_sentence": "欲斷其命，發聲大叫，受大苦時；",
        "translation": "When they want to cut off their life, they make a loud noise and wail in great pain.",
        "source": "T14n0451_001:0409c17_1"
    },
    {
        "source_sentence": "若能至心稱我名者，由是力故，所有恐怖皆得解脫，諸惡獸等悉起慈心，",
        "translation": "If someone can wholeheartedly call me by my name, they'll attain liberation from all their fears because of this power, and bad animals and so forth will all become compassionate.",
        "source": "T14n0451_001:0409c18_2"
    },
    {
        "source_sentence": "常得安樂，乃至菩提。",
        "translation": "They'll always attain well-being, up to enlightenment.",
        "source": "T14n0451_001:0409c20_0"
    },
    {
        "source_sentence": "「第七大願：願我來世得菩提時，若有眾生，鬪諍言訟，因生憂惱；",
        "translation": "“The seventh great vow is that when I attain enlightenment in a future life, if there are any sentient beings who dispute and quarrel with each other, they will give rise to grief and vexation.",
        "source": "T14n0451_001:0409c21_0"
    },
    {
        "source_sentence": "若能至心稱我名者，由是力故，鬪訟解散，慈心相向，乃至菩提。",
        "translation": "If someone can wholeheartedly call me by my name, it's because of this power that their disputes are resolved and dispersed, the mind of kindness is directed toward each other, up to enlightenment.",
        "source": "T14n0451_001:0409c22_1"
    },
    {
        "source_sentence": "「第八大願：願我來世得菩提時，若有眾生，入於江海，遭大惡風吹其船舫，",
        "translation": "“Eighth great vow: May I attain enlightenment in the future, if there are any sentient beings who enter a river or ocean and encounter a great evil wind blowing their boatboat.",
        "source": "T14n0451_001:0409c25_0"
    },
    {
        "source_sentence": "無有洲渚而作歸依，極生憂怖；",
        "translation": "They have no continents or islands to take refuge in and become greatly grieved and fearful.",
        "source": "T14n0451_001:0409c26_1"
    },
    {
        "source_sentence": "若能至心稱我名者，由是力故，皆得隨心，至安隱處，受諸快樂，乃至菩提。",
        "translation": "If someone can wholeheartedly call me by my name, it's because of this power that they'll all attain mindfulness, reach a peaceful place, experience pleasures, and even attain enlightenment.",
        "source": "T14n0451_001:0409c27_2"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0409c29_3"
    },
    {
        "source_sentence": "是謂彼佛、如來、應、正等覺，行菩薩道時，所發八種微妙大願。",
        "translation": "These are the eight kinds of subtle great vows that those buddhas, tathāgatas, arhats, and fully awakened ones make when they practice the bodhisattva path.",
        "source": "T14n0451_001:0409c29_4"
    },
    {
        "source_sentence": "又彼世尊，從初發心，常以定力成就眾生、供養諸佛、嚴淨佛土，菩薩眷屬悉皆圓滿。",
        "translation": "Also, the Bhagavān always accomplished sentient beings with the power of concentration from the first arousal of his mind, made offerings to the buddhas, adorned and purified the Buddha's land, and had a full retinue of bodhisattvas.",
        "source": "T14n0451_001:0410a02_5"
    },
    {
        "source_sentence": "此之福德，不可思議，一切聲聞及諸獨覺，縱經多劫，說不能盡，唯除如來、補處菩薩。",
        "translation": "All the śrāvakas and pratyekabuddhas, even for many kalpas, are unable to fully explain this merit except for the Tathāgata and the bodhisattvas in their remedial state.",
        "source": "T14n0451_001:0410a04_6"
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0410a06_7"
    },
    {
        "source_sentence": "若有淨信男子、女人，若王、大臣、長者、居士，心悕福德，斷諸煩惱，",
        "translation": "If there are purely faithful men and women, or kings, ministers, elders, or householders, whose minds are devoted to merit and who have cut off the afflictions,",
        "source": "T14n0451_001:0410a06_8"
    },
    {
        "source_sentence": "稱彼佛名，讀斯經典，於彼如來至心尊重，恭敬供養，所有一切罪惡業障及諸病苦，",
        "translation": "They call on the name of that buddha and recite this scripture. With utmost reverence they honor, venerate, and pay homage to those buddhas. All their sins, bad deeds, obstacles, illnesses, and sufferings are eliminated.",
        "source": "T14n0451_001:0410a07_9"
    },
    {
        "source_sentence": "悉皆消滅，諸有願求，無不隨意，得不退轉，乃至菩提。",
        "translation": "They all cease, and there's nothing that those who wish for it don't follow their will to attain nonretrogression up to enlightenment.",
        "source": "T14n0451_001:0410a09_10"
    },
    {
        "source_sentence": "「復次，曼殊室利！",
        "translation": "Furthermore, Mañjuśrī!",
        "source": "T14n0451_001:0410a12_0"
    },
    {
        "source_sentence": "東方去此，過五殑伽河沙佛土，有世界名曰妙寶，佛號寶月智嚴光音自在王如來、應、正等覺，",
        "translation": "“East of here, past the buddha-lands as numerous as the grains of sand in five Ganges Rivers, is a world called Marvelous Jewel. The Buddha there is called Jewel-Moon Wisdom Adorned with Empowering Light and Sound Sovereign Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T14n0451_001:0410a12_1"
    },
    {
        "source_sentence": "有無量億菩薩圍繞，現在說法，皆演大乘微妙深義。",
        "translation": "They were surrounded by countless millions of bodhisattvas who taught the Dharma, all expounding the subtle and profound meaning of the great vehicle.",
        "source": "T14n0451_001:0410a14_2"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0410a15_3"
    },
    {
        "source_sentence": "彼佛如來，從初發心行菩薩道時，發八大願。",
        "translation": "When that Buddha Tathāgata first arouses his mind and practices the bodhisattva path, he gives rise to eight great vows.",
        "source": "T14n0451_001:0410a16_0"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T14n0451_001:0410a17_1"
    },
    {
        "source_sentence": "「第一大願：願我來世得菩提時，若有眾生，為營農業及商賈事，令心擾亂，",
        "translation": "“The first great vow: May I attain enlightenment in a future life if there are any sentient beings who do business in agriculture and mercantile affairs to disturb their minds,",
        "source": "T14n0451_001:0410a18_0"
    },
    {
        "source_sentence": "廢修菩提、殊勝善法，於生死中不能出離，各各備受無邊苦惱；",
        "translation": "They discard cultivation of enlightenment and the supremely good doctrine, cannot get free from it in births and deaths; each is prepared to experience boundless pain and suffering.",
        "source": "T14n0451_001:0410a19_1"
    },
    {
        "source_sentence": "若能至心稱我名者，由是力故，衣服、飲食、資生之具，金銀、珍寶，",
        "translation": "If someone can wholeheartedly call me by my name, it's because of this power that they wear clothing, food and drink, necessities, gold and silver, and treasures.",
        "source": "T14n0451_001:0410a21_2"
    },
    {
        "source_sentence": "隨願充足，所有善根皆得增長，亦不捨離菩提之心，諸惡道苦咸蒙解脫，",
        "translation": "The roots of goodness they have all grown according to their wishes, yet they do not give up the determination for enlightenment. They are liberated from the miseries of bad states of existence.",
        "source": "T14n0451_001:0410a22_3"
    },
    {
        "source_sentence": "乃至菩提。",
        "translation": "Up to enlightenment.",
        "source": "T14n0451_001:0410a24_4"
    },
    {
        "source_sentence": "「第二大願：願我來世得菩提時，於十方界，所有眾生，若為寒熱、飢渴逼身，",
        "translation": "“Second great vow: When I attain enlightenment in a future life, may all sentient beings in the worlds of the ten directions be constrained by cold, heat, hunger, thirst,",
        "source": "T14n0451_001:0410a25_0"
    },
    {
        "source_sentence": "受大苦惱；",
        "translation": "They experience great suffering and distress.",
        "source": "T14n0451_001:0410a26_1"
    },
    {
        "source_sentence": "若能至心稱我名者，由是力故，先世罪業悉皆消滅，捨諸苦惱，受人天樂，",
        "translation": "If someone sincerely calls me by my name, it is because of this power that their sins and actions in previous lives will all be extinguished, they will abandon suffering and distress, and they will experience the pleasures of humans and gods.",
        "source": "T14n0451_001:0410a27_0"
    },
    {
        "source_sentence": "乃至菩提。",
        "translation": "Up to enlightenment.",
        "source": "T14n0451_001:0410a28_1"
    },
    {
        "source_sentence": "「第三大願：願我來世得菩提時，於十方界，若有女人，貪婬煩惱常覆其心，",
        "translation": "“Third great vow: When I attain enlightenment in a future life, may there be women in the worlds of the ten directions whose minds are always covered by craving and afflictions,",
        "source": "T14n0451_001:0410a29_0"
    },
    {
        "source_sentence": "相續有娠，深可厭惡，臨當產時，受大苦惱；",
        "translation": "In succession, the empress was deeply disgusting and would experience great pain and suffering when she was about to give birth.",
        "source": "T14n0451_001:0410b01_1"
    },
    {
        "source_sentence": "若我名字暫經其耳，或復稱念，由是力故，眾苦皆除，捨此身已，常為男子，",
        "translation": "If my name were to pass through their ears for a moment, or if they were to call me by my name, all suffering would be removed because of that power. Having relinquished this body, he would always be a man.",
        "source": "T14n0451_001:0410b02_2"
    },
    {
        "source_sentence": "乃至菩提。",
        "translation": "Up to enlightenment.",
        "source": "T14n0451_001:0410b04_3"
    },
    {
        "source_sentence": "「第四大願：願我來世得菩提時，若有眾生，或與父母、兄弟、姊妹、妻子、眷屬及諸親友，",
        "translation": "“Fourth great vow: May I attain enlightenment in a future life if there are any sentient beings, or their parents, brothers, sisters, wives, retinues, and friends.",
        "source": "T14n0451_001:0410b05_0"
    },
    {
        "source_sentence": "行險難處，為賊所侵，受諸苦惱；",
        "translation": "In dangerous and difficult places they are attacked by thieves and suffer various kinds of pain and suffering.",
        "source": "T14n0451_001:0410b07_0"
    },
    {
        "source_sentence": "暫聞我名，或復稱念，由是力故，解脫眾難，乃至菩提。",
        "translation": "Because of this power, they are liberated from all difficulties and even attain enlightenment.",
        "source": "T14n0451_001:0410b07_1"
    },
    {
        "source_sentence": "「第五大願：願我來世得菩提時，若有眾生，行於闇夜，作諸事業，被惡鬼神之所惱亂，",
        "translation": "“Fifth great vow: May I attain enlightenment in a future life, if there are sentient beings who practice in the dark night and do all kinds of deeds to be disturbed by evil spirits.",
        "source": "T14n0451_001:0410b10_0"
    },
    {
        "source_sentence": "極生憂苦；",
        "translation": "grief and suffering arise from the extremes.",
        "source": "T14n0451_001:0410b12_0"
    },
    {
        "source_sentence": "暫聞我名，或復稱念，由是力故，從闇遇明，諸惡鬼神起慈悲意，乃至菩提。",
        "translation": "Because of this power, evil spirits and ghosts suddenly hear my name for a moment or even repeat my name in their minds, and because of that power, they go from darkness to light, producing thoughts of kindness and pity up to bodhi.",
        "source": "T14n0451_001:0410b12_1"
    },
    {
        "source_sentence": "「第六大願：願我來世得菩提時，若有眾生，行鄙惡事，不信三寶，智慧尠少，",
        "translation": "“The sixth great vow is that when I attain enlightenment in a future life, if there are sentient beings who do mean things, don’t believe in the Three Treasures, and have little wisdom or insight,",
        "source": "T14n0451_001:0410b15_0"
    },
    {
        "source_sentence": "不修善法，根、力、覺、道、念、定、總持，皆不修習；",
        "translation": "They do not cultivate wholesome states, and they do not cultivate their faculties, powers, feelings, paths, thoughts, concentrations, or general maintenances.",
        "source": "T14n0451_001:0410b16_1"
    },
    {
        "source_sentence": "若能至心稱我名者，由是力故，智慧漸增，三十七品悉皆修學，深信三寶，",
        "translation": "If they can sincerely call me by my name, it is because of this power that their wisdom gradually increases and all the thirty-seven qualities are cultivated, and they deeply believe in the Three Treasures.",
        "source": "T14n0451_001:0410b17_2"
    },
    {
        "source_sentence": "乃至菩提。",
        "translation": "Up to enlightenment.",
        "source": "T14n0451_001:0410b19_3"
    },
    {
        "source_sentence": "「第七大願：願我來世得菩提時，若有眾生，意樂鄙劣，於二乘道，修行而住，",
        "translation": "“The seventh great vow is that when I attain enlightenment in the future, if there are sentient beings with lowly aspirations who practice and abide on the path of the two vehicles,",
        "source": "T14n0451_001:0410b20_0"
    },
    {
        "source_sentence": "棄背無上勝妙菩提；",
        "translation": "They turn their backs on unexcelled, supremely wonderful enlightenment.",
        "source": "T14n0451_001:0410b21_1"
    },
    {
        "source_sentence": "若能至心稱我名者，捨二乘見，於無上覺得不退轉，乃至菩提。",
        "translation": "If someone can wholeheartedly call me by my name, they'll abandon the two-vehicle view and experience unsurpassed nonregression up to enlightenment.",
        "source": "T14n0451_001:0410b22_2"
    },
    {
        "source_sentence": "「第八大願：願我來世得菩提時，若有眾生，見劫將盡，火欲起時，生大憂怖，",
        "translation": "“Eighth great vow: May I attain enlightenment in the future, if there are any sentient beings who see an eon coming to an end and become greatly grieved when a fire is about to start.",
        "source": "T14n0451_001:0410b24_0"
    },
    {
        "source_sentence": "苦惱悲泣，由彼前身惡業力故，受斯眾苦，無所歸依；",
        "translation": "Because of the power of their past evil deeds, they experience this mass of suffering and do not rely on anything.",
        "source": "T14n0451_001:0410b25_1"
    },
    {
        "source_sentence": "若能至心稱我名者，所有憂苦悉皆消滅，受清涼樂，從此命終，於我佛土蓮華化生，",
        "translation": "If they wholeheartedly call me by my name, all their sorrow and suffering will be extinguished, and they’ll experience pure bliss. At the end of their life here, being born in my buddha-lands like a lotus flower!",
        "source": "T14n0451_001:0410b27_0"
    },
    {
        "source_sentence": "常修善法，乃至菩提。",
        "translation": "They always cultivate good qualities up to enlightenment.",
        "source": "T14n0451_001:0410b29_0"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0410c01_0"
    },
    {
        "source_sentence": "是為彼佛、如來、應、正等覺，行菩薩道時，所發八種微妙大願。",
        "translation": "These are the eight subtle great vows that those buddhas, tathāgatas, arhats, and perfectly enlightened ones make when they practice the bodhisattva path.",
        "source": "T14n0451_001:0410c01_1"
    },
    {
        "source_sentence": "又彼如來所居佛土，廣博嚴淨，地平如掌；",
        "translation": "Furthermore, the buddha-lands where the Buddha resided were as vast and pure as if he were touching his palm.",
        "source": "T14n0451_001:0410c02_2"
    },
    {
        "source_sentence": "天妙香樹而為行列，天花遍覆，天樂常鳴，天妙鈴鐸隨處懸布，天寶莊嚴師子之座，",
        "translation": "The trees of exquisite fragrance of the heavens are lined up in rows, covered with celestial flowers. Celestial music is heard all the time; beautiful bells and chimes of the heavenly realm hang hang everywhere. A lion seat adorned with divine jewels is set on it.",
        "source": "T14n0451_001:0410c03_3"
    },
    {
        "source_sentence": "天寶砌飾諸妙浴池；",
        "translation": "They are adorned with celestial jewels and decorated with beautiful bathing ponds.",
        "source": "T14n0451_001:0410c05_4"
    },
    {
        "source_sentence": "其地柔軟，無諸瓦礫，亦無女人及諸煩惱，皆是不退諸菩薩眾，蓮花化生；",
        "translation": "The ground was soft and there were no rubble stones, women, or afflictions. None of the enlightening beings who did not regress came back from the assembly: the lotus blossom-flowered apparitional beings.",
        "source": "T14n0451_001:0410c05_5"
    },
    {
        "source_sentence": "若起念時，飲食、衣服及諸資具隨意現前，是故名為妙寶世界。",
        "translation": "When they give rise to mindfulness, food, drink, clothing, and other necessities are manifested as they wish, which is why it's called the marvelous treasure world.",
        "source": "T14n0451_001:0410c07_6"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0410c09_0"
    },
    {
        "source_sentence": "若有淨信男子、女人、國王、王子、大臣、輔相、中宮、婇女，晝夜六時，",
        "translation": "If there are purely faithful men, women, kings, princes, ministers, assistants, palace officials, and court ladies at six o’clock during the day and night,",
        "source": "T14n0451_001:0410c09_1"
    },
    {
        "source_sentence": "慇重至心，恭敬供養彼佛世尊，及稱名號，并造形像，香花、音樂、燒香、末香、塗香而為奉獻，",
        "translation": "With affection and sincerity, they reverently venerate and honor that buddha world-honored one. They present to him their names, names, and forms, as well as fragrant flowers, music, burning incense, powdered incense, and ointments of ointment.",
        "source": "T14n0451_001:0410c10_2"
    },
    {
        "source_sentence": "清淨嚴潔，於七日中，持八戒齋，於諸眾生起慈悲意，願生彼土；",
        "translation": "For seven days he observed the eight precepts and, having developed compassion for sentient beings, wished to be born in that land.",
        "source": "T14n0451_001:0410c12_3"
    },
    {
        "source_sentence": "彼佛世尊及諸菩薩，護念是人，一切罪業悉皆消滅，無上菩提得不退轉，",
        "translation": "The buddhas, world-honored ones, and enlightening beings will protect these people. All their sins and actions will be completely extinguished, and they will attain unexcelled, perfect enlightenment without regressing.",
        "source": "T14n0451_001:0410c14_4"
    },
    {
        "source_sentence": "於貪、恚、癡漸得微薄，無諸病苦，增益壽命，隨有悕求，悉皆如意，",
        "translation": "Their craving, hatred, and delusion gradually diminished. They were free from the pains of sickness and disease and increased in longevity. Anyone who longed or wished to do so did so as they wished.",
        "source": "T14n0451_001:0410c15_5"
    },
    {
        "source_sentence": "鬪諍怨家咸生歡喜，捨此身已，往彼剎土，蓮花化生，當生之時，念、定、總持，",
        "translation": "Having abandoned this body, he goes to another buddha-land. The lotus flower appears in the world by means of magical creations. When he is born there, his mind, his concentration, and his absorption are always filled with joy.",
        "source": "T14n0451_001:0410c17_6"
    },
    {
        "source_sentence": "悉皆明了。",
        "translation": "They're all clearly understood.",
        "source": "T14n0451_001:0410c19_7"
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0410c19_8"
    },
    {
        "source_sentence": "如是當知，彼佛名號無量功德，若得聞者，所願皆成。",
        "translation": "Thus, you should know that the names of those buddhas are immeasurable in virtue, and if someone hears them, their wishes will be fulfilled.",
        "source": "T14n0451_001:0410c19_9"
    },
    {
        "source_sentence": "「復次，曼殊室利！",
        "translation": "Furthermore, Mañjuśrī!",
        "source": "T14n0451_001:0410c21_0"
    },
    {
        "source_sentence": "東方去此，過六殑伽河沙佛土，有世界名曰圓滿香積，佛號金色寶光妙行成就如來、應、正等覺，",
        "translation": "“East of here, past the buddha-lands of six Ganges Rivers, is a world called Sphere of Fragrance. The Buddha there is called Golden Jewel Light Marvelous Action Accomplished Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T14n0451_001:0410c21_1"
    },
    {
        "source_sentence": "有無量億萬菩薩圍遶，現在說法。",
        "translation": "Innumerable hundreds of millions of bodhisattvas surrounded him, who are now teaching the Dharma.",
        "source": "T14n0451_001:0410c23_2"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0410c24_3"
    },
    {
        "source_sentence": "彼佛如來，從初發心行菩薩道時，發四大願。",
        "translation": "When that Buddha Tathāgata first arouses his mind and practices the bodhisattva path, he gives rise to the four great vows.",
        "source": "T14n0451_001:0410c24_4"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T14n0451_001:0410c25_5"
    },
    {
        "source_sentence": "「第一大願：願我來世得菩提時，若有眾生，造作種種屠害之業，斷諸生命，",
        "translation": "“The first great vow is that when I attain enlightenment in the future, if there are sentient beings who commit various acts of slaughter and cut off life,",
        "source": "T14n0451_001:0410c27_0"
    },
    {
        "source_sentence": "由斯惡業，受地獄苦，設得為人，短壽多病，或遭水火、刀毒所傷，當受死苦；",
        "translation": "Because of these evil deeds, they will suffer the pain of hell. Even if they become human beings with a short life span and many illnesses, or are injured by water, fire, or the poison of swords, they will experience the pain of death.",
        "source": "T14n0451_001:0410c28_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，由是力故，所有惡業悉皆消滅，無病、長壽、不遭橫死，",
        "translation": "If they hear my name and wholeheartedly praise it, all their bad actions will cease because of this power. They will be free from sickness, live a long life, and not experience unremitting death.",
        "source": "T14n0451_001:0411a01_2"
    },
    {
        "source_sentence": "乃至菩提。",
        "translation": "Up to enlightenment.",
        "source": "T14n0451_001:0411a03_3"
    },
    {
        "source_sentence": "「第二大願：願我來世得菩提時，若有眾生，作諸惡業，盜他財物，當墮惡趣，",
        "translation": "“Second great vow: When I attain enlightenment in the future, may all sentient beings who commit evil deeds steal others’ property and fall into a bad rebirth.",
        "source": "T14n0451_001:0411a04_0"
    },
    {
        "source_sentence": "設得為人，生貧窮家，乏少衣食，常受諸苦；",
        "translation": "Suppose he were to become a human being and be born in a house of poverty, with little food or clothing, always suffering.",
        "source": "T14n0451_001:0411a05_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，由是力故，所有惡業悉皆消滅，衣服、飲食無所乏少，",
        "translation": "If they hear my name and wholeheartedly cherish it, all their bad actions will cease because of this power. They will have no lack of clothing, food, or drink.",
        "source": "T14n0451_001:0411a06_2"
    },
    {
        "source_sentence": "乃至菩提。",
        "translation": "Up to enlightenment.",
        "source": "T14n0451_001:0411a08_3"
    },
    {
        "source_sentence": "「第三大願：願我來世得菩提時，若有眾生，更相凌慢，共為讐隙；",
        "translation": "Third great vow: May I attain enlightenment in the future, so that if there are any sentient beings, they will become even more arrogant and conceited, becoming mutually hostile.",
        "source": "T14n0451_001:0411a09_0"
    },
    {
        "source_sentence": "若聞我名，至心稱念，由是力故，各起慈心，猶如父母，乃至菩提。",
        "translation": "If they hear my name and wholeheartedly praise it, each will give rise to the mind of kindness because of this power, just like their parents, up to enlightenment.",
        "source": "T14n0451_001:0411a10_1"
    },
    {
        "source_sentence": "「第四大願：願我來世得菩提時，若有眾生，貪欲、瞋恚、愚癡所纏，",
        "translation": "“The fourth great vow is that when I attain enlightenment in the future, if there are sentient beings bound by desire, anger, and folly,",
        "source": "T14n0451_001:0411a13_0"
    },
    {
        "source_sentence": "若出家在家男女七眾，毀犯如來所制學處，造諸惡業，當墮地獄，受諸苦報；",
        "translation": "If a renunciant renounces the householder’s life, if he violates the precepts established by the Tathāgata and commits evil deeds, he or she will fall into hell and suffer the painful retribution.",
        "source": "T14n0451_001:0411a14_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，由是力故，所有惡業悉皆消滅，斷諸煩惱，敬奉尸羅，",
        "translation": "If they hear my name and wholeheartedly praise it, all their bad actions will be extinguished because of this power. They will cut off the defilements and reverently venerate śīla.",
        "source": "T14n0451_001:0411a16_2"
    },
    {
        "source_sentence": "於身、語、心，善能防護，永不退轉，乃至菩提。",
        "translation": "They are well able to guard body, speech, and mind, never retreating or regressing, even up to enlightenment.",
        "source": "T14n0451_001:0411a18_3"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0411a20_0"
    },
    {
        "source_sentence": "是為彼佛、如來、應、正等覺，行菩薩道時，所發四種微妙大願。",
        "translation": "These are the four subtle great vows that those buddhas, tathāgatas, arhats, and fully awakened ones make when they practice the bodhisattva path.",
        "source": "T14n0451_001:0411a20_1"
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0411a21_2"
    },
    {
        "source_sentence": "又彼如來所居佛土，廣博嚴淨，地平如掌，皆以寶成；",
        "translation": "Furthermore, the buddha-lands where the Buddha resided were as vast and extensive as if he were touching his palm. All of them were made of precious substances.",
        "source": "T14n0451_001:0411a21_3"
    },
    {
        "source_sentence": "常有香氣，如妙栴檀，復以香樹而為行列，天妙珠瓔、摩尼等寶處處垂下；",
        "translation": "It always had an odor like exquisite sandalwood and was lined with fragrant trees, adorned with heavenly jewels such as celestial pearls, jewelry, precious stones, and other treasures.",
        "source": "T14n0451_001:0411a23_0"
    },
    {
        "source_sentence": "多有浴池，天寶嚴飾，香水盈滿，眾德皆具，於其四邊，懸妙繒綵；",
        "translation": "There were many bathing ponds, richly decorated with celestial jewels and full of fragrant water. Endowed with all virtues, they hung beautiful silk ribbons on the four sides.",
        "source": "T14n0451_001:0411a24_1"
    },
    {
        "source_sentence": "街衢八道，隨處莊嚴；",
        "translation": "The streets and eight alleys of the monastery were adorned everywhere.",
        "source": "T14n0451_001:0411a26_2"
    },
    {
        "source_sentence": "所有眾生，無諸煩惱及憂悲苦，亦無女人，多是住地諸菩薩眾；",
        "translation": "All the sentient beings there were free from afflictions, sorrow, pain, and suffering, and they were not women. Most of them were congregations of enlightening beings living in the stages.",
        "source": "T14n0451_001:0411a26_3"
    },
    {
        "source_sentence": "勝妙音樂，不鼓自鳴，演說大乘微妙深法，若有眾生聞此音者，得不退轉無上菩提。",
        "translation": "It is a sublime sound that doesn't beat itself, and it teaches the subtle and profound teachings of the great vehicle; if any sentient beings hear this sound, they'll attain unsurpassed enlightenment without regressing.",
        "source": "T14n0451_001:0411a28_4"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0411b02_0"
    },
    {
        "source_sentence": "彼佛如來由昔願力，善巧方便成就佛土，圓滿莊嚴，坐菩提座，作如是念：『於未來世，",
        "translation": "That buddha-tathāgata, by the power of his past vows, skillfully and skillfully accomplished the buddha-lands, perfectly adorned them, sat on the seat of enlightenment, and had this thought:",
        "source": "T14n0451_001:0411b02_1"
    },
    {
        "source_sentence": "若有眾生，為貪、瞋、癡之所纏繞，眾病所逼，怨家得便，或時橫死，",
        "translation": "If there are sentient beings who are tormented by craving, hatred, and delusion, oppressed by various illnesses, whose enemies get an advantage over them, or sometimes die uncontrollably.",
        "source": "T14n0451_001:0411b04_2"
    },
    {
        "source_sentence": "復由惡業，墮地獄中，受大劇苦。』",
        "translation": "Again, because of bad actions, they'll fall into hell and experience great suffering.'",
        "source": "T14n0451_001:0411b05_3"
    },
    {
        "source_sentence": "彼佛見此苦惱眾生，為除業障，說此神呪，令彼受持，於現世中得大利益，",
        "translation": "Seeing these suffering and distressed sentient beings, the Buddha expounded this magic spell to remove the karmic hindrances so that they could retain it and attain great benefit in the present life.",
        "source": "T14n0451_001:0411b06_4"
    },
    {
        "source_sentence": "遠離眾苦，住菩提故。",
        "translation": "They are free of suffering because they abide in enlightenment.",
        "source": "T14n0451_001:0411b08_5"
    },
    {
        "source_sentence": "即說呪曰：「『呾姪他悉[日*弟]悉[日*弟]　蘇悉[日*弟]　謨折儞木剎儞　目帝毘目帝　菴末麗毘末麗　忙揭例呬[口*闌]若揭鞞曷喇呾娜　揭鞞　薩婆頞他娑但儞　鉢囉摩頞他　娑但儞末捺細　莫訶末捺細　頞步帝頞室步帝　毘多婆曳　蘇跋泥(去)　跋囉蚶摩　瞿俠佉　跋囉蚶摩柱俠帝　薩婆頞剃數　阿鉢囉匝帝薩跋呾囉　阿鉢[口*剎]底喝帝　折覩殺　瑟[木*致]勃陀俱胝　婆俠帝　納摩娑婆　呾他揭多喃　莎訶』」爾時，",
        "translation": "He then spoke the mantra, saying, '姪他悉[日*弟]悉[日*弟]悉[日*弟] 蘇悉[日*弟] 折",
        "source": "T14n0451_001:0411b08_6"
    },
    {
        "source_sentence": "世尊說此大力大明呪時，眾中所有諸大菩薩、四大天王、釋梵王等讚言：「善哉！",
        "translation": "When the Bhagavān spoke this great and mighty great luminous spell, all the great bodhisattvas, four great celestial kings, and Śakra Devānām-Indra among them praised it, saying, Good!",
        "source": "T14n0451_001:0411b20_7"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T14n0451_001:0411b21_8"
    },
    {
        "source_sentence": "大悲世尊！",
        "translation": "Great compassion, Bhagavān!",
        "source": "T14n0451_001:0411b22_0"
    },
    {
        "source_sentence": "能說如是過去如來大力神呪，為欲饒益無量眾生，竭煩惱海，登涅槃岸，",
        "translation": "In order to benefit innumerable sentient beings he expelled the sea of afflictions and ascended to the shore of nirvana.",
        "source": "T14n0451_001:0411b22_1"
    },
    {
        "source_sentence": "除去疾病，所願皆滿。」",
        "translation": "They'll be freed from illness and fulfill all their wishes.",
        "source": "T14n0451_001:0411b23_2"
    },
    {
        "source_sentence": "佛告大眾：「若有淨信男子、女人、國王、王子、大臣、輔相、中宮、婇女，",
        "translation": "The Buddha told the great assembly, “If there are pure believers among men, women, kings, princes, ministers, assistants, palace officials, and court ladies,",
        "source": "T14n0451_001:0411b25_0"
    },
    {
        "source_sentence": "情悕福德，於此神呪起敬信心，若讀、若誦、若為他人演說其義，於諸含識起大悲心，",
        "translation": "With affection for the virtues of sentient beings, they give rise to reverence and faith in this dhāraṇī. If they recite it or recite it, or explain its meaning to others, they will develop great compassion toward all living beings.",
        "source": "T14n0451_001:0411b26_1"
    },
    {
        "source_sentence": "晝夜六時，香華燈燭，殷重供養，清淨澡浴，持八戒齋，至誠念誦，所有極重無邊業障，",
        "translation": "At six o’clock during the day and night, they offer incense, flowers, lamps, candles, and other kinds of offerings. They bathe cleanly, observe the eight precepts, and recite them with utmost sincerity. All these are extremely heavy and limitless obstacles due to karma.",
        "source": "T14n0451_001:0411b28_2"
    },
    {
        "source_sentence": "悉皆消滅，於現身中離諸煩惱，命欲終時諸佛護念，即於彼國蓮花化生。",
        "translation": "They all cease, become free of the afflictions in their present body, and when their lives are about to end, the buddhas protect them, so they're born in that country as lotus-flower apparitional beings.",
        "source": "T14n0451_001:0411c01_3"
    },
    {
        "source_sentence": "「復次，曼殊室利！",
        "translation": "Furthermore, Mañjuśrī!",
        "source": "T14n0451_001:0411c04_0"
    },
    {
        "source_sentence": "東方去此，過七殑伽河沙佛土，有世界名曰無憂，佛號無憂最勝吉祥如來、應、正等覺，",
        "translation": "“East of here, past the buddha-lands as numerous as the grains of sand in seven Ganges Rivers, is a world called No Sorrow. The Buddha there is called Supremely Auspicious Tathāgata, Arhat, Perfectly Enlightened One Who Has No Sorrow.",
        "source": "T14n0451_001:0411c04_1"
    },
    {
        "source_sentence": "今現在彼，為眾說法。",
        "translation": "Now he's there, teaching the Dharma for the masses.",
        "source": "T14n0451_001:0411c06_2"
    },
    {
        "source_sentence": "又彼如來所居佛土，廣博嚴淨，地平如掌，皆以寶成，細滑柔軟，常有香氣；",
        "translation": "Furthermore, the buddha-lands in which the Buddha resided were as vast and extensive as if they were his palms. All of them were made of precious substances, fine and smooth, soft and supple, always with fragrance.",
        "source": "T14n0451_001:0411c06_3"
    },
    {
        "source_sentence": "無憂苦聲，離諸煩惱，亦無惡趣及女人名；",
        "translation": "They have no sound of sorrow or pain, and are free from all afflictions. They also have no bad destinies or the names of women.",
        "source": "T14n0451_001:0411c08_4"
    },
    {
        "source_sentence": "處處皆有金砌浴池，香水盈滿；",
        "translation": "Everywhere there is a golden-brick bathing pond, full of fragrant water.",
        "source": "T14n0451_001:0411c09_5"
    },
    {
        "source_sentence": "寶樹行列，花果滋茂；",
        "translation": "Jeweled trees stood in rows, with abundant flowers and fruit.",
        "source": "T14n0451_001:0411c10_6"
    },
    {
        "source_sentence": "勝妙音樂，不鼓自鳴，譬如西方極樂世界無量壽國功德莊嚴。",
        "translation": "The exquisite music sound is like the adornment of the virtues of the land of Immeasurable Life in the Western paradise world.",
        "source": "T14n0451_001:0411c10_7"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0411c12_8"
    },
    {
        "source_sentence": "彼佛世尊行菩薩道時，發四大願。",
        "translation": "When the Bhagavān of that Buddha practices the bodhisattva path, he gives rise to the four great vows.",
        "source": "T14n0451_001:0411c12_9"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T14n0451_001:0411c13_10"
    },
    {
        "source_sentence": "「第一大願：願我來世得菩提時，若有眾生，常為憂苦之所纏逼；",
        "translation": "“Great enlightening beings’ first great vow is that in the future when I attain enlightenment, all sentient beings will always be tormented by sorrow and suffering.",
        "source": "T14n0451_001:0411c14_0"
    },
    {
        "source_sentence": "若聞我名，至心稱念，由是力故，所有憂悲及諸苦惱，悉皆消滅，長壽安隱，",
        "translation": "If they hear my name and wholeheartedly praise it, all their griefs, sorrows, pains, and afflictions will be extinguished because of that power, and they’ll live a long life in peace.",
        "source": "T14n0451_001:0411c15_1"
    },
    {
        "source_sentence": "乃至菩提。",
        "translation": "Up to enlightenment.",
        "source": "T14n0451_001:0411c17_2"
    },
    {
        "source_sentence": "「第二大願：願我來世得菩提時，若有眾生，造諸惡業，生在無間黑闇之處，",
        "translation": "“Second great vow: When I attain enlightenment in the future, may all sentient beings who have done evil deeds be born in the unremitting darkness of ignorance.",
        "source": "T14n0451_001:0411c18_0"
    },
    {
        "source_sentence": "大地獄中受諸苦惱；",
        "translation": "In the great hells they experience various pains and distress.",
        "source": "T14n0451_001:0411c19_1"
    },
    {
        "source_sentence": "由彼前身聞我名字，我於爾時，身出光明，照受苦者，由是力故，彼見光時，",
        "translation": "Because they heard my name before in their bodies, and at that very moment I emitted a ray of light from my body. It illumined the beings who suffered pain because of this power.",
        "source": "T14n0451_001:0411c20_2"
    },
    {
        "source_sentence": "所有業障悉皆消滅，解脫眾苦，生人天中，隨意受樂，乃至菩提。",
        "translation": "All the karmic hindrances are completely extinguished, liberated from all suffering, and born among humans and gods, they'll experience happiness as they wish, up to enlightenment.",
        "source": "T14n0451_001:0411c22_3"
    },
    {
        "source_sentence": "「第三大願：願我來世得菩提時，若有眾生，造諸惡業，殺盜邪婬，於其現身受刀杖苦，",
        "translation": "“Third great vow: May I attain enlightenment in a future life when there are sentient beings who commit evil deeds, such as killing, stealing, and sexual misconduct, and experience the suffering of swords and sticks in their present bodies.",
        "source": "T14n0451_001:0411c24_0"
    },
    {
        "source_sentence": "當墮惡趣，設得人身，短壽多病，生貧賤家，衣服飲食，悉皆乏少，常受寒熱、飢渴等苦，",
        "translation": "They will fall into evil rebirths. If they obtain human bodies with short life spans and many illnesses, they will be born in the homes of the poor and wretched, with scarce food and clothing but suffering from hunger, thirst, cold, heat, hunger, thirst, and other pains.",
        "source": "T14n0451_001:0411c26_0"
    },
    {
        "source_sentence": "身無光色，所感眷屬，皆不賢良；",
        "translation": "Their bodies lack light and form. All the attendants they receive are not good or good at all.",
        "source": "T14n0451_001:0411c27_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，由是力故，隨所願求，飲食、衣服悉皆充足，如彼諸天，",
        "translation": "If they hear my name, they wholeheartedly cherish it. Because of this power, whatever they wish to ask for—food, drink, and clothing—they will be supplied with what they need.",
        "source": "T14n0451_001:0411c28_2"
    },
    {
        "source_sentence": "身光可愛，得善眷屬，乃至菩提。",
        "translation": "Their body's radiance is desirable, and they attain good retinues up to enlightenment.",
        "source": "T14n0451_001:0412a01_3"
    },
    {
        "source_sentence": "「第四大願：願我來世得菩提時，若有眾生，常為藥叉諸惡鬼神之所嬈亂，",
        "translation": "“The fourth great vow is that when I attain enlightenment in the future, if there are any sentient beings, I will always be disturbed by yakṣa demons and bad spirits.",
        "source": "T14n0451_001:0412a03_0"
    },
    {
        "source_sentence": "奪其精氣，受諸苦惱；",
        "translation": "They snatch their vital energy and experience various pains and distress.",
        "source": "T14n0451_001:0412a04_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，由是力故，諸藥叉等悉皆退散，各起慈心，解脫眾苦，",
        "translation": "If they hear my name, they wholeheartedly praise me. Because of this power, all the yakṣas and so forth withdrew, each developing a compassionate mind to liberate themselves from all suffering.",
        "source": "T14n0451_001:0412a05_2"
    },
    {
        "source_sentence": "乃至菩提。",
        "translation": "Up to enlightenment.",
        "source": "T14n0451_001:0412a07_0"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0412a08_0"
    },
    {
        "source_sentence": "是為彼佛、如來、應、正等覺，所發四種微妙大願。",
        "translation": "These are the four subtle great vows that those buddhas, tathāgatas, arhats, and fully awakened ones give rise to.",
        "source": "T14n0451_001:0412a08_1"
    },
    {
        "source_sentence": "若有眾生，聞彼佛名，晝夜六時，稱名禮敬，至心供養，於眾生處起慈悲心，",
        "translation": "If there are any sentient beings who hear the names of those buddhas, call them by name at six o’clock during the day and night, venerate them, wholeheartedly offer them support, and develop a compassionate mind of kindness and pity toward sentient beings.",
        "source": "T14n0451_001:0412a09_2"
    },
    {
        "source_sentence": "業障消滅，解脫憂苦，無病長壽，得宿命智，於諸佛土，蓮花化生，常為諸天之所衛護。",
        "translation": "When the karmic hindrances cease, they're liberated from sorrow and suffering, have no illness or long life, attain knowledge of past lives, and are born in the buddha-lands like lotus flowers transformed into sentient beings who are always guarded by gods.",
        "source": "T14n0451_001:0412a11_3"
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0412a13_4"
    },
    {
        "source_sentence": "稱彼佛名，能生如是無量福業，而彼佛土願力莊嚴、殊勝功德，聲聞、獨覺所不能知，",
        "translation": "They call the name of that buddha and are able to produce such measureless meritorious actions, yet those buddha-lands are adorned with the power of vows and extraordinary virtues that śrāvakas and solitary realizers cannot know.",
        "source": "T14n0451_001:0412a13_5"
    },
    {
        "source_sentence": "唯除如來、應、正等覺。",
        "translation": "It's only except for the Tathāgata, Arhat, and Perfectly Enlightened One.",
        "source": "T14n0451_001:0412a15_6"
    },
    {
        "source_sentence": "「復次，曼殊室利！",
        "translation": "Furthermore, Mañjuśrī!",
        "source": "T14n0451_001:0412a16_0"
    },
    {
        "source_sentence": "東方去此，過八殑伽河沙佛土，有世界名曰法幢，佛號法海雷音如來、應、正等覺，",
        "translation": "“To the east of here, past as many buddha-lands as there are grains of sand in eight Ganges Rivers, is a world called Dharma Banner.",
        "source": "T14n0451_001:0412a16_1"
    },
    {
        "source_sentence": "今現說法。",
        "translation": "Now, he's teaching the Dharma.",
        "source": "T14n0451_001:0412a18_2"
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0412a18_3"
    },
    {
        "source_sentence": "彼佛世尊所居國土，清淨無穢，其地平正，頗梨所成，常有光明，香氣芬馥；",
        "translation": "The land where the Buddha, the World-honored One, resided was pure and spotless. The ground there was even and level, made of crystal; it always emitted light and had a fragrant odor.",
        "source": "T14n0451_001:0412a18_4"
    },
    {
        "source_sentence": "以帝青寶而為城郭，有八街道砌以金銀，樓閣殿堂、飛甍戶牖、欄楯莊飾，",
        "translation": "The eight streets were built of gold and silver, adorned with pavilions, halls, flying windows, doors, walls, and railings.",
        "source": "T14n0451_001:0412a20_5"
    },
    {
        "source_sentence": "皆眾寶成；",
        "translation": "They are all made of myriad jewels.",
        "source": "T14n0451_001:0412a22_6"
    },
    {
        "source_sentence": "天香寶樹隨處行列，於其枝上，挂以天繒，復有寶鈴處處垂下，微風吹動，",
        "translation": "The trees of divine fragrance and jewels stood in rows on each other’s branches, with celestial garlands hanging from their tops. There were also precious bells that sounded everywhere as a gentle breeze blew.",
        "source": "T14n0451_001:0412a22_7"
    },
    {
        "source_sentence": "出妙音聲，演暢無常、苦、空、無我，眾生聞者，捨離欲纏，習氣漸除，",
        "translation": "It produces a wondrous sound that speaks of impermanence, suffering, emptiness, and selflessness. All sentient beings who hear it will be freed from the bondage of desire and their habit energy will gradually be eliminated.",
        "source": "T14n0451_001:0412a24_8"
    },
    {
        "source_sentence": "證甚深定；",
        "translation": "They attain profound concentration.",
        "source": "T14n0451_001:0412a25_9"
    },
    {
        "source_sentence": "天妙香花，繽紛而下；",
        "translation": "The heavenly flowers of exquisite fragrance flowed down like clouds.",
        "source": "T14n0451_001:0412a25_10"
    },
    {
        "source_sentence": "於其四面，有八浴池，底布金沙，香水彌滿。",
        "translation": "On each of the four sides were eight bathing ponds, all covered with golden sand and covered with fragrant water.",
        "source": "T14n0451_001:0412a26_11"
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0412a27_12"
    },
    {
        "source_sentence": "於彼佛土無諸惡趣，亦無女人，蓮花化生，無復煩惱。",
        "translation": "In that Buddha land, there are no bad destinies and no women, and the lotus flower is transformed into a sentient being who has no more afflictions.",
        "source": "T14n0451_001:0412a27_13"
    },
    {
        "source_sentence": "「彼佛如來行菩薩道時，發四大願。",
        "translation": "When the Buddha Tathāgata practices the bodhisattva path, he gives rise to the four great vows.",
        "source": "T14n0451_001:0412a28_14"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T14n0451_001:0412a29_15"
    },
    {
        "source_sentence": "「第一大願：願我來世得菩提時，若有眾生，生邪見家，於佛、法、僧不生淨信，",
        "translation": "“The first great vow: May I attain enlightenment in the future, if there are any sentient beings who give rise to wrong views and don’t have pure faith in the Buddha, Dharma, or Sangha.",
        "source": "T14n0451_001:0412b01_0"
    },
    {
        "source_sentence": "遠離無上菩提之心；",
        "translation": "They are far removed from the thought of unexcelled enlightenment.",
        "source": "T14n0451_001:0412b02_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，由是力故，無明、邪慧日夜消滅，於三寶所深生正信，",
        "translation": "If they hear my name and wholeheartedly praise it, their ignorance and wrong wisdom will be extinguished day and night by this power, and right faith will arise in the Three Treasures.",
        "source": "T14n0451_001:0412b03_2"
    },
    {
        "source_sentence": "不復退轉，乃至菩提。",
        "translation": "They don't regress again, even up to enlightenment.",
        "source": "T14n0451_001:0412b05_0"
    },
    {
        "source_sentence": "「第二大願：願我來世得菩提時，若有眾生，生在邊地，由近惡友，造眾罪業，",
        "translation": "“Second great vow: May I attain enlightenment in the future when there are sentient beings born in a marginal land who commit numerous sins by associating with bad companions.",
        "source": "T14n0451_001:0412b06_0"
    },
    {
        "source_sentence": "不修善品，三寶名字曾不經耳，命終之後墮三惡趣；",
        "translation": "They do not cultivate good qualities and never recite the names of the Three Treasures. After death, they will fall into the three evil destinies.",
        "source": "T14n0451_001:0412b07_1"
    },
    {
        "source_sentence": "彼諸眾生，暫聞我名者，由是力故，業障消除，遇善知識，不墮惡趣，",
        "translation": "Those sentient beings who hear my name momentarily will, through their power, remove the karmic hindrances, meet a good teacher, and not fall into evil.",
        "source": "T14n0451_001:0412b09_2"
    },
    {
        "source_sentence": "乃至菩提。",
        "translation": "Up to enlightenment.",
        "source": "T14n0451_001:0412b10_3"
    },
    {
        "source_sentence": "「第三大願：願我來世得菩提時，若有眾生，衣服、飲食、臥具、醫藥，",
        "translation": "“Third great vow: May I attain enlightenment in a future life if there are sentient beings who provide clothing, food, drink, bedding, and medicine.",
        "source": "T14n0451_001:0412b11_0"
    },
    {
        "source_sentence": "資生所須，悉皆乏少，由此因緣，生大憂苦，為求覓故，造眾惡業；",
        "translation": "Because of these causes and conditions, great sorrow and suffering arise. They commit various evil deeds for the sake of seeking [the truth].",
        "source": "T14n0451_001:0412b12_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，由是力故，有所乏少，隨念皆得，乃至菩提。",
        "translation": "If someone hears my name and wholeheartedly praises it, there's nothing lacking because of that power, and whatever they think about it, they'll attain enlightenment.",
        "source": "T14n0451_001:0412b13_2"
    },
    {
        "source_sentence": "「第四大願：願我來世得菩提時，若有眾生，由先惡業，共相鬪諍，作不饒益，",
        "translation": "“The fourth great vow is that when I attain enlightenment in a future life, if there are sentient beings who, because of their past bad actions, fought with each other and did unbeneficial things,",
        "source": "T14n0451_001:0412b16_0"
    },
    {
        "source_sentence": "弓箭刀杖，互為傷損；",
        "translation": "Bounds, arrows, swords, and sticks inflict harm on each other.",
        "source": "T14n0451_001:0412b17_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，由是力故，各起慈心，不相損害，不善之念尚自不生，",
        "translation": "If they hear my name, they wholeheartedly praise and think of me. Because of this power, each gives rise to a mind of kindness that doesn’t harm others; bad thoughts don’t arise in themselves.",
        "source": "T14n0451_001:0412b18_2"
    },
    {
        "source_sentence": "況於前人欲斷其命？",
        "translation": "How much more so when the person before him wants to cut off his life?",
        "source": "T14n0451_001:0412b20_0"
    },
    {
        "source_sentence": "常行喜捨，乃至菩提。",
        "translation": "He always practices joy and equanimity, up to enlightenment.",
        "source": "T14n0451_001:0412b20_1"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0412b22_0"
    },
    {
        "source_sentence": "是為彼佛、如來、應、正等覺，行菩薩道時，所發四種微妙大願。",
        "translation": "These are the four subtle great vows that those buddhas, tathāgatas, arhats, and fully awakened ones make when they practice the bodhisattva path.",
        "source": "T14n0451_001:0412b22_1"
    },
    {
        "source_sentence": "若有淨信男子、女人，聞彼佛名，至心禮敬、慇懃供養、受持念誦，業障消滅，",
        "translation": "If there are purely faithful men and women who hear the names of those buddhas, wholeheartedly venerate them, make offerings to them with affection, and memorize and recite them, the karmic hindrances will cease.",
        "source": "T14n0451_001:0412b23_2"
    },
    {
        "source_sentence": "得不退轉菩提之心，具宿命智，所生之處常得見佛，無病長壽，命終之後生彼國中，",
        "translation": "They attain the determination for unregressing enlightenment and are imbued with knowledge of past lives. Wherever they are born, they always see buddhas. They will be free from illness and have a long life span. When their life ends, they will be reborn in that other land.",
        "source": "T14n0451_001:0412b25_3"
    },
    {
        "source_sentence": "衣服、飲食、資生之具，隨念皆至，無所乏少。",
        "translation": "His clothes, food and drink, as well as the necessities for daily life, were provided at his convenience. There was nothing to lack.",
        "source": "T14n0451_001:0412b27_4"
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0412b28_5"
    },
    {
        "source_sentence": "彼佛世尊具足如是無量功德，是故眾生常當憶念，勿令忘失。",
        "translation": "That Buddha Bhagavān possesses such measureless merit, so sentient beings should always remember it and not forget it.",
        "source": "T14n0451_001:0412b28_6"
    },
    {
        "source_sentence": "「復次，曼殊室利！",
        "translation": "Furthermore, Mañjuśrī!",
        "source": "T14n0451_001:0412c01_0"
    },
    {
        "source_sentence": "東方去此，過九殑伽河沙佛土，有世界名曰善住寶海，佛號法海勝慧遊戲神通如來、應、正等覺，",
        "translation": "To the east of here, past a buddha land as numerous as the grains of sand in nine Ganges Rivers, is a world called “well-abiding ocean of jewels.” The Buddha there is called Supreme Wisdom and Mystic Freedom Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T14n0451_001:0412c01_1"
    },
    {
        "source_sentence": "現在說法。",
        "translation": "Now, he teaches the Dharma.",
        "source": "T14n0451_001:0412c03_2"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0412c03_3"
    },
    {
        "source_sentence": "彼佛如來行菩薩道時，發四大願。",
        "translation": "When the Buddha Tathāgata practices the bodhisattva path, he gives rise to the four great vows.",
        "source": "T14n0451_001:0412c04_4"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T14n0451_001:0412c04_5"
    },
    {
        "source_sentence": "「第一大願：願我來世得菩提時，若有眾生，造眾惡業，種植耕耘，損諸生命，",
        "translation": "“The first great vow: May I attain enlightenment in a future lifetime if there are sentient beings who do all kinds of evil deeds, planting and plowing, harming living beings.",
        "source": "T14n0451_001:0412c06_0"
    },
    {
        "source_sentence": "或復興易，欺誑他人，戰陣兵戈，常為殺害；",
        "translation": "Or they may reestablish peace and deceive others. They are always killed by soldiers in battle.",
        "source": "T14n0451_001:0412c07_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，由是力故，資生之具，不假營求，隨心滿足，常修眾善，",
        "translation": "If they hear my name, they wholeheartedly praise and think of me. Because of this power, they obtain the necessities for daily life without depending on anything to ask for. Fulfilling them according to their wishes, they always cultivate all goodness.",
        "source": "T14n0451_001:0412c08_2"
    },
    {
        "source_sentence": "乃至菩提。",
        "translation": "Up to enlightenment.",
        "source": "T14n0451_001:0412c10_3"
    },
    {
        "source_sentence": "「第二大願：願我來世得菩提時，若有眾生，造十惡業，殺生等罪，由此因緣，",
        "translation": "“Second great vow: May I attain enlightenment in a future life when sentient beings commit the ten evil deeds and sins of killing, etc.",
        "source": "T14n0451_001:0412c11_0"
    },
    {
        "source_sentence": "當墮地獄；",
        "translation": "They will fall into hell.",
        "source": "T14n0451_001:0412c12_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，於十善道皆得成就，不墮惡趣，乃至菩提。",
        "translation": "If they hear my name and wholeheartedly praise it, they'll all attain the accomplishment of the ten good paths and won't fall into bad destinies or even enlightenment.",
        "source": "T14n0451_001:0412c13_0"
    },
    {
        "source_sentence": "「第三大願：願我來世得菩提時，若有眾生，不得自在，繫屬於他，或被禁繫，",
        "translation": "“Third great vow: May I attain enlightenment in the future, so that if there are sentient beings who don’t have freedom and are bound to others or are bound by fetters,",
        "source": "T14n0451_001:0412c15_0"
    },
    {
        "source_sentence": "杻械枷鎖，鞭杖苦楚，乃至極刑；",
        "translation": "They are beaten, chained, flogged, whipped, caned, and tortured until they are executed.",
        "source": "T14n0451_001:0412c16_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，由是力故，所有厄難皆得解脫，乃至菩提。",
        "translation": "If someone hears my name and wholeheartedly praises it, they'll be liberated from all their difficulties and attain enlightenment because of this power.",
        "source": "T14n0451_001:0412c17_2"
    },
    {
        "source_sentence": "「第四大願：願我來世得菩提時，若有眾生，造眾惡業，不信三寶，隨虛妄見，",
        "translation": "“Fourth great vow: May I attain enlightenment in the future, if there are any sentient beings who commit all kinds of evil deeds, don’t believe in the Three Treasures, follow false views,",
        "source": "T14n0451_001:0412c20_0"
    },
    {
        "source_sentence": "棄背正理，愛樂邪徒，謗毀佛經，言非聖說，外道典籍，恭敬受持，自作教人，",
        "translation": "They reject the right doctrine, delight in heretics, and revile against the scriptures of the Buddha. They speak what is not taught by the holy ones; they hold to non-Buddhist texts with reverence and veneration, teaching them for themselves.",
        "source": "T14n0451_001:0412c21_1"
    },
    {
        "source_sentence": "俱生迷惑，當墮地獄，無有出期，設得為人，生八難處，遠離正道，盲無慧目；",
        "translation": "If you become a human being, you will be born in one of the eight difficult places. You will be far removed from the right path and blinded by the eye of wisdom.",
        "source": "T14n0451_001:0412c23_2"
    },
    {
        "source_sentence": "如是之人，若聞我名，至心稱念，由是力故，臨命終時，正念現前，解脫眾難，",
        "translation": "If someone like this hears my name, they wholeheartedly praise it. Because of their power, right mindfulness appears before them at the time of their death and liberates them from all difficulties.",
        "source": "T14n0451_001:0412c25_3"
    },
    {
        "source_sentence": "常生中國，受勝妙樂，乃至菩提。",
        "translation": "They are always born in China and experience supreme bliss up to enlightenment.",
        "source": "T14n0451_001:0412c27_4"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0412c28_0"
    },
    {
        "source_sentence": "是為彼佛、如來、應、正等覺，行菩薩道時，所發四種微妙大願。",
        "translation": "These are the four subtle great vows that those buddhas, tathāgatas, arhats, and fully awakened ones make when they practice the bodhisattva path.",
        "source": "T14n0451_001:0412c28_1"
    },
    {
        "source_sentence": "曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0412c29_2"
    },
    {
        "source_sentence": "彼佛國土，功德莊嚴，與上妙寶如來世界等無有異。",
        "translation": "That buddha land, adorned with merit, is no different from the world of the supremely marvelous treasured tathāgata.",
        "source": "T14n0451_001:0412c29_3"
    },
    {
        "source_sentence": "「復次，曼殊室利！",
        "translation": "Furthermore, Mañjuśrī!",
        "source": "T14n0451_001:0413a03_0"
    },
    {
        "source_sentence": "東方去此，過十殑伽河沙佛土，有世界名淨琉璃，佛號藥師琉璃光如來、應、正等覺。",
        "translation": "To the east of here, past a buddha land as numerous as the number of grains of sand in ten Ganges Rivers, is a world called Pure Lapis Lazuli. The Buddha there is called Healing Master Lapis Lazuli Light Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T14n0451_001:0413a03_1"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0413a05_2"
    },
    {
        "source_sentence": "彼佛世尊，從初發心行菩薩道時，發十二大願。",
        "translation": "Bhagavān, that Buddha arouses twelve great vows from the time he first arouses his mind and practices the bodhisattva path.",
        "source": "T14n0451_001:0413a05_3"
    },
    {
        "source_sentence": "云何十二？",
        "translation": "What are these twelve?",
        "source": "T14n0451_001:0413a06_4"
    },
    {
        "source_sentence": "「第一大願：願我來世得菩提時，自身光明照無邊界，三十二相、八十隨好，",
        "translation": "“The first great vow: When I attain enlightenment in a future life, may my own light illumine the boundless realm with its thirty-two marks and eighty secondary signs.",
        "source": "T14n0451_001:0413a07_0"
    },
    {
        "source_sentence": "莊嚴其身，令諸有情如我無異。",
        "translation": "They adorn their bodies so that sentient beings are no different from me.",
        "source": "T14n0451_001:0413a08_1"
    },
    {
        "source_sentence": "「第二大願：願我來世得菩提時，身如琉璃，內外清徹，光明廣大，遍滿諸方，",
        "translation": "“Second great vow: When I attain enlightenment in the future, may my body be like lapis lazuli, clear and penetrating inside and out, with vast light pervading all directions.",
        "source": "T14n0451_001:0413a10_0"
    },
    {
        "source_sentence": "焰網莊嚴，過於日月，鐵圍中間，幽冥之處，互得相見，或於此界，闇夜遊行，",
        "translation": "They are surpassed by the sun and moon in their arrays of webs of flames. Surrounded by iron walls, they may see each other in a dark place or travel about in this world at night.",
        "source": "T14n0451_001:0413a11_1"
    },
    {
        "source_sentence": "斯等眾生見我光明，悉蒙開曉，隨作眾事。",
        "translation": "All of these sentient beings saw my light and were all enlightened, doing whatever they wished.",
        "source": "T14n0451_001:0413a13_2"
    },
    {
        "source_sentence": "「第三大願：願我來世得菩提時，以無量無邊智慧方便，令諸有情所受用物，",
        "translation": "“Third great vow: When I attain enlightenment in the future, may I use measureless and boundless knowledge and skillful means to cause sentient beings to enjoy things.",
        "source": "T14n0451_001:0413a15_0"
    },
    {
        "source_sentence": "皆得無盡。",
        "translation": "They all attain inexhaustibility.",
        "source": "T14n0451_001:0413a16_1"
    },
    {
        "source_sentence": "「第四大願：願我來世得菩提時，若諸有情，行邪道者，悉令遊履菩提正路，",
        "translation": "“Fourth great vow: May I attain enlightenment in the future, and may all sentient beings who follow wrong paths be led along the right path of enlightenment.",
        "source": "T14n0451_001:0413a17_0"
    },
    {
        "source_sentence": "若行聲聞、獨覺乘者，亦令安住大乘法中。",
        "translation": "If someone practices the vehicle of śrāvakas and pratyekbuddhas, they'll also be made to abide in the great vehicle teaching.",
        "source": "T14n0451_001:0413a18_1"
    },
    {
        "source_sentence": "「第五大願：願我來世得菩提時，若諸有情，於我法中修行梵行，一切皆令得不缺戒，",
        "translation": "“Fifth great vow: When I attain enlightenment in a future life, may all sentient beings cultivate religious practice in my teaching and cause them to attain the precepts without fail.",
        "source": "T14n0451_001:0413a20_0"
    },
    {
        "source_sentence": "善防三業，無有毀犯、墮惡趣者。",
        "translation": "He well guards against the three actions, and there's no violation or falling into a bad destiny.",
        "source": "T14n0451_001:0413a22_0"
    },
    {
        "source_sentence": "設有毀犯，聞我名已，專念受持，至心發露，還得清淨，乃至菩提。",
        "translation": "If someone commits an offense, they hear my name, concentrate on it, memorize it, sincerely disclose it, and then attain purity and even enlightenment.",
        "source": "T14n0451_001:0413a22_1"
    },
    {
        "source_sentence": "「第六大願：願我來世得菩提時，若諸有情，諸根不具、醜陋頑痹、聾盲瘖瘂、攣躄背僂、白癩瘨狂，",
        "translation": "“The sixth great vow: May I attain enlightenment in a future life if all sentient beings lack the faculties, are ugly and stubborn, are deaf and dumb, suffer from abscesses and back pain, and go crazy with white scabies.",
        "source": "T14n0451_001:0413a25_0"
    },
    {
        "source_sentence": "種種病苦之所纏逼；",
        "translation": "They are tormented by various diseases and afflictions.",
        "source": "T14n0451_001:0413a27_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，皆得端嚴，眾病除愈。",
        "translation": "If anyone hears my name and wholeheartedly praises it, they'll all attain dignity, and their illnesses will be healed.",
        "source": "T14n0451_001:0413a27_2"
    },
    {
        "source_sentence": "「第七大願：願我來世得菩提時，若諸有情，貧窮困苦，無有歸趣，眾病所逼，",
        "translation": "“The seventh great vow is that when I attain enlightenment in the future, if all sentient beings are poor and suffering, have no destination of refuge, and are oppressed by various illnesses,",
        "source": "T14n0451_001:0413a29_0"
    },
    {
        "source_sentence": "無藥無醫；",
        "translation": "There is no medicine and no physician.",
        "source": "T14n0451_001:0413b01_1"
    },
    {
        "source_sentence": "暫聞我名，眾病消散，眷屬增盛，資財無乏，身心安樂，乃至菩提。",
        "translation": "If you hear my name for a moment, all your illnesses will disappear and your retinues will grow in prosperity. You will have no lack of provisions or possessions, and you will be well-being with body and mind until you attain enlightenment.",
        "source": "T14n0451_001:0413b02_0"
    },
    {
        "source_sentence": "「第八大願：願我來世得菩提時，若有女人，為女眾苦之所逼切，極生厭離，",
        "translation": "“Eighth great vow: May I attain enlightenment in a future life if there is a woman who is oppressed by the sufferings of women and becomes utterly disillusioned.",
        "source": "T14n0451_001:0413b04_0"
    },
    {
        "source_sentence": "願捨女身；",
        "translation": "I vow to give up the body of a woman.",
        "source": "T14n0451_001:0413b05_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，即於現身，轉成男子，具丈夫相，乃至菩提。",
        "translation": "If someone hears my name and wholeheartedly praises it, they'll instantly become a man in their present body, possessing the characteristics of a man, up to enlightenment.",
        "source": "T14n0451_001:0413b06_0"
    },
    {
        "source_sentence": "「第九大願：願我來世得菩提時，令諸有情出魔羂網，復有種種邪見之徒，",
        "translation": "“The ninth great vow is that when I attain enlightenment in a future life, I will cause sentient beings to leave the web of Māra’s wickedness, and there will also be people with various wrong views.",
        "source": "T14n0451_001:0413b08_0"
    },
    {
        "source_sentence": "皆當攝受，令生正見，漸令修習諸菩薩行，乃至菩提。",
        "translation": "They should all be collected and made to give rise to right view, gradually cultivating the bodhisattva practices until they reach enlightenment.",
        "source": "T14n0451_001:0413b09_1"
    },
    {
        "source_sentence": "「第十大願：願我來世得菩提時，若諸有情，王法所拘，幽禁牢獄，枷鎖鞭撻，",
        "translation": "Tenth great vow: May I attain enlightenment in a future life when all sentient beings are imprisoned by the king’s law, locked up and whipped into jail,",
        "source": "T14n0451_001:0413b12_0"
    },
    {
        "source_sentence": "乃至極刑，復有眾多苦楚之事，逼切憂惱，無暫樂時；",
        "translation": "Even the most cruel punishment is accompanied by many other painful and distressing conditions, such as oppressive feelings of grief and sorrow that do not last for a moment.",
        "source": "T14n0451_001:0413b13_1"
    },
    {
        "source_sentence": "若聞我名，以我福德威神力故，皆得解脫一切憂苦，乃至菩提。",
        "translation": "If someone hears my name, they'll all be liberated from all sorrow and suffering up to enlightenment because of the authoritative power of my virtue.",
        "source": "T14n0451_001:0413b14_2"
    },
    {
        "source_sentence": "「第十一大願：願我來世得菩提時，若諸有情，飢火所惱，為求食故，",
        "translation": "“The eleventh great vow is that when I attain enlightenment in a future life, if sentient beings are tormented by hunger and fire and seek food,",
        "source": "T14n0451_001:0413b17_0"
    },
    {
        "source_sentence": "造諸惡業；",
        "translation": "They commit evil deeds.",
        "source": "T14n0451_001:0413b18_1"
    },
    {
        "source_sentence": "若聞我名，至心稱念，我當先以上妙飲食，隨意飽滿，後以法味，令住勝樂，",
        "translation": "If you hear my name and wholeheartedly praise it, I will first give you this wonderful food and drink to satisfy you as you wish. Later, with the flavor of the Dharma, I will make you abide in supreme bliss.",
        "source": "T14n0451_001:0413b18_2"
    },
    {
        "source_sentence": "乃至菩提。",
        "translation": "Up to enlightenment.",
        "source": "T14n0451_001:0413b20_3"
    },
    {
        "source_sentence": "「第十二大願：願我來世得菩提時，若諸有情，身無衣服，蚊虻、寒熱之所逼惱；",
        "translation": "“The twelfth great vow is that when I attain enlightenment in a future life, all sentient beings will have no clothes on their bodies and be tormented by gnats, gadflies, or cold and heat.",
        "source": "T14n0451_001:0413b21_0"
    },
    {
        "source_sentence": "若聞我名，至心稱念，隨其所好，即得種種上妙衣服、寶莊嚴具、伎樂香華，",
        "translation": "If they hear my name and wholeheartedly praise it, according to their desires they’ll attain various kinds of exquisite clothing, jewel ornaments, music, incense, and flowers.",
        "source": "T14n0451_001:0413b22_1"
    },
    {
        "source_sentence": "皆令滿足，離諸苦惱，乃至菩提。",
        "translation": "They all cause them to be fulfilled, part with suffering and distress, up to enlightenment.",
        "source": "T14n0451_001:0413b24_2"
    },
    {
        "source_sentence": "「曼殊室利！",
        "translation": "Mañjuśrī!",
        "source": "T14n0451_001:0413b26_0"
    },
    {
        "source_sentence": "是為藥師瑠璃光如來、應、正等覺，行菩薩道時，所發十二微妙上願。」",
        "translation": "These are the twelve subtle and supreme vows that the Medicine Buddha's Lapis Lazuli Radiance Tathāgata, Arhat, and Completely Awakened One make when they practice the bodhisattva path.",
        "source": "T14n0451_001:0413b26_1"
    },
    {
        "source_sentence": "藥師琉璃光七佛本願功德經卷上",
        "translation": "Yaoshi liuzhi guanqifo benyuan gongde jing",
        "source": "T14n0451_001:0413b28_0"
    }
]