[
    {
        "source_sentence": "佛說光明童子因緣經卷第二",
        "translation": "Foshuo fongguangming gongzi yining jing, vol. 2",
        "source": "T14n0549_002:0857a10_0"
    },
    {
        "source_sentence": "西天譯經三藏朝奉大",
        "translation": "translated scriptures from the Western Heaven into Chinese by the Tripiṭaka Master Samzang朝奉大",
        "source": "T14n0549_002:0857a12_0"
    },
    {
        "source_sentence": "夫試光祿卿傳法大師",
        "translation": "Fu xiang luqing zhuanfa dashi",
        "source": "T14n0549_002:0857a13_0"
    },
    {
        "source_sentence": "賜紫臣施護奉詔　譯",
        "translation": "Translated by the imperial edict to bestow upon the purple minister Shi Hu",
        "source": "T14n0549_002:0857a14_0"
    },
    {
        "source_sentence": "爾時王舍城中，有二童子：一姓婆羅門；",
        "translation": "At that time in the city of Rājagṛha there were two boys, one of whom was a brahman by family name.",
        "source": "T14n0549_002:0857a15_0"
    },
    {
        "source_sentence": "一姓剎帝利，其剎帝利童子，名曰壽命。",
        "translation": "His family name was kṣatriya, and the boy named Jīvaka, who was a kṣatriya by caste, lived his whole life.",
        "source": "T14n0549_002:0857a15_1"
    },
    {
        "source_sentence": "是二童子，從王舍城出，於其路左，共為戲劇。",
        "translation": "These two boys came out of the city of Rājagṛha and played together on the left side of the road.",
        "source": "T14n0549_002:0857a16_2"
    },
    {
        "source_sentence": "彼壽命童子，久發正信；",
        "translation": "For a long time the youth of vitality had developed right faith.",
        "source": "T14n0549_002:0857a17_3"
    },
    {
        "source_sentence": "婆羅門童子，不具正信，乃謂壽命童子言：「我聞世尊先說：『善賢長者妻當生子，",
        "translation": "The Brāhmaṇa youth, not endowed with true faith, said to the boy Jīvaka, “I have heard that the World-honored One told me first:",
        "source": "T14n0549_002:0857a18_4"
    },
    {
        "source_sentence": "其後生已，家族富盛，最上吉祥，現於人中受天勝福，乃至最後，於我法中出家學道，",
        "translation": "After he was born, his family will be prosperous and most auspicious. He will now receive heavenly blessings among humans until the very last moment when he renounces household life to study the path in my religion.",
        "source": "T14n0549_002:0857a20_5"
    },
    {
        "source_sentence": "斷諸煩惱，證阿羅漢。』",
        "translation": "He stops the afflictions and realizes arhatship.'",
        "source": "T14n0549_002:0857a22_6"
    },
    {
        "source_sentence": "彼善賢妻，已趣命終，子必隨滅，長者親屬，送置尸陀林中。",
        "translation": "That wife of the good man had already passed away, and his son would surely die. The wealthy man’s kinsmen and relatives were taken to the cemetery for burial.",
        "source": "T14n0549_002:0857a22_7"
    },
    {
        "source_sentence": "我知是事，豈非世尊說妄語邪？」",
        "translation": "I know this, isn't it the Bhagavān who speaks falsely?",
        "source": "T14n0549_002:0857a24_8"
    },
    {
        "source_sentence": "「日月星宿可墜地，　　山石從地可飛空，",
        "translation": "The sun, moon, stars, and constellations can fall to the ground, mountains and stones can fly up from the ground.",
        "source": "T14n0549_002:0857a25_9"
    },
    {
        "source_sentence": "　海水淵深可令枯，　　佛語決定無虛妄。」",
        "translation": "The depth of the water in the ocean can cause it to wither, and the Buddha's words are definitely not false.",
        "source": "T14n0549_002:0857a25_9"
    },
    {
        "source_sentence": "時壽命童子，即為婆羅門童子，說伽陀曰：是時，婆羅門童子聞是伽陀已，",
        "translation": "The boy Jīvaka then said to the brahman youth, “O brāhmaṇa youth, having heard this discourse, do not you think it was a good idea for me to ask him questions?” The Brahman youth replied:",
        "source": "T14n0549_002:0857a25_9"
    },
    {
        "source_sentence": "謂壽命童子言：「汝或不信，我今同汝，往尸陀林，審觀是事。」",
        "translation": "He said to the boy Jīvaka, Perhaps you don't believe it, but now I'm the same as you, going to the cemetery to examine this matter.",
        "source": "T14n0549_002:0857a29_10"
    },
    {
        "source_sentence": "于是，世尊從王舍城，次第而行。",
        "translation": "The World-honored One then proceeded in order from the city of Rājagaha.",
        "source": "T14n0549_002:0857b02_11"
    },
    {
        "source_sentence": "彼二童子，猶在路左，共為戲劇。",
        "translation": "Those two children were still on the left side of the road, playing together.",
        "source": "T14n0549_002:0857b02_12"
    },
    {
        "source_sentence": "「希有大牟尼，　　離諸動亂相，",
        "translation": "“How rare it is that the great sage Is free of signs of agitation.",
        "source": "T14n0549_002:0857b03_13"
    },
    {
        "source_sentence": "　人天大眾俱，　　次第而圍繞；",
        "translation": "Surrounded by the great assembly of humans and gods, They follow one another in order.",
        "source": "T14n0549_002:0857b03_13"
    },
    {
        "source_sentence": "　以師子吼音，　　能破諸外論，",
        "translation": "The sound of the lion’s roar Can destroy all non-Buddhist theories.",
        "source": "T14n0549_002:0857b03_13"
    },
    {
        "source_sentence": "　善斷眾疑網，　　最上難得見。",
        "translation": "He well eliminates the web of doubt, which is difficult to see at the highest level.",
        "source": "T14n0549_002:0857b03_13"
    },
    {
        "source_sentence": "　佛往尸陀林，　　威儀相可觀，",
        "translation": "The Buddha went to the cemetery forest, Where his manner could be seen.",
        "source": "T14n0549_002:0857b03_13"
    },
    {
        "source_sentence": "　如風飄密雪，　　清冷而遍空。",
        "translation": "It's like the wind blowing dense snow, which is cool and pervades space.",
        "source": "T14n0549_002:0857b03_13"
    },
    {
        "source_sentence": "　釋迦牟尼尊！　　現光明變化，",
        "translation": "Venerable Śākyamuni manifests a ray of light that transforms,",
        "source": "T14n0549_002:0857b03_13"
    },
    {
        "source_sentence": "　剎那瞻覩者，　　隨應獲利益。」",
        "translation": "Those who look at it momentarily will receive benefits as they should.",
        "source": "T14n0549_002:0857b03_13"
    },
    {
        "source_sentence": "時壽命童子，遙見世尊大眾圍繞，以宿善根故，即說伽陀曰：爾時，摩伽陀國主頻婆娑羅王，",
        "translation": "At that time the boy Jīvaka saw the World-honored One from a distance, surrounded by an assembly of monks and nuns. Because of his past roots of goodness, he said to Kātyāyana, “At that time the",
        "source": "T14n0549_002:0857b03_13"
    },
    {
        "source_sentence": "聞「佛世尊先說：『善賢長者妻當生子，其後生已，家族富盛，最上吉祥，",
        "translation": "I have heard that the Buddha, the Bhagavat, has said first: The wife of a wealthy merchant named Sudarśana will give birth to a son. When he is born later, his family will be prosperous and most auspicious.",
        "source": "T14n0549_002:0857b13_14"
    },
    {
        "source_sentence": "現於人中受天勝福，乃至最後，於我法中出家學道，斷諸煩惱，證阿羅漢。』",
        "translation": "Now, among humans, they'll receive the supreme merit of heaven and eventually leave home to train in my teaching, end afflictions, and realize arhatship.'",
        "source": "T14n0549_002:0857b15_15"
    },
    {
        "source_sentence": "彼妻已趣命終，長者親屬，送尸陀林。",
        "translation": "When his wife died, the wealthy man’s relatives were driven to the cemetery.",
        "source": "T14n0549_002:0857b17_16"
    },
    {
        "source_sentence": "今佛世尊，與諸大眾圍繞，亦詣尸陀林中。」",
        "translation": "Now, the Bhagavān is surrounded by the crowd and going to the cemetery forest.",
        "source": "T14n0549_002:0857b17_17"
    },
    {
        "source_sentence": "王聞是已，即自思惟：「我佛世尊，若無義利，而輒不往彼尸陀林，將非善賢之妻死而復生，",
        "translation": "Having heard these words, the king thought to himself: World-honored One, I am a buddha. If there is no benefit for me, why don’t you go to that cemetery and let my wife, who is not a good man, die and be",
        "source": "T14n0549_002:0857b18_18"
    },
    {
        "source_sentence": "世尊往彼欲為施作諸利益故？",
        "translation": "Does the Bhagavān go there because he wants to work for the benefit of giving?",
        "source": "T14n0549_002:0857b21_0"
    },
    {
        "source_sentence": "我今宜應往觀是事。」",
        "translation": "Now, it's appropriate for me to go and observe these things.",
        "source": "T14n0549_002:0857b21_1"
    },
    {
        "source_sentence": "是時，頻婆娑羅王作是思惟已，即與耆舊、大臣、宮嬪、官屬圍繞而出。",
        "translation": "After he had this thought, King Bimbisāra went out surrounded by his old men, ministers, palace officials, and officials.",
        "source": "T14n0549_002:0857b22_2"
    },
    {
        "source_sentence": "王出城時，彼二童子，尚居路左，共為戲劇。",
        "translation": "When the king came out of the city, those two boys were staying on the left side of the road and playing music together.",
        "source": "T14n0549_002:0857b23_3"
    },
    {
        "source_sentence": "「最勝摩伽陀國主，　　臣佐圍繞出王城，",
        "translation": "“The supreme lord of Magadha Surrounded by his ministers, they emerged from the royal city.",
        "source": "T14n0549_002:0857b24_4"
    },
    {
        "source_sentence": "　發起決定淨信心，　　一切人眾皆歡喜。」",
        "translation": "When they give rise to a certain pure faith, all the people will rejoice.",
        "source": "T14n0549_002:0857b24_4"
    },
    {
        "source_sentence": "彼壽命童子遙見頻婆娑羅王已，即時前詣，說伽陀曰：是時，佛及一切人天大眾、頻婆娑羅王，",
        "translation": "Seeing King Bimbisara from a distance, the youthful Licchavi Vimalakīrti approached him at once and said to Gautama, “At that time the Buddha, all the devas, humans, gods, as well as King Bimbisara,",
        "source": "T14n0549_002:0857b24_4"
    },
    {
        "source_sentence": "乃至壽命童子等，咸悉至於尸陀林中。",
        "translation": "Up to the youth of Jīvaka and so forth, they all went to the cemetery.",
        "source": "T14n0549_002:0857b29_5"
    },
    {
        "source_sentence": "爾時世尊，即從口中，放淨光明，普照眾會。",
        "translation": "The Bhagavān then emanated a pure light from his mouth that shone throughout the assembly.",
        "source": "T14n0549_002:0857c02_0"
    },
    {
        "source_sentence": "時彼先占相者，外道尼乾陀等，亦在會中，覩佛世尊放光明已，即作是念：「今此沙門瞿曇，",
        "translation": "Those who had previously divined the signs, such as the non-Buddhist Nirgrantha and others, were also present in the assembly. Having seen the Bhagavān Mahāprajñāpāramitā emitting his light, they thought:",
        "source": "T14n0549_002:0857c03_0"
    },
    {
        "source_sentence": "於大眾中，現光明相，豈非善賢之子不命終邪？」",
        "translation": "Is Is Is Is Is Is Is Among the manifestation of light in the masses, isn't it the case that the son of goodness and wisdom doesn't die?",
        "source": "T14n0549_002:0857c05_0"
    },
    {
        "source_sentence": "作是念已，謂長者言：「長者！",
        "translation": "After he had this thought, he said to the elder, Elder!",
        "source": "T14n0549_002:0857c06_1"
    },
    {
        "source_sentence": "我觀沙門瞿曇現光明相，必是汝子存而不歿？」",
        "translation": "I observe the ascetic Gautama's manifestation of light, must it be that your son is alive and doesn't die?",
        "source": "T14n0549_002:0857c06_2"
    },
    {
        "source_sentence": "善賢長者白言：「我師聖者！",
        "translation": "The elder Shanxian said, My teacher, the noble one!",
        "source": "T14n0549_002:0857c07_3"
    },
    {
        "source_sentence": "此事若然，我當云何？」",
        "translation": "If this is the case, what will I do?",
        "source": "T14n0549_002:0857c08_4"
    },
    {
        "source_sentence": "外道告言：「長者！",
        "translation": "The non-Buddhist told him, Elder!",
        "source": "T14n0549_002:0857c08_5"
    },
    {
        "source_sentence": "汝子若存，當令入我法中普遍修學。」",
        "translation": "If you children exist, you will cause them to enter my teaching and cultivate it universally.",
        "source": "T14n0549_002:0857c09_6"
    },
    {
        "source_sentence": "爾時，長者將焚其妻，先已積薪，并所用物，置尸於中，舉火以焚，火焰既發，",
        "translation": "At that time, the wealthy man was about to cremate his wife. He had stored up firewood and other necessities and placed the corpse there. Then he raised a fire to burn it.",
        "source": "T14n0549_002:0857c10_7"
    },
    {
        "source_sentence": "即從臍間，漸次破裂，中出蓮華。",
        "translation": "From the space between the navel a lotus flower emerges, which gradually disintegrates one after another.",
        "source": "T14n0549_002:0857c11_8"
    },
    {
        "source_sentence": "於其華中，有一童子，端然而坐，面貌端正，色相殊異。",
        "translation": "Among the flowers there was a young boy, seated upright and handsome with distinctive features.",
        "source": "T14n0549_002:0857c12_9"
    },
    {
        "source_sentence": "是時會中無數大眾，悉覩是相，歎未曾有，諸正信者，憶佛前言誠無虛妄。",
        "translation": "At the time, there were countless people in the assembly who all admired this sign and praised it as unprecedented, and righteous believers remembered what the Buddha said before them, saying that it was really true and not false.",
        "source": "T14n0549_002:0857c13_10"
    },
    {
        "source_sentence": "時彼外道尼乾陀，觀是事已，心生苦惱，斂然而住。",
        "translation": "That non-Buddhist Nirgrantha then observed this, and his mind became sad and distressed, retreating and staying.",
        "source": "T14n0549_002:0857c15_11"
    },
    {
        "source_sentence": "爾時，世尊即告善賢長者言：「長者！",
        "translation": "It was then that the Bhagavān addressed the elder Sunetra, saying, Elder!",
        "source": "T14n0549_002:0857c17_0"
    },
    {
        "source_sentence": "汝今收此童子，護持養育。」",
        "translation": "Now, you must take this boy away to protect and nourish him.",
        "source": "T14n0549_002:0857c17_1"
    },
    {
        "source_sentence": "時外道尼乾陀，竊觀長者面相已，謂言：「長者！",
        "translation": "After the non-Buddhist Nirgrantha had secretly observed the elder's face, he said, Elder!",
        "source": "T14n0549_002:0857c18_2"
    },
    {
        "source_sentence": "焚尸火中，忽出童子，於一切事，皆不吉祥，汝今不應收歸養育。」",
        "translation": "Suddenly, a boy emerges from the burning corpse in the fire and doesn't do anything auspicious, so now you shouldn't take it back to nourish it.",
        "source": "T14n0549_002:0857c19_3"
    },
    {
        "source_sentence": "時善賢長者，即不肯受。",
        "translation": "The good and virtuous elder then refused to accept it.",
        "source": "T14n0549_002:0857c20_4"
    },
    {
        "source_sentence": "是時，佛告壽命童子言：「汝宜收此童子護持養育。」",
        "translation": "The Buddha then addressed the boy Jīvaka, saying, You should gather this boy to protect and nourish him.",
        "source": "T14n0549_002:0857c21_5"
    },
    {
        "source_sentence": "時壽命童子，先審思已，後白佛言：「於我舍中，無處容受，設得此子，",
        "translation": "After deliberating, the boy Jīvaka said to the Buddha, “There is no room in my house for you to receive this child.",
        "source": "T14n0549_002:0857c22_6"
    },
    {
        "source_sentence": "非我所宜。」",
        "translation": "It's not appropriate for me.",
        "source": "T14n0549_002:0857c24_7"
    },
    {
        "source_sentence": "時善賢妻焚燒已竟，以佛光明威神力故，火自息滅。",
        "translation": "When Shanxian's wife had been burned, the fire went out on its own because of the Buddha's radiance and authoritative power.",
        "source": "T14n0549_002:0857c24_8"
    },
    {
        "source_sentence": "於剎那間，天降細雪，自然清冷，收置餘薪，淨其焚地。",
        "translation": "In a moment, fine snow fell from the sky, which was naturally clear and cool, and he stored the remaining firewood to purify the burning place.",
        "source": "T14n0549_002:0857c25_9"
    },
    {
        "source_sentence": "是時，火中出者童子安然而住。",
        "translation": "At the time, the boy who emerged from the fire was standing calmly.",
        "source": "T14n0549_002:0857c26_10"
    },
    {
        "source_sentence": "于是，世尊普告壽命童子等言：「汝等有正信者，勿學外道邪異誑亂，",
        "translation": "Then the World-honored One said to the Licchavi Vimalakīrti and others: You who have right faith, do not study heretical doctrines.",
        "source": "T14n0549_002:0857c27_11"
    },
    {
        "source_sentence": "當住正念。」",
        "translation": "You must abide in right mindfulness.",
        "source": "T14n0549_002:0857c29_12"
    },
    {
        "source_sentence": "壽命童子白佛言：「世尊！",
        "translation": "The boy of longevity said to the Buddha, Bhagavān!",
        "source": "T14n0549_002:0857c29_13"
    },
    {
        "source_sentence": "我於王族生，亦於王族老，我身清淨，猶如牛頭妙栴檀香，等無有異，",
        "translation": "My body is as pure as the fragrance of ox-head sandalwood, no different from any other.",
        "source": "T14n0549_002:0858a01_14"
    },
    {
        "source_sentence": "我實不知外道邪異誑亂等事。」",
        "translation": "I really don't know the things that are wrong and divergent from non-Buddhist views, such as disputes and disorders.",
        "source": "T14n0549_002:0858a02_15"
    },
    {
        "source_sentence": "是時，世尊又復告彼善賢長者言：「今此童子是汝之子，汝可收歸護持養育。」",
        "translation": "The Bhagavān then again addressed the elder Sunetra, saying, Now that this boy is your child, you can take him back and protect and nourish him.",
        "source": "T14n0549_002:0858a03_16"
    },
    {
        "source_sentence": "彼善賢長者，邪見堅固，不行正道，即時又復竊觀外道尼乾陀面。",
        "translation": "That well-versed elder had a resolute wrong view and didn't follow the right path, so he immediately went on to secretly examine the face of a non-Buddhist Nirgrantha.",
        "source": "T14n0549_002:0858a05_17"
    },
    {
        "source_sentence": "彼外道言：「善賢長者！",
        "translation": "The non-Buddhist said, Good man!",
        "source": "T14n0549_002:0858a06_18"
    },
    {
        "source_sentence": "汝宜審思，今此童子，火中遺殘，大不吉祥，雖火不燒，而相豈善？",
        "translation": "Good men, you should carefully consider this. Now that the boy has been burned to death by fire, what bad omen could there be for him? Even if he is not burned by the fire, how could his appearance be good?",
        "source": "T14n0549_002:0858a07_19"
    },
    {
        "source_sentence": "汝若收歸，決定令汝家族破壞，又復於汝命不相益，及於汝身為多損惱，",
        "translation": "If you take it back, you will surely cause your family to be destroyed. Furthermore, if you do not help each other in gaining [the precepts] for the sake of your livelihood, and if you harm others with your body,",
        "source": "T14n0549_002:0858a08_20"
    },
    {
        "source_sentence": "凡所欲事，不得和合。",
        "translation": "Whatever they want, they can't be united.",
        "source": "T14n0549_002:0858a10_21"
    },
    {
        "source_sentence": "深自籌量，無宜後悔。」",
        "translation": "It's inappropriate to think deeply about it for yourself and regret it.",
        "source": "T14n0549_002:0858a10_22"
    },
    {
        "source_sentence": "長者聞外道言已，復不肯受。",
        "translation": "After hearing what the heretic said, the elder refused to accept it.",
        "source": "T14n0549_002:0858a11_23"
    },
    {
        "source_sentence": "爾時，世尊即謂頻婆娑羅王言：「大王！",
        "translation": "It was then that the Bhagavān addressed King Bimbisara, saying, Great king!",
        "source": "T14n0549_002:0858a13_0"
    },
    {
        "source_sentence": "汝今收此童子，王宮養育。」",
        "translation": "Now, you must take this boy and raise him in the king's palace.",
        "source": "T14n0549_002:0858a13_1"
    },
    {
        "source_sentence": "時頻婆娑羅王受佛教勅，即速起身曲躬伸手取其童子，普遍觀瞻已，即白佛言：「我依佛勅，",
        "translation": "The king Bimbisāra, having received the Buddha’s instruction, quickly stood up in a crooked posture and, reaching for the boy with his palms joined together, looked at him all over. He said to the Buddha:",
        "source": "T14n0549_002:0858a14_2"
    },
    {
        "source_sentence": "收歸王宮。",
        "translation": "He returned to the king's palace.",
        "source": "T14n0549_002:0858a16_3"
    },
    {
        "source_sentence": "然此童子，作何名字？",
        "translation": "What's the name of this boy?",
        "source": "T14n0549_002:0858a16_4"
    },
    {
        "source_sentence": "願佛世尊，善為安立。」",
        "translation": "May the Bhagavān be well established for them.",
        "source": "T14n0549_002:0858a17_5"
    },
    {
        "source_sentence": "佛言：「大王！",
        "translation": "The Buddha said, Great king!",
        "source": "T14n0549_002:0858a17_6"
    },
    {
        "source_sentence": "今此童子從火中得，應為立名號火光明。」",
        "translation": "Now that this boy has attained it from the fire, he should establish a name for him as the light of the fire.",
        "source": "T14n0549_002:0858a18_7"
    },
    {
        "source_sentence": "爾時，世尊於大眾中，以此童子，付授頻婆娑羅王已。",
        "translation": "At the time, the Bhagavān was present in the assembly, and he had given this boy to King Bimbisara.",
        "source": "T14n0549_002:0858a19_8"
    },
    {
        "source_sentence": "即時觀察審知頻婆娑羅王，及諸會眾，若體若性，心所樂欲，如其所應，",
        "translation": "He immediately observed and discerned the bodies of King Bimbisara and the assemblies, their essence and natures, mental dispositions, inclinations, and desires of all beings according to their needs.",
        "source": "T14n0549_002:0858a20_9"
    },
    {
        "source_sentence": "廣為說法。",
        "translation": "He taught the Dharma extensively for them.",
        "source": "T14n0549_002:0858a21_10"
    },
    {
        "source_sentence": "是諸會眾，得聞法已，中有多百人，發起最上清淨正信，有證須陀洹果者、有證斯陀含果者、有證阿那含果者、有證阿羅漢果者、有能進發煖位善根者、有能進發頂位善根者、有能進發忍位善根者、有發聲聞菩提心者、有發緣覺菩提心者、有發阿耨多羅三藐三菩提心者、有發歸依攝受心者、有於學句起攝受心者。",
        "translation": "In these assemblies there were many hundreds of people who had already heard the Dharma. Some of them had realized the fruit of stream entry, some had realized the fruit of once-returning, some had realized the fruit of non-returning, some had realized the",
        "source": "T14n0549_002:0858a22_11"
    },
    {
        "source_sentence": "如是會眾，以佛功德及正法力，眾和合事，隨其所應，咸得利益。",
        "translation": "Thus, the assembly of people in this assembly uses the Buddha's virtue and the power of the right teaching to harmonize with the congregation so that they can benefit according to their needs.",
        "source": "T14n0549_002:0858a29_12"
    },
    {
        "source_sentence": "爾時頻婆娑羅王，即離佛會，將此童子，還復王宮。",
        "translation": "It was then that King Bimbisāra departed from the Buddha's assembly and returned to the king's palace with this boy.",
        "source": "T14n0549_002:0858b01_13"
    },
    {
        "source_sentence": "是時大王召八宮嬪，以為八母；",
        "translation": "The great king then summoned the eight palace attendants to be his eighth mother.",
        "source": "T14n0549_002:0858b03_0"
    },
    {
        "source_sentence": "二為養母，使令恩養；",
        "translation": "The second is to provide for one’s mother by enabling her to be nursed.",
        "source": "T14n0549_002:0858b03_1"
    },
    {
        "source_sentence": "二為乳母，使令乳哺；",
        "translation": "The second is to be the nurse of milk, enabling them to give milk.",
        "source": "T14n0549_002:0858b04_2"
    },
    {
        "source_sentence": "二為淨母，使令灌浣；",
        "translation": "The second is to be a pure mother, causing them to wash and bathe.",
        "source": "T14n0549_002:0858b04_3"
    },
    {
        "source_sentence": "二為戲母，使令伴習戲翫。",
        "translation": "The second is for the sake of playful mothers, causing their companions to cultivate playfulness.",
        "source": "T14n0549_002:0858b05_4"
    },
    {
        "source_sentence": "如是王勅八母，付其童子，自乳哺中，至於成長，或乳或食，及餘所須。",
        "translation": "Thus, the king instructed his eight mothers to entrust the children to their own milk and feed them until they grew up, either by giving milk or food, and whatever else they needed.",
        "source": "T14n0549_002:0858b05_5"
    },
    {
        "source_sentence": "於晝夜中，撫憐恩育，無令闕失。",
        "translation": "Throughout the day and night, he cares for them with kindness and doesn't let them fail.",
        "source": "T14n0549_002:0858b07_6"
    },
    {
        "source_sentence": "後漸長成，如清淨池一蓮秀出，愛護存惜，其義亦然。",
        "translation": "It gradually grows and becomes larger, like a lotus flower that emerges from a pure pond. The meaning of protecting and preserving it is also the same.",
        "source": "T14n0549_002:0858b08_7"
    },
    {
        "source_sentence": "乃至後時，光明童子，有一舅氏，久持財物，出外商販，漸歷歲年，未由還復。",
        "translation": "At that time the boy Guṇaprabha had a father-in-law, who had been holding property for a long time and came out to engage in merchandising. Gradually going back and forth year after year, he could not return home.",
        "source": "T14n0549_002:0858b09_8"
    },
    {
        "source_sentence": "忽於一時，外聞人說：「我妹懷妊，佛為記說：『定當生男，其後生已，",
        "translation": "Suddenly, at one time, some people outside the city said to him, “My sister is pregnant. The Buddha predicted that a boy would certainly be born in her womb.",
        "source": "T14n0549_002:0858b11_9"
    },
    {
        "source_sentence": "家族富盛，最上吉祥，現於人中受天勝福，乃至最後，於我法中出家學道，",
        "translation": "His family was prosperous and he was the most auspicious. He manifested himself among humans to receive heavenly blessings, up to the very last moment when he renounced his householder’s life in order to follow my religious path.",
        "source": "T14n0549_002:0858b12_10"
    },
    {
        "source_sentence": "斷諸煩惱，證阿羅漢。』」",
        "translation": "He stops the afflictions and realizes arhatship.'",
        "source": "T14n0549_002:0858b14_11"
    },
    {
        "source_sentence": "時彼舅氏，聞此語已，即速聚收商販財物，涉遠齎持，還歸自舍。",
        "translation": "When that uncle heard these words, he quickly gathered his merchandise, carried it far and wide, and returned home.",
        "source": "T14n0549_002:0858b14_12"
    },
    {
        "source_sentence": "既至舍中，知妹已歿，悲號啼泣，審自思惟：「外先所聞佛記我妹定當生男，",
        "translation": "Knowing that her sister was sick, she cried in distress and thought to herself, “Someone from outside the householder’s quarters has heard that the Buddha predicted that my sister will give birth to a boy.",
        "source": "T14n0549_002:0858b16_13"
    },
    {
        "source_sentence": "乃至斷諸煩惱，證阿羅漢。",
        "translation": "He stops the afflictions and realizes arhatship.",
        "source": "T14n0549_002:0858b18_14"
    },
    {
        "source_sentence": "今妹既歿，佛虛設言，豈佛世尊亦妄說邪？」",
        "translation": "Now that my sister has been deceived, the Buddha falsely sets out to say, isn't it true that the Bhagavān is also speaking falsely?",
        "source": "T14n0549_002:0858b18_15"
    },
    {
        "source_sentence": "作是念已，即往隣家，詢問其故，謂隣人言：「我出外方商販始還，先聞人說，",
        "translation": "Having thought thus, he went to a neighbor’s house to inquire about his whereabouts. He said to the neighbor, “I am coming out from abroad for the first time to return home.” The merchant had already heard someone tell him:",
        "source": "T14n0549_002:0858b19_16"
    },
    {
        "source_sentence": "我妹懷妊，佛為記言：『定當生男，其後生已，家族富盛，最上吉祥，",
        "translation": "When my younger sister was pregnant, the Buddha predicted that a boy would surely give birth to her. After she gave birth thereafter, his family will be prosperous and most auspicious.",
        "source": "T14n0549_002:0858b21_17"
    },
    {
        "source_sentence": "現於人中受天勝福，乃至最後，於我法中出家學道，斷諸煩惱，證阿羅漢。』",
        "translation": "Now, among humans, they'll receive the supreme merit of heaven and eventually leave home to train in my teaching, end afflictions, and realize arhatship.'",
        "source": "T14n0549_002:0858b22_18"
    },
    {
        "source_sentence": "我聞是說，歡喜而歸。",
        "translation": "Having heard these words, I am delighted and return home.",
        "source": "T14n0549_002:0858b24_19"
    },
    {
        "source_sentence": "洎至家中，妹已亡歿，佛所設言，豈非虛妄？」",
        "translation": "When he arrived home, his sister had already died. Isn't it true that what the Buddha said was false?",
        "source": "T14n0549_002:0858b25_20"
    },
    {
        "source_sentence": "「星月可處地，　　山石可飛空，",
        "translation": "The stars and moons can be placed on the ground, mountains and stones can fly up into the sky.",
        "source": "T14n0549_002:0858b26_21"
    },
    {
        "source_sentence": "　大海可令枯，　　佛語誠無妄。」",
        "translation": "The great ocean can be made to wither, but the Buddha's words are true and not false.",
        "source": "T14n0549_002:0858b26_21"
    },
    {
        "source_sentence": "是時隣人，即謂舅氏，說伽陀曰：時彼隣人說伽陀已，復謂舅氏言：「世尊所說實無虛妄，",
        "translation": "The neighbors then said to their uncle, “The words of the World-honored One are true and not false.",
        "source": "T14n0549_002:0858b26_21"
    },
    {
        "source_sentence": "汝妹亡歿，然有其因。",
        "translation": "Your sister died, but there is a reason for her death.",
        "source": "T14n0549_002:0858c01_22"
    },
    {
        "source_sentence": "以善賢長者信外道言造殺害業，由殺因緣汝妹亡歿，光明童子有大威力，",
        "translation": "Because the well-versed householder believes in the words of non-Buddhists and creates harmful karma by committing killing, your sister died as a result of killing.",
        "source": "T14n0549_002:0858c01_23"
    },
    {
        "source_sentence": "火不能燒蓮華中出，而今在彼頻婆娑羅王宮中養育。」",
        "translation": "The fire couldn't burn it out of the lotus flower, but now it's in the palace of King Bimbisara's palace to nourish it.",
        "source": "T14n0549_002:0858c03_24"
    },
    {
        "source_sentence": "是時隣人，具以前事，告其舅氏。",
        "translation": "The neighbors then told their uncle's family about the events that had happened before.",
        "source": "T14n0549_002:0858c04_25"
    },
    {
        "source_sentence": "時彼舅氏，聞此語已，即還家中，謂善賢長者言：「長者所為，不依理法，",
        "translation": "Having heard these words, the uncle’s father-in-law returned home and said to the wealthy householder Sunetra, “Householder, what you are doing is not based on principle or phenomena.",
        "source": "T14n0549_002:0858c06_0"
    },
    {
        "source_sentence": "以何事故，我妹致終？",
        "translation": "What was the reason my sister died?",
        "source": "T14n0549_002:0858c07_1"
    },
    {
        "source_sentence": "然我審知我妹懷妊，汝設計謀，不全生產。",
        "translation": "But I know with certainty that my sister is pregnant, and your plan will not be completely successful.",
        "source": "T14n0549_002:0858c08_2"
    },
    {
        "source_sentence": "汝以邪見，信受外道，起殺因緣，殺害我妹。",
        "translation": "Because of your wrong view, you believe in heretical theories and give rise to the causes and conditions for killing me and my sister.",
        "source": "T14n0549_002:0858c09_3"
    },
    {
        "source_sentence": "光明童子有大威力，火不能燒，蓮華中出，今在王宮，此實非理。",
        "translation": "The boy Light had great power, but the fire couldn't burn him; he came out of the lotus flower and was now in the king's palace. This is really not true.",
        "source": "T14n0549_002:0858c10_4"
    },
    {
        "source_sentence": "汝可速詣王宮於今日中取童子歸，斯為甚善。",
        "translation": "You must quickly go to the king’s palace and bring the prince back here today. This is very good.",
        "source": "T14n0549_002:0858c11_5"
    },
    {
        "source_sentence": "若不然者，我必與汝作不和合，我即當持白灰，於街巷路陌四衢道中，",
        "translation": "If you don’t, I won’t be able to reconcile with you.",
        "source": "T14n0549_002:0858c12_6"
    },
    {
        "source_sentence": "乃至隨處，遍散其地，普令地白，使人驚異。",
        "translation": "They scattered it everywhere, whitening the ground and terrifying people.",
        "source": "T14n0549_002:0858c14_7"
    },
    {
        "source_sentence": "我當唱言：『善賢長者殺害女人，我妹先因此人壞命。",
        "translation": "I will call out, 'Sugata, the elder killed a woman, and my sister's life was destroyed by that person.",
        "source": "T14n0549_002:0858c15_8"
    },
    {
        "source_sentence": "光明童子今在王宮，王亦今時作無義利。』",
        "translation": "Now that the boy of light is in the king's palace, the king also does nothing meaningful at the present time.'",
        "source": "T14n0549_002:0858c16_9"
    },
    {
        "source_sentence": "我於隨處，必作此說，汝自籌量，無貽後恥。」",
        "translation": "Wherever I go, I'll surely say this, and you should judge for yourself so that you won't be ashamed later.",
        "source": "T14n0549_002:0858c17_10"
    },
    {
        "source_sentence": "爾時，善賢長者聞此語已，心生憂惱，作是思惟：「如舅氏說，將非實邪？",
        "translation": "After hearing these words, the elder Sunetra became sad and thought, As my uncle said, isn't that true?",
        "source": "T14n0549_002:0858c18_11"
    },
    {
        "source_sentence": "若實然者，我必懷慚。」",
        "translation": "If it's true, I'll surely harbor shame.",
        "source": "T14n0549_002:0858c19_12"
    },
    {
        "source_sentence": "作是思惟已，即詣王宮。",
        "translation": "After he had this thought, he went to the king's palace.",
        "source": "T14n0549_002:0858c20_13"
    },
    {
        "source_sentence": "既至王所，跪拜伸敬，具以前事而白王言：「大王！",
        "translation": "When he arrived at the king's place, he knelt down and bowed respectfully, explained his previous affairs, and said to the king, Great king!",
        "source": "T14n0549_002:0858c21_0"
    },
    {
        "source_sentence": "我尚輕小，王最勝上，若不與其童子，恐謗於王，願王今時與此童子。」",
        "translation": "If I don't give it to that boy, I'm afraid I'll slander the king; may the king give it to this boy now.",
        "source": "T14n0549_002:0858c22_1"
    },
    {
        "source_sentence": "王言：「長者！",
        "translation": "The king said, Elder!",
        "source": "T14n0549_002:0858c23_2"
    },
    {
        "source_sentence": "我本無心取此童子，是佛世尊付授於我，若非佛勅，我豈取邪？",
        "translation": "If it weren't for the Buddha's command, wouldn't I have taken this boy with no intention of taking him? The Bhagavān would have given him to me.",
        "source": "T14n0549_002:0858c23_3"
    },
    {
        "source_sentence": "汝若欲取此童子者，今自宜應往詣佛所，具陳斯意。」",
        "translation": "If you want to take this boy, now it's appropriate for you to go to the Buddha and explain his intentions.",
        "source": "T14n0549_002:0858c25_4"
    },
    {
        "source_sentence": "是時，善賢長者即出王宮，往詣佛所。",
        "translation": "Then the householder Shanxian came out of the royal palace and approached the Buddha.",
        "source": "T14n0549_002:0858c26_5"
    },
    {
        "source_sentence": "到已，白佛言：「我有親屬，從外來歸，彼謂我言：『光明童子今在王宮，",
        "translation": "On arriving, he said to the Buddha: I have a relative who has come back from abroad. He told me, “Your majesty, my dear friend, you are now in the king’s palace.",
        "source": "T14n0549_002:0858c27_6"
    },
    {
        "source_sentence": "於今日中，速令取歸斯為甚善。",
        "translation": "In today's world, it's very good to quickly cause them to take it back.",
        "source": "T14n0549_002:0858c28_7"
    },
    {
        "source_sentence": "若不然者，彼不和合，乃至當於四衢道中，唱言：「善賢殺害女人，我妹先因此人壞命。",
        "translation": "If they don't, they won't be united, and even if they go down the four roads, they'll say, Good man, you killed a woman because of this person who destroyed my sister's life.",
        "source": "T14n0549_002:0858c29_8"
    },
    {
        "source_sentence": "光明童子今在王宮王亦今時作無義利。」』",
        "translation": "Now that the boy of light is in the king's palace, the king also creates meaningless benefits at this time.'",
        "source": "T14n0549_002:0859a02_9"
    },
    {
        "source_sentence": "我以是事，適詣王宮，取彼童子。",
        "translation": "Because of these things, I went to the king's palace and took that boy.",
        "source": "T14n0549_002:0859a03_10"
    },
    {
        "source_sentence": "王言：『先因佛令收養。』",
        "translation": "The king said, 'First, it's because of the Buddha that he ordered them to be collected.'",
        "source": "T14n0549_002:0859a04_11"
    },
    {
        "source_sentence": "故我來此，願佛令王還我童子。」",
        "translation": "That's why I came here, and may the Buddha cause the king to return it to my boy.",
        "source": "T14n0549_002:0859a04_12"
    },
    {
        "source_sentence": "爾時世尊，知是事已，觀其善賢長者，今時若不得此童子，苦惱逼心，",
        "translation": "At that time the World-honored One, knowing this matter, observed these good and virtuous householders:",
        "source": "T14n0549_002:0859a05_13"
    },
    {
        "source_sentence": "無有是處，定當嘔血而趣命終。",
        "translation": "There's no place where he'll surely vomit blood and go to the end of his life.",
        "source": "T14n0549_002:0859a07_14"
    },
    {
        "source_sentence": "佛大慈悲，為作救護，即告尊者阿難言：「阿難！",
        "translation": "The Buddha's great compassionate compassionateness served to rescue him, and he addressed Venerable Ānanda, saying, Ānanda!",
        "source": "T14n0549_002:0859a07_15"
    },
    {
        "source_sentence": "汝可往詣頻婆娑羅王宮，如我辭曰：『佛問大王得無病不？",
        "translation": "You may go to the palace of the king Bimbisāra and follow my words, saying, 'Did the Buddha ask the great king if he had no illness?'",
        "source": "T14n0549_002:0859a08_16"
    },
    {
        "source_sentence": "今有一事，當聽佛言：「善賢長者來取光明童子，王今宜應速當授與。",
        "translation": "Now, there's one thing that you should hear the Buddha say, Good and good, the elder comes to take the boy of light, and now it's appropriate for the king to quickly give it to him.",
        "source": "T14n0549_002:0859a10_17"
    },
    {
        "source_sentence": "善賢長者若不得此童子，苦惱逼心，無有是處，定當嘔血而趣命終。」』",
        "translation": "If the well-versed elder doesn't get this boy, there's no place for him to suffer pain and oppress his mind, and he'll surely vomit blood and die.'",
        "source": "T14n0549_002:0859a11_18"
    },
    {
        "source_sentence": "王悉是事，應如佛言。」",
        "translation": "This is all a matter for the king, just as the Buddha said.",
        "source": "T14n0549_002:0859a13_19"
    },
    {
        "source_sentence": "是時，尊者阿難承佛聖旨，即時往詣頻婆娑羅王宮，到已見王，如佛辭曰：「佛問大王得無病不？",
        "translation": "At that time, in accordance with the Buddha’s holy decree, Venerable Ānanda immediately went to the palace of King Bimbisara. Having arrived there, he saw the king. As soon as the Buddha had said these words, “The Buddha",
        "source": "T14n0549_002:0859a13_20"
    },
    {
        "source_sentence": "今有一事，宜聽佛言。",
        "translation": "There is now a matter for which we should listen to the Buddha’s words.",
        "source": "T14n0549_002:0859a16_21"
    },
    {
        "source_sentence": "善賢長者來取光明童子，善賢若不得此童子，苦惱逼心，無有是處，定當嘔血而趣命終。",
        "translation": "Good friends, the wealthy man Shanxian came and took the boy Guangming. If good friends did not get this boy, they would be overcome with pain and distress; there was no place for them to die on account of vomiting blood.",
        "source": "T14n0549_002:0859a16_22"
    },
    {
        "source_sentence": "大王應悉是事，宜速付授。」",
        "translation": "The great king should do all these things, so it's advisable to quickly hand them over.",
        "source": "T14n0549_002:0859a18_23"
    },
    {
        "source_sentence": "爾時，頻婆娑羅王受佛勅已，即作是言：「大德尊者！",
        "translation": "After receiving the Buddha's command, King Bimbisara then said, Venerable!",
        "source": "T14n0549_002:0859a19_24"
    },
    {
        "source_sentence": "迴至佛所，願傳我語：『頻婆娑羅王稽首世尊足下，致敬問訊世尊，如佛教勅，",
        "translation": "“The king Bimbisāra, having saluted the World-honored One by bowing his forehead at his feet, greets and venerates him.",
        "source": "T14n0549_002:0859a20_25"
    },
    {
        "source_sentence": "我已聽受。』」",
        "translation": "I've heard and accepted it.'",
        "source": "T14n0549_002:0859a22_26"
    },
    {
        "source_sentence": "是時尊者阿難即出王宮，迴至佛所，具如王言，白佛世尊。",
        "translation": "Venerable Ānanda then left the king's palace and returned to the Buddha, told the Bhagavān what the king had said.",
        "source": "T14n0549_002:0859a22_27"
    },
    {
        "source_sentence": "時頻婆娑羅王，即速宣召善賢長者，到已謂言：「善賢！",
        "translation": "The king of Bimbisāra then quickly summoned the elder Sunetra and said, Sunetra!",
        "source": "T14n0549_002:0859a23_28"
    },
    {
        "source_sentence": "今此童子久在宮中，護持養育，八母看侍，乳哺依時，我心愛憐，過甚親子。",
        "translation": "Now this boy has been in the palace for a long time, being cared for and nurtured by his eighth mother. When she was nursing him with milk I cherished feelings of affection that surpassed those of my own parents.",
        "source": "T14n0549_002:0859a25_0"
    },
    {
        "source_sentence": "今雖佛勅還付於汝，然汝亦當體我心意，日日三時，汝自將來，我欲觀視。」",
        "translation": "Even though the Buddha has instructed you to return it to you, you must also control my mind and thoughts, and at three o'clock each day, you will come on your own; I want to see it.",
        "source": "T14n0549_002:0859a26_1"
    },
    {
        "source_sentence": "善賢長者敬受王命，即白王言：「我受王勅，敢不遵承，日日三時，將詣王所。」",
        "translation": "Respectfully obeying the king's order, the elder Sunetra said to the king, I've accepted the king's command, and I dare not follow it; I'll go to the king at three o'clock every day.",
        "source": "T14n0549_002:0859a28_2"
    },
    {
        "source_sentence": "是時，頻婆娑羅王即以眾寶妙莊嚴具，鉸飾大象，令光明童子乘此寶象，",
        "translation": "Then the king of Bimbisāra decorated the great elephant with all kinds of jewel ornaments and caused the youth Light to ride on that precious elephant.",
        "source": "T14n0549_002:0859b01_3"
    },
    {
        "source_sentence": "別勅臣佐，而令伴送至長者舍。",
        "translation": "I ordered my officials and attendants to escort me to the house of the wealthy man.",
        "source": "T14n0549_002:0859b02_4"
    },
    {
        "source_sentence": "而後長者，日日三時，送至王宮，王親觀視光明童子，凡所施作，皆如理法。",
        "translation": "The wealthy man then went to the king's palace at three o'clock each day, and the king personally observed the boy of radiance and did everything he gave according to the rules.",
        "source": "T14n0549_002:0859b03_5"
    },
    {
        "source_sentence": "乃至後時，其父善賢，趣命終已，光明童子即為家主，既嗣家業，轉復精進，",
        "translation": "At some point later, when his father Sunetra’s life came to an end, the prince Candraprabha became the head of the household. Having succeeded to the family business, he continued to make effort.",
        "source": "T14n0549_002:0859b05_6"
    },
    {
        "source_sentence": "信佛、信法、信苾芻眾，歸佛、歸法、歸苾芻眾。",
        "translation": "Believing in the Buddha, believing in the Dharma, and believing in the congregation of monks, they return to the Buddha, the Dharma, and the congregation of monks.",
        "source": "T14n0549_002:0859b07_7"
    },
    {
        "source_sentence": "其父善賢長者，於此方處，先造殺業；",
        "translation": "Their father, the wealthy householder Sunetra, had earlier committed the crime of killing in this place.",
        "source": "T14n0549_002:0859b08_8"
    },
    {
        "source_sentence": "光明長者，今為其父，修營福事，乃於自舍，常時備辦，四事豐足，承事供給四方苾芻，",
        "translation": "The wealthy householder Guṇaprabha, who was now engaged in performing meritorious deeds for the sake of his father, always kept himself supplied with four daily requisites and provided them to the bhikṣus living in the four quarters.",
        "source": "T14n0549_002:0859b09_9"
    },
    {
        "source_sentence": "乃至將來結集世尊正法藏者。",
        "translation": "It's even a way to gather the Bhagavān's true dharma store in the future.",
        "source": "T14n0549_002:0859b11_10"
    },
    {
        "source_sentence": "上首耆年，諸大聲聞，亦常供給所須供養。",
        "translation": "In the old age of Śākyamuni, the great śrāvakas always offered what they needed to make offerings.",
        "source": "T14n0549_002:0859b11_11"
    },
    {
        "source_sentence": "光明長者於王舍城，修如是等，種種福事，悉為其父，而作利益。",
        "translation": "In Rājagṛha, the wealthy householder Guṇaprabha cultivated various meritorious deeds like these in Rājagṛha, all for the benefit of his father.",
        "source": "T14n0549_002:0859b12_12"
    },
    {
        "source_sentence": "爾時，有一商客，是彼善賢長者先同商販，故舊伴侶，久在外方，商販未還，",
        "translation": "At that time, there was a merchant. That good and virtuous householder had been with the merchants and traders together for a long time. His old companion had been staying outside the country for a long time but the merchants and traders had not",
        "source": "T14n0549_002:0859b14_13"
    },
    {
        "source_sentence": "素念此人不造善業，又復聞知今已亡歿，子名光明，嗣為家主。",
        "translation": "I'm always mindful that this person doesn't create good actions, and I've also heard that he's now gone into extinction, with a son named Guangming who will be the head of his family.",
        "source": "T14n0549_002:0859b15_14"
    },
    {
        "source_sentence": "其光明長者信佛、信法、信苾芻眾，歸依三寶，如理所作。",
        "translation": "That bright elder believes in the Buddha, believes in the Dharma, and believes in the bhikṣus, relying on the Three Treasures to do so according to principle.",
        "source": "T14n0549_002:0859b17_15"
    },
    {
        "source_sentence": "時彼商客，聞是事已，傷念善賢，慶快光明長者，即以上妙牛頭旃檀之香，",
        "translation": "On hearing this, the merchant was saddened and grieved for Bhadrapāla. Hearing it, he thought to himself, “This is a wonderful ox-head sandalwood fragrance like that of the wealthy householder Prabhākaramitra",
        "source": "T14n0549_002:0859b18_16"
    },
    {
        "source_sentence": "造一大鉢，滿盛眾寶，遠從外方，遣人持來，遺彼光明長者，以為信記。",
        "translation": "He made a large bowl full of various treasures, which was filled with all kinds of jewels. From the farthest direction he sent someone to carry it and left it to the wealthy man Guṇaprabha as a legacy of faith.",
        "source": "T14n0549_002:0859b20_17"
    },
    {
        "source_sentence": "又令來人傳如是言：「所願長時記念不忘。」",
        "translation": "He also told the people who came to him to transmit it, saying, Remember what you wish for a long time and don't forget it.",
        "source": "T14n0549_002:0859b22_0"
    },
    {
        "source_sentence": "是時，光明長者即以呪句，而加護之，其呪所謂：「計那唧呬吒夜嚩(一句)　室吒夜嚩(二)　羯哩迦吒計那嚩(三)　仡哩係[怡-台+(日\\/工)]咩(四)」說此呪已，",
        "translation": "The elder Guṇaprabha then guarded him with a mantra, saying, Kauṇḍinya-kāṭika-kauṇḍinya (a phrase), Śubha-kāṭika-kauṇḍinya (2) Kaṇḍinya-kāṭika (3)",
        "source": "T14n0549_002:0859b22_1"
    },
    {
        "source_sentence": "復作是言：「如是寶鉢，若沙門、若婆羅門、若大威力諸神通者，當受此鉢，",
        "translation": "Again, he said, “Such is the precious bowl that should be accepted by renunciants, brahmins, and those who have great supernatural powers.",
        "source": "T14n0549_002:0859b27_2"
    },
    {
        "source_sentence": "如應得樂。」",
        "translation": "As it should be, they'll attain happiness.",
        "source": "T14n0549_002:0859b28_3"
    },
    {
        "source_sentence": "如是加持已，即持此鉢，出王舍城，先於路左，立一大柱，綵繪莊飾，",
        "translation": "Having thus blessed them, he took his bowl and left the city of Rājagṛha. On the left side of the road before him was a large pillar decorated with embroidered silhouetted patterns.",
        "source": "T14n0549_002:0859b29_4"
    },
    {
        "source_sentence": "上復懸鈴，置鉢於下，永為標記。",
        "translation": "On top, the bell was again hung, and the bowl was placed underneath to mark it as a sign forever.",
        "source": "T14n0549_002:0859c01_5"
    },
    {
        "source_sentence": "是時，有諸外道如彼常法，於明旦時，詣河洗浴，經由路次，見此寶鉢，",
        "translation": "At that time some heretics, in accordance with the regularity of Buddhism, went to the river for bathing at dawn on the morning after sunrise. On their way down the river they saw this precious bowl.",
        "source": "T14n0549_002:0859c02_6"
    },
    {
        "source_sentence": "即時問彼光明長者言：「長者！",
        "translation": "Immediately, he asked the elder Guangming, saying, Elder!",
        "source": "T14n0549_002:0859c04_7"
    },
    {
        "source_sentence": "汝安此鉢，當何所用？」",
        "translation": "What will you use this bowl for?",
        "source": "T14n0549_002:0859c04_8"
    },
    {
        "source_sentence": "光明長者具以元因告諸外道。",
        "translation": "The elder Guangming told the non-Buddhist monks with his original cause.",
        "source": "T14n0549_002:0859c05_9"
    },
    {
        "source_sentence": "彼外道言：「諸有清淨沙門釋子，堪受此鉢，餘無力能而堪受者。」",
        "translation": "The non-Buddhist said, There are pure ascetics and Śākyamunis who are capable of accepting this bowl, but there are others who aren't capable of accepting it.",
        "source": "T14n0549_002:0859c06_10"
    },
    {
        "source_sentence": "外道言已，隨處而散。",
        "translation": "After the non-Buddhist monks had said this, they scattered away in various places.",
        "source": "T14n0549_002:0859c07_11"
    },
    {
        "source_sentence": "乃至後有耆年大德、諸苾芻眾，入王舍城，持鉢乞食，亦於路左，見此寶鉢，",
        "translation": "Then some elderly monks and other bhikṣus entered the city of Rājagṛha to beg for food with bowls in their hands. On the left side of the road they also saw this precious almsbowl.",
        "source": "T14n0549_002:0859c08_12"
    },
    {
        "source_sentence": "即乃問彼光明長者言：「汝安此鉢，當何所用？」",
        "translation": "He then asked the elder Guṇaprabha, What will you use this bowl for?",
        "source": "T14n0549_002:0859c09_13"
    },
    {
        "source_sentence": "光明長者亦以元因，廣如前答。",
        "translation": "The householder Guṇaprabha also explains the original cause in detail as before.",
        "source": "T14n0549_002:0859c10_14"
    },
    {
        "source_sentence": "諸苾芻言：「長者！",
        "translation": "The monks said, Elder!",
        "source": "T14n0549_002:0859c11_15"
    },
    {
        "source_sentence": "今此寶鉢，非我等受，當持奉佛，即能增長善利，滅諸罪垢。」",
        "translation": "Now, this jeweled bowl isn't accepted by us; we will hold it and consecrate it to the Buddha, which will increase good benefits and extinguish the stain of sin.",
        "source": "T14n0549_002:0859c12_0"
    },
    {
        "source_sentence": "時諸苾芻如是言已，隨處而散。",
        "translation": "After they said this, the monks scattered away in various places.",
        "source": "T14n0549_002:0859c13_1"
    },
    {
        "source_sentence": "佛說光明童子因緣經卷第二",
        "translation": "Foshuo fongguangming gongzi yining jing, vol. 2",
        "source": "T14n0549_002:0859c15_0"
    }
]