[
    {
        "source_sentence": "佛說光明童子因緣經卷第四",
        "translation": "Foshuo fongguangming gongzi yining jing, vol. 4",
        "source": "T14n0549_004:0862b21_0"
    },
    {
        "source_sentence": "西天譯經三藏朝奉大",
        "translation": "translated scriptures from the Western Heaven into Chinese by the Tripiṭaka Master Samzang朝奉大",
        "source": "T14n0549_004:0862b23_0"
    },
    {
        "source_sentence": "夫試光祿卿傳法大師",
        "translation": "Fu xiang luqing zhuanfa dashi",
        "source": "T14n0549_004:0862b24_0"
    },
    {
        "source_sentence": "賜紫臣施護奉　詔譯",
        "translation": "He was given the imperial edict to bestow upon the purple minister, Shi Hufeng.",
        "source": "T14n0549_004:0862b25_0"
    },
    {
        "source_sentence": "爾時，光明長者施作種種悲愍利樂布施等事已，而不告諸眷屬親愛，潛詣佛所。",
        "translation": "After giving various kinds of compassion, pity, benefit, and joyful offerings, the elder Guṇaprabha went to the Buddha's place without telling his family members or relatives.",
        "source": "T14n0549_004:0862b26_0"
    },
    {
        "source_sentence": "到已，頭面禮世尊足，前白佛言：「世尊！",
        "translation": "When he arrived, he bowed his head and face at the Bhagavān's feet and said to the Buddha, Bhagavān!",
        "source": "T14n0549_004:0862b27_1"
    },
    {
        "source_sentence": "願佛今時施我善利，我今於佛法中，樂欲出家，受具足戒，而為苾芻，",
        "translation": "May the Buddha now bestow on me good benefits! I now wish to renounce household life, receive higher ordination, and become a bhikṣu in the buddha-dharma.",
        "source": "T14n0549_004:0862b28_2"
    },
    {
        "source_sentence": "淨修梵行。",
        "translation": "They purify the religious practice.",
        "source": "T14n0549_004:0862c01_3"
    },
    {
        "source_sentence": "願佛大慈，攝受於我。」",
        "translation": "May the Buddha's great compassion take me in.",
        "source": "T14n0549_004:0862c01_4"
    },
    {
        "source_sentence": "佛言：「善來於我法中，勤修梵行。」",
        "translation": "The Buddha said, Well come to my teaching and diligently cultivate the religious practice.",
        "source": "T14n0549_004:0862c02_5"
    },
    {
        "source_sentence": "作是言時，光明長者鬚髮自落，僧伽梨衣自然著身，成苾芻相。",
        "translation": "When he said this, the radiant elder's beard fell off on its own, and the monk's robe naturally touched his body, forming the characteristic of a monk.",
        "source": "T14n0549_004:0862c02_6"
    },
    {
        "source_sentence": "然後執持應器及淨軍，持經七晝夜，心住正念，淨修梵行，威儀可法。",
        "translation": "After seven days and nights, his mind abides in right mindfulness, he purifies the religious practice, conducts himself with deportment appropriate to the Dharma.",
        "source": "T14n0549_004:0862c04_7"
    },
    {
        "source_sentence": "如百臘者。",
        "translation": "It's like the one hundred years of age.",
        "source": "T14n0549_004:0862c06_0"
    },
    {
        "source_sentence": "佛以自著僧伽梨衣，與覆其頂，光明苾芻，諸根寂靜，一心正住。",
        "translation": "The Buddha put on his own saṃghāṭi robe and covered his head with it, shining as a bhikṣu whose faculties were quiescent and single-mindedly and correctly abiding.",
        "source": "T14n0549_004:0862c06_1"
    },
    {
        "source_sentence": "是時，空中有聲讚言：「佛於今時與滿意願。」",
        "translation": "At the time, there was a voice in the air praising him, saying, Now, the Buddha grants satisfaction to me with his vow.",
        "source": "T14n0549_004:0862c07_2"
    },
    {
        "source_sentence": "光明苾芻即復發起勤勇堅固之意，諦觀五趣，生死輪迴，動轉循環，無有窮盡。",
        "translation": "That monk of light then again arouses the resolute intention to diligently and steadfastly contemplate the five destinies, which are transmigrating in birth-and-death cycles, moving and circling without limit.",
        "source": "T14n0549_004:0862c08_3"
    },
    {
        "source_sentence": "眾生諸行，種種差別，墮生死中，唯佛正法，而能解脫。",
        "translation": "The actions of sentient beings are various and different, and only the Buddha's right teaching can liberate them from birth-and-death.",
        "source": "T14n0549_004:0862c10_4"
    },
    {
        "source_sentence": "如是觀已，見四諦法，了知生死，遠離三界貪愛之想，視諸金寶與泥土等，",
        "translation": "Having contemplated in this way, they see the teachings of the four truths and know birth and death. They are far removed from the thoughts of covetousness and craving in the three realms. They look upon all kinds of treasures, such as",
        "source": "T14n0549_004:0862c11_5"
    },
    {
        "source_sentence": "斷盡煩惱，證阿羅漢果。",
        "translation": "He stops the afflictions and realizes the fruit of arhatship.",
        "source": "T14n0549_004:0862c13_6"
    },
    {
        "source_sentence": "三明六通，悉得具足，最上無比，履空高舉，如意自在，於世名聞利養等事，",
        "translation": "They are endowed with the three knowledges and six supernatural powers. Their excellence is unsurpassed in all respects. They walk up high in the sky, freely doing as they wish. They have worldly fame, learning, profit, and other",
        "source": "T14n0549_004:0862c14_0"
    },
    {
        "source_sentence": "而悉不著，釋梵諸天，咸來供養。",
        "translation": "They all did not cling to it, and the gods Śakra and Brahma came to make offerings to them.",
        "source": "T14n0549_004:0862c15_1"
    },
    {
        "source_sentence": "是時會中諸苾芻眾，見是事已，心生疑念，俱白佛言：「世尊！",
        "translation": "Seeing this, the monks in the assembly had doubts in their minds and said to the Buddha, Bhagavān!",
        "source": "T14n0549_004:0862c16_2"
    },
    {
        "source_sentence": "今此光明苾芻，以何因緣，未出家時，現於人中，受天勝福？",
        "translation": "Now, for what reason did this bright monk who hadn't renounced home show up among humans before he left home and receive the superior merit of gods?",
        "source": "T14n0549_004:0862c17_3"
    },
    {
        "source_sentence": "入佛法中，始出家已，即能斷除一切煩惱，證阿羅漢？」",
        "translation": "After entering the Buddha's teaching and beginning to leave home, will you be able to remove all afflictions and realize arhatship?",
        "source": "T14n0549_004:0862c19_4"
    },
    {
        "source_sentence": "佛言：「諸苾芻！",
        "translation": "The Buddha said, Monks!",
        "source": "T14n0549_004:0862c20_5"
    },
    {
        "source_sentence": "此光明苾芻宿種善根，今已成熟，逮得所利，如應決定，今正是時。",
        "translation": "This bright bhikṣu lunar station has planted the roots of goodness, which have now matured and acquired their benefits as they should be determined. Now is the right time for them.",
        "source": "T14n0549_004:0862c20_6"
    },
    {
        "source_sentence": "是故光明苾芻，以宿善因緣，獲如是果。",
        "translation": "That's why the monk Guṇamukha obtained such a result because of past good causes and conditions.",
        "source": "T14n0549_004:0862c22_7"
    },
    {
        "source_sentence": "「復次，諸苾芻當知，諸業果報皆從自因所作，非外地界所成，亦非水火風界所成，",
        "translation": "“Furthermore, monks, you should know that the results of actions are all derived from their own causes; they are not created by external earth realms or by water, fire, or wind realms.",
        "source": "T14n0549_004:0862c23_0"
    },
    {
        "source_sentence": "亦非從餘蘊處界成，若善不善，皆由自業，獲諸報應。」",
        "translation": "Nor are they formed from other aggregates, fields, or realms, and whether good or bad, they all result from their own actions.",
        "source": "T14n0549_004:0862c24_1"
    },
    {
        "source_sentence": "「一切眾生所作業，　　縱經百劫亦不忘，",
        "translation": "Whatever sentient beings do, Even for a hundred eons they don’t forget.",
        "source": "T14n0549_004:0862c26_0"
    },
    {
        "source_sentence": "　因緣和合於一時，　　果報隨應自當受。」",
        "translation": "When causes and conditions are combined at one time, the result will be experienced as it should be.",
        "source": "T14n0549_004:0862c26_0"
    },
    {
        "source_sentence": "爾時，世尊為諸苾芻說伽陀曰：佛告諸苾芻：「汝等諦聽光明苾芻往昔因緣。",
        "translation": "It was then that the Bhagavān addressed the monks, saying, The Buddha told the monks, Listen attentively to the causes and conditions of the past lives of the monks of Light.",
        "source": "T14n0549_004:0862c26_0"
    },
    {
        "source_sentence": "過去九十一劫，有佛出世，號毘婆尸如來、應供、正等正覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "In the past ninety-one world ages a buddha named Vipaśyin Tathāgata, Arhat, Completely Awakened, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Unsurpassed, Tam",
        "source": "T14n0549_004:0863a01_1"
    },
    {
        "source_sentence": "其佛與六百二十萬苾芻眾，遊行到滿度摩底大國城中，安止一處。",
        "translation": "The Buddha and his six million two hundred thousand monks traveled to the great city of Pūrvavideha and settled in one place.",
        "source": "T14n0549_004:0863a03_2"
    },
    {
        "source_sentence": "彼國有王，名滿度摩，其王正信，正法治國，國土廣大，人民熾盛，安隱豐樂，",
        "translation": "In that country there was a king named Pūrṇa Maitrāyaniputra. The king believed in the correct doctrine of righteousness and ruled by law. His land was vast and his people prosperous, peaceful and well populated.",
        "source": "T14n0549_004:0863a05_3"
    },
    {
        "source_sentence": "離諸疾苦饑饉等難，亦無鬪諍怨害盜賊恐怖，人民和順，善相具足。",
        "translation": "He's free of the difficulties of illness, suffering, hunger, famine, and so forth, doesn't fight enemies or harm thieves, and his people are peaceful and compliant, fully endowed with good characteristic",
        "source": "T14n0549_004:0863a06_4"
    },
    {
        "source_sentence": "「時彼城中，有一長者，名曰積財，於法正信，其家大富，財寶無量，",
        "translation": "“In that city, there was an elderly man named Ji Cai Cai Cai, who had right faith in the Dharma. His family was very wealthy and possessed immeasurable riches.",
        "source": "T14n0549_004:0863a08_5"
    },
    {
        "source_sentence": "與毘沙門天王等無有異。",
        "translation": "It's no different from the Vaiśravaṇa and other heavenly kings.",
        "source": "T14n0549_004:0863a09_6"
    },
    {
        "source_sentence": "時彼長者，知毘婆尸如來與苾芻眾，來至城中，即自思惟：『我欲請佛及苾芻眾飲食供養，",
        "translation": "Knowing that the Tathāgata Vipaśyin and the assembly of bhikṣus were coming to the city, the wealthy merchant householder thought to himself, “I wish to invite the Buddha and the assembly of bhikṣus to make",
        "source": "T14n0549_004:0863a10_7"
    },
    {
        "source_sentence": "及就我舍安居三月。』",
        "translation": "It's the third month of my retreat at my house.'",
        "source": "T14n0549_004:0863a12_8"
    },
    {
        "source_sentence": "作是思惟已，詣彼佛所。",
        "translation": "After he had this thought, he went to that Buddha.",
        "source": "T14n0549_004:0863a13_9"
    },
    {
        "source_sentence": "到已，頭面禮佛雙足，退坐一面。",
        "translation": "On arriving, he bowed his head and feet at the Buddha’s feet and withdrew to sit off to one side.",
        "source": "T14n0549_004:0863a13_10"
    },
    {
        "source_sentence": "「時，毘婆尸佛乃為長者，如其所應，宣說法要，示教利喜。",
        "translation": "Vipaśyin Buddha then taught the essentials of the Dharma for the elderly bhikṣu as he wished, encouraging, benefiting, and delighting him.",
        "source": "T14n0549_004:0863a14_11"
    },
    {
        "source_sentence": "積財長者聞正法已，即從座起，整治衣服，合掌向佛，而白佛言：『世尊！",
        "translation": "Having heard the true teaching, the wealthy man got up from his seat, adjusted his clothes, joined his palms to the Buddha, and said to him:",
        "source": "T14n0549_004:0863a15_12"
    },
    {
        "source_sentence": "我今請佛及苾芻眾，就我舍中，飲食供養及就我舍，安居三月，一切所須供給承事，",
        "translation": "I now invite the Buddha and the assembly of bhikṣus to my monastery. They may take their seats in my monastery for three months to make offerings of food, drink, and lodging at my monastery.” The World-honor",
        "source": "T14n0549_004:0863a17_13"
    },
    {
        "source_sentence": "願佛慈悲赴我所請。』",
        "translation": "May the Buddha have mercy and compassion and go to my invitation.'",
        "source": "T14n0549_004:0863a19_14"
    },
    {
        "source_sentence": "毘婆尸佛即時默然。",
        "translation": "Vipaśyin Buddha then remained silent.",
        "source": "T14n0549_004:0863a19_15"
    },
    {
        "source_sentence": "積財長者見佛默然，知已受請心生歡喜，頭面禮足，即出佛會，還復自舍。",
        "translation": "Seeing that the Buddha remained silent, the wealthy householder Jīvaka was delighted to receive the invitation. Having honored him by bowing his forehead at his feet, he left the assembly and returned home.",
        "source": "T14n0549_004:0863a20_16"
    },
    {
        "source_sentence": "「是時，滿度摩王聞毘婆尸佛與六百二十萬苾芻眾，遊行到此國城之中，",
        "translation": "“At that time King Pūrṇamukha heard that Vipaśyin Buddha and six million two hundred thousand bhikṣus, accompanied by sixty million bhikṣus, were coming to this city of Jambudvīpa.",
        "source": "T14n0549_004:0863a22_0"
    },
    {
        "source_sentence": "即作是念：『我今請佛及苾芻眾，就我宮中，飲食供養，及就我宮安居三月，",
        "translation": "Then he thought: I now invite the Buddha and the assembly of bhikṣus to come to my monastery to offer food and drink, and also to spend three months in my monastery.",
        "source": "T14n0549_004:0863a23_1"
    },
    {
        "source_sentence": "一切所須，隨應供給。』",
        "translation": "Whatever you need, make offerings as appropriate.'",
        "source": "T14n0549_004:0863a25_2"
    },
    {
        "source_sentence": "作是念已，即與臣佐官屬圍繞，詣彼佛所。",
        "translation": "After he had this thought, he surrounded by his ministers and officials, he went to the Buddha.",
        "source": "T14n0549_004:0863a25_3"
    },
    {
        "source_sentence": "到已，頭面禮佛雙足，退坐一面。",
        "translation": "On arriving, he bowed his head and feet at the Buddha’s feet and withdrew to sit off to one side.",
        "source": "T14n0549_004:0863a26_4"
    },
    {
        "source_sentence": "是時彼佛如其所應，為說法要，示教利喜。",
        "translation": "The Buddha then taught them the essentials of the Dharma as they should be taught, showing them benefits and joy.",
        "source": "T14n0549_004:0863a27_5"
    },
    {
        "source_sentence": "王聞法已，即從座起，整治衣服，合掌向佛，而白佛言：『世尊！",
        "translation": "After hearing the teaching, the king rose from his seat, adjusted his clothes, joined his palms toward the Buddha, and said to him, 'Bhagavān!",
        "source": "T14n0549_004:0863a28_6"
    },
    {
        "source_sentence": "我今請佛及苾芻眾就我宮中，飲食供養，及就我宮安居三月，一切所須，",
        "translation": "I now invite the Buddha and the bhikṣus to come to my palace to offer food, drink, and other requisites for the three months of my absence.",
        "source": "T14n0549_004:0863b01_7"
    },
    {
        "source_sentence": "飲食衣服，臥具醫藥，隨應供給，承事供養，願佛慈悲受我所請。』",
        "translation": "Food, drink, clothing, bedding, and medicine are provided as appropriate to serve and support them, so may the Buddha compassionately accept my invitation.'",
        "source": "T14n0549_004:0863b02_8"
    },
    {
        "source_sentence": "「佛言：『大王！",
        "translation": "The Buddha said, 'Great king!",
        "source": "T14n0549_004:0863b04_9"
    },
    {
        "source_sentence": "我已先受積財長者所請。』",
        "translation": "I've already accepted the invitation of the wealthy man.'",
        "source": "T14n0549_004:0863b04_10"
    },
    {
        "source_sentence": "「王言：『願佛且就我宮，飯食供養，我當告勅積財長者。』",
        "translation": "The king said, 'May the Buddha go to my palace and make offerings of food and drink, and I'll tell the wealthy man.'",
        "source": "T14n0549_004:0863b05_11"
    },
    {
        "source_sentence": "「佛言：『大王！",
        "translation": "The Buddha said, 'Great king!",
        "source": "T14n0549_004:0863b06_12"
    },
    {
        "source_sentence": "法爾不應違於先請。』",
        "translation": "It's true that you shouldn't disobey the prior request.'",
        "source": "T14n0549_004:0863b06_13"
    },
    {
        "source_sentence": "「爾時，滿度摩王頭面禮毘婆尸佛足禮已，即從佛會，還所居宮，亟遣人使詣積財長者所，",
        "translation": "“At that time, King Pūrṇa Maitrāyaniputra bowed his head and face at the feet of Vipaśyin Buddha. Having done so, he departed from the assembly of buddhas and returned to his palace where he was staying.",
        "source": "T14n0549_004:0863b07_14"
    },
    {
        "source_sentence": "傳教勅言：『汝今當知，我已先請毘婆尸佛及苾芻眾，汝可別日營辦供養。』",
        "translation": "He instructed them, saying, 'Now you should know that I've already invited Vipaśyin Buddha and the monks to make offerings on a different day.'",
        "source": "T14n0549_004:0863b09_15"
    },
    {
        "source_sentence": "積財長者白使者言：『願王哀察，我已先請彼佛及苾芻眾。』",
        "translation": "The wealthy man said to the messenger, 'May the king have mercy on me, for I've already invited that Buddha and the monks.'",
        "source": "T14n0549_004:0863b10_16"
    },
    {
        "source_sentence": "「使還白王，王復遣告長者：『汝今居我國中，於理亦應我先供佛。』",
        "translation": "The envoy returned to the king and told him, and the king again sent an announcement to the elder, 'Now that you're staying in my country, I should first make offerings to the Buddha in principle.'",
        "source": "T14n0549_004:0863b12_17"
    },
    {
        "source_sentence": "長者白使者言：『大王若言居王國中，王合先請者，理實不然；",
        "translation": "The wealthy man said to the messenger, “If Your majesty says that you reside in the king’s country, it is unreasonable for the king to invite me beforehand.",
        "source": "T14n0549_004:0863b13_18"
    },
    {
        "source_sentence": "願王今時勿相違礙。』",
        "translation": "May the king not prevent them from doing so at this time.'",
        "source": "T14n0549_004:0863b14_19"
    },
    {
        "source_sentence": "「使還具白，王復遣言長者：『當知設汝所請，我亦不障，然若能造勝上食者，",
        "translation": "Again, the king said to the householder, “You should know that even if you accept my invitation, I will not prevent you from doing so.",
        "source": "T14n0549_004:0863b15_20"
    },
    {
        "source_sentence": "佛當自赴。』",
        "translation": "The Buddha will go there himself.'",
        "source": "T14n0549_004:0863b17_21"
    },
    {
        "source_sentence": "「爾時，積財長者聞是語已，即於是夜，燃以香木，營辦種種清淨最勝上味飲食。",
        "translation": "Having heard these words, the wealthy man Mahāprajāpatī then that night burned incense wood and prepared a variety of pure, most excellent foods and drinks.",
        "source": "T14n0549_004:0863b17_22"
    },
    {
        "source_sentence": "滿度摩王，亦於宮中，辦造飲食。",
        "translation": "King Pūrṇa Maitrāyaniputra also prepared food and drink in the palace.",
        "source": "T14n0549_004:0863b19_23"
    },
    {
        "source_sentence": "至明旦時，長者舍中，敷設莊嚴妙好床座，及淨水器，安布已訖，遣人詣佛，",
        "translation": "On the morning of the following day, he arranged a beautifully decorated seat and clean water container in the house of the wealthy merchant. Having set it up, he sent them to the Buddha.",
        "source": "T14n0549_004:0863b20_24"
    },
    {
        "source_sentence": "白彼佛言：『飲食已辦，食時亦至，願佛降赴，今正是時。』",
        "translation": "He said to the Buddha, 'The food and drink have been prepared, and it's time to eat, so may the Buddha go down; now is the right time.'",
        "source": "T14n0549_004:0863b21_25"
    },
    {
        "source_sentence": "「爾時，毘婆尸佛與苾芻眾，食時著衣，執持應器，詣積財長者舍，受其供養。",
        "translation": "At the time, Vipaśyin Buddha and the monks gathered their robes at the time of food, took the appropriate container, went to the house of the wealthy man's householder, and accepted his offerings.",
        "source": "T14n0549_004:0863b24_0"
    },
    {
        "source_sentence": "到彼舍已，佛先洗足，處於最上妙好之座；",
        "translation": "Having arrived at that monastery, the Buddha first bathed his feet and remained on the most sublime seat.",
        "source": "T14n0549_004:0863b25_1"
    },
    {
        "source_sentence": "諸苾芻眾，亦各洗足，次第而坐。",
        "translation": "The monks also each washed their feet and sat down one after the other.",
        "source": "T14n0549_004:0863b26_2"
    },
    {
        "source_sentence": "積財長者恭敬合掌，前禮佛足。",
        "translation": "The wealthy householder Kukkuṭika respectfully joined his palms and bowed at the Buddha’s feet.",
        "source": "T14n0549_004:0863b27_3"
    },
    {
        "source_sentence": "禮已，即持最上飲食，躬自奉上佛世尊已，次第各各奉諸苾芻。",
        "translation": "After paying homage, he then took the highest food and drink, personally presented it to the Bhagavān, and presented it to each of the monks in order.",
        "source": "T14n0549_004:0863b28_4"
    },
    {
        "source_sentence": "是時，彼佛及苾芻眾，飯食訖已，收置其鉢盥手清淨，次第安坐。",
        "translation": "After they had finished eating, the Buddha and the monks withdrew their bowls, washed their hands cleanly, and sat down in order.",
        "source": "T14n0549_004:0863b29_5"
    },
    {
        "source_sentence": "積財長者，亦於佛前，恭肅而坐，聽佛說法。",
        "translation": "The wealthy merchant also sat before the Buddha and listened to his exhortation.",
        "source": "T14n0549_004:0863c02_6"
    },
    {
        "source_sentence": "「爾時，毘婆尸佛為積財長者，如其所應，宣說法要，示教利喜。",
        "translation": "At the time, Vipaśyin Buddha taught the essentials of the Dharma to wealthy elders as they should be taught and showed them benefit and joy.",
        "source": "T14n0549_004:0863c03_7"
    },
    {
        "source_sentence": "長者得聞法已，心大歡喜，頂禮佛足，積財長者如是供養已，佛出其舍。",
        "translation": "Having heard the Dharma, the wealthy man was greatly delighted and bowed his head at the Buddha’s feet. After having made such an offering to the wealthy householder Kasyapa, the Buddha came out of that monastery.",
        "source": "T14n0549_004:0863c04_8"
    },
    {
        "source_sentence": "「爾時滿度摩王，尚於宮中，營辦飲食，求勝長者，乃謂侍臣言：『我此宮中，",
        "translation": "“At that time King Pūrṇa Maitrāyaniputra was still in the palace, making provisions for food and drink. Seeking to outshine the wealthy man, he said to his attendants:",
        "source": "T14n0549_004:0863c06_9"
    },
    {
        "source_sentence": "眷屬嬪御，而甚廣大，何人善為營造勝上殊妙飲食，而能勝彼積財長者？』",
        "translation": "Their retinues are so vast and extensive, why would anyone be able to build such a wonderful food and drink that it's superior to that wealthy man?'",
        "source": "T14n0549_004:0863c07_10"
    },
    {
        "source_sentence": "侍臣白言：『大王但當禁止諸賣薪者，而彼長者自不能辦供佛之膳。』",
        "translation": "The attendant ministers said, 'The great king will simply prohibit those who sell firewood, but that elder himself can't prepare a meal for the Buddha.'",
        "source": "T14n0549_004:0863c09_11"
    },
    {
        "source_sentence": "王如其言，即令禁止：『若固賣者，不應住我國中。』",
        "translation": "Following his words, the king ordered them to prohibit him, saying, 'If you resolute it, you shouldn't stay in my country.'",
        "source": "T14n0549_004:0863c11_12"
    },
    {
        "source_sentence": "「時積財長者聞有教勅禁賣薪者，心生忿恚，即作是言：『今我舍中，",
        "translation": "When the wealthy man heard that someone had been instructed to prohibit him from selling firewood, his mind became angry and he said, 'Now, in my dwelling,",
        "source": "T14n0549_004:0863c12_13"
    },
    {
        "source_sentence": "自有香木，何須彼薪以焚身邪？』",
        "translation": "If you have your own fragrant wood, why do you need that wood to burn your body?'",
        "source": "T14n0549_004:0863c13_14"
    },
    {
        "source_sentence": "是時長者，舍中先燃香木，及以香油，營造飲食，是香普薰彼大城中。",
        "translation": "At that time the wealthy man’s dwelling had previously burned incense, wood, fragrant oil, and food and drink. That odor perfumed the great city everywhere.",
        "source": "T14n0549_004:0863c14_15"
    },
    {
        "source_sentence": "「滿度摩王聞是香已，問侍臣言：『今此妙香，從何所來？』",
        "translation": "After hearing this fragrance, King Pūrṇa Maitrāyaniputra asked his attendants, 'Now, where did this wonderful fragrance come from?'",
        "source": "T14n0549_004:0863c16_16"
    },
    {
        "source_sentence": "侍臣白言：『此是積財長者燃以香木，營造飲食，是彼餘香，來至於此。』",
        "translation": "The attendants said, 'This is the wealthy man who burned incense wood and built food and drink with it, and this is the remaining fragrance that came here.'",
        "source": "T14n0549_004:0863c17_17"
    },
    {
        "source_sentence": "「王聞是語，知佛已赴長者所請，轉復愁惱，謂侍臣言：『今我宮中，",
        "translation": "Having heard these words, the king knew that the Buddha had already gone to the place where the wealthy man was invited. Feeling further distressed, he said to his attendants, “I am now staying in my palace.",
        "source": "T14n0549_004:0863c19_18"
    },
    {
        "source_sentence": "何無香木？』",
        "translation": "Why is there no fragrant wood?'",
        "source": "T14n0549_004:0863c20_19"
    },
    {
        "source_sentence": "侍臣白言：『市無香木，其何能得？",
        "translation": "The attendant ministers said, 'There's no fragrant wood in the marketplace, so how can they get it?'",
        "source": "T14n0549_004:0863c20_20"
    },
    {
        "source_sentence": "大王當知，彼積財長者家雖巨富，而無子息，一旦終歿，必無繼嗣，凡彼所有，",
        "translation": "Your majesty, you should know that even though the wealthy man Mahāprajāpatī’s family was very wealthy, there were no children to be born into his kingdom. Once he died, they certainly would not have any heirs. All",
        "source": "T14n0549_004:0863c21_21"
    },
    {
        "source_sentence": "悉歸於王。』",
        "translation": "They all return to the king.'",
        "source": "T14n0549_004:0863c23_22"
    },
    {
        "source_sentence": "時滿度摩王，雖聞是語，亦復不悅，臣白王言：『大王！",
        "translation": "Although King Pūrṇa Maitrāyaniputra heard these words, he wasn't pleased either, and his ministers said to the king, 'Great king!",
        "source": "T14n0549_004:0863c23_23"
    },
    {
        "source_sentence": "且止愁惱，王當別日請佛供養，如王所欲，我悉能令勝彼長者。』",
        "translation": "Stop your grief, and on another day, the king will invite the Buddha to make offerings to him, just as the king wishes, and I'll be able to overcome that elder.'",
        "source": "T14n0549_004:0863c24_24"
    },
    {
        "source_sentence": "「爾時臣佐作是言已，即於滿度摩底城中，悉令除去一切沙礫不淨等物，",
        "translation": "Having said these words, the ministers and associates of the assembly were immediately arrayed in the great city of Pūrvavideha to remove all the dirty rubble and other filthy objects.",
        "source": "T14n0549_004:0863c26_25"
    },
    {
        "source_sentence": "以旃檀香水，灑令清淨列淨水瓶，焚諸妙香，以真珠寶，交錯垂布，立諸幢幡，",
        "translation": "They poured sandalwood fragrance over the water bottles to make them pure, and they burned various kinds of exquisite incense. draped with genuine jewels; set up their banners and pennants, adorned with interlocking cloth",
        "source": "T14n0549_004:0863c28_0"
    },
    {
        "source_sentence": "散種種華，猶如天中歡喜之園，等無有異，清淨莊嚴，眾寶具足；",
        "translation": "They scattered various kinds of flowers, resembling the joyful grove in heaven. Equal without distinction, they were purely adorned and endowed with all kinds of treasures.",
        "source": "T14n0549_004:0863c29_1"
    },
    {
        "source_sentence": "敷置種種妙寶之座；",
        "translation": "They spread out seats of various exquisite jewels.",
        "source": "T14n0549_004:0864a02_2"
    },
    {
        "source_sentence": "營辦廣大，細軟甘美，種種上味，清淨飲食色香具足，如天蘇陀悅意上味，",
        "translation": "Their offerings were extensive, fine and delicate, sweet and delicious, of various flavors, with pure food and drink endowed with colors and aromas like the celestial music of Indra’s heavenly music.",
        "source": "T14n0549_004:0864a02_3"
    },
    {
        "source_sentence": "如是飲食，所應供養三界中尊。",
        "translation": "Such food and drink should be offered to the honored ones in the three realms.",
        "source": "T14n0549_004:0864a04_4"
    },
    {
        "source_sentence": "既安布已，時諸臣佐，俱白王言：『今此大城，內外清淨，種種莊嚴，",
        "translation": "Having settled it, the ministers and assistants said to the king, “This great city is now pure inside and out, adorned in various ways.",
        "source": "T14n0549_004:0864a05_5"
    },
    {
        "source_sentence": "上味飲食，悉已成辦，願王請佛，飯食供養。』",
        "translation": "The best food and drink have all been prepared, so may the king invite the Buddha to make offerings of rice and food.'",
        "source": "T14n0549_004:0864a06_6"
    },
    {
        "source_sentence": "「時滿度摩王，見是事已，心生歡喜，即遣使者，詣毘婆尸佛所，而白佛言：『飯食已辦，",
        "translation": "Having seen this sight, King Pūrṇamukha was delighted. He immediately sent an envoy to visit Vipaśyin Buddha and said to him:",
        "source": "T14n0549_004:0864a07_7"
    },
    {
        "source_sentence": "食時亦至，願佛降赴，今正是時。』",
        "translation": "When it's time for food, may the Buddha descend to them, and now is the right time.'",
        "source": "T14n0549_004:0864a09_8"
    },
    {
        "source_sentence": "爾時，毘婆尸佛與苾芻眾，食時著衣，執持應器，詣滿度摩王宮，受其供養。",
        "translation": "At that time, Vipaśyin Buddha and the assembly of bhikṣus, putting on their robes at the time of the meal, took the almsbowl in hand and went to the palace of King Pūrvavideha to receive his offering",
        "source": "T14n0549_004:0864a10_9"
    },
    {
        "source_sentence": "到已，佛先洗足，處於最上妙好之座，諸苾芻眾亦各洗足，次第而坐。",
        "translation": "When he arrived, the Buddha first washed his feet and stood on the most sublime seat, while the monks each washed their feet and sat down in order.",
        "source": "T14n0549_004:0864a12_10"
    },
    {
        "source_sentence": "時滿度摩王，即持寶吉祥瓶，自佛已降，遍行淨水，以佛神力故，有吉祥龍，",
        "translation": "Then King Pūrṇa Maitrāyaniputra, holding the jeweled auspicious vial, descended from his own buddha-bottle and poured pure water everywhere. Because of the spiritual power of the Buddha, there was an auspicious dragon called",
        "source": "T14n0549_004:0864a13_11"
    },
    {
        "source_sentence": "自然住空，持百傘蓋，覆佛世尊及苾芻頂。",
        "translation": "He naturally abides in emptiness, holding a hundred umbrellas that cover the tops of the Bhagavān and the monks.",
        "source": "T14n0549_004:0864a15_12"
    },
    {
        "source_sentence": "王第一妃執其珠金眾寶莊嚴上妙寶扇侍立佛側，餘諸宮嬪亦執寶扇侍苾芻側。",
        "translation": "The king's first queen held the jeweled gold and other treasures adorned with exquisite jeweled fans standing beside the Buddha, and the other palace officials also held the jeweled fan at the side of the monk.",
        "source": "T14n0549_004:0864a16_13"
    },
    {
        "source_sentence": "時滿度摩王，前禮佛足。",
        "translation": "King Pūrṇa Maitrāyaniputra then bowed his head at the Buddha's feet.",
        "source": "T14n0549_004:0864a18_14"
    },
    {
        "source_sentence": "禮已，即持上味飲食，躬奉世尊，然後各各，奉諸苾芻。",
        "translation": "After paying homage, they each presented a delicious food and drink to the Bhagavān in person and then presented it to the monks.",
        "source": "T14n0549_004:0864a18_15"
    },
    {
        "source_sentence": "「爾時，積財長者知佛亦赴滿度摩王所請，即時遣人，潛詣王宮，觀其敷設莊嚴飲食等事所作何若。",
        "translation": "Knowing that the Buddha was also invited by King Pūrṇa Maitrāyaniputra, the wealthy elder then sent someone to the king's palace in person to see what he did with his furnishings, decorations, food, and other things.",
        "source": "T14n0549_004:0864a20_16"
    },
    {
        "source_sentence": "是人至彼，具見殊勝，貪止不還，如是累遣人去，亦復不還。",
        "translation": "When that person arrives there, they'll see the extraordinary and stop craving and won't return. Thus, they'll send someone away in this order and also won't return.",
        "source": "T14n0549_004:0864a22_17"
    },
    {
        "source_sentence": "最後長者即亦自往，至王宮已，備見莊嚴供養等事，乃自思惟：『今王宮中，",
        "translation": "Finally, the wealthy man also departed on his own. Having arrived at the palace of the king, he saw all the adornments and other things that should be offered to him. He thought to himself:",
        "source": "T14n0549_004:0864a23_18"
    },
    {
        "source_sentence": "如是敷設，不知何人而能辦作？",
        "translation": "Thus, it's laid out, but I don't know who will be able to do it.",
        "source": "T14n0549_004:0864a25_19"
    },
    {
        "source_sentence": "我家何故無能此者？』",
        "translation": "Why isn't there anyone in my house who can do this?'",
        "source": "T14n0549_004:0864a26_20"
    },
    {
        "source_sentence": "作是念已，還歸自舍，謂守庫人言：『汝可取諸金寶置於門首，有來求者，",
        "translation": "Having thought thus, he returned to his own house and said to the treasurer in charge of the storehouse, “You should put the golden treasures at the entrance of the door.",
        "source": "T14n0549_004:0864a26_21"
    },
    {
        "source_sentence": "隨意當與，勿須引入，我不能見。』",
        "translation": "I'll give it to you as you wish, so don't need to bring it in; I won't see it.'",
        "source": "T14n0549_004:0864a28_22"
    },
    {
        "source_sentence": "時積財長者，作是念已，即入舍中，寂止一處，榰頥不悅。",
        "translation": "After he had this thought, the wealthy man then entered his dwelling and stayed in a quiet place where he was unable to enjoy himself.",
        "source": "T14n0549_004:0864a29_0"
    },
    {
        "source_sentence": "「是時，帝釋天主以淨天眼，見是事已，乃作是念：『今此界中，積財長者布施供養毘婆尸佛，",
        "translation": "“Then the lord of the god Indra, seeing this matter with his pure divine eye, thought:",
        "source": "T14n0549_004:0864b01_1"
    },
    {
        "source_sentence": "是為上首施主，彼心淨信，我宜變身助其營造。』",
        "translation": "This is the supreme donor whose mind is pure and faithful, so I'd better transform myself to help him build it.'",
        "source": "T14n0549_004:0864b03_2"
    },
    {
        "source_sentence": "作是念已，隱帝釋天主身，現婆羅門相，詣積財長者所。",
        "translation": "After he had this thought, the lord of the god Indra manifested his brāhmaṇa form and went to the wealthy man Jīvaka.",
        "source": "T14n0549_004:0864b04_3"
    },
    {
        "source_sentence": "到彼舍已，謂守門人言：『汝可入告長者言：「有憍尸迦族婆羅門，今在門外，",
        "translation": "When he arrived at the monastery, he said to the gatekeeper, “Come in and tell the wealthy man, ‘There is a brāhmaṇa of Kāśika family who is now outside the door.",
        "source": "T14n0549_004:0864b05_4"
    },
    {
        "source_sentence": "欲見長者。」』",
        "translation": "I want to see the elder.'",
        "source": "T14n0549_004:0864b07_5"
    },
    {
        "source_sentence": "守門人曰：『長者有言：「凡有來者，不應引入，或有所求，隨意當給。」",
        "translation": "The gatekeeper said, 'There's an elderly man who says, Anyone who comes shouldn't be introduced; if they have anything to ask, they'll give it as they wish.'",
        "source": "T14n0549_004:0864b07_6"
    },
    {
        "source_sentence": "汝婆羅門！",
        "translation": "You brāhmaṇas!",
        "source": "T14n0549_004:0864b09_7"
    },
    {
        "source_sentence": "若有所欲，宜自持去，何故須求見長者耶？』",
        "translation": "If there's a desire, it's better to take it yourself and leave it; why would you need to see the elder?'",
        "source": "T14n0549_004:0864b09_8"
    },
    {
        "source_sentence": "「婆羅門言：『我於諸物，都無希取，然今但欲求見長者，汝宜為我速入通達。』",
        "translation": "The Brāhmaṇa said, 'I have no desire for anything, but now I just want to see the elder, so you should quickly enter and comprehend it for me.'",
        "source": "T14n0549_004:0864b10_9"
    },
    {
        "source_sentence": "「時守門人，即入白言：『有一憍尸迦族婆羅門，今在門外，欲見長者。』",
        "translation": "The gatekeeper then went in and said, 'There's a brāhmaṇa of the Kāśika family outside the gate who wants to see the elder.'",
        "source": "T14n0549_004:0864b12_10"
    },
    {
        "source_sentence": "長者告言：『汝可謂彼婆羅門曰：「若有所求，自當持去，何故須欲求見我耶？」』",
        "translation": "The elder told him, 'You may tell that Brāhmaṇa, If you have something to ask for, you yourself will take it and leave it; why would you need to ask for it to see me?'",
        "source": "T14n0549_004:0864b13_11"
    },
    {
        "source_sentence": "「時守門人，即出具告。",
        "translation": "The gatekeeper then gave the full report.",
        "source": "T14n0549_004:0864b15_12"
    },
    {
        "source_sentence": "婆羅門復言：『我無所求，唯欲與彼長者相見。』",
        "translation": "Again, the Brāhmaṇa said, 'I don't have anything to ask for, but I want to meet that elder.'",
        "source": "T14n0549_004:0864b15_13"
    },
    {
        "source_sentence": "時守門人，再白長者。",
        "translation": "The gatekeeper then told the elder again.",
        "source": "T14n0549_004:0864b16_14"
    },
    {
        "source_sentence": "於是長者，許其相見。",
        "translation": "The wealthy man then agreed to meet him.",
        "source": "T14n0549_004:0864b17_15"
    },
    {
        "source_sentence": "婆羅門入已，白長者言：『汝今何故榰頥不悅？",
        "translation": "After the Brāhmaṇa entered, he said to the elder, 'Why are you so unhappy now?'",
        "source": "T14n0549_004:0864b17_16"
    },
    {
        "source_sentence": "有何憂愁？』",
        "translation": "What grief is there?'",
        "source": "T14n0549_004:0864b18_17"
    },
    {
        "source_sentence": "「『我不說憂事，　　說亦不能脫，",
        "translation": "'I don't talk about grievous things, and I can't get rid of them by speaking.",
        "source": "T14n0549_004:0864b19_18"
    },
    {
        "source_sentence": "　　若令我得脫，　　我即為汝說。』",
        "translation": "If you cause me to attain liberation, I'll explain it for you.'",
        "source": "T14n0549_004:0864b19_18"
    },
    {
        "source_sentence": "「爾時，長者說伽陀曰：「時婆羅門言：『汝但具說憂愁所因，我必為汝善解其事。』",
        "translation": "At the time, the elder said to Gadha, The Brāhmaṇa then said, 'The Brāhmaṇa said, 'Explain the causes of your grief in detail, and I will explain them well for you.'",
        "source": "T14n0549_004:0864b19_18"
    },
    {
        "source_sentence": "時，積財長者具說所因已，彼帝釋天主即攝婆羅門相，還復本身，謂長者言：『我是帝釋天主，",
        "translation": "Then the wealthy man Mahāprajāpatī Gautamī explained in detail the reason for this. The lord of the gods Indra and Śakra Devānām-Indra gathered the brāhmaṇa’s features and, returning to",
        "source": "T14n0549_004:0864b23_19"
    },
    {
        "source_sentence": "我今當遣毘首羯磨天子，來助於汝，營辦勝上飲食供佛。』",
        "translation": "Now, I will send Vaiśravaṇa to help you prepare the best food and drink for the Buddha.'",
        "source": "T14n0549_004:0864b25_20"
    },
    {
        "source_sentence": "作是語已，隱復天宮，即勅毘首羯磨天子言：『汝往積財長者舍，潛助營辦供佛之事，",
        "translation": "Having said these words, the Licchavi Viśeṣavartin returned to his celestial palace and commanded the deity Vaiśravaṇa, “Go to the house of the wealthy householder Mahāprajāpatīṇākarasārin",
        "source": "T14n0549_004:0864b26_21"
    },
    {
        "source_sentence": "不亦善乎！』",
        "translation": "Isn't that good?'",
        "source": "T14n0549_004:0864b28_22"
    },
    {
        "source_sentence": "「時彼天子奉帝釋命，潛助長者，乃以神力，即變大城，悉令清淨，如天境界；",
        "translation": "“At that time the celestial being Śakra, in accordance with the emperor’s command, assisted the wealthy merchant by means of his supernatural power to transform the great city and make it all pure, just like the realm of heaven.",
        "source": "T14n0549_004:0864b28_23"
    },
    {
        "source_sentence": "敷設種種上妙珍寶嚴飾之具，天諸寶座，天妙飲食，皆悉具足；",
        "translation": "It was decorated with various kinds of exquisite jewel ornaments, adorned with heavenly jewel thrones, and provided with heavenly food and drink.",
        "source": "T14n0549_004:0864c01_24"
    },
    {
        "source_sentence": "有愛囉嚩努龍王，自然住空持白傘蓋，覆於佛頂，餘吉祥龍，各持傘蓋，",
        "translation": "Ānanda, there was a dear nāga king named Rāhuṇu, who naturally remained in the sky and carried white umbrellas to cover the Buddha’s head. The other ascetic dragons each carried umbrellas for",
        "source": "T14n0549_004:0864c03_25"
    },
    {
        "source_sentence": "覆諸苾芻頂。",
        "translation": "It covers the monks' heads.",
        "source": "T14n0549_004:0864c04_26"
    },
    {
        "source_sentence": "有天童女，執金寶莊嚴最上寶扇侍立佛側，餘諸天女各執寶扇侍苾芻側。",
        "translation": "A goddess with a golden-jeweled adornment of the highest jeweled fan stood beside the Buddha, and the other goddesses each held a jeweled fan to serve the monk's side.",
        "source": "T14n0549_004:0864c05_27"
    },
    {
        "source_sentence": "時積財長者，即持種種上味飲食，躬自奉上佛及苾芻。",
        "translation": "The wealthy man then took various delicious foods and drinks, presented them to the Buddha and the monks in person.",
        "source": "T14n0549_004:0864c06_28"
    },
    {
        "source_sentence": "「時滿度摩王，即謂使者言：『汝可潛詣積財長者舍，觀其敷設莊嚴飲食，",
        "translation": "Then King Pūrṇa Maitrāyaniputra said to his messengers, “You should go secretly to the house of the wealthy householder Prabhūtaratna and see how he prepares food and drink.",
        "source": "T14n0549_004:0864c08_29"
    },
    {
        "source_sentence": "其事何若？』",
        "translation": "What's the matter?'",
        "source": "T14n0549_004:0864c09_30"
    },
    {
        "source_sentence": "使者奉命，即潛詣彼，具見莊嚴殊異等事，見已忘還；",
        "translation": "The envoyant, obeying the instruction, went secretly to that place. Seeing all the extraordinary features of the adornments and so on, he forgot to return there.",
        "source": "T14n0549_004:0864c10_0"
    },
    {
        "source_sentence": "復遣近臣去，亦不還，遣大子去，亦復不還；",
        "translation": "Again, the king sent his ministers away but they did not return. The prince went away but he did not return.",
        "source": "T14n0549_004:0864c11_1"
    },
    {
        "source_sentence": "乃至最後王自詣彼，潛立門側。",
        "translation": "When the last king approached them, he stood quietly beside the gate.",
        "source": "T14n0549_004:0864c12_2"
    },
    {
        "source_sentence": "「爾時，毘婆尸佛知王在外，即謂長者言：『汝先因滿度摩王發不善語業，",
        "translation": "Knowing that the king was outside, Vipaśyin Buddha said to the wealthy man, “Your majesty, you were previously engaged in unwholesome speech because of King Pūrṇa Maitrāyaniputra’s actions.",
        "source": "T14n0549_004:0864c12_3"
    },
    {
        "source_sentence": "斯為罪咎；",
        "translation": "This is blameworthy.",
        "source": "T14n0549_004:0864c14_4"
    },
    {
        "source_sentence": "其王今在汝舍門外，汝可速出悔謝其過。』",
        "translation": "Now that king is outside the door of your house, you may quickly come out and apologize for his faults.'",
        "source": "T14n0549_004:0864c14_5"
    },
    {
        "source_sentence": "長者即出，見其王已，悔過自責，迎王前入。",
        "translation": "Seeing the king, the wealthy man repented and apologized to himself. He went in front of the king to meet him.",
        "source": "T14n0549_004:0864c15_6"
    },
    {
        "source_sentence": "王入舍已，具見種種天妙莊嚴及飲食等，見已悉忘前事，乃謂長者言：『汝所供佛，",
        "translation": "Having entered the monastery, the king saw all kinds of heavenly adornments and food and drink. Seeing this, he forgot all his previous activities. Then he said to the wealthy merchant:",
        "source": "T14n0549_004:0864c16_7"
    },
    {
        "source_sentence": "勝上若此，如能日日如是供養佛及苾芻，斯無等比。』",
        "translation": "If it's superior like this, how could he make such offerings to the Buddha and the monks day after day? It's peerless.'",
        "source": "T14n0549_004:0864c18_8"
    },
    {
        "source_sentence": "「時積財長者起清淨心，前禮佛足，發是願言：『願我以此，如實布施佛及苾芻，",
        "translation": "At that time the wealthy householder Sudarśana, having developed a pure mind and bowed at the Buddha’s feet, made the following vow:",
        "source": "T14n0549_004:0864c19_9"
    },
    {
        "source_sentence": "所作善根，當生獲得大富自在，一切具足。",
        "translation": "The good roots they cultivate will give rise to great wealth and mastery, fully endowed with everything.",
        "source": "T14n0549_004:0864c21_10"
    },
    {
        "source_sentence": "所生之處，得於人中現受天福，不起多貪，具離貪行。",
        "translation": "Where they are born, they'll attain the present enjoyment of heavenly bliss among humans, which doesn't give rise to much craving and is free of covetous behavior.",
        "source": "T14n0549_004:0864c22_11"
    },
    {
        "source_sentence": "願如今日，得善法利，值佛正法，歸佛出家。』",
        "translation": "May I now attain the benefits of good qualities, meet the Buddha's right teaching, return to the Buddha, and leave home.'",
        "source": "T14n0549_004:0864c23_12"
    },
    {
        "source_sentence": "發是願已，毘婆尸佛及苾芻眾，即住長者舍，安居三月。」",
        "translation": "After making this vow, Vipaśyin Buddha and the monks stayed in the elder's house for three months.",
        "source": "T14n0549_004:0864c24_13"
    },
    {
        "source_sentence": "爾時，釋迦牟尼佛告諸苾芻言：「於汝意云何？",
        "translation": "It was then that the Śākyamuni Buddha addressed the monks, What do you think?",
        "source": "T14n0549_004:0864c27_0"
    },
    {
        "source_sentence": "爾時毘婆尸佛法中，積財長者豈異人乎？",
        "translation": "At the time, isn't that a different person from the wealthy elder who accumulated his wealth in the Vaiśravaṇa teachings?",
        "source": "T14n0549_004:0864c28_0"
    },
    {
        "source_sentence": "今光明苾芻是也。",
        "translation": "This is the present-day Bhikṣu of Light.",
        "source": "T14n0549_004:0864c28_1"
    },
    {
        "source_sentence": "彼時於滿度摩王所，出不善語業，由是因故，果報無失，於五百生中，",
        "translation": "At that time, in the presence of King Pūrṇa Maitrāyaniputra, he produced unwholesome speech and action. Because of this cause, his retribution was irreproachable:",
        "source": "T14n0549_004:0864c29_2"
    },
    {
        "source_sentence": "與母同其火焚，乃至今生，亦復如是。",
        "translation": "It's likewise with his mother who shares the same fire and burns it, even when he's born now.",
        "source": "T14n0549_004:0865a01_3"
    },
    {
        "source_sentence": "然於毘婆尸佛所，先種善根，及發大願，今已成熟，為大富長者，一切具足。",
        "translation": "In the presence of Vipaśyin Buddha, however, he had previously planted roots of goodness and made a great vow. Now that he has matured them, he becomes a wealthy man who is fully endowed with everything.",
        "source": "T14n0549_004:0865a02_4"
    },
    {
        "source_sentence": "現於人中，受天勝福，所作善利，乃至威力等事，與彼毘婆尸佛時，等無有異。",
        "translation": "Now, among humans, they'll receive the superior merits of gods, perform good deeds and benefits, up to their authoritative abilities, and so forth, which are no different from those at the time of Vipaśyin Buddha.",
        "source": "T14n0549_004:0865a04_5"
    },
    {
        "source_sentence": "而今最後於我法中，出家學道，斷諸煩惱，證阿羅漢。",
        "translation": "But now, finally, in my teaching, I've left home to train on the path, cut off all afflictions, and realized arhatship.",
        "source": "T14n0549_004:0865a06_6"
    },
    {
        "source_sentence": "「諸苾芻！",
        "translation": "Monks!",
        "source": "T14n0549_004:0865a07_7"
    },
    {
        "source_sentence": "以是因緣，汝等當知，一切眾生，若造一黑業因，決定當受一黑業報；",
        "translation": "Because of these causes and conditions, you should know that if all sentient beings create the cause of one black action, they will surely experience the retribution of one black action.",
        "source": "T14n0549_004:0865a07_8"
    },
    {
        "source_sentence": "若造一白業因，決定當受一白業報。",
        "translation": "If someone creates the cause of a white action, they'll surely experience the result of a white action.",
        "source": "T14n0549_004:0865a09_9"
    },
    {
        "source_sentence": "是故，諸苾芻！",
        "translation": "Therefore, monks!",
        "source": "T14n0549_004:0865a10_10"
    },
    {
        "source_sentence": "若黑業因、若白業因，一一果報，決定無失，當知皆是自分所作。",
        "translation": "Whether it's a cause of black karma or a cause of white karma, the results of each result are determined without error, and you should know that they're all self-created.",
        "source": "T14n0549_004:0865a10_11"
    },
    {
        "source_sentence": "汝等諸苾芻，應如是修學。」",
        "translation": "You monks, you should thus cultivate it.",
        "source": "T14n0549_004:0865a12_12"
    },
    {
        "source_sentence": "佛說此經已，諸苾芻眾，聞佛所說，皆大歡喜，信受奉行。",
        "translation": "After the Buddha taught this sutra, the monks and nuns who heard what he taught were all greatly delighted and believed it and carried it out.",
        "source": "T14n0549_004:0865a12_13"
    },
    {
        "source_sentence": "佛說光明童子因緣經卷第四",
        "translation": "Foshuo fongguangming gongzi yining jing, vol. 4",
        "source": "T14n0549_004:0865a15_0"
    }
]