[
    {
        "source_sentence": "佛說十吉祥經",
        "translation": "Ten Auspicious Scriptures Spoken by the Buddha",
        "source": "T14n0432_001:0077b12_0"
    },
    {
        "source_sentence": "失譯人名今附秦錄",
        "translation": "The names of the lost translators are now appended to the Qin records.",
        "source": "T14n0432_001:0077b14_0"
    },
    {
        "source_sentence": "如是我聞：一時，佛在羅閱祇耆闍崛山中，與大比丘眾千二百五十人、菩薩五千人俱。",
        "translation": "Thus I have heard: One time, the Buddha was staying at Rājagṛdhrakūṭa in the mountains of Rājagṛha, accompanied by one thousand two hundred and fifty bhikṣus and five thousand bodhisattvas.",
        "source": "T14n0432_001:0077b15_0"
    },
    {
        "source_sentence": "爾時，世尊與無央數百千人，前後圍遶而為說經。",
        "translation": "At the time, the Bhagavān and measureless hundreds of thousands of people surrounded him in front and behind him to preach the sūtras.",
        "source": "T14n0432_001:0077b16_1"
    },
    {
        "source_sentence": "時大會中有一大士，名離垢蓋，承佛威神，即從座起，偏袒右肩，右膝著地，",
        "translation": "In the great assembly at that time there was a great bodhisattva named Licchavi. Endowed with the Buddha’s spiritual power, he rose from his seat, bared his right shoulder and knelt on the ground with his right knee touching the ground.",
        "source": "T14n0432_001:0077b18_2"
    },
    {
        "source_sentence": "叉手合掌，前白佛言：「今可現有諸佛世尊如來、至真、等正覺，若有善男子、善女人求佛道者，",
        "translation": "He joined his palms in salute and said to the Buddha: There are now buddhas, world-honored ones, tathāgatas, arhats, pratyekabuddhas, perfectly enlightened ones. If there are any sons or daughters of a virtuous family who seek the path of buddhahood,",
        "source": "T14n0432_001:0077b19_3"
    },
    {
        "source_sentence": "聞其名號受持讀誦，疾得不退轉於無上正真道？」",
        "translation": "When you hear his name, memorize it and recite it, will you quickly attain the unsurpassed true path of nonretrogression?",
        "source": "T14n0432_001:0077b21_4"
    },
    {
        "source_sentence": "佛告離垢蓋太士：「善哉！",
        "translation": "The Buddha told Licchavi Tathāgata, Good!",
        "source": "T14n0432_001:0077b22_5"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T14n0432_001:0077b23_6"
    },
    {
        "source_sentence": "族姓子乃能作是問，多所利益。",
        "translation": "A clansman who asks this question will often be able to benefit.",
        "source": "T14n0432_001:0077b23_7"
    },
    {
        "source_sentence": "「有，族姓子！",
        "translation": "Yes, clansmen!",
        "source": "T14n0432_001:0077b24_8"
    },
    {
        "source_sentence": "東方去此度一恒沙數諸佛世界，有世界名方莊嚴，其剎有佛，名大光耀如來、至真、等正覺，",
        "translation": "“In the east, beyond as many buddha-fields as there are grains of sand in one Ganges River as there are grains of sand in all these buddha-fields, is a world called direction adornment. In that land there is a buddha named Mahāprajñāpāramitā Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T14n0432_001:0077b24_9"
    },
    {
        "source_sentence": "今現在說法。",
        "translation": "Now, he teaches the Dharma in the present.",
        "source": "T14n0432_001:0077b26_10"
    },
    {
        "source_sentence": "「復有，族姓子！",
        "translation": "Again, there are clansmen!",
        "source": "T14n0432_001:0077b27_11"
    },
    {
        "source_sentence": "東方度二恒沙數諸佛世界，有世界名諦勝諸勝，其剎有佛，名慧燈明如來。",
        "translation": "In the east, there are buddha-lands as numerous as the number of grains of sand in two Ganges Rivers. There is a world named Supreme Truth that surpasses all [the other] superior ones. In this world there is a buddha named Wisdom Lamplight Tathāgata.",
        "source": "T14n0432_001:0077b27_12"
    },
    {
        "source_sentence": "有世界名金剛，其剎有佛，名大雄如來。",
        "translation": "There's a world named Vajra, and there's a buddha named Mahāprajñāpāramitā Tathāgata in that land.",
        "source": "T14n0432_001:0077b29_13"
    },
    {
        "source_sentence": "有世界名淨尊住，其剎有佛，名無垢塵如來。",
        "translation": "There's a world named the abode of the pure honored one, where there's a buddha named the Tathāgata of undefiled dust.",
        "source": "T14n0432_001:0077c01_0"
    },
    {
        "source_sentence": "有世界名金光明，其剎有佛，名上像幢十蓋王如來。",
        "translation": "There's a world named Golden Light, and in that land there's a buddha named the Tathāgata of the Ten-Coated King with the Name of the Supremely Enlightened Banner.",
        "source": "T14n0432_001:0077c02_0"
    },
    {
        "source_sentence": "有世界名大威神，其剎有佛，名威神自在王如來。",
        "translation": "There's a world named Mahāprajñāpāramitā, and there's a buddha named Mahāprajñāpāramitā Free King Tathāgata.",
        "source": "T14n0432_001:0077c03_1"
    },
    {
        "source_sentence": "有世界名香熏，其剎有佛，名極受上影王如來。",
        "translation": "There's a world named Fragrance Permeated with Fragrance, and there's a buddha named King of Supremely Sensing Tathāgata.",
        "source": "T14n0432_001:0077c04_2"
    },
    {
        "source_sentence": "有世界名寶嚴，其剎有佛，名內寶如來。",
        "translation": "There's a world named Jewel Adornment, and there's a buddha named the Tathāgata of internal jewels at that place.",
        "source": "T14n0432_001:0077c05_3"
    },
    {
        "source_sentence": "有世界名海燈明，其剎有佛，名大海如來。",
        "translation": "There's a world named Ocean Lamplight, in which there's a buddha named Great Ocean Tathāgata.",
        "source": "T14n0432_001:0077c06_4"
    },
    {
        "source_sentence": "有世界名十力燈明，其剎有佛，名十力現如來。",
        "translation": "There's a world named the lamp of the ten powers, in which there's a buddha named the Ten Powers Manifesting Tathāgata.",
        "source": "T14n0432_001:0077c07_5"
    },
    {
        "source_sentence": "當知，離垢蓋！",
        "translation": "You should know that it's free of the stain!",
        "source": "T14n0432_001:0077c08_6"
    },
    {
        "source_sentence": "若善男子、善女人求佛道者，恒邊沙剎滿中七寶持用布施如來、正覺，",
        "translation": "If good men and good women seek the Buddha’s path, they should always offer to the Tathāgata and the perfectly enlightened one the seven treasures of buddhahood preserved in an infinite number of buddha-lands as numerous as grains of sand at the edge of the Ganges River.",
        "source": "T14n0432_001:0077c08_7"
    },
    {
        "source_sentence": "若善男子、善女人，聞此佛名受持諷誦執在心懷，於大眾中為人廣說，",
        "translation": "“Furthermore, if there are sons and daughters of a virtuous family who hear the name of this buddha-knowledge, hold it in their minds, preserve it, recite it, and teach it widely to all living beings.",
        "source": "T14n0432_001:0077c10_8"
    },
    {
        "source_sentence": "此之功德過前功德。」",
        "translation": "This merit is greater than the previous one.",
        "source": "T14n0432_001:0077c11_9"
    },
    {
        "source_sentence": "「如恒邊沙，　　諸佛世界，　　滿中七寶，",
        "translation": "Like the sand at the edge of the Ganges River, The buddha worlds Are filled with the seven treasures:",
        "source": "T14n0432_001:0077c12_10"
    },
    {
        "source_sentence": "　持用布施，　　若有得聞，　　諸佛名號，",
        "translation": "If someone hears the names of the buddhas, They preserve them and give them as alms.",
        "source": "T14n0432_001:0077c12_10"
    },
    {
        "source_sentence": "　信樂不忘，　　功德過前。",
        "translation": "Faith, happiness, and non-forgetfulness are superior to the preceding virtues.",
        "source": "T14n0432_001:0077c12_10"
    },
    {
        "source_sentence": "「若聞諸佛名，　　諷誦莫忘失，",
        "translation": "If you hear the names of the buddhas, Recite them without forgetting.",
        "source": "T14n0432_001:0077c12_10"
    },
    {
        "source_sentence": "　其人不宜疑，　　言我不成佛。",
        "translation": "That person shouldn't doubt it, saying, I won't become a buddha.",
        "source": "T14n0432_001:0077c12_10"
    },
    {
        "source_sentence": "　六通無窮盡，　　至于無數劫，",
        "translation": "The six supernormal knowledges are inexhaustible For countless eons.",
        "source": "T14n0432_001:0077c12_10"
    },
    {
        "source_sentence": "　其身當金色，　　相好以莊嚴。",
        "translation": "Their bodies will be golden-colored, Adorned with beautiful features.",
        "source": "T14n0432_001:0077c12_10"
    },
    {
        "source_sentence": "　若持佛名號，　　過於十億劫，",
        "translation": "If someone holds the Buddha’s name For more than one billion kalpas,",
        "source": "T14n0432_001:0077c12_10"
    },
    {
        "source_sentence": "重欲解義，而說偈言：　疾得成正覺。」",
        "translation": "Desiring to understand the meaning, he spoke a verse, saying, They'll quickly become perfectly enlightened.",
        "source": "T14n0432_001:0077c12_10"
    },
    {
        "source_sentence": "佛說經竟，離垢蓋大士、諸菩薩等，天龍、鬼神及世間人，咸皆歡喜頂受佛教。",
        "translation": "When the Buddha finished speaking the sūtra, the Licchavi ministers, bodhisattvas, gods, dragons, ghosts, and people in the world all rejoiced and accepted the Buddha's teaching.",
        "source": "T14n0432_001:0077c22_0"
    },
    {
        "source_sentence": "佛說十吉祥經",
        "translation": "Ten Auspicious Scriptures Spoken by the Buddha",
        "source": "T14n0432_001:0077c24_0"
    }
]