[
    {
        "source_sentence": "觀察諸法行經卷第二",
        "translation": "Sutra on Observing the Practice of All Dharmas, Volume 2",
        "source": "T15n0649_002:0731b17_0"
    },
    {
        "source_sentence": "隋天竺三藏闍那崛多譯",
        "translation": "Translated by the Tripiṭaka of India, translated by Jñānagupta",
        "source": "T15n0649_002:0731b19_0"
    },
    {
        "source_sentence": "先世勤相應品第二",
        "translation": "The Second Chapter of the Concomitant with the Distinctness of Former Worldly Practices",
        "source": "T15n0649_002:0731b20_0"
    },
    {
        "source_sentence": "爾時，世尊復告喜王菩薩摩訶薩言：「喜王！",
        "translation": "It was then that the Bhagavān again addressed the joy king bodhisattva Mahāsattva, saying, King of Joy!",
        "source": "T15n0649_002:0731b21_0"
    },
    {
        "source_sentence": "又復菩薩應覺諸法不依，應覺諸法不出、不滅，不作、不生，遠離輕虛，",
        "translation": "“Furthermore, enlightening beings should realize that all things have no basis. They should realize that all things do not come forth or cease, don’t act or arise, and be far removed from falsehood.",
        "source": "T15n0649_002:0731b21_1"
    },
    {
        "source_sentence": "自空不牢，不取、不捨；",
        "translation": "The self-emptiness is not firm, neither grasping nor relinquishing.",
        "source": "T15n0649_002:0731b23_2"
    },
    {
        "source_sentence": "應覺諸法無常、苦、無我、寂靜；",
        "translation": "They should realize that all things are impermanent, painful, selfless, and tranquil.",
        "source": "T15n0649_002:0731b24_0"
    },
    {
        "source_sentence": "應覺諸法空、無相、無願；",
        "translation": "They should awaken to the emptiness, signlessness, and wishlessness of all things.",
        "source": "T15n0649_002:0731b24_1"
    },
    {
        "source_sentence": "應覺諸法無我、無眾生、無命、無富伽羅(二十)；",
        "translation": "You should realize that all things have no self, no sentient beings, no life, and no personality. (20)",
        "source": "T15n0649_002:0731b25_2"
    },
    {
        "source_sentence": "應覺諸法不合、不可作，無自體、無相、無有；",
        "translation": "They should realize that all things are not united, cannot be done, have no essence, no characteristics, and no existence.",
        "source": "T15n0649_002:0731b26_3"
    },
    {
        "source_sentence": "應覺諸法離染不行、離戲論不行，到最勝、不種種(三十)，無戲論、離戲論，",
        "translation": "You should realize that all dharmas are free of defilement and non-practicing, free of conceptual elaborations and non-practicing, up to the supreme, not variegated (thirty), without conceptual elaborations and free of conceptual elaborations.",
        "source": "T15n0649_002:0731b27_4"
    },
    {
        "source_sentence": "不可取、不持，無住處、不來、不去、不住，無字不可說(四十)，諸法不可言、不可將來，",
        "translation": "They can't be grasped or held, have no abiding place, don't come, don't go, and don't abide, have words that can't be explained (forty), and dharmas that can't be spoken and won't come,",
        "source": "T15n0649_002:0731b28_5"
    },
    {
        "source_sentence": "無業、無報；",
        "translation": "There is no action and no retribution.",
        "source": "T15n0649_002:0731c01_6"
    },
    {
        "source_sentence": "應覺諸法不分別、無種種分別、斷普分別。",
        "translation": "You should realize that all dharmas are not discriminated, have no various discriminations, and stop discriminating everywhere.",
        "source": "T15n0649_002:0731c01_7"
    },
    {
        "source_sentence": "「諸想及念皆已除斷，破天等世得度五趣、度於眾生，勝魔羅眾、超過煩惱魔羅、出聚魔羅、斷死魔羅，",
        "translation": "Having eliminated all thoughts and perceptions, he destroys the gods and so forth in worlds to attain liberation from the five destinies and save sentient beings, surpassing Māra's multitude, transcending the Māra of affliction, emerging from the Māra of affliction, and ending the Māra of death.",
        "source": "T15n0649_002:0731c02_8"
    },
    {
        "source_sentence": "滿無著智，攝取三世勝色，為諸眾生所愛、為智者所供養，能於諸法見其法體。",
        "translation": "Fulfilling unattached cognition, he collects the three worldly forms that are most excellent, beloved by sentient beings and supported by wise people, and he's able to see the essence of the Dharma in all dharmas.",
        "source": "T15n0649_002:0731c04_9"
    },
    {
        "source_sentence": "「得肉眼淨到天眼明，到智眼行不動法眼，具足佛眼如月顯照，知諸眾生心行，",
        "translation": "They attain purity of the physical eye up to the divine eye, clarity of the eye of knowledge up to the unshakable eye of reality. Endowed with buddha-eye like the moon shining brightly, they know the minds and actions of sentient beings.",
        "source": "T15n0649_002:0731c06_10"
    },
    {
        "source_sentence": "不勤合者當作覺察，捨諸所取(二十)。",
        "translation": "Those who don't diligently combine should be awakened and examined, abandoning what's grasped (20).",
        "source": "T15n0649_002:0731c08_11"
    },
    {
        "source_sentence": "「於三千大千世界中為諸天人作支帝相隨順，得淨行地、通無我際、知於出界，",
        "translation": "“In the great manifold cosmos of 3,000 buddha-fields, they serve gods and humans as their disciples, following each other. They attain the state of pure practice, transcend the realm of selflessness, and know the realm of liberation.",
        "source": "T15n0649_002:0731c09_12"
    },
    {
        "source_sentence": "諸眾生所當作親尊，離增上慢，有於忍力超五障礙，能於名色知其本性，",
        "translation": "All sentient beings become their relatives and honored ones, free of overweening conceit. They have the power of forbearance that transcends the five kinds of obstacles, and are able to know their essential nature in name and form.",
        "source": "T15n0649_002:0731c11_13"
    },
    {
        "source_sentence": "順覺諸佛所說言辭、順覺三十二相(三十)，於得、不得心有所取，皆已超過於世間得而得世法不染。",
        "translation": "Consistent with awakening, the words spoken by the buddhas and the thirty-two characteristics of following awakening (thirty), which have no mental grasping in terms of attaining or not attaining, all transcend worldly attainment and attain worldly dharmas that aren't stained.",
        "source": "T15n0649_002:0731c12_14"
    },
    {
        "source_sentence": "「於諸眾生當為作舍，開涅槃門令諸眾生入無畏城，與甘露味演說於法，",
        "translation": "You should be a shelter for all sentient beings, and open the door of liberation so that all living beings may enter the city of fearlessness. Give them the taste of immortality to preach the Dharma.",
        "source": "T15n0649_002:0731c15_0"
    },
    {
        "source_sentence": "覺煩惱睡、散眾生熱，斷其所著諸見縛等，六根不染而為眾生說法，得十六字門所出陀羅尼。",
        "translation": "He perceives the afflictions, drowsiness, dissipation, and feverishness of sentient beings, stops the bonds of views that are attached to them, explains the teaching for sentient beings without staining the six faculties, and attains the dhāraṇī produced by the sixteen-syllable approach.",
        "source": "T15n0649_002:0731c16_1"
    },
    {
        "source_sentence": "「何者是彼十六種陀羅尼？",
        "translation": "“What are these sixteen kinds of dhāraṇī?",
        "source": "T15n0649_002:0731c18_2"
    },
    {
        "source_sentence": "所謂阿字不生義故、波字最勝義故、遮字四實義故、那字知名色生義故、陀字調伏義故、沙字超過著義故、迦字不失業報義故、娑字諸法平等義故、伽字甚深義故、他字勢力義故、闍字超過生老死義故、車字斷煩惱無餘義故、蹉字高出義故、詫字住義故、[口*荼]字教化邊地彌黎車義故(梵本亦少一字)。",
        "translation": "所謂阿字不生義故、波字最勝義故、遮字四實義故、那字知名色生義故、陀字調伏義故、沙字超過著義故、迦字不失業報報義故、娑字諸法平等義故、伽字甚深義故、他字勢力義故、闍字超生老死義故、車",
        "source": "T15n0649_002:0731c19_3"
    },
    {
        "source_sentence": "善家子！",
        "translation": "Son of a good family!",
        "source": "T15n0649_002:0731c26_4"
    },
    {
        "source_sentence": "此是得十六字所出陀羅尼，名得陀羅尼。",
        "translation": "This is the attainment of the sixteen-syllable dhāraṇī that's produced, which is called attaining the dhāraṇī.",
        "source": "T15n0649_002:0731c26_5"
    },
    {
        "source_sentence": "「所出巧智解知諸法自空，選擇諸眾生心，出離諸煩惱，吐諸凡夫所取。",
        "translation": "The skillful knowledge that comes forth understands the self-emptyness of dharmas, chooses the minds of sentient beings, escapes afflictions, and spits out what ordinary people grasp.",
        "source": "T15n0649_002:0731c27_6"
    },
    {
        "source_sentence": "通彼法相，度流轉海，善說令喜，設法施會。",
        "translation": "He penetrates the characteristics of those dharmas, crosses the ocean of transmigration, explains them well and makes them happy, and sets up a Dharma-giving assembly.",
        "source": "T15n0649_002:0731c28_7"
    },
    {
        "source_sentence": "巧生諸字音智解知於空，樂佛解脫，捨愛、不愛而無悋惜。",
        "translation": "He skillfully produces the sounds of words and wisdom understands emptiness, delights in the Buddha's liberation, abandons craving and non-craving, and doesn't cherish it.",
        "source": "T15n0649_002:0731c29_8"
    },
    {
        "source_sentence": "「於諸外道、他論如法降伏，說師子吼，得於佛智，興於法施，吐諸煩惱，",
        "translation": "Having subdued the theories of heretics and others in accordance with the Dharma, he preached the lion’s roar to attain buddha-cognition, generated charity for the sake of the Dharma, and expelled all afflictions.",
        "source": "T15n0649_002:0732a02_9"
    },
    {
        "source_sentence": "破怨惡義。",
        "translation": "It's the meaning of destroying enemies and badness.",
        "source": "T15n0649_002:0732a03_10"
    },
    {
        "source_sentence": "「信諸佛轉法輪，通達於如乃至知法，瞋、慢已離，欲泥不染。",
        "translation": "Believing that the buddhas turn the wheel of the Dharma, he comprehends thusness and knows the teaching, parts with anger and conceit, doesn't stain the mud of desire, and doesn't stink.",
        "source": "T15n0649_002:0732a03_11"
    },
    {
        "source_sentence": "調御眾生除去於垢，能以悲水洗於眾生；",
        "translation": "He tames sentient beings and removes dirt. He can wash sentient beings with the water of compassion.",
        "source": "T15n0649_002:0732a05_12"
    },
    {
        "source_sentence": "統領徒眾順得勢力，超過老、死念千數劫；",
        "translation": "He led the assembly of his disciples and gained momentum, going beyond the eons of old age and death for thousands of eons.",
        "source": "T15n0649_002:0732a06_13"
    },
    {
        "source_sentence": "總持法藏通達寂界，得空等智，順學盡法。",
        "translation": "He maintains the store of the Dharma in general, penetrates the realm of quiescence, attains the knowledge of emptiness and so forth, and follows the study of the exhaustion of all dharmas.",
        "source": "T15n0649_002:0732a07_14"
    },
    {
        "source_sentence": "「諸眾生等所應讚歎，滿無障智、得無熱惱，熏習順行摧魔羅軍，蔭覆三千大千世界，",
        "translation": "All sentient beings and so forth should praise him, perfecting unobstructed knowledge and attaining the absence of feverlessness. He perfumes and follows the defeat of Māra’s army and shades the great chiliocosm of the threefold-thousand worlds.",
        "source": "T15n0649_002:0732a08_15"
    },
    {
        "source_sentence": "順念前世，招涅槃地作依止趣，其在家者盡皆覆護。",
        "translation": "He's mindful of the previous life and invites the stage of nirvāṇa to serve as a basis for relying on it, and all those at home are fully protected.",
        "source": "T15n0649_002:0732a10_0"
    },
    {
        "source_sentence": "「知處非處，不捨先誓，於諸眾生以慈遍滿；",
        "translation": "“Great enlightening beings know right and wrong, not giving up their former vows, pervading sentient beings with compassion.",
        "source": "T15n0649_002:0732a11_1"
    },
    {
        "source_sentence": "知聚無生，所念聞意當作正直。",
        "translation": "Knowing that the aggregate is unarisen, what he thinks and hears will be straightforward.",
        "source": "T15n0649_002:0732a12_2"
    },
    {
        "source_sentence": "「得栴檀那戒香，斷生死道，順得涅槃，知諸法如那字觸住。",
        "translation": "Attaining the fragrance of sandalwood precepts, he stops the path of birth-and-death and follows nirvāṇa, knowing that all dharmas are like the tactile abiding of the Sanskrit phoneme thusnas.",
        "source": "T15n0649_002:0732a12_3"
    },
    {
        "source_sentence": "「喜王！",
        "translation": "“O king of joy!",
        "source": "T15n0649_002:0732a14_4"
    },
    {
        "source_sentence": "彼如那字已上無字，彼亦無名、亦不可說、亦無有聲，不施設名、不知名說，",
        "translation": "Likewise, it has no name, cannot be explained, and does not have any sound. It is neither designated by a name nor given an expression.",
        "source": "T15n0649_002:0732a14_5"
    },
    {
        "source_sentence": "彼諸聲言辭中，彼不過去、不未來、不現在，彼諸佛不已說、不今說、不當說，",
        "translation": "In those sounds and words, they aren’t past, future, or present. Those buddhas don’t stop speaking, don’t speak now, and won’t teach.",
        "source": "T15n0649_002:0732a16_6"
    },
    {
        "source_sentence": "不生、不出，如是等相諸法菩薩當知。",
        "translation": "What doesn't arise and what doesn't arise, such are the characteristics of dharmas that bodhisattvas should know.",
        "source": "T15n0649_002:0732a17_7"
    },
    {
        "source_sentence": "「喜王！",
        "translation": "“O king of joy!",
        "source": "T15n0649_002:0732a18_8"
    },
    {
        "source_sentence": "復有十六字陀羅尼所入門，所謂：覺字行相說勝義法、度於四流、說無有名色法、善巧布施、自守住忍、不倚六根、行於六度、令滅欲煩惱故而為眾生說法、巧知諸法差別、得深無疑、說處非處、知諸眾生所行、忍麁惡言、捨皮肉髓、知念意行安住法界、解知那字盡入諸法。",
        "translation": "There are also sixteen-syllable dhāraṇī teachings that are entered into, which are: the character enlightenment teaches the ultimate truth in terms of practice, transcends the four streams, explains the absence of name and form, skillfully bestows generosity, maintains forbearance on oneself, doesn't rely on the six faculties",
        "source": "T15n0649_002:0732a18_9"
    },
    {
        "source_sentence": "喜王！",
        "translation": "King Joy!",
        "source": "T15n0649_002:0732a24_10"
    },
    {
        "source_sentence": "此是十六種字陀羅尼入門。",
        "translation": "These are the sixteen-syllable dhāraṇī entryways.",
        "source": "T15n0649_002:0732a25_0"
    },
    {
        "source_sentence": "「喜王！",
        "translation": "“O king of joy!",
        "source": "T15n0649_002:0732a25_1"
    },
    {
        "source_sentence": "若菩薩摩訶薩正覺如是十六種字陀羅尼入門，如阿字無生義故、波字最勝義故、遮字度四流義故、那字說名色義故、陀字布施自守和合義故、沙字六通智義故、迦字不見業報義故、沙字諸法平等義故、伽字甚深義故、他字示現勢力義故、闍字示現生死義故、叉字示現忍力義故、車字吐極惡煩惱義故、娑摩字自大證覺義故、娑他字說處非處義故、多字說盡邊義故，",
        "translation": "若菩薩摩訶薩正覺如是十六種字陀羅尼入門,如阿字無生義、波字最勝義、遮字度四流義、那字說名色說名色說義、陀字布施自守和合義、沙字六通智義、迦字不見業報故、沙字諸法平等義、伽字甚深義、",
        "source": "T15n0649_002:0732a25_2"
    },
    {
        "source_sentence": "彼則得此說名決定觀察諸法行三摩地。",
        "translation": "They then attain this explanation that it's called the concentration of certainty in observing the practice of dharmas as samādhi.",
        "source": "T15n0649_002:0732b05_3"
    },
    {
        "source_sentence": "「因此十六種字陀羅尼，菩薩摩訶薩不為智者所訶，棄欲、瞋、癡，演說到彼岸道。",
        "translation": "Because of these sixteen-syllable dhāraṇī, the bodhisattva Mahāsattva isn't reprimanded by wise people, abandons desire, anger, and delusion, and explains the path to reaching the other shore.",
        "source": "T15n0649_002:0732b06_4"
    },
    {
        "source_sentence": "得四無畏，受那羅延身，利割欲枝；",
        "translation": "Attaining the four fearlessnesses, he accepted the body of Nārayana and cut off the branches of desire with profit.",
        "source": "T15n0649_002:0732b08_0"
    },
    {
        "source_sentence": "得十力力，值遇妙音；",
        "translation": "They attain the ten powers of enlightenment and encounter subtle sounds.",
        "source": "T15n0649_002:0732b08_1"
    },
    {
        "source_sentence": "得滅熱惱，授聲聞獨覺記，遠離左道；",
        "translation": "He attained cessation of feverish anguish and taught the disciples and solitary enlightened ones to leave the left path.",
        "source": "T15n0649_002:0732b09_2"
    },
    {
        "source_sentence": "得如來地，如所言說、如作即得。",
        "translation": "Attaining the Tathāgata's ground, they attain it just as they say and do.",
        "source": "T15n0649_002:0732b10_3"
    },
    {
        "source_sentence": "「高慢眾生當令解脫，作佛事業，順得聚智；",
        "translation": "“Great enlightening beings will liberate arrogant sentient beings from self-conceit by undertaking buddha-works and following the attainment of collected knowledge.",
        "source": "T15n0649_002:0732b10_4"
    },
    {
        "source_sentence": "疑得眾生斷其疑惑，以有和善共住安樂。",
        "translation": "They doubt that sentient beings will be freed from their doubts and doubts, and they'll live together in peace with harmony and well-being.",
        "source": "T15n0649_002:0732b11_5"
    },
    {
        "source_sentence": "滿足大悲，超摩羅境；",
        "translation": "Fulfilling great compassion, they transcend the realm of the Mallas.",
        "source": "T15n0649_002:0732b12_6"
    },
    {
        "source_sentence": "滿足美音，除慢放逸而得於忍。",
        "translation": "Fulfilling his beautiful voice, he's freed from conceit and attained forbearance.",
        "source": "T15n0649_002:0732b13_7"
    },
    {
        "source_sentence": "善入深定，令度諸趣而為說法；",
        "translation": "They enter profound concentration, liberating beings from all states of existence, and expounding truth.",
        "source": "T15n0649_002:0732b13_8"
    },
    {
        "source_sentence": "於諸法中令得淺處，為住彼岸令到陸處。",
        "translation": "In all dharmas, it causes them to attain a shallow place and makes them reach the land for the sake of staying on the other side.",
        "source": "T15n0649_002:0732b14_9"
    },
    {
        "source_sentence": "「知諸眾生所行、知諸法方便行，念無數劫持諸法體、寂滅諸惡、清淨諸疑、得空等智。",
        "translation": "Knowing what sentient beings practice and knowing the skillful means for practicing the teachings, they'll be mindful of maintaining the essence of the teachings for countless eons, extinguishing badness, purifying doubts, and attaining the knowledge of emptiness.",
        "source": "T15n0649_002:0732b15_10"
    },
    {
        "source_sentence": "順到滅煩惱處，速踐覺場，天龍當讚；",
        "translation": "Going to the place of extinction of defilement, they quickly set out on the terrace of enlightenment, praised by celestial beings and dragons.",
        "source": "T15n0649_002:0732b17_11"
    },
    {
        "source_sentence": "順覺諸智，巧滅燒熱，說諸眾生自體。",
        "translation": "Consistent with awakening cognition, he skillfully extinguishes burning fever and explains the essence of sentient beings.",
        "source": "T15n0649_002:0732b18_12"
    },
    {
        "source_sentence": "食甘露食，斷諸疑睡，捨離隨著所有習氣，以其大悲覆諸眾生，念前宿世，",
        "translation": "Eating the food of ambrosia, they cut off doubts and drowsiness, relinquished all habit energy that accompanied them, covered sentient beings with great compassion, and remembered their past lives.",
        "source": "T15n0649_002:0732b19_13"
    },
    {
        "source_sentence": "見於涅槃功德。",
        "translation": "They see the merit of nirvāṇa.",
        "source": "T15n0649_002:0732b20_14"
    },
    {
        "source_sentence": "「順覺凡夫所行，得密大智，害諸異念，鳴於法螺，令住佛智，超種種相。",
        "translation": "“Concomitant with what ordinary people practice, they attain the esoteric great knowledge that harms different thoughts and sounds the Dharma conch to cause them to abide in buddhahood and transcend various characteristics.",
        "source": "T15n0649_002:0732b21_15"
    },
    {
        "source_sentence": "順覺出生，知眾生處，能使佛剎豐滿，無彼熾然，離於老、病，速能順覺方便密語，",
        "translation": "They are born in accord with enlightenment, knowing the abode of sentient beings, able to cause the Buddha’s buddha-lands to become abundant and without blazing fire. Being freed from old age and illness, they can quickly follow enlightenment and skillfully expound their esoteric teachings.",
        "source": "T15n0649_002:0732b22_16"
    },
    {
        "source_sentence": "斷生死道。",
        "translation": "He stops the path of birth-and-death.",
        "source": "T15n0649_002:0732b24_17"
    },
    {
        "source_sentence": "順到安隱涅槃，於惡摩羅速能降伏，於無量世界中見佛、世尊。",
        "translation": "He's able to quickly subdue evil Māra and see the Buddha and Bhagavān in measureless worlds.",
        "source": "T15n0649_002:0732b24_18"
    },
    {
        "source_sentence": "離欲已而聽法，亦不忘智，如所希望攝取佛剎，巧知遊戲，出生諸三摩地。",
        "translation": "Having become free of desire, they listen to the teaching and don't forget their knowledge, collect buddha-lands as they wish, skillfully know and play, and give rise to samādhis.",
        "source": "T15n0649_002:0732b26_19"
    },
    {
        "source_sentence": "「喜王！",
        "translation": "“O king of joy!",
        "source": "T15n0649_002:0732b28_0"
    },
    {
        "source_sentence": "菩薩摩訶薩若得此說——決定觀察諸法行三摩地——當知亦得薩婆若。",
        "translation": "If bodhisattvas, mahāsattvas, and bodhisattvas who attain this teaching - the concentration of certainly observing the practices of dharmas in samādhi - you should know that they'll also attain sarvajña.",
        "source": "T15n0649_002:0732b28_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0649_002:0732b29_2"
    },
    {
        "source_sentence": "然彼何時欲證阿耨多羅三藐三菩提？",
        "translation": "However, when does he want to realize supreme perfect enlightenment?",
        "source": "T15n0649_002:0732b29_3"
    },
    {
        "source_sentence": "若一生、若二、若三、若四、若五、若十、若二十、若百生、若千生、若百千生、若一劫、若百劫、若千劫、若百千劫，",
        "translation": "If there is one birth, if there are two, if there are three, if there are four, if there are five, if there are ten, if there are twenty, if there are a hundred births, if there are a thousand births, if there are a hundred thousand births, if there are one eon, if there are a hundred eons, if there are a thousand eons, if there are",
        "source": "T15n0649_002:0732c01_4"
    },
    {
        "source_sentence": "乃至欲於久時，彼亦久乃證覺，以願自在於流轉中盡後際劫。",
        "translation": "Even if they want to do so for a long time, they'll also realize awakening after a long time, and their vows will be self-contained in the flow until the end of the final eon.",
        "source": "T15n0649_002:0732c04_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0649_002:0732c05_6"
    },
    {
        "source_sentence": "然後於諸法中自在故。」",
        "translation": "It's because they then have mastery over the teachings.",
        "source": "T15n0649_002:0732c05_7"
    },
    {
        "source_sentence": "又，佛說此陀羅尼字門品法本時，三十二千菩薩得忍。",
        "translation": "Furthermore, when the Buddha taught this dhāraṇī of the characteristics of the dharma-本法本, thirty-two thousand bodhisattvas attained patience.",
        "source": "T15n0649_002:0732c06_8"
    },
    {
        "source_sentence": "彼時此三千大千世界六種振動。",
        "translation": "At the time, these 3,000 great one-thousand worlds were shaken in six ways.",
        "source": "T15n0649_002:0732c07_9"
    },
    {
        "source_sentence": "「無錯、無濁、無穢雜，　　離非趣行到甘露，",
        "translation": "“Without error, without turbidity, and without defilement, They leave the wrong paths and reach the ambrosia of immortality.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　應天地供作無等，　　持此方便十力行；",
        "translation": "The offerings of heaven and earth should be made without equal, maintaining these ten powers of skillful means.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　喜作離怨滅荒塵，　　面如開華人天樂，",
        "translation": "They like to be free from enemies and annihilate the desolate dust. Their countenance is like that of an open-minded Chinese celestial bliss.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　應勝者德度有流，　　持此方便十力行；",
        "translation": "Those who should be victorious have virtue to save those with impurity, Upholding the practice of these ten powers of skillful means.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　除滅他眾善他行，　　人天愛重拂他意，",
        "translation": "Except for extinguishing the good deeds of others, humans and gods love other people’s thoughts.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　分別他行善巧意，　　此道中行十力行。",
        "translation": "The skillful means of discriminating other practices, This path is the practice of the ten powers.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　捨增有取不如行，　　覺察人天如意決，",
        "translation": "Equanimity increases with grasping and non-grasping, perceiving humans and gods according to their wishes.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　行顯亦如空中月，　　此有眼行智者行。",
        "translation": "Practice and manifestation are also like the moon in the sky. This is the practice of the one with vision and wisdom who practices.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　人天常愛彼意者，　　不樂有趣境無錯，",
        "translation": "The humans and gods always love their thoughts, And they do not delight in objects of enjoyment.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　分別百行眾中吼，　　此智者行照諸方；",
        "translation": "Discriminating one hundred practices, he rouses in the midst of assemblies: This wise one practices and illumines all directions.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　得十、二十復有二，　　諸相妍妙人天奉，",
        "translation": "There are two more ways to attain the tenth and twentyth. Their characteristics are beautiful, they are offered by humans and gods.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　得、失不著離二取，　　彼得此行照諸方。",
        "translation": "Attaining and losing without attachment and free of the two grasping, Peter's practice illuminates all directions.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　甘露施主善行施，　　常與勝財世牛王，",
        "translation": "The donor of the ambrosia of immortality is a well-practiced donor who always gives to the worldly cow king with superior wealth.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　十力大力降他力，　　不久得此智者行。",
        "translation": "The great power of the ten powers subdues the powers of others, and soon they'll attain the practice of this wise person.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　分別多德勝念意，　　寂滅多苦與多樂，",
        "translation": "Discrimination of many virtues is superior to mindfulness, extinguishing much suffering and much happiness.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　多人尊重善奉事，　　憙佛功德智學此。",
        "translation": "Many people respect and serve him well, admiring the Buddha's virtue and wisdom as they study this.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　降眾不久如牛王，　　滅百熱惱離諸熱，",
        "translation": "Soon after he descended, like an ox king, He extinguished a hundred feverishers and dispelled the fever.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　飛虛空道多百剎，　　行此方便照諸方。",
        "translation": "Flying in the paths of space, many hundreds of lands, They practice this skillful means to illuminate all directions.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　信處善巧諸世信，　　信慚意住念無等，",
        "translation": "The abode of faith is the skillfulness of worldly faith; Faith, conscience, mind, and thought are unequaled.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　振去百著作世香，　　持此方便百德聚；",
        "translation": "Shaking off the worldly fragrance of a hundred writings, he holds this cluster of skillful means of a hundred virtues.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　分別多德吐三垢，　　彼有潤膩美妙言，",
        "translation": "Discriminating many virtues, he spits out the three defilements, which have nourishing and beautiful words.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　善說百分天地中，　　持此德財勝無等；",
        "translation": "He explains well that in a hundred parts of heaven and earth, Their store of virtue and wealth is peerless.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　度人、天住無畏城，　　振去闇塵如言說，",
        "translation": "He saves people and gods living in the fearless city, shakes away the dust of darkness as he explains it.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　如行無惱行如行，　　持此方便十力行；",
        "translation": "Practice as practice, practice without affliction, practice as practice— They practice these ten powers of skillful means.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　甘露財勝名聞至，　　勝德無等如行得，",
        "translation": "Amṛta's wealth is superior to fame and learning, Their surpassing virtue unequaled as practice attained.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　如意人天如言說，　　智者學此甘露道；",
        "translation": "Supernatural beings and gods, as they speak, The wise learn this path of immortality.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　無塵至處照十方，　　脫慢眾生直無曲，",
        "translation": "Where there is no dust, it illumines the ten directions; Freed from conceit, sentient beings are straightforward and unbending.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　至無畏城離荒慢，　　持此方便十力行；",
        "translation": "To the city of fearlessness, free from vanity and arrogance, They practice these ten powers of skillful means.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　言說善合化人天，　　不憙樂欲憙樂法，",
        "translation": "He speaks well in accord with the teaching of humans and gods, doesn’t delight in desire or craving for phenomena,",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　說作作者說百行，　　學此方便善意者；",
        "translation": "He who teaches the one who creates and teaches the one hundred practices, Who trains in the good intention of this means.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　等意等行淨眾生，　　善合、善美、善行說，",
        "translation": "Pure beings such as the one with equal effort are said to be good-combined, good-looking and good-practicing.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　諸法中巧常與樂，　　行此方便喜甘露；",
        "translation": "Always skillfully bestowing happiness in all things, they practice this method of joy and sweet ambrosia.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　惡摩羅力不久降，　　振去荒垢散三垢，",
        "translation": "The power of the evil Māra will not soon descend, Vibrating to remove the filth and scatter the three defilements.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　行於此地與大財，　　持此方便十力行。",
        "translation": "Practicing here with great wealth, he maintains this practice of the ten powers of skillful means.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　超過惡趣行勝趣，　　象、馬、獸主戲行者，",
        "translation": "They're beyond the bad destinies and travel to the superior destinies, where elephants, horses, and animal kings play and walk.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　讚德持德百德滿，　　不久得此智者行。",
        "translation": "Praising virtue, maintaining virtue and fulfilling a hundred virtues, he'll soon attain the practice of this wise person.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　善巧處行不住有，　　勢力示現決勝力，",
        "translation": "The practice of skillful means does not abide in existence; By their power they show decisiveness.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　至陸住水離諸膩，　　若學此行十力行。",
        "translation": "When he reaches land and stays in water, he's free of greasiness, and if he trains in this practice, he'll practice the ten powers.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　捨城及與村落地，　　捨愛、不愛不樂境，",
        "translation": "He abandons the city and its village lands, relinquishes the objects he loves and dislikes.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　及捨勝樹、捨怨眾，　　智者學此決進力。",
        "translation": "And abandoning superior trees and abandoning enemies, the wise one trains in this power of resolute effort.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　憶念過去多百劫，　　念諸世中生及死，",
        "translation": "I remember many hundreds of eons past, Mindful of birth and death in all worlds.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　及念已先所聞法，　　持此寂靜勝定意；",
        "translation": "And, having thought of the teachings they’ve heard before, They maintain this tranquil and supremely concentrated mind.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　法炬熾然常令有，　　憙法彼施於財法，",
        "translation": "The torch of the Dharma is blazing, always making it possible to have it. If you deceive the Dharma and give it to someone who possesses the Dharma,",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　及持十力所行者，　　持此寂靜勝定意；",
        "translation": "And those who preserve the practice of the ten powers Preserve this tranquil, supremely concentrated thought.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　住舍摩他有慈意，　　寂靜止意寂靜根，",
        "translation": "He who dwells in calmness has compassionate thoughts, Quiet thoughts and quiescent faculties.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　淨戒甜美愛語音，　　當有持此三摩地；",
        "translation": "Pure morality, sweet and pleasing speech and sound, Should be maintained in this concentration.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　喻如犀行無我所，　　得到閑方與閑道，",
        "translation": "It's like a rhinoceros traveling without self and possessions, attaining a peaceful place and a peaceful path.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　離八不閑隨處住，　　持此寂靜勝定意。",
        "translation": "Abiding at leisurely places apart from the eight, he maintains this tranquil and superior concentration of mind.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　於念覺知自性行，　　亦當善巧知盡法，",
        "translation": "Knowing the practice of mindfulness as their own essence, They should also skillfully know all things.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　示現最勝堪忍力，　　於此中學勝義行。",
        "translation": "He manifests the power of forbearance, which is supreme; Here he teaches the practice of ultimate meaning.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　應得諸世所讚歎，　　多百數天當讚彼，",
        "translation": "You should be praised by all the gods of the world, And many hundreds of thousands of gods will praise you.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　作處、作者、作寂靜，　　於此智海親近住。",
        "translation": "The maker, the maker, and the maker of quiescence— Abiding intimately in this ocean of knowledge.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　鳥飛足跡當順行，　　於諸煩惱得寂滅，",
        "translation": "The footprints of birds flying in the sky will follow them, and they’ll attain cessation of all afflictions.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　摩羅不行彼方便，　　此寂難見勤相應。",
        "translation": "Māla doesn't practice that skillful means, and this is associated with the difficulty of seeing quiescence and diligence.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　說決定覺善逝行，　　拔斷有愛作無有，",
        "translation": "He teaches that the practice of certain awakening is the practice of well-gone, Removing craving and making it nonexistent.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　得彼世中常供奉，　　持此寂靜勝定意；",
        "translation": "Attaining constant offerings in those worlds, they maintain this tranquil and supremely concentrated state of mind.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　所應斷者於此淨，　　斷煩惱已照三有，",
        "translation": "The one to be abandoned is pure regarding this. Having abandoned defilement, he illumines the three existences.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　彼作蔭覆遍諸方，　　若持此勝三摩地；",
        "translation": "They provide shade and cover all directions, maintaining this excellent concentration.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　念他所行及自所，　　念已為說如順行，",
        "translation": "Mindful of the actions of others and of one’s own actions, After being mindful, he explains them in accordance with action.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　無慢行體勝者行，　　持此寂靜勝定意。",
        "translation": "The practice of the one who is not conceited because his practice is superior in essence, and he maintains this quiescent, superior concentration.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　有施捨已調伏意，　　善逝所趣速能行，",
        "translation": "Having subdued their minds with generosity and relinquishment, the enlightening beings can quickly go wherever they are.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　施與無畏說無畏，　　此勝上定則便得。",
        "translation": "Giving and fearlessness are said to be fearlessness. This higher absorption acquires it.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　於諸世中當作親，　　錯誤已脫復令解，",
        "translation": "They become intimate in all worlds, Having been freed from error and caused to understand again.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　共集言議有善巧。　　若人修此三摩地，",
        "translation": "If one cultivates this absorption, he or she will be skilled in all matters relating to the body and mind.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　身等金剛全一合，　　速能破散魔羅軍。",
        "translation": "The body and so forth of the vajra are all combined into one, which can quickly defeat Māra's army.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　純白淨照無有垢，　　持此寂靜勝定意，",
        "translation": "Pure white, pure, shining without stain, He maintains this tranquil, supremely concentrated mind.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　是處而住處所應，　　於處不住上意得；",
        "translation": "Where they abide and where they should be, They don’t abide in higher mental attainment.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　於處、非處有善巧，　　若此定意人能持，",
        "translation": "With skillful means regarding the possible and impossible, If one can maintain it with these men of concentration.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　無著辯說佛功德，　　出生俱致多覺解；",
        "translation": "Unattached, they eloquently explain the virtues of buddhahood Producing all kinds of enlightened understanding.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　彼無疑惑不正意，　　此勝寂定有能持，",
        "translation": "They have no doubts or doubts, and no incorrect thoughts. This absorption of ultimate quiescence has the power to sustain them.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　於彼甘露速能信，　　亦常信於與樂者；",
        "translation": "Being able to quickly believe in the ambrosia of that nectar, they also always believe in those who give it happiness.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　得到果已護他世，　　此勝寂定有能持，",
        "translation": "Having attained the fruit, they protect others. This absorption of exalted quiescence is capable of sustaining it.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　解知於聚常自空，　　彼無錯誤無迷惑；",
        "translation": "Understanding that aggregates are always self-empty, They have no error or confusion.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　諸行行到三有中，　　若人持此三摩地，",
        "translation": "If someone maintains this concentration, they'll reach the three realms of existence.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　當得捨離於老、病，　　不被他降巧為直；",
        "translation": "They will attain freedom from old age and sickness, And skill in not being subjugated by others as straightforward.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　其心相續憙持戒，　　若此定意人能持，",
        "translation": "If a person in this absorption is able to keep the precepts by means of his mind, He will not be reborn again and again.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　割斷生樹是聖道，　　涅槃寂靜速能觸；",
        "translation": "Cutting and cutting down growing trees is the holy path; The tranquility of nirvana can quickly touch them.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　彌黎車地彼不多，　　若人持此三摩地，",
        "translation": "Maitreya's ground is not many of them, but if someone holds this concentration,",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　不自讚揚巧妙語，　　功德名稱上普德。",
        "translation": "They don't praise themselves for their skillful speech, and their virtue is called the supreme universal virtue.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　端正顯現眾中入，　　如昴宿月月淨空，",
        "translation": "Like the constellations of the Pleiades, moons, and moon are pure space.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　眷屬、眾具、家姓名，　　善逝親眷彼時得，",
        "translation": "Their retinues, the necessities, and the names of their families are obtained at that time by the well-gone relatives.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　彼所有辯如水王，　　謂當持此三摩地。",
        "translation": "Their eloquence is like that of the water king, meaning they'll maintain this concentration.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　法自性相無我行，　　於諸世中順覺已，",
        "translation": "The self-nature of things, their characteristics, and the absence of self— Having been enlightened in all worlds, they become aware:",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　速作三千勇健主，　　此經希有平等行。",
        "translation": "Quickly become the 3,000 brave heroic lords, for rare is this sūtra's equal practice.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　乃至三千世中林，　　人姓三種眾生行，",
        "translation": "Up to 3,000 worlds in the middle forest, The three kinds of sentient beings’ castes and actions.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　於彼勝上得智門，　　此勤相應觸甘露。",
        "translation": "In that superior approach of attaining knowledge, this is associated with diligence and touching the ambrosia.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　毒、刀及火不行入，　　不畏枷縛諸逼惱，",
        "translation": "They won’t enter with poison, swords, or fire; They won’t fear being bound by fetters and oppressed.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　夜叉、羅剎不生害，　　若淨信心此相應。",
        "translation": "The yakṣas and rājas won't harm them if they have pure faith, which is associated with this.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　財無所失、財不離，　　無病、無憂、無業報，",
        "translation": "Their possessions are not lost, and their possessions are not separated; They have no sickness, no sorrow, and no results of action.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　不盲、不瞎亦不瘂，　　如是有持此四句。",
        "translation": "Not blind, not blind, and not deaf, he doesn't see, thus maintaining these four phrases.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　六十三億二足上，　　普念於此相應者，",
        "translation": "On sixty-three billion two-legged feet, he's mindful of all the people associated with this.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　彼所若與總持藏，　　此寂難見已相應。",
        "translation": "If it's associated with the general store of maintaining, this is quiescence that's difficult to see.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　若於菩提欲疾觸、　　最安隱德若欲取，",
        "translation": "If someone wants to quickly touch enlightenment and wants to grasp the most peaceful virtue,",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　應令此勝經典行，　　諸所希望則滿足。",
        "translation": "You should cause this excellent scripture to be practiced, and all your wishes will be fulfilled.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　彼故聞已善喜樂，　　若人於中求菩提，",
        "translation": "That's why they hear it well and rejoice, and if someone seeks enlightenment there,",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　彼勤相應若四日，　　彼當得此勝寂定。",
        "translation": "If it's associated with diligence for four days, they'll attain this superior tranquil concentration.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　八十俱致二足上、　　餘勝六十那由多，",
        "translation": "At the top of the two feet with eighty koṭis, The remaining one is superior by sixty nayutas.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　普念與此相應者，　　轉誦作此三摩地。",
        "translation": "To those who are universally mindful and associated with this, he recites this samādhi.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　若聞於此善得利，　　聞已若有作信解，",
        "translation": "If someone hears about this, they’ll well attain its benefits, and after hearing it, if they have faith and understanding,",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　佛功德中彼無惑，　　如到菩提如是持。",
        "translation": "Among the Buddha's virtues, they are without confusion, thus attaining enlightenment and thus maintaining it.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　彼故聞已此實行，　　莫得嬾惰憙無德，",
        "translation": "Therefore, after hearing this true practice, they won’t attain idleness or laziness with no virtue.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　諸福決定到手中，　　若持此經、若書寫。",
        "translation": "The merits will surely reach their hands if they hold this sūtra or write it.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　我念於先百數劫，　　有最勝者名辯幢，",
        "translation": "For hundreds of thousands of eons ago, I remembered that there was a supreme one called the Banner of eloquence.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　彼說此勝三摩地。　　王子月妙聞彼已，",
        "translation": "When the prince Candracchattra heard this discourse he was overjoyed and said,",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　疾捨王位而出家，　　彼聞一夜及一日，",
        "translation": "He quickly relinquished his royal throne and renounced the householder’s life. Having heard this for one night and one day,",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　於彼分中死時到，　　至餘剎土而復生。",
        "translation": "When the time of death arrives in those parts, they'll be born again in other buddha-lands.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　如恒伽沙復多彼，　　見已復見無邊勝，",
        "translation": "Like the sands of the Ganges, there are many others; Having seen them, they also see boundless superiority.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　諸處聞此三摩地，　　於三劫中證勝覺，",
        "translation": "Hearing this concentration, they attain supreme enlightenment in three eons.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　名曰寶炎最勝者，　　勝者然燈為說記。",
        "translation": "He's called the most superior of the jeweled flames, and the best is explained by Randana.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　如是大利由聞此，　　彼故聞已莫嬾惰。",
        "translation": "Such great benefits are the result of hearing this, so they therefore don't become lazy after hearing it.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　我今欲作告汝等，　　天人所有美妙音，",
        "translation": "I now want to tell you about the beautiful sounds of gods and humans.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "　我於此中開寶藏，　　十力財物汝當取。",
        "translation": "Here, I'll open a store of treasure, and you'll take the possessions of the ten powers.",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "爾時，世尊說此歌頌：「又，喜王！",
        "translation": "It was then that the Bhagavān spoke this verse, Furthermore, King Joy!",
        "source": "T15n0649_002:0732c08_10"
    },
    {
        "source_sentence": "先過去世不可數劫、過不可數廣遠、無量不可思不可量，於彼時節有佛名辯才瓔珞莊嚴雲鳴出吼顯音如來、應、正遍知出世，",
        "translation": "In an uncountable eon in the past, beyond an uncountable number of eons and a great distance away, immeasurable, infinite, inconceivable, and immeasurable, there was a buddha named eloquence diadem adorned by clouds called emanating roar that manifested the Tathāgata, Arhat, Perfectly Enlightened One",
        "source": "T15n0649_002:0734a05_11"
    },
    {
        "source_sentence": "明行具足、善逝、世間解、無上調御丈夫、天人教師、佛、婆伽婆。",
        "translation": "It explains the practice of being fully endowed, well-gone, worldly understanding, unsurpassed taming men, teachers of gods and humans, buddhas, and Bhagavān.",
        "source": "T15n0649_002:0734a08_12"
    },
    {
        "source_sentence": "其佛剎土名無邊寶功德莊嚴，世界名無垢，劫名愛見。",
        "translation": "The Buddha's land is called Boundless Jewel Array of Merit, the world is called Immaculate, and the eon is called Lovely Vision.",
        "source": "T15n0649_002:0734a09_13"
    },
    {
        "source_sentence": "「又，喜王！",
        "translation": "Furthermore, King Joy!",
        "source": "T15n0649_002:0734a10_14"
    },
    {
        "source_sentence": "彼辯才瓔珞莊嚴雲鳴出吼顯音如來、應供、正遍知有無量聲聞、有七十二俱致菩薩摩訶薩——並皆得忍到灌頂地。",
        "translation": "Those eloquent-minded, jewelry-adorned clouds of adornment called out a roar and show the Tathāgata, Worthy of Offerings, Perfectly Enlightened, with measureless śrāvakas, and seventy-two koṭī bodhisattvas and mahāsattvas - all attained the stage of forbearance and arrived at the consecration",
        "source": "T15n0649_002:0734a10_15"
    },
    {
        "source_sentence": "「又，喜王！",
        "translation": "Furthermore, King Joy!",
        "source": "T15n0649_002:0734a13_16"
    },
    {
        "source_sentence": "於彼菩薩眾中有菩薩說法者，名無邊功德辯幢遊戲鳴音，彼有過量念行慚辯，",
        "translation": "Among those bodhisattvas, there's a bodhisattva who teaches the Dharma in an assembly called the boundlessly virtuous eloquence-banner playing and sounding. That person has excessive mindfulness and shameful eloquence",
        "source": "T15n0649_002:0734a13_17"
    },
    {
        "source_sentence": "於陀羅尼中遊步盡至得五通智。",
        "translation": "In the dhāraṇī, he travels all the way up to the point where he attains the five supernormal knowledges.",
        "source": "T15n0649_002:0734a15_18"
    },
    {
        "source_sentence": "彼白彼佛令其觀已，為四部眾廣說此說決定觀察諸法行三摩地。",
        "translation": "After he told the Buddha to cause them to observe it, he explained this extensively for the four groups of people who practiced samādhi of certainty observing all dharmas.",
        "source": "T15n0649_002:0734a16_19"
    },
    {
        "source_sentence": "「又，喜王！",
        "translation": "Furthermore, King Joy!",
        "source": "T15n0649_002:0734a17_20"
    },
    {
        "source_sentence": "於彼時節有王子名福報清淨多人所愛鳴聲自在，而彼妙形端正可觀，最勝淨色成滿具足，",
        "translation": "At the time, there was a prince named Puṣkarasārin, pure in virtue and purity liked by many people who could make sounds freely, yet his marvelous form was beautiful and handsome to be seen, most excellent and endowed with pure form.",
        "source": "T15n0649_002:0734a18_21"
    },
    {
        "source_sentence": "於無上正覺中久已發行。",
        "translation": "It's been released for a long time in the midst of unsurpassed perfect enlightenment.",
        "source": "T15n0649_002:0734a20_22"
    },
    {
        "source_sentence": "「喜王！",
        "translation": "“O king of joy!",
        "source": "T15n0649_002:0734a20_23"
    },
    {
        "source_sentence": "福報清淨多人所愛鳴聲自在王子，聞有無邊功德辯幢遊戲鳴音菩薩說法者說此名決定觀察諸法行三摩地——若入村城、聚邑、王都中說。",
        "translation": "The prince who hears the boundlessly virtuous, eloquent, playful, and sounding voice of the bodhisattva preaching the Dharma is called the Samādhi of Certainly Observing the Practices of the Dharmas-if he enters a village, city, town, or king's capital to preach it.",
        "source": "T15n0649_002:0734a20_24"
    },
    {
        "source_sentence": "「時彼王子於彼說法者邊聞此三摩地，聞已歡喜踊躍，愛悅滿意，善意更生。",
        "translation": "“The prince then listened to this concentration at the side of the Dharma preacher, and after hearing it, he rejoiced and jumped for joy. Delighted and delighted, his good intentions arose again.",
        "source": "T15n0649_002:0734a24_25"
    },
    {
        "source_sentence": "詣向彼說法者菩薩摩訶薩所，到已頂禮彼說法者足，尊重愛敬，合掌而住。",
        "translation": "He approached the bodhisattva Mahāsattva who taught the Dharma to him, bowed his head at his feet, respected and venerated him, joined his palms, and stood there.",
        "source": "T15n0649_002:0734a25_26"
    },
    {
        "source_sentence": "於此三摩地中復過量喜欲聞此三摩地，彼說法者復知彼過量淨信已，彼時廣說此三摩地。",
        "translation": "In this samādhi, he's also overweeningly delighted to hear this samādhi, and the Dharma preacher knows that he has overweening pure faith, and he then explains this samādhi in detail.",
        "source": "T15n0649_002:0734a27_27"
    },
    {
        "source_sentence": "「喜王！",
        "translation": "“O king of joy!",
        "source": "T15n0649_002:0734a29_28"
    },
    {
        "source_sentence": "如是，彼王子於彼說法者邊聞此三摩地已，又復過量歡喜踊躍，愛悅滿意，",
        "translation": "“In the same way, when that prince had heard these concentrations at the side of those who were expounding the doctrine to him, he was overjoyed and jumped for joy. He was delighted and pleased.",
        "source": "T15n0649_002:0734b01_0"
    },
    {
        "source_sentence": "善意更生。",
        "translation": "Good intentions will arise again.",
        "source": "T15n0649_002:0734b02_1"
    },
    {
        "source_sentence": "隨所著衣而以奉覆，說如是言：『令諸眾生得此三摩地寶。』",
        "translation": "He follows the robe he's wearing and covers it with it, saying, 'May all sentient beings attain this samādhi treasure.'",
        "source": "T15n0649_002:0734b02_2"
    },
    {
        "source_sentence": "如此說法者菩薩摩訶薩，彼以於彼說法者所捨施善根，於現法中承事八十恒伽河沙等諸佛、世尊，",
        "translation": "“Thus does the great bodhisattva Mahāsattva who teaches the Dharma like this give away the roots of goodness he gives to those who teach the Dharma, and in the present life serve as many buddhas and world-honored ones as there are grains of sand in eighty Ganges Rivers.",
        "source": "T15n0649_002:0734b04_3"
    },
    {
        "source_sentence": "於彼諸佛、世尊邊聞此三摩地，彼諸佛、世尊所皆作最勝供養，於彼諸佛、世尊教法中出家攝受正法，",
        "translation": "Those buddhas and world-honored ones who hear this concentration at the side of those buddhas and world-honored ones all make the most excellent offerings to those buddhas and world-honored ones, leaving home and taking in the right teaching from the teachings of those buddhas and world-honored ones.",
        "source": "T15n0649_002:0734b06_4"
    },
    {
        "source_sentence": "諸所不聞百千俱致修多羅而能辯說，生念常滿，受變化生得五通智、得陀羅尼無著辯才。",
        "translation": "Those who haven't heard the hundreds of thousands of koṭis of sūtras and can eloquently explain them, give rise to thoughts that are always filled, experience transformations that give rise to the five supernormal knowledges and attain dhāraṇī without attachment or eloquence.",
        "source": "T15n0649_002:0734b08_5"
    },
    {
        "source_sentence": "彼順次第行諸助菩提法滿已，於無邊功德寶莊嚴佛剎中證覺阿耨多羅三藐三菩提，",
        "translation": "Having fulfilled the teachings of enlightenment, they practiced in order and realized unexcelled complete perfect enlightenment in the buddha-lands adorned with jewels of infinite virtue.",
        "source": "T15n0649_002:0734b10_6"
    },
    {
        "source_sentence": "壽量無量、聲聞眾無量、菩薩眾無量、光明無量、願功德莊嚴無量。",
        "translation": "Their lifespans are immeasurable, the number of śrāvakas is immeasurable, the number of bodhisattvas is immeasurable, the light is immeasurable, and the adornment of their vows is immeasurable.",
        "source": "T15n0649_002:0734b12_7"
    },
    {
        "source_sentence": "「又，喜王！",
        "translation": "Furthermore, King Joy!",
        "source": "T15n0649_002:0734b14_8"
    },
    {
        "source_sentence": "彼時節中有名無邊功德辯幢遊戲鳴音說法者，汝意莫作異見。",
        "translation": "At that time, there's an infinite number of people who teach the Dharma with boundless virtues, eloquent banners, and playful sounds at those times, so don't make any different views in your mind.",
        "source": "T15n0649_002:0734b14_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0649_002:0734b16_10"
    },
    {
        "source_sentence": "喜王！",
        "translation": "King Joy!",
        "source": "T15n0649_002:0734b16_11"
    },
    {
        "source_sentence": "彼大眼如來是也，不動如來為記菩提。",
        "translation": "That's the Tathāgata of the Great Eye, the Akṣobhya Tathāgata who predicts enlightenment for him.",
        "source": "T15n0649_002:0734b16_12"
    },
    {
        "source_sentence": "「又，彼王子名福報清淨多人所愛鳴聲自在者，彼無量壽如來即是彼時王子也。",
        "translation": "Furthermore, that prince named Puṣkarasārin and purified by the virtues of his fortune who's beloved by many people and whose voice is unimpeded when he sings, that Tathāgata of Immeasurable Life is the prince of that time.",
        "source": "T15n0649_002:0734b17_13"
    },
    {
        "source_sentence": "「又，喜王！",
        "translation": "Furthermore, King Joy!",
        "source": "T15n0649_002:0734b19_14"
    },
    {
        "source_sentence": "彼王子聞此三摩地已，七十千劫業障皆悉滅盡，即得分別諸法句品、出無邊門名陀羅尼、及不遠離三摩地、乃至菩提場。",
        "translation": "After hearing this concentration, that prince's karmic hindrances for 70,000 eons were completely extinguished, and he then attained the discernment of the chapter on the Dharma-phrase Chapter, the name dhāraṇī of the infinite approach called dhāraṇī, the concentration not far from samādhi, and even the site of enlightenment.",
        "source": "T15n0649_002:0734b19_15"
    },
    {
        "source_sentence": "「喜王！",
        "translation": "“O king of joy!",
        "source": "T15n0649_002:0734b22_16"
    },
    {
        "source_sentence": "彼因緣故，如是當知：此三摩地於諸菩薩摩訶薩所如是多作淨諸業障轉、莊嚴淨剎功德轉、速滿佛法轉。",
        "translation": "Because of these causes and conditions, it should be known that this samādhi thus often creates pure karmic hindrances for bodhisattvas, adorns the virtues of pure buddha-lands, and quickly fulfills the Buddha's teachings.",
        "source": "T15n0649_002:0734b22_17"
    },
    {
        "source_sentence": "「又，喜王！",
        "translation": "Furthermore, King Joy!",
        "source": "T15n0649_002:0734b24_18"
    },
    {
        "source_sentence": "先過去世不可數劫、過不可數廣遠、無量不可思不可量，於彼時節有名淨面無垢月妙威藏如來、應、正遍知出世，",
        "translation": "In an uncountable number of eons in the past, beyond an uncountable number of eons, long and wide, immeasurable and immeasurable, there was a Tathāgata, Arhat, Perfectly Enlightened One named Pure-eyed, undefiled-faced, Immaculate-Moon Wonderfully Majestic Treasury appearing in the world",
        "source": "T15n0649_002:0734b25_19"
    },
    {
        "source_sentence": "明行具足、善逝、世間解、無上士、調御丈夫、天人教師、佛、婆伽婆。",
        "translation": "It explains the practice of being fully endowed, well-gone, worldly understanding, unsurpassed person, taming men, teachers of gods and humans, buddhas, and Bhagavān.",
        "source": "T15n0649_002:0734b27_20"
    },
    {
        "source_sentence": "「又，喜王！",
        "translation": "Furthermore, King Joy!",
        "source": "T15n0649_002:0734b29_21"
    },
    {
        "source_sentence": "彼淨面無垢月妙威藏如來、應、正遍知所有佛剎功德莊嚴，我今不可一劫廣說，",
        "translation": "The adornments of the buddha-lands of those buddhas, which are the abodes of the Tathāgatas, Arhats, and Perfectly Enlightened Ones, as well as the virtues of their buddha-lands, cannot be described in detail for an eon.",
        "source": "T15n0649_002:0734b29_22"
    },
    {
        "source_sentence": "乃有如是無量功德莊嚴聚集，佛剎清淨，菩薩摩訶薩眾於佛法中皆悉決定。",
        "translation": "Thus, there's an immeasurable accumulation of such merit and adornment, a buddha-stage that's pure, and the bodhisattvas, mahāsattvas, and multitudes of bodhisattvas are all certain about the Buddha's teaching.",
        "source": "T15n0649_002:0734c02_23"
    },
    {
        "source_sentence": "「喜王！",
        "translation": "“O king of joy!",
        "source": "T15n0649_002:0734c03_24"
    },
    {
        "source_sentence": "於彼時節有長者子名曰顯妙廣身。",
        "translation": "At the time, there was an elderly man named Xianzhuangbo.",
        "source": "T15n0649_002:0734c04_0"
    },
    {
        "source_sentence": "彼詣淨面無垢月妙威藏如來所，到已頂禮彼世尊足，即以無量摩尼寶珠、瓔珞百千間錯奉覆彼佛，",
        "translation": "Having arrived there, he bowed his head at the Buddha’s feet and presented to him a hundred thousand patches of pearls, jewelry, and jewel ornaments made of various precious substances.",
        "source": "T15n0649_002:0734c04_1"
    },
    {
        "source_sentence": "在前而住，以欲法故。",
        "translation": "They abide in the prior ones because of the factors arising from sexual passion.",
        "source": "T15n0649_002:0734c07_2"
    },
    {
        "source_sentence": "彼如來知彼淨信已，於此三摩地初、中、後廣說。",
        "translation": "Knowing their pure faith, the Tathāgata explains it in detail at the beginning, middle, and end of this concentration.",
        "source": "T15n0649_002:0734c07_3"
    },
    {
        "source_sentence": "「喜王！",
        "translation": "“O king of joy!",
        "source": "T15n0649_002:0734c08_4"
    },
    {
        "source_sentence": "如是，彼長者子於彼佛邊聞此三摩地已，歡喜踊躍，愛悅滿意，善意更生，",
        "translation": "“In the same way, when that wealthy man’s son had heard these concentrations at the Buddha’s side, he was delighted and jumped for joy. Delighted and happy, his good intentions arose again.",
        "source": "T15n0649_002:0734c08_5"
    },
    {
        "source_sentence": "得大法力；",
        "translation": "They attain great power of the Teaching.",
        "source": "T15n0649_002:0734c10_6"
    },
    {
        "source_sentence": "得法力已，不用求天人中。",
        "translation": "Having attained the power of the Dharma, they don't need to seek among gods or humans.",
        "source": "T15n0649_002:0734c10_7"
    },
    {
        "source_sentence": "彼七十千婦女捨已、普一踰闍那四大藏無邊寶滿捨已、八百園林捨已、諸所受用眾具捨已，",
        "translation": "Having abandoned these seventy-thousand women, having abandoned the four great stores of infinite jewels of the storehouses of all buddha-fields that are one yojana in number, having abandoned the eight hundred groves and forests, and having abandoned the various requisites they had received and used, she said:",
        "source": "T15n0649_002:0734c11_8"
    },
    {
        "source_sentence": "於彼世尊教中剃除鬚髮，著袈裟衣，以信出家非家而行。",
        "translation": "In the Bhagavān's teaching, he shaved his hair and beard, put on the reddish-brown robes, left home because of faith, and didn't go home.",
        "source": "T15n0649_002:0734c13_9"
    },
    {
        "source_sentence": "「又，喜王！",
        "translation": "Furthermore, King Joy!",
        "source": "T15n0649_002:0734c14_10"
    },
    {
        "source_sentence": "彼長者子先在家時，地不敷衣不曾足蹈。",
        "translation": "When that wealthy man's son was at home before, he didn't spread his robe on the ground or step on it.",
        "source": "T15n0649_002:0734c15_11"
    },
    {
        "source_sentence": "既行出家已，十千歲中仍不敷衣足不蹈地，中不坐、不臥，唯除食受用時；",
        "translation": "For the remaining 10,000 years after leaving household life he does not spread his clothes, feet, or step on the ground. He neither sits nor lies [in the water] except when he eats and uses it.",
        "source": "T15n0649_002:0734c16_12"
    },
    {
        "source_sentence": "十千歲中睡眠不入，乃至於彈指頃亦不曾分別欲、分別瞋、分別害；",
        "translation": "At the age of ten thousand years they do not sleep and do not enter. They never discriminate desire, hatred, or inflict harm even as long as they snap their fingers.",
        "source": "T15n0649_002:0734c17_13"
    },
    {
        "source_sentence": "十千歲中異心不生，唯於遍智相應發行精進，得諸辭聲、攝諸佛語名陀羅尼、成就普音入門名陀羅尼。",
        "translation": "For 10,000 years, a different mind doesn't arise, but he produces exertion associated with pervasive wisdom to attain the names of words and sounds that gather in the words of the buddhas, which are called dhāraṇī names, and accomplishes the names of the dhāraṇī names for the universal sound-entry approach.",
        "source": "T15n0649_002:0734c19_14"
    },
    {
        "source_sentence": "彼如是熾然精進具足，乃有六十那由多天於彼菩薩所勤行給侍，起作相應，",
        "translation": "When they were thus endowed with such fervor and energy, there were 60 billion gods who diligently served those bodhisattvas in the assembly.",
        "source": "T15n0649_002:0734c21_15"
    },
    {
        "source_sentence": "令其身心安樂，精進堪能。",
        "translation": "He causes his body and mind to be at ease, and he's capable of exerting effort.",
        "source": "T15n0649_002:0734c23_16"
    },
    {
        "source_sentence": "「彼如是行出家已熾然精進，聞此三摩地故，九十九俱致百千劫流轉皆悉背捨，",
        "translation": "Having thus practiced and renounced the householder’s life, they will make fervent effort. As soon as they hear this concentration of absorption, they will turn away from it for ninety-nine hundred and one thousand kalpas in succession.",
        "source": "T15n0649_002:0734c24_17"
    },
    {
        "source_sentence": "現在值遇七十千佛；",
        "translation": "In the present I have met seventy thousand buddhas.",
        "source": "T15n0649_002:0734c25_18"
    },
    {
        "source_sentence": "於諸處中行出家已，此三摩地持、讀、思惟、為他廣說。",
        "translation": "After practicing renunciation in various places, he maintains this concentration of absorption, reads, contemplates, and explains it extensively for others.",
        "source": "T15n0649_002:0734c26_19"
    },
    {
        "source_sentence": "彼發行精進故、不放逸行故，成就此三摩地，於八劫中證覺阿耨多羅三藐三菩提，",
        "translation": "Because they produce this concentration because of their effort and the practice of nonfrivolity, they accomplish this concentration and realize unexcelled complete perfect enlightenment in eight eons.",
        "source": "T15n0649_002:0734c27_20"
    },
    {
        "source_sentence": "逮得如是佛剎功德莊嚴相住，如彼世尊——淨面無垢月妙威藏如來——所有剎土。",
        "translation": "They'll attain such a mark of the Buddha's buddha-lands, which are adorned with the merits and characteristics of these buddha-lands as the Bhagavān - the Tathāgata of the Marvelous Majestic Treasury of the Immaculate Moon of the Pure Face of the Buddha - possesses all the buddha-lands.",
        "source": "T15n0649_002:0734c29_21"
    },
    {
        "source_sentence": "「我今見彼於南方分中四十四百千佛剎過已，名大莊嚴世界，彼中作佛，",
        "translation": "“Now I see that in the southern quarter, past four hundred and forty-four thousand buddha-lands, there is a great adorned world called Mahāprajñāpāramitā, which will become a buddha.",
        "source": "T15n0649_002:0735a02_22"
    },
    {
        "source_sentence": "有名善意憙樂如來說法，無量菩薩摩訶薩眾集數不可盡。",
        "translation": "There are countless bodhisattvas and mahāsattvas who have good intentions and delight in the Tathāgata's teaching of the Dharma, and there are countless collections of bodhisattvas and mahāsattvas that can't be exhausted.",
        "source": "T15n0649_002:0735a03_23"
    },
    {
        "source_sentence": "「喜王！",
        "translation": "“O king of joy!",
        "source": "T15n0649_002:0735a05_24"
    },
    {
        "source_sentence": "彼諸菩薩摩訶薩若欲速於諸法隨順得自在者，此三摩地當聞、當持、當說、當念。」",
        "translation": "If those bodhisattvas, mahāsattvas, want to quickly follow the teachings and attain mastery over them, these samādhis will be heard, maintained, explained, and thought of.",
        "source": "T15n0649_002:0735a05_25"
    },
    {
        "source_sentence": "「我念先世無邊劫，　　猶如恒伽沙無量，",
        "translation": "I remember the boundless eons of past lives, Like the infinity of the sands of the Ganges River.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　時有智者世間導，　　辯才鳴聲諸方聞。",
        "translation": "At the time, there was a wise man who guided the world, and his eloquence sounded in all directions.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼勝教中有比丘，　　持法智人說法者，",
        "translation": "In that ultimate teaching, there's a monk who preserves the Dharma and teaches it to people of wisdom.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　此寂靜定彼說已，　　王子已於彼邊聞，",
        "translation": "Having explained this concentration of tranquility, the prince has already heard it from that side.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　即以自衣而奉覆，　　迴向最勝菩提道，",
        "translation": "They cover themselves with their own robes And dedicate them to the supreme path of enlightenment.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　復見無邊諸導師，　　得道彼號無量命。",
        "translation": "Again, they see boundless guides who attain the path and are called Immeasurable Life.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼先所有慧作業，　　皆盡無餘、無報果，",
        "translation": "All the previous deeds of wisdom and knowledge They have all done, with no residue or retribution.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　聞此大妙三摩地，　　有辯才者具功德。",
        "translation": "Hearing this great subtle concentration, those with eloquence will be endowed with virtue.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼於後時中，　　若有欲求道，",
        "translation": "At a later time, if they want to pursue the path,",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　應當聞此定，　　諸惡自當除。",
        "translation": "You should hear this concentration, and your evil will be removed on its own.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　又佛無垢月，　　說此三摩地，",
        "translation": "Furthermore, the Buddha unsullied moon teaches this concentration:",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　長者子聞已，　　即取行出家。",
        "translation": "After hearing this, the wealthy man's son took his practice and left home.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼於十千年，　　思惟三摩地，",
        "translation": "For ten thousand years, he contemplated the concentration of concentration,",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　足不蹈無衣、　　亦不入眠寢。",
        "translation": "They don't walk with their feet without clothing, and they don't enter sleep or sleep.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　此得勝菩提，　　唯有共聽故，",
        "translation": "This is the only way to attain supreme enlightenment, because it's heard together.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　不愛於家中、　　亦無欲財物。",
        "translation": "They don't love their home, and they don't have desire for property.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼至諸佛剎，　　於彼皆已聞，",
        "translation": "They go to all the buddha-lands And have heard them all.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　諸行所入門，　　順覺已不久。",
        "translation": "It won't be long before the practices enter the approach of following awakening.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　其心彼先滿、　　亦滿彼意車，",
        "translation": "Their minds are fulfilled by them first, and they also fulfill their mental chariot.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼速得菩提，　　此何不勤作？",
        "translation": "If they quickly attain enlightenment, why don't they diligently work here?",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　後時當來世，　　多有求菩提，",
        "translation": "In the future, many will seek enlightenment.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　無資財無樂、　　不欲行出家、",
        "translation": "They have no possessions and no happiness, And do not want to leave home.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　瞋罵而叱責、　　毀辱說惡語，",
        "translation": "Being angry and scolded, they scold and rebuke, disparaging and speaking harsh words.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　各各共聞已，　　而言：『當作佛。』",
        "translation": "Each of them heard it together, saying, 'I'll become a buddha.'",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　千數非一苦，　　忍受為欲故，",
        "translation": "Thousands of pains are not one and the same: because patience is craving.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　為愛欲作奴，　　而言：『當作佛。』",
        "translation": "For the sake of being a slave, he says, 'I'll become a buddha.'",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　夢中見佛已，　　彼暫得蘇息，",
        "translation": "Seeing the Buddha in a dream, they’ll be able to rest for a while.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　於他當欺慢，　　菩提我不疑。",
        "translation": "They will be deceived by others, and I won't doubt enlightenment.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　此經彼聞已，　　言聲不會義，",
        "translation": "Having heard this sutra, they don’t understand its meaning with words or sounds.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　而蘇息自心，　　不久當作佛。",
        "translation": "He calms his own mind and soon becomes a buddha.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼等聞此實，　　若所聞此已，",
        "translation": "They hear this true teaching, and if they hear it,",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼無有所著，　　亦如空中風。",
        "translation": "They don't have any attachment, and they're like the wind in the sky.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　有此出家已，　　多有求菩提，",
        "translation": "Having renounced the householder’s life, Many of them seek enlightenment.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　為知識故瞋，　　各各而生起。",
        "translation": "Because of their knowledge, anger arises in each and every one.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼貧窮少福，　　限聞即喜樂，",
        "translation": "Those who are poor and have little merit, limited by hearing, rejoice when they hear.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　於他有欺心，　　我到菩提岸。",
        "translation": "Being deceived by others, I'll reach the shore of enlightenment.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　見光得界已，　　眾生而供養，",
        "translation": "Having seen the light and attained the realm, They make offerings to sentient beings.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　以此少等喜，　　知當到菩提。",
        "translation": "Because of this little joy, they know they'll attain enlightenment.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼菩提大遠，　　若嫉妬、諂曲，",
        "translation": "Their enlightenment is greatly distant, and if they're jealous or flattering,",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　我到智數數，　　大遠最勝者。",
        "translation": "World-Honored One, I am the one who has attained wisdom innumerable times. Among the great and distant [realms] most superior.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　聞此經典已，　　知當得菩提，",
        "translation": "Having heard this scripture, They know they will attain enlightenment.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　見無量壽剎，　　作佛當不久。",
        "translation": "Seeing the buddha of immeasurable life, he'll become a buddha soon.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　大遠彼菩提，　　依止有得見，",
        "translation": "A great distance away from that enlightenment, there's a view of attaining it based on dependence.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　心若不相應，　　我當不記彼。",
        "translation": "If they aren't associated with mind, I won't remember them.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　及此長者子，　　財聚已捨離，",
        "translation": "And this wealthy man’s children, Having abandoned the store of their riches,",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　於後出家已，　　後著乞食家。",
        "translation": "Having renounced the householder’s life later, He stayed at a house for almsfood.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　如此三摩地，　　於先然燈所，",
        "translation": "Thus, in this concentration, he's at the place where the lamp is first lit.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　若聞好當作，　　不復渴愛生。",
        "translation": "If someone hears about good deeds, they no longer crave them.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼剃髮出家，　　繫縛知識利，",
        "translation": "They leave home because they're bound to the benefits of knowledge.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　海中取麻擔，　　而捨於珍寶。",
        "translation": "In the ocean, he takes a load of hemp and discards it as treasure.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　聞中非決淨，　　無戒非出家，",
        "translation": "What’s heard is not definitely pure, and what’s lacking in morality is not renunciation.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　修行菩提道，　　彼故莫放逸。",
        "translation": "Cultivating the path of enlightenment, they therefore don't be careless.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　後時若有處，　　說時當聽聞，",
        "translation": "If there is a place later, you should hear it at the time of teaching.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼為知識故，　　復行不讚說；",
        "translation": "Because of their knowledge, they also do not praise or exhort.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　在前當禮拜、　　及當與稱善，",
        "translation": "In front of him, he should venerate them and praise their goodness.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　如是以衣散，　　復行不讚說。",
        "translation": "Thus, his robes are scattered, and he doesn't praise it again.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　泣淚灑作已，　　奉施於自身，",
        "translation": "After weeping and shedding tears, he sprinkles them to his own body.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　彼復在眾中，　　而說其惡行。",
        "translation": "They're also in the midst of the crowd, Explaining their bad actions.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　不愛阿遮梨、　　不重近誦者，",
        "translation": "He who doesn’t love the ācārī and doesn’t recite it closely,",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　為少而相破，　　以家相嫉惡，",
        "translation": "For the sake of a little bit, they're mutually exclusive and jealous of each other because their homes are bad.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　唯信他福德，　　自德不思惟，",
        "translation": "They only believe in the virtues of others, And do not think of their own virtues.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　當生猛毒惡，　　知他富供養。",
        "translation": "They'll become fierce, poisonous, and evil, knowing that others are rich and making offerings.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　華香及末香、　　幢蓋、幡鬘等、",
        "translation": "Flowery incense, powdered incense, Banners, canopies, pennants, and so forth.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　鼓樂供養我，　　當言：『得菩提。』",
        "translation": "If you make an offering of drums and music to me, you should say, 'I'll attain enlightenment.'",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　此我實供養，　　聞此勝定已，",
        "translation": "This is really an offering from me. Having heard this supreme concentration,",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　當捨知識利，　　修行則相應。",
        "translation": "You should abandon the benefits of knowledge and practice, which are concomitant with cultivation.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　何供養色身？　　諸聚我已捨；",
        "translation": "“World-honored One, what is an offering to the material body?",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　應供養法身，　　亦如善實供。",
        "translation": "You should make offerings to the Dharma body, just as you do to a good and true offering.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　愛命捨離已，　　常宿阿蘭拏，",
        "translation": "Having abandoned his craving for life, he always spent the night in Araṇḍa.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　念此修多羅，　　當盡於命世。",
        "translation": "Mindful of this sūtra, he'll end his life in the world.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　喜王！我告汝：　　修行此已聞，",
        "translation": "“O king of joy! I tell you:",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　決莫共彼輩，　　諂曲作伴黨。",
        "translation": "Don't share them with those who flatter and become companions.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　於中我不讚，　　在眾中當言：",
        "translation": "Among them, I won’t praise them. Among the assembly, you should say:",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "『此實、此不實。』　　於中莫欲信。",
        "translation": "'This is true and this is not true.' They don't want to believe in it.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　不於境界所，　　有欲佛菩提，",
        "translation": "They do not aspire to the enlightenment of buddhas In their objective realm.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　所有彼諸行，　　彼菩提大遠。",
        "translation": "All those practices that exist, their enlightenment is greatly distant.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　我所有神通，　　此見大體力，",
        "translation": "All the mystical powers that I possess, This is the great essence and power of this vision.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　諸此有禁戒，　　修行我得已。",
        "translation": "These are all forbidden precepts that I've cultivated after attaining them.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　愛、戒作分者，　　眾中似野獸，",
        "translation": "Someone who loves and observes the precepts resembles a wild animal in the crowd.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　已捨知識利，　　獨宿阿蘭拏。",
        "translation": "I've abandoned the benefits of my friends, and I'm staying alone in Araṇḍa.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　我無有是處、　　我不說無實，",
        "translation": "There’s no place for a self, and I don’t say it is without substance.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　久後末世時，　　此經付囑汝。」",
        "translation": "Long after that, in the final age, this sūtra will be entrusted to you.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　無量壽放光、　　及不動法王、",
        "translation": "The Buddha of Immeasurable Life emits light, As well as the immovable King of Truth.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　六十三億佛，　　眾會皆已見，",
        "translation": "Sixty-three hundred million buddhas have already been seen in the assembly.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　教師皆付彼，　　久後令護法。",
        "translation": "The teacher entrusts them all to him, and after a long time, he causes them to protect the Dharma.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "「如此經智印，　　我普持在後。」",
        "translation": "Thus is the wisdom mudrā of this sūtra, which I universally hold behind me.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　三千即震動，　　諸天稱善言，",
        "translation": "Three thousand instantly shakes, and the gods call it good speech.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "　多有華雨落，　　聞此付囑故。",
        "translation": "Many flowers and rain fell down because they heard this entrustment.",
        "source": "T15n0649_002:0735a07_26"
    },
    {
        "source_sentence": "爾時，世尊復欲過量讚說此三摩地功德，令高出故，即說歌頌：觀察諸法行經卷第二",
        "translation": "At that time the World-honored One, wanting to extol the virtues of this concentration so exalted as to make it sublime, composed the following verse:",
        "source": "T15n0649_002:0735a07_26"
    }
]