[
    {
        "source_sentence": "文殊師利普超三昧經卷上",
        "translation": "Mañjuśrī Samantabhadrasamādhi-sūtra, Volume 1",
        "source": "T15n0627_001:0406b15_0"
    },
    {
        "source_sentence": "(一名阿闍世王品)",
        "translation": "(Skt. Ajātaśatru Chapter)",
        "source": "T15n0627_001:0406b16_0"
    },
    {
        "source_sentence": "西晉月氏三藏竺法護譯",
        "translation": "Translated by Zhu Fahou, the Tripiṭaka Master of the Yue family of the Western Jin Dynasty",
        "source": "T15n0627_001:0406b18_0"
    },
    {
        "source_sentence": "正士品第一",
        "translation": "The First Chapter of the Righteous One",
        "source": "T15n0627_001:0406b19_0"
    },
    {
        "source_sentence": "聞如是：一時佛遊王舍城靈鷲山，與大比丘眾俱，比丘三萬二千；",
        "translation": "Thus I have heard: One time the Buddha sojourned at Vulture Peak in Rājagṛha accompanied by a great assembly of monks, numbering thirty-two thousand.",
        "source": "T15n0627_001:0406b20_0"
    },
    {
        "source_sentence": "菩薩八萬四千，一切聖達靡所不明，開士大士神通已暢，已得總持辯才無礙，",
        "translation": "All the enlightening beings, eighty-four thousand in number, had noble knowledge and did not know anything. Enlightened men and great men who had perfected their superknowledges had already attained unhindered powers of elucidation; they had gained unimpeded eloquence that held all together.",
        "source": "T15n0627_001:0406b21_1"
    },
    {
        "source_sentence": "得無所著不起法忍，曉了定行見眾生心，隨所應度而為說法。",
        "translation": "Attaining the forbearance of not being attached to things, they understand the minds of sentient beings who practice concentration and see their minds, teaching them according to what they need to be liberated.",
        "source": "T15n0627_001:0406b23_2"
    },
    {
        "source_sentence": "四天王天、帝釋、梵忍天王，及餘無數諸天、龍、神、犍沓和、阿須倫、加留羅、真陀羅、摩休勒、人與非人，",
        "translation": "The four guardian gods of heaven, Indra, Brahmā, Brahmakāyika, as well as innumerable other gods, dragons, spirits, gandharvas, asuras, garuḍas, mahoras, humans, and nonhumans.",
        "source": "T15n0627_001:0406b24_3"
    },
    {
        "source_sentence": "各百千眾而俱來會。",
        "translation": "Hundreds of thousands of people each came to the assembly.",
        "source": "T15n0627_001:0406b26_4"
    },
    {
        "source_sentence": "爾時軟首童真菩薩在山一面異處梁上，與二十五正士俱，而講論法。",
        "translation": "It was then that the soft-headed boy Bodhisattva was at one side of the mountain on a different beam and accompanied by twenty-five 正士, discussing the Dharma.",
        "source": "T15n0627_001:0406b28_0"
    },
    {
        "source_sentence": "其名曰：龍首菩薩、龍施菩薩、首具菩薩、首藏菩薩、蓮首菩薩、蓮首藏菩薩、持人菩薩、持地菩薩、寶掌菩薩、寶印手菩薩、師子意菩薩、師子步雷音菩薩、虛空藏菩薩、發意轉法輪菩薩、辯諸句菩薩、辯積菩薩、海意菩薩、大山菩薩、喜見菩薩、喜王菩薩、察無圻菩薩、遊無際法行菩薩、超魔見菩薩、無憂施菩薩、諸議告菩薩，",
        "translation": "Their names were Dragon Chief Bodhisattva, Dragon Giver Bodhisattva, Chief Supply Bodhisattva, Chief Store Bodhisattva, Chief Store Bodhisattva, Lotus Chief Bodhisattva, Lotus Chief Store Bodhisattva, Human Holding Bodhisattva, Earth Holding Bodhisattva, Jewel Palm Bodhisattva, Jewel Seal Hand Bodhisattva,",
        "source": "T15n0627_001:0406b29_1"
    },
    {
        "source_sentence": "是為二十五正士。",
        "translation": "These are the twenty-five righteous ones.",
        "source": "T15n0627_001:0406c08_0"
    },
    {
        "source_sentence": "兜率天上有四天子，俱造軟首童真，於後侍焉。",
        "translation": "In the Tuṣita Heaven there are four celestial beings, all named soft-headed youthful ones, who serve as attendants after him.",
        "source": "T15n0627_001:0406c08_1"
    },
    {
        "source_sentence": "其名：普華天子、光華天子、美香天子、常進法行天子。",
        "translation": "They were named Universal Flower Godling, Light Flower Godling, Beautiful Fragrance Godling, and Constantly Advancing in Practice of the Dharma.",
        "source": "T15n0627_001:0406c09_2"
    },
    {
        "source_sentence": "復有異天子不可計數，僉然來侍。",
        "translation": "An incalculable number of other celestial beings also came to attend him.",
        "source": "T15n0627_001:0406c10_3"
    },
    {
        "source_sentence": "如斯正士、諸天子等，亦悉會坐各各講論，如是之儔迭相謂曰：「仁者欲知佛之智慧弘普無限，",
        "translation": "In this way the holy ones and the celestial beings sat together, discussing each other’s theories. They said to one another, “Friend, you wish to know that the Buddha’s knowledge is boundless and infinite.",
        "source": "T15n0627_001:0406c11_4"
    },
    {
        "source_sentence": "不可思議不可稱量，無能滅度盡極際者，不可以小意思原大德鎧，當以何方便誓被戒德鎧，",
        "translation": "Inconceivable, immeasurable, and unfathomable, there is no one who can extinguish the ultimate limit. They cannot be armed with the armor of virtue based on lesser intentions; what method should they use to vow to be armed with the armor of virtue based on morality?",
        "source": "T15n0627_001:0406c13_5"
    },
    {
        "source_sentence": "而能逮茲大乘佛乘、諸通慧乘、不可思乘，斯應道乎？」",
        "translation": "How could you have attained this great vehicle, the buddha vehicle of the great vehicle, the vehicle of penetrating wisdom, and the inconceivable vehicle?",
        "source": "T15n0627_001:0406c15_6"
    },
    {
        "source_sentence": "龍首菩薩曰：「積累功德不以厭足，建立休祚不可限量，而不毀失戒德之鎧，",
        "translation": "Nāgârjuna Bodhisattva said, He accumulates merit without getting tired of it and establishes a peaceful kingdom that can't be limited, not disparaging the armor of moral virtue.",
        "source": "T15n0627_001:0406c17_0"
    },
    {
        "source_sentence": "一切所作無所悕望，則應大乘諸通慧矣！」",
        "translation": "All that's done without expecting anything, then it should be the great vehicle of supernormal wisdom!",
        "source": "T15n0627_001:0406c18_1"
    },
    {
        "source_sentence": "龍施菩薩曰：「普弘等心調和其志，溫潤其性柔軟其意，而心仁厚堅住正願，",
        "translation": "The dragon-giving bodhisattva said, Samantabhadra harmonizes his aspirations, gently nourishes his nature and softens his mind, yet his mind is kind and generous, firmly abiding in the right vow.",
        "source": "T15n0627_001:0406c20_0"
    },
    {
        "source_sentence": "於諸通慧被戒德鎧化度生死，則應大乘諸通慧矣！」",
        "translation": "In the case of the supernormal wisdom that's transformed by the armor of morality and virtue to save birth and death, then it should be the great vehicle supernormal wisdom!",
        "source": "T15n0627_001:0406c21_1"
    },
    {
        "source_sentence": "首具菩薩曰：「不可計劫趣斯大乘，被戒德鎧於無數劫不念劫數，則應大乘諸通慧矣！」",
        "translation": "Śubhavyūha Bodhisattva said, In an incalculable number of eons to go to this great vehicle, you'll be armed with the armor of moral virtue for countless eons without remembering the number of eons, and then you'll have the supernormal wisdom of the great vehicle!",
        "source": "T15n0627_001:0406c23_0"
    },
    {
        "source_sentence": "首藏菩薩曰：「其自建立獨安己者，不能逮趣大乘通慧；",
        "translation": "The chief treasury bodhisattva said, “Those who establish themselves as independently self-contained will not be able to acquire the superknowledges of the Great Vehicle.",
        "source": "T15n0627_001:0406c24_1"
    },
    {
        "source_sentence": "捨己之安建立眾生，欲使大安隨其所便，令無僥冀而無所起，勸進群黎立於道法，",
        "translation": "They abandon their own peace and establish sentient beings in it, wanting to cause great peace to follow their inclinations, so that there be no hope and nothing to give rise to. Encouraging the masses to establish the teaching of enlightenment,",
        "source": "T15n0627_001:0406c26_2"
    },
    {
        "source_sentence": "則應大乘諸通慧矣！」",
        "translation": "Then you should have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0406c28_3"
    },
    {
        "source_sentence": "蓮首菩薩曰：「族姓子！",
        "translation": "Padmasaṃbhava Bodhisattva said, Clansman!",
        "source": "T15n0627_001:0406c29_0"
    },
    {
        "source_sentence": "憶如來所講：『假使有人自不柔順，無有靜寂、不隨律教，而欲調伏靜寂於他、以律勸人者，",
        "translation": "I recall what the Tathāgata said: Suppose there is a person who is not self-controlled, lacks serenity and doesn’t follow the teachings of the vinaya, but wants to tame others with serenity and encourage them with the vinaya.",
        "source": "T15n0627_001:0406c29_1"
    },
    {
        "source_sentence": "未之有也。』",
        "translation": "It's not yet present.'",
        "source": "T15n0627_001:0407a02_2"
    },
    {
        "source_sentence": "其自調順靜寂奉律，乃能化勵剛強、憒亂、抑挫、犯禁，則應大乘諸通慧矣！」",
        "translation": "If someone self-controlled, quiescent, tranquil, and observant of the precepts can be transformed into a person who encourages rigidity, anger, suppresses, and violates prohibitions, then they should have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0407a02_3"
    },
    {
        "source_sentence": "蓮首藏菩薩曰：「其同塵勞於世法者則不度世；",
        "translation": "The enlightening being Padmavyūha said, “Those who are like the dust and labor of worldly dharmas will not save the world.",
        "source": "T15n0627_001:0407a05_0"
    },
    {
        "source_sentence": "其不同塵於世法者乃能度世。",
        "translation": "Those who aren't like the dust in the worldly Dharma can then save the world.",
        "source": "T15n0627_001:0407a06_1"
    },
    {
        "source_sentence": "是故菩薩有利無利、若譽若毀、有名無名、若苦若樂，不動不搖，則應大乘諸通慧矣！」",
        "translation": "Therefore, if a bodhisattva benefits and doesn't benefit, praises and disparages, names and namesless names, pains and pleasures, and doesn't move or shake, then he should have the great vehicle of supernormal wisdom!",
        "source": "T15n0627_001:0407a06_2"
    },
    {
        "source_sentence": "持人菩薩曰：「不可從他而致大乘諸通慧也，吾獨一己而無有侶，以眾生故誓被德鎧，",
        "translation": "The man-holding bodhisattva said, “You should not follow others to attain the great vehicle of transcendent wisdom. I am alone and have no companions. For the sake of sentient beings I vow to be armed with the armor of virtue.",
        "source": "T15n0627_001:0407a09_0"
    },
    {
        "source_sentence": "設護一切，則吾所應將濟救攝，須臾精進而不懈怠，教化黎元建發學，",
        "translation": "If you protect all, then I should rescue and embrace them. In a moment of thoughtful effort without slackening, I will edify [them] in order to establish my learning in Liyuan.",
        "source": "T15n0627_001:0407a10_1"
    },
    {
        "source_sentence": "斯則應大乘諸通慧矣！」",
        "translation": "This should be the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0407a12_2"
    },
    {
        "source_sentence": "持地菩薩曰：「譬如，仁者！",
        "translation": "The ground-holding bodhisattva said, Just so, my lord!",
        "source": "T15n0627_001:0407a13_3"
    },
    {
        "source_sentence": "地之所載，一切眾果、百穀、藥木因地而生，地無所置亦不求報，群庶品類皆仰地活，",
        "translation": "All the fruits, hundreds of grains, and herbs and trees that grow from the ground are born by reason of the earth. The earth has no place to store and does not seek reward. All kinds of living beings all look up to the earth for support.",
        "source": "T15n0627_001:0407a13_4"
    },
    {
        "source_sentence": "地不辭厭不以為勞。",
        "translation": "The earth doesn't give up disillusionment and doesn't think it's a burden.",
        "source": "T15n0627_001:0407a15_5"
    },
    {
        "source_sentence": "開士大士亦當如是，發心如地心無所著，不以喜怒勸諸黎元，使趣佛慧而不想報，",
        "translation": "So it should be with the enlightened ones, great men and bodhisattvas. Their arousal of mind is like the earth; their minds are free from attachment, they don’t encourage others with joy or anger, and they lead them to enter the Buddha’s wisdom without wanting retribution.",
        "source": "T15n0627_001:0407a16_6"
    },
    {
        "source_sentence": "則應大乘諸通慧矣！」",
        "translation": "Then you should have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0407a18_0"
    },
    {
        "source_sentence": "寶掌菩薩曰：「仁者當知，被上德鎧乃至佛慧，無能沮敗令釋大乘。",
        "translation": "The Jewel Palm Bodhisattva said, Good man, you should know that the armor of superior virtue and even the Buddha's wisdom can't discourage or defeat the explanation of the great vehicle.",
        "source": "T15n0627_001:0407a19_0"
    },
    {
        "source_sentence": "若於夢中不志二乘——聲聞、緣覺，常以寶心諸通慧心為人講宣，於珍寶心無所貪惜、無所愛悋，",
        "translation": "If they don't aspire to the two vehicles in their dreams - śrāvakas and pratyekbuddhas, they always preach for others with the mind of treasure and the mind of penetrating wisdom, have no craving or desire for precious treasures, and don't cherish anything.",
        "source": "T15n0627_001:0407a20_1"
    },
    {
        "source_sentence": "勸眾大乘誓被德鎧，彼所學乘非無有乘不增不減，其心如是無所歆慕，",
        "translation": "He encouraged the great vehicle and vowed to be armed with the armor of virtue. The vehicles he studied were not non-vehicle, neither increasing nor decreasing; his mind thus had no craving for them.",
        "source": "T15n0627_001:0407a22_2"
    },
    {
        "source_sentence": "則應大乘諸通慧矣！」",
        "translation": "Then you should have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0407a24_3"
    },
    {
        "source_sentence": "寶印手菩薩曰：「覩於群黎墮墜六趣，而發愍哀惠施眾生授以法手；",
        "translation": "The enlightening being Jeweled Seal-Armed Bodhisattva said, Having fallen into the six realms of rebirth in the masses of sentient beings, they give compassion and pity to sentient beings and bestow the Dharma hand on them.",
        "source": "T15n0627_001:0407a25_0"
    },
    {
        "source_sentence": "其無信者為造信手；",
        "translation": "Those who lack faith are given the task of building hands of faith.",
        "source": "T15n0627_001:0407a26_1"
    },
    {
        "source_sentence": "其少智者為博聞手；",
        "translation": "Those with little knowledge are the hands of learned people.",
        "source": "T15n0627_001:0407a27_0"
    },
    {
        "source_sentence": "其慳貪者為惠施手；",
        "translation": "Those who are stingy and greedy give their hands as alms.",
        "source": "T15n0627_001:0407a27_1"
    },
    {
        "source_sentence": "其犯戒者為護禁手；",
        "translation": "Those who have broken the precepts guard their hands in order to keep them away.",
        "source": "T15n0627_001:0407a27_2"
    },
    {
        "source_sentence": "其瞋怒者為忍辱手；",
        "translation": "Their anger is the hand of forbearance.",
        "source": "T15n0627_001:0407a28_3"
    },
    {
        "source_sentence": "其懈怠者為精進手；",
        "translation": "Those who are lazy are the hand of effort.",
        "source": "T15n0627_001:0407a28_4"
    },
    {
        "source_sentence": "其亂意者為一心手；",
        "translation": "Those with troubled minds are the hands of one mind.",
        "source": "T15n0627_001:0407a29_5"
    },
    {
        "source_sentence": "其邪智者為智慧手，而隨眾生離清白法，各各應時具設法手。",
        "translation": "Those who have wrong knowledge are the hand of wisdom, but they follow sentient beings who part with the pure and white Dharma, each one setting up the Dharma hand at the right time.",
        "source": "T15n0627_001:0407a29_6"
    },
    {
        "source_sentence": "開士殖斯德本之手，印于三寶。",
        "translation": "The enlightened man's hand planted this root of virtue, which was sealed in the Three Treasures.",
        "source": "T15n0627_001:0407b02_7"
    },
    {
        "source_sentence": "何謂三？",
        "translation": "What are these three?",
        "source": "T15n0627_001:0407b03_0"
    },
    {
        "source_sentence": "具立群生於佛智慧，勸助至于寶印之手；",
        "translation": "They establish all sentient beings in the Buddha’s knowledge, encouraging and assisting them up to the hand of the jeweled mudrā.",
        "source": "T15n0627_001:0407b03_1"
    },
    {
        "source_sentence": "成已德本則寶印手；",
        "translation": "The hand of the jeweled mudrā is the root of virtue that has been perfected.",
        "source": "T15n0627_001:0407b04_2"
    },
    {
        "source_sentence": "念一切法猶如虛空則寶印手。",
        "translation": "He's mindful of all dharmas like space, then he seals his hand with the jeweled mudrā.",
        "source": "T15n0627_001:0407b04_3"
    },
    {
        "source_sentence": "興立如斯是則為三，則應大乘諸通慧矣！」",
        "translation": "To establish such things as these are three, then they should be the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0407b05_4"
    },
    {
        "source_sentence": "師子意菩薩曰：「仁者當知，被無畏鎧是為無懼，所誓德鎧、無難鎧、無罣礙鎧、無怯弱鎧、無懈怠鎧，",
        "translation": "The bodhisattva Siṃhamati Bodhisattva said, “Friend, know that the armor of fearlessness is the armor of fearlessness. It is the armor of virtue which you have undertaken, the armor of non-obstruction, the armor of non-obstruction, the armor of non-weakness, and the armor",
        "source": "T15n0627_001:0407b07_0"
    },
    {
        "source_sentence": "斯則佛慧。",
        "translation": "This is the Buddha's wisdom.",
        "source": "T15n0627_001:0407b09_1"
    },
    {
        "source_sentence": "是故行者不當恐怖，無難無礙、無怯無怠，離諸危懅衣毛不竪，在於終始無有瑕穢，",
        "translation": "Therefore, practitioners should not be frightened. They should have no difficulties or obstacles, no fear or laziness, be free from danger and distress, their hair and clothing not stand on end, and remain impeccably without blemishes at all times.",
        "source": "T15n0627_001:0407b09_2"
    },
    {
        "source_sentence": "亦不希仰泥洹之德，等住苦樂而無二行，則應大乘諸通慧矣！」",
        "translation": "Nor does he want to venerate the virtue of nirvāṇa, and if he equally abides in suffering and pleasure without two practices, then he should have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0407b11_3"
    },
    {
        "source_sentence": "師子步雷音菩薩曰：「仁者當知，其斯事者非下才行，則為正士之所建造。",
        "translation": "The bodhisattva Siṃhala paced and thundered, saying, Good man, you should know that these things aren't done by people of lowly talent, and they are built by righteous people.",
        "source": "T15n0627_001:0407b13_0"
    },
    {
        "source_sentence": "其正士者，歸趣平等離于邪見；",
        "translation": "The righteous one returns to equanimity and is free from wrong views.",
        "source": "T15n0627_001:0407b14_1"
    },
    {
        "source_sentence": "其正士者，其心質朴而無諛諂；",
        "translation": "The brave man’s mind was simple and plain, free of deceitfulness.",
        "source": "T15n0627_001:0407b15_2"
    },
    {
        "source_sentence": "其正士者，勞謙柔順尊師敬聖；",
        "translation": "The brave man was humble and gentle, obedient to the venerated teacher and respectful to the saints.",
        "source": "T15n0627_001:0407b16_3"
    },
    {
        "source_sentence": "其正士者，勸學不惓所受根究；",
        "translation": "The righteous one encourages learning and investigates the faculties received by those who aren’t stingy.",
        "source": "T15n0627_001:0407b16_4"
    },
    {
        "source_sentence": "其正士者，欽悅正治建立正業；",
        "translation": "The righteous one delighted in the righteousness of government and established right action.",
        "source": "T15n0627_001:0407b17_5"
    },
    {
        "source_sentence": "其正士者，若有所欲損廢穢法；",
        "translation": "The righteous one, if he has any desire to disparage the defiled dharma.",
        "source": "T15n0627_001:0407b18_6"
    },
    {
        "source_sentence": "其正士者，若有瞋怒意無結恨；",
        "translation": "The righteous one is without fetters or grudges if he has angry thoughts.",
        "source": "T15n0627_001:0407b18_7"
    },
    {
        "source_sentence": "其正士者，若有愚癡照除幽冥；",
        "translation": "The righteous one, if there is ignorance, illumines and removes the darkness.",
        "source": "T15n0627_001:0407b19_8"
    },
    {
        "source_sentence": "其正士者，寂然澹泊近于定藏；",
        "translation": "The righteous one was quiet and peaceful, approaching the store of concentration.",
        "source": "T15n0627_001:0407b20_9"
    },
    {
        "source_sentence": "其正士者，具足恩施惠及貧厄一切輒濟；",
        "translation": "The righteous one is endowed with kindness, charity, generosity, and ease in rescuing all the poor and helpless.",
        "source": "T15n0627_001:0407b21_10"
    },
    {
        "source_sentence": "其正士者，護身口意喟而靜寞；",
        "translation": "The righteous one guarded his body, speech, and mind but remained quiet and lonely.",
        "source": "T15n0627_001:0407b22_11"
    },
    {
        "source_sentence": "其正士者，言行相副情性質直；",
        "translation": "The righteous one was honest and straightforward by nature in speech and deeds.",
        "source": "T15n0627_001:0407b22_12"
    },
    {
        "source_sentence": "其正士者，所志堅強尚真諦法；",
        "translation": "The righteous one’s aspiration was steadfast and strong, upholding the teaching of truth.",
        "source": "T15n0627_001:0407b23_13"
    },
    {
        "source_sentence": "其正士者，離於非法親存正典；",
        "translation": "The righteous one is free from the unlawful and keeps the true scripture in his own hands.",
        "source": "T15n0627_001:0407b24_14"
    },
    {
        "source_sentence": "其正士者，樂于法樂護以正法；",
        "translation": "The righteous one delights in the Dharma and enjoys protecting it.",
        "source": "T15n0627_001:0407b25_0"
    },
    {
        "source_sentence": "其正士者，輕忽身命不釋眾生；",
        "translation": "The righteous one would despise sentient beings for their lives and not release them.",
        "source": "T15n0627_001:0407b25_1"
    },
    {
        "source_sentence": "其正士者，所立鏗然善施無羨；",
        "translation": "The righteous man was established as a brave and good donor with no envy.",
        "source": "T15n0627_001:0407b26_2"
    },
    {
        "source_sentence": "其正士者，志純淑法消化凶偽；",
        "translation": "The righteous man’s aspiration was pure and genuine. He cherished the principles [of Buddhism] in order to eliminate evil and hypocrisy.",
        "source": "T15n0627_001:0407b27_3"
    },
    {
        "source_sentence": "其正士者，則以寶藏救濟貧匱；",
        "translation": "As for the righteous man, he rescued the poor and help those in distress by means of his treasury of treasure.",
        "source": "T15n0627_001:0407b27_4"
    },
    {
        "source_sentence": "其正士者，則為良藥療諸疹疾；",
        "translation": "As for the righteous one, he will give them good medicine to treat their ailments of illness.",
        "source": "T15n0627_001:0407b28_5"
    },
    {
        "source_sentence": "其正士者，護諸畏懼令得自歸；",
        "translation": "The righteous one protects all fears and lets them attain self-reliance.",
        "source": "T15n0627_001:0407b29_6"
    },
    {
        "source_sentence": "其正士者，導諸邪見至無崖際；",
        "translation": "The righteous one led the wrong views up to the limitless precipice.",
        "source": "T15n0627_001:0407c01_0"
    },
    {
        "source_sentence": "其正士者，勉濟勞穢勸以經典；",
        "translation": "The brave man was diligently relieving the troubled and defiled by exhorting him with scriptures.",
        "source": "T15n0627_001:0407c01_1"
    },
    {
        "source_sentence": "其正士者，調忍瞋怒而順所宜。",
        "translation": "That righteous man is someone who tolerates anger and follows what's appropriate.",
        "source": "T15n0627_001:0407c02_2"
    },
    {
        "source_sentence": "是故建立正士之法，則應大乘諸通慧矣！」",
        "translation": "Therefore, the establishment of the righteous person's teaching should be based on the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0407c03_3"
    },
    {
        "source_sentence": "虛空藏菩薩曰：「修以無量虛空之慈，其精進行未曾釋廢，大哀之行諸根悅豫悉懷踊躍，",
        "translation": "The Ākāśagarbha Bodhisattva said, Cultivate the immeasurable spacelike kindness of infinite space, which never ceases to exert effort; practice it with great compassion, all faculties delight in it and cherish it.",
        "source": "T15n0627_001:0407c05_0"
    },
    {
        "source_sentence": "於諸愛欲所可娛樂察如虛空。",
        "translation": "He observes what's enjoyable by craving and desire like space.",
        "source": "T15n0627_001:0407c07_0"
    },
    {
        "source_sentence": "布施、持戒、忍辱、精進、一心、智慧，等如虛空，則應大乘諸通慧矣！」",
        "translation": "generosity, observance of precepts, forbearance, patience, effort, unity of mind, and wisdom are like space, so it's appropriate for the great vehicle to have supernormal wisdom!",
        "source": "T15n0627_001:0407c07_1"
    },
    {
        "source_sentence": "發意轉法輪菩薩曰：「發菩薩意，所發意者：不當發意令魔得便，無令如來而不欣樂，",
        "translation": "The bodhisattva who aroused the intention to turn the wheel of the Dharma said, Aroused the bodhisattva’s intention: You should not aroused the intention to cause Māra to get an advantage over you and not cause the Tathāgata to be unhappy.",
        "source": "T15n0627_001:0407c09_2"
    },
    {
        "source_sentence": "使諸天人所不悅喜，不令德本而有耗減。",
        "translation": "It causes gods and humans not to rejoice, doesn't cause the root of virtue to be depleted, and doesn't cause it to decrease.",
        "source": "T15n0627_001:0407c11_0"
    },
    {
        "source_sentence": "若欲興建為道意者：隨順誘勸當令弊魔不得其便，順如來意天人悅豫，",
        "translation": "If someone wants to build it for the sake of the path, they'll follow and encourage it so that bad demons won't get an advantage over it, and following the Tathāgata's wishes, gods and humans will be delighted.",
        "source": "T15n0627_001:0407c11_1"
    },
    {
        "source_sentence": "不失己身所造德本。",
        "translation": "They won't lose the root of virtue created by themselves.",
        "source": "T15n0627_001:0407c13_2"
    },
    {
        "source_sentence": "所修如斯，一切發意則轉法輪。",
        "translation": "Such is cultivated, and all those who arouse the intention to do so will turn the wheel of the Dharma.",
        "source": "T15n0627_001:0407c14_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0407c14_4"
    },
    {
        "source_sentence": "其菩薩者，諸所發意因緣所造而無所生，曉了諸法永無所起。",
        "translation": "That bodhisattva understands that all the things that arise are never produced by the causes and conditions for the arousal of intention.",
        "source": "T15n0627_001:0407c15_0"
    },
    {
        "source_sentence": "無所起者，諸佛如來順如正覺之轉法輪，如是發心被戒德鎧，則應大乘諸通慧矣！」",
        "translation": "Nothing that arises is produced because the buddhas and tathāgatas turn the wheel of the Dharma in accordance with what's correctly enlightened, thus arousing the mind to be disciplined by the armor of moral virtue, then it should be the great vehicle of supernormal wisdom!",
        "source": "T15n0627_001:0407c16_1"
    },
    {
        "source_sentence": "辯諸句菩薩曰：「正士當知，其道心者，正士普入塵勞怒害，有漏無漏、有為無為，",
        "translation": "The eloquent bodhisattva said, Good man, you should know that this is the mind of enlightenment. That good man universally enters into the harm of worldly suffering and anger, which are both contaminated and uncontaminated, conditioned and unconditioned.",
        "source": "T15n0627_001:0407c19_0"
    },
    {
        "source_sentence": "亦入於罪不罪殃福；",
        "translation": "They also enter sin and non-sin in blameworthiness, misfortune, and merit.",
        "source": "T15n0627_001:0407c20_1"
    },
    {
        "source_sentence": "亦入於善亦入不善；",
        "translation": "They also enter what is good and enter what is bad.",
        "source": "T15n0627_001:0407c21_2"
    },
    {
        "source_sentence": "亦入世法度世之法；",
        "translation": "They also enter worldly dharmas and transcend worldly dharmas.",
        "source": "T15n0627_001:0407c21_3"
    },
    {
        "source_sentence": "亦入終始無為之為；",
        "translation": "It also enters into the unconditioned from beginning to end.",
        "source": "T15n0627_001:0407c22_4"
    },
    {
        "source_sentence": "亦入斷滅有常之計；",
        "translation": "They also enter into the conception that annihilation has permanence.",
        "source": "T15n0627_001:0407c22_5"
    },
    {
        "source_sentence": "亦入諸陰衰入之事；",
        "translation": "They also enter all the aggregates, which are the factors of decay and entry.",
        "source": "T15n0627_001:0407c23_6"
    },
    {
        "source_sentence": "亦入地、水、火、風。",
        "translation": "It also enters earth, water, fire, and wind.",
        "source": "T15n0627_001:0407c23_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0407c24_8"
    },
    {
        "source_sentence": "此諸因緣悉為自然，志性本淨，所在之處有所言說，一切所講皆悉為空而無所有。",
        "translation": "These causes and conditions are all natural, the nature of intention is inherently pure, there's nothing to say where it's located, and everything that's taught is empty and has no existence.",
        "source": "T15n0627_001:0407c24_9"
    },
    {
        "source_sentence": "譬如虛空無所不入，道心如是，一切普至菩薩喜樂。",
        "translation": "It's like space that enters without anything, and so is the mind of enlightenment, which brings joy and happiness to all bodhisattvas who reach everywhere.",
        "source": "T15n0627_001:0407c26_10"
    },
    {
        "source_sentence": "如是慧者，除棄一切文字辯才，分別眾庶逮得辯慧，若能入斯一聖達者，",
        "translation": "Such wisdom is to remove all the verbal powers of eloquence and discriminate sentient beings to attain eloquence, and if they can enter this one noble insight,",
        "source": "T15n0627_001:0407c27_11"
    },
    {
        "source_sentence": "則應大乘諸通慧矣！」",
        "translation": "Then you should have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0407c29_12"
    },
    {
        "source_sentence": "辯積菩薩曰：「一切所說皆無有言，一切音聲而不可得，菩薩喜樂如斯慧者，",
        "translation": "The bodhisattva Bimbisāra said, “None of the teachings have words and all sounds cannot be apprehended.",
        "source": "T15n0627_001:0408a01_0"
    },
    {
        "source_sentence": "好言惡言，不悅不慼，譬如太山風來吹之，尋復還反山不動搖。",
        "translation": "Good words and bad words are neither delighted nor displeased, like a great mountain that is blown by the wind and goes back and forth without moving.",
        "source": "T15n0627_001:0408a02_1"
    },
    {
        "source_sentence": "菩薩如是，於諸異學、一切語言不動不搖，在諸外徑亦無所著。",
        "translation": "Thus, the bodhisattva thus remains unmoving and unshakable in all his words for heretics and non-Buddhists, and he doesn't cling to external paths.",
        "source": "T15n0627_001:0408a04_2"
    },
    {
        "source_sentence": "若如來言、外徑異語等法察之，不以增減亦無所亂。",
        "translation": "If the Tathāgata examines them with words, external paths, dissimilar speech, and other teachings, they don't increase or decrease without confusion.",
        "source": "T15n0627_001:0408a05_3"
    },
    {
        "source_sentence": "見諸辯才一切法盡，於諸盡法不念自天亦無所思。",
        "translation": "Seeing the exhaustion of all eloquence and all dharmas, he doesn't think about the exhaustion of dharmas in his own heaven or anything else.",
        "source": "T15n0627_001:0408a06_4"
    },
    {
        "source_sentence": "菩薩能行如斯慧者，則應大乘諸通慧矣！」",
        "translation": "If bodhisattvas can practice such wisdom, then they should follow the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0408a07_5"
    },
    {
        "source_sentence": "海意菩薩曰：「菩薩所入當如入海，覺了大道，一切聲聞所不能及，信樂專心於一法味，",
        "translation": "The sea-mind bodhisattva said, “What enlightening beings enter should be as they enter the ocean. They awaken to the great path which all śrāvakas cannot reach. They believe and eagerly concentrate their minds on a single flavor of the Dharma.",
        "source": "T15n0627_001:0408a09_0"
    },
    {
        "source_sentence": "入若干法無有若干；",
        "translation": "They enter into certain principles, but there are no such principles.",
        "source": "T15n0627_001:0408a10_1"
    },
    {
        "source_sentence": "觀深妙法未曾惑亂；",
        "translation": "They contemplate the profound, wondrous Teaching without confusion.",
        "source": "T15n0627_001:0408a11_2"
    },
    {
        "source_sentence": "於緣起法不增不減；",
        "translation": "They do not increase or decrease dependently-arisen dharmas.",
        "source": "T15n0627_001:0408a11_3"
    },
    {
        "source_sentence": "於諸經典無有若干，是則名曰不生不起。",
        "translation": "There are no different kinds of scriptures, so it's called not arising or not arising.",
        "source": "T15n0627_001:0408a12_4"
    },
    {
        "source_sentence": "一切眾生所業起者，不殖德本福無有盡所教無邊，當分別了棄捐斷滅有常之事，",
        "translation": "The actions of all sentient beings that arise because they don't cultivate virtue and original merit have no limit, and what they teach has no limit, so they should discern and understand the things that are permanent by discarding, eliminating, and destroying.",
        "source": "T15n0627_001:0408a13_5"
    },
    {
        "source_sentence": "不受諸法不斷諸法，當建立志為無量器，不忘捨法習諸通慧亦不釋法，",
        "translation": "Not accepting dharmas and not stopping dharmas, they should establish determination as an immeasurable vessel, not forgetting the accumulation of dharmas, penetrating wisdom, or explaining dharmas.",
        "source": "T15n0627_001:0408a15_6"
    },
    {
        "source_sentence": "以平等法為眾生說，當習一切諸德善法。",
        "translation": "Teaching the Dharma of equality for sentient beings, they should cultivate all virtues and good qualities.",
        "source": "T15n0627_001:0408a16_7"
    },
    {
        "source_sentence": "如是具足無數佛法，以如是心被戒德鎧，則應大乘諸通慧矣！」",
        "translation": "Thus, they are endowed with countless buddha-dharmas and thus armed with the virtue of morality in their minds, then they should have great vehicle supernormal wisdom!",
        "source": "T15n0627_001:0408a17_8"
    },
    {
        "source_sentence": "大山菩薩曰：「仁者當知，其此乘者，普超諸世則謂佛慧，其行所入不可限量，",
        "translation": "The great mountain bodhisattva said, “Friend, know that this vehicle transcends all worlds and is called buddha-knowledge.",
        "source": "T15n0627_001:0408a20_0"
    },
    {
        "source_sentence": "由是之故超度一切世間志性；",
        "translation": "Because of this, they transcend all worldly aspirations.",
        "source": "T15n0627_001:0408a21_1"
    },
    {
        "source_sentence": "已能超度世間所行，其所信者過於俗間；",
        "translation": "They have already transcended worldly practices, and their faith surpasses that of the mundane.",
        "source": "T15n0627_001:0408a22_2"
    },
    {
        "source_sentence": "已過俗間，其所施者、持戒、忍辱、精進、一心、智慧，亦復如是，悉能超度一切世間之所有慧，",
        "translation": "“Furthermore, the same applies to those who have already gone beyond the mundane. Their donations, observance of moral precepts, patience, energy, one-pointedness of mind, and wisdom are also able to transcend all worldly wisdoms.",
        "source": "T15n0627_001:0408a23_3"
    },
    {
        "source_sentence": "其所造福過於世間所興福祚，則應大乘諸通慧矣！」",
        "translation": "If the merit they create is greater than the worldly merit that's produced, then it should be the great vehicle of supernormal wisdom!",
        "source": "T15n0627_001:0408a25_4"
    },
    {
        "source_sentence": "喜見菩薩曰：「假使菩薩目所視色而無所惡，色之自然其心清淨；",
        "translation": "The Bodhisattva Joyful Vision said, “Even if the bodhisattva’s eyes did not see anything bad in the form he saw, his mind would naturally be pure.",
        "source": "T15n0627_001:0408a27_0"
    },
    {
        "source_sentence": "耳所聽聞亦無所惡，音聲自然其心清淨；",
        "translation": "What they hear and hear in their ears is also not unwholesome; the sound naturally purifies their minds.",
        "source": "T15n0627_001:0408a28_1"
    },
    {
        "source_sentence": "鼻香、舌味、及身更、心法，於六情界而無所惡，其六情界自然本寂。",
        "translation": "The nose, odor, taste of the tongue, body, and mind are not bad to the six emotional realms, which are naturally originally quiescent in their six emotional realms.",
        "source": "T15n0627_001:0408a29_2"
    },
    {
        "source_sentence": "其心清淨，其於憎愛心無所著；",
        "translation": "Their minds are pure, not attached to hatred or attachment.",
        "source": "T15n0627_001:0408b01_3"
    },
    {
        "source_sentence": "其心清淨，觀于眾生順佛法者器無不應，又其眾生處邪見者亦復覩之在佛法器；",
        "translation": "Their minds are pure, and they observe all sentient beings who follow the Buddha’s teaching. There is nothing in their vessel that should not be given to them. Furthermore, those sentient beings with wrong views also pity [them] within the Buddha’s Dharma vessel.",
        "source": "T15n0627_001:0408b02_4"
    },
    {
        "source_sentence": "其愛己者在於王者歡喜習俗；",
        "translation": "Those who love themselves are in the king’s palace, rejoicing in their customs.",
        "source": "T15n0627_001:0408b04_5"
    },
    {
        "source_sentence": "有所施與尋復悔者等敬若茲。",
        "translation": "If someone gives something and repents, they'll be honored like this.",
        "source": "T15n0627_001:0408b05_6"
    },
    {
        "source_sentence": "菩薩大士所行如是，則應大乘諸通慧矣！」",
        "translation": "What bodhisattvas and great men do like this, then they should have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0408b05_7"
    },
    {
        "source_sentence": "喜王菩薩曰：「假使有人罵詈誹謗、輕易毀辱、撾捶打撲於菩薩者，心不懷恨而加喜悅，",
        "translation": "The joy-king bodhisattva said, Suppose someone ridicules and denigrates the bodhisattva, disrespectfully disparages him or scolds him with beating and beating, doesn’t harbor hatred in their minds, and gives rise to joy and happiness.",
        "source": "T15n0627_001:0408b07_0"
    },
    {
        "source_sentence": "以善友想待遇對者，而能忍辱現于忍力，其心欣豫思惟其法：『何所是罵，",
        "translation": "He treats those who are oppressed by the thought of a good friend, yet he can tolerate and show them the power of forbearance. His mind is joyful and contemplates his teaching:",
        "source": "T15n0627_001:0408b08_1"
    },
    {
        "source_sentence": "誰為罵者？』",
        "translation": "Who's the one who scolds?'",
        "source": "T15n0627_001:0408b10_2"
    },
    {
        "source_sentence": "信解內空不疑外空，自見己身又覩他人則歡喜悅，便能惠施身命、支體、頭眼、手足、妻子、男女、國城、丘聚、財穀、珍寶，",
        "translation": "Being convinced of internal emptiness and not doubting external emptiness, they see their own bodies and pity others with joy. They can then give alms to the body, life, limbs, head, eyes, hands, feet, wives, men, women, cities, hills, property, grains, and precious treasures.",
        "source": "T15n0627_001:0408b10_3"
    },
    {
        "source_sentence": "倍復踊躍。",
        "translation": "He doubled and jumped again.",
        "source": "T15n0627_001:0408b13_4"
    },
    {
        "source_sentence": "寧聞一頌恬忽世榮、轉輪王位，常樂為人講說經法不羨帝釋，思開一人使發道心不僥梵天，",
        "translation": "I would rather hear a verse that quietly praises worldly prosperity and the throne of universal kingship, always gladly expounding the scriptures and teachings for people without envy to Indra. I wish to enlighten one person so that they will give rise to the aspiration for enlightenment but not Brahmā.",
        "source": "T15n0627_001:0408b13_5"
    },
    {
        "source_sentence": "願見如來不貪三千大千世界滿溢珂珍，從生明達不乏諸根，信樂愛敬諸道品法。",
        "translation": "May I see that the Tathāgata doesn't crave the 3,000 great one-thousand worlds filled with treasures, that from birth he understands without lack of faculties, and that he believes in and loves the teachings of the factors of the path.",
        "source": "T15n0627_001:0408b15_6"
    },
    {
        "source_sentence": "如是悅樂所造行者，則應大乘諸通慧矣！」",
        "translation": "If someone thus creates practices that are pleasant, then they should have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0408b17_7"
    },
    {
        "source_sentence": "察無圻菩薩曰：「假使見一切法度于彼岸，不墮貪身淨諸佛土，覩諸佛國皆亦清淨亦無想行，",
        "translation": "The Bodhisattva Vairocana Kassapa said, “Even if one were to see all the teachings and cross over to the other shore, he would not fall into the pure buddha-lands of greedy bodies.",
        "source": "T15n0627_001:0408b19_0"
    },
    {
        "source_sentence": "見一切佛不發色想，見諸群黎想：『雖有肉眼覩罪福淨；",
        "translation": "Seeing all buddhas not giving rise to ideations of form, they see the masses with such thoughts:",
        "source": "T15n0627_001:0408b21_1"
    },
    {
        "source_sentence": "具足天眼得無所壞；",
        "translation": "They are endowed with the divine eye and attain nothing to be destroyed.",
        "source": "T15n0627_001:0408b22_2"
    },
    {
        "source_sentence": "雖得慧眼離諸塵勞；",
        "translation": "Even though they had attained the eye of knowledge, they were freed from all worldly afflictions.",
        "source": "T15n0627_001:0408b22_3"
    },
    {
        "source_sentence": "信樂佛眼具足成就十八不共諸佛之法；",
        "translation": "They believed in the enlightened eye and perfected the eighteen unique qualities of buddhahood.",
        "source": "T15n0627_001:0408b23_4"
    },
    {
        "source_sentence": "已得法眼具足如來十種之力。』",
        "translation": "They've already attained the Dharma eye that's replete with the Tathāgata's ten kinds of power.'",
        "source": "T15n0627_001:0408b24_5"
    },
    {
        "source_sentence": "假使菩薩所被德鎧信行如斯，則應大乘諸通慧矣！」",
        "translation": "If the bodhisattva were to believe and practice like this, then he would have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0408b25_0"
    },
    {
        "source_sentence": "遊無際法行菩薩曰：「族姓子！",
        "translation": "The Bodhisattva Traveling to the Practice of the Dharma without Limit said, Clansman!",
        "source": "T15n0627_001:0408b27_0"
    },
    {
        "source_sentence": "知一切緣菩薩所為，則悉歸趣諸通敏慧。",
        "translation": "Knowing all the conditions for what bodhisattvas do, they all return to their supernormal abilities and insight.",
        "source": "T15n0627_001:0408b27_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0408b28_2"
    },
    {
        "source_sentence": "觀諸所有一切因緣，不住於內、不處於外、不在口言。",
        "translation": "Observing all the causes and conditions that exist, they don't abide inside, outside, or in words.",
        "source": "T15n0627_001:0408b28_3"
    },
    {
        "source_sentence": "假使菩薩不住因緣，亦不御趣塵勞之礙；",
        "translation": "“Even if enlightening beings did not abide in causes and conditions, they would not be hindered by the worldly whirl.",
        "source": "T15n0627_001:0408c01_0"
    },
    {
        "source_sentence": "亦不勸導罪福之礙，無報應礙、無諸根礙、無諸法礙、無非慧礙，已度罪福塵垢魔界，",
        "translation": "Nor does he encourage and guide the obstacle of sins and merits, nor is there an obstacle to retribution or response, an obstacle to faculties, an obstacle to dharmas, or an obstacle to what’s not wisdom. He has already liberated himself from the defilement of sins, merits, and dust of the realm of Māra.",
        "source": "T15n0627_001:0408c01_1"
    },
    {
        "source_sentence": "則應大乘諸通慧矣！」",
        "translation": "Then you should have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0408c03_2"
    },
    {
        "source_sentence": "超魔見菩薩曰：「惟、族姓子！",
        "translation": "When Māra saw the bodhisattva, he said, Yes, clansmen!",
        "source": "T15n0627_001:0408c05_0"
    },
    {
        "source_sentence": "已住吾我自見己身，則便處于魔之事業；",
        "translation": "If one already abides in self and sees his own body, he will be caught up in the deeds of Māra.",
        "source": "T15n0627_001:0408c05_1"
    },
    {
        "source_sentence": "已斷吾我不覩所虛；",
        "translation": "They have abandoned self, which is not deceitful or false.",
        "source": "T15n0627_001:0408c06_2"
    },
    {
        "source_sentence": "已除所見則無諸陰；",
        "translation": "In addition to that which is seen, there are no aggregates.",
        "source": "T15n0627_001:0408c07_0"
    },
    {
        "source_sentence": "已除諸陰則不見魔；",
        "translation": "Having removed the aggregates, they do not see Māra.",
        "source": "T15n0627_001:0408c07_1"
    },
    {
        "source_sentence": "已度魔界則尋逮成無礙脫門。",
        "translation": "Once he has crossed the demonic realm, then he'll search for and acquire the unobstructed gate of liberation.",
        "source": "T15n0627_001:0408c07_2"
    },
    {
        "source_sentence": "菩薩已逮無礙脫門，則應大乘諸通慧矣！」",
        "translation": "After the bodhisattva has attained the gate of unobstructed liberation, then he should have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0408c08_3"
    },
    {
        "source_sentence": "無憂施菩薩曰：「仁者當知，其犯惡者後懷湯火；",
        "translation": "The charity Bodhisattva Aśoka said, “Friend, you should know that anyone who commits an evil deed will be left to harbor the hot water and fire.",
        "source": "T15n0627_001:0408c10_0"
    },
    {
        "source_sentence": "其為善業後無憂慼。",
        "translation": "It's because of good actions that there's no grief afterward.",
        "source": "T15n0627_001:0408c11_1"
    },
    {
        "source_sentence": "是故菩薩當修善業，其所作者無能說短；",
        "translation": "Therefore, enlightening beings should cultivate virtuous deeds. The authors of these good deeds cannot describe their shortcomings.",
        "source": "T15n0627_001:0408c11_2"
    },
    {
        "source_sentence": "所興造者後無所悔、無諸礙蓋。",
        "translation": "Those who are produced and created have no regrets or hindrances afterward.",
        "source": "T15n0627_001:0408c12_3"
    },
    {
        "source_sentence": "假使眾生愁憂不樂，則為講說離憂之法。",
        "translation": "If sentient beings are sad and unhappy, then he teaches them the way to be free of sorrow.",
        "source": "T15n0627_001:0408c13_4"
    },
    {
        "source_sentence": "菩薩大士如是行者，則應大乘諸通慧矣！」",
        "translation": "If bodhisattvas and great men thus practice, then they should follow the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0408c14_5"
    },
    {
        "source_sentence": "諸議告菩薩曰：「惟、族姓子！",
        "translation": "The councilors told the bodhisattva, Yes, clansmen!",
        "source": "T15n0627_001:0408c16_0"
    },
    {
        "source_sentence": "其有士夫奉禁戒者所願必獲，已獲所願，所獲立本由無放逸，立無逸已具道品法；",
        "translation": "A person who keeps the precepts necessarily obtains what he wishes. He has already obtained what he wishes. The attainment is established on the basis of nonfrivolity, establishing that nonfrivolity belongs to the class of enlightenment.",
        "source": "T15n0627_001:0408c16_1"
    },
    {
        "source_sentence": "已能具立道品之法，則諸通慧戒禁之正也。",
        "translation": "If someone can fully establish the teachings of the factors of the path, then the precepts and prohibitions of penetrating wisdom are the correct ones.",
        "source": "T15n0627_001:0408c18_2"
    },
    {
        "source_sentence": "菩薩已住無逸道法，則應大乘諸通慧矣！」",
        "translation": "A bodhisattva who has abided in the principle of the path of nonfrivolity, then he should have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0408c19_3"
    },
    {
        "source_sentence": "普花天子曰：「譬族姓子！",
        "translation": "Puhua Devānām-Indra said, Like a clansman!",
        "source": "T15n0627_001:0408c21_0"
    },
    {
        "source_sentence": "樹花盛時多所饒益於一切人，菩薩以功德本而自莊嚴，猶樹花茂饒益群黎，",
        "translation": "When the trees and flowers flourish, they mostly benefit all people. The enlightening beings adorn themselves with their roots of virtue, just as when the trees and flowers flourish, they benefit all living beings.",
        "source": "T15n0627_001:0408c21_1"
    },
    {
        "source_sentence": "如忉利天晝度之樹紛葩茂盛，忉利諸天莫不敬仰。",
        "translation": "It's like the trees of the Trāyastriṃśa gods that grow in abundance during the daytime, and none of the Trāyastriṃśa gods don't venerate them.",
        "source": "T15n0627_001:0408c23_2"
    },
    {
        "source_sentence": "菩薩如是以諸法門而自挍飾，諸天、龍、神、揵沓和、世人、阿須倫靡不宗戴，",
        "translation": "The enlightening beings thus adorn themselves with these teachings, and gods, dragons, spirits, titans, humans, and asuras all embrace them.",
        "source": "T15n0627_001:0408c24_3"
    },
    {
        "source_sentence": "猶如天上明月之珠，無有瑕穢眾德具足。",
        "translation": "It's like the pearl of the bright moon in heaven, which has no flaws or defilements and is replete with virtue.",
        "source": "T15n0627_001:0408c26_4"
    },
    {
        "source_sentence": "開士志性清淨無瑕德議顯備，則應大乘諸通慧矣！」",
        "translation": "If the enlightened man's aspiration is pure, unblemished, and his virtues are discussed and revealed, then he should have great vehicle supernormal wisdom!",
        "source": "T15n0627_001:0408c27_5"
    },
    {
        "source_sentence": "光華天子曰：「譬，族姓子！",
        "translation": "Guanghua Devānām-Indra said, Parable, clansman!",
        "source": "T15n0627_001:0408c29_0"
    },
    {
        "source_sentence": "日出光明滅除眾冥終始光現，菩薩如是具足慧光、慧法施世，為諸愚冥無明眾生，",
        "translation": "When the light of the sun rises, it extinguishes all darkness and begins to shine. Enlightening beings are thus endowed with the light of wisdom and the principles of wisdom and bestow them on the world for the sake of sentient beings who are ignorant and ignorant:",
        "source": "T15n0627_001:0408c29_1"
    },
    {
        "source_sentence": "顯示大光導自然法，其幽闇者不能蔽暉；",
        "translation": "They show great light, guiding the natural dharmas; those in darkness cannot overwhelmed it.",
        "source": "T15n0627_001:0409a02_2"
    },
    {
        "source_sentence": "其光明者則能消冥，導示徑路，已住徑路。",
        "translation": "That light will then be able to dispel darkness and show the path, and he's already staying on the path.",
        "source": "T15n0627_001:0409a03_3"
    },
    {
        "source_sentence": "菩薩大士其在邪徑，示現正路、已住正路，則應大乘諸通慧矣！」",
        "translation": "If the bodhisattva-mahāsattva is on a wrong path and shows the right path and has stayed on the right path, then he should have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0409a04_4"
    },
    {
        "source_sentence": "心華香天子曰：「譬，族姓子！",
        "translation": "The goddess of the mind-flower fragrance said, Parable, clansman!",
        "source": "T15n0627_001:0409a06_0"
    },
    {
        "source_sentence": "心華之樹其香普熏周四十里，其香無想。",
        "translation": "The fragrance of the tree of the heart-flower permeates all forty li, and its odor has no ideation.",
        "source": "T15n0627_001:0409a06_1"
    },
    {
        "source_sentence": "菩薩如是，以戒、博聞、定、慧、解度知見之香以為芬熏，三千大千世界以法之香靡不周遍，",
        "translation": "“Thus do enlightening beings perfume the world with the fragrance of precepts, learning, concentration, wisdom, liberation, insight, knowledge, and vision, pervading 3,000 great chiliocosms with the fragrance of truth.",
        "source": "T15n0627_001:0409a07_2"
    },
    {
        "source_sentence": "一切眾病香即療愈。",
        "translation": "The fragrance of all the illnesses will then heal them.",
        "source": "T15n0627_001:0409a09_3"
    },
    {
        "source_sentence": "假使菩薩被此法香，則應大乘諸通慧矣！」",
        "translation": "If a bodhisattva were to be perfumed by this fragrance of the Dharma, then he would have the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0409a10_0"
    },
    {
        "source_sentence": "常進法行天子曰：「仁者當知，其精進者無懈怠心，是故菩薩修諸德本而不厭惓，",
        "translation": "The celestial being Always Advancing in Practice of the Dharma said, “Friend, you should know that this energetic one has no lazy thoughts. Therefore, enlightening beings cultivate the roots of virtue and are not disillusioned with them.",
        "source": "T15n0627_001:0409a11_0"
    },
    {
        "source_sentence": "常當遵崇志八法行。",
        "translation": "They should always follow and honor the eight practices of the Dharma.",
        "source": "T15n0627_001:0409a12_1"
    },
    {
        "source_sentence": "何等八？",
        "translation": "What are the eight?",
        "source": "T15n0627_001:0409a13_2"
    },
    {
        "source_sentence": "六度無極、四等梵行、遊步五通、而以四恩救攝群萌、志三脫門逮得法忍、勸勉佛慧、開化眾生令發道意、導權方便接齊有為所有諸法，",
        "translation": "The six perfections are infinite, the four equal religious practices, the five supernormal powers of wandering and walking, the four kinds of benevolence to save sentient beings, the three liberations of resolve to attain the tolerance of the Dharma, the exhortation of Buddha's wisdom, the enlightenment of sentient beings so that they will give rise to the",
        "source": "T15n0627_001:0409a13_3"
    },
    {
        "source_sentence": "是為八。",
        "translation": "These are the eight.",
        "source": "T15n0627_001:0409a16_4"
    },
    {
        "source_sentence": "遵崇八法之行，則應大乘諸通慧矣！」",
        "translation": "If you revere the practice of the eight dharmas, then you should follow the great vehicle's supernormal wisdom!",
        "source": "T15n0627_001:0409a16_5"
    },
    {
        "source_sentence": "於是軟首語諸正士及天子曰：「仁者！",
        "translation": "The soft-headed one then said to the correct men and celestial sons, Sir!",
        "source": "T15n0627_001:0409a18_0"
    },
    {
        "source_sentence": "欲知菩薩精進若不精進至諸通慧？",
        "translation": "Do you want to know whether a bodhisattva's effort is exerted or not exerted up to the point of penetrating wisdom?",
        "source": "T15n0627_001:0409a18_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0409a19_2"
    },
    {
        "source_sentence": "其翫習者行在三界，若遵修者謂諸往見；",
        "translation": "Those who are accustomed to sexual misconduct abide in the three realms. Those who follow and practise it are said to be those of former existences.",
        "source": "T15n0627_001:0409a19_3"
    },
    {
        "source_sentence": "其翫習者是謂為內，亦不翫習是謂為外；",
        "translation": "This is what I call internal. The absence of permeation is also what I call external.",
        "source": "T15n0627_001:0409a20_4"
    },
    {
        "source_sentence": "其翫習者謂聲聞地，若遵修者謂緣覺地；",
        "translation": "Those who practice it diligently are said to be in the stage of sravakas. Those who follow and practice it diligently are said to be in the stage of pratyekabuddhas.",
        "source": "T15n0627_001:0409a21_5"
    },
    {
        "source_sentence": "其翫習者謂在眾結所行勤勞，若遵修者則謂所著凡夫之法；",
        "translation": "Those who practice it are said to be diligent in what is practised by the fetters. Those who follow and practice it are said to be attached to worldlings’ dharmas.",
        "source": "T15n0627_001:0409a22_6"
    },
    {
        "source_sentence": "其翫習者即謂為名，若遵修者則謂為色；",
        "translation": "When gross is conditioned, it exactly is called ‘by name.’ When developed, it exactly is what is said to be form.",
        "source": "T15n0627_001:0409a24_7"
    },
    {
        "source_sentence": "其翫習者即謂報應，若遵修者則謂所見；",
        "translation": "Those who practice it are said to be retribution. Those who follow and cultivate it are said to be what they see.",
        "source": "T15n0627_001:0409a25_8"
    },
    {
        "source_sentence": "其翫習者謂有所著，若遵修者則謂有所得；",
        "translation": "Those who cultivate it are said to have attachment. Those who follow and practice it are said to have gained [something].",
        "source": "T15n0627_001:0409a26_9"
    },
    {
        "source_sentence": "其翫習者即謂我所，若遵修者則謂吾身；",
        "translation": "Those who practice it are said to be self; those who follow and practice it are said to be self.",
        "source": "T15n0627_001:0409a27_10"
    },
    {
        "source_sentence": "其翫習者即謂慳貪，若遵修者則謂布施而不想慢；",
        "translation": "Those who are accustomed to hatred are said to be stingy and greedy. Those who follow and practice it are said to be generous but not conceited.",
        "source": "T15n0627_001:0409a28_11"
    },
    {
        "source_sentence": "其翫習者即謂犯戒，若遵修者則謂持戒而不想慢；",
        "translation": "Those who practice sexual misconduct are said to have violated the precepts. Those who follow and practice them are said to keep the precepts without being conceited.",
        "source": "T15n0627_001:0409a29_12"
    },
    {
        "source_sentence": "其翫習者謂瞋怒，若遵修者則謂忍辱而不想慢；",
        "translation": "The permeation by hatred is what is called ‘hatred’. If one follows and develops it, then he is said to be patient and not self-conceited.",
        "source": "T15n0627_001:0409b01_13"
    },
    {
        "source_sentence": "其翫習者謂懈怠，若遵修者則謂精進而不想慢；",
        "translation": "Those who are accustomed to hatred are said to be lazy. Those who follow and practice it are said to be energetic and not self-conceited.",
        "source": "T15n0627_001:0409b02_14"
    },
    {
        "source_sentence": "其翫習者謂亂意，若遵修者則謂一心而不想慢；",
        "translation": "The permeation of hatred is said to be distraction. Those who follow and practice it are said to be one-pointed but not conceited.",
        "source": "T15n0627_001:0409b03_15"
    },
    {
        "source_sentence": "其翫習者謂愚癡，若遵修者則謂智慧而不想慢；",
        "translation": "Those who are accustomed to hatred are said to be ignorant. Those who follow and practice them are said to be wise but not conceited.",
        "source": "T15n0627_001:0409b04_16"
    },
    {
        "source_sentence": "其翫習者謂不善本，若遵修者謂等善本而不想慢；",
        "translation": "Those who cultivate it are said to be the roots of evil. Those who follow and practice it are said to be equal to the roots of wholesomeness without being conceited.",
        "source": "T15n0627_001:0409b06_17"
    },
    {
        "source_sentence": "其翫習者謂無福根，若遵修者謂殖德本而不想慢；",
        "translation": "Those who cultivate it are said to be without roots of merit. Those who do so are said to plant roots of virtue and not feel conceit.",
        "source": "T15n0627_001:0409b07_18"
    },
    {
        "source_sentence": "其翫習者謂世俗法，若遵修者謂度世法而不想慢；",
        "translation": "Those who cultivate it are said to be worldly dharmas. Those who follow and practice it are said to have liberated themselves from worldly dharmas without being conceited.",
        "source": "T15n0627_001:0409b08_19"
    },
    {
        "source_sentence": "其翫習者謂有為法，若遵修者謂無為法而不想慢；",
        "translation": "The permeation of hatred means conditioned factors. Those who follow and practice it mean unconditioned factors, but they do not feel conceit.",
        "source": "T15n0627_001:0409b09_20"
    },
    {
        "source_sentence": "其翫習者謂為罪，若遵修者謂無罪法而不想慢；",
        "translation": "Those who practice it are said to be sinners. Those who follow and practice it are said to be blameless in doctrine, without self-conceit.",
        "source": "T15n0627_001:0409b10_21"
    },
    {
        "source_sentence": "其翫習者謂諸漏，若遵修者則謂無漏而不想慢。",
        "translation": "Those who are accustomed to anger refer to the contaminants, and those who cultivate it say they're uncontaminated but don't want to be conceited.",
        "source": "T15n0627_001:0409b11_22"
    },
    {
        "source_sentence": "是謂翫習至於遵修離諸所見，不著不斷菩薩指趣，則應大乘諸通慧矣！",
        "translation": "This is called the great vehicle of penetrating wisdom that follows and cultivates what's seen, doesn't cling to or stop following the bodhisattva's pointing path, and then it should be the great vehicle of penetrating wisdom!",
        "source": "T15n0627_001:0409b13_23"
    },
    {
        "source_sentence": "「又次，仁者！",
        "translation": "Furthermore, my dear friend!",
        "source": "T15n0627_001:0409b14_24"
    },
    {
        "source_sentence": "而不得至於諸通慧。",
        "translation": "They can't reach the level of penetrating wisdom.",
        "source": "T15n0627_001:0409b14_25"
    },
    {
        "source_sentence": "何故不至？",
        "translation": "Why doesn't it reach them?",
        "source": "T15n0627_001:0409b15_26"
    },
    {
        "source_sentence": "以何等至諸通敏慧？",
        "translation": "By means of what kinds of supernormal knowledge are they attained?",
        "source": "T15n0627_001:0409b15_27"
    },
    {
        "source_sentence": "諸通慧者離諸所作，其諸通慧亦無所至，亦無有逮諸通慧者。",
        "translation": "Those with penetrating wisdom are free of what they do, and their penetrating wisdom doesn't reach anything, and there's no one who apprehends the penetrating wisdom.",
        "source": "T15n0627_001:0409b16_28"
    },
    {
        "source_sentence": "又諸通慧亦無色像、亦無痛痒、思想、生死、識之形貌也；",
        "translation": "The supernormal knowledges also have no form or shape, and they do not experience pain or itch, thought or thought-concomitance, birth or death, or the appearance of consciousness.",
        "source": "T15n0627_001:0409b17_29"
    },
    {
        "source_sentence": "其諸通慧亦無法則亦無非法。",
        "translation": "If their supernormal cognition is also nonexistent, then there's nothing unlawful.",
        "source": "T15n0627_001:0409b18_30"
    },
    {
        "source_sentence": "其諸通慧亦無有施。",
        "translation": "Nor does their supernormal wisdom have generosity.",
        "source": "T15n0627_001:0409b19_31"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0409b20_0"
    },
    {
        "source_sentence": "諸通慧者則為施與。",
        "translation": "Those with supernormal cognition then give it as a gift.",
        "source": "T15n0627_001:0409b20_1"
    },
    {
        "source_sentence": "又諸通慧無有持戒、忍辱、精進、一心、智慧。",
        "translation": "Furthermore, there's no observance of precepts, forbearance, effort, unity of mind, or wisdom in supernormal cognition.",
        "source": "T15n0627_001:0409b20_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0409b21_3"
    },
    {
        "source_sentence": "諸通慧者則自然聖。",
        "translation": "Those with supernormal cognition are naturally noble.",
        "source": "T15n0627_001:0409b21_4"
    },
    {
        "source_sentence": "諸通慧者無去來今。",
        "translation": "Those with supernormal cognition have no past, future, or present.",
        "source": "T15n0627_001:0409b22_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0409b22_6"
    },
    {
        "source_sentence": "其諸通慧超度三世。",
        "translation": "His supernormal wisdom transcends the three worlds.",
        "source": "T15n0627_001:0409b23_7"
    },
    {
        "source_sentence": "諸通慧者無眼、耳、鼻、口、身、心識。",
        "translation": "The penetrating wisdoms lack the eye, ear, nose, mouth, body, and mind consciousnesses.",
        "source": "T15n0627_001:0409b23_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0409b24_9"
    },
    {
        "source_sentence": "度諸界故。",
        "translation": "It's because they liberate the elements.",
        "source": "T15n0627_001:0409b24_10"
    },
    {
        "source_sentence": "「諸仁！",
        "translation": "Gentlemen!",
        "source": "T15n0627_001:0409b24_11"
    },
    {
        "source_sentence": "欲知諸通慧者，若有菩薩欲得通慧住如通慧，當云何住？",
        "translation": "Those who want to know about the penetrating wisdoms, if a bodhisattva wants to attain penetrating wisdom and abide like penetrating wisdom, how will he abide?",
        "source": "T15n0627_001:0409b24_12"
    },
    {
        "source_sentence": "於一切法而無所住，斯則為住。",
        "translation": "In all dharmas, there's nothing to abide in, and this is abiding.",
        "source": "T15n0627_001:0409b26_13"
    },
    {
        "source_sentence": "於諸通慧一切諸法皆非我所，斯諸通慧於一切法無所猗著；",
        "translation": "All things are not the property of self in all their supernormal knowledges; these supernormal knowledges have no attachment to anything.",
        "source": "T15n0627_001:0409b26_14"
    },
    {
        "source_sentence": "斯諸通慧等凡夫地、等於佛地，於一切法亦為平等；",
        "translation": "These higher faculties and knowledge are equal to worldlings’ stages and equal to buddhas’ stages. They are also equal in all things.",
        "source": "T15n0627_001:0409b28_15"
    },
    {
        "source_sentence": "斯諸通慧又行菩薩不當於餘求。",
        "translation": "These are the supernormal knowledges that also practice bodhisattvas who shouldn't seek them from others.",
        "source": "T15n0627_001:0409b29_16"
    },
    {
        "source_sentence": "諸通慧惟當從此四大界求自然造行。",
        "translation": "Only the supernormal wisdoms will naturally create practices from these four great realms.",
        "source": "T15n0627_001:0409c01_17"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0409c02_18"
    },
    {
        "source_sentence": "斯自然者此無所有；",
        "translation": "This is spontaneous, because this has no existence.",
        "source": "T15n0627_001:0409c02_19"
    },
    {
        "source_sentence": "斯自然者則無有形，於是善法名曰我身；",
        "translation": "As a result, the good doctrine is called self-body.",
        "source": "T15n0627_001:0409c02_20"
    },
    {
        "source_sentence": "於我身者而無有身、無有善惡、無我、無壽、無命、無人。",
        "translation": "In my body, there's no body, no goodness or evil, no self, no life, no life, and no person.",
        "source": "T15n0627_001:0409c03_21"
    },
    {
        "source_sentence": "假令我身則無所有亦復無有，彼則無行亦無所有，彼所有形則亦無實，",
        "translation": "“If it were so, the self-body would have no existence and also no existence; they would have no formations and no existence; what they have is formless as well.",
        "source": "T15n0627_001:0409c05_22"
    },
    {
        "source_sentence": "其所見者亦無所有亦無有實，其慧見於所有無有、有實無實等，斯諸慧則諸通慧！」",
        "translation": "What they see is neither existent nor real, and their wisdom sees that what exists is nonexistent, has reality or no reality, and so forth, and these kinds of wisdom are the supernormal wisdoms!",
        "source": "T15n0627_001:0409c06_23"
    },
    {
        "source_sentence": "軟首童真說是語時，二千天子得不起法忍，萬二千人皆發無上正真道意。",
        "translation": "When soft-headed童真 spoke these words, 2,000 celestial beings attained the forbearance of not rising above the Dharma, and 12,000 people aroused the intention for the unsurpassed true path.",
        "source": "T15n0627_001:0409c08_24"
    },
    {
        "source_sentence": "化佛品第二",
        "translation": "The Second Chapter of the Transformation Buddha Chapter",
        "source": "T15n0627_001:0409c11_0"
    },
    {
        "source_sentence": "於是辯積菩薩白軟首曰：「且當俱往覲于如來，面問大聖：『菩薩大士當興何行？』」",
        "translation": "The eloquent bodhisattva then said to soft-headed Bodhisattva, Let's all go see the Tathāgata and ask the great sage face-to-face, 'What actions will the bodhisattva-mahāsattva perform?'",
        "source": "T15n0627_001:0409c12_0"
    },
    {
        "source_sentence": "軟首尋於其處化作如來，其體形像如能仁佛。",
        "translation": "The soft-headed man found a place where he transformed himself into a tathāgata, whose body and form were like the Nengren fo.",
        "source": "T15n0627_001:0409c13_1"
    },
    {
        "source_sentence": "軟首童真謂辯積曰：「族姓子！",
        "translation": "The soft-headed boy said to Bimbisāra, Clansman!",
        "source": "T15n0627_001:0409c14_2"
    },
    {
        "source_sentence": "如來在斯，何不啟問菩薩大士所設之行？」",
        "translation": "When the Tathāgata is here, why doesn't he ask about the practices established by the bodhisattva-mahāsattva?",
        "source": "T15n0627_001:0409c15_3"
    },
    {
        "source_sentence": "於是辯積問化如來：「唯然。",
        "translation": "He then asked the Tathāgata Prabhūtaratna, Yes.",
        "source": "T15n0627_001:0409c16_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0627_001:0409c17_5"
    },
    {
        "source_sentence": "菩薩大士當設何行？」",
        "translation": "What will the bodhisattva-mahāsattva do?",
        "source": "T15n0627_001:0409c17_6"
    },
    {
        "source_sentence": "時佛告曰：「如我所設，菩薩亦當修如是行。」",
        "translation": "The Buddha then told them, As I did, the bodhisattva will also cultivate such practices.",
        "source": "T15n0627_001:0409c17_7"
    },
    {
        "source_sentence": "又問：「云何世尊所造立行？」",
        "translation": "Again, he asked, What are the practices created by the Bhagavān?",
        "source": "T15n0627_001:0409c18_8"
    },
    {
        "source_sentence": "其佛答曰：「亦不行施、不行禁戒、不行忍辱、不行精進、不行一心、不行智慧。",
        "translation": "The Buddha answered, They don't practice generosity, don't practice precepts, don't practice forbearance, don't practice effort, don't practice unity of mind, and don't practice wisdom.",
        "source": "T15n0627_001:0409c19_9"
    },
    {
        "source_sentence": "不行欲界、不行色界、不行無色界。",
        "translation": "They don't practice in the desire realm, form realm, or formless realm.",
        "source": "T15n0627_001:0409c20_10"
    },
    {
        "source_sentence": "不造身行、不造言行、心無念行。",
        "translation": "They don't create bodily actions, speech actions, or mindless actions.",
        "source": "T15n0627_001:0409c21_11"
    },
    {
        "source_sentence": "一切無行亦無因緣，是菩薩行。",
        "translation": "The absence of all practices and the absence of causes and conditions are bodhisattva practices.",
        "source": "T15n0627_001:0409c22_12"
    },
    {
        "source_sentence": "於族姓子心趣云何？",
        "translation": "What's the mental destiny of clansmen?",
        "source": "T15n0627_001:0409c23_13"
    },
    {
        "source_sentence": "其化現者豈有行乎？」",
        "translation": "How could there be practice for someone who manifests it?",
        "source": "T15n0627_001:0409c23_14"
    },
    {
        "source_sentence": "答曰：「天中天！",
        "translation": "He replied, God of gods!",
        "source": "T15n0627_001:0409c24_15"
    },
    {
        "source_sentence": "化者無行。」",
        "translation": "Those who are transformed have no practice.",
        "source": "T15n0627_001:0409c24_16"
    },
    {
        "source_sentence": "報曰：「如是。",
        "translation": "He replied, So it is.",
        "source": "T15n0627_001:0409c24_17"
    },
    {
        "source_sentence": "族姓子！",
        "translation": "clansmen!",
        "source": "T15n0627_001:0409c25_0"
    },
    {
        "source_sentence": "菩薩大士當造斯行。」",
        "translation": "A bodhisattva or a great person will create this practice.",
        "source": "T15n0627_001:0409c25_1"
    },
    {
        "source_sentence": "辯積菩薩白軟首曰：「豈所見佛將無化乎？」",
        "translation": "The eloquent bodhisattva said to soft-headed Bodhisattva, How could you have seen that the Buddha would not be transformed?",
        "source": "T15n0627_001:0409c25_2"
    },
    {
        "source_sentence": "軟首答曰：「仁者！",
        "translation": "Kumārajīva replied, Sir!",
        "source": "T15n0627_001:0409c26_3"
    },
    {
        "source_sentence": "不聞一切諸法化自然乎？",
        "translation": "Aren't you hearing all the teachings naturally?",
        "source": "T15n0627_001:0409c27_0"
    },
    {
        "source_sentence": "幻變之相而不退轉。」",
        "translation": "It's the mark of illusory transformation that doesn't regress.",
        "source": "T15n0627_001:0409c27_1"
    },
    {
        "source_sentence": "報曰：「如是！",
        "translation": "He replied, So it is!",
        "source": "T15n0627_001:0409c28_2"
    },
    {
        "source_sentence": "諸法實化，自然幻變而不退轉。」",
        "translation": "The dharmas are really transformed, naturally illusory and not regressing.",
        "source": "T15n0627_001:0409c28_3"
    },
    {
        "source_sentence": "答曰：「今族姓子！",
        "translation": "He answered, Now, clansmen!",
        "source": "T15n0627_001:0409c29_0"
    },
    {
        "source_sentence": "何故發言：『今現如來將無化乎？",
        "translation": "Why do you say, 'Now that the Tathāgata is about to go untransformed?'",
        "source": "T15n0627_001:0409c29_1"
    },
    {
        "source_sentence": "一切諸佛及一切法豈不化耶！』」",
        "translation": "Isn't all buddhas and all dharmas transformed?'",
        "source": "T15n0627_001:0410a01_2"
    },
    {
        "source_sentence": "又問：「誰為化者？」",
        "translation": "Again, he asked, Who is the transformation?",
        "source": "T15n0627_001:0410a01_3"
    },
    {
        "source_sentence": "答曰：「自然業淨而化之耳。",
        "translation": "He answered, Naturally, their karma is pure and they're transformed.",
        "source": "T15n0627_001:0410a02_4"
    },
    {
        "source_sentence": "又族姓子！",
        "translation": "Also, clansmen!",
        "source": "T15n0627_001:0410a02_5"
    },
    {
        "source_sentence": "菩薩不當住於我、人、壽、命、佛之聖道及凡夫者，而計有住。」",
        "translation": "A bodhisattva shouldn't abide in self, people, life, lives, the noble path of the buddhas, or worldlings, and he shouldn't think there's abiding.",
        "source": "T15n0627_001:0410a03_0"
    },
    {
        "source_sentence": "辯積問化如來：「世尊！",
        "translation": "Bimbisāra asked the Tathāgata of transformation, Bhagavān!",
        "source": "T15n0627_001:0410a04_1"
    },
    {
        "source_sentence": "何學自致得佛？」",
        "translation": "How can they train themselves to attain Buddhahood?",
        "source": "T15n0627_001:0410a04_2"
    },
    {
        "source_sentence": "答曰：「無所學者則菩薩學。",
        "translation": "He answered, If there's nothing to learn, then bodhisattvas will learn.",
        "source": "T15n0627_001:0410a05_3"
    },
    {
        "source_sentence": "菩薩所學無有形像，亦無倫比；",
        "translation": "What enlightening beings study has no form or shape, and there is also no peer.",
        "source": "T15n0627_001:0410a05_4"
    },
    {
        "source_sentence": "亦無所受、亦非不受；",
        "translation": "There is neither sensation nor non-sensation.",
        "source": "T15n0627_001:0410a06_5"
    },
    {
        "source_sentence": "亦無想念、亦不離想；",
        "translation": "They also have no ideation or thought and are not free from ideation.",
        "source": "T15n0627_001:0410a06_6"
    },
    {
        "source_sentence": "亦無所行、無行不行，則菩薩學。",
        "translation": "If someone doesn't practice anything and doesn't practice nothing, then they'll train as a bodhisattva.",
        "source": "T15n0627_001:0410a07_7"
    },
    {
        "source_sentence": "無著不著、無慢不慢、亦不調戲；",
        "translation": "They have no attachment or attachment, no conceit or pride, and also no playfulness.",
        "source": "T15n0627_001:0410a08_8"
    },
    {
        "source_sentence": "亦不遵修、不離遵修；",
        "translation": "Nor does he follow and do not depart from following.",
        "source": "T15n0627_001:0410a08_9"
    },
    {
        "source_sentence": "無想無取、無所遊居、亦無有想；",
        "translation": "They have no ideation, no apprehension, no dwelling place, and also no ideation.",
        "source": "T15n0627_001:0410a09_10"
    },
    {
        "source_sentence": "不起不滅、不來不去；",
        "translation": "Neither arising nor perishing, neither coming nor going.",
        "source": "T15n0627_001:0410a10_11"
    },
    {
        "source_sentence": "無住無化、亦無有形、亦無言詞，普離一切諸所想行，則菩薩學。",
        "translation": "Without abiding, without transformation, without form, and without words, free of all conceptions and actions, then the bodhisattva trains.",
        "source": "T15n0627_001:0410a10_12"
    },
    {
        "source_sentence": "其作斯學，是為等學。",
        "translation": "This is called equal training when he does so.",
        "source": "T15n0627_001:0410a12_13"
    },
    {
        "source_sentence": "造斯學者則無所趣、則無所增亦無所損；",
        "translation": "Those who study this doctrine will have no destination, nothing to aspire to, nothing to increase, and nothing to lose.",
        "source": "T15n0627_001:0410a12_14"
    },
    {
        "source_sentence": "造斯學者亦無所著、亦無所脫、亦無所染、亦無離塵、亦無結恨，不墮愚冥，",
        "translation": "Those who do so also have no attachment, no liberation, no defilement, no separation from things, and no enmity, and they don’t fall into the darkness of ignorance.",
        "source": "T15n0627_001:0410a13_15"
    },
    {
        "source_sentence": "如是學者乃名為學。",
        "translation": "Such a learner is called a learner.",
        "source": "T15n0627_001:0410a15_16"
    },
    {
        "source_sentence": "學如斯者不詣諸趣。",
        "translation": "Those who train like this won't go to the destinies.",
        "source": "T15n0627_001:0410a15_17"
    },
    {
        "source_sentence": "是故，族姓子！",
        "translation": "Therefore, clansmen!",
        "source": "T15n0627_001:0410a16_18"
    },
    {
        "source_sentence": "菩薩大士欲得逮成無上正真道者，學我所學。」",
        "translation": "If a bodhisattva-mahāsattva wants to attain the unsurpassed true path, he'll train what I've learned.",
        "source": "T15n0627_001:0410a16_19"
    },
    {
        "source_sentence": "又問：「云何佛學？」",
        "translation": "Again, he asked, What is the Buddha's training?",
        "source": "T15n0627_001:0410a17_20"
    },
    {
        "source_sentence": "答曰：「如我無戒，亦無所犯。",
        "translation": "He replied, Just as I have no precepts, there's nothing to violate.",
        "source": "T15n0627_001:0410a17_21"
    },
    {
        "source_sentence": "不施不受、不戒不犯、不忍不瞋、不進不怠、不禪不亂、不智不愚。",
        "translation": "They don't give or receive, don't observe precepts or offenses, don't tolerate or hate, don't advance or lazy, don't meditate or disturb, and don't know or be foolish.",
        "source": "T15n0627_001:0410a18_22"
    },
    {
        "source_sentence": "無學、非無學，無所不行而吾無得亦無所等；",
        "translation": "I am neither still having learning to learn nor beyond learning. There is nothing that I do not practice, and yet I have no attainments or equals.",
        "source": "T15n0627_001:0410a19_23"
    },
    {
        "source_sentence": "無佛無法；",
        "translation": "There is no Buddha and nothing non- buddha.",
        "source": "T15n0627_001:0410a20_24"
    },
    {
        "source_sentence": "亦無我想、亦無人想、亦無壽想、亦無命想、亦無法想；",
        "translation": "They also have no ideation of self, no ideation of person, no ideation of life, no ideation of life, and no ideation of nonexistence.",
        "source": "T15n0627_001:0410a21_25"
    },
    {
        "source_sentence": "亦無有想、亦無無想。",
        "translation": "Neither is there perception nor non-perception.",
        "source": "T15n0627_001:0410a22_26"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0410a22_27"
    },
    {
        "source_sentence": "一切諸法悉無所造。",
        "translation": "All dharmas are completely uncreated.",
        "source": "T15n0627_001:0410a23_28"
    },
    {
        "source_sentence": "一切諸法以無所造，自然如幻，亦無有相、亦無有二；",
        "translation": "All things are naturally illusory because they are not created by anything. They also have no characteristics or distinctions.",
        "source": "T15n0627_001:0410a23_29"
    },
    {
        "source_sentence": "一切諸法離諸所樂；",
        "translation": "All things are free from pleasures.",
        "source": "T15n0627_001:0410a24_30"
    },
    {
        "source_sentence": "一切諸法而不可見；",
        "translation": "All things are invisible.",
        "source": "T15n0627_001:0410a25_31"
    },
    {
        "source_sentence": "一切諸法超度眼句。",
        "translation": "All dharmas transcend the eye phrase.",
        "source": "T15n0627_001:0410a25_32"
    },
    {
        "source_sentence": "諸法平等而無差特；",
        "translation": "All things are equal, without distinctions or differences.",
        "source": "T15n0627_001:0410a26_33"
    },
    {
        "source_sentence": "諸法愚冥亦無所徑、無為無人，故無人言教、故無處所。",
        "translation": "Because the dharmas are ignorant and mysterious, there's no path or place for them, and because there's no one who does nothing, there's no speech or teaching, so there's no place for them.",
        "source": "T15n0627_001:0410a26_34"
    },
    {
        "source_sentence": "無有言教則無所生。",
        "translation": "If there are no words and teachings, nothing will arise.",
        "source": "T15n0627_001:0410a27_35"
    },
    {
        "source_sentence": "其信此者不念所信，亦不自大，亦不念道。",
        "translation": "Those who believe in this don't think about what they believe, don't become arrogant, and don't think of the path.",
        "source": "T15n0627_001:0410a28_36"
    },
    {
        "source_sentence": "是故族姓子！",
        "translation": "Therefore, clansmen!",
        "source": "T15n0627_001:0410a29_37"
    },
    {
        "source_sentence": "若有菩薩如是比類學佛道者，不恐不懼、不難不畏，乃為菩薩！",
        "translation": "If there are bodhisattvas who thus similarly train in the Buddha Way and aren't afraid or difficult or fearful, then they're bodhisattvas!",
        "source": "T15n0627_001:0410a29_38"
    },
    {
        "source_sentence": "「如族姓子！",
        "translation": "Just so, clansmen!",
        "source": "T15n0627_001:0410b02_0"
    },
    {
        "source_sentence": "虛空之畏，不畏於火、不畏於風、不畏於雨、不畏於霧、不畏於塵、不畏於雷、不畏於雲、不畏於電、不畏於雪。",
        "translation": "The fear of space is not afraid of fire, wind, rain, mist, dust, thunder, clouds, lightning, or snow.",
        "source": "T15n0627_001:0410b02_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0410b04_2"
    },
    {
        "source_sentence": "空者自然故曰空畏。",
        "translation": "Because emptiness is natural, it's called the fear of emptiness.",
        "source": "T15n0627_001:0410b04_3"
    },
    {
        "source_sentence": "菩薩如是於一切法而無所畏，於一切法不念苦樂。",
        "translation": "Thus, the bodhisattva has no fear of all dharmas and doesn't think of pain or pleasure in all dharmas.",
        "source": "T15n0627_001:0410b05_4"
    },
    {
        "source_sentence": "假使菩薩心等如是，則能成佛降伏眾魔，則成無上正真之道為最正覺，",
        "translation": "If enlightening beings’ minds were like this, they would become buddhas and conquer all demons. Then they would attain the unexcelled path of truth as the supreme awakening.",
        "source": "T15n0627_001:0410b06_5"
    },
    {
        "source_sentence": "亦能導利一切眾生。」",
        "translation": "They can also guide and benefit all sentient beings.",
        "source": "T15n0627_001:0410b08_6"
    },
    {
        "source_sentence": "時化如來說此語竟，尋即化滅不知其處。",
        "translation": "When the Tathāgata finished speaking these words, he disappeared and didn't know where he was.",
        "source": "T15n0627_001:0410b08_7"
    },
    {
        "source_sentence": "辯積菩薩問軟首曰：「今者如來為所至湊？」",
        "translation": "The bodhisattva Bimbisāra asked Kumārajīva, Is the Tathāgata where he's now?",
        "source": "T15n0627_001:0410b09_8"
    },
    {
        "source_sentence": "答曰：「從所來處。」",
        "translation": "He answered, Where did you come from?",
        "source": "T15n0627_001:0410b10_9"
    },
    {
        "source_sentence": "又問：「何所從來？」",
        "translation": "Again, he asked, Where did you come from?",
        "source": "T15n0627_001:0410b10_10"
    },
    {
        "source_sentence": "答曰：「如所去處。」",
        "translation": "He answered, It's like the place where he went.",
        "source": "T15n0627_001:0410b11_11"
    },
    {
        "source_sentence": "又問：「軟首！",
        "translation": "Again, he asked, soft head!",
        "source": "T15n0627_001:0410b11_12"
    },
    {
        "source_sentence": "其化現者，無所從來，無所從去？」",
        "translation": "What does the manifestation of that transformation come from and what does it leave?",
        "source": "T15n0627_001:0410b12_0"
    },
    {
        "source_sentence": "答曰：「族姓子！",
        "translation": "He answered, Clansman!",
        "source": "T15n0627_001:0410b12_1"
    },
    {
        "source_sentence": "譬如化者，無所從來，無所從去，一切諸法亦復如是！",
        "translation": "Just as a magician comes from nowhere and leaves nowhere, so it is with all dharmas!",
        "source": "T15n0627_001:0410b13_2"
    },
    {
        "source_sentence": "一切眾生等無有異，不來不去。」",
        "translation": "All sentient beings and so forth are no different, neither coming nor going.",
        "source": "T15n0627_001:0410b14_3"
    },
    {
        "source_sentence": "又問：「軟首！",
        "translation": "Again, he asked, soft head!",
        "source": "T15n0627_001:0410b15_0"
    },
    {
        "source_sentence": "一切諸法為何所趣？」",
        "translation": "What are the destinies of all dharmas?",
        "source": "T15n0627_001:0410b15_1"
    },
    {
        "source_sentence": "答曰：「所趣自然。」",
        "translation": "He answered, It's natural that they'll go there.",
        "source": "T15n0627_001:0410b15_2"
    },
    {
        "source_sentence": "又問：「一切眾生為何所歸？」",
        "translation": "Again, he asked, What are the refuges of all sentient beings?",
        "source": "T15n0627_001:0410b16_3"
    },
    {
        "source_sentence": "答曰：「隨其所作。」",
        "translation": "He answered, According to what they do.",
        "source": "T15n0627_001:0410b16_4"
    },
    {
        "source_sentence": "又問：「軟首！",
        "translation": "Again, he asked, soft head!",
        "source": "T15n0627_001:0410b17_5"
    },
    {
        "source_sentence": "一切諸法無作無報？」",
        "translation": "All dharmas are uncreated and unremitting?",
        "source": "T15n0627_001:0410b17_6"
    },
    {
        "source_sentence": "答曰：「族姓子！",
        "translation": "He answered, Clansman!",
        "source": "T15n0627_001:0410b17_7"
    },
    {
        "source_sentence": "其法界者無作、無報、無往，等御諸法則為法界。」",
        "translation": "The Dharma realm is the Dharma realm that has no action, no reward, and no going, and equally controls all dharmas as the Dharma realm.",
        "source": "T15n0627_001:0410b18_8"
    },
    {
        "source_sentence": "又問：「云何言有作、有報、有往而謂無往？」",
        "translation": "Again, he asked, How do you say there's action, reward, and going when there's no going?",
        "source": "T15n0627_001:0410b19_9"
    },
    {
        "source_sentence": "答曰：「族姓子！",
        "translation": "He answered, Clansman!",
        "source": "T15n0627_001:0410b20_10"
    },
    {
        "source_sentence": "如其所作、如其所報，所往亦然。」",
        "translation": "So it is with what they do and the rewards they receive, and so it is with where they go.",
        "source": "T15n0627_001:0410b20_11"
    },
    {
        "source_sentence": "又問軟首曰：「何謂為作？",
        "translation": "Again, he asked Kumārajīva, What's meant by doing it?",
        "source": "T15n0627_001:0410b21_12"
    },
    {
        "source_sentence": "云何報應？",
        "translation": "What's the response?",
        "source": "T15n0627_001:0410b21_13"
    },
    {
        "source_sentence": "何因所往？」",
        "translation": "What's the reason for going there?",
        "source": "T15n0627_001:0410b21_14"
    },
    {
        "source_sentence": "答曰：「如所作者，報應亦如，所往亦如。」",
        "translation": "He answered, As it's created, so is the reward and retribution, and so is where it goes.",
        "source": "T15n0627_001:0410b22_15"
    },
    {
        "source_sentence": "又問：「軟首！",
        "translation": "Again, he asked, soft head!",
        "source": "T15n0627_001:0410b22_16"
    },
    {
        "source_sentence": "其如無本者，亦無有作、無有報應、無有往趣？」",
        "translation": "If it's like the absence of the original, then there's no action, no reward, and no going or coming?",
        "source": "T15n0627_001:0410b23_17"
    },
    {
        "source_sentence": "答曰：「如族姓子！",
        "translation": "He replied, Like a clansman!",
        "source": "T15n0627_001:0410b24_18"
    },
    {
        "source_sentence": "如無本者，亦無所作、亦無報應、亦無往趣。",
        "translation": "Just as there's no root, there's nothing to do, no reward or retribution, and no going or coming.",
        "source": "T15n0627_001:0410b24_19"
    },
    {
        "source_sentence": "所作、報應、往趣亦然，無來無去；",
        "translation": "The same applies to what is made, to what should be experienced as retribution and to the paths of rebirth: there is neither coming nor going.",
        "source": "T15n0627_001:0410b25_20"
    },
    {
        "source_sentence": "所作、報應、所往至處，其如無本無所歸趣。」",
        "translation": "What's done, what's rewarded, and where it goes, are like the absence of originally nothing to return to.",
        "source": "T15n0627_001:0410b26_21"
    },
    {
        "source_sentence": "說是語時，如在世尊能仁佛前，賢者舍利弗、賢者阿難及餘大弟子悉聞斯講。",
        "translation": "When he spoke these words, it was as if he were in front of the Bhagavān Nengren Buddha, and the good men Śāriputra, Good man Ānanda, and the other great disciples heard them all.",
        "source": "T15n0627_001:0410b27_22"
    },
    {
        "source_sentence": "舍利弗白佛：「唯然。",
        "translation": "Śāriputra said to the Buddha, Yes.",
        "source": "T15n0627_001:0410b28_23"
    },
    {
        "source_sentence": "如來！",
        "translation": "The Tathāgata!",
        "source": "T15n0627_001:0410b29_24"
    },
    {
        "source_sentence": "怪未曾有。",
        "translation": "That's strange and unprecedented.",
        "source": "T15n0627_001:0410b29_25"
    },
    {
        "source_sentence": "斯諸正士為大聖人，而師子吼等同一法，說若干種音聲言說，與法會同而無錯謬。",
        "translation": "These 正士為大聖人,而師子吼等同一法,說若干種音聲言說,與法會同而無錯謬。",
        "source": "T15n0627_001:0410b29_26"
    },
    {
        "source_sentence": "誰聞斯者不發無上正真之道乎？」",
        "translation": "Who wouldn't hear this and give rise to the unsurpassed true path?",
        "source": "T15n0627_001:0410c02_27"
    },
    {
        "source_sentence": "佛告舍利弗：「誠如所云，菩薩大學無罣礙故，今者所說無所罣礙，如其所種必獲其果，",
        "translation": "The Buddha said to Śāriputra: Indeed, just as you have said, the bodhisattva’s higher learning is free from obstruction. What he teaches now is free of obstruction; whatever it is planted will surely bear fruit.",
        "source": "T15n0627_001:0410c03_28"
    },
    {
        "source_sentence": "如其所出報應亦然！",
        "translation": "So it should be with the rewards that they give!",
        "source": "T15n0627_001:0410c05_29"
    },
    {
        "source_sentence": "菩薩如是學無罣礙，從其聖慧而分別說，如舍利弗本所學禁，自故斯慧辯才亦然！」",
        "translation": "The bodhisattva thus trains without obstruction and explains it separately from his noble wisdom, just as Śāriputra originally studied the precepts, so does this wisdom and eloquence!",
        "source": "T15n0627_001:0410c05_30"
    },
    {
        "source_sentence": "光淨菩薩問世尊曰：「何謂聲聞學？",
        "translation": "Guangjing Bodhisattva asked the Bhagavān, What's meant by śrāvaka training?",
        "source": "T15n0627_001:0410c07_31"
    },
    {
        "source_sentence": "何謂菩薩學？」",
        "translation": "What's meant by bodhisattva training?",
        "source": "T15n0627_001:0410c08_32"
    },
    {
        "source_sentence": "佛言：「有限有礙是聲聞學，無限無礙是菩薩學。",
        "translation": "The Buddha said, finite and obstructed are the śrāvaka trainings, and infinite and obstructed are the bodhisattva trainings.",
        "source": "T15n0627_001:0410c08_33"
    },
    {
        "source_sentence": "其聲聞學因其所限而致罣礙，由是之故所說有限致於罣礙；",
        "translation": "Because of these limitations, the learning of sravakas is hindered. Because of these limitations, that which is said to be limited is hindered.",
        "source": "T15n0627_001:0410c09_34"
    },
    {
        "source_sentence": "而諸菩薩學無有限致無罣礙，由是之故所說無限無有罣礙。」",
        "translation": "The bodhisattvas' training has no limit and thus no obstruction, and because of this, what they teach is said to be infinite without obstruction.",
        "source": "T15n0627_001:0410c11_35"
    },
    {
        "source_sentence": "光淨菩薩前白佛言：「惟，天中天！",
        "translation": "Guangjing pusa went before the Buddha and said, Yes, god of gods!",
        "source": "T15n0627_001:0410c12_36"
    },
    {
        "source_sentence": "願現感應，使諸正士來至於斯，令此眾會聞所說法，各得其所無令唐舉。",
        "translation": "May they now be inspired, so that the righteous ones will come to this assembly and cause them to hear what's taught in this assembly, each attaining what's unknown and not being held up.",
        "source": "T15n0627_001:0410c13_37"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0410c15_0"
    },
    {
        "source_sentence": "軟首童真所行深奧，所論經法亦復要妙。」",
        "translation": "The profound and mysterious practice of the soft-headed boy is also marvelous, and the sūtras and teachings he teaches are also marvelous.",
        "source": "T15n0627_001:0410c15_1"
    },
    {
        "source_sentence": "爾時世尊即現瑞應。",
        "translation": "It was then that the Bhagavān manifested a miraculous response.",
        "source": "T15n0627_001:0410c16_2"
    },
    {
        "source_sentence": "軟首尋時與二十五正士及諸天子往詣佛所，稽首足下遷住一面。",
        "translation": "When soft head searched, he went to the Buddha with twenty-five 正士 and other celestial beings, bowed his head at his feet, moved to one side, and stayed.",
        "source": "T15n0627_001:0410c16_3"
    },
    {
        "source_sentence": "光淨菩薩謂軟首曰：「仁者！",
        "translation": "Guangjing Bodhisattva said to soft-headed, Sir!",
        "source": "T15n0627_001:0410c18_4"
    },
    {
        "source_sentence": "何故越如來會，獨於屏處而論講經？」",
        "translation": "Why did you go beyond the Tathāgata's assembly and discuss the sūtras alone in a secluded place?",
        "source": "T15n0627_001:0410c18_5"
    },
    {
        "source_sentence": "軟首答曰：「族姓子！",
        "translation": "Kumārajīva replied, Clansman!",
        "source": "T15n0627_001:0410c19_6"
    },
    {
        "source_sentence": "知如來甚尊而不可當，諸佛大聖由是之故，一切所說或懼不可，故在一面。」",
        "translation": "Knowing that the Tathāgata is so venerable and unworthy, the buddhas and great sages might be at one side because of this, or they might fear what's taught.",
        "source": "T15n0627_001:0410c20_7"
    },
    {
        "source_sentence": "又問：「軟首！",
        "translation": "Again, he asked, soft head!",
        "source": "T15n0627_001:0410c21_8"
    },
    {
        "source_sentence": "說何所法可如來乎？」",
        "translation": "What teaching can the Tathāgata teach?",
        "source": "T15n0627_001:0410c22_9"
    },
    {
        "source_sentence": "軟首答曰：「如吾所說，世尊知之。」",
        "translation": "Kumārajīva replied, As I've explained, the Bhagavān knows it.",
        "source": "T15n0627_001:0410c22_10"
    },
    {
        "source_sentence": "光淨曰：「雖爾，願說其意。」",
        "translation": "Guangjing said, Even so, I'd like to explain its meaning.",
        "source": "T15n0627_001:0410c23_11"
    },
    {
        "source_sentence": "答曰：「如吾所及今當宣現。",
        "translation": "He answered, As I have done, I will now proclaim it.",
        "source": "T15n0627_001:0410c23_12"
    },
    {
        "source_sentence": "惟，族姓子！",
        "translation": "Yes, clansmen!",
        "source": "T15n0627_001:0410c24_13"
    },
    {
        "source_sentence": "如有所說，不違法界、不失本無、不失本際，所說如是則可如來！",
        "translation": "If someone teaches something that doesn't violate the realm, doesn't lose the original nonexistence, and doesn't lose the original limits, then it's possible for what they teach to be like this, Tathāgata!",
        "source": "T15n0627_001:0410c24_14"
    },
    {
        "source_sentence": "又若所說，無所訟理、無所呵叱、無所興為，亦無因緣、無有色像、亦無比類，",
        "translation": "Furthermore, what they teach has no principle to dispute, nothing to criticize, nothing to create, no cause and condition, no form and form, and no analogy.",
        "source": "T15n0627_001:0410c26_15"
    },
    {
        "source_sentence": "如是說者奉順如來！",
        "translation": "Those who speak like this will follow the Tathāgata!",
        "source": "T15n0627_001:0410c27_16"
    },
    {
        "source_sentence": "無我同像、無他人形，不等法貌、無非法貌、無終始貌、無泥洹貌，如是說者為可如來！」",
        "translation": "If someone says this, it's possible for the Tathāgata to say that there's no self in the same form, no other form, no Dharma appearance, no illegitimate appearance, no beginning appearance, and no nirvāṇa appearance!",
        "source": "T15n0627_001:0410c28_17"
    },
    {
        "source_sentence": "於是世尊告軟首曰：「善哉善哉！",
        "translation": "The Bhagavān then addressed Kumārajīva, Good, good!",
        "source": "T15n0627_001:0411a01_18"
    },
    {
        "source_sentence": "快說此言。",
        "translation": "Quickly say these words.",
        "source": "T15n0627_001:0411a02_0"
    },
    {
        "source_sentence": "誠如所云，如是說者不違如來。",
        "translation": "It's really as you say, and such a statement doesn't contradict the Tathāgata.",
        "source": "T15n0627_001:0411a02_1"
    },
    {
        "source_sentence": "又次軟首！",
        "translation": "Furthermore, soft heads!",
        "source": "T15n0627_001:0411a02_2"
    },
    {
        "source_sentence": "假使悉離一切戲樂而無憒亂，若不平要離諸所想無有眾想，有所說者所趣寂然而不動轉，",
        "translation": "Suppose they are completely free of all kinds of enjoyment and not disturbed, or if they aren’t evenly apart from perceptions, there are no perceptions, and the speaker who teaches is tranquil and unmoving in his aim.",
        "source": "T15n0627_001:0411a03_3"
    },
    {
        "source_sentence": "被一德鎧定意說法，無能毀敗其經典者，不見諸法有所增者、有所減者，",
        "translation": "No one who teaches with the concentration of a single armor of virtue can disparage his scriptures, or see any teaching increase or decrease.",
        "source": "T15n0627_001:0411a05_4"
    },
    {
        "source_sentence": "如斯所說則可如來！」",
        "translation": "What's explained like this is possible, Tathāgata!",
        "source": "T15n0627_001:0411a06_5"
    },
    {
        "source_sentence": "說是語時，八百菩薩得不起法忍。",
        "translation": "When he spoke these words, 800 bodhisattvas attained the forbearance of not rising to the Dharma.",
        "source": "T15n0627_001:0411a07_6"
    },
    {
        "source_sentence": "舉鉢品第三",
        "translation": "The Third Chapter of raising the Bowl",
        "source": "T15n0627_001:0411a09_0"
    },
    {
        "source_sentence": "爾時天子千二百人在於會中，乃於往古造菩薩行，則忘道意志不堅固，",
        "translation": "At that time one thousand two hundred celestial beings were present in the assembly. Formerly they performed the deeds of enlightening beings, but from ancient times they forgot about the practice of enlightenment and their will was not firm.",
        "source": "T15n0627_001:0411a10_0"
    },
    {
        "source_sentence": "心自念曰：「佛慧巍巍不可限量，無上正真道意難可獲致，菩薩所學而不可逮，",
        "translation": "He thought to himself, “The wisdom of buddhas cannot be limited; it is difficult to attain the supremely true aspiration for enlightenment. The bodhisattva’s learning cannot be grasped.",
        "source": "T15n0627_001:0411a11_1"
    },
    {
        "source_sentence": "最正覺者甚難可得。",
        "translation": "The most perfectly enlightened one is very difficult to attain.",
        "source": "T15n0627_001:0411a13_2"
    },
    {
        "source_sentence": "吾等於是不能學辦，不如改求聲聞、緣覺而取滅度」爾時世尊知諸天子心之所念，",
        "translation": "We won't be able to learn and accomplish it, so why wouldn't we change our ways of seeking śrāvakas and pratyekbuddhas and attain nirvāṇa? The Bhagavān then knew what the godlings thought in their minds,",
        "source": "T15n0627_001:0411a13_3"
    },
    {
        "source_sentence": "以此等倫堪成無上正真之道為最正覺，而欲中廢隨取小乘。",
        "translation": "Because these people are capable of accomplishing the unsurpassed true path as the most correct awakening, they want to abandon the lesser vehicle and follow it in their desires.",
        "source": "T15n0627_001:0411a15_4"
    },
    {
        "source_sentence": "佛欲勸化諸天子故，離於道場在眾會表化作長者，手擎滿鉢百種飲食齎詣佛所，",
        "translation": "Because the Buddha wanted to encourage and transform the celestial beings, he left the terrace of enlightenment in the assembly hall and became an elder. Holding bowls full of all kinds of food and drink in his hands, he brought it to the Buddha.",
        "source": "T15n0627_001:0411a17_5"
    },
    {
        "source_sentence": "白世尊曰：「惟願大聖加哀受食。」",
        "translation": "He said to the Bhagavān, May the great sage take pity on him and accept his food.",
        "source": "T15n0627_001:0411a19_6"
    },
    {
        "source_sentence": "佛即取鉢。",
        "translation": "The Buddha then took the bowl.",
        "source": "T15n0627_001:0411a19_7"
    },
    {
        "source_sentence": "軟首菩薩興詣佛所，叉手啟曰：「今食盛饍當念故恩。",
        "translation": "The soft-headed bodhisattva rose to the Buddha, saluted him with his palms together, and said, Now that you're eating a large bowl of food, you should remember your past kindness.",
        "source": "T15n0627_001:0411a20_0"
    },
    {
        "source_sentence": "吾誠信聞，大聖雖食而不以法惠及於鄙，惟宜加施以法相惠剋復往意。」",
        "translation": "I've heard with faith and faith that even though the great sage eats, he doesn't give his blessing to the Dharma and doesn't give it to the coarse, so it's advisable to give it to him as a blessing for the benefit of the Dharma and then give it back to him.",
        "source": "T15n0627_001:0411a21_1"
    },
    {
        "source_sentence": "於是賢者舍利弗心自念言：「軟首往古有何恩德，於世尊所而言雖食顧前法恩？」",
        "translation": "Then, the good man Śāriputra thought to himself, What kind of merit did soft-headed one have in the past that the Bhagavān's words were able to nourish the former kindness of the Dharma?",
        "source": "T15n0627_001:0411a22_2"
    },
    {
        "source_sentence": "則白佛言：「軟首童真宿有何恩於大聖乎，而置如來：『雖當食者念前法恩？』」",
        "translation": "He then said to the Buddha, What kind of blessing does the soft-headed boy really have for the great sage who puts the Tathāgata in his place, 'Even if he were to eat it, would he think of the previous teaching as a blessing?'",
        "source": "T15n0627_001:0411a24_3"
    },
    {
        "source_sentence": "佛告：「且待斯須自當發遣，如來所知非爾所及。」",
        "translation": "The Buddha told them, It's up to the Tathāgata to send it forth on his own, and what he knows is beyond that.",
        "source": "T15n0627_001:0411a26_4"
    },
    {
        "source_sentence": "佛即尋時捨鉢于地，鉢即下沒，遊諸佛土。",
        "translation": "When the Buddha looked for it, he dropped his bowl to the ground. The bowl immediately went down and traveled among the buddha lands.",
        "source": "T15n0627_001:0411a27_5"
    },
    {
        "source_sentence": "諸佛正覺今現在者，各各見鉢降其足下，在於下方過七十二江河沙等諸佛國土，",
        "translation": "The buddhas and enlightened ones of the present, each seeing their bowls falling down from their feet, went downward through as many buddha-lands as there are sands in seventy-two Ganges rivers.",
        "source": "T15n0627_001:0411a28_6"
    },
    {
        "source_sentence": "至光明王如來國界——界號炤燿。",
        "translation": "He arrived at the border of the Tathāgata's kingdom of light-the border is called Zhaozhi.",
        "source": "T15n0627_001:0411b01_7"
    },
    {
        "source_sentence": "鉢住於彼處于虛空，無執持者自然而立。",
        "translation": "The bowl stayed there in space, and without anyone holding it, it stood up naturally.",
        "source": "T15n0627_001:0411b01_8"
    },
    {
        "source_sentence": "所往諸佛諸弟子眾，各各前啟問其世尊：「鉢所從來？」",
        "translation": "The buddhas and disciples who went there each asked the Bhagavān, Where did the bowl come from?",
        "source": "T15n0627_001:0411b02_9"
    },
    {
        "source_sentence": "諸佛各告說其意故：「上方世界界號為忍，彼有如來名曰能仁，現在說法。",
        "translation": "The buddhas each told him what they meant, saying, Up there in the world realm above is called forbearance, and there's a Tathāgata named Nengren who teaches the Dharma now.",
        "source": "T15n0627_001:0411b04_0"
    },
    {
        "source_sentence": "能仁如來故降斯鉢，而欲勸化諸異菩薩志退落者。」",
        "translation": "That's why the Tathāgata Nengren descended this bowl, wanting to encourage and transform the different bodhisattvas who withdrew from their aspirations.",
        "source": "T15n0627_001:0411b05_1"
    },
    {
        "source_sentence": "於時世尊告舍利弗：「汝行求鉢，察知所在而赴致來。」",
        "translation": "The Bhagavān then addressed Śāriputra, You're going to ask for the bowl, and you'll know where it is and come back.",
        "source": "T15n0627_001:0411b06_2"
    },
    {
        "source_sentence": "即時受教，自以智力承佛聖旨，三昧正受以一萬定超萬佛土，遍求索鉢不知所在。",
        "translation": "He immediately accepted the teaching, inherited the Buddha's noble teaching with his own wisdom and power, samādhi correctly received it with 10,000 concentrations that transcended ten thousand buddha-lands, and searched everywhere for a bowl without knowing where it was.",
        "source": "T15n0627_001:0411b08_0"
    },
    {
        "source_sentence": "還白佛言：「唯然，世尊！",
        "translation": "He returned to the Buddha and said, Yes, Bhagavān!",
        "source": "T15n0627_001:0411b09_1"
    },
    {
        "source_sentence": "求之不見，不知所在。」",
        "translation": "Seeking it, they don't see it and don't know where it is.",
        "source": "T15n0627_001:0411b10_2"
    },
    {
        "source_sentence": "於時世尊告大目連：「汝今且行求索鉢來，察其所在為處何方？」",
        "translation": "The Bhagavān then addressed Mahāmaudgalyāyana, Now, you're going to ask for your bowl and examine where it is.",
        "source": "T15n0627_001:0411b10_3"
    },
    {
        "source_sentence": "目連受教以神足力承佛聖旨，三昧正受入八千定，倏忽超過八千佛國，",
        "translation": "Having received the instruction, Maudgalyāyana inherited the Buddha’s teaching by means of his supernormal power. By meditating on this concentration he entered eight thousand states of concentrations and suddenly passed beyond the realm of the eight thousand buddhas.",
        "source": "T15n0627_001:0411b12_4"
    },
    {
        "source_sentence": "求之不見不知所處，還白佛言：「輒竭神力不蒙執鉢，焉能致乎？」",
        "translation": "Seeing it, he didn't know where to go and returned to the Buddha and said, How could you do so without using your supernormal powers if you didn't get hold of the bowl?",
        "source": "T15n0627_001:0411b13_5"
    },
    {
        "source_sentence": "世尊復告須菩提曰：「汝行求鉢，知其所歸索齎致來。」",
        "translation": "The Bhagavān again told Suppository, You're going to ask for the bowl, knowing where it comes from and carrying it.",
        "source": "T15n0627_001:0411b15_6"
    },
    {
        "source_sentence": "即亦受教，三昧正受萬二千定，恍惚超越萬二千佛土，求不見鉢不知所止。",
        "translation": "He then also accepted the teaching, correctly experienced 12,000 concentrations in samādhi, transcended 12,000 buddha-lands in a trance, and didn't know where to stop when he asked for an alms bowl.",
        "source": "T15n0627_001:0411b16_7"
    },
    {
        "source_sentence": "如是五百諸大聲聞，在於虛空各現神足、三昧之力，神通聖勢、天眼徹瞻，",
        "translation": "Thus, the five hundred great disciples manifested their supernormal powers and samādhi powers in space. They had supernormal powers, holy powers, divine vision, and penetrating vision.",
        "source": "T15n0627_001:0411b18_8"
    },
    {
        "source_sentence": "各行求鉢，不知所在亦不能得。",
        "translation": "Each went around seeking the bowl, but they didn't know where it was and couldn't get it.",
        "source": "T15n0627_001:0411b19_9"
    },
    {
        "source_sentence": "時須菩提即前告白慈氏菩薩曰：「仁者高才一生補處，如來所莂當為無上正真道成最正覺！",
        "translation": "Suppository then went forward and confessed to Maitreya Bodhisattva, saying, Sir, you're a man of high talent who will be reborn in the place where the Tathāgata would attain the unsurpassed true path and become the most perfectly enlightened!",
        "source": "T15n0627_001:0411b20_10"
    },
    {
        "source_sentence": "仁慈恩廣智慧弘達眾所不及，獨步三界而無有侶，當知鉢處，惟能致之奉齎來耳！",
        "translation": "Their kindness, benevolence, vast wisdom, and vast knowledge are unmatched by others, and they walk alone in the three realms without companions, so you should know that there's only a place where the bowl can be carried and brought!",
        "source": "T15n0627_001:0411b22_11"
    },
    {
        "source_sentence": "幸屈威尊而舉鉢還。」",
        "translation": "It's fortunate that the Bhagavān raised his bowl and returned.",
        "source": "T15n0627_001:0411b24_12"
    },
    {
        "source_sentence": "慈氏菩薩報須菩提曰：「誠如所云，受如來慧當成正覺！",
        "translation": "Maitreya replied to Suppository, Just as you said, accept the Tathāgata's wisdom and become perfectly enlightened!",
        "source": "T15n0627_001:0411b25_0"
    },
    {
        "source_sentence": "今者軟首所興定意，進止坐起予所不及，不能曉了於斯三昧。",
        "translation": "Now, I'm unable to understand this concentration that's produced by the soft-headed samādhi, and I can't get up from my seat in advance or before.",
        "source": "T15n0627_001:0411b26_1"
    },
    {
        "source_sentence": "惟，須菩提！",
        "translation": "Yes, Subhūti!",
        "source": "T15n0627_001:0411b27_2"
    },
    {
        "source_sentence": "雖於來世吾當成佛，佛菩薩眾數如江河沙，悉為軟首之所開道，欲知一步舉足所念，",
        "translation": "In the future I shall become a buddha, with as many buddhas and bodhisattvas as there are grains of sand in a river. They will all be enlightened by meek gentlemen, wishing to know what they think when one step is taken.",
        "source": "T15n0627_001:0411b27_3"
    },
    {
        "source_sentence": "不識所歸。",
        "translation": "They don't know where to return.",
        "source": "T15n0627_001:0411b29_4"
    },
    {
        "source_sentence": "是故仁者當請軟首！",
        "translation": "That's why you should ask soft-headed!",
        "source": "T15n0627_001:0411c01_5"
    },
    {
        "source_sentence": "惟斯大士知鉢處所、所止之土，堪任致來。」",
        "translation": "Only this great man knows where the bowl is and where it's placed, and he's capable of bringing it here.",
        "source": "T15n0627_001:0411c01_6"
    },
    {
        "source_sentence": "時須菩提啟世尊曰：「願垂恩教。」",
        "translation": "Subhūti then asked the Bhagavān, May you bestow kindness on me.",
        "source": "T15n0627_001:0411c02_7"
    },
    {
        "source_sentence": "大聖則遣軟首取鉢。",
        "translation": "The great sage then sent a soft head to take the bowl.",
        "source": "T15n0627_001:0411c03_8"
    },
    {
        "source_sentence": "軟首奉命自思念曰：「吾不起座不離眾會而舉鉢來。」",
        "translation": "Wengshou complied and thought to himself, I won't rise from my seat or leave the assembly, but will bring up my bowl.",
        "source": "T15n0627_001:0411c03_9"
    },
    {
        "source_sentence": "——軟首三昧名曰普超，是諸菩薩定意正受。",
        "translation": "The soft-headed samādhi is called supramundane, which is the correctly received concentration of bodhisattvas' minds.",
        "source": "T15n0627_001:0411c05_0"
    },
    {
        "source_sentence": "於時軟首伸其右掌，而內于地過踰下方，所經諸佛無極大聖一一次第以首禮之。",
        "translation": "He then extended his right palm with a soft head and bowed his head inside the ground, more than one yojana below it, to the buddhas and great sages who passed by him in order.",
        "source": "T15n0627_001:0411c05_1"
    },
    {
        "source_sentence": "其手掌中自然有音，稱：「能仁如來、至真、等正覺敬問無量！",
        "translation": "Within his palms, there was a voice that naturally sounded, saying, The Tathāgata Nengren, the Supreme Truth, and the Completely Enlightened One respectfully asked immeasurable questions!",
        "source": "T15n0627_001:0411c07_2"
    },
    {
        "source_sentence": "興處輕利、力勢如常、遊居安耶？」",
        "translation": "Is the place of arising light and sharp, the strength and momentum as usual, and the peacefulness of travel?",
        "source": "T15n0627_001:0411c09_3"
    },
    {
        "source_sentence": "其掌手臂一一毛孔，尋自然出億百千姟光曜之明，一一光明各各變現百千蓮花；",
        "translation": "Each pore of his palms and arms spontaneously emitted millions of rays of light, each ray of light producing hundreds of thousands of lotus blossoms.",
        "source": "T15n0627_001:0411c09_4"
    },
    {
        "source_sentence": "一一蓮花各化如來相好具足，處蓮花上加趺而坐；",
        "translation": "Each one of the lotus flowers magically emanated a buddha endowed with the marks and embellishments of greatness, sitting cross-legged on top of the other.",
        "source": "T15n0627_001:0411c11_5"
    },
    {
        "source_sentence": "一一世尊各各讚揚能仁如來名德功勳。",
        "translation": "Each of the world-honored ones praised the name, virtue, and merit of the Tathāgata Neng Ren.",
        "source": "T15n0627_001:0411c12_6"
    },
    {
        "source_sentence": "所可遊歷諸佛之土，應時諸國六反震動。",
        "translation": "When he traveled to the lands of the buddhas, his nations shook six times in response.",
        "source": "T15n0627_001:0411c13_7"
    },
    {
        "source_sentence": "又諸佛國自然大光靡不周遍，一切佛國各各而現有斯手掌。",
        "translation": "Also, the great light naturally pervades all the buddha-lands, and each of the buddha-lands has this palm.",
        "source": "T15n0627_001:0411c14_8"
    },
    {
        "source_sentence": "又諸佛土自然懸繒、幢幡、眾蓋，莫不莊嚴，遍散眾花處處挍飾。",
        "translation": "The buddha lands are naturally adorned with canopies, banners, pennants, and shrouds, scattering flowers everywhere.",
        "source": "T15n0627_001:0411c16_9"
    },
    {
        "source_sentence": "軟首手掌過七十二江河沙等諸佛國土禮諸佛竟，斯須之間忽然即至照曜世界光明王佛國，",
        "translation": "After having saluted the buddhas in as many buddha-lands as there are grains of sand in seventy-two Ganges Rivers with his palms joined together, Sudhana suddenly reached the buddha-land of King of Light of the World of Illumination.",
        "source": "T15n0627_001:0411c17_10"
    },
    {
        "source_sentence": "禮畢自然有大音出，稱：「能仁如來敬問無量光明王如來！」",
        "translation": "After he had paid homage, a great voice naturally emerged and called out, The Tathāgata Nengren respectfully asked the Tathāgata King of Immeasurable Light!",
        "source": "T15n0627_001:0411c19_11"
    },
    {
        "source_sentence": "有侍菩薩名曰光英，自啟如來：「此何手掌？",
        "translation": "An attendant bodhisattva named Guangying asked the Tathāgata himself, What's this palm?",
        "source": "T15n0627_001:0411c21_0"
    },
    {
        "source_sentence": "殊妙巍巍威神難及，而自然出億百千姟光明暉赫；",
        "translation": "Suddenly a hundred million rays of light emerged, shining brilliantly.",
        "source": "T15n0627_001:0411c21_1"
    },
    {
        "source_sentence": "一一光明而各化出億百千姟嚴淨蓮華；",
        "translation": "Each ray of light emanated millions and millions of pure lotus blossoms.",
        "source": "T15n0627_001:0411c23_2"
    },
    {
        "source_sentence": "一一蓮花如來各坐，諮嗟能仁聖哲之勳？」",
        "translation": "Each one of the lotus-flower tathāgatas is seated, and he praises the virtues of kindness, nobleness, and philosophy.",
        "source": "T15n0627_001:0411c24_3"
    },
    {
        "source_sentence": "光明王佛告光英曰：「有族姓子！",
        "translation": "Guangmingwang fo told Guangying, There are clansmen!",
        "source": "T15n0627_001:0411c25_0"
    },
    {
        "source_sentence": "上方去此，七十二江河沙等諸佛國土，有忍世界，如來、至真、等正覺號曰能仁，",
        "translation": "“There are buddha-lands as numerous as the grains of sand in seventy-two Ganges rivers above here and there is a world called Forbearance, where the Tathāgata, Arhat, Perfectly Enlightened One is named Nengren.",
        "source": "T15n0627_001:0411c25_1"
    },
    {
        "source_sentence": "現在說法。",
        "translation": "Now, he teaches the Dharma.",
        "source": "T15n0627_001:0411c27_2"
    },
    {
        "source_sentence": "彼有大士名曰軟首，被戒德鎧不可思議，一切神通力度無極，自在於座而不移，",
        "translation": "There was a great man there named soft-headed, wearing the armor of moral virtue and inconceivable miraculous powers. The strength of his supernormal powers was unexcelled, and he remained seated without moving even while [sitting on] his seat.",
        "source": "T15n0627_001:0411c27_3"
    },
    {
        "source_sentence": "起延手掌來欲舉鉢還。」",
        "translation": "He got up and came with his palms joined, wanting to lift the bowl back.",
        "source": "T15n0627_001:0411c29_4"
    },
    {
        "source_sentence": "時光明王佛土諸菩薩眾皆共渴仰，欲得覩見彼忍世界能仁如來、軟首大士。",
        "translation": "At the time, the bodhisattvas of the Buddha land of the king of light and buddha lands all longed to see the Tathāgata Neng Ren and the soft-headed Mahāsthāmaprāpta in that world of forbearance.",
        "source": "T15n0627_001:0412a01_5"
    },
    {
        "source_sentence": "光明王佛悉知眾會意之所見，便放眉頂相光，其光通照七十二江河沙等諸佛國土，",
        "translation": "Knowing what the assembly saw, the Buddha King of Illumination emitted light from the top of his eyebrows that shone throughout as many buddha-lands as there are grains of sand in seventy-two Ganges rivers.",
        "source": "T15n0627_001:0412a02_6"
    },
    {
        "source_sentence": "上至忍界靡不晃昱。",
        "translation": "Up to the realm of forbearance, it doesn't shine brightly.",
        "source": "T15n0627_001:0412a04_7"
    },
    {
        "source_sentence": "其有眾生被蒙光者，一切獲安無有諸患，如四域皇帝轉輪聖王；",
        "translation": "Those sentient beings who are illumined by this light will all attain peace and be without any trouble, like the universal ruler of the four quarters.",
        "source": "T15n0627_001:0412a05_8"
    },
    {
        "source_sentence": "諸修行者專精學定，被斯光者悉得道迹；",
        "translation": "All the practitioners of enlightenment concentrate their efforts on learning, and those illumined by this light attain the traces of enlightenment.",
        "source": "T15n0627_001:0412a06_9"
    },
    {
        "source_sentence": "其得禪者悉過三界獲四證德；",
        "translation": "Those who have attained meditative absorption all transcend the three realms and acquire the qualities of the four realizations.",
        "source": "T15n0627_001:0412a07_10"
    },
    {
        "source_sentence": "其漏盡者得八脫門；",
        "translation": "Those whose contaminants are extinguished attain the eight gates of liberation.",
        "source": "T15n0627_001:0412a08_11"
    },
    {
        "source_sentence": "禪定羅漢得無著原；",
        "translation": "The arhats in meditation attain the sphere of no attachment.",
        "source": "T15n0627_001:0412a08_12"
    },
    {
        "source_sentence": "其諸菩薩光照身者，普皆逮得日光三昧。",
        "translation": "Those bodhisattvas whose bodies are illuminated by light will all attain the samādhi of sunlight.",
        "source": "T15n0627_001:0412a09_13"
    },
    {
        "source_sentence": "如是之比，光明王邊如來佛土菩薩大士，見斯忍界世尊能仁、軟首童真、一切聲聞比丘聖眾、諸菩薩等。",
        "translation": "Compared to this, the Tathāgata Buddha-lands Bodhisattva Mahāsthāmaprāpta at the side of the King of Radiance is a bodhisattva who sees the Bhagavān Neng Ren, the soft-headed Boy Truth, all the śrāvakas, monks, holy people, and bodhisattvas in the forbearance realm.",
        "source": "T15n0627_001:0412a10_14"
    },
    {
        "source_sentence": "光英菩薩覩忍世界諸菩薩眾，尋即淚出便說斯言，自白佛曰：「唯然，",
        "translation": "The enlightening being Guangying said these words to the assembly of enlightening beings in the world Patience:",
        "source": "T15n0627_001:0412a12_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0627_001:0412a14_16"
    },
    {
        "source_sentence": "如妙水精如意明珠，墮不淨中誠可矜惜。",
        "translation": "It's like the marvelous water spirit, the wish-granting pearl, which falls into impurity and can really be cherished.",
        "source": "T15n0627_001:0412a14_17"
    },
    {
        "source_sentence": "此諸菩薩生忍界者，亦復如是甚可憐感。」",
        "translation": "These bodhisattvas who are born in the forbearance realm are likewise pitiable.",
        "source": "T15n0627_001:0412a15_18"
    },
    {
        "source_sentence": "光明王佛謂光英曰：「勿宣是語。",
        "translation": "King Buddha of Illumination said to Guangying, Don't say that.",
        "source": "T15n0627_001:0412a16_19"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0412a16_20"
    },
    {
        "source_sentence": "在此佛土精修禪行至于十劫，不如忍界從明晨旦至早食頃，興發慈心哀念眾生，",
        "translation": "In this buddha-land he practiced meditation diligently for ten eons, but it is not as good as the realm of patience. He manifested compassion and sympathy toward sentient beings from morning to early in the morning until they ate at dawn.",
        "source": "T15n0627_001:0412a17_21"
    },
    {
        "source_sentence": "此之功德最勝無倫難可逮及。",
        "translation": "This merit is the most superior and unequally difficult to attain.",
        "source": "T15n0627_001:0412a19_22"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0412a19_23"
    },
    {
        "source_sentence": "斯諸菩薩大士之眾，無有陰、蓋，塵勞以盡，其於忍界護正法者德不可量。」",
        "translation": "These bodhisattvas and great men have no aggregates or hindrances, and their virtue in protecting the right teaching in the forbearance realm is immeasurable.",
        "source": "T15n0627_001:0412a20_0"
    },
    {
        "source_sentence": "爾時忍界諸菩薩眾光明照身，則問能仁天中天曰：「唯然，世尊！",
        "translation": "It was then that the bodhisattvas in the forbearance realm shone their light and asked the gods in the Nengren heaven, Yes, Bhagavān!",
        "source": "T15n0627_001:0412a21_1"
    },
    {
        "source_sentence": "此何光明孰演出來，滅諸塵勞令無瑕穢？」",
        "translation": "Who produces this light that extinguishes the afflictions and makes it unsullied?",
        "source": "T15n0627_001:0412a23_2"
    },
    {
        "source_sentence": "時佛告曰：「有族姓子！",
        "translation": "The Buddha then told them, There are clansmen!",
        "source": "T15n0627_001:0412a24_0"
    },
    {
        "source_sentence": "下方度此七十二江河沙等諸佛國土，而有世界名曰照曜，彼有如來號光明王，",
        "translation": "In the nadir, beyond these buddha-lands as numerous as the grains of sand in seventy-two Ganges Rivers, there is a world called Illumination, where there is a buddha called King of Light.",
        "source": "T15n0627_001:0412a24_1"
    },
    {
        "source_sentence": "現在說法。",
        "translation": "Now, he teaches the Dharma.",
        "source": "T15n0627_001:0412a26_2"
    },
    {
        "source_sentence": "其光明王如來至真放眉頂光，其光通照七十二江河沙等諸佛國土，而大晃昱逮照斯土。」",
        "translation": "The king of that light, the Tathāgata Supremely True King of Light, radiated a ray of light from his eyebrows, and its light shone throughout as many buddha-lands as there are seventy-two rivers of sand, while Mahāprajāpatī illuminated those lands.",
        "source": "T15n0627_001:0412a26_3"
    },
    {
        "source_sentence": "時諸菩薩及眾聲聞，各啟佛曰：「唯然，世尊！",
        "translation": "The bodhisattvas and śrāvakas then each asked the Buddha, Yes, Bhagavān!",
        "source": "T15n0627_001:0412a28_4"
    },
    {
        "source_sentence": "我等欲見照曜世界光明王如來諸菩薩眾。」",
        "translation": "We want to see the buddhas and bodhisattvas of the Tathāgata King of Illumination in the World of Illumination.",
        "source": "T15n0627_001:0412a29_5"
    },
    {
        "source_sentence": "能仁如來放足心千輻輪光，其光普照下方七十二江河沙等諸佛國土，至照曜界靡不周遍。",
        "translation": "The Tathāgata Nengren radiated a thousand-spoked wheel of light from his feet, and that light shone universally over the buddha lands as numerous as the sands of seventy-two rivers below him, reaching everywhere in the shining realm.",
        "source": "T15n0627_001:0412b01_6"
    },
    {
        "source_sentence": "下方世界諸菩薩眾身蒙斯光，皆悉逮得須彌光明三昧。",
        "translation": "The bodhisattvas in the lower worlds all received this light, and they all attained the concentration of Sumeru's radiance.",
        "source": "T15n0627_001:0412b03_7"
    },
    {
        "source_sentence": "當爾之時，於斯佛土及彼世界，斯土見彼、彼土見此，轉相覩達，猶如此土閻浮提人，",
        "translation": "At that time, as the people of Jambudvfpa looked at this buddha-land and those other worlds, they saw each other in that land. And when they saw each other with their own distinctive characteristics, they grew close to each other.",
        "source": "T15n0627_001:0412b04_8"
    },
    {
        "source_sentence": "住於地上仰瞻日月。",
        "translation": "He stands on the ground and looks up at the sun and moon.",
        "source": "T15n0627_001:0412b06_9"
    },
    {
        "source_sentence": "下方世界觀諸菩薩能仁如來及忍世界亦復如是！",
        "translation": "So it is with the lower world observing the bodhisattvas, the Tathāgata of benevolence and the world of forbearance!",
        "source": "T15n0627_001:0412b07_10"
    },
    {
        "source_sentence": "此土人民見於下方，猶如諸天住須彌頂俯于天下閻浮提城。",
        "translation": "The people of this land look downward like the gods living on Mount Sumeru, with their heads lowered to the city of Jambudvīpa.",
        "source": "T15n0627_001:0412b08_11"
    },
    {
        "source_sentence": "斯諸菩薩見光明王如來諸菩薩等，被大德鎧難及難量。",
        "translation": "These bodhisattvas saw that the Tathāgata of the King of Light and other bodhisattvas were armed with a great virtuous armor that was difficult and immeasurable.",
        "source": "T15n0627_001:0412b09_12"
    },
    {
        "source_sentence": "於是軟首以右掌至照曜界彼光明王如來佛土，於虛空中即握取鉢，與無央數億百千姟諸菩薩眾眷屬圍遶踊出上方，",
        "translation": "Then the Licchavi Vimalakīrti, reaching up to the buddha-field of that buddha-land of the Tathāgata King of Illumination in the realm of Radiance with his right palm, took his almsbowl and went up into space, surrounded by countless hundreds of thousands of myriads of koṭis of bodhisattvas and their retinues",
        "source": "T15n0627_001:0412b11_13"
    },
    {
        "source_sentence": "手掌擎鉢；",
        "translation": "In his hand he held the almsbowl.",
        "source": "T15n0627_001:0412b14_0"
    },
    {
        "source_sentence": "所歷佛國轉來上者，光明蓮花稍便不現，右手執鉢還忍世界，於大聖前跪而奉授，",
        "translation": "When the buddha-lands he traveled to came upward, the lotus flower of light disappeared. He returned to the world Patience with his bowl in his right hand, knelt down before the great sage, and offered it to him.",
        "source": "T15n0627_001:0412b14_1"
    },
    {
        "source_sentence": "啟世尊曰：「垂恩受之？」",
        "translation": "He asked the Bhagavān, Have you received it with kindness?",
        "source": "T15n0627_001:0412b16_2"
    },
    {
        "source_sentence": "佛即受鉢。",
        "translation": "The Buddha then accepted the bowl.",
        "source": "T15n0627_001:0412b16_3"
    },
    {
        "source_sentence": "時諸菩薩與軟首掌而俱來者，前詣佛所稽首于地，各各自宣如來之名：「某佛大聖致敬無量，",
        "translation": "The bodhisattvas then came with their palms joined together, went to the Buddha, bowed their heads at the ground, and each proclaimed the Tathāgata’s name:",
        "source": "T15n0627_001:0412b16_4"
    },
    {
        "source_sentence": "聖體勝常，遊步無限慧力平康！」",
        "translation": "The essence of the sage is superior and eternal, and he travels around with infinite wisdom and calmness!",
        "source": "T15n0627_001:0412b18_5"
    },
    {
        "source_sentence": "諸菩薩眾敬問已畢，退坐一面如佛所教安隱之座。",
        "translation": "After the bodhisattvas had respectfully asked, they withdrew to sit at one side on the peaceful seat taught by the Buddha.",
        "source": "T15n0627_001:0412b19_6"
    },
    {
        "source_sentence": "爾時世尊告舍利弗：「今且聽斯，善思念之！",
        "translation": "It was then that the Bhagavān addressed Śāriputra, Now listen to this, and consider it well!",
        "source": "T15n0627_001:0412b21_0"
    },
    {
        "source_sentence": "今為若說。",
        "translation": "Now, I'll explain it for you.",
        "source": "T15n0627_001:0412b21_1"
    },
    {
        "source_sentence": "乃去往古吾身造行為菩薩時，則是軟首本所建發，今者所以宣置斯惠：『世尊雖食，",
        "translation": "In the distant past, when I was a bodhisattva engaged in self-created practices as a bodhisattva, this was what Manjushri had originally undertaken. For this reason we now offer this kind of advice:",
        "source": "T15n0627_001:0412b22_2"
    },
    {
        "source_sentence": "當念疇昔法施之恩。』",
        "translation": "You should be mindful of the kindness of the gift of the Dharma from the past.'",
        "source": "T15n0627_001:0412b24_3"
    },
    {
        "source_sentence": "乃曩過去久遠世時，無央數不可計會億百千劫，復踰此數，爾時有佛名莫能勝幢如來、至真、等正覺，",
        "translation": "In the distant past, in an uncountable number of billions and hundreds of thousands of aeons ago, there was another buddha named Mahāprajāpatīṃdhara Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T15n0627_001:0412b24_4"
    },
    {
        "source_sentence": "世界名無別異。",
        "translation": "The names of the worlds are not distinct or different.",
        "source": "T15n0627_001:0412b26_5"
    },
    {
        "source_sentence": "莫能勝幢如來諸聲聞眾八萬四千，菩薩大士十二億眾。",
        "translation": "There were 84,000 śrāvakas of the Tathāgata's superior banner, 1,200 bodhisattvas and great men.",
        "source": "T15n0627_001:0412b27_6"
    },
    {
        "source_sentence": "其佛世尊於五濁世演三乘教，有一比丘而為法師名曰慧王！",
        "translation": "That Buddha Bhagavān taught the teachings of the three vehicles in the five turbid worlds, and there was a monk who became the teacher of the Dharma named King of Wisdom!",
        "source": "T15n0627_001:0412b28_7"
    },
    {
        "source_sentence": "明旦著衣執持應器，入弘廣國而行分衛，得百味飯若干種食。",
        "translation": "On the morning, he put on his robes, took his bowl, and entered Hongqiao's kingdom to practice deportment, where he obtained a hundred flavors of rice and several kinds of food.",
        "source": "T15n0627_001:0412b29_8"
    },
    {
        "source_sentence": "分衛竟，出行於街路。",
        "translation": "After they had divided the guards, they traveled to the street corners.",
        "source": "T15n0627_001:0412c02_9"
    },
    {
        "source_sentence": "有尊者子名離垢臂，為乳母所抱而行遊戲。",
        "translation": "There was a venerable son named Licchavi arm, who was embraced by his wet nurse and played.",
        "source": "T15n0627_001:0412c02_10"
    },
    {
        "source_sentence": "時離垢臂遙見比丘，遊行趣之下乳母抱，尋隨比丘從求飯食。",
        "translation": "The arm free from defilement then saw the monk from a distance, traveling down the path under his nursing mother's embrace, and following the monk to ask for food.",
        "source": "T15n0627_001:0412c03_11"
    },
    {
        "source_sentence": "於時比丘與模持蜜搏，幼童即食知其甘美，遂隨比丘蜜搏欲盡，顧眄乳母意欲還抱。",
        "translation": "The monk then wrestled the moped with honey, and the young boy ate it. Knowing its sweetness, he followed the monk's wrestling of honey as he wished to finish it. He looked at his wet nurse and wanted to take it back.",
        "source": "T15n0627_001:0412c05_12"
    },
    {
        "source_sentence": "比丘復授蜜搏，幼童復進，稍稍轉至莫能勝幢如來之所，稽首足下則住其前。",
        "translation": "The monk again gave the rice bowl, and the young boy went on. After a little bit of progress, he reached the place where the Tathāgata Mahāprajñāpāramitā was staying, bowed his head at his feet, and stood in front of him.",
        "source": "T15n0627_001:0412c07_13"
    },
    {
        "source_sentence": "「於時比丘慧王所得分衛食饍，授與幼童而謂之曰：『童子！",
        "translation": "At the time, the monk King of Wisdom obtained a portion of food to guard and gave it to the young boy and told him, 'Boy!",
        "source": "T15n0627_001:0412c09_14"
    },
    {
        "source_sentence": "受斯分衛之具，供養如來！』",
        "translation": "Accept these protective implements and make offerings to the Tathāgata!'",
        "source": "T15n0627_001:0412c10_15"
    },
    {
        "source_sentence": "尋即受之，已滿佛鉢，食不減損；",
        "translation": "So they immediately accepted it and filled the Buddha’s almsbowl with food without any loss.",
        "source": "T15n0627_001:0412c10_16"
    },
    {
        "source_sentence": "次與聲聞八萬四千，菩薩十二億，佛及聖眾，皆悉充飽。",
        "translation": "Next, with the eighty-four thousand śrāvakas and twelve hundred million bodhisattvas, the Buddha and the holy congregation were all filled.",
        "source": "T15n0627_001:0412c11_17"
    },
    {
        "source_sentence": "如是之供至于七日，飯則如故亦不損減。",
        "translation": "For the remaining seven days of this kind of offering, the rice won't be depleted as usual.",
        "source": "T15n0627_001:0412c12_18"
    },
    {
        "source_sentence": "「於時幼童踊躍歡喜善心生焉！",
        "translation": "At that point, the young boy jumped and rejoiced, and a good mind arises!",
        "source": "T15n0627_001:0412c13_19"
    },
    {
        "source_sentence": "「『佛聖眾飽滿，　　鉢食不損耗；",
        "translation": "The Buddhas and holy beings are full, And their bowls of food don’t wear out.",
        "source": "T15n0627_001:0412c14_20"
    },
    {
        "source_sentence": "　　奉事於眾祐！　　福田無有疑。",
        "translation": "O you who serve all the blessed ones, there is no doubt about your field of blessings.",
        "source": "T15n0627_001:0412c14_20"
    },
    {
        "source_sentence": "　　世吼食充足，　　餚饍而不減；",
        "translation": "The worldly roar has plenty of food, Yet its nourishment is neither devoured nor diminished.",
        "source": "T15n0627_001:0412c14_20"
    },
    {
        "source_sentence": "　　獻進于眾祐！　　不疑道無盡。",
        "translation": "Their offerings are offered to the blessed ones, who do not doubt that the Way has no end.",
        "source": "T15n0627_001:0412c14_20"
    },
    {
        "source_sentence": "　　其饍既不損，　　供具轉弘多；",
        "translation": "Since the image was not damaged, The offerings became even more numerous.",
        "source": "T15n0627_001:0412c14_20"
    },
    {
        "source_sentence": "　　恭敬等正覺！　　增長清白法。』」",
        "translation": "Respectfully and equally enlightened, you will increase the pure and white dharma.’",
        "source": "T15n0627_001:0412c14_20"
    },
    {
        "source_sentence": "住世尊前則而頌曰：佛告舍利弗：「於時幼童以一鉢食，供養世尊及聖眾，",
        "translation": "The Buddha said to Śāriputra: At that time the young Licchavi Vimalakīrti offered food and drink to the World-honored One and his holy ones.",
        "source": "T15n0627_001:0412c14_20"
    },
    {
        "source_sentence": "承佛聖旨已心清白，具足七日食不損耗。",
        "translation": "After receiving the Buddha's noble teaching, his mind was clear and white, and he ate for seven days without losing it.",
        "source": "T15n0627_001:0412c22_21"
    },
    {
        "source_sentence": "慧王比丘教訓幼童：『歸命於佛及法、聖眾。』",
        "translation": "The monk King of Wisdom teaches the young boy, 'Take refuge in the Buddha, Dharma, and noble people.'",
        "source": "T15n0627_001:0412c23_22"
    },
    {
        "source_sentence": "令受禁戒剋心悔過，勸使請問發無上正真道意。",
        "translation": "He causes them to receive the forbidden precepts and repent of their sins, encourages them to ask questions that give rise to the intention for the unsurpassed true path.",
        "source": "T15n0627_001:0412c24_23"
    },
    {
        "source_sentence": "「於時父母求索其子，便詣莫能勝幢如來所，稽首作禮退住一面。",
        "translation": "At the time, their parents begged for their son, went to the Tathāgata Mahāprajñāpāramitā-sūtra, bowed their heads, and withdrew to one side.",
        "source": "T15n0627_001:0412c25_24"
    },
    {
        "source_sentence": "「『我志願佛道，　　愍哀諸群生；",
        "translation": "'I aspire to the Buddha Way, pitying all sentient beings.",
        "source": "T15n0627_001:0412c26_25"
    },
    {
        "source_sentence": "　　閑暇難得值，　　親亦宜誓意。",
        "translation": "It's difficult to meet someone in a leisurely moment, so it's appropriate to make a vow for their relatives.",
        "source": "T15n0627_001:0412c26_25"
    },
    {
        "source_sentence": "　　且觀正覺身，　　諸相好莊嚴；",
        "translation": "He also observes the body of enlightened One, Adorned with beautiful features.",
        "source": "T15n0627_001:0412c26_25"
    },
    {
        "source_sentence": "　　慧度於無極，　　孰不發道意？",
        "translation": "Who wouldn't give rise to the intention for enlightenment if wisdom were liberated from the infinity?",
        "source": "T15n0627_001:0412c26_25"
    },
    {
        "source_sentence": "　　惟父母見釋，　　得出棄捐家；",
        "translation": "Only their parents, seeing the explanation, left and renounced the householders’ home.",
        "source": "T15n0627_001:0412c26_25"
    },
    {
        "source_sentence": "　　順妙智慧教，　　得學為寂志。』",
        "translation": "Following the teaching of marvelous wisdom, attaining training is a quiescent aspiration.'",
        "source": "T15n0627_001:0412c26_25"
    },
    {
        "source_sentence": "　　父母即答曰：　　『我等好樂道，",
        "translation": "The parents replied, “We follow the right path.",
        "source": "T15n0627_001:0412c26_25"
    },
    {
        "source_sentence": "　　從爾為明則，　　亦欲願捨家。』」",
        "translation": "From you as a clear rule, I also want to abandon my home.'",
        "source": "T15n0627_001:0412c26_25"
    },
    {
        "source_sentence": "幼童拜謁問訊父母，以偈讚曰：佛告舍利弗：「於時幼童化其父母及五百人，",
        "translation": "The young boy greeted his parents and praised them in verse: The Buddha said to Śāriputra, At that time the young boy disciplined his parents and the five hundred children.",
        "source": "T15n0627_001:0412c26_25"
    },
    {
        "source_sentence": "悉念學法志於無上正真之道，皆於佛世棄家為道。",
        "translation": "They are all mindful of training in the Dharma and aspire to the unsurpassed true path, abandoning their homes in the Buddha's world as the path.",
        "source": "T15n0627_001:0413a08_0"
    },
    {
        "source_sentence": "時佛教之行菩薩道、六度無極、四等、四恩，分別解空，精進不懈自致得佛。",
        "translation": "At the time, the bodhisattva path of Buddhist practice, the six perfections without limit, the four equals, and the four kinds of kindnesses discriminated and understood emptiness, and they didn't tirelessly make effort to attain Buddhahood on their own.",
        "source": "T15n0627_001:0413a09_1"
    },
    {
        "source_sentence": "卿舍利弗！",
        "translation": "You, Śāriputra!",
        "source": "T15n0627_001:0413a10_2"
    },
    {
        "source_sentence": "欲知爾時慧王比丘為法師者，豈異人乎？",
        "translation": "Do you want to know that the monk King of Wisdom at that time was the teacher of the Dharma, isn't he someone else?",
        "source": "T15n0627_001:0413a11_3"
    },
    {
        "source_sentence": "勿作斯觀。",
        "translation": "Don't make such an observation.",
        "source": "T15n0627_001:0413a12_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0413a12_1"
    },
    {
        "source_sentence": "則軟首童真也。",
        "translation": "Then he's the soft-headed boy who's true.",
        "source": "T15n0627_001:0413a12_2"
    },
    {
        "source_sentence": "其離垢臂尊者子者，則吾是也。",
        "translation": "I am the disciple of that Licchavi Vimalakīrti-pāda.",
        "source": "T15n0627_001:0413a12_3"
    },
    {
        "source_sentence": "昔往古世，軟首童真以饍見施供養佛眾，令發無上正真道意，則是本身初發意原，",
        "translation": "Formerly, from ancient times long ago, the young Licchavi youthful Candracchattra offered his humble vision to all the buddhas and caused them to give rise to the aspiration for the supreme true path. This is the very basis of his own initial determination.",
        "source": "T15n0627_001:0413a13_4"
    },
    {
        "source_sentence": "以是之故而當知之。",
        "translation": "Because of this, they should be known.",
        "source": "T15n0627_001:0413a15_5"
    },
    {
        "source_sentence": "今者如來所成聖覺無極之慧、十種力、四無所畏、十八不共無罣礙慧，",
        "translation": "These are the ten kinds of powers, the four forms of fearlessness, and the eighteen unique and unimpeded wisdoms that have been perfected by the Buddha.",
        "source": "T15n0627_001:0413a16_6"
    },
    {
        "source_sentence": "皆是軟首所勸之恩。",
        "translation": "They're all the kindnesses that soft heads encourage.",
        "source": "T15n0627_001:0413a17_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0627_001:0413a18_8"
    },
    {
        "source_sentence": "因從發意至諸通慧，如佛所蒙因致大道。",
        "translation": "From the arousal of intention up to the penetrating wisdom, it's like the cause and effect of the Buddha's attainment of the great path.",
        "source": "T15n0627_001:0413a18_9"
    },
    {
        "source_sentence": "今吾觀覩十方世界，不可稱限不可計會，諸佛國土今現在者，諸佛世尊同號能仁，",
        "translation": "I now perceive the worlds of the ten directions, which are incalculable and cannot be measured or counted. The buddha-lands that are present now are all called Sarvarūpasaṃdarśana.",
        "source": "T15n0627_001:0413a19_10"
    },
    {
        "source_sentence": "悉是仁者軟首所勸。",
        "translation": "They're all encouraged by the gentle one with a soft head.",
        "source": "T15n0627_001:0413a21_11"
    },
    {
        "source_sentence": "或號咸聖、或號明星、或名所歡、或名錠光、或謂離漏、或謂妙勝。」",
        "translation": "Some call it Xian noble, some call it the star, some call it what's rejoicing, some call it Dīpaṃkara, some call it freedom from contamination, and some call it marvelous.",
        "source": "T15n0627_001:0413a21_12"
    },
    {
        "source_sentence": "佛告舍利弗：「今我一劫若過一劫，宣揚演說諸佛名號，軟首大士所開化者，",
        "translation": "The Buddha said to Śāriputra: Now, for one eon or more than one eon, I will proclaim and explain the names of all buddhas.",
        "source": "T15n0627_001:0413a23_13"
    },
    {
        "source_sentence": "於今現在轉于法輪不可稱限，何況有行菩薩乘者？",
        "translation": "In the present, turning the wheel of the Dharma is incalculable, so why wouldn't there be someone who practices the bodhisattva vehicle?",
        "source": "T15n0627_001:0413a24_14"
    },
    {
        "source_sentence": "或有處於兜率天者；",
        "translation": "Some were in the Tushita heaven.",
        "source": "T15n0627_001:0413a26_0"
    },
    {
        "source_sentence": "或有退來入母胞胎，而復出生捨家為道；",
        "translation": "Sometimes there are those who have regressed and entered the mother’s womb. The path consists of rebirth and leaving home.",
        "source": "T15n0627_001:0413a26_1"
    },
    {
        "source_sentence": "或坐佛樹、或處道場，成最正覺不可限喻，其有欲說誠諦之事審實無虛，",
        "translation": "They may be seated at buddha-trees or on the terraces of enlightenment, but their supreme awakening cannot be measured. Those who wish to teach truthful doctrine can do so with certainty and without falsehood.",
        "source": "T15n0627_001:0413a27_2"
    },
    {
        "source_sentence": "軟首童真則諸菩薩之父母也，愍哀勸化興顯大道，所生親者則當謂於軟首童真！",
        "translation": "The soft-headed boy is the parents of all bodhisattvas, and the relatives he gives rise to should be called the soft-headed boy!",
        "source": "T15n0627_001:0413a29_3"
    },
    {
        "source_sentence": "向者軟首宣揚報恩今復伸說，雖當食者施我鉢饍所食之餘，吾前世時先有所施，",
        "translation": "Even if you were to give food to someone who eats it, they would give me the rest of what I eat with my bowl and bowl. In a previous existence I gave almsfood to that person.",
        "source": "T15n0627_001:0413b02_4"
    },
    {
        "source_sentence": "正謂於斯。」",
        "translation": "It's precisely called this.",
        "source": "T15n0627_001:0413b03_5"
    },
    {
        "source_sentence": "爾時千二百諸天子、欲墮落者各心念言：「當堅其志恭敬於法，察諸因緣去諸根原，",
        "translation": "At the time, 1,200 celestial beings and those who wanted to fall into it each thought, You must firmly establish your resolve with respect for the Dharma and examine the causes and conditions that remove the roots of faculties.",
        "source": "T15n0627_001:0413b04_6"
    },
    {
        "source_sentence": "今者現在世尊前所發願，軟首勸化及開餘人，使至于道而不退轉於無上正真，",
        "translation": "Now the World-honored One has undertaken this vow before us, to lead and inspire others with gentle words so that they may reach enlightenment without regressing from the unsurpassed true path.",
        "source": "T15n0627_001:0413b06_7"
    },
    {
        "source_sentence": "吾等云何而欲墮落？",
        "translation": "How do we want to fall into it?",
        "source": "T15n0627_001:0413b07_8"
    },
    {
        "source_sentence": "吾等何故在如來前，興卑賤意志崇小節？",
        "translation": "Why are we here in the presence of the Tathāgata, with lowly minds and lofty customs?",
        "source": "T15n0627_001:0413b08_9"
    },
    {
        "source_sentence": "今當捨於聲聞、緣覺，慇懃志求無上正真道意。」",
        "translation": "Now, you must abandon śrāvakas and pratyekbuddhas and earnestly seek the intention for the unsurpassed true path.",
        "source": "T15n0627_001:0413b09_10"
    },
    {
        "source_sentence": "軟首伸掌示現變化，乃至下方光明王佛所處國土，而致鉢來一切普入，",
        "translation": "He entered into all the buddha-lands of the ten directions, reaching as far away as the sphere of the enlightened one Supreme Light.",
        "source": "T15n0627_001:0413b10_11"
    },
    {
        "source_sentence": "又復講說往古開化所說經典。",
        "translation": "Furthermore, he taught the scriptures that were taught by the ancient enlightenment.",
        "source": "T15n0627_001:0413b12_0"
    },
    {
        "source_sentence": "下方佛土此世尊界，不可計數眾生之類即發道心，十方世界群萌之儔，",
        "translation": "Countless sentient beings in the buddha-lands of the ten directions aroused the aspiration for enlightenment.",
        "source": "T15n0627_001:0413b12_1"
    },
    {
        "source_sentence": "悉來供養軟首童真！",
        "translation": "They all come to make offerings to the soft-headed boy!",
        "source": "T15n0627_001:0413b14_2"
    },
    {
        "source_sentence": "諸佛世尊皆遣寶蓋供施經典。",
        "translation": "The buddhas and world-honored ones all sent jeweled canopies to offer them to the sūtras.",
        "source": "T15n0627_001:0413b14_3"
    },
    {
        "source_sentence": "彼時寶蓋則覆三千大千佛國，從其寶蓋自然出音：「誠如能仁尊！",
        "translation": "The jeweled canopy then covered the 3,000 great one-thousand buddha kingdoms, and from that jeweled canopy a voice naturally emerged, saying, Indeed, you're so benevolent!",
        "source": "T15n0627_001:0413b15_4"
    },
    {
        "source_sentence": "如如來所讚稱揚，悉是軟首之所勸化。」",
        "translation": "As the Tathāgata praises and extols them, they are all encouraged by the soft-headed one.",
        "source": "T15n0627_001:0413b17_5"
    },
    {
        "source_sentence": "文殊師利普超三昧經卷上",
        "translation": "Mañjuśrī Samantabhadrasamādhi-sūtra, Volume 1",
        "source": "T15n0627_001:0413b18_0"
    }
]