[
    {
        "source_sentence": "佛說如來獨證自誓三昧經",
        "translation": "Foshuo rulai sanmei jing, a scripture of the Tathāgata's solitary realization of self- vow",
        "source": "T15n0623_001:0346b05_0"
    },
    {
        "source_sentence": "西晉月氏三藏竺法護譯",
        "translation": "Translated by Zhu Fahou, the Tripiṭaka Master of the Yue family of the Western Jin Dynasty",
        "source": "T15n0623_001:0346b07_0"
    },
    {
        "source_sentence": "聞如是：一時佛遊於句潭彌國大叢樹間交露精舍，所止道場名曰獨證自誓三昧。",
        "translation": "Thus I heard: One time, the Buddha traveled to a large jungle monastery between the trees in Kutamī and stayed at a site of enlightenment called solitary realizing one's own vow samādhi.",
        "source": "T15n0623_001:0346b08_0"
    },
    {
        "source_sentence": "初始得佛光景甚明，自然靈瑞寶蓮華座，其花清香明徹十方，華有千葉，",
        "translation": "When he had just begun to attain buddhahood, the light and scenery of the Buddha’s illumination became very bright. The jeweled lotus-flower throne with its natural spiritual signs and fragrance penetrated in all directions;",
        "source": "T15n0623_001:0346b09_1"
    },
    {
        "source_sentence": "一一葉上有化菩薩，接侍庠序玄處虛空，各從其位五體投地，各繞千匝，",
        "translation": "On each leaf there was a magical enlightening bodhisattva, accompanied by attendants in the mysterious space of Vaiśravaṇa, each descending from his posture with five bodies to the ground one thousand paces in circumferenc",
        "source": "T15n0623_001:0346b11_2"
    },
    {
        "source_sentence": "當前恭立，俱發洪音歎未曾有：「唯然世尊！",
        "translation": "The emperor was standing respectfully, and they all spoke in unprecedented numbers to praise him, Yes, Bhagavān!",
        "source": "T15n0623_001:0346b13_3"
    },
    {
        "source_sentence": "我等自於本剎見有化靈瑞之樹，其樹初生光照恒沙諸佛國土，樹出洪音，",
        "translation": "We saw in our own buddha-lands that there were trees producing magical emanations. At the beginning of those trees a ray of light illuminated as many buddha-lands as there are grains of sand in the Ganges River, and from those tre",
        "source": "T15n0623_001:0346b14_4"
    },
    {
        "source_sentence": "其聲清淨哀雅慈和暢入眾心，聞者踊躍，具足平等興大乘行，六度無極三十七品備悉佛事。」",
        "translation": "The sound is pure, graceful, compassionate, and peaceful, enters the minds of all people, causes those who hear it to jump for joy, fulfills the practice of the great vehicle with equality and unity, produces the six perfections",
        "source": "T15n0623_001:0346b15_5"
    },
    {
        "source_sentence": "爾時恒沙世界，一一如來各遣菩薩，宣揚道教光顯大乘，告其菩薩曰：「汝等從此佛二度如恒沙等剎，",
        "translation": "At that time in the worlds as numerous as the grains of sand in the Ganges River each buddha sent enlightening beings to preach the Teaching of Enlightenment and reveal the Great Vehicle. They said to those enlightening beings, “",
        "source": "T15n0623_001:0346b17_6"
    },
    {
        "source_sentence": "有佛土名曰沙呵(漢言忍界)，其佛名能仁如來、無所著、至真、過四道不受、平等覺，",
        "translation": "There is a buddha-land called Sahā (known as the realm of forbearance in Chinese). The Buddha there is called Nengren (“Forbearance”) Tathāgata, free from attachment, supremely true, beyond the four paths",
        "source": "T15n0623_001:0346b20_7"
    },
    {
        "source_sentence": "以法律神足佛言教作佛事。」",
        "translation": "They perform buddha-works based on the words of the Dharma, spiritual feet, and Buddha teachings.",
        "source": "T15n0623_001:0346b21_8"
    },
    {
        "source_sentence": "一一如來手執千葉蓮華，授其菩薩而告之曰：「汝持吾名致敬無量，欣承正士功成志就道體備足，",
        "translation": "Each of the Tathāgatas held a thousand-petaled lotus flower in their hands, gave it to the bodhisattva, and said to him, “Take my name and venerate me with immeasurable reverence. I am delighted",
        "source": "T15n0623_001:0346b22_9"
    },
    {
        "source_sentence": "降神五濁為眾重任，超次趠第在彌勒前，弘慈六度普濟群生，興居輕利道教勝常。",
        "translation": "He subdued the five turbidities of his spirit as a heavy burden for all people, surpassed Maitreya's second and third ranks in front of Maitreya, promoted kindness and the six perfections to save all sentient beings",
        "source": "T15n0623_001:0346b24_10"
    },
    {
        "source_sentence": "今致此華成法供養，願使一切普會道場。」",
        "translation": "Now, I'll cause this flower to become an offering of the Dharma and wish to make it universally assembly at the site of enlightenment.",
        "source": "T15n0623_001:0346b26_11"
    },
    {
        "source_sentence": "彼諸菩薩承佛威神，各從其剎忽然不現，潛定寂靜入觀三昧，須臾之間俱到忍界。",
        "translation": "Those bodhisattvas, imbued with the Buddha's authoritative power, each suddenly disappeared from their bases and entered contemplation concentration in latent concentration and quiescence, and in a moment they all arrived at the forbearance realm.",
        "source": "T15n0623_001:0346b27_12"
    },
    {
        "source_sentence": "各離其坐，端嚴恭立，歸崇聖化五體投地，退繞七匝却住本位，神足玄處威儀肅然，",
        "translation": "Each of them departed from their seats, stood upright and respectfully. They revered the teachings of the Buddha and bowed down to the ground in five parts. After circumambulating him seven times, they withdrew and remained in their original positions",
        "source": "T15n0623_001:0346b29_13"
    },
    {
        "source_sentence": "法服正齊俱發洪音，前白佛言：「我等世尊本土如來致敬無量，欣承功成志就道體備足，",
        "translation": "When the Dharma robes were correctly aligned, they all spoke a loud voice and said to the Buddha, “O Bhagavat! We revere the Tathāgata of our native land for his immeasurable kindness.",
        "source": "T15n0623_001:0346c02_14"
    },
    {
        "source_sentence": "降神五濁為眾重任，超次趠第在彌勒前，弘慈六度普濟群生，興居輕利道教勝常。",
        "translation": "He subdued the five turbidities of his spirit as a heavy burden for all people, surpassed Maitreya's second and third ranks in front of Maitreya, promoted kindness and the six perfections to save all sentient beings",
        "source": "T15n0623_001:0346c04_15"
    },
    {
        "source_sentence": "今贈此華成法供養，願使一切普會道場。」",
        "translation": "Now, I'll present this flower as an offering for the accomplishment of the Dharma and wish to cause all people to universally assembly at the site of enlightenment.",
        "source": "T15n0623_001:0346c06_16"
    },
    {
        "source_sentence": "佛言：「善哉正士！",
        "translation": "The Buddha said, Good, righteous man!",
        "source": "T15n0623_001:0346c07_17"
    },
    {
        "source_sentence": "欣承彼諸如來慧教不惓三昧通暢，法身空淨智明弘備此彼等一。",
        "translation": "They're delighted to inherit the wisdom teachings of those tathāgatas, don't despise samādhi, and are well-versed in the Dharma body as emptiness, purity, wisdom, insight, and extensive",
        "source": "T15n0623_001:0346c07_18"
    },
    {
        "source_sentence": "敬嘉所聞，光慶無量。」",
        "translation": "What I've heard with respect and praise, the light and joy are immeasurable.",
        "source": "T15n0623_001:0346c09_19"
    },
    {
        "source_sentence": "爾時能仁如來手受此華欣然而笑，光從口出，普照十方恒沙無量諸佛世界，",
        "translation": "At that moment the Buddha Neng Ren laughed joyfully as he accepted this flower in his hands. The ray of light emanated from his mouth and illumined infinitely many buddha-worlds like the sands of the Ganges in the ten directions",
        "source": "T15n0623_001:0346c09_20"
    },
    {
        "source_sentence": "便以此華等散恒沙無量諸佛；",
        "translation": "They scattered these flowers as numerous as the sands of the Ganges River with infinite buddhas.",
        "source": "T15n0623_001:0346c11_21"
    },
    {
        "source_sentence": "恒沙無量諸佛亦以光明普洞通徹恒沙世界。",
        "translation": "Measureless buddhas as numerous as the sands of the Ganges also penetrate the world as vast as the sands of the Ganges with their light.",
        "source": "T15n0623_001:0346c12_22"
    },
    {
        "source_sentence": "一一眾生蒙佛慈光，皆得慧觀達識宿命。",
        "translation": "Each sentient being is enlightened by the Buddha's compassionate light, and they all attain wisdom that observes past lives of consciousness.",
        "source": "T15n0623_001:0346c13_23"
    },
    {
        "source_sentence": "展轉相照照下地獄，三惡八難、天堂人中盡蒙慈光皆得解脫，百千眾生盡同一意，",
        "translation": "In the lower hells, which are gradually illumined by each other, all the three evil and eight difficulties and heavenly beings who receive the light of compassion will be liberated, and hundreds of thousands of sentient beings will all have the",
        "source": "T15n0623_001:0346c14_24"
    },
    {
        "source_sentence": "普發無上正真道心。",
        "translation": "He universally arouses the mind of the unsurpassed true path.",
        "source": "T15n0623_001:0346c15_25"
    },
    {
        "source_sentence": "其光尋還繞身三匝，滅於頂上。",
        "translation": "The light then circled his body three times and disappeared above the top of his head.",
        "source": "T15n0623_001:0346c16_26"
    },
    {
        "source_sentence": "爾時恒沙等諸佛，盡通相見諸佛威神，普使眾生普得見佛，現變畢竟廓如常故。",
        "translation": "At the time, the buddhas as numerous as the sands of the Ganges had all seen the buddhas' authoritative power and caused sentient beings everywhere to see them, because their manifestations were ultimately as vast as ever.",
        "source": "T15n0623_001:0346c17_27"
    },
    {
        "source_sentence": "「妙哉大聖化，　　愍哀群萌類，",
        "translation": "“How wonderful is the teaching of the Great Sage! With compassion for all living beings,",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "　從無央數劫，　　積功累德行。",
        "translation": "For countless eons they have accumulated merit and virtuous deeds.",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "　一一功德行，　　有若干百千，",
        "translation": "Each one’s virtuous deeds Are several hundreds of thousands:",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "　百福成一相，　　願禮三界尊。",
        "translation": "A hundred merits form a single characteristic, and I wish to venerate the honored one of the three realms.",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "　妙哉大聖化，　　慈慧無有邊，",
        "translation": "Marvelous is the great sage’s exposition, Boundless is his compassion and wisdom.",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "　道教清且貴，　　釋師天中天。",
        "translation": "The teaching of the Way is pure and noble, and the teacher Śākyamuni is a god among gods.",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "　大智高無上，　　法船濟群生，",
        "translation": "The great knowledge is supremely high, the ship of truth saves all sentient beings.",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "　聖慧淨無量，　　願禮無上尊。",
        "translation": "Their noble wisdom is pure and immeasurable, so may they venerate the supreme honored one.",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "　妙哉大聖化，　　慈光潤恒沙，",
        "translation": "Marvelous is the teaching of the Great Sage, whose compassionate light nourishes the sands of the Ganges.",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "　愚冥永已除，　　迷悟及濁清。",
        "translation": "The darkness of ignorance has been forever removed, and delusion, enlightenment, and the turbidity are purified.",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "　惠澤隨時宜，　　善權接群黎，",
        "translation": "Huizhao adapted himself appropriately to the occasion, skillfully and expediently taking care of all living beings.",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "　法橋度一切，　　願禮三界尊。」",
        "translation": "The Dharma bridge saves all, and I wish to venerate the honored one of the three realms.",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "於時坐中有菩薩名曰賢儒，即於佛前以偈歎曰：於是聖師告賢儒曰：「諸佛法笑有三因緣。",
        "translation": "At the time, there was a bodhisattva named Xianju who was seated in front of the Buddha and praised him in verse, saying, The noble teacher then addressed Xianju, There are three reasons for the buddhas' laughter.",
        "source": "T15n0623_001:0346c18_28"
    },
    {
        "source_sentence": "何謂為三？",
        "translation": "What are these three?",
        "source": "T15n0623_001:0347a03_29"
    },
    {
        "source_sentence": "薩云若智深遠微妙，明暢三世達眾生原，三乘趣向各有本行根信具足。",
        "translation": "If the saṃyuktâgama's knowledge is profound and subtle, it explains that he understands the origin of sentient beings in the three times and has the original faculty of practice and faith in each of the three-vehicle destinies",
        "source": "T15n0623_001:0347a04_30"
    },
    {
        "source_sentence": "或有菩薩志在弘誓，被大德鎧為眾重任，斷所趣向為世橋梁，專擢六度不捨一切，",
        "translation": "“Some enlightening beings, determined for great vows, carrying the armor of great virtue as their burden, abandon what belongs to them as worldly bridges, singlemindedly advancing the six transcendent ways without",
        "source": "T15n0623_001:0347a05_31"
    },
    {
        "source_sentence": "道住漸著勇猛精進，布施無想、戒忍護行、禪定不亂、慧智清明向不退轉。",
        "translation": "The abode of the path is gradually attached to courageous effort, generosity without ideation, morality, forbearance, discipline, meditation that's not disturbed, and wisdom that's clear and directed toward nonregression.",
        "source": "T15n0623_001:0347a07_32"
    },
    {
        "source_sentence": "是等，賢儒，佛眼悉見，一一授決。",
        "translation": "Good men and scholars, seeing them all with the Buddha's eye, they each gave a ruling.",
        "source": "T15n0623_001:0347a09_33"
    },
    {
        "source_sentence": "非但一佛授其人決，十方現在諸佛皆授其決。",
        "translation": "It's not just that one Buddha gives a decision to someone, but all the buddhas in the ten directions give them a decision.",
        "source": "T15n0623_001:0347a10_34"
    },
    {
        "source_sentence": "是一因緣。",
        "translation": "It's one cause and condition.",
        "source": "T15n0623_001:0347a11_35"
    },
    {
        "source_sentence": "復次賢儒！",
        "translation": "Furthermore, good men and scholars!",
        "source": "T15n0623_001:0347a11_36"
    },
    {
        "source_sentence": "若有菩薩向阿惟顏，積殖德本具足聖慧，供養恒沙無量諸佛，一一受決，",
        "translation": "Suppose there is a bodhisattva who faces the āveyaṇa and accumulates his roots of virtue, which are endowed with noble wisdom. He makes offerings to innumerable buddhas as numerous as the sands of the",
        "source": "T15n0623_001:0347a11_37"
    },
    {
        "source_sentence": "決決相明明淨佛土，等潤群生普同一行。",
        "translation": "The decisive characteristic of the Buddha land is clear and pure, equally nourishing all sentient beings with the same practice.",
        "source": "T15n0623_001:0347a13_38"
    },
    {
        "source_sentence": "招來諸佛賢聖大仁，於四駃流為大法船，竭六欲海、枯十二門，入五道、淨五眼，",
        "translation": "Invited by the buddhas, wise and noble great benefactors, they become great ships of teaching in the four crude rivers, exhausting the six oceans of desire, withering the twelve gates, entering the five paths,",
        "source": "T15n0623_001:0347a14_39"
    },
    {
        "source_sentence": "凝神玄寂，處兜術宮集諸菩薩達士正士，淨三界行講不退輪。",
        "translation": "He concentrated his mind in profound quiescence, stayed at the palace of Tuṣita and gathered the bodhisattvas, scholars, and righteous men to purify the three realms and practice the nonretrogressing wheel of",
        "source": "T15n0623_001:0347a16_40"
    },
    {
        "source_sentence": "十方現在諸佛於八部眾，皆共嗟歎如此菩薩，稱揚其德，言：『當降神作佛不久，",
        "translation": "The buddhas of the ten directions, present in the eightfold assembly, all praised this enlightening being and extolled his virtue, saying:",
        "source": "T15n0623_001:0347a17_41"
    },
    {
        "source_sentence": "十方眾生普得解脫。』",
        "translation": "All sentient beings in the ten directions will attain liberation.'",
        "source": "T15n0623_001:0347a19_42"
    },
    {
        "source_sentence": "是二因緣。",
        "translation": "These are the two causes and conditions.",
        "source": "T15n0623_001:0347a19_43"
    },
    {
        "source_sentence": "復次賢儒！",
        "translation": "Furthermore, good men and scholars!",
        "source": "T15n0623_001:0347a19_44"
    },
    {
        "source_sentence": "若有菩薩，於兜術宮畢彼天壽當下降神，便入究竟廣現三昧。",
        "translation": "Suppose there's a bodhisattva who enters the ultimate extensive manifestation samādhi at the end of that god's life in the palace of Tuṣita, and then descends into it.",
        "source": "T15n0623_001:0347a20_45"
    },
    {
        "source_sentence": "淨居諸天普觀三千大千之剎，國邑寬大眾生軟和，剎利梵志長者居士，",
        "translation": "The Śuddhāvāsa gods observed all the great one-thousand buddha-lands of the 3,000 great one-thousand worlds, and as the cities grew larger the masses produced gentle harmony.",
        "source": "T15n0623_001:0347a21_46"
    },
    {
        "source_sentence": "何城何邑百億之中，有道有德清淨淳淑仁和慈慧。",
        "translation": "In each of the ten billion cities and towns, there's a path with virtue, purity, simplicity, kindness, harmony, compassion, and wisdom.",
        "source": "T15n0623_001:0347a23_47"
    },
    {
        "source_sentence": "轉輪聖王正處天竺，議集降神諸天翼從。",
        "translation": "The wheel-turning sage king was right in India, and he assembled the gods to subdue him.",
        "source": "T15n0623_001:0347a24_48"
    },
    {
        "source_sentence": "現居宮中侍女宿衛，現學盡俗觀四非常，淨居天子勸進出家，入山研精坐貝多樹，",
        "translation": "The god Śubhavyūha now lives in the palace, is attended by a constellation guard, and observes the four impermanent realms of all worldly dharmas.",
        "source": "T15n0623_001:0347a25_49"
    },
    {
        "source_sentence": "去髮自誓作比丘像，修先佛法，以法為師、淨居為證，一夜三達降魔官屬具足佛事。",
        "translation": "Going away, he vowed to make an image of the bhikṣu and cultivate the teachings of the previous buddhas, using the Dharma as his teacher and Jīvaka as his proof, and for one night he subdued Māra's official",
        "source": "T15n0623_001:0347a27_50"
    },
    {
        "source_sentence": "靈瑞之樹普出恒沙諸佛世界，一一如來於其剎土八部眾中，嗟歎坐樹菩薩功德。",
        "translation": "The spiritually enlightened trees all emerged from the buddha worlds as numerous as the grains of sand in the Ganges River. Each buddha, among the eightfold assembly within each buddha-land, extolled the bodhisatt",
        "source": "T15n0623_001:0347a29_51"
    },
    {
        "source_sentence": "如此各各遣其土菩薩往贈華，致敬讚揚大乘。",
        "translation": "Each of these bodhisattvas from their respective lands sent flowers to present to them, paying homage and praising the great vehicle.",
        "source": "T15n0623_001:0347b02_0"
    },
    {
        "source_sentence": "如此，賢儒！",
        "translation": "So it is, good man!",
        "source": "T15n0623_001:0347b03_1"
    },
    {
        "source_sentence": "十方現在諸佛皆共知之，善慶眾生普會道場。",
        "translation": "The present buddhas of the ten directions all know it, and they skillfully celebrate sentient beings who universally assemble at the site of enlightenment.",
        "source": "T15n0623_001:0347b03_2"
    },
    {
        "source_sentence": "是三因緣。",
        "translation": "These are the three causes and conditions.",
        "source": "T15n0623_001:0347b04_3"
    },
    {
        "source_sentence": "是等菩薩來者，皆是如來本因緣人，因此說法皆當逮得無所從生，或向童真、或向了生、向阿惟顏者，",
        "translation": "“These enlightening beings all come because of the original causes and conditions of the buddhas. Because of these teachings they will attain nonorigination, either by going to the realm of youthfulness, or by going to that which is born in",
        "source": "T15n0623_001:0347b04_4"
    },
    {
        "source_sentence": "故如來一一授決分明具足。",
        "translation": "That's why the Tathāgata gives each one a distinctive statement that it's complete.",
        "source": "T15n0623_001:0347b06_5"
    },
    {
        "source_sentence": "當知正士！",
        "translation": "You should know, righteous man!",
        "source": "T15n0623_001:0347b07_6"
    },
    {
        "source_sentence": "佛不妄笑。」",
        "translation": "The Buddha doesn't laugh falsely.",
        "source": "T15n0623_001:0347b07_7"
    },
    {
        "source_sentence": "說是語時，七十億那術菩薩得童真位；",
        "translation": "When these words were uttered, seventy-million bodhisattvas attained the state of youthful integrity.",
        "source": "T15n0623_001:0347b08_8"
    },
    {
        "source_sentence": "六十億那術菩薩得了生位；",
        "translation": "Sixty-thousand koṭis of enlightening beings attained the state of birth.",
        "source": "T15n0623_001:0347b08_9"
    },
    {
        "source_sentence": "三十億那術菩薩得阿惟顏；",
        "translation": "Three billion enlightening beings of Nāgârjuna obtained the countenance of abhidharma.",
        "source": "T15n0623_001:0347b09_10"
    },
    {
        "source_sentence": "百千億比丘得阿羅漢；",
        "translation": "Hundreds of trillions of monks attained arhatship.",
        "source": "T15n0623_001:0347b10_11"
    },
    {
        "source_sentence": "九十億那術人皆得道迹；",
        "translation": "Nine billion people attained the traces of enlightenment.",
        "source": "T15n0623_001:0347b10_12"
    },
    {
        "source_sentence": "三界諸天普得法眼。",
        "translation": "The gods of the three realms universally attain the Dharma eye.",
        "source": "T15n0623_001:0347b11_13"
    },
    {
        "source_sentence": "「法界一切空，　　色身清淨真，",
        "translation": "“All things in the cosmos are void, form and body pure and true,",
        "source": "T15n0623_001:0347b11_14"
    },
    {
        "source_sentence": "　總持度無極，　　三昧無有因。",
        "translation": "The general precepts are limitless, and there's no cause for samādhi.",
        "source": "T15n0623_001:0347b11_14"
    },
    {
        "source_sentence": "　佛界亦不空，　　慧淨亦不有，",
        "translation": "The buddha-realm is also not empty, And the purity of wisdom does not exist.",
        "source": "T15n0623_001:0347b11_14"
    },
    {
        "source_sentence": "　哀世表微笑，　　正士宜速受。」",
        "translation": "I'm sorry, World-Honored One, that you're smiling, but it's better for a righteous man to accept it quickly.",
        "source": "T15n0623_001:0347b11_14"
    },
    {
        "source_sentence": "於是聖師而作頌曰：於是座中有眼見光賢菩薩，即起正衣服，偏露右臂下右膝，",
        "translation": "The holy teacher then composed the following verse: At that seat, seeing the enlightening being Guṇamatiṃdhara Bodhisattva with eyes on his right shoulder, he straightened his outer garment and bared his right knee at",
        "source": "T15n0623_001:0347b11_14"
    },
    {
        "source_sentence": "長跪叉手前白聖師：「願有所問。",
        "translation": "He knelt down with his palms joined together and said to the holy teacher, May I ask a question?",
        "source": "T15n0623_001:0347b18_15"
    },
    {
        "source_sentence": "唯聖師以無量慧照釋未聞。」",
        "translation": "Only the noble teacher explains it with immeasurable wisdom that he hasn't heard it.",
        "source": "T15n0623_001:0347b19_16"
    },
    {
        "source_sentence": "答曰：「善哉！",
        "translation": "He replied, Good!",
        "source": "T15n0623_001:0347b19_17"
    },
    {
        "source_sentence": "恣汝所問。",
        "translation": "I'll do as you ask.",
        "source": "T15n0623_001:0347b20_18"
    },
    {
        "source_sentence": "今當為汝具敷大要。」",
        "translation": "Now, I will present the great essentials for you.",
        "source": "T15n0623_001:0347b20_19"
    },
    {
        "source_sentence": "眼見光賢菩薩曰：「何謂正士出家具足道證至薩云若？」",
        "translation": "Seeing Guangxian Bodhisattva with his eyes, he said, What does it mean for a righteous man to leave the furnished footstool path and realize sarvajña?",
        "source": "T15n0623_001:0347b20_20"
    },
    {
        "source_sentence": "於是聖師告曰：「正士！",
        "translation": "The noble teacher then told him, Righteous man!",
        "source": "T15n0623_001:0347b22_21"
    },
    {
        "source_sentence": "善聽著意。",
        "translation": "He well listens to and focuses his attention.",
        "source": "T15n0623_001:0347b22_22"
    },
    {
        "source_sentence": "諸佛出家要有起發，端坐思閑玄靜通微。",
        "translation": "The buddhas who renounce the householder's life need to get up, sit correctly, and meditate in seclusion with profound quiescence and subtlety.",
        "source": "T15n0623_001:0347b22_23"
    },
    {
        "source_sentence": "夫專精念道分有所感，應感者淨居天子梵王自在，便勅帝釋化四非常老病死像，",
        "translation": "When he concentrates his efforts on the factors of mindfulness of the path, there's something to be felt, and what should be felt is the image of the purely abiding celestial prince Brahmā king with sovereignty, who then commands Indra to transform",
        "source": "T15n0623_001:0347b23_24"
    },
    {
        "source_sentence": "因此說證離欲苦難念道清淨，當處山澤研精行禪。",
        "translation": "That's why it's said to realize the purity of the path of mindfulness that's free of the suffering of desire, which is difficult to remember, and where there's a place in a mountain swamp to concentrate on meditation.",
        "source": "T15n0623_001:0347b25_25"
    },
    {
        "source_sentence": "此意方興，四王已下給侍所當詣貝多樹，憶念先佛出家之法，以法為師、天梵為證，",
        "translation": "When this thought arose, the four kings came down to pay their respects and went to the pāda tree. They remembered the way in which the Buddha had formerly renounced household life, taking the Dharma as his teacher and god Brahmā as his",
        "source": "T15n0623_001:0347b26_26"
    },
    {
        "source_sentence": "信根內固，宿習六度三十七品具足佛事忽然自悟，帝釋便下剃刀授手。",
        "translation": "His faculty of faith was firm inside, and he had cultivated the thirty-seven chapters of the six perfections in the past to perfect the Buddha's service. Suddenly he realized it for himself, and Indra shaved his sword and",
        "source": "T15n0623_001:0347b28_27"
    },
    {
        "source_sentence": "於是菩薩左手執髮、右手持刀，心自念言：『刈習苦垢植無著根，斷不退流通泥洹原。』",
        "translation": "The bodhisattva then held the knife in his left hand and right hand and thought to himself, 'I'll mow up the root of suffering and plant it without attachment, cutting off and not retreating from the nirvāṇa plain.'",
        "source": "T15n0623_001:0347c01_28"
    },
    {
        "source_sentence": "發意已來常得去家，堅固之志心無懈惓深不退轉，信證具足意思分明。",
        "translation": "Ever since his arousal of the intention, he's always been able to leave home, has a resolute mind without laziness or retrogression, and believes that he's fully endowed with clear intellect.",
        "source": "T15n0623_001:0347c03_29"
    },
    {
        "source_sentence": "刀未近髮忽便自墮，肉髻自然。",
        "translation": "Before the sword approached him, he suddenly fell down on his own, and his flesh came out spontaneously.",
        "source": "T15n0623_001:0347c04_30"
    },
    {
        "source_sentence": "補處菩薩心念：『先佛出家去髮，應有袈裟法服撿心。』",
        "translation": "The patched-robe bodhisattva thought, 'First, the Buddha left home and departed, and there should be a monk's robe to examine his mind.'",
        "source": "T15n0623_001:0347c05_31"
    },
    {
        "source_sentence": "方興此念，淨居天子即授淨素天繒自然袈裟。",
        "translation": "He then had this thought, and the god Śuddhāvāsadeva gave him the natural reddish-brown monk's robe.",
        "source": "T15n0623_001:0347c06_32"
    },
    {
        "source_sentence": "菩薩受已，被之於體法服齊正。",
        "translation": "After the bodhisattva accepted it, he was correctly dressed in Dharma robes with his body.",
        "source": "T15n0623_001:0347c07_33"
    },
    {
        "source_sentence": "於是恒沙無量世界諸佛盡通相見，各送袈裟授與菩薩。",
        "translation": "The buddhas of the infinite worlds in the Ganges River then saw each other, each sending their robes and giving them to the bodhisattva.",
        "source": "T15n0623_001:0347c08_34"
    },
    {
        "source_sentence": "菩薩即受，彼此諸佛普現威神，盡令諸佛所送袈裟合成一服，名曰薩披佛頭震越。",
        "translation": "The bodhisattva then accepted it, and the buddhas of each other universally manifested their authoritative powers, causing all the buddhas to send a monk's robe made into a single robe named Sadāparibhūta Buddha's head",
        "source": "T15n0623_001:0347c09_35"
    },
    {
        "source_sentence": "此衣今在梵天。",
        "translation": "This robe is now in the Brahma Heaven.",
        "source": "T15n0623_001:0347c11_36"
    },
    {
        "source_sentence": "所以端坐六年以畢宿緣，六年後夜戒證方現。",
        "translation": "That's why he sat there for six years at the end of his days and nights, and after six years, he realized the precepts on the night before they appeared.",
        "source": "T15n0623_001:0347c12_0"
    },
    {
        "source_sentence": "何謂戒證？",
        "translation": "What's meant by realizing the precepts?",
        "source": "T15n0623_001:0347c13_1"
    },
    {
        "source_sentence": "志在閑寂山澤受法，神真操遠持戒行道，不惜壽命棄捐身體，齊等萬物不求利養，",
        "translation": "He wished to live in seclusion in the mountains and swamps to receive the Dharma, but he practiced morality far away from his deities. He did not cherish life or give up his body for religious salvation. Like all things, he did",
        "source": "T15n0623_001:0347c13_2"
    },
    {
        "source_sentence": "守空行寂常觀淨法，慈悲喜護四等四恩，具無蓋哀明釋四禪，無瑕無穢無黠念，",
        "translation": "He guards emptiness, practices quiescence, always observes the pure dharmas, compassionately and joyfully protects the four kinds of kindness, fully explains the four meditations without obscurity or pity, has no flaw",
        "source": "T15n0623_001:0347c15_3"
    },
    {
        "source_sentence": "不從他人法，於佛法中得泥洹道。",
        "translation": "They don't follow the teachings of others and attain the path of nirvāṇa in the Buddha's teaching.",
        "source": "T15n0623_001:0347c16_4"
    },
    {
        "source_sentence": "是為真戒沙門。」",
        "translation": "This is a true ascetic who observes the precepts.",
        "source": "T15n0623_001:0347c17_5"
    },
    {
        "source_sentence": "佛告：「正士禁戒無形不著三界，無識無吾、無我無人、無命無意、無名無種、無化無數無作、無所從來無所從去、無形無滅、無身無犯、無口無言、無心無念、無世事無計無事無所住、亦無有戒無有惑、無所念無敗壞，",
        "translation": "The Buddha told them, A righteous person who observes the precepts without form and doesn't cling to the three realms, without consciousness or self, without self or person, without life or mind, without name or seed, without transformation or",
        "source": "T15n0623_001:0347c18_6"
    },
    {
        "source_sentence": "是名禁戒。",
        "translation": "This is called the forbidden precept.",
        "source": "T15n0623_001:0347c22_7"
    },
    {
        "source_sentence": "佛禁戒無瑕穢亦無著戒者，無瞋無恚安定清淨，就度世道如是為持戒，",
        "translation": "Those who observe the Buddha’s precept against immorality without blemish or attachment are free from hatred and resentment. They are neither angry nor hostile, they are stable and pure.",
        "source": "T15n0623_001:0347c23_8"
    },
    {
        "source_sentence": "不受身形不受壽命亦不樂五道，悉曉人於佛法中，是為持戒。",
        "translation": "Not accepting body form, not accepting life, and not enjoying the five paths, fully understanding people in the Buddha's teaching is called observing precepts.",
        "source": "T15n0623_001:0347c24_9"
    },
    {
        "source_sentence": "亦不在中亦不在邊，亦不著亦不轉，譬如虛空中風，是為持戒菩薩。",
        "translation": "They aren't in the middle or at the edge, and they don't cling or turn, like the wind in space, which is a bodhisattva who observes precepts.",
        "source": "T15n0623_001:0347c26_10"
    },
    {
        "source_sentence": "正士初坐樹下淨始戒證，棄欲苦本、捨分散意，意無起想，不動想、不傲想、不我想、不彼想、不中想、不彼此想、不中外想、無道想、無俗想、無滅想。",
        "translation": "When the righteous man first sat under a tree for the first time and realized the pure precepts, he abandoned the root of suffering from desire and abandoned distracting thoughts, which have no thoughts that arise, no thoughts that don't move, no thoughts",
        "source": "T15n0623_001:0347c27_11"
    },
    {
        "source_sentence": "滅無想無、無無想想、無無無想、盡無盡想。",
        "translation": "He ceases the absence of perception and non-perception, the absence of perception and non-perception, the absence of perception and non-perception, and the perception of exhaustion and non-exhaustion.",
        "source": "T15n0623_001:0348a02_12"
    },
    {
        "source_sentence": "如是正士樹下立證，淨本千八百戒。",
        "translation": "Thus, this is the true man who establishes the realization under a tree and purifies the original 1,800 precepts.",
        "source": "T15n0623_001:0348a03_13"
    },
    {
        "source_sentence": "此數始訖，金剛之座忽然從地裂而出，第六魔宮而大傾動，三界諸天不安本位，",
        "translation": "When these numbers had been counted, the vajra throne suddenly came out of the earth. The sixth demonic palace trembled in distress, and the gods of the three realms were unsettled at their original state.",
        "source": "T15n0623_001:0348a03_14"
    },
    {
        "source_sentence": "皆共俱下詣貝多樹，供侍所當。",
        "translation": "They all went down to the shellfish tree together, where they were attended.",
        "source": "T15n0623_001:0348a05_15"
    },
    {
        "source_sentence": "恒沙世界忽有洪音，洪音之中云：『坐樹菩薩是夜啟證。』",
        "translation": "Suddenly, there's a great sound in the world of the sands of the Ganges, and within that great sound it says, 'The bodhisattva sitting in the tree is awakening at night.'",
        "source": "T15n0623_001:0348a06_16"
    },
    {
        "source_sentence": "眾生各各皆聞皆見如是正士。",
        "translation": "Each of the sentient beings heard and saw such a righteous man.",
        "source": "T15n0623_001:0348a07_17"
    },
    {
        "source_sentence": "是為菩薩具足戒證成薩云若，三達六通、三十七品、十八不共、十力、四無所畏一切普具。",
        "translation": "This is the bodhisattva who fulfills the precepts to realize sarvajña, which are fully endowed with the three understandings of the six powers, the thirty-seven chapters, the 18 distinctive qualities, the ten power",
        "source": "T15n0623_001:0348a08_18"
    },
    {
        "source_sentence": "三千世界六反震動，功德降魔光明普照，恒沙世界眾生蒙此慈光一時得安，",
        "translation": "Three thousand worlds quaked six times, the light of virtue subjugating Māra shone everywhere, and sentient beings in the sands of the Ganges were instantly at peace because of this light of compassion.",
        "source": "T15n0623_001:0348a10_19"
    },
    {
        "source_sentence": "普發無上正真道意。」",
        "translation": "He universally arouses the intention for the unsurpassed true path.",
        "source": "T15n0623_001:0348a12_20"
    },
    {
        "source_sentence": "佛說是時，八百比丘得阿羅漢；",
        "translation": "When the Buddha spoke these words, eight hundred monks attained arhatship.",
        "source": "T15n0623_001:0348a12_21"
    },
    {
        "source_sentence": "三萬天人皆得法眼；",
        "translation": "All of the thirty thousand celestial beings obtained the divine eye of the Teaching.",
        "source": "T15n0623_001:0348a13_22"
    },
    {
        "source_sentence": "三千人得阿那含；",
        "translation": "Three thousand people attained the anāgāmi-phala.",
        "source": "T15n0623_001:0348a13_23"
    },
    {
        "source_sentence": "賢儒正士等逮無所從生。",
        "translation": "Good men, Confucian scholars, and righteous people all acquire nothing to give rise to.",
        "source": "T15n0623_001:0348a14_24"
    },
    {
        "source_sentence": "於是聖師告賢儒曰：「昔吾一時遊句潭彌國。",
        "translation": "The holy teacher then addressed Xianlu, saying, Once, I traveled to the kingdom of Kutamī at one time.",
        "source": "T15n0623_001:0348a15_0"
    },
    {
        "source_sentence": "爾時天魔部黨忽與眷屬來入大眾，作異被服與眾同處，動共諍訟更相誹謗兩頭謳合，",
        "translation": "It was then that the god Māra's group suddenly came into the assembly with their retinues, did something different, and were dressed in the same place as the crowd. They became agitated and argued among themselves, further denigrating each other, and",
        "source": "T15n0623_001:0348a16_0"
    },
    {
        "source_sentence": "生死比丘不閑道體，恚心忿惱，各自離群馳散。",
        "translation": "The monks of birth-and-death aren't at leisure in the essence of the path, and their minds are angry and wrathful, each separated from the crowd and scattered.",
        "source": "T15n0623_001:0348a17_1"
    },
    {
        "source_sentence": "羅漢真人各之山林。",
        "translation": "The arhats and real people are each in a mountain forest.",
        "source": "T15n0623_001:0348a18_2"
    },
    {
        "source_sentence": "爾時，賢儒！",
        "translation": "At that point, good man!",
        "source": "T15n0623_001:0348a19_3"
    },
    {
        "source_sentence": "夏三月已過歲暮已至，當鉢和蘭，十四日夜明星出時，惟勅阿難鳴揵搥、布草蓐，",
        "translation": "On the fourteenth day of the third month in the summer, past the end of the year, it will be the time for a new moon to appear. When the stars come out on the night of the fourteenth day, Ānanda is instructed to",
        "source": "T15n0623_001:0348a19_4"
    },
    {
        "source_sentence": "惟與阿難共受歲。",
        "translation": "He only shared the years with Ānanda.",
        "source": "T15n0623_001:0348a21_5"
    },
    {
        "source_sentence": "爾時淨居天子於虛空中白佛：『世尊！",
        "translation": "It was then that the Pure Land celestial son said to the Buddha in space, 'Bhagavān!",
        "source": "T15n0623_001:0348a21_6"
    },
    {
        "source_sentence": "今比丘眾各共分散。",
        "translation": "Now, the monks are scattered together.",
        "source": "T15n0623_001:0348a22_7"
    },
    {
        "source_sentence": "今佛受歲何其獨自？』",
        "translation": "Why is the Buddha alone at the present time when he's undergoing this?'",
        "source": "T15n0623_001:0348a23_8"
    },
    {
        "source_sentence": "佛告天子：『昔吾出家以汝為證，詣貝多樹汝復為證，今我受歲汝復為證。",
        "translation": "The Buddha told the celestial son, 'In the past, I renounced home because of you as my realization, and when I went to the palm tree, you were also my realization; now that I've accepted the years, you're also",
        "source": "T15n0623_001:0348a23_9"
    },
    {
        "source_sentence": "於閻浮利回周三千，無量世界多薩阿竭成薩云若。",
        "translation": "In Jambudvīpa, which is 3,000 yojanas in circumference, there are measureless worlds with many saṅghas that become sarvajñas.",
        "source": "T15n0623_001:0348a25_10"
    },
    {
        "source_sentence": "凡從得佛至于泥曰，汝為三證明體具足。",
        "translation": "Whoever goes from attaining Buddhahood to Nirvāṇa, he said, You've fulfilled the three proofs of your essence.",
        "source": "T15n0623_001:0348a26_11"
    },
    {
        "source_sentence": "當知天子！",
        "translation": "You should know, celestial son!",
        "source": "T15n0623_001:0348a27_12"
    },
    {
        "source_sentence": "多薩阿竭道慧神通獨步三界由復須證，而況一切凡為道者可無師乎？』",
        "translation": "Could it be that the Tathāgata's path, wisdom, and supernormal abilities are self-existent in the three realms because they need to be realized, so why wouldn't all worldlings who practice the path have no teacher?'",
        "source": "T15n0623_001:0348a27_13"
    },
    {
        "source_sentence": "又告淨居：『末世多人志在清白，道心貞明不樂世俗，隱處山林審有去家堅固之志。",
        "translation": "He also told Jōju, 'There are many people in the latter part of the world who aspire to purity and whiteness, whose minds are pure and clear with the path and don't delight in worldly things, and who live in seclusi",
        "source": "T15n0623_001:0348a29_14"
    },
    {
        "source_sentence": "若無師友，當如摩訶迦葉出家之法，遠欲欲捨為證、遠俗俗捨為證、遠名譽譽捨為證、遠形法忘形為證、遠內外求捨求為證。",
        "translation": "If there are no teachers or friends, they should follow Mahākāśyapa's renunciation of the householder's teaching that it's realized by abandoning desire for equanimity, abandoning mundane equanimity as realization, abandoning fame",
        "source": "T15n0623_001:0348b02_15"
    },
    {
        "source_sentence": "如是等，天子！",
        "translation": "So it is, my lord!",
        "source": "T15n0623_001:0348b05_16"
    },
    {
        "source_sentence": "摩訶迦葉以此五證，便下鬚髮被袈裟，師自然法，淨感十方諸佛，求哀自陳：「仰惟三界諸天。」",
        "translation": "Because of these five realizations, Mahākāśyapa then lowered his hair and put on his reddish-brown robes, the teacher naturally taught the Dharma, purified the buddhas of the ten directions, begged for pity, and said,",
        "source": "T15n0623_001:0348b05_17"
    },
    {
        "source_sentence": "自陳如此，此三證分明，便成比丘，專行十二頭陀，一一堅固無起想證。",
        "translation": "When he explains these three realizations clearly, he then becomes a monk who focuses on 12 ascetic practices, each of which are firmly realized without producing perceptions.",
        "source": "T15n0623_001:0348b07_18"
    },
    {
        "source_sentence": "「『爾時迦葉即於樹下具五神通，末後見佛六通即備。",
        "translation": "'At the time, Kāśyapa had five supernormal powers under a tree, and when he saw the Buddha at the end of his life, he had the six powers.",
        "source": "T15n0623_001:0348b10_0"
    },
    {
        "source_sentence": "如是天子！",
        "translation": "So it is, my lord!",
        "source": "T15n0623_001:0348b11_1"
    },
    {
        "source_sentence": "末世比丘善思此法，莫自貢高求名毀眾以望供養，亦不可以苟有此法背眾不師於師。",
        "translation": "Monks of the latter age who well contemplate this teaching shouldn't become arrogant and seek fame or disparage the crowd to make offerings, nor should they deviate from the crowd and not teach it to their teacher if they have this teaching.",
        "source": "T15n0623_001:0348b11_2"
    },
    {
        "source_sentence": "此法謂都無比丘眾，可為師者慕行此法。",
        "translation": "This teaching means that there are no monks at all, and you can become a teacher who loves to practice this teaching.",
        "source": "T15n0623_001:0348b13_3"
    },
    {
        "source_sentence": "若有僧者當求僧為證，佛法眾此三寶等於如來，故多薩阿竭稱明律比丘僧眾以為上頭。",
        "translation": "If there are saṃgha, they must seek the saṃgha to realize it, and the Buddha's Dharma community of Buddhists and these three treasures are equal to those of the Tathāgata, so the monks and saṃgha groups of monks",
        "source": "T15n0623_001:0348b14_4"
    },
    {
        "source_sentence": "當知天子！",
        "translation": "You should know, celestial son!",
        "source": "T15n0623_001:0348b16_5"
    },
    {
        "source_sentence": "比丘僧中畢有三乘。』",
        "translation": "There are three vehicles in the saṃgha of monks and nuns.'",
        "source": "T15n0623_001:0348b16_6"
    },
    {
        "source_sentence": "說是語時，淨居天子及八部眾聞經歡喜，作禮而去。」",
        "translation": "When he spoke these words, the Pure Land gods and the eight groups of people who heard the sūtras rejoiced and paid homage and departed.",
        "source": "T15n0623_001:0348b17_7"
    },
    {
        "source_sentence": "佛說如來獨證自誓三昧經",
        "translation": "Foshuo rulai sanmei jing, a scripture of the Tathāgata's solitary realization of self- vow",
        "source": "T15n0623_001:0348b19_0"
    }
]