[
    {
        "source_sentence": "陰持入經卷下",
        "translation": "Second Fascicle of the Sutra on the Entry into the Constellations, Volume II",
        "source": "T15n0603_002:0176b05_0"
    },
    {
        "source_sentence": "後漢安息國三藏安世高譯",
        "translation": "Translated by An Shigao, the Tripiṭaka Master of Anxi in the Later Han Dynasty",
        "source": "T15n0603_002:0176b07_0"
    },
    {
        "source_sentence": "◎彼愛欲藥為何等？",
        "translation": "What's that craving medicine?",
        "source": "T15n0603_002:0176b08_0"
    },
    {
        "source_sentence": "為止。",
        "translation": "I'll stop.",
        "source": "T15n0603_002:0176b08_1"
    },
    {
        "source_sentence": "愛已解，意亦解，意已解，病便愈。",
        "translation": "Once his craving has been relieved, his thoughts have also been relieved, and once his thoughts have been relieved, the illness will be healed.",
        "source": "T15n0603_002:0176b08_2"
    },
    {
        "source_sentence": "彼癡藥為何等？",
        "translation": "What's that medicine of delusion?",
        "source": "T15n0603_002:0176b09_3"
    },
    {
        "source_sentence": "為觀。",
        "translation": "It's for contemplation.",
        "source": "T15n0603_002:0176b09_4"
    },
    {
        "source_sentence": "癡已却解，從慧解脫為病愈。",
        "translation": "After the delusion has been removed, he's liberated, and his illness is healed from the liberation of wisdom.",
        "source": "T15n0603_002:0176b09_5"
    },
    {
        "source_sentence": "如是佛說，如是二法，當知一為字，二為色。",
        "translation": "Thus, the Buddha teaches that thus are these two things, which should be known as words and form.",
        "source": "T15n0603_002:0176b10_6"
    },
    {
        "source_sentence": "二法當捨：一為癡，二為愛。",
        "translation": "Two things should be abandoned: one is delusion and two are cravings.",
        "source": "T15n0603_002:0176b11_7"
    },
    {
        "source_sentence": "二法當自知：一為慧，二為解脫。",
        "translation": "Two things should be known for themselves: one is wisdom, and two are liberation.",
        "source": "T15n0603_002:0176b13_0"
    },
    {
        "source_sentence": "二法可[衛-韋+正]：一為止，二為觀。",
        "translation": "Two things can [we-we+correct]: one is to stop and two are contemplations.",
        "source": "T15n0603_002:0176b13_1"
    },
    {
        "source_sentence": "彼止已行令識色，已識令愛得捨，愛已解意便得解脫，自證知。",
        "translation": "After stopping it, he practices so that form becomes consciousness, and after consciousnessing it, he causes craving to attain equanimity, and after being freed from craving, his mind is liberated, which he knows for himself.",
        "source": "T15n0603_002:0176b15_0"
    },
    {
        "source_sentence": "止已行滿足便得捨癡，已得捨癡便從慧得解脫，自證知。",
        "translation": "After stopping, he fulfills his practice and then attains freedom from delusion, and after attaining freedom from delusion, he attains liberation from wisdom and realizes it for himself.",
        "source": "T15n0603_002:0176b16_1"
    },
    {
        "source_sentence": "若比丘已二法自知字亦色，已二法捨癡亦愛，如是齊是便無所著，應行畢。",
        "translation": "If a monk knows for himself that the word 'already-existent' is also form, and abandons delusion after the two dharmas have been abandoned, then there's no attachment when they're thus combined, and he should finish his practice.",
        "source": "T15n0603_002:0176b17_2"
    },
    {
        "source_sentence": "欲度世，是為尚有餘無為未度，已無為竟，命已竟畢，便為苦盡，令後無苦。",
        "translation": "Desiring to save the world is because there are still remaining unconditioned things that have not yet been liberated. When the unconditioned [dharma] has ended, and when one’s life span has ended, then suffering will cease so that there will be no more suffering later.",
        "source": "T15n0603_002:0176b19_3"
    },
    {
        "source_sentence": "彼以有是陰，亦持亦入，已盡止寂然，從後無陰亦持亦入，無相連不復起，",
        "translation": "Because of the existence of this aggregate, they have both support and also sense-field. Having destroyed it, they are still and tranquil. From then on there is neither support nor sense-field for the aggregate; without characteristics, they do not arise again.",
        "source": "T15n0603_002:0176b21_4"
    },
    {
        "source_sentence": "是為無餘。",
        "translation": "This is without remainder.",
        "source": "T15n0603_002:0176b22_5"
    },
    {
        "source_sentence": "已得度世無為，畢是為二無為種。",
        "translation": "The two unconditioned seeds that have already been liberated from the world are, after all, the two unconditioned ones.",
        "source": "T15n0603_002:0176b23_6"
    },
    {
        "source_sentence": "彼不貪清淨本為何等？",
        "translation": "What's the pure root of their absence of craving?",
        "source": "T15n0603_002:0176b23_7"
    },
    {
        "source_sentence": "為三界中不得、不望、不求，是名為不貪清淨本。",
        "translation": "For the sake of attaining, not expecting, and not seeking in the three realms, this is called the pure root of not craving.",
        "source": "T15n0603_002:0176b24_8"
    },
    {
        "source_sentence": "是本為誰？",
        "translation": "Who is this originally?",
        "source": "T15n0603_002:0176b25_9"
    },
    {
        "source_sentence": "為不貪身清淨、言清淨；",
        "translation": "I elucidate the purity of body and speech by refraining from craving.",
        "source": "T15n0603_002:0176b25_10"
    },
    {
        "source_sentence": "亦餘相連清淨法意所念為本，是為不貪清淨本；",
        "translation": "The other mental states are the foundation of mindfulness directed toward pure dharmas. This is the foundation of purity free from covetousness.",
        "source": "T15n0603_002:0176b26_11"
    },
    {
        "source_sentence": "亦有清淨本，佛說為八種行，是清淨本。",
        "translation": "Also, there's the pure root, which the Buddha teaches that eight kinds of practice are the pure root.",
        "source": "T15n0603_002:0176b27_12"
    },
    {
        "source_sentence": "彼為三清淨道種，是為不貪本。",
        "translation": "These are the seeds of the three pure paths, which are the root of not craving.",
        "source": "T15n0603_002:0176b28_13"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T15n0603_002:0176b28_14"
    },
    {
        "source_sentence": "一為、直方便治。",
        "translation": "First, it's a straightforward and skillful remedy.",
        "source": "T15n0603_002:0176b29_15"
    },
    {
        "source_sentence": "二為、直念。",
        "translation": "Second, it's for the sake of straightforward mindfulness.",
        "source": "T15n0603_002:0176b29_16"
    },
    {
        "source_sentence": "三為、直定。",
        "translation": "The third is conditioned and direct concentration.",
        "source": "T15n0603_002:0176b29_17"
    },
    {
        "source_sentence": "是為三清淨道種本，是故名為不貪清淨本。",
        "translation": "These are the seeds of the three pure paths, which are therefore called the pure root of not craving.",
        "source": "T15n0603_002:0176b29_18"
    },
    {
        "source_sentence": "彼無恚不犯法本為何等？",
        "translation": "What's the original source of the teaching that they lack anger and don't violate?",
        "source": "T15n0603_002:0176c01_19"
    },
    {
        "source_sentence": "若忍所[衛-韋+正]，未來為不出恚忍因緣，為不恚不恚不受殃，無恚無瞋亦不瞋，",
        "translation": "Whatever is tolerated [we-we+correct], it's the cause and condition for not tolerating anger in the future that they won't become angry, don't become angry or experience misfortune, have no anger, no anger, and no anger.",
        "source": "T15n0603_002:0176c02_20"
    },
    {
        "source_sentence": "無怨亦不想怨，是為無恚不犯法本。",
        "translation": "Being without enemies and not wanting to be enemies is the Dharma root of being without anger and not violating the rules.",
        "source": "T15n0603_002:0176c04_21"
    },
    {
        "source_sentence": "是故名為無恚不犯法本。",
        "translation": "Therefore, it's called the absence of anger that doesn't violate the source of the Dharma.",
        "source": "T15n0603_002:0176c05_0"
    },
    {
        "source_sentence": "亦有三清淨道種：一、無恚不犯法本為正語，二為正業，三為正致利。",
        "translation": "There are also three kinds of pure paths: 1. the absence of anger and non-violation of the Dharma is originally right speech, 2. right action, and 3. right benefit.",
        "source": "T15n0603_002:0176c06_0"
    },
    {
        "source_sentence": "是為三清淨道種，是故名為無恚不犯法本。",
        "translation": "These are the seeds of the three pure paths, so they're called the source of the principle of no anger and non-violation.",
        "source": "T15n0603_002:0176c07_1"
    },
    {
        "source_sentence": "彼不惑清淨本為何等？",
        "translation": "What's the pure root of not being confused?",
        "source": "T15n0603_002:0176c09_0"
    },
    {
        "source_sentence": "為從慧見四諦如有，如有應受清淨，不愚不惑，不隨惑亦不墮惑。",
        "translation": "It's because of wisdom that the four truths are seen to be present, and if they are present, they should be experienced as pure, not foolish or confused, not following or falling into confusion.",
        "source": "T15n0603_002:0176c09_1"
    },
    {
        "source_sentence": "慧明明相見，從清淨法，是為不惑清淨本。",
        "translation": "Wisdom clearly sees each other and follows the pure dharmas, which are the pure root of not being confused.",
        "source": "T15n0603_002:0176c11_0"
    },
    {
        "source_sentence": "是本為誰？",
        "translation": "Who is this originally?",
        "source": "T15n0603_002:0176c12_0"
    },
    {
        "source_sentence": "為不惑清淨，所身[衛-韋+正]、所言[衛-韋+正]、所心[衛-韋+正]，",
        "translation": "In order to keep the mind free of delusion and purity, his body is [steadfast], his speech [steadfast], and his thought [steadfast]",
        "source": "T15n0603_002:0176c12_1"
    },
    {
        "source_sentence": "亦所相連清淨法，為意思惟相念所法本。",
        "translation": "It's also the pure dharma that's linked to each other, which is the Dharma root of mindfulness of mindfulness and mindfulness of characteristics.",
        "source": "T15n0603_002:0176c13_2"
    },
    {
        "source_sentence": "亦為從二清淨道種，為不惑本：一為直見，二為直[衛-韋+正]。",
        "translation": "They also want to follow the seeds of the two pure paths and not confuse the root: first, straight view, and second, straight [we-we+correct].",
        "source": "T15n0603_002:0176c14_3"
    },
    {
        "source_sentence": "是為從二清淨道種本。",
        "translation": "This is the root of the seeds of the two pure paths.",
        "source": "T15n0603_002:0176c15_4"
    },
    {
        "source_sentence": "是故名為不惑清淨本，是為三清淨、為八種道，已份在所隨應非常，為如是。",
        "translation": "Therefore, it's called the pure root of not being confused. These are the three pure and eight kinds of paths that have been divided into what follows and should be unchanging, which is thus like this.",
        "source": "T15n0603_002:0176c15_5"
    },
    {
        "source_sentence": "彼非常想為何等？",
        "translation": "What's that perception of impermanence?",
        "source": "T15n0603_002:0176c18_0"
    },
    {
        "source_sentence": "一切所[衛-韋+正]是非常想，所想計知是為受，是為非常想。",
        "translation": "All [we-we+correct] things are extraordinary thoughts, and what's perceived is known as sensation, which is an extraordinary thought.",
        "source": "T15n0603_002:0176c18_1"
    },
    {
        "source_sentence": "亦從有世間八法。",
        "translation": "It's also because there are eight worldly dharmas.",
        "source": "T15n0603_002:0176c19_2"
    },
    {
        "source_sentence": "何等為八？",
        "translation": "What are the eight?",
        "source": "T15n0603_002:0176c20_3"
    },
    {
        "source_sentence": "有利無利、名聞不名聞、有論議無論議、若苦若樂。",
        "translation": "What's beneficial and unbeneficial, what's well-known and not well-known, what's discussed without discussion, and what's painful and pleasant.",
        "source": "T15n0603_002:0176c20_4"
    },
    {
        "source_sentence": "為意不墮不受，從若干思不受，止護觀，思惡得止，是名為非常想。",
        "translation": "Because the mind doesn't fall into sensation, it's not received from certain thoughts, stops guarding and contemplating, and stops thinking badly, which is called perception of impermanence.",
        "source": "T15n0603_002:0176c21_5"
    },
    {
        "source_sentence": "彼苦想為何等？",
        "translation": "What's that conception of suffering?",
        "source": "T15n0603_002:0176c23_6"
    },
    {
        "source_sentence": "為一切世間行，是為苦所想覺知受，是名為苦想。",
        "translation": "For the sake of all worldly actions, these are perception and feelings that are painful, which are called perceptions of suffering.",
        "source": "T15n0603_002:0176c23_7"
    },
    {
        "source_sentence": "從是要為何等？",
        "translation": "What's the reason for this?",
        "source": "T15n0603_002:0176c24_8"
    },
    {
        "source_sentence": "望苦想為已習、已增，所念已多，為貪已足，為不墮貪，為意不受不墮，",
        "translation": "They look to the perception of suffering as having already been cultivated or increased, and they think about it often. Are they satisfied with craving, are they not attached to craving, and are they not attached to it?",
        "source": "T15n0603_002:0176c24_9"
    },
    {
        "source_sentence": "相牽不墮、不念。",
        "translation": "They are pulled by each other and don't fall or think about it.",
        "source": "T15n0603_002:0176c26_10"
    },
    {
        "source_sentence": "若干意護觀為已，惡為得止，從是思望致是要。",
        "translation": "Certain people think that guarding and observing is the cessation of evil, and badness is the cessation of evil, and from this contemplation it's hoped to become good.",
        "source": "T15n0603_002:0176c26_11"
    },
    {
        "source_sentence": "彼非身想為何等？",
        "translation": "What's that perception of what's not a body?",
        "source": "T15n0603_002:0177a02_0"
    },
    {
        "source_sentence": "為一切法不計身不墮身，為想知想受，是名為非身想。",
        "translation": "For the sake of all dharmas that don't discriminate body and don't fall into body, and for the sake of perception, knowledge, perception, and sensation, this is called what's not body perception.",
        "source": "T15n0603_002:0177a02_1"
    },
    {
        "source_sentence": "從是為何等？",
        "translation": "What is the reason for this?",
        "source": "T15n0603_002:0177a03_2"
    },
    {
        "source_sentence": "望致非身想已，為念思，為已增，令是是自計我，為是為意不受捨若干態，",
        "translation": "In order to produce the thought that is not a bodily ideation, it is thought and thought-concomitance. It is also an increase (samskara), so that it belongs to oneself or to others.",
        "source": "T15n0603_002:0177a04_3"
    },
    {
        "source_sentence": "不受跓為觀，[病-丙+歲]惡得止，是為從是要致。",
        "translation": "Not being subject to anger is the observation, and [sickness - c + years] badly attaining cessation is the cause that follows it.",
        "source": "T15n0603_002:0177a05_4"
    },
    {
        "source_sentence": "彼惡不淨想為何等？",
        "translation": "What's that bad and impure conception?",
        "source": "T15n0603_002:0177a07_5"
    },
    {
        "source_sentence": "為一切世間[衛-韋+正]為不淨，所想自知受，是名為不淨想。",
        "translation": "For the sake of all worldly [we-we+correct] things that are impure and self-knowing feelings that are perceived, this is called an impure perception.",
        "source": "T15n0603_002:0177a07_6"
    },
    {
        "source_sentence": "從是想為何等？",
        "translation": "What's the perception that comes from this?",
        "source": "T15n0603_002:0177a09_0"
    },
    {
        "source_sentence": "望致不淨想已，為念為思為已增，令世間五樂意却捨意，不牽不受不復墮，",
        "translation": "“Furthermore, the enlightening beings develop thoughts of attachment to impurity and give rise to perceptions of purity: thinking, reflecting, contemplating, and increasing. They cause the five kinds of happiness in the world to be turned away from thought, without clinging or falling back into it.",
        "source": "T15n0603_002:0177a09_1"
    },
    {
        "source_sentence": "若干念以得護，為[病-丙+歲]惡得跓，是為從是要致。",
        "translation": "With certain thoughts of attaining protection, they become [sick - c + years old] and badly attain sexual misconduct, which is the cause that's sought to be brought about.",
        "source": "T15n0603_002:0177a11_2"
    },
    {
        "source_sentence": "彼為四思想念行，何以故？",
        "translation": "What are the four kinds of thought and thought-conduct?",
        "source": "T15n0603_002:0177a12_3"
    },
    {
        "source_sentence": "令知五陰，故佛說是分別，見彼不淨想[衛-韋+正]，為令色陰從是解，",
        "translation": "To let them know the five aggregates, therefore the Buddha teaches that they are discrimination. Seeing these impure conceptual thought [we-we+correct] in order to make the aggregate matter understand from this:",
        "source": "T15n0603_002:0177a12_4"
    },
    {
        "source_sentence": "彼苦想[衛-韋+正]，令痛陰從是解，彼非身想[衛-韋+正]，令思想陰亦[衛-韋+正]陰從是解。",
        "translation": "That conception of suffering [we-we+correct] causes the aggregate of pain to be liberated from it, and that conception of body [we-we+correct] doesn't cause the aggregate of thought to be liberated from it.",
        "source": "T15n0603_002:0177a14_5"
    },
    {
        "source_sentence": "彼非常想[衛-韋+正]，令識陰從是解。",
        "translation": "That perception of impermanence [we-we+correct] causes the aggregate of consciousness to be understood from this.",
        "source": "T15n0603_002:0177a16_0"
    },
    {
        "source_sentence": "彼從止[衛-韋+正]，令愛從是解。",
        "translation": "From stopping [we-we+correct], they cause craving to follow this understanding.",
        "source": "T15n0603_002:0177a17_0"
    },
    {
        "source_sentence": "彼從觀[衛-韋+正]，令癡從是解。",
        "translation": "From observing [we-we+correct], they cause delusion to understand it from this.",
        "source": "T15n0603_002:0177a17_1"
    },
    {
        "source_sentence": "彼從不貪，為捨貪。",
        "translation": "It's because they abandon craving instead of not craving.",
        "source": "T15n0603_002:0177a18_2"
    },
    {
        "source_sentence": "彼從不恚為捨恚。",
        "translation": "They abandon anger from the absence of anger as equanimity.",
        "source": "T15n0603_002:0177a19_0"
    },
    {
        "source_sentence": "彼從不惑為捨癡。",
        "translation": "From the absence of affliction, they abandon delusion.",
        "source": "T15n0603_002:0177a20_0"
    },
    {
        "source_sentence": "彼從非常想，令解有常。",
        "translation": "It's from the perception of impermanence that they cause understanding to be permanent.",
        "source": "T15n0603_002:0177a21_0"
    },
    {
        "source_sentence": "彼從苦想，為解樂想。",
        "translation": "From the perception of suffering, they're liberated from the perception of pleasure.",
        "source": "T15n0603_002:0177a22_0"
    },
    {
        "source_sentence": "彼從非身想，為解身想。",
        "translation": "It's because they don't perceive the body from what's not perceived as body that they understand the perception of body.",
        "source": "T15n0603_002:0177a23_0"
    },
    {
        "source_sentence": "彼從不淨想，為解淨想。",
        "translation": "It's from the perception of impurity that they understand the perception of purity.",
        "source": "T15n0603_002:0177a24_0"
    },
    {
        "source_sentence": "彼從止攝意能得還，是為止想，令從是止禪。",
        "translation": "They are able to return from stopping and collecting their minds, which is the idea of stopping and causing them to stop meditation from this.",
        "source": "T15n0603_002:0177a25_1"
    },
    {
        "source_sentence": "彼從一切法寂然，能得解受，是為觀想，令止跓一切知。",
        "translation": "Because all things are quiescent, they can attain understanding and sensation. This is contemplation that calms the thoughts and makes them know everything.",
        "source": "T15n0603_002:0177a27_0"
    },
    {
        "source_sentence": "從欲能得還想，是為不貪相，令還不與取止。",
        "translation": "Being able to attain it back from desire is the characteristic of not craving and causing it to return without stopping grasping.",
        "source": "T15n0603_002:0177a29_0"
    },
    {
        "source_sentence": "已後不復生癡，是為無有恚想，令從殺還得止。",
        "translation": "After that, they won't again become deluded, which is the absence of anger and thoughts that cause them to return from killing and attain stopping.",
        "source": "T15n0603_002:0177b02_0"
    },
    {
        "source_sentence": "識事亦物是為不惑相，為令得止，止所世間、所[衛-韋+正]為、所法能受相，",
        "translation": "Consciousness and things are the characteristic of not being disturbed, in order to cause them to be appeased. The world where they are appeased, that which is [we-we+correctly] done, and that which can be apprehended by dharmas.",
        "source": "T15n0603_002:0177b03_1"
    },
    {
        "source_sentence": "是為非常想。",
        "translation": "This is an extraordinary conception.",
        "source": "T15n0603_002:0177b04_2"
    },
    {
        "source_sentence": "令知從生，亦知從滅，識為是處。",
        "translation": "This is the consciousness that causes one to know from what arises and also knows from what perishes.",
        "source": "T15n0603_002:0177b04_3"
    },
    {
        "source_sentence": "為世間[衛-韋+正]，作世間更，所所識想是為苦，為所思想，是為痛種處。",
        "translation": "For the sake of worldly [we-we+correct] and worldly rebirth, what's perceived is painful, and what's thought is the seed place of pain.",
        "source": "T15n0603_002:0177b05_4"
    },
    {
        "source_sentence": "一切所法不住想，是為非身想，是為思想。",
        "translation": "All dharmas that don't abide in perception are not perceptions of body, which is thought.",
        "source": "T15n0603_002:0177b07_5"
    },
    {
        "source_sentence": "是已見身屍已壞，青膖為受是相，是為不淨思想。",
        "translation": "Having seen that his body and corpse have disintegrated, he's feeling this characteristic as a blue patch, which is an impure thought.",
        "source": "T15n0603_002:0177b08_6"
    },
    {
        "source_sentence": "從是為悔却，令寂然止。",
        "translation": "From this, he repents and causes them to quietly stop.",
        "source": "T15n0603_002:0177b09_7"
    },
    {
        "source_sentence": "是為九品處，已分別說。",
        "translation": "These are the nine classes of spheres, as has been said elaborately.",
        "source": "T15n0603_002:0177b09_8"
    },
    {
        "source_sentence": "見為一切無為部，說具足是為誰？",
        "translation": "Who is the view that all things are nonexistent, and who says they are complete?",
        "source": "T15n0603_002:0177b10_9"
    },
    {
        "source_sentence": "知多聞、少聞不為慧者。",
        "translation": "He knows that much learning and little learning aren't wisdom.",
        "source": "T15n0603_002:0177b11_10"
    },
    {
        "source_sentence": "不慧不為常意在經，為意相連生。",
        "translation": "What's not wisdom and what's not eternal is the mind in the sūtras, and it's the mind that's produced together with each other.",
        "source": "T15n0603_002:0177b11_11"
    },
    {
        "source_sentence": "為從不分別觀；",
        "translation": "In order to follow nondiscriminating contemplation.",
        "source": "T15n0603_002:0177b12_12"
    },
    {
        "source_sentence": "令不得非常想，不受非常想；",
        "translation": "They cause no ideation of impermanence and no ideation of impermanence to be apprehended.",
        "source": "T15n0603_002:0177b12_13"
    },
    {
        "source_sentence": "令從是墮五樂；",
        "translation": "I cause them to fall into the five kinds of bliss.",
        "source": "T15n0603_002:0177b13_14"
    },
    {
        "source_sentence": "令五樂覆蓋，從所應[衛-韋+正]失；",
        "translation": "They cause the five kinds of bliss to overwhelm them, which is to be lost according to what should be done.",
        "source": "T15n0603_002:0177b13_15"
    },
    {
        "source_sentence": "令不解苦想；",
        "translation": "They cause them not to understand conceptions of suffering.",
        "source": "T15n0603_002:0177b14_16"
    },
    {
        "source_sentence": "令墮五陰受入；",
        "translation": "They cause them to fall into the five aggregates and receive and enter.",
        "source": "T15n0603_002:0177b14_17"
    },
    {
        "source_sentence": "令為意計是身。",
        "translation": "It causes them to think that it's the body.",
        "source": "T15n0603_002:0177b15_18"
    },
    {
        "source_sentence": "若干本非一本，不捨不觀，令不墮非身想，為意在顏色。",
        "translation": "Some of them are originally not one book, which they don't abandon or contemplate, so that they don't fall into the perception of what's not a body and focus their attention on form.",
        "source": "T15n0603_002:0177b15_19"
    },
    {
        "source_sentence": "樂計是身為淨，不計是皮肌覆，令不墮不淨想，不住受、止。",
        "translation": "It's pleasant to think that this body is pure, but it doesn't think that it's covered by skin and flesh, so they don't fall into the perception of impurity and don't abide in sensation or cessation.",
        "source": "T15n0603_002:0177b16_20"
    },
    {
        "source_sentence": "是想不信令無有想，不受喜。",
        "translation": "This conception doesn't believe so that there are no conceptions and doesn't experience joy.",
        "source": "T15n0603_002:0177b18_21"
    },
    {
        "source_sentence": "為從是四種已除，墮得無為種處。",
        "translation": "After these four kinds have been removed, they'll fall into the unconditioned seed-field.",
        "source": "T15n0603_002:0177b18_22"
    },
    {
        "source_sentence": "佛說信根，比丘欲見知，當求在四溝港種為清淨法，不捨方便相，令致清淨，",
        "translation": "When the Buddha teaches about the faculty of faith, monks who want to see and know should cultivate it in four ditches as a pure dharma that doesn’t abandon the characteristics of skillful means and leads to purity.",
        "source": "T15n0603_002:0177b19_23"
    },
    {
        "source_sentence": "從清淨發起令墮四意止。",
        "translation": "It arises from purity and causes them to fall into the four mental states of cessation.",
        "source": "T15n0603_002:0177b21_24"
    },
    {
        "source_sentence": "佛說精進根，比丘欲見知，當在四意斷。",
        "translation": "The Buddha teaches that the faculty of effort, which a monk desires to see and know, should be stopped in four mental states.",
        "source": "T15n0603_002:0177b22_0"
    },
    {
        "source_sentence": "過去所更，相念不忘，為從不忘發生墮四意止。",
        "translation": "They don't forget what they did in the past, and because they don't forget it, they fall into the four mental states of cessation from not forgetting it.",
        "source": "T15n0603_002:0177b22_1"
    },
    {
        "source_sentence": "佛說念根，比丘欲見知，當觀在四意止。",
        "translation": "The Buddha teaches that the faculty of mindfulness, which a monk wants to see and know, should be observed in four mental states.",
        "source": "T15n0603_002:0177b24_0"
    },
    {
        "source_sentence": "為一意想，是為定從不惑起，令墮四禪處。",
        "translation": "For the sake of one mental thought, this is a concentration that arises from not being confused and causes you to fall into the fourth dhyāna.",
        "source": "T15n0603_002:0177b24_1"
    },
    {
        "source_sentence": "佛說是比丘欲知定根，當知在四禪，從本校計為慧，如有能得持，從是發起令墮四諦。",
        "translation": "The Buddha says that this monk wants to know the faculty of concentration, so he should know that it's in the fourth dhyāna, which is considered wisdom according to the teachings of the school if he can attain and uphold it, and then he arouses it from that and causes it to fall into the four noble truths.",
        "source": "T15n0603_002:0177b26_0"
    },
    {
        "source_sentence": "佛說慧根，比丘欲見，當在四諦。",
        "translation": "The Buddha teaches that the faculty of wisdom, which a monk desires to see, should be found in the four noble truths.",
        "source": "T15n0603_002:0177b28_0"
    },
    {
        "source_sentence": "為有四輪：好郡縣居輪、依慧人輪、自本正願輪、宿命有福輪。",
        "translation": "Why are there four wheels: the wheel of good prefectures and districts, the wheel of people who rely on wisdom, the wheel of their original right vow, and the wheel of blessedness with past lives?",
        "source": "T15n0603_002:0177b28_1"
    },
    {
        "source_sentence": "彼為道德共居相，是為好郡縣居，令得賢者依止處，以得道德依猗相，",
        "translation": "They are the characteristics of morality and common dwelling. These are the characteristics of a good prefecture, a prefecture that enables to attain the home where the wise one resides.",
        "source": "T15n0603_002:0177c01_2"
    },
    {
        "source_sentence": "是為依慧人。",
        "translation": "This is the person who relies on wisdom.",
        "source": "T15n0603_002:0177c02_3"
    },
    {
        "source_sentence": "從是為墮有正願處，以得正願相，是為身正願，令墮福處。",
        "translation": "From this, they'll fall into the place of right vow and attain the characteristics of right vow. This is the right bodily vow that causes them to fall into the place of merit.",
        "source": "T15n0603_002:0177c03_0"
    },
    {
        "source_sentence": "從清淨行有所入相，是名為福，令致墮五樂處。",
        "translation": "When there's an entry from pure practice, this is called merit that causes them to fall into the five pleasant places.",
        "source": "T15n0603_002:0177c04_1"
    },
    {
        "source_sentence": "彼為戒法十一本：一為色持戒無悔，二為已不悔令得喜意，三為已有喜令愛生，",
        "translation": "They are the elevenfold doctrines of morality: first, to keep the precepts without regret for the sake of material form; second, not regretting one’s past actions so as to attain joyful intentions; third, having already experienced joy so as to engender thirstlike craving.",
        "source": "T15n0603_002:0177c06_0"
    },
    {
        "source_sentence": "四為已意得愛為身得猗，五為已身得猗便得樂，六為已意得樂便得正止，",
        "translation": "The fourth is the acquisition of desire after thought, which is bodily peace; the fifth is the acquisition of bliss after bodily peace; and the sixth is the acquisition of tranquility after thought.",
        "source": "T15n0603_002:0177c07_1"
    },
    {
        "source_sentence": "七為已意得正止便知如有，八為已知如有便寂然，九為已寂然便得離，",
        "translation": "The seventh is to know the existence of suchness when one has attained mental concentration; the eighth is to be stilled when one has known it; and the ninth is to be dispassionate when one has been stilled.",
        "source": "T15n0603_002:0177c09_2"
    },
    {
        "source_sentence": "十為已得離便得解脫，十一為已得解脫便見慧。",
        "translation": "Ten, it's because they've attained freedom and then attain liberation, and 11 because they've attained liberation and then seen wisdom.",
        "source": "T15n0603_002:0177c11_3"
    },
    {
        "source_sentence": "有慧便知生死已盡，道[衛-韋+正]已畢，所作[衛-韋+正]已竟，",
        "translation": "Those who are wise know that birth and death have ended, the path [for enlightenment] has been completed, what was to be done [for enlightenment] has been done.",
        "source": "T15n0603_002:0177c12_4"
    },
    {
        "source_sentence": "不復還受苦。",
        "translation": "They won't again experience suffering.",
        "source": "T15n0603_002:0177c13_5"
    },
    {
        "source_sentence": "戒相為何等？",
        "translation": "What are the characteristics of morality?",
        "source": "T15n0603_002:0177c14_0"
    },
    {
        "source_sentence": "至命盡持戒，令從是致無悔。",
        "translation": "When he reaches the end of his life, he observes precepts so that there's no regret from this.",
        "source": "T15n0603_002:0177c14_1"
    },
    {
        "source_sentence": "身不增罪相為無悔，從是致喜令得喜處。",
        "translation": "When the body doesn't increase the mark of sin, there's no repentance, and it causes joy from this to attain the joyful state.",
        "source": "T15n0603_002:0177c15_0"
    },
    {
        "source_sentence": "可意相為喜，令致愛處。",
        "translation": "The characteristic of agreeable is satisfaction, causing it to be the locus of craving.",
        "source": "T15n0603_002:0177c15_1"
    },
    {
        "source_sentence": "喜足相為處，令致有猗處。",
        "translation": "The characteristic of satisfaction is the āyatana:",
        "source": "T15n0603_002:0177c16_2"
    },
    {
        "source_sentence": "從[衛-韋+正]為是為得猗相，令致樂處。",
        "translation": "From [we-we+correct], this is the place where he attains peacefulness and causes happiness.",
        "source": "T15n0603_002:0178a01_3"
    },
    {
        "source_sentence": "已無[病-丙+(止\\/(止*止))]為樂相，令從是致定處。",
        "translation": "The absence of [sickness - c + (cessation \\/ (cessation * cessation)] is the characteristic of bliss, which causes it to be the place where concentration arises from this.",
        "source": "T15n0603_002:0178a01_4"
    },
    {
        "source_sentence": "意隨使不忘為定相，令致如有慧處不惑；",
        "translation": "The secondary mental states are the characteristics of absorption, causing one not to forget them. This enables one to attain the state of wisdom without confusion.",
        "source": "T15n0603_002:0178a02_5"
    },
    {
        "source_sentence": "如有相隨相，是為寂然處。",
        "translation": "If there are marks and secondary marks, this is the place of quiescence.",
        "source": "T15n0603_002:0178a03_6"
    },
    {
        "source_sentence": "若知非身是為寂然相，令從是致相別離處。",
        "translation": "If someone knows that what's not body is the characteristic of quiescence, they cause the characteristic to be separated from this as a result.",
        "source": "T15n0603_002:0178a04_7"
    },
    {
        "source_sentence": "不近會為相別離，為從是致解脫。",
        "translation": "Not being near the assembly is to be separated from characteristics, and liberation is to be attained from this.",
        "source": "T15n0603_002:0178a05_8"
    },
    {
        "source_sentence": "已為非法[衛-韋+正]不受殃，是為解脫相，令致解脫慧見。",
        "translation": "Having undergone unlawful [we-we+correct] suffering, this is the characteristic of liberation that causes him to give rise to the wisdom view of liberation.",
        "source": "T15n0603_002:0178a05_9"
    },
    {
        "source_sentence": "為有四道德地，何等為四？",
        "translation": "What are the four stages of morality?",
        "source": "T15n0603_002:0178a07_0"
    },
    {
        "source_sentence": "為四行者福。",
        "translation": "For the sake of the four practices, it's a blessing.",
        "source": "T15n0603_002:0178a07_1"
    },
    {
        "source_sentence": "彼若如有知智，是為見地；",
        "translation": "If they have knowledge, this is the stage of vision.",
        "source": "T15n0603_002:0178a07_2"
    },
    {
        "source_sentence": "為得道迹，是為得道福；",
        "translation": "To attain the traces of the path is to attain the virtue of the path.",
        "source": "T15n0603_002:0178a08_3"
    },
    {
        "source_sentence": "彼如有如有知是為惡却離，是名為薄地，為有往來福；",
        "translation": "This is said to be a thin soil because there is merit of past and future [existence].",
        "source": "T15n0603_002:0178a09_4"
    },
    {
        "source_sentence": "彼以惡却為不用，是名為相離地；",
        "translation": "This is the stage of separation from characteristics.",
        "source": "T15n0603_002:0178a10_5"
    },
    {
        "source_sentence": "彼已相離，是為不復還福，是名為欲竟地，無所著。",
        "translation": "Having parted with each other, this is the merit of not returning again. This is called the stage where one reaches the end of desire and has no attachment.",
        "source": "T15n0603_002:0178a11_6"
    },
    {
        "source_sentence": "亦[衛-韋+正]者福是何義？",
        "translation": "What's the meaning of [we-we+correct] also [we-we+correct]?",
        "source": "T15n0603_002:0178a12_7"
    },
    {
        "source_sentence": "為道弟子有八種道[衛-韋+正]，是名為[衛-韋+正]者。",
        "translation": "For the disciples of the Way, there are eight kinds of path [we-we+correct], which are called [we-we+correct].",
        "source": "T15n0603_002:0178a12_8"
    },
    {
        "source_sentence": "為是是福，是故名為[衛-韋+正]者福。",
        "translation": "Because these are merits, they're therefore called [we-we+correct] those who are blessed.",
        "source": "T15n0603_002:0178a13_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0603_002:0178a14_10"
    },
    {
        "source_sentence": "為[衛-韋+正]清淨為名，是為清淨福，是為道德。",
        "translation": "Because [we-we+correct] purity is the name, this is pure merit, and this is morality.",
        "source": "T15n0603_002:0178a14_11"
    },
    {
        "source_sentence": "有八種清淨道[衛-韋+正]，為是是福，是故名為清淨福。",
        "translation": "Because there are eight kinds of pure paths [we-we+correct] that are merit, they're called pure merit.",
        "source": "T15n0603_002:0178a15_12"
    },
    {
        "source_sentence": "彼為應得道迹，云何已諦相應道，弟子便斷三縛結？",
        "translation": "What's the path that's associated with the truths, and how did the disciple then end the three bonds of bondage?",
        "source": "T15n0603_002:0178a16_13"
    },
    {
        "source_sentence": "彼為三縛結為何等？",
        "translation": "What are the three fetters?",
        "source": "T15n0603_002:0178a17_14"
    },
    {
        "source_sentence": "一為知身非身，二為無疑，三為不貿易[衛-韋+正]戒。",
        "translation": "One is to know that body is not body, two are free from doubt, and three are the precept against not tradering [we-we+correct].",
        "source": "T15n0603_002:0178a18_15"
    },
    {
        "source_sentence": "已斷是三縛結，道弟子便墮道迹，不復墮惡道、畢竟道七更天上，亦人間已更，",
        "translation": "Having cut off these three fetters, the disciples of the Way will then fall into the path and no longer fall into the evil path. At the end of the [right] path they’ll be reborn seven nights in heaven or so, having already been reborn among humans.",
        "source": "T15n0603_002:0178a19_16"
    },
    {
        "source_sentence": "所在往來便斷苦，從苦得解，是名為見地，為得道迹福。",
        "translation": "Wherever he goes and comes, he then stops suffering and attains understanding from suffering, which is called the stage of seeing in order to attain the merit of the path.",
        "source": "T15n0603_002:0178a20_17"
    },
    {
        "source_sentence": "彼何等為令意墮是身，亦知是身？",
        "translation": "What's the reason they cause their mind to fall into this body and also know that it's a body?",
        "source": "T15n0603_002:0178a22_18"
    },
    {
        "source_sentence": "癡為以不聞，為世間人不見覺者，亦不從聞者、受教戒聞者，亦為未分別。",
        "translation": "It's because they don't hear it, for the sake of worldly people who don't see awakening and don't hear it from someone who hears it or those who receive the precepts and receive the instruction that they haven't discriminated.",
        "source": "T15n0603_002:0178a22_19"
    },
    {
        "source_sentence": "現正法為意念，是色為身。",
        "translation": "The present true-dharma is thought, and form is body.",
        "source": "T15n0603_002:0178a24_20"
    },
    {
        "source_sentence": "遍覩色為身，是色亦為身，色亦是我身，痛想[衛-韋+正]識，亦如上說。",
        "translation": "Pervasive form is the body, and this form is also the body; form is also the body of me. The painful conceptual thought [we-we+correct] consciousness is as has been said above.",
        "source": "T15n0603_002:0178a25_21"
    },
    {
        "source_sentence": "已如是得觀，便受五樂，令為受是身，為墮身，令意念我為是，我為以是著，",
        "translation": "Having thus attained contemplation, he then experiences five kinds of happiness, causing himself to experience this body for the sake of this body or another body that falls into it, and causes his mind to think, “This is me! This is self!",
        "source": "T15n0603_002:0178a26_22"
    },
    {
        "source_sentence": "相連不得自在，牽相隨如是有所忍，所可為意為可受，已受見隨[衛-韋+正]，",
        "translation": "The characteristics are not self-contained, and they lead each other in this kind of tolerance. What can be done is what can be done with the mind, and seeing that which has already been experienced follows [we-we+correct].",
        "source": "T15n0603_002:0178a28_23"
    },
    {
        "source_sentence": "是為邪見，墮受是身。",
        "translation": "This is a wrong view, which says that falling into sensation is the body.",
        "source": "T15n0603_002:0178b01_0"
    },
    {
        "source_sentence": "彼為見是五邪，令墮疑無有。",
        "translation": "Because they see these five errors, they cause them to fall into doubt and have no existence.",
        "source": "T15n0603_002:0178b01_1"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T15n0603_002:0178b02_2"
    },
    {
        "source_sentence": "若為所色為見，是身比前，更、想、行、識亦爾，是為五邪見，令墮無有。",
        "translation": "If form is seen as form, it's compared to the prior body, and so are further, perception, volition, and consciousness. These are the five mistaken views that cause them to fall into nonexistence.",
        "source": "T15n0603_002:0178b02_3"
    },
    {
        "source_sentence": "後有餘十五，令墮常。",
        "translation": "The remaining fifteen causes them to fall into permanence.",
        "source": "T15n0603_002:0178b03_4"
    },
    {
        "source_sentence": "如是見是身已斷，便六十二邪見已捨；",
        "translation": "In this way, having abandoned the view that these are bodies, they abandon the sixty-two false views.",
        "source": "T15n0603_002:0178b04_5"
    },
    {
        "source_sentence": "令不墮常、非常。",
        "translation": "It causes them not to fall into permanence and impermanence.",
        "source": "T15n0603_002:0178b05_6"
    },
    {
        "source_sentence": "已非常、常為捨，便道弟子無倒邪見，但為度世。",
        "translation": "Having abandoned impermanence and permanence for equanimity, he then said to his disciples that they had no mistaken wrong view but wanted to save the world.",
        "source": "T15n0603_002:0178b05_7"
    },
    {
        "source_sentence": "直見為何等，令不墮邪見身？",
        "translation": "What's the right view that prevents you from falling into the body of wrong views?",
        "source": "T15n0603_002:0178b06_8"
    },
    {
        "source_sentence": "若道弟子為聞，為直見，見通經家，為已受度世無為；",
        "translation": "Suppose a disciple of the doctrine sees and penetrates the house of scripture for the sake of hearing, for the sake of seeing directly, or for the sake of liberation from worldly unconditionedness.",
        "source": "T15n0603_002:0178b07_9"
    },
    {
        "source_sentence": "為已解度世法，不復見是色為身，遍睹色為身。",
        "translation": "Because they have already liberated themselves from worldly dharmas, they no longer see form as body and pervade it as body.",
        "source": "T15n0603_002:0178b08_10"
    },
    {
        "source_sentence": "是色亦為身色，色亦是我身，痛想行識已不見，如是便解三結使。",
        "translation": "These forms are also bodily forms, and forms are also my body; pain, perception, volition, and consciousness haven't seen them, so they then understand the three bonds.",
        "source": "T15n0603_002:0178b09_11"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T15n0603_002:0178b11_12"
    },
    {
        "source_sentence": "一為不見是身，二為不恚，三為不疑。",
        "translation": "One, because they don't see this body, two, because they aren't angry, and three, because they don't doubt it.",
        "source": "T15n0603_002:0178b11_13"
    },
    {
        "source_sentence": "已如是，道弟子為無疑，在佛亦無疑，為信為喜為佛，如是如來、無所著、正覺，",
        "translation": "Having done so, the disciple of the [Buddhist] Way has no doubt. He is also without doubt in the presence of buddhas. For his sake he believes and for his sake he delights in becoming a buddha. Such is the Tathāgata, Arhat, Perfectly Enlightened One.",
        "source": "T15n0603_002:0178b12_14"
    },
    {
        "source_sentence": "慧行已足為樂，為世間已解，無有過，是法馭法隨為師，為教天上天下，",
        "translation": "The practice of wisdom is sufficient for bliss, and there is no mistake in understanding the world. This Dharma charioteer follows the Dharma as his teacher, teaching it to all beings in heaven and earth.",
        "source": "T15n0603_002:0178b13_15"
    },
    {
        "source_sentence": "為佛最上。",
        "translation": "It's the supreme of buddhas.",
        "source": "T15n0603_002:0178b15_16"
    },
    {
        "source_sentence": "是得信不疑，為隨是法[衛-韋+正]，為在法無結無疑、為信為喜。",
        "translation": "It's because they attain faith and don't doubt, follow the teaching [we-we+correct] accordingly, have no fetters or doubt in the teaching, and are faithful and joyous.",
        "source": "T15n0603_002:0178b15_17"
    },
    {
        "source_sentence": "佛說是法，現可學可致，現自更見，已解為慧。",
        "translation": "The Buddha teaches that this is a teaching that can be studied in the present and obtained in the future. Having seen it for himself in the present, he understands it as wisdom.",
        "source": "T15n0603_002:0178b17_0"
    },
    {
        "source_sentence": "為是所貪飢渴相近已斷，隨已斷，空無所應得。",
        "translation": "It's because the craving and thirst that are close to it has been stopped, and after they're stopped, emptiness has nothing to attain.",
        "source": "T15n0603_002:0178b18_0"
    },
    {
        "source_sentence": "愛已壞、已離已盡，為無為。",
        "translation": "When desire has been destroyed and separation has been ended, it's nothing.",
        "source": "T15n0603_002:0178b19_1"
    },
    {
        "source_sentence": "以是第二。",
        "translation": "It's because this is the second.",
        "source": "T15n0603_002:0178b19_2"
    },
    {
        "source_sentence": "無結、無疑，得法隨法[衛-韋+正]，為同學聚、為無結無疑，已有受有喜。",
        "translation": "Without fetters or doubt, he attains the Dharma and follows the Dharma [we-we+correct] as a group of students who have already experienced joy because they are without fetters or doubt.",
        "source": "T15n0603_002:0178b20_0"
    },
    {
        "source_sentence": "如是受得道弟子，為學聚，正受[衛-韋+正]為如應受。",
        "translation": "Thus, a disciple who has attained the path receives it as a group of trainees, and he correctly receives [we-we+correctly] as one who should receive it.",
        "source": "T15n0603_002:0178b21_1"
    },
    {
        "source_sentence": "戒已立，定已定，慧已得解脫，已成解脫慧，已現已致，是為佛弟子[衛-韋+正]者。",
        "translation": "After the precepts have been established, concentration has been set, wisdom has attained liberation, accomplished liberation with wisdom, and manifested it, this is a disciple [we-we+correct] of the Buddha.",
        "source": "T15n0603_002:0178b22_2"
    },
    {
        "source_sentence": "聚為四人，從[衛-韋+正]四雙，名為八人道[衛-韋+正]。",
        "translation": "The assembly was made up of four people, and the four pairs from [Wei-Wei+correct] called the eight-person path [Wei-Wei+correct].",
        "source": "T15n0603_002:0178b24_3"
    },
    {
        "source_sentence": "為世間所重所尊，為無有比，可祠可事可恭，為福地無過，是天亦人所事，",
        "translation": "Being honored and revered in the world, incomparable and incomparable, it is a place of worship that should be served by gods and humans.",
        "source": "T15n0603_002:0178b25_4"
    },
    {
        "source_sentence": "是為第三。",
        "translation": "This is the third.",
        "source": "T15n0603_002:0178b26_5"
    },
    {
        "source_sentence": "已為無疑法，隨法[衛-韋+正]一切[衛-韋+正]為苦。",
        "translation": "It's already the Dharma of no doubt, and following the Dharma [we-we+correctly] all [we-we+correctly] is painful.",
        "source": "T15n0603_002:0178b27_6"
    },
    {
        "source_sentence": "已無疑結，已受已喜，從愛為習，苦亦從愛習。",
        "translation": "The absence of the fetter of doubt has already been abandoned, and having experienced it, he's delighted. It's conditioned by craving, and suffering is also conditioned by craving.",
        "source": "T15n0603_002:0178b27_7"
    },
    {
        "source_sentence": "已無疑結、已受已解，已喜已愛盡，是為苦盡；",
        "translation": "When the fetter of doubt has been eliminated, when it has been accepted and liberated, and when delighted and craving have ceased, this is the end of suffering.",
        "source": "T15n0603_002:0178b29_0"
    },
    {
        "source_sentence": "便無疑無結，已得是受，便得喜已愛盡，是為苦盡。",
        "translation": "They then have no doubt and no fetters, and after attaining this sensation, they'll attain joy and cease craving, which is the end of suffering.",
        "source": "T15n0603_002:0178c01_0"
    },
    {
        "source_sentence": "無疑結，已解受便得喜，為八種道[衛-韋+正]。",
        "translation": "Being free of the bond of doubt, they'll attain joy once they've been liberated and accepted, which are the eight kinds of path [we-we+correct].",
        "source": "T15n0603_002:0178c02_1"
    },
    {
        "source_sentence": "從是受[衛-韋+正]令苦盡，便不疑，不疑不復結，墮解得喜。",
        "translation": "From this, he receives [we-we+correct] that causes the end of suffering, so he doesn't doubt it, doesn't doubt it, doesn't further bind it again, and falls into liberation and attains joy.",
        "source": "T15n0603_002:0178c02_2"
    },
    {
        "source_sentence": "若本有疑不解，在佛不解，在法不解，在[衛-韋+正]者聚；",
        "translation": "Those who originally had doubts but did not understand, do not understand in the Buddha, do not understand in doctrine, and do not understand in truth are assembled.",
        "source": "T15n0603_002:0178c04_3"
    },
    {
        "source_sentence": "若本有疑，在苦在習、在盡在道，[衛-韋+正]所惑所不解，隨志所疑惑。",
        "translation": "If there's doubt in the past, it's about suffering, accumulation, exhaustion, and the path, what's confused [we-we+correctly] and not understood, and whatever doubts are doubted according to their intentions.",
        "source": "T15n0603_002:0178c05_4"
    },
    {
        "source_sentence": "是如是云何是瘡？",
        "translation": "How is this so?",
        "source": "T15n0603_002:0178c06_5"
    },
    {
        "source_sentence": "為是已解本已斷，樹不復住，已散不復現，從來本法不復生。",
        "translation": "It's because the originally liberated tree has been cut off, the tree doesn't live again, it's dispersed and doesn't appear again, and the originally liberated tree doesn't arise again.",
        "source": "T15n0603_002:0178c06_6"
    },
    {
        "source_sentence": "彼持[衛-韋+正]戒轉摸貿為二輩：一為渴愛墮，二為不解避。",
        "translation": "They observe the [we-we+correct] precepts and turn their attention to trade as two groups: one, craving and falling into thirst, and two, not understanding and avoiding.",
        "source": "T15n0603_002:0179a03_0"
    },
    {
        "source_sentence": "持[衛-韋+正]戒轉模貿，為意向從是[衛-韋+正]戒攝守，從是當為得天亦天比，",
        "translation": "He observes the precepts and transforms them into a marketplace, intending to follow [these] precepts so that they are collected and guarded, and from this [this] he will attain heaven and be compared with heaven.",
        "source": "T15n0603_002:0179a04_1"
    },
    {
        "source_sentence": "當為天上，彼字為甲，玉女當為是俱相樂共居。",
        "translation": "They'll be in heaven, and that word will be armor, and the jadelike woman will be their common abode of joy and happiness.",
        "source": "T15n0603_002:0179a05_2"
    },
    {
        "source_sentence": "如是望，如是可，如是思，結相見意向，是為渴愛。",
        "translation": "Such-and-such expectation, such-and-such approval, such-and-such thought, and such-and-such formation of characteristic views and intentions are craving.",
        "source": "T15n0603_002:0179a06_3"
    },
    {
        "source_sentence": "雖持[衛-韋+正]戒，為墮摸貿，彼為不解持[衛-韋+正]戒。",
        "translation": "Even though they observe the [we-we+correct] precepts, it's because they fall into touch and trade, and they don't understand observing the [we-we+correct] precepts.",
        "source": "T15n0603_002:0179a07_4"
    },
    {
        "source_sentence": "轉摸貿為何等？",
        "translation": "What's the trade of turning and touching?",
        "source": "T15n0603_002:0179a08_5"
    },
    {
        "source_sentence": "戒[衛-韋+正]者為轉貿。",
        "translation": "The precepts [we-we+correct] are for the transformation of trade.",
        "source": "T15n0603_002:0179a09_6"
    },
    {
        "source_sentence": "戒轉貿為何等？",
        "translation": "What's the exchange of precepts?",
        "source": "T15n0603_002:0179a09_7"
    },
    {
        "source_sentence": "為意生從戒得淨，從戒得解脫，從戒得要，為從苦樂得度，或意生從願得度，",
        "translation": "In order to attain purity of thought by relying on precepts, liberation by relying on precepts, and the essentials by relying on precepts, or to attain salvation by relying on suffering and happiness, or to attain salvation by relying on wishes.",
        "source": "T15n0603_002:0179a09_8"
    },
    {
        "source_sentence": "是為不解持[衛-韋+正]戒轉摸貿。",
        "translation": "This is because they don't understand the [we-we+correct] precepts and change their ways in trade.",
        "source": "T15n0603_002:0179a11_9"
    },
    {
        "source_sentence": "何因緣為不解轉摸貿？",
        "translation": "What are the reasons why they don't understand and turn around to trade?",
        "source": "T15n0603_002:0179a12_10"
    },
    {
        "source_sentence": "意生從被服，亦從願得度世，從苦樂得却離，為從是二業被服，亦願為摸。",
        "translation": "The mind arises from being subdued by these two actions, which are also subdued by the vow to save the world and be freed from suffering and happiness, and it's because of these two actions that it's subdued and wishes to be touched.",
        "source": "T15n0603_002:0179a12_11"
    },
    {
        "source_sentence": "何等為摸？",
        "translation": "What are their feelings?",
        "source": "T15n0603_002:0179a14_12"
    },
    {
        "source_sentence": "為是二戒被服願，意計從是得解脫，從是得要，從是得過苦樂，從是苦樂為得無為。",
        "translation": "Because these two precepts are subdued and vowed, the mind conceives of attaining liberation from them, attaining essentials from them, attaining suffering and happiness from them, and attaining nothingness from suffering and happiness from them.",
        "source": "T15n0603_002:0179a14_13"
    },
    {
        "source_sentence": "從是不正計法，不從是解脫，意計從是解脫，不正計為是正，隨是[衛-韋+正]如是有，",
        "translation": "Because they do not correctly conceptualize the doctrine and do not rely on what is liberation. They conceptualize liberation from what is liberation in their minds and do not correctly conceptualize righteousness as right.",
        "source": "T15n0603_002:0179a16_14"
    },
    {
        "source_sentence": "忍可意望結見，是從是為解，是為不解持戒轉摸貿，是為二結。",
        "translation": "These are the two bonds of forbearance and contemplation, which are called understanding from this. This is because they don't understand observing precepts and engaging in sexual misconduct; these are the two bonds.",
        "source": "T15n0603_002:0179a18_15"
    },
    {
        "source_sentence": "得道弟子已捨，為無有本已斷。",
        "translation": "After the disciple who has attained the path abandons it, then there's nothing that has been stopped in the past.",
        "source": "T15n0603_002:0179a19_16"
    },
    {
        "source_sentence": "樹已拔不復現，從後不復生，是法便為已淨。",
        "translation": "Once the tree has been uprooted, it doesn't reappear and doesn't arise again afterwards, so this teaching is purified.",
        "source": "T15n0603_002:0179a20_17"
    },
    {
        "source_sentence": "戒如得道戒，隨[衛-韋+正]不為破、不為穿、不為失、不為悔。",
        "translation": "The precepts are like attaining the precepts of the path, following [we-we+correct] without breaking them, not penetrating them, not losing them, and not regretting them.",
        "source": "T15n0603_002:0179a21_18"
    },
    {
        "source_sentence": "但有增如，慧者可，無有能奪，為得從是致定，是為三縛結。",
        "translation": "But there is only such an increase, which the Wise One approves of. There is no one who can snatch it away. In order to attain samdhi resulting from this, these three fetters are spoken of.",
        "source": "T15n0603_002:0179a22_19"
    },
    {
        "source_sentence": "道弟子為已斷，已墮道迹，不復墮惡法，必度世，在七往來天上亦人中；",
        "translation": "Because the disciples of the Way have abandoned it, they have already fallen into the path. They will no longer fall into evil states. They will surely be liberated from the world. In the seven past and future heavens, they will also be among humans.",
        "source": "T15n0603_002:0179a24_0"
    },
    {
        "source_sentence": "往來期畢，便得出苦要。",
        "translation": "After coming and going, they'll be freed from the essentials of suffering when their time is up.",
        "source": "T15n0603_002:0179a25_1"
    },
    {
        "source_sentence": "有四相應，何謂四相應？",
        "translation": "What are the four conjoined ones?",
        "source": "T15n0603_002:0179a26_2"
    },
    {
        "source_sentence": "一為已解相應，二為已斷捨相應，三為自證相應，四為增滿相應。",
        "translation": "One is associated with having understood, two are associated with having abandoned equanimity, three are associated with self-realization, and four are associated with increasing.",
        "source": "T15n0603_002:0179a26_3"
    },
    {
        "source_sentence": "彼道德弟子，從苦為已解相應；",
        "translation": "That disciple of the virtuous one is associated with liberation from frustration.",
        "source": "T15n0603_002:0179a28_4"
    },
    {
        "source_sentence": "從習為已斷捨相應；",
        "translation": "It is associated with cessation and indifference from conditioning as having been abandoned.",
        "source": "T15n0603_002:0179a28_5"
    },
    {
        "source_sentence": "從盡為自證相應；",
        "translation": "They are associated with self-realization from exhaustion.",
        "source": "T15n0603_002:0179a29_6"
    },
    {
        "source_sentence": "從道為增滿相應。",
        "translation": "From the path, it's associated with increase and completion.",
        "source": "T15n0603_002:0179a29_7"
    },
    {
        "source_sentence": "彼為止觀俱隨行，一處一時一意。",
        "translation": "They are accompanied by both cessation and contemplation, with one place and one thought at one time.",
        "source": "T15n0603_002:0179b01_8"
    },
    {
        "source_sentence": "本來有是有意，令為作四事。",
        "translation": "Originally there was this intention to cause four things to be done for him.",
        "source": "T15n0603_002:0179b02_0"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T15n0603_002:0179b02_1"
    },
    {
        "source_sentence": "一為苦，從苦已解為苦相應。",
        "translation": "The first is unsatisfactoriness. Being liberated from unsatisfactoriness, it is associated with unsatisfactoriness.",
        "source": "T15n0603_002:0179b02_2"
    },
    {
        "source_sentence": "二為習，從習已斷捨為習相應。",
        "translation": "The second is conditioned by accumulation, and the cessation of equanimity after accumulation is associated with accumulation.",
        "source": "T15n0603_002:0179b03_3"
    },
    {
        "source_sentence": "三為盡，從盡自證為盡相應。",
        "translation": "The third is exhaustion, which is associated with the self-realized from exhaustion as exhaustion.",
        "source": "T15n0603_002:0179b04_4"
    },
    {
        "source_sentence": "四為道，從道增滿令道相應。",
        "translation": "The fourth is the path, which causes it to be associated with the path as a result of the increase in the path.",
        "source": "T15n0603_002:0179b05_5"
    },
    {
        "source_sentence": "何以故從苦已解相應？",
        "translation": "Why is it therefore associated with liberation after suffering?",
        "source": "T15n0603_002:0179b05_6"
    },
    {
        "source_sentence": "何以故從習已斷捨相應？",
        "translation": "Why is it associated with cessation and equanimity after becoming conditioned?",
        "source": "T15n0603_002:0179b06_7"
    },
    {
        "source_sentence": "何以故從盡已自證相應？",
        "translation": "Why is it therefore associated with self-realization from the exhaustion?",
        "source": "T15n0603_002:0179b06_8"
    },
    {
        "source_sentence": "何以故從道已增滿相應？",
        "translation": "Why is it therefore associated with the path that has already been perfected?",
        "source": "T15n0603_002:0179b07_9"
    },
    {
        "source_sentence": "為有譬喻。",
        "translation": "It's because there are metaphors.",
        "source": "T15n0603_002:0179b08_0"
    },
    {
        "source_sentence": "如水中沫行上至竟，為有四[衛-韋+正]。",
        "translation": "It's like the foam in water that travels upward until it reaches its end, for which there are four [we-we+correct].",
        "source": "T15n0603_002:0179b08_1"
    },
    {
        "source_sentence": "從是岸邊，致度岸邊，度就，斷脈。",
        "translation": "From the side of this shore, he crosses over to the side of the shore and enters it, cutting off his veins.",
        "source": "T15n0603_002:0179b08_2"
    },
    {
        "source_sentence": "是亦如是，止觀雙俱行，一處一時一意，上要至竟，為成四事。",
        "translation": "The same applies also to the one of cessation and to the one of sustained thought. Both proceed together: in one place, at one moment, and with one intention. The above-mentioned [factors] are accomplished by means of four things:",
        "source": "T15n0603_002:0179b09_3"
    },
    {
        "source_sentence": "譬如日出，上至竟，為現作四事：致明、壞冥、現色、現竟。",
        "translation": "It's like when the sun rises up and reaches its end, it does four things to show itself: bringing light, destroying darkness, manifesting form, and showing completion.",
        "source": "T15n0603_002:0179b11_4"
    },
    {
        "source_sentence": "譬如船渡，捨是岸邊、致渡岸邊、致物、斷脈。",
        "translation": "It's like when a boat crosses the shore and abandons this side of the shore, causes it to cross the side of the shore, causes things to be produced, and cuts off its veins.",
        "source": "T15n0603_002:0179b12_5"
    },
    {
        "source_sentence": "止觀亦如是，雙發行，為一處一時一意，上要至竟，為作四事：為解苦如應相燭，",
        "translation": "Cessation and contemplation are likewise: they are issued in pairs, for one place, at one time, and with one thought. The above-mentioned [bodhisattva] accomplishes the supreme goal by doing four things:",
        "source": "T15n0603_002:0179b13_6"
    },
    {
        "source_sentence": "為斷習如應相應，為盡自證如應解相應，為[衛-韋+正]道要如應相應。",
        "translation": "It's associated with stopping accumulation as it should be, ending self-realization as it should be understood, and [we-we+correctly] the essentials of the path as they should be associated.",
        "source": "T15n0603_002:0179b15_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0603_002:0179b16_8"
    },
    {
        "source_sentence": "為苦從更解相應；",
        "translation": "It is painful because it is associated with a new understanding.",
        "source": "T15n0603_002:0179b16_9"
    },
    {
        "source_sentence": "習從斷解相應；",
        "translation": "Conditioned states are associated with cessation and understanding.",
        "source": "T15n0603_002:0179b17_10"
    },
    {
        "source_sentence": "盡從苦證解相應；",
        "translation": "They are all associated with enlightenment through the realization of suffering.",
        "source": "T15n0603_002:0179b17_11"
    },
    {
        "source_sentence": "道[衛-韋+正]要解相應。",
        "translation": "The path [we-we+correct] is associated with the essentials of understanding.",
        "source": "T15n0603_002:0179b18_12"
    },
    {
        "source_sentence": "止觀亦如是，雙相連行，一處一時一意，止要至竟，為[衛-韋+正]竟四事：為苦更，",
        "translation": "The same applies to cessation and to sustained thought. They proceed one after the other: from one place to another, at one moment with one thought. Cessation is necessary when reaching its end. In order to [we-we+correct] accomplish four things:",
        "source": "T15n0603_002:0179b18_13"
    },
    {
        "source_sentence": "為習斷，為盡自證，為[衛-韋+正]道滿。",
        "translation": "It's for the sake of accumulating cessation, for the sake of ending self-realization, and for [we-we+correctly] fulfilling the [we-we+correctly] path.",
        "source": "T15n0603_002:0179b20_14"
    },
    {
        "source_sentence": "譬如然燈燭，上至竟為作四事：為作明、為去冥、為現色、為却疑。",
        "translation": "It's like a candle that does four things up to the end: making light, removing darkness, manifesting form, and dispelling doubt.",
        "source": "T15n0603_002:0179b20_15"
    },
    {
        "source_sentence": "止觀亦如是，為作四事：為識苦、為斷集、為盡自證、為[衛-韋+正]道滿。",
        "translation": "Cessation and contemplation are likewise, because they do four things: for the sake of consciousness suffering, for the sake of stopping accumulation, for the sake of ending self-realization, and for [we-we+correctly] fulfilling the path.",
        "source": "T15n0603_002:0179b22_16"
    },
    {
        "source_sentence": "譬如然燈上至竟，為有四義：為現明、為去冥、為現色、為盡膏炷。",
        "translation": "It's like the four meanings of manifesting light, removing darkness, manifesting form, and exhausting the grease wick.",
        "source": "T15n0603_002:0179b23_17"
    },
    {
        "source_sentence": "止觀亦如是，雙隨行，一處一時一意止至竟，為作四事：為識苦苦相應，",
        "translation": "The same applies to cessation and to the one-pointed concentration. They proceed in succession: at one place, at one moment, and with one thought, there is stillness up to the end. It is for this reason that they do four things:",
        "source": "T15n0603_002:0179b25_18"
    },
    {
        "source_sentence": "為斷習習相應，為盡自證盡相應，為[衛-韋+正]道滿道相應。",
        "translation": "It's associated with stopping accumulation and accumulation, ending self-realization, and [we-we+correct] the path that's associated with the completion of the path.",
        "source": "T15n0603_002:0179b26_19"
    },
    {
        "source_sentence": "何以故為識苦苦相應？",
        "translation": "Why are they therefore associated with the suffering of consciousness as suffering?",
        "source": "T15n0603_002:0179b28_20"
    },
    {
        "source_sentence": "何以故為斷習習相應？",
        "translation": "Why is it therefore associated with the accumulation of cessation?",
        "source": "T15n0603_002:0179b28_21"
    },
    {
        "source_sentence": "何以故為盡自證盡相應？",
        "translation": "Why is it therefore associated with the cessation of self-realized cessation?",
        "source": "T15n0603_002:0179b29_22"
    },
    {
        "source_sentence": "何以故為[衛-韋+正]道滿道相應？",
        "translation": "Why is the [we-we+correct] path associated with the fulfillment of the path?",
        "source": "T15n0603_002:0179b29_23"
    },
    {
        "source_sentence": "為從誰應？",
        "translation": "Where should they come from?",
        "source": "T15n0603_002:0179c01_24"
    },
    {
        "source_sentence": "為從止觀。",
        "translation": "It's from calming and observing.",
        "source": "T15n0603_002:0179c01_25"
    },
    {
        "source_sentence": "何等為應？",
        "translation": "What are their responses?",
        "source": "T15n0603_002:0179c01_26"
    },
    {
        "source_sentence": "應云何持？",
        "translation": "How should it be maintained?",
        "source": "T15n0603_002:0179c02_27"
    },
    {
        "source_sentence": "意繫觀。",
        "translation": "It's the contemplation of mental binding.",
        "source": "T15n0603_002:0179c02_28"
    },
    {
        "source_sentence": "已意繫觀，便見五陰苦，彼所意繫是為止，已見五陰為苦是為觀。",
        "translation": "After observing the mental binding, they'll see that the five aggregates are painful, and their mental binding is the end. Having seen that the five aggregates are painful, this is contemplation.",
        "source": "T15n0603_002:0179c02_29"
    },
    {
        "source_sentence": "彼所為五陰相近，可發往欲著，願得相往不捨習所，是已斷已盡。",
        "translation": "When these five aggregates are proximate to each other, they can give rise to past desires and attachments, wishing to attain the characteristic of past and future without abandoning their accumulated places, which have been stopped and ended.",
        "source": "T15n0603_002:0179c04_30"
    },
    {
        "source_sentence": "止觀道亦如是，令是道德四諦，一處一時一意上至竟，為令四諦相應。",
        "translation": "The same applies to the path of cessation and to the one of supervision. It is so that they are made to be the four noble truths of morality: from one place at one moment up to the end of one thought, in order to make them conjoin with the four noble truths.",
        "source": "T15n0603_002:0179c05_31"
    },
    {
        "source_sentence": "如是道，道德弟子為是法相法，已應是名為見地；",
        "translation": "In this way, the disciple of moral characteristics is a factor in relation to the doctrine. This should be called the stage of vision.",
        "source": "T15n0603_002:0179c07_32"
    },
    {
        "source_sentence": "已得道脈，至道迹跓，為復止觀，令是欲恚使縛為復除。",
        "translation": "Having attained the path's vein, he reaches the path's traces of defilement and stops and observes them again so that they are freed by the fetters of desire and anger.",
        "source": "T15n0603_002:0179c08_33"
    },
    {
        "source_sentence": "得道弟子為往來受，以是[衛-韋+正]足，已從往來便壞苦本，是為薄地；",
        "translation": "When a disciple of the Way receives [the precepts] in order to go and come, he uses these [we-we+correct] feet. Having gone and coming, he destroys the root cause of suffering. This is called thin ground.",
        "source": "T15n0603_002:0179c09_34"
    },
    {
        "source_sentence": "便已竟往來福已來得在德止；",
        "translation": "“Then the enlightening beings attain virtuous cessation after having perfected past and future blessings.",
        "source": "T15n0603_002:0179c11_35"
    },
    {
        "source_sentence": "復增止觀，令餘愛欲恚所使為畢捨，欲恚未畢捨，使結令畢已畢，為得道弟子，",
        "translation": "He also increases calming and observing, causing the remaining bonds of craving and sexual desire to be abandoned after they're ended. When he stops sexual desire before it's ended, he causes the bonds to be abandoned after they've ended as a disciple of the path.",
        "source": "T15n0603_002:0179c11_36"
    },
    {
        "source_sentence": "便解下五結已畢。",
        "translation": "He then explains the next five conclusions after they've been completed.",
        "source": "T15n0603_002:0179c13_37"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T15n0603_002:0179c14_38"
    },
    {
        "source_sentence": "一為見身是非，二為解疑，三為不惑不貿戒，四為不望，五為不恚，是為五結。",
        "translation": "The first is to see the body as right and wrong, the second to resolve doubts, the third not to be confused and not to exchange precepts, the fourth not to expect, and the fifth not to fight. These are the five fetters.",
        "source": "T15n0603_002:0179c14_39"
    },
    {
        "source_sentence": "已畢，便得道弟子，不復還世間，彼度世不復還是世間，是名為却地，",
        "translation": "Having done so, he attains the state of a disciple of the Way and no longer returns to the world. When he has transcended the world and no longer remains in the world, this is called the stage of detachment.",
        "source": "T15n0603_002:0179c16_40"
    },
    {
        "source_sentence": "是為不還福。",
        "translation": "This is the merit of not returning.",
        "source": "T15n0603_002:0180a01_41"
    },
    {
        "source_sentence": "已致得止不還福，復增翅止觀，令為解捨上五結。",
        "translation": "Having attained the merit of stopping and not returning, he also increases his calmness and contemplation with a wing to remove the five above-mentioned bonds.",
        "source": "T15n0603_002:0180a01_42"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T15n0603_002:0180a03_43"
    },
    {
        "source_sentence": "一為色欲，二為不色欲，三為癡，四為憍慢，五為不解。",
        "translation": "The first is for the desire for form, the second for the desire for formlessness, the third for delusion, the fourth for arrogance, and the fifth for not understanding.",
        "source": "T15n0603_002:0180a03_44"
    },
    {
        "source_sentence": "已上五[衛-韋+正]足，為已捨五結，便無所著，已度世無有漏，已竟從正得解脫，",
        "translation": "Having abandoned the five fetters, he attains freedom from attachment. Having crossed the world without attachment, he has no longer remained uncontaminated. Having completely abandoned these fetters, he enters liberation through right effort.",
        "source": "T15n0603_002:0180a04_45"
    },
    {
        "source_sentence": "是為畢地。",
        "translation": "This is the stage of completion.",
        "source": "T15n0603_002:0180a06_46"
    },
    {
        "source_sentence": "無所著尚有妙無為，為捨畢已，世間命根盡，亦世間苦盡，不復生苦。",
        "translation": "There's nothing to be attached to, and there's still marvelous nonproductivity. After he abandons it, his life root in the world ends, and so does worldly suffering that doesn't give rise to pain again.",
        "source": "T15n0603_002:0180a06_47"
    },
    {
        "source_sentence": "彼以為是陰持入已盡寂然，不有陰持入，不相連不復發，是名為已畢無為。",
        "translation": "It's because they think that this aggregate has ended and become quiescent after maintaining and entering it, doesn't have aggregates maintaining and entering it, isn't connected to each other, and doesn't arise again, which is called having completed nonproductivity.",
        "source": "T15n0603_002:0180a08_48"
    },
    {
        "source_sentence": "為已說諦相應、亦說份相應、亦說地、亦說福說斷，說罪說離、說二無為，",
        "translation": "It has been said that they are associated with the truths, that they are also associated with factors, that they are also said to be stages, that they are also said to be abandoned through merit, that sin is said to be separation, and that they are said to be two unconditioned things.",
        "source": "T15n0603_002:0180a09_49"
    },
    {
        "source_sentence": "為一切如是說。",
        "translation": "It's thus explained for all of them.",
        "source": "T15n0603_002:0180a11_50"
    },
    {
        "source_sentence": "佛已更度世畢，若人欲度世，當[衛-韋+正]是彼。",
        "translation": "If someone wants to save the world, they should [we-we+correctly] do so.",
        "source": "T15n0603_002:0180a11_51"
    },
    {
        "source_sentence": "何等為九次第思惟正定？",
        "translation": "What are the nine graduated contemplations of right concentration?",
        "source": "T15n0603_002:0180a13_0"
    },
    {
        "source_sentence": "為四禪，亦無色正四定，亦已盡畢定，為九次第正定。",
        "translation": "In the case of the fourth trance, there are also the four formless meditative states of absorption. The meditative states of absorption that have also been exhausted constitute nine successive meditative states of absorption.",
        "source": "T15n0603_002:0180a13_1"
    },
    {
        "source_sentence": "彼第一禪已捨五種，隨正五種。",
        "translation": "After the first trance, five kinds are abandoned:",
        "source": "T15n0603_002:0180a14_2"
    },
    {
        "source_sentence": "已捨五種為何等？",
        "translation": "What are the five kinds that have been abandoned?",
        "source": "T15n0603_002:0180a15_3"
    },
    {
        "source_sentence": "為五蓋：一、愛欲，二、瞋恚，三、睡眠，四、不了悔，五、為疑。",
        "translation": "They are the five hindrances: 1. desire, 2. anger, 3. drowsiness, 4. lack of regret, and 5. doubt.",
        "source": "T15n0603_002:0180a15_4"
    },
    {
        "source_sentence": "是為五種。",
        "translation": "These are the five kinds.",
        "source": "T15n0603_002:0180a17_5"
    },
    {
        "source_sentence": "上禪已捨。",
        "translation": "He's abandoned the higher dhyāna.",
        "source": "T15n0603_002:0180a17_6"
    },
    {
        "source_sentence": "彼愛欲蓋為何等？",
        "translation": "What's the lid of craving and what's it?",
        "source": "T15n0603_002:0180a17_7"
    },
    {
        "source_sentence": "愛欲名為所為，五樂愛著，發往可求，隨願發不捨使發起，是名為愛欲蓋。",
        "translation": "Desire and desire are called what's done, the five kinds of pleasure and attachment that give rise to past and future desirable things, and the tendency to give rise to them according to their wishes without abandoning them is called the hindrance of craving and desire.",
        "source": "T15n0603_002:0180a18_0"
    },
    {
        "source_sentence": "彼瞋恚蓋為何等？",
        "translation": "What's the hindrance of anger?",
        "source": "T15n0603_002:0180a19_1"
    },
    {
        "source_sentence": "為若人為發行拕，[病-丙+(止\\/(止*止))]恚相恚非法本所使所從起，",
        "translation": "It's because if someone were to give rise to sexual misconduct for the sake of [disease - c + (cessation \\/ (cessation * cessation)] sexual misconduct is produced by what's originally unlawful, which is caused by what's not lawful.",
        "source": "T15n0603_002:0180a20_2"
    },
    {
        "source_sentence": "是名為瞋恚蓋。",
        "translation": "This is called the hindrance of anger.",
        "source": "T15n0603_002:0180a21_3"
    },
    {
        "source_sentence": "彼睡瞑蓋為何等？",
        "translation": "What's the lid of that drowsiness?",
        "source": "T15n0603_002:0180a21_4"
    },
    {
        "source_sentence": "睡為身跓、為意跓，為身止、為意止，為身癡、為意癡，為身重、為意重，",
        "translation": "“Sledding is torpor of body, torpor of thought. It is torpor of body and it is torpor of thought.",
        "source": "T15n0603_002:0180a22_5"
    },
    {
        "source_sentence": "為身不便、為意不便，為身不使、為意不使，是為睡。",
        "translation": "It's because the body is uncomfortable and the mind is uncomfortable, and it's because the body isn't developed and the mind isn't developed, which is called sleep.",
        "source": "T15n0603_002:0180a23_6"
    },
    {
        "source_sentence": "瞑為何等？",
        "translation": "What's concealed?",
        "source": "T15n0603_002:0180a24_7"
    },
    {
        "source_sentence": "為意相，從令瞑動相動，令不作事，是為瞑。",
        "translation": "It's for the sake of mental characteristics, to cause them to be silenced and not to do anything, which is called being silenced.",
        "source": "T15n0603_002:0180a25_8"
    },
    {
        "source_sentence": "上頭為睡，後為瞑，是共名為睡瞑蓋。",
        "translation": "The upper part is sleep, and the lower part is stillness; this is commonly known as sleep and a hindrance of quietude.",
        "source": "T15n0603_002:0180a26_9"
    },
    {
        "source_sentence": "彼不了悔蓋為何等？",
        "translation": "What's the reason they don't understand the lid of repentance?",
        "source": "T15n0603_002:0180a27_0"
    },
    {
        "source_sentence": "為身不止。",
        "translation": "It's because the body doesn't stop.",
        "source": "T15n0603_002:0180a27_1"
    },
    {
        "source_sentence": "悔為何等？",
        "translation": "What's the repentance?",
        "source": "T15n0603_002:0180a27_2"
    },
    {
        "source_sentence": "為所念可不可不得悔。",
        "translation": "It's something to be thought of that can't be regretted.",
        "source": "T15n0603_002:0180a27_3"
    },
    {
        "source_sentence": "是上頭為不了，後為悔，是共名為不了悔蓋。",
        "translation": "This is commonly called the hindrance of not understanding and repenting because the upper part doesn't understand and the latter part repents.",
        "source": "T15n0603_002:0180a28_4"
    },
    {
        "source_sentence": "彼疑蓋為何等？",
        "translation": "What's the reason for that doubt?",
        "source": "T15n0603_002:0180a29_5"
    },
    {
        "source_sentence": "若不信佛、不信法、不信[衛-韋+正]者聚，不解苦、習、盡、道比，",
        "translation": "If someone doesn’t believe in the Buddha, don’t believe in the Dharma, and don’t believe in [we-we+correct]—they are assembled, and they don’t understand suffering, its accumulation, its cessation, and the comparison of the path.",
        "source": "T15n0603_002:0180a29_6"
    },
    {
        "source_sentence": "結使亦從發，是名為疑蓋。",
        "translation": "The afflictive tendencies also arise from this, which is called the hindrance of doubt.",
        "source": "T15n0603_002:0180b02_7"
    },
    {
        "source_sentence": "亦有五疑：有縣聚疑、有發教疑、有道分別疑、有欲[衛-韋+正]定疑、有得道福疑。",
        "translation": "There are also five doubts: there are doubts in the prefecture, doubts in the arousal of the teaching, doubts in the discernment of the path, doubts in the concentration [we-we+correct] of desire [we-we+correct], and doubts in the merit of attaining the path.",
        "source": "T15n0603_002:0180b02_8"
    },
    {
        "source_sentence": "如是是為說定疑，是為五蓋。",
        "translation": "Thus, these are the five hindrances that explain doubt in terms of concentration.",
        "source": "T15n0603_002:0180b04_9"
    },
    {
        "source_sentence": "蓋說為何等？",
        "translation": "What's said to be?",
        "source": "T15n0603_002:0180b04_10"
    },
    {
        "source_sentence": "蓋為却對，為却一切清淨法。",
        "translation": "It's to stop opposition and to stop all pure dharmas.",
        "source": "T15n0603_002:0180b05_11"
    },
    {
        "source_sentence": "却云何？",
        "translation": "What does it mean?",
        "source": "T15n0603_002:0180b05_12"
    },
    {
        "source_sentence": "愛欲為却清淨，瞋恚為却等意，睡為却止，瞑為却精進，五樂為却[衛-韋+正]亦止，",
        "translation": "Desire is purified by rejecting desire, anger is purified by rejecting hatred, sleep is purified by rejecting craving, meditation is purified by rejecting effort, and the five pleasures are purified by rejecting [we-we+correctly].",
        "source": "T15n0603_002:0180b06_13"
    },
    {
        "source_sentence": "結為却不悔，疑為却慧，不知本從起，為却解明。",
        "translation": "The fetters are to be rejected without regret, doubt is to be rejected by wisdom, which doesn't know where it comes from in the first place, and understanding is to be rejected.",
        "source": "T15n0603_002:0180b07_14"
    },
    {
        "source_sentence": "陰持入經卷下",
        "translation": "Second Fascicle of the Sutra on the Entry into the Constellations, Volume II",
        "source": "T15n0603_002:0180b09_0"
    },
    {
        "source_sentence": "佛說慧印百六十三定解",
        "translation": "Buddha teaches the one hundred and sixty-three concentrations of the wisdom mudrā",
        "source": "T15n0603_002:0180b10_0"
    },
    {
        "source_sentence": "當知舍利弗！",
        "translation": "You should know, Śāriputra!",
        "source": "T15n0603_002:0180b11_0"
    },
    {
        "source_sentence": "如來之身為無身、無作、無起、無滅、無從有、未曾造、無合、無遊、無至、無知、無習、都清淨、無畜、無憎、無行、無止、無生、無報、無見、無間、無臭、無甞、無更、無識、無曉、無喻、無知忍、無志、無思。",
        "translation": "The Tathāgata's body is without body, without action, without arising, without ceasing, without decay, without origin, without formation, without conjunction, without travel, without arrival, without knowing, without accumulation, completely pure, without animal, without hatred, without action, without cessation, without birth, without retribution, without view, without interruption, without smell,",
        "source": "T15n0603_002:0180b11_1"
    },
    {
        "source_sentence": "非意、離意、意平無平、去意。",
        "translation": "What's not mind, what's free of mind, what's calm and uneven in mind, and what's going away.",
        "source": "T15n0603_002:0180b15_0"
    },
    {
        "source_sentence": "無所與、無五道五道斷要具、無閨、無惱、無有、無畏、無可無不可、無業、無成、無言、無耎不現。",
        "translation": "Nothing is given, nothing is necessary for the five paths and five paths to be eliminated, nothing is lacking, nothing is harmful, nothing is existent, nothing is fearless, nothing is agreeable or disagreeable, nothing is done, nothing is accomplished, nothing is said, and nothing is unseen.",
        "source": "T15n0603_002:0180b15_1"
    },
    {
        "source_sentence": "非明非冥、非滅不滅、離滅已滅、為淨極淨。",
        "translation": "It's neither insight nor obscurity, neither cessation nor non-cessation, separation after cessation and cessation, and it's pure and extremely pure.",
        "source": "T15n0603_002:0180b17_2"
    },
    {
        "source_sentence": "彼淨不用、非悅非愛、非負離負已住應於無處、非逝非亡非沒、非法非無法、非土非無土、非盡無有盡捨盡、無怒、離於天、離於嚮、離於說、離於思。",
        "translation": "What's pure and not used, what's neither pleasant nor craving, what's neither negative nor negative, what's already abiding after being negative, what's neither passing away nor dying away nor disappearing, what's neither lawful nor non-lawful, what's neither land nor no land, what's not exhausted nor inexhaus",
        "source": "T15n0603_002:0180b18_3"
    },
    {
        "source_sentence": "非合非不合、非極非不極、非去非不去、非二非不樂。",
        "translation": "What's neither combined nor not combined, what's neither extreme nor not extreme, what's neither going nor not going, and what's neither two nor unpleasant.",
        "source": "T15n0603_002:0180b21_4"
    },
    {
        "source_sentence": "無彼受、無所視、無相、離相、不求相，明、安徐、無著、離著造信。",
        "translation": "Without that feeling, without anything to look at, without marks, free of marks, and not seeking marks, he creates faith with clarity, peace, no attachment, and freedom from attachment.",
        "source": "T15n0603_002:0180b22_5"
    },
    {
        "source_sentence": "亦無二稱，如為審如審，如義不負人，度無度，除無除，救無救，說無說，",
        "translation": "Nor do they have dual names, such as to be judged and so judged, according to the meaning and not to rely on others, surpassing and not surpassing, excepting and not removing, rescuing and not rescuing, teaching and not teaching.",
        "source": "T15n0603_002:0180b23_6"
    },
    {
        "source_sentence": "二無有等，無比等、與空等、無處等、無生等、無得等。",
        "translation": "The second is the absence of suchness, which has no compare, suchness with emptiness, etc., no place, etc., no arising, etc., and no attainment.",
        "source": "T15n0603_002:0180b25_7"
    },
    {
        "source_sentence": "無休息離息、已寂而寂、滿寂、散解、心善行轉至要，一切報斷，成具甚真身，",
        "translation": "“Without ceasing, he becomes dispassionate, calm and quiescent; his mind becomes full of tranquility. Dispassionate, his good deeds disperse, his mind proceeds in the ultimate essential way. All retributions are cut off, and he develops a body endowed with great intelligence.",
        "source": "T15n0603_002:0180b26_8"
    },
    {
        "source_sentence": "明質淨。",
        "translation": "It explains that the quality is pure.",
        "source": "T15n0603_002:0180b27_9"
    },
    {
        "source_sentence": "無自惟、無所行，行解無解無應，不齊、不長、不圓、不方、不讚陰、不稱種、不譽入、不是數、不致數、不復生、不可見、不有知、亦不死。",
        "translation": "They don't think for themselves, don't do anything, practice and understand without understanding or response, don't equalize, don't grow long, don't perfect, don't go in directions, don't praise the aggregates, don't call them seeds, don't praise entry, don't count, don't number, don't cause",
        "source": "T15n0603_002:0180b27_10"
    },
    {
        "source_sentence": "不世因無不因，身然不趺無有居處，非終、非始、非念、非憂、非事、非諍、非惡相、非滅度、非滅訖、非所造、非不遊。",
        "translation": "The body is neither crude nor coarse, and there is no dwelling place. It is not final, not initial, not mindful, not grieved, not substantial, not debilitating, not gross, not bad signs, not passing away, not complete, not created, not unmanifest.",
        "source": "T15n0603_002:0180c01_11"
    }
]