[
    {
        "source_sentence": "佛說阿闍世王經卷上",
        "translation": "Foshuo  Ajatasatru jing, vol. 1",
        "source": "T15n0626_001:0389a07_0"
    },
    {
        "source_sentence": "後漢月氏三藏支婁迦讖譯",
        "translation": "Compilation of the Latter Han translation of the Tripiṭaka of the Yue family, translated by Cirogakaṭṭha",
        "source": "T15n0626_001:0389a09_0"
    },
    {
        "source_sentence": "聞如是：一時佛在羅閱祇耆闍崛山中，萬二千比丘俱，菩薩八萬四千，",
        "translation": "Thus I have heard: One time, when the Buddha was staying at Rājagṛha in the mountains, accompanied by twelve thousand monks, eighty-four thousand bodhisattvas.",
        "source": "T15n0626_001:0389a10_0"
    },
    {
        "source_sentence": "一一尊復尊，諸菩薩摩訶薩，悉得諸總持、悉得無所罣閡欲、悉得無所從生法，",
        "translation": "“Furthermore, all the enlightening beings and bodhisattvas of that buddha-land had attained unobstructed concentration, equanimity, freedom from attachment, and nonorigination.",
        "source": "T15n0626_001:0389a11_1"
    },
    {
        "source_sentence": "而得如是三昧慧，悉得知一切人心之所行，如所欲以法教，令各得其所。",
        "translation": "Attaining such samādhi wisdom, he knows all the actions of all people's minds and teaches the Dharma as he wishes so that each will attain their own place.",
        "source": "T15n0626_001:0389a13_2"
    },
    {
        "source_sentence": "諸四天王及天帝釋，釋天及諸天子，龍、閱叉、揵陀羅、阿須輪、迦留羅、真陀羅、摩休勒、人非人悉來會。",
        "translation": "The four heavenly kings and Indra, the god Śakra Devānām-Indra, the gods and goddesses, dragons, yakṣas, caṇḍālas, asuras, garuḍas, mahoras, humans, nonhumans, and mahūrvas all came to the assembly.",
        "source": "T15n0626_001:0389a15_3"
    },
    {
        "source_sentence": "時文殊師利在山一面異處，與二十五上人俱。",
        "translation": "At the time, Mañjuśrī was at a different place on one side of the mountain, accompanied by twenty-five superiors.",
        "source": "T15n0626_001:0389a17_4"
    },
    {
        "source_sentence": "何謂二十五人者？",
        "translation": "What are the twenty-five?",
        "source": "T15n0626_001:0389a18_5"
    },
    {
        "source_sentence": "悉是菩薩，各各有名，名曰：若那師利、那羅達師利、三波師利、劫波頭師利、波頭師利、劫闍因陀樓、陀羅尼陀樓、羅陀波尼、羅陀牟訶多、私訶末、師訶惟迦闍、俱羅加那迦闍、沙訶質兜波沈、摩遮迦波、栝鎮遮薩、惒波陀波、坻盤拘利沙竭末、摩訶麑樓耆非、陀遮阿難陀、譬叉波貿耆、羅耶阿難陀、阿藍惟訶羅、摩抵吒沙、牟迦抵陀、阿喻達薩惒頞悉，",
        "translation": "They are all bodhisattvas, each named by their own names: 若那師利、那羅達師利、三波師利、劫波頭師利、波頭師利、劫闍因陀樓、陀羅尼陀樓、羅陀波尼、羅陀波尼、羅陀牟訶多、私訶末、師訶惟迦闍、俱羅加那迦",
        "source": "T15n0626_001:0389a18_6"
    },
    {
        "source_sentence": "是為二十五上人名。",
        "translation": "These are the names of the twenty-five superior people.",
        "source": "T15n0626_001:0389a26_7"
    },
    {
        "source_sentence": "四兜術天子來到文殊師利所，欲聞法故，其天子名沙摩陀鳩遬摩羅、無拘遬摩、漫那羅揵陀沙訶、漚術曇惟訶，",
        "translation": "The deities of the four Tushita heavens came to Mañjuśrī and wanted to hear the Dharma. That celestial being was called *Sāmadhātu-kuṭika-māla, *A kumbhūṣa-māla, *Manara-gṛha, *Maṇḍu-gṛha, *Mañjuśrī-gṛha, *",
        "source": "T15n0626_001:0389a27_8"
    },
    {
        "source_sentence": "是為四天子。",
        "translation": "These are the four celestial beings.",
        "source": "T15n0626_001:0389a29_9"
    },
    {
        "source_sentence": "復有異天子少少，來到文殊師利所，欲聽法故。",
        "translation": "Again, there were a few other celestial beings who came to Mañjuśrī's place because they wanted to hear the Dharma.",
        "source": "T15n0626_001:0389a29_10"
    },
    {
        "source_sentence": "上人諸天子悉坐，各各說佛智慧甚尊，無有極不可議、不可度不可量、不可以凡而應僧那，",
        "translation": "The supreme beings and celestial beings all sat there, each saying that the Buddha’s knowledge and wisdom were so great as to be unfathomable, immeasurable, immeasurable, incalculable, and not to be compared with ordinary people.",
        "source": "T15n0626_001:0389b02_0"
    },
    {
        "source_sentence": "皆言：「當何作法證方便而至無極智慧，乃至佛一切智不可議？」",
        "translation": "They all said, What will be the method of realizing the Dharma and attaining infinite wisdom up to the point where the Buddha's omniscience is inconceivable?",
        "source": "T15n0626_001:0389b04_1"
    },
    {
        "source_sentence": "慧首菩薩言：「於功德無有厭，於諸功德無所悕望，作是者可至無極慧。」",
        "translation": "Huishou Bodhisattva said, There's no disillusionment with virtue, and there's no expectation of virtue; someone who does so can attain the supreme wisdom.",
        "source": "T15n0626_001:0389b05_2"
    },
    {
        "source_sentence": "惠施菩薩言：「等心如寂，其心悅懌柔軟，自隨其教，便持薩芸若心而堅固於僧那僧涅，",
        "translation": "The bodhisattva Huiqiao said, Equanimous mind is like quiescence, and his mind is delighted with kindness and gentleness. He follows his own instructions, so he maintains the state of saṃjñāpāramitā and firmly establishes it in samyak-saṃjñāna.",
        "source": "T15n0626_001:0389b07_3"
    },
    {
        "source_sentence": "作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0389b09_4"
    },
    {
        "source_sentence": "具足平等菩薩言：「不計校劫數，其當來劫無央數不可以為計，是為僧那。",
        "translation": "The Bodhisattva of Universal Equality said, Without calculating the number of eons, there will be an incalculable number of future eons that can't be counted; this is Saṃna.",
        "source": "T15n0626_001:0389b09_5"
    },
    {
        "source_sentence": "於僧那不自貢高，作是者可至無極慧。」",
        "translation": "If you don't pride yourself in the saṃṇa, and do so, you'll attain infinite wisdom.",
        "source": "T15n0626_001:0389b11_6"
    },
    {
        "source_sentence": "具足行菩薩言：「不自念安，可至無極慧。",
        "translation": "The fully practicing bodhisattva said, Don't think of yourself as peaceful, and you can attain the supreme wisdom.",
        "source": "T15n0626_001:0389b12_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0389b13_0"
    },
    {
        "source_sentence": "欲令一切皆安故。",
        "translation": "It's because they want to make everything peaceful.",
        "source": "T15n0626_001:0389b13_1"
    },
    {
        "source_sentence": "作是念者，不求復悉安一切，作是者可至無極慧。」",
        "translation": "If someone thinks this, they won't seek to make everything completely peaceful again, and if they do so, they'll attain the supreme wisdom.",
        "source": "T15n0626_001:0389b13_2"
    },
    {
        "source_sentence": "蓮華具足菩薩言：「其不自伏意者，亦不能伏他人意。",
        "translation": "The Lotus Sugata Bodhisattva said, Those who don't subdue their own minds won't be able to subdue the minds of others.",
        "source": "T15n0626_001:0389b14_3"
    },
    {
        "source_sentence": "其能自伏意者，乃能伏他人意，作是者可至無極慧。」",
        "translation": "If someone can subdue their own thoughts, they'll be able to subdue the thoughts of others, and if they do so, they'll attain infinite wisdom.",
        "source": "T15n0626_001:0389b15_4"
    },
    {
        "source_sentence": "蓮華具行劫菩薩言：「其有隨欲者不可度欲，不隨欲者是乃度欲。",
        "translation": "The Padmasaṃbhava Bodhisattva said, Those who follow desire can't be liberated from desire, and those who don't follow desire are liberated from desire.",
        "source": "T15n0626_001:0389b17_5"
    },
    {
        "source_sentence": "其菩薩者，得利不得利其心無有異，若苦若樂、若謗若歎、若惡若善於是無所著。",
        "translation": "That bodhisattva's mind is no different from those who attain profit or don't attain profit, and there's nothing to be attached to whether it's painful, pleasant, denigrating, praising, bad, or good.",
        "source": "T15n0626_001:0389b18_6"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0389b20_7"
    },
    {
        "source_sentence": "亦不憂亦不喜。",
        "translation": "They're neither grieved nor joyous.",
        "source": "T15n0626_001:0389b20_8"
    },
    {
        "source_sentence": "作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0389b21_9"
    },
    {
        "source_sentence": "制持諸根菩薩言：「不念他人作功德我可得，作是者不入無極慧。",
        "translation": "The bodhisattva who restrains the faculties says, Not mindful of the merits created by others, I can attain them; someone who does so doesn't enter infinite wisdom.",
        "source": "T15n0626_001:0389b21_10"
    },
    {
        "source_sentence": "當念獨而無有伴。",
        "translation": "You should be mindful that you're alone and have no companion.",
        "source": "T15n0626_001:0389b23_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0389b23_12"
    },
    {
        "source_sentence": "念於一切故。",
        "translation": "It's because he's mindful of everything.",
        "source": "T15n0626_001:0389b23_13"
    },
    {
        "source_sentence": "諸不辦者我當辦之，須臾精進不以懈怠，欲教一切。",
        "translation": "Those who aren't prepared will be prepared, and I will prepare them, exerting myself for a moment without laziness to teach them all.",
        "source": "T15n0626_001:0389b24_0"
    },
    {
        "source_sentence": "作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0389b25_1"
    },
    {
        "source_sentence": "持行如地菩薩言：「譬若如地，一切草木藥舍宅城郭，無不因地而住者，",
        "translation": "The earth-like Bodhisattva Dharaṇiṣṭika said, Suppose it's like the ground, where there are all the plants, trees, herbs, homes, and castles, and there's no one who doesn't live because of the earth.",
        "source": "T15n0626_001:0389b25_2"
    },
    {
        "source_sentence": "地亦無所置。",
        "translation": "There's nothing to place on the ground either.",
        "source": "T15n0626_001:0389b27_3"
    },
    {
        "source_sentence": "一切仰而得活，亦不以為煩荷。",
        "translation": "All of them look up and attain their livelihood, and they don't think it's a burden.",
        "source": "T15n0626_001:0389b27_4"
    },
    {
        "source_sentence": "菩薩者亦當如是持心，當若地亦不喜怒持心，當令一切各各得其所，亦不念還復。",
        "translation": "A bodhisattva should also thus maintain his mind, and if the ground doesn't like or angrily maintain his mind, he will cause each of them to attain their own place and not think about it again.",
        "source": "T15n0626_001:0389b28_5"
    },
    {
        "source_sentence": "其作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0389c01_6"
    },
    {
        "source_sentence": "寶願菩薩言：「當持心如尊不自卑，於夢中亦無二心。",
        "translation": "The Jeweled Vow Bodhisattva said, You should maintain your mind as an honored one and not despise yourself, and there are no two minds in a dream.",
        "source": "T15n0626_001:0389c01_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0389c02_8"
    },
    {
        "source_sentence": "無羅漢、辟支佛意。",
        "translation": "They don't have the minds of arhats or pratyekabuddhas.",
        "source": "T15n0626_001:0389c03_9"
    },
    {
        "source_sentence": "其所作者，譬若如寶不離菩薩，若不失一切人心，於珍寶心無所貪惜，",
        "translation": "Its author is like a jewel that doesn’t part from the enlightening being, and if it doesn’t lose all his minds, he has no desire for jewels or treasures.",
        "source": "T15n0626_001:0389c03_10"
    },
    {
        "source_sentence": "其從索者皆開導為摩訶衍。",
        "translation": "Those who ask for it are all enlightened and guided to Mahāyāna.",
        "source": "T15n0626_001:0389c05_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0389c05_12"
    },
    {
        "source_sentence": "無心與心等者，無心慧與是心慧等者，亦無所增無所減，其心無所貪惜。",
        "translation": "“The absence of awarenesses is equal to awarenesses”: The absence of awarenesses, wisdom and such [things] as awarenesses”*”’; the absence of awarenesses and so on regarding these awarenesses and wisdom”, neither increases nor decreases. These awarenesses do not cherish anything.",
        "source": "T15n0626_001:0389c05_13"
    },
    {
        "source_sentence": "作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0389c07_14"
    },
    {
        "source_sentence": "寶印手菩薩言：「視五道生死人譬如墮海，菩薩若心而愍念之，當以手授之。",
        "translation": "The Jeweled Seal-Armed Bodhisattva said, Looking at the five destinies of birth and death like falling into the ocean, the bodhisattva is mindful of them with compassion, and he'll give them to them with his hand.",
        "source": "T15n0626_001:0389c08_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0389c09_16"
    },
    {
        "source_sentence": "為無黠者作黠首，其貪者為作無所惜首，其不持戒者為作戒首，其瞋怒者為作忍辱首，",
        "translation": "Those who are not clever make the chief of intelligence, those who are greedy make the chief of nothingness, those who do not keep the precepts make the chief of morality, and those who are angry make the chief of tolerance.",
        "source": "T15n0626_001:0389c10_17"
    },
    {
        "source_sentence": "其懈怠者為作精進首，其亂意者為作一心首，其無慧者為作智慧首，其無功德者為作功德首，",
        "translation": "Those who are lazy become leaders of effort, those whose minds are disturbed become leaders of concentration, those without wisdom become leaders of knowledge, and those without virtue become leaders of virtue.",
        "source": "T15n0626_001:0389c12_18"
    },
    {
        "source_sentence": "以功德首印三法寶。",
        "translation": "He uses the three treasures of the Dharma with the seal of the head of merit.",
        "source": "T15n0626_001:0389c14_19"
    },
    {
        "source_sentence": "何謂三？",
        "translation": "What are these three?",
        "source": "T15n0626_001:0389c14_20"
    },
    {
        "source_sentence": "令一切具足佛智慧教化而造作，自解其身珍寶功德，念一切諸法譬如空，",
        "translation": "They cause all to be endowed with buddha-knowledge and develop it. Understanding for themselves the jeweled virtues of their bodies, they think all things are like space.",
        "source": "T15n0626_001:0389c14_21"
    },
    {
        "source_sentence": "是故為法寶之首，是為三。",
        "translation": "Therefore, it's the first of the treasures of the Dharma, and these are the three.",
        "source": "T15n0626_001:0389c16_22"
    },
    {
        "source_sentence": "其作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0389c17_23"
    },
    {
        "source_sentence": "師子意菩薩言：「其身作是僧那者，無所恐懼亦不畏，亦不却亦不解衣，",
        "translation": "The bodhisattva Siṃhamati Bodhisattva said, “Those who do so are not afraid or frightened, and they don’t retreat or unbutton their robes.",
        "source": "T15n0626_001:0389c17_24"
    },
    {
        "source_sentence": "毛不復起。",
        "translation": "The hair doesn't grow again.",
        "source": "T15n0626_001:0389c19_25"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0389c19_26"
    },
    {
        "source_sentence": "於生死無有惡故。",
        "translation": "It's because there's no evil in birth-and-death.",
        "source": "T15n0626_001:0389c19_27"
    },
    {
        "source_sentence": "亦不作於泥洹，等住於苦樂不作二心。",
        "translation": "They don't do nirvāṇa, and they equally abide in suffering and pleasure without two minds.",
        "source": "T15n0626_001:0389c20_28"
    },
    {
        "source_sentence": "作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0389c21_29"
    },
    {
        "source_sentence": "師子步過無懼菩薩言：「其弱劣者不能逮此，是者大士之所作。",
        "translation": "The lion steps past the fearless bodhisattva and says, Those who are weak won't be able to catch it; this is what the great man does.",
        "source": "T15n0626_001:0389c21_30"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0389c23_0"
    },
    {
        "source_sentence": "以捨眾惡、以不諛諂、以應質朴，則不貢高、無瞋恚之心，所作不從非法。",
        "translation": "Because they abandon all evils, don't flatter and flatter others, and respond with simplicity, they don't become arrogant or angry, and their actions don't follow what's unlawful.",
        "source": "T15n0626_001:0389c23_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0389c24_2"
    },
    {
        "source_sentence": "用忠政故則無婬嫉，以無惡心其愚癡若冥，以無此者其身口意以平等，",
        "translation": "Because of their loyalty and governance they have no anger or jealousy. With a mind free from evil, they are like the darkness of ignorance; because they lack it, their bodies, speech, and thought are equal.",
        "source": "T15n0626_001:0389c25_3"
    },
    {
        "source_sentence": "所語如語不失其意，甚尊所作欲成。",
        "translation": "What he says is like words that don't lose their meaning, and what the Most Honorable One does is intended to be done.",
        "source": "T15n0626_001:0389c26_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0389c27_5"
    },
    {
        "source_sentence": "用至誠故俱以法自娛樂。",
        "translation": "Because they use their utmost sincerity, they both amuse themselves with the Dharma.",
        "source": "T15n0626_001:0389c27_6"
    },
    {
        "source_sentence": "以如法者不貪惜壽命。",
        "translation": "It's because someone who follows the Dharma doesn't crave life.",
        "source": "T15n0626_001:0389c28_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0389c29_8"
    },
    {
        "source_sentence": "不貪軀命、不捨一切故。",
        "translation": "It's because they don't crave body and life and don't abandon everything.",
        "source": "T15n0626_001:0389c29_9"
    },
    {
        "source_sentence": "所施與無所貪惜，欲令人得其所故。",
        "translation": "They give and don't crave anything because they want to get something.",
        "source": "T15n0626_001:0389c29_10"
    },
    {
        "source_sentence": "所入者正則非邪道。",
        "translation": "What's entered is right, and what's entered isn't a wrong path.",
        "source": "T15n0626_001:0390a01_11"
    },
    {
        "source_sentence": "其貧者為作珍寶藏，其有病者則為作醫，其恐懼者則為作護，其劣者則為作道地，",
        "translation": "The poor become treasure treasuries, the sick become physicians, the fearless become protectors, and the helpless become teachers of enlightenment.",
        "source": "T15n0626_001:0390a02_12"
    },
    {
        "source_sentence": "其入邪者則為作政導，其無智者則為作智，一切諸順何所恨起意。",
        "translation": "Those who enter wrong paths are made to be guided by government, those who lack knowledge are made to become wise, and what's the point of resenting all compliant minds that arise?",
        "source": "T15n0626_001:0390a04_0"
    },
    {
        "source_sentence": "大士以度脫此中忍，所受法本如住。",
        "translation": "Because the great man has liberated himself from this forbearance, the Dharma that he receives is originally like abiding.",
        "source": "T15n0626_001:0390a05_1"
    },
    {
        "source_sentence": "作是者乃至無極慧。」",
        "translation": "Doing so, it's up to the point where there's infinite wisdom.",
        "source": "T15n0626_001:0390a06_2"
    },
    {
        "source_sentence": "紫磨金色菩薩言：「所念譬如空。",
        "translation": "The purple-colored bodhisattva said, What's thought of is like space.",
        "source": "T15n0626_001:0390a06_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390a07_4"
    },
    {
        "source_sentence": "無所不遍。",
        "translation": "Nothing doesn't pervade it.",
        "source": "T15n0626_001:0390a07_5"
    },
    {
        "source_sentence": "以大哀無所不覆，其心常喜面頰而悅，諸所欲樂者其心不在其中，所施與譬如天無所不蔽，",
        "translation": "Their great compassion is unobstructed by anything, and their hearts always rejoice with joy. Their minds are not attached to pleasures or desires, and whatever they give, just as gods don’t obstruct them at all.",
        "source": "T15n0626_001:0390a08_0"
    },
    {
        "source_sentence": "其戒、忍辱、精進、一心、智慧亦復如是。",
        "translation": "So it is with their precepts, forbearance, humility, effort, unity of mind, and wisdom.",
        "source": "T15n0626_001:0390a10_1"
    },
    {
        "source_sentence": "作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0390a11_2"
    },
    {
        "source_sentence": "發意即轉法輪菩薩言：「其有新發意者，不當令魔得其便，不失諸佛天神意，",
        "translation": "The enthusiastic bodhisattva Dharma-wheel-Turning Bodhisattva said, Those who have newly awakened the aspiration should not allow Māra to get an advantage over them or lose the minds of the buddhas and gods.",
        "source": "T15n0626_001:0390a11_3"
    },
    {
        "source_sentence": "作心住者以應法輪轉。",
        "translation": "Those who make mental abodes abide by responding to the Dharma wheel of transmigration.",
        "source": "T15n0626_001:0390a13_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390a13_5"
    },
    {
        "source_sentence": "用發好心故。",
        "translation": "It's because they use it to give rise to good intentions.",
        "source": "T15n0626_001:0390a14_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390a14_1"
    },
    {
        "source_sentence": "一切諸法無所生。",
        "translation": "All dharmas are unarisen.",
        "source": "T15n0626_001:0390a14_2"
    },
    {
        "source_sentence": "其作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0390a14_3"
    },
    {
        "source_sentence": "諸語自然普無不入菩薩言：「當持心無所不入。",
        "translation": "The words naturally and universally don't enter, the bodhisattva says, There's nothing that doesn't enter when you maintain your mind.",
        "source": "T15n0626_001:0390a15_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390a16_5"
    },
    {
        "source_sentence": "諸法自然其本悉空，一切所語皆空，譬若虛空無所不入。",
        "translation": "All dharmas are naturally inherently empty, and all that's said is empty, like space where nothing doesn't enter.",
        "source": "T15n0626_001:0390a16_6"
    },
    {
        "source_sentence": "菩薩者當復如是，其心無所不入，有所作如語，其智無所不曉。",
        "translation": "A bodhisattva should also be like this: his mind has nothing that he doesn't enter, does what he says, and knows nothing that he doesn't understand.",
        "source": "T15n0626_001:0390a18_0"
    },
    {
        "source_sentence": "其作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0390a19_1"
    },
    {
        "source_sentence": "樂不動菩薩言：「諸所有音無有音，諸所有聲而不可得，以知是者亦不以喜、亦不以憂、亦不懈怠。",
        "translation": "The Joyful Immutable Bodhisattva said, All sounds have no sound, and all sounds are unobtainable; knowing this is so, he doesn't rejoice, grieve, or become lazy.",
        "source": "T15n0626_001:0390a19_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390a22_3"
    },
    {
        "source_sentence": "譬若泰山而得風亦無所動。",
        "translation": "It's like when Mount Tai gets wind and doesn't move anything.",
        "source": "T15n0626_001:0390a22_4"
    },
    {
        "source_sentence": "諸好音惡音，菩薩心亦不以喜歡、亦不以憂慼。",
        "translation": "The bodhisattva's mind doesn't like or grieve for the sounds of good and bad sounds.",
        "source": "T15n0626_001:0390a23_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390a24_1"
    },
    {
        "source_sentence": "無所著。",
        "translation": "There's nothing to attach to.",
        "source": "T15n0626_001:0390a24_2"
    },
    {
        "source_sentence": "無所著謂佛語。",
        "translation": "Nothing is attached, which is called the Buddha's words.",
        "source": "T15n0626_001:0390a24_3"
    },
    {
        "source_sentence": "若異道語俱空無所有，視諸欲有所作者皆有盡，以知盡而不貢高。",
        "translation": "If the words of non-Buddhists say that both emptiness and existence lack existence, they look at all the authors of desires and have an end to them because they know they're ended and don't become arrogant.",
        "source": "T15n0626_001:0390a24_4"
    },
    {
        "source_sentence": "作是法者疾成至佛。」",
        "translation": "Those who do this will quickly become buddhas.",
        "source": "T15n0626_001:0390a26_5"
    },
    {
        "source_sentence": "海意菩薩言：「其心當如海所受，慧而無極。",
        "translation": "The sea-mind bodhisattva said, That mind should be like the ocean that's received, and its wisdom is limitless.",
        "source": "T15n0626_001:0390a26_6"
    },
    {
        "source_sentence": "譬如海，受於眾流合為一味。",
        "translation": "It's like an ocean that receives the many streams and combines them into one flavor.",
        "source": "T15n0626_001:0390a27_7"
    },
    {
        "source_sentence": "菩薩以諸所有合為一法。",
        "translation": "A bodhisattva combines all that exists into one thing.",
        "source": "T15n0626_001:0390a28_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390a29_9"
    },
    {
        "source_sentence": "用微妙故。",
        "translation": "It's because its function is subtle.",
        "source": "T15n0626_001:0390a29_10"
    },
    {
        "source_sentence": "不與十二因緣有所變，念法身亦不增亦不減，為一切作功德。",
        "translation": "It doesn't change with the twelve causes and conditions, and mindfulness of the Dharma body doesn't increase or decrease, which creates merit for all.",
        "source": "T15n0626_001:0390a29_11"
    },
    {
        "source_sentence": "所作功德欲令一切皆得，是為不可盡功德。",
        "translation": "The merit of doing so and wanting to cause all to attain it is an inexhaustible virtue.",
        "source": "T15n0626_001:0390b02_0"
    },
    {
        "source_sentence": "當護不著不斷，以意力制身，諸所有所作皆等無有異。",
        "translation": "They should guard themselves without attachment and not stop it, restrain their bodies with the power of thought, and do whatever they do without distinction.",
        "source": "T15n0626_001:0390b03_0"
    },
    {
        "source_sentence": "作是故發意慧者，具足可至無極慧。」",
        "translation": "Because of this, someone who arouses the wisdom of intention is fully endowed with the infinite wisdom that can be attained.",
        "source": "T15n0626_001:0390b04_1"
    },
    {
        "source_sentence": "大光明菩薩言：「當持心，其智慧、其光明如佛，非俗人之所作，其意習光明無所不照。",
        "translation": "The Mahāprajñāpāramitā Bodhisattva said, You should maintain the mind that its wisdom and light are like buddhas, not created by worldly people, and that there's nothing in their mind that isn't illuminated by the light of their cultivation.",
        "source": "T15n0626_001:0390b05_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390b07_0"
    },
    {
        "source_sentence": "欲令世間知以為法，則其意習施與光明無所不照，習戒光明無所不照，",
        "translation": "Those who want to cause the world to know this teaching, their minds cultivate generosity and light without fail, and those who cultivate morality without fail illuminate nothing.",
        "source": "T15n0626_001:0390b07_1"
    },
    {
        "source_sentence": "忍辱、精進、一心、智慧悉習，其光明無所不照。",
        "translation": "Tolerance, effort, singlemindedness of mind, and wisdom are all cultivated, and their light shines without fail.",
        "source": "T15n0626_001:0390b08_2"
    },
    {
        "source_sentence": "作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0390b09_3"
    },
    {
        "source_sentence": "焰明菩薩言：「以功德慧心為眼，清淨所視色無有惡，聲、香、味、細滑、法亦復如是，",
        "translation": "Yamântaka Bodhisattva said, With the mind of merit and wisdom as its eye, purely perceiving form without any evil, sounds, smells, tastes, subtleties, and dharmas are likewise.",
        "source": "T15n0626_001:0390b10_4"
    },
    {
        "source_sentence": "以淨於六事。",
        "translation": "It's because they purify the six things.",
        "source": "T15n0626_001:0390b12_5"
    },
    {
        "source_sentence": "何謂六？",
        "translation": "What are the six?",
        "source": "T15n0626_001:0390b12_6"
    },
    {
        "source_sentence": "眼、耳、鼻、口、身、意。",
        "translation": "Eyes, ears, nose, mouth, body, and mind.",
        "source": "T15n0626_001:0390b12_7"
    },
    {
        "source_sentence": "諸所可者不那中作樂，用心淨故。",
        "translation": "What's permissible is to create happiness in non-nas, because the mind is pure.",
        "source": "T15n0626_001:0390b13_0"
    },
    {
        "source_sentence": "所視人欲令悉入佛法，其不正者以法率化，所有好物人來索之無所愛惜，",
        "translation": "He wanted to cause those who did not follow the right path to enter into the buddha-dharma, but he led and inspired those who did not follow the right path by means of the Dharma. All kinds of good things came to ask him for his help, and no one cherished them.",
        "source": "T15n0626_001:0390b13_1"
    },
    {
        "source_sentence": "既與不從後悔。",
        "translation": "Since he didn't follow it, he regretted.",
        "source": "T15n0626_001:0390b15_2"
    },
    {
        "source_sentence": "作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0390b15_3"
    },
    {
        "source_sentence": "可意王菩薩言：「其有罵詈撾捶者亦不瞋恚，但念其法。",
        "translation": "The agreeable king bodhisattva said, Those who are scolded and beaten don't become angry, but simply think of their teaching.",
        "source": "T15n0626_001:0390b16_4"
    },
    {
        "source_sentence": "以何念法？",
        "translation": "What's the method of mindfulness?",
        "source": "T15n0626_001:0390b17_5"
    },
    {
        "source_sentence": "何所罵者？",
        "translation": "What's being scolded?",
        "source": "T15n0626_001:0390b17_6"
    },
    {
        "source_sentence": "何所瞋者？",
        "translation": "What's anger?",
        "source": "T15n0626_001:0390b18_0"
    },
    {
        "source_sentence": "其撾捶亦爾。",
        "translation": "It's likewise with his wailing and beating.",
        "source": "T15n0626_001:0390b18_1"
    },
    {
        "source_sentence": "以內空無所得，於外空無所疑，身於身無所見，亦不見於他人。",
        "translation": "Because internal emptiness has no attainment, there's no doubt about external emptiness, and the body doesn't see anything in the body, and it doesn't see others.",
        "source": "T15n0626_001:0390b18_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390b20_0"
    },
    {
        "source_sentence": "其索手脚者歡喜與之，其欲取頭者其心倍悅，若索城及珍寶，其有索者無所貪惜，",
        "translation": "Those who ask for their hands and feet will be delighted and give them to him, and those who want to take the heads of those whose heads are taken will become doubly happy. If they ask for the cities and other treasures, he or she will have no desire to cherish anything.",
        "source": "T15n0626_001:0390b20_1"
    },
    {
        "source_sentence": "其求妻子即持施與無有異心。",
        "translation": "He asks for his wife, that's to say, he maintains generosity and has no different mind.",
        "source": "T15n0626_001:0390b22_2"
    },
    {
        "source_sentence": "若諷誦起是經得一章歡喜，不樂為金輪王歡樂，為一切人說法而不作釋，",
        "translation": "If he recites this scripture and gives rise to a single chapter of it, he’s delighted, doesn’t delight in the king of the golden wheel, and explains it for all people without interpreting it.",
        "source": "T15n0626_001:0390b22_3"
    },
    {
        "source_sentence": "願樂造一人發心為菩薩，不作梵天願樂見佛，不貪三千大千剎土之珍寶。",
        "translation": "They wish to create one person who arouses the intention to become a bodhisattva, not Brahmā, wish to see the Buddha, and don't crave the treasures of 3,000 great thousand buddha-lands.",
        "source": "T15n0626_001:0390b24_4"
    },
    {
        "source_sentence": "作是者常無懈怠，如是歡喜可至無極慧。」",
        "translation": "Those who do so always have no laziness, and thus rejoicing can lead to the supreme wisdom.",
        "source": "T15n0626_001:0390b26_5"
    },
    {
        "source_sentence": "所視無底菩薩言：「視一切諸所有，不念是我所。",
        "translation": "The bottomless bodhisattva who looked at it said, Look at all the things that exist, and don't think of them as mine.",
        "source": "T15n0626_001:0390b27_6"
    },
    {
        "source_sentence": "悉清淨剎土，不念有與無。",
        "translation": "They are all pure buddha-lands, not mindful of existence or nonexistence.",
        "source": "T15n0626_001:0390b28_7"
    },
    {
        "source_sentence": "見諸佛不想色求。",
        "translation": "Seeing the buddhas, they don't want form and seek form.",
        "source": "T15n0626_001:0390b28_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390b29_9"
    },
    {
        "source_sentence": "用法身故。",
        "translation": "It's because they use the Dharma body.",
        "source": "T15n0626_001:0390b29_10"
    },
    {
        "source_sentence": "視一切人心，不求一切人之所有。",
        "translation": "They look at all people's minds and don't seek the possessions of all people.",
        "source": "T15n0626_001:0390b29_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390c01_12"
    },
    {
        "source_sentence": "其德眼逮得清淨，便有道眼神足備具。",
        "translation": "When his virtuous eye attains purity, he's endowed with the miraculous ability to have the divine eye of the path.",
        "source": "T15n0626_001:0390c01_13"
    },
    {
        "source_sentence": "以得慧眼便知所有無所可貪，便得佛眼，十八法悉具。",
        "translation": "By attaining the eye of wisdom, they'll know that there's nothing to crave, and then they'll attain the Buddha's eye, which is fully endowed with 18 dharmas.",
        "source": "T15n0626_001:0390c02_14"
    },
    {
        "source_sentence": "以得法眼者具足十種力，其作如僧那僧涅者便至無極慧。」",
        "translation": "Because someone who has attained the Dharma eye is endowed with ten kinds of powers, and someone who does so like Saṃnas or Saṃdhinirvāṇa will then attain infinite wisdom.",
        "source": "T15n0626_001:0390c03_15"
    },
    {
        "source_sentence": "作無底行菩薩言：「一切所作如薩芸若所作。",
        "translation": "The bodhisattva who did the bottomless practice said, All that's done is like what a buddha does.",
        "source": "T15n0626_001:0390c05_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0626_001:0390c06_17"
    },
    {
        "source_sentence": "無所住故，以無所住但念諸法。",
        "translation": "Because there's nothing to abide in, it's because there's nothing to abide in but mindfulness of dharmas.",
        "source": "T15n0626_001:0390c06_18"
    },
    {
        "source_sentence": "菩薩作是者不以諸順，何為墮？",
        "translation": "If a bodhisattva does so, what's the point of falling into it if he doesn't comply with them?",
        "source": "T15n0626_001:0390c07_19"
    },
    {
        "source_sentence": "亦不以罪墮，亦不以魔事墮。",
        "translation": "They don't fall because of sins, and they don't fall because of demonic actions.",
        "source": "T15n0626_001:0390c07_20"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390c08_21"
    },
    {
        "source_sentence": "不捨法故、不犯非法以故致是，以度罪所作魔事。",
        "translation": "It's because they don't abandon the teaching and don't violate what's unlawful that they cause this, and it's because they do demonic acts to save them from sin.",
        "source": "T15n0626_001:0390c08_22"
    },
    {
        "source_sentence": "以應是者可至無極慧。」",
        "translation": "It's because someone who responds to this can attain the supreme wisdom.",
        "source": "T15n0626_001:0390c09_23"
    },
    {
        "source_sentence": "說息愛意菩薩言：「一切所有者亦不從人受，以所作便唵嗒諸魔。",
        "translation": "He spoke to the Bodhisattva of Cessation of Desire, saying, All owners don't accept it from others, and because they do so, they will cause the Māras to be deceived.",
        "source": "T15n0626_001:0390c10_24"
    },
    {
        "source_sentence": "以自知者無所有亦無所復作，以知無所復作便制五陰，以知五陰者無有魔事，",
        "translation": "Knowing for themselves that there is nothing to be done and nothing further to be done, they restrain the five aggregates by knowing that there is nothing more to be done. And because they know these five aggregates have no demonic activity,",
        "source": "T15n0626_001:0390c11_25"
    },
    {
        "source_sentence": "以度魔界者所作中道無所覆蔽，已度無所覆蔽菩薩摩訶薩作是者可至無極慧。」",
        "translation": "Because the middle way created by someone who has crossed over to the demonic realm is unobstructed, the bodhisattva Mahāsattva who has crossed over to the unobstructed path and done so can attain infinite wisdom.",
        "source": "T15n0626_001:0390c13_26"
    },
    {
        "source_sentence": "所起即悔菩薩言：「諸所作非法意而悔之，所作如法其心無異。",
        "translation": "The repentance bodhisattva who arose then said, What's done with unlawful intentions is regretted, and what's done according to the teaching is no different in mind.",
        "source": "T15n0626_001:0390c15_27"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0390c17_28"
    },
    {
        "source_sentence": "常當專心作善，其身有所作，不欲令人不可。",
        "translation": "He should always concentrate his mind on doing good, and whatever he does with his body, he doesn't want to make it unwholesome.",
        "source": "T15n0626_001:0390c17_29"
    },
    {
        "source_sentence": "若口若意所作，不欲令人有不可。",
        "translation": "Whatever he does with his mouth or mind, he doesn't want to make it unacceptable.",
        "source": "T15n0626_001:0390c18_30"
    },
    {
        "source_sentence": "其有愁憂者，以法寬大令不愁憂。",
        "translation": "Those who are grieved will use the Dharma to be generous and cause them not to grieve.",
        "source": "T15n0626_001:0390c19_31"
    },
    {
        "source_sentence": "作是者是為菩薩摩訶薩，可至無極慧。」",
        "translation": "Doing so is a bodhisattva-mahāsattva who can attain the supreme wisdom.",
        "source": "T15n0626_001:0390c19_32"
    },
    {
        "source_sentence": "得一切願菩薩言：「其有如淨戒者所願必得，以如淨戒者不復犯俗，不犯俗者以應三十七品根林如薩芸若。",
        "translation": "Attained by All Vows, the bodhisattva said, If there's such a person who follows the pure precepts, what he wishes will surely be attained, and because he follows the pure precepts, he won't again violate the conventional, and if he doesn't violate the conventional, he'll use the thirty-seven se",
        "source": "T15n0626_001:0390c20_33"
    },
    {
        "source_sentence": "其以如淨戒者不犯三十七品。",
        "translation": "It's because someone who follows the pure precepts doesn't violate the thirty-seven classes.",
        "source": "T15n0626_001:0390c23_34"
    },
    {
        "source_sentence": "是為菩薩摩訶薩所作以至無極慧。」",
        "translation": "This is what the bodhisattva Mahāsattva does up to the point of infinite wisdom.",
        "source": "T15n0626_001:0390c23_35"
    },
    {
        "source_sentence": "普等華天子言：「譬若樹有華，其見莫不歡喜，所作功德一切莫不蒙者。",
        "translation": "The Samantabhadra Devānām-Indra said, Suppose a tree has flowers, and none of them rejoice when they see them, and all the merits they create are not unobtainable.",
        "source": "T15n0626_001:0390c24_36"
    },
    {
        "source_sentence": "譬若忉利天上拘耆樹，而有華熾盛，諸天莫不愛樂。",
        "translation": "It's like the Kukkuṭika tree in the Heaven of the Thirty-three Gods, where there are abundant flowers and all the gods delight in them.",
        "source": "T15n0626_001:0390c26_37"
    },
    {
        "source_sentence": "菩薩以法為一切作眼，譬若華，若天上摩尼之寶而無瑕穢。",
        "translation": "The bodhisattva creates an eye for all things with the Dharma, which is like a flower or a heavenly maṇi treasure that's without blemish.",
        "source": "T15n0626_001:0390c27_38"
    },
    {
        "source_sentence": "菩薩清淨其心如是，其作是者可至無極慧。」",
        "translation": "The bodhisattva purifies his mind like this, and those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0390c28_39"
    },
    {
        "source_sentence": "光明華天子言：「譬若如日出，眾冥索盡，所有諸色悉見。",
        "translation": "The Flower of Light celestial Son said, Suppose it's like when the sun rises and all mysterious cravings are exhausted, and all forms are fully visible.",
        "source": "T15n0626_001:0391a01_0"
    },
    {
        "source_sentence": "菩薩以智慧無所不照，其諸愚癡冥盡索為開闢。",
        "translation": "Because there's nothing that the bodhisattva doesn't illuminate with wisdom, his folly and delusion are mysteriously exhausted as a way to uncover it.",
        "source": "T15n0626_001:0391a02_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0391a03_2"
    },
    {
        "source_sentence": "終不而當明故。",
        "translation": "It's because it will never be explained.",
        "source": "T15n0626_001:0391a03_3"
    },
    {
        "source_sentence": "其在冥者，見明便得道徑。",
        "translation": "If he's in the darkness, he'll see the light and then attain the path.",
        "source": "T15n0626_001:0391a03_4"
    },
    {
        "source_sentence": "菩薩以住道徑者，其忘失道徑者指示道路。",
        "translation": "A bodhisattva who abides on the pathway and forgets the pathway will be shown the path.",
        "source": "T15n0626_001:0391a04_5"
    },
    {
        "source_sentence": "以如是者可至無極慧。」",
        "translation": "Because it's like this, they can attain the supreme wisdom.",
        "source": "T15n0626_001:0391a05_6"
    },
    {
        "source_sentence": "天香華天子言：「譬如漫陀羅華，其香聞縱廣上下四維各四十里。",
        "translation": "The goddess of divine fragrance and flowers said, Suppose it's like the maṇḍala flower whose fragrance is heard forty miles up and down in the four directions.",
        "source": "T15n0626_001:0391a06_7"
    },
    {
        "source_sentence": "菩薩以所聞淨戒、三昧、持智慧以為香，三千大千無不聞者。",
        "translation": "The bodhisattva uses the pure precepts, samādhi, and wisdom that he hears as his fragrance, and there's nothing in 3,000 great one-thousand who doesn't hear it.",
        "source": "T15n0626_001:0391a07_8"
    },
    {
        "source_sentence": "是香愈無央數人病，其以所聞淨戒、三昧、智慧。",
        "translation": "This fragrance will heal the illnesses of an infinite number of people, and they'll hear pure precepts, samādhi, and wisdom based on what they've heard.",
        "source": "T15n0626_001:0391a09_0"
    },
    {
        "source_sentence": "菩薩以住是者便至無極慧。」",
        "translation": "If a bodhisattva abides in this, then he'll attain the supreme wisdom.",
        "source": "T15n0626_001:0391a10_1"
    },
    {
        "source_sentence": "信法行得天子言：「當住法當所作者，以如菩薩法者常不復懈怠，無所復懈無復念，",
        "translation": "The goddess who believed in the practice of the Dharma said to the celestial being, You should abide in the teaching and be the author of it. Because you follow the way of the bodhisattva’s teaching, you will never again become lazy; there is no more laziness or thoughtlessness.",
        "source": "T15n0626_001:0391a10_2"
    },
    {
        "source_sentence": "便當得十事：習六波羅蜜，以四等心、五句、四事，總三脫忍辱利令人發意，",
        "translation": "They will then attain ten things: they will cultivate the six transcendent ways, using the four equal states of mind, five phrases, and four things to summarize the three kinds of liberation, tolerating humility, benefiting, and causing others to give rise to aspirations.",
        "source": "T15n0626_001:0391a12_3"
    },
    {
        "source_sentence": "其身不離，以漚和拘舍羅教，悉持諸法要，所信無有異，是為十事。",
        "translation": "These are the ten things by which a bhikṣu maintains his or her firmly planted faith in the essentials of the doctrine and upholds them.",
        "source": "T15n0626_001:0391a14_4"
    },
    {
        "source_sentence": "其作是者可至無極慧。」",
        "translation": "Those who do so can attain the supreme wisdom.",
        "source": "T15n0626_001:0391a15_5"
    },
    {
        "source_sentence": "文殊師利謂諸上人及諸天子：「菩薩住無所住。",
        "translation": "Mañjuśrī said to the higher people and celestial beings, A bodhisattva abides without anything to abide.",
        "source": "T15n0626_001:0391a16_6"
    },
    {
        "source_sentence": "何謂住無所住？",
        "translation": "What's meant by abiding and not abiding?",
        "source": "T15n0626_001:0391a17_7"
    },
    {
        "source_sentence": "於三界不以三界作習，不習者是為內，亦不求習者是為外。",
        "translation": "Those who don't cultivate it are internal, and those who don't seek to cultivate it are external.",
        "source": "T15n0626_001:0391a17_8"
    },
    {
        "source_sentence": "雖外不墮弟子無所習，復不墮辟支佛地。",
        "translation": "Even though they don't fall outside, the disciples have nothing to cultivate, and they don't fall into the status of a pratyekabuddha.",
        "source": "T15n0626_001:0391a19_9"
    },
    {
        "source_sentence": "習謂生死，所學習謂無所知。",
        "translation": "Conditioning refers to birth and death; what is practised means not knowing anything.",
        "source": "T15n0626_001:0391a20_10"
    },
    {
        "source_sentence": "習者是為名，所學習是為色。",
        "translation": "Conditioning is the name; what is to be conditioned is form.",
        "source": "T15n0626_001:0391a20_11"
    },
    {
        "source_sentence": "習者是因緣，所學習謂有所見。",
        "translation": "Accumulation is the condition as cause: what is to be practised means that there is vision.",
        "source": "T15n0626_001:0391a21_12"
    },
    {
        "source_sentence": "習者謂愛，所學習謂有所根。",
        "translation": "Conditioning refers to craving, and what is conditioned means having some faculties.",
        "source": "T15n0626_001:0391a22_13"
    },
    {
        "source_sentence": "習者謂我，所學習謂非我。",
        "translation": "Conditioning refers to self. That which is conditioned means self, and that which is conditioned means not self.",
        "source": "T15n0626_001:0391a22_14"
    },
    {
        "source_sentence": "習者貪，所學習所施與無有異。",
        "translation": "Conditioned is greed. There is no difference between that which is to be practised and that which is given.",
        "source": "T15n0626_001:0391a23_15"
    },
    {
        "source_sentence": "習者謂犯戒，所學習謂不於戒自貢高。",
        "translation": "Conditioning refers to violating the precepts. That which is practised means not being self-exalted in respect for the precepts.",
        "source": "T15n0626_001:0391a24_16"
    },
    {
        "source_sentence": "習者謂瞋怒，所學習忍辱而不貢高。",
        "translation": "Conditioning refers to anger and anger, which are cultivated with patience and without pride.",
        "source": "T15n0626_001:0391a25_17"
    },
    {
        "source_sentence": "習者無精進，所學習精進而不自貢高。",
        "translation": "Those who are accustomed don't have energy, and those who cultivate it don't pride themselves in their effort.",
        "source": "T15n0626_001:0391a25_18"
    },
    {
        "source_sentence": "習者謂亂意，所學習為一心而不自貢高。",
        "translation": "Conditioning refers to the mind that's disturbed, and what's cultivated is singleminded and not self-exalted.",
        "source": "T15n0626_001:0391a26_19"
    },
    {
        "source_sentence": "習者謂無知，所學習智慧不貢高。",
        "translation": "Conditioning refers to the absence of knowledge, and the wisdom that's cultivated doesn't become arrogant.",
        "source": "T15n0626_001:0391a27_20"
    },
    {
        "source_sentence": "習者謂無功德，所學習謂作功德而不貢高。",
        "translation": "Conditioning refers to the absence of virtue. That which is practised means that one produces virtue but does not act arrogantly.",
        "source": "T15n0626_001:0391a28_21"
    },
    {
        "source_sentence": "習者謂俗法，所學習謂道法不自貢高。",
        "translation": "Conditioning refers to worldly dharmas, and what is studied means the path and dharmas that are not self-exalted.",
        "source": "T15n0626_001:0391a29_22"
    },
    {
        "source_sentence": "習者謂無脫，所學習謂得脫而具足不貢高。",
        "translation": "Conditioned refers to the absence of liberation. That which is practised means that one acquires liberation and is endowed with it without pride.",
        "source": "T15n0626_001:0391b01_23"
    },
    {
        "source_sentence": "習者謂有罪，所學習無有罪亦不貢高。",
        "translation": "Conditioned refers to what's sinful, and what's cultivated is blameless and doesn't become arrogant.",
        "source": "T15n0626_001:0391b02_24"
    },
    {
        "source_sentence": "習者謂有餘，所學習無有餘盡亦不貢高。",
        "translation": "Conditioning refers to the absence of remainder. There is nothing left to be studied, and there is no exalted or overweening in terms of arrogance.",
        "source": "T15n0626_001:0391b03_25"
    },
    {
        "source_sentence": "菩薩習無所習，一切護亦不著亦不斷，作是者便至無極慧。",
        "translation": "When a bodhisattva accumulates and doesn't accumulate anything, all the guards are neither attached nor unceasing, and when he does so, he reaches infinite wisdom.",
        "source": "T15n0626_001:0391b04_26"
    },
    {
        "source_sentence": "諸法一切無所得。",
        "translation": "All dharmas are ungraspable.",
        "source": "T15n0626_001:0391b05_27"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0391b06_28"
    },
    {
        "source_sentence": "無所入亦無所不入故。",
        "translation": "It's because there's nothing to enter and nothing not to enter.",
        "source": "T15n0626_001:0391b06_29"
    },
    {
        "source_sentence": "是一切智便至一切智，無所得者一切智。",
        "translation": "This omniscience then reaches omniscience, and the one who has nothing to attain is omniscience.",
        "source": "T15n0626_001:0391b06_30"
    },
    {
        "source_sentence": "得一切智不可以色計，痛、痒、思想、生死、識亦爾。",
        "translation": "Attaining omniscience can't be measured by form, and so are pain, itching, thought, birth-and-death, and consciousness.",
        "source": "T15n0626_001:0391b07_31"
    },
    {
        "source_sentence": "不從法數亦不從非法數，亦不一切智施與為數。",
        "translation": "They don't follow the number of dharmas and don't follow the number of non-dharmas, and they don't give alms with omniscience as a number.",
        "source": "T15n0626_001:0391b08_32"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0391b09_33"
    },
    {
        "source_sentence": "施與者亦不離一切智。",
        "translation": "Giving is also not free from all cognition.",
        "source": "T15n0626_001:0391b10_34"
    },
    {
        "source_sentence": "戒、忍辱、精進、一心、智慧亦不為數。",
        "translation": "Precepts, forbearance, humility, effort, unity of mind, and wisdom are also not counted.",
        "source": "T15n0626_001:0391b10_35"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0626_001:0391b11_36"
    },
    {
        "source_sentence": "一切智從智慧。",
        "translation": "All cognition follows wisdom.",
        "source": "T15n0626_001:0391b11_37"
    },
    {
        "source_sentence": "一切智者無所不入，亦不過去當來，亦不入現在。",
        "translation": "There's nothing that the omniscience person doesn't enter, neither past nor future, and neither does he enter the present.",
        "source": "T15n0626_001:0391b11_38"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0391b13_39"
    },
    {
        "source_sentence": "以過三世故。",
        "translation": "It's because it's beyond the three worlds.",
        "source": "T15n0626_001:0391b13_40"
    },
    {
        "source_sentence": "一切智者不以眼而視之，耳鼻舌身意亦爾。",
        "translation": "All wise people don't look at them with their eyes, and so are the ears, nose, tongue, body, and mind.",
        "source": "T15n0626_001:0391b13_41"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0391b14_42"
    },
    {
        "source_sentence": "以過諸界故。",
        "translation": "It's because it's beyond the realms.",
        "source": "T15n0626_001:0391b14_43"
    },
    {
        "source_sentence": "若男子女人欲求一切智者，當如一切智住。",
        "translation": "If a man or woman wants to pursue omniscience, they should thus abide in omniscience.",
        "source": "T15n0626_001:0391b15_44"
    },
    {
        "source_sentence": "當云何住？",
        "translation": "How should it be abiding?",
        "source": "T15n0626_001:0391b16_45"
    },
    {
        "source_sentence": "於諸法一切無所住，是為一切智住。",
        "translation": "The absence of anything to abide in all dharmas is the abode of omniscience.",
        "source": "T15n0626_001:0391b16_46"
    },
    {
        "source_sentence": "不自念法是我所，作是者為一切智。",
        "translation": "If someone doesn't think for themselves that the teaching is mine, doing so is omniscience.",
        "source": "T15n0626_001:0391b17_47"
    },
    {
        "source_sentence": "一切人法佛法等，如是無有異，是為一切智。",
        "translation": "All people's teachings, buddhas' teachings, and so forth are thus without distinction, which is omniscience.",
        "source": "T15n0626_001:0391b18_48"
    },
    {
        "source_sentence": "其求欲得一切智者，會從四大得。",
        "translation": "Those who seek omniscience and want to attain it will attain it from the four elements.",
        "source": "T15n0626_001:0391b19_49"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0391b19_50"
    },
    {
        "source_sentence": "為身不作身計。",
        "translation": "For the sake of body, he doesn't create conceptualizations of body.",
        "source": "T15n0626_001:0391b20_51"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0391b20_52"
    },
    {
        "source_sentence": "不以作因緣故。",
        "translation": "It's because they don't create causes and conditions.",
        "source": "T15n0626_001:0391b20_53"
    },
    {
        "source_sentence": "其有功德法無有功德法，其所有是為我所者皆非我所，我者無所生，無所生者無有計，",
        "translation": "Whatever belongs to me is not mine. The self has nothing to give rise to, and whatever comes into being has no ideation.",
        "source": "T15n0626_001:0391b21_0"
    },
    {
        "source_sentence": "其計者是為不生，其示若見者是皆無有生，以知無生無所生慧，作是等者是為薩芸若。」",
        "translation": "Those who think it doesn't arise, and those who show that whatever they see has no arising because they know there's no arising and nothing to give rise to wisdom, and those who do so are called sarvajña.",
        "source": "T15n0626_001:0391b22_1"
    },
    {
        "source_sentence": "文殊師利說是事時，二千天子悉得無所從生法忍，萬二千人悉發無上平等道意。",
        "translation": "When Mañjuśrī explained this, 2,000 celestial beings all attained the tolerance of the Dharma that arises from nothing, and 12,000 people all aroused the intention for the unsurpassed path of equality.",
        "source": "T15n0626_001:0391b24_2"
    },
    {
        "source_sentence": "樂不動菩薩謂文殊師利：「共到佛所問菩薩當云何住。」",
        "translation": "The blissful Immovable Bodhisattva said to Mañjuśrī, Together with the Buddha, they went to him and asked how the bodhisattva would abide.",
        "source": "T15n0626_001:0391b26_3"
    },
    {
        "source_sentence": "應時文殊師利化作如來在眾會中而坐，其形狀被服如釋迦文佛。",
        "translation": "It was then that Mañjuśrī transformed himself into the Tathāgata and sat in the midst of the assembly, whose shape was robed like Śākyamuni Buddha.",
        "source": "T15n0626_001:0391b28_0"
    },
    {
        "source_sentence": "文殊師利謂波坻槃拘利菩薩言：「屬之所問，今佛在是，可問菩薩住。」",
        "translation": "Mañjuśrī addressed Pāṭikāputra Kauṇḍinya Bodhisattva, saying, It's up to him to ask questions, but now that the Buddha is here, you can ask about the bodhisattva's abode.",
        "source": "T15n0626_001:0391b29_1"
    },
    {
        "source_sentence": "波坻槃拘利菩薩不知是為化佛，前長跪問：「怛薩阿竭！",
        "translation": "Knowing that this was the transformation Buddha, the Pāṭikāputra Kauṇḍinya Bodhisattva knelt down and asked, Tathāgata!",
        "source": "T15n0626_001:0391c02_2"
    },
    {
        "source_sentence": "菩薩當云何有所住？」",
        "translation": "How will the bodhisattva abide?",
        "source": "T15n0626_001:0391c03_3"
    },
    {
        "source_sentence": "化佛言：「如我所作，菩薩當如是住。」",
        "translation": "The transformation Buddha said, As I did, the bodhisattva will thus abide.",
        "source": "T15n0626_001:0391c03_4"
    },
    {
        "source_sentence": "復問：「云何如佛？」",
        "translation": "Again, he asked, How is it like the Buddha?",
        "source": "T15n0626_001:0391c04_5"
    },
    {
        "source_sentence": "其佛言：「亦不從施與，亦不從戒、忍辱、精進、一心、智慧，亦不從欲，",
        "translation": "The Buddha said, Nor does he follow generosity, nor does he follow the precepts, patience, effort, unity of mind, and wisdom, nor does he follow desire.",
        "source": "T15n0626_001:0391c05_0"
    },
    {
        "source_sentence": "亦不從色、亦不從無色，亦不從身行、亦不從口行、亦不從意行，諸所行無所著故。」",
        "translation": "They also don't follow form and formlessness, don't follow body action, don't follow mouth action, and don't follow mind action, and there's no attachment to what they do.",
        "source": "T15n0626_001:0391c06_1"
    },
    {
        "source_sentence": "其佛問波坻槃拘利：「化者而有所從行不？」",
        "translation": "The Buddha asked Pāṭikāputra Kauṇḍinya, Does the transformationer follow it?",
        "source": "T15n0626_001:0391c08_2"
    },
    {
        "source_sentence": "則答言：「無所從行。」",
        "translation": "He replied, There's nothing to follow.",
        "source": "T15n0626_001:0391c09_3"
    },
    {
        "source_sentence": "其佛言：「如化無所從行，菩薩當作是行。」",
        "translation": "The Buddha said, Just as there's nothing to follow in transformation, so will the bodhisattva do this.",
        "source": "T15n0626_001:0391c09_4"
    },
    {
        "source_sentence": "波坻槃拘利菩薩復問文殊師利：「是佛當無化佛乎？」",
        "translation": "The Pāṭaliputra Kauṇḍinya Bodhisattva again asked Mañjuśrī, Is this the Buddha or isn't there a transformed Buddha?",
        "source": "T15n0626_001:0391c10_5"
    },
    {
        "source_sentence": "文殊師利答言：「若自知諸法如化不？」",
        "translation": "Mañjuśrī answered, Do you know the teachings for yourself as they are?",
        "source": "T15n0626_001:0391c11_6"
    },
    {
        "source_sentence": "則答言：「諸法實如化。」",
        "translation": "He replied, All dharmas are really like transformation.",
        "source": "T15n0626_001:0391c12_7"
    },
    {
        "source_sentence": "文殊師利言：「以知諸法化，何為復問如來化？」",
        "translation": "Mañjuśrī said, Knowing the teachings of the Dharma, why would you ask the Tathāgata about the teachings again?",
        "source": "T15n0626_001:0391c13_0"
    },
    {
        "source_sentence": "文殊師利言：「仁者謂以諸佛悉化？」",
        "translation": "Mañjuśrī said, Sir, does it mean that all the buddhas are fully transformed?",
        "source": "T15n0626_001:0391c14_0"
    },
    {
        "source_sentence": "則復問文殊師利言：「佛者從何所化？」",
        "translation": "Again, he asked Mañjuśrī, Where did the Buddha come from to teach?",
        "source": "T15n0626_001:0391c14_1"
    },
    {
        "source_sentence": "文殊師利言：「所作本清淨，何以故而有化？」",
        "translation": "Mañjuśrī said, What's created is inherently pure, so why is there transformation for that reason?",
        "source": "T15n0626_001:0391c15_2"
    },
    {
        "source_sentence": "文殊師利言：「故佛無有吾、無有我、無有人、無有壽、無有命，亦不依佛住，",
        "translation": "Mañjuśrī replied: Therefore, the Buddha has no self, no self, no personality, no human being, no life span, and no living being. Nor does he dwell in dependence on buddhas.",
        "source": "T15n0626_001:0391c16_3"
    },
    {
        "source_sentence": "亦不依凡人住。」",
        "translation": "Nor does it rely on the abode of worldlings.",
        "source": "T15n0626_001:0391c18_4"
    },
    {
        "source_sentence": "波坻盤拘利菩薩復問化佛：「本何所學自致得佛？」",
        "translation": "Again, the Bodhisattva Pāṭikāputra asked the transformation Buddha, What did you originally train to attain buddhahood on your own?",
        "source": "T15n0626_001:0391c18_5"
    },
    {
        "source_sentence": "其佛言：「無所學是菩薩學。",
        "translation": "The Buddha said, Nothing to be learned is bodhisattva training.",
        "source": "T15n0626_001:0391c19_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0626_001:0391c20_7"
    },
    {
        "source_sentence": "亦不自念我欲求是亦不求是，亦不憂亦不喜，亦不緣亦不所化，亦無所見亦無處所，",
        "translation": "Nor does he think to himself, “This is what I wish to seek,” or “That is not sought;” nor does he grieve or rejoice. Nor does he think of anything as a condition or an object of instruction. Nor does he see anything or any place.",
        "source": "T15n0626_001:0391c20_8"
    },
    {
        "source_sentence": "亦無有想亦無有字，亦無有色，一切無所希望是菩薩學。",
        "translation": "There's no ideation, no words, and no form, and nothing to be hoped for is bodhisattva training.",
        "source": "T15n0626_001:0391c22_9"
    },
    {
        "source_sentence": "作是學者以為等學，作是學者無所著、無所縛，作是學者無有欲、無有怒、無有癡，",
        "translation": "Doing so, they have no desire, no anger, and no delusion.",
        "source": "T15n0626_001:0391c23_10"
    },
    {
        "source_sentence": "作是學者無所愛、無所憎，其學是者不自念我作是學，是為學作是學。",
        "translation": "Doing so is a learner who has nothing to love and nothing to hate, and those who train in this way don't think for themselves that what I do is training, which is training and what I do is training.",
        "source": "T15n0626_001:0391c25_11"
    },
    {
        "source_sentence": "作是學者不墮惡道。」",
        "translation": "Doing so, the scholar won't fall into a bad path.",
        "source": "T15n0626_001:0391c27_12"
    },
    {
        "source_sentence": "其佛言：「若有求阿耨多羅三藐三菩提心欲成至佛者，當作如我學。」",
        "translation": "The Buddha said, If someone seeks the mind of unsurpassed, correct, and complete enlightenment and wants to become a buddha, they'll train like me.",
        "source": "T15n0626_001:0391c27_13"
    },
    {
        "source_sentence": "復問：「何所是佛學？」",
        "translation": "Again, he asked, What's Buddhist training?",
        "source": "T15n0626_001:0391c29_14"
    },
    {
        "source_sentence": "其佛言：「亦不作罪亦不墮罪亦不所與，亦無所持亦無所不持，亦不持戒亦無有戒，",
        "translation": "The Buddha said, Neither does he commit sins nor fall into sins, neither gives them to others, neither upholds anything nor doesn’t uphold anything, and neither observes precepts nor lacks precepts.",
        "source": "T15n0626_001:0391c29_15"
    },
    {
        "source_sentence": "亦不忍辱亦不惡意，亦不精進亦無懈怠，亦不禪亦不亂意，亦不智慧亦無所知，",
        "translation": "Nor is there forbearance, nor malice, nor exertion, nor laziness, nor meditation, nor distraction, nor intellect, nor knowledge.",
        "source": "T15n0626_001:0392a02_16"
    },
    {
        "source_sentence": "亦無所學亦不有所學，亦不所成亦無有所成，亦不菩薩亦不佛法，亦不自念有身亦不念他人有身。",
        "translation": "They don't have anything to learn, nothing to learn, nothing to accomplish, nothing to accomplish, nothing to accomplish, neither bodhisattvas nor buddhas, and they don't think of their own body or the body of others.",
        "source": "T15n0626_001:0392a04_17"
    },
    {
        "source_sentence": "其所見者無有想，亦不法想亦不無法想不想無想。」",
        "translation": "Those who see it have no conceptions, and they don't conceptualize things as dharmas or non-conceptions, and they don't conceptualize things as non-conceptions.",
        "source": "T15n0626_001:0392a06_18"
    },
    {
        "source_sentence": "其佛言：「曉了是者，菩薩當作是學。",
        "translation": "The Buddha said, Understand this, and the bodhisattva will thus train.",
        "source": "T15n0626_001:0392a07_19"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0392a08_20"
    },
    {
        "source_sentence": "諸法一切如幻是為相。",
        "translation": "All dharmas are illusory, which is their characteristic.",
        "source": "T15n0626_001:0392a09_0"
    },
    {
        "source_sentence": "諸法一切皆合。",
        "translation": "All dharmas are united.",
        "source": "T15n0626_001:0392a09_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0392a09_2"
    },
    {
        "source_sentence": "雖無央數事念之皆空，無所有合則為空。",
        "translation": "Even though there are measureless things that are all empty when they're thought of, the combination of nothing and nothing is emptiness.",
        "source": "T15n0626_001:0392a10_3"
    },
    {
        "source_sentence": "諸法不可見。",
        "translation": "The dharmas are invisible.",
        "source": "T15n0626_001:0392a11_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0392a11_5"
    },
    {
        "source_sentence": "諸法等而無差特。",
        "translation": "The dharmas are equal, yet there's no difference.",
        "source": "T15n0626_001:0392a11_6"
    },
    {
        "source_sentence": "諸法悉默。",
        "translation": "All dharmas are completely silent.",
        "source": "T15n0626_001:0392a12_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0392a12_1"
    },
    {
        "source_sentence": "不語不言。",
        "translation": "He doesn't speak and doesn't say anything.",
        "source": "T15n0626_001:0392a12_2"
    },
    {
        "source_sentence": "是故無有處所。",
        "translation": "Therefore, there's no place.",
        "source": "T15n0626_001:0392a12_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0626_001:0392a13_4"
    },
    {
        "source_sentence": "諸法無所生。",
        "translation": "The dharmas have nothing to give rise to.",
        "source": "T15n0626_001:0392a13_5"
    },
    {
        "source_sentence": "其信是者，亦不念所行，亦不念得脫，亦不菩薩自貢高。」",
        "translation": "Those who believe this don't think about what they're doing, don't think about attaining liberation, and don't conceal themselves as bodhisattvas.",
        "source": "T15n0626_001:0392a13_6"
    },
    {
        "source_sentence": "其佛言：「若聞是學者，不恐不怖不畏，是故名為菩薩。",
        "translation": "The Buddha said, If someone hears about this scholar, they aren't afraid or frightened, so they're called bodhisattvas.",
        "source": "T15n0626_001:0392a14_7"
    },
    {
        "source_sentence": "譬若空不畏火、不畏風、不畏雨、不畏煙、不畏雲，亦不畏雷亦不畏電。",
        "translation": "It's like an empty sky that doesn't fear fire, doesn't fear wind, doesn't fear rain, doesn't fear smoke, doesn't fear clouds, and doesn't fear thunder or lightning.",
        "source": "T15n0626_001:0392a16_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0392a17_9"
    },
    {
        "source_sentence": "是空法故。",
        "translation": "It's because it's the teaching of emptiness.",
        "source": "T15n0626_001:0392a17_10"
    },
    {
        "source_sentence": "菩薩者當如是，一切無所畏懼。",
        "translation": "A bodhisattva should thus have no fear of anything at all.",
        "source": "T15n0626_001:0392a18_11"
    },
    {
        "source_sentence": "菩薩心以如空者乃伏眾魔，便能為佛，能為一切作護。」",
        "translation": "When the bodhisattva's mind is like emptiness, he subdues Māra and can then become a buddha and protect all of them.",
        "source": "T15n0626_001:0392a18_12"
    },
    {
        "source_sentence": "其化佛說是語竟便不復現。",
        "translation": "After the transformation buddha spoke these words, he didn't show them again.",
        "source": "T15n0626_001:0392a20_0"
    },
    {
        "source_sentence": "波坻槃拘利菩薩問文殊師利：「今怛薩阿竭所湊？」",
        "translation": "The Bodhisattva Pāṭaliputra asked Mañjuśrī, Where's the Tathāgata gathered now?",
        "source": "T15n0626_001:0392a20_1"
    },
    {
        "source_sentence": "則答言：「所從來處而所湊，所湊處從是來。」",
        "translation": "He answered, Where it comes from and where it's collected, and where it's collected comes from.",
        "source": "T15n0626_001:0392a21_2"
    },
    {
        "source_sentence": "波坻槃拘利謂文殊師利：「其化者無所從來無所從去，何謂從來？」",
        "translation": "Pāṭaliputra said to Mañjuśrī, That transformation comes from nowhere and goes nowhere, so what's meant by coming from?",
        "source": "T15n0626_001:0392a22_3"
    },
    {
        "source_sentence": "文殊師利答言：「譬若如化，來無道徑、去無道徑。",
        "translation": "Mañjuśrī replied, Suppose it's like a transformation that comes without a path and goes without a path.",
        "source": "T15n0626_001:0392a24_4"
    },
    {
        "source_sentence": "諸法亦爾，無所從來、無所從去。」",
        "translation": "So it is with all dharmas, which have no source and no destination.",
        "source": "T15n0626_001:0392a25_5"
    },
    {
        "source_sentence": "波坻槃拘利復問：「何所是諸法之處？」",
        "translation": "Pāṭaliputra again asked, Where are the dharmas?",
        "source": "T15n0626_001:0392a26_6"
    },
    {
        "source_sentence": "則答言：「自然住是之處。」",
        "translation": "He replied, This is the place where they naturally live.",
        "source": "T15n0626_001:0392a26_7"
    },
    {
        "source_sentence": "復問：「一切何所處是其處？」",
        "translation": "Again, he asked, Where are all these places?",
        "source": "T15n0626_001:0392a27_8"
    },
    {
        "source_sentence": "「如所作是其處。」",
        "translation": "As it's done, this is the place.",
        "source": "T15n0626_001:0392a28_9"
    },
    {
        "source_sentence": "復問：「諸法無所作無有罪。」",
        "translation": "Again, he asked, All dharmas are without doing anything and without sin.",
        "source": "T15n0626_001:0392a28_10"
    },
    {
        "source_sentence": "文殊師利言：「如是者諸法無所作無有罪。",
        "translation": "Mañjuśrī said, Thus, these things are without doing anything and without fault.",
        "source": "T15n0626_001:0392a29_0"
    },
    {
        "source_sentence": "其法去亦無有作者、無有作罪者，諸所有悉入法身。」",
        "translation": "There's no author or offender who goes away from that teaching, and whatever it is, he enters the Dharma body.",
        "source": "T15n0626_001:0392a29_1"
    },
    {
        "source_sentence": "則復問文殊師利：「無有作、無有罪，何以言人隨其所作？」",
        "translation": "Again, he asked Mañjuśrī, There's nothing to do and nothing to blame, so why would you say that someone follows what they do?",
        "source": "T15n0626_001:0392b02_2"
    },
    {
        "source_sentence": "文殊師利言：「審如所問，人亦無所作亦無有罪。",
        "translation": "Mañjuśrī said, As you've asked, a person doesn't do anything and isn't guilty.",
        "source": "T15n0626_001:0392b03_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0392b04_4"
    },
    {
        "source_sentence": "是人之法法身故，亦無有作亦無有罪，如所作如所得，是三者等。」",
        "translation": "Because this person's Dharma body is the Dharma body, there's nothing to do and nothing to blame, as done or gained, these are the three things.",
        "source": "T15n0626_001:0392b04_5"
    },
    {
        "source_sentence": "波坻槃拘利菩薩復問：「是三事等乎？」",
        "translation": "The Pāṭaliputra Kauṇḍinya Bodhisattva again asked, Are these three things the same?",
        "source": "T15n0626_001:0392b06_6"
    },
    {
        "source_sentence": "文殊師利言：「怛薩阿竭等，故三事適等。」",
        "translation": "Mañjuśrī said, The three things are appropriate because they're tathāgatas and so forth.",
        "source": "T15n0626_001:0392b07_7"
    },
    {
        "source_sentence": "復問：「怛薩阿竭者，無作、無罪、無得，是三事何緣與等？」",
        "translation": "Again, he asked, What are the reasons for these three things that a tathāgata has no action, no sin, and no attainment?",
        "source": "T15n0626_001:0392b08_0"
    },
    {
        "source_sentence": "文殊師利言：「怛薩阿竭無作、無罪、無得。",
        "translation": "Mañjuśrī said, The tathāgata has no action, no sin, and no attainment.",
        "source": "T15n0626_001:0392b09_1"
    },
    {
        "source_sentence": "其作、其罪、其得，如所為以故等。",
        "translation": "Their actions, sins, and attainments are as they are because of what they do.",
        "source": "T15n0626_001:0392b10_2"
    },
    {
        "source_sentence": "其罪以過了不見罪，已過當來亦不離怛薩阿竭故說。」",
        "translation": "That sin is explained because it's not a sin in the past or future, and it doesn't part from the tathāgata because it's not a sin in the past or future.",
        "source": "T15n0626_001:0392b10_3"
    },
    {
        "source_sentence": "是時如在釋迦文佛所，尊者舍利弗、阿難及諸尊比丘，悉承佛威神，皆聞文殊師利所說。",
        "translation": "Venerable Śāriputra, Ānanda, and the other venerable monks all heard what Mañjuśrī taught when they were at the place where Śākyamuni Buddha was staying, because of the Buddha's authority.",
        "source": "T15n0626_001:0392b12_0"
    },
    {
        "source_sentence": "舍利弗言：「善哉善哉！",
        "translation": "Śāriputra said, Good, good!",
        "source": "T15n0626_001:0392b14_0"
    },
    {
        "source_sentence": "上人之所作，以法無所不感動，不離法身，其有智者聞是莫不發意。」",
        "translation": "The work of the superior person is done because there's nothing that isn't moved by the Dharma and doesn't part from the Dharma body, and when wise people hear this, they don't fail to give rise to the intention.",
        "source": "T15n0626_001:0392b14_1"
    },
    {
        "source_sentence": "佛言：「審如所語。",
        "translation": "The Buddha said, Listen as you say.",
        "source": "T15n0626_001:0392b16_0"
    },
    {
        "source_sentence": "菩薩者學無所學，所語平等無有異，如所種得其實。",
        "translation": "A bodhisattva is someone who trains without training, speaks equally and without distinction, as they are planted to get the truth.",
        "source": "T15n0626_001:0392b16_1"
    },
    {
        "source_sentence": "其菩薩者所學者慧，如是所說如慧。」",
        "translation": "That bodhisattva is the wisdom of those who study it, and thus he explains it as wisdom.",
        "source": "T15n0626_001:0392b17_2"
    },
    {
        "source_sentence": "佛語舍利弗：「汝若所學自致是慧。」",
        "translation": "The Buddha said to Śāriputra, If you study it yourself, you'll attain wisdom.",
        "source": "T15n0626_001:0392b18_3"
    },
    {
        "source_sentence": "頂中光明菩薩白佛：「何所聲聞所學？",
        "translation": "The Bodhisattva Light shining from the top of his head said to the Buddha, What's learned by śrāvakas?",
        "source": "T15n0626_001:0392b19_4"
    },
    {
        "source_sentence": "何所菩薩所學？」",
        "translation": "What is the bodhisattva's training?",
        "source": "T15n0626_001:0392b19_5"
    },
    {
        "source_sentence": "佛言：「有限有著故為弟子學，無有限無有礙是為菩薩學。",
        "translation": "The Buddha said, Because there are limited attachments, it's for the disciples to train, and because there are no limits or hindrances, this is bodhisattva training.",
        "source": "T15n0626_001:0392b20_6"
    },
    {
        "source_sentence": "如聲聞者其學小其智少；",
        "translation": "It is like a śrāvaka who has little learning and little wisdom.",
        "source": "T15n0626_001:0392b21_7"
    },
    {
        "source_sentence": "菩薩者學廣大，其所知無有極，所說無所罣礙。」",
        "translation": "A bodhisattva's training is vast, his knowledge has no limit, and what he teaches is unobstructed.",
        "source": "T15n0626_001:0392b22_8"
    },
    {
        "source_sentence": "光智菩薩白佛：「唯怛薩阿竭作感應，令文殊師利眾會悉來到是。",
        "translation": "Guangzhi Bodhisattva said to the Buddha, Only Tathāgata made a response and caused Mañjuśrī's congregation to come here.",
        "source": "T15n0626_001:0392b23_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0392b24_10"
    },
    {
        "source_sentence": "其在是會皆令得無所亡失。",
        "translation": "They'll all attain nothing to lose while they're in this assembly.",
        "source": "T15n0626_001:0392b24_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0392b25_12"
    },
    {
        "source_sentence": "文殊師利所說甚深微妙。",
        "translation": "What Mañjuśrī teaches is profound and subtle.",
        "source": "T15n0626_001:0392b25_13"
    },
    {
        "source_sentence": "其欲聞者，隨其所欲各令得所。」",
        "translation": "Those who want to hear it will be given a place according to their desires.",
        "source": "T15n0626_001:0392b26_14"
    },
    {
        "source_sentence": "佛即感動，文殊師利應時與二十五上人及諸天子俱到佛所，前作禮而住。",
        "translation": "The Buddha was moved, and Mañjuśrī, accompanied by twenty-five superior people and celestial beings, went to the Buddha, bowed in front of him, and stayed there.",
        "source": "T15n0626_001:0392b27_15"
    },
    {
        "source_sentence": "光智菩薩問文殊師利：「佛在是間，而若何緣得在異處而說法？」",
        "translation": "Guangzhi Bodhisattva asked Mañjuśrī, If the Buddha were here, what would be the reason he could teach the Dharma in a different place?",
        "source": "T15n0626_001:0392b28_16"
    },
    {
        "source_sentence": "文殊師利言：「所以不在是間者，佛甚尊不可當，或所語可怛薩阿竭意、或不可意，",
        "translation": "Mañjuśrī said, “The reason I am not here is that the Buddha, who is so venerable and unworthy of being treated, may or may not speak appropriately to me.",
        "source": "T15n0626_001:0392c01_17"
    },
    {
        "source_sentence": "故在一面。」",
        "translation": "That's why he's at one side.",
        "source": "T15n0626_001:0392c03_18"
    },
    {
        "source_sentence": "其菩薩復問：「說何所法而可怛薩阿竭者？」",
        "translation": "The bodhisattva again asked, What teaching is there that can be taught to the tathāgata?",
        "source": "T15n0626_001:0392c03_19"
    },
    {
        "source_sentence": "文殊師利答言：「佛自知之。」",
        "translation": "Mañjuśrī answered, The Buddha knows it for himself.",
        "source": "T15n0626_001:0392c04_20"
    },
    {
        "source_sentence": "復言：「雖爾會說其意。」",
        "translation": "Again, he said, Even so, you'll explain its meaning.",
        "source": "T15n0626_001:0392c04_21"
    },
    {
        "source_sentence": "文殊師利則言：「如我所知少當說。」",
        "translation": "Mañjuśrī then said, As I know little, I'll explain it.",
        "source": "T15n0626_001:0392c05_22"
    },
    {
        "source_sentence": "則言：「何言是？」",
        "translation": "He then said, What do you say it is?",
        "source": "T15n0626_001:0392c06_23"
    },
    {
        "source_sentence": "文殊師利言：「如所說，所說法而不異。",
        "translation": "Mañjuśrī said, As explained, the teaching is not different.",
        "source": "T15n0626_001:0392c06_24"
    },
    {
        "source_sentence": "如怛薩阿竭，如本際而不可說，如法住如法說。",
        "translation": "Like the tathāgata, it's like the original limit and can't be explained, abiding according to the teaching and explaining according to the teaching.",
        "source": "T15n0626_001:0392c07_25"
    },
    {
        "source_sentence": "為怛薩阿竭意，無所止、無所斷，亦不緣亦無所緣，亦無所增亦無所減，",
        "translation": "In order to fulfill the meaning of the teachings of the Tathāgata, there’s nothing to stop and nothing to stop, neither without an object nor with an object, neither increasing nor decreasing.",
        "source": "T15n0626_001:0392c08_26"
    },
    {
        "source_sentence": "作是說而不失怛薩阿竭意，亦於身無所失，亦不令他人有所失，亦不亡法，",
        "translation": "He spoke these words without losing the meaning of kṣatriya, and he did not lose anything in his body. Nor did he cause anyone else to lose it, nor would he forsake the teaching.",
        "source": "T15n0626_001:0392c09_27"
    },
    {
        "source_sentence": "亦不亡生死，亦不亡泥洹，作是說者亦不失怛薩阿竭意。」",
        "translation": "Nor does he lose birth and death, nor does he lose nirvāṇa, and anyone who says this doesn't lose the meaning of tathāgatahood.",
        "source": "T15n0626_001:0392c11_28"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T15n0626_001:0392c12_29"
    },
    {
        "source_sentence": "如文殊師利所說，以可怛薩阿竭意。",
        "translation": "As Mañjuśrī explains, it's because they can be tasted as an abhidharma.",
        "source": "T15n0626_001:0392c13_30"
    },
    {
        "source_sentence": "所以者何。",
        "translation": "Why is it so?",
        "source": "T15n0626_001:0392c14_31"
    },
    {
        "source_sentence": "亦不過亦不減。",
        "translation": "It doesn't stop and doesn't decrease.",
        "source": "T15n0626_001:0392c14_32"
    },
    {
        "source_sentence": "適在中無所想。",
        "translation": "It's appropriate to have no conceptions in it.",
        "source": "T15n0626_001:0392c14_33"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0392c15_34"
    },
    {
        "source_sentence": "文殊師利俗三昧說事如故，不見諸法有所增者、有所減者。",
        "translation": "Mañjuśrī's secular samādhi explains things as they are, not seeing anything that increases or decreases.",
        "source": "T15n0626_001:0392c15_35"
    },
    {
        "source_sentence": "如文殊師利所說，不失怛薩阿竭意。」",
        "translation": "As Mañjuśrī teaches, it doesn't lose the tathāgata's mind.",
        "source": "T15n0626_001:0392c16_36"
    },
    {
        "source_sentence": "說是語時，八百天子皆得無所從生法忍。",
        "translation": "When he spoke these words, 800 celestial beings all attained the tolerance of the Dharma that arises from nothing.",
        "source": "T15n0626_001:0392c17_37"
    },
    {
        "source_sentence": "爾時眾會中復有二百天子，皆前以發菩薩意而未堅固，皆欲墮落，各各有念：「佛法無有極，",
        "translation": "At the time, there were another two hundred celestial beings in the assembly, all arousing the bodhisattva's intention but not yet resolute, all wanting to fall. Each thought, The Buddha's teaching has no limit.",
        "source": "T15n0626_001:0392c18_38"
    },
    {
        "source_sentence": "難得至佛。",
        "translation": "It's difficult to reach the Buddha.",
        "source": "T15n0626_001:0392c20_39"
    },
    {
        "source_sentence": "我等不在菩薩學中，不如取羅漢辟支佛而般泥洹。」",
        "translation": "We aren't in the bodhisattva training, so why wouldn't we take the arhat and pratyekabuddha and parinirvāṇa?",
        "source": "T15n0626_001:0392c20_40"
    },
    {
        "source_sentence": "佛悉知是人可成為菩薩而中欲意轉，佛便化作一迦羅越，持百味飯滿鉢齎到佛所，",
        "translation": "Knowing that they could become bodhisattvas, the Buddha transformed them into a garuḍa and took all kinds of cooked rice with bowls full of various flavors to the place where he was.",
        "source": "T15n0626_001:0392c22_0"
    },
    {
        "source_sentence": "前而作禮，以鉢上佛：「惟加哀受之。」",
        "translation": "He went forward to pay homage and put his bowl on the Buddha's head, saying, Please take pity on him.",
        "source": "T15n0626_001:0392c23_1"
    },
    {
        "source_sentence": "佛即受鉢。",
        "translation": "The Buddha then accepted the bowl.",
        "source": "T15n0626_001:0392c24_2"
    },
    {
        "source_sentence": "文殊師利便從坐起，叉手白佛：「雖食，當念故恩。」",
        "translation": "Mañjuśrī then got up from his seat, saluted the Buddha with his palms together, and said to him, Even though you're eating, you should remember your past kindness.",
        "source": "T15n0626_001:0392c25_0"
    },
    {
        "source_sentence": "舍利弗心念：「佛本從何等，而文殊師利言當念故恩乎？」",
        "translation": "Śāriputra thought to himself, Where did the Buddha come from in the past, and Mañjuśrī said, Will you remember this kindness?",
        "source": "T15n0626_001:0392c26_1"
    },
    {
        "source_sentence": "則問佛：「文殊師利本有何功德而置怛薩阿竭。」",
        "translation": "He then asked the Buddha, Mañjuśrī, What merit did he originally have to place it in a tathāgata?",
        "source": "T15n0626_001:0392c27_2"
    },
    {
        "source_sentence": "佛言：「且忍，今為汝決狐疑。」",
        "translation": "The Buddha said, Hang on, for now I'll resolve your doubts.",
        "source": "T15n0626_001:0392c28_3"
    },
    {
        "source_sentence": "即以鉢捨地，其鉢便下沒過諸佛剎，直下過七十二恒邊沙等剎土，剎土名曰漚呵沙(漚呵沙者天竺語，",
        "translation": "He then abandoned the bowl to the ground, and his bowl went down beyond the buddha-lands, going straight down past the seventy-two sands of the Ganges.",
        "source": "T15n0626_001:0392c29_4"
    },
    {
        "source_sentence": "漢言名曰明開闢)，其佛號荼毘羅耶(漢曰光明王)，今現在。",
        "translation": "The Chinese word for it is called Ming Kaishou.) The Buddha was named Dapiloye (漢曰光明王), which is now in existence.",
        "source": "T15n0626_001:0393a02_5"
    },
    {
        "source_sentence": "其鉢在彼佛剎住止空中，亦無持者。",
        "translation": "The bowl stayed in the air at that buddha-stage, but there was no one to hold it.",
        "source": "T15n0626_001:0393a03_6"
    },
    {
        "source_sentence": "鉢所過諸佛剎，其佛侍者皆問佛：「是鉢從何所來？」",
        "translation": "The buddhas and their attendants all asked the Buddha, Where did this bowl come from?",
        "source": "T15n0626_001:0393a04_0"
    },
    {
        "source_sentence": "諸佛言：「上方有剎名曰沙呵，佛號字釋迦文，鉢從彼來。",
        "translation": "The Buddhas said, Up there's a buddha named Śākyamuni in the upper part, whose buddha name is Śākyamuni and whose bowl comes from there.",
        "source": "T15n0626_001:0393a05_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0393a06_2"
    },
    {
        "source_sentence": "救護墮落菩薩意故，以變化感動。」",
        "translation": "It's because of the bodhisattva's intention to rescue those who fall into it and move them with his transformation.",
        "source": "T15n0626_001:0393a06_3"
    },
    {
        "source_sentence": "佛語舍利弗：「行求鉢來。」",
        "translation": "The Buddha said to Śāriputra, Come along and ask for the bowl.",
        "source": "T15n0626_001:0393a07_4"
    },
    {
        "source_sentence": "舍利弗即承佛威神，自以慧力入萬三昧，過萬佛剎亦不見亦不得。",
        "translation": "Śāriputra then inherited the Buddha's authoritative power and entered myriad samādhis with his own wisdom, and beyond myriad buddha-bodies, he didn't see or attain them.",
        "source": "T15n0626_001:0393a07_5"
    },
    {
        "source_sentence": "從三昧還白佛：「求之不見不得。」",
        "translation": "From the samādhi, he returned to the Buddha and said, Seeking it, I won't see it.",
        "source": "T15n0626_001:0393a09_6"
    },
    {
        "source_sentence": "佛言：「且捨。」",
        "translation": "The Buddha said, Let's abandon it.",
        "source": "T15n0626_001:0393a10_7"
    },
    {
        "source_sentence": "佛復謂大目揵連：「行求索鉢。」",
        "translation": "Again, the Buddha said to Mahāmaudgalyāyana, I'm going to ask for a bowl.",
        "source": "T15n0626_001:0393a10_8"
    },
    {
        "source_sentence": "則承佛威神，自蒙神足力入八千三昧，過八千佛剎，無所見無所得。",
        "translation": "Then, inheriting the Buddha's authoritative power, he entered 8,000 samādhis with his own miraculous power of enlightenment and went beyond 8,000 buddha-lands, seeing nothing and attaining nothing.",
        "source": "T15n0626_001:0393a11_9"
    },
    {
        "source_sentence": "則從三昧還白佛：「求之不見不能得。」",
        "translation": "He then returned from the samādhi and said to the Buddha, Seeking it, I can't get it.",
        "source": "T15n0626_001:0393a12_10"
    },
    {
        "source_sentence": "佛語須菩提：「行求鉢來。」",
        "translation": "The Buddha said to Suppository, Come along with the bowl for practice.",
        "source": "T15n0626_001:0393a13_11"
    },
    {
        "source_sentence": "則入萬二千三昧，過萬二千佛剎亦不見亦不得。",
        "translation": "He then enters 12,000 samādhis, and doesn't see or attain more than 12,000 buddha bases.",
        "source": "T15n0626_001:0393a13_12"
    },
    {
        "source_sentence": "即從三昧還白佛：「求之不見不能得。」",
        "translation": "He then returned from his samādhi and said to the Buddha, Seeking it, I can't get it.",
        "source": "T15n0626_001:0393a15_13"
    },
    {
        "source_sentence": "則五百尊比丘，各各以神足行求索鉢，亦不能見亦不能得。",
        "translation": "Then, each of the five hundred venerable monks traveled with their spiritual feet and asked for a bowl, but they couldn't see it or get it.",
        "source": "T15n0626_001:0393a15_14"
    },
    {
        "source_sentence": "須菩提從座起白彌勒菩薩：「仁者高才一生補處，現當來佛。",
        "translation": "Suppository got up from his seat and said to Maitreya Bodhisattva, Sir, you're a man of high talent who will be reborn in one lifetime as a buddha in the future.",
        "source": "T15n0626_001:0393a17_15"
    },
    {
        "source_sentence": "吾等行求鉢不能得，惟行求之。」",
        "translation": "We've been walking around seeking bowls that we can't get, but we're just walking around seeking them.",
        "source": "T15n0626_001:0393a18_16"
    },
    {
        "source_sentence": "彌勒則答言：「如若所說實一生補處，今者不及文殊師利所作三昧及其名字。",
        "translation": "Maitreya then answered, Suppose what's explained is really a place where there's a lifetime of accumulation, but now it's not as good as the concentration created by Mañjuśrī and its names.",
        "source": "T15n0626_001:0393a19_17"
    },
    {
        "source_sentence": "聽我所言。",
        "translation": "Listen to what I say.",
        "source": "T15n0626_001:0393a21_18"
    },
    {
        "source_sentence": "我作佛時，如恒邊沙等悉為文殊師利，復不能知我行步舉足下足之事；",
        "translation": "When I become a buddha, like the sands of the Ganges River and so on, I am all Mañjuśrī. Nor can I know where I walk, lift my legs, or put my feet down.",
        "source": "T15n0626_001:0393a21_19"
    },
    {
        "source_sentence": "如今者實不逮及。",
        "translation": "Now, they really don't attain it.",
        "source": "T15n0626_001:0393a22_20"
    },
    {
        "source_sentence": "不如報文殊師利而行求之。」",
        "translation": "They won't repay Mañjuśrī and go on to seek it.",
        "source": "T15n0626_001:0393a23_21"
    },
    {
        "source_sentence": "則須菩提白佛：「唯怛薩阿竭！",
        "translation": "Then Suppository said to the Buddha, Only Tathāgata!",
        "source": "T15n0626_001:0393a24_0"
    },
    {
        "source_sentence": "當令文殊師利而行求鉢。」",
        "translation": "I will cause Mañjuśrī to go and ask for a bowl.",
        "source": "T15n0626_001:0393a24_1"
    },
    {
        "source_sentence": "佛即謂文殊師利：「行求鉢來。」",
        "translation": "The Buddha then said to Mañjuśrī, Come along and ask for the bowl.",
        "source": "T15n0626_001:0393a25_2"
    },
    {
        "source_sentence": "文殊師利即默聲，以受教即自思念，而不起坐、不離佛、不捨眾會，於是便能致鉢。",
        "translation": "Mañjuśrī then remained silent, and because he had received the teaching, he thought to himself, didn't get up from his seat, didn't leave the Buddha, and didn't abandon the assembly, so he was able to present his bowl.",
        "source": "T15n0626_001:0393a25_3"
    },
    {
        "source_sentence": "即時三昧為無所不遍入，即於眾會以手指地，其手而下行，所過佛剎悉為諸佛接其足，",
        "translation": "Immediately, in concentration, he entered everywhere without fail. He then stood on the ground with his fingers touching the congregation’s feet of the buddhas and joined their feet at all buddha-lands that passed by him.",
        "source": "T15n0626_001:0393a27_4"
    },
    {
        "source_sentence": "下方莫不聞其聲道：「釋迦文佛致問。」",
        "translation": "No one below hears his voice saying, Śākyamuni Buddha asks questions.",
        "source": "T15n0626_001:0393a29_5"
    },
    {
        "source_sentence": "其臂者一一毛放億百千光明，一一明者有億百千蓮華，一一蓮華上者皆有菩薩，",
        "translation": "Each hair on that arm of the enlightening being’s body radiated millions of rays of light; each ray of light produced millions of hundreds of millions of lotus blossoms. On each and every one of those lotus blossoms there was an enlightening being:",
        "source": "T15n0626_001:0393b01_6"
    },
    {
        "source_sentence": "其菩薩者皆各各歎釋迦文佛。",
        "translation": "Each of those bodhisattvas praised Śākyamuni Buddha.",
        "source": "T15n0626_001:0393b03_7"
    },
    {
        "source_sentence": "是所過剎土皆為六反震動，其剎土皆嚴莊幢幡而起，所過處悉皆見文殊師利以右手悉接諸佛足，",
        "translation": "The buddha-lands that passed by him all shook in six ways. All the buddha-lands were adorned with banners and pennants, and everywhere they passed by Mañjuśrī touched the buddhas’ feet with his right hand.",
        "source": "T15n0626_001:0393b04_8"
    },
    {
        "source_sentence": "皆言釋迦文佛之所致問。",
        "translation": "They all said it was the question asked by Śākyamuni Buddha.",
        "source": "T15n0626_001:0393b06_9"
    },
    {
        "source_sentence": "過七十二恒邊沙等剎，到明開闢剎土，乃至荼毘羅耶佛所，前作禮，為釋迦文佛致問。",
        "translation": "He went beyond the seventy-two sands of the Ganges and so forth, opened his buddha land at dawn, went to the place where Dapiloyana Buddha was staying, paid homage, and asked Śākyamuni Buddha questions.",
        "source": "T15n0626_001:0393b06_10"
    },
    {
        "source_sentence": "其臂上毛一一毛有億百千光明億百千蓮華，一一蓮華上各有坐菩薩，悉歎釋迦文佛功德。",
        "translation": "Each hair on the top of his arm contained billions of millions of hundreds of thousands of lotus flowers with hundreds of millions of rays of light, and each one of those lotus flowers had a seated bodhisattva sitting there, all praising the merits of Śākyamuni Buddha.",
        "source": "T15n0626_001:0393b08_11"
    },
    {
        "source_sentence": "其菩薩光明、彼佛光明如不相錯，各各自見光明王佛邊有侍者。",
        "translation": "Each of those bodhisattvas' lights and those buddhas' lights are as if they aren't mistaken, and each sees that there's an attendant beside the Buddha King of Light.",
        "source": "T15n0626_001:0393b11_0"
    },
    {
        "source_sentence": "而尊菩薩名曰光尊，自問其佛：「是誰手臂姝好乃爾？",
        "translation": "The venerable bodhisattva, called the Venerable Light, asked the Buddha himself, Who has such a handsome arm?",
        "source": "T15n0626_001:0393b12_1"
    },
    {
        "source_sentence": "其毛光明，蓮華菩薩之所歌歎彼佛功德。」",
        "translation": "That hair shines brightly, and the lotus-flower bodhisattva sings praises of the Buddha's merits.",
        "source": "T15n0626_001:0393b13_2"
    },
    {
        "source_sentence": "其佛言：「上方過七十二恒邊沙等剎土，名曰沙呵，其佛號字釋迦文佛，",
        "translation": "The Buddha said, “There are seventy-two buddha-lands as numerous as the grains of sand in the Ganges River above us, called Sahā. This buddha is called Śākyamuni Buddha.",
        "source": "T15n0626_001:0393b14_3"
    },
    {
        "source_sentence": "今現在前。",
        "translation": "Now, it's presently manifested.",
        "source": "T15n0626_001:0393b16_4"
    },
    {
        "source_sentence": "有菩薩名文殊師利，不可思議僧涅，其智無所不度，以續在彼佛前，坐用鉢故而投手乃到是間。」",
        "translation": "There's a bodhisattva named Mañjuśrī, an inconceivable monk and nun whose wisdom doesn't fail to save him, who continues to sit with his bowl in front of that Buddha and joins his hands as he goes here.",
        "source": "T15n0626_001:0393b16_5"
    },
    {
        "source_sentence": "其菩薩悉作是念，皆白其佛：「譬如渴人欲得飲，願欲得見釋迦文佛、文殊師利及其剎土。」",
        "translation": "The bodhisattvas all had this thought, and they all said to the Buddha, Suppose a thirsty person wants to drink and wishes to see Śākyamuni Buddha, Mañjuśrī, and their buddha lands.",
        "source": "T15n0626_001:0393b18_6"
    },
    {
        "source_sentence": "其佛即以兩眉中央相而放光明，徹照過七十二恒邊沙剎，乃至沙呵剎悉為開闢，",
        "translation": "That Buddha then emanated a ray of light from the center of his two eyebrows, illuminating as many buddha-lands as there are grains of sand in the seventy-two directions.",
        "source": "T15n0626_001:0393b20_7"
    },
    {
        "source_sentence": "其有人見其光明者皆得安隱。",
        "translation": "Anyone who sees his light will attain peace.",
        "source": "T15n0626_001:0393b22_8"
    },
    {
        "source_sentence": "其身譬如遮迦越羅，其有凡比丘者得須陀洹。",
        "translation": "His body is like a cakravartin, and there are ordinary monks who attain stream entry.",
        "source": "T15n0626_001:0393b23_9"
    },
    {
        "source_sentence": "其過三道上者，皆有八惟務禪，應時得羅漢。",
        "translation": "Those who go beyond the three paths all have eight dedications of meditation, and they should attain arhatship at the right time.",
        "source": "T15n0626_001:0393b24_10"
    },
    {
        "source_sentence": "其菩薩身得是光明者，皆逮得日明三昧。",
        "translation": "Those bodhisattvas who attain this light in their bodies will all attain the samādhi of sunlight.",
        "source": "T15n0626_001:0393b25_11"
    },
    {
        "source_sentence": "荼毘羅耶佛剎諸菩薩，從彼間悉見是間及諸聲聞諸菩薩。",
        "translation": "The bodhisattvas of the Tathāgata's buddha-stage all saw this place and the śrāvakas and bodhisattvas from there.",
        "source": "T15n0626_001:0393b26_12"
    },
    {
        "source_sentence": "以見是間剎土則而淚出，便言：「若瑠璃清淨及其摩尼墮其污泥，誠可惜之。",
        "translation": "Seeing this, the kṣatriya wept and said, If the lapis lazuli is pure and its maṇi falls into the mud, it's really a pity.",
        "source": "T15n0626_001:0393b27_13"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0393b29_14"
    },
    {
        "source_sentence": "沙呵剎土諸菩薩，誠可惜之，而生彼間。」",
        "translation": "The bodhisattvas of Śākyamuni's land really pity them and are born elsewhere.",
        "source": "T15n0626_001:0393b29_15"
    },
    {
        "source_sentence": "荼毘羅耶佛謂波羇頭菩薩：「汝不曉是，勿得說之。",
        "translation": "The Tathāgata Vairocana Buddha said to Bodhisattva Pāṭikāputra, Don't know this; don't explain it.",
        "source": "T15n0626_001:0393c01_16"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0393c02_17"
    },
    {
        "source_sentence": "我剎土千劫行禪，不如彼佛剎人行慈從日出至食，其所功德過倍是間。",
        "translation": "For a thousand eons in my buddha land, I've practiced meditation, but it's not as good as those people at the Buddha's site who practice kindness from sunrise to food, whose merit is more than twice as great as this.",
        "source": "T15n0626_001:0393c02_18"
    },
    {
        "source_sentence": "彼之菩薩雖有宿命，行法如彈指頃者其罪盡索。」",
        "translation": "Even though that bodhisattva has a past life, if he practices the Dharma like snapping his fingers for an instant, his sins will be exhausted.",
        "source": "T15n0626_001:0393c04_19"
    },
    {
        "source_sentence": "是間菩薩悉問佛：「是光明從何所來？",
        "translation": "The bodhisattva then asked the Buddha, Where did this light come from?",
        "source": "T15n0626_001:0393c05_20"
    },
    {
        "source_sentence": "今身皆安隱。」",
        "translation": "Now, they're all peaceful in body.",
        "source": "T15n0626_001:0393c06_21"
    },
    {
        "source_sentence": "佛則言：「下方過七十二恒邊沙等佛剎土，名漚呵沙。",
        "translation": "The Buddha then said, Down below, there are seventy-two buddha-lands like the sands of the Ganges at the end of the moon and other buddha-lands, which are called Kauṣṭhila Sands.",
        "source": "T15n0626_001:0393c06_22"
    },
    {
        "source_sentence": "何佛者？",
        "translation": "What's the Buddha?",
        "source": "T15n0626_001:0393c07_23"
    },
    {
        "source_sentence": "號字荼毘羅耶，放兩眉中央相光明。」",
        "translation": "It's called dapilāya, which radiates the light at the center of its two eyebrows.",
        "source": "T15n0626_001:0393c08_24"
    },
    {
        "source_sentence": "菩薩悉白佛：「願聞欲見漚呵沙剎土及怛薩阿竭荼毘羅耶。」",
        "translation": "The bodhisattva all said to the Buddha, May I hear that you want to see the Tathāgata-kāśyapa buddha land and the Tathāgata-kāśyapilāya?",
        "source": "T15n0626_001:0393c08_25"
    },
    {
        "source_sentence": "應時釋迦文放足下光明，照下方過七十二恒邊沙等剎，漚呵沙剎土及荼毘羅耶佛盡為開闢。",
        "translation": "At the time, Śākyamuni radiated a ray of light from his feet that shone downward and illuminated seventy-two buddha-lands beyond the sands of the Ganges at the side of the moon below him, and so forth, as many buddhas as there are in Jambudvīpa and Kapilavastu were all opened.",
        "source": "T15n0626_001:0393c10_26"
    },
    {
        "source_sentence": "彼剎菩薩見其光明入其身，悉得摩仳低三昧具足(三昧者天竺語，漢解之名須彌光明)。",
        "translation": "Seeing that buddha bodhisattva's light entering his body, they all attain the accomplishment of moistening samādhi (samādhi is a Sanskrit word for heavenly and Chinese term for Sumeru Light).",
        "source": "T15n0626_001:0393c12_27"
    },
    {
        "source_sentence": "是間菩薩盡見彼佛及剎，譬如在地住者，莫不見日月星宿。",
        "translation": "The bodhisattvas here see all those buddhas and bases, just like someone who lives on the ground doesn't see the sun, moon, stars, or constellations.",
        "source": "T15n0626_001:0393c14_0"
    },
    {
        "source_sentence": "下方見是間，亦如是間見下方荼毘羅耶漚呵沙剎土。",
        "translation": "The lower part sees this interval, and so does the lower part see the sands of the Tathāgata's buddha-lands.",
        "source": "T15n0626_001:0393c15_1"
    },
    {
        "source_sentence": "文殊師利以右手取其鉢，與無央數拘利那術百千菩薩俱而來上。",
        "translation": "Mañjuśrī took his bowl in his right hand and came up, accompanied by measureless hundreds of thousands of koṭīs of bodhisattvas.",
        "source": "T15n0626_001:0393c16_2"
    },
    {
        "source_sentence": "所過諸剎土，其蓮華一一毛光明稍稍而盡，其鉢便在手中。",
        "translation": "In all the buddha-lands he passed through, each hair of the lotus flower disappeared a little bit. The bowl was in his hand.",
        "source": "T15n0626_001:0393c18_3"
    },
    {
        "source_sentence": "是間文殊師利則從坐起，為佛作禮，以鉢授佛，佛則受之。",
        "translation": "Mañjuśrī then got up from his seat, paid homage to the Buddha, gave him his bowl, and he accepted it.",
        "source": "T15n0626_001:0393c19_4"
    },
    {
        "source_sentence": "其菩薩從下上者悉作禮，各各自以佛名謝釋迦文佛。",
        "translation": "The bodhisattvas from the lower and higher all paid homage, each thanking Śākyamuni Buddha by naming him by the Buddha's name.",
        "source": "T15n0626_001:0393c20_5"
    },
    {
        "source_sentence": "怛薩阿竭即時各令就坐。",
        "translation": "The tathāgata immediately ordered each to take his seat.",
        "source": "T15n0626_001:0393c22_6"
    },
    {
        "source_sentence": "悉皆受教，各各而坐。",
        "translation": "They all accepted the teaching and each sat down one by one.",
        "source": "T15n0626_001:0393c22_7"
    },
    {
        "source_sentence": "佛謂舍利弗：「向之所問，用文殊師利所問故，今為汝說之。",
        "translation": "The Buddha said to Śāriputra, What I've asked before is because it's based on what Mañjuśrī asked, so now I'll explain it for you.",
        "source": "T15n0626_001:0393c23_8"
    },
    {
        "source_sentence": "已過去無央數不可計阿僧祇劫，爾時有佛號字勇莫能勝，其剎名無常。",
        "translation": "In the past, an incalculable number of incalculable eons ago, there was a buddha named Bravery who couldn't overcome it, and his blaze was called impermanent.",
        "source": "T15n0626_001:0393c24_9"
    },
    {
        "source_sentence": "爾時諸聲聞八萬四千人，菩薩萬二千人俱悉會，其佛為三道家如說法。」",
        "translation": "It was then that 84,000 śrāvakas and 12,000 bodhisattvas assembled, and the Buddha taught the Dharma for the sake of the families of the three paths.",
        "source": "T15n0626_001:0393c26_10"
    },
    {
        "source_sentence": "佛言：「時怛薩阿竭勇莫能勝，於五惡世而作佛。",
        "translation": "The Buddha said, At the time, none of the Tathāgata's courageous people could overcome it and become a buddha in the five bad worlds.",
        "source": "T15n0626_001:0393c27_11"
    },
    {
        "source_sentence": "有比丘名慧王，明於經法，持鉢入惟致國中而行分衛，得百味飯若干種食。",
        "translation": "There was a monk named King of Wisdom who explained the sūtras and teachings, entered the country of Vaiśravaṇa with his bowl in hand and traveled to defend it, obtaining a hundred flavors of rice and several kinds of food.",
        "source": "T15n0626_001:0393c28_12"
    },
    {
        "source_sentence": "爾時有尊者子名離垢王，為乳母所抱持，在城門外而住。",
        "translation": "At the time, there was a venerable son named King of freedom from defilement who was embraced by his wet nurse and stayed outside the city gates.",
        "source": "T15n0626_001:0394a01_13"
    },
    {
        "source_sentence": "其兒遙見明經比丘，欲從抱下，得下便取之求其食，比丘即以蜜餅授與之。",
        "translation": "From a distance, the boy saw the monk Mingjing and wanted to embrace him. When he got down from his embrace, he took it and begged for food. The monk gave it to him with cakes made of honey.",
        "source": "T15n0626_001:0394a02_14"
    },
    {
        "source_sentence": "其兒則食之，知味甘美，隨比丘而行，不顧念乳母，便隨至勇莫能勝佛所，",
        "translation": "The boy then ate it. Knowing that the taste was sweet and delicious, he followed the bhikṣu but did not pay any attention to his nursing mother. So he went along with bravery and no one could surpass him at the Buddha’s place.",
        "source": "T15n0626_001:0394a04_15"
    },
    {
        "source_sentence": "則為佛作禮而坐一面。",
        "translation": "Then he paid homage to the Buddha and sat to one side.",
        "source": "T15n0626_001:0394a06_16"
    },
    {
        "source_sentence": "若那羅耶比丘以所持鉢得食而與是兒，令上其佛，兒則受之以上怛薩阿竭。",
        "translation": "If a Nāraya monk gives food to this child with the bowl he's carrying and causes it to go up to the Buddha, the child will then accept the above-mentioned tathāgata.",
        "source": "T15n0626_001:0394a06_17"
    },
    {
        "source_sentence": "其佛受食，鉢則為滿，其兒所持鉢食續如故。",
        "translation": "When the Buddha accepted the food, his bowl became full, and the bowl he carried continued to eat as before.",
        "source": "T15n0626_001:0394a08_18"
    },
    {
        "source_sentence": "復以是食遍八萬四千比丘及菩薩萬二千人，各各悉飽滿，其兒所持食續復如故。",
        "translation": "Again, this food pervaded 84,000 monks and 12,000 bodhisattvas, each fully satisfied, and the food they carried continued to be as before.",
        "source": "T15n0626_001:0394a09_19"
    },
    {
        "source_sentence": "佛以威神令兒歡喜，并蒙本之功德即為盡信，便前而住，即歎其佛，所持鉢食而奉上。",
        "translation": "Because of the Buddha's authoritative power, the child rejoiced, and because of the merit he had gained from the original teaching, he ended his faith, went ahead and stayed there, praised the Buddha, offered him the bowl and food he held, and venerated him.",
        "source": "T15n0626_001:0394a11_20"
    },
    {
        "source_sentence": "以應時滿，其所持者亦不缺減，遍比丘及諸菩薩其食續在，乃知佛尊亦不盡索而復增益。",
        "translation": "When the time is up, those who preserve it don't lack it, and when the food pervades the monks and bodhisattvas and their food continues to be there, they know that the Bhagavān doesn't exhaust his claim and increases again.",
        "source": "T15n0626_001:0394a13_21"
    },
    {
        "source_sentence": "其供養佛者，功德可重而增。」",
        "translation": "Those who make offerings to the Buddha will have great merit and increase in strength.",
        "source": "T15n0626_001:0394a15_22"
    },
    {
        "source_sentence": "佛語舍利弗：「是兒以一鉢食，乃至七日其食不減，滿則如故。",
        "translation": "The Buddha said to Śāriputra, That child ate with one bowl of food for seven days without diminishing, and when he filled it up, it was as before.",
        "source": "T15n0626_001:0394a16_23"
    },
    {
        "source_sentence": "其佛阿波羅耆陀陀教導其兒，自歸佛及法、比丘僧，授與五戒，教令悔過，",
        "translation": "The Buddha Avalokiteśvara taught his children, taking refuge in the Buddha, Dharma, and Sangha, bestowing the five precepts on them so that they would repent.",
        "source": "T15n0626_001:0394a17_24"
    },
    {
        "source_sentence": "勸助功德。",
        "translation": "It's the merit of encouragement.",
        "source": "T15n0626_001:0394a19_25"
    },
    {
        "source_sentence": "乃發阿耨多羅三耶三菩心。",
        "translation": "He then gave rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T15n0626_001:0394a19_26"
    },
    {
        "source_sentence": "其兒父母求索子無所不遍，乃至怛薩阿竭所，前為佛作禮而住。",
        "translation": "Their children's parents asked for their children, and nothing was left unobtainted, even up to the point where they bowed to the Buddha in front of Tathāgata and stayed.",
        "source": "T15n0626_001:0394a20_27"
    },
    {
        "source_sentence": "其子見父母，前為作禮而譽言：『我今入菩薩法，用一切故願復發意。",
        "translation": "Seeing his parents, the son paid homage to them and praised them, saying, 'Now that I've entered the bodhisattva's teaching, I want to again arouse my mind with all kinds of intentions.",
        "source": "T15n0626_001:0394a21_28"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0394a23_29"
    },
    {
        "source_sentence": "難值佛故。』",
        "translation": "It's because it's difficult to meet the Buddha.'",
        "source": "T15n0626_001:0394a23_30"
    },
    {
        "source_sentence": "語其父母：『視佛相及其種好，其慧無所不遍，其道以度。",
        "translation": "He said to his parents, 'Look at the Buddha's features and their distinctive characteristics, and there's nothing in his wisdom that doesn't pervade him, but his path saves him.",
        "source": "T15n0626_001:0394a23_31"
    },
    {
        "source_sentence": "願欲我身令得作沙門。",
        "translation": "May I be allowed to become an ascetic?",
        "source": "T15n0626_001:0394a24_32"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0394a25_33"
    },
    {
        "source_sentence": "難與怛薩阿竭會故。』",
        "translation": "It's because it's difficult to associate with the tathāgata assembly.'",
        "source": "T15n0626_001:0394a25_34"
    },
    {
        "source_sentence": "父母即言：『善哉善哉！",
        "translation": "The parents then said, 'Good, good!'",
        "source": "T15n0626_001:0394a26_35"
    },
    {
        "source_sentence": "隨子之所欲歡樂。",
        "translation": "Whatever the child desires, he'll be happy.",
        "source": "T15n0626_001:0394a26_36"
    },
    {
        "source_sentence": "子之所求，悉如子之願。",
        "translation": "Whatever the child asks for, it's exactly as he wishes.",
        "source": "T15n0626_001:0394a26_37"
    },
    {
        "source_sentence": "吾等亦復發心，當從汝為法，則今悉放其舍宅，亦復効汝而為沙門。』」",
        "translation": "We'll also give rise to the intention to follow you as a dharma, so now we'll all let go of our houses and make them your ascetics.'",
        "source": "T15n0626_001:0394a27_38"
    },
    {
        "source_sentence": "佛語舍利弗：「是兒之所言，父母及五百人悉發阿耨多羅三耶三菩心，",
        "translation": "The Buddha said to Śāriputra: As the prince had said, his parents and the five hundred members of their clan all aroused the spirit of unexcelled, perfect enlightenment.",
        "source": "T15n0626_001:0394a29_0"
    },
    {
        "source_sentence": "悉於阿波羅耆陀陀佛所皆作沙門。」",
        "translation": "They'll all become as śramaṇas at the abode of Avalokiteśvara Buddha.",
        "source": "T15n0626_001:0394b01_1"
    },
    {
        "source_sentence": "佛語舍利弗：「汝之所疑者，即若那羅耶比丘者文殊師利是，其時兒尊者子惟摩羅和耶者則是我身。",
        "translation": "The Buddha said to Śāriputra, What you doubt is that if the monk Nāraya Bhikṣu was Mañjuśrī, then the son of Venerable Puṣkarasārin, except for Māra Vaiśravaṇa, would be me.",
        "source": "T15n0626_001:0394b02_2"
    },
    {
        "source_sentence": "文殊師利以食與我，作其功德而令發心，是則本之初發阿耨多羅三耶三菩心恩師。」",
        "translation": "Mañjuśrī gave food to me and made them give it to me so that I'd arouse their minds with merit, which is the originally enlightened teacher who first aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T15n0626_001:0394b04_3"
    },
    {
        "source_sentence": "佛語舍利弗：「汝欲知其今佛十種力、四事無所畏，其智慧不可議，悉文殊師利之所發動。",
        "translation": "The Buddha said to Śāriputra, You want to know that the present buddha's ten kinds of powers and four things have no fear, and his wisdom is unfathomable, all developed by Mañjuśrī.",
        "source": "T15n0626_001:0394b06_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0394b08_5"
    },
    {
        "source_sentence": "心則是根本。」",
        "translation": "The mind is the root.",
        "source": "T15n0626_001:0394b09_6"
    },
    {
        "source_sentence": "佛復語舍利弗：「如我身等不可數阿僧祇剎土諸佛，悉為文殊師利之所發動，",
        "translation": "Again, the Buddha said to Śāriputra: Just as my body and so many other buddhas of innumerable aeons were all inspired by Mañjuśrī,",
        "source": "T15n0626_001:0394b09_7"
    },
    {
        "source_sentence": "號悉字釋迦文佛。",
        "translation": "He was called Śākyamuni Buddha, the full name of which is Śākyamuni Buddha.",
        "source": "T15n0626_001:0394b11_8"
    },
    {
        "source_sentence": "如是佛數，復有號為提式沸佛，復有號式佛，復有號提和竭佛，復有號惟衛佛。」",
        "translation": "Thus, these buddhas are counted, and there's another name for Tiṣya Bodhi Buddha, another name for Tiṣya Buddha, another name for Tiṣya Buddha, another name for Tivāgata Buddha, and another name for Weiwei Buddha.",
        "source": "T15n0626_001:0394b11_9"
    },
    {
        "source_sentence": "佛語舍利弗：「悉說是諸佛字，從劫至劫未有竟時，皆悉文殊師利之所發動，",
        "translation": "The Buddha said to Śāriputra: They all say these words of the buddhas, and they are uttered by Mañjuśrī from eon to eon without end.",
        "source": "T15n0626_001:0394b13_10"
    },
    {
        "source_sentence": "今現在悉轉法輪中，有般泥洹者，中有行菩薩道者，中有在兜術天上者，",
        "translation": "Among those who are now completely turning the wheel of the Dharma, there are those who have entered parinirvāṇa, some who are on the path of enlightening beings, and some who are in the Tuṣita heaven.",
        "source": "T15n0626_001:0394b15_11"
    },
    {
        "source_sentence": "中有在母腹者，中有生者，中有捨家求佛者，中有坐佛樹下者，中有成佛者，",
        "translation": "In the middle, there's someone who's in his mother's womb; in the middle, there's someone who's born; in the middle, there's someone who leaves home and seeks Buddhahood; in the middle, there's someone sitting under a Buddha tree; and in the middle, there's someone who becomes a buddha.",
        "source": "T15n0626_001:0394b16_12"
    },
    {
        "source_sentence": "猶不可盡。」",
        "translation": "It's still inexhaustible.",
        "source": "T15n0626_001:0394b18_13"
    },
    {
        "source_sentence": "佛謂舍利弗：「文殊師利者，是菩薩之父母，是則為迦羅蜜。",
        "translation": "The Buddha said to Śāriputra, Mañjuśrī is the bodhisattva's parents, and this is the karāma.",
        "source": "T15n0626_001:0394b18_14"
    },
    {
        "source_sentence": "屬所問者，何緣而置怛薩阿竭？",
        "translation": "If it belongs to the question being asked, what is the reason for placing it in the tathāgata?",
        "source": "T15n0626_001:0394b20_15"
    },
    {
        "source_sentence": "而我之所得，悉蒙文殊師利恩，以為是恩故。",
        "translation": "But what I have gained is all due to the kindness of Mañjuśrī, and it's because of this kindness.",
        "source": "T15n0626_001:0394b20_16"
    },
    {
        "source_sentence": "其二百天子即時自念：『諸法學者乃可有所成，吾等尚可。",
        "translation": "The two hundred celestial beings immediately thought to themselves, 'There's something that scholars of the Dharma can accomplish, and we still can.",
        "source": "T15n0626_001:0394b21_17"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0394b23_18"
    },
    {
        "source_sentence": "今是釋迦文佛，為文殊師利所發意自致成佛，我等何為懈怠？』",
        "translation": "Now, this is the Śākyamuni Buddha who has arisen the intention to become a buddha for himself because of what Mañjuśrī has done, so why are we lazy?'",
        "source": "T15n0626_001:0394b23_19"
    },
    {
        "source_sentence": "用是念故其心則堅，悉得盡信阿耨多羅三耶三菩心。",
        "translation": "Because of this thought, his mind becomes resolute, and he fully believes in the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T15n0626_001:0394b24_20"
    },
    {
        "source_sentence": "文殊師利以手變化而得鉢，無所不感動，是謂本之學習。",
        "translation": "Mañjuśrī transformed his hand and obtained the bowl, but nothing moved him. This is reckoned to be his original training.",
        "source": "T15n0626_001:0394b25_21"
    },
    {
        "source_sentence": "從是剎土乃到下方，過不可數人，皆悉發阿耨多羅三耶三菩心。",
        "translation": "Innumerable people came down from that land and all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T15n0626_001:0394b27_22"
    },
    {
        "source_sentence": "十方今現在諸佛，皆以珍寶華蓋用供養法故，悉覆三千大千之剎土，從其華蓋盡聞其音，",
        "translation": "The buddhas of the ten directions all covered the great manifold cosmos with jeweled flower canopies and heard their sounds from those canopies.",
        "source": "T15n0626_001:0394b28_23"
    },
    {
        "source_sentence": "如釋迦文佛之所言，皆文殊師利之所感動。」",
        "translation": "As Śākyamuni Buddha said, they're all moved by Mañjuśrī.",
        "source": "T15n0626_001:0394c01_24"
    },
    {
        "source_sentence": "佛語舍利弗：「若男子女人欲疾般泥洹者，當發阿耨多羅三耶三菩心。",
        "translation": "The Buddha said to Śāriputra, If a man or woman wants to quickly enter nirvāṇa, they must give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T15n0626_001:0394c03_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0394c04_1"
    },
    {
        "source_sentence": "有人畏生死而不能發心為阿耨多羅三耶三菩心，欲求聲聞作阿羅漢早取般泥洹。",
        "translation": "Some people fear birth and death but can't give rise to the intention to become an unsurpassed, correct, and complete bodhisattva who wants to seek śrāvaka status as an arhat and quickly attain parinirvāṇa.",
        "source": "T15n0626_001:0394c04_2"
    },
    {
        "source_sentence": "其作是言者，我續見在於生死中。",
        "translation": "Those who say this, 'I continue to see myself in birth and death.'",
        "source": "T15n0626_001:0394c06_3"
    },
    {
        "source_sentence": "有菩薩而精進者，已成至佛。",
        "translation": "If there are bodhisattvas who make effort, they've already become buddhas.",
        "source": "T15n0626_001:0394c07_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0394c08_5"
    },
    {
        "source_sentence": "以過去無央數不可計阿僧祇劫，爾時有佛號字一切度，壽一萬歲，有百億弟子。",
        "translation": "In the past, during an incalculable number of incalculably long eons, there was a buddha named Sarvasaṃdarśana with a life span of 10,000 years and 10 billion disciples.",
        "source": "T15n0626_001:0394c08_6"
    },
    {
        "source_sentence": "有尊比丘名莫能勝，其智慧甚巍巍。",
        "translation": "There was a venerable monk named Mahāprajñāpāramitā, whose wisdom was so lofty and majestic.",
        "source": "T15n0626_001:0394c10_7"
    },
    {
        "source_sentence": "後有尊比丘名得大願，其神足甚亦巍巍。",
        "translation": "Later, there was a venerable monk named Mahāprajñāpāramitā whose miraculous powers were so great and majestic.",
        "source": "T15n0626_001:0394c11_8"
    },
    {
        "source_sentence": "爾時怛薩阿竭整衣服持鉢，與比丘俱入常名聞國分衛。",
        "translation": "It was then that the tathāgata gathered his robes, bowls, and bowls, entered with the monks into the country of constant fame and reputation as part of the guard.",
        "source": "T15n0626_001:0394c12_0"
    },
    {
        "source_sentence": "其尊比丘智慧備足者在佛之右，其神足比丘在佛之左，有尊比丘名悔智，",
        "translation": "To the right of the Buddha is the Venerable Bhikṣu Arhat, who is endowed with knowledge and wisdom. To the left of the Buddha is the bhikṣu Sarvāstivāda, and to the left of him is the venerable bhikṣu Renunciant Knowledge.",
        "source": "T15n0626_001:0394c13_1"
    },
    {
        "source_sentence": "隨佛後而侍之。",
        "translation": "He followed the Buddha and attended him.",
        "source": "T15n0626_001:0394c15_0"
    },
    {
        "source_sentence": "八千菩薩而在前導，中有如釋者，中有如天子被服者，中有如天者，中有如四天王者，",
        "translation": "Among the eight thousand bodhisattvas who led the procession, there were those like Śākyamuni. Some of them were as numerous as the number of celestial beings in heaven; some were as numerous as gods; and some were as numerous as the four guardian kings of heaven.",
        "source": "T15n0626_001:0394c15_1"
    },
    {
        "source_sentence": "皆悉令人治道，用怛薩阿竭故。」",
        "translation": "They all cause people to cultivate the path, which is because they use tathāgatas.",
        "source": "T15n0626_001:0394c17_2"
    },
    {
        "source_sentence": "佛語舍利弗：「時佛以入彼城道徑而過於市。",
        "translation": "The Buddha said to Śāriputra, At the time, the Buddha entered that city on a pathway and passed through the marketplace.",
        "source": "T15n0626_001:0394c18_0"
    },
    {
        "source_sentence": "有三尊者子，各各尚小，莊嚴被服甚姝好，而共坐戲。",
        "translation": "Each of the three venerable sons, each still small in stature and adorned themselves with very beautiful clothes, sat together and played.",
        "source": "T15n0626_001:0394c19_0"
    },
    {
        "source_sentence": "是一兒遙見佛且來，及諸比丘菩薩光明甚巍巍。",
        "translation": "One child saw the Buddha coming from a distance, and the light of the monks and bodhisattvas was so majestic.",
        "source": "T15n0626_001:0394c20_1"
    },
    {
        "source_sentence": "其小兒謂二兒，以手遙指示之，乃見怛薩阿竭來，光明與相隨者不甚好乃爾。",
        "translation": "The boy said to the two children, pointed at them from a distance with his hand, and saw Tathāgata coming, but that light and those who followed him weren't very good.",
        "source": "T15n0626_001:0394c21_2"
    },
    {
        "source_sentence": "其二兒則言：『以見之。』",
        "translation": "The two children then said, 'I'll see it.'",
        "source": "T15n0626_001:0394c23_3"
    },
    {
        "source_sentence": "是一兒便言：『此者一切之中極尊而無與等者，吾等當供養。",
        "translation": "The one child then said, 'This is the most honored among all people and there's no equal, so we will make offerings to him.",
        "source": "T15n0626_001:0394c23_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0394c25_0"
    },
    {
        "source_sentence": "其福無量。』",
        "translation": "Their merit is immeasurable.'",
        "source": "T15n0626_001:0394c25_1"
    },
    {
        "source_sentence": "其二兒則答言：『亦無華香，當何以供之？』",
        "translation": "The two children then replied, 'There's no flower or fragrance, so what should we offer them?'",
        "source": "T15n0626_001:0394c25_2"
    },
    {
        "source_sentence": "其一兒則脫著身白珠著手中，便報謂二兒：『是猶可以供佛智者。",
        "translation": "The one child then took off his white pearl in his hand and said to the two children, 'That's still an offering for the Buddha's wisdom.",
        "source": "T15n0626_001:0394c26_3"
    },
    {
        "source_sentence": "見怛薩阿竭，不當作貪。』",
        "translation": "Seeing a tathāgata, he won't become greedy.'",
        "source": "T15n0626_001:0394c27_4"
    },
    {
        "source_sentence": "則其二兒効解取著頭上白珠著其手中，即各歎言，行至佛所，譬若度水。",
        "translation": "The two children then took the white pearl on their heads, placed it in their hands, and went to the Buddha with admiration, just as if they were crossing over water.",
        "source": "T15n0626_001:0394c28_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0395a01_6"
    },
    {
        "source_sentence": "以其心淨而等住故。",
        "translation": "It's because their mind is pure and equally abiding.",
        "source": "T15n0626_001:0395a01_7"
    },
    {
        "source_sentence": "是一兒復問二兒：『持是功德以何求索？』",
        "translation": "The one child then asked the two children, 'Why do you ask for this merit?'",
        "source": "T15n0626_001:0395a01_8"
    },
    {
        "source_sentence": "其一兒言：『願如佛右面尊比丘。』",
        "translation": "The one child said, 'May it be like the Bhagavān Bhikṣu on the right side of the Buddha.'",
        "source": "T15n0626_001:0395a02_9"
    },
    {
        "source_sentence": "其一兒言：『願如左面神足比丘。』",
        "translation": "The one child said, 'May it be like the monk with miraculous feet on his left side.'",
        "source": "T15n0626_001:0395a03_10"
    },
    {
        "source_sentence": "是二兒各各有是願已，復共問一兒：『若願何等？』",
        "translation": "After each of these two children had this vow, they each asked another child together, 'What's the vow?'",
        "source": "T15n0626_001:0395a04_11"
    },
    {
        "source_sentence": "即報言：『我欲如佛，其光明無輩，如師子獨步，常有眾而隨我。』",
        "translation": "He then replied, 'I want to be like the Buddha, whose light is without class, like a lion walking alone and always accompanied by many people.'",
        "source": "T15n0626_001:0395a05_12"
    },
    {
        "source_sentence": "是兒作是說時，虛空中八千天子皆言：『善哉善哉！",
        "translation": "When that child spoke these words, 8,000 celestial beings in the sky all said, 'Good, good!'",
        "source": "T15n0626_001:0395a06_13"
    },
    {
        "source_sentence": "如若之所言，天上天下一切蒙若恩。』",
        "translation": "As you say, all the gods and goddesses in heaven and earth receive such kindness.'",
        "source": "T15n0626_001:0395a07_14"
    },
    {
        "source_sentence": "是三兒相將來至佛前。",
        "translation": "These three sons were about to come before the Buddha.",
        "source": "T15n0626_001:0395a08_15"
    },
    {
        "source_sentence": "其怛薩阿竭呼侍者沙竭：『汝乃見是三兒而持白珠來者不？",
        "translation": "The tathāgata then called the attendant Śākyamuni, 'Have you seen these three children come with white pearls?'",
        "source": "T15n0626_001:0395a09_16"
    },
    {
        "source_sentence": "其中央行小兒，悅心精進來行，舉其一足時，却其罪百劫。",
        "translation": "A small child in the central bank, delighted with his mind and effort, came to walk; when he lifted one foot, he expelled a hundred kalpas of sins.",
        "source": "T15n0626_001:0395a10_17"
    },
    {
        "source_sentence": "如下一足，後事事當更百遮迦越羅。",
        "translation": "It's like the following one leg, which will be followed by a hundred more kṣatriyas for each of the things that follow.",
        "source": "T15n0626_001:0395a11_18"
    },
    {
        "source_sentence": "如是數，當復更釋亦如是，其梵天亦等如是，其一舉足之功德中百見佛。』",
        "translation": "Such is the number, and I'll explain again that it's likewise, and so is the Brahma Heaven, which has a hundred views of the Buddha among the merits of one lift of his feet.'",
        "source": "T15n0626_001:0395a12_19"
    },
    {
        "source_sentence": "語適竟，是三兒已到，前為怛薩阿竭作禮，各各以其白珠散佛上。",
        "translation": "When they had finished speaking, the three children had arrived and bowed to the tathāgata in front of them, each with their white pearls scattered on top of the Buddha.",
        "source": "T15n0626_001:0395a14_20"
    },
    {
        "source_sentence": "其二兒發聲聞意者，所散珠各在佛上肩昇；",
        "translation": "Those two children who had the intention to become śrāvakas each scattered jewels above the Buddha, rising up over his shoulders.",
        "source": "T15n0626_001:0395a15_21"
    },
    {
        "source_sentence": "其一兒發阿耨多羅三耶三菩心者，而散白珠在佛頭上，而在虛空化為珠華交露之帳，",
        "translation": "One of those children, who had set their minds on supreme perfect enlightenment, scattered white pearls over the Buddha’s head and in space transformed them into canopies of jewel flowers.",
        "source": "T15n0626_001:0395a16_22"
    },
    {
        "source_sentence": "正等而四方，中有床，怛薩阿竭而坐之。",
        "translation": "There was a seat in each of the four directions, facing straight and east, where he sat cross-legged.",
        "source": "T15n0626_001:0395a18_23"
    },
    {
        "source_sentence": "其佛則時笑。",
        "translation": "The Buddha then smiled at that time.",
        "source": "T15n0626_001:0395a19_24"
    },
    {
        "source_sentence": "沙竭勃問佛：『怛薩阿竭所笑，會當有意。",
        "translation": "Śākyamuni asked the Buddha, 'The Tathāgata's laughter will be intentional.",
        "source": "T15n0626_001:0395a19_25"
    },
    {
        "source_sentence": "願聞其說。』",
        "translation": "May I hear what he teaches?'",
        "source": "T15n0626_001:0395a20_26"
    },
    {
        "source_sentence": "佛言：『見二兒發聲聞意者不？",
        "translation": "The Buddha said, 'Do you see two children who give rise to the śrāvaka mind?'",
        "source": "T15n0626_001:0395a20_27"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0395a21_28"
    },
    {
        "source_sentence": "皆畏生死之懼故，是以不發菩薩心。",
        "translation": "Because they all fear the fear of birth and death, they don't give rise to the bodhisattva mind.",
        "source": "T15n0626_001:0395a21_29"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0395a22_30"
    },
    {
        "source_sentence": "欲疾般泥洹故。』",
        "translation": "It's because they want to quickly pass into nirvāṇa.'",
        "source": "T15n0626_001:0395a22_31"
    },
    {
        "source_sentence": "其侍者問：『其一兒當云何？』",
        "translation": "The attendant asked, 'What will that one child do?'",
        "source": "T15n0626_001:0395a23_32"
    },
    {
        "source_sentence": "佛復謂言：『是中央兒以後自致成佛，是二兒乃為作聲聞，其一者智慧甚當尊，",
        "translation": "The Buddha then said to them, “These two śrāvakas will attain buddhahood after me. One of them will be the most distinguished among śrāvakas in terms of his knowledge and wisdom.",
        "source": "T15n0626_001:0395a23_33"
    },
    {
        "source_sentence": "一者神足亦復爾。』」",
        "translation": "One, the miraculous powers are likewise.'",
        "source": "T15n0626_001:0395a25_34"
    },
    {
        "source_sentence": "釋迦文佛問舍利弗：「汝乃知是中央兒不？」",
        "translation": "Śākyamuni Buddha asked Śāriputra, Do you know this is the central child?",
        "source": "T15n0626_001:0395a26_0"
    },
    {
        "source_sentence": "舍利弗言：「不及。」",
        "translation": "Śāriputra said, Not enough.",
        "source": "T15n0626_001:0395a26_1"
    },
    {
        "source_sentence": "佛言：「則我身是。",
        "translation": "The Buddha said, Then it's me.",
        "source": "T15n0626_001:0395a27_2"
    },
    {
        "source_sentence": "乃知右面之兒不？」",
        "translation": "Do you know the right-handed child?",
        "source": "T15n0626_001:0395a27_3"
    },
    {
        "source_sentence": "舍利弗言：「不及。」",
        "translation": "Śāriputra said, Not enough.",
        "source": "T15n0626_001:0395a28_4"
    },
    {
        "source_sentence": "「爾時之兒，則舍利弗是。",
        "translation": "At the time, that child was Śāriputra.",
        "source": "T15n0626_001:0395a28_5"
    },
    {
        "source_sentence": "其左面之兒，則大目揵連是。」",
        "translation": "The boy on his left side is Mahāmaudgalyāyana.",
        "source": "T15n0626_001:0395a29_0"
    },
    {
        "source_sentence": "佛謂舍利弗：「汝等本畏生死故不發菩薩心，而欲疾般泥洹。",
        "translation": "The Buddha said to Śāriputra, You were originally afraid of birth and death so you didn't give rise to the bodhisattva mind but wanted to quickly enter nirvāṇa.",
        "source": "T15n0626_001:0395a29_1"
    },
    {
        "source_sentence": "觀其一兒發阿耨多羅三耶三菩心者，今我自致成佛。",
        "translation": "Observing that one child who gives rise to the mind of unsurpassed, correct, and complete enlightenment, now I myself will become a buddha.",
        "source": "T15n0626_001:0395b02_2"
    },
    {
        "source_sentence": "如汝等不離吾法，而作聲聞乃得解脫。」",
        "translation": "Just as you won't part from my teaching and become śrāvakas, they'll attain liberation.",
        "source": "T15n0626_001:0395b03_3"
    },
    {
        "source_sentence": "佛復謂舍利弗：「其欲疾般泥洹者，當發意求佛如我。",
        "translation": "Again, the Buddha said to Śāriputra, Those who want to quickly enter nirvāṇa should give rise to the intention to seek the Buddha as I am.",
        "source": "T15n0626_001:0395b04_4"
    },
    {
        "source_sentence": "向之所說其疾者，無過薩芸若。",
        "translation": "Those who told him about his illnesses are no different than the saṃyuktâgama.",
        "source": "T15n0626_001:0395b05_5"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0395b06_6"
    },
    {
        "source_sentence": "無所罣礙故、用持尊故、用無盡故、用阿耨多羅三耶三菩心故、莫能有及等故、持有好故、以過諸聲聞辟支佛故。",
        "translation": "Because there's no obstruction, because it's honored for its use, because its use is inexhaustible, because it uses the mind of unsurpassed, correct, and complete enlightenment, because it can't be equal, because it holds goodness, and because it surpasses the śrāvakas and pratyekbuddhas.",
        "source": "T15n0626_001:0395b06_7"
    },
    {
        "source_sentence": "其欲作者，便得薩芸若意，亦復如是。」",
        "translation": "It's likewise when someone who wants to do so and then gets the idea of sarvajña.",
        "source": "T15n0626_001:0395b08_8"
    },
    {
        "source_sentence": "說摩訶衍品時，萬人悉發阿耨多羅三耶三菩心。",
        "translation": "When the Mahāyāna Chapter was taught, 10,000 people all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T15n0626_001:0395b09_9"
    },
    {
        "source_sentence": "其一一尊比丘，舍利弗、摩訶目揵連、阿難、舍比、摩訶迦葉、蠡越難頭、耶和致難離、分耨頭陀、須菩提等，",
        "translation": "Each of those venerable monks, Śāriputra, Mahāmaudgalyāyana, Ānanda, Śāriputra, Mahākāśyapa, Licchavi, Yavana, Nandi, partially enlightened, and so forth.",
        "source": "T15n0626_001:0395b10_10"
    },
    {
        "source_sentence": "悉以頭面著佛足，皆譽言：「若男子女人欲求道者，當發尊意。",
        "translation": "They all put their heads and faces at the Buddha's feet and praised him, saying, If men and women want to pursue the path, they should give rise to honorable intentions.",
        "source": "T15n0626_001:0395b13_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0395b14_12"
    },
    {
        "source_sentence": "如佛百千以法為吾等說，不能復發作菩薩心，皆而有悔為羅漢故，不如本作五逆惡，",
        "translation": "Just as a hundred thousand buddhas teach the Dharma to us, they can no longer give rise to the mind of enlightening beings. They all have regrets because they're arhats, which are not as bad as the five heinous crimes they committed in the past.",
        "source": "T15n0626_001:0395b14_13"
    },
    {
        "source_sentence": "其罪猶有解脫，可發心為阿耨多羅三耶三菩心。",
        "translation": "Their sins are still liberated, so they can give rise to the mind that arouses the intention for unsurpassed, correct, and complete enlightenment.",
        "source": "T15n0626_001:0395b16_14"
    },
    {
        "source_sentence": "今者以無所益。",
        "translation": "Now, it's because there's nothing to use.",
        "source": "T15n0626_001:0395b17_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0395b18_16"
    },
    {
        "source_sentence": "惟燒佛種故。",
        "translation": "It's only because it burns the Buddha's seed.",
        "source": "T15n0626_001:0395b18_17"
    },
    {
        "source_sentence": "其器者以不堪菩薩心。",
        "translation": "That container is because it doesn't tolerate the bodhisattva's mind.",
        "source": "T15n0626_001:0395b18_18"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0395b19_19"
    },
    {
        "source_sentence": "譬若死人無益於生者。",
        "translation": "It's like a dead person who doesn't benefit from birth.",
        "source": "T15n0626_001:0395b19_20"
    },
    {
        "source_sentence": "今吾等以得脫，無益於天上天下。",
        "translation": "Now that we've attained liberation, it won't help us in heaven or the realm under heaven.",
        "source": "T15n0626_001:0395b20_21"
    },
    {
        "source_sentence": "有兩足若四足者，皆依地而得活。",
        "translation": "If there are two feet or four feet, they'll all rely on the ground to get up.",
        "source": "T15n0626_001:0395b20_22"
    },
    {
        "source_sentence": "其有發心為阿耨多羅三耶三菩心者，諸天及人皆蒙其恩。」",
        "translation": "If someone has the intention to give rise to the mind of unsurpassed, correct, and complete enlightenment, gods and humans will all be blessed by them.",
        "source": "T15n0626_001:0395b21_23"
    },
    {
        "source_sentence": "爾時阿闍世王乘四馬車與群臣俱出，而到佛所，前為作禮而住，白佛言：「一切人從何因緣而作罪？」",
        "translation": "It was then that King Ajātaśatru rode out in a four-horse chariot with his ministers and went to the Buddha, bowed before him, and stayed there. He said to the Buddha, For what reason did all people commit crimes?",
        "source": "T15n0626_001:0395b23_0"
    },
    {
        "source_sentence": "佛語阿闍世：「以住吾我人者便作罪，貪身故而有身用，是故不離其中。」",
        "translation": "The Buddha said to Ajātaśatru, It's because someone who lives among us commits a sin and has bodily function because they crave the body; therefore, they won't part from it.",
        "source": "T15n0626_001:0395b25_1"
    },
    {
        "source_sentence": "阿闍世王復問：「助貪愛者根為在何所？」",
        "translation": "Again, King Ajātaśatru asked, Where is the root that helps those who crave it?",
        "source": "T15n0626_001:0395b26_2"
    },
    {
        "source_sentence": "佛言：「無黠是。」",
        "translation": "The Buddha said, That's not clever.",
        "source": "T15n0626_001:0395b27_3"
    },
    {
        "source_sentence": "則復問：「誰是無黠根？」",
        "translation": "Again, he asked, Who has no wise faculties?",
        "source": "T15n0626_001:0395b28_0"
    },
    {
        "source_sentence": "佛言：「所作與念異，是故根。」",
        "translation": "The Buddha said, What's done is different from what's thought; it's therefore a faculty.",
        "source": "T15n0626_001:0395b28_1"
    },
    {
        "source_sentence": "復問：「何所與念異者？」",
        "translation": "Again, he asked, What's the difference between it and mindfulness?",
        "source": "T15n0626_001:0395b29_2"
    },
    {
        "source_sentence": "佛言：「其本異所作謂是。」",
        "translation": "The Buddha said, It's called that because it's originally different from what it does.",
        "source": "T15n0626_001:0395b29_3"
    },
    {
        "source_sentence": "復問：「本異者何謂是？」",
        "translation": "Again, he asked, What's the original difference?",
        "source": "T15n0626_001:0395c01_4"
    },
    {
        "source_sentence": "佛言：「如幻所化無所有是故異。」",
        "translation": "The Buddha said, It's different because what's transformed by illusion has no existence.",
        "source": "T15n0626_001:0395c01_5"
    },
    {
        "source_sentence": "復問：「誰化者？」",
        "translation": "Again, he asked, Who transforms?",
        "source": "T15n0626_001:0395c02_6"
    },
    {
        "source_sentence": "佛言：「無有造者是故化。」",
        "translation": "The Buddha said, There's no creator who is therefore transformed.",
        "source": "T15n0626_001:0395c02_7"
    },
    {
        "source_sentence": "復問：「無所生無所有，當云何計？」",
        "translation": "Again, he asked, Nothing is produced and nothing exists, so how should it be calculated?",
        "source": "T15n0626_001:0395c03_8"
    },
    {
        "source_sentence": "佛言：「用無有生無所有，故不可計。」",
        "translation": "The Buddha said, Because there's nothing to use and nothing to give rise to, it can't be counted.",
        "source": "T15n0626_001:0395c03_9"
    },
    {
        "source_sentence": "復問：「所疑從何因緣起？」",
        "translation": "Again, he asked, What are the causes and conditions for the doubts that arise?",
        "source": "T15n0626_001:0395c04_10"
    },
    {
        "source_sentence": "佛言：「無所據故。」",
        "translation": "The Buddha said, It's because there's no basis.",
        "source": "T15n0626_001:0395c05_11"
    },
    {
        "source_sentence": "「何謂無所據？」",
        "translation": "What's meant by having no basis?",
        "source": "T15n0626_001:0395c05_12"
    },
    {
        "source_sentence": "佛言：「如所說聞之則疑，是謂不據。」",
        "translation": "The Buddha said, If someone doubts what they've been taught and heard, this is called not relying.",
        "source": "T15n0626_001:0395c05_13"
    },
    {
        "source_sentence": "復問：「何所是道？",
        "translation": "Again, he asked, What's the path?",
        "source": "T15n0626_001:0395c06_14"
    },
    {
        "source_sentence": "何所為信？」",
        "translation": "What is faith?",
        "source": "T15n0626_001:0395c07_0"
    },
    {
        "source_sentence": "佛言：「脫於婬怒癡是為道。",
        "translation": "The Buddha said, Being free of lust, anger, and delusion is the path.",
        "source": "T15n0626_001:0395c07_1"
    },
    {
        "source_sentence": "何所是信？」",
        "translation": "What's faith?",
        "source": "T15n0626_001:0395c07_2"
    },
    {
        "source_sentence": "佛言：「不得諸法根本，其心不異，是故為信。」",
        "translation": "The Buddha said, They don't attain the root of all dharmas and their minds aren't different; therefore, they believe in them.",
        "source": "T15n0626_001:0395c08_3"
    },
    {
        "source_sentence": "阿闍世王即言：「善哉善哉！",
        "translation": "King Ajātaśatru then said, Good, good!",
        "source": "T15n0626_001:0395c09_4"
    },
    {
        "source_sentence": "如怛薩阿竭所說。",
        "translation": "It's as explained in the Tathāgata's teaching.",
        "source": "T15n0626_001:0395c09_5"
    },
    {
        "source_sentence": "一切人所以不信者何？",
        "translation": "Why don't all people believe it?",
        "source": "T15n0626_001:0395c10_6"
    },
    {
        "source_sentence": "自作故。",
        "translation": "It's because it's self-made.",
        "source": "T15n0626_001:0395c10_7"
    },
    {
        "source_sentence": "今我用惡人之言，勅令臣下自殺其父，用貪利國故、用貪財寶故、用貪利宰民故、用貪利尊貴故。",
        "translation": "Now, using the words of a bad person, I've ordered my ministers to commit suicide by killing their father because they crave countries and treasures, govern the people with cravings, and use the noble ones with cravings.",
        "source": "T15n0626_001:0395c10_8"
    },
    {
        "source_sentence": "今我使臣下而害其父，貪身狐疑不能自解，若飲若食在戲樂、若在正殿聽省國事、若在中宮五樂之欲、若獨與眾俱，",
        "translation": "Now, I'm an envoy to harm my father, and I'm greedy with body and wicked doubts, so I can't free myself from it. If I drink or eat at pleasure, if I'm in the main hall listening to national affairs, if I'm in the middle palace with five pleasant desires, or if I'm alone with the crowd,",
        "source": "T15n0626_001:0395c12_9"
    },
    {
        "source_sentence": "晝夜而不忘，飲食則不能消，亦無其臥，顏色亦無和悅。",
        "translation": "Day and night, he doesn't forget it, and neither does he eat or drink, nor does he have a bed or seat, nor is his appearance graceful.",
        "source": "T15n0626_001:0395c15_10"
    },
    {
        "source_sentence": "時其心常怖懅，知不離於泥犁。」",
        "translation": "At the time, his mind was always fearful and frightened, knowing he wouldn't leave the mud plow.",
        "source": "T15n0626_001:0395c16_11"
    },
    {
        "source_sentence": "則復陳言：「若盲者承佛所得眼目，若為水所溺者依佛而得脫，其有苦痛者佛而令得安，",
        "translation": "Again, Ānanda, if a blind man receives the Buddha’s vision and eyes, and if he is submerged in water, he relies on the Buddha to attain liberation. If he has any pain or suffering, he is cured by the Buddha.",
        "source": "T15n0626_001:0395c17_12"
    },
    {
        "source_sentence": "其有恐懅者佛而為作護，其有貧窮者佛能為作珍寶，其有失道徑者能示於道路。",
        "translation": "Those who fear anger are guarded by the Buddha, those who are poor can be protected by the Buddha as treasures, and those who have lost their way can be shown the path.",
        "source": "T15n0626_001:0395c19_13"
    },
    {
        "source_sentence": "佛以加大哀不以為勤劇，等心於一切堅固而作厚，常忍於苦樂不捨於一切人。",
        "translation": "Because the Buddha had great compassion and didn't think of it as suffering, his mind was equally generous with all kinds of firmness, always tolerating pain and pleasure and not abandoning all people.",
        "source": "T15n0626_001:0395c21_14"
    },
    {
        "source_sentence": "今我身而怖懅，惟佛當加護，令危者而得安。",
        "translation": "Now, I'm afraid of myself, but the Buddha will protect me and make those in danger attain peace.",
        "source": "T15n0626_001:0395c23_15"
    },
    {
        "source_sentence": "身無有能救者，唯願而得濟，無所歸者唯願受其歸命。",
        "translation": "There's no one in his body who can save them, but he only wishes to be rescued, and those who don't have anything to turn to simply wish to receive their returning life.",
        "source": "T15n0626_001:0395c24_16"
    },
    {
        "source_sentence": "譬若無眼目唯得而視瞻，如人之欲躄惟令而得往。",
        "translation": "It's like someone who doesn't have eyes or eyes that can only see and looks, just as a person's desire is to contemplate and order them to go.",
        "source": "T15n0626_001:0395c25_17"
    },
    {
        "source_sentence": "今當入阿鼻乃至大泥犁，願令得不入。",
        "translation": "Now, I'll enter the avīci and even the great mud plow, wishing to make it so that they won't enter.",
        "source": "T15n0626_001:0395c26_18"
    },
    {
        "source_sentence": "惟怛薩阿竭今當為我解說吾之狐疑，令心而得開至死無餘疑，令重罪而得微輕。」",
        "translation": "But the tathāgata will now explain my doubts for me, so that my mind will be opened up to death without remaining doubts and my serious sins will be lightened.",
        "source": "T15n0626_001:0395c27_19"
    },
    {
        "source_sentence": "佛念阿闍世王，其所說甚深而微妙，是病莫能療之者，獨佛文殊師利而有感應。",
        "translation": "The Buddha was mindful of King Ajātaśatru, who taught so profoundly and subtly that no one could treat this illness; it was only the Buddha Mañjuśrī alone who had an effect.",
        "source": "T15n0626_001:0395c29_20"
    },
    {
        "source_sentence": "舍利弗承佛威神，謂阿闍世：「欲決狐疑者明旦作食，請文殊師利等，",
        "translation": "Śāriputra, imbued with the Buddha’s supernatural power, said to Ajātaśatru, “If you wish to resolve your doubts, make a meal tomorrow morning and invite Mañjuśrī and others.",
        "source": "T15n0626_001:0396a02_21"
    },
    {
        "source_sentence": "令到其宮受之者，其若之官屬皆當得其福，并羅閱國諸民皆因是功德可而為本。」",
        "translation": "If someone were to go to their palace and receive it, their officials would all attain merit, and the people of Rājagṛha would all be the source because of this merit.",
        "source": "T15n0626_001:0396a03_22"
    },
    {
        "source_sentence": "阿闍世王則白文殊師利：「惟加大恩，明旦屈德就宮而食。」",
        "translation": "The king Ajātaśatru then said to Mañjuśrī, Please increase your kindness, and tomorrow morning Kumārajīva went to the palace and ate.",
        "source": "T15n0626_001:0396a05_23"
    },
    {
        "source_sentence": "則文殊師利答言：「以足可為供養已。」",
        "translation": "Mañjuśrī then answered, After making an offering with his feet, Mañjuśrī said.",
        "source": "T15n0626_001:0396a07_24"
    },
    {
        "source_sentence": "文殊師利復言：「佛法非以衣食故。」",
        "translation": "Mañjuśrī again said, The Buddha's teaching isn't based on food and clothing.",
        "source": "T15n0626_001:0396a07_25"
    },
    {
        "source_sentence": "阿闍世即白：「當何以施之？」",
        "translation": "The Ajātaśatru then said, How will you give it to him?",
        "source": "T15n0626_001:0396a08_26"
    },
    {
        "source_sentence": "則答言：「若深入微妙，其事審諦無所污亦無所著，亦無所疑無所難、無所畏無所一懼，",
        "translation": "He replied, If he enters deeply into subtlety, his matters are carefully examined without defilement or attachment, without doubt or difficulty, without fear or even a single fear.",
        "source": "T15n0626_001:0396a09_27"
    },
    {
        "source_sentence": "如是者以為得哀。」",
        "translation": "Such a person thinks they'll be saddened.",
        "source": "T15n0626_001:0396a11_28"
    },
    {
        "source_sentence": "文殊師利復語阿闍世：「念諸法，亦不念有亦不念無，是者以為得哀。",
        "translation": "Mañjuśrī again said to Ajātaśatru, Mindful of the teachings, he doesn't think about existence and doesn't think about nonexistence, which is how he takes pity.",
        "source": "T15n0626_001:0396a11_29"
    },
    {
        "source_sentence": "不當念過去意，亦不當念當來意，亦不當念現在意，作是者以得加哀。",
        "translation": "They shouldn't think of the mind of the past, the mind of the future, or the mind of the present, and those who do so will be grieved.",
        "source": "T15n0626_001:0396a13_30"
    },
    {
        "source_sentence": "汝不當念一切之所可見者，亦不誠作是者，以得加哀。」",
        "translation": "You shouldn't think of all the things that are visible, and you don't sincerely do so because you'll be touched by pity.",
        "source": "T15n0626_001:0396a14_31"
    },
    {
        "source_sentence": "阿闍世王復白文殊師利：「如所言，悉法之所載無有異，惟以身故當加哀受其請。」",
        "translation": "The king Ajātaśatru again said to Mañjuśrī, As you've said, there's no difference between what's contained in the full set of teachings; it's only because of your body that you'll accept their request with compassion.",
        "source": "T15n0626_001:0396a15_32"
    },
    {
        "source_sentence": "文殊師利復言：「且止。",
        "translation": "Mañjuśrī again said, Please stop.",
        "source": "T15n0626_001:0396a17_33"
    },
    {
        "source_sentence": "其道者非以是故若飲若食。",
        "translation": "It's not because of this that the practitioner of the Way drinks or eats it.",
        "source": "T15n0626_001:0396a18_34"
    },
    {
        "source_sentence": "若王不念有吾有我壽命人，以念是者以得加哀。",
        "translation": "If the king doesn't think that there's a self and I have someone who has my life span, then he'll be touched with compassion because of this thought.",
        "source": "T15n0626_001:0396a18_35"
    },
    {
        "source_sentence": "若心無所持亦無所緣，亦不四大亦不五陰，亦不六衰亦不持三界，亦不於功德亦不念無有功德，",
        "translation": "If the mind has no support and no object, it doesn’t have four elements or five aggregates, neither the six forms of decay, neither sustaining the three realms, neither virtue, nor mindfulness, and there is no virtue.",
        "source": "T15n0626_001:0396a20_0"
    },
    {
        "source_sentence": "亦不於俗亦不於道，亦不於罪亦不於無罪，亦不於餘亦不於無餘，亦不於脫亦不於無脫，",
        "translation": "neither in the worldly, nor in the path; neither in sins, nor without sins; neither what’s left over, nor what’s not left over; neither liberation, nor non-liberation.",
        "source": "T15n0626_001:0396a22_1"
    },
    {
        "source_sentence": "亦不於生死亦不於泥洹，作如是者以得加哀。」",
        "translation": "Nor in birth-and-death, nor in nirvāṇa, those who do so will be grieved.",
        "source": "T15n0626_001:0396a24_2"
    },
    {
        "source_sentence": "阿闍世王復白文殊師利：「聞如是法倍復踊躍，以是故欲請之，令我緣是而得安隱。」",
        "translation": "The king Ajātaśatru again said to Mañjuśrī, Hearing such a teaching, he jumped twice as high and wanted to invite it so that I could attain peace because of this.",
        "source": "T15n0626_001:0396a25_3"
    },
    {
        "source_sentence": "文殊師利答言：「汝希望有所緣欲得安隱，是以不緣則無安隱。",
        "translation": "Mañjuśrī replied, You wish to attain peace because you have some conditions, but if you don't have them, there won't be peace.",
        "source": "T15n0626_001:0396a27_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0396a28_5"
    },
    {
        "source_sentence": "因其法無所緣無有安，不念是亦不貢高，一切無所念，是故緣是故安。",
        "translation": "Because their dharmas have no perceptual objects and no peace, they don't think of them as such and don't become arrogant, and all things lack perceptual objects; therefore, perceptual objects are thus peaceful.",
        "source": "T15n0626_001:0396a29_6"
    },
    {
        "source_sentence": "於是中無惡意，後復無災變者。",
        "translation": "At that point, there's no bad intention, and there's no calamity after that.",
        "source": "T15n0626_001:0396b01_7"
    },
    {
        "source_sentence": "後有災變者是則不安，從本至竟無有異是乃為安。」",
        "translation": "If there's later a calamity, then it's peaceful; if there's no difference from the original to the end, then it's peaceful.",
        "source": "T15n0626_001:0396b02_8"
    },
    {
        "source_sentence": "阿闍世復問：「說何所法而無異可得安？」",
        "translation": "Again, the Ajātaśatru asked, What teaching does it say that's not different and can be peaceful?",
        "source": "T15n0626_001:0396b03_9"
    },
    {
        "source_sentence": "文殊師利言：「若空無作者，無有能作者，無有想、無有願、無有作，",
        "translation": "Mañjuśrī said, If emptiness has no author, there’s no one who can author it. There is no ideation, no wishing, and no doing.",
        "source": "T15n0626_001:0396b04_10"
    },
    {
        "source_sentence": "亦無有作者。",
        "translation": "Nor is there an author.",
        "source": "T15n0626_001:0396b06_0"
    },
    {
        "source_sentence": "其有念我有所作無所作，是故為異。",
        "translation": "It's because they have mindfulness of self doing what's done and nothing to do, which is why it's different.",
        "source": "T15n0626_001:0396b06_1"
    },
    {
        "source_sentence": "亦不求無所緣，身口意是為作。",
        "translation": "Nor does he seek without any perceptual object, which is bodily, verbal, or mental action.",
        "source": "T15n0626_001:0396b07_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0396b07_3"
    },
    {
        "source_sentence": "無生死想。",
        "translation": "There's no conception of birth-and-death.",
        "source": "T15n0626_001:0396b08_4"
    },
    {
        "source_sentence": "是故諸法若有所緣，當知悉無所緣。」",
        "translation": "Therefore, if all dharmas have perceptual objects, you should know that they all lack perceptual objects.",
        "source": "T15n0626_001:0396b08_5"
    },
    {
        "source_sentence": "阿闍世復問：「何謂生死無生死？」",
        "translation": "Again, the Ajātaśatru asked, What's meant by birth and death without birth and death?",
        "source": "T15n0626_001:0396b09_6"
    },
    {
        "source_sentence": "則言：不念過去以盡。",
        "translation": "They then say, It's because they don't think of the past to exhaust it.",
        "source": "T15n0626_001:0396b09_7"
    },
    {
        "source_sentence": "亦不念當來未至。",
        "translation": "Nor does he think of the future that has yet to come.",
        "source": "T15n0626_001:0396b10_8"
    },
    {
        "source_sentence": "亦不念今「現在而無常，於諸法不念有所增有所減，作者是生死則無生死。」",
        "translation": "Nor does he think now, The present is impermanent, and the dharmas that aren't mindful of increase or decrease are produced by birth and death, so there's no birth and death.",
        "source": "T15n0626_001:0396b10_9"
    },
    {
        "source_sentence": "阿闍世復問：「未脫者當云何與道合？」",
        "translation": "Again, the Ajātaśatru asked, How will those who haven't yet liberated be united with the path?",
        "source": "T15n0626_001:0396b12_10"
    },
    {
        "source_sentence": "文殊師利言：「汝知日明與冥合不？」",
        "translation": "Mañjuśrī said, Do you know whether the sun and the moon are united with the darkness?",
        "source": "T15n0626_001:0396b13_11"
    },
    {
        "source_sentence": "阿闍世言：「不合。",
        "translation": "The Ajātaśatru said, It doesn't fit.",
        "source": "T15n0626_001:0396b14_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0396b14_13"
    },
    {
        "source_sentence": "日出眾冥晦滅。」",
        "translation": "The sun rises and the multitude disappears in obscurity.",
        "source": "T15n0626_001:0396b14_14"
    },
    {
        "source_sentence": "文殊師利言：「王寧知冥所去處乎？」",
        "translation": "Mañjuśrī said, Does the king know where he's going in the dark?",
        "source": "T15n0626_001:0396b15_15"
    },
    {
        "source_sentence": "答言：「不見可處，而在何所處？」",
        "translation": "He replied, I don't see a place, but where is it?",
        "source": "T15n0626_001:0396b15_16"
    },
    {
        "source_sentence": "文殊師利言：「所謂道智來時，譬若日出不可知眾冥所在，如是時亦不知未脫所在。」",
        "translation": "Mañjuśrī said, When the so-called knowledge of the path comes, it's like when the sun rises and doesn't know where the darkness is, and when it does so, it doesn't know where it's not yet liberated.",
        "source": "T15n0626_001:0396b16_17"
    },
    {
        "source_sentence": "文殊師利復言：「道與未脫等、未脫與道等。",
        "translation": "Mañjuśrī again said, The path is equal to what's not liberated, and what's not liberated is equal to the path.",
        "source": "T15n0626_001:0396b18_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0626_001:0396b19_19"
    },
    {
        "source_sentence": "俱空故，未脫與道等故。",
        "translation": "Because they are both empty: because they are not liberation and the same as the path.",
        "source": "T15n0626_001:0396b19_20"
    },
    {
        "source_sentence": "諸法平等，其知是者未脫則為作道。",
        "translation": "The dharmas are equal, and those who know this before they're liberated will then make the path for them.",
        "source": "T15n0626_001:0396b20_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0626_001:0396b21_0"
    },
    {
        "source_sentence": "求不脫不知處，是故曰道。",
        "translation": "Seeking doesn't leave the place of not knowing, so it's therefore called the path.",
        "source": "T15n0626_001:0396b21_1"
    },
    {
        "source_sentence": "其求不脫處而不可見，是則道。」",
        "translation": "If someone seeks a place that's not liberated but can't be seen, this is the path.",
        "source": "T15n0626_001:0396b21_2"
    },
    {
        "source_sentence": "阿闍世復問：「云何不脫而為道？」",
        "translation": "The Ajātaśatru again asked, How is it the path that isn't liberation?",
        "source": "T15n0626_001:0396b22_3"
    },
    {
        "source_sentence": "文殊師利言：「於不脫是為道，不作是者為道。」",
        "translation": "Mañjuśrī said, Not being liberated is the path, and not doing so is the path.",
        "source": "T15n0626_001:0396b23_4"
    },
    {
        "source_sentence": "阿闍世復問：「其道者當云何學？」",
        "translation": "The Ajātaśatru again asked, How will that person of the Way learn?",
        "source": "T15n0626_001:0396b24_5"
    },
    {
        "source_sentence": "則答言：「如學諸法。」",
        "translation": "He then answered, As I've studied the teachings.",
        "source": "T15n0626_001:0396b24_6"
    },
    {
        "source_sentence": "阿闍世復問：「以學諸法寧有處所不？」",
        "translation": "Again, the Ajātaśatru asked, Is there a place for training in the teachings?",
        "source": "T15n0626_001:0396b25_7"
    },
    {
        "source_sentence": "文殊師利言：「作是學道不可至。」",
        "translation": "Mañjuśrī said, Do this as a path of training that can't be reached.",
        "source": "T15n0626_001:0396b26_8"
    },
    {
        "source_sentence": "阿闍世復問：「其學者當至泥洹不？」",
        "translation": "Again, the Ajātaśatru asked, Will that scholar go to nirvāṇa?",
        "source": "T15n0626_001:0396b26_9"
    },
    {
        "source_sentence": "文殊師利言：「乃有法從泥洹來，言我從泥洹來？」",
        "translation": "Mañjuśrī said, Is there a teaching that comes from nirvāṇa and says I come from nirvāṇa?",
        "source": "T15n0626_001:0396b27_10"
    },
    {
        "source_sentence": "阿闍世即言：「亦無往者，亦無來者。」",
        "translation": "The Ajātaśatru then said, There's no going or coming either.",
        "source": "T15n0626_001:0396b28_11"
    },
    {
        "source_sentence": "文殊師利謂阿闍世：「其學道知無處所，是故道。」",
        "translation": "Mañjuśrī said to Ajātaśatru, That person who trains in the path knows there's no place; this is therefore the path.",
        "source": "T15n0626_001:0396b29_12"
    },
    {
        "source_sentence": "阿闍世復問：「當何所住道而學作是？」",
        "translation": "Again, the Ajātaśatru asked, Where will you abide in the path and train like this?",
        "source": "T15n0626_001:0396c01_13"
    },
    {
        "source_sentence": "則答言：「無所住是為學道。」",
        "translation": "He answered, Nothing to abide in is the path of training.",
        "source": "T15n0626_001:0396c02_14"
    },
    {
        "source_sentence": "阿闍世復問：「其學道者不作淨戒、三昧、智慧住？」",
        "translation": "Again, the Ajātaśatru asked, Doesn't a practitioner of the path cultivate pure morality, samādhi, and wisdom?",
        "source": "T15n0626_001:0396c02_15"
    },
    {
        "source_sentence": "即答言：「其道者不緣戒、不求三昧、不貢高於智慧住。」",
        "translation": "He answered, That person of the Way doesn't rely on precepts, doesn't seek samādhi, and doesn't abide arrogantly in wisdom.",
        "source": "T15n0626_001:0396c04_0"
    },
    {
        "source_sentence": "文殊師利謂阿闍世：「乃可緣戒、求三昧、貢高於智慧，作如是則有住處不？」",
        "translation": "Mañjuśrī said to the Ajātaśatru, Is there a dwelling place for observing precepts, seeking samādhi, and exalting wisdom when you do so?",
        "source": "T15n0626_001:0396c05_1"
    },
    {
        "source_sentence": "阿闍世言：「無。」",
        "translation": "The Ajātaśatru said, No.",
        "source": "T15n0626_001:0396c06_2"
    },
    {
        "source_sentence": "文殊師利言：「故當如道無所住。」",
        "translation": "Mañjuśrī said, Therefore, there's nothing to abide in like the path.",
        "source": "T15n0626_001:0396c07_3"
    },
    {
        "source_sentence": "阿闍世復問：「若男子女人當云何自前於道？」",
        "translation": "Again, the Ajātaśatru asked, If a man or woman were to go on the path for themselves, how would they do so?",
        "source": "T15n0626_001:0396c07_4"
    },
    {
        "source_sentence": "文殊師利言：「其欲學道者，不見法有常無常，不見法有脫無有脫，亦不見法安若苦者，",
        "translation": "Mañjuśrī said, Those who want to train in the path don't see things as permanent or impermanent, don't see things as liberation or non-liberation, and don't see things as peaceful or painful.",
        "source": "T15n0626_001:0396c08_5"
    },
    {
        "source_sentence": "亦不見法是我若一切人，亦不見法在生死至泥洹者，作是學道者為以前。」",
        "translation": "They don't see the Dharma as self or all people, and they don't see the Dharma in birth-and-death up to nirvāṇa; those who do so are those who train in the path before them.",
        "source": "T15n0626_001:0396c10_6"
    },
    {
        "source_sentence": "阿闍世王即言：「善哉善哉！",
        "translation": "King Ajātaśatru then said, Good, good!",
        "source": "T15n0626_001:0396c12_7"
    },
    {
        "source_sentence": "如文殊師利菩薩之所言。",
        "translation": "As Mañjuśrī Bodhisattva said.",
        "source": "T15n0626_001:0396c13_8"
    },
    {
        "source_sentence": "惟願受其請。",
        "translation": "I only wish to accept his invitation.",
        "source": "T15n0626_001:0396c13_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0396c14_0"
    },
    {
        "source_sentence": "用狐疑故。",
        "translation": "It's because they use doubt and doubt.",
        "source": "T15n0626_001:0396c14_1"
    },
    {
        "source_sentence": "熟自思念，如諸法無吾無我、無壽無命，而我有狐疑。」",
        "translation": "He matures his thoughts and thinks to himself, 'Thus, the dharmas lack self, selflessness, life, and longevity, and I have doubts.'",
        "source": "T15n0626_001:0396c14_2"
    },
    {
        "source_sentence": "文殊師利言：「如無者不可令有，以無者亦不脫亦無所脫，其說我者而有脫者，",
        "translation": "Mañjuśrī said, Just as there is nothing that cannot be made to exist, and because there is nothing, neither is liberation possible nor anything liberated; whoever speaks of self but has liberation.",
        "source": "T15n0626_001:0396c15_3"
    },
    {
        "source_sentence": "以無有脫者亦不脫亦無所脫。",
        "translation": "It's because there's no liberation, and those who aren't liberated are also liberated and nothing to be liberated.",
        "source": "T15n0626_001:0396c17_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0396c18_5"
    },
    {
        "source_sentence": "諸法悉脫故。」",
        "translation": "It's because all dharmas are completely liberated.",
        "source": "T15n0626_001:0396c18_6"
    },
    {
        "source_sentence": "佛謂文殊師利：「受阿闍世王請，用無央數人故。」",
        "translation": "The Buddha said to Mañjuśrī, Accept the invitation of King Ajātaśatru for an incalculable number of people.",
        "source": "T15n0626_001:0396c18_7"
    },
    {
        "source_sentence": "文殊師利則言：「惟受怛薩阿竭教。",
        "translation": "Mañjuśrī then said, Only accept the teaching of the tathāgata.",
        "source": "T15n0626_001:0396c19_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0626_001:0396c20_9"
    },
    {
        "source_sentence": "不違教故。」",
        "translation": "It's because it doesn't disobey the teaching.",
        "source": "T15n0626_001:0396c20_10"
    },
    {
        "source_sentence": "阿闍世則踊躍歡喜，便從座起，為佛諸比丘及文殊師利作禮而去。",
        "translation": "The Ajātaśatru then jumped and rejoiced, rose from his seat, paid homage to the Buddha's monks and Mañjuśrī, and departed.",
        "source": "T15n0626_001:0396c21_11"
    },
    {
        "source_sentence": "阿闍世行，且問舍利弗：「文殊師利等輩者幾人？」",
        "translation": "The Ajātaśatru then asked Śāriputra, Mañjuśrī and others, How many people are there?",
        "source": "T15n0626_001:0396c22_12"
    },
    {
        "source_sentence": "舍利弗言：「五百人悉令於宮食。」",
        "translation": "Śāriputra said, All five hundred people will be allowed to eat at the palace.",
        "source": "T15n0626_001:0396c23_13"
    },
    {
        "source_sentence": "便從道歸於城。",
        "translation": "He then returned from the path to the city.",
        "source": "T15n0626_001:0396c24_14"
    },
    {
        "source_sentence": "即勅大宮令作百味之食。",
        "translation": "He then ordered the great palace to make a hundred flavors of food.",
        "source": "T15n0626_001:0396c24_15"
    },
    {
        "source_sentence": "即日治其殿上，施其幢幡帷帳華蓋，以華布其地，悉持名香而熏之。",
        "translation": "On the same day, he filled his hall with banners, pennants, curtains, drapes, and flower canopies, spread them on the ground, and perfumed them all with a name-causing fragrance.",
        "source": "T15n0626_001:0396c25_16"
    },
    {
        "source_sentence": "設五百高床，皆布名珠琬[王*延]其色若干，合宮之內悉皆治嚴，以華香遍之。",
        "translation": "He set up five hundred high beds, all draped with the name of the pearl [royal*yan] in various colors and adorned inside the combined palace with flowers and fragrances that pervaded it.",
        "source": "T15n0626_001:0396c26_17"
    },
    {
        "source_sentence": "勅令城郭諸街市里皆而掃除，以華香從之，道邊者皆施帷帳幢幡而起除之，",
        "translation": "I ordered all the walls and streets of the city to be swept clean, followed by flowers and incense. All those on the road sides were given curtains, drapes, banners, and pennants to rise up and remove them.",
        "source": "T15n0626_001:0396c28_18"
    },
    {
        "source_sentence": "其里之門皆施雙結華，令諸人民明旦皆當道迎供養。",
        "translation": "The gates of the villages were all decorated with twin lotus blossoms, so that the people would greet and make offerings to them on the way at sunrise.",
        "source": "T15n0626_001:0397a01_19"
    },
    {
        "source_sentence": "文殊師利即初夜，文殊自念：「我與少少俱出至請，亦無他感動，乃可到他方剎土請諸菩薩，",
        "translation": "On the first watch of the night, at dawn, Mañjuśrī thought to himself, “I am coming together with a small group of bhikṣus to invite you. There is no one else who can move me. So please go to another buddha-field and invite the bodhisattvas there.” The Buddha said:",
        "source": "T15n0626_001:0397a02_20"
    },
    {
        "source_sentence": "往到彼所令就請，復悉聽其所說法。」",
        "translation": "They go to their place and make an invitation, and they'll all hear what they teach.",
        "source": "T15n0626_001:0397a04_21"
    },
    {
        "source_sentence": "作是念時，應時如伸臂之頃便從是不現，到東方過八萬二千佛剎，其剎名常名聞，",
        "translation": "When he had this thought, it was as if he were extending his arm at the right time. Soon thereafter he departed and went eastward to one of the eighty-two thousand buddha-lands in the east; that land was called Sadāparibhūta (Skt. Sadāparibhūta).",
        "source": "T15n0626_001:0397a05_22"
    },
    {
        "source_sentence": "其佛號字惟淨首，今現在，有眾菩薩無異道，其剎土常轉阿惟越致法輪。",
        "translation": "The Buddha's name was Vaiśravaṇa, and now there are many bodhisattvas of the same path in that buddha land who always turn the irreversible wheel of the Dharma.",
        "source": "T15n0626_001:0397a07_23"
    },
    {
        "source_sentence": "其土諸樹悉皆眾寶，其葉花實無央數色，風一起時吹其諸樹，但聞佛音、但聞法音及阿惟越致僧音。",
        "translation": "The trees in that land are all made of various treasures, and their leaves and flowers have measureless real colors. When the wind blows together, the trees only hear the sounds of Buddha, Dharma, and abhidharma or saṃgha.",
        "source": "T15n0626_001:0397a09_0"
    },
    {
        "source_sentence": "用是常聞三寶聲，故其剎土名曰沙陀惟瞿吒。",
        "translation": "Because they always hear the sounds of the Three Treasures, their buddha land is called Sadābhikṣuṭa.",
        "source": "T15n0626_001:0397a11_1"
    },
    {
        "source_sentence": "文殊師利已在彼所，為佛作禮，白其怛薩阿竭：「願用我故，盡令菩薩到沙呵剎土，",
        "translation": "Mañjuśrī, who was already there, paid homage to the Buddha and said to his tathāgatas: May it please you, Ānanda, for the sake of me that I cause all bodhisattvas to reach the buddha-field of Sahā.",
        "source": "T15n0626_001:0397a12_2"
    },
    {
        "source_sentence": "至阿闍世所而就食。」",
        "translation": "He went to the Ajātaśatru and ate it.",
        "source": "T15n0626_001:0397a14_3"
    },
    {
        "source_sentence": "佛則謂之：「其欲行者便可往。」",
        "translation": "The Buddha then said to him, Those who want to practice can go there.",
        "source": "T15n0626_001:0397a14_4"
    },
    {
        "source_sentence": "佛說阿闍世王經卷上",
        "translation": "Foshuo  Ajatasatru jing, vol. 1",
        "source": "T15n0626_001:0397a16_0"
    }
]