[
    {
        "source_sentence": "佛說觀佛三昧海經卷第二",
        "translation": "Foshuo guanfo sanmei hai jing, vol. 2",
        "source": "T15n0643_002:0650c25_0"
    },
    {
        "source_sentence": "東晉天竺三藏佛陀跋陀羅譯",
        "translation": "Translated by the Tripiṭaka Master Buddhabhadra of India in the Eastern Jin Dynasty",
        "source": "T15n0643_002:0650c27_0"
    },
    {
        "source_sentence": "觀相品第三之二",
        "translation": "The Third and Second Parts of the Chapter on Contemplation of Characteristics",
        "source": "T15n0643_002:0650c28_0"
    },
    {
        "source_sentence": "佛告父王：「云何名菩薩降魔時白毫相光？",
        "translation": "The Buddha told his father, What's the name of the white-haired mark of a bodhisattva that shines brightly when he subdues Māra?",
        "source": "T15n0643_002:0650c29_0"
    },
    {
        "source_sentence": "魔王波旬遙以天眼觀閻浮提，見釋迦子棄國如唾，坐道樹下肌骨枯槁，",
        "translation": "Māra King Pāpīyān observed Jambudvīpa from a distance with his divine eye and saw that Śākyamuni abandoned his kingdom like spittle and sat under the tree of enlightenment, with his flesh and bones withered.",
        "source": "T15n0643_002:0651a01_0"
    },
    {
        "source_sentence": "形體羸瘠如久病人；",
        "translation": "Their bodies were as thin and emaciated as if they had been ill for a long time.",
        "source": "T15n0643_002:0651a02_1"
    },
    {
        "source_sentence": "唯有金色光明益顯，其眼陷黑如井底星，骨節相跓失蟠龍文。",
        "translation": "The only thing he saw was a golden light that grew brighter, and his eyes sank into black like the star at the bottom of a well. His bones and knuckles were missing the characteristics of a dragon in the shape of a snake.",
        "source": "T15n0643_002:0651a03_2"
    },
    {
        "source_sentence": "波旬喜曰：『瞿曇體羸骨如腐草，雖有光色餘命無幾，曼道未成，宜往敗之。』",
        "translation": "Pāpīyān joyfully said, 'Gautama's body is weak and his bones are like rotten grass; even though he has a shining color, his remaining life isn't long, and it's better to go and defeat him because the maṇḍala hasn't been completed.'",
        "source": "T15n0643_002:0651a04_3"
    },
    {
        "source_sentence": "瞋目大怒勅諸夜叉速集軍眾：『吾今欲行下閻浮提往征瞿曇。』",
        "translation": "The angry-eyed Mahāprajñāpāramitā commanded the yakṣas to quickly gather an army of troops, saying, 'Now, I want to go down to Jambudvīpa to conquer Gautama.'",
        "source": "T15n0643_002:0651a06_4"
    },
    {
        "source_sentence": "「是時魔子名薩多羅，長跪白父：『淨飯王子其生之時，萬神侍御光徹眾天，",
        "translation": "At that time the prince of Māra, named Sadādhara, knelt down and said to his father: Prince Jīvaka, when you are born, myriad deities will serve you.",
        "source": "T15n0643_002:0651a07_5"
    },
    {
        "source_sentence": "其人慈悲普覆一切，今為群生坐於道樹，父王云何興惡逆意？』",
        "translation": "That man's compassionate and universally obedient, and now he's sitting at the tree of enlightenment for the sake of all sentient beings, so why would his father give rise to bad and heinous thoughts?'",
        "source": "T15n0643_002:0651a09_6"
    },
    {
        "source_sentence": "魔即怒曰：『汝幼無知，乃言瞿曇有勝道德。",
        "translation": "The Māra then became angry and said, 'You're young and ignorant, so you say that Gautama has superior morality.",
        "source": "T15n0643_002:0651a10_7"
    },
    {
        "source_sentence": "瞿曇身羸如枯骨人，竟何所能而言慈悲？』",
        "translation": "Gautama's body is weak like a dried-up bone, so how could he say compassion?'",
        "source": "T15n0643_002:0651a11_8"
    },
    {
        "source_sentence": "子復白言：『瞿曇體羸不食故爾，觀其光色如金剛山紫焰流出，恬坐六年心無傾搖；",
        "translation": "Again, the prince said, “Gautama is physically weak and unable to eat.",
        "source": "T15n0643_002:0651a12_9"
    },
    {
        "source_sentence": "觀其面貌曾無畏色。",
        "translation": "He observes that his appearance has never been fearless.",
        "source": "T15n0643_002:0651a14_10"
    },
    {
        "source_sentence": "唯願大王！",
        "translation": "May it please the great king!",
        "source": "T15n0643_002:0651a15_11"
    },
    {
        "source_sentence": "且住天宮不願往攻。』",
        "translation": "Let's stay in the heavenly palace and don't wish to attack it.'",
        "source": "T15n0643_002:0651a15_12"
    },
    {
        "source_sentence": "波旬復言：『汝但默然，何須多云？』",
        "translation": "Pāpīyān then said, 'Just be silent; why would you need to say so much?'",
        "source": "T15n0643_002:0651a16_13"
    },
    {
        "source_sentence": "「時夜叉主名曰翅陀，即至魔所，頭面著地為魔作禮，白言天王：『何所勅令？』",
        "translation": "The lord of the yakṣas, named Kedha, then went to Māra, bowed his head and face to the ground for him, and said to the king of gods, 'What's the order?'",
        "source": "T15n0643_002:0651a16_14"
    },
    {
        "source_sentence": "波旬告曰：『汝以我聲遍勅六天，告下鬼王并諸八部，及曠野鬼、十八地獄閻羅王神，",
        "translation": "Pāpīyān told them, “With my voice you command the gods of the six heavens to summon the inferior spirit kings and the eighty-eight kinds of ghosts, as well as the spirits of the wilderness realm and the deities in the eighteen hells.",
        "source": "T15n0643_002:0651a18_15"
    },
    {
        "source_sentence": "一切皆集往瞿曇所。』",
        "translation": "They all gathered together and went to Gautama.'",
        "source": "T15n0643_002:0651a20_16"
    },
    {
        "source_sentence": "「是時諸鬼，猶如雲起從四面集，或有諸鬼首如牛頭有四十耳，於其耳中生諸鐵箭，",
        "translation": "\\",
        "source": "T15n0643_002:0651a20_17"
    },
    {
        "source_sentence": "赤焰上起高一由旬，有十八角角端擎山，山上有龍，銜熱鐵丸。",
        "translation": "At the top of the red flame rises a yojana in height, with an eighteen-horned horn holding the mountain upright. On top of the mountain is a dragon holding a hot iron ball.",
        "source": "T15n0643_002:0651a22_18"
    },
    {
        "source_sentence": "復有諸鬼首如狐頭，有十千眼，眼睫長大如霹靂炎，項上有口口吐熾火，",
        "translation": "Again, some ghosts have hair like a fox’s head and ten thousand eyes with eyelashes as large as the size of thunderbolt lightning. On their necks they spit out blazing flames from their mouths and mouths.",
        "source": "T15n0643_002:0651a24_19"
    },
    {
        "source_sentence": "身上諸毛猶如劍樹。",
        "translation": "The hair on his body was like a sword tree.",
        "source": "T15n0643_002:0651a25_20"
    },
    {
        "source_sentence": "復有諸鬼倒住空中有十二脚，於其足跟有千刀輪，頭如太山，於其頭上五百劍樹，",
        "translation": "Again, there were demons standing upside down in the sky with twelve legs. At their feet and heels were a thousand rings of swords whose heads looked like Mount Tai, and on top of their heads were five hundred trees of swords.",
        "source": "T15n0643_002:0651a26_21"
    },
    {
        "source_sentence": "樹頭火起。",
        "translation": "At the top of the tree, a fire arises.",
        "source": "T15n0643_002:0651a28_22"
    },
    {
        "source_sentence": "復有諸鬼，婉轉腹行，負鐵圍山穹脊而至。",
        "translation": "Again, there were ghosts that traveled in a leisurely manner, carrying the iron-backed ridges of the mountain's peaks to their backs.",
        "source": "T15n0643_002:0651a28_23"
    },
    {
        "source_sentence": "復有諸鬼，一頸多頭口有千舌，於其舌上生棘刺樹，毛鬣上衝毛端雨血，",
        "translation": "Again, there are ghosts with one neck and many heads and mouths with a thousand tongues. On their tongues grow thorns and thorn trees, and hairy hyenas spit on the ends of their hair to shower blood.",
        "source": "T15n0643_002:0651a29_24"
    },
    {
        "source_sentence": "吐刺疾走騰空而至。",
        "translation": "He spits out and rushes, walks up into the sky, and arrives.",
        "source": "T15n0643_002:0651b02_25"
    },
    {
        "source_sentence": "「毘舍闍鬼發大惡聲，氣踊如雲雨熱鐵丸倏忽而到；",
        "translation": "The Vaiśālī spirits made a loud noise, rising in the air like clouds and raining hot iron balls.",
        "source": "T15n0643_002:0651b02_26"
    },
    {
        "source_sentence": "鳩槃茶鬼蹲踞土埵現其醜形；",
        "translation": "The kumbhāṇḍa demon crouched in the dirt and showed its ugly form.",
        "source": "T15n0643_002:0651b03_27"
    },
    {
        "source_sentence": "富單那鬼其形黑瘦，頭戴大鑊盛熱鐵丸，手執刀輪，左脚踏狗，右脚踏狼，",
        "translation": "The Pūrṇa ghost is black and thin in shape, carrying a big cauldron on its head that holds a hot iron ball. It carries a sword wheel in its hand; it steps on dogs at its left feet and wolves at its right feet.",
        "source": "T15n0643_002:0651b04_28"
    },
    {
        "source_sentence": "奔走而至；",
        "translation": "They came running and arriving.",
        "source": "T15n0643_002:0651b06_29"
    },
    {
        "source_sentence": "諸羅剎王背黑如漆，胸白如月，眼如盛火，頭髮蓬亂如縛刺束，狗牙上出，",
        "translation": "The kings of the rākṣasa demons had black backs as white as lacquer, white chests as white as the moon, eyes like blazing fire, hair as disheveled as if they were tethered by fetters and thorns, and a dog’s tusks protruding from their mouths.",
        "source": "T15n0643_002:0651b06_30"
    },
    {
        "source_sentence": "狀如銏劍，手十指爪利如鋒芒，脚有十爪縱橫如劍，以鐵羈頭疾走而至；",
        "translation": "It was shaped like a sharp sword, with the fingernails of ten fingers on each hand as sharp as pointed needles. The feet had ten fingernails extending horizontally and vertically like a sword; they traveled faster by means of an iron rack attached to their heads.",
        "source": "T15n0643_002:0651b08_31"
    },
    {
        "source_sentence": "曠野鬼神大將軍等，一頸六頭胸有六面，膝頭兩面，舉體生毛狀如箭鏃，",
        "translation": "The great generals of the wild ghosts and spirits, with one neck and six heads, have six faces on their chests, knees and heads on both sides, hair growing from their bodies like arrow-shaped hair.",
        "source": "T15n0643_002:0651b10_32"
    },
    {
        "source_sentence": "奮身射人，張眼焰赤血出流下，與諸兇類疾走而到。",
        "translation": "The archer raised his body, opened his eyes and flamed red blood flowed downstream, and he quickly ran away with the fierce creatures.",
        "source": "T15n0643_002:0651b11_33"
    },
    {
        "source_sentence": "「復有諸鬼，首如虎頭有十二眼，鼻如象鼻有十三鼻，左肩擔山右肩負火，",
        "translation": "Again, some ghosts have horns like a tiger’s head with twelve eyes; their noses are like an elephant’s nose with thirteen. The left shoulder bears the burden of the mountain and the right shoulder holds the fire.",
        "source": "T15n0643_002:0651b13_34"
    },
    {
        "source_sentence": "手捉利劍脚躡師子，哮吼而至。",
        "translation": "He held a sharp sword in his hand, the lion with legs and feet pointing toward him, roared and roared.",
        "source": "T15n0643_002:0651b14_35"
    },
    {
        "source_sentence": "復有諸鬼其身如雲，霹靂火起如團雲頭，於團雲邊有百千萬龍，不見其身但見吐毒，",
        "translation": "Again, there are ghosts whose bodies are like clouds, thunder and fire rising like the tip of a lump of cloud. On the edge of the lump of clouds are millions of dragons that don't see their bodies but only spit out poison.",
        "source": "T15n0643_002:0651b15_36"
    },
    {
        "source_sentence": "於十方面，一切惡事如雲而集；",
        "translation": "All evil deeds in the ten directions arose like clouds.",
        "source": "T15n0643_002:0651b17_37"
    },
    {
        "source_sentence": "鬼子母神將其諸子，各執一石壁方十里，巖崿可畏競馳而至。",
        "translation": "The mother of the ghosts and goddesses led their children, each holding a stone wall ten li in circumference with them. Fearlessly rushing along the rocky precipice, they came at once.",
        "source": "T15n0643_002:0651b18_38"
    },
    {
        "source_sentence": "復有諸鬼捲脊挾尾，以鼻嗅地鼻出諸火，火焰上化化生諸鬼，擔面而走。",
        "translation": "Again, there are ghosts winding their backs and trailing their tails, sniffing the ground with their noses and noses to produce fire. The spirits born from the flame of fire rise upward and transform themselves, carrying their faces and running away.",
        "source": "T15n0643_002:0651b19_39"
    },
    {
        "source_sentence": "「是時魔王，顧視夜叉告令諸鬼：『今者鬼兵既已雲集，瞿曇善人，或能知呪，",
        "translation": "“Then the king of Māra looked at the night and said to the demons, ‘Now that the armies of ghosts have assembled in a great cloud, Gotama, good men, may you know this mantra.",
        "source": "T15n0643_002:0651b21_40"
    },
    {
        "source_sentence": "當興四兵。』",
        "translation": "You will give rise to four armies.'",
        "source": "T15n0643_002:0651b23_41"
    },
    {
        "source_sentence": "以魔王珠化作四兵，象馬車步列仗如林，甚可怖畏，直從空下至道樹邊。",
        "translation": "With the jewels of the king of Māra, he transformed himself into a fourfold army with elephants, horses, chariots, infantry, and battle formations like forests that were so terrifying that they flew straight down from the sky to the edge of the path.",
        "source": "T15n0643_002:0651b23_42"
    },
    {
        "source_sentence": "「魔復更念：『如此軍眾或不能淹降伏瞿曇。』",
        "translation": "Again, Māra thought, 'Such an army might not be able to subdue Gautama.'",
        "source": "T15n0643_002:0651b25_43"
    },
    {
        "source_sentence": "復脫寶冠持擬地下，其冠光明逕至下方，當閻羅王化人宮上，高聲大呼告勅諸鬼：『汝等獄卒及閻羅王，",
        "translation": "Again, he took off his jeweled crown and carried it to the ground. The light emanating from his crown extended downward as far as the lower part of the earth. Then King Yama appeared in the human-transformation palace and called out loudly to all the demons:",
        "source": "T15n0643_002:0651b26_44"
    },
    {
        "source_sentence": "阿鼻地獄刀輪劍戟、火車鑪炭，一切都舉向閻浮提，欲滅瞿曇擲置其中。』",
        "translation": "All the avīci hells, swords, wheels, swords, halberds, chariots, and charcoal are raised toward Jambudvīpa and thrown into it in order to exterminate Gautama.'",
        "source": "T15n0643_002:0651b28_45"
    },
    {
        "source_sentence": "「阿鼻地獄縱廣正等八萬由旬，七重鐵城，下十八鬲，四面劍林亦十八行，",
        "translation": "“The length and width of the avīci hell are exactly eighty thousand yojanas. It is built of seven-story iron walls with eighteen stories in all directions, and its four sides are like forests of swords measuring eighteen lines.",
        "source": "T15n0643_002:0651c01_46"
    },
    {
        "source_sentence": "東方復有十八小地獄，以為圍遶；",
        "translation": "To the east there are eighteen minor hells that surround them.",
        "source": "T15n0643_002:0651c02_47"
    },
    {
        "source_sentence": "南方十八鬲以為圍遶；",
        "translation": "To the south it is surrounded by eighteen moats.",
        "source": "T15n0643_002:0651c03_48"
    },
    {
        "source_sentence": "西方十八鬲以為圍遶；",
        "translation": "To the west it is surrounded by eighteen moats.",
        "source": "T15n0643_002:0651c04_49"
    },
    {
        "source_sentence": "北方十八鬲以為圍遶。",
        "translation": "To the north, it's surrounded by 18 arrowheads.",
        "source": "T15n0643_002:0651c04_50"
    },
    {
        "source_sentence": "地下自然有熾猛火，燒然鐵城鐵網俱熾，一切熱焰周迴還旋，下過十八鬲。",
        "translation": "Underground, there's a naturally blazing fierce fire that burns an iron castle and an iron net that's all ablaze, and all the hot flames go around and circle it, going down more than 18 degrees.",
        "source": "T15n0643_002:0651c05_51"
    },
    {
        "source_sentence": "若有眾生犯五逆者，身滿其中受如此苦，晝夜不息間無空缺，劫欲盡時四門自開。",
        "translation": "If there are sentient beings who commit the five heinous crimes, they'll experience such pain in their bodies day and night without cease, and when the eon is about to end, the four gates open on their own.",
        "source": "T15n0643_002:0651c07_52"
    },
    {
        "source_sentence": "諸罪人等見東門外一切劍林，如清涼林，從下鬲起至第二鬲，第二鬲起至第三鬲，",
        "translation": "The sinners saw all the forests of swords outside the east gate, like a clear and cool forest, rising from the base of the arrowhead up to the second bolt, and the second bolt up to the third bolt.",
        "source": "T15n0643_002:0651c09_0"
    },
    {
        "source_sentence": "乃至於上走趣東門。",
        "translation": "It goes up to the east gate of the monastery.",
        "source": "T15n0643_002:0651c10_1"
    },
    {
        "source_sentence": "羅剎獄卒以熱鐵叉逆刺其眼，精如融銅流出于地，即時躄倒遍滿十八鬲中，",
        "translation": "The guards in Rāṣṭrapāla hell pierced his eyes with a hot iron fork, and their semen flowed out onto the ground like molten copper. Immediately the sinner was thrown into one of the eighty-eight abscesses.",
        "source": "T15n0643_002:0651c11_2"
    },
    {
        "source_sentence": "其心迷悶滿一小劫，爾乃還起復向南門。",
        "translation": "Their minds were confused for a short eon, and then they rose up again and headed back toward the south gate.",
        "source": "T15n0643_002:0651c13_3"
    },
    {
        "source_sentence": "如是四方如前無異，晝夜受苦逕一大劫，劫盡更生餘小地獄。",
        "translation": "Thus, these four directions are no different from the previous ones, and day and night they experience suffering for a great eon, and when that eon ends, they're reborn in another small hell.",
        "source": "T15n0643_002:0651c14_4"
    },
    {
        "source_sentence": "其餘眾獄形狀大小受報輕重，形類好醜一切雜報，慈三昧中當復廣說。",
        "translation": "The other hells are of different sizes and shapes, with minor and major retributions as well as major and minor. All the secondary retributions [for beings in these hells] will also be spoken of elaborately in the samadhi of loving-kindness.",
        "source": "T15n0643_002:0651c15_5"
    },
    {
        "source_sentence": "「時諸獄卒，城東八千，三方亦爾。",
        "translation": "The jailers were eight thousand paces to the east of the city, and so it was in all three directions.",
        "source": "T15n0643_002:0651c17_6"
    },
    {
        "source_sentence": "一一獄卒頭髮如山，生刀輪劍戟，耳如驢耳有百千種，一一耳中烟焰俱起，",
        "translation": "Each of the guards in this hell had hair like a mountain, bearing swords, horns, swords, and halberds. Their ears were like those of a donkey or mute; there were hundreds of thousands of different kinds of their ears, each one endowed with smoke and flames burning within its ears.",
        "source": "T15n0643_002:0651c17_7"
    },
    {
        "source_sentence": "脣口牙齒過於羅剎百千萬倍，角如牛角角端生劍，五方異見，身體赤黑如癩病狗，",
        "translation": "Their lips, mouths, and teeth are a hundred million times greater than those of the rāṣṭrapāla; their horns are like the horns of an ox’s horn. They produce swords at the corners of their horns. With different appearances in the five directions, their bodies are red and black like leprosy-stricken dogs.",
        "source": "T15n0643_002:0651c19_8"
    },
    {
        "source_sentence": "有四百尾。",
        "translation": "There are 400 tails.",
        "source": "T15n0643_002:0651c21_9"
    },
    {
        "source_sentence": "於其尾頭濃血沸屎，有鐵[口*(隹\\/乃)]蟲纏其身體，手捉鐵叉脚下踏輪，",
        "translation": "On the tip of its tail, thick blood boiled in excrement, and there was an iron [mouth*(hen\\/now)] worm tethering it around its body. It grabbed the iron fork with its hand and stepped on the wheel beneath its feet.",
        "source": "T15n0643_002:0651c21_10"
    },
    {
        "source_sentence": "刀輪上刺直徹心髓，駛疾如風，各以鐵叉叉罪人腰，直上而走，阿鼻地獄如影隨形，",
        "translation": "The wheel of the sword pierces through the marrow of their hearts and bones. Each one, like a gust of wind, rises straight upward at the sinner’s waist with an iron叉叉叉叉叉; the hells in Avīci Hell are shaped like reflected images.",
        "source": "T15n0643_002:0651c23_11"
    },
    {
        "source_sentence": "逐罪人來。",
        "translation": "He came to chase the sinners.",
        "source": "T15n0643_002:0651c25_12"
    },
    {
        "source_sentence": "「俄頃之間到道樹邊，一時雲集欲興惡逆。",
        "translation": "In a short while, he went to the edge of the path tree, and at one time clouds gathered in order to cause bad rebellion.",
        "source": "T15n0643_002:0651c25_13"
    },
    {
        "source_sentence": "菩薩是時儼然不動，入勝意慈。",
        "translation": "The bodhisattva then remained unmoving and entered into the compassion of superior intentions.",
        "source": "T15n0643_002:0651c26_14"
    },
    {
        "source_sentence": "魔王譸張奮武振吼，勅諸兵眾：『汝等速疾逼害瞿曇。』",
        "translation": "The king of Māra arouses his arrogance and rouses his roar, commanding his troops, 'You must quickly oppress Gautama.'",
        "source": "T15n0643_002:0651c27_0"
    },
    {
        "source_sentence": "上震天雷雨熱鐵丸，刀輪武器更相加積交橫空中，四面諸鬼同時俱作，",
        "translation": "The heavens above shake, thunder and rain fall, hot iron balls, wheels of swords and weapons are heaped up one after the other in the sky. All the ghosts on all four sides work at the same time.",
        "source": "T15n0643_002:0651c28_1"
    },
    {
        "source_sentence": "然其火箭不近菩薩。",
        "translation": "Still, the rocket doesn't go near the bodhisattva.",
        "source": "T15n0643_002:0651c29_2"
    },
    {
        "source_sentence": "「是時菩薩，徐舉右臂申眉間毛，下向用擬阿鼻地獄，令諸罪人見白毛中流出眾水，",
        "translation": "“Then the bodhisattva slowly raised his right shoulder, stretched out the hair between his eyebrows, and went down toward the fake avīci hell so that sinners would see water running out of their white hair.",
        "source": "T15n0643_002:0652a01_3"
    },
    {
        "source_sentence": "澍如車軸雨大火上，大火暫滅唯烟氣在，令受罪人心得小悟，自憶前世百生、千生、百千萬生所作諸罪。",
        "translation": "It's like when the axle of a chariot rains on a great fire, and the fire suddenly goes out but only smoke remains, causing the offenders to attain little enlightenment and remember the sins they committed in a hundred lifetimes, a thousand lifetimes, or a hundred million lifetimes in a previous life.",
        "source": "T15n0643_002:0652a03_4"
    },
    {
        "source_sentence": "諸獄卒等持大鐵叉舉起罪人，盡其身力不能得動。",
        "translation": "The jailers and others held a large iron fork to lift the sinners up, but they couldn't move it until their physical strength was exhausted.",
        "source": "T15n0643_002:0652a05_5"
    },
    {
        "source_sentence": "忽然自見大鐵叉頭如白銀山，龕室千萬，有白師子盤身為座，於其座上生白蓮華，",
        "translation": "Suddenly he saw for himself a great cakravartin with an iron protuberance like a mountain of white silver. There were ten thousand niches in which there was a seat made of white lions’ skin, and on that seat rose white lotus blossoms.",
        "source": "T15n0643_002:0652a06_6"
    },
    {
        "source_sentence": "有妙菩薩入勝意慈，如是莊嚴如須彌山。",
        "translation": "There's a marvelous bodhisattva who enters into the compassion of superior intent and thus adorns it like Mount Sumeru.",
        "source": "T15n0643_002:0652a08_7"
    },
    {
        "source_sentence": "放叉擲地，有七寶華生叉根下，有白色光明，照諸地獄及獄卒身，令閻羅王及諸獄卒作白銀山，",
        "translation": "On the ground he tossed his protuberance, there were seven jeweled flowers growing on the base of his protuberance with white light shining downward and illumining the bodies of the hells and jailers. That made the king of Yama and the guards in the hells a mountain of white silver.",
        "source": "T15n0643_002:0652a09_8"
    },
    {
        "source_sentence": "猶如電光暫時得見。",
        "translation": "It's like a flash of lightning that can be seen for a while.",
        "source": "T15n0643_002:0652a11_9"
    },
    {
        "source_sentence": "諸受罪人，六情諸根猛火速起，節頭火然筋脈生釘，暫得一起，合掌叉手向白毫相，",
        "translation": "The sinner who receives the precepts quickly becomes engulfed in flames from his six sense faculties. His knuckles are burned, and his tendons and veins give rise to nails. For a moment he feels one sensation:",
        "source": "T15n0643_002:0652a12_10"
    },
    {
        "source_sentence": "即時心開。",
        "translation": "Immediately, his mind is opened.",
        "source": "T15n0643_002:0652a14_11"
    },
    {
        "source_sentence": "見白毛中人如己無異，坐蓮華林，以水澆灌諸罪人頂，令心熱惱暫得清涼，",
        "translation": "They see people with white hair, no different from themselves, sitting in lotus groves, pouring water over the sinners’ heads so that their hearts become hot and tormented and they attain clarity and coolness for a while.",
        "source": "T15n0643_002:0652a14_12"
    },
    {
        "source_sentence": "即皆同時稱：『南無佛』。",
        "translation": "They all simultaneously called out, 'There's no Buddha in the south.'",
        "source": "T15n0643_002:0652a16_13"
    },
    {
        "source_sentence": "以是因緣，受罪畢訖直生人中，諸情完具正見出家，既出家已，破二十億洞然之結，",
        "translation": "Because of these causes and conditions, they're directly born among humans after being punished, their emotions are fully endowed with right view, and they leave home. After leaving home, they break the bond of 2 billion holes in ignorance.",
        "source": "T15n0643_002:0652a16_14"
    },
    {
        "source_sentence": "成須陀洹。",
        "translation": "He becomes a stream entrant.",
        "source": "T15n0643_002:0652a18_15"
    },
    {
        "source_sentence": "「魔見是相，憔悴懊惱却臥床上。",
        "translation": "Seeing these signs, Māra was emaciated and distressed, and withdrew to lie on his bed.",
        "source": "T15n0643_002:0652a19_16"
    },
    {
        "source_sentence": "魔有三女，長名悅彼，中名喜心，小名多媚。",
        "translation": "Māra has three daughters whose names are long and pleasing to the others. The middle name is Joyful, while the younger one is mostly attractive.",
        "source": "T15n0643_002:0652a19_17"
    },
    {
        "source_sentence": "時魔三女至父王所，長跪叉手為父作禮，啟言：『父王！",
        "translation": "The three daughters of Māra then went to their father, knelt down and saluted him with palms joined, and said, 'Father!",
        "source": "T15n0643_002:0652a20_18"
    },
    {
        "source_sentence": "今日何故愁悴乃爾！』",
        "translation": "Why are you so sad and emaciated today?'",
        "source": "T15n0643_002:0652a22_19"
    },
    {
        "source_sentence": "其父答言：『沙門瞿曇結誓深重，今坐道樹要壞我民，是故愁耳！』",
        "translation": "The father answered, 'The ascetic Gautama's vow is profound, and now he's sitting at the tree of enlightenment that will destroy our people; therefore, I'm sad!'",
        "source": "T15n0643_002:0652a22_20"
    },
    {
        "source_sentence": "女白父言：『我能往亂，願父莫愁。』",
        "translation": "The woman said to her father, 'I can go and disturb him, so may my father not be sad.'",
        "source": "T15n0643_002:0652a24_21"
    },
    {
        "source_sentence": "即自莊飾著雜寶冠，容媚挺特過踰魔后百千萬倍。",
        "translation": "He then adorned himself with a crown of mixed treasures, one hundred million times more beautiful than that of Māra.",
        "source": "T15n0643_002:0652a24_22"
    },
    {
        "source_sentence": "眄目作姿現諸妖冶，瓔珞晃耀光翳六天，乘羽寶車，安施寶帳垂諸天華，",
        "translation": "The gods of the six heavens rode on jeweled carts drawn with feathers, draped with jeweled curtains, and hung with celestial flowers.",
        "source": "T15n0643_002:0652a26_0"
    },
    {
        "source_sentence": "於華鬚頭諸化玉女，手執樂器鼓樂絃歌，聲萬種音凡在世人之所憙樂。",
        "translation": "At the top of their flowery hair and beards, these magical jade maidens hold musical instruments in their hands, drums, music, stringed instruments, and singing, with myriad sounds that are commonly heard by people in the world.",
        "source": "T15n0643_002:0652a27_1"
    },
    {
        "source_sentence": "一一玉女從五百女以為侍御，繒蓋幢幡如雲而下，身毛孔中香烟芬馥有百千色，",
        "translation": "Each of the jadelike maidens, accompanied by five hundred court ladies, served as their attendants. The silhouetted canopies and banners flowed down like clouds, and the fragrant smoke emanated from each pore of their bodies was a hundred thousand colors in color.",
        "source": "T15n0643_002:0652a29_2"
    },
    {
        "source_sentence": "玄黃昱爍甚適人目，安庠徐步至菩薩所，下車合掌禮敬菩薩，旋遶七匝，",
        "translation": "He was graceful, mysterious, and resplendent, very suitable for human eyes. After walking calmly and gradually, he came to the place where the enlightening being was staying. Entering the chariot, he joined his palms in respect of the enlightening being and circumambulated him seven times.",
        "source": "T15n0643_002:0652b02_3"
    },
    {
        "source_sentence": "白菩薩言：『太子生時，萬神侍御七寶來臻，何棄天位來此樹下？",
        "translation": "He said to the bodhisattva, 'When the prince was born, myriad deities attended him with seven treasures, so why did you abandon your heavenly position and come down here under this tree?'",
        "source": "T15n0643_002:0652b04_4"
    },
    {
        "source_sentence": "我是天女盛美無比，顏貌紅輝六天無雙，今以微身奉上太子，供給左右可備灑掃。",
        "translation": "I am a heavenly maiden of peerless beauty, with an incomparably beautiful countenance like that of the goddesses of the six heavens. With my humble body I present myself to you, prince, to your right and left, to sweep away this filthy filthy filth.",
        "source": "T15n0643_002:0652b05_5"
    },
    {
        "source_sentence": "我等善能調身按摩，今欲親附願遂下情。",
        "translation": "We're well able to regulate our body and massage it, and now we want to be intimate with the fulfillment of our vow.",
        "source": "T15n0643_002:0652b07_6"
    },
    {
        "source_sentence": "太子坐樹身體疲懈，宜須偃息服食甘露。』",
        "translation": "The prince sits at the tree with a weary body, so it's advisable to calm down and eat the ambrosia.'",
        "source": "T15n0643_002:0652b08_7"
    },
    {
        "source_sentence": "即以寶器獻天百味。",
        "translation": "He then offered a jeweled vessel to the gods with a hundred flavors.",
        "source": "T15n0643_002:0652b09_8"
    },
    {
        "source_sentence": "「太子寂然身心不動，以白毫擬，令天三女自見身內膿囊涕唾、九孔筋脈一切根本，",
        "translation": "The prince remained motionless in body and mind. He projected a white hair, causing the goddesses to see for themselves all the roots of pus, blisters, tears, spittle, mucus, nine pores, tendons, veins, and blood vessels within their bodies.",
        "source": "T15n0643_002:0652b10_9"
    },
    {
        "source_sentence": "大腸小腸、生藏熟藏，於其中間，迴伏婉轉踊生諸蟲，其數滿足有八千戶，",
        "translation": "Between the large intestines and small intestines, as well as the store of birth and the store of maturation, there were 8,000 houses filled with various kinds of worms that grew up from each other.",
        "source": "T15n0643_002:0652b12_0"
    },
    {
        "source_sentence": "戶有九億諸小蟲等，蟲遊戲時走入小腸，皆有四口張口上向，大蟲遊戲入大腸中，",
        "translation": "There are  900 million small worms in the door, and when the worms play, they walk into the small intestines. All have four mouths that open upward with their mouths facing upward, while the large worms play inside the large intestines.",
        "source": "T15n0643_002:0652b13_1"
    },
    {
        "source_sentence": "從大腸出復入胃中。",
        "translation": "It comes out of the large intestine and goes back into the stomach.",
        "source": "T15n0643_002:0652b15_2"
    },
    {
        "source_sentence": "冷病起時胃管閉塞，蟲不得入，故食不消。",
        "translation": "When a cold illness arises, the stomach tubes are shut and the worms can't enter, so their food doesn't go away.",
        "source": "T15n0643_002:0652b16_3"
    },
    {
        "source_sentence": "脾、腎、肝、肺、心、膽、喉嚨，肺腴肝鬲，如是中間復生四蟲，如四蛇合，",
        "translation": "The spleen, the kidneys, the liver, the lungs, the lungs, the heart, the gallbladder, and the throat are blistering, and the lungs nourish the liver.",
        "source": "T15n0643_002:0652b17_4"
    },
    {
        "source_sentence": "上下同時唼食諸藏，滓盡汁出，入眼為淚，入鼻為涕，聚口成唾，放口涎流。",
        "translation": "Both the upper and lower parts of the body simultaneously eat the stores, and when the juice is exhausted, entry into the eye becomes tears, entry into the nose tears tears, mouth collects to make spittle, and mouth releases a stream of saliva.",
        "source": "T15n0643_002:0652b18_5"
    },
    {
        "source_sentence": "薄皮厚皮，筋髓諸脈悉生諸蟲，細於秋毫數甚眾多不可具說。",
        "translation": "Thin skin, thick skin, tendons, marrow, and veins all give rise to insects, which are as small as a thousand hairs in number and too numerous to be described in detail.",
        "source": "T15n0643_002:0652b20_6"
    },
    {
        "source_sentence": "「其女見此即便嘔吐從口而出，無有窮盡。",
        "translation": "Seeing this, the woman vomited and came out of her mouth.",
        "source": "T15n0643_002:0652b21_7"
    },
    {
        "source_sentence": "即自見身，左生蛇頭，右生狐頭，中首狗頭，頭上化生九色死屍，如九相觀。",
        "translation": "He then saw his own body, with a snake head on his left side, a fox head on his right side, a dog head on the middle of his head, and a nine-colored dead corpse growing from his head, just like observing the nine characteristics.",
        "source": "T15n0643_002:0652b22_8"
    },
    {
        "source_sentence": "「九相觀者：一者、新死相：或見死人，身體正直無所復知，想我此身亦當復爾，",
        "translation": "“Contemplation on the nine characteristics: 1. The characteristic of new death:",
        "source": "T15n0643_002:0652b24_9"
    },
    {
        "source_sentence": "與此無異，故曰新死相。",
        "translation": "It is no different from this, so it's called the mark of new death.",
        "source": "T15n0643_002:0652b26_10"
    },
    {
        "source_sentence": "二者、青瘀相：或見死人，一日至于七日，身體青膖瘀黑相，我所愛身亦當復爾，",
        "translation": "The second is the mark of bruised flesh. If I see a dead man for one day or seven days, his flesh will be bruised and black-colored, and so will my beloved flesh.",
        "source": "T15n0643_002:0652b26_11"
    },
    {
        "source_sentence": "與此無異，故曰青瘀相。",
        "translation": "It's no different from this, so it's called the mark of bruise.",
        "source": "T15n0643_002:0652b28_12"
    },
    {
        "source_sentence": "三者、膿血相：或見死人，身已爛壞血流塗漫，極為可惡不可瞻視，我所愛身亦當復爾，",
        "translation": "3. The characteristic of pus and blood: Perhaps they see a dead person whose body has rotted, bled, and smeared with blood, which is so bad that it can't be seen, and so will the self-love body.",
        "source": "T15n0643_002:0652b29_13"
    },
    {
        "source_sentence": "故曰膿血相。",
        "translation": "That's why it's called the mark of pus and blood.",
        "source": "T15n0643_002:0652c02_14"
    },
    {
        "source_sentence": "四者、絳汁相：或見死人，身體縱橫黃水流出狀似絳汁，我所愛身亦當復爾，",
        "translation": "The fourth is the characteristic of curds and juice: If I see a dead man, yellow water flows out horizontally from his body like curds and juice, and so will my beloved body.",
        "source": "T15n0643_002:0652c02_15"
    },
    {
        "source_sentence": "故曰絳汁相。",
        "translation": "That's why it's called the characteristic of bean juice.",
        "source": "T15n0643_002:0652c04_16"
    },
    {
        "source_sentence": "五者、食不消相：或見死人，為烏鳥所食，蟲狼所噉，為蠅所蛆，其肉欲盡或半身在，",
        "translation": "The fifth is the characteristic of not eating: sometimes they see a dead person being eaten by crows and birds, eaten by insects and wolves, eaten by flies, with their flesh about to be exhausted or halfway alive.",
        "source": "T15n0643_002:0652c04_17"
    },
    {
        "source_sentence": "我所愛身亦當復爾，故曰食不消相。",
        "translation": "The craving body beloved by self will also be like this, so it's called food that doesn't eliminate characteristics.",
        "source": "T15n0643_002:0652c06_18"
    },
    {
        "source_sentence": "六者、筋纏束薪相：或見死人，皮肉已盡止有筋骨相連，譬似束薪，由是得成而不解散，",
        "translation": "6. The characteristic of the bundle of tendons: Or, when a dead man is seen, his flesh and bones are exhausted but there are still tendons and bones connecting one with the other, resembling bundles of firewood. Because of this, he attains formation but not dissolution.",
        "source": "T15n0643_002:0652c07_19"
    },
    {
        "source_sentence": "我所愛身亦當復爾，故曰筋纏束薪相。",
        "translation": "The body beloved by the self should also be like this. That is why it is said to be fettered by the characteristics of a bundle of firewood.",
        "source": "T15n0643_002:0652c09_20"
    },
    {
        "source_sentence": "七者、骨節分離相：或見死人，筋已爛壞骨節縱橫不在一處，我所愛身亦當復爾，",
        "translation": "7. The distinctive characteristics of the bones and joints: If someone sees a dead man with tendons that have rotted, his bones and joints don't fit together in one place, so will my beloved body.",
        "source": "T15n0643_002:0652c10_21"
    },
    {
        "source_sentence": "故曰骨節分離相。",
        "translation": "That's why it's called the distinctive characteristic of bone marrow.",
        "source": "T15n0643_002:0652c12_22"
    },
    {
        "source_sentence": "八者、燒燋可惡相：或見死人，為家火所燒，野火所焚，燋縮在地，極為可惡不可瞻視，",
        "translation": "8. The despicable characteristic of being burned: Sometimes they see a dead person burned by a house fire, burned by a wildfire, crudely shrinking on the ground, extremely despicable and unseen.",
        "source": "T15n0643_002:0652c12_23"
    },
    {
        "source_sentence": "我所愛身亦當復爾，故曰燒燋可惡相。",
        "translation": "The body beloved by the self will also be like this, so it's called burned and scorched with a bad appearance.",
        "source": "T15n0643_002:0652c14_24"
    },
    {
        "source_sentence": "九者、故骨相：或見久昔乾骨，若五十歲，至百歲、二百歲、三百歲時，",
        "translation": "The nineth is the characteristic of old bones. Some people may see dry bones from a long time in the past. If they are fifty years old, up to one hundred, two hundred, or three hundred years old:",
        "source": "T15n0643_002:0652c15_25"
    },
    {
        "source_sentence": "骨還變白，日曝徹中，火從骨上焰焰而起，火燒之後風吹入地還歸于土。",
        "translation": "The bones turn white again, and when the sun shines through them, a fire rises from the top of the bone into a blazing flame, and after it burns, the wind blows into the ground and returns back to the earth.",
        "source": "T15n0643_002:0652c17_26"
    },
    {
        "source_sentence": "是名略說九相，是為菩薩始在樹下初開不淨觀門。",
        "translation": "These are called the nine characteristics that are briefly explained. This is how the bodhisattva began to open the gate of contemplation on impurity for the first time when he was under a tree.",
        "source": "T15n0643_002:0652c18_27"
    },
    {
        "source_sentence": "「時三魔女，自見背上，復負老母，髮白面皺，脣口喎僻，手脚繚戾，",
        "translation": "The three Māra maidens then saw themselves on their backs, carrying the old woman again. Her white face was wrinkled, her lips and mouth emaciated, her hands and feet crouching in distress.",
        "source": "T15n0643_002:0652c20_28"
    },
    {
        "source_sentence": "顏色津黑猶如僵尸。",
        "translation": "His color was as black as if he were a corpse.",
        "source": "T15n0643_002:0652c21_29"
    },
    {
        "source_sentence": "胸前復抱一死小兒，於六竅中流出諸膿，膿中生蟲正似蚘蟲。",
        "translation": "In front of his chest, he again embraced a deceased child, and from the six orifices flowed pus, which produced worms that looked like gnats.",
        "source": "T15n0643_002:0652c22_30"
    },
    {
        "source_sentence": "諸女見此愕然驚嘷，却行而去，低頭視臍，臍生六龍，龍吐水火，耳出諸風，",
        "translation": "Seeing this sight, the women were startled and frightened. They withdrew and departed. With their heads bowed they looked at the navel but six dragons emerged from the navel. The dragons spit forth water and fire; wind blew in their ears.",
        "source": "T15n0643_002:0652c23_31"
    },
    {
        "source_sentence": "體堅如鐵。",
        "translation": "Its body is as hard as iron.",
        "source": "T15n0643_002:0652c25_32"
    },
    {
        "source_sentence": "自見女形，醜狀鄙穢，乃當如是。",
        "translation": "If you see yourself in the form of a woman with an ugly and filthy appearance, it will be like this.",
        "source": "T15n0643_002:0652c25_33"
    },
    {
        "source_sentence": "於其鄙處有諸小蟲，蟲有四頭二上二下，唼食女身。",
        "translation": "In that coarse place, there are small insects with four heads, two upper and two lower, which feed on the female body.",
        "source": "T15n0643_002:0652c26_34"
    },
    {
        "source_sentence": "口出五毒，毒有五脈，上至心下乃至咽喉，從六根中生諸脈根，九十有九，",
        "translation": "The five poisons that arise from the mouth are of five kinds:",
        "source": "T15n0643_002:0652c27_35"
    },
    {
        "source_sentence": "直下流注至諸蟲頂，共相灌注徹諸蟲心。",
        "translation": "They flowed straight down to the tops of the worms, and together they poured water into each other and penetrated the worms' hearts.",
        "source": "T15n0643_002:0652c29_36"
    },
    {
        "source_sentence": "諸女人等，從無數世造諸邪行，惡業因緣獲得如是不淨醜身。",
        "translation": "Women and so forth have done wrong actions from countless generations, and as a result of bad actions they attain such an impure and ugly body.",
        "source": "T15n0643_002:0653a01_37"
    },
    {
        "source_sentence": "復有諸蟲如手臂釧，團欒相持而有眾口，口生五毒唼食女根。",
        "translation": "Again, there are other insects like armlets that hold themselves in a lump and have mouths that give rise to five poisons from their mouths that feed on the female faculty.",
        "source": "T15n0643_002:0653a02_38"
    },
    {
        "source_sentence": "諸女人等先世之時，邪婬行故，獲臭惡身以為莊嚴。",
        "translation": "In a previous life, women who engaged in sexual misconduct acquired a foul-smelling body as their adornment.",
        "source": "T15n0643_002:0653a04_39"
    },
    {
        "source_sentence": "「諸女見已心極酸苦如箭入心，却行之時匍匐而去，如羸駝步，初舉足時節節火起，",
        "translation": "“When the women saw this, their hearts were as painful and distressed as if an arrow had entered their hearts. When they withdrew, they prostrated themselves and departed, just like a feeble camels’ footstep that starts by raising its legs in every direction to let the fire go.",
        "source": "T15n0643_002:0653a05_40"
    },
    {
        "source_sentence": "其髮黃黑如刺棘林，以自纏身，呼嗟歎息至魔王前。",
        "translation": "They are as yellow and black as thorns in a forest of thorns, wrapped themselves around their bodies, screaming and sighing until they reach the king of Māra.",
        "source": "T15n0643_002:0653a07_41"
    },
    {
        "source_sentence": "魔王心怒，奮劍竪色即欲直前，魔子諫曰：『父王無辜自招瘡疣，菩薩行淨難動如地，",
        "translation": "The king of Māra became angry and raised his sword in a coarse color. He immediately wanted to go straight ahead, but the prince of Māra remonstrated with him, saying, “Your father’s fault is that you have caused sores and warts on your own without guilt.",
        "source": "T15n0643_002:0653a08_42"
    },
    {
        "source_sentence": "云何可壞？』",
        "translation": "How can it be destroyed?'",
        "source": "T15n0643_002:0653a10_43"
    },
    {
        "source_sentence": "「作是諫時，菩薩復以白毫光擬，令魔眷屬身心安樂，譬如比丘入第三禪。",
        "translation": "When he made this remonstrance, the bodhisattva again projected a white-haired ray of light to make the Māra's followers attain peace and comfort in body and mind, like a monk entering the third dhyāna.",
        "source": "T15n0643_002:0653a10_44"
    },
    {
        "source_sentence": "餓鬼見白毛，毛端皆有百千萬億諸大菩薩，是諸菩薩亦入勝意慈心三昧，",
        "translation": "The hungry ghosts saw hundreds of thousands of myriads of koṭis of great bodhisattvas with white hair on their hair, and these bodhisattvas also entered the concentration of superior compassion.",
        "source": "T15n0643_002:0653a12_45"
    },
    {
        "source_sentence": "各以右手將左指頭，爪端生乳灑滅猛火，猛火滅已即得清涼，自然飽滿身心踊悅，",
        "translation": "With their right hand, they each put the tip of their left finger at the end of their nails and sprinkled the milk that had arisen from their nails over the fierce fire. When the fierce fire was extinguished, they attained clarity and coolness, which naturally filled their bodies and minds with delight.",
        "source": "T15n0643_002:0653a14_46"
    },
    {
        "source_sentence": "發菩提心，因是心故捨餓鬼苦。",
        "translation": "They give rise to the mind of enlightenment, and because of this mind they abandon the suffering of hungry ghosts.",
        "source": "T15n0643_002:0653a16_47"
    },
    {
        "source_sentence": "是諸鬼等自見其身，如似白玉，似瑠璃山、似頗梨山、似黃金山、似馬瑙山、身諸毛孔似真珠貫，",
        "translation": "These ghosts themselves see their bodies like white jade, like lapis lazuli mountains, crystal mountains, gold mountains, agate mountains, and the pores of their bodies like real pearls.",
        "source": "T15n0643_002:0653a17_0"
    },
    {
        "source_sentence": "眼目明淨似明月珠，身諸烟焰如雜寶雲，所執刀杖似七寶臺，七寶臺內重鋪綩綖安置丹枕，",
        "translation": "The purity of his eyes and eyes resembled the brightness of a moonlike jewel. His body was covered with smoke and flames like clouds of all kinds of jewels. He held a sword and cane resembling a seven-jeweled dais. Within the seven-jeweled dais, he placed a double mat on which to place a golden pi",
        "source": "T15n0643_002:0653a19_1"
    },
    {
        "source_sentence": "左右自然有化梵王。",
        "translation": "To his left and right, there's the naturally transformed Brahma king.",
        "source": "T15n0643_002:0653a21_2"
    },
    {
        "source_sentence": "見化菩薩坐於花臺，各各異說諸罪人報：『汝等前世坐作惡業故，獲如此可惡之形。』",
        "translation": "Seeing the transformation bodhisattva sitting on a flower dais, each of them said differently to the sinners' retribution, 'In a previous life, you sat in bad actions and obtained such a despicable form.'",
        "source": "T15n0643_002:0653a21_3"
    },
    {
        "source_sentence": "說是語時，是諸鬼神有發無上菩提心者；",
        "translation": "When he uttered these words, some of the ghosts and spirits aroused the aspiration for highest enlightenment.",
        "source": "T15n0643_002:0653a23_4"
    },
    {
        "source_sentence": "有種聲聞辟支佛因緣者；",
        "translation": "There are those who sow the causes and conditions of śrāvakas and pratyekabuddhas.",
        "source": "T15n0643_002:0653a24_5"
    },
    {
        "source_sentence": "有於來世當生人天勝樂處者。",
        "translation": "There's someone who will be born in a place of superior bliss for humans and gods in the future.",
        "source": "T15n0643_002:0653a25_6"
    },
    {
        "source_sentence": "「是時魔王忽然還宮，白毫隨從直至六天。",
        "translation": "The king of Māra then suddenly returned to his palace and followed the white-haired one up to the six heavens.",
        "source": "T15n0643_002:0653a26_7"
    },
    {
        "source_sentence": "於其中間，無數天子天女，見白毛孔通中皆空，團圓可愛如梵王幢。",
        "translation": "Among them, countless celestial beings and goddesses saw white pores that were all empty, round and lovely like the Brahma king's banner.",
        "source": "T15n0643_002:0653a27_8"
    },
    {
        "source_sentence": "於其空間，有百千萬恒河沙微塵諸寶蓮華，一一蓮華，無量無邊諸妙白色以為其臺，",
        "translation": "In the space there were hundreds of millions of jewel lotus blossoms as numerous as the grains of dust in the Ganges River, each one with an infinite number of boundless white flowers.",
        "source": "T15n0643_002:0653a28_9"
    },
    {
        "source_sentence": "臺上有化菩薩，放白毫大人相光，亦復如是！",
        "translation": "So it is with the transformation bodhisattva on the terrace, who radiates the white-haired great man's characteristic light!",
        "source": "T15n0643_002:0653b02_10"
    },
    {
        "source_sentence": "諸菩薩頂有妙蓮華，其華金色，過去七佛在其華上，是諸化佛自說名字，",
        "translation": "On the top of their heads were beautiful lotus blossoms, all golden-colored. The past seven buddhas were placed on those blossoms. These apparitional buddhas called themselves by their names.",
        "source": "T15n0643_002:0653b03_11"
    },
    {
        "source_sentence": "與修多羅等無差別。",
        "translation": "It's no different from the sūtra and so forth.",
        "source": "T15n0643_002:0653b05_12"
    },
    {
        "source_sentence": "「復有諸天宿善根者，見化菩薩一毛孔中生一菩薩，菩薩頂上皆有化佛，",
        "translation": "“Furthermore, some celestial beings who have accumulated roots of goodness observe that in one pore of a magical enlightening being there arises an enlightening being, and on the top of the enlightening being’s head is a buddha-manifesting emanation.",
        "source": "T15n0643_002:0653b05_13"
    },
    {
        "source_sentence": "如前不異。",
        "translation": "As before, it's not different.",
        "source": "T15n0643_002:0653b07_14"
    },
    {
        "source_sentence": "時諸化佛眉間出華，百寶莊嚴，諸天世間無色可比。",
        "translation": "The apparitional buddhas then produced flowers between their eyebrows, adorned with a hundred treasures, and the gods of the world had no form to compare.",
        "source": "T15n0643_002:0653b07_15"
    },
    {
        "source_sentence": "有化光臺，臺上化佛如前不異。",
        "translation": "There is a terrace of apparitional light. The apparitional buddha on this terrace is no different from the one mentioned above.",
        "source": "T15n0643_002:0653b09_16"
    },
    {
        "source_sentence": "諸化菩薩身毛孔中，化出一切十方眾生所希見事。",
        "translation": "In the pores of the bodies of the apparitional bodhisattvas' bodies, he transforms all the things that sentient beings in the ten directions want to see.",
        "source": "T15n0643_002:0653b09_17"
    },
    {
        "source_sentence": "化人足下有化光臺，生諸天宮，勝過六欲魔王宮殿，亦勝大梵儼身之宮。",
        "translation": "Below the feet of the apparitional human being is a terrace of magical light that produces heavenly palaces, which are superior to those of the palaces of the demon king of the six desires and also superior to the palaces of the great brahmin.",
        "source": "T15n0643_002:0653b11_18"
    },
    {
        "source_sentence": "諸梵頂相從化菩薩足輞間生。",
        "translation": "The characteristics of the Brahma topknot are produced between the feet of the transformation bodhisattva's feet.",
        "source": "T15n0643_002:0653b12_19"
    },
    {
        "source_sentence": "如是白毛上至無色，遍照一切無量無邊諸天世界，皆如白寶頗梨明鏡。",
        "translation": "Thus, from the white hair on his white hair up to formlessness, he illuminates all the measureless and limitless celestial worlds, all like a white-jeweled crystal clear mirror.",
        "source": "T15n0643_002:0653b13_20"
    },
    {
        "source_sentence": "「諸天見此勝瑞相已，不樂天樂發菩提心，魔王八萬四千天女，視波旬身狀如死狗，",
        "translation": "“When the gods saw these beautiful signs, they did not delight in celestial pleasure and aroused the aspiration for enlightenment. The Māra King’s eighty-four thousand heavenly maidens looked upon Pāpīyān as if he were a dead dog",
        "source": "T15n0643_002:0653b15_21"
    },
    {
        "source_sentence": "亦似燋木。",
        "translation": "It's also like charcoal wood.",
        "source": "T15n0643_002:0653b17_22"
    },
    {
        "source_sentence": "但瞻菩薩白毫相光，心意悅樂無以為譬，怒恚波旬：『前所為事，規欲壞他自失軍眾。』",
        "translation": "But when he looks at the white-haired bodhisattva's radiance, his mind is delighted and doesn't think of it as an example, angering Pāpīyān, saying, 'What I did before was to want to destroy others and lose my own army.'",
        "source": "T15n0643_002:0653b17_23"
    },
    {
        "source_sentence": "作是語時，百千無數天子天女，復發無上菩提道意。」",
        "translation": "When he says this, a hundred thousand countless gods and goddesses again give rise to the intention for the unsurpassed path of enlightenment.",
        "source": "T15n0643_002:0653b19_24"
    },
    {
        "source_sentence": "佛告大王：「如是種種諸勝相事，但從菩薩眉間白毫而生此耳！",
        "translation": "The Buddha told the great king, Such are the various excellent features that arise from the white tuft of hair between the bodhisattva's eyebrows!",
        "source": "T15n0643_002:0653b20_25"
    },
    {
        "source_sentence": "不勞其餘身分功德。",
        "translation": "They don't need the merits of other identities.",
        "source": "T15n0643_002:0653b21_26"
    },
    {
        "source_sentence": "「佛滅度後諸四部眾，若能暫時捨離散亂，繫心正觀菩薩降魔白毫相者，",
        "translation": "“After the parinirvāṇa of the Buddha, if any of the four groups of people can temporarily abandon distraction and concentrate their minds on correctly observing the bodhisattva’s white-haired mark of conquering Māra,",
        "source": "T15n0643_002:0653b22_27"
    },
    {
        "source_sentence": "滅無數劫黑業惡障，亦除十惡諸煩惱障，能於現世見佛影像了了分明，",
        "translation": "Extinguishing the evil hindrances of innumerable eons of black action, also removing the ten bad afflictive hindrances, they can see buddha images clearly and distinctly in the present life.",
        "source": "T15n0643_002:0653b24_28"
    },
    {
        "source_sentence": "如是種種觀相境界不可具說。",
        "translation": "Such are the various objects of contemplation that can't be described in detail.",
        "source": "T15n0643_002:0653b25_29"
    },
    {
        "source_sentence": "「如我滅後，欲觀如來降伏魔時白毛相者，當作此觀，如是觀者名為正觀，",
        "translation": "“Suppose, after my nirvana, someone wants to contemplate the white hairs of the Tathāgata’s hair at the moment he subdues Māra.",
        "source": "T15n0643_002:0653b26_30"
    },
    {
        "source_sentence": "若異觀者名為邪觀」。",
        "translation": "If someone observes differently, they're called mistakenly observing.",
        "source": "T15n0643_002:0653b28_31"
    },
    {
        "source_sentence": "「云何名為如來成佛時大人相、覺人相、不動人相、解脫人相、光明人相、滿智慧人相、具足諸波羅蜜相、首楞嚴等諸三昧海相？",
        "translation": "What are the characteristics of a great person at the time when the Tathāgata becomes a buddha, the characteristics of an enlightened person, the characteristics of an immovable person, the characteristics of a liberated person, the characteristics of a shining person, the characteristics of a person who is endowed with wisdom, the characteristics of",
        "source": "T15n0643_002:0653c01_0"
    },
    {
        "source_sentence": "菩薩摩訶薩，從勝意慈三昧起，入滅意定；",
        "translation": "“Great enlightening beings arise from the concentration of compassion based on overpowering thoughts and enter the concentration of cessation of thought.",
        "source": "T15n0643_002:0653c03_1"
    },
    {
        "source_sentence": "從滅意定起，還入首楞嚴；",
        "translation": "He rose from the absorption of extinction and returned to the abode of śūraṃdhara.",
        "source": "T15n0643_002:0653c04_2"
    },
    {
        "source_sentence": "從首楞嚴起，入慧炬三昧；",
        "translation": "He rose from Śūraṃgama and entered the concentration of the torch of wisdom.",
        "source": "T15n0643_002:0653c05_3"
    },
    {
        "source_sentence": "從慧炬三昧起，入諸法相三昧；",
        "translation": "They arose from the concentration of the torch of wisdom and entered the concentration on all characteristics of things.",
        "source": "T15n0643_002:0653c06_4"
    },
    {
        "source_sentence": "從諸法相三昧起，入光明相三昧；",
        "translation": "They arose from the concentration on the characteristics of all things and entered the concentration on the characteristics of light.",
        "source": "T15n0643_002:0653c06_5"
    },
    {
        "source_sentence": "從光明相三昧起，入師子音聲三昧；",
        "translation": "They arose from the concentration of characteristics of light and entered the concentration of lion sounds.",
        "source": "T15n0643_002:0653c07_6"
    },
    {
        "source_sentence": "從師子音聲三昧起，入師子奮迅三昧；",
        "translation": "“Great enlightening beings emerge from the concentration called lion’s voice and enter the concentration called lion’s roar.",
        "source": "T15n0643_002:0653c08_7"
    },
    {
        "source_sentence": "從師子奮迅三昧起，入海意三昧；",
        "translation": "He rose from the samādhi of lion’s boldness and entered the samādhi of oceanic awareness.",
        "source": "T15n0643_002:0653c09_8"
    },
    {
        "source_sentence": "從海意三昧起，入普智三昧；",
        "translation": "“Great enlightening beings emerge from the concentration of oceanic aspiration and enter the concentration of universal knowledge.",
        "source": "T15n0643_002:0653c10_9"
    },
    {
        "source_sentence": "從普智三昧起，入陀羅尼印相三昧；",
        "translation": "They emerged from the concentration of universal knowledge and entered the concentration of dhāraṇī-samādhi.",
        "source": "T15n0643_002:0653c10_10"
    },
    {
        "source_sentence": "從陀羅尼印相三昧起，入普現色身三昧；",
        "translation": "“Great enlightening beings emerge from the concentration called ‘samādhi of characteristics of spells’ and enter into the concentration called ‘samādhi of universally manifesting physical form.",
        "source": "T15n0643_002:0653c11_11"
    },
    {
        "source_sentence": "從普現色身三昧起，入法界性三昧；",
        "translation": "“Great enlightening beings emerge from the concentration Universally Manifesting Body of Form, and enter the concentration of the essence of the cosmos.",
        "source": "T15n0643_002:0653c12_12"
    },
    {
        "source_sentence": "從法界性三昧起，入師子吼力王三昧；",
        "translation": "“Great enlightening beings emerge from the concentration of the essence of the cosmos of reality and enter the concentration called lion’s roar.",
        "source": "T15n0643_002:0653c13_13"
    },
    {
        "source_sentence": "從師子吼力王三昧起，入滅諸魔相三昧；",
        "translation": "He rose from the samādhi of lion’s roar as king and entered the samādhi of extinguishing the characteristics of demons.",
        "source": "T15n0643_002:0653c14_14"
    },
    {
        "source_sentence": "從滅諸魔相三昧起，入空慧三昧；",
        "translation": "“Great enlightening beings arise from the concentration of extinguishing the signs of all demons and enter the concentration of wisdom on emptiness.",
        "source": "T15n0643_002:0653c15_15"
    },
    {
        "source_sentence": "從空慧三昧起，入解空相三昧；",
        "translation": "They arose from the concentration of knowledge of emptiness and entered the concentration of understanding the characteristics of emptiness.",
        "source": "T15n0643_002:0653c16_0"
    },
    {
        "source_sentence": "從解空相三昧起，入大空智三昧；",
        "translation": "They arose from the concentration of understanding the characteristics of emptiness and entered the concentration of great knowledge of emptiness.",
        "source": "T15n0643_002:0653c16_1"
    },
    {
        "source_sentence": "從大空智三昧起，入遍一切處色身三昧；",
        "translation": "“Furthermore, enlightening beings emerge from the concentration of knowledge of great emptiness and enter into the concentration pervading all directions with a body composed of form.",
        "source": "T15n0643_002:0653c17_2"
    },
    {
        "source_sentence": "從遍一切處色身三昧起，入寂心相三昧；",
        "translation": "“Furthermore, enlightening beings emerge from the concentration pervading all realms of form and body.",
        "source": "T15n0643_002:0653c18_3"
    },
    {
        "source_sentence": "從寂心相三昧起，入菩薩摩訶薩金剛相三昧；",
        "translation": "“Great enlightening beings emerge from the concentration of characteristics of silent mind and enter great enlightening beings’ concentration of characteristics of diamond.",
        "source": "T15n0643_002:0653c19_4"
    },
    {
        "source_sentence": "從金剛相三昧起，入金剛頂三昧；",
        "translation": "He rose from the diamond-like concentration and entered the diamond-peak concentration.",
        "source": "T15n0643_002:0653c20_5"
    },
    {
        "source_sentence": "從金剛頂三昧起，入一切三昧海；",
        "translation": "“Great enlightening beings emerge from the diamond-tuft concentration and enter the ocean of all concentrations.",
        "source": "T15n0643_002:0653c21_6"
    },
    {
        "source_sentence": "從一切三昧海起，入一切陀羅尼海三昧；",
        "translation": "“Great enlightening beings emerge from all oceans of concentrations and enter all oceans of concentrations of mental command.",
        "source": "T15n0643_002:0653c22_7"
    },
    {
        "source_sentence": "從一切陀羅尼海三昧起，入一切佛境界海三昧；",
        "translation": "“Great enlightening beings emerge from the ocean of concentration of all mental commands, and enter into the ocean of concentration in the sphere of all buddhas.",
        "source": "T15n0643_002:0653c23_8"
    },
    {
        "source_sentence": "從一切佛境界海三昧起，入一切諸佛解脫、解脫知見海三昧；",
        "translation": "“Great enlightening beings emerge from the ocean of concentration on the sphere of all buddhas and enter the ocean of knowledge and vision of liberation of all buddhas.",
        "source": "T15n0643_002:0653c24_9"
    },
    {
        "source_sentence": "從解脫、解脫知見海三昧起，然後方入無量微塵數諸三昧海門；",
        "translation": "“Great enlightening beings emerge from the ocean of concentration of knowledge and vision of liberation and enter as many oceans of concentrations as atoms in countless buddha-lands.",
        "source": "T15n0643_002:0653c25_10"
    },
    {
        "source_sentence": "從諸三昧海門起，入寂意滅意三昧；",
        "translation": "“Great enlightening beings emerge from the ocean of oceans of concentrations and enter the concentration of cessation of thought by means of mental quiescence.",
        "source": "T15n0643_002:0653c27_11"
    },
    {
        "source_sentence": "從寂意滅意三昧起，入金剛譬定大解脫三昧相門。",
        "translation": "He arises from the samādhi of cessation of mind in quiescence and enters the great liberation samādhi aspect of adamantine absorption.",
        "source": "T15n0643_002:0653c28_0"
    },
    {
        "source_sentence": "「爾時道場地化似金剛，滿八十里其色正白，不可具見。",
        "translation": "At the time, the site of the Way resembled a vajra, and it was exactly white in color for 80 miles long, so it couldn't be seen in detail.",
        "source": "T15n0643_002:0654a02_0"
    },
    {
        "source_sentence": "此相現時，菩薩眉間白毫相光，端潔正直矗然東向，長一丈五尺，有十楞現。",
        "translation": "When this sign appears, the white hair between the bodhisattva’s eyebrows shines brightly. The enlightening being is upright and straightforward; facing east for a distance of one zhang and five chi, with ten shining rays appearing.",
        "source": "T15n0643_002:0654a03_1"
    },
    {
        "source_sentence": "彌迦女人同類五女，無數萬億天、龍、鬼神，彌勒賢劫諸菩薩等、跋陀婆羅等，",
        "translation": "Maitreya’s daughters were of five kinds: countless myriads of koṭis of goddesses, dragons, and ghost spirits. The bodhisattvas of the world age of Samantabhadra such as Maitreya and the Bhadrapāla",
        "source": "T15n0643_002:0654a05_0"
    },
    {
        "source_sentence": "無量無邊阿僧祇微塵數諸大菩薩，亦見此相。",
        "translation": "Measureless, limitless, and incalculable as many great bodhisattvas as there are atoms in an incalculable number also see this sign.",
        "source": "T15n0643_002:0654a06_1"
    },
    {
        "source_sentence": "「此相現時，佛菩提樹，白毛力故根下自然化生寶華，縱廣正等四十由旬，",
        "translation": "At the foot of this buddha-bodhi tree is a jeweled flower, as long as forty yojanas in length and breadth, which grows spontaneously under its roots due to the power of white hair.",
        "source": "T15n0643_002:0654a07_2"
    },
    {
        "source_sentence": "其華金色金剛為臺。",
        "translation": "The flowers are golden-colored, and the vajra is the dais.",
        "source": "T15n0643_002:0654a09_3"
    },
    {
        "source_sentence": "佛眉間光照此華臺，其光直下至金剛際，於金剛際自然化生二金剛座，",
        "translation": "A ray of light from between the Buddha’s eyebrows illumined this flower-shaped platform. That ray of light descended straight down to the point where there was a diamond [seat], and at the place where there was a diamond seat it naturally produced two kinds of diamond thrones.",
        "source": "T15n0643_002:0654a09_4"
    },
    {
        "source_sentence": "互相掁觸，聲振三千大千世界，令此大地六種振動。",
        "translation": "When they touch each other, the sound shakes 3,000 great one-thousand worlds, causing this earth to shake in six ways.",
        "source": "T15n0643_002:0654a11_5"
    },
    {
        "source_sentence": "其金剛座上衝蓮華，至蓮華根，其蓮華根亦是金剛，三種金剛共相掁觸，",
        "translation": "On that adamantine throne, he thrusts out lotus flowers and reaches the root of the lotus blossom. The root of the lotus blossom is also made of diamond. Three kinds of diamond touch one another:",
        "source": "T15n0643_002:0654a12_6"
    },
    {
        "source_sentence": "直還下過至金剛際往旋十返，白毫光明圍遶十匝，令金剛座鏗然不動。",
        "translation": "He went straight back down to the diamond and circled it ten times, surrounded by white-haired rays of light ten times so that his vajra throne would hover without moving.",
        "source": "T15n0643_002:0654a14_7"
    },
    {
        "source_sentence": "「佛坐此坐，消除三障成菩提道，佛心境界說不可盡，若廣說者，一切眾生至十地菩薩，",
        "translation": "“The Buddha, seated in this seat, removes the three hindrances and accomplishes the path of enlightenment. The sphere of buddha-mind cannot be exhaustively explained; but if one were to explain it in detail, all sentient beings would arrive at the tenth stage:",
        "source": "T15n0643_002:0654a16_8"
    },
    {
        "source_sentence": "亦不能知亦非所解。",
        "translation": "They can't know it, and they don't understand it.",
        "source": "T15n0643_002:0654a18_9"
    },
    {
        "source_sentence": "是故於此白毫相中，隱而不說。",
        "translation": "That's why it's hidden and not explained in this white-haired characteristic.",
        "source": "T15n0643_002:0654a18_10"
    },
    {
        "source_sentence": "「如是白毛光明力故，令菩提樹，金剛為莖，根亦金剛，楷七寶成，楷上生光，",
        "translation": "“Thus, because of the power of the white hair’s shining light, the tree of enlightenment has a stem made of diamond and its roots are also made of diamond. The pattern is made of the seven kinds of treasure.",
        "source": "T15n0643_002:0654a19_11"
    },
    {
        "source_sentence": "各各有七圍遶佛身，化成寶縵，樹葉金色，華百寶色，華上有光百千寶色，",
        "translation": "Each of them had seven circumferences around the Buddha’s body, transforming themselves into jeweled silhouetted cloth. The leaves of each tree were golden in color and the flowers were a hundred-thousand kinds in color. On the top of each flower was a shining light one hundred thousand kinds in color.",
        "source": "T15n0643_002:0654a21_12"
    },
    {
        "source_sentence": "諸天寶光不得為譬，果白寶色，夜摩天上微妙白寶不得為比，其果光明化摩尼網彌覆樹上，",
        "translation": "The light of the divine jewels cannot be compared to the white color of the fruit, nor can the subtle white treasures of the Yama heavenly realm be compared to it.",
        "source": "T15n0643_002:0654a23_13"
    },
    {
        "source_sentence": "於其網間猶如白絲，婉轉下垂，化成寶鈴。",
        "translation": "Between the nets it looked like white silk, draped in a gentle downward curve and transformed into a jeweled bell.",
        "source": "T15n0643_002:0654a25_14"
    },
    {
        "source_sentence": "「鈴四角頭有大寶臺，其臺高顯過於上方無量世界。",
        "translation": "At the four corners of the bell, there's a great jeweled dais, which is so high that it's more than an infinite number of worlds above.",
        "source": "T15n0643_002:0654a27_0"
    },
    {
        "source_sentence": "過是界已，復更化成諸大寶臺，其臺高妙不可具說，光顯微妙。",
        "translation": "After passing beyond this boundary, he again transforms into a great jeweled dais, which is so high and sublime that it can't be described in detail, shining and revealing its subtlety.",
        "source": "T15n0643_002:0654a28_1"
    },
    {
        "source_sentence": "譬如和合百千萬億諸須彌山，於其臺上有大寶蓋純金剛成，雜色間錯微妙光明，",
        "translation": "It's like the confluence of hundreds of thousands of myriads of koṭis of Sumeru mountains, on which there's a great jeweled canopy made of pure adamantine gold with variegated subtle light.",
        "source": "T15n0643_002:0654a29_2"
    },
    {
        "source_sentence": "光明下垂化成幡帳。",
        "translation": "Beneath the light, he transforms into a banner curtain.",
        "source": "T15n0643_002:0654b02_3"
    },
    {
        "source_sentence": "於幡帳中雨寶蓋雲，寶蓋雲中雨幢幡雲，幢幡雲中雨妓樂雲，妓樂雲中雨寶光雲，",
        "translation": "In the curtain of banners and pennants it rained clouds of jewel canopies, in the clouds of jewel canopies it rained clouds of banners and pennants, in the clouds of banners and pennants it rained clouds of music and dances, and in the music and dances clouds it rained clouds of jewel light.",
        "source": "T15n0643_002:0654b03_4"
    },
    {
        "source_sentence": "寶光雲中雨諸香雲，諸香雲中雨師子座雲，師子座雲中雨華鬘雲，華鬘雲中雨妙音雲，",
        "translation": "In the cloud of jewel light rained clouds of fragrant clouds, in the cloud of fragrant clouds rained clouds of lion seats, in the cloud of lion seats rained clouds of garlands of flowers, and in the cloud of garlands of flowers rained clouds of beautiful sounds.",
        "source": "T15n0643_002:0654b05_5"
    },
    {
        "source_sentence": "妙音雲中雨偈頌雲，偈頌雲中雨諸珍寶供養具雲。",
        "translation": "The cloud of rain in the cloud of marvelous sound is a verse that praises the cloud, and the cloud of offerings of treasures raining from the cloud is a verse that praises the cloud of offerings.",
        "source": "T15n0643_002:0654b07_6"
    },
    {
        "source_sentence": "如是等種種供具，皆從菩提樹白毫相光明中出。",
        "translation": "Such various offerings as these all emerge from the white-haired radiance of the bodhi tree's white hair.",
        "source": "T15n0643_002:0654b08_7"
    },
    {
        "source_sentence": "「時白毛光下垂照地，令道場邊金剛地上化作七池，池生德水，水有七色，",
        "translation": "At that time the light of a ray of white hair fell down to illuminate the ground and caused seven pools to be created on the adamantine earth at the side of the terrace of enlightenment. The water produced by those pools was of seven colors:",
        "source": "T15n0643_002:0654b09_8"
    },
    {
        "source_sentence": "七色分明，色有十光上照樹王。",
        "translation": "The seven colors are distinct, and there are ten colors that shine brightly above the king of trees.",
        "source": "T15n0643_002:0654b11_9"
    },
    {
        "source_sentence": "其池四岸眾寶合成，一岸百寶所共合成，一寶流出百億光明，池底純是金剛摩尼以為底沙。",
        "translation": "The four sides of the pond are made of all kinds of precious substances. A single bank is made of a hundred jewels, and from each jewel one ray of light emanates billions of rays of light. The bottom of the pond is composed solely of diamond-like sand.",
        "source": "T15n0643_002:0654b12_0"
    },
    {
        "source_sentence": "水生諸華純黃金葉，葉上千光化成光輪。",
        "translation": "The water produces flowers that are purely golden leaves, and the thousand lights on the leaves transform into a wheel of light.",
        "source": "T15n0643_002:0654b14_1"
    },
    {
        "source_sentence": "池有七渠水自湧出，池口生華葉葉相次，於蓮華鬚流出諸水，如琉璃珠映徹分明。",
        "translation": "In the pond there are seven streams of water that flow forth spontaneously. Flower leaves and leaves grow from the mouth of the pond one after the other, and water flows forth from the base of the lotus flower like a lapis lazuli pearl shining brilliantly and clearly.",
        "source": "T15n0643_002:0654b15_2"
    },
    {
        "source_sentence": "於渠兩邊列生諸華，八萬四千，眾寶嚴飾。",
        "translation": "On both sides of the ditches there were flowering flowers, eighty-four thousand in number, adorned with various jewels.",
        "source": "T15n0643_002:0654b17_3"
    },
    {
        "source_sentence": "此渠中水更相灌注，當水流時光亦隨轉，映菩提樹。",
        "translation": "The water in this ditch then pours back into each other, and as the water flows, the light also follows it, reflecting the bodhi tree.",
        "source": "T15n0643_002:0654b18_4"
    },
    {
        "source_sentence": "此樹光中，一一葉上生寶蓮華，其華遍布一切世界，於其華上化白寶臺，",
        "translation": "In the light of this tree, each leaf produces a jeweled lotus blossom that pervades all worlds and on top of that blossom is a magical white-jeweled dais.",
        "source": "T15n0643_002:0654b19_5"
    },
    {
        "source_sentence": "遍至十方無量世界，其白毫光從佛眉間出，寶蓮華團圓正等滿一由旬。",
        "translation": "To the infinite worlds of the ten directions, that white-haired radiance emerged from between the Buddha's eyebrows, and the jeweled lotus flower lump was exactly one yojana in circumference.",
        "source": "T15n0643_002:0654b21_6"
    },
    {
        "source_sentence": "如是相次過於上方，無量無邊不可算數微塵世界。",
        "translation": "In succession to the above, there are measureless, limitless, and incalculable worlds of tiny particles like these.",
        "source": "T15n0643_002:0654b22_7"
    },
    {
        "source_sentence": "華華相次，一一華上見一佛坐，身黃金色方身丈六，結加趺坐坐蓮華臺，",
        "translation": "On each flower he saw a buddha seated with golden-colored bodies, sixteen feet in circumference, sitting cross-legged on a lotus dais.",
        "source": "T15n0643_002:0654b24_8"
    },
    {
        "source_sentence": "其金剛座及菩提樹，如上所說等無有異，乃至十方亦復如是！",
        "translation": "The adamantine throne and the tree of enlightenment, as explained above, are no different, and so are the ten directions!",
        "source": "T15n0643_002:0654b25_9"
    },
    {
        "source_sentence": "「於白毫中復出寶華，勝前寶華百億萬倍，華上有佛，如釋迦文等無有異，",
        "translation": "“In the white tuft of hair, another jeweled flower emerges, a hundred million times greater than the preceding jeweled flower, with buddhas on top of it like Śākyamuni and so forth, no different.",
        "source": "T15n0643_002:0654b27_10"
    },
    {
        "source_sentence": "一華鬚頭復有一佛身亦丈六，入深禪定心不傾動。",
        "translation": "At the top of one flower beard was another buddha, also sixteen feet in height, who entered deep meditative absorption without moving his mind.",
        "source": "T15n0643_002:0654b29_11"
    },
    {
        "source_sentence": "「如是光明，照於東方無量無數百千世界，令諸世界皆作金色。",
        "translation": "“Such light illuminates measureless and countless hundreds of thousands of worlds in the east, causing all worlds to become golden-colored.",
        "source": "T15n0643_002:0654c01_12"
    },
    {
        "source_sentence": "彼眾生見化佛毛孔開現光明，亦復如是出無量百千寶光，一一光中，復有無量百億化佛。",
        "translation": "Those sentient beings who saw the pores of the transformation buddha's hair reveal their light, and so did they produce measureless hundreds of thousands of jeweled rays of light. In each ray of light there were measureless millions more apparitional buddhas.",
        "source": "T15n0643_002:0654c02_13"
    },
    {
        "source_sentence": "「時諸天、龍、鬼神、夜叉、乾闥婆等，覩此光明遶佛千匝，照十方國見十方國，",
        "translation": "“Then the gods, dragons, ghosts, yakṣas, gandharvas, and other spirits saw this ray of light a thousand times circling the Buddha. It shone over all the kingdoms in the ten directions and appeared to all the kingdoms everywhere.",
        "source": "T15n0643_002:0654c04_14"
    },
    {
        "source_sentence": "高下大小了了分明，如執明鏡自見面像。",
        "translation": "It's as clear as holding a bright mirror and seeing an image on its own.",
        "source": "T15n0643_002:0654c06_15"
    },
    {
        "source_sentence": "是諸大眾，波旬眷屬八萬億眾，諸鬼神、天、龍、夜叉等，各見白毫端直丈五，",
        "translation": "These were the eighty-thousand million members of the great assembly. The gods, goddesses, devas, nāgas, yakṣas, and so forth all saw the white hair on the top of the moon’s hair, one zhang and five chi in diameter.",
        "source": "T15n0643_002:0654c07_16"
    },
    {
        "source_sentence": "十方光見，映蔽眾目如萬億日，不可具見。",
        "translation": "The light seen in the ten directions shone like a myriad of koṭis of suns, which could not be seen.",
        "source": "T15n0643_002:0654c09_17"
    },
    {
        "source_sentence": "但於光中，見無量無數百億千萬化釋迦文，眉間白毛正長丈五，一一毛中出無量光，",
        "translation": "In that light he saw countless millions and millions of emanations of the buddhas, each with white hair one foot five inches long between his eyebrows. Each hair emitted infinite rays of light.",
        "source": "T15n0643_002:0654c10_18"
    },
    {
        "source_sentence": "一一光中無量化佛，化佛眉間亦復如是！",
        "translation": "In each ray of light, there are countless apparitional buddhas, and so it is between the apparitional buddha's eyebrows!",
        "source": "T15n0643_002:0654c12_19"
    },
    {
        "source_sentence": "是白毫光輪郭之中，流出眾光上至佛額，顯發額廣平正之相，額上諸毛毛皆上靡，",
        "translation": "In the middle was a circle of white rays of light that extended as far as the Buddha’s forehead. It showed the width and evenness of the Buddha’s forehead, and all the hair on his forehead stood on top of each other.",
        "source": "T15n0643_002:0654c13_20"
    },
    {
        "source_sentence": "其毛根下梵摩尼色，適眾生心，毛端流光如融紫金，光相上靡入於髮際，",
        "translation": "Its hair was the color of a pure jewel beneath its roots, adapting to the mentalities of living beings. The light emanating from the hair’s ends was as bright as molten red gold.",
        "source": "T15n0643_002:0654c15_21"
    },
    {
        "source_sentence": "婉轉垂下至耳輪邊，然後布散上入髮間，圍遶蠡文數百千匝，從枕骨生，",
        "translation": "It descended gently down to the edge of the ear-ring, and then spread it upward and entered between them. Encircling the brahman’s body several hundreds of thousands of times, it grew out of the bones of its cushion.",
        "source": "T15n0643_002:0654c17_22"
    },
    {
        "source_sentence": "如金蓮華葉日照開敷，蓮華葉間及蓮華鬚，如帝釋畫了了分明，眾色異現。",
        "translation": "It's like the golden lotus leaf that shines brightly when the sun opens, the lotus leaf between the lotus leaves and the lotus beard are like Indra's painted with distinctive colors that appear differently.",
        "source": "T15n0643_002:0654c18_23"
    },
    {
        "source_sentence": "於其色間無量化佛，一佛七菩薩諸天以為侍者，手執寶華白中白者，華有五光五色分明，",
        "translation": "Among those forms, there were countless transformation buddhas, with one Buddha and seven bodhisattva gods as their attendants, holding jeweled flowers white in the middle of their hands, which had five lights and five colors clearly shining brightly.",
        "source": "T15n0643_002:0654c20_24"
    },
    {
        "source_sentence": "隨從化佛不失其所，此名如來初成佛時白毫相光。",
        "translation": "They follow the transformation buddhas and don't lose their place, which is called the white-faced radiance of the white-haired moon at the time when the Tathāgata first became a buddha.",
        "source": "T15n0643_002:0654c22_25"
    },
    {
        "source_sentence": "「因白毫光初生項光，生王宮時此光如日，見不了了，圓光一尋別自當說。",
        "translation": "When the white-haired ray of light first arises from the neck, it's like the sun when it arises in the king's palace, which doesn't see and doesn't understand; the perfect radiance will be explained separately in a single moment of thought.",
        "source": "T15n0643_002:0654c24_0"
    },
    {
        "source_sentence": "時諸八部覩白毫光所見不同，有見白毛猶如諸佛；",
        "translation": "At that time the eightfold assembly of Buddhist monks and laymen looked different from each other. Some saw white hairs, just like those of the buddhas.",
        "source": "T15n0643_002:0654c25_1"
    },
    {
        "source_sentence": "有見白毫如諸菩薩；",
        "translation": "Some see the white tuft of hair like bodhisattvas.",
        "source": "T15n0643_002:0654c26_2"
    },
    {
        "source_sentence": "有見白毛如己父母，一切世間可尊敬事，悉於毛端了了得見，見已歡喜。",
        "translation": "Some people see white hair like their own parents, and all the world's respectable things are seen at the end of their hair, and they rejoice when they see them.",
        "source": "T15n0643_002:0654c27_3"
    },
    {
        "source_sentence": "有發無上菩提心者；",
        "translation": "Some give rise to the thought of supreme enlightenment.",
        "source": "T15n0643_002:0654c29_4"
    },
    {
        "source_sentence": "有發聲聞、緣覺心者，如是諸鬼見白毛者，自然慈心無諸惡意。」",
        "translation": "If there are śrāvakas and pratyekbuddhas who give rise to the mind of śrāvakas and pratyekbuddhas, such ghosts who see white hair will naturally have a compassionate mind with no bad thoughts.",
        "source": "T15n0643_002:0654c29_5"
    },
    {
        "source_sentence": "佛告父王：「如來白毛，自從初生乃至成佛，於其中間微細小事可得觀見。",
        "translation": "The Buddha told his father, From the first birth of the Tathāgata's white hair until he becomes a buddha, there are subtle and minor matters among them that can be observed.",
        "source": "T15n0643_002:0655a02_6"
    },
    {
        "source_sentence": "既成佛已，白毫光明眾相具足，諸修多羅中佛已廣說，白毫相光究竟之處，",
        "translation": "Having become a buddha, the white-haired ray of light is endowed with all its characteristics. The Buddha has explained in detail in various sutras where the white-haired ray of light reaches its ultimate end:",
        "source": "T15n0643_002:0655a03_7"
    },
    {
        "source_sentence": "十地菩薩爾乃得見，先說小者，應諸世間此事易見。」",
        "translation": "Only then will the bodhisattvas of the tenth ground be able to see it, and those who first explain the lesser should make this matter easy to see in the world.",
        "source": "T15n0643_002:0655a05_8"
    },
    {
        "source_sentence": "佛告父王及勅阿難：「諦聽諦聽，善思念之！",
        "translation": "The Buddha told his father and commanded Ānanda, Listen closely, listen closely, and consider it well!",
        "source": "T15n0643_002:0655a07_0"
    },
    {
        "source_sentence": "傳語後世諸弟子等皆令得知，若我滅後諸比丘等，若問是事，此白毫相菩薩本昔修何行得？",
        "translation": "If the monks and others after my death ask me about this matter, what practice did this white-haired bodhisattva cultivate in the past to attain it?",
        "source": "T15n0643_002:0655a08_0"
    },
    {
        "source_sentence": "汝當答言：『佛白毫相從無量劫捨心不慳，不見前相不憶財物，心無封著而行布施，",
        "translation": "You should answer, 'The Buddha' sleevelessness of the white hair marks has been abandoned for measureless eons, his mind isn't stingy, he doesn't see the former marks and doesn't remember possessions, and his mind isn't attached to them but practices generosity.",
        "source": "T15n0643_002:0655a10_1"
    },
    {
        "source_sentence": "以身心法攝身威儀，護持禁戒如愛雙目，然其心內豁然虛寂，不見犯起及捨墮法，",
        "translation": "By means of the law of body and mind they control their bodily manners, upholding the precepts like craving for both eyes. Yet within their minds they are open and silent, not seeing transgressions that arise or those that fall into them.",
        "source": "T15n0643_002:0655a12_2"
    },
    {
        "source_sentence": "心安如地無有動搖。",
        "translation": "Their minds are as peaceful as the ground, and there's no movement.",
        "source": "T15n0643_002:0655a14_3"
    },
    {
        "source_sentence": "設有一人，以百千刀屠截其身；",
        "translation": "Suppose there is a man who were to be slaughtered with a hundred thousand swords.",
        "source": "T15n0643_002:0655a14_4"
    },
    {
        "source_sentence": "設復有人，以諸棘刺鞭撻其身，菩薩初無一念瞋恚；",
        "translation": "Suppose another person were to be tormented and whipped with thorns, the enlightening being would not have a thought of anger at first.",
        "source": "T15n0643_002:0655a15_5"
    },
    {
        "source_sentence": "設復有人頭有千舌舌出千言，種種異辭罵辱，菩薩顏色不變，如淨蓮華，",
        "translation": "Suppose there is another person with a thousand words on his forehead who utters a thousand words, and the enlightening being’s countenance remains the same as that of pure lotus blossoms.",
        "source": "T15n0643_002:0655a16_6"
    },
    {
        "source_sentence": "心無所著身心不懈，無疲惓意如救頭然。",
        "translation": "The mind has no attachment, body and mind are not lazy, and without weariness or torpor, his mind is like a rescue.",
        "source": "T15n0643_002:0655a18_7"
    },
    {
        "source_sentence": "如身毛孔生那利瘡，求覓良醫晝夜精進，心無染污如琉璃珠表裏俱淨，",
        "translation": "It's like the sores that grow from a pore in your body, seeking a good doctor day and night with effort, and your mind isn't stained like a lapis lazuli pearl, which is pure inside and out.",
        "source": "T15n0643_002:0655a19_8"
    },
    {
        "source_sentence": "攝身斂意，閉目叉手端坐正受，其心如海湛然不動，如金剛山不可沮壞。",
        "translation": "He gathered his body, concentrated his mind, closed his eyes, placed his palms together, and sat cross-legged to receive the precepts. His mind was as calm and unmoving as the ocean; like a mountain of diamond that cannot be broken.",
        "source": "T15n0643_002:0655a21_0"
    },
    {
        "source_sentence": "雖作是意不隨禪生，灰心滅智，無所適莫，亦無覺觀非不觀法，心智猛利攝諸方便，",
        "translation": "Though he thinks thus, he doesn’t follow meditation; his knowledge of the cessation of ashes and mind has no place to be. He neither perceives nor doesn’t perceive things.",
        "source": "T15n0643_002:0655a22_1"
    },
    {
        "source_sentence": "不見有法若大若小，有細微相，如是眾多名波羅蜜。",
        "translation": "They don't see that there are dharmas that are large or small and have subtle characteristics, and such many of them are called the perfection.",
        "source": "T15n0643_002:0655a24_2"
    },
    {
        "source_sentence": "亦從三十七助菩提法，復從十力、四無所畏、大慈大悲三念處諸妙功德，",
        "translation": "“Furthermore, from the thirty-seven factors conducive to enlightenment and also from the ten powers, the four fearlessnesses, great benevolence, great compassion, and the three abodes of mindfulness—all these marvelous qualities.",
        "source": "T15n0643_002:0655a25_3"
    },
    {
        "source_sentence": "得此白毫。』",
        "translation": "I'll get this white hair.'",
        "source": "T15n0643_002:0655a27_4"
    },
    {
        "source_sentence": "「若我滅後佛諸弟子，捨離諸惡，去憒閙相，樂少語法，不務多事，晝夜六時，",
        "translation": "“Suppose, after my nirvana, the Buddha’s disciples abandoned evil deeds, relieved themselves of uncomfortable appearances, enjoyed few words and teachings, and did not engage in many activities.",
        "source": "T15n0643_002:0655a27_5"
    },
    {
        "source_sentence": "能於一時，於一時中分為少分，少分之中能須臾間，念佛白毫令心了了，",
        "translation": "They can, at one time, instantaneously divide it into small parts; and within a small part, they can, for an instant, be mindful of the Buddha’s name so as to make them perceptible to the mind.",
        "source": "T15n0643_002:0655a29_6"
    },
    {
        "source_sentence": "無謬亂想分明正住，注意不息念白毫者，若見相好若不得見，如是等人，",
        "translation": "Those who don't mistakenly conceptualize clearly and correctly abide, aren't mindful of the white hair without stopping to think about it, see their marks and beauty or don't see them, and so forth.",
        "source": "T15n0643_002:0655b02_7"
    },
    {
        "source_sentence": "除却九十六億那由他恒河沙微塵數劫生死之罪。",
        "translation": "He'll remove the sin of birth-and-death for as many eons as there are grains of dust in nine billion six hundred million nayutas of Ganges Rivers.",
        "source": "T15n0643_002:0655b04_8"
    },
    {
        "source_sentence": "「設復有人，但聞白毛心不驚疑，歡喜信受，此人亦除却八十億劫生死之罪。",
        "translation": "“Suppose another person simply hears the white hair and isn’t frightened, joyfully believes it, and rids themselves of the sins of eight billion eons of birth-and-death.",
        "source": "T15n0643_002:0655b06_0"
    },
    {
        "source_sentence": "若諸比丘比丘尼、優婆塞優婆夷，犯四根本罪，不如等罪及五逆罪，除謗方等，",
        "translation": "If monks, nuns, laymen, and laymen commit the four fundamental sins, such sins as not-common sins and five heinous sins, except for denigrating equanimity, then they'll be expelled.",
        "source": "T15n0643_002:0655b07_1"
    },
    {
        "source_sentence": "如是眾人若欲懺悔，晝夜六時身心不懈。",
        "translation": "Thus, if people want to repent, they don't restrain their body and mind at six o'clock during the day or night.",
        "source": "T15n0643_002:0655b09_2"
    },
    {
        "source_sentence": "譬如人在深草中行，四面火起，猛風吹來欲燒其身，此人作念：『若火燒我，",
        "translation": "Suppose there is a man walking among the thickets of grass. A fire breaks out in all four directions and strong wind blows to burn his body. That man thinks:",
        "source": "T15n0643_002:0655b10_3"
    },
    {
        "source_sentence": "未死之間支節解散，我當云何得滅此火？",
        "translation": "Before he dies, his limbs will disintegrate, so how can I extinguish this fire?",
        "source": "T15n0643_002:0655b12_4"
    },
    {
        "source_sentence": "若不設計命必不濟，誰有智者多諸方便能救我命？",
        "translation": "If I don't design my life, I won't be able to save it, so who is there a wise person with many ways to save my life?",
        "source": "T15n0643_002:0655b13_5"
    },
    {
        "source_sentence": "設命全濟於彼人所無所悋惜？』",
        "translation": "Suppose someone's life is completely relieved, and there's nothing to be cherished by that person?'",
        "source": "T15n0643_002:0655b14_6"
    },
    {
        "source_sentence": "作是思惟已，如太山崩，五體投地號泣雨淚，合掌向佛，讚歎如來種種德行。",
        "translation": "After he had this thought, it was as if a great mountain had collapsed and his five bodies were thrown to the ground, weeping and raining tears, joining their palms in respect toward the Buddha and praising the Tathāgata's various virtuous deeds.",
        "source": "T15n0643_002:0655b15_7"
    },
    {
        "source_sentence": "作是讚已，誦懺悔法，繫念在前，念佛眉間白毫相光，一日至七日，前四種罪可得輕微，",
        "translation": "After praising this, he recites the method of repentance, fixes his thoughts in front of him, and remembers the white hair between the Buddha’s eyebrows that shines brightly for one day and seven days. The first four sins can be minor:",
        "source": "T15n0643_002:0655b17_0"
    },
    {
        "source_sentence": "三七日時罪相漸滅，七七日後，然後羯磨，事在他經。",
        "translation": "After three or seven days, the offense gradually ceases, and after seventy-seven days, it's followed by a kalpa that serves another scripture.",
        "source": "T15n0643_002:0655b19_0"
    },
    {
        "source_sentence": "若比丘，犯不如罪，觀白毫光闇黑不現，應當入塔觀像眉間，一日至三日，",
        "translation": "If a monk commits an offense and doesn't commit another offense, observing the white hair between his eyebrows as darkness and blackness doesn't show up, he should enter the stūpa to contemplate the image between his eyebrows for one day or three days.",
        "source": "T15n0643_002:0655b20_1"
    },
    {
        "source_sentence": "合掌啼泣一心諦觀，然後入僧說前罪事，此名滅罪。",
        "translation": "He joins his palms, weeps, and observes with a concentrated mind, and then enters the saṃgha to explain the previous offense, which is called extinguishing sin.",
        "source": "T15n0643_002:0655b22_2"
    },
    {
        "source_sentence": "前五種罪，念白毫光經八百日，然後復有別羯磨法。」",
        "translation": "The first five kinds of sins last for 800 days when they're mindful of the white-haired shining light, and then there's a separate karmic ritual.",
        "source": "T15n0643_002:0655b23_3"
    },
    {
        "source_sentence": "佛告父王：「如來有無量相好，一一相中，八萬四千諸小相好，如是相好不及白毫少分功德。",
        "translation": "The Buddha told his father, The Tathāgata has measureless characteristics and features, each of which have 84,000 minor characteristics that aren't as good as the smallest part of the white hair.",
        "source": "T15n0643_002:0655b25_0"
    },
    {
        "source_sentence": "是故今日，為於來世諸惡眾生，說白毫相大慧光明消惡觀法。",
        "translation": "That's why today, for the sake of bad sentient beings in future lives, he teaches the white-haired radiance of great wisdom that extinguishes bad contemplation.",
        "source": "T15n0643_002:0655b27_1"
    },
    {
        "source_sentence": "若有邪見極重惡人，聞此觀法具足相貌，生瞋恨心，無有是處。",
        "translation": "If there are people with extremely grave mistaken views who hear that this contemplation of the Dharma is replete with characteristics and become angry, there's no place for them.",
        "source": "T15n0643_002:0655b28_2"
    },
    {
        "source_sentence": "縱使生瞋，白毫相光亦復覆護，暫聞是語除三劫罪，後身生處生諸佛前，",
        "translation": "Even if he becomes angry and the white hair on his forehead shines like a ray of light that also covers him, when he hears these words momentarily to remove the sins committed in the past three eons, he'll be born in front of the buddhas in the place where he was born.",
        "source": "T15n0643_002:0655c01_0"
    },
    {
        "source_sentence": "如是種種百千億種，觀諸光明微妙境界，不可悉說，念白毫時自然當生。",
        "translation": "These various hundreds of thousands of myriads of koṭis of such kinds observe the subtle realms of the light, which can't be described in detail, and they will naturally arise when they're mindful of the white tiny hair.",
        "source": "T15n0643_002:0655c02_1"
    },
    {
        "source_sentence": "如此觀者名為正觀，若異觀者名為邪觀。",
        "translation": "Such contemplation is called right contemplation, and if it's a different contemplation, it's called wrong contemplation.",
        "source": "T15n0643_002:0655c04_2"
    },
    {
        "source_sentence": "「云何名觀額廣平正額廣平正相？",
        "translation": "What's called observing the width and levelness of the forehead and the width and levelness of the correct forehead?",
        "source": "T15n0643_002:0655c06_0"
    },
    {
        "source_sentence": "二輪光明，光明輪郭，千輻轂輞，成摩尼珠，形如毘紐羯磨天畫。",
        "translation": "The light of the two wheels is endowed with a thousand-spoked hub, which is made of maṇi beads shaped like the picture depicted in the Virūḍhakama Heaven.",
        "source": "T15n0643_002:0655c06_1"
    },
    {
        "source_sentence": "於畫中流出上妙金色之光，來入白毫，遶毫七匝，上入額上諸毛孔中，",
        "translation": "In the painting, a brilliant golden light emanating from the upper part of the hair came into the white hair and circled it seven times. It went upward to all the pores on his forehead.",
        "source": "T15n0643_002:0655c08_2"
    },
    {
        "source_sentence": "乃至髮際諸色相中，婉轉下垂至于耳輪，上散入髮，遶髮七匝。",
        "translation": "At the limit of form, it's draped down to the ear-wheel and scattered seven times around it.",
        "source": "T15n0643_002:0655c09_3"
    },
    {
        "source_sentence": "從枕骨出遶前蓮華相，團圓七匝七畫分明，畫有七色色生七華，華有一佛有七菩薩以為侍者，",
        "translation": "The shape of the lotus flower that emerged from the bones of the cushion was round, seven-sided and seven-drawn in circumference, clearly depicted with seven colors. Seven flowers grew out of these seven colors; each colored with a buddha and accompanied by seven bodhisattvas were its attendants.",
        "source": "T15n0643_002:0655c11_4"
    },
    {
        "source_sentence": "恭敬圍遶右旋而轉。",
        "translation": "Surrounded by them, they circled to their right and turned around.",
        "source": "T15n0643_002:0655c13_5"
    },
    {
        "source_sentence": "如是額廣平正三相：髮際相、頭諸毛孔相、腦中相。",
        "translation": "Thus, the forehead is broad and flat with three characteristics: its shape at the end, the shape of the hair pores on the head, and the shape in the brain.",
        "source": "T15n0643_002:0655c14_6"
    },
    {
        "source_sentence": "腦中亦有十四光，現諸脈中，中外俱徹明顯可愛，踊出白光紅紫間錯，",
        "translation": "The fourteen rays of light are also found in the interior of the consciousness; they appear in all the veins. Both inside and outside the veins are distinct and pleasing, emanating white light with a mixture of red and purple colors.",
        "source": "T15n0643_002:0655c15_7"
    },
    {
        "source_sentence": "其色微細從枕骨出，亦遶前者三匝。",
        "translation": "Its color is subtle and comes out of the pillow's bones, circling the front three times.",
        "source": "T15n0643_002:0655c16_8"
    },
    {
        "source_sentence": "一一畫間有一佛坐，有二菩薩以為侍者，益更明顯勝前數倍。",
        "translation": "Between each image was a buddha seated, with two bodhisattvas serving as their attendants, which became even more distinct and several times greater than the previous one.",
        "source": "T15n0643_002:0655c17_9"
    },
    {
        "source_sentence": "「云何觀如來眉相？",
        "translation": "What's observing the Tathāgata's eyebrow marks?",
        "source": "T15n0643_002:0655c20_0"
    },
    {
        "source_sentence": "左右二眉形如月初，卷生諸毛稀稠得所隨月形轉，其色艶紫，毛端紺青，",
        "translation": "The two left and right eyebrows are shaped like the moon. curled hairs grow thick and rare, appearing in the form of the following moon. Their color is lustrous purple; the hair at the ends of their hair is dark blue.",
        "source": "T15n0643_002:0655c20_1"
    },
    {
        "source_sentence": "琉璃妙光色無與比，眉光兩靡散入諸髮，既入髮已上至髮杪，其光蠡起，",
        "translation": "The color of the lapis lazuli is incomparable, and the light emanating from its eyebrows penetrates everywhere. As soon as it does so, up to the top of its head, that light rises upward.",
        "source": "T15n0643_002:0655c22_2"
    },
    {
        "source_sentence": "蜂翠孔雀色無以類。",
        "translation": "There's no such thing as the color of bees, flowers, or peacocks.",
        "source": "T15n0643_002:0655c23_3"
    },
    {
        "source_sentence": "猶如聚墨比琉璃光，亦復下垂從枕骨出，右旋宛轉遶光四匝，一一畫中出一化佛，",
        "translation": "It's like the light of a heap of ink that's like lapis lazuli, which also descends downward and emerges from its pillow bones, circles it four ways to its right, and produces a magical Buddha in each portrait.",
        "source": "T15n0643_002:0655c24_4"
    },
    {
        "source_sentence": "有二菩薩及二比丘翼侍左右，皆悉住立蓮華鬚上，明顯可愛勝前數倍。",
        "translation": "Two bodhisattvas and two bhikṣus stood to their left and right, all standing on top of each other’s lotus beards. Their distinctive beauty was several times greater than that of the preceding ones.",
        "source": "T15n0643_002:0655c26_5"
    },
    {
        "source_sentence": "眉下三畫及眼眶中，旋生四光青黃赤白，上向艶出入眉骨中，出眉毛端亦如前法。",
        "translation": "The three images below the eyebrows and the four rays of light that arise from the eye socket under the eyebrows are produced in turn, which are blue, yellow, red, and white, and the above-facing luster emerges and enters into the bones of the eyebrows, producing the hair at the top of the eyebrow just as before.",
        "source": "T15n0643_002:0655c27_6"
    },
    {
        "source_sentence": "從枕骨出遶光四匝，四色分明：黃色化佛身黃金色，白色化佛身白銀色，",
        "translation": "The light emanating from the bones of the cushion was fourfold, shining clearly in four distinct colors: yellow-colored magical body of the Buddha was golden; white magical body of the Buddha was white silvery.",
        "source": "T15n0643_002:0655c29_7"
    },
    {
        "source_sentence": "青色化佛身金精色，赤色化佛身車璩色。",
        "translation": "The blue-colored transformation body of the Buddha is the color of gold essence, and the red-colored transformation body of the Buddha is the color of a chariot.",
        "source": "T15n0643_002:0656a02_8"
    },
    {
        "source_sentence": "如是右旋益更明顯勝前數倍。",
        "translation": "Thus, the right whirl gain becomes even more distinct and several times greater than the previous one.",
        "source": "T15n0643_002:0656a03_9"
    },
    {
        "source_sentence": "「云何觀如來眼睫相？",
        "translation": "How do you observe the eyelashes of the Tathāgata's eye?",
        "source": "T15n0643_002:0656a05_0"
    },
    {
        "source_sentence": "如來眼睫上下各生有五百毛，柔軟可愛如優曇華鬚，於其毛端流出一光，",
        "translation": "The eyelashes of the Buddha’s eyes each grow five hundred hairs at the top and bottom of each eyelash, as soft and lovely as the grace of a stream-winner’s beard. A ray of light emanates from the ends of these hairs.",
        "source": "T15n0643_002:0656a05_1"
    },
    {
        "source_sentence": "如頗梨色入前眾相，光明色中遶頭一匝，從枕骨生圍遶前光，純生微妙諸青蓮華，",
        "translation": "It is as if the color of a crystal entered into all the characteristics that precede it. The light emanating from the crystal form circumambulated the hair around its base one time, producing an encircling radiance produced from the bone on the top of the cushion. Pure and subtle blue lotus blossoms emerged.",
        "source": "T15n0643_002:0656a07_2"
    },
    {
        "source_sentence": "蓮華臺上有青色蓋，有梵天王手執是蓋。",
        "translation": "On the lotus dais there was a blue-colored canopy, which was held by Brahmadeva in his hand.",
        "source": "T15n0643_002:0656a09_3"
    },
    {
        "source_sentence": "此相現時佛眼青白，白者過於白寶百億萬倍；",
        "translation": "These marks show that the Buddha’s eyes are blue and white, while the white one is ten billion times greater than the white jewel.",
        "source": "T15n0643_002:0656a10_4"
    },
    {
        "source_sentence": "青者勝青蓮華及紺琉璃百億萬倍。",
        "translation": "The blue is a hundred million times greater than the blue lotus and the violet lapis lazuli.",
        "source": "T15n0643_002:0656a11_5"
    },
    {
        "source_sentence": "上下俱眴如牛王眼，眼雙眥頭旋出二光，如青蓮華極為微細，遶髮一匝從枕骨出，",
        "translation": "The upper and lower corners are like the eyes of an ox king, with two rays of light emanating from the top of each eye, like blue lotus blossom that is extremely subtle, circling one round and emerging from a pillow bone.",
        "source": "T15n0643_002:0656a12_6"
    },
    {
        "source_sentence": "映飾諸華令華開敷，光明益顯，如是勝相無量功德，名如來眼。",
        "translation": "It reflects the flowers and causes them to bloom, and its radiance increases. Such superior characteristics and immeasurable virtues are called the Tathāgata's eye.",
        "source": "T15n0643_002:0656a14_0"
    },
    {
        "source_sentence": "「若有欲觀如來眼者，當作此觀，作此觀者減損諸惡。",
        "translation": "“If someone wants to contemplate the Tathāgata’s eye, they should do so. Those who contemplate thus will decrease evil.",
        "source": "T15n0643_002:0656a15_1"
    },
    {
        "source_sentence": "閉目端坐正觀佛眼，一日至七日，於未來世常得見佛，終不盲冥，亦不生於邊地邪見無佛法處，",
        "translation": "For one day and seven days they will always be able to see the Buddha in the future. They will never be blind or ignorant, nor will they give rise to a false view that there is no buddha-dharma on the peripheral plains.",
        "source": "T15n0643_002:0656a16_2"
    },
    {
        "source_sentence": "慧眼恒開不生愚癡。」",
        "translation": "The eye of wisdom always opens and doesn't give rise to folly.",
        "source": "T15n0643_002:0656a18_3"
    },
    {
        "source_sentence": "佛告父王：「是故智者為除盲冥，當觀佛眼。",
        "translation": "The Buddha told his father, That's why the wise man will observe the Buddha's eye in order to remove blindness and darkness.",
        "source": "T15n0643_002:0656a19_4"
    },
    {
        "source_sentence": "佛有五眼，此觀法中先說肉眼。",
        "translation": "The Buddha has five eyes:",
        "source": "T15n0643_002:0656a20_5"
    },
    {
        "source_sentence": "明淨光現觀眼心利，傍生境界不可具說，諦觀佛眼於少時間及觀像眼，",
        "translation": "It clarifies that pure light manifests to observe the eye, mind and benefit of the eye. The realm of the unenlightened cannot be described in detail.",
        "source": "T15n0643_002:0656a21_0"
    },
    {
        "source_sentence": "未來世中經五生處，眼常明淨眼根無病，除却七劫生死之罪。」",
        "translation": "In the five places where he'll pass through birth in the future, his eyes will always be clear and pure, and his eye faculty won't suffer from illness, removing the sins of seven eons of birth-and-death.",
        "source": "T15n0643_002:0656a22_1"
    },
    {
        "source_sentence": "佛告阿難勅諸四眾：「勤觀佛眼慎勿休廢，觀佛眼者必獲無量微妙功德。",
        "translation": "The Buddha told Ānanda to the four groups of people, diligently observe the Buddha's eye and be careful not to stop it; those who observe the Buddha's eye will surely attain measureless subtle merit.",
        "source": "T15n0643_002:0656a24_2"
    },
    {
        "source_sentence": "髮際額廣及髮蠡文，眼眶眼眉，眼睫眼畫，如是等眾相光明，若能暫見，",
        "translation": "Their foreheads are broad and wide, their eyebrows are pointed out, their eyebrows are pointed out, and their eyes are painted with eyelashes. If they can see anything like this for a moment,",
        "source": "T15n0643_002:0656a25_3"
    },
    {
        "source_sentence": "除六十劫生死之罪。",
        "translation": "He'll be freed from the sin of birth-and-death for 60 eons.",
        "source": "T15n0643_002:0656a27_4"
    },
    {
        "source_sentence": "未來生處必見彌勒，賢劫千佛威光所護，心如蓮華而無所著，終不墮於三塗八難。",
        "translation": "In the future, where he'll be born, he'll surely see Maitreya, protected by the authoritative radiance of a thousand buddhas of the good eon, his mind like a lotus flower without attachment, and he'll never fall into the three destinies or eight difficulties.",
        "source": "T15n0643_002:0656a28_0"
    },
    {
        "source_sentence": "若坐不見當入塔觀，入塔觀時，亦當作此諸光明想，至心合掌[跍*月]跪諦觀，",
        "translation": "If he doesn’t see it while sitting, he’ll enter a stūpa to contemplate it; and when he enters a stūpa to contemplate it, he’ll also think of these lights as knelt with his palms joined [in respect].",
        "source": "T15n0643_002:0656a29_1"
    },
    {
        "source_sentence": "一日至三日心不錯亂，命終之後生兜率天，面見彌勒菩薩色身端嚴，應感化導，",
        "translation": "For one day or three days his mind was not disturbed, and he was born in Tuṣita Heaven after his life ended. He saw Maitreya Bodhisattva face to face with a dignified form and body that should be used for spiritual guidance.",
        "source": "T15n0643_002:0656b02_2"
    },
    {
        "source_sentence": "既得見已身心歡喜入正法位。」",
        "translation": "Having seen it, he rejoices in body and mind and enters the stage of the right teaching.",
        "source": "T15n0643_002:0656b04_3"
    },
    {
        "source_sentence": "佛告父王：「如是觀者名為正觀，若異觀者名為邪觀。」",
        "translation": "The Buddha told his father, Such a contemplation is called right contemplation, and if it's different from the contemplation, it's called wrong contemplation.",
        "source": "T15n0643_002:0656b05_4"
    },
    {
        "source_sentence": "佛說觀佛三昧海經卷第二",
        "translation": "Foshuo guanfo sanmei hai jing, vol. 2",
        "source": "T15n0643_002:0656b07_0"
    }
]