[
    {
        "source_sentence": "佛說成具光明定意經",
        "translation": "Foshuo xingfu guangmingming zhenyi jing",
        "source": "T15n0630_001:0451b03_0"
    },
    {
        "source_sentence": "後漢天竺三藏支曜譯",
        "translation": "Latter Han translation of the Tripiṭaka of Tianzhus, translated by Zhi Yao",
        "source": "T15n0630_001:0451b05_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在迦維羅衛國精舍中止。",
        "translation": "Thus I have heard: One time, the Buddha was staying at a monastery in Kapilavastu.",
        "source": "T15n0630_001:0451b06_0"
    },
    {
        "source_sentence": "晨朝整服，呼語阿難：「汝請諸明士、除惡眾及無著、履跡等來，今日當有上問異要。」",
        "translation": "In the morning, he dressed himself in a proper way and called to Ānanda, You've invited the wise men, the remorseless people, the nonattachments, the footprints, and so forth to come here; today, there will be an extraordinary question.",
        "source": "T15n0630_001:0451b06_1"
    },
    {
        "source_sentence": "於是阿難受勅，應時遍宣如來教於四輩人。",
        "translation": "Ānanda then accepted the command, and accordingly pervasively proclaimed the Tathāgata's teaching to the four groups of people.",
        "source": "T15n0630_001:0451b08_2"
    },
    {
        "source_sentence": "時，有除惡、無著、履跡眾凡五千萬人，詣如來所，稽首于地，畢而避住。",
        "translation": "At that time fifty thousand people, free from evil, free from attachment, and following the same footsteps as the Buddha, came to the place where the Tathāgata was. They bowed their heads at the ground and withdrew in fear.",
        "source": "T15n0630_001:0451b09_3"
    },
    {
        "source_sentence": "復有賢女、棄惡眾及國中凡女人隨諸賢女人，十四萬眾，詣如來所，稽首于地，",
        "translation": "Again, some of the wise women, those who had abandoned evil and all the ordinary women of the country, accompanied by other wise women, came to the place where the Tathāgata was. They bowed their heads at the ground in four hundred and forty thousand congregations.",
        "source": "T15n0630_001:0451b11_4"
    },
    {
        "source_sentence": "退座而坐。",
        "translation": "He withdrew from his seat and sat down.",
        "source": "T15n0630_001:0451b13_0"
    },
    {
        "source_sentence": "復有明士八十億萬二千人，詣如來所，稽首于地，儼然恭住。",
        "translation": "Again, there were eighty koṭis of mystic scholars, twelve thousand in number, who came to the place where the Buddha was. They bowed their heads at the ground and remained there respectfully.",
        "source": "T15n0630_001:0451b13_1"
    },
    {
        "source_sentence": "復有文士、居家修戒者，四萬人，相隨來至，稽首于地，畢各却住。",
        "translation": "Again, there were 40,000 brahmans and householders who practiced the precepts, all of whom came with them. After bowing their heads at the ground, they each withdrew and stayed away.",
        "source": "T15n0630_001:0451b14_2"
    },
    {
        "source_sentence": "佛以威神感動十方諸佛國明士及上諸天，應當成者及當發者，凡八百億萬人，",
        "translation": "The Buddha moved the wise men and gods of the buddha-lands in the ten directions, as well as the higher gods, with his mighty power. Those who were to become buddhas and those who would give rise to them amounted to eight billion myriads of people.",
        "source": "T15n0630_001:0451b16_0"
    },
    {
        "source_sentence": "皆飛來至佛所，稽首于地，列住空中。",
        "translation": "They all flew to the Buddha, bowed their heads at the ground, and stood in the air in rows.",
        "source": "T15n0630_001:0451b17_1"
    },
    {
        "source_sentence": "復有十二天神、將軍，將諸官屬四十萬人，來詣佛所，稽首于地，畢，",
        "translation": "Twelve other heavenly deities and generals, together with some four million officials, came to the place where the Buddha was. They bowed their heads at the ground and departed.",
        "source": "T15n0630_001:0451b18_2"
    },
    {
        "source_sentence": "各分部住佛左右立侍。",
        "translation": "Each part of the assembly was standing at the Buddha's left and right, with attendants standing beside him.",
        "source": "T15n0630_001:0451b20_3"
    },
    {
        "source_sentence": "所當是日，會時，如一食頃，悉至佛所，佛即令坐。",
        "translation": "On that day, at the time of the assembly, it was as if they had all arrived at the Buddha’s place during the course of one meal. The Buddha immediately asked them to take their seats.",
        "source": "T15n0630_001:0451b20_4"
    },
    {
        "source_sentence": "其有肉體未得四神足者，應皆就榻；",
        "translation": "Those with physical bodies who have not yet attained the four supernormal powers should all be seated on a couch.",
        "source": "T15n0630_001:0451b21_5"
    },
    {
        "source_sentence": "十方諸來明士及諸天神身輕，或已得神足者，皆踊在空中坐自然座，各各有化花蓋，",
        "translation": "The sages and gods of the ten directions, some with light divine bodies but some already endowed with supernormal powers, all emerged from their seats in midair to take their natural thrones. Each had a magical canopy over it.",
        "source": "T15n0630_001:0451b22_6"
    },
    {
        "source_sentence": "行列奇好，皆佛威變之所興化也。",
        "translation": "The procession was marvelously beautiful, all produced and transformed by the Buddha’s authoritative power.",
        "source": "T15n0630_001:0451b24_7"
    },
    {
        "source_sentence": "諸來明士、在會坐者，率皆妙行、心清口淨、身服眾戒，三穢、六患、五蔽已索，",
        "translation": "The wise men who had come and sat in the assembly were all engaged in marvelous practices, purified their minds, mouthed purely, observed the precepts on body and speech, and sought after the three defilements, the six afflictions, and the five obstructions.",
        "source": "T15n0630_001:0451b25_8"
    },
    {
        "source_sentence": "眾煩熱惱、雜垢沃若、疑網閉結、倒見之謬、不知之本、十二牽連，皆已絕棄。",
        "translation": "The various afflictions, feverishness, defilement, and prosperity, the web of doubt, the errors of mistaken views, the source of ignorance, and the twelve links of attachment have all been abandoned.",
        "source": "T15n0630_001:0451b26_9"
    },
    {
        "source_sentence": "淨如月花，各隨世習俗，依行立字。",
        "translation": "They are as pure as the moon flowers, each following worldly customs and established words according to their practice.",
        "source": "T15n0630_001:0451b28_10"
    },
    {
        "source_sentence": "有明士名無穢王、次復名光景尊、次復名智如山弘、次復名大花淨、次復名轉根香、次復名月精曜、次復名光之英、次復名整不法、次復名善中善、次復名崑崙光、次復名日光精、次復名師子威、次復名意雜寶、次復名炎熾妙、次復名德普洽、次復名普調敏、次復名敬端行、次復名慈仁署、次復名慧作、次復名散結、次復名嚴儀具足、次復名高遠行、次復名光德王、次復名護世、次復名導世、次復名大力、次復名正淨、次復名天師、次復名善觀、次復名觀音，",
        "translation": "有明士名無穢王、次復名光景尊、次復名智如山弘、次復名大花淨、次復名大花淨、次復名轉根香、次復名月精曜、次復名光之英、次復名整不法、次復名善中善、次復名善、次復名 Kunlun光、次復",
        "source": "T15n0630_001:0451c01_0"
    },
    {
        "source_sentence": "如是眾名，各各別異。",
        "translation": "Each of these names is different.",
        "source": "T15n0630_001:0451c11_1"
    },
    {
        "source_sentence": "於時，有貴姓子，名曰善明，從同輩五百，人人各有侍者，執蓋相隨，",
        "translation": "At the time, there was a noble man named Sunetra, five hundred men of equal rank, each with an attendant, carrying a canopy and following him.",
        "source": "T15n0630_001:0451c12_0"
    },
    {
        "source_sentence": "來詣佛所，稽首如來足下，起住觀眾，四面甚盛，仰視空中，率皆上人，",
        "translation": "They came to the Buddha, bowed their heads at his feet, and greeted him. The assembled bhikṣus stood upright in great numbers on all four sides, looked up into the sky, and saw that they were all superior beings.",
        "source": "T15n0630_001:0451c13_1"
    },
    {
        "source_sentence": "天尊在座，端嚴直立，興心念言：「今日大福，遇此眾會，欲設飲食，",
        "translation": "While the gods were seated, they stood correctly and upright. They thought to themselves, “Today it is a great blessing that we have met this assembly of monks who wish to offer food and drink for the sake of enlightenment.",
        "source": "T15n0630_001:0451c15_0"
    },
    {
        "source_sentence": "以供一日。",
        "translation": "It's to make an offering for one day.",
        "source": "T15n0630_001:0451c16_1"
    },
    {
        "source_sentence": "計身所有，不能供辦，施不等接，則非施也，我將如何？」",
        "translation": "What's included in the body that can't be provided, and what's given is not equally received, so it's not given; what will I do?",
        "source": "T15n0630_001:0451c16_2"
    },
    {
        "source_sentence": "於是佛知善明所念，則勞之曰：「少年善來！",
        "translation": "Knowing what Shanming had thought, the Buddha then asked him, Young man, good friend!",
        "source": "T15n0630_001:0451c17_3"
    },
    {
        "source_sentence": "寧聞法勸之說乎？」",
        "translation": "How could you hear the teaching and encourage it?",
        "source": "T15n0630_001:0451c18_4"
    },
    {
        "source_sentence": "曰：「未達也，起時則起，可謂智矣。",
        "translation": "He said, “We have not yet mastered it. When we give rise to it, we give rise to it. It can be called wisdom.",
        "source": "T15n0630_001:0451c19_5"
    },
    {
        "source_sentence": "不計少多，有所希望，可謂施矣。",
        "translation": "Giving without counting the small and the great can be called giving when there is something to hope for.",
        "source": "T15n0630_001:0451c19_6"
    },
    {
        "source_sentence": "向所念者，如來在此，何患不辦？",
        "translation": "Whatever was thought of before, the Tathāgata is here, so why wouldn't he do it?",
        "source": "T15n0630_001:0451c20_7"
    },
    {
        "source_sentence": "如來能使不辦者辦，不足者足，一切常足，所作常辦，是謂如來。",
        "translation": "The Tathāgata is able to enable those who are unable to do so to do so and those who are not capable of doing so to become fully endowed with what they lack. All [the buddhas] are always endowed with what they lack, and whatever they do is always endowed with what they can do. This is called the Tathāgata.",
        "source": "T15n0630_001:0451c21_8"
    },
    {
        "source_sentence": "如來辦者，不用衣、食、欲樂之物，乃以具戒，不聽六患、五蔽之惑，",
        "translation": "The Tathāgata who prepares the food doesn't use clothing, food, or things of desire and pleasure, so he fulfills the precepts and doesn't listen to the six afflictions or the five obstructive mental disturbances.",
        "source": "T15n0630_001:0451c22_9"
    },
    {
        "source_sentence": "不惟家樂，不有四食之想，亦無衣容冠幘之飾。",
        "translation": "They don't only think of home and happiness, they don't have the idea of the four foods, and they don't decorate themselves with robes, features, crowns, or ornaments.",
        "source": "T15n0630_001:0451c24_10"
    },
    {
        "source_sentence": "處計常之中，而知無常之諦；",
        "translation": "They abide in the ideation of permanence yet they know the truth of impermanence.",
        "source": "T15n0630_001:0451c25_11"
    },
    {
        "source_sentence": "居惑樂之地，則覺必苦之對。",
        "translation": "When they live in the land of delusion and pleasure, then they'll realize that it must be painful to confront them.",
        "source": "T15n0630_001:0451c25_12"
    },
    {
        "source_sentence": "貪有之室，照空無之本；",
        "translation": "The abode of craving for existence is the root of illumination of emptiness and nonexistence.",
        "source": "T15n0630_001:0451c26_13"
    },
    {
        "source_sentence": "於受有之體，明非身之真。",
        "translation": "Regarding the essence of sensation as existence, it's clear that it's not the true body.",
        "source": "T15n0630_001:0451c27_0"
    },
    {
        "source_sentence": "無我、無作、無緣、無著，斯如來之辦也。」",
        "translation": "The absence of self, the absence of action, the absence of conditions, and the absence of attachment are the accomplishments of the Tathāgata.",
        "source": "T15n0630_001:0451c27_1"
    },
    {
        "source_sentence": "於是，善明聞天尊說，心悅結解，身輕踊躍，曰：「我本無黠，連縛十二，",
        "translation": "Then Sudarśana heard the teaching of the deva-honored one, and his mind was filled with joy. He jumped up and down in disdain and said, “I am not clever at all; I am bound by twelve fetters.",
        "source": "T15n0630_001:0451c28_2"
    },
    {
        "source_sentence": "心起就冥，墮俗三流，今日所聞，未曾有法，願身受持，如天尊教，咸樂妙法。」",
        "translation": "My mind arises and goes into the darkness, falling into the three mundane streams, and today I've heard unprecedented teachings that I wish to receive and uphold in my body, just as the Bhagavān teaches, delighting in the marvelous teaching.",
        "source": "T15n0630_001:0451c29_3"
    },
    {
        "source_sentence": "「天人之尊，　　如來為上；　　慈哀勸救，",
        "translation": "Venerable among gods and humans, the Tathāgata is the best; compassionately encouraging and rescuing,",
        "source": "T15n0630_001:0452a02_4"
    },
    {
        "source_sentence": "　等施三界。　　劣漏貧行，　　攝以法財；",
        "translation": "Equanimous giving is given to the three realms; lowly and impure poor practices are collected with the wealth of the doctrine.",
        "source": "T15n0630_001:0452a02_4"
    },
    {
        "source_sentence": "　令一切惑，　　解釋無疑。　　身尊具貴，",
        "translation": "He causes all the afflictions to be expounded without doubt, and his body is honored as a treasure.",
        "source": "T15n0630_001:0452a02_4"
    },
    {
        "source_sentence": "　相好無雙；　　出意為人，　　演法無窮。",
        "translation": "Their marks and embellishments are unparalleled, their outward appearance is human, and they teach the Dharma without limit.",
        "source": "T15n0630_001:0452a02_4"
    },
    {
        "source_sentence": "　叡慧眾流，　　注如山洋；　　法澤三界，",
        "translation": "The rivers of knowledge and wisdom flow like the ocean of mountains, And the waters of the Teaching fill the three realms.",
        "source": "T15n0630_001:0452a02_4"
    },
    {
        "source_sentence": "　流衍十方。　　大人相滿，　　寶慧具足；",
        "translation": "They flow in the ten directions, Filled with great beings, Endowed with knowledge and jewels.",
        "source": "T15n0630_001:0452a02_4"
    },
    {
        "source_sentence": "　在在現法，　　將導不逮。　　慧照愚冥，",
        "translation": "In the present life, they will not be able to guide. Wisdom illuminates the darkness of ignorance,",
        "source": "T15n0630_001:0452a02_4"
    },
    {
        "source_sentence": "　牽致淨處；　　願身自歸，　　得到彼岸。」",
        "translation": "They lead to a pure place; may their bodies return on their own and reach the other shore.",
        "source": "T15n0630_001:0452a02_4"
    },
    {
        "source_sentence": "因而歎曰：於是，善明歎畢，更前長跪啟天尊曰：「願卒本意，今日設饌，",
        "translation": "So he praised him, saying, “Dear goddess, this is my original intention. Today I wish to prepare a delicious meal for you.” Then the king knelt down and said:",
        "source": "T15n0630_001:0452a02_4"
    },
    {
        "source_sentence": "唯乞加哀，抂屈臨眄。」",
        "translation": "I simply beg for your compassion and bow my head in respect.",
        "source": "T15n0630_001:0452a12_5"
    },
    {
        "source_sentence": "天尊默然，自如常法；",
        "translation": "The celestial being remained silent, following the usual practice.",
        "source": "T15n0630_001:0452a12_6"
    },
    {
        "source_sentence": "善明恭立，謂未見聽。",
        "translation": "Good understanding and respectful establishment are those who haven't seen or heard.",
        "source": "T15n0630_001:0452a13_7"
    },
    {
        "source_sentence": "於是阿難開語之曰：「天尊默然，為己相許。」",
        "translation": "Ānanda then spoke to him, saying, The Bhagavān is silent and allows you to do so for yourself.",
        "source": "T15n0630_001:0452a13_8"
    },
    {
        "source_sentence": "善明聞之心則逸豫，稽首而出，住於門外，遣人入白言：「今自計所有，",
        "translation": "Shanming listened attentively, but his mind was distracted. He bowed his head in respect and went out of the door.",
        "source": "T15n0630_001:0452a14_9"
    },
    {
        "source_sentence": "可供二千人飯，願啟天尊，令知如此。」",
        "translation": "I'll give food for 2,000 people to eat, and may the Bhagavān know this.",
        "source": "T15n0630_001:0452a16_10"
    },
    {
        "source_sentence": "阿難即白佛，具宣善明所言。",
        "translation": "Ānanda then addressed the Buddha and explained what Shanming had said.",
        "source": "T15n0630_001:0452a17_11"
    },
    {
        "source_sentence": "佛告阿難：「汝語善明，使還供設，盡汝所有，佛當與大眾一切皆往，",
        "translation": "The Buddha said to Ānanda: You should tell me, Sunetra, “May I return and make offerings to all of your property. Whatever belongs to you, the Buddha and the members of the sangha may also go there.",
        "source": "T15n0630_001:0452a17_12"
    },
    {
        "source_sentence": "勿嫌不辦。」",
        "translation": "Don't be disgusted by not being able to do so.",
        "source": "T15n0630_001:0452a19_13"
    },
    {
        "source_sentence": "阿難即出，具語善明，如佛教言。",
        "translation": "Ānanda then came out and explained it well, just as the Buddha said in the Buddhist teachings.",
        "source": "T15n0630_001:0452a19_14"
    },
    {
        "source_sentence": "阿難又曰：「賢者便還，莫起二意，畏有不足；",
        "translation": "Ānanda again said: Good man, go home. Don’t have dualistic thoughts; you should be afraid there won’t be enough.",
        "source": "T15n0630_001:0452a20_15"
    },
    {
        "source_sentence": "佛神所至，無有不具。」",
        "translation": "There's nothing that the Buddha and his spirit don't possess.",
        "source": "T15n0630_001:0452a21_16"
    },
    {
        "source_sentence": "善明即前禮阿難而還。",
        "translation": "Shanming then bowed to Ānanda and returned.",
        "source": "T15n0630_001:0452a21_17"
    },
    {
        "source_sentence": "還舍，勅其妻子室內大小言：「今所請者號曰天尊。",
        "translation": "When he returned home, he instructed his wife and children inside the room to say, What's invited now is called the Bhagavān.",
        "source": "T15n0630_001:0452a22_18"
    },
    {
        "source_sentence": "神妙通達，為一切智。",
        "translation": "Their supernormally marvelous penetration is omniscience.",
        "source": "T15n0630_001:0452a23_19"
    },
    {
        "source_sentence": "其以一物，施是人者，世世受福，而無窮極。",
        "translation": "If someone gives a single thing to this person, they'll receive merit from generation to generation without limit.",
        "source": "T15n0630_001:0452a23_20"
    },
    {
        "source_sentence": "又能度人，解於索結。",
        "translation": "He's also able to save people who understand the bond of craving.",
        "source": "T15n0630_001:0452a24_21"
    },
    {
        "source_sentence": "汝等恭肅，淨施飯食，具設眾味，當令絕美。」",
        "translation": "You must be respectful and pure, offer food and drink, set up various flavors, and make sure they're never delicious.",
        "source": "T15n0630_001:0452a25_22"
    },
    {
        "source_sentence": "眷屬從使，各盡心極意：「天尊難遇，億劫時有，其所當為，善令清淨。」",
        "translation": "Each of his retinues and envoys were all mindful, saying, Bhagavān, it's difficult to meet the gods; there are billions of eons when they exist, and what they should do is to skillfully purify them.",
        "source": "T15n0630_001:0452a26_23"
    },
    {
        "source_sentence": "於時，座中有明士，名力辦眾有。",
        "translation": "At the time, there was a wise person in his seat named Powerful Arrogant of All Beings.",
        "source": "T15n0630_001:0452a27_24"
    },
    {
        "source_sentence": "佛告令行，共佐善明，供此大眾。",
        "translation": "The Buddha told them to do so, and they all assisted Shanming in making offerings to the crowd.",
        "source": "T15n0630_001:0452a28_25"
    },
    {
        "source_sentence": "於時，十二天神王，及四天王、大勢龍王，承佛告教，皆從力辦眾有明士，",
        "translation": "At that time the twelve guardian gods of heaven and the four guardian gods of earth, as well as the great dragon king Mahāsthāmaprāpta, who had received the Buddha’s instruction, prepared the assembly of śramaṇas and brāhmaṇas by their power.",
        "source": "T15n0630_001:0452a28_26"
    },
    {
        "source_sentence": "往而佐之。",
        "translation": "He went and assisted him.",
        "source": "T15n0630_001:0452b01_27"
    },
    {
        "source_sentence": "到則勞倈語善明曰：「賢者勤心，佛使我等，來相營助。」",
        "translation": "When he arrived, he spoke to Shanming in a painful voice, saying, Good man, you're diligent, the Buddha sent us here to help you.",
        "source": "T15n0630_001:0452b01_28"
    },
    {
        "source_sentence": "善明則前禮明士，及諸天王，敬意辭謝言：「勞屈上人，今已辦二千人具，",
        "translation": "Sunetra then went on to pay homage to the brāhmaṇa and the other heavenly kings, respectfully apologized, and said, “It is a great pity that you have already provided provisions for two thousand men.",
        "source": "T15n0630_001:0452b02_29"
    },
    {
        "source_sentence": "大眾當來，懼是小舍，其將奈何？」",
        "translation": "When the masses come, they're afraid it's a small dwelling; what will be its general?",
        "source": "T15n0630_001:0452b04_30"
    },
    {
        "source_sentence": "於是，力辦眾有明士及諸天神王答言：「莫憂。」",
        "translation": "Thereupon, the wise men and gods answered, Don't worry.",
        "source": "T15n0630_001:0452b05_31"
    },
    {
        "source_sentence": "因各左右顧視，屋室自然長廣高大，像天之殿。",
        "translation": "Each of them looked around to his left and right. The houses were naturally long, wide, and tall, resembling the palace of the gods.",
        "source": "T15n0630_001:0452b06_32"
    },
    {
        "source_sentence": "於屋下，便有千億萬座，皆是眾寶變地之形，紺瑠璃色。",
        "translation": "At the foot of the tower there were a thousand billion seats, all shaped like the earth transformed by myriad jewels, blue and lapis lazuli in color.",
        "source": "T15n0630_001:0452b07_33"
    },
    {
        "source_sentence": "室中床座，亦復如是。",
        "translation": "So it is with the beds and seats in the room.",
        "source": "T15n0630_001:0452b08_34"
    },
    {
        "source_sentence": "如彈指頃，即有百千億萬人飯具，而皆足畢。",
        "translation": "It's like when you snap your fingers, there are hundreds of thousands of billions of food preparations, and they all have their feet.",
        "source": "T15n0630_001:0452b09_35"
    },
    {
        "source_sentence": "燒眾名香，懸諸繒幡，其所行道，即便廣平。",
        "translation": "They burned incense and hung silken banners. The path they traveled on the road became even more wide and peaceful.",
        "source": "T15n0630_001:0452b10_36"
    },
    {
        "source_sentence": "色如水精，樹木行伍，自然音樂，雅聲相和甚悲，說法之音，釋梵八種。",
        "translation": "Its color was like water spirit, and its trees and forests were naturally musical. Their graceful sounds harmonized with great compassion. The sound of the Dharma preached by the Buddha was of eight kinds:",
        "source": "T15n0630_001:0452b11_0"
    },
    {
        "source_sentence": "於時，力辦眾有明士、諸天神王，即還佛所。",
        "translation": "At that point, the wise men and gods of great strength gathered together and returned to the Buddha's place.",
        "source": "T15n0630_001:0452b12_1"
    },
    {
        "source_sentence": "善明見此大變，驚喜踊躍，來詣天尊，白言：「受佛大慈，所設已具。",
        "translation": "Seeing this great transformation, Sunetra was delighted and jumped for joy. He came to the heavenly gods and said, “I have already accepted the Buddha’s great compassion.",
        "source": "T15n0630_001:0452b13_2"
    },
    {
        "source_sentence": "唯願舉眾，抂屈尊神。」",
        "translation": "I only wish to lift up the congregation and humble the venerable spirit.",
        "source": "T15n0630_001:0452b14_3"
    },
    {
        "source_sentence": "佛即令無穢王明士等六百萬人，在於前導，或行虛空。",
        "translation": "The Buddha then caused six million people, such as the undefiled king of wise men, to guide them before him, or they might go into space.",
        "source": "T15n0630_001:0452b15_4"
    },
    {
        "source_sentence": "佛處中央，其餘從後。",
        "translation": "The Buddha is in the center, while the rest follow behind him.",
        "source": "T15n0630_001:0452b16_5"
    },
    {
        "source_sentence": "如來出門，地則肅震，諸天散花，燒眾名香，乃作上樂，歌頌而從。",
        "translation": "When the Tathāgata emerged from the stupa the earth shook solemnly. The heavenly gods scattered flowers and burned various kinds of famous incense. Then they composed music and sang hymns of praise to accompany him.",
        "source": "T15n0630_001:0452b17_6"
    },
    {
        "source_sentence": "到皆就座，諸天神王即助施飯，佛口呪願，食已飽足，飯不消[歹*斯]，",
        "translation": "When they had all taken their seats, the celestial deities and kings assisted them in giving food. The Buddha uttered this dhāraṇī:",
        "source": "T15n0630_001:0452b18_7"
    },
    {
        "source_sentence": "眾器飯具，滿則如故。",
        "translation": "The food preparations and utensils for the assembly were as usual.",
        "source": "T15n0630_001:0452b20_0"
    },
    {
        "source_sentence": "善明心獨而言：「天尊威變，弘廣乃爾，食訖行盥，當問此意。」",
        "translation": "Sunetra said alone, The Bhagavān's authoritative transformation is so vast that when he finishes his meal and goes to wash, he should ask this question.",
        "source": "T15n0630_001:0452b20_1"
    },
    {
        "source_sentence": "水盥已畢，如伸臂頃，佛與大眾，恍惚而還，在精舍坐。",
        "translation": "After he had finished washing his body with water, as if extending his arm, the Buddha and the assembly of monks returned in distraction, sitting in the monastery.",
        "source": "T15n0630_001:0452b21_2"
    },
    {
        "source_sentence": "「天尊實神妙，　　世所希見聞；",
        "translation": "The Bhagavat is truly marvelous and wonderful, What the world desires to see and hear.",
        "source": "T15n0630_001:0452b23_3"
    },
    {
        "source_sentence": "　變改卓犖異，　　覩者莫不欣。",
        "translation": "Their transformations are distinguished and different, and those who see them all rejoice.",
        "source": "T15n0630_001:0452b23_3"
    },
    {
        "source_sentence": "　諦觀甚奇雅，　　現變難等雙；",
        "translation": "The contemplation of truth is most marvelous and elegant, Equal in appearance to the difficulty of manifesting it.",
        "source": "T15n0630_001:0452b23_3"
    },
    {
        "source_sentence": "　不作而自具，　　不勞飽滿眾。",
        "translation": "They don't make their own provisions, and they don't bother to satisfy the crowd.",
        "source": "T15n0630_001:0452b23_3"
    },
    {
        "source_sentence": "　不語自然使，　　不教令自行；",
        "translation": "They don’t talk about spontaneous messengers, And they don’t teach or cause others to do so.",
        "source": "T15n0630_001:0452b23_3"
    },
    {
        "source_sentence": "　不為而遇為，　　是德以何將。",
        "translation": "What's the general of virtue that meets what's done when it's not done?",
        "source": "T15n0630_001:0452b23_3"
    },
    {
        "source_sentence": "　本行何術法，　　生而有此榮？",
        "translation": "What's the skillful method of original practice that produces this kind of prosperity?",
        "source": "T15n0630_001:0452b23_3"
    },
    {
        "source_sentence": "　積何德之本，　　致斯巍巍尊？",
        "translation": "What root of virtue does he accumulate that makes him so lofty and venerable?",
        "source": "T15n0630_001:0452b23_3"
    },
    {
        "source_sentence": "　願哀貧道者，　　開饒以法財；",
        "translation": "May the poor of the Way be pityed And enriched with the riches of the Teaching.",
        "source": "T15n0630_001:0452b23_3"
    },
    {
        "source_sentence": "　決心之結網，　　放令無餘疑。」",
        "translation": "The fetters of the determination for enlightenment are freed so that there's no remaining doubt.",
        "source": "T15n0630_001:0452b23_3"
    },
    {
        "source_sentence": "於是善明，因復歎曰：善明歎已，更避坐叉手啟言：「我所居止，去是不遠，",
        "translation": "Then Sudarśana again praised him, saying: Having been thus praised, Sudarśana withdrew from his seat. He saluted Śāriputra by placing his palms together [in respect] and said: The place where I live is not far from you.",
        "source": "T15n0630_001:0452b23_3"
    },
    {
        "source_sentence": "聚名福安。",
        "translation": "The lump is called Fuan.",
        "source": "T15n0630_001:0452c06_4"
    },
    {
        "source_sentence": "佛向所哀顧處是也。",
        "translation": "This is the place where the Buddha looked out for him.",
        "source": "T15n0630_001:0452c06_5"
    },
    {
        "source_sentence": "我在其聚，常好學問，學世威儀古王之制，及學神仙聖人之法。",
        "translation": "I belonged to the assembly and always enjoyed learning. I studied the ways of the ancient kings, as well as the teachings of sages and saints.",
        "source": "T15n0630_001:0452c06_6"
    },
    {
        "source_sentence": "始聞天尊，近在此國，興意想像，夢輒髣髴。",
        "translation": "When I first heard that the Venerable god was coming to this country, my mind aroused to think of him in a dream and I saw him.",
        "source": "T15n0630_001:0452c08_7"
    },
    {
        "source_sentence": "天尊弟子名舍利弗，常到我舍，為我說法。",
        "translation": "The Bhagavān's disciple named Śāriputra always came to my house and taught me the Dharma.",
        "source": "T15n0630_001:0452c09_8"
    },
    {
        "source_sentence": "法甚深妙，我所希聞，心雖欣歎，猶懷瞢瞢。",
        "translation": "The Dharma is so profound and subtle that I wish to hear it. Although I am delighted with admiration, I still harbor feelings of sadness in my heart.",
        "source": "T15n0630_001:0452c10_9"
    },
    {
        "source_sentence": "今日輕來，禮佛天尊，并觀道法，所當則行，至見心悅，如冥覩光。",
        "translation": "Today I humbly come to pay homage to the Buddha, the deva-honored one, and also contemplate the path of enlightenment. Wherever he should practice it, his mind is filled with joy when he sees it, just like a mysterious ray of light.",
        "source": "T15n0630_001:0452c11_10"
    },
    {
        "source_sentence": "意欲設飯，因獲異問，所有劣少，未敢發言。",
        "translation": "Wishing to set up a meal, they asked different questions and had few of them, so they didn't dare to speak.",
        "source": "T15n0630_001:0452c12_11"
    },
    {
        "source_sentence": "天尊神通，迎知我心，道力助我，床座食饌，忽然而辦，食畢器具，滿則如故。",
        "translation": "The deva-honored one with supernatural powers greeted me and knew my mind. By the power of his path he assisted me. My food and drink were prepared in an instant, and when I had finished eating, the dishes were filled as before.",
        "source": "T15n0630_001:0452c13_12"
    },
    {
        "source_sentence": "此何變化？",
        "translation": "What is this transformation?",
        "source": "T15n0630_001:0452c15_13"
    },
    {
        "source_sentence": "神妙乃爾！",
        "translation": "That's the marvelous thing!",
        "source": "T15n0630_001:0452c15_14"
    },
    {
        "source_sentence": "「又觀天尊，三十二相，相相有好，視之無厭。",
        "translation": "“Furthermore, venerable goddess, observe the thirty-two distinctive characteristics of the Bhagavān. They are all beautiful and pleasing to be seen without tire.",
        "source": "T15n0630_001:0452c15_15"
    },
    {
        "source_sentence": "行則庠序，不遲不疾；",
        "translation": "He walks in a leisurely pace, neither too slow nor too fast.",
        "source": "T15n0630_001:0452c16_16"
    },
    {
        "source_sentence": "坐則中坐，不前不却；",
        "translation": "When they sit, they are seated in the middle; neither going forward nor going back.",
        "source": "T15n0630_001:0452c17_0"
    },
    {
        "source_sentence": "語聲八種，不緩不急。",
        "translation": "There are eight kinds of verbal sounds, neither slow nor fast.",
        "source": "T15n0630_001:0452c17_1"
    },
    {
        "source_sentence": "言成法律，明誡如日，令一切眾，咸受恩福。",
        "translation": "When it's said to become a law, he clearly admonishes them as they are day by day, so that all the people will receive kindness and merit.",
        "source": "T15n0630_001:0452c17_2"
    },
    {
        "source_sentence": "本作何行，生而有此？",
        "translation": "What action did you do in the past that gave rise to this?",
        "source": "T15n0630_001:0452c18_3"
    },
    {
        "source_sentence": "「又見天尊，足不履地，相輪昺列，端嚴如畫，身空體輕，在所變現，",
        "translation": "“Furthermore, venerable goddess, your feet did not touch the ground. You were arrayed in rows with distinctive marks and embellishments as if they were painted on a picture. Your body was spacelike and light-bodied, yet you manifested yourself according to what you wished.",
        "source": "T15n0630_001:0452c19_4"
    },
    {
        "source_sentence": "此皆何行，於世有是？",
        "translation": "What's the practice of all these things that exist in the world?",
        "source": "T15n0630_001:0452c20_5"
    },
    {
        "source_sentence": "願垂解了，令知本末。」",
        "translation": "May you understand it so that you'll know the source and the derivative.",
        "source": "T15n0630_001:0452c21_6"
    },
    {
        "source_sentence": "於是佛言：「善哉，善哉！",
        "translation": "The Buddha then said, Good, good!",
        "source": "T15n0630_001:0452c21_7"
    },
    {
        "source_sentence": "如爾所問，如來當具演之，整心整意，咸受莫忘。」",
        "translation": "As you've asked, the Tathāgata will explain it in detail, being whole-minded and mindful, so don't forget it.",
        "source": "T15n0630_001:0452c22_8"
    },
    {
        "source_sentence": "善明則曰：「受教。」",
        "translation": "Shanming then said, Accept the teaching.",
        "source": "T15n0630_001:0452c23_9"
    },
    {
        "source_sentence": "佛言：「我本先行六德之行，世世不廢，是以至於得佛，恣意變化，在所作為，",
        "translation": "The Buddha said: Originally I practiced the six kinds of virtuous deeds, which are not abandoned from generation to generation. That is why I attained buddhahood and performed all my magical transformations freely according to my wishes.",
        "source": "T15n0630_001:0452c23_10"
    },
    {
        "source_sentence": "為一切智，無物不達也。」",
        "translation": "For the sake of omniscience, there's nothing that he doesn't understand.",
        "source": "T15n0630_001:0452c25_11"
    },
    {
        "source_sentence": "則曰：「何謂六德之行？」",
        "translation": "He then said, What's meant by the practice of the six virtues?",
        "source": "T15n0630_001:0452c25_12"
    },
    {
        "source_sentence": "曰：「廣施、廣戒、廣忍、廣精進、廣一心、廣智慧。」",
        "translation": "He said, Extensive generosity, extensive morality, extensive patience, extensive effort, extensive unity of mind, and extensive wisdom.",
        "source": "T15n0630_001:0452c26_13"
    },
    {
        "source_sentence": "善明白佛：「何謂廣施？」",
        "translation": "Well-understood Buddha, What's meant by extensive giving?",
        "source": "T15n0630_001:0452c27_14"
    },
    {
        "source_sentence": "佛言：「為道者先當知身非常真物，四大所成，骨肉不淨，皆當棄捐，",
        "translation": "The Buddha said, For the sake of enlightenment, you must first know that the body is an extraordinarily real thing. Formed by the four elements, bones and flesh are impure; they should all be discarded.",
        "source": "T15n0630_001:0452c27_15"
    },
    {
        "source_sentence": "還歸其本，不得常住。",
        "translation": "They return to their original place and won't be allowed to live permanently.",
        "source": "T15n0630_001:0452c29_16"
    },
    {
        "source_sentence": "身不我有，財物非我許，心無有形，了無常名。",
        "translation": "The body is not possessed by me, possessions are not what I approve of; the mind has no form and perceives impermanence as a name.",
        "source": "T15n0630_001:0452c29_17"
    },
    {
        "source_sentence": "為緣緣行縛，所以有身行，身無有常，亦當空朽。",
        "translation": "Because the body is conditioned by conditioned formations, it therefore has bodily formations; the body is impermanent and impermanent, and it will surely become empty and decay.",
        "source": "T15n0630_001:0453a01_18"
    },
    {
        "source_sentence": "以計如此，則立四信。",
        "translation": "Because of this calculation, the four kinds of faith are established:",
        "source": "T15n0630_001:0453a02_19"
    },
    {
        "source_sentence": "內身外身，天地萬物，皆無常住，當歸壞敗，棄散消融。",
        "translation": "The internal body and external body, heaven and earth, and all things that exist therein are impermanent and unchanging. They will surely return to decay and disintegrate, being discarded, scattered, and dissolved.",
        "source": "T15n0630_001:0453a03_20"
    },
    {
        "source_sentence": "此信已立，則觀體非體，觀物非物，便能恣施，飽滿於人。",
        "translation": "Once this faith has been established, then he's observing what's in essence and what's not in essence, and observing things that aren't things, he's able to give freely and satisfy people.",
        "source": "T15n0630_001:0453a04_21"
    },
    {
        "source_sentence": "又而法施牽化愚曚，故曰廣施。」",
        "translation": "Furthermore, it's called extensive generosity because the gift of the Dharma leads to the transformation of foolishness.",
        "source": "T15n0630_001:0453a05_22"
    },
    {
        "source_sentence": "「何謂廣戒？」",
        "translation": "What's meant by extensive precepts?",
        "source": "T15n0630_001:0453a06_23"
    },
    {
        "source_sentence": "曰：「廣戒者，謂能攝身之三殃、守口之四過、撿意之三惡。",
        "translation": "He said, The extensive precepts are the three bad qualities that can be collected in the body, the four faults of guarding one's mouth, and the three bad qualities of examining one's mind.",
        "source": "T15n0630_001:0453a06_24"
    },
    {
        "source_sentence": "身行者，若見一切眾生、蚑行蠕動，愍而哀傷，縱而活之，隨其水陸，",
        "translation": "bodily movement means that if one sees all sentient beings move and wriggle with anger, pitying and grieving because of anger. Even though they are alive, they follow the water and land along with it.",
        "source": "T15n0630_001:0453a08_0"
    },
    {
        "source_sentence": "還而安之。",
        "translation": "He returned and placed it safely.",
        "source": "T15n0630_001:0453a09_1"
    },
    {
        "source_sentence": "若見眾寶珍琦，柔軟細滑可意之物，雖身貧苦，內伏其心，不令貪取。",
        "translation": "If they see various rare and precious treasures, soft, fine, and slippery things that are desirable, even though their bodies are poor and painful, they subdue their minds internally and don't allow them to crave them.",
        "source": "T15n0630_001:0453a09_2"
    },
    {
        "source_sentence": "及見細色脂粉之飾，則內觀朽爛膿血之臭，斯身之三戒。",
        "translation": "When they see the fine-colored embellishments of fat and flour, they internally observe the smell of rotten pus and blood, which are the three precepts of this body.",
        "source": "T15n0630_001:0453a11_3"
    },
    {
        "source_sentence": "口行者，謂彼若以四過加己，則而覺知口之失也，報以善言和語，至誠不飾，",
        "translation": "verbal conduct means that if someone adds four faults to themselves, then they'll perceive verbal faults. The reward is good speech and harmonious speech with utmost sincerity and without decoration.",
        "source": "T15n0630_001:0453a12_4"
    },
    {
        "source_sentence": "答而化之，使反從己，斯口之四戒矣。",
        "translation": "He answered and transformed them, so that they would follow themselves instead, which are the four precepts of his mouth.",
        "source": "T15n0630_001:0453a14_5"
    },
    {
        "source_sentence": "意行者，則心習智慧，思惟生死，常住慧處，不惑流淟。",
        "translation": "Those who practice with the mind cultivate wisdom in their minds, contemplate birth and death, always abide in the abode of wisdom, and aren't confused by the flow of lust.",
        "source": "T15n0630_001:0453a15_0"
    },
    {
        "source_sentence": "又深入道品、空無之要，別了真喭而無疑難。",
        "translation": "He also penetrates deeply into the essentials of the chapter on the path and emptiness and nonexistence, understands the true essence separately and has no doubts or difficulties.",
        "source": "T15n0630_001:0453a16_1"
    },
    {
        "source_sentence": "見善則勸，成則代喜，斯意之三戒。",
        "translation": "When they see goodness, they are encouraged, and when they accomplish it, they rejoice instead. These are the three moral precepts of mind.",
        "source": "T15n0630_001:0453a17_2"
    },
    {
        "source_sentence": "故行道之始，先於十戒，既能自為，又化他人，勤而不懈，行而不休，",
        "translation": "Therefore, at the beginning of the practice of enlightenment, they are able to do their own work and teach others. They strive diligently without slackening and never stop practicing it.",
        "source": "T15n0630_001:0453a18_0"
    },
    {
        "source_sentence": "都無懈惓之想，故曰廣戒也。」",
        "translation": "They don't have lazy thoughts at all, so they're called extensive precepts.",
        "source": "T15n0630_001:0453a19_1"
    },
    {
        "source_sentence": "「何謂廣忍？」",
        "translation": "What's meant by extensive tolerance?",
        "source": "T15n0630_001:0453a20_2"
    },
    {
        "source_sentence": "曰：「廣忍者，若人罵我，計從聲出音來到此，觀了無形；",
        "translation": "He said, “Kukkuṭapāda, if someone ridicules me and imagines that sounds emanating from my voice will come to this place, then he perceives formlessness.",
        "source": "T15n0630_001:0453a20_3"
    },
    {
        "source_sentence": "本音所來，出於心意，觀于心意，亦復無形。",
        "translation": "The original sound comes from mind and thought, and the contemplation of mind and thought also has no form.",
        "source": "T15n0630_001:0453a21_4"
    },
    {
        "source_sentence": "察心所猗，猗於四大，四大還本，則亦無名、亦非彼我、亦非男女、亦非老少，",
        "translation": "When one examines the state of mind and its dependence on the four elements, and when the four elements return to their original state, then there are no names, no self, no male or female, and no old or young.",
        "source": "T15n0630_001:0453a22_5"
    },
    {
        "source_sentence": "計了無主。",
        "translation": "He imagines that there's no owner.",
        "source": "T15n0630_001:0453a24_6"
    },
    {
        "source_sentence": "慚辱所在，無形立字。",
        "translation": "Where there's shame and humility, there's no form that establishes words.",
        "source": "T15n0630_001:0453a24_7"
    },
    {
        "source_sentence": "於兩無之中，又亦無形，計此三者，空無所有。",
        "translation": "Among the two kinds of nonexistence, there's also formlessness, and these three are considered to be because emptiness has no existence.",
        "source": "T15n0630_001:0453a25_0"
    },
    {
        "source_sentence": "智者散意觀慮如此，則瞋恚不生，以空忍空，又於眾惡，忍而不為。",
        "translation": "When a wise person contemplates with distracted minds like this, anger doesn't arise, and because of emptiness they tolerate emptiness, and they tolerate all kinds of bad things without doing anything.",
        "source": "T15n0630_001:0453a26_0"
    },
    {
        "source_sentence": "對來不起，撿心伏意，身自能爾，又誨他人，此謂廣忍也。」",
        "translation": "When an opponent doesn't arise, examines his mind and subdues his thoughts, does so himself, and admonishes others, this is called extensive tolerance.",
        "source": "T15n0630_001:0453a27_1"
    },
    {
        "source_sentence": "「何謂廣精進？」",
        "translation": "What's meant by extensive effort?",
        "source": "T15n0630_001:0453a28_2"
    },
    {
        "source_sentence": "「減於多食，不味於味；",
        "translation": "“World-honored One, it is better to eat sparingly than a great deal of food and not savoring taste.",
        "source": "T15n0630_001:0453a29_0"
    },
    {
        "source_sentence": "除於睡臥，驚意晨夜。",
        "translation": "In addition to sleeping and lying down, he's frightened in the morning and night.",
        "source": "T15n0630_001:0453a29_1"
    },
    {
        "source_sentence": "遠俗近道，行於眾戒。",
        "translation": "They are far removed from the secular world and have not practiced Buddhism, but they keep the precepts.",
        "source": "T15n0630_001:0453a29_2"
    },
    {
        "source_sentence": "坐起之法，不失其儀，無犯之行，當習於心；",
        "translation": "When they are seated and rise, they do not lose their manners. The practice of not violating the precepts should be practised in their minds.",
        "source": "T15n0630_001:0453b01_3"
    },
    {
        "source_sentence": "道品之要，汲汲樂誦，晝則勤受，夜則經行。",
        "translation": "The essentials of the path were diligently recited and practiced during the daytime, and at night they walked up and down in meditation.",
        "source": "T15n0630_001:0453b02_4"
    },
    {
        "source_sentence": "語則應律，身口意并，從猗憶法，不離經文。",
        "translation": "bodily action, vocal action, and mental oṟgans are not distinct from the dharmas mentioned in the Sūtra.",
        "source": "T15n0630_001:0453b03_5"
    },
    {
        "source_sentence": "坐而廣說，意不以煩，開教愚頑，不以懈勞。",
        "translation": "He sat and explained it in detail, not bothering his mind. He taught the ignorant and the wicked without laziness.",
        "source": "T15n0630_001:0453b04_6"
    },
    {
        "source_sentence": "違心反意，自逮專精，身既自能，又誨他人。",
        "translation": "To disobey the mind and oppose the mind, he collects his own energy and concentrates it on himself. Since he can do so by himself, he also admonishes others.",
        "source": "T15n0630_001:0453b05_7"
    },
    {
        "source_sentence": "斯謂廣精進。」",
        "translation": "This is called extensive effort.",
        "source": "T15n0630_001:0453b06_8"
    },
    {
        "source_sentence": "「何謂廣一心？」",
        "translation": "What's meant by extensive unity of mind?",
        "source": "T15n0630_001:0453b06_9"
    },
    {
        "source_sentence": "「孝事父母，則一其心；",
        "translation": "To serve one’s parents with filial piety is to unify one’s mind.",
        "source": "T15n0630_001:0453b06_10"
    },
    {
        "source_sentence": "尊敬師友，而一其心；",
        "translation": "They honor teachers and friends, yet keep their minds one-pointed.",
        "source": "T15n0630_001:0453b07_11"
    },
    {
        "source_sentence": "斷愛遠俗，而一其心；",
        "translation": "They abandoned craving and distanced themselves from worldly things, but unified their minds.",
        "source": "T15n0630_001:0453b07_12"
    },
    {
        "source_sentence": "入三十七品，而一其心；",
        "translation": "They enter the thirty-seven states of enlightenment, yet unify their minds.",
        "source": "T15n0630_001:0453b08_13"
    },
    {
        "source_sentence": "空閑寂寞，而一其心；",
        "translation": "Their minds are unified in emptiness, tranquility, and loneliness.",
        "source": "T15n0630_001:0453b08_14"
    },
    {
        "source_sentence": "在眾煩亂，而一其心；",
        "translation": "They are in the midst of all afflictions, yet their minds are unified.",
        "source": "T15n0630_001:0453b09_15"
    },
    {
        "source_sentence": "多欲多諍，多作多惱，於是之處，而一其心；",
        "translation": "They have many desires and much anger, and they often indulge in debauchery. Here and there they concentrate their minds.",
        "source": "T15n0630_001:0453b09_16"
    },
    {
        "source_sentence": "褒訕利失，善惡之事，於是不搖，而一其心；",
        "translation": "They praised gains and losses, doing good or bad deeds. Thus they did not budge but concentrated their minds.",
        "source": "T15n0630_001:0453b10_17"
    },
    {
        "source_sentence": "數息入禪，捨六就淨，而一其心。",
        "translation": "He repeatedly ceases and enters meditation, abandons the six in terms of purity, and unifies his mind.",
        "source": "T15n0630_001:0453b11_18"
    },
    {
        "source_sentence": "身自能行，復教他人，此謂廣一心也。」",
        "translation": "Being able to act on one's own and then teaching others is called having a broad single mind.",
        "source": "T15n0630_001:0453b12_19"
    },
    {
        "source_sentence": "「何謂廣智慧？」",
        "translation": "What's meant by extensive wisdom?",
        "source": "T15n0630_001:0453b13_20"
    },
    {
        "source_sentence": "曰：「明士隨於受身，則有三痛、六患、五蔽之垢、六十二沈吟之想、八十八難解之縛、千八百鋒瘡之痛。",
        "translation": "He said, A wise man follows the three pains, six afflictions, five obscurations, sixty-two thoughts of screaming, eighty-eight difficult-to-untie bonds, and a thousand and eight hundred sores.",
        "source": "T15n0630_001:0453b13_21"
    },
    {
        "source_sentence": "若此之事，則以智慧一一開了。",
        "translation": "If there are these things, then he'll use his wisdom to uncover them one by one.",
        "source": "T15n0630_001:0453b15_22"
    },
    {
        "source_sentence": "觀其所起，察其所滅；",
        "translation": "Observing what they give rise to, they examine what they extinguish.",
        "source": "T15n0630_001:0453b16_23"
    },
    {
        "source_sentence": "視其所病，選以何藥。",
        "translation": "He examined the illness and selected the medicine to treat it.",
        "source": "T15n0630_001:0453b16_24"
    },
    {
        "source_sentence": "既總其要，令身不毀戒，意不入俗。",
        "translation": "Since they summarize the essentials, they cause their bodies not to disparage the precepts and their minds not to enter the conventional.",
        "source": "T15n0630_001:0453b17_25"
    },
    {
        "source_sentence": "處眾愛之中，心在道品之藏；",
        "translation": "In the midst of all cravings, their minds are in the treasury of enlightenment.",
        "source": "T15n0630_001:0453b18_26"
    },
    {
        "source_sentence": "寄六患之舍，心在六淨之堂；",
        "translation": "They live in the abode of the six afflictions, but their minds are kept in the monastery of the six purities.",
        "source": "T15n0630_001:0453b18_27"
    },
    {
        "source_sentence": "住五蔽之室，心在斷滅之戶；",
        "translation": "He dwelled in the room of the five blindnesses, his mind at the door of cessation.",
        "source": "T15n0630_001:0453b19_28"
    },
    {
        "source_sentence": "猗不固之屋，心思方便之護；",
        "translation": "They live in houses that are not firm and guarded by skillful means.",
        "source": "T15n0630_001:0453b20_29"
    },
    {
        "source_sentence": "坐虵蚖之地，心念捨遠之徑；",
        "translation": "He sat cross-legged on the ground, mindful of the distant paths.",
        "source": "T15n0630_001:0453b20_30"
    },
    {
        "source_sentence": "乘坏船之嶮，心圖自濟之路；",
        "translation": "They rode on the dangerous precipices of a wrecked ship, intending to find their own way of salvation.",
        "source": "T15n0630_001:0453b21_31"
    },
    {
        "source_sentence": "近盛火之林，心推灌滅之安。",
        "translation": "He approached the forest where the fire was raging and thought of it as a peaceful place to bathe and extinguish.",
        "source": "T15n0630_001:0453b22_0"
    },
    {
        "source_sentence": "是以明士，行智慧之便，拔出生死之難；",
        "translation": "That is why the enlightened one practices the opportunity of wisdom and removes the difficulties of birth and death.",
        "source": "T15n0630_001:0453b22_1"
    },
    {
        "source_sentence": "絕三界之想，就滅度之地。",
        "translation": "He cut off the perception of the three realms and went to the land of extinction.",
        "source": "T15n0630_001:0453b23_2"
    },
    {
        "source_sentence": "既自身行，又教他人，此謂廣智慧六德之行義也。",
        "translation": "Both their own practice and teaching others, this is the meaning of the practice of the six virtues of vast wisdom.",
        "source": "T15n0630_001:0453b24_3"
    },
    {
        "source_sentence": "「向所問，如來神變相好，無量之德，所以致之？",
        "translation": "Did you ask, the Tathāgata's miraculous appearance is so beautiful and immeasurable in virtue that it causes him to do so?",
        "source": "T15n0630_001:0453b25_4"
    },
    {
        "source_sentence": "行此六法及諸慧定三十七品總持無邊底之行，故得佛號、天尊，無所不能為也。」",
        "translation": "Practicing these six dharmas and the thirty-seven qualities of wisdom and concentration, he always maintains the practice of limitlessness, so he attains the Buddha's name and honored godhood, which nothing can fail to do.",
        "source": "T15n0630_001:0453b26_5"
    },
    {
        "source_sentence": "於是善明及眾會，聞天尊說，則皆舉言，願發無上獨尊平等之意。",
        "translation": "When Sunetra and the assembly heard the teaching of the gods, they all raised their voices and vowed to give rise to the unsurpassed, solitary, and equal aspiration of the honored one.",
        "source": "T15n0630_001:0453b28_6"
    },
    {
        "source_sentence": "皆言：「今日得大福，令一切人疾逮此行。」",
        "translation": "They all said, Today, I've obtained great merit that will cause all people to quickly grasp this practice.",
        "source": "T15n0630_001:0453b29_7"
    },
    {
        "source_sentence": "善明時則得四淨法，一為眼淨、二為身淨、三為口淨、四為意淨，欣然低頭，",
        "translation": "When you understand well, you’ll attain four kinds of pure dharmas: purity of the eye, purity of the body, purity of the voice, and purity of the mind.",
        "source": "T15n0630_001:0453c01_8"
    },
    {
        "source_sentence": "默思法義。",
        "translation": "He's silently contemplating the meaning of the teaching.",
        "source": "T15n0630_001:0453c03_9"
    },
    {
        "source_sentence": "於是，善明避坐長跪，啟如來曰：「天尊所說，廣度無極，法禁微妙，",
        "translation": "Thereupon, Sunetra avoided his seat and knelt down long enough to inquire of the Tathāgata, saying: “The extensive exhortation taught by the Blessed One has no limit.",
        "source": "T15n0630_001:0453c03_10"
    },
    {
        "source_sentence": "撿攝意態，伏心就淨，殃垢消滅，其聞此者功德已大，況乃履行，德難稱量。",
        "translation": "When he examines and collects his thoughts, subdues his mind in order to purify it, and the defilements of evil are extinguished. Those who hear these words have great merit, so how could they fulfill them, whose virtue would be immeasurable?",
        "source": "T15n0630_001:0453c04_11"
    },
    {
        "source_sentence": "天尊又說，前世非但行此六事而已，又行定意之法及總持無底邊三十七品，",
        "translation": "The Blessed One said further: In the past, not only these six things were practiced; but also the mental states of absorption and the thirty-seven factors of unremitting concentration as well as the general maintenance of absoṟption.",
        "source": "T15n0630_001:0453c06_12"
    },
    {
        "source_sentence": "乃成具佛事、四無所畏、十種力、十八神妙特異之法，變化自在，所說無難，",
        "translation": "He accomplished the buddha-works, the four fearlessnesses, the ten kinds of powers, and the eighteen marvelous spiritual qualities.",
        "source": "T15n0630_001:0453c08_13"
    },
    {
        "source_sentence": "而面見諸佛，飛到十方而授一切諸未度者，率化度之；",
        "translation": "He saw the buddhas flying to the ten directions and teaching all those who had not yet liberated, leading and inspiring them.",
        "source": "T15n0630_001:0453c09_14"
    },
    {
        "source_sentence": "而壞邪藏，將導曲邪；",
        "translation": "He destroys the treasury of error and leads the wrong path.",
        "source": "T15n0630_001:0453c11_15"
    },
    {
        "source_sentence": "而生受苦之中不著、不斷，以不著、不斷，作因緣行，教諸惑者。",
        "translation": "He's born in the midst of suffering, doesn't cling and doesn't stop, and because he doesn't cling and doesn't stop, he acts with causes and conditions to teach those afflictions.",
        "source": "T15n0630_001:0453c11_16"
    },
    {
        "source_sentence": "如此之妙德，無央數事行，何等定意致得之乎？",
        "translation": "Such marvelous qualities are immeasurable, and what kind of concentration will cause them to attain them?",
        "source": "T15n0630_001:0453c13_17"
    },
    {
        "source_sentence": "唯願天尊！",
        "translation": "May it please the Bhagavān!",
        "source": "T15n0630_001:0453c14_18"
    },
    {
        "source_sentence": "為今現在及未來者，演其深義，令獲解脫。」",
        "translation": "For those in the present and future, he explains its profound meaning so that they'll attain liberation.",
        "source": "T15n0630_001:0453c14_19"
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, Good!",
        "source": "T15n0630_001:0453c15_20"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T15n0630_001:0453c15_21"
    },
    {
        "source_sentence": "所欲問者，今為分別，具敷大要，整意善聽。」",
        "translation": "Those who want to ask questions are now discerned, prepared with the great essentials, and listen well with proper intentions.",
        "source": "T15n0630_001:0453c15_22"
    },
    {
        "source_sentence": "則曰：「受教」佛言：「有定意法，名成具光明。",
        "translation": "He then said, Accept the teaching, and the Buddha said, There's a set mental state that's called accomplished by illumination.",
        "source": "T15n0630_001:0453c16_23"
    },
    {
        "source_sentence": "其有人聞之者，若能履行一日至七日，其功德福不可譬喻。",
        "translation": "If someone hears it, and if they can fulfill it for one day or seven days, their merit and merit are incalculable.",
        "source": "T15n0630_001:0453c17_24"
    },
    {
        "source_sentence": "其聞是法者，先世已供養百千億佛，已於其坐具聞不疑，今生乃復值遇是成具光明定意法。",
        "translation": "Those who hear this teaching had already offered offerings to hundreds of thousands of myriads of koṭis of buddhas in a previous life, and they heard it while sitting there without doubt. In their present birth, they'll again meet this method of accomplishing the illuminating concentration that's endowed with light.",
        "source": "T15n0630_001:0453c18_25"
    },
    {
        "source_sentence": "今得修行行之，如彈指頃，長離三惡道，功德漸滿，疾逮至佛。",
        "translation": "Now I can cultivate this practice, just as if I were to snap my fingers in an instant and leave the three bad destinies for a long time. As their merit gradually increases, they will quickly reach buddhahood.",
        "source": "T15n0630_001:0453c21_26"
    },
    {
        "source_sentence": "向所問諸事，悉能成具。」",
        "translation": "He's able to complete all the things he asks about.",
        "source": "T15n0630_001:0453c22_27"
    },
    {
        "source_sentence": "善明曰：「當行幾事而得此尊定？」",
        "translation": "Shanming said, How many things will you do to attain this venerable concentration?",
        "source": "T15n0630_001:0453c23_0"
    },
    {
        "source_sentence": "佛言：「當淨行百三十五事，乃得入此定耳。",
        "translation": "The Buddha said, You must perform one hundred and thirty-five pure deeds to enter this concentration.",
        "source": "T15n0630_001:0453c23_1"
    },
    {
        "source_sentence": "「遠身行、離口過、除意念、盡三穢、却六患、遏五蔽，十二因緣已捐盡，",
        "translation": "“Seclusion from bodily action, seclusion from verbal faults, removal of thought and thought, extinguishing the three defilements, getting rid of the six afflictions, and suppressing the five blindnesses—these twelve causes and conditions have been exhausted.",
        "source": "T15n0630_001:0453c25_0"
    },
    {
        "source_sentence": "解結束，明六十二沈吟行。",
        "translation": "At the end of the explanation, he explains the sixty-two sinful recitations and practices.",
        "source": "T15n0630_001:0453c26_1"
    },
    {
        "source_sentence": "愈眾瘡、悅眾惱、捨諸大、棄骨血、避親屬、絕諸習、斷於愛、無諸可無不可、剗貪垢、刈欲根、不惑流、能制疾、不我計、無不我、立四信、住四止、就四斷、插五根、習五力、曉七智、履八正、入八念、八常勤，",
        "translation": "He cured all sores, delighted in all afflictions, abandoned the great, discarded bones and blood, avoided relatives, cut off all habits, cut off craving, eliminated what’s neither agreeable nor disagreeable, became angry and greedy, mowed his faculty of desire, mowed his faculty of desire, didn’",
        "source": "T15n0630_001:0453c27_2"
    },
    {
        "source_sentence": "為已無勤可行，離不可行。",
        "translation": "It's because there's no exertion that can be practiced, and it's free of what can't be practiced.",
        "source": "T15n0630_001:0454a02_3"
    },
    {
        "source_sentence": "學上智、自尊意、不貢高而濡軟、雨法雨，如一法不兩計、不三想、不為無益想、無有際想、不空想、不想想、想無處、不住無處想。",
        "translation": "He trains in superior wisdom, self-respect, self-restraint, non-exalted but gentleness, and rains down the Dharma rain, thus following one teaching that's not two or three thoughts, doesn't conceive of it as useless, doesn't conceive of it as limitless, doesn't conceive of it as empty, doesn't think about it",
        "source": "T15n0630_001:0454a03_4"
    },
    {
        "source_sentence": "善惟佛知佛淨、已知淨而善學、心正住、不邪還、等善惡、如明冥、於明冥知俱空、不疑法、不以有淨無、觀有無本為一。",
        "translation": "The well-versed Buddha knows the Buddha's purity, knows the purity and well trains it, correctly abides in his mind, doesn't wrongly return, is equal to good and evil, knows both emptiness and emptiness like light and darkness, doesn't doubt the Dharma without doubt, doesn't think that there's pure and nonexistent, and observes",
        "source": "T15n0630_001:0454a06_5"
    },
    {
        "source_sentence": "已知一而除一，不於一而起想，勤受教、善習行、因習行入無際、習勝意、不聽心、善防識、不亂轉。",
        "translation": "Knowing that one is one but removing one, they don't give rise to thoughts about one, diligently receive teachings, skillfully cultivate practice, enter without limit because of their accumulation, cultivate superior intentions, don't listen to minds, well guard consciousnesses, and don't disturb them.",
        "source": "T15n0630_001:0454a09_0"
    },
    {
        "source_sentence": "往來三而不著、察諸性了無根、知無根不可滿、以不滿而自整。",
        "translation": "They go back and forth three times without attachment, examine the natures and understand that there are no faculties, know that there are no faculties that can't be fulfilled, and self-correct themselves because they aren't fulfilled.",
        "source": "T15n0630_001:0454a11_1"
    },
    {
        "source_sentence": "縷觀法為同無，常住無絕無想，常無常以過上，不念人、不宥世、不著物、罷捨求，",
        "translation": "The thread observes that dharmas are the same as nonexistence, eternally abiding without cessation and without perception, eternal and impermanent because of their superiority, not mindful of people, not remonstrating with the world, not clinging to things, and abandoning seeking.",
        "source": "T15n0630_001:0454a12_2"
    },
    {
        "source_sentence": "法合離了無見、身生歿皆由化、上中下知法等，於是世往後世。",
        "translation": "The dharmas are combined, free of perception and no views, and the body that gives rise to anger is all due to transformation, knowing the higher, middle, lower, and other dharmas, which go from one lifetime to another.",
        "source": "T15n0630_001:0454a14_3"
    },
    {
        "source_sentence": "「觀二因如虛空、心無欲而常仁、行清白善誘人、知人向為反濁、於反濁而清澄、心遠愛筋入火、以淨火燒眾垢、已盡垢寂然淨、不念善不念惡、不惟好不惟醜、不念苦不念樂、於毀譽無歡怒、心調淨所在入、開大藏入大法、以道律護滿法、苦習審勤承行。",
        "translation": "He observes that the two causes are like space, his mind is free of desire and always benevolent, he conducts himself with purity and whiteness and skillfully entices others, knows people to turn against turbidity, becomes pure when they turn against turbidity, enters into fire with a mind free of craving, burns dirt with a pure fire, extinguishes",
        "source": "T15n0630_001:0454a16_0"
    },
    {
        "source_sentence": "以盡道為光曜，視一切性識起，流結冥意思止，勤求止以入道。",
        "translation": "The path to cessation is the shining light, which looks at all the natures and consciousnesses that arise, streams, bonds, mysterious thoughts, and diligently seeks cessation in order to enter the path.",
        "source": "T15n0630_001:0454a22_0"
    },
    {
        "source_sentence": "剪三愛、除四失、增四城、離五覆、絕六慢、修六敬、具六法證、行七慧、強八力、拔九結、習九滅、十弘淨為已能、十力慧已備足、十直法不復學、慧法種而常存、於三寶已能備，",
        "translation": "They cut off the three kinds of craving, remove the four faults, increase the four castes, part with the five coverings, extinguish the six kinds of conceit, cultivate the six kinds of reverence, perfect the realization of the six teachings, practice the seven kinds of wisdom, develop the eight powers, pull out the nine bonds, cultivate the",
        "source": "T15n0630_001:0454a23_1"
    },
    {
        "source_sentence": "以法施無極盡，於諸專能備行、入無所著、入空無懈、却無吾念、無我想、無人計、無籌算、寂如滅度。",
        "translation": "Because their giving of the Dharma is infinite and inexhaustible, they're able to prepare practices that are exclusively practiced, enter without attachment, enter emptiness without laziness, have no thoughts of self, lack self, lack imagination, lack calculation, lack calculation, and be tranquil like cessation.",
        "source": "T15n0630_001:0454a27_2"
    },
    {
        "source_sentence": "「是為百三十五事成具光明定意戒法之行。」",
        "translation": "These are the one hundred and thirty-five things that make up the practice of the precepts of luminous concentration and morality.",
        "source": "T15n0630_001:0454b01_0"
    },
    {
        "source_sentence": "佛說是成具光明定意戒法品時，三十萬明士得是定意功德成具，立於第十之地。",
        "translation": "When the Buddha taught this chapter on the precepts of the luminous concentration that becomes complete, 300,000 scholars attain the accomplishment of the merit of this concentration and establish it in the tenth ground.",
        "source": "T15n0630_001:0454b02_0"
    },
    {
        "source_sentence": "善明則得無所從生法忍，五百同輩人，心欣意悅，皆發無上獨尊平等覺意。",
        "translation": "Sunetra then attained the forbearance of the Dharma that arises from nothing, and the five hundred people in his group were delighted with hearts and joyous intentions, all aroused the mind of the unsurpassed, solitary, and equally enlightened one.",
        "source": "T15n0630_001:0454b03_1"
    },
    {
        "source_sentence": "四十萬明士皆立不迴還行。",
        "translation": "40,000 scholars all established the practice of nonreturning.",
        "source": "T15n0630_001:0454b05_2"
    },
    {
        "source_sentence": "除惡眾五萬人，皆得無所著道。",
        "translation": "In addition, fifty thousand evil beings attained the path of no attachment.",
        "source": "T15n0630_001:0454b06_3"
    },
    {
        "source_sentence": "持五戒賢士、賢女二千人，皆得履跡之行。",
        "translation": "Two thousand men and women who observed the five precepts all attained the practice of walking.",
        "source": "T15n0630_001:0454b06_4"
    },
    {
        "source_sentence": "諸天在虛空中，而作音樂。",
        "translation": "The gods in the sky made music.",
        "source": "T15n0630_001:0454b07_5"
    },
    {
        "source_sentence": "歎曰：「快哉！",
        "translation": "He praised him, saying, How wonderful!",
        "source": "T15n0630_001:0454b08_6"
    },
    {
        "source_sentence": "世人乃獲上聞之要，其在愚曚埃濁者，今日霍然除盡。",
        "translation": "The people of the world then obtained the essentials of the above-mentioned teaching, and today they're rid themselves of the dust that's in their folly.",
        "source": "T15n0630_001:0454b08_7"
    },
    {
        "source_sentence": "如淨水洗浴垢，今聞大法心垢為消。",
        "translation": "It's like washing away the stain of pure water and bathing, but now that you've heard the great teaching, the stain of mind is eliminated.",
        "source": "T15n0630_001:0454b10_0"
    },
    {
        "source_sentence": "願令法輪常轉，使一切疾逮妙慧。",
        "translation": "May the wheel of the Dharma always turn, enabling all to quickly attain subtle wisdom.",
        "source": "T15n0630_001:0454b10_1"
    },
    {
        "source_sentence": "我等常遇天尊，所生不離。",
        "translation": "We always meet the lord of gods, and we are born without separation.",
        "source": "T15n0630_001:0454b11_2"
    },
    {
        "source_sentence": "疾得是成具光明定意，當廣宣法恩，還照流冥。",
        "translation": "If you quickly attain this concentration of perfect illumination, you will extensively proclaim the blessing of the Dharma and return to illumine the darkness of the stream.",
        "source": "T15n0630_001:0454b12_3"
    },
    {
        "source_sentence": "如今日大會，興立無數道本。」",
        "translation": "Today, there's a great assembly every day that produces an incalculable number of texts of the Way.",
        "source": "T15n0630_001:0454b13_4"
    },
    {
        "source_sentence": "善明白佛言：「今聞天尊是定意，淨心自思，觀我無黠慧心，了不知處，",
        "translation": "The Buddha Śubhavyūha said, “I have now heard that this is the intention of the venerable goddess. With a pure mind she thinks to herself:",
        "source": "T15n0630_001:0454b13_5"
    },
    {
        "source_sentence": "於外、於內俱亦如是。」",
        "translation": "So it is with both external and internal.",
        "source": "T15n0630_001:0454b15_6"
    },
    {
        "source_sentence": "佛告善明：「譬猶冥室執炬而入，則莫知冥之所在，是定意法其能履行道品成具，",
        "translation": "The Buddha said to Kalyāṇa-jātika: It is as if one were to enter a secluded room holding a torch in his hand and did not know where the torch was. This is the method of mental concentration that enables one to fulfill the qualities of the path and perfect them.",
        "source": "T15n0630_001:0454b16_0"
    },
    {
        "source_sentence": "則不知無黠十二牽連之所失也。",
        "translation": "Then they don't know that there aren't twelve wise dragons that are lost.",
        "source": "T15n0630_001:0454b17_1"
    },
    {
        "source_sentence": "善明！",
        "translation": "Sunetra!",
        "source": "T15n0630_001:0454b18_2"
    },
    {
        "source_sentence": "非但是而已，則不見十方生死起滅之處也，至履跡無著、因緣覺佛，乃至如來，",
        "translation": "Not only that, but they don’t see the places where births and deaths arise and cease in the ten directions, up to the point where they follow the footsteps of nonattachment, the causally enlightened buddhas, or even the Tathāgata.",
        "source": "T15n0630_001:0454b18_3"
    },
    {
        "source_sentence": "皆無見有所想見非見也。",
        "translation": "They all lack views and have conceptions, views, and non-views.",
        "source": "T15n0630_001:0454b20_4"
    },
    {
        "source_sentence": "無所想、一切清淨想、止清淨想、亦不止清淨想，是為空見無所見。」",
        "translation": "To have no conceptions of anything, all pure conceptions, stopping pure conceptions, and not only pure conceptions are views of emptiness and nothing to see.",
        "source": "T15n0630_001:0454b21_5"
    },
    {
        "source_sentence": "善明白天尊：「云何不止清淨想是為空見？",
        "translation": "The well-understood celestial honored one, Why isn't it a view of emptiness that goes beyond pure conceptions?",
        "source": "T15n0630_001:0454b23_0"
    },
    {
        "source_sentence": "當是時，心在何許？",
        "translation": "Where is the mind at that time?",
        "source": "T15n0630_001:0454b23_1"
    },
    {
        "source_sentence": "所見何等？」",
        "translation": "What's seen?",
        "source": "T15n0630_001:0454b24_2"
    },
    {
        "source_sentence": "佛言：「善明！",
        "translation": "The Buddha said, Sunetra!",
        "source": "T15n0630_001:0454b24_3"
    },
    {
        "source_sentence": "於是時，心不在內、不處外，不於道、不於俗，不於有、不於無，不於起、不於滅、不於動搖處也。",
        "translation": "At that point, his mind isn't inside or outside, doesn't look at the path or the conventional, doesn't look at existence or nonexistence, doesn't look at arising, ceasing, and moving.",
        "source": "T15n0630_001:0454b24_4"
    },
    {
        "source_sentence": "是心無根際、無音響，本末了索，當如是見。",
        "translation": "This mind has no roots, no sound, and no echoes, which are discerned in the past and future, and you should thus see it.",
        "source": "T15n0630_001:0454b26_5"
    },
    {
        "source_sentence": "是見為見、為空、為滅，為都無所有定意之法。",
        "translation": "These views are views, emptiness, cessation, and the dharmas of concentration that have no existence at all.",
        "source": "T15n0630_001:0454b27_6"
    },
    {
        "source_sentence": "以此為見，明士當作是計念，除念就淨。",
        "translation": "Because of this view, the wise man will think like this, and he'll remove that thought and become pure.",
        "source": "T15n0630_001:0454b28_7"
    },
    {
        "source_sentence": "作是計念者，為應成具光明定意之教法也。",
        "translation": "Those who make this kind of conceptual thought are the teachings and dharmas that should be accomplished by luminous concentration.",
        "source": "T15n0630_001:0454b29_8"
    },
    {
        "source_sentence": "是法無所有法故，強為其名。",
        "translation": "Because this teaching has no dharmas, it's forced to be its name.",
        "source": "T15n0630_001:0454c01_9"
    },
    {
        "source_sentence": "明士聞是，莫怪莫疑，諦而思惟其法，不退不懈，斯為已得定意威神之護力也。",
        "translation": "When the wise man heard this, he didn't wonder or doubt, and contemplated his teaching with sincerity without retreating or advancing, which is the protective power of the authoritative spirit of concentration that he had attained.",
        "source": "T15n0630_001:0454c02_10"
    },
    {
        "source_sentence": "「善明！",
        "translation": "“O Sunetra!",
        "source": "T15n0630_001:0454c04_11"
    },
    {
        "source_sentence": "其欲學此者，當行四事，稍入無見處。」",
        "translation": "Those who want to learn here will do four things, and they'll slightly enter the place of no views.",
        "source": "T15n0630_001:0454c04_12"
    },
    {
        "source_sentence": "曰：「何謂四也？」",
        "translation": "He said, What are the four?",
        "source": "T15n0630_001:0454c05_13"
    },
    {
        "source_sentence": "「一、不有身，二、不有居，三、不有世，四、不有物。",
        "translation": "1. There's no body, 2. there's no abode, 3. there's no world, and 4. there's nothing.",
        "source": "T15n0630_001:0454c05_14"
    },
    {
        "source_sentence": "以能如此者，則得入四要。」",
        "translation": "If someone can do so, they'll be able to enter the four essentials.",
        "source": "T15n0630_001:0454c06_15"
    },
    {
        "source_sentence": "「曰：何謂四要？」",
        "translation": "He said, What are the four essentials?",
        "source": "T15n0630_001:0454c07_16"
    },
    {
        "source_sentence": "曰：「一為佛要、二為法要、三為空要、四為滅要。",
        "translation": "He said, One is the essential for buddhahood, two are the essential for dharmas, three are the essential for emptiness, and four are the essential for cessation.",
        "source": "T15n0630_001:0454c07_17"
    },
    {
        "source_sentence": "此謂四要也。」",
        "translation": "These are the four essentials.",
        "source": "T15n0630_001:0454c08_18"
    },
    {
        "source_sentence": "「無彼無我想，　　亦不無黠計；",
        "translation": "“There is neither self nor that which is selfless, And neither is there wise imagination.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　十二因不著，　　是應成具足。",
        "translation": "If the twelve causes are not attached, then they should be complete.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　是定法本無，　　非有住立處；",
        "translation": "The dharmas of samdhi are fundamentally nonexistent, And there is no abode or foundation for them.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　哀世現其名，　　空行亦合儀。",
        "translation": "With pity for the world, he presents his name, and his practice of emptiness also accords with his manner.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　人心并意識，　　此三為起法；",
        "translation": "Mind and thought are the dharmas that give rise to it.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　行是成具足，　　無起無所滅。",
        "translation": "Practice is the fulfillment of formation, which has no arising and nothing to cease.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　空為成具地，　　生死苦斷離；",
        "translation": "Emptiness is the stage of endowment, And birth and death are severed from suffering.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　一切無餘跡，　　是合定意行。",
        "translation": "All, without remainder, Is the mental state of conjoined concentration.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　世人轉相猗，　　邪見著名法；",
        "translation": "The people of the world change in characteristics, And wrong views are renowned as dharmas.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　貪有利常想，　　纏縛無數世。",
        "translation": "Consciousness of craving and the idea of permanence are bound in countless worlds.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　積行常綴礙，　　憂惱著意慼；",
        "translation": "Accumulated practices are always obstructed by accumulation, And grief and vexation arise from attachment.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　四變如隨影，　　往來無休息。",
        "translation": "The four transformations are like following a shadow, going and coming without resting.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　行定無所猗，　　正觀不著名；",
        "translation": "Conditioned concentration has no place to rest, And right contemplation is not well known.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　貪盡想得滅，　　解縛清淨安。",
        "translation": "When thoughts of craving are ended, they attain cessation, and their liberation from bondage is pure and peaceful.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　淨行不罣惑，　　惑惱意了無；",
        "translation": "The practice of purity is not obstructed by defilement, Defilement and mental disturbance are absent.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　生老病已絕，　　無復往來憂。",
        "translation": "Birth, old age, and sickness have been cut off, and there's no more grief of past or future.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　慧眼明已大，　　智本無邊底；",
        "translation": "The eye of wisdom has already grown, And the foundation of knowledge is boundless.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　黠使度無極，　　行定乃致此。",
        "translation": "The wise messengers are infinite in liberation, but the practice of concentration brings them here.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　世火星月明，　　日曜崑崙光；",
        "translation": "The worldly fire and stars are shining like the moon, And the sun shines like the light of Kunlun.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "　釋梵殿所照，　　是定明過上。」",
        "translation": "What's illuminated in the Śākyamuni's hall of Brahmā, this is a definite explanation that goes beyond the above.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "佛時歎曰：佛告善明：「乃往昔無數劫時，有佛名尊伏欲王。",
        "translation": "The Buddha then praised him, saying, The Buddha told Sunetra, In ancient times, there was a Buddha named the honored King of Subduing Desire who lived for countless eons.",
        "source": "T15n0630_001:0454c08_19"
    },
    {
        "source_sentence": "時佛住世壽十萬歲，不在是南天竺止，自於今北方淨燿天歸佛所住處是也，",
        "translation": "When the Buddha was living in the world for one hundred thousand years, he did not reside in the southern Indian country of Jambudvfpa. This is where the Buddha lives as far north as present-day Jambudvlpa.",
        "source": "T15n0630_001:0455a01_20"
    },
    {
        "source_sentence": "彼國去是三億萬佛土乃得之。",
        "translation": "That country is 300 million buddha lands away, and they'll attain it.",
        "source": "T15n0630_001:0455a02_21"
    },
    {
        "source_sentence": "尊伏欲王佛時，人壽二萬歲，常可自從弟子六十萬人，明士眾不可計。",
        "translation": "At the time of the Venerable Śakra Devānām-Indra Buddha, when his life span was twenty thousand years in length, he always had six hundred thousand disciples and an incalculable number of scholars and men of learning.",
        "source": "T15n0630_001:0455a03_22"
    },
    {
        "source_sentence": "國民熾盛，豐饒寧靜，率皆賢行，戒德相嵯，欲貪三垢薄而[歹*斯]。",
        "translation": "The native products are abundant and productive. All the common people are wise and virtuous; morality and virtue prevailing over each other; their desires and greed are weakened by the three defilements of sexual desire.",
        "source": "T15n0630_001:0455a05_23"
    },
    {
        "source_sentence": "時佛大會十方明士，普受持說是成具光明定意，便而成具佛事，在於四署之一數。",
        "translation": "At the time, the Buddha's great assembly of wise men in the ten directions universally accepted and upheld the teaching that this was the accomplishment of the concentration of enlightened illumination, and then they accomplished the full set of buddha-works, which are listed in one of the four categories.",
        "source": "T15n0630_001:0455a06_24"
    },
    {
        "source_sentence": "「是時，有長者子名敏見，年五百歲，時國人以為少年。",
        "translation": "At the time, there was an elderly man named Mingxian who was five hundred years old, and the people of that country thought he was a youth.",
        "source": "T15n0630_001:0455a08_25"
    },
    {
        "source_sentence": "敏見聞佛大會，則啟二親，乞行詣佛，觀其所作。",
        "translation": "Having heard of the Buddha’s great assembly, Bimbisāra said to his two relatives, “I am going to visit the Buddha and see what he has done.",
        "source": "T15n0630_001:0455a09_26"
    },
    {
        "source_sentence": "父母聽行，即往見佛，稽首于地，禮竟正住，喜心興盛，便脫身珍琦雜寶瓔珞，",
        "translation": "When their parents heard this, they went to see the Buddha and bowed their heads at the ground. After paying their respects, they remained correctly seated. With a feeling of great joy arising in them, they dismounted from their precious jeweled necklaces on their bodies.",
        "source": "T15n0630_001:0455a10_27"
    },
    {
        "source_sentence": "散于佛上；",
        "translation": "They scattered it over the Buddha.",
        "source": "T15n0630_001:0455a12_28"
    },
    {
        "source_sentence": "以佛神威，應時所散，化成花蓋，到覆大眾，人人各別。",
        "translation": "Because of the Buddha's supernormal power, whatever he scattered at the right time transformed into a flower canopy to cover the crowd, and everyone was separated.",
        "source": "T15n0630_001:0455a12_29"
    },
    {
        "source_sentence": "佛令就坐，為說是成具光明定意法，心又增欣，則時願言：『令我所生常遇是成具光明定意，",
        "translation": "The Buddha caused them to take their seats and taught them the Dharma of concentration called ‘concentration on the illumination of enlightenment.’ With increasing joy in their hearts, they then made this vow:",
        "source": "T15n0630_001:0455a13_30"
    },
    {
        "source_sentence": "疾能履行，無虧減於戒德。』",
        "translation": "They'll quickly be able to fulfill it, and there won't be any lack of the virtue of morality.'",
        "source": "T15n0630_001:0455a15_31"
    },
    {
        "source_sentence": "是時少年以一切寶施與，發一言之至願，以是故，所生世輒得受。",
        "translation": "The young boy then gave all the treasures and made a single vow to give them, and because of this, the world he was born in would be able to accept them.",
        "source": "T15n0630_001:0455a16_32"
    },
    {
        "source_sentence": "善明！",
        "translation": "Sunetra!",
        "source": "T15n0630_001:0455a18_33"
    },
    {
        "source_sentence": "寧知彼時少年不乎？",
        "translation": "How could you know that it was a youthful boy at the time?",
        "source": "T15n0630_001:0455a18_34"
    },
    {
        "source_sentence": "則爾身是也。",
        "translation": "Then you're the body.",
        "source": "T15n0630_001:0455a18_35"
    },
    {
        "source_sentence": "今我出世，汝復遇值定意。",
        "translation": "Now that I've emerged from the world, you'll again meet me in a concentrated state of mind.",
        "source": "T15n0630_001:0455a18_36"
    },
    {
        "source_sentence": "於今以後，必得不久；",
        "translation": "From now on, it will surely not be long.",
        "source": "T15n0630_001:0455a19_37"
    },
    {
        "source_sentence": "得慧之後，二百劫當具成佛，號導世王。",
        "translation": "After attaining wisdom, he'll become a fully enlightened buddha for 200 eons, and he'll be called the world-guiding king.",
        "source": "T15n0630_001:0455a20_38"
    },
    {
        "source_sentence": "天上天下之獨尊，當化導愚冥如我今也。」",
        "translation": "The sole honored one in heaven and earth will guide the ignorant as I am now.",
        "source": "T15n0630_001:0455a21_0"
    },
    {
        "source_sentence": "善明聞佛授其封拜之名，則心淨體輕，譬如琉璃水精中外潔淨，一切無穢，",
        "translation": "Hearing the Buddha’s name and giving him the occasion to pay homage, one’s mind becomes pure and light-minded, like a crystal water spirit that is neither dirty nor ugly.",
        "source": "T15n0630_001:0455a21_1"
    },
    {
        "source_sentence": "以所置處處，并後淨其心若斯，則時得十憺然法：一者憺然不以所見為動，",
        "translation": "If this is the case, then at that time one attains ten kinds of confusion:",
        "source": "T15n0630_001:0455a23_2"
    },
    {
        "source_sentence": "二者於諸煩勞之事憺然常足，三者於眾想憺然不想，四者流俗所樂汲汲之事憺然而飽捨，",
        "translation": "The second is that they are always at ease with all kinds of troubles and worries. The third is that they are not at ease with thoughts, and the fourth is that they are unable to satisfy themselves with drinking pleasures enjoyed by the common people.",
        "source": "T15n0630_001:0455a25_3"
    },
    {
        "source_sentence": "五者於德不德憺然不念求、不念否，六者善法、惡法憺然不著，七者謙者、賢者憺然不望榮，",
        "translation": "The fifth is to be unconcerned with virtue and dishonesty, not seeking or doubting virtue; the sixth is to be unconcerned with good qualities and bad qualities without attachment; the seventh is to be unconcerned with humble and noble people without expecting prosperity.",
        "source": "T15n0630_001:0455a27_4"
    },
    {
        "source_sentence": "八者敬養捨棄憺然無歡怒，九者一切如法失法憺然同其原，十者以入淨寂若處不淨，",
        "translation": "The eighth is to honor and reject [the teachings of the buddhas] without anger. The ninth is that all those who follow the Dharma and lose the Dharma in accordance with the Dharma have the same basic principles as them.",
        "source": "T15n0630_001:0455a29_5"
    },
    {
        "source_sentence": "能以法化，憺然無著別、無厭捨之念。",
        "translation": "They can be transformed by the teachings of the Dharma, without attachment or disgust or thoughts of equanimity.",
        "source": "T15n0630_001:0455b02_6"
    },
    {
        "source_sentence": "心以如此，因白言：「天尊！",
        "translation": "Because of this, he said, Bhagavān!",
        "source": "T15n0630_001:0455b03_7"
    },
    {
        "source_sentence": "今授封拜之要於我，當報恩宣開一切，令未聞者聞，未知者知，未度者度之。",
        "translation": "Now, the essential point of giving a consecration is for me to repay kindness and proclaim all things, so that those who haven't heard it will hear it, those who don't know it, and those who haven't been liberated will be liberated by those who haven't been liberated.",
        "source": "T15n0630_001:0455b04_8"
    },
    {
        "source_sentence": "我生死常多，雖多、雖久不以為勞。",
        "translation": "Birth and death of self are always numerous, and even though they are numerous and long-lasting, they aren't considered to be troublesome.",
        "source": "T15n0630_001:0455b06_9"
    },
    {
        "source_sentence": "已不著、已覺、已能整、已為不惑、已能入其被服，隨因緣而示見之，",
        "translation": "Having become free of attachment, having awakened, being able to rectify, not disturbed, entering, and being able to enter, he shows them according to their causes and conditions.",
        "source": "T15n0630_001:0455b06_10"
    },
    {
        "source_sentence": "我不已生死為生死也，我受佛威神已悉俱了。",
        "translation": "I don't stop at birth and death as birth and death, but after receiving the Buddha's authoritative power, I fully understand them all.",
        "source": "T15n0630_001:0455b08_11"
    },
    {
        "source_sentence": "我有等率五百人，願天尊加四等之大慈，勉引入法，令疾解是成具光明定意。」",
        "translation": "I have five hundred people equal in number, may the Bhagavān give them four kinds of great compassion and urge them to introduce the teaching so that they quickly understand this is the intention to perfect the concentration of illumination.",
        "source": "T15n0630_001:0455b09_12"
    },
    {
        "source_sentence": "於是佛笑，皆見光從口出，五色煒曄，明接十方——其在痛者，一時得安——還從頂入，",
        "translation": "Then the Buddha smiled, and everyone saw a ray of light coming out of his mouth. His five-colored countenance extended as far as the ten directions; those in pain were instantly relieved, and they came back in through the top of their heads.",
        "source": "T15n0630_001:0455b11_13"
    },
    {
        "source_sentence": "自如常輝。",
        "translation": "It's like an eternal shining light.",
        "source": "T15n0630_001:0455b13_0"
    },
    {
        "source_sentence": "侍者阿難整服避坐，叉手啟曰：「佛未嘗虛欣笑，笑必有故。",
        "translation": "The attendant Ānanda, dressed in proper clothes and avoiding the seat, saluted the Buddha with his palms joined together and said: I have never laughed falsely. It must be a reason for smiling.",
        "source": "T15n0630_001:0455b13_1"
    },
    {
        "source_sentence": "唯願敷演，散告未聞。」",
        "translation": "I only wish to spread out the teaching, but I'll tell you what I haven't heard.",
        "source": "T15n0630_001:0455b14_2"
    },
    {
        "source_sentence": "「面部人雄顏，　　眼鼻口正端；",
        "translation": "Their facial features are heroic, With their eyes, nose, and mouth facing straight ahead.",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "　金體極軟細，　　今笑何盛欣。",
        "translation": "The essence of gold is extremely soft and fine, so why would he laugh now?",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "　方口含白齒，　　脣像朱火明；",
        "translation": "His square mouth contains white teeth, and his lips are like the light of a red-hot fire.",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "　姿美八十種，　　今笑必有因。",
        "translation": "There are eighty kinds of beauty in appearance, but there must be a reason for smiling now.",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "　鏡齒牙四十，　　廣舌頰車方；",
        "translation": "He had forty mirror teeth and forty teeth, His tongue extending as far as the square of his cheeks.",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "　語則香氣發，　　今笑為誰成？",
        "translation": "Words give forth their fragrance, but who is the one who creates it now with a smile?",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "　眉髭紺青色，　　眼瞼雙部當；",
        "translation": "His eyebrows, hair, and beard were dark blue. His eyes had white lids on both sides.",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "　白毫天中立，　　今笑唯願聞。",
        "translation": "I'm standing in the white-haired celestial realm, and now I'm smiling, just wanting to hear it.",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "　天眼已了朗，　　道眼已備通；",
        "translation": "The divine eye has clarified, And the eye of enlightenment is complete.",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "　法眼與慧眼，　　此四已具成。",
        "translation": "the eye of doctrine and the eye of wisdom. These four are already settled.",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "　笑必有感應，　　啟化於未成；",
        "translation": "The laughter must have an effect, inspiring those who are not yet enlightened.",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "　或當受拜決，　　故笑發金顏。」",
        "translation": "Perhaps he'll accept the vow to pay homage, so he smiles with a golden countenance.",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "於是阿難，則而歎曰：佛語阿難：「佛真不妄笑也！",
        "translation": "Ānanda then praised him, saying, The Buddha said to Ānanda, The Buddha really isn't laughing falsely!",
        "source": "T15n0630_001:0455b15_3"
    },
    {
        "source_sentence": "今善明所從五百賢士，前世已供養二百億佛，已於其坐，聞是成具光明慧中百三十五行，",
        "translation": "The five hundred and twenty-five practices of the enlightening being Universally Good are as follows. In a previous life they had already offered their support to two hundred myriads of koṭis of buddhas, and having sat there, they heard these one hundred and thirty-five practices in the accomplishment of illuminating wisdom.",
        "source": "T15n0630_001:0455b28_4"
    },
    {
        "source_sentence": "自從初聞歷世踰多，然常剛猛適在小善之數，未能伏心受持清淨最妙定行。",
        "translation": "Since the first time, I've heard it for more than a thousand years, but I've always been unable to subdue my mind and uphold the pure, most marvelous concentration practice.",
        "source": "T15n0630_001:0455c01_5"
    },
    {
        "source_sentence": "雖爾，以聞之功德，所生不在三惡處，常遇值是尊定之法。",
        "translation": "Even so, it's because of the merit of hearing that they aren't born in the three bad places and always encounter this venerable dharma of concentration.",
        "source": "T15n0630_001:0455c03_6"
    },
    {
        "source_sentence": "今日來會，淨心聽受，稍稍解釋開入正諦。",
        "translation": "Today, when they come to the assembly, their pure minds are heard and accepted, and they briefly explain and enter the right truth.",
        "source": "T15n0630_001:0455c04_7"
    },
    {
        "source_sentence": "後慈仁佛立，當於彼時，得是成具光明定意。",
        "translation": "Later, when Maitreya Buddha was established, he attained this accomplished concentration of illumination at that time.",
        "source": "T15n0630_001:0455c05_8"
    },
    {
        "source_sentence": "却後三十六萬億劫，皆成為佛。",
        "translation": "Three hundred and sixty myriads of koṭis of kalpas later, they all became buddhas.",
        "source": "T15n0630_001:0455c06_9"
    },
    {
        "source_sentence": "當復以是法教化，所領國土各各有號，有名幢節布燿王、次名大光遍顯、次名大勢伏惡、次名猛盛威德、次名流水淨音、次名高德普接、次名景現除結、次名化幻自在，",
        "translation": "Each of the lands he ruled had a different name, namely Banner-Section King Pūrvavideha. The next name was Great Light Universally Manifesting, the second Great Power Subduing Evil, the second vigorous and authoritative, the second pure sound like running water, the second universal connection of high virtue, the second Extinguishing bonds in All Directions, the second magic",
        "source": "T15n0630_001:0455c07_10"
    },
    {
        "source_sentence": "名各各如此。」",
        "translation": "Each name is like this.",
        "source": "T15n0630_001:0455c11_11"
    },
    {
        "source_sentence": "於是，五百賢士聞所受決，欣悅踊躍，則得五無轉心：一者祠祀求福心不轉為；",
        "translation": "Then the five hundred holy men, having heard the prediction of enlightenment, were delighted and jumped for joy. They attained five unshakable states of mind:",
        "source": "T15n0630_001:0455c11_12"
    },
    {
        "source_sentence": "二者一切五味可否，皆是眾生之神命，終不轉為害生可口；",
        "translation": "The second is that all the five flavors are agreeable or disagreeable. All these are the divine life of sentient beings, and ultimately they do not evolve into harmful or foul food.",
        "source": "T15n0630_001:0455c13_13"
    },
    {
        "source_sentence": "三者正立於無上獨尊之行，終不轉動捨就小道；",
        "translation": "The third is that they correctly establish the practice of the unsurpassed, solitary, and honored one. They never turn away from this practice and proceed on the lesser path.",
        "source": "T15n0630_001:0455c14_14"
    },
    {
        "source_sentence": "四者知是法尊無有與等者，勤心修行，雖有他法，雜異之虛而己，法心觀別終不轉為；",
        "translation": "The fourth is to know that this venerable one of the Teaching has no equal, and to diligently practice with an intense mind. Even though there are other teachings, they make up their own mixed doctrine in vain, observing distinctions in doctrine and thought without ever changing it.",
        "source": "T15n0630_001:0455c15_15"
    },
    {
        "source_sentence": "五者正使世有佛、無佛、法興、法衰、有終、有絕，心在定意，不以無此三寶故轉為邪業。",
        "translation": "The fifth is precisely because the world has buddhas, no buddhas, dharmas that arise, dharmas that decline, and dharmas that have an end and an end, and their minds are concentrated and not turned into wrong actions because of the absence of these three treasures.",
        "source": "T15n0630_001:0455c17_16"
    },
    {
        "source_sentence": "是為五無轉心。",
        "translation": "These are the five kinds of mind that have no turning.",
        "source": "T15n0630_001:0455c19_17"
    },
    {
        "source_sentence": "已得是心法義，皆前長跪白天尊曰：「佛哀我等！",
        "translation": "Having attained this meaning of the teaching of mind, they all knelt down in front of the long-legged Śakra Devānām-Indra and said, Bhagavān, pity us!",
        "source": "T15n0630_001:0455c19_18"
    },
    {
        "source_sentence": "告其封拜成佛之名，我等當報恩。",
        "translation": "Tell them the name of the buddha, and we will repay their kindness.",
        "source": "T15n0630_001:0455c21_0"
    },
    {
        "source_sentence": "後若所生弊惡之世，當勤修正行，奉宣尊法，開化未知，亂者正之、懈者勤之、却者勉之、傾者扶之、缺懼者補完之、冥者照之、結者解之。",
        "translation": "In the future, if there are bad and evil worlds that arise, they should diligently cultivate practice, proclaim the teaching of the venerable Dharma, enlighten those who aren't yet enlightened, correct those who are confused, exert those who are lazy, encourage those who reject it, support those who lean against it, make up for those who lack fear, illumina",
        "source": "T15n0630_001:0455c21_1"
    },
    {
        "source_sentence": "殺者為說夭逝之殃、盜者為說貧乞之苦、婬者為說身之禍、讒佞欺者為說滅性之患、醉亂者為說危身之變。",
        "translation": "A killer explains the danger of dying, a thief explains the suffering of poverty and begging, a beggar explains the physical misfortune, a deceitful man explains the danger of extinguishing the affliction of nature, and a drunken man explains the transformation of a dangerous body.",
        "source": "T15n0630_001:0455c24_2"
    },
    {
        "source_sentence": "我等今日并於佛前，誓立五願，作明士行乃至成佛，行之無休已。",
        "translation": "Today, together with the Buddha, we vow to make five vows in front of him, performing the deeds of a sage up to the attainment of buddhahood, and carrying them out without cease.",
        "source": "T15n0630_001:0455c27_3"
    },
    {
        "source_sentence": "願佛哀於我等！",
        "translation": "May the Buddha have pity on us!",
        "source": "T15n0630_001:0455c28_4"
    },
    {
        "source_sentence": "聽我等所言。",
        "translation": "Listen to what we say.",
        "source": "T15n0630_001:0455c29_5"
    },
    {
        "source_sentence": "「第一之願者：我作明士行，疾令身而變化周流十方。",
        "translation": "The first vow: I will perform the deeds of a sage and quickly cause my body to transform and flow in all ten directions.",
        "source": "T15n0630_001:0455c29_6"
    },
    {
        "source_sentence": "若世無佛，四輩弟子或有知法者，言：『信實有佛，但滅度耳！』",
        "translation": "If there are no buddhas in the world, the four groups of disciples or people who know the teaching say, 'There really is a buddha in the world, but it's only cessation!'",
        "source": "T15n0630_001:0456a01_7"
    },
    {
        "source_sentence": "俗人邪見疑網生，不見佛有不知法，便言：『無佛，但虛妄耳！",
        "translation": "Ordinary people have wrong views and webs of doubt, but when they don't see the Buddha or know the teaching, they say, 'There's no Buddha; it's just false!'",
        "source": "T15n0630_001:0456a03_8"
    },
    {
        "source_sentence": "若審有佛，何不見其威神乎？』",
        "translation": "If we examine whether there's a Buddha, why don't we see his authoritative power?'",
        "source": "T15n0630_001:0456a04_9"
    },
    {
        "source_sentence": "兩諍如此。",
        "translation": "These are the two kinds of disputes like this.",
        "source": "T15n0630_001:0456a05_10"
    },
    {
        "source_sentence": "當於諍時，我便當往化，現佛身相好照明，又化威神，於是兩諍人前令見，",
        "translation": "I will go and manifest the buddha’s physical form, shining brilliantly like a ray of light. Having manifested my magical power, I will show it to those who see me.” The goddess said:",
        "source": "T15n0630_001:0456a05_11"
    },
    {
        "source_sentence": "知諦有佛，并謂曰：『汝莫疑也！』",
        "translation": "Knowing that there's a Buddha in the truth, they both say, 'Don't doubt it!'",
        "source": "T15n0630_001:0456a07_0"
    },
    {
        "source_sentence": "是疑人即當驚喜，因為說法教度脫之，已便化去，如是無極。",
        "translation": "That doubtful person will then be surprised, and because he teaches the Dharma to liberate them, he'll be transformed and removed, which is limitless like this.",
        "source": "T15n0630_001:0456a07_1"
    },
    {
        "source_sentence": "「第二之願者：佛有大妙極深無量法門十二部要。",
        "translation": "The second vow: That the Buddha has a great, marvelous, extremely profound, and immeasurable dharma-gate of twelve essentials.",
        "source": "T15n0630_001:0456a09_0"
    },
    {
        "source_sentence": "佛滅度後，弟子各學一經、偏見一卷，不能遍洽，未解四說方便之等，",
        "translation": "After the parinirvāṇa of the Buddha, each disciple studied one scripture or one fascicle of partial views, but they could not discuss them in detail. They did not understand the four teachings on means of salvation, etc.",
        "source": "T15n0630_001:0456a10_1"
    },
    {
        "source_sentence": "便轉相難。",
        "translation": "It's then that the difficulty of characteristics will arise.",
        "source": "T15n0630_001:0456a11_2"
    },
    {
        "source_sentence": "或言虛、或言有，言是義當爾、是不當爾，真知法義者言辭相貌，不曉義者貪於名字，",
        "translation": "Some say it is false, some say it exists; some say it should be so and not so. Those who truly know the meaning of the doctrine speak words and forms, but those who do not understand the meaning are greedy with names.",
        "source": "T15n0630_001:0456a11_3"
    },
    {
        "source_sentence": "飾相貌狀如解達，便於眾會，兩諍興恚捨善就惡。",
        "translation": "Their adornments and appearances are like understanding, so they're assembled in the assembly, with two arguments that give rise to anger and abandon goodness and equanimity as well as evil.",
        "source": "T15n0630_001:0456a13_4"
    },
    {
        "source_sentence": "當是諍時，我當往現身變化，有踰於眾，令眾肅然，便為斷說，是別正者。",
        "translation": "At the time of this dispute, I will go and show my body to transcend the crowd. Enabling the crowd to be solemnized, I will explain it for them in a way that's different and correct.",
        "source": "T15n0630_001:0456a14_5"
    },
    {
        "source_sentence": "牽經開語，令俱歡喜，已便化去，如是無極。",
        "translation": "He led the sūtras and opened their mouths, made them all rejoice, and after they had been transformed away, he did so without limit.",
        "source": "T15n0630_001:0456a16_6"
    },
    {
        "source_sentence": "「第三之願者：佛滅度後，俗人外智之士，入佛弟子大眾中，弟子論說法義，",
        "translation": "“Third vow: After the nirvana of buddhas, worldly wise people who are laymen and non-Buddhists will enter the assembly of Buddhist disciples to discuss the meaning of doctrine.",
        "source": "T15n0630_001:0456a17_7"
    },
    {
        "source_sentence": "言及眾道，分邪別正，差品高下，便言：『是道九十六種之中，佛為尊耶！",
        "translation": "They said, 'Among the ninety-six kinds of paths, is the Buddha the most venerable?'",
        "source": "T15n0630_001:0456a19_8"
    },
    {
        "source_sentence": "有四神足飛行變化，天上天下無如佛智者。』",
        "translation": "There are four miraculous powers that fly and transform, and there's nothing like the Buddha's wisdom in heaven or under heaven.'",
        "source": "T15n0630_001:0456a20_9"
    },
    {
        "source_sentence": "俗智之士生不覩佛，習於邪見，信小毀大，便語佛弟子言：『汝莫妄說，",
        "translation": "People of layman’s wisdom do not revile against the Buddha but hold wrong views. Believing in what is lesser and disparaging what is greater, they say to the Buddha’s disciples:",
        "source": "T15n0630_001:0456a21_10"
    },
    {
        "source_sentence": "云佛神足飛行變化，先古以來，人之品類，無有此也。",
        "translation": "It's called the Buddha's miraculous power of flying and transforming, which hasn't existed in any human species since ancient times.",
        "source": "T15n0630_001:0456a23_11"
    },
    {
        "source_sentence": "誠不實言。』",
        "translation": "It's really not true words.'",
        "source": "T15n0630_001:0456a24_12"
    },
    {
        "source_sentence": "當此之時，我便化作佛身相，示諸種好，現于神足，經行空中，身出火水，",
        "translation": "At that moment, I magically produced the marks of a buddha-body. Showing various good signs, I manifested my supernormal powers and flew up and down in the sky, emanating fire and water from my body.",
        "source": "T15n0630_001:0456a24_13"
    },
    {
        "source_sentence": "令諸俗人、外智之士肅然而驚，乃知威神之化。",
        "translation": "He caused the laity and non-Buddhist scholars to be solemnly frightened, knowing that he was being transformed by his authoritative power.",
        "source": "T15n0630_001:0456a26_14"
    },
    {
        "source_sentence": "以為說法，授以正戒，畢乃化去，如是無極。",
        "translation": "He teaches the Dharma and bestows the right precepts, and then he's transformed away after that, thus without limit.",
        "source": "T15n0630_001:0456a27_15"
    },
    {
        "source_sentence": "「第四之願者：若人讀誦佛經，獨在野室，若在山間，或於大國。",
        "translation": "The fourth vow: If someone recites the Buddha's sūtras, they'll be alone in a wilderness room or on a mountain or in a large country.",
        "source": "T15n0630_001:0456a28_16"
    },
    {
        "source_sentence": "尊姓長者，及與人民，無有師法，或師不明，頑無所問，心用疑網。",
        "translation": "Venerable householders and the people have no teacher or teacher, or they don't know it, are stubbornly without questions, and use a web of doubt in their minds.",
        "source": "T15n0630_001:0456a29_17"
    },
    {
        "source_sentence": "我化作道人，被服往到其所，句句為解，本末分了，疑意權開，令入微妙而無疑難。",
        "translation": "I transform myself into a practitioner of the Way, and when I'm subdued, I go to them, explaining each phrase in detail, understanding the beginning and end, opening up doubts and thoughts so that they enter subtlety without any doubt or difficulty.",
        "source": "T15n0630_001:0456b02_18"
    },
    {
        "source_sentence": "已便化去，如是無極。",
        "translation": "After that, they'll be transformed away, and so forth, without limit.",
        "source": "T15n0630_001:0456b04_19"
    },
    {
        "source_sentence": "「第五之願者：所生國處，常遇見佛。",
        "translation": "The fifth vow: Wherever one is born, always meet and see the Buddha.",
        "source": "T15n0630_001:0456b04_20"
    },
    {
        "source_sentence": "佛滅度後，弟子立廟、圖像、佛形，并設講堂，論議經法。",
        "translation": "After the parinirvāṇa of the Buddha, the disciples built temples, images, and the forms of the Buddha. They also set up lecture halls to discuss scriptures and doctrines.",
        "source": "T15n0630_001:0456b05_21"
    },
    {
        "source_sentence": "若俗之人，開學小慧，縛在四倒。",
        "translation": "If a layman opens up the lesser wisdom of training, he's bound by the four errors.",
        "source": "T15n0630_001:0456b06_22"
    },
    {
        "source_sentence": "聞佛弟子說度世法生死之要，便往難却，不諒真正，謗訕啤呰，貪名求勝，",
        "translation": "Having heard that the disciples of the Buddha taught the essentials of transmundane dharmas, transcending birth and death, it became difficult to get rid of them. They did not understand their true essence, slandered Buddhist doctrines, coveted fame and reputation, and sought superiority.",
        "source": "T15n0630_001:0456b07_23"
    },
    {
        "source_sentence": "或加悁恚，欲往壞敗，陵訾毀蔑，卑易弱之，弊於正道，令不得行。",
        "translation": "Or they may harm others, wanting to defeat them. They attack and disparage others, or humiliate and weaken them, thereby doing evil to the right path and preventing them from following it.",
        "source": "T15n0630_001:0456b08_24"
    },
    {
        "source_sentence": "當爾之時，我便當化現佛身，更為說絕妙之法。",
        "translation": "At that point, I'll transform myself into the Buddha's body and explain the most marvelous teaching.",
        "source": "T15n0630_001:0456b10_25"
    },
    {
        "source_sentence": "現其生死殃福之應，將詣天上，令觀福舍；",
        "translation": "He manifested the consequences of birth and death, evil and blessedness, and was about to go up to heaven to see the abode of blessedness.",
        "source": "T15n0630_001:0456b11_26"
    },
    {
        "source_sentence": "牽到泥犁，使視罪報。",
        "translation": "He led them to a mud plow and told them to examine the consequences of their sins.",
        "source": "T15n0630_001:0456b12_27"
    },
    {
        "source_sentence": "法威以震之，智力以伏之，令即降伏，信就大道。",
        "translation": "They are shaken by the power of the Dharma and subdued by the power of knowledge, so that they will immediately be overcome and believe in the great path.",
        "source": "T15n0630_001:0456b12_28"
    },
    {
        "source_sentence": "已便化去，如是無極。",
        "translation": "After that, they'll be transformed away, and so forth, without limit.",
        "source": "T15n0630_001:0456b14_0"
    },
    {
        "source_sentence": "「我作明士乃至成佛，常當行此五願，無有休息。",
        "translation": "“As a sage, I will always practice these five vows until I become a buddha, without cease.",
        "source": "T15n0630_001:0456b14_1"
    },
    {
        "source_sentence": "願天尊以大恩之福，覆祐我等，令得所志。」",
        "translation": "May the Bhagavān bless us with great kindness and merit, covering us so that we'll attain what we want.",
        "source": "T15n0630_001:0456b15_2"
    },
    {
        "source_sentence": "於是佛言：「善哉願也！",
        "translation": "The Buddha then said, Good, my wish!",
        "source": "T15n0630_001:0456b16_3"
    },
    {
        "source_sentence": "斯成明士，所當志念，從今已往，必得不失。",
        "translation": "This accomplishes the thought that a learned person should have, and from now on, he'll surely attain it without losing it.",
        "source": "T15n0630_001:0456b16_4"
    },
    {
        "source_sentence": "但當常護其行，莫令毀漏。",
        "translation": "They should always guard their conduct and not allow it to be discredited.",
        "source": "T15n0630_001:0456b17_5"
    },
    {
        "source_sentence": "勤率一切，疾獲爾志。」",
        "translation": "I'll diligently lead all of them, and I'll quickly attain your intention.",
        "source": "T15n0630_001:0456b18_6"
    },
    {
        "source_sentence": "「意大興願首，　　化惑以此五；",
        "translation": "At the head of the great aspiration for enlightenment, there are these five:",
        "source": "T15n0630_001:0456b18_7"
    },
    {
        "source_sentence": "　當成無央數，　　疑者得入道。",
        "translation": "They will become incalculable, and those who doubt them will attain the path.",
        "source": "T15n0630_001:0456b18_7"
    },
    {
        "source_sentence": "　此德無有量，　　為眾行之英；",
        "translation": "These virtues are immeasurable, For the excellence of all practices.",
        "source": "T15n0630_001:0456b18_7"
    },
    {
        "source_sentence": "　若人聞是願，　　疑網永除亡。",
        "translation": "If someone hears this vow, the web of doubt will be permanently removed.",
        "source": "T15n0630_001:0456b18_7"
    },
    {
        "source_sentence": "　五願為佛地，　　所伏合道化；",
        "translation": "The five vows are the buddha-stage, wherein one subdues and unites enlightenment.",
        "source": "T15n0630_001:0456b18_7"
    },
    {
        "source_sentence": "　大慧無過是，　　此願人中上。",
        "translation": "Great wisdom is not wrong: This vow is for the highest among humans.",
        "source": "T15n0630_001:0456b18_7"
    },
    {
        "source_sentence": "　五百諸賢士，　　啟願少等雙；",
        "translation": "Five hundred sages and wise men, fewer than the same number of enlightening beings Who had undertaken these vows, were present.",
        "source": "T15n0630_001:0456b18_7"
    },
    {
        "source_sentence": "　後生得不失，　　一切受福慶。」",
        "translation": "Later generations attain it without losing it, and all are blessed.",
        "source": "T15n0630_001:0456b18_7"
    },
    {
        "source_sentence": "佛時歎曰：佛謂諸賢士一切在坐者：「是法真諦，宜善奉行，當以成具為本，",
        "translation": "The Buddha then spoke in praise, saying: The Buddha said to all the venerable ones who were seated: This doctrine is so true as to be well-understood and practiced. It should be regarded as the foundation of enlightenment.",
        "source": "T15n0630_001:0456b18_7"
    },
    {
        "source_sentence": "不以虛言、綺語為應法也。",
        "translation": "They don't regard false speech and fancy speech as the proper teaching.",
        "source": "T15n0630_001:0456b29_8"
    },
    {
        "source_sentence": "當忍而不為惡，若在空閑及於大眾尊卑之處，內制其心，令如戒法，不以閑讌而犯漏行；",
        "translation": "They should tolerate and not do evil. If they are in a quiet place or among the most venerable and inferior members of the sangha, they should control their minds internally so as to observe the precepts without indulging in idleness and violating immoral behavior.",
        "source": "T15n0630_001:0456c01_9"
    },
    {
        "source_sentence": "不於眾會而自大；",
        "translation": "They do not exalt themselves in the assemblies.",
        "source": "T15n0630_001:0456c03_10"
    },
    {
        "source_sentence": "不用尊顯而驕貴；",
        "translation": "They do not need to be honored or exalted and yet arrogant.",
        "source": "T15n0630_001:0456c03_11"
    },
    {
        "source_sentence": "不以卑弱而轉隨；",
        "translation": "They do not follow others because of their inferiority or weakness.",
        "source": "T15n0630_001:0456c03_12"
    },
    {
        "source_sentence": "不慚善、不慚惡；",
        "translation": "They are not ashamed of what is good and not ashamed of what is evil.",
        "source": "T15n0630_001:0456c04_13"
    },
    {
        "source_sentence": "不種無益之事；",
        "translation": "They do not plant useless things.",
        "source": "T15n0630_001:0456c04_14"
    },
    {
        "source_sentence": "心如正法無有搖却；",
        "translation": "Their minds are thus following the true teaching, with no wavering.",
        "source": "T15n0630_001:0456c05_15"
    },
    {
        "source_sentence": "不作增減之念也。",
        "translation": "They don't think of increase and decrease.",
        "source": "T15n0630_001:0456c05_16"
    },
    {
        "source_sentence": "如此明士，善根五願必獲爾志，疾成至佛。」",
        "translation": "Such a man of insight, the five vows of good roots will surely attain this intention and quickly become a buddha.",
        "source": "T15n0630_001:0456c05_17"
    },
    {
        "source_sentence": "是時，無穢王明士避坐長跪，啟天尊曰：「願佛今日，現是成具光明定意威神，",
        "translation": "At that moment, the wise monk King Mucilinda sat cross-legged and knelt down. He said to the heavenly gods: O Buddha! Today I pray that this mighty one may become endowed with the supernatural power of concentration consisting of illuminating all living beings’ minds capable of producing light.",
        "source": "T15n0630_001:0456c06_18"
    },
    {
        "source_sentence": "令此眾會見之悅也喜樂，皆當發意立此德本，未成者成，未度者度。」",
        "translation": "To cause this assembly to be delighted and joyous when they see it, they should all give rise to the intention to establish this root of virtue, which is accomplished by those who haven't done so and liberated by those who haven't yet liberated.",
        "source": "T15n0630_001:0456c08_19"
    },
    {
        "source_sentence": "於時，坐中有明士名大力普平。",
        "translation": "At the time, there was a bright man in his seat named Vaiśravaṇa Samantanetra.",
        "source": "T15n0630_001:0456c10_20"
    },
    {
        "source_sentence": "佛讚大力普平：「現是成具光明定意威神。」",
        "translation": "The Buddha praised the great power of Samantabhadra, Now, this is the authoritative spirit of accomplishing light and concentration.",
        "source": "T15n0630_001:0456c10_21"
    },
    {
        "source_sentence": "即時受教，便於其坐而不起動，因入慧定神靜之意，如彈指頃，三千大千之國，",
        "translation": "He immediately accepted the teaching and sat down without rising from his seat. Because he had entered wisdom, concentration, and supernormal stillness of mind, as if he were snapping his fingers, in an instant there would be three thousand great chiliocosms:",
        "source": "T15n0630_001:0456c11_22"
    },
    {
        "source_sentence": "諸小山、大山、大障山、小障山，悉滅不現，一切普平，紺琉璃色。",
        "translation": "All the small mountains, large mountains, great obstacle mountains, and small obstacle mountains all cease and don't show up, and everything is completely level with the color of purple lapis lazuli.",
        "source": "T15n0630_001:0456c13_23"
    },
    {
        "source_sentence": "復令十方他佛國土，皆通相見、相去如一尋所也。",
        "translation": "Furthermore, it causes other buddha lands in the ten directions to see each other and leave each other as if they were a place of one search.",
        "source": "T15n0630_001:0456c15_24"
    },
    {
        "source_sentence": "觀十方諸佛坐處，譬如仰觀星宿不可計算。",
        "translation": "Observing the places where the buddhas of the ten directions are seated is like observing the stars and constellations upright without calculation.",
        "source": "T15n0630_001:0456c16_25"
    },
    {
        "source_sentence": "復以右手舉，十方諸佛三千大千國土，已著一指上之、下之，如舉一塵。",
        "translation": "Again, he lifts it with his right hand, and the buddhas of the 3,000 great thousand lands in the ten directions have touched it with one finger and lowered it like holding up a speck of dust.",
        "source": "T15n0630_001:0456c17_26"
    },
    {
        "source_sentence": "其中人民，蠕動之類，無有知之者，而有驚怖之念也。",
        "translation": "The people there are such wriggling creatures that no one knows them, but they have fearful thoughts.",
        "source": "T15n0630_001:0456c18_27"
    },
    {
        "source_sentence": "於是，復以一切十方諸佛之國，以內方圓一尺之器中，而不逼迮。",
        "translation": "Then, he also took all the buddha-lands of the buddhas of the ten directions and placed them inside a container one foot in each direction without crowding it.",
        "source": "T15n0630_001:0456c20_0"
    },
    {
        "source_sentence": "現變畢竟，[火*霍]如常故。",
        "translation": "The present transformation is ultimately [fire*ho] because it's as usual.",
        "source": "T15n0630_001:0456c21_1"
    },
    {
        "source_sentence": "其在坐者，皆見如斯，悉而驚欣踊喜，發於大願，其心皆在無上獨尊之地。",
        "translation": "Everyone in the seat saw this. Surprised and overjoyed, they made a great vow that their minds would all be on the ground of the supreme lonely honored one.",
        "source": "T15n0630_001:0456c21_2"
    },
    {
        "source_sentence": "八百萬明士及諸尊天，得安樂慧定。",
        "translation": "Eight million scholars and honored gods attained the concentration of peaceful wisdom.",
        "source": "T15n0630_001:0456c23_3"
    },
    {
        "source_sentence": "復六十萬人，悉入通解法門。",
        "translation": "There were also another sixty million who had all entered the teaching of penetration and understanding.",
        "source": "T15n0630_001:0456c24_4"
    },
    {
        "source_sentence": "復六萬八千人，得是成具光明定意。",
        "translation": "Sixty-eight thousand more people attained this concentration, which accomplished the concentration of illumination.",
        "source": "T15n0630_001:0456c25_5"
    },
    {
        "source_sentence": "十方諸來明士莫不歡喜。",
        "translation": "The wise people who came from the ten directions all rejoiced.",
        "source": "T15n0630_001:0456c25_6"
    },
    {
        "source_sentence": "佛語善明：「一切人所以不學是成具光明定意者，為住於惑故也。",
        "translation": "The Buddha said to Shanming, All people who don't train are those who have perfected the concentration of illumination because they abide in confusion.",
        "source": "T15n0630_001:0456c26_7"
    },
    {
        "source_sentence": "計有以有便著染黑冥，以在著染，譬猶冥夜復閉目行，便無所見。",
        "translation": "It's like a dark night when you close your eyes and walk, and then you don't see anything.",
        "source": "T15n0630_001:0456c27_8"
    },
    {
        "source_sentence": "無所見者，謂今所受身善、惡，目前之所造也。",
        "translation": "Those who don't see anything refer to the good and bad bodily sensations that are now experienced, which are created in the present.",
        "source": "T15n0630_001:0456c29_9"
    },
    {
        "source_sentence": "「以不覺見故，便吁嗟啼泣，謂今為善反受惡罪，或先為惡反受善福。",
        "translation": "“Because they don’t perceive and see, they cry out in shame and weep, saying that they are now subject to bad sins because of goodness or to good fortune because of badness.",
        "source": "T15n0630_001:0457a02_0"
    },
    {
        "source_sentence": "不曉思惟此本，便結在疑網，已在疑網，於可學便不欲學，可進不欲進，",
        "translation": "They don’t understand and contemplate this text, so they are bound up in a web of doubt. Having been bound up in a web of doubt, they don’t want to learn what can be learned, and they may or may not advance.",
        "source": "T15n0630_001:0457a03_1"
    },
    {
        "source_sentence": "可入不欲入，是故忘失是定，在於哭悲惶戀，累劫無終，已來往無休息，",
        "translation": "They enter and do not want to enter. Therefore, forgetfulness is the state of absorption in which there is neither entry nor non-entry. For many kalpas they wail in distress and grief without end, going and coming ceaselessly.",
        "source": "T15n0630_001:0457a05_2"
    },
    {
        "source_sentence": "名曰勞苦行也。",
        "translation": "It's called the painful practice of labor.",
        "source": "T15n0630_001:0457a06_3"
    },
    {
        "source_sentence": "「哀哉！",
        "translation": "“What a pity!",
        "source": "T15n0630_001:0457a07_4"
    },
    {
        "source_sentence": "善明！",
        "translation": "Sunetra!",
        "source": "T15n0630_001:0457a07_5"
    },
    {
        "source_sentence": "此章可像故，佛出世正為愚迷人故，其有人學是正定者，彼所感念，生死之煩皆疾得除；",
        "translation": "Because this chapter is an example, because the Buddha appeared in the world precisely for the sake of foolish and deluded people. Some people who study right concentration will be freed from the afflictions of birth and death as soon as they are touched by it.",
        "source": "T15n0630_001:0457a07_6"
    },
    {
        "source_sentence": "復能訓導一切諸著有者。",
        "translation": "He's also able to instruct all those who are attached to existence.",
        "source": "T15n0630_001:0457a09_7"
    },
    {
        "source_sentence": "善明！",
        "translation": "Sunetra!",
        "source": "T15n0630_001:0457a09_8"
    },
    {
        "source_sentence": "常當思惟空法，莫住惑誤處也。」",
        "translation": "You should always contemplate the teaching of emptiness, and don't abide in the place of confusion.",
        "source": "T15n0630_001:0457a10_9"
    },
    {
        "source_sentence": "善明白佛言：「若有賢士，生於種姓之家，統領縣官位率國政，心多煩亂不得專一，",
        "translation": "Sunetra Buddha said, Suppose there's a good man born in a family of castes who governs the county officials and leads state affairs, but his mind is often confused and he can't concentrate on one thing.",
        "source": "T15n0630_001:0457a10_10"
    },
    {
        "source_sentence": "欲學是定，當奈何乎？」",
        "translation": "What's the point of wanting to train in this concentration?",
        "source": "T15n0630_001:0457a12_11"
    },
    {
        "source_sentence": "佛言：「賢士生有縣官之因緣，或在不安隱處，欲學是定，不得巡心者，",
        "translation": "The Buddha said, Good men, there are causes and conditions that give rise to magistrates, or they may be in an unsettled place. Those who want to study this concentration won't be allowed to visit their minds.",
        "source": "T15n0630_001:0457a13_12"
    },
    {
        "source_sentence": "當書是經卷供養。",
        "translation": "You should write this sūtra scroll as an offering.",
        "source": "T15n0630_001:0457a14_13"
    },
    {
        "source_sentence": "設坐閣燒香敬禮，朝中人定，不失三時，頭面為禮，懇惻至心。",
        "translation": "He set up his seat in the pavilion and burned incense to pay homage to him. In the morning, when the people were engaged in meditation without missing the three watches, he greeted them by bowing his forehead and face with sincerity of mind.",
        "source": "T15n0630_001:0457a15_14"
    },
    {
        "source_sentence": "又當加行十五事：一者不殺；",
        "translation": "You should also perform fifteen things:",
        "source": "T15n0630_001:0457a16_15"
    },
    {
        "source_sentence": "二者活生；",
        "translation": "The second is rebirth.",
        "source": "T15n0630_001:0457a17_16"
    },
    {
        "source_sentence": "三者不妄取；",
        "translation": "The third is that they do not grasp things falsely.",
        "source": "T15n0630_001:0457a17_17"
    },
    {
        "source_sentence": "四者而恩施人；",
        "translation": "The fourth is to give kindness to others.",
        "source": "T15n0630_001:0457a17_18"
    },
    {
        "source_sentence": "五者不婬；",
        "translation": "The fifth is not coarse.",
        "source": "T15n0630_001:0457a18_19"
    },
    {
        "source_sentence": "六者遠色聲；",
        "translation": "The sixth is to be far removed from form and sound.",
        "source": "T15n0630_001:0457a18_20"
    },
    {
        "source_sentence": "七者不欺不調；",
        "translation": "The seventh is neither deceitful nor unruly.",
        "source": "T15n0630_001:0457a18_21"
    },
    {
        "source_sentence": "八者而忠言善諫；",
        "translation": "The eighth is to be faithful, speak well, and admonish.",
        "source": "T15n0630_001:0457a19_22"
    },
    {
        "source_sentence": "九者不醉；",
        "translation": "The ninth is not getting drunk.",
        "source": "T15n0630_001:0457a19_23"
    },
    {
        "source_sentence": "十者不以酒為惠施；",
        "translation": "The tenth is that they give generously without taking wine as food.",
        "source": "T15n0630_001:0457a19_24"
    },
    {
        "source_sentence": "十一者擁護羸劣不令抂撗；",
        "translation": "The eleventh is to embrace the weak and not allow them to be oppressed.",
        "source": "T15n0630_001:0457a20_25"
    },
    {
        "source_sentence": "十二者其所臨生加以仁心，各使得所；",
        "translation": "(12) The kindnesses of the sentient beings to whom they are directed, each enabling them to do so.",
        "source": "T15n0630_001:0457a20_26"
    },
    {
        "source_sentence": "十三者寬弘大受，包化不肖，示以正教；",
        "translation": "The thirteenth was the great undertaking of universal enlightenment, embracing and transforming unworthy people and showing them right doctrine.",
        "source": "T15n0630_001:0457a21_27"
    },
    {
        "source_sentence": "十四者其來歸於己，有所陳訴，必而正平應於法律，令無枉慍；",
        "translation": "The fourteenth is that those who come to the assembly should report any grievances or criticisms to themselves. They should always be impartial and in accordance with the law, so as not to mislead others.",
        "source": "T15n0630_001:0457a22_28"
    },
    {
        "source_sentence": "十五者以善勸上，悉施於民，終始無懈。",
        "translation": "Fifteenth, he bestows all his good encouragement on the people without laziness from beginning to end.",
        "source": "T15n0630_001:0457a24_29"
    },
    {
        "source_sentence": "行是十五戒，莫得休廢，此亦應定意之教法，必得不失，後長解脫也。」",
        "translation": "Practice these fifteen precepts, and don't let them be abandoned; this should also be the teaching of concentration that will surely lead to attainment and not loss, and which will lead to liberation in the future.",
        "source": "T15n0630_001:0457a24_30"
    },
    {
        "source_sentence": "善明白佛言：「若有凡人為宿罪所牽，在不安隱處，拘逼制礙，有志於是成具光明定法，",
        "translation": "Śubhavyūha Buddha said, Suppose there are ordinary people who have been dragged by their past sins and are in an unsettled place, oppressed and restrained, with the intention of thus perfecting the concentration method of illumination.",
        "source": "T15n0630_001:0457a27_0"
    },
    {
        "source_sentence": "而不得從心意，欲學是尊定，當奈何乎？」",
        "translation": "What should I do if I want to train in this venerable concentration without following my heart and mind?",
        "source": "T15n0630_001:0457a28_1"
    },
    {
        "source_sentence": "佛言：「善明！",
        "translation": "The Buddha said, Sunetra!",
        "source": "T15n0630_001:0457a29_2"
    },
    {
        "source_sentence": "凡人至心欲學者，亦如上說。",
        "translation": "Ordinary people who sincerely want to learn are likewise as explained above.",
        "source": "T15n0630_001:0457b01_3"
    },
    {
        "source_sentence": "善書是經卷，為設坐閣，燒香敬禮，不失三時，當復加行十事：一者修奉五戒，",
        "translation": "You should write this sūtra in a good hand and set up a pavilion for its seat. Burning incense, you should venerate it with reverence without losing the three seasons. Again, you should perform ten things:",
        "source": "T15n0630_001:0457b01_4"
    },
    {
        "source_sentence": "無有缺犯；",
        "translation": "There is no lack of violation.",
        "source": "T15n0630_001:0457b03_5"
    },
    {
        "source_sentence": "二者當以閑暇，稍稍誦行定意法文；",
        "translation": "The second is that, in their leisure time, they should recite and practice the teaching of mental concentration for a little while.",
        "source": "T15n0630_001:0457b03_6"
    },
    {
        "source_sentence": "三者雖執事作，內心誦習，使不忘誤；",
        "translation": "The third is that even though they cling to action, they practice it internally and recite it without forgetting it.",
        "source": "T15n0630_001:0457b04_7"
    },
    {
        "source_sentence": "四者在勤勞屈苦之地，當知是宿行所為，而無慍恚；",
        "translation": "The fourth is that in the land of exertion, torpor, and suffering they should be known to have done what they did in the past but not suffer from hunger or thirst.",
        "source": "T15n0630_001:0457b05_8"
    },
    {
        "source_sentence": "五者若居地無佛形像，無離惡眾，心常存憶，向四方作禮，如對佛無異；",
        "translation": "The fifth is that if one dwells in the earth without images of buddhas and without being separated from evil hosts, his mind always retains recollection. He faces the four directions to pay homage just as he did to the Buddha, without any difference.",
        "source": "T15n0630_001:0457b06_9"
    },
    {
        "source_sentence": "六者謹勅柔軟，調和心意，下於一切；",
        "translation": "The sixth is to be compassionate and gentle, harmonious in mind and thought, inferior to all others.",
        "source": "T15n0630_001:0457b08_10"
    },
    {
        "source_sentence": "七者所作盡節而無虛飾；",
        "translation": "The seventh is that they do what should be done in all seasons without false decorations.",
        "source": "T15n0630_001:0457b08_11"
    },
    {
        "source_sentence": "八者饒作等侶，不愛筋力；",
        "translation": "The eighth is the principle of equanimity, not clinging to fetters or powers.",
        "source": "T15n0630_001:0457b09_12"
    },
    {
        "source_sentence": "九者若見老、羸、疾病、瘦耄，傷念扶護，至心不飾；",
        "translation": "The ninth is that when they see old age, weakness, sickness, and thinning out, they grieve for them and protect them. They are not adorned with affection.",
        "source": "T15n0630_001:0457b10_13"
    },
    {
        "source_sentence": "十者常歸命三尊而不怠忘；",
        "translation": "The tenth is that they always turn to the Three Revered Ones and never forget them.",
        "source": "T15n0630_001:0457b11_14"
    },
    {
        "source_sentence": "是為十事。",
        "translation": "These are the ten things.",
        "source": "T15n0630_001:0457b11_15"
    },
    {
        "source_sentence": "凡人雖在勤苦拘礙之處，當行此十事，莫毀、莫懈，亦應定意教法，世世不失，",
        "translation": "Ordinary people, even if they are hindered by hardship and suffering, should perform these ten kinds of duties without disparaging or lazily. They should also teach the Dharma with a concentrated mind so that it will not be lost from generation to generation.",
        "source": "T15n0630_001:0457b12_16"
    },
    {
        "source_sentence": "後長解脫也。」",
        "translation": "It's followed by long liberation.",
        "source": "T15n0630_001:0457b13_17"
    },
    {
        "source_sentence": "善明白佛言：「若有賢女人！",
        "translation": "The well-understood Buddha said, Suppose there's a good woman!",
        "source": "T15n0630_001:0457b14_18"
    },
    {
        "source_sentence": "姻種姓之家，或有居事之業因緣，不得捨離，欲學是成具光明定意，當奈何乎？」",
        "translation": "A house belonging to a clan or family may have the causes and conditions for their livelihood, but they can't abandon it; what should they do if they want to train in order to fulfill the concentration of illumination?",
        "source": "T15n0630_001:0457b14_19"
    },
    {
        "source_sentence": "佛言：「善明！",
        "translation": "The Buddha said, Sunetra!",
        "source": "T15n0630_001:0457b16_20"
    },
    {
        "source_sentence": "女人有居事因緣，志欲學是正定者，亦如上說。",
        "translation": "A woman who has the causes and conditions for living and wants to train is in right concentration, as explained above.",
        "source": "T15n0630_001:0457b16_21"
    },
    {
        "source_sentence": "善書是經、設立棚閣、供施幡花、燒香敬禮、頭腦著地，鷄鳴、日中、人定三時，",
        "translation": "Good writing is the scripture, setting up a shelter and pavilion, offering banners and flowers, burning incense and paying homage, bowing their heads and feet to the ground, roaring fowls, midday and at the three time periods of human concentration.",
        "source": "T15n0630_001:0457b17_22"
    },
    {
        "source_sentence": "為禮不失、至心懇惻、常願離於女人身，心絕愛欲，如是無懈。",
        "translation": "In order to pay homage without losing it, with sincerity and affection, he always wishes to part with the woman's body, and his mind stops craving and desire, so he doesn't lazy.",
        "source": "T15n0630_001:0457b19_23"
    },
    {
        "source_sentence": "又當加行二十事：一者持上賢士十五戒，中士十戒，而不毀缺；",
        "translation": "You should also apply yourself in twenty ways. First, you should uphold the fifteen precepts of the wise and observe the ten precepts of the middling without disparaging them.",
        "source": "T15n0630_001:0457b20_24"
    },
    {
        "source_sentence": "二者捐於妬心；",
        "translation": "The second is to give up one’s thoughts of jealousy.",
        "source": "T15n0630_001:0457b22_25"
    },
    {
        "source_sentence": "三者減於鐶釧之好；",
        "translation": "The third is that they are inferior to the beauty of garland and jewelry.",
        "source": "T15n0630_001:0457b22_26"
    },
    {
        "source_sentence": "四者除於脂粉之飾；",
        "translation": "The fourth is to remove the embellishments of fat and flour.",
        "source": "T15n0630_001:0457b23_0"
    },
    {
        "source_sentence": "五者無有恣態；",
        "translation": "The fifth is the absence of unrestraint.",
        "source": "T15n0630_001:0457b23_1"
    },
    {
        "source_sentence": "六者衣服真純而不奢麗；",
        "translation": "The sixth is that their clothes are genuine but not luxurious.",
        "source": "T15n0630_001:0457b23_2"
    },
    {
        "source_sentence": "七者育養室內，以慈心相向；",
        "translation": "The seventh is to nourish the living quarters, serving one another with compassion.",
        "source": "T15n0630_001:0457b24_3"
    },
    {
        "source_sentence": "八者軟教奴婢，不加楚痛；",
        "translation": "The eighth is to gently teach their male and female servants without inflicting pain or suffering.",
        "source": "T15n0630_001:0457b25_4"
    },
    {
        "source_sentence": "九者攝護孤獨，衣食平等；",
        "translation": "The ninth protects the orphaned and the homeless, with equality of food and clothing.",
        "source": "T15n0630_001:0457b25_5"
    },
    {
        "source_sentence": "十者孝事其上，仁接下小；",
        "translation": "Tenth, filial piety serves those above and kindness serves those below.",
        "source": "T15n0630_001:0457b26_6"
    },
    {
        "source_sentence": "十一者下聲下意，當自剋責；",
        "translation": "Eleventh, one should reprimand oneself for what is unsolicited by voice or thought.",
        "source": "T15n0630_001:0457b26_7"
    },
    {
        "source_sentence": "十二者謙卑誡順，常知慚愧；",
        "translation": "The twelfth is to humbly admonish and obey, always knowing shame.",
        "source": "T15n0630_001:0457b27_8"
    },
    {
        "source_sentence": "十三者所作為者，手執其事，清淨香潔，施於公姑、父母，供養三尊，",
        "translation": "The thirteenth is for those who do evil deeds, such as holding things in one’s hands that are pure and fragrant, offering them to their aunt, father-in-law, mother-in-law, and other members of the sangha.",
        "source": "T15n0630_001:0457b28_9"
    },
    {
        "source_sentence": "及與師友；",
        "translation": "and teachers and friends.",
        "source": "T15n0630_001:0457b29_10"
    },
    {
        "source_sentence": "十四者親疎善惡，慈而等之，無此四念，差別之相；",
        "translation": "The fourteenth is to associate with good and equanimity, being compassionate and impartial. They do not have these four kinds of thought as distinctive characteristics.",
        "source": "T15n0630_001:0457b29_11"
    },
    {
        "source_sentence": "十五者若在私室，空閑無人，心不念欲；",
        "translation": "(15) Fifteenth, when one is in a private chamber with no one else living in it, the mind is not attached to sensual desires.",
        "source": "T15n0630_001:0457c02_12"
    },
    {
        "source_sentence": "十六者端慇精一，心常在法；",
        "translation": "The sixteenth is the unity of deportment and essence, with mind always centered on doctrine.",
        "source": "T15n0630_001:0457c02_13"
    },
    {
        "source_sentence": "十七者所欲施作，報於所尊，然後乃行；",
        "translation": "The seventeenth is the practice of giving whatever one wishes to be given, repaying it to the venerated one and then doing so.",
        "source": "T15n0630_001:0457c03_14"
    },
    {
        "source_sentence": "十八者無自專之心，常以卑順勅誡其身，令如正法；",
        "translation": "The eighteenth is the absence of self-focused mind. They always admonish their bodies by means of inferior commands, so that they may follow the true teaching.",
        "source": "T15n0630_001:0457c04_15"
    },
    {
        "source_sentence": "十九者終不於牆垣闚看，有邪僻之念；",
        "translation": "(19) The nineteenth principle is that one should never have thoughts of wickedness or seclusion in the walls.",
        "source": "T15n0630_001:0457c05_16"
    },
    {
        "source_sentence": "二十者坐起言語，終不調戲，常應法律，而無輕失。",
        "translation": "Twenty, they sat up and raised their voices to speak without offending or disturbing others. They always complied with the law but did not neglect it.",
        "source": "T15n0630_001:0457c06_17"
    },
    {
        "source_sentence": "是為賢女人居家行正定之法。",
        "translation": "This is the method for a good woman to practice right concentration at home.",
        "source": "T15n0630_001:0457c07_18"
    },
    {
        "source_sentence": "如此莫漏，功德漸滿，後長解脫也。」",
        "translation": "If you don't do so, your merit will gradually be complete and you'll be liberated for a long time afterward.",
        "source": "T15n0630_001:0457c08_19"
    },
    {
        "source_sentence": "善明白佛言：「若有小姓凡女人，性樂賢行者，家貧困厄，執事勞苦，",
        "translation": "Shanshuo fo said, Suppose there are small-caste ordinary women with good intentions and good conduct who live in poverty at home and suffer from the hardship of doing business.",
        "source": "T15n0630_001:0457c09_20"
    },
    {
        "source_sentence": "憂在衣食，不得自在，內厭殃罪，欲疾解脫，聞是成具光明尊定清淨之法，",
        "translation": "Their worries are about food and clothing, unable to control themselves. They internally resent evil deeds and blameworthy sins, wishing to be quickly liberated.",
        "source": "T15n0630_001:0457c10_21"
    },
    {
        "source_sentence": "至心欲行，當云何乎？」",
        "translation": "What should I do when I want to practice with sincerity?",
        "source": "T15n0630_001:0457c12_22"
    },
    {
        "source_sentence": "佛言：「善明！",
        "translation": "The Buddha said, Sunetra!",
        "source": "T15n0630_001:0457c12_23"
    },
    {
        "source_sentence": "如此凡女人輩，在於貧困，欲學是定，雖不能得具行誡法者，且當修奉十事，",
        "translation": "Such ordinary women, who are in poverty and want to learn this concentration, even though they can't fully practice the precepts, should cultivate ten things.",
        "source": "T15n0630_001:0457c13_0"
    },
    {
        "source_sentence": "莫作違捨。",
        "translation": "Don't act contrary to equanimity.",
        "source": "T15n0630_001:0457c14_1"
    },
    {
        "source_sentence": "一者親就賢友，從受五戒，行不毀缺；",
        "translation": "The first is to receive the five kinds of precepts directly from spiritual benefactors, without neglecting or disparaging them.",
        "source": "T15n0630_001:0457c15_0"
    },
    {
        "source_sentence": "二者雖饑雖寒，忍不殺盜，以自飽煖；",
        "translation": "The second is that they endure hunger and cold but not murder or steal in order to keep themselves supplied with warmth.",
        "source": "T15n0630_001:0457c15_1"
    },
    {
        "source_sentence": "三者雖獨居處，忍不邪婬，數諫心意；",
        "translation": "The third is that even though they live alone, they tolerate not engaging in immoral sexual misconduct and frequently remonstrate with others.",
        "source": "T15n0630_001:0457c16_2"
    },
    {
        "source_sentence": "四者雖貧，忍不欺怠，以求財賄；",
        "translation": "The fourth is that even though they may be poor, they tolerate not being deceitful and provide for their needs by means of property.",
        "source": "T15n0630_001:0457c17_3"
    },
    {
        "source_sentence": "五者於酒食倡伎，忍不觀戲；",
        "translation": "The fifth is that they tolerate drinking, eating, and gambling without indulging in it.",
        "source": "T15n0630_001:0457c18_4"
    },
    {
        "source_sentence": "六者尊行定法者，視之如佛；",
        "translation": "The sixth is that the venerable one who practices meditation looks upon him or her as a buddha.",
        "source": "T15n0630_001:0457c18_5"
    },
    {
        "source_sentence": "七者常行五善心：一為念施心，二為恭敬心，三為禮節心，四為下於一切心，",
        "translation": "The seventh is to always practice five wholesome states of mind: first, being mindful of generosity; second, being respectful; third, being courteous; and fourth, being inferior to all others.",
        "source": "T15n0630_001:0457c19_6"
    },
    {
        "source_sentence": "五為制伏眾態心；",
        "translation": "The fifth is to subdue the minds of all beings.",
        "source": "T15n0630_001:0457c21_7"
    },
    {
        "source_sentence": "八者雖在事作，心誦法文而無懈怠；",
        "translation": "The eighth is that although they are engaged in practical undertakings, they mentally recite the words of the Teaching without laziness.",
        "source": "T15n0630_001:0457c21_8"
    },
    {
        "source_sentence": "九者六齋入塔，禮拜三尊；",
        "translation": "The ninth is to enter a stupa on the six fast days and pay homage to the Three Revered Ones.",
        "source": "T15n0630_001:0457c22_9"
    },
    {
        "source_sentence": "十者雖無錢財以用布施，常身自掃灑塔地，以淨水漿，給與眾僧澡手洗浴，",
        "translation": "Tenth, even though they do not have money and possessions to give as alms, they always sweep the ground of their stupas with their own bodies, offer clean water and juice to the saṃgha, wash their hands and bathe them.",
        "source": "T15n0630_001:0457c23_0"
    },
    {
        "source_sentence": "以力為施，勤而不厭。",
        "translation": "He gives generously with his strength and doesn’t tire of it.",
        "source": "T15n0630_001:0457c24_1"
    },
    {
        "source_sentence": "是為凡女人在於貧困，而行是十事，不有懈怠，此則巍巍，生則值佛，",
        "translation": "“World-honored One, these are the ten norms for ordinary women in poverty who do these ten things without laziness. Here they become majestic and at birth they meet buddhas.",
        "source": "T15n0630_001:0457c25_2"
    },
    {
        "source_sentence": "常遇定法，後長解脫。」",
        "translation": "Always encountering the Dharma of concentration, he'll be liberated for a long time to come.",
        "source": "T15n0630_001:0457c26_3"
    },
    {
        "source_sentence": "佛言：「善明！",
        "translation": "The Buddha said, Sunetra!",
        "source": "T15n0630_001:0457c27_4"
    },
    {
        "source_sentence": "我所說賢女、凡人、貴姓賢女、凡姓女人、好賢行者，四品之行，誡法了了，",
        "translation": "I teach the Dharma to wise women, ordinary people, high-ranking wise women, middle-aged women, and those who are engaged in good deeds—the four kinds of conduct that admonish understanding of the teaching.",
        "source": "T15n0630_001:0457c27_5"
    },
    {
        "source_sentence": "其身履行無毀漏者，是之福祐難譬喻也。",
        "translation": "This is a metaphor of the difficulty of merit and forbearance when someone fulfills their body without disparaging contaminants.",
        "source": "T15n0630_001:0457c29_0"
    },
    {
        "source_sentence": "「善明！",
        "translation": "“O Sunetra!",
        "source": "T15n0630_001:0457c29_1"
    },
    {
        "source_sentence": "譬人以七寶滿是十方，上至二十八天，以用布施，百千劫不休不息。",
        "translation": "It's like a person who fills the ten directions with seven treasures and goes up to the twenty-eight heavens, which are used for generosity for hundreds of thousands of eons without stopping or ceasing.",
        "source": "T15n0630_001:0458a01_2"
    },
    {
        "source_sentence": "如彼四輩人，行成具光明定意四品法功德，出於彼布施福上巨億萬倍。",
        "translation": "Suppose those four groups of people who practice the accomplishment of the four qualities of the light, concentration, and mind are endowed with the merit of the four qualities of the Dharma, which amounts to a hundred million times greater than the merit of generosity.",
        "source": "T15n0630_001:0458a02_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0630_001:0458a04_4"
    },
    {
        "source_sentence": "夫福者有盡、有苦、有往來、有煩勞、有食飲；",
        "translation": "A Forest of Pearls from the Dharma Garden, Volume II The factors of merit have depletion, suffering, going and coming, trouble, food and drink.",
        "source": "T15n0630_001:0458a04_5"
    },
    {
        "source_sentence": "行是成具光明定意，則無此五也，寂然潔淨，一切盡滅，是曰最尊，故喻勝也。",
        "translation": "Practice is the accomplishment of the intention to illuminate and concentrate, but there are no these five; tranquility, purity, and the cessation of all things are said to be the most honored, so it's a metaphor for superiority.",
        "source": "T15n0630_001:0458a05_6"
    },
    {
        "source_sentence": "「善明！",
        "translation": "“O Sunetra!",
        "source": "T15n0630_001:0458a07_7"
    },
    {
        "source_sentence": "當布露是戒，令一切聞受持行之，此明士所當勤勸率也。」",
        "translation": "You should reveal these precepts so that they'll be heard, accepted, upheld, and practiced by everyone, and this wise man will diligently encourage them.",
        "source": "T15n0630_001:0458a07_8"
    },
    {
        "source_sentence": "佛告善明：「我滅度後，若有人行是成具光明定意，及書持經卷、供養作禮者，",
        "translation": "The Buddha told Shanming, After my nirvāṇa, if someone practices this concentration of accomplished illumination, writes, retains sūtras in rolls, makes offerings, and pays homage to them,",
        "source": "T15n0630_001:0458a08_9"
    },
    {
        "source_sentence": "當有十二大天神擁護之，令不抂撗，所在安隱，不為惡所中傷。",
        "translation": "There will be twelve great heavenly deities who will protect them, enabling them not to harm each other. They will be secure wherever they are and won’t be harmed by evil.",
        "source": "T15n0630_001:0458a10_10"
    },
    {
        "source_sentence": "今為汝說此諸神名字，其在厄難、水、火、盜賊、兵革，善誦行是經文，",
        "translation": "I will now tell you the names of these deities. Their lives are in distress, water, fire, thieves, and warfare. recite and practice them well.” This is the text of the sutra.",
        "source": "T15n0630_001:0458a11_11"
    },
    {
        "source_sentence": "不以怨厄故而廢置者，是十二天神，即當往護之，終不使橫殃。",
        "translation": "Those who don't abandon them because of enemies and misfortune are the twelve celestial spirits, who will go there to protect them and never cause unremitting disasters.",
        "source": "T15n0630_001:0458a13_12"
    },
    {
        "source_sentence": "佛無二言也，當廣宣告一切人，令誦習之。",
        "translation": "The Buddha has no dual words, so he will extensively proclaim it to all people and cause them to recite it.",
        "source": "T15n0630_001:0458a14_13"
    },
    {
        "source_sentence": "「有神名大護，　　復次神名福救；",
        "translation": "“There is a god named Great Protector, And another god named salvation through blessedness.",
        "source": "T15n0630_001:0458a16_0"
    },
    {
        "source_sentence": "　復次神名祐眾，　　復次神名不厄。",
        "translation": "Furthermore, the gods are called blessing the multitude, and furthermore, the gods are called not being troubled.",
        "source": "T15n0630_001:0458a17_0"
    },
    {
        "source_sentence": "　復次神名善將，　　復次神名光明；",
        "translation": "Furthermore, the gods are called generals of virtue; The other gods are called light beams.",
        "source": "T15n0630_001:0458a18_0"
    },
    {
        "source_sentence": "　復次神名道戒，　　復次神名拔苦。",
        "translation": "Furthermore, the name of the gods is the path and moral precept. Furthermore, the name of the gods is uprooting unsatisfactoriness.",
        "source": "T15n0630_001:0458a19_0"
    },
    {
        "source_sentence": "　復次神名大度，　　復次神名度厄；",
        "translation": "Furthermore, the name of the god is Mahāprajñāpāramitā. The name of the god saves those in distress.",
        "source": "T15n0630_001:0458a20_0"
    },
    {
        "source_sentence": "　復次神名安隱，　　復次神名普濟。」",
        "translation": "Furthermore, the gods are called peaceful, and furthermore, the gods are called universally liberating.",
        "source": "T15n0630_001:0458a21_0"
    },
    {
        "source_sentence": "佛告善明：「是十二神又有願於佛，當防護是持法者，行是成具光明定意法誡處，",
        "translation": "The Buddha told Kalyāṇa-jātika, These twelve deities also have another vow to the Buddha, which is to protect those who uphold the Dharma and practice it.",
        "source": "T15n0630_001:0458a22_0"
    },
    {
        "source_sentence": "當令有五清淨：一者為經所在高座常令清淨；",
        "translation": "You should make five kinds of purity:",
        "source": "T15n0630_001:0458a23_1"
    },
    {
        "source_sentence": "二者燒香掃地令清淨；",
        "translation": "The second is to burn incense and sweep the earth so that it becomes pure.",
        "source": "T15n0630_001:0458a24_2"
    },
    {
        "source_sentence": "三者衣服常清淨；",
        "translation": "The third is that their clothes are always pure.",
        "source": "T15n0630_001:0458a25_3"
    },
    {
        "source_sentence": "四者心、口、意常清淨；",
        "translation": "The fourth is that their minds, speech, and thought are always pure.",
        "source": "T15n0630_001:0458a25_4"
    },
    {
        "source_sentence": "五者讀是經時，先施清淨水，盥手、漱口常令清淨；",
        "translation": "The fifth is that when one recites this sutra, he should first offer pure water and always keep his hands and mouth clean.",
        "source": "T15n0630_001:0458a26_5"
    },
    {
        "source_sentence": "是為五也。」",
        "translation": "These are the five.",
        "source": "T15n0630_001:0458a27_6"
    },
    {
        "source_sentence": "於是，佛告阿難：「以成具光明定意法囑汝，善書經文慎莫增減。",
        "translation": "The Buddha then addressed Ānanda, Entrusting you with the task of accomplishing the concentration of enlightenment, be careful not to add or subtract from the text of the well-written sūtras.",
        "source": "T15n0630_001:0458a27_7"
    },
    {
        "source_sentence": "勤教一切人，疾令受解。",
        "translation": "He diligently teaches all people and quickly causes them to accept their understanding.",
        "source": "T15n0630_001:0458a29_8"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T15n0630_001:0458a29_9"
    },
    {
        "source_sentence": "是經難遇。",
        "translation": "This is a difficult sūtra to encounter.",
        "source": "T15n0630_001:0458a29_10"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0630_001:0458b01_0"
    },
    {
        "source_sentence": "其要先從六度無極起，乃入正定。",
        "translation": "It's necessary to first arise from the six perfections without limit before entering right concentration.",
        "source": "T15n0630_001:0458b01_1"
    },
    {
        "source_sentence": "是百三十五行，此中有教誡、有謙誡、有忍誡、有禮節誡、有眾善法誡、有空法誡，",
        "translation": "These are the one hundred and thirty-five practices, in which there's an admonition, a humble admonition, an admonition of forbearance, an admonition of propriety, an admonition of many good qualities, and an admonition of emptiness.",
        "source": "T15n0630_001:0458b02_0"
    },
    {
        "source_sentence": "乃至滅度處，無不具有也。",
        "translation": "Up to the point of cessation, there's nothing that isn't possessed.",
        "source": "T15n0630_001:0458b03_1"
    },
    {
        "source_sentence": "佛身所有相好慧力，悉從此法出。",
        "translation": "All the characteristics, good qualities, and wisdom powers of the Buddha's body all come from this teaching.",
        "source": "T15n0630_001:0458b04_2"
    },
    {
        "source_sentence": "為尊上、為斷生死，所謂無比之法也。",
        "translation": "It's the so-called peerless dharma for the sake of honoring and ending birth and death.",
        "source": "T15n0630_001:0458b05_3"
    },
    {
        "source_sentence": "重囑累汝，諦以授之，當以了了。",
        "translation": "I repeatedly instructed you to give it to him in truth, and he will understand it.",
        "source": "T15n0630_001:0458b06_4"
    },
    {
        "source_sentence": "佛之出世，難可常見，法誡之興，亦難值遇也。",
        "translation": "The Buddha’s appearance in the world is difficult to see and it is also difficult to meet or encounter when Dharma admonitions arise.",
        "source": "T15n0630_001:0458b06_5"
    },
    {
        "source_sentence": "汝莫怠遠。」",
        "translation": "Don't be lazy and distant.",
        "source": "T15n0630_001:0458b07_6"
    },
    {
        "source_sentence": "阿難言：「受天尊教。」",
        "translation": "Ānanda said, Accept the teaching of the Bhagavān.",
        "source": "T15n0630_001:0458b08_7"
    },
    {
        "source_sentence": "佛說經竟，十方諸來明士及諸天神，禮佛歡喜，忽各還本所。",
        "translation": "After the Buddha finished speaking the sūtra, the wise men and gods from the ten directions bowed to the Buddha and rejoiced. Suddenly they all returned to their respective places.",
        "source": "T15n0630_001:0458b08_8"
    },
    {
        "source_sentence": "忍國諸明士、除惡眾、天龍鬼王及四輩人，聞經欣悅，各以頭面著地，",
        "translation": "The wise men of the kingdom of Tolerance, as well as the gods, dragons, ghost kings, and other members of the fourfold assembly who had gotten rid of evil, were delighted to hear the discourse. They bowed their foreheads and faces to the ground.",
        "source": "T15n0630_001:0458b09_9"
    },
    {
        "source_sentence": "禮佛而去。",
        "translation": "He bowed to the Buddha and departed.",
        "source": "T15n0630_001:0458b11_10"
    },
    {
        "source_sentence": "佛說成具光明定意經",
        "translation": "Foshuo xingfu guangmingming zhenyi jing",
        "source": "T15n0630_001:0458b12_0"
    }
]