[
    {
        "source_sentence": "法觀經",
        "translation": "Faguan jing",
        "source": "T15n0611_001:0240b25_0"
    },
    {
        "source_sentence": "西晉月氏國三藏竺法護譯",
        "translation": "Translated by Zhu Fahou, a translator of the Tripiṭaka of the Western Jin state of Yuezhi",
        "source": "T15n0611_001:0240b27_0"
    },
    {
        "source_sentence": "佛言：「第一、何以故數息？",
        "translation": "The Buddha said, First, why is it counted?",
        "source": "T15n0611_001:0240b28_0"
    },
    {
        "source_sentence": "用息輕易知故。",
        "translation": "It's because it's easy to know with lightness of breath.",
        "source": "T15n0611_001:0240b28_1"
    },
    {
        "source_sentence": "以世間人皆貪身，未能捨身守意，又身中事難分別，皆不信本無意不止。",
        "translation": "Because everyone in the world clings to the body, they can't abandon their body and guard their minds, and it's difficult to distinguish things in their body, so they don't believe that there's originally no mind that doesn't stop.",
        "source": "T15n0611_001:0240b28_2"
    },
    {
        "source_sentence": "何以有故說空意？",
        "translation": "Why is emptiness spoken of because it exists?",
        "source": "T15n0611_001:0240c01_3"
    },
    {
        "source_sentence": "顛倒習息見有無，故先說息；",
        "translation": "Because the perverted habit of breathing sees existence and nonexistence, it is first spoken of as breathing.",
        "source": "T15n0611_001:0240c01_4"
    },
    {
        "source_sentence": "稍稍解人意，上頭為數，已得行為第一禪。」",
        "translation": "A little bit of understanding of people's thoughts, the upper part counts as number, and they've already attained the practice of the first dhyāna.",
        "source": "T15n0611_001:0240c02_5"
    },
    {
        "source_sentence": "佛言：「坐禪當三定。",
        "translation": "The Buddha said, Sitting in meditation should be the three concentrations.",
        "source": "T15n0611_001:0240c04_0"
    },
    {
        "source_sentence": "何等為三定？",
        "translation": "What are the three absorptions?",
        "source": "T15n0611_001:0240c04_1"
    },
    {
        "source_sentence": "一者、身定；",
        "translation": "The first is bodily concentration.",
        "source": "T15n0611_001:0240c04_2"
    },
    {
        "source_sentence": "二者、口定；",
        "translation": "The second is verbal concentration.",
        "source": "T15n0611_001:0240c04_3"
    },
    {
        "source_sentence": "三者、意定。",
        "translation": "3. concentration of thought.",
        "source": "T15n0611_001:0240c05_4"
    },
    {
        "source_sentence": "痛痒止為身定，聲止為口定，意念止為意定。",
        "translation": "Stopping pain and itching is bodily concentration, stopping sound is verbal concentration, and stopping thought is mental concentration.",
        "source": "T15n0611_001:0240c05_5"
    },
    {
        "source_sentence": "念止者，為受行常念道；",
        "translation": "Cessation of mindfulness is the path of undertaking and carrying out constant mindfulness.",
        "source": "T15n0611_001:0240c06_6"
    },
    {
        "source_sentence": "聲止者，斷四惡；",
        "translation": "Sound cessation means to cut off the four evil influences.",
        "source": "T15n0611_001:0240c06_7"
    },
    {
        "source_sentence": "痛痒止者，為不墮貪。",
        "translation": "When the pain and itch stop, it's because they won't fall into craving.",
        "source": "T15n0611_001:0240c07_8"
    },
    {
        "source_sentence": "意在止已，身定、口定、意定，當立戒身意持。",
        "translation": "After the mind is stilled, concentration of body, concentration of speech, and concentration of mind will establish the observance of precepts in body and mind.",
        "source": "T15n0611_001:0240c07_9"
    },
    {
        "source_sentence": "持者，為一切無所犯，又身意持名為治。",
        "translation": "It's for the sake of all those who don't violate anything, and maintaining body and mind is called discipline.",
        "source": "T15n0611_001:0240c08_10"
    },
    {
        "source_sentence": "治者，意持意行三十七品經故。」",
        "translation": "It's because of the thirty-seven sections of the sutra on mindfulness, maintaining mindfulness, and mental functioning.",
        "source": "T15n0611_001:0240c09_11"
    },
    {
        "source_sentence": "經言：「所不識，所不能止，為息中不識，意去時不能止意去。",
        "translation": "The sūtra says, What's not known and what can't be stopped doesn't become known in the midst of breathing, and when the mind goes away, it can't stop and the mind goes away.",
        "source": "T15n0611_001:0240c10_12"
    },
    {
        "source_sentence": "如是當精進，行出力守，政坐、叉手、低頭、持意，內著心中，墮自生滅。",
        "translation": "Thus, you should exert effort, practice and force yourself to guard it, sitting cross-legged, folding your hands, lowering your head, and maintaining your intentions, clinging to the mind internally and falling into self-generation and cessation.",
        "source": "T15n0611_001:0240c11_13"
    },
    {
        "source_sentence": "當識意去時，已識當能止，便不墮蓋。",
        "translation": "When the consciousnesses and thoughts are going away, then the consciousnesses will be able to stop them, so they won't fall into the hindrances.",
        "source": "T15n0611_001:0240c13_14"
    },
    {
        "source_sentence": "蓋在戲疑聽六根，如是為不可。」",
        "translation": "It's because the six faculties of doubting and hearing in play are thus unacceptable.",
        "source": "T15n0611_001:0240c14_15"
    },
    {
        "source_sentence": "佛言：「數息意今息數不互，何意念意為互行。」",
        "translation": "The Buddha said, Now that the number of breaths and thoughts aren't mutually exclusive, what mind and thought are mutually active?",
        "source": "T15n0611_001:0240c14_16"
    },
    {
        "source_sentence": "佛言：「已三定，戒應律，為道法，愛行道。」",
        "translation": "The Buddha said, Already in the three concentrations, he observes precepts and regulations, follows the path as a method of enlightenment, and loves to practice the path.",
        "source": "T15n0611_001:0240c16_0"
    },
    {
        "source_sentence": "故經言：「貪道法行道，已坐行道。",
        "translation": "That's why the sūtra says, They crave the path and practice the path, and they've already sat and practiced the path.",
        "source": "T15n0611_001:0240c16_1"
    },
    {
        "source_sentence": "上夜後夜，驚意守食，時至禺中，日西至夕，名為四守。",
        "translation": "On the first watch of the night and on the last watch of the night, he was frightened and guarded his food. When he arrived in the city of Yi, he went from one day to the west until the evening; these are called the four guardians.",
        "source": "T15n0611_001:0240c17_2"
    },
    {
        "source_sentence": "當精不離，是為勤力。",
        "translation": "This is the power of diligence.",
        "source": "T15n0611_001:0240c18_3"
    },
    {
        "source_sentence": "夜半、日出、日中、晡時，是名為四正。",
        "translation": "At midnight, when the sun rises, in the middle of the day, and at dawn, these are called the four proper times.",
        "source": "T15n0611_001:0240c19_4"
    },
    {
        "source_sentence": "讀經，經行，旋塔內外；",
        "translation": "They read the scriptures and walked up and down inside and outside the stupas.",
        "source": "T15n0611_001:0240c19_5"
    },
    {
        "source_sentence": "自觀身體，內視五滅，外從頭至足，從足至頭，一一觀視，斯何等有？",
        "translation": "He observes his body internally and looks at the five kinds of extinction; but when he looks outward, from head to toe or from foot to head, what are these?",
        "source": "T15n0611_001:0240c20_6"
    },
    {
        "source_sentence": "皆當臭敗，節節解墮。",
        "translation": "They will all smell bad and fall down, and they'll be freed from each section.",
        "source": "T15n0611_001:0240c21_7"
    },
    {
        "source_sentence": "本無所有來作，去亦滅盡無所有。",
        "translation": "The originally nonexistent comes into being, and going also ceases to be nonexistent.",
        "source": "T15n0611_001:0240c22_8"
    },
    {
        "source_sentence": "反覆迴念，用數心，意復不解。",
        "translation": "He repeatedly and repeatedly thinks, using mental calculation, but his mind doesn't understand it.",
        "source": "T15n0611_001:0240c23_9"
    },
    {
        "source_sentence": "眼見死人，諦念從頭至足，若坐、若起、若飯食，常念著心中，用堅其心，",
        "translation": "When the eye sees a dead man, it thinks earnestly of him, whether he’s sitting, rising, or eating food. It is always mindful of his thoughts and concentrates on them, using mental stability to control his thoughts.",
        "source": "T15n0611_001:0240c23_10"
    },
    {
        "source_sentence": "是為數念。",
        "translation": "This is called repeated thought.",
        "source": "T15n0611_001:0240c25_11"
    },
    {
        "source_sentence": "出息入息念滅時，已覺息滅盡時無所有；",
        "translation": "When the thought of exhaling and inhaling ceases, there is no existence at the moment when perception of exhalation ceases.",
        "source": "T15n0611_001:0240c25_12"
    },
    {
        "source_sentence": "校計思惟，知人物皆當復盡。",
        "translation": "He calculates and contemplates, knowing that all the people will again be exhausted.",
        "source": "T15n0611_001:0240c26_13"
    },
    {
        "source_sentence": "意止已定，便知空。」",
        "translation": "After the mind stops being concentrated, it then knows emptiness.",
        "source": "T15n0611_001:0240c27_14"
    },
    {
        "source_sentence": "故經言：「一者、勤力；",
        "translation": "That is why the Sūtra says:",
        "source": "T15n0611_001:0240c27_15"
    },
    {
        "source_sentence": "二者、數念；",
        "translation": "The second is the mental command of calculation.",
        "source": "T15n0611_001:0240c28_0"
    },
    {
        "source_sentence": "三者、思惟。」",
        "translation": "3. contemplation.",
        "source": "T15n0611_001:0240c28_1"
    },
    {
        "source_sentence": "佛言：「自觀身，有時當觀他人身，當觀身者為校計。",
        "translation": "The Buddha said, Observing your own body, there are times when you should examine the bodies of others, and those who observe their bodies will be judged.",
        "source": "T15n0611_001:0240c29_0"
    },
    {
        "source_sentence": "當觀他人身者，為自觀身意著，當觀他人身死敗。",
        "translation": "Those who should observe the bodies of others are observing their own body and mind attachment, and they should observe the bodies of others dying and dying.",
        "source": "T15n0611_001:0241a01_1"
    },
    {
        "source_sentence": "有時可自觀身，亦可觀他人身。",
        "translation": "Sometimes they can contemplate their own bodies or others' bodies.",
        "source": "T15n0611_001:0241a02_2"
    },
    {
        "source_sentence": "可自觀者，為自觀身意不著；",
        "translation": "Those who can observe for themselves are observing for themselves because they do not cling to body or mind.",
        "source": "T15n0611_001:0241a03_0"
    },
    {
        "source_sentence": "可觀他人身，亦為觀他人身意不著。",
        "translation": "You can observe the bodies of others, but you also observe the bodies and minds of others without attachment.",
        "source": "T15n0611_001:0241a03_1"
    },
    {
        "source_sentence": "有時不可自觀身，亦不可觀他人身。",
        "translation": "There are times when you can't contemplate yourself, and you can't contemplate the body of others.",
        "source": "T15n0611_001:0241a04_2"
    },
    {
        "source_sentence": "不可自觀身者，為自見身肥白好；",
        "translation": "Someone who should not contemplate the body of others simply to see for themselves that it is fat, white, and beautiful.",
        "source": "T15n0611_001:0241a05_3"
    },
    {
        "source_sentence": "不可觀他人身，亦為見他人身肥白好、端正、膩眉、赤絮。",
        "translation": "They should not look at the bodies of others. They should also see that other people’s bodies are fat, white, beautiful, handsome, with greasy eyebrows, and covered with red hair.",
        "source": "T15n0611_001:0241a06_4"
    },
    {
        "source_sentence": "見肥當念膖脹，見白念死人骨，見膩眉念死人欲壞時色轉青黑，見赤絮念血皆當壞敗，",
        "translation": "When he sees fat, he's mindful of abscess swelling; when he sees white, he's mindful of the bones of a dead man; when he sees greasy eyebrows, he's mindful of the dying man's desire to break down his color turns blue and black; when he sees red flocculation, he's mindful of",
        "source": "T15n0611_001:0241a07_5"
    },
    {
        "source_sentence": "何等可貪？",
        "translation": "What's cravingable?",
        "source": "T15n0611_001:0241a09_6"
    },
    {
        "source_sentence": "「是意自觀身有三十二物者，計髮、毛、爪、齒、骨、皮肉、五藏十一事，",
        "translation": "“This is the idea of observing for yourself that there are thirty-two things in your body, which are counted as hair, nails, teeth, bones, skin, flesh, and the five stores of eleven things.",
        "source": "T15n0611_001:0241a10_0"
    },
    {
        "source_sentence": "屬地；",
        "translation": "They belong to the stages.",
        "source": "T15n0611_001:0241a11_1"
    },
    {
        "source_sentence": "淚、涕、唾、膿血、肪髓、汗、小便七事，屬水；",
        "translation": "Tears, snot, spittle, spittle, pus, blood, fat, sweat, urination, and seven things belong to water.",
        "source": "T15n0611_001:0241a11_2"
    },
    {
        "source_sentence": "溫熱、主消食二事，屬火；",
        "translation": "The two things hot and hot and the food consumed by the host belong to fire.",
        "source": "T15n0611_001:0241a12_3"
    },
    {
        "source_sentence": "風有十二事；",
        "translation": "Wind has twelve characteristics:",
        "source": "T15n0611_001:0241a12_4"
    },
    {
        "source_sentence": "是三十二物皆從地、水、火、風出。",
        "translation": "These are the thirty-two things that all emerge from earth, water, fire, and wind.",
        "source": "T15n0611_001:0241a13_5"
    },
    {
        "source_sentence": "何等為地？",
        "translation": "What's the ground?",
        "source": "T15n0611_001:0241a13_6"
    },
    {
        "source_sentence": "人生從穀精氣，穀為地，意為種，精氣為水雨，便合生身故。",
        "translation": "People are born from the energy of grain; the earth is made up of grass and the mind is made up of seeds. The water that produces energy is what rains, because it combines with the body that produces energy.",
        "source": "T15n0611_001:0241a14_7"
    },
    {
        "source_sentence": "求一衣一食是為養氣護主。",
        "translation": "Seeking a single piece of clothing or food is the protector of nourishment and energy.",
        "source": "T15n0611_001:0241a15_8"
    },
    {
        "source_sentence": "人身為本無，故滅盡無常，得道便知身非身。",
        "translation": "Because the human body is originally nonexistent, its cessation is impermanent, and when he attains the path, he knows that his body is not a body.",
        "source": "T15n0611_001:0241a16_0"
    },
    {
        "source_sentence": "念身不久，要當死敗；",
        "translation": "Soon after the thought of my body, I am about to die.",
        "source": "T15n0611_001:0241a17_0"
    },
    {
        "source_sentence": "意為人種，便守意一心。",
        "translation": "Because the mind is a human being, he guards his mind with one mind.",
        "source": "T15n0611_001:0241a17_1"
    },
    {
        "source_sentence": "癡人不守意，護魂神，但養四柯，為色味所欺。",
        "translation": "A foolish man doesn't guard his mind, protects his soul and spirit, but nourishes four fruits, which are deceived by their color and taste.",
        "source": "T15n0611_001:0241a18_0"
    },
    {
        "source_sentence": "謂身是我計，不知惡一切從身起；",
        "translation": "It means that the body is a self imputed conception of self, which does not know evil and all things are produced from the body.",
        "source": "T15n0611_001:0241a19_0"
    },
    {
        "source_sentence": "飯食貪味，便墮苦；",
        "translation": "When one eats food with craving for its taste, he will fall into suffering.",
        "source": "T15n0611_001:0241a19_1"
    },
    {
        "source_sentence": "往來生死不脫，卒逢惡對，魂神空去，趣善惡之道；",
        "translation": "Their past and future existences in birth and death will not be freed, but they may meet evil enemies at any moment.",
        "source": "T15n0611_001:0241a20_2"
    },
    {
        "source_sentence": "身死墮地，日夜消腐。",
        "translation": "His body died and fell to the ground, where it rotted away day and night.",
        "source": "T15n0611_001:0241a21_3"
    },
    {
        "source_sentence": "亦本無所有，但意行，故化成身；",
        "translation": "Also, the apparitional body does not exist in the first place; it is only mental action.",
        "source": "T15n0611_001:0241a21_4"
    },
    {
        "source_sentence": "死皆歸土，萬物亦爾，皆當過去，是為非常。",
        "translation": "Death will all return to the land, and so will all things, which will all pass away. This is extraordinary.",
        "source": "T15n0611_001:0241a22_5"
    },
    {
        "source_sentence": "「人不自計，多念萬端，皆不為一，以是為苦，身死索棄；",
        "translation": "“People don’t think for themselves; they often think of all kinds of thoughts as not one and the same thing. Because of this, they experience suffering and lose their bodies at death.",
        "source": "T15n0611_001:0241a24_0"
    },
    {
        "source_sentence": "萬物亦爾。",
        "translation": "So it is with all things.",
        "source": "T15n0611_001:0241a25_1"
    },
    {
        "source_sentence": "滅是為已復生，生復苦，便作善惡行種栽，未知所趣，是為非身。",
        "translation": "Cessation is the result of having arisen again and being painful to arise again, which then creates good and bad seeds and plants them, not knowing where they're headed, which is what's not body.",
        "source": "T15n0611_001:0241a25_2"
    },
    {
        "source_sentence": "道人行道當為斷。",
        "translation": "A practitioner of the Way who practices the path will be stopped.",
        "source": "T15n0611_001:0241a26_3"
    },
    {
        "source_sentence": "人不知四非常，終不得道。",
        "translation": "People don't know that the four are impermanent, and they never attain enlightenment.",
        "source": "T15n0611_001:0241a27_4"
    },
    {
        "source_sentence": "以自計身，視諸死敗，知人物皆無所有，意便守止，得行歡喜；",
        "translation": "Knowing that all living beings have no existence, the enlightening being keeps them in his mind and acts joyfully.",
        "source": "T15n0611_001:0241a27_5"
    },
    {
        "source_sentence": "已得行，心便安。",
        "translation": "Once they've done so, their minds are at peace.",
        "source": "T15n0611_001:0241a29_6"
    },
    {
        "source_sentence": "不離五者，其心一是道。」",
        "translation": "If someone doesn't part from the five, their mind is one path.",
        "source": "T15n0611_001:0241a29_7"
    },
    {
        "source_sentence": "佛言：「念身，觀頭髮、腦。",
        "translation": "The Buddha said, Mindful of my body, I'll observe my head and hair.",
        "source": "T15n0611_001:0241b02_0"
    },
    {
        "source_sentence": "念髮本無所有來，作為化成皆當腐落；",
        "translation": "Mindfulness originally has no existence, but in order to be transformed it will all perish.",
        "source": "T15n0611_001:0241b02_1"
    },
    {
        "source_sentence": "腦如凝米粥，皆當臭敗；",
        "translation": "Their brains are like cooked rice gruel, all smelling bad.",
        "source": "T15n0611_001:0241b03_2"
    },
    {
        "source_sentence": "眼但有窌水，皆汁出空塪；",
        "translation": "Their eyes merely contained salty water, and all the juice emitted from their eyes an emptiness.",
        "source": "T15n0611_001:0241b03_3"
    },
    {
        "source_sentence": "耳但有肉，垢皆穿漏；",
        "translation": "Their ears have only flesh, and all the dirt they produce penetrates through their mouths.",
        "source": "T15n0611_001:0241b04_4"
    },
    {
        "source_sentence": "鼻口涕唾，皆流棄消壞；",
        "translation": "Their noses, mouths, tears, and spittle all flow away and perish.",
        "source": "T15n0611_001:0241b04_5"
    },
    {
        "source_sentence": "舌、咽喉、肺、肝、心，心中惡血；",
        "translation": "Their tongue, throat, throat, lungs, liver, heart, and mind are filled with bad blood.",
        "source": "T15n0611_001:0241b05_6"
    },
    {
        "source_sentence": "肝、膽、膈、脾著胃；",
        "translation": "Their liver, bile, gallbladder, and spleen are attached to the stomach.",
        "source": "T15n0611_001:0241b06_7"
    },
    {
        "source_sentence": "腎著脊；",
        "translation": "Their kidneys are attached to the back.",
        "source": "T15n0611_001:0241b06_8"
    },
    {
        "source_sentence": "胃中有未消食；",
        "translation": "In the stomach there is food that has not yet been digested.",
        "source": "T15n0611_001:0241b06_9"
    },
    {
        "source_sentence": "大腸有屎；",
        "translation": "In the large intestine there is excrement.",
        "source": "T15n0611_001:0241b06_10"
    },
    {
        "source_sentence": "小腸泡有尿。",
        "translation": "The small intestines and bubbles have urine.",
        "source": "T15n0611_001:0241b07_11"
    },
    {
        "source_sentence": "發便腹少增減，身死氣盡，皆當膖脹壞爛，腸、胃、屎、尿相澆灒，臭處可惡。",
        "translation": "When they give rise to an abscess, a little increase and decrease in the number of belly sensations, their bodies die with exhaustion of breath, all become swollen and disintegrate, and their intestines, stomach, stomach, excrement, and urine are poured into each other, which is a bad smelly place.",
        "source": "T15n0611_001:0241b07_12"
    },
    {
        "source_sentence": "下有尻肉、兩脛、兩足，肌肉稍盡，筋脈壞敗，骨鎖節節解墮。",
        "translation": "Below him were the flesh of his buttocks, two shins, and two legs. Their flesh was slightly exhausted, and their tendons and veins dissolved. The bones were chained together in knuckles and dismembered.",
        "source": "T15n0611_001:0241b09_13"
    },
    {
        "source_sentence": "脛脡確政，白髀骨如車輻。",
        "translation": "His shins are firmly planted, and his white thigh bones are like the spokes of a carriage.",
        "source": "T15n0611_001:0241b10_14"
    },
    {
        "source_sentence": "尻骨與脊骨相連，脊與肋骨相連，肩骨與肘臂手相連，皮革消腐，節節解墮。",
        "translation": "The bones of the abdomen are connected with the bones of the back; the bones of the back are connected with the bones of the ribs; the bones of the shoulders are connected with the bones of the elbows, the armpits, and the hands; the leather disappears and decays.",
        "source": "T15n0611_001:0241b11_15"
    },
    {
        "source_sentence": "頸骨與髑髏相連，肉血消盡，磨磨但有骨。",
        "translation": "The bone of the neck is connected to the skull, and when the flesh and blood are extinguished, there's only bone in the ground.",
        "source": "T15n0611_001:0241b12_16"
    },
    {
        "source_sentence": "氣出不報為死人，身侹正直不復搖，風去身冷，火去黃汁從九孔流出，",
        "translation": "When the wind goes away, the body becomes cold; when the fire goes away, hot juice flows forth from nine orifices.",
        "source": "T15n0611_001:0241b13_17"
    },
    {
        "source_sentence": "水去死不復食，地去三四日，色轉正青，膿血從口鼻耳目中出正赤，肌肉壞敗骨正白，",
        "translation": "Three or four days after the water died and they did not eat again. Three or four days after the earth’s departure, their complexion changed to a correct blue color. pus and blood flowed out of their mouths, noses, ears, and eyes, and [their flesh] disintegrated into skeletons that looked like white bones.",
        "source": "T15n0611_001:0241b15_18"
    },
    {
        "source_sentence": "久久轉黑作灰土。",
        "translation": "After a long time, it turns black into ashes and dirt.",
        "source": "T15n0611_001:0241b17_19"
    },
    {
        "source_sentence": "視郭外臭死人，死人骨如是，自身亦如是，皆當滅盡是為空。",
        "translation": "If we look at the smelly dead outside the wall and see that the bones of the dead are like this, and so is our own body, they'll all cease to be nothing but emptiness.",
        "source": "T15n0611_001:0241b17_20"
    },
    {
        "source_sentence": "出息盡時便知空，知空便知身空。",
        "translation": "When he exhales, he knows emptiness, and knowing emptiness, he knows the emptiness of his body.",
        "source": "T15n0611_001:0241b19_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0611_001:0241b19_22"
    },
    {
        "source_sentence": "知命近在息空故。」",
        "translation": "He knows that his life is near because he's calming emptiness.",
        "source": "T15n0611_001:0241b20_23"
    },
    {
        "source_sentence": "佛言：「是意當先觀思惟，滅念待自意便守意。",
        "translation": "The Buddha said, This is the intention that should first be contemplated, and then he stops mindfulness and waits for his own mind to guard it.",
        "source": "T15n0611_001:0241b21_0"
    },
    {
        "source_sentence": "意不出身為道人，待在外為萬物。",
        "translation": "The mind doesn't leave the body as a practitioner of the Way, but it waits outside for all things.",
        "source": "T15n0611_001:0241b22_1"
    },
    {
        "source_sentence": "念在內為思，識欲滅念待，當念物非常敗，皆非我所，我亦非物主。",
        "translation": "Mindfulness within is thought, and consciousnesses that want to cease mindfulness and await it will be mindful of things that are not permanently decayed, which are neither self nor the owner of things.",
        "source": "T15n0611_001:0241b22_2"
    },
    {
        "source_sentence": "意念死時，持何等去？",
        "translation": "When he's mindful of his death, what will he carry?",
        "source": "T15n0611_001:0241b24_3"
    },
    {
        "source_sentence": "持善、持一、必持經，多作多樂故。」",
        "translation": "It's because maintaining good, maintaining one, and maintaining the sūtras will often bring many pleasures.",
        "source": "T15n0611_001:0241b24_4"
    },
    {
        "source_sentence": "佛言：「是汝物持去，其餘一切，皆非我所。",
        "translation": "The Buddha said, This is your possession that you've taken away, and everything else isn't mine.",
        "source": "T15n0611_001:0241b25_5"
    },
    {
        "source_sentence": "意當識念：何等恩愛會當別離，各自消腐，念之但亂人意，墮人罪，要當還身守淨，",
        "translation": "You should think to yourself, What kindnesses and loves will be separated, each extinguishing their decay? When you think of them, it only disturbs people’s thoughts. They will fall into the category of those who commit crimes but must return to physical purity.",
        "source": "T15n0611_001:0241b26_6"
    },
    {
        "source_sentence": "趣泥洹道。",
        "translation": "He'll go to the path of nirvāṇa.",
        "source": "T15n0611_001:0241b28_7"
    },
    {
        "source_sentence": "「佛從一心至九道，念四色皆當消滅。",
        "translation": "From the Buddha's single mind up to the nine paths, mindfulness of the four forms will all cease.",
        "source": "T15n0611_001:0241b29_0"
    },
    {
        "source_sentence": "謂人死四、五日，欲臭壞，色轉正青；",
        "translation": "It means that when a person dies on the fourth or fifth day, his cravings smell and disintegrate and his complexion changes into clear blue.",
        "source": "T15n0611_001:0241b29_1"
    },
    {
        "source_sentence": "五日、六日，膿血從口、鼻、耳、目中出正赤；",
        "translation": "On the fifth and sixth days, pus and blood flowed out of their mouths, noses, ears, and eyes.",
        "source": "T15n0611_001:0241c01_2"
    },
    {
        "source_sentence": "後肌肉壞敗，腸胃生蟲還自食，皮革消腐，骨顏正白，久久轉黑作灰土。",
        "translation": "When the flesh disintegrates, the intestines and stomach grow worms and return to eat themselves. The leather disappears and decays, and the skeleton has a white color that turns black into ashes and dirt for a long time.",
        "source": "T15n0611_001:0241c02_3"
    },
    {
        "source_sentence": "明地、水、火、風空，皆非我所意。",
        "translation": "It explains that earth, water, fire, wind, and space are not what I think.",
        "source": "T15n0611_001:0241c04_4"
    },
    {
        "source_sentence": "汝從無數世以來，亦為人作妻子、奴婢，亦作畜生、牛、馬、蟲、象，",
        "translation": "For innumerable eons you have also been a wife and maidservants for people, as well as animals, cattle, horses, insects, and elephants.",
        "source": "T15n0611_001:0241c04_5"
    },
    {
        "source_sentence": "勤苦重負，亦為人所屠、剝、膾、炙。",
        "translation": "They are also slaughtered, skinned, tortured, and roasted by people.",
        "source": "T15n0611_001:0241c06_6"
    },
    {
        "source_sentence": "今為人，復所人作妻子、奴婢，亦取畜生屠、剝、膾、刺、斫，自在身死，",
        "translation": "Now they become human beings. Their wives, children, and male and female servants are also slaughtered by animals, skinned, chopped, tortured, mutilated, stabbed, and beheaded, dying freely in their own hands.",
        "source": "T15n0611_001:0241c06_7"
    },
    {
        "source_sentence": "皆當復受。",
        "translation": "They'll all again experience it.",
        "source": "T15n0611_001:0241c08_8"
    },
    {
        "source_sentence": "行道人！",
        "translation": "Practitioners of the Way!",
        "source": "T15n0611_001:0241c08_9"
    },
    {
        "source_sentence": "汝寧見死人不？",
        "translation": "Would you rather see a dead man?",
        "source": "T15n0611_001:0241c08_10"
    },
    {
        "source_sentence": "氣絕便無所知，身挺正直便臭壞可惡，諦念便畏不欲見。",
        "translation": "When his breath dies, he doesn't know anything, his body stands straight upright, and then it smells bad and disgusting, and when he's mindful of it, he fears not wanting to see it.",
        "source": "T15n0611_001:0241c08_11"
    },
    {
        "source_sentence": "何以故不怖一心？",
        "translation": "Why is it that they aren't afraid of one mind?",
        "source": "T15n0611_001:0241c10_12"
    },
    {
        "source_sentence": "一心令人上天得泥洹道。",
        "translation": "With one mind, he causes the higher gods to attain the path of nirvāṇa.",
        "source": "T15n0611_001:0241c10_13"
    },
    {
        "source_sentence": "佛知九道皆空，無所有故，還就一心。",
        "translation": "Knowing that the nine paths are all empty and lack existence, the Buddha returns to one mind.",
        "source": "T15n0611_001:0241c11_14"
    },
    {
        "source_sentence": "行道人急滅念，待無所他知，便至拘深國，行拘深俱在所，見用不在故不見。」",
        "translation": "The practitioner of the Way quickly ceased his thoughts, waited for nothing to be known, and then went to Kauśinagara, where all the practitioners of Kauśinagara were present, but they didn't see it because their views and functions were absent.",
        "source": "T15n0611_001:0241c12_15"
    },
    {
        "source_sentence": "佛言：「意欲貪念非常敗，婬當念對，瞋恚念等心，愚癡念本，一切行非常，",
        "translation": "The Buddha said, Consciousness of desire and craving are permanently defeated, anger is the antidote to anger, such thoughts as anger, etc., ignorance is the root of thought, and all conditioned things are permanent.",
        "source": "T15n0611_001:0241c14_0"
    },
    {
        "source_sentence": "無為安隱。",
        "translation": "It's peaceful and uncontained.",
        "source": "T15n0611_001:0241c15_1"
    },
    {
        "source_sentence": "人不知非常，終不去貪，亦不離薜荔道。",
        "translation": "People don't know that it's impermanent, so they never go without craving and don't part with the Way of Kauṇḍinya.",
        "source": "T15n0611_001:0241c15_2"
    },
    {
        "source_sentence": "世間所有如夢耳，夢飯食見好，寤便不見。",
        "translation": "What's in the world is like a dream, and when he dreams of eating rice and seeing good food, he doesn't see it.",
        "source": "T15n0611_001:0241c16_3"
    },
    {
        "source_sentence": "世間所有如是，生便死，適成便壞，要皆歸空，當何等可貪？",
        "translation": "All that exists in the world is like this: when it arises, it dies; when it forms, it disintegrates; and if everything returns to emptiness, what should be desired?",
        "source": "T15n0611_001:0241c17_4"
    },
    {
        "source_sentence": "人有妻子、財產亦爾。",
        "translation": "So it is with people who have wives and property.",
        "source": "T15n0611_001:0241c19_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0611_001:0241c19_6"
    },
    {
        "source_sentence": "人治生得錢利時，若家室合會喜樂，譬如飛鳥聚會，亦皆無常，一旦別離，",
        "translation": "It is like a flying bird that when it meets to gather, they are also impermanent; once separated, they become one and the same.",
        "source": "T15n0611_001:0241c19_7"
    },
    {
        "source_sentence": "亦便不見。",
        "translation": "They don't see it either.",
        "source": "T15n0611_001:0241c21_8"
    },
    {
        "source_sentence": "正使有憂恐萬苦，意在生死中，為日積罪。",
        "translation": "It's precisely because they have grief and fear of all kinds of suffering, and their minds are in birth-and-death, which is a daily accumulation of sins.",
        "source": "T15n0611_001:0241c21_9"
    },
    {
        "source_sentence": "黠人自約少欲，趣求一衣一食，從定意行，不求地止，常還身守淨，斷求念空。」",
        "translation": "A wise person who has few desires for themselves and goes on to ask for a single piece of clothing or food, practices with concentration, doesn't seek the ground to stop, always returns to his body to keep it pure, and stops looking for emptiness.",
        "source": "T15n0611_001:0241c22_10"
    },
    {
        "source_sentence": "問曰：「行道守意根本從何起？」",
        "translation": "He asked, Where did the root of practice and discipline come from?",
        "source": "T15n0611_001:0241c25_0"
    },
    {
        "source_sentence": "佛言：「天地成後，人從十五天上來下，壽無有夭逝，生死五道從六衰起。",
        "translation": "The Buddha said, After the formation of heaven and earth, humans come down from the fifteen celestial bodies up and down, their life span doesn't end without death, and the five destinies of birth-and-death arise from the six declining destinies.",
        "source": "T15n0611_001:0241c25_1"
    },
    {
        "source_sentence": "人生心意本自善，無有貪愛、痛痒、思想、生死、識，為耳、目、鼻、口所欺。",
        "translation": "The mind and thought of people are inherently good, with no craving, pain, itch, thought, birth-and-death, or consciousness, deceived by the ear, eye, nose, or mouth.",
        "source": "T15n0611_001:0241c27_2"
    },
    {
        "source_sentence": "目光視色，耳聲音，鼻知香，口知味，身知寒溫粗細，心為作十事，成五陰；",
        "translation": "The five aggregates are as follows: the eye perceives matter; the ear makes sounds; the nose knows smell; the mouth knows taste; the body knows cold and warm, coarse and fine.",
        "source": "T15n0611_001:0241c28_3"
    },
    {
        "source_sentence": "意為識合，為六衰；",
        "translation": "Mental consciousness is the conjunction of the six states of decay.",
        "source": "T15n0611_001:0242a01_4"
    },
    {
        "source_sentence": "因作善惡行種栽，從是便有老、病、死，生五道。",
        "translation": "As a result of planting good and bad actions, old age, illness, death, and the five destinies arise.",
        "source": "T15n0611_001:0242a01_5"
    },
    {
        "source_sentence": "求道欲斷生死故，自守意，止目色，止耳聲，止鼻香，止口味，止身如，",
        "translation": "Because they seek the path and want to cut off birth and death, they guard their own minds, stopping eye form, ear sounds, nose odors, tastes, and bodies.",
        "source": "T15n0611_001:0242a02_6"
    },
    {
        "source_sentence": "斷六衰，行觀懷心念，坐禪滅意識。",
        "translation": "He stops the six kinds of decay, practices contemplation with mindfulness in mind, and sits in meditation to extinguish consciousness.",
        "source": "T15n0611_001:0242a04_7"
    },
    {
        "source_sentence": "得道者，五陰悉滅；",
        "translation": "Attaining enlightenment means the five aggregates are completely extinguished.",
        "source": "T15n0611_001:0242a04_8"
    },
    {
        "source_sentence": "知本無，便念空想、空徑向泥洹。",
        "translation": "Knowing that it's originally nonexistent, he then thinks of emptiness and proceeds to nirvāṇa with thoughts of emptiness and emptiness.",
        "source": "T15n0611_001:0242a05_9"
    },
    {
        "source_sentence": "問所以守意者？",
        "translation": "Question: What is the reason for keeping an eye on him?",
        "source": "T15n0611_001:0242a06_10"
    },
    {
        "source_sentence": "意為識主行故惡，六衰為禍行，種五道根本。",
        "translation": "The mind is bad because it acts as the leader of consciousness, and the six degenerate states are bad because they sow the roots of the five destinies.",
        "source": "T15n0611_001:0242a06_11"
    },
    {
        "source_sentence": "道人精思，自守四意，欲止無邪，念識思想走。",
        "translation": "The monks of the Way diligently thought and guarded their own minds in four ways, wanting to stop what was not wrong. They ran away with thoughts and thoughts.",
        "source": "T15n0611_001:0242a07_12"
    },
    {
        "source_sentence": "何道人欲滅念識思想，當一切行非常，斷身十事。",
        "translation": "What path does a person want to cease mindfulness, consciousness, thought, and all conditioned things are impermanent, and they cut off ten things in their body?",
        "source": "T15n0611_001:0242a08_13"
    },
    {
        "source_sentence": "身、口、意三者，從五陰六衰乃止。",
        "translation": "Bodily, verbal and mental factors are threefold: from the five aggregates and six forms of decay up to cessation.",
        "source": "T15n0611_001:0242a09_14"
    },
    {
        "source_sentence": "三定者，口無所知為口定，身無所知為身定，意無所復念為意定。」",
        "translation": "The three concentrations are verbal concentration without knowing what's in the mouth, bodily concentration without knowing what's in the body as body concentration, and mental concentration without further thoughts as mental concentration.",
        "source": "T15n0611_001:0242a10_15"
    },
    {
        "source_sentence": "佛言：「道有四要，界持啟封乃得出。",
        "translation": "The Buddha said, There are four essentials of the path, and it's only when the boundary is maintained and enclosed that he leaves.",
        "source": "T15n0611_001:0242a12_0"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T15n0611_001:0242a12_1"
    },
    {
        "source_sentence": "一為識苦，不復向萬物，是為得出三惡道啟；",
        "translation": "The first is to condemn the suffering of consciousness and not turn away from all things. This is enlightenment that leads to escape from the three evil destinies.",
        "source": "T15n0611_001:0242a13_0"
    },
    {
        "source_sentence": "二者、知身非身，便壞身不復愛，是為從人得出門第六天上啟；",
        "translation": "The second is that when one knows the body is a body and not a body, there will be disintegration of the body and no more craving. This is the sixth supernormal knowledge derived from the fact that one can leave the human world by following someone else.",
        "source": "T15n0611_001:0242a14_0"
    },
    {
        "source_sentence": "三者、知非常意，不復向，是為得出十八天啟；",
        "translation": "The third is that they know impermanent intentions and do not turn away from them. This is the enlightenment of those who leave the eighteen heavens.",
        "source": "T15n0611_001:0242a15_1"
    },
    {
        "source_sentence": "四者、知空滅空，是為得出二十八天啟。",
        "translation": "Fourth, knowing emptiness and ceasing emptiness is the way to escape the inspiring of the twenty-eight heavens.",
        "source": "T15n0611_001:0242a16_2"
    },
    {
        "source_sentence": "空滅乃為墮道故。」",
        "translation": "The cessation of emptiness is the reason for falling into the path.",
        "source": "T15n0611_001:0242a17_3"
    },
    {
        "source_sentence": "經言：「行道覺者得出，謂覺苦空非身非常。",
        "translation": "The sūtras say, Those who practice the path of awakening attain it, meaning that they perceive suffering as emptiness and not the body as impermanent.",
        "source": "T15n0611_001:0242a17_4"
    },
    {
        "source_sentence": "得出者，謂得出四要界，得第一禪。",
        "translation": "He who escapes means he escapes the four essential realms and attains the first dhyāna.",
        "source": "T15n0611_001:0242a18_5"
    },
    {
        "source_sentence": "上七天無有身景。",
        "translation": "In the upper seven heavens there is no bodily image.",
        "source": "T15n0611_001:0242a19_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0611_001:0242a19_7"
    },
    {
        "source_sentence": "行道壞身故。」",
        "translation": "It's because the path of practice destroys the body.",
        "source": "T15n0611_001:0242a20_0"
    },
    {
        "source_sentence": "法觀經",
        "translation": "Faguan jing",
        "source": "T15n0611_001:0242a21_0"
    }
]