[
    {
        "source_sentence": "大周新翻三藏聖教序",
        "translation": "Preface to the Newly Revised Tripiṭaka of the Great Zhou Sacred Teachings",
        "source": "T15n0646_001:0706a03_0"
    },
    {
        "source_sentence": "御製",
        "translation": "made by the emperor",
        "source": "T15n0646_001:0706a05_0"
    },
    {
        "source_sentence": "蓋聞：大乘奧典，光祕賾於瓊編，三藏玄樞，著靈文於寶偈，斯乃牢籠繫象。",
        "translation": "I have also heard that the Mahayana scriptures, the esoteric texts of the Great Vehicle, which are compiled by Qiong with their shining secrets, and the profound principles of the Tripitaka Master’s doctrines inscribed",
        "source": "T15n0646_001:0706a06_0"
    },
    {
        "source_sentence": "演暢幽深，雖第一義空，名言之路雙絕，諸法無相，聽說之理兼亡。",
        "translation": "Although the teachings are profound and profound, even though the ultimate truth is emptiness, the path of names and words are both cut off, and all dharmas lack characteristics, and the principle of listening disappears at the same time.",
        "source": "T15n0646_001:0706a07_1"
    },
    {
        "source_sentence": "然則，發啟善根，寔資開導，弘宣妙旨，終寄顯揚。",
        "translation": "In this way the roots of goodness are enlightened, and all kinds of provisions are provided to enlighten them. The sublime doctrines expounded in this way are ultimately expressed clearly.",
        "source": "T15n0646_001:0706a09_2"
    },
    {
        "source_sentence": "至若鹿野初開，儼尊容於常住，龍宮載闢，緘舍利於將來，所以地涌全身，",
        "translation": "When the Deer Preserve first came into existence, the venerable monk was allowed to live at Changshou. The dragon palace was entrusted with the construction of the stupa for the sake of preserving the relics in the future. That",
        "source": "T15n0646_001:0706a10_3"
    },
    {
        "source_sentence": "為證說經之兆，空懸寶殿，爰標闡法之徵，八萬四千，分布閻浮之境，",
        "translation": "In order to prove the miracle of expounding the scripture, a jeweled hall was suspended from the sky to mark the signs that revealed the Teaching. Eighty-four thousand copies were distributed in Jambudvipa.",
        "source": "T15n0646_001:0706a12_0"
    },
    {
        "source_sentence": "三十六億，莊嚴平等之居，敷演一音，則隨類而解，廣陳三句，則劫壽難窮。",
        "translation": "Three billion six hundred million, adorned with the abode of equality, are spread out to produce a single sound, which is understood according to type and extensively expressed in three phrases, so that it's difficult to limit the duration of an e",
        "source": "T15n0646_001:0706a13_1"
    },
    {
        "source_sentence": "自夜掩周星、宵通漢夢，玉毫流彩，式彰東漸之風，金口傳芳，遂覩後秦之譯，",
        "translation": "From that night on, the stars of the Zhou constellation and the Chinese moon at dawn shine brightly. The colors of the jade hair flowed in all directions to show the wind blowing toward the east; the fragrance transmitted",
        "source": "T15n0646_001:0706a15_2"
    },
    {
        "source_sentence": "修多、祇夜之祕躅，因緣、譬喻之要宗，授記之與本生，方廣之與論議，",
        "translation": "He taught the scriptures, the esoteric treatises of the Sutra and the Jīvaka school, the essential doctrines of causality and metaphors, gave assurance of future enlightenment to those who had been born in the past, and",
        "source": "T15n0646_001:0706a16_3"
    },
    {
        "source_sentence": "雖立名差別，而究理不殊，同歸實相之源，並湊涅槃之會。",
        "translation": "Although they establish distinctions in names, their investigations and principles aren't different, and they all return to the source of true characteristics together at the assembly of nirvāṇa.",
        "source": "T15n0646_001:0706a18_4"
    },
    {
        "source_sentence": "朕幼崇釋教，夙暮歸依，思欲運六道於慈舟，逈超苦海，驅四生於彼岸，",
        "translation": "As a child we cherished the teachings of the Śākyas and relied on them from day to night. We desired to carry the six heavenly paths in the boat of compassion, crossing the sea of suffering at dawn and sending the four",
        "source": "T15n0646_001:0706a19_5"
    },
    {
        "source_sentence": "永離蓋纏，窮貝牒之遺文，集蜂臺之祕籙。",
        "translation": "Being permanently freed from the obscurations, he collected the legacy texts of the Kaida collection and compiled the secret books on the bees’ terraces.",
        "source": "T15n0646_001:0706a21_6"
    },
    {
        "source_sentence": "今於大福先寺翻譯院所更譯三藏所言，入定不定印經者，此明退不退之心，",
        "translation": "Now, at the transla­ tation hall of Dafuxian Monastery, there's a scripture that enters concentration and doesn't set the seal. This explains the mind that regresses and doesn't regress.",
        "source": "T15n0646_001:0706a22_7"
    },
    {
        "source_sentence": "前二後三，雖有遲速，如來設教，同趣菩提，既顯神呪之功，莊嚴最上，",
        "translation": "Although the first two and last three are slow and quick, the Tathāgata teaches that they all share the same goal of enlightenment. Having shown the power of supernatural spells, he adorns them with the utmost splendor.",
        "source": "T15n0646_001:0706a24_8"
    },
    {
        "source_sentence": "爰述下生之記，說法度人。",
        "translation": "I'll record the records of my descendants who taught the Dharma and liberated people.",
        "source": "T15n0646_001:0706a25_9"
    },
    {
        "source_sentence": "三藏法師義淨等，並緇俗之綱維、紺坊之龍象，德包初地、道轥彌天，",
        "translation": "The Tripitaka Master Yijing and others of the Tripiṭaka studied the theories of Buddhism with such virtues that they embraced the teachings of the first stage and the heaven of enlightenment in the realm of omniscience.",
        "source": "T15n0646_001:0706a26_10"
    },
    {
        "source_sentence": "光我紹隆之基，更峻住持之業。",
        "translation": "It shines on the foundation of our Shaolong, and it's even higher than the karma of abiding and maintaining.",
        "source": "T15n0646_001:0706a27_11"
    },
    {
        "source_sentence": "以久視元年歲次庚子五月五日，繕寫畢功，重開甘露之門，方布大雲之蔭，",
        "translation": "On the fifth day of the fifth month in the first year of the Kusinagara era, on the fifth day of the fifth month in the ninth year of the Gengzi period (557 C.E.",
        "source": "T15n0646_001:0706a28_12"
    },
    {
        "source_sentence": "所冀芥城數極，鳥筆猶傳，拂石年窮，樹經無泯，弘濟覃於百億，遷拔被於恒沙，",
        "translation": "I hope that the number of mustard-seed castles will be as great as ever, even if a bird’s brush or stone brush is exhausted by the age of old. The trees and scriptures are preserved without extinction for as",
        "source": "T15n0646_001:0706b01_13"
    },
    {
        "source_sentence": "部帙條流，列之於左。",
        "translation": "The branches of the order are arranged on the left.",
        "source": "T15n0646_001:0706b03_14"
    },
    {
        "source_sentence": "入定不定印經",
        "translation": "Sutra of the Indeterminate Seal of Entry into Meditation",
        "source": "T15n0646_001:0706b06_0"
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yogâcārabhūmi in Sanskrit",
        "source": "T15n0646_001:0706b08_0"
    },
    {
        "source_sentence": "如是我聞：一時薄伽梵，在王舍城鷲峯山中，與大苾芻眾千二百五十人俱，",
        "translation": "Thus I have heard: One time, the Bhagavān was staying at Rājagaha, on Vulture Peak in the city of Rājagṛha, accompanied by one thousand two hundred and fifty bhikṣus.",
        "source": "T15n0646_001:0706b09_0"
    },
    {
        "source_sentence": "菩薩摩訶薩六十億百千那庾多，其名曰：妙吉祥菩薩、觀自在菩薩、大勢至菩薩、藥王菩薩、藥上菩薩、集雷音王菩薩，",
        "translation": "“There were sixty billion trillion great enlightening beings, called Marvelous Auspicious Enlightening Being, Bodhisattva Avalokiteśvara, Bodhisattva Maheśvara, Bodhisattva Bhaiṣajyarāja, Bo",
        "source": "T15n0646_001:0706b10_1"
    },
    {
        "source_sentence": "如是等菩薩摩訶薩而為上首，一切皆得寂靜決擇三摩地、健行三摩地、甚深不動海潮三摩地，",
        "translation": "Such great enlightening beings as these, led by the supreme leader, all attain the concentration of tranquil determination, the concentration of vigor, the concentration of profound unmoving ocean tide.",
        "source": "T15n0646_001:0706b13_2"
    },
    {
        "source_sentence": "成就灌頂陀羅尼、成就無邊諸佛色身陀羅尼。",
        "translation": "He accomplishes the dhāraṇī of consecration and accomplishes the dhāraṇī of the form body of the infinite buddhas.",
        "source": "T15n0646_001:0706b15_3"
    },
    {
        "source_sentence": "爾時妙吉祥菩薩白佛言：「世尊！",
        "translation": "It was then that the Marvelous Auspicious Bodhisattva said to the Buddha, Bhagavān!",
        "source": "T15n0646_001:0706b16_4"
    },
    {
        "source_sentence": "惟願世尊為諸菩薩演說入定不定印法門，我等入此法印故，便能解了：此是不定菩薩，",
        "translation": "“World-honored One, may these bodhisattvas explain to them the teaching of the indeterminate mudrā of entering absorption! Because they enter this dharma-mudrā, we will be able to understand:",
        "source": "T15n0646_001:0706b17_5"
    },
    {
        "source_sentence": "求無上正等正覺，於無上智道而有退轉；",
        "translation": "They seek the supreme perfect enlightenment, yet they turn back on the path of unexcelled knowledge.",
        "source": "T15n0646_001:0706b19_6"
    },
    {
        "source_sentence": "此是決定菩薩，求無上正等正覺，於無上智道而不退轉。」",
        "translation": "This is a certain bodhisattva who seeks unsurpassed perfect enlightenment and doesn't regress from the path of unsurpassed cognition.",
        "source": "T15n0646_001:0706b20_7"
    },
    {
        "source_sentence": "爾時世尊告妙吉祥童子言：「妙吉祥！",
        "translation": "It was then that the Bhagavān addressed the Boy Miaojixiang, saying, Miaojixiang!",
        "source": "T15n0646_001:0706b21_8"
    },
    {
        "source_sentence": "當知菩薩有五種行。",
        "translation": "You should know that there are five kinds of bodhisattva practice.",
        "source": "T15n0646_001:0706b22_9"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T15n0646_001:0706b23_0"
    },
    {
        "source_sentence": "所謂羊車行、象車行、日月神力行、聲聞神力行、如來神力行。",
        "translation": "The so-called practice of the goat cart, the elephant cart, the miraculous practice of the sun and moon, the miraculous practice of the śrāvakas, and the miraculous practice of the Tathāgata.",
        "source": "T15n0646_001:0706b23_1"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0706b24_2"
    },
    {
        "source_sentence": "是為菩薩五種行。",
        "translation": "These are the five kinds of bodhisattva practice.",
        "source": "T15n0646_001:0706b24_3"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0706b25_4"
    },
    {
        "source_sentence": "初二菩薩於無上正等正覺，是不決定；",
        "translation": "The first and second enlightening beings are not certain of unsurpassed true awakening.",
        "source": "T15n0646_001:0706b25_5"
    },
    {
        "source_sentence": "後三菩薩於無上正等正覺，是得決定。」",
        "translation": "The last three bodhisattvas attain certainty in unsurpassed perfect enlightenment.",
        "source": "T15n0646_001:0706b26_6"
    },
    {
        "source_sentence": "妙吉祥菩薩白佛言：「世尊！",
        "translation": "Miaojixiang pusa said to the Buddha, Bhagavān!",
        "source": "T15n0646_001:0706b27_7"
    },
    {
        "source_sentence": "云何二不定菩薩為求無上正等正覺，於無上智道而有退轉？",
        "translation": "How do the two indeterminate bodhisattvas who seek unsurpassed perfect enlightenment regress from the path of unsurpassed cognition?",
        "source": "T15n0646_001:0706b27_8"
    },
    {
        "source_sentence": "云何三決定菩薩為求無上正等正覺，於無上智道而不退轉？」",
        "translation": "How are the three determined bodhisattvas who seek unsurpassed perfect enlightenment and don't regress from the path of unsurpassed cognition?",
        "source": "T15n0646_001:0706b29_9"
    },
    {
        "source_sentence": "佛告妙吉祥：「所謂羊車行、象車行，此二菩薩為求無上正等正覺，於無上智道而有退轉；",
        "translation": "The Buddha told Mañjuśrī: “These two bodhisattvas, the so-called carts of sheep and the carts of elephants, have regressed on the path of unsurpassed knowledge in order to seek supreme true awak",
        "source": "T15n0646_001:0706c01_10"
    },
    {
        "source_sentence": "日月神力行、聲聞神力行、如來神力行，此三菩薩為求無上正等正覺，",
        "translation": "The deeds of the sun and moon, the deeds of śrāvakas, the deeds of buddhas, and the deeds of enlightening beings—these three bodhisattvas seek supreme perfect enlightenment",
        "source": "T15n0646_001:0706c03_11"
    },
    {
        "source_sentence": "於無上智道而不退轉。",
        "translation": "They don't regress from the path of unsurpassed cognition.",
        "source": "T15n0646_001:0706c05_12"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0706c05_13"
    },
    {
        "source_sentence": "云何羊車行菩薩？",
        "translation": "What is a bodhisattva who practices like a cart drawn by sheep?",
        "source": "T15n0646_001:0706c06_0"
    },
    {
        "source_sentence": "譬如有人為大事因緣故、重事因緣故，欲過五佛剎微塵數世界。",
        "translation": "It's like a person who wants to go beyond as many worlds as there are atoms in five buddha-lands for the sake of great causes and conditions and serious causes and conditions.",
        "source": "T15n0646_001:0706c06_1"
    },
    {
        "source_sentence": "彼自思惟：『我今當乘何乘而能越過如是世界？』",
        "translation": "They think to themselves, 'What vehicle will I ride now that I'll be able to transcend such a world?'",
        "source": "T15n0646_001:0706c07_2"
    },
    {
        "source_sentence": "便作是念：『當乘羊車過彼世界。』",
        "translation": "He then had this thought, 'Should I ride a sheep's chariot to pass through that world?'",
        "source": "T15n0646_001:0706c09_0"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0706c09_1"
    },
    {
        "source_sentence": "是人即乘羊車隨路而去，久受勞苦行百踰繕那，忽遇大風吹，令却退八十踰繕那。",
        "translation": "That man then rode off in a goat cart along the road and departed. After enduring hardship for a hundred yojanas, he was suddenly driven away by a great wind that caused him to retreat for eighty yojanas.",
        "source": "T15n0646_001:0706c09_2"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0706c11_3"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T15n0646_001:0706c12_4"
    },
    {
        "source_sentence": "是人乘彼羊車，或一劫或百劫，或千劫或億劫，或不可說不可說劫，而能超越一世界耶？」",
        "translation": "Is this person riding that goat cart capable of going beyond a single world for an eon, a hundred eons, a thousand eons, a million eons, or an incalculably long eon?",
        "source": "T15n0646_001:0706c12_5"
    },
    {
        "source_sentence": "妙吉祥言：「不也。",
        "translation": "Miaojixiang said, No.",
        "source": "T15n0646_001:0706c14_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0646_001:0706c14_7"
    },
    {
        "source_sentence": "是人乘彼羊車，或一劫或百劫，或千劫或億劫，或不可說不可說劫，而能超越一世界者，",
        "translation": "That person rides in that goat cart for an eon, or a hundred eons, or a thousand eons, or a hundred million eons, or an incalculably long eon, and yet they can transcend one world.",
        "source": "T15n0646_001:0706c14_8"
    },
    {
        "source_sentence": "無有是處。」",
        "translation": "There's no such place.",
        "source": "T15n0646_001:0706c16_9"
    },
    {
        "source_sentence": "佛言：「如是如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T15n0646_001:0706c17_10"
    },
    {
        "source_sentence": "妙吉祥，若善男子、善女人，發心希求無上正等正覺，便與聲聞同共住止，",
        "translation": "“O Mañjuśrī! If there are good men and good women who have set their minds on seeking the supreme awakening, they will live together with the śrāvakas.",
        "source": "T15n0646_001:0706c17_11"
    },
    {
        "source_sentence": "承事親近狎習談論，若在園林及於寺中同經行處，讀誦思惟聲聞乘教解釋其義，",
        "translation": "They serve and associate with Buddhist practitioners, studying and discussing the teachings. If they are in a park or monastery, reciting and reflecting on the teachings of the Listeners’ Vehicle (śrāvaka-nirdeśa",
        "source": "T15n0646_001:0706c19_12"
    },
    {
        "source_sentence": "或復教他讀誦思惟聲聞乘教解釋其義，由此受持聲聞乘教植善根故，智慧微劣退無上智道，",
        "translation": "They may also teach others to recite and contemplate the teachings of the vehicles of the disciples, explaining their meanings. Because they accept and uphold the teachings of the vehicles of the disciples and plant good roots in them, their wisdom is",
        "source": "T15n0646_001:0706c21_13"
    },
    {
        "source_sentence": "雖先修習菩提之心慧根慧眼，然由受持聲聞乘教植善根故，令其根鈍，",
        "translation": "Even though they had previously cultivated the mind of enlightenment, the faculty of wisdom and the eye of insight, yet because they accepted and upheld the teachings of the vehicle of disciple-vehicle they caused their faculties to become",
        "source": "T15n0646_001:0706c23_14"
    },
    {
        "source_sentence": "即便退失無上智道。",
        "translation": "They'll even regress from the path of unsurpassed cognition.",
        "source": "T15n0646_001:0706c24_15"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0706c25_16"
    },
    {
        "source_sentence": "譬如有人患目闇閉，欲令開故經月醫療其目便愈。",
        "translation": "It's like a person with a blind eye that's closed in darkness and wants to be opened, but after months of healing their eyes will heal them.",
        "source": "T15n0646_001:0706c25_17"
    },
    {
        "source_sentence": "時有怨家，即以一掬蓽茇細末置其眼中，遂還闇閉。",
        "translation": "An enemy householder then placed a scoop of coarse and fine powder in his eyes, and he returned to the darkness.",
        "source": "T15n0646_001:0706c26_18"
    },
    {
        "source_sentence": "如是如是！",
        "translation": "Just so, just so!",
        "source": "T15n0646_001:0706c27_19"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0706c28_20"
    },
    {
        "source_sentence": "彼菩薩雖先修習菩提之心慧根慧眼，然由受持聲聞乘教植善根故，令其根鈍，",
        "translation": "Even though those bodhisattvas had previously cultivated the mind of enlightenment, the faculty of wisdom and the eye of wisdom, yet because they accepted and upheld the teachings of the śrāvaka vehicle, they caused their faculties to become",
        "source": "T15n0646_001:0706c28_21"
    },
    {
        "source_sentence": "即便退失無上智道。",
        "translation": "They'll even regress from the path of unsurpassed cognition.",
        "source": "T15n0646_001:0707a01_22"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707a01_23"
    },
    {
        "source_sentence": "如是名為羊車行菩薩。",
        "translation": "Thus, this is called the bodhisattva who practices like a sheep's cart.",
        "source": "T15n0646_001:0707a01_24"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0707a02_25"
    },
    {
        "source_sentence": "云何象車行菩薩？",
        "translation": "What's the elephant cart-following bodhisattva?",
        "source": "T15n0646_001:0707a02_26"
    },
    {
        "source_sentence": "譬如有人為大事因緣故、重事因緣故，欲過如前微塵世界。",
        "translation": "It's like a person who wants to go beyond the tiny world as before because of the causes and conditions of great things and the causes and conditions of heavy things.",
        "source": "T15n0646_001:0707a03_0"
    },
    {
        "source_sentence": "彼自思惟：『我今當乘何乘而能越過如是世界？』",
        "translation": "They think to themselves, 'What vehicle will I ride now that I'll be able to transcend such a world?'",
        "source": "T15n0646_001:0707a04_1"
    },
    {
        "source_sentence": "便作是念：『我當乘彼八支具足上妙象車過彼世界。』",
        "translation": "He then thought, 'Should I ride that marvelous elephant chariot with the eight limbs and be fully equipped to pass through that world?'",
        "source": "T15n0646_001:0707a05_2"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707a06_3"
    },
    {
        "source_sentence": "是人即乘象車隨路而去，經于百年行二千踰繕那，忽遇大風吹，令却退千踰繕那。",
        "translation": "That man then rode the elephant chariot along the road and departed. After one hundred yojanas of traveling for two thousand yojanas, he suddenly encountered a great wind blowing and causing him to retreat by a thousand yojanas.",
        "source": "T15n0646_001:0707a06_4"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707a08_5"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T15n0646_001:0707a08_6"
    },
    {
        "source_sentence": "是人乘彼象車，或一劫或百劫，或千劫或千億劫，或不可說不可說劫，",
        "translation": "That person rides that elephant cart for an eon, or a hundred eons, or a thousand eons, or a thousand billion eons, or an incalculably long eon.",
        "source": "T15n0646_001:0707a09_7"
    },
    {
        "source_sentence": "而能超越一世界耶？」",
        "translation": "Is it possible to transcend a single world?",
        "source": "T15n0646_001:0707a10_8"
    },
    {
        "source_sentence": "妙吉祥言：「不也。",
        "translation": "Miaojixiang said, No.",
        "source": "T15n0646_001:0707a11_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0646_001:0707a11_10"
    },
    {
        "source_sentence": "是人乘彼象車，或一劫或百劫，或千劫或千億劫，或不可說不可說劫，",
        "translation": "That person rides that elephant cart for an eon, or a hundred eons, or a thousand eons, or a thousand billion eons, or an incalculably long eon.",
        "source": "T15n0646_001:0707a11_11"
    },
    {
        "source_sentence": "而能超越一世界者，無有是處。」",
        "translation": "There's no place for someone who can transcend a single world.",
        "source": "T15n0646_001:0707a13_12"
    },
    {
        "source_sentence": "「如是如是！",
        "translation": "So it is, so it is!",
        "source": "T15n0646_001:0707a14_0"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707a14_1"
    },
    {
        "source_sentence": "若善男子、善女人，發心希求無上正等正覺，便與聲聞同共住止，承事親近狎習談論，",
        "translation": "“Furthermore, if sons and daughters of a virtuous family are determined to seek the supreme awakening, then they live together with śrāvakas, serving, being intimate, engaged in conversation.",
        "source": "T15n0646_001:0707a14_2"
    },
    {
        "source_sentence": "共為受用，若在園林及於寺中同經行處，讀誦思惟聲聞乘教解釋其義，",
        "translation": "For the sake of their common enjoyment, if they are in a park or monastery with the same scriptures and practices, they recite and contemplate the teachings of the śrāvaka vehicle to explain its meaning.",
        "source": "T15n0646_001:0707a16_3"
    },
    {
        "source_sentence": "或復教他讀誦思惟聲聞乘教解釋其義，由此受持聲聞乘教植善根故，智慧微劣退無上智道，",
        "translation": "They may also teach others to recite and contemplate the teachings of the vehicles of the disciples, explaining their meanings. Because they accept and uphold the teachings of the vehicles of the disciples and plant good roots in them, their wisdom is",
        "source": "T15n0646_001:0707a18_0"
    },
    {
        "source_sentence": "雖先修習菩提之心慧根慧眼，然由受持聲聞乘教植善根故，令其根鈍，",
        "translation": "Even though they had previously cultivated the mind of enlightenment, the faculty of wisdom and the eye of insight, yet because they accepted and upheld the teachings of the vehicle of disciple-vehicle they caused their faculties to become",
        "source": "T15n0646_001:0707a20_1"
    },
    {
        "source_sentence": "即便退失無上智道。",
        "translation": "They'll even regress from the path of unsurpassed cognition.",
        "source": "T15n0646_001:0707a21_2"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707a22_3"
    },
    {
        "source_sentence": "譬如大木長百千踰繕那，墮大海中隨波流汎。",
        "translation": "It's like a great tree 100,000 yojanas long that falls into the ocean and flows along with the waves.",
        "source": "T15n0646_001:0707a22_4"
    },
    {
        "source_sentence": "有諸空居眾多藥叉，於大海中牽之令住，復以縱廣五千踰繕那鐵碪繫之令住。",
        "translation": "There are many yakṣas who live in the sky and pull them into the ocean to make them stay there, and they're also tied up with an iron rope 5,000 yojanas long and wide to make them stay there.",
        "source": "T15n0646_001:0707a23_5"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707a25_6"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T15n0646_001:0707a25_7"
    },
    {
        "source_sentence": "此之大木能越大海，與諸有情作利益耶？」",
        "translation": "Is this great tree able to cross the ocean and work for the benefit of sentient beings?",
        "source": "T15n0646_001:0707a25_8"
    },
    {
        "source_sentence": "妙吉祥言：「不也。",
        "translation": "Miaojixiang said, No.",
        "source": "T15n0646_001:0707a26_9"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T15n0646_001:0707a27_10"
    },
    {
        "source_sentence": "佛言：「如是如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T15n0646_001:0707a27_11"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707a27_12"
    },
    {
        "source_sentence": "彼菩薩雖復修習菩提之心，受持大乘植諸善本，然由修習聲聞法故，於一切智海牽之令退，",
        "translation": "“Although those bodhisattvas cultivate the determination for enlightenment, they retain the great vehicle and plant roots of goodness; yet because they practice the teachings of the disciples, they are pulled back by the ocean of omniscience.",
        "source": "T15n0646_001:0707a27_13"
    },
    {
        "source_sentence": "不能進趣一切智海，於生死海中不能救濟一切有情。",
        "translation": "They can't advance to the ocean of omniscience, and they can't save all sentient beings in the sea of birth-and-death.",
        "source": "T15n0646_001:0707b01_14"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707b02_15"
    },
    {
        "source_sentence": "如是名為象車行菩薩。",
        "translation": "Thus, this is called the elephant chariot-following bodhisattva.",
        "source": "T15n0646_001:0707b02_16"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0707b03_0"
    },
    {
        "source_sentence": "云何日月神力行菩薩？",
        "translation": "What is the bodhisattva's practice of the miraculous power of the sun and moon?",
        "source": "T15n0646_001:0707b03_1"
    },
    {
        "source_sentence": "譬如有人為大事因緣故、重事因緣故，欲過如前微塵數世界。",
        "translation": "It's like a person who wants to go beyond as many worlds as there are atoms in the previous one because of the causes and conditions of great things and the causes and conditions of heavy things.",
        "source": "T15n0646_001:0707b03_2"
    },
    {
        "source_sentence": "彼自思惟：『我今當作何神通力而能超越如是世界？』",
        "translation": "They thought to themselves, 'What will I do now with my supernormal powers to be able to transcend such a world?'",
        "source": "T15n0646_001:0707b05_3"
    },
    {
        "source_sentence": "便作是念：『我當作彼日月神力過彼世界。』",
        "translation": "He then thought, 'I'll make that day and month of mystical power go beyond that world.'",
        "source": "T15n0646_001:0707b06_4"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707b07_5"
    },
    {
        "source_sentence": "是人即便作日月神力隨路而去。",
        "translation": "That person then performed the miraculous power of the sun and moon, followed the path, and departed.",
        "source": "T15n0646_001:0707b07_6"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707b08_7"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T15n0646_001:0707b08_8"
    },
    {
        "source_sentence": "是人能越彼世界耶？」",
        "translation": "Will this person be able to transcend that world?",
        "source": "T15n0646_001:0707b08_9"
    },
    {
        "source_sentence": "妙吉祥菩薩白佛言：「世尊！",
        "translation": "Miaojixiang pusa said to the Buddha, Bhagavān!",
        "source": "T15n0646_001:0707b09_10"
    },
    {
        "source_sentence": "是人能越如是世界，而於長路多歷勤苦。」",
        "translation": "That person can transcend such a world and travel long distances with much suffering.",
        "source": "T15n0646_001:0707b09_11"
    },
    {
        "source_sentence": "佛言：「如是。",
        "translation": "The Buddha said, So it is.",
        "source": "T15n0646_001:0707b10_12"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707b10_13"
    },
    {
        "source_sentence": "若善男子、善女人，發心希求無上正等正覺，不與聲聞同共住止，承事親近狎習談論，",
        "translation": "“Good sons and good daughters, if they decide to seek the unsurpassed true awakening, they won’t live together with śrāvakas, serve, associate, be intimate, or engage in discussion.",
        "source": "T15n0646_001:0707b11_14"
    },
    {
        "source_sentence": "亦不共彼受用衣食，不在園林及於寺中同經行處，讀誦思惟聲聞乘教乃至一頌，",
        "translation": "They won’t share their food and clothing with others, nor will they be in a park or monastery where there are similar scriptures or practices, reciting or contemplating the teachings of the vehicle of the śrāvakas, even for one verse.",
        "source": "T15n0646_001:0707b13_15"
    },
    {
        "source_sentence": "亦不教他讀誦思惟聲聞乘教；",
        "translation": "Nor do they teach others to recite and reflect upon the teachings of the vehicle of disciples.",
        "source": "T15n0646_001:0707b15_0"
    },
    {
        "source_sentence": "常惟讀誦大乘，演說大乘。",
        "translation": "He always recites the Mahayana and expounds the Mahayana.",
        "source": "T15n0646_001:0707b15_1"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707b16_2"
    },
    {
        "source_sentence": "如是名為日月神力行菩薩。",
        "translation": "Thus, this is called the bodhisattva who practices with the miraculous power of the sun and moon.",
        "source": "T15n0646_001:0707b16_3"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0707b17_4"
    },
    {
        "source_sentence": "云何聲聞神力行菩薩？",
        "translation": "What are śrāvakas and bodhisattvas who practice with supernormal powers?",
        "source": "T15n0646_001:0707b17_5"
    },
    {
        "source_sentence": "譬如有人為大事因緣故、重事因緣故，欲過如前微塵數世界。",
        "translation": "It's like a person who wants to go beyond as many worlds as there are atoms in the previous one because of the causes and conditions of great things and the causes and conditions of heavy things.",
        "source": "T15n0646_001:0707b17_6"
    },
    {
        "source_sentence": "彼自思惟：『我今當作何神通力而能超越如是世界？』",
        "translation": "They thought to themselves, 'What will I do now with my supernormal powers to be able to transcend such a world?'",
        "source": "T15n0646_001:0707b19_7"
    },
    {
        "source_sentence": "便作是念：『我當作彼聲聞神力過彼世界。』",
        "translation": "He then thought, 'I will become a śrāvaka with supernormal powers that surpass those worlds.'",
        "source": "T15n0646_001:0707b20_8"
    },
    {
        "source_sentence": "即以聲聞神力過彼世界。",
        "translation": "That's when he uses the śrāvaka's supernormal power to go beyond that world.",
        "source": "T15n0646_001:0707b21_9"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707b22_10"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T15n0646_001:0707b22_11"
    },
    {
        "source_sentence": "是人能越彼世界耶？」",
        "translation": "Will this person be able to transcend that world?",
        "source": "T15n0646_001:0707b22_12"
    },
    {
        "source_sentence": "妙吉祥菩薩白佛言：「世尊！",
        "translation": "Miaojixiang pusa said to the Buddha, Bhagavān!",
        "source": "T15n0646_001:0707b23_13"
    },
    {
        "source_sentence": "是人能越如是世界。」",
        "translation": "That person can transcend such a world.",
        "source": "T15n0646_001:0707b23_14"
    },
    {
        "source_sentence": "佛言：「如是如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T15n0646_001:0707b24_15"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707b24_16"
    },
    {
        "source_sentence": "若善男子、善女人，發心希求無上正等正覺，不與聲聞同共住止，承事親近狎習談論，",
        "translation": "“Good sons and good daughters, if they decide to seek the unsurpassed true awakening, they won’t live together with śrāvakas, serve, associate, be intimate, or engage in discussion.",
        "source": "T15n0646_001:0707b24_17"
    },
    {
        "source_sentence": "亦不共彼受用衣食，不在園林及於寺中同經行處，讀誦思惟聲聞乘教乃至一頌，",
        "translation": "They won’t share their food and clothing with others, nor will they be in a park or monastery where there are similar scriptures or practices, reciting or contemplating the teachings of the vehicle of the śrāvakas, even for one verse.",
        "source": "T15n0646_001:0707b26_18"
    },
    {
        "source_sentence": "亦不教他讀誦思惟聲聞乘教；",
        "translation": "Nor do they teach others to recite and reflect upon the teachings of the vehicle of disciples.",
        "source": "T15n0646_001:0707b28_19"
    },
    {
        "source_sentence": "常惟讀誦演說大乘，於深信大乘、讀誦大乘、攝受大乘者生恭敬心，親奉歸向而共住止，",
        "translation": "They always recite and expound the Mahayana teachings. They deeply believe in the Mahayana, recite it, and embrace it with reverence. They wholeheartedly venerate and serve it, and they abide by it together.",
        "source": "T15n0646_001:0707b29_20"
    },
    {
        "source_sentence": "承事親近狎習談論，常求大乘受持讀誦，復以種種香華塗香末香燈明華鬘，",
        "translation": "They attended and attended the assembly, always seeking the Mahayana teachings to preserve and recite them. They also offered various kinds of incense, flowers, ointments, scented powders, lamps, lights, flower garlands",
        "source": "T15n0646_001:0707c02_21"
    },
    {
        "source_sentence": "敬心供養常惟讀誦大乘經典，以歡喜心為人演說。",
        "translation": "With reverence and offerings, he always recites the great vehicle scriptures and teaches them to others with a joyous mind.",
        "source": "T15n0646_001:0707c04_22"
    },
    {
        "source_sentence": "於未學菩薩心生恭敬，含笑先言，語不麁獷，所說柔軟令人樂聞，假使遭遇失命因緣，",
        "translation": "The enlightening beings are respectful to those who have not studied yet, and they laugh at their words. They speak without coarseness or harshness, gently and patiently, so as to please the hearers. Even if they were to meet with",
        "source": "T15n0646_001:0707c05_23"
    },
    {
        "source_sentence": "亦不捨離大乘之心。",
        "translation": "Nor does he abandon the mind of the great vehicle.",
        "source": "T15n0646_001:0707c07_24"
    },
    {
        "source_sentence": "若有菩薩，發趣大乘、讀誦大乘、攝受大乘，常於此人起增上心而為供養，",
        "translation": "“Furthermore, if there is a bodhisattva who sets out for the Great Vehicle, recites the Mahayana and embraces the Mahayana, he should always make offerings to them with an increasingly higher aspiration.",
        "source": "T15n0646_001:0707c07_25"
    },
    {
        "source_sentence": "亦不與他共為諍競，於未曾聞大乘經典常樂希求，於說法者起恭敬心生大師想，",
        "translation": "They do not engage in disputes or controversies with others. They are always eager to hear the teachings of the Mahayana scriptures that they have never heard before. They give rise to feelings of respect and reverence toward those who expound the Teaching",
        "source": "T15n0646_001:0707c09_26"
    },
    {
        "source_sentence": "於未學菩薩亦生敬心，於他過咎若實不實不應訶責，亦不好求他人過失，",
        "translation": "A bodhisattva who hasn’t studied yet becomes respectful, doesn’t blame others for their faults or blameworthiness if they are true or unreal, and doesn’t like to seek faults from others.",
        "source": "T15n0646_001:0707c11_27"
    },
    {
        "source_sentence": "常樂修行慈悲喜捨。",
        "translation": "They always delight in cultivating kindness, pity, joy, and equanimity.",
        "source": "T15n0646_001:0707c13_28"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707c13_29"
    },
    {
        "source_sentence": "如是名為聲聞神力行菩薩。",
        "translation": "Thus, they're called śrāvakas and bodhisattvas who practice with supernormal powers.",
        "source": "T15n0646_001:0707c13_30"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0707c14_31"
    },
    {
        "source_sentence": "云何如來神力行菩薩？",
        "translation": "What's the enlightening being who practices the Tathāgata's spiritual powers?",
        "source": "T15n0646_001:0707c14_32"
    },
    {
        "source_sentence": "譬如有人為大事因緣故、重事因緣故，欲過如前微塵數世界。",
        "translation": "It's like a person who wants to go beyond as many worlds as there are atoms in the previous one because of the causes and conditions of great things and the causes and conditions of heavy things.",
        "source": "T15n0646_001:0707c15_33"
    },
    {
        "source_sentence": "彼自思惟：『我今當作何神通力而能疾過如是世界？』",
        "translation": "They thought to themselves, 'What will I do with my supernormal powers now that I can quickly pass beyond such a world?'",
        "source": "T15n0646_001:0707c16_34"
    },
    {
        "source_sentence": "便作是念：『我當作彼如來神力越彼世界。』",
        "translation": "He then had this thought, 'I will become the Tathāgata's supernormal power to transcend that world.'",
        "source": "T15n0646_001:0707c17_35"
    },
    {
        "source_sentence": "即以如來神力超彼世界。",
        "translation": "That is, he uses the Tathāgata's miraculous power to transcend that world.",
        "source": "T15n0646_001:0707c18_36"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707c19_37"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T15n0646_001:0707c19_38"
    },
    {
        "source_sentence": "是人能越彼世界耶？」",
        "translation": "Will this person be able to transcend that world?",
        "source": "T15n0646_001:0707c19_39"
    },
    {
        "source_sentence": "妙吉祥菩薩白佛言：「世尊！",
        "translation": "Miaojixiang pusa said to the Buddha, Bhagavān!",
        "source": "T15n0646_001:0707c20_40"
    },
    {
        "source_sentence": "是人速能超彼世界。」",
        "translation": "That person will quickly be able to transcend that world.",
        "source": "T15n0646_001:0707c21_0"
    },
    {
        "source_sentence": "佛言：「如是如是！",
        "translation": "The Buddha said, So it is!",
        "source": "T15n0646_001:0707c21_1"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0707c21_2"
    },
    {
        "source_sentence": "若善男子、善女人，發心希求無上正等正覺，不與聲聞同共住止，承事親近狎習談論，",
        "translation": "“Good sons and good daughters, if they decide to seek the unsurpassed true awakening, they won’t live together with śrāvakas, serve, associate, be intimate, or engage in discussion.",
        "source": "T15n0646_001:0707c22_3"
    },
    {
        "source_sentence": "亦不共彼受用衣食，不在園林及於寺中同經行處，讀誦思惟聲聞乘教乃至一頌，",
        "translation": "They won’t share their food and clothing with others, nor will they be in a park or monastery where there are similar scriptures or practices, reciting or contemplating the teachings of the vehicle of the śrāvakas, even for one verse.",
        "source": "T15n0646_001:0707c24_0"
    },
    {
        "source_sentence": "亦不教他讀誦思惟聲聞乘教；",
        "translation": "Nor do they teach others to recite and reflect upon the teachings of the vehicle of disciples.",
        "source": "T15n0646_001:0707c25_1"
    },
    {
        "source_sentence": "常惟讀誦大乘、演說大乘，於身語心常令清淨，於戒善法亦常安住，亦能令他淨身語心安住戒法。",
        "translation": "He always recites the great vehicle and expounds the great vehicle, always purifying body, speech, and mind, always abiding in morality and good qualities, and he can also cause others to purify body, speech, and mind and make them abide in",
        "source": "T15n0646_001:0707c26_2"
    },
    {
        "source_sentence": "若有菩薩，發趣大乘、讀誦大乘、攝受大乘，常於此人恭敬歸向，承事親近狎習談論，",
        "translation": "Suppose there is a bodhisattva who has set out for the Great Vehicle (Mahayana), recites the Mahayana scriptures, and embraces the Mahayana teachings. He should always pay respect to and reverence to these people, serve them, associa",
        "source": "T15n0646_001:0707c28_3"
    },
    {
        "source_sentence": "所有衣食共為受用，與彼菩薩而共同住同經行處，常求大乘、攝取大乘、受持大乘，",
        "translation": "Together with those bodhisattvas, they dwelled together in the same place of enlightenment. They always sought and practiced the Mahayana teachings, embraced the Mahayana teachings, and upheld the Mahayana teachings.",
        "source": "T15n0646_001:0708a01_4"
    },
    {
        "source_sentence": "以種種香華塗香末香燈明華鬘，敬心供養，常惟讀誦大乘經典，以歡喜心演說大乘。",
        "translation": "With various kinds of fragrant flowers, ointments, powdered incense, lamps, lights, and flower garlands they reverently offer them to the Buddha. They always recite only Mahayana scriptures and expound the Mahayana with joy",
        "source": "T15n0646_001:0708a03_5"
    },
    {
        "source_sentence": "於未學菩薩不起慢心，於餘菩薩亦令安住，含笑先言，語不麁獷，所說柔軟令人樂聞，",
        "translation": "“Great enlightening beings do not give rise to conceit toward the unlearned, but also cause others to abide in ease. They smile and make fun of their former sayings, speaking without harshness or roughness, gently and",
        "source": "T15n0646_001:0708a05_6"
    },
    {
        "source_sentence": "於他亦爾。",
        "translation": "So it is with others.",
        "source": "T15n0646_001:0708a07_7"
    },
    {
        "source_sentence": "假使遭遇失命因緣，亦不捨離大乘之心。",
        "translation": "Even if they experience the causes and conditions for losing their lives, they won't abandon the mind of the great vehicle.",
        "source": "T15n0646_001:0708a07_8"
    },
    {
        "source_sentence": "若有菩薩，發趣大乘、讀誦大乘、攝受大乘，以增上心歡喜親奉，亦教於他恭敬供養，",
        "translation": "Suppose there is a bodhisattva who sets out for the Great Vehicle, recites the Great Vehicle, and embraces the Great Vehicle. With an increasingly joyful mind he teaches others to honor and venerate him.",
        "source": "T15n0646_001:0708a08_9"
    },
    {
        "source_sentence": "亦不與他共為諍競。",
        "translation": "They won't compete with others.",
        "source": "T15n0646_001:0708a10_10"
    },
    {
        "source_sentence": "於未曾聞大乘經典常樂希求，於說法者起恭敬心生大師想，於未學菩薩不生慢心，",
        "translation": "They had never heard of the Mahayana scriptures, always desiring to seek them. They honored those who taught the Dharma with reverence and conceived the thought of a great teacher. They did not conceive the thought of arrogance toward enlightening",
        "source": "T15n0646_001:0708a11_11"
    },
    {
        "source_sentence": "於他過咎若實不實不應訶責，亦不好求他人過失，既自行已復教餘人如是修學。",
        "translation": "If someone's faults and blameworthiness are real or unreal, they shouldn't be reprimanded, and it's not good to seek the faults of others. Having done so themselves, they then teach others to cultivate them",
        "source": "T15n0646_001:0708a13_12"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0708a15_13"
    },
    {
        "source_sentence": "如是菩薩自觀有情失菩薩業者教令得業，亦能令他教諸有情失菩薩業者教令得業；",
        "translation": "“Thus, enlightening beings themselves observe that sentient beings lose the practice of enlightening beings and teach them to attain it. They can also cause others to teach sentient beings to lose the practice of enlightening beings and",
        "source": "T15n0646_001:0708a15_14"
    },
    {
        "source_sentence": "自觀有情失菩薩道者教令得道，亦能令他觀諸有情失菩薩道者教令得道；",
        "translation": "They themselves observe those who have lost the path of enlightening beings and lead them to attain it. They can also cause others to observe those who have lost the path of enlightening beings and lead them to attain it.",
        "source": "T15n0646_001:0708a17_15"
    },
    {
        "source_sentence": "自觀有情失菩薩行者教令得行，亦能令他觀諸有情失菩薩行者教令得行；",
        "translation": "They themselves observe those who are lost in the practice of enlightening beings and lead them to attain it. They can also cause others to observe those who are lost in the practice of enlightening beings and lead them to attain it.",
        "source": "T15n0646_001:0708a19_16"
    },
    {
        "source_sentence": "自觀有情失菩薩因者教令得因，亦能令他觀諸有情失菩薩因者教令得因；",
        "translation": "They themselves observe those who lose the cause of enlightening beings and teach others to gain the cause; they also can cause others to observe those who lose the cause of enlightening beings and teach others to gain the cause.",
        "source": "T15n0646_001:0708a20_17"
    },
    {
        "source_sentence": "自觀有情失菩薩善巧者令得善巧，亦能令他觀諸有情失菩薩善巧者令得善巧；",
        "translation": "“Great enlightening beings themselves observe the skillfulness of sentient beings who lose the skillful means of enlightening beings and let them attain it. They also can cause others to observe those who lose the skillful means of enl",
        "source": "T15n0646_001:0708a22_18"
    },
    {
        "source_sentence": "自觀有情失菩薩事者教令得事，亦能令他觀諸有情失菩薩事者教令得事；",
        "translation": "“Great enlightening beings themselves observe those who have lost the practice of enlightening beings and teach them to attain it, and they can also cause others to observe those who have lost the practice of enlightening beings and teach them to attain it",
        "source": "T15n0646_001:0708a24_19"
    },
    {
        "source_sentence": "自觀有情失菩薩加行力者令得加行，亦能令他觀諸有情失菩薩加行力者令得加行；",
        "translation": "He observes for himself the ways in which sentient beings who lose the power of enlightening beings’ empowering practice are led to attain empowerment, and he also enables others to observe those who lose the power of enlightening being",
        "source": "T15n0646_001:0708a26_20"
    },
    {
        "source_sentence": "自觀有情失菩薩行依止處者令得依處，亦能令他觀諸有情失菩薩行依止處者令得依處；",
        "translation": "“Great enlightening beings themselves observe those who are at a loss as to where the practice of enlightening beings’ undertakings can be relied upon, and they cause others to observe those who are at a loss as to where the practice of enl",
        "source": "T15n0646_001:0708a28_21"
    },
    {
        "source_sentence": "自觀有情失慈悲喜捨者令得慈悲喜捨，亦能令他觀諸有情失慈悲喜捨者令得慈悲喜捨；",
        "translation": "He observes for himself the loss of kindness, compassion, pity, joy, and equanimity of sentient beings, enabling them to attain kindness, compassion, joy, and equanimity. He also enables others to",
        "source": "T15n0646_001:0708b01_22"
    },
    {
        "source_sentence": "自觀有情失平等行者令得平等行，亦能令他觀諸有情失平等行者令得平等行；",
        "translation": "He observes for himself the impartiality of those who fail to act equally, and he also enables others to observe for themselves the impartiality of those who fail.",
        "source": "T15n0646_001:0708b03_23"
    },
    {
        "source_sentence": "自觀有情不信三寶者令信三寶，亦能令他觀諸有情不信三寶者令信三寶；",
        "translation": "“Great enlightening beings themselves observe those who do not believe in the Three Treasures and cause them to believe in the Teaching. They also can cause others to observe those who do not believe in the Teaching and cause them to believe in the Teaching.",
        "source": "T15n0646_001:0708b05_24"
    },
    {
        "source_sentence": "自觀有情失善法欲者令得善法欲，亦能令他觀諸有情失善法欲者令得善法欲；",
        "translation": "They themselves observe those who lose the craving for wholesome states and let them gain the craving for wholesome states. They can also cause others to observe those who lose the craving for wholesome states and let them gain the craving for whole",
        "source": "T15n0646_001:0708b07_25"
    },
    {
        "source_sentence": "自觀有情被繫縛囚執者令得解脫，亦能令他觀諸有情被繫縛囚執者令得解脫；",
        "translation": "He observes for himself the liberation of sentient beings who are bound and clinging, and he can also enable others to observe for themselves the liberation of sentient beings who are bound and clinging.",
        "source": "T15n0646_001:0708b09_26"
    },
    {
        "source_sentence": "自觀有情有病苦者施以醫藥，亦能令他觀諸有情有病苦者施以醫藥；",
        "translation": "They themselves observe the sickness and suffering of sentient beings and give medicine to them. They can also cause others to observe the sickness and suffering of sentient beings and give medicine to them.",
        "source": "T15n0646_001:0708b11_27"
    },
    {
        "source_sentence": "自觀有情失於佛所植善根者令得善根，亦能令他觀諸有情失善根者令得善根；",
        "translation": "They themselves observe that those who have lost the roots of goodness planted by buddhas are caused to attain roots of goodness, and they can also cause others to observe.",
        "source": "T15n0646_001:0708b12_28"
    },
    {
        "source_sentence": "自觀有情無依怙者為作歸趣，亦能令他觀諸有情無依怙者為作歸趣；",
        "translation": "They themselves observe sentient beings without reliance as the point of departure, and they can also cause others to observe sentient beings without reliance as the point of departure.",
        "source": "T15n0646_001:0708b14_29"
    },
    {
        "source_sentence": "自觀有情久睡眠者令得覺悟，亦能令他觀諸有情久睡眠者令得覺悟；",
        "translation": "He observes for himself the long-sleeping of sentient beings and enlightens them. He also can cause others to observe the long-sleeping of sentient beings and enlighten them.",
        "source": "T15n0646_001:0708b16_30"
    },
    {
        "source_sentence": "自觀有情生下賤者令生勝處，亦能令他觀諸有情生下賤者令生勝處；",
        "translation": "They themselves observe those who are inferior to beings and cause them to be born in a superior state. They also can cause others to observe those who are inferior to beings and cause them to be born in a superior state.",
        "source": "T15n0646_001:0708b18_31"
    },
    {
        "source_sentence": "自觀有情失菩提心者令得菩提心，亦能令他觀諸有情失菩提心者令得菩提心；",
        "translation": "They themselves observe those who lose the will for enlightenment to attain it, and they can also cause others to observe those who lose the will for enlightenment to attain it.",
        "source": "T15n0646_001:0708b19_32"
    },
    {
        "source_sentence": "自觀有情失法足者令得法足，亦能令他觀諸有情失法足者令得法足；",
        "translation": "“Great enlightening beings themselves observe sentient beings who lack the legs of the Teaching and make them attain the legs of the Teaching, and they also can cause others to observe those who lack the legs of the Teaching and attain",
        "source": "T15n0646_001:0708b21_33"
    },
    {
        "source_sentence": "自觀有情失福智資糧者令得資糧，亦能令他觀諸有情失福智資糧者令得資糧；",
        "translation": "He observes for himself the accumulation of sentient beings who lack the requisites of virtue and knowledge, and enables others to observe for themselves the accumulation of sentient beings who lack the requisites of virtue and knowledge.",
        "source": "T15n0646_001:0708b23_34"
    },
    {
        "source_sentence": "自觀有情失大乘信者令入正信，亦能令他觀諸有情失大乘信者令得正信；",
        "translation": "They themselves observe sentient beings who have lost faith in the Great Vehicle and cause them to enter right faith. They also can cause others to observe sentient beings who have lost faith in the Great Vehicle and lead them to attain right faith.",
        "source": "T15n0646_001:0708b25_35"
    },
    {
        "source_sentence": "自觀有情失戒護者令住戒護，亦能令他觀諸有情失戒護者令住戒護；",
        "translation": "He himself observes the discipline of sentient beings and causes them to abide in it. He can also cause others to observe the discipline of sentient beings and cause them to abide in it.",
        "source": "T15n0646_001:0708b27_0"
    },
    {
        "source_sentence": "自觀有情失法隨法者令其得法，亦能令他觀諸有情失法隨法者令得其法；",
        "translation": "“Great enlightening beings themselves observe sentient beings who fail to follow the teaching and cause them to attain truth; they also can cause others to observe sentient beings who fail to follow the teaching and cause them to attain truth.",
        "source": "T15n0646_001:0708b28_1"
    },
    {
        "source_sentence": "自觀有情失和忍者令得和忍，亦能令他觀諸有情失和忍者令得和忍；",
        "translation": "He observes for himself the tolerance of being harmonious toward those who are not harmonious, and he can also show others the tolerance of being harmonious toward those who are not harmonious.",
        "source": "T15n0646_001:0708c01_2"
    },
    {
        "source_sentence": "自觀有情失止觀者令住止觀，亦能令他觀諸有情失止觀者令得止觀；",
        "translation": "He observes for himself the ways in which sentient beings lose calming and insight, causing them to abide in calming and insight. He also can cause others to see those who lose calming and insight, enabling them to attain calming and",
        "source": "T15n0646_001:0708c03_3"
    },
    {
        "source_sentence": "自觀有情失菩薩精進者令住精進，亦能令他觀諸有情失菩薩精進者令得精進；",
        "translation": "They themselves observe those who lose the effort of enlightening beings and cause them to abide in energy. They also can cause others to observe those who lose the effort of enlightening beings and attain energy.",
        "source": "T15n0646_001:0708c04_4"
    },
    {
        "source_sentence": "自觀有情失布施調順知足者令得施等，亦能令他觀諸有情失施等者令得施等；",
        "translation": "He observes for himself the giving of sentient beings who lose generosity, etc., and causes those who are disciplined and content to attain it; he also enables others to observe [for themselves] the giving of sentient beings who lose it",
        "source": "T15n0646_001:0708c06_5"
    },
    {
        "source_sentence": "自觀有情失念慧持行者令得念等，亦能令他觀諸有情失念等者令得念等；",
        "translation": "He observes for himself the ways in which sentient beings lose mindfulness, wisdom, memory, etc., and lets those who uphold them gain mindfulness; he also enables others to observe [for themselves] the ways in which sentient beings lose mindfulness",
        "source": "T15n0646_001:0708c08_6"
    },
    {
        "source_sentence": "自觀有情失趣彼岸道者令趣彼岸道，亦能令他觀諸有情失趣彼岸道者令趣彼岸道；",
        "translation": "They themselves observe those who are on the other shore and lead them to the other shore. They can also cause others to observe those who are on the other shore and lead them to the other shore.",
        "source": "T15n0646_001:0708c10_7"
    },
    {
        "source_sentence": "自觀有情不生佛家者令生佛家，亦能令他觀諸有情不生佛家者令生佛家；",
        "translation": "They themselves observe sentient beings who are not born in the house of buddhahood and cause them to be born in the house of buddhahood; they also can cause others to observe those who are not born in the house of buddhahood and cause them to be born",
        "source": "T15n0646_001:0708c12_8"
    },
    {
        "source_sentence": "自觀有情失善友者令得善友，亦能令他觀諸有情失善友者令得善友；",
        "translation": "They themselves observe those who lose good friends and make them gain good friends. They also can cause others to observe those who lose good friends and make them gain good friends.",
        "source": "T15n0646_001:0708c14_9"
    },
    {
        "source_sentence": "自觀有情失利有情心者令得利有情心，亦能令他觀諸有情失利有情心者令得利有情心；",
        "translation": "Those who themselves observe sentient beings’ thoughts of gaining and losing sentient beings are caused to attain the thought of benefiting sentient beings. They can also cause others to observe sentient beings’ thoughts of gaining and losing sentient being",
        "source": "T15n0646_001:0708c15_10"
    },
    {
        "source_sentence": "自觀有情失依法者令得依法，亦能令他觀諸有情失依法者令得依法；",
        "translation": "They themselves observe those who are in error with regard to the law and enable them to attain truth. They can also cause others to observe those who are in error with regard to the law and enable them to attain truth.",
        "source": "T15n0646_001:0708c17_11"
    },
    {
        "source_sentence": "自觀有情失依智者令得依智，亦能令他觀諸有情失依智者令得依智；",
        "translation": "They themselves observe sentient beings who lose their knowledge of the support and enable them to attain knowledge of the support. They can also cause others to observe sentient beings who lose their knowledge of the support and enable them to attain knowledge of the support",
        "source": "T15n0646_001:0708c19_12"
    },
    {
        "source_sentence": "自觀有情失依義者令得依義，亦能令他觀諸有情失依義者令得依義；",
        "translation": "He observes for himself the meaning of those beings who lose their support and enables them to gain it. He also enables others to observe for themselves the meaning of those beings who lose their support and enables them to gain it.",
        "source": "T15n0646_001:0708c21_13"
    },
    {
        "source_sentence": "自觀有情失依了義經者令得依了義經，亦能令他觀諸有情失依了義經者令得依了義經；",
        "translation": "He observes for himself the scriptures of ultimate meaning that those who fail to rely on these scriptures will be led to rely on them, and he can also enable others to observe for themselves the scriptures of ultimate meaning that those who fail to rely",
        "source": "T15n0646_001:0708c22_14"
    },
    {
        "source_sentence": "自觀有情失四正勤者令得四正勤，亦能令他觀諸有情失四正勤者令得四正勤；",
        "translation": "He observes for himself the four kinds of right effort that enable those who lose the four kinds of right effort to attain the four kinds of right effort, and he also enables others to observe for themselves the four kinds of right effort that enable",
        "source": "T15n0646_001:0708c25_0"
    },
    {
        "source_sentence": "自觀有情失實語、法語、利益語、調伏語者，令住實語、法語、利益語、調伏語，",
        "translation": "He observes for himself that sentient beings who have lost true speech, Dharma speech, beneficial speech, and speech of liberation cause them to abide in true speech, Dharma speech, beneficial speech, and speech of liberation.",
        "source": "T15n0646_001:0708c26_1"
    },
    {
        "source_sentence": "亦能令他觀諸有情失實語、法語、利益語、調伏語者，令住實語、法語、利益語、調伏語；",
        "translation": "They can also cause others to perceive the speech of reality, the speech of truth, the speech of doctrine, the speech of benefit, the speech of benefit, and the speech of discipline.",
        "source": "T15n0646_001:0708c28_2"
    },
    {
        "source_sentence": "自觀有情見貧賤者令得富貴，亦能令他觀諸有情見貧賤者令得富貴。",
        "translation": "He observes for himself that sentient beings see the poor and make them rich and powerful, and he can also cause others to observe those who see the poor and make them rich and powerful.",
        "source": "T15n0646_001:0709a01_3"
    },
    {
        "source_sentence": "「菩薩摩訶薩，於諸有情起大慈心悉令周遍，作如是念：『彼諸有情無依無怙、無歸無趣、無洲無渚、無舍宅、無救護者，",
        "translation": "“Great enlightening beings give rise to great compassion toward sentient beings and cause them all to pervade, thinking, ‘Those sentient beings have no support, no home, no refuge, no destination, no continent, no island,",
        "source": "T15n0646_001:0709a03_4"
    },
    {
        "source_sentence": "我於何時能為有情作救護耶？』",
        "translation": "When will I be able to rescue sentient beings?'",
        "source": "T15n0646_001:0709a05_5"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0709a06_6"
    },
    {
        "source_sentence": "譬如少壯妙翅鳥王，有大勢力隨意飛上妙高山頂。",
        "translation": "It's like the small and powerful marvelous-winged king of birds, who has great momentum and flew up to the top of a wonderful high mountain as he wishes.",
        "source": "T15n0646_001:0709a06_7"
    },
    {
        "source_sentence": "如來神力行菩薩亦復如是，具大善根勇疾之力，隨意能趣佛會中生，能與惡趣有情而作救護。",
        "translation": "Similarly, the Tathāgata's spiritually practicing bodhisattva is endowed with the great root of goodness and the power of courage, can be born in the Buddha's assembly as he wishes, and can rescue sentient",
        "source": "T15n0646_001:0709a07_8"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0709a10_9"
    },
    {
        "source_sentence": "如是名為如來神力行菩薩。",
        "translation": "Thus, they're called the bodhisattvas who practice the Tathāgata's supernormal powers.",
        "source": "T15n0646_001:0709a10_10"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709a10_11"
    },
    {
        "source_sentence": "若善男子、善女人，於日日中以天妙衣天百味食，供養十方一切世界微塵數諸佛，",
        "translation": "“Furthermore, if sons and daughters of a virtuous family provide offerings to buddhas as numerous as atoms in all the ten directions with celestial garments adorned with heavenly cloth and food of a hundred flavors day and night",
        "source": "T15n0646_001:0709a11_12"
    },
    {
        "source_sentence": "復滿恒河沙數世界如意寶珠而用布施，乃至恒河沙劫如是供養；",
        "translation": "They also filled as many worlds as there are grains of sand in the Ganges River with wish-granting jewels, and offered them up like this for as many eons as there are grains of sand in the Ganges River.",
        "source": "T15n0646_001:0709a13_0"
    },
    {
        "source_sentence": "若復有人教一有情得預流果，其福勝彼無量無數。",
        "translation": "Again, if someone teaches one sentient being to attain the fruit of stream-winner, his merit will be greater than that in measureless and countless ways.",
        "source": "T15n0646_001:0709a14_1"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709a15_2"
    },
    {
        "source_sentence": "若善男子、善女人，教彼十方一切世界微塵數有情得預流果；",
        "translation": "Good men and good women teach sentient beings as numerous as atoms in all worlds in the ten directions to attain the state of stream-enterer.",
        "source": "T15n0646_001:0709a16_0"
    },
    {
        "source_sentence": "若復有人教一有情得一來果，其福勝彼無量無數。",
        "translation": "Again, if someone teaches one sentient being to attain the fruit of once-returning, their merit will be greater than that in measureless and countless ways.",
        "source": "T15n0646_001:0709a17_1"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709a18_2"
    },
    {
        "source_sentence": "若善男子、善女人，教彼十方一切世界微塵數有情得一來果；",
        "translation": "Good men and good women teach sentient beings, as many as atoms in all worlds in the ten directions, to attain the fruit of once-returning.",
        "source": "T15n0646_001:0709a18_3"
    },
    {
        "source_sentence": "若復有人教一有情得不還果，其福勝彼無量無數。",
        "translation": "Again, if someone teaches one sentient being to attain the fruit of nonreturning, his merit is greater than theirs in measureless and countless ways.",
        "source": "T15n0646_001:0709a20_4"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709a21_5"
    },
    {
        "source_sentence": "若善男子、善女人，教彼十方一切世界微塵數有情得不還果；",
        "translation": "Good men and good women teach sentient beings, as many as atoms in all worlds in the ten directions, to attain the fruit of nonreturning.",
        "source": "T15n0646_001:0709a21_6"
    },
    {
        "source_sentence": "若復有人教一有情得阿羅漢果，其福勝彼無量無數。",
        "translation": "Again, if someone teaches one sentient being to attain the fruit of arhatship, their merit will be greater than that in measureless and countless ways.",
        "source": "T15n0646_001:0709a23_7"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709a24_8"
    },
    {
        "source_sentence": "若善男子、善女人，教彼十方一切世界微塵數有情得阿羅漢果；",
        "translation": "Good men and good women teach sentient beings as numerous as atoms in all worlds in the ten directions to attain the fruit of arhatship.",
        "source": "T15n0646_001:0709a24_9"
    },
    {
        "source_sentence": "若復有人教一有情證獨覺果，其福勝彼無量無數。",
        "translation": "Again, if someone teaches one sentient being to realize the fruit of pratyekabuddhahood, their merit will be greater than that in measureless and countless ways.",
        "source": "T15n0646_001:0709a25_10"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709a27_11"
    },
    {
        "source_sentence": "若善男子、善女人，教彼十方一切世界微塵數有情得獨覺果；",
        "translation": "Good men and good women teach sentient beings as numerous as atoms in all worlds in the ten directions to attain the fruit of pratyekabuddhahood.",
        "source": "T15n0646_001:0709a27_12"
    },
    {
        "source_sentence": "若復有人教一羊車行菩薩令其安住菩提之心，其福勝彼無量無數。",
        "translation": "If another person teaches a sheep-drawn bodhisattva to make them abide in the mind of enlightenment, his merit will be greater than theirs without measure or number.",
        "source": "T15n0646_001:0709a28_13"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709b01_14"
    },
    {
        "source_sentence": "若善男子、善女人，教彼十方一切世界微塵數有情得羊車行菩提之心；",
        "translation": "Good men and good women teach sentient beings, as numerous as atoms in all worlds in the ten directions, to attain the mind of enlightenment which is like a cart drawn by sheep.",
        "source": "T15n0646_001:0709b01_15"
    },
    {
        "source_sentence": "若復有人教一有情得象車行菩提之心，其福勝彼無量無數。",
        "translation": "If another person teaches one sentient being to attain the mind of enlightenment that practices the elephant cart, his merit will be greater than theirs without measure or number.",
        "source": "T15n0646_001:0709b03_16"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709b04_17"
    },
    {
        "source_sentence": "若善男子、善女人，教彼十方一切世界微塵數有情得象車行菩提之心；",
        "translation": "Good men and good women teach sentient beings as numerous as atoms in all worlds in the ten directions to attain the mind of enlightenment which is like an elephant-drawn cart.",
        "source": "T15n0646_001:0709b04_18"
    },
    {
        "source_sentence": "若復有人教一有情得日月神力行菩提之心，其福勝彼無量無數。",
        "translation": "If another person teaches a sentient being to attain the mind of enlightenment with the miraculous power of sun and moon, his merit will be greater than theirs without measure or number.",
        "source": "T15n0646_001:0709b06_19"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709b08_20"
    },
    {
        "source_sentence": "若善男子、善女人，教彼十方一切世界微塵數有情得日月神力行菩提之心；",
        "translation": "Suppose good men and good women teach sentient beings in all those worlds, as many as atoms in all the ten directions, to attain the mind of enlightenment which is based on the practice of day and night mystic power.",
        "source": "T15n0646_001:0709b08_21"
    },
    {
        "source_sentence": "若復有人教一有情得聲聞神力行菩提之心，其福勝彼無量無數。",
        "translation": "Again, if someone teaches a sentient being to attain the mind of śrāvakas' supernormal powers and practice enlightenment, their merit will be greater than theirs without measure or number.",
        "source": "T15n0646_001:0709b10_22"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709b11_23"
    },
    {
        "source_sentence": "若善男子、善女人，教彼十方一切世界微塵數有情得聲聞神力行菩提之心；",
        "translation": "Good men and good women teach sentient beings, as numerous as atoms in all worlds in the ten directions, to attain the will for enlightenment which is carried out by the spiritual power of buddhas.",
        "source": "T15n0646_001:0709b11_24"
    },
    {
        "source_sentence": "若復有人教一有情得如來神力行菩提之心，其福勝彼無量無數。",
        "translation": "If another person teaches a sentient being to attain the mind of enlightenment with the Tathāgata's miraculous powers and practice, their merit will be greater than that without measure or number.",
        "source": "T15n0646_001:0709b13_25"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709b15_26"
    },
    {
        "source_sentence": "若善男子、善女人，於日日中以天妙衣天百味食，供養十方一切世界微塵數有情，",
        "translation": "“Furthermore, if sons and daughters of a virtuous family were to offer heavenly garments and celestial food with a hundred different flavors day after day to sentient beings as numerous as atoms in all worlds in the ten directions",
        "source": "T15n0646_001:0709b15_27"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0709b17_28"
    },
    {
        "source_sentence": "若復有人以一飲食施一近事——歸依三寶、受五學處、於佛教法生正信者——其福勝彼無量無數。",
        "translation": "Suppose there's another person who gives one food and drink to someone nearby - takes refuge in the Three Treasures, receives the five places of training, and has right faith in the Buddhist teachings - their merit is greater than theirs without measure or number.",
        "source": "T15n0646_001:0709b17_29"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709b20_0"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數近事，",
        "translation": "Suppose good men and good women offer heavenly foods of a hundred flavors to all the worlds in the ten directions with their beautiful celestial robes, as numerous as atoms in all worlds.",
        "source": "T15n0646_001:0709b20_1"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0709b21_2"
    },
    {
        "source_sentence": "若復有人以一飲食施第八人，其福勝彼無量無數。",
        "translation": "If another person were to give one food and drink to an eighth person, their merit would be greater than that in measureless and countless ways.",
        "source": "T15n0646_001:0709b22_3"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709b23_4"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數第八人，",
        "translation": "Suppose good men and good women offer heavenly foods of a hundred flavors to eighth persons, as numerous as atoms in all worlds in the ten directions,",
        "source": "T15n0646_001:0709b23_5"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0709b25_6"
    },
    {
        "source_sentence": "若復有人以一飲食施一預流果，其福勝彼無量無數。",
        "translation": "If another person gives a pre-flow fruit with one food and drink, their merit will be greater than that without measure or number.",
        "source": "T15n0646_001:0709b26_7"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709b27_8"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數預流果，",
        "translation": "Suppose good men and good women offer the fruit of stream-winnerhood, as numerous as atoms in all worlds in the ten directions, with a hundred flavors of heavenly foods like celestial garments or celestial foods.",
        "source": "T15n0646_001:0709b27_9"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0709b29_10"
    },
    {
        "source_sentence": "若復有人以一飲食施一一來果，其福勝彼無量無數。",
        "translation": "If someone were to give one food and drink to each of them, their merit would be greater than that of the others without measure or number.",
        "source": "T15n0646_001:0709c01_0"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709c02_1"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數一來果，",
        "translation": "Suppose good men and good women offer heavenly foods of a hundred flavors to all the worlds in the ten directions, as many as there are atoms in one fruit.",
        "source": "T15n0646_001:0709c02_2"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0709c04_3"
    },
    {
        "source_sentence": "若復有人以一飲食施一不還果，其福勝彼無量無數。",
        "translation": "Again, if someone gives one food and drink to one person who doesn't return with the fruit of nonreturning, their merit will be greater than that without measure or number.",
        "source": "T15n0646_001:0709c04_4"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709c06_0"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數不還果，",
        "translation": "Suppose good men and good women offer heavenly foods of a hundred flavors to all the worlds in the ten directions with their beautiful celestial robes, as many as there are grains of dust in all worlds.",
        "source": "T15n0646_001:0709c06_1"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0709c07_2"
    },
    {
        "source_sentence": "若復有人以一飲食施一阿羅漢果，其福勝彼無量無數。",
        "translation": "If another person were to give a single food and drink to an arhat's fruit, their merit would be greater than that without measure or number.",
        "source": "T15n0646_001:0709c08_3"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709c09_4"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數阿羅漢果，",
        "translation": "Suppose good men and good women offer heavenly foods of a hundred flavors to all the worlds in the ten directions, as many fruits of arhatship as there are atoms in all their worlds,",
        "source": "T15n0646_001:0709c10_5"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0709c11_6"
    },
    {
        "source_sentence": "若復有人以一飲食施一獨覺，其福勝彼無量無數。",
        "translation": "If another person were to give one food and drink to a solitary realizer, their merit would be greater than that of those without measure or number.",
        "source": "T15n0646_001:0709c12_7"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709c13_8"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數獨覺，",
        "translation": "Suppose good men and good women offer heavenly foods of a hundred flavors to all the tiny number of self-enlightened ones in all worlds in the ten directions with celestial fine clothing.",
        "source": "T15n0646_001:0709c13_9"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0709c15_10"
    },
    {
        "source_sentence": "若復有人以一飲食施一羊車行菩薩，其福勝彼無量無數。",
        "translation": "If another person were to give one food and drink to a sheep-drawn bodhisattva, his merit would be greater than theirs without measure or number.",
        "source": "T15n0646_001:0709c16_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0646_001:0709c17_12"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0709c17_13"
    },
    {
        "source_sentence": "是菩薩摩訶薩，隨於何時、隨以何事發菩提心，即於爾時無一不善而不捨棄，",
        "translation": "“Whenever these great enlightening beings develop the determination for enlightenment, at whatever time and for whatever purpose they do so, there is not a single thing unwholesome that they do not abandon.",
        "source": "T15n0646_001:0709c17_14"
    },
    {
        "source_sentence": "無一佛法而不生長。",
        "translation": "There's not a single buddha-dharma that doesn't grow.",
        "source": "T15n0646_001:0709c19_15"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0709c20_16"
    },
    {
        "source_sentence": "由是菩薩具足如是不可思議勝功德故，妙吉祥！",
        "translation": "Because this bodhisattva is endowed with such inconceivable and excellent qualities, Marvelous Auspicious One!",
        "source": "T15n0646_001:0709c20_17"
    },
    {
        "source_sentence": "譬如迦陵頻伽鳥王在卵[穀-禾+卵]中，雖自未開，已能勝彼一切群鳥，",
        "translation": "Good man, it is analogous to the case of the kalaviṅka bird king in an egg [grass-grass+egg]. Although it has not yet hatched its own shell, it can already overpower all the other birds",
        "source": "T15n0646_001:0709c21_18"
    },
    {
        "source_sentence": "由有深妙美音聲故。",
        "translation": "It's because there's a profound and beautiful sound.",
        "source": "T15n0646_001:0709c22_19"
    },
    {
        "source_sentence": "如是如是！",
        "translation": "Just so, just so!",
        "source": "T15n0646_001:0709c23_20"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0709c23_21"
    },
    {
        "source_sentence": "菩薩初發菩提之心處無明[穀-禾+卵]，雖業煩惱闇翳覆障，然能勝彼聲聞獨覺，",
        "translation": "“When enlightening beings first undertake determination for enlightenment, they are in the state of ignorance [grassps - grains + eggs]. Although their actions and afflictions are obscured by darkness and obstacles,",
        "source": "T15n0646_001:0709c23_22"
    },
    {
        "source_sentence": "由有迴向善根行願妙音聲故。",
        "translation": "It's because there's the marvelous sound of the vow to dedicate oneself back to good roots.",
        "source": "T15n0646_001:0709c25_23"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0709c26_24"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數羊車行菩薩，",
        "translation": "“Good sons and good daughters, give heavenly food of a hundred flavors to the bodhisattvas who practice in carts drawn by sheep as numerous as atoms in all worlds in the ten directions.",
        "source": "T15n0646_001:0709c26_25"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0709c28_26"
    },
    {
        "source_sentence": "若復有人以一飲食施一象車行菩薩，其福勝彼無量無數。",
        "translation": "If another person were to give one food and drink to an elephant chariot-following bodhisattva, his merit would be greater than theirs without measure or number.",
        "source": "T15n0646_001:0709c28_27"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710a01_28"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數象車行菩薩，",
        "translation": "“Good sons and good daughters, give heavenly food of a hundred flavors to enlightening beings traveling in elephant carts as numerous as atoms in all worlds in the ten directions.",
        "source": "T15n0646_001:0710a01_29"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0710a03_30"
    },
    {
        "source_sentence": "若復有人以一飲食施一日月神力行菩薩，其福勝彼無量無數。",
        "translation": "If another person gives a meal of food and drink to a bodhisattva who practices the miraculous acts of one day and month, his merit will be greater than theirs in measureless and countless ways.",
        "source": "T15n0646_001:0710a03_31"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710a05_32"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數日月神力行菩薩，",
        "translation": "Suppose good men and good women offer heavenly foods of a hundred flavors to the bodhisattvas practicing miraculous powers for as many days and months as there are atoms in all the worlds in the ten directions with celestial exquisite",
        "source": "T15n0646_001:0710a05_33"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0710a07_34"
    },
    {
        "source_sentence": "若復有人以一飲食施一聲聞神力行菩薩，其福勝彼無量無數。",
        "translation": "If another person gives a meal of food and drink to a śrāvaka or bodhisattva who practices with supernormal powers, his merit will be greater than theirs without measure or number.",
        "source": "T15n0646_001:0710a08_35"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710a09_36"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數聲聞神力行菩薩，",
        "translation": "“Good sons and good daughters, give heavenly food of a hundred flavors to enlightening beings practicing the spiritual powers of buddhahood, dressed in celestial robes adorned with divine embellishments, as numerous as atom",
        "source": "T15n0646_001:0710a09_37"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0710a11_38"
    },
    {
        "source_sentence": "若復有人以一飲食施一如來神力行菩薩，其福勝彼無量無數。",
        "translation": "If another person gives one food and drink to a bodhisattva who practices with the Tathāgata's supernormal powers, his merit will be greater than theirs without measure or number.",
        "source": "T15n0646_001:0710a12_39"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710a13_40"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數如來神力行菩薩，",
        "translation": "“Good sons and good women, give heavenly food of a hundred flavors to enlightening beings practicing the mystic practices of buddhas, adorned with celestial robes.",
        "source": "T15n0646_001:0710a14_41"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0710a16_0"
    },
    {
        "source_sentence": "若復有人聞此法門深心信受，其福勝彼無量無數。",
        "translation": "If another person hears this teaching and deeply believes it, their merit will be greater than that without measure or number.",
        "source": "T15n0646_001:0710a16_1"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710a17_2"
    },
    {
        "source_sentence": "若善男子、善女人，造立十方一切世界微塵數寺，供養三千大千世界微塵數獨覺，",
        "translation": "Suppose good men and good women build temples as numerous as atoms in all worlds in the ten directions to offer support to buddhas as numerous as atoms in a thousand worlds.",
        "source": "T15n0646_001:0710a18_0"
    },
    {
        "source_sentence": "其僧房舍皆以閻浮檀金之所成就，以電燈末尼寶而為莊校，一切光寶以為階陛，",
        "translation": "The monks’ quarters were all made of gold from Jambudvīpa, adorned with precious jewels such as lightning and lanterns. Each room was decorated with staircases embellished with all kinds of precious luminous treasures",
        "source": "T15n0646_001:0710a19_1"
    },
    {
        "source_sentence": "末尼真珠眾寶瓔珞以為嚴飾，幢蓋繒幡處處懸列，如意珠王寶網鈴鐸以為其帳，",
        "translation": "They were adorned with jewelry made of maṇi jewels and various precious treasures, draped with banners, canopies, pennants, and streamers. The curtains were draped with nets of wish-granting pearls,",
        "source": "T15n0646_001:0710a21_2"
    },
    {
        "source_sentence": "龍護栴檀以為香泥用塗其地，曼陀羅華、摩訶曼陀羅華、曼殊沙華、摩訶曼殊沙華、蘇末那華、嗢鉢羅華、拘物頭華、分陀利華、婆利沙華、呾羅尼華、瞿呾羅尼華、跋羅華、蘇健地華，",
        "translation": "The dragon guarded the earth with sandalwood as fragrant mud and rubbed it on it. There were maṇḍala flowers, mahāmandārava flowers, mañjūṣa flowers, mahāmanjūṣa flowers, sumana flowers, amb",
        "source": "T15n0646_001:0710a23_3"
    },
    {
        "source_sentence": "如是等諸上妙華而為散布，以天妙衣天百味食而供養之，乃至恒河沙劫如是供養；",
        "translation": "They scatter these kinds of exquisite flowers and offer them heavenly garments, celestial food with a hundred flavors, and so on, for as many eons as there are grains of sand in the Ganges River.",
        "source": "T15n0646_001:0710a27_4"
    },
    {
        "source_sentence": "若復有人得聞佛名，若一切智名，若世間主名，若觀形像乃至經卷所有畫像，",
        "translation": "“Furthermore, if another person hears the name of the Buddha, or the name of omniscience, or the name of the lord of the world, or contemplates images and even all the portraits in scrolls up to scriptures,",
        "source": "T15n0646_001:0710a29_5"
    },
    {
        "source_sentence": "其福勝彼無量無數，何況有人合十指爪而為恭敬，其福勝彼無量無數，",
        "translation": "Its merit is infinite and immeasurable, so why would anyone venerate it with the palms of their hands joined together like a man’s?",
        "source": "T15n0646_001:0710b02_6"
    },
    {
        "source_sentence": "況復以諸燈明香華，乃至讚佛一相功德，其福轉勝，於當來世受大富樂，",
        "translation": "“Furthermore, those who praise the Buddha’s virtue by means of lamps, lights, fragrant flowers, perfumes, or even one characteristic of buddhahood become more fortunate and receive great prosperity and happiness in the future.",
        "source": "T15n0646_001:0710b04_7"
    },
    {
        "source_sentence": "乃至到於一切智智。",
        "translation": "Up to the point where he attains omniscience and cognition.",
        "source": "T15n0646_001:0710b05_8"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710b06_9"
    },
    {
        "source_sentence": "如一滴水投大海中，乃至劫火起時終不中盡。",
        "translation": "It's like a drop of water thrown into the ocean, which doesn't run out when an eon fire arises.",
        "source": "T15n0646_001:0710b06_10"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0710b07_11"
    },
    {
        "source_sentence": "菩薩亦爾，以少善根迴向成佛，乃至一切智火生時終不中盡。",
        "translation": "So it is with the bodhisattva who dedicates a small amount of good roots to become a buddha, and when the fire of omniscience arises, it never ends.",
        "source": "T15n0646_001:0710b07_12"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0710b09_13"
    },
    {
        "source_sentence": "譬如月輪能勝眾星，光明圓滿廣大高勝。",
        "translation": "It's like the moon wheel that can outshine the stars, whose light is so vast and lofty.",
        "source": "T15n0646_001:0710b09_14"
    },
    {
        "source_sentence": "菩薩亦爾，以少善根迴向成佛，而能勝彼聲聞獨覺，由其善根廣大高勝。",
        "translation": "Similarly, bodhisattvas who dedicate a small amount of good roots to become buddhas can be superior to śrāvakas and pratyekbuddhas because their good roots are so vast and lofty.",
        "source": "T15n0646_001:0710b10_15"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0710b11_16"
    },
    {
        "source_sentence": "如來、應、正等覺有如是等不可思議功德。",
        "translation": "The Tathāgata, Arhat, and Completely Awakened One have such inconceivable merits.",
        "source": "T15n0646_001:0710b12_17"
    },
    {
        "source_sentence": "妙吉祥！",
        "translation": "Mañjuśrī!",
        "source": "T15n0646_001:0710b13_18"
    },
    {
        "source_sentence": "若善男子、善女人，以天妙衣天百味食，供養十方一切世界微塵數聲聞獨覺及諸菩薩，",
        "translation": "“Good sons and good daughters, give heavenly food of a hundred flavors to all the enlightening beings and bodhisattvas by means of celestial garments.",
        "source": "T15n0646_001:0710b13_19"
    },
    {
        "source_sentence": "乃至恒河沙劫如是供養；",
        "translation": "For eons as numerous as the grains of sand in the Ganges River they were offered in this way.",
        "source": "T15n0646_001:0710b15_20"
    },
    {
        "source_sentence": "若復有人能於此經心生信受，其福勝彼無量無數，何況有人書寫為人演說，",
        "translation": "If someone were to have faith in this scripture, their merits would be greater than those of others without measure or number. How much the more so if someone were to write it down and expound it for others!",
        "source": "T15n0646_001:0710b15_21"
    },
    {
        "source_sentence": "其福最勝。",
        "translation": "Their merit is the most superior.",
        "source": "T15n0646_001:0710b17_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0646_001:0710b17_23"
    },
    {
        "source_sentence": "是成佛因故。",
        "translation": "It's because it's the cause of becoming a buddha.",
        "source": "T15n0646_001:0710b18_24"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710b18_25"
    },
    {
        "source_sentence": "若有男子女人，以瞋惡心侵奪無量聲聞獨覺飲食衣服；",
        "translation": "Suppose there is a man or woman who, out of hatred and malice, steals the food, drink, and clothing of innumerable śrāvakas and pratyekabuddhas.",
        "source": "T15n0646_001:0710b18_26"
    },
    {
        "source_sentence": "若復有人以瞋惡心侵奪信樂大乘菩薩乃至少許飲食衣服，或一日中令其不食，",
        "translation": "Suppose another person with an angry mind attacks a bodhisattva who believes in the great vehicle of enlightenment and even steals food, drink, or clothing for a little while, or causes him not to eat for a day.",
        "source": "T15n0646_001:0710b19_27"
    },
    {
        "source_sentence": "其罪重彼無量無數。",
        "translation": "The seriousness of their sins are countless and immeasurable.",
        "source": "T15n0646_001:0710b21_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0646_001:0710b22_29"
    },
    {
        "source_sentence": "一切三世聲聞獨覺，於無數劫修行施戒忍辱精進禪定智慧，皆為自身斷除煩惱；",
        "translation": "All the śrāvakas and pratyekabuddhas of all times practiced for countless eons giving, morality, patience, effort, meditation, concentration, and wisdom. They all ended their afflictions for themselves.",
        "source": "T15n0646_001:0710b22_30"
    },
    {
        "source_sentence": "菩薩不爾，乃至毫釐施傍生時，皆為三寶不斷絕故。",
        "translation": "That's not the case for bodhisattvas, even when they give a tiny bit to an unenlightened person, it's because the Three Treasures don't stop.",
        "source": "T15n0646_001:0710b24_31"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710b25_32"
    },
    {
        "source_sentence": "假使有人以瞋惡心毀壞無量無邊無數獨覺戒、定、智慧、解脫解脫知見；",
        "translation": "Suppose there is a person who, out of hatred and malice, destroys immeasurable, limitless, and countless individually awakened precepts, concentration, wisdom, liberation, and knowledge and vision of liberation.",
        "source": "T15n0646_001:0710b25_33"
    },
    {
        "source_sentence": "假使有人以瞋惡心於一信樂大乘菩薩損壞戒支及所學事令不成就，其罪重彼無量無數。",
        "translation": "Suppose someone with an angry mind believes in a great vehicle bodhisattva who damages the precepts and the things he's training with one faith that causes them not to be accomplished, and their sin is immeasurable and countless.",
        "source": "T15n0646_001:0710b27_34"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0646_001:0710b29_35"
    },
    {
        "source_sentence": "一切三世聲聞獨覺，於無數劫，所有戒、定、智慧、解脫、解脫知見，",
        "translation": "All the śrāvakas and pratyekbuddhas of the three times had, over countless eons, observed precepts, concentration, wisdom, liberation, and the knowledge and vision of liberation.",
        "source": "T15n0646_001:0710b29_36"
    },
    {
        "source_sentence": "皆為自身斷除煩惱；",
        "translation": "They all do so for themselves to get rid of their afflictions.",
        "source": "T15n0646_001:0710c01_37"
    },
    {
        "source_sentence": "菩薩不爾，乃至一日修戒、定、慧、解脫、解脫知見，皆為有情斷除煩惱。",
        "translation": "If a bodhisattva doesn't, even if he cultivates precepts, concentration, wisdom, liberation, and the knowledge and vision of liberation for one day, they all end afflictions for sentient beings.",
        "source": "T15n0646_001:0710c02_38"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710c04_0"
    },
    {
        "source_sentence": "假使有人以瞋惡心繫縛十方一切有情置牢獄中；",
        "translation": "Suppose someone were to bind all sentient beings in the ten directions with angry thoughts and imprison them in prison.",
        "source": "T15n0646_001:0710c04_1"
    },
    {
        "source_sentence": "若復有人以瞋惡心於菩薩所不欲眼視背之而去，其罪重彼無量無數。",
        "translation": "If another person with an angry mind doesn't want to look at the bodhisattva with eyes and looks away from him, their sin will be immeasurable and countless.",
        "source": "T15n0646_001:0710c05_2"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710c07_0"
    },
    {
        "source_sentence": "假使有人以瞋惡心挑出十方一切世界有情眼目；",
        "translation": "Suppose there is a person who, out of hatred and malice, picks out the eyes and eyes of sentient beings in all worlds in the ten directions.",
        "source": "T15n0646_001:0710c07_1"
    },
    {
        "source_sentence": "若復有人以瞋惡心於菩薩所不欲眼視背之而去，其罪重彼無量無數。",
        "translation": "If another person with an angry mind doesn't want to look at the bodhisattva with eyes and looks away from him, their sin will be immeasurable and countless.",
        "source": "T15n0646_001:0710c08_2"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710c10_0"
    },
    {
        "source_sentence": "假使十方一切有情皆被挑目；",
        "translation": "Suppose all sentient beings in the ten directions were to be pointed out.",
        "source": "T15n0646_001:0710c10_1"
    },
    {
        "source_sentence": "復有餘人於彼有情起大慈心令眼平復所得功德，若復有人以清淨心而往瞻視大乘菩薩，",
        "translation": "“Furthermore, if there are other people who have great compassion toward those sentient beings and cause their eyes to be evenly balanced, they’ll attain merit. If another person with a pure heart goes to see the Great Vehicle bodhisattva",
        "source": "T15n0646_001:0710c10_2"
    },
    {
        "source_sentence": "其福勝彼無量無數。",
        "translation": "Their merits are superior to theirs in measurelessness and countlessness.",
        "source": "T15n0646_001:0710c13_0"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710c13_1"
    },
    {
        "source_sentence": "假使有人能令十方所有獄囚皆得解脫，受轉輪聖王天帝釋樂；",
        "translation": "Suppose there is someone who can cause all the prisoners in the ten directions to attain liberation and experience the bliss of Indra, the wheel-turning sage king or heavenly ruler.",
        "source": "T15n0646_001:0710c13_2"
    },
    {
        "source_sentence": "若復有人以清淨心瞻視讚歎大乘菩薩，其福勝彼無量無數。",
        "translation": "If another person were to look at the great vehicle bodhisattva with a pure heart and praise him, his merit would be greater than theirs without measure or number.",
        "source": "T15n0646_001:0710c15_3"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710c16_4"
    },
    {
        "source_sentence": "假使有人能令十方一切有情證獨覺果所得功德；",
        "translation": "Suppose there is someone who can cause all sentient beings in the ten directions to realize the virtue attained by the fruit of pratyekabuddhahood.",
        "source": "T15n0646_001:0710c16_5"
    },
    {
        "source_sentence": "若復有人教一信樂大乘菩薩，曾於佛所種一善根令得增長，其福勝彼無量無數。",
        "translation": "Again, if someone teaches a bodhisattva who believes in the great vehicle and once planted a good root of goodness at the Buddha's place so that it grows, his merit will be greater than theirs without measure or number.",
        "source": "T15n0646_001:0710c17_6"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710c19_7"
    },
    {
        "source_sentence": "若有深信大乘菩薩於十方世界一切有情皆令安住菩提之心所得功德；",
        "translation": "If there are those who deeply believe in the great vehicle of enlightening beings, they will cause all sentient beings in the worlds of the ten directions to abide in the virtues attained by the determination for enlightenment.",
        "source": "T15n0646_001:0710c20_0"
    },
    {
        "source_sentence": "若復有人以大乘法乃至一頌教示於他，其福勝彼無量無數。",
        "translation": "If another person teaches the great vehicle teaching or even a verse of it to others, their merit will be greater than that in measureless and countless ways.",
        "source": "T15n0646_001:0710c21_1"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710c23_2"
    },
    {
        "source_sentence": "假使有人以十方世界微塵數獨覺，置於地獄、餓鬼、傍生；",
        "translation": "Suppose someone were to take as many pratyekabuddhas as atoms in ten directions and place them in hell, among hungry ghosts, or among animals.",
        "source": "T15n0646_001:0710c23_3"
    },
    {
        "source_sentence": "若復有人於一初發菩提心者而作障礙，其罪重彼無量無數。",
        "translation": "If another person creates an obstruction to someone who first gives rise to the mind of enlightenment, their sin will be immeasurable and countless.",
        "source": "T15n0646_001:0710c24_4"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710c25_5"
    },
    {
        "source_sentence": "假使有人於十方世界一切有情發菩提心者而作障礙；",
        "translation": "Suppose someone were to act as an obstruction to all sentient beings in the worlds of the ten directions who give rise to aspirations for enlightenment.",
        "source": "T15n0646_001:0710c26_6"
    },
    {
        "source_sentence": "若復有人於一深信大乘菩薩菩提之心而作障礙，其罪重彼無量無數。",
        "translation": "If someone again obstructs the enlightenment of a great vehicle bodhisattva who deeply believes in one, their sin will be immeasurable and countless.",
        "source": "T15n0646_001:0710c27_7"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0710c29_8"
    },
    {
        "source_sentence": "假使十方一切有情，皆墮地獄、餓鬼、傍生、琰摩王界，設復有人救濟令出，",
        "translation": "Suppose all sentient beings in the ten directions were to fall into hell, hungry ghosts, animals, and the realm of King Yama, and suppose someone were to rescue them and cause them to escape.",
        "source": "T15n0646_001:0710c29_9"
    },
    {
        "source_sentence": "復教安住菩提之心所得功德；",
        "translation": "They also teach the virtues attained by peacefully abiding in the determination for enlightenment.",
        "source": "T15n0646_001:0711a02_0"
    },
    {
        "source_sentence": "若復有人令一有情於大乘中深生信解，其福勝彼無量無數。",
        "translation": "Again, if someone were to cause a single sentient being to deeply believe and understand the great vehicle, their merit would be greater than that in measureless and countless ways.",
        "source": "T15n0646_001:0711a02_1"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0711a04_2"
    },
    {
        "source_sentence": "假使有人於十方世界滿中獨覺而生輕慢，若復有人於一初始發心菩薩生輕慢心，",
        "translation": "“Furthermore, suppose there is anyone among the people in the worlds of the ten directions who conceiled themselves as self-enlightened and filled them with self-conceit.",
        "source": "T15n0646_001:0711a04_3"
    },
    {
        "source_sentence": "其罪重彼無量無數。",
        "translation": "The seriousness of their sins are countless and immeasurable.",
        "source": "T15n0646_001:0711a06_4"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0711a06_5"
    },
    {
        "source_sentence": "假使有人於十方世界微塵數獨覺斷絕利養，於十方界彰其惡名；",
        "translation": "Suppose there is a person in the worlds of the ten directions who has cut off benefits for as many pratyekabuddhas as atoms in all buddha-fields, and then reveals their bad repute in the worlds of the ten directions",
        "source": "T15n0646_001:0711a06_6"
    },
    {
        "source_sentence": "若復有人於一深信大乘菩薩斷絕利養彰其惡名，其罪重彼無量無數。",
        "translation": "If another person deeply believes in one great vehicle bodhisattva who stops cutting off benefits and highlights bad reputation, their sin will be immeasurable and countless.",
        "source": "T15n0646_001:0711a08_7"
    },
    {
        "source_sentence": "「妙吉祥！",
        "translation": "Miaojixiang!",
        "source": "T15n0646_001:0711a10_8"
    },
    {
        "source_sentence": "若善男子、善女人，於一深信大乘菩薩，為求正法故乃至施一水瓶，由此福業當得無量轉輪聖王勝妙果報，",
        "translation": "“Good sons and good daughters, if a bodhisattva who deeply believes in one of the Mahayana teachings gives a water pot for the sake of pursuing the true-dharma, this meritorious action will bring immeasurable rewards",
        "source": "T15n0646_001:0711a10_9"
    },
    {
        "source_sentence": "何況施與受持讀誦深生信解菩薩摩訶薩。」",
        "translation": "How could it be given to a bodhisattva-mahāsattva who receives, retains, recites, and deeply produces faith and understanding?",
        "source": "T15n0646_001:0711a12_10"
    },
    {
        "source_sentence": "爾時世尊說此經已，妙吉祥童子及諸菩薩摩訶薩、諸聲聞眾，天、龍、藥叉、健闥婆、阿蘇羅、揭路荼、人非人等，",
        "translation": "After the Bhagavān had taught this sūtra, the wonderfully auspicious boy and the bodhisattvas, mahāsattvas, śrāvakas, gods, dragons, yakṣas, gandharvas, asuras, garuḍas",
        "source": "T15n0646_001:0711a13_11"
    },
    {
        "source_sentence": "皆大歡喜，信受奉行。",
        "translation": "They all rejoiced greatly and believed it, accepted it, and upheld it.",
        "source": "T15n0646_001:0711a16_12"
    },
    {
        "source_sentence": "入定不定印經",
        "translation": "Sutra of the Indeterminate Seal of Entry into Meditation",
        "source": "T15n0646_001:0711a17_0"
    },
    {
        "source_sentence": "癸卯歲高麗國大藏都監奉勅彫造",
        "translation": "At the end of the sixteenth year, a statue was enshrined by imperial edict at the head of the Tripiṭaka Master Daizang in the capital of the country of Goryeo.",
        "source": "T15n0646_001:0711a18_0"
    }
]