[
    {
        "source_sentence": "諸法無行經卷上",
        "translation": "Wuxing jing of all dharmas, vol. 1",
        "source": "T15n0650_001:0750a03_0"
    },
    {
        "source_sentence": "姚秦龜茲三藏鳩摩羅什譯",
        "translation": "Yaoqin Kumārajīva's Translation of the Tripiṭaka of Kuci, translated by Kumārajīva",
        "source": "T15n0650_001:0750a05_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在王舍城耆闍崛山中，共大比丘僧五百人俱，菩薩九萬二千人，",
        "translation": "Thus I have heard: One time the Buddha was staying at Rājagaha, in the mountainous region of Gṛdhrakūṭa, accompanied by five hundred great bhikṣus and monks, together with ninety-two thousand bodhisattvas.",
        "source": "T15n0650_001:0750a06_0"
    },
    {
        "source_sentence": "其名曰：眾德莊嚴菩薩摩訶薩、師子遊步菩薩、光無障淨王菩薩、高山頂自在王菩薩、愛喜淨光菩薩、光蔽日月菩薩、妙淨鬚菩薩、身出蓮華光菩薩、梵自在王音菩薩、遊戲世師子王音菩薩、金色淨光威德菩薩、柔軟身菩薩、金色相莊嚴身菩薩、十光破魔力菩薩、諸根威儀善寂菩薩、德如高山菩薩、天音聲菩薩、法力自在遊行菩薩、山德淨身菩薩、妙德菩薩摩訶薩，",
        "translation": "Their names were Bodhisattva Mahāsattva Adorned with Myriad Virtues, Bodhisattva Siṃhavardhana, Bodhisattva Pure King of Light without Obstructions, Bodhisattva Supreme King of the Peak of the Mountains, Bodhisattva Delighted in Pure Light, Bodhisattva Illumining the Sun and Moon, Bodhisattva Beautifully",
        "source": "T15n0650_001:0750a07_1"
    },
    {
        "source_sentence": "如是等九萬二千人。",
        "translation": "There were 92,000 such people.",
        "source": "T15n0650_001:0750a16_2"
    },
    {
        "source_sentence": "爾時師子遊步菩薩見是大會，即從座起，偏袒右肩右膝著地，合掌向佛，",
        "translation": "Seeing this great assembly, the lion-vacation bodhisattva rose from his seat, bared his right shoulder, knelt with his right knee on the ground, joined his palms together, and faced the Buddha.",
        "source": "T15n0650_001:0750a16_3"
    },
    {
        "source_sentence": "「世尊大導師，　　名德稱無量，",
        "translation": "“The Bhagavat, the great guide, Is immeasurable in name and virtue.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　今此大眾集，　　願說寂滅法。",
        "translation": "Now the great assembly has assembled here To preach the Dharma of extinction.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　邪見諸愛慢，　　嫉妬瞋恚性，",
        "translation": "They have wrong views, craving and conceit, jealousy and anger.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　云何即是道？　　大音方便說。",
        "translation": "What is the path?",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　云何涅槃相，　　與世法無異？",
        "translation": "What's the characteristic of nirvāṇa that's no different from worldly dharmas?",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　諸法無有二，　　大悲為演說。",
        "translation": "All things are nondual: Great compassion explains them for you.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　云何諸法性，　　畢竟無有礙？",
        "translation": "How are the natures of all dharmas Ultimately unobstructed?",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　其性如涅槃，　　亦同於解脫，",
        "translation": "Their nature is like nirvana, And the same as liberation.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無縛亦無解，　　亦復如虛空，",
        "translation": "Neither bound nor liberated, Like space.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　迦羅頻伽音，　　大梵清淨聲。",
        "translation": "The sound of kalaviṅka is the pure voice of Brahmā.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　身色喻天金，　　淨命無量德，",
        "translation": "Body form is a metaphor for heavenly gold, Pure and immeasurable virtue of life.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　演說實相法，　　畢竟無縛解。",
        "translation": "Explaining the true characteristics of things, they ultimately have no binding or understanding.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　云何此五蓋，　　而等於菩提？",
        "translation": "How are these five hindrances the same as enlightenment?",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　云何是菩提，　　即同諸業性？",
        "translation": "What's enlightenment, which is the same as the nature of actions?",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　是法是非法，　　云何同一相？",
        "translation": "If this dharma is unlawful, how can it have the same characteristics?",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　如是畢竟淨，　　唯願為演說。",
        "translation": "Such is the ultimate purity, Please explain it for me.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無數無非數，　　諸法畢竟滅，",
        "translation": "Countless, uncountable, and countless, all things are ultimately extinguished.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　一切種智相，　　及以菩提道，",
        "translation": "All kinds of characteristics of knowledge and the path to enlightenment,",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　二法云何無？　　惟願為演說。",
        "translation": "How are the two dharmas nonexistent?",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無作無非作，　　無著無非著，",
        "translation": "What’s not done, what’s not done, what’s not attached, and what’s not attached.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　畢竟無眾生，　　諸法中無礙，",
        "translation": "Ultimately there are no sentient beings, Unhindered in all dharmas.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無戒無忍辱，　　亦無有毀戒，",
        "translation": "They have no precepts, no tolerance, and no violation of precepts.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無智亦無慧，　　亦無非智慧，",
        "translation": "There is neither knowledge nor wisdom, Neither non-knowledge nor non-knowledge.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　是法常清淨，　　惟願為演說。",
        "translation": "This teaching is always pure, so please explain it for me.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　云何一切法，　　寂滅如虛空？",
        "translation": "How are all things As tranquil as space?",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無心心數法，　　無見斷證修？",
        "translation": "The absence of mind and mental factors, the absence of views that are eliminated and realized?",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　一切諸眾生，　　同如虛空相，",
        "translation": "All sentient beings are the same as space.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　一相法亦無，　　心行亦叵得？",
        "translation": "Nor is there a single characteristic of dharmas, nor can mental action be obtained?",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　諸法無生滅，　　無學無羅漢，",
        "translation": "All things have no arising or ceasing, and there are no arhats in post learners.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　亦無辟支佛，　　亦無求菩薩，",
        "translation": "Nor are there any pratyekabuddhas, Nor do they seek enlightenment.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無住無休止，　　無來亦無去，",
        "translation": "There is no abiding, no resting, and no coming or going.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　諸法無動相，　　常住如須彌，",
        "translation": "All things have no moving characteristics, Always abiding like the polar mountain.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無相亦無色，　　色性即是道，",
        "translation": "The signlessness and formlessness are the nature of form, which is the path.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　色性佛道一，　　如是法願說。",
        "translation": "The buddha path with the nature of form is one: Such is the teaching of the Dharma vow.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　云何無佛法，　　亦無有眾僧？",
        "translation": "How is it that there's no buddha-dharma, and there are no congregations?",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　是三寶一相，　　惟願為演說。",
        "translation": "These are the single characteristics of the three treasures, Please explain them for me.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無空無無相，　　亦無有無作，",
        "translation": "There’s no emptiness, no signlessness, and nothing unmanifest.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　不合亦不散，　　名相法亦無，",
        "translation": "Neither united nor dispersed, Names and forms are also nonexistent.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　諸法畢竟空，　　如響無作者，",
        "translation": "The ultimate emptiness of all dharmas is like an echo with no author.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無生無無生，　　無滅無往來，",
        "translation": "Neither arising nor non-arising, neither cessation nor going and coming.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無天無龍神，　　夜叉緊那等，",
        "translation": "No gods, no dragons, yakṣas, kiṃnaras, and so forth.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無人無地獄，　　無餓鬼畜生，",
        "translation": "There’s no one, no hell, and no hungry ghosts or animals.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　無眾生五道，　　願說如是法。",
        "translation": "If there are no sentient beings in the five destinies, may they teach such a teaching.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　如導世師人，　　外道非見者，",
        "translation": "Like a teacher who guides the world, A heretic does not see.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　其有所演說，　　云何等無二？",
        "translation": "What's explained, how are they not two?",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　諸文字語言，　　是法皆一相，",
        "translation": "All words and syllables Are all one characteristic of the Dharma.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "　世尊大慈愍，　　願開是法門。」",
        "translation": "Bhagavān, you're greatly compassionate, may this teaching be opened.",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "以偈問曰：爾時世尊讚師子遊步菩薩摩訶薩言：「善哉，善哉！",
        "translation": "He asked in verse, At the time, the Bhagavān praised the lion's wandering bodhisattva Mahāsattva, saying, Good, good!",
        "source": "T15n0650_001:0750a18_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T15n0650_001:0750c09_5"
    },
    {
        "source_sentence": "汝所問者甚為希有，一切世間之所難信。",
        "translation": "What you ask is so rare that it's difficult for anyone in the world to believe.",
        "source": "T15n0650_001:0750c09_6"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T15n0650_001:0750c10_7"
    },
    {
        "source_sentence": "止止勿問。",
        "translation": "Don't ask questions.",
        "source": "T15n0650_001:0750c10_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0650_001:0750c10_9"
    },
    {
        "source_sentence": "新發意菩薩，於此空見、無相見、無作見、無生見、無所有見、無取相見、佛見、菩提見，",
        "translation": "The newly awakened bodhisattva observes emptiness, signlessness, noncontrivance, nonorigination, nonexistence, nongrasping, nonattachment, buddhahood, and enlightenment.",
        "source": "T15n0650_001:0750c11_0"
    },
    {
        "source_sentence": "所不能及。",
        "translation": "They can't reach them.",
        "source": "T15n0650_001:0750c12_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T15n0650_001:0750c13_2"
    },
    {
        "source_sentence": "如此法者不應在新學菩薩前說。",
        "translation": "Such a practitioner shouldn't explain it in front of newly trained bodhisattvas.",
        "source": "T15n0650_001:0750c13_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0650_001:0750c14_0"
    },
    {
        "source_sentence": "若聞是法，或斷善業，於佛道中則行邪道；",
        "translation": "If one hears this doctrine and either abandons good deeds or follows a wrong path in the path of enlightenment.",
        "source": "T15n0650_001:0750c14_1"
    },
    {
        "source_sentence": "若墮斷滅、若墮計常，不知如來以何方便隨宜所說？」",
        "translation": "If someone falls into cessation and if they fall into conceptual permanence, they don't know what method the Tathāgata uses to teach appropriately?",
        "source": "T15n0650_001:0750c15_2"
    },
    {
        "source_sentence": "爾時師子遊步菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that the lion's wandering bodhisattva Mahāsattva said to the Buddha, Bhagavān!",
        "source": "T15n0650_001:0750c16_3"
    },
    {
        "source_sentence": "哀愍世間，願必為說。",
        "translation": "With compassion for the world, I wish to explain it for them.",
        "source": "T15n0650_001:0750c17_4"
    },
    {
        "source_sentence": "當來世中有菩薩空見、無相見、無作見、無生見、無所有見、無取相見、佛見、菩提見者，",
        "translation": "In the future, there will be bodhisattvas who hold views of emptiness, signlessness, noncontrivance, nonorigination, nonexistence, nongrasping, nonattachment, buddhahood, and enlightenment.",
        "source": "T15n0650_001:0750c17_5"
    },
    {
        "source_sentence": "分別是空、是無相無作，好常讚學勤於事業，樂著文辭以辯說為妙貴於名利，",
        "translation": "They discriminate emptiness, signlessness, and non-contrivance. They like to always praise learning and strive in undertakings. They are fond of syllables and words but speak eloquently because they delight in explanations that are marvelously valuable for fame and profit.",
        "source": "T15n0650_001:0750c19_6"
    },
    {
        "source_sentence": "如是之人聞如來說是無文字法畢竟清淨，當捨是諸見。",
        "translation": "If someone like this hears the Tathāgata teach that these wordsless dharmas are ultimately pure, they'll abandon these views.",
        "source": "T15n0650_001:0750c21_7"
    },
    {
        "source_sentence": "是諸菩薩隨眾生所能信解，以方便力而為說法，雖說少欲知足而不以為最，",
        "translation": "These enlightening beings teach the Dharma according to the capacities of sentient beings through the power of skill in liberative technique. Though they teach about few desires and contentment, yet they do not think it is the best.",
        "source": "T15n0650_001:0750c22_8"
    },
    {
        "source_sentence": "雖說經戒亦不以為最，雖說在眾過惡亦知一切法遠離相，常稱讚獨處不在憒閙而不以為最。",
        "translation": "Even though he teaches the sūtras and precepts, he doesn't think they're the best; even though he teaches about the many faults and evils, he knows all dharmas are free of characteristics and always praises them as being alone in a place where there's no disturbance that doesn't make them the best.",
        "source": "T15n0650_001:0750c24_9"
    },
    {
        "source_sentence": "雖讚發菩提心而知心性即是菩提，雖讚大乘經而知一切諸法皆是大相，",
        "translation": "Though they praise the determination for enlightenment, yet they know that the essence of mind is enlightenment. Though they praise Mahayana scriptures, yet they know that all things are great characteristics.",
        "source": "T15n0650_001:0750c26_10"
    },
    {
        "source_sentence": "雖說菩薩道而不分別阿羅漢、辟支佛、諸佛，雖讚布施而通達布施平等相，",
        "translation": "Even though they teach the path of enlightening beings, they do not discriminate between arhats, pratyekabuddhas, or buddhas. Though they praise giving, yet they comprehend the equality of giving.",
        "source": "T15n0650_001:0750c28_11"
    },
    {
        "source_sentence": "雖讚持戒而了知諸法同是戒性，雖讚忍辱而知諸法無生無滅無盡相，雖讚精進而知諸法不發不行相，",
        "translation": "Although they praise observance of precepts, yet they know that all things are the same as the nature of precepts. Although they praise patience, yet they know that all things have no arising, no passing away, and no end. Although they praise energy, yet they know that all things do not give rise to signs of non-action.",
        "source": "T15n0650_001:0751a01_12"
    },
    {
        "source_sentence": "雖種種讚歎禪定而知一切法常定相，雖種種讚於智慧而了智慧之實性。",
        "translation": "Although he praises meditation in various ways, he knows the characteristics of all dharmas' constant concentration, and although he praises wisdom in various ways, he understands the true nature of wisdom.",
        "source": "T15n0650_001:0751a03_13"
    },
    {
        "source_sentence": "雖說貪欲之過而不見法有可貪者，雖說瞋恚之過而不見法有可瞋者，雖說愚癡之過而知諸法無癡無礙，",
        "translation": "Although they speak of the fault of craving, they do not see anything to be desired. Although they speak of the fault of hatred, they do not see anything to be hated. Though they speak of the fault of folly, yet they know all things are without delusion or obstruction.",
        "source": "T15n0650_001:0751a05_14"
    },
    {
        "source_sentence": "雖示眾生墮三惡道怖畏之苦而不得地獄、餓鬼、畜生之相。",
        "translation": "Although it shows that sentient beings fall into the three bad destinies of fear and suffering, they don't attain the characteristics of hell, hungry ghosts, or animals.",
        "source": "T15n0650_001:0751a07_15"
    },
    {
        "source_sentence": "如是諸菩薩，雖隨眾生所能信解，以方便力而為說法，而自信解一相之法，",
        "translation": "“Those bodhisattvas, though they teach the Dharma according to what sentient beings can believe and understand through the power of skillful means, yet with self-confidence they understand the single characteristic of the teaching.",
        "source": "T15n0650_001:0751a09_0"
    },
    {
        "source_sentence": "所謂空、無相、無作、無生、無所有、無取相。",
        "translation": "They are called emptiness, signlessness, noncontrivance, nonarising, nonexistence, and nongrasping characteristics.",
        "source": "T15n0650_001:0751a10_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0751a11_2"
    },
    {
        "source_sentence": "惟願說是不可思議方便之法，一切聲聞、辟支佛與新發意菩薩所不能及，",
        "translation": "May you teach this inconceivable method of liberation, which cannot be done by any disciples, solitary realizers, or newly awakened bodhisattvas.",
        "source": "T15n0650_001:0751a11_3"
    },
    {
        "source_sentence": "但為信解甚深一相法者說之。」",
        "translation": "He simply explains it for someone who believes in the profound single characteristic of the Dharma.",
        "source": "T15n0650_001:0751a13_4"
    },
    {
        "source_sentence": "爾時佛告師子遊步菩薩摩訶薩言：「善男子！",
        "translation": "It was then that the Buddha addressed the lion's wandering bodhisattva Mahāsattva, saying, Good man!",
        "source": "T15n0650_001:0751a14_5"
    },
    {
        "source_sentence": "汝今諦聽，善思念之，吾當為汝解說此義。」",
        "translation": "Now, listen closely and well consider it; I will explain this meaning for you.",
        "source": "T15n0650_001:0751a15_6"
    },
    {
        "source_sentence": "「唯然。",
        "translation": "“Yes, it’s true.",
        "source": "T15n0650_001:0751a16_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0751a16_8"
    },
    {
        "source_sentence": "我當受之。」",
        "translation": "I will accept it.",
        "source": "T15n0650_001:0751a16_9"
    },
    {
        "source_sentence": "「若人欲成佛，　　勿壞於貪欲，",
        "translation": "“If someone wants to become a buddha, don’t destroy craving.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　諸法即貪欲，　　知是則成佛。",
        "translation": "All dharmas are desires, and knowing this is the Buddhahood.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　貪欲及恚癡，　　無有能得者，",
        "translation": "Desire and hatred and delusion, There is no one who can attain them.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　是法皆如空，　　知是則成佛。",
        "translation": "These things are all like space: Knowing this, they become buddhas.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　見非見一相，　　著不著亦然，",
        "translation": "Seeing and not seeing is one characteristic. The same applies to attachment and to non-attachment.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　此無佛無法，　　知是名大智。",
        "translation": "This is the absence of buddhas and non-existence of buddhas, Knowing this is called great knowledge.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　如人於夢中，　　得道度眾生，",
        "translation": "Like a person in a dream Who has attained the path and liberated sentient beings.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　無道無眾生，　　佛法性亦然；",
        "translation": "Without paths or sentient beings, So is the buddha-dharma-nature.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　道場無所得，　　若得則不有，",
        "translation": "The site of enlightenment has no attainment, and if there is attaining, it doesn’t exist.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　明無明一相，　　知是為世尊。",
        "translation": "Knowing the one characteristic of ignorance is the Bhagavān.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　眾生即菩提，　　菩提即眾生，",
        "translation": "Sentient beings are enlightenment, Enlightenment is sentient beings.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　菩提眾生一，　　知是為世尊。",
        "translation": "The enlightenment of sentient beings is one, and they know that this is the Bhagavān.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　譬如巧幻師，　　幻作種種事，",
        "translation": "It's like a skillful illusionist who creates various things illusorily,",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　所見無有實，　　無智數若干，",
        "translation": "What’s seen has no substance, and the absence of knowledge is counted as numberless.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　貪瞋癡如幻，　　幻不異三毒，",
        "translation": "Desire, hatred, and delusion are like illusions. The illusions are not different from the three poisons:",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　凡夫自分別，　　我貪我瞋恚，",
        "translation": "Ordinary people themselves discriminate between self and self, craving self and anger.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　如是愚癡人，　　則墮三惡道。",
        "translation": "A foolish man like this Will fall into the three evil destinies.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　實相無貪恚，　　癡亦不可得，",
        "translation": "Their true characteristics have no craving or anger, And delusion is also ungraspable.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　分別如幻法，　　自生煩惱熱，",
        "translation": "Discriminating like illusory dharmas, they themselves give rise to the fever of affliction.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　實相無煩惱，　　無眾生無佛，",
        "translation": "True characteristics have no afflictions, There are no sentient beings and no Buddha.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　分別無生法，　　凡夫願作佛。",
        "translation": "Discriminating the nonarising of dharmas, Ordinary people wish to become buddhas.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　不見諸佛法，　　亦不見眾生，",
        "translation": "They don’t see the Buddha’s teaching, And they don’t see sentient beings.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　知是法相者，　　疾成眾生尊。",
        "translation": "Knowing this is the characteristic of the Dharma, he quickly becomes the honored one among sentient beings.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　若人求菩提，　　則無有菩提，",
        "translation": "If someone seeks enlightenment, Then there is no enlightenment.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　是人遠菩提，　　譬如天與地，",
        "translation": "That person's distant enlightenment is like heaven and earth,",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　知諸法如幻，　　速成人中上。",
        "translation": "Knowing all dharmas are illusory, he quickly grows up to adulthood.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　若人分別戒，　　是則無有戒，",
        "translation": "If someone discriminates precepts, then there are no precepts.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　若有見戒者，　　是則為失戒，",
        "translation": "If there is anyone who sees the precepts, This is a violation of the precepts.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　戒非戒一相，　　知是為導師。",
        "translation": "The precepts aren't one characteristic of the precepts, and knowing this is a guide.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　如夢受五欲，　　娛樂自快樂，",
        "translation": "Like a dream in which you experience the five desires and enjoy your own happiness,",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　分別見女色，　　此中實無女。",
        "translation": "Distinctly seeing the form of a woman, there really isn't a woman here.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　戒毀戒如夢，　　凡夫分別二，",
        "translation": "Precepts and immorality are like dreams. Ordinary beings discriminate two kinds:",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　實無戒毀戒，　　知是為導師。",
        "translation": "They really don't have precepts and disparage precepts, knowing that this is their guide.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　凡夫著名字，　　不知語言性，",
        "translation": "Ordinary people, attached to names, Do not know the nature of words.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　名字非名字，　　知是得無生。",
        "translation": "A name is not a name, knowing it to be the attainment of nonarising.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　自謂是菩薩，　　讀誦為人說，",
        "translation": "They claim to be bodhisattvas Who recite sutras for the sake of others.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　己身無所行，　　但依恃種性，",
        "translation": "They themselves do not practice anything but rely on the seed nature.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　但讀經求道，　　常見他人過，",
        "translation": "They simply read the scriptures and seek enlightenment, Observing the faults of others.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　著威儀文頌，　　見人敬自貴，",
        "translation": "They are attached to the verses on mannerisms and syllables, Seeing people respect their own dignity.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　恃種性文頌，　　不知法實相，",
        "translation": "Relying on the text and verses of the seed-nature, they don’t know the true characteristics of things.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　如是之人等，　　終不能得佛。",
        "translation": "Such people will never attain buddhahood.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　為說諸法空，　　惡心好諍訟，",
        "translation": "In order to explain the emptiness of all dharmas, bad thoughts are like arguments.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　是人無佛法，　　亦無有菩提。",
        "translation": "Such a person has no buddha-dharma And also no enlightenment.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　知瞋忍同相，　　達是終不瞋，",
        "translation": "Knowing that anger and forbearance are the same in characteristics, he understands that this is ultimately no anger.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　不了眾生性，　　是則生瞋恚。",
        "translation": "If someone doesn't understand the nature of sentient beings, then anger arises.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　自言菩薩者，　　復作如是說，",
        "translation": "The self-proclaimed bodhisattva further explains in this way:",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　我慈悲一切，　　成佛度眾生。",
        "translation": "I have compassion for all, becoming a buddha and liberating sentient beings.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　他惱生瞋恚，　　懷忿不與語，",
        "translation": "anger arises from the vexation of others, and they harbor anger and don’t speak.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　常求他人過，　　樂於鬪諍訟，",
        "translation": "They always seek the faults of others, preferring to fight and dispute.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　亦稱歎忍辱，　　及說諸法空，",
        "translation": "They also praised forbearance and explained the emptiness of all things.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　我心多憍慢，　　常觀他人過，",
        "translation": "My mind is full of arrogance, Always observing the faults of others.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　貪著於美味，　　晝夜念五欲，",
        "translation": "They are addicted to delicious food, Day and night they think of the five desires.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　是人入城邑，　　自說度人者，",
        "translation": "That person enters a city and tells himself to save people.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　悲念於眾生，　　常為求饒益，",
        "translation": "Being compassionate toward sentient beings, they always seek to benefit them.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　口雖如是說，　　而心好惱他。",
        "translation": "Even though he speaks in this way, his mind delights in harming others.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　我未曾見聞，　　慈悲而行惱，",
        "translation": "I have never seen or heard such compassionate acts of kindness and pity.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　互共相瞋惱，　　願生阿彌陀。",
        "translation": "Being angry with each other, they wish to be born in Amitâbha.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　若人如恒沙，　　惡口加刀杖，",
        "translation": "Suppose a person is like the sands of the Ganges River, With harsh words and swords and sticks.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　如是皆能忍，　　則生清淨土。",
        "translation": "Being able to tolerate all of these, they'll be born in the pure land.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　佛土非佛土，　　知如虛空相，",
        "translation": "Buddha-lands and non-buddha-lands, Knowing the characteristics of space.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　不分別國土，　　及國土功德，",
        "translation": "They do not discriminate lands And the virtues of lands.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　如是之人等，　　能生諸佛國。",
        "translation": "Such people as these can be born in the buddha-lands.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　自言忍眾惡，　　見菩薩如佛，",
        "translation": "They themselves say they tolerate all evils, Seeing bodhisattvas like buddhas.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　我未曾見聞，　　佛相而瞋者。",
        "translation": "I've never seen or heard anyone angry with the characteristics of a buddha.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　各自美毀他，　　樂檀越知識，",
        "translation": "Each one praises and disparages others, delighting in donors and friends.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　言我所教化，　　護使令如法，",
        "translation": "He speaks of self-transformation, Protecting sentient beings and enabling them to follow the Dharma.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　汝應我所度，　　莫親近餘人，",
        "translation": "You should be liberated by me. Don’t associate with anyone else.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　彼人行不純，　　常處於憒閙，",
        "translation": "That person’s behavior is impure, Always in turmoil and confusion.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　是人於佛道，　　不能勤修行。",
        "translation": "That person can't diligently cultivate the Buddha Way.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　真求佛道者，　　晝夜各三時，",
        "translation": "Those who truly seek the Buddha’s path At three times each day and night,",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　頂禮諸菩薩，　　應生恭敬心，",
        "translation": "prostrating to the bodhisattvas, they should give rise to respectful thoughts of veneration.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　隨其所行道，　　不說其過失。",
        "translation": "According to the path they follow, They don’t explain faults or errors.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　若見著五欲，　　不說其過惡，",
        "translation": "If someone is attached to the five desires, they don’t explain their faults and evils.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　應當念彼人，　　久後亦得道，",
        "translation": "You should think of that person And after a long time you will also attain enlightenment.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　次第行業道，　　不可頓成佛，",
        "translation": "The paths of action, in order, Do not suddenly become buddhas.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　或非久發心，　　是以行此事。",
        "translation": "Perhaps it's because they haven't long arisen the intention to do so.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　勿分別貪欲，　　貪欲性是道，",
        "translation": "Don’t discriminate craving. The nature of craving is the path.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　煩惱先自無，　　未來亦無有，",
        "translation": "The defilements themselves do not exist in the past, Nor will they exist in the future.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　能如是信解，　　便得無生忍。",
        "translation": "If someone can thus believe and understand it, they'll attain the forbearance of nonproduction.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　觀好惡音聲，　　知非音聲性，",
        "translation": "Observing good and bad sounds, They know what’s not the nature of sound.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　當入無文字，　　實相之法門，",
        "translation": "You should enter the Dharma-gate of reality, which has no words.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　若能信是法，　　則無婬怒癡。",
        "translation": "If someone can believe this teaching, then there's no lust, anger, or delusion.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　觀貪欲愚癡，　　即是無量相，",
        "translation": "Observing craving, desire, and folly Is the immeasurable characteristic.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　是二無文字，　　以文字故說，",
        "translation": "These two are without syllables. They are spoken of by means of syllables.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　諸有文字處，　　是皆無有實。",
        "translation": "All the places where there are words Have no real substance at all.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　一切諸音聲，　　觀是一音性，",
        "translation": "All sounds are perceived as one sound.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　佛說及邪說，　　是皆無分別。",
        "translation": "What the Buddha teaches and what is falsely taught Is none of them discriminated.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　法雖以言說，　　實無法無說，",
        "translation": "Although the teaching is expressed in words, There really is no dharma without explanation.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　能入一相門，　　則得無上忍。",
        "translation": "If someone can enter the gate of one characteristic, they'll attain unsurpassed forbearance.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　是忍是非忍，　　勿作是分別，",
        "translation": "This is forbearance and right forbearance, so don’t make such distinctions.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　於欲瞋恚心，　　勿計其中利，",
        "translation": "In the mind of desire and anger, Don’t count their benefits.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　知是二無生，　　當為世中尊。",
        "translation": "Knowing these two kinds of nonarising, he'll be the honored one in the world.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　東西南北方，　　如恒河沙土，",
        "translation": "East, west, south, and north are like the sands of the Ganges River.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　皆碎為微塵，　　一塵為一國，",
        "translation": "They are all reduced to atoms, and a speck of dust is one land.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　滿中諸珍寶，　　於無央數劫，",
        "translation": "It's filled with treasures and treasures for an immeasurable number of eons.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　供養諸如來，　　其所得功德，",
        "translation": "Making offerings to the enlightened ones, The virtues they attain.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　若人聞是經，　　過彼百千倍。",
        "translation": "If someone hears this sūtra, it's a hundred thousand times greater than that.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　若有出家人，　　一心求佛道，",
        "translation": "If there are renunciants who singlemindedly seek the buddha path,",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　我囑累是人，　　此祕密要法。",
        "translation": "I entrust this person with the secret essentials of the Dharma.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　若有誦是經，　　及以解其義，",
        "translation": "If someone recites this sūtra And understands its meaning,",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　無量總持辯，　　自然皆當得，",
        "translation": "They will naturally attain boundless, unremitting eloquence.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　利根無盡慧，　　樂說之辯才。",
        "translation": "With sharp faculties and inexhaustible wisdom, he enjoys the eloquence of explanation.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　無量億諸佛，　　皆亦與是人，",
        "translation": "Innumerable hundreds of millions of buddhas Will also give them to these people.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "　諸經妙法寶，　　自然皆能說。」",
        "translation": "The wonderful treasures of the teachings of the sutras can naturally be explained.",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "爾時世尊以偈答曰：爾時師子遊步菩薩白佛言：「世尊！",
        "translation": "It was then that the Bhagavān answered in verse, The lion's wandering bodhisattva said to the Buddha, Bhagavān!",
        "source": "T15n0650_001:0751a16_10"
    },
    {
        "source_sentence": "今說是偈，有幾所人得自利益？」",
        "translation": "How many people will attain self-benefit by speaking this verse now?",
        "source": "T15n0650_001:0752b06_11"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T15n0650_001:0752b07_12"
    },
    {
        "source_sentence": "汝見是大眾不？」",
        "translation": "Do you see this as the masses?",
        "source": "T15n0650_001:0752b07_13"
    },
    {
        "source_sentence": "「唯然已見。」",
        "translation": "“Yes, I’ve seen it.”",
        "source": "T15n0650_001:0752b08_14"
    },
    {
        "source_sentence": "佛言：「今說此法時，會中有無量無數眾生共集，與天、龍、夜叉、乾闥婆、阿修羅、緊那羅、迦樓羅、摩睺羅伽等滿在虛空，",
        "translation": "The Buddha said: When I teach this teaching, innumerable sentient beings will assemble together in the assembly. They will fill space with gods, dragons, yakṣas, gandharvas, asuras, kiṃnaras, garuḍas, mahoragas, and so forth.",
        "source": "T15n0650_001:0752b08_15"
    },
    {
        "source_sentence": "以說法之明乃至他方世界多所饒益。",
        "translation": "It's because the explanation of the teaching of the Dharma is so clear that it's often beneficial to other worlds.",
        "source": "T15n0650_001:0752b11_16"
    },
    {
        "source_sentence": "九萬二千夜叉神皆發阿耨多羅三藐三菩提心。",
        "translation": "92,000 yakṣa spirits all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T15n0650_001:0752b12_17"
    },
    {
        "source_sentence": "增上慢比丘有五百人未得謂得，聞是法無增上慢，得真法信，解一切法皆是一相，",
        "translation": "There were five hundred arrogant monks who had not attained what they called “attainment.” When they heard this teaching, there was no overweening arrogance. They gained faith in the true Dharma and understood that all things are one and the same characteristics.",
        "source": "T15n0650_001:0752b13_18"
    },
    {
        "source_sentence": "不受諸法故漏盡得解脫。",
        "translation": "Because they don't accept the teachings, their contaminants are ended and they attain liberation.",
        "source": "T15n0650_001:0752b15_19"
    },
    {
        "source_sentence": "於是菩薩眾中六萬二千人，信解諸法無障礙相得無生法忍。",
        "translation": "Thereupon, 62,000 people in the assembly of bodhisattvas believed and understood the unobstructed characteristics of all dharmas and attained the forbearance of the nonarising of the Dharma.",
        "source": "T15n0650_001:0752b15_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0650_001:0752b17_21"
    },
    {
        "source_sentence": "如是說法於諸說法中最為第一。",
        "translation": "Thus, he teaches the Dharma like this and is the best among all the teachings.",
        "source": "T15n0650_001:0752b17_22"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T15n0650_001:0752b18_23"
    },
    {
        "source_sentence": "如我於然燈佛所，信解諸法一相無礙，然後乃得無生法忍具足六波羅蜜。",
        "translation": "Suppose I were to believe and understand the single characteristics of all dharmas at Rājagṛha Buddha's place without obstruction, and then I would attain the six perfections when I attained the forbearance of the nonarising of the Dharma.",
        "source": "T15n0650_001:0752b18_24"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0650_001:0752b20_25"
    },
    {
        "source_sentence": "若菩薩於恒河沙劫，布施、持戒、忍辱、精進、禪定、智慧，若不知如是法相，",
        "translation": "“Furthermore, if a bodhisattva does not know the characteristics of these things for as many eons as there are grains of sand in the Ganges River— generosity, morality, patience, effort, meditation, and wisdom—",
        "source": "T15n0650_001:0752b20_26"
    },
    {
        "source_sentence": "是人或能斷滅一切善根。",
        "translation": "That person might be able to cut off all good roots.",
        "source": "T15n0650_001:0752b22_0"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T15n0650_001:0752b22_1"
    },
    {
        "source_sentence": "汝見提婆達多有大功德善根、成就三十二大人相，有如是功德，不知如是法相故，",
        "translation": "“Devadatta, you see that Devadatta is endowed with the roots of virtue and accomplishes the thirty-two marks of greatness. Because you do not know the characteristics of this doctrine, you have such qualities.",
        "source": "T15n0650_001:0752b22_2"
    },
    {
        "source_sentence": "斷滅善根墮大地獄。",
        "translation": "They cut off their good roots and fell into the great hell.",
        "source": "T15n0650_001:0752b24_3"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T15n0650_001:0752b26_0"
    },
    {
        "source_sentence": "當知雖久發心有大功德，不入是法門皆能斷滅善根功德。",
        "translation": "You should know that even though long-standing arousal of mind has great merit, those who don't enter this teaching will all be able to cut off the merit of good roots.",
        "source": "T15n0650_001:0752b26_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T15n0650_001:0752b27_2"
    },
    {
        "source_sentence": "如過去無量無邊不可思議阿僧祇劫，有佛名高須彌山王如來、應供、正遍知、明行足、善逝、世間解、無上士、道法御、天人師、佛、世尊，",
        "translation": "“O Mahāsthāmaprāpta, just as in the immeasurable, boundless, inconceivable, and incalculable eons of the past there was a buddha named Mount Sumeru Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Unsurpassed, teacher of",
        "source": "T15n0650_001:0752b27_3"
    },
    {
        "source_sentence": "壽命九千九百千萬億那由他歲，國土名金焰明，其國皆以黃金為地。",
        "translation": "Their life span was nine thousand nine hundred myriads of koṭis of nayutas of years. The land they inhabited was called Golden Flame Light and all the lands there were made of gold.",
        "source": "T15n0650_001:0752c01_4"
    },
    {
        "source_sentence": "其所說法亦以三乘度脫眾生，其佛初會，有八十百千萬億那由他聲聞弟子；",
        "translation": "At the first assembly of that buddha there were eighty-eight hundred myriads of koṭis of nayutas of śrāvaka disciples.",
        "source": "T15n0650_001:0752c03_5"
    },
    {
        "source_sentence": "次第二會，七十百千萬億那由他聲聞弟子；",
        "translation": "In the second assembly there were seventy-thousand myriads of koṭis of nayutas of śrāvaka disciples.",
        "source": "T15n0650_001:0752c05_0"
    },
    {
        "source_sentence": "第三會，六十百千萬億那由他聲聞弟子；",
        "translation": "The third assembly had sixty-thousand myriads of koṭis of nayutas of śrāvaka disciples.",
        "source": "T15n0650_001:0752c06_0"
    },
    {
        "source_sentence": "第四會，五十百千萬億那由他聲聞弟子；",
        "translation": "In the fourth assembly there were fifty-thousand myriads of koṭis of nayutas of śrāvaka disciples.",
        "source": "T15n0650_001:0752c06_1"
    },
    {
        "source_sentence": "皆得阿羅漢，捨諸重擔逮得己利，盡諸有結正智得解脫。",
        "translation": "They all attain arhatship, abandon their heavy burdens and acquire their own benefits, end the bonds of existence, and attain liberation with right knowledge.",
        "source": "T15n0650_001:0752c07_2"
    },
    {
        "source_sentence": "比丘尼眾倍於上數，優婆塞眾亦倍上數，優婆夷眾亦倍上數，菩薩眾亦倍上數，",
        "translation": "The assembly of bhikṣuṇīs doubles the number above, the assembly of laymen doubles the number above, the assembly of laymen doubles the number above, the assembly of laymen doubles the number above, and the assembly of bodhisattvas doubles the number above.",
        "source": "T15n0650_001:0752c09_3"
    },
    {
        "source_sentence": "皆得阿惟越致無生法忍，皆得無量無邊陀羅尼門三昧門，能轉不退法輪，",
        "translation": "They all attain the tolerance of the nonorigination of things by transcendence, and they all attain the immeasurable, boundless dhāraṇī-gate samādhi gate, which enables them to turn the irreversible wheel of the Dharma.",
        "source": "T15n0650_001:0752c11_0"
    },
    {
        "source_sentence": "何況新發菩薩意者。",
        "translation": "How could it be for someone who newly arouses the bodhisattva's intention?",
        "source": "T15n0650_001:0752c12_1"
    },
    {
        "source_sentence": "又發辟支佛道心者亦無量無邊。",
        "translation": "Also, those who give rise to the mind of the path of the pratyekabuddhas are also immeasurable and limitless.",
        "source": "T15n0650_001:0752c13_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T15n0650_001:0752c14_0"
    },
    {
        "source_sentence": "爾時彼佛會中弟子眾數無量無邊，彼金焰國中皆以七寶為樹，於其寶樹常出法音，",
        "translation": "At that time the number of his disciples at that assembly of buddhas was immeasurable and boundless. In that land of golden flames they all had trees made of the seven kinds of treasure, and from those jeweled trees always sounded the Dharma.",
        "source": "T15n0650_001:0752c14_1"
    },
    {
        "source_sentence": "所謂一切諸法空音、無相音、無作音、無生音、無所有音、無取相音。",
        "translation": "They are the sound of emptiness, signlessness, noncontrivance, nonarising, nonexistence, and nonappropriation of all dharmas.",
        "source": "T15n0650_001:0752c16_2"
    },
    {
        "source_sentence": "其國人民聞是法音，自然皆得諸法實相心得解脫。",
        "translation": "When the people of that country hear this teaching, they'll naturally attain liberation in their minds with the true characteristics of the teachings.",
        "source": "T15n0650_001:0752c17_3"
    },
    {
        "source_sentence": "其佛滅後法住千歲，諸寶樹音亦不復出。",
        "translation": "After the Buddha's passing away, the Dharma stayed for a thousand years, and the sound of the jeweled trees didn't emerge again.",
        "source": "T15n0650_001:0752c18_4"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T15n0650_001:0752c19_5"
    },
    {
        "source_sentence": "是高須彌山王佛，以法囑累淨威儀菩薩令守護法，囑累已後便入無餘涅槃。",
        "translation": "This is the Buddha of Mount Sumeru, the king of the high mountains, who instructed the bodhisattva Pure Conduct to guard the Dharma with his teaching and then entered nirvāṇa without remainder after entrusting it.",
        "source": "T15n0650_001:0752c19_6"
    },
    {
        "source_sentence": "時有比丘名有威儀，持戒不淨，得四禪四無色定及五神通，善誦毘尼藏，",
        "translation": "A bhikṣu named Sanghavyūha observed the precepts in an impure manner. He attained the fourth meditative state of absorption, the four formless states of concentration and five supernormal knowledges, and was well versed in the Vinaya.",
        "source": "T15n0650_001:0752c21_7"
    },
    {
        "source_sentence": "樂於苦行，不能善知他心。",
        "translation": "They delight in ascetic practices and can't well know the minds of others.",
        "source": "T15n0650_001:0752c23_8"
    },
    {
        "source_sentence": "其弟子眾亦皆苦行貴頭陀法。",
        "translation": "All of his disciples also practiced the noble ascetic teachings.",
        "source": "T15n0650_001:0752c23_9"
    },
    {
        "source_sentence": "是淨威儀法師，持戒清淨，於無所有法中得巧方便。",
        "translation": "This is the Dharma teacher Jīvaka Maitreya, who observes precepts that are pure and attains skillful means in the absence of all dharmas.",
        "source": "T15n0650_001:0752c24_10"
    },
    {
        "source_sentence": "復於一時，淨威儀法師將諸弟子，到有威儀比丘住處與共同止，淨威儀法師憐愍眾生故，",
        "translation": "Again, at one time, the Dharma teacher Jīvaka's manner was leading his disciples to a place where some dignified monks lived and shared their dwelling places, because the Dharma teacher Jīvaka's manner had pity for sentient beings.",
        "source": "T15n0650_001:0752c25_11"
    },
    {
        "source_sentence": "從所住處常入聚落食訖而還，教化百千萬家皆作弟子，令發阿耨多羅三藐三菩提心。",
        "translation": "From the place where he lived, he always entered a village and returned after he had finished his meal, taught millions of families to become disciples, and made them give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T15n0650_001:0752c27_12"
    },
    {
        "source_sentence": "其弟子眾亦善教化，到諸聚落而為說法，令若干百千眾生皆發阿耨多羅三藐三菩提心。",
        "translation": "Their disciples were also well-transformed, went to villages and preached the Dharma for them, causing hundreds of thousands of sentient beings to give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T15n0650_001:0752c29_13"
    },
    {
        "source_sentence": "有威儀比丘常樂住塔寺，其弟子眾不持淨戒而樂行頭陀。",
        "translation": "A monk with deportment always enjoyed living in a stūpa or monastery, and his disciples didn't observe the pure precepts but enjoyed practicing asceticism.",
        "source": "T15n0650_001:0753a02_14"
    },
    {
        "source_sentence": "有威儀比丘勤行精進其心決定，自以所行化諸弟子，貪著善法有所見得，",
        "translation": "A monk with deportment who diligently practices energy and is determined in his mind, transforming his disciples by what he himself does, craving the good Dharma and attaining it.",
        "source": "T15n0650_001:0753a04_15"
    },
    {
        "source_sentence": "所謂說一切有為法皆無常皆苦、一切法無我，不能善行諸禪定法，亦不能善於菩薩所行之道，",
        "translation": "They teach that all conditioned things are impermanent, painful, and selfless, unable to skillfully practice the teachings of meditation, and unable to skillfully follow the path taught by enlightening beings.",
        "source": "T15n0650_001:0753a06_16"
    },
    {
        "source_sentence": "本心不純故。",
        "translation": "It's because the original mind isn't pure.",
        "source": "T15n0650_001:0753a08_17"
    },
    {
        "source_sentence": "淨威儀法師善知眾生諸根利鈍，知有威儀比丘心故，不復常入聚落，其諸弟子如本不異。",
        "translation": "The Dharma teacher Jīvaka Vaiśeṣika well knows the sharpness and dullness of sentient beings' faculties, knowing that there are monks with dignified minds who don't always enter villages, and their disciples are no different from them as before.",
        "source": "T15n0650_001:0753a08_18"
    },
    {
        "source_sentence": "「有威儀比丘見淨威儀法師諸弟子眾常入聚落，生不淨心，即鳴犍椎集眾立制：『汝等自今已去不應入於聚落，",
        "translation": "When a monk with deportment saw that the disciples of the Master Śubhavyūha always entered villages, he became impure in mind. He immediately sounded the gandharva and assembled all the members of the sangha to establish a rule:",
        "source": "T15n0650_001:0753a10_19"
    },
    {
        "source_sentence": "不能一心徐行靜默，數入聚落得何等利？",
        "translation": "What's the benefit of repeatedly entering a village if you can't practice quietly and quietly with one mind?",
        "source": "T15n0650_001:0753a13_20"
    },
    {
        "source_sentence": "佛所稱讚阿練若住處，汝等當行禪樂莫好入他家。』",
        "translation": "Where the Buddha praises the abode of Āryā, you must practice meditation and not like to enter another's home.'",
        "source": "T15n0650_001:0753a14_21"
    },
    {
        "source_sentence": "淨威儀法師諸弟子眾，不受其語猶入聚落。",
        "translation": "The disciples of the Dharma teacher Jīvaka and others didn't accept his words, but they still entered the village.",
        "source": "T15n0650_001:0753a15_22"
    },
    {
        "source_sentence": "後於一時有威儀比丘，見從聚落中出，更鳴犍椎集眾，說如是言：『若復更入聚落者，",
        "translation": "One time, a bhikṣu with proper etiquette saw him emerge from the village. Again he sounded the gandharva and assembled the sangha. He said:",
        "source": "T15n0650_001:0753a16_23"
    },
    {
        "source_sentence": "不復得住於此。』",
        "translation": "I won't be able to stay here again.'",
        "source": "T15n0650_001:0753a18_24"
    },
    {
        "source_sentence": "「爾時淨威儀法師將護有威儀比丘故，告諸弟子：『汝等！",
        "translation": "It was then that the Dharma teacher Jīvaka, who was guarding a monk with authority, addressed his disciples, 'You!",
        "source": "T15n0650_001:0753a20_0"
    },
    {
        "source_sentence": "從今已去勿入聚落。』",
        "translation": "From now on, don't enter the village.'",
        "source": "T15n0650_001:0753a21_1"
    },
    {
        "source_sentence": "即如師教不入聚落。",
        "translation": "He then follows the teacher's instructions and doesn't enter a village.",
        "source": "T15n0650_001:0753a21_2"
    },
    {
        "source_sentence": "爾時諸人民眾不見其師及諸弟子故，皆懷憂惱善根退失。",
        "translation": "At the time, all the people and people didn't see their teacher or his disciples, so they all harbored grief and loss of good roots.",
        "source": "T15n0650_001:0753a22_3"
    },
    {
        "source_sentence": "淨威儀法師過三月自恣竟，從是中出至餘僧坊，於其所止師徒還入城邑聚落為人說法。",
        "translation": "After three months had passed, the Master of Jīvaka's manner completed his self-restraint, left here and went to another monk's quarters, where he stayed, and his disciples returned to towns and villages to preach for people.",
        "source": "T15n0650_001:0753a23_4"
    },
    {
        "source_sentence": "後時有威儀比丘，見淨威儀法師還入他家，見其弟子毀失常儀，復生不淨惡心作是念：『是比丘破戒毀戒，",
        "translation": "At that time, a bhikṣu with proper etiquette saw the Dharma teacher Jīvakavyūha and returned to another house. Seeing his disciples violate [the precepts] as usual, he again became impurely disgusted and thought:",
        "source": "T15n0650_001:0753a25_5"
    },
    {
        "source_sentence": "何有菩提？』",
        "translation": "How could there be enlightenment?'",
        "source": "T15n0650_001:0753a28_6"
    },
    {
        "source_sentence": "便語眾人：『是比丘雜行，去佛道甚遠。』",
        "translation": "He then said to the crowd, 'That monk's mixed practice is so far removed from the Buddha Way.'",
        "source": "T15n0650_001:0753a28_7"
    },
    {
        "source_sentence": "有威儀比丘起是業已，後時命終，是業果報故，墮阿鼻大地獄，九百千億劫受諸苦惱；",
        "translation": "A bhikṣu with deportment, having done this action, dies at a later time. As a result of that action, he will fall into the great hell of abhidharma and experience suffering and distress for nine hundred myriads of koṭis of kalpas.",
        "source": "T15n0650_001:0753a29_8"
    },
    {
        "source_sentence": "從地獄出六十三萬世，常被誹謗；",
        "translation": "For sixty-thousand thousand world ages they emerge from the hells and are constantly slandered.",
        "source": "T15n0650_001:0753b02_9"
    },
    {
        "source_sentence": "其罪漸薄，後作比丘三十二萬世，出家之後是業因緣反道入俗，又餘罪業因緣故，",
        "translation": "As their sins gradually diminished, they became bhikṣus for thirty-two thousand world ages. After renunciation of the householder’s life, these were the causes and conditions for rebirth in the secular world by means of karma. Furthermore, it is because of the causes and conditions for the other sins as well as for karmic actions that they came to be",
        "source": "T15n0650_001:0753b03_10"
    },
    {
        "source_sentence": "於淨明佛所出家入道殷勤精進如救頭然，千萬億歲中乃至不得柔順法忍，",
        "translation": "For thousands of myriads of koṭis of years, they won't attain the gentle tolerance of the Dharma for as long as it takes to leave home and enter the path in the presence of the Buddha Jīvakabuddha with zeal and effort like a savior.",
        "source": "T15n0650_001:0753b05_11"
    },
    {
        "source_sentence": "無量千萬世諸根闇鈍。",
        "translation": "In measureless millions of worlds, his faculties are dark and dull.",
        "source": "T15n0650_001:0753b06_12"
    },
    {
        "source_sentence": "「師子遊步，於汝意云何？",
        "translation": "“What do you think, lion?",
        "source": "T15n0650_001:0753b07_13"
    },
    {
        "source_sentence": "爾時有威儀比丘豈異人乎？",
        "translation": "Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is",
        "source": "T15n0650_001:0753b07_14"
    },
    {
        "source_sentence": "勿造斯觀，則我身是。",
        "translation": "If you don't create this contemplation, then I am myself.",
        "source": "T15n0650_001:0753b08_15"
    },
    {
        "source_sentence": "我時起是微細不淨心，受此罪業墮於地獄。",
        "translation": "When I gave rise to this subtle and impure mind, I fell into hell for this sinful action.",
        "source": "T15n0650_001:0753b09_16"
    },
    {
        "source_sentence": "師子遊步！",
        "translation": "Sīha, you wanderer!",
        "source": "T15n0650_001:0753b10_17"
    },
    {
        "source_sentence": "若人不欲起是微細罪業者，於彼菩薩不應起於惡心。",
        "translation": "If someone doesn't want to do these subtle crimes, they shouldn't give rise to bad thoughts about those bodhisattvas.",
        "source": "T15n0650_001:0753b10_18"
    },
    {
        "source_sentence": "菩薩諸所行道皆當信解，不應起於瞋恨之心，應作是念：『我不能善知他人心，",
        "translation": "“Enlightening beings should believe and understand all paths of practice, not become angry or hostile. They should think, ‘I cannot know the minds of others;",
        "source": "T15n0650_001:0753b11_19"
    },
    {
        "source_sentence": "眾生所行是亦難知。』",
        "translation": "What sentient beings do is also difficult to know.'",
        "source": "T15n0650_001:0753b13_20"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T15n0650_001:0753b14_21"
    },
    {
        "source_sentence": "如來見是利故常說是法，是故行者不應平量於人，唯有如來及似如來者，",
        "translation": "Because the Tathāgata sees these benefits, he always explains these teachings. Therefore, practitioners should not evenly discriminate people; only the Tathāgata and those who appear to be tathāgatas are allowed to do so.",
        "source": "T15n0650_001:0753b14_22"
    },
    {
        "source_sentence": "乃能知是。",
        "translation": "They'll then be able to know it's true.",
        "source": "T15n0650_001:0753b16_23"
    },
    {
        "source_sentence": "是故行者若欲自護其身，慎莫平量於人而相違逆。",
        "translation": "Therefore, if practitioners want to protect themselves, they should be careful not to disobey people evenly.",
        "source": "T15n0650_001:0753b16_24"
    },
    {
        "source_sentence": "菩薩若欲修集佛法，常當晝夜勤心專念。",
        "translation": "If a bodhisattva wants to cultivate the Buddha's teaching, he always diligently concentrates his mind day and night on it.",
        "source": "T15n0650_001:0753b17_25"
    },
    {
        "source_sentence": "深發菩薩心者，不當好求人長短。",
        "translation": "Those who deeply aroused the bodhisattva's mind shouldn't be fond of looking for length and shortness.",
        "source": "T15n0650_001:0753b18_26"
    },
    {
        "source_sentence": "菩薩若能教三千大千世界中眾生令行十善，不如菩薩如一食頃一心靜處念一相法門，",
        "translation": "If a bodhisattva can teach sentient beings in the 3,000 great one-thousand worlds to practice the ten kinds of goodness, it's not like a bodhisattva who mindfully meditates on a single characteristic of the Dharma teaching for an instant while he's alone in a tranquil place with one meal.",
        "source": "T15n0650_001:0753b19_27"
    },
    {
        "source_sentence": "乃至聞受讀誦解說，是人福德勝彼甚多。",
        "translation": "Even if someone hears, receives, reads, recites, understands, and teaches, that person's merit is much greater than theirs.",
        "source": "T15n0650_001:0753b21_28"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0650_001:0753b22_29"
    },
    {
        "source_sentence": "諸菩薩用是法門，能滅一切業障罪，亦於一切眾生之中離憎愛心，便能疾得一切種智。」",
        "translation": "Bodhisattvas use this teaching to extinguish all the karmic hindrances and sins, and they're free of hatred for all sentient beings, so they can quickly attain all kinds of cognition.",
        "source": "T15n0650_001:0753b22_30"
    },
    {
        "source_sentence": "爾時文殊師利法王子白佛言：「世尊！",
        "translation": "It was then that Mañjuśrī, the prince of the Dharma, said to the Buddha, Bhagavān!",
        "source": "T15n0650_001:0753b24_31"
    },
    {
        "source_sentence": "如佛所說滅業障罪，云何滅業障罪？」",
        "translation": "As the Buddha explains, what is the sin of extinguishing the karmic hindrances and how are they extinguished?",
        "source": "T15n0650_001:0753b25_32"
    },
    {
        "source_sentence": "佛告文殊師利：「若菩薩見一切法性無業無報，則能畢滅業障之罪。",
        "translation": "The Buddha told Mañjuśrī, If a bodhisattva sees the nature of all dharmas without karma or retribution, then he'll be able to end the sin of the karmic hindrances.",
        "source": "T15n0650_001:0753b26_33"
    },
    {
        "source_sentence": "又文殊師利！",
        "translation": "Also, Mañjuśrī!",
        "source": "T15n0650_001:0753b27_34"
    },
    {
        "source_sentence": "若菩薩見貪欲際即是真際，見瞋恚際即是真際，見愚癡際即是真際，則能畢滅業障之罪。",
        "translation": "If a bodhisattva sees the limit of craving as the true limit, sees the limit of anger as the true limit, and sees the limit of folly as the true limit, then he'll be able to extinguish the sins of the karmic hindrances.",
        "source": "T15n0650_001:0753b28_35"
    },
    {
        "source_sentence": "又文殊師利！",
        "translation": "Also, Mañjuśrī!",
        "source": "T15n0650_001:0753c01_36"
    },
    {
        "source_sentence": "若菩薩能見一切眾生性即是涅槃性，則能畢滅業障之罪。",
        "translation": "If a bodhisattva can see that the nature of all sentient beings is the nature of nirvāṇa, then he'll be able to end the sin of the karmic hindrances.",
        "source": "T15n0650_001:0753c01_37"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0650_001:0753c03_0"
    },
    {
        "source_sentence": "若人自有所見即能起業，無知無聞凡夫愚人不知諸法畢竟滅相，故自見其身亦見他人，",
        "translation": "If a person sees something for himself, he is able to produce actions. Ordinary people who are ignorant and unintelligent do not know the ultimate cessation of all dharmas; therefore, they themselves see their own bodies and also others.",
        "source": "T15n0650_001:0753c03_1"
    },
    {
        "source_sentence": "以是見故便起身口意業。",
        "translation": "Because of this view, physical, verbal, and mental actions arise.",
        "source": "T15n0650_001:0753c05_2"
    },
    {
        "source_sentence": "是人妄見憶想分別，作是念：『我是貪欲、瞋恚、愚癡。』",
        "translation": "That person deludedly sees, remembers, conceptualizes, and thinks, 'This is craving, anger, ill-will, and folly.'",
        "source": "T15n0650_001:0753c05_3"
    },
    {
        "source_sentence": "如是分別故，於佛法中出家學道，復作是念：『我是持戒修梵行人，我當越度生死，",
        "translation": "Because of such discrimination, they leave home and train in the path according to the Buddha’s teaching. They also think, ‘This is me who keeps the precepts and practices celibacy; I will transcend birth and death.",
        "source": "T15n0650_001:0753c07_4"
    },
    {
        "source_sentence": "得於涅槃免諸苦惱。』",
        "translation": "They'll attain nirvāṇa and be freed from suffering.'",
        "source": "T15n0650_001:0753c09_0"
    },
    {
        "source_sentence": "是人分別諸法，是善是不善，是應知、是應斷、是應證、是應修，所謂苦應見、集應斷、滅應證、道應修。",
        "translation": "That person discerns qualities that are good and unskillful, which should be known, stopped, realized, and cultivated, namely, the view that suffering should be seen, the accumulation should be stopped, cessation should be realized, and the path should be cultivated.",
        "source": "T15n0650_001:0753c09_1"
    },
    {
        "source_sentence": "而復分別一切諸行皆悉無常，一切諸行皆悉是苦，一切諸行皆三毒熾然，",
        "translation": "All conditioned things are impermanent, all conditioned things are painful, and all conditioned things are like flames of the three poisons.",
        "source": "T15n0650_001:0753c11_2"
    },
    {
        "source_sentence": "我當疾捨此有為法。",
        "translation": "I will quickly abandon this conditioned dharma.",
        "source": "T15n0650_001:0753c13_3"
    },
    {
        "source_sentence": "常作如是思惟，於諸行中種種取相而生厭心。",
        "translation": "He always thinks like this and becomes disillusioned with various ways to grasp the characteristics of conditioned things.",
        "source": "T15n0650_001:0753c14_0"
    },
    {
        "source_sentence": "「爾時便作是念：『見諸行如是，是名見苦；",
        "translation": "“At that point they think, ‘Seeing conditioned forces like this is to be called seeing suffering.",
        "source": "T15n0650_001:0753c16_0"
    },
    {
        "source_sentence": "惡厭諸行，是名斷集。』",
        "translation": "To dislike the practices, this is called stopping accumulation.'",
        "source": "T15n0650_001:0753c17_0"
    },
    {
        "source_sentence": "分別諸行，見於滅諦即作是念：『我今見滅是名證滅，我當修道。』",
        "translation": "He discerns the practices, sees the truth of cessation, and then thinks, 'Now that I see cessation as realization, I will cultivate it.'",
        "source": "T15n0650_001:0753c17_1"
    },
    {
        "source_sentence": "便至靜處念如是法，作是念已攝心定住。",
        "translation": "He then goes to a quiet place and thinks of this teaching, and after thinking it, he collects his mind and abides in concentration.",
        "source": "T15n0650_001:0753c18_2"
    },
    {
        "source_sentence": "是人先得厭心，今得定心，故於諸行中心便捨離，而自愧厭不喜不樂，",
        "translation": "That person had previously developed a mind of disenchantment, but now he’s acquired a concentrated mind. Therefore, in the midst of all conditioned states of being, he lets go of them and feels shame [because] disgusted, displeased, neither pleased, nor delighted.",
        "source": "T15n0650_001:0753c19_3"
    },
    {
        "source_sentence": "復作是念：『我今於一切法中已得解脫，更無所作，我身已得阿羅漢道。』",
        "translation": "Again, he thinks, 'Now that I've attained liberation in all dharmas and have nothing more to do, I've already attained the path of the arhat.'",
        "source": "T15n0650_001:0753c21_4"
    },
    {
        "source_sentence": "是人命終之時見受生處，即菩提中心生疑悔，以此疑故命終之後墮大地獄。",
        "translation": "When that person's life ends, they see the place of birth, which is the center of enlightenment and become doubtful and remorseful, and because of this doubt, they fall into great hell after their life ends.",
        "source": "T15n0650_001:0754a01_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0650_001:0754a02_1"
    },
    {
        "source_sentence": "是人於無生法中而分別故。」",
        "translation": "That person discriminates among the nonarising dharmas.",
        "source": "T15n0650_001:0754a03_2"
    },
    {
        "source_sentence": "爾時文殊師利法王子白佛言：「世尊！",
        "translation": "It was then that Mañjuśrī, the prince of the Dharma, said to the Buddha, Bhagavān!",
        "source": "T15n0650_001:0754a04_0"
    },
    {
        "source_sentence": "今云何應觀四聖諦？」",
        "translation": "How should we now contemplate the four noble truths?",
        "source": "T15n0650_001:0754a04_1"
    },
    {
        "source_sentence": "佛告文殊師利：「若行者能見一切法即是無生性，是名見苦。",
        "translation": "The Buddha told Mañjuśrī, If a practitioner can see that all dharmas are the nature of nonproduction, this is called seeing suffering.",
        "source": "T15n0650_001:0754a05_2"
    },
    {
        "source_sentence": "若能見一切法不集不起，是名斷集。",
        "translation": "If someone can see all things that aren't collected and don't arise, this is called stopping accumulation.",
        "source": "T15n0650_001:0754a06_3"
    },
    {
        "source_sentence": "若能見一切法畢竟滅相，是名證滅。",
        "translation": "If someone can see the final cessation of all dharmas, this is called realizing cessation.",
        "source": "T15n0650_001:0754a07_4"
    },
    {
        "source_sentence": "若能見一切法無所有性，是名修道。",
        "translation": "If they can see that all things lack existence, this is called cultivation.",
        "source": "T15n0650_001:0754a08_5"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0754a09_6"
    },
    {
        "source_sentence": "若行者能如是見四聖諦，是人不作如是分別，是法善是法不善，是法應見、是法應斷、是法應證、是法應修，",
        "translation": "If a practitioner can thus see the four noble truths, that person doesn’t discriminate in such a way: “The teaching is good and the teaching is bad; this teaching should be seen, this teaching should be abandoned, this teaching should be realized, this teaching should be cultivated.",
        "source": "T15n0650_001:0754a09_7"
    },
    {
        "source_sentence": "所謂苦應見、集應斷、滅應證、道應修。",
        "translation": "They say that suffering should be seen, accumulation should be stopped, cessation should be realized, and the path should be cultivated.",
        "source": "T15n0650_001:0754a11_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0650_001:0754a12_9"
    },
    {
        "source_sentence": "凡夫所行貪欲、瞋恚、愚癡，行者見是法皆空、無生、無所有、不可分別，",
        "translation": "Ordinary people who practice craving, hatred, and folly see all these things as empty, uncreated, nonexistent, and indiscriminate.",
        "source": "T15n0650_001:0754a12_10"
    },
    {
        "source_sentence": "但積集虛妄。",
        "translation": "It's simply the accumulation of falsehood.",
        "source": "T15n0650_001:0754a14_11"
    },
    {
        "source_sentence": "爾時於法無所取無所捨，於三界中心無所礙，見一切三界畢竟不生，見一切善不善法虛誑不實，",
        "translation": "At that point, they grasp nothing at all dharmas and don’t relinquish anything. They see no obstruction in the center of the three realms; they see that all things are ultimately unarisen in the three realms. They see that all good and bad qualities are vain and unreal.",
        "source": "T15n0650_001:0754a14_12"
    },
    {
        "source_sentence": "如幻如夢如影如響如焰。",
        "translation": "They're like illusions, dreams, shadows, sounds, and flames.",
        "source": "T15n0650_001:0754a16_13"
    },
    {
        "source_sentence": "行者見貪欲性即是涅槃性，瞋恚性即是涅槃性，愚癡性即是涅槃性。",
        "translation": "Practitioners see the nature of craving as the nature of nirvāṇa, the nature of anger as the nature of nirvāṇa, and the nature of folly as the nature of nirvāṇa.",
        "source": "T15n0650_001:0754a17_14"
    },
    {
        "source_sentence": "若能見一切法性如是，便於一切眾生之中不起憎愛。",
        "translation": "If someone can see the nature of all dharmas as such, then they won't hate or love them among all sentient beings.",
        "source": "T15n0650_001:0754a19_15"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0650_001:0754a20_16"
    },
    {
        "source_sentence": "是行者不得是法，若生愛處、若生憎處，安住虛空，心中乃至不見佛、不見法、不見僧，",
        "translation": "If this practitioner doesn't obtain this teaching, and if he gives rise to a place of craving or a place of hatred and abides in space, his mind doesn't even see the Buddha, Dharma, or saṃgha.",
        "source": "T15n0650_001:0754a20_17"
    },
    {
        "source_sentence": "是則不見一切法。",
        "translation": "Then they won't see all dharmas.",
        "source": "T15n0650_001:0754a22_18"
    },
    {
        "source_sentence": "若不見一切法，於諸法中則不生疑，不生疑故則不受一切法，不受一切法故則自寂滅。",
        "translation": "If they don't see all dharmas, doubt doesn't arise in them, and because doubt doesn't arise, they don't accept all dharmas, and because they don't accept all dharmas, they become tranquil on their own.",
        "source": "T15n0650_001:0754a23_0"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0754a25_0"
    },
    {
        "source_sentence": "長老須菩提知如是法故，不來禮佛足。",
        "translation": "Because the elder Subhūti knew this teaching, he didn't come to pay homage at the Buddha's feet.",
        "source": "T15n0650_001:0754a25_1"
    },
    {
        "source_sentence": "須菩提尚不得自身，何況得如來身？",
        "translation": "Suppository of enlightenment still can't get his own body, so why would he get the Tathāgata's body?",
        "source": "T15n0650_001:0754a26_2"
    },
    {
        "source_sentence": "不得自身而得如來身者，無有是處。」",
        "translation": "There's no place for someone who doesn't get their own body and attains the Tathāgata's body.",
        "source": "T15n0650_001:0754a27_0"
    },
    {
        "source_sentence": "文殊師利復白佛言：「世尊！",
        "translation": "Mañjuśrī again said to the Buddha, Bhagavān!",
        "source": "T15n0650_001:0754a28_0"
    },
    {
        "source_sentence": "行者云何應觀四念處？」",
        "translation": "How should practitioners contemplate the four abodes of mindfulness?",
        "source": "T15n0650_001:0754a28_1"
    },
    {
        "source_sentence": "佛告文殊師利：「當來世有比丘如是說：『觀內身處若觀不淨是身念處，",
        "translation": "The Buddha said to MaiijusIi: In the future there will be a monk who teaches in this way:",
        "source": "T15n0650_001:0754a29_2"
    },
    {
        "source_sentence": "觀樂皆苦是受念處，觀心生滅性是心念處，觀壞和合相但得法相是法念處。』」",
        "translation": "Observing that pleasure and suffering are both painful is the mindfulness of feeling, observing the mind's arising and ceasing nature is the mindfulness of mind, and observing the combined characteristic of disintegration and only attaining the characteristic of dharmas is the mindfulness of dharmas.'",
        "source": "T15n0650_001:0754b01_3"
    },
    {
        "source_sentence": "文殊師利白佛言：「世尊！",
        "translation": "Mañjuśrī said to the Buddha, Bhagavān!",
        "source": "T15n0650_001:0754b03_4"
    },
    {
        "source_sentence": "今云何真觀四念處？」",
        "translation": "What are the four abodes of mindfulness of true contemplation now?",
        "source": "T15n0650_001:0754b04_0"
    },
    {
        "source_sentence": "佛言：「止止。",
        "translation": "The Buddha said, Stop!",
        "source": "T15n0650_001:0754b04_1"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0754b04_2"
    },
    {
        "source_sentence": "不須問也，如來隨宜說法難可得解。」",
        "translation": "It's not necessary to ask, because the Tathāgata teaches appropriately and difficult to understand.",
        "source": "T15n0650_001:0754b04_3"
    },
    {
        "source_sentence": "文殊師利言：「世尊！",
        "translation": "Mañjuśrī said, Bhagavān!",
        "source": "T15n0650_001:0754b05_4"
    },
    {
        "source_sentence": "愍念眾生故，願必為說。」",
        "translation": "Because of compassion for sentient beings, I wish to explain it for them.",
        "source": "T15n0650_001:0754b06_5"
    },
    {
        "source_sentence": "佛告文殊師利：「若行者見身如虛空，是為身念處；",
        "translation": "The Buddha said to MaiijusIi: When a practitioner sees the body as space, this is the foundation of mindfulness on the body.",
        "source": "T15n0650_001:0754b06_6"
    },
    {
        "source_sentence": "若行者見受不得內外兩間，是為受念處；",
        "translation": "If the practitioner sees feeling but does not get it either inside or outside, this is the application of mindfulness on feeling.",
        "source": "T15n0650_001:0754b07_7"
    },
    {
        "source_sentence": "若行者知心唯有名字，是為心念處；",
        "translation": "If a practitioner knows that mind has only names, this is the application of mindfulness on names.",
        "source": "T15n0650_001:0754b08_8"
    },
    {
        "source_sentence": "若行者不得善法不得不善法，是為法念處。",
        "translation": "If a practitioner doesn't attain good qualities and doesn't have to follow good qualities, this is the mindfulness of qualities.",
        "source": "T15n0650_001:0754b09_9"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0754b10_10"
    },
    {
        "source_sentence": "應如是觀四念處。」",
        "translation": "You should thus observe the four abodes of mindfulness.",
        "source": "T15n0650_001:0754b11_11"
    },
    {
        "source_sentence": "文殊師利復白佛言：「世尊！",
        "translation": "Mañjuśrī again said to the Buddha, Bhagavān!",
        "source": "T15n0650_001:0754b11_12"
    },
    {
        "source_sentence": "行者云何應觀八聖道分？」",
        "translation": "How should practitioners contemplate the eightfold noble path?",
        "source": "T15n0650_001:0754b12_13"
    },
    {
        "source_sentence": "佛告文殊師利：「若行者見一切法平等無二無分別，是名正見。",
        "translation": "The Buddha told Mañjuśrī, If a practitioner sees that all things are equal, without duality or distinction, this is called right view.",
        "source": "T15n0650_001:0754b13_0"
    },
    {
        "source_sentence": "見一切法無思惟無分別，以是見故是名正思惟。",
        "translation": "Seeing all things without contemplation and without discrimination is called right contemplation because of this view.",
        "source": "T15n0650_001:0754b14_1"
    },
    {
        "source_sentence": "見一切法無言說相，善修語言平等相故，是名正語。",
        "translation": "Seeing all dharmas without the characteristics of verbal expressions and skillfully cultivating the equal characteristics of speech is called right speech.",
        "source": "T15n0650_001:0754b15_2"
    },
    {
        "source_sentence": "見一切法不作相，作者不可得故，是名正業。",
        "translation": "Seeing all dharmas that don't create characteristics, and because the author is unobtainable, this is called right action.",
        "source": "T15n0650_001:0754b16_3"
    },
    {
        "source_sentence": "不分別正命邪命，善修習平等命故，是名正命。",
        "translation": "Not discriminating right livelihood from wrong livelihood and skillfully cultivating equality of life is called right livelihood.",
        "source": "T15n0650_001:0754b17_4"
    },
    {
        "source_sentence": "不發不起一切法，以無所行故，是名正精進。",
        "translation": "Not producing all dharmas because there's nothing to practice is called right effort.",
        "source": "T15n0650_001:0754b18_5"
    },
    {
        "source_sentence": "於一切法無所憶念，諸憶念性離故，是名正念。",
        "translation": "Because there's no recollection of anything in all dharmas and the nature of recollection is free, this is called right mindfulness.",
        "source": "T15n0650_001:0754b19_6"
    },
    {
        "source_sentence": "見一切法性常定，以不散不緣不可得故，是名正定。",
        "translation": "Seeing that the nature of all dharmas is always concentrated because it's not dispersed or conditioned and unobtainable, this is called right concentration.",
        "source": "T15n0650_001:0754b20_7"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0754b22_8"
    },
    {
        "source_sentence": "行者應如是觀八聖道分。」",
        "translation": "Practitioners should thus observe the eight noble factors of the path.",
        "source": "T15n0650_001:0754b22_9"
    },
    {
        "source_sentence": "文殊師利復白佛言：「世尊！",
        "translation": "Mañjuśrī again said to the Buddha, Bhagavān!",
        "source": "T15n0650_001:0754b23_0"
    },
    {
        "source_sentence": "行者云何應觀五根？」",
        "translation": "How should practitioners observe the five faculties?",
        "source": "T15n0650_001:0754b23_1"
    },
    {
        "source_sentence": "佛告文殊師利：「若行者信一切法畢竟不生，從本已來常自爾故，是名信根。",
        "translation": "The Buddha told Mañjuśrī, If a practitioner believes that all dharmas ultimately don't arise and always do so since the distant past, this is called the faculty of faith.",
        "source": "T15n0650_001:0754b25_0"
    },
    {
        "source_sentence": "於一切法中心無所住，遠近相離故，是名精進根。",
        "translation": "Because there's nothing to abide in at the center of all dharmas, and because they're far removed from each other, this is called the faculty of effort.",
        "source": "T15n0650_001:0754b26_1"
    },
    {
        "source_sentence": "於一切法無所憶念，緣性離故不繫念於緣，是名念根。",
        "translation": "Being unmindful of all things and not mindful of their causal conditions because the causal conditions are absent, this is called the faculty of mindfulness.",
        "source": "T15n0650_001:0754b27_2"
    },
    {
        "source_sentence": "於一切法無所思惟，二法不可得故，是名定根。",
        "translation": "Because all things are not contemplated, and because the two dharmas are unobtainable, this is called the faculty of concentration.",
        "source": "T15n0650_001:0754b29_3"
    },
    {
        "source_sentence": "見一切法常空，離於生相，是名慧根。",
        "translation": "Seeing that all things are always empty and free of the characteristics of birth is called the faculty of wisdom.",
        "source": "T15n0650_001:0754c01_4"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0754c02_5"
    },
    {
        "source_sentence": "行者應如是觀五根。」",
        "translation": "Practitioners should thus observe the five faculties.",
        "source": "T15n0650_001:0754c02_6"
    },
    {
        "source_sentence": "文殊師利復白佛言：「世尊！",
        "translation": "Mañjuśrī again said to the Buddha, Bhagavān!",
        "source": "T15n0650_001:0754c02_7"
    },
    {
        "source_sentence": "行者云何應觀七菩提分？」",
        "translation": "How should practitioners contemplate the seven factors of enlightenment?",
        "source": "T15n0650_001:0754c03_8"
    },
    {
        "source_sentence": "佛言：「文殊師利！",
        "translation": "The Buddha said, Mañjuśrī!",
        "source": "T15n0650_001:0754c05_0"
    },
    {
        "source_sentence": "行者能見一切法無憶念，是名念菩提分。",
        "translation": "Practitioners can see all things without recollection, which is called the awakening factor of mindfulness.",
        "source": "T15n0650_001:0754c05_1"
    },
    {
        "source_sentence": "若一切法，若善、若不善、若無記，不可選擇、不可得，無決定故，是名擇菩提分。",
        "translation": "If all dharmas, whether good, bad, or indeterminate, can't be selected or obtained because they lack certainty, this is called the factors of selecting and enlightenment.",
        "source": "T15n0650_001:0754c06_2"
    },
    {
        "source_sentence": "若不取一切三界相，善壞三界故，是名精進菩提分。",
        "translation": "If they don't grasp all the characteristics of the three realms and skillfully destroy the three realms, this is called the awakening factor of effort.",
        "source": "T15n0650_001:0754c08_3"
    },
    {
        "source_sentence": "若一切有為法中不生喜相，善壞有喜相故，是名喜菩提分。",
        "translation": "If the characteristic of joy doesn't arise in all conditioned dharmas, and good decay has the characteristic of joy, this is called the enlightenment factor of joy.",
        "source": "T15n0650_001:0754c09_4"
    },
    {
        "source_sentence": "若一切法中除却其心，緣相不可得故，是名除菩提分。",
        "translation": "If he removes his mind in all dharmas because the perceptual objects and characteristics are unobtainable, this is called removing the factors of enlightenment.",
        "source": "T15n0650_001:0754c10_5"
    },
    {
        "source_sentence": "若一切法不可得，善修壞相故，是名定菩提分。",
        "translation": "If all dharmas are unobtainable because they skillfully cultivate the characteristic of disintegration, this is called the factors of enlightenment concentration.",
        "source": "T15n0650_001:0754c11_6"
    },
    {
        "source_sentence": "若於一切法無所依止不貪不著，不見一切法故得捨心，是名捨菩提分。",
        "translation": "If someone has nothing to rely on for all things, doesn't cling or cling to them, and attains the mind of equanimity because they don't see all things, this is called the enlightenment factor of equanimity.",
        "source": "T15n0650_001:0754c12_7"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0754c14_8"
    },
    {
        "source_sentence": "行者應如是觀七菩提分。",
        "translation": "Practitioners should thus observe the seven factors of enlightenment.",
        "source": "T15n0650_001:0754c14_9"
    },
    {
        "source_sentence": "若行者能如是見四聖諦、四念處、八聖道分、五根、七菩提分，我說是人名為已得度者，",
        "translation": "If a practitioner can thus see the four noble truths, the four abodes of mindfulness, the eight noble factors of the path, the five faculties, and the seven factors of enlightenment, I say this person is called someone who has attained liberation.",
        "source": "T15n0650_001:0754c15_10"
    },
    {
        "source_sentence": "到於彼岸，出在陸地無畏之處，已離重檐除諸塵垢，是人名為無所有者、無所憂者、無所受者，",
        "translation": "When they reach the other shore and emerge on land where there is no fear, having been freed from the heavy canopy and cleared of all dirt, such people are called those who have nothing to own, who have nothing to worry about, and who have nothing to receive.",
        "source": "T15n0650_001:0754c17_11"
    },
    {
        "source_sentence": "是名阿羅漢、是名沙門、是名婆羅門、是名比丘、是名澡浴潔淨者、是名智者是名解者、是名聞者、是名佛子、是名釋子、是名破刺棘者、是名却關鍵者、是名已度塹者、是名出欲求者、是名開門扇者、是名賢聖勝相者。",
        "translation": "This is called an arhat, this is called an ascetic, this is called a brāhmaṇa, this is called a monk, this is called a bhik, this is called a bathing cleaner, this is called a wise person who understands, this is called a hearer, this is called a buddha-son, this is called a Śākyamuni, this is called",
        "source": "T15n0650_001:0754c19_12"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0754c25_0"
    },
    {
        "source_sentence": "若有比丘成就如是法者，於天人世間名為福田，應受供養。",
        "translation": "If a monk accomplishes such a teaching, he'll be called a field of merit in the gods and humans in the world, and he should be offered an offering.",
        "source": "T15n0650_001:0754c25_1"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0754c26_2"
    },
    {
        "source_sentence": "是比丘若欲不虛食國中施者、破壞魔網者、欲度生死海者、欲得涅槃者、欲脫一切苦惱者、欲為一切天人世間作福田者，",
        "translation": "Suppose that monk wants to give alms in a country where he doesn't eat falsely, destroys Māra's net, wants to cross the sea of birth-and-death, wants to attain nirvāṇa, wants to be freed from all suffering, and wants to create a field of merit for all gods and humans in the world.",
        "source": "T15n0650_001:0754c26_3"
    },
    {
        "source_sentence": "應當勤修習如是之法。」",
        "translation": "You should diligently cultivate such a teaching.",
        "source": "T15n0650_001:0754c29_4"
    },
    {
        "source_sentence": "說是法時，三萬二千諸天得諸法實相，各以天曼陀羅華而散佛上，白言：「世尊！",
        "translation": "When he taught this teaching, thirty-two thousand gods attained the true characteristics of the teachings, each scattered heavenly maṇḍala flowers over the Buddha and said, Bhagavān!",
        "source": "T15n0650_001:0755a01_5"
    },
    {
        "source_sentence": "若人得聞如是之法，是人名為善出家者，何況信受讀誦如所說行？",
        "translation": "If someone hears such a teaching, they're called a good renunciant, so why wouldn't they believe it, accept it, read it, recite it, and practice according to what's taught?",
        "source": "T15n0650_001:0755a03_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755a04_7"
    },
    {
        "source_sentence": "若有須臾聞是法者，是則名為無增上慢。」",
        "translation": "If someone hears this teaching for a moment, then they're called having no overweening conceit.",
        "source": "T15n0650_001:0755a04_8"
    },
    {
        "source_sentence": "爾時文殊師利法王子白佛言：「惟願世尊！",
        "translation": "It was then that Mañjuśrī, the prince of the Dharma, said to the Buddha, May it please you, Bhagavān!",
        "source": "T15n0650_001:0755a06_0"
    },
    {
        "source_sentence": "當說陀羅尼，以是陀羅尼故，令諸菩薩得無礙辯才，於諸音聲無所怖畏，",
        "translation": "Because of these dhāraṇīs, the bodhisattvas will attain unhindered powers of elucidation and fearlessness in regard to all sounds.",
        "source": "T15n0650_001:0755a06_1"
    },
    {
        "source_sentence": "能令諸法皆作佛法，又信解諸法皆是一相。」",
        "translation": "They can cause all dharmas to become buddha-dharmas, and they believe that all dharmas are one characteristic.",
        "source": "T15n0650_001:0755a08_2"
    },
    {
        "source_sentence": "佛告文殊師利：「汝今諦聽！",
        "translation": "The Buddha told Mañjuśrī, Now listen closely!",
        "source": "T15n0650_001:0755a09_3"
    },
    {
        "source_sentence": "當為汝說不動種性法門。",
        "translation": "I will explain for you the dharma-gate of the immovable seed nature.",
        "source": "T15n0650_001:0755a10_4"
    },
    {
        "source_sentence": "諸菩薩得入是法門者，能以智慧光明照一切法，疾得無生法忍。」",
        "translation": "When bodhisattvas attain entry into this teaching, they can illuminate all dharmas with the light of wisdom and quickly attain the forbearance of the Dharma of nonproduction.",
        "source": "T15n0650_001:0755a10_5"
    },
    {
        "source_sentence": "文殊師利白佛言：「世尊！",
        "translation": "Mañjuśrī said to the Buddha, Bhagavān!",
        "source": "T15n0650_001:0755a12_6"
    },
    {
        "source_sentence": "云何名不動處種性法門？」",
        "translation": "What's called the dharma-gate of the seed nature of the immovable abode?",
        "source": "T15n0650_001:0755a12_7"
    },
    {
        "source_sentence": "佛告文殊師利：「一切眾生其心皆一，是名種性。」",
        "translation": "The Buddha told Mañjuśrī, All sentient beings have one mind, which is called the seed nature.",
        "source": "T15n0650_001:0755a13_8"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755a14_9"
    },
    {
        "source_sentence": "云何是事名為種性？」",
        "translation": "What are these things called seed natures?",
        "source": "T15n0650_001:0755a14_10"
    },
    {
        "source_sentence": "佛告文殊師利：「一切眾生皆無有心，緣性不可得故，是名種性。",
        "translation": "The Buddha told Mañjuśrī, All sentient beings lack mind because their conditioned nature is unobtainable, which is called the seed nature.",
        "source": "T15n0650_001:0755a15_11"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755a16_12"
    },
    {
        "source_sentence": "一切眾生皆同一量，是名種子。」",
        "translation": "All sentient beings are the same in number, which is called a seed.",
        "source": "T15n0650_001:0755a17_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755a17_1"
    },
    {
        "source_sentence": "云何是事名為種性？」",
        "translation": "What are these things called seed natures?",
        "source": "T15n0650_001:0755a17_2"
    },
    {
        "source_sentence": "佛言：「一切眾生皆如虛空量，終歸無障礙，是名種子。",
        "translation": "The Buddha said, All sentient beings are like the measure of space and ultimately return without obstruction, which is called seed.",
        "source": "T15n0650_001:0755a18_3"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755a19_4"
    },
    {
        "source_sentence": "一切眾生皆是一眾生，是名種子。」",
        "translation": "All sentient beings are all one sentient being, which is called a seed.",
        "source": "T15n0650_001:0755a19_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755a20_6"
    },
    {
        "source_sentence": "云何是事名為種性？」",
        "translation": "What are these things called seed natures?",
        "source": "T15n0650_001:0755a20_7"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755a21_8"
    },
    {
        "source_sentence": "一切眾生皆是一相，畢竟不生離諸名字，一異不可得故，是名種性。",
        "translation": "All sentient beings are all one characteristic, which ultimately doesn't arise apart from names, and because one difference is unobtainable, this is called the seed nature.",
        "source": "T15n0650_001:0755a21_9"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755a23_10"
    },
    {
        "source_sentence": "貪欲是不動相。」",
        "translation": "craving is the characteristic of immovability.",
        "source": "T15n0650_001:0755a23_11"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755a23_12"
    },
    {
        "source_sentence": "云何是事名不動相？」",
        "translation": "What are these things called the characteristic of immovability?",
        "source": "T15n0650_001:0755a23_13"
    },
    {
        "source_sentence": "佛言：「文殊師利！",
        "translation": "The Buddha said, Mañjuśrī!",
        "source": "T15n0650_001:0755a25_0"
    },
    {
        "source_sentence": "貪欲是不動相，安住法性中，以不住故，是貪欲不可得性常離故，是名不動相。",
        "translation": "The characteristic of immovability of attachment to sensual pleasure is called the characteristic of immovability because it abides in the dharma-nature. Because it does not abide, and because its ungraspable nature is always separated from it.",
        "source": "T15n0650_001:0755a25_1"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755a27_2"
    },
    {
        "source_sentence": "瞋恚是金剛。」",
        "translation": "anger is adamantine.",
        "source": "T15n0650_001:0755a27_3"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755a27_4"
    },
    {
        "source_sentence": "云何是事名為金剛？」",
        "translation": "What is the name of this thing as adamantine?",
        "source": "T15n0650_001:0755a27_5"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755a28_6"
    },
    {
        "source_sentence": "瞋恚不可斷不可壞，亦如金剛不可斷不可壞，一切法亦如是，不可斷不可壞，",
        "translation": "Anger cannot be cut off or broken, just as the diamond cannot be cut off or broken. So it is with all things: they cannot be cut off or broken.",
        "source": "T15n0650_001:0755a28_7"
    },
    {
        "source_sentence": "諸法本不決定故，是名如金剛。",
        "translation": "Because the dharmas are inherently indeterminate, they're called adamantine.",
        "source": "T15n0650_001:0755b01_8"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755b02_0"
    },
    {
        "source_sentence": "愚癡是智慧性。」",
        "translation": "Foolishness is the nature of wisdom.",
        "source": "T15n0650_001:0755b02_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755b02_2"
    },
    {
        "source_sentence": "云何是事名智慧性。」",
        "translation": "How is this thing called the nature of wisdom?",
        "source": "T15n0650_001:0755b02_3"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755b03_4"
    },
    {
        "source_sentence": "一切法離智慧亦離愚癡，譬如虛空無有智慧亦無愚癡，一切法亦如是，",
        "translation": "All things are free of wisdom and also free of delusion, just as space has no wisdom and no delusion, and all things are likewise.",
        "source": "T15n0650_001:0755b03_5"
    },
    {
        "source_sentence": "無有智慧亦無愚癡，智慧愚癡智可知法，從本已來俱寂滅故，是名愚癡智慧處。",
        "translation": "There's no wisdom, and there's no folly, and wisdom, folly, and knowledge can know dharmas because they've both ceased since the distant past, which is called the locus of folly and wisdom.",
        "source": "T15n0650_001:0755b05_6"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755b06_7"
    },
    {
        "source_sentence": "色陰是不動處。」",
        "translation": "The form aggregate is the immovable place.",
        "source": "T15n0650_001:0755b07_8"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755b07_9"
    },
    {
        "source_sentence": "云何是事名不動處？」",
        "translation": "How is this thing called the immovable state?",
        "source": "T15n0650_001:0755b07_10"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755b08_11"
    },
    {
        "source_sentence": "如天帝之幢深根安固不可動搖，一切法亦如是，以不住法故安住法性中，",
        "translation": "Just as the profound root of Indra’s banner is stable and unshakable, so are all things like this: because it does not abide in anything, it abides in the essence of reality.",
        "source": "T15n0650_001:0755b08_12"
    },
    {
        "source_sentence": "是法無來處無去處無取無捨，安住無住處故，是故色名不動相。",
        "translation": "Because these factors have no place of origin, no place of departure, no grasping and no equanimity: because they abide in peace without a place of abiding. That is why form is called ‘unshakable characteristic mark’.",
        "source": "T15n0650_001:0755b10_13"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755b11_14"
    },
    {
        "source_sentence": "受陰是滅性。」",
        "translation": "The acquired aggregate is the nature of cessation.",
        "source": "T15n0650_001:0755b11_15"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755b12_16"
    },
    {
        "source_sentence": "云何是事名為滅性？」",
        "translation": "How are these things called the nature of cessation?",
        "source": "T15n0650_001:0755b12_17"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755b12_18"
    },
    {
        "source_sentence": "一切諸受相性常寂滅故，諸受非內外，非東方非南西北方四維上下來。",
        "translation": "Because the characteristics of all feelings are always tranquil, feelings aren't internal or external, and they don't come from the four directions in the east or south or north or west.",
        "source": "T15n0650_001:0755b13_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0650_001:0755b14_20"
    },
    {
        "source_sentence": "若樂受在內，一切眾生常應受樂；",
        "translation": "If bliss were to abide within, all sentient beings would always experience bliss.",
        "source": "T15n0650_001:0755b15_0"
    },
    {
        "source_sentence": "若苦受在內，一切眾生常應受苦；",
        "translation": "If the feeling of suffering were internal, all sentient beings would always experience suffering.",
        "source": "T15n0650_001:0755b15_1"
    },
    {
        "source_sentence": "若不苦不樂受在內，一切眾生應受不苦不樂。",
        "translation": "If sensation that's neither painful nor pleasant were to be experienced inside, all sentient beings would experience neither painful nor pleasant.",
        "source": "T15n0650_001:0755b16_2"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755b18_0"
    },
    {
        "source_sentence": "今一切諸受實不在內不在外不在兩中間，不在東方南西北方四維上下，",
        "translation": "All these feelings are really neither internal, nor external, nor between the two; they do not abide in the east, south, west, north, or up and down of the four directions.",
        "source": "T15n0650_001:0755b18_1"
    },
    {
        "source_sentence": "是故一切諸受如草木瓦石，畢竟不生不滅無相，是故受名寂滅相。",
        "translation": "Therefore, all feelings are like grass, wood, tiles, and stones that ultimately don't arise or cease without marks; therefore, feeling is called the characteristic of quiescence.",
        "source": "T15n0650_001:0755b20_0"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755b21_1"
    },
    {
        "source_sentence": "想陰是種性。」",
        "translation": "The aggregate of perception is the seed nature.",
        "source": "T15n0650_001:0755b21_2"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755b22_3"
    },
    {
        "source_sentence": "云何是事名為種性？」",
        "translation": "What are these things called seed natures?",
        "source": "T15n0650_001:0755b22_4"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755b22_5"
    },
    {
        "source_sentence": "是想皆憶想分別起、從虛妄中生，如空拳如野馬，本性自離，是故想陰名種性。",
        "translation": "These conceptions all arise from the discrimination of recollection and conceptions, arising from delusion, like an empty fist or a wild horse, which are inherently free of themselves; therefore, the aggregate of conceptions is called seed nature.",
        "source": "T15n0650_001:0755b23_0"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755b24_1"
    },
    {
        "source_sentence": "行陰是種性。」",
        "translation": "The aggregate of volition is the seed nature.",
        "source": "T15n0650_001:0755b25_2"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755b25_3"
    },
    {
        "source_sentence": "云何是事名為種性？」",
        "translation": "What are these things called seed natures?",
        "source": "T15n0650_001:0755b25_4"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755b26_5"
    },
    {
        "source_sentence": "一切諸行離數無數入平等數，譬如芭蕉畢竟無實本性自爾，一切法亦如是，",
        "translation": "All conditioned forces are free from number and countless, entering into equanimity, like a plantain that ultimately has no real original nature of its own, and so are all dharmas.",
        "source": "T15n0650_001:0755b26_6"
    },
    {
        "source_sentence": "無名字無性故，是故行陰名為種性。",
        "translation": "Because there are no names and no natures, the aggregate of volition is therefore called seed nature.",
        "source": "T15n0650_001:0755b28_7"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755b29_8"
    },
    {
        "source_sentence": "識陰是種性。」",
        "translation": "The aggregate of consciousness is the seed nature.",
        "source": "T15n0650_001:0755b29_9"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755b29_10"
    },
    {
        "source_sentence": "云何是事名為種性？」",
        "translation": "What are these things called seed natures?",
        "source": "T15n0650_001:0755b29_11"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c01_12"
    },
    {
        "source_sentence": "是識如幻，無實無起無生，空無相無性，如五指塗空空無相現，是故識陰名為種性。",
        "translation": "This consciousness is like an illusion, which has no reality and no arising and no birth, emptiness has no characteristics and no nature, just as the five fingers coated with emptiness have no characteristics that appear, so the aggregate of consciousness is called seed nature.",
        "source": "T15n0650_001:0755c01_13"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c03_14"
    },
    {
        "source_sentence": "色是種性。」",
        "translation": "Form is the seed nature.",
        "source": "T15n0650_001:0755c03_15"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755c03_16"
    },
    {
        "source_sentence": "云何色為種性？」",
        "translation": "What is the seed nature of form?",
        "source": "T15n0650_001:0755c04_17"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c04_18"
    },
    {
        "source_sentence": "譬如鏡中像，雖可目見而無有實，一切色亦如是，雖見無實，但誑眼誑心虛妄不實，",
        "translation": "Good man, this is analogous to the case of an image in a mirror that can be seen by the eye but has no substance. The same applies to all forms: even though they may see something without substance, their gross eyes and gross awarenesses are false and not real.",
        "source": "T15n0650_001:0755c04_19"
    },
    {
        "source_sentence": "是故色名種性。",
        "translation": "That's why form is called seed nature.",
        "source": "T15n0650_001:0755c06_20"
    },
    {
        "source_sentence": "文殊師利，聲是種性。」",
        "translation": "Mañjuśrī, sound is the seed nature.",
        "source": "T15n0650_001:0755c07_0"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755c07_1"
    },
    {
        "source_sentence": "云何聲為種性？」",
        "translation": "What is the seed nature of sound?",
        "source": "T15n0650_001:0755c07_2"
    },
    {
        "source_sentence": "「文殊師利，一切法無別異相，畢竟空，如山中響，是故聲為種性。",
        "translation": "“O Mañjuśrī, all things have no distinctive characteristics, and ultimately emptiness is like a resonance in a mountain; therefore, sound is the seed nature.",
        "source": "T15n0650_001:0755c08_0"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c09_1"
    },
    {
        "source_sentence": "香是種性。」",
        "translation": "Fragrance is the seed nature.",
        "source": "T15n0650_001:0755c09_2"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755c09_3"
    },
    {
        "source_sentence": "云何香是種性？」",
        "translation": "What is the seed nature of fragrance?",
        "source": "T15n0650_001:0755c10_4"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c10_5"
    },
    {
        "source_sentence": "一切法無香相，性無知故，空如虛空，鼻香識者皆不可得，是故香為種性。",
        "translation": "All dharmas lack the characteristic of fragrance because their nature is unknown, and space is like space; neither nose, odor, taste, or consciousness are obtainable; therefore, smell is the seed nature.",
        "source": "T15n0650_001:0755c10_6"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c12_7"
    },
    {
        "source_sentence": "味是種性。」",
        "translation": "Taste is the seed nature.",
        "source": "T15n0650_001:0755c12_8"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755c12_9"
    },
    {
        "source_sentence": "云何味為種性？」",
        "translation": "What is the seed nature of taste?",
        "source": "T15n0650_001:0755c12_10"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c14_0"
    },
    {
        "source_sentence": "味性即是不可思議性，不可知、離於知故，自性常離故，是故味名種性。",
        "translation": "The nature of taste is that which is inconceivable because it cannot be known, because it is free from knowing and because its intrinsic nature is always free. That is why taste is called ‘seed-nature’.",
        "source": "T15n0650_001:0755c14_1"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c15_2"
    },
    {
        "source_sentence": "觸是種性。」",
        "translation": "touch is the seed nature.",
        "source": "T15n0650_001:0755c16_3"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755c16_4"
    },
    {
        "source_sentence": "云何觸為種性。」",
        "translation": "What's the seed nature of touch?",
        "source": "T15n0650_001:0755c16_5"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c16_6"
    },
    {
        "source_sentence": "觸如虛空，其性自離無觸無合，一切法亦如是，善壞身故，離於觸相，",
        "translation": "tangibles are like space. Their nature is inherently free from contact and non-contact or conjunction. So it is with all dharmas: because they skillfully disintegrate the body, being free from the characteristics of touch.",
        "source": "T15n0650_001:0755c17_7"
    },
    {
        "source_sentence": "觸者不可得故，是故觸是種性。",
        "translation": "Because contact is unobtainable, it's therefore the seed nature of touch.",
        "source": "T15n0650_001:0755c18_8"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c19_9"
    },
    {
        "source_sentence": "法是種性。」",
        "translation": "The Dharma is the seed nature.",
        "source": "T15n0650_001:0755c19_10"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755c19_11"
    },
    {
        "source_sentence": "云何法為種性？」",
        "translation": "What are the seed natures of dharmas?",
        "source": "T15n0650_001:0755c19_12"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c20_13"
    },
    {
        "source_sentence": "一切法無相無心，離心性、離名字，無決定故，皆是法性相，是故法是種性。",
        "translation": "All dharmas have no marks and no mind, because they are free of mind and free of names, and there's no certainty, and they are all the characteristics of the Dharma-nature, so dharmas are the seed nature.",
        "source": "T15n0650_001:0755c20_14"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c22_15"
    },
    {
        "source_sentence": "地是種性。」",
        "translation": "The earth is the seed nature.",
        "source": "T15n0650_001:0755c22_16"
    },
    {
        "source_sentence": "「世尊。",
        "translation": "“Bhagavān.",
        "source": "T15n0650_001:0755c22_17"
    },
    {
        "source_sentence": "云何地為種性？」",
        "translation": "What's the seed nature of the ground?",
        "source": "T15n0650_001:0755c22_18"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c23_19"
    },
    {
        "source_sentence": "一切法無堅相無軟相，虛妄和合人以為堅，是故地為種性。",
        "translation": "All dharmas lack the characteristic of firmness and the characteristic of weakness, and falsely combine people to make them firm; therefore, earth is the seed nature.",
        "source": "T15n0650_001:0755c23_20"
    },
    {
        "source_sentence": "文殊師利。",
        "translation": "Mañjuśrī.",
        "source": "T15n0650_001:0755c25_0"
    },
    {
        "source_sentence": "水是種性。」",
        "translation": "Water is the seed nature.",
        "source": "T15n0650_001:0755c25_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755c25_2"
    },
    {
        "source_sentence": "云何水為種性？」",
        "translation": "What is the seed nature of water?",
        "source": "T15n0650_001:0755c25_3"
    },
    {
        "source_sentence": "「文殊師利。",
        "translation": "Mañjuśrī.",
        "source": "T15n0650_001:0755c26_0"
    },
    {
        "source_sentence": "一切法無濕無合，如野馬無水，是故水為種性。",
        "translation": "All dharmas are without moisture and without conjunction, like wild horses that lack water, so water is the seed nature.",
        "source": "T15n0650_001:0755c26_1"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c27_2"
    },
    {
        "source_sentence": "火是種性。」",
        "translation": "Fire is the seed nature.",
        "source": "T15n0650_001:0755c27_3"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0755c27_4"
    },
    {
        "source_sentence": "云何火是種性？」",
        "translation": "How is fire the seed nature?",
        "source": "T15n0650_001:0755c27_5"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0755c28_6"
    },
    {
        "source_sentence": "一切法無熱，離虛妄熱相，本性寂滅，離顛倒故，分別其實無定無生，",
        "translation": "All things have no heat, are free of false hot characteristics, are inherently quiescent by nature, and because they are free of error, discrimination really has no concentration and no arising.",
        "source": "T15n0650_001:0755c28_7"
    },
    {
        "source_sentence": "是故火名種性。",
        "translation": "That's why fire is called seed nature.",
        "source": "T15n0650_001:0756a01_8"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a01_9"
    },
    {
        "source_sentence": "風是種性。」",
        "translation": "Wind is the seed nature.",
        "source": "T15n0650_001:0756a01_10"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0756a02_11"
    },
    {
        "source_sentence": "云何風為種性？」",
        "translation": "What is the seed nature of wind?",
        "source": "T15n0650_001:0756a02_12"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a02_13"
    },
    {
        "source_sentence": "一切法無障無礙、無相無性，不動搖故、離風相故，是故風名種性。",
        "translation": "All dharmas are without hindrances, without obstructions, and without marks or natures: because they are unshakable and free from the marks of wind. That is why wind is called ‘seed-nature’.",
        "source": "T15n0650_001:0756a02_14"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a04_15"
    },
    {
        "source_sentence": "佛是種性。」",
        "translation": "The Buddha is the seed nature.",
        "source": "T15n0650_001:0756a04_16"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0756a05_0"
    },
    {
        "source_sentence": "云何佛為種性？」",
        "translation": "What is the Buddha's seed nature?",
        "source": "T15n0650_001:0756a05_1"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a05_2"
    },
    {
        "source_sentence": "一切法無覺無知，離知相故，是故佛名種性。",
        "translation": "All dharmas lack perception and cognition, and because they're free of the characteristics of knowing, the Buddha is called a seed nature.",
        "source": "T15n0650_001:0756a05_3"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a06_4"
    },
    {
        "source_sentence": "法是種性。」",
        "translation": "The Dharma is the seed nature.",
        "source": "T15n0650_001:0756a07_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0756a07_6"
    },
    {
        "source_sentence": "云何法為種性？」",
        "translation": "What are the seed natures of dharmas?",
        "source": "T15n0650_001:0756a07_7"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a07_8"
    },
    {
        "source_sentence": "諸法不可壞不可斷，離壞斷故，無相無名無性，出言語道，是故法名種性。",
        "translation": "All dharmas are indestructible and indestructible, and because they are free from decay and cessation, have no characteristics, no names, and no nature, and leave the path of language; therefore, dharmas are called seed natures.",
        "source": "T15n0650_001:0756a08_9"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a10_0"
    },
    {
        "source_sentence": "僧是不動相。」",
        "translation": "The saṃgha is immovable in appearance.",
        "source": "T15n0650_001:0756a10_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0756a10_2"
    },
    {
        "source_sentence": "云何僧為不動相？」",
        "translation": "What is the immovable characteristic of the saṃgha?",
        "source": "T15n0650_001:0756a10_3"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a11_4"
    },
    {
        "source_sentence": "聖眾安住如、法性、實際、定亂平等中，安住智慧愚癡、解脫煩惱平等一切法中，",
        "translation": "The holy ones abide in the equality of suchness, reality, reality, and concentration; they abide in the equality of wisdom, folly, ignorance, liberation, and the equality of all dharmas.",
        "source": "T15n0650_001:0756a11_5"
    },
    {
        "source_sentence": "心無所住，住不可得故，是故僧名不動性。",
        "translation": "Because the mind has no abiding, and because abiding is unobtainable, the saṃgha is therefore called immovability.",
        "source": "T15n0650_001:0756a13_6"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a14_7"
    },
    {
        "source_sentence": "一切法行處名為不動。」",
        "translation": "The place where all the teachings are practiced is called immovable.",
        "source": "T15n0650_001:0756a14_8"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0756a15_0"
    },
    {
        "source_sentence": "云何是事名為不動相？」",
        "translation": "What are these things called the characteristic of immovability?",
        "source": "T15n0650_001:0756a15_1"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a15_2"
    },
    {
        "source_sentence": "一切虛空行處、不可思議行處、斷行處，無根本無別異，不可得故，是故一切法行處名不動相。",
        "translation": "The sphere of all spacelike formations, the sphere of inconceivable formations and the sphere of eliminating formations have no root and no distinctive differences: because they are ungraspable. That is why the sphere of all factors as forming a formation is called steadfast characteristic.",
        "source": "T15n0650_001:0756a15_3"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a18_4"
    },
    {
        "source_sentence": "一切法無緣名不動相。」",
        "translation": "All dharmas without conditions are called the characteristic of immovability.",
        "source": "T15n0650_001:0756a18_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0756a18_6"
    },
    {
        "source_sentence": "云何是事名不動相？」",
        "translation": "What are these things called the characteristic of immovability?",
        "source": "T15n0650_001:0756a19_7"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a19_8"
    },
    {
        "source_sentence": "一切法無依止、無住處、無緣無順，離諸緣故，是故一切法無緣名不動相。",
        "translation": "All dharmas lack support, lack a place of abiding, lack conditions, and lack conformity because they are free of conditions; therefore, all dharmas lack conditions are called the characteristic of immovability.",
        "source": "T15n0650_001:0756a19_9"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a21_10"
    },
    {
        "source_sentence": "一切法不取不捨相名不動相。」",
        "translation": "All things that don't grasp and don't abandon characteristics are called immovable characteristics.",
        "source": "T15n0650_001:0756a21_11"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0756a22_12"
    },
    {
        "source_sentence": "云何是事名不動相？」",
        "translation": "What are these things called the characteristic of immovability?",
        "source": "T15n0650_001:0756a22_13"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a23_0"
    },
    {
        "source_sentence": "一切法皆歸於如、同於法性，是法不可取、不可捨，無求無願諸願斷故，",
        "translation": "All things return to the thusness and are the same as the nature of things. These things cannot be grasped or abandoned, because they are cut off by wishing for non-desire and non-desire.",
        "source": "T15n0650_001:0756a23_1"
    },
    {
        "source_sentence": "從本已來常寂滅相同於虛空，是故不取不捨名不動相。",
        "translation": "Ever since the distant past, eternal quiescence has been the same as space; therefore, neither grasping nor rejecting is called immovable characteristic.",
        "source": "T15n0650_001:0756a24_2"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a26_3"
    },
    {
        "source_sentence": "一切法無咎名不動相。」",
        "translation": "All dharmas without blame are called the characteristic of immovability.",
        "source": "T15n0650_001:0756a26_4"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0756a26_5"
    },
    {
        "source_sentence": "云何是事名不動相？」",
        "translation": "What are these things called the characteristic of immovability?",
        "source": "T15n0650_001:0756a27_6"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a27_7"
    },
    {
        "source_sentence": "一切法無垢、無所有，清淨顯曜如虛空無翳，諸罪定相不可得故，是故一切法無咎名不動相。",
        "translation": "All dharmas are undefiled and nonexistent, purely manifested like space without anger, and the definite characteristics of sins are unobtainable; therefore, all dharmas lack blame and are called immovable characteristics.",
        "source": "T15n0650_001:0756a27_8"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756a29_9"
    },
    {
        "source_sentence": "一切法無歸處名不動相。」",
        "translation": "The place where all dharmas have no refuge is called the sign of immovability.",
        "source": "T15n0650_001:0756b01_10"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0756b01_11"
    },
    {
        "source_sentence": "云何是事名不動相？」",
        "translation": "What are these things called the characteristic of immovability?",
        "source": "T15n0650_001:0756b01_12"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756b02_13"
    },
    {
        "source_sentence": "一切法空無根本故無歸處，是故無歸處名不動相。",
        "translation": "Because all dharmas are empty and have no root, there's no place of refuge; therefore, the place of no refuge is called the characteristic of immovability.",
        "source": "T15n0650_001:0756b02_14"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756b03_15"
    },
    {
        "source_sentence": "一切法無學名不動相。」",
        "translation": "All dharmas that are post-learning are called the mark of immovability.",
        "source": "T15n0650_001:0756b03_16"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0650_001:0756b04_17"
    },
    {
        "source_sentence": "云何是事名不動相。」",
        "translation": "How are these things called the characteristic of immovability?",
        "source": "T15n0650_001:0756b04_18"
    },
    {
        "source_sentence": "「文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756b05_19"
    },
    {
        "source_sentence": "一切法性無學，不應學、不應修、不應思、不應念、不應住、不應發、不應行、不應斷、不應證、不應語、不應言、不應求、不應說、不應取、不應捨、不應離、不應除。",
        "translation": "The nature of all dharmas is post-learning, which shouldn't be studied, cultivated, contemplated, thought, remembered, abiding, arisen, practiced, stopped, realized, spoken, said, asked, explained, grasped, abandoned, separated, removed, and removed.",
        "source": "T15n0650_001:0756b05_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0650_001:0756b08_21"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T15n0650_001:0756b08_22"
    },
    {
        "source_sentence": "一切諸相畢竟離故，從本已來無所取，常是捨相，諸法非智慧所及，非愚癡所及，",
        "translation": "Because all characteristics are ultimately free, they have never grasped anything from the past. The characteristic of equanimity is always present. All things cannot be comprehended by wisdom or by delusion.",
        "source": "T15n0650_001:0756b09_23"
    },
    {
        "source_sentence": "是故無學名不動相。」",
        "translation": "Therefore, post-learning is called the mark of immovability.",
        "source": "T15n0650_001:0756b11_24"
    },
    {
        "source_sentence": "諸法無行經卷上",
        "translation": "Wuxing jing of all dharmas, vol. 1",
        "source": "T15n0650_001:0756b12_0"
    }
]