[
    {
        "source_sentence": "禪法要解卷下",
        "translation": "Second Fascicle of the Essential Understanding of the Chan Dharma, Volume II",
        "source": "T15n0616_002:0292c06_0"
    },
    {
        "source_sentence": "姚秦三藏鳩摩羅什等",
        "translation": "Yaoqin Tripiṭaka Kumārajīva and others",
        "source": "T15n0616_002:0292c08_0"
    },
    {
        "source_sentence": "於長安逍遙園譯",
        "translation": "translated at Chang'an's Free and Easy Park",
        "source": "T15n0616_002:0292c09_0"
    },
    {
        "source_sentence": "若行者欲求虛空定，當作是念：「色是種種眾苦具，如鞭杖割截殺害飢寒老病苦等，",
        "translation": "If a practitioner wants to pursue the concentration of space, he should think, Form is a variety of instruments of suffering, such as whipping, cutting, killing, hunger, cold, old age, illness, and pain.",
        "source": "T15n0616_002:0292c10_0"
    },
    {
        "source_sentence": "皆由色故。」",
        "translation": "It's all because of form.",
        "source": "T15n0616_002:0292c11_1"
    },
    {
        "source_sentence": "思惟如是則捨離色得虛空處。",
        "translation": "If he contemplates thus, then he'll abandon form and attain the space realm.",
        "source": "T15n0616_002:0292c12_2"
    },
    {
        "source_sentence": "問曰：行者今以色為身，云何便得捨離？",
        "translation": "Q: Now that practitioners have form as their body, how can they abandon it?",
        "source": "T15n0616_002:0292c12_3"
    },
    {
        "source_sentence": "答曰：諸煩惱是色因緣，又能繫色，是煩惱滅故則名離色。",
        "translation": "Answer: The afflictions are the causes and conditions for form, and they can also bind form, which is called formless because it's the cessation of afflictions.",
        "source": "T15n0616_002:0292c13_4"
    },
    {
        "source_sentence": "復次習行破色虛空觀法則得離色。",
        "translation": "Furthermore, if he cultivates the practice of refuting form and observing space as dharmas, then he'll attain freedom from form.",
        "source": "T15n0616_002:0292c15_5"
    },
    {
        "source_sentence": "復次如佛所說，比丘觀第四禪五陰，如病如癰如瘡如刺，無常苦空無我，",
        "translation": "Furthermore, just as the Buddha has said: “Furthermore, a monk observes the five aggregates of the fourth trance. They are like illnesses, abscesses, sores, abscesses, thorns, impermanence, suffering, emptiness, and non-self.",
        "source": "T15n0616_002:0292c15_6"
    },
    {
        "source_sentence": "如此等觀則離第四禪五陰，以餘陰隨色故但言離色。",
        "translation": "Such contemplation is then free from the five aggregates of the fourth trance. Because the other aggregates follow matter, they only speak of being free from matter.",
        "source": "T15n0616_002:0292c17_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0616_002:0292c18_8"
    },
    {
        "source_sentence": "色究竟盡故。",
        "translation": "It's because form is ultimately exhausted.",
        "source": "T15n0616_002:0292c19_9"
    },
    {
        "source_sentence": "復次行者觀色，分分破裂則無有色，如身有分，頭足肩臂等各各異分則無有身；",
        "translation": "“Furthermore, the practitioner observes matter: If atoms were to part and break apart, there would be no material form. Just as the body has parts; but if each part is different from the other, head, foot, shoulder, arm, etc., then there would be no body.",
        "source": "T15n0616_002:0292c19_10"
    },
    {
        "source_sentence": "如頭眼耳鼻舌口鬚髮骨肉等分分令異，則無有頭；",
        "translation": "Just as the hair, eyes, ears, nose, tongue, mouth, beard, bones, flesh, etc., are differentiated, so there is no hair.",
        "source": "T15n0616_002:0292c21_11"
    },
    {
        "source_sentence": "如眼者四大四塵身根眼根十事和合白黑等，肉團名為眼，各各分別則無有眼，",
        "translation": "Just as the eye is the combination of the four elements: the body faculty and the eye faculty; such [things] as whiteness, blackness, etc., are called ‘eye’ when they form a lump of flesh. When each one is differentiated there is no eye.",
        "source": "T15n0616_002:0292c22_12"
    },
    {
        "source_sentence": "地等諸分各亦如是。",
        "translation": "So it is with the parts of earth and so forth.",
        "source": "T15n0616_002:0292c24_13"
    },
    {
        "source_sentence": "問曰：眼根四大所造，不可定色，云何分別？",
        "translation": "Q: The eye faculty is created by the four elements, and form can't be determined; how can it be discriminated?",
        "source": "T15n0616_002:0292c24_14"
    },
    {
        "source_sentence": "答曰：四大及四大造淨色和合故名為眼，若除是色則無有眼。",
        "translation": "Answer: It's called the eye because the four elements and the four elements combine to create pure form, and if they remove form, then there's no eye.",
        "source": "T15n0616_002:0292c25_15"
    },
    {
        "source_sentence": "又此淨色雖不可見，以有對故有分，有分故無眼。",
        "translation": "Also, even though this pure form is invisible, it has parts because of being resistant; because of having parts, there is no eye.",
        "source": "T15n0616_002:0292c27_16"
    },
    {
        "source_sentence": "復次能見色者，是名為眼；",
        "translation": "Furthermore, the one who can see matter is what is called ‘eye’.",
        "source": "T15n0616_002:0292c28_17"
    },
    {
        "source_sentence": "若除四大及四大造色則無眼。",
        "translation": "If we remove the four elements and the form created by the four elements, then there's no eye.",
        "source": "T15n0616_002:0292c28_18"
    },
    {
        "source_sentence": "若無眼能見色者，耳亦應為眼。",
        "translation": "If there is no eye that sees visible matter, the organ of hearing should also be seen.",
        "source": "T15n0616_002:0292c29_19"
    },
    {
        "source_sentence": "若眼是色法，一切色法有處有分故，應可分別，若可分別則為多眼。",
        "translation": "If the eye is a factor of form, all factors of form have a place and a part. Therefore, they should be differentiated. If they can be differentiated, then many eyes are [also].",
        "source": "T15n0616_002:0293a01_20"
    },
    {
        "source_sentence": "若言四大所造眾微塵為眼者，不應一眼；",
        "translation": "If you say that the eye is made up of atoms created by the four elements, it should not be one eye.",
        "source": "T15n0616_002:0293a02_21"
    },
    {
        "source_sentence": "若都非眼亦無一眼。",
        "translation": "If it's not the eye, there's also no one eye.",
        "source": "T15n0616_002:0293a03_22"
    },
    {
        "source_sentence": "若言微塵為眼者，是亦不然。",
        "translation": "When stating that atoms form the eye, this is also not right.",
        "source": "T15n0616_002:0293a04_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0616_002:0293a04_24"
    },
    {
        "source_sentence": "若微塵有色則有十方，不名為微塵；",
        "translation": "If atoms had form, then there would be ten directions; but they are not called atoms.",
        "source": "T15n0616_002:0293a05_0"
    },
    {
        "source_sentence": "若非色者則不名為眼。",
        "translation": "If it's not form, then it's not called the eye.",
        "source": "T15n0616_002:0293a05_1"
    },
    {
        "source_sentence": "復次微塵體定有四分：色、香、味、觸，是眼非四事。",
        "translation": "Form, odor, taste, touch and tangibles are not the four things of the eye.",
        "source": "T15n0616_002:0293a06_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0616_002:0293a07_3"
    },
    {
        "source_sentence": "眼是內入攝，四為外入攝，以是故不得以諸微塵為眼。",
        "translation": "The eye is categorized as an internal sense-field. Four are categorized as an external sense-field. Because of this, tiny particles cannot be the eye.",
        "source": "T15n0616_002:0293a07_4"
    },
    {
        "source_sentence": "如佛說眾事和合見色假名為眼，無有定實；",
        "translation": "Just as the Buddha has said: “When seeing matter is combined with all things, it is conventionally called ‘eye’; but there is no fixed reality.",
        "source": "T15n0616_002:0293a08_5"
    },
    {
        "source_sentence": "耳鼻舌皮肉骨等亦如是破。",
        "translation": "The ears, nose, tongue, skin, flesh, bones, and so forth are likewise broken.",
        "source": "T15n0616_002:0293a09_6"
    },
    {
        "source_sentence": "是為破內身相。",
        "translation": "This is to refute the characteristic of the internal body.",
        "source": "T15n0616_002:0293a10_7"
    },
    {
        "source_sentence": "外色宮殿財物妻子等，亦皆如是分別破。",
        "translation": "The external form of the palace, possessions, wives, and so forth are all likewise discerned and destroyed.",
        "source": "T15n0616_002:0293a10_8"
    },
    {
        "source_sentence": "如佛告羅陀：「從今日當破散色、壞裂色，令無有色。」",
        "translation": "As the Buddha told Rāṣṭrapāla, From today, he'll break down form and disintegrate form so that there won't be form.",
        "source": "T15n0616_002:0293a11_9"
    },
    {
        "source_sentence": "能如是分別，是名離色。",
        "translation": "Being able to discriminate in this way is called being free of form.",
        "source": "T15n0616_002:0293a12_10"
    },
    {
        "source_sentence": "復次如佛說，若比丘欲離色，度一切色相，滅一切對相，不念一切異相，",
        "translation": "“Furthermore, just as the Buddha has said: If a monk desires to be free from form, he transcends all marks of form, annihilates all constraints, and is not mindful of any dissimilarity.",
        "source": "T15n0616_002:0293a13_11"
    },
    {
        "source_sentence": "入無量虛空處。",
        "translation": "He enters the sphere of infinite space.",
        "source": "T15n0616_002:0293a15_12"
    },
    {
        "source_sentence": "度一切色相者，是可見色；",
        "translation": "To liberate all forms and characteristics is visible form.",
        "source": "T15n0616_002:0293a15_13"
    },
    {
        "source_sentence": "滅一切對相者，是有對不可見色；",
        "translation": "Cessation of all resisting characteristic marks is resisting, invisible matter.",
        "source": "T15n0616_002:0293a16_0"
    },
    {
        "source_sentence": "不念一切異相者，不可見無對色。",
        "translation": "Those who aren't mindful of all different characteristics don't see form without opposites.",
        "source": "T15n0616_002:0293a16_1"
    },
    {
        "source_sentence": "復次度一切色相者，青黃赤白紅紫等種種色相；",
        "translation": "“Furthermore, to liberate all forms and characteristics”: Such various forms and characteristics as blue, yellow, red, white, red, and purple.",
        "source": "T15n0616_002:0293a17_2"
    },
    {
        "source_sentence": "滅有對者，聲香味觸等；",
        "translation": "“ Cessation has opposites”: Sound, odor, taste and tangible things.",
        "source": "T15n0616_002:0293a18_3"
    },
    {
        "source_sentence": "不念一切異相者，大小長短方圓遠近等。",
        "translation": "Those who aren't mindful of all different characteristics are large and small, long and short, square and round, distant and near.",
        "source": "T15n0616_002:0293a19_4"
    },
    {
        "source_sentence": "如是離一切色相，得入虛空處。",
        "translation": "Thus, apart from all form and characteristics, they can enter the space realm.",
        "source": "T15n0616_002:0293a20_5"
    },
    {
        "source_sentence": "復次行者繫心身內虛空，所謂口鼻咽喉、眼耳胸腹等，既知色為眾惱，",
        "translation": "Furthermore, the practitioner binds space within his mind and body, which is called mouth, nose, throat, eyes, ears, chest, abdomen, and so forth. Since he knows that form is all vexation,",
        "source": "T15n0616_002:0293a20_6"
    },
    {
        "source_sentence": "空為無患，是故心樂虛空，若心在色攝令在空，心轉柔軟，令身中虛空漸漸廣大，",
        "translation": "Because emptiness is the absence of affliction, the mind delights in space. When the mind is concentrated on matter, it makes space abide; when it is concentrated on form, its mind becomes more and more flexible, causing space to gradually grow larger and larger within itself.",
        "source": "T15n0616_002:0293a22_7"
    },
    {
        "source_sentence": "自見色身如藕根孔，習之轉利，見身盡空無復有色。",
        "translation": "He sees for himself that his form body is like the root of a lotus root and grows accustomed to it, and he sees that his body is completely empty and no longer has form.",
        "source": "T15n0616_002:0293a24_8"
    },
    {
        "source_sentence": "外色亦爾。",
        "translation": "So it is with external form.",
        "source": "T15n0616_002:0293a25_9"
    },
    {
        "source_sentence": "內外虛空同為一空，是時心緣虛空無量無邊，便離色想安隱快樂，如鳥在瓶瓶破得出，",
        "translation": "Space inside and space outside are the same as one space. At that moment mind takes space as an object of perception, because space is infinite and boundless. Then it becomes detached from all ideations of form and feels peaceful and blissful like a bird in a pot or vial which breaks open and emerges.",
        "source": "T15n0616_002:0293a25_10"
    },
    {
        "source_sentence": "翱翔虛空無所觸礙，是名初無色定。",
        "translation": "To soar through space without touching anything is called the first formless concentration.",
        "source": "T15n0616_002:0293a27_11"
    },
    {
        "source_sentence": "行者如虛空中受想行識，如病如癰如瘡如刺，無常苦空無我，更求妙定則離空緣。",
        "translation": "Practice is like feelings, perceptions, volitions, and consciousnesses in space, like illnesses, abscesses, sores, and thorns, impermanent, painful, empty, and selfless, and when they further seek marvelous concentration, they're free of the conditions of emptiness.",
        "source": "T15n0616_002:0293a28_12"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0616_002:0293b01_13"
    },
    {
        "source_sentence": "知是心所想虛空欺誑虛妄，先無今有已有還無。",
        "translation": "Knowing that this mental perception of space is deceptive and false, it was previously nonexistent but now exists and returns to nonexistence.",
        "source": "T15n0616_002:0293b01_14"
    },
    {
        "source_sentence": "既知其患，是虛空從識而有，謂識為真。",
        "translation": "Since they know that their trouble is that space exists from consciousness, it's called consciousness as reality.",
        "source": "T15n0616_002:0293b02_15"
    },
    {
        "source_sentence": "但觀於識捨於空緣，習於識觀時，漸見識相相續而生，如流水燈焰，未來現在過去識，",
        "translation": "They simply observe that consciousness abandons the supporting object of emptiness. When they are accustomed to contemplation of conscious construction, they gradually perceive a series of conscious constructs as coming into being, like the flame of a running water lamp: future, present, and past conscious constructs.",
        "source": "T15n0616_002:0293b03_16"
    },
    {
        "source_sentence": "識相續無邊無量。",
        "translation": "The continuity of consciousness has no limit and no limit.",
        "source": "T15n0616_002:0293b05_17"
    },
    {
        "source_sentence": "問曰：何以故佛說識處無邊無量？",
        "translation": "Q: Why does the Buddha say that the locus of consciousness is limitless and immeasurable?",
        "source": "T15n0616_002:0293b06_0"
    },
    {
        "source_sentence": "答曰：識能遠緣故無邊，無邊法緣故無邊。",
        "translation": "Answer: Consciousness has no limit because it's able to distance itself from cognition, and it has no limit because it's the condition of dharmas that have no limit.",
        "source": "T15n0616_002:0293b06_1"
    },
    {
        "source_sentence": "復次先緣虛空無邊，若破無邊虛空，識應無邊，行者心柔軟故能令識大乃至無邊，",
        "translation": "Furthermore, if one were to destroy infinite space, consciousness would be infinite. Because the conditioned mind is flexible, it can make consciousness large and infinite.",
        "source": "T15n0616_002:0293b07_2"
    },
    {
        "source_sentence": "是名無邊識處。",
        "translation": "This is called the sphere of limitless consciousness.",
        "source": "T15n0616_002:0293b09_3"
    },
    {
        "source_sentence": "問曰：是識處具有四陰，何以故但說識處？",
        "translation": "Q: The locus of consciousness has four aggregates, so why is it only called the locus of consciousness?",
        "source": "T15n0616_002:0293b09_4"
    },
    {
        "source_sentence": "答曰：一切內法識為其主，諸心數法皆隨屬識，若說識者則說餘事。",
        "translation": "Answer: All internal dharmas and consciousnesses are their masters, and all mental factors are subordinate to consciousness; if they say consciousness, then they're talking about other things.",
        "source": "T15n0616_002:0293b10_5"
    },
    {
        "source_sentence": "復次欲界中色陰為主，色界中受陰為主，虛空處、識處識陰為主，無所有處想陰為主，",
        "translation": "“Furthermore, in the realm of sexual passion, form aggregate is dominant; in the realm of form, feeling aggregate is dominant; in the space and in the consciousness aggregate, consciousness aggregate is dominant; in the sphere of nothingness, conceptual identification aggregate is dominant.",
        "source": "T15n0616_002:0293b12_6"
    },
    {
        "source_sentence": "非想非非想處行陰為主。",
        "translation": "The aggregate of neither perception nor non-perception and the aggregate of volition are the main focus.",
        "source": "T15n0616_002:0293b14_7"
    },
    {
        "source_sentence": "復次三法：身、心、心數法。",
        "translation": "Furthermore, there are three dharmas: body, mind and mental factors.",
        "source": "T15n0616_002:0293b15_8"
    },
    {
        "source_sentence": "欲界、色界以身為主，心隨身故，若無身已心力獨用。",
        "translation": "In the realm of sexual passion and in the one of form, the body is the main one: because awarenesses abide in the body. When there is no body, awarenesses and powers of awareness are used alone.",
        "source": "T15n0616_002:0293b15_9"
    },
    {
        "source_sentence": "心有二分：一分緣空、一分自緣，是故應有二處：空處、識處。",
        "translation": "The mind has two parts: a part that takes emptiness as supporting object and a part that takes itself as supporting object. Therefore, there should be two places: the sphere of unlimited space and the sphere of unlimited consciousness.",
        "source": "T15n0616_002:0293b16_10"
    },
    {
        "source_sentence": "但初破色故虛空受名，破虛空故獨識為名。",
        "translation": "However, the first one refutes form and therefore receives the name space. Because it refutes space, consciousness alone is its name.",
        "source": "T15n0616_002:0293b18_11"
    },
    {
        "source_sentence": "心數法亦有二分：一分想、一分行，是故亦應有二處：想無所有處、行非想非非想處。",
        "translation": "Also the factors arising with awarenesses are twofold: partial conceptual identification and partial aspects. That is why there should also be two places: conceptual identification as having no existence and formation as neither-thought-nor-non-thought.",
        "source": "T15n0616_002:0293b19_12"
    },
    {
        "source_sentence": "復次緣識故得離虛空處，以是故雖有餘陰，但識受名。",
        "translation": "Furthermore, it is because of the supporting object of consciousness that they can be freed from the realm of space. Because of this, even though there are other aggregates, only consciousness receives names.",
        "source": "T15n0616_002:0293b21_0"
    },
    {
        "source_sentence": "行者得識處已，更求妙定，觀識為患，如上說。",
        "translation": "After attaining the consciousness realm, practitioners further seek marvelous concentration and observe that consciousness is a danger as explained above.",
        "source": "T15n0616_002:0293b23_0"
    },
    {
        "source_sentence": "復次觀識如幻虛誑屬諸因緣而不自在，有緣則生、無緣則滅，識不住情亦不住緣亦不住中間，",
        "translation": "Furthermore, he observes that consciousnesses are like illusions and falsehoods that belong to causes and conditions but aren't self-contained, that they arise with conditions and cease without conditions, and that consciousness doesn't abide in feelings, doesn't abide in conditions, and doesn't abide in the middle.",
        "source": "T15n0616_002:0293b24_0"
    },
    {
        "source_sentence": "非有住處非無住處，識相如是。",
        "translation": "The characteristic marks of consciousness are neither with an abode nor without an abode:",
        "source": "T15n0616_002:0293b26_1"
    },
    {
        "source_sentence": "世尊說言：「識如幻也。」",
        "translation": "The Bhagavān said, Consciousness is illusory.",
        "source": "T15n0616_002:0293b26_2"
    },
    {
        "source_sentence": "行者如是思惟已，得離識處。",
        "translation": "After thus contemplating it, the practitioner attains freedom from the consciousness realm.",
        "source": "T15n0616_002:0293b27_3"
    },
    {
        "source_sentence": "復次行者作是念，如五欲虛誑，色亦如是；",
        "translation": "“Furthermore, practitioners have this thought: Just as the five desires are sexual misconduct, so is material form.",
        "source": "T15n0616_002:0293b27_4"
    },
    {
        "source_sentence": "如色虛誑，虛空亦爾；",
        "translation": "Just as form is false and space is false, so is space.",
        "source": "T15n0616_002:0293b28_5"
    },
    {
        "source_sentence": "虛空虛誑，識相亦爾。",
        "translation": "Space is void, and so are the characteristics of consciousness.",
        "source": "T15n0616_002:0293b29_6"
    },
    {
        "source_sentence": "是皆虛誑，而眾生惑著即謂諸法，空無所有是安隱處，作是念已即入無所有處。",
        "translation": "These are all false, but the afflictive attachments of sentient beings are called dharmas, and emptiness without existence is a peaceful place, and after they think this, they enter the sphere of nothingness.",
        "source": "T15n0616_002:0293b29_7"
    },
    {
        "source_sentence": "問曰：虛空處、無所有處，有何差別？",
        "translation": "Q: What's the difference between the space realm and the nonexistent realm?",
        "source": "T15n0616_002:0293c02_8"
    },
    {
        "source_sentence": "答曰：前者心想虛空為緣，此中心想無所有為緣，是為差別。",
        "translation": "Answer: The prior one's mind perceives space as the condition, and this center perceives nothingness as the condition, which is a distinction.",
        "source": "T15n0616_002:0293c03_9"
    },
    {
        "source_sentence": "行者入無所有處已，利根者覺是中猶有受想行識厭患，如先說；",
        "translation": "The practitioner has already entered the sphere of nothingness. Those with keen faculties feel that in this stage there are still the discomforts of feeling, conceptual identification, volition, and consciousness as mentioned previously.",
        "source": "T15n0616_002:0293c04_10"
    },
    {
        "source_sentence": "鈍根者則不能覺。",
        "translation": "Those with dull faculties can't perceive it.",
        "source": "T15n0616_002:0293c06_11"
    },
    {
        "source_sentence": "復次離無所有處因緣有三見：有見、無見、非有見非無見。",
        "translation": "Furthermore, there are three views that are free from the causes and conditions of the sphere of nothingness: views with view, views without view, and views neither with view nor without view.",
        "source": "T15n0616_002:0293c06_12"
    },
    {
        "source_sentence": "有見，從欲界乃至識處；",
        "translation": "There is vision: from the realm of sexual passion up to the sphere of unlimited consciousness.",
        "source": "T15n0616_002:0293c07_13"
    },
    {
        "source_sentence": "無見，即是無所有處；",
        "translation": "The absence of views is the sphere of nothingness.",
        "source": "T15n0616_002:0293c08_14"
    },
    {
        "source_sentence": "非有非無見，非想非非想處。",
        "translation": "Neither existent nor nonexistent views, neither perception nor non-perception as abode.",
        "source": "T15n0616_002:0293c08_15"
    },
    {
        "source_sentence": "是無見應當捨離。",
        "translation": "This is the absence of views that should be abandoned.",
        "source": "T15n0616_002:0293c09_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0616_002:0293c10_0"
    },
    {
        "source_sentence": "非想非非想雖細尚應捨離，何況無所有處，作是念已離無所有處。",
        "translation": "Even though neither perception nor non-perception are subtle, they should still be abandoned, so why wouldn't they abandon the sphere of nothingness after making this thought?",
        "source": "T15n0616_002:0293c10_1"
    },
    {
        "source_sentence": "問曰：如佛法中亦有空無所有，若是為實，云何言邪見應當捨離？",
        "translation": "Q: Just as there's emptiness and nothing in the Buddha's teaching, if it were real, how would you say that wrong views should be abandoned?",
        "source": "T15n0616_002:0293c11_2"
    },
    {
        "source_sentence": "答曰：佛法中為用破著故，說不以為實；",
        "translation": "Answer: In Buddhist doctrine, it is said not to be real because of its function in destroying attachment.",
        "source": "T15n0616_002:0293c13_3"
    },
    {
        "source_sentence": "無所有處謂為是實，邪見愛著故。",
        "translation": "The sphere of nothingness is said to be real because it is attached to wrong views and desires.",
        "source": "T15n0616_002:0293c14_4"
    },
    {
        "source_sentence": "是中眾生受定果報已，隨業因緣復受諸報，以是故應捨。",
        "translation": "In this way, beings who have already experienced the retribution of absorption experience the retribution again according to the causes and conditions of action. Because of this, they should abandon it.",
        "source": "T15n0616_002:0293c14_5"
    },
    {
        "source_sentence": "名雖相似，其實各異。",
        "translation": "Although their names are similar, they are actually different.",
        "source": "T15n0616_002:0293c16_6"
    },
    {
        "source_sentence": "復次行者作是念：「一切想地皆麁可患，如病如癰如瘡如箭，無想地則是癡處，",
        "translation": "Furthermore, the practitioner thinks, All the stages of perception are crude and painful, like illnesses, abscesses, sores, and arrows, and the stage without perception is a place of delusion.",
        "source": "T15n0616_002:0293c16_7"
    },
    {
        "source_sentence": "今寂滅微妙第一處，所謂非想非無想處。」",
        "translation": "Now, the subtle first abode of extinction is called the abode of neither perception nor non-perception.",
        "source": "T15n0616_002:0293c18_8"
    },
    {
        "source_sentence": "如是觀已，則離無所有處想地，即入非有想非無想處。",
        "translation": "After observing it this way, they're free of the mind ground of the sphere of nothingness and enter the state of neither perception nor non-perception. That's when they enter the sphere of neither perception nor non-perception.",
        "source": "T15n0616_002:0293c19_9"
    },
    {
        "source_sentence": "問曰：是中為有想為無想？",
        "translation": "Q: Is this consciousness with or without consciousness?",
        "source": "T15n0616_002:0293c20_10"
    },
    {
        "source_sentence": "答曰：是中有想。",
        "translation": "Answer: Yes, there are conceptions in existence.",
        "source": "T15n0616_002:0293c21_11"
    },
    {
        "source_sentence": "問曰：若有想者，何以但下七地名為想定耶？",
        "translation": "Q: If there's perception, why is it called concentration only the next seven stages?",
        "source": "T15n0616_002:0293c21_12"
    },
    {
        "source_sentence": "答曰：此地中想微細不利，想用不了故不名為想。",
        "translation": "Answer: In this place, conceptions are subtle and not beneficial, and because they don't understand the function of conceptions, they aren't called conceptions.",
        "source": "T15n0616_002:0293c22_13"
    },
    {
        "source_sentence": "行者心謂是處非有想非無想，是故佛隨其本名，說是名非有想非無想處。",
        "translation": "The practitioner's mind means that this is the place where neither perception nor non-perception occurs. That's why the Buddha follows its original name and says it's called the sphere of neither perception nor non-perception.",
        "source": "T15n0616_002:0293c23_14"
    },
    {
        "source_sentence": "鈍根者不覺是中有四陰，便謂涅槃安隱之處，生增上慢，壽八萬劫已還墮諸趣。",
        "translation": "Those with dull faculties who don't perceive these four aggregates in the intermediate state will then say that nirvāṇa is a peaceful place, give rise to increased pride, and return to the destinies after 80,000 eons of life.",
        "source": "T15n0616_002:0293c25_15"
    },
    {
        "source_sentence": "是中四陰雖微深妙，利根者則能覺知，覺知已患厭作是念：「此亦和合作法，",
        "translation": "Although these four aggregates are subtle and profound, they can be perceived by those with sharp faculties who have sharp faculties. Having perceived them, they become disillusioned and think:",
        "source": "T15n0616_002:0293c27_16"
    },
    {
        "source_sentence": "因緣生法虛誑不實，如病如癰如瘡如箭，無常苦空無我，亦是後生因緣，",
        "translation": "The dharmas that arise from causes and conditions are false, deceptive, and insubstantial, like illnesses, abscesses, sores, and arrows, impermanent, painful, empty, and selfless. They are also the causes and conditions for subsequently-arisen [dharmas].",
        "source": "T15n0616_002:0293c29_0"
    },
    {
        "source_sentence": "應當捨離，以其患故當學四諦。」",
        "translation": "You should abandon it, and because of its dangers, you should train in the four noble truths.",
        "source": "T15n0616_002:0294a01_1"
    },
    {
        "source_sentence": "問曰：捨餘地時，何以不言學四諦？",
        "translation": "Q: When you abandon other stages, why don't you say you're training in the four noble truths?",
        "source": "T15n0616_002:0294a02_2"
    },
    {
        "source_sentence": "答曰：前以說如病如癰如瘡如箭，無常苦空無我，便為略說四諦，但未廣說。",
        "translation": "Answer: Earlier, it was said that illnesses are like abscesses, sores, and arrows, impermanent, painful, empty, and selfless, so they briefly explained the four noble truths but didn't explain them in detail.",
        "source": "T15n0616_002:0294a03_3"
    },
    {
        "source_sentence": "復次餘地無遮無難，凡夫有漏道亦能過故。",
        "translation": "Furthermore, the other stages are without obstruction and without difficulty: because worldlings with impure paths can also go beyond them.",
        "source": "T15n0616_002:0294a04_4"
    },
    {
        "source_sentence": "而此世間之頂，唯有聖人學無漏道乃能得過。",
        "translation": "At the top of this world, however, only a sage who trains in the uncontaminated path can attain it.",
        "source": "T15n0616_002:0294a05_5"
    },
    {
        "source_sentence": "譬如繩繫鳥脚，初雖得去繩盡攝還。",
        "translation": "It's like a rope tied at the feet of a bird that first attains freedom from the rope and then returns with its end.",
        "source": "T15n0616_002:0294a06_6"
    },
    {
        "source_sentence": "凡夫人亦如是，雖過餘地，魔王不以為驚；",
        "translation": "Ordinary people are also like this. Even if they go to another place, the king of Māra will not be surprised.",
        "source": "T15n0616_002:0294a07_7"
    },
    {
        "source_sentence": "若過有頂之地，魔王大驚如繩斷鳥去。",
        "translation": "If he goes beyond the ground with a top, the king of Māra is greatly startled like a bird cutting its rope and going away.",
        "source": "T15n0616_002:0294a08_8"
    },
    {
        "source_sentence": "以是故，離餘地時不說四諦。",
        "translation": "Because of this, the four noble truths are not spoken of when being free from other stages.",
        "source": "T15n0616_002:0294a09_9"
    },
    {
        "source_sentence": "有頂地是三界之要門，欲出要門當學四諦。",
        "translation": "The summit of existence is the essential aspect of the three realms, and those who want to leave the essential aspect should train in the four noble truths.",
        "source": "T15n0616_002:0294a10_10"
    },
    {
        "source_sentence": "問曰：云何為四諦？",
        "translation": "Q: What are the four noble truths?",
        "source": "T15n0616_002:0294a11_11"
    },
    {
        "source_sentence": "答曰：苦諦、集諦、滅諦、道諦。",
        "translation": "Answer: The truth of suffering, the truth of accumulation, the truth of cessation, and the truth of the path.",
        "source": "T15n0616_002:0294a11_12"
    },
    {
        "source_sentence": "苦有二種：一者身苦，二者心苦。",
        "translation": "There are two kinds of suffering: first, physical suffering and second, mental suffering.",
        "source": "T15n0616_002:0294a12_13"
    },
    {
        "source_sentence": "集亦二種：一者使，二者惱纏。",
        "translation": "There are also two kinds of accumulation: first, the afflictive tendencies and second, the afflictive tendencies.",
        "source": "T15n0616_002:0294a12_14"
    },
    {
        "source_sentence": "滅亦二種：一者有餘涅槃，二者無餘涅槃。",
        "translation": "There are also two kinds of cessation: one, nirvāṇa with remainder and two, nirvāṇa without remainder.",
        "source": "T15n0616_002:0294a13_15"
    },
    {
        "source_sentence": "道亦二種：一者定，二者慧。",
        "translation": "The path is also twofold: the first is meditative absorption; the second is wisdom.",
        "source": "T15n0616_002:0294a14_16"
    },
    {
        "source_sentence": "復次苦諦有二種：一者苦諦，二者苦聖諦。",
        "translation": "Furthermore, there are two kinds of the truth of suffering: first, the truth of suffering; second, the noble truth of suffering.",
        "source": "T15n0616_002:0294a15_17"
    },
    {
        "source_sentence": "苦諦者惱相故，所謂五受陰名為苦諦。",
        "translation": "The truth of suffering is called the truth of suffering because it has the characteristic of torment. The so-called five acquired aggregates are called the truth of suffering.",
        "source": "T15n0616_002:0294a16_18"
    },
    {
        "source_sentence": "苦聖諦者，以知見故修道，是名苦聖諦。",
        "translation": "The noble truth of suffering is that it's cultivated because of knowing and seeing, which is called the noble truth of suffering.",
        "source": "T15n0616_002:0294a16_19"
    },
    {
        "source_sentence": "集諦有二種。",
        "translation": "There are two kinds of the truth of accumulation.",
        "source": "T15n0616_002:0294a17_20"
    },
    {
        "source_sentence": "一者集諦，二者集聖諦。",
        "translation": "One is the truth of accumulation, and two are the noble truths of accumulation.",
        "source": "T15n0616_002:0294a18_21"
    },
    {
        "source_sentence": "集諦者出生相，所謂愛等諦煩惱名為集諦。",
        "translation": "The truth of accumulation is the characteristic of arising. The so-called defilement such as such [things] as craving are said to be the truth of accumulation.",
        "source": "T15n0616_002:0294a18_22"
    },
    {
        "source_sentence": "集聖諦者，以斷故修道，是為集聖諦。",
        "translation": "The noble truth of accumulation is the noble truth of accumulation because it's cultivated because it's stopped.",
        "source": "T15n0616_002:0294a19_23"
    },
    {
        "source_sentence": "滅諦有二種：一者滅諦，二者滅聖諦。",
        "translation": "The truth of cessation has two kinds: the first is the truth of cessation, and the second is the noble truth of cessation.",
        "source": "T15n0616_002:0294a20_24"
    },
    {
        "source_sentence": "滅諦者寂滅相，所謂四沙門果，是名滅諦。",
        "translation": "The truth of cessation is the characteristic of extinction, which is called the fruit of the four ascetics. This is called the truth of cessation.",
        "source": "T15n0616_002:0294a21_25"
    },
    {
        "source_sentence": "滅聖諦者，以證故行道，是為滅聖諦。",
        "translation": "The noble truth of cessation is the path of practice because it's realized, which is the noble truth of cessation.",
        "source": "T15n0616_002:0294a22_26"
    },
    {
        "source_sentence": "道諦有二種：一者道諦，二者道聖諦。",
        "translation": "The truth of the path has two kinds: first, the truth of the path; second, the noble truth of the path.",
        "source": "T15n0616_002:0294a23_27"
    },
    {
        "source_sentence": "道諦者出到相，所謂八正道，是名為道諦。",
        "translation": "The so-called eightfold noble path is called the truth of the path.",
        "source": "T15n0616_002:0294a23_28"
    },
    {
        "source_sentence": "道聖諦者，以修故行道，是為道聖諦。",
        "translation": "The noble truth of the path is that cultivating the path because it's cultivated is the noble truth of the path.",
        "source": "T15n0616_002:0294a24_29"
    },
    {
        "source_sentence": "復次諦有二種：總相、別相。",
        "translation": "Furthermore, there are two kinds of truths: general characteristic marks and specific characteristic marks.",
        "source": "T15n0616_002:0294a25_30"
    },
    {
        "source_sentence": "總相苦者，五受陰；",
        "translation": "Suffering in general characteristics is the five acquired aggregates.",
        "source": "T15n0616_002:0294a26_31"
    },
    {
        "source_sentence": "別相苦者，廣分別色陰受想行識陰。",
        "translation": "Suffering in specific characteristics refers to the extensive differentiation of form aggregate, feeling aggregate, perception aggregate, volition aggregate, and consciousness aggregate.",
        "source": "T15n0616_002:0294a26_32"
    },
    {
        "source_sentence": "總相集者，能生後身受；",
        "translation": "The general characteristic of accumulation is that which enables subsequent bodily feelings to arise.",
        "source": "T15n0616_002:0294a27_33"
    },
    {
        "source_sentence": "別相集者，廣分別愛等諸煩惱及有漏業五受陰因緣。",
        "translation": "The specific characteristic accumulation is the extensive differentiation of such defilements as craving, and the causes and conditions for the five acquired aggregates of impure action.",
        "source": "T15n0616_002:0294a28_34"
    },
    {
        "source_sentence": "總相滅者，能生後身愛盡；",
        "translation": "Cessation of the general characteristic is able to produce the destruction of craving for a later body.",
        "source": "T15n0616_002:0294a29_35"
    },
    {
        "source_sentence": "別相滅者，廣分別八十九種盡。",
        "translation": "Cessation with specific characteristic marks is extensively differentiated as eighty-nine kinds of cessation.",
        "source": "T15n0616_002:0294a29_36"
    },
    {
        "source_sentence": "總相道者，八聖道；",
        "translation": "The path of general characteristics is the eightfold noble path.",
        "source": "T15n0616_002:0294b01_37"
    },
    {
        "source_sentence": "別相道者，廣分別從苦法忍乃至無學道。",
        "translation": "The path with specific characteristic marks is the wide differentiation from patience regarding the law in relation to frustration up to the path of the adept.",
        "source": "T15n0616_002:0294b02_38"
    },
    {
        "source_sentence": "若不通達四諦者，則輪轉五道，往來生死無休息時。",
        "translation": "If someone doesn't understand the four truths, then they'll transmigrate in the five destinies, going back and forth through birth and death without a resting time.",
        "source": "T15n0616_002:0294b03_39"
    },
    {
        "source_sentence": "以是因緣故，行者應念老病死等一切苦惱皆由有身，譬如一切草木皆從地出。",
        "translation": "Because of these causes and conditions, practitioners should be mindful that all the pains and sufferings of old age, illness, death, and so forth all come from having a body, like all grass and trees coming out of the earth.",
        "source": "T15n0616_002:0294b04_40"
    },
    {
        "source_sentence": "如經中說，十方眾生所以有身，皆為受苦故生。",
        "translation": "As the sūtras say, The reason sentient beings in the ten directions have bodies is that they all arise because they experience suffering.",
        "source": "T15n0616_002:0294b06_41"
    },
    {
        "source_sentence": "譬如毒食，若好若醜皆為殺人；",
        "translation": "It is like the case of a poisonous food that kills people, whether they eat it good or bad.",
        "source": "T15n0616_002:0294b07_42"
    },
    {
        "source_sentence": "若無身心者，死苦則無所寄。",
        "translation": "If there's no body or mind, then the suffering of death has nothing to rely on.",
        "source": "T15n0616_002:0294b07_43"
    },
    {
        "source_sentence": "如惡風摧折大樹，若無樹者則無所壞。",
        "translation": "It's like when a bad wind breaks down a large tree, and if there are no trees, nothing breaks down.",
        "source": "T15n0616_002:0294b08_44"
    },
    {
        "source_sentence": "如是略說身心受苦之本，如虛空風之本，木是火之本，地是水之本，身是苦之本。",
        "translation": "Thus, it's briefly explained that the body and mind experience the root of suffering, such as space is the root of wind, wood is the root of fire, earth is the root of water, and the body is the root of suffering.",
        "source": "T15n0616_002:0294b09_45"
    },
    {
        "source_sentence": "復次如地常是堅相，水常為濕相，火常為熱相，風常為動相，身心常為苦相。",
        "translation": "The earth always has the characteristic of being hard. Water always has the characteristic of being wet; fire always has the characteristic of being hot; wind always has the characteristic of being moving; and body and mind always have the characteristic of being painful.",
        "source": "T15n0616_002:0294b11_46"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0616_002:0294b13_47"
    },
    {
        "source_sentence": "以有身故，則老病死飢渴寒熱風雨等苦常隨逐之；",
        "translation": "Because of the existence of a body, old age, sickness, death, hunger, thirst, cold, heat, wind, rain, and other pains always follow it.",
        "source": "T15n0616_002:0294b13_48"
    },
    {
        "source_sentence": "以有心故，憂愁怖畏瞋惱嫉妬等苦常隨逐之。",
        "translation": "Because they have minds, sorrow, grief, fear, anger, jealousy, and other pains always follow them.",
        "source": "T15n0616_002:0294b14_49"
    },
    {
        "source_sentence": "若知現在身苦，過去苦亦爾，如現在過去身苦，未來亦爾。",
        "translation": "If someone knows that the present body is painful, so is the past suffering, just as the present and past bodies are painful in the future.",
        "source": "T15n0616_002:0294b15_50"
    },
    {
        "source_sentence": "譬如見今穀種生穀，比知過去未來亦皆如是。",
        "translation": "It's like seeing grain in the present and growing grain in the future, which is likewise compared to knowing what happened in the past and future.",
        "source": "T15n0616_002:0294b17_0"
    },
    {
        "source_sentence": "又如現在火熱相，比知過去未來火亦熱。",
        "translation": "Also, just as the present fire is characterized by heat, it's better to know that the past and future fire are also hot.",
        "source": "T15n0616_002:0294b18_1"
    },
    {
        "source_sentence": "如是若無身心，前則無苦、今亦無苦、後亦無苦。",
        "translation": "Thus, if there were no body and mind, there wouldn't be pain in the past, pain in the present, or pain in the future.",
        "source": "T15n0616_002:0294b19_0"
    },
    {
        "source_sentence": "當知三世苦痛皆從身心而有，是故應觀苦諦。",
        "translation": "You should know that in all three times, pain and suffering arise from body and mind. That is why you should contemplate the truth of suffering.",
        "source": "T15n0616_002:0294b20_1"
    },
    {
        "source_sentence": "如是心生厭患，是苦因緣，唯從愛等諸煩惱生，非天非時非自然亦非無因緣，",
        "translation": "In this way, the mind produces disgust and dissatisfaction. These are the causes and conditions for unsatisfactoriness. They arise only from such defilements as craving: neither heavenly nor seasonal, neither spontaneous, and neither without causes and conditions.",
        "source": "T15n0616_002:0294b21_2"
    },
    {
        "source_sentence": "若離煩惱則不有生。",
        "translation": "If they're free of afflictions, then there won't be birth.",
        "source": "T15n0616_002:0294b22_3"
    },
    {
        "source_sentence": "當知世間皆從愛等煩惱生，如人造事皆欲以為先，以是故諸煩惱是苦因緣。",
        "translation": "You should know that the world all arise from passions such as craving, just as people create things because they want to do them first. Because of this, passions are the causes and conditions for suffering.",
        "source": "T15n0616_002:0294b23_4"
    },
    {
        "source_sentence": "復次由愛水故受身，若無愛水則不受身，如乾土不能著壁，以水和之則有所著。",
        "translation": "Furthermore, it's because of craving water that they receive the body; if they don't have craving water, they won't accept the body, like dry dirt that can't touch a wall and mix it with water to form an attachment.",
        "source": "T15n0616_002:0294b25_5"
    },
    {
        "source_sentence": "復次因諸煩惱是故受身種種不同，如多欲者受多欲形，多瞋恚者受多瞋恚形，",
        "translation": "“Furthermore, it is because of defilement that bodily sensation is manifold and different: just as the one with much desire experiences the form of many desires; the one with much hatred experiences the form of much hatred.",
        "source": "T15n0616_002:0294b27_0"
    },
    {
        "source_sentence": "多癡者受多癡形，煩惱薄者受薄煩惱形，見今果報異故，知昔因緣各別，",
        "translation": "The one with much delusion experiences the form of manifold delusion; the one with weak defilement experiences the form of weak defilement. Because the present retribution is different, it is to be known that past causes and conditions are each different.",
        "source": "T15n0616_002:0294b28_1"
    },
    {
        "source_sentence": "來世隨煩惱受身差別亦如是隨業受身。",
        "translation": "In a future life, the body that's received according to afflictions and the body that's received according to karma are likewise received according to karma.",
        "source": "T15n0616_002:0294c01_2"
    },
    {
        "source_sentence": "若不為瞋恚則不受毒蛇形，一切餘形亦如是。",
        "translation": "If he doesn't become angry, then he won't accept the form of a poisonous snake, and so will all other forms.",
        "source": "T15n0616_002:0294c02_3"
    },
    {
        "source_sentence": "以是故當知愛等諸煩惱一切苦因緣，苦因緣盡故則苦盡涅槃，涅槃名離欲，",
        "translation": "Because of this, it should be known that such passions as craving and so on are all causes and conditions for frustration. When the causes and conditions for frustration have ended, then suffering ends and nirvana is called being free from desire.",
        "source": "T15n0616_002:0294c03_4"
    },
    {
        "source_sentence": "斷諸煩惱常不變異，是中無生無老無病無死，無愛別離苦怨憎會苦，常樂不退。",
        "translation": "Here, there's no birth, no old age, no illness, and no death, no desire, separation, pain, resentment, association, or suffering, and permanence, bliss, and nonretrogression.",
        "source": "T15n0616_002:0294c05_5"
    },
    {
        "source_sentence": "行者得涅槃滅度時都無所去，名為寂滅。",
        "translation": "When a practitioner attains nirvāṇa and becomes extinguished, there's nothing to leave, which is called cessation.",
        "source": "T15n0616_002:0294c07_6"
    },
    {
        "source_sentence": "譬如然燈，膏盡則滅不至諸方，是名滅諦。",
        "translation": "It's like a natural lamp that goes out when its anointment is exhausted and doesn't reach any place, which is called the truth of cessation.",
        "source": "T15n0616_002:0294c08_7"
    },
    {
        "source_sentence": "得涅槃方便道，定分有三種，慧分有二種，戒分有三種，住是戒中修行定慧。",
        "translation": "Attaining nirvāṇa in terms of skillful means and path, there are three kinds of parts of concentration, two kinds of parts of wisdom, and three kinds of parts of precepts that abide in the cultivation of concentration and wisdom within precepts.",
        "source": "T15n0616_002:0294c09_0"
    },
    {
        "source_sentence": "所謂於四諦中慧能決了，是名正見；",
        "translation": "The so-called right view that wisdom can decide regarding the four truths.",
        "source": "T15n0616_002:0294c10_1"
    },
    {
        "source_sentence": "隨正見覺法發起，是為正思惟。",
        "translation": "To follow right view and awakening to the Dharma and give rise to right thought is right contemplation.",
        "source": "T15n0616_002:0294c11_2"
    },
    {
        "source_sentence": "是名慧分二種。",
        "translation": "These are called the two kinds of parts of wisdom.",
        "source": "T15n0616_002:0294c12_3"
    },
    {
        "source_sentence": "正定、正念、正精進，是名定分三種。",
        "translation": "Correct concentration, right mindfulness and right effort are called the three kinds of concentration.",
        "source": "T15n0616_002:0294c12_4"
    },
    {
        "source_sentence": "正語、正業、正命，是名戒分三種。",
        "translation": "Right speech, right action and right livelihood are called the three kinds of precepts.",
        "source": "T15n0616_002:0294c13_5"
    },
    {
        "source_sentence": "住淨戒故，諸煩惱芽不令增長，勢力衰薄，如非時種芽不增長，諸煩惱力來，",
        "translation": "Because of abiding in pure precepts, the sprouts of defilement are not allowed to grow and their power is weak. Just as when planting seeds at an ungodly hour, they do not grow:",
        "source": "T15n0616_002:0294c14_6"
    },
    {
        "source_sentence": "定分能遮，如大山堰水，水不能破壞。",
        "translation": "The state of absorption can obstruct it, as a great mountain that holds up water and the water cannot break it down.",
        "source": "T15n0616_002:0294c15_7"
    },
    {
        "source_sentence": "譬如呪術能禁毒蛇，雖復有毒不能害人，定分亦如是。",
        "translation": "It's like a spell that can restrain a poisonous snake, and even though there's poison, it can't harm people, so is the concentration part.",
        "source": "T15n0616_002:0294c16_8"
    },
    {
        "source_sentence": "慧能拔諸煩惱根本，如夏水暴漲，岸上諸樹無不漂拔；",
        "translation": "Wisdom can remove the roots of all afflictions, just as in the summer water rises up with a sudden gust of wind and all the trees on the shore float away.",
        "source": "T15n0616_002:0294c18_0"
    },
    {
        "source_sentence": "行此三分八道真直正路，能滅苦因，畢竟安隱常樂無為。",
        "translation": "Practicing these three parts of the eightfold path is truly and directly the right path, which extinguishes the causes of suffering and ultimately brings peace, permanence, bliss, and nothingness.",
        "source": "T15n0616_002:0294c19_1"
    },
    {
        "source_sentence": "若方便初習其門則有十事：一者心專正，種種外事來壞不能移轉，如四邊風起山不傾動。",
        "translation": "If someone first cultivates this approach with skillful means, there are ten things: one, their mind is concentrated and correct, which doesn't change when various external things come and go, like the four sides of a mountain that rises and doesn't tilt.",
        "source": "T15n0616_002:0294c20_2"
    },
    {
        "source_sentence": "二者質直，聞師說法不見長短，心無增減隨教無疑，譬如入稠林採木直者易出曲者難出，",
        "translation": "The second is straightforwardness, because when they hear a teacher teach the Dharma they don't see length or shortness, and their minds don't increase or decrease according to what they teach without doubt. It's like going into a dense forest to gather wood that's straight and easy to produce and difficult to produce.",
        "source": "T15n0616_002:0294c22_3"
    },
    {
        "source_sentence": "如是三界稠林，直者易出、曲者難出，佛法中唯直是用、曲者遺棄。",
        "translation": "Thus, these three realms are dense forests, the straight one easy to get out and the crooked one difficult to get out, but in the Buddha's teaching, only the straight one is used and the crooked one is discarded.",
        "source": "T15n0616_002:0294c24_4"
    },
    {
        "source_sentence": "三者慚媿，是第一上服最妙莊嚴，慚媿為鉤制諸惡心，有慚有媿真為是人，",
        "translation": "The third is shame and scruples, which are the first most sublime adornment of the highest robe. Shame and scruples are the hooks that restrain bad thoughts.",
        "source": "T15n0616_002:0294c26_5"
    },
    {
        "source_sentence": "若無慚媿畜生無異。",
        "translation": "If there's no shame, the animals are no different.",
        "source": "T15n0616_002:0294c27_6"
    },
    {
        "source_sentence": "四者不放逸，一切善法之根本，如世間放逸失諸利事，行者放逸失涅槃利，",
        "translation": "The fourth is the principle of non-frivolity, which is the root of all good qualities. Just as in the world one who indulges in carelessness loses benefits, so practitioners who indulge in carelessness lose the benefit of nirvana.",
        "source": "T15n0616_002:0294c28_7"
    },
    {
        "source_sentence": "當知放逸如怨如賊，心常遠離，當知不放逸如君父師長，應遵承不捨。",
        "translation": "You should know that carelessness is like an enemy or a thief, and your mind always avoids it. You should know that you aren't careless like a ruler, father, teacher, or elder, so you should follow them and not abandon them.",
        "source": "T15n0616_002:0295a01_8"
    },
    {
        "source_sentence": "五者遠離，因此遠離成不放逸，若近五欲諸情開發，先常身離聚落，次心遠離不念世事。",
        "translation": "The fifth is seclusion. Because of this seclusion, nonfrivolity is achieved. If one approaches the five passions and develops feelings that arise from them, he first always keeps his body away from villages and towns; second, he keeps his mind free of worldly affairs without thinking about anything.",
        "source": "T15n0616_002:0295a02_9"
    },
    {
        "source_sentence": "六者少欲，資生之物心不多求，多求故則墮眾惱。",
        "translation": "The sixth is having few desires and not pursuing the necessities of life. If one pursues them often, he will fall into various afflictions.",
        "source": "T15n0616_002:0295a04_10"
    },
    {
        "source_sentence": "七者知足，有人雖復少欲，樂著好物則敗道心，是故智者趣足而已。",
        "translation": "The seventh is the knowledge of contentment. Although some people may have few desires, if they are attached to good things and delight in them, they'll lose the mind of the path. That's why wise people simply aim for fulfillment.",
        "source": "T15n0616_002:0295a05_11"
    },
    {
        "source_sentence": "八者心不繫著，若弟子檀越知識親里，若問訊迎送多營多事，如是等者毀敗道故不應繫著。",
        "translation": "Eighth, the mind isn't attached, and if disciples, donors, friends, relatives, or relatives are greeted, greeted, and sent off with many tasks, such people disparage the path and therefore shouldn't be attached.",
        "source": "T15n0616_002:0295a07_12"
    },
    {
        "source_sentence": "九者不樂世樂，若歌舞伎樂，良時好日選擇吉凶，一切世事悉不喜樂。",
        "translation": "Nine, he doesn't enjoy worldly pleasures, and if he sings, dances, plays, and chooses good fortune or bad fortune on a good day, he doesn't enjoy all worldly affairs.",
        "source": "T15n0616_002:0295a09_13"
    },
    {
        "source_sentence": "十者忍辱，行者求道時，當忍十事：一蚊虻侵害，二蛇蚖毒螫，三者毒獸，",
        "translation": "Tenth is patience. When practitioners seek the path, they must endure ten things: 1. attack by mosquitoes and gadflies; 2. poisonous stung by snakes and serpents; 3. poisonous animals; 4.",
        "source": "T15n0616_002:0295a11_14"
    },
    {
        "source_sentence": "四者罵詈誹謗，五者打擲加害，六者病痛，七飢，八渴，九寒，十熱，",
        "translation": "The fourth is hatred and slander. The fifth is inflicting harm upon others by beating them. The sixth is the pain of illness, the seventh is hunger, the eighth is thirst, the ninth is cold and the tenth is heat.",
        "source": "T15n0616_002:0295a12_15"
    },
    {
        "source_sentence": "如是惱事，行者忍之莫令有勝，常勝此事。",
        "translation": "Such an annoying thing, practitioners tolerate it and don't allow it to be superior; they always overcome it.",
        "source": "T15n0616_002:0295a14_16"
    },
    {
        "source_sentence": "復次如人識知病相，知病因緣，知除病藥，得看病人，隨意所須不久當差。",
        "translation": "Furthermore, it's like a person who knows the characteristics of illness, knows the causes and conditions of illness, knows the antidote for illness, and gets to see the patient as he wishes, so he'll soon be cured.",
        "source": "T15n0616_002:0295a15_17"
    },
    {
        "source_sentence": "行者如是，知實苦相，知苦因緣，知苦盡道，知得善師同學，如是不久得安隱寂滅。",
        "translation": "Such a practitioner knows the true characteristics of suffering, knows the causes and conditions of suffering, knows the path to the end of suffering, and knows that he's been trained by a good teacher, so he'll soon attain peace and cessation like this.",
        "source": "T15n0616_002:0295a17_18"
    },
    {
        "source_sentence": "問曰：以得非想非非想處入深禪定，唯有上地結使微薄，心已柔軟，不應種種因緣種種譬喻觀是四諦，",
        "translation": "Q: When someone enters deep meditation with the attainment of neither perception nor non-perception, there's only the higher ground fetters that are weak and the mind that's already supple, so they shouldn't contemplate these four noble truths with various causes and conditions and various metaphors.",
        "source": "T15n0616_002:0295a18_19"
    },
    {
        "source_sentence": "似若不信？",
        "translation": "Suppose someone doesn't believe it?",
        "source": "T15n0616_002:0295a21_20"
    },
    {
        "source_sentence": "答曰：非但為有頂者說，總為一切有頂之人，但觀無色界四陰無常苦空無我，",
        "translation": "Answer: It's not just for those with the highest level of existence, but it's generally for all those with the highest level of existence who simply observe that the four aggregates in the formless realm are impermanent, painful, empty, and selfless.",
        "source": "T15n0616_002:0295a21_21"
    },
    {
        "source_sentence": "如病如瘡如箭入心，無常苦空無我，皆是因緣虛誑作法，觀涅槃上妙安隱快樂，",
        "translation": "Like illness, like sores, like arrows entering the mind, impermanent, painful, empty, and selfless, they are all causes and conditions for falsely constructed phenomena, observing nirvāṇa’s supreme marvelous peace and happiness.",
        "source": "T15n0616_002:0295a23_22"
    },
    {
        "source_sentence": "非為作法真實不虛，滅三毒三衰，身心苦滅，常呵四陰及其因緣，則名苦諦集諦，",
        "translation": "It is not the case that they do so in order to make dharmas real and not false. The extinction of the three poisons and the three decays, the extinction of suffering in body and mind, the constant criticism of the four aggregates as well as their causes and conditions are what is called the truth of suffering and the truth of its arising.",
        "source": "T15n0616_002:0295a25_23"
    },
    {
        "source_sentence": "讚歎涅槃及涅槃道，是名盡諦道諦。",
        "translation": "Praising nirvāṇa and the path to nirvāṇa is called the ultimate truth of the path.",
        "source": "T15n0616_002:0295a27_0"
    },
    {
        "source_sentence": "行者得四禪、四無色定，心已柔軟，若求五神通，依第四禪則易得，若依初禪二禪三禪雖復可得，",
        "translation": "If a practitioner attains the fourth meditative state of absorption and the four formless concentrations, his mind is already supple. If he seeks the five higher faculties, it will be easy to attain them on the basis of the fourth trance. If he relies on the first meditative state of absorption, the second meditative state of absor",
        "source": "T15n0616_002:0295a27_1"
    },
    {
        "source_sentence": "求之甚難得亦不固。",
        "translation": "It's very difficult to ask for, and it's not stable.",
        "source": "T15n0616_002:0295b01_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0616_002:0295b01_3"
    },
    {
        "source_sentence": "初禪覺觀亂定故，二禪喜多故，三禪樂多故，與定相違，四如意分皆是定相，",
        "translation": "In the first trance, initial thought and sustained thought are observed in a disturbed meditative state of absorption; in the second trance, joy is preeminent; in the third trance blissfulness is preeminent. This is contrary to concentration. The fourth supernormal knowledge is all the characteristic of samdhi.",
        "source": "T15n0616_002:0295b01_4"
    },
    {
        "source_sentence": "唯第四禪無苦無樂無憂無喜，無出入息，諸聖所住快樂安隱，是故行者當依第四禪修四如意分。",
        "translation": "Only in the fourth meditative state of absorption there is neither suffering nor pleasure, neither sorrow nor joy. There is neither exhaling nor exhaling, and the holy ones abide in bliss and peace. Because of this, practitioners should cultivate the four supernormal knowledges by relying on the fourth meditative state of absorption",
        "source": "T15n0616_002:0295b03_5"
    },
    {
        "source_sentence": "所謂欲定行法成就如意，精進定、心定、思惟定行法成就如意，依是住者無事不得。",
        "translation": "The so-called method of practicing the concentration of desire accomplishes supernormal abilities, and the method of practicing the concentration of effort, the concentration of mind, and the concentration of contemplation accomplishes supernormal abilities, which are not attained by anyone who abides on their basis.",
        "source": "T15n0616_002:0295b05_6"
    },
    {
        "source_sentence": "問曰：云何欲定行法成就如意？",
        "translation": "Q: How do they want to practice the Dharma of concentration and accomplish supernormal abilities?",
        "source": "T15n0616_002:0295b07_7"
    },
    {
        "source_sentence": "答曰：欲名欲於所求之事，定名一心無有增減，行法名信念巧慧喜樂等助成欲定，",
        "translation": "Answer: Desire is called desire, and the things he seeks are called concentration. Concentration is called one-pointedness of mind without increase or decrease. Karmic forces are called faith, skillful wisdom, joy, etc., which contributes to the formation of the concentration of desire.",
        "source": "T15n0616_002:0295b08_8"
    },
    {
        "source_sentence": "因欲為主，得定故名為欲定；",
        "translation": "It is called ‘concentration on sexual passion’ because of the acquisition of it.",
        "source": "T15n0616_002:0295b10_9"
    },
    {
        "source_sentence": "精進定、心定、思惟定亦如是。",
        "translation": "It's likewise with the concentration of effort, concentration of mind, and concentration of contemplation.",
        "source": "T15n0616_002:0295b10_10"
    },
    {
        "source_sentence": "行者觀欲莫令有增有減，莫令內多攝、外多散，柔軟平等調和堪用，猶如彈琴調其緩急，",
        "translation": "The practitioner observes that desire should not allow there to be increase or decrease. He should not allow the internal to gather much and the external to disperse much. He should be gentle, impartial, harmonious, and able to use it, just as playing the lute to regulate its laxness and urgency.",
        "source": "T15n0616_002:0295b11_11"
    },
    {
        "source_sentence": "隨作何曲。",
        "translation": "What song does it follow?",
        "source": "T15n0616_002:0295b13_12"
    },
    {
        "source_sentence": "精進、心、思惟亦爾，如行者學飛，欲飛是名欲；",
        "translation": "The same applies to energy, to awarenesses and to reasoning. Just as a practitioner learns to fly when proceeding: flying in the direction of craving is called ‘craving’.",
        "source": "T15n0616_002:0295b13_13"
    },
    {
        "source_sentence": "攝諸散心集助行法，是名精進心；",
        "translation": "To gather the distracted minds and accumulate the aids to enlightenment is called ‘mind of energy’.",
        "source": "T15n0616_002:0295b14_14"
    },
    {
        "source_sentence": "能舉身離身心麁重睡掉等，心則輕便，以心輕故能舉其身，是名心；",
        "translation": "Being able to lift the body free from grossness, torpor, drowsiness, etc., of body and mind is called ‘mind’ when one lifts the body because the mind is light.",
        "source": "T15n0616_002:0295b15_15"
    },
    {
        "source_sentence": "籌量欲精進心多少，能舉身未能壞內外諸色味，是名思惟。",
        "translation": "Considering the amount of desire, effort, and mind that can be exerted to lift a body without destroying internal and external forms and flavors, this is called contemplation.",
        "source": "T15n0616_002:0295b17_16"
    },
    {
        "source_sentence": "依四如意分，能具足一切功德，何況五通！",
        "translation": "Relying on the four supernormal parts, they can fully possess all merits, not to mention the five supernormal powers!",
        "source": "T15n0616_002:0295b18_17"
    },
    {
        "source_sentence": "問曰：五神通何者先生？",
        "translation": "Q: What are the five supernormal powers, sir?",
        "source": "T15n0616_002:0295b19_18"
    },
    {
        "source_sentence": "答曰：隨所樂者為先。",
        "translation": "Answer: According to what's pleasing, it comes first.",
        "source": "T15n0616_002:0295b20_19"
    },
    {
        "source_sentence": "問曰：若爾者，何以變化神通在初？",
        "translation": "Q: If that's the case, why is it because the miraculous power of transformation at the beginning?",
        "source": "T15n0616_002:0295b20_20"
    },
    {
        "source_sentence": "答曰：五神通多為眾生。",
        "translation": "Answer: The five supernormal powers are mostly for sentient beings.",
        "source": "T15n0616_002:0295b21_21"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0616_002:0295b21_22"
    },
    {
        "source_sentence": "如慧解脫阿羅漢，既得阿羅漢作是念言：「有眾生多鈍根者，不信道事輕慢佛法，",
        "translation": "Suppose an arhat liberated from wisdom attains arhatship and, having attained arhatship, thinks, “There are many dull-rooted sentient beings who don’t believe in the path and despise the buddha-dharma.",
        "source": "T15n0616_002:0295b22_23"
    },
    {
        "source_sentence": "我得難事漏盡神通，如何不起神通教化眾生而令墮罪？",
        "translation": "I've attained the ability to end the contaminants of difficult tasks and supernormal abilities, so how can I not produce supernormal abilities to teach sentient beings and cause them to fall into sin?",
        "source": "T15n0616_002:0295b23_24"
    },
    {
        "source_sentence": "又佛大悲利益眾生，我為弟子，應以神通助益眾生。",
        "translation": "Also, the Buddha's great compassion benefits sentient beings, and I, as a disciple, should use my supernormal powers to help sentient beings.",
        "source": "T15n0616_002:0295b25_25"
    },
    {
        "source_sentence": "然諸眾生多以現事而得利益，神變感動貴賤大眾無不傾伏，餘通無有是者。」",
        "translation": "Still, there are many sentient beings who attain benefit in the present life and whose miraculous transformation moves the masses of noble and humble people without fail to subdue them, and there's nothing else that does so.",
        "source": "T15n0616_002:0295b26_26"
    },
    {
        "source_sentence": "以是故變化神通在初。",
        "translation": "Because of this, the miraculous power of transformation is at the beginning.",
        "source": "T15n0616_002:0295b28_27"
    },
    {
        "source_sentence": "問曰：天身火大多故身有光明，亦能昇虛疾去；",
        "translation": "Question: Because the body of gods is like a great deal of fire, they have light in their bodies. They can also rise up and go away at will.",
        "source": "T15n0616_002:0295b28_28"
    },
    {
        "source_sentence": "鬼神風大多故身則輕疾，無所觸礙；",
        "translation": "Because the wind of ghosts and spirits blows heavily, their bodies are light and swift; they do not encounter any obstruction.",
        "source": "T15n0616_002:0295b29_29"
    },
    {
        "source_sentence": "龍身水多故心念生水，亦能變動；",
        "translation": "Because water is abundant in the bodies of these nāgas, water arises from their thoughts and they can also change and move.",
        "source": "T15n0616_002:0295c01_30"
    },
    {
        "source_sentence": "人身地大多故輕動相少，云何能飛？",
        "translation": "Because the human body and ground are large, it's light and moves little, so how can it fly?",
        "source": "T15n0616_002:0295c02_31"
    },
    {
        "source_sentence": "答曰：以人身地種輕動相少故，求學神通，如天如神何用通為？",
        "translation": "Answer: It's because the human body and earth are light and have few signs of movement that they seek to train in supernormal abilities, just like gods and goddesses, so why would they use supernormal abilities?",
        "source": "T15n0616_002:0295c03_32"
    },
    {
        "source_sentence": "如地雖重，以水力故地則為動，如是心力故能舉其身。",
        "translation": "Just as the earth moves even though it is heavy, because of the power of water. Because of the power of awarenesses like this one can lift their bodies.",
        "source": "T15n0616_002:0295c04_33"
    },
    {
        "source_sentence": "譬如獼猴從高墜落而不傷身，人墮則傷，以獼猴心力輕疾強故無損；",
        "translation": "Good man, this is analogous to a rhesus monkey falling down from a high place and not injuring its body. If someone were to fall down it would be injured. Because the mental power of the rhesus monkey is light and swift, it does not harm.",
        "source": "T15n0616_002:0295c05_34"
    },
    {
        "source_sentence": "當知身通如是，心力強故。",
        "translation": "You should know that bodily penetration is like this because of the power of thought.",
        "source": "T15n0616_002:0295c07_35"
    },
    {
        "source_sentence": "又如人能浮，雖在深水而不沈沒，心方便力故能持其身；",
        "translation": "It is also like the case of a person who can float but does not sink even though deep in water. Because of the power of skillful means, he can maintain his body.",
        "source": "T15n0616_002:0295c08_0"
    },
    {
        "source_sentence": "以是故當知，人身雖重，心力強故身飛虛空。",
        "translation": "Because of this, you should know that even though the human body is heavy, it flies through space because its mind is strong.",
        "source": "T15n0616_002:0295c09_1"
    },
    {
        "source_sentence": "問曰：如是可信云何當學？",
        "translation": "Q: So, how should we learn to believe in such things?",
        "source": "T15n0616_002:0295c10_2"
    },
    {
        "source_sentence": "答曰：若行者住於第四禪，依四如意分，一心攝念觀身處處虛空如藕根孔，",
        "translation": "Answer: If a practitioner abides in the fourth dhyāna, relying on the four supernormal powers, he singlemindedly collects his thoughts and observes body everywhere in space like a lotus root pore.",
        "source": "T15n0616_002:0295c10_3"
    },
    {
        "source_sentence": "取身輕疾相，習之不已，身與心合，如鐵與火合，滅身麁重相，但有輕疾身；",
        "translation": "He grasps the characteristic of lightness and ailment in his body without ceasing to do so. When his body is united with his mind, just as when iron is united with fire, he extinguishes the debilitating features of his body but has a light and ailing body.",
        "source": "T15n0616_002:0295c12_4"
    },
    {
        "source_sentence": "與欲、精進、思惟及助行法合，欲等善行力故，身則隨逐如火在鐵輕軟中用。",
        "translation": "When combined with desire, energy, volition, reflection and the factors conducive to enlightenment. Because of the power of such good deeds as sexual passion, the body follows them: just as fire is used in iron when it is light or weak.",
        "source": "T15n0616_002:0295c14_5"
    },
    {
        "source_sentence": "又復色界四大造色，在此身中與身和合，令身輕便隨意能去。",
        "translation": "Furthermore, the four elements that create form in the realm of form are combined with the body in this body and cause the body to be light so that it can depart at will.",
        "source": "T15n0616_002:0295c15_6"
    },
    {
        "source_sentence": "如人服藥，令心了了身則輕便。",
        "translation": "It's like a person who takes a medicine that causes the mind to perceive the body and then relieves it.",
        "source": "T15n0616_002:0295c17_7"
    },
    {
        "source_sentence": "譬如色界四大造色明淨，在此身故眼則明淨。",
        "translation": "It's like the four elements in the form realm that create form and make it clear and pure, and because of this body, the eye becomes clear and pure.",
        "source": "T15n0616_002:0295c18_8"
    },
    {
        "source_sentence": "如人學跳，習之轉工絕於餘人，如鳥子學飛漸漸轉遠；",
        "translation": "It is like the case of a person training in jumping, but when he learns to do so his skills are inferior to those of others. Like a bird learning to fly and gradually going far away.",
        "source": "T15n0616_002:0295c19_9"
    },
    {
        "source_sentence": "身通如是，初得之時，或一丈二丈，漸能遠飛。",
        "translation": "His bodily powers are like this, and when he first attains them, he can gradually fly a distance of one zhang or twelve zhang.",
        "source": "T15n0616_002:0295c20_10"
    },
    {
        "source_sentence": "是變化神通有四種：一者身飛虛空如鳥飛行，二者遠能令近，三者此滅彼出，",
        "translation": "There are four kinds of these magical powers: first, fleeing like a bird in the sky with one’s body; second, being able to cause those who are far away to approach it; third, extinguishing this and that which comes forth.",
        "source": "T15n0616_002:0295c21_11"
    },
    {
        "source_sentence": "四者猶如意疾，彈指之頃有六十念，一念中間能越無量阿僧祇恒河沙國土，",
        "translation": "Fourth, it is like a magical spell: there are sixty moments in the time it takes to snap one’s fingers. Within a single thought, they can traverse an infinite number of worlds as numerous as the grains of sand in the Ganges River.",
        "source": "T15n0616_002:0295c23_12"
    },
    {
        "source_sentence": "隨念即至。",
        "translation": "He follows his thoughts and arrives there.",
        "source": "T15n0616_002:0295c24_13"
    },
    {
        "source_sentence": "用是神通身得自在，一身能為多身，多身能為一身，大能為小、小能為大，",
        "translation": "With this body of supernatural powers, they attain mastery. One body can make many bodies with one body; many bodies can make one body; the large can make the small; the small can make the large.",
        "source": "T15n0616_002:0295c25_14"
    },
    {
        "source_sentence": "重若須彌、輕如鴻毛，如是等所作如意。",
        "translation": "If it's heavy like Mount Sumeru or light like a great hair, such things are done as they wish.",
        "source": "T15n0616_002:0295c26_15"
    },
    {
        "source_sentence": "復次，菩薩得是身通，一念之頃度恒河沙國土，然眾生見菩薩到彼，而菩薩不動於本處，",
        "translation": "“Furthermore, when the bodhisattva had attained this physical superknowledgement, in an instant he crossed the Ganges River over to a land as numerous as the grains of sand in the Ganges River.",
        "source": "T15n0616_002:0295c27_16"
    },
    {
        "source_sentence": "於彼說法教化，此亦不廢。",
        "translation": "Here, too, the teaching and edification of those who expound the Dharma are not abandoned.",
        "source": "T15n0616_002:0295c29_17"
    },
    {
        "source_sentence": "或有天人著常顛倒，可以神通度者，現燒三千大千國土，而眾生見三千大千國土焚燒破壞，",
        "translation": "“Some gods and humans, obsessed with eternalism and in error, can use their supernormal powers to liberate people. They burn up the great chiliocosm of a trichiliocosm but sentient beings see that it burns up and breaks down.",
        "source": "T15n0616_002:0296a01_18"
    },
    {
        "source_sentence": "而國土無損。",
        "translation": "The land won't be harmed.",
        "source": "T15n0616_002:0296a03_19"
    },
    {
        "source_sentence": "有眾生心生憍慢，現作手執金剛杵，從金剛中出火，見者怖畏歸伏禮敬。",
        "translation": "Some sentient beings become conceited and presently hold a vajra in their hands, and fire emerges from within the vajra. Those who see it are frightened and return to pay homage with reverence.",
        "source": "T15n0616_002:0296a03_20"
    },
    {
        "source_sentence": "有人樂著轉輪聖王身，即現轉輪聖王而為說法，或現釋提桓因、或現魔王、或現聲聞辟支佛、或現佛身，",
        "translation": "“Some people delight in the body of a universal ruler, and they teach the Dharma by appearing to them as universal ruler; some show themselves as lords of gods, some as kings of Māra, some as śrāvakas, some as pratyekabuddhas, some as buddhas.",
        "source": "T15n0616_002:0296a05_21"
    },
    {
        "source_sentence": "隨所樂身而為說法。",
        "translation": "He teaches the Dharma according to his body of pleasure.",
        "source": "T15n0616_002:0296a07_22"
    },
    {
        "source_sentence": "菩薩或復在虛空中結加趺坐，從身四邊悉放種種光明而為說法。",
        "translation": "The bodhisattva might also sit cross-legged in space, emanating various kinds of light from the four sides of his body to teach the Dharma.",
        "source": "T15n0616_002:0296a08_23"
    },
    {
        "source_sentence": "或時眾生樂雜色莊嚴，即為現三千大千國土七寶莊嚴幢幡華蓋百種伎樂，",
        "translation": "“Sometimes sentient beings delight in the adornments of all kinds of colors, producing a hundred kinds of music such as banners, pennants, canopies, and flower garlands decorated with the seven kinds of jewels from the great manifold cosmos of the billion-thousand worlds.",
        "source": "T15n0616_002:0296a09_24"
    },
    {
        "source_sentence": "處中說法。",
        "translation": "He teaches the Dharma in his place.",
        "source": "T15n0616_002:0296a11_25"
    },
    {
        "source_sentence": "或令三千大千國土為一海水，青蓮紅華覆蓋水上，於上說法。",
        "translation": "Suppose he causes 3,000 great one-thousand lands to become a single body of water, covers it with blue lotus and red flowers, and teaches the Dharma there.",
        "source": "T15n0616_002:0296a11_26"
    },
    {
        "source_sentence": "或坐須彌山上，以梵音聲說法，普聞諸國。",
        "translation": "Or they may sit on the top of a polar mountain and expound the Teaching in the pure voice, which is heard throughout all countries.",
        "source": "T15n0616_002:0296a13_27"
    },
    {
        "source_sentence": "或時眾生不見其形，但聞說法之聲。",
        "translation": "Sometimes sentient beings don't see their form but hear the sound of the teaching.",
        "source": "T15n0616_002:0296a14_0"
    },
    {
        "source_sentence": "或作乾闥婆身，伎樂音聲令其心悅，然後說法。",
        "translation": "Or they may create the body of a gandharva, play music and sounds to make their minds happy, and then teach the Dharma.",
        "source": "T15n0616_002:0296a14_1"
    },
    {
        "source_sentence": "或現龍王雷電霹靂，而以說法。",
        "translation": "Or they may show that the dragon king thunder, lightning, and thunder are preaching the Dharma.",
        "source": "T15n0616_002:0296a15_2"
    },
    {
        "source_sentence": "如是種種因緣方便，而現神變開引眾生。",
        "translation": "Thus, they manifest miraculous transformations for various reasons and skillful means to enlighten sentient beings.",
        "source": "T15n0616_002:0296a16_3"
    },
    {
        "source_sentence": "問曰：是神通變化諸物，云何而不虛妄？",
        "translation": "Q: Are these things that are miraculous and transforming, so why aren't they false?",
        "source": "T15n0616_002:0296a17_4"
    },
    {
        "source_sentence": "答曰：行者先知諸法虛誑如幻如化，譬如調泥隨意所作，如福德之人尚能夏有雪、冬生華、河不流，",
        "translation": "Answer: Practitioners first know that the dharmas are false and illusory like illusions and transformations, just as a man of virtue can still produce snow in summer, flowers in winter, and rivers that don't flow when he tames mud at will.",
        "source": "T15n0616_002:0296a18_5"
    },
    {
        "source_sentence": "又如仙人瞋怒令虎狼師子變為石身，何況神通定力而不變物？",
        "translation": "It's also like the sage who angrily causes a tiger, wolf, or lion to turn into a stone body, so why wouldn't he change things with his supernormal powers and concentration?",
        "source": "T15n0616_002:0296a20_6"
    },
    {
        "source_sentence": "復次一切物中各有氣分，取其分相神力廣之，餘者隱沒。",
        "translation": "Furthermore, among all things, each has a part of energy that takes its parts and characteristics and extends them with supernormal powers, but the rest are concealed.",
        "source": "T15n0616_002:0296a22_7"
    },
    {
        "source_sentence": "如經說，有比丘神力心得自在，見有大木欲令為地即皆是地。",
        "translation": "As the sūtras say, there's a monk with supernormal powers who has his mind at ease and sees a large piece of wood that wants to make it earth, which is all earth.",
        "source": "T15n0616_002:0296a23_8"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0616_002:0296a24_9"
    },
    {
        "source_sentence": "木有地分故。",
        "translation": "It's because wood has earth parts.",
        "source": "T15n0616_002:0296a25_10"
    },
    {
        "source_sentence": "若水火風亦如是。",
        "translation": "It's likewise with water, fire, and wind.",
        "source": "T15n0616_002:0296a25_11"
    },
    {
        "source_sentence": "若作金銀種種寶物，隨意悉作。",
        "translation": "If he creates various treasures of gold and silver, he makes them as he wishes.",
        "source": "T15n0616_002:0296a25_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0616_002:0296a26_13"
    },
    {
        "source_sentence": "木有淨分故。",
        "translation": "It's because wood has a pure part.",
        "source": "T15n0616_002:0296a26_14"
    },
    {
        "source_sentence": "問曰：物變如是，化無本末，其事云何？",
        "translation": "Q: Such is the nature of things that are transformed, and there's no beginning or end in their transformation. What's the matter?",
        "source": "T15n0616_002:0296a26_15"
    },
    {
        "source_sentence": "答曰：有言虛空中四大所造微塵，化心力故令諸微塵合成化人。",
        "translation": "Answer: Some say that there are tiny dust motes created by the four elements in space, and it's because of the power of the transforming mind that they cause the tiny dust motes to combine to transform people.",
        "source": "T15n0616_002:0296a27_16"
    },
    {
        "source_sentence": "譬如人死，或生天上或生地獄，罪福因緣故，和合微塵為化亦如是等是物變化神通相。",
        "translation": "It's like when a person dies, whether they're born in heaven or hell, and because of the causes and conditions of sin and merit, they combine tiny dust motes for transformation, so it's likewise with the characteristics of things that are transformed by miraculous powers.",
        "source": "T15n0616_002:0296a29_17"
    },
    {
        "source_sentence": "若行者欲求天耳，亦以第四禪為本，修四如意分，如上所說，調柔其心，",
        "translation": "If a practitioner wants to seek the divine ear, he also takes the fourth dhyāna as the root and cultivates the four supernormal powers of thusness, as explained above, to tame his mind.",
        "source": "T15n0616_002:0296b02_18"
    },
    {
        "source_sentence": "屬念大眾音聲，取種種聲相，所聞之聲常當想念，若心餘緣攝之令還，",
        "translation": "Being mindful of the sounds of the masses, they grasp various sounds and characteristics, always perceive the sounds they hear. If they are collected by the mind for other reasons, they cause them to return.",
        "source": "T15n0616_002:0296b03_19"
    },
    {
        "source_sentence": "常當一心修念，即於耳中得色界四大所造清淨之色，是名修習天耳。",
        "translation": "They should always cultivate mindfulness with one mind, which is to attain the pure form created by the four major forms in the form realm in their ears, which is called cultivating the divine ear.",
        "source": "T15n0616_002:0296b05_20"
    },
    {
        "source_sentence": "以是天耳，聞十方無量國土音聲，所謂天聲、人聲、龍聲、阿修羅聲、乾闥婆聲、栴陀羅聲、摩睺勒聲，",
        "translation": "Because of these divine ears, they hear the sounds of countless lands in the ten directions: celestial sounds, human sounds, dragon sounds, asura sounds, gandharva sounds, caṇḍāla sounds, and mahora sounds.",
        "source": "T15n0616_002:0296b07_21"
    },
    {
        "source_sentence": "及畜生、餓鬼之聲，地獄苦痛麁細大小音聲等，皆悉聽聞。",
        "translation": "They all hear the sounds of animals and hungry ghosts, the sounds of pain and suffering in hell, the sounds of coarse and subtle sounds, large and small, and so forth.",
        "source": "T15n0616_002:0296b09_22"
    },
    {
        "source_sentence": "菩薩定心轉深，乃聞十方諸佛音聲，從佛聞法而不取相，以法為真法為最上，",
        "translation": "When the enlightening beings’ minds became deeper and deeper concentrated, they heard the voices of the buddhas of the ten directions. They heard the Teaching from the Buddhas but did not grasp their characteristics; foremost among them was the doctrine that regarded reality as truth.",
        "source": "T15n0616_002:0296b10_23"
    },
    {
        "source_sentence": "而依深義不依於語。",
        "translation": "They rely on profound meanings and don't rely on words.",
        "source": "T15n0616_002:0296b12_24"
    },
    {
        "source_sentence": "云何深義？",
        "translation": "What's the profound meaning?",
        "source": "T15n0616_002:0296b12_25"
    },
    {
        "source_sentence": "所謂知諸法空、無相、無作，不生邪見。",
        "translation": "They say they know the emptiness, signlessness, and noncontrivance of dharmas and don't give rise to wrong views.",
        "source": "T15n0616_002:0296b13_26"
    },
    {
        "source_sentence": "於義亦不得義，不可得中亦無得相，是依深義不依語言。",
        "translation": "In meaning, they also don't attain meaning, and in what's unobtainable, there's no acquired characteristic. This is based on profound meaning and not on words.",
        "source": "T15n0616_002:0296b14_0"
    },
    {
        "source_sentence": "復次行者依了義經不依非了義經。",
        "translation": "Furthermore, practitioners rely on the fully explained sūtras and don't rely on what's not fully explained.",
        "source": "T15n0616_002:0296b15_1"
    },
    {
        "source_sentence": "了義經者，若能依義，一切諸經皆是了義，義畢竟空不可說相故。",
        "translation": "A scripture that understands the meaning means that if it can rely on the meaning, all the sūtras are fully understood because the meaning is ultimately empty and has ineffable characteristics.",
        "source": "T15n0616_002:0296b16_2"
    },
    {
        "source_sentence": "是以諸經皆是了義。",
        "translation": "That's why all the sūtras are fully explained.",
        "source": "T15n0616_002:0296b17_3"
    },
    {
        "source_sentence": "若不依義，是人於諸經皆不了義。",
        "translation": "If someone doesn't rely on the meaning, they won't understand the meaning of the sūtras.",
        "source": "T15n0616_002:0296b18_4"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0616_002:0296b18_5"
    },
    {
        "source_sentence": "以無深智，隨逐音聲故。",
        "translation": "It's because there's no profound cognition, which follows sounds.",
        "source": "T15n0616_002:0296b19_6"
    },
    {
        "source_sentence": "是音聲實相亦入深義，俱不可說，是名分別了義經不非了義經。",
        "translation": "This is called a scripture that discerns and understands meanings and not a scripture that understands meanings.",
        "source": "T15n0616_002:0296b19_7"
    },
    {
        "source_sentence": "復次行者依智而不依識。",
        "translation": "Furthermore, practitioners rely on cognition and not on consciousness.",
        "source": "T15n0616_002:0296b21_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0616_002:0296b21_9"
    },
    {
        "source_sentence": "行者知是識相，從因緣和合生，無有自性，無色無對不可見，無知無識虛誑如幻。",
        "translation": "Practitioners know that it's the characteristic of consciousness, which arises from the conjunction of causes and conditions, has no self-nature, is formless, invisible, invisible, and illusory like an illusion without knowing or consciousness.",
        "source": "T15n0616_002:0296b21_10"
    },
    {
        "source_sentence": "如是知識相，識即為智，是故依智而不依識。",
        "translation": "In this way, knowledge is the characteristic mark of knowledge. Consciousness exactly is knowledge. That is why it depends on knowledge and not on consciousness.",
        "source": "T15n0616_002:0296b23_11"
    },
    {
        "source_sentence": "行者雖復生識，若識若智而不生著，知識如相，識即為智相，以是智相為眾生說。",
        "translation": "Even though the practitioner gives rise to consciousness, he doesn't give rise to attachment if there's consciousness or cognition, and knowledge is like form, and consciousness is the characteristic of cognition, which is explained for sentient beings because it's the characteristic of cognition.",
        "source": "T15n0616_002:0296b24_12"
    },
    {
        "source_sentence": "復次行者依法不依人。",
        "translation": "Furthermore, practitioners follow the Dharma and don't rely on people.",
        "source": "T15n0616_002:0296b26_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0616_002:0296b27_14"
    },
    {
        "source_sentence": "若佛法中實有人者，無有清淨得解脫者，而一切法無我無人，但隨俗故說有人有我，",
        "translation": "If there really is a person in the Buddha’s doctrine, there will be no pure acquisition of liberation. Yet all things have no self and no one else: it is only by following worldly conventions that they are said to have a self or personality.",
        "source": "T15n0616_002:0296b27_15"
    },
    {
        "source_sentence": "以是故行者依法不依人。",
        "translation": "Because of this, practitioners follow the Dharma and don't rely on people.",
        "source": "T15n0616_002:0296b29_16"
    },
    {
        "source_sentence": "所謂法者諸法之性，法性者無生性，是無生性者畢竟空，是畢竟空者不可說者是。",
        "translation": "The so-called dharma refers to the nature of dharmas, and the Dharma nature refers to the nature of nonproduction; this is the ultimate emptiness of the nature of nonproduction, which is the ultimate emptiness that can't be explained.",
        "source": "T15n0616_002:0296b29_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0616_002:0296c02_18"
    },
    {
        "source_sentence": "以語說法，法中無語、語中無法，語則是無語相，一切語言非語言相，",
        "translation": "To expound the doctrine by means of words is to say that there is no discourse in dharmas and nothing at all in speech. Speech is the characteristic of non-speaking, and all speech is not the characteristic of speech.",
        "source": "T15n0616_002:0296c02_19"
    },
    {
        "source_sentence": "以是故經說，無示無說是名佛法。",
        "translation": "That's why the sūtras say that nothing is shown and nothing is explained, which is called the Buddha-dharma.",
        "source": "T15n0616_002:0296c04_20"
    },
    {
        "source_sentence": "行者以天耳聞諸佛法，若人若法不生著見，若分別二相非為佛法，若無二相則是佛法。",
        "translation": "Practitioners hear the Buddha's teachings with their divine ears, and if people or dharmas don't give rise to views that discriminate two characteristics is not the Buddha's teaching, and if there are no two characteristics, it's the Buddha's teaching.",
        "source": "T15n0616_002:0296c05_21"
    },
    {
        "source_sentence": "行者依止天耳力故，聞甚深之法，以教化眾生，是名天耳神通。",
        "translation": "Practitioners rely on the power of the divine ear to hear profound teachings and teach sentient beings, which is called the divine ability of the divine ear of the gods.",
        "source": "T15n0616_002:0296c07_22"
    },
    {
        "source_sentence": "若行者欲得他心智，先自觀心，取心生相、住相、滅相，亦知心垢相淨相、定相亂相等，",
        "translation": "If a practitioner wants to attain knowledge of the minds of others, he first observes his own mind and apprehends the characteristics of mind as arising, abiding, and ceasing, and also knows the characteristics of mind as dirty, pure, concentrated, confused, and so forth.",
        "source": "T15n0616_002:0296c08_23"
    },
    {
        "source_sentence": "復觀心所緣垢淨近遠多少等。",
        "translation": "Again, he observes the amount of defilement and purity in the mind's perceptual objects that are proximate and distant.",
        "source": "T15n0616_002:0296c10_24"
    },
    {
        "source_sentence": "自取內外心相已然，緣觀眾生色，取欲相心、瞋相心、慢相心、慳相心、嫉相心、憂相心、畏相心、語言音聲種種所作相心等，",
        "translation": "They themselves grasp the characteristics of mind internally and externally, conditioned by the images of sentient beings. They grasp the characteristics of desire, anger, pride, avarice, jealousy, grief, fear, speech, sounds, various forms of action, etc.; they also grasp the characteristics of craving, hatred, hypocrisy",
        "source": "T15n0616_002:0296c11_25"
    },
    {
        "source_sentence": "作是念：「佛如我心，生時住時滅時，彼亦如是。」",
        "translation": "He thought, The Buddha is like my mind, and so it is when he arises, abides, and ceases.",
        "source": "T15n0616_002:0296c13_26"
    },
    {
        "source_sentence": "自知心所緣，他亦如是。",
        "translation": "Knowing for themselves what is the object of awarenesses as supporting object, the same applies to others.",
        "source": "T15n0616_002:0296c14_27"
    },
    {
        "source_sentence": "我心有如是色相語言所作相，他亦如是。",
        "translation": "The mind of self has such form and such characteristic marks, as well as the characteristic marks made by speech. So it is with others.",
        "source": "T15n0616_002:0296c15_28"
    },
    {
        "source_sentence": "常修學心相，如是習已得他心通，是時但緣他心、心數法，如明眼者觀淨水中魚，",
        "translation": "He always cultivates the characteristics of his mind, and having cultivated them in this way, he attains the supernormal knowledge of the minds of others. At that moment, [he applies himself] only to the awarenesses of others and mental factors as objects: just as a man with clear eyesight observes a pure fish in water.",
        "source": "T15n0616_002:0296c16_29"
    },
    {
        "source_sentence": "有大小好醜悉皆見之；",
        "translation": "Both large and small, great and small, good and bad, they can be seen.",
        "source": "T15n0616_002:0296c18_30"
    },
    {
        "source_sentence": "雖有水覆，以水淨故不以為礙。",
        "translation": "Even though it's covered with water, it doesn't act as an obstruction because the water is pure.",
        "source": "T15n0616_002:0296c18_31"
    },
    {
        "source_sentence": "行者如是，知他心通力故，眾生雖身覆心而能見之，既得心通，或時在大眾說法，",
        "translation": "The practitioner is like this: because of the power of knowledge regarding the minds of others, beings can see them even though their bodies are covered with awarenesses. Having attained these awarenesses, sometimes they teach the Dharma to the assembly.",
        "source": "T15n0616_002:0296c19_32"
    },
    {
        "source_sentence": "先知其心，知是眾生以何深心、行何法、何因緣、有何相、喜何事，知自心清淨故，",
        "translation": "They know the minds of sentient beings, knowing what kind of profound mind they have, what mental states they have, what doctrines they practice, what causes and conditions, what characteristics they have, and what things they delight in. Because they know their own minds are pure:",
        "source": "T15n0616_002:0296c21_33"
    },
    {
        "source_sentence": "知眾生心亦可清淨。",
        "translation": "He knows that the minds of sentient beings can also be purified.",
        "source": "T15n0616_002:0296c23_34"
    },
    {
        "source_sentence": "如淨鏡中隨所有色，若長若短方圓麁細等，如本相現不增不減。",
        "translation": "It's like the color that follows all the forms in a pure mirror, whether long or short, square or round, coarse or fine, and so forth, just as the original characteristic shows neither increase nor decrease.",
        "source": "T15n0616_002:0296c23_35"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0616_002:0296c25_0"
    },
    {
        "source_sentence": "鏡清淨故。",
        "translation": "It's because the mirror is pure.",
        "source": "T15n0616_002:0296c25_1"
    },
    {
        "source_sentence": "鏡雖不分別而顯其相。",
        "translation": "Although the mirror doesn't discriminate, it shows its characteristics.",
        "source": "T15n0616_002:0296c25_2"
    },
    {
        "source_sentence": "行者亦如是，自心清淨故，諸法無一定相，常清淨故。",
        "translation": "Because the practitioner is also like this: because his own mind is pure, all factors have no fixed characteristic marks: because they are always pure.",
        "source": "T15n0616_002:0296c26_0"
    },
    {
        "source_sentence": "眾生心心數法皆悉知之，若眾中多婬欲者，即知其心，為說離婬欲法，",
        "translation": "He knows the minds and mental states of all sentient beings. If there is much sexual desire in the assembly, he knows their minds and teaches them the principle of freedom from sexual desire.",
        "source": "T15n0616_002:0296c27_1"
    },
    {
        "source_sentence": "恚癡亦如是。",
        "translation": "So it is with anger and delusion.",
        "source": "T15n0616_002:0296c28_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0616_002:0296c29_3"
    },
    {
        "source_sentence": "心實相無染無瞋無癡。",
        "translation": "The mind's true characteristics are without defilement, without anger, and without delusion.",
        "source": "T15n0616_002:0296c29_4"
    },
    {
        "source_sentence": "若眾中求聲聞乘者，亦知其心而為說法；",
        "translation": "Those in the assembly who sought the vehicle of the disciples also taught the Dharma by knowing their minds.",
        "source": "T15n0616_002:0296c29_5"
    },
    {
        "source_sentence": "雖為說法，知法性亦無有小。",
        "translation": "Even though he teaches the Dharma for them, he knows that there's no lesser Dharma nature.",
        "source": "T15n0616_002:0297a01_6"
    },
    {
        "source_sentence": "求辟支佛道者，亦知其心而為說法；",
        "translation": "Those who sought the path of the pratyekabuddhas also taught the Dharma for them, knowing their minds.",
        "source": "T15n0616_002:0297a02_7"
    },
    {
        "source_sentence": "雖為說法，知法性亦無有中。",
        "translation": "Even though they teach the Dharma for them, they know that there's no middle way to understand the nature of dharmas.",
        "source": "T15n0616_002:0297a03_8"
    },
    {
        "source_sentence": "若求大乘者，亦知其心而為說法；",
        "translation": "Those who seek the Great Vehicle also know their minds and teach the truth.",
        "source": "T15n0616_002:0297a03_9"
    },
    {
        "source_sentence": "雖為說法，知法性亦無有大。",
        "translation": "Even though he teaches the Dharma for them, he knows that there's no great Dharma nature.",
        "source": "T15n0616_002:0297a04_10"
    },
    {
        "source_sentence": "行者如是，等隨眾生心而為說法，亦不分別心相；",
        "translation": "Practitioners are like this, teaching the Dharma equally according to beings’ mental states, without discriminating characteristics of mind.",
        "source": "T15n0616_002:0297a05_11"
    },
    {
        "source_sentence": "雖分別三乘說法，而不壞法性；",
        "translation": "Though they analyze the teachings of the three vehicles, they do not destroy the essence of reality.",
        "source": "T15n0616_002:0297a06_12"
    },
    {
        "source_sentence": "不壞法性故悉知一切眾生心所行。",
        "translation": "Because it doesn't destroy the Dharma nature, it fully knows the mental actions of all sentient beings.",
        "source": "T15n0616_002:0297a07_13"
    },
    {
        "source_sentence": "雖自用心知他心，於彼此心無逆無順，亦知一切眾生心心相續如水流。",
        "translation": "Even though they know the minds of others with their own minds, they don't disagree or disagree with each other's minds, and they also know that the minds and minds of all sentient beings continue to flow like water.",
        "source": "T15n0616_002:0297a07_14"
    },
    {
        "source_sentence": "如知心性，法性亦如是，以他心智知眾生心而為說法，則不害也，是名知他心智神通。",
        "translation": "Knowing the mind's nature as it is and the Dharma nature as it is, knowing the minds of sentient beings with the knowledge of other minds and teaching them so that they won't be harmed, this is called knowing the mind's cognition of other minds with the supernormal ability.",
        "source": "T15n0616_002:0297a09_15"
    },
    {
        "source_sentence": "若行者欲知宿命，先自覺知今所經事、向所經事，轉至昨夜、昨日、前日，",
        "translation": "If a practitioner wants to know the past lives of others, he first knows for himself what he is doing now and what he will do in the future. He proceeds up to last night, yesterday, or the day before tomorrow.",
        "source": "T15n0616_002:0297a12_0"
    },
    {
        "source_sentence": "如是一月，從今歲乃至孩童，譬如行道，到所至處思惟憶念所經遊處。",
        "translation": "Thus, for example, it's like a month that goes from the present year to the time when he's a child, which is like walking on the path and thinking about where he's going and remembering where he's been.",
        "source": "T15n0616_002:0297a13_1"
    },
    {
        "source_sentence": "如是習已，善修定力故，憶念生時、處胎時，知某處死、此胎生，知是一世二世三世乃至百世千萬無量億世。",
        "translation": "Because of the power of cultivating concentration well, he remembers when he's born and places himself in a womb, knowing where he died and this womb was born, knowing one life, two lives, three lives, up to hundreds of thousands of millions of millions of lives.",
        "source": "T15n0616_002:0297a15_2"
    },
    {
        "source_sentence": "以宿命智，自知己身及他恒河沙劫所經由事，悉皆念知。",
        "translation": "By knowledge of past lives, they know for themselves the events that happened in their own bodies and others throughout the aeons as numerous as the grains of sand in the Ganges River.",
        "source": "T15n0616_002:0297a17_3"
    },
    {
        "source_sentence": "以宿命事教化眾生，作如是言：「我某處，如是姓字、如是生、如是壽命、所經苦樂。」",
        "translation": "He teaches and transforms sentient beings by the deeds of past lives and says, In a certain place, I have such-and-such a name, such-and-such birth, such-and-such life, and such-and-such pain and pleasure that I experience.",
        "source": "T15n0616_002:0297a18_4"
    },
    {
        "source_sentence": "亦說彼所經之事。",
        "translation": "It also explains the things that they teach.",
        "source": "T15n0616_002:0297a20_5"
    },
    {
        "source_sentence": "行者以宿命力故，知是眾生先世罪福因緣，所謂種聲聞因緣、辟支佛因緣、佛因緣，",
        "translation": "Because of the power of past lives, practitioners know that these are the causes and conditions for sins and merits of sentient beings from previous lives. These are called the causes and conditions for planting śrāvakas, the causes and conditions for pratyekabuddhas and the causes and conditions for buddhas.",
        "source": "T15n0616_002:0297a21_6"
    },
    {
        "source_sentence": "隨其因緣而為說法。",
        "translation": "He teaches the Dharma according to its causes and conditions.",
        "source": "T15n0616_002:0297a23_7"
    },
    {
        "source_sentence": "復次行者宿命智力故，自知從諸佛種善根不迴向阿耨多羅三藐三菩提，",
        "translation": "“Furthermore, practitioners, because of the power of knowledge regarding past lives, know for themselves that they are planting roots of goodness from buddhas and not dedicating them back to unexcelled complete perfect enlightenment.",
        "source": "T15n0616_002:0297a23_8"
    },
    {
        "source_sentence": "今當迴向阿耨多羅三藐三菩提。",
        "translation": "Now, he'll return to unsurpassed, correct, and complete enlightenment.",
        "source": "T15n0616_002:0297a25_9"
    },
    {
        "source_sentence": "行者亦知過去諸法滅時無所去，知未來世諸法生時無所從來。",
        "translation": "Practitioners also know that there's no place to go when past dharmas cease, and they know that there's no place where future dharmas will come from when they arise.",
        "source": "T15n0616_002:0297a26_0"
    },
    {
        "source_sentence": "雖知過去世無始，不生無始見；",
        "translation": "Though they know past lives are beginningless, they do not give rise to views of beginninglessness.",
        "source": "T15n0616_002:0297a27_1"
    },
    {
        "source_sentence": "雖觀未來世眾生滅入涅槃，亦不生邊見。",
        "translation": "Even though he observes the cessation of sentient beings in future lives and enters nirvāṇa, he doesn't give rise to extreme views.",
        "source": "T15n0616_002:0297a28_2"
    },
    {
        "source_sentence": "行者念宿命時，增益諸善根，及滅無量世罪因緣。",
        "translation": "When practitioners are mindful of past lives, they'll increase the causes and conditions for good roots and cease measureless worldly sins.",
        "source": "T15n0616_002:0297a29_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0616_002:0297b01_4"
    },
    {
        "source_sentence": "知一切法無新相、無故相。",
        "translation": "He knows that all dharmas lack new and old marks.",
        "source": "T15n0616_002:0297b01_5"
    },
    {
        "source_sentence": "得如是智慧已，觀一切有為法及所經生死苦樂，如夢中所見，以是故於生死中心不生厭，",
        "translation": "Having attained such knowledge, they observe all conditioned things and the pains and pleasures of birth and death as seen in a dream. Because of this, they do not give rise to disillusionment in the midst of birth and death.",
        "source": "T15n0616_002:0297b02_0"
    },
    {
        "source_sentence": "於一切眾生而起悲心，知一切法皆是作相，作是念：「如我千萬億無量劫往來生死，",
        "translation": "They become compassionate toward all sentient beings and know that all dharmas are all deeds, and they think, “Suppose I were to go back and forth in birth and death for thousands of myriads of koṭis of kalpas.",
        "source": "T15n0616_002:0297b04_0"
    },
    {
        "source_sentence": "皆為虛妄非實；",
        "translation": "They are all false and not real.",
        "source": "T15n0616_002:0297b05_1"
    },
    {
        "source_sentence": "一切眾生來往生死皆亦如是。",
        "translation": "So it is with all sentient beings who come and go in birth-and-death.",
        "source": "T15n0616_002:0297b06_2"
    },
    {
        "source_sentence": "若無四大四陰者，是則為實，四大四陰亦畢竟不生。」",
        "translation": "If there are no four aggregates of the four elements, then this is real, and the four elements and four aggregates of the elements also ultimately don't arise.",
        "source": "T15n0616_002:0297b06_3"
    },
    {
        "source_sentence": "復次行者以宿命智憶念，曾為轉輪聖王，所受之樂無常磨滅，釋提桓因樂亦無常磨滅，",
        "translation": "“Furthermore, the practitioner remembers with knowledge of past lives that he was once a universal ruler. The bliss he receives is impermanent and will not be subject to decay or disappearance; neither is the happiness of King Śakra’s causal bliss impermanent and will not be subject to decay or disappearance.",
        "source": "T15n0616_002:0297b08_4"
    },
    {
        "source_sentence": "有諸國土清淨莊嚴，及諸菩薩諸佛上妙之色，轉於法輪皆悉無常，何況餘事？",
        "translation": "There are pure adornments of all lands, and the supremely beautiful forms of enlightening beings and buddhas that turn the wheel of the Dharma are all impermanent, so why wouldn't there be anything else?",
        "source": "T15n0616_002:0297b10_5"
    },
    {
        "source_sentence": "念如是已心厭遠離。",
        "translation": "After he thinks this, his mind becomes disillusioned and secluded.",
        "source": "T15n0616_002:0297b11_6"
    },
    {
        "source_sentence": "行者依宿命智入無常空，觀一切諸法皆空無常，而眾生顛倒故著。",
        "translation": "Practitioners rely on the knowledge of past lives to enter impermanent emptiness and observe that all dharmas are empty and impermanent, but sentient beings are mistakenly attached.",
        "source": "T15n0616_002:0297b12_7"
    },
    {
        "source_sentence": "為是眾生故而生悲心，行是悲心，漸漸得成大悲。",
        "translation": "Because it's for the sake of sentient beings that they give rise to compassion, and by practicing this compassion, they gradually attain great compassion.",
        "source": "T15n0616_002:0297b13_8"
    },
    {
        "source_sentence": "得大悲已，十方諸佛念是菩薩、讚歎其德，是名宿命神通。",
        "translation": "Having attained great compassion, the buddhas of the ten directions are mindful of this bodhisattva and praise his virtue, which is called the supernormal power of past lives.",
        "source": "T15n0616_002:0297b15_9"
    },
    {
        "source_sentence": "若行者欲求天眼者，初取明光相，所謂燈火明珠、日月星宿等。",
        "translation": "If a practitioner wants to pursue the divine eye, he first takes the characteristic of luminosity, which is called the bright pearl of lamplight, sun, moon, stars, constellations, and so forth.",
        "source": "T15n0616_002:0297b17_0"
    },
    {
        "source_sentence": "取是明相已，若晝日則閉目，夜則無在念上明相如眼所見。",
        "translation": "After grasping this luminous characteristic, if he closes his eyes during the day and night, there's no luminous characteristic above his mind that's seen by the eye.",
        "source": "T15n0616_002:0297b18_1"
    },
    {
        "source_sentence": "常修習明念，繫心在明不令他念，若去攝還心得一處。",
        "translation": "He always cultivates mindfulness of insight, fixes his mind on insight and doesn't allow others to think about it, and if he leaves it, gathers it back into one place in his mind.",
        "source": "T15n0616_002:0297b19_2"
    },
    {
        "source_sentence": "是時色界四大所造清淨之色在此眼中，是名天眼，以天四大造故，名為天眼，",
        "translation": "At that time, the pure form created by the four elements in the realm of form is present in this eye. This is called divine vision because it is produced by the four elements in the realm of form.",
        "source": "T15n0616_002:0297b21_0"
    },
    {
        "source_sentence": "又諸賢聖清淨眼故，名為天眼。",
        "translation": "Also, because the good and noble people have pure eyes, they're called the divine eye.",
        "source": "T15n0616_002:0297b22_1"
    },
    {
        "source_sentence": "行者得是天眼已，諸山樹木、鐵圍、須彌及諸國土，都無障蔽、以無礙眼，",
        "translation": "Having obtained these divine visions, the practitioner has unobstructed and unobstructed vision in all the mountains, trees, iron ranges, summits, and other lands.",
        "source": "T15n0616_002:0297b23_2"
    },
    {
        "source_sentence": "能見十方無量阿僧祇諸佛及莊嚴國土。",
        "translation": "They can see measureless incalculable buddhas and adorned lands in the ten directions.",
        "source": "T15n0616_002:0297b25_3"
    },
    {
        "source_sentence": "爾時行者能知一切佛為一佛，又見一佛為一切佛，以法性不壞故。",
        "translation": "At that point, practitioners can know that all buddhas are one buddha and see one buddha as all buddhas because the Dharma nature doesn't break down.",
        "source": "T15n0616_002:0297b26_0"
    },
    {
        "source_sentence": "如見佛相，自見身相亦如是。",
        "translation": "Just as they see the marks of buddhas, so they themselves see the marks of their own bodies.",
        "source": "T15n0616_002:0297b27_1"
    },
    {
        "source_sentence": "自身相淨故，一切法相亦如是。",
        "translation": "Because their own characteristics are pure, so are all the characteristics of dharmas.",
        "source": "T15n0616_002:0297b28_2"
    },
    {
        "source_sentence": "如見佛清淨。",
        "translation": "It's like seeing the Buddha's purity.",
        "source": "T15n0616_002:0297b28_3"
    },
    {
        "source_sentence": "弟子亦爾，無有二相。",
        "translation": "So it is with the disciple, who has no dual characteristics.",
        "source": "T15n0616_002:0297b29_4"
    },
    {
        "source_sentence": "及十方無量國土眾生，若地獄、畜生、餓鬼、人、天，除無色者，生死好醜皆悉見之，",
        "translation": "and the sentient beings of measureless lands in the ten directions, whether hells, animals, hungry ghosts, humans, or gods, with the exception of the formless, they all see birth and death as beautiful and ugly.",
        "source": "T15n0616_002:0297b29_5"
    },
    {
        "source_sentence": "皆知十方六道眾生業因緣及果報：是眾生以善業因緣故生天人中，是眾生以不善業因緣故生三惡道中。",
        "translation": "They all know the causes, conditions, and consequences of the actions of sentient beings in the six destinies in the ten directions: these are sentient beings who are born among gods and humans because of the causes and conditions of good actions, which are sentient beings who are born in the three bad destinies because of the causes and conditions of unskillful actions.",
        "source": "T15n0616_002:0297c02_6"
    },
    {
        "source_sentence": "行者於天眼中得智慧力故，雖見眾生不生眾生想，一切法無眾生想故；",
        "translation": "Because practitioners attain the power knowledge of wisdom in the eyes of gods. Though they see beings, they do not give rise to conceptions of beings because all things are without conceptions of beings.",
        "source": "T15n0616_002:0297c04_7"
    },
    {
        "source_sentence": "雖見業及果報相續，亦入一切法無業無果報中。",
        "translation": "Even though they see the continuity of action and its retribution, they also enter all things without action or retribution.",
        "source": "T15n0616_002:0297c06_8"
    },
    {
        "source_sentence": "雖天眼見一切色，以智慧力故亦不取色相，是色悉皆空故。",
        "translation": "Even though the divine eye sees all forms, it doesn't grasp form and characteristics because of the power of wisdom, because form is completely empty.",
        "source": "T15n0616_002:0297c07_9"
    },
    {
        "source_sentence": "復次若障若不障、近遠上下，無不悉見。",
        "translation": "Furthermore, whether obstructed or unobstructed, near or distant, above or below, there's nothing that isn't fully visible.",
        "source": "T15n0616_002:0297c09_10"
    },
    {
        "source_sentence": "行者見色界諸天清淨微形者，而彼不見，乃至大天亦復不見，如是等種種神通義，",
        "translation": "When the practitioner sees the pure subtle forms of the gods of the realm of form, they don’t see them, and even the great gods don’t see them either. Such are the various meanings of mystical powers:",
        "source": "T15n0616_002:0297c09_11"
    },
    {
        "source_sentence": "如摩訶衍神通義中廣說。",
        "translation": "As explained in detail in Mahāyāna's explanation of the meaning of supernormal abilities.",
        "source": "T15n0616_002:0297c11_12"
    },
    {
        "source_sentence": "禪法要解卷下",
        "translation": "Second Fascicle of the Essential Understanding of the Chan Dharma, Volume II",
        "source": "T15n0616_002:0297c13_0"
    }
]