[
    {
        "source_sentence": "佛藏經卷中",
        "translation": "Fozang jing zhong",
        "source": "T15n0653_002:0789c15_0"
    },
    {
        "source_sentence": "姚秦龜茲三藏鳩摩羅什譯",
        "translation": "Yaoqin Kumārajīva's Translation of the Tripiṭaka of Kuci, translated by Kumārajīva",
        "source": "T15n0653_002:0789c17_0"
    },
    {
        "source_sentence": "淨戒品之餘",
        "translation": "the rest of the chapter on pure precepts",
        "source": "T15n0653_002:0789c18_0"
    },
    {
        "source_sentence": "◎「復次舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T15n0653_002:0789c19_0"
    },
    {
        "source_sentence": "破戒比丘聞佛所說如是等經，心不清淨歡喜信樂，自知有過便疑此經：『為我等說不為餘人。",
        "translation": "When a monk who breaks the precepts hears such sūtras taught by the Buddha, his mind isn't pure and rejoices with faith. Knowing for himself that there are errors, he doubts this sūtra, saying, 'Explain it for us and not for others.",
        "source": "T15n0653_002:0789c19_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0789c21_2"
    },
    {
        "source_sentence": "如我等比丘在此事故。』",
        "translation": "Suppose we monks are here in this matter.'",
        "source": "T15n0653_002:0789c21_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0789c22_4"
    },
    {
        "source_sentence": "如是上妙無比之法，破戒比丘乃生瞋恨，於說法者心多不信，得聞如是佛所說經，",
        "translation": "Such a monk who breaks the precepts becomes angry at this most sublime and incomparable teaching. Most of the Dharma preacher’s minds do not believe in it, and they are able to hear such scriptures as those taught by the Buddha.",
        "source": "T15n0653_002:0789c22_5"
    },
    {
        "source_sentence": "違逆不受，而作是言：『此非佛說，教語餘人。』",
        "translation": "They disagreed and didn't accept it, saying, 'This isn't what the Buddha teaches or tells others.'",
        "source": "T15n0653_002:0789c24_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0789c25_7"
    },
    {
        "source_sentence": "破戒比丘不樂修道，修道比丘不逆佛語。",
        "translation": "A monk who breaks the precepts doesn't delight in cultivating it, and a monk who cultivates it doesn't contradict the Buddha's words.",
        "source": "T15n0653_002:0789c25_8"
    },
    {
        "source_sentence": "此皆破戒愚癡惡法，謂心不信違逆佛語。",
        "translation": "These are all bad qualities that destroy precepts and foolishness, which are the mind's lack of faith and disobedience to the Buddha's words.",
        "source": "T15n0653_002:0789c26_9"
    },
    {
        "source_sentence": "如是比丘自知有過，但生瞋恨憍慢佷戾，惡邪慢心謗佛法僧。",
        "translation": "Thus, a monk knows for himself that there's a mistake but becomes angry, arrogant, and wicked, with bad intentions and conceit, he denigrates the Buddha, Dharma, and Saṃgha.",
        "source": "T15n0653_002:0789c27_10"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0789c28_11"
    },
    {
        "source_sentence": "隨此比丘聞是諸經違逆不信，心不通達無上菩提，教語諸人：『非佛所說』。",
        "translation": "Following this monk who hears these sūtras and doesn't believe in them, his mind doesn't comprehend unsurpassed enlightenment, and he teaches people to say, 'It's not what the Buddha teaches.'",
        "source": "T15n0653_002:0789c28_12"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790a01_13"
    },
    {
        "source_sentence": "佛說是人則為謗法。",
        "translation": "The Buddha teaches that this person is someone who denigrates the Dharma.",
        "source": "T15n0653_002:0790a01_14"
    },
    {
        "source_sentence": "以謗法故為非沙門、非釋種子，應當滅擯。",
        "translation": "Because they denigrate the teaching, they're not ascetics or non-Buddhist seeds, and they should cease anger.",
        "source": "T15n0653_002:0790a02_15"
    },
    {
        "source_sentence": "是等比丘，若百千萬億諸佛三輪示現，不能令悟使得道果。",
        "translation": "If these monks are shown in the three wheels by hundreds of thousands of myriads of koṭis of buddhas, they won't be able to awaken them and make them realize the fruit of the path.",
        "source": "T15n0653_002:0790a03_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0790a04_17"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790a04_18"
    },
    {
        "source_sentence": "如是惡人於此法中自作障道，無復生分、無有信心，但好衣食貪樂世利，",
        "translation": "Thus, bad people themselves create obstacles in the path of these teachings, no longer producing parts or having faith, but preferring clothing and food and crave worldly gain.",
        "source": "T15n0653_002:0790a04_19"
    },
    {
        "source_sentence": "我說此人必墮地獄。",
        "translation": "I say this person will surely fall into hell.",
        "source": "T15n0653_002:0790a06_20"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0790a06_21"
    },
    {
        "source_sentence": "我今明了告汝，若人違逆如是法寶，於好生處永無有分，但生惡處常盲無目。",
        "translation": "Now, I'll clearly tell you that if someone disobeys such a treasure of the Dharma, they'll never have any part in good places where they're born, but they'll always be blind and without eyes when they're born in bad places.",
        "source": "T15n0653_002:0790a07_22"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790a08_23"
    },
    {
        "source_sentence": "是諸比丘憍慢熾盛不能定說，破我正法，其餘眾人不能自活，為利養故隨破我法。",
        "translation": "These monks are arrogant and overweeningly arrogant, unable to teach with certainty. They disparage the true-dharma that belongs to me. The other members of the sangha will not be able to live on their own. For profit they follow others who disparage my dharma.",
        "source": "T15n0653_002:0790a09_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790a10_1"
    },
    {
        "source_sentence": "如是法寶爾時壞滅。",
        "translation": "Thus, the treasure of the Dharma then perishes.",
        "source": "T15n0653_002:0790a11_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0790a11_3"
    },
    {
        "source_sentence": "如是法寶一切諸佛皆共恭敬，諸辟支佛、阿羅漢等亦皆恭敬。",
        "translation": "Thus, all the buddhas of the Dharma treasure are respected by all the buddhas, and so are the pratyekabuddhas and arhats.",
        "source": "T15n0653_002:0790a11_4"
    },
    {
        "source_sentence": "「破戒比丘、增上慢者、不定說法諸比丘等，爾時皆共輕慢我法而共遠離，",
        "translation": "Monks who break precepts, those who are overweeningly conceited, and those monks who don't teach the Dharma with certainty will all at that point despise my teaching together and part with it.",
        "source": "T15n0653_002:0790a13_5"
    },
    {
        "source_sentence": "多懷慳貪專求生業，貴於財利嫉妬所縛，常好諍訟互生怨隙，不相敬順無有威儀，",
        "translation": "They often harbor stinginess and greed, focusing on the pursuit of productive activities. They value wealth and profit but are bound by jealousy. They always like disputes and arguments among themselves, creating enemies and antagonisms. They do not obey one another and have no manner.",
        "source": "T15n0653_002:0790a14_6"
    },
    {
        "source_sentence": "志性輕躁猶如獼猴，轉易威儀行諸惡業，退沙門法遠離賢聖。",
        "translation": "Their aspiration is light and impetuous like a rhesus monkey, changing their manner and committing bad actions, regressing from the ascetic practices of śramaṇas and far removed from the noble ones.",
        "source": "T15n0653_002:0790a16_7"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790a17_8"
    },
    {
        "source_sentence": "如是惡人覆藏瑕疵，多欲多求以財自活，惡魔知心為作方便，令其乖異各共散壞，",
        "translation": "Thus, bad people hide their flaws and often want to seek riches for their own livelihood. Evil Māra knows the mind as a means of doing so, causing divergence and disunity to disintegrate together.",
        "source": "T15n0653_002:0790a18_9"
    },
    {
        "source_sentence": "一味僧寶分為五部。",
        "translation": "The single flavor of the saṃgha treasure is divided into five divisions.",
        "source": "T15n0653_002:0790a20_0"
    },
    {
        "source_sentence": "既有五部則生諍訟，互相是非論說過失。",
        "translation": "Since there are five divisions, they give rise to disputes and arguments, discussing each other's faults with what's right and wrong.",
        "source": "T15n0653_002:0790a20_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790a21_2"
    },
    {
        "source_sentence": "如今比丘互相教化互相恭敬，同心共行隨順佛語。",
        "translation": "Now, the monks are teaching each other and respecting each other, following the Buddha's words with one mind and one practice.",
        "source": "T15n0653_002:0790a21_3"
    },
    {
        "source_sentence": "爾時比丘不相教化不相恭敬，見作惡者畏而捨去，不能以法共相教誨。",
        "translation": "At that point, the monks don't teach each other and don't respect each other, and when they see evil, they fearfully abandon it and can't teach it in common with each other according to the teaching.",
        "source": "T15n0653_002:0790a22_4"
    },
    {
        "source_sentence": "或時雖有多聞深智，猶懷憍慢輕賤餘人，各以所是自立其論，不喜相見況能受教？",
        "translation": "Sometimes, even though they're well-versed and profoundly wise, they still harbor arrogance and despise other people, each establishing their own theories based on what they have, and they don't like to see each other, so why wouldn't they be able to receive the teaching?",
        "source": "T15n0653_002:0790a24_5"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0790a26_6"
    },
    {
        "source_sentence": "如來在世三寶一味，我滅度後分為五部。",
        "translation": "The Tathāgata lives in the world with the single flavor of the Three Treasures, and after I pass away, I'll be divided into five groups.",
        "source": "T15n0653_002:0790a26_7"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790a27_8"
    },
    {
        "source_sentence": "惡魔於今猶尚隱身，佐助調達破我法僧，如來大智現在世故，弊魔不能成其大惡。",
        "translation": "A bad demon is still in hiding now, assisting and taming us to break our teachings and saṃgha, and because the Tathāgata's great wisdom is present in the world, a bad demon can't create its great evil.",
        "source": "T15n0653_002:0790a27_9"
    },
    {
        "source_sentence": "當來之世惡魔變身，作沙門形入於僧中，種種邪說令多眾生入於邪見為說邪法，",
        "translation": "In the future world, a bad demon transforms his body into an ascetic and enters the saṃgha in the form of a monk, teaching various wrong theories so that many sentient beings will enter wrong views and teach wrong doctrines.",
        "source": "T15n0653_002:0790a29_10"
    },
    {
        "source_sentence": "謂彌樓陀羅迦樓。",
        "translation": "It's called Maitreya Kālāma.",
        "source": "T15n0653_002:0790b02_11"
    },
    {
        "source_sentence": "鬪事五分，事念念滅、事一切有、事有、我事、有所得事。",
        "translation": "The duty of fighting is fivefold: the duty of mindfulness and cessation, the duty of everything that exists, the duty of existence, the duty of self, and the duty of possession.",
        "source": "T15n0653_002:0790b02_12"
    },
    {
        "source_sentence": "爾時惡魔說如是等邪貪著事，如是事者，非諸佛及佛弟子所說。",
        "translation": "At the time, bad demons say these kinds of things that are wrongly attached, and such things aren't explained by the buddhas or their disciples.",
        "source": "T15n0653_002:0790b03_13"
    },
    {
        "source_sentence": "爾時惡人為魔所迷，各執所見我是彼非。",
        "translation": "At that point, bad people are deluded by Māra, each holding to the view that they are self and what's not self.",
        "source": "T15n0653_002:0790b05_14"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790b06_15"
    },
    {
        "source_sentence": "如來豫見未來世中，有如是等破法事故，說是深經悉斷惡魔諸所執著。",
        "translation": "The Tathāgata foresees that there will be such things in the future that break the Dharma, and he teaches this profound sūtra to completely end bad demonic attachments.",
        "source": "T15n0653_002:0790b06_16"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0790b08_17"
    },
    {
        "source_sentence": "當爾之時，閻浮提內多是增上慢人，作小善順便謂得道，命終之後當墮惡趣。",
        "translation": "At the time, there were many arrogant people in Jambudvīpa who did little good deeds and then said they'd attain the path, and after their lives ended, they'd fall into a bad destiny.",
        "source": "T15n0653_002:0790b08_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0790b10_19"
    },
    {
        "source_sentence": "是人長夜自謂得道，亦復稱說他人得道，冒受聖人所供養事，是人於諸天人世間為大惡賊。",
        "translation": "For a long time, that person has claimed to have attained the path and also praised the attainment of it for others, daring to accept the offerings offered by the sages, which makes them great bad thieves among gods and humans in the world.",
        "source": "T15n0653_002:0790b10_20"
    },
    {
        "source_sentence": "如是癡人聞說第一實義，驚疑怖畏如墮深坑。",
        "translation": "Thus, when a deluded person hears the teaching of the ultimate truth, they're frightened and fearful like falling into a deep pit.",
        "source": "T15n0653_002:0790b12_21"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790b13_22"
    },
    {
        "source_sentence": "有諸比丘樂此事者，相與共集破壞諸佛無上菩提。",
        "translation": "If there are monks who delight in this, they'll gather together with each other to destroy the unsurpassed enlightenment of the buddhas.",
        "source": "T15n0653_002:0790b13_23"
    },
    {
        "source_sentence": "爾時增上慢人偏執者多，惡魔又復迷惑在家、出家者心，令執非法。",
        "translation": "At that point, there are many arrogant people who partially cling to it, and bad Māra also confuses the minds of those who remain householders and renunciants and causes them to cling to what's unlawful.",
        "source": "T15n0653_002:0790b14_24"
    },
    {
        "source_sentence": "說正法者少於援助，則便散壞不復得立。",
        "translation": "If someone teaches the right teaching with little assistance, then they'll disintegrate and no longer be able to establish it.",
        "source": "T15n0653_002:0790b16_25"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0790b17_26"
    },
    {
        "source_sentence": "爾時世間年少比丘多有利根。",
        "translation": "At the time, there were many young monks in the world who had sharp faculties.",
        "source": "T15n0653_002:0790b17_27"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T15n0653_002:0790b18_28"
    },
    {
        "source_sentence": "諸出家者有餘煩惱，還生人中即復出家。",
        "translation": "Those who leave home have residual afflictions, and when they return to be born among humans, they'll again leave home.",
        "source": "T15n0653_002:0790b18_29"
    },
    {
        "source_sentence": "是諸比丘喜樂難問，推求佛法第一實義。",
        "translation": "These monks were delighted with the difficult questions and presumed to seek the supreme true meaning of the Buddha's teaching.",
        "source": "T15n0653_002:0790b19_30"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790b20_31"
    },
    {
        "source_sentence": "爾時增上慢者，魔所迷惑但求活命，實是凡夫自稱羅漢，謂諸年少比丘等言：『善身口意，",
        "translation": "At the time, those with excessive conceit were deluded by Māra and simply seeking to live. It was really ordinary people who claimed to be arhats, saying to young monks and others, 'Good body, speech, and thought!",
        "source": "T15n0653_002:0790b20_32"
    },
    {
        "source_sentence": "此是佛法第一實義。",
        "translation": "This is the first true meaning of the Buddha's teaching.",
        "source": "T15n0653_002:0790b22_33"
    },
    {
        "source_sentence": "善護淨戒，讀誦經法勤修多聞，是名順忍因緣，所謂淨心信佛；",
        "translation": "Good observance of pure precepts, recitation of scriptures and doctrines, diligently cultivating wide learning, these are called the causes and conditions for compliant patience.",
        "source": "T15n0653_002:0790b22_34"
    },
    {
        "source_sentence": "又有第一實義，汝當繫心緣中，專念涅槃滅三種苦，則能厭離五陰、十二入、十八界。",
        "translation": "Also, there's the first real meaning of this, which is that you should focus on nirvāṇa and cease the three kinds of suffering in the mind as a condition, so that you can become disillusioned with the five aggregates, 12 sense-fields, and 18 elements.",
        "source": "T15n0653_002:0790b24_35"
    },
    {
        "source_sentence": "汝等當於靜處觀此陰、界、入法悉皆無常，自觀其身種種不淨，汝等能如是觀，",
        "translation": "“Friends, you should contemplate the aggregates, the elements, and the sense-fields—all impermanent in their state of quiescence. You should also contemplate the various impurities that are inherent in your bodies.",
        "source": "T15n0653_002:0790b26_36"
    },
    {
        "source_sentence": "當得須陀洹果。",
        "translation": "He'll attain the fruit of stream entry.",
        "source": "T15n0653_002:0790b27_37"
    },
    {
        "source_sentence": "又能於是五陰等法，深觀無常、苦、空、無我、無有堅牢，則得斯陀含，",
        "translation": "If they can also deeply contemplate these five aggregates, such as impermanence, suffering, emptiness, selflessness, and nonexistence of firmness, then they'll attain the once-returner.",
        "source": "T15n0653_002:0790b28_38"
    },
    {
        "source_sentence": "轉復深觀得阿那含、得阿羅漢，是為第一實義。』",
        "translation": "To further deeply observe and attain the acquisition of non-returner and arhatship is the first true meaning.'",
        "source": "T15n0653_002:0790b29_39"
    },
    {
        "source_sentence": "「是中年少比丘復問：『於佛法中阿羅漢果，便是第一義耶！",
        "translation": "Again, the young monk asked, 'Is the arhatship of the Buddha's teaching the ultimate truth?'",
        "source": "T15n0653_002:0790c01_40"
    },
    {
        "source_sentence": "我等亦知是事，得阿羅漢是第一義。",
        "translation": "We also know these things, and attaining arhatship is the first meaning.",
        "source": "T15n0653_002:0790c03_0"
    },
    {
        "source_sentence": "今此五陰，為憶念者生，為不憶念者生？』",
        "translation": "Now, are these five aggregates produced by those who remember them and those who don't?'",
        "source": "T15n0653_002:0790c03_1"
    },
    {
        "source_sentence": "答言：『是五陰者憶念者生，不憶念者不生。』",
        "translation": "He answered, 'These five aggregates are produced by those who remember them, and those who don't remember them won't arise.'",
        "source": "T15n0653_002:0790c04_2"
    },
    {
        "source_sentence": "復問：『憶念與五陰為異不？』",
        "translation": "Again, he asked, 'Is mindfulness different from the five aggregates?'",
        "source": "T15n0653_002:0790c05_3"
    },
    {
        "source_sentence": "答言：『如五陰，憶念亦爾！』",
        "translation": "He replied, 'So is recollection like the five aggregates!'",
        "source": "T15n0653_002:0790c06_4"
    },
    {
        "source_sentence": "復問：『若如五陰，憶念亦爾者，誰是念五陰者？』",
        "translation": "Again, he asked, 'If it's like the five aggregates and so is recollection, who is mindful of the five aggregates?'",
        "source": "T15n0653_002:0790c06_5"
    },
    {
        "source_sentence": "答言：『若無念五陰者，則無涅槃；",
        "translation": "Answer: If there were no mindfulness of the five aggregates, there would be no nirvana.",
        "source": "T15n0653_002:0790c07_6"
    },
    {
        "source_sentence": "實有念五陰者，是故有修八直聖道，入涅槃者。』",
        "translation": "If someone really has mindfulness of the five aggregates, this is why they cultivate the eightfold noble path and enter nirvāṇa.'",
        "source": "T15n0653_002:0790c08_7"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0790c09_8"
    },
    {
        "source_sentence": "未來世中多有比丘成就此忍。",
        "translation": "In the future, there will be many monks who achieve this forbearance.",
        "source": "T15n0653_002:0790c09_9"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790c10_10"
    },
    {
        "source_sentence": "爾時會中多諸天眾，欲聞佛法第一實義。",
        "translation": "At the time, there were many gods in the assembly who wanted to hear the most true meaning of the Buddha's teaching.",
        "source": "T15n0653_002:0790c10_11"
    },
    {
        "source_sentence": "聞是增上慢者所說，心生疑悔如墮深坑，咸作是言：『咄哉！",
        "translation": "When they hear this teaching from a person of overweening conceit, their minds become doubtful and regretful like falling into a deep pit, and they all say, 'Duh!'",
        "source": "T15n0653_002:0790c11_12"
    },
    {
        "source_sentence": "釋迦牟尼佛法今將速滅。』",
        "translation": "Now, the Śākyamuni Buddha's teaching will quickly cease.'",
        "source": "T15n0653_002:0790c12_13"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790c13_14"
    },
    {
        "source_sentence": "中有成就善根比丘，謂是比丘：『癡人、空老、增上慢者。』",
        "translation": "Among them, there's the monk who has accomplished good roots, which is a monk who says, 'A foolish man, an empty old man, or someone with excessive conceit.'",
        "source": "T15n0653_002:0790c13_15"
    },
    {
        "source_sentence": "若有五陰相、十二入、十八界相者，不受此語不喜不悅從座起去。",
        "translation": "If someone has the characteristics of the five aggregates, 12 sense-fields, and 18 elements, they won't accept these words, don't rejoice, and don't delight in them.",
        "source": "T15n0653_002:0790c14_16"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790c16_17"
    },
    {
        "source_sentence": "爾時諸天心大歡喜，四方唱言：『釋迦牟尼佛猶有好弟子在，是諸人等善根不少，",
        "translation": "At that moment the gods were greatly delighted and called out in all directions, “There are still good disciples of the Buddha Śākyamuni. These people have already accumulated a great deal of roots of goodness.",
        "source": "T15n0653_002:0790c16_18"
    },
    {
        "source_sentence": "不喜聞是不淨所說，謂：我見、人見。』",
        "translation": "They don't like hearing what's unclean, which is to say, 'I see and people see.'",
        "source": "T15n0653_002:0790c18_19"
    },
    {
        "source_sentence": "諸天聞此皆大歡喜，稱揚讚歎是利根者，喜樂問難必皆成就無生法忍。",
        "translation": "When the gods hear this, they all rejoice greatly and praise those with sharp faculties who praise and praise it, and if they delight in questions and difficulties, they'll surely attain the forbearance of the nonarising Dharma.",
        "source": "T15n0653_002:0790c19_20"
    },
    {
        "source_sentence": "如是人等合集一處共為徒侶，人眾既少勢力亦弱。",
        "translation": "Thus, these people gather together in one place to be companions, and since the number of people is small, their power is weak.",
        "source": "T15n0653_002:0790c20_21"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0790c22_0"
    },
    {
        "source_sentence": "爾時我諸真子！",
        "translation": "At that point, we true sons!",
        "source": "T15n0653_002:0790c22_1"
    },
    {
        "source_sentence": "於父種族尚無愛語，況得供養住止塔寺？",
        "translation": "How could they make offerings and stay in a stūpa or temple if their father's family didn't speak lovingly?",
        "source": "T15n0653_002:0790c22_2"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790c23_3"
    },
    {
        "source_sentence": "汝且觀之，爾時如來便為輕微，我滅度後我諸子等，成就善寂無所得忍時亦為輕賤。",
        "translation": "At that point, the Tathāgata will be despised, and after my parinirvāṇa, we children will also be despised when they achieve good quiescence and ungraspable forbearance.",
        "source": "T15n0653_002:0790c23_4"
    },
    {
        "source_sentence": "我以是故，於無數劫摧諸怨敵，化諸一切天王、人王令心清淨，所以爾者，",
        "translation": "Because of this, over countless eons I have conquered all enemies and opponents. My teaching has purified the minds of all heavenly kings and human kings.",
        "source": "T15n0653_002:0790c25_5"
    },
    {
        "source_sentence": "令我諸子得安父位。",
        "translation": "I'll cause my children to attain the position of father.",
        "source": "T15n0653_002:0790c27_6"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0790c27_7"
    },
    {
        "source_sentence": "如來今以一切世間天人為證，如來如法得阿耨多羅三藐三菩提，轉無上法輪；",
        "translation": "The Buddha now realizes it for the sake of all worldly gods and humans. The Buddha, having attained unexcelled complete perfect enlightenment in accordance with the Dharma, turns the wheel of the unexcelled teaching.",
        "source": "T15n0653_002:0790c27_8"
    },
    {
        "source_sentence": "沙門、婆羅門，若天、魔、梵所不能轉。",
        "translation": "An ascetic or a brāhmaṇa can't be transformed by gods, Māra, or Brahmā.",
        "source": "T15n0653_002:0790c29_9"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0791a01_10"
    },
    {
        "source_sentence": "如是現事，如來滅後我此阿耨多羅三藐三菩提，我諸弟子等欲廣流布，",
        "translation": "In this way, in the present life, after the parinirvāṇa of the Tathāgata, I attain highest, complete enlightenment. My disciples and I want to spread it widely.",
        "source": "T15n0653_002:0791a01_11"
    },
    {
        "source_sentence": "是諸惡人不能證明，亦復不能施與無畏。",
        "translation": "These bad people can't prove it, and they can't give it to someone without fear.",
        "source": "T15n0653_002:0791a03_12"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0791a04_13"
    },
    {
        "source_sentence": "譬如蜜瓶置四衢道，而作是言：『若人能食一毛頭者，常不老死。』",
        "translation": "It's like when a bottle of honey is placed on the four side streets and says, 'If someone can eat a hairtip, they'll always not grow old and die.'",
        "source": "T15n0653_002:0791a04_14"
    },
    {
        "source_sentence": "爾時諸天世人各以刀杖衛護是瓶。",
        "translation": "It was then that the gods and humans each guarded the vase with their swords and sticks.",
        "source": "T15n0653_002:0791a05_15"
    },
    {
        "source_sentence": "時衛護者各作是言：『若或有人食一毛頭者，我等當殺。』",
        "translation": "Each of the guards then said, 'If someone eats a hair on their head, we'll kill them.'",
        "source": "T15n0653_002:0791a06_16"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0791a07_17"
    },
    {
        "source_sentence": "中有一人竊作是念：『是瓶中蜜食一毛頭，則不老死，我今何為惜死不噉？",
        "translation": "One of them secretly thought, 'That's a hair that eats a drop of honey from the pot and doesn't grow old and die, so why should I cherish death and not eat it?'",
        "source": "T15n0653_002:0791a08_0"
    },
    {
        "source_sentence": "若得噉已，則便不畏諸衛護者，亦可常得無老病死。』",
        "translation": "If he attains discipline, then he won't fear the guards, and he can always attain freedom from old age, illness, and death.'",
        "source": "T15n0653_002:0791a09_1"
    },
    {
        "source_sentence": "如是定心不惜壽命直詣瓶所，諸衛護者各持刀杖，競欲殺之。",
        "translation": "Thus concentrated, he didn't spare his life to go straight to the vial, and the guards each held a sword or stick and competed to kill him.",
        "source": "T15n0653_002:0791a10_2"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0791a12_3"
    },
    {
        "source_sentence": "是人若能刀杖未及食一渧者，則免衰患無復老死。",
        "translation": "If that person can take a sword or stick and doesn't eat a bowl, then they'll be spared the danger of decay and no more old age.",
        "source": "T15n0653_002:0791a12_4"
    },
    {
        "source_sentence": "「如是舍利弗！",
        "translation": "So, Śāriputra!",
        "source": "T15n0653_002:0791a13_5"
    },
    {
        "source_sentence": "多有惡人、魔及魔民欲滅我法。",
        "translation": "Many bad people, Māras, and Māra's people want to extinguish my teaching.",
        "source": "T15n0653_002:0791a14_0"
    },
    {
        "source_sentence": "如來滅後若有人能隨順空法通達無疑，則於諸法心無所得成就上忍。",
        "translation": "If someone can follow the teaching of emptiness and comprehend it without doubt after the Tathāgata's passing away, then they'll attain superior forbearance in the mind that doesn't obtain anything from the teachings.",
        "source": "T15n0653_002:0791a14_1"
    },
    {
        "source_sentence": "爾時雖為惡人所輕沮壞其道，是人若能不惜身命勤行精進，通達諸法無生無作，",
        "translation": "At that point, even though they're despised by evil people and their paths are rejected, if they can diligently practice without stinginess with body and life and penetrate the principles of nonproduction and nonconduct,",
        "source": "T15n0653_002:0791a16_2"
    },
    {
        "source_sentence": "則得度脫生老病死。",
        "translation": "Then they'll be liberated from birth, old age, illness, and death.",
        "source": "T15n0653_002:0791a18_3"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0791a18_4"
    },
    {
        "source_sentence": "蜜瓶是佛第一義法；",
        "translation": "The jar of honey is the first meaning of buddhahood.",
        "source": "T15n0653_002:0791a18_5"
    },
    {
        "source_sentence": "諸天世人衛護瓶者，則是惡人樂行魔事，自失大利，亦遮他人行實相者，",
        "translation": "Gods and goddesses guard the vial, which is a bad person who enjoys demonic deeds and loses great rewards to themselves and hides the true characteristics of other people’s actions.",
        "source": "T15n0653_002:0791a19_6"
    },
    {
        "source_sentence": "失於大利。",
        "translation": "They'll lose the great reward.",
        "source": "T15n0653_002:0791a20_7"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0791a21_8"
    },
    {
        "source_sentence": "增上慢者皆是魔黨助成魔事，咸共譏訶無生滅法。",
        "translation": "Those who are overweeningly conceited are all Māra's partisans who help create Māra, and they all criticize the principle of nonproduction and cessation together.",
        "source": "T15n0653_002:0791a21_9"
    },
    {
        "source_sentence": "「又舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T15n0653_002:0791a22_10"
    },
    {
        "source_sentence": "不淨說者，我見、人見、眾生見、五陰、十二入、十八界見，未得謂得，",
        "translation": "The view of self, the view of persons, the view of beings, the view of the five aggregates, the view of the twelve sense-fields and the view of the eighteen elements that are not acquired is called ‘acquisition’.",
        "source": "T15n0653_002:0791a22_11"
    },
    {
        "source_sentence": "心計得道，計得涅槃，咸亦譏訶如是正法。",
        "translation": "The mind conceives of attaining the path and conceives of attaining nirvāṇa, and they all criticize such a right teaching.",
        "source": "T15n0653_002:0791a24_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0791a25_13"
    },
    {
        "source_sentence": "是人貪著空故，亦是魔眾，魔所迷惑，以我正法而作魔事。",
        "translation": "Because they cling to emptiness, they're also demons, and because they're deluded by Māra, they do demonic things with the right teaching of self.",
        "source": "T15n0653_002:0791a25_14"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0791a26_15"
    },
    {
        "source_sentence": "若在家、出家，聞是無我、無人、無眾生，畢竟空法驚疑畏者，當知是人受魔教化，",
        "translation": "If someone stays at home or leaves home, and hears about selflessness, nonexistence of persons, and nonexistence of sentient beings, and is frightened by the ultimate teaching of emptiness, you should know that such a person will be led and inspired by Māra.",
        "source": "T15n0653_002:0791a26_16"
    },
    {
        "source_sentence": "是像比丘，為是盜法惡威儀者。",
        "translation": "That monk like this is a thief with bad manners who steals the Dharma.",
        "source": "T15n0653_002:0791a28_17"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0791a29_18"
    },
    {
        "source_sentence": "是人則是我見、眾生見、有見、無見、常見、斷見，皆是魔民非佛弟子。",
        "translation": "That person is a view of self, a view of sentient beings, a view of existence, a view of nonexistence, a view of permanence, and a view of cessation, but they're all Māra people who aren't Buddhist disciples.",
        "source": "T15n0653_002:0791a29_19"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0791b01_20"
    },
    {
        "source_sentence": "我經中說：『一切世間皆空，無我無我所、無人無眾生、無常無定、無不壞法。』",
        "translation": "In the self sūtras, it's said, 'All worlds are empty, without self and selflessness, without person and sentient beings, impermanent and indeterminate, and without indestructible dharmas.'",
        "source": "T15n0653_002:0791b02_21"
    },
    {
        "source_sentence": "如是惡人亦復皆共讀誦是經為他人說，而心貪著我見、人見，如是癡人名為造作苦因、名為反覆兩端、名為鬪亂破僧、名為污染道法、名為沙門中濁、名為醜陋穢惡、名為但有言說、名為假偽沙門、名為沙門中貧、名為擔重擔者、名為欺誑諸佛、名為得逆罪者。",
        "translation": "Such a bad person also recites this sūtra together and teaches it to others, yet their minds cling to views of self and people, such a deluded person is called someone who creates painful causes, which are called the two ends of overturning, which are called fighting and disrupting the saṃgha, which are called polluting the path, which are called the turbidity among",
        "source": "T15n0653_002:0791b03_22"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0791b09_23"
    },
    {
        "source_sentence": "是人名為大惡逆賊、名為惡知識、名為破戒、名為邪見、名為外道、名為無實行、名為惡伴、名為殺鬼、名為癩瘡、名為臭穢、名為燒熱、名為諂曲、名為墮在黑闇、名為入稠榛林、名為墮生死流、名為互出惡者、名為地獄、名為畜生、名為餓鬼、名為阿修羅、名為不入道者、名為欺誑人者、名為自讚己者、名為行占相者、名為大聲喚呼、名為因利求利、名為污染他家、名為常調戲者、名為散亂心者、名為貪所害者、名為瞋所害者、名為癡所害者、名為好面欺者、名為衰惱處者、名為無解脫者，",
        "translation": "That person is called a great bad and heinous thief, called a bad friend, called someone who breaks the precepts, called someone with wrong views, called a heretic, called someone who doesn't really practice, called a bad companion, called a killing demon, called a leprosy, called a foul smell, called burn fever, called flattering, called falling into darkness,",
        "source": "T15n0653_002:0791b09_24"
    },
    {
        "source_sentence": "名為憂惱縛者。",
        "translation": "It's called the bond of grief and anguish.",
        "source": "T15n0653_002:0791b21_0"
    },
    {
        "source_sentence": "名為非沙門、形像沙門、沙門旃陀羅、沙門臭穢、沙門糟粕、名為難滿、名為難養、名為壞威儀者、名為無羞恥者、名為截斷頭者、名為身體壞者、名為袈裟繫頸、名為自入闇冥者、名為多貪欲者、名為多瞋恚者、名為多愚癡者、名為五蓋纏覆、名為沒者、名為虛者空者、名為癡者。",
        "translation": "He's called a non-monk, an image monk, an ascetic, an ascetic, a caṇḍāla, an ascetic who smells foul, an ascetic with bad stains, a name that's difficult to fulfill, a name that's difficult to nourish, a name that breaks down in manner, a name that has no shame, a",
        "source": "T15n0653_002:0791b21_1"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0791b27_2"
    },
    {
        "source_sentence": "云何名空？",
        "translation": "What's called emptiness?",
        "source": "T15n0653_002:0791b27_3"
    },
    {
        "source_sentence": "退失諸佛讚善人相，故名為空；",
        "translation": "They are called emptiness because they regress from the characteristics of buddhas praising good people.",
        "source": "T15n0653_002:0791b28_0"
    },
    {
        "source_sentence": "退失一切沙門功德沙門事法，故名為空。",
        "translation": "It's called emptiness because it regresses from all the ascetic merits of ascetic practices, and therefore it's called emptiness.",
        "source": "T15n0653_002:0791b28_1"
    },
    {
        "source_sentence": "云何為虛？",
        "translation": "What's false?",
        "source": "T15n0653_002:0791b29_2"
    },
    {
        "source_sentence": "在聖法外故名為虛；",
        "translation": "It is called space because it lies beyond the holy dharmas.",
        "source": "T15n0653_002:0791c01_0"
    },
    {
        "source_sentence": "遠離空、無相、無願法故名為虛。",
        "translation": "It's called false because it's free of emptiness, signlessness, and wishlessness.",
        "source": "T15n0653_002:0791c01_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0791c02_2"
    },
    {
        "source_sentence": "如是惡人能令魔喜，貪著堅執虛妄法故，同於凡夫備足具有罪惡人相；",
        "translation": "In this way, bad persons are able to make the demons delight. Because of their attachment and firmly grasping false doctrines, they are like ordinary people who possess the characteristics of a blameworthy evil person.",
        "source": "T15n0653_002:0791c02_3"
    },
    {
        "source_sentence": "不似得法忍者，沙門事法沙門功德，百千萬分尚無其一。",
        "translation": "It doesn't look like someone who has attained the Dharma as a ninja, and there's not even one hundred million parts of the merit of an ascetic who serves the Dharma as an ascetic or as an ascetic.",
        "source": "T15n0653_002:0791c03_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0791c05_5"
    },
    {
        "source_sentence": "是故名為空者、虛者。",
        "translation": "Therefore, it's called emptiness and voidness.",
        "source": "T15n0653_002:0791c05_6"
    },
    {
        "source_sentence": "但深貪著世間利樂，非是沙門自稱沙門，不應供養而受供養，名為常賊、立幢相賊，",
        "translation": "They simply deeply cling to worldly profits and pleasures. It is not the case that an ascetic calls himself an ascetic, or that he receives offerings without having to make them.",
        "source": "T15n0653_002:0791c05_7"
    },
    {
        "source_sentence": "名為自在殺害人賊。",
        "translation": "It's called the freedom to kill and harm people and thieves.",
        "source": "T15n0653_002:0791c07_8"
    },
    {
        "source_sentence": "是人所食一口皆不清淨，唯有向道得道果者能消供養，是人無此，是故名為不淨食者。",
        "translation": "That person doesn't have this, which is why they're called someone who eats impure food.",
        "source": "T15n0653_002:0791c08_9"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0791c10_10"
    },
    {
        "source_sentence": "是故名為空者、虛者。",
        "translation": "Therefore, it's called emptiness and voidness.",
        "source": "T15n0653_002:0791c10_11"
    },
    {
        "source_sentence": "「於意云何？",
        "translation": "What do you think?",
        "source": "T15n0653_002:0791c10_12"
    },
    {
        "source_sentence": "若人殺生、偷盜、邪婬、妄語、兩舌、惡口、綺語、貪嫉、瞋、恚、邪見，",
        "translation": "Suppose someone kills, steals, commits sexual misconduct, speaks falsehoods, double talks, harsh words, flattery, greed, anger, hatred, and wrong views.",
        "source": "T15n0653_002:0791c11_13"
    },
    {
        "source_sentence": "是人為是常殺生不常奪命不？」",
        "translation": "Is this person who always kills and doesn't always take life?",
        "source": "T15n0653_002:0791c12_14"
    },
    {
        "source_sentence": "「不也。",
        "translation": "“No, they won’t.",
        "source": "T15n0653_002:0791c13_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0653_002:0791c13_16"
    },
    {
        "source_sentence": "在家殺生不常奪命，殺生時少不殺時多。」",
        "translation": "At home, killing sentient beings doesn't always snatch their lives, and there are few times when they kill and many times when they don't.",
        "source": "T15n0653_002:0791c13_17"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0791c14_18"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T15n0653_002:0791c14_19"
    },
    {
        "source_sentence": "若人偷盜，偷盜時多不盜時多？」",
        "translation": "If someone steals, are there many times when they steal and not many times when they don't steal?",
        "source": "T15n0653_002:0791c14_20"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0653_002:0791c15_21"
    },
    {
        "source_sentence": "不盜時多。」",
        "translation": "There's plenty of times when they don't steal.",
        "source": "T15n0653_002:0791c15_22"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0791c15_23"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T15n0653_002:0791c15_24"
    },
    {
        "source_sentence": "若人邪婬，邪婬時多、不邪婬時多？」",
        "translation": "If a person commits sexual misconduct, are there many times when he commits sexual misconduct and many times when he doesn't?",
        "source": "T15n0653_002:0791c16_25"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0653_002:0791c16_26"
    },
    {
        "source_sentence": "不邪婬時多。」",
        "translation": "There's often a time when there's no sexual misconduct.",
        "source": "T15n0653_002:0791c17_27"
    },
    {
        "source_sentence": "「妄語、惡口、兩舌、綺語、貪嫉、瞋恚時多，不瞋恚時多？」",
        "translation": "When there's false speech, harsh words, duplicitous speech, fancy speech, greed, jealousy, and anger, what's the time when there's no anger?",
        "source": "T15n0653_002:0791c17_28"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0653_002:0791c18_29"
    },
    {
        "source_sentence": "不瞋恚時多。」",
        "translation": "There's often a time when there's no anger.",
        "source": "T15n0653_002:0791c18_30"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0791c18_31"
    },
    {
        "source_sentence": "是十不善道中何者罪重？」",
        "translation": "Which of these ten unwholesome paths is a serious offense?",
        "source": "T15n0653_002:0791c19_32"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0653_002:0791c19_33"
    },
    {
        "source_sentence": "十不善中邪見罪重。",
        "translation": "Among the ten unwholesome, the sin of wrong views is serious.",
        "source": "T15n0653_002:0791c19_34"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0791c20_35"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T15n0653_002:0791c20_36"
    },
    {
        "source_sentence": "邪見者垢常著心，心不清淨。」",
        "translation": "A wrong view is always attached to defilement, and the mind isn't pure.",
        "source": "T15n0653_002:0791c20_37"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0791c21_38"
    },
    {
        "source_sentence": "我今語汝，若人一日殺百千萬億眾生，一日偷盜百千萬億金銀寶物，邪婬者晝夜不息；",
        "translation": "I now tell you this: If someone kills a hundred thousand myriad koṭis of sentient beings in one day, steals a hundred thousand myriad koṭis of gold and silver treasure objects in one day, and engages in sexual misconduct day and night without cease.",
        "source": "T15n0653_002:0791c21_39"
    },
    {
        "source_sentence": "妄語者常欺誑人，口業不淨無一實語；",
        "translation": "False speech always deceives others. Their verbal action is impure and there is not a single true saying.",
        "source": "T15n0653_002:0791c23_40"
    },
    {
        "source_sentence": "兩舌者常破和合亦助破者；",
        "translation": "The twofold tongue always breaks the harmony and also assists in breaking it.",
        "source": "T15n0653_002:0791c24_41"
    },
    {
        "source_sentence": "惡口者口常惡逆，乃至不說柔軟一語；",
        "translation": "harsh words are always harsh words, not uttering even a single word of softness.",
        "source": "T15n0653_002:0791c24_42"
    },
    {
        "source_sentence": "綺語者無有根本，人問此事，以餘無量語言干亂；",
        "translation": "fancy speech has no root, and when people ask questions about this matter they are interrupted by other innumerable words.",
        "source": "T15n0653_002:0791c25_43"
    },
    {
        "source_sentence": "貪嫉者於他物中生非法心；",
        "translation": "The one who is greedy and jealous produces an unlawful thought regarding the things of others.",
        "source": "T15n0653_002:0791c27_0"
    },
    {
        "source_sentence": "瞋恚者無有因緣橫起瞋恚懷恨滿心；",
        "translation": "Anger is that which, without any cause or condition, gives rise to anger and full awarenesses of hatred.",
        "source": "T15n0653_002:0791c27_1"
    },
    {
        "source_sentence": "邪見者樂行非道。",
        "translation": "A mistaken view is a pleasure that's practiced and not the path.",
        "source": "T15n0653_002:0791c28_2"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0791c28_3"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T15n0653_002:0791c29_4"
    },
    {
        "source_sentence": "若人成就如是不善法者，罪為多不？」",
        "translation": "If someone accomplishes such an unwholesome dharma, is their sin numerous?",
        "source": "T15n0653_002:0791c29_5"
    },
    {
        "source_sentence": "「甚多。",
        "translation": "“There are so many.",
        "source": "T15n0653_002:0792a01_6"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T15n0653_002:0792a01_7"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0792a01_8"
    },
    {
        "source_sentence": "我今語汝，若人百歲成就如是十不善罪，破戒比丘一日一夜受他供養，",
        "translation": "I will now tell you this: If someone commits these ten unwholesome sins for a hundred years, that monk who breaks the precepts is to be offered support by others for one day and night.",
        "source": "T15n0653_002:0792a01_9"
    },
    {
        "source_sentence": "罪多於彼。",
        "translation": "Their sins are greater than those there.",
        "source": "T15n0653_002:0792a03_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0792a03_11"
    },
    {
        "source_sentence": "是殺生者，多人所知、多人所識，人所惡賤，人皆知是殺奪命者，罪人、穢濁、是污染者，",
        "translation": "This is the person who kills living beings. Known by many people and recognized by many people, everyone knows that this is someone who kills and takes life.",
        "source": "T15n0653_002:0792a03_12"
    },
    {
        "source_sentence": "不善、無德、人所離者。",
        "translation": "It's unwholesome, lacking virtue, and free of people.",
        "source": "T15n0653_002:0792a05_13"
    },
    {
        "source_sentence": "又舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T15n0653_002:0792a05_14"
    },
    {
        "source_sentence": "殺生之人多奪他命，或生厭心自知不是，當得罪報，人皆知惡無戒穢濁，",
        "translation": "A person who kills living beings often takes away the lives of others, or becomes disgusted and knows for themselves that it's not so, and they'll attain the results of their sins. People will all know that evil is without morality and impurity.",
        "source": "T15n0653_002:0792a06_15"
    },
    {
        "source_sentence": "於此人所不望功德，乃至析毛百分之一，況謂福田而供養之？",
        "translation": "They don't expect merit from this person, even if they were to shave their hair by one percent, so why wouldn't they want to offer them a field of merit and make offerings?",
        "source": "T15n0653_002:0792a07_16"
    },
    {
        "source_sentence": "又舍利弗！",
        "translation": "Again, Śāriputra!",
        "source": "T15n0653_002:0792a09_17"
    },
    {
        "source_sentence": "是殺生之人，其家妻子，人皆知悉不共恭敬，尚不令坐何況供養？",
        "translation": "The people of that killing man's family, his wife, and their wives all knew that they weren't respected together, so they didn't allow him to sit down, so why wouldn't they make offerings?",
        "source": "T15n0653_002:0792a09_18"
    },
    {
        "source_sentence": "殺生之人以財自活養育妻子，或時供養沙門、婆羅門，以此業報得遇賢聖比丘、比丘尼，",
        "translation": "A person who kills living by means of his own property maintains his wife and children, sometimes offering support to śramaṇas and brāhmaṇas. As a result of this action, he meets noble bhikṣus and bhikṣuṇīs.",
        "source": "T15n0653_002:0792a10_19"
    },
    {
        "source_sentence": "為說道法，教離殺生捨其殺業。",
        "translation": "He explains the teaching of the path and teaches people to part with killing and abandon their killing.",
        "source": "T15n0653_002:0792a12_20"
    },
    {
        "source_sentence": "於佛法中而得出家無有障礙，得出家已近善知識得沙門果，是人現世輕受罪報，",
        "translation": "In the midst of the Buddha’s teaching, there is no obstruction when one renounces household life. Having renounced household life, he approaches spiritual benefactors and attains the state of śramaṇahood. Such a person will be condemned in this world to receive the retribution of unseemly sin.",
        "source": "T15n0653_002:0792a13_21"
    },
    {
        "source_sentence": "不障聖道得免三塗。",
        "translation": "They won't obstruct the noble path and be able to escape the three destinies.",
        "source": "T15n0653_002:0792a15_22"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0792a16_23"
    },
    {
        "source_sentence": "於我法中有諸比丘，非是沙門自言沙門，非是梵行自言梵行，斷諸善根障入涅槃迷惑失道，",
        "translation": "In my teaching, there are monks who aren’t ascetics who declare themselves to be ascetics, who aren’t religious practitioners who declare themselves to be religious practitioners, who have cut off the obstacles of good roots and enter nirvana without deludedly losing the path.",
        "source": "T15n0653_002:0792a16_24"
    },
    {
        "source_sentence": "破道因緣破諸善法，行外道事入於惡道。",
        "translation": "They break the causes and conditions of the path, destroy good qualities, practice non-Buddhist activities, and enter a bad path.",
        "source": "T15n0653_002:0792a18_25"
    },
    {
        "source_sentence": "多諸惡賊，空生受命猶如死人，形色毀悴失正威儀，於我法中名為污染、名為法賊、名為逆人、名為魔使。",
        "translation": "Many bad thieves are born in emptiness and receive their lives like a dead man, whose form is disfigured and lacks proper authority, and they're called polluted, called thieves of the Dharma, called oppressors of humans, and called Māra messengers.",
        "source": "T15n0653_002:0792a19_26"
    },
    {
        "source_sentence": "猶如行廁亦如死狗，如像沙門，同沙門服無沙門事。",
        "translation": "It's like walking in the toilet and also like a dead dog, like an ascetic who takes on the form of an ascetic and wears the same as an ascetic without doing anything as an ascetic.",
        "source": "T15n0653_002:0792a21_27"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0792a22_28"
    },
    {
        "source_sentence": "譬如野干在師子群；",
        "translation": "It is as if a wild boar were among the herds of lions.",
        "source": "T15n0653_002:0792a23_0"
    },
    {
        "source_sentence": "亦如黃門在於轉輪聖王眾中；",
        "translation": "It is also like the Yellow Gate in the assembly of universal monarchs.",
        "source": "T15n0653_002:0792a23_1"
    },
    {
        "source_sentence": "亦如獼猴在於諸天；",
        "translation": "It is also like a rhesus monkey in the heavens.",
        "source": "T15n0653_002:0792a24_2"
    },
    {
        "source_sentence": "亦復如驢在象王眾；",
        "translation": "It is also like a donkey in the company of an elephant king.",
        "source": "T15n0653_002:0792a24_3"
    },
    {
        "source_sentence": "亦如盲人在天眼眾；",
        "translation": "It is also like the congregation of blind people with divine vision.",
        "source": "T15n0653_002:0792a25_4"
    },
    {
        "source_sentence": "亦如蝙蝠在金翅鳥眾。",
        "translation": "It's also like a bat among the golden-winged birds.",
        "source": "T15n0653_002:0792a25_5"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0792a26_6"
    },
    {
        "source_sentence": "破戒比丘在我眾中，百千萬億諸天大眾，見此比丘在眾而坐，皆大憂惱而作是言：『如是惡人何用布薩？",
        "translation": "Hundreds of thousands of myriads of koṭis of gods in the assembly saw this monk sitting among the assembly, and they all became greatly distressed and said, 'Why would such a bad person need to preach?'",
        "source": "T15n0653_002:0792a26_7"
    },
    {
        "source_sentence": "是魔黨類，欲聞無上佛道向白衣說。』",
        "translation": "These Māras and partisans want to hear the unsurpassed Buddha teach the path to white-robed people.'",
        "source": "T15n0653_002:0792a28_8"
    },
    {
        "source_sentence": "復有信樂佛法諸龍鬼神等，高聲大喚是惡比丘：『何故於此隱藏其身？",
        "translation": "Again, there were dragons, ghosts, and other spirits who believed in the Buddha's teaching and called out loudly to this bad monk, 'Why are you hiding your body here?'",
        "source": "T15n0653_002:0792a29_9"
    },
    {
        "source_sentence": "似如惡馬在調善馬中。』",
        "translation": "It's like a bad horse in a well-adjusted horse.'",
        "source": "T15n0653_002:0792b02_0"
    },
    {
        "source_sentence": "如是癡人自謂無有見知我惡，自藏於此欺誑天人，為是一切天人中賊，",
        "translation": "Thus, a deluded person who says he has no views and knows the evil of self conceals himself here to deceive gods and humans as thieves among all gods and humans.",
        "source": "T15n0653_002:0792b02_1"
    },
    {
        "source_sentence": "眾共見已皆更大笑。",
        "translation": "The crowd saw it together and laughed loudly.",
        "source": "T15n0653_002:0792b04_2"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0792b04_3"
    },
    {
        "source_sentence": "如是罪惡比丘，為是諸天所知惡賊，白衣無異而受供養，迎送禮拜合掌恭敬。",
        "translation": "Thus, this monk guilty of crimes is known by the gods as a bad thief, who receives offerings in white robes without distinction and greets, venerates, joins his palms, and respects them.",
        "source": "T15n0653_002:0792b04_4"
    },
    {
        "source_sentence": "弊人愚癡猶如死屍，所著衣服皆是偷得，鉢中所食皆是盜取，無人與者，",
        "translation": "The wretched man’s delusion is like that of a corpse. All the clothes he wears are stolen, and whatever he eats from his almsbowl is stolen; no one will give them to him.",
        "source": "T15n0653_002:0792b06_5"
    },
    {
        "source_sentence": "乃至少水亦是盜得。",
        "translation": "Even a little water is also stealing.",
        "source": "T15n0653_002:0792b08_6"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0792b08_7"
    },
    {
        "source_sentence": "破戒比丘所至之方，若至東方、南西、北方，皆是偷地而行。",
        "translation": "Where a monk who breaks the precepts goes, if he goes to the east, southwest, or north, they'll all steal the land and walk.",
        "source": "T15n0653_002:0792b08_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0792b10_9"
    },
    {
        "source_sentence": "是人所有威儀行法，皆是偷盜假竊所作，行立坐臥來去視瞻，屈申俯仰著衣持鉢，",
        "translation": "The manner in which they behave is all the work of thieves, robbers, hypocrites, and crooked men. They walk, stand, sit, go, and look around, flexing their legs, bowing, stooping, putting on their robes, bowls, and almsbowls.",
        "source": "T15n0653_002:0792b10_10"
    },
    {
        "source_sentence": "今但略說身口意業，有所施作皆是偷賊，若有剃是人髮，為剃賊髮。",
        "translation": "We'll just briefly explain that whatever we do with body, speech, and mind is stealing, and if we shave them, we'll shave the thief.",
        "source": "T15n0653_002:0792b12_11"
    },
    {
        "source_sentence": "舉要言之，破戒比丘有所施作，皆是賊作。",
        "translation": "To summarize, whatever a monk who breaks the precepts does with generosity, it's all done by a thief.",
        "source": "T15n0653_002:0792b13_12"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0792b14_13"
    },
    {
        "source_sentence": "弊惡比丘，乃至大小便利澡手皆是賊法，何以故？",
        "translation": "Bad monks, even those who wash their hands with large and small conveniences are all thieves, so why is that?",
        "source": "T15n0653_002:0792b14_14"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0792b16_0"
    },
    {
        "source_sentence": "閻浮提內皆是國王及諸大臣、人民所有及屬非人，是惡比丘於中為賊。",
        "translation": "In Jambudvīpa, all the kings, ministers, people, property, and non-people belonging to them are bad monks who are thieves.",
        "source": "T15n0653_002:0792b16_1"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0792b17_2"
    },
    {
        "source_sentence": "若王大臣，於惡賊所不望功德、不言等我、不言勝我。",
        "translation": "Suppose a king or minister doesn't expect merit from the bad thief, doesn't say equal to me, and doesn't say superior to me.",
        "source": "T15n0653_002:0792b18_3"
    },
    {
        "source_sentence": "破戒比丘著聖法服，於是人所望得功德，是故聽使止住國土；",
        "translation": "A bhikṣu who breaks the precepts and puts on the robe of the holy dharma obtains what people there hope to attain. For this reason he is permitted to stay in his own land.",
        "source": "T15n0653_002:0792b19_4"
    },
    {
        "source_sentence": "若知其惡，乃至唾地亦復不聽。",
        "translation": "If they know their evil, they won't even spit on the ground or hear it.",
        "source": "T15n0653_002:0792b20_5"
    },
    {
        "source_sentence": "是故舍利弗！",
        "translation": "Therefore, Śāriputra!",
        "source": "T15n0653_002:0792b21_6"
    },
    {
        "source_sentence": "弊惡比丘，動身所作皆是賊作，名為常賊、大賊、立幢相賊，打害一切世間人者。",
        "translation": "Whatever bad monks move their bodies, they're all made by thieves, which are called constant thieves, great thieves, and banner-standing thieves who harm all the people of the world.",
        "source": "T15n0653_002:0792b21_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0792b23_8"
    },
    {
        "source_sentence": "無惡不作故。",
        "translation": "It's because there's no evil that isn't done.",
        "source": "T15n0653_002:0792b23_9"
    },
    {
        "source_sentence": "是故舍利弗！",
        "translation": "Therefore, Śāriputra!",
        "source": "T15n0653_002:0792b23_10"
    },
    {
        "source_sentence": "是惡比丘於諸一切天人世間，為是大賊。",
        "translation": "That bad monk is a great thief in all the gods and humans of the world.",
        "source": "T15n0653_002:0792b24_11"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0792b25_12"
    },
    {
        "source_sentence": "若人是一切天人世間大賊，是人能消一飲水不？」",
        "translation": "If someone is a great thief of all the gods and humans in the world, can they digest a single drop of water?",
        "source": "T15n0653_002:0792b25_13"
    },
    {
        "source_sentence": "「不也。",
        "translation": "“No, they won’t.",
        "source": "T15n0653_002:0792b26_14"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T15n0653_002:0792b26_15"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0792b26_16"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T15n0653_002:0792b26_17"
    },
    {
        "source_sentence": "是人非是大惡人耶？」",
        "translation": "Is this person not a great bad person?",
        "source": "T15n0653_002:0792b27_18"
    },
    {
        "source_sentence": "「如是。",
        "translation": "“So it is.",
        "source": "T15n0653_002:0792b27_19"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T15n0653_002:0792b27_20"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0792b27_21"
    },
    {
        "source_sentence": "「『寧噉燒石，　　吞飲洋銅；　　不以無戒，",
        "translation": "'It's better to burn a stone and swallow a large amount of copper; it's not because of the absence of precepts",
        "source": "T15n0653_002:0792b28_0"
    },
    {
        "source_sentence": "　　食人信施。』",
        "translation": "Eating people believe in giving.'",
        "source": "T15n0653_002:0792b28_0"
    },
    {
        "source_sentence": "破戒比丘於諸一切天人世間有大惡罪，以是義故，我說此偈：「舍利弗！",
        "translation": "A monk who breaks the precepts has a great bad sin in all the gods and humans of the world, and because of this meaning, I spoke this verse, Śāriputra!",
        "source": "T15n0653_002:0792b28_0"
    },
    {
        "source_sentence": "是破戒比丘，無色無德、無復志願，身心熱毒喜見惡夢，不樂獨處，或時獨處、或時獨行，",
        "translation": "This monk who breaks the precepts has no form, no virtue, and no more aspiration. His body and mind are hot and poisonous, he delights in seeing evil dreams, doesn’t delight in solitude, sometimes staying alone or traveling alone.",
        "source": "T15n0653_002:0792c03_1"
    },
    {
        "source_sentence": "身則戰懼。",
        "translation": "His body then became frightened.",
        "source": "T15n0653_002:0792c05_2"
    },
    {
        "source_sentence": "見淨戒者僻藏避迴，心怯自愧不喜欲見。",
        "translation": "Those who see the pure precepts hide away in seclusion, and their minds are frightened with shame and don't want to see them.",
        "source": "T15n0653_002:0792c05_3"
    },
    {
        "source_sentence": "受供養時驚疑怖畏，心常馳騁多諸想念，深貪財利愛樂美食。",
        "translation": "When they receive offerings, they're frightened and fearful, constantly agitated with thoughts and thoughts in their minds, deeply craving possessions and benefits and enjoying good food.",
        "source": "T15n0653_002:0792c06_4"
    },
    {
        "source_sentence": "如是比丘！",
        "translation": "So it is, monks!",
        "source": "T15n0653_002:0792c07_5"
    },
    {
        "source_sentence": "命終之後必入地獄。",
        "translation": "After his death, he'll surely go to hell.",
        "source": "T15n0653_002:0792c08_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0792c08_1"
    },
    {
        "source_sentence": "是名破戒比丘七憂惱箭，必入地獄。",
        "translation": "These are called the seven arrows of grief for a monk who breaks the precepts and will surely go to hell.",
        "source": "T15n0653_002:0792c08_2"
    },
    {
        "source_sentence": "「復次舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T15n0653_002:0792c09_3"
    },
    {
        "source_sentence": "破戒比丘樂在眾閙，散亂多語性好嫉妬，與破戒者以為親友，常樂論說破戒惡事，",
        "translation": "A monk who breaks the precepts is happy to be in a crowd, scatter and talk loudly. He is fond of jealousy and takes those who break the precepts as his close friends. He always delights in discussing bad matters that violate the precepts.",
        "source": "T15n0653_002:0792c09_4"
    },
    {
        "source_sentence": "以為喜樂不知羞恥，違逆深經心疑不信。",
        "translation": "They thought they were delighted and didn't know shame, disagreed with the profound sūtras, doubted and didn't believe them.",
        "source": "T15n0653_002:0792c11_5"
    },
    {
        "source_sentence": "或時聞說如是等經，疑逆諍競不樂聽受，東西顧望心不專一，以手掩口仰視虛空，",
        "translation": "Sometimes when they hear and teach such scriptures, they doubt and resent dispute and don't like to hear or accept them. Looking east or west, their minds aren't concentrated, and they cover their mouths with their hands and look up into space with their eyes.",
        "source": "T15n0653_002:0792c12_6"
    },
    {
        "source_sentence": "從坐而起謗佛法教，懷瞋恨心罵說法者。",
        "translation": "He rose from his seat, denigrated the Buddha's teaching of the Dharma, harbored anger, and reviled those who taught the Dharma.",
        "source": "T15n0653_002:0792c14_7"
    },
    {
        "source_sentence": "以如是等過惡因緣，命終之後深入地獄。",
        "translation": "Because of such bad causes and conditions, they'll go into hell after their life ends.",
        "source": "T15n0653_002:0792c15_8"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0792c16_9"
    },
    {
        "source_sentence": "是名破戒比丘八憂惱箭，必墮地獄。",
        "translation": "These are called the eight arrows of grief that a monk who breaks the precepts will surely fall into hell.",
        "source": "T15n0653_002:0792c16_10"
    },
    {
        "source_sentence": "「復次舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T15n0653_002:0792c17_11"
    },
    {
        "source_sentence": "破戒比丘，但樂尊重和上阿闍梨讚其功德以求名利，稱持戒者因以自活，",
        "translation": "A monk who breaks the precepts simply delights in honoring a superior preceptor and praises his merits to seek fame and profit, and calls those who keep the precepts because they live for themselves.",
        "source": "T15n0653_002:0792c17_12"
    },
    {
        "source_sentence": "執事便附隨宜善巧，無有羞恥猶如黑烏。",
        "translation": "The keeper then attaches it as appropriate and skillfully does so, with no shame like a black crow.",
        "source": "T15n0653_002:0792c19_13"
    },
    {
        "source_sentence": "為僧因緣多求衣服、飲食恣口身力肥盛，不知慚愧言無次第。",
        "translation": "For the sake of the saṃgha's causes and conditions, he often asked for clothing, food, drink, and mouthfuls, and his body was so fat and powerful that he didn't know to be ashamed and said it wasn't in order.",
        "source": "T15n0653_002:0792c20_14"
    },
    {
        "source_sentence": "手脚麁燥顏色毀悴，樂視婦女不附男子。",
        "translation": "Their hands and feet were coarse and dry, and their appearance was emaciated; they enjoyed looking at women but did not follow men.",
        "source": "T15n0653_002:0792c21_15"
    },
    {
        "source_sentence": "如是惡人眾所輕賤，天龍鬼神所不稱讚，乃至諸佛亦不歎說。",
        "translation": "Such bad people are despised by many, and gods, dragons, ghosts, and spirits don't praise them, even the buddhas don't praise them.",
        "source": "T15n0653_002:0792c22_16"
    },
    {
        "source_sentence": "心性急促常好瞋恚，眾僧斷事俠為勢力。",
        "translation": "Their minds are fast-moving and always angry, and the saṃgha stops doing business with heroes as their power.",
        "source": "T15n0653_002:0792c24_17"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0792c25_0"
    },
    {
        "source_sentence": "如是破戒比丘，多於僧中求有威勢，未問而答常求他過，見淨戒者謂是欺誑。",
        "translation": "Thus, a monk who breaks the precepts often seeks authority in the saṃgha and answers without asking questions but always asks about other faults, and those who see the pure precepts are said to be deceptive.",
        "source": "T15n0653_002:0792c25_1"
    },
    {
        "source_sentence": "勤求道者不同其法，喜樂別異諍者助喜。",
        "translation": "Those who diligently seek the path don't differ from their teaching, and those who delight in different kinds of joy and displeasure help rejoice.",
        "source": "T15n0653_002:0792c27_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0792c27_1"
    },
    {
        "source_sentence": "是名破戒比丘九憂惱箭，必墮地獄。",
        "translation": "These are called the nine arrows of grief that a monk who breaks the precepts will surely fall into hell.",
        "source": "T15n0653_002:0792c28_2"
    },
    {
        "source_sentence": "「復次舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T15n0653_002:0792c29_0"
    },
    {
        "source_sentence": "破戒比丘，好樂他事任持其理，有鬪諍者以為喜樂，衣服嚴身學他威儀，",
        "translation": "A monk who breaks the precepts likes to delight in other things and allows others to maintain their principles. When there is a dispute, he takes it as a joyful pleasure to dress himself in an austere way and training others in mannerisms.",
        "source": "T15n0653_002:0792c29_1"
    },
    {
        "source_sentence": "求好臥具利養安身樂人稱讚，護惜檀越及悋住處，恐好比丘來見我過，",
        "translation": "He seeks good bedding, benefits well-being and peace of body and mind, praised by others, protects his donors and coarse dwelling places, fearing that a nice monk will come to see me.",
        "source": "T15n0653_002:0793a02_2"
    },
    {
        "source_sentence": "憎持戒者親附破戒。",
        "translation": "Those who dislike observance of the precepts are personally attached to breaking the precepts.",
        "source": "T15n0653_002:0793a03_3"
    },
    {
        "source_sentence": "常讚布施，不讚持戒、忍辱、精進、禪定、智慧，不讚寂滅遠離獨處。",
        "translation": "They always praise generosity, don't praise observance of precepts, forbearance, effort, meditation, wisdom, and exertion, and don't praise quiescence, seclusion, or solitary place.",
        "source": "T15n0653_002:0793a04_4"
    },
    {
        "source_sentence": "常好譏論持戒者過，亦不稱讚行頭陀者，或指說其事、或惡口橫加、或憶想妄說。",
        "translation": "He always likes to criticize those who observe the precepts and doesn't praise those who practice as an ascetic, either by pointing out their actions, or by speaking harshly and abusively, or by recalling and speaking falsely.",
        "source": "T15n0653_002:0793a05_5"
    },
    {
        "source_sentence": "依怙種姓數問親族，以少因緣為貪說法，常以曲心而懷驚疑，眾所憎惡久而益賤。",
        "translation": "Relying on their family members, they frequently questioned their relatives and for a few reasons greedily taught the Dharma to them. They always harbored doubt in distressed minds, and those who hated them became even more despicable over time.",
        "source": "T15n0653_002:0793a07_6"
    },
    {
        "source_sentence": "於持戒者常好譏說，苦切實語者不欲親近，意不喜聞如是等經。",
        "translation": "He always likes to criticize those who observe precepts, doesn't want to become intimate with those who say painful and true words, and doesn't wish to hear such sūtras like this.",
        "source": "T15n0653_002:0793a09_7"
    },
    {
        "source_sentence": "好持讀誦如是經者，聞說是經心歡喜者亦不喜見。",
        "translation": "Those who like to preserve and recite such a sūtra will rejoice when they hear it taught, but those who don't delight in views won't see it.",
        "source": "T15n0653_002:0793a10_8"
    },
    {
        "source_sentence": "又不喜聞讚持戒法，說是等經不來聽受，設來聽受不久即還。",
        "translation": "They don't like hearing and praising the observance of precepts, say these sūtras that won't come to be heard and accepted, and if they come to hear and accept them before long, they'll return.",
        "source": "T15n0653_002:0793a12_0"
    },
    {
        "source_sentence": "多與白衣而作知識，常樂論說持戒比丘，以得自在輕行暴惡。",
        "translation": "They often became friends with white-robed monks who always delighted in discussing and teaching the observance of precepts, so they could attain freedom to lightly commit violence.",
        "source": "T15n0653_002:0793a13_1"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0793a14_2"
    },
    {
        "source_sentence": "是名破戒比丘十憂惱箭，必墮惡道。",
        "translation": "These are called the ten arrows of grief for a monk who breaks the precepts and will surely fall into a bad path.",
        "source": "T15n0653_002:0793a15_3"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0793a15_4"
    },
    {
        "source_sentence": "我滅度後如是等人滿閻浮提，專行求利以自生活。」",
        "translation": "After my parinirvāṇa, such people will fill Jambudvīpa and focus on seeking profit to live for themselves.",
        "source": "T15n0653_002:0793a16_5"
    },
    {
        "source_sentence": "◎佛藏經◎淨法品第六佛告舍利弗：「昔迦葉佛豫記我言：『釋迦牟尼佛多受供養故，",
        "translation": "The Buddha told Śāriputra, In the past, Kāśyapa Buddha predicted to me, saying, 'Śākyamuni Buddha often received offerings.",
        "source": "T15n0653_002:0793a17_6"
    },
    {
        "source_sentence": "法當疾滅。』",
        "translation": "The Dharma will quickly cease.'",
        "source": "T15n0653_002:0793a20_7"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0793a20_8"
    },
    {
        "source_sentence": "我法實以多供養故，後當疾滅。",
        "translation": "Because the true self and dharmas are often offered as offerings, they'll quickly cease later.",
        "source": "T15n0653_002:0793a20_9"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0793a21_10"
    },
    {
        "source_sentence": "譬如貧人得大寶藏心則大樂。",
        "translation": "It's like a poor man who attains the great treasure-store mind and then becomes greatly happy.",
        "source": "T15n0653_002:0793a21_11"
    },
    {
        "source_sentence": "如是舍利弗！",
        "translation": "Thus, Śāriputra!",
        "source": "T15n0653_002:0793a22_12"
    },
    {
        "source_sentence": "未來世中多有比丘，親近白衣受其供養，漸相狎習而與執事，心便歡喜以為悅樂，",
        "translation": "In the future, there will be many monks who are intimate with white-robed people and receive their offerings. Gradually they will become fond of each other and give up their duties. Their minds will be joyous and delighted.",
        "source": "T15n0653_002:0793a22_13"
    },
    {
        "source_sentence": "猶如貧人得大寶藏。",
        "translation": "It's like a poor man who has obtained a great treasure store.",
        "source": "T15n0653_002:0793a24_14"
    },
    {
        "source_sentence": "如是癡人，貴於世利世樂奴僕。",
        "translation": "Such a deluded person is valued as a slave for worldly benefits and worldly pleasures.",
        "source": "T15n0653_002:0793a25_0"
    },
    {
        "source_sentence": "若見比丘多人供養，心便謂之得阿羅漢，見少知識便謂惡人。",
        "translation": "If he sees a monk who has been offered support by many people, his mind says he's attained arhatship, and if he sees a little knowledge, he's called a bad person.",
        "source": "T15n0653_002:0793a25_1"
    },
    {
        "source_sentence": "如是比丘！",
        "translation": "So it is, monks!",
        "source": "T15n0653_002:0793a27_2"
    },
    {
        "source_sentence": "為利養故捨上佛道，隨所樂者即成其事。",
        "translation": "He abandons the higher buddha path for profit, and whatever he enjoys, he accomplishes his task.",
        "source": "T15n0653_002:0793a27_3"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0793a28_4"
    },
    {
        "source_sentence": "如來於今為是癡人說如是等經。",
        "translation": "Now, the Tathāgata teaches such sūtras for those who are deluded.",
        "source": "T15n0653_002:0793a28_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0793a29_6"
    },
    {
        "source_sentence": "破戒比丘聞說是經，則生悔心當還持戒，不作大賊受他供養。",
        "translation": "A monk who breaks the precepts and hears this sūtra, then he becomes remorseful and returns to observe the precepts, doesn't become a great thief and receives the offerings of others.",
        "source": "T15n0653_002:0793a29_7"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0793b01_8"
    },
    {
        "source_sentence": "若有比丘得聞是經，心不清淨不喜不樂，是則名為弊惡比丘。",
        "translation": "If a monk hears this sūtra and his mind isn't pure and doesn't like or rejoice when he hears it, then he's called a bad monk.",
        "source": "T15n0653_002:0793b02_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0793b03_10"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0793b03_11"
    },
    {
        "source_sentence": "淨戒比丘無法不樂。",
        "translation": "A monk who observes the precepts is neither happy nor unhappy.",
        "source": "T15n0653_002:0793b03_12"
    },
    {
        "source_sentence": "若說布施、若說持戒、若說忍辱、若說精進、若說禪定、若說智慧，若說如是厭畏經法，",
        "translation": "If he teaches generosity, if he teaches observance of precepts, if he teaches forbearance, if he teaches effort, if he teaches meditation, if he teaches wisdom, and if he teaches such a scripture on the teaching of disgust and fear,",
        "source": "T15n0653_002:0793b04_13"
    },
    {
        "source_sentence": "心皆喜樂。",
        "translation": "The mind is filled with joy and happiness.",
        "source": "T15n0653_002:0793b06_14"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0793b06_15"
    },
    {
        "source_sentence": "有三種人，聞說是經心則憂惱。",
        "translation": "There are three kinds of people who hear this sūtra and become sad at heart when they hear it.",
        "source": "T15n0653_002:0793b06_16"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T15n0653_002:0793b07_17"
    },
    {
        "source_sentence": "一者、破戒比丘，二者、增上慢人，三者、不淨說法。",
        "translation": "1. a monk who breaks the precepts, 2. an arrogant person, and 3. an impure preacher.",
        "source": "T15n0653_002:0793b07_18"
    },
    {
        "source_sentence": "復有三種人聞如是經心則憂惱。",
        "translation": "Again, there are three kinds of people who hear such a sūtra and become sad and distressed.",
        "source": "T15n0653_002:0793b08_19"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T15n0653_002:0793b09_20"
    },
    {
        "source_sentence": "一者、人見，二者、命見，三者、我見。",
        "translation": "1. views of person, 2. views of life, and 3. views of self.",
        "source": "T15n0653_002:0793b09_21"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0793b10_22"
    },
    {
        "source_sentence": "我今明了告汝，如好善知識，以慈愍心為人求利、求樂、求安隱，汝等一心聽受我語，",
        "translation": "I now clearly tell you: Just as a good friend and spiritual benefactor, with kindness and compassion for others seeking profit, happiness, and peace, listen with one unified mind to my words.",
        "source": "T15n0653_002:0793b10_23"
    },
    {
        "source_sentence": "常求善利心勿放逸。",
        "translation": "He always seeks good benefits and doesn't let his mind wander.",
        "source": "T15n0653_002:0793b12_24"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0793b12_25"
    },
    {
        "source_sentence": "不淨說法者，有五過失。",
        "translation": "An impure preacher of the Dharma has five faults.",
        "source": "T15n0653_002:0793b13_26"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T15n0653_002:0793b13_27"
    },
    {
        "source_sentence": "一者、自言盡知佛法；",
        "translation": "The first is that they themselves say they know all the Buddha’s teachings.",
        "source": "T15n0653_002:0793b13_28"
    },
    {
        "source_sentence": "二者、說佛經時，出諸經中相違過失；",
        "translation": "The second is that when they expound buddha- sūtras, they reveal contradictions and errors in the scriptures.",
        "source": "T15n0653_002:0793b14_29"
    },
    {
        "source_sentence": "三者、於諸法中心疑不信；",
        "translation": "The third is that they doubt and disbelieve in all doctrines.",
        "source": "T15n0653_002:0793b15_30"
    },
    {
        "source_sentence": "四者、自以所知非他經法；",
        "translation": "The fourth is that they themselves know all the teachings of other scriptures and doctrines.",
        "source": "T15n0653_002:0793b15_31"
    },
    {
        "source_sentence": "五者、以利養故為人說法。",
        "translation": "5. He teaches the Dharma for people because he benefits them.",
        "source": "T15n0653_002:0793b16_32"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0793b16_33"
    },
    {
        "source_sentence": "如是說者，我說此人當墮地獄不至涅槃。",
        "translation": "Those who say this, I say that this person will fall into hell and not attain nirvāṇa.",
        "source": "T15n0653_002:0793b17_34"
    },
    {
        "source_sentence": "「復次舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T15n0653_002:0793b18_35"
    },
    {
        "source_sentence": "說法比丘處在大眾，信樂法者為敷高座，捨佛正法而說外道嚴飾文辭（我久勤苦求是法寶，",
        "translation": "When the bhikṣus who preached the Dharma were present in the assembly, those who believed in the Dharma spread out high seats for them. Renouncing the Buddha’s true-dharma, they expounded heretical teachings adorned with syllables and words (I have been diligently seeking this treasure of the Dharma for a long time",
        "source": "T15n0653_002:0793b18_36"
    },
    {
        "source_sentence": "而此惡人捨置不說），但以經中相違語義，互相是非不順正法，於聖法中高心自大，",
        "translation": "Instead, these bad people abandon it and don't teach it.) They simply contradict the meaning of the sūtras with contradictory words, disagree with each other about right or wrong teachings, and become arrogant in their minds among the noble teachings.",
        "source": "T15n0653_002:0793b20_37"
    },
    {
        "source_sentence": "隨意而說為求利養。",
        "translation": "He explains it as he wishes in order to obtain profit.",
        "source": "T15n0653_002:0793b22_38"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0793b22_39"
    },
    {
        "source_sentence": "若比丘說法雜外道義，有善比丘勤求道者，應從坐去。",
        "translation": "If a monk teaches the meaning of mixed non-Buddhist teachings and there's a good monk who diligently pursues the path, he should leave his seat.",
        "source": "T15n0653_002:0793b23_40"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0793b24_41"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0793b24_42"
    },
    {
        "source_sentence": "有信白衣敷置高座，不應演說外道語義；",
        "translation": "If there is a faithful layman who spreads out his high seat, he should not expound the meaning of the words of heretics.",
        "source": "T15n0653_002:0793b24_43"
    },
    {
        "source_sentence": "若不去者非善比丘，亦復不名隨佛教者。",
        "translation": "If someone doesn't go there, they aren't a good monk, and they aren't called following Buddhism.",
        "source": "T15n0653_002:0793b25_44"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0793b26_45"
    },
    {
        "source_sentence": "說法甚難，如是說者，我說此人名為外道尼犍弟子，非佛弟子。",
        "translation": "It's very difficult to teach the Dharma, but someone who teaches it like this is called a non-Buddhist Nirgrantha disciple, not a Buddhist disciple.",
        "source": "T15n0653_002:0793b26_46"
    },
    {
        "source_sentence": "是說法者命終之後，當生尼犍子道。",
        "translation": "After the Dharma preacher dies, he'll be born in the path of Nirgrantha.",
        "source": "T15n0653_002:0793b28_47"
    },
    {
        "source_sentence": "何等是尼犍子道？",
        "translation": "What's the path of Nirgrantha?",
        "source": "T15n0653_002:0793b28_48"
    },
    {
        "source_sentence": "邪見是尼犍子道。",
        "translation": "A mistaken view is the path of Nirgrantha.",
        "source": "T15n0653_002:0793b29_49"
    },
    {
        "source_sentence": "何等為邪見？",
        "translation": "What's wrong view?",
        "source": "T15n0653_002:0793b29_50"
    },
    {
        "source_sentence": "謂是地獄、畜生、餓鬼。",
        "translation": "They are hells, animals, and hungry ghosts.",
        "source": "T15n0653_002:0793c01_51"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0793c01_52"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0793c01_53"
    },
    {
        "source_sentence": "身未證法而在高座，身自不知而教人者，必墮地獄。",
        "translation": "If someone doesn't realize the teaching in their own body but sits on a high seat, and teaches others without knowing it in their own body, they'll surely fall into hell.",
        "source": "T15n0653_002:0793c02_0"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0793c03_1"
    },
    {
        "source_sentence": "如是因緣如來悉知，我諸弟子，以種種門、種種因緣、種種諸見，滅我正法。",
        "translation": "The Tathāgata knows all of these causes and conditions, and my disciples have various approaches, various causes and conditions, and various views that extinguish the right teaching of self.",
        "source": "T15n0653_002:0793c03_2"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0793c05_0"
    },
    {
        "source_sentence": "若有眾生，聞如是經第一義空無所有法，心歡喜者，當知是人真我弟子。",
        "translation": "If there are any sentient beings who hear the first meaning of this sūtra, emptiness and the dharmas that lack existence, and rejoice in their hearts, you should know that they are truly my disciples.",
        "source": "T15n0653_002:0793c05_1"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0793c06_2"
    },
    {
        "source_sentence": "過去世有五百盲人行於道路，到一大城飢渴乏極，令一盲人在外守物，",
        "translation": "In a past world five hundred blind people traveled on the roads and came to a great city that was hungry and thirsty, causing one blind man to guard the objects outside.",
        "source": "T15n0653_002:0793c07_0"
    },
    {
        "source_sentence": "餘者入城乞索飲食。",
        "translation": "The others entered the city and begged for food and drink.",
        "source": "T15n0653_002:0793c08_1"
    },
    {
        "source_sentence": "未久之間有一誑人，至守物者所，語言：『咄人何以獨住？』",
        "translation": "Not long after that, a wicked man came to the treasure guard and said, 'Why do you people stay alone?'",
        "source": "T15n0653_002:0793c09_2"
    },
    {
        "source_sentence": "答言：『我有多伴入城乞食。』",
        "translation": "He replied, 'I have many companions who enter the city to solicit alms.'",
        "source": "T15n0653_002:0793c10_3"
    },
    {
        "source_sentence": "誑人語言：『汝為知不？",
        "translation": "The angry man said, 'Do you know it?'",
        "source": "T15n0653_002:0793c10_4"
    },
    {
        "source_sentence": "彼間大施衣食、瓔珞、花香、雜物，隨意可得，汝若須者將汝詣彼。』",
        "translation": "The great offerings of clothing, food, jewelry, flowers, fragrances, and miscellaneous things from there can be obtained as you wish, and if you need them, I'll take you there.'",
        "source": "T15n0653_002:0793c11_5"
    },
    {
        "source_sentence": "答言：『可爾！』",
        "translation": "He replied, 'That's right!'",
        "source": "T15n0653_002:0793c12_6"
    },
    {
        "source_sentence": "誑人將盲小離本處盡奪其物。",
        "translation": "The crippled man was about to leave the place where he was blind and took all of his possessions.",
        "source": "T15n0653_002:0793c13_7"
    },
    {
        "source_sentence": "諸盲乞食得已而還，誑人復語諸盲人言：『汝等得值大會施不？』",
        "translation": "After the blind beggars had finished begging for food and returned, the monks again said to the blind men, 'Have you met the great assembly of giving?'",
        "source": "T15n0653_002:0793c13_8"
    },
    {
        "source_sentence": "答言：『不值。』",
        "translation": "He replied, 'It's not worthy.'",
        "source": "T15n0653_002:0793c15_9"
    },
    {
        "source_sentence": "誑人語言：『汝等所得可置於此，我將汝等詣大施會。』",
        "translation": "The angry man said, 'You may put what you've gained here, and I'll take you to the great gift-giving assembly.'",
        "source": "T15n0653_002:0793c15_10"
    },
    {
        "source_sentence": "諸盲盡共留物一處，隨誑人去。",
        "translation": "The blind men all left their belongings in one place and departed, following the crippled man.",
        "source": "T15n0653_002:0793c16_11"
    },
    {
        "source_sentence": "誑人盡將五百盲人臨大深坑，而語之言：『此地平好有大施會，汝等各可迴面東行受他施物。』",
        "translation": "The addicts all led the five hundred blind men to a great deep pit and said, 'This place is peaceful and there's a great almsgiving assembly; you can each turn your faces and go east to receive the gifts from others.'",
        "source": "T15n0653_002:0793c17_12"
    },
    {
        "source_sentence": "即便一時墮坑而死。",
        "translation": "One time, he fell into a pit and died.",
        "source": "T15n0653_002:0793c19_13"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0793c20_0"
    },
    {
        "source_sentence": "當來比丘好讀外經，當說法時莊校文辭令眾歡樂，惡魔爾時助惑眾人障礙善法。",
        "translation": "When a monk comes along who likes to read non-Buddhist sūtras and when he teaches the Dharma, he adorns his explanation of words so that the crowd will be happy, and bad Māra then helps confuse the crowd and hinder the good teaching.",
        "source": "T15n0653_002:0793c20_1"
    },
    {
        "source_sentence": "若有貪著音聲、語言、巧飾文辭，若復有人好讀外道經者，魔皆迷惑令心安隱。",
        "translation": "If someone craves sounds, words, and skillfully decorates words, or if they like to read non-Buddhist scriptures, Māra will be confused and make their minds at ease.",
        "source": "T15n0653_002:0793c22_2"
    },
    {
        "source_sentence": "若有比丘修佛法者令生疑惑，咸使眾人不復供養。",
        "translation": "Suppose there's a monk who cultivates the Buddha's teaching and causes doubt to arise, causing people to stop making offerings.",
        "source": "T15n0653_002:0793c23_3"
    },
    {
        "source_sentence": "或有比丘若二若三已讀佛經，便使令求外道經法，先自看者讚言善好。",
        "translation": "Suppose there's a monk who has read the Buddha's sūtras for two or three times and then causes someone to seek the teachings of non-Buddhist scriptures, and he first looks at himself and praises them as good.",
        "source": "T15n0653_002:0793c25_0"
    },
    {
        "source_sentence": "是諸人等，為魔所惑覆障慧眼，深貪利養看諸外書，猶如群盲為誑所欺，",
        "translation": "They are like a group of blind men deceived by the wicked ones who have their eyes obstructed by the eye of wisdom, deeply attached to profits and books.",
        "source": "T15n0653_002:0793c26_1"
    },
    {
        "source_sentence": "皆使令墮深坑而死。",
        "translation": "They all caused them to fall into a deep pit and die.",
        "source": "T15n0653_002:0793c28_2"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0793c28_3"
    },
    {
        "source_sentence": "諸生盲人即是比丘捨佛無上道求外道經書，誑人是惡魔，深坑是邪道。",
        "translation": "Those who are born blind are monks who abandon the Buddha's unsurpassed path and seek non-Buddhist sūtras and books, and those who commit sexual misconduct are bad demons, and sinking deeply into a pit is a wrong path.",
        "source": "T15n0653_002:0793c28_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794a01_5"
    },
    {
        "source_sentence": "如群盲人捨所得物，欲詣大施而墮深坑；",
        "translation": "It is as if a group of blind people abandoned their possessions and, wishing to go to a great sacrifice, fell into a deep pit.",
        "source": "T15n0653_002:0794a01_6"
    },
    {
        "source_sentence": "我諸弟子亦復如是，捨麁衣食而逐大施求好供養，以世利故失大智慧，",
        "translation": "In the same way, my disciples abandoned coarse clothing and food in order to pursue great charity and seek good offerings. Because of worldly benefits they lost their great wisdom.",
        "source": "T15n0653_002:0794a02_7"
    },
    {
        "source_sentence": "而墮深坑阿鼻地獄。",
        "translation": "They'll fall into the deep pit of avīci hell.",
        "source": "T15n0653_002:0794a04_8"
    },
    {
        "source_sentence": "「復次舍利弗！",
        "translation": "Furthermore, Śāriputra!",
        "source": "T15n0653_002:0794a04_9"
    },
    {
        "source_sentence": "不淨說法者，不知如來隨宜意趣，自不善解而為人說，是人現世得五過失，",
        "translation": "Those who teach the Dharma impurely but do not know the appropriate path of the Tathāgata, or who themselves do not understand well and explain it to others. Such people will gain five faults in this life:",
        "source": "T15n0653_002:0794a05_10"
    },
    {
        "source_sentence": "餘人不知。",
        "translation": "The rest didn't know.",
        "source": "T15n0653_002:0794a06_11"
    },
    {
        "source_sentence": "唯得天眼比丘及諸天所知。",
        "translation": "Only the monks with divine vision and the gods can know it.",
        "source": "T15n0653_002:0794a07_12"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T15n0653_002:0794a07_13"
    },
    {
        "source_sentence": "一、說法時心懷怖畏恐人難我；",
        "translation": "The first is that they harbor fear in their minds at the time of preaching the Dharma and are afraid people will attack them.",
        "source": "T15n0653_002:0794a07_14"
    },
    {
        "source_sentence": "二、內懷憂怖而外為他說；",
        "translation": "The second is that they internally harbor sorrow and fear but externally express it for others.",
        "source": "T15n0653_002:0794a08_15"
    },
    {
        "source_sentence": "三、是凡夫無有真智；",
        "translation": "The third is that ordinary people lack true knowledge.",
        "source": "T15n0653_002:0794a09_16"
    },
    {
        "source_sentence": "四、所說不淨但有言辭；",
        "translation": "The fourth is that what they teach is impure and merely verbal.",
        "source": "T15n0653_002:0794a09_17"
    },
    {
        "source_sentence": "五、言無次第處處抄撮，是故在眾心懷恐怖。",
        "translation": "5. They say there's no sequential place where they're collected, so they harbor fear in the minds of the crowd.",
        "source": "T15n0653_002:0794a10_18"
    },
    {
        "source_sentence": "如是凡夫無有智慧心無決定，但以憍慢微小因緣求於名聞，疑悔在心而為人說，",
        "translation": "In the same way, ordinary people have neither wisdom nor certainty in their minds. They simply seek fame and learning through arrogance and minor reasons. Their doubts and remorse remain in their minds, yet they explain it to others.",
        "source": "T15n0653_002:0794a11_19"
    },
    {
        "source_sentence": "是人長夜自受貪欲、瞋恚、愚癡毒箭。",
        "translation": "For a long time, that person experiences the poisonous arrow of desire, anger, and folly for themselves.",
        "source": "T15n0653_002:0794a13_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0794a13_21"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794a14_22"
    },
    {
        "source_sentence": "是人不能定知諸法，而為他說，心不喜樂若樂速失。",
        "translation": "That person can't know the dharmas with certainty and teach them to others, and their mind isn't happy or happy, and they quickly lose it.",
        "source": "T15n0653_002:0794a14_23"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0794a15_24"
    },
    {
        "source_sentence": "我知不淨說法有此過咎不得正道，是事一切比丘不知、諸天不知，唯我乃知。",
        "translation": "I know that the impure teaching of the Dharma has this fault and doesn't lead to the right path, but all monks don't know it and gods don't know it, so I alone know it.",
        "source": "T15n0653_002:0794a15_25"
    },
    {
        "source_sentence": "復有不淨說法比丘，不解如來隨宜所說，而為他人說。",
        "translation": "Again, there are monks who teach impurely and don't understand what the Tathāgata teaches appropriately but teach it for others.",
        "source": "T15n0653_002:0794a17_26"
    },
    {
        "source_sentence": "諸經中無我、無人、無眾生、無壽命，而是人自以論辭說言有我、有人、有眾生、有壽命。",
        "translation": "In the sūtras, there's no self, no person, no sentient beings, and no life span, but instead people themselves use arguments to say that there's a self, a person, sentient beings, and life span.",
        "source": "T15n0653_002:0794a18_27"
    },
    {
        "source_sentence": "即為謗佛、謗法、謗僧，謗三寶罪。",
        "translation": "That's the sin of denigrating the Buddha, denigrating the Dharma, denigrating the saṃgha, and denigrating the Three Treasures.",
        "source": "T15n0653_002:0794a20_28"
    },
    {
        "source_sentence": "諸天世人所不能知，唯佛乃知。",
        "translation": "The gods and humans cannot know it, but only the Buddha knows it.",
        "source": "T15n0653_002:0794a21_29"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794a21_30"
    },
    {
        "source_sentence": "是人亦名不淨說法。",
        "translation": "That person is also called an impure preacher of the Dharma.",
        "source": "T15n0653_002:0794a22_31"
    },
    {
        "source_sentence": "我知其過，諸神通者及諸天眾皆不能知，唯佛乃知。",
        "translation": "I know their faults, but no one with supernormal powers or gods can know them; only the Buddha knows them.",
        "source": "T15n0653_002:0794a22_32"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0794a23_33"
    },
    {
        "source_sentence": "我今為汝譬喻解說。",
        "translation": "Now, I'll explain it metaphorically for you.",
        "source": "T15n0653_002:0794a23_34"
    },
    {
        "source_sentence": "若人不知佛道義相，而為他人不淨說法，此人成就幾不善事？",
        "translation": "If someone doesn't know the meaning and characteristics of the Buddha's path but speaks impurely for others, how many unwholesome things will this person accomplish?",
        "source": "T15n0653_002:0794a24_35"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794a25_36"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T15n0653_002:0794a25_37"
    },
    {
        "source_sentence": "閻浮提眾生寧為多不？」",
        "translation": "How many sentient beings are there in Jambudvīpa?",
        "source": "T15n0653_002:0794a26_38"
    },
    {
        "source_sentence": "「甚多。",
        "translation": "“There are so many.",
        "source": "T15n0653_002:0794a26_39"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T15n0653_002:0794a26_40"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0794a26_41"
    },
    {
        "source_sentence": "若有惡人盡奪其命，是人得罪寧為多不？」",
        "translation": "If there's a bad person who takes away all of their lives, will this person be guilty?",
        "source": "T15n0653_002:0794a27_42"
    },
    {
        "source_sentence": "「甚多。",
        "translation": "“There are so many.",
        "source": "T15n0653_002:0794a28_43"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T15n0653_002:0794a28_44"
    },
    {
        "source_sentence": "「如是癡人不知佛道，而為他人不淨說法。",
        "translation": "“Thus, a deluded person doesn’t know the Buddha’s path but teaches impurely to others.",
        "source": "T15n0653_002:0794a28_45"
    },
    {
        "source_sentence": "罪多於此。",
        "translation": "There are many more sins here.",
        "source": "T15n0653_002:0794a29_46"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0794a29_47"
    },
    {
        "source_sentence": "是人不淨說法破無上佛道，亦謗過去、未來、今佛。",
        "translation": "That person's impure teaching refutes the unsurpassed Buddha Way and denigrates past, future, and present buddhas.",
        "source": "T15n0653_002:0794a29_48"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0794b01_49"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794b01_50"
    },
    {
        "source_sentence": "若有過去諸佛，說一切法皆畢竟空，無我、無人、無眾生、無壽者、無命者。",
        "translation": "If there were buddhas in the past who taught that all things are ultimately empty, with no self, no person, no sentient beings, no life, and no life.",
        "source": "T15n0653_002:0794b02_51"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794b03_52"
    },
    {
        "source_sentence": "未來諸佛說一切法亦畢竟空，無我、無人、無眾生、無壽者、無命者。",
        "translation": "In the future, the buddhas will teach that all dharmas are also ultimately empty, with no self, no person, no sentient beings, no life, and no life.",
        "source": "T15n0653_002:0794b03_53"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794b05_54"
    },
    {
        "source_sentence": "今現在十方恒河沙世界諸佛，說一切法亦畢竟空，無我、無人、無眾生、無壽者、無命者。",
        "translation": "Now, the buddhas of the Ganges River worlds in the ten directions teach that all dharmas are also ultimately empty, with no self, no person, no sentient being, no life, and no life.",
        "source": "T15n0653_002:0794b05_55"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794b07_56"
    },
    {
        "source_sentence": "是名諸佛無上之法，謂一切法無有體性、無所得空，本性寂滅、無生無滅，",
        "translation": "These are called the unsurpassed qualities of buddhas. That is, all things have no essence or acquired emptiness; their essential nature is void, and there is neither arising nor passing away.",
        "source": "T15n0653_002:0794b07_57"
    },
    {
        "source_sentence": "無有性相自相皆空。",
        "translation": "There's no essence and characteristics, and their own characteristics are all empty.",
        "source": "T15n0653_002:0794b09_58"
    },
    {
        "source_sentence": "如來但為斷諸憶想分別故說，而諸佛菩提無有分別。",
        "translation": "The Tathāgata only explains it in order to stop the discrimination of recollection, but the buddhas' enlightenment has no discrimination.",
        "source": "T15n0653_002:0794b09_59"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0794b11_0"
    },
    {
        "source_sentence": "何等為分別？",
        "translation": "What are their distinctions?",
        "source": "T15n0653_002:0794b11_1"
    },
    {
        "source_sentence": "謂分別者，我見、人見、眾生見、壽見、命見、斷見、常見，凡夫成就是諸分別。",
        "translation": "It means discrimination: views of self, views of persons, views of sentient beings, views of life, views of life, views of annihilation, and views of permanence are the kinds of discrimination that ordinary people make.",
        "source": "T15n0653_002:0794b11_2"
    },
    {
        "source_sentence": "若人無有如是分別，能悉了知一切法空，無我、無人、無眾生、無壽者、無命者。",
        "translation": "If someone doesn't have such a discrimination, they can fully understand the emptiness of all dharmas, which lack self, person, sentient beings, life, and life.",
        "source": "T15n0653_002:0794b13_0"
    },
    {
        "source_sentence": "如是念時心得歡喜，聞第一義空不驚不畏。",
        "translation": "When he thinks this, his mind is joyous, and when he hears the first meaning of emptiness, he isn't frightened or feared.",
        "source": "T15n0653_002:0794b14_1"
    },
    {
        "source_sentence": "是人則知五陰虛妄無有真實，知十二入、十八界虛妄無有真實。",
        "translation": "That person then knows that the five aggregates are false and have no reality, and they know that the twelve sense-fields and 18 elements are false and have no reality.",
        "source": "T15n0653_002:0794b15_2"
    },
    {
        "source_sentence": "是人亦不分別涅槃、不念涅槃、不言我能念涅槃。",
        "translation": "That person doesn't discriminate nirvāṇa, isn't mindful of nirvāṇa, and doesn't say that I can be mindful of nirvāṇa.",
        "source": "T15n0653_002:0794b17_3"
    },
    {
        "source_sentence": "以法得寂滅而不分別，是法所寂滅處，亦不分別亦復不得。",
        "translation": "It's because the Dharma attains quiescence and doesn't discriminate, and this is the place where the Dharma is extinguished, which neither discriminates nor attains it.",
        "source": "T15n0653_002:0794b18_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794b19_5"
    },
    {
        "source_sentence": "是名順忍。",
        "translation": "This is called the forbearance of following.",
        "source": "T15n0653_002:0794b19_6"
    },
    {
        "source_sentence": "是人於是順忍第一義中，亦不得自相。",
        "translation": "That person then follows the first meaning of forbearance and doesn't attain its own distinctive characteristics.",
        "source": "T15n0653_002:0794b20_7"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794b20_8"
    },
    {
        "source_sentence": "何等是順忍相？",
        "translation": "What's the characteristic of conforming to forbearance?",
        "source": "T15n0653_002:0794b21_9"
    },
    {
        "source_sentence": "所謂無相是順忍相。",
        "translation": "The so-called marklessness is the mark of following forbearance.",
        "source": "T15n0653_002:0794b21_10"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0794b21_11"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T15n0653_002:0794b22_12"
    },
    {
        "source_sentence": "若人於此順忍尚不得相，是人若得我相、人相、眾生相、壽相、命相者，",
        "translation": "If someone follows patience and doesn’t yet attain marks here, then if they attain marks of self, marks of person, marks of sentient beings, marks of life, and marks of life,",
        "source": "T15n0653_002:0794b22_13"
    },
    {
        "source_sentence": "無有是處。",
        "translation": "There's no such place.",
        "source": "T15n0653_002:0794b23_14"
    },
    {
        "source_sentence": "若人成就如是智慧，應受供養，是名佛子、是名入不住定。",
        "translation": "If someone has accomplished such wisdom, they should be offered support, which is called a son of the Buddha and which is called entering concentration that doesn't abide.",
        "source": "T15n0653_002:0794b24_15"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0794b25_16"
    },
    {
        "source_sentence": "是名佛法第一義門，謂無憶想分別、無此無彼。",
        "translation": "This is called the first meaning of the Buddha's teaching, which is that there's no recollection, no discrimination, and no here and no there.",
        "source": "T15n0653_002:0794b25_17"
    },
    {
        "source_sentence": "而是癡人在大眾中說於邪見，自以憶想分別教人：『此是佛法、此是聖道。』",
        "translation": "Instead, a deluded person explains wrong views in the masses and teaches them to themselves with recollection and discrimination, 'This is the Buddha's teaching and this is the noble path.'",
        "source": "T15n0653_002:0794b26_18"
    },
    {
        "source_sentence": "如是癡人，則為誹謗過去未來現在諸佛。",
        "translation": "Such a deluded person would denigrate the buddhas of the past, future, and present.",
        "source": "T15n0653_002:0794b28_19"
    },
    {
        "source_sentence": "如是癡人，名惡知識，不名善知識。",
        "translation": "Such a deluded person is called a bad friend and not a good friend.",
        "source": "T15n0653_002:0794b29_20"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794c01_0"
    },
    {
        "source_sentence": "怨雖奪命但失一身，如是癡人不淨說法，千萬億劫為諸眾生作大衰惱。",
        "translation": "Even though the enemy takes away their lives, they only lose one body, and thus a deluded person who doesn't teach the Dharma purely will cause sentient beings great misery for thousands of millions of eons.",
        "source": "T15n0653_002:0794c01_1"
    },
    {
        "source_sentence": "是人癡冥覆佛菩提本心，貪著還復熾盛相續不斷，以貪著故往來五道，",
        "translation": "That person's delusion obscures the Buddha's original mind of enlightenment, and their craving grows more intense and continues without stopping. Because of that craving, they come and go in the five paths.",
        "source": "T15n0653_002:0794c02_2"
    },
    {
        "source_sentence": "無善逕路生死不斷。",
        "translation": "There's no good path, and birth-and-death doesn't stop.",
        "source": "T15n0653_002:0794c04_3"
    },
    {
        "source_sentence": "是故舍利弗！",
        "translation": "Therefore, Śāriputra!",
        "source": "T15n0653_002:0794c05_0"
    },
    {
        "source_sentence": "不淨說法者得罪極多，亦為眾生作惡知識，亦謗過去、未來、今佛。",
        "translation": "Those who teach the Dharma impurely commit so many sins, become bad friends for sentient beings, and denigrate past, future, and present buddhas.",
        "source": "T15n0653_002:0794c05_1"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0794c06_2"
    },
    {
        "source_sentence": "置此閻浮提眾生，若人悉奪三千大千世界眾生命，不淨說法罪多於此。",
        "translation": "If someone were to take all the lives of 3,000 great one-thousand worlds in this Jambudvīpa sentient being, it would be much more sinful to speak impurely.",
        "source": "T15n0653_002:0794c06_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0794c08_4"
    },
    {
        "source_sentence": "是人皆破諸佛阿耨多羅三藐三菩提，為助魔事，亦使眾生於百千萬世受諸衰惱，",
        "translation": "They all destroyed the unexcelled, perfect enlightenment of all buddhas. To aid in the deeds of Māra, they caused sentient beings to suffer various pains for millions and millions of aeons.",
        "source": "T15n0653_002:0794c08_5"
    },
    {
        "source_sentence": "但能作縛不能令解，當知是人於諸眾生為惡知識、為是妄語，於大眾中謗毀諸佛，",
        "translation": "You should know that such people are bad friends to sentient beings and speak falsehoods, slandering the Buddhas in public.",
        "source": "T15n0653_002:0794c10_6"
    },
    {
        "source_sentence": "以是因緣墮大地獄，教多眾生以邪見事，是故名為惡邪見者。",
        "translation": "Because of these causes and conditions, they'll fall into the great hell and teach many sentient beings to engage in wrong views, which is therefore called a person with bad wrong view.",
        "source": "T15n0653_002:0794c12_7"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794c14_0"
    },
    {
        "source_sentence": "我見、人見、眾生見者多墮邪見，斷滅見者多疾得道。",
        "translation": "Those who see self, people, and sentient beings often fall into mistaken views, and those who stop seeing cessation often quickly attain the path.",
        "source": "T15n0653_002:0794c14_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0794c15_2"
    },
    {
        "source_sentence": "是易捨故。",
        "translation": "It's because it's easy to abandon.",
        "source": "T15n0653_002:0794c15_3"
    },
    {
        "source_sentence": "是故當知，是人寧自以利刀割舌，不應眾中不淨說法。」",
        "translation": "Therefore, you should know that this person would rather cut off their tongue with a sharp knife than speak impurely in public.",
        "source": "T15n0653_002:0794c15_4"
    },
    {
        "source_sentence": "佛藏經往古品第七",
        "translation": "The Ancient Chapter Seven of the Buddha Store Sutra",
        "source": "T15n0653_002:0794c17_0"
    },
    {
        "source_sentence": "佛告舍利弗：「過去久遠無量無邊不可思議阿僧祇劫，爾時有佛，號大莊嚴如來、應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "The Buddha told Śāriputra, In the distant past, long, immeasurable, boundless, inconceivable, and incalculable eons ago, there was a Buddha named Mahāprajñāpāramitā Tathāgata, Arhat, Perfectly Enlightened One, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Un",
        "source": "T15n0653_002:0794c18_0"
    },
    {
        "source_sentence": "其佛壽命六十八百萬億歲，有六十八百萬億大弟子眾。",
        "translation": "The Buddha's life span was sixty-eight myriad koṭis of years, and there were sixty-eight myriad koṭis of great disciples.",
        "source": "T15n0653_002:0794c21_1"
    },
    {
        "source_sentence": "其佛滅後舍利流布，如我滅後無有異也，正法住世亦五百歲，如我滅後無有異也。",
        "translation": "The relics will spread after the parinirvāṇa of that Buddha, just as they will not differ after my parinirvāṇa. The true-dharma will also remain in the world for five hundred years, just as it will not differ after my parinirvāṇa.",
        "source": "T15n0653_002:0794c22_2"
    },
    {
        "source_sentence": "其佛滅後大弟子眾，於中一日有百比丘入涅槃者，二百三百四百五百入涅槃者，",
        "translation": "One day, there were a hundred monks among the great disciples who entered nirvana after the parinirvāṇa of that Buddha. Two hundred and three hundred and four hundred and five hundred entered nirvana.",
        "source": "T15n0653_002:0794c24_3"
    },
    {
        "source_sentence": "一日之中或有十萬億比丘入涅槃者。",
        "translation": "In a single day, there might be 100,000 million monks who enter nirvāṇa.",
        "source": "T15n0653_002:0794c26_4"
    },
    {
        "source_sentence": "如是展轉，其佛所有多知多識大神通眾，三月之中皆入涅槃。",
        "translation": "In this way, in succession, all the learned and well-known great mystic beings of that Buddha entered nirvana within three months.",
        "source": "T15n0653_002:0794c27_5"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0794c28_6"
    },
    {
        "source_sentence": "大莊嚴佛正法流布，多諸天人所共供養。",
        "translation": "The great adornment of the Buddha's right teaching is spread, and many gods and humans make offerings together.",
        "source": "T15n0653_002:0794c28_7"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0794c29_8"
    },
    {
        "source_sentence": "大莊嚴佛及大弟子滅度之後，漸多有人知沙門法安隱快樂出家學道，而不能知佛所演說甚深諸經無等空義，",
        "translation": "“After the parinirvāṇa of Mahāprajñāpāramitā Buddha and his great disciples, there gradually grew many people who knew that the śramaṇas and brāhmaṇas were peaceful and happy to renounce domestic life in order to study the path but did not know the profound meaning of the incomparable emptiness of all the scriptures taught by the",
        "source": "T15n0653_002:0794c29_9"
    },
    {
        "source_sentence": "多為惡魔之所迷惑。",
        "translation": "They're often confused by bad demons.",
        "source": "T15n0653_002:0795a03_10"
    },
    {
        "source_sentence": "時說法者心不決定說不清淨，說有我、人、眾生、壽命，不說一切諸法空寂。",
        "translation": "When he teaches the Dharma, his mind isn't determined to explain impurity or purity, saying that there's self, people, sentient beings, and life, and not all dharmas are empty and quiescent.",
        "source": "T15n0653_002:0795a03_11"
    },
    {
        "source_sentence": "其佛滅度百歲之後，諸弟子眾分為五部：一名、普事。",
        "translation": "One hundred years after the parinirvāṇa of that Buddha, the disciples were divided into five groups: one group and universal service.",
        "source": "T15n0653_002:0795a05_12"
    },
    {
        "source_sentence": "二名、苦岸。",
        "translation": "The second is called the shore of suffering.",
        "source": "T15n0653_002:0795a06_13"
    },
    {
        "source_sentence": "三名、薩和多。",
        "translation": "The three names are sarvata.",
        "source": "T15n0653_002:0795a06_14"
    },
    {
        "source_sentence": "四名、將去。",
        "translation": "The fourth name is going to leave.",
        "source": "T15n0653_002:0795a07_15"
    },
    {
        "source_sentence": "五名、跋難陀。",
        "translation": "The five names are Upananda.",
        "source": "T15n0653_002:0795a07_16"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0795a07_17"
    },
    {
        "source_sentence": "此普事比丘、苦岸比丘、薩和多比丘、將去比丘、跋難陀比丘，是五比丘為大眾師。",
        "translation": "These are the five monks of universal service, the monk of the painful shore, the monk of sarvatra, the monk who's about to leave, and the monk of upananda, which are the teachers of the masses.",
        "source": "T15n0653_002:0795a07_18"
    },
    {
        "source_sentence": "其普事者知佛所說真實空義無所得法，餘四比丘皆隨邪道，多說有我多說有人。",
        "translation": "Those who universally serve know the true meaning of emptiness taught by the Buddha as an ungraspable dharma, and the other four monks all follow wrong paths, often saying there's self and often saying there's someone.",
        "source": "T15n0653_002:0795a09_19"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795a11_20"
    },
    {
        "source_sentence": "普事比丘，為四部所輕無有勢力多人惡賤；",
        "translation": "He served the monks everywhere, being despised by the four groups of Buddhist followers (i.e., clergy, laymen, and non-Buddhists) because he did not have the power to condemn many people with evil characteristics.",
        "source": "T15n0653_002:0795a12_0"
    },
    {
        "source_sentence": "四惡比丘多教人眾以邪見道，於佛法中不相恭敬，相違逆故以滅佛法。",
        "translation": "The four bad monks often teach people the path of wrong views because they don't respect each other in the Buddha's teaching and cease the Buddha's teaching because they disagree with each other.",
        "source": "T15n0653_002:0795a13_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795a14_1"
    },
    {
        "source_sentence": "若有人知普事比丘所說空法信受不逆，我知此人曾於先世供養五千佛，",
        "translation": "If there is anyone who knows the doctrine of voidness taught by the World-Honored Bhikṣu and does not reject it, I know that such a person has served five thousand buddhas in past lives.",
        "source": "T15n0653_002:0795a14_2"
    },
    {
        "source_sentence": "有六十八億那由他人已入涅槃。",
        "translation": "Sixty-eight billion nayutas have entered nirvāṇa.",
        "source": "T15n0653_002:0795a16_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0795a17_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795a17_5"
    },
    {
        "source_sentence": "此人於過去世諸佛所種諸善根，修習無所得空法應入涅槃。",
        "translation": "This person planted good roots in the buddhas of past lives and cultivated the ungraspable teaching of emptiness, and they should enter nirvāṇa.",
        "source": "T15n0653_002:0795a17_6"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0795a19_7"
    },
    {
        "source_sentence": "是苦岸比丘、一切有比丘、將去比丘、跋難陀比丘，皆計有所得，說有我、人、眾生、壽命，",
        "translation": "That monk on the side of suffering, all other monks, those who were about to leave, and the monks of Upananda all thought they had gained something, saying that there was a self, a person, sentient being, or life span.",
        "source": "T15n0653_002:0795a19_8"
    },
    {
        "source_sentence": "徒眾熾盛。",
        "translation": "The disciples flourish in great numbers.",
        "source": "T15n0653_002:0795a21_9"
    },
    {
        "source_sentence": "是四惡人多令在家出家住於邪見，捨第一義無所有畢竟空法，貪樂外道尼揵子論。",
        "translation": "These four bad people often cause laypeople and renunciants to abide in wrong views, abandon the ultimate emptiness that has no existence in the ultimate sense as the first thing, and crave non-Buddhist theories like the Nirgrantha sayings.",
        "source": "T15n0653_002:0795a21_10"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795a23_11"
    },
    {
        "source_sentence": "是四惡人，所有在家出家弟子，常相隨逐乃至法盡。",
        "translation": "These four bad people, all householders and renunciant disciples, always follow each other until the end of the teaching.",
        "source": "T15n0653_002:0795a23_12"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795a24_13"
    },
    {
        "source_sentence": "是中有人知非法事，受以為法勤心行之，猶尚不得順忍，況得須陀洹果？",
        "translation": "This is a case where someone knows an unlawful thing and accepts it with diligence because of the teaching, but they still can't tolerate it, so why wouldn't they attain the fruit of stream entry?",
        "source": "T15n0653_002:0795a24_14"
    },
    {
        "source_sentence": "是人猶尚不作消供養事，何況能生順忍？",
        "translation": "That person still doesn't make exorcist offerings, so how could they give rise to compliant tolerance?",
        "source": "T15n0653_002:0795a26_15"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0795a27_16"
    },
    {
        "source_sentence": "爾時在家、出家弟子，多墮惡道不至善道，是諸惡人滅佛正法，亦與多人大衰惱事。",
        "translation": "At the time, many householders and renunciant disciples often fell into bad destinies and didn't reach good destinies, which are bad people who ceased the Buddha's right teaching and became a cause of great discomfort for many people.",
        "source": "T15n0653_002:0795a27_17"
    },
    {
        "source_sentence": "又是惡人命終之後，墮阿鼻地獄，仰臥九百萬億歲；",
        "translation": "Again, when the evil person dies, he will fall into avīci hell and remain lying cross-legged for nine hundred myriads of koṭis of years.",
        "source": "T15n0653_002:0795a29_18"
    },
    {
        "source_sentence": "伏臥九百萬億歲；",
        "translation": "He lay down nine hundred myriads of koṭis of koṭis of years.",
        "source": "T15n0653_002:0795b01_19"
    },
    {
        "source_sentence": "左脇臥九百萬億歲；",
        "translation": "He was lying on his left side for nine hundred myriads of koṭis of years.",
        "source": "T15n0653_002:0795b02_20"
    },
    {
        "source_sentence": "右脇臥九百萬億歲。",
        "translation": "He was lying on his right side for nine hundred million billion years.",
        "source": "T15n0653_002:0795b02_21"
    },
    {
        "source_sentence": "於熱鐵上燒然燋爛，是中退死，更生炙地獄、大炙地獄、活地獄、黑繩地獄，",
        "translation": "They will be burned and scorched on a hot iron fire. There they will fall away from this hell and be reborn in Roasting Hell, Great Roasting Hell, Still alive Hell, and Black Rope Hell.",
        "source": "T15n0653_002:0795b03_22"
    },
    {
        "source_sentence": "皆如上歲數受諸苦惱，於黑繩地獄死還生阿鼻大地獄中。",
        "translation": "They'll all suffer pain and suffering for the same number of years as the above, dying in Black Rope Hell and being reborn back into the great hell of Avīci Hell.",
        "source": "T15n0653_002:0795b04_23"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795b06_0"
    },
    {
        "source_sentence": "以是因緣，若在家出家親近此人，及善知識并諸檀越，凡有六百四萬億人，",
        "translation": "Because of these causes and conditions, there were six hundred and forty myriads of koṭis of lay Buddhist monks who had renounced the householder’s life to become intimate with this man, along with their spiritual benefactors and other donors.",
        "source": "T15n0653_002:0795b06_1"
    },
    {
        "source_sentence": "與此四師俱生俱死，在大地獄受諸燒煮。",
        "translation": "They'll be born and die together with these four teachers, and they'll be burned in the great hell.",
        "source": "T15n0653_002:0795b07_2"
    },
    {
        "source_sentence": "如是舍利弗！",
        "translation": "Thus, Śāriputra!",
        "source": "T15n0653_002:0795b08_3"
    },
    {
        "source_sentence": "是人所有善知識家、諸檀越家，弟子諸師、隨順行者，凡在其數皆生地獄。",
        "translation": "That person's families of good teachers, donors, disciples, teachers, and practitioners who follow them will all be born in hell wherever they are.",
        "source": "T15n0653_002:0795b09_4"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0795b10_5"
    },
    {
        "source_sentence": "汝等不能知其多少，唯有如來乃能知之，與此惡人墮大地獄俱生俱死，",
        "translation": "But you do not know the number of these bodhisattvas. Only the Tathāgata knows their numbers.",
        "source": "T15n0653_002:0795b10_6"
    },
    {
        "source_sentence": "凡有六百四萬億人，如是展轉一劫受苦，大劫將燒故在地獄。",
        "translation": "In this way six hundred and four thousand myriads of koṭis of people were tormented for one kalpa. The great kalpa was about to burn them up in the hells.",
        "source": "T15n0653_002:0795b12_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0795b14_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795b14_1"
    },
    {
        "source_sentence": "破諸如來阿耨多羅三藐三菩提，其罪甚重不為輕也。",
        "translation": "To refute the Tathāgatas' unsurpassed, correct, and complete enlightenment is a serious offense that isn't light.",
        "source": "T15n0653_002:0795b14_2"
    },
    {
        "source_sentence": "大劫若燒，是四惡人及六百四萬億人從此阿鼻大地獄中，轉生他方在大地獄。",
        "translation": "If the great kalpa is burned, these are the four bad people and sixty-four myriads of koṭis of people who will be reborn elsewhere in the great hell from here in Avīci Hell.",
        "source": "T15n0653_002:0795b15_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0795b17_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795b17_5"
    },
    {
        "source_sentence": "重罪具足其報不少，在於他方無數百千萬億那由他歲受大苦惱，世界還生，",
        "translation": "The world will be reborn, having suffered great pain and suffering for hundreds of thousands of myriads of koṭis of nayutas of years in other directions.",
        "source": "T15n0653_002:0795b17_6"
    },
    {
        "source_sentence": "是四罪人及六百四萬億人，并及餘人罪未畢者，於彼命終還生此間大地獄中。",
        "translation": "These four sinners and six hundred and forty myriads of koṭis of people, as well as the others who have not yet expiated their crimes, will be reborn back into this great hell at the end of their life.",
        "source": "T15n0653_002:0795b19_7"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0795b21_8"
    },
    {
        "source_sentence": "是四罪人及六百四萬億眾生，久久雖免地獄苦惱得生人中，於五百世從生而盲，",
        "translation": "For a long time these four sinners and six hundred and forty myriad koṭis of sentient beings escaped punishment in hell and were reborn among humans. After five hundred world ages, they came into existence and died blind.",
        "source": "T15n0653_002:0795b21_9"
    },
    {
        "source_sentence": "然後得值一切明佛如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "Then he'll be able to meet all the Tathāgatas of insight, Worthy of Offerings, Perfectly Enlightened, Perfect in Knowledge and Conduct, Well-gone, Understander of the World, Unsurpassed, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavān.",
        "source": "T15n0653_002:0795b23_10"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795b25_11"
    },
    {
        "source_sentence": "一切明佛聲聞弟子一億那由他。",
        "translation": "They all explain that the Buddha's śrāvaka disciples are one hundred million nayutas.",
        "source": "T15n0653_002:0795b25_12"
    },
    {
        "source_sentence": "爾時人民身長三百九十六肘，佛身一倍，常光圓照十萬億由旬。",
        "translation": "At the time, the people's body was three hundred and ninety-six feet in height, and the Buddha's body was doubly long, always shining perfectly brightly for a hundred thousand million yojanas.",
        "source": "T15n0653_002:0795b26_13"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795b27_14"
    },
    {
        "source_sentence": "是人於一切明佛法中出家，十萬億歲勤行精進如救頭然，不得順忍，況得道果？",
        "translation": "That person leaves home in all ways to explain the Buddha's teaching, diligently exerting themselves for 10,000,000 years like a hair-saving rescue, and they can't tolerate it, so why wouldn't they attain the fruit of the path?",
        "source": "T15n0653_002:0795b28_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0795b29_16"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795c01_17"
    },
    {
        "source_sentence": "起破阿耨多羅三藐三菩提罪業因緣，法應當爾。",
        "translation": "It's the law that gives rise to the causes and conditions for sinful actions that destroy unsurpassed, correct, and complete enlightenment, and it should be so.",
        "source": "T15n0653_002:0795c01_18"
    },
    {
        "source_sentence": "命終之後還生阿鼻大地獄中，以先起重不善業因緣。",
        "translation": "After death, they'll be reborn back in the avīci great hell because of the causes and conditions for serious unwholesome actions that first arose.",
        "source": "T15n0653_002:0795c02_19"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0795c03_20"
    },
    {
        "source_sentence": "是諸人等如是展轉，乃至我今於其中間，得值九十九億佛，於諸佛所不得順忍。",
        "translation": "These people and so forth will continue like this, up to the point where I'll now meet 9.7 billion buddhas among them, and they won't be able to tolerate it in the presence of those buddhas.",
        "source": "T15n0653_002:0795c03_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0795c05_22"
    },
    {
        "source_sentence": "佛說深經是人不信，破壞違逆謗毀賢聖持戒比丘，出其過惡起破法業因緣，",
        "translation": "When the Buddha teaches a profound sūtra, this person doesn't believe it, disrupts and disobeys monks who disparage good and noble precept-holders, and produces the causes and conditions for their faults and bad actions that break the Dharma.",
        "source": "T15n0653_002:0795c05_23"
    },
    {
        "source_sentence": "法應當爾。",
        "translation": "The Dharma should be like this.",
        "source": "T15n0653_002:0795c07_24"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0795c07_25"
    },
    {
        "source_sentence": "汝且觀之，誹謗聖人不信聖語，受是無量無邊苦惱不得解脫。",
        "translation": "Observe them, for they denigrate sages who don't believe in the noble words and experience this immeasurable, limitless, and painful suffering that doesn't lead to liberation.",
        "source": "T15n0653_002:0795c08_26"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795c09_27"
    },
    {
        "source_sentence": "有諸眾生起破法罪業違逆不信者，其數無量，於九十九億佛所阿僧祇劫，",
        "translation": "The number of those sentient beings who committed crimes against the Dharma and disobeyed them was immeasurable. For an incalculably long eon, when there were ninety-nine hundred million buddhas,",
        "source": "T15n0653_002:0795c09_28"
    },
    {
        "source_sentence": "乃無一人入涅槃者。",
        "translation": "There's no one who enters nirvāṇa.",
        "source": "T15n0653_002:0795c11_29"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795c11_30"
    },
    {
        "source_sentence": "誰能破諸佛教不信違逆？",
        "translation": "Who can refute the teachings of Buddhism and not believe in disobedience?",
        "source": "T15n0653_002:0795c12_0"
    },
    {
        "source_sentence": "但凡夫愚癡，及增上慢諸惡比丘，并諸不淨說法比丘。",
        "translation": "It's just that ordinary people are foolish and arrogant, bad monks with excessive conceit, and impure Dharma-teaching monks.",
        "source": "T15n0653_002:0795c12_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0795c13_2"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795c14_0"
    },
    {
        "source_sentence": "是三種人不名行者、不名得者。",
        "translation": "These are the three kinds of people who aren't called practitioners and aren't called attainers.",
        "source": "T15n0653_002:0795c14_1"
    },
    {
        "source_sentence": "是人不信如來法故，毀謗違逆。",
        "translation": "Because they don't believe in the Tathāgata's teaching, they disparage and disobey it.",
        "source": "T15n0653_002:0795c14_2"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0795c15_3"
    },
    {
        "source_sentence": "若汝謂何者是苦岸比丘不淨說法者？",
        "translation": "If you say, What's the monk on the painful shore who doesn't teach the Dharma purely?",
        "source": "T15n0653_002:0795c15_4"
    },
    {
        "source_sentence": "即調達癡人是。",
        "translation": "That's the person who tames the deluded.",
        "source": "T15n0653_002:0795c16_5"
    },
    {
        "source_sentence": "汝謂何者是一切有比丘不淨說法者，即拘迦離比丘是。",
        "translation": "What do you mean by that? All the bhikṣus who teach impure doctrine are none other than the bhikṣu Kanakamuni.",
        "source": "T15n0653_002:0795c17_6"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795c18_7"
    },
    {
        "source_sentence": "汝謂何者是將去比丘不淨說法者。",
        "translation": "What do you say, 'Who is this monk who's about to leave and doesn't teach the Dharma purely?'",
        "source": "T15n0653_002:0795c18_8"
    },
    {
        "source_sentence": "即迦羅比丘是。",
        "translation": "That's the monk Kālā.",
        "source": "T15n0653_002:0795c19_9"
    },
    {
        "source_sentence": "汝謂何者是跋難陀比丘不淨說法者，即裸形沙門波利摩陀是。",
        "translation": "What do you say, 'Who is this monk Upananda who doesn't teach the Dharma purely?' That's the naked ascetic Pālimaṇḍa.",
        "source": "T15n0653_002:0795c19_10"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795c21_11"
    },
    {
        "source_sentence": "汝謂爾時清淨如實說諸佛菩提，利益無量眾生者，即是富樓那彌多羅尼子。",
        "translation": "You say that the pure and true explanation of the buddhas' enlightenment at that point, which benefits measureless sentient beings, is Pūrṇa Maitrāyaṇīputra.",
        "source": "T15n0653_002:0795c21_12"
    },
    {
        "source_sentence": "所說清淨，諸隨學者得值五千佛，有六十八億那由他人，皆已滅度。",
        "translation": "The teachings are pure, and the followers of the Way will be able to meet 5,000 buddhas, with sixty-eight billion nayutas who have all been liberated.",
        "source": "T15n0653_002:0795c23_13"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0795c24_14"
    },
    {
        "source_sentence": "若人實語，何者為是最上法師決了法義清淨說者？",
        "translation": "If someone speaks the truth, what's the most excellent teacher of the Dharma who explains the pure meaning of the teaching with certainty?",
        "source": "T15n0653_002:0795c24_15"
    },
    {
        "source_sentence": "當說富樓那是。",
        "translation": "You should say that it's Pūrvavideha.",
        "source": "T15n0653_002:0795c26_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795c26_1"
    },
    {
        "source_sentence": "富樓那定心決了所說無難，無有所疑而生論議。",
        "translation": "Pūrṇa's concentrated mind is resolute in explaining what's explained without difficulty, and he has no doubts that give rise to arguments.",
        "source": "T15n0653_002:0795c26_2"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795c27_3"
    },
    {
        "source_sentence": "若人實說，何者是一切因緣法師？",
        "translation": "If someone really explains it, then what's the teacher of all causes and conditions?",
        "source": "T15n0653_002:0795c27_4"
    },
    {
        "source_sentence": "當說富樓那是。",
        "translation": "You should say that it's Pūrvavideha.",
        "source": "T15n0653_002:0795c28_5"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0795c29_6"
    },
    {
        "source_sentence": "富樓那世世所生，常為眾生而作佛事。",
        "translation": "Pūrṇa was born in the world and always did buddha-work for sentient beings.",
        "source": "T15n0653_002:0795c29_7"
    },
    {
        "source_sentence": "於九十億諸佛法中，常作法師清淨說法，皆於諸佛所盡其形壽，常修梵行清淨說法。",
        "translation": "In nine billion buddha-teachings, he always serves as a teacher of the Dharma who purely explains the teachings, and they all spend their whole lives in the presence of the buddhas, always cultivating the religious practice to purify the pure teaching.",
        "source": "T15n0653_002:0796a01_8"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796a03_9"
    },
    {
        "source_sentence": "富樓那亦於六佛法中而作法師，亦於我法作大法師，成阿羅漢心得解脫。",
        "translation": "Pūrṇa also served as a teacher of the Dharma in the teachings of the six buddhas and became a great teacher of the Dharma in my teachings, becoming an arhat whose mind was liberated.",
        "source": "T15n0653_002:0796a03_10"
    },
    {
        "source_sentence": "若人實說，何人世世供養諸佛種諸善根？",
        "translation": "If someone really says that, who will make offerings to the good roots of the buddhas throughout the world?",
        "source": "T15n0653_002:0796a05_11"
    },
    {
        "source_sentence": "當說富樓那是。",
        "translation": "You should say that it's Pūrvavideha.",
        "source": "T15n0653_002:0796a06_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796a06_1"
    },
    {
        "source_sentence": "富樓那於九十億諸佛法中，勤心求學決定議論，有深智慧。",
        "translation": "Pūrṇa diligently sought and studied the nine billion buddha-teachings with a determined mind, had profound wisdom, and was wise in his deliberations.",
        "source": "T15n0653_002:0796a06_2"
    },
    {
        "source_sentence": "是故如來於諸法師說為第一。",
        "translation": "Therefore, the Tathāgata is the first among all the masters of the Dharma.",
        "source": "T15n0653_002:0796a07_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796a08_4"
    },
    {
        "source_sentence": "若我一日一夜稱說富樓那功德不盡，若過一日一夜亦復不盡。",
        "translation": "If I praise the merits of Pūrṇa for a day and a night and don't run out, or if they go beyond a day and a night, they won't run out.",
        "source": "T15n0653_002:0796a08_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0796a10_6"
    },
    {
        "source_sentence": "富樓那法施，無俗因緣不貪利養，富樓那法師得四無礙智。",
        "translation": "Pūrṇa's Dharma gift has no secular causes or conditions and doesn't crave profit, and the Dharma teacher Pūrṇa attains four kinds of unhindered cognition.",
        "source": "T15n0653_002:0796a10_7"
    },
    {
        "source_sentence": "唯除如來，諸世間中言辭義理無能勝者。",
        "translation": "Except for the Tathāgata, there's no one in the world who can surpass him in terms of words and principles.",
        "source": "T15n0653_002:0796a11_8"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0796a12_9"
    },
    {
        "source_sentence": "我今告汝，若人欲得阿耨多羅三藐三菩提為人說法，則得無量無邊福德，",
        "translation": "I now tell you, if someone wants to attain unexcelled complete perfect enlightenment and teaches the Dharma to others, they’ll attain measureless and boundless merit.",
        "source": "T15n0653_002:0796a12_10"
    },
    {
        "source_sentence": "亦能利益無量眾生。",
        "translation": "They can also benefit measureless sentient beings.",
        "source": "T15n0653_002:0796a14_11"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796a15_12"
    },
    {
        "source_sentence": "若人破壞違逆不信是法者，則起無量重罪因緣。",
        "translation": "If someone disrupts and disobeys the teaching and doesn't believe in it, then they'll give rise to measureless causes and conditions for serious crimes.",
        "source": "T15n0653_002:0796a15_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0796a16_14"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796a16_15"
    },
    {
        "source_sentence": "惡有惡報善有善報。",
        "translation": "Bad has bad consequences, and good has a good result.",
        "source": "T15n0653_002:0796a16_16"
    },
    {
        "source_sentence": "我以此故，今以是經囑累於汝，當為四眾廣說分別。",
        "translation": "Because of this, I'll now entrust this sūtra to you and explain it in detail for the four groups of people.",
        "source": "T15n0653_002:0796a17_17"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796a18_18"
    },
    {
        "source_sentence": "若聞是經心信歡喜，即得無量無邊福德。",
        "translation": "If someone hears this sūtra and faithfully believes it, they'll attain measureless and limitless merit.",
        "source": "T15n0653_002:0796a18_19"
    },
    {
        "source_sentence": "若聞不信心不喜樂，即得無量無邊重罪。",
        "translation": "If someone hears that they don't believe and don't rejoice, they'll attain measureless and limitless serious offenses.",
        "source": "T15n0653_002:0796a19_20"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796a20_21"
    },
    {
        "source_sentence": "當知是人名為破戒比丘、若增上慢、不淨說法者。",
        "translation": "You should know that person is called a monk who breaks the precepts, or someone who speaks with increased conceit and impurity.",
        "source": "T15n0653_002:0796a20_22"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796a21_23"
    },
    {
        "source_sentence": "若人違逆如是教者，世世所生常盲無目。",
        "translation": "If someone disobeys such a teaching, they'll be born throughout the world always blind and without eyes.",
        "source": "T15n0653_002:0796a21_24"
    },
    {
        "source_sentence": "「舍利弗，我今明了告汝，我今所說非如陶師愛護坏器。",
        "translation": "Śāriputra, I will now clearly tell you that what I've explained is not like the potter who loves protecting a broken vessel.",
        "source": "T15n0653_002:0796a22_25"
    },
    {
        "source_sentence": "我今分明廣為四眾，說第一義畢竟空法。",
        "translation": "Now, I'll explain in detail and explain the ultimate emptiness of the first meaning for the four groups of people.",
        "source": "T15n0653_002:0796a24_26"
    },
    {
        "source_sentence": "堅固者在，不堅固者破。",
        "translation": "What's resolute is present, and what's not resolute breaks through.",
        "source": "T15n0653_002:0796a25_27"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0796a25_28"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796a25_29"
    },
    {
        "source_sentence": "佛得阿耨多羅三藐三菩提，不為邪見惡人說法，不為我見、人見、眾生見、壽命見者說法。",
        "translation": "The Buddha attains supreme perfect enlightenment and doesn't teach the Dharma for wrong views and bad people, and he doesn't teach the Dharma for those who see self, see people, see sentient beings, or see life.",
        "source": "T15n0653_002:0796a26_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0796a27_1"
    },
    {
        "source_sentence": "是諸貪著皆名邪見。",
        "translation": "These cravings and attachments are all called wrong views.",
        "source": "T15n0653_002:0796a28_2"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796a28_3"
    },
    {
        "source_sentence": "如是我見、人見不得順忍，況得道果？",
        "translation": "Thus, this view of self and human views can't be tolerated, so why wouldn't they attain the fruit of the path?",
        "source": "T15n0653_002:0796a28_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796a29_5"
    },
    {
        "source_sentence": "若我見、人見、眾生見、壽命見、斷見、常見者，能得順忍、能得道果，",
        "translation": "If someone has views of self, views of persons, views of sentient beings, views of life, views of annihilation, and views of permanence, they can attain the fruit of patience that accords with conformity and the fruit of the path.",
        "source": "T15n0653_002:0796a29_6"
    },
    {
        "source_sentence": "無有是處。",
        "translation": "There's no such place.",
        "source": "T15n0653_002:0796b02_7"
    },
    {
        "source_sentence": "是故舍利弗！",
        "translation": "Therefore, Śāriputra!",
        "source": "T15n0653_002:0796b02_8"
    },
    {
        "source_sentence": "若人成就如是見者，於我法中我則不聽受諸供養，是非行者，亦非得者，",
        "translation": "If someone has such a view, I won’t listen to or accept offerings in my teaching. They are neither practitioners nor those who attain them.",
        "source": "T15n0653_002:0796b02_9"
    },
    {
        "source_sentence": "但於我法求自活命。",
        "translation": "They simply seek their own livelihood in the self and dharmas.",
        "source": "T15n0653_002:0796b04_10"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0796b04_11"
    },
    {
        "source_sentence": "我說外道欲入佛法，應試四月。",
        "translation": "I'll explain that non-Buddhists who want to enter the Buddha's teaching should test it for four months.",
        "source": "T15n0653_002:0796b05_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0796b05_1"
    },
    {
        "source_sentence": "諸外道人，多有我見、人見、眾生見、壽命見、斷見、常見。",
        "translation": "Many non-Buddhist people have views of self, humans, sentient beings, longevity, cessation, and permanence.",
        "source": "T15n0653_002:0796b05_2"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796b07_3"
    },
    {
        "source_sentence": "我諸弟子，無有我見、人見、眾生見、壽命見、斷見、常見。",
        "translation": "My disciples have no view of self, view of person, view of sentient beings, view of life, view of annihilation, or view of permanence.",
        "source": "T15n0653_002:0796b07_4"
    },
    {
        "source_sentence": "我諸弟子！",
        "translation": "I, my disciples!",
        "source": "T15n0653_002:0796b08_5"
    },
    {
        "source_sentence": "但說空、無相、無願、無所得忍，說識無所住。",
        "translation": "He simply explains the tolerance of emptiness, signlessness, wishlessness, and nongrasping, and explains that consciousness has no place to abide.",
        "source": "T15n0653_002:0796b08_6"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796b09_7"
    },
    {
        "source_sentence": "若有成就如是忍者，我聽是人出家受戒，得受供養衣服飲食、臥具醫藥。",
        "translation": "If someone has accomplished such a ninja, I'll allow them to leave home and accept the precepts, and they'll receive offerings of clothing, food, bedding, and medicine.",
        "source": "T15n0653_002:0796b09_8"
    },
    {
        "source_sentence": "若人無是忍者，應先試之，先教令住諸法無我。",
        "translation": "If someone doesn't have this ninja, they should first test him and first teach him to abide in the selflessness of dharmas.",
        "source": "T15n0653_002:0796b11_9"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796b12_10"
    },
    {
        "source_sentence": "若於此忍心不歡喜，聞說第一義空驚疑譏訶，聞說我見心則歡喜，當知是人為魔所使，",
        "translation": "Those who are not delighted by this tolerance but rejoice when they hear the teaching of the ultimate truth about emptiness, being frightened and criticized for doubting it. And those who rejoice when they hear doctrine that holds a view of self-existence. You should know that such people are messengers of Māra.",
        "source": "T15n0653_002:0796b12_11"
    },
    {
        "source_sentence": "若先外道。",
        "translation": "Suppose someone were to precede a non-Buddhist.",
        "source": "T15n0653_002:0796b14_12"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0796b14_13"
    },
    {
        "source_sentence": "智者於此不應生憂，但於此人應生悲心。",
        "translation": "A wise person shouldn't give rise to grief here, but give rise to compassion for this person.",
        "source": "T15n0653_002:0796b15_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0796b16_0"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796b16_1"
    },
    {
        "source_sentence": "若人成就如是惡者，所獲惡報說不可盡，當於此人生利益心，教以諸法無我、諸法空寂、諸法無作、無有受者。",
        "translation": "If someone accomplishes such an evil, the bad retribution they'll receive can't be explained in full, so they should give rise to a mind of benefiting sentient beings here and teach them that things are without self, that things are empty and quiescent, that things are unconstructed, and that there's no recipient.",
        "source": "T15n0653_002:0796b16_2"
    },
    {
        "source_sentence": "是人若愛佛法，得聞是事心喜樂者，其餘空行比丘無所得者，皆應示教利喜安慰其心，",
        "translation": "If that person loves the Buddha’s teaching and is delighted to hear it, then all the other monks who practice emptiness but do not attain anything should be shown instruction, benefit, joy, and comfort.",
        "source": "T15n0653_002:0796b18_3"
    },
    {
        "source_sentence": "為說諸法無所有空；",
        "translation": "I elucidate emptiness by explaining that all things have no existence.",
        "source": "T15n0653_002:0796b20_4"
    },
    {
        "source_sentence": "若聞驚畏，應於眾中語其和上阿闍梨，如經中說行空行者。",
        "translation": "If he's frightened, he should speak to his superior preceptor among the monks in the assembly, as the sūtras say when he practices emptiness.",
        "source": "T15n0653_002:0796b21_5"
    },
    {
        "source_sentence": "又能了知諸法別相，我與為師，不與我見、人見、顛倒邪見，貪著持戒者為師。",
        "translation": "They can also know the distinctive characteristics of dharmas, and I'm their teacher, not self-view, view of people, mistaken views, or mistaken wrong views, and those who cling to observance of precepts are their teachers.",
        "source": "T15n0653_002:0796b22_6"
    },
    {
        "source_sentence": "「如來聽許具正見者而共布薩，不聽破戒邪見之人、破威儀者而共布薩。",
        "translation": "The Tathāgata listens to those who have right view and shares the common bodhisattva, doesn't listen to those who break the precepts with wrong views and those who break their manners and share the common bodhisattva.",
        "source": "T15n0653_002:0796b24_7"
    },
    {
        "source_sentence": "長老弟子聞說空寂無所有法，心不信樂志在外道，佛不聽與外道布薩，",
        "translation": "When the elder disciple heard this discourse on emptiness, quiescence, and nonexistence of dharmas, his mind did not believe in it. He cherished the thought that he belonged to heretics. The Buddha would not allow him to teach the Dharma to heretics.",
        "source": "T15n0653_002:0796b26_0"
    },
    {
        "source_sentence": "是人若當不捨是見，不應聽使得入僧事，亦不受其欲。",
        "translation": "If that person doesn't abandon this view, they won't be allowed to enter the affairs of the saṃgha and won't accept their desires.",
        "source": "T15n0653_002:0796b27_1"
    },
    {
        "source_sentence": "如是作已猶故不捨，當知是人不得在道便是永棄，應語其和上阿闍梨，",
        "translation": "Having done so, they still won't abandon it. You should know that this person can't abandon it forever if they don't attain the path, and you should tell their superior preceptor,",
        "source": "T15n0653_002:0796b28_2"
    },
    {
        "source_sentence": "不應復畜。",
        "translation": "It shouldn't be stored again.",
        "source": "T15n0653_002:0796c01_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796c01_4"
    },
    {
        "source_sentence": "若僧如是則供養我，亦為善破外道邪見，是名清淨說戒布薩。",
        "translation": "If the saṃgha thus makes offerings to me and well refutes the mistaken views of non-Buddhists, this is called a purely explained precept preaching bodhisattva.",
        "source": "T15n0653_002:0796c02_0"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0796c03_1"
    },
    {
        "source_sentence": "我今明了告汝，若人受是我見、人見、眾生見、有無見，是人不名供養於我、不名隨我出家受戒，",
        "translation": "If someone receives views of self, views of person, views of sentient beings, and views of existence and nonexistence, that person isn’t called an offering to me or a renunciant who follows my example and accepts the precepts.",
        "source": "T15n0653_002:0796c03_2"
    },
    {
        "source_sentence": "是名隨逐六師出家，以六師為師。",
        "translation": "This is called following the six masters and leaving home, using the six masters as their teacher.",
        "source": "T15n0653_002:0796c05_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796c06_4"
    },
    {
        "source_sentence": "若人於是清淨實法不能得忍，而受供養，是人所得則為邪受。",
        "translation": "If someone doesn't tolerate this pure and real teaching and receives an offering, that person's attainment will be a wrong experience.",
        "source": "T15n0653_002:0796c06_5"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796c08_6"
    },
    {
        "source_sentence": "是人雖於我法中出家護持淨戒，而於第一義空無所得法，心不信解驚怖疑悔，",
        "translation": "Even though they renounce the householder’s life in order to follow my teaching and keep pure precepts, yet their minds do not believe in the ultimate truth of emptiness as ungraspable reality. They are terrified and doubtful,",
        "source": "T15n0653_002:0796c08_7"
    },
    {
        "source_sentence": "當知是人但貴持戒多聞禪定。",
        "translation": "You should know that this person simply esteems observing precepts and being well-versed in meditation.",
        "source": "T15n0653_002:0796c10_8"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796c10_9"
    },
    {
        "source_sentence": "是人不名供養恭敬尊重於我。",
        "translation": "That person isn't called offering support, honoring, and venerating me.",
        "source": "T15n0653_002:0796c10_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0796c11_11"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796c11_12"
    },
    {
        "source_sentence": "無始世來無有眾生不得四禪，若但知得四禪謂為沙門利者，是人何名供養於我？",
        "translation": "Since beginningless time, there are no sentient beings who haven't attained the fourth dhyāna, but if someone simply knows they've attained the fourth dhyāna and calls it a benefit to ascetics, then what's the name of that person who makes offerings to me?",
        "source": "T15n0653_002:0796c12_0"
    },
    {
        "source_sentence": "是故舍利弗！",
        "translation": "Therefore, Śāriputra!",
        "source": "T15n0653_002:0796c13_1"
    },
    {
        "source_sentence": "我今明了告汝，當來世人，於我法中種種貪著、種種邪見毀壞我法。",
        "translation": "Now, I'll clearly tell you that in future generations, people will variously cling to my teaching and variously hold wrong views that disparage it.",
        "source": "T15n0653_002:0796c14_2"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0796c15_3"
    },
    {
        "source_sentence": "若人但貴持戒多聞禪定，當知是人不能淨行沙門諸法，我則不說此人名為沙門、婆羅門。",
        "translation": "If someone simply esteems observing precepts and well-versed meditation, you should know that they can't purely practice the ascetic teachings, and I won't call this person a ascetic or brāhmaṇa.",
        "source": "T15n0653_002:0796c15_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796c17_5"
    },
    {
        "source_sentence": "若人於一切法無我，如實知無我，一切法本來無所有空，能如實知無所有空，",
        "translation": "“If someone truly knows that all things lack self, they can truly know that all things lack self. If someone truly knows that all things are inherently nonexistent and void, they can truly know that all things are nonexistent and void.",
        "source": "T15n0653_002:0796c18_6"
    },
    {
        "source_sentence": "是則不以持戒為上、多聞為上、禪定為上。",
        "translation": "Then they don't regard observance of precepts as superior, extensive learning as superior, and meditation as superior.",
        "source": "T15n0653_002:0796c19_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0796c20_8"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796c21_9"
    },
    {
        "source_sentence": "諸法實相無生無起，於中無法可為上者。",
        "translation": "The true characteristics of dharmas lack arising and non-arising, and there's nothing that can be superior about them.",
        "source": "T15n0653_002:0796c21_10"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796c22_11"
    },
    {
        "source_sentence": "是諸法如實中，無持戒者、無破戒者，何況貪著而以為上？",
        "translation": "Among these things as they really are, there's no one who observes the precepts or breaks them, so why would craving and attachment be considered superior?",
        "source": "T15n0653_002:0796c22_12"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0796c23_13"
    },
    {
        "source_sentence": "是名諸佛阿耨多羅三藐三菩提，謂一切法無相自相空、無我無人。",
        "translation": "This is called the buddhas' unsurpassed, correct, and complete enlightenment, which means that all dharmas lack characteristics or self-marks, are empty of their own characteristics, and have no self or person.",
        "source": "T15n0653_002:0796c23_14"
    },
    {
        "source_sentence": "若有是忍，是名行者、是名得者。",
        "translation": "If there's such forbearance, this is called a practitioner and this is called someone who attains it.",
        "source": "T15n0653_002:0796c25_15"
    },
    {
        "source_sentence": "是人名為以信出家，應受供養清淨布薩，是人則為人中之天。",
        "translation": "That person is called someone who leaves home because of faith and should receive offerings to the pure bodhisattva, and that person is a god among humans.",
        "source": "T15n0653_002:0796c26_16"
    },
    {
        "source_sentence": "「舍利弗！",
        "translation": "“O Śāriputra!",
        "source": "T15n0653_002:0796c27_17"
    },
    {
        "source_sentence": "諸佛阿耨多羅三藐三菩提，唯是一義，所謂離也。",
        "translation": "The buddhas' unsurpassed, correct, and complete enlightenment is only one thing, which is called separation.",
        "source": "T15n0653_002:0796c27_18"
    },
    {
        "source_sentence": "何等為離？",
        "translation": "What's separation?",
        "source": "T15n0653_002:0796c28_19"
    },
    {
        "source_sentence": "離諸欲、諸見。",
        "translation": "They're free of desires and views.",
        "source": "T15n0653_002:0796c29_20"
    },
    {
        "source_sentence": "欲者即是無明，見者即是憶念。",
        "translation": "Desire is ignorance, and views are recollection.",
        "source": "T15n0653_002:0796c29_21"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0797a01_22"
    },
    {
        "source_sentence": "一切諸法憶念為本，所有念想即為是見，見即是邪。",
        "translation": "All dharmas are based on recollection, and all the thoughts and perceptions that exist are views, and views are errors.",
        "source": "T15n0653_002:0797a01_23"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0797a02_24"
    },
    {
        "source_sentence": "善法中見，我亦說之名為邪見。",
        "translation": "views in the midst of good dharmas, which I also call wrong views.",
        "source": "T15n0653_002:0797a02_25"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T15n0653_002:0797a03_26"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0797a03_27"
    },
    {
        "source_sentence": "離欲寂滅中無法無非法、無善無惡，是事皆空，遠離諸結一切憶念，是故名離。",
        "translation": "Being free of desire in the cessation of craving, there's nothing that's neither lawful nor unlawful, no good nor bad, and these things are all empty, being free of all bonds and remembering them, which is why it's called freedom.",
        "source": "T15n0653_002:0797a03_28"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T15n0653_002:0797a05_29"
    },
    {
        "source_sentence": "無上道中諸欲永息。",
        "translation": "In the unsurpassed path, all desires are permanently stopped.",
        "source": "T15n0653_002:0797a05_30"
    },
    {
        "source_sentence": "何等諸欲？",
        "translation": "What are these desires?",
        "source": "T15n0653_002:0797a06_31"
    },
    {
        "source_sentence": "謂邪不善念，若我若我所、作相事相。",
        "translation": "It's wrong and unwholesome mindfulness, whether it's self or self-possessed, made up of characteristics, things, or marks.",
        "source": "T15n0653_002:0797a06_32"
    },
    {
        "source_sentence": "是名阿耨多羅三藐三菩提中諸欲永息。」",
        "translation": "This is called the permanent cessation of desire in unsurpassed, correct, and complete enlightenment.",
        "source": "T15n0653_002:0797a07_33"
    },
    {
        "source_sentence": "◎佛藏經卷中",
        "translation": "*Buddha Store Sutra, Volume II",
        "source": "T15n0653_002:0797a08_34"
    }
]