[
    {
        "source_sentence": "大乘同性經卷上(亦名一切佛行入智毘盧遮那藏說經)周宇文氏天竺三藏闍那耶舍譯如是我聞：一時，",
        "translation": "*Mahayana sanzang jing shou (also known as all buddha-practices entering wisdom) translated by Zhou Youwei weishi zhenzhusheng jñānayaśas, thus have I heard.",
        "source": "T16n0673_001:0640c06_0"
    },
    {
        "source_sentence": "婆伽婆住在大摩羅耶精妙山頂摩訶園林華池沼邊大持呪神所居止處人不能行最得道者所居之處，",
        "translation": "Bhagavān was staying at the top of the great marvelous mountain called Mālaya, in the great mansion where the great dhāraṇī spirits lived and dwelled. People could not walk there, but those who had attained enlightenment lived there.",
        "source": "T16n0673_001:0640c09_1"
    },
    {
        "source_sentence": "共大比丘千二百五十人俱，一切皆是摩訶聲聞，所作已辦，已過一切凡夫之地，",
        "translation": "He was accompanied by one thousand two hundred and fifty bhikṣus, all of whom were great śrāvakas. Having accomplished their work, they passed beyond the sphere of all ordinary people.",
        "source": "T16n0673_001:0640c11_2"
    },
    {
        "source_sentence": "其名曰：尊者阿若憍陳如、尊者阿說示、尊者摩訶迦葉、尊者舍利弗、尊者摩訶目揵連，",
        "translation": "Their names were: Venerable Ājñātakauṇḍinya, Venerable Anuruddha, Venerable Mahākāśyapa, Venerable Śāriputra, and Venerable Mahāmaudgalyāyana.",
        "source": "T16n0673_001:0640c13_3"
    },
    {
        "source_sentence": "與如是等諸大聲聞。",
        "translation": "They're the same as these great śrāvakas.",
        "source": "T16n0673_001:0640c15_4"
    },
    {
        "source_sentence": "復有菩薩摩訶薩眾，皆大菩薩，悉得一切菩薩三昧陀羅尼行，一切已住諸菩薩地，",
        "translation": "“Furthermore, there were great enlightening beings, all great enlightening beings, who had attained the practice of concentration spells and spells for enlightening beings in all buddha-fields.",
        "source": "T16n0673_001:0640c15_5"
    },
    {
        "source_sentence": "其名曰：聖者彌勒菩薩摩訶薩、大意菩薩摩訶薩、益意菩薩摩訶薩、堅意菩薩摩訶薩、定意菩薩摩訶薩、無盡意菩薩摩訶薩、無邊意菩薩摩訶薩、海意菩薩摩訶薩、正定意菩薩摩訶薩、淨意菩薩摩訶薩、智意菩薩摩訶薩，",
        "translation": "Their names were: the holy Maitreya Bodhisattva Mahāsattva, the great intention bodhisattva Mahāsattva, the beneficial intention bodhisattva Mahāsattva, the resolute intention bodhisattva Mahāsattva, the concentration bodhisattva Mahāsattva, the inexhaustible intention bodhisattva Mahāsattva, the",
        "source": "T16n0673_001:0640c17_6"
    },
    {
        "source_sentence": "如是等一切各各佛剎已得受記，為阿耨多羅三藐三菩提轉法輪故。",
        "translation": "Each of these buddha-bodhisattvas has already received their predictions, because they turn the Dharma wheel for the sake of unsurpassed, correct, and complete enlightenment.",
        "source": "T16n0673_001:0640c22_7"
    },
    {
        "source_sentence": "復有最上最勝天、龍、夜叉、揵闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽，",
        "translation": "Again, there were the highest and most excellent gods, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas.",
        "source": "T16n0673_001:0640c24_8"
    },
    {
        "source_sentence": "并持呪神及非人等，種種形容、天冠衣服，執持器杖并諸幢蓋，及諸鬼神、仙人眾等，",
        "translation": "They also carried incantations, spells, non-human spirits, various adornments, celestial garlands, and robes, carrying vessels, canopies, banners, canopies, ghosts, spirits, sages, and other beings.",
        "source": "T16n0673_001:0640c25_9"
    },
    {
        "source_sentence": "皆來集坐為欲聽法。",
        "translation": "They all came and sat in order to listen to the teaching.",
        "source": "T16n0673_001:0640c27_10"
    },
    {
        "source_sentence": "爾時世尊，眾如大海前後圍繞，有所說法初中後善，其義深遠其語巧妙，",
        "translation": "At that time, the World-honored One was surrounded by an assembly of disciples like the great ocean. He taught some doctrine, good in the beginning and good in the end, his meaning being profound and far-reaching; his words were skillful and subtle.",
        "source": "T16n0673_001:0640c29_0"
    },
    {
        "source_sentence": "具足廣說清淨梵行。",
        "translation": "It's fully explained in detail about the pure religious practice.",
        "source": "T16n0673_001:0641a01_1"
    },
    {
        "source_sentence": "爾時楞伽大城之中，有羅剎王名毘毘沙那，治化於彼。",
        "translation": "At the time, there was a Rāṣṭrapāla king named Vaiśravaṇa in the great city of Laṅkâvatāra who governed and transformed it.",
        "source": "T16n0673_001:0641a02_2"
    },
    {
        "source_sentence": "時毘毘沙那楞伽王，聞佛今住大摩羅耶精妙山頂摩訶園林華池沼邊大持呪神所居之處人不能行最得道處，",
        "translation": "The king of Vaiśravaṇa then heard that the Buddha was now staying at the great marvelous mountain peak of Māra-jīvaka, where the great dhāraṇī spirit could not walk in the parks, forests, flowers, ponds, lakes, and swamps.",
        "source": "T16n0673_001:0641a03_3"
    },
    {
        "source_sentence": "與千二百五十比丘現說梵行。",
        "translation": "He and one thousand two hundred and fifty monks are now teaching the religious practice.",
        "source": "T16n0673_001:0641a05_4"
    },
    {
        "source_sentence": "時毘毘沙那楞伽王，即生念言：「如來名字世間希有，如優曇華於無數時乃一得聞，",
        "translation": "Vaiśravaṇa then thought to himself, “The Tathāgata’s name is rare in the world.",
        "source": "T16n0673_001:0641a06_5"
    },
    {
        "source_sentence": "何況值佛。",
        "translation": "How could it be when he meets a Buddha?",
        "source": "T16n0673_001:0641a08_6"
    },
    {
        "source_sentence": "我於是中無量無數時不得聞法，猶如盲龜遇浮木孔，是中諸佛及以佛法、入佛境界證佛道者，",
        "translation": "I could not hear the Dharma for countless, immeasurable, incalculably long periods of time. It was as if a blind tortoise encountered a hole in a floating piece of wood. These buddhas and those who realized the path of enlightenment by means of the Buddha-dharma and entered into the realm of buddhahood were like this.",
        "source": "T16n0673_001:0641a08_7"
    },
    {
        "source_sentence": "如是之事倍復最難。",
        "translation": "Such things are doubly more difficult.",
        "source": "T16n0673_001:0641a10_8"
    },
    {
        "source_sentence": "我若齎持多諸珍寶，及真珠貫、無量香華、末香塗香、華冠衣服、寶幢幡蓋，",
        "translation": "Suppose I were to carry a great deal of rare treasures and genuine pearls, jewelry, unlimited fragrant flowers, powdered ointments, flower garlands, robes, precious banners, pennants, and canopies.",
        "source": "T16n0673_001:0641a11_9"
    },
    {
        "source_sentence": "并及繒束、音樂歌讚，與我眷屬往詣佛所，到佛所已以此種種供養之具供養如來，",
        "translation": "Having arrived at the Buddha’s place, they offered various kinds of offerings to him.",
        "source": "T16n0673_001:0641a13_0"
    },
    {
        "source_sentence": "欲問正法，報我一生。」",
        "translation": "If you want to ask about the right teaching, reward me for one lifetime.",
        "source": "T16n0673_001:0641a14_1"
    },
    {
        "source_sentence": "時毘毘沙那楞伽王，普皆宣告諸羅剎眾：「汝等可共同心和合，捉持豐足勝妙金銀摩尼寶珠、珂玉琉璃珊瑚馬瑙真珠瓔珞并赤真珠，",
        "translation": "Vaiśravaṇa then said to the rākṣatriyas, “May your minds be harmonious.",
        "source": "T16n0673_001:0641a16_0"
    },
    {
        "source_sentence": "種種精妙無量香華，作諸音樂及以歌讚，須向佛所，如來法王三界最勝，",
        "translation": "Various kinds of exquisite, immeasurable fragrant flowers made music and songs to sing in praise. They should go to the Buddha, who is the king of the Dharma of the enlightened, the best of all beings in the three worlds.",
        "source": "T16n0673_001:0641a19_0"
    },
    {
        "source_sentence": "無上福聚具足眾相，一切智見無上福田，我等向彼持此供具以用供養。",
        "translation": "The unsurpassed stock of merit is fully endowed with all characteristics, the supreme field of blessings seen by omniscience, and we'll offer these offerings to them as an offering.",
        "source": "T16n0673_001:0641a20_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T16n0673_001:0641a22_2"
    },
    {
        "source_sentence": "於無數時，值佛出世得見佛難、離八難難、聞三寶難。」",
        "translation": "At countless times, he meets a Buddha who appears in the world and attains the difficulty of seeing the Buddha, parts with the difficulty of the eight difficulties, and hears the difficulty of the Three Treasures.",
        "source": "T16n0673_001:0641a22_3"
    },
    {
        "source_sentence": "「無量無數時，　　佛乃現世間，",
        "translation": "“Innumerable, immeasurable, incalculable moments ago The Buddha appeared in the world:",
        "source": "T16n0673_001:0641a23_4"
    },
    {
        "source_sentence": "　欲離於八難，　　復經無量世，",
        "translation": "Wishing to be free of the eight difficulties, they'll go on for an immeasurable number of years.",
        "source": "T16n0673_001:0641a23_4"
    },
    {
        "source_sentence": "　百千億劫中，　　希逢於世尊，",
        "translation": "For hundreds of thousands of myriads of koṭis of kalpas I wish to meet the Bhagavat.",
        "source": "T16n0673_001:0641a23_4"
    },
    {
        "source_sentence": "　譬如優曇華，　　無數時乃出。",
        "translation": "It's like the udumbara flower, which emerges at an incalculably long time.",
        "source": "T16n0673_001:0641a23_4"
    },
    {
        "source_sentence": "　地獄與畜生，　　最苦餓鬼道，",
        "translation": "Sentient beings in hell and the realms of animals suffer the most painful tortures, like hungry ghosts.",
        "source": "T16n0673_001:0641a23_4"
    },
    {
        "source_sentence": "　往來於六趣，　　展轉如車輪。",
        "translation": "Coming and going in the six destinies, they rise and turn like a chariot wheel.",
        "source": "T16n0673_001:0641a23_4"
    },
    {
        "source_sentence": "　令此眾生類，　　離諸八難厄，",
        "translation": "Enable these sentient beings to be freed from the eight difficulties and troubles.",
        "source": "T16n0673_001:0641a23_4"
    },
    {
        "source_sentence": "　利益眾生故，　　故出世間燈，",
        "translation": "For the sake of benefiting sentient beings, he therefore produces a transmundane lamp.",
        "source": "T16n0673_001:0641a23_4"
    },
    {
        "source_sentence": "　智日光所照，　　能破無明盲。",
        "translation": "Illuminated by the light of the sun of knowledge, They can destroy the blindness of ignorance.",
        "source": "T16n0673_001:0641a23_4"
    },
    {
        "source_sentence": "　相隨至彼處，　　供養無上尊，",
        "translation": "They all went there together to make offerings to the supreme honored one.",
        "source": "T16n0673_001:0641a23_4"
    },
    {
        "source_sentence": "　教天人世中，　　供養獲大果。」",
        "translation": "He teaches gods and humans in the world to make offerings to obtain great rewards.",
        "source": "T16n0673_001:0641a23_4"
    },
    {
        "source_sentence": "作此念已，爾時毘毘沙那楞伽王，於其眾中說偈告言：爾時毘毘沙那楞伽王說此偈已，",
        "translation": "Having thought thus, the king Vaiśravaṇa spoke these verses to the assembly: At that moment, having uttered these verses, the king Vaiśravaṇa said in verse:",
        "source": "T16n0673_001:0641a23_4"
    },
    {
        "source_sentence": "佛神力故，於虛空中放百千億那由他大光明網，遍照楞伽大城。",
        "translation": "Because of the Buddha's miraculous power, a hundred thousand billion nayutas of great webs of light were emanated from the sky that shone throughout the great city of Laṅkâvatāra.",
        "source": "T16n0673_001:0641b07_5"
    },
    {
        "source_sentence": "照已，毘毘沙那及一切羅剎眾，皆悉踊躍。",
        "translation": "After he had illuminated it, Vaiśravaṇa and all the rākṣatriyas all jumped for joy.",
        "source": "T16n0673_001:0641b09_6"
    },
    {
        "source_sentence": "「諸法本寂空無我，　　眾生初中後叵得，",
        "translation": "All things are inherently void, empty, and selfless; Sentient beings can’t attain them, beginning or end.",
        "source": "T16n0673_001:0641b10_7"
    },
    {
        "source_sentence": "　譬如虛幻夢泡焰，　　霧電水沫旋火輪。",
        "translation": "It's like a false illusion, a dream bubble and flame, fog, lightning, water, and foam circling the fire wheel.",
        "source": "T16n0673_001:0641b10_7"
    },
    {
        "source_sentence": "　世諦緣法悉非真，　　無明愛根世間現，",
        "translation": "Conditioned dharmas of the conventional truth are all not true; The faculty ignorance and thirst appear in the world.",
        "source": "T16n0673_001:0641b10_7"
    },
    {
        "source_sentence": "　真觀無愛及無明，　　諸法如空淨叵說。」",
        "translation": "True contemplation of craving and ignorance, the dharmas are like emptiness and purity that can't be explained.",
        "source": "T16n0673_001:0641b10_7"
    },
    {
        "source_sentence": "爾時彼大光明焰中，演出甚深法相之偈：爾時毘毘沙那楞伽王，聞彼光明網中演出如是法相偈已，",
        "translation": "It was then that a verse proclaiming the profound characteristics of the teaching was uttered in the great blazing flame of light: At that time King Vaiśravaṇa, having heard such a verse of the characteristics of the teaching being uttered in the network of rays of light,",
        "source": "T16n0673_001:0641b10_7"
    },
    {
        "source_sentence": "即得甚深無我法忍；",
        "translation": "That is, they attain profound tolerance of the principle of selflessness.",
        "source": "T16n0673_001:0641b17_8"
    },
    {
        "source_sentence": "彼羅剎眾中或得忍者，或有發於菩提心者，或有發順忍者，有實見者。",
        "translation": "Among those rāṣas, some attain nirvāṇa, some give rise to the mind of enlightenment, some give rise to compliant nirvāṇa, and some have real views.",
        "source": "T16n0673_001:0641b17_9"
    },
    {
        "source_sentence": "「天人及與阿修羅，　　一切梵王上天眾，",
        "translation": "“Devas, humans, as well as the asura demons and all the other gods of the Brahma heavenly realm.",
        "source": "T16n0673_001:0641b19_10"
    },
    {
        "source_sentence": "　如此無上最妙法，　　彼等未曾得覺見。",
        "translation": "Such is the supreme and most sublime teaching, which they have never perceived or seen before.",
        "source": "T16n0673_001:0641b19_10"
    },
    {
        "source_sentence": "　我應未來得斯法，　　具足一切無礙智，",
        "translation": "I should attain this teaching in the future, Replete with all unhindered knowledge.",
        "source": "T16n0673_001:0641b19_10"
    },
    {
        "source_sentence": "　此世界中成佛道，　　度脫無量億眾生。",
        "translation": "In this world they attain the path of buddhahood, Liberating countless millions of sentient beings.",
        "source": "T16n0673_001:0641b19_10"
    },
    {
        "source_sentence": "　演說諸佛微妙法，　　最勝無漏八聖道，",
        "translation": "They expound the subtle teachings of buddhas, The supreme untainted eightfold holy path.",
        "source": "T16n0673_001:0641b19_10"
    },
    {
        "source_sentence": "　令我所作無邊智，　　三十二相莊嚴身。",
        "translation": "Causing self-manifesting boundless knowledge, I adorned my body with the thirty-two marks.",
        "source": "T16n0673_001:0641b19_10"
    },
    {
        "source_sentence": "　若有精勤行善行，　　及佛功德行滿足，",
        "translation": "If there are those who diligently practice good deeds And fulfill the virtuous deeds of buddhas,",
        "source": "T16n0673_001:0641b19_10"
    },
    {
        "source_sentence": "　利益眾生脫怖畏，　　持諸功德滅有塵，",
        "translation": "Benefiting sentient beings and liberating them from fear, They preserve their virtues to extinguish the dust of existence.",
        "source": "T16n0673_001:0641b19_10"
    },
    {
        "source_sentence": "　面如日月淨光明，　　於三界中得作佛。」",
        "translation": "His face is like the pure light of the sun and moon, and he becomes a buddha in the three realms.",
        "source": "T16n0673_001:0641b19_10"
    },
    {
        "source_sentence": "時毘毘沙那楞伽王，於佛法中明了無疑，既著菩提堅鉀鎧已，復發此願而說偈言：爾時毘毘沙那楞伽王，",
        "translation": "At that time King Vaiśravaṇa had no doubts about the Buddha’s teaching. Having worn the armor of enlightenment, he made another vow and spoke these verses:",
        "source": "T16n0673_001:0641b19_10"
    },
    {
        "source_sentence": "於阿耨多羅三藐三菩提得不退轉，即隨其意，應念出生種種精妙華香、塗香末香、華冠衣服、寶幢幡蓋、摩尼繒束、真珠瓔珞，",
        "translation": "To attain anuttarii samyaksarrzbodhi and not regress from it, they should give rise to various kinds of exquisite flowers and fragrances, ointments and powders, flower garlands and clothing, jeweled banners and canopies, crystal bundles, pearl necklaces, and jewelry according to wishes.",
        "source": "T16n0673_001:0641c02_11"
    },
    {
        "source_sentence": "作諸伎樂擊掌歌讚妙聲遍滿，讚歎如來功德相好。",
        "translation": "They performed tricks, music, clapped their palms, sang praises, and praised the marvelous sound pervading them, praising the Tathāgata's virtues and characteristics.",
        "source": "T16n0673_001:0641c05_12"
    },
    {
        "source_sentence": "持如是等諸供養具，與其眷屬於虛空中，如鵝王行來向佛所，至佛所已從空而下。",
        "translation": "Holding these kinds of offerings, he and his retinue fell into the sky like a goose king who came to the Buddha's place and descended from the sky after reaching him.",
        "source": "T16n0673_001:0641c06_13"
    },
    {
        "source_sentence": "時毘毘沙那楞伽王，與眷屬俱向佛合掌，接世尊足頂禮百遍，禮拜訖已遶佛三匝乃至千匝。",
        "translation": "At the time, King Vaiśravaṇa and his retinues joined their palms toward the Buddha, touched his feet, bowed their heads a hundred times, circled him three times or a thousand times after venerating him.",
        "source": "T16n0673_001:0641c08_14"
    },
    {
        "source_sentence": "時毘毘沙那楞伽王，即於佛所五體投地如斫樹倒，復說此言：「南無無量功德莊嚴最上法身師子丈夫三界最勝世尊釋迦牟尼至真等正覺。」",
        "translation": "Vaiśravaṇa King Vaiśravaṇa then threw his five bodies to the ground at the Buddha's place like a rose-apple tree and said, Namo, the supreme Dharma body of the lion who is the best among men in the three realms, the Bhagavān, Śākyamuni, the supremely true and perfectly enlightened one, adorned with measureless",
        "source": "T16n0673_001:0641c10_15"
    },
    {
        "source_sentence": "「昔世億生轉精事，　　難行苦行求菩提，",
        "translation": "In the past billions of sentient beings in the world committed various deeds, hardly practicing austerities to seek enlightenment.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　布施飲食及衣乘，　　億數七珍與乞者，",
        "translation": "He gave food, drink, clothing, and vehicles to beggars with hundreds of millions of rare treasures.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　不思議劫無悔悋，　　捨國聚落及臣民，",
        "translation": "For an inconceivable eon without regret, They abandoned their countries, villages, and subjects.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　王宮莊嚴寶豐滿，　　億劫難捨皆能捨。",
        "translation": "The king's palace is adorned with abundant treasures, and it's difficult to abandon them for billions of eons.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　昔名王子須大拏，　　於山林中施妻子，",
        "translation": "Formerly the prince renowned in olden times needed a large carriage And offered his wife and children to him In the mountain forests.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　前捨自身救產虎，　　割其身肉濟窮鴿，",
        "translation": "He had previously abandoned himself to rescue a bearded tiger, Cutting off its flesh to save the poor and helpless pigeons.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　挑眼施盲婆羅門，　　於彼生中無怨恨，",
        "translation": "They pick out their eyes and give them to blind brahmans, Who have no enemies in their birth.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　施頭為求菩提因，　　心於索者常歡喜。",
        "translation": "Giving a head is the cause for seeking enlightenment, and his mind always rejoices when he asks for it.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　為護戒品長清淨，　　不犯聖行順無為，",
        "translation": "In order to keep the precepts pure, they don’t violate holy practices and follow the unconditioned.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　不斷生命盜他物，　　常順梵行世無妬，",
        "translation": "They don’t cut off life or steal others’ property; Always following the religious practice, they have no jealousy in the world.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　離於飲酒不妄語，　　護諸眾生如己身，",
        "translation": "Being free of drinking alcohol and not lying, they protect sentient beings like themselves.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　昔不兩舌諸惡言，　　亦無瞋恚說綺語。",
        "translation": "In the past, they didn't speak duplicitous bad words, and they didn't angrily say fancy things.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　世尊離邪常調順，　　於前眾生無惱觸，",
        "translation": "The World-honored One is free of error and always tempered, Not disturbing or touching those who have been before him.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　功德如意離邪見，　　供養三寶無壞心。",
        "translation": "Their virtues are supernormal, free of mistaken views, and they make offerings to the Three Treasures without a broken heart.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　出家無垢除五欲，　　依順佛戒解脫行，",
        "translation": "Having renounced the householder’s life, they are without defilement, getting rid of the five desires. They follow the Buddha’s precepts and practice of liberation.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　前行忍辱受諸苦，　　誹謗毀訾及困責。",
        "translation": "In the past, they practiced forbearance and suffered suffering, denigrating, disparaging, and tormenting.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　往昔所受諸苦痛，　　為眾生故無恨心，",
        "translation": "Because of the pain and suffering they suffered in the past, They have no thoughts of hatred for sentient beings.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　若在佛邊起殺惱，　　於彼慈心視如子。",
        "translation": "If someone gives rise to killing at the Buddha's side, they look on them with kindness like a child.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　佛生於世常修忍，　　解脫億數苦眾生，",
        "translation": "Buddha, born in the world, always cultivates forbearance; He liberates countless suffering beings.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　如來往昔求道時，　　作大仙人名曰忍，",
        "translation": "In the past, when the Buddha sought enlightenment, He was a great sage called Patience.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　彼所生中被割截，　　忍痛於王無害心，",
        "translation": "In the midst of his birth, he was cut off, enduring pain and no harm from the king.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　為彼國王及夫人，　　演說白法令歡喜。",
        "translation": "For the sake of those kings and their wives, he explains the teaching and decrees to rejoice.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　不思億劫常精進，　　懈怠邪意狹劣除，",
        "translation": "Not thinking for billions of eons, they always exert effort; Their indolence and wickedness are eliminated by narrow-mindedness.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　昔諸苦行皆能忍，　　廣大精進覺菩提，",
        "translation": "All the ascetic practices of the past can be tolerated; With great zeal they awaken to enlightenment.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　經行不睡亦無乏，　　尊重供養無量佛，",
        "translation": "He walks without sleep or hunger, honoring and serving infinite buddhas.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　眾生所須常隨順，　　熏修成佛無上法。",
        "translation": "What sentient beings need, they always follow, Perfuming and cultivating the unsurpassed Dharma of becoming buddhas.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　昔行禪定為伏心，　　已善四禪無色定，",
        "translation": "In the past I practiced meditation in order to subdue my mind, Having mastered the fourth and formless concentrations.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　三昧念五神通力，　　往昔行滿無漏禪。",
        "translation": "Mindful of the five supernormal powers of samādhi, he practiced uncontaminated meditation in the past.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　如來智慧滿無漏，　　知法如幻悉虛假，",
        "translation": "The Buddha’s knowledge and wisdom are pure, Knowing things are like illusions, all illusory.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　無我眾生命及人，　　煩惱網纏因業轉。",
        "translation": "The selfless sentient beings and humans are tethered by the web of afflictions as a result of actions.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　欲界不淨四種惑，　　眾生煩惱界本淨，",
        "translation": "The realm of sexual passion is with four forms of defilement. Sentient beings are originally pure in the realm of defilement.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　既知實淨眾生本，　　得具六種波羅蜜。",
        "translation": "Knowing the true and pure origin of sentient beings, they'll attain the six kinds of perfections.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　誰能說此智方便，　　勤求無盡佛福聚，",
        "translation": "Who can explain this knowledge and skillful means To diligently seek the inexhaustible store of virtue of buddhahood?",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "　發勝三業向如來，　　來世得佛我頂禮。」",
        "translation": "He gives rise to the superiority of the three karmic activities that are directed toward the Tathāgata, and in a future life he'll attain Buddhahood.",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "出此語已即起合掌，於世尊前說偈讚歎：爾時毘毘沙那楞伽王說此偈已，",
        "translation": "Having uttered these words, he raised his joined palms and praised the World-honored One in verse before him: At that moment, having uttered these verses, King Vaiśravaṇa spoke these verses:",
        "source": "T16n0673_001:0641c13_16"
    },
    {
        "source_sentence": "復以無量種種最妙及以香華末香塗香、華冠衣服寶幢幡蓋，音樂歌詠讚歎如來，",
        "translation": "They also offered innumerable kinds of exquisite things, such as fragrant flowers, powdered perfumes, ointments, flower garlands, clothing, jeweled banners, pennants, and canopies, music, songs, and hymns of praise to the Buddha.",
        "source": "T16n0673_001:0642a20_17"
    },
    {
        "source_sentence": "尊重恭敬具足承事，供養於佛并諸聲聞大菩薩眾；",
        "translation": "They honored, respected, and served the Buddha as their offerings to all the buddhas and great enlightening beings.",
        "source": "T16n0673_001:0642a22_18"
    },
    {
        "source_sentence": "彼羅剎眾亦復如是，如法發起供養如來稱可佛意。",
        "translation": "The rāṣas are likewise, and they make offerings to the Tathāgata in accordance with the teaching that he praises his intentions.",
        "source": "T16n0673_001:0642a23_19"
    },
    {
        "source_sentence": "爾時毘毘沙那楞伽王，供養訖已白佛言：「世尊！",
        "translation": "It was then that the king of Vaiśravaṇa and Laṅkâvatāra made his offerings and said to the Buddha, Bhagavān!",
        "source": "T16n0673_001:0642a24_20"
    },
    {
        "source_sentence": "我今有疑，欲問如來、至真、等正覺，唯願世尊，為我開解。」",
        "translation": "Now that I have doubts, I want to ask the Tathāgata, the supreme truth, and the perfectly enlightened one questions, so please, Bhagavān, open them up for me.",
        "source": "T16n0673_001:0642a26_0"
    },
    {
        "source_sentence": "說此語已。",
        "translation": "After speaking these words, he said.",
        "source": "T16n0673_001:0642a27_1"
    },
    {
        "source_sentence": "佛告楞伽王言：「楞伽王！",
        "translation": "The Buddha told King Laṅkāputra, King Laṅkāputra!",
        "source": "T16n0673_001:0642a27_2"
    },
    {
        "source_sentence": "吾常開汝問佛所疑，隨汝意樂，當為解說令心歡喜。」",
        "translation": "I'll always open your mind to the doubts you ask the Buddha, and according to your wishes, I'll explain them for you so that you'll rejoice.",
        "source": "T16n0673_001:0642a28_0"
    },
    {
        "source_sentence": "時楞伽王得開許已，白佛言：「世尊！",
        "translation": "After the king of Laṅkâvatāra had given his permission, he said to the Buddha, Bhagavān!",
        "source": "T16n0673_001:0642a29_1"
    },
    {
        "source_sentence": "眾生眾生者，世尊！",
        "translation": "Sentient beings and sentient beings, Bhagavān!",
        "source": "T16n0673_001:0642a29_2"
    },
    {
        "source_sentence": "以何義故名為眾生？」",
        "translation": "What is the reason they're called sentient beings?",
        "source": "T16n0673_001:0642b01_3"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0642b01_4"
    },
    {
        "source_sentence": "眾生眾生者，眾緣和合名曰眾生，所謂地水火風空識名色六入因緣生。",
        "translation": "Sentient beings and sentient beings are called sentient beings when the conditions are combined, which are called sentient beings because of the causes and conditions that give rise to the six sense-fields of earth, water, fire, wind, air, space, name, form, and name.",
        "source": "T16n0673_001:0642b02_5"
    },
    {
        "source_sentence": "又眾生者，猶如束竹，緣業故報、緣業得果，我、人、眾生、壽命、畜養、眾數、知者、見者、作者、觸者、受者，",
        "translation": "“Furthermore, sentient beings are like bundles of bamboo. Depending on karma, there is retribution and depending on karma there is attainment of fruit. Self, person, sentient beings, life span, livelihood, animal husbandry, numbers, knower, viewer, maker, toucher, and experiencer.",
        "source": "T16n0673_001:0642b03_6"
    },
    {
        "source_sentence": "是名眾生。」",
        "translation": "This is called sentient beings.",
        "source": "T16n0673_001:0642b06_7"
    },
    {
        "source_sentence": "毘毘沙那楞伽王言：「世尊！",
        "translation": "Vaiśravaṇa said, Bhagavān!",
        "source": "T16n0673_001:0642b06_8"
    },
    {
        "source_sentence": "彼眾生者，以何為本？",
        "translation": "What's the root of those sentient beings?",
        "source": "T16n0673_001:0642b06_9"
    },
    {
        "source_sentence": "依何而住？",
        "translation": "Based on what and where do they abide?",
        "source": "T16n0673_001:0642b07_10"
    },
    {
        "source_sentence": "以何為因？」",
        "translation": "What is the cause?",
        "source": "T16n0673_001:0642b07_11"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0642b07_12"
    },
    {
        "source_sentence": "此眾生者，無明為本，依愛而住，以業為因。」",
        "translation": "These sentient beings have ignorance as their root and abide based on craving, which is the cause of actions.",
        "source": "T16n0673_001:0642b08_13"
    },
    {
        "source_sentence": "毘毘沙那楞伽王言：「世尊！",
        "translation": "Vaiśravaṇa said, Bhagavān!",
        "source": "T16n0673_001:0642b09_14"
    },
    {
        "source_sentence": "業有幾種？」",
        "translation": "How many kinds of karma are there?",
        "source": "T16n0673_001:0642b09_15"
    },
    {
        "source_sentence": "佛言：「業有三種。",
        "translation": "The Buddha said, There are three kinds of karma.",
        "source": "T16n0673_001:0642b09_16"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T16n0673_001:0642b10_17"
    },
    {
        "source_sentence": "身、口、意業，復有三相，淨、不淨、非淨非不淨。」",
        "translation": "Bodily, verbal, and mental actions also have three characteristics that are pure, impure, and neither pure nor impure.",
        "source": "T16n0673_001:0642b10_18"
    },
    {
        "source_sentence": "時毘毘沙那楞伽王復白佛言：「世尊！",
        "translation": "Vaiśravaṇa then again said to the Buddha, Bhagavān!",
        "source": "T16n0673_001:0642b11_19"
    },
    {
        "source_sentence": "云何眾生捨此壽命受彼壽命，捨此故身受彼新身？」",
        "translation": "How do sentient beings abandon this life to receive that life and abandon this old body to receive the new body?",
        "source": "T16n0673_001:0642b12_20"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0642b13_21"
    },
    {
        "source_sentence": "眾生捨此身已，業風力吹移識將去，自所造業而受其果，若善及不善、非善非不善，",
        "translation": "When sentient beings abandon their bodies, the wind of karma blows and displaces consciousness. The karma created by themselves brings forth its fruit:",
        "source": "T16n0673_001:0642b13_22"
    },
    {
        "source_sentence": "眾生如此造業行者，即於彼處而受新身，或受卵生、或受濕生、或受胎生、或受化生，",
        "translation": "Sentient beings are thus engaged in the act of creating karma, that is to say, they experience a new body at that place. Some are born from an egg, some are born from moisture, some are born from a womb, and some are born through apparitional transformation.",
        "source": "T16n0673_001:0642b15_23"
    },
    {
        "source_sentence": "皆是一切業風所造，而業亦不自知所造，各自受報。",
        "translation": "They are all created by the wind of all karma, yet karma doesn't know that it's created for itself, and each receives its own reward.",
        "source": "T16n0673_001:0642b17_24"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0642b18_25"
    },
    {
        "source_sentence": "眾生如是，捨此身命受彼新身。」",
        "translation": "So it is with sentient beings who abandon this body and live to receive the new body.",
        "source": "T16n0673_001:0642b19_0"
    },
    {
        "source_sentence": "楞伽王言：「世尊！",
        "translation": "King Laṅkâvatāra said, Bhagavān!",
        "source": "T16n0673_001:0642b19_1"
    },
    {
        "source_sentence": "眾生捨此身命未受彼身，於其中間識停何處？」",
        "translation": "When sentient beings abandon this body and life but haven't yet received another body, where will the consciousness stop in between?",
        "source": "T16n0673_001:0642b20_2"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0642b21_3"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T16n0673_001:0642b21_4"
    },
    {
        "source_sentence": "田中種子至生牙時，為當子先滅已然後牙生？",
        "translation": "When the seeds in the field reach the point where the tooth comes into being, will the tooth first cease and then come into being?",
        "source": "T16n0673_001:0642b21_5"
    },
    {
        "source_sentence": "為當其牙先生然後子滅？",
        "translation": "Why is it that you, Mr. Teeth, will then cease?",
        "source": "T16n0673_001:0642b22_6"
    },
    {
        "source_sentence": "為當唯子滅時其牙即生？」",
        "translation": "Why will his teeth arise when the only thing he has is extinguished?",
        "source": "T16n0673_001:0642b23_7"
    },
    {
        "source_sentence": "毘毘沙那王言：「不也。",
        "translation": "King Vaiśravaṇa said, No.",
        "source": "T16n0673_001:0642b23_8"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T16n0673_001:0642b24_9"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0642b24_10"
    },
    {
        "source_sentence": "是義云何？」",
        "translation": "What does this mean?",
        "source": "T16n0673_001:0642b24_11"
    },
    {
        "source_sentence": "楞伽王言：「世尊！",
        "translation": "King Laṅkâvatāra said, Bhagavān!",
        "source": "T16n0673_001:0642b25_12"
    },
    {
        "source_sentence": "其子若滅其牙即生，非先子滅然後牙生，非先生牙然後子滅。」",
        "translation": "If that child dies, his tooth will arise; it's not the case that the prior child dies and then the tooth will arise, or that you die before the child dies.",
        "source": "T16n0673_001:0642b25_13"
    },
    {
        "source_sentence": "佛言：「如是。",
        "translation": "The Buddha said, So it is.",
        "source": "T16n0673_001:0642b26_14"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0642b27_15"
    },
    {
        "source_sentence": "非識先滅後識方生。",
        "translation": "It's not that consciousness first ceases and then consciousness arises.",
        "source": "T16n0673_001:0642b27_16"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0642b27_17"
    },
    {
        "source_sentence": "亦非先生前識後識方滅。",
        "translation": "Nor is it the case that it's only when you cease consciousness before and consciousness after consciousness.",
        "source": "T16n0673_001:0642b27_18"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0642b28_19"
    },
    {
        "source_sentence": "唯後識滅前識即生。",
        "translation": "Only the latter consciousness ceases, and the former consciousness arises.",
        "source": "T16n0673_001:0642b28_20"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0642b29_21"
    },
    {
        "source_sentence": "如步屈蟲，先安頭足次後足隨，其形屈伸間無斷絕。",
        "translation": "It's like a crooked bug that first places its head and feet, then follows it with its hind legs, whose form bends and stretches without interruption.",
        "source": "T16n0673_001:0642b29_22"
    },
    {
        "source_sentence": "如是如是，楞伽王！",
        "translation": "So it is, so it is, King Laṅkâvatāra!",
        "source": "T16n0673_001:0642c01_23"
    },
    {
        "source_sentence": "此之神識，見前有中生處了已，識即令移託就於彼，間無斷絕。」",
        "translation": "After this mental consciousness sees the place of birth in the prior existence and understands it, the consciousness then causes it to be displaced into that place without interruption.",
        "source": "T16n0673_001:0642c02_24"
    },
    {
        "source_sentence": "毘毘沙那楞伽王言：「世尊！",
        "translation": "Vaiśravaṇa said, Bhagavān!",
        "source": "T16n0673_001:0642c03_25"
    },
    {
        "source_sentence": "若如是者，無中陰耶？」",
        "translation": "If it's like this, isn't there an intermediate aggregate?",
        "source": "T16n0673_001:0642c04_26"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0642c04_27"
    },
    {
        "source_sentence": "一種眾生卵生是也，捨此身已入於卵中，而是神識業風所捉，停住卵中昏鈍不覺，",
        "translation": "One kind of sentient being is born from eggs. Having abandoned this body and entered the eggs, they are caught by the wind of karmic activity of supernormal consciousness and remain in the eggs, dull and unconscious.",
        "source": "T16n0673_001:0642c04_28"
    },
    {
        "source_sentence": "及至覆成識方覺了，當知彼卵已為熟也。",
        "translation": "It should be known that the eggs have matured.",
        "source": "T16n0673_001:0642c06_29"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0673_001:0642c07_30"
    },
    {
        "source_sentence": "卵生眾生法如是故。",
        "translation": "It's because the dharmas of sentient beings born from eggs are like this.",
        "source": "T16n0673_001:0642c07_31"
    },
    {
        "source_sentence": "未成熟時不覺不了。",
        "translation": "When they're not ripe, they don't perceive and don't understand.",
        "source": "T16n0673_001:0642c08_32"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T16n0673_001:0642c08_33"
    },
    {
        "source_sentence": "為業力故。",
        "translation": "It's because of the power of karma.",
        "source": "T16n0673_001:0642c09_0"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0642c09_1"
    },
    {
        "source_sentence": "復有眾生福力純厚，得於轉輪王家作子，而彼在胎不為胎污，亦不與胎不淨共住亦不污染。",
        "translation": "Again, there are sentient beings whose merit and power are pure and abundant who become children in the wheel-turning king's family but aren't stained by the womb while they're in the womb, don't live together with the womb that's impure, and don't pollute it.",
        "source": "T16n0673_001:0642c09_2"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0642c11_3"
    },
    {
        "source_sentence": "其轉輪王所生子者多受化生，設受胎者，初入胎中結子已成，及生出後破膜出身。",
        "translation": "The offspring produced by the cakravartin are mostly subject to apparitional births. If they were to be born in a womb, the first moment of entering into it would have already formed the bond and the second moment of coming out would have broken the membranes [of the womb] after having arisen.",
        "source": "T16n0673_001:0642c11_4"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0642c13_5"
    },
    {
        "source_sentence": "是因緣故說有中陰。」",
        "translation": "It's because of these causes and conditions that it's said to have intermediate existence.",
        "source": "T16n0673_001:0642c13_6"
    },
    {
        "source_sentence": "時毘毘沙那楞伽王言：「世尊！",
        "translation": "Vaiśravaṇa then said, Bhagavān!",
        "source": "T16n0673_001:0642c14_7"
    },
    {
        "source_sentence": "眾生神識為當幾大？",
        "translation": "How large is the supernormal consciousness of sentient beings?",
        "source": "T16n0673_001:0642c14_8"
    },
    {
        "source_sentence": "為作何色？」",
        "translation": "What color is it made for?",
        "source": "T16n0673_001:0642c15_9"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0642c15_10"
    },
    {
        "source_sentence": "眾生神識無邊大，無色無相、不可見，無礙無形無定處、不可說。」",
        "translation": "The consciousnesses of sentient beings are boundless, formless, signless, and invisible, unobstructed, formless, without a fixed place, and inexpressible.",
        "source": "T16n0673_001:0642c15_11"
    },
    {
        "source_sentence": "毘毘沙那言：「世尊！",
        "translation": "Vaiśravaṇa said, Bhagavān!",
        "source": "T16n0673_001:0642c17_12"
    },
    {
        "source_sentence": "識相如此無有邊大，無色無相不可見，無礙無形無定處不可說者，豈非斷絕？」",
        "translation": "Isn't it true that the characteristics of consciousness are so limitless and great, formless and without marks that can't be seen, unobstructed, formless, and indeterminate places that can't be explained?",
        "source": "T16n0673_001:0642c17_13"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0642c19_14"
    },
    {
        "source_sentence": "吾今問汝，隨汝意答，當為汝說。",
        "translation": "I will now question you, and answer as you wish. I will explain it for you.",
        "source": "T16n0673_001:0642c19_15"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0642c20_16"
    },
    {
        "source_sentence": "譬如大王在宮殿中或高樓上，婇女圍遶安樂坐時，著種種衣及諸瓔珞。",
        "translation": "It's like when the great king is in a palace or on a high tower surrounded by women and sitting comfortably, he puts on various kinds of robes and jewelry.",
        "source": "T16n0673_001:0642c20_17"
    },
    {
        "source_sentence": "時大園林阿輸歌樹，種種雜華莊嚴精麗，其園在處有細軟風或大駃風，",
        "translation": "At that time the great park was surrounded by palm trees and luxuriant trees, adorned with exquisite arrays of all kinds of flowers.",
        "source": "T16n0673_001:0642c22_18"
    },
    {
        "source_sentence": "吹彼園林阿輸歌樹，眾華香氣至王所者，王聞之不？」",
        "translation": "Did the king hear the sound of the aśoka tree blowing from that grove and the fragrance of flowers reaching the king?",
        "source": "T16n0673_001:0642c24_0"
    },
    {
        "source_sentence": "毘毘沙那白言：「世尊！",
        "translation": "Vaiśravaṇa said, Bhagavān!",
        "source": "T16n0673_001:0642c25_1"
    },
    {
        "source_sentence": "我聞此香。」",
        "translation": "I've smelled this fragrance.",
        "source": "T16n0673_001:0642c25_2"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0642c25_3"
    },
    {
        "source_sentence": "汝聞此香，分別知不？」",
        "translation": "Do you smell this fragrance and discern it?",
        "source": "T16n0673_001:0642c26_4"
    },
    {
        "source_sentence": "王言：「世尊！",
        "translation": "The king said, Bhagavān!",
        "source": "T16n0673_001:0642c26_5"
    },
    {
        "source_sentence": "我能得知。」",
        "translation": "I can know it.",
        "source": "T16n0673_001:0642c27_0"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0642c27_1"
    },
    {
        "source_sentence": "此華香氣王言知者，見大小耶？",
        "translation": "Does this flower fragrance king say 'knower' when he sees large and small?",
        "source": "T16n0673_001:0642c27_2"
    },
    {
        "source_sentence": "定作何色？」",
        "translation": "What form does the concentration make?",
        "source": "T16n0673_001:0642c28_3"
    },
    {
        "source_sentence": "楞伽王言：「不也。",
        "translation": "King Laṅkâvatāra said, No.",
        "source": "T16n0673_001:0642c28_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0673_001:0642c28_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0673_001:0642c28_6"
    },
    {
        "source_sentence": "此香氣相，無色無現、無礙無相、無定處、不可說，是故不見大小形色。」",
        "translation": "These characteristics of fragrance are formless, formless, unmanifest, unobstructed, signless, indeterminate, and ineffable, so they don't see large or small form.",
        "source": "T16n0673_001:0642c29_7"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643a01_8"
    },
    {
        "source_sentence": "於意云何，若不見彼香氣大小，非斷絕相耶？」",
        "translation": "What do you think, if you don't see the size of that fragrance, isn't it a cut off characteristic?",
        "source": "T16n0673_001:0643a01_9"
    },
    {
        "source_sentence": "毘毘沙那言：「不也。",
        "translation": "Vaiśravaṇa said, No.",
        "source": "T16n0673_001:0643a02_10"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0673_001:0643a03_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0673_001:0643a03_12"
    },
    {
        "source_sentence": "若此眾香是斷相者，無人得聞。」",
        "translation": "If these fragrances are the characteristic of cessation, no one will be able to hear them.",
        "source": "T16n0673_001:0643a03_13"
    },
    {
        "source_sentence": "佛言：「如是如是。",
        "translation": "The Buddha said, So it is.",
        "source": "T16n0673_001:0643a04_14"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0643a04_15"
    },
    {
        "source_sentence": "識相亦爾，應如是見。",
        "translation": "The characteristics of consciousness should be seen in the same way.",
        "source": "T16n0673_001:0643a04_16"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0643a05_17"
    },
    {
        "source_sentence": "若識斷相，則無生死而可得知。",
        "translation": "If consciousness eliminates characteristics, then there's no birth-and-death that can be known.",
        "source": "T16n0673_001:0643a05_18"
    },
    {
        "source_sentence": "如是楞伽王！",
        "translation": "Thus, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643a06_19"
    },
    {
        "source_sentence": "識相清淨，唯是無明貪愛習氣業等，諸客煩惱之所覆障。",
        "translation": "The characteristics of consciousness are pure, but only ignorance, greed, thirst, habit energy, karma, and so on. They are hindered by the objective defilements.",
        "source": "T16n0673_001:0643a06_20"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0643a07_21"
    },
    {
        "source_sentence": "譬如清淨虛空之界，唯有四種客塵污染。",
        "translation": "It's like the pure realm of space, which is polluted by only four kinds of guest dust.",
        "source": "T16n0673_001:0643a08_22"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T16n0673_001:0643a09_0"
    },
    {
        "source_sentence": "所謂烟、雲、塵、霧。",
        "translation": "They are called smoke, clouds, dust, and mist.",
        "source": "T16n0673_001:0643a09_1"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0643a09_2"
    },
    {
        "source_sentence": "識相如是，本清淨故，無邊、不可捉、無有色染，唯是諸客煩惱之所覆染。",
        "translation": "The characteristics of consciousness are thus, because they are inherently pure, limitless, ungraspable, and without defilement by form, but only covered by guest afflictions.",
        "source": "T16n0673_001:0643a09_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T16n0673_001:0643a11_4"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0643a11_5"
    },
    {
        "source_sentence": "若正觀時不得眾生，無我、無眾生、無壽命、無畜養、無人、無眾生數、無知者、無見者、無覺者、無受者、無聽者，",
        "translation": "If someone doesn’t attain sentient beings when they correctly contemplate, there’s no self, no sentient beings, no life, no livelihood, no animal, no person, no number of sentient beings, no knower, no viewer, no apprehender, no recipient, and no listener.",
        "source": "T16n0673_001:0643a11_6"
    },
    {
        "source_sentence": "乃至無色、受、想、行、識等。",
        "translation": "It's even formless, feeling, perception, volition, consciousness, and so forth.",
        "source": "T16n0673_001:0643a14_7"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0643a14_8"
    },
    {
        "source_sentence": "若正觀時無有分別而可得者，楞伽王！",
        "translation": "If there's no discrimination when they correctly contemplate and can attain it, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643a14_9"
    },
    {
        "source_sentence": "諸法和合無有實相。",
        "translation": "The confluence of dharmas has no real characteristics.",
        "source": "T16n0673_001:0643a15_10"
    },
    {
        "source_sentence": "汝雖得是眾生實相，亦莫捨此生有曠野。",
        "translation": "Even though you've attained these real characteristics of sentient beings, don't abandon this world and the wilderness.",
        "source": "T16n0673_001:0643a16_11"
    },
    {
        "source_sentence": "云何名得眾生實相？",
        "translation": "What's called attaining the true characteristics of sentient beings?",
        "source": "T16n0673_001:0643a17_12"
    },
    {
        "source_sentence": "所謂得彼大智同性。」",
        "translation": "It's called attaining the same nature as that great wisdom.",
        "source": "T16n0673_001:0643a17_13"
    },
    {
        "source_sentence": "「眾生業力自迴轉，　　不得八聖最上道，",
        "translation": "The karmic power of sentient beings is self-transforming, not attaining the supreme path of the eight sages.",
        "source": "T16n0673_001:0643a18_14"
    },
    {
        "source_sentence": "　若離諸業證無漏，　　行無上行利眾生。」",
        "translation": "If they part with their actions and realize the uncontaminated, they'll perform the unsurpassed practice to benefit sentient beings.",
        "source": "T16n0673_001:0643a18_14"
    },
    {
        "source_sentence": "爾時世尊而說偈言：時毘毘沙那言：「世尊！",
        "translation": "It was then that the Bhagavān spoke a verse, saying, Vaiśravaṇa then said, Bhagavān!",
        "source": "T16n0673_001:0643a18_14"
    },
    {
        "source_sentence": "有無量恒河沙等眾生，於此三界稠林有海，到彼岸者復欲到者，有證聲聞法者、有證緣覺法者，",
        "translation": "Countless sentient beings as numerous as the grains of sand in the Ganges River dwell in these dense forests of the three realms. Those who have reached the other shore and wish to reach it again, some will realize the buddha-dharma of śrāvakas and some will realize the buddha-dharma of pratyekabuddhas.",
        "source": "T16n0673_001:0643a21_15"
    },
    {
        "source_sentence": "亦有若干已證無上大智同性者，於未來世亦有無量無邊不可數阿僧祇過是數恒河沙等眾生，",
        "translation": "Also, there are certain sentient beings in the future who have realized the unexcelled sameness of great knowledge. Innumerable, limitless, incalculable, and incalculable numbers of sentient beings equal to the number of grains of sand in the Ganges River",
        "source": "T16n0673_001:0643a23_16"
    },
    {
        "source_sentence": "乘此三乘各各別乘得入涅槃，而眾生界無增無減。",
        "translation": "Each of these three vehicles can enter nirvāṇa in a separate vehicle, but the sentient being realm has neither increase nor decrease.",
        "source": "T16n0673_001:0643a25_17"
    },
    {
        "source_sentence": "如是世尊！",
        "translation": "So it is, Bhagavān!",
        "source": "T16n0673_001:0643a27_18"
    },
    {
        "source_sentence": "我知如是，心生厭惓。」",
        "translation": "Knowing this, my mind becomes disillusioned.",
        "source": "T16n0673_001:0643a27_19"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643a27_20"
    },
    {
        "source_sentence": "汝莫於此生厭惓想。",
        "translation": "Don't give rise to thoughts of disillusionment here.",
        "source": "T16n0673_001:0643a28_21"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T16n0673_001:0643a28_22"
    },
    {
        "source_sentence": "諸眾生界前後不可盡故，虛空界、法界亦爾。",
        "translation": "Because the realm of sentient beings can't be exhausted before or after, so are the space realm and the Dharma realm.",
        "source": "T16n0673_001:0643a28_23"
    },
    {
        "source_sentence": "是故楞伽王！",
        "translation": "That's why, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643a29_24"
    },
    {
        "source_sentence": "諸眾生界不可言說，以是得知不增不減。",
        "translation": "The realm of sentient beings can't be described in words, so they know that it doesn't increase and doesn't decrease.",
        "source": "T16n0673_001:0643b01_25"
    },
    {
        "source_sentence": "如是三界稠林有為海中，已得度者、當欲度者，而眾生界亦不增減。",
        "translation": "Thus, in the thick forest of the three realms, there's a sea of conditioned things that have been liberated and those who want to be liberated, but the realm of sentient beings doesn't increase or decrease.",
        "source": "T16n0673_001:0643b02_0"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0643b03_1"
    },
    {
        "source_sentence": "譬如虛空界不增不減，無前無後亦無中間，是故虛空不可得知，遍一切處無礙無憂無作無想。",
        "translation": "Just as space neither increases nor decreases, there's no prior and no subsequent, and there's no middle; therefore, space can't be known, pervading all places without obstruction, without sorrow, without action, and without perception.",
        "source": "T16n0673_001:0643b03_2"
    },
    {
        "source_sentence": "如是如是，楞伽王！",
        "translation": "So it is, so it is, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643b06_0"
    },
    {
        "source_sentence": "非眾生界有初中後求之可得。",
        "translation": "It's not that the sentient being realm has a first, middle, and second parts that can be sought after.",
        "source": "T16n0673_001:0643b06_1"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0643b07_2"
    },
    {
        "source_sentence": "唯有已得聖法同性，是名盡於眾生界耳，而有為道不盡不滅。",
        "translation": "Only having attained the same nature as the noble dharmas is called exhausting the realm of sentient beings, and the conditioned path doesn't end or cease.",
        "source": "T16n0673_001:0643b07_3"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0643b08_4"
    },
    {
        "source_sentence": "亦不離彼有解脫道。",
        "translation": "Nor does he part with the path of liberation that exists there.",
        "source": "T16n0673_001:0643b08_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0673_001:0643b09_6"
    },
    {
        "source_sentence": "是眾生界法如此故，是故無初無中無後。」",
        "translation": "It's because the Dharma of the sentient being realm is like this, so there's no beginning and no middle and no end.",
        "source": "T16n0673_001:0643b09_7"
    },
    {
        "source_sentence": "毘毘沙那復問佛言：「世尊！",
        "translation": "Vaiśravaṇa again asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0643b11_0"
    },
    {
        "source_sentence": "眾生有為行海相貌何似？」",
        "translation": "What's the appearance of the ocean of conditioned actions of sentient beings?",
        "source": "T16n0673_001:0643b11_1"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643b12_2"
    },
    {
        "source_sentence": "眾生有為行海猶如大海。」",
        "translation": "The ocean of the conditioned actions of sentient beings is like a great ocean.",
        "source": "T16n0673_001:0643b12_3"
    },
    {
        "source_sentence": "復問佛言：「世尊！",
        "translation": "Again, he asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0643b13_4"
    },
    {
        "source_sentence": "諸佛之法復似何等？」",
        "translation": "What do the buddhas' teachings look like?",
        "source": "T16n0673_001:0643b13_5"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643b13_6"
    },
    {
        "source_sentence": "諸佛之法猶如船舶。」",
        "translation": "The teachings of the buddhas are like a ship.",
        "source": "T16n0673_001:0643b14_7"
    },
    {
        "source_sentence": "復問佛言：「世尊！",
        "translation": "Again, he asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0643b14_8"
    },
    {
        "source_sentence": "出家比丘受具戒法復似何等？」",
        "translation": "What does it look like for a renunciant monk who receives the full set of precepts?",
        "source": "T16n0673_001:0643b15_9"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643b15_10"
    },
    {
        "source_sentence": "出家比丘受具戒法，似治生人乘於船舶。」",
        "translation": "A renunciant monk who receives the full set of precepts resembles a living person riding a boat on a ship.",
        "source": "T16n0673_001:0643b16_11"
    },
    {
        "source_sentence": "復問佛言：「世尊！",
        "translation": "Again, he asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0643b17_0"
    },
    {
        "source_sentence": "如世尊說，依佛戒法具足奉行無毀破者，復似何等？」",
        "translation": "As the Bhagavān explains, what does it look like if someone who follows the Buddha's precepts and fully adheres to them without disparaging them?",
        "source": "T16n0673_001:0643b17_1"
    },
    {
        "source_sentence": "佛言：「持戒精進受法知足，似治生人乘堅牢船成就具足。",
        "translation": "The Buddha said, Observing the precepts and making effort to receive the full set of knowledge of the Dharma is like treating sentient beings who ride a sturdy boat that's fully endowed.",
        "source": "T16n0673_001:0643b18_2"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0643b19_3"
    },
    {
        "source_sentence": "有能如佛所說戒法不破不犯具足行者，亦復如是。」",
        "translation": "It's likewise with someone who can follow the precepts taught by the Buddha and doesn't break or violate them in full practice.",
        "source": "T16n0673_001:0643b20_4"
    },
    {
        "source_sentence": "復問佛言：「世尊！",
        "translation": "Again, he asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0643b21_5"
    },
    {
        "source_sentence": "善知識者復似何等？」",
        "translation": "What does a good teacher look like?",
        "source": "T16n0673_001:0643b21_6"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643b22_7"
    },
    {
        "source_sentence": "善知識者猶如船師。」",
        "translation": "A good teacher is like a boat captain.",
        "source": "T16n0673_001:0643b22_8"
    },
    {
        "source_sentence": "復問佛言：「世尊！",
        "translation": "Again, he asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0643b22_9"
    },
    {
        "source_sentence": "勤行八聖道復似何等？」",
        "translation": "What is the resemblance of diligently practicing the eight noble paths?",
        "source": "T16n0673_001:0643b23_10"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643b23_11"
    },
    {
        "source_sentence": "勤行八聖道者，似正疾風吹於船舶。」",
        "translation": "Those who diligently practice the eight noble paths seem like a boat blown by a right and fast wind.",
        "source": "T16n0673_001:0643b24_12"
    },
    {
        "source_sentence": "毘毘沙那復問佛言：「世尊！",
        "translation": "Vaiśravaṇa again asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0643b24_13"
    },
    {
        "source_sentence": "禪定三昧及諸神通復似何等？」",
        "translation": "What's the resemblance of meditation, samādhi, and other supernormal powers?",
        "source": "T16n0673_001:0643b25_14"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643b26_15"
    },
    {
        "source_sentence": "神通三昧猶如寶國。」",
        "translation": "The samādhi of supernormal powers is like a jeweled kingdom.",
        "source": "T16n0673_001:0643b26_16"
    },
    {
        "source_sentence": "毘毘沙那復問佛言：「世尊！",
        "translation": "Vaiśravaṇa again asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0643b26_17"
    },
    {
        "source_sentence": "七菩提分復似何等？」",
        "translation": "What do the seven factors of enlightenment look like?",
        "source": "T16n0673_001:0643b27_18"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643b28_0"
    },
    {
        "source_sentence": "七菩提分猶如七種寶性。」",
        "translation": "The seven factors of enlightenment are like the seven kinds of treasure nature.",
        "source": "T16n0673_001:0643b28_1"
    },
    {
        "source_sentence": "復問佛言：「世尊！",
        "translation": "Again, he asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0643b28_2"
    },
    {
        "source_sentence": "得七菩提分證大乘同性者復似何等？」",
        "translation": "What's the resemblance of someone who has attained the seven factors of enlightenment and realized the great vehicle sameness?",
        "source": "T16n0673_001:0643b29_3"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643c01_4"
    },
    {
        "source_sentence": "得七菩提分證大乘同性者，譬如值得七種寶性巨富貨賄稱意滿足，善哉善出家者，",
        "translation": "Attaining the seven factors of enlightenment and realizing the great vehicle sameness is like someone who's worthy of the seven kinds of jeweled nature, has a great deal of wealth, and fulfills their aspirations. Good, good renunciant!",
        "source": "T16n0673_001:0643c01_5"
    },
    {
        "source_sentence": "於我法中證於無礙無上佛果。」",
        "translation": "In my teaching, I'll realize the unobstructed and unsurpassed buddhahood.",
        "source": "T16n0673_001:0643c03_6"
    },
    {
        "source_sentence": "「觀察諸有苦，　　自苦眾生苦，",
        "translation": "Observing the suffering of existence, the suffering of self-suffering sentient beings,",
        "source": "T16n0673_001:0643c04_7"
    },
    {
        "source_sentence": "　亦捨諸有縛，　　我法中出家，",
        "translation": "They also abandon all bonds of existence, leave home in the self and dharmas,",
        "source": "T16n0673_001:0643c04_7"
    },
    {
        "source_sentence": "　即名為佛子，　　眾中最大德，",
        "translation": "That’s called the Buddha-child, The greatest virtue among all beings.",
        "source": "T16n0673_001:0643c04_7"
    },
    {
        "source_sentence": "　勤苦如法行，　　當得為世尊。」",
        "translation": "If you practice diligently and painstakingly according to the teaching, you'll be the Bhagavān.",
        "source": "T16n0673_001:0643c04_7"
    },
    {
        "source_sentence": "爾時世尊復說偈言：爾時毘毘沙那復問佛言：「世尊！",
        "translation": "It was then that the Bhagavān again spoke in verse, saying, At that point, Vaiśravaṇa again asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0643c04_7"
    },
    {
        "source_sentence": "若有眾生於佛法中得出家已，不能持戒，或有犯戒、或有破戒犯欲行者、或有脫於法服捨戒還俗。",
        "translation": "If there are sentient beings who leave home in the Buddha's teaching and can't observe the precepts, some may violate the precepts, some may break the precepts and violate sexual behavior, or some may part with the Dharma robe and abandon the precepts and return to the secular world.",
        "source": "T16n0673_001:0643c09_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0673_001:0643c11_9"
    },
    {
        "source_sentence": "如是癡人譬如何等？」",
        "translation": "What's the metaphor for such a deluded person?",
        "source": "T16n0673_001:0643c12_10"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643c12_11"
    },
    {
        "source_sentence": "若有眾生於我法中得出家已，受於戒法作諸毀犯，是癡人輩多墮惡道，",
        "translation": "If there are any sentient beings who have renounced the householder’s life based on my teaching and who, having received the precepts, commit infractions. Such ignorant people will often fall into evil states of existence.",
        "source": "T16n0673_001:0643c12_12"
    },
    {
        "source_sentence": "如治生人在大海中，船舶破壞沒命於水。」",
        "translation": "It's like when a person who cures birth in the ocean destroys a ship and loses his life in the water.",
        "source": "T16n0673_001:0643c14_13"
    },
    {
        "source_sentence": "毘毘沙那言：「世尊！",
        "translation": "Vaiśravaṇa said, Bhagavān!",
        "source": "T16n0673_001:0643c15_14"
    },
    {
        "source_sentence": "若有破戒犯戒犯欲行者，復說我行精進梵行，復有捐棄法服捨戒還俗，",
        "translation": "If someone breaks the precepts and violates them, or violates the precepts and sexually desires, they'll again say I'm practicing the religious practice of effort, and there will be another person who abandons the robe of the Dharma and renounces the precepts and returns to the secular world.",
        "source": "T16n0673_001:0643c15_15"
    },
    {
        "source_sentence": "彼一種人命終亡已或生好處，彼似何等？」",
        "translation": "What does that kind of person look like when their life ends and they die or give rise to happiness?",
        "source": "T16n0673_001:0643c17_16"
    },
    {
        "source_sentence": "佛言：「如治生人於大海中，船舶破壞沒溺水中，或有得船板者、或有得死屍者、或有自力浮者。",
        "translation": "The Buddha said, Suppose there's a living person in the ocean whose ship breaks down and drowns in water, or someone who gets a boat board, or someone who gets a dead corpse, or someone who floats on their own.",
        "source": "T16n0673_001:0643c18_17"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0643c20_18"
    },
    {
        "source_sentence": "是治生人得船板者，因風力吹得至洲島。",
        "translation": "This is the way to treat people who are born and obtain boats and boards, and because of the power of wind, they can blow up to a island.",
        "source": "T16n0673_001:0643c20_19"
    },
    {
        "source_sentence": "捉死屍者，海波所推漸到彼岸。",
        "translation": "Someone who catches a dead corpse is pushed by the waves and gradually reaches the other shore.",
        "source": "T16n0673_001:0643c21_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0673_001:0643c22_21"
    },
    {
        "source_sentence": "大海之法不宿死屍。",
        "translation": "The Dharma of the great ocean doesn't contain a dead corpse.",
        "source": "T16n0673_001:0643c22_22"
    },
    {
        "source_sentence": "若其自力能浮得度隨意所至，此是海神慈悲濟彼。",
        "translation": "If their self-power can float and save them wherever they wish, this is the ocean god compassionately rescuing them.",
        "source": "T16n0673_001:0643c23_0"
    },
    {
        "source_sentence": "如是如是，楞伽王！",
        "translation": "So it is, so it is, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643c24_1"
    },
    {
        "source_sentence": "若我法中得出家者，不能依戒如法護持，若捨戒法著於俗服得生善處者，",
        "translation": "If someone leaves home in my teaching and doesn't rely on the precepts to protect them according to the teaching, or if they abandon precepts and attachment to secular clothing and attain birth in a good place,",
        "source": "T16n0673_001:0643c24_2"
    },
    {
        "source_sentence": "或因我邊得正信者，或復內淨，或雖破戒恒有慈行或有精進。",
        "translation": "Some people attain right faith because of self-side, or they may be internally pure, or even though they break the precepts, they always have compassionate actions or exert effort.",
        "source": "T16n0673_001:0643c26_3"
    },
    {
        "source_sentence": "是故楞伽王！",
        "translation": "That's why, King Laṅkâvatāra!",
        "source": "T16n0673_001:0643c27_4"
    },
    {
        "source_sentence": "雖是破戒及還俗者，還因我法得生善處。」",
        "translation": "Even though they break the precepts and return to the secular world, they'll still be born in a good place because of my teaching.",
        "source": "T16n0673_001:0643c28_0"
    },
    {
        "source_sentence": "「往昔已作多罪業，　　無邊千億世生中，",
        "translation": "Having committed many sins in the past, In boundless thousands of myriadstical koṭis of worlds he was reborn.",
        "source": "T16n0673_001:0643c28_1"
    },
    {
        "source_sentence": "　發露懺悔更不造，　　滅無增長故清淨。」",
        "translation": "He reveals the repentance and doesn't create it again, and because cessation doesn't grow, it's pure.",
        "source": "T16n0673_001:0643c28_1"
    },
    {
        "source_sentence": "爾時世尊而說偈言：時毘毘沙那復問佛言：「世尊！",
        "translation": "It was then that the Bhagavān spoke a verse, saying, At that point, Vaiśravaṇa again asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0643c28_1"
    },
    {
        "source_sentence": "凡有幾種助菩提法？」",
        "translation": "How many kinds of things are there that aid in enlightenment?",
        "source": "T16n0673_001:0644a03_2"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0644a04_3"
    },
    {
        "source_sentence": "有三十七品助菩提法。",
        "translation": "There are thirty-seven factors that aid in enlightenment.",
        "source": "T16n0673_001:0644a04_4"
    },
    {
        "source_sentence": "何者名為三十七品？",
        "translation": "What are these called the thirty-seven chapters?",
        "source": "T16n0673_001:0644a04_5"
    },
    {
        "source_sentence": "所謂四念處、四正勤、四如意足、五根、五力、七覺分及八聖道。",
        "translation": "They are the four abodes of mindfulness, the fourfold correct effort, the four supernormal abilities, the five faculties, the five powers, the seven factors of awakening, and the eight noble paths.",
        "source": "T16n0673_001:0644a05_6"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0644a06_7"
    },
    {
        "source_sentence": "是名三十七品助菩提法。」",
        "translation": "These are called the thirty-seven factors that aid in enlightenment.",
        "source": "T16n0673_001:0644a06_8"
    },
    {
        "source_sentence": "復問佛言：「世尊！",
        "translation": "Again, he asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0644a07_9"
    },
    {
        "source_sentence": "解脫門者為有幾許？」",
        "translation": "How many ways does the gate of liberation exist?",
        "source": "T16n0673_001:0644a07_10"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0644a08_11"
    },
    {
        "source_sentence": "有三解脫門。",
        "translation": "There are three gates of liberation.",
        "source": "T16n0673_001:0644a08_12"
    },
    {
        "source_sentence": "何者為三？",
        "translation": "What are these three?",
        "source": "T16n0673_001:0644a08_13"
    },
    {
        "source_sentence": "所謂空、無相、無願。」",
        "translation": "It's called emptiness, signlessness, and wishlessness.",
        "source": "T16n0673_001:0644a09_14"
    },
    {
        "source_sentence": "復問佛言：「世尊！",
        "translation": "Again, he asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0644a09_15"
    },
    {
        "source_sentence": "須念何法？」",
        "translation": "What teaching does it need to be mindful of?",
        "source": "T16n0673_001:0644a09_16"
    },
    {
        "source_sentence": "佛言：「念厭滅入涅槃。」",
        "translation": "The Buddha said, He enters nirvāṇa with the cessation of mindfulness and disillusionment.",
        "source": "T16n0673_001:0644a10_17"
    },
    {
        "source_sentence": "復問佛言：「世尊！",
        "translation": "Again, he asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0644a10_18"
    },
    {
        "source_sentence": "諸對治法凡有幾許？」",
        "translation": "How many ways are there antidote dharmas?",
        "source": "T16n0673_001:0644a11_19"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0644a11_20"
    },
    {
        "source_sentence": "總而言之，三種對治。",
        "translation": "To sum up, these are the three kinds of antidotes.",
        "source": "T16n0673_001:0644a11_21"
    },
    {
        "source_sentence": "何者為三？",
        "translation": "What are these three?",
        "source": "T16n0673_001:0644a12_22"
    },
    {
        "source_sentence": "謂貪欲心者不淨觀，瞋恚心者慈悲觀，愚癡心者因緣觀，是名三種對治之法。」",
        "translation": "These are the three kinds of antidote that are called the contemplation of craving, the contemplation of impurity, the contemplation of anger, the contemplation of compassion, and the contemplation of folly.",
        "source": "T16n0673_001:0644a12_23"
    },
    {
        "source_sentence": "復問佛言：「世尊！",
        "translation": "Again, he asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0644a14_24"
    },
    {
        "source_sentence": "幾許巧能應須念持？」",
        "translation": "How much skillfulness is there that should be maintained by mindfulness?",
        "source": "T16n0673_001:0644a14_25"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0644a15_26"
    },
    {
        "source_sentence": "須念持者，巧知陰、巧知界、巧知入、巧知方便。」",
        "translation": "Those who need to be mindful and maintain it will skillfully know the aggregates, skillfully know the elements, skillfully know the entry, and skillfully know the method.",
        "source": "T16n0673_001:0644a15_27"
    },
    {
        "source_sentence": "復問佛言：「世尊！",
        "translation": "Again, he asked the Buddha, Bhagavān!",
        "source": "T16n0673_001:0644a16_28"
    },
    {
        "source_sentence": "須作何觀？」",
        "translation": "What contemplation should be done?",
        "source": "T16n0673_001:0644a16_29"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0644a17_0"
    },
    {
        "source_sentence": "須觀甚深十二因緣及四聖諦因果證等。」",
        "translation": "They must contemplate the profound twelve causes and conditions and the four noble truths of cause and effect as well.",
        "source": "T16n0673_001:0644a17_1"
    },
    {
        "source_sentence": "爾時毘毘沙那楞伽王，復更圍遶世尊三匝，以諸雜色七寶之華散於佛上，",
        "translation": "It was then that the king Vaiśravaṇa again circumambulated the Buddha three times, and scattered flowers of various colors and seven treasures over him.",
        "source": "T16n0673_001:0644a18_2"
    },
    {
        "source_sentence": "「云何菩薩諸聖行，　　生精進意利世間？",
        "translation": "What are the noble practices of enlightening beings that give rise to the world of effort and intention?",
        "source": "T16n0673_001:0644a19_3"
    },
    {
        "source_sentence": "　施戒忍辱及精進，　　發最上意為菩提，",
        "translation": "Giving, morality, forbearance, tolerance, and effort Awaken the supreme aspiration for enlightenment.",
        "source": "T16n0673_001:0644a19_3"
    },
    {
        "source_sentence": "　求彼無漏智慧時，　　攝化多億諸眾生，",
        "translation": "When they seek their untainted knowledge, They lead and inspire millions of sentient beings.",
        "source": "T16n0673_001:0644a19_3"
    },
    {
        "source_sentence": "　眾寶莊嚴無濁垢，　　精妙剎中得成佛。」",
        "translation": "The adornment of myriad treasures is unsullied, and I'll become a buddha in the marvelous blaze.",
        "source": "T16n0673_001:0644a19_3"
    },
    {
        "source_sentence": "散已右膝著地合掌向佛，驚歎如來而說偈言：爾時世尊告毘毘沙那楞伽王言：「善哉善哉！",
        "translation": "After he had scattered it, his right knee touched the ground with joined palms facing the Buddha, and in admiration of the Tathāgata, he spoke a verse, saying, The Bhagavān then addressed King Vaiśravaṇa, Good, good!",
        "source": "T16n0673_001:0644a19_3"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0644a27_0"
    },
    {
        "source_sentence": "汝能諮問如來此事，諦聽諦聽，善思念之，當為解說。",
        "translation": "You should inquire about this matter of the Tathāgata’s business. Listen attentively, and pay close attention to it. Understand and explain what you have been taught.",
        "source": "T16n0673_001:0644a27_1"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0644a28_2"
    },
    {
        "source_sentence": "菩薩摩訶薩常須行六波羅蜜，於一切眾生邊不生惡心。",
        "translation": "The bodhisattva Mahāsattva always requires the practice of the six perfections, and he doesn't give rise to bad thoughts at the side of all sentient beings.",
        "source": "T16n0673_001:0644a28_3"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0644a29_4"
    },
    {
        "source_sentence": "菩薩行如是法時不減不少，於諸佛法常得增長，亦不染著世間之法，攝受教化無量眾生，",
        "translation": "“When enlightening beings practice these teachings, they don’t decrease much; they always grow in the qualities of buddhas and aren’t stained by worldly phenomena. They embrace and lead infinite sentient beings.",
        "source": "T16n0673_001:0644b01_0"
    },
    {
        "source_sentence": "亦能清淨如來剎土，復能具得大智同性，於佛法中無障無礙。」",
        "translation": "They can also purify the Tathāgata's buddha land and fully attain the sameness of great wisdom, which is unobstructed and unobstructed in the Buddha's teaching.",
        "source": "T16n0673_001:0644b03_1"
    },
    {
        "source_sentence": "爾時毘毘沙那楞伽王白佛言：「世尊！",
        "translation": "It was then that King Vaiśravaṇa said to the Buddha, Bhagavān!",
        "source": "T16n0673_001:0644b04_2"
    },
    {
        "source_sentence": "云何修行？",
        "translation": "How do they cultivate it?",
        "source": "T16n0673_001:0644b05_3"
    },
    {
        "source_sentence": "云何得住阿耨多羅三藐三菩提？」",
        "translation": "How can they abide in unsurpassed, correct, and complete enlightenment?",
        "source": "T16n0673_001:0644b05_4"
    },
    {
        "source_sentence": "佛言：「放捨憍慢、貢高、嫉妬，常行四種清淨梵行，歡喜普為一切眾生恒行正真，",
        "translation": "The Buddha said, Rejecting conceit, pride, arrogance, and jealousy, they always practice the four kinds of pure religious practice, rejoicing in the constant practice of right and true for the sake of all sentient beings.",
        "source": "T16n0673_001:0644b06_5"
    },
    {
        "source_sentence": "須捨殺、盜、妄言、綺語、兩舌、惡口、飲酒、婬妷，莫使暫忘菩提之心，",
        "translation": "They should abandon killing, stealing, false speech, flattery, hypocrisy, double talk, harsh words, intoxicating liquors, and sexual misconduct, so as not to forget the determination for enlightenment for a moment.",
        "source": "T16n0673_001:0644b08_6"
    },
    {
        "source_sentence": "意樂勤行六波羅蜜，所作恒為安樂眾生，於有為中心常寂靜，欲度有海多諸怖畏，",
        "translation": "Their aspiration is to diligently practice the six transcendent ways. What they do always brings peace and comfort to sentient beings. At the center of all conditioned things they are always quiescent, wanting to liberate those in the sea of existence who have many fears.",
        "source": "T16n0673_001:0644b09_7"
    },
    {
        "source_sentence": "汝當正觀三界眾生令得度脫。",
        "translation": "You must correctly observe the sentient beings of the three realms so that they'll attain liberation.",
        "source": "T16n0673_001:0644b11_8"
    },
    {
        "source_sentence": "「復次楞伽王！",
        "translation": "Furthermore, King Laṅkâvatāra!",
        "source": "T16n0673_001:0644b13_0"
    },
    {
        "source_sentence": "汝若欲求菩提之者，須如是知，言菩提者，但有名字言語謂菩提耳。",
        "translation": "If you want to pursue enlightenment, you must thus know that it's called enlightenment, but there are names and words that call it enlightenment.",
        "source": "T16n0673_001:0644b13_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0673_001:0644b14_2"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0644b15_0"
    },
    {
        "source_sentence": "無有是菩提，無根是菩提，無住是菩提，無垢是菩提，無塵是菩提，無我是菩提，",
        "translation": "Enlightenment is nonexistent, enlightenment without faculties, enlightenment without dwelling, enlightenment without abode, enlightenment without defilement, enlightenment without dust, and enlightenment without self.",
        "source": "T16n0673_001:0644b15_1"
    },
    {
        "source_sentence": "不可捉是菩提，無色是菩提，無形是菩提，無此是菩提，無彼是菩提，",
        "translation": "Enlightenment cannot be grasped, and formlessness is enlightenment; formlessness is enlightenment; formlessness is enlightenment; nonexistence of this is enlightenment; nonexistence of that is enlightenment.",
        "source": "T16n0673_001:0644b16_2"
    },
    {
        "source_sentence": "無憂是菩提，無惱是菩提，無著是菩提，無染是菩提，無邊是菩提，無為是菩提，",
        "translation": "Enlightenment is the absence of sorrow; enlightenment is the absence of anguish; enlightenment is enlightenment; nonattachment is enlightenment; nondefilement is enlightenment; boundlessness is enlightenment; unconditionedness is enlightenment.",
        "source": "T16n0673_001:0644b18_3"
    },
    {
        "source_sentence": "無濁是菩提，已過一切根是菩提，除一切憶想念是菩提，已過一切有行是菩提，",
        "translation": "Enlightenment is the absence of defilement, and enlightenment transcends all faculties. The absence of any ideation or thought is enlightenment.",
        "source": "T16n0673_001:0644b20_4"
    },
    {
        "source_sentence": "無底是菩提，難知是菩提，甚深是菩提，無字是菩提，無相是菩提，寂靜是菩提，",
        "translation": "Enlightenment is bottomless, enlightenment is unfathomable, enlightenment is profound, wordlessness is enlightenment, signlessness is enlightenment, tranquility is enlightenment.",
        "source": "T16n0673_001:0644b22_5"
    },
    {
        "source_sentence": "清淨是菩提，無上是菩提，無譬喻是菩提，無求是菩提，無斷是菩提，",
        "translation": "What’s pure is enlightenment, what’s unsurpassed is enlightenment, what’s without analogy is enlightenment, what’s not seeking is enlightenment, and what’s not cut off is enlightenment.",
        "source": "T16n0673_001:0644b23_6"
    },
    {
        "source_sentence": "不壞是菩提，無破是菩提，無思惟是菩提，無物是菩提，無為是菩提，",
        "translation": "Enlightenment is nondestruction; enlightenment is the absence of decay; enlightenment is nonconceptual enlightenment; enlightenment is the absence of things; and enlightenment is nonaction.",
        "source": "T16n0673_001:0644b25_7"
    },
    {
        "source_sentence": "無見是菩提，無害是菩提，無明是菩提，無流注是菩提，常住是菩提，",
        "translation": "Enlightenment is the absence of views; enlightenment is the absence of harmfulness; enlightenment is the absence of ignorance; enlightenment is the absence of defilement; and enlightenment is the absence of passions.",
        "source": "T16n0673_001:0644b26_8"
    },
    {
        "source_sentence": "虛空是菩提，無等等是菩提，不可說是菩提。",
        "translation": "Space is enlightenment, peerlessness is enlightenment, and it can't be called enlightenment.",
        "source": "T16n0673_001:0644b28_9"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0644b29_10"
    },
    {
        "source_sentence": "欲求菩提者，若不求法是求菩提。",
        "translation": "Those who want to seek enlightenment, but if they don't seek the Dharma, they're seeking enlightenment.",
        "source": "T16n0673_001:0644b29_11"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0673_001:0644c01_12"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0644c01_13"
    },
    {
        "source_sentence": "若無有著，得證阿耨多羅三藐三菩提。",
        "translation": "If there's no attachment, they'll realize unsurpassed, correct, and complete enlightenment.",
        "source": "T16n0673_001:0644c01_14"
    },
    {
        "source_sentence": "又無我相、眾生相、命相、人相、畜養相、眾數相、作相、受相、知相、見相，",
        "translation": "The mark of selflessness, the mark of sentient beings, the mark of life, the mark of humans, the mark of animals, the mark of numbers, the mark of deeds, the mark of sensation, the mark of knowing, and the mark of seeing.",
        "source": "T16n0673_001:0644c02_15"
    },
    {
        "source_sentence": "乃可得證阿耨多羅三藐三菩提。",
        "translation": "They'll then attain unsurpassed, correct, and complete enlightenment.",
        "source": "T16n0673_001:0644c04_16"
    },
    {
        "source_sentence": "若不得世諦相者，不執著法，不執著陰、界，乃至不執著諸佛、菩薩，",
        "translation": "If someone doesn’t attain the marks of the conventional truth, they don’t cling to things, don’t cling to aggregates and elements, and don’t cling to buddhas or bodhisattvas.",
        "source": "T16n0673_001:0644c04_17"
    },
    {
        "source_sentence": "乃可得證阿耨多羅三藐三菩提。",
        "translation": "They'll then attain unsurpassed, correct, and complete enlightenment.",
        "source": "T16n0673_001:0644c06_18"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0673_001:0644c07_19"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0644c07_20"
    },
    {
        "source_sentence": "無所執著即是菩提。",
        "translation": "Nothing is attached to, which is enlightenment.",
        "source": "T16n0673_001:0644c07_21"
    },
    {
        "source_sentence": "若不執著物，若不執著常，若不執著斷者，於未來世證成菩提。",
        "translation": "If someone doesn't cling to things, doesn't cling to permanence, and doesn't cling to cessation, they'll realize enlightenment in the future.",
        "source": "T16n0673_001:0644c07_22"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T16n0673_001:0644c09_23"
    },
    {
        "source_sentence": "楞伽王！",
        "translation": "Laṅkâvatāra-rāja!",
        "source": "T16n0673_001:0644c09_24"
    },
    {
        "source_sentence": "一切諸法後際滅故。」",
        "translation": "It's because all dharmas are subsequently extinguished.",
        "source": "T16n0673_001:0644c09_25"
    },
    {
        "source_sentence": "時毘毘沙那楞伽王復白佛言：「世尊！",
        "translation": "Vaiśravaṇa then again said to the Buddha, Bhagavān!",
        "source": "T16n0673_001:0644c11_0"
    },
    {
        "source_sentence": "云何得知一切世諦法耶？」",
        "translation": "How do you know all the teachings of the conventional truth?",
        "source": "T16n0673_001:0644c11_1"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0644c12_2"
    },
    {
        "source_sentence": "知一切世諦法，如幻如化、如夢如焰、如水中月、如乾闥婆城，一切世諦法應如是知、如是覺、如是觀。」",
        "translation": "Knowing all the teachings of the worldly truths, such as illusions, such as magic tricks, such as dreams, such as flames, such as the moon in water, and such as the city of Gandhāra, all the teachings of the worldly truths should be known, perceived, and observed in this way.",
        "source": "T16n0673_001:0644c12_3"
    },
    {
        "source_sentence": "爾時毘毘沙那楞伽王，即得菩薩三昧，名無等等法光明智相；",
        "translation": "At that time the king Vaiśravaṇa then attained bodhisattva concentration called peerless light of knowledge characteristic of dharmas.",
        "source": "T16n0673_001:0644c14_4"
    },
    {
        "source_sentence": "得陀羅尼，名一切巧音。",
        "translation": "The attainment of the dhāraṇī is called all skillful sounds.",
        "source": "T16n0673_001:0644c16_5"
    },
    {
        "source_sentence": "得如是等無量無邊諸三昧陀羅尼已，時毘毘沙那楞伽王即白佛言：「世尊！",
        "translation": "After attaining these measureless and limitless dhāraṇīs of samādhi, King Vaiśravaṇa then said to the Buddha, Bhagavān!",
        "source": "T16n0673_001:0644c16_6"
    },
    {
        "source_sentence": "我今得此三昧陀羅尼已，覺知一切世諦之法。」",
        "translation": "Now that I've attained this dhāraṇī of samādhi, I'll perceive all the teachings of the conventional truth.",
        "source": "T16n0673_001:0644c18_7"
    },
    {
        "source_sentence": "佛言：「楞伽王！",
        "translation": "The Buddha said, King Laṅkâvatāra!",
        "source": "T16n0673_001:0644c19_8"
    },
    {
        "source_sentence": "云何覺知？」",
        "translation": "How do they perceive it?",
        "source": "T16n0673_001:0644c19_9"
    },
    {
        "source_sentence": "毘毘沙那言：「世尊！",
        "translation": "Vaiśravaṇa said, Bhagavān!",
        "source": "T16n0673_001:0644c20_10"
    },
    {
        "source_sentence": "一切世諦之法，如夢如幻、如響聲等、如山水駃、如水中月、如風吹空華、如秋雲起、如珠光明、如燈焰火、如華上露、如揵闥婆城、如水上泡、如虹如焰，",
        "translation": "All the teachings of the conventional truth are like dreams and illusions, like sounds and so forth, like mountains and rivers, like the moon in water, like flowers blown by the wind, like autumn clouds rising, like pearls shining, like flames on a lamp, like dew on a flower, like the city of Gandhāra, like",
        "source": "T16n0673_001:0644c20_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0673_001:0644c24_0"
    },
    {
        "source_sentence": "我已覺知世諦諸法現皆無常。」",
        "translation": "I've realized that all the dharmas in the worldly truth are impermanent in their appearance.",
        "source": "T16n0673_001:0644c24_1"
    },
    {
        "source_sentence": "爾時世尊即放頂上百千億那由他種種妙色光明，所謂青黃赤白紅紫頗梨及金等色，",
        "translation": "The Bhagavān then radiated hundreds of thousands of koṭis of nayutas of various subtle forms of light from his head, called blue, yellow, red, white, red, purple, crystal, gold, and so forth.",
        "source": "T16n0673_001:0644c24_2"
    },
    {
        "source_sentence": "普照無量無邊阿僧祇諸佛剎土，既遍照已還入頂上。",
        "translation": "They universally illuminate measureless, limitless, and incalculable buddha-lands, and after pervading them, they return to the top of their heads.",
        "source": "T16n0673_001:0644c26_3"
    },
    {
        "source_sentence": "「佛上妙德非無因，　　開放清淨光明網，",
        "translation": "The Buddha’s supreme qualities are not without cause; He opens up a network of pure light.",
        "source": "T16n0673_001:0644c28_4"
    },
    {
        "source_sentence": "　今意精妙覺發誰，　　放百光網願佛說。」",
        "translation": "Now, who will give rise to the marvelous awakening of mind that emanates the net of a hundred lights and wishes for the Buddha to teach it?",
        "source": "T16n0673_001:0644c28_4"
    },
    {
        "source_sentence": "爾時尊者大目犍連，即從座起偏袒右肩右膝著地，合掌向佛，說偈問言：佛告目犍連言：「汝見此毘毘沙那楞伽王，",
        "translation": "Venerable Mahāmaudgalyāyana then rose from his seat, bared his right shoulder, knelt with his right knee on the ground, joined his palms and faced the Buddha. He asked in verse: The Buddha said to Mahāmaudgalyāyana:",
        "source": "T16n0673_001:0644c28_4"
    },
    {
        "source_sentence": "在於我前合掌正立，以此廣大供養之具，用供養我及聲聞眾、諸菩薩眾，",
        "translation": "In front of me, he joined his palms and stood upright facing me. With these vast offerings I offered them to all the śrāvakas and bodhisattvas:",
        "source": "T16n0673_001:0645a03_5"
    },
    {
        "source_sentence": "因此功德發阿耨多羅三藐三菩提心不？」",
        "translation": "Does this merit give rise to the mind of unsurpassed, correct, and complete enlightenment?",
        "source": "T16n0673_001:0645a05_6"
    },
    {
        "source_sentence": "目犍連言：「世尊！",
        "translation": "Maudgalyāyana said, Bhagavān!",
        "source": "T16n0673_001:0645a06_7"
    },
    {
        "source_sentence": "我見。",
        "translation": "view of self...",
        "source": "T16n0673_001:0645a06_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0673_001:0645a07_0"
    },
    {
        "source_sentence": "我見。」",
        "translation": "I see it.",
        "source": "T16n0673_001:0645a07_1"
    },
    {
        "source_sentence": "佛言：「目犍連！",
        "translation": "The Buddha said, Maudgalyāyana!",
        "source": "T16n0673_001:0645a07_2"
    },
    {
        "source_sentence": "是毘毘沙那楞伽王，從我已去乃至當欲供養承事百千億那由他諸佛，過是已後彼身功德本力具足，",
        "translation": "This king Vaiśravaṇa of the Laṅkṣetra, who will follow me from here until I want to honor and serve hundreds of thousands of myriads of koṭis of nayutas of buddhas, after which his body will be endowed with merit and original strength.",
        "source": "T16n0673_001:0645a07_3"
    },
    {
        "source_sentence": "有世界名蓮華城，彼有世尊，號蓮華功德相震聲威王如來、阿羅呵、三藐三佛陀，",
        "translation": "There's a world named the Lotus City, and there's a Bhagavān named the Tathāgata, Arhat, Completely Enlightened One whose name is Lotus Flower Virtue Shaking Sound Majestic King.",
        "source": "T16n0673_001:0645a09_4"
    },
    {
        "source_sentence": "現在彼住，遊行說法。",
        "translation": "Where they live now, they travel and teach the Dharma.",
        "source": "T16n0673_001:0645a11_5"
    },
    {
        "source_sentence": "彼佛如來壽命無量，世界清淨。",
        "translation": "The life spans of those buddhas and tathāgatas are immeasurable, and the world is pure.",
        "source": "T16n0673_001:0645a12_6"
    },
    {
        "source_sentence": "此毘毘沙那楞伽王化生彼剎，生彼中已，即得菩薩歡喜之地，如是乃至得菩薩十地，",
        "translation": "These Vaiśravaṇas are born in those buddha-lands, and having been born there, they attain the stage of enlightening beings’ joy. In this way they attain the tenth stage of enlightening beings:",
        "source": "T16n0673_001:0645a12_7"
    },
    {
        "source_sentence": "過無量劫數已，於後生此娑婆世界當得成佛，號曰善妙震聲金威善淨光明現功德寶蓋莊嚴頂相毘盧遮那王如來、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "After an immeasurable number of eons have passed, he'll be born in this sahā world and become a buddha named Vairocana-rāja Tathāgata, Worthy of Offerings, Perfectly Enlightened, Fulfilling with Knowledge and Conduct, Well-Departed, Understander of the World, Unsurpassed, Tamer of Humans, Teacher of",
        "source": "T16n0673_001:0645a14_8"
    },
    {
        "source_sentence": "是最後生。",
        "translation": "It's the final birth.",
        "source": "T16n0673_001:0645a18_9"
    },
    {
        "source_sentence": "彼世界者名電寶冠，除諸山阜、坑坎、崖坂、土石、糞穢，無有女身及惡道等。",
        "translation": "That world is called the electric jeweled crown of lightning, with the exception of mountains, mounds, pits, cliffs, stones, dung, and dirt, where there's no female body or bad destinies.",
        "source": "T16n0673_001:0645a19_10"
    },
    {
        "source_sentence": "而彼佛剎清淨勝彼現在阿彌陀如來佛剎，諸菩薩眾充滿彼國，劫名善觀明，",
        "translation": "The buddha-lands there are pure and superior to the buddha-lands of Amitâbha Tathāgata in the present, and the assemblies of enlightening beings fill those lands.",
        "source": "T16n0673_001:0645a20_11"
    },
    {
        "source_sentence": "彼佛如來壽命無量。",
        "translation": "The life span of those buddhas and tathāgatas is immeasurable.",
        "source": "T16n0673_001:0645a22_12"
    },
    {
        "source_sentence": "目犍連！",
        "translation": "Maudgalyāyana!",
        "source": "T16n0673_001:0645a22_13"
    },
    {
        "source_sentence": "是故如來、至真、等正覺微笑。」",
        "translation": "That's why the Tathāgata, the supreme truth, and the perfectly enlightened one smile.",
        "source": "T16n0673_001:0645a23_14"
    },
    {
        "source_sentence": "時毘毘沙那楞伽王，得受阿耨多羅三藐三菩提記時，以為法故，歡喜踊躍遍體戰慄，",
        "translation": "When King Vaiśravaṇa had received the assurance of highest, complete enlightenment, he was delighted and jumped for joy because of the teaching. His whole body trembled in fear.",
        "source": "T16n0673_001:0645a23_15"
    },
    {
        "source_sentence": "「一切諸法空如夢，　　清淨非有同虛空，",
        "translation": "All things are empty like dreams, Pure and not the same as space.",
        "source": "T16n0673_001:0645a25_16"
    },
    {
        "source_sentence": "　我及無我悉皆無，　　我知如化如電光。",
        "translation": "Self and selflessness are all nonexistent: The self is like magic, like the lightning flash.",
        "source": "T16n0673_001:0645a25_16"
    },
    {
        "source_sentence": "　眾生有中自生滅，　　諦求一法不可得，",
        "translation": "Sentient beings themselves arise and cease in existence, Yet the single truth cannot be sought.",
        "source": "T16n0673_001:0645a25_16"
    },
    {
        "source_sentence": "　初中後等無所有，　　畜養眾生命亦然。",
        "translation": "The beginning, middle, and end have no existence: So is the animal husbandry of living beings.",
        "source": "T16n0673_001:0645a25_16"
    },
    {
        "source_sentence": "　眾生隨業得果報，　　有中展轉不休息，",
        "translation": "Sentient beings, according to their actions, attain the results of their deeds; There are some that develop and grow without cease.",
        "source": "T16n0673_001:0645a25_16"
    },
    {
        "source_sentence": "　若行如此菩提行，　　得知諸法體皆空。」",
        "translation": "If someone practices such an enlightened practice, they'll know that the essence of all dharmas is empty.",
        "source": "T16n0673_001:0645a25_16"
    },
    {
        "source_sentence": "飛上虛空高七多羅樹，於虛空中說此偈言：爾時毘毘沙那楞伽王說是偈已，",
        "translation": "He flew up into the sky, seven thousand yojanas high, and spoke these verses in the air: At that time King Vaiśravaṇa said these verses:",
        "source": "T16n0673_001:0645a25_16"
    },
    {
        "source_sentence": "從空中下，遶佛三匝，遶三匝已蒙佛威神却坐一面。",
        "translation": "He descended from the sky and circumambulated the Buddha three times. After circumambulating him three times, he was endowed with the Buddha’s authority and withdrew to sit at one side.",
        "source": "T16n0673_001:0645b04_17"
    },
    {
        "source_sentence": "時海眾中或有天、龍、阿修羅等證法得果者，或有夜叉、羅剎發菩提心者，",
        "translation": "Among the sea of time, some gods, dragons, asuras, and so forth in the assembly realized the Dharma and attained its fruit, or some yakṣas and rāṣas aroused the mind of enlightenment.",
        "source": "T16n0673_001:0645b05_18"
    },
    {
        "source_sentence": "或有緊那羅、摩睺羅伽於諸佛法得無疑者，或有迦樓羅、乾闥婆及呪神等得陀羅尼證法得果，",
        "translation": "Sometimes there are kiṃnaras and mahoragas who attain the absence of doubt in regard to the Buddha's teachings, sometimes there are garuḍas, gandharvas, and dhāraṇī spirits who attain the fruit of realizing the Dharma by means of dhāraṇī spells.",
        "source": "T16n0673_001:0645b07_19"
    },
    {
        "source_sentence": "於一切法得不退轉者。",
        "translation": "He who attains nonretrogression in all dharmas.",
        "source": "T16n0673_001:0645b09_20"
    },
    {
        "source_sentence": "即時大地震動，自然光明遍滿佛剎，乃至大小鐵圍山間普皆明照，一切惡道諸苦悉除，",
        "translation": "Immediately the great earthquake shook, and its natural light pervaded all buddha-lands, up to as many great and small iron mountain ranges. All the pains of the states of woe were eliminated.",
        "source": "T16n0673_001:0645b10_21"
    },
    {
        "source_sentence": "上虛空中雨諸天華，響擊天鼓叫嘯等聲，并諸衣服空中舒卷，自然顯現如是種種不思議事。",
        "translation": "It rains heavenly flowers in the sky above, sounds like beating celestial drums and screaming and wailing, and its clothing spreads out in the air, naturally revealing such various inconceivable things.",
        "source": "T16n0673_001:0645b12_22"
    },
    {
        "source_sentence": "時毘毘沙那楞伽王觀其自眾，如是告言：「汝等一切相與和合來向世尊，",
        "translation": "Vaiśravaṇa then observed his own assembly and said, All of you, in harmony with each other, come to the Bhagavān.",
        "source": "T16n0673_001:0645b14_23"
    },
    {
        "source_sentence": "生恭敬心發於阿耨多羅三藐三菩提心。」",
        "translation": "They give rise to the mind of respect and arouse the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T16n0673_001:0645b16_0"
    },
    {
        "source_sentence": "時彼無量百千羅剎相與和合，向佛合掌白言：「世尊！",
        "translation": "Measureless hundreds of thousands of rāṣas then combined with each other, joined their palms to the Buddha and said, Bhagavān!",
        "source": "T16n0673_001:0645b16_1"
    },
    {
        "source_sentence": "我等聚集相與和合，從今已去歸依於佛及以法、僧，發菩提心。",
        "translation": "From now on, we'll take refuge in the Buddha, Dharma, and Saṃgha, and give rise to the mind of enlightenment.",
        "source": "T16n0673_001:0645b18_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0673_001:0645b19_3"
    },
    {
        "source_sentence": "我等從今已去行大乘行，如來證知。",
        "translation": "From now on, we'll practice the great vehicle practice, which the Tathāgata has realized.",
        "source": "T16n0673_001:0645b19_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0673_001:0645b20_5"
    },
    {
        "source_sentence": "我等於未來世，在此娑婆剎中得成正覺，定斷惡業為無上尊，為一切眾生作利益故。」",
        "translation": "In a future life, we'll attain right awakening here in the sahā world, which will surely end bad actions as the unsurpassed honored one and work for the benefit of all sentient beings.",
        "source": "T16n0673_001:0645b20_6"
    },
    {
        "source_sentence": "佛言：「善哉善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T16n0673_001:0645b22_7"
    },
    {
        "source_sentence": "汝等若能發菩提心者，汝等當行四種善法。",
        "translation": "If you can give rise to the mind of enlightenment, you must practice four kinds of good qualities.",
        "source": "T16n0673_001:0645b22_8"
    },
    {
        "source_sentence": "凡善行者，行此四法得不忘彼菩提之心。",
        "translation": "Ordinary people who practice these four things will attain and not forget their mind of enlightenment.",
        "source": "T16n0673_001:0645b23_9"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T16n0673_001:0645b24_10"
    },
    {
        "source_sentence": "一者所有願行不違不失、二者於諸眾生常行慈心、三者一日三時供養三寶晝夜不絕、四者不願聲聞辟支佛果；",
        "translation": "The first is that all their vows and practices are not disobeyed or lost. The second is always compassionate toward sentient beings. The third is to make offerings to the Three Treasures day and night unceasingly at three times each day. The fourth is not wishing for the fruit of buddhahood of śrāvakas or pratyekabuddhas.",
        "source": "T16n0673_001:0645b25_11"
    },
    {
        "source_sentence": "此為汝等四法具足，不忘失彼菩提之心。」",
        "translation": "These are your four dharmas that are complete, so don't forget their mind of enlightenment.",
        "source": "T16n0673_001:0645b27_12"
    },
    {
        "source_sentence": "爾時海龍王從坐而起，偏袒右肩右膝著地，向佛合掌白佛：「世尊！",
        "translation": "It was then that the sea dragon king rose from his seat, bared his right shoulder, knelt with his right knee on the ground, joined his palms to the Buddha, and said to him, Bhagavān!",
        "source": "T16n0673_001:0645b29_0"
    },
    {
        "source_sentence": "毘毘沙那楞伽王，往昔造何善根，乃能如是廣供養具供養於佛及無數聲聞、菩薩眾等，",
        "translation": "What roots of goodness did the king Vaiśravaṇa Laṅkâvatāra cultivate in the past, so that he could thus make extensive offerings to the Buddha and countless śrāvakas and bodhisattvas?",
        "source": "T16n0673_001:0645c01_1"
    },
    {
        "source_sentence": "供養訖已發菩提心，發菩提心已證不退轉，得受阿耨多羅三藐三菩提記？」",
        "translation": "After making the offering, he gives rise to the mind of enlightenment, realizes nonregression after giving rise to the mind of enlightenment, and receives the assurance of unsurpassed, correct, and complete enlightenment.",
        "source": "T16n0673_001:0645c03_2"
    },
    {
        "source_sentence": "作是語已。",
        "translation": "After he said this, he said.",
        "source": "T16n0673_001:0645c05_3"
    },
    {
        "source_sentence": "佛告海龍王言：「龍王！",
        "translation": "The Buddha addressed the sea dragon king, saying, Dragon king!",
        "source": "T16n0673_001:0645c05_4"
    },
    {
        "source_sentence": "往昔過無量阿僧祇劫數時，彼有佛號大悲所生智相幢如來、至真、等正覺、應供、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊。",
        "translation": "In the past, more than an infinite number of incalculable eons ago, there was a buddha named Banner of Knowledge produced by great compassion, Tathāgata, Arhat, Completely Enlightened, Perfectly Enlightened, Worthy of Offerings, Perfectly Enlightened, Perfect in Knowledge and Conduct, Well-gone, Understander of the World,",
        "source": "T16n0673_001:0645c05_5"
    },
    {
        "source_sentence": "而彼如來亦還生此娑婆世界五濁世中，而彼如來、至真、等正覺，於眾生中演說分別三乘之法。",
        "translation": "That Tathāgata is also born again in the five turbid worlds of this sahā world, and that Tathāgata, Arhat, Perfectly Enlightened One teaches the distinctive teachings of the three vehicles to sentient beings.",
        "source": "T16n0673_001:0645c09_6"
    },
    {
        "source_sentence": "龍王！",
        "translation": "Great dragon king!",
        "source": "T16n0673_001:0645c11_7"
    },
    {
        "source_sentence": "時彼如來亦還住此摩羅耶山頂上，與五百比丘大聲聞眾、無量天龍及非人等，",
        "translation": "The Tathāgata then returned to this summit of the mountain and stayed there, accompanied by five hundred bhikṣus, great śrāvakas, innumerable devas, nāgas, as well as non-humans.",
        "source": "T16n0673_001:0645c11_8"
    },
    {
        "source_sentence": "眾中說法。",
        "translation": "He teaches the Dharma in the congregation.",
        "source": "T16n0673_001:0645c13_9"
    },
    {
        "source_sentence": "龍王！",
        "translation": "Great dragon king!",
        "source": "T16n0673_001:0645c13_10"
    },
    {
        "source_sentence": "時有羅剎童子名毘毘沙歌，亦還住此楞伽大城，形貌雄猛大腷巨力，其性[革*卬]惡面目鄙醜，",
        "translation": "At that time there was a rākṣasa boy named Vaiśravaṇa, also residing in the great city of Laṅkâvatāra. His appearance was heroic and strong, his nature [Ge*] ugly, his face and eyes coarse and ugly.",
        "source": "T16n0673_001:0645c13_11"
    },
    {
        "source_sentence": "唯食肉血口牙可畏。",
        "translation": "They only eat flesh, blood, mouth, and teeth that are fearful.",
        "source": "T16n0673_001:0645c15_12"
    },
    {
        "source_sentence": "龍王！",
        "translation": "Great dragon king!",
        "source": "T16n0673_001:0645c16_13"
    },
    {
        "source_sentence": "時彼毘毘沙歌羅剎童子，聞佛世尊住摩羅耶山頂上，即作是念：『我不欲此沙門及比丘眾在摩羅耶山頂上居住。",
        "translation": "When that boy Vaiśravaṇa heard that the Bhagavān was staying at the top of Mount Mālaya, he thought, 'I don't want these ascetics and monks to live on the top of Mount Mālaya.",
        "source": "T16n0673_001:0645c16_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0673_001:0645c18_15"
    },
    {
        "source_sentence": "若彼沙門住在摩羅耶山頂上者，我不能攝大海雜類，亦無眾生可殺害者，",
        "translation": "If that monk were to live on the top of Mount Mālaya, I wouldn't be able to gather together the great variety of things in the ocean, and there wouldn't be any sentient beings to kill.",
        "source": "T16n0673_001:0645c18_16"
    },
    {
        "source_sentence": "我今住此則恒飢餓。』",
        "translation": "Now that I'm here, I'll always starve.'",
        "source": "T16n0673_001:0645c20_17"
    },
    {
        "source_sentence": "龍王！",
        "translation": "Great dragon king!",
        "source": "T16n0673_001:0645c21_18"
    },
    {
        "source_sentence": "時彼毘毘沙歌羅剎童子，即告其眾諸羅剎言：『汝等有大力者宜可速來，",
        "translation": "The Licchavi youth Vaiśravaṇa then said to the other rākṣasīs, “If you have great strength, come quickly.",
        "source": "T16n0673_001:0645c21_19"
    },
    {
        "source_sentence": "著堅牢甲，各執刀杵槌弩斧戟、弓箭鉾楯，并金剛杵、鬪輪槊等，嚴持如是種種器杖。",
        "translation": "Each of them were wearing strongly fortified armor, carrying swords, hammers, hammers, crossbows, axes, halberds, bows, arrows, spears, shields, vajra-bodies, wrestling bowls, and so forth, and they all carried various implements such as these.",
        "source": "T16n0673_001:0645c22_20"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0673_001:0645c24_21"
    },
    {
        "source_sentence": "我今應當驅彼沙門及沙門眾去我境界，令其捨離我所住處。』",
        "translation": "Now, I should drive those ascetics and other ascetics away from my realm and cause them to abandon the place where I live.'",
        "source": "T16n0673_001:0645c25_22"
    },
    {
        "source_sentence": "龍王！",
        "translation": "Great dragon king!",
        "source": "T16n0673_001:0645c26_23"
    },
    {
        "source_sentence": "時毘毘沙歌羅剎童子，帶好堅甲及羅剎眾，各持種種別色器杖，飛行虛空向彼大悲所生智相幢如來。",
        "translation": "Vaiśravaṇa then flew up into space and flew toward the Tathāgata with his great compassionate wisdom-characteristic banner, which was produced by the Tathāgata.",
        "source": "T16n0673_001:0645c26_24"
    },
    {
        "source_sentence": "往至彼已住在虛空，與其徒眾語世尊言：『去去沙門，我不用汝住此山頂，",
        "translation": "Having arrived there, he remained in space. He said to the assembly of his disciples: O śramaṇas and brāhmaṇas, I am not asking you to stay at the top of this mountain.",
        "source": "T16n0673_001:0645c28_25"
    },
    {
        "source_sentence": "莫復令我殺汝沙門及汝眾等。』",
        "translation": "Don't let me again kill you as a monk or any of your people.'",
        "source": "T16n0673_001:0646a01_26"
    },
    {
        "source_sentence": "龍王！",
        "translation": "Great dragon king!",
        "source": "T16n0673_001:0646a02_27"
    },
    {
        "source_sentence": "爾時大悲所生智相幢如來，即現神通。",
        "translation": "At the time, the Tathāgata of the Banner of Knowledge and Characteristics produced by Great Compassion then manifested his supernormal powers.",
        "source": "T16n0673_001:0646a02_28"
    },
    {
        "source_sentence": "現神通已，時毘毘沙歌羅剎童子及其徒眾，各見自身被五繫縛，又見十方鐵網羅布，",
        "translation": "When he had manifested his supernormal powers, the boy Vaiśravaṇa and his disciples each saw themselves bound by the five fetters and also saw iron nets draped in the ten directions.",
        "source": "T16n0673_001:0646a03_29"
    },
    {
        "source_sentence": "欲走無路[怡-台+禁]然定住。",
        "translation": "They want to walk without a path [yi-tai+forbidden], but they're still standing in meditation.",
        "source": "T16n0673_001:0646a05_30"
    },
    {
        "source_sentence": "「龍王！",
        "translation": "Great dragon king!",
        "source": "T16n0673_001:0646a05_31"
    },
    {
        "source_sentence": "時毘毘沙歌羅剎童子及羅剎眾，心驚惶怖即生是念：『我等今者欲何處去？",
        "translation": "The Vaiśravaṇa and the other rākṣasa demons then became frightened and thought, 'Where do we want to go now?'",
        "source": "T16n0673_001:0646a05_32"
    },
    {
        "source_sentence": "求歸命誰？",
        "translation": "To whom do you seek refuge?",
        "source": "T16n0673_001:0646a07_33"
    },
    {
        "source_sentence": "向誰求救？",
        "translation": "To whom do you seek salvation?",
        "source": "T16n0673_001:0646a07_34"
    },
    {
        "source_sentence": "誰脫我等難？』",
        "translation": "Who will be freed from the difficulty of self?'",
        "source": "T16n0673_001:0646a08_35"
    },
    {
        "source_sentence": "龍王！",
        "translation": "Great dragon king!",
        "source": "T16n0673_001:0646a08_36"
    },
    {
        "source_sentence": "爾時彼佛眾中有呪神王，名正定深滿功德威，與彼毘毘沙歌羅剎童子宿作善友，",
        "translation": "At the time, there was a dhāraṇī king in that Buddha's congregation named Right Concentration, profound in virtue and authoritative, who became a good friend with that boy Vaiśravaṇa as his constellation.",
        "source": "T16n0673_001:0646a08_37"
    },
    {
        "source_sentence": "在彼世尊眾中集坐。",
        "translation": "He's sitting in the midst of that Bhagavān's congregation.",
        "source": "T16n0673_001:0646a10_38"
    },
    {
        "source_sentence": "龍王！",
        "translation": "Great dragon king!",
        "source": "T16n0673_001:0646a10_39"
    },
    {
        "source_sentence": "爾時正定深滿功德威持呪神王，語毘毘沙歌羅剎童子言：『善友！",
        "translation": "It was then that the king of the dhāraṇī spirit of profound merit and authoritative power of right concentration said to the boy Vaiśravaṇa, 'Good friend!",
        "source": "T16n0673_001:0646a11_0"
    },
    {
        "source_sentence": "諸佛世尊教化人天，所得無量諸功德法三界獨尊，眾生中寶有大悲行。",
        "translation": "Bhagavān, the buddhas and world-honored ones teach humans and gods, attain measureless merits and qualities that are unique to the three realms, and the treasures among sentient beings have great compassionate actions.",
        "source": "T16n0673_001:0646a12_1"
    },
    {
        "source_sentence": "汝善友及羅剎眾，此可歸依及以法僧。",
        "translation": "You good friends and the rākṣasa community can take refuge in this as well as the Dharma and Saṃgha.",
        "source": "T16n0673_001:0646a14_2"
    },
    {
        "source_sentence": "汝等歸依三寶發菩提心，一切繫縛即得解脫。』",
        "translation": "You must rely on the Three Treasures to give rise to the mind of enlightenment, and all bonds will be freed.'",
        "source": "T16n0673_001:0646a14_3"
    },
    {
        "source_sentence": "說是語已，龍王！",
        "translation": "Having said these words, the dragon king!",
        "source": "T16n0673_001:0646a16_0"
    },
    {
        "source_sentence": "爾時正定深滿功德威持呪神王，教化力故及佛神力，即時毘毘沙歌羅剎童子及羅剎眾，",
        "translation": "At the time, the dhāraṇī king of profound virtue and authoritative spells in right concentration, because of the power of teaching and the power of the Buddha's supernormal power, immediately went to Vaiśravaṇa and the Rāṣṭrapāla children and the Rāṣṭrapāla congregation.",
        "source": "T16n0673_001:0646a16_1"
    },
    {
        "source_sentence": "俱共合掌出如是言：『南無無邊功德莊嚴身者，南無最上大悲覺者，我等與汝今日已去，",
        "translation": "They all joined their palms and said, “No one in the south is adorned with a body of boundless virtue. And no one in the south is enlightened with the supreme compassion.",
        "source": "T16n0673_001:0646a18_2"
    },
    {
        "source_sentence": "歸依於佛及以法僧，我等恒行歸依三寶，發阿耨多羅三藐三菩提心。』",
        "translation": "Taking refuge in the Buddha and Dharma and saṃgha, we always take refuge in the Three Treasures and give rise to the mind of unsurpassed, correct, and complete enlightenment.'",
        "source": "T16n0673_001:0646a20_3"
    },
    {
        "source_sentence": "龍王！",
        "translation": "Great dragon king!",
        "source": "T16n0673_001:0646a22_0"
    },
    {
        "source_sentence": "時毘毘沙歌羅剎童子及一切羅剎眾，出此言已，一切繫縛即得解脫，從虛空來向大悲所生智相幢王如來，",
        "translation": "After these words were uttered, the Vaiśravaṇa youth and all the other rākṣatriyas emerged from space and came to the Tathāgata Mahāprajāpatīṣaṅkusumitābhijña, the great compassionate buddha named King of Knowledge.",
        "source": "T16n0673_001:0646a22_1"
    },
    {
        "source_sentence": "至彼世尊三匝圍遶。",
        "translation": "He went to the Bhagavān and circumambulated him three times.",
        "source": "T16n0673_001:0646a24_2"
    },
    {
        "source_sentence": "時毘毘沙歌羅剎童子及羅剎眾，一切俱時頂禮佛足，於彼如來乞求懺悔，",
        "translation": "The Vaiśravaṇa and the other rākṣasa demons all bowed their heads at the Buddha’s feet and begged him to make a repentance.",
        "source": "T16n0673_001:0646a25_0"
    },
    {
        "source_sentence": "乞懺悔已各還本處。",
        "translation": "After begging for repentance, they each returned to their original place.",
        "source": "T16n0673_001:0646a26_1"
    },
    {
        "source_sentence": "「龍王！",
        "translation": "Great dragon king!",
        "source": "T16n0673_001:0646a27_2"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T16n0673_001:0646a27_3"
    },
    {
        "source_sentence": "汝今當知，是時世中毘毘沙歌羅剎童子者豈異人乎？",
        "translation": "You should now know that the boy Vaiśravaṇa is no different from anyone in the world at the time.",
        "source": "T16n0673_001:0646a27_4"
    },
    {
        "source_sentence": "今毘毘沙那楞伽王是也。",
        "translation": "This is the present-day king Vaiśravaṇa Laṅkâvatāra.",
        "source": "T16n0673_001:0646a28_5"
    },
    {
        "source_sentence": "時彼世中羅剎眾者更非別眾，今毘毘沙那楞伽王羅剎眾者是也。",
        "translation": "The rāṣasasas in that world at the time were not separate congregations, but the present-day rāṣas of Vaiśravaṇa and Śāriputra are.",
        "source": "T16n0673_001:0646a29_6"
    },
    {
        "source_sentence": "龍王！",
        "translation": "Great dragon king!",
        "source": "T16n0673_001:0646b01_7"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T16n0673_001:0646b01_8"
    },
    {
        "source_sentence": "時彼世中正定深滿功德威持呪神王者亦非別人，即是海妙深持自在智通菩薩摩訶薩是也。」",
        "translation": "That person in that world who correctly perfects the profound and authoritative power of the dhāraṇī king's spell is not someone else, which is the bodhisattva-mahāsattva with the marvelous depth of oceanic self-contained knowledge.",
        "source": "T16n0673_001:0646b02_9"
    },
    {
        "source_sentence": "作是語已，此三千大千世界即時震動，猶如船舶在大海中隨波動搖，眾生類中無見驚怖及以害者，",
        "translation": "Having said these words, the great chiliocosm immediately shook like a ship in the great ocean going along with the waves. All sentient beings were not frightened or terrified and no one could harm them.",
        "source": "T16n0673_001:0646b04_10"
    },
    {
        "source_sentence": "唯得一切安隱快樂，一切眾生持十善行。",
        "translation": "They only attain all peace and happiness, and all sentient beings maintain the ten good actions.",
        "source": "T16n0673_001:0646b06_11"
    },
    {
        "source_sentence": "時此娑婆佛剎，除去高山須彌大海、國土聚落、山林海島、黑山龕窟稠林、園池河泉、陂澤丘陵、坑坎崖隴、石壁沙鹵、棘刺泥糞、臭穢可惡，",
        "translation": "At the time, this sahā buddha-stage was free of high mountains, Sumeru and the great sea, lands, villages, mountains, forests, oceans, caves, dense forests, parks, ponds, rivers, mounds, hills, pits, cliffs, rock walls, sand, salt, thorns, thorn",
        "source": "T16n0673_001:0646b07_12"
    },
    {
        "source_sentence": "除閻浮檀金。",
        "translation": "It's except for the gold of Jambudvīpa.",
        "source": "T16n0673_001:0646b10_13"
    },
    {
        "source_sentence": "大光普照此三千大千世界，所有一切大小鐵圍山中一切諸闇一切光明，",
        "translation": "Great light illumines this billion-world universe, shining all the darknesses and all the lights of all the great and small iron mountains in all directions.",
        "source": "T16n0673_001:0646b10_14"
    },
    {
        "source_sentence": "及以日月所不照處彼明遍照隱蔽日月，況餘光明。",
        "translation": "It's because the sun and moon don't illuminate places where their light pervades and obscures the sun and moon, so why wouldn't they illuminate other lights?",
        "source": "T16n0673_001:0646b12_15"
    },
    {
        "source_sentence": "一切諸影是時不現，滅除一切地獄、畜生、餓鬼等苦。",
        "translation": "All the shadows don't appear when they are present, and they extinguish all the suffering of hells, animals, hungry ghosts, and so forth.",
        "source": "T16n0673_001:0646b13_16"
    },
    {
        "source_sentence": "即時此娑婆世界諸天人等，若有苦惱一切皆得安隱受樂，若有眾生飢者得食、渴者得飲、裸者得衣、貧者得寶、盲者見色、聾者聞聲、啞者能語，",
        "translation": "Immediately, the gods and humans of this sahā world will all attain peace and happiness if there's suffering or distress, and if there are sentient beings hungry who get food, thirst who get drink, naked who get clothing, poor who get treasure, blind who see form, deaf who hear sound, dumb who can speak, and dumb who can speak.",
        "source": "T16n0673_001:0646b14_17"
    },
    {
        "source_sentence": "六根殘缺悉得具足，閉在牢獄普皆解脫。",
        "translation": "The six faculties are all replete with deficiencies, and they're shut up in prison and liberated everywhere.",
        "source": "T16n0673_001:0646b18_18"
    },
    {
        "source_sentence": "大乘同性經卷上",
        "translation": "Mahāyāna homogeneous-nature scripture, vol. 1",
        "source": "T16n0673_001:0646b20_0"
    }
]