[
    {
        "source_sentence": "合部金光明經卷第五",
        "translation": "Jiangmuangming jing, vol. 5",
        "source": "T16n0664_005:0382a04_0"
    },
    {
        "source_sentence": "隋大興善寺沙門釋寶貴合",
        "translation": "Śākyamuni, the monk of Daxingshansi in the Sui dynasty",
        "source": "T16n0664_005:0382a06_0"
    },
    {
        "source_sentence": "北涼天竺三藏曇無讖譯",
        "translation": "Northern Liang Tianzhushu Sanzang translated by Dharmakṣema",
        "source": "T16n0664_005:0382a07_0"
    },
    {
        "source_sentence": "四天王品第十",
        "translation": "Tenth Chapter of the Four Great Deva Kings",
        "source": "T16n0664_005:0382a08_0"
    },
    {
        "source_sentence": "爾時，毘沙門天王、提頭賴吒天王、毘留勒叉天王、毘留博叉天王俱從坐起，",
        "translation": "At that time, the deva king Vaiśravaṇa, the deva king Dhṛtarāṣṭra, the deva king Virūḍhaka, and the deva king Virūpākṣa rose from their seats.",
        "source": "T16n0664_005:0382a09_0"
    },
    {
        "source_sentence": "偏袒右肩，右膝著地，胡跪合掌白佛言：「世尊！",
        "translation": "He bared his right shoulder, knelt with his right knee on the ground, knelt down with his palms joined, and said to the Buddha, Bhagavān!",
        "source": "T16n0664_005:0382a10_1"
    },
    {
        "source_sentence": "是金光明微妙經典——眾經之王——諸佛世尊之所護念，莊嚴菩薩深妙功德，",
        "translation": "This subtle scripture of golden light-the king of all scriptures-is guarded by the buddhas and world-honored ones, adorning the profound and marvelous virtues of enlightening beings.",
        "source": "T16n0664_005:0382a11_2"
    },
    {
        "source_sentence": "常為諸天之所恭敬，能令天王心生歡喜，亦為護世之所讚嘆。",
        "translation": "They are always respected by the gods, able to cause the king of gods to rejoice in their hearts and be praised by world protectors.",
        "source": "T16n0664_005:0382a13_3"
    },
    {
        "source_sentence": "此經能照諸天宮殿、是經能與眾生快樂、是經能令地獄餓鬼畜生諸河燋乾枯竭、是經能除一切怖畏、是經能却他方怨賊、是經能除穀貴飢饉、是經能愈一切疫病、是經能滅惡星變異、是經能去一切憂惱。",
        "translation": "This sūtra can illuminate the palaces of gods, this sūtra can give happiness to sentient beings, this sūtra can cause hells, hungry ghosts, animals, and rivers to dry up, this sūtra can remove all fears, this sūtra can repulse enemies from other directions, this sūtra can remove valuable grain and hunger, this sūtra can",
        "source": "T16n0664_005:0382a14_4"
    },
    {
        "source_sentence": "舉要言之：是經能滅一切眾生無量無邊百千苦惱。",
        "translation": "To summarize, this sūtra can extinguish the measureless and limitless hundreds of thousands of sufferings and distress of all sentient beings.",
        "source": "T16n0664_005:0382a19_5"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0382a20_6"
    },
    {
        "source_sentence": "是金光明微妙經典，若在大眾廣宣說時，我等四王及餘眷屬，聞此甘露無上法味增益身力、心進勇銳、具諸威德。",
        "translation": "When this subtle scripture of golden light is extensively taught in the great assembly, when we four kings and other members of their retinues hear this taste of the unsurpassed dharma flavor of ambrosia, they'll gain physical strength, mental momentum, courage, and authority.",
        "source": "T16n0664_005:0382a20_7"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0382a23_8"
    },
    {
        "source_sentence": "我等四王能說正法、修行正法，為世法王以法治世。",
        "translation": "We four kings can teach the right teaching and cultivate the right teaching, and we are the Dharma kings of the world to rule the world.",
        "source": "T16n0664_005:0382a23_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0382a24_10"
    },
    {
        "source_sentence": "我等四王及天、龍、鬼神、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽以法治世，",
        "translation": "We four kings, devas, nāgas, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, and mahoragas rule the world.",
        "source": "T16n0664_005:0382a24_11"
    },
    {
        "source_sentence": "遮諸惡鬼、噉精氣者。",
        "translation": "It's to shield them from bad ghosts and angry spirits.",
        "source": "T16n0664_005:0382a26_12"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0382a26_13"
    },
    {
        "source_sentence": "我等四王、二十八部諸鬼神等，及無量百千鬼神，以淨天眼過於人眼，",
        "translation": "We, the four great kings, the twenty-eight kinds of spirits, as well as countless hundreds of thousands of other spirits, with pure divine vision surpassed human [vision].",
        "source": "T16n0664_005:0382a26_14"
    },
    {
        "source_sentence": "常觀擁護此閻浮提。",
        "translation": "He always observes and embraces this Jambudvīpa.",
        "source": "T16n0664_005:0382a28_15"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0382a29_0"
    },
    {
        "source_sentence": "是故我等名護世王。",
        "translation": "That's why we're called world-protecting kings.",
        "source": "T16n0664_005:0382a29_1"
    },
    {
        "source_sentence": "若此國土有諸衰耗、怨賊侵境、飢饉疾疫、種種艱難，若有比丘受持是經，",
        "translation": "If this land is subject to decay, enemies and thieves attacking it, famine, epidemics, and various hardships, if a monk accepts and upholds this scripture.",
        "source": "T16n0664_005:0382a29_2"
    },
    {
        "source_sentence": "我等四王當共勸請，令是比丘以我力故，疾往彼所國邑郡縣廣宣流布是金光明微妙經典，",
        "translation": "We four kings should encourage this bhikṣu, so that by the power of my own volition he may quickly go to those countries and preach widely in their towns and villages this subtle scripture of the golden light.",
        "source": "T16n0664_005:0382b02_3"
    },
    {
        "source_sentence": "令如是等種種百千衰耗之事悉皆滅盡。",
        "translation": "It causes all these kinds of hundreds of thousands of decaying things to cease.",
        "source": "T16n0664_005:0382b04_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0382b05_5"
    },
    {
        "source_sentence": "如諸國王所有土境，是持經者若至其國，是王應當往是人所聽受如是微妙經典。",
        "translation": "Suppose there's a land belonging to the kings of various countries, and if this person who holds the sūtra arrives in their country, that king should go there and listen to such a subtle sūtra.",
        "source": "T16n0664_005:0382b05_6"
    },
    {
        "source_sentence": "聞已歡喜，復當護念恭敬是人。",
        "translation": "Having heard it, they'll rejoice, and they'll also guard their mindfulness and respect that person.",
        "source": "T16n0664_005:0382b07_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0382b08_0"
    },
    {
        "source_sentence": "我等四王復當勤心擁護是王及國人民，為除衰患，令得安隱。",
        "translation": "Again, we four kings should wholeheartedly protect these kings and the people of their countries in order to remove their troubles and make them at ease.",
        "source": "T16n0664_005:0382b08_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0382b09_2"
    },
    {
        "source_sentence": "若有比丘、比丘尼、優婆塞、優婆夷受持是經，若諸人王有能供給施其所安，",
        "translation": "If there are any monks, bhikṣuṇīs, laymen, or laywomen who preserve this sutra, and if the kings of people can make offerings to them for their well-being,",
        "source": "T16n0664_005:0382b09_3"
    },
    {
        "source_sentence": "我等四王亦當令是王及國人一切安隱，具足無患。",
        "translation": "We four kings will also cause these kings and the people of their countries to be completely at ease, endowed with nothing to fear.",
        "source": "T16n0664_005:0382b11_4"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0382b12_5"
    },
    {
        "source_sentence": "若有四眾受持讀誦是妙經典，若諸人王有能供養、恭敬、尊重、讚嘆，",
        "translation": "Suppose there are four groups of people who preserve and recite this wonderful scripture, and if the kings of men can offer support, venerate, honor, venerate, and praise it.",
        "source": "T16n0664_005:0382b12_6"
    },
    {
        "source_sentence": "我等四王亦復當令如是人王於諸王中常得第一供養、恭敬、尊重、讚嘆，",
        "translation": "We four kings should also cause these human kings to be honored, revered, venerated, and praised as the foremost among all the kings.",
        "source": "T16n0664_005:0382b14_7"
    },
    {
        "source_sentence": "亦令餘王欽尚羨慕、稱嘆其善。」",
        "translation": "It also causes other kings to admire it and praise its goodness.",
        "source": "T16n0664_005:0382b15_8"
    },
    {
        "source_sentence": "爾時，世尊讚嘆護世四天王等：「善哉，善哉！",
        "translation": "At that point, the Bhagavān praised the four world-protecting celestial kings and others, Good, good!",
        "source": "T16n0664_005:0382b17_0"
    },
    {
        "source_sentence": "汝等四王過去以曾供養、恭敬、尊重、讚嘆無量百千萬億諸佛，於諸佛所種諸善根，",
        "translation": "In the past you four kings honored, venerated, revered, and praised innumerable hundreds of thousands of myriads of koṭis of buddhas. You planted roots of goodness in their presence.",
        "source": "T16n0664_005:0382b17_1"
    },
    {
        "source_sentence": "說於正法、修行正法，以法治世，為人天王。",
        "translation": "He teaches the right teaching and cultivates the right teaching in order to rule the world as king of humans and gods.",
        "source": "T16n0664_005:0382b19_2"
    },
    {
        "source_sentence": "汝等今日長夜利益於諸眾生，行大悲心施與眾生一切樂具，能遮諸惡，",
        "translation": "For a long time this day and night you have benefited sentient beings. With great compassion you have given all comforts to sentient beings, thereby shielding them from evil.",
        "source": "T16n0664_005:0382b20_3"
    },
    {
        "source_sentence": "勤與諸善。",
        "translation": "He diligently gives them to the good.",
        "source": "T16n0664_005:0382b22_4"
    },
    {
        "source_sentence": "以是義故，若有人王能供養恭敬此金光明微妙經典，汝等正應如是護念，",
        "translation": "For this reason, if a king were to honor and venerate this subtle scripture of golden light, you should guard it in the same way.",
        "source": "T16n0664_005:0382b22_5"
    },
    {
        "source_sentence": "滅其苦惱、與其安樂。",
        "translation": "He extinguishes their suffering and distress and brings them peace and happiness.",
        "source": "T16n0664_005:0382b24_6"
    },
    {
        "source_sentence": "汝等四王及諸眷屬、無量無邊百千鬼神若能護念如是經典者，即是護持去來現在諸佛正法。",
        "translation": "If you four kings, your retinues, measureless and limitless hundreds of thousands of myriadstical spirits can preserve this kind of scripture, that is to say, they will preserve the true-dharma of the buddhas of the past, future, and present.",
        "source": "T16n0664_005:0382b24_7"
    },
    {
        "source_sentence": "汝等四王及餘天眾百千鬼神，與阿修羅共戰鬪時，汝等諸天常得勝利。",
        "translation": "When you four kings and hundreds of thousands of other gods and spirits fight with the asuras, you gods always attain victory.",
        "source": "T16n0664_005:0382b27_8"
    },
    {
        "source_sentence": "汝等若能護念是經，悉能消伏一切諸苦，所謂怨賊、飢饉、疾疫。",
        "translation": "If you can guard and remember this sutra, you will all be able to subdue all the sufferings called enemies, thieves, hunger, famine, and epidemics.",
        "source": "T16n0664_005:0382b28_9"
    },
    {
        "source_sentence": "若四部眾有能受持讀誦此經，汝等亦應勤心守護，為除衰惱、施與安樂。」",
        "translation": "If there are four groups of people in the assembly who can memorize and recite this sūtra, you should also diligently guard it with your minds to remove defilement and give them peace and comfort.",
        "source": "T16n0664_005:0382c01_10"
    },
    {
        "source_sentence": "爾時，四王復白佛言：「世尊！",
        "translation": "It was then that the four kings again said to the Buddha, Bhagavān!",
        "source": "T16n0664_005:0382c03_0"
    },
    {
        "source_sentence": "是金光明微妙經典，於未來世在所流布——若國土、城邑、郡縣、村落——隨所至處，",
        "translation": "This subtle scripture of golden light will spread in the future, wherever it may be found—in any land, city, prefecture, town, or village.",
        "source": "T16n0664_005:0382c03_1"
    },
    {
        "source_sentence": "若諸國王以天律治世、復能恭敬至心聽受是妙經典、并復尊重供養供給持是經典四部之眾，",
        "translation": "If the kings of various countries rule the world according to divine law, and if they can reverently and sincerely listen to this wonderful scripture and venerate, offer support, and preserve it for the sake of the fourfold assembly.",
        "source": "T16n0664_005:0382c05_2"
    },
    {
        "source_sentence": "以是因緣，我等時時得聞如是微妙經典，聞已即得增益身力、心進勇銳、具諸威德。",
        "translation": "Because of these causes and conditions, we can hear such a subtle sūtra from time to time, and after hearing it, we'll attain increased physical strength, mental advancement, courage, and majestic virtue.",
        "source": "T16n0664_005:0382c07_3"
    },
    {
        "source_sentence": "是故，我等及無量鬼神常當隱形，隨是妙典所流布處而作擁護，令無留難；",
        "translation": "Because of this, we and countless other spirits will always remain in seclusion. Following the exposition of this wonderful scripture, we will be able to protect it without any difficulty.",
        "source": "T16n0664_005:0382c09_4"
    },
    {
        "source_sentence": "亦當護念聽是經典諸國王等及其人民，除其患難，悉令安隱，他方怨賊亦使退散。",
        "translation": "You should also guard your thoughts and listen to this sūtra, so that the kings and their people will be freed from their troubles and make them all feel at ease, and other enemies and thieves in other directions will retreat.",
        "source": "T16n0664_005:0382c11_5"
    },
    {
        "source_sentence": "若有人王聽是經時，隣國怨敵興如是念：『當具四兵壞彼國土。』",
        "translation": "Suppose there's a person who hears this sūtra and the enemies of neighboring countries think, 'Should he have four armies to destroy that land?'",
        "source": "T16n0664_005:0382c12_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0382c14_7"
    },
    {
        "source_sentence": "以是經典威神力故，爾時隣敵更有異怨為作留難，於其境界起諸衰惱、災異、疫病，",
        "translation": "Because of the authoritative power of this sūtra, when there's a neighboring enemy with another different enemy who makes it difficult for them to stay, they give rise to decay, misfortune, and epidemics in their objective realm.",
        "source": "T16n0664_005:0382c14_8"
    },
    {
        "source_sentence": "爾時怨敵起如是等諸惡事已，備具四兵發向是國規往討罰，我等爾時當與眷屬、無量無邊百千鬼神隱蔽其形為作護助，",
        "translation": "At the time, when enemies and enemies committed these kinds of evil deeds, they gathered their four armies and went to this country's rulers to punish them, and we, our retinues, immeasurable and limitless hundreds of thousands of ghost spirits, concealed themselves from their forms as guardians.",
        "source": "T16n0664_005:0382c16_9"
    },
    {
        "source_sentence": "令彼怨敵自然退散，起諸怖懼、種種留難。",
        "translation": "They cause their enemies to naturally retreat, give rise to fears and various hindrances.",
        "source": "T16n0664_005:0382c19_10"
    },
    {
        "source_sentence": "彼國兵眾尚不能到，況復當能有所破壞？」",
        "translation": "That country's army won't be able to reach them, so how could they do anything to harm them?",
        "source": "T16n0664_005:0382c20_11"
    },
    {
        "source_sentence": "爾時，佛讚四天王等：「善哉，善哉！",
        "translation": "At that point, the Buddha praised the four celestial kings and others, Good, good!",
        "source": "T16n0664_005:0382c22_0"
    },
    {
        "source_sentence": "汝等四王乃能擁護我百千億那由他劫所可修習阿耨多羅三藐三菩提，及諸人王、受持是經、恭敬供養者為消衰患，",
        "translation": "You four kings will be able to protect me for a hundred thousand myriads of koṭis of nayutas of kalpas, so that I can cultivate highest, complete enlightenment. The kings of the people who preserve this sutra and venerate and make offerings to it will eliminate their debilitating tendencies.",
        "source": "T16n0664_005:0382c22_1"
    },
    {
        "source_sentence": "令其安樂；",
        "translation": "I cause them to be at ease.",
        "source": "T16n0664_005:0382c25_2"
    },
    {
        "source_sentence": "復能擁護宮殿、舍宅、城邑、村落、國土、邊疆，乃至怨賊悉令退散，",
        "translation": "They can also protect palaces, houses, cities, villages, kingdoms, borderlands, and even enemies from being driven away.",
        "source": "T16n0664_005:0382c25_3"
    },
    {
        "source_sentence": "滅其衰惱，令得安隱；",
        "translation": "They annihilate their afflictions and distress, enabling them to attain peace.",
        "source": "T16n0664_005:0382c27_4"
    },
    {
        "source_sentence": "亦令一切閻浮提內所有諸王無諸凶衰、鬪訟之事。",
        "translation": "It will also cause all the kings in Jambudvfpa to be free of bad and evil, as well as from fighting and quarreling.",
        "source": "T16n0664_005:0382c27_5"
    },
    {
        "source_sentence": "「四王當知，此閻浮提八萬四千城邑聚落，八萬四千諸人王等，各於其國娛樂快樂，",
        "translation": "You should know that in Jambudvfpa there are eighty-four thousand cities, towns, villages, and the kingdoms of eighty-four thousand people, each enjoying their respective countries.",
        "source": "T16n0664_005:0382c28_6"
    },
    {
        "source_sentence": "各各於國而得自在，於自所有錢財珍寶各各自足不相侵奪，如其宿世所修習業隨業受報，",
        "translation": "Each gained sovereignty over his own country, and each didn't steal the money, possessions, or treasures he owned, just as he had cultivated in past lives to receive their rewards according to their actions.",
        "source": "T16n0664_005:0383a01_7"
    },
    {
        "source_sentence": "不生惡心貪求他國，各各自生利益之心、生於慈心、安樂之心、不諍訟心、不破壞心、無繫縛心、無楚撻心，",
        "translation": "They do not give rise to bad thoughts and covetousness toward other countries. Each of them gives rise to thoughts of benefit, kindness, happiness, non- quarreling, non-violence, non-binding, and non-infliction.",
        "source": "T16n0664_005:0383a03_8"
    },
    {
        "source_sentence": "各於其上自生歡樂，上下和穆猶如水乳，心相愛念增諸善根。",
        "translation": "Each gives rise to its own happiness above them, and the superior and inferior are as peaceful as water and milk, while their minds love each other and increase their good roots.",
        "source": "T16n0664_005:0383a06_9"
    },
    {
        "source_sentence": "以是因緣故，此閻浮提安隱豐樂，人民熾盛，大地沃壤，陰陽調和，時不越序，",
        "translation": "Because of these causes and conditions, this Jambudvfpa is peaceful and prosperous. The people are dense and the land is fertile; the yin and yang are harmonious and the seasons are not uncomfortable.",
        "source": "T16n0664_005:0383a07_10"
    },
    {
        "source_sentence": "日、月、星宿不失常度，風雨隨時，無諸災橫，人民豐溢，自足於財，",
        "translation": "The sun, the moon, and the constellations do not lose their regular movements. There is no danger of wind or rain at any time and all kinds of calamities are avoided. The people are abundant and self-sufficient in means.",
        "source": "T16n0664_005:0383a09_11"
    },
    {
        "source_sentence": "心無貪悋亦無嫉妬，等行十善，其人壽終多生天上天宮，充滿增益天眾。",
        "translation": "With a mind free of greed and anger and no jealousy, they perform the ten good deeds equally, and at the end of their life, they'll often be born in the celestial palace up in heaven, filling it with an increasing number of celestial crowd.",
        "source": "T16n0664_005:0383a10_12"
    },
    {
        "source_sentence": "「若未來世有諸人王聽是經典，及供養、恭敬、受持是經四部之眾，是王則為安樂利益汝等四王及餘眷屬、無量百千諸鬼神等。",
        "translation": "“If there will be people in the future who listen to this sūtra and make offerings, venerate it, and receive and uphold it from the four groups of people, that king will bring peace and comfort to you four kings, their other retinues, measureless hundreds of thousands of ghosts and spirits.",
        "source": "T16n0664_005:0383a12_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0664_005:0383a15_14"
    },
    {
        "source_sentence": "汝等四王若得時時聞是經典，則為已得正法之水服甘露味，增益身力、心進勇銳、具諸威德。",
        "translation": "If you four kings hear this sūtra from time to time when they obtain it, then they'll attain the ambrosia of the water of the right teaching and increase their physical strength, mental effort, courage, and authoritativeness.",
        "source": "T16n0664_005:0383a15_15"
    },
    {
        "source_sentence": "是諸人王若能至心聽受是典，則為已能供養於我；",
        "translation": "If these kings of men could wholeheartedly listen to and accept this scripture, they would have already been able to make offerings to me.",
        "source": "T16n0664_005:0383a17_16"
    },
    {
        "source_sentence": "若供養我，則是供養過去、未來、現在諸佛；",
        "translation": "If someone makes offerings to me, they are also making offerings to the buddhas of the past, future, and present.",
        "source": "T16n0664_005:0383a18_17"
    },
    {
        "source_sentence": "若能供養過去、未來、現在諸佛，則得無量不可思議功德之聚。",
        "translation": "If someone can make offerings to the buddhas of the past, future, and present, they'll attain an incalculable stock of inconceivable merit.",
        "source": "T16n0664_005:0383a19_18"
    },
    {
        "source_sentence": "以是因緣，是諸人王應得擁護，及后妃、婇女、中宮眷屬、諸王子等亦應得護，",
        "translation": "Because of this cause and condition, these people should be protected by kings, queens, court ladies, middle palace attendants, princes, and so forth.",
        "source": "T16n0664_005:0383a21_19"
    },
    {
        "source_sentence": "衰惱消滅、快樂熾盛；",
        "translation": "Their declining afflictions are extinguished, and their bliss prevailing.",
        "source": "T16n0664_005:0383a22_20"
    },
    {
        "source_sentence": "宮殿堂宇安隱清淨，無諸災變，護宅之神增長威德，亦受無量歡悅快樂；",
        "translation": "The palace and halls were peaceful and pure, without any calamity or disturbance. The guardian goddess of the house grew in power and also experienced immeasurable joy and happiness.",
        "source": "T16n0664_005:0383a23_21"
    },
    {
        "source_sentence": "是諸國土所有人民悉受種種五欲之樂，一切惡事悉皆消滅。」",
        "translation": "All the people in these lands will experience the pleasures of the various five desires, and all bad things will cease.",
        "source": "T16n0664_005:0383a24_22"
    },
    {
        "source_sentence": "爾時，四天王白佛言：「世尊！",
        "translation": "It was then that the four celestial kings said to the Buddha, Bhagavān!",
        "source": "T16n0664_005:0383a27_0"
    },
    {
        "source_sentence": "未來之世若有人王欲得護身，及后妃、婇女、諸王子等、宮殿屋宅得第一護身所、王領最為殊勝、具不可思議王者功德、欲得攝取無量福聚、國土無有他方怨賊、無諸憂惱及諸苦事。",
        "translation": "In a future life, if someone wants to protect their body, the queen, consorts, women, princes, palaces, and houses will be the first to protect it, the king's ruler will be the most distinguished, possess the merit of inconceivable kingship, want to gather an immeasurable stock of merit, have no other-sided enemies",
        "source": "T16n0664_005:0383a27_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0383b02_2"
    },
    {
        "source_sentence": "如是人王不應放逸散亂其心，應生恭敬謙下之心，應當莊嚴第一微妙最勝宮宅，",
        "translation": "Thus, the king of men should not be careless and distracted in his mind; they should give rise to reverence and humility. They should adorn the most sublime and supremely beautiful palace.",
        "source": "T16n0664_005:0383b02_3"
    },
    {
        "source_sentence": "種種香汁持用灑地，散種種華敷大法座師子之座，兼以無量珍琦異物而為絞飾，",
        "translation": "He sprinkled the earth with various kinds of fragrant juice and spread out a great lion seat of the Teaching, adorned it with countless rare and exquisite jewels.",
        "source": "T16n0664_005:0383b04_4"
    },
    {
        "source_sentence": "張施種種無數微妙幢幡、寶蓋。",
        "translation": "They spread various kinds of innumerable subtle banners, streamers, and jeweled canopies.",
        "source": "T16n0664_005:0383b06_5"
    },
    {
        "source_sentence": "當淨洗浴，以香塗身，著好淨衣，瓔珞自嚴，坐小卑座，不自高大，除去自在，",
        "translation": "You should wash and bathe yourself cleanly, rub your body with scented oil, don fine and pure clothing, adorn yourself with jewelry, sit on a low seat that’s neither high nor low, and remove any controlling influence.",
        "source": "T16n0664_005:0383b07_6"
    },
    {
        "source_sentence": "離諸放逸，謙下自卑，除去憍慢，正念聽受如是妙典，於說法者生世尊想。",
        "translation": "Being free of carelessness, humble and self-conceited, he removes arrogance and conceit, listens with right mindfulness to such wonderful scriptures, and gives rise to the perception of the Bhagavān among those who teach them.",
        "source": "T16n0664_005:0383b09_0"
    },
    {
        "source_sentence": "復於宮內后妃、王子、婇女、眷屬生慈哀心，和顏與語，勸以種種供養之具供養法師。",
        "translation": "Again, the queen, princes, court ladies, and their retinues inside the palace became compassionate, spoke with a peaceful countenance, encouraged various kinds of offerings, and offered them to the Master.",
        "source": "T16n0664_005:0383b10_1"
    },
    {
        "source_sentence": "是王爾時既勸化已，即生無量歡喜快樂，心懷悅豫，倍復自勵，不生疲惓，",
        "translation": "At that moment, having been encouraged and inspired, the king felt infinitely joyful and happy. His heart was overjoyed; he doubled his efforts and did not feel weary or exhausted.",
        "source": "T16n0664_005:0383b12_2"
    },
    {
        "source_sentence": "多作利益，於說法者倍生恭敬。」",
        "translation": "They often work for the benefit of those who teach the Dharma, and they'll be doubly honored by those who teach it.",
        "source": "T16n0664_005:0383b14_3"
    },
    {
        "source_sentence": "爾時，佛告四天大王：「爾時，人王應著白淨鮮潔之衣，種種瓔珞齊整莊嚴，",
        "translation": "It was then that the Buddha addressed the great kings of the four celestial kings: At that time, the human king should wear white, pure, and clean robes adorned with various jewelry.",
        "source": "T16n0664_005:0383b15_0"
    },
    {
        "source_sentence": "執持素帛微妙上蓋，服飾容儀不失常則，躬出奉迎說法之人。",
        "translation": "He held a subtle canopy of plain silk and fine silk, adorned himself in the usual manner. He came out in person to greet those who preached the Dharma.",
        "source": "T16n0664_005:0383b16_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0664_005:0383b18_2"
    },
    {
        "source_sentence": "是王如是，隨其舉足步步之中即是供養值遇百千億那由他諸佛世尊，復得超越如是等劫生死之難，",
        "translation": "In this way, the king was able to go beyond the difficulty of transmigration in birth and death for as many eons as there were.",
        "source": "T16n0664_005:0383b18_3"
    },
    {
        "source_sentence": "復於來世爾所劫中常得封受轉輪王位。",
        "translation": "In the future, he'll always be enthroned in the position of wheel-turning king during such an eon.",
        "source": "T16n0664_005:0383b20_4"
    },
    {
        "source_sentence": "隨其步步亦得如是現世功德：不可思議自在之力，常得最勝極妙七寶人天宮殿，",
        "translation": "Each step also attains such worldly merits as these: By the power of inconceivable freedom they always attain the most excellent and most marvelous seven-jeweled palace of humans and gods.",
        "source": "T16n0664_005:0383b21_5"
    },
    {
        "source_sentence": "在在生處增益壽命，言語辯了，人所信用，無所畏忌，有大名稱，常為人天之所恭敬，",
        "translation": "Wherever they are born, their life span increases. They speak eloquently and eloquently; they are trusted by people without fear or trepidation. They have great reputation and are always revered by humans and gods.",
        "source": "T16n0664_005:0383b23_6"
    },
    {
        "source_sentence": "天上人中受上妙樂，得大勢力，具足威德，身色微妙，端嚴第一，常值諸佛，",
        "translation": "Among the gods and humans, they experience the most sublime bliss. They attain great power and are endowed with majestic virtue. Their bodies are subtle in color and adorned with the utmost dignity.",
        "source": "T16n0664_005:0383b25_7"
    },
    {
        "source_sentence": "遇善知識，成就具足無量福聚。",
        "translation": "When they meet a good teacher, they'll be replete with an immeasurable stock of merit.",
        "source": "T16n0664_005:0383b26_8"
    },
    {
        "source_sentence": "「汝等四天王！",
        "translation": "You four celestial kings!",
        "source": "T16n0664_005:0383b27_9"
    },
    {
        "source_sentence": "如是，人王見如是等種種無量功德利益，是故此王應當躬出奉迎法師，",
        "translation": "Thus, the king of men sees such various kinds of immeasurable merits and benefits. Therefore, this king should go out in person to greet the Master.",
        "source": "T16n0664_005:0383b27_10"
    },
    {
        "source_sentence": "若一由旬至百千由旬。",
        "translation": "It goes from one yojana to a hundred thousand yojanas.",
        "source": "T16n0664_005:0383b29_11"
    },
    {
        "source_sentence": "於說法師應生佛想，應作是念：『今日釋迦如來正智入於我宮受我供養、為我說法，",
        "translation": "You should think of the Dharma preacher as a buddha, thinking: Today the Tathāgata Sugandhakūṭa entered my palace to receive my offerings and taught me the Dharma.",
        "source": "T16n0664_005:0383c01_0"
    },
    {
        "source_sentence": "我聞是法即不退轉於阿耨多羅三藐三菩提，已為得值百千萬億那由他佛、為已供養過去未來現在諸佛、已得畢竟三惡道苦，",
        "translation": "Having heard this teaching, I do not turn away from the supreme perfect enlightenment. In order to meet hundreds of thousands of myriads of koṭis of nayutas of buddhas, in order to honor those buddhas of past, future, and present, and in order to end the suffering of the three evil destinies,",
        "source": "T16n0664_005:0383c02_1"
    },
    {
        "source_sentence": "我今已種百千無量轉輪聖王釋梵之因、已種無邊善根種子、已令無量百千萬億諸眾生等度於生死、已集無量無邊福聚，",
        "translation": "I have planted the seeds of boundless roots of goodness; I have caused countless millions of sentient beings to be liberated equally from birth and death. I have accumulated an immeasurable store of merit.",
        "source": "T16n0664_005:0383c05_2"
    },
    {
        "source_sentence": "後宮眷屬已得擁護宮宅、諸衰悉以消滅，國土無有怨賊棘刺、他方怨敵不能侵凌。』",
        "translation": "The latter palace's retinues have been able to embrace the palace and all the afflictions will be extinguished, so that there won't be any enemies or thieves in the land and no enemies from other sides who can attack it.'",
        "source": "T16n0664_005:0383c08_3"
    },
    {
        "source_sentence": "「汝等四王！",
        "translation": "You four kings!",
        "source": "T16n0664_005:0383c10_4"
    },
    {
        "source_sentence": "如是，人王應作如是供養正法，清淨聽受是妙經典，及恭敬、供養、尊重、讚嘆。",
        "translation": "Thus, the king of humans should thus make offerings to the right teaching, purely listening and accepting this wonderful sūtra with respect, offering support, reverence, veneration, and praise.",
        "source": "T16n0664_005:0383c10_5"
    },
    {
        "source_sentence": "持是經典四部之眾，亦當迴此所得最勝功德之分，施與汝等及餘眷屬、諸天、鬼神，",
        "translation": "To the fourfold assembly of those who preserve this scripture, you should also return to them the portion of their most excellent merit that you have gained and give it to you and your other followers, gods, ghosts, and spirits.",
        "source": "T16n0664_005:0383c12_6"
    },
    {
        "source_sentence": "聚集如是諸善功德，現世常得無量無邊、不可思議自在之利，威德、勢力、成就具足，",
        "translation": "Gathering together such good qualities, they always attain immeasurable, limitless, and inconceivable unimpeded benefits in the present life, endowed with authoritative virtue, power, and accomplishment.",
        "source": "T16n0664_005:0383c14_7"
    },
    {
        "source_sentence": "能以正法摧伏諸惡。」",
        "translation": "They can use the right teaching to subdue evil.",
        "source": "T16n0664_005:0383c16_8"
    },
    {
        "source_sentence": "爾時，四王白佛言：「世尊！",
        "translation": "It was then that the four kings said to the Buddha, Bhagavān!",
        "source": "T16n0664_005:0383c17_0"
    },
    {
        "source_sentence": "若未來世有諸人王作如是等恭敬正法，至心聽受是妙經典，及恭敬、供養、尊重、讚嘆，",
        "translation": "If there will be people in the future who honor and venerate the true teaching like this, wholeheartedly listen to these wonderful scriptures with respect, offerings, reverence, veneration, and praise.",
        "source": "T16n0664_005:0383c17_1"
    },
    {
        "source_sentence": "持是經典四部之眾嚴治舍宅、香汁灑地、專心正念聽說法時，我等四王亦當在中共聽此法，",
        "translation": "When the fourfold assembly of those who preserve this scripture adorned their houses, sprinkled scented juice on the earth, and listened to the Dharma with concentration and mindfulness, we four kings will also be there to hear it.",
        "source": "T16n0664_005:0383c19_2"
    },
    {
        "source_sentence": "願諸人王為自利故，以己所得功德少分施與我等。",
        "translation": "May the king of men give us a small portion of the merit they've gained for their own benefit.",
        "source": "T16n0664_005:0383c21_3"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0383c22_4"
    },
    {
        "source_sentence": "是諸人王於說法者所坐之處，為我等故燒種種香供養是經，是妙香氣於一念頃即至我等諸天宮殿，",
        "translation": "\\",
        "source": "T16n0664_005:0383c22_5"
    },
    {
        "source_sentence": "其香即時變成香蓋，其香微妙，金色晃耀照我等宮、釋宮、梵宮。",
        "translation": "That fragrance immediately became a canopy of fragrance, and its fragrance was subtle and golden-colored, shining brightly to illuminate our palaces, the palaces of the Śākyas, and the Brahmā palaces.",
        "source": "T16n0664_005:0383c25_6"
    },
    {
        "source_sentence": "大辯神天、功德神天、堅牢地神、散脂鬼神最大將軍二十八部鬼神大將，",
        "translation": "The great eloquence deities, the virtuous deities, the earth spirits, the firm ground spirits, and the fat-scattered spirits are the greatest generals of the twenty-eight demon generals.",
        "source": "T16n0664_005:0383c26_7"
    },
    {
        "source_sentence": "摩醯首羅、金剛密迹、摩尼跋陀鬼神大將、鬼子母與五百兒子周匝圍遶、阿耨達龍王、娑竭羅龍王，",
        "translation": "They were surrounded by the great generals Mahêśvara, the vajra-mysterious traces, Maṇibhadra, the great generals of ghosts and spirits, the mothers of ghosts, their five hundred sons, the nāga kings Anavatapta and Sāgara.",
        "source": "T16n0664_005:0383c28_8"
    },
    {
        "source_sentence": "如是等眾自於宮殿，各各得聞是妙香氣及見香蓋光明普照，是香蓋光明亦照一切諸天宮殿。」",
        "translation": "Each of these people in the palace heard this wonderful fragrance and saw the light from the canopy of fragrance shining everywhere, and this light from the canopy of fragrance also shone on all the palaces of the gods.",
        "source": "T16n0664_005:0384a01_9"
    },
    {
        "source_sentence": "佛告四王：「是香蓋光明非但至汝四王宮殿。",
        "translation": "The Buddha told the four kings, This fragrant canopy of light doesn't just reach your four kings' palace halls.",
        "source": "T16n0664_005:0384a03_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0664_005:0384a04_11"
    },
    {
        "source_sentence": "是諸人王手擎香鑪供養經時，其香遍布，於一念頃遍至三千大千世界百億日月、百億大海、百億須彌山、百億大鐵圍山、小鐵圍山及諸山王、百億四天下、百億四天王、百億三十三天，",
        "translation": "When these human kings held the incense burners in their hands and offered them as offerings to the scriptures, the fragrance pervaded throughout the ten billion suns and moons of the 3,000 great one-thousand worlds, the ten billion oceans, the ten billion Sumeru mountains, the ten billion large iron mountains, the small iron mountains, the kings",
        "source": "T16n0664_005:0384a04_12"
    },
    {
        "source_sentence": "乃至百億非想非非想天。",
        "translation": "It's up to ten billion non-thought and non-non-thought heavens.",
        "source": "T16n0664_005:0384a09_13"
    },
    {
        "source_sentence": "於此三千大千世界百億三十三天、一切龍、鬼、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽宮殿，",
        "translation": "In the great manifold cosmos consisting of a billion universes, all the thirty-three celestial kingdoms, nagas, ghosts, nāgas, gandharvas, asuras, garuḍas, kinnaras, and mahoragas resided in these buddha-fields.",
        "source": "T16n0664_005:0384a09_14"
    },
    {
        "source_sentence": "虛空悉滿種種香煙雲蓋，其蓋金光亦照宮殿。",
        "translation": "The sky was filled with clouds of various kinds of fragrant smoke, and the golden light from those clouds illuminated the palace as well.",
        "source": "T16n0664_005:0384a11_15"
    },
    {
        "source_sentence": "如是，三千大千世界所有種種香煙雲蓋，皆是此經威神力故。",
        "translation": "Thus, the various kinds of fragrant clouds and canopies in the 3,000 great one-thousand worlds are all due to the authoritative power of this sūtra.",
        "source": "T16n0664_005:0384a12_16"
    },
    {
        "source_sentence": "「是諸人王手擎香鑪供養經時，種種香氣不但遍此三千大千世界，於一念頃亦遍十方無量無邊恒河沙等百千萬億諸佛世界，",
        "translation": "“When these human kings held incense and offered offerings to the Buddha, various fragrances pervaded not only this billion-world universe but also hundreds of thousands of myriads of koṭis of buddha worlds as numerous as the sands of infinite Ganges Rivers in the ten directions in an instant.",
        "source": "T16n0664_005:0384a14_17"
    },
    {
        "source_sentence": "於諸佛上虛空之中亦成香蓋，金色普照亦復如是。",
        "translation": "In the sky above the buddhas, they also form fragrant canopies, and so does their golden-colored universal illumination likewise.",
        "source": "T16n0664_005:0384a17_18"
    },
    {
        "source_sentence": "諸佛世尊聞是妙香、見是香蓋及金色光，於十方界恒河沙等諸佛世尊作如是等神力變化已，",
        "translation": "“Furthermore, the buddhas and world-honored ones who had heard this wonderful fragrance, smelled this canopy of fragrance, and perceived this golden light produced such miraculous transformations in the buddhas and world-honored ones as numerous as the grains of sand in the Ganges River in the ten directions.",
        "source": "T16n0664_005:0384a18_19"
    },
    {
        "source_sentence": "異口同音於說法者稱讚：『善哉，善哉！",
        "translation": "They spoke with one voice and praised the Dharma preacher, saying, 'Good, good!'",
        "source": "T16n0664_005:0384a20_20"
    },
    {
        "source_sentence": "大士！",
        "translation": "Great man!",
        "source": "T16n0664_005:0384a21_21"
    },
    {
        "source_sentence": "汝能廣宣流布如是甚深微妙經典，則為成就無量無邊、不可思議功德之聚。』",
        "translation": "If you can widely proclaim and disseminate such a profound and subtle scripture, then you'll accomplish an immeasurable, limitless, and inconceivable stock of merit.'",
        "source": "T16n0664_005:0384a21_22"
    },
    {
        "source_sentence": "若有聞是甚深經典，所得功德則為不少，況持讀誦、為他眾生開示、分別演說其義？",
        "translation": "If someone hears this profound sūtra, they'll attain great merit, so why wouldn't they retain it, recite it, teach it to other sentient beings, and explain its meaning in detail?",
        "source": "T16n0664_005:0384a23_23"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0664_005:0384a25_24"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0664_005:0384a25_25"
    },
    {
        "source_sentence": "此金光明微妙經典，無量無邊億那由他諸菩薩等若得聞者，即不退轉於阿耨多羅三藐三菩提。",
        "translation": "This subtle scripture of golden light is immeasurable and limitless, and if there are billions of bodhisattvas who hear it, they won't regress from unsurpassed, correct, or complete enlightenment.",
        "source": "T16n0664_005:0384a25_26"
    },
    {
        "source_sentence": "爾時，十方無量無邊恒河沙等諸佛世界現在諸佛，異口同聲作如是言：『善男子！",
        "translation": "At the time, measureless and limitless buddha-lands as numerous as the number of grains of sand in the Ganges River in the ten directions were present, and the present buddhas spoke with one voice and said, 'Good sons!",
        "source": "T16n0664_005:0384a27_27"
    },
    {
        "source_sentence": "汝於來世畢定當得坐於道場菩提樹下，於三界中最尊最勝，出過一切眾生之上，",
        "translation": "In the future you will surely be able to sit on the seat of enlightenment under the tree of enlightenment. You will be the most honorable and supreme among all beings in the world, surpassing all living beings.",
        "source": "T16n0664_005:0384a29_28"
    },
    {
        "source_sentence": "勤修力故受諸苦行，善能莊嚴菩提道場，能壞三千大千世界外道邪論，",
        "translation": "Because of the power of diligent cultivation they undergo various ascetic practices. They are able to skillfully adorn the terraces of enlightenment and can destroy the theories of non-Buddhist doctrines in a thousand great manifold worlds.",
        "source": "T16n0664_005:0384b02_29"
    },
    {
        "source_sentence": "摧伏諸魔、怨賊、異形，覺了諸法第一寂滅，清淨無垢甚深無上菩提之道。",
        "translation": "He subdues Māra, enemies, thieves, and different forms, perceives the first extinction of all dharmas, purifies and stains them, and follows the profound path of unsurpassed enlightenment.",
        "source": "T16n0664_005:0384b04_30"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T16n0664_005:0384b05_31"
    },
    {
        "source_sentence": "汝已能坐金剛座處、轉於無上諸佛所讚十二種行甚深法輪、能擊無上最大法鼓、能吹無上極妙法蠡、能竪無上最勝法幢、能然無上極明法炬、能雨無上甘露法雨、能斷無量煩惱怨結、能令無量百千萬億那由他眾度於無涯可畏大海、能脫生死無際輪轉、復遇無量百千萬億那由他佛。』」",
        "translation": "You've been able to sit on the adamantine throne, turn the profound Dharma wheel of 12 kinds of practice praised by the unsurpassed buddhas, beat the unsurpassed greatest dharma drum, blow the unsurpassed most marvelous dharma li, see the unsurpassed most excellent dharma banner, cause the unsurpassed torch of the supremely luminous dharma",
        "source": "T16n0664_005:0384b06_0"
    },
    {
        "source_sentence": "爾時，四天王復白佛言：「世尊！",
        "translation": "At that point, the four celestial kings again said to the Buddha, Bhagavān!",
        "source": "T16n0664_005:0384b13_0"
    },
    {
        "source_sentence": "是金光明微妙經典能得未來現在種種無量功德。",
        "translation": "This subtle scripture of golden light can attain various measureless merits in the future and present.",
        "source": "T16n0664_005:0384b13_1"
    },
    {
        "source_sentence": "是故，人王若得聞是微妙經典，則為已於百千萬億無量佛所種諸善根。",
        "translation": "Therefore, if the king of humans hears this subtle sūtra, they'll have planted good roots in hundreds of thousands of myriads of koṭis of measureless buddhas.",
        "source": "T16n0664_005:0384b14_2"
    },
    {
        "source_sentence": "我以敬念是人王故、復見無量福德利故，我等四王及餘眷屬、無量百千萬億鬼神，",
        "translation": "Because of respecting this human king and seeing his immeasurable merits and benefits, we four kings and the rest of their retinues, as well as immeasurable hundreds of thousands of myriads of koṭis of ghosts and spirits,",
        "source": "T16n0664_005:0384b16_3"
    },
    {
        "source_sentence": "於自宮殿見是種種香煙雲蓋瑞應之時，我當隱蔽不現其身，為聽法故，",
        "translation": "In my own palace I see various kinds of fragrant smoke, clouds, canopies, and miraculous signs like these. As soon as they appear, I will hide myself from the sight of them in order to listen to the Dharma.",
        "source": "T16n0664_005:0384b18_4"
    },
    {
        "source_sentence": "當至是王所止宮殿講法之處；",
        "translation": "You should go to this palace where the king is staying and preach the Dharma.",
        "source": "T16n0664_005:0384b19_5"
    },
    {
        "source_sentence": "大梵天王、釋提桓因、大辯天神、功德天神、堅牢地神、散脂鬼神大將軍等二十八部鬼神大將，",
        "translation": "Mahābrahmā, Śakra Devānām-Indra, Mahāprajāpaṇadeva, Mahāprajāpaṇadeva, Mahāprajāpaṇadeva, Mahāprajāpaṇadeva, Mahāprajāpaṇadeva, Mahāprajāpaṇadeva, Mahāprajāpaṇadeva, Mahāprajāpaṇadeva, Mahāprajāpaṇadeva",
        "source": "T16n0664_005:0384b20_6"
    },
    {
        "source_sentence": "摩醯首羅、金剛密迹、摩尼跋陀鬼神大將、鬼子母及五百鬼子周匝圍遶、阿耨達龍王、娑竭羅龍王，",
        "translation": "Mahêśvara, the mysterious traces of the vajra, the great general of the maṇibhadra demons, the mother of the demons, and the five hundred demons surrounded by them, the dragon king Anavatapta and the dragon king Sāgara.",
        "source": "T16n0664_005:0384b22_7"
    },
    {
        "source_sentence": "無量百千萬億那由他鬼神、諸天，如是等眾為聽法故，悉自隱蔽不現其身，",
        "translation": "Innumerable hundreds of thousands of myriadstical koṭis of nayutas of such spirits and celestial beings, for the sake of listening to the Dharma, all concealed themselves and did not show their bodies.",
        "source": "T16n0664_005:0384b25_0"
    },
    {
        "source_sentence": "至是人王所止宮殿講法之處。",
        "translation": "He went to the palace where the human king was staying and taught the Dharma.",
        "source": "T16n0664_005:0384b26_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0384b27_2"
    },
    {
        "source_sentence": "我等四王及餘眷屬、無量鬼神，悉當同心以是人王為善知識，同共一行——善相應行——能為無上大法施主，",
        "translation": "We four kings and the other members of their retinues, as well as innumerable ghosts and spirits, should all think with one mind that human king is a good friend to you. Together we should undertake the same practice-that is, performing good deeds conjoined with virtue-to be the bestower of the unexcelled great benefactorial",
        "source": "T16n0664_005:0384b27_3"
    },
    {
        "source_sentence": "以甘露味充足我等。",
        "translation": "It's because the taste of ambrosia fills us up.",
        "source": "T16n0664_005:0384b29_4"
    },
    {
        "source_sentence": "我等應當擁護是王，除其衰患，令得安隱，及其宮宅、國土、城邑諸惡災患悉令消滅。",
        "translation": "We should protect this king and rid him of his misfortune, enabling him to attain peace. And all the bad calamities that afflicted his palaces, lands, and cities will be extinguished.",
        "source": "T16n0664_005:0384c01_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0384c03_6"
    },
    {
        "source_sentence": "若有人王於此經典心生捨離、不樂聽聞，其心不欲恭敬、供養、尊重、讚嘆；",
        "translation": "Suppose there is a man king who, thinking of this scripture, feels indifference toward it and does not wish to hear it. His mind has no desire to venerate, offer support, revere, or praise it.",
        "source": "T16n0664_005:0384c03_7"
    },
    {
        "source_sentence": "若四部眾有受持、讀誦、讚說之者，亦復不能恭敬、供養、尊重、讚嘆；",
        "translation": "If the fourfold assembly were to preserve, recite, and praise it, they also would not venerate, offer support, honor, or praise it.",
        "source": "T16n0664_005:0384c05_0"
    },
    {
        "source_sentence": "我等四王及餘眷屬、無量鬼神，即便不得聞此正法，背甘露味、失大法利，",
        "translation": "We four kings and the other members of their retinues, as well as innumerable other deities and spirits, will not even be able to hear this true teaching. They will turn our backs on the taste of immortality and lose the great benefit of the Dharma.",
        "source": "T16n0664_005:0384c06_1"
    },
    {
        "source_sentence": "無有勢力及以威德，減損天眾、增長惡趣。",
        "translation": "There's no power or authoritativeness, which decreases the number of gods and increases bad destinies.",
        "source": "T16n0664_005:0384c08_2"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0384c09_3"
    },
    {
        "source_sentence": "我等四王及無量鬼神捨其國土；",
        "translation": "We four kings and the innumerable other spirits abandoned their lands.",
        "source": "T16n0664_005:0384c09_4"
    },
    {
        "source_sentence": "不但我等，亦有無量守護國土諸舊善神皆悉捨去。",
        "translation": "Not only did we, but there were countless other good deities who guarded the land and relinquished all of them.",
        "source": "T16n0664_005:0384c09_5"
    },
    {
        "source_sentence": "我等諸天及諸鬼神既捨離已，其國當有種種災異，一切人民失其善心，",
        "translation": "When we gods and other spirits have abandoned it, that kingdom will experience various calamities and all the people will lose their good intentions.",
        "source": "T16n0664_005:0384c11_6"
    },
    {
        "source_sentence": "唯有繫縛、瞋恚、鬪諍、互相破壞、多諸疾疫、彗星現怪、流星崩落、五星諸宿違失常度、兩日並現、日月薄蝕、白黑惡虹數數出現、大地震動發大音聲、惡風惡雨無日不有、穀米勇貴、飢饉凍餓、多有他方怨賊侵掠，",
        "translation": "Only fetters, anger, hatred, quarrels, fighting, mutual destruction, many epidemics, meteors appear and wonder, meteors rise up and fall down, the five planets and constellations diverge and change constantly, two suns occur simultaneously, the sun and moon are subtly eclipsed, black and white bad rainbows frequently appear, great earthquakes",
        "source": "T16n0664_005:0384c12_7"
    },
    {
        "source_sentence": "其國人民多受苦惱、其地無有可愛樂處。",
        "translation": "The people of that country are often subject to suffering and distress, and there's no pleasant place in their land.",
        "source": "T16n0664_005:0384c17_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0384c18_9"
    },
    {
        "source_sentence": "我等四王及諸無量百千鬼神并守國土諸舊善神遠離去時，生如是等無量惡事。",
        "translation": "When we four kings and measureless hundreds of thousands of myriadstical spirits, as well as the old good spirits who guarded our land and secluded themselves from it, did these innumerable bad things arise.",
        "source": "T16n0664_005:0384c18_10"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0384c20_11"
    },
    {
        "source_sentence": "若有人王欲得自護及王國土多受安樂、欲令國土一切眾生悉皆成就具足快樂、欲得摧伏一切外敵、欲得擁護一切國土、欲以正法正治國土、欲得除滅眾生怖畏，",
        "translation": "Suppose there's a person king who wants to attain self-protection and much peace in his kingdom's land, wants to cause all sentient beings in his land to become fully happy, wants to overcome all external enemies, wants to embrace all lands, wants to govern his land correctly with the right teaching, and wants to remove the fears of sentient beings.",
        "source": "T16n0664_005:0384c20_12"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0384c24_13"
    },
    {
        "source_sentence": "是人王等應當畢定聽是經典，及恭敬供養讀誦受持是經典者。",
        "translation": "These people, kings, and so forth, should listen to this sūtra with complete certainty, and they should venerate, offer support, recite, and retain it.",
        "source": "T16n0664_005:0384c24_14"
    },
    {
        "source_sentence": "我等四王及無量鬼神以是法食善根因緣，得服甘露無上法味，增長身力、心進勇銳、增益諸天。",
        "translation": "Because of these causes and conditions, we four kings and measureless ghosts and goddesses ate the good roots of the Dharma and were able to partake of the unsurpassed flavor of the ambrosia of the Dharma, which increased physical strength, mental vigor, courage, and renown among the gods.",
        "source": "T16n0664_005:0384c25_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0664_005:0384c28_16"
    },
    {
        "source_sentence": "以是人王至心聽受是經典故。",
        "translation": "It's because this person king wholeheartedly listens to and accepts this sūtra.",
        "source": "T16n0664_005:0384c28_17"
    },
    {
        "source_sentence": "「如諸梵天說出欲論、釋提桓因種種善論、五通之人神仙之論，世尊！",
        "translation": "Just as the Brahma gods explain the explanation of the theory of liberation from desire, the various good theories of Śakra Devānām-Indra and the theories of the five supernormal powers, Bhagavān!",
        "source": "T16n0664_005:0384c29_18"
    },
    {
        "source_sentence": "梵天、釋提桓因、五神通人雖有百千億那由他無量勝論，是金光明於中最勝。",
        "translation": "Although Brahmadeva, Śakra Devānām-Indra, and the five supernormal beings have hundreds of thousands of millions of nayutas with measureless superior theories, this golden light is the most superior among them.",
        "source": "T16n0664_005:0385a01_19"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T16n0664_005:0385a03_20"
    },
    {
        "source_sentence": "如來說是金光明經為眾生故，為令一切閻浮提內諸人王等以正法治、為與一切眾生安樂、為欲愛護一切眾生、欲令眾生無諸苦惱、無有他方怨賊棘刺、所有諸惡背而不向、欲令國土無有憂惱、以正法教無有諍訟。",
        "translation": "For the sake of sentient beings, the Tathāgata teaches this sūtra of golden light so that all the people and kings in Jambudvīpa will correctly rule it, give peace and comfort to all sentient beings, want to love and protect all sentient beings, want to cause sentient beings to have no suffering and distress, have no other enemies or thieves",
        "source": "T16n0664_005:0385a03_21"
    },
    {
        "source_sentence": "是故，人王各於國土應然法炬熾然正法，增益天眾。",
        "translation": "Because of this, the human kings in each land should have a torch of the Dharma and a torch of the right Dharma burning brightly in their countries, which will increase the number of gods.",
        "source": "T16n0664_005:0385a08_22"
    },
    {
        "source_sentence": "我等四王及無量鬼神、閻浮提內諸天善神，以是因緣得服甘露、法味充足、得大威德、進力具足；",
        "translation": "Because of these causes and conditions we four kings, as well as innumerable other spiritual beings and good spirits from the heavens within Jambudvfpa, were able to drink the ambrosia of immortality. The taste of the Dharma was plentiful, and they gained great preeminent power and empowerment.",
        "source": "T16n0664_005:0385a09_23"
    },
    {
        "source_sentence": "閻浮提內安隱豐樂，人民熾盛，安樂其處，復於來世無量百千不可思議那由他劫常受微妙第一快樂，",
        "translation": "In Jambudvfpa there will be peace and prosperity within, with plenty of living beings and abundantly productive people. Being well settled there, they’ll experience the subtle and supreme bliss for measureless hundreds of thousands of inconceivable millions of eons in the future.",
        "source": "T16n0664_005:0385a12_0"
    },
    {
        "source_sentence": "復得值遇無量諸佛種諸善根，然後證成阿耨多羅三藐三菩提。",
        "translation": "They'll also meet measureless buddhas who plant good roots and then realize unsurpassed, correct, and complete enlightenment.",
        "source": "T16n0664_005:0385a14_1"
    },
    {
        "source_sentence": "如是等無量功德，悉是如來正遍知說。",
        "translation": "Such immeasurable qualities as these are all taught by the Tathāgata, Perfectly Enlightened One.",
        "source": "T16n0664_005:0385a15_2"
    },
    {
        "source_sentence": "如來過於百千億那由他諸梵天等，以大悲力故；",
        "translation": "The Enlightened One surpassed hundreds of thousands of myriads of koṭis of nayutas of Brahmā gods by the power of great compassion.",
        "source": "T16n0664_005:0385a16_3"
    },
    {
        "source_sentence": "亦過無量百千億那由他釋提桓因，以苦行力故。",
        "translation": "It's also greater than measureless hundreds of thousands of millions of billions of nayutas of Śakra Devānām-Indra causes because of the power of ascetic practice.",
        "source": "T16n0664_005:0385a17_4"
    },
    {
        "source_sentence": "是故，如來為諸眾生演說如是金光明經。",
        "translation": "That's why the Tathāgata explains such a scripture of golden light for sentient beings.",
        "source": "T16n0664_005:0385a18_5"
    },
    {
        "source_sentence": "若閻浮提一切眾生及諸人王，世間、出世間所作國事、所造世論，皆因此經——欲令眾生得安樂故——釋迦如來示現是經廣宣流布。",
        "translation": "If all the sentient beings and human kings in Jambudvīpa, worldly and transmundane national affairs and worldly treatises that are created from this sūtra-because they want to cause sentient beings to attain well-being-the Tathāgata Śākyamuni shows them this sūtra and spreads it widely.",
        "source": "T16n0664_005:0385a19_6"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0664_005:0385a22_7"
    },
    {
        "source_sentence": "以是因緣故，是諸人王應當畢定聽受，供養、恭敬、尊重、讚嘆是經。」",
        "translation": "Because of these causes and conditions, the kings of people should listen to this sūtra with complete certainty, offer support, respect, venerate, honor, and praise it.",
        "source": "T16n0664_005:0385a22_8"
    },
    {
        "source_sentence": "爾時，佛復告四天王：「汝等四王及餘眷屬、無量百千那由他鬼神！",
        "translation": "It was then that the Buddha again addressed the four celestial kings, You four kings, your other retinues, and measureless hundreds of thousands of millions of nayutas of ghost spirits!",
        "source": "T16n0664_005:0385a25_0"
    },
    {
        "source_sentence": "是諸人王若能至心聽是經典，供養、恭敬、尊重、讚嘆，汝等四王正應擁護，",
        "translation": "If these kings of men were to wholeheartedly listen to this scripture and venerate, revere, honor, and praise it, you four kings would surely be able to shield them.",
        "source": "T16n0664_005:0385a26_1"
    },
    {
        "source_sentence": "滅其衰患而與安樂。",
        "translation": "He extinguishes their afflictions and brings them peace and happiness.",
        "source": "T16n0664_005:0385a28_2"
    },
    {
        "source_sentence": "若有人能廣宣流布如是妙典——於人天中大作佛事，能大利益無量眾生——如是之人汝等四王必當擁護，",
        "translation": "If someone can widely proclaim and disseminate such a wonderful scripture-who does great buddha-works among humans and gods and can greatly benefit measureless sentient beings-you four kings will surely protect such a person.",
        "source": "T16n0664_005:0385a28_3"
    },
    {
        "source_sentence": "莫令他緣而得擾亂，令心澹靜受於快樂，續復當得廣宣是經。」",
        "translation": "Don't cause others to become disturbed by conditions and make their minds calm and happy, and they'll continue to be able to extensively proclaim this sūtra.",
        "source": "T16n0664_005:0385b02_0"
    },
    {
        "source_sentence": "「佛月清淨，　　滿足莊嚴；　　佛日暉曜，",
        "translation": "The Buddha’s moon is pure and full of adornment; the Buddha’s sun shines brightly,",
        "source": "T16n0664_005:0385b03_1"
    },
    {
        "source_sentence": "　放千光明。　　如來面目，　　最上明淨。",
        "translation": "It emits a thousand rays of light; The Buddha’s face and eyes Are supremely clear and pure.",
        "source": "T16n0664_005:0385b03_1"
    },
    {
        "source_sentence": "　齒白無垢，　　如蓮華根；　　功德無量，",
        "translation": "Their teeth are white and spotless like the roots of a lotus flower, And their virtue immeasurable.",
        "source": "T16n0664_005:0385b03_1"
    },
    {
        "source_sentence": "　猶如大海；　　智淵無邊，　　法水具足，",
        "translation": "It’s like the great ocean, boundless is its depth of knowledge, Replete with the water of truth.",
        "source": "T16n0664_005:0385b03_1"
    },
    {
        "source_sentence": "　百千三昧，　　無有缺減；　　足下平滿，",
        "translation": "Hundreds of thousands of concentrations, without any diminution, are evenly spaced at the bottom of his feet.",
        "source": "T16n0664_005:0385b03_1"
    },
    {
        "source_sentence": "　千輻相現，　　足指網縵，　　猶如鵝王；",
        "translation": "A thousand spokes appear to each other, With webbed fingernails like a king of the geese.",
        "source": "T16n0664_005:0385b03_1"
    },
    {
        "source_sentence": "　光明晃曜，　　如寶山王；　　微妙清淨，",
        "translation": "The shining light shone brightly like a jeweled mountain king, Subtle and pure,",
        "source": "T16n0664_005:0385b03_1"
    },
    {
        "source_sentence": "　如鍊真金。　　所有福德，　　不可思議，",
        "translation": "They are like gold that has been refined, With inconceivable virtue.",
        "source": "T16n0664_005:0385b03_1"
    },
    {
        "source_sentence": "　佛功德山，　　我今敬禮。　　佛真法身，",
        "translation": "The Buddha is the mountain of virtue, And I now venerate him.",
        "source": "T16n0664_005:0385b03_1"
    },
    {
        "source_sentence": "　猶如虛空，　　應物現形，　　如水中月，",
        "translation": "It's like space, which responds to things and shows form like the moon in water.",
        "source": "T16n0664_005:0385b03_1"
    },
    {
        "source_sentence": "　無有障礙，　　如焰、如化。　　是故我今，",
        "translation": "They are unobstructed, Like flames and apparitions.",
        "source": "T16n0664_005:0385b03_1"
    },
    {
        "source_sentence": "爾時，四王即從坐起，偏袒右肩，右膝著地，長跪合掌於世尊前以偈讚曰：　稽首佛月。」",
        "translation": "At that point, the four kings rose from their seats, bared their right shoulders, knelt with their right knees on the ground, joined their palms together, and praised the Bhagavān in front of them in verse, prostrating themselves to the Buddha's moon.",
        "source": "T16n0664_005:0385b03_1"
    },
    {
        "source_sentence": "「此金光明，　　諸經之王，　　甚深最勝，",
        "translation": "“This golden light is the king of all scriptures, Most profound and supreme.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　為無有上。　　十力世尊，　　之所宣說，",
        "translation": "It is the supreme teaching of the ten powers, taught by the World-honored One.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　汝等四王，　　應當勤護。　　以是因緣，",
        "translation": "You four kings should diligently protect them. For this reason,",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　是深妙典，　　能與眾生，　　無量快樂。",
        "translation": "This profound and wonderful scripture Can give sentient beings Immeasurable happiness.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　為諸眾生，　　安樂利益，　　故久流布，",
        "translation": "For the sake of sentient beings’ well-being and benefit, it has been spread for a long time.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　於閻浮提。　　能滅三千，　　大千世界，",
        "translation": "In Jambudvfpa one can destroy three thousand great chiliocosms:",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　所有惡趣，　　無量諸苦。　　閻浮提內，",
        "translation": "All the evil destinies there are, With immeasurable pain and suffering.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　諸人王等，　　心生慈愍，　　正法治世。",
        "translation": "The human kings and so forth, with compassion in their hearts, correctly rule the world.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　若能流布，　　此妙經典，　　則令其土，",
        "translation": "If you can spread this wonderful scripture, You will cause all the people of that land To hear it.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　安隱豐熟，　　所有眾生，　　悉受快樂。",
        "translation": "Being peaceful and abundant, all sentient beings everywhere experience happiness.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　若有人王，　　欲愛己身、　　及其國土，",
        "translation": "Suppose there is a human king Who desires to love his own body And all the lands of others.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　欲令豐盛，　　應當至心，　　淨潔洗浴，",
        "translation": "If you want to make it abundant, You should wholeheartedly wash and bathe in cleanliness.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　往法會所，　　聽受是典。　　是經能作，",
        "translation": "They will go to the Dharma assembly To hear and accept this scripture, And they will be able to produce it.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　所有善事，　　摧伏一切，　　內外怨賊，",
        "translation": "All their good deeds Destroy all enemies and thieves, Both inside and out.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　復能除滅，　　無量怖畏。　　是諸經王，",
        "translation": "The kings of the scriptures are also able to extinguish Innumerable fears.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　能與一切，　　無量眾生，　　安隱快樂。",
        "translation": "He's able to share the peace and happiness of all boundless sentient beings.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　譬如寶樹，　　在人家中，　　悉能出生，",
        "translation": "It’s like a jeweled tree That grows in the house.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　一切珍寶；　　是妙經典，　　亦復如是，",
        "translation": "All the treasures and jewels of this wonderful scripture Are likewise.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　悉能出生，　　諸王功德。　　如清冷水，",
        "translation": "They are all capable of producing The virtues of the kings, Like clear and cool water.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　能除渴乏；　　是妙經典，　　亦復如是，",
        "translation": "It's able to remove hunger and thirst, and this wonderful sūtra is likewise.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　能除諸王，　　功德渴乏。　　譬如珍寶、",
        "translation": "It can remove the thirst for virtue of kings, like treasure and jewel.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　異物篋器，　　悉在于手，　　隨意所用；",
        "translation": "The different things and utensils are all in my hands, used as I wish.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　是金光明，　　亦復如是，　　隨意能與，",
        "translation": "This light of gold Is also like this: Give it as you wish.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　諸王法寶。　　是金光明，　　微妙經典，",
        "translation": "The kings’ treasure of the Dharma is this golden light, Sublime scripture.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　常為諸天，　　恭敬供養；　　亦為護世、",
        "translation": "He always honors and serves the gods, And also protects the world.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　四大天王，　　威神勢力，　　之所護持；",
        "translation": "The great deva kings of the four elements, Endowed with might and power, Preserve it.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　十方諸佛，　　常念是經，　　若有演說，",
        "translation": "The buddhas of the ten directions Will always remember this sutra. If they expound it,",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　稱讚善哉；　　亦有百千，　　無量鬼神，",
        "translation": "Praiseworthy! There are also hundreds of thousands Of immeasurable spirits,",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　從十方來，　　擁護是人。　　若有得聞，",
        "translation": "They come from the ten directions to protect these people. If any can hear them,",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　是妙經典，　　心生歡喜，　　踊躍無量。",
        "translation": "This is a wonderful scripture that gives rise to hearts of joy and dances immeasurably.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　閻浮提內，　　無量大眾，　　皆悉歡喜，",
        "translation": "In Jambudvfpa, there were boundless masses Who all rejoiced.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　集聽是法。　　聽是經故，　　具諸威德，",
        "translation": "He who collects and listens to these teachings Because he hears the scriptures, Is endowed with authoritative qualities.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "　增益天眾，　　精氣身力。」",
        "translation": "It increases the gods' energy and physical strength.",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "爾時，世尊以偈答曰：爾時，四王聞是偈已白佛言：「世尊！",
        "translation": "It was then that the Bhagavān answered in verse, After hearing this verse, the four kings said to the Buddha, Bhagavān!",
        "source": "T16n0664_005:0385b18_0"
    },
    {
        "source_sentence": "我從昔來未曾得聞如是微妙寂滅之法。",
        "translation": "I've never heard such a subtle and tranquil teaching since the distant past.",
        "source": "T16n0664_005:0385c23_1"
    },
    {
        "source_sentence": "我聞是已，心生悲喜、涕淚橫流、舉身戰動、支體嬉怡，復得無量不可思議具足妙樂。」",
        "translation": "When I hear this, my heart becomes sad and joyous, tears flow uncontrollably, my body trembles, and my limbs are playing with joy, and I'll again attain measureless and inconceivable marvelous bliss.",
        "source": "T16n0664_005:0385c24_2"
    },
    {
        "source_sentence": "以天曼陀羅華、摩訶曼陀羅華供養奉散於如來上，作如是等供養佛已，",
        "translation": "Having offered these kinds of offerings to the Buddha with celestial maṇḍala flowers and mahāmandārava flowers, he scattered them over the Tathāgata.",
        "source": "T16n0664_005:0385c26_3"
    },
    {
        "source_sentence": "復白佛言：「世尊！",
        "translation": "Again, he said to the Buddha, Bhagavān!",
        "source": "T16n0664_005:0385c28_4"
    },
    {
        "source_sentence": "我等四王各各自有五百鬼神，常當隨逐是說法者而為守護。」",
        "translation": "Each of us four kings has five hundred ghost spirits, and we'll always follow those who teach the Dharma and guard them.",
        "source": "T16n0664_005:0385c28_5"
    },
    {
        "source_sentence": "合部金光明經卷第五",
        "translation": "Jiangmuangming jing, vol. 5",
        "source": "T16n0664_005:0386a01_0"
    }
]