[
    {
        "source_sentence": "十二緣生祥瑞經卷上",
        "translation": "Sutra on the Auspicious Rui of the Arising of the Twelve Conditions, vol. 1",
        "source": "T16n0719_001:0845a03_0"
    },
    {
        "source_sentence": "西天譯經三藏朝散大夫試鴻臚",
        "translation": "Xitian zhuan jing sanzang朝散 dafu xi Hongun",
        "source": "T16n0719_001:0845a05_0"
    },
    {
        "source_sentence": "少卿傳法大師臣施護奉　詔譯",
        "translation": "Shaoqing zhuanfa daishi zhi shen hu Feng imperial edict translated",
        "source": "T16n0719_001:0845a06_0"
    },
    {
        "source_sentence": "如是我聞：一時世尊，在大眾中，結跏趺坐。",
        "translation": "Thus I have heard: One time, the Bhagavān was sitting cross-legged in the midst of the great assembly.",
        "source": "T16n0719_001:0845a07_0"
    },
    {
        "source_sentence": "「頂禮佛德海，　　真實正遍知，",
        "translation": "To pay homage to the ocean of buddha-qualities, The true and perfect enlightenment:",
        "source": "T16n0719_001:0845a07_1"
    },
    {
        "source_sentence": "　過去及未來，　　敷演緣生法。",
        "translation": "In the past and future, they'll expound the principle of conditioned arising.",
        "source": "T16n0719_001:0845a07_1"
    },
    {
        "source_sentence": "　世間虛妄見，　　顛倒苦沈淪，",
        "translation": "The world is a false view, Overturned by suffering and torpor.",
        "source": "T16n0719_001:0845a07_1"
    },
    {
        "source_sentence": "　煩惱業無邊，　　願佛為宣說。」",
        "translation": "The afflictions and karma have no limit, so may the Buddha explain it for them.",
        "source": "T16n0719_001:0845a07_1"
    },
    {
        "source_sentence": "時諸大眾，恭敬圍繞，瞻仰如來，即於佛前，而說頌曰：爾時眾會，無量百千，",
        "translation": "The great assembly was then surrounded with respect and veneration. Looking up at the Tathāgata, they stood before the Buddha and said these verses: At that time immeasurable hundreds of thousands of bodhisattvas were gathered together to worship him.",
        "source": "T16n0719_001:0845a07_1"
    },
    {
        "source_sentence": "若人若天，而白佛言：「今此大眾，及於未來，樂聞深法，唯願演說。」",
        "translation": "Whether it's humans or gods, they say to the Buddha, Now, this great assembly of people and future generations will delight in hearing the profound Dharma, so please explain it.",
        "source": "T16n0719_001:0845a14_2"
    },
    {
        "source_sentence": "爾時世尊告諸大眾：「善哉，善哉！",
        "translation": "It was then that the Bhagavān addressed the crowd, Good, good!",
        "source": "T16n0719_001:0845a16_0"
    },
    {
        "source_sentence": "應當諦聽，今為汝說。",
        "translation": "You should listen attentively, and now I will explain it for you.",
        "source": "T16n0719_001:0845a16_1"
    },
    {
        "source_sentence": "諸善男子！",
        "translation": "“O sons of the virtuous!",
        "source": "T16n0719_001:0845a17_2"
    },
    {
        "source_sentence": "若欲了達，十二緣生吉祥瑞應，謂從無明乃至老死，輪轉次第，於十二月，",
        "translation": "If one wishes to understand the auspicious signs that arise by reason of these twelve conditions, namely from ignorance up to old age and death, which are transmigrated in sequence for twelve months:",
        "source": "T16n0719_001:0845a17_3"
    },
    {
        "source_sentence": "各生祥瑞，而乃有異。",
        "translation": "Each produces an auspicious sign, but there's a difference.",
        "source": "T16n0719_001:0845a19_4"
    },
    {
        "source_sentence": "始十月乃至九月，又從一日乃至十五，試於祥瑞，快樂憂苦，其事非一。",
        "translation": "From the first day of the tenth month up to the ninth month, and from the fifteenth day of the eleventh month, they experience auspicious omens that bring happiness and sorrow but are not one and the same.",
        "source": "T16n0719_001:0845a19_5"
    },
    {
        "source_sentence": "「諸善男子，此十二支，始從寶沙(十)麼洗(月)：一日無明、二日老死、三日生支、四日有支、五日取支、六日愛支、七日受支、八日觸支、九日六入、十日名色、十一識支、十二行支。",
        "translation": "Good sons, these twelve limbs begin with the jealous sand (ten): one day of ignorance, two days of old age and death, three days of birth, four days of existence, five days of grasping, six days of craving, seven days of sensation, eight days of touch, nine days of six sense-fields, ten days of name-and-form, eleven",
        "source": "T16n0719_001:0845a22_0"
    },
    {
        "source_sentence": "「又從麼佉(十一)麼洗(月)：一日行支、二日無明、三日老死、四日生支、五日有支、六日取支、七日愛支、八日受支、九日觸支、十日六入、十一名色、十二識支。",
        "translation": "「又從麼(十一)麼洗(月):一日行支、二日無明、三日老死、四日生支、五日有支、六日取支、七日愛支、八日受支、九日觸支、十日六入、十一名色、十二識支。",
        "source": "T16n0719_001:0845a26_0"
    },
    {
        "source_sentence": "「又從叵囉虞(二合)那(十二)麼洗(月)：一日識支、二日行支、三日無明、四日老死、五日生支、六日有支、七日取支、八日愛支、九日受支、十日觸支、十一六入、十二名色。",
        "translation": "Again, it's from the first day of the consciousness factor, the second day of the practice factor, the third day of ignorance, the fourth day of old age and death, the fifth day of birth factor, the sixth day of existence factor, the seventh day of grasping factor, the eighth day of craving factor, the ninth day of sensation factor, the",
        "source": "T16n0719_001:0845b01_0"
    },
    {
        "source_sentence": "「又從載怛囉(二合)(正)麼洗(月)：一日名色、二日識支、三日行支、四日無明、五日老死、六日生支、七日有支、八日取支、九日愛支、十日受支、十一觸支、十二六入。",
        "translation": "「又從載囉(二合)(正)麼洗(月):一日名色、二日識支、三日行支、四日無明、五日老死、六日生支、七日有支、八日取支、九日愛支、十日受支、十一觸支、十二六入。",
        "source": "T16n0719_001:0845b05_0"
    },
    {
        "source_sentence": "「又從吠(無每反)舍佉(二)麼洗(月)：一日六入、二日名色、三日識支、四日行支、五日無明、六日老死、七日生支、八日有支、九日取支、十日愛支、十一受支、十二觸支。",
        "translation": "「又從吠(無每反)舍(二)麼洗(月):一日六入、二日名色、三日識支、四日行支、五日無明、六日老死、七日生支、八日有支、九日取支、十日愛支、十一受支、十二觸支。",
        "source": "T16n0719_001:0845b09_0"
    },
    {
        "source_sentence": "「又從[口*爾](仁祭反)瑟吒(二合)(三)麼洗(月)：一日觸支、二日六入、三日名色、四日識支、五日行支、六日無明、七日老死、八日生支、九日有支、十日取支、十一愛支、十二受支。",
        "translation": "「又從[口*爾](仁祭反)瑟吒(二合)(三)麼洗(月):一日觸支、二日六入、三日名色、四日識支、五日行支、六日無明、七日老死、八日生支、九日有支、十日取支、十一愛支、十二受支。",
        "source": "T16n0719_001:0845b13_0"
    },
    {
        "source_sentence": "「又從阿(引)沙(引)姹(四)麼洗(月)：一日受支、二日觸支、三日六入、四日名色、五日識支、六日行支、七日無明、八日老死、九日生支、十日有支、十一取支、十二愛支。",
        "translation": "「又從阿(引)沙(引)循(四)麼洗(月):一日受支、二日觸支、三日六入、四日名色、五日識支、六日行支、七日無明、八日老死、九日生支、十日有支、十一取支、十二愛支。",
        "source": "T16n0719_001:0845b17_0"
    },
    {
        "source_sentence": "「又從室囉(二合引)嚩那(五)麼洗(月)：一日愛支、二日受支、三日觸支、四日六入、五日名色、六日識支、七日行支、八日無明、九日老死、十日生支、十一有支、十二取支。",
        "translation": "「又從室囉(二合引)那(五)麼洗(月):一日愛支、二日受支、三日觸支、三日六入、五日名色、六日識支、七日行支、八日無明、九日老死、十日生支、十一有支、十二取支。",
        "source": "T16n0719_001:0845b21_0"
    },
    {
        "source_sentence": "「又從婆(引)捺囉(二合)婆捺(六)麼洗(月)：一日取支、二日愛支、三日受支、四日觸支、五日六入、六日名色、七日識支、八日行支、九日無明、十日老死、十一生支、十二有支。",
        "translation": "「又從婆(引)捺囉(二合)婆捺捺(六)麼洗(月):一日取支、二日愛支、三日受支、四日觸支、五日六入、六日名色、七日識支、八日行支、九日無明、十日老死、十一生支、十二有支。",
        "source": "T16n0719_001:0845b25_0"
    },
    {
        "source_sentence": "「又從阿濕嚩(二合)喻若(七)麼洗(月)：一日有支、二日取支、三日愛支、四日受支、五日觸支、六日六入、七日名色、八日識支、九日行支、十日無明、十一老死、十二生支。",
        "translation": "「又從阿濕(二合)喻若(七)麼洗(月):一日有支、二日取支、三日愛支、四日受支、五日觸支、六日六入、七日名色、八日識支、九日行支、十日無明、十一老死、十二生支。",
        "source": "T16n0719_001:0845b29_0"
    },
    {
        "source_sentence": "「又從迦哩底(二合)迦(八)麼洗(月)：一日生支、二日有支、三日取支、四日愛支、五日受支、六日觸支、七日六入、八日名色、九日識支、十日行支、十一無明、十二老死。",
        "translation": "「又從迦哩底(二合)迦(八)麼洗(月):一日生支、二日有支、三日取支、四日愛支、五日受支、六日觸支、七日六入、八日名色、九日識支、十日行支、十一無明、十二老死。",
        "source": "T16n0719_001:0845c04_0"
    },
    {
        "source_sentence": "「又從麼(引)陵誐(二合)尸哩沙(二合)(九)麼洗(月)：一日老死、二日生支、三日有支、四日取支、五日愛支、六日受支、七日觸支、八日六入、九日名色、十日識支、十一行支、十二無明。",
        "translation": "「又從麼(引)陵(二合)尸哩沙(二合)(九)麼洗(月):一日老死、二日生支、三日有支、四日取支、五日愛支、六日受支、七日觸支、八日六入、九日名色、十日識支、十一行支、十二無明。",
        "source": "T16n0719_001:0845c08_0"
    },
    {
        "source_sentence": "「每月十三，亦如三日；",
        "translation": "The thirteenth day of the month is also like three days.",
        "source": "T16n0719_001:0845c12_0"
    },
    {
        "source_sentence": "每月十四，四日同之；",
        "translation": "On the fourteenth day of each month it is the same as on the fourth day.",
        "source": "T16n0719_001:0845c12_1"
    },
    {
        "source_sentence": "十五、五日，准理亦然。」",
        "translation": "On the fifteenth and fifth days, it's likewise according to principle.",
        "source": "T16n0719_001:0845c13_0"
    },
    {
        "source_sentence": "注云：「有支順轉，積日逆流，黑白月餘，如經廣說。」",
        "translation": "The commentary says, There's a branch that goes along with the accumulation of days going against the flow, and it's more than a month in black and white, as explained in detail in the sūtras.",
        "source": "T16n0719_001:0845c26_0"
    },
    {
        "source_sentence": "爾時世尊，告諸大眾：「若復有人，於十二支，審諦觀察，憶念不忘，",
        "translation": "It was then that the World-honored One said to the great assembly: Again, suppose there is another person who carefully examines the twelve kinds of causality and keeps them in mind.",
        "source": "T16n0719_001:0845c28_0"
    },
    {
        "source_sentence": "了知憂喜。",
        "translation": "They perceive grief and joy.",
        "source": "T16n0719_001:0845c29_1"
    },
    {
        "source_sentence": "若無明支，此日生時，於第九日，及第九月、九年有難。",
        "translation": "If there's a difficulty with the branch of nescience, when this sun arises, it's on the ninth day, the ninth month, and the ninth year or nine years.",
        "source": "T16n0719_001:0845c29_2"
    },
    {
        "source_sentence": "若非命盡，快樂有財、眷屬不和、無病多言、壽八十一，卒於行日。",
        "translation": "If it's not when his life ends, he'll be happy with possessions, his family won't be harmonious, have no illness, speak much, and live eighty-one years, dying on the day he walks.",
        "source": "T16n0719_001:0846a01_3"
    },
    {
        "source_sentence": "「行日生子，第八日、月，八年有難。",
        "translation": "On the eighth day, on the eighth day of the month, there's a difficulty for eight years.",
        "source": "T16n0719_001:0846a04_0"
    },
    {
        "source_sentence": "若非命終，獲大富貴、兄弟唯二、命長少病、德行知法、朋友眾多、工巧藝能、壽八十八，",
        "translation": "If it's not the end of life, they'll attain great wealth and prosperity, only two brothers, a long life with few illnesses, virtuous actions that know the Dharma, many friends, skillful skills and abilities, and eighty-eight years of life.",
        "source": "T16n0719_001:0846a04_1"
    },
    {
        "source_sentence": "卒於識日。",
        "translation": "He died on the consciousness day.",
        "source": "T16n0719_001:0846a06_2"
    },
    {
        "source_sentence": "「識日生子，第五日、月，五年有難。",
        "translation": "Consciousness gives birth on the fifth day and moon, and there's a difficulty in the fifth month.",
        "source": "T16n0719_001:0846a07_0"
    },
    {
        "source_sentence": "若非命終，僂儸勇猛、恒乏財寶、見者歡喜、壽六十四，卒於名色。",
        "translation": "If it's not the end of his life, he'll be overcome with courage, always lacking possessions, rejoicing when he sees them, and having a life span of sixty-four years, dying in name and form.",
        "source": "T16n0719_001:0846a07_1"
    },
    {
        "source_sentence": "「名色日生，第六日、月，九年、十年，逢於難事。",
        "translation": "“When name and form are born on the sixth day, the sixth day, the ninth month, and the tenth year meet with difficult circumstances.",
        "source": "T16n0719_001:0846a10_0"
    },
    {
        "source_sentence": "若非命盡，少病多冤、有子短壽、貧乏恐怖、得後富貴、愛樂惠施、壽年八十，",
        "translation": "If someone’s life isn’t exhausted, they’ll have few illnesses and many enemies, have children with short life spans, be poor and fearful, attain later prosperity, enjoy kindness and generosity, and live for eighty years.",
        "source": "T16n0719_001:0846a10_1"
    },
    {
        "source_sentence": "卒於六入。",
        "translation": "He died in the sixth sense-field.",
        "source": "T16n0719_001:0846a12_2"
    },
    {
        "source_sentence": "「六入日生，於第五日，三、四月內，八年、十年，逢於災難。",
        "translation": "On the fifth day of the sixth month, in the third or fourth month, and in the eighth year or tenth year after entering nirvana, a calamity occurs.",
        "source": "T16n0719_001:0846a13_0"
    },
    {
        "source_sentence": "若非壽盡，憎嫉多病、貧乏勇銳、愛味慳貪、壽六十四，觸日而卒。",
        "translation": "If he doesn't reach the end of his life, he hates and becomes jealous of many illnesses, is poor and courageous, tastes stinginess and greed, and has a life span of sixty-four years, and dies when he touches the sun.",
        "source": "T16n0719_001:0846a14_1"
    },
    {
        "source_sentence": "「觸日生子，第二、五日，三、九月內，九年有難。",
        "translation": "“On the second, fifth, third, and ninth days after touching the sun, a child is born. For nine years there is a difficulty.",
        "source": "T16n0719_001:0846a16_0"
    },
    {
        "source_sentence": "若非命終，疾患恒時、巧言知法、賊姦我見、有財妬色、壽六十四，卒於受日。",
        "translation": "If it's not the end of his life, he'll be sick for a long time, skillfully speaking and knowing the Dharma, thieving self-view, possessing possessions and jealousy, and having a life span of sixty-four years on the day he receives them.",
        "source": "T16n0719_001:0846a16_1"
    },
    {
        "source_sentence": "「受日生子，二日、十日，於二、八月，八年有難。",
        "translation": "On the second day, on the tenth day, and in the second and eighth months, there's a difficulty for eight years.",
        "source": "T16n0719_001:0846a19_0"
    },
    {
        "source_sentence": "若非命終，恒大居尊、富貴勝善、二妻多財、工巧藝能、壽命六十，卒於愛日。",
        "translation": "If it's not the end of his life, he'll die on the craving day at the age of sixty years old. He'll be reborn as an honored one, wealthy and powerful, two wives with abundant possessions, skills and abilities, and a life span of sixty years.",
        "source": "T16n0719_001:0846a19_1"
    },
    {
        "source_sentence": "「愛日生子，於第十日，第三、五月，九年有難。",
        "translation": "On the tenth day, on the third and fifth months, there will be a difficulty for nine years.",
        "source": "T16n0719_001:0846a22_0"
    },
    {
        "source_sentence": "若非命盡，豪富第一、子孫眾多、少病多冤、壽六十四，卒於取日。",
        "translation": "If his life doesn't end, he'll be the first to be wealthy, have many children and grandchildren, suffer from few illnesses, and have a life span of sixty-four years, and die on the day he takes them.",
        "source": "T16n0719_001:0846a22_1"
    },
    {
        "source_sentence": "「生於取日，第九日內，二、八、九月，九年有難。",
        "translation": "On the ninth day of the month, on the second, the eighth, and the ninth months, there's a difficulty for nine years.",
        "source": "T16n0719_001:0846a25_0"
    },
    {
        "source_sentence": "若非命盡，輕慢難降、朋友暴惡、多積冤家、為非犯戒、壽六十四，有日乃卒。",
        "translation": "If his life doesn't end, he's disrespectful and difficult to subdue, has friends who are violent and wicked, accumulates many enemies, doesn't violate the precepts, and has a life span of sixty-four years, then he dies after a few days.",
        "source": "T16n0719_001:0846a25_1"
    },
    {
        "source_sentence": "「生於有日，至第九日，二月、八月，九年有難。",
        "translation": "“Birth lasts from the ninth day of the season to the ninth day of the ninth month. In the second and the eighth months, there is a difficulty for nine years.",
        "source": "T16n0719_001:0846a28_0"
    },
    {
        "source_sentence": "若非命盡，貪他妻女、寡睡豪族、處長主軍、壽命六十，生支日卒。",
        "translation": "If it's not when his life ends, he clings to other wives and women, the lonely and drowsy noble clans, the long-abiding lords of armies, and the 60 years of his life, and dies on the day he's born.",
        "source": "T16n0719_001:0846a28_1"
    },
    {
        "source_sentence": "「子育生支，於第五日，九月、九年、十年有難。",
        "translation": "On the fifth day of the month, in the ninth, ninth, and tenth years, there's a difficulty.",
        "source": "T16n0719_001:0846b02_0"
    },
    {
        "source_sentence": "若非命盡，富貴多病、護國崇德、壽年七十，老死日卒。",
        "translation": "If it's not when their life ends, they'll be rich and powerful, suffer from many illnesses, protect their country and honor virtue, and die at the age of seventy on the day of old age and death.",
        "source": "T16n0719_001:0846b02_1"
    },
    {
        "source_sentence": "「老死日生，於第二日，第九月內，九年有難。",
        "translation": "On the second day of the ninth month, on the ninth day of the ninth month, there will be a trouble for nine years.",
        "source": "T16n0719_001:0846b05_0"
    },
    {
        "source_sentence": "若非壽盡，愚癡迷亂、貪瞋盜賊、聰慧性利、眷屬和順、冤家眾多、壽六十四、無明支卒，",
        "translation": "If it's not the end of life, foolishness, delusion, confusion, craving, anger, thievery, the benefits of the nature of wisdom, the harmony of dependents, the presence of many enemies, the sixty-fourth life span, and the death of the branch of ignorance.",
        "source": "T16n0719_001:0846b05_1"
    },
    {
        "source_sentence": "已上比試，祥瑞事訖。」",
        "translation": "I've already passed the above test, and the auspicious deeds have been done.",
        "source": "T16n0719_001:0846b07_2"
    },
    {
        "source_sentence": "爾時世尊告諸大眾：「若復有人，無明日病，是夜叉難，應善護持，第五夜差。",
        "translation": "It was then that the Bhagavān addressed the crowd, Suppose there's another person who doesn't have tomorrow's illness, and it's difficult for yakṣas to guard well, and the fifth night is different.",
        "source": "T16n0719_001:0846b09_0"
    },
    {
        "source_sentence": "「行日得病，於第三日、七日有難，第二夜差。",
        "translation": "On the third day and on the seventh day, he'll have a difficulty, and on the second night he'll be ill.",
        "source": "T16n0719_001:0846b10_1"
    },
    {
        "source_sentence": "「識日得病，第五日難，第七夜差。",
        "translation": "On the day of consciousness, he'll get sick on the fifth day and have a difficulty on the seventh night.",
        "source": "T16n0719_001:0846b11_2"
    },
    {
        "source_sentence": "「名色日病，於第三日、五日有難，即於彼夜，死活不定。",
        "translation": "On the third day or on the fifth day, he's sick on the day of name-and-form, and there's a difficulty. That night, his life is uncertain whether he's dead or alive.",
        "source": "T16n0719_001:0846b12_3"
    },
    {
        "source_sentence": "「六入日病，於第三日、四日有難，第十夜差。",
        "translation": "On the third day and on the fourth day there is a difficulty, and on the tenth night there is a misfortune.",
        "source": "T16n0719_001:0846b14_0"
    },
    {
        "source_sentence": "「觸日得病，第三日難，第八日起，恒患長命。",
        "translation": "On the third day he became ill and on the eighth day he always suffered from a long illness.",
        "source": "T16n0719_001:0846b14_1"
    },
    {
        "source_sentence": "「受日得病，第五日難，第九日起，十箇月患。",
        "translation": "On the fifth day he became ill, and on the ninth day he was ill for ten months.",
        "source": "T16n0719_001:0846b15_2"
    },
    {
        "source_sentence": "「愛日得病，於第八日、十日有難，第十九日死活不定。",
        "translation": "「愛日得病,於第八日、十日有難,第十九日死活不定。",
        "source": "T16n0719_001:0846b16_3"
    },
    {
        "source_sentence": "「取日得患，當日有難，第十日卒。",
        "translation": "On the tenth day he became ill and died.",
        "source": "T16n0719_001:0846b18_0"
    },
    {
        "source_sentence": "「有日得患，至第三日、九日有難，恒患不差。",
        "translation": "On the third and ninth days, there's a difficulty, and it's always painful and unchanging.",
        "source": "T16n0719_001:0846b19_0"
    },
    {
        "source_sentence": "「生支日患，五日有難，第八日起，至十二日，有難得差。",
        "translation": "On the eighth day, up to the twelfth day, there's a difficulty on the fifth day and a difficulty on the eighth day.",
        "source": "T16n0719_001:0846b19_1"
    },
    {
        "source_sentence": "「老死支患，至第三日、七日有難，彼起得差。」",
        "translation": "When the branch of old age and death is afflicted, there's a difficulty on the third day or seventh day, and they give rise to a difference.",
        "source": "T16n0719_001:0846b22_0"
    },
    {
        "source_sentence": "爾時世尊告大眾言：「若復有人於出行時，觀十二支應知善惡。",
        "translation": "It was then that the Bhagavān addressed the crowd, saying, Suppose another person observes the twelve limbs of good and evil when they're traveling, knowing good and evil.",
        "source": "T16n0719_001:0846b23_0"
    },
    {
        "source_sentence": "無明日行，東去安樂平善速迴，南行諍訟獲所求事，西方行時聞不可意，",
        "translation": "When he traveled to the east, he enjoyed peace and quiet and quickly turned around; when he traveled to the south, he was engaged in disputes and controversies and obtained whatever he wished. When he traveled to the West, he would not like what he heard.",
        "source": "T16n0719_001:0846b24_1"
    },
    {
        "source_sentence": "北方得聞順美愛聲。",
        "translation": "In the north, they'll hear sounds that are agreeable and beautiful.",
        "source": "T16n0719_001:0846b26_2"
    },
    {
        "source_sentence": "「行支日出，東去平善得迴無滯，南去憂惱安樂得迴，西去路獲豐足飲食，",
        "translation": "When the sun comes out on the eastern side of the 行支, he walks calmly and peacefully without obstruction while going east; when he goes south, he feels disheartened and at ease as he turns around.",
        "source": "T16n0719_001:0846b27_0"
    },
    {
        "source_sentence": "北去平善安樂得迴。",
        "translation": "To the north, he'll go back to Ping Shan and Anle.",
        "source": "T16n0719_001:0846b28_1"
    },
    {
        "source_sentence": "「識日東行，途路苦辛，南方行時，得迴本處，西行諍訟，所獲虛耗，",
        "translation": "“The consciousness goes eastward on the sun, but its path is painful and difficult. When it goes south, it returns to its original place; when going westward, it engages in disputes and arguments, which cause untold losses.",
        "source": "T16n0719_001:0846c01_0"
    },
    {
        "source_sentence": "北行獲利，本處得迴。",
        "translation": "To the north, they'll be able to benefit and turn back from their original place.",
        "source": "T16n0719_001:0846c02_1"
    },
    {
        "source_sentence": "「名色東行，吉祥富貴，南方行時，百事圓滿，西方行時，皆遂所求，",
        "translation": "Vimalakīrti traveled to the east, auspicious and wealthy. When he was traveling in the southern direction, a hundred things were fulfilled. When he was traveling in the western direction, all his wishes were fulfilled.",
        "source": "T16n0719_001:0846c03_0"
    },
    {
        "source_sentence": "北方出行，途路苦辛。",
        "translation": "In the northern direction they travelled in pain and suffering on their journeys.",
        "source": "T16n0719_001:0846c04_1"
    },
    {
        "source_sentence": "「六入東行，獲於財利，南行吉祥，遂意得迴，西方行時，所願具足，",
        "translation": "“Sixth, he entered the east and traveled to obtain riches and benefits. Traveling south was an auspicious sign, so he decided to return home. When he traveled westward, his wishes were fulfilled.",
        "source": "T16n0719_001:0846c05_0"
    },
    {
        "source_sentence": "一切成就，北方行時，所求皆得。",
        "translation": "All of them are accomplished, and whatever they seek when they travel to the north will be obtained.",
        "source": "T16n0719_001:0846c06_1"
    },
    {
        "source_sentence": "「觸日東行，財物散失，南行安樂，西方行時，諍訟驚怖，北方速迴，",
        "translation": "“When the sun moves to the east, his property is scattered and he travels south in peace. When he travels to the west, he is terrified by disputes and arguments; but when he turns to the north he quickly retreats.",
        "source": "T16n0719_001:0846c08_0"
    },
    {
        "source_sentence": "增長財利。",
        "translation": "It increases wealth and profit.",
        "source": "T16n0719_001:0846c09_1"
    },
    {
        "source_sentence": "「受日東行，憂惱驚怖，過去得免，南方行時，驚怖諍訟，西方行時，",
        "translation": "When the sun moves to the east it is overwhelmed by sorrow and fear. In the past he was able to escape but when he travels to the south, he is frightened and fights in anger.",
        "source": "T16n0719_001:0846c09_2"
    },
    {
        "source_sentence": "人卒聞信，北方行時，獲利遂意，聞信不悅。",
        "translation": "When the Master was traveling in the northern direction, people were happy and satisfied with their wishes but they did not like to hear his words of faith.",
        "source": "T16n0719_001:0846c11_3"
    },
    {
        "source_sentence": "「愛支日行，東方得財，南行利寡，本處速迴，西方行時，人卒獲信，",
        "translation": "Again, Ānanda, the licchavi Vimalakīrti had gained some wealth when he was traveling in the east on a daily basis. When he was traveling in the south his profits were small; but when he returned quickly to his native land he stayed in the western direction and all the people who came there believed in him.",
        "source": "T16n0719_001:0846c13_0"
    },
    {
        "source_sentence": "北方遂意，自在快樂。",
        "translation": "The people in the northern direction were satisfied with their wishes and enjoyed freedom and happiness.",
        "source": "T16n0719_001:0846c14_1"
    },
    {
        "source_sentence": "「取日行時，東行驚怖，途路苦辛，南行安樂，西方行時，微少怖畏，",
        "translation": "“When the sun is approaching its setting, the moon travels in fear when going eastward. The paths are painful and difficult on the way, but when going south, it is peaceful. When traveling westward, there is little fear.",
        "source": "T16n0719_001:0846c15_0"
    },
    {
        "source_sentence": "北方行時，所求皆獲，速迴本處。",
        "translation": "When he traveled to the north, he obtained whatever he wanted and quickly returned to his original place.",
        "source": "T16n0719_001:0846c16_1"
    },
    {
        "source_sentence": "「有支東行，辛苦怖畏，南方出行，速達本處，獲利遂意，西方出行，",
        "translation": "Again, some members of the sangha traveled eastward with great vexation and fear. Traveling in the south, they quickly reached their native place to gain benefit [the living beings] and satisfy their wishes.",
        "source": "T16n0719_001:0846c18_0"
    },
    {
        "source_sentence": "諸事增長，本處速達，北方得利，本處速迴。",
        "translation": "When things grow, the original place quickly reaches it, and profits are gained in the north, which quickly turns back to its original place.",
        "source": "T16n0719_001:0846c19_1"
    },
    {
        "source_sentence": "「生支東行，得財破壞，南行稱意，西方行時，得達本處，北行獲財。",
        "translation": "When the branch of birth travels east, it gains possessions and destroys them; when traveling south, it praises their intentions; when traveling west, it reaches its original place; and when traveling north, it acquires possessions.",
        "source": "T16n0719_001:0846c21_0"
    },
    {
        "source_sentence": "「老死東行，速疾得迴，南方行時，得聞愛言，西行怕怖，北方行時，",
        "translation": "To the east is old age and death, but to the south are old age and death. When traveling in the south, one can hear sweet words; when traveling in the west, one is frightened by fear; and when traveling in the north, one can hear sweet sounds.",
        "source": "T16n0719_001:0846c23_0"
    },
    {
        "source_sentence": "安樂本處，平善得迴，出行已訖。」",
        "translation": "They'll be comfortable in their original place, return with ease, and have completed their journey.",
        "source": "T16n0719_001:0846c24_1"
    },
    {
        "source_sentence": "時諸大眾，復白佛言：「世有盜賊，云何了知？」",
        "translation": "The crowd then again said to the Buddha, There are thieves and thieves in the world, so how do you know them?",
        "source": "T16n0719_001:0846c26_0"
    },
    {
        "source_sentence": "爾時世尊，告大眾言：「若欲了知劫盜等事，應當審諦十二有支。",
        "translation": "It was then that the Bhagavān addressed the crowd, saying, If you want to know about such things as robbery and stealing, you should examine the twelve components of existence.",
        "source": "T16n0719_001:0846c26_1"
    },
    {
        "source_sentence": "諸善男子！",
        "translation": "“O sons of the virtuous!",
        "source": "T16n0719_001:0846c28_2"
    },
    {
        "source_sentence": "若無明日，賊來北方財物散失，舍東來入賊心毒害，彼賊髮少住處不遠，",
        "translation": "If there's no tomorrow, the thief comes from the north and his possessions are scattered, and he enters east of his house. The thief's mind is poisonous, and those thieves rarely live not far from him.",
        "source": "T16n0719_001:0846c28_3"
    },
    {
        "source_sentence": "至九日內，決定得財。",
        "translation": "Within nine days, he'll surely attain possessions.",
        "source": "T16n0719_001:0847a01_4"
    },
    {
        "source_sentence": "「行支日盜，相貌赤黃，著衣故舊，彼盜獲罪，若來東方，自雪其事。",
        "translation": "Every day when a practitioner steals, he's red and yellow in appearance and wears an old robe that's outdated.",
        "source": "T16n0719_001:0847a02_0"
    },
    {
        "source_sentence": "「若識支盜，人出自舍，黃赤髮少，外說人聞，財物却得。",
        "translation": "If someone knows the branch of stealing, they'll leave their own house with little yellow and red, and people outside will hear about it, and their possessions will be obtained.",
        "source": "T16n0719_001:0847a04_0"
    },
    {
        "source_sentence": "「名色支日，賊二兄弟面形髮黑，內一人醜，白頭工巧，至二十一，財寶却得。",
        "translation": "On the day of the name-and-form branch, the thief's two brothers were black in appearance and one of them was ugly inside, with white hair and skillfulness up to the age of twenty-one, but their possessions were obtained.",
        "source": "T16n0719_001:0847a06_0"
    },
    {
        "source_sentence": "「六入日盜，出於自舍，形色黃赤，妬惡大目，近水路來，藏之舍近住處眷屬，",
        "translation": "On the sixth day, he steals from his own dwelling and leaves it. His body is yellowish-red in color with big eyes that are jealous of him. He approaches water and comes to hide inside the dwelling, accompanied by their retinues who live nearby.",
        "source": "T16n0719_001:0847a07_1"
    },
    {
        "source_sentence": "至第二日，得失疑惑，財物不定。",
        "translation": "On the second day, he had doubts about gain and loss, and his possessions were indeterminate.",
        "source": "T16n0719_001:0847a09_2"
    },
    {
        "source_sentence": "「觸支日盜，出於自舍，形長髮黑，數來歡喜，癡常似哭，若有諍競，",
        "translation": "On each day, the thief came out of his own house. His body was black in color and greedy in stature. He frequently came to rejoice but always cried with amazement at the sight of it.",
        "source": "T16n0719_001:0847a10_0"
    },
    {
        "source_sentence": "財物却得。",
        "translation": "Their possessions are then obtained.",
        "source": "T16n0719_001:0847a11_1"
    },
    {
        "source_sentence": "「受支日盜，聚落中來，內有一人，家犬色黑，至二十日，賊決定獲。",
        "translation": "On the day of the thief who received the precepts, there was a man coming from a village with a dog that was black in color inside his house. When he arrived at 20 days old, the thief was sure to get it.",
        "source": "T16n0719_001:0847a11_2"
    },
    {
        "source_sentence": "「愛支日盜，彼人西來，別聚落住，形長見喜，家犬足黑，同人諍競，",
        "translation": "On the day of thief A Forest of Pearls from the Dharma Garden, Volume II The thief came from the west and lived in a different village.",
        "source": "T16n0719_001:0847a14_0"
    },
    {
        "source_sentence": "談論彼人，決定非虛，取支日獲。",
        "translation": "When we talk to that person, we'll make sure it's not false, and he takes the branch and obtains it every day.",
        "source": "T16n0719_001:0847a15_1"
    },
    {
        "source_sentence": "「取支日盜，從南方來，內一人諍，其事談說，財決定得。",
        "translation": "On the day of the thief who took the liquor, he came from the south and was caught by a man inside. When he talked about it, his possessions were surely stolen.",
        "source": "T16n0719_001:0847a17_0"
    },
    {
        "source_sentence": "「有支日盜，從東而來，辭辯僂儸，姦詐多疑，自眷屬說。",
        "translation": "On that day some members of the sangha came from the east to commit robbery. They spoke eloquently and bragged, frequently accusing others of fraudulent deeds. The members of the sangha said so among themselves.",
        "source": "T16n0719_001:0847a19_0"
    },
    {
        "source_sentence": "「生支日盜，三人同行，二人外來，一人自親，速疾求之，財寶却得。",
        "translation": "On the day of the thief Sārthavāha, three people were traveling with him. Two came from outside the country and one was related to someone else. They quickly begged for their property but they could not find it.",
        "source": "T16n0719_001:0847a21_0"
    },
    {
        "source_sentence": "「老死支盜，從北方來，形首皆修，齒缺首白，至二十五日，財物却獲，",
        "translation": "On the twenty-fifth day, the thief of the branch of old age and death came from the north. His form and head were all restored but his teeth were missing and his hair was white.",
        "source": "T16n0719_001:0847a23_0"
    },
    {
        "source_sentence": "說賊盜竟。」",
        "translation": "I'll explain the end of stealing from thieves.",
        "source": "T16n0719_001:0847a24_1"
    },
    {
        "source_sentence": "爾時眾會，俱白佛言：「支分眴動，其事云何？」",
        "translation": "It was then that the assembled people all said to the Buddha, What's the matter with the branch being broken and moving?",
        "source": "T16n0719_001:0847a24_2"
    },
    {
        "source_sentence": "佛告大眾：「若復有人，欲知此事，應當審諦十二緣生，了知未來所有憂喜，",
        "translation": "The Buddha said to the great assembly, “Other bhikṣus, if you wish to know this matter, you should carefully examine the twelve kinds of causal conditions that give rise to future sorrow and joy.",
        "source": "T16n0719_001:0847a26_0"
    },
    {
        "source_sentence": "決定非虛。",
        "translation": "It's definitely not false.",
        "source": "T16n0719_001:0847a27_1"
    },
    {
        "source_sentence": "「復有男女，於無明支，左目眴時，父母驚怖。",
        "translation": "Again, there were men and women whose parents were frightened when their left eyebrows stood on end in the branch of nescience.",
        "source": "T16n0719_001:0847a28_0"
    },
    {
        "source_sentence": "「行支左眴，有喜遂心。",
        "translation": "To the left of the practice branch, there's joyful and fulfilled mind.",
        "source": "T16n0719_001:0847a29_0"
    },
    {
        "source_sentence": "「識支左眴，於所求事，和合稱意。",
        "translation": "To the left of the branch of consciousness, he combines what he seeks with his words and thoughts.",
        "source": "T16n0719_001:0847b01_0"
    },
    {
        "source_sentence": "「若名色支，左目眴動，獲於財物。",
        "translation": "“Suppose the name-and-form branch moves with its left eye, and it obtains possessions.",
        "source": "T16n0719_001:0847b02_0"
    },
    {
        "source_sentence": "「六入支日，左目眴時，父母不悅。",
        "translation": "On the sixth day, when his left eye is closed, his parents aren't happy.",
        "source": "T16n0719_001:0847b03_0"
    },
    {
        "source_sentence": "「觸支日眴，必有諍論。",
        "translation": "When the tangible branch of touch is debilitating, there must be a debate.",
        "source": "T16n0719_001:0847b04_0"
    },
    {
        "source_sentence": "「受支日眴，於所求事，和合遂意。",
        "translation": "Every day, he receives the precepts and fulfills his wishes in harmony with what he asks for.",
        "source": "T16n0719_001:0847b05_0"
    },
    {
        "source_sentence": "「於愛支日，左目瞬時，有骨肉來。",
        "translation": "“On the craving day, when his left eye blinks, there’s flesh and bone coming in.",
        "source": "T16n0719_001:0847b06_0"
    },
    {
        "source_sentence": "「若取支日，左目眴時，所求皆獲。",
        "translation": "“If he takes a branch, he'll attain whatever he asks for when his left eye is pursed.",
        "source": "T16n0719_001:0847b07_0"
    },
    {
        "source_sentence": "「有支日眴，諍論事起。",
        "translation": "“There’s a branch that grows angry every day and arrogance arises from discussing things.",
        "source": "T16n0719_001:0847b08_0"
    },
    {
        "source_sentence": "「若生支日，左目眴動，得遠音信。",
        "translation": "On the day he's born, his left eye will shake and he'll attain far-reaching faith.",
        "source": "T16n0719_001:0847b09_0"
    },
    {
        "source_sentence": "「於老死支，左目眴時，一切所求，和合如意。",
        "translation": "“At the time of the branch of old age and death, his left eye is closed, and whatever he asks for is combined with supernormal power.",
        "source": "T16n0719_001:0847b10_0"
    },
    {
        "source_sentence": "「若復有人，觀察十二，皆悉了知。",
        "translation": "“Suppose another person observes the twelve and fully knows them all.",
        "source": "T16n0719_001:0847b10_1"
    },
    {
        "source_sentence": "於無明支，右目眴動，父母驚怖。",
        "translation": "In the branch of nescience, his right eye is distressed, and his parents are frightened.",
        "source": "T16n0719_001:0847b11_2"
    },
    {
        "source_sentence": "「於行支日，右目眴時，於一切事，皆獲遂意。",
        "translation": "“On the day of the practice branch, when his right eye is closed, he attains fulfillment of all things.",
        "source": "T16n0719_001:0847b13_0"
    },
    {
        "source_sentence": "「於識支日，右目眴時，有諍論事。",
        "translation": "“On the day of the consciousness factor, when his right eye is closed, there’s a dispute over matters.",
        "source": "T16n0719_001:0847b13_1"
    },
    {
        "source_sentence": "「於名色支，右目眴時，而獲新衣。",
        "translation": "“In the name-and-form branch, he got a new robe when his right eye was blindfolded.",
        "source": "T16n0719_001:0847b14_2"
    },
    {
        "source_sentence": "「六入支日，右目眴時，財物破散。",
        "translation": "“On the sixth day of the entering branch, when his right eye is distressed, his possessions are scattered.",
        "source": "T16n0719_001:0847b16_0"
    },
    {
        "source_sentence": "「於觸支日，右目眴時，獲於財物。",
        "translation": "“On the day of touch, when his right eye is closed, he obtains possessions.",
        "source": "T16n0719_001:0847b17_0"
    },
    {
        "source_sentence": "「受支日眴，有悲泣事。",
        "translation": "On the day when he receives the precepts, there's a sad and weeping thing.",
        "source": "T16n0719_001:0847b18_0"
    },
    {
        "source_sentence": "「愛支日眴，財物少散。",
        "translation": "“The branch of craving is depressed day by day, with few possessions and dispersed.",
        "source": "T16n0719_001:0847b19_0"
    },
    {
        "source_sentence": "「於取支日，右目眴時，多獲珍寶。",
        "translation": "“On the day he takes the branch, when his right eye is pursed, he often obtains rare treasures.",
        "source": "T16n0719_001:0847b20_0"
    },
    {
        "source_sentence": "「若有支日，右目眴時，諍論失財，求之却得。",
        "translation": "“If there’s a branch of the sun, then when his right eye is distorted, he discusses losing possessions and seeking them to obtain them.",
        "source": "T16n0719_001:0847b21_0"
    },
    {
        "source_sentence": "「若生支日，右目眴時，或望人來若求財物，希必來至。",
        "translation": "On the day he's born, when his right eye is closed, he might expect someone to come or seek property and hope they'll come.",
        "source": "T16n0719_001:0847b22_0"
    },
    {
        "source_sentence": "「於老死支，右目眴時，有喜慶事，和合成就。",
        "translation": "“In the branch of old age and death, when his right eye is depressed, there are joyful things that come together in harmony.",
        "source": "T16n0719_001:0847b24_0"
    },
    {
        "source_sentence": "目瞬已竟。」",
        "translation": "My eyes have been closed for a moment.",
        "source": "T16n0719_001:0847b24_1"
    },
    {
        "source_sentence": "十二緣生祥瑞經卷上",
        "translation": "Sutra on the Auspicious Rui of the Arising of the Twelve Conditions, vol. 1",
        "source": "T16n0719_001:0847b26_0"
    }
]