[
    {
        "source_sentence": "分別緣起初勝法門經卷下",
        "translation": "Second Fascicle of the First Chapter of the Sutra on the Discriminating Conditioned Arising of the Dharma Teaching, Volume II",
        "source": "T16n0717_002:0840b25_0"
    },
    {
        "source_sentence": "大唐三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial edict by the Tripiṭaka Master Xuanzang of the Great Tang dynasty",
        "source": "T16n0717_002:0840b27_0"
    },
    {
        "source_sentence": "「復次，世尊！",
        "translation": "“Furthermore, Bhagavān!",
        "source": "T16n0717_002:0840b28_0"
    },
    {
        "source_sentence": "如餘處說緣有四種，所謂因緣、等無間緣，及所緣緣并增上緣。",
        "translation": "As elsewhere it is said that there are four kinds of supporting object: the so-called causal supporting object, the equal and immediately antecedent supporting object, the supporting object as supporting object and the dominant supporting object.",
        "source": "T16n0717_002:0840b28_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0717_002:0840b29_2"
    },
    {
        "source_sentence": "今者依何緣說無明緣行，依何緣說次第乃至生緣老死？」",
        "translation": "What's the reason we say that nescience is conditioned by conditioned formations, and what's the reason we say order up to birth is conditioned by old age and death?",
        "source": "T16n0717_002:0840b29_3"
    },
    {
        "source_sentence": "世尊告曰：「我依諸行總相宣說，有四種緣，今此義中，我惟依一增上緣說無明緣行，",
        "translation": "The World-honored One said: I declare that conditioned forces have four kinds of conditions as their general characteristics. Here, in this sense, I speak only of the conditioned forces having ignorance as their supporting condition by relying upon one predominating",
        "source": "T16n0717_002:0840c02_4"
    },
    {
        "source_sentence": "次第乃至生緣老死。",
        "translation": "It's in order up to the point where birth is conditioned by old age and death.",
        "source": "T16n0717_002:0840c04_5"
    },
    {
        "source_sentence": "此增上緣復有二種，一遠、二近。」",
        "translation": "Again, there are two kinds of these superior conditions, one that are distant and two that are near.",
        "source": "T16n0717_002:0840c04_6"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0840c05_7"
    },
    {
        "source_sentence": "此增上緣云何為遠？",
        "translation": "What is the distance between these dominant conditions?",
        "source": "T16n0717_002:0840c05_8"
    },
    {
        "source_sentence": "云何為近？」",
        "translation": "What's near?",
        "source": "T16n0717_002:0840c06_9"
    },
    {
        "source_sentence": "世尊告曰：「非理作意若未生時，無明隨眠能為諸行遠增上緣；",
        "translation": "The World-honored One said: When unreasonable attention has not yet arisen, the passions that are accompanied by ignorance can act as distant and dominant conditions for conditioned states of being.",
        "source": "T16n0717_002:0840c06_10"
    },
    {
        "source_sentence": "生已便作近增上緣。",
        "translation": "After it arises, it then creates a proximate and superior condition.",
        "source": "T16n0717_002:0840c07_11"
    },
    {
        "source_sentence": "非理作意所引諸行，與六識身相應俱有同生同滅，若未生時，彼能為識遠增上緣；",
        "translation": "It is not the case that conditioned forces projected by reasoned attention are conjoined with the six bodies of consciousness and have both arising and perishing simultaneously. If they do not arise yet, how can they be the predominant",
        "source": "T16n0717_002:0840c08_12"
    },
    {
        "source_sentence": "彼若生已，便能為識近增上緣。",
        "translation": "If they arise, then they can be the proximate and predominant condition of consciousness.",
        "source": "T16n0717_002:0840c10_13"
    },
    {
        "source_sentence": "未死沒時，識為名色遠增上緣；",
        "translation": "Consciousness is the distant dominant condition of name and form at the time of nondeath.",
        "source": "T16n0717_002:0840c10_14"
    },
    {
        "source_sentence": "既死沒已，識為名色近增上緣。",
        "translation": "After death and disappearance, consciousness is the proximate and predominant condition of name and form.",
        "source": "T16n0717_002:0840c11_15"
    },
    {
        "source_sentence": "如以其識望彼名色，如是以其所引名色，望彼所生名色亦爾。",
        "translation": "Just as consciousness looks to name and form with respect to that, so are the names and forms that are projected by this consciousness. The same applies to name and form that arise with respect to that.",
        "source": "T16n0717_002:0840c12_16"
    },
    {
        "source_sentence": "如以名色望彼名色，如是六處望彼六處，觸望於觸，受望於受，亦復如是。",
        "translation": "Just as name-and-form looks to name-and-form in relation to form, so do the six sense-fields look to these six sense-fields; contact looks to contact and feeling looks to feeling.",
        "source": "T16n0717_002:0840c13_17"
    },
    {
        "source_sentence": "如以無明望彼諸行，無明望愛，愛望於取，取望於有，亦復如是。",
        "translation": "Just as ignorance looks to these formations because of ignorance, and ignorance looks to thirst; thirst looks to grasping, and grasping looks to existence. The same applies in the same way.",
        "source": "T16n0717_002:0840c15_18"
    },
    {
        "source_sentence": "如以其識望彼名色，以名色等望名色等，如是以有望生亦爾。",
        "translation": "Just as the consciousness looks to name and form with respect to that, and looks to name and form etc. with respect to name and form etc., so also does it look to name and form etc.",
        "source": "T16n0717_002:0840c16_19"
    },
    {
        "source_sentence": "若在胎藏、嬰孩、童子、少年時，生能為老死遠增上緣；",
        "translation": "Birth can be the predominant condition for old age and death when it is in the womb, at the time of an infant, a young child, or a youth.",
        "source": "T16n0717_002:0840c18_20"
    },
    {
        "source_sentence": "諸根成熟命將盡時，應知能作近增上緣。」",
        "translation": "When the faculties mature and their life is about to end, you should know that they'll be able to create proximate and increasing conditions.",
        "source": "T16n0717_002:0840c19_21"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0840c20_22"
    },
    {
        "source_sentence": "如彼有因、有緣、有由，法門經說愛是業因，有何密意？」",
        "translation": "Just as they have causes, conditions, and reasons, the Dharma teachings say that craving is the cause of karma, so what's the hidden meaning of this?",
        "source": "T16n0717_002:0840c20_23"
    },
    {
        "source_sentence": "世尊告曰：「有所攝業用愛為因，是為此中所說密意。」",
        "translation": "The Bhagavān told them, What's included in karma is the cause of using craving as the cause, which is the hidden meaning explained here.",
        "source": "T16n0717_002:0840c21_24"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0840c24_0"
    },
    {
        "source_sentence": "此因、緣、由三種別義，云何應知？」",
        "translation": "How should we know the distinct meanings of these three kinds of causes, conditions, and causes?",
        "source": "T16n0717_002:0840c24_1"
    },
    {
        "source_sentence": "世尊告曰：「諸能引發後生種子，是其因義；",
        "translation": "The World-honored One said:",
        "source": "T16n0717_002:0840c24_2"
    },
    {
        "source_sentence": "若與此生作依作持令得生起，是其緣義；",
        "translation": "The meaning of condition is that it acts as the support and sustaining cause for this birth, enabling it to arise.",
        "source": "T16n0717_002:0840c25_3"
    },
    {
        "source_sentence": "既命終已，導引近生令得生起，是其由義。",
        "translation": "The reason for this is that, after death, the ascetic guides beings who are about to be born and causes them to be born.",
        "source": "T16n0717_002:0840c26_4"
    },
    {
        "source_sentence": "如是應知三義差別。」",
        "translation": "Thus, you should know the distinction between the three meanings.",
        "source": "T16n0717_002:0840c27_5"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0840c29_0"
    },
    {
        "source_sentence": "言緣起者，是何句義？」",
        "translation": "What's the meaning of the phrase that says conditioned arising?",
        "source": "T16n0717_002:0840c29_1"
    },
    {
        "source_sentence": "世尊告曰：「如是諸分，各由自緣和合無闕相續而起，如是名為緣起句義。」",
        "translation": "The Bhagavān told them, Thus, each of these parts arise from the conjunction of their own conditions without missing the continuity, and this is called the meaning of the phrase conditioned arising.",
        "source": "T16n0717_002:0840c29_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0841a03_0"
    },
    {
        "source_sentence": "惟有此生相續緣起？",
        "translation": "Is there only the conditioned arising of this birth as a stream?",
        "source": "T16n0717_002:0841a03_1"
    },
    {
        "source_sentence": "為更別有所餘緣起？」",
        "translation": "Why are there any other conditions that arise separately?",
        "source": "T16n0717_002:0841a03_2"
    },
    {
        "source_sentence": "世尊告曰：「我說緣起，略有八門：一者、說有受用世俗境界緣起，謂緣眼色生於眼識，",
        "translation": "The World-honored One said: I teach that there are, in brief, eight kinds of dependent origination:",
        "source": "T16n0717_002:0841a04_3"
    },
    {
        "source_sentence": "三事和合便有其觸，觸為緣受，如是廣說；",
        "translation": "When these three things are combined, there is contact. Sensation has contact as its supporting object; it is explained in detail in this way.",
        "source": "T16n0717_002:0841a06_4"
    },
    {
        "source_sentence": "二者、說有任持緣起，謂緣四食諸根大種安住增長；",
        "translation": "The second is that it teaches that there are sustained conditioned arising, that is, the support of the four kinds of nutriment by means of which the faculties and primary elements abide and grow.",
        "source": "T16n0717_002:0841a07_5"
    },
    {
        "source_sentence": "三者、說有食因緣起，謂求諸穀，田、種、水緣發生牙等；",
        "translation": "The third is to say that there are causes and conditions arising from eating. That is, when one seeks grains, such [things] as fields, seeds, water, etc., for the sake of producing sprouts, etc.",
        "source": "T16n0717_002:0841a08_6"
    },
    {
        "source_sentence": "四者、說有一切生身相續緣起，謂由能引，能生諸分別，生一切所引所生；",
        "translation": "The fourth is that all sentient beings are born in the body as a series of conditioned arising. That is to say, because they are able to project and give rise to discrimination, all sentient beings are born into it by means of what they",
        "source": "T16n0717_002:0841a09_7"
    },
    {
        "source_sentence": "五者、說有一切生身依持緣起，謂諸世界由諸因緣施設成壞；",
        "translation": "The fifth is that all sentient beings are supported, sustained, and conditioned by the body of all living beings. That is to say, worlds are formed and disintegrate due to causes and conditions.",
        "source": "T16n0717_002:0841a11_8"
    },
    {
        "source_sentence": "六者、說有一切生身差別緣起，謂由不善、善有漏業，施設三惡、人天趣別；",
        "translation": "The sixth I kind is that all sentient beings are said to be born with distinct bodies as supporting conditions. That is, by virtue of unwholesome and wholesome or contaminated actions, the three evil destinies of humans and gods are",
        "source": "T16n0717_002:0841a12_9"
    },
    {
        "source_sentence": "七者、說有清淨緣起，謂依他音，及依自內如理作意，發生正見能滅無明，",
        "translation": "The seventh is that they say there are pure conditioned arisings. That is to say, depending on the sounds of others and relying upon one’s own thoughts within oneself in accordance with reality, right view occurs and enables ignorance to be",
        "source": "T16n0717_002:0841a14_10"
    },
    {
        "source_sentence": "無明滅故諸行隨滅，廣說乃至，由生滅故老死隨滅。」",
        "translation": "It's because nescience ceases that all conditioned things cease, and it's explained in detail up to the point where old age and death cease because birth ceases.",
        "source": "T16n0717_002:0841a15_11"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0841a18_0"
    },
    {
        "source_sentence": "如無明等次第為緣能生行等，為即如是次第滅耶？」",
        "translation": "Is it the sequential cessation of such things as nescience and so forth that can be conditioned to give rise to formations and so forth?",
        "source": "T16n0717_002:0841a18_1"
    },
    {
        "source_sentence": "佛言：「不爾。」",
        "translation": "The Buddha said, That's not so.",
        "source": "T16n0717_002:0841a19_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0841a19_3"
    },
    {
        "source_sentence": "何緣次第而說彼滅？」",
        "translation": "What is the reason for explaining their cessation in order?",
        "source": "T16n0717_002:0841a19_4"
    },
    {
        "source_sentence": "世尊告曰：「為欲顯示由先諸分不生功能，令後諸分得不生法，故次第說，",
        "translation": "The World-honored One said: In order to show that the power of nonarising is due to the nonarising of former states, so that later states will attain nonarising.",
        "source": "T16n0717_002:0841a20_5"
    },
    {
        "source_sentence": "然非不為生相滅法有次第轉。",
        "translation": "However, it's not that there's a sequential transformation that doesn't result from the arising and ceasing dharmas.",
        "source": "T16n0717_002:0841a22_0"
    },
    {
        "source_sentence": "八者、說有自在緣起，謂善修治靜慮為緣，諸修定者隨所願樂，如是皆成終無別異。",
        "translation": "The eighth is that they are said to have self-dependence as supporting object: good cultivation of meditative absorption as supporting object. All the practitioners of meditative absorption, according to their wishes and pleasures, all",
        "source": "T16n0717_002:0841a22_1"
    },
    {
        "source_sentence": "如是名為我所略說八門緣起。」",
        "translation": "Thus, these are called the eight aspects of dependent arising that I've briefly explained.",
        "source": "T16n0717_002:0841a24_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0841a26_0"
    },
    {
        "source_sentence": "如佛所說，因業故生，因愛故轉。",
        "translation": "As the Buddha has said: “It is because of action that they are produced, and because of craving that they proceed.",
        "source": "T16n0717_002:0841a26_1"
    },
    {
        "source_sentence": "依何密意作如是說？」",
        "translation": "What is the hidden meaning that makes such a statement?",
        "source": "T16n0717_002:0841a27_0"
    },
    {
        "source_sentence": "世尊告曰：「無明為緣，先於諸有，造作增長種種福行或非福行或不動行，",
        "translation": "The World-honored One said: It is the condition of ignorance that, prior to all existences, one creates and increases various meritorious deeds, either non-meritful or inactive.",
        "source": "T16n0717_002:0841a27_1"
    },
    {
        "source_sentence": "引發攝受種種生身種子差別。",
        "translation": "They give rise to the distinctions in the seeds of various kinds of bodies that are collected and produced.",
        "source": "T16n0717_002:0841a29_2"
    },
    {
        "source_sentence": "於此有中若愛未斷，由此愛故能令行等轉成其有。",
        "translation": "Among these existences, if desire has not yet been abandoned, it is because of this desire that conditioned forces and so on can be transformed into existence.",
        "source": "T16n0717_002:0841a29_3"
    },
    {
        "source_sentence": "有起後有自體功能，如是功能不離於愛。",
        "translation": "There is a capability of the intrinsic essence that exists after having arisen, and this capability does not part from craving.",
        "source": "T16n0717_002:0841b02_4"
    },
    {
        "source_sentence": "依此密意故說是言，因業故生，因愛故轉。」",
        "translation": "Relying on this esoteric teaching, it's said to be produced because of actions and transformed because of craving.",
        "source": "T16n0717_002:0841b03_0"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0841b04_0"
    },
    {
        "source_sentence": "若世尊說愛是轉因，何緣但說取為有緣，非愛緣有？」",
        "translation": "If the Bhagavān says that craving is the cause of change, why does he only say that grasping is a conditioned condition but not that it's a conditioned by craving?",
        "source": "T16n0717_002:0841b04_1"
    },
    {
        "source_sentence": "世尊告曰：「若離於取，有愛不能為緣轉變非福行等，令成有支生諸惡趣。",
        "translation": "The Bhagavān told them, If someone parts with craving and doesn't change what's not good for the sake of it, they'll become a part that gives rise to bad destinies.",
        "source": "T16n0717_002:0841b05_2"
    },
    {
        "source_sentence": "又若離取，諸無有愛不能為緣，轉變福行不動行等，令成有支於不定地及於定地生諸善趣。",
        "translation": "Also, if they are free of grasping and have no cravings that can't be the condition as a condition, transforming virtuous actions, immovable actions, and so forth will cause them to become part of existence and give rise to good",
        "source": "T16n0717_002:0841b07_3"
    },
    {
        "source_sentence": "是故非唯愛為有緣，然彼有支定緣於取。」",
        "translation": "Therefore, it's not only craving that has a condition, but there are other factors that have a conditioned condition for grasping.",
        "source": "T16n0717_002:0841b09_4"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0841b11_0"
    },
    {
        "source_sentence": "如《大因緣法門經》說：『汝阿難陀！",
        "translation": "As the Mahāprajñāpāramitā-sūtra explains, 'You, Ānanda!",
        "source": "T16n0717_002:0841b11_1"
    },
    {
        "source_sentence": "若於彼彼有情類中無有生者，應無如是如是類生；",
        "translation": "If there were no birth among the species of sentient beings, there would be no such-and-such birth.",
        "source": "T16n0717_002:0841b11_2"
    },
    {
        "source_sentence": "若一切生都無有者，應不施設生緣老死。』",
        "translation": "If all births are nonexistent, then they shouldn't define birth as the condition for old age and death.'",
        "source": "T16n0717_002:0841b13_3"
    },
    {
        "source_sentence": "依何密意作如是說？」",
        "translation": "What is the hidden meaning that makes such a statement?",
        "source": "T16n0717_002:0841b14_4"
    },
    {
        "source_sentence": "世尊告曰：「依所引生及所生生，二種密意，作如是說。",
        "translation": "The Bhagavān told them, Relying on the two kinds of esoteric meaning that are induced and produced, he explains it this way.",
        "source": "T16n0717_002:0841b14_5"
    },
    {
        "source_sentence": "又依老死遠增上緣，及依老死近增上緣，二種密意，作如是說。」",
        "translation": "Also, depending on the distant superior condition of old age and death, and depending on the near superior condition of old age and death, these two kinds of esoteric meaning are explained in this way.",
        "source": "T16n0717_002:0841b15_6"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0841b18_0"
    },
    {
        "source_sentence": "先為略說緣起句義，其緣起義猶未為說，云何應知？」",
        "translation": "First, we briefly explained the meaning of the phrase conditioned arising, but the meaning of conditioned arising has yet to be explained, so how should we know it?",
        "source": "T16n0717_002:0841b18_1"
    },
    {
        "source_sentence": "世尊告曰：「諸緣起義，略有十一，如是應知：謂無作者義是緣起義，",
        "translation": "The World-honored One said: “In sum, the meaning of conditioned arising is elevenfold:",
        "source": "T16n0717_002:0841b19_2"
    },
    {
        "source_sentence": "有因生義是緣起義，離有情義是緣起義，依他起義是緣起義，無動作義是緣起義，",
        "translation": "The meaning of having causes that arise is the meaning of conditioned arising; the meaning of being free from sentient beings is the meaning of conditioned arising; the meaning of other-dependent arising is the meaning of conditioned arising; and the meaning of",
        "source": "T16n0717_002:0841b21_0"
    },
    {
        "source_sentence": "性無常義是緣起義，剎那滅義是緣起義，因果相續無間絕義是緣起義，",
        "translation": "The meaning of impermanence by nature is the meaning of conditioned arising; the meaning of cessation in a moment is the meaning of conditioned arising; the meaning of uninterrupted succession of cause and effect is the meaning of conditioned arising.",
        "source": "T16n0717_002:0841b22_1"
    },
    {
        "source_sentence": "種種因果品類別義是緣起義，因果更互相符順義是緣起義，因果決定無雜亂義是緣起義。",
        "translation": "The meaning of the various categories of causes and effects is the meaning of conditioned arising, the meaning of mutually consistent causes and results is the meaning of conditioned arising, and the meaning of cause and effect being determined without confusion is the meaning of conditioned ar",
        "source": "T16n0717_002:0841b24_2"
    },
    {
        "source_sentence": "如是應知緣起略義。」",
        "translation": "Thus, you should know the brief meaning of dependent arising.",
        "source": "T16n0717_002:0841b26_3"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0841b28_0"
    },
    {
        "source_sentence": "如餘經說，緣起甚深。",
        "translation": "As other sūtras say, conditioned arising is profound.",
        "source": "T16n0717_002:0841b28_1"
    },
    {
        "source_sentence": "云何應知如是緣起甚深之相？」",
        "translation": "How should we know the profound characteristic of such conditioned arising?",
        "source": "T16n0717_002:0841b28_2"
    },
    {
        "source_sentence": "世尊告曰：「即依十一緣起略義，應知緣起五甚深相。",
        "translation": "The Bhagavān told them, That is, according to the brief meaning of the eleven conditions for arising, you should know that there are five profound characteristics of conditioned arising.",
        "source": "T16n0717_002:0841b29_3"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T16n0717_002:0841c01_4"
    },
    {
        "source_sentence": "一因甚深、二相甚深、三生甚深、四差別甚深、五流轉甚深。",
        "translation": "1. the depth of cause, 2. the depth of characteristics, 3. the depth of arising, 4. the depth of distinctions, and 5. the depth of transmigration.",
        "source": "T16n0717_002:0841c01_5"
    },
    {
        "source_sentence": "應知緣起甚深之相，復有五種。",
        "translation": "You should know that there are five other profound characteristics of conditioned arising.",
        "source": "T16n0717_002:0841c03_6"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T16n0717_002:0841c04_0"
    },
    {
        "source_sentence": "謂相甚深、引發因果諸分甚深、生起因果諸分甚深、差別甚深、對治甚深。",
        "translation": "They are profound in characteristics, profound in the parts that give rise to causes and effects, profound in the parts that give rise to causes and effects, profound in distinctions, and profound in antidotes.",
        "source": "T16n0717_002:0841c04_1"
    },
    {
        "source_sentence": "應知緣起復有五種甚深之相。",
        "translation": "You should know that there are five other profound forms of conditioned arising.",
        "source": "T16n0717_002:0841c05_2"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T16n0717_002:0841c06_3"
    },
    {
        "source_sentence": "謂攝甚深、順次甚深、逆次甚深、執取甚深、所行甚深。",
        "translation": "They are the profundity of gathering, the profundity of following, the profundity of reverse order, the profundity of adherence, and the profundity of what's practiced.",
        "source": "T16n0717_002:0841c06_4"
    },
    {
        "source_sentence": "是名無明等起殊勝。」",
        "translation": "This is called the superiority of nescience and so forth that arises.",
        "source": "T16n0717_002:0841c08_5"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0841c09_0"
    },
    {
        "source_sentence": "云何無明轉異殊勝？」",
        "translation": "How is the transformation of nescience different and superior?",
        "source": "T16n0717_002:0841c09_1"
    },
    {
        "source_sentence": "世尊告曰：「略有四種轉異無明。",
        "translation": "The Bhagavān told them, There are slightly four kinds of transforming ignorance.",
        "source": "T16n0717_002:0841c09_2"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T16n0717_002:0841c10_3"
    },
    {
        "source_sentence": "一者隨眠轉異無明，二者纏縛轉異無明，三者相應轉異無明，四者不共轉異無明。」",
        "translation": "One, ignorance that's transformed by following dormancy, two, ignorance that's transformed by binding, three, ignorance that's transformed by association, and four, ignorance that's transformed by not being shared.",
        "source": "T16n0717_002:0841c10_4"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0841c12_5"
    },
    {
        "source_sentence": "誰有何等轉異無明，而說無明為緣生行？」",
        "translation": "Who has what kind of transformation that's different from ignorance and yet says that ignorance is the condition for producing actions?",
        "source": "T16n0717_002:0841c12_6"
    },
    {
        "source_sentence": "世尊告曰：「外法異生非理作意所引四種轉異無明，由此為緣，生福、非福及不動行。",
        "translation": "The Bhagavān told them, Four kinds of transforming ignorance that are unreasonable in terms of what's different from the external dharmas and aren't based on reasoned contemplation give rise to merit, non-merit, and",
        "source": "T16n0717_002:0841c13_7"
    },
    {
        "source_sentence": "如是所說外法異生所有福行及不動行相應善心，一切皆是非理作意所引等流。",
        "translation": "Thus, all the good mental states associated with the meritorious and immovable actions of ordinary people who teach external dharmas are all equally projected by non-rational contemplation.",
        "source": "T16n0717_002:0841c15_8"
    },
    {
        "source_sentence": "內法異生若放逸者，彼除一種不共無明，所餘無明引發放逸，為緣生行。",
        "translation": "exception made for one form of unique ignorance. The other ignorance that produces heedlessness is the condition as supporting object:",
        "source": "T16n0717_002:0841c17_9"
    },
    {
        "source_sentence": "內法異生若不放逸勤修學者及聖有學，三種無明引發妄念為非福緣，然此非福不能為緣招三惡趣。",
        "translation": "If there are ordinary people of the inner dharma who aren't careless and diligently cultivating and noble trainees, the three kinds of ignorance that give rise to deluded thoughts are not causes for goodness, but they aren't causes",
        "source": "T16n0717_002:0841c19_10"
    },
    {
        "source_sentence": "故此非福，我不說為無明緣行。",
        "translation": "Therefore, this is not merit. I do not say that it is conditioned by ignorance.",
        "source": "T16n0717_002:0841c21_11"
    },
    {
        "source_sentence": "如是所說不共無明，內法異生雖不放逸，而修學者亦未能斷，諸聖有學應知永斷。",
        "translation": "Thus, it's not common ignorance that's explained in this way, and even though ordinary people who are internal dharmas don't become careless, the cultivators can't stop it, but the noble ones and trainees should know",
        "source": "T16n0717_002:0841c22_12"
    },
    {
        "source_sentence": "又不放逸內法異生，若造福行及不動行，彼是正法如理作意，相應善心之所引發，",
        "translation": "Also, if there are ordinary people who aren't careless about internal dharmas and create meritorious actions or immovable actions, these are right teachings that are correctly contemplated, which are produced by the good mental states associated with them.",
        "source": "T16n0717_002:0841c24_0"
    },
    {
        "source_sentence": "解脫為依迴向解脫而引發故，雖於善趣感殊勝生，而非無明起增上緣，",
        "translation": "Deliverance is the support for dedication of liberation. Although it produces superior birth in a good destiny, it does not have ignorance as its dominant condition.",
        "source": "T16n0717_002:0841c25_1"
    },
    {
        "source_sentence": "然能作彼四種無明。",
        "translation": "However, they can create these four kinds of ignorance.",
        "source": "T16n0717_002:0841c27_2"
    },
    {
        "source_sentence": "斷增上緣諸聖有學，不共無明已永斷故，不造新業，所有故業由隨眠力未永斷滅，",
        "translation": "It eliminates the dominant conditioned dharmas of saints and learners, because they have permanently eliminated ignorance that is not common to them. They do not create new actions; old actions exist but are not eternally eliminated or destroyed by the power of",
        "source": "T16n0717_002:0841c28_0"
    },
    {
        "source_sentence": "暫觸還吐，如是所有無明緣行，生生漸滅不復增長。",
        "translation": "When they are touched and spit out again for a moment, the conditioned forces of ignorance that exist in this way give rise to birth and gradually cease and no longer grow.",
        "source": "T16n0717_002:0841c29_1"
    },
    {
        "source_sentence": "由此道理，應知內法諸有學者，不緣無明更造諸行。",
        "translation": "Because of this reasoning, you should know that there are scholars who study internal dharmas but don't create other practices based on ignorance.",
        "source": "T16n0717_002:0842a02_2"
    },
    {
        "source_sentence": "是故惟依外法異生，我說順次雜染緣起，最極圓滿，非住內法，是名無明轉異殊勝。」",
        "translation": "Therefore, it's only dependent on external dharmas that are differently produced, and I say that following defiled conditioned arising in sequence is the most extremely perfect, not abiding in internal dharmas, which is called the superiority of the",
        "source": "T16n0717_002:0842a03_3"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842a06_0"
    },
    {
        "source_sentence": "云何無明邪行殊勝？」",
        "translation": "How are the mistaken practices of nescience superior?",
        "source": "T16n0717_002:0842a06_1"
    },
    {
        "source_sentence": "世尊告曰：「彼四無明，於諸諦中皆能發起增益、損減二種邪行。」",
        "translation": "The Bhagavān told them, These four kinds of nescience can all give rise to two kinds of wrong actions in the noble truths that are gaining and losing.",
        "source": "T16n0717_002:0842a06_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842a08_3"
    },
    {
        "source_sentence": "如何名為增益、損減二種邪行？」",
        "translation": "What are the two kinds of wrong actions called gaining and losing?",
        "source": "T16n0717_002:0842a08_4"
    },
    {
        "source_sentence": "世尊告曰：「由四顛倒，謂於非法見為是法，或於是法見為非法，或於生天解脫道中非方便者見是方便，",
        "translation": "The World-honored One said: It is because of four kinds of perversion, that is, when one holds to what is unlawful as the true doctrine, or when he holds to what is unlawful in regard to this doctrine",
        "source": "T16n0717_002:0842a09_5"
    },
    {
        "source_sentence": "是方便者見非方便，如是名為增益邪行；",
        "translation": "Those who are skillful in means see what is not skillful. This is to be called ‘enhancing wrong conduct’.",
        "source": "T16n0717_002:0842a11_6"
    },
    {
        "source_sentence": "諸有誹謗、一切邪見，如是名為損減邪行。",
        "translation": "Anyone who denigrates and holds all kinds of wrong views in this way is said to be engaging in a wrong practice that undermines righteousness.",
        "source": "T16n0717_002:0842a12_7"
    },
    {
        "source_sentence": "是名無明邪行殊勝。」",
        "translation": "This is called the superiority of ignorance and wrong practices.",
        "source": "T16n0717_002:0842a13_8"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842a14_0"
    },
    {
        "source_sentence": "云何無明相狀殊勝？」",
        "translation": "How is the characteristic of nescience superior?",
        "source": "T16n0717_002:0842a14_1"
    },
    {
        "source_sentence": "世尊告曰：「應知無明有二種相：一者微細自相殊勝，二者遍於可愛非愛俱非境界共相殊勝。",
        "translation": "The Bhagavān told them, You should know that there are two kinds of characteristics of nescience: one, superiority in subtle distinctive characteristics, and two, superiority in common characteristics pervading both desirable and unde",
        "source": "T16n0717_002:0842a14_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T16n0717_002:0842a16_3"
    },
    {
        "source_sentence": "纏縛無明尚為微細難知難了，況彼所有隨眠無明；",
        "translation": "The binding ignorance is still subtle, difficult to know and difficult to understand. How much the more so the ignorance that accompanies its latent dormancy!",
        "source": "T16n0717_002:0842a17_4"
    },
    {
        "source_sentence": "相應無明尚為微細難知難了，況彼所有不共無明。",
        "translation": "Concomitant ignorance is still subtle and difficult to know and difficult to understand, so why wouldn't it be the case that they have uncommon ignorance?",
        "source": "T16n0717_002:0842a18_5"
    },
    {
        "source_sentence": "遍於一切可愛、非愛、俱非境界，覆真實相顯虛妄相，共相而轉非餘煩惱，",
        "translation": "Pervading all objects that are desirable, undesirable, and neither desirable nor undesirable, they conceal true characteristics and show false characteristics. They develop common characteristics but not other afflictions.",
        "source": "T16n0717_002:0842a19_6"
    },
    {
        "source_sentence": "有如是相，是故殊勝。",
        "translation": "Because they have such characteristics, they're therefore superior.",
        "source": "T16n0717_002:0842a21_7"
    },
    {
        "source_sentence": "餘身見等共相煩惱，亦用無明為依而轉，是名無明相狀殊勝。」",
        "translation": "The other common characteristics of the afflictions of body views and so forth that also use nescience as their basis and develop, this is called the superiority of the characteristics and marks of nescience.",
        "source": "T16n0717_002:0842a21_8"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842a23_0"
    },
    {
        "source_sentence": "云何無明作業殊勝？」",
        "translation": "How is the activity of nescience superior?",
        "source": "T16n0717_002:0842a23_1"
    },
    {
        "source_sentence": "世尊告曰：「應知無明略有二種所作事業：一者無明普能造作一切流轉所依事業，",
        "translation": "“World-honored One, it should be known that ignorance is of two kinds:",
        "source": "T16n0717_002:0842a23_2"
    },
    {
        "source_sentence": "二者無明普能造作一切寂止能障事業。」",
        "translation": "The second is that nescience universally creates all the activities that are capable of obstructing tranquility.",
        "source": "T16n0717_002:0842a25_3"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842a26_4"
    },
    {
        "source_sentence": "何等名為一切流轉？」",
        "translation": "What's called all the transmigration?",
        "source": "T16n0717_002:0842a26_5"
    },
    {
        "source_sentence": "世尊告曰：「若是處轉、若是事轉、若如是轉，我總說為一切流轉。」",
        "translation": "The Bhagavān told them, If there's a place to turn, if there's a thing to turn, or if there's a thing to turn, I'll generally say that it's all the way around.",
        "source": "T16n0717_002:0842a27_6"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842a28_7"
    },
    {
        "source_sentence": "是何處轉？」",
        "translation": "Where does it come from?",
        "source": "T16n0717_002:0842a28_8"
    },
    {
        "source_sentence": "世尊告曰：「於三世處由我分別。」",
        "translation": "The Bhagavān told him, In the three worldly places, it's because of self that they're discriminated.",
        "source": "T16n0717_002:0842a29_9"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842a29_10"
    },
    {
        "source_sentence": "是何事轉？」",
        "translation": "What is the matter that's transformed?",
        "source": "T16n0717_002:0842b01_11"
    },
    {
        "source_sentence": "世尊告曰：「內外六處由我取執。」",
        "translation": "The Bhagavān told them, The six internal and external sense-fields are grasped by self.",
        "source": "T16n0717_002:0842b01_12"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842b02_13"
    },
    {
        "source_sentence": "云何而轉？」",
        "translation": "How does it come about?",
        "source": "T16n0717_002:0842b02_14"
    },
    {
        "source_sentence": "世尊告曰：「諸業異熟相續流轉，由我分別、由邪分別。」",
        "translation": "The Bhagavān told them, The karmic retribution continues to flow because of self discrimination and mistaken discrimination.",
        "source": "T16n0717_002:0842b02_15"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842b03_16"
    },
    {
        "source_sentence": "云何名為一切寂止？」",
        "translation": "What's called all quiescence?",
        "source": "T16n0717_002:0842b04_17"
    },
    {
        "source_sentence": "世尊告曰：「一切寂止略有四種：一者寂止所依、二者寂止所緣、三者寂止作意、四者寂止果成，",
        "translation": "The World-honored One said: There are, in sum, four kinds of tranquility. The first is the support for quiescence; the second is the object of quiescence; the third is the attention generated by quiescence; and the fourth",
        "source": "T16n0717_002:0842b04_18"
    },
    {
        "source_sentence": "是名無明作業殊勝。」",
        "translation": "This is called the superiority of the activity of nescience.",
        "source": "T16n0717_002:0842b06_19"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842b08_0"
    },
    {
        "source_sentence": "云何無明障礙殊勝？」",
        "translation": "How is the obstacle of ignorance superior?",
        "source": "T16n0717_002:0842b08_1"
    },
    {
        "source_sentence": "世尊告曰：「應知無明障礙勝法、障礙廣法。」",
        "translation": "The Bhagavān told them, You should know that ignorance hinders the superior teaching and hinders the extensive teaching.",
        "source": "T16n0717_002:0842b08_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842b09_3"
    },
    {
        "source_sentence": "如何無明障礙勝法？」",
        "translation": "How is the superior dharma that's hindered by ignorance?",
        "source": "T16n0717_002:0842b09_4"
    },
    {
        "source_sentence": "世尊告曰：「言勝法者，能攝五根令其和合，所謂慧根，障礙此者即是無明，",
        "translation": "The World-honored One said: “When it comes to the supreme doctrine, that which encompasses the five faculties and causes them to be harmonized is what is known as the faculty of wisdom.",
        "source": "T16n0717_002:0842b10_5"
    },
    {
        "source_sentence": "是故說名障礙勝法。」",
        "translation": "That's why it's called the superior teaching of obstruction.",
        "source": "T16n0717_002:0842b12_6"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842b12_7"
    },
    {
        "source_sentence": "如何無明障礙廣法？」",
        "translation": "How does ignorance obstruct the extensive teaching?",
        "source": "T16n0717_002:0842b12_8"
    },
    {
        "source_sentence": "世尊告曰：「言廣法者，聞所成智、思所成智、修所成智，障礙此者即是無明，",
        "translation": "The World-honored One said: Whatever speaks of the “extensive doctrine”—the wisdom that is attained through hearing, the wisdom that is attained through reflection, and the wisdom that is attained through meditation—that which is obscured",
        "source": "T16n0717_002:0842b13_9"
    },
    {
        "source_sentence": "是故說名障礙廣法。」",
        "translation": "That's why it's called an obstruction to the extensive teaching.",
        "source": "T16n0717_002:0842b15_10"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842b15_11"
    },
    {
        "source_sentence": "如說無智名為無明，此唯智無名無明耶？」",
        "translation": "As it's said that lack of knowledge is called ignorance, is this only knowledge and nothing called ignorance?",
        "source": "T16n0717_002:0842b15_12"
    },
    {
        "source_sentence": "世尊告曰：「非唯智無名為無明。」",
        "translation": "The Bhagavān told them, It's not just that cognition is called ignorance without name.",
        "source": "T16n0717_002:0842b16_13"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842b17_14"
    },
    {
        "source_sentence": "若唯智無名為無明，斯有何過？」",
        "translation": "If only cognition is called ignorance if it's not called ignorance, what's wrong with that?",
        "source": "T16n0717_002:0842b17_15"
    },
    {
        "source_sentence": "世尊告曰：「若爾，無明應不可立決定體相。",
        "translation": "The Bhagavān told them, If that's the case, then ignorance shouldn't establish a definite essence or characteristic.",
        "source": "T16n0717_002:0842b18_16"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T16n0717_002:0842b19_17"
    },
    {
        "source_sentence": "聞所成智體上，無有思所成智；",
        "translation": "In the essence of the knowledge which is attained through hearing, there is no knowledge which is attained through thought.",
        "source": "T16n0717_002:0842b19_18"
    },
    {
        "source_sentence": "思所成智體上，無有修所成智；",
        "translation": "In the realm of knowledge resulting from reflection, there is no knowledge that can be cultivated.",
        "source": "T16n0717_002:0842b20_19"
    },
    {
        "source_sentence": "一切世間修所成智體上，無有一切出世修所成智；",
        "translation": "On the essence of knowledge cultivated in all worlds, there is no knowledge cultivated in all supramundane practices.",
        "source": "T16n0717_002:0842b21_20"
    },
    {
        "source_sentence": "出世有學智上，無有諸無學智；",
        "translation": "In the supramundane wisdom of those who are still learning, there is no higher wisdom than that of those who have no more learning to do.",
        "source": "T16n0717_002:0842b22_21"
    },
    {
        "source_sentence": "無學聲聞智上，無有如來等智。",
        "translation": "Above the wisdom of post learners and śrāvakas, there's no such wisdom as the Tathāgata.",
        "source": "T16n0717_002:0842b23_22"
    },
    {
        "source_sentence": "若如是者，應即是智即是無智，如是無明應不可立決定體相。",
        "translation": "If this were so, it would mean that cognition is noncognisance, and such ignorance would not be able to establish a definite essence or characteristic.",
        "source": "T16n0717_002:0842b23_23"
    },
    {
        "source_sentence": "又我於彼三善根中，說有無癡，應但癡無說名無癡，然非癡無說名無癡，",
        "translation": "Furthermore, I declare that the absence of delusion exists in these three roots of goodness. It should be stated that non-delusion is only called non-delusion because it does not mean non-delusion.",
        "source": "T16n0717_002:0842b25_24"
    },
    {
        "source_sentence": "故非明無說名無明，而別有一心所有法，不知真實說名無明。",
        "translation": "Therefore, it's not that ignorance is called nescience without explanation, but there's another mind that has dharmas that are distinct and doesn't really know that they're called nescience without true explanation.",
        "source": "T16n0717_002:0842b27_0"
    },
    {
        "source_sentence": "如別有一心所有法，了知真實說名為智，又唯明無名無明者，應無如是一切無明十一殊勝。",
        "translation": "If there's another mind that has all the dharmas that exist in a separate mind and understands them as real and calls them cognition, and only explains nameless ignorance, then there should be no such one of these 11 distinctive characteristics of",
        "source": "T16n0717_002:0842b28_1"
    },
    {
        "source_sentence": "是故應知，非唯明無說名無明，是名無明障礙殊勝。」",
        "translation": "Therefore, you should know that it's not only the ignorance of explanation that's called ignorance, which is called the superiority of the hindrance of ignorance.",
        "source": "T16n0717_002:0842c01_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842c03_0"
    },
    {
        "source_sentence": "云何無明隨縛殊勝？」",
        "translation": "How are the latent bonds of nescience superior?",
        "source": "T16n0717_002:0842c03_1"
    },
    {
        "source_sentence": "世尊告曰：「乃至有頂三界有情，於諸諦中所有無智隨眠隨縛未缺未減，",
        "translation": "The Bhagavān told them, Up to sentient beings in the three realms at the top of existence have ignorance, latencies, and fetters in the truths that are not absent or diminished.",
        "source": "T16n0717_002:0842c03_2"
    },
    {
        "source_sentence": "由彼有情說名具縛。",
        "translation": "It's because sentient beings say it's called the full set of fetters.",
        "source": "T16n0717_002:0842c05_3"
    },
    {
        "source_sentence": "又此無智，善趣惡趣因果差別，無色有情有其下品，色界有情有其中品，",
        "translation": "Furthermore, it does not know the differences of causes and results of good and bad destinies. Sentient beings in Ārūpyadhātu have lower classes; sentient beings in Rūpadhātu have middle classes.",
        "source": "T16n0717_002:0842c05_4"
    },
    {
        "source_sentence": "欲界有情有其上品，如是成就三品無明。",
        "translation": "Sentient beings in the realm of sexual passion have these higher classes. In this way, three classes of ignorance are accomplished:",
        "source": "T16n0717_002:0842c07_5"
    },
    {
        "source_sentence": "諸有情類當來可生，一一法爾三品隨縛。",
        "translation": "Sentient beings will be born in the future, and each one of them will be bound by these three kinds of fetters according to their dharma.",
        "source": "T16n0717_002:0842c08_6"
    },
    {
        "source_sentence": "此說異生，若諸聖者漸次永斷，若具上中定有中下，或有中下而無上中。",
        "translation": "This is said to be an ordinary person. If the noble ones gradually and eternally abandon it one after another, then if they are endowed with a higher middle existence, there must be a lower middle existence; or if there is a lower middle",
        "source": "T16n0717_002:0842c09_7"
    },
    {
        "source_sentence": "又阿羅漢，雖盡諸漏脫煩惱障，應知尚有所知障攝無明隨縛，如是無明，",
        "translation": "Also, even though an arhat has ended the contaminants and liberated himself from the afflictive hindrances, you should know that there are still cognitive hindrances that subsume the derivative bonds of ignorance, such as ignorance.",
        "source": "T16n0717_002:0842c11_0"
    },
    {
        "source_sentence": "應知極遠隨逐有情，唯除諸佛餘皆隨縛。",
        "translation": "You should know that it's extremely distant and follows sentient beings, except for the buddhas, who are all bound by them.",
        "source": "T16n0717_002:0842c12_1"
    },
    {
        "source_sentence": "是名無明隨縛殊勝。」",
        "translation": "This is called the superiority of being bound by ignorance.",
        "source": "T16n0717_002:0842c13_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842c14_3"
    },
    {
        "source_sentence": "云何無明對治殊勝？」",
        "translation": "How is the antidote of nescience superior?",
        "source": "T16n0717_002:0842c14_4"
    },
    {
        "source_sentence": "世尊告曰：「有二妙智對治無明。",
        "translation": "The Bhagavān told them, There are two kinds of marvelous wisdom that counteract ignorance.",
        "source": "T16n0717_002:0842c14_5"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T16n0717_002:0842c15_6"
    },
    {
        "source_sentence": "一依他音，或不依止少分有量法界妙智；",
        "translation": "The first is to rely on the voice of others, sometimes relying on a subtle knowledge that does not rely on even a small part of the subtle knowledge of the cosmos of reality.",
        "source": "T16n0717_002:0842c15_7"
    },
    {
        "source_sentence": "二依他音，全分無量法界妙智。」",
        "translation": "The second relies on the sounds of others, which are all part of the marvelous wisdom of the immeasurable Dharma realm.",
        "source": "T16n0717_002:0842c16_8"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842c18_0"
    },
    {
        "source_sentence": "少分有量法界妙智，為何所緣？",
        "translation": "What's the reason for the marvelous knowledge of a small part of the Dharma realm that's measured by the Dharma realm?",
        "source": "T16n0717_002:0842c18_1"
    },
    {
        "source_sentence": "有何行相？",
        "translation": "What are the characteristics of conditioned states?",
        "source": "T16n0717_002:0842c18_2"
    },
    {
        "source_sentence": "作何事業？」",
        "translation": "What's the work to be done?",
        "source": "T16n0717_002:0842c19_3"
    },
    {
        "source_sentence": "世尊告曰：「少分有量法界妙智，緣四聖諦十六行相，作無明等煩惱業，",
        "translation": "The Bhagavān told them, “Some of the marvelous knowledge of the Dharma realm has as its object the sixteen defining activities of the four noble truths and creates afflictive karma like ignorance.",
        "source": "T16n0717_002:0842c19_4"
    },
    {
        "source_sentence": "生一切雜染離繫事業。」",
        "translation": "They give rise to all the defiled and unfettered works.",
        "source": "T16n0717_002:0842c21_5"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842c22_0"
    },
    {
        "source_sentence": "云何應知生苦之相？」",
        "translation": "How should we know the mark of suffering that arises?",
        "source": "T16n0717_002:0842c22_1"
    },
    {
        "source_sentence": "世尊告曰：「是內緣苦所依性故，是外緣苦所依性故，是俱緣苦所依性故。」",
        "translation": "The Bhagavān told them, It's because it's the nature that relies on internal conditions for suffering and the nature that relies on external conditions for suffering and the nature that relies on both conditions for suffering.",
        "source": "T16n0717_002:0842c22_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842c24_3"
    },
    {
        "source_sentence": "內緣苦者其相云何？」",
        "translation": "What's the characteristic of internally conditioned suffering?",
        "source": "T16n0717_002:0842c24_4"
    },
    {
        "source_sentence": "世尊告曰：「所謂病苦、老苦、死苦。」",
        "translation": "The Bhagavān told them, It's called the suffering of illness, the suffering of old age, and the suffering of death.",
        "source": "T16n0717_002:0842c25_5"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842c25_6"
    },
    {
        "source_sentence": "外緣苦者其相云何？」",
        "translation": "What's the characteristic of someone who suffers from external conditions?",
        "source": "T16n0717_002:0842c26_7"
    },
    {
        "source_sentence": "世尊告曰：「非愛和合、所愛別離、求不得苦。」",
        "translation": "The Bhagavān told them, What's not loved is combined, what's loved is separated, and it's painful to be unable to seek.",
        "source": "T16n0717_002:0842c26_8"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842c27_9"
    },
    {
        "source_sentence": "俱緣苦者其相云何？」",
        "translation": "What are the characteristics of those who have both causes and conditions for suffering?",
        "source": "T16n0717_002:0842c27_10"
    },
    {
        "source_sentence": "世尊告曰：「所謂略說五取蘊苦。」",
        "translation": "The Bhagavān told them, It's called briefly explaining the suffering of the five appropriated aggregates.",
        "source": "T16n0717_002:0842c28_11"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0842c29_0"
    },
    {
        "source_sentence": "云何名愛？」",
        "translation": "What is called craving?",
        "source": "T16n0717_002:0842c29_1"
    },
    {
        "source_sentence": "世尊告曰：「謂於現在自體貪著。」",
        "translation": "The Bhagavān told him, It's craving for the present self-nature.",
        "source": "T16n0717_002:0842c29_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a01_3"
    },
    {
        "source_sentence": "後有愛者其相云何？」",
        "translation": "What are the characteristics of those who later have craving?",
        "source": "T16n0717_002:0843a01_4"
    },
    {
        "source_sentence": "世尊告曰：「謂於未來自體希求。」",
        "translation": "The Bhagavān told them, It means to long for their own essence in the future.",
        "source": "T16n0717_002:0843a01_5"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a02_6"
    },
    {
        "source_sentence": "云何憙貪俱行愛耶？」",
        "translation": "What's the craving that's accompanied by anger and greed?",
        "source": "T16n0717_002:0843a02_7"
    },
    {
        "source_sentence": "世尊告曰：「謂於已得攝受資財現前境界，深生味著。」",
        "translation": "The Bhagavān told them, It means that they're deeply attached to the present realm of accumulating their possessions after they've been acquired.",
        "source": "T16n0717_002:0843a03_8"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a04_9"
    },
    {
        "source_sentence": "云何名為彼彼憙愛？」",
        "translation": "What's called that or that crude love?",
        "source": "T16n0717_002:0843a04_10"
    },
    {
        "source_sentence": "世尊告曰：「謂於未得攝受資財非現境界，種種追求。」",
        "translation": "The Bhagavān told him, It means to pursue various kinds of pursuing possessions that haven't yet been obtained and aren't in the present realm.",
        "source": "T16n0717_002:0843a05_11"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a07_0"
    },
    {
        "source_sentence": "云何此愛永斷無餘？」",
        "translation": "How is this craving permanently eliminated without remainder?",
        "source": "T16n0717_002:0843a07_1"
    },
    {
        "source_sentence": "世尊告曰：「見修所斷煩惱斷故，下分上分諸結斷故，畢竟斷故，未來苦果諸愛斷故，",
        "translation": "The World-honored One said: Because the defilements to be abandoned through insight and through cultivation are abandoned, because the lower and higher fetters are abandoned, because they are absolutely abandoned, and because the cravings as future fruits of suffering",
        "source": "T16n0717_002:0843a07_2"
    },
    {
        "source_sentence": "現在苦果諸愛斷故，是名此愛無餘永斷。」",
        "translation": "Because the cravings for the present painful fruit of suffering have been stopped, this is called the permanent cessation of these cravings without remainder.",
        "source": "T16n0717_002:0843a09_3"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a10_4"
    },
    {
        "source_sentence": "云何棄捨？」",
        "translation": "How do you abandon it?",
        "source": "T16n0717_002:0843a10_5"
    },
    {
        "source_sentence": "世尊告曰：「諸見所斷煩惱斷故。」",
        "translation": "The Bhagavān told them, It's because the afflictions that are stopped by views are stopped.",
        "source": "T16n0717_002:0843a11_6"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a11_7"
    },
    {
        "source_sentence": "云何變吐？」",
        "translation": "How does it change and spit out?",
        "source": "T16n0717_002:0843a12_8"
    },
    {
        "source_sentence": "世尊告曰：「諸修所斷煩惱斷故。」",
        "translation": "The Bhagavān told them, It's because the afflictions that are cultivated and stopped by cultivation are stopped.",
        "source": "T16n0717_002:0843a12_9"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a13_10"
    },
    {
        "source_sentence": "云何永盡？」",
        "translation": "How will it be permanently exhausted?",
        "source": "T16n0717_002:0843a13_11"
    },
    {
        "source_sentence": "世尊告曰：「諸下分結已永斷故。」",
        "translation": "The Bhagavān told them, It's because the lower bonds have been permanently eliminated.",
        "source": "T16n0717_002:0843a13_12"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a14_13"
    },
    {
        "source_sentence": "云何遠離？」",
        "translation": "How are they far removed?",
        "source": "T16n0717_002:0843a14_14"
    },
    {
        "source_sentence": "世尊告曰：「諸上分結已永斷故。」",
        "translation": "The Bhagavān told them, It's because the higher bonds have been permanently eliminated.",
        "source": "T16n0717_002:0843a14_15"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a15_16"
    },
    {
        "source_sentence": "云何永滅？」",
        "translation": "How is it permanently extinguished?",
        "source": "T16n0717_002:0843a15_17"
    },
    {
        "source_sentence": "世尊告曰：「畢竟斷故。」",
        "translation": "The Bhagavān told him, It's because it's ultimately stopped.",
        "source": "T16n0717_002:0843a16_18"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a16_19"
    },
    {
        "source_sentence": "云何寂靜？」",
        "translation": "What is quiescence?",
        "source": "T16n0717_002:0843a16_20"
    },
    {
        "source_sentence": "世尊告曰：「未來苦果愛永斷故。」",
        "translation": "The Bhagavān told them, It's because craving for the future painful fruit of suffering will be permanently stopped.",
        "source": "T16n0717_002:0843a17_21"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a17_22"
    },
    {
        "source_sentence": "云何隱沒？」",
        "translation": "How is it concealed?",
        "source": "T16n0717_002:0843a18_23"
    },
    {
        "source_sentence": "世尊告曰：「現在苦果愛永斷故。」",
        "translation": "The Bhagavān told them, It's because the craving for suffering as a result of present suffering is permanently stopped.",
        "source": "T16n0717_002:0843a18_24"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a20_0"
    },
    {
        "source_sentence": "云何正見？」",
        "translation": "What's right view?",
        "source": "T16n0717_002:0843a20_1"
    },
    {
        "source_sentence": "世尊告曰：「所謂現觀前方便慧，正現觀慧，及與現觀後所得慧，超越所知方便聖教諸邪解行。」",
        "translation": "The Bhagavān told them, It's called the wisdom of skillful means prior to clear observation, the wisdom of correctly clear observation, and the wisdom gained after clear observation that transcends the mistaken understanding practices of the noble teachings of knowables",
        "source": "T16n0717_002:0843a20_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a22_3"
    },
    {
        "source_sentence": "云何正思？」",
        "translation": "What is right thought?",
        "source": "T16n0717_002:0843a22_4"
    },
    {
        "source_sentence": "世尊告曰：「謂於三寶已得證淨，為所依止，於彼功德隨念思惟，超越歸依外道師等。」",
        "translation": "The Bhagavān told them, It means that after realizing the purity of the Three Treasures, they are the basis for those who rely on them and contemplate their merits with mindfulness, transcending the refuge of non-Buddhist teachers and so for",
        "source": "T16n0717_002:0843a23_5"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a25_6"
    },
    {
        "source_sentence": "云何正語？」",
        "translation": "What's right speech?",
        "source": "T16n0717_002:0843a25_7"
    },
    {
        "source_sentence": "世尊告曰：「謂聖所愛無漏戒攝，無漏作意同時而轉，於四語業能正遠離，",
        "translation": "The Bhagavān addressed them, saying: “The pure morality that is cherished by the Āryans consists of uncontaminated attention that proceeds at the same time.",
        "source": "T16n0717_002:0843a25_8"
    },
    {
        "source_sentence": "超越一切諸險惡趣。」",
        "translation": "They'll transcend all the dangerous and bad destinies.",
        "source": "T16n0717_002:0843a27_9"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843a27_10"
    },
    {
        "source_sentence": "云何正業？」",
        "translation": "What's right action?",
        "source": "T16n0717_002:0843a27_11"
    },
    {
        "source_sentence": "世尊告曰：「謂聖所愛無漏戒攝，無漏作意同時而轉，於三身業能正遠離，",
        "translation": "The World-honored One said: “The pure morality that is cherished by the Āryans consists of uncontaminated attention at the same time.",
        "source": "T16n0717_002:0843a28_12"
    },
    {
        "source_sentence": "超越一切諸險惡趣。」",
        "translation": "They'll transcend all the dangerous and bad destinies.",
        "source": "T16n0717_002:0843a29_13"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843b01_14"
    },
    {
        "source_sentence": "云何正命？」",
        "translation": "What is right livelihood?",
        "source": "T16n0717_002:0843b01_15"
    },
    {
        "source_sentence": "世尊告曰：「謂聖所愛無漏戒攝，無漏作意同時而轉，於邪命趣身語二業能正遠離，",
        "translation": "The World-honored One said: “The pure morality that is cherished by the Āryans consists of uncontaminated action, which is accompanied at the same time by uncontaminated attention.",
        "source": "T16n0717_002:0843b01_16"
    },
    {
        "source_sentence": "超越一切諸險惡趣。」",
        "translation": "They'll transcend all the dangerous and bad destinies.",
        "source": "T16n0717_002:0843b03_17"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843b04_18"
    },
    {
        "source_sentence": "云何正勤？」",
        "translation": "What is right effort?",
        "source": "T16n0717_002:0843b04_19"
    },
    {
        "source_sentence": "世尊告曰：「於上解脫欲樂為依，發勤精進遠離障礙，圓滿對治。」",
        "translation": "The Bhagavān told him, Relying on the desire for liberation above, he arouses diligent effort that's free of obstruction and completely counteracts it.",
        "source": "T16n0717_002:0843b04_20"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843b06_21"
    },
    {
        "source_sentence": "云何正念？」",
        "translation": "What is right mindfulness?",
        "source": "T16n0717_002:0843b06_22"
    },
    {
        "source_sentence": "世尊告曰：「勤修止觀諸瑜伽師依止三相，時時於彼三種相中及不放逸，",
        "translation": "The Bhagavān told them, Those yogis who diligently cultivate calmness and contemplation rely on the three characteristics, and from time to time they're in those three characteristics and don't become careless.",
        "source": "T16n0717_002:0843b06_23"
    },
    {
        "source_sentence": "俱行境界心現明記，超越遠離修道加行。」",
        "translation": "The mind that's manifested in the sphere of both practices is clearly remembered, transcending and far removed from the applied practices of cultivation.",
        "source": "T16n0717_002:0843b08_24"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843b09_25"
    },
    {
        "source_sentence": "云何正定？」",
        "translation": "What is right concentration?",
        "source": "T16n0717_002:0843b09_26"
    },
    {
        "source_sentence": "世尊告曰：「謂由如是七種定具，資助瑩飾心一境性，乃至能作如是七支勝進依止，",
        "translation": "The World-honored One said: By means of these seven kinds of equipoise, the mind is adorned with a single object that serves as its support.",
        "source": "T16n0717_002:0843b09_27"
    },
    {
        "source_sentence": "及與引發殊勝功德作所依止。」",
        "translation": "They give rise to extraordinary merits that serve as their support.",
        "source": "T16n0717_002:0843b11_28"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843b12_29"
    },
    {
        "source_sentence": "所有一切四念住等菩提分法，皆聖道攝，何緣唯說八聖道支以為道諦？」",
        "translation": "All the fourfold abode of mindfulness and all the other factors of enlightenment are included in the noble path, so why is it that only the eight noble factors of the path are described as the truth of the path?",
        "source": "T16n0717_002:0843b12_30"
    },
    {
        "source_sentence": "世尊告曰：「如是所言八聖道支，普攝一切菩提分法。」",
        "translation": "The Bhagavān told them, Thus are the eight noble factors of the path that are called these, which universally embrace all the factors of enlightenment.",
        "source": "T16n0717_002:0843b14_31"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843b15_32"
    },
    {
        "source_sentence": "於苦諦中有四行相，云何初名無常行相？」",
        "translation": "In the truth of suffering, there are four defining activities, so how is the first one called impermanent defining activity?",
        "source": "T16n0717_002:0843b15_33"
    },
    {
        "source_sentence": "「謂於苦諦生滅法性，正觀行相。」",
        "translation": "It means that in the truth of suffering's arising and ceasing Dharma nature, he correctly observes the characteristics of volition.",
        "source": "T16n0717_002:0843b16_34"
    },
    {
        "source_sentence": "「云何第二名苦行相？」",
        "translation": "What's the second name for the characteristic of ascetic practice?",
        "source": "T16n0717_002:0843b17_35"
    },
    {
        "source_sentence": "「謂於苦諦，即以生滅法性為依，於三種苦隨逐法性正觀行相。」",
        "translation": "It means that in the noble truth of suffering, the Dharma nature of arising and ceasing is the basis, and the Dharma nature of following the three kinds of suffering correctly observes the characteristics of practice.",
        "source": "T16n0717_002:0843b18_36"
    },
    {
        "source_sentence": "「云何第三名空行相？」",
        "translation": "What's the third aspect of practice called emptiness?",
        "source": "T16n0717_002:0843b19_37"
    },
    {
        "source_sentence": "「謂於苦諦離實我性，正觀行相。」",
        "translation": "It means that in the truth of suffering, he's free of the true self-nature and correctly observes the characteristics of practice.",
        "source": "T16n0717_002:0843b19_38"
    },
    {
        "source_sentence": "「云何第四無我行相？」",
        "translation": "What's the fourth mark of selflessness in terms of practice?",
        "source": "T16n0717_002:0843b20_39"
    },
    {
        "source_sentence": "「謂於苦諦非我相性，正觀行相。」",
        "translation": "It means that in the no-essence of selflessness in the truth of suffering, he correctly observes the characteristics of volition.",
        "source": "T16n0717_002:0843b21_40"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843b22_0"
    },
    {
        "source_sentence": "於集諦中有四行相，云何第一名因行相？」",
        "translation": "In the noble truth of accumulation, there are four defining activities, so what is the first one called the defining activity of cause?",
        "source": "T16n0717_002:0843b22_1"
    },
    {
        "source_sentence": "「謂於能植眾苦種子因緣愛中，正觀行相。」",
        "translation": "It means to correctly contemplate the characteristics of practice in the causal conditioned love that plants the seeds of suffering.",
        "source": "T16n0717_002:0843b23_2"
    },
    {
        "source_sentence": "「云何第二名集行相？」",
        "translation": "What's the second name for the characteristic of gathering practice?",
        "source": "T16n0717_002:0843b24_3"
    },
    {
        "source_sentence": "「謂於續起因緣愛中，正觀行相。」",
        "translation": "It means to correctly contemplate the characteristics of volition in the context of continuing craving for causes and conditions.",
        "source": "T16n0717_002:0843b24_4"
    },
    {
        "source_sentence": "「云何第三名生行相？」",
        "translation": "What's the third name that gives rise to the mark of practice?",
        "source": "T16n0717_002:0843b25_5"
    },
    {
        "source_sentence": "「謂於五趣差別生起因緣愛中，正觀行相。」",
        "translation": "It means to correctly contemplate the characteristics of practice among the causes and conditions that arise from the distinctions in the five destinies.",
        "source": "T16n0717_002:0843b25_6"
    },
    {
        "source_sentence": "「云何第四名緣行相？」",
        "translation": "What is the fourth name that refers to the mark of conditioned action?",
        "source": "T16n0717_002:0843b26_7"
    },
    {
        "source_sentence": "「謂於能作餘緣引發因緣愛中，正觀行相。」",
        "translation": "It means to correctly contemplate the characteristics of practice in the causes and conditions that give rise to desire for what's capable of creating other conditions.",
        "source": "T16n0717_002:0843b27_8"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843b29_0"
    },
    {
        "source_sentence": "於滅諦中有四行相，云何第一名滅行相？」",
        "translation": "In the truth of cessation, there are four defining activities, so how is the first called the defining activity of cessation?",
        "source": "T16n0717_002:0843b29_1"
    },
    {
        "source_sentence": "「謂於永斷煩惱滅中，正觀行相。」",
        "translation": "It means to correctly observe the characteristics of practice in the cessation of permanently eliminating afflictions.",
        "source": "T16n0717_002:0843c01_2"
    },
    {
        "source_sentence": "「云何第二名靜行相？」",
        "translation": "What's the second name for the characteristic of quiet practice?",
        "source": "T16n0717_002:0843c01_3"
    },
    {
        "source_sentence": "「謂於永斷眾苦靜中，正觀行相。」",
        "translation": "It means to correctly contemplate the characteristics of practice in the eternally eliminating state of suffering and quiescence.",
        "source": "T16n0717_002:0843c02_4"
    },
    {
        "source_sentence": "「云何第三名妙行相？」",
        "translation": "What's the third name for the mark of marvelous practice?",
        "source": "T16n0717_002:0843c03_5"
    },
    {
        "source_sentence": "「謂於永斷無罪清淨安樂性中，正觀行相。」",
        "translation": "It means to correctly observe the characteristics of practice in the pure and peaceful nature of permanently eliminating blamelessness.",
        "source": "T16n0717_002:0843c03_6"
    },
    {
        "source_sentence": "「云何第四名離行相？」",
        "translation": "What's the fourth name that's free of the mark of practice?",
        "source": "T16n0717_002:0843c04_7"
    },
    {
        "source_sentence": "「謂於永斷常住性中，正觀行相。」",
        "translation": "It means that in the nature of permanently eliminating eternally abiding, he correctly observes the characteristics of practice.",
        "source": "T16n0717_002:0843c05_0"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843c06_0"
    },
    {
        "source_sentence": "於道諦中有四行相，云何第一名道行相？」",
        "translation": "In the truth of the path, there are four defining activities, so what is the first name for the defining activities of the path?",
        "source": "T16n0717_002:0843c06_1"
    },
    {
        "source_sentence": "「謂於聖道與境相應無顛倒性，正觀行相。」",
        "translation": "It means that there's no mistaken nature associated with the noble path and objects, and he correctly observes the characteristics of practice.",
        "source": "T16n0717_002:0843c07_2"
    },
    {
        "source_sentence": "「云何第二名如行相？」",
        "translation": "What is the second name like the mark of practice?",
        "source": "T16n0717_002:0843c08_3"
    },
    {
        "source_sentence": "「謂於聖道永出世間離諸漏性，正觀行相。」",
        "translation": "It's the noble path that permanently transcends the world, parts with the contaminants, and correctly observes the characteristics of practice.",
        "source": "T16n0717_002:0843c08_4"
    },
    {
        "source_sentence": "「云何第三名行行相？」",
        "translation": "What is the third aspect of name-and-form practice?",
        "source": "T16n0717_002:0843c09_5"
    },
    {
        "source_sentence": "「謂於聖道先聖後聖同所遊履，正觀行相。」",
        "translation": "It means to correctly contemplate the characteristics of what's practiced by the noble path, which is shared with the prior and subsequent sages.",
        "source": "T16n0717_002:0843c10_0"
    },
    {
        "source_sentence": "「云何第四名出行相？」",
        "translation": "What is the fourth name of the characteristic of traveling?",
        "source": "T16n0717_002:0843c10_1"
    },
    {
        "source_sentence": "「謂於聖道無上性中，正觀行相。」",
        "translation": "It means that in the unsurpassed nature of the noble path, he correctly observes the characteristics of practice.",
        "source": "T16n0717_002:0843c11_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843c13_0"
    },
    {
        "source_sentence": "何緣聖諦唯有四種？」",
        "translation": "Why are there only four kinds of noble truths?",
        "source": "T16n0717_002:0843c13_1"
    },
    {
        "source_sentence": "世尊告曰：「如是四諦，普攝一切染淨因果差別性故。」",
        "translation": "The Bhagavān told them, Such are the four noble truths because they universally embrace the distinctive nature of causes and effects of all defilement and purity.",
        "source": "T16n0717_002:0843c13_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843c15_0"
    },
    {
        "source_sentence": "何緣四諦如是先後次第說耶？」",
        "translation": "Why are the four noble truths thus explained in order before and after?",
        "source": "T16n0717_002:0843c15_1"
    },
    {
        "source_sentence": "世尊告曰：「由是世間諸病、病因、病滅良藥相似法故。」",
        "translation": "The Bhagavān told him, It's because it's the similarity of worldly illnesses, causes of illness, and good medicines for curing illness.",
        "source": "T16n0717_002:0843c15_2"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843c18_0"
    },
    {
        "source_sentence": "入見道時，於此四諦為頓現觀？",
        "translation": "At the moment of entering the path of vision, are these four noble truths observed suddenly?",
        "source": "T16n0717_002:0843c18_1"
    },
    {
        "source_sentence": "為漸現觀？」",
        "translation": "In order to gradually observe it?",
        "source": "T16n0717_002:0843c18_2"
    },
    {
        "source_sentence": "世尊告曰：「有別道理名頓現觀，有別道理名漸現觀。",
        "translation": "The Bhagavān told them, There's a different reason to call it sudden clear observation and a different reason to call it gradually clear observation.",
        "source": "T16n0717_002:0843c19_3"
    },
    {
        "source_sentence": "何別道理名頓現觀？",
        "translation": "What is the reason why it is called sudden comprehension?",
        "source": "T16n0717_002:0843c20_4"
    },
    {
        "source_sentence": "謂自內證真諦聖智，於真智境非安立義，總相緣故名頓現觀。",
        "translation": "It means the noble wisdom that realizes the true truth within itself, which doesn't establish meaning in the realm of true wisdom and is called sudden contemplation because it has general characteristics as objects.",
        "source": "T16n0717_002:0843c20_5"
    },
    {
        "source_sentence": "何別道理名漸現觀？",
        "translation": "What is the distinct reasoning for the name gradual comprehension?",
        "source": "T16n0717_002:0843c22_6"
    },
    {
        "source_sentence": "謂初業智及後得智，觀察自相及因果相，由作行相別相緣故，名漸現觀。」",
        "translation": "It's the first knowledge of karma and subsequently attained knowledge that observes its own characteristics and the characteristics of cause and effect, which are called gradually manifesting observation because they are the distinctive characteristics of actions.",
        "source": "T16n0717_002:0843c22_7"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0843c25_0"
    },
    {
        "source_sentence": "若有如是四聖諦者，何緣世尊復說二諦，謂世俗諦及勝義諦？」",
        "translation": "If there are these four noble truths, why did the Bhagavān again explain the two truths, which are the conventional truth and the ultimate truth?",
        "source": "T16n0717_002:0843c25_1"
    },
    {
        "source_sentence": "世尊告曰：「即於如是四聖諦中，若法住智所行境界，是世俗諦。",
        "translation": "The Bhagavān told them, Of these four noble truths, the dharmas that abide in the realm of wisdom and are practiced by knowledge are worldly truths.",
        "source": "T16n0717_002:0843c26_2"
    },
    {
        "source_sentence": "若自內證最勝義智所行境界，非安立智所行境界，名勝義諦。」",
        "translation": "If someone realizes the sphere of knowledge of ultimate meaning within themselves and doesn't establish the sphere of knowledge, they're called the ultimate truth.",
        "source": "T16n0717_002:0843c28_3"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0844a01_0"
    },
    {
        "source_sentence": "如是四諦，於聖非聖皆悉是諦，何緣如來唯說聖諦？」",
        "translation": "Thus, these four truths are all truths in both noble and non-noble, so why does the Tathāgata only teach the noble truths?",
        "source": "T16n0717_002:0844a01_1"
    },
    {
        "source_sentence": "世尊告曰：「如是四諦，於非聖者，唯由法爾說名為諦，不由正智決定信故說名為諦；",
        "translation": "The World-honored One said: These four noble truths are called “truths” only in reference to doctrine, and they are not called truths because of the certainty of right knowledge.",
        "source": "T16n0717_002:0844a02_2"
    },
    {
        "source_sentence": "於諸聖者，亦由法爾說名為諦，亦由正智決定信故，說名為諦。",
        "translation": "It is because of the doctrine that they are said to be called truths. It is also because of right knowledge and certain faith that they are called truths.",
        "source": "T16n0717_002:0844a04_3"
    },
    {
        "source_sentence": "是故如來唯說四種名為聖諦。」",
        "translation": "Therefore, the Tathāgata only explains four kinds of names as noble truths.",
        "source": "T16n0717_002:0844a05_4"
    },
    {
        "source_sentence": "復言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0717_002:0844a07_0"
    },
    {
        "source_sentence": "全分無量法界妙智，為何所緣？",
        "translation": "What's the point of reference for the marvelous wisdom that completely parts the immeasurable Dharma realm?",
        "source": "T16n0717_002:0844a07_1"
    },
    {
        "source_sentence": "有何行相？",
        "translation": "What are the characteristics of conditioned states?",
        "source": "T16n0717_002:0844a07_2"
    },
    {
        "source_sentence": "作何事業？」",
        "translation": "What's the work to be done?",
        "source": "T16n0717_002:0844a08_3"
    },
    {
        "source_sentence": "世尊告曰：「此智亦以如是四諦為其所緣，除諦相想清淨行相，入一切種諸諦行相，",
        "translation": "The World-honored One said: This knowledge also has these four noble truths for its object. It is free of the descriptive marks, images, and characteristics of things as truths; it enters into all kinds of descriptive mark",
        "source": "T16n0717_002:0844a08_4"
    },
    {
        "source_sentence": "於作有情一切義利，趣向行相。",
        "translation": "It's the characteristic of directing all the meanings and benefits of sentient beings toward practice.",
        "source": "T16n0717_002:0844a10_5"
    },
    {
        "source_sentence": "少分有量法界妙智，若諸聲聞，於作有情一切義利，無有棄背趣向行相；",
        "translation": "“Furthermore, if śrāvakas do not give up all kinds of benefits for the sake of sentient beings, there is no sign of turning away from them and dedicating themselves to practice.",
        "source": "T16n0717_002:0844a11_6"
    },
    {
        "source_sentence": "若諸獨覺，於作有情一切義利，棄背行相。",
        "translation": "If pratyekabuddhas abandon all the aims of sentient beings, they'll turn their backs on the characteristics of actions.",
        "source": "T16n0717_002:0844a12_7"
    },
    {
        "source_sentence": "全分無量法界妙智，能作一切煩惱、所知二障離繫所依事業，又作證得一切種智極淨法界所依事業，",
        "translation": "The subtle knowledge of the infinity of the cosmos of all things is able to accomplish the undertakings on which all afflictions and the two obstacles to that which needs to be known are free from bondage. It also realizes the undertakings on which",
        "source": "T16n0717_002:0844a13_8"
    },
    {
        "source_sentence": "又作救濟一切有情一切災患所依事業，是名無明對治殊勝。」",
        "translation": "Also, doing all the tasks to rescue all sentient beings and all the calamities that they rely on is called the superiority of the antidote of ignorance.",
        "source": "T16n0717_002:0844a16_9"
    },
    {
        "source_sentence": "時薄伽梵說是經已，諸苾芻眾默然領悟，深心隨喜歎未曾有。",
        "translation": "After the Bhagavān had taught this sūtra, the monks were silent and enlightened, and they deeply rejoiced and praised it as unprecedented.",
        "source": "T16n0717_002:0844a17_10"
    },
    {
        "source_sentence": "聞佛所說，皆大歡喜，信受奉行。",
        "translation": "Having heard the Buddha’s exhortation, they all rejoiced greatly and accepted it with faith.",
        "source": "T16n0717_002:0844a19_0"
    },
    {
        "source_sentence": "分別緣起初勝法門經卷下",
        "translation": "Second Fascicle of the First Chapter of the Sutra on the Discriminating Conditioned Arising of the Dharma Teaching, Volume II",
        "source": "T16n0717_002:0844a20_0"
    }
]