[
    {
        "source_sentence": "大乘入楞伽經卷第六",
        "translation": "Laṅkâvatāra-sūtra, Volume 6",
        "source": "T16n0672_006:0622b04_0"
    },
    {
        "source_sentence": "大周于闐國三藏法師",
        "translation": "Tripiṭaka Master Dazhou of Yugan",
        "source": "T16n0672_006:0622b06_0"
    },
    {
        "source_sentence": "實叉難陀奉　勅譯",
        "translation": "real translated by the imperial edict of Śākyamuni and Nanda",
        "source": "T16n0672_006:0622b07_0"
    },
    {
        "source_sentence": "變化品第七",
        "translation": "Chapter 7 of the Chapter on Transformation",
        "source": "T16n0672_006:0622b08_0"
    },
    {
        "source_sentence": "爾時大慧菩薩摩訶薩復白佛言：「世尊！",
        "translation": "It was then that the great wisdom bodhisattva Mahāsattva again said to the Buddha, Bhagavān!",
        "source": "T16n0672_006:0622b09_0"
    },
    {
        "source_sentence": "如來何故授阿羅漢阿耨多羅三藐三菩提記？",
        "translation": "Why did the Tathāgata give the arhat an assurance of unsurpassed, correct, and complete enlightenment?",
        "source": "T16n0672_006:0622b09_1"
    },
    {
        "source_sentence": "何故復說無般涅槃法眾生得成佛道？",
        "translation": "Why does it again say that there are no parinirvāṇa dharmas for sentient beings to attain the buddha path?",
        "source": "T16n0672_006:0622b10_2"
    },
    {
        "source_sentence": "又何故說從初得佛至般涅槃，於其中間不說一字？",
        "translation": "Why is it said that from the first attainment of Buddhahood up to parinirvāṇa, there's not a single word spoken among them?",
        "source": "T16n0672_006:0622b11_3"
    },
    {
        "source_sentence": "又言如來常在於定無覺無觀；",
        "translation": "It is further said that the Tathagata always abides in samdhi without initial thought or sustained thought.",
        "source": "T16n0672_006:0622b13_4"
    },
    {
        "source_sentence": "又言佛事皆是化作；",
        "translation": "It is also said that all buddha-works are magical creations.",
        "source": "T16n0672_006:0622b13_5"
    },
    {
        "source_sentence": "又言諸識剎那變壞；",
        "translation": "It also says that the consciousnesses change and disintegrate at different moments.",
        "source": "T16n0672_006:0622b14_6"
    },
    {
        "source_sentence": "又言金剛神常隨衛護；",
        "translation": "They also said, “The diamond spirit always follows and protects them.",
        "source": "T16n0672_006:0622b14_7"
    },
    {
        "source_sentence": "又言前際不可知而說有般涅槃；",
        "translation": "It also says that it is said to have parinirvāṇa at a previously unknown time.",
        "source": "T16n0672_006:0622b15_8"
    },
    {
        "source_sentence": "又現有魔及以魔業；",
        "translation": "Furthermore, there are demons and the activities of demons in existence.",
        "source": "T16n0672_006:0622b16_9"
    },
    {
        "source_sentence": "又有餘報，謂；",
        "translation": "There is another kind of residual reward, which is to say:",
        "source": "T16n0672_006:0622b16_10"
    },
    {
        "source_sentence": "旃遮婆羅門女，孫陀利外道女，及空鉢而還等事，世尊既有如是業障，",
        "translation": "The World-honored One has already created such karmic obstacles as these for the sake of women like Kauṣṭhila, Brahman maidens, non-Buddhist maidens named Sundarī, and those who returned with their empty bowls.",
        "source": "T16n0672_006:0622b16_11"
    },
    {
        "source_sentence": "云何得成一切種智？",
        "translation": "How is it possible to attain omniscience?",
        "source": "T16n0672_006:0622b18_12"
    },
    {
        "source_sentence": "既已成於一切種智，云何不離如是諸過？」",
        "translation": "Since he has accomplished all kinds of cognition, why isn't he free of such faults?",
        "source": "T16n0672_006:0622b19_13"
    },
    {
        "source_sentence": "佛言：「諦聽！",
        "translation": "The Buddha said, Listen closely!",
        "source": "T16n0672_006:0622b20_14"
    },
    {
        "source_sentence": "當為汝說。",
        "translation": "I will explain it for you.",
        "source": "T16n0672_006:0622b20_15"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0622b20_16"
    },
    {
        "source_sentence": "我為無餘涅槃界故，密勸令彼修菩薩行，此界他土有諸菩薩，心樂求於聲聞涅槃，",
        "translation": "In order to enter the realm of nirvana without remainder, I secretly urge them to cultivate the practice of enlightening beings. There are enlightening beings in this world and others in other worlds who delight in seeking the nirvana",
        "source": "T16n0672_006:0622b20_17"
    },
    {
        "source_sentence": "令捨是心進修大行，故作是說。",
        "translation": "Causing equanimity is the mind to advance and cultivate great practices, so it's explained this way.",
        "source": "T16n0672_006:0622b22_18"
    },
    {
        "source_sentence": "又變化佛與化聲聞而授記別，非法性佛。",
        "translation": "Also, the transformation buddha and the transformed śrāvaka are given different assurances of future enlightenment, and the non-nature buddha.",
        "source": "T16n0672_006:0622b23_19"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0622b24_20"
    },
    {
        "source_sentence": "授聲聞記是祕密說。",
        "translation": "Teaching the śrāvaka assurance is a esoteric teaching.",
        "source": "T16n0672_006:0622b24_21"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0622b25_22"
    },
    {
        "source_sentence": "佛與二乘無差別者，據斷惑障解脫一味，非謂智障，智障要見法無我性乃清淨故。",
        "translation": "The Buddha and the two vehicles are not different: according to the one flavor of abandoning the obstacle of defilement and being disjunctioned from it. This is not called the obstacle of knowledge because the obstacle of knowledge is purified only by seeing the self",
        "source": "T16n0672_006:0622b25_23"
    },
    {
        "source_sentence": "煩惱障者，見人無我意識捨離，是時初斷藏識習滅，法障解脫方得永淨。",
        "translation": "The obstacle of defilement is when the thinking consciousness that sees person as selfless abandons it. This is the moment when the initially eliminated store consciousness ceases, and only after being liberated from the dharma-obstruction does",
        "source": "T16n0672_006:0622b27_24"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0622b29_25"
    },
    {
        "source_sentence": "我依本住法作是密語，非異前佛，後更有說，先具如是諸文字故。",
        "translation": "I made this esoteric statement relying on the teachings of my former existence. It is not different from what was said by the buddhas mentioned above. There will be others who say it later, because they first contained all these words.",
        "source": "T16n0672_006:0622b29_26"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0622c01_27"
    },
    {
        "source_sentence": "如來正知無有妄念，不待思慮然後說法，如來久已斷四種習，離二種死、除二種障。",
        "translation": "The Tathāgata correctly knows that there's no deluded thought and doesn't wait to contemplate it before he teaches the Dharma. The Tathāgata has long ended the four kinds of accumulation, parted with two kinds of death, and removed",
        "source": "T16n0672_006:0622c02_28"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0622c04_29"
    },
    {
        "source_sentence": "意及意識眼識等七，習氣為因是剎那性，離無漏善非流轉法。",
        "translation": "The mind and seven mental states, the consciousness of manas, the eye consciousness, etc., are momentary by reason of their arising; but they are not pure good or bad dharmas that do not flow from one state to another.",
        "source": "T16n0672_006:0622c04_30"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0622c05_31"
    },
    {
        "source_sentence": "如來藏者，生死流轉及是涅槃苦樂之因，凡愚不知妄著於空。",
        "translation": "The store of the Tathāgata refers to the transmigration of birth-and-death and the causes of suffering and happiness in nirvāṇa, which ordinary foolish people don't know and are deludedly attached to emptiness.",
        "source": "T16n0672_006:0622c05_32"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0622c07_33"
    },
    {
        "source_sentence": "變化如來，金剛力士常隨衛護，非真實佛。",
        "translation": "The transformation tathāgata, which is always guarded by vajra warriors, isn't really a buddha.",
        "source": "T16n0672_006:0622c07_34"
    },
    {
        "source_sentence": "真實如來離諸限量，二乘外道所不能知，住現法樂成就智忍，不假金剛力士所護。",
        "translation": "The true Tathāgata is free of limitations, unknown to the two-vehicle non-Buddhists, abides in the bliss of present life and accomplishes the forbearance of wisdom without relying on the protection of the ada",
        "source": "T16n0672_006:0622c08_35"
    },
    {
        "source_sentence": "一切化佛不從業生，非即是佛亦非非佛，譬如陶師眾事和合而有所作，",
        "translation": "All apparitional buddhas do not arise from deeds. They are neither the same as buddhas nor different from buddhas, just as potter’s work is effected by the confluence of all things:",
        "source": "T16n0672_006:0622c10_36"
    },
    {
        "source_sentence": "化佛亦爾，眾相具足而演說法，然不能說自證聖智所行之境。",
        "translation": "The apparitional Buddha is also like this, fully endowed with all characteristics and teaching the Dharma, but he can't explain the objects practiced by noble wisdom that he himself realizes.",
        "source": "T16n0672_006:0622c12_37"
    },
    {
        "source_sentence": "「復次，大慧！",
        "translation": "Furthermore, Mahāprajñāpāramitā!",
        "source": "T16n0672_006:0622c14_0"
    },
    {
        "source_sentence": "諸凡愚人見六識滅起於斷見，不了藏識起於常見。",
        "translation": "Ordinary foolish people see the cessation of the six consciousnesses and give rise to the view of stopping, but they don't understand that the store consciousness gives rise to the common.",
        "source": "T16n0672_006:0622c14_1"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0622c15_2"
    },
    {
        "source_sentence": "自心分別是其本際，故不可得，離此分別即得解脫，四種習斷離一切過。」",
        "translation": "Being free of discrimination in one's own mind is the original limit, so it can't be obtained; being free of this discrimination will mean attaining liberation, and the four kinds of accumulation will stop all faults.",
        "source": "T16n0672_006:0622c15_3"
    },
    {
        "source_sentence": "「三乘及非乘，　　無有佛涅槃；",
        "translation": "The nirvana of buddhas neither exists in the three vehicles nor in non-vehicle.",
        "source": "T16n0672_006:0622c17_4"
    },
    {
        "source_sentence": "　悉授如來記，　　說離眾過惡。",
        "translation": "They all give the Tathāgata's assurance that they're free of all faults and evils.",
        "source": "T16n0672_006:0622c17_4"
    },
    {
        "source_sentence": "　成就究竟智，　　及無餘涅槃；",
        "translation": "Accomplishing ultimate knowledge, They attain nirvana without remainder.",
        "source": "T16n0672_006:0622c17_4"
    },
    {
        "source_sentence": "　誘進怯劣人，　　依此密意說。",
        "translation": "Enticement and advancement of the weak are said to be based on this esoteric meaning.",
        "source": "T16n0672_006:0622c17_4"
    },
    {
        "source_sentence": "　諸佛所得智，　　演說如是道；",
        "translation": "The knowledge attained by the Buddhas Expounds such a path.",
        "source": "T16n0672_006:0622c17_4"
    },
    {
        "source_sentence": "　惟此更非餘，　　故彼無涅槃。",
        "translation": "This is the only thing that remains, and therefore they have no nirvāṇa.",
        "source": "T16n0672_006:0622c17_4"
    },
    {
        "source_sentence": "　欲色有諸見，　　如是四種習；",
        "translation": "These are the four kinds of accumulation:",
        "source": "T16n0672_006:0622c17_4"
    },
    {
        "source_sentence": "　意識所從生，　　藏意亦在中。",
        "translation": "Consciousness of the mind arises from thinking. The store consciousness also abides in it.",
        "source": "T16n0672_006:0622c17_4"
    },
    {
        "source_sentence": "　見意識眼等，　　無常故說斷；",
        "translation": "The seeing consciousness, the eye, and so on, are said to be abandoned Because they are impermanent.",
        "source": "T16n0672_006:0622c17_4"
    },
    {
        "source_sentence": "　迷意藏起常，　　邪智謂涅槃。」",
        "translation": "The store of delusion in the mind gives rise to permanence, and wrong wisdom is called nirvāṇa.",
        "source": "T16n0672_006:0622c17_4"
    },
    {
        "source_sentence": "爾時世尊重說頌言：大乘入楞伽經斷食肉品第八爾時大慧菩薩摩訶薩復白佛言：「世尊！",
        "translation": "It was then that the Bhagavān spoke a verse, saying, The eighth chapter of the Mahāprajñāpāramitā-sūtra's entry into Laṅkâvatāra says, Bhagavān!",
        "source": "T16n0672_006:0622c17_4"
    },
    {
        "source_sentence": "願為我說食不食肉功德過失，我及諸菩薩摩訶薩知其義已，為未來現在報習所熏食肉眾生而演說之，",
        "translation": "“Furthermore, please tell me of the virtues and faults of eating meatlessness. Knowing what they mean, I and other great enlightening beings will expound them to sentient beings who eat meat in the future and present as",
        "source": "T16n0672_006:0622c29_5"
    },
    {
        "source_sentence": "令捨肉味求於法味；",
        "translation": "They cause people to give up the taste of meat and seek the taste of truth.",
        "source": "T16n0672_006:0623a03_6"
    },
    {
        "source_sentence": "於一切眾生起大慈心，更相親愛如一子想，住菩薩地得阿耨多羅三藐三菩提；",
        "translation": "“Great enlightening beings develop great compassion toward all sentient beings and love each other as if they were their only child. Abiding in the state of enlightening beings, they attain unexcelled complete perfect enlightenment.",
        "source": "T16n0672_006:0623a03_7"
    },
    {
        "source_sentence": "或二乘地暫時止息，究竟當成無上正覺。",
        "translation": "Perhaps the two-vehicle stage temporarily stops, and ultimately becomes unsurpassed perfect enlightenment.",
        "source": "T16n0672_006:0623a05_8"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0672_006:0623a06_9"
    },
    {
        "source_sentence": "路迦耶等諸外道輩，起有無見執著斷常，尚有遮禁不聽食肉，何況如來、應、正等覺，",
        "translation": "Such non-Buddhist groups as the Lokeya arouse views of existence and nonexistence and cling to nihilism and eternalism, but there are still prohibitions that prevent them from eating meat, so why wouldn't the Tathāgata, Arhat",
        "source": "T16n0672_006:0623a06_10"
    },
    {
        "source_sentence": "大悲含育世所依怙，而許自他俱食肉耶？",
        "translation": "Does the great compassion contain the support of the world's support, and does it allow self and others to eat meat together?",
        "source": "T16n0672_006:0623a08_11"
    },
    {
        "source_sentence": "善哉世尊！",
        "translation": "Excellent, Bhagavān!",
        "source": "T16n0672_006:0623a09_12"
    },
    {
        "source_sentence": "具大慈悲哀愍世間，等觀眾生猶如一子，願為解說食肉過惡、不食功德，",
        "translation": "Being endowed with great compassion and pity for the world, they look upon all sentient beings equally as if they were their only child. May they explain to them the evil of eating meat and the virtue of not eating it?",
        "source": "T16n0672_006:0623a10_13"
    },
    {
        "source_sentence": "令我及與諸菩薩等，聞已奉行廣為他說。」",
        "translation": "Let me and the other bodhisattvas hear it and follow it and explain it widely for others.",
        "source": "T16n0672_006:0623a11_14"
    },
    {
        "source_sentence": "「菩薩摩訶薩，　　志求無上覺；",
        "translation": "“Great enlightening beings Determined to seek the supreme awakening.",
        "source": "T16n0672_006:0623a12_15"
    },
    {
        "source_sentence": "　酒肉及與葱，　　為食為不食？",
        "translation": "Why are wine, meat, and onions eaten or not eaten?",
        "source": "T16n0672_006:0623a12_15"
    },
    {
        "source_sentence": "　愚夫貪嗜肉，　　臭穢無名稱；",
        "translation": "Foolish people covet meat, Which smells bad and has no reputation.",
        "source": "T16n0672_006:0623a12_15"
    },
    {
        "source_sentence": "　與彼惡獸同，　　云何而可食？",
        "translation": "They're the same as those bad animals, so how can they be eaten?",
        "source": "T16n0672_006:0623a12_15"
    },
    {
        "source_sentence": "　食者有何過？　　不食有何德？",
        "translation": "What's wrong with eating, and what's the virtue of not eating?",
        "source": "T16n0672_006:0623a12_15"
    },
    {
        "source_sentence": "　惟願最勝尊，　　為我具開演。」",
        "translation": "May the most excellent honored one reveal it for me.",
        "source": "T16n0672_006:0623a12_15"
    },
    {
        "source_sentence": "爾時大慧菩薩重說頌言：爾時佛告大慧菩薩摩訶薩言：「大慧！",
        "translation": "It was then that the Bodhisattva of Great Wisdom again spoke a verse, saying, At that point, the Buddha addressed the Bodhisattva Mahāsattva of Great Wisdom, saying, Great Wisdom!",
        "source": "T16n0672_006:0623a12_15"
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen attentively!",
        "source": "T16n0672_006:0623a20_16"
    },
    {
        "source_sentence": "諦聽！",
        "translation": "Listen attentively!",
        "source": "T16n0672_006:0623a20_17"
    },
    {
        "source_sentence": "善思念之。",
        "translation": "Consider it well and think of it.",
        "source": "T16n0672_006:0623a21_18"
    },
    {
        "source_sentence": "吾當為汝分別解說。",
        "translation": "I will explain it for you in a discriminating way.",
        "source": "T16n0672_006:0623a21_19"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623a21_20"
    },
    {
        "source_sentence": "一切諸肉有無量緣，菩薩於中當生悲愍，不應噉食，我今為汝說其少分。",
        "translation": "All meat has measureless conditions, and the bodhisattva will become compassionate about it and won't eat it; I'll now explain a small part of it for you.",
        "source": "T16n0672_006:0623a21_21"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623a23_22"
    },
    {
        "source_sentence": "一切眾生從無始來，在生死中輪迴不息，靡不曾作父母兄弟男女眷屬，",
        "translation": "All sentient beings have been in birth and death since time immemorial, never ceasing their transmigration. None of them ever became parents, brothers, sisters, children, or attendants.",
        "source": "T16n0672_006:0623a23_23"
    },
    {
        "source_sentence": "乃至朋友親愛侍使，易生而受鳥獸等身，云何於中取之而食？",
        "translation": "Or even if a friend, relative, or attendant is easily born and receives the bodies of birds and animals, how can he take them and eat them?",
        "source": "T16n0672_006:0623a25_24"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623a27_25"
    },
    {
        "source_sentence": "菩薩摩訶薩觀諸眾生同於己身，念肉皆從有命中來，云何而食？",
        "translation": "The bodhisattva Mahāsattva observes that all sentient beings are the same as himself, and he thinks, 'All flesh comes from life, so how can we eat it?'",
        "source": "T16n0672_006:0623a27_26"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623a28_27"
    },
    {
        "source_sentence": "諸羅剎等聞我此說尚應斷肉，況樂法人。",
        "translation": "The rāṣas and others who hear my teaching here should still cut off their flesh, so why wouldn't they like it?",
        "source": "T16n0672_006:0623a28_28"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623a29_29"
    },
    {
        "source_sentence": "菩薩摩訶薩在在生處，觀諸眾生皆是親屬，乃至慈念如一子想，是故不應食一切肉。",
        "translation": "Wherever the bodhisattva Mahāsattva is born, he observes that all sentient beings are all relatives and even thinks of kindness as a single child; therefore, he shouldn't eat all flesh.",
        "source": "T16n0672_006:0623b01_0"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623b03_0"
    },
    {
        "source_sentence": "衢路市肆諸賣肉人，或將犬馬人牛等肉，為求利故而販鬻之，如是雜穢云何可食？",
        "translation": "How can you eat such a filthy food like the flesh of dogs, horses, humans, cattle, or other meats that are sold in marketplaces and markets for profit?",
        "source": "T16n0672_006:0623b03_1"
    },
    {
        "source_sentence": "「大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623b06_0"
    },
    {
        "source_sentence": "一切諸肉皆是精血污穢所成，求清淨人，云何取食？",
        "translation": "All the flesh is made of semen and blood, which are all defiled. If you seek purity, how can you take food?",
        "source": "T16n0672_006:0623b06_1"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623b07_2"
    },
    {
        "source_sentence": "食肉之人眾生見之悉皆驚怖，修慈心者云何食肉？",
        "translation": "Those who eat meat are all frightened when sentient beings see them, so how can those who cultivate kindness eat meat?",
        "source": "T16n0672_006:0623b07_3"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623b08_4"
    },
    {
        "source_sentence": "譬如獵師及旃陀羅，捕魚網鳥諸惡人等，狗見驚吠獸見奔走，空飛水住一切眾生，",
        "translation": "It's like a hunter or a caṇḍāla who catches fish, nets birds, and bad people. The dogs are frightened by what they see, the animals run away in flight, and all sentient beings fly up and down in",
        "source": "T16n0672_006:0623b08_5"
    },
    {
        "source_sentence": "若有見之咸作是念：『此人氣息猶如羅剎，今來至此必當殺我。』",
        "translation": "If there are people who see it, they all think, 'This person's breath is like a rāṣṇa, and now that he's here, he'll surely kill me.'",
        "source": "T16n0672_006:0623b10_6"
    },
    {
        "source_sentence": "為護命故悉皆走避。",
        "translation": "In order to protect their lives, they all run away.",
        "source": "T16n0672_006:0623b12_7"
    },
    {
        "source_sentence": "食肉之人亦復如是，是故菩薩為修慈行不應食肉。",
        "translation": "A person who eats meat is likewise; therefore, a bodhisattva cultivates the practice of kindness and shouldn't eat meat.",
        "source": "T16n0672_006:0623b12_8"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623b14_9"
    },
    {
        "source_sentence": "夫食肉者，身體臭穢惡名流布，賢聖善人不用親狎，是故菩薩不應食肉。",
        "translation": "A bodhisattva who eats meat has a body that smells bad and spreads bad names, and good people don't need to eat it; therefore, the bodhisattva shouldn't eat meat.",
        "source": "T16n0672_006:0623b14_10"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623b16_0"
    },
    {
        "source_sentence": "夫血肉者，眾仙所棄群聖不食，是故菩薩不應食肉。",
        "translation": "The flesh of blood is discarded by the sages and not eaten by the holy ones; therefore, bodhisattvas shouldn't eat meat.",
        "source": "T16n0672_006:0623b16_1"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623b17_2"
    },
    {
        "source_sentence": "菩薩為護眾生信心，令於佛法不生譏謗，以慈愍故不應食肉。",
        "translation": "In order to protect the faith of sentient beings, the bodhisattva causes them not to criticize the Buddha's teaching and doesn't criticize it, and because of their compassion, they shouldn't eat meat.",
        "source": "T16n0672_006:0623b17_3"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623b19_4"
    },
    {
        "source_sentence": "若我弟子食噉於肉，令諸世人悉懷譏謗，而作是言：『云何沙門修淨行人，",
        "translation": "If my disciple eats meat and causes all the people of the world to criticize it, saying, 'How does an ascetic cultivate pure practices?'",
        "source": "T16n0672_006:0623b19_5"
    },
    {
        "source_sentence": "棄捨天仙所食之味，猶如惡獸食肉滿腹遊行世間，令諸眾生悉懷驚怖，",
        "translation": "They abandon the taste of food eaten by celestial sages, just as bad animals eat meat and travel in the world with their bellies full of flesh, causing all sentient beings to be terrified.",
        "source": "T16n0672_006:0623b20_6"
    },
    {
        "source_sentence": "壞清淨行失沙門道。』",
        "translation": "They disrupt pure practices and lose the ascetic path.'",
        "source": "T16n0672_006:0623b22_7"
    },
    {
        "source_sentence": "是故當知佛法之中無調伏行，菩薩慈愍為護眾生，令不生於如是之心，",
        "translation": "Therefore, you should know that there is no discipline in the Buddha’s teaching. Enlightening beings have compassion for sentient beings and protect them so that they will not give rise to such thoughts.",
        "source": "T16n0672_006:0623b23_8"
    },
    {
        "source_sentence": "不應食肉。",
        "translation": "You shouldn't eat meat.",
        "source": "T16n0672_006:0623b24_9"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623b25_10"
    },
    {
        "source_sentence": "如燒人肉其氣臭穢，與燒餘肉等無差別，云何於中有食不食？",
        "translation": "It is the same as burning a man’s flesh, smelling bad and foul-smelling. There is no difference between it and the flesh that is burned: how could there be food or no food in it?",
        "source": "T16n0672_006:0623b25_11"
    },
    {
        "source_sentence": "是故一切樂清淨者不應食肉。",
        "translation": "Therefore, all the pleasures are pure and they shouldn't eat meat.",
        "source": "T16n0672_006:0623b26_12"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623b27_13"
    },
    {
        "source_sentence": "諸善男女塚間樹下阿蘭若處寂靜修行，或住慈心或持呪術，或求解脫或趣大乘，",
        "translation": "Good men and good women cultivate quietly in a forested place under a tree in a cemetery, either with kindness or holding spells, or seeking liberation or advancing to the Great Vehicle.",
        "source": "T16n0672_006:0623b27_14"
    },
    {
        "source_sentence": "以食肉故，一切障礙不得成就，是故菩薩欲利自他不應食肉。",
        "translation": "Because they eat meat, all the obstacles won't be accomplished; therefore, bodhisattvas who want to benefit themselves and others shouldn't eat meat.",
        "source": "T16n0672_006:0623b29_15"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623c02_16"
    },
    {
        "source_sentence": "夫食肉者，見其形色則已生於貪滋味心，菩薩慈念一切眾生猶如己身，",
        "translation": "When a person eats meat, they see its form and give rise to thoughts of craving and taste. The enlightening beings kindly think of all sentient beings as themselves:",
        "source": "T16n0672_006:0623c02_17"
    },
    {
        "source_sentence": "云何見之而作食想？",
        "translation": "How do we see it and think of it as food?",
        "source": "T16n0672_006:0623c04_18"
    },
    {
        "source_sentence": "是故菩薩不應食肉。",
        "translation": "Therefore, the bodhisattva shouldn't eat meat.",
        "source": "T16n0672_006:0623c04_19"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623c05_20"
    },
    {
        "source_sentence": "夫食肉者諸天遠離，口氣常臭，睡夢不安覺已憂悚，夜叉惡鬼奪其精氣，",
        "translation": "Those who eat meat will be far removed from the gods, and their mouths will always smell bad. In sleep or in dreams, they'll feel uneasy and sorrowful after awakening, and yakṣa demons will snatch their vital",
        "source": "T16n0672_006:0623c05_21"
    },
    {
        "source_sentence": "心多驚怖，食不知足，增長疾病易生瘡癬，恒被諸蟲之所唼食，不能於食深生厭離。",
        "translation": "Their minds are often frightened, and they don't know enough to eat. They grow sick and easily develop sores and abscesses, and they're constantly eaten by insects that won't be able to become deeply disillusioned with",
        "source": "T16n0672_006:0623c07_22"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623c09_23"
    },
    {
        "source_sentence": "我常說言：『凡所食噉作子肉想。』",
        "translation": "I always say, 'Whenever I eat food, I think of it as child and flesh.'",
        "source": "T16n0672_006:0623c09_24"
    },
    {
        "source_sentence": "餘食尚然，云何而聽弟子食肉。",
        "translation": "The rest of the food is still there, so why would he allow his disciples to eat meat?",
        "source": "T16n0672_006:0623c10_25"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623c10_26"
    },
    {
        "source_sentence": "肉非美好、肉不清淨，生諸罪惡敗諸功德，諸仙聖人之所棄捨，云何而許弟子食耶？",
        "translation": "The flesh isn't good, the flesh isn't pure, and the sins that give rise to sins and bad qualities that degenerate are abandoned by sages and sages, so how could they allow the disciples to eat it",
        "source": "T16n0672_006:0623c11_0"
    },
    {
        "source_sentence": "若言許食，此人謗我。",
        "translation": "If someone says they're allowed to eat, this person denigrates me.",
        "source": "T16n0672_006:0623c13_0"
    },
    {
        "source_sentence": "「大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623c13_1"
    },
    {
        "source_sentence": "淨美食者，應知則是粳米粟米大小麥豆蘇油石蜜，如是等類，此是過去諸佛所許，",
        "translation": "The pure and wonderful foods are rice, millet, rice porridge, large and small grains, beans, oil, rock honey, and so forth. Such things were permitted by the buddhas of the past.",
        "source": "T16n0672_006:0623c13_2"
    },
    {
        "source_sentence": "我所稱說。",
        "translation": "I'll explain it.",
        "source": "T16n0672_006:0623c15_3"
    },
    {
        "source_sentence": "我種性中諸善男女，心懷淨信久植善根，於身命財不生貪著，慈愍一切猶如己身，",
        "translation": "Good men and good women of my seed-nature harbor pure faith in their minds, plant roots of goodness for a long time, don’t become attached to body, life, or possessions, and kindly pity all as if they were themselves.",
        "source": "T16n0672_006:0623c15_4"
    },
    {
        "source_sentence": "如是之人之所應食，非諸惡習虎狼性者心所愛重。",
        "translation": "Such a person should eat it, which isn't desirable in the minds of those with bad tendencies like tigers and wolves.",
        "source": "T16n0672_006:0623c17_5"
    },
    {
        "source_sentence": "「大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623c20_0"
    },
    {
        "source_sentence": "過去有王名師子生，耽著肉味食種種肉，如是不已遂至食人，臣民不堪悉皆離叛，",
        "translation": "In the past there was a king named Siṃhala, who indulged in eating various kinds of meat and flesh. He did not stop eating until he had eaten it; his subjects were unable to endure this kind of disobedience.",
        "source": "T16n0672_006:0623c20_1"
    },
    {
        "source_sentence": "亡失國位受大苦惱。",
        "translation": "They lost their state and suffered great pain and suffering.",
        "source": "T16n0672_006:0623c22_2"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623c22_3"
    },
    {
        "source_sentence": "釋提桓因處天王位，以於過去食肉餘習，變身為鷹而逐於鴿。",
        "translation": "Śakra Devānām-Indra, who was the king of gods, transformed himself into an eagle and chased a pigeon because he used to eat meat in the past.",
        "source": "T16n0672_006:0623c22_4"
    },
    {
        "source_sentence": "我時作王名曰尸毘，愍念其鴿，自割身肉以代其命。",
        "translation": "At the time, I was a king named Śiva, and in pity for that pigeon, I cut off my own flesh to replace its life.",
        "source": "T16n0672_006:0623c24_5"
    },
    {
        "source_sentence": "「大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623c26_0"
    },
    {
        "source_sentence": "帝釋餘習尚惱眾生，況餘無慚常食肉者。",
        "translation": "Tīrṣa's other habits still disturb sentient beings, so why wouldn't the rest of them have shame and always eat meat?",
        "source": "T16n0672_006:0623c26_1"
    },
    {
        "source_sentence": "當知食肉自惱惱他，是故菩薩不應食肉。",
        "translation": "You should know that eating meat harms yourself and harms others; therefore, the bodhisattva shouldn't eat meat.",
        "source": "T16n0672_006:0623c27_2"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0623c28_3"
    },
    {
        "source_sentence": "昔有一王乘馬遊獵，馬驚奔逸入於山險，既無歸路又絕人居，有牝師子與同遊處，",
        "translation": "Formerly there was a king who rode his horse to hunt. Fearful, the horse ran away in fear and entered the mountainous forest; but as he had no way to go home, the people would not live there. A queen and a lion",
        "source": "T16n0672_006:0623c28_4"
    },
    {
        "source_sentence": "遂行醜行生諸子息，其最長者名曰班足，後得作王領七億家，食肉餘習非肉不食，",
        "translation": "As a result, he engaged in ugly behavior and gave birth to children who were cured. The eldest of these children, named Banfu, later became king and ruled over seven billion families. They ate meat but the rest did not eat meat",
        "source": "T16n0672_006:0624a01_5"
    },
    {
        "source_sentence": "初食禽獸後乃至人，所生男女悉是羅剎。",
        "translation": "The men and women born after the first time they ate from birds and animals up to humans are all Rāṣṭrapāla.",
        "source": "T16n0672_006:0624a03_6"
    },
    {
        "source_sentence": "轉此身已，復生師子豺狼虎豹雕鷲等中，欲求人身終不可得，況出生死涅槃之道。",
        "translation": "After turning this body, they'll again be born among lions, jackals, wolves, tigers, seals, eagles, and so forth, but their desire to search for a body is ultimately unobtainable, so why wouldn't",
        "source": "T16n0672_006:0624a04_7"
    },
    {
        "source_sentence": "「大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624a07_0"
    },
    {
        "source_sentence": "夫食肉者有如是等無量過失，斷而不食獲大功德，凡愚不知如是損益，",
        "translation": "Those who eat meat have these kinds of immeasurable faults, which they abandon and don't eat to attain great merit. Ordinary foolish people don't know such gain or loss.",
        "source": "T16n0672_006:0624a07_1"
    },
    {
        "source_sentence": "是故我今為汝開演，凡是肉者悉不應食。",
        "translation": "Therefore, I'll now explain it for you. All those who eat this meat shouldn't eat it.",
        "source": "T16n0672_006:0624a08_2"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624a09_3"
    },
    {
        "source_sentence": "凡殺生者多為人食，人若不食亦無殺事，是故食肉與殺同罪。",
        "translation": "Whenever someone kills, they mostly eat for the sake of humans, and if people don't eat it, there's no killing; therefore, eating meat is the same as killing.",
        "source": "T16n0672_006:0624a10_0"
    },
    {
        "source_sentence": "奇哉世間貪著肉味，於人身肉尚取食之，況於鳥獸有不食者，以貪味故廣設方便，",
        "translation": "How wonderful it is that the world clings to the taste of meat and yet eats human flesh, much less birds and beasts. It is even more so when they do not eat meat because they crave its taste.",
        "source": "T16n0672_006:0624a11_1"
    },
    {
        "source_sentence": "罝羅網罟處處安施，水陸飛行皆被殺害，設自不食為貪價直而作是事。",
        "translation": "The net of arrows and spears are distributed everywhere, and they're all killed by water, land, and flying, and if they don't eat themselves, they'll do so because they crave a straight price.",
        "source": "T16n0672_006:0624a13_2"
    },
    {
        "source_sentence": "「大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624a16_0"
    },
    {
        "source_sentence": "世復有人心無慈愍，專行慘暴猶如羅剎，若見眾生其身充盛，便生肉想言此可食。",
        "translation": "Again, there are people in the world whose minds lack compassion and who exclusively practice misery and violence like a rāṣṇa. If they see sentient beings whose bodies are full, they will give rise to thoughts of flesh and say, '",
        "source": "T16n0672_006:0624a16_1"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624a18_2"
    },
    {
        "source_sentence": "世無有肉，非是自殺亦非他殺，心不疑殺而可食者，以是義故我許聲聞食如是肉。",
        "translation": "There's no flesh in the world, which is neither killed by suicide nor killed by others, and whose mind doesn't doubt killing but can eat it, for this reason I allow śrāvakas to eat such flesh.",
        "source": "T16n0672_006:0624a18_3"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624a20_4"
    },
    {
        "source_sentence": "未來之世有愚癡人，於我法中而為出家，妄說毘尼壞亂正法，誹謗於我言聽食肉亦自曾食。",
        "translation": "In the future, there will be a foolish man who leaves home in my teaching, falsely explains the vinaya that disrupts the right teaching and denigrates it, saying that he's heard me eat meat and has eaten it himself.",
        "source": "T16n0672_006:0624a20_5"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624a22_6"
    },
    {
        "source_sentence": "我若聽許聲聞食肉，我則非是住慈心者，修觀行者，行頭陀者，趣大乘者，",
        "translation": "If I were to listen and allow śrāvakas to eat meat, then I wouldn’t be someone who abides in the mind of kindness. Those who cultivate contemplation and practice are those who practice as an ascetic and those who are headed for",
        "source": "T16n0672_006:0624a22_7"
    },
    {
        "source_sentence": "云何而勸諸善男子及善女人，於諸眾生生一子想斷一切肉？",
        "translation": "How do you encourage good men and good women to give birth to a single child in sentient beings who conceive of cutting off all flesh?",
        "source": "T16n0672_006:0624a24_8"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624a26_9"
    },
    {
        "source_sentence": "我於諸處說遮十種許三種者，是漸禁斷令其修學；",
        "translation": "“In various places, I have said to obstruct ten kinds and approximate three kinds”: Gradually they are to be abandoned and let them develop.",
        "source": "T16n0672_006:0624a26_10"
    },
    {
        "source_sentence": "今此經中自死他殺，凡是肉者一切悉斷。",
        "translation": "Now, in this sūtra, he kills himself and kills others, and whatever is flesh is completely eliminated.",
        "source": "T16n0672_006:0624a27_11"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624a28_12"
    },
    {
        "source_sentence": "我不曾許弟子食肉，亦不現許亦不當許。",
        "translation": "I've never allowed my disciple to eat meat, and I don't now allow it or will allow it.",
        "source": "T16n0672_006:0624a28_13"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624a29_14"
    },
    {
        "source_sentence": "凡是肉食，於出家人悉是不淨。",
        "translation": "Whatever meat is eaten, it's completely impure to a renunciant.",
        "source": "T16n0672_006:0624a29_15"
    },
    {
        "source_sentence": "「大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624b02_0"
    },
    {
        "source_sentence": "若有癡人，謗言如來聽許食肉亦自食者，當知是人惡業所纏，必當永墮不饒益處。",
        "translation": "If there are deluded people who denigrate the Tathāgata and say that he allows them to eat meat and also eats himself, you should know that they're bound by bad karma and will surely permanently fall into a place of no benefit.",
        "source": "T16n0672_006:0624b02_1"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624b04_2"
    },
    {
        "source_sentence": "我之所有諸聖弟子，尚不食於凡夫段食，況食血肉不淨之食。",
        "translation": "All of my noble disciples don't yet eat partial food from ordinary people, so why wouldn't they eat the impure food of flesh and blood?",
        "source": "T16n0672_006:0624b04_3"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624b05_4"
    },
    {
        "source_sentence": "聲聞緣覺及諸菩薩尚惟法食，豈況如來。",
        "translation": "How could it be that śrāvakas, pratyekbuddhas, and bodhisattvas still only eat the Dharma, much less the Tathāgata?",
        "source": "T16n0672_006:0624b05_5"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624b06_6"
    },
    {
        "source_sentence": "如來法身非雜食身。",
        "translation": "The Tathāgata's Dharma body is not a body of food that's mixed with food.",
        "source": "T16n0672_006:0624b06_7"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0624b07_8"
    },
    {
        "source_sentence": "我已斷除一切煩惱，我已浣滌一切習氣，我已善擇諸心智慧，大悲平等普觀眾生猶如一子。",
        "translation": "I've ended all afflictions, I've washed away all habit energy, I've skillfully selected the minds and wisdom, and I've universally observed sentient beings with great compassion and equality like a child.",
        "source": "T16n0672_006:0624b07_9"
    },
    {
        "source_sentence": "云何而許聲聞弟子食於子肉？",
        "translation": "How did they allow the śrāvaka disciples to eat their children's flesh?",
        "source": "T16n0672_006:0624b09_10"
    },
    {
        "source_sentence": "何況自食。",
        "translation": "How much more so when they eat themselves?",
        "source": "T16n0672_006:0624b10_11"
    },
    {
        "source_sentence": "作是說者無有是處。」",
        "translation": "There's no place for someone who says this.",
        "source": "T16n0672_006:0624b10_12"
    },
    {
        "source_sentence": "「悉曾為親屬，　　眾穢所成長，",
        "translation": "They all used to be relatives, grown by various defilements.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　恐怖諸含生，　　是故不應食。",
        "translation": "Because they frighten sentient beings, They should not eat.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　一切肉與葱，　　韮蒜及諸酒；",
        "translation": "All the meats, scallions, scallions, cooked garlic and wine.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　如是不淨物，　　修行者遠離。",
        "translation": "Such impure things are kept away by the practitioner.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　亦常離麻油，　　及諸穿孔床；",
        "translation": "They also always abstain from the use of linen and oil, As well as from all kinds of porous beds.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　以彼諸細蟲，　　於中大驚怖。",
        "translation": "Because of these subtle insects, they're greatly frightened.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　飲食生放逸，　　放逸生邪覺；",
        "translation": "Food and drink give rise to carelessness, And carelessness gives rise to wrong thoughts.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　從覺生於貪，　　是故不應食。",
        "translation": "Consciousness arises from craving, so you shouldn't eat it.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　邪覺生貪故，　　心為貪所醉；",
        "translation": "Because wrong awakening produces craving, The mind is inundated by craving.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　心醉長愛欲，　　生死不解脫。",
        "translation": "Their minds are drunk with long-lasting craving and desire, and birth and death aren't liberated.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　為利殺眾生，　　以財取諸肉；",
        "translation": "He kills sentient beings for profit And takes the flesh with his wealth.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　二俱是惡業，　　死墮叫喚獄。",
        "translation": "Both are bad actions, and they die and fall into Screaming and Howling Hell.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　不想不教求，　　此三種名淨；",
        "translation": "Not wanting or not wanting and not teaching, these three kinds are said to be pure.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　世無如是肉，　　食者我訶責。",
        "translation": "There's no such meat in the world, and those who eat it are reprimanded by me.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　更互相食噉，　　死墮惡獸中；",
        "translation": "They feed on each other and fall into the realms of wicked animals.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　臭穢而癲狂，　　是故不應食。",
        "translation": "They smell bad and go crazy, so they shouldn't eat it.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　獵師旃茶羅，　　屠兒羅剎娑；",
        "translation": "The hunter Kauṣṭhila and the butcher Rāṣṭrapāla.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　此等種中生，　　斯皆食肉報。",
        "translation": "These seeds are all born as a result of eating meat.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　食已無慚愧，　　生生常癲狂；",
        "translation": "Having eaten the food, they have no shame or scruples And are constantly in a state of amazement.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　諸佛及菩薩，　　聲聞所嫌惡。",
        "translation": "The buddhas and bodhisattvas are disliked by śrāvakas.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　《象脇》與《大雲》，　　《涅槃》、《央掘摩》，",
        "translation": "The Elephant Cakravartin and the Great Cloud, the Nirvana and the Aṅgulimālya.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　及此《楞伽經》，　　我皆制斷肉。",
        "translation": "And this Laṅkâvatāra-sūtra, I cut off all my flesh.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　先說見聞疑，　　已斷一切肉；",
        "translation": "First, I’ve explained that seeing, hearing, and doubting Have cut off all flesh.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　以其惡習故，　　愚者妄分別。",
        "translation": "Because of their bad habits, foolish people falsely discriminate.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　如貪障解脫，　　肉等亦復然；",
        "translation": "Like the liberation from the hindrance of craving, So it is with such things as flesh.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　若有食之者，　　不能入聖道。",
        "translation": "If someone eats it, they won't be able to enter the noble path.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　未來世眾生，　　於肉愚癡說；",
        "translation": "Sentient beings of future ages Will talk about flesh in folly.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　言此淨無罪，　　佛聽我等食。",
        "translation": "If you say this is pure and blameless, the Buddha will allow us to eat.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　淨食尚如藥，　　猶如子肉想；",
        "translation": "Pure food is still like medicine, Just like the idea of a child eating meat.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　是故修行者，　　知量而行乞。",
        "translation": "Therefore, a practitioner knows the measure and begs for it.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　食肉背解脫，　　及違聖表相；",
        "translation": "Being liberated by eating meat, they turn their backs on it And go against holy deeds.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　令眾生生怖，　　是故不應食。",
        "translation": "Causing sentient beings to become frightened, they therefore shouldn't eat it.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　安住慈心者，　　我說常厭離；",
        "translation": "Those who abide in kindness, I teach that they are always disillusioned with it.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　師子及虎狼，　　應共同遊止。",
        "translation": "Lions, lions, tigers, and wolves Should roam together.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　若於酒肉等，　　一切皆不食；",
        "translation": "If they don’t eat wine, meat, and so forth, They won’t eat anything.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "　必生賢聖中，　　豐財具智慧。」",
        "translation": "They'll surely be born among the good and noble, rich in wealth and wisdom.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "爾時世尊重說頌言：大乘入楞伽經陀羅尼品第九爾時佛告大慧菩薩摩訶薩言：「大慧！",
        "translation": "It was then that the Bhagavān spoke a verse, saying, The ninth chapter of the dhāraṇī of the great vehicle entry into the Laṅkâvatāra-sūtra.",
        "source": "T16n0672_006:0624b11_13"
    },
    {
        "source_sentence": "過去未來現在諸佛，為欲擁護持此經者，皆為演說楞伽經呪，我今亦說，",
        "translation": "Those buddhas of the past, future, and present who want to preserve this scripture will all expound the spell of the Laṅkâvatāra-sūtra for those who want to preserve it.",
        "source": "T16n0672_006:0624c20_14"
    },
    {
        "source_sentence": "汝當受持。」",
        "translation": "You must accept and uphold it.",
        "source": "T16n0672_006:0624c22_15"
    },
    {
        "source_sentence": "即說呪曰：怛姪他(一)　覩吒覩吒(都騃反，下同)(二)　杜吒杜吒(三)　鉢吒鉢吒(四)　葛吒葛吒(五)　阿麼隷阿麼隷(六)　毘麼隷毘麼隷(七)　儞謎儞謎(八)　呬謎呬謎(九)　縛(扶可反)謎縛謎(十)　葛隷葛隷(十一)　揭囉葛隷(十二)　阿吒末吒(十三)　折吒咄吒(十四)　耆若(攘舸反，",
        "translation": "即說呪曰:姪他(一) 吒吒(都反,下同)(二) 杜吒杜吒(三) 鉢吒鉢吒(四) 葛吒葛吒(五) 阿麼隷阿麼",
        "source": "T16n0672_006:0624c22_16"
    },
    {
        "source_sentence": "二合)吒薩普(二合)吒(十五)　葛地(雜計反，下同)剌地(十六)　鉢地(十七)　呬謎呬謎(十八)　第謎(十九)　折隷折隷(二十)　鉢利鉢利(二十一)　畔第毘第(二十二)　案制滿制(二十三)　[黑*主](胝戶反，",
        "translation": "(2) Taṣāpāda (2) Taṣāpāda (2) Taṣāpāda (3) Kātṛkā (2) [黑*主] (戶反,",
        "source": "T16n0672_006:0624c27_17"
    },
    {
        "source_sentence": "下同)茶(去聲，下同)[口*(隸-木+士)](二十四)　杜茶[口*(隸-木+士)](二十五)　鉢茶[口*(隸-木+士)](二十六)　遏計遏計(二十七)　末計末計(二十八)　斫結斫結[口*(隸-木+士)](二合)(二十九)　地(依字呼)謎地謎(三十)　呬謎呬謎(三十一)　[黑*主][黑*主][黑*主][黑*主](三十二)　楮(笞矩反)楮楮楮(三十三)　杜杜杜(三十四)　杜虎(二合)杜虎杜虎杜虎(三十五)　莎婆訶(三十六)「大慧！",
        "translation": "下同)茶(去聲,下同)[口*(隸-木+士)](二十四) 杜茶[口*(隸-木+士)](二十五) 鉢茶[口*(隸-木+士",
        "source": "T16n0672_006:0625a01_18"
    },
    {
        "source_sentence": "未來世中，若有善男子、善女人，受持讀誦為他解說此陀羅尼，當知此人，",
        "translation": "In the future, if there are good men and good women who memorize, recite, and explain this dhāraṇī for others to understand, you should know that such people",
        "source": "T16n0672_006:0625a06_19"
    },
    {
        "source_sentence": "不為一切人與非人諸鬼神等之所得便；",
        "translation": "They won’t be given to all people or non-human spirits and so forth.",
        "source": "T16n0672_006:0625a07_20"
    },
    {
        "source_sentence": "若復有人卒中於惡，為其誦念一百八遍，即時惡鬼疾走而去。",
        "translation": "If another person suddenly falls into evil and recites it one hundred and eight times for them, the evil spirits quickly run away.",
        "source": "T16n0672_006:0625a08_21"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T16n0672_006:0625a10_22"
    },
    {
        "source_sentence": "我更為汝說陀羅尼。」",
        "translation": "I'll explain the dhāraṇī for you.",
        "source": "T16n0672_006:0625a10_23"
    },
    {
        "source_sentence": "即說呪曰：怛姪他(一)　鉢頭摩第鞞(二)　鉢頭迷(三)　醯(去聲，",
        "translation": "Then he uttered the following dhāraṇī: 姪他(一) 鉢頭摩第(二) 鉢頭迷(3) 醯(去聲,",
        "source": "T16n0672_006:0625a10_24"
    },
    {
        "source_sentence": "下同)泥醯禰醯泥(四)　隷主羅主隷(五)　虎隷虎羅虎隷(六)　庾隷庾隷(七)　跛隷跛羅跛隷(八)　嗔(上聲，",
        "translation": "下同)泥醯醯泥(四) 隷主羅主隷(五) 虎隷虎羅虎隷(六) 庾隷庾隷庾隷(七) 跛隷跛羅跛隷(八)  anger(上聲",
        "source": "T16n0672_006:0625a13_0"
    },
    {
        "source_sentence": "呼)第臏第(九)　畔逝末第(十)　尼羅迦隷(十一)　莎婆訶(十二)「大慧！",
        "translation": "(Skt. nirocana-paripṛcchā(sūtra) (9) pāgrāma (10) nirākāli (11) svāhā (12) great wisdom!",
        "source": "T16n0672_006:0625a14_1"
    },
    {
        "source_sentence": "若有善男子、善女人，受持讀誦為他解說此陀羅尼，不為一切天龍夜叉人非人等諸惡鬼神之所得便；",
        "translation": "If there are any sons and daughters of a virtuous family who preserve, recite, and explain this dhāraṇī for the understanding of others, they won’t be given to all the evil spirits like gods, dragons, yakṣas",
        "source": "T16n0672_006:0625a16_2"
    },
    {
        "source_sentence": "我為禁止諸羅剎故說此神呪，若持此呪則為受持入楞伽經，一切文句悉已具足。」",
        "translation": "I spoke this dhāraṇī for the sake of forbidding rāṣas, and if I hold it, I'll memorize and enter the Laṅkâvatāra-sūtra, which is fully endowed with all its words and phrases.",
        "source": "T16n0672_006:0625a18_3"
    },
    {
        "source_sentence": "大乘入楞伽經偈頌品第十之初",
        "translation": "The Beginning of the Tenth Chapter of the Great Vehicle Entry into the Laṅkâvatāra-sūtra",
        "source": "T16n0672_006:0625a21_0"
    },
    {
        "source_sentence": "「諸法不堅固，　　皆從分別生，",
        "translation": "The dharmas are not firm, All arise from discrimination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以分別即空，　　所分別非有。",
        "translation": "It's because discrimination is emptiness, and what's discriminated doesn't exist.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　由虛妄分別，　　是則有識生，",
        "translation": "Because of false discrimination, there is the arising of consciousness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　八九識種種，　　如海眾波浪。",
        "translation": "The eighth and ninth consciousnesses are various, like the ocean waves.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　習氣常增長，　　槃根堅固依，",
        "translation": "Accumulated energy always grows. The faculty of enlightenment is the basis of firmness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心隨境界流，　　如鐵於礠石。",
        "translation": "The mind follows the flow of objects, like iron on a piece of stone.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　眾生所依性，　　遠離諸計度，",
        "translation": "The essence on which sentient beings rely Is free of conceptual elaborations.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　及離智所知，　　轉依得解脫。",
        "translation": "Being free of knowledge and knowables, he transforms his reliance and attains liberation.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　得如幻三昧，　　超過於十地；",
        "translation": "Attaining the samādhi of illusoriness transcends ten stages.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　觀見心王時，　　想識皆遠離。",
        "translation": "When he observes the mind king, conceptions and consciousnesses are all far removed.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　爾時心轉依，　　是則為常住；",
        "translation": "At that moment the awarenesses evolve and depend. This is their eternal abiding.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　在於蓮花宮，　　幻境之所起。",
        "translation": "In the lotus-flower palace, it's produced by an illusory object.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　既住彼宮已，　　自在無功用；",
        "translation": "Having remained in that palace, They will be free and useless.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　利益諸眾生，　　如眾色摩尼。",
        "translation": "Benefiting sentient beings is like the jewel of all forms.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無有為無為，　　惟除妄分別；",
        "translation": "Nothing is conditioned or unconditioned, Except deluded discrimination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　愚夫迷執取，　　如石女夢子。",
        "translation": "Foolish people are deluded and cling to grasping, like a stone woman in a dream.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　應知補伽羅，　　蘊界諸緣等，",
        "translation": "You should know that the aggregates, elements, supporting objects, and so on.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　悉空無自性，　　無生有非有。",
        "translation": "They are all empty and without self-nature, And have neither arising nor non-arising.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　我以方便說，　　而實無有相；",
        "translation": "I explain it in terms of skillful means, Yet the reality has no marks.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　愚夫妄執取，　　能相及所相。",
        "translation": "Foolish people falsely cling to the subjective and objective marks.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　一切知非知，　　一切非一切；",
        "translation": "All know and not all know, And all are not all.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　愚夫所分別，　　佛無覺自他。",
        "translation": "Foolishly discriminated, the Buddha doesn't perceive self and others.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸法如幻夢，　　無生無自性；",
        "translation": "All things are like illusions and dreams, Without birth or self-nature.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以皆性空故，　　無有不可得。",
        "translation": "Because their natures are all empty, there's nothing that can't be obtained.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　我惟說一性，　　離於妄計度；",
        "translation": "I only speak of one essence, Freed from false imagination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　自性無有二，　　眾聖之所行。",
        "translation": "Their essential natures are not two, Practiced by the saints.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如四大不調，　　變吐見螢光；",
        "translation": "It is like the four elements that are not regulated, Which change and spit out to see the light of a firefly.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　所見皆非有，　　世間亦如是。",
        "translation": "None of what is seen exists: So it is with the world.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　猶如幻所現，　　草木瓦礫等；",
        "translation": "It’s like an illusion that appears, Like grass, trees, rubble, and dirt.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　彼幻無所有，　　諸法亦如是。",
        "translation": "These illusions have no existence, And so are all things.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　非取非所取，　　非縛非所縛；",
        "translation": "They are not grasped, not grasped by what is grasped; They are not bound or not bound.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如幻如陽焰，　　如夢亦如翳。",
        "translation": "They are like illusions, like mirages, Like dreams, and like flames.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若欲見真實，　　離諸分別取；",
        "translation": "If one wishes to see reality, One should be beyond all discriminating conceptions and grasping.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　應修真實觀，　　見佛必無疑。",
        "translation": "You should cultivate true contemplation, Seeing the Buddha without doubt.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　世間等於夢，　　色資具亦爾；",
        "translation": "The world and so forth are likewise in dreams, As are the objects of form.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若能如是見，　　身為世所尊。",
        "translation": "If someone can see it this way, they'll be honored in the world as a body.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　三界由心起，　　迷惑妄所見；",
        "translation": "The three realms arise from the mind. They are deluded and falsely perceived.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　離妄無世間，　　知已轉染依。",
        "translation": "Being free of delusion and lacking worldly existence, he knows that he's transformed the defiled basis.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　愚夫之所見，　　妄謂有生滅；",
        "translation": "Foolish people see birth and death as existence or non-existence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　智者如實觀，　　不生亦不滅。",
        "translation": "A wise person observes them as they really are, Not arising or ceasing.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　常行無分別，　　遠離心心法；",
        "translation": "They always practice without discrimination, Distancing themselves from thought and thought-concomitants.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　住色究竟天，　　離諸過失處。",
        "translation": "Abiding in the form ultimate heaven, they're free of faulty places.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　於彼成正覺，　　具力通自在；",
        "translation": "Having attained perfect enlightenment there, He has the power of supernormal knowledge and mastery.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　及諸勝三昧，　　現化於此成。",
        "translation": "and the superior samādhis, which are manifested here.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　化身無量億，　　遍遊一切處；",
        "translation": "Innumerable koṭis of mystical bodies They travel everywhere.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　令愚夫得聞，　　如響難思法。",
        "translation": "Causing foolish people to hear it is like the echo of an inconceivable dharma.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　遠離初中後，　　亦離於有無；",
        "translation": "Being far removed from the beginning, middle, and end, They are also far removed from existence and nonexistence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　非多而現多，　　不動而普遍。",
        "translation": "They are not numerous yet manifest to be numerous, Yet they are immutable yet universal.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　說眾生身中，　　所覆之性實；",
        "translation": "It is said that in the bodies of sentient beings, The nature covered is real.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　迷惑令幻有，　　非幻為迷惑。",
        "translation": "Delusion causes illusion to exist, but not illusion is delusion.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　由心迷惑故，　　一切皆悉有；",
        "translation": "Because the mind is deluded, Everything exists.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以此相繫縛，　　藏識起世間。",
        "translation": "To be bound by these characteristics, the store consciousness gives rise to the world.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如是諸世間，　　惟有假施設；",
        "translation": "Thus, all worlds Such as these Only have provisional designations.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸見如暴流，　　行於人法中。",
        "translation": "All views are like violent currents, Practiced among humans and dharmas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若能如是知，　　是則轉所依；",
        "translation": "If one can know it in this way, One will be the support of transmutation.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　乃為我真子，　　成就隨順法。",
        "translation": "That's my true child who accomplishes the following of the Dharma.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　愚夫所分別，　　堅濕暖動法；",
        "translation": "Foolish people discriminate hardness, humidity, heat and trembling as dharmas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　假名無有實，　　亦無相所相。",
        "translation": "What is nominal has no substance, And what has form has no characteristic marks.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　身形及諸根，　　皆以八物成；",
        "translation": "The body, form, and the faculties are all made of eight things.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　凡愚妄計色，　　迷惑身籠檻。",
        "translation": "Ordinary foolishly imagining form, they're deluded and caged in the body.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　凡愚妄分別，　　因緣和合生；",
        "translation": "Ordinary people, deludedly discriminating, Are born by the confluence of causes and conditions.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　不了真實相，　　流轉於三有。",
        "translation": "They don't understand the true characteristics, and they flow through the three existences.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　識中諸種子，　　能現心境界；",
        "translation": "The seeds in consciousness Can manifest the sphere of thought.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　愚夫起分別，　　妄計於二取。",
        "translation": "Foolish people give rise to discriminations, falsely imagining the two kinds of grasping.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無明愛及業，　　諸心依彼生；",
        "translation": "Lust for nescience and action, The minds that arise in dependence on them.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以是我了知，　　為依他起性。",
        "translation": "It's because I know it for the sake of other-dependently arisen nature.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　妄分別有物，　　迷惑心所行；",
        "translation": "They deludedly discriminate things as existence, Confounding the mind and its mental states.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　此分別都無，　　迷妄計為有。",
        "translation": "These discriminations are all nonexistent, and they're deluded and falsely imagined to exist.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心為諸緣縛，　　生起於眾生；",
        "translation": "The mind is bound by conditions, Producing sentient beings.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸緣若遠離，　　我說無所見。",
        "translation": "If the conditions were to be far removed, I would say that there is no view of anything.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　已離於眾緣，　　自相所分別；",
        "translation": "Having been freed from all conditions, They are distinguished by their distinctive characteristics.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　身中不復起，　　我為無所行。",
        "translation": "It doesn't arise again in the body, and I don't act for nothing.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　眾生心所起，　　能取及所取；",
        "translation": "What is produced by the minds of sentient beings Is grasped by those who grasp and what is grasped.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　所見皆無相，　　愚夫妄分別。",
        "translation": "All views have no marks, and foolish people falsely discriminate them.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　顯示阿賴耶，　　殊勝之藏識；",
        "translation": "He manifested the store consciousness of arraya, the supreme store consciousness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　離於能所取，　　我說為真如。",
        "translation": "Being free of grasping what's grasped by what's grasped, I say it's true.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　蘊中無有人，　　無我無眾生；",
        "translation": "In the aggregates there is no personality, There is no self and no sentient beings.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　生唯是識生，　　滅亦唯識滅。",
        "translation": "Birth is the only thing that gives rise to consciousness, and cessation is the only thing that ceases consciousness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　猶如畫高下，　　雖見無所有；",
        "translation": "It’s like a drawing that shows the high and low, Even though it appears to have no existence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸法亦如是，　　雖見而非有。",
        "translation": "So it is with all dharmas, which are seen but not existent.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如乾闥婆城，　　亦如熱時炎；",
        "translation": "It is like the city of Gandhāra And like the heat that burns when it is hot.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　所見恒如是，　　智觀不可得。",
        "translation": "What's seen is always like this, and wisdom and contemplation are unobtainable.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　因緣及譬喻，　　以此而立宗；",
        "translation": "The doctrine is established on the basis of these reasons and examples.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　乾城夢火輪，　　陽焰日月光。",
        "translation": "The dry city dreams of the fire wheel, its sun and moon shining with miraculous flames.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　火焰毛等喻，　　以此顯無生；",
        "translation": "The metaphor of fire, flame, hair, etc., Is to show the nonorigination of things.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　世分別皆空，　　迷惑如幻夢。",
        "translation": "Discrimination of the world is all emptiness, and delusion is like an illusion or a dream.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　見諸有不生，　　三界無所依；",
        "translation": "Seeing that all existences do not arise, they have no basis in any of the three realms.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　內外亦如是，　　成就無生忍。",
        "translation": "So it is with both inside and outside: Accomplishing the tolerance of nonorigination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　得如幻三昧，　　及以意生身；",
        "translation": "They attain samādhi like illusion And a body created by thought.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　種種諸神通，　　諸力及自在。",
        "translation": "Various kinds of mystical powers, Powers and sovereignty.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸法本無生，　　空無有自性；",
        "translation": "All things are fundamentally uncreated, And emptiness has no self-nature.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　迷惑諸因緣，　　而謂有生滅。",
        "translation": "They are deluded by the causes and conditions, Yet they think there is arising and ceasing.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　愚夫妄分別，　　以心而現心；",
        "translation": "Foolish people falsely discriminate, Showing mind by means of mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　及現於外色，　　而實無所有。",
        "translation": "And manifest external forms really have no existence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如定力觀見，　　佛像與骨鎖；",
        "translation": "Just as the power of concentration observes vision, Buddha images and bone chains.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　及分析大種，　　假施設世間。",
        "translation": "and analyzing the great seeds, they nominally define the world.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　身資及所住，　　此三為所取；",
        "translation": "The substance of the body and that which is sustained are grasped by these three.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　意取及分別，　　此三為能取。",
        "translation": "The mind grasps and discriminates. These three are the grasper.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　迷惑妄計著，　　以能所分別；",
        "translation": "Delusion, delusion, and attachment are discriminated by what’s capable and what’s not.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　但隨文字境，　　而不見真實。",
        "translation": "They simply follow the objects of words And do not see reality.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　行者以慧觀，　　諸法無自性；",
        "translation": "Practitioners observe with wisdom That all things have no-essence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　是時住無相，　　一切皆休息。",
        "translation": "At that point, they abide in signlessness, and all are at rest.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如以墨塗雞，　　無智者妄取；",
        "translation": "It is as if a fowl were to be smeared with black ink, And the ignorant would take it falsely.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　實無有三乘，　　愚夫不能見。",
        "translation": "There really are no three vehicles, which foolish people can't see.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若見諸聲聞，　　及以辟支佛；",
        "translation": "If they see śrāvakas And pratyekabuddhas, They’ll attain enlightenment.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　皆大悲菩薩，　　變化之所現。",
        "translation": "They are all manifestations of the great compassionate bodhisattva's transformation.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　三界唯是心，　　分別二自性；",
        "translation": "The three realms are only mind, Discriminating two self-natures.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　轉依離人法，　　是則為真如。",
        "translation": "Relying on the teaching that's free of people, this is true reality.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　日月燈光焰，　　大種及摩尼；",
        "translation": "The light of the sun and moon, the flames of the lamps, the primary elements and the jewels.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無分別作用，　　諸佛亦如是。",
        "translation": "The absence of discriminating effects Is likewise with the Buddhas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸法如毛輪，　　遠離生住滅；",
        "translation": "All dharmas are like a hair curl, divorced from birth, duration, and decay.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　亦離常無常，　　染淨亦如是。",
        "translation": "Being free of permanence and impermanent, The same applies to defilement and to purity.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如著陀都藥，　　見地作金色；",
        "translation": "It is as if you were wearing the sandalwood medicine And seeing the earth turn a golden color on your face.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　而實彼地中，　　本無有金相。",
        "translation": "In fact, there is no gold in that land.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　愚夫亦如是，　　無始迷亂心；",
        "translation": "Foolish people are also like this, Beginninglessly deluded and confused minds.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　妄取諸有實，　　如幻如陽焰。",
        "translation": "They falsely grasp the realities of existence as illusory and miraculous like mirages.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　應觀一種子，　　與非種同印；",
        "translation": "You should observe that one kind of seed Is the same mudrā as a nonseed.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　一種一切種，　　是名心種種。",
        "translation": "All kinds of one kind and all kinds are called the various kinds of mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　種種子為一，　　轉依為非種；",
        "translation": "The various kinds of seeds are one and the transmutation of the support is not the seed.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　平等同法印，　　悉皆無分別。",
        "translation": "Equality, the same as the mudrā of the Dharma, They all have no discrimination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　種種諸種子，　　能感諸趣生；",
        "translation": "Various kinds of seeds Are able to bring about rebirth in various states of being.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　種種眾雜苦，　　名一切種子。",
        "translation": "The various kinds of mixed suffering are called all seeds.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　觀諸法自性，　　迷惑不待遣；",
        "translation": "Observing the self-nature of all things, They are not hindered by delusion.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　物性本無生，　　了知即解脫。",
        "translation": "The nature of things is originally nonproduction, but knowing it is liberation.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　定者觀世間，　　眾色由心起；",
        "translation": "Concentration observes the world: All forms arise from mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無始心迷惑，　　實無色無心。",
        "translation": "The beginningless mind is deluded, but there really is no form and no mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如幻與乾城，　　毛輪及陽焰；",
        "translation": "It is like the illusion of a dry city, A hair curl and a sunbeam.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　非有而現有，　　諸法亦如是。",
        "translation": "Not existing but existing, So are all dharmas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　一切法不生，　　唯迷惑所見；",
        "translation": "All things do not arise, They are seen only by delusion.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以從迷妄生，　　愚妄計著二。",
        "translation": "It's because delusion arises from delusion, and deluded imagination and attachment are two.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　由種種習氣，　　生諸波浪心；",
        "translation": "By various kinds of habit energy They give rise to minds like waves.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若彼習斷時，　　心浪不復起。",
        "translation": "When these habits are abandoned, The waves of thought no longer arise.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心緣諸境起，　　如畫依於壁；",
        "translation": "Mind arises in dependence on all objects, Like a picture supporting itself on a wall.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　不爾虛空中，　　何不起於畫？",
        "translation": "If that's not the case in space, why isn't it painted?",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若緣少分相，　　令心得生者；",
        "translation": "If it is conditioned by partial characteristic marks, It causes awarenesses to arise.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心既從緣起，　　唯心義不成。",
        "translation": "Since mind arises from conditions, the meaning of mind alone is not established.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心性本清淨，　　猶若淨虛空；",
        "translation": "The nature of mind is inherently pure, Just as space is pure.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　令心還取心，　　由習非異因。",
        "translation": "By reason of their arising, they do not have different causes.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　執著自心現，　　令心而得起；",
        "translation": "Attaching to the manifestation of one’s own mind, They cause it to arise.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　所見實非外，　　是故說唯心。",
        "translation": "Because that which is seen really is not external, it's therefore said to be mind only.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　藏識說名心，　　思量以為意；",
        "translation": "The store consciousness calls it mind, Thinking of it as thought.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　能了諸境界，　　是則名為識。",
        "translation": "Being able to perceive objects is called consciousness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心常為無記，　　意具二種行；",
        "translation": "Mind always is indeterminate; Thought has two aspects:",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　現在識通具，　　善與不善等。",
        "translation": "The present consciousness is endowed with supernormal knowledge, Good and bad.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　證乃無定時，　　超地及諸剎；",
        "translation": "At the moment of realization there is no fixed one, transcending earth and all worlds.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　亦越於心量，　　而住無相果。",
        "translation": "They also transcend the measure of mind And abide in the fruit of signlessness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　所見有與無，　　及以種種相；",
        "translation": "What is seen to be existence and nonexistence, And various forms.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　皆是諸愚夫，　　顛倒所執著。",
        "translation": "They are all mistakenly attached by foolish people.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　智若離分別，　　物有則相違；",
        "translation": "If cognition is free of discrimination, things that exist will be at odds with each other.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　由心故無色，　　是故無分別。",
        "translation": "Because of the mind, there are no forms; Therefore there is no discrimination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸根猶如幻，　　境界悉如夢；",
        "translation": "The faculties are like illusions, All objects like dreams.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　能作及所作，　　一切皆非有。",
        "translation": "Neither that which can be done nor that which is done exists at all.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　世諦一切有，　　第一義則無；",
        "translation": "The conventional truth has all, But the ultimate truth does not.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸法無性性，　　說為第一義。",
        "translation": "All dharmas are devoid of essence, Which is said to be the ultimate truth.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　於無自性中，　　因諸言說故，",
        "translation": "In the absence of an essential nature, it's because of verbal explanations.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　而有物起者，　　是名為俗諦。",
        "translation": "When things arise, this is called the conventional truth.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若無有言說，　　所起物亦無；",
        "translation": "If there were no words, The things that are produced would also be nonexistent.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　世諦中無有，　　有言無事者。",
        "translation": "Nothing exists in the conventional truth, and there's something that says nothing.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　顛倒虛妄法，　　而實不可得；",
        "translation": "A distorted, false doctrine Is really ungraspable.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若倒是有者，　　則無無自性。",
        "translation": "If it really exists, Then there is no self-nature of nonexistence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以有無性故，　　而彼顛倒法；",
        "translation": "Because of existence and non-existence, They are the perverted states.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　一切諸所有，　　是皆不可得。",
        "translation": "All that exists Is ungraspable.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　惡習熏於心，　　所現種種相；",
        "translation": "The mind is perfumed by bad habits, Showing various forms.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　迷惑謂心外，　　妄取諸色像。",
        "translation": "Bewilderment means that outside the mind one falsely grasps forms and images.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　分別無分別，　　分別是可斷；",
        "translation": "Discrimination has no discrimination; Discrimination is to be abandoned.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無分別能見，　　實性證真空。",
        "translation": "They can see without discrimination, Realizing emptiness by its true nature.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無明熏於心，　　所現諸眾生；",
        "translation": "The mind is perfumed by ignorance, And the sentient beings it manifests.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如幻象馬等，　　及樹葉為金。",
        "translation": "It's like an illusory elephant, horse, etc., and a tree with leaves made of gold.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　猶如翳目者，　　迷惑見毛輪；",
        "translation": "It’s like someone with cataracts Who deludedly sees a hair curl.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　愚夫亦如是，　　妄取諸境界。",
        "translation": "Foolish people are likewise, deludedly grasping objects.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　分別所分別，　　及起分別者；",
        "translation": "Discriminated by discrimination, and those who give rise to discrimination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　轉所轉轉因，　　因此六解脫。",
        "translation": "The cause of transmutation and that which is transmutation are the six liberations.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　由於妄計故，　　無地無諸諦；",
        "translation": "Because of deluded imagination, There is no earth and no truths.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　亦無諸剎土，　　化佛及二乘。",
        "translation": "Nor are there any buddha-lands, apparitional buddhas, or the two vehicles.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心起一切法，　　一切處及身；",
        "translation": "The mind produces all things, All places and all bodies.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心性實無相，　　無智取種種。",
        "translation": "The nature of mind really has no characteristics, and there's no cognition to grasp various kinds.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　分別迷惑相，　　是名依他起；",
        "translation": "Discriminating and deluded characteristics are called other-dependent arising.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　相中所有名，　　是則為妄計。",
        "translation": "Whatever names exist in characteristics, This is a false imagination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸緣法和合，　　分別於名相，",
        "translation": "Conditioned by the conjunction of phenomena, they discriminate names and forms.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　此等皆不生，　　是則圓成實。",
        "translation": "All of these things don’t arise, and then they are perfectly real.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　十方諸剎土，　　眾生菩薩中，",
        "translation": "In the buddha-lands of the ten directions, Among sentient beings and enlightening beings,",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　所有法報佛，　　化身及變化，",
        "translation": "All the Dharma-retribution buddhas, Transformation bodies and transformations exist.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　皆從無量壽，　　極樂界中出；",
        "translation": "They all emerge from the realm of immeasurable life In the realm of ultimate bliss.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　於方廣經中，　　應知密意說。",
        "translation": "You should know that it's explained in the extensive sūtras with a hidden meaning.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　所有佛子說，　　及諸導師說，",
        "translation": "All the teachings of the Buddha-children and the teachings of the Guides.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　悉是化身說，　　非是實報佛。",
        "translation": "They are all said to be apparitional bodies, Not buddhas of real reward.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸法無有生，　　彼亦非非有，",
        "translation": "All things have no birth, Nor are they non-existent.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如幻亦如夢，　　如化如乾城。",
        "translation": "They are like illusions, like dreams, Like magic tricks, like dry castles.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　種種由心起，　　種種由心脫；",
        "translation": "Various kinds are produced by mind, and various kinds are liberated by mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心起更非餘，　　心滅亦如是。",
        "translation": "When awarenesses arise, there is nothing else. The same applies to the cessation of awarenesses.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以眾生分別，　　所現虛妄相；",
        "translation": "By discriminating sentient beings, They show unreal forms.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　惟心實無境，　　離分別解脫。",
        "translation": "Only mind really has no object, and it's free of discriminating liberation.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　由無始積集，　　分別諸戲論；",
        "translation": "Because of beginningless accumulation, Discriminating conceptual elaborations.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　惡習之所熏，　　起此虛妄境。",
        "translation": "Perfumed by bad habits, they give rise to this false object.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　妄計自性故，　　諸法皆無生；",
        "translation": "Because of deludedly imagining their own nature, All things have no birth.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　依止於緣起，　　眾生迷分別。",
        "translation": "Relying on dependent arising, sentient beings are deluded and discriminated.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　分別不相應，　　依他即清淨；",
        "translation": "Not associated with discrimination, other-dependent is purity.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　所住離分別，　　轉依即真如。",
        "translation": "The abode that's abiding is free of discrimination, and the transforming basis is true reality.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　勿妄計虛妄，　　妄計即無實；",
        "translation": "Don’t falsely conceptualize it as unreal, For that which is conceptualized is insubstantial.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　迷惑妄分別，　　取所取皆無。",
        "translation": "Delusion and deluded discrimination, grasping and grasping at all, are nonexistent.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　分別見外境，　　是妄計自性；",
        "translation": "Discrimination in regard to external objects Is the self-nature of deluded imagination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　由此虛妄計，　　緣起自性生。",
        "translation": "As a result of this false imagination, the self-nature of conditioned arising arises.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　邪見諸外境，　　無境但是心；",
        "translation": "Wrong views have external objects, but the absence of objects is only mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如理正觀察，　　能所取皆滅。",
        "translation": "Observing correctly according to principle, they all cease grasping what’s grasped by the subject and object.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如愚所分別，　　外境實非有；",
        "translation": "As foolishly discriminated, The external realm really does not exist.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　習氣擾濁心，　　似外境而轉。",
        "translation": "Accumulated energy disturbs the mind, resembling external objects.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　已滅二分別，　　智契於真如；",
        "translation": "Having extinguished the two kinds of discrimination, One’s knowledge accords with reality.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　起於無影像，　　難思聖所行。",
        "translation": "It arises from the absence of images, which are inconceivable to the noble.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　依父母和合，　　如蘇在於瓶；",
        "translation": "Relying on the union of father and mother, It is as if they were lying in a pot.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　阿賴耶意俱，　　令赤白增長。",
        "translation": "The store consciousness is accompanied by the manas, Causing red and white to grow.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　閉尸及稠胞，　　穢業種種生；",
        "translation": "Closing the corpse and the dense chamber, Defiled actions arise in various ways.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　業風增四大，　　出生如果熟。",
        "translation": "The wind of action increases by four elements: When arising, it is when mature.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　五與五及五，　　瘡竅有九種；",
        "translation": "4.5.29.11.6.1 There are nine kinds of sores: five, five and five.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　爪甲齒毛具，　　滿足即便生。",
        "translation": "Their nails, armor, teeth, hair, and hair ornaments Will all arise as soon as they are fulfilled.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　初生猶糞虫，　　亦如人睡覺；",
        "translation": "The first birth is like a dung beetle, Like a human drowning.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　眼開見於色，　　分別漸增長。",
        "translation": "When the eye is opened, it sees form, And gradually discriminates and increases.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　分別決了已，　　脣齶等和合；",
        "translation": "Having discriminated and determined them, His lips are pressed together like a combination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　始發於語言，　　猶如鸚鵡等。",
        "translation": "It's like a parrot and so forth.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　隨眾生意樂，　　安立於大乘；",
        "translation": "In accordance with the business and pleasures of all beings, They establish the Great Vehicle.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　非惡見行處，　　外道不能受。」",
        "translation": "It's not a place where bad views are practiced, and non-Buddhists can't accept it.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "「自內所證乘，　　非計度所行；",
        "translation": "The vehicle realized within oneself Is not something to be practiced by imagination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　願說佛滅後，　　誰能受持此？」",
        "translation": "May it be said that after the Buddha's passing away, who will be able to receive and uphold this?",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "「大慧汝應知，　　善逝涅槃後，",
        "translation": "“O Mahāprajāpatīṇa! You should know that after the nirvana of Buddha,",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　未來世當有，　　持於我法者。",
        "translation": "In the future there will be those who preserve my teaching.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　南天竺國中，　　大名德比丘；",
        "translation": "In the southern Indian kingdom of Jambudvfpa there was a great bhikṣu named Virtuous Bhikṣu.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　厥號為龍樹，　　能破有無宗。",
        "translation": "Their name is Nāgârjuna, which refutes the doctrine of existence and nonexistence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　世間中顯我，　　無上大乘法；",
        "translation": "In the world I reveal myself, The supreme teaching of the Great Vehicle.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　得初歡喜地，　　往生安樂國。",
        "translation": "Attaining the first ground of joy, they'll be reborn in the Land of Peace and Bliss.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　眾緣所起義，　　有無俱不可；",
        "translation": "The meaning of that which is produced by all conditions Is neither existent nor nonexistent at the same time.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　緣中妄計物，　　分別於有無；",
        "translation": "They falsely conceptualize things as existence and nonexistence, Discriminating between existence and nonexistence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如是外道見，　　遠離於我法。",
        "translation": "Such non-Buddhist views are far removed from self and dharmas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　一切法名字，　　生處常隨逐；",
        "translation": "The names of all things Always follow them where they are born.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　已習及現習，　　展轉共分別；",
        "translation": "Those who have practiced it and those who are practising it now Are, in turn, to be distinguished together.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若不說於名，　　世間皆迷惑；",
        "translation": "If they don’t explain names, All the worlds will be confused.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　為除迷惑故，　　是故立名言。",
        "translation": "In order to remove delusion, they therefore establish names and words.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　愚分別諸法，　　迷惑於名字；",
        "translation": "Foolishly discriminating all things, They are confused by names.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　及以諸緣生，　　是三種分別。",
        "translation": "These are the three kinds of differentiation:",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以不生不滅，　　本性如虛空；",
        "translation": "Because they do not arise or perish, Their original nature is like space.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　自性無所有，　　是名妄計相。",
        "translation": "The self-nature has no existence, which is called the mark of deluded imagination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如幻影陽焰，　　鏡像夢火輪；",
        "translation": "They are like illusions, shadows, mirages, flames, reflections, mirrors, images, dreams, and fire wheels.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如響及乾城，　　是則依他起。",
        "translation": "Like echoes and dry clouds, they are dependent on others.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　真如空不二，　　實際及法性；",
        "translation": "The true nature of emptiness is not two: reality and the essence of dharmas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　皆無有分別，　　我說是圓成。",
        "translation": "They all have no discrimination, and I say they are perfectly formed.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　語言心所行，　　虛妄墮二邊；",
        "translation": "Whatever speaks and what acts, They falsely fall into two extremes.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　慧分別實諦，　　是慧無分別。",
        "translation": "Wisdom discriminates the true truth, which is wisdom without discrimination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　於智者所現，　　於愚則不現；",
        "translation": "What is manifested by the wise, Is not manifested by the ignorant.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如是智所現，　　一切法無相。",
        "translation": "Such is the knowledge that manifests All things are signless.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如假金瓔珞，　　非金愚謂金；",
        "translation": "Like a fake gold necklace, it’s not gold and foolishly called gold.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸法亦如是，　　外道妄計度。",
        "translation": "So it is with all dharmas, which non-Buddhists falsely conceptualize.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸法無始終，　　住於真實相；",
        "translation": "All things have no beginning or end, Abiding in true characteristics.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　世間皆無作，　　妄計不能了。",
        "translation": "The world is unconstructed, And cannot be comprehended by deluded imagination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　過去所有法，　　未來及現在；",
        "translation": "All things that exist in the past, Will exist in the future and are present.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如是一切法，　　皆悉是無生。",
        "translation": "All things like this Are all nonoriginated.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸緣和合故，　　是故說有法；",
        "translation": "Because of the conjunction of conditions, Therefore it is said to have dharmas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若離於和合，　　不生亦不滅。",
        "translation": "If they part with the conjunction, They won’t arise or cease.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　而諸緣起法，　　一異不可得；",
        "translation": "The dharmas that are dependently-arisen cannot be different from one another.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　略說以為生，　　廣說則為滅。",
        "translation": "In brief it is said to arise; In detail it is said to be destroyed.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　一是不生空，　　一復是生空；",
        "translation": "The first is the emptiness of nonorigination, and the second is the emptiness of origination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　不生空為勝，　　生空則滅壞。",
        "translation": "The nonarising of emptiness is superior, and the arising of emptiness ceases and disintegrates.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　真如空實際，　　涅槃及法界；",
        "translation": "Truth is emptiness, reality, nirvana, and the cosmos.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　種種意生身，　　我說皆異名。",
        "translation": "The various kinds of mind-made bodies I teach are all different names.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　於諸經律論，　　而起淨分別；",
        "translation": "In the scriptures, vinaya, and treatises They give rise to pure discrimination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若不了無我，　　依教不依義，",
        "translation": "If someone doesn’t understand selflessness, Relying on the teaching and not on the meaning,",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　眾生妄分別，　　所見如兔角，",
        "translation": "Sentient beings deludedly discriminate, Seeing what’s like a rabbit’s horn.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　分別即迷惑，　　如渴獸逐焰。",
        "translation": "Discrimination is delusion, like a thirsty beast chasing a flame.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　由於妄執著，　　而起於分別；",
        "translation": "As a result of their false attachment, They give rise to discrimination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若離妄執因，　　分別則不起。",
        "translation": "If one were to be free of falsely grasping causes, Discrimination would not arise.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　甚深大方廣，　　知諸剎自在；",
        "translation": "Profound and vast, They know all worlds freely.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　我為佛子說，　　非為諸聲聞。",
        "translation": "I teach it for the sake of the heirs of the Buddha, not for the sake of śrāvakas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　三有空無常，　　遠離我我所；",
        "translation": "The third is emptiness and impermanence of existence, Being far removed from self and what belongs to self.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　我為諸聲聞，　　如是總相說。",
        "translation": "I explain this general characteristic for the sake of śrāvakas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　不著一切法，　　寂淨獨所行；",
        "translation": "They do not cling to all things, Acting alone in peace and purity.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　思念辟支果，　　我為彼人說。",
        "translation": "Thinking of the fruit of pratyekabuddhahood, I explain it for that person.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　身是依他起，　　迷惑不自見；",
        "translation": "The body is dependent on others, Being deluded and not seeing for itself.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　分別外自性，　　而令心妄起。",
        "translation": "Discriminating their own nature outside, They cause minds to arise falsely.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　報得及加持，　　諸趣種類生；",
        "translation": "Retribution, attainment and support are born in all kinds of destinies.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　及夢中所得，　　是神通四性。",
        "translation": "These are the four natures of supernormal knowledge and that which is acquired in a dream.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　夢中之所得，　　及以佛威力；",
        "translation": "What they had attained in their dreams, As well as the power of buddhas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸趣種類等，　　皆非報得通。",
        "translation": "None of the courses, etc., are acquired through retribution.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　習氣熏於心，　　似物而影起；",
        "translation": "Accumulated energy perfumes the mind, Appearing like objects with reflected images.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　凡愚未能悟，　　是故說為生。",
        "translation": "Ordinary and ignorant beings are not enlightened: that is why they are said to arise.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　隨於妄分別，　　外相幾時有；",
        "translation": "Depending on deluded discrimination, How many moments are the external characteristics present?",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　爾所時增妄，　　不見自心迷。」",
        "translation": "At that point, they become increasingly deluded and don't see their own mind as deluded.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "「何以說有生，　　而不說所見；",
        "translation": "Why does the Buddha teach that there is birth, Yet he does not teach what is seen?",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無所見而見，　　為誰云何說？」",
        "translation": "If you see nothing but see it, who will explain it?",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "「心體自本淨，　　意及諸識俱；",
        "translation": "The essence of mind itself is inherently pure, Consisting of thought and all conscious constructs.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　習氣常熏故，　　而作諸濁亂。",
        "translation": "Because habit energy always perfumes, It creates turbidity and confusion.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　藏識捨於身，　　意乃求諸趣；",
        "translation": "The store consciousness abandons the body, while the mind seeks all states of being.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　識迷似境界，　　見已而貪取。",
        "translation": "Consciousness is deluded about seeming objects, and after seeing them, it clings to them.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　所見唯自心，　　外境不可得；",
        "translation": "What they see is only their own mind; The external objects are ungraspable.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若修如是觀，　　捨妄念真如。",
        "translation": "If someone cultivates this kind of contemplation, they'll abandon deluded mindfulness of the true nature.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸定者境界，　　業及佛威力；",
        "translation": "Concentrations are the sphere, Karma and the power of buddhas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　此三不思議，　　難思智所行。",
        "translation": "These three are inconceivable, Actions of inconceivable knowledge.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　過未補伽羅，　　虛空及涅槃；",
        "translation": "The past and future buddhas, space and nirvana.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　我隨世俗事，　　真諦離文字。",
        "translation": "The self follows worldly affairs, but the true truth is free of words.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　二乘及外道，　　同依止諸見；",
        "translation": "The two vehicles and non-Buddhists are the same as relying on views.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　迷惑於唯心，　　妄分別外境。",
        "translation": "They are deluded in the mind-only, Falsely discriminating external objects.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　羅漢辟支佛，　　及以佛菩提；",
        "translation": "The arhats and pratyekabuddhas, And the enlightenment of buddhas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　種子堅成就，　　夢佛灌其頂。」",
        "translation": "The seeds are firmly planted, and the Buddha pours them on their heads in a dream.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "「心幻趣寂靜，　　何為說有無？",
        "translation": "The mind is an illusory state of quiescence, so why does it say there's existence and nonexistence?",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　何處及為誰？　　何故願為說。」",
        "translation": "Where and for whom? Why do you wish to explain it?”",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "「迷惑於惟心，　　故說幻有無；",
        "translation": "“Confusion is only in the mind; Therefore, it is said that illusion exists or does not exist.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　生滅相相應，　　相所相平等。",
        "translation": "The characteristics of arising and ceasing are conjoined; The characteristics and the characteristics that are to be characterized are equal.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　分別名意識，　　及與五識俱；",
        "translation": "Discrimination is called manas consciousness, and it is associated with the five forms of consciousness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如影像暴流，　　從心種子起。",
        "translation": "They are like the violent flow of images, Produced from the seeds of mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若心及與意，　　諸識不起者；",
        "translation": "If mind and thought don’t arise, the conscious constructs won’t arise.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　即得意生身，　　亦得於佛地。",
        "translation": "That is, he attains the body that gives rise to mind and also attains the Buddhahood.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸緣及蘊界，　　人法之自相；",
        "translation": "Conditions and aggregates are the specific characteristics of humans and dharmas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　皆心假施設，　　如夢及毛輪。",
        "translation": "They are all nominally defined by the mind, like dreams and hair circles.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　觀世如幻夢，　　依止於真實；",
        "translation": "Observing the world is like an illusion or a dream, Relying on reality.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　真實離諸相，　　亦離因相應。",
        "translation": "True reality is free of signs, And also free of causality.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　聖者內所證，　　常住於無念；",
        "translation": "What the noble one realizes internally, He always abides in thoughtlessness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　迷惑因相應，　　執世間為實。",
        "translation": "Concomitant with the causes of delusion, they cling to the world as reality.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　一切戲論滅，　　迷惑則不生；",
        "translation": "All conceptual elaborations cease, And delusion does not arise.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　隨有迷分別，　　癡心常現起。",
        "translation": "Concomitant with delusion and discrimination, the mind of delusion always appears.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸法空無性，　　而是常無常；",
        "translation": "The emptiness of all things has no essence, Yet is eternal and impermanent.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　生論者所見，　　非是無生論。",
        "translation": "What the theories of arising see Is not what the theories of nonarising see.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　一異俱不俱，　　自然及自在；",
        "translation": "Both one and the other are simultaneous, naturally and freely.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　時微塵勝性，　　緣分別世間。",
        "translation": "The supreme nature of the atoms at that time Is conditioned by discriminating worlds.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　識為生死種，　　有種故有生；",
        "translation": "Consciousness is the seed of birth and death; Because it has seeds, there is birth.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如畫依於壁，　　了知即便滅。",
        "translation": "It's like a painting that relies on a wall and perceives it even when it ceases.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　譬如見幻人，　　而有幻生死；",
        "translation": "It is like seeing an illusory person Who has illusory births and deaths.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　凡愚亦如是，　　癡故起縛脫。",
        "translation": "Ordinary foolish people are likewise: Because of delusion, they give rise to bondage and liberation.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　內外二種法，　　及以彼因緣；",
        "translation": "The two kinds of factors internal and external, as well as their causes and conditions.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　修行者觀察，　　皆住於無相。",
        "translation": "Practitioners observe that they all abide in signlessness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　習氣不離心，　　亦不與心俱；",
        "translation": "Accumulated energy is not separate from mind, Nor does it associate with mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　雖為習所纏，　　心相無差別。",
        "translation": "Even though they are bound by habits, There is no difference in the characteristics of mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心如白色衣，　　意識習為垢；",
        "translation": "The mind is like white cloth, stained by the habits of consciousness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　垢習之所污，　　令心不顯現。",
        "translation": "They are stained by the defilements of accumulation, which prevent their minds from appearing.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　我說如虛空，　　非有亦非無；",
        "translation": "I teach that it is like space, Neither existent nor nonexistent.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　藏識亦如是，　　有無皆遠離。",
        "translation": "The store consciousness is also like this, Being free of both existent and nonexistent.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　意識若轉依，　　心則離濁亂；",
        "translation": "If the thinking consciousness evolves as a support, The mind will be free from turbidity and confusion.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　我說心為佛，　　覺了一切法。",
        "translation": "I teach that mind is the Buddha Who perceives all dharmas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　永斷三相續，　　亦離於四句；",
        "translation": "Forever annihilating the three continuities, They are also free of the four phrases.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　有無皆捨離，　　諸有恒如幻。",
        "translation": "Existence and nonexistence are all abandoned, and existences are always illusory.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　前七地心起，　　故有二自性；",
        "translation": "The first seven stages are produced by awarenesses. Therefore, they have two specific natures:",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　餘地及佛地，　　悉是圓成實。",
        "translation": "The other stages and the Buddha-stage are all perfected.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　欲色無色界，　　及以於涅槃；",
        "translation": "In the realm of sexual passion, in the one of form and in the one of formlessness, and also by means of nirvana.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　於彼一切身，　　皆是心境界。",
        "translation": "In all those bodies, they're all the objects of mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　隨其有所得，　　是則迷惑起；",
        "translation": "Depending on what they attain, Confusion will arise.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若覺自心已，　　迷惑則不生。",
        "translation": "If someone perceives their own mind, confusion won't arise.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　我立二種法，　　諸相及以證；",
        "translation": "I establish two kinds of factors: characteristic marks and the ones to be realized.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以四種理趣，　　方便說成就。",
        "translation": "Because of the fourfold doctrine, They are said to be accomplished by expedient means.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　見種種名相，　　是迷惑分別；",
        "translation": "Seeing various names and forms Is delusion and discrimination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若離於名相，　　性淨聖所行。",
        "translation": "If they are free of names and marks, their nature is pure and noble.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　隨能所分別，　　則有妄計相；",
        "translation": "Depending on the discrimination of subject and object, There will be deludedly imagined marks.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若離彼分別，　　自性聖所行。",
        "translation": "If they are free of that discrimination, They are by their own nature the practices of the noble ones.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心若解脫時，　　則常恒真實；",
        "translation": "When the mind is liberated, It is always and eternally true.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　種性及法性，　　真如離分別。",
        "translation": "The nature of seeds and the nature of dharmas are truly free of discrimination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以有清淨心，　　而有雜染現；",
        "translation": "Because they have pure minds, They manifest defilement.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無淨則無染，　　真淨聖所行。",
        "translation": "When there's no purity, there's no defilement, and it's truly pure and noble practice.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　世間從緣生，　　增長於分別；",
        "translation": "The world arises from conditions, Increasing by discrimination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　觀彼如幻夢，　　是時即解脫。",
        "translation": "Observing them as illusory dreams, this is the time of liberation.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　種種惡習氣，　　與心和合故；",
        "translation": "All kinds of bad habit energy Are combined with the mind:",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　眾生見外境，　　不覩心法性。",
        "translation": "Sentient beings see external objects and don’t discriminate between mind and dharmas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心性本清淨，　　不生諸迷惑；",
        "translation": "The mind inherently pure, It does not give rise to delusion.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　迷從惡習起，　　是故不見心。",
        "translation": "Because delusion arises from bad habits, it doesn't see mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　唯迷惑即真，　　真實非餘處；",
        "translation": "Only delusion is the truth, And reality is no other place.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以諸行非行，　　非餘處見故。",
        "translation": "Because formations are no formations: because they are not seen elsewhere.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若觀諸有為，　　遠離相所相；",
        "translation": "If one observes conditioned things, One will be far removed from signs and marks.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以離眾相故，　　見世惟自心。",
        "translation": "Because they are free of all marks, They see the world only as their own mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　安住於唯心，　　不分別外境；",
        "translation": "Abiding in mind-only, They do not discriminate external objects.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　住真如所緣，　　超過於心量。",
        "translation": "He abides in the true reality that's the perceptual object, which is beyond the measure of his mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若超過心量，　　亦超於無相；",
        "translation": "If one goes beyond the bounds of thought, One also goes beyond signlessness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以住無相者，　　不見於大乘。",
        "translation": "Those who abide in signlessness don't see the great vehicle.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　行寂無功用，　　淨修諸大願；",
        "translation": "Practicing in quiescence without exertion, They purify the great vows.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　及我最勝智，　　無相故不見。",
        "translation": "And the supreme knowledge of the Supreme One Is not seen because it has no characteristics.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　應觀心所行，　　亦觀智所行；",
        "translation": "You should observe what the mind does, And also observe what knowledge does.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　觀見慧所行，　　於相無迷惑。",
        "translation": "What's practiced by the wisdom of contemplation and vision, there's no confusion about marks.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心所行苦諦，　　智所行是集；",
        "translation": "The noble truth of the mind’s action is frustration; what knowledge does is accumulation.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　餘二及佛地，　　皆是慧所行。",
        "translation": "The other dharmas and the stages of enlightenment are all conditioned by wisdom.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　得果與涅槃，　　及以八聖道；",
        "translation": "Attaining the fruit and nirvana, And the eightfold noble path.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　覺了一切法，　　是佛清淨智。",
        "translation": "To perceive all dharmas is the Buddha’s pure knowledge.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　眼根及色境，　　空明與作意；",
        "translation": "The eye faculty and material objects are with emptiness, light and attention.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　故令從藏識，　　眾生眼識生。",
        "translation": "Therefore, it causes the eye consciousness to arise from the store consciousness for sentient beings.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　取者能所取，　　名事俱無有；",
        "translation": "Grasping is grasping what is grasped by the subject and object. Names and things do not exist at all.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無因妄分別，　　是為無智者。",
        "translation": "The absence of causes and deluded discrimination is the absence of wisdom.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　名義互不生，　　名義別亦爾；",
        "translation": "Names and meanings don’t arise from each other, So are names and meanings distinct.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　計因無因生，　　不離於分別。",
        "translation": "They impute causes and no causes to arise, Yet don’t part from discrimination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　妄謂住實諦，　　隨見施設說；",
        "translation": "They falsely claim to abide in the true truth, Explaining it according to views and imaginations.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　一性五不成，　　捨離於諦義。",
        "translation": "The meaning of indifference regarding the truths is that one nature and five are not settled.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　戲論於有無，　　應超此等魔；",
        "translation": "To speculate about existence and nonexistence, One should transcend all these demons.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以見無我故，　　不妄求諸有。",
        "translation": "Because they see selflessness, They don’t falsely seek existence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　計作者為常，　　呪術與諍論；",
        "translation": "They think that the maker is eternal, And they discuss sorcery and divisive speech.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　實諦離言說，　　而見寂滅法。",
        "translation": "The true truth is that they are beyond words And yet they see the principle of extinction.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　依於藏識故，　　而得有意轉；",
        "translation": "Depending on the store consciousness, They attain mental evolving.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心意為依故，　　而有諸識生。",
        "translation": "Consciousnesses arise because mind and thought are their supports.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　虛妄所立法，　　及心性真如；",
        "translation": "The teachings that are based on falsehood, As well as the reality of mind and its nature.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　定者如是觀，　　通達唯心性。",
        "translation": "Concentration is thus observed, comprehending the mind-only nature of mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　觀意與相事，　　不念常無常；",
        "translation": "Observing the things of mind and characteristics, He does not think that they are permanent or impermanent.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　及以生不生，　　不分別二義。",
        "translation": "And because it arises and doesn't arise, it doesn't discriminate between two meanings.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　從於阿賴耶，　　生起於諸識；",
        "translation": "Consciousnesses arise from the store consciousness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　終不於一義，　　而生二種心。",
        "translation": "They never give rise to two kinds of mind in a single meaning.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　由見自心故，　　非空非言說；",
        "translation": "Because they see their own minds, They are neither empty nor verbally expressed.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若不見自心，　　為見網所縛。",
        "translation": "If someone doesn't see their own mind, they're bound by the web of views.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸緣無有生，　　諸根無所有；",
        "translation": "Conditioned things have no birth, The faculties have no existence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無貪無蘊界，　　悉無諸有為。",
        "translation": "The absence of craving and the aggregates and realms, There are no existent things at all.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　本無諸業報，　　無作無有為；",
        "translation": "Originally there is no retribution of actions, Nothing done, nothing conditioned.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　執著本來無，　　無縛亦無脫。",
        "translation": "Attachment is originally nonexistent, and there's no fetter or liberation.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無有無記法，　　法非法皆無；",
        "translation": "There are no indeterminate dharmas, And neither is there a dharma or non-dharma.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　非時非涅槃，　　法性不可得。",
        "translation": "Neither time nor nirvāṇa Is the Dharma-nature, which is ungraspable.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　非佛非真諦，　　非因亦非果；",
        "translation": "They are neither buddhas nor true truths, Neither cause nor effect.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　非倒非涅槃，　　非生亦非滅。",
        "translation": "Neither error nor nirvāṇa, neither arising nor ceasing.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　亦無十二支，　　邊無邊非有；",
        "translation": "Nor are there any twelve limbs, Which have no limits and no limits.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　一切見皆斷，　　我說是唯心。",
        "translation": "All views are abandoned: I teach that it is mind only.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　煩惱業與身，　　及業所得果；",
        "translation": "The defiled action, the body and the fruit acquired by action:",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　皆如焰如夢，　　如乾闥婆城。",
        "translation": "They are all like flames and dreams, Like the city of Gandhāra.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以住唯心故，　　諸相皆捨離；",
        "translation": "Because they abide in mind only, They abandon all marks.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以住唯心故，　　能見於斷常。",
        "translation": "Because they abide only in mind, They can see annihilation and permanence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　涅槃無諸蘊，　　無我亦無相；",
        "translation": "Nirvana has no aggregates, No self and no characteristics.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以入於唯心，　　轉依得解脫。",
        "translation": "By entering mind-only, he transforms his reliance and attains liberation.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　惡習為因故，　　外現於大地；",
        "translation": "Because bad habits are the cause, They appear externally in the great earth.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　及以諸眾生，　　唯心無所見。",
        "translation": "It's because all sentient beings see nothing but mind.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　身資土影像，　　眾生習所現；",
        "translation": "The images of the body, provisions, and lands Are produced by beings according to their habits.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心非是有無，　　習氣令不顯。",
        "translation": "Mind is neither existent nor nonexistent; Accumulated energy causes it not to be manifested.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　垢現於淨中，　　非淨現於垢；",
        "translation": "Defilement manifests in the pure, What is not pure manifests in the defiled.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　如雲翳虛空，　　心不現亦爾。",
        "translation": "Like clouds covering the sky, So is the mind unmanifest.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　妄計性為有，　　於緣起則無；",
        "translation": "The nature of deluded imagination is existence, but not dependent origination.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　以妄計迷執，　　緣起無分別。",
        "translation": "Because of deluded conceptualization and deluded attachment, there's no discrimination in conditioned arising.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　非所造皆色，　　有色非所造；",
        "translation": "What is not created is all form, and what is formless is not created.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　夢幻焰乾城，　　此等非所造。",
        "translation": "The illusions, flames, and dry cities are not created by anyone.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若於緣生法，　　謂實及不實；",
        "translation": "Conditioned dharmas are real and unreal:",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　此人決定依，　　一異等諸見。",
        "translation": "Such views are the support of certainty for this person.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　聲聞有三種，　　願生與變化；",
        "translation": "There are three kinds of sravakas: those born by vows and those born by transformation.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　及離貪瞋等，　　從於法所生。",
        "translation": "They arise from the dharmas and are free of covetousness, anger, etc.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　菩薩亦三種，　　未有諸佛相；",
        "translation": "Enlightening beings are also threefold: They do not yet have the characteristics of buddhas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　思念於眾生，　　而現於佛像。",
        "translation": "Thinking of sentient beings, They manifest buddha images.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　眾生心所現，　　皆從習氣生；",
        "translation": "The manifestations of sentient beings’ minds All arise from habit energy.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　種種諸影像，　　如星雲日月。",
        "translation": "The various images are like clouds of stars, clouds, suns, and moons.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若大種是有，　　可有所造生；",
        "translation": "If the primary elements are present, something can be produced.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　大種無性故，　　無能相所相。",
        "translation": "Because the primary elements have no essence, There is no subjective or objective characteristic.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　大種是能造，　　地等是所造；",
        "translation": "The primary elements are what can make them; earth, etc., are what makes them.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　大種本無生，　　故無所造色。",
        "translation": "The primary elements are originally nonarisen; Therefore, there is no derivative form.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　假實等諸色，　　及幻所造色；",
        "translation": "Forms such as provisional and real, And forms created by illusion.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　夢色乾城色，　　焰色為第五。",
        "translation": "The form of a dream is the form of dryness, and the form of a flame is the fifth.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　一闡提五種，　　種性五亦然，",
        "translation": "The icchantika is of five forms: the same applies to the five kinds by nature.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　五乘及非乘，　　涅槃有六種，",
        "translation": "The nirvana of the five vehicles and of what is not a vehicle:",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸蘊二十四，　　諸色有八種，",
        "translation": "The dharmas are twenty-four in number. Form is eightfold:",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　佛有二十四，　　佛子有二種。",
        "translation": "The Buddha has twenty-four. There are two kinds of heirs of the Buddha:",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　法門有百八，　　聲聞有三種，",
        "translation": "There are one hundred and eight aspects of the doctrine. The sravakas have three kinds:",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸佛剎惟一，　　佛一亦復然。",
        "translation": "The buddha-lands are only one: So is the Buddha’s oneness.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　解脫有三種，　　心流注有四，",
        "translation": "Deliverance is of three kinds. There are four in the stream of thought.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無我有六種，　　所知亦有四。",
        "translation": "The absence of self is of six forms. There are also four that are known.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　遠離於作者，　　及離諸見過；",
        "translation": "Seclusion from the author, And seclusion from all views and errors.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　內自證不動，　　是無上大乘。",
        "translation": "To realize for oneself that it doesn't move is the unsurpassed great vehicle.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　生及與不生，　　有八種九種；",
        "translation": "The arising and the non-arising are eight kinds and nine kinds.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　一念與漸次，　　證得宗唯一。",
        "translation": "One thought and the gradual one are, in succession, the only doctrine of realization.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　無色界八種，　　禪差別有六，",
        "translation": "In the one of formlessness, it is eightfold. There are six differences in trance.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　辟支諸佛子，　　出離有七種。",
        "translation": "The offspring of Buddha, the pratyekabuddhas: There are seven kinds of emancipation.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　三世悉無有，　　常無常亦無；",
        "translation": "The past, present, and future are all nonexistent, And neither is permanence nor impermanence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　作業及果報，　　皆如夢中事。",
        "translation": "The action and its retribution are all like the events in a dream.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸佛本不生，　　為聲聞佛子；",
        "translation": "The Buddhas do not arise in the first place, Because they are the offspring of hearers and buddhas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　心恒不能見，　　如幻等法故。",
        "translation": "The mind is always unable to see, because it's like illusory dharmas.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　故於一切剎，　　從兜率入胎；",
        "translation": "Thus in all the buddha-lands They descended from Tuṣita and entered the womb.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　初生及出家，　　不從生處生。",
        "translation": "The first birth and renunciation do not arise from the place of rebirth.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　為流轉眾生，　　而說於涅槃；",
        "translation": "He teaches nirvana For the sake of transmigrating beings.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸諦及諸剎，　　隨機令覺悟。",
        "translation": "The truths and the buddhas They cause to be enlightened according to their capacities.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　世間洲樹林，　　無我外道行；",
        "translation": "In the worldly continents and forests, there are no selfless non-Buddhist practices.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　禪乘阿賴耶，　　果境不思議。",
        "translation": "The store consciousness of the meditation vehicle is inconceivable in terms of its fruit.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　星宿月種類，　　諸王諸天種；",
        "translation": "The stars, constellations, moons, and various kinds of celestial beings.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　乾闥夜叉種，　　皆因業愛生。",
        "translation": "The dry and dry yakṣa seeds all arise because of karma and craving.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　不思變易死，　　猶與習氣俱；",
        "translation": "They do not think of transmigration and death, Yet they are still accompanied by habit energy.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若死永盡時，　　煩惱網已斷。",
        "translation": "When death is permanently extinguished, the web of afflictions has been cut off.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　財穀與金銀，　　田宅及僮僕，",
        "translation": "Wealth, grain, gold, silver, land, homes, and servants.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　象馬牛羊等，　　皆悉不應畜。",
        "translation": "No elephants, horses, cattle, or sheep should be kept.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　不臥穿孔床，　　亦不泥塗地，",
        "translation": "He doesn’t lie on a hole-through bed, Nor does he rub mud on the ground.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　金銀銅鉢等，　　皆悉不應畜。",
        "translation": "You should not store gold, silver, copper bowls, or the like.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　土石及與鐵，　　蠡及頗梨器，",
        "translation": "It's made of earthen stones and iron, Li and crystal vessels.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　滿於摩竭量，　　隨鉢故聽畜。",
        "translation": "It's the full extent of Magadha, so it's allowed to be stored according to the bowl.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　常以青等色，　　牛糞泥果葉，",
        "translation": "They always use such colors as blue, cow dung, mud, fruit, leaves, and so forth.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　染白欽婆等，　　令作袈裟色。",
        "translation": "dye white khaṭṭika and so forth to make the color of the reddish-brown robes.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　四指量刀子，　　刀如半月形，",
        "translation": "The four-pronged sword is like a crescent moon shape.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　為以割截衣，　　修行者聽畜。",
        "translation": "In order to cut off their clothes, the practitioners listen and store them.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　勿學工巧明，　　亦不應賣買，",
        "translation": "Don't train in the knowledge of craftsmanship, and don't sell or buy.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若須使淨人，　　此法我所說。",
        "translation": "If it's necessary to make a pure person, this teaching is self-explained by me.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　常守護諸根，　　善解經律義，",
        "translation": "Always guarding their faculties, they well understand the meaning of scriptures and vinaya.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　不狎諸俗人，　　是名修行者。",
        "translation": "Not pitying laypeople is called a practitioner.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　樹下及巖穴，　　野屋與塚間，",
        "translation": "At the foot of a tree or in a cave, There are wild houses and cemetery mounds.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　草窟及露地，　　修行者應住。",
        "translation": "The practitioner should stay in a grass cave or an open space.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　塚間及餘處，　　三衣常隨身，",
        "translation": "In a tomb or elsewhere, the three garments are always on his body.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　若闕衣服時，　　來施者應受。",
        "translation": "If there is a lack of clothing, the donor who comes should accept it.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　乞食出遊行，　　前視一尋地；",
        "translation": "Begging for food and going out on excursions, he looked ahead to the place where he was staying.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　攝念而行乞，　　猶如蜂採花。",
        "translation": "He collects his thoughts and begs, just like a bee gathering flowers.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　閙眾所集處，　　眾雜比丘尼；",
        "translation": "At the place where the assembly was assembled, there were many mixed bhikṣus and nuns.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　活命與俗交，　　皆不應乞食。",
        "translation": "A living being and a layman shouldn't both solicit alms.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　諸王及王子，　　大臣與長者，",
        "translation": "The kings, princes, ministers, and wealthy people.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　修行者乞食，　　皆不應親近。",
        "translation": "A practitioner who begs for food shouldn't be intimate with anyone.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　生家及死家，　　親友所愛家，",
        "translation": "The home of birth and the home of death, the house beloved by friends and relatives,",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　僧尼和雜家，　　修行者不食。",
        "translation": "Monks, nuns, and mixed-practitioners won't eat it.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　寺中烟不斷，　　常作種種食，",
        "translation": "In the monastery, smoke doesn’t cease, and various foods are always prepared.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　及故為所造，　　修行者不食。",
        "translation": "And because it's therefore created, the practitioner doesn't eat it.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　行者觀世間，　　能相與所相；",
        "translation": "Practitioner observes the world, What can be characterized and what is characterized.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "　皆悉離生滅，　　亦離於有無。",
        "translation": "They are all completely free of arising and ceasing, And also free of existence and nonexistence.",
        "source": "T16n0672_006:0625a22_0"
    },
    {
        "source_sentence": "爾時世尊，欲重宣此修多羅中諸廣義故，而說偈言：大乘入楞伽經卷第六",
        "translation": "It was then that the Bhagavat, wanting to elaborate on the extensive meanings of these sutras, spoke these verses: The Great Vehicle enters Laṅkâvatāra, Volume 6",
        "source": "T16n0672_006:0625a22_0"
    }
]