[
    {
        "source_sentence": "菩薩瓔珞經卷第九(一名現在報)",
        "translation": "Bodhisattva's Yingluo jing, vol. 9 (a present reward)",
        "source": "T16n0656_009:0080a02_0"
    },
    {
        "source_sentence": "姚秦涼州沙門竺佛念譯",
        "translation": "Yaoqin Liangzhou shaman Zhu Fonian's translation",
        "source": "T16n0656_009:0080a04_0"
    },
    {
        "source_sentence": "有受品第二十五",
        "translation": "The Twenty-fifth Chapter of the Sutra on Accepting [the Dharma]",
        "source": "T16n0656_009:0080a05_0"
    },
    {
        "source_sentence": "是時，勇進菩薩白佛言：「世尊！",
        "translation": "The Courageous Bodhisattva then said to the Buddha, Bhagavān!",
        "source": "T16n0656_009:0080a06_0"
    },
    {
        "source_sentence": "今聞如來說甚深法諸賢聖律所入之門，其有聞知了此法者，亦不見著亦不見脫，",
        "translation": "Those who hear and understand this teaching of the profound doctrine taught by the buddhas do not see it, nor are they attached to it or liberated from it.",
        "source": "T16n0656_009:0080a06_1"
    },
    {
        "source_sentence": "於空無法而無所損，不見諸法有所從來有所從去。",
        "translation": "In emptiness, there's nothing to be done and nothing to lose, and they don't see anything that comes or goes from the dharmas.",
        "source": "T16n0656_009:0080a08_2"
    },
    {
        "source_sentence": "若善男子、善女人，深觀此法無所從來無所從去，爾乃明達名為解脫。",
        "translation": "If good men and good women deeply observe this teaching without coming or going, then they'll clearly understand that it's called liberation.",
        "source": "T16n0656_009:0080a09_3"
    },
    {
        "source_sentence": "一切諸法各各別異，其所言見悉各離散無有合偶，復於諸法不生想念而有所成，",
        "translation": "All things are individual, each different; their expressions and views are all distinct, without conjunction or conjunction. Furthermore, they do not give rise to thoughts or conceptions about things, yet they form something.",
        "source": "T16n0656_009:0080a11_4"
    },
    {
        "source_sentence": "亦復不念有解脫者，所觀諸法亦不有內亦不有外，亦無有遠亦無有近。",
        "translation": "Nor does he think of liberation because the things he observes have neither inside nor outside, and there's no distance or proximity.",
        "source": "T16n0656_009:0080a13_5"
    },
    {
        "source_sentence": "得慧菩薩深了本無，其知是者去貢高心不生憍慢，是為善男子、善女人於諸善法而得解脫，",
        "translation": "Good men and good women, the bodhisattvas who have attained wisdom deeply understand that it is fundamentally nonexistent. Knowing this, they dispel their arrogance and don’t become conceited. This is how good men and good women can attain liberation in regard to all good qualities.",
        "source": "T16n0656_009:0080a14_6"
    },
    {
        "source_sentence": "便得住於無生滅地。",
        "translation": "They'll then be able to abide in the stage of nonproduction and cessation.",
        "source": "T16n0656_009:0080a16_7"
    },
    {
        "source_sentence": "其所住者不見有住，復於諸法住無所住，亦於諸法見無所見，是謂善男子、善女人正其性行不念非邪。",
        "translation": "Those who abide don't see any abiding, and those who abide without anything to abide in dharmas and see nothing to see in dharmas are said to be good men and good women who correct their natures and conduct without thoughts that aren't wrong.",
        "source": "T16n0656_009:0080a17_8"
    },
    {
        "source_sentence": "其作正見者，便於內性觀了色相亦無有色，亦不見色而有色也。",
        "translation": "Those who hold correct views then observe that form has form in its internal nature and doesn't have form, and they don't see form but have form.",
        "source": "T16n0656_009:0080a19_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0656_009:0080a21_10"
    },
    {
        "source_sentence": "知一切法觀空無形，知其本空如色無有色，於一切法亦不有受亦不無受，",
        "translation": "They know all things observe emptiness as formless, and they know that their original emptiness is like form without form. In all things there is neither sensation nor nonsensation.",
        "source": "T16n0656_009:0080a21_11"
    },
    {
        "source_sentence": "是謂善男子、善女人於一切法而得解脫。」",
        "translation": "This is called a good man or woman who has attained liberation in all dharmas.",
        "source": "T16n0656_009:0080a23_12"
    },
    {
        "source_sentence": "是時，勇進菩薩說此有受品時，有十三億眾生，聞此法已皆得不起柔順法忍，",
        "translation": "At that time the enlightening being Courageous One said, “There is an acceptance of this doctrine.” Three hundred and thirty million sentient beings heard this teaching. Having heard it, they all attained forbearance in regard to the principle of non-tolerance.",
        "source": "T16n0656_009:0080a24_13"
    },
    {
        "source_sentence": "異口同音各稱斯言：「今日勇進菩薩大士離於諸著，亦使我等成辦此法。",
        "translation": "They each called out in unison, saying, Today, the courageous bodhisattva Mahāsthāmaprāpta is free of all attachments and will cause us to accomplish this teaching.",
        "source": "T16n0656_009:0080a25_14"
    },
    {
        "source_sentence": "我等仁者當以此法教授餘人，如我無異悉得解脫畢無所著。」",
        "translation": "Gentlemen, we will teach this teaching to others, just as I do, so they'll attain liberation without any attachment after all.",
        "source": "T16n0656_009:0080a27_15"
    },
    {
        "source_sentence": "爾時，世尊告勇進菩薩曰：「夫泥洹心亦不在內、亦不在外、亦復不在兩中間止，",
        "translation": "It was then that the World-honored One said to the bodhisattva Courageous Progress, “The mind of nirvana is neither internal nor external, and neither in between.",
        "source": "T16n0656_009:0080a29_0"
    },
    {
        "source_sentence": "有受菩薩無生滅處，諸菩薩心道等無二亦無若干。",
        "translation": "There are bodhisattvas who experience the sphere of neither arising nor ceasing, and there are bodhisattvas whose minds, paths, etc., are without duality and without distinction.",
        "source": "T16n0656_009:0080b01_1"
    },
    {
        "source_sentence": "道心適等無若干者，於一切人必有平等無二之心，是謂菩薩故名曰等而無差別。」",
        "translation": "The mind of enlightenment is appropriate and equal without distinctions, and there must be equality and nonduality among all people; this is called a bodhisattva who's therefore called equal and without distinctions.",
        "source": "T16n0656_009:0080b02_2"
    },
    {
        "source_sentence": "是時，坐中有五百天子，聞如來平等之法有受無受，諸塵垢盡得法眼淨。",
        "translation": "At the time, there were five hundred celestial beings in his seat who heard the Tathāgata's equal teaching that there's sensation and non-sensation, and all the dust and dirt ended to attain purity of the Dharma eye.",
        "source": "T16n0656_009:0080b04_3"
    },
    {
        "source_sentence": "復有比丘、比丘尼、優婆塞、優婆夷，五百餘眾皆得須陀洹道。",
        "translation": "Again, there were monks, nuns, laymen, and laymen, and more than five hundred of them all attained the stream entry path.",
        "source": "T16n0656_009:0080b06_4"
    },
    {
        "source_sentence": "復有無央數天、龍、鬼神、乾沓和、阿須倫、迦留羅、真陀羅、摩休勒、人及非人，",
        "translation": "There were also innumerable gods, dragons, spirits, ghosts, gandharvas, asuras, garuḍas, mahoragas, humans, and nonhumans.",
        "source": "T16n0656_009:0080b07_5"
    },
    {
        "source_sentence": "志趣大乘，皆發無上平等道意。",
        "translation": "They all aspire to the great vehicle and give rise to the intention for the unsurpassed, equal path.",
        "source": "T16n0656_009:0080b09_6"
    },
    {
        "source_sentence": "菩薩瓔珞經無著品第二十六",
        "translation": "Bodhisattva's Yingluo jing wuzhi pin xxix",
        "source": "T16n0656_009:0080b11_0"
    },
    {
        "source_sentence": "是時，世尊告四部眾——比丘、比丘尼、優婆塞、優婆夷——及諸菩薩摩訶薩，",
        "translation": "At that time, the World-honored One said to the fourfold assembly of monks, nuns, laymen, and laymen, as well as to all the bodhisattva mahāsattvas:",
        "source": "T16n0656_009:0080b12_0"
    },
    {
        "source_sentence": "天、龍、鬼神、八部之眾：「若有菩薩摩訶薩，欲逮一切智、欲上菩薩位、欲得金剛三昧、欲得降伏魔官屬者、欲逮一切諸法門總持者、欲離此彼處者、欲莊嚴佛樹者，",
        "translation": "Gods, dragons, ghosts, spirits, and the eightfold assembly said, Suppose there's a bodhisattva-mahāsattva who wants to attain omniscience, wants to ascend to the bodhisattva position, wants to attain adamantine concentration, wants to subdue Māra's officials, wants to acquire the mastery of all teachings",
        "source": "T16n0656_009:0080b13_1"
    },
    {
        "source_sentence": "是善男子、善女人，當習如來無著之行。",
        "translation": "Good men and good women, you must cultivate the Tathāgata's unattached practice.",
        "source": "T16n0656_009:0080b17_2"
    },
    {
        "source_sentence": "「復次，善男子、善女人欲得淨佛國土教化眾生，從一佛國至一佛國，",
        "translation": "“Furthermore, if good men and good women want to purify the Buddha’s buddha-lands and teach sentient beings, they go from one buddha-land to another.",
        "source": "T16n0656_009:0080b18_0"
    },
    {
        "source_sentence": "承事禮敬諸佛世尊者，當學如來無著之行。",
        "translation": "In honoring and venerating the buddhas, world-honored ones, you should train in the Tathāgata's unattached practice.",
        "source": "T16n0656_009:0080b19_1"
    },
    {
        "source_sentence": "若有善男子、善女人，欲得如來奇特之法甚尊重者，若有眾生不於三界受色陰形，",
        "translation": "“Furthermore, if there are sons and daughters of a virtuous family who wish to attain the utmost reverence for the marvelous qualities of buddhas, then suppose that sentient beings do not experience physical form in the three realms.",
        "source": "T16n0656_009:0080b20_2"
    },
    {
        "source_sentence": "欲離五患不處五道，如斯等善男子、善女人，常當修習如來無著之行。」",
        "translation": "Desiring to be free of the five afflictions and not in the five paths, such good men and good women will always cultivate the Tathāgata's unattached practice.",
        "source": "T16n0656_009:0080b22_3"
    },
    {
        "source_sentence": "佛復告：「善男子、善女人！",
        "translation": "Again, the Buddha told them, Good men and good women!",
        "source": "T16n0656_009:0080b24_0"
    },
    {
        "source_sentence": "吾般泥洹後正法漸衰，多有眾生倚託法服，貪小利養詐發道心，虧損正法無清淨意，",
        "translation": "“After my parinirvāṇa the true-dharma gradually declined, and many sentient beings relied on the robe of the Dharma. They cherished small profits and fraudulently aroused the aspiration for enlightenment; they damaged the true-dharma and did not have pure intentions.",
        "source": "T16n0656_009:0080b24_1"
    },
    {
        "source_sentence": "如斯等人不信三寶至賢之行，雖在我眾離我甚遠。",
        "translation": "Such people don't believe in the supremely good practice of the Three Treasures, even though they're among us and far removed from us.",
        "source": "T16n0656_009:0080b26_2"
    },
    {
        "source_sentence": "若復善男子、善女人，修習如來無著之行，雖在凡夫未上菩薩位，執心牢固不捨道意。",
        "translation": "Again, if good men and good women cultivate the Tathāgata's unattached practice, even though they're worldlings or bodhisattvas who haven't yet reached the stage of enlightenment, they'll cling to their minds firmly and won't abandon the intention for the path.",
        "source": "T16n0656_009:0080b27_3"
    },
    {
        "source_sentence": "如斯等人，正使處在億百千萬由延之外，猶去我近。",
        "translation": "Such people as these are located hundreds of millions of myriads of yojanas away from me.",
        "source": "T16n0656_009:0080b29_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0656_009:0080c01_5"
    },
    {
        "source_sentence": "此善男子、善女人，修習如來無著行故。」",
        "translation": "These good men and good women cultivate the Tathāgata's unattached practice.",
        "source": "T16n0656_009:0080c02_6"
    },
    {
        "source_sentence": "爾時，有菩薩名曰明觀，即從座起頭面禮足，前白佛言：「世尊！",
        "translation": "At the time, there was a bodhisattva named Mingguan who rose from his seat, bowed his head at his feet, and said to the Buddha, Bhagavān!",
        "source": "T16n0656_009:0080c03_7"
    },
    {
        "source_sentence": "云何名為如來至真無著之行？",
        "translation": "What's called the Tathāgata's ultimately true practice of no attachment?",
        "source": "T16n0656_009:0080c04_8"
    },
    {
        "source_sentence": "唯願世尊一一分別，令諸會者各得開解。」",
        "translation": "Please let the Bhagavān discern each one of them so that the assembly members will each attain enlightenment.",
        "source": "T16n0656_009:0080c05_9"
    },
    {
        "source_sentence": "佛告明觀菩薩曰：「我今問汝，汝當報我。",
        "translation": "The Buddha told Mingguan Bodhisattva, Now, I'll ask you questions, and you must report back to me.",
        "source": "T16n0656_009:0080c06_10"
    },
    {
        "source_sentence": "云何？",
        "translation": "What do you think?",
        "source": "T16n0656_009:0080c07_11"
    },
    {
        "source_sentence": "族姓子！",
        "translation": "clansmen!",
        "source": "T16n0656_009:0080c07_12"
    },
    {
        "source_sentence": "汝何以故號明觀乎？",
        "translation": "Why are you called Mingguan?",
        "source": "T16n0656_009:0080c07_13"
    },
    {
        "source_sentence": "用色耶？",
        "translation": "What's the use of form?",
        "source": "T16n0656_009:0080c07_14"
    },
    {
        "source_sentence": "用痛想行識乎？",
        "translation": "Does it use pain, perception, volition, and consciousness?",
        "source": "T16n0656_009:0080c08_15"
    },
    {
        "source_sentence": "因身耶？",
        "translation": "the causal body?",
        "source": "T16n0656_009:0080c08_16"
    },
    {
        "source_sentence": "因名乎？",
        "translation": "What's the name of the cause?",
        "source": "T16n0656_009:0080c08_17"
    },
    {
        "source_sentence": "用何等故號明觀耶？」",
        "translation": "What's the reason it's called luminous contemplation?",
        "source": "T16n0656_009:0080c08_18"
    },
    {
        "source_sentence": "是時，明觀菩薩白佛言：「世尊！",
        "translation": "At the time, Ming Guan Bodhisattva said to the Buddha, Bhagavān!",
        "source": "T16n0656_009:0080c09_19"
    },
    {
        "source_sentence": "觀色非色亦非有色，色性自空亦不有色，我色彼色本無所有，色空本空色性自空。",
        "translation": "He observes that form is neither form nor form and neither formless, the nature of form is inherently empty and doesn't have form, self-form and form in essence lack existence, form and emptiness in essence are inherently empty, and form is inherently empty by its own nature as form.",
        "source": "T16n0656_009:0080c09_20"
    },
    {
        "source_sentence": "諸法自然復無自然，諸法然熾本無自然，觀色無生亦不見生，生自無生況當有色？",
        "translation": "The dharmas naturally lack nature, and the dharmas are naturally blazing but originally without nature. Observing form as non-arising doesn't see birth, so how could there be form when it arises on its own?",
        "source": "T16n0656_009:0080c11_21"
    },
    {
        "source_sentence": "但為眾生癡心所潤，不能自悟遂致苦惱，墜墮生死流轉五道，身死名滅復更受身。",
        "translation": "It's simply because sentient beings are nourished by their deluded minds that they can't realize it for themselves, which then causes suffering and distress, falling into the five destinies of birth-and-death and transmigrating in the five paths, and body death is called cessation and again feeling the body.",
        "source": "T16n0656_009:0080c13_22"
    },
    {
        "source_sentence": "如來大聖無所染著，知所從來離諸縛著，眾行根元悉歸於空，痛想行識亦復如是。",
        "translation": "The great sage of the Tathāgata has no defiled attachments, knows where he comes from and is free of fetters and attachments, and the faculty of all conditioned things ultimately returns to emptiness, so does pain, perception, volition, and consciousness.",
        "source": "T16n0656_009:0080c15_23"
    },
    {
        "source_sentence": "觀識非識亦非有識，識性自空亦不有識，我識彼識本無所有，識空本空識性自空。",
        "translation": "He observes that consciousness isn't consciousness and doesn't have consciousness, that the nature of consciousness is inherently empty and doesn't have consciousness, that self-consciousness and other consciousnesses originally lack existence, and that emptiness of consciousness is inherently empty because the nature of consciousness is inherently empty.",
        "source": "T16n0656_009:0080c17_24"
    },
    {
        "source_sentence": "諸法自然復無自然，諸法然熾本無自然，觀識無生亦不見生，生自無生況當有識？",
        "translation": "The dharmas naturally lack nature, and the dharmas are naturally blazing but originally without nature. Observing that consciousness doesn't arise, they don't see birth, so how could there be consciousness when it arises on its own?",
        "source": "T16n0656_009:0080c19_25"
    },
    {
        "source_sentence": "但為眾生癡心所潤，不能自悟遂致苦惱，墜墮生死流轉五道，身死名滅復更受形。",
        "translation": "It's simply because sentient beings are nourished by their deluded minds that they can't realize it for themselves, which causes suffering and distress, falling into the five destinies of birth-and-death and transmigrating in the five paths, and whose bodies die and are called cessation and then receive form again.",
        "source": "T16n0656_009:0080c21_26"
    },
    {
        "source_sentence": "如來大聖無所染著，知所從來離諸縛著，眾行根元悉歸於空，無著眾行亦復如是，",
        "translation": "The great sage Buddha has no defiled attachments, knows where he comes from and is free of all fetters and attachments. All conditioned states of being ultimately return to emptiness, and so do the unattached states of being are likewise.",
        "source": "T16n0656_009:0080c23_27"
    },
    {
        "source_sentence": "自致無上正真道意，何況善男子、善女人，聞則信解於佛法眾？",
        "translation": "How could good men and good women who hear it believe and understand the Buddha's teaching when they themselves attain the intention for the unsurpassed true path?",
        "source": "T16n0656_009:0080c25_28"
    },
    {
        "source_sentence": "斯乃名曰無著之行。」",
        "translation": "This is called the practice of nonattachment.",
        "source": "T16n0656_009:0080c26_29"
    },
    {
        "source_sentence": "是時，明觀菩薩復白佛言：「若使善男子、善女人聞如來無著之行，便於是中發菩薩心，",
        "translation": "Then the bodhisattva Varaprabha again said to the Buddha: Good men and good women, if they hear of the Tathāgata’s practice of nonattachment, will thereby generate the aspiration for enlightenment in them.",
        "source": "T16n0656_009:0080c27_30"
    },
    {
        "source_sentence": "雖有是念，亦不供養諸佛世尊，斯於如來無著之行而有耗減。",
        "translation": "Even though they have this thought, they don't make offerings to the buddhas and world-honored ones, which are depleted by the Tathāgata's unattached practice.",
        "source": "T16n0656_009:0080c29_0"
    },
    {
        "source_sentence": "若復善男子、善女人，意欲懈怠不復堪樂修無著行，能自剋責念無著行，",
        "translation": "“Furthermore, if sons and daughters of a virtuous family who are lazy in their minds and unable to develop the practice of nonattachment take pleasure in self-discipline, they will be able to criticize themselves with thoughts of self-discipline.",
        "source": "T16n0656_009:0081a01_1"
    },
    {
        "source_sentence": "一念之頃而不忘失，便得發無上至真道意，何況篤信而奉行乎？",
        "translation": "In a moment of thought, he doesn't forget it, and then he can give rise to the intention for the unsurpassed supreme path, so why wouldn't he devote his faith and practice it?",
        "source": "T16n0656_009:0081a03_2"
    },
    {
        "source_sentence": "「若善男子、善女人，得如來金剛三昧，發弘誓心不可沮壞，斯皆由如來無著聖行而得成就。",
        "translation": "“If good men and good women attain the adamantine concentration of the Tathāgata and make a great vow that their minds won’t be broken, it’s all because of the Tathāgata’s noble practice of nonattachment that they will attain its accomplishment.",
        "source": "T16n0656_009:0081a04_3"
    },
    {
        "source_sentence": "若復善男子、善女人，得三昧王三昧名曰奮迅勇。",
        "translation": "Again, good men and good women who attain the king of samādhi-samādhi are called ardent and courageous.",
        "source": "T16n0656_009:0081a06_4"
    },
    {
        "source_sentence": "若菩薩摩訶薩得此三昧者，便能降伏諸魔官屬，此善男子、善女人，皆由無著聖行而有成辦。",
        "translation": "If a bodhisattva-mahāsattva attains this concentration, he'll be able to subdue the demonic officials, and these good men and good women will all accomplish it because of their unattached noble actions.",
        "source": "T16n0656_009:0081a07_5"
    },
    {
        "source_sentence": "「若復善男子、善女人得信空法無量聖行，修四意止念念成就，分別內外空寂無形，",
        "translation": "“Furthermore, if good men and good women attain faith in the immeasurable noble practice of the teaching on emptiness, cultivate the four kinds of mental calming each other’s thoughts and accomplish them, discriminating internally and externally between voidness, formless, and formless,",
        "source": "T16n0656_009:0081a09_6"
    },
    {
        "source_sentence": "斯皆出於如來無著聖賢之行。",
        "translation": "They all come from the Tathāgata's unattached noble and virtuous practice.",
        "source": "T16n0656_009:0081a11_7"
    },
    {
        "source_sentence": "若善男子、善女人，得四神足心識自由，坐臥經行而無罣礙，遊至十方無量世界，",
        "translation": "“Furthermore, if sons and daughters of a virtuous family who have attained the four kinds of supernormal power are able to freely manifest their minds and consciousnesses without hindrance while sitting or lying in meditation, they will reach infinite worlds in the ten directions.",
        "source": "T16n0656_009:0081a12_8"
    },
    {
        "source_sentence": "禮事供養諸佛世尊，斯亦復是如來無著聖賢之行。",
        "translation": "To venerate and make offerings to the buddhas and world-honored ones is also the practice of the Tathāgata's unattached noble and virtuous actions.",
        "source": "T16n0656_009:0081a14_9"
    },
    {
        "source_sentence": "「若善男子、善女人及菩薩摩訶薩，獲四意斷至十八法、三十七品，莊嚴佛土成眾相好，",
        "translation": "“Suppose good men, good women, and bodhisattva mahāsattvas attain the four kinds of mental cessation up to the eighteen dharmas and thirty-seven qualities that adorn the Buddha’s land and make all its marks beautiful.",
        "source": "T16n0656_009:0081a15_10"
    },
    {
        "source_sentence": "八種音聲過于梵天，其有眾生聞佛音響得解脫者，斯亦復是如來無著聖賢之行。",
        "translation": "Eight kinds of sounds are superior to those of the Brahma gods, and if there are sentient beings who hear the sound of the Buddha's voice and attain liberation, this is also the Tathāgata's practice of noble and noble people who aren't attached.",
        "source": "T16n0656_009:0081a17_11"
    },
    {
        "source_sentence": "若復善男子、善女人，一一思惟空無相願，不復染著興是非想，緣此三觀當成無上正真道意，",
        "translation": "“Furthermore, if sons and daughters of a virtuous family contemplate emptiness one by one with the vow to be without marks or signs, so that they are no longer stained by attachment and give rise to conceptions of right and wrong, based on these three contemplations they will develop the intention for the unsurpassed true path.",
        "source": "T16n0656_009:0081a19_12"
    },
    {
        "source_sentence": "斯亦復是如來無著聖賢之行。",
        "translation": "This is also the practice of the Tathāgata's unattached noble and virtuous conduct.",
        "source": "T16n0656_009:0081a21_13"
    },
    {
        "source_sentence": "「若有善男子、善女人，從無數諸佛世尊受菩薩別，當成無上正真道意，",
        "translation": "“If there are sons and daughters of a virtuous family who receive their ordination as enlightening beings from countless buddha-honored ones, they will attain the supremely true aspiration for enlightenment.",
        "source": "T16n0656_009:0081a22_14"
    },
    {
        "source_sentence": "畢志牢固終不中退，亦不為眾魔所能沮壞，斯亦復是如來無著聖賢之行。」",
        "translation": "Being resolute in his resolve and never retreating or being defeated by Māra, this is also the Tathāgata's practice of no attachment to the noble and virtuous.",
        "source": "T16n0656_009:0081a23_15"
    },
    {
        "source_sentence": "爾時，明觀菩薩說是如來無著聖賢行時，有八十四億眾生之類，願樂欲求如來無著聖賢之行。",
        "translation": "At the time, Mañjuśrī observed that when the bodhisattva explained this as the Tathāgata's unattached noble and virtuous conduct, there were 8,400 million sentient beings who wished to pursue the Tathāgata's unattached noble and virtuous conduct.",
        "source": "T16n0656_009:0081a25_16"
    },
    {
        "source_sentence": "復有無數之眾，求於親近明觀菩薩以為師宗。",
        "translation": "Countless other people also sought to become intimate with the bodhisattva of insight and contemplation as their teacher.",
        "source": "T16n0656_009:0081a27_17"
    },
    {
        "source_sentence": "復有無量眾生各生斯念：「今日明觀菩薩摩訶薩，久如當成無上正真道意。」",
        "translation": "Again, there are measureless sentient beings who each have this thought, Today, I'll clearly observe the bodhisattva Mahāsattva as long as it takes to accomplish the intention for the unsurpassed true path.",
        "source": "T16n0656_009:0081a28_18"
    },
    {
        "source_sentence": "爾時，世尊知眾會心各生此念，便告明觀菩薩曰：「汝今以能宣暢如來無著之行，",
        "translation": "Knowing this thought in each assembly’s mind, the World-honored One said to Bodhisattva Varaprabha:",
        "source": "T16n0656_009:0081b01_19"
    },
    {
        "source_sentence": "如來聖慧不可窮盡。",
        "translation": "The Tathāgata's noble wisdom is inexhaustible.",
        "source": "T16n0656_009:0081b03_20"
    },
    {
        "source_sentence": "却後無數阿僧祇劫，上方去此五十恒河沙數諸佛剎土，佛名無垢如來、至真、等正覺，",
        "translation": "Countless, incalculable eons after that, there were buddha-lands as numerous as the sands of fifty Ganges Rivers upward from these buddha-lands. These buddhas were called the Immaculate Tathāgata, the Arhat, the Perfectly Enlightened One.",
        "source": "T16n0656_009:0081b03_21"
    },
    {
        "source_sentence": "純有一乘教化眾生，不聞緣覺弟子之名，汝當作佛號曰明觀如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，",
        "translation": "There is only one vehicle that teaches sentient beings and doesn't hear the names of the disciples of pratyekabuddhas, so you should become a buddha named Mingguan tathāgata, arhat, perfectly enlightened, fully awakened, accomplished in knowledge and conduct, well-gone, liberated from the world, unsurpassed, unsurpassed",
        "source": "T16n0656_009:0081b05_22"
    },
    {
        "source_sentence": "號佛、世尊，汝當作佛其號如是。」",
        "translation": "It's called Buddha, Bhagavān, and you will become a buddha whose name is like this.",
        "source": "T16n0656_009:0081b08_23"
    },
    {
        "source_sentence": "爾時，眾會一切眾生，見如來授明觀菩薩決，或有眾生覺知者、不覺知者。",
        "translation": "At the time, all sentient beings in the assembly saw the Tathāgata's explanation of the bodhisattva's resolve to contemplate clearly, or some sentient beings who knew and those who didn't know.",
        "source": "T16n0656_009:0081b09_24"
    },
    {
        "source_sentence": "爾時，世尊觀察人心各懷狐疑，佛知其意便告明觀菩薩曰：「如來、至真、等正覺在大眾中授菩薩決，",
        "translation": "At that time, the World-honored One observed the minds of those bodhisattvas with doubt and perplexity. Knowing their thoughts, the Buddha said to Bodhisattva Varaprabha:",
        "source": "T16n0656_009:0081b10_25"
    },
    {
        "source_sentence": "有覺知者、不覺知者，有八因緣。",
        "translation": "Those with perception and those who don't perceive have eight causes and conditions.",
        "source": "T16n0656_009:0081b13_26"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T16n0656_009:0081b13_27"
    },
    {
        "source_sentence": "善男子、善女人得如來決，當成無上平等正覺，一切眾人無能知者，是謂如來授眾生決，",
        "translation": "Good men and good women who have attained the Tathāgata’s determination will attain highest, impartial perfect enlightenment. All living beings cannot know this. This is how the Tathāgata decides for sentient beings.",
        "source": "T16n0656_009:0081b14_28"
    },
    {
        "source_sentence": "己身自覺、餘人不知。",
        "translation": "He perceives it himself and doesn't know it for others.",
        "source": "T16n0656_009:0081b16_29"
    },
    {
        "source_sentence": "「復次，明觀！",
        "translation": "Furthermore, Mañjuśrī!",
        "source": "T16n0656_009:0081b16_30"
    },
    {
        "source_sentence": "若有善男子、善女人，在大眾中為如來所見授決，餘人盡見、己不覺知，",
        "translation": "If there are sons and daughters of a virtuous family who appear before the Tathāgata in public to entrust their views to him, others will see them all without knowing.",
        "source": "T16n0656_009:0081b16_31"
    },
    {
        "source_sentence": "是謂如來授眾生決，餘人盡見、己不覺知。",
        "translation": "This means that when the Tathāgata grants a decision to sentient beings, the rest see it and don't perceive it for themselves.",
        "source": "T16n0656_009:0081b18_32"
    },
    {
        "source_sentence": "「復次，明觀菩薩摩訶薩！",
        "translation": "Furthermore, it's clear that the bodhisattva Mahāsattva observes!",
        "source": "T16n0656_009:0081b19_33"
    },
    {
        "source_sentence": "若有善男子、善女人，為諸佛世尊所見授決，汝當成佛其號如是，己知受決、餘人亦見，",
        "translation": "If there are sons and daughters of a virtuous family who receive their predictions from the buddhas, you will become a buddha. The name given to you is like this. You know that you have received your predictions and others will also see them.",
        "source": "T16n0656_009:0081b20_0"
    },
    {
        "source_sentence": "是謂如來授眾生決，己自覺知、餘人亦見。",
        "translation": "This is to say that when the Tathāgata grants a decision to sentient beings, he knows it for himself and others see it as well.",
        "source": "T16n0656_009:0081b21_1"
    },
    {
        "source_sentence": "「復次，明觀菩薩摩訶薩！",
        "translation": "Furthermore, it's clear that the bodhisattva Mahāsattva observes!",
        "source": "T16n0656_009:0081b22_2"
    },
    {
        "source_sentence": "若有善男子、善女人，在大眾中為如來所見授決，自不覺知、餘人亦不知，",
        "translation": "“Furthermore, if there are sons and daughters of a virtuous family who have seen the Tathāgata’s instruction to all the people in the assembly but do not know it themselves or let others know it,",
        "source": "T16n0656_009:0081b23_3"
    },
    {
        "source_sentence": "是謂如來授眾生決，自不覺知、餘人亦不知。」",
        "translation": "This is called the Tathāgata who grants a ruling to sentient beings and doesn't perceive it for himself or know it for others.",
        "source": "T16n0656_009:0081b25_4"
    },
    {
        "source_sentence": "佛復告明觀菩薩：「若有善男子、善女人，在大眾中受如來決，然此受決之人乃在未行不近如來，",
        "translation": "Again, the Buddha said to the bodhisattva Candracchattra: Good men and good women, if they receive the prediction of enlightenment from the Tathāgata in the assembly of bhikṣus, those who do so will not go near the Tathāgata.",
        "source": "T16n0656_009:0081b26_5"
    },
    {
        "source_sentence": "近如來者自謂受我決，是謂如來授眾生決，遠者覺知、近者不覺。",
        "translation": "Those who approach the Tathāgata claim to have accepted my decision. This is how the Tathāgata grants a decision to sentient beings; those who are far away realize it and those who are near don't realize it.",
        "source": "T16n0656_009:0081b28_6"
    },
    {
        "source_sentence": "「復次，明觀菩薩摩訶薩！",
        "translation": "Furthermore, it's clear that the bodhisattva Mahāsattva observes!",
        "source": "T16n0656_009:0081b29_7"
    },
    {
        "source_sentence": "若有善男子、善女人，在大眾中為如來所見授決，近如來者便自覺知：『今日如來而授我決。』",
        "translation": "If there are good men and good women in the great assembly who see the Tathāgata and give me a decision, those who approach the Tathāgata will then realize for themselves, 'Today, the Tathāgata gave me a decision.'",
        "source": "T16n0656_009:0081c01_8"
    },
    {
        "source_sentence": "遠如來者復自稱說：『如來今日授我等決，然此眾生未應受決。』",
        "translation": "The distant Tathāgata then claimed to himself, 'Today, the Tathāgata gave us our rulings, but these sentient beings shouldn't have received them.'",
        "source": "T16n0656_009:0081c03_9"
    },
    {
        "source_sentence": "是謂如來授眾生決，近者覺知、遠者不覺。」",
        "translation": "This is called the Tathāgata who grants a ruling to sentient beings, knowing what's near and not knowing what's far away.",
        "source": "T16n0656_009:0081c04_10"
    },
    {
        "source_sentence": "佛復告明觀菩薩摩訶薩：「若有善男子、善女人，為諸佛世尊所見授決，",
        "translation": "Again, the Buddha said to the bodhisattva Mahāsattva Samantabhadra: If there are good men and good women, they will be judged by the buddhas and world-honored ones.",
        "source": "T16n0656_009:0081c05_11"
    },
    {
        "source_sentence": "當成佛時其號如是，近者不覺、遠亦不知，是謂如來授眾生決，遠近眾生皆不覺知。」",
        "translation": "When he becomes a buddha, his name is like this, and those who are close don't perceive it and those who are distant don't know it; this is called the Tathāgata who grants sentient beings the right to decide, and all sentient beings far and near don't perceive it.",
        "source": "T16n0656_009:0081c07_12"
    },
    {
        "source_sentence": "佛復告明觀菩薩：「若有善男子、善女人，在大眾中為如來所見授決，",
        "translation": "Again, the Buddha said to the bodhisattva Varaprabha: If there are good men and good women in the great assembly who receive their predictions from the Tathāgata,",
        "source": "T16n0656_009:0081c09_13"
    },
    {
        "source_sentence": "近者亦覺、遠者亦知、餘人不見，是謂如來八因緣法授眾生決，近者亦覺、遠者亦知、餘人不見。」",
        "translation": "What's near is also perceived, what's far away is also known, and what's far away is not seen by others; these are the eight causes and conditions for the Tathāgata's teaching sentient beings to decide, and what's near is also perceived, what's far away is also known, and what's far away is not seen by others.",
        "source": "T16n0656_009:0081c10_14"
    },
    {
        "source_sentence": "爾時，世尊告四部眾：比丘、比丘尼、優婆塞、優婆夷，菩薩摩訶薩、天、龍、鬼神、乾沓和、阿須倫、迦留羅、真陀羅、摩休勒、人及非人：「汝等頗見明觀菩薩受記別乎？」",
        "translation": "It was then that the Bhagavān addressed the four groups of people: monks, nuns, laymen, laymen, and laymen, gods, dragons, spirits, ghosts, gandharvas, asuras, asuras, garuḍas, mahoras, mahoras, humans, and non-humans, Do you see the distinctive mark",
        "source": "T16n0656_009:0081c12_15"
    },
    {
        "source_sentence": "對曰：「非也。",
        "translation": "He replied, No.",
        "source": "T16n0656_009:0081c16_16"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T16n0656_009:0081c16_17"
    },
    {
        "source_sentence": "佛復告族姓子：「若有菩薩摩訶薩受如來決，初發道心受別不同，今此明觀菩薩受如來決，",
        "translation": "Again, the Buddha told the clansmen, Suppose there's a bodhisattva Mahāsattva who receives the Tathāgata's ruling and first arouses the mind of enlightenment to receive it differently, and now this is an explanation of how he observes that the bodhisattva receives the Tathāgata's ruling.",
        "source": "T16n0656_009:0081c16_18"
    },
    {
        "source_sentence": "己自覺知、餘人不覺，如此等人未獲如來四無所畏，發心自誓未廣及眾生，",
        "translation": "Such people have not yet attained the four forms of fearlessness of buddhas, nor have they set their minds on enlightenment and vowed to do so.",
        "source": "T16n0656_009:0081c18_19"
    },
    {
        "source_sentence": "亦復未得善權方便，是故受決己自覺知、餘者不覺。」",
        "translation": "Again, they haven't yet attained the skillful means of good authority; therefore, they are judged to know for themselves and not others.",
        "source": "T16n0656_009:0081c20_20"
    },
    {
        "source_sentence": "佛復告族姓子：「若有善男子、善女人受如來決，眾人盡見、自不覺知，",
        "translation": "Again, the Buddha told the clansmen and women, “If there are good men and good women who receive the Tathāgata’s ordination, all of them will see it but they themselves will not realize it.",
        "source": "T16n0656_009:0081c21_21"
    },
    {
        "source_sentence": "如此等人發意弘普廣及眾生，得四無畏發心曠大，有善權方便教化眾生，",
        "translation": "Such people’s determination for enlightenment is vast and wide, reaching as far as all sentient beings. They attain the four great fearless states of mind-made determination. They have good authority and skillful means to teach and transform sentient beings.",
        "source": "T16n0656_009:0081c23_22"
    },
    {
        "source_sentence": "是故受決餘者盡覺、己不自知。」",
        "translation": "Therefore, those who receive the ruling are fully awakened and don't know it for themselves.",
        "source": "T16n0656_009:0081c24_23"
    },
    {
        "source_sentence": "佛復告族姓子：「若有善男子、善女人受如來決，己身自知、餘者亦見，",
        "translation": "Again, the Buddha told the clansmen and women, “If there are good men and good women who receive the Tathāgata’s ordination, they will know it for themselves and others will also see it.",
        "source": "T16n0656_009:0081c25_24"
    },
    {
        "source_sentence": "如此等人在七住地分別空觀，不計眾生有染著想，初發道心不生此念：『我後成佛度爾所眾生、不度爾所眾生，",
        "translation": "In the seventh stage of meditation on voidness they do not think that all sentient beings have defiled thoughts or attachments. When they first set out for enlightenment, they do not give rise to this thought: “After becoming a buddha I will save such and such sentient beings,” or “I will not save such and such and such sentient beings.”",
        "source": "T16n0656_009:0081c27_25"
    },
    {
        "source_sentence": "心如虛空不可沮壞，以獲如來四無所畏，得空觀三昧善權方便。』",
        "translation": "The mind is like space that can't be broken, so it's the method of attaining the Tathāgata's four fearlessnesses and attaining the samādhi of contemplating emptiness with skillful means.'",
        "source": "T16n0656_009:0081c29_26"
    },
    {
        "source_sentence": "是故受決，己身自知、餘者亦見。」",
        "translation": "That's why they receive the ruling, knowing it for themselves and seeing it for others.",
        "source": "T16n0656_009:0082a02_27"
    },
    {
        "source_sentence": "佛復告族姓子：「若有善男子、善女人受如來決，己身不覺、餘者不知，",
        "translation": "Again, the Buddha told the clansman, If there are good men and good women who receive the Tathāgata’s ordination, their bodies won’t perceive it; others won’t know it.",
        "source": "T16n0656_009:0082a02_28"
    },
    {
        "source_sentence": "如斯等人未在七住不退轉地，雖有善權方便信樂三尊，供養承事諸佛世尊，",
        "translation": "Even though they had good authority, skillful means, and faith in the three honored ones, they offered support and served the world-honored buddhas.",
        "source": "T16n0656_009:0082a04_29"
    },
    {
        "source_sentence": "然未得如來無著之行，未能淨佛國土教化眾生，是故受決自不覺知、餘者不見。」",
        "translation": "However, they haven't yet attained the Tathāgata's unattached practice and aren't able to purify the Buddha's land and teach sentient beings; therefore, they won't perceive it on their own or see it for others.",
        "source": "T16n0656_009:0082a06_30"
    },
    {
        "source_sentence": "佛復告族姓子：「若善男子、善女人受如來決，遠者得決、近者不得，",
        "translation": "Again, the Buddha told the clansman, Good men and good women who accepted the Tathāgata's decision to accept it from afar would attain it, but those who came closer won't.",
        "source": "T16n0656_009:0082a07_31"
    },
    {
        "source_sentence": "如此等人彌勒身是。",
        "translation": "These are the bodies of these people, Maitreya.",
        "source": "T16n0656_009:0082a09_32"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0656_009:0082a09_33"
    },
    {
        "source_sentence": "此善男子、善女人諸根具足，不捨如來無著之行，是故受決，遠者自覺、近者不知。」",
        "translation": "These good men and good women are endowed with the faculties and don't abandon the Tathāgata's unattached practice; therefore, they receive the ruling, which is known to those who are far away and those who are near.",
        "source": "T16n0656_009:0082a10_0"
    },
    {
        "source_sentence": "佛復告族姓子：「若善男子、善女人受如來決，近者覺知、遠者不見，",
        "translation": "Again, the Buddha told the clansman, Good men and good women who receive the Tathāgata’s ordination are aware when they are near and don’t see it when they are far away.",
        "source": "T16n0656_009:0082a11_1"
    },
    {
        "source_sentence": "亦非眾會所能測度，如此等人在菩薩位，未能演說賢聖之行，今師子膺菩薩是也。",
        "translation": "Such people at the bodhisattva stage can't explain the practice of goodness and nobleness, but this is the present-day Siṃhala Bodhisattva.",
        "source": "T16n0656_009:0082a13_2"
    },
    {
        "source_sentence": "眾相具足不捨法本，於無想法中不壞法性，是故受決，近者覺知、遠者不見，",
        "translation": "Because they are endowed with all characteristics, they do not abandon the essence of the doctrine. They do not destroy the essence of the doctrine in the absence of ideation. For this reason they receive higher ordination. Those who are near know it and those who are far from it do not see it.",
        "source": "T16n0656_009:0082a15_3"
    },
    {
        "source_sentence": "亦非眾會所能測度。」",
        "translation": "Nor is it something that the assembly can fathom.",
        "source": "T16n0656_009:0082a16_4"
    },
    {
        "source_sentence": "佛復告族姓子：「若善男子、善女人如來授決，近者亦知、遠者亦見，",
        "translation": "Again, the Buddha said to the brāhmaṇa: Good men and good women, if the Tathāgata grants them their predictions, those who are close by will know as well as those who are far away.",
        "source": "T16n0656_009:0082a17_5"
    },
    {
        "source_sentence": "如此等人眾行具足，行不思議無量佛事，超生死海至無為岸。",
        "translation": "Such people are endowed with all kinds of practices, perform inconceivable buddha-works, and transcend the ocean of birth and death to reach the shore of nonexistence.",
        "source": "T16n0656_009:0082a18_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0656_009:0082a20_7"
    },
    {
        "source_sentence": "此善男子、善女人諸根具足，不捨如來無著之行，遍遊十方無量世界，",
        "translation": "“These sons and daughters of a virtuous family are endowed with all their faculties. They do not give up the unattached practice of buddhahood but travel everywhere in the infinite worlds of the ten directions.",
        "source": "T16n0656_009:0082a20_8"
    },
    {
        "source_sentence": "作不思議顯佛神德，今柔順菩薩是也。",
        "translation": "He made inconceivable manifestations of the Buddha's spiritual virtue, and this is the present-day Bodhisattva Rouxing.",
        "source": "T16n0656_009:0082a22_9"
    },
    {
        "source_sentence": "是故，近者亦知、遠者亦見。」",
        "translation": "Therefore, those who are near know it and those who are far from it see it.",
        "source": "T16n0656_009:0082a22_10"
    },
    {
        "source_sentence": "佛復告族姓子：「若善男子、善女人受如來決，近者不知、遠者不見，",
        "translation": "Again, the Buddha told the clansman, Good men and good women who receive the Tathāgata’s ordination are not aware of it if they are near it or don’t see it if they are far from it.",
        "source": "T16n0656_009:0082a23_11"
    },
    {
        "source_sentence": "如此等人眾行未具、未得善權方便，雖復去離五欲之中，未能備悉如來法藏，",
        "translation": "Such people have not perfected their practices, nor have they acquired the skillful means of liberation. Yet even though they are free from the five kinds of desire, they are still unable to fully master the treasury of the teachings of the enlightened.",
        "source": "T16n0656_009:0082a25_0"
    },
    {
        "source_sentence": "今等行菩薩是也。」",
        "translation": "This is the bodhisattva who's practicing now.",
        "source": "T16n0656_009:0082a26_1"
    },
    {
        "source_sentence": "佛復告族姓子：「若有菩薩摩訶薩，奉持修習八因緣法，我今視之如己無異，",
        "translation": "The Buddha again said to the clansmen: If there are bodhisattva mahāsattvas who uphold and practice the eight kinds of causality, I will now regard them as myself, without any difference.",
        "source": "T16n0656_009:0082a27_2"
    },
    {
        "source_sentence": "亦為十方諸佛世尊所見擁護。」",
        "translation": "They'll also be embraced by the buddhas and world-honored ones of the ten directions.",
        "source": "T16n0656_009:0082a28_3"
    },
    {
        "source_sentence": "爾時，釋提桓因即從座起，前至佛所，頭面禮足，在一面立。",
        "translation": "At the time, Śakra Devānām-Indra rose from his seat, went before the Buddha, bowed his head and feet, and stood to one side.",
        "source": "T16n0656_009:0082a29_4"
    },
    {
        "source_sentence": "須臾之頃，前至佛所，長跪叉手，白佛言：「世尊！",
        "translation": "In a moment, he went before the Buddha, knelt down with his palms joined together, and said to him, Bhagavān!",
        "source": "T16n0656_009:0082b01_5"
    },
    {
        "source_sentence": "我名拘翼號天帝釋，唯願世尊聽所啟白。」",
        "translation": "I'm named Kauśinagara and called myself Indra, so may the Bhagavān listen to what I tell you.",
        "source": "T16n0656_009:0082b02_6"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T16n0656_009:0082b03_7"
    },
    {
        "source_sentence": "拘翼！",
        "translation": "Kauśika!",
        "source": "T16n0656_009:0082b04_8"
    },
    {
        "source_sentence": "有所疑難，今正是時。」",
        "translation": "If there's any doubt or difficulty, now is the right time.",
        "source": "T16n0656_009:0082b04_9"
    },
    {
        "source_sentence": "釋提桓因白佛言：「世尊！",
        "translation": "Śakra Devānām-Indra said to the Buddha, Bhagavān!",
        "source": "T16n0656_009:0082b04_10"
    },
    {
        "source_sentence": "若有善男子、善女人，興顯如來無著之行，具足授決八因緣法，我等諸天當護此善男子、善女人至竟成就，",
        "translation": "If there are any sons and daughters of a virtuous family who reveal the Tathāgata’s practice free from attachment, who are fully endowed with the eight reasons why they should be disciplined, we gods will protect these sons and daughters of a virtuous family until their attainment of enlightenment.",
        "source": "T16n0656_009:0082b05_11"
    },
    {
        "source_sentence": "終不中退墮於羅漢辟支佛道。」",
        "translation": "They'll never fall back into the path of the arhats and pratyekbuddhas in the middle.",
        "source": "T16n0656_009:0082b07_12"
    },
    {
        "source_sentence": "「本無無所著，　　永離諸惡趣，",
        "translation": "Having no attachment in the first place, They are forever detached from evil states.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　云何如來今，　　授決有高下？",
        "translation": "How is it that the Tathāgata now grants higher and lower ordination?",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　昔從無數劫，　　功勳不可量，",
        "translation": "In the past, since innumerable eons ago, His merits have been immeasurable.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　積功累眾德，　　一切眾相具。",
        "translation": "Accumulating merit and virtue, They are endowed with all characteristics.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　如來諸法本，　　無生滅著斷，",
        "translation": "The source of all the teachings of the enlightened is nonarising, cessation, attachment, and annihilation.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　尊今已授決，　　論說高下相。",
        "translation": "The Blessed One has now given us the judgement to discuss the superior and inferior characteristics.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　得定不起思，　　生滅無所有，",
        "translation": "Attaining concentration without thinking, birth and cessation have no existence.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　諸法如幻化，　　名號不真實。",
        "translation": "All dharmas are like illusions, and their names aren't real.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　知本所從來，　　願樂無生法，",
        "translation": "Knowing where they came from in the past, They wish to delight in the nonorigination of things.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　演說三達智，　　從限至無限。",
        "translation": "He teaches the three kinds of comprehensive wisdom, which range from limited to infinite.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　今為天帝釋，　　縛解諸結盡，",
        "translation": "Now, as Indra the ruler of gods, He has severed all bonds and terminated them.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　願尊見記別，　　久如逮正覺。」",
        "translation": "May the venerable one see it and remember it separately, as long as he's attained right awakening.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "「汝今天帝釋，　　功德眾行至，",
        "translation": "Today, you Indra, the emperor of gods, Are endowed with many virtuous deeds.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　乃從無數世，　　積德光明尊。",
        "translation": "From innumerable ages ago, I've accumulated the honored one of virtue and light.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　今為天帝身，　　經大小劫數，",
        "translation": "Now the body of Indra has passed through many kalpas, large and small.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　三十六成敗，　　不捨本要誓。",
        "translation": "The thirty-six accomplishments and failures don't abandon the original essential vow.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　千佛兄弟過，　　無復賢劫名，",
        "translation": "A thousand buddhas and brothers are in error, And there is no more the world age of the wise.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　中間永曠絕，　　二十四中劫，",
        "translation": "The intermediate one will be eternally extinguished for twenty-four intermediate kalpas.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　後乃有佛出，　　十力無所畏，",
        "translation": "Then a buddha emerged, Endowed with the ten powers and free from fear.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　清淨德普尊，　　剎土名普忍。",
        "translation": "Pure virtue is universally honored, and the buddha-lands are called universal forbearance.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　彼佛極長壽，　　在世壽七劫，",
        "translation": "The longest life span of that buddha was in the world for seven kalpas.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　教化已周訖，　　永寂取滅度。",
        "translation": "Having completed his teaching, he's permanently extinguished and entered nirvāṇa.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　遺法在世化，　　亦復經七劫，",
        "translation": "The legacy of the Buddha’s teaching remained in the world for another seven kalpas.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　漸漸法沒盡，　　不聞三尊名。",
        "translation": "Gradually, the teachings are exhausted, and they don't hear the names of the three honored ones.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　中間復逈絕，　　當復經五劫，",
        "translation": "In the interim, it will again be cut off for another five eons.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　汝於彼剎土，　　當紹如來位。",
        "translation": "In that buddha-land, you will assume the throne of the Tathāgata.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　我今授汝決，　　本無如來印，",
        "translation": "Now, I'll give you a ruling because there was originally no Tathāgata mudrā.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　號名無著尊，　　三界最第一。",
        "translation": "His name is Venerable Wuzu, the best of the three realms.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　獨步無等侶，　　說法無窮盡，",
        "translation": "He walks alone without companions, Teaching the Dharma endlessly.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "　當化阿僧祇，　　無量眾生類。」",
        "translation": "You will transform an incalculable number of sentient beings, boundless kinds of sentient beings.",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "爾時，釋提桓因即於佛前，而歎頌曰：爾時，世尊以偈報釋提桓因曰：爾時，",
        "translation": "At that time, Śakra, lord of the gods, stood before the Buddha and said in verse:",
        "source": "T16n0656_009:0082b08_13"
    },
    {
        "source_sentence": "釋提桓因聞如來已見授決，頭面禮足，遶佛三匝，還復故座。",
        "translation": "Having heard that the Tathāgata had seen his prediction, Śakra, lord of the gods, bowed his forehead and feet at the Buddha’s feet, circumambulated him three times, and returned to his seat.",
        "source": "T16n0656_009:0082c12_14"
    },
    {
        "source_sentence": "是時，弊魔波旬心自念言：「今日如來、至真、等正覺，教化眾生轉無著法輪，",
        "translation": "At that moment, Māra Pāpīyān thought to himself: Today the Tathāgata, Arhat, Perfectly Enlightened One, is teaching and transforming sentient beings so that they may turn the wheel of the Dharma without attachment.",
        "source": "T16n0656_009:0082c13_15"
    },
    {
        "source_sentence": "以善權方便將導一切諸不及者，眾菩薩等神通大智皆得授決不退轉地。",
        "translation": "Those who will guide all those who fail by skillful means, the bodhisattvas and other great knowledge of supernormal powers will all attain the stage of nonretrogression when they're given a ruling.",
        "source": "T16n0656_009:0082c15_16"
    },
    {
        "source_sentence": "此賢聖等我則不疑，今釋提桓因在我部界為我所使，先為如來所見授決。",
        "translation": "Now, Śakra Devānām-Indra is the messenger for me because he's in my part of the world, and he was previously given a ruling by the Tathāgata who saw it.",
        "source": "T16n0656_009:0082c16_17"
    },
    {
        "source_sentence": "如我今日心離魔行，不在榮冀愛欲之中，何故如來不授我決爾？」",
        "translation": "If my mind today is free of demonic activity and not in the midst of prosperity, why doesn't the Tathāgata give me a ruling?",
        "source": "T16n0656_009:0082c18_18"
    },
    {
        "source_sentence": "時，世尊知魔波旬心中所念，便告目犍連：「汝能堪任於如來前，說諸菩薩摩訶薩受記別乎？」",
        "translation": "Knowing what Māra Pāpīyān thought in his mind, the Bhagavān then addressed Maudgalyāyana, Are you capable of telling the bodhisattvas and mahāsattvas to receive their assurance before the Tathāgata?",
        "source": "T16n0656_009:0082c20_0"
    },
    {
        "source_sentence": "是時，目連承佛威神，即從座起，前白佛言：「我能堪任說菩薩摩訶薩受決之法。」",
        "translation": "At the time, Maudgalyāyana, imbued with the Buddha's authoritative power, rose from his seat and said to the Buddha, I can skillfully explain the bodhisattva-mahāsattva's method of accepting the ruling.",
        "source": "T16n0656_009:0082c22_1"
    },
    {
        "source_sentence": "佛告目連：「堪任說者，今正是時。」",
        "translation": "The Buddha told Maudgalyāyana, Now is the right time for someone who's capable of speaking.",
        "source": "T16n0656_009:0082c23_2"
    },
    {
        "source_sentence": "目連白佛：「若有菩薩摩訶薩於諸空法生染著心，便自貢高輕蔑前學。",
        "translation": "Maudgalyāyana said to the Buddha, Suppose there's a bodhisattva Mahāsattva who becomes defiled with attachment to the teachings of emptiness and then arrogantly despises his former training.",
        "source": "T16n0656_009:0082c24_3"
    },
    {
        "source_sentence": "如此等善男子、善女人在凡夫地，不應稱為菩薩，不應受決得如來號。」",
        "translation": "Such good men and good women in the worldling stage shouldn't be called bodhisattvas, and they shouldn't receive the Tathāgata's name as a result of their resolve.",
        "source": "T16n0656_009:0082c26_4"
    },
    {
        "source_sentence": "目連復白佛言：「若有善男子、善女人，見人受決便生增上心：『我今豪貴、斯人卑賤。』",
        "translation": "Again, Maudgalyāyana said to the Buddha, Suppose there are good men and good women who see someone receiving a ruling and give rise to an overweening thought, 'Now that I'm powerful and noble, this person is inferior.'",
        "source": "T16n0656_009:0082c27_5"
    },
    {
        "source_sentence": "如此等善男子、善女人在凡夫地，不應稱為菩薩，不應受決得如來號。」",
        "translation": "Such good men and good women in the worldling stage shouldn't be called bodhisattvas, and they shouldn't receive the Tathāgata's name as a result of their resolve.",
        "source": "T16n0656_009:0082c29_6"
    },
    {
        "source_sentence": "目連復白佛言：「若善男子、善女人，得佛明慧分別三觀空無相願，便為如來所見授決。",
        "translation": "Again, Maudgalyāyana said to the Buddha, If good men and good women attain the Buddha's wisdom that discerns the three contemplations of emptiness without marks and vows, then they'll be judged by the Tathāgata.",
        "source": "T16n0656_009:0083a02_7"
    },
    {
        "source_sentence": "然有眾生見此人受決，便生憎嫉心：『如來何為先授此決？』",
        "translation": "Still, there are sentient beings who see this person receive a ruling and become hateful and jealous, saying, 'Why did the Tathāgata give this ruling first?'",
        "source": "T16n0656_009:0083a04_8"
    },
    {
        "source_sentence": "如此等善男子、善女人在凡夫地，不當稱為菩薩，不應受決得如來號。」",
        "translation": "Such good men and good women in the worldling stage shouldn't be called bodhisattvas, and they shouldn't receive the Tathāgata's name as a result of their resolve.",
        "source": "T16n0656_009:0083a05_9"
    },
    {
        "source_sentence": "是時，目連復白佛言：「若有善男子、善女人，得佛神足四無所畏，遊諸空界轉於法輪，",
        "translation": "Maudgalyāyana then again said to the Buddha: If there are good men and good women who have attained the four fearlessnesses of the supernormal powers of buddhahood, they can travel through all realms of space and turn the wheel of the Dharma.",
        "source": "T16n0656_009:0083a07_10"
    },
    {
        "source_sentence": "善權方便無所罣礙，所演法教皆有所益，便為如來所見授決。",
        "translation": "Good authority and skillful means are not obstructed by anything, and the teachings they teach will all be beneficial, so they'll be judged by the Tathāgata.",
        "source": "T16n0656_009:0083a09_11"
    },
    {
        "source_sentence": "然有眾生得世俗智辯才第一，知古明今三世通達，內自思惟而生此念：『我所苞攬無事不貫，",
        "translation": "Still, some sentient beings who have attained worldly knowledge and are the best at eloquence. Knowing that both ancient and modern understanding can be comprehended in all times, they internally reflect on this thought:",
        "source": "T16n0656_009:0083a10_12"
    },
    {
        "source_sentence": "如來何為不授我決？",
        "translation": "Why doesn't the Tathāgata give me a decision?",
        "source": "T16n0656_009:0083a12_13"
    },
    {
        "source_sentence": "今乃返更授此人決？』",
        "translation": "Now, is it possible to return and give this person another ruling?'",
        "source": "T16n0656_009:0083a13_14"
    },
    {
        "source_sentence": "如此等善男子、善女人在凡夫地，不應稱為菩薩，不應受決得如來號。」",
        "translation": "Such good men and good women in the worldling stage shouldn't be called bodhisattvas, and they shouldn't receive the Tathāgata's name as a result of their resolve.",
        "source": "T16n0656_009:0083a13_15"
    },
    {
        "source_sentence": "目連復白佛言：「若有善男子、善女人，得無生法忍四等具足，遊至十方無量世界，",
        "translation": "Maudgalyāyana then said to the Buddha: Suppose there are sons and daughters of a virtuous family who have attained the four kinds of forbearance in regard to the nonarising of all phenomena and travel to infinite worlds in the ten directions.",
        "source": "T16n0656_009:0083a15_16"
    },
    {
        "source_sentence": "本從此佛而發道心，更從異佛受其記別。",
        "translation": "Originally, they aroused the mind of enlightenment from this Buddha and received their assurances of enlightenment from other buddhas.",
        "source": "T16n0656_009:0083a17_17"
    },
    {
        "source_sentence": "然有眾生內自生念：『此非我眾，非我徒類，如來何為先授此決、不授我別？』",
        "translation": "Still, there are sentient beings who think to themselves, 'This is not a self or a group of selfless people; why would the Tathāgata give this ruling first and not separate it from me?'",
        "source": "T16n0656_009:0083a18_18"
    },
    {
        "source_sentence": "如此等善男子、善女人在凡夫地，不應稱為菩薩，不應受決得如來號。」",
        "translation": "Such good men and good women in the worldling stage shouldn't be called bodhisattvas, and they shouldn't receive the Tathāgata's name as a result of their resolve.",
        "source": "T16n0656_009:0083a19_19"
    },
    {
        "source_sentence": "目連復白佛言：「若有善男子、善女人，轉無上法輪，六通變化無所觸礙，",
        "translation": "Again, Maudgalyāyana said to the Buddha: If there are sons and daughters of a virtuous family who turn the supreme wheel of the Dharma, they will be transformed by the six supernormal powers without any obstruction.",
        "source": "T16n0656_009:0083a21_20"
    },
    {
        "source_sentence": "權詐巧便攝取眾生，此菩薩摩訶薩，便為如來所見授決。",
        "translation": "This bodhisattva Mahāsattva then saw the Tathāgata and gave him a ruling.",
        "source": "T16n0656_009:0083a23_21"
    },
    {
        "source_sentence": "復有眾生在三毒等分愛心未盡，未能適化承事諸佛，內自狐疑而生是念：『今觀此人如有所辦，",
        "translation": "“Furthermore, some sentient beings who have not yet exhausted their craving for the three poisons and so forth but are unable to appropriately transform themselves in order to serve the buddhas. They doubt within themselves and think:",
        "source": "T16n0656_009:0083a24_22"
    },
    {
        "source_sentence": "為是如來威力所感？",
        "translation": "Is it the result of the Tathāgata's authoritative power?",
        "source": "T16n0656_009:0083a26_23"
    },
    {
        "source_sentence": "為此善男子審有此化？』",
        "translation": "Why would this good man examine whether there's such a transformation?'",
        "source": "T16n0656_009:0083a27_24"
    },
    {
        "source_sentence": "於彼此中生猶豫想。",
        "translation": "In each other, they give rise to the perception of hesitation.",
        "source": "T16n0656_009:0083a27_25"
    },
    {
        "source_sentence": "如此等善男子、善女人在凡夫地，不應稱為菩薩，不應受決得如來號。」",
        "translation": "Such good men and good women in the worldling stage shouldn't be called bodhisattvas, and they shouldn't receive the Tathāgata's name as a result of their resolve.",
        "source": "T16n0656_009:0083a28_26"
    },
    {
        "source_sentence": "是時，目連復白佛言：「世尊！",
        "translation": "At that point, Maudgalyāyana again said to the Buddha, Bhagavān!",
        "source": "T16n0656_009:0083a29_27"
    },
    {
        "source_sentence": "若有善男子、善女人，生在龍中發菩薩心，眾行具足無所缺漏，便為如來所見授決。",
        "translation": "If there are good men and good women who are born among dragons and give rise to the bodhisattva aspiration, and their practices are complete without fail, then they'll be judged by the Tathāgata.",
        "source": "T16n0656_009:0083b01_28"
    },
    {
        "source_sentence": "或有眾生內自思惟：『我得人身諸根具足，明達正法六情完具，如來何為不授我決？",
        "translation": "Sometimes there are sentient beings who think to themselves, 'I've attained a human body with all the faculties and faculties perfected, and I clearly understand that the right teaching is fully endowed with the six emotions, so why doesn't the Tathāgata give me my ruling?'",
        "source": "T16n0656_009:0083b03_29"
    },
    {
        "source_sentence": "今乃返更授此龍決？』",
        "translation": "Now, is it possible to return and give this dragon a further ruling?'",
        "source": "T16n0656_009:0083b05_30"
    },
    {
        "source_sentence": "如此等善男子、善女人在凡夫地，不應稱為菩薩，不應受決得如來號。」",
        "translation": "Such good men and good women in the worldling stage shouldn't be called bodhisattvas, and they shouldn't receive the Tathāgata's name as a result of their resolve.",
        "source": "T16n0656_009:0083b05_31"
    },
    {
        "source_sentence": "是時，目連復白佛言：「若有善男子、善女人，已得天身發菩薩心，斷諸縛著無所戀慕，",
        "translation": "Maudgalyāyana then again said to the Buddha: If there are good men and good women who have attained heavenly bodies, give rise to the mind of enlightenment, sever all bonds and attachments, and do not cling to anything.",
        "source": "T16n0656_009:0083b07_32"
    },
    {
        "source_sentence": "捨己榮位遠離五樂，閉塞六情修清淨法，離世八法不墮十惡，便為如來所見受決。",
        "translation": "They abandon their position of glory, become far removed from the five pleasures, shut themselves off from the six emotions and cultivate pure dharmas, part with the eight worldly dharmas and don't fall into the ten bad qualities, and then they'll be judged by the Tathāgata.",
        "source": "T16n0656_009:0083b09_33"
    },
    {
        "source_sentence": "然有眾生內自生念：『今觀此天眾行未足，未捨此形復於人身，何為如來而授此決、不授我別？』",
        "translation": "Still, there are sentient beings who think to themselves, 'Now, I'm observing that the gods' various actions aren't sufficient, and they haven't yet abandoned this form and returned it to a human body; why would the Tathāgata grant me this decision or not?'",
        "source": "T16n0656_009:0083b11_0"
    },
    {
        "source_sentence": "如此等善男子、善女人在凡夫地，不應稱為菩薩，不應受決得如來號。」",
        "translation": "Such good men and good women in the worldling stage shouldn't be called bodhisattvas, and they shouldn't receive the Tathāgata's name as a result of their resolve.",
        "source": "T16n0656_009:0083b13_1"
    },
    {
        "source_sentence": "是時，目連復白佛言：「或有眾生受地獄形，以佛神力往授其決，如我昔日為佛所遣授提婆達兜決。",
        "translation": "At the time, Maudgalyāyana again said to the Buddha, Suppose there are sentient beings who receive the form of hell and use the Buddha's supernormal powers to give them a ruling, just as I used to send Devadatta to be given a ruling by the Buddha in the past.",
        "source": "T16n0656_009:0083b14_2"
    },
    {
        "source_sentence": "然有眾生內自生念：『受地獄形苦痛無量，鑊湯燒煮，死而更生，刀山劍樹、爐炭鐵輪、火車熾風、銅柱碓臼，",
        "translation": "Still, some sentient beings internally think: The form of hell is painful and immeasurable. Boiling in cauldron water, they die and are reborn.",
        "source": "T16n0656_009:0083b17_3"
    },
    {
        "source_sentence": "於中受苦痛毒無量。",
        "translation": "The pain and suffering they experience there are immeasurable.",
        "source": "T16n0656_009:0083b19_4"
    },
    {
        "source_sentence": "當爾之時何有道心？",
        "translation": "At that point, how could there be a mind of enlightenment?",
        "source": "T16n0656_009:0083b19_5"
    },
    {
        "source_sentence": "如來今日返更授決得如來號。",
        "translation": "Today, the Tathāgata returns to give another assurance that he'll attain the Tathāgata's name.",
        "source": "T16n0656_009:0083b20_6"
    },
    {
        "source_sentence": "然我等已得人身，不授我決？』",
        "translation": "Still, we've already obtained a human body, so why don't you give me the decision?'",
        "source": "T16n0656_009:0083b21_7"
    },
    {
        "source_sentence": "如此等善男子、善女人在凡夫地，不應稱為菩薩，不應受決得如來號。」",
        "translation": "Such good men and good women in the worldling stage shouldn't be called bodhisattvas, and they shouldn't receive the Tathāgata's name as a result of their resolve.",
        "source": "T16n0656_009:0083b21_8"
    },
    {
        "source_sentence": "是時，目連復白佛言：「若有善男子、善女人，生餓鬼中受餓鬼形，善見菩薩父像、舍利弗祖、善施長者母，",
        "translation": "Again, Maudgalyāyana said to the Buddha: Suppose there are sons and daughters of a virtuous family who have been born among the hungry ghosts and receive the form of a hungry ghost. The Bodhisattva Sudarśana saw their father’s images, Śāriputra’s grandmother, Supratiṣṭhita’s mother, Vimalakīrti",
        "source": "T16n0656_009:0083b23_9"
    },
    {
        "source_sentence": "受形苦惱，腹如泰山咽如細鍼，咽長千丈而有千鬲，一鬲千節，雖得漿水化為膿血，",
        "translation": "Their belly is like Mount Tai, and their throat is like a fine needle. Their throats are one thousand zhang long with a thousand liang in length; even though they swallow milk and water to turn it into pus and blood, the flesh does not give forth any kind of nourishment.",
        "source": "T16n0656_009:0083b25_10"
    },
    {
        "source_sentence": "眼如深井如千丈崖，然受苦痛不可稱量，為餓火所燒求死不得。",
        "translation": "Their eyes are as deep as a thousand-foot cliff, yet they experience pain and suffering that can't be measured, and they're burned by a hungry fire and unable to die.",
        "source": "T16n0656_009:0083b27_11"
    },
    {
        "source_sentence": "然佛世尊以大慈悲，即遣舍利弗各授其決，令發道心。",
        "translation": "With great compassion, however, the Bhagavān sent Śāriputra to each of them and gave them their rulings, causing them to give rise to the mind of enlightenment.",
        "source": "T16n0656_009:0083b29_12"
    },
    {
        "source_sentence": "然有眾生內自生念：『餓鬼苦惱無量，飢寒苦毒不可稱計，然今如來返授彼決、不授我決。』",
        "translation": "Still, there are sentient beings who internally think, 'The suffering and distress of hungry ghosts are immeasurable, and the pain and vexation of hunger and cold can't be measured; but now the Tathāgata returns to give them a ruling or doesn't give me a ruling.'",
        "source": "T16n0656_009:0083c01_13"
    },
    {
        "source_sentence": "如此等善男子、善女人在凡夫地，不應稱為菩薩，不應受決得如來號。」",
        "translation": "Such good men and good women in the worldling stage shouldn't be called bodhisattvas, and they shouldn't receive the Tathāgata's name as a result of their resolve.",
        "source": "T16n0656_009:0083c03_14"
    },
    {
        "source_sentence": "爾時，世尊告目連曰：「善哉，善哉！",
        "translation": "At that point, the Bhagavān addressed Maudgalyāyana, Good, good!",
        "source": "T16n0656_009:0083c05_15"
    },
    {
        "source_sentence": "族姓子！",
        "translation": "clansmen!",
        "source": "T16n0656_009:0083c05_16"
    },
    {
        "source_sentence": "堪任宣暢菩薩受決無礙之行，真佛之子非思欲生。」",
        "translation": "They're capable of proclaiming the unobstructed practice of the bodhisattva who receives the ruling, and the truly buddha-son doesn't think about wanting to be born.",
        "source": "T16n0656_009:0083c05_17"
    },
    {
        "source_sentence": "爾時，弊魔波旬內自生念：「咄！",
        "translation": "It was then that the evil Māra Pāpīyān thought to himself, Duh!",
        "source": "T16n0656_009:0083c07_18"
    },
    {
        "source_sentence": "我所行將不謬乎？",
        "translation": "Wouldn't what I do be wrong?",
        "source": "T16n0656_009:0083c07_19"
    },
    {
        "source_sentence": "今聞尊者大目揵連所說，不為諸人，正為我耳。」",
        "translation": "Now, I've heard what Venerable Mahāmaudgalyāyana teaches, which isn't for people but for me.",
        "source": "T16n0656_009:0083c08_20"
    },
    {
        "source_sentence": "是時，波旬即從坐起，除去貢高捨憍慢心，前至佛所，頭面禮足，前白佛言：「世尊！",
        "translation": "At that point, Pāpīyān rose from his seat, removed his arrogance and abandoned his conceit, went to the Buddha, bowed his head and feet, and said to him, Bhagavān!",
        "source": "T16n0656_009:0083c09_21"
    },
    {
        "source_sentence": "我今愚惑，久處邪見未識真道。",
        "translation": "Now, I'm foolish and confused, and for a long time I've had wrong views that haven't known the true path.",
        "source": "T16n0656_009:0083c11_22"
    },
    {
        "source_sentence": "今釋提桓因為我所統，如來今日先授其決，我即興意生是非心。",
        "translation": "Now that Śakra Devānām-Indra is governed by me, the Tathāgata will first give him a ruling today, and I'll arouse my mind to think right or wrong.",
        "source": "T16n0656_009:0083c11_23"
    },
    {
        "source_sentence": "唯願世尊，受我悔過，消滅欲本不著榮冀。」",
        "translation": "Please, Bhagavān, accept my repentance and extinguish your desires without being attached to their prosperity in the first place.",
        "source": "T16n0656_009:0083c13_24"
    },
    {
        "source_sentence": "佛告弊魔波旬：「汝今座上見彌勒菩薩不乎？」",
        "translation": "The Buddha told Māra Pāpīyān, Did you see Maitreya Bodhisattva on your seat now?",
        "source": "T16n0656_009:0083c14_25"
    },
    {
        "source_sentence": "波旬白佛：「唯然。",
        "translation": "Pāpīyān said to the Buddha, Yes.",
        "source": "T16n0656_009:0083c15_26"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T16n0656_009:0083c15_27"
    },
    {
        "source_sentence": "佛告波旬：「此彌勒菩薩當授汝決得菩薩號。」",
        "translation": "The Buddha told Pāpīyān, This Maitreya Bodhisattva will give you the name bodhisattva in order to determine your attainment.",
        "source": "T16n0656_009:0083c15_28"
    },
    {
        "source_sentence": "菩薩瓔珞經淨智除垢品第二十七",
        "translation": "Chapter twenty-seventh of the Sutra of the Yingluo of the Bodhisattva's Pure Wisdom and Removing Defilement, Chapter twenty-seven",
        "source": "T16n0656_009:0083c17_0"
    },
    {
        "source_sentence": "東方去此三十七恒河沙數，有佛土名曰華嚴，佛名一意如來、至真、等正覺、明行成為、善逝、世間解、無上士、道法御、天人師，",
        "translation": "“East of here, as many as there are grains of sand in thirty-seven Ganges Rivers, is a buddha land called Flower Ornament. The Buddha there is called One Thought Tathāgata, Arhat, Perfectly Enlightened, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Unsur",
        "source": "T16n0656_009:0083c18_0"
    },
    {
        "source_sentence": "號佛、世尊。",
        "translation": "They are called buddhas and world-honored ones.",
        "source": "T16n0656_009:0083c20_1"
    },
    {
        "source_sentence": "彼佛如來遣一菩薩，名曰淨一切地，具眾行本定意不亂，三昧正受無所罣礙。",
        "translation": "The Buddha, the Tathāgata, sent a bodhisattva named Pure All Stages, who possessed all the practices of the original concentration and didn't disturb his mind in samādhi and correctly received it without obstruction.",
        "source": "T16n0656_009:0083c21_0"
    },
    {
        "source_sentence": "佛所住處皆悉履行，不染法界去吾我想，即從座起，偏露右臂，右膝著地，",
        "translation": "Wherever the Buddha dwelled, he fulfilled them all. He was not stained by the realm of reality and departed from the idea of self. Then he rose from his seat, bared his right shoulder, knelt on the ground with his right knee touching the ground.",
        "source": "T16n0656_009:0083c22_1"
    },
    {
        "source_sentence": "長跪叉手，前白佛言：「欲有所問，若見聽者，敢有所陳。」",
        "translation": "He knelt down with his palms joined together and said to the Buddha, I want to ask a question, but if I see someone who hears it, I dare to offer something.",
        "source": "T16n0656_009:0083c24_2"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T16n0656_009:0083c25_3"
    },
    {
        "source_sentence": "族姓子！",
        "translation": "clansmen!",
        "source": "T16n0656_009:0083c26_4"
    },
    {
        "source_sentence": "欲問如來所懷疑者，今正是時。」",
        "translation": "Those who want to ask the Tathāgata about what he doubts, now is the right time.",
        "source": "T16n0656_009:0083c26_5"
    },
    {
        "source_sentence": "淨一切地菩薩白佛言：「世尊！",
        "translation": "The Pure All-Earth Bodhisattva said to the Buddha, Bhagavān!",
        "source": "T16n0656_009:0083c26_6"
    },
    {
        "source_sentence": "云何善男子、善女人，供養諸佛無諸佛想，於諸法本亦復如是？",
        "translation": "How can good men and good women make offerings to the buddhas without conceptualizing the buddhas, and so it is with the source of all dharmas?",
        "source": "T16n0656_009:0083c27_7"
    },
    {
        "source_sentence": "雖度眾生無眾生念，行菩薩道不失本意，具足諸願德行充滿，受決心淨不離明慧。」",
        "translation": "Although he liberates sentient beings without the thoughts of sentient beings, he practices the bodhisattva path without losing his original intention, is fully endowed with the virtues and conduct of vows, experiences the purity of mind and doesn't part from insight.",
        "source": "T16n0656_009:0083c29_0"
    },
    {
        "source_sentence": "爾時，世尊告淨一切地菩薩曰：「若有善男子、善女人，分別思惟大乘行本不可思議深奧之藏，",
        "translation": "At the time, the Bhagavān addressed the bodhisattva Pure All Stages, saying, Suppose there are good men and good women who discriminate and contemplate the practice of the great vehicle as the root of inconceivable, profound treasure house of enlightenment.",
        "source": "T16n0656_009:0084a01_1"
    },
    {
        "source_sentence": "先當習學定意正受，除亂想行，然後乃具六度無極，自觀身空觀他人心亦復如是。",
        "translation": "You must first cultivate concentration, contemplation, and right feeling, remove distracting thoughts and actions, and then you'll have the six perfections without limit, observing yourself as emptiness and observing other people's minds in the same way.",
        "source": "T16n0656_009:0084a04_0"
    },
    {
        "source_sentence": "若善男子、善女人，入等定三昧心不動轉，悉能分別一切眾行。",
        "translation": "If good men and good women enter samādhi such as this without moving their minds, they'll be able to discern all the various practices.",
        "source": "T16n0656_009:0084a05_1"
    },
    {
        "source_sentence": "云何善男子、善女人入定三昧，於一切法思惟分別無有錯謬？",
        "translation": "How do good men and good women enter the concentration samādhi, contemplating and discerning all things without error?",
        "source": "T16n0656_009:0084a07_2"
    },
    {
        "source_sentence": "於是，族姓子！",
        "translation": "Then, clansmen!",
        "source": "T16n0656_009:0084a08_3"
    },
    {
        "source_sentence": "若有菩薩摩訶薩，立根得力逮不退轉，便能入定自觀身本本所從來，一一分別悉知起滅，",
        "translation": "If there are bodhisattva mahāsattvas who establish faculties, attain powers, acquire nonregression, then they can enter concentration and observe for themselves where the body comes from in the past, discerning one by one and fully knowing its arising and ceasing.",
        "source": "T16n0656_009:0084a09_0"
    },
    {
        "source_sentence": "來不知所從來、去不知所從去。",
        "translation": "The coming doesn't know where it comes from, and the going doesn't know where it goes.",
        "source": "T16n0656_009:0084a11_1"
    },
    {
        "source_sentence": "此善男子、善女人從定意起，復入外身定意，一一分別眾生之類。",
        "translation": "These good men and good women arise from the mind of concentration and then enter the mind of concentration in their external bodies, one by one distinguishing the types of sentient beings.",
        "source": "T16n0656_009:0084a11_2"
    },
    {
        "source_sentence": "復見無量諸佛剎土，有受形者不受形者。",
        "translation": "Again, they see measureless buddha-lands where there are those who receive form and those who don't.",
        "source": "T16n0656_009:0084a13_3"
    },
    {
        "source_sentence": "或時善男子、善女人，復更入定觀內外身，彼身我身發趣有異身行共同，",
        "translation": "“Sometimes, good men and good women again enter concentration to contemplate internal and external bodies. Their bodies, self, and body give rise to different [realms] of rebirth, which are the same in body and action.",
        "source": "T16n0656_009:0084a14_4"
    },
    {
        "source_sentence": "如我所觀，趣大乘者不捨眾生，求緣覺者亦不求清淨於佛土，弟子學者承聲受教離於三有，",
        "translation": "As I observe, those who are headed for the great vehicle don’t abandon sentient beings; those seeking pratyekabuddhahood don’t seek purity in the buddha-lands. Disciples and scholars listen to their voices and receive instruction free of the three realms of existence.",
        "source": "T16n0656_009:0084a15_5"
    },
    {
        "source_sentence": "是謂內外觀定身行共同發趣有異。」",
        "translation": "This means that there's a difference between internally perceived concentration, bodily actions, and the shared arousal of destinies.",
        "source": "T16n0656_009:0084a17_6"
    },
    {
        "source_sentence": "佛復告淨一切地曰：「若有善男子、善女人，入此等定正受三昧，悉使無量世界盡從化教、從化得度，",
        "translation": "Again, the Buddha said to Maitreya: If there are sons and daughters of a virtuous family who enter all these states of absorption, they will cause innumerable worlds to follow their instruction and be liberated through instruction.",
        "source": "T16n0656_009:0084a18_7"
    },
    {
        "source_sentence": "隨意所樂恣其心意遊於百千三昧，於中攝意而不錯亂，是謂善男子、善女人趣大乘者不捨眾生。」",
        "translation": "Traveling to a hundred thousand samādhis according to one's wishes and indulging their minds with pleasure, taking care of their thoughts without confusion, this is called a good man or woman who goes to the great vehicle and doesn't abandon sentient beings.",
        "source": "T16n0656_009:0084a20_8"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩：「若有善男子、善女人入一身定，便能觀察眾生心本，",
        "translation": "Again, the Buddha told the bodhisattva Pure All Stages: If there are good men and good women who enter one body concentration, they will be able to examine the minds of sentient beings.",
        "source": "T16n0656_009:0084a23_9"
    },
    {
        "source_sentence": "有婬怒癡、無婬怒癡，隨其本行而度脫之。",
        "translation": "They have the delusion of anger and the delusion of absence of anger, and they are liberated according to their original actions.",
        "source": "T16n0656_009:0084a24_10"
    },
    {
        "source_sentence": "此善男子、善女人從一身定起，復入眾多身定，觀眾生類有婬怒癡、無婬怒癡，",
        "translation": "These sons and daughters of a virtuous family, having emerged from the one-pointed concentration of one body, return to the many-pointed concentration of body. All living beings are filled with hatred, wickedness, delusion, and no hatred or wickedness.",
        "source": "T16n0656_009:0084a25_11"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0084a27_12"
    },
    {
        "source_sentence": "爾時，世尊復告淨一切地菩薩：「若有善男子、善女人入無形觀三昧，",
        "translation": "At that point, the Bhagavān again addressed the bodhisattva Pure All Stages, Suppose there are good men and good women who enter the formless contemplation samādhi",
        "source": "T16n0656_009:0084a28_0"
    },
    {
        "source_sentence": "遍觀眾生心識所念，眾生若干所念不同。",
        "translation": "They pervade the minds and consciousnesses of sentient beings, and there are different kinds of thoughts of sentient beings.",
        "source": "T16n0656_009:0084a29_1"
    },
    {
        "source_sentence": "復有三昧名觀眾生心，菩薩摩訶薩得此定意者，便能觀察人道眾生，遍知十方無量世界，",
        "translation": "“Furthermore, there is another concentration called observing the mind of sentient beings. When great enlightening beings attain this concentration, they are able to observe all sentient beings and know infinitely many worlds in the ten directions:",
        "source": "T16n0656_009:0084b01_2"
    },
    {
        "source_sentence": "有婬怒癡、無婬怒癡，隨其本行而度脫之。」",
        "translation": "If there's anger, anger, delusion, and no anger or delusion, he liberates them according to their original actions.",
        "source": "T16n0656_009:0084b03_3"
    },
    {
        "source_sentence": "佛復告族姓子：「復有定意知閱叉心，菩薩摩訶薩得此三昧者，遍觀閱叉心識所念，",
        "translation": "Again, the Buddha told the clansman, Again, there's another concentration that knows the mind of the yakṣa. When the bodhisattva Mahāsattva attains this concentration, he observes all the thoughts of the yakṣa mind and consciousnesses:",
        "source": "T16n0656_009:0084b04_4"
    },
    {
        "source_sentence": "有婬怒癡、無婬怒癡，隨其本行而度脫之。」",
        "translation": "If there's anger, anger, delusion, and no anger or delusion, he liberates them according to their original actions.",
        "source": "T16n0656_009:0084b06_5"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知諸龍心，菩薩得此定意者，便能觀察龍道眾生心識所念，",
        "translation": "Again, the Buddha said to the bodhisattva Pure All-Embracing: There is another concentration that knows the minds of all the nāgas. When a bodhisattva has attained this concentration, he will be able to examine the thoughts of sentient beings in the realm of the nāgas and see what they are thinking.",
        "source": "T16n0656_009:0084b07_6"
    },
    {
        "source_sentence": "遍知十方無量世界，有婬怒癡、無婬怒癡，隨其本行而度脫之。」",
        "translation": "He pervades the measureless worlds in the ten directions with anger and no anger, and he liberates them according to their original actions.",
        "source": "T16n0656_009:0084b09_7"
    },
    {
        "source_sentence": "佛復告淨一切地曰：「復有定意知阿須倫心，菩薩摩訶薩得此定意者，",
        "translation": "Again, the Buddha told Śubhavyūha, “There are also bodhisattvas and mahāsattvas who have concentrated their minds to know the minds of the asuras.",
        "source": "T16n0656_009:0084b11_0"
    },
    {
        "source_sentence": "便能觀察須倫所念，遍觀十方無量世界，有婬怒癡、無婬怒癡，隨其本行而度脫之。」",
        "translation": "He'll then be able to observe what the Sūrya thinks and pervade measureless worlds in the ten directions, where there's lust, anger, delusion, and no lust or delusion, and liberate them according to their original actions.",
        "source": "T16n0656_009:0084b12_1"
    },
    {
        "source_sentence": "佛復告族姓子：「復有定意知諸天心，菩薩得此定意者，便能觀察天道眾生心，",
        "translation": "Again, the Buddha said to the brāhmaṇa: Again, if a bodhisattva is concentrated and knows the minds of the gods, he attains concentration such that he can examine the minds of sentient beings in the heavenly realm.",
        "source": "T16n0656_009:0084b14_2"
    },
    {
        "source_sentence": "遍知十方無量世界，有婬怒癡、無婬怒癡，隨其本行而度脫之。」",
        "translation": "He pervades the measureless worlds in the ten directions with anger and no anger, and he liberates them according to their original actions.",
        "source": "T16n0656_009:0084b16_3"
    },
    {
        "source_sentence": "佛復告族姓子：「復有定意知梵天心，菩薩摩訶薩得此定意，便能觀察淨志天心，",
        "translation": "Again, the Buddha said to the brāhmaṇa: Again, if there is a bodhisattva Mahāsattva whose mind is concentrated on knowing the minds of the Brahmā gods, how can he examine the minds of the Śubhakṛtsna gods?",
        "source": "T16n0656_009:0084b17_4"
    },
    {
        "source_sentence": "遍知十方無量世界，有婬怒癡、無婬怒癡，隨其本行而度脫之。」",
        "translation": "He pervades the measureless worlds in the ten directions with anger and no anger, and he liberates them according to their original actions.",
        "source": "T16n0656_009:0084b19_5"
    },
    {
        "source_sentence": "佛復告族姓子：「復有定意知欲界眾生心，菩薩摩訶薩得此定意，便能觀察欲界眾生，",
        "translation": "Again, the Buddha told the clansman, Again, there are concentrations that know the minds of sentient beings in the desire realm. When bodhisattvas and mahāsattvas attain these concentrations, they can then observe the minds of sentient beings in the desire realm:",
        "source": "T16n0656_009:0084b21_6"
    },
    {
        "source_sentence": "遍知十方無量世界，有婬怒癡、無婬怒癡，隨其本行而度脫之。」",
        "translation": "He pervades the measureless worlds in the ten directions with anger and no anger, and he liberates them according to their original actions.",
        "source": "T16n0656_009:0084b23_0"
    },
    {
        "source_sentence": "佛復告族姓子：「復有定意知地獄心，菩薩摩訶薩得此定意者，便能觀察地獄眾生，",
        "translation": "Again, the Buddha told the clansman, Again, there are concentrations that know the minds of the hells, and bodhisattvas, mahāsattvas, who attain these concentrations can then observe the sentient beings in hell.",
        "source": "T16n0656_009:0084b24_1"
    },
    {
        "source_sentence": "遍觀十方無量世界，有婬怒癡、無婬怒癡，隨其本行而度脫之。」",
        "translation": "Observing the measureless worlds in the ten directions, there's lust, anger, and no lust or anger, he liberates them according to their original actions.",
        "source": "T16n0656_009:0084b26_2"
    },
    {
        "source_sentence": "佛復告族姓子：「復有定意知弗于逮眾生心，菩薩摩訶薩得此定意者，",
        "translation": "Again, the Buddha told the clansman, Again, there's a concentration that knows the minds of sentient beings in Pūrvavideha, and the bodhisattva Mahāsattva attains this concentration.",
        "source": "T16n0656_009:0084b27_3"
    },
    {
        "source_sentence": "便能觀察弗于逮眾生，遍知十方無量世界，有婬怒癡、無婬怒癡，隨其本行而度脫之。」",
        "translation": "They can then observe the sentient beings of Pūrvavideha and pervade measureless worlds in the ten directions, have anger, rage, delusion, and no anger or delusion, and liberate them according to their original actions.",
        "source": "T16n0656_009:0084b29_4"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知閻浮地眾生心，菩薩摩訶薩得此定意者，",
        "translation": "Again, the Buddha said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a concentrated mind that knows the minds of sentient beings in Jambudvfpa, then the bodhisattva Mahāsattva who has attained this concentrated mind",
        "source": "T16n0656_009:0084c02_5"
    },
    {
        "source_sentence": "便能觀察閻浮地眾生，遍知十方無量世界，有婬怒癡、無婬怒癡，隨其本行而度脫之。」",
        "translation": "They can then observe the sentient beings in Jambudvīpa and pervade measureless worlds in the ten directions with lust, anger, delusion, and no lust, and liberate them according to their original actions.",
        "source": "T16n0656_009:0084c04_6"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知瞿耶尼眾生心，菩薩得此定意者，",
        "translation": "Again, the Buddha said to the bodhisattva Pure All-Embracing, “There are also bodhisattvas whose minds are concentrated and who know the minds of the residents of Aparagodānīya.",
        "source": "T16n0656_009:0084c06_7"
    },
    {
        "source_sentence": "便能觀察瞿耶尼眾生心意，遍知十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the minds and thoughts of the residents of Gostana, knowing that in measureless worlds in the ten directions there is neither anger nor wickedness.",
        "source": "T16n0656_009:0084c07_8"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0084c09_9"
    },
    {
        "source_sentence": "佛告淨一切地菩薩曰：「復有定意知欝單曰眾生心中所念，菩薩得此定意，",
        "translation": "The Buddha said to the bodhisattva Pure All-Embracing, “Furthermore, there are those bodhisattvas who have concentrated their minds and know what is in the minds of sentient beings in Uttarakuru.",
        "source": "T16n0656_009:0084c09_10"
    },
    {
        "source_sentence": "便能觀察欝單曰眾生心，遍知十方無量世界，有婬怒癡、無婬怒癡，隨其本行而度脫之。」",
        "translation": "They'll then be able to observe the minds of the sentient beings in Uttarakuru and pervade measureless worlds in the ten directions, where there's lust, anger, delusion, and no lust or delusion, and liberate them according to their original actions.",
        "source": "T16n0656_009:0084c11_11"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知一四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated on knowing what sentient beings in one of the four continents think and who has attained this concentration,",
        "source": "T16n0656_009:0084c13_12"
    },
    {
        "source_sentence": "便能觀察一四天下眾生心中所念，遍知十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of all sentient beings in each of the four quarters of the earth. He had knowledge of the infinity of worlds in the ten directions, their lust, anger, and delusion as well as the absence of hatred or anger.",
        "source": "T16n0656_009:0084c15_13"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0084c17_14"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知二四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva who has concentrated his mind and knows what sentient beings in the two continents have in their minds, then those bodhisattvas will attain this concentration.",
        "source": "T16n0656_009:0084c17_15"
    },
    {
        "source_sentence": "便能觀察二四天下眾生心中所念，遍知十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of sentient beings in the two continents and know all the boundless worlds in the ten directions, whether they had anger or no anger.",
        "source": "T16n0656_009:0084c19_16"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0084c21_17"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知三四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if a bodhisattva is concentrated in mind and knows what the sentient beings of the three continents have in their minds, then he or she will attain this concentration.",
        "source": "T16n0656_009:0084c21_18"
    },
    {
        "source_sentence": "便能觀察三四天下眾生心中所念，遍知十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "They can observe the thoughts of sentient beings in the three continents and know all the boundless worlds in the ten directions, whether they have anger or no anger.",
        "source": "T16n0656_009:0084c23_19"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0084c25_20"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知四四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva who has concentrated his mind and knows what sentient beings in the four continents have in their minds, then those bodhisattvas will attain this concentration.",
        "source": "T16n0656_009:0084c26_0"
    },
    {
        "source_sentence": "便能觀察四四天下眾生心中所念，遍知十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of sentient beings in the four quarters of the earth, pervading infinitely many worlds in the ten directions. There was neither anger nor wickedness and there was no anger or wickedness.",
        "source": "T16n0656_009:0084c27_1"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0084c29_2"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知五四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated on knowing what sentient beings in the five continents think and who has attained this concentration,",
        "source": "T16n0656_009:0085a01_3"
    },
    {
        "source_sentence": "便能觀察五四天下眾生心中所念，遍知十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of sentient beings in the five quarters of the earth, pervading infinitely many worlds in the ten directions. There was neither anger nor wickedness in his mind and he had no anger or wickedness at all.",
        "source": "T16n0656_009:0085a03_0"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085a04_1"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知六四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated and knows what sentient beings in the sixth or the fourth heaven have in their minds, then those bodhisattvas who attain this concentration will not be able to realize it.",
        "source": "T16n0656_009:0085a06_0"
    },
    {
        "source_sentence": "便能觀察六四天下眾生心中所念，遍知十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of sentient beings in the six quarters of the earth. He knew all the infinite worlds in the ten directions, where there was neither anger nor wickedness and no anger or wickedness.",
        "source": "T16n0656_009:0085a07_1"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085a09_2"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知七四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva who has concentrated his mind and knows what sentient beings in the seventh or the fourth heaven have in their minds.",
        "source": "T16n0656_009:0085a10_3"
    },
    {
        "source_sentence": "便能觀察七四天下眾生心中所念，遍知十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of sentient beings in the seven quarters of the earth, pervading infinitely many worlds in the ten directions. There was neither anger nor hatred or delusion in all those worlds.",
        "source": "T16n0656_009:0085a12_0"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085a13_1"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知八四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated on knowing what sentient beings in the eighty-fourth heaven think and who has attained this concentration,",
        "source": "T16n0656_009:0085a14_2"
    },
    {
        "source_sentence": "便能觀察八四天下眾生心中所念，遍知十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of sentient beings in the eighty-four continents. He could know all the boundless worlds in the ten directions, where there was neither anger nor hatred or ignorance.",
        "source": "T16n0656_009:0085a16_3"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085a17_4"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知九四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated on knowing what sentient beings in the ninety-four heavens think and who has attained this concentration,",
        "source": "T16n0656_009:0085a18_5"
    },
    {
        "source_sentence": "便能觀察九四天下眾生心中所念，遍觀十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of sentient beings in the nine quarters of the earth, pervading infinitely many worlds in the ten directions. There was neither anger nor wickedness in him.",
        "source": "T16n0656_009:0085a20_6"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085a22_0"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知十四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if a bodhisattva has concentration and knows what sentient beings of the fourteen continents think in their minds, then he will attain this concentration.",
        "source": "T16n0656_009:0085a22_1"
    },
    {
        "source_sentence": "便能觀察十四天下眾生心中所念，遍知十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "They can observe the thoughts of sentient beings in the fourteen continents and know all the boundless worlds in the ten directions, whether they have anger or no anger.",
        "source": "T16n0656_009:0085a24_2"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085a26_0"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知百四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated on knowing what sentient beings in one hundred and forty-four heavens think, then he will attain this concentration.",
        "source": "T16n0656_009:0085a26_1"
    },
    {
        "source_sentence": "便能觀察百四天下眾生心中所念，遍觀十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of one hundred and four thousand sentient beings in the ten directions, pervading measureless worlds in the ten directions.",
        "source": "T16n0656_009:0085a28_2"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085b01_3"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知千四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated on knowing what sentient beings in one thousand four continents think and who has attained this concentration,",
        "source": "T16n0656_009:0085b01_4"
    },
    {
        "source_sentence": "便能觀察千四天下眾生心中所念，遍觀十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of sentient beings in one thousand four continents, pervading measureless worlds in the ten directions, with lust, anger, and ignorance.",
        "source": "T16n0656_009:0085b03_5"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085b05_6"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知萬四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, those bodhisattvas who have concentrated their minds and know what sentient beings in the fourteen thousand buddha-fields think.",
        "source": "T16n0656_009:0085b05_7"
    },
    {
        "source_sentence": "便能觀察萬四天下眾生心中所念，遍觀十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of sentient beings in the ten thousand-four continents, pervading measureless worlds in the ten directions with lust, anger, and delusion free from lust.",
        "source": "T16n0656_009:0085b07_8"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085b09_9"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知億萬四天下眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated and knows what sentient beings in the four continents have in their minds, then he or she will attain this concentration.",
        "source": "T16n0656_009:0085b09_10"
    },
    {
        "source_sentence": "便能觀察億萬四天下眾生心中所念，遍知十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the mentalities of millions and millions of sentient beings in the four continents, pervading infinitely many worlds in the ten directions with lust, anger, and ignorance.",
        "source": "T16n0656_009:0085b11_11"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085b13_12"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知一佛國眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated on knowing what sentient beings in one buddha-land think and who has attained this concentration,",
        "source": "T16n0656_009:0085b13_13"
    },
    {
        "source_sentence": "便能觀察知一佛境界眾生心中所念，遍知十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to perceive the minds of sentient beings in the sphere of a single buddha; he could know the infinity of worlds in the ten directions, with or without anger or hatred.",
        "source": "T16n0656_009:0085b15_14"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085b17_15"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知十佛剎土眾生心中所念，菩薩得此定意者，",
        "translation": "Again, the Buddha said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated on knowing what sentient beings in the ten buddha-lands think and who has attained this concentration,",
        "source": "T16n0656_009:0085b18_16"
    },
    {
        "source_sentence": "便能觀察十佛剎土眾生心中所念，遍觀十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of sentient beings in the ten buddha-lands, pervading measureless worlds in the ten directions, with no anger or wickedness.",
        "source": "T16n0656_009:0085b19_17"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085b21_18"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知百佛剎土眾生心中所念，菩薩得此定意者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated on knowing what sentient beings in one hundred buddha-lands think and who has attained this concentration,",
        "source": "T16n0656_009:0085b22_19"
    },
    {
        "source_sentence": "便能觀察百佛剎土眾生心中所念，遍觀十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the mentalities of beings in a hundred buddha-lands, pervading infinitely many worlds in the ten directions with no anger or hatred.",
        "source": "T16n0656_009:0085b24_20"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085b25_21"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知萬佛剎土眾生心中所念，菩薩得此定意者，",
        "translation": "Again, the Buddha said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated on knowing what sentient beings in myriad buddha-lands think and who has attained this concentration,",
        "source": "T16n0656_009:0085b26_22"
    },
    {
        "source_sentence": "便能觀察萬佛剎土眾生心中所念，遍觀十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of sentient beings in myriad buddha-lands, pervading measureless worlds in the ten directions, with no anger or wickedness.",
        "source": "T16n0656_009:0085b28_23"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085b29_24"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「復有定意知億佛剎土眾生心中所念，菩薩得此定意者，",
        "translation": "Again, the Buddha said to the bodhisattva Pure All-Embracing, “Furthermore, if there is a bodhisattva whose mind is concentrated on knowing what sentient beings in one hundred million buddha-lands think and who has attained this concentration,",
        "source": "T16n0656_009:0085c01_25"
    },
    {
        "source_sentence": "便能觀察億佛剎土眾生心中所念，遍觀十方無量世界，有婬怒癡、無婬怒癡，",
        "translation": "He was able to observe the thoughts of sentient beings in billions of buddha-lands, pervading countless worlds in the ten directions, with no anger or wickedness.",
        "source": "T16n0656_009:0085c03_26"
    },
    {
        "source_sentence": "隨其本行而度脫之。",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085c05_27"
    },
    {
        "source_sentence": "如是菩薩摩訶薩，於此定意，盡得具足諸三昧王。」",
        "translation": "Thus, the bodhisattva Mahāsattva has fully attained the king of samādhi in this concentration.",
        "source": "T16n0656_009:0085c05_28"
    },
    {
        "source_sentence": "佛復告淨一切地菩薩曰：「若有善男子、善女人，奉持修習此法門者，",
        "translation": "The Buddha again said to the bodhisattva Pure All-Embracing, “If there are sons and daughters of a virtuous family who uphold and practice this teaching,",
        "source": "T16n0656_009:0085c07_0"
    },
    {
        "source_sentence": "便獲如來眾相具足。」",
        "translation": "They'll then attain the full accomplishment of the Tathāgata's many characteristics.",
        "source": "T16n0656_009:0085c08_1"
    },
    {
        "source_sentence": "爾時，世尊告淨一切地菩薩曰：「若有善男子、善女人，得此三昧定意者，",
        "translation": "At that time the World-honored One said to the bodhisattva Sarvasaṃdhinirmita-vaśavartin: If there are sons and daughters of a virtuous family who have attained this concentration,",
        "source": "T16n0656_009:0085c09_0"
    },
    {
        "source_sentence": "有善權方便教化眾生，復有十事得功德業。",
        "translation": "With skillful means and good authority to teach sentient beings, there are ten other things that attain meritorious actions.",
        "source": "T16n0656_009:0085c10_1"
    },
    {
        "source_sentence": "云何為十？",
        "translation": "What are these ten?",
        "source": "T16n0656_009:0085c11_2"
    },
    {
        "source_sentence": "一者、口氣清淨人多信用；",
        "translation": "The first is the great faith of those whose mouths are clear and pure.",
        "source": "T16n0656_009:0085c11_3"
    },
    {
        "source_sentence": "二者、不失本意不譏彼受；",
        "translation": "The second is that they do not lose their original intention and do not criticize those who receive it.",
        "source": "T16n0656_009:0085c12_4"
    },
    {
        "source_sentence": "三者、善明算數知六十四變；",
        "translation": "The third is that they are skilled in calculating and knowing the sixty-four transformations.",
        "source": "T16n0656_009:0085c13_5"
    },
    {
        "source_sentence": "四者、分別空無形相法；",
        "translation": "The fourth is the principle of discriminating emptiness as formless.",
        "source": "T16n0656_009:0085c13_6"
    },
    {
        "source_sentence": "五者、知當來法解脫無緣；",
        "translation": "The fifth is that they know the liberation of future truths has no perceptual object.",
        "source": "T16n0656_009:0085c14_7"
    },
    {
        "source_sentence": "六者、於現在法念成證法；",
        "translation": "The sixth is the attainment of enlightenment by being mindful of presently existing phenomena.",
        "source": "T16n0656_009:0085c14_8"
    },
    {
        "source_sentence": "七者、憶過去行知以無相；",
        "translation": "The seventh is that they remember past actions and know them by means of signlessness.",
        "source": "T16n0656_009:0085c15_9"
    },
    {
        "source_sentence": "八者、於無相法本無自然；",
        "translation": "The eighth is that there is originally no spontaneity in signless dharmas.",
        "source": "T16n0656_009:0085c16_0"
    },
    {
        "source_sentence": "九者、起滅自然不著三世；",
        "translation": "The ninth is that arising and perishing naturally do not cling to the three time periods.",
        "source": "T16n0656_009:0085c16_1"
    },
    {
        "source_sentence": "十者、菩薩定意不失次第。",
        "translation": "10. The bodhisattva's concentration doesn't lose its order.",
        "source": "T16n0656_009:0085c17_2"
    },
    {
        "source_sentence": "是謂菩薩摩訶薩入定三昧，便能觀察億佛剎土眾生心中所念，有婬怒癡、無婬怒癡，",
        "translation": "“This is how great enlightening beings enter concentration and are able to contemplate the thoughts of sentient beings in billions of buddha-lands:",
        "source": "T16n0656_009:0085c17_3"
    },
    {
        "source_sentence": "隨其本行而度脫之。」",
        "translation": "He liberates them according to their original practice.",
        "source": "T16n0656_009:0085c19_4"
    },
    {
        "source_sentence": "◎菩薩瓔珞經無斷品第二十八◎佛復告等行菩薩：「若有善男子、善女人，",
        "translation": "Bodhisattva Yingluo jing wuqian pin xxviii The Buddha further addressed the bodhisattva Samantabhadra, saying:",
        "source": "T16n0656_009:0085c20_5"
    },
    {
        "source_sentence": "從初發意發菩薩心，修行五法不懷怯弱。",
        "translation": "From the first, he arouses the intention to give rise to the bodhisattva's mind and cultivates five things without harboring timidity.",
        "source": "T16n0656_009:0085c22_6"
    },
    {
        "source_sentence": "云何五法？",
        "translation": "(5) What is the fivefold item?",
        "source": "T16n0656_009:0085c23_7"
    },
    {
        "source_sentence": "一者、勸進前人不捨道心；",
        "translation": "The first is to exhort those who have gone before them not to give up the determination for enlightenment.",
        "source": "T16n0656_009:0085c24_8"
    },
    {
        "source_sentence": "二者、分別法界不毀法性；",
        "translation": "The second is that they discriminate the realm of reality and do not disparage the essence of reality.",
        "source": "T16n0656_009:0085c24_9"
    },
    {
        "source_sentence": "三者、一意清淨無他異想；",
        "translation": "The third is that unity of mind is purified by the absence of ideation of dissimilarity.",
        "source": "T16n0656_009:0085c25_10"
    },
    {
        "source_sentence": "四者、行權方便度未度者；",
        "translation": "The fourth is that they practice expedient means to liberate those who have not yet liberated themselves.",
        "source": "T16n0656_009:0085c25_11"
    },
    {
        "source_sentence": "五者、得三十二業定意不亂。",
        "translation": "5. attaining the concentration of the thirty-two karmas without confusion in mind.",
        "source": "T16n0656_009:0085c26_12"
    },
    {
        "source_sentence": "是謂，等行菩薩摩訶薩！",
        "translation": "This is called the bodhisattva Mahāsattva of Equanimity!",
        "source": "T16n0656_009:0085c27_13"
    },
    {
        "source_sentence": "從初發意守菩薩心，修此五法不捨道意。」",
        "translation": "From the first, he arouses the intention to guard the bodhisattva's mind and cultivates these five things without abandoning the intention for the path.",
        "source": "T16n0656_009:0085c27_14"
    },
    {
        "source_sentence": "佛復告等行菩薩曰：「若有善男子、善女人初發道心，復有五事。",
        "translation": "Again, the Buddha told the bodhisattva Equanimity, Suppose there are good men and good women who first give rise to the mind of enlightenment, and there are five other things.",
        "source": "T16n0656_009:0085c28_15"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T16n0656_009:0086a01_0"
    },
    {
        "source_sentence": "一者、分別三世不離空無；",
        "translation": "The first is that they discriminate the three time periods without being separate from emptiness and nonexistence.",
        "source": "T16n0656_009:0086a01_1"
    },
    {
        "source_sentence": "二者、淨己國土育養眾生；",
        "translation": "The second is that they purify their own land and nourish sentient beings.",
        "source": "T16n0656_009:0086a01_2"
    },
    {
        "source_sentence": "三者、分別眼識不受外入；",
        "translation": "The third is that the discriminating eye consciousness does not experience external sense operations.",
        "source": "T16n0656_009:0086a02_3"
    },
    {
        "source_sentence": "四者、神足神通念則在前；",
        "translation": "The fourth is that mindfulness of the spiritual powers of supernormal abilities are pre-eminent.",
        "source": "T16n0656_009:0086a03_0"
    },
    {
        "source_sentence": "五者、現在眾智而自瓔珞。",
        "translation": "5. He presents his own jewelry of wisdom in the present.",
        "source": "T16n0656_009:0086a03_1"
    },
    {
        "source_sentence": "是謂，等行菩薩摩訶薩！",
        "translation": "This is called the bodhisattva Mahāsattva of Equanimity!",
        "source": "T16n0656_009:0086a04_2"
    },
    {
        "source_sentence": "從初發意修此五法，而得成就無有疑難，進前成佛不懷怯弱。」",
        "translation": "From the first arousal of intention to cultivate these five dharmas, there's no doubt that they'll attain their accomplishment and advance to become a buddha without being fainthearted.",
        "source": "T16n0656_009:0086a04_3"
    },
    {
        "source_sentence": "佛復告等行菩薩：「若善男子、善女人發菩薩心，當行五法而自瓔珞。",
        "translation": "Again, the Buddha told the bodhisattva of equal practice, If good men and good women give rise to the bodhisattva's mind, they should perform five ways to adorn themselves.",
        "source": "T16n0656_009:0086a06_4"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T16n0656_009:0086a07_5"
    },
    {
        "source_sentence": "於是，族姓子！",
        "translation": "Then, clansmen!",
        "source": "T16n0656_009:0086a07_6"
    },
    {
        "source_sentence": "若菩薩初發道心入等定意，能令十方天下盡為七寶；",
        "translation": "“When enlightening beings first awaken the determination for enlightenment and enter equipoise of equanimity, they can cause all worlds in the ten directions to become seven treasures.",
        "source": "T16n0656_009:0086a08_7"
    },
    {
        "source_sentence": "二者、使己國土眾生斷婬怒癡；",
        "translation": "The second is to cause sentient beings in their own land to be freed from lust, anger, and delusion.",
        "source": "T16n0656_009:0086a09_8"
    },
    {
        "source_sentence": "三者、己成佛時修三空慧；",
        "translation": "The third is that they cultivate the three kinds of wisdom of emptiness at the time of their own enlightenment.",
        "source": "T16n0656_009:0086a10_9"
    },
    {
        "source_sentence": "四者、莊嚴一相不離慧根；",
        "translation": "The fourth is that they adorn the single characteristic and are not separate from the faculty of wisdom.",
        "source": "T16n0656_009:0086a10_10"
    },
    {
        "source_sentence": "五者、行六神通不自稱記。",
        "translation": "5. He practices the six supernormal powers and doesn't call himself a recorder.",
        "source": "T16n0656_009:0086a11_11"
    },
    {
        "source_sentence": "是謂善男子、善女人從初發意行菩薩道，行此五法而自瓔珞。」",
        "translation": "This is called a good man or woman who follows the bodhisattva path from the first arousal of mind and practices these five things to adorn themselves.",
        "source": "T16n0656_009:0086a11_12"
    },
    {
        "source_sentence": "佛復告等行菩薩：「若有善男子、善女人從初發意行菩薩道，復有五法。",
        "translation": "Again, the Buddha told the bodhisattva of equal practice, If there are good men and good women who practice the bodhisattva path from the first arousal of their intentions, there are five other things.",
        "source": "T16n0656_009:0086a13_13"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T16n0656_009:0086a14_14"
    },
    {
        "source_sentence": "一者、思惟如來無形相法；",
        "translation": "The first is to contemplate the formless teaching of the enlightened.",
        "source": "T16n0656_009:0086a15_15"
    },
    {
        "source_sentence": "二者、諸佛要誓不違本性；",
        "translation": "The second is that the essential undertakings of buddhas are not contrary to their original nature.",
        "source": "T16n0656_009:0086a15_16"
    },
    {
        "source_sentence": "三者、自識本命知所從來；",
        "translation": "The third is that they know for themselves the origin of their past lives.",
        "source": "T16n0656_009:0086a16_17"
    },
    {
        "source_sentence": "四者、不計我人壽命離五苦難；",
        "translation": "The fourth is that they do not think of their own life span as self and are free from the five kinds of suffering.",
        "source": "T16n0656_009:0086a16_18"
    },
    {
        "source_sentence": "五者、法本自爾不見起滅。",
        "translation": "5. The Dharma is originally self-existent and doesn't arise or cease.",
        "source": "T16n0656_009:0086a17_19"
    },
    {
        "source_sentence": "是謂善男子、善女人修此五法而自瓔珞。」",
        "translation": "This is called a good man or woman who cultivates these five things and makes their own jewelry.",
        "source": "T16n0656_009:0086a18_20"
    },
    {
        "source_sentence": "佛復告等行菩薩：「若有善男子、善女人從初發意行菩薩道，當行五法不可思議。",
        "translation": "Again, the Buddha told the bodhisattva of equal practice, If good men and good women from the first arousal of their minds practice the bodhisattva path, they'll practice five things that are inconceivable.",
        "source": "T16n0656_009:0086a19_21"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T16n0656_009:0086a20_22"
    },
    {
        "source_sentence": "一者、諸佛神德不可思議；",
        "translation": "The first is that the spiritual virtues of buddhas are inconceivable.",
        "source": "T16n0656_009:0086a21_23"
    },
    {
        "source_sentence": "二者、諸佛篋藏不可思議；",
        "translation": "The second is that the treasury of all buddhas is inconceivable.",
        "source": "T16n0656_009:0086a21_24"
    },
    {
        "source_sentence": "三者、行果受報不可思議；",
        "translation": "The third is that the rewards of practice are inconceivable.",
        "source": "T16n0656_009:0086a22_25"
    },
    {
        "source_sentence": "四者、諸佛剎土不可思議；",
        "translation": "The fourth is that the buddha-lands are inconceivable.",
        "source": "T16n0656_009:0086a23_0"
    },
    {
        "source_sentence": "五者、演布道教不可思議。",
        "translation": "5. The teaching of expounding the path is inconceivable.",
        "source": "T16n0656_009:0086a23_1"
    },
    {
        "source_sentence": "是謂善男子、善女人初發道心，修此五行不可思議，乃至成佛而自瓔珞。」",
        "translation": "This is called the first arousal of the mind of enlightenment by good men and good women who cultivate these five practices that are inconceivable until they become buddhas and self-adorn themselves.",
        "source": "T16n0656_009:0086a24_2"
    },
    {
        "source_sentence": "「諸佛不思議，　　宣暢道亦然，",
        "translation": "The buddhas are inconceivable, And so is the path of enlightenment.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　思惟眾生本，　　本末不可覩。",
        "translation": "They contemplate the origin of sentient beings, and the origin and derivative can't be seen.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　執四聖諦炬，　　照彼無明根，",
        "translation": "They hold the torch of the four noble truths, Illumining their ignorance faculty.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　常思無有常，　　念除結縛病。",
        "translation": "Always thinking that there's no permanence, he removes the illness of bondage with mindfulness.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　劫數無有窮，　　無盡非有盡，",
        "translation": "The number of eons has no limit, Inexhaustible and not infinite.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　但為眾生惑，　　欲知本無心。",
        "translation": "They simply want to know that the afflictions of sentient beings are originally without mind.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　夫欲學在先，　　聞受深奧法，",
        "translation": "Those who want to learn first Hear and accept the profound teaching.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　亦非二乘行，　　所能用測度。",
        "translation": "Nor is it something that can be measured by the practices of the two vehicles.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　佛本自計誓，　　蠲除五道淵，",
        "translation": "The Buddha originally vowed to remove the depths of the five paths.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　行盡由等心，　　故號人中尊。",
        "translation": "He is called the best among men because his deeds are exhausted due to his equanimity.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　佛慧無邊崖，　　神智無有量，",
        "translation": "Buddha’s wisdom is boundless as a cliff, Their spiritual knowledge immeasurable.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　不以身苦本，　　永除三世難。",
        "translation": "By not relying on the body as the root of suffering, he permanently removes the difficulties of the three worlds.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　諸佛瓔珞法，　　自覺無師受，",
        "translation": "The Dharma of the jewelry of the Buddhas Is self-realized without a teacher to receive it.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　心定如虛空，　　常想樂想緣。",
        "translation": "The mind is concentrated like space, Always perceiving pleasure and happiness as objects of perception.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　吾從無數劫，　　入定不離空，",
        "translation": "For innumerable kalpas I have entered the state of absorption without leaving emptiness.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　一意成一道，　　故號人中尊。",
        "translation": "Because one thought forms a single path, he's called the most honored among men.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　復於無數劫，　　承事諸世尊，",
        "translation": "Through innumerable eons I served the World-honored Ones.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　盡生逮無著，　　自致最正覺。",
        "translation": "Unattached at the end of life, he attains supreme enlightenment on his own.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　諸佛在世化，　　正法修道樂，",
        "translation": "The buddhas teach in the world, Cultivating the right teaching and cultivating enlightenment.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "　能淨諸佛國，　　不染三有樂。」",
        "translation": "They can purify the buddha lands and not stain the happiness of the three existences.",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "爾時，世尊在於大眾，而說此偈：爾時，世尊說此偈已，復告等行菩薩：「若有善男子、善女人奉持修習五不思議深奧法者，",
        "translation": "At that time the World-honored One spoke these verses to the great assembly: Then, having uttered these verses, the World-honored One again addressed the bodhisattva Samantabhadra, saying: “If there are any sons and daughters of a virtuous family who uphold and practice the five inconceivable profound teachings,",
        "source": "T16n0656_009:0086a25_3"
    },
    {
        "source_sentence": "十方諸佛悉來擁護，不為眾魔所能得便。」",
        "translation": "All the buddhas of the ten directions will come to embrace them, and they won't be able to get an advantage over Māra.",
        "source": "T16n0656_009:0086b20_0"
    },
    {
        "source_sentence": "佛復告等行菩薩：「若善男子、善女人從初發意行菩薩心，當行五法不可思議。",
        "translation": "Again, the Buddha told the bodhisattva of equal practice, If good men and good women from the first arousal of their intentions to practice the bodhisattva's mind, they will perform five things that are inconceivable.",
        "source": "T16n0656_009:0086b20_1"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T16n0656_009:0086b22_2"
    },
    {
        "source_sentence": "一者、以己定意遍施眾生，盡在佛處而不退轉；",
        "translation": "The first is that they give to all sentient beings with their own determination, remaining always in the buddha-place without ever retreating.",
        "source": "T16n0656_009:0086b23_0"
    },
    {
        "source_sentence": "二者、不猗三道而受果證；",
        "translation": "The second is that they do not rely on the three paths but receive their fruits and realize them.",
        "source": "T16n0656_009:0086b24_1"
    },
    {
        "source_sentence": "三者、無量法海皆現在前；",
        "translation": "The third is that all the infinite oceans of principles are manifest before them.",
        "source": "T16n0656_009:0086b24_2"
    },
    {
        "source_sentence": "四者、眾相法門具足智辯；",
        "translation": "The fourth is that the doctrine of all characteristics is endowed with knowledge and eloquence.",
        "source": "T16n0656_009:0086b25_3"
    },
    {
        "source_sentence": "五者、分身教化得六度慧。",
        "translation": "The fifth is the wisdom of the six perfections that are attained by part-body teaching and transformation.",
        "source": "T16n0656_009:0086b25_4"
    },
    {
        "source_sentence": "是謂，族姓子！",
        "translation": "This is called that, clansman!",
        "source": "T16n0656_009:0086b26_5"
    },
    {
        "source_sentence": "從初發意行菩薩心，行此五法不可思議，便能具足如來眾行。」",
        "translation": "From the first arousal of the bodhisattva's mind to practice mindfulness, these five things are inconceivable, and they can then fulfill the Tathāgata's many practices.",
        "source": "T16n0656_009:0086b26_6"
    },
    {
        "source_sentence": "佛復告等行菩薩：「若有善男子、善女人，思惟分別五苦法本。",
        "translation": "Again, the Buddha told the bodhisattva of equal practice, Suppose there are good men and good women who contemplate the five kinds of painful dharmas.",
        "source": "T16n0656_009:0086b28_7"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T16n0656_009:0086b29_8"
    },
    {
        "source_sentence": "一者、分別色原不生識著；",
        "translation": "The first is that discriminating form originally does not give rise to attachment of consciousness.",
        "source": "T16n0656_009:0086b29_9"
    },
    {
        "source_sentence": "二者、思百八痛無有苦樂；",
        "translation": "The second is that they think of the one hundred and eight kinds of pain as having no pain or pleasure.",
        "source": "T16n0656_009:0086c01_10"
    },
    {
        "source_sentence": "三者、永斷眾想不興亂意；",
        "translation": "The third is that they permanently eliminate all conceptions and do not give rise to distracting thoughts.",
        "source": "T16n0656_009:0086c01_11"
    },
    {
        "source_sentence": "四者、解十二因緣本無此行；",
        "translation": "The fourth is the practice of understanding that these twelve reasons are inherently nonexistent.",
        "source": "T16n0656_009:0086c02_12"
    },
    {
        "source_sentence": "五者、識神無形不可究盡。",
        "translation": "5. The spirit of consciousness has no form and cannot be exhausted.",
        "source": "T16n0656_009:0086c03_13"
    },
    {
        "source_sentence": "是謂，等行菩薩！",
        "translation": "This is called the bodhisattva of equal practice!",
        "source": "T16n0656_009:0086c03_14"
    },
    {
        "source_sentence": "若善男子、善女人分別思惟五苦法本者，親近佛藏不離賢聖眾道之原。」",
        "translation": "If good men and good women discern and contemplate the five roots of the Dharma of suffering, they'll become intimate with the Buddha's store and won't part from the source of the path of the noble ones.",
        "source": "T16n0656_009:0086c04_15"
    },
    {
        "source_sentence": "佛告等行菩薩：「若善男子、善女人從初發意修菩薩心，復有五法不可窮盡。",
        "translation": "The Buddha told the bodhisattva of equal practice, Suppose good men and good women cultivate the bodhisattva mind from the first arousal of their intentions, and there are five other things that can't be exhausted.",
        "source": "T16n0656_009:0086c05_16"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T16n0656_009:0086c07_17"
    },
    {
        "source_sentence": "一者、無數功勳不可窮盡；",
        "translation": "The first is that their merits are countless and inexhaustible.",
        "source": "T16n0656_009:0086c07_18"
    },
    {
        "source_sentence": "二者、八十四智不可窮盡；",
        "translation": "The second is that the eighty-four kinds of knowledge are inexhaustible.",
        "source": "T16n0656_009:0086c08_19"
    },
    {
        "source_sentence": "三者、如來法慧不可窮盡；",
        "translation": "The third is that the Buddha’s knowledge of principles cannot be exhausted.",
        "source": "T16n0656_009:0086c09_0"
    },
    {
        "source_sentence": "四者、諸法要定不可窮盡；",
        "translation": "The fourth is that the essentials of all teachings are inexhaustible.",
        "source": "T16n0656_009:0086c09_1"
    },
    {
        "source_sentence": "五者、八種音響不可窮盡。",
        "translation": "5. The eight kinds of sounds are inexhaustible.",
        "source": "T16n0656_009:0086c10_2"
    },
    {
        "source_sentence": "是謂，等行菩薩！",
        "translation": "This is called the bodhisattva of equal practice!",
        "source": "T16n0656_009:0086c10_3"
    },
    {
        "source_sentence": "若善男子、善女人從初發意修菩薩心，修此五法不可窮盡，便能具足如來之法。」",
        "translation": "If good men and good women cultivate the bodhisattva mind from the first arousal of their intentions and cultivate these five dharmas inexhaustibly, they'll be able to perfect the Tathāgata's teaching.",
        "source": "T16n0656_009:0086c11_4"
    },
    {
        "source_sentence": "爾時，世尊復告等行菩薩：「若善男子、善女人從初發意修菩薩心，修行六度不可思議法。",
        "translation": "At that point, the Bhagavān again addressed the bodhisattva of equal practice, Suppose good men and good women cultivate the bodhisattva mind from the first arousal of their intentions and cultivate the inconceivable Dharma of the six perfections.",
        "source": "T16n0656_009:0086c12_5"
    },
    {
        "source_sentence": "云何為六？",
        "translation": "What are the six?",
        "source": "T16n0656_009:0086c15_0"
    },
    {
        "source_sentence": "於是，善男子、善女人不惜身命，隨前所索不逆人意，於中具足施度無極。",
        "translation": "Good men and good women then didn't spare their lives, followed the previous request without disobeying people's wishes, and gave boundlessly in abundance to save them.",
        "source": "T16n0656_009:0086c15_1"
    },
    {
        "source_sentence": "雖具施度，攝持戒人不毀戒性，見暴逆者勸令忍辱。",
        "translation": "Even though they are endowed with generosity and liberation, those who observe the precepts don't disparage the nature of the precepts, and those who see violence are encouraged to tolerate it.",
        "source": "T16n0656_009:0086c16_2"
    },
    {
        "source_sentence": "若人懈怠，勸令精進。",
        "translation": "If someone is lazy, they're encouraged to make effort.",
        "source": "T16n0656_009:0086c18_3"
    },
    {
        "source_sentence": "或有眾生著六十二見，心意錯亂不識虛無泥洹大道，攝彼眾生一意禪定，",
        "translation": "If there are sentient beings attached to the sixty-two theories, their minds and thoughts confused and not aware of the unreal path of nirvana, they embrace those sentient beings in a single mental state of meditation.",
        "source": "T16n0656_009:0086c18_4"
    },
    {
        "source_sentence": "除去亂想不生二見。",
        "translation": "He's free of distracting thoughts and doesn't give rise to two views.",
        "source": "T16n0656_009:0086c20_5"
    },
    {
        "source_sentence": "或有眾生永在闇冥懷愚癡心，以權方便攝彼眾生令見慧明。」",
        "translation": "Perhaps there are sentient beings who are always in the darkness of ignorance and harbor foolish thoughts, using expedient means to gather those sentient beings so that they'll see wisdom and insight.",
        "source": "T16n0656_009:0086c20_6"
    },
    {
        "source_sentence": "佛復告等行菩薩：「若有善男子、善女人從初發意修菩薩心，於一度中便當具足六度無極。",
        "translation": "Again, the Buddha told the bodhisattva of equal practice, Suppose there are good men and good women who cultivate the bodhisattva mind from the first arousal of their intention to cultivate it, and in a single moment they'll be fully endowed with the six perfections without limit.",
        "source": "T16n0656_009:0086c22_7"
    },
    {
        "source_sentence": "云何於一度中便能具足六度無極？",
        "translation": "How is it possible to have the six perfections without limit in one time?",
        "source": "T16n0656_009:0086c24_8"
    },
    {
        "source_sentence": "或有眾生一心持戒不毀戒性，於持戒中具足布施，不譏彼受常行忍辱。",
        "translation": "If there are sentient beings who whole-heartedly observe precepts and don't disparage the nature of precepts, they will be fully endowed with generosity in observing precepts and not criticize their constant forbearance.",
        "source": "T16n0656_009:0086c25_9"
    },
    {
        "source_sentence": "若有眾生見毀辱者，不興亂想無瞋怒心，日夜精懃無懈怠心。",
        "translation": "If there are sentient beings who see disgrace, they don't give rise to thoughts of anger or anger, and day and night their energy isn't lazy.",
        "source": "T16n0656_009:0086c26_10"
    },
    {
        "source_sentence": "雖持禁戒定意不亂，於戒性中不毀於禪，演布智慧除愚闇心，是謂菩薩在戒度無極，",
        "translation": "“Although they keep the precepts, their minds aren’t disturbed by concentration, yet in the essence of morality they don’t disparage meditation and develop wisdom to remove ignorance. This is called a bodhisattva’s boundless liberation by observing the precepts.",
        "source": "T16n0656_009:0086c28_11"
    },
    {
        "source_sentence": "便能具足六度無極。」",
        "translation": "They'll then be able to fully possess the six perfections without limit.",
        "source": "T16n0656_009:0087a01_12"
    },
    {
        "source_sentence": "佛復告等行菩薩：「若有善男子、善女人，從初發意修菩薩心，得忍度無極，",
        "translation": "Again, the Buddha told the bodhisattva Samantabhadra, Suppose there are good men and good women who cultivate the bodhisattva mind from the first arousal of their intentions and attain the limitless liberation of forbearance.",
        "source": "T16n0656_009:0087a01_13"
    },
    {
        "source_sentence": "降伏心意不念貢高，於忍度無極復當具足六度之法。",
        "translation": "They subdue their minds and intentions, don't think of them as arrogant, and attain the perfection of forbearance without extremes, which will also be replete with the six perfections.",
        "source": "T16n0656_009:0087a03_14"
    },
    {
        "source_sentence": "不捨忍心而行布施，雖有所施不起想著。",
        "translation": "They don't abandon the mind of forbearance and practice generosity, and even though they give something, they don't become conceptually attached.",
        "source": "T16n0656_009:0087a04_15"
    },
    {
        "source_sentence": "於中具足戒性之法，若人擊打不起亂想自攝心意。",
        "translation": "In this, he's fully endowed with the Dharma of the nature of morality, and if someone strikes or doesn't give rise to disturbing thoughts, they take care of their own mind and thought.",
        "source": "T16n0656_009:0087a05_16"
    },
    {
        "source_sentence": "具足修習忍度無極，具足定意不毀禪法，於忍度中具足禪行。",
        "translation": "They are endowed with cultivating tolerance and the perfection of forbearance without limit, endowed with concentration and not disparaging the teachings of meditation, and endowed with the practice of meditation in the perfection of forbearance.",
        "source": "T16n0656_009:0087a06_17"
    },
    {
        "source_sentence": "若復善男子、善女人已得忍度，分別五陰成敗所起，思惟三毒知從癡愛，",
        "translation": "“Furthermore, good men and good women who have attained forbearance discern the five aggregates that arise from formation and decay and contemplate the three poisons of ignorance and craving.",
        "source": "T16n0656_009:0087a07_18"
    },
    {
        "source_sentence": "以道慧觀察永無所生。",
        "translation": "He observes with the wisdom of the path that there's never anything to give rise to.",
        "source": "T16n0656_009:0087a09_19"
    },
    {
        "source_sentence": "是謂善男子、善女人於忍度中具足六度之法。」",
        "translation": "This is called a good man or woman who possesses the six perfections in terms of forbearance.",
        "source": "T16n0656_009:0087a10_20"
    },
    {
        "source_sentence": "佛復告等行菩薩：「若有善男子、善女人從初發意修菩薩心，於禪定中復當具足六度無極，",
        "translation": "Again, the Buddha told the bodhisattva Samantabhadra, Suppose there are good men and good women who cultivate the bodhisattva mind from the first arousal of their intention to cultivate it, and in meditation they will again perfect the six perfections without limit.",
        "source": "T16n0656_009:0087a11_21"
    },
    {
        "source_sentence": "攝取眾生除去亂想。",
        "translation": "He takes in sentient beings and removes the notion of confusion.",
        "source": "T16n0656_009:0087a13_22"
    },
    {
        "source_sentence": "云何菩薩於禪定中具足六度？",
        "translation": "How are the bodhisattvas endowed with the six perfections in meditation?",
        "source": "T16n0656_009:0087a13_23"
    },
    {
        "source_sentence": "於是善男子、善女人，觀空身相不見起滅，定心不亂而行布施，不見眾生及以財寶，",
        "translation": "Then the sons and daughters of a virtuous family observed the physical form of emptiness but did not see its arising or ceasing. They concentrated their minds without disturbance and practiced giving, yet they did not see sentient beings or property.",
        "source": "T16n0656_009:0087a14_24"
    },
    {
        "source_sentence": "亦不生心：『今我所施後獲大報，莊嚴佛土本無清淨。』",
        "translation": "Nor does it give rise to the mind that says, 'Now, what I'll give will attain great rewards later, and the Buddha land of adornment is inherently pure.'",
        "source": "T16n0656_009:0087a16_25"
    },
    {
        "source_sentence": "便能具足智度無極。」",
        "translation": "They'll then be able to perfect their knowledge and liberation without limit.",
        "source": "T16n0656_009:0087a17_26"
    },
    {
        "source_sentence": "佛復告等行菩薩：「若有善男子、善女人從初發意修菩薩心，於智度無極具足六度。",
        "translation": "Again, the Buddha told the bodhisattva of equal practice, Suppose there are good men and good women who cultivate the bodhisattva's mind from the first arousal of their intention to cultivate the six perfections in the infinity of knowledge and liberation.",
        "source": "T16n0656_009:0087a17_27"
    },
    {
        "source_sentence": "云何善男子、善女人於智度無極具足六度？",
        "translation": "How are good men and good women endowed with the six perfections in the infinity of knowledge and liberation?",
        "source": "T16n0656_009:0087a19_28"
    },
    {
        "source_sentence": "於是善男子、善女人，已能修習智度無極，分別無想無他異行，一一分別名身句身，",
        "translation": "Good men and good women, having thus cultivated the transcendence of infinite wisdom, discern without ideation or dissimilarity with respect to others, each discriminating is called body, phrase, body.",
        "source": "T16n0656_009:0087a20_29"
    },
    {
        "source_sentence": "攝意持戒不毀戒性，若人毀辱不懷憂慼，是謂於智具足戒性。",
        "translation": "Being mindful, observing precepts and not disparaging the nature of precepts, and being disrespectful and not harboring grief when someone is disgraced is called having the nature of perfect morality with respect to wisdom.",
        "source": "T16n0656_009:0087a22_30"
    },
    {
        "source_sentence": "若復善男子、善女人，於智度無極修行忍辱，心如虛空不受穢惡，是謂於智度無極得忍辱心。」",
        "translation": "If another good man or good woman cultivates patience and humility in the knowledge of liberation without limit and doesn't accept defilement like space, this is called a mind that attains patience and humility in the knowledge of liberation without limit.",
        "source": "T16n0656_009:0087a24_31"
    },
    {
        "source_sentence": "佛復告等行菩薩：「若善男子、善女人得智度無極，攝意精進去懈怠心，",
        "translation": "Again, the Buddha told the bodhisattva Samantabhadra Bodhisattva, Suppose good men and good women attain knowledge and liberation without limit, gather their mental energy into a lazy state of mind,",
        "source": "T16n0656_009:0087a26_32"
    },
    {
        "source_sentence": "分別眼界不可思議，見懈怠者勸令精進，是謂於智度無極具足精進。」",
        "translation": "Discriminating the eye realm as inconceivable and seeing those who are lazy and encouraging them to make effort is called having perfected effort that's unsurpassed in terms of wisdom and liberation.",
        "source": "T16n0656_009:0087a27_33"
    },
    {
        "source_sentence": "佛復告等行菩薩：「若有善男子、善女人得智度無極，無極禪定心不分散，",
        "translation": "Again, the Buddha told the bodhisattva Samantabhadra Bodhisattva, Suppose there are good men and good women who attain knowledge and liberation without limit and whose minds don't disperse in infinite meditation without limit.",
        "source": "T16n0656_009:0087a29_34"
    },
    {
        "source_sentence": "一意一念經百千劫攝意自伏，於三十六度皆悉分別，是謂，等行菩薩摩訶薩！",
        "translation": "This is called the bodhisattva Mahāsattva of Equanimous Actions, who subdues his own mind for a hundred thousand eons with one thought and one thought, discerning all the thirty-six perfections.",
        "source": "T16n0656_009:0087b02_0"
    },
    {
        "source_sentence": "眾行根原。」",
        "translation": "It's the root of all practices.",
        "source": "T16n0656_009:0087b03_1"
    },
    {
        "source_sentence": "爾時，世尊與等行菩薩說是語時，有無量眾生本發心趣於緣覺，今皆迴意發於無上正真之道。",
        "translation": "At the time, when the Bhagavān and the bodhisattva of equal practice spoke these words, measureless sentient beings originally aroused the intention to become pratyekabuddhas, but now they're all dedicating their minds to the unsurpassed true path.",
        "source": "T16n0656_009:0087b04_0"
    },
    {
        "source_sentence": "復有無數諸天世人，得盡信之行不離大乘。",
        "translation": "Again, there are countless gods and humans who attain the practice of perfect faith and don't part from the great vehicle.",
        "source": "T16n0656_009:0087b06_1"
    },
    {
        "source_sentence": "◎菩薩瓔珞經卷第九",
        "translation": "Bodhisattva's Yingluo jing, vol. 9",
        "source": "T16n0656_009:0087b07_2"
    }
]