[
    {
        "source_sentence": "相續解脫地波羅蜜了義經一卷",
        "translation": "One Fascicle of the Sutra on the Full Meaning of the Dhāraṇī of the Earth of Rebirth in the Pure Land of Consecutive Liberation",
        "source": "T16n0678_001:0714c15_0"
    },
    {
        "source_sentence": "宋天竺三藏求那跋陀羅譯",
        "translation": "Song Dynasty Translation of the Tripiṭaka of India, translated by Guanabhadra",
        "source": "T16n0678_001:0714c17_0"
    },
    {
        "source_sentence": "如《相續解脫經》說：觀世音菩薩白佛言：「世尊！",
        "translation": "As the Sutra of the Continued Liberation Sutra explains, Avalokitêśvara Bodhisattva said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0714c18_0"
    },
    {
        "source_sentence": "菩薩有十地，所謂歡喜地、離垢地、明地、焰地、難勝地、現前地、遠行地、不動地、善慧地、法雲地。",
        "translation": "The bodhisattva has ten stages, which are called the stage of joy, the stage of freedom from defilement, the stage of insight, the stage of blazing fire, the stage of difficulty overcoming, the stage of direct presence, the stage of distant practice, the stage of immovability, the stage of good wisdom, and the stage of the dharma-cloud.",
        "source": "T16n0678_001:0714c19_0"
    },
    {
        "source_sentence": "佛地第十一，此諸地幾種清淨攝，為有幾分？」",
        "translation": "What are the eleventh parts of the Buddha-stage, which are these stages that are included in how many kinds of purity?",
        "source": "T16n0678_001:0714c21_0"
    },
    {
        "source_sentence": "佛告觀世音菩薩：「有四種清淨十一分，攝此諸地。",
        "translation": "The Buddha told Avalokiteśvara Bodhisattva, There are four kinds of pure eleven parts that subsume these stages.",
        "source": "T16n0678_001:0714c22_0"
    },
    {
        "source_sentence": "觀世音！",
        "translation": "O Avalokiteśvara!",
        "source": "T16n0678_001:0714c23_1"
    },
    {
        "source_sentence": "悕望清淨攝初地、增上戒淨攝第二地、增上心清淨攝第三地、增上慧淨，",
        "translation": "The purity of longing includes the first stage, the purity of superior morality includes the second stage, the purity of superior mind includes the third stage, and the purity of superior wisdom.",
        "source": "T16n0678_001:0714c23_2"
    },
    {
        "source_sentence": "增上上上妙淨，攝第四地乃至佛地，是四種淨攝彼諸地。",
        "translation": "Increasing and superior marvelous purity, which includes the fourth ground... up to the Buddha grounds, are the four kinds of purity that subsume those grounds.",
        "source": "T16n0678_001:0714c25_0"
    },
    {
        "source_sentence": "「云何十一分？",
        "translation": "What are the eleven parts?",
        "source": "T16n0678_001:0714c26_1"
    },
    {
        "source_sentence": "觀世音！",
        "translation": "O Avalokiteśvara!",
        "source": "T16n0678_001:0714c26_2"
    },
    {
        "source_sentence": "解行地菩薩有十法行：善修習菩薩解脫忍，度此地已，菩薩超昇離生彼分滿足，",
        "translation": "“The enlightening beings in the stage of Understanding and Practice have ten practices:",
        "source": "T16n0678_001:0714c26_3"
    },
    {
        "source_sentence": "而未能於微細犯戒行正知住，此則分不滿足，為滿足故，方便進求到已滿足；",
        "translation": "Those who are unable to abide with correct knowledge regarding the subtle ways of violating precepts are partially dissatisfied. In order to be fulfilled, they expediently seek and attain fulfillment.",
        "source": "T16n0678_001:0714c28_4"
    },
    {
        "source_sentence": "而未能具足世俗三昧正受，及滿足聞持陀羅尼，此則分不滿足，為滿足故方便進求到已滿足；",
        "translation": "They are unable to perfect worldly samddhism, meditative attainment of right awakening and the fulfillment of the dhāraṇī of hearing and retaining. This is partially incomplete; in order to be fulfilled, they expediently seek until they have already fulfilled it.",
        "source": "T16n0678_001:0715a01_5"
    },
    {
        "source_sentence": "而未能如所得菩提分法數數修習，亦未能捨正受法愛心，此則分不滿足，",
        "translation": "They are not able to cultivate the factors of enlightenment as they have attained, nor can they give up the craving for the principles of right experience. This is partially incomplete.",
        "source": "T16n0678_001:0715a03_6"
    },
    {
        "source_sentence": "為滿足故方便進求到已滿足；",
        "translation": "In order to fulfill it, they skillfully proceed and seek until they have fulfilled it.",
        "source": "T16n0678_001:0715a05_7"
    },
    {
        "source_sentence": "而未能觀察真諦，不能捨一向背生死向涅槃意，行方便攝修菩提分法，",
        "translation": "They are unable to contemplate the true truth; they cannot give up the intention to turn completely away from birth and death toward nirvana. They practice skillful means to collect and cultivate the factors conducive to enlightenment.",
        "source": "T16n0678_001:0715a05_8"
    },
    {
        "source_sentence": "此則分不滿足，為滿足故方便進求到已滿足；",
        "translation": "This is partially incomplete. In order to be fulfilled, they expediently proceed and seek until they are fulfilled.",
        "source": "T16n0678_001:0715a07_9"
    },
    {
        "source_sentence": "而未能現前觀諸行生，多住厭離多住無相，此則分不滿足，為滿足故方便進求到已滿足；",
        "translation": "They are unable to clearly perceive the arising of conditioned states, and often abide in disgust. And often abide in signlessness. This is partially incomplete:",
        "source": "T16n0678_001:0715a08_10"
    },
    {
        "source_sentence": "而未能多住不斷無間無相思惟，此則分不滿足，為滿足故方便進求到已滿足；",
        "translation": "They cannot often abide in uninterrupted, unremitting contemplation of marklessness. This is partially incomplete; for the sake of fulfillment they skillfully proceed and seek until they are fulfilled.",
        "source": "T16n0678_001:0715a10_11"
    },
    {
        "source_sentence": "而未能捨離無相有行及得相力，此則分不滿足，為滿足故方便進求到已滿足；",
        "translation": "They are not able to abandon formless conditioned forces and attain the power of characteristics. This is partially unfulfilled:",
        "source": "T16n0678_001:0715a12_12"
    },
    {
        "source_sentence": "而未能究竟分別眾相分別諸名，一切種說法得自在，此則分不滿足，為滿足故方便進求到已滿足；",
        "translation": "They do not thoroughly discriminate characteristics and forms, discriminate names, and mastery in all kinds of explanations of doctrine.",
        "source": "T16n0678_001:0715a14_13"
    },
    {
        "source_sentence": "而未能受得滿足法身，此則分不滿足，為滿足故方便進求到已滿足；",
        "translation": "They are unable to receive and attain the fulfillment of the body of doctrine. This is partially not fulfilled; because of fulfillment, they expediently seek until they have fulfilled it.",
        "source": "T16n0678_001:0715a16_14"
    },
    {
        "source_sentence": "而未能得一切爾焰無礙無障知見，此則分不滿足，為滿足故方便進求到已滿足。",
        "translation": "They can't attain all such flames that are unobstructed, unobstructed, and unobstructed by knowing and seeing, but this part is not fulfilled, and they skillfully pursue them in order to fulfill them until they're fulfilled.",
        "source": "T16n0678_001:0715a18_15"
    },
    {
        "source_sentence": "彼分滿足故，一切分滿足。",
        "translation": "Because these parts are fulfilled, all parts are fulfilled.",
        "source": "T16n0678_001:0715a20_16"
    },
    {
        "source_sentence": "觀世音！",
        "translation": "O Avalokiteśvara!",
        "source": "T16n0678_001:0715a20_17"
    },
    {
        "source_sentence": "是名四種清淨十一種分攝一切諸地。」",
        "translation": "These are called the four kinds of pure and eleven parts that subsume all the stages.",
        "source": "T16n0678_001:0715a20_18"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0715a22_0"
    },
    {
        "source_sentence": "何故初地名歡喜地，乃至佛地名為佛地？」",
        "translation": "Why is the first ground called the joyful ground and the buddha ground called the buddha ground?",
        "source": "T16n0678_001:0715a22_1"
    },
    {
        "source_sentence": "佛告觀世音：「出昇大義，得出世間心勝妙歡喜故，初地名歡喜地。",
        "translation": "The Buddha told Avalokiteśvara, It's because the great meaning of transcendence and arousal is to transcend the worldly mind with a superior joy that the first ground is called the joyous ground.",
        "source": "T16n0678_001:0715a23_2"
    },
    {
        "source_sentence": "離一切細微犯戒故，第二地名離垢地。",
        "translation": "The second stage is called the stage of freedom from defilement because it is free from all subtle transgressions of precepts.",
        "source": "T16n0678_001:0715a24_3"
    },
    {
        "source_sentence": "彼三昧聞持依無量智光明故，第三地名明地。",
        "translation": "The third stage is called the stage of insight because that samādhi is sustained by hearing and supported by the light of immeasurable wisdom.",
        "source": "T16n0678_001:0715a25_4"
    },
    {
        "source_sentence": "以智火焰燒諸煩惱，修習菩提分法故，第四地名焰地。",
        "translation": "The fourth stage is called the stage of flame because it burns the defilements with the fire of knowledge and cultivates the factors conducive to enlightenment.",
        "source": "T16n0678_001:0715a26_5"
    },
    {
        "source_sentence": "彼方便修習諸菩提分法，艱難勤苦而得自在故，第五地名難勝地。",
        "translation": "Because they skillfully cultivate the factors of enlightenment, which are difficult and painful but attain their mastery, the fifth ground is called the stage of being unable to overcome.",
        "source": "T16n0678_001:0715a28_6"
    },
    {
        "source_sentence": "現前觀察諸行生及多相思惟故，第六地名現前地。",
        "translation": "The sixth stage is called the stage of direct perception because it directly perceives the formations that arise and reflects on many characteristics.",
        "source": "T16n0678_001:0715a29_7"
    },
    {
        "source_sentence": "不斷無間無相思惟，遠入近清淨地故，第七地名遠行地。",
        "translation": "The seventh stage is called the far-reaching stage because it does not abide in unremitting, formless contemplation and because it enters from afar into the pure stage.",
        "source": "T16n0678_001:0715b01_8"
    },
    {
        "source_sentence": "無相無開發相煩惱，不行不動故，第八地名不動地。",
        "translation": "The eighth stage is called the stage of immovability because it has no signs and no defilement that develop characteristics. Because it does not act or move, the eighth stage is called the stage of immovability.",
        "source": "T16n0678_001:0715b03_9"
    },
    {
        "source_sentence": "一切種說法自在，得無過廣大智故，第九地名善慧地。",
        "translation": "The ninth stage is called the stage of good discernment because it freely expounds all kinds of doctrine and attains unexcelled, extensive knowledge.",
        "source": "T16n0678_001:0715b04_10"
    },
    {
        "source_sentence": "如虛空等過惡，以如大雲法身周遍覆故，第十地名法雲地。",
        "translation": "Like space and so forth, the tenth ground is called the dharma-cloud ground because it's pervaded like a great cloud of dharmas that cover the Dharma body.",
        "source": "T16n0678_001:0715b05_11"
    },
    {
        "source_sentence": "細微煩惱爾焰障斷，得無礙無障爾焰一切種覺故，第十一地名佛地。」",
        "translation": "The eleventh ground is called the buddha-stage because it stops the hindrance of subtle afflictions like these and attains all kinds of awakening like unobstructed, unobstructed, and unobstructed flames like these.",
        "source": "T16n0678_001:0715b06_12"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0715b09_0"
    },
    {
        "source_sentence": "此諸地有幾種愚、幾種所治過？」",
        "translation": "How many kinds of folly and how many kinds of faults are there in these stages that are counteracted?",
        "source": "T16n0678_001:0715b09_1"
    },
    {
        "source_sentence": "佛告觀世音：「有二十二種愚，十一種所治過。",
        "translation": "The Buddha told Avalokiteśvara, There are twenty-two kinds of folly and eleven kinds of faults that are counteracted.",
        "source": "T16n0678_001:0715b10_2"
    },
    {
        "source_sentence": "初地眾生，及法計著愚、惡趣煩惱愚，彼即所治過。",
        "translation": "Sentient beings of the first stage are with delusion in relation to doctrine, as well as with delusion in relation to conceptual attachment and delusion in relation to evil destinies. These exactly are the faults to be abandoned.",
        "source": "T16n0678_001:0715b11_3"
    },
    {
        "source_sentence": "第二地微細犯戒行愚、種種業趣愚，彼即所治過。",
        "translation": "The second stage is the folly of minor transgressions in relation to moral precepts, as well as the folly of manifold paths of action. These exactly are the faults to be remedied.",
        "source": "T16n0678_001:0715b12_4"
    },
    {
        "source_sentence": "第三地欲愛愚、滿足聞持愚，彼即所治過。",
        "translation": "In the third stage, there's the folly of desire and the folly of fulfilling hearing and maintaining, which are the faults that are counteracted.",
        "source": "T16n0678_001:0715b13_5"
    },
    {
        "source_sentence": "第四地正受愛愚、及法愛愚，彼即所治過。",
        "translation": "The fourth stage is the folly of thirst for meditative attainment and the folly of thirst for doctrine. These exactly are the faults to be remedied.",
        "source": "T16n0678_001:0715b14_6"
    },
    {
        "source_sentence": "第五地一向生死向背思惟愚、一向涅槃向背思惟愚，彼即所治過。",
        "translation": "In the fifth stage, it's always the folly of contemplation facing backwards to birth and death and the folly of contemplation facing backwards to nirvāṇa, which are the faults that are counteracted.",
        "source": "T16n0678_001:0715b15_7"
    },
    {
        "source_sentence": "第六地現前觀察諸行生愚、多行相愚，彼即所治過。",
        "translation": "The sixth stage manifests the ignorance of observing conditioned formations and the ignorance of manifold characteristic marks. These exactly are the faults to be remedied.",
        "source": "T16n0678_001:0715b16_8"
    },
    {
        "source_sentence": "第七地微細相行愚、一向無相思惟方便行愚，彼即所治過。",
        "translation": "The folly of the practice of subtle characteristics in the seventh stage and the folly of the practice of skillful means that's always contemplated without characteristics, are the faults that are counteracted.",
        "source": "T16n0678_001:0715b18_0"
    },
    {
        "source_sentence": "第八地無相無開發愚、相自在愚，彼即所治過。",
        "translation": "The eighth stage is the folly of signlessness, absence of development and free from signs. These exactly are the faults to be remedied.",
        "source": "T16n0678_001:0715b19_1"
    },
    {
        "source_sentence": "第九地無量說法無量法字句上上智慧樂說總持自在愚、樂說自在愚，彼即所治過。",
        "translation": "In the ninth stage, there's the folly of being unable to teach immeasurable teachings and the folly of being unable to preach freely, which are the afflictions that are counteracted by the superior wisdom who delights in explaining the word for immeasurable teachings and the folly of being unable to preach freely.",
        "source": "T16n0678_001:0715b20_2"
    },
    {
        "source_sentence": "第十地大神通愚、入微細祕密愚，彼即所治過。",
        "translation": "The great delusion of supernormal powers in the tenth ground and the delusion of entry into subtle esoteric teachings are the faults that they counteract.",
        "source": "T16n0678_001:0715b22_3"
    },
    {
        "source_sentence": "佛地一切爾焰微細正受愚、障礙愚，彼即所治過。",
        "translation": "In the Buddha-stage, all these flames are subtle, right feeling and obstruction ignorance. These exactly are the faults to be remedied.",
        "source": "T16n0678_001:0715b23_4"
    },
    {
        "source_sentence": "觀世音！",
        "translation": "O Avalokiteśvara!",
        "source": "T16n0678_001:0715b24_5"
    },
    {
        "source_sentence": "是名二十二愚、十一種所治過。",
        "translation": "These are called the twenty-two kinds of folly and eleven kinds of faults that are counteracted.",
        "source": "T16n0678_001:0715b24_6"
    },
    {
        "source_sentence": "於彼諸地建立，不與無上菩提相應。」",
        "translation": "It's established in those stages that aren't associated with unsurpassed enlightenment.",
        "source": "T16n0678_001:0715b25_7"
    },
    {
        "source_sentence": "觀世音白佛言：「奇哉世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Marvelous, Bhagavān!",
        "source": "T16n0678_001:0715b26_8"
    },
    {
        "source_sentence": "無上菩提大利大果，彼諸菩薩破大癡網度大罪過，得無上菩提。」",
        "translation": "Unexcelled enlightenment is a great benefit and great fruit, and those bodhisattvas break through the great web of delusion and save themselves from great sins and attain unsurpassed enlightenment.",
        "source": "T16n0678_001:0715b26_9"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0715b29_0"
    },
    {
        "source_sentence": "於此諸地建立幾種殊勝？」",
        "translation": "How many kinds of distinctions are established in these stages?",
        "source": "T16n0678_001:0715b29_1"
    },
    {
        "source_sentence": "佛告觀世音：「有八事，謂悕望清淨、心清淨、悲清淨、波羅蜜清淨、見佛供養清淨、成熟眾生清淨、生清淨、力清淨。",
        "translation": "The Buddha told Avalokiteśvara, There are eight things: purity of hope, purity of mind, purity of compassion, purity of the perfections, purity of seeing the Buddha's offerings, purity of ripening sentient beings, purity of birth, and purity of strength.",
        "source": "T16n0678_001:0715c01_2"
    },
    {
        "source_sentence": "觀世音！",
        "translation": "O Avalokiteśvara!",
        "source": "T16n0678_001:0715c03_3"
    },
    {
        "source_sentence": "於初地中增悕望清淨，乃至力清淨，乃至上上地，乃至佛地增悕望清淨，",
        "translation": "In the first stage, it's purified by increasing hope and expectation in the first stage... purified by strength... up to the highest stage... purified by increasing hope and expectation in the Buddha-stage...",
        "source": "T16n0678_001:0715c03_4"
    },
    {
        "source_sentence": "乃至力清淨，當知彼是清淨，彼佛地中唯除生清淨，從初地至上上地彼功德等，",
        "translation": "It should be known that these are the clean ones. In this buddha-stage, only arising is pure: from the first stage up to the higher stages and so on, such [things] as their qualities”*!",
        "source": "T16n0678_001:0715c05_5"
    },
    {
        "source_sentence": "當知自地功德殊勝。",
        "translation": "You should know that the merit of their own ground is superior.",
        "source": "T16n0678_001:0715c07_6"
    },
    {
        "source_sentence": "一切菩薩地是有上功德，唯如來地功德無上。」",
        "translation": "All the bodhisattva stages are superior in virtue, but only the Tathāgata stage is unsurpassed in virtue.",
        "source": "T16n0678_001:0715c07_7"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0715c09_0"
    },
    {
        "source_sentence": "以何等故，菩薩於一切有生最勝？」",
        "translation": "What is the reason why a bodhisattva is the most superior among all births?",
        "source": "T16n0678_001:0715c09_1"
    },
    {
        "source_sentence": "佛告觀世音：「有四種，謂快淨善根等集故、隨智慧取故、慈悲救一切眾生故、自離染污亦令他離故。」",
        "translation": "The Buddha told Avalokiteśvara, There are four kinds, which are the arising of such good roots as joy and purity, the grasping of wisdom, the compassionate rescue of all sentient beings, self-abandoning defilement and causing others to abandon it.",
        "source": "T16n0678_001:0715c10_2"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0715c13_0"
    },
    {
        "source_sentence": "菩薩何故發妙願、勝願、名力願？」",
        "translation": "Why does a bodhisattva give rise to the marvelous vow, the superior vow, and the name-power vow?",
        "source": "T16n0678_001:0715c13_1"
    },
    {
        "source_sentence": "佛告觀世音：「有四事，彼菩薩巧住涅槃樂及堪能疾得，捨疾得及樂住，",
        "translation": "The Buddha said to the Bodhisattva Avalokiteśvara, “There are four things by which a bodhisattva skillfully abides in nirvana:",
        "source": "T16n0678_001:0715c14_2"
    },
    {
        "source_sentence": "無所因無所為，久受眾苦為眾生故發願，是故妙願勝願名力願。」",
        "translation": "Nothing is the cause, nothing is the condition, and long-受諸苦為眾生為為願發願; therefore, the wondrous vow that's superior to the vow is called the power vow.",
        "source": "T16n0678_001:0715c15_3"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0715c18_0"
    },
    {
        "source_sentence": "菩薩學有幾事？」",
        "translation": "How many things does bodhisattva training have?",
        "source": "T16n0678_001:0715c18_1"
    },
    {
        "source_sentence": "佛告觀世音：「菩薩學有六事，所謂六波羅蜜，檀波羅蜜、乃至般若波羅蜜。」",
        "translation": "The Buddha told Avalokitêśvara, There are six things that bodhisattvas learn, which are called the six perfections, the perfection of giving, and even the perfection of wisdom.",
        "source": "T16n0678_001:0715c18_2"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0715c20_3"
    },
    {
        "source_sentence": "此六學事，幾增上戒學、幾增上心學、幾增上慧學？」",
        "translation": "How many of these six things to learn are the training in superior morality, how many are the training in superior mental training, and how many are the training in superior wisdom?",
        "source": "T16n0678_001:0715c20_4"
    },
    {
        "source_sentence": "佛告觀世音：「施戒忍此三事是增上戒學，禪是增上心學，慧是增上慧學；",
        "translation": "The Buddha said to the Bodhisattva Avalokiteśvara: These three things, generosity, morality, patience, and forbearance are higher training in morality; meditation is higher training in awarenesses; wisdom is higher training in insight.",
        "source": "T16n0678_001:0715c22_5"
    },
    {
        "source_sentence": "精進通一切。」",
        "translation": "Their effort penetrates all.",
        "source": "T16n0678_001:0715c23_6"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0715c25_0"
    },
    {
        "source_sentence": "此六事，幾是福德眾具，幾是智慧眾具？」",
        "translation": "How many of these six things are the accumulation of merit and how many are the accumulation of wisdom?",
        "source": "T16n0678_001:0715c25_1"
    },
    {
        "source_sentence": "佛告觀世音：「增上戒學是福德眾具，增上慧學是智慧眾具，禪及精進通一切。」",
        "translation": "The Buddha told Avalokitêśvara, Increased training in morality is the accumulation of virtue, increased training in wisdom is the accumulation of wisdom, and meditation and effort are shared by all.",
        "source": "T16n0678_001:0715c26_2"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊，菩薩於此六學事云何學？」",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān, Bhagavān, how do bodhisattvas train in these six things of training?",
        "source": "T16n0678_001:0715c29_0"
    },
    {
        "source_sentence": "佛告觀世音：「有五種與波羅蜜相應，謂說正法菩薩藏先極信解、於彼行十法行、聞思修慧隨護菩提心、習近善知識、方便修學無間善業。」",
        "translation": "The Buddha told Avalokitêśvara, There are five kinds that are associated with the perfections, which are to say that when he teaches the bodhisattva store of the right teaching, he first has great faith and understanding, carries out the ten dharmas, guards the mind of enlightenment by hearing, contemplating, cultivating, and wisdom, becomes intimate with good teachers",
        "source": "T16n0678_001:0716a01_1"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0716a04_2"
    },
    {
        "source_sentence": "何故此諸學事六種施設？」",
        "translation": "Why are these six kinds of designations for the tasks of training established?",
        "source": "T16n0678_001:0716a04_3"
    },
    {
        "source_sentence": "佛告觀世音：「有二事，一者攝取眾生、二者對治煩惱。",
        "translation": "The Buddha told Avalokiteśvara, There are two things, one, to gather sentient beings and two, to counteract afflictions.",
        "source": "T16n0678_001:0716a05_4"
    },
    {
        "source_sentence": "彼三學攝取眾生、三學對治煩惱。",
        "translation": "Those three disciplines take in sentient beings and the three disciplines counteract afflictions.",
        "source": "T16n0678_001:0716a06_5"
    },
    {
        "source_sentence": "菩薩布施眾具，眾具饒益攝取眾生；",
        "translation": "Enlightening beings give provisions, providing provisions for the welfare and development of sentient beings.",
        "source": "T16n0678_001:0716a07_6"
    },
    {
        "source_sentence": "菩薩持戒不行惱害亦不恐迫，無畏饒益攝取眾生；",
        "translation": "Enlightening beings keep the precepts, do not harm or fright, and are not frightened; fearlessly benefiting sentient beings to take care of them.",
        "source": "T16n0678_001:0716a08_0"
    },
    {
        "source_sentence": "菩薩忍辱，於彼惱害逼迫恐怖，堪忍饒益攝取眾生；",
        "translation": "Enlightening beings’ tolerance and forbearance are able to endure harming, oppressing, and terrifying others; they can take care of sentient beings.",
        "source": "T16n0678_001:0716a09_1"
    },
    {
        "source_sentence": "以此三學攝取眾生。",
        "translation": "These three disciplines are used to gather sentient beings.",
        "source": "T16n0678_001:0716a10_2"
    },
    {
        "source_sentence": "以勤精進折伏煩惱，生斷煩惱修學善業，修學善業不為一切煩惱所動；",
        "translation": "“Great enlightening beings subdue the defilements by means of diligent effort, producing afflictions to be abandoned and cultivating good works. Cultivating good works, they are not influenced by all defilements.",
        "source": "T16n0678_001:0716a10_3"
    },
    {
        "source_sentence": "以禪伏煩惱；",
        "translation": "They subdue the afflictions by means of meditation.",
        "source": "T16n0678_001:0716a12_4"
    },
    {
        "source_sentence": "以慧斷諸使；",
        "translation": "By means of wisdom they cut off all afflictions.",
        "source": "T16n0678_001:0716a12_5"
    },
    {
        "source_sentence": "以此三學對治煩惱。」",
        "translation": "These three disciplines are used to counteract the afflictions.",
        "source": "T16n0678_001:0716a13_6"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0716a14_0"
    },
    {
        "source_sentence": "何故施設餘四波羅蜜？」",
        "translation": "Why are the other four perfections established?",
        "source": "T16n0678_001:0716a14_1"
    },
    {
        "source_sentence": "佛告觀世音：「此等是六波羅蜜伴故。",
        "translation": "The Buddha told Avalokitêśvara, These are the companions of the six perfections.",
        "source": "T16n0678_001:0716a15_0"
    },
    {
        "source_sentence": "彼三波羅蜜攝取眾生，菩薩攝事方便善業建立，是故我說方便波羅蜜是三波羅蜜伴。",
        "translation": "Because those three perfections take care of sentient beings, the bodhisattva gathers in service and skillful means to establish good actions, so I say that the perfection of skillful means is the companion of the three perfections.",
        "source": "T16n0678_001:0716a15_1"
    },
    {
        "source_sentence": "復次，觀世音！",
        "translation": "Furthermore, O Avalokiteśvara!",
        "source": "T16n0678_001:0716a17_2"
    },
    {
        "source_sentence": "菩薩現法多行煩惱，不能堪任常修習忍，貪樂下界故，悕望羸劣不能內一其心，",
        "translation": "In the present life, enlightening beings are often afflicted by defilement and unable to endure it. They always cultivate forbearance; because of their craving for the lower realms, they can’t concentrate their minds inwardly on hopelessness or weakness.",
        "source": "T16n0678_001:0716a18_3"
    },
    {
        "source_sentence": "及菩薩藏聞緣修習，不能開引出世間慧，受行少福，願未來世煩惱微薄，",
        "translation": "And the treasury of enlightening beings, hearing and apprehending by means of what they hear and cultivate, are unable to produce transmundane wisdom. They receive little merit from practice and wish that future afflictions will be weakened.",
        "source": "T16n0678_001:0716a19_4"
    },
    {
        "source_sentence": "是願波羅蜜。",
        "translation": "This is the perfection of the vow.",
        "source": "T16n0678_001:0716a21_5"
    },
    {
        "source_sentence": "煩惱薄已能勤精進，是故我說願波羅蜜是精進波羅蜜伴。",
        "translation": "Having weakened defilement, one can make energetic effort. That is why I say that the perfection of vows is the companion of the perfection of energy.",
        "source": "T16n0678_001:0716a21_6"
    },
    {
        "source_sentence": "親近善知識聽聞善法，內正思惟，轉劣悕望得力悕望，殊勝上界能內一心，",
        "translation": "They become intimate with spiritual benefactors and listen to the true Dharma. They correctly contemplate within, overcoming lowly aspirations and attaining strong aspirations. The superior ones in the higher realms are able to concentrate their minds internally.",
        "source": "T16n0678_001:0716a23_7"
    },
    {
        "source_sentence": "是故我說力波羅蜜是禪波羅蜜伴。",
        "translation": "Therefore, I say that the perfection of power is the companion of the perfection of meditation.",
        "source": "T16n0678_001:0716a24_8"
    },
    {
        "source_sentence": "於菩薩藏聞緣修禪，是智波羅蜜，堪能開引出世間慧，是故我說智波羅蜜是般若波羅蜜伴。」",
        "translation": "In the bodhisattva store, hearing and cultivating meditation conditioned by contemplation is the perfection of wisdom that's capable of engendering transmundane wisdom; therefore, I say that the perfection of wisdom is the companion of the perfection of prajñāpāramitā.",
        "source": "T16n0678_001:0716a25_9"
    },
    {
        "source_sentence": "觀世音菩薩白佛言：「世尊！",
        "translation": "Avalokitêśvara Bodhisattva said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0716a27_10"
    },
    {
        "source_sentence": "何故六波羅蜜作如是次第說？」",
        "translation": "Why are the six perfections explained in order like this?",
        "source": "T16n0678_001:0716a28_11"
    },
    {
        "source_sentence": "佛告觀世音：「彼上上招引依故。",
        "translation": "The Buddha told Avalokitêśvara, It's because the above-mentioned invites support.",
        "source": "T16n0678_001:0716a29_12"
    },
    {
        "source_sentence": "菩薩棄捨身財受持淨戒，護戒故忍，忍已精進，進已能禪，禪具足已得出世間慧。」",
        "translation": "A bodhisattva abandons his physical possessions and observes the pure precepts, guards the precepts because he tolerates them, makes effort after forbearance, can meditate after making effort, and has attained supramundane wisdom after being fully endowed with meditation.",
        "source": "T16n0678_001:0716a29_13"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0716b02_14"
    },
    {
        "source_sentence": "彼諸波羅蜜，有幾種分別？」",
        "translation": "How many kinds of distinctions are there in those perfections?",
        "source": "T16n0678_001:0716b03_15"
    },
    {
        "source_sentence": "佛告觀世音：「各有三種。",
        "translation": "The Buddha told Avalokiteśvara, There are three kinds of each.",
        "source": "T16n0678_001:0716b03_16"
    },
    {
        "source_sentence": "檀波羅蜜三種者，謂法施、財施、無畏施。",
        "translation": "The giving of the doctrine, the giving of material goods and the giving of fearlessness are threefold:",
        "source": "T16n0678_001:0716b04_17"
    },
    {
        "source_sentence": "尸波羅蜜三種者，謂轉捨不善戒、轉生善戒、轉利眾生戒。",
        "translation": "The three kinds of śīla-pāramitā are the morality of abandoning unwholesome precepts, the morality of producing wholesome precepts, and the morality of benefiting sentient beings.",
        "source": "T16n0678_001:0716b05_18"
    },
    {
        "source_sentence": "羼提波羅蜜三種者，謂不饒益忍、安苦忍、觀法忍。",
        "translation": "The three kinds of kṣatriya-pāramitā are forbearance that's not beneficial, forbearance that's peaceful and painful, and forbearance that observes the Dharma.",
        "source": "T16n0678_001:0716b06_19"
    },
    {
        "source_sentence": "毘梨耶波羅蜜三種者，謂弘誓精進、善方便精進、利眾生精進。",
        "translation": "The three kinds of the vīrya-pāramitā are diligence in making great vows, diligence in skillful means, and diligence in benefiting sentient beings.",
        "source": "T16n0678_001:0716b07_20"
    },
    {
        "source_sentence": "禪波羅蜜三種者，謂離妄想寂靜煩惱苦對治樂住禪、開引功德禪、開引利眾生禪。",
        "translation": "The perfection of trance is threefold: the trances that are free from deluded conceptual identification, quiescence, defilement and unsatisfactoriness; the trances that abide with satisfaction as antidote for the passions®”*°; the trances that enable one to develop meritorious meditative attainments; and the trances that enable one to develop meditative at",
        "source": "T16n0678_001:0716b09_21"
    },
    {
        "source_sentence": "般若波羅蜜三種者，謂世諦緣、第一義諦緣、利眾生緣。」",
        "translation": "The three kinds of prajñāpāramitā are the conditions for the conventional truth, the conditions for the ultimate truth, and the conditions for benefiting sentient beings.",
        "source": "T16n0678_001:0716b10_22"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0716b13_0"
    },
    {
        "source_sentence": "何以故，此諸波羅蜜名波羅蜜？」",
        "translation": "Why are these perfections called perfections?",
        "source": "T16n0678_001:0716b13_1"
    },
    {
        "source_sentence": "佛告觀世音：「有五種，一者無礙、二者無顧、三者無過、四者無妄想、五者迴向。",
        "translation": "The Buddha told Avalokiteśvara, There are five kinds: the first is unobstructed, the second is without concern, the third is faultless, the fourth has no deluded thoughts, and the fifth is dedication of merit.",
        "source": "T16n0678_001:0716b14_2"
    },
    {
        "source_sentence": "無礙者，謂於波羅蜜相違事不染著；",
        "translation": "Unobstructed means not being attached to things contrary to the transcendent ways.",
        "source": "T16n0678_001:0716b15_3"
    },
    {
        "source_sentence": "無顧者，謂於波羅蜜果報及現世利心不繫縛；",
        "translation": "The one who is disinterested means that his mind is not bound by the rewards of the transcendent ways or by worldly benefits.",
        "source": "T16n0678_001:0716b16_4"
    },
    {
        "source_sentence": "無過者，謂於諸波羅蜜，離雜染污無方便法；",
        "translation": "The absence of error means that in the transcendent ways one is free from defilement and lacks skillful means.",
        "source": "T16n0678_001:0716b17_5"
    },
    {
        "source_sentence": "無妄想者，謂於諸波羅蜜，不如言說計著自相；",
        "translation": "The absence of deluded ideation means that in the transcendent ways one does not verbally imagine their own distinctive characteristics.",
        "source": "T16n0678_001:0716b18_6"
    },
    {
        "source_sentence": "迴向者，謂此諸波羅蜜，已作已長養，為求無上大菩提果。」",
        "translation": "dedication refers to these perfections that have been cultivated and nurtured in order to seek the unsurpassed fruit of great bodhi.",
        "source": "T16n0678_001:0716b19_7"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0716b22_0"
    },
    {
        "source_sentence": "何等為違波羅蜜事？」",
        "translation": "What's a thing that goes against the perfection?",
        "source": "T16n0678_001:0716b22_1"
    },
    {
        "source_sentence": "佛告觀世音：「當知有六事，一者欲樂錢財，自在增上主，自見安樂功德福利；",
        "translation": "The Buddha said to the Bodhisattva Avalokiteśvara: You should know that there are six kinds of things.",
        "source": "T16n0678_001:0716b22_2"
    },
    {
        "source_sentence": "二者隨其所欲縱身口意；",
        "translation": "The second is to go along with one’s body, speech, and thought according to one’s wish.",
        "source": "T16n0678_001:0716b24_3"
    },
    {
        "source_sentence": "三者於他輕慢心不堪忍；",
        "translation": "The third is that they cannot tolerate being disrespected by others.",
        "source": "T16n0678_001:0716b25_4"
    },
    {
        "source_sentence": "四者於諸善法不勤方便；",
        "translation": "The fourth is that they do not exert effort in good deeds.",
        "source": "T16n0678_001:0716b25_5"
    },
    {
        "source_sentence": "五者習近世間雜亂眾事見聞覺識；",
        "translation": "The fifth is the perception of worldly and confused phenomena as being near to one another.",
        "source": "T16n0678_001:0716b26_6"
    },
    {
        "source_sentence": "六者世間戲論作福利見。」",
        "translation": "Sixth, the world plays around and creates views of welfare.",
        "source": "T16n0678_001:0716b27_7"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0716b27_8"
    },
    {
        "source_sentence": "此諸波羅蜜有何果報？」",
        "translation": "What are the results of these perfections?",
        "source": "T16n0678_001:0716b28_9"
    },
    {
        "source_sentence": "佛告觀世音：「彼亦有六種，一者大財、二者善趣、三者無怨、四者不壞、五者多喜樂眾生增上主、六者不害自身有大堪能。」",
        "translation": "The Buddha told Avalokiteśvara, There are also six kinds: first, great wealth; second, good destinies; third, no enemies; fourth, indestructibility; fifth, the supreme lord of sentient beings who often delight in sentient beings; and sixth, having great ability that doesn't harm themselves.",
        "source": "T16n0678_001:0716b28_10"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0716c03_0"
    },
    {
        "source_sentence": "此諸波羅蜜有何染污法雜？」",
        "translation": "What's the mixture of defiled dharmas in these perfections?",
        "source": "T16n0678_001:0716c03_1"
    },
    {
        "source_sentence": "佛告觀世音：「當知有四種，一者無悲方便、二者不正思惟方便、三者不常方便、四者不頓方便。",
        "translation": "The Buddha told Avalokiteśvara, You should know that there are four kinds: first, the method of lacking compassion; second, the method of not correctly contemplating; third, the method of not being permanent; and fourth, the method of not suddenly.",
        "source": "T16n0678_001:0716c04_2"
    },
    {
        "source_sentence": "不正思惟方便者，於此諸波羅蜜餘波羅蜜雜亂修習。」",
        "translation": "Those who don't correctly contemplate skillful means cultivate these perfections and the other perfections in a mixed way.",
        "source": "T16n0678_001:0716c06_3"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0716c08_0"
    },
    {
        "source_sentence": "云何非方便？」",
        "translation": "What's not the method?",
        "source": "T16n0678_001:0716c08_1"
    },
    {
        "source_sentence": "佛告觀世音：「於此諸波羅蜜已作長養，攝取眾生，少財饒益心則歡喜。",
        "translation": "The Buddha told Avalokiteśvara, Having cultivated these perfections, he takes care of sentient beings and rejoices when they have few possessions to give.",
        "source": "T16n0678_001:0716c08_2"
    },
    {
        "source_sentence": "不令眾生覺悟不善，安立善處，是名非方便。",
        "translation": "To prevent sentient beings from awakening to what's unwholesome and establishing a good place is called not the method.",
        "source": "T16n0678_001:0716c10_3"
    },
    {
        "source_sentence": "所以者何，此非菩薩饒益眾生。",
        "translation": "The reason for this is that it's not a bodhisattva who benefits sentient beings.",
        "source": "T16n0678_001:0716c11_4"
    },
    {
        "source_sentence": "如不淨物若多若少，無有方便能令其香。",
        "translation": "It's like an impure thing, whether numerous or few, that has no skillful means to cause its fragrance.",
        "source": "T16n0678_001:0716c12_5"
    },
    {
        "source_sentence": "如是諸行性苦眾生，非少利饒益能令安樂，第一攝取者安立善處。」",
        "translation": "Thus, the nature of these practices is painful to sentient beings, and it's not for little profit or benefit that they can make them comfortable, and the first one who takes them in establishes a good place.",
        "source": "T16n0678_001:0716c13_0"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0716c15_0"
    },
    {
        "source_sentence": "此諸波羅蜜有幾種清淨？」",
        "translation": "How many kinds of purity are these perfections?",
        "source": "T16n0678_001:0716c15_1"
    },
    {
        "source_sentence": "佛告觀世音：「我不說此諸波羅蜜離彼五種更有清淨，然我今日即於彼事總別分別。",
        "translation": "The Buddha told Avalokiteśvara, I don't say that these perfections are free of those five kinds of purity, but today I'll explain them in a general and specific way.",
        "source": "T16n0678_001:0716c16_2"
    },
    {
        "source_sentence": "總說者，一切波羅蜜清淨，當知有七種。",
        "translation": "Generally speaking, there are seven kinds of the purity of all the perfections that should be known.",
        "source": "T16n0678_001:0716c18_0"
    },
    {
        "source_sentence": "何等為七？",
        "translation": "What are these seven?",
        "source": "T16n0678_001:0716c18_1"
    },
    {
        "source_sentence": "謂菩薩於此法不求人知、於此法不執著、見於此菩提乘法不生疑惑、若是若非不自舉不下他、不高不放逸、不以少劣生知足想、不於此法起慳嫉心。",
        "translation": "It means a bodhisattva doesn't seek to know about these things, doesn't cling to them, doesn't doubt the teaching of the enlightenment vehicle when he sees this teaching, doesn't give rise to doubt whether it's right or wrong, doesn't lift himself up and don't fall into others, doesn't become neither high nor low, doesn",
        "source": "T16n0678_001:0716c19_2"
    },
    {
        "source_sentence": "今當別相說波羅蜜淨，當知七種。",
        "translation": "Now, we'll explain the purity of the perfection in terms of its distinctive characteristics, which should be known as seven kinds.",
        "source": "T16n0678_001:0716c22_3"
    },
    {
        "source_sentence": "何等為七？",
        "translation": "What are these seven?",
        "source": "T16n0678_001:0716c23_4"
    },
    {
        "source_sentence": "謂菩薩於我所說七種淨施受持修行，施物清淨清淨施，戒清淨、見清淨、心清淨、語清淨、智清淨、垢清淨清淨施，",
        "translation": "It means that the bodhisattva receives, maintains, and practices the seven kinds of pure generosity I've taught, giving things that are pure and pure, morality that are pure, views that are pure, mind that are pure, speech that are pure, knowledge that are pure, and defilement that are pure and pure.",
        "source": "T16n0678_001:0716c23_5"
    },
    {
        "source_sentence": "是七種名檀波羅蜜淨。",
        "translation": "These seven kinds are called the purity of the perfection of giving.",
        "source": "T16n0678_001:0716c26_6"
    },
    {
        "source_sentence": "謂菩薩善制一切種律儀戒、善於出罪戒、彼恒戒、堅固戒、常作戒、常轉戒、受學戒，",
        "translation": "It means that bodhisattvas well regulate all kinds of precepts for the observance of restraints, goodly extinguish blameworthy precepts, these constant precepts, steadfast precepts, always practicing precepts, always changing precepts, and receiving and training precepts.",
        "source": "T16n0678_001:0716c26_7"
    },
    {
        "source_sentence": "是七種名尸波羅蜜淨。",
        "translation": "These seven kinds are called the purity of śīla-pāramitā.",
        "source": "T16n0678_001:0716c28_8"
    },
    {
        "source_sentence": "謂菩薩自依業報，於一切不饒益事心不瞋恨，若罵若瞋若打若諍，諸不饒益悉不反報。",
        "translation": "It means that a bodhisattva relies on the results of his own actions and doesn't become angry at all unbeneficial things, whether they are verbally abused, angry, beaten, or harmed, and doesn't retaliate for any unbeneficial things.",
        "source": "T16n0678_001:0716c29_9"
    },
    {
        "source_sentence": "於諸怨憎心不懷結，若彼求悔虛受無礙，若他觸犯不望懺謝，如法哀受無畏無求，",
        "translation": "They don't harbor bonds of anger or hatred in their minds, and if they ask for repentance, they receive it without hindrance. If others touch them and violate it without wanting to repent, they are disciplined with sympathy, fearless, and not seeking it according to the teaching.",
        "source": "T16n0678_001:0717a02_10"
    },
    {
        "source_sentence": "常行饒益心不廢捨，是七種名羼提波羅蜜淨。",
        "translation": "These seven kinds are called the purity of the perfection of kṣatriya because they always practice with a mind that benefits and doesn't abandon it.",
        "source": "T16n0678_001:0717a03_11"
    },
    {
        "source_sentence": "謂菩薩善知平等精進，不以精進自舉下人，於諸善法專著、精進、堪能、堅固、不捨，",
        "translation": "It means that a bodhisattva well knows the equality of effort and doesn’t exert effort to singlemindedly lift himself up from among those who are inferior. He focuses on good qualities, strives hard, is energetic, capable, enduring, and not giving up.",
        "source": "T16n0678_001:0717a05_0"
    },
    {
        "source_sentence": "是七種名毘梨耶波羅蜜淨。",
        "translation": "These seven kinds are called the purity of the pārājika-pāramitā.",
        "source": "T16n0678_001:0717a06_1"
    },
    {
        "source_sentence": "謂菩薩善入無相三昧禪，滿足三昧禪，戒俱三昧禪，大三昧禪，無依三昧禪，",
        "translation": "It means a bodhisattva well enters the signless concentration and fulfills the meditative absorption, the precept-combined concentration, the great meditative absorption, and the non-dependent meditative absorption.",
        "source": "T16n0678_001:0717a07_2"
    },
    {
        "source_sentence": "善修治三昧禪，於菩薩藏聞緣修習無量三昧禪，是七種名禪波羅蜜淨。",
        "translation": "To skillfully cultivate samādhi meditation and cultivate measureless samādhi meditation in the bodhisattva store based on hearing and cultivating it, these seven kinds are called the purity of the perfection of meditation.",
        "source": "T16n0678_001:0717a09_3"
    },
    {
        "source_sentence": "謂菩薩建立及謗二俱捨離，中道慧出，即以彼慧解脫門義如實了知。",
        "translation": "It means that when a bodhisattva establishes and denigrates the two kinds of equanimity, the wisdom of the middle path emerges, which is to say, he accurately understands the meaning of the liberation gate of wisdom.",
        "source": "T16n0678_001:0717a10_4"
    },
    {
        "source_sentence": "空、無相、無作三脫門自性義如實了知。",
        "translation": "The meaning of the self-nature of the three liberations of emptiness, signlessness, and noncontrivance is truly known.",
        "source": "T16n0678_001:0717a12_5"
    },
    {
        "source_sentence": "若妄想、若緣起、若成，此三種自性離自性義，如實了知。",
        "translation": "Whether it's deluded conception, conditioned arising, or formation, these three kinds of self-nature and the meaning of being free of self-nature are truly known.",
        "source": "T16n0678_001:0717a13_6"
    },
    {
        "source_sentence": "若相、若因緣、若第一義，此三種離自性及世諦義如實了知。",
        "translation": "Whether it's marks, causes, conditions, or the ultimate truth, these three kinds of freedom from their own nature and the meaning of the conventional truth are truly known.",
        "source": "T16n0678_001:0717a14_7"
    },
    {
        "source_sentence": "五明處第一義諦義如實了知。",
        "translation": "The fifth clarifies the meaning of the ultimate truth as it really is known.",
        "source": "T16n0678_001:0717a15_8"
    },
    {
        "source_sentence": "多住七種如，不妄想、離虛偽，一度門起無量下地法緣觀，法次法向是七種，",
        "translation": "They often abide in seven kinds of suchness, being without deluded conceptual identification and free from hypocrisy. The contemplation on the law as supporting object of unlimited inferior stages is produced by means of one approach.",
        "source": "T16n0678_001:0717a16_9"
    },
    {
        "source_sentence": "名般若波羅蜜淨。」",
        "translation": "It's called the purity of prajñā-pāramitā.",
        "source": "T16n0678_001:0717a18_10"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717a19_0"
    },
    {
        "source_sentence": "彼五種各有何業？」",
        "translation": "What are the five kinds of actions that each have?",
        "source": "T16n0678_001:0717a19_1"
    },
    {
        "source_sentence": "佛告觀世音：「當知有五業。",
        "translation": "The Buddha told Avalokitêśvara, You should know that there are five actions.",
        "source": "T16n0678_001:0717a19_2"
    },
    {
        "source_sentence": "菩薩無閡者，現法波羅蜜常頓方便不放逸。",
        "translation": "The bodhisattva's unobstructedness is the present-dharma perfection of constant and sudden skillful means that doesn't allow for carelessness.",
        "source": "T16n0678_001:0717a20_3"
    },
    {
        "source_sentence": "無顧者，攝受未來不放逸因。",
        "translation": "Being disinterested means taking in the causes of future nonfrivolity.",
        "source": "T16n0678_001:0717a21_4"
    },
    {
        "source_sentence": "無過者，修滿淨波羅蜜。",
        "translation": "The absence of error is cultivating the perfection of purity.",
        "source": "T16n0678_001:0717a22_5"
    },
    {
        "source_sentence": "無妄想者，彼巧方便疾滿足波羅蜜。",
        "translation": "Those who don't have deluded conceptions quickly fulfill the perfection with skillful means.",
        "source": "T16n0678_001:0717a22_6"
    },
    {
        "source_sentence": "迴向者，於一切生常得善受果報無盡波羅蜜，乃至阿耨多羅三藐三菩提。」",
        "translation": "dedication refers to the inexhaustible perfection of always attaining well-acquired rewards for all sentient beings, up to unsurpassed, correct, and complete enlightenment.",
        "source": "T16n0678_001:0717a23_7"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717a26_0"
    },
    {
        "source_sentence": "此諸波羅蜜何者最勝？」",
        "translation": "Which of these perfections is the most superior?",
        "source": "T16n0678_001:0717a26_1"
    },
    {
        "source_sentence": "佛告觀世音：「謂無礙、無顧、迴向。」",
        "translation": "The Buddha told Avalokitêśvara, It means unobstructed, unconcerned, and dedication of merit.",
        "source": "T16n0678_001:0717a27_0"
    },
    {
        "source_sentence": "「何者不染污？」",
        "translation": "What's undefiled?",
        "source": "T16n0678_001:0717a27_1"
    },
    {
        "source_sentence": "「謂無過、無妄想。」",
        "translation": "It means there's no fault and no deluded perception.",
        "source": "T16n0678_001:0717a28_0"
    },
    {
        "source_sentence": "「何者熾燃？」",
        "translation": "What's blazing?",
        "source": "T16n0678_001:0717a28_1"
    },
    {
        "source_sentence": "「謂不計數。」",
        "translation": "It's called not counting.",
        "source": "T16n0678_001:0717a28_2"
    },
    {
        "source_sentence": "「何者不動？」",
        "translation": "What's immovable?",
        "source": "T16n0678_001:0717a28_3"
    },
    {
        "source_sentence": "「謂入不退法地。」",
        "translation": "It's called entering the stage of nonretrogression in terms of the Dharma.",
        "source": "T16n0678_001:0717a29_4"
    },
    {
        "source_sentence": "「何者快淨？」",
        "translation": "What's pleasant and pure?",
        "source": "T16n0678_001:0717a29_5"
    },
    {
        "source_sentence": "「謂住十地求佛地。」",
        "translation": "It means to abide in the ten stages and seek the Buddha's stage.",
        "source": "T16n0678_001:0717a29_6"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717b02_0"
    },
    {
        "source_sentence": "何故菩薩常得無盡波羅蜜受果報及無盡波羅蜜？」",
        "translation": "Why does a bodhisattva always attain the inexhaustible perfection that receives its fruit and the inexhaustible perfection?",
        "source": "T16n0678_001:0717b02_1"
    },
    {
        "source_sentence": "佛告觀世音：「展轉相依捨修習故。」",
        "translation": "The Buddha told Avalokitêśvara, It's because they cultivate mutual dependence and equanimity in turn.",
        "source": "T16n0678_001:0717b03_2"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717b05_0"
    },
    {
        "source_sentence": "何故菩薩深樂波羅蜜受果報？」",
        "translation": "Why does the bodhisattva receive the fruit of profound bliss and the perfection of wisdom?",
        "source": "T16n0678_001:0717b05_1"
    },
    {
        "source_sentence": "佛告觀世音：「菩薩有五事，一者諸波羅蜜增上喜樂真實因、二者攝取自他因、三者來世受果報因、四者離煩惱事、五者不住惡趣。」",
        "translation": "The Buddha told Avalokiteśvara, There are five things that bodhisattvas do: first, the true cause of increasing joy and happiness in the perfections; second, the cause for taking care of self and others; third, the cause for receiving rewards in future lives; fourth, the cause for being free of afflictions; and fifth, not abiding in bad destinies.",
        "source": "T16n0678_001:0717b06_2"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717b09_3"
    },
    {
        "source_sentence": "此諸波羅蜜各有何德力？」",
        "translation": "What virtue does each of these perfections have?",
        "source": "T16n0678_001:0717b09_4"
    },
    {
        "source_sentence": "佛告觀世音：「當知各有四種，一者菩薩修諸波羅蜜時，捨離慳貪犯戒懈怠亂心諸見；",
        "translation": "The Buddha said to Avalokiteśvara: You should know that there are four kinds of enlightening beings.",
        "source": "T16n0678_001:0717b10_5"
    },
    {
        "source_sentence": "二者為無上菩提真實眾具；",
        "translation": "The second is the real myriad provisions for unexcelled awakening.",
        "source": "T16n0678_001:0717b12_6"
    },
    {
        "source_sentence": "三者於現法中攝取自他；",
        "translation": "The third is to take care of oneself and others in the present life.",
        "source": "T16n0678_001:0717b12_7"
    },
    {
        "source_sentence": "四者於未來世得廣大無盡受果報。」",
        "translation": "Fourth, they'll attain vast and inexhaustible rewards in future lives.",
        "source": "T16n0678_001:0717b13_8"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717b15_0"
    },
    {
        "source_sentence": "此諸波羅蜜，何因？",
        "translation": "What are the causes of these perfections?",
        "source": "T16n0678_001:0717b15_1"
    },
    {
        "source_sentence": "何果？",
        "translation": "What is the fruit?",
        "source": "T16n0678_001:0717b15_2"
    },
    {
        "source_sentence": "何義？」",
        "translation": "What does it mean?",
        "source": "T16n0678_001:0717b16_0"
    },
    {
        "source_sentence": "佛告觀世音：「此諸波羅蜜，悲為因，受報攝眾生為果，滿足大菩提為大義。」",
        "translation": "The Buddha told Avalokiteśvara, These perfections are the cause of compassion, the result of taking in sentient beings as rewards, and the fulfillment of great enlightenment as their great meaning.",
        "source": "T16n0678_001:0717b16_1"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717b18_0"
    },
    {
        "source_sentence": "若菩薩有無盡財及有悲心者，何故世間有貧窮眾生？」",
        "translation": "If bodhisattvas have inexhaustible possessions and compassion, why are there poor sentient beings in the world?",
        "source": "T16n0678_001:0717b18_1"
    },
    {
        "source_sentence": "佛告觀世音：「此是眾生自業過耳。",
        "translation": "The Buddha told Avalokiteśvara, This is the fault of sentient beings' own actions.",
        "source": "T16n0678_001:0717b19_2"
    },
    {
        "source_sentence": "若異者他常為作，彼則應有無盡之財，世間何有貧窮眾生？",
        "translation": "If it's different, then others always do it for them, and they should have inexhaustible possessions, so why would there be poor sentient beings in the world?",
        "source": "T16n0678_001:0717b20_3"
    },
    {
        "source_sentence": "若然者，眾生作惡不應為障。",
        "translation": "If that's the case, then sentient beings who do evil shouldn't be an obstruction.",
        "source": "T16n0678_001:0717b21_4"
    },
    {
        "source_sentence": "觀世音！",
        "translation": "O Avalokiteśvara!",
        "source": "T16n0678_001:0717b22_5"
    },
    {
        "source_sentence": "譬如餓鬼為渴所逼，唯見空壑。",
        "translation": "It's like a hungry ghost that's oppressed by thirst and sees only an empty valley.",
        "source": "T16n0678_001:0717b22_6"
    },
    {
        "source_sentence": "非彼海過，但彼餓鬼自業過耳。",
        "translation": "It's not the fault of that ocean, but it's the fault of that hungry ghost's own actions.",
        "source": "T16n0678_001:0717b23_7"
    },
    {
        "source_sentence": "如彼大海無有過咎，菩薩無過亦復如是；",
        "translation": "Just as there is no fault in that great ocean, so it is with enlightening beings’ faultlessness.",
        "source": "T16n0678_001:0717b24_8"
    },
    {
        "source_sentence": "如彼餓鬼自業果報，眾生業報亦復如是。」",
        "translation": "Just as those hungry ghosts are the results of their own actions, so are the results of the actions of sentient beings.",
        "source": "T16n0678_001:0717b25_9"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717b26_0"
    },
    {
        "source_sentence": "一切諸法悉無自性，菩薩以何等波羅蜜取？」",
        "translation": "All dharmas have no self-nature, so what kind of perfection does a bodhisattva take?",
        "source": "T16n0678_001:0717b26_1"
    },
    {
        "source_sentence": "佛告觀世音：「般若波羅蜜。」",
        "translation": "The Buddha told Avalokitêśvara, Perfection of Wisdom.",
        "source": "T16n0678_001:0717b27_2"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717b28_3"
    },
    {
        "source_sentence": "般若波羅蜜取無自性者，何故不取自性？」",
        "translation": "If the prajñāpāramitā takes no self-nature, why doesn't it take its own nature?",
        "source": "T16n0678_001:0717b28_4"
    },
    {
        "source_sentence": "佛告觀世音：「我不說無自性取無自性，然無自性無字自知，彼不能離字說而說，",
        "translation": "The Buddha said to the Bodhisattva Avalokiteśvara: I do not say that grasping has no self-nature and no self-nature. However, it does not have an own-nature or a word for its own consciousness. It cannot be expressed apart from words.",
        "source": "T16n0678_001:0717b29_5"
    },
    {
        "source_sentence": "以是故，離自性取離自性。」",
        "translation": "Because of this, they're free of self-nature and grasping to be free of self-nature.",
        "source": "T16n0678_001:0717c02_6"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717c04_0"
    },
    {
        "source_sentence": "所說波羅蜜，上波羅蜜，大波羅蜜，何等為波羅蜜，何等為上波羅蜜，",
        "translation": "“World-honored One, what are the transcendent ways taught? What are the higher transcendent ways and great transcendent ways?",
        "source": "T16n0678_001:0717c04_1"
    },
    {
        "source_sentence": "何等為大波羅蜜？」",
        "translation": "What's the great perfection?",
        "source": "T16n0678_001:0717c06_0"
    },
    {
        "source_sentence": "佛告觀世音菩薩：「於無量時修習檀等善法成就，而煩惱亦行而能降伏，",
        "translation": "The Buddha told the Bodhisattva Avalokiteśvara, At infinite times they cultivate good qualities like sandalwood and accomplish them, yet their afflictions are also practiced and can be subdued.",
        "source": "T16n0678_001:0717c06_1"
    },
    {
        "source_sentence": "非彼所勝，謂解行地軟中解轉，名波羅蜜。",
        "translation": "The one who is not superior to them, i.e., liberation in the stages of understanding and volition or liberation in the midst of weakness, is referred to as a pāramitā.",
        "source": "T16n0678_001:0717c08_2"
    },
    {
        "source_sentence": "復無量時修如是等善法成就，煩惱亦行而能斷煩惱，非彼所勝，謂從初地起，",
        "translation": "When these good factors are further developed at unlimited moments, defilement also proceeds and is able to abandon defilement. It is not what is superior to them:",
        "source": "T16n0678_001:0717c09_3"
    },
    {
        "source_sentence": "名上波羅蜜。",
        "translation": "It's called the supreme perfection.",
        "source": "T16n0678_001:0717c10_4"
    },
    {
        "source_sentence": "復無量時修如是等善法成就，一切煩惱一切不行，謂第八地起，是名大波羅蜜。」",
        "translation": "Furthermore, when these kinds of good qualities are cultivated at an immeasurable number of times and accomplished, all the afflictions and non-actions don't arise, which is called the eighth ground that arises, which is called the great perfection.",
        "source": "T16n0678_001:0717c11_5"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717c13_0"
    },
    {
        "source_sentence": "此諸地幾種煩惱使？」",
        "translation": "How many kinds of afflictive tendencies are there in these stages?",
        "source": "T16n0678_001:0717c13_1"
    },
    {
        "source_sentence": "佛告觀世音：「有三種，一者害伴，謂五地。",
        "translation": "The Buddha told Avalokiteśvara, There are three kinds: first, harming companions, which are the five stages.",
        "source": "T16n0678_001:0717c13_2"
    },
    {
        "source_sentence": "觀世音！",
        "translation": "O Avalokiteśvara!",
        "source": "T16n0678_001:0717c14_3"
    },
    {
        "source_sentence": "不俱生煩惱行，俱生煩惱行伴(丹鄉本有彼)爾時無，是故名害伴。",
        "translation": "The companion of the defiled formations that do not arise simultaneously and the companion of the defiled formations that do arise simultaneously (there are these two in the Dan country) are not present at that time; therefore, they are called harmful companions.",
        "source": "T16n0678_001:0717c15_4"
    },
    {
        "source_sentence": "二者羸使，謂六地七地細微行(行音衡)修，抑止不行。",
        "translation": "The second is the contaminant of weakness, which is cultivation of subtle and subtle practices in the sixth and seventh stages (of volition and sound), suppression and non-practice.",
        "source": "T16n0678_001:0717c16_5"
    },
    {
        "source_sentence": "三者細微使，謂第八地，彼上上一切煩惱一切不行，及爾焰障依少故。」",
        "translation": "The third is the subtle messenger, which is the eighth ground, where all the afflictions above it don't arise and there are few bases for the hindrances of that kind of flame.",
        "source": "T16n0678_001:0717c17_6"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717c19_0"
    },
    {
        "source_sentence": "菩薩幾種過斷名斷彼使？」",
        "translation": "How many kinds of faults does a bodhisattva have that are called stopping those messengers?",
        "source": "T16n0678_001:0717c19_1"
    },
    {
        "source_sentence": "佛告觀世音：「有三種，初皮過斷、第二膚過斷、第三骨過斷；",
        "translation": "The Buddha said to the Bodhisattva Avalokiteśvara: There are three kinds. The first is through cutting off skin, the second through cutting off fat, and the third through cutting off bone.",
        "source": "T16n0678_001:0717c20_2"
    },
    {
        "source_sentence": "離一切使者，我說唯佛地。」",
        "translation": "Being free of all messengers, I say it's only the Buddha-stage.",
        "source": "T16n0678_001:0717c21_3"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717c22_0"
    },
    {
        "source_sentence": "菩薩幾阿僧祇劫斷彼諸過？」",
        "translation": "How many incalculably long eons did the bodhisattva stop those faults?",
        "source": "T16n0678_001:0717c22_1"
    },
    {
        "source_sentence": "佛告觀世音：「有三無量，或剎那、羅婆摩睺妬路、半時一時日夜、半月一月離兜(三（丹鄉本二）月為一節、一節名離兜)。」",
        "translation": "The Buddha told Avalokiteśvara, There are three immeasurables, which are sometimes moments, sometimes moments, sometimes moments of Rāpamātṛṣa path, sometimes a half-hour period, sometimes a day, sometimes a fortnight, sometimes a month, sometimes a month, sometimes a month, sometimes a month, sometimes a month, sometimes a month, sometimes a month, sometimes a month,",
        "source": "T16n0678_001:0717c23_2"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0717c26_0"
    },
    {
        "source_sentence": "此諸地菩薩煩惱起，有何相、何過、何德？」",
        "translation": "What are the characteristics, faults, and virtues of these bodhisattva afflictions that arise in these stages?",
        "source": "T16n0678_001:0717c26_1"
    },
    {
        "source_sentence": "佛告觀世音：「不染污相。",
        "translation": "The Buddha told Avalokitêśvara, Not defiled by characteristics.",
        "source": "T16n0678_001:0717c27_2"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T16n0678_001:0717c27_3"
    },
    {
        "source_sentence": "謂菩薩於初地入一切法界，彼知煩惱起、非不知，是故名不染污相。",
        "translation": "It means that when a bodhisattva enters all the Dharma realms in the first ground, he knows afflictions arise and doesn't not know them; therefore, it's called undefiled characteristic.",
        "source": "T16n0678_001:0717c28_4"
    },
    {
        "source_sentence": "不能令自身生苦故無過，為眾生界作離苦因，故菩薩起煩惱有無量功德。」",
        "translation": "It's not wrong because it doesn't cause suffering to arise on its own and creates the causes of freedom from suffering for sentient beings in the realm, so the bodhisattva's afflictions that arise have measureless merit.",
        "source": "T16n0678_001:0717c29_5"
    },
    {
        "source_sentence": "觀世音白佛言：「奇哉世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Marvelous, Bhagavān!",
        "source": "T16n0678_001:0718a02_6"
    },
    {
        "source_sentence": "乃至大義菩提令諸菩薩起煩惱，勝一切眾生、聲聞、緣覺善根功德，況餘功德。」",
        "translation": "Up to the point where great meaningful enlightenment causes bodhisattvas to give rise to afflictions, it's superior to the merit of the good roots of all sentient beings, śrāvakas, and pratyekbuddhas, let alone the other merits.",
        "source": "T16n0678_001:0718a03_7"
    },
    {
        "source_sentence": "觀世音白佛言：「世尊！",
        "translation": "Avalokitêśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0718a05_0"
    },
    {
        "source_sentence": "世尊所說聲聞乘及大乘即是一乘，有何義？」",
        "translation": "What does it mean to say that the śrāvaka vehicle and the great vehicle taught by the Bhagavān are one vehicle?",
        "source": "T16n0678_001:0718a05_1"
    },
    {
        "source_sentence": "佛告觀世音：「我說聲聞乘法，所謂五陰、內六入、外六入，如是等我說即是大乘、一法界、一道，",
        "translation": "The Buddha said to Avalokiteśvara, “I teach the teachings of the śrāvaka vehicle. These are called the five aggregates, the six internal and six external sense-fields, and so on. Such teachings as these I teach that they are the Mahayana, one entity of the cosmos, one doctrine, one path.",
        "source": "T16n0678_001:0718a06_2"
    },
    {
        "source_sentence": "是故我不說有種種乘。",
        "translation": "Therefore, I don't say there are various vehicles.",
        "source": "T16n0678_001:0718a08_3"
    },
    {
        "source_sentence": "而彼如所說義而起妄想，或建立、或誹謗說種種乘，彼見相違各各諍論，",
        "translation": "Instead, they give rise to deluded conceptions according to the doctrines taught, either establishing or denigrating the various vehicles of teaching. Those views are contradictory and each argues differently.",
        "source": "T16n0678_001:0718a09_4"
    },
    {
        "source_sentence": "故作是說。」",
        "translation": "That's why they say this.",
        "source": "T16n0678_001:0718a10_5"
    },
    {
        "source_sentence": "「說種種自性，　　是皆同一道，",
        "translation": "Explaining various essential natures, they are all the same path.",
        "source": "T16n0678_001:0718a10_6"
    },
    {
        "source_sentence": "　下劣上妙乘，　　無有種種異。",
        "translation": "There are no various differences between the inferior and superior subtle vehicles.",
        "source": "T16n0678_001:0718a10_6"
    },
    {
        "source_sentence": "　如說隨妄想，　　建立或誹謗，",
        "translation": "As it's said, following deluded conceptions, they establish or denigrate them.",
        "source": "T16n0678_001:0718a10_6"
    },
    {
        "source_sentence": "　彼見義相違，　　愚惑種種解。",
        "translation": "Their views are at odds with each other, and they're deluded by various understandings.",
        "source": "T16n0678_001:0718a10_6"
    },
    {
        "source_sentence": "　地攝想所治，　　勝生及願學，",
        "translation": "The stages that are included in conceptual identification and that are to be remedied are the ones of superior birth and those of vows.",
        "source": "T16n0678_001:0718a10_6"
    },
    {
        "source_sentence": "　此說大乘道，　　勤修速成佛。」",
        "translation": "This explains the great vehicle path, which diligently cultivates and quickly becomes a buddha.",
        "source": "T16n0678_001:0718a10_6"
    },
    {
        "source_sentence": "爾時世尊欲重宣此義，而說偈言：爾時觀世音菩薩白佛言：「世尊！",
        "translation": "Desiring to reiterate this meaning, the Bhagavān then spoke these verses, saying, At that point, the Bodhisattva Avalokiteśvara said to the Buddha, Bhagavān!",
        "source": "T16n0678_001:0718a10_6"
    },
    {
        "source_sentence": "《相續解脫經》中，此經何名？",
        "translation": "What's the name of this sūtra in the Sutra on the Liberation of theContinuity?",
        "source": "T16n0678_001:0718a18_7"
    },
    {
        "source_sentence": "云何奉持？」",
        "translation": "How do you consecrate it?",
        "source": "T16n0678_001:0718a19_8"
    },
    {
        "source_sentence": "佛告觀世音：「此經名『地波羅蜜了義說』，如是奉持。」",
        "translation": "The Buddha told Avalokitêśvara, This sūtra is called 'Explaining the Underlying Meaning of the Perfection of Earth' and thus it's upheld.",
        "source": "T16n0678_001:0718a19_9"
    },
    {
        "source_sentence": "說是地波羅蜜了義說時，七萬五千菩薩，得大乘光三昧。",
        "translation": "When he explained the ultimate meaning of this teaching, 75,000 bodhisattvas attained the great vehicle samādhi of illumination.",
        "source": "T16n0678_001:0718a20_10"
    }
]