[
    {
        "source_sentence": "佛說佛地經",
        "translation": "Foshuo fo di jing",
        "source": "T16n0680_001:0720b23_0"
    },
    {
        "source_sentence": "大唐三藏法師玄奘奉　詔譯",
        "translation": "Translated by imperial edict by the Tripiṭaka Master Xuanzang of the Great Tang dynasty",
        "source": "T16n0680_001:0720b25_0"
    },
    {
        "source_sentence": "如是我聞：一時薄伽梵，住最勝光曜七寶莊嚴，放大光明普照一切無邊世界。",
        "translation": "Thus I have heard: One time, the Bhagavān, abiding in the most excellent blazing adornment of the seven treasures, emanated great rays of light illuminating all boundless worlds.",
        "source": "T16n0680_001:0720b26_0"
    },
    {
        "source_sentence": "無量方所妙飾間列周圓無際，其量難測超過三界所行之處，勝出世間善根所起，",
        "translation": "The boundless arrays of adornments arranged in infinite directions are interspersed and unfathomable. Their boundlessness transcends the realms of the three worlds, being produced by transmundane roots of goodness.",
        "source": "T16n0680_001:0720b27_1"
    },
    {
        "source_sentence": "最極自在淨識為相。",
        "translation": "The supremely unimpeded pure consciousness is its characteristic.",
        "source": "T16n0680_001:0720b29_2"
    },
    {
        "source_sentence": "如來所都，諸大菩薩眾所雲集，無量天龍人非人等常所翼從，廣大法味喜樂所持。",
        "translation": "The great enlightening beings gathered together like clouds in the assembly hall of the Buddha’s capital, always accompanied by countless devas, nāgas, humans, and nonhumans. They were sustained by the delight and joy",
        "source": "T16n0680_001:0720c01_3"
    },
    {
        "source_sentence": "作諸眾生一切義利，滅諸煩惱交橫纏垢，遠離眾魔過諸莊嚴。",
        "translation": "He creates all the benefits for sentient beings, extinguishes the interlocking afflictive bonds of affliction, and becomes free of demons and faults and adornments.",
        "source": "T16n0680_001:0720c03_0"
    },
    {
        "source_sentence": "如來莊嚴之所依處，大念慧行以為遊路，大止妙觀以為所乘，大空、無相、無願解脫為所入門，",
        "translation": "The Buddha’s adornment is based on the practice of great mindfulness, wisdom, and meditation. Great tranquility and subtle contemplation are their excursions; great emptiness, signlessness, and wishless liberation are their entryways.",
        "source": "T16n0680_001:0720c04_1"
    },
    {
        "source_sentence": "無量功德眾所莊嚴，大寶花王眾所建立。",
        "translation": "It's adorned by a multitude of measureless merits and established by a multitude of great jeweled flower kings.",
        "source": "T16n0680_001:0720c06_2"
    },
    {
        "source_sentence": "大宮殿中，是薄伽梵最清淨覺，不二現行趣無相法。",
        "translation": "In the great palace, this is the most pure awakening of the Bhagavān, which doesn't practice in two ways and goes to formless dharmas.",
        "source": "T16n0680_001:0720c07_3"
    },
    {
        "source_sentence": "住於佛住，逮得一切佛平等性到無障處，不可轉法所行無礙。",
        "translation": "Abiding in the Buddha's abode, he attains the equality of all buddhas and reaches the unobstructed state, where there are no obstacles that can't be transformed by the practice of the Dharma without obstruction.",
        "source": "T16n0680_001:0720c08_4"
    },
    {
        "source_sentence": "其所成立不可思議，遊於三世平等法性，其身流布一切世界。",
        "translation": "What they establish is inconceivable, traveling to the equal Dharma nature of the three worlds, their bodies pervading all worlds.",
        "source": "T16n0680_001:0720c10_5"
    },
    {
        "source_sentence": "於一切法智無疑滯，於一切行成就大覺，於諸法智無有疑惑。",
        "translation": "He has no doubt about the cognition of all dharmas, accomplishes great awakening in all practices, and has no doubt about the cognition of dharmas.",
        "source": "T16n0680_001:0720c11_6"
    },
    {
        "source_sentence": "凡所現身不可分別，一切菩薩正所求智，得佛無二住勝彼岸不相間雜。",
        "translation": "Wherever he manifests his body, it can't be discriminated, and all bodhisattvas who correctly seek knowledge attain the Buddha's nondual abode that transcends the other shore without confusion.",
        "source": "T16n0680_001:0720c12_7"
    },
    {
        "source_sentence": "如來解脫妙智究竟證無中邊，佛地平等極於法界，盡虛空性窮未來際。",
        "translation": "The marvelous knowledge of the Tathāgata's liberation is ultimately realized without middle or extremes, and the equality of the Buddha-stage reaches as far as the Dharma realm, exhausting the nature of space to the end of the future.",
        "source": "T16n0680_001:0720c14_8"
    },
    {
        "source_sentence": "與諸無量大聲聞眾俱，一切調順皆是佛子。",
        "translation": "He's accompanied by an immeasurable number of great śrāvakas, and all those who are disciplined are all the Buddha-children.",
        "source": "T16n0680_001:0720c17_0"
    },
    {
        "source_sentence": "心善解脫、慧善解脫、戒善清淨，趣求法樂多聞聞持。",
        "translation": "Their minds are well liberated, their wisdom well liberated, and their precepts well purified, and they aspire to seek the happiness of the Dharma with much learning and hearing.",
        "source": "T16n0680_001:0720c18_0"
    },
    {
        "source_sentence": "其聞積集，善思所思、善說所說、善作所作，捷慧速慧利慧出慧，勝決擇慧大慧廣慧及無等慧慧寶成就。",
        "translation": "He hears and accumulates, well contemplates what's thought of, well explains what's taught, well does what's done, quickly attains wisdom, quickly attains wisdom, sharpens wisdom, produces wisdom, accomplishes superior discerning wisdom",
        "source": "T16n0680_001:0720c19_1"
    },
    {
        "source_sentence": "具足三明，逮得第一現法樂。",
        "translation": "They are endowed with the three insights, and they attain the first bliss of the present life.",
        "source": "T16n0680_001:0720c21_2"
    },
    {
        "source_sentence": "住大淨福田，威儀寂靜大忍柔和成就無減，已善奉行如來聖教。",
        "translation": "They abide in the great pure field of merit, their manner is tranquil and peaceful, they cultivate great tolerance and gentleness without decrease, and they well practice the noble teachings of the Tathāgata.",
        "source": "T16n0680_001:0720c22_3"
    },
    {
        "source_sentence": "復有無量菩薩摩訶薩，從諸佛土俱來集會，皆住大乘遊大乘法。",
        "translation": "Also, there are measureless bodhisattvas and mahāsattvas who come from all the buddha lands to assemble, all of whom abide in the great vehicle and travel the great vehicle teachings.",
        "source": "T16n0680_001:0720c23_4"
    },
    {
        "source_sentence": "於諸眾生其心平等，離諸分別及不分別種種分別，摧諸魔怨，遠離一切聲聞獨覺，",
        "translation": "Their minds are impartial toward all sentient beings, free of discrimination and nondiscriminating various kinds of discrimination. They subdue the enemies of Māra and become far removed from all listeners and solitary realizers.",
        "source": "T16n0680_001:0720c25_5"
    },
    {
        "source_sentence": "繫念分別，廣大法味喜樂所持。",
        "translation": "They are bound to mindfulness and discrimination, which is sustained by the vast taste, joy, and happiness of the flavor of the Dharma.",
        "source": "T16n0680_001:0720c27_0"
    },
    {
        "source_sentence": "超五怖畏，一向趣入不退轉位。",
        "translation": "He's beyond the five fears and always headed into the stage of nonretrogression.",
        "source": "T16n0680_001:0720c27_1"
    },
    {
        "source_sentence": "息諸眾生一切苦惱所逼迫地而現在前，妙生菩薩而為上首。",
        "translation": "He ceases all the pains and afflictions of sentient beings and appears before them, led by Marvelous Arising Bodhisattva.",
        "source": "T16n0680_001:0720c28_2"
    },
    {
        "source_sentence": "爾時世尊告妙生菩薩：「妙生當知，有五種法攝大覺地。",
        "translation": "It was then that the Bhagavān addressed Bodhisattva Marvelous Life, Marvelous Life, You should know that there are five ways to gather in the great stage of enlightenment.",
        "source": "T16n0680_001:0721a01_0"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T16n0680_001:0721a02_1"
    },
    {
        "source_sentence": "所謂清淨法界、大圓鏡智、平等性智、妙觀察智、成所作智。」",
        "translation": "It's called the pure Dharma realm, great perfect mirror cognition, equanimous cognition, marvelous observing cognition, and accomplished cognition.",
        "source": "T16n0680_001:0721a02_2"
    },
    {
        "source_sentence": "「妙生當知，清淨法界者，譬如虛空，雖遍諸色種種相中，而不可說有種種相，",
        "translation": "“Good son, you should know that the pure realm of reality is analogous to space, which although pervaded by various forms and various characteristics, cannot be described as having various characteristics.",
        "source": "T16n0680_001:0721a04_0"
    },
    {
        "source_sentence": "體唯一味。",
        "translation": "The essence is only one flavor.",
        "source": "T16n0680_001:0721a05_1"
    },
    {
        "source_sentence": "如是如來清淨法界，雖復遍至種種相類所知境界，而不可說有種種相，",
        "translation": "In the same way, although the Buddha’s pure realm of reality pervades all kinds of forms and knows all kinds of objects, yet it cannot be said to have various forms.",
        "source": "T16n0680_001:0721a06_0"
    },
    {
        "source_sentence": "體唯一味。",
        "translation": "The essence is only one flavor.",
        "source": "T16n0680_001:0721a07_1"
    },
    {
        "source_sentence": "「又如虛空，雖遍諸色不相捨離，而不為色過所染污。",
        "translation": "“Furthermore, just as space pervades all forms and doesn’t part from each other, it isn’t stained by the fault of form.",
        "source": "T16n0680_001:0721a08_0"
    },
    {
        "source_sentence": "如是如來清淨法界，雖遍一切眾生心性，由真實故不相捨離，而不為彼過所染污。",
        "translation": "Thus, although the pure Dharma realm of the Tathāgata pervades all sentient beings' minds and natures, they aren't separated from each other because of their reality, and they aren't stained by their faults.",
        "source": "T16n0680_001:0721a09_1"
    },
    {
        "source_sentence": "「又如虛空，含容一切身語意業，而此虛空無有起作。",
        "translation": "“Furthermore, just as space contains all bodily, verbal, and mental actions, this space has no arising or ceasing.",
        "source": "T16n0680_001:0721a12_0"
    },
    {
        "source_sentence": "如是如來清淨法界，含容一切智所變化利眾生事，清淨法界無有起作。",
        "translation": "Thus, the Tathāgata's pure Dharma realm contains all the things that are transformed by omniscience to benefit sentient beings, and the pure Dharma realm has no initiation.",
        "source": "T16n0680_001:0721a13_1"
    },
    {
        "source_sentence": "「又如空中種種色相現生現滅，而此虛空無生無滅。",
        "translation": "“Furthermore, just as the various forms and characteristics in space appear to arise and cease, but this space has neither arising nor ceasing.",
        "source": "T16n0680_001:0721a15_0"
    },
    {
        "source_sentence": "如是如來淨法界中，諸智變化利眾生事現生現滅，而淨法界無生無滅。",
        "translation": "Thus, in the pure Dharma realm of the Tathāgata's pure Dharma realm, knowledge and transformation that benefits sentient beings are present and arisen and cease, while the pure Dharma realm has neither arising nor ceasing.",
        "source": "T16n0680_001:0721a16_1"
    },
    {
        "source_sentence": "「又如空中種種色相現增現減，而此虛空無增無減。",
        "translation": "“Furthermore, just as the various forms and characteristics in space show increase and decrease, this space has neither increase nor decrease.",
        "source": "T16n0680_001:0721a18_0"
    },
    {
        "source_sentence": "如是如來淨法界中，顯示如來甘露聖教有增有減，而淨法界無增無減。",
        "translation": "Thus, the Tathāgata's pure Dharma realm shows that the Tathāgata's noble teaching of ambrosia has increase and decrease, while the pure Dharma realm has neither increase nor decrease.",
        "source": "T16n0680_001:0721a19_1"
    },
    {
        "source_sentence": "「又如空中十方色相無邊無盡，是虛空界無邊盡故，而此虛空無去無來無動無轉。",
        "translation": "“Furthermore, just as the form and characteristics of space in the ten directions are boundless and inexhaustible because the space realm is boundless and inexhaustible, so this space has no going or coming, no",
        "source": "T16n0680_001:0721a21_0"
    },
    {
        "source_sentence": "如是如來淨法界中，建立十方一切眾生利益安樂，種種作用無邊無盡，",
        "translation": "Thus the Buddha, in the pure realm of reality, establishes for the benefit and welfare of all sentient beings in the ten directions. His various activities have no bounds or limits:",
        "source": "T16n0680_001:0721a22_1"
    },
    {
        "source_sentence": "清淨法界無邊盡故，而淨法界無去無來無動無轉。",
        "translation": "Because the pure realm of reality has no limit and no end, the pure realm of reality has no going or coming, no movement or turning.",
        "source": "T16n0680_001:0721a24_2"
    },
    {
        "source_sentence": "「又如空中三千世界現壞現成，而虛空界無壞無成。",
        "translation": "Again, it's like the 3,000 worlds in space that are manifested and destroyed and formed, while the space realm is neither destroyed nor formed.",
        "source": "T16n0680_001:0721a26_0"
    },
    {
        "source_sentence": "如是如來淨法界中，現無量相成等正覺，或復示現入大涅槃，而淨法界非成等覺非入寂滅。",
        "translation": "Thus, the Tathāgata's pure Dharma realm manifests measureless forms that become perfectly enlightened, or he may also show that he enters great nirvāṇa, but the pure Dharma realm doesn't become perfectly enlightened",
        "source": "T16n0680_001:0721a27_1"
    },
    {
        "source_sentence": "「又如依空種種色相，壞爛燒燥變異可得，而虛空界非彼所變亦無勞弊。",
        "translation": "“Furthermore, just as the various forms and characteristics of emptiness that rely on decay, burn, dryness, and change can be obtained, but the space realm isn’t transformed by them, so there’s",
        "source": "T16n0680_001:0721a29_2"
    },
    {
        "source_sentence": "如是依止如來淨界眾生界內，種種學處身語意業毀犯可得，而淨法界非彼變異亦無勞弊。",
        "translation": "Thus, it's possible to rely on the Tathāgata's pure realm for sentient beings within the realm of sentient beings and various places of training who violate bodily, verbal, and mental actions that purify the Dharma realm",
        "source": "T16n0680_001:0721b01_3"
    },
    {
        "source_sentence": "「又如依空大地大山，光明水火帝釋眷屬，乃至日月種種可得，而虛空界非彼諸相。",
        "translation": "Furthermore, it's like relying on the great mountain ground of emptiness and the great mountain of light, water, fire, Indra's retinues, or even the sun and moon that are variously obtainable, but the space realm is",
        "source": "T16n0680_001:0721b04_0"
    },
    {
        "source_sentence": "如是依止如來淨界，戒蘊定蘊慧蘊解脫解脫智見諸蘊可得，而淨法界非彼諸相。",
        "translation": "Thus, based on the pure realm of the Tathāgata's pure realm, the aggregate of morality, the aggregate of concentration, the aggregate of wisdom, the aggregate of liberation, and the knowledge of liberation can",
        "source": "T16n0680_001:0721b05_1"
    },
    {
        "source_sentence": "「又如空中種種因緣展轉生起，三千大千無量世界周輪可得，而虛空界無所起作。",
        "translation": "Again, it's like when various causes and conditions arise in the sky that are produced in turn, and 3,000 great one-thousand immeasurable worlds can be circumscribed, but there's nothing to produce or create in the space realm",
        "source": "T16n0680_001:0721b08_0"
    },
    {
        "source_sentence": "如是如來淨法界中，具無量相諸佛眾會周輪可得，而淨法界無所起作。",
        "translation": "Thus, the pure Dharma realm of the Tathāgata's pure Dharma realm is endowed with measureless characteristics that can be obtained by the Buddha's congregation of buddhas and assembled around it, but the pure Dharma realm",
        "source": "T16n0680_001:0721b09_1"
    },
    {
        "source_sentence": "「復次妙生！",
        "translation": "Furthermore, Miaosheng!",
        "source": "T16n0680_001:0721b12_0"
    },
    {
        "source_sentence": "大圓鏡智者，如依圓鏡眾像影現。",
        "translation": "The great perfect mirror wisdom is like relying on a perfect mirror to show the reflection of images.",
        "source": "T16n0680_001:0721b12_1"
    },
    {
        "source_sentence": "如是依止如來智鏡，諸處境識眾像影現。",
        "translation": "Thus, relying on the mirror of the Tathāgata's wisdom, images of objects and consciousnesses in various places are reflected.",
        "source": "T16n0680_001:0721b13_0"
    },
    {
        "source_sentence": "唯以圓鏡為譬喻者，當知圓鏡、如來智鏡平等平等，是故智鏡名圓鏡智。",
        "translation": "Only those who use the perfect mirror as an analogy should know that the perfect mirror and the Tathāgata's mirror of wisdom are equal and equanimous, so the mirror of wisdom is called perfect mirror cognition.",
        "source": "T16n0680_001:0721b13_1"
    },
    {
        "source_sentence": "「如大圓鏡，有樂福人懸高勝處無所動搖，諸有去來無量眾生，於此觀察自身德失，",
        "translation": "“Suppose there is a great circular mirror in which the blessed and fortunate are suspended on a high, lofty precipice without moving anything.",
        "source": "T16n0680_001:0721b16_0"
    },
    {
        "source_sentence": "為欲存德捨諸失故。",
        "translation": "It's because they want to preserve virtue and abandon the faults.",
        "source": "T16n0680_001:0721b17_1"
    },
    {
        "source_sentence": "如是如來懸圓鏡智處淨法界，無間斷故無所動搖，欲令無量無數眾生觀於染淨，",
        "translation": "Thus the Buddha hangs over the sphere of perfect mirror knowledge to purify the realm of reality, which is uninterrupted and unmoving. He wishes to cause countless sentient beings to contemplate impurity and purity.",
        "source": "T16n0680_001:0721b18_2"
    },
    {
        "source_sentence": "為欲取淨捨諸染故。",
        "translation": "It's because they want to grasp the pure and abandon the defilements.",
        "source": "T16n0680_001:0721b20_3"
    },
    {
        "source_sentence": "「又如圓鏡極善磨瑩，鑒淨無垢光明遍照。",
        "translation": "Again, it's like a perfect mirror that's extremely well polished and shining, which reflects pure, undefiled light everywhere.",
        "source": "T16n0680_001:0721b21_0"
    },
    {
        "source_sentence": "如是如來大圓鏡智，於佛智上，一切煩惱、所知障垢永出離故極善磨瑩，",
        "translation": "Thus, the great perfect mirror knowledge of the Buddha is extremely refined because on top of the Buddha’s knowledge all afflictions and the defilement of the obstacle to that which needs to be known are forever removed.",
        "source": "T16n0680_001:0721b21_1"
    },
    {
        "source_sentence": "為依止定所攝持故鑒淨無垢，作諸眾生利樂事故光明遍照。",
        "translation": "Because it's supported by the concentration that's collected and maintained, it's pure and undefiled, and it creates a light that universally illuminates the benefits and pleasures of sentient beings.",
        "source": "T16n0680_001:0721b23_2"
    },
    {
        "source_sentence": "「又如圓鏡依緣本質，種種影像相貌生起。",
        "translation": "Again, it's like a perfect mirror that relies on the original essence of conditions to produce various images and appearances.",
        "source": "T16n0680_001:0721b26_0"
    },
    {
        "source_sentence": "如是如來大圓鏡智，於一切時依諸緣故，種種智影相貌生起。",
        "translation": "Thus, the Tathāgata's great perfect mirror wisdom that relies on conditions at all times gives rise to various forms and shadows of wisdom.",
        "source": "T16n0680_001:0721b26_1"
    },
    {
        "source_sentence": "「如圓鏡上非一眾多諸影像起，而圓鏡上無諸影像，而此圓鏡無動無作。",
        "translation": "“Suppose a perfect mirror doesn’t produce many images that are not one and the same, but there are no images in a perfect mirror, and this perfect mirror is motionless and unmanifest.",
        "source": "T16n0680_001:0721b29_0"
    },
    {
        "source_sentence": "如是如來圓鏡智上，非一眾多諸智影起，圓鏡智上無諸智影，而此智鏡無動無作。",
        "translation": "Thus, the Tathāgata's perfect mirror wisdom doesn't arise from one or many shadows of cognition, and there are no shadows of cognition above perfect mirror wisdom, but this mirror of cognition is unmoving and unmanifest.",
        "source": "T16n0680_001:0721c01_1"
    },
    {
        "source_sentence": "「又如圓鏡與眾影像非合非離，不聚集故，現彼緣故。",
        "translation": "“Furthermore, just as a perfect mirror is neither united with nor separated from all images: because it does not gather together and because it manifests these conditions.",
        "source": "T16n0680_001:0721c04_0"
    },
    {
        "source_sentence": "如是如來大圓鏡智，與眾智影非合非離，不聚集故，不散失故。",
        "translation": "Thus, the great perfect mirror wisdom of the Tathāgata is neither combined nor separate from the shadow of all wisdoms because it doesn't gather and doesn't disperse.",
        "source": "T16n0680_001:0721c05_1"
    },
    {
        "source_sentence": "「又如圓鏡周瑩其面，於一切處為諸影像遍起依緣。",
        "translation": "“Furthermore, it’s as if a round mirror were to shine all over one’s face and that images everywhere would be the supporting condition for them.",
        "source": "T16n0680_001:0721c07_0"
    },
    {
        "source_sentence": "如是如來大圓鏡智，不斷無量眾行善瑩，為諸智影遍起依緣，謂聲聞乘諸智影像、獨一覺乘諸智影像、無上大乘諸智影像，",
        "translation": "In this way, the great perfect mirror knowledge of Buddha does not cut off the infinite variety of practices and goodly illumines them. It is the pervasive supporting condition that produces the images of knowledge for the sake of understanding:",
        "source": "T16n0680_001:0721c08_1"
    },
    {
        "source_sentence": "為欲令諸聲聞乘人依聲聞乘而出離故，獨一覺人依獨覺乘而出離故，大乘之人依無上乘而出離故。",
        "translation": "It's because they want to cause people of the śrāvaka vehicle to rely on the śrāvaka vehicle and escape, those of the solitary realizer vehicle to rely on the solitary realizer vehicle and those of the great vehicle to rely on",
        "source": "T16n0680_001:0721c11_0"
    },
    {
        "source_sentence": "「如圓鏡中大影可得，所謂大地大山大樹大宮舍影，而是圓鏡不等彼量。",
        "translation": "“Suppose a large shadow in a perfect mirror can be obtained, which is called the shadow of a great earth, a great mountain, a great tree, or a great palace, but a perfect mirror isn’t equal to that.",
        "source": "T16n0680_001:0721c14_0"
    },
    {
        "source_sentence": "如是如來圓鏡智上，從極喜地乃至佛地智影可得，及與一切世出世法智影可得，",
        "translation": "Thus, the Buddha’s perfect mirror knowledge can be acquired from the stage of ultimate bliss up to the buddha-stage. As well as all worldly and transcendental knowledge that is accompanied by it:",
        "source": "T16n0680_001:0721c15_1"
    },
    {
        "source_sentence": "而圓鏡智非彼分量。",
        "translation": "But perfect mirror cognition isn't measured by that.",
        "source": "T16n0680_001:0721c17_2"
    },
    {
        "source_sentence": "「又如圓鏡，非處障質影像起緣。",
        "translation": "Again, it's like a perfect mirror that doesn't have an image that gives rise to perceptual conditions because it's not the place where the obstructive substance of images arises.",
        "source": "T16n0680_001:0721c18_0"
    },
    {
        "source_sentence": "如是如來大圓鏡智，非惡友攝聞不正法障礙眾生智影起緣，彼非器故。",
        "translation": "Thus, the great perfect mirror wisdom of the Tathāgata is not a bad friend who collects and listens to unwholesome dharmas that obstruct sentient beings' knowledge and creates conditions because they aren't vessels.",
        "source": "T16n0680_001:0721c18_1"
    },
    {
        "source_sentence": "「又如圓鏡，非處闇質影像起緣。",
        "translation": "Again, it's like a perfect mirror that doesn't have dark images that give rise to perceptual objects.",
        "source": "T16n0680_001:0721c21_0"
    },
    {
        "source_sentence": "如是如來大圓鏡智，非處樂惡愚暗眾生智影起緣，彼非器故。",
        "translation": "Thus, the great perfect mirror wisdom of the Tathāgata doesn't arise from the shadow of knowledge of sentient beings who are happy with bad and foolish people in the darkness, because they aren't vessels.",
        "source": "T16n0680_001:0721c21_1"
    },
    {
        "source_sentence": "「又如圓鏡，非處遠質影像起緣。",
        "translation": "Again, it's like a perfect mirror that doesn't have a place where distant images of qualities give rise to perceptual conditions.",
        "source": "T16n0680_001:0721c24_0"
    },
    {
        "source_sentence": "如是如來大圓鏡智，非處不淨感匱法業不信眾生智影起緣，彼非器故。",
        "translation": "Thus, the great perfect mirror wisdom of the Tathāgata is not a place where impurity causes deficiencies in Dharma karma and doesn't believe that the shadow of sentient beings' wisdom gives rise to conditions because they aren't vessels.",
        "source": "T16n0680_001:0721c24_1"
    },
    {
        "source_sentence": "「復次妙生！",
        "translation": "Furthermore, Miaosheng!",
        "source": "T16n0680_001:0721c27_0"
    },
    {
        "source_sentence": "平等性智者，由十種相圓滿成就。",
        "translation": "The knowledge of equality is perfected by means of ten kinds of characteristics:",
        "source": "T16n0680_001:0721c27_1"
    },
    {
        "source_sentence": "證得諸相增上喜愛，平等法性圓滿成故；",
        "translation": "They realize the supreme love for characteristics, because they are perfected by the equality of all dharmas.",
        "source": "T16n0680_001:0721c28_0"
    },
    {
        "source_sentence": "證得一切領受緣起，平等法性圓滿成故；",
        "translation": "They attain the acquisition of all feelings as conditioned arising, because they are perfected by the equality of reality-nature.",
        "source": "T16n0680_001:0721c28_1"
    },
    {
        "source_sentence": "證得遠離異相非相，平等法性圓滿成故；",
        "translation": "They realize that they are far removed from dissimilar characteristics and non-characteristics, because the equality of all things is perfected.",
        "source": "T16n0680_001:0721c29_2"
    },
    {
        "source_sentence": "弘濟大慈，平等法性圓滿成故；",
        "translation": "Great compassionate greatly relieving, because it is perfected by the equality of all things as nature.",
        "source": "T16n0680_001:0722a01_3"
    },
    {
        "source_sentence": "無待大悲，平等法性圓滿成故；",
        "translation": "They do not await great compassion, because their equality in reality is perfected by the fulfillment of all qualities.",
        "source": "T16n0680_001:0722a02_4"
    },
    {
        "source_sentence": "隨諸眾生所樂示現，平等法性圓滿成故；",
        "translation": "They are manifested according to the pleasures of sentient beings, because their equality in all things is perfected by the nature of reality.",
        "source": "T16n0680_001:0722a03_5"
    },
    {
        "source_sentence": "一切眾生敬受所說，平等法性圓滿成故；",
        "translation": "All sentient beings respectfully receive what is taught, because the equality of all things as dharmas is perfected.",
        "source": "T16n0680_001:0722a04_6"
    },
    {
        "source_sentence": "世間寂靜皆同一味，平等法性圓滿成故；",
        "translation": "The worldly quiescence and tranquility all have one and the same taste, because they are perfected by the equal nature of reality.",
        "source": "T16n0680_001:0722a05_7"
    },
    {
        "source_sentence": "世間諸法苦樂一味，平等法性圓滿成故；",
        "translation": "The dharmas of the world are of one and the same taste of pain and pleasure, because they are perfected by the equality of all dharmas.",
        "source": "T16n0680_001:0722a06_8"
    },
    {
        "source_sentence": "修殖無量功德究竟，平等法性圓滿成故。",
        "translation": "Cultivating measureless merit is the ultimate, because it's the perfect completion of the equal Dharma nature.",
        "source": "T16n0680_001:0722a07_0"
    },
    {
        "source_sentence": "「復次妙生！",
        "translation": "Furthermore, Miaosheng!",
        "source": "T16n0680_001:0722a08_0"
    },
    {
        "source_sentence": "妙觀察智者，譬如世界持眾生界，如是如來妙觀察智，任持一切陀羅尼門、三摩地門，",
        "translation": "The knowledge of subtle observation is analogous to the world maintaining sentient beings’ realms. In this way, the knowledge of the Tathagata’s subtle observation freely holds all dhāraṇī-gates and samādhi-gates",
        "source": "T16n0680_001:0722a08_1"
    },
    {
        "source_sentence": "無礙辯說諸佛妙法。",
        "translation": "He explains the marvelous teachings of the buddhas with unhindered eloquence.",
        "source": "T16n0680_001:0722a10_2"
    },
    {
        "source_sentence": "「又如世界是諸眾生，頓起一切種種無量相識因緣。",
        "translation": "“Furthermore, just as worlds are the causes and conditions for sentient beings to suddenly give rise to all kinds of immeasurable consciousnesses that have various forms.",
        "source": "T16n0680_001:0722a11_0"
    },
    {
        "source_sentence": "如是如來妙觀察智，能為頓起一切所知無礙妙智種種無量相識因緣。」",
        "translation": "Thus, the Tathāgata's marvelous observing cognition can suddenly give rise to all the causes and conditions of unobstructed marvelous cognition of all knowables and various kinds of immeasurable consciousnesses.",
        "source": "T16n0680_001:0722a12_1"
    },
    {
        "source_sentence": "「又如世界種種可玩，園林池等之所莊嚴，甚可愛樂。",
        "translation": "“Furthermore, suppose there are various worlds to play in, and the gardens, forests, ponds, and other adornments are very desirable.",
        "source": "T16n0680_001:0722a14_0"
    },
    {
        "source_sentence": "如是如來妙觀察智，種種可玩波羅蜜多、菩提分法、十力、無畏、不共佛法之所莊嚴，",
        "translation": "Thus, the knowledge of the Buddha’s subtle observation is adorned by various toysable perfections, factors of enlightenment, the ten powers, fearlessnesses, and unique qualities of buddhahood.",
        "source": "T16n0680_001:0722a15_1"
    },
    {
        "source_sentence": "甚可愛樂。",
        "translation": "It's very pleasing.",
        "source": "T16n0680_001:0722a17_2"
    },
    {
        "source_sentence": "「又如世界，洲渚、日月、四天王天、三十三天及夜摩天、覩史多天、樂變化天、他化自在、梵身天等，",
        "translation": "“Furthermore, it is like the worlds of continents, moons, suns and moons, the four guardian gods of heaven, the Trāyastriṃśa gods, the gods of the thirty-three",
        "source": "T16n0680_001:0722a17_3"
    },
    {
        "source_sentence": "妙飾間列。",
        "translation": "The marvelous decorations are arrayed in between.",
        "source": "T16n0680_001:0722a19_4"
    },
    {
        "source_sentence": "如是如來妙觀察智，世及出世衰盛因果，聲聞、獨覺、菩薩圓證，無餘觀察妙飾間列。",
        "translation": "Thus, the Tathāgata's marvelous observing knowledge of worldly and transmundane declining causes and effects, which are completely realized by śrāvakas, pratyekbuddhas, and bodhisattvas, is surrounded by a",
        "source": "T16n0680_001:0722a19_5"
    },
    {
        "source_sentence": "「又如世界為諸眾生廣大受用。",
        "translation": "“Furthermore, it’s like the world that receives and uses vast benefits for sentient beings.",
        "source": "T16n0680_001:0722a22_0"
    },
    {
        "source_sentence": "如是如來妙觀察智，示現一切諸佛眾會雨大法雨，為令眾生受大法樂。",
        "translation": "Thus, the Tathāgata's marvelous observing wisdom shows that all the buddhas gather together to rain down great Dharma rain in order to cause sentient beings to experience great Dharma bliss.",
        "source": "T16n0680_001:0722a22_1"
    },
    {
        "source_sentence": "「如世界中五趣可得，所謂地獄、餓鬼、畜生、人趣、天趣。",
        "translation": "“Suppose there are five destinies in the world that can be obtained, which are called hells, hungry ghosts, animals, humans, and heavenly destinies.",
        "source": "T16n0680_001:0722a25_0"
    },
    {
        "source_sentence": "如是如來觀察智上，無邊因果五趣差別具足顯現。",
        "translation": "Thus, the Tathāgata observes that above cognition, limitless causes and effects of the five destinies are fully revealed in terms of their distinctions.",
        "source": "T16n0680_001:0722a26_1"
    },
    {
        "source_sentence": "「如世界中欲、色、無色諸界可得。",
        "translation": "“Suppose there are worlds in which the desire, form, and formless realms are obtainable.",
        "source": "T16n0680_001:0722a28_0"
    },
    {
        "source_sentence": "如是如來觀察智上，無邊因果三界差別具足顯現。",
        "translation": "Thus, the Tathāgata observes that above cognition, limitless causes and effects of the three realms are fully revealed in terms of their distinctions.",
        "source": "T16n0680_001:0722a28_1"
    },
    {
        "source_sentence": "「如世界中蘇迷盧等大寶山王顯現可得。",
        "translation": "It's like the great jeweled mountain kings of Sumeru and so forth in the world that appear to be obtainable.",
        "source": "T16n0680_001:0722b01_0"
    },
    {
        "source_sentence": "如是如來觀察智上，諸佛菩薩威神所引，廣大甚深教法可得。",
        "translation": "Thus, the Tathāgata observes that above wisdom, which is led by the buddhas and bodhisattvas with authoritative power, there's a vast, profound teaching that can be obtained.",
        "source": "T16n0680_001:0722b01_1"
    },
    {
        "source_sentence": "「如世界中廣大甚深不可傾動大海可得。",
        "translation": "“Suppose the world is vast and so deep that it can’t be tilted, and the great ocean is attainable.",
        "source": "T16n0680_001:0722b04_0"
    },
    {
        "source_sentence": "如是如來觀察智上，一切天魔外道異論所不傾動，甚深法界教法可得。",
        "translation": "Thus, the Tathāgata observes that wisdom is superior to all gods, Māra, and non-Buddhists who aren't influenced by differences in their theories, and it's possible to attain the profound teaching of the Dharma real",
        "source": "T16n0680_001:0722b04_1"
    },
    {
        "source_sentence": "「又如世界大小輪山之所圍繞。",
        "translation": "Again, it's like the world that's surrounded by large and small circular mountains.",
        "source": "T16n0680_001:0722b07_0"
    },
    {
        "source_sentence": "如是如來妙觀察智，不愚一切自相共相之所圍繞。",
        "translation": "Thus, the Tathāgata's marvelous observing wisdom isn't fooled by all their own distinctive and shared characteristics that surround them.",
        "source": "T16n0680_001:0722b07_1"
    },
    {
        "source_sentence": "「復次妙生！",
        "translation": "Furthermore, Miaosheng!",
        "source": "T16n0680_001:0722b09_0"
    },
    {
        "source_sentence": "成所作智者，如諸眾生勤勵身業，由是眾生趣求種種，殉利務農勤工等事。",
        "translation": "The accomplishment of the knowledge of what's done is like sentient beings who diligently exert physical actions, and because of this, sentient beings pursue various destinies and seek different kinds of things, such as sacrificial duties, farming,",
        "source": "T16n0680_001:0722b09_1"
    },
    {
        "source_sentence": "如是如來成所作智勤身化業，由是如來示現種種工巧等處，摧伏諸伎傲慢眾生，",
        "translation": "In this way the enlightening being manifests various forms of skill in all kinds of arts and crafts, overcoming the arrogance of those who are arrogant.",
        "source": "T16n0680_001:0722b10_2"
    },
    {
        "source_sentence": "以是善巧方便力故，引諸眾生令入聖教成熟解脫。",
        "translation": "Because of the power of skillful means, they lead sentient beings into the noble teaching and mature their liberation.",
        "source": "T16n0680_001:0722b12_3"
    },
    {
        "source_sentence": "「又如眾生受用身業，由是眾生受用種種色等境界。",
        "translation": "“Furthermore, just as sentient beings experience bodily actions, so do sentient beings experience various forms and other objects.",
        "source": "T16n0680_001:0722b14_0"
    },
    {
        "source_sentence": "如是如來成所作智受身化業，由是如來往諸眾生種種生處，示同類生而居尊位。",
        "translation": "Thus, the Tathāgata accomplishes the knowledge of what's done, receives bodily transformation actions, and thus the Tathāgata goes to various places where sentient beings are born, shows them similar births, and lives in a venerable position.",
        "source": "T16n0680_001:0722b15_1"
    },
    {
        "source_sentence": "由其示現同類生故，攝伏一切異類眾生，以是善巧方便力故，引諸眾生令入聖教成熟解脫。",
        "translation": "Because they manifest similar kinds of birth, they subdue all different kinds of sentient beings, and because of the power of skillful means, they lead sentient beings into the noble teaching to ripen liberation.",
        "source": "T16n0680_001:0722b17_2"
    },
    {
        "source_sentence": "「又如眾生領受身業，由是眾生領受所作善惡業果。",
        "translation": "“Furthermore, just as sentient beings experience bodily actions, so do sentient beings experience the results of good and bad actions that they perform.",
        "source": "T16n0680_001:0722b20_0"
    },
    {
        "source_sentence": "如是如來成所作智領身化業，由是如來示現領受本事本生難修諸行，以是善巧方便力故，",
        "translation": "In the same way, the knowledge of accomplishing one’s deeds is what enables a buddha to manifest his magical creations. This is how the buddhas show that they are able to undertake these practices which are difficult to carry out in their present",
        "source": "T16n0680_001:0722b21_1"
    },
    {
        "source_sentence": "引諸眾生令入聖教成熟解脫。」",
        "translation": "He guides sentient beings into the noble teaching and brings them to maturity and liberation.",
        "source": "T16n0680_001:0722b23_2"
    },
    {
        "source_sentence": "「又如眾生慶慰語業，由是眾生展轉談論遞相慶慰。",
        "translation": "“Furthermore, just as sentient beings are greeted with words and actions, so are sentient beings greeted by each other in turn.",
        "source": "T16n0680_001:0722b25_0"
    },
    {
        "source_sentence": "如是如來成所作智慶語化業，由是如來宣暢種種隨所樂法文義巧妙，小智眾生初聞尚信。",
        "translation": "Thus, the Tathāgata accomplishes the task of knowing and speaking eloquently and transforming karma, which is why the Tathāgata proclaims various kinds of teachings and meanings that are delighted by people with little wisdom who first hear",
        "source": "T16n0680_001:0722b26_1"
    },
    {
        "source_sentence": "以是善巧方便力故，引諸眾生令入聖教成熟解脫。",
        "translation": "Because of the power of skillful means, they lead sentient beings into the noble teaching and mature their liberation.",
        "source": "T16n0680_001:0722b28_2"
    },
    {
        "source_sentence": "「又如眾生方便語業，由是眾生展轉指授，務專所作毀惡讚善更相召命。",
        "translation": "“Furthermore, just as sentient beings skillfully speak and act accordingly, so do sentient beings repeatedly instruct, focusing on doing what’s done, disparaging what’s bad, praising what’s good, and calling",
        "source": "T16n0680_001:0722c01_0"
    },
    {
        "source_sentence": "如是如來成所作智所起方便語變化業，由是如來立正學處，毀諸放逸讚不放逸。",
        "translation": "Thus, the Tathāgata accomplishes the knowledge of what's done, which produces skillful means, words, and transformative actions that are produced by wisdom, so the Tathāgata establishes a place of right training and disparages carelessness and praises",
        "source": "T16n0680_001:0722c02_1"
    },
    {
        "source_sentence": "又復建立隨信行人、隨法行等，以是善巧方便力故，引諸眾生令入聖教成熟解脫。",
        "translation": "It also establishes faith-followers and doctrine-followers, etc. Because of the power of skillful means, it leads sentient beings to enter the noble path and brings them to maturity and liberation.",
        "source": "T16n0680_001:0722c04_2"
    },
    {
        "source_sentence": "「又如眾生辯揚語業，由是眾生展轉開示，所不了義宣諷諸論。",
        "translation": "Furthermore, it's like the actions of sentient beings who eloquently speak and thus sentient beings in turn reveal what they don't understand and proclaim treatises.",
        "source": "T16n0680_001:0722c07_0"
    },
    {
        "source_sentence": "如是如來成所作智辯語化業，由是如來斷諸眾生無量疑惑。",
        "translation": "Thus, the Tathāgata accomplishes the actions of wisdom, eloquence, speech, and transformation that are performed by the Tathāgata, which is why the Tathāgata stops sentient beings' measureless doubts and confusions.",
        "source": "T16n0680_001:0722c08_1"
    },
    {
        "source_sentence": "以是善巧方便力故，引諸眾生令入聖教成熟解脫。",
        "translation": "Because of the power of skillful means, they lead sentient beings into the noble teaching and mature their liberation.",
        "source": "T16n0680_001:0722c09_2"
    },
    {
        "source_sentence": "「又如眾生決擇意業，由是眾生決擇可作及不可作。",
        "translation": "“Furthermore, just as sentient beings discriminate mental actions, so do sentient beings discriminate what can be done and what can’t be done.",
        "source": "T16n0680_001:0722c11_0"
    },
    {
        "source_sentence": "如是如來成所作智決意化業，由是如來決擇眾生八萬四千心行差別，以是善巧方便力故，",
        "translation": "In this way the Tathagata accomplishes his work of knowledge, wisdom, determination, and magical creation. This is how the Tathagata determines the distinctions in the eighty-four thousand mental patterns of sentient beings: because of the power of",
        "source": "T16n0680_001:0722c12_1"
    },
    {
        "source_sentence": "引諸眾生令入聖教成熟解脫。",
        "translation": "He guides sentient beings into the noble teaching and brings them to maturity and liberation.",
        "source": "T16n0680_001:0722c14_2"
    },
    {
        "source_sentence": "「又如眾生造作意業，由是眾生造作種種諸所起業。",
        "translation": "“Furthermore, just as sentient beings create mental actions, so do sentient beings create various kinds of actions that give rise to them.",
        "source": "T16n0680_001:0722c15_0"
    },
    {
        "source_sentence": "如是如來成所作智造意化業，由是如來觀諸眾生所行之行，行與不行、若得若失，",
        "translation": "Thus, the Tathāgata accomplishes the knowledge of what’s done and creates mental transformation actions. Because of this, the Tathāgata observes the actions of sentient beings, whether they act or don’t act, and whether they gain or lose",
        "source": "T16n0680_001:0722c16_1"
    },
    {
        "source_sentence": "為令取捨，造作對治。",
        "translation": "In order to cause grasping and equanimity, they create the antidote.",
        "source": "T16n0680_001:0722c18_2"
    },
    {
        "source_sentence": "以是善巧方便力故，引諸眾生令入聖教成熟解脫。",
        "translation": "Because of the power of skillful means, they lead sentient beings into the noble teaching and mature their liberation.",
        "source": "T16n0680_001:0722c18_3"
    },
    {
        "source_sentence": "「又如眾生發起意業，由是眾生發起諸業。",
        "translation": "“Furthermore, just as sentient beings give rise to mental actions, so do sentient beings give rise to actions because of this.",
        "source": "T16n0680_001:0722c20_0"
    },
    {
        "source_sentence": "如是如來成所作智發意化業，由是如來為欲宣說彼對治故，顯彼所樂名句字身。",
        "translation": "Thus, the Tathāgata accomplishes the task of knowledge and arouses the mind to transform karma, which is why the Tathāgata reveals the name-and-word body that he enjoys because he wants to explain its antidote.",
        "source": "T16n0680_001:0722c20_1"
    },
    {
        "source_sentence": "以是善巧方便力故，引諸眾生令入聖教成熟解脫。",
        "translation": "Because of the power of skillful means, they lead sentient beings into the noble teaching and mature their liberation.",
        "source": "T16n0680_001:0722c22_2"
    },
    {
        "source_sentence": "「又如眾生受領意業，由是眾生受領苦樂。",
        "translation": "“Furthermore, just as sentient beings experience the karma of grasping thought, so sentient beings experience suffering and happiness because of this.",
        "source": "T16n0680_001:0722c24_0"
    },
    {
        "source_sentence": "如是如來成所作智受意化業，由是如來於定、不定、反問、置記為記別故，",
        "translation": "In this way, the Tathāgata accomplishes his knowledge of what is to be done and receives it. This is due to the fact that the Tathāgata indicates concentration, uncertainty, inconclusiveness, replying with questions, and leaving a",
        "source": "T16n0680_001:0722c24_1"
    },
    {
        "source_sentence": "隨其所應，受領去來現在等義。",
        "translation": "The past, future, and present are perceived according to their respective meanings.",
        "source": "T16n0680_001:0722c26_2"
    },
    {
        "source_sentence": "以是善巧方便力故，引諸眾生令入聖教成熟解脫。」",
        "translation": "Because of the power of skillful means, they lead sentient beings into the noble teaching and mature their liberation.",
        "source": "T16n0680_001:0722c27_3"
    },
    {
        "source_sentence": "爾時妙生菩薩摩訶薩白佛言：「世尊！",
        "translation": "It was then that the Marvelous Arising Bodhisattva Mahāsattva said to the Buddha, Bhagavān!",
        "source": "T16n0680_001:0722c29_0"
    },
    {
        "source_sentence": "為獨如來於淨法界受用和合一味事智，而諸菩薩亦能如是？」",
        "translation": "Is it because the Tathāgata alone is able to experience and use the pure Dharma realm in a way that unifies taste, service, and knowledge, and so are the bodhisattvas likewise?",
        "source": "T16n0680_001:0722c29_1"
    },
    {
        "source_sentence": "佛告妙生菩薩：「亦能受用和合一味事智。」",
        "translation": "The Buddha told Miaosheng Bodhisattva, They can also experience the taste and function of unity in terms of cognition.",
        "source": "T16n0680_001:0723a02_2"
    },
    {
        "source_sentence": "妙生菩薩復白佛言：「何等菩薩受用和合一味事智？」",
        "translation": "Again, Miaosheng Bodhisattva said to the Buddha, What's the bodhisattva's knowledge of the unity of taste and deeds in terms of enjoyment?",
        "source": "T16n0680_001:0723a04_0"
    },
    {
        "source_sentence": "佛告妙生：「證得無生法忍菩薩，由彼菩薩無生法中，得忍解時對治二想，",
        "translation": "The Buddha told Miaosheng, A bodhisattva who has attained the forbearance of the nonarising of all dharmas is a bodhisattva who counteracts the two conceptions when he attains patience and understanding in the nonaris",
        "source": "T16n0680_001:0723a05_1"
    },
    {
        "source_sentence": "由遣自他二種想故，得平等心。",
        "translation": "Because they reject the two kinds of conceptions of self and other, they attain equanimity.",
        "source": "T16n0680_001:0723a06_2"
    },
    {
        "source_sentence": "從此已上，彼諸菩薩自他異想不復現前，受用和合一味事智。」",
        "translation": "From here on, those bodhisattvas no longer have different conceptions of self and others that don't appear before them, and they experience the taste and function of harmony as one in terms of wisdom.",
        "source": "T16n0680_001:0723a07_3"
    },
    {
        "source_sentence": "妙生菩薩復白佛言：「唯願如來廣說譬喻，令諸菩薩悟甚深義，隨所化緣廣宣流布，",
        "translation": "Again, the bodhisattva Miaosheng said to the Buddha: May the Tathāgata explain in detail these examples and illustrations so that enlightening beings may realize their profound meaning and spread them widely according to the conditions they teach.",
        "source": "T16n0680_001:0723a08_4"
    },
    {
        "source_sentence": "令諸眾生聞已疾悟無生法忍。」",
        "translation": "It causes sentient beings who hear it to quickly awaken to the forbearance of the Dharma of nonproduction.",
        "source": "T16n0680_001:0723a10_5"
    },
    {
        "source_sentence": "佛告妙生：「譬如三十三天未入雜林，終不能於若事若受無我我所和合受用，",
        "translation": "The Buddha told Miaosheng, It's like the thirty-three gods who haven't yet entered a mixed forest and can never experience the convergence of what's selfless and what belongs to self with what'",
        "source": "T16n0680_001:0723a11_6"
    },
    {
        "source_sentence": "若入雜林即無分別隨意受用。",
        "translation": "If he enters a mixed forest, that's when he doesn't discriminate and enjoys it as he wishes.",
        "source": "T16n0680_001:0723a13_7"
    },
    {
        "source_sentence": "由此雜林有如是德，能令諸天入此林者，天諸果報若事若受，無所思惟和合受用。",
        "translation": "Because of this mixed forest, there's such virtue that it can cause gods to enter this forest, and the gods experience the results of their actions and sensations without contemplating or combining them with feelings and functions.",
        "source": "T16n0680_001:0723a13_8"
    },
    {
        "source_sentence": "如是菩薩若未證得無生法忍，終不能得平等之心平等之捨，乃與一切聲聞獨覺無有差別，",
        "translation": "In the same way, if a bodhisattva who has not attained the tolerance of the nonorigination of things does not attain equanimity in his mind and equanimity in his equanimity, there is no difference between him and",
        "source": "T16n0680_001:0723a15_9"
    },
    {
        "source_sentence": "有二想故，彼不能住受用和合一味事智。",
        "translation": "Because there are two conceptions, they can't abide in the knowledge of taste and phenomena that combine feeling and enjoyment with unity.",
        "source": "T16n0680_001:0723a17_10"
    },
    {
        "source_sentence": "若已證得無生法忍，遣二想故得平等心，遂與聲聞獨覺差別，由平等心而能住捨，",
        "translation": "If someone has realized the tolerance of the nonorigination of things, and because they dispel two conceptions they attain equanimity, they’ll be differentiated from śrāvakas and pratyekbuddhas. Because of their equanimity",
        "source": "T16n0680_001:0723a18_11"
    },
    {
        "source_sentence": "受用和合一味事智。",
        "translation": "He combines feeling and function with unity of taste, task, and cognition.",
        "source": "T16n0680_001:0723a20_12"
    },
    {
        "source_sentence": "「復次妙生！",
        "translation": "Furthermore, Miaosheng!",
        "source": "T16n0680_001:0723a21_13"
    },
    {
        "source_sentence": "譬如種種大小眾流，未入大海各別所依，異水少水水有增減，隨其水業所作各異，",
        "translation": "It is like the case of various large and small rivers that have not yet entered the great ocean, which are separately supported by each other. The difference between water and little water increases and diminishes; according to the functioning of their water actions, they",
        "source": "T16n0680_001:0723a21_14"
    },
    {
        "source_sentence": "少分依持水族生命。",
        "translation": "A small part relies on maintaining the life of the water element.",
        "source": "T16n0680_001:0723a23_15"
    },
    {
        "source_sentence": "若入大海無別所依，水無差別、水無限量、水無增減，所作業一，廣大依持水族生命。",
        "translation": "If he enters the great ocean without a separate support, there's no distinction in water, no limit in water, and no increase or decrease in water, and what he does is one, which is to rely extensively on it to sustain the life of",
        "source": "T16n0680_001:0723a23_16"
    },
    {
        "source_sentence": "如是菩薩，若未證入如來清淨法界大海，各別所依異智少智智有增減，",
        "translation": "Thus, if a bodhisattva hasn't realized entering the ocean of the pure Dharma realm of the Tathāgata, each will rely on different kinds of knowledge and little knowledge, with increase and decrease.",
        "source": "T16n0680_001:0723a25_17"
    },
    {
        "source_sentence": "隨其智業所作各異，少分眾生成熟善根之所依止。",
        "translation": "In accordance with the differences in knowledge, action, and deeds, a small part of sentient beings mature good roots on which they rely.",
        "source": "T16n0680_001:0723a27_18"
    },
    {
        "source_sentence": "若已證入如來清淨法界大海，無別所依，智無差別、智無限量、智無增減，",
        "translation": "If someone has realized that they enter the ocean of the pure reality realm of buddhahood, there is no separate support for them; their knowledge has no distinctions, their knowledge has no limit, and their knowledge has no increase or decrease.",
        "source": "T16n0680_001:0723a28_19"
    },
    {
        "source_sentence": "受用和合一味事智，無量眾生成熟善根之所依止。」",
        "translation": "By combining sensation and function with unity, it's the knowledge of taste and deeds, which is the basis for the cultivation of good roots by measureless sentient beings.",
        "source": "T16n0680_001:0723b01_20"
    },
    {
        "source_sentence": "「一切法真如，　　二障清淨相，",
        "translation": "The true nature of all things is the pure characteristic of the two hindrances.",
        "source": "T16n0680_001:0723b02_21"
    },
    {
        "source_sentence": "　法智彼所緣，　　自在無盡相，",
        "translation": "Knowledge of dharmas is their object, Their free and inexhaustible characteristic.",
        "source": "T16n0680_001:0723b02_21"
    },
    {
        "source_sentence": "　普遍真如智，　　修習證圓滿，",
        "translation": "Universal knowledge of reality everywhere Cultivates and realizes its fulfillment.",
        "source": "T16n0680_001:0723b02_21"
    },
    {
        "source_sentence": "　安立眾生二，　　諸種無盡果，",
        "translation": "They establish sentient beings as two, The various kinds of inexhaustible fruits.",
        "source": "T16n0680_001:0723b02_21"
    },
    {
        "source_sentence": "　身語及心化，　　善化方便業，",
        "translation": "Transformation of body, speech and mind are skillful in transforming [sentient beings].",
        "source": "T16n0680_001:0723b02_21"
    },
    {
        "source_sentence": "　定及總持門，　　無邊二成就，",
        "translation": "Concentration and the approach of total maintenance are boundlessly accomplished by both.",
        "source": "T16n0680_001:0723b02_21"
    },
    {
        "source_sentence": "　自性法受用，　　變化差別轉，",
        "translation": "The self-nature of dharmas is experienced and used, evolves by different transformations.",
        "source": "T16n0680_001:0723b02_21"
    },
    {
        "source_sentence": "　如是淨法界，　　諸佛之所說。」",
        "translation": "Such is the pure realm of reality that's explained by the buddhas.",
        "source": "T16n0680_001:0723b02_21"
    },
    {
        "source_sentence": "爾時世尊而說頌曰：時薄伽梵說是經已，妙生菩薩摩訶薩等，諸大聲聞，",
        "translation": "It was then that the Bhagavat uttered these verses: When the Bhagavān had discoursed thus, the bodhisattvas and mahāsattvas of Marvelous Arising, great śrāvakas,",
        "source": "T16n0680_001:0723b02_21"
    },
    {
        "source_sentence": "世間天人、阿素洛等，一切大眾聞佛所說，皆大歡喜信受奉行。",
        "translation": "All the gods, humans, asuras, and so forth in the world heard what the Buddha taught, and they all rejoiced greatly and accepted it with faith and practiced it.",
        "source": "T16n0680_001:0723b12_22"
    },
    {
        "source_sentence": "佛說佛地經",
        "translation": "Foshuo fo di jing",
        "source": "T16n0680_001:0723b14_0"
    }
]