[
    {
        "source_sentence": "佛說大乘造像功德經卷上",
        "translation": "Foshuo dayan zhi xiuxing gongde jing shou",
        "source": "T16n0694_001:0790a12_0"
    },
    {
        "source_sentence": "大唐于闐三藏提雲般若奉　制譯",
        "translation": "Translated by the Great Tang dynasty, translated by the Tripiṭaka Master Tiyun Prajñāpāramitā",
        "source": "T16n0694_001:0790a14_0"
    },
    {
        "source_sentence": "如是我聞：一時佛在三十三天波利質多羅樹下，與無量大比丘眾及無量大菩薩眾俱，",
        "translation": "Thus I have heard: One time, the Buddha was staying at the foot of a pārijātaka tree in the thirty-three heavens, together with an assembly of innumerable great monks and an assembly of in",
        "source": "T16n0694_001:0790a15_0"
    },
    {
        "source_sentence": "彌勒菩薩摩訶薩而為上首。",
        "translation": "Maitreya, the bodhisattva Mahāsattva, is the supreme leader.",
        "source": "T16n0694_001:0790a17_0"
    },
    {
        "source_sentence": "爾時世尊在彼天上，三月安居，為母說法，於諸天眾多所利益，令無量諸天離苦解脫。",
        "translation": "The Bhagavān then stayed in that heaven for three months and taught the Dharma to his mother, benefiting many gods so that measureless gods would be freed from suffering and liberated.",
        "source": "T16n0694_001:0790a18_0"
    },
    {
        "source_sentence": "無量諸天皆蒙法利，獲大福果。",
        "translation": "Measureless gods all received the benefits of the Dharma and attained great meritorious results.",
        "source": "T16n0694_001:0790a19_1"
    },
    {
        "source_sentence": "時彼眾中有一天子，壽將欲盡，五衰相現，以聞法力，命終之後還生此天，",
        "translation": "In that assembly, there was a celestial being whose life span was about to end and the five signs of decay appeared. Because of the power of hearing the Dharma, he returned to this heaven after his life ended.",
        "source": "T16n0694_001:0790a20_2"
    },
    {
        "source_sentence": "永離惡道。",
        "translation": "They'll be permanently freed from the bad destinies.",
        "source": "T16n0694_001:0790a22_3"
    },
    {
        "source_sentence": "爾時閻浮提中無有如來——譬如暗夜，星中無月；",
        "translation": "At that time there was no buddha in Jambudvfpa, like the moon on a dark night among the stars.",
        "source": "T16n0694_001:0790a23_0"
    },
    {
        "source_sentence": "如國無君，如家無主——歡娛、戲樂一切都息。",
        "translation": "It's like when a country has no ruler and a family has no owner - all kinds of joy and play and pleasure cease.",
        "source": "T16n0694_001:0790a24_1"
    },
    {
        "source_sentence": "是時眾生孤獨無依，皆於如來心懷戀慕，生大憂惱，如喪父母，如箭入心，",
        "translation": "The sentient beings were then alone and helpless, all yearning for the Tathāgata in their hearts. They felt great grief and sorrow like losing their parents or an arrow entering their hearts.",
        "source": "T16n0694_001:0790a25_0"
    },
    {
        "source_sentence": "共往世尊曾所住處，園林、庭宇悉空無佛，倍加悲戀，不能自止。",
        "translation": "Together, they went to the place where the World-honored One had lived in the past. The gardens, forests, and courtyards were all empty without a buddha. They became even more grieved and unable to stop themselves.",
        "source": "T16n0694_001:0790a26_1"
    },
    {
        "source_sentence": "爾時優陀延王住在宮中，常懷悲感，渴仰於佛，夫人、婇女諸歡樂事皆不涉心，",
        "translation": "When King Udayana was staying in the palace, he always cherished compassion and longed for the Buddha. His wife and court ladies were not involved in his pleasures.",
        "source": "T16n0694_001:0790a28_0"
    },
    {
        "source_sentence": "作是念言：「我今憂悲，不久當死。",
        "translation": "He had this thought, saying, Now I'm grieved, and soon I'll die.",
        "source": "T16n0694_001:0790a29_1"
    },
    {
        "source_sentence": "云何令我未捨命間，得見於佛？」",
        "translation": "How will I be able to see the Buddha before I give up my life?",
        "source": "T16n0694_001:0790b01_2"
    },
    {
        "source_sentence": "尋復思惟：「譬若有人，心有所愛，而不得見，見其住處及相似人，或除憂惱。」",
        "translation": "Again, he thought, Suppose there's a person whose mind has cravings but can't see them or see their dwelling place and similar people, or they may be freed from sorrow.",
        "source": "T16n0694_001:0790b02_3"
    },
    {
        "source_sentence": "復更思惟：「我今若詣佛先住處，不見於佛，哀號感切，或致於死。",
        "translation": "Again, he thought: If I go to the place where the Buddha was staying before me and do not see him, I will wail in distress or die.",
        "source": "T16n0694_001:0790b03_4"
    },
    {
        "source_sentence": "我觀世間無有一人能與如來色相、福德、智慧等者。",
        "translation": "I observe that there's no one in the world who can share the Tathāgata's form, merit, wisdom, and so forth.",
        "source": "T16n0694_001:0790b05_5"
    },
    {
        "source_sentence": "云何令我得見是人除其憂惱？」",
        "translation": "How will I be able to see this person and remove their grief?",
        "source": "T16n0694_001:0790b06_6"
    },
    {
        "source_sentence": "作是念已，即更思惟：「我今應當造佛形像，禮拜供養。」",
        "translation": "After he had this thought, he further thought, Now, I should create an image of the Buddha and venerate and make offerings.",
        "source": "T16n0694_001:0790b07_7"
    },
    {
        "source_sentence": "復生是念：「若我造像不似於佛，恐當令我獲無量罪。」",
        "translation": "Again, he thought, If I create an image that doesn't resemble the Buddha, I'm afraid I'll be subject to measureless sins.",
        "source": "T16n0694_001:0790b08_8"
    },
    {
        "source_sentence": "復作念言：「假使世間有智之人，咸共稱揚如來功德猶不能盡，若有一人隨分讚美獲福無量，",
        "translation": "Again, he thought: Even if all the wise people of the world were to praise the virtues of the Tathāgata together, they would not be able to exhaust them. Suppose there is one person who praises each other and obtains immeasurable merit",
        "source": "T16n0694_001:0790b09_9"
    },
    {
        "source_sentence": "我今亦然當隨分造。」",
        "translation": "Now, I will create them as appropriate.",
        "source": "T16n0694_001:0790b11_10"
    },
    {
        "source_sentence": "即時告勅國內所有工巧之人，並令來集。",
        "translation": "Immediately, he instructed all the skillful people in his country to come and assemble.",
        "source": "T16n0694_001:0790b12_11"
    },
    {
        "source_sentence": "人既集已，而語之言：「誰能為我造佛形像，當以珍寶重相酬償。」",
        "translation": "After the people had gathered it, they said to him, Whoever can create an image of the Buddha for me will be rewarded with treasures and valuables.",
        "source": "T16n0694_001:0790b13_12"
    },
    {
        "source_sentence": "諸工巧人共白王言：「王今所勅，甚為難事！",
        "translation": "The artisans all said to the king, What the king has ordered is a very difficult task!",
        "source": "T16n0694_001:0790b14_13"
    },
    {
        "source_sentence": "如來相好，世間無匹。",
        "translation": "The Tathāgata’s beautiful features are unparalleled in the world.",
        "source": "T16n0694_001:0790b15_14"
    },
    {
        "source_sentence": "我今何能造佛形像！",
        "translation": "How can I now create an image of the Buddha!",
        "source": "T16n0694_001:0790b15_15"
    },
    {
        "source_sentence": "假使毘首羯磨天而有所作，亦不能得似於如來。",
        "translation": "Even if the Vaiśravaṇa gods did something, they wouldn't be able to resemble the Tathāgata.",
        "source": "T16n0694_001:0790b16_16"
    },
    {
        "source_sentence": "我若受命造佛形像，但可摸擬螺髻、玉毫少分之相，諸餘相好光明威德誰能作耶？",
        "translation": "If I were to receive the order to create an image of the Buddha, I could only touch the shapes of the conch-tuft and a small part of the jade hair on my head, but who would be able to make the other features, such as their beauty",
        "source": "T16n0694_001:0790b17_17"
    },
    {
        "source_sentence": "世尊會當從天來下，所造形像若有虧誤，我等名稱並皆退失！",
        "translation": "Bhagavān, the assembly of the Bhagavān will come down from heaven, and if there are any deficiencies in the images created, we'll all lose our names!",
        "source": "T16n0694_001:0790b19_18"
    },
    {
        "source_sentence": "竊共籌量，無能敢作。」",
        "translation": "I'll deliberate on it together, but I can't dare to do it.",
        "source": "T16n0694_001:0790b20_19"
    },
    {
        "source_sentence": "其王爾時復告之曰：「我心決定，勿有所辭！",
        "translation": "It was then that the king again told him, My mind is determined, so don't say anything!",
        "source": "T16n0694_001:0790b21_20"
    },
    {
        "source_sentence": "如人患渴，欲飲河水，豈以飲不能盡，而不飲耶？」",
        "translation": "It's like a person suffering from thirst who wants to drink water from a river, so why wouldn't they drink it if they didn't?",
        "source": "T16n0694_001:0790b22_21"
    },
    {
        "source_sentence": "是時諸人聞王此語，皆前拜跪共白王言：「當依所勅！",
        "translation": "When the people heard these words of the king, they all bowed their heads and knelt down together and said to the king, You must rely on what you've commanded!",
        "source": "T16n0694_001:0790b23_22"
    },
    {
        "source_sentence": "然請大王垂許我等，今夜思審，明晨就作。」",
        "translation": "However, the great king asks us to approve of it, and tonight we'll deliberate on it for tomorrow morning.",
        "source": "T16n0694_001:0790b24_23"
    },
    {
        "source_sentence": "復白王言：「王今造像應用純紫栴檀之木，文理、體質堅密之者，但其形相為坐、為立、高下若何？」",
        "translation": "Again, he said to the king, Now that the king has created an image using pure purple sandalwood wood, what's the shape of the seat, what's the stance, and what's the height?",
        "source": "T16n0694_001:0790b25_24"
    },
    {
        "source_sentence": "王以此語問諸臣眾，有一智臣前白王言：「大王！",
        "translation": "With these words, the king asked the ministers, and a wise minister went before the king and said, Great king!",
        "source": "T16n0694_001:0790b27_25"
    },
    {
        "source_sentence": "當作如來坐像。",
        "translation": "He'll make an image of the Tathāgata sitting there.",
        "source": "T16n0694_001:0790b28_26"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0694_001:0790b29_0"
    },
    {
        "source_sentence": "一切諸佛得大菩提，轉正法輪，現大神通，降伏外道，作大佛事，皆悉坐故。",
        "translation": "All the buddhas attain great enlightenment, turn the wheel of the true teaching, manifest great supernormal powers, subdue non-Buddhists, and perform great buddha-works because they all sit there.",
        "source": "T16n0694_001:0790b29_1"
    },
    {
        "source_sentence": "是以應作坐師子座，結加之像。」",
        "translation": "That's why you should make a sitting lion seat and combine it with an image of him.",
        "source": "T16n0694_001:0790c01_2"
    },
    {
        "source_sentence": "爾時毘首羯磨天遙見其事，審知王意欲造佛像，於其夜中作是思惟：「我身所解最為巧妙，",
        "translation": "At that time the Vaiśravaṇa gods saw this from a distance and knew the king’s intention to make an image of the Buddha. One night they thought:",
        "source": "T16n0694_001:0790c03_0"
    },
    {
        "source_sentence": "世間之中無如我者。",
        "translation": "There's nothing like self in the world.",
        "source": "T16n0694_001:0790c05_1"
    },
    {
        "source_sentence": "我若為作，應少似佛。」",
        "translation": "If I were to do it for you, I'd look a little like the Buddha.",
        "source": "T16n0694_001:0790c05_2"
    },
    {
        "source_sentence": "即變其身，而為匠者，持諸利器，至明清旦，住王門側，令守門人具白王言：「我今欲為大王造像！",
        "translation": "He then transformed his body into a skillful artisan, took the profitable articles, stayed at the side of the king's entrance until dawn, and told the gatekeeper to tell the king, Now, I want to make an image for the great king!",
        "source": "T16n0694_001:0790c06_3"
    },
    {
        "source_sentence": "我之工巧世中無匹。",
        "translation": "My skillfulness is unsurpassed in the world.",
        "source": "T16n0694_001:0790c08_4"
    },
    {
        "source_sentence": "唯願大王莫使餘人！」",
        "translation": "Please, great king, don't let others do it!",
        "source": "T16n0694_001:0790c08_5"
    },
    {
        "source_sentence": "王聞此語心大欣慶，命之令入。",
        "translation": "When the king heard these words, he was greatly delighted and ordered him to enter.",
        "source": "T16n0694_001:0790c09_6"
    },
    {
        "source_sentence": "觀其容止，知是巧匠，便生念言：「世間之中何有此人？",
        "translation": "Knowing that he was a skillful artisan, he thought to himself, How could there be such a man in the world?",
        "source": "T16n0694_001:0790c10_0"
    },
    {
        "source_sentence": "將非毘首羯磨天，或其弟子，而來此耶？」",
        "translation": "Is it not the Vaiśravaṇa gods or their disciples who come here?",
        "source": "T16n0694_001:0790c11_1"
    },
    {
        "source_sentence": "王於爾時即脫身上所著瓔珞，手自捧持，以挂其頸，仍更許以種種無量諸珍寶物。",
        "translation": "The king then took off the necklace he wore on his body, held it in his own hand, hung it around his neck, and offered a variety of measureless treasures.",
        "source": "T16n0694_001:0790c12_2"
    },
    {
        "source_sentence": "時王即與主藏大臣於內藏中選擇香木，肩自荷負，持與天匠，而謂之言：「善哉，",
        "translation": "The king then went to the treasury councilor and selected some incense wood for the inner storehouse. Carrying it on his shoulders, he gave it to the divine craftsman and said:",
        "source": "T16n0694_001:0790c13_3"
    },
    {
        "source_sentence": "仁者！",
        "translation": "My dear friend!",
        "source": "T16n0694_001:0790c15_4"
    },
    {
        "source_sentence": "當用此木為我造像，令與如來形相相似。」",
        "translation": "You must use this wood to make an image for me, so that it resembles the Tathāgata's form.",
        "source": "T16n0694_001:0790c15_5"
    },
    {
        "source_sentence": "爾時天匠即白王言：「我之工巧雖云第一，然造佛形相終不能盡。",
        "translation": "It was then that the celestial artisan said to the king, Although my skillfulness is called the first, I can't finish building the Buddha's form and characteristics.",
        "source": "T16n0694_001:0790c16_6"
    },
    {
        "source_sentence": "譬如有人以炭畫日，言相似者，無有是處。",
        "translation": "It's like a person who paints the sun with charcoal and says it's similar, but there's no place for that.",
        "source": "T16n0694_001:0790c18_7"
    },
    {
        "source_sentence": "設以真金而作佛像，亦復如是。",
        "translation": "It's likewise if someone were to make an image of the Buddha with genuine gold.",
        "source": "T16n0694_001:0790c19_8"
    },
    {
        "source_sentence": "有外道言：『梵王能作一切世間，然亦不能造佛形像盡諸相好！』",
        "translation": "Some non-Buddhists say, 'The king of Brahmā can create all the worlds, but he can't create buddha images with all their features!'",
        "source": "T16n0694_001:0790c19_9"
    },
    {
        "source_sentence": "但我工巧世中為上，是故我今為王作耳！",
        "translation": "But my skillfulness is the best in the world, so now I'll make it for the king!",
        "source": "T16n0694_001:0790c21_10"
    },
    {
        "source_sentence": "今晨即是月初八日，弗沙宿合毘婆訶底出現之時，佛初誕生，還有此應。",
        "translation": "This morning, on the eighth day of the first month, at the time when the constellation Puṣa conjoined with Vibhāṇohita and the Buddha appeared, there was still this correspondence here:",
        "source": "T16n0694_001:0790c22_11"
    },
    {
        "source_sentence": "此日祥慶，宜應起作。」",
        "translation": "On this auspicious day, it's appropriate to get up and work.",
        "source": "T16n0694_001:0790c24_12"
    },
    {
        "source_sentence": "發是語已，操斧斫木，其聲上徹三十三天，至佛會所。",
        "translation": "Having uttered these words, he raised his axe and drew wood for the sound to penetrate the thirty-three gods and came to the Buddha’s assembly.",
        "source": "T16n0694_001:0790c24_13"
    },
    {
        "source_sentence": "以佛神力聲所及處，眾生聞者，罪垢、煩惱皆得銷除。",
        "translation": "Because of the Buddha's miraculous power, wherever his voice reaches, sentient beings who hear it will be freed from their sins and stains and afflictions.",
        "source": "T16n0694_001:0790c25_14"
    },
    {
        "source_sentence": "爾時如來即便微笑，種種歎美其王功德，乃至遙授阿耨多羅三藐三菩提記。",
        "translation": "The Tathāgata then smiled, praised the king's merits in various ways, and even gave him the assurance of unsurpassed, correct, and complete enlightenment from a distance.",
        "source": "T16n0694_001:0790c27_15"
    },
    {
        "source_sentence": "爾時三十三天主白佛言：「世尊！",
        "translation": "It was then that the Trāyastriṃśa god lord said to the Buddha, Bhagavān!",
        "source": "T16n0694_001:0790c29_0"
    },
    {
        "source_sentence": "今在人間頗亦有人，曾於曩生作佛像不？」",
        "translation": "Is there anyone among the people in the world today who ever made an image of the Buddha in Kauśinagara?",
        "source": "T16n0694_001:0790c29_1"
    },
    {
        "source_sentence": "佛言：「天主！",
        "translation": "The Buddha said, Bhagavān!",
        "source": "T16n0694_001:0790c30_2"
    },
    {
        "source_sentence": "諸有曾經作佛像者，皆於過去先已解脫，在天眾中尚復無有，況於餘處！",
        "translation": "Those who made buddha images in the past had all previously been liberated, and there weren't any of them among the gods, so why wouldn't there be anyone else?",
        "source": "T16n0694_001:0790c30_3"
    },
    {
        "source_sentence": "唯有北方毘沙門子那履沙婆，曾於往昔造菩薩像，以斯福故，後得為王，",
        "translation": "In the northern direction there was Vaiśravaṇa, a son of Vaiśravaṇa, who had in the past made an image of the Bodhisattva. Because of this meritorious deed he attained buddhahood and later became king.",
        "source": "T16n0694_001:0791a02_4"
    },
    {
        "source_sentence": "名頻婆娑羅。",
        "translation": "It's called Bimbisara.",
        "source": "T16n0694_001:0791a04_5"
    },
    {
        "source_sentence": "復因見我，今得生天，有大勢力，永離惡道。",
        "translation": "Again, as a result of seeing me, he's now born in heaven, has great power, and is permanently freed from the bad destinies.",
        "source": "T16n0694_001:0791a04_6"
    },
    {
        "source_sentence": "優樓頻螺迦葉、伽耶迦葉、那提迦葉並曾於往世修故佛堂，由此因緣永得解脫。",
        "translation": "Uruvilvā-Kāśyapa, Kāśyapa, and Nādikaśyapa had all cultivated the old Buddha hall in a past life, and because of these causes and conditions they were permanently liberated.",
        "source": "T16n0694_001:0791a05_7"
    },
    {
        "source_sentence": "憍梵波提昔作牛身，追求水草，右遶精舍，食諸草竹，因見尊容，發歡喜心，",
        "translation": "Formerly Gavāṃpati had the form of a cow and pursued water and grass, circumambulated the monastery to his right, and ate various herbs and bamboo. Seeing the holy man’s appearance, he became delighted",
        "source": "T16n0694_001:0791a07_8"
    },
    {
        "source_sentence": "乘茲福故，今得解脫。",
        "translation": "Because of this merit, they've now attained liberation.",
        "source": "T16n0694_001:0791a09_0"
    },
    {
        "source_sentence": "尸毘羅曾持寶蓋，供養佛像；",
        "translation": "Śivi once carried a jeweled canopy to honor the Buddha’s image.",
        "source": "T16n0694_001:0791a09_1"
    },
    {
        "source_sentence": "阿[少\\/兔]樓馱然一支燈亦以供養；",
        "translation": "An a[lesser\\/rabbit] red sandalwood lamp is also offered as an offering.",
        "source": "T16n0694_001:0791a10_2"
    },
    {
        "source_sentence": "輸鞞那曾掃佛堂；",
        "translation": "Śuddhodana once swept the Buddha’s hall.",
        "source": "T16n0694_001:0791a10_3"
    },
    {
        "source_sentence": "阿婆摩那於佛像前燃燈施明；",
        "translation": "Avalokiteśvara gave a lamp to the Buddha’s image in front of him.",
        "source": "T16n0694_001:0791a11_4"
    },
    {
        "source_sentence": "難陀比丘愛重尊儀，香水洗沐。",
        "translation": "The monk Nanda esteemed the venerable and washed himself with perfume.",
        "source": "T16n0694_001:0791a11_5"
    },
    {
        "source_sentence": "有如是等無量諸阿羅漢，皆悉曾於佛像之所薄申供養——乃至極下如那伽波羅，",
        "translation": "There were innumerable such arhats, all of whom had offered humble offerings to the images of the buddhas-up to the lowest point like Nāgârjuna.",
        "source": "T16n0694_001:0791a12_6"
    },
    {
        "source_sentence": "於像座前，以少許黃丹畫一像身，而為供養——由此福故，皆永離苦而得解脫。",
        "translation": "In front of the image throne, he offered an image with a little bit of yellow丹 painted on its body as an offering - because of this merit, they were all permanently freed from suffering and attained liberation.",
        "source": "T16n0694_001:0791a14_7"
    },
    {
        "source_sentence": "天主！",
        "translation": "O lord of the gods!",
        "source": "T16n0694_001:0791a16_8"
    },
    {
        "source_sentence": "若復有人能於我法未滅盡來，造佛像者，於彌勒初會皆得解脫。",
        "translation": "If another person were to create an image of the Buddha before my teaching disappeared, they'd all attain liberation at Maitreya's first assembly.",
        "source": "T16n0694_001:0791a16_9"
    },
    {
        "source_sentence": "若有眾生非但為已而求出離，乃為欲得無上菩提，造佛像者，當知此則為三十二相之因，",
        "translation": "If there are any sentient beings who don’t just seek liberation for the sake of attaining enlightenment but create buddha images for the sake of attaining it, you should know that this is the cause of the thirty-two",
        "source": "T16n0694_001:0791a17_10"
    },
    {
        "source_sentence": "能令其人速致成佛。」",
        "translation": "It will cause those people to quickly become buddhas.",
        "source": "T16n0694_001:0791a19_11"
    },
    {
        "source_sentence": "爾時優陀延王心自思惟：「云何令我所造之像速得成就？」",
        "translation": "It was then that King Udayana thought to himself, How will the images I've created quickly become complete?",
        "source": "T16n0694_001:0791a21_0"
    },
    {
        "source_sentence": "作是念已，語彼匠言：「汝可勤心令功速畢，使我早得瞻仰禮敬。」",
        "translation": "After he had this thought, he said to the craftsman, You must diligently work with diligence so that your effort will quickly end and I'll be able to venerate and venerate you sooner.",
        "source": "T16n0694_001:0791a22_1"
    },
    {
        "source_sentence": "是時天匠運其工巧，專精匪懈，不日而成。",
        "translation": "At the time, the celestial craftsman carried his skillfulness and concentrated his effort without laziness, producing it in an unbroken succession.",
        "source": "T16n0694_001:0791a23_2"
    },
    {
        "source_sentence": "其像加趺，坐高七尺，面及手足皆紫金色。",
        "translation": "The seat was seven feet in height, and its face and hands and feet were all purplish-gold.",
        "source": "T16n0694_001:0791a24_3"
    },
    {
        "source_sentence": "時優陀延王見像得成，相好端嚴，心生淨信，獲柔順忍。",
        "translation": "When King Udayana saw that the image had been completed, its features were beautiful and dignified, and his mind gave rise to pure faith and attained gentle forbearance.",
        "source": "T16n0694_001:0791a25_4"
    },
    {
        "source_sentence": "既得忍已，益加欣慶，所有業障及諸憂惱並得銷除。",
        "translation": "Having attained forbearance, they'll become increasingly joyful, and all the karmic hindrances and grief and afflictions will be removed.",
        "source": "T16n0694_001:0791a26_5"
    },
    {
        "source_sentence": "譬如日出，霧露皆盡，唯除一業，現身受者，以曾於聖人起惡語故。",
        "translation": "It's like when the sun rises and all the mist and dew are exhausted, except for one action, which is experienced in the present body because it once spoke badly to a noble person.",
        "source": "T16n0694_001:0791a28_0"
    },
    {
        "source_sentence": "其王爾時即以種種殊珍異物賞彼天匠。",
        "translation": "It was then that the king rewarded the heavenly artisan with various rare treasures.",
        "source": "T16n0694_001:0791a29_1"
    },
    {
        "source_sentence": "是時天匠敬白王言：「王今造像，我心隨喜。",
        "translation": "The celestial artisan then respectfully said to the king, Now that you've created an image, I'm delighted with my heart.",
        "source": "T16n0694_001:0791b01_2"
    },
    {
        "source_sentence": "願與大王同修此福！",
        "translation": "May you and the great king cultivate this merit together!",
        "source": "T16n0694_001:0791b02_3"
    },
    {
        "source_sentence": "今王所賜，非我敢受。",
        "translation": "I am not the one who dared to accept what you have now given me.",
        "source": "T16n0694_001:0791b02_4"
    },
    {
        "source_sentence": "若要相與，待餘吉日。」",
        "translation": "If you want to give it to him, wait until another auspicious day.",
        "source": "T16n0694_001:0791b03_5"
    },
    {
        "source_sentence": "作是語已，即於其夜還昇本天。",
        "translation": "After he said this, he returned to his native heaven that night.",
        "source": "T16n0694_001:0791b03_6"
    },
    {
        "source_sentence": "爾時諸大國王阿闍世等，並先於佛心懷渴慕。",
        "translation": "It was then that the great kings, Ajātaśatru and others, all of whom were previously longing for the Buddha in their minds.",
        "source": "T16n0694_001:0791b05_0"
    },
    {
        "source_sentence": "聞王造像，功已獲成，皆生喜慶。",
        "translation": "When they heard that the king had produced the image and completed it, all of them were delighted.",
        "source": "T16n0694_001:0791b06_1"
    },
    {
        "source_sentence": "共至王所，各以無量花香、音樂供養佛像，復以種種諸珍寶物贈奉於王，",
        "translation": "Together they came to the king’s presence and each offered innumerable flowers, perfumes, and music for the Buddha’s image. They also presented various kinds of rare treasures to the king.",
        "source": "T16n0694_001:0791b06_2"
    },
    {
        "source_sentence": "咸作是言：「大王！",
        "translation": "They all said, Great king!",
        "source": "T16n0694_001:0791b08_3"
    },
    {
        "source_sentence": "所作甚為希有，能拔我等愁憂毒箭！」",
        "translation": "What you've done is so rare that it can remove the poisonous arrow of our sorrow!",
        "source": "T16n0694_001:0791b08_4"
    },
    {
        "source_sentence": "爾時如來在彼天中為母說法，及諸天眾咸得利喜，所應作事皆已作訖，",
        "translation": "At that time the Tathāgata was teaching the Dharma to his mothers in those heavens. All the goddesses and goddesses were delighted, having accomplished what should be done.",
        "source": "T16n0694_001:0791b10_0"
    },
    {
        "source_sentence": "復告眾言：「諸天子！",
        "translation": "Again, he told the crowd, Children of gods!",
        "source": "T16n0694_001:0791b11_1"
    },
    {
        "source_sentence": "諸佛、世尊是常住身，若諸眾生有可度者，即為出現教化說法。",
        "translation": "The buddhas and world-honored ones are the eternally abiding body, and if sentient beings have something to save them, they'll appear, teach, and preach for them.",
        "source": "T16n0694_001:0791b12_2"
    },
    {
        "source_sentence": "若所作事畢，更無有能受法化者，如來於此即便不現。",
        "translation": "If there's no one who can receive the teaching after completing his task, the Tathāgata won't appear here.",
        "source": "T16n0694_001:0791b13_3"
    },
    {
        "source_sentence": "無智之人，謂佛實滅。",
        "translation": "A person lacking wisdom means the Buddha's true cessation.",
        "source": "T16n0694_001:0791b14_4"
    },
    {
        "source_sentence": "如來身者，法身、常身，實不滅度。",
        "translation": "The Tathāgata's body is the Dharma body and eternal body, which really don't cease.",
        "source": "T16n0694_001:0791b15_5"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T16n0694_001:0791b16_0"
    },
    {
        "source_sentence": "一切諸佛法皆如是，為化眾生有現、不現。」",
        "translation": "All the Buddha's teachings are like this, whether manifest or unmanifest for the purpose of transforming sentient beings.",
        "source": "T16n0694_001:0791b16_1"
    },
    {
        "source_sentence": "爾時如來復作是言：「汝等當知！",
        "translation": "It was then that the Tathāgata again said, You should know!",
        "source": "T16n0694_001:0791b18_0"
    },
    {
        "source_sentence": "此諸天眾所應度者，皆已度訖。",
        "translation": "Those who should be liberated by these gods have all been liberated.",
        "source": "T16n0694_001:0791b18_1"
    },
    {
        "source_sentence": "吾今將欲下閻浮提。",
        "translation": "Now, I'm about to descend into Jambudvīpa.",
        "source": "T16n0694_001:0791b19_2"
    },
    {
        "source_sentence": "汝等諸天若念我者，當勤精進，勿復放逸。",
        "translation": "If you gods think of me, you should diligently exert effort and no longer be careless.",
        "source": "T16n0694_001:0791b19_3"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T16n0694_001:0791b20_4"
    },
    {
        "source_sentence": "放逸過失故，令汝等不得阿耨多羅三藐三菩提。",
        "translation": "Because of your carelessness and faults, you won't attain unsurpassed, correct, and complete enlightenment.",
        "source": "T16n0694_001:0791b21_5"
    },
    {
        "source_sentence": "然汝等以於往昔曾種善根，今得在此受天快樂，便著放逸，不修福行。",
        "translation": "Still, because you once planted good roots in the past, you've now experienced heavenly bliss here, so you're attached to carelessness and don't cultivate good actions.",
        "source": "T16n0694_001:0791b22_6"
    },
    {
        "source_sentence": "此諸快樂，無常所隨，一從隕墜，長淪惡道。",
        "translation": "These pleasures are always accompanied by impermanence, and one of them falls down from a meteor and goes into a bad destiny for a long time.",
        "source": "T16n0694_001:0791b23_7"
    },
    {
        "source_sentence": "又汝等諸天煩惱尤重，見有勝己，便生嫉妬，曾不念言：『彼天勝樂由多福業之所感致，",
        "translation": "Furthermore, you gods, the afflictions are especially serious. Seeing their superiority, you become jealous of yourselves and never think, “That heavenly being’s superior blis is due to the result of many meritorious deeds",
        "source": "T16n0694_001:0791b24_8"
    },
    {
        "source_sentence": "我若勤修必亦當得。』",
        "translation": "If I diligently cultivate it, I'll surely attain it.'",
        "source": "T16n0694_001:0791b26_9"
    },
    {
        "source_sentence": "又今汝等身色光澤，如日初輝，若懷嫉妬，心黯如死炭，復當令墮大黑闇中，",
        "translation": "Again, your bodies are shiny and lustrous like the first ray of light that shines from the sun. If you harbor jealousy, your minds will be as dazzled as if they were burning in the darkness of death.",
        "source": "T16n0694_001:0791b27_10"
    },
    {
        "source_sentence": "乃至不能自見手掌，後復當作食吐之鬼。",
        "translation": "Even if they can't see their own palms, they'll later become food- vomiting ghosts.",
        "source": "T16n0694_001:0791b28_11"
    },
    {
        "source_sentence": "又汝等諸天受眾福報，身相嚴潔，威勢勇猛，由嫉妬故，當受女身，永失丈夫威猛之力。",
        "translation": "Furthermore, you gods will receive the rewards of various good deeds. Your bodies will be beautiful and pure, powerful and brave. Because of your jealousy you will experience a female body that will permanently lose its masculinity and might",
        "source": "T16n0694_001:0791b29_12"
    },
    {
        "source_sentence": "「諸天子！",
        "translation": "“O celestial beings!",
        "source": "T16n0694_001:0791c02_13"
    },
    {
        "source_sentence": "我念昔者有無量諸王，皆為汝等嫉妬之心非理所害。",
        "translation": "I'm mindful that there were countless kings in the past who were all harmed by your jealousy and not by reason.",
        "source": "T16n0694_001:0791c03_0"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T16n0694_001:0791c04_1"
    },
    {
        "source_sentence": "昔有阿修羅王名曰鄔羅，修行苦行，戒品清潔，而汝諸天等遣一天女，",
        "translation": "Formerly there was an asura king named Ura, who practiced austerities and observed the precepts.",
        "source": "T16n0694_001:0791c04_2"
    },
    {
        "source_sentence": "名鄔婆尸，惑彼王心，令虧淨行。",
        "translation": "It's called Upāsikā, which disturbs the king's mind and causes him to lack pure practice.",
        "source": "T16n0694_001:0791c06_0"
    },
    {
        "source_sentence": "其王染著，威德損減，被那羅延天之所殺害，并無量阿修羅眾同時敗滅。",
        "translation": "The king became so attached that his authority diminished and he was killed by the Nārāyaṇa gods, along with innumerable other asura demons.",
        "source": "T16n0694_001:0791c06_1"
    },
    {
        "source_sentence": "其那羅延天既殺此王，又誅其眾，因即收取鄔婆尸女，而往天宮。",
        "translation": "After killing this king, the Nārāyaṇa gods also killed his people, so they collected Upāsikā and went to the celestial palace.",
        "source": "T16n0694_001:0791c08_2"
    },
    {
        "source_sentence": "復有一王，名曰那訶受，汝等諸天誑惑之語，助諸天眾伐阿修羅。",
        "translation": "Again, there's another king named Nāha Suffering, and you gods are being deceived by the words of the gods to help the gods subdue the asura.",
        "source": "T16n0694_001:0791c09_3"
    },
    {
        "source_sentence": "修羅破已，汝等諸天反加其害。",
        "translation": "After the asura breaks it down, you gods will again inflict harm on him.",
        "source": "T16n0694_001:0791c11_4"
    },
    {
        "source_sentence": "又汝等諸天以舍支夫人故，心生忿妬，構行讒毀，令阿伽娑仙人無故被嫌，",
        "translation": "“Furthermore, you gods, because of Lady Śāriputra’s anger and jealousy in your minds, compiled acts of malice and disparagement so that the holy man Aṅga might not be hated",
        "source": "T16n0694_001:0791c12_0"
    },
    {
        "source_sentence": "而興惡願。",
        "translation": "They give rise to bad vows.",
        "source": "T16n0694_001:0791c13_1"
    },
    {
        "source_sentence": "又汝等諸天曾為誑惑，謂曀荼王曰：『仙人之處，多有真金。』",
        "translation": "Furthermore, you gods were once deceived and said to the king of caṇḍa, 'There's plenty of genuine gold at the place where the sage lives.'",
        "source": "T16n0694_001:0791c13_2"
    },
    {
        "source_sentence": "王信此言，逼之令出，仙人由是心生憤恚，即時猛火燒殺其王。",
        "translation": "The king believed these words and compelled him to leave. Because of this, the holy man became angry and immediately burned the king in a fierce fire.",
        "source": "T16n0694_001:0791c15_3"
    },
    {
        "source_sentence": "昔復有王，名曰提婆，甞設大會，以為供養，以斯福業威力自在，上此天中，",
        "translation": "Formerly there was another king named Deva, who once hosted a great assembly to make offerings to the gods. Because of his meritorious deeds he ascended to this heaven freely realm with unimpeded power.",
        "source": "T16n0694_001:0791c16_4"
    },
    {
        "source_sentence": "受天快樂。",
        "translation": "They'll experience heavenly bliss.",
        "source": "T16n0694_001:0791c18_5"
    },
    {
        "source_sentence": "汝諸天等，心懷嫉妬，令從忉利退墮閻浮，所有威勢並皆喪失，如月無光，",
        "translation": "All of you gods, harboring jealousy in your minds, will cause us to retreat from Trāyastriṃśa Heaven and fall into Jambudvīpa. Were we to lose all our might and power like the moon",
        "source": "T16n0694_001:0791c18_6"
    },
    {
        "source_sentence": "如河無水。",
        "translation": "It's like a river without water.",
        "source": "T16n0694_001:0791c20_7"
    },
    {
        "source_sentence": "諸天子！",
        "translation": "“O gods!",
        "source": "T16n0694_001:0791c20_8"
    },
    {
        "source_sentence": "世中有人威德自在，或得諸定，或得神通，或有成就四神足等，若起一念嫉妬之心，",
        "translation": "In the world, there are people with authoritative qualities and sovereignty who may attain concentrations, or attain supernormal powers, or have accomplished the four miraculous abilities. If they give rise to one thought of jealousy",
        "source": "T16n0694_001:0791c20_9"
    },
    {
        "source_sentence": "如是功德一時退失。",
        "translation": "Such merit is lost at one time or another.",
        "source": "T16n0694_001:0791c22_10"
    },
    {
        "source_sentence": "如提婆達多愚癡厚重，乃於我所生嫉妬意，即時自失五種神通。」",
        "translation": "Suppose Devadatta's folly is so serious that he becomes jealous of what I am and immediately loses five kinds of supernormal abilities.",
        "source": "T16n0694_001:0791c23_11"
    },
    {
        "source_sentence": "爾時天帝釋白佛言：「世尊！",
        "translation": "It was then that Śakra Devānām-Indra said to the Buddha, Bhagavān!",
        "source": "T16n0694_001:0791c25_0"
    },
    {
        "source_sentence": "我今有疑，欲有所問。",
        "translation": "Now that I have doubts, I want to ask questions.",
        "source": "T16n0694_001:0791c25_1"
    },
    {
        "source_sentence": "言嫉妬者，云何是耶？」",
        "translation": "What's meant by jealousy?",
        "source": "T16n0694_001:0791c26_2"
    },
    {
        "source_sentence": "復作是言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T16n0694_001:0791c26_3"
    },
    {
        "source_sentence": "若有眾生見他勝己，生如是念：『云何令我獲彼所得？』",
        "translation": "Suppose there are sentient beings who see others superior to themselves and give rise to the thought, 'How will I get what they have?'",
        "source": "T16n0694_001:0791c26_4"
    },
    {
        "source_sentence": "如是之心，是嫉妬不？」",
        "translation": "Is this kind of mind jealous?",
        "source": "T16n0694_001:0791c28_5"
    },
    {
        "source_sentence": "佛言：「不也！",
        "translation": "The Buddha said, No!",
        "source": "T16n0694_001:0791c28_6"
    },
    {
        "source_sentence": "此是貪心，非為嫉妬。",
        "translation": "This is a mind of greed, not jealousy.",
        "source": "T16n0694_001:0791c28_7"
    },
    {
        "source_sentence": "天主！",
        "translation": "O lord of the gods!",
        "source": "T16n0694_001:0791c29_8"
    },
    {
        "source_sentence": "其嫉妬者，自求名利，不欲他有，於有之人而生憎恚，是為嫉妬。」",
        "translation": "Jealousy is when someone seeks fame and profit for themselves, doesn't want others to have it, and becomes hateful to those who have it, which is jealousy.",
        "source": "T16n0694_001:0791c29_9"
    },
    {
        "source_sentence": "爾時諸天眾皆從座起，右膝著地，合掌向佛，而作是言：「如佛所誨，",
        "translation": "At that moment the gods all rose from their seats, knelt with their right knees on the ground, joined their palms in respect toward the Buddha, and said:",
        "source": "T16n0694_001:0792a01_10"
    },
    {
        "source_sentence": "我諸天眾皆當奉行。",
        "translation": "All of us gods and goddesses will follow it.",
        "source": "T16n0694_001:0792a03_11"
    },
    {
        "source_sentence": "如來、世尊為父、為主、為尊重者、為最勝者，能於我等起大慈悲而來至此，",
        "translation": "The Tathāgatas and the World-honored Ones, who are their fathers, lords, respected ones, and foremost among all, have come here to show great compassion toward us.",
        "source": "T16n0694_001:0792a03_12"
    },
    {
        "source_sentence": "令諸天眾皆得利益。",
        "translation": "It causes the gods and goddesses to attain benefit.",
        "source": "T16n0694_001:0792a05_13"
    },
    {
        "source_sentence": "我等所願，猶為未滿，欲於如來重請一事。",
        "translation": "We still have not fulfilled all our wishes, and we would like to ask the Tathāgata again for one thing.",
        "source": "T16n0694_001:0792a05_14"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T16n0694_001:0792a06_15"
    },
    {
        "source_sentence": "世間之人於我等諸天多生輕慢。",
        "translation": "People in the world often become despised by us gods.",
        "source": "T16n0694_001:0792a07_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0694_001:0792a07_1"
    },
    {
        "source_sentence": "以諸佛、如來人中生故，復於人中成正覺故；",
        "translation": "Because buddhas and enlightened ones are born among humans, they also become perfectly enlightened among humans.",
        "source": "T16n0694_001:0792a07_2"
    },
    {
        "source_sentence": "人中多有諸阿羅漢而得果故；",
        "translation": "Among humans, there are many arhats who attain the fruit.",
        "source": "T16n0694_001:0792a08_3"
    },
    {
        "source_sentence": "諸大威德、辟支佛復於人間而出現故。",
        "translation": "It's because the great and authoritative buddhas and pratyekabuddhas will again appear among humans.",
        "source": "T16n0694_001:0792a09_4"
    },
    {
        "source_sentence": "如來今者，若不住此，下閻浮提，世間之人謂我等諸天，不知如來有大威德，",
        "translation": "If the Tathāgata doesn’t live here now, he will descend to Jambudvfpa. People in the world think that we gods don’t know that the Tathāgata has great and mighty virtue.",
        "source": "T16n0694_001:0792a10_5"
    },
    {
        "source_sentence": "應受諸天如法供養，復謂我等不能供養諸佛、世尊。",
        "translation": "You should receive the offerings of gods in accordance with the teaching, and you also say that we can't make offerings to the buddhas or world-honored ones.",
        "source": "T16n0694_001:0792a12_6"
    },
    {
        "source_sentence": "唯願如來少住於此，受我微供！",
        "translation": "May the Tathāgata stay here for a little while and receive my humble offerings!",
        "source": "T16n0694_001:0792a13_7"
    },
    {
        "source_sentence": "令彼人間知我等諸天供養於佛。」",
        "translation": "Let the people there know that we gods make offerings to the Buddha.",
        "source": "T16n0694_001:0792a14_8"
    },
    {
        "source_sentence": "于時世尊默然許可。",
        "translation": "The Bhagavān then consented by remaining silent.",
        "source": "T16n0694_001:0792a14_9"
    },
    {
        "source_sentence": "爾時佛告大目揵連：「汝可先往閻浮提，問訊四眾，作如是言：『一切眾生憶念我者，",
        "translation": "It was then that the Buddha addressed Mahāmaudgalyāyana: You should first go to Jambudvfpa and greet the fourfold assembly.",
        "source": "T16n0694_001:0792a16_0"
    },
    {
        "source_sentence": "咸應集會僧伽尸國。",
        "translation": "They should all assemble in the country of Saṃghâśī.",
        "source": "T16n0694_001:0792a17_1"
    },
    {
        "source_sentence": "却後七日，皆當見我。』」",
        "translation": "Seven days after that, they'll all see me.'",
        "source": "T16n0694_001:0792a18_2"
    },
    {
        "source_sentence": "爾時大目揵連頂禮佛足。",
        "translation": "It was then that Mahāmaudgalyāyana bowed his head at the Buddha's feet.",
        "source": "T16n0694_001:0792a19_0"
    },
    {
        "source_sentence": "禮佛足已，如一瞬頃到閻浮提，以佛所勅告諸四眾。",
        "translation": "After bowing at the Buddha's feet, he went to Jambudvīpa in a moment's time, as instructed by the Buddha, and told the four groups of people.",
        "source": "T16n0694_001:0792a19_1"
    },
    {
        "source_sentence": "時優陀延王等及一切眾生，聞佛此言，若身若心歡喜踊躍，皆除憂惱，",
        "translation": "When King Udayana and all the other sentient beings heard these words of the Buddha, whether physically or mentally joyful and ecstatic, they were rid of sorrow and distress.",
        "source": "T16n0694_001:0792a20_2"
    },
    {
        "source_sentence": "普得清涼。",
        "translation": "They'll all attain clarity and coolness.",
        "source": "T16n0694_001:0792a22_3"
    },
    {
        "source_sentence": "爾時四眾比丘、比丘尼、優婆塞、優婆夷欲共往詣僧伽尸國，並先來集王舍城中，",
        "translation": "It was then that the fourfold assembly of monks, nuns, laymen, and laywomen wished to visit the country of Siṃhala together. They had previously assembled in Rājagaha.",
        "source": "T16n0694_001:0792a23_0"
    },
    {
        "source_sentence": "互相謂言：「如來、世尊下閻浮提，誰能先得恭敬禮拜，法未盡來恒為上首！」",
        "translation": "They said among themselves, The Tathāgata and the Bhagavān are inferior to Jambudvīpa, who can first attain respect and veneration, and they'll always be the leaders before the Dharma is exhausted!",
        "source": "T16n0694_001:0792a24_1"
    },
    {
        "source_sentence": "爾時摩訶迦旃延聞此語已，心懷不悅，恐比丘尼得為上首。",
        "translation": "After hearing these words, Mahākātyāyana was disheartened in mind and feared that the monks and nuns would become the leaders.",
        "source": "T16n0694_001:0792a26_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T16n0694_001:0792a27_3"
    },
    {
        "source_sentence": "彼眾之中，有優波難陀、蓮花色二比丘尼，善能通達諸佛法藏，所得神通唯除目連更無等故。",
        "translation": "Among them, there were Upananda and the two monks and nuns of lotus-flower form who were well able to penetrate the buddhas' store of the Dharma, and they had attained supernormal abilities except for Maudgalyāyana, which",
        "source": "T16n0694_001:0792a28_0"
    },
    {
        "source_sentence": "作是念已，種種訶責比丘尼眾。",
        "translation": "After he had this thought, he variously reprimanded the monks and nuns.",
        "source": "T16n0694_001:0792b01_1"
    },
    {
        "source_sentence": "時蓮花色比丘尼告諸尼言：「我等女人在於俗間常被尊貴，縱使種族卑賤之者，",
        "translation": "The lotus-colored bhikṣuṇīs then addressed the nuns, saying, We women are always honored among laymen, even to the point of despising those of lowly castes.",
        "source": "T16n0694_001:0792b01_2"
    },
    {
        "source_sentence": "仍得丈夫恭敬、禮重、承事、供養。",
        "translation": "They'll still be respected, venerated, served, and offered support by their husbands.",
        "source": "T16n0694_001:0792b03_3"
    },
    {
        "source_sentence": "又佛法中諸比丘尼，父母、眷屬多是王種，精進持戒，不犯威儀，具諸德業，",
        "translation": "Furthermore, in the Buddha’s teaching, bhikṣus and nuns are mostly of royal lineage. They diligently keep the precepts; they do not violate the disciplinary rules. They are endowed with virtuous deeds.",
        "source": "T16n0694_001:0792b04_4"
    },
    {
        "source_sentence": "仍令禮敬初戒比丘。",
        "translation": "He still ordered the monk to pay homage to the first precepts.",
        "source": "T16n0694_001:0792b06_0"
    },
    {
        "source_sentence": "又尊者迦旃延，今復作此種種呵責。",
        "translation": "Furthermore, Venerable Kātyāyana now repeats these various kinds of criticism.",
        "source": "T16n0694_001:0792b06_1"
    },
    {
        "source_sentence": "我為汝等設諸方便，令比丘尼出過於彼。」",
        "translation": "I'll set up various ways for you to cause the monks and nuns to go beyond them.",
        "source": "T16n0694_001:0792b07_2"
    },
    {
        "source_sentence": "作是語已，與諸四眾即時往赴僧伽尸城。",
        "translation": "After he said these words, he and the four groups of people immediately went to the city of Saṃghâśi.",
        "source": "T16n0694_001:0792b08_3"
    },
    {
        "source_sentence": "爾時波斯匿王、阿闍世王及毘舍離國嚴熾王等，各將四兵，前後導從，",
        "translation": "It was then that King Prasenajit, King Ajātaśatru, and King Yama of Vaiśālī, each leading four armies, led the procession in front and behind them.",
        "source": "T16n0694_001:0792b10_0"
    },
    {
        "source_sentence": "有大勢力，所乘象馬，皆以種種寶物莊嚴，幡蓋、香花并眾妓樂，威容肅穆，",
        "translation": "The elephants and horses that they rode were all adorned with various precious things, such as pennants, canopies, fragrant flowers, and many kinds of music.",
        "source": "T16n0694_001:0792b11_1"
    },
    {
        "source_sentence": "狀若諸天，皆亦往詣僧伽城所。",
        "translation": "The gods in the form and formless realms all went to the city of Siṃhala.",
        "source": "T16n0694_001:0792b13_2"
    },
    {
        "source_sentence": "爾時優陀延王嚴整四兵以為侍從，乘大白象珍寶綺飾，躬自荷戴所造之像，",
        "translation": "At that time King Udayana, dressed in the fourfold army to serve as his attendants, rode on a great white elephant decorated with rare treasures and adorned himself with an image he wore.",
        "source": "T16n0694_001:0792b14_0"
    },
    {
        "source_sentence": "花幡音樂隨逐供養，從其本國向僧伽尸城。",
        "translation": "With flowers, banners, music, and accompanying offerings, they left their native land and headed for the city of Siṃhala.",
        "source": "T16n0694_001:0792b15_1"
    },
    {
        "source_sentence": "爾時毘首羯磨天并諸天眾，知佛將欲下閻浮提，作三道寶階，從僧伽尸城至忉利天，",
        "translation": "Knowing that the Buddha was about to descend down into Jambudvfpa, the Vaiśravaṇa gods and other heavenly beings built jewel staircases of the three paths from the city of Saṃghâvaśetra to the Heaven of",
        "source": "T16n0694_001:0792b17_0"
    },
    {
        "source_sentence": "其階中道瑠璃所成，兩邊階道悉用黃金，足所踐處布以白銀，諸天七寶而為間飾。",
        "translation": "The middle path of each staircase was made of lapis lazuli, and the two side paths were all made of gold. The footprints on which they walked were draped with white silver, decorated in between by the seven treasures of the gods.",
        "source": "T16n0694_001:0792b18_1"
    },
    {
        "source_sentence": "爾時帝釋遣使往詣夜摩天、兜率陀天、化樂天、他化自在天及于梵世，",
        "translation": "Śakra then sent an envoy to the Yama gods, the Tuṣita gods, the Nirmāṇarati gods, the Paranirmitavaśavartin gods, and Brahmā.",
        "source": "T16n0694_001:0792b21_0"
    },
    {
        "source_sentence": "而告之曰：「如來不久下閻浮提。",
        "translation": "He told them, “Soon the Tathāgata will descend to Jambudvfpa.",
        "source": "T16n0694_001:0792b22_1"
    },
    {
        "source_sentence": "欲有供養，願來至此！」",
        "translation": "If you want to make an offering, may you come here!",
        "source": "T16n0694_001:0792b23_2"
    },
    {
        "source_sentence": "復遣使往四天王天、大海龍王、揵闥婆、緊那羅、夜叉等眾，而謂之言：「世尊今欲下閻浮提，",
        "translation": "Again, he sent an envoy to the four heavenly kings, the great dragon kings of the ocean, nāgas, gandharvas, kiṃnaras, and yakṣas, saying, “O Bhagavat!",
        "source": "T16n0694_001:0792b23_3"
    },
    {
        "source_sentence": "可持所有來此供養！」",
        "translation": "You can maintain all the offerings that come here!",
        "source": "T16n0694_001:0792b25_4"
    },
    {
        "source_sentence": "時彼諸天及龍、神等聞此語已，靡不雲集忉利天中。",
        "translation": "When those gods, dragons, and spirits heard these words, they all gathered together in the Trāyastriṃśa gods.",
        "source": "T16n0694_001:0792b26_5"
    },
    {
        "source_sentence": "爾時世尊在須彌山頂，與諸天眾將欲下時，一切諸天前後翼從，威德熾盛，",
        "translation": "At that time the World-honored One was at the summit of Mount Sumeru, accompanied by a host of heavenly beings. As he was about to descend, all the heavenly beings were following him in front and behind him, their mighty virtu",
        "source": "T16n0694_001:0792b28_0"
    },
    {
        "source_sentence": "光明赫奕。",
        "translation": "The light shines brilliantly.",
        "source": "T16n0694_001:0792b29_1"
    },
    {
        "source_sentence": "如滿月在空，眾星共遶；",
        "translation": "It is as if the full moon were in space, surrounded by many stars.",
        "source": "T16n0694_001:0792b29_2"
    },
    {
        "source_sentence": "如旭日初出，彩霞紛映。",
        "translation": "It is like when the sun rises at the beginning of a new moon and its colors are mixed with the glow of the clouds.",
        "source": "T16n0694_001:0792c01_3"
    },
    {
        "source_sentence": "時佛眾會，其狀如是。",
        "translation": "At the time, the Buddha's congregation was thus shaped.",
        "source": "T16n0694_001:0792c02_0"
    },
    {
        "source_sentence": "爾時閻浮提中，以佛威神有五種希有之事：一者、令彼諸天不見人間不淨之物；",
        "translation": "At that time in Jambudvfpa there were five kinds of rare things by reason of the Buddha’s spiritual power:",
        "source": "T16n0694_001:0792c03_0"
    },
    {
        "source_sentence": "二者、令諸女人見彼天男而無欲想；",
        "translation": "The second is to cause women to see those celestial males without any thought of desire.",
        "source": "T16n0694_001:0792c04_1"
    },
    {
        "source_sentence": "三者、亦令丈夫見諸天女不生染意；",
        "translation": "The third is that they also cause husbands to see heavenly maidens and not give rise to defiled thoughts.",
        "source": "T16n0694_001:0792c05_2"
    },
    {
        "source_sentence": "四者、令於人間遙見諸天種種供養；",
        "translation": "The fourth is to cause people to see the various offerings of all kinds of celestial beings from a distance among humans.",
        "source": "T16n0694_001:0792c06_3"
    },
    {
        "source_sentence": "五者、諸天之身光潔細妙，非人所覩，以佛神力顯然明著，皆可得見。",
        "translation": "5. The bodies of the gods are shiny, pure, subtle, and marvelous, not seen by humans, but clearly attached by the Buddha's supernormal powers, so they can all be seen.",
        "source": "T16n0694_001:0792c07_4"
    },
    {
        "source_sentence": "爾時世尊從天初下，足蹈寶階。",
        "translation": "At the time, the Bhagavān descended from the beginning of the heavens and walked down the jeweled staircase with his feet.",
        "source": "T16n0694_001:0792c08_5"
    },
    {
        "source_sentence": "梵王在右，手執白蓋；",
        "translation": "The Brahma king was to the right, holding a white canopy in his hand.",
        "source": "T16n0694_001:0792c09_6"
    },
    {
        "source_sentence": "帝釋在左，手持白拂。",
        "translation": "Indra is to the left, holding a white whisk in his hand.",
        "source": "T16n0694_001:0792c10_0"
    },
    {
        "source_sentence": "其餘諸天皆乘虛空，隨佛而下，一時同奏種種音樂，各自捧持幢幡、寶蓋，",
        "translation": "The other heavenly beings all flew up into space, following the Buddha and descending down. All simultaneously playing various kinds of music at once, each holding banners, pennants, jeweled canopies, and so forth.",
        "source": "T16n0694_001:0792c10_1"
    },
    {
        "source_sentence": "散花供養。",
        "translation": "They scattered flowers to make offerings.",
        "source": "T16n0694_001:0792c12_2"
    },
    {
        "source_sentence": "淨居天眾側塞虛空，無量百千諸天婇女，持寶珠、瓔珞歌讚佛德。",
        "translation": "Hundreds of thousands of heavenly maidens, carrying jeweled pearls and jewelry, sang in praise of the Buddha’s virtues.",
        "source": "T16n0694_001:0792c12_3"
    },
    {
        "source_sentence": "復有諸天於虛空中雨種種香及種種花，諸龍雨於微細香雨。",
        "translation": "Again, there are gods raining various kinds of fragrances and flowers in the sky, and dragons raining subtly fragrant rain.",
        "source": "T16n0694_001:0792c13_4"
    },
    {
        "source_sentence": "于時空中淨無雲曀，雷聲美妙，聞者喜悅。",
        "translation": "At that time the sky was clear and there were no clouds in the sky. The sound of thunder was beautiful and delightful, and those who heard it rejoiced.",
        "source": "T16n0694_001:0792c15_5"
    },
    {
        "source_sentence": "揵闥婆神、緊那羅神奏提婆那伽微妙之曲，歌讚如來本生之事。",
        "translation": "The gandharva gods and kiṃnara gods played the subtle song Devadatta, singing praises of the Tathāgata's past lives.",
        "source": "T16n0694_001:0792c16_6"
    },
    {
        "source_sentence": "于時閻浮提內，王及臣人并四眾等，周匝遍滿僧伽尸城，或散香花或持幡蓋，",
        "translation": "At that time in Jambudvlpa the king and his ministers, as well as the fourfold assembly, surrounded the city of Siṃhala and filled it with incense, flowers, banners, pennants, and canopies.",
        "source": "T16n0694_001:0792c17_7"
    },
    {
        "source_sentence": "吹螺擊鼓，種種音樂向空供養，舉手合掌，瞻仰於佛。",
        "translation": "They blow conches and beat the drums, offer various music to the sky as offerings, raise their hands joining their palms, and venerate the Buddha.",
        "source": "T16n0694_001:0792c19_8"
    },
    {
        "source_sentence": "人、天名花，上、下交散，繽紛而下，積至於膝。",
        "translation": "People and gods are called ‘flowers’. The flowers grow from the top to the knees, and when they scatter their blossoms on both sides of the knees it reaches as far down as the knees.",
        "source": "T16n0694_001:0792c20_9"
    },
    {
        "source_sentence": "諸外道眾見斯事者，咸亦發心，歸依禮敬。",
        "translation": "All the heretics who saw these events also became determined to worship and pay homage to them.",
        "source": "T16n0694_001:0792c21_10"
    },
    {
        "source_sentence": "爾時世尊足蹈寶階，次第而下，至於半路。",
        "translation": "It was then that the Bhagavān stepped onto the jeweled staircase at his feet, descended in order, and halfway down the road.",
        "source": "T16n0694_001:0792c23_0"
    },
    {
        "source_sentence": "四天王天即於其所，廣設供養。",
        "translation": "The four heavenly kings and goddesses then made extensive offerings to him.",
        "source": "T16n0694_001:0792c23_1"
    },
    {
        "source_sentence": "此供殊妙，劫初已來，未曾有也！",
        "translation": "This offering is marvelous, unprecedented since the beginning of the eon!",
        "source": "T16n0694_001:0792c24_2"
    },
    {
        "source_sentence": "爾時如來受天供畢，復與大眾巡階而下，至最下級。",
        "translation": "After the Tathāgata had received the heavenly offerings, he went down the staircase with the crowd and descended to the lowest level.",
        "source": "T16n0694_001:0792c26_0"
    },
    {
        "source_sentence": "欲踐地時，其蓮花色比丘尼即變其身，作轉輪王，領四種兵七寶前導，",
        "translation": "When he was about to tread the ground, that lotus-colored bhikṣuṇī transformed her body into a wheel-turning king, leading fourfold army of seven treasures in front of him.",
        "source": "T16n0694_001:0792c27_1"
    },
    {
        "source_sentence": "從空來下疾至佛所。",
        "translation": "He came down from the sky and quickly went to the Buddha.",
        "source": "T16n0694_001:0792c28_2"
    },
    {
        "source_sentence": "諸國王等各興是念：「此轉輪王從何所來？」",
        "translation": "The kings of various countries each had this thought, Where did this wheel-turning king come from?",
        "source": "T16n0694_001:0792c29_3"
    },
    {
        "source_sentence": "于時尊者須菩提在自房中見佛下來，即整衣服，遙申禮敬。",
        "translation": "When Venerable Subhūti saw the Buddha coming down from his room, he adjusted his clothes and paid homage from a distance.",
        "source": "T16n0694_001:0793a01_4"
    },
    {
        "source_sentence": "時蓮花色比丘尼捨輪王身，還復本形，遽即頂禮佛、世尊足。",
        "translation": "The lotus-colored monks and nuns then abandoned the wheel king's body, returned to their original form, and quickly bowed their heads at the feet of the Buddha and Bhagavān.",
        "source": "T16n0694_001:0793a02_5"
    },
    {
        "source_sentence": "爾時世尊種種呵責彼比丘尼，而謂之曰：「汝今知不！",
        "translation": "It was then that the Bhagavān variously rebuked those monks and nuns and said to them, Do you now know?",
        "source": "T16n0694_001:0793a03_6"
    },
    {
        "source_sentence": "須菩提已先禮我。",
        "translation": "Suppository of enlightenment, you must first bow to me.",
        "source": "T16n0694_001:0793a05_7"
    },
    {
        "source_sentence": "汝得誰教，變作輪王？",
        "translation": "Who taught you to transform yourself into a wheel-turning king?",
        "source": "T16n0694_001:0793a05_8"
    },
    {
        "source_sentence": "汝得預出家，受具足戒，已過其分。",
        "translation": "You've been allowed to leave home and receive the full set of precepts, which are more than that.",
        "source": "T16n0694_001:0793a05_9"
    },
    {
        "source_sentence": "汝智慧微少，諂詐無邊，慈悲報恩，如露一滴。",
        "translation": "Your wisdom is slight, your deceitfulness boundless, and your compassionate repayment of kindness is like a drop of water that's exposed.",
        "source": "T16n0694_001:0793a06_10"
    },
    {
        "source_sentence": "豈能於我法中而為上首！」",
        "translation": "How could you be the supreme leader of my teaching!",
        "source": "T16n0694_001:0793a07_11"
    },
    {
        "source_sentence": "時蓮花色比丘尼聞佛教誨，深生愧恥，即白佛言：「世尊！",
        "translation": "When the lotus-colored monks and nuns heard the Buddha's instructions, they became deeply ashamed and said to the Buddha, Bhagavān!",
        "source": "T16n0694_001:0793a08_12"
    },
    {
        "source_sentence": "我今自知為過不少。",
        "translation": "Now, I know for myself that there are many faults.",
        "source": "T16n0694_001:0793a09_13"
    },
    {
        "source_sentence": "從今以往，不敢復更變現神通！」",
        "translation": "From now on, I won't dare to show my supernormal powers again!",
        "source": "T16n0694_001:0793a10_14"
    },
    {
        "source_sentence": "爾時閻浮提內，國王、大臣并四部眾，皆以所持種種供具供養於佛。",
        "translation": "At the time, there were kings, ministers, and four groups of people in Jambudvīpa who made various offerings to the Buddha with the various offerings they carried.",
        "source": "T16n0694_001:0793a11_0"
    },
    {
        "source_sentence": "時優陀延王頂戴佛像，并諸上供珍異之物，至如來所而以奉獻。",
        "translation": "At the time, King Udayana wore an image of the Buddha on his head and presented it to the Tathāgata along with other rare and valuable offerings.",
        "source": "T16n0694_001:0793a12_1"
    },
    {
        "source_sentence": "佛身相好，具足端嚴，在諸天中殊特明顯。",
        "translation": "The Buddha’s body was endowed with such beautiful features and embellishing features that made it so distinctive among the gods.",
        "source": "T16n0694_001:0793a14_0"
    },
    {
        "source_sentence": "譬如滿月離眾雲曀。",
        "translation": "It's like the full moon that's free of clouds and flames.",
        "source": "T16n0694_001:0793a14_1"
    },
    {
        "source_sentence": "所造之像而對於佛，猶如堆阜比須彌山，不可為喻，但有螺髻及以玉毫少似於佛，",
        "translation": "The images he produced looked as if they were mountains like the polar mountain, with conical hair and a little resemblance to the Buddha’s hair.",
        "source": "T16n0694_001:0793a15_2"
    },
    {
        "source_sentence": "而令四眾知是佛像。",
        "translation": "He causes the fourfold assembly to know that it's an image of the Buddha.",
        "source": "T16n0694_001:0793a17_3"
    },
    {
        "source_sentence": "爾時優陀延王白佛言：「世尊！",
        "translation": "It was then that King Udayana said to the Buddha, Bhagavān!",
        "source": "T16n0694_001:0793a18_0"
    },
    {
        "source_sentence": "如來過去於生死中為求菩提，行無量無邊難行苦行，獲是最上微妙之身，",
        "translation": "Formerly the Tathāgata practiced immeasurable, boundless austerities in order to seek enlightenment in birth and death. He attained the supremely subtle body of buddhahood.",
        "source": "T16n0694_001:0793a18_1"
    },
    {
        "source_sentence": "無與等者。",
        "translation": "There's no equal.",
        "source": "T16n0694_001:0793a20_2"
    },
    {
        "source_sentence": "我所造像不似於佛，竊自思惟，深為過咎！」",
        "translation": "My statue doesn't look like the Buddha, so I privately reflect on it, which is deeply unwholesome!",
        "source": "T16n0694_001:0793a20_3"
    },
    {
        "source_sentence": "爾時世尊告彼王言：「非為過咎！",
        "translation": "It was then that the Bhagavān addressed the king, saying, Not a mistake!",
        "source": "T16n0694_001:0793a22_0"
    },
    {
        "source_sentence": "汝今已作無量利益，更無有人與汝等者。",
        "translation": "Now that you've done measureless benefits, there's no one to give them to you.",
        "source": "T16n0694_001:0793a22_1"
    },
    {
        "source_sentence": "汝今於我佛法之中初為軌則，以是因緣故，令無量眾生得大信利。",
        "translation": "Because of these causes and conditions, you've caused measureless sentient beings to attain great faith and benefit.",
        "source": "T16n0694_001:0793a23_2"
    },
    {
        "source_sentence": "汝今已獲無量福德、廣大善根。」",
        "translation": "Now, you've attained measureless merit and vast good roots.",
        "source": "T16n0694_001:0793a25_3"
    },
    {
        "source_sentence": "時天帝釋復告王言：「王今於此勿懷憂懼！",
        "translation": "Śakra then again addressed the king, saying, Now, don't be sad and fearful here, king!",
        "source": "T16n0694_001:0793a25_4"
    },
    {
        "source_sentence": "如來先在天上及此人間，皆稱讚於王造像功德，凡諸天眾悉亦隨喜。",
        "translation": "The Tathāgata had previously praised the king's image-making merits in heaven and here among humans, and all the gods and goddesses likewise rejoiced.",
        "source": "T16n0694_001:0793a26_5"
    },
    {
        "source_sentence": "未來世中有信之人，皆因王故，造佛形像而獲勝福。",
        "translation": "In the future, there will be a faithful person who creates an image of the Buddha because of the king and obtains superior merit because of it.",
        "source": "T16n0694_001:0793a28_6"
    },
    {
        "source_sentence": "王今宜應歡喜自慶！」",
        "translation": "It's appropriate for the king to rejoice and congratulate himself!",
        "source": "T16n0694_001:0793a29_7"
    },
    {
        "source_sentence": "佛說大乘造像功德經卷上",
        "translation": "Foshuo dayan zhi xiuxing gongde jing shou",
        "source": "T16n0694_001:0793b02_0"
    }
]