[
    {
        "source_sentence": "占察善惡業報經卷下(出六根聚經中)天竺三藏菩提燈譯爾時堅淨信菩薩摩訶薩問地藏菩薩摩訶薩言：「云何開示求向大乘者，",
        "translation": "At that time the Bodhisattva Mahāsattva Sthiramati asked the bodhisattva Mahāsattva Kṣitigarbha, “How do you reveal to those who seek the great vehicle of enlightenment?",
        "source": "T17n0839_002:0906c25_0"
    },
    {
        "source_sentence": "進趣方便？」",
        "translation": "the method of advancing?",
        "source": "T17n0839_002:0906c29_1"
    },
    {
        "source_sentence": "地藏菩薩摩訶薩言：「善男子！",
        "translation": "The Earth-Store Bodhisattva Mahāsattva said, Good sons!",
        "source": "T17n0839_002:0906c29_2"
    },
    {
        "source_sentence": "若有眾生欲向大乘者，應當先知最初所行根本之業。",
        "translation": "If there are sentient beings who want to turn toward the great vehicle, they should first know the fundamental karma that they're initially practicing.",
        "source": "T17n0839_002:0907a01_3"
    },
    {
        "source_sentence": "其最初所行根本業者，所謂依止一實境界以修信解，因信解力增長故，",
        "translation": "The fundamental action initially practised is the so-called cultivation of faith and understanding by relying on one real object: because, as a consequence of the increase of the power of faith and understanding, it is said to be acquired.",
        "source": "T17n0839_002:0907a02_4"
    },
    {
        "source_sentence": "速疾得入菩薩種性。",
        "translation": "They'll quickly enter the bodhisattva seed nature.",
        "source": "T17n0839_002:0907a04_5"
    },
    {
        "source_sentence": "所言一實境界者，謂眾生心體，從本以來，不生不滅，自性清淨，無障無礙，",
        "translation": "The expression “one true object” means the essence of sentient beings’ minds. Since the distant past they have not arisen or perished, their intrinsic nature is pure, without obstruction or obstacle.",
        "source": "T17n0839_002:0907a04_6"
    },
    {
        "source_sentence": "猶如虛空。",
        "translation": "It's like space.",
        "source": "T17n0839_002:0907a06_7"
    },
    {
        "source_sentence": "離分別故，平等普遍，無所不至，圓滿十方，究竟一相，無二無別，不變不異，",
        "translation": "Because they are free from discrimination, equanimity is universal, reaching everywhere without exception. They fill the ten directions, ultimately one characteristic, not two, not distinct, unchanging, not different.",
        "source": "T17n0839_002:0907a06_8"
    },
    {
        "source_sentence": "無增無減。",
        "translation": "There's neither increase nor decrease.",
        "source": "T17n0839_002:0907a08_9"
    },
    {
        "source_sentence": "以一切眾生心，一切聲聞、辟支佛心，一切菩薩心，一切諸佛心，皆同不生不滅，",
        "translation": "All sentient beings’ minds, all śrāvakas’ minds, all pratyekabuddhas’ minds, all bodhisattvas’ minds, and all buddhas’ minds are the same: they don’t arise or cease.",
        "source": "T17n0839_002:0907a08_10"
    },
    {
        "source_sentence": "無染寂靜，真如相故。",
        "translation": "The absence of defilement and quiescence, because they are the characteristics of true reality.",
        "source": "T17n0839_002:0907a10_11"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T17n0839_002:0907a10_12"
    },
    {
        "source_sentence": "一切有心起分別者，猶如幻化，無有定實。",
        "translation": "All those who have minds that give rise to discrimination are like illusory transformations, which lack concentration and reality.",
        "source": "T17n0839_002:0907a11_13"
    },
    {
        "source_sentence": "所謂識、受、想、行、憶念、緣慮、覺知等，種種心數，非青非黃，非赤非白，",
        "translation": "The so-called consciousnesses, feelings, perceptions, volitions, recollections, perceptions, conditioning thoughts, awarenesses, and so on, are various mental numbers that are neither blue nor yellow, neither red nor white.",
        "source": "T17n0839_002:0907a12_14"
    },
    {
        "source_sentence": "亦非雜色，無有長短、方圓、大小。",
        "translation": "Nor is it a mixed color, neither long or short, nor square or round, nor large or small.",
        "source": "T17n0839_002:0907a13_15"
    },
    {
        "source_sentence": "乃至盡於十方虛空一切世界，求心形狀，無一區分而可得者。",
        "translation": "Even in all the worlds of space in the ten directions, there's no one who seeks the shape of mind and doesn't have a single distinction that can be obtained.",
        "source": "T17n0839_002:0907a14_16"
    },
    {
        "source_sentence": "但以眾生無明癡闇熏習因緣，現妄境界，令生念著。",
        "translation": "It's simply because sentient beings are perfumed by ignorance, delusion, and darkness that they manifest deluded objects and cause attachment to give rise to mindfulness.",
        "source": "T17n0839_002:0907a15_17"
    },
    {
        "source_sentence": "所謂此心不能自知，妄自謂有，起覺知想，計我、我所，而實無有覺知之想。",
        "translation": "It means that this mind can't know for itself, falsely claiming it to exist, gives rise to perception and perception, imagines self and what belongs to self, and really has no perception or perception.",
        "source": "T17n0839_002:0907a16_18"
    },
    {
        "source_sentence": "以此妄心畢竟無體，不可見故。",
        "translation": "Because this deluded mind absolutely has no body: because it is invisible.",
        "source": "T17n0839_002:0907a18_19"
    },
    {
        "source_sentence": "若無覺知能分別者，則無十方三世一切境界差別之相。",
        "translation": "If there were no perception and cognition that can discriminate, then there wouldn't be the distinctive characteristics of all the objects in the ten directions and three times.",
        "source": "T17n0839_002:0907a19_20"
    },
    {
        "source_sentence": "以一切法皆不能自有，但依妄心分別故有。",
        "translation": "Because all dharmas cannot exist on their own, but exist only in dependence upon deluded mental discrimination.",
        "source": "T17n0839_002:0907a20_21"
    },
    {
        "source_sentence": "所謂一切境界，各各不同，自念為有，知此為自，知彼為他。",
        "translation": "It means that all objects are different, each with its own thought as existence, knowing this is self and knowing that they are for others.",
        "source": "T17n0839_002:0907a21_22"
    },
    {
        "source_sentence": "是故一切法不能自有，則無別異。",
        "translation": "Therefore, all dharmas can't exist on their own, so there are no distinctions or differences.",
        "source": "T17n0839_002:0907a22_23"
    },
    {
        "source_sentence": "唯依妄心，不知不了內自無故，謂有前外境界，妄生種種法想，謂有謂無，",
        "translation": "They rely only on deluded thought, because they do not know and do not understand that it does not exist internally. That is to say, when there is a prior or an external object, deluded conceptions of all kinds of dharmas arise, which are either existent or nonexistent.",
        "source": "T17n0839_002:0907a23_24"
    },
    {
        "source_sentence": "謂彼謂此，謂是謂非，謂好謂惡，乃至妄生無量無邊法想。",
        "translation": "It means that they say this, which is called right and wrong, good and bad, or even deludedly give rise to measureless and limitless conceptions of dharmas.",
        "source": "T17n0839_002:0907a25_25"
    },
    {
        "source_sentence": "當如是知，一切諸法，皆從妄想生，依妄心為本。",
        "translation": "You should thus know that all dharmas arise from deluded conceptions and rely on deluded mind as their root.",
        "source": "T17n0839_002:0907a26_26"
    },
    {
        "source_sentence": "「然此妄心無自相故，亦依境界而有，所謂緣念覺知前境界故，說名為心。",
        "translation": "“However, because this deluded mind has no distinctive characteristics, it also exists in dependence on objects. The so-called conditional awarenesses know the prior objects and therefore are said to be called mind.",
        "source": "T17n0839_002:0907a27_27"
    },
    {
        "source_sentence": "又此妄心與前境界，雖俱相依，起無先後，而此妄心能為一切境界原主。",
        "translation": "Furthermore, even though these deluded states of mind and the prior objects are mutually supporting, there is no prior or subsequent cause for their arising, yet these deluded states of mind can be the original master of all objects.",
        "source": "T17n0839_002:0907a29_28"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T17n0839_002:0907b01_29"
    },
    {
        "source_sentence": "謂依妄心，不了法界一相故，說心有無明。",
        "translation": "It means that it's said that mind has ignorance because it relies on a deluded mind that doesn't understand the single characteristic of the Dharma realm.",
        "source": "T17n0839_002:0907b02_30"
    },
    {
        "source_sentence": "依無明力因故，現妄境界。",
        "translation": "Depending on the power cause of ignorance, they manifest deluded objects.",
        "source": "T17n0839_002:0907b03_31"
    },
    {
        "source_sentence": "亦依無明滅故，一切境界滅，非依一切境界。",
        "translation": "It is also because of the cessation of ignorance that all objects are extinguished, not because of the cessation of all objects.",
        "source": "T17n0839_002:0907b03_32"
    },
    {
        "source_sentence": "自不了故，說境界有。",
        "translation": "Because they do not understand it themselves, they say that the objective world exists.",
        "source": "T17n0839_002:0907b04_33"
    },
    {
        "source_sentence": "無明亦非依境界故，生於無明。",
        "translation": "Neither ignorance nor nescience arises from ignorance because it doesn't rely on the objective world.",
        "source": "T17n0839_002:0907b05_34"
    },
    {
        "source_sentence": "以一切諸佛，於一切境界不生無明故。",
        "translation": "It's because all buddhas don't give rise to ignorance in all realms.",
        "source": "T17n0839_002:0907b05_35"
    },
    {
        "source_sentence": "又復不依境界滅故，無明心滅。",
        "translation": "Also, because it doesn't rely on the cessation of objects, the mind of nescience ceases.",
        "source": "T17n0839_002:0907b06_36"
    },
    {
        "source_sentence": "以一切境界，從本已來，體性自滅，未曾有故。",
        "translation": "It is because the essence of all objects has perished by itself since the distant past, unprecedented.",
        "source": "T17n0839_002:0907b07_37"
    },
    {
        "source_sentence": "因如此義，是故但說一切諸法依心為本。",
        "translation": "Because of this meaning, it's only said that all dharmas rely on mind as the basis and mind as the root.",
        "source": "T17n0839_002:0907b08_38"
    },
    {
        "source_sentence": "當知一切諸法，悉名為心，以義、體不異，為心所攝故。",
        "translation": "You should know that all dharmas are all called mind because their meaning and essence are not different, because they are included in the mind.",
        "source": "T17n0839_002:0907b09_39"
    },
    {
        "source_sentence": "又一切諸法，從心所起，與心作相，和合而有，共生共滅，同無有住。",
        "translation": "Also, all dharmas arise from the mental states. They are combined with the mind as their distinctive characteristics and exist in conjunction with it. Co-arising and co-cessation are the same: they have no abiding.",
        "source": "T17n0839_002:0907b10_40"
    },
    {
        "source_sentence": "以一切境界，但隨心所緣，念念相續故，而得住持，暫時為有。",
        "translation": "Because all objects are only conditioned by mental activities, they abide for a certain period of time in each and every thought.",
        "source": "T17n0839_002:0907b12_41"
    },
    {
        "source_sentence": "「如是所說心義者，有二種相。",
        "translation": "“Thus, these are two kinds of characteristics that explain the meaning of mind.",
        "source": "T17n0839_002:0907b13_42"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T17n0839_002:0907b14_43"
    },
    {
        "source_sentence": "一者心內相，二者心外相。",
        "translation": "One is the internal characteristic of mind, and the other is the external characteristic of mind.",
        "source": "T17n0839_002:0907b14_44"
    },
    {
        "source_sentence": "心內相者，復有二種。",
        "translation": "Also, there are two kinds of internal characteristics of mind:",
        "source": "T17n0839_002:0907b14_45"
    },
    {
        "source_sentence": "云何為二？",
        "translation": "What are these two?",
        "source": "T17n0839_002:0907b15_46"
    },
    {
        "source_sentence": "一者真，二者妄。",
        "translation": "One is true, and the other is false.",
        "source": "T17n0839_002:0907b15_47"
    },
    {
        "source_sentence": "所言真者，謂心體本相，如如不異，清淨圓滿，無障無礙，微密難見，",
        "translation": "The expression “true” means that the essence of mind is its original characteristic, which is thus and thus without dissimilarity, pure and complete, unobstructed and unhindered, subtle and difficult to see.",
        "source": "T17n0839_002:0907b16_0"
    },
    {
        "source_sentence": "以遍一切處，常恒不壞，建立生長一切法故。",
        "translation": "It pervades all places, being constant and indestructible, because it establishes the growth of all dharmas.",
        "source": "T17n0839_002:0907b17_1"
    },
    {
        "source_sentence": "所言妄者，謂起念、分別、覺知、緣慮、憶想等事，雖復相續，能生一切種種境界，",
        "translation": "The expression ‘false’ means that thoughts, imaginations, ideas, feelings, perceptions, conditioned states of consciousness, recollections, etc., although they continue in a series, can give rise to all kinds of objects.",
        "source": "T17n0839_002:0907b18_2"
    },
    {
        "source_sentence": "而內虛偽，無有真實，不可見故。",
        "translation": "The internal is false, but there's no reality because it can't be seen.",
        "source": "T17n0839_002:0907b20_3"
    },
    {
        "source_sentence": "所言心外相者，謂一切諸法種種境界等，隨有所念，境界現前故，知有內心及外心差別。",
        "translation": "The expression external characteristics of the mind means that all dharmas have various objects, such as various objects and so forth. They are known to exist internally or externally because they appear when one is mindful of them.",
        "source": "T17n0839_002:0907b20_4"
    },
    {
        "source_sentence": "如是當知，內妄想者，為因為體。",
        "translation": "Thus, you should know that internal deluded perception is the essence of cause.",
        "source": "T17n0839_002:0907b22_5"
    },
    {
        "source_sentence": "外妄相者，為果為用。",
        "translation": "The outward mark of delusion is for fruit and for function.",
        "source": "T17n0839_002:0907b23_6"
    },
    {
        "source_sentence": "依如此等義，是故我說一切諸法悉名為心。",
        "translation": "Based on these meanings, I therefore say that all dharmas are all called mind.",
        "source": "T17n0839_002:0907b24_7"
    },
    {
        "source_sentence": "「又復當知，心外相者，如夢所見種種境界，唯心想作，無實外事。",
        "translation": "“Furthermore, you should also know that external characteristics of mind are like the various objects seen in a dream, which are created only by mental perception and no real external things.",
        "source": "T17n0839_002:0907b25_8"
    },
    {
        "source_sentence": "一切境界，悉亦如是，以皆依無明識夢所見，妄想作故。",
        "translation": "The same applies to all objects: because they all depend on ignorance, consciousness and what is seen in a dream®*”’: because of being made by deluded conceptual identification.",
        "source": "T17n0839_002:0907b26_9"
    },
    {
        "source_sentence": "「復次，應知內心念念不住故，所見、所緣一切境界亦隨心念念不住，",
        "translation": "“Furthermore, you should know that because your mind doesn’t abide in internal thought, all objects seen and perceived as objects also don’t abide in the mind.",
        "source": "T17n0839_002:0907b27_10"
    },
    {
        "source_sentence": "所謂心生故種種法生，心滅故種種法滅。",
        "translation": "It's called the arising of various dharmas because the mind arises, and the cessation of various dharmas because the mind ceases.",
        "source": "T17n0839_002:0907b29_11"
    },
    {
        "source_sentence": "而生滅相，但有名字，實不可得。",
        "translation": "But the characteristic of arising and ceasing has only names, which are really unknowable.",
        "source": "T17n0839_002:0907c01_12"
    },
    {
        "source_sentence": "以心不往至於境界，境界亦不來至於心。",
        "translation": "Because the mind doesn't go to the objective realm, and the objective realm doesn't come to the mind.",
        "source": "T17n0839_002:0907c01_13"
    },
    {
        "source_sentence": "如鏡中像，無來無去。",
        "translation": "It's like an image in a mirror that has no coming and no going.",
        "source": "T17n0839_002:0907c02_14"
    },
    {
        "source_sentence": "是故一切法，求生滅定相，了不可得。",
        "translation": "Therefore, all dharmas that seek the characteristics of arising and ceasing concentration are ungraspable.",
        "source": "T17n0839_002:0907c03_15"
    },
    {
        "source_sentence": "所謂一切法畢竟無體，本來常空，實不生滅故。",
        "translation": "It means that all dharmas are ultimately without substance, originally eternally empty because they really don't arise or cease.",
        "source": "T17n0839_002:0907c04_16"
    },
    {
        "source_sentence": "如是一切法實不生滅者，則無一切境界差別之相，寂靜一味，名為真如第一義諦，",
        "translation": "Thus, if all dharmas really don’t arise and cease, then there are no distinctions in all objects. Quiescence and unity of flavor are called the ultimate truth of true suchness.",
        "source": "T17n0839_002:0907c05_17"
    },
    {
        "source_sentence": "自性清淨心。",
        "translation": "It's the mind that's inherently pure and pure.",
        "source": "T17n0839_002:0907c07_18"
    },
    {
        "source_sentence": "彼自性清淨心，湛然圓滿，以無分別相故。",
        "translation": "That self-nature is pure mind, perfectly complete because it has no discriminating characteristics.",
        "source": "T17n0839_002:0907c07_19"
    },
    {
        "source_sentence": "無分別相者，於一切處，無所不在。",
        "translation": "The absence of discriminating characteristics means that there's nothing in all places that isn't present.",
        "source": "T17n0839_002:0907c08_20"
    },
    {
        "source_sentence": "無所不在者，以能依持建立一切法故。",
        "translation": "Nothing is absent because it's able to support and establish all dharmas.",
        "source": "T17n0839_002:0907c09_21"
    },
    {
        "source_sentence": "「復次，彼心名如來藏，所謂具足無量無邊不可思議無漏清淨功德之業。",
        "translation": "“Furthermore, that mind is called the tathāgatagarbha, which is said to be replete with measureless, limitless, inconceivable, uncontaminated, pure, and pure virtuous actions.",
        "source": "T17n0839_002:0907c10_0"
    },
    {
        "source_sentence": "以諸佛法身，從無始本際來，無障無礙，自在不滅，一切現化種種功業，",
        "translation": "Because the reality body of buddhas comes from beginningless time, unobstructed, unhindered, unimpeded, never ceasing—all they do is to manifest various meritorious deeds.",
        "source": "T17n0839_002:0907c11_1"
    },
    {
        "source_sentence": "恒常熾然，未曾休息。",
        "translation": "They are always blazing with fervor, never ceasing.",
        "source": "T17n0839_002:0907c13_2"
    },
    {
        "source_sentence": "所謂遍一切世界，皆示作業，種種化益故。",
        "translation": "It's called pervading all worlds and showing the benefits of various transformations.",
        "source": "T17n0839_002:0907c13_3"
    },
    {
        "source_sentence": "以一佛身，即是一切諸佛身。",
        "translation": "Because one buddha-body is the body of all buddhas.",
        "source": "T17n0839_002:0907c14_4"
    },
    {
        "source_sentence": "一切諸佛身，即是一佛身。",
        "translation": "The bodies of all buddhas are one buddha-body.",
        "source": "T17n0839_002:0907c15_5"
    },
    {
        "source_sentence": "所有作業亦皆共一，所謂無分別相，不念彼此，平等無二。",
        "translation": "Their actions are all in common, which is called having no discriminating characteristics, not mindful of each other, equal and nondual.",
        "source": "T17n0839_002:0907c15_6"
    },
    {
        "source_sentence": "以依一法性而有作業，同自然化，體無別異故。",
        "translation": "Because there is an action that depends on a single dharma-nature. It is the same as spontaneous transformation, because its essence has no distinctions or differences.",
        "source": "T17n0839_002:0907c17_7"
    },
    {
        "source_sentence": "如是諸佛法身，遍一切處，圓滿不動故，隨諸眾生死此生彼，恒為作依。",
        "translation": "In this way, the reality-body of buddhas pervades all places. Because it is perfect and unshakable, they always serve as supports for sentient beings who die here and are reborn there.",
        "source": "T17n0839_002:0907c18_8"
    },
    {
        "source_sentence": "譬如虛空，悉能容受一切色像種種形類，以一切色像種種形類，皆依虛空而有，",
        "translation": "And just as space is able to contain all forms and shapes, so are all forms and shapes supported by space.",
        "source": "T17n0839_002:0907c19_9"
    },
    {
        "source_sentence": "建立生長。",
        "translation": "It establishes growth.",
        "source": "T17n0839_002:0907c21_10"
    },
    {
        "source_sentence": "住虛空中，為虛空處所攝。",
        "translation": "They live in space, and they're included in the space realm.",
        "source": "T17n0839_002:0907c21_11"
    },
    {
        "source_sentence": "以虛空為體，無有能出虛空界分者。",
        "translation": "Space is the essence, and there's no part that can escape from the space realm.",
        "source": "T17n0839_002:0907c22_12"
    },
    {
        "source_sentence": "當知色像之中，虛空之界不可毀滅。",
        "translation": "You should know that within form and images, the space realm can't be destroyed.",
        "source": "T17n0839_002:0907c23_13"
    },
    {
        "source_sentence": "色像終壞時，還歸虛空。",
        "translation": "When the form and images finally disintegrate, they return back to space.",
        "source": "T17n0839_002:0907c24_14"
    },
    {
        "source_sentence": "而虛空本界，無增無減，不動不變。",
        "translation": "The original realm of space, however, neither increases nor decreases, and it doesn't move or change.",
        "source": "T17n0839_002:0907c24_15"
    },
    {
        "source_sentence": "諸佛法身，亦復如是，悉能容受一切眾生種種果報。",
        "translation": "The Dharma body of buddhas is also like this, able to contain the various rewards that all sentient beings experience.",
        "source": "T17n0839_002:0907c25_16"
    },
    {
        "source_sentence": "以一切眾生種種果報，皆依諸佛法身而有建立生長。",
        "translation": "Because all sentient beings are variously rewarded, they all rely on the Dharma body of the buddhas to establish and grow.",
        "source": "T17n0839_002:0907c26_17"
    },
    {
        "source_sentence": "住法身中，為法身處所攝。",
        "translation": "He abides in the Dharma body, which is included in the Dharma body realm.",
        "source": "T17n0839_002:0907c27_18"
    },
    {
        "source_sentence": "以法身為體，無有能出法身界分者。",
        "translation": "Because the Dharma body is the essence, there's no part that can escape from the Dharma body realm.",
        "source": "T17n0839_002:0907c28_19"
    },
    {
        "source_sentence": "「當知一切眾生身中，諸佛法身亦不可毀滅。",
        "translation": "You should know that in the bodies of all sentient beings, the Dharma body of the buddhas can't be disparaged or extinguished.",
        "source": "T17n0839_002:0907c29_20"
    },
    {
        "source_sentence": "若煩惱斷壞時，還歸法身。",
        "translation": "When the defilements are abandoned and disintegrated, they return to the Dharma body.",
        "source": "T17n0839_002:0908a01_21"
    },
    {
        "source_sentence": "而法身本界，無增無減，不動不變。",
        "translation": "The original realm of the Dharma body is neither increasing nor decreasing, and it doesn't move or change.",
        "source": "T17n0839_002:0908a01_22"
    },
    {
        "source_sentence": "但從無始世來，與無明心俱，癡闇因緣熏習力故，現妄境界。",
        "translation": "But since beginningless time it has been associated with the mind of ignorance. Because of the permeating power of the causes and conditions of delusion and darkness, it manifests a false sphere.",
        "source": "T17n0839_002:0908a02_23"
    },
    {
        "source_sentence": "以依妄境界熏習因緣故，起妄想相應心，計我、我所，造集諸業，受生死苦，",
        "translation": "Because they rely on the permeation of deluded objects as causes and conditions, they give rise to deluded thoughts associated with conceptions that impute self and what belongs to self, create actions, and experience the suffering of birth and death.",
        "source": "T17n0839_002:0908a03_24"
    },
    {
        "source_sentence": "說彼法身名為眾生。",
        "translation": "They say that the Dharma body is called sentient beings.",
        "source": "T17n0839_002:0908a05_25"
    },
    {
        "source_sentence": "若如是眾生中，法身熏習而有力者，煩惱漸薄，能厭世間，求涅槃道，",
        "translation": "Among sentient beings who are thus permeated by the Dharma body and powerful, their afflictions will gradually diminish. They will be able to become disgusted with the world and seek the path of nirvana.",
        "source": "T17n0839_002:0908a06_26"
    },
    {
        "source_sentence": "信歸一實，修六波羅蜜等一切菩提分法，名為菩薩。",
        "translation": "To believe in one reality and cultivate all the factors of enlightenment, such as the six perfections, is called a bodhisattva.",
        "source": "T17n0839_002:0908a07_27"
    },
    {
        "source_sentence": "若如是菩薩中，修行一切善法滿足，究竟得離無明睡者，轉名為佛。",
        "translation": "If such a bodhisattva cultivates all good qualities, fulfills them, and ultimately attains freedom from the sleep of ignorance, he'll be called a buddha.",
        "source": "T17n0839_002:0908a08_28"
    },
    {
        "source_sentence": "當知如是眾生、菩薩、佛等，但依世間假名言說，故有差別。",
        "translation": "You should know that such sentient beings, bodhisattvas, buddhas, and so forth simply rely on worldly conventional names and words to make distinctions.",
        "source": "T17n0839_002:0908a10_29"
    },
    {
        "source_sentence": "而法身之體，畢竟平等，無有異相。",
        "translation": "The essence of the Dharma body, however, is ultimately equal and has no different characteristics.",
        "source": "T17n0839_002:0908a11_30"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T17n0839_002:0908a12_31"
    },
    {
        "source_sentence": "是名略說一實境界義。",
        "translation": "This is called a brief explanation of the meaning of the single real objective realm.",
        "source": "T17n0839_002:0908a12_32"
    },
    {
        "source_sentence": "若欲依一實境界修信解者，應當學習二種觀道。",
        "translation": "If you want to cultivate faith and understanding based on the single realm, you should cultivate two kinds of contemplation paths.",
        "source": "T17n0839_002:0908a13_33"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T17n0839_002:0908a14_34"
    },
    {
        "source_sentence": "一者唯心識觀，二者真如實觀。",
        "translation": "One is the contemplation of mind consciousness-only, and the other is the true contemplation of reality.",
        "source": "T17n0839_002:0908a14_35"
    },
    {
        "source_sentence": "學唯心識觀者，所謂於一切時一切處，隨身口意所有作業，悉當觀察，",
        "translation": "Those who study contemplation of mind and consciousness only—that is to say, they should observe all the actions of body, speech, and thought in all places at all times.",
        "source": "T17n0839_002:0908a15_36"
    },
    {
        "source_sentence": "知唯是心。",
        "translation": "They know that it's only mind.",
        "source": "T17n0839_002:0908a16_37"
    },
    {
        "source_sentence": "乃至一切境界，若心住念，皆當察知，勿令使心無記攀緣，不自覺知。",
        "translation": "If the mind abides in mindfulness of all objects, it should be observed and known, so that it doesn't cause the mind to cling to indeterminate objects and don't perceive them on its own.",
        "source": "T17n0839_002:0908a16_38"
    },
    {
        "source_sentence": "於念念間，悉應觀察。",
        "translation": "In every moment of thought, they should all be observed.",
        "source": "T17n0839_002:0908a18_39"
    },
    {
        "source_sentence": "隨心有所緣念，還當使心隨逐彼念，令心自知。",
        "translation": "Mindfulness that follows the mind and has perceptual objects, it should also cause the mind to follow those perceptual objects and let the mind know for itself.",
        "source": "T17n0839_002:0908a18_40"
    },
    {
        "source_sentence": "知己內心自生想念，非一切境界有念有分別也。",
        "translation": "They know that they themselves give rise to thoughts and thoughts within their own minds, not that all objects have thoughts and distinctions.",
        "source": "T17n0839_002:0908a20_0"
    },
    {
        "source_sentence": "所謂內心自生長短、好惡、是非、得失、衰利、有無等見，無量諸想。",
        "translation": "The so-called internal mind is self-generating, short, good and bad, right and wrong, gain and loss, loss and gain, unequal views, and measureless conceptions.",
        "source": "T17n0839_002:0908a21_1"
    },
    {
        "source_sentence": "而一切境界，未曾有想，起於分別。",
        "translation": "But all objects have never been conceptualized, and they give rise to discrimination.",
        "source": "T17n0839_002:0908a22_2"
    },
    {
        "source_sentence": "「當知一切境界自無分別想故，即自非長非短、非好非惡，乃至非有非無，",
        "translation": "“You should know that all objects themselves have no discriminating conceptions, which are neither long nor short, neither good nor bad, up to neither existent nor nonexistent.",
        "source": "T17n0839_002:0908a23_3"
    },
    {
        "source_sentence": "離一切相。",
        "translation": "They're free of all marks.",
        "source": "T17n0839_002:0908a24_4"
    },
    {
        "source_sentence": "如是觀察，一切法唯心想生。",
        "translation": "Observing it this way, all things are produced only by mind and perception.",
        "source": "T17n0839_002:0908a25_0"
    },
    {
        "source_sentence": "若使離心，則無一法一想而能自見有差別也。",
        "translation": "If they were to part with mind, then there wouldn't be a single thing or perception that would allow them to see for themselves that there are distinctions.",
        "source": "T17n0839_002:0908a25_1"
    },
    {
        "source_sentence": "常應如是守記內心，知唯妄念，無實境界，勿令休廢。",
        "translation": "They should always thus keep track of their minds and internally know that they are only deluded thoughts with no real object, so they won't let them stop.",
        "source": "T17n0839_002:0908a26_2"
    },
    {
        "source_sentence": "是名修學唯心識觀。",
        "translation": "This is called cultivating the contemplation of mind and consciousness-only.",
        "source": "T17n0839_002:0908a27_3"
    },
    {
        "source_sentence": "若心無記，不知自心念者，即謂有前境界，不名唯心識觀。",
        "translation": "If the mind is indeterminate and doesn't know self-mindfulness, it means there's a prior objective realm that isn't called contemplation of mind consciousness only.",
        "source": "T17n0839_002:0908a28_4"
    },
    {
        "source_sentence": "「又守記內心者，則知貪想、瞋想，及愚癡、邪見想。",
        "translation": "Also, someone who guards their mind internally knows thoughts of craving, thoughts of anger, and thoughts of folly and wrong views.",
        "source": "T17n0839_002:0908a29_5"
    },
    {
        "source_sentence": "知善、知不善、知無記，知心勞慮種種諸苦。",
        "translation": "Knowing what’s good, knowing what’s unwholesome and knowing what’s indeterminate, they know the various kinds of suffering of mental exertion.",
        "source": "T17n0839_002:0908b01_6"
    },
    {
        "source_sentence": "若於坐時，隨心所緣，念念觀知唯心生滅。",
        "translation": "When he's sitting, he follows the perceptual objects of his mind and observes them moment after moment to know that only mind arises and ceases.",
        "source": "T17n0839_002:0908b02_7"
    },
    {
        "source_sentence": "譬如水流燈炎，無暫時住。",
        "translation": "It's like the water-flowing lamp that doesn't abide for a while.",
        "source": "T17n0839_002:0908b03_8"
    },
    {
        "source_sentence": "從是當得色寂三昧。",
        "translation": "From this, he'll attain the samādhi of form and quiescence.",
        "source": "T17n0839_002:0908b04_9"
    },
    {
        "source_sentence": "「得此三昧已，次應學習信奢摩他觀心，及信毗婆舍那觀心。",
        "translation": "“After attaining this concentration, you should next cultivate faith in the contemplation mind of calmness and faith in the contemplation mind of vipaśyanā.",
        "source": "T17n0839_002:0908b04_10"
    },
    {
        "source_sentence": "習信奢摩他觀心者，思惟內心不可見相，圓滿不動，無來無去，本性不生，",
        "translation": "Those who practice faith in quietude contemplate the mind by reflecting on internally invisible characteristics, which are perfect and unmoving, have neither coming nor going, and are inherently unarisen.",
        "source": "T17n0839_002:0908b06_0"
    },
    {
        "source_sentence": "離分別故。",
        "translation": "It's because they're free of discrimination.",
        "source": "T17n0839_002:0908b07_1"
    },
    {
        "source_sentence": "習信毗婆舍那觀心者，想見內外色，隨心生，隨心滅。",
        "translation": "Those who practice faith in Vipaśyanā's contemplation of mind see internal and external forms that arise according to the mind and cease according to the mind.",
        "source": "T17n0839_002:0908b07_2"
    },
    {
        "source_sentence": "乃至習想見佛色身，亦復如是。",
        "translation": "It's likewise with the conditioned perception of seeing the Buddha's form body.",
        "source": "T17n0839_002:0908b09_3"
    },
    {
        "source_sentence": "隨心生，隨心滅，如幻如化，如水中月，如鏡中像。",
        "translation": "Whatever arises and ceases according to the mind, it's like an illusion or a transformation, like the moon in water or an image in a mirror.",
        "source": "T17n0839_002:0908b09_4"
    },
    {
        "source_sentence": "非心不離心，非來非不來，非去非不去，非生非不生，非作非不作。",
        "translation": "It's neither mind nor mind that doesn't part from mind, neither comes nor doesn't come, neither goes nor doesn't go, neither arises nor doesn't arise, and neither does it or doesn't do it.",
        "source": "T17n0839_002:0908b10_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T17n0839_002:0908b12_6"
    },
    {
        "source_sentence": "若能習信此二觀心者，速得趣會一乘之道。",
        "translation": "If someone can cultivate faith in these two contemplations, they'll quickly attain the path of the single-vehicle assembly.",
        "source": "T17n0839_002:0908b12_7"
    },
    {
        "source_sentence": "當知如是唯心識觀，名為最上智慧之門。",
        "translation": "You should know that this contemplation of mind and consciousness-only is called the supreme gate of wisdom.",
        "source": "T17n0839_002:0908b13_8"
    },
    {
        "source_sentence": "所謂能令其心猛利，長信解力，疾入空義，得發無上大菩提心故。",
        "translation": "It's called being able to cause their minds to become vigorous, long believe in the power of understanding, quickly enter emptiness, and attain the intention to give rise to the unsurpassed great awakening.",
        "source": "T17n0839_002:0908b14_9"
    },
    {
        "source_sentence": "若學習真如實觀者，思惟心性無生無滅，不住見聞覺知，永離一切分別之想。",
        "translation": "If someone studies the true contemplation of reality, they contemplate that the mind's nature is neither arising nor ceasing, don't abide in seeing, hearing, apprehending, and knowing, and are permanently free of all discriminating conceptions.",
        "source": "T17n0839_002:0908b15_10"
    },
    {
        "source_sentence": "漸漸能過空處、識處、無少處、非想非非想處等定境界相，得相似空三昧。",
        "translation": "Gradually, he's able to go beyond the sphere of emptiness, the sphere of consciousness, the sphere of nothingness, the sphere of neither perception nor non-perception, and so forth, and attain the samādhi of similar emptiness.",
        "source": "T17n0839_002:0908b17_11"
    },
    {
        "source_sentence": "得相似空三昧時，識想受行麁分別相不現在前。",
        "translation": "When he attains the samādhi of similar emptiness, the distinctive characteristics of consciousness, perception, feeling, volition, and gross discrimination don't appear in front of him.",
        "source": "T17n0839_002:0908b19_12"
    },
    {
        "source_sentence": "從此修學，為善知識大慈悲者守護長養，是故離諸障礙，勤修不廢，展轉能入心寂三昧。",
        "translation": "He cultivates it from this because he's guarded and nurtured by a good teacher with great compassion, so he's free of obstructions, diligently cultivates it without fail, and can gradually enter the samādhi of mental quiescence.",
        "source": "T17n0839_002:0908b20_13"
    },
    {
        "source_sentence": "得是三昧已，即復能入一行三昧。",
        "translation": "After attaining this concentration, he's also able to enter one-line samādhi.",
        "source": "T17n0839_002:0908b22_14"
    },
    {
        "source_sentence": "入是一行三昧已，見佛無數，發深廣行心，住堅信位。",
        "translation": "Having entered this one-line concentration, he saw countless buddhas, aroused the mind of profound and extensive practice, and abided in the state of firm faith.",
        "source": "T17n0839_002:0908b23_15"
    },
    {
        "source_sentence": "所謂於奢摩他、毗婆舍那二種觀道，決定信解，能決定向。",
        "translation": "The so-called two kinds of contemplation paths of quietude and vipaśyanā are certain to believe and understand, and they can be certain to dedicate themselves to them.",
        "source": "T17n0839_002:0908b24_16"
    },
    {
        "source_sentence": "隨所修學世間諸禪三昧之業，無所樂著。",
        "translation": "He follows the worldly activities of meditation and samādhi that he cultivates, with no desire or attachment.",
        "source": "T17n0839_002:0908b25_17"
    },
    {
        "source_sentence": "乃至遍修一切善根菩提分法，於生死中無所怯畏，不樂二乘。",
        "translation": "He cultivates all the factors of enlightenment that are good roots, has no fear in birth-and-death, and doesn't delight in the two vehicles.",
        "source": "T17n0839_002:0908b26_18"
    },
    {
        "source_sentence": "以依能習向二觀心最妙巧便，眾智所依，行根本故。",
        "translation": "It's the most subtle and skillful way to rely on the mind that's cultivated and directed toward the two contemplations, and it's the basis for all kinds of cognition because it's the root of practice.",
        "source": "T17n0839_002:0908b28_0"
    },
    {
        "source_sentence": "「復次，修學如上信解者，人有二種。",
        "translation": "“Furthermore, there are two kinds of people who cultivate faith and understanding as above.",
        "source": "T17n0839_002:0908b29_1"
    },
    {
        "source_sentence": "何等為二？",
        "translation": "What are these two?",
        "source": "T17n0839_002:0908c01_0"
    },
    {
        "source_sentence": "一者利根，二者鈍根。",
        "translation": "The first is with keen faculties and the second with dull faculties.",
        "source": "T17n0839_002:0908c01_1"
    },
    {
        "source_sentence": "其利根者，先已能知一切外諸境界，唯心所作，虛誑不實，如夢如幻等，",
        "translation": "Those with sharp faculties have already been able to know all external objects that are only mentally created, false and insubstantial, like dreams or illusions.",
        "source": "T17n0839_002:0908c01_2"
    },
    {
        "source_sentence": "決定無有疑慮。",
        "translation": "It's certain that there's no doubt.",
        "source": "T17n0839_002:0908c03_3"
    },
    {
        "source_sentence": "陰蓋輕微，散亂心少。",
        "translation": "The aggregates and hindrances are slight and the mind is distracted with few.",
        "source": "T17n0839_002:0908c03_4"
    },
    {
        "source_sentence": "如是等人，即應學習真如實觀。",
        "translation": "Such people should then study the true contemplation of reality as it is.",
        "source": "T17n0839_002:0908c04_5"
    },
    {
        "source_sentence": "其鈍根者，先未能知一切外諸境界，悉唯是心，虛誑不實故，染著情厚，",
        "translation": "Those with dull faculties are not able to know that all external objects are only mind, because they are false and unreal, defiled by thirstlike attachment.",
        "source": "T17n0839_002:0908c04_6"
    },
    {
        "source_sentence": "蓋障數起，心難調伏，應當先學唯心識觀。",
        "translation": "Because the obstacles that arise repeatedly are difficult to subdue in the mind, you should first train in contemplation of mind and consciousness only.",
        "source": "T17n0839_002:0908c06_7"
    },
    {
        "source_sentence": "「若人雖學如是信解，而善根業薄，未能進趣。",
        "translation": "“Suppose a person trains in such faith and understanding but their good roots and karma are weak and they can’t advance.",
        "source": "T17n0839_002:0908c07_8"
    },
    {
        "source_sentence": "諸惡煩惱，不得漸伏。",
        "translation": "The bad afflictions can't be gradually subdued.",
        "source": "T17n0839_002:0908c08_9"
    },
    {
        "source_sentence": "其心疑怯，畏墮三惡道，生八難處。",
        "translation": "Their minds are doubtful and frightened, afraid of falling into the three bad destinies and being born in the eight difficult places.",
        "source": "T17n0839_002:0908c08_10"
    },
    {
        "source_sentence": "畏不常值佛菩薩等，不得供養聽受正法。",
        "translation": "They're afraid that they won't always meet buddhas, bodhisattvas, and so forth, and won't be able to make offerings or listen to the right teaching.",
        "source": "T17n0839_002:0908c09_11"
    },
    {
        "source_sentence": "畏菩提信難可成就。",
        "translation": "They fear that it's difficult to attain enlightenment and believe in it.",
        "source": "T17n0839_002:0908c10_12"
    },
    {
        "source_sentence": "有如此疑怖及種種障礙等者，應於一切時一切處，常勤誦念我之名字。",
        "translation": "If someone has such doubts, fears, various obstacles, and so forth, they should always diligently recite my name at all times and places.",
        "source": "T17n0839_002:0908c10_13"
    },
    {
        "source_sentence": "若得一心，善根增長，其意猛利，當觀我法身，及一切諸佛法身，與己自身，",
        "translation": "If you attain one-pointedness of mind, increase in roots of goodness, and have strong intentions, observe my Dharma body, the Dharma bodies of all buddhas, and your own body.",
        "source": "T17n0839_002:0908c12_14"
    },
    {
        "source_sentence": "體性平等，無二無別，不生不滅，常樂我淨，功德圓滿，是可歸依。",
        "translation": "Their essence and nature are equanimous, without duality or distinction, neither arising nor ceasing, always blissful and self-pure, perfected in virtue—this is the basis on which to turn.",
        "source": "T17n0839_002:0908c14_15"
    },
    {
        "source_sentence": "「又復觀察己身心相，無常、苦、無我、不淨，如幻如化，是可厭離。",
        "translation": "Again, he observes the characteristics of his own body and mind as impermanent, painful, selfless, and impure, like illusions and transformations, which are to be abandoned.",
        "source": "T17n0839_002:0908c15_16"
    },
    {
        "source_sentence": "若能修學如是觀者，速得增長淨信之心，所有諸障，漸漸損減。",
        "translation": "If someone can cultivate such contemplation, they'll quickly grow a pure mind of faith, and the hindrances that exist will gradually decrease.",
        "source": "T17n0839_002:0908c16_17"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T17n0839_002:0908c18_18"
    },
    {
        "source_sentence": "此人名為學習聞我名者，亦能學習聞十方諸佛名者；",
        "translation": "These people I call those who study and hear my name. They are also able to study and hear the names of the buddhas of the ten directions.",
        "source": "T17n0839_002:0908c18_19"
    },
    {
        "source_sentence": "名為學至心禮拜供養我者，亦能學至心禮拜供養十方諸佛者；",
        "translation": "They are called those who study and wholeheartedly venerate and make offerings to themselves. They can also study and wholeheartedly venerate and make offerings to the Buddhas of the ten directions.",
        "source": "T17n0839_002:0908c19_20"
    },
    {
        "source_sentence": "名為學聞大乘深經者；",
        "translation": "They are called those who study and hear the profound scriptures of the Great Vehicle.",
        "source": "T17n0839_002:0908c21_21"
    },
    {
        "source_sentence": "名為學執持書寫供養恭敬大乘深經者；",
        "translation": "They are called those who study, preserve, write, make offerings, and venerate the profound scriptures of the Great Vehicle.",
        "source": "T17n0839_002:0908c21_22"
    },
    {
        "source_sentence": "名為學受持讀誦大乘深經者；",
        "translation": "They are called those who study, receive, preserve, and recite the profound scriptures of the Great Vehicle.",
        "source": "T17n0839_002:0908c22_23"
    },
    {
        "source_sentence": "名為學遠離邪見，於深正義中不墮謗者；",
        "translation": "They are said to be training in being free from wrong views, not falling into falsehoods in the profound truth.",
        "source": "T17n0839_002:0908c23_24"
    },
    {
        "source_sentence": "名為於究竟甚深第一實義中學信解者；",
        "translation": "They are called those who have faith and understanding in the ultimate, profound, supremely true doctrine.",
        "source": "T17n0839_002:0908c24_25"
    },
    {
        "source_sentence": "名為能除諸罪障者；",
        "translation": "They are called those who can remove the obstacles of sin.",
        "source": "T17n0839_002:0908c25_26"
    },
    {
        "source_sentence": "名為當得無量功德聚者。",
        "translation": "They're called those who will attain an immeasurable stock of merit.",
        "source": "T17n0839_002:0908c25_27"
    },
    {
        "source_sentence": "此人捨身，終不墮惡道、八難之處，還聞正法，習信修行，亦能隨願往生他方淨佛國土。",
        "translation": "They will abandon their bodies and never fall into the evil destinies or the eight difficulties of rebirth. Having heard the true Dharma again, they will become accustomed to faith and practice it. They will also be able to follow their vows and be reborn elsewhere in a pure buddha-lands.",
        "source": "T17n0839_002:0908c26_28"
    },
    {
        "source_sentence": "「復次，若人欲生他方現在淨佛國者，應當隨彼世界佛之名字，專意誦念，",
        "translation": "“Furthermore, if someone wants to be born in another buddha-field, they should follow the names of the buddhas of those buddha-fields and concentrate on reciting them.",
        "source": "T17n0839_002:0908c28_29"
    },
    {
        "source_sentence": "一心不亂。",
        "translation": "With one mind, it's not disturbed.",
        "source": "T17n0839_002:0908c29_30"
    },
    {
        "source_sentence": "如上觀察者，決定得生彼佛淨國，善根增長，速獲不退。",
        "translation": "Those who observe it as above will surely be born in that pure land of buddhahood, where their good roots grow and they'll quickly attain nonretrogression.",
        "source": "T17n0839_002:0909a01_31"
    },
    {
        "source_sentence": "當知如上一心係念思惟諸佛平等法身，一切善根中，其業最勝。",
        "translation": "You should know that the above-mentioned mind is engaged in contemplating the buddhas' equal Dharma body, and among all good roots, its actions are the most superior.",
        "source": "T17n0839_002:0909a02_32"
    },
    {
        "source_sentence": "所謂勤修習者，漸漸能向一行三昧。",
        "translation": "The so-called diligent cultivation is the gradual ability to turn toward a single practice of concentration.",
        "source": "T17n0839_002:0909a03_33"
    },
    {
        "source_sentence": "若到一行三昧者，則成廣大微妙行心，名得相似無生法忍。",
        "translation": "If someone reaches the one-line samādhi, then they'll become a vast and subtle mind of practice, which is called attaining the patience of similar nonarising dharmas.",
        "source": "T17n0839_002:0909a04_34"
    },
    {
        "source_sentence": "以能得聞我名字故，亦能得聞十方諸佛名字故；",
        "translation": "Because they are able to hear my names, and also can hear the names of the buddhas of the ten directions.",
        "source": "T17n0839_002:0909a06_0"
    },
    {
        "source_sentence": "以能至心禮拜供養我故，亦能至心禮拜供養十方諸佛故。",
        "translation": "Because they can wholeheartedly venerate and make offerings to me, they can also wholeheartedly venerate and make offerings to the buddhas of the ten directions.",
        "source": "T17n0839_002:0909a07_1"
    },
    {
        "source_sentence": "以能得聞大乘深經故，能執持書寫供養恭敬大乘深經故，能受持讀誦大乘深經故。",
        "translation": "It's because they can hear the profound scriptures of the great vehicle and be able to retain, write, make offerings, venerate, and respect the profound scriptures of the great vehicle, and they can memorize and recite the profound scriptures of the great vehicle.",
        "source": "T17n0839_002:0909a08_2"
    },
    {
        "source_sentence": "能於究竟甚深第一實義中不生怖畏，遠離誹謗，得正見心，能信解故。",
        "translation": "They are able to be free of fear in regard to the ultimate, profound, and supremely true doctrine. Being far removed from slander, they attain a mind imbued with right view because they can believe and understand it.",
        "source": "T17n0839_002:0909a10_3"
    },
    {
        "source_sentence": "決定除滅諸罪障故，現證無量功德聚故。",
        "translation": "It's because it's certain to remove the hindrances of sin and now realize an immeasurable stock of merit.",
        "source": "T17n0839_002:0909a12_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T17n0839_002:0909a12_1"
    },
    {
        "source_sentence": "謂無分別菩提心，寂靜智現，起發方便業，種種願行故。",
        "translation": "They are the nondiscriminating mind of enlightenment, the manifestation of quiescent knowledge, and the initiation of skillful means because of various vows and practices.",
        "source": "T17n0839_002:0909a13_2"
    },
    {
        "source_sentence": "能聞我名者，謂得決定信利益行故。",
        "translation": "Those who can hear my name are those who attain certain faith and benefit from practice.",
        "source": "T17n0839_002:0909a14_3"
    },
    {
        "source_sentence": "乃至一切所能者，皆得不退一乘因故。",
        "translation": "It's because all those who are capable attain the cause of nonretrogression in the One Vehicle.",
        "source": "T17n0839_002:0909a15_4"
    },
    {
        "source_sentence": "若雜亂垢心，雖復稱誦我之名字，而不名為聞。",
        "translation": "If someone's mind is mixed with defilement, even though they recite my name, it's not called hearing.",
        "source": "T17n0839_002:0909a16_5"
    },
    {
        "source_sentence": "以不能生決定信解，但獲世間善報，不得廣大深妙利益。",
        "translation": "Because they can't give rise to definite faith and understanding, they simply attain the good rewards of the world and don't attain vast and profound benefits.",
        "source": "T17n0839_002:0909a17_6"
    },
    {
        "source_sentence": "如是雜亂垢心，隨其所修一切諸善，皆不能得深大利益。",
        "translation": "Such a mixed, defiled mind doesn't attain profound and great benefit from all the goodness they cultivate.",
        "source": "T17n0839_002:0909a18_7"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T17n0839_002:0909a19_8"
    },
    {
        "source_sentence": "當知如上勤心修學無相禪者，不久能獲深大利益，漸次作佛。",
        "translation": "You should know that someone who diligently cultivates signless meditation as above will soon attain profound great benefit and gradually become a buddha.",
        "source": "T17n0839_002:0909a20_0"
    },
    {
        "source_sentence": "「深大利益者，所謂得入堅信之位，成就信忍故。",
        "translation": "Profound and great benefits are those who attain the stage of entering firm faith because they've accomplished the forbearance of faith.",
        "source": "T17n0839_002:0909a21_1"
    },
    {
        "source_sentence": "入堅法位，成就順忍故。",
        "translation": "He enters the stage of firm dharmas because he accomplishes the patience that follows.",
        "source": "T17n0839_002:0909a22_2"
    },
    {
        "source_sentence": "入正真位，成就無生忍故。",
        "translation": "He enters the stage of right and true because he accomplishes the forbearance of nonarising.",
        "source": "T17n0839_002:0909a23_3"
    },
    {
        "source_sentence": "又成就信忍者，能作如來種性故。",
        "translation": "Also, someone who has accomplished the ninja of faith is able to create the Tathāgata's seed nature.",
        "source": "T17n0839_002:0909a23_4"
    },
    {
        "source_sentence": "成就順忍者，能解如來行故。",
        "translation": "A person who has accomplished the practice of following nirvāṇa is able to understand the Tathāgata's actions.",
        "source": "T17n0839_002:0909a24_5"
    },
    {
        "source_sentence": "成就無生忍者，得如來業故。",
        "translation": "Accomplishing the ninja of nonarising is because they've attained the Tathāgata's actions.",
        "source": "T17n0839_002:0909a25_6"
    },
    {
        "source_sentence": "「漸次作佛者，略說有四種。",
        "translation": "“In brief, there are four kinds of gradually becoming buddhas:",
        "source": "T17n0839_002:0909a25_7"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T17n0839_002:0909a26_8"
    },
    {
        "source_sentence": "一者，信滿法故作佛。",
        "translation": "One is that they become buddhas because they believe in the fulfillment of the Dharma.",
        "source": "T17n0839_002:0909a26_9"
    },
    {
        "source_sentence": "所謂依種性地，決定信諸法不生不滅，清淨平等，無可願求故。",
        "translation": "The so-called ground of relying on seed nature determines that the dharmas don't arise or cease, are pure and equal, and there's nothing to wish for.",
        "source": "T17n0839_002:0909a27_0"
    },
    {
        "source_sentence": "二者，解滿法故作佛。",
        "translation": "The second is that they become buddhas because they understand the fulfillment of the teaching.",
        "source": "T17n0839_002:0909a28_1"
    },
    {
        "source_sentence": "所謂依解行地，深解法性，知如來業無造無作，於生死涅槃不起二想，",
        "translation": "They know the deeds of buddhas are uncreated and unmanifest; they do not give rise to any ideation of birth, death, or nirvana.",
        "source": "T17n0839_002:0909a28_2"
    },
    {
        "source_sentence": "心無所怖故。",
        "translation": "It's because the mind has no fear.",
        "source": "T17n0839_002:0909b01_3"
    },
    {
        "source_sentence": "三者，證滿法故作佛。",
        "translation": "Three, they become buddhas because they realize the fulfillment of the teaching.",
        "source": "T17n0839_002:0909b01_4"
    },
    {
        "source_sentence": "所謂依淨心地，以得無分別寂靜法智，及不思議自然之業，無求想故。",
        "translation": "It's called relying on the pure mind ground to attain nondiscriminating, tranquil dharmic cognition and inconceivable natural actions because there are no thoughts of seeking.",
        "source": "T17n0839_002:0909b02_5"
    },
    {
        "source_sentence": "四者，一切功德行滿足故作佛。",
        "translation": "Fourth, he becomes a buddha because all his virtuous actions are fulfilled.",
        "source": "T17n0839_002:0909b03_6"
    },
    {
        "source_sentence": "所謂依究竟菩薩地，能除一切諸障，無明夢盡故。",
        "translation": "It's called relying on the ultimate bodhisattva ground, which removes all hindrances and ends the dream of ignorance.",
        "source": "T17n0839_002:0909b04_7"
    },
    {
        "source_sentence": "「復次，當知，若修學世間有相禪者，有三種。",
        "translation": "“Furthermore, you should know that there are three kinds of people who cultivate markless meditation in the world.",
        "source": "T17n0839_002:0909b05_8"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T17n0839_002:0909b06_9"
    },
    {
        "source_sentence": "一者，無方便信解力故，貪受諸禪三昧功德而生憍慢，為禪所縛，退求世間。",
        "translation": "One, because of the power of faith and understanding without skillful means, they crave the merits of meditation and samādhi and become conceited, are bound by meditation, and regress in search of the world.",
        "source": "T17n0839_002:0909b06_10"
    },
    {
        "source_sentence": "二者，無方便信解力故，依禪發起偏厭離行，怖怯生死，退墮二乘。",
        "translation": "Second, because of the power of faith and understanding without skillful means, they rely on meditation to give rise to partial disillusionment with free practices, become frightened by birth and death, and regress into the two vehicles.",
        "source": "T17n0839_002:0909b08_11"
    },
    {
        "source_sentence": "三者，有方便信解力，所謂依止一實境界，習近奢摩他、毗婆舍那二種觀道故，",
        "translation": "The third is the power of faith and understanding through skillful means, which is to say that they rely on a single reality as their support because they are accustomed to the two kinds of contemplation paths of quietude and vipaśyanā:",
        "source": "T17n0839_002:0909b09_12"
    },
    {
        "source_sentence": "能信解一切法唯心想生，如夢如幻等。",
        "translation": "They can believe that all dharmas are produced only by mental perception, like dreams and illusions.",
        "source": "T17n0839_002:0909b11_13"
    },
    {
        "source_sentence": "雖獲世間諸禪功德，而不堅著，不復退求三有之果。",
        "translation": "Even though they attain the worldly virtues of meditation, they aren't firmly attached, and they don't regress or seek the results of the three existences.",
        "source": "T17n0839_002:0909b12_14"
    },
    {
        "source_sentence": "又信知生死即涅槃故，亦不怖怯，退求二乘。",
        "translation": "Also, because they believe that birth and death are nirvāṇa, they aren't afraid or frightened, and retreat to pursue the two vehicles.",
        "source": "T17n0839_002:0909b13_15"
    },
    {
        "source_sentence": "「如是修學一切諸禪三昧法者，當知有十種次第相門，具足攝取禪定之業，",
        "translation": "“Thus, when someone cultivates all the teachings of meditation and concentration, they should know that there are ten kinds of sequential approaches that fully embody the practice of collecting meditation.",
        "source": "T17n0839_002:0909b14_16"
    },
    {
        "source_sentence": "能令學者成就相應，不錯不謬。",
        "translation": "It can cause scholars to accomplish what's associated with it, which is neither right nor wrong.",
        "source": "T17n0839_002:0909b16_17"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T17n0839_002:0909b17_18"
    },
    {
        "source_sentence": "一者，攝念方便相。",
        "translation": "One is that it collects the characteristic of mindfulness of skillful means.",
        "source": "T17n0839_002:0909b17_19"
    },
    {
        "source_sentence": "二者，欲住境界相。",
        "translation": "The second is the characteristic mark of the realm where desire abides.",
        "source": "T17n0839_002:0909b17_20"
    },
    {
        "source_sentence": "三者，初住境界，分明了了知出、知入相。",
        "translation": "3. The first is the objective realm of abiding, which clearly understands and knows the characteristics of entry and exit.",
        "source": "T17n0839_002:0909b18_21"
    },
    {
        "source_sentence": "四者，善住境界得堅固相。",
        "translation": "4. The well-abiding objective realm attains a resolute characteristic.",
        "source": "T17n0839_002:0909b19_22"
    },
    {
        "source_sentence": "五者，所作思惟，方便勇猛，轉求進趣相。",
        "translation": "The fifth is the characteristic of the contemplation that is undertaken, which is skillful means and courageous, and which develops in the aspect of seeking advancement.",
        "source": "T17n0839_002:0909b19_23"
    },
    {
        "source_sentence": "六者，漸得調順，稱心喜樂，除疑信解，自安慰相。",
        "translation": "The sixth is the characteristic of gradually attaining composure, which is called joy and happiness in one’s heart. One rids himself of doubt and believes in what he has been taught, and comforts himself by remonstrating with it.",
        "source": "T17n0839_002:0909b20_24"
    },
    {
        "source_sentence": "七者，剋獲勝進，意所專者，少分相應，覺知利益相。",
        "translation": "The seventh is that they attain superior advancement and concentrate their minds, which are partially associated with the characteristic of perception and benefit.",
        "source": "T17n0839_002:0909b21_25"
    },
    {
        "source_sentence": "八者，轉修增明，所習堅固，得勝功德，對治成就相；",
        "translation": "The eighth is the characteristic of increasing enlightenment by means of spiritual cultivation, which is steadfast in what it practices and acquires superior qualities.",
        "source": "T17n0839_002:0909b22_26"
    },
    {
        "source_sentence": "九者，隨心有所念作，外現功德，如意相應，不錯不謬相。",
        "translation": "(9) Whatever is mentally generated, it manifests virtue externally. It is associated with supernormal power and has the characteristic of being neither good nor bad.",
        "source": "T17n0839_002:0909b23_27"
    },
    {
        "source_sentence": "十者，若更異修，依前所得而起方便，次第成就，出入隨心，超越自在相。",
        "translation": "Tenth, if they cultivate it differently, they give rise to skillful means based on what they've previously attained, accomplish them in order, follow their minds as they go out and come in, and transcend the characteristic of self-dependence.",
        "source": "T17n0839_002:0909b25_28"
    },
    {
        "source_sentence": "是名十種次第相門，攝修禪定之業。」",
        "translation": "These are called the ten kinds of sequential approach that collect and cultivate the karma of meditation.",
        "source": "T17n0839_002:0909b26_29"
    },
    {
        "source_sentence": "爾時，堅淨信菩薩摩訶薩問地藏菩薩摩訶薩言：「汝云何巧說深法，能令眾生得離怯弱？」",
        "translation": "It was then that the Bodhisattva Mahāsattva of Firm Faith asked the Earth-Store Bodhisattva Mahāsattva, How can you skillfully explain the profound teaching so that sentient beings will be freed from their timidity?",
        "source": "T17n0839_002:0909b28_0"
    },
    {
        "source_sentence": "地藏菩薩摩訶薩言：「善男子！",
        "translation": "The Earth-Store Bodhisattva Mahāsattva said, Good sons!",
        "source": "T17n0839_002:0909b29_1"
    },
    {
        "source_sentence": "當知初學發意，求向大乘，未得信心者，於無上道甚深之法，喜生疑怯。",
        "translation": "You should know that those who are beginning to learn and give rise to the intention to seek the great vehicle but haven't yet attained faith, delight in the profound teaching of the unsurpassed path and become doubtful.",
        "source": "T17n0839_002:0909c01_2"
    },
    {
        "source_sentence": "我常以方便，宣顯實義而安慰之，令離怯弱，是故號我為善安慰說者。",
        "translation": "I always use skillful means to proclaim the true meaning and comfort them, so that they're freed from their timidity. That's why I'm called a well-advised speaker of comfort.",
        "source": "T17n0839_002:0909c03_3"
    },
    {
        "source_sentence": "云何安慰？",
        "translation": "What is comforting?",
        "source": "T17n0839_002:0909c04_4"
    },
    {
        "source_sentence": "所謂鈍根小心眾生，聞無上道最勝最妙，意雖貪樂，發心願向。",
        "translation": "The so-called dull-rooted sentient beings of caution hear that the unsurpassed path is most excellent and most marvelous, and although their minds crave pleasure, they arouse the intention to wish for it.",
        "source": "T17n0839_002:0909c05_5"
    },
    {
        "source_sentence": "而復思念求無上道者，要須積功廣極，難行苦行，自度度他，劫數長遠，",
        "translation": "Again, those who seek the unsurpassed path need to accumulate exertion of effort. They must undergo difficult and painful practices for an extremely long period of time in order to save themselves and others.",
        "source": "T17n0839_002:0909c06_6"
    },
    {
        "source_sentence": "於生死中久受勤苦，方乃得獲。",
        "translation": "Only after enduring long suffering in birth and death can they attain it.",
        "source": "T17n0839_002:0909c08_7"
    },
    {
        "source_sentence": "以是之故，心生怯弱。",
        "translation": "Because of this, their minds become weak.",
        "source": "T17n0839_002:0909c08_8"
    },
    {
        "source_sentence": "我即為說真實之義，所謂一切諸法，本性自空，畢竟無我，無作無受，",
        "translation": "I will explain the true meaning of all things, which are inherently empty by their own nature, ultimately selfless, unmanifest, and ungraspable.",
        "source": "T17n0839_002:0909c09_9"
    },
    {
        "source_sentence": "無自無他，無行無到，無有方所，亦無過去現在、未來。",
        "translation": "They have no self, no others, no practice, no destination, no direction, and no past, present, or future.",
        "source": "T17n0839_002:0909c10_10"
    },
    {
        "source_sentence": "乃至為說十八空等，無有生死、涅槃一切諸法定實之相而可得者。",
        "translation": "Even in order to explain the 18 kinds of emptiness and so forth, there's no birth-and-death or nirvāṇa that can be attained by all the true characteristics of dharmas.",
        "source": "T17n0839_002:0909c12_0"
    },
    {
        "source_sentence": "又復為說一切諸法如幻如化，如水中月，如鏡中像，如乾闥婆城，如空谷響，",
        "translation": "They also teach that all things are like illusions, like magic tricks, like the moon in water, like reflections in a mirror, like the city of Gandhāra, like the sound of an empty valley.",
        "source": "T17n0839_002:0909c13_1"
    },
    {
        "source_sentence": "如陽焰，如泡，如露，如燈，如目[目*壹]，如夢，如電，如雲。",
        "translation": "It's like a mirage, like a bubble, like a dew, like a lamp, like the eyes [eyes*i], like a dream, like a flash of lightning, and like a cloud.",
        "source": "T17n0839_002:0909c15_2"
    },
    {
        "source_sentence": "煩惱生死，性甚微弱，易可令滅。",
        "translation": "The defilements of birth and death are so weak by nature that they can easily be extinguished.",
        "source": "T17n0839_002:0909c16_3"
    },
    {
        "source_sentence": "又煩惱生死，畢竟無體，求不可得。",
        "translation": "Also, the afflictions of birth and death have no essence after all, so they can't be sought.",
        "source": "T17n0839_002:0909c16_4"
    },
    {
        "source_sentence": "本來不生，實更無滅。",
        "translation": "Originally it does not arise, but in reality it does not perish.",
        "source": "T17n0839_002:0909c17_5"
    },
    {
        "source_sentence": "自性寂靜，即是涅槃。",
        "translation": "The quiescence of its own nature is nirvāṇa.",
        "source": "T17n0839_002:0909c18_6"
    },
    {
        "source_sentence": "如此所說，能破一切諸見，損自身心執著想故，得離怯弱。",
        "translation": "Such a teaching refutes all views and harms the perception of attachment in one's own mind, thereby attaining freedom from timidity.",
        "source": "T17n0839_002:0909c18_7"
    },
    {
        "source_sentence": "「復有眾生，不解如來言說旨意故而生怯弱。",
        "translation": "Again, there are sentient beings who become weak because they don't understand the Tathāgata's words and intentions.",
        "source": "T17n0839_002:0909c19_8"
    },
    {
        "source_sentence": "當知如來言說旨意者，所謂如來見彼一實境界故，究竟得離生老病死眾惡之法，",
        "translation": "“Good son, it should be known that the meaning of what the Tathagata explains is this: Because the Tathagata sees a single reality realm, he has attained ultimately freedom from the evil states of birth, old age, sickness, and death.",
        "source": "T17n0839_002:0909c20_9"
    },
    {
        "source_sentence": "證彼法身常恒清涼不變異等無量功德聚。",
        "translation": "He realizes that the Dharma body is always constant, clear, cool, unchanging, and so forth, which are measureless lumps of merit.",
        "source": "T17n0839_002:0909c22_10"
    },
    {
        "source_sentence": "復能了了見一切眾生身中，皆有如是真實微妙清淨功德，而為無明闇染之所覆障，",
        "translation": "They can also see all beings’ bodies with such true, subtle, pure qualities, yet they are hindered by the darkness of ignorance.",
        "source": "T17n0839_002:0909c23_11"
    },
    {
        "source_sentence": "長夜恒受生老病死無量眾苦。",
        "translation": "For a long time, they'll always experience birth, old age, illness, and death with measureless suffering.",
        "source": "T17n0839_002:0909c25_12"
    },
    {
        "source_sentence": "如來於此起大慈悲意，欲令一切眾生離於眾苦，同獲法身第一義樂。",
        "translation": "Regarding this, the Tathāgata arouses great compassion and wants to cause all sentient beings to be freed from suffering and attain the supreme bliss of the Dharma body together.",
        "source": "T17n0839_002:0909c26_13"
    },
    {
        "source_sentence": "而彼法身，是無分別離念之法。",
        "translation": "The Dharma body, however, is a nondiscriminating and mindless dharma.",
        "source": "T17n0839_002:0909c28_0"
    },
    {
        "source_sentence": "唯有能滅虛妄識想不起念著，乃所應得。",
        "translation": "Only that which is capable of annihilating false consciousnesses and conceptions and not the mental attachment to them should be attained.",
        "source": "T17n0839_002:0909c28_1"
    },
    {
        "source_sentence": "但一切眾生，常樂分別取著諸法，以顛倒妄想故而受生死。",
        "translation": "But all sentient beings always delight in discriminating and clinging to dharmas, and they experience birth and death because of mistaken deluded thoughts.",
        "source": "T17n0839_002:0909c29_2"
    },
    {
        "source_sentence": "「是故如來為欲令彼離於分別執著想故，說一切世間法，畢竟體空無所有。",
        "translation": "Therefore, the Tathāgata explains that all worldly dharmas are ultimately empty in essence and have no existence because he wants to cause them to part with discriminating conceptions of attachment.",
        "source": "T17n0839_002:0910a01_3"
    },
    {
        "source_sentence": "乃至一切出世間法，亦畢竟體空無所有。",
        "translation": "Even all the supramundane dharmas are ultimately empty in essence and have no existence.",
        "source": "T17n0839_002:0910a03_4"
    },
    {
        "source_sentence": "若廣說者，如十八空。",
        "translation": "If it's explained in detail, it's like the 18 kinds of emptiness.",
        "source": "T17n0839_002:0910a04_5"
    },
    {
        "source_sentence": "如是顯示一切諸法，皆不離菩提體。",
        "translation": "Thus, it shows that all dharmas are not separate from the essence of enlightenment.",
        "source": "T17n0839_002:0910a05_0"
    },
    {
        "source_sentence": "菩提體者，非有、非無、非非有、非非無、非有無俱，非一、非異、非非一、非非異、非一異俱。",
        "translation": "The essence of enlightenment is that it's neither existent nor nonexistent, neither existent nor nonexistent, neither existent nor nonexistent, neither existent nor nonexistent, neither unitary nor dissimilar, neither neither unitary nor dissimilar.",
        "source": "T17n0839_002:0910a05_1"
    },
    {
        "source_sentence": "乃至畢竟無有一相而可得者，以離一切相故。",
        "translation": "It's because there's no single characteristic that can be obtained after all because it's free of all characteristics.",
        "source": "T17n0839_002:0910a07_2"
    },
    {
        "source_sentence": "離一切相者，所謂不可依言說取。",
        "translation": "Being free of all characteristics means that they can't rely on verbal grasping.",
        "source": "T17n0839_002:0910a08_3"
    },
    {
        "source_sentence": "以菩提法中，無有受言說者，及無能言說者故。",
        "translation": "In the teaching of enlightenment, there's no one who receives words and says it, and there's no one who can say it.",
        "source": "T17n0839_002:0910a09_4"
    },
    {
        "source_sentence": "又不可依心念知。",
        "translation": "Furthermore, they can't rely on the mind to know it.",
        "source": "T17n0839_002:0910a10_5"
    },
    {
        "source_sentence": "以菩提法中，無有能取、可取，無自無他，離分別想故。",
        "translation": "In the teaching of enlightenment, there's nothing that can be grasped and nothing that can be grasped, and there's no self and nothing else, because it's free of discriminating conceptions.",
        "source": "T17n0839_002:0910a11_0"
    },
    {
        "source_sentence": "若有分別想者，則為虛偽，不名相應。",
        "translation": "If there are discriminating conceptions, then they're false and aren't called associated.",
        "source": "T17n0839_002:0910a12_1"
    },
    {
        "source_sentence": "「如是等說，鈍根眾生不能解者，謂無上道如來法身但唯空法，一向畢竟而無所有，",
        "translation": "“Such teachings are said to be incomprehensible to sentient beings with dull faculties: The Dharma body of the Buddha of the unsurpassed path consists only of empty dharmas, which are absolutely ultimate and nonexistent.",
        "source": "T17n0839_002:0910a13_0"
    },
    {
        "source_sentence": "其心怯弱，畏墮無所得中。",
        "translation": "Their minds are weak, and they're afraid of falling into the ungraspable.",
        "source": "T17n0839_002:0910a14_1"
    },
    {
        "source_sentence": "或生斷滅想，作增減見，轉起誹謗，自輕輕他。",
        "translation": "Or they may give rise to the perception of cessation and create views of increase and decrease, which in turn denigrate themselves and blame others.",
        "source": "T17n0839_002:0910a15_2"
    },
    {
        "source_sentence": "我即為說如來法身，自性不空，有真實體，具足無量清淨功業。",
        "translation": "I will then explain for you that the essence of the body of reality of the Tathagata is not empty by its own nature. It has real substance and is endowed with immeasurable pure and genuine merits.",
        "source": "T17n0839_002:0910a16_3"
    },
    {
        "source_sentence": "從無始世來，自然圓滿，非修非作。",
        "translation": "Since beginningless time, it's naturally perfected, neither cultivated nor done.",
        "source": "T17n0839_002:0910a17_4"
    },
    {
        "source_sentence": "乃至一切眾生身中，亦皆具足，不變不異，無增無減。",
        "translation": "Even in the bodies of all sentient beings, they are also fully endowed, unchanging and unchanging, neither increasing nor decreasing.",
        "source": "T17n0839_002:0910a18_5"
    },
    {
        "source_sentence": "如是等說，能除怯弱，是名安慰。",
        "translation": "Such explanations can remove weakness, which is called comforting.",
        "source": "T17n0839_002:0910a19_6"
    },
    {
        "source_sentence": "「又復，愚癡堅執眾生，聞如是等說亦生怯弱。",
        "translation": "Again, sentient beings who are ignorant and firmly attached will also become weak when they hear such a teaching.",
        "source": "T17n0839_002:0910a20_7"
    },
    {
        "source_sentence": "以取如來法身本來滿足，非修非作相故，起無所得想而生怯弱，或計自然墮邪倒見。",
        "translation": "Because they grasp the originally fulfilled Dharma body of the Tathāgata, which is neither cultivated nor done, they give rise to conceptions of nongrasping and become cowardly, or they may believe that they'll naturally fall into mistaken views.",
        "source": "T17n0839_002:0910a21_8"
    },
    {
        "source_sentence": "我即為說修行一切善法，增長滿足，生如來色身，得無量功德清淨果報。",
        "translation": "I then explained for them the cultivation of all good qualities, their growth and fulfillment, birth in the form body of the Tathāgata, and attaining the pure fruit of immeasurable merit.",
        "source": "T17n0839_002:0910a23_9"
    },
    {
        "source_sentence": "如此等說，令離怯弱，是為安慰。",
        "translation": "This is called comforting because it frees one from weakness.",
        "source": "T17n0839_002:0910a25_10"
    },
    {
        "source_sentence": "而我所說甚深之義，真實相應，無有諸過，以離相違說故。",
        "translation": "The profound meaning of what I teach is truly concomitant with reality, and there are no errors because it's explained in a way that's free of contradictions.",
        "source": "T17n0839_002:0910a25_11"
    },
    {
        "source_sentence": "云何知離相違相？",
        "translation": "How do we know that they are free of contradictory characteristics?",
        "source": "T17n0839_002:0910a27_12"
    },
    {
        "source_sentence": "所謂如來法身中，雖復無有言說境界，離心想念，非空非不空。",
        "translation": "It means that even though there's no verbal sphere in the Tathāgata's Dharma body, it's free of mind and perception, neither empty nor nonempty.",
        "source": "T17n0839_002:0910a27_13"
    },
    {
        "source_sentence": "乃至無一切相，不可依言說示，而據世諦幻化因緣假名法中，相待相對，",
        "translation": "It does not have all characteristics, and cannot be expressed in words. Instead, it follows the conventional truth that dharmas are illusory, conditioned, and provisionally named, dependent on one another.",
        "source": "T17n0839_002:0910a29_14"
    },
    {
        "source_sentence": "則可方便顯示而說。",
        "translation": "Then they can skillfully show it and explain it.",
        "source": "T17n0839_002:0910b01_15"
    },
    {
        "source_sentence": "以彼法身性實無分別，離自相、離他相，無空、無不空，乃至遠離一切諸相故，",
        "translation": "Because the essence of that Dharma body is really nondiscriminating, free of its own characteristics and other characteristics, without emptiness or nonemptyness, up to being far removed from all characteristics.",
        "source": "T17n0839_002:0910b02_16"
    },
    {
        "source_sentence": "說彼法體為畢竟空無所有。",
        "translation": "It's said that the essence of those dharmas is ultimately empty and nonexistent.",
        "source": "T17n0839_002:0910b03_17"
    },
    {
        "source_sentence": "以離心分別，想念則盡，無一相而能自見自知為有，是故空義決定真實，",
        "translation": "Because it is free of mental discrimination, each thought perishes. It has no single characteristic but can see and know for itself that it exists. That is why the meaning of emptiness is definitely real.",
        "source": "T17n0839_002:0910b04_18"
    },
    {
        "source_sentence": "相應不謬。",
        "translation": "It's not mistaken to associate with it.",
        "source": "T17n0839_002:0910b06_19"
    },
    {
        "source_sentence": "「復次，即彼空義中，以離分別妄想心念故，則盡畢竟無有一相而可空者，",
        "translation": "“Furthermore, in that meaning of emptiness, because they are free of discriminating deluded conceptions and thoughts, there is ultimately no single characteristic that can be emptiness.",
        "source": "T17n0839_002:0910b07_0"
    },
    {
        "source_sentence": "以唯有真實故，即為不空。",
        "translation": "It's because there's only reality, which is nonempty.",
        "source": "T17n0839_002:0910b08_1"
    },
    {
        "source_sentence": "所謂離識想故，無有一切虛偽之相，畢竟常恒，不變不異，以更無一相可壞可滅，",
        "translation": "It means that because they are free of conscious constructions, they do not have all the characteristics of falsehood. They are ultimately permanent and eternal, unchanging and immutable, because there is no single characteristic that can be broken or destroyed.",
        "source": "T17n0839_002:0910b09_2"
    },
    {
        "source_sentence": "離增減故。",
        "translation": "It's because it's free of increase and decrease.",
        "source": "T17n0839_002:0910b11_3"
    },
    {
        "source_sentence": "又彼無分別實體之處，從無始世來，具無量功德自然之業，成就相應，",
        "translation": "Furthermore, the sphere of nondiscriminating entities has been endowed since beginningless time with immeasurable virtues that are naturally accompanied by their accomplishment.",
        "source": "T17n0839_002:0910b11_4"
    },
    {
        "source_sentence": "不離不脫故，說為不空。",
        "translation": "Because they are neither separated nor liberated, they're said to be nonempty.",
        "source": "T17n0839_002:0910b12_5"
    },
    {
        "source_sentence": "如是實體功德之聚，一切眾生雖復有之，但為無明曀覆障故而不知見，",
        "translation": "Such is the aggregate of essence and virtue that all sentient beings have, but they don’t know or see because ignorance obscures them.",
        "source": "T17n0839_002:0910b13_6"
    },
    {
        "source_sentence": "不能剋獲功德利益，與無莫異，說名未有。",
        "translation": "They can't grasp the benefits of merit and virtue, which are no different from nothing, and they're said to be called nonexistent.",
        "source": "T17n0839_002:0910b15_7"
    },
    {
        "source_sentence": "以不知見彼法體故，所有功德利益之業，非彼眾生所能受用，不名屬彼。",
        "translation": "Because they don't know and see the essence of that teaching, their merits and benefits are not shared by those sentient beings, and they aren't called belonging to them.",
        "source": "T17n0839_002:0910b16_0"
    },
    {
        "source_sentence": "唯依遍修一切善法，對治諸障，見彼法身，然後剋獲功德利益，是故說修一切善法，",
        "translation": "They rely only on the pervasive cultivation of all wholesome states to counteract their obstacles, and they see the body of reality. Only then will they attain merit and benefit. That is why they are said to cultivate all wholesome states.",
        "source": "T17n0839_002:0910b17_1"
    },
    {
        "source_sentence": "生如來色身、智身。",
        "translation": "They give rise to the form body and wisdom body of the Tathāgata.",
        "source": "T17n0839_002:0910b19_2"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T17n0839_002:0910b19_3"
    },
    {
        "source_sentence": "如我所說甚深之義，決定真實，離相違過，當如是知。」",
        "translation": "As I've explained the profound meaning, it's definitely true and free of contradictions, so you should know it this way.",
        "source": "T17n0839_002:0910b20_4"
    },
    {
        "source_sentence": "爾時，地藏菩薩摩訶薩說如此等殊勝方便深要法門時，有十萬億眾生，",
        "translation": "At the time, when the earth-store bodhisattva Mahāsattva had taught such a profound teaching of superior skill in means, there were one hundred trillion sentient beings.",
        "source": "T17n0839_002:0910b21_5"
    },
    {
        "source_sentence": "發阿耨多羅三藐三菩提心，住堅信位。",
        "translation": "They give rise to the mind of unsurpassed, correct, and complete enlightenment and abide in the stage of firm faith.",
        "source": "T17n0839_002:0910b22_6"
    },
    {
        "source_sentence": "復有九萬八千菩薩，得無生法忍。",
        "translation": "Again, there were 98,000 bodhisattvas who attained the tolerance of the nonarising of the Dharma.",
        "source": "T17n0839_002:0910b23_7"
    },
    {
        "source_sentence": "一切大眾各以天香花供養於佛，及供養地藏菩薩摩訶薩。",
        "translation": "All the people in the assembly offered heavenly flowers to the Buddha and made offerings to the Earth-Store Bodhisattva Mahāsattva.",
        "source": "T17n0839_002:0910b24_8"
    },
    {
        "source_sentence": "爾時，佛告諸大眾言：「汝等各各應當受持此法門，隨所住處，廣令流布。",
        "translation": "At that point, the Buddha addressed the masses, saying, Each of you should accept this teaching and spread it widely wherever you live.",
        "source": "T17n0839_002:0910b25_9"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T17n0839_002:0910b27_10"
    },
    {
        "source_sentence": "如此法門，甚為難值，能大利益。",
        "translation": "Such a dharma-gate is extremely difficult to encounter and greatly beneficial.",
        "source": "T17n0839_002:0910b27_11"
    },
    {
        "source_sentence": "若人得聞彼地藏菩薩摩訶薩名號，及信其所說者，當知是人速能得離一切所有諸障礙事，",
        "translation": "If someone hears the names of those bodhisattvas and mahāsattvas of the earth-store enlightening beings and believes what they teach, know that such people will be able to quickly escape all kinds of obstacles.",
        "source": "T17n0839_002:0910b28_12"
    },
    {
        "source_sentence": "疾至無上道。」",
        "translation": "They'll quickly reach the unsurpassed path.",
        "source": "T17n0839_002:0910c01_13"
    },
    {
        "source_sentence": "於是大眾皆同發言：「我當受持，流布世間，不敢令忘。」",
        "translation": "The crowd then all spoke together, saying, I will accept and uphold it, spread it throughout the world, and won't dare to forget it.",
        "source": "T17n0839_002:0910c01_14"
    },
    {
        "source_sentence": "爾時，堅淨信菩薩摩訶薩白佛言：「世尊，如是所說六根聚修多羅中，",
        "translation": "At that point, the Bodhisattva Mahāsattva of Firm Faith said to the Buddha, Bhagavān, so it's said in the sutra on the aggregate of the six faculties:",
        "source": "T17n0839_002:0910c03_15"
    },
    {
        "source_sentence": "名何法門？",
        "translation": "What's the name of this teaching?",
        "source": "T17n0839_002:0910c04_16"
    },
    {
        "source_sentence": "此法真要，我當受持，令未來世普皆得聞。」",
        "translation": "This is the true essence of this teaching, which I will uphold so that they'll all be heard in future generations.",
        "source": "T17n0839_002:0910c04_17"
    },
    {
        "source_sentence": "佛告堅淨信菩薩摩訶薩言：「此法門名為『占察善惡業報』；",
        "translation": "The Buddha addressed the Bodhisattva Mahāsattva of Steadfast Faith, saying, This teaching is called 'calculating the results of good and bad actions.'",
        "source": "T17n0839_002:0910c05_18"
    },
    {
        "source_sentence": "亦名『消除諸障增長淨信』；",
        "translation": "It's also called removing the hindrances and increasing pure faith.",
        "source": "T17n0839_002:0910c07_19"
    },
    {
        "source_sentence": "亦名『開示求向大乘者進趣方便顯出甚深究竟實義』；",
        "translation": "It is also called revealing the profound and ultimate true meaning of those who seek to advance toward the Great Vehicle.",
        "source": "T17n0839_002:0910c07_20"
    },
    {
        "source_sentence": "亦名『善安慰說令離怯弱速入堅信決定法門』。",
        "translation": "It's also called 'Goodly comforting and teaching so that they'll be freed from their weaknesses and quickly enter the determined dharma-gate of firm faith.'",
        "source": "T17n0839_002:0910c08_21"
    },
    {
        "source_sentence": "依如是名義，汝當受持。」",
        "translation": "Relying on such names and meanings, you must accept them.",
        "source": "T17n0839_002:0910c09_22"
    },
    {
        "source_sentence": "佛說此法門名已，一切眾會，悉皆歡喜，信受奉行。",
        "translation": "After the Buddha taught the names of these teachings, all the assemblies rejoiced and believed them and carried them out.",
        "source": "T17n0839_002:0910c10_23"
    },
    {
        "source_sentence": "占察善惡業報經卷下",
        "translation": "Second Fascicle of the Sutra on占察善惡業報經卷下",
        "source": "T17n0839_002:0910c12_0"
    }
]