[
    {
        "source_sentence": "第一義法勝經翻譯之記",
        "translation": "Commentary on the Translation of the First Chapter of the Fasheng jing",
        "source": "T17n0833_001:0879b05_0"
    },
    {
        "source_sentence": "夫愛法者必深善根。",
        "translation": "A person who loves the Dharma must have deep good roots.",
        "source": "T17n0833_001:0879b06_0"
    },
    {
        "source_sentence": "《涅槃經》云：「供佛二恒。」",
        "translation": "The Nirvana Sutra says, Making offerings to the Buddha are two constants.",
        "source": "T17n0833_001:0879b06_1"
    },
    {
        "source_sentence": "魏尚書令儀同高公，重法心成，生上財想，博採梵文，廣崇翻譯。",
        "translation": "Emperor Wu of the Wei dynasty had the same etiquette as that of the courtier, revered Buddhism and cherished the thought of superior wealth. He was learned in Sanskrit texts and extensively translated them into Chinese",
        "source": "T17n0833_001:0879b07_0"
    },
    {
        "source_sentence": "且《第一義法勝經》者，諸法門中此其髓也。",
        "translation": "Furthermore, this is the marrow of the Dharma teachings in the Sutra of the Supreme Dharma of the First Meaning.",
        "source": "T17n0833_001:0879b08_1"
    },
    {
        "source_sentence": "公意殷誠，感之題額。",
        "translation": "The gong's mind was sincere, and he had a title for it.",
        "source": "T17n0833_001:0879b09_2"
    },
    {
        "source_sentence": "沙門曇林、瞿曇流支，興和四年歲次壬戌，九月一日甲子換文，始末四功，",
        "translation": "On the first day of the ninth month, in the fourth year of the reign of the śramaṇas Dharmasena and Gautama, in the fourth year of the Xinghe period (549 C.E.",
        "source": "T17n0833_001:0879b10_0"
    },
    {
        "source_sentence": "質義乃定，五千五百七十六字。",
        "translation": "The meaning of quality is fixed, and it's five thousand five hundred and five hundred and seventy-six words long.",
        "source": "T17n0833_001:0879b11_1"
    },
    {
        "source_sentence": "第一義法勝經",
        "translation": "Sutra of the Supreme Dharma of the First Meaning",
        "source": "T17n0833_001:0879b15_0"
    },
    {
        "source_sentence": "元魏婆羅門瞿曇般若流支譯",
        "translation": "Yuan Wei translation of the Prajñāpāramitā-prajñāruci by the Brāhmaṇa Gautama",
        "source": "T17n0833_001:0879b17_0"
    },
    {
        "source_sentence": "如是我聞：一時婆伽婆住伽耶城，成道未久，與勝中勝諸比丘俱，九十九億諸菩薩眾，",
        "translation": "Thus I have heard: One time, when Bhagavān was staying in the city of Gayā, not long after he had accomplished enlightenment, he was accompanied by a group of superior bhikṣus, comprising ninety-",
        "source": "T17n0833_001:0879b18_0"
    },
    {
        "source_sentence": "復有二十八億諸天，八萬六千比丘、比丘尼、優婆塞、優婆夷，六萬力士。",
        "translation": "Again there were twenty-eight billion gods, eighty-six thousand monks, bhikṣuṇīs, laymen, laymen, and laywomen, and 60,000 strong men.",
        "source": "T17n0833_001:0879b19_1"
    },
    {
        "source_sentence": "有十二億尼乾陀眾、八萬四千五通仙人——五熱炙身，羸瘦肉盡，唯有皮骨，",
        "translation": "There were twelve billion Nirgranthas and eighty-four thousand sages of the five supernatural powers who burned their bodies in the heat of the fifth fire. Their flesh was thin and emaciated, leaving only skin and",
        "source": "T17n0833_001:0879b21_2"
    },
    {
        "source_sentence": "腹皮著脊，頭髮成氈，傴身曲體，著鹿皮衣、若樹皮衣，手執澡罐——俱至佛所，",
        "translation": "He wore a monk’s belly leather garment on his back and hair was made of felt. His emaciated body was crooked, and he wore robes made of deerskin or cotton cloth. He carried a water pitcher in",
        "source": "T17n0833_001:0879b23_3"
    },
    {
        "source_sentence": "為欲諍鬪。",
        "translation": "It's because they want to fight.",
        "source": "T17n0833_001:0879b25_4"
    },
    {
        "source_sentence": "爾時，世尊光明勝出，端嚴殊特超過諸仙，如黑山中須彌山王、如羊群中六牙象王、如螢火虫顯於日月、如芳華中曼陀羅華、如鳥群中迦樓羅王，",
        "translation": "At the time, the Bhagavān's radiance was so brilliant that it surpassed those of all the sages. It was like Mount Sumeru in the dark mountains, a six-legged elephant king among herds of sheep, a",
        "source": "T17n0833_001:0879b26_0"
    },
    {
        "source_sentence": "兩重端嚴；",
        "translation": "They are adorned with twofold adornment.",
        "source": "T17n0833_001:0879b29_1"
    },
    {
        "source_sentence": "佛於諸仙亦復如是。",
        "translation": "The Buddha is likewise with the sages.",
        "source": "T17n0833_001:0879b29_2"
    },
    {
        "source_sentence": "爾時，世尊入捨寶三昧，示現無量無數神通，左右皆放無量光明，出無量億如來之身、出無量億菩薩之身，",
        "translation": "At that time the World-honored One entered the concentration of relinquishment of jewels, manifesting innumerable and countless mystical powers. On his left and right he radiated innumerable rays of light emanating",
        "source": "T17n0833_001:0879c01_3"
    },
    {
        "source_sentence": "出無量億帝釋天王、大梵天王世界尊主，復出無量百千羅漢，復出無量多千比丘、諸比丘尼、諸優婆塞、諸優婆夷，",
        "translation": "Innumerable hundreds of thousands of arhats also came forth, and innumerable millions of monks, nuns, laymen, and laywomen came forth.",
        "source": "T17n0833_001:0879c03_4"
    },
    {
        "source_sentence": "復出無量轉輪聖王、力轉輪王、小轉輪王、漢不隣那、及陀毘羅、南國土人、得呪仙人、邊地處人、剎利大姓，",
        "translation": "“Furthermore, from the assembly there came innumerable wheel-turning sage kings, wheel-turning kings of power, small wheel-turning kings, Han upāliṇas, and Kapilavastu. They were",
        "source": "T17n0833_001:0879c06_5"
    },
    {
        "source_sentence": "及婆羅門、長者、居士、人非人等，種種異異諸色莊嚴，如是一切有名字者乃至天眾，",
        "translation": "And various different forms and adornments, such as Brahmans, wealthy people, householders, humans, nonhumans, and so forth, all have names like this, even up to the heavenly hosts.",
        "source": "T17n0833_001:0879c08_6"
    },
    {
        "source_sentence": "一切皆從如來身出。",
        "translation": "All of them all come from the Tathāgata's body.",
        "source": "T17n0833_001:0879c10_7"
    },
    {
        "source_sentence": "爾時，大眾皆生疑心云何？",
        "translation": "At that point, what doubt did the masses have in their minds?",
        "source": "T17n0833_001:0879c11_0"
    },
    {
        "source_sentence": "迭相瞻視。",
        "translation": "They looked at each other in turn.",
        "source": "T17n0833_001:0879c11_1"
    },
    {
        "source_sentence": "彼大眾中一切菩薩皆生歡喜，雨種種寶，乃至普雨一切莊嚴。",
        "translation": "All the enlightening beings in that great assembly were delighted, showering various jewels and all kinds of adornments.",
        "source": "T17n0833_001:0879c11_2"
    },
    {
        "source_sentence": "爾時，世尊起捨寶三昧，師子奮迅觀察十方，即觀察時周遍十方，乃至佛眼所見境界。",
        "translation": "At the time, the Bhagavān arose in the jeweled concentration of equanimity, and the lion ardently observed the ten directions, observing that it pervaded the ten directions when it did so, even up to the",
        "source": "T17n0833_001:0879c14_0"
    },
    {
        "source_sentence": "一切十方諸佛世界諸佛世尊，彼一切佛觀察娑婆如觀手掌。",
        "translation": "All the buddhas and world-honored ones of all the buddha-realms in the ten directions observe sahā as if they were observing their palms.",
        "source": "T17n0833_001:0879c15_1"
    },
    {
        "source_sentence": "彼一切佛皆現神通，如此世尊釋迦牟尼所現無異，彼諸如來身所化出乃至一切皆悉如是，",
        "translation": "All those buddhas manifested mystical powers, just as the World-honored One, the Buddha Sakyamuni, did. The manifestations of those buddhas emanated from their bodies and so on, all being like this.",
        "source": "T17n0833_001:0879c17_2"
    },
    {
        "source_sentence": "來到世尊釋迦牟尼眾會之所。",
        "translation": "He came to the assembly hall of the Bhagavān, Śākyamuni.",
        "source": "T17n0833_001:0879c19_3"
    },
    {
        "source_sentence": "既到此已，皆入世尊大眾會中。",
        "translation": "Having arrived here, they all entered the assembly of the Bhagavān.",
        "source": "T17n0833_001:0879c20_4"
    },
    {
        "source_sentence": "爾時，此會無量菩薩與恒河沙多諸比丘、諸比丘尼、諸優婆塞、優婆夷，",
        "translation": "At the time, this assembly of innumerable bodhisattvas and the monks, nuns, laymen, and laywomen as numerous as the grains of sand in the Ganges River were there.",
        "source": "T17n0833_001:0879c21_0"
    },
    {
        "source_sentence": "俱以不可說諸供養具供養世尊。",
        "translation": "They both offered ineffable offerings to the Bhagavān with all kinds of offerings.",
        "source": "T17n0833_001:0879c22_1"
    },
    {
        "source_sentence": "既供養已，近如來住。",
        "translation": "After making these offerings, he approached the Tathāgata and stayed there.",
        "source": "T17n0833_001:0879c23_2"
    },
    {
        "source_sentence": "如是，天、龍及諸夜叉、諸乾闥婆、諸阿修羅、諸迦樓羅、諸緊那羅、摩睺羅伽、人非人等，",
        "translation": "Thus, gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, nonhumans, etc.",
        "source": "T17n0833_001:0879c24_0"
    },
    {
        "source_sentence": "既見世尊神通事已，皆至佛所。",
        "translation": "Having seen the deeds of the World-honored One’s supernatural powers, they all went to the Buddha.",
        "source": "T17n0833_001:0879c25_1"
    },
    {
        "source_sentence": "爾時，十方諸來菩薩無上供養供養世尊。",
        "translation": "At the time, the bodhisattvas who came from the ten directions made unsurpassed offerings to the Bhagavān.",
        "source": "T17n0833_001:0879c27_0"
    },
    {
        "source_sentence": "既供養已，六波羅蜜究竟所作座上而坐。",
        "translation": "After making this offering, he sat on the seat that was made for the ultimate accomplishment of the six perfections.",
        "source": "T17n0833_001:0879c27_1"
    },
    {
        "source_sentence": "如是，乃至人非人等，隨自相似座上而坐。",
        "translation": "Thus, it's up to humans and non-humans who sit on their seats as they like themselves.",
        "source": "T17n0833_001:0879c28_2"
    },
    {
        "source_sentence": "世尊所化，上去乃至阿迦尼吒諸天宮殿、下去乃至阿鼻地獄。",
        "translation": "The Bhagavān transforms them up to the palaces of the Akaniṣṭha gods and down to the avīci hell.",
        "source": "T17n0833_001:0880a01_0"
    },
    {
        "source_sentence": "又，到阿鼻地獄處已，彼十方佛身所化出一切皆入釋迦牟尼一切毛根，",
        "translation": "“Furthermore, when they arrived at the avīci hells, all the emanations emanating from the bodies of those buddhas in the ten directions entered into the hair follicles of Śākyamuni.",
        "source": "T17n0833_001:0880a02_1"
    },
    {
        "source_sentence": "此處世尊釋迦牟尼身所化出一切皆入十方佛身。",
        "translation": "This is the place where the Bhagavān, Śākyamuni, enters into the buddha-body of the ten directions with all the transformations he produces in his body.",
        "source": "T17n0833_001:0880a04_2"
    },
    {
        "source_sentence": "爾時，會中有一菩薩摩訶薩名曰勝陰，從座而起，整服一廂，右膝著地，",
        "translation": "At that time there was a great enlightening being in the assembly, named Vaiśravaṇa, who stood up from his seat with his right knee touching the ground.",
        "source": "T17n0833_001:0880a06_0"
    },
    {
        "source_sentence": "「人主！甚希有，　　速示諸世間，",
        "translation": "“O lord of men! How rare it is that you should quickly show the worlds.",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　本未曾有此。　　魔軍隱不現，",
        "translation": "This is unprecedented in the world. The armies of Māra are hidden and not manifested.",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　迭相瞻說言：　　『此事甚希有。",
        "translation": "They looked at each other and said, 'This is a rare thing.",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　我何因來此？　　為令破壞故。",
        "translation": "What is the reason I came here?",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　我仙今非仙，　　身瘦唯有皮，",
        "translation": "My sage is not a sage now, but my body is thin with only skin.",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　老乾無有樂，　　不得此神通。",
        "translation": "There's no pleasure in old age and dryness, and they can't attain this supernormal ability.",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　現神通不說，　　除佛法棘刺。』",
        "translation": "He shows his supernormal powers and doesn't explain them, except for the thorns and thorns of the Buddha's teaching.'",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　佛弟子朝喜，　　尊作佛法主，",
        "translation": "The Buddha’s disciples rejoiced in the morning, And honored one became the Buddha-Dharma Master.",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　眾生希有想，　　心清淨歡喜。",
        "translation": "Sentient beings have rare conceptions, and their minds are pure and joyous.",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　諸天眾皆言：　　『願得佛。人主！』",
        "translation": "The gods all said, 'May I attain buddhahood, lord of men!'",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　此眾會中住，　　文殊師利嚮，",
        "translation": "In the midst of this assembly, Mañjuśrī is echoed by Maitreya.",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　無量佛弟子，　　相隨在此會。",
        "translation": "Innumerable disciples of the Buddha Have accompanied each other in this assembly.",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　此文殊師利，　　已多佛供養，",
        "translation": "This Mañjuśrī has already offered many offerings to the Buddha.",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　佛於此大眾，　　現種種神通。",
        "translation": "The Buddha manifested various spiritual powers In this great assembly.",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　此是何法相？　　牟尼欲何為？",
        "translation": "What is the characteristic of this dharma?",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "　此眾有疑心，　　願愍眾生說。」",
        "translation": "If these people have doubts, may they pity sentient beings and explain it.",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "合掌向佛以偈讚言：爾時，如來以威神力令眾會中一大仙人——名光明炬——語彼勝陰大菩薩言：「童子默然，",
        "translation": "He joined his palms and praised the Buddha in verse, saying, At that point, the Tathāgata by mystic power caused one great sage among the assembly-known as the torch of light-to speak to the great bodhisattva",
        "source": "T17n0833_001:0880a07_1"
    },
    {
        "source_sentence": "童子默然。",
        "translation": "The boy remained silent.",
        "source": "T17n0833_001:0880a26_2"
    },
    {
        "source_sentence": "我今難問，若能解釋自清淨者，如一切智相應得名。",
        "translation": "It's difficult for me to ask now, but if I can explain my own purity, it's like the name associated with omniscience.",
        "source": "T17n0833_001:0880a27_3"
    },
    {
        "source_sentence": "若那羅延、摩醯首羅所作幻化陀毘羅呪，如是作者此非奇特，如是幻化凡人能成，",
        "translation": "If Nārayana and Mahêśvara create magical dhāraṇī spells like this, it's not extraordinary that the author of such an illusion would be able to accomplish them by ordinary people who are illusory.",
        "source": "T17n0833_001:0880a28_4"
    },
    {
        "source_sentence": "不必是佛。」",
        "translation": "It doesn't have to be the Buddha.",
        "source": "T17n0833_001:0880b01_5"
    },
    {
        "source_sentence": "爾時，世尊怡然微笑。",
        "translation": "At that point, the Bhagavān smiled joyfully.",
        "source": "T17n0833_001:0880b02_0"
    },
    {
        "source_sentence": "觀仙眾已，即告大仙光明炬言：「慧命大仙！",
        "translation": "After observing the sages, he addressed the great sage's torch of light, saying, Wisdom-Life Great Sage!",
        "source": "T17n0833_001:0880b02_1"
    },
    {
        "source_sentence": "汝當難問，隨汝力分，我能清淨。」",
        "translation": "You must ask difficult questions, and I'll be able to purify them according to your power.",
        "source": "T17n0833_001:0880b03_2"
    },
    {
        "source_sentence": "爾時，大仙光明炬言：「我問瞿曇，瞿曇為我一一解說：一切眾生從何處生？",
        "translation": "At the time, the great sage's bright torch of illumination said, I asked Gautama, and Gautama explained for me one by one: Where are all sentient beings born?",
        "source": "T17n0833_001:0880b05_0"
    },
    {
        "source_sentence": "何者眾生？",
        "translation": "What are sentient beings?",
        "source": "T17n0833_001:0880b06_1"
    },
    {
        "source_sentence": "何因緣故，劫盡燒燃？",
        "translation": "What are the causes and conditions for the exhaustion of the kalpa of burning?",
        "source": "T17n0833_001:0880b06_2"
    },
    {
        "source_sentence": "眾生過去何處和合而生人中？",
        "translation": "Where did sentient beings come together in the past to be born among humans?",
        "source": "T17n0833_001:0880b07_3"
    },
    {
        "source_sentence": "何相得知眾生身中微細內我，為一肘量、為二肘量，為二指量、為一指量，",
        "translation": "“World-honored One, what does it mean to know that the tiny internal self within the bodies of living beings is one or two yojanas in circumference?",
        "source": "T17n0833_001:0880b08_4"
    },
    {
        "source_sentence": "為如大麥、為如小麥、為當如豆、為如胡麻、為如芥子？」",
        "translation": "Why is it like wheat, why is it like wheat, why is it like beans, why is it like sesame, and why is it like mustard seed?",
        "source": "T17n0833_001:0880b09_5"
    },
    {
        "source_sentence": "爾時，世尊讚光明炬大仙人言：「善哉，大仙！",
        "translation": "It was then that the Bhagavān praised the great sage of the torch of light, saying, Good, great sage!",
        "source": "T17n0833_001:0880b12_0"
    },
    {
        "source_sentence": "善哉，善哉。",
        "translation": "Excellent, excellent!",
        "source": "T17n0833_001:0880b12_1"
    },
    {
        "source_sentence": "汝大仙人六十劫壽恒常修行，今者如是相以問難。」",
        "translation": "You great sage always cultivated it for 60 eons, and now you're asking questions like this.",
        "source": "T17n0833_001:0880b13_2"
    },
    {
        "source_sentence": "諸仙眾中復有大仙如是思惟：「我常林行，不覺不知此光明炬大仙命量。",
        "translation": "Among the sages, there was another great sage among them who thought, I'm always walking in the forest, but I don't know the life span of this great sage torch of light.",
        "source": "T17n0833_001:0880b14_3"
    },
    {
        "source_sentence": "未有人說，沙門瞿曇云何得知？」",
        "translation": "If no one has explained it, how can the ascetic Gautama know it?",
        "source": "T17n0833_001:0880b16_4"
    },
    {
        "source_sentence": "爾時，世尊告光明炬大仙人言：「大仙諦聽，善思念之，今為汝說。",
        "translation": "It was then that the Bhagavān addressed the great sage Guangming torch, saying, Great sage, listen closely and consider it well; now I'll explain it for you.",
        "source": "T17n0833_001:0880b17_0"
    },
    {
        "source_sentence": "如汝所問一切眾生何處生者，如是之義無字、無說，無明因緣次第乃至生、老、死等而生眾生。",
        "translation": "As you ask where all sentient beings are born, this meaning has no words or explanations, and it's because of the causes and conditions of ignorance that birth, old age, death, and so forth are produced in order.",
        "source": "T17n0833_001:0880b18_1"
    },
    {
        "source_sentence": "又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0880b20_2"
    },
    {
        "source_sentence": "從於因緣而生眾生，所謂父母因緣而生。",
        "translation": "Sentient beings are born from causes and conditions, which are called the causes and conditions of parents.",
        "source": "T17n0833_001:0880b20_3"
    },
    {
        "source_sentence": "又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0880b21_4"
    },
    {
        "source_sentence": "父母和合是眾生因；",
        "translation": "The union of parents is the cause for sentient beings.",
        "source": "T17n0833_001:0880b22_5"
    },
    {
        "source_sentence": "謂逕劫起，業風所吹墮女根中，此是因緣。",
        "translation": "These are the causes and conditions by which a kalpa arises, blown by the wind of action and falls into the female faculty.",
        "source": "T17n0833_001:0880b22_6"
    },
    {
        "source_sentence": "又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0880b23_7"
    },
    {
        "source_sentence": "謂苦聖諦、苦集、苦滅及苦滅道聖諦所攝，名為眾生。",
        "translation": "They are the noble truth of suffering, the noble truth of suffering's accumulation, the noble truth of suffering's cessation, and the noble truth of the path to suffering's cessation, which are called sentient beings.",
        "source": "T17n0833_001:0880b23_8"
    },
    {
        "source_sentence": "又，五取陰、十八界等名為眾生。",
        "translation": "Also, the five acquired aggregates and 18 elements are called sentient beings.",
        "source": "T17n0833_001:0880b24_9"
    },
    {
        "source_sentence": "大仙當知：彼諦、陰、界即是眾生，不異於業；",
        "translation": "Great sage, you should know that these truths, aggregates, and elements are living beings; they are no different from action.",
        "source": "T17n0833_001:0880b25_10"
    },
    {
        "source_sentence": "如是，業者不異眾生。",
        "translation": "Thus, karma isn't different from sentient beings.",
        "source": "T17n0833_001:0880b26_11"
    },
    {
        "source_sentence": "大仙當知：眾生不減、眾生不增。」",
        "translation": "Great sage, you should know that sentient beings don't decrease and sentient beings don't increase.",
        "source": "T17n0833_001:0880b27_12"
    },
    {
        "source_sentence": "時大仙人問言：「瞿曇！",
        "translation": "The great sage then asked, Gautama!",
        "source": "T17n0833_001:0880b28_0"
    },
    {
        "source_sentence": "若諸眾生不減、不增，眾生何故人天自在，後時作狗，復作人天得自在耶？」",
        "translation": "If sentient beings don't decrease and don't increase, why do sentient beings attain sovereignty over humans and gods when they become dogs later?",
        "source": "T17n0833_001:0880b28_1"
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, Great sage!",
        "source": "T17n0833_001:0880c01_2"
    },
    {
        "source_sentence": "如汝所言，是義不然。",
        "translation": "As you say, this does not make sense.",
        "source": "T17n0833_001:0880c01_3"
    },
    {
        "source_sentence": "若有自在，則不屬他。",
        "translation": "If someone has sovereignty, then they don't belong to others.",
        "source": "T17n0833_001:0880c01_4"
    },
    {
        "source_sentence": "如是，大仙！",
        "translation": "So it is, great sage!",
        "source": "T17n0833_001:0880c02_5"
    },
    {
        "source_sentence": "若身自在，云何後時得不自在？",
        "translation": "If the body is self-contained, then how can it not be self-contained at a later time?",
        "source": "T17n0833_001:0880c02_6"
    },
    {
        "source_sentence": "大仙當知：如螢火虫起如是意：『我此光明能悉普遍照閻浮提。』",
        "translation": "Great sage, you should know that it's like when a firefly gives rise to the thought, 'This light of mine can illuminate everywhere in Jambudvīpa.'",
        "source": "T17n0833_001:0880c03_7"
    },
    {
        "source_sentence": "彼螢火虫所有光明，無有因緣能悉普遍照閻浮提。",
        "translation": "The light of those fireflies and insects can illuminate everywhere in Jambudvfpa without any reason.",
        "source": "T17n0833_001:0880c04_8"
    },
    {
        "source_sentence": "如是，一切不調御心無實自在。",
        "translation": "Thus, all the minds that aren't disciplined have no real freedom.",
        "source": "T17n0833_001:0880c05_9"
    },
    {
        "source_sentence": "又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0880c06_10"
    },
    {
        "source_sentence": "若自在者煩惱減少、狗煩惱多，狗則自在；",
        "translation": "If they do so freely, their defilement will decrease and the defilement of dogs will increase.",
        "source": "T17n0833_001:0880c06_11"
    },
    {
        "source_sentence": "則不自在亦為自在，是則自在亦不自在。",
        "translation": "Then neither self-dependence nor self-dependence is also self-dependence, and this is self-dependence that's not self-dependence.",
        "source": "T17n0833_001:0880c07_12"
    },
    {
        "source_sentence": "若狗自在、煩惱平等，是則眾生不減、不增。」",
        "translation": "If a dog is free and the afflictions are equal, then sentient beings won't decrease or increase.",
        "source": "T17n0833_001:0880c08_13"
    },
    {
        "source_sentence": "大仙人言：「瞿曇豈不斷煩惱耶？」",
        "translation": "The great sage said, Does Gautama not stop the afflictions?",
        "source": "T17n0833_001:0880c10_0"
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, Great sage!",
        "source": "T17n0833_001:0880c10_1"
    },
    {
        "source_sentence": "煩惱不了，我了煩惱，非斷煩惱。」",
        "translation": "When the afflictions don't reach them, I understand the afflictions, not the afflictions that are stopped.",
        "source": "T17n0833_001:0880c10_2"
    },
    {
        "source_sentence": "大仙人言：「若如是者，汝則自在。」",
        "translation": "The great sage said, If you do so, you'll be at ease.",
        "source": "T17n0833_001:0880c11_3"
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, Great sage!",
        "source": "T17n0833_001:0880c12_4"
    },
    {
        "source_sentence": "如是，如是。",
        "translation": "So it is, so it is.",
        "source": "T17n0833_001:0880c12_5"
    },
    {
        "source_sentence": "以不實故，我則自在。」",
        "translation": "Because it's not real, I am self-contained.",
        "source": "T17n0833_001:0880c12_6"
    },
    {
        "source_sentence": "大仙人言：「瞿曇！",
        "translation": "The great sage said, Gautama!",
        "source": "T17n0833_001:0880c13_7"
    },
    {
        "source_sentence": "此言且止且住。",
        "translation": "This is called stopping and abiding.",
        "source": "T17n0833_001:0880c13_8"
    },
    {
        "source_sentence": "若瞿曇子向者說言父母和合生眾生者，多有眾生多相和合，多受欲樂，",
        "translation": "“If Gotama said to the venerable, ‘Many sentient beings are born in union with their parents,’” it means that many living beings are united by many characteristics and experience many desires and pleasures.",
        "source": "T17n0833_001:0880c14_0"
    },
    {
        "source_sentence": "少生眾生。",
        "translation": "Sentient beings who are little-arisen...",
        "source": "T17n0833_001:0880c15_1"
    },
    {
        "source_sentence": "是義云何？」",
        "translation": "What does this mean?",
        "source": "T17n0833_001:0880c15_2"
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, Great sage!",
        "source": "T17n0833_001:0880c16_3"
    },
    {
        "source_sentence": "我今當以譬喻問汝。",
        "translation": "Now, I will ask you this metaphor.",
        "source": "T17n0833_001:0880c16_4"
    },
    {
        "source_sentence": "如一種子則生一樹，一子一樹生無量果，彼無量果有任種子、有不任者。",
        "translation": "Just as one kind of seed produces one tree, and each seed produces unlimited fruit. With unlimited fruit, there are freely planted seeds and not freely planted ones.",
        "source": "T17n0833_001:0880c16_5"
    },
    {
        "source_sentence": "此復云何？」",
        "translation": "What does this mean?",
        "source": "T17n0833_001:0880c18_6"
    },
    {
        "source_sentence": "答言：「瞿曇！",
        "translation": "He replied, Gautama!",
        "source": "T17n0833_001:0880c18_7"
    },
    {
        "source_sentence": "風勢因緣散失樹子。」",
        "translation": "As a result of the wind, the tree's seeds are scattered.",
        "source": "T17n0833_001:0880c19_8"
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, Great sage!",
        "source": "T17n0833_001:0880c19_9"
    },
    {
        "source_sentence": "諸眾生果亦復如是，業風所散。",
        "translation": "The fruit of sentient beings is likewise, scattered by the wind of karma.",
        "source": "T17n0833_001:0880c19_10"
    },
    {
        "source_sentence": "大仙當知：有在藏中為虫齧食、有為業風之所散壞。",
        "translation": "Great sage, you should know that there's something in the store that's eaten by insects and destroyed by the wind of conditioned karma.",
        "source": "T17n0833_001:0880c20_11"
    },
    {
        "source_sentence": "大仙當知：樹等少障，眾生多礙。",
        "translation": "Great sage, you should know that trees and so forth have few hindrances and sentient beings are often obstructed.",
        "source": "T17n0833_001:0880c21_12"
    },
    {
        "source_sentence": "又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0880c22_13"
    },
    {
        "source_sentence": "諸眾生界從分別起。",
        "translation": "The sentient being realm arises from discrimination.",
        "source": "T17n0833_001:0880c22_14"
    },
    {
        "source_sentence": "大仙當知：諸眾生界心心數法，處處轉行皆有攀緣，此義已說。",
        "translation": "Great sage, you should know that all sentient beings in the realm of mind and mental factors have perceptual objects as their objects. This meaning has already been spoken of.",
        "source": "T17n0833_001:0880c23_15"
    },
    {
        "source_sentence": "如是，大仙！",
        "translation": "So it is, great sage!",
        "source": "T17n0833_001:0880c24_16"
    },
    {
        "source_sentence": "諸眾生界從分別起。」",
        "translation": "The realm of sentient beings arises from discrimination.",
        "source": "T17n0833_001:0880c24_17"
    },
    {
        "source_sentence": "大仙聞已，作如是言：「如是如是，瞿曇已淨此一難問。",
        "translation": "After hearing this, the great sage said, So it is, so it is, Gautama has purified this difficult question.",
        "source": "T17n0833_001:0880c26_0"
    },
    {
        "source_sentence": "又復，瞿曇！",
        "translation": "Again, Gotama!",
        "source": "T17n0833_001:0880c27_1"
    },
    {
        "source_sentence": "應當更說何義劫燒？」",
        "translation": "What's the meaning of a kalpa of burning that should be explained?",
        "source": "T17n0833_001:0880c27_2"
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, Great sage!",
        "source": "T17n0833_001:0880c27_3"
    },
    {
        "source_sentence": "以無常故，我如是說法界劫燒。",
        "translation": "Because it's impermanent, I thus explain the Dharma realm as an eon of blazing fire.",
        "source": "T17n0833_001:0880c28_4"
    },
    {
        "source_sentence": "大仙當知：若地劫燒，法界則二，如是有常亦有無常。",
        "translation": "Great sage, you should know that if the earth were to be burned in an eon, the Dharma realm would be twofold, and thus there would be permanence and impermanence.",
        "source": "T17n0833_001:0880c28_5"
    },
    {
        "source_sentence": "若如是者，一切如來不實語說。",
        "translation": "If it's like this, all the tathāgatas don't speak truly.",
        "source": "T17n0833_001:0881a01_6"
    },
    {
        "source_sentence": "又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0881a01_7"
    },
    {
        "source_sentence": "若一切法皆悉無常、變異不住，如來得名一切智人。」",
        "translation": "If all things are completely impermanent and changeless and don't abide, the Tathāgata can be called a person of omniscience.",
        "source": "T17n0833_001:0881a02_8"
    },
    {
        "source_sentence": "大仙聞已，為摩那婆如是說言：「此名乃是如實相應一切智名。」",
        "translation": "After hearing this, the great sage explained it to Manabha in this way, saying, This name is the name of omniscience that's truly associated with all things.",
        "source": "T17n0833_001:0881a03_9"
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, Great sage!",
        "source": "T17n0833_001:0881a05_0"
    },
    {
        "source_sentence": "若使如來不放劫燒，一切眾生不知時節、不識劫名、不識鬪時、不識善時。",
        "translation": "If the Tathāgata doesn't allow an eon to burn, all sentient beings won't know the time and season, don't know the name of the eon, don't know the time of fighting, and don't know the time of",
        "source": "T17n0833_001:0881a05_1"
    },
    {
        "source_sentence": "大仙當知：若使如來不放劫燒，若善、不善業果報異，皆無知者。",
        "translation": "Great sage, you should know that if the Tathāgata doesn't let an eon be burned, or if the results of good and unskillful actions are different, they all lack knowledge.",
        "source": "T17n0833_001:0881a06_2"
    },
    {
        "source_sentence": "又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0881a08_3"
    },
    {
        "source_sentence": "應知此是如來方便放劫盡燒。",
        "translation": "You should know that this is the Tathāgata's method of liberating an entire eon from being burned up.",
        "source": "T17n0833_001:0881a08_4"
    },
    {
        "source_sentence": "大仙當知：諸眾生等信劫盡燒，畏當燒故，皆攝福德信於如來。",
        "translation": "Great sage, you should know that all sentient beings and so forth believe that the eon is completely burned, and because they fear it will burn them, they all gather merit and faith in the Tathāgata.",
        "source": "T17n0833_001:0881a09_5"
    },
    {
        "source_sentence": "「又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0881a11_0"
    },
    {
        "source_sentence": "譬如有蟒名曰涎呼，彼涎呼蟒眼亦能呼、耳亦能呼、鼻亦能呼、口亦能呼。",
        "translation": "It's like a snake named saliva, which is called saliva and can be called by its eyes, ears, nose, and mouth.",
        "source": "T17n0833_001:0881a11_1"
    },
    {
        "source_sentence": "如是，大仙！",
        "translation": "So it is, great sage!",
        "source": "T17n0833_001:0881a13_0"
    },
    {
        "source_sentence": "如來亦爾，以布施攝，愛語、利益、同事等攝。",
        "translation": "The same applies to the Tathagata: it is included by means of giving. Such [things] as loving words, benefits and fellow practitioners are included.",
        "source": "T17n0833_001:0881a13_1"
    },
    {
        "source_sentence": "「又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0881a15_0"
    },
    {
        "source_sentence": "譬如有人置金火中，非瞋金故置之在火，為令善熟寶相應故，若寶相應則為貴價。",
        "translation": "It's like a person who puts gold in a fire and doesn't hate gold, so he puts it in the fire because it's associated with the treasure that makes it well-ripe, and if it's associated with the treasure, then it'",
        "source": "T17n0833_001:0881a15_1"
    },
    {
        "source_sentence": "大仙當知：以是因緣打熟明淨。",
        "translation": "Great sage, you should know that it's because of these causes and conditions that he ripens insight and purity.",
        "source": "T17n0833_001:0881a17_2"
    },
    {
        "source_sentence": "如是，大仙！",
        "translation": "So it is, great sage!",
        "source": "T17n0833_001:0881a17_3"
    },
    {
        "source_sentence": "諸佛如來非無因緣放劫盡燒、非有眾生劫火所燒。」",
        "translation": "The buddha-tathāgatas and tathāgatas don't let the eon be completely burned without a cause, and there aren't sentient beings burned by the fire of the eon.",
        "source": "T17n0833_001:0881a18_4"
    },
    {
        "source_sentence": "爾時，大仙光明炬言：「希有，世尊！",
        "translation": "It was then that the great sage's torch of light said, Rarely, Bhagavān!",
        "source": "T17n0833_001:0881a20_0"
    },
    {
        "source_sentence": "放劫燒火，無一眾生劫火所燒。」",
        "translation": "He releases an eon that burns a fire, and no sentient being is burned by an eon-fire.",
        "source": "T17n0833_001:0881a20_1"
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, Great sage!",
        "source": "T17n0833_001:0881a21_2"
    },
    {
        "source_sentence": "無一眾生為如來燒。",
        "translation": "No sentient being is burned by the Tathāgata.",
        "source": "T17n0833_001:0881a21_3"
    },
    {
        "source_sentence": "又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0881a22_4"
    },
    {
        "source_sentence": "譬如十方雨微細雨，如來之數復多於是；",
        "translation": "Good man, this is analogous to the subtle rain that falls in the ten directions.",
        "source": "T17n0833_001:0881a22_5"
    },
    {
        "source_sentence": "十地菩薩亦復如是，在上而住。",
        "translation": "So it is with the bodhisattvas of the tenth ground, who abide up there.",
        "source": "T17n0833_001:0881a23_6"
    },
    {
        "source_sentence": "如是住已，皆以自手救諸眾生，令使解脫。",
        "translation": "After thus abiding, they all rescue sentient beings with their own hands and cause them to be liberated.",
        "source": "T17n0833_001:0881a24_7"
    },
    {
        "source_sentence": "大仙當知：如是眾生見諸如來及諸菩薩身色端嚴，如是見已，復見劫盡大火燒已，",
        "translation": "Great sage, you should know that such sentient beings see the bodies of buddhas and enlightening beings beautifully arrayed. Having seen them thus, they also see the eon having been destroyed and burned by a great conflagration",
        "source": "T17n0833_001:0881a25_8"
    },
    {
        "source_sentence": "見自脫已，心生歡喜，清淨心生，如是願言：『我亦如是度諸眾生、我亦如是身色端嚴、我亦如是身作金色。』",
        "translation": "Seeing themselves liberated, their minds become joyous and pure, and their minds are purified, thus wishing to say, 'I will also thus liberate sentient beings, I will also thus have a body that's colorful and",
        "source": "T17n0833_001:0881a26_9"
    },
    {
        "source_sentence": "眾生既起如是心已，有心解脫即時證得阿羅漢者；",
        "translation": "“Once sentient beings have aroused such thoughts, those who are mentally liberated will at once realize arhatship.",
        "source": "T17n0833_001:0881a29_10"
    },
    {
        "source_sentence": "有見劫火心生厭離，或有證得須陀洹者、或有證得斯陀含者、或有證得阿那含者、或有證得阿羅漢者、或有證得緣覺道者、或有證得無生法忍、或有得上不退地者、或有得生四天王處、或有得生三十三天、或有得生夜摩天者、或有得生兜率陀天者、或有得生化樂天者、有生他化自在天者，",
        "translation": "There were those who saw the fire of the kalpa and became disillusioned, some who had realized attainment of stream entry, some who had realized attainment of once-returner, some who had realized attainment of nonreturner, some who had realized",
        "source": "T17n0833_001:0881b01_11"
    },
    {
        "source_sentence": "有生梵天、梵輔、梵眾，如是次第乃至有生阿迦尼吒；",
        "translation": "The arising of the god Brahmā, the brahma- assistants and the assembly of brahmā gods is in this order up to the arising of the Akaniṣṭha.",
        "source": "T17n0833_001:0881b08_12"
    },
    {
        "source_sentence": "如是，有得轉輪聖王、力轉輪王、天竺小王；",
        "translation": "“In the same way, there were wheel-turning sage kings who had attained it, wheel-turning kings with power and small kings of India.",
        "source": "T17n0833_001:0881b09_13"
    },
    {
        "source_sentence": "如是，大仙！",
        "translation": "So it is, great sage!",
        "source": "T17n0833_001:0881b10_14"
    },
    {
        "source_sentence": "乃至剎利、若婆羅門、若長者等。",
        "translation": "It's even a warrior, whether he's a brāhmaṇa or an elder.",
        "source": "T17n0833_001:0881b10_15"
    },
    {
        "source_sentence": "大仙當知：以此方便令見如來色身相已，自見己身生大怖畏。",
        "translation": "Great sage, you should know that this is a method for causing someone to see the Tathāgata's physical body and characteristics and become greatly frightened when they see their own body.",
        "source": "T17n0833_001:0881b11_16"
    },
    {
        "source_sentence": "得解脫已，知如來恩、報如來恩，親近如來，聽聞正法。",
        "translation": "Having attained liberation, they know the Tathāgata’s kindness and repay the Tathāgata’s kindness. They become intimate with the Tathāgata and listen to the true-dharma.",
        "source": "T17n0833_001:0881b12_17"
    },
    {
        "source_sentence": "既聞法已，如法修學不放逸行，以此方便令諸眾生不入惡道。",
        "translation": "Having heard the teaching, they cultivate their practice of not being careless in accordance with the teaching and use this method to cause sentient beings not to enter bad destinies.",
        "source": "T17n0833_001:0881b13_18"
    },
    {
        "source_sentence": "「又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0881b15_19"
    },
    {
        "source_sentence": "乃至幾許十地菩薩彼眼境界、所有地界、復過於此諸眾生界，彼諸眾生見生死過，",
        "translation": "How many bodhisattvas of the tenth stage are there in that realm of vision and all the other realms of sentient beings who see birth and death?",
        "source": "T17n0833_001:0881b15_20"
    },
    {
        "source_sentence": "一切無餘涅槃界入。",
        "translation": "They all enter the nirvāṇa realm without remainder.",
        "source": "T17n0833_001:0881b17_21"
    },
    {
        "source_sentence": "大仙當知：以此因緣放劫盡燒。」",
        "translation": "Great sage, you should know that this is the cause and condition for setting aside an eon to burn it out.",
        "source": "T17n0833_001:0881b17_22"
    },
    {
        "source_sentence": "爾時，大仙名光明炬心即思惟：「此釋迦子——六波羅蜜具足大人、第一勝人——不喚我字，",
        "translation": "It was then that the great sage named Torch of Light thought, This son of the Śākyamuni - the six perfections-completed great man and the first superior person - won't call my name.",
        "source": "T17n0833_001:0881b19_0"
    },
    {
        "source_sentence": "稱言大仙。",
        "translation": "He called himself a great sage.",
        "source": "T17n0833_001:0881b20_1"
    },
    {
        "source_sentence": "我自試看是一切智、非一切智；",
        "translation": "I examine for myself whether it is omniscience or not.",
        "source": "T17n0833_001:0881b21_2"
    },
    {
        "source_sentence": "我今實知是一切智，我今應當稱其實名。」",
        "translation": "Now, I really know that this is omniscience, and now I should call it by its true name.",
        "source": "T17n0833_001:0881b21_3"
    },
    {
        "source_sentence": "爾時，大仙名光明炬既思惟已，即白佛言：「大功德聚無量智者！",
        "translation": "After he thought about it, the great sage named the torch of light of the name of the great sage, he said to the Buddha, Great store of merit and immeasurable wisdom!",
        "source": "T17n0833_001:0881b23_0"
    },
    {
        "source_sentence": "一切智者！",
        "translation": "All knowers!",
        "source": "T17n0833_001:0881b24_1"
    },
    {
        "source_sentence": "更為我說彼諸眾生何處和合。」",
        "translation": "Furthermore, I'll tell you where those sentient beings are united.",
        "source": "T17n0833_001:0881b24_2"
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, Great sage!",
        "source": "T17n0833_001:0881b25_3"
    },
    {
        "source_sentence": "當知眾生無處和合、當知眾生平等和合，是名和合；",
        "translation": "You should know that sentient beings have no place for harmonious conjunction, and you should know that all sentient beings are equally harmonious. This is called ‘combination’.",
        "source": "T17n0833_001:0881b25_4"
    },
    {
        "source_sentence": "當知眾生一乘和合，是名和合；",
        "translation": "You should know that the unity of sentient beings in one vehicle is called ‘unity’.",
        "source": "T17n0833_001:0881b26_5"
    },
    {
        "source_sentence": "一切皆是菩薩和合，謂在無餘涅槃界處。",
        "translation": "All of them are the conjunction of bodhisattvas, which means they're in the state of nirvāṇa without remainder.",
        "source": "T17n0833_001:0881b27_6"
    },
    {
        "source_sentence": "大仙當知：眾生如是無處和合。",
        "translation": "Great sage, you should know that there's no place where sentient beings are thus united.",
        "source": "T17n0833_001:0881b28_7"
    },
    {
        "source_sentence": "「大仙當知：譬如種種小河、大河，入大海已皆同一味。",
        "translation": "Great sage, you should know that it's like the various small rivers and large rivers that enter the ocean and all have the same taste.",
        "source": "T17n0833_001:0881c01_0"
    },
    {
        "source_sentence": "如是，大仙！",
        "translation": "So it is, great sage!",
        "source": "T17n0833_001:0881c02_1"
    },
    {
        "source_sentence": "諸眾生界諸漏盡已皆解脫味，一切平等，菩薩和合。",
        "translation": "All sentient beings' contaminants in the realm have all ended, and they're all liberated by the taste of liberation, which is equal to that of bodhisattva union.",
        "source": "T17n0833_001:0881c02_2"
    },
    {
        "source_sentence": "「又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0881c04_0"
    },
    {
        "source_sentence": "若諸眾生生死海中而和合者，我說彼合非是和合。",
        "translation": "If sentient beings are combined in the ocean of birth-and-death, I say that they are combined and not combined.",
        "source": "T17n0833_001:0881c04_1"
    },
    {
        "source_sentence": "又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0881c05_2"
    },
    {
        "source_sentence": "譬如飛蛾，風吹和合，離風則散。",
        "translation": "It's like a flying moth that combines with the blowing of wind and disperses when it's free of wind.",
        "source": "T17n0833_001:0881c05_3"
    },
    {
        "source_sentence": "如是，大仙！",
        "translation": "So it is, great sage!",
        "source": "T17n0833_001:0881c06_4"
    },
    {
        "source_sentence": "諸眾生界迭互業縛，行地獄行生地獄中地獄和合。",
        "translation": "Sentient beings in the realm of sentient beings are repeatedly bound by each other's karmic bonds, and they travel through hell and are born in hell.",
        "source": "T17n0833_001:0881c06_5"
    },
    {
        "source_sentence": "大仙當知：眾生如是迭互業縛，行餓鬼行生餓鬼中餓鬼和合、行畜生行生畜生中畜生和合、行人天行生人天中人天和合。」",
        "translation": "Great sage, you should know that sentient beings are thus bound to each other's karmic bonds, the combination of hungry ghosts who travel among hungry ghosts and those who travel among hungry ghosts, the combination of",
        "source": "T17n0833_001:0881c07_6"
    },
    {
        "source_sentence": "大仙復言：「一切自在一切智者！",
        "translation": "Again, the great sage said, All self-contained and all wise!",
        "source": "T17n0833_001:0881c11_0"
    },
    {
        "source_sentence": "世間應供！",
        "translation": "The world should make offerings!",
        "source": "T17n0833_001:0881c11_1"
    },
    {
        "source_sentence": "更為我說，云何得知此人中生某甲眾生？",
        "translation": "I'll explain further, how do you know that a certain sentient being is born among these people?",
        "source": "T17n0833_001:0881c11_2"
    },
    {
        "source_sentence": "何處和合而來生此？」",
        "translation": "Where is it combined and produced here?",
        "source": "T17n0833_001:0881c12_3"
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, Great sage!",
        "source": "T17n0833_001:0881c13_4"
    },
    {
        "source_sentence": "若有眾生於地獄中和合而來生人中者，迭互相見則生惡心，彼此相憎；",
        "translation": "If there are sentient beings who have been united in hell and come to be reborn among humans, when they see each other again and again, evil thoughts will arise in their minds.",
        "source": "T17n0833_001:0881c13_5"
    },
    {
        "source_sentence": "迭互相見，或有頭痛、或放大便、或失小便。",
        "translation": "Seeing each other, they may have headaches, or they may exhale and exhale, or they may lose exhalation.",
        "source": "T17n0833_001:0881c15_6"
    },
    {
        "source_sentence": "大仙當知：此是地獄和合眾生人中生相。",
        "translation": "Great sage, you should know that this is the mark of birth among humans in hell where sentient beings are united.",
        "source": "T17n0833_001:0881c16_7"
    },
    {
        "source_sentence": "人中若有如是相者，於地獄中和合而來，應如是知。」",
        "translation": "If someone among humans has such a characteristic, they'll come together in hell and know it like this.",
        "source": "T17n0833_001:0881c17_8"
    },
    {
        "source_sentence": "大仙復言：「世界光明一切智者！",
        "translation": "Again, the great sage said, All-knower of the world's light!",
        "source": "T17n0833_001:0881c19_0"
    },
    {
        "source_sentence": "更為我說，云何得知於畜生中彼此和合來生人中，復有何相？」",
        "translation": "Furthermore, I'll explain, how do you know what characteristics there are in the animals that are combined with each other and come to be born among humans?",
        "source": "T17n0833_001:0881c19_1"
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, Great sage!",
        "source": "T17n0833_001:0881c21_2"
    },
    {
        "source_sentence": "若人前身於畜生中和合而來生人中者，迭互相見則生瞋心，更求過短，",
        "translation": "If someone's former body is combined with an animal and comes to be born among humans, then they'll see each other again and again, become angry, and furthermore seek faults.",
        "source": "T17n0833_001:0881c21_3"
    },
    {
        "source_sentence": "常相伺便，欲為惱亂。",
        "translation": "They always look at each other for an advantage, and their desires are disturbed.",
        "source": "T17n0833_001:0881c23_4"
    },
    {
        "source_sentence": "大仙當知：此是畜生和合眾生人中生相。",
        "translation": "Great sage, you should know that this is the mark of birth among humans among animals combined with sentient beings.",
        "source": "T17n0833_001:0881c23_5"
    },
    {
        "source_sentence": "人中若有如是相者，於畜生中和合而來，應如是知。",
        "translation": "If there's such a characteristic among humans, it should be known in this way that it comes from the convergence of animals.",
        "source": "T17n0833_001:0881c24_6"
    },
    {
        "source_sentence": "「又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0881c25_7"
    },
    {
        "source_sentence": "若人前身於餓鬼中和合而來生人中者，愛樂臭氣，性貪飲食，慳惜不施；",
        "translation": "If someone, in their former existence, came to be born among humans through the coming together of hungry ghosts, they will delight in smelly air and by nature desire food and drink. They will be stingy and not give anything.",
        "source": "T17n0833_001:0881c26_0"
    },
    {
        "source_sentence": "於餓鬼中同處來者，見其富樂則生嫉心，悕望他物。",
        "translation": "Someone who comes from the same place among hungry ghosts and sees their wealth and happiness becomes jealous, expecting things from others.",
        "source": "T17n0833_001:0881c27_1"
    },
    {
        "source_sentence": "大仙當知：此是餓鬼和合眾生人中生相。",
        "translation": "Great sage, you should know that this is the mark of being born among humans when hungry ghosts combine with sentient beings.",
        "source": "T17n0833_001:0881c28_2"
    },
    {
        "source_sentence": "人中若有如是相者，於餓鬼中和合而來，應如是知。",
        "translation": "If someone among humans has such a characteristic, they'll come in harmony with hungry ghosts, and they should know it this way.",
        "source": "T17n0833_001:0881c29_3"
    },
    {
        "source_sentence": "「又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0882a03_0"
    },
    {
        "source_sentence": "若人前身於人道中異處和合復為人者，彼人相見則生染心。",
        "translation": "If someone's prior body is combined with another place in the human path and becomes a person again, that person's defiled mind arises when they see each other.",
        "source": "T17n0833_001:0882a03_1"
    },
    {
        "source_sentence": "人中若有如是相者，本於人中和合而來，應如是知。」",
        "translation": "If there's such a characteristic among humans, it should be known in this way because it came from the convergence of humans.",
        "source": "T17n0833_001:0882a04_2"
    },
    {
        "source_sentence": "彼大仙人問言：「世尊！",
        "translation": "The great sage asked, Bhagavān!",
        "source": "T17n0833_001:0882a06_0"
    },
    {
        "source_sentence": "若天和合退生人中，彼有何相？",
        "translation": "If the gods combine and regress, what's the characteristic of that among humans who are born back?",
        "source": "T17n0833_001:0882a06_1"
    },
    {
        "source_sentence": "復云何知？」",
        "translation": "How do you know it?",
        "source": "T17n0833_001:0882a07_2"
    },
    {
        "source_sentence": "佛言：「大仙！",
        "translation": "The Buddha said, Great sage!",
        "source": "T17n0833_001:0882a07_3"
    },
    {
        "source_sentence": "若人前身天中和合來生人者，迭互相見樂看不捨。",
        "translation": "If a person's former body is combined with the gods and comes to be born as a human being, they'll see each other joyfully and look at each other without abandoning it.",
        "source": "T17n0833_001:0882a07_4"
    },
    {
        "source_sentence": "人中若有如是相者，本於天中和合而來，應如是知。",
        "translation": "If there's such a characteristic among humans, it should be known in this way because it originally came from the convergence of gods.",
        "source": "T17n0833_001:0882a08_5"
    },
    {
        "source_sentence": "「大仙當知：眾生如是和合因相。」",
        "translation": "Great sage, you should know that sentient beings thus combine causes and characteristics.",
        "source": "T17n0833_001:0882a10_6"
    },
    {
        "source_sentence": "爾時，大仙名光明炬聞佛說已，心生歡喜，而白佛言：「世尊！",
        "translation": "At that point, the great sage named Torch of Light heard what the Buddha taught, rejoicing in his heart, and said to the Buddha, Bhagavān!",
        "source": "T17n0833_001:0882a11_0"
    },
    {
        "source_sentence": "若有不求一切智者，如是眾生一切所作空無所獲。」",
        "translation": "If someone doesn't seek omniscience, then all the things that sentient beings do are empty and nothing is obtained.",
        "source": "T17n0833_001:0882a12_1"
    },
    {
        "source_sentence": "爾時，世尊告光明炬大仙人言：「如汝所問眾生身內微細我者，大仙當聽：若有分別得眾生者，",
        "translation": "At that time, the World-honored One said to the great sage Candracchattra: Just as you have questioned me about the subtle self within the bodies of sentient beings, the great sage will listen.",
        "source": "T17n0833_001:0882a13_2"
    },
    {
        "source_sentence": "彼則分別眾生細我。",
        "translation": "They then discriminate the subtle self of sentient beings.",
        "source": "T17n0833_001:0882a15_3"
    },
    {
        "source_sentence": "大仙當知：譬如有人生盲無眼，有人問言：『何者白色？』",
        "translation": "Great sage, you should know that it's like a person who's blind and lacks eyes when someone asks, 'What's white?'",
        "source": "T17n0833_001:0882a16_4"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T17n0833_001:0882a17_5"
    },
    {
        "source_sentence": "彼生盲人不曾見色，能說如是一種色不？」",
        "translation": "Is that blind person born blind who hasn't seen form, can he say this kind of form?",
        "source": "T17n0833_001:0882a17_6"
    },
    {
        "source_sentence": "大仙答言：「不能說也。」",
        "translation": "The great sage replied, I can't explain it.",
        "source": "T17n0833_001:0882a18_7"
    },
    {
        "source_sentence": "佛言：「如是，如是。",
        "translation": "The Buddha said, So it is, so it is.",
        "source": "T17n0833_001:0882a19_8"
    },
    {
        "source_sentence": "大仙！",
        "translation": "Great sage!",
        "source": "T17n0833_001:0882a19_9"
    },
    {
        "source_sentence": "彼生盲人眼不曾見，故不能說。",
        "translation": "Because the eyes of those born blind have never seen it, they can't explain it.",
        "source": "T17n0833_001:0882a19_10"
    },
    {
        "source_sentence": "我亦如是，不見眾生微細內我，是故不說。",
        "translation": "The self is also like this: because one does not see the subtle, internal self of beings. That is why it is not spoken of.",
        "source": "T17n0833_001:0882a20_11"
    },
    {
        "source_sentence": "「又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0882a22_0"
    },
    {
        "source_sentence": "眼非眾生；",
        "translation": "The eye is not sentient beings.",
        "source": "T17n0833_001:0882a22_1"
    },
    {
        "source_sentence": "如是，非耳、非鼻、非舌、非身、非意得眾生名。",
        "translation": "Thus, it's not the ear, nose, tongue, body, or mind that get the names of sentient beings.",
        "source": "T17n0833_001:0882a22_2"
    },
    {
        "source_sentence": "又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0882a23_3"
    },
    {
        "source_sentence": "非五取陰得眾生名，非十八界、非十二分、十二因緣得眾生名。",
        "translation": "It's not that the five acquired aggregates get the names of sentient beings, and it's not that the 18 elements, 12 parts, or 12 causes and conditions get the names of sentient beings.",
        "source": "T17n0833_001:0882a23_4"
    },
    {
        "source_sentence": "又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0882a25_5"
    },
    {
        "source_sentence": "亦非內空得眾生名、亦非外空、非內外空得眾生名。",
        "translation": "Nor does internal emptiness get the names of sentient beings, nor does external emptiness get the names of sentient beings, nor does internal and external emptiness get the names of sentient beings.",
        "source": "T17n0833_001:0882a25_6"
    },
    {
        "source_sentence": "「大仙當知：眼念不住，變異不停；",
        "translation": "Great sage, you should know that thought of the eye does not abide; change does not abide.",
        "source": "T17n0833_001:0882a27_0"
    },
    {
        "source_sentence": "如是，耳、鼻、舌、身、意等皆念不住，變異不停。",
        "translation": "Thus, the ear, nose, tongue, body, mind, and so forth all don't abide in mindfulness, and change doesn't abide.",
        "source": "T17n0833_001:0882a27_1"
    },
    {
        "source_sentence": "如是，大仙！",
        "translation": "So it is, great sage!",
        "source": "T17n0833_001:0882a28_2"
    },
    {
        "source_sentence": "五陰亦爾，一念不住，變異不停。",
        "translation": "So it is with the five aggregates: one thought does not abide, and change does not abide.",
        "source": "T17n0833_001:0882a28_3"
    },
    {
        "source_sentence": "如是，大仙！",
        "translation": "So it is, great sage!",
        "source": "T17n0833_001:0882a29_4"
    },
    {
        "source_sentence": "三十六種不淨之物皆念不住，變異不停。",
        "translation": "The thirty-six kinds of impure things all don't abide in mindfulness, and change doesn't abide.",
        "source": "T17n0833_001:0882a29_5"
    },
    {
        "source_sentence": "如是等中無眾生名。",
        "translation": "In these, there's no name for sentient beings.",
        "source": "T17n0833_001:0882b01_6"
    },
    {
        "source_sentence": "「又復，大仙！",
        "translation": "Again, great sage!",
        "source": "T17n0833_001:0882b03_0"
    },
    {
        "source_sentence": "色物和合數名眾生。",
        "translation": "When form and things are combined, they're called sentient beings.",
        "source": "T17n0833_001:0882b03_1"
    },
    {
        "source_sentence": "若人思量分分觀察，彼不得命、不得養育富特伽耶、亦不得人摩那婆等。",
        "translation": "If someone contemplates and partially observes, they won't attain life, no nourishment, purgatory, personality, manas, etc.",
        "source": "T17n0833_001:0882b03_2"
    },
    {
        "source_sentence": "「大仙當知：若有眾生，如來不說四聖諦法；",
        "translation": "Great sage, you should know that if there are any sentient beings the Tathagata does not teach the dharma of the four noble truths.",
        "source": "T17n0833_001:0882b06_0"
    },
    {
        "source_sentence": "若無眾生，則是如來。",
        "translation": "If there are no sentient beings, then it's the Tathāgata.",
        "source": "T17n0833_001:0882b07_0"
    },
    {
        "source_sentence": "若不知法，如和集取、如心取得。」",
        "translation": "If you don't know the teaching, it's like collecting and apprehending it with harmony and attaining it with mind.",
        "source": "T17n0833_001:0882b07_1"
    },
    {
        "source_sentence": "爾時，大仙光明炬言：「世尊！",
        "translation": "It was then that the great sage's torch of light said, Bhagavān!",
        "source": "T17n0833_001:0882b09_0"
    },
    {
        "source_sentence": "我光明炬自從今日求一切智。",
        "translation": "From today, the torch of my light seeks omniscience.",
        "source": "T17n0833_001:0882b09_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T17n0833_001:0882b10_2"
    },
    {
        "source_sentence": "若一大劫為一日夜，數如是日三十為月，數如是月十二為歲，數如是歲以成一劫。",
        "translation": "If a great kalpa is one day and night, the number of such days is thirty as months, and the number of such months is twelve as years, and the number of such years makes an eon.",
        "source": "T17n0833_001:0882b10_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T17n0833_001:0882b12_4"
    },
    {
        "source_sentence": "我寧如是無邊劫中常住火坑。",
        "translation": "I'd rather thus always stay in a burning pit for an infinite eon.",
        "source": "T17n0833_001:0882b12_5"
    },
    {
        "source_sentence": "須彌樓山高大乃至阿迦尼吒，我寧如是無邊劫中在彼山上念念自墮，投身在地。",
        "translation": "“World-honored One, it is as high as Mount Sumeru and as high as the Akaniṣṭha. How could I have fallen to the ground while remaining on that mountain for an infinite number of kalpas?",
        "source": "T17n0833_001:0882b13_6"
    },
    {
        "source_sentence": "如劫火燒五處熾然，我寧如是無邊劫中常以如是五火自炙。",
        "translation": "It's like when the fire of an eon burns five places that are blazing hot, and I'd rather always burn myself with these five kinds of fire for such an endless eon.",
        "source": "T17n0833_001:0882b15_7"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T17n0833_001:0882b16_8"
    },
    {
        "source_sentence": "我寧忍受如是等苦，而終不能捨一切智，求一切智因緣精進，我不休息。」",
        "translation": "I'd rather endure such suffering than give up omniscience and pursue the causes and conditions for omniscience with effort, and I won't rest.",
        "source": "T17n0833_001:0882b16_9"
    },
    {
        "source_sentence": "爾時，五通諸仙人等皆近世尊，復從座起白世尊言：「我從今日求阿耨多羅三藐三菩提，",
        "translation": "At that time, all the holy ones of the five supernatural powers approached the World-honored One. Again, they rose from their seats and said to him: From this day forthwith I seek highest, complete enlightenment.",
        "source": "T17n0833_001:0882b19_0"
    },
    {
        "source_sentence": "如力所堪發勤精進。」",
        "translation": "It's as powerful as the ability to give rise to diligence and effort.",
        "source": "T17n0833_001:0882b21_1"
    },
    {
        "source_sentence": "爾時，世尊即於仙人如是語已，眉間放光——其光名曰毘尼婆帝。",
        "translation": "After the Bhagavān had spoken these words to the sage, he radiated a light between his eyebrows - that light is called vinipāda.",
        "source": "T17n0833_001:0882b21_2"
    },
    {
        "source_sentence": "此光出已，普照十方，彼十方處一切諸佛眉間亦放如是光明。",
        "translation": "After this light emerges, it shines in all ten directions, and between the eyebrows of all the buddhas in those ten directions also shines such a light.",
        "source": "T17n0833_001:0882b23_0"
    },
    {
        "source_sentence": "毘尼婆帝光明勢力，令此大地六種震動，謂震、等震，動、平等動，起、平等起，",
        "translation": "The power of the radiance of the light of the divine vision causes the earth to quake in six ways:",
        "source": "T17n0833_001:0882b24_1"
    },
    {
        "source_sentence": "西高東下、南高北下。",
        "translation": "The west is high, the east is low, and the south is high and the north is low.",
        "source": "T17n0833_001:0882b26_2"
    },
    {
        "source_sentence": "十方一切諸佛如來在上雨華散此佛會，天鼓妙聲甚可愛樂。",
        "translation": "All the buddha-tathāgatas of the ten directions rained flowers from above to scatter this Buddha assembly, and the wonderful sound of the celestial drum was very pleasing.",
        "source": "T17n0833_001:0882b26_3"
    },
    {
        "source_sentence": "乾闥婆王作五分樂供養如來、讚歎世尊，風吹天香以熏如來。",
        "translation": "The king of gandharva made a five-part offering to the Tathāgata and praised the Bhagavān, and a wind blew heavenly fragrance to perfume the Tathāgata.",
        "source": "T17n0833_001:0882b28_4"
    },
    {
        "source_sentence": "菩薩歡喜，以諸瓔珞擲置空中在如來上，華香、燒香、妙鬘、塗香、散種種香、種種妙衣、幢蓋、繒幡供養如來。",
        "translation": "Rejoicing, the bodhisattva tossed his jewelry into the air and placed it above the Tathāgata, offering flowers, incense, burning incense, fine silks, ointments, various kinds of fragrances, various kind",
        "source": "T17n0833_001:0882b29_5"
    },
    {
        "source_sentence": "諸天歡喜，於虛空中雨曼陀羅、大曼陀羅。",
        "translation": "The gods rejoiced and rained down maṇḍalas and great maṇḍalas from the sky.",
        "source": "T17n0833_001:0882c03_0"
    },
    {
        "source_sentence": "一切大眾心生歡喜，以己所著妙好衣服用奉如來。",
        "translation": "The whole assembly was greatly delighted and presented the beautiful clothes they wore to the Tathāgata.",
        "source": "T17n0833_001:0882c04_0"
    },
    {
        "source_sentence": "爾時，此處釋迦如來毘尼婆帝光明——上去乃至遍到阿迦尼吒諸天宮殿、下去乃至阿鼻地獄——如是照已，",
        "translation": "At the time, this was the place where the Tathāgata Śākyamuni Tathāgata Vaiśravaṇa's radiance rose up to reach all the celestial palaces of the Akaniṣṭha gods and descended down to the avīci hell",
        "source": "T17n0833_001:0882c06_0"
    },
    {
        "source_sentence": "圍繞十方諸佛世尊，然後還來入世尊頂。",
        "translation": "Surrounded by the buddhas and world-honored ones of the ten directions, they then returned and entered the Bhagavān's head.",
        "source": "T17n0833_001:0882c08_1"
    },
    {
        "source_sentence": "「朝日釋迦子，　　放光照十方，",
        "translation": "In the morning, the sun shines brightly on the Buddha-child Śākyamuni, Illumining all directions.",
        "source": "T17n0833_001:0882c09_2"
    },
    {
        "source_sentence": "　此非無因緣，　　唯願為我說。",
        "translation": "This is not without a cause or condition; Please explain it to me.",
        "source": "T17n0833_001:0882c09_2"
    },
    {
        "source_sentence": "　見人主奮迅，　　此眾皆生疑；",
        "translation": "Seeing the leader of the people rise up, All these beings all have doubts.",
        "source": "T17n0833_001:0882c09_2"
    },
    {
        "source_sentence": "　亦有歡喜意，　　清淨心悕望。",
        "translation": "They also have the intention to rejoice, and their minds are pure and expectant.",
        "source": "T17n0833_001:0882c09_2"
    },
    {
        "source_sentence": "　或有人合掌，　　或有言善哉，",
        "translation": "Some people joined their palms, and some said, Good!",
        "source": "T17n0833_001:0882c09_2"
    },
    {
        "source_sentence": "　唯願如來說，　　除斷眾生疑。",
        "translation": "May the Tathāgata explain it to remove the doubts of sentient beings.",
        "source": "T17n0833_001:0882c09_2"
    },
    {
        "source_sentence": "　空中帝釋王、　　梵王世界主，",
        "translation": "In the sky are Indra, king of gods, Brahmā, lord of the world.",
        "source": "T17n0833_001:0882c09_2"
    },
    {
        "source_sentence": "　心皆生歡喜，　　讚歎實功德。",
        "translation": "Their minds all become joyous, Praising their true virtue.",
        "source": "T17n0833_001:0882c09_2"
    },
    {
        "source_sentence": "　諸天虛空中，　　雨種種妙華，",
        "translation": "The gods rain down various beautiful flowers in the sky.",
        "source": "T17n0833_001:0882c09_2"
    },
    {
        "source_sentence": "　多有諸音樂，　　不擊自然鳴。」",
        "translation": "There's a lot of music that naturally sounds without being struck.",
        "source": "T17n0833_001:0882c09_2"
    },
    {
        "source_sentence": "爾時，慧命須菩提以妙伽陀請如來曰：爾時，世尊即告慧命須菩提言：「汝須菩提！",
        "translation": "At that point, Wisdom Life Subuddhi asked the Tathāgata with a marvelous verse, saying, At that point, the Bhagavān addressed Wisdom Life Subuddhi, saying, You must have enlightenment!",
        "source": "T17n0833_001:0882c09_2"
    },
    {
        "source_sentence": "見光明炬大仙人不？",
        "translation": "Do you see the great sage torch of light?",
        "source": "T17n0833_001:0882c21_3"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T17n0833_001:0882c22_4"
    },
    {
        "source_sentence": "是人未來月光世界當得成佛，號毘婆尸如來、應、正遍知，此賢劫中一千如來最後如來同時出世。",
        "translation": "That person will become a buddha in the moonlight world in the future, called Vipaśyin Tathāgata, Arhat, Perfectly Enlightened One, and the last of the thousand tathāgatas in this good eon, the Tathāgata",
        "source": "T17n0833_001:0882c22_5"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T17n0833_001:0882c24_6"
    },
    {
        "source_sentence": "若有眾生聞毘婆尸如來名者，皆蒙威力——如如意珠，須者皆得。",
        "translation": "If there are sentient beings who hear the names of the Tathāgata Vipaśyin, they'll all attain their authority - just like the wish-granting pearl that those who need it will attain.",
        "source": "T17n0833_001:0882c25_7"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T17n0833_001:0882c26_8"
    },
    {
        "source_sentence": "八萬四千諸大仙人聞此法門得不退地。",
        "translation": "Eighty-four thousand great sages heard this teaching and attained the stage of nonretrogression.",
        "source": "T17n0833_001:0882c26_9"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T17n0833_001:0882c27_10"
    },
    {
        "source_sentence": "是等一切，彌勒世尊佛法之中當得十地，復三百劫生自燈明如來、應、正遍知佛之世界。",
        "translation": "All of these, Maitreya, Bhagavān, will attain the tenth ground in the buddha-dharma of the Bhagavān, and another 300 eons will give rise to the self-illuminating Tathāgata, Arhat,",
        "source": "T17n0833_001:0882c27_11"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T17n0833_001:0883a01_0"
    },
    {
        "source_sentence": "無量菩薩聞此法門，即時皆得首楞嚴三昧、音聲智三昧、受勝位三昧、如幻三昧、界勝三昧、慧王三昧、海藏三昧、地藏三昧、虛空藏三昧、得光明三昧。",
        "translation": "When measureless bodhisattvas hear this teaching, they immediately attain the śūraṃgama-samādhi, the sound wisdom samādhi, the superior state samādhi, the illusory samādhi, the superior realm samādhi, the king",
        "source": "T17n0833_001:0883a01_1"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T17n0833_001:0883a04_2"
    },
    {
        "source_sentence": "有恒河沙億數諸天，一切皆得無生法忍；",
        "translation": "There were as many celestial beings as there are grains of sand in the Ganges River, all attaining the forbearance of the nonorigination of things.",
        "source": "T17n0833_001:0883a04_3"
    },
    {
        "source_sentence": "無量比丘、比丘尼、優婆塞、優婆夷證阿羅漢。",
        "translation": "Measureless monks, nuns, laymen, and laymen realize arhatship.",
        "source": "T17n0833_001:0883a05_4"
    },
    {
        "source_sentence": "須菩提！",
        "translation": "Subhūti!",
        "source": "T17n0833_001:0883a06_5"
    },
    {
        "source_sentence": "恒河沙數天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，",
        "translation": "gods as numerous as the grains of sand in the Ganges River, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans and nonhumans.",
        "source": "T17n0833_001:0883a07_0"
    },
    {
        "source_sentence": "發阿耨多羅三藐三菩提心。",
        "translation": "He arouses the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T17n0833_001:0883a08_1"
    },
    {
        "source_sentence": "「須菩提！",
        "translation": "Subhūti!",
        "source": "T17n0833_001:0883a09_2"
    },
    {
        "source_sentence": "見是因緣，如來放此毘尼婆帝光明普照。」",
        "translation": "Seeing these causes and conditions, the Tathāgata radiates this light of Vaiśravaṇa to illuminate them all.",
        "source": "T17n0833_001:0883a09_3"
    },
    {
        "source_sentence": "爾時，世尊怡然微笑，出自舌根遍覆己面。",
        "translation": "At that point, the Bhagavān smiled joyfully and produced his own tongue faculty to cover his face.",
        "source": "T17n0833_001:0883a11_0"
    },
    {
        "source_sentence": "彼舌根中出無量色、出種種色——所謂青、黃、赤、白等色、紫頗梨色——遍至無量無邊世界，",
        "translation": "In the middle of his tongue, he produces measureless forms and various forms-the so-called blue, yellow, red, white, and purple colors-that pervade measureless and limitless worlds.",
        "source": "T17n0833_001:0883a12_0"
    },
    {
        "source_sentence": "然後還來入世尊足。",
        "translation": "Then he returned and entered the Bhagavān's feet.",
        "source": "T17n0833_001:0883a13_1"
    },
    {
        "source_sentence": "爾時，無盡意菩薩從座而起，整服一廂，右膝著地，合掌向佛白言：「世尊！",
        "translation": "At that point, the Bodhisattva of Inexhaustible Will rose from his seat, straightened his robes in a single room, knelt with his right knee on the ground, joined his palms and said to the Buddha, Bhag",
        "source": "T17n0833_001:0883a14_2"
    },
    {
        "source_sentence": "若無因緣，如來不笑。",
        "translation": "If there are no causes and conditions, the Tathāgata won't laugh.",
        "source": "T17n0833_001:0883a16_3"
    },
    {
        "source_sentence": "今者世尊何因緣笑？」",
        "translation": "What's the reason the Bhagavān is smiling now?",
        "source": "T17n0833_001:0883a16_4"
    },
    {
        "source_sentence": "爾時，世尊告無盡意菩薩言：「善男子！",
        "translation": "It was then that the Bhagavān addressed the Bodhisattva of Inexhaustible Mind, saying, Good sons!",
        "source": "T17n0833_001:0883a17_5"
    },
    {
        "source_sentence": "我為饒益不信眾生出舌而笑，非妄語人有如是舌。」",
        "translation": "It's for the benefit of sentient beings who don't believe that they laugh with their tongues, and those who don't speak falsely have such tongues.",
        "source": "T17n0833_001:0883a17_6"
    },
    {
        "source_sentence": "爾時，無盡意菩薩白佛言：「世尊！",
        "translation": "It was then that the Bodhisattva of Inexhaustible Will said to the Buddha, Bhagavān!",
        "source": "T17n0833_001:0883a20_0"
    },
    {
        "source_sentence": "若善男子、若善女人，此法門中能為他人演說一偈，得幾許福？」",
        "translation": "If good men and good women can explain a single verse for others in this teaching, how much merit will they attain?",
        "source": "T17n0833_001:0883a20_1"
    },
    {
        "source_sentence": "佛言：「善男子！",
        "translation": "The Buddha said, Good man!",
        "source": "T17n0833_001:0883a22_2"
    },
    {
        "source_sentence": "十方世界盡佛所見佛眼境界，所有諸佛一切供養、一切樂具皆以供養，",
        "translation": "In all the worlds of the ten directions, in all the spheres of the eye of buddha-eye seen by all Buddhas, they honor and provide offerings to all enlightened ones.",
        "source": "T17n0833_001:0883a22_3"
    },
    {
        "source_sentence": "乃至諸佛入涅槃已，為作寶塔，所有功德；",
        "translation": "The enlightening beings, having entered nirvana, make jeweled stupas for the sake of all their virtues.",
        "source": "T17n0833_001:0883a24_4"
    },
    {
        "source_sentence": "若復有能為他說此說實義句法門一偈，得福甚多，勝前福德。",
        "translation": "If someone else can explain this one verse of the true meaning of the Dharma teaching for others, they'll attain a great deal of merit that's superior to the preceding merit.",
        "source": "T17n0833_001:0883a25_5"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T17n0833_001:0883a27_0"
    },
    {
        "source_sentence": "若於說此勝法門者生清淨心，讚言善哉，如是之人則為讚歎一切諸佛；",
        "translation": "If someone were to give rise to a pure mind and praise those who expound this excellent doctrine, such a person would praise all buddhas.",
        "source": "T17n0833_001:0883a27_1"
    },
    {
        "source_sentence": "若復有能供養之者，與供養我等無有異。」",
        "translation": "If there's another person who can make an offering, it's no different from making an offering to us.",
        "source": "T17n0833_001:0883a28_2"
    },
    {
        "source_sentence": "爾時，世尊普遍觀察一切眾會。",
        "translation": "At the time, the Bhagavān universally observed all the assemblies.",
        "source": "T17n0833_001:0883b01_0"
    },
    {
        "source_sentence": "既觀察已，說如是言：「我今實語。",
        "translation": "After observing it, he said this, Now, I'll tell you the truth.",
        "source": "T17n0833_001:0883b01_1"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T17n0833_001:0883b02_2"
    },
    {
        "source_sentence": "當有地處隨於何處有此法門，住彼地處為一切佛之所觀察。",
        "translation": "Wherever there's a place where this teaching exists, and wherever they live, they'll be observed by all buddhas.",
        "source": "T17n0833_001:0883b02_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T17n0833_001:0883b04_4"
    },
    {
        "source_sentence": "此法門者，於當來世閻浮提中眾生如藥。",
        "translation": "This dharma-gate means that in the future, sentient beings in Jambudvīpa will be like medicine.",
        "source": "T17n0833_001:0883b04_5"
    },
    {
        "source_sentence": "若有能於如是法門三種修行——若讀、若誦、若為他說——彼人則與佛在世時請轉法輪無有差別。",
        "translation": "If someone can thus cultivate these three kinds of cultivation of the teaching-whether they read, recite it, or teach it to others-then they're no different from those who are invited to turn the Dharma wheel when the Buddha is in the",
        "source": "T17n0833_001:0883b05_6"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T17n0833_001:0883b08_0"
    },
    {
        "source_sentence": "若能書寫如是法門，彼人易得阿耨多羅三藐三菩提則為不難，一切佛藏皆能住持。",
        "translation": "If someone can write such a teaching, it won't be difficult for them to easily attain unsurpassed, correct, and complete enlightenment, and all the buddha collections will be able to maintain it.",
        "source": "T17n0833_001:0883b08_1"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T17n0833_001:0883b10_2"
    },
    {
        "source_sentence": "行惡道者，如是法門不逕其耳。",
        "translation": "Those who travel in a bad path don't follow such a teaching without following it.",
        "source": "T17n0833_001:0883b10_3"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T17n0833_001:0883b11_4"
    },
    {
        "source_sentence": "若有眾生如是法門一逕耳者，捨人身已則生清淨佛之世界。",
        "translation": "If there are sentient beings who thus follow the Dharma teaching with a single line of hair, then after abandoning their bodies, they'll be born in the world of pure buddhahood.",
        "source": "T17n0833_001:0883b11_5"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T17n0833_001:0883b12_6"
    },
    {
        "source_sentence": "若有供養一千諸佛種諸善根，如是法門乃逕其耳。",
        "translation": "If someone were to make offerings to the good roots planted by 1,000 buddhas, such a dharma-gate would cause them to do so.",
        "source": "T17n0833_001:0883b12_7"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T17n0833_001:0883b14_8"
    },
    {
        "source_sentence": "若善男子、若善女人聞此法門，聞已生信，受持、讀誦、能為他說，我說彼人菩提在手，",
        "translation": "Good men and good women hear this teaching, and having heard it, they become convinced, retain it, recite it, and can teach it to others. I will tell them that their enlightenment is in their hands",
        "source": "T17n0833_001:0883b14_9"
    },
    {
        "source_sentence": "我說彼人必得五眼、自是已後諸根不劣、臨命盡時不失正念。",
        "translation": "I say that person will surely attain the five eyes. After this, their faculties won't be weak and they won't lose right mindfulness when their life ends.",
        "source": "T17n0833_001:0883b16_10"
    },
    {
        "source_sentence": "彼人當得一切諸佛和集三昧、毘盧遮那奮迅三昧、陀羅尼藏三昧、珠印髻三昧、授記三昧、觀世印三昧、無字篋三昧；",
        "translation": "That person will attain concentration on the harmony of all buddhas, concentration on the vigor of Vairocana, concentration on the store of dhāraṇī collections, concentration on the topknot of the jeweled seal, concentration on prediction, concentration on",
        "source": "T17n0833_001:0883b17_11"
    },
    {
        "source_sentence": "得一切法勝陀羅尼、斷疑陀羅尼、得第一義決定陀羅尼，得如是等無量百千陀羅尼門；",
        "translation": "They found innumerable hundreds of thousands of such kinds of spells.",
        "source": "T17n0833_001:0883b20_12"
    },
    {
        "source_sentence": "當得五通，隨心憶念退生自在。」",
        "translation": "You'll attain the five supernormal powers, and you'll be able to recall them in your mind and regress freely.",
        "source": "T17n0833_001:0883b22_13"
    },
    {
        "source_sentence": "爾時，世尊告文殊師利法王子言：「文殊師利！",
        "translation": "It was then that the Bhagavān addressed Mañjuśrī, the prince of the Dharma, saying, Mañjuśrī!",
        "source": "T17n0833_001:0883b24_0"
    },
    {
        "source_sentence": "汝已供養多佛世尊，則能護念如是法門，復能處處廣為他說。",
        "translation": "Once you've made offerings to many buddhas and world-honored ones, then you can guard the mindfulness of such a teaching, and you can also explain it widely for others everywhere.",
        "source": "T17n0833_001:0883b25_0"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T17n0833_001:0883b26_1"
    },
    {
        "source_sentence": "汝所供養、恭敬、給侍幾許諸佛，尊重、讚歎所有善根，文殊師利！",
        "translation": "O Mañjuśrī, how many buddhas have you honored, revered, venerated, and served you, respecting and praising the roots of goodness that you possess?",
        "source": "T17n0833_001:0883b26_2"
    },
    {
        "source_sentence": "於意云何？",
        "translation": "What do you think?",
        "source": "T17n0833_001:0883b28_3"
    },
    {
        "source_sentence": "如是善根為有邊際？",
        "translation": "Is there a limit to the number of such roots of merit?",
        "source": "T17n0833_001:0883b28_4"
    },
    {
        "source_sentence": "為無邊際？",
        "translation": "For the sake of limitlessness?",
        "source": "T17n0833_001:0883b28_5"
    },
    {
        "source_sentence": "可數量不？」",
        "translation": "Can it be counted?",
        "source": "T17n0833_001:0883b29_6"
    },
    {
        "source_sentence": "文殊師利答言：「世尊！",
        "translation": "Mañjuśrī replied, Bhagavān!",
        "source": "T17n0833_001:0883b29_7"
    },
    {
        "source_sentence": "不可數量。」",
        "translation": "They can't be counted.",
        "source": "T17n0833_001:0883b29_8"
    },
    {
        "source_sentence": "佛言：「文殊師利！",
        "translation": "The Buddha said, Mañjuśrī!",
        "source": "T17n0833_001:0883c01_9"
    },
    {
        "source_sentence": "若能於此娑婆世界五濁亂時為他廣說如是法門，其福過彼。",
        "translation": "If someone were to explain this teaching extensively for others during the five turbidities in this sahā world, their merit would be greater than that.",
        "source": "T17n0833_001:0883c01_10"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T17n0833_001:0883c03_0"
    },
    {
        "source_sentence": "若汝唯以衣服、飲食、床敷臥具、病藥所須供養爾許諸佛如來，不為他說如是法門，",
        "translation": "If you only offer clothing, food and drink, beds, bedding, and medicine for illness to these buddha-tathāgatas as offerings, you won't teach them the Dharma teaching like this.",
        "source": "T17n0833_001:0883c03_1"
    },
    {
        "source_sentence": "汝於彼佛則為得罪。",
        "translation": "'In that Buddha, you've committed a sin.",
        "source": "T17n0833_001:0883c05_2"
    },
    {
        "source_sentence": "文殊師利！",
        "translation": "Mañjuśrī!",
        "source": "T17n0833_001:0883c05_3"
    },
    {
        "source_sentence": "若汝不曾供養一佛，為他廣說如是法門，汝則供養一切如來。」",
        "translation": "If you haven't ever offered support to a single Buddha and explained this teaching so extensively for others, you'll offer support to all the tathāgatas.",
        "source": "T17n0833_001:0883c05_4"
    },
    {
        "source_sentence": "世尊說已，文殊師利法王之子、光明炬等諸大仙人，一切眾會，并諸天、人、及阿修羅、乾闥婆等，",
        "translation": "After the Bhagavān had explained it, Mañjuśrī, the Dharma king's son, the great sages Candracchattra and so forth, all the assembled gods, humans, asuras, gandharvas, and so forth",
        "source": "T17n0833_001:0883c07_5"
    },
    {
        "source_sentence": "聞佛所說，歡喜讚歎。",
        "translation": "Having heard the Buddha’s discourse, they were delighted and praised.",
        "source": "T17n0833_001:0883c09_6"
    },
    {
        "source_sentence": "第一義法勝經",
        "translation": "Sutra of the Supreme Dharma of the First Meaning",
        "source": "T17n0833_001:0883c10_0"
    }
]