[
    {
        "source_sentence": "佛說大乘不思議神通境界經卷",
        "translation": "Foshuo dayan wuxing shentong zhuanqie jing",
        "source": "T17n0843_002:0925b07_0"
    },
    {
        "source_sentence": "中",
        "translation": "middle",
        "source": "T17n0843_002:0925b08_0"
    },
    {
        "source_sentence": "西天譯經三藏朝奉大夫",
        "translation": "translated scriptures of the Western Heavens by the Tripiṭaka Master朝奉大夫",
        "source": "T17n0843_002:0925b10_0"
    },
    {
        "source_sentence": "試光祿卿傳法大師賜紫",
        "translation": "試光祿卿傳法大師賜紫, Shi Guan luqing zhuanfa dashi zhi",
        "source": "T17n0843_002:0925b11_0"
    },
    {
        "source_sentence": "臣施護奉　詔譯",
        "translation": "translated by imperial edict",
        "source": "T17n0843_002:0925b12_0"
    },
    {
        "source_sentence": "◎爾時普華幢天子復白佛言：「世尊！",
        "translation": "It was then that the Universal Flower Banner Celestial Son again said to the Buddha, Bhagavān!",
        "source": "T17n0843_002:0925b13_0"
    },
    {
        "source_sentence": "今此妙吉祥菩薩摩訶薩發菩提心為久近耶？」",
        "translation": "How long has it been since this wonderfully auspicious bodhisattva Mahāsattva aroused the mind of enlightenment?",
        "source": "T17n0843_002:0925b13_1"
    },
    {
        "source_sentence": "佛言：「天子！",
        "translation": "The Buddha said, Son of God!",
        "source": "T17n0843_002:0925b14_2"
    },
    {
        "source_sentence": "此妙吉祥菩薩過於無量無邊殑伽沙數劫已發菩提心。",
        "translation": "This wonderfully auspicious bodhisattva has aroused the mind of enlightenment for measureless and limitless eons past as many eons as there are sands in the Ganges.",
        "source": "T17n0843_002:0925b15_3"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T17n0843_002:0925b16_4"
    },
    {
        "source_sentence": "我今為汝及諸大眾，略說其一。」",
        "translation": "Now, I'll briefly explain one of them for you and the masses.",
        "source": "T17n0843_002:0925b16_5"
    },
    {
        "source_sentence": "是時普華幢天子白佛言：「世尊！",
        "translation": "The Universal Flower Banner Celestial Son then said to the Buddha, Bhagavān!",
        "source": "T17n0843_002:0925b17_6"
    },
    {
        "source_sentence": "願為我等一切眾會，如理宣說。」",
        "translation": "May it be explained for us in all the assemblies as they are.",
        "source": "T17n0843_002:0925b17_7"
    },
    {
        "source_sentence": "佛言：「天子！",
        "translation": "The Buddha said, Son of God!",
        "source": "T17n0843_002:0925b18_8"
    },
    {
        "source_sentence": "過去度如微塵數劫，爾時此娑婆世界有佛，名普觀清淨音王如來、應供、正等正覺，",
        "translation": "In the past, as many eons ago as there are atoms in the polar mountain, there was a buddha in this sahā world named Universally Observing Pure Sound King, Tathāgata, Worthy of Offerings, Perfectly Enlightened.",
        "source": "T17n0843_002:0925b18_9"
    },
    {
        "source_sentence": "出現於世。",
        "translation": "They appear in the world.",
        "source": "T17n0843_002:0925b20_10"
    },
    {
        "source_sentence": "彼佛法中有一苾芻名清淨音，於彼法中出家修道得五神通。",
        "translation": "In that Buddha's teaching, there's a monk named Pure Sound who leaves home and cultivates the five supernormal powers in that teaching.",
        "source": "T17n0843_002:0925b21_11"
    },
    {
        "source_sentence": "時彼苾芻於四萬二千歲中，以種種香、華、燈、塗及眾妙具，供養彼佛，",
        "translation": "For a period of forty-two thousand years, that monk offered various kinds of incense, flowers, lamps, ointments, and other wonderful implements to the Buddha.",
        "source": "T17n0843_002:0925b22_12"
    },
    {
        "source_sentence": "種是善根，發於阿耨多羅三藐三菩提心。",
        "translation": "They plant these good roots and give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T17n0843_002:0925b24_13"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T17n0843_002:0925b25_0"
    },
    {
        "source_sentence": "於汝意云何，彼時清淨音苾芻豈異人乎？",
        "translation": "What do you think, isn't that a different person than the monk Śubhavyūha at the time?",
        "source": "T17n0843_002:0925b25_1"
    },
    {
        "source_sentence": "即今妙吉祥菩薩摩訶薩是。",
        "translation": "This is the present-day Marvelous Auspicious Bodhisattva Mahāsattva.",
        "source": "T17n0843_002:0925b26_2"
    },
    {
        "source_sentence": "汝等當知，此妙吉祥菩薩已於無量無邊殑伽沙數佛世尊所發菩提心，已度殑伽沙數眾生，",
        "translation": "You should know that this wonderfully auspicious enlightening being has already developed the aspiration for enlightenment in the company of buddhas as numerous as the number of grains of sand in the Ganges River, and has already liberated as many sentient beings as there are grains of sand.",
        "source": "T17n0843_002:0925b26_3"
    },
    {
        "source_sentence": "令住須陀洹、斯陀含、阿那含、阿羅漢果；",
        "translation": "He caused them to abide in the state of stream-enterer, the state of once-returner, the state of nonreturner, and the state of arhat.",
        "source": "T17n0843_002:0925b28_4"
    },
    {
        "source_sentence": "已度殑伽沙數眾生，令住緣覺果；",
        "translation": "He had already liberated as many sentient beings as there are grains of sand in the Ganges River, causing them to abide in the fruit of enlightenment.",
        "source": "T17n0843_002:0925b29_5"
    },
    {
        "source_sentence": "已度殑伽沙數眾生，令住初地，乃至已度殑伽沙數眾生，令住十地。",
        "translation": "He liberates sentient beings as numerous as grains of sand in the Ganges River and causes them to abide in the first ground, or he liberates sentient beings as numerous as grains of sand in the Ganges River and causes them to abide in the tenth ground.",
        "source": "T17n0843_002:0925c01_6"
    },
    {
        "source_sentence": "妙吉祥菩薩如是廣大種諸善根成就善法。",
        "translation": "Miaojixiang pusa thus vastly plants good roots and accomplishes good qualities.",
        "source": "T17n0843_002:0925c02_7"
    },
    {
        "source_sentence": "「復次天子！",
        "translation": "Furthermore, celestial sons!",
        "source": "T17n0843_002:0925c04_0"
    },
    {
        "source_sentence": "假使有人滿三千大千世界七寶布施如來，是人所獲功德其數甚多；",
        "translation": "“Even if someone were to fill the great manifold cosmos with a buddha named Seven Jeweled Charity, that person’s merit would be very great.",
        "source": "T17n0843_002:0925c04_1"
    },
    {
        "source_sentence": "若復有人聞此妙吉祥菩薩名字，恭敬受持乃至隨喜稱念者，當知是人福多於彼。",
        "translation": "If another person hears the name of this wonderfully auspicious bodhisattva and respectfully receives it or calls it that name with joy, you should know that person's merit is greater than theirs.",
        "source": "T17n0843_002:0925c05_2"
    },
    {
        "source_sentence": "又復天子！",
        "translation": "Again, my lord!",
        "source": "T17n0843_002:0925c07_3"
    },
    {
        "source_sentence": "若三千大千世界所有眾生，一一皆得須陀洹乃至阿羅漢果，是人得福甚多；",
        "translation": "If all the sentient beings in a great manifold cosmos of 3,000 worlds each attained the state of stream-entry or even the fruit of arhatship, such people would attain much merit.",
        "source": "T17n0843_002:0925c07_4"
    },
    {
        "source_sentence": "若復有人聞此妙吉祥菩薩名字能受持者，福多於彼；",
        "translation": "“Furthermore, if someone hears the name of this enlightening being Marvelous Auspicious and is able to receive and uphold it, their merit will be greater than that.",
        "source": "T17n0843_002:0925c09_5"
    },
    {
        "source_sentence": "又若三千大千世界所有眾生，一一皆悉得緣覺果，是人得福甚多；",
        "translation": "Also, if all the sentient beings in the great manifold cosmos were to attain the fruit of pratyekabuddhahood one by one, such people would obtain a great deal of merit.",
        "source": "T17n0843_002:0925c10_6"
    },
    {
        "source_sentence": "若復有人聞此妙吉祥菩薩名字能受持者，福多於彼。",
        "translation": "If another person hears the name of this wonderfully auspicious bodhisattva and can memorize it, their merit will be greater than that.",
        "source": "T17n0843_002:0925c12_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T17n0843_002:0925c13_8"
    },
    {
        "source_sentence": "若有人稱讚受持諸佛名字，若復有人稱讚受持妙吉祥菩薩名字，如是二人所獲功德等無有異。」",
        "translation": "If someone praises the names of the buddhas and if someone praises the names of the wonderfully auspicious bodhisattvas, there's no difference between the merits gained by these two people.",
        "source": "T17n0843_002:0925c13_9"
    },
    {
        "source_sentence": "爾時普華幢天子聞佛世尊作是說已，即與四萬天子，合掌恭敬作如是言：「善哉妙吉祥菩薩！",
        "translation": "After hearing this teaching from the Bhagavān, the Buddha and 40,000 celestial beings joined their palms in respect and said, Good, wonderfully auspicious bodhisattva!",
        "source": "T17n0843_002:0925c17_0"
    },
    {
        "source_sentence": "甚善甚善！",
        "translation": "Very good, very good!",
        "source": "T17n0843_002:0925c19_1"
    },
    {
        "source_sentence": "我等志誠歸命頂禮。」",
        "translation": "We wholeheartedly bow our heads in homage.",
        "source": "T17n0843_002:0925c19_2"
    },
    {
        "source_sentence": "彼諸天子發是言時，其聲普遍三千大千世界皆悉遙聞。",
        "translation": "When those celestials spoke these words, their voices were heard far and wide throughout the 3,000 great one-thousand worlds.",
        "source": "T17n0843_002:0925c19_3"
    },
    {
        "source_sentence": "爾時尊者大目乾連聞是聲已，來詣佛所前白佛言：「世尊！",
        "translation": "After hearing this sound, Venerable Mahāmaudgalyāyana came to the Buddha and said to him, Bhagavān!",
        "source": "T17n0843_002:0925c22_0"
    },
    {
        "source_sentence": "今此三千大千世界，皆得普聞讚歎音聲。",
        "translation": "Now, in this 3,000 great one-thousand worlds, they've all heard the sound of praise and admiration.",
        "source": "T17n0843_002:0925c23_1"
    },
    {
        "source_sentence": "是何神力現此希有不思議事？」",
        "translation": "What is this rare and inconceivable thing that's manifested by supernormal powers?",
        "source": "T17n0843_002:0925c24_2"
    },
    {
        "source_sentence": "佛告大目乾連言：「汝今當知，是妙吉祥菩薩摩訶薩——已住不退轉，",
        "translation": "The Buddha said to Mahāmaudgalyāyana: You should now know that this is the supremely auspicious bodhisattva Vimalakīrti, who has attained unregressing enlightenment.",
        "source": "T17n0843_002:0925c25_0"
    },
    {
        "source_sentence": "被大鎧甲最勝大士——在此會中，諸天子等稱讚彼名，是故音聲普聞三千大千世界。",
        "translation": "In this assembly, the celestial beings and so forth praised their names. That's why the sound universally heard in 3,000 great chiliocosms is called that.",
        "source": "T17n0843_002:0925c26_1"
    },
    {
        "source_sentence": "大目乾連！",
        "translation": "Mahāmaudgalyāyana!",
        "source": "T17n0843_002:0925c28_2"
    },
    {
        "source_sentence": "若有人隨其方處，稱讚受持此妙吉祥菩薩名字者，即時三千大千世界普皆震動。」",
        "translation": "If someone follows their direction and praises the names of these wonderfully auspicious bodhisattvas who uphold them, 3,000 great one-thousand worlds will immediately shake.",
        "source": "T17n0843_002:0925c28_3"
    },
    {
        "source_sentence": "是時尊者大目乾連復白佛言：「希有世尊！",
        "translation": "Venerable Mahā Moggallāna then again said to the Buddha, Rarely, Bhagavān!",
        "source": "T17n0843_002:0926a02_0"
    },
    {
        "source_sentence": "此菩薩摩訶薩成就如是不思議事，被大鎧甲勇猛精進，成熟有情具諸佛法。",
        "translation": "This bodhisattva Mahāsattva accomplishes such inconceivable things, armed with great armor and courageous effort, ripening sentient beings to fulfill the Buddha's teachings.",
        "source": "T17n0843_002:0926a02_1"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T17n0843_002:0926a04_2"
    },
    {
        "source_sentence": "若人以少善根，不能如是圓滿具足大菩薩法。」",
        "translation": "If someone doesn't have few good roots, they won't be able to thus perfect the great bodhisattva dharma.",
        "source": "T17n0843_002:0926a04_3"
    },
    {
        "source_sentence": "爾時世尊為大目乾連說是法時，忽然出現大寶蓮華，遍滿娑婆世界，一一蓮華大如車輪，",
        "translation": "When the World-honored One had thus taught this teaching to Mahāmaudgalyāyana, a great jeweled lotus suddenly appeared, pervading all the worlds of the sahā universe. Each flower was as big as a carriage wheel.",
        "source": "T17n0843_002:0926a06_0"
    },
    {
        "source_sentence": "其華各有種種色香，諸妙寶網以為莊嚴，於其華中有一蓮華而最出現，",
        "translation": "Each of those flowers had various colors and fragrances, adorned with webs of exquisite jewels. Among the flowers there was a lotus flower that emerged most prominently.",
        "source": "T17n0843_002:0926a08_1"
    },
    {
        "source_sentence": "高顯妙好，一切眾會皆悉覩見。",
        "translation": "It was so lofty and beautiful that all the congregations in the assembly saw it.",
        "source": "T17n0843_002:0926a09_2"
    },
    {
        "source_sentence": "爾時尊者阿難見其蓮華殊妙莊嚴忽然出現，即白佛言：「世尊！",
        "translation": "Seeing that the lotus flower was marvelously adorned, Venerable Ānanda suddenly appeared and said to the Buddha, Bhagavān!",
        "source": "T17n0843_002:0926a11_0"
    },
    {
        "source_sentence": "云何此會先有是相？」",
        "translation": "How did this assembly first have this characteristic?",
        "source": "T17n0843_002:0926a12_1"
    },
    {
        "source_sentence": "佛言：「阿難！",
        "translation": "The Buddha said, Ānanda!",
        "source": "T17n0843_002:0926a12_2"
    },
    {
        "source_sentence": "汝今當觀，不久即有六萬菩薩摩訶薩眾，從普遍光明世界吉祥德王佛剎中而來此會，",
        "translation": "\\",
        "source": "T17n0843_002:0926a13_3"
    },
    {
        "source_sentence": "各各處其寶蓮華上結加趺坐。",
        "translation": "Each of them sat cross-legged on top of the jeweled lotus flower.",
        "source": "T17n0843_002:0926a15_4"
    },
    {
        "source_sentence": "彼一蓮華最高顯者，當有菩薩名遍照藏，處其華上加趺而坐。",
        "translation": "When that one lotus flower is the highest and most prominent, there must be a bodhisattva named Vaiśravaṇagarbha who sits cross-legged on top of that flower.",
        "source": "T17n0843_002:0926a15_5"
    },
    {
        "source_sentence": "是諸菩薩欲現空中故，先示此寶蓮華相。」",
        "translation": "Because these bodhisattvas want to appear in the sky, they first show this jeweled lotus-flower form.",
        "source": "T17n0843_002:0926a17_6"
    },
    {
        "source_sentence": "爾時會中諸菩薩等一切大眾，咸共稱讚得未曾有，各各合掌向空頂禮。",
        "translation": "At the time, all the bodhisattvas and other members of the great assembly in the assembly praised this unprecedented experience, each joined their palms and bowed to the sky.",
        "source": "T17n0843_002:0926a19_0"
    },
    {
        "source_sentence": "是時於虛空中有梵王、帝釋，執寶蓮華，圍遶遍照藏菩薩摩訶薩。",
        "translation": "At the time, there was a Brahma king and Indra in space who held jeweled lotus flowers and surrounded the Bodhisattva Mahāsattva Universal Illumination Treasury.",
        "source": "T17n0843_002:0926a20_1"
    },
    {
        "source_sentence": "而此菩薩與諸大士，即時各各踊身虛空高七多羅樹，一切眾會皆悉覩見。",
        "translation": "The bodhisattva and the great men each immediately flew up into the sky with their bodies to the height of seven palm trees, and all the assembled people saw them.",
        "source": "T17n0843_002:0926a22_2"
    },
    {
        "source_sentence": "時諸菩薩於其空中雨眾寶華，種種色香殊妙第一，以供養佛。",
        "translation": "The bodhisattvas then rained down a multitude of jeweled flowers in the sky, variously colored and fragrant, most marvelous among them, to offer support to the Buddha.",
        "source": "T17n0843_002:0926a23_3"
    },
    {
        "source_sentence": "華供養已，於虛空中出如是聲：「世尊！",
        "translation": "After the flowers were offered, a voice like this emerged from the sky, saying, Bhagavān!",
        "source": "T17n0843_002:0926a25_4"
    },
    {
        "source_sentence": "吉祥德王如來、應供、正等正覺，問訊世尊釋迦牟尼如來！",
        "translation": "The Tathāgata of Auspicious Virtue King, Worthy of Offerings, and Completely Awakened One greeted the Bhagavān, the Tathāgata Śākyamuni!",
        "source": "T17n0843_002:0926a26_5"
    },
    {
        "source_sentence": "少病少惱、輕利調適得大快樂、氣力安不？",
        "translation": "Do you attain great happiness with little illness and little affliction, little well-being and comfort, and peacefulness of energy?",
        "source": "T17n0843_002:0926a27_6"
    },
    {
        "source_sentence": "吉祥德王如來如是置問：『今遍照藏菩薩摩訶薩等六萬菩薩同來至此，",
        "translation": "The Tathāgata Auspicious Virtue King thus asked, 'Now, the bodhisattva Mahāsattva Universal Illumination Treasury and 60,000 other bodhisattvas have come here together.",
        "source": "T17n0843_002:0926a28_7"
    },
    {
        "source_sentence": "禮近世尊！",
        "translation": "Venerate, Bhagavān!",
        "source": "T17n0843_002:0926a29_8"
    },
    {
        "source_sentence": "隨喜聽受不思議境界正法。』」",
        "translation": "They will joyfully hear and accept the right teaching of the inconceivable realm.'",
        "source": "T17n0843_002:0926b01_9"
    },
    {
        "source_sentence": "爾時空中出是聲已，遍照藏菩薩摩訶薩及諸菩薩，即時各各從空而下，",
        "translation": "At that moment, as soon as those sounds had sounded in the sky, the great enlightening being Universally Illuminating Treasury and the other enlightening beings descended from the sky.",
        "source": "T17n0843_002:0926b01_10"
    },
    {
        "source_sentence": "頭面著地禮佛足已，住立佛前。",
        "translation": "After bowing his head and feet to the ground, he stood in front of the Buddha.",
        "source": "T17n0843_002:0926b03_11"
    },
    {
        "source_sentence": "爾時世尊知是事已，故復問言：「遍照藏菩薩摩訶薩等諸善男子！",
        "translation": "Knowing this, the Bhagavān then asked again, Pervasively Illuminating Treasury Bodhisattvas, Mahāsattvas, and other good men!",
        "source": "T17n0843_002:0926b05_0"
    },
    {
        "source_sentence": "汝等今者何故至此？」",
        "translation": "Why have you come here now?",
        "source": "T17n0843_002:0926b06_1"
    },
    {
        "source_sentence": "遍照藏菩薩白佛言：「世尊！",
        "translation": "The Vaiśeṣika Bodhisattva said to the Buddha, Bhagavān!",
        "source": "T17n0843_002:0926b06_2"
    },
    {
        "source_sentence": "我等於普遍光明世界吉祥德王佛剎中，聞此娑婆世界世尊釋迦牟尼如來與諸菩薩大士而共集會，",
        "translation": "In the buddha-stage of the universally illuminating world Auspicious Virtue King, we have heard that the Tathāgata Śākyamuni, the Bhagavat of this sahā world, is assembled together with these bodhisattvas and great men.",
        "source": "T17n0843_002:0926b07_3"
    },
    {
        "source_sentence": "宣說不思議境界正法。",
        "translation": "He teaches the right teaching of the inconceivable realm.",
        "source": "T17n0843_002:0926b09_4"
    },
    {
        "source_sentence": "我等欲見世尊及聞正法，以是因緣故來至此。」",
        "translation": "We want to see the Bhagavān and hear the right teaching, so we've come here for this reason.",
        "source": "T17n0843_002:0926b10_5"
    },
    {
        "source_sentence": "爾時尊者大迦葉在大會中前白佛言：「世尊！",
        "translation": "It was then that Venerable Mahākāśyapa said to the Buddha in front of the great assembly, Bhagavān!",
        "source": "T17n0843_002:0926b12_0"
    },
    {
        "source_sentence": "普遍光明世界吉祥德王佛剎，去此佛剎而不遠耶？",
        "translation": "Is the buddha-stage of the world Universally Illuminating Auspicious Virtuous King Buddha not far from this buddha-stage?",
        "source": "T17n0843_002:0926b13_0"
    },
    {
        "source_sentence": "何故此諸大士於少時間速能至此？」",
        "translation": "Why are these great men able to quickly reach here for a short time?",
        "source": "T17n0843_002:0926b14_1"
    },
    {
        "source_sentence": "遍照藏菩薩謂大迦葉言：「尊者！",
        "translation": "The Vaiśeṣika Bodhisattva said to Mahākāśyapa, Venerable!",
        "source": "T17n0843_002:0926b15_0"
    },
    {
        "source_sentence": "汝若以自神通定力往彼世界，至壽量盡亦未能到。",
        "translation": "If you go to that world with the power of your own supernormal concentration, you won't be able to reach it until its lifespan is up.",
        "source": "T17n0843_002:0926b15_1"
    },
    {
        "source_sentence": "是故當知，彼佛世界如是遠近。」",
        "translation": "Therefore, you should know that those buddha worlds are thus distant and near.",
        "source": "T17n0843_002:0926b16_2"
    },
    {
        "source_sentence": "爾時佛告大迦葉言：「去此世界，度如六十殑伽沙數佛剎，即到普遍光明世界，",
        "translation": "It was then that the Buddha said to Mahākāśyapa: “Departing from this world, having crossed buddha-lands as numerous as the grains of sand in sixty Ganges Rivers, I immediately arrived at the world Universal Light.",
        "source": "T17n0843_002:0926b18_0"
    },
    {
        "source_sentence": "此諸菩薩以其最勝大神通力，速能至此。」",
        "translation": "Because of their most excellent great supernormal powers, these bodhisattvas can quickly reach here.",
        "source": "T17n0843_002:0926b19_1"
    },
    {
        "source_sentence": "是時尊者大迦葉白佛言：「世尊！",
        "translation": "Venerable Mahākāśyapa then said to the Buddha, Bhagavān!",
        "source": "T17n0843_002:0926b20_2"
    },
    {
        "source_sentence": "我今樂欲往彼世界。」",
        "translation": "Now, I'm happy to want to go to that world.",
        "source": "T17n0843_002:0926b21_3"
    },
    {
        "source_sentence": "遍照藏菩薩即問尊者大迦葉言：「尊者云何於來去想有所動轉？",
        "translation": "The pervasively illuminating store bodhisattva then asked Venerable Mahākāśyapa, How does the venerable move with thoughts of coming and going?",
        "source": "T17n0843_002:0926b21_4"
    },
    {
        "source_sentence": "迦葉！",
        "translation": "Kāśyapa!",
        "source": "T17n0843_002:0926b23_5"
    },
    {
        "source_sentence": "汝於何法見有來去？",
        "translation": "What do you see as coming and going?",
        "source": "T17n0843_002:0926b23_6"
    },
    {
        "source_sentence": "汝謂色法有來去耶？",
        "translation": "Do you say that form and dharmas have coming and going?",
        "source": "T17n0843_002:0926b23_7"
    },
    {
        "source_sentence": "受、想、行、識有來去耶？」",
        "translation": "Is there a coming and going of feeling, perception, volition, and consciousness?",
        "source": "T17n0843_002:0926b24_8"
    },
    {
        "source_sentence": "大迦葉答言：「善男子！",
        "translation": "Mahākāśyapa replied, Good man!",
        "source": "T17n0843_002:0926b24_9"
    },
    {
        "source_sentence": "色無來去，受、想、行、識亦無來去。",
        "translation": "Form has no coming or going, and neither does feeling, perception, volition, nor consciousness have coming or going.",
        "source": "T17n0843_002:0926b25_10"
    },
    {
        "source_sentence": "於定心中示來去相，若住定心即諸色不見，色無見故即不能得彼來去相。",
        "translation": "When abiding in a concentrated awareness, it exactly is forms that are not seen. Because there is no vision of form, the characteristic marks coming and going cannot be grasped.",
        "source": "T17n0843_002:0926b26_11"
    },
    {
        "source_sentence": "善男子！",
        "translation": "Good sons!",
        "source": "T17n0843_002:0926b27_12"
    },
    {
        "source_sentence": "若住定心即得勝義法門。",
        "translation": "If someone abides in a concentrated mind, they'll attain the Dharma teaching of ultimate meaning.",
        "source": "T17n0843_002:0926b27_13"
    },
    {
        "source_sentence": "「復次善男子！",
        "translation": "Furthermore, good sons!",
        "source": "T17n0843_002:0926b29_0"
    },
    {
        "source_sentence": "汝諸菩薩來此久耶？」",
        "translation": "How long have you bodhisattvas been here?",
        "source": "T17n0843_002:0926b29_1"
    },
    {
        "source_sentence": "遍照藏答言：「我來久近，如汝尊者所得漏盡證心解脫。」",
        "translation": "The pervasively illuminating store answered, I've been here for a long time, just as you, the venerable, have attained the liberation of the mind that realizes the end of contaminants.",
        "source": "T17n0843_002:0926b29_2"
    },
    {
        "source_sentence": "大迦葉言：「希有大士！",
        "translation": "Mahākāśyapa said, Rarely, great man!",
        "source": "T17n0843_002:0926c02_0"
    },
    {
        "source_sentence": "得大神通。」",
        "translation": "They'll attain great supernormal abilities.",
        "source": "T17n0843_002:0926c02_1"
    },
    {
        "source_sentence": "遍照藏言：「即汝尊者得心解脫亦云何久？」",
        "translation": "Vaiśeṣika said, How long has it been since you, Venerable, attained liberation of the mind?",
        "source": "T17n0843_002:0926c02_2"
    },
    {
        "source_sentence": "大迦葉言：「解脫已久。」",
        "translation": "Mahākāśyapa said, It's been a long time since I was liberated.",
        "source": "T17n0843_002:0926c03_3"
    },
    {
        "source_sentence": "遍照藏言：「如汝尊者得心解脫，當以何義說名為心？」",
        "translation": "Pervasively Illuminating Treasury said, If you, Venerable, have attained the liberation of mind, what does it mean to call it mind?",
        "source": "T17n0843_002:0926c04_4"
    },
    {
        "source_sentence": "大迦葉言：「汝善男子！",
        "translation": "Mahākāśyapa said, Good man!",
        "source": "T17n0843_002:0926c05_5"
    },
    {
        "source_sentence": "亦云何說？」",
        "translation": "How can it also be explained?",
        "source": "T17n0843_002:0926c05_6"
    },
    {
        "source_sentence": "遍照藏言：「心有所縛，何名解脫？」",
        "translation": "The pervasive illuminating store said, What's called liberation if the mind is bound?",
        "source": "T17n0843_002:0926c06_7"
    },
    {
        "source_sentence": "大迦葉言：「若如是者，汝善男子！",
        "translation": "Mahākāśyapa said, If that's the case, you good man!",
        "source": "T17n0843_002:0926c06_8"
    },
    {
        "source_sentence": "有縛於心不名解脫，亦復不名解脫知見。」",
        "translation": "Those who are bound to mind aren't called liberation, and they aren't called the knowledge and vision of liberation.",
        "source": "T17n0843_002:0926c07_9"
    },
    {
        "source_sentence": "遍照藏言：「尊者大迦葉！",
        "translation": "The pervasive illuminating store said, Venerable Mahākāśyapa!",
        "source": "T17n0843_002:0926c08_10"
    },
    {
        "source_sentence": "心本無縛，其何解脫？」",
        "translation": "The mind is originally unfettered, so what liberation is it?",
        "source": "T17n0843_002:0926c08_11"
    },
    {
        "source_sentence": "大迦葉言：「若於無縛如實了知，是即解脫。」",
        "translation": "Mahākāśyapa said, If you truly understand unfetteredness, this is liberation.",
        "source": "T17n0843_002:0926c09_12"
    },
    {
        "source_sentence": "遍照藏言：「尊者大迦葉！",
        "translation": "The pervasive illuminating store said, Venerable Mahākāśyapa!",
        "source": "T17n0843_002:0926c10_13"
    },
    {
        "source_sentence": "為用何心而了知耶？",
        "translation": "What mind does it use to know?",
        "source": "T17n0843_002:0926c10_14"
    },
    {
        "source_sentence": "過去耶、未來耶、現在耶？",
        "translation": "What's past, what's future, and what's present?",
        "source": "T17n0843_002:0926c11_15"
    },
    {
        "source_sentence": "若過去心，彼已滅盡；",
        "translation": "If there is a mind of the past, it has already disappeared.",
        "source": "T17n0843_002:0926c11_16"
    },
    {
        "source_sentence": "若未來心，當亦未至；",
        "translation": "If there is a mind of the future, it will not reach either.",
        "source": "T17n0843_002:0926c12_17"
    },
    {
        "source_sentence": "若現在心，今即無住。",
        "translation": "If it's the present mind, then there's no abiding in the present.",
        "source": "T17n0843_002:0926c12_18"
    },
    {
        "source_sentence": "離此三世，復以何心而了知耶？」",
        "translation": "What mind does it use to know apart from these three worlds?",
        "source": "T17n0843_002:0926c13_19"
    },
    {
        "source_sentence": "大迦葉言：「善男子！",
        "translation": "Mahākāśyapa said, Good man!",
        "source": "T17n0843_002:0926c14_20"
    },
    {
        "source_sentence": "心法滅處非彼心分。」",
        "translation": "The cessation of mind and dharmas is not the part of that mind.",
        "source": "T17n0843_002:0926c14_21"
    },
    {
        "source_sentence": "遍照藏言：「尊者大迦葉！",
        "translation": "The pervasive illuminating store said, Venerable Mahākāśyapa!",
        "source": "T17n0843_002:0926c14_22"
    },
    {
        "source_sentence": "即此心滅處而可了知耶？」",
        "translation": "Is it possible to know the cessation of this mind?",
        "source": "T17n0843_002:0926c15_23"
    },
    {
        "source_sentence": "大迦葉言：「若心滅處即不能知。」",
        "translation": "Mahākāśyapa said, If the mind ceases, then it can't know.",
        "source": "T17n0843_002:0926c16_24"
    },
    {
        "source_sentence": "遍照藏言：「彼一切法皆如心滅，是故不能有所了知。」",
        "translation": "The pervasive illuminating store said, All those things are like the cessation of mind; therefore, they can't know anything.",
        "source": "T17n0843_002:0926c16_25"
    },
    {
        "source_sentence": "大迦葉言：「汝善男子！",
        "translation": "Mahākāśyapa said, Good man!",
        "source": "T17n0843_002:0926c17_26"
    },
    {
        "source_sentence": "得大辯才隨問能答。",
        "translation": "They'll attain great eloquence and be able to answer questions as they arise.",
        "source": "T17n0843_002:0926c18_27"
    },
    {
        "source_sentence": "我今不能有是辯才。」",
        "translation": "Now, I can't have such eloquence.",
        "source": "T17n0843_002:0926c18_28"
    },
    {
        "source_sentence": "遍照藏言：「尊者大迦葉！",
        "translation": "The pervasive illuminating store said, Venerable Mahākāśyapa!",
        "source": "T17n0843_002:0926c19_29"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T17n0843_002:0926c19_30"
    },
    {
        "source_sentence": "所有辯才，若見若聞，為有得耶？」",
        "translation": "Is there any attainment of the eloquence that you have, whether seen or heard?",
        "source": "T17n0843_002:0926c20_31"
    },
    {
        "source_sentence": "大迦葉言：「無得無聞。",
        "translation": "Mahākāśyapa said, Nothing is attained and nothing is heard.",
        "source": "T17n0843_002:0926c20_32"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T17n0843_002:0926c21_33"
    },
    {
        "source_sentence": "緣生性故。」",
        "translation": "It's because of the nature of conditioned arising.",
        "source": "T17n0843_002:0926c21_34"
    },
    {
        "source_sentence": "遍照藏言：「豈非一切法皆同如是耶？」",
        "translation": "The pervasively illuminating store said, Isn't it the same as all dharmas?",
        "source": "T17n0843_002:0926c21_35"
    },
    {
        "source_sentence": "大迦葉言：「善男子！",
        "translation": "Mahākāśyapa said, Good man!",
        "source": "T17n0843_002:0926c22_36"
    },
    {
        "source_sentence": "諸法亦如是！」",
        "translation": "So are the dharmas!",
        "source": "T17n0843_002:0926c23_37"
    },
    {
        "source_sentence": "遍照藏言：「尊者大迦葉！",
        "translation": "The pervasive illuminating store said, Venerable Mahākāśyapa!",
        "source": "T17n0843_002:0926c23_38"
    },
    {
        "source_sentence": "於汝意云何？",
        "translation": "What do you think?",
        "source": "T17n0843_002:0926c23_39"
    },
    {
        "source_sentence": "若見若聞，於其辯才能無斷耶？」",
        "translation": "Whether seen or heard, isn't there a way to stop their abilities of eloquence?",
        "source": "T17n0843_002:0926c24_40"
    },
    {
        "source_sentence": "大迦葉言：「不壞亦不斷。」",
        "translation": "Mahākāśyapa said, It doesn't break down and doesn't continue.",
        "source": "T17n0843_002:0926c24_41"
    },
    {
        "source_sentence": "遍照藏言：「尊者大迦葉！",
        "translation": "The pervasive illuminating store said, Venerable Mahākāśyapa!",
        "source": "T17n0843_002:0926c25_42"
    },
    {
        "source_sentence": "如是如是！",
        "translation": "Just so, just so!",
        "source": "T17n0843_002:0926c25_43"
    },
    {
        "source_sentence": "菩薩辯才隨有所問而不斷壞。",
        "translation": "The bodhisattva's eloquence doesn't stop decaying as he asks questions.",
        "source": "T17n0843_002:0926c26_44"
    },
    {
        "source_sentence": "迦葉當知，諸菩薩摩訶薩縱經劫數隨問能答，所有辯才亦不斷壞。」",
        "translation": "Kāśyapa, you should know that even for eons long, the bodhisattvas and mahāsattvas can answer questions as they are asked, and their eloquence doesn't stop or break down.",
        "source": "T17n0843_002:0926c26_45"
    },
    {
        "source_sentence": "爾時遍照藏菩薩及尊者大迦葉說是法時，五十萬眾生皆發阿耨多羅三藐三菩提心，",
        "translation": "When the enlightening being Universally Illuminating Treasury and the venerable Mahākāśyapa had thus taught this teaching, half a million sentient beings conceived the spirit of unexcelled complete perfect enlightenment.",
        "source": "T17n0843_002:0926c29_0"
    },
    {
        "source_sentence": "二百菩薩得無生法忍。",
        "translation": "Two hundred bodhisattvas attain the forbearance of the nonarising dharma.",
        "source": "T17n0843_002:0927a02_0"
    },
    {
        "source_sentence": "爾時尊者大迦葉白佛言：「世尊！",
        "translation": "It was then that Venerable Mahākāśyapa said to the Buddha, Bhagavān!",
        "source": "T17n0843_002:0927a03_0"
    },
    {
        "source_sentence": "勸請世尊為妙吉祥菩薩及大會眾如應說法，使其長夜得大利樂，而能決定證諸法性！」",
        "translation": "Encourage the Bhagavān to explain the Dharma as it should be taught for the wonderfully auspicious bodhisattva and the great assembly of people, so that they'll attain great rewards and happiness for a long time and be able to definitely realize the Dharma-nature!",
        "source": "T17n0843_002:0927a03_1"
    },
    {
        "source_sentence": "爾時有菩薩名曰辯積，在大會中，從座而起白妙吉祥菩薩言：「妙吉祥！",
        "translation": "It was then that a bodhisattva named Bimbisāra rose from his seat in the great assembly and said to the Marvelous Auspicious Bodhisattva, Marvelous Auspicious!",
        "source": "T17n0843_002:0927a06_0"
    },
    {
        "source_sentence": "云何尊者大迦葉於法精進能善宣說？」",
        "translation": "How can Venerable Mahākāśyapa skillfully explain the Dharma with effort?",
        "source": "T17n0843_002:0927a07_1"
    },
    {
        "source_sentence": "妙吉祥言：「此大迦葉！",
        "translation": "Miaojixiang said, This is Mahākāśyapa!",
        "source": "T17n0843_002:0927a08_2"
    },
    {
        "source_sentence": "於聲聞法中已得無畏。」",
        "translation": "They've already attained fearlessness in the śrāvaka teachings.",
        "source": "T17n0843_002:0927a08_3"
    },
    {
        "source_sentence": "辯積菩薩言：「此大迦葉！",
        "translation": "The Vaiśravaṇa Bodhisattva said, This is Mahākāśyapa!",
        "source": "T17n0843_002:0927a09_4"
    },
    {
        "source_sentence": "云何不住大乘法中？」",
        "translation": "How does it not abide in the great vehicle teaching?",
        "source": "T17n0843_002:0927a10_0"
    },
    {
        "source_sentence": "妙吉祥言：「善男子！",
        "translation": "Miaojixiang said, Good man!",
        "source": "T17n0843_002:0927a10_1"
    },
    {
        "source_sentence": "此大迦葉！",
        "translation": "This is Mahākāśyapa!",
        "source": "T17n0843_002:0927a10_2"
    },
    {
        "source_sentence": "亦非不能住大乘法，為於聲聞法中得解脫故。」",
        "translation": "Nor is it because they can't abide in the great vehicle teaching and attain liberation in the śrāvaka teachings.",
        "source": "T17n0843_002:0927a11_3"
    },
    {
        "source_sentence": "辯積菩薩言：「妙吉祥！",
        "translation": "The eloquently accumulated bodhisattva said, Marvelous auspicious!",
        "source": "T17n0843_002:0927a12_4"
    },
    {
        "source_sentence": "云何名為聲聞法？」",
        "translation": "What's called the śrāvaka teaching?",
        "source": "T17n0843_002:0927a12_5"
    },
    {
        "source_sentence": "妙吉祥言：「世尊釋迦牟尼如來！",
        "translation": "Miaojixiang said, Bhagavān, the Tathāgata Śākyamuni!",
        "source": "T17n0843_002:0927a13_6"
    },
    {
        "source_sentence": "於此娑婆世界為諸眾生說三乘法。",
        "translation": "In this sahā world, he teaches the teachings of the three vehicles for sentient beings.",
        "source": "T17n0843_002:0927a13_7"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T17n0843_002:0927a14_8"
    },
    {
        "source_sentence": "所謂聲聞乘、緣覺乘、大乘，是名三乘。",
        "translation": "The so-called śrāvaka vehicle, pratyekabuddha vehicle, and great vehicle are called the three vehicles.",
        "source": "T17n0843_002:0927a14_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T17n0843_002:0927a15_10"
    },
    {
        "source_sentence": "有諸眾生，起劣精進而求解脫故，佛方便開示三乘。」",
        "translation": "If there are sentient beings who give rise to inferior energy and seek liberation, the Buddha skillfully reveals the three vehicles.",
        "source": "T17n0843_002:0927a15_11"
    },
    {
        "source_sentence": "辯積菩薩言：「妙吉祥！",
        "translation": "The eloquently accumulated bodhisattva said, Marvelous auspicious!",
        "source": "T17n0843_002:0927a17_12"
    },
    {
        "source_sentence": "云何如來廣說無量空解脫門、無相解脫門、無願解脫門？」",
        "translation": "How did the Tathāgata explain in detail the liberation gate of immeasurable emptiness, the liberation gate of signlessness, and the liberation gate of wishlessness?",
        "source": "T17n0843_002:0927a17_13"
    },
    {
        "source_sentence": "妙吉祥言：「善男子！",
        "translation": "Miaojixiang said, Good man!",
        "source": "T17n0843_002:0927a18_14"
    },
    {
        "source_sentence": "如來以善方便，宣說無量空、無相、無願解脫法門，令諸眾生如理修行。」",
        "translation": "The Tathāgata uses good skillful means to proclaim the dharmas of immeasurable emptiness, signlessness, and wishless liberation so that sentient beings will correctly cultivate them.",
        "source": "T17n0843_002:0927a19_15"
    },
    {
        "source_sentence": "爾時妙吉祥菩薩為辯積菩薩說是法時，會中所有天、龍、夜叉、乾闥婆等，",
        "translation": "When the wonderfully auspicious bodhisattva explained this teaching to the eloquent bodhisattva, all the gods, dragons, yakṣas, gandharvas, and so forth in the assembly",
        "source": "T17n0843_002:0927a21_0"
    },
    {
        "source_sentence": "「所有一切供養具，　　寶衣寶器眾莊嚴；",
        "translation": "“All the offerings they have Are adorned with jeweled robes, jeweled vessels, and various ornaments.",
        "source": "T17n0843_002:0927a22_1"
    },
    {
        "source_sentence": "　妙吉祥尊所嚴身，　　我今稱讚功德聚。」◎",
        "translation": "The body adorned by the wonderfully auspicious honored one, I'll now praise the cluster of merit.",
        "source": "T17n0843_002:0927a22_1"
    },
    {
        "source_sentence": "即時各各合掌恭敬，異口同音說伽陀曰：◎爾時普華幢天子復白佛言：「世尊！",
        "translation": "Immediately, each joined his palms in respect and said in unison with one voice to the Gathāgata, At that point, the Puṣkarasārin again said to the Buddha, Bhagavān!",
        "source": "T17n0843_002:0927a22_1"
    },
    {
        "source_sentence": "此妙吉祥菩薩摩訶薩，最初於何佛世尊所發菩提心？」",
        "translation": "Where did this wonderfully auspicious bodhisattva-mahāsattva first give rise to the mind of enlightenment by the Bhagavān?",
        "source": "T17n0843_002:0927a26_2"
    },
    {
        "source_sentence": "佛告普華幢天子言：「汝今當知，過去度如殑伽沙數劫前，彼時有世界名金焰光明，",
        "translation": "The Buddha said to the celestial being Universal Flower Banner: You should now know that in the past as many eons ago as there are grains of sand in the Ganges River, there was a world called Golden Flame Light.",
        "source": "T17n0843_002:0927a28_3"
    },
    {
        "source_sentence": "有佛出世，號無垢日焰光明如來、應供、正等正覺、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "Ānanda, there appeared in the world a buddha named Undefiled Sunlight Tathāgata, Arhat, Completely Enlightened, Perfect in Knowledge and Conduct, Well-gone, Knower of the World, Unsurpassed, Tamer of Humans, Teacher of Devas and Humans, Buddha, Bhagavat.",
        "source": "T17n0843_002:0927a29_4"
    },
    {
        "source_sentence": "十號具足。",
        "translation": "The ten epithets are complete.",
        "source": "T17n0843_002:0927b03_5"
    },
    {
        "source_sentence": "天子！",
        "translation": "Son of God!",
        "source": "T17n0843_002:0927b03_6"
    },
    {
        "source_sentence": "彼佛壽量九百九十萬俱胝那庾多數，為諸眾生說三乘法，所謂：聲聞乘、緣覺乘、菩薩乘。",
        "translation": "The Buddha had a life span of nine hundred and ninety million koṭinayus, teaching sentient beings the teachings of the three vehicles: the śrāvaka vehicle, the pratyekabuddha vehicle, and the bodhisattva vehicle.",
        "source": "T17n0843_002:0927b03_7"
    },
    {
        "source_sentence": "時彼如來初會說法，有八百四十萬俱胝那庾多眾生，住聲聞乘得阿羅漢，",
        "translation": "At that time the Tathāgata preached the Dharma at the first assembly of the assembly, accompanied by eighty-four million koṭis of sentient beings who were in the śrāvaka vehicle and attained arhatship.",
        "source": "T17n0843_002:0927b05_8"
    },
    {
        "source_sentence": "諸漏已盡捨諸重擔得大善利，諸有結縛皆悉已盡，正智無礙心善解脫；",
        "translation": "Having extinguished the defilements, they relinquish their heavy burdens and attain great benefits of virtue. All fetters of existence have been completely eliminated. Their minds unhindered by right knowledge are well liberated.",
        "source": "T17n0843_002:0927b07_9"
    },
    {
        "source_sentence": "第二會說法時，有七十萬俱胝那庾多苾芻得阿羅漢；",
        "translation": "In the second assembly, at the time of preaching the Dharma seventy-thousand koṭis of bhikṣus attained arhatship.",
        "source": "T17n0843_002:0927b09_10"
    },
    {
        "source_sentence": "第三會說法時，有六百五十萬俱胝那庾多苾芻得阿羅漢。",
        "translation": "When the third assembly was preaching the Dharma, there were 60,000 or 500,000 koṭis of monks who attained arhatship.",
        "source": "T17n0843_002:0927b10_11"
    },
    {
        "source_sentence": "彼佛法中，二分苾芻、苾芻尼、優婆塞、優婆夷眾；",
        "translation": "In that buddha-dharma there were the twofold assembly of bhikṣus, bhikṣuṇīs, upāsaka and upāsikā.",
        "source": "T17n0843_002:0927b11_12"
    },
    {
        "source_sentence": "二分菩薩摩訶薩眾。",
        "translation": "The second part is the bodhisattva-mahāsattva congregation.",
        "source": "T17n0843_002:0927b12_13"
    },
    {
        "source_sentence": "彼諸菩薩一切皆是不退轉者，皆悉證得無生法忍，普入無邊三摩地門，",
        "translation": "All of those enlightening beings were nonregressing, fully realizing the tolerance of the birthlessness of all things. They entered everywhere into the door of infinite concentration.",
        "source": "T17n0843_002:0927b13_14"
    },
    {
        "source_sentence": "圓滿善法，復得無邊陀羅尼門，如來為說不退轉法輪，況復彼諸初發大乘心者，",
        "translation": "Having perfected the wholesome Dharma, they can also attain the boundless dhāraṇī teachings. The Tathāgata teaches them the irreversible wheel of the Dharma that never turns back, much less those who have set their minds on the Great Vehicle.",
        "source": "T17n0843_002:0927b14_15"
    },
    {
        "source_sentence": "其數無量，是中亦有無量眾生住緣覺者。",
        "translation": "Their number is immeasurable, and there are also measureless sentient beings here who abide in pratyekabuddhahood.",
        "source": "T17n0843_002:0927b16_16"
    },
    {
        "source_sentence": "「天子！",
        "translation": "“Dear gods!",
        "source": "T17n0843_002:0927b17_17"
    },
    {
        "source_sentence": "彼無垢日焰光明如來，以其無量無數相應行法，普攝眾生。",
        "translation": "That Tathāgata of the Light of the Undefiled Sun-Flameless Radiance was taking care of all sentient beings by means of his immeasurable, countless and associated practices.",
        "source": "T17n0843_002:0927b17_18"
    },
    {
        "source_sentence": "時彼金焰光明世界，多以黃金而用莊嚴，諸有樓閣殿堂眾寶為柱，一切樹林皆寶嚴飾，",
        "translation": "At that time the world Golden Flame Light was mostly decorated in gold, with towers and halls of various jewels as pillars, and all the trees were beautifully adorned.",
        "source": "T17n0843_002:0927b19_19"
    },
    {
        "source_sentence": "於其樹間出妙音聲，稱讚甚深不思議法。",
        "translation": "Between the trees a wonderful sound emerged, extolling the profound inconceivable Dharma.",
        "source": "T17n0843_002:0927b21_20"
    },
    {
        "source_sentence": "所謂：空聲、無相聲、無願聲；",
        "translation": "They are the sounds of emptiness, signlessness, and wishlessness.",
        "source": "T17n0843_002:0927b22_0"
    },
    {
        "source_sentence": "無性聲、無著聲；",
        "translation": "sound of non-essence and sound of nonattachment.",
        "source": "T17n0843_002:0927b22_1"
    },
    {
        "source_sentence": "無生聲、無起聲，出如是等讚諸法聲。",
        "translation": "There's no sound that arises and no sound that arises, and such sounds of praise for the teachings are produced.",
        "source": "T17n0843_002:0927b22_2"
    },
    {
        "source_sentence": "其所出聲，一切眾生聞者愛樂。",
        "translation": "The sound that they produce is loved by all sentient beings who hear it.",
        "source": "T17n0843_002:0927b23_3"
    },
    {
        "source_sentence": "彼佛滅後，正法住世滿一千歲。",
        "translation": "After the parinirvāṇa of that Buddha, the right teaching remained in the world for 1,000 years.",
        "source": "T17n0843_002:0927b24_4"
    },
    {
        "source_sentence": "「天子！",
        "translation": "“Dear gods!",
        "source": "T17n0843_002:0927b25_5"
    },
    {
        "source_sentence": "時彼金焰光明世界中，有轉輪王名最勝辯才，為四洲主。",
        "translation": "At the time, there was a wheel-turning king named Most Excellent eloquence in that world of golden flame and light, who was the lord of four continents.",
        "source": "T17n0843_002:0927b25_6"
    },
    {
        "source_sentence": "是時彼王於無垢日焰光明佛剎中，以其飲食、衣服、臥具、幢幡、寶蓋諸妙供具，",
        "translation": "At that time the king was staying at the buddha-stage of the pure sun, shining like a ray of light. He offered food and drink, robes, bedding, banners, pennants, jeweled canopies, and other fine offerings to the Buddha.",
        "source": "T17n0843_002:0927b26_7"
    },
    {
        "source_sentence": "供養彼佛及其佛剎所有一切聲聞、緣覺、大菩薩眾。",
        "translation": "They make offerings to all the śrāvakas, pratyekbuddhas, and great bodhisattvas of those buddhas and their buddha-lands.",
        "source": "T17n0843_002:0927b28_8"
    },
    {
        "source_sentence": "如是供養滿一俱胝歲，於彼佛所深種善根。",
        "translation": "For the duration of one koṭi of years these offerings are made in this way, and deeply planted roots of merit are planted at the Buddha’s place.",
        "source": "T17n0843_002:0927b29_9"
    },
    {
        "source_sentence": "彼轉輪王種是善根時，即有八萬四千眾生，及王宮中有三百二十萬后妃眷屬，",
        "translation": "When that wheel-turning king planted these roots of goodness, there were 84,000 sentient beings and 3.2 million queens and retinues in the royal palace.",
        "source": "T17n0843_002:0927c01_10"
    },
    {
        "source_sentence": "同發阿耨多羅三藐三菩提心。",
        "translation": "They all aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T17n0843_002:0927c03_11"
    },
    {
        "source_sentence": "「天子！",
        "translation": "“Dear gods!",
        "source": "T17n0843_002:0927c04_12"
    },
    {
        "source_sentence": "彼最勝辯才轉輪聖王有其千子，先於聲聞法中發生信解，後復發於阿耨多羅三藐三菩提心，",
        "translation": "The king of the wheel-turning sage king Supremely eloquent had a thousand sons, who had first developed faith in the teachings of the śrāvakas and then conceived the spirit of unexcelled complete perfect enlightenment.",
        "source": "T17n0843_002:0927c04_13"
    },
    {
        "source_sentence": "證得無生法忍。",
        "translation": "They'll realize the tolerance of the nonarising of all dharmas.",
        "source": "T17n0843_002:0927c06_14"
    },
    {
        "source_sentence": "爾時彼王有女名曰大慧，具大辯才甚深信解。",
        "translation": "It was then that the king had a woman named Mahāprajāpatī, endowed with great eloquence and very deep faith.",
        "source": "T17n0843_002:0927c06_15"
    },
    {
        "source_sentence": "是時大慧與七千二百宮女眷屬恭敬圍繞，詣彼無垢日焰光明佛所。",
        "translation": "Mahāprajñāpāramitā and his retinue of 7,200 palace maidens then respectfully surrounded him and went to the Buddha of Immaculate Sun-Flame Light.",
        "source": "T17n0843_002:0927c07_16"
    },
    {
        "source_sentence": "到佛所已，與諸眷屬頭面著地，禮彼佛足。",
        "translation": "Having arrived at the place where the Buddha was, they bowed their heads and faces to the ground with their retinues and bowed at his feet.",
        "source": "T17n0843_002:0927c09_17"
    },
    {
        "source_sentence": "時大慧女以善根故，即發阿耨多羅三藐三菩提心。",
        "translation": "Because of her good roots, the woman of great wisdom then aroused the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T17n0843_002:0927c10_18"
    },
    {
        "source_sentence": "既發心已前白佛言：『世尊！",
        "translation": "Having arisen the intention, he said to the Buddha, 'Bhagavān!",
        "source": "T17n0843_002:0927c11_19"
    },
    {
        "source_sentence": "我欲趣求阿耨多羅三藐三菩提果，然我今者不能以此女人色相而取證彼阿耨多羅三藐三菩提。",
        "translation": "I want to seek the fruit of unsurpassed, correct, and complete enlightenment, but now I can't attain that unsurpassed, correct, and complete enlightenment because of this woman's appearance.",
        "source": "T17n0843_002:0927c12_20"
    },
    {
        "source_sentence": "唯願世尊為我開示，有何法門如理修行，令我當得轉女人身成男子相，",
        "translation": "“World-honored One, please show me how to cultivate the practice of this doctrine so that I may be reborn as a woman and become a man.",
        "source": "T17n0843_002:0927c14_21"
    },
    {
        "source_sentence": "速能取證阿耨多羅三藐三菩提果？』",
        "translation": "Can you quickly attain the fruit of unsurpassed, correct, and complete enlightenment?'",
        "source": "T17n0843_002:0927c16_0"
    },
    {
        "source_sentence": "「爾時無垢日焰光明如來即告大慧女言：『汝善女人！",
        "translation": "It was then that the Tathāgata of Undefiled Sun-Flame Light addressed Mahāprajāpatī, saying, 'You good woman!",
        "source": "T17n0843_002:0927c17_0"
    },
    {
        "source_sentence": "當有一法，能具足者，即得轉女人身成男子相。",
        "translation": "There must be a teaching that's capable of fulfilling it, which is to transform the woman's body into a man's appearance.",
        "source": "T17n0843_002:0927c18_1"
    },
    {
        "source_sentence": "何等為一？",
        "translation": "What's one?",
        "source": "T17n0843_002:0927c19_2"
    },
    {
        "source_sentence": "所謂發起大菩提心、無等等心、一切三界最勝上心，乃至一切聲聞緣覺起隨順心。",
        "translation": "It's called the mind that gives rise to great enlightenment, unequalled mind, the most superior mind of all the three realms, and even the mind that follows the arousal of all śrāvakas and pratyekbuddhas.",
        "source": "T17n0843_002:0927c19_3"
    },
    {
        "source_sentence": "復有一法，若具足者，即得轉女人身成男子相。",
        "translation": "There's another thing that if someone is fully endowed, they'll be able to transform a woman's body into a man's appearance.",
        "source": "T17n0843_002:0927c21_4"
    },
    {
        "source_sentence": "何等為一？",
        "translation": "What's one?",
        "source": "T17n0843_002:0927c22_5"
    },
    {
        "source_sentence": "所謂於諸如來，常所作意而不遠離，聽受正法無所厭倦。",
        "translation": "It means that the Tathāgata always focuses his attention on what's done, doesn't part from it, and listens to the right teaching without tire while hearing it.",
        "source": "T17n0843_002:0927c22_6"
    },
    {
        "source_sentence": "大慧！",
        "translation": "Great Wisdom!",
        "source": "T17n0843_002:0927c23_7"
    },
    {
        "source_sentence": "復有十法，若具足者，即得轉女人身成男子相。",
        "translation": "There are another ten things that, if they are complete, will enable them to transform their female body into a man's form.",
        "source": "T17n0843_002:0927c24_8"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T17n0843_002:0927c25_9"
    },
    {
        "source_sentence": "所謂十善業道應當圓滿，即得慈行成就；",
        "translation": "The so-called ten paths of good action should be fulfilled, that is to say, they attain the accomplishment of the practice of loving kindness.",
        "source": "T17n0843_002:0927c25_10"
    },
    {
        "source_sentence": "又復長時受學無懈、聽法無懈、親近法師亦復無懈，若能圓滿如是等法，",
        "translation": "“Furthermore, if one can perfect such qualities as these:",
        "source": "T17n0843_002:0927c26_11"
    },
    {
        "source_sentence": "即得轉女人身成男子相。』",
        "translation": "He'll then be able to transform the woman's body into a man's form.'",
        "source": "T17n0843_002:0927c27_12"
    },
    {
        "source_sentence": "「爾時彼佛說是法時，其大慧女即於同來諸眷屬前轉彼女身得成男子。",
        "translation": "At the time, when that Buddha taught this teaching, that woman of great wisdom transformed herself into a woman in front of her fellow members of the retinue and became a man.",
        "source": "T17n0843_002:0927c29_0"
    },
    {
        "source_sentence": "即時大慧童子合掌恭敬前白佛言：『世尊！",
        "translation": "Immediately, the boy of great wisdom joined his palms in respect and said to the Buddha, 'Bhagavān!",
        "source": "T17n0843_002:0928a01_1"
    },
    {
        "source_sentence": "我今已轉女身，於佛法中樂欲出家，持苾芻戒，願佛攝受。』",
        "translation": "Now that I've transformed into a woman, I'm happy to leave home in the Buddha's teaching, observe the monastic precepts, and wish for the Buddha to take them in.'",
        "source": "T17n0843_002:0928a02_2"
    },
    {
        "source_sentence": "爾時彼佛即告大慧童子言：『善來苾芻！』",
        "translation": "It was then that the Buddha addressed the boy Mahāprajñāpāramitā, saying, 'Good, monk!'",
        "source": "T17n0843_002:0928a03_3"
    },
    {
        "source_sentence": "是時大慧於剎那間鬚髮自落、袈裟被身，成苾芻相，威儀庠序如百臘者，",
        "translation": "At that time Mahāprajāpatī’s hair stood on end for a moment and his hair stood on end. His hair stood on end as long as one hundred yojanas in all directions.",
        "source": "T17n0843_002:0928a04_4"
    },
    {
        "source_sentence": "即於會中證得無生法忍。",
        "translation": "That's when he realizes the tolerance of the nonarising of the Dharma in the assembly.",
        "source": "T17n0843_002:0928a06_5"
    },
    {
        "source_sentence": "是時彼王所有諸子知是事已，生希有心，來入佛會皆求出家。",
        "translation": "Knowing this, the king's children had a rare mind that came into the Buddha's assembly and asked to leave home.",
        "source": "T17n0843_002:0928a07_0"
    },
    {
        "source_sentence": "佛即攝受，各各如應為說法要。",
        "translation": "The Buddha then took them in and taught each one the essentials of the Dharma as they should be taught.",
        "source": "T17n0843_002:0928a08_1"
    },
    {
        "source_sentence": "「爾時大慧苾芻告諸王子言：『我於今者得最上利，永不復起聲聞之見，",
        "translation": "At that time, the monk Mahāprajñāpāramitā said to the princes, “I shall now attain the supreme benefit and never again give rise to the view of a śrāvaka.",
        "source": "T17n0843_002:0928a09_2"
    },
    {
        "source_sentence": "決定趣求阿耨多羅三藐三菩提果，修大悲行利益眾生。",
        "translation": "They are determined to seek the fruit of unsurpassed, correct, and complete enlightenment and cultivate great compassion for the benefit of sentient beings.",
        "source": "T17n0843_002:0928a10_3"
    },
    {
        "source_sentence": "汝等有發聲聞心者，亦應如我發趣最上大菩提心，當於正中正道起修行想。』",
        "translation": "If you give rise to the mind of śrāvakas, you should also give rise to the intention to aspire to the supreme great bodhi like me and give rise to the idea of cultivating the right path in the middle way.'",
        "source": "T17n0843_002:0928a12_0"
    },
    {
        "source_sentence": "時大慧苾芻為諸王子如應說法，皆得不退轉於阿耨多羅三藐三菩提。」",
        "translation": "The monk Mahāprajñāpāramitā then taught the princes the Dharma as they should be taught, and they all attained unregressing unsurpassed, correct, and complete enlightenment.",
        "source": "T17n0843_002:0928a13_1"
    },
    {
        "source_sentence": "爾時世尊釋迦牟尼佛告普華幢天子言：「彼無垢日焰光明佛剎中，最勝辯才轉輪聖王大慧童女者，",
        "translation": "It was then that the Bhagavān Śākyamuni Buddha addressed the celestial being Universal Flower Banner, saying, In that buddha-stage of undefiled sun blazing with light, there was the most distinguished and eloquent wheel-turning sage king Great Wisdom Maiden.",
        "source": "T17n0843_002:0928a16_0"
    },
    {
        "source_sentence": "豈異人乎？",
        "translation": "Isn't that a different person?",
        "source": "T17n0843_002:0928a18_1"
    },
    {
        "source_sentence": "即今妙吉祥菩薩摩訶薩是！",
        "translation": "That's the present Marvelous Auspicious Bodhisattva Mahāsattva!",
        "source": "T17n0843_002:0928a18_2"
    },
    {
        "source_sentence": "彼王所有千童子眾，今已成就阿耨多羅三藐三菩提果，現住說法教化眾生，",
        "translation": "The thousand princes of that king had now attained the fruit of unexcelled complete perfect enlightenment, and were now living to teach and transform sentient beings.",
        "source": "T17n0843_002:0928a19_3"
    },
    {
        "source_sentence": "即千佛是。",
        "translation": "That's the thousand buddhas.",
        "source": "T17n0843_002:0928a20_4"
    },
    {
        "source_sentence": "所謂：「東方：超過行如來、無邊光明如來、普光如來、吉祥主如來、實相如來、寶上如來、寶明如來、寶幢如來、寶照明如來。",
        "translation": "The east: the Tathāgata of transcendent practice, the Tathāgata of boundless light, the Tathāgata of universal illumination, the Tathāgata of auspiciousness, the Tathāgata of true characteristics, the Tathāgata of jeweled form, the Tathāgata of jeweled luminosity, the Tathāgata of jeweled banners, and the Ta",
        "source": "T17n0843_002:0928a21_5"
    },
    {
        "source_sentence": "「南方：最極高如來、大光明如來、無量壽如來、無量聲如來、大名稱如來、無邊名稱如來、寶光如來、清淨無邊壽如來、月相如來、月光如來。",
        "translation": "“South: Supremely lofty Tathāgata, Great Light Tathāgata, Immeasurable Life Tathāgata, Immeasurable Voice Tathāgata, Great Fame Tathāgata, Boundless Fame Tathāgata, Jewel Light Tathāgata, Pure Infinite Life Tathāgata, Moonlike Form Tathāgata, and Moonlight Tathāgata.",
        "source": "T17n0843_002:0928a25_0"
    },
    {
        "source_sentence": "「西方：無垢明如來、清淨光如來、日明如來、無邊寶最上如來、梵高如來、金色光明如來、梵自在王如來、龍自在王如來、一切寶華自在王如來、娑羅樹王如來。",
        "translation": "To the west: The Tathāgata of Immaculate Luminosity, the Tathāgata of Pure Light, the Tathāgata of Sunlight, the Tathāgata of Moonlight, the Supreme Tathāgata of Boundless Jewels, the Tathāgata of Brahmā, the Tathāgata of Golden Light, the Tathāgata of Brahmā Freely King, the Tathāgata",
        "source": "T17n0843_002:0928a29_0"
    },
    {
        "source_sentence": "「北方：堅固勇猛如來、離塵如來、吉祥藏光如來、無量香光如來、師子音王如來、大勢力精進出生如來、妙高步如來、大寶聚如來、不退轉輪如來、寶句義吉祥如來、普遍大日如來、勝得如來。",
        "translation": "Northern: the Tathāgata of Firm Courageousness, the Tathāgata of Nonregression, the Tathāgata of Dustlessness, the Tathāgata of Auspicious Treasury Light, the Tathāgata of Immeasurable Fragrant Light, the Tathāgata of Siṃhala Sound, the Tathāgata of Great Power and精進出生, the Tathāgata of",
        "source": "T17n0843_002:0928b04_0"
    },
    {
        "source_sentence": "「如是等諸佛如來，種種名字，現在十方世界說法教化眾生。」",
        "translation": "Such and such buddha-tathāgatas, by various names, are present in the worlds of the ten directions to teach and transform sentient beings.",
        "source": "T17n0843_002:0928b08_1"
    },
    {
        "source_sentence": "佛告普華幢天子言：「如汝所問，此妙吉祥菩薩摩訶薩於彼金焰光明世界無垢日焰光明佛所，",
        "translation": "The Buddha told the celestial being Banner of Universal Flowers, As you asked, this wonderfully auspicious enlightening bodhisattva Mahāsattva was staying at the Buddha Light of Undefiled Sun and Flames in that world of Golden Flame Light.",
        "source": "T17n0843_002:0928b10_0"
    },
    {
        "source_sentence": "最初發於阿耨多羅三藐三菩提心。」",
        "translation": "They first give rise to the mind of unsurpassed, correct, and complete enlightenment.",
        "source": "T17n0843_002:0928b12_1"
    },
    {
        "source_sentence": "◎佛說大乘不思議神通境界經卷中",
        "translation": "*Buddha teaches that the great vehicle is inconceivable as the realm of supernormal powers.",
        "source": "T17n0843_002:0928b13_2"
    }
]