[
    {
        "source_sentence": "正法念處經卷第四十四",
        "translation": "Sutra of the Mindfulness of the True Dharma, Volume 44",
        "source": "T17n0721_044:0259a09_0"
    },
    {
        "source_sentence": "元魏婆羅門瞿曇般若流支譯",
        "translation": "Yuan Wei translation of the Prajñāpāramitā-prajñāruci by the Brāhmaṇa Gautama",
        "source": "T17n0721_044:0259a11_0"
    },
    {
        "source_sentence": "觀天品之二十三(夜摩天之九)",
        "translation": "Twenty-three of the Chapter on Contemplation of the Gods (nine of Yama Heaven)",
        "source": "T17n0721_044:0259a12_0"
    },
    {
        "source_sentence": "「『又復業分，若人生天，不曾布施，唯持於戒得生天中；",
        "translation": "'Furthermore, as for the factors of karma, if someone were to be born in heaven they would never give alms but only observe precepts and attain rebirth in heaven.",
        "source": "T17n0721_044:0259a13_0"
    },
    {
        "source_sentence": "唯有一種功德具足，五欲功德劣於餘天。",
        "translation": "Only one kind of merit is replete, and the five desires are inferior to those of other gods.",
        "source": "T17n0721_044:0259a14_1"
    },
    {
        "source_sentence": "是業因緣，人勝天劣。",
        "translation": "These are the causes and conditions for karma, with humans being superior and gods inferior.",
        "source": "T17n0721_044:0259a15_2"
    },
    {
        "source_sentence": "「『「人中布施已，　　則生於善道，",
        "translation": "'After giving among humans, they'll be born in a good path,",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　非天能布施，　　以是果地故。",
        "translation": "It is not the case that heavenly beings can make donations Because they are in the stage of fruition.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　人中是業地，　　果地則是天，",
        "translation": "Among humans, it is the stage of action. The stage of retribution is the one of gods.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　一切果因業，　　無因則無果。",
        "translation": "All results are the cause of all actions, and if there's no cause, there's no result.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　命念念不住，　　如是轉不迴，",
        "translation": "Each thought of life doesn’t abide, and thus it doesn’t turn back.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　業果將欲盡，　　應當作福德。",
        "translation": "The fruit of karma is about to end, so you should cultivate virtue.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　一切是心力，　　能令命流轉，",
        "translation": "All these are the powers of mind that can cause life to flow.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　是故有智者，　　不為命作惡。",
        "translation": "That is why the wise One does not commit evil for the sake of life.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　一切皆不畏，　　未來諸苦惱，",
        "translation": "All of them are not afraid, and future sufferings and afflictions",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　如是苦惱人，　　癡羂所縛故。",
        "translation": "Such a person is tormented because he's bound by delusion and anger.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　布施持戒寶，　　於誑心中有，",
        "translation": "The jewel of generosity and observance of precepts Is found in the heart of anger.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　若天若是人，　　則到於善道。",
        "translation": "If gods and humans are one and the same, Then they will arrive at a good path.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　有為生住滅，　　皆是無常故；",
        "translation": "Conditioned things arise, last, and perish, Because they are all impermanent.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　一切有為樂，　　亦如是無常。",
        "translation": "All conditioned pleasures are likewise impermanent.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　雖壞而生貪，　　念念動不住，",
        "translation": "Even though it breaks down, craving arises; Instant after instant it doesn’t abide.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "　　　樂命皆如是，　　是故應捨離。」",
        "translation": "Joy and life are all like this, so you should abandon them.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "「『毘婆尸佛當爾之時，而說偈言：「『如是此法，一切有為悉皆無常、苦、空、無我。",
        "translation": "At that point, Vipaśyin Buddha spoke these verses: Thus, all conditioned things are impermanent, painful, empty, and selfless.",
        "source": "T17n0721_044:0259a15_3"
    },
    {
        "source_sentence": "一切世間無量衰惱處處普遍，有五種縛，縛天縛人，愚癡目盲，惡欲壞心，",
        "translation": "All worlds are bound by the five kinds of fetters: fetters that bind gods, fetters that bind humans, blindness due to ignorance, blindness due to evil desires, and disintegrating states of mind.",
        "source": "T17n0721_044:0259b04_4"
    },
    {
        "source_sentence": "唯生愛樂。",
        "translation": "They only give rise to desires and pleasures.",
        "source": "T17n0721_044:0259b06_5"
    },
    {
        "source_sentence": "一切愚癡毛道凡夫迭相愛縛，如鳥在籠，一切人天於生死中流轉常行。",
        "translation": "All foolish, hairy worldlings are bound by the mutual love of each other like birds in a cage, and all humans and gods are constantly engaged in birth-and-death.",
        "source": "T17n0721_044:0259b06_6"
    },
    {
        "source_sentence": "以是義故，若人若天，或命或樂，勿生常想，應於世間一切諸法不生常想，",
        "translation": "For this reason, neither humans nor gods, whether with life or pleasure, should give rise to thoughts of permanence. They should not give rise to thoughts of permanence in regard to all things in the world.",
        "source": "T17n0721_044:0259b08_7"
    },
    {
        "source_sentence": "不作無量種種分別。",
        "translation": "They don't make measureless and various kinds of distinctions.",
        "source": "T17n0721_044:0259b10_8"
    },
    {
        "source_sentence": "又復具足十二種施，如是布施，天中所無，唯人中有。",
        "translation": "They also possess twelve kinds of charity, such as generosity that is not found in heaven but exists only among humans.",
        "source": "T17n0721_044:0259b10_9"
    },
    {
        "source_sentence": "天唯食果，若食果盡，爛失破壞，退彼天處。",
        "translation": "The gods only eat fruit. When their food is exhausted, it rots away and breaks down and they retreat to the heavenly realm.",
        "source": "T17n0721_044:0259b11_10"
    },
    {
        "source_sentence": "何等十二布施具足？",
        "translation": "What are the twelve kinds of giving that are complete?",
        "source": "T17n0721_044:0259b12_11"
    },
    {
        "source_sentence": "一者方處具足；",
        "translation": "The first is that they are endowed with all directions.",
        "source": "T17n0721_044:0259b13_12"
    },
    {
        "source_sentence": "二者時節具足；",
        "translation": "The second is the excellence of timing and seasons.",
        "source": "T17n0721_044:0259b13_13"
    },
    {
        "source_sentence": "三者功德具足；",
        "translation": "The third is endowed with virtue.",
        "source": "T17n0721_044:0259b14_0"
    },
    {
        "source_sentence": "四者可愛具足，謂所愛物；",
        "translation": "The fourth is that which is endowed with delightfulness, that is, the things one desires.",
        "source": "T17n0721_044:0259b14_1"
    },
    {
        "source_sentence": "五者福田具足；",
        "translation": "The fifth is endowed with the field of blessings.",
        "source": "T17n0721_044:0259b14_2"
    },
    {
        "source_sentence": "六者施飢渴者；",
        "translation": "The sixth is to give to those hungry and thirsty.",
        "source": "T17n0721_044:0259b15_3"
    },
    {
        "source_sentence": "七者信心施與；",
        "translation": "The seventh is giving by faith.",
        "source": "T17n0721_044:0259b15_4"
    },
    {
        "source_sentence": "八者不求而施，功德具足；",
        "translation": "The eighth is to give without seeking, fully endowed with virtue.",
        "source": "T17n0721_044:0259b16_0"
    },
    {
        "source_sentence": "九者有歡喜心施妻子等；",
        "translation": "The ninth is giving with joy to one’s wife and children, etc.",
        "source": "T17n0721_044:0259b16_1"
    },
    {
        "source_sentence": "十者簡擇心所敬重勝富伽羅而施與之；",
        "translation": "The tenth is that they give to those who are overweeningly esteemed by their hearts with a careful selection of the best and most distinguished treasures.",
        "source": "T17n0721_044:0259b17_2"
    },
    {
        "source_sentence": "十一者施於世間不輕賤者；",
        "translation": "The eleventh is giving to those who are not despised by the world.",
        "source": "T17n0721_044:0259b18_3"
    },
    {
        "source_sentence": "十二者施不望報。",
        "translation": "12. Giving without expecting reward.",
        "source": "T17n0721_044:0259b18_4"
    },
    {
        "source_sentence": "此如是等十二種施。",
        "translation": "These are these twelve kinds of giving.",
        "source": "T17n0721_044:0259b19_5"
    },
    {
        "source_sentence": "復有持戒功德具足，得生天中，盡己則退，是故天應捨放逸行。",
        "translation": "Again, if someone is endowed with the virtue of observing precepts and attains birth in heaven, they'll regress when they exhaust themselves. Therefore, gods should abandon careless behavior.",
        "source": "T17n0721_044:0259b19_6"
    },
    {
        "source_sentence": "如是十二離垢布施，為轉輪王，財寶富足，或生於天或天相似。",
        "translation": "Thus, these twelve kinds of undefiled generosity are like a wheel-turning king who's wealthy and rich, either born in heaven or similar to heaven.",
        "source": "T17n0721_044:0259b21_7"
    },
    {
        "source_sentence": "「『復有十二雜垢布施。",
        "translation": "'There are another twelve defiled forms of generosity.",
        "source": "T17n0721_044:0259b23_0"
    },
    {
        "source_sentence": "何等名為十二種垢？",
        "translation": "What are these twelve kinds of defilement?",
        "source": "T17n0721_044:0259b23_1"
    },
    {
        "source_sentence": "一者於多人聚和合眾中或於僧中，平等皆有戒智及行功德具足，不平等施。",
        "translation": "One is that they are equally endowed with morality, wisdom, and the virtue of practice among many people who gather together in congregations or within the saṃgha, and they don't give equally.",
        "source": "T17n0721_044:0259b23_2"
    },
    {
        "source_sentence": "此是垢施，得少果報。",
        "translation": "This is a defiled donation that will have little reward.",
        "source": "T17n0721_044:0259b25_3"
    },
    {
        "source_sentence": "二者若男若女以欲因緣，或男施女、或女施男，此是第二垢惡布施。",
        "translation": "Second, if a man or woman gives to a woman because of the causes of desire, or if a man gives to a woman or a woman gives to a man, this is the second kind of badly defiled generosity.",
        "source": "T17n0721_044:0259b26_4"
    },
    {
        "source_sentence": "又復第三垢布施者，以怖畏故，捨物施與王家門師，謂是沙門、婆羅門等，",
        "translation": "Again, the third kind of charity that is tainted with defilement is to give things away because of fear and giving them to the king's householder, which are called ascetics or brāhmaṇas.",
        "source": "T17n0721_044:0259b27_5"
    },
    {
        "source_sentence": "有如是心：「若我於王得衰惱者，則能救我。」",
        "translation": "They had this thought, If I were to become depressed by the king, I'd be able to save him.",
        "source": "T17n0721_044:0259b29_6"
    },
    {
        "source_sentence": "此非修思因緣故與，名為垢施。",
        "translation": "This is called defiled giving because it's not given because of the causes and conditions for cultivating thought.",
        "source": "T17n0721_044:0259c01_7"
    },
    {
        "source_sentence": "又復第四垢布施者，所謂癡心捨物布施，如彼外道婆羅門等，齋會等施。",
        "translation": "Again, the fourth kind of defiled generosity is what's called giving with a deluded mind that abandons things like those non-Buddhist priests and so forth, such as purifying assemblies and so forth.",
        "source": "T17n0721_044:0259c02_8"
    },
    {
        "source_sentence": "此是第四垢惡布施。",
        "translation": "This is the fourth defilement of bad generosity.",
        "source": "T17n0721_044:0259c03_9"
    },
    {
        "source_sentence": "又復第五垢布施者，謂見他人所布施者，不知彼人持戒以不？",
        "translation": "Again, the fifth kind of defiled generosity is when someone sees another person's generosity and doesn't know whether they uphold the precepts?",
        "source": "T17n0721_044:0259c04_10"
    },
    {
        "source_sentence": "不知彼人有智慧不？",
        "translation": "Don't you know whether that person has wisdom?",
        "source": "T17n0721_044:0259c05_11"
    },
    {
        "source_sentence": "有寂靜不？",
        "translation": "Is there stillness?",
        "source": "T17n0721_044:0259c06_12"
    },
    {
        "source_sentence": "為有禪不？",
        "translation": "Why is there meditation?",
        "source": "T17n0721_044:0259c06_13"
    },
    {
        "source_sentence": "唯見他人如是布施，他因緣故，內自無思，如是捨物而施與之。",
        "translation": "They only see others giving in this way, and because of the causes and conditions for others, they don't think inside themselves, thus abandon things and give them to them.",
        "source": "T17n0721_044:0259c06_14"
    },
    {
        "source_sentence": "此是第五垢惡布施。",
        "translation": "This is the fifth defilement of bad generosity.",
        "source": "T17n0721_044:0259c08_15"
    },
    {
        "source_sentence": "又復第六垢布施者，謂前乞者苦求乃與。",
        "translation": "Furthermore, the sixth kind of donation that's stained by defilement is given to someone who previously begged for it and gave it because they were asking for it.",
        "source": "T17n0721_044:0259c08_16"
    },
    {
        "source_sentence": "此是第六垢惡布施。",
        "translation": "This is the sixth defiled form of bad generosity.",
        "source": "T17n0721_044:0259c09_17"
    },
    {
        "source_sentence": "又復第七垢布施者，知他有物，為令他信，方便欲偷，捨物與之，後欲作惡種種侵損。",
        "translation": "Again, the seventh defiled form of generosity is when someone knows that something exists in others and wants to cause others to believe it, so they skillfully steal it, give it away, and later want to do evil or various kinds of harm.",
        "source": "T17n0721_044:0259c09_18"
    },
    {
        "source_sentence": "為覓其便，是故與物，此是第七垢惡布施。",
        "translation": "This is the seventh defiled and unwholesome form of giving, which is to give things in order to find an opportunity.",
        "source": "T17n0721_044:0259c11_19"
    },
    {
        "source_sentence": "又復第八垢布施者，為破壞他和合之事，捨物施之，於他二人共為一友，",
        "translation": "Again, the eighth kind of generosity that’s tainted with defilement is to destroy the harmony of others by giving things away in order to be a friend to two people.",
        "source": "T17n0721_044:0259c12_20"
    },
    {
        "source_sentence": "令使別離，後覓其便，則與衰惱。",
        "translation": "He ordered his envoy to leave, and when he looked for an opportunity to do so, he was disheartened.",
        "source": "T17n0721_044:0259c14_21"
    },
    {
        "source_sentence": "此是第八垢惡布施。",
        "translation": "This is the eighth defiled form of bad generosity.",
        "source": "T17n0721_044:0259c15_22"
    },
    {
        "source_sentence": "又復第九垢布施者，謂為成親，捨物與他，或男施女、或女施男。",
        "translation": "Again, the ninth kind of defiled generosity is that which becomes a relative and gives something to others, whether it's given to a man or woman or given to a man by a woman.",
        "source": "T17n0721_044:0259c15_23"
    },
    {
        "source_sentence": "此是第九垢惡布施。",
        "translation": "This is the ninth defiled form of bad generosity.",
        "source": "T17n0721_044:0259c17_0"
    },
    {
        "source_sentence": "又復第十垢布施者，所謂治生，多買食具種種諸物粟豆果菜一切雜物，",
        "translation": "Again, the tenth defilement is generosity. It's called healing by purchasing food and drink, various goods, millet, beans, fruits, vegetables, and all sorts of miscellaneous things.",
        "source": "T17n0721_044:0259c17_1"
    },
    {
        "source_sentence": "待齋會日，貴賣邀利，得物自用，微少饒之。",
        "translation": "On the day of the assembly they were invited to sell their goods and offered profits. They obtained property for their own use, but gave only small allowances to those who did so.",
        "source": "T17n0721_044:0259c19_2"
    },
    {
        "source_sentence": "此是第十垢惡布施。",
        "translation": "This is the tenth defilement of bad generosity.",
        "source": "T17n0721_044:0259c20_3"
    },
    {
        "source_sentence": "又第十一垢布施者，為名稱故，捨物布施。",
        "translation": "Also, the eleventh is a defiled donation because it's given by abandoning things for fame.",
        "source": "T17n0721_044:0259c20_4"
    },
    {
        "source_sentence": "此第十一垢惡布施。",
        "translation": "This is the eleventh defilement of bad generosity.",
        "source": "T17n0721_044:0259c21_5"
    },
    {
        "source_sentence": "又第十二垢布施者，妻子飢貧，以物與之，內無善思。",
        "translation": "Also, the twelfth defilement of giving is when a wife and child are hungry and poor and give something to them without good thoughts inside.",
        "source": "T17n0721_044:0259c21_6"
    },
    {
        "source_sentence": "此第十二垢惡布施。",
        "translation": "This is the twelfth defilement of bad generosity.",
        "source": "T17n0721_044:0259c23_7"
    },
    {
        "source_sentence": "此一切施，離思、無思，以無思故，空無果報，若思增長則能離垢。",
        "translation": "All these donations are free from thought and without thought: because of being without thought, emptiness has no retribution. If thought increases, then it can be freed from impurity.",
        "source": "T17n0721_044:0259c23_8"
    },
    {
        "source_sentence": "譬如垢衣，灰汁洗浣則便清淨。",
        "translation": "It's like a dirty robe that's clean when it's washed and rinsed with ashes and juice.",
        "source": "T17n0721_044:0259c25_9"
    },
    {
        "source_sentence": "如是思熏，布施成就。",
        "translation": "Thus, it's the accomplishment of giving when it's perfumed by contemplation.",
        "source": "T17n0721_044:0259c25_10"
    },
    {
        "source_sentence": "「『「十二功德具，　　離十二種垢，",
        "translation": "'The twelve treasures of virtue are free of the twelve kinds of defilement,",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　成就清淨施，　　相違則垢濁。",
        "translation": "Accomplishing pure giving is at odds with dirt and turbidity.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　或天或男子，　　布施得大力；",
        "translation": "Whether they are gods or men, Their generosity will be greatly increased.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　離施墮惡趣，　　布施生善道。",
        "translation": "Being free of giving, they'll fall into a bad destiny, and generosity will give rise to a good path.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　貪心嫉妬垢，　　唯親愛妻子，",
        "translation": "Their craving and jealousy are the only stain of affection for their wives and children.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　此人墮餓鬼，　　唯悕望飲食。",
        "translation": "This man has fallen into the realm of hungry ghosts, starving only for food and drink.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　若解貪心縛，　　斫伐慢心樹，",
        "translation": "If someone frees themselves from the bond of craving, they'll cut down the tree of conceit.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　除滅闇聚者，　　此人布施故。",
        "translation": "He who extinguishes the cluster of darkness because this person gives alms.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　布施在前行，　　施主隨其後，",
        "translation": "Giving comes first, the donor follows after him.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　布施能示道，　　行到他世去。",
        "translation": "Giving can show the path and travel to other worlds.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　施水澡浴人，　　以持戒香塗，",
        "translation": "They give water to bathe people and rub it on them with the fragrance of observing precepts.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　智慧廣無垢，　　得度苦彼岸。",
        "translation": "Their wisdom is vast and spotless, And they are able to cross over to the other shore of suffering.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　丈夫有三燈，　　為利益故然，",
        "translation": "A man has three lamps, but it's for the sake of benefit.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　所謂施戒智，　　此等能除過。",
        "translation": "The so-called wisdom of generosity and morality is able to remove faults.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　愛極為深廣，　　疑波極動亂，",
        "translation": "The craving for the ultimate is deep and vast, And the waves of doubt are greatly disturbed.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　持戒修智故，　　過如是苦海。",
        "translation": "Because of observing precepts and cultivating wisdom, they're beyond such an ocean of suffering.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　心不調而速，　　一切處皆著，",
        "translation": "Their minds are not disciplined but quick, Attached everywhere.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　布施持戒法，　　則能縛此心。",
        "translation": "By bestowing generosity and observing precepts, they can bind this mind.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　此等三藥師，　　能除煩惱病，",
        "translation": "These three masters of healing can remove the afflictions and illnesses.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　布施持戒智，　　恒常與安樂。",
        "translation": "Their generosity, observance of precepts, and wisdom are always constant and give them well-being.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　心有放逸過，　　分別曲而輕；",
        "translation": "Their minds have the fault of heedlessness, Distinctly crooked but light.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　布施持戒智，　　此三能縛心。",
        "translation": "Consciousness of generosity, observance of precepts, and morality: These three can bind the mind.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　三種過熾火，　　燒一切世間，",
        "translation": "Three kinds of excessively blazing fire burn all worlds.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "　　　智水滅火已，　　得寂滅涅槃。」",
        "translation": "After the water of wisdom ceases the fire, he attains nirvāṇa in extinction.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "「『毘婆尸佛當爾之時，而說偈言：「『彼毘婆尸如來世尊，如是書經在彼塔中。",
        "translation": "'It was then that Vipaśyin Buddha spoke a verse, saying, 'That Tathāgata Vaiśravaṇa Bhagavān thus wrote the sūtra in that stūpa.",
        "source": "T17n0721_044:0259c26_11"
    },
    {
        "source_sentence": "「『此布施行，唯人能行，天則不能。",
        "translation": "'This is a teaching that can be carried out only by humans and not by gods.",
        "source": "T17n0721_044:0260a22_12"
    },
    {
        "source_sentence": "以此因緣，人勝天劣。",
        "translation": "Because of these causes and conditions, humans are superior to gods.",
        "source": "T17n0721_044:0260a23_13"
    },
    {
        "source_sentence": "汝等既知如是布施，於諸境界，心莫放逸，當善持心。",
        "translation": "Knowing this kind of generosity, don't be careless in your minds about objects, and you should well maintain your minds.",
        "source": "T17n0721_044:0260a24_14"
    },
    {
        "source_sentence": "善持心已，故令煩惱大惡過患心中不生。",
        "translation": "Because they have well-maintained minds, the afflictions and great evils won't arise in their minds.",
        "source": "T17n0721_044:0260a25_15"
    },
    {
        "source_sentence": "若其生者，智火能燒；",
        "translation": "If they arise, the fire of knowledge can burn them.",
        "source": "T17n0721_044:0260a26_16"
    },
    {
        "source_sentence": "智火燒已，則到第一不退之處，不生不老、不死不盡如是之處。",
        "translation": "After the fire of wisdom is burned, he goes to the first place where he doesn't regress, where he doesn't grow old or die and doesn't exhaust it.",
        "source": "T17n0721_044:0260a26_17"
    },
    {
        "source_sentence": "應當捨離，如怨放逸。",
        "translation": "They should be abandoned, like enemies and heedlessness.",
        "source": "T17n0721_044:0260a28_18"
    },
    {
        "source_sentence": "又復天眾更有餘事，意則劣減，損辱羞恥。",
        "translation": "Again, the gods have other things that cause their minds to weaken and diminish, humiliating and shameful.",
        "source": "T17n0721_044:0260a28_19"
    },
    {
        "source_sentence": "所謂食時，現見故羞。",
        "translation": "It means that when they eat, they're ashamed of their present views.",
        "source": "T17n0721_044:0260a29_20"
    },
    {
        "source_sentence": "以業勢力有下中上，果亦如是有下中上。",
        "translation": "Because of the power of action, there is inferior, middle and superior. The same applies to the fruit:",
        "source": "T17n0721_044:0260b01_21"
    },
    {
        "source_sentence": "彼天不能乃至少物以施他天，叵以自業迴轉與他。",
        "translation": "Those gods can't give even a small amount of things to other gods, and they can't give them to others because of their own actions.",
        "source": "T17n0721_044:0260b02_0"
    },
    {
        "source_sentence": "所謂人中食時捨施，或時持戒，如是得食。",
        "translation": "It means that when a person eats, they give alms and sometimes observe precepts, and thus they attain food.",
        "source": "T17n0721_044:0260b03_1"
    },
    {
        "source_sentence": "天見他食勝色勝香，勝味具足，如是見已，心則羞恥。",
        "translation": "The gods see that the food of others has superior form and fragrance, is replete with superior taste and flavor, and after seeing it like this, their minds are embarrassed.",
        "source": "T17n0721_044:0260b04_2"
    },
    {
        "source_sentence": "若在園林、蓮花池水遊戲之時，一切受樂如業相似，成就樂事。",
        "translation": "When he's playing in a park, a lotus pond, or a pool of water, all the pleasures are like actions that accomplish pleasant things.",
        "source": "T17n0721_044:0260b05_3"
    },
    {
        "source_sentence": "見餘天面，受快樂已，內心羞慚，自身低減。",
        "translation": "Seeing the other celestial faces, they're delighted, and their internal minds are embarrassed and humiliated, with their own bodies shrinking.",
        "source": "T17n0721_044:0260b06_4"
    },
    {
        "source_sentence": "「『天中則有五種羞恥。",
        "translation": "'In heaven, there are five kinds of shame.",
        "source": "T17n0721_044:0260b07_5"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T17n0721_044:0260b08_6"
    },
    {
        "source_sentence": "一、謂食時有見他天白須陀色，自食則垢，或時色赤。",
        "translation": "1. It means that when he eats, he sees the white color of other gods' white streamers, and when he eats it himself, it becomes dirty, or sometimes red.",
        "source": "T17n0721_044:0260b08_7"
    },
    {
        "source_sentence": "相近食食，見則極羞，此是初羞。",
        "translation": "When they're close to food, they're extremely ashamed when they see it. This is the first kind of shame.",
        "source": "T17n0721_044:0260b09_8"
    },
    {
        "source_sentence": "第二羞者，謂見他天端正好色、形服莊嚴，有多天女妙色殊絕供養餘天，",
        "translation": "The second kind of shame is when one sees other goddesses with correct form and adornment in their appearance. There are many heavenly maidens of marvelous form who do not provide for the other gods.",
        "source": "T17n0721_044:0260b10_9"
    },
    {
        "source_sentence": "見已則羞。",
        "translation": "After seeing it, they'll be ashamed.",
        "source": "T17n0721_044:0260b11_10"
    },
    {
        "source_sentence": "第三羞者，謂見他天在蓮花中、空中飛行，園林山峯、蓮花池水、金毘琉璃戲樂處行。",
        "translation": "The third kind of shame is when he sees other gods flying in the midst of lotus flowers or in the sky, walking in parks, forests, mountains, peaks, lotus blossom ponds, pools, and golden vaiḍūrya playgrounds.",
        "source": "T17n0721_044:0260b12_11"
    },
    {
        "source_sentence": "以業勝故，飛行則疾。",
        "translation": "Because of the superiority of karma, flying is swift.",
        "source": "T17n0721_044:0260b14_12"
    },
    {
        "source_sentence": "若少業天，行則不速，不能共彼同處遊行，常在他後，羞天女眾。",
        "translation": "If the gods with few karmas don't travel quickly, they can't travel together with them in the same place, and they're always behind other goddesses who are ashamed of themselves.",
        "source": "T17n0721_044:0260b14_13"
    },
    {
        "source_sentence": "第四羞者，謂天入在蓮花池者，以天本有如是業故，則有如是蓮花池生色香觸量。",
        "translation": "The fourth shame is that when a god enters a lotus-flower pond, it's because the gods originally had such actions, and then there's such a lotus-flower pond that produces form, odor, taste, touch, and measure.",
        "source": "T17n0721_044:0260b16_0"
    },
    {
        "source_sentence": "劣天見已，於眷屬中則生羞恥。",
        "translation": "When the inferior gods see this, they'll become ashamed of themselves among their followers.",
        "source": "T17n0721_044:0260b17_1"
    },
    {
        "source_sentence": "第五羞者，如天之業，如是得報，如業坐處。",
        "translation": "The fifth shame is like the karma of gods, which thus receives its reward and is like the seat of karma.",
        "source": "T17n0721_044:0260b18_2"
    },
    {
        "source_sentence": "若於本時作大善業，則有妙好毘琉璃座或青寶座，或時復有赤蓮花色勝坐處坐。",
        "translation": "If someone had done great good deeds in the past, they'd have a marvelously beautiful vaiḍūrya throne or a blue-jeweled throne, or they might have another red lotus flower of the color of their superior seat.",
        "source": "T17n0721_044:0260b19_3"
    },
    {
        "source_sentence": "若餘劣天在彼處坐，以業少故，如是妙座或變為金或變為銀，或為頗梨，",
        "translation": "If the other inferior gods are seated there because their karma is small, such a wonderful throne may become gold, silver, or crystal.",
        "source": "T17n0721_044:0260b21_4"
    },
    {
        "source_sentence": "彼天既見，坐處變已種種雜業——輕重等業。",
        "translation": "When that god sees the place where he's sitting, he transforms it into various mixed karmas - such as light and heavy karma.",
        "source": "T17n0721_044:0260b23_5"
    },
    {
        "source_sentence": "既見知已，則生羞恥。",
        "translation": "Having seen and known it, they become ashamed.",
        "source": "T17n0721_044:0260b24_6"
    },
    {
        "source_sentence": "既生羞故，威德劣減。",
        "translation": "As a result of their shame, their authority and virtue will decrease.",
        "source": "T17n0721_044:0260b24_7"
    },
    {
        "source_sentence": "彼天如是面色減劣，餘天威德面色增上。",
        "translation": "In this way the appearance of those gods decreases, while that of the other gods increases in stature.",
        "source": "T17n0721_044:0260b25_8"
    },
    {
        "source_sentence": "自天女眾如是見之，則捨而去，捨離如是少業天子，依止其餘大業天去，",
        "translation": "When the goddesses themselves saw him in this way, they abandoned them and departed. Relying on the other great deities of action, they forsake these celestial beings of lesser karma and departed.",
        "source": "T17n0721_044:0260b26_9"
    },
    {
        "source_sentence": "遊戲受樂。",
        "translation": "They play and experience pleasure.",
        "source": "T17n0721_044:0260b27_10"
    },
    {
        "source_sentence": "天女同心，一切皆共詣餘天子。",
        "translation": "The goddesses were all united in mind, and they all went to the other celestials together.",
        "source": "T17n0721_044:0260b28_0"
    },
    {
        "source_sentence": "彼少業天極生羞恥。",
        "translation": "The gods with little karma are extremely embarrassed.",
        "source": "T17n0721_044:0260b28_1"
    },
    {
        "source_sentence": "此是天中於眷屬所，第五羞恥。",
        "translation": "This is the fifth shame among the gods in their retinues.",
        "source": "T17n0721_044:0260b29_2"
    },
    {
        "source_sentence": "「『如是不樂有為之法，彼有為法能為誑惑，令生貪心。",
        "translation": "'Thus, they don't delight in conditioned dharmas, and those conditioned dharmas can cause anger and confusion and give rise to the mind of desire.",
        "source": "T17n0721_044:0260b29_3"
    },
    {
        "source_sentence": "如練樹葉，其味甚苦，和餘甜味，天樂亦爾，雜苦、雜樂，何況復在異道眾生地獄、餓鬼、畜生中者，",
        "translation": "It is like the leaves of a luxuriant tree whose taste is so bitter that it mixes together sweet flavors and heavenly pleasures, not to mention all kinds of painful and delicious things, much less those found among heretical beings in hell, among hungry ghosts, or among animals.",
        "source": "T17n0721_044:0260c02_4"
    },
    {
        "source_sentence": "或定業生、不定業生，常苦不止，有無量種大力苦生。",
        "translation": "Or, when karma arises in a concentrated state and karma arises in an un concentrated state, constant suffering doesn't stop, and there are measureless kinds of greatly powerful forms of painful birth.",
        "source": "T17n0721_044:0260c04_5"
    },
    {
        "source_sentence": "譬如海中種種雜水，異異河入，種種水入。",
        "translation": "It's like the various kinds of water in the ocean that enter different rivers and various kinds of water that enter.",
        "source": "T17n0721_044:0260c05_6"
    },
    {
        "source_sentence": "眾生之心亦復如是，相續河流，種種諸業，依業河起，成就大力，諸苦惱生。",
        "translation": "The minds of sentient beings are also like this: successively flowing rivers, various actions arise in dependence on the river of action. They accomplish great powers and give rise to suffering and distress.",
        "source": "T17n0721_044:0260c06_7"
    },
    {
        "source_sentence": "汝等天眾此量如是，說一切種異苦應知。",
        "translation": "You gods and goddesses, this is the amount of suffering that should be known by saying all kinds of different kinds of suffering.",
        "source": "T17n0721_044:0260c08_8"
    },
    {
        "source_sentence": "總一切苦有三種因，和合相應，諸苦滿足。",
        "translation": "There are three general causes of all unsatisfactoriness:",
        "source": "T17n0721_044:0260c09_0"
    },
    {
        "source_sentence": "此三種苦有三對治，則能除之。",
        "translation": "These three kinds of suffering have three antidotes that remove them.",
        "source": "T17n0721_044:0260c09_1"
    },
    {
        "source_sentence": "何等為三？",
        "translation": "What are these three?",
        "source": "T17n0721_044:0260c10_2"
    },
    {
        "source_sentence": "謂智、戒、施。",
        "translation": "They are wisdom, morality, and generosity.",
        "source": "T17n0721_044:0260c10_3"
    },
    {
        "source_sentence": "「『「若心不依止，　　智戒施等三，",
        "translation": "'Suppose the mind doesn't rely on three things like wisdom, morality, generosity, and so forth.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　彼眾生常苦，　　樂則不可得。",
        "translation": "Those sentient beings are always painful, but happiness is unobtainable.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　如種種因緣，　　何等業幾種，",
        "translation": "What are the various kinds of actions, and how many types are they?",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　眾生所作業，　　如是成就果。",
        "translation": "The actions of sentient beings are thus the fruit of their accomplishment.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　一切皆因緣，　　無不因緣者，",
        "translation": "All things are causes and conditions; There is no non-causation.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　有為不破壞，　　因緣不可見。",
        "translation": "Conditioned things don’t break down; The causes and conditions are invisible.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　為心所誑故，　　布施面羞慚，",
        "translation": "Because their minds are coarse, they give generosity to the shameful.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　如是布施者，　　則不得樂果。",
        "translation": "If someone gives in this way, they won't attain the pleasant fruit.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　和合布施勝，　　捨離慳嫉垢，",
        "translation": "The combination of generosity is superior, forsaking the stain of stinginess and jealousy.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　天常受樂故，　　則無如是心。",
        "translation": "Because gods always experience happiness, they don't have such a mind.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　飢渴為大火，　　能燒諸餓鬼，",
        "translation": "Hungry thirst is a great fire that burns the hungry ghosts.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　一切慳嫉果，　　實智者所說。",
        "translation": "All the fruits of avarice and jealousy Are taught by the wise.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　若常行布施，　　彼必定得樂，",
        "translation": "If someone always practices generosity, they'll surely attain happiness.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　以施得樂果，　　是故布施勝。",
        "translation": "Because generosity obtains pleasant results, it's therefore superior to giving.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　世間作光明，　　恒常自隨逐，",
        "translation": "The world produces its own light, Which always follows itself.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　布施則到天，　　天供養如僕。",
        "translation": "Giving goes to the gods, and their offerings are like servants.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　施是不誑處，　　如來如是說，",
        "translation": "Giving is not a place of sexual misconduct. The Tathāgata explains it thus:",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　以其是實故，　　常應行布施。",
        "translation": "Because they are real, they should always practice generosity.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　捨慳嫉怨已，　　而善修於心，",
        "translation": "Having abandoned stinginess and jealousy, They skillfully cultivate the mind:",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　若能行布施，　　得渡生死海。",
        "translation": "If someone can practice generosity, they'll be able to cross the ocean of birth and death.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　施三寶福田，　　三種皆清淨，",
        "translation": "Giving to the field of merit of the three treasures, The three kinds are all pure.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　決定於三時，　　三眼見彼果。",
        "translation": "Determined at three moments, the eye sees this fruit with three eyes:",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　初常行布施，　　次精勤護戒，",
        "translation": "The first always practices giving, the second diligently guards precepts.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　智則能割愛，　　此為大樂道。",
        "translation": "Wisdom then can cut off craving, which is the great joyful path.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　若不除斷愛，　　世間不饒益，",
        "translation": "If someone doesn’t remove craving, the world won’t benefit them.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　彼則不能到，　　不生死勝處。",
        "translation": "They won't be able to reach the superior place of birth and death.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　常離不施心，　　恒樂行布施，",
        "translation": "Always free from the mind of not giving, they always delight in practicing generosity.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　無施故飢渴，　　餓鬼中燒身。",
        "translation": "Being hungry and thirsty because of the absence of generosity, he burns his body in a hungry ghost.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　布施得大富，　　天乾闥婆中，",
        "translation": "Giving obtains great wealth, which is found in the heavenly gandharvas.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　因施得為王，　　善法轉輪王。",
        "translation": "Because of giving, he attains the status of king, the wheel-turning king of good qualities.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　依止布施地，　　智者能持戒，",
        "translation": "Relying on the ground of generosity, The wise can keep the precepts.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　持戒者知時，　　因智得解脫。",
        "translation": "A person who observes precepts knows the time and attains liberation based on knowledge.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　出苦之要道，　　一切佛所讚，",
        "translation": "The essential path of liberation from suffering Is praised by all the Buddhas.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　勇健者知已，　　則常行布施。",
        "translation": "Known, the bold one always practices generosity.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　不布施生天，　　天中受樂少，",
        "translation": "They don't give alms to the gods who are born in heaven, and they experience little pleasure in heaven.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　施故生人中，　　從生受富樂。",
        "translation": "Because of giving, he's born among humans and receives wealth and happiness from birth.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　若生在畜生，　　亦常受樂果，",
        "translation": "If they are born in the realm of animals, They will always experience happy results.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　一切布施樂，　　是智者所說。",
        "translation": "All the pleasures of giving are taught by the wise.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　若在餓鬼中，　　彼亦有飲食，",
        "translation": "If they're among hungry ghosts, They also have food and drink.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　以本少施故，　　則得如是果。",
        "translation": "Because they originally gave little, They will attain such a fruit.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　若生地獄中，　　飢渴不能燒，",
        "translation": "If they're born in hell, they can't be burned by hunger and thirst.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　一切以施故，　　如是皆得果。",
        "translation": "Because of giving everything, they all attain its fruit in this way.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　生泥道中者，　　是眾生自業，",
        "translation": "Those who are born in the path of mud Are sentient beings’ own actions.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　布施得安樂，　　如見於父母。",
        "translation": "Giving obtains well-being, just as seeing one's parents.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　如是住施地，　　常行於布施，",
        "translation": "They thus abide in the land of giving, Always practicing generosity.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "　　　恒樂施持戒，　　得脫諸惡處。」』",
        "translation": "They always delight in generosity and observe precepts, and they'll be freed from bad places.'",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "「『毘婆尸佛當爾之時，而說偈言：「牟修樓陀夜摩天王如是已示放逸天眾，",
        "translation": "'It was then that Vipaśyin Buddha spoke these verses: Thus has King Mucilinda, lord of the gods, shown the heedless heavenly hosts.",
        "source": "T17n0721_044:0260c11_4"
    },
    {
        "source_sentence": "天眾知已，一切現見住戒果報，攝取持戒。",
        "translation": "Knowing this, the gods and goddesses all now see the results of observing precepts and taking in the observance of precepts.",
        "source": "T17n0721_044:0261a29_5"
    },
    {
        "source_sentence": "「『又彼天眾復有羞慚，所謂業故，現前羞恥，見食故羞。",
        "translation": "'Furthermore, those gods are also ashamed because of their actions, which are called shameful because they're shown to be ashamed and ashamed because they see food.",
        "source": "T17n0721_044:0261b02_0"
    },
    {
        "source_sentence": "園林蓮花處處遊行，多天女眾而為圍遶，種種樂音，在於天中、地上而行，",
        "translation": "It is surrounded by many heavenly maidens. Various kinds of music are played in the sky and on the ground.",
        "source": "T17n0721_044:0261b03_1"
    },
    {
        "source_sentence": "心樂境界五欲之樂，第一勝樂不可譬喻，成就樂事。",
        "translation": "The first is the supreme bliss that can't be compared to the bliss of the five desires in the objective realm of mental bliss, which accomplishes pleasant things.",
        "source": "T17n0721_044:0261b04_2"
    },
    {
        "source_sentence": "「『如是轉行飲食地處，次第往到種種莊嚴端正天女。",
        "translation": "'Thus, he walks around the place where he's eating and drinking, going in order to various adorned, correct heavenly maidens.",
        "source": "T17n0721_044:0261b07_0"
    },
    {
        "source_sentence": "如是天女之所圍繞，彼天歌舞五樂音聲遊戲受樂。",
        "translation": "Surrounded by these heavenly maidens, the gods sing and dance with five kinds of music, play and enjoy it.",
        "source": "T17n0721_044:0261b08_1"
    },
    {
        "source_sentence": "彼天耳識不知厭足，境界可愛，是故受樂不可厭足。",
        "translation": "The divine ear consciousness doesn't know that they aren't satisfied, and the objective realm is desirable; therefore, they experience pleasure without being satisfied.",
        "source": "T17n0721_044:0261b09_2"
    },
    {
        "source_sentence": "又復彼天見種種色皆悉可愛，端嚴殊妙，如意念色，見則生樂。",
        "translation": "Furthermore, those gods see various forms that are all desirable, beautifully arrayed, and mindful of form as they wish, and when they see them, happiness arises.",
        "source": "T17n0721_044:0261b11_0"
    },
    {
        "source_sentence": "種種光明、種種異色、種種形相，或在遠住或在近住、或中間住，彼天見已，",
        "translation": "Having seen the various kinds of light, the various different colors, and the various forms, some dwelling far away, some near, some in between.",
        "source": "T17n0721_044:0261b12_1"
    },
    {
        "source_sentence": "有如是念：「彼遠住色，可前近來。」",
        "translation": "They have this thought, That distantly abiding form may come and go.",
        "source": "T17n0721_044:0261b14_2"
    },
    {
        "source_sentence": "隨心念時，彼可愛色即來在近。",
        "translation": "Whenever he's mindful, those desirable forms will come near him.",
        "source": "T17n0721_044:0261b14_3"
    },
    {
        "source_sentence": "或中住色，如意念來。",
        "translation": "Or they may abide in form in the middle, mindful of it as wished.",
        "source": "T17n0721_044:0261b15_4"
    },
    {
        "source_sentence": "若念近者，近者則來；",
        "translation": "If someone is mindful of the near, the near will come.",
        "source": "T17n0721_044:0261b16_5"
    },
    {
        "source_sentence": "若念中者，中者則來；",
        "translation": "If someone is mindful of the middle, the middle one will come.",
        "source": "T17n0721_044:0261b16_6"
    },
    {
        "source_sentence": "若念遠者，遠者則來。",
        "translation": "If he's mindful of the distant, the distant will come.",
        "source": "T17n0721_044:0261b17_7"
    },
    {
        "source_sentence": "業果勝故，如是隨意。",
        "translation": "Because the result of karma is superior, it's thus done as you wish.",
        "source": "T17n0721_044:0261b17_8"
    },
    {
        "source_sentence": "以彼業因有下中上，天報如是有下中上。",
        "translation": "Because the causes of these actions have lower, middle and higher [causes]. The retributions of gods are thus inferior, middle and superior.",
        "source": "T17n0721_044:0261b18_9"
    },
    {
        "source_sentence": "如是彼天愛毒所齧，不知厭足，如火得薪，無有足時。",
        "translation": "Thus, those gods are devoured by the poison of craving and don't know they're satisfied, like fire obtaining firewood, which has no time to be satisfied.",
        "source": "T17n0721_044:0261b19_10"
    },
    {
        "source_sentence": "愛心之者，則於境界不可厭足，如是天中無量種樂皆不可足。",
        "translation": "If someone loves it, they won't be satisfied with the objective realm, and thus there are measureless kinds of happiness in heaven that aren't enough.",
        "source": "T17n0721_044:0261b20_11"
    },
    {
        "source_sentence": "「『又復天眾鼻識嗅香有無量種，謂園林中天妙花香。",
        "translation": "'Furthermore, there are measureless kinds of fragrance that can be smelled by the gods' noses and consciousnesses, which are the heavenly marvelous flower fragrance in a garden or forest.",
        "source": "T17n0721_044:0261b22_0"
    },
    {
        "source_sentence": "又復彼花樹枝中生，枝垂至地，有種種色、種種形相，種種分分雜雜異異，",
        "translation": "Again, those flowers grow from the branches of trees and hang down to the ground. They have various forms and shapes, with various mixed parts and different differences.",
        "source": "T17n0721_044:0261b23_1"
    },
    {
        "source_sentence": "一切時花同時開敷。",
        "translation": "At all times, the flowers are blooming at the same time.",
        "source": "T17n0721_044:0261b24_2"
    },
    {
        "source_sentence": "彼如是花，天女取之，送與天子令得嗅之，或為風吹香至天子，天子嗅之，",
        "translation": "The goddesses take these flowers and give them to the celestial beings so that they can smell them. Or, if a wind blows an odor like this and reaches the celestial beings, the heavenly beings will smell them.",
        "source": "T17n0721_044:0261b25_3"
    },
    {
        "source_sentence": "嗅已欲發，則受欲樂。",
        "translation": "After smelling it, he wants to give rise to it, and then he'll experience the pleasure of desire.",
        "source": "T17n0721_044:0261b27_4"
    },
    {
        "source_sentence": "「『又復天身，如是天中莊嚴殊妙，與天相應。",
        "translation": "'Furthermore, the body of the gods is thus adorned and marvelously beautiful in heaven, which is associated with the gods.",
        "source": "T17n0721_044:0261b28_0"
    },
    {
        "source_sentence": "頭上莊嚴寶瓔珞等，隨天意念，一切出生。",
        "translation": "Their heads are adorned with jeweled jewelry and so forth, all produced according to the gods' wishes.",
        "source": "T17n0721_044:0261b28_1"
    },
    {
        "source_sentence": "種種衣服有種種香，無縷天衣其量相應。",
        "translation": "Various kinds of clothing have various kinds of fragrance, and threadless celestial clothing are the same in size.",
        "source": "T17n0721_044:0261b29_2"
    },
    {
        "source_sentence": "彼天如是生愛心故，不知厭足。",
        "translation": "Because they thus give rise to desire, those gods don't know how to tire of it.",
        "source": "T17n0721_044:0261c01_3"
    },
    {
        "source_sentence": "「『又復彼天若心意念，以自業故，一切所須具足皆得，則有第一可愛飲食。",
        "translation": "'Furthermore, if that god's mind is mindful, and because of his own actions, he obtains all the necessities, then he has the first desirable food and drink.",
        "source": "T17n0721_044:0261c03_0"
    },
    {
        "source_sentence": "天上地中有須陀食。",
        "translation": "In the heavenly realm, there's the food of stream entry.",
        "source": "T17n0721_044:0261c04_1"
    },
    {
        "source_sentence": "以本施時有下中上，須陀亦爾有下中上。",
        "translation": "Because at the moment of the original giving, there is what is inferior, middle and excessive. The stream-winner also has what is inferior, middle and excessive.",
        "source": "T17n0721_044:0261c05_2"
    },
    {
        "source_sentence": "又復具有種種天飲有下中上。",
        "translation": "It also has various kinds of celestial drinks, which are inferior, middling, and superior.",
        "source": "T17n0721_044:0261c07_0"
    },
    {
        "source_sentence": "業如是故，自業如印。",
        "translation": "Because karma is like this, self-karma is like a mudrā.",
        "source": "T17n0721_044:0261c07_1"
    },
    {
        "source_sentence": "猶如人中，人身長短隨日所在，影亦如是長短似身。",
        "translation": "It's like when a person's body is long and short, following the location of the sun, and their shadow is likewise long and short resembling his body.",
        "source": "T17n0721_044:0261c08_2"
    },
    {
        "source_sentence": "如是如是，彼天本於人中之時，作如是業，如是食生。",
        "translation": "Thus and so forth, when those gods were originally among humans, they did such-and-such actions, and such-and-such food arose.",
        "source": "T17n0721_044:0261c09_3"
    },
    {
        "source_sentence": "彼食食時，天女現前，則生羞恥。",
        "translation": "When they eat, the goddess appears before them, and then she becomes ashamed.",
        "source": "T17n0721_044:0261c10_4"
    },
    {
        "source_sentence": "如是天中見勝天女，大生苦惱。",
        "translation": "Thus, when they see superior celestial maidens in heaven, great suffering and distress arise.",
        "source": "T17n0721_044:0261c11_5"
    },
    {
        "source_sentence": "如是有中，一切無常，無有一樂不破壞者，現見一切有為皆爾，如是應知。",
        "translation": "Thus, all things are impermanent, and there's not a single happiness that isn't destroyed, and the present view that all conditioned things are like this should be known in this way.",
        "source": "T17n0721_044:0261c12_6"
    },
    {
        "source_sentence": "又復彼天本善業盡，退時生苦。",
        "translation": "Again, that god's original good actions ended, and pain arose when he retreated.",
        "source": "T17n0721_044:0261c13_7"
    },
    {
        "source_sentence": "若放逸天樂天欲樂，退時，愛離膩潤盡時，欲向餘道，則有相現。",
        "translation": "When one falls away from the pleasures of the gods and enjoys the pleasures of the gods, and when one becomes dispassionate and free of greed, and when one wishes to go to another path, then there are characteristics that appear.",
        "source": "T17n0721_044:0261c14_8"
    },
    {
        "source_sentence": "以欲退故，身心大苦，若大苦生。",
        "translation": "Because of falling back from the one of sexual passion, great frustration is produced in body and mind.",
        "source": "T17n0721_044:0261c15_9"
    },
    {
        "source_sentence": "彼苦如是不可譬喻。",
        "translation": "Their suffering is thus unfathomable.",
        "source": "T17n0721_044:0261c16_10"
    },
    {
        "source_sentence": "「『「種種放逸樂，　　為境界所誑，",
        "translation": "'A variety of kinds of careless pleasure are seen in the objective realm,",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　食欲盡退時，　　無與同伴者。",
        "translation": "When he's about to finish eating and retreat, there's no companion with him.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　天前放逸行，　　不行布施等，",
        "translation": "acts of carelessness in front of gods, not practicing generosity and so forth",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　於後死退時，　　悔熱自燒心。",
        "translation": "When he later dies and retreated, his mind is burned by the heat of remorse.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　初中後等時，　　心常作利益，",
        "translation": "At the beginning, middle, end, and so forth, The mind always acts to benefit.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　利益常調者，　　死時不怯怖。",
        "translation": "Beneficent and always tempered, he won't be frightened when he dies.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　有生必有死，　　亦有愛別離，",
        "translation": "If there is birth, there must be death. There is also separation from desire.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　愚者不思惟，　　為境界所誑。",
        "translation": "A foolish man doesn't contemplate, and he's deceived by the objective realm.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　死次第念念，　　境界破壞天，",
        "translation": "Every moment of thought in succession after death, the objective realm destroys the gods.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　來至天不覺，　　以欲著意故。",
        "translation": "They come to the gods and don't awaken because they're addicted to desire.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　若天能知此，　　生愛別離苦，",
        "translation": "If gods can know this, they’ll give rise to the pain of separation from loved ones.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　乃至須臾間，　　於欲心不住。",
        "translation": "Even for a moment, he doesn't stop at the mind of desire.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　欲無常可畏，　　常作不利益，",
        "translation": "Desire is impermanent and fearful, always doing unbeneficial things.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　如是愚癡者，　　而猶近於欲。",
        "translation": "Such a foolish man is still close to desire.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　癡天常如是，　　為欲火所燒，",
        "translation": "The gods of delusion are always like this, burned by the fire of desire.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　既被欲燒已，　　習欲不休息。",
        "translation": "Having been burned by the fire of desire, They do not cease their craving.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　若思念真諦，　　不喜樂境界；",
        "translation": "If one reflects on the true truth, One will not delight in objects of pleasure.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　若喜樂欲者，　　是則常啼哭。",
        "translation": "If someone delights in pleasure and desire, then they'll always weep and wail.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　此一切三界，　　轉行猶如輪，",
        "translation": "All of these three realms are like a wheel that turns.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　一切業羂縛，　　天不見其實。",
        "translation": "All the karmic bonds of anger are not really seen by gods.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　於種種道中，　　處處數生死，",
        "translation": "In all kinds of paths, Everywhere there are births and deaths,",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　眾生為愛迷，　　常受諸苦惱。",
        "translation": "Sentient beings are deluded by craving, always suffering pain and suffering.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　欲如電火輪，　　暫住不可得，",
        "translation": "Desire is like the wheel of lightning and fire, Which can’t be found even for a short time.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　如夢乾闥婆，　　眾生虛妄取。",
        "translation": "It's like a dream of a gandharva, where sentient beings falsely grasp it.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　欲如如是等，　　畏欲復勝是，",
        "translation": "Desire is thus and so forth, and fear of desire is further superior.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　無常苦空中，　　勿生我所心。",
        "translation": "In the midst of impermanent suffering, do not give rise to thoughts of self.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　此之老死輪，　　極惡叵調伏，",
        "translation": "This wheel of old age and death is extremely evil and uncontrollable.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　譬無救眾生，　　無眼不覺知。",
        "translation": "It's like the absence of salvation for sentient beings who lack eyes and don't perceive it.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　牟尼說五根，　　空而無自體，",
        "translation": "The Muni teaches that the five faculties are empty but have no essence.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　多有無常苦，　　自體是病處。",
        "translation": "Many suffer from impermanent suffering, Their essence being the locus of sickness.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　如是見知已，　　則應捨離欲；",
        "translation": "Having seen and known in this way, They should abandon desire.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　彼寂靜智慧，　　則近涅槃住。",
        "translation": "Their quiescence and wisdom are the proximate abode of nirvāṇa.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　彼欲退天者，　　根心皆動亂，",
        "translation": "Their faculties and minds of those who want to regress in the heavens are all disturbed.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　爾時苦受生，　　不可得譬喻。",
        "translation": "At that point, painful feelings arise, which can't be compared.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　如是受大樂，　　如是愛憎心，",
        "translation": "Thus they experience great bliss, thus their minds love and hate,",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　彼天欲退時，　　如是受大苦。",
        "translation": "When those gods want to retreat, they experience great suffering like this.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　諸有死未來，　　諸有離八難，",
        "translation": "All existences will die in the future, and all existences will be freed from the eight difficulties.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　皆應作利益，　　此道能得樂。",
        "translation": "They should all work for their benefit, and this path can attain happiness.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　天中地處退，　　人地中死亡，",
        "translation": "The gods withdrew in the heavens and earth, And died among humans.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "　　　何人如是知，　　不厭離生死。」",
        "translation": "Who would thus know that they aren't disillusioned with birth and death?",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "「『毘婆尸佛當爾之時，而說偈言：「『如是天中業盡退時，業繩繫縛，",
        "translation": "'It was then that Vipaśyin Buddha spoke these verses: Thus, when karma in heaven is exhausted and one regresses, the rope of karma binds him.",
        "source": "T17n0721_044:0261c17_11"
    },
    {
        "source_sentence": "牽令使退，將向餘處，生大怖畏。",
        "translation": "They led the messengers to retreat and were about to go to another place, where great fear arose.",
        "source": "T17n0721_044:0262a29_12"
    },
    {
        "source_sentence": "是故有天同如畜生。",
        "translation": "Therefore, there are gods that are the same as animals.",
        "source": "T17n0721_044:0262b01_13"
    },
    {
        "source_sentence": "若天心樂境界樂行，非自利益。",
        "translation": "If a god's mind is happy in the objective realm and enjoys pleasant actions, it's not for his own benefit.",
        "source": "T17n0721_044:0262b01_14"
    },
    {
        "source_sentence": "是故天眾勿放逸行，莫於後時，心生悔熱。』",
        "translation": "Therefore, gods and goddesses, don't act carelessly; don't give rise to regret and fever in your mind at later times.'",
        "source": "T17n0721_044:0262b02_15"
    },
    {
        "source_sentence": "「夜摩天王牟修樓陀如是為彼山樹具足地處行天，毘婆尸佛所作佛塔。",
        "translation": "Thus is the Buddha's stūpa built by the king of the Yama gods, Mucilinda, for the sake of those mountain trees that are replete with earth and heavenly deities like Vipaśyin Buddha.",
        "source": "T17n0721_044:0262b03_16"
    },
    {
        "source_sentence": "見彼塔已，調伏天眾，為作利益，示欲過患。",
        "translation": "Seeing that stūpa, he subdued the gods for their benefit and showed them the faults and dangers of desire.",
        "source": "T17n0721_044:0262b05_17"
    },
    {
        "source_sentence": "為顛倒天四顛倒者說於正法，死未來間，則示其死與其怖畏。",
        "translation": "He teaches the right teaching for the four mistaken gods, and when they die in the future, he shows them death and fear.",
        "source": "T17n0721_044:0262b06_18"
    },
    {
        "source_sentence": "彼死畏處，無量苦處，示平等道，以寂靜心作他利益，調伏天眾。",
        "translation": "They show the path of equanimity, with a tranquil mind for the benefit of others, and tame the celestial beings.",
        "source": "T17n0721_044:0262b07_19"
    },
    {
        "source_sentence": "於六經中毘婆尸佛所作經文，第二已竟。",
        "translation": "In the six sutras, the second part of the sūtra composed by Vipaśyin Buddha has been completed.",
        "source": "T17n0721_044:0262b08_20"
    },
    {
        "source_sentence": "「又彼天主牟修樓陀夜摩天王共彼天眾山樹具足地處來者，有修心者、不修心者，",
        "translation": "“Furthermore, that celestial ruler Mucilinda the king of gods and those heavenly kings come together with the mountains, trees, and ground-containing objects of enlightenment. Some cultivate their minds, while others don’t.",
        "source": "T17n0721_044:0262b09_21"
    },
    {
        "source_sentence": "皆攝取之。",
        "translation": "They'll all be collected.",
        "source": "T17n0721_044:0262b11_22"
    },
    {
        "source_sentence": "精勤修習利益他行，除其放逸，諦見業果，令心柔軟；",
        "translation": "They diligently cultivate practice for the benefit of others, getting rid of heedlessness and laxity. They see with certainty the results of their deeds, enabling their minds to be flexible.",
        "source": "T17n0721_044:0262b11_23"
    },
    {
        "source_sentence": "心柔軟故，生大信心；",
        "translation": "Because their minds are gentle and receptive, they engender great faith.",
        "source": "T17n0721_044:0262b13_24"
    },
    {
        "source_sentence": "信心生已，示其欲過；",
        "translation": "When faith arises, they show their desires and faults.",
        "source": "T17n0721_044:0262b13_25"
    },
    {
        "source_sentence": "示欲過已，說命無常；",
        "translation": "They show that after the transgression of desire, life is said to be impermanent.",
        "source": "T17n0721_044:0262b14_26"
    },
    {
        "source_sentence": "說無常已，說生死苦。",
        "translation": "After speaking of impermanence, he speaks of the suffering of birth-and-death.",
        "source": "T17n0721_044:0262b14_27"
    },
    {
        "source_sentence": "「彼天聞已，心則柔軟，心柔軟故，天王告言：『汝等天眾一切皆看此大佛塔迦迦村陀如來之塔，",
        "translation": "Having heard these words, the gods’ minds become soft and gentle because their minds are supple. The king of gods then said: All of you gods, please see this great buddha- stupa built by the Tathāgata Kassapa in the assembly hall.",
        "source": "T17n0721_044:0262b15_28"
    },
    {
        "source_sentence": "應、正遍知、明行足、善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，",
        "translation": "“Furthermore, it should be known that the Tathāgata has perfect knowledge of all things; he is sufficient in knowledge and conduct; he is a Well-gone One; he understands the world; he is the unsurpassed one; he tames men; he is the teacher of gods and humans; he is the Buddha; he is the Bhagavat.",
        "source": "T17n0721_044:0262b17_29"
    },
    {
        "source_sentence": "妙寶佛塔光明遍滿，金珠拘欄如穿虛空，高出於上，一切皆見甚可愛樂，",
        "translation": "A ray of light pervaded the buddha-tathāgata’s stupa of marvelous jewels. The golden pearls were draped like space, rising high above it. All saw this very pleasingly.",
        "source": "T17n0721_044:0262b18_30"
    },
    {
        "source_sentence": "第一清淨，一切天眾見者心樂。",
        "translation": "The first is pure, which is the mental bliss of all the gods who see it.",
        "source": "T17n0721_044:0262b20_31"
    },
    {
        "source_sentence": "此諸天中，高出如幢，堅牢不動，猶如禪住，種種善寶光明勝妙，如正法說，",
        "translation": "These heavens are as high as a banner, firm and unmoving, like meditation abodes. The light of various good jewels is supremely beautiful, just as the true teaching explains:",
        "source": "T17n0721_044:0262b21_32"
    },
    {
        "source_sentence": "第一可愛。』",
        "translation": "The first is desirable.'",
        "source": "T17n0721_044:0262b22_33"
    },
    {
        "source_sentence": "天如是見。",
        "translation": "The gods thus see it.",
        "source": "T17n0721_044:0262b23_0"
    },
    {
        "source_sentence": "『汝等天眾共我相隨，往彼塔所供養禮拜，或以香塗散花供養。",
        "translation": "'You gods and goddesses, joined by me, go to that stūpa to make offerings and venerate it, or offer incense, paint, spread flowers, and scatter them as offerings.",
        "source": "T17n0721_044:0262b23_1"
    },
    {
        "source_sentence": "此大仙塔有何希有？",
        "translation": "What's rare about this great sage's stūpa?",
        "source": "T17n0721_044:0262b24_2"
    },
    {
        "source_sentence": "今共往看。",
        "translation": "Now, we'll go together to see it.",
        "source": "T17n0721_044:0262b25_3"
    },
    {
        "source_sentence": "若我利益，乃至涅槃，或身或命皆得安樂。",
        "translation": "Whether it's for the benefit of self or even nirvāṇa, either body or life will all attain well-being.",
        "source": "T17n0721_044:0262b25_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T17n0721_044:0262b26_5"
    },
    {
        "source_sentence": "如來世尊雖少說法，則能利益安樂眾生。",
        "translation": "Although the Tathāgata Bhagavān teaches little, he's able to benefit and comfort sentient beings.",
        "source": "T17n0721_044:0262b26_6"
    },
    {
        "source_sentence": "一切眾生必得利益，則無有疑。",
        "translation": "All sentient beings will surely attain benefit, so there's no doubt.",
        "source": "T17n0721_044:0262b27_7"
    },
    {
        "source_sentence": "我等今者為自利益，皆共往去。』",
        "translation": "Now, for our own benefit, we'll all go and leave together.'",
        "source": "T17n0721_044:0262b28_8"
    },
    {
        "source_sentence": "「爾時，天眾既聞天王如是語已，心皆清淨，信天王語，白天王言：『我等皆去供養禮拜，",
        "translation": "Having heard these words of the celestial king, the gods became pure in mind and believed what he said. The lord of the gods said to them:",
        "source": "T17n0721_044:0262b28_9"
    },
    {
        "source_sentence": "為自利益，為自安樂。』",
        "translation": "It's for your own benefit and for your own peace and comfort.'",
        "source": "T17n0721_044:0262c01_10"
    },
    {
        "source_sentence": "「爾時，如是山樹具足地處諸天，天王在前，天眾在後，向世尊塔，皆共往到。",
        "translation": "“At the time, these mountains and trees were so numerous that they filled the ground with heavenly beings, the king of gods in front and the gods behind them all went to the World-honored One’s stupa together.",
        "source": "T17n0721_044:0262c02_11"
    },
    {
        "source_sentence": "到已則見迦迦村陀如來之塔，生敬重心禮拜供養，周匝旋遶。",
        "translation": "When they arrived, they saw the stupa of the Tathāgata Kassapa Monastery. They reverently venerated it and offered offerings to it, circumambulating it all around.",
        "source": "T17n0721_044:0262c03_12"
    },
    {
        "source_sentence": "「爾時塔中眾寶光明，形日光明如螢火虫。",
        "translation": "At the time, all the treasures in the stūpa were shining brightly, resembling the sunlight of a firefly.",
        "source": "T17n0721_044:0262c06_0"
    },
    {
        "source_sentence": "彼寶光明勝妙如是。",
        "translation": "The light of that jewel is as brilliant and sublime as this.",
        "source": "T17n0721_044:0262c06_1"
    },
    {
        "source_sentence": "彼佛塔中見垂寶板，第一光明，板有經字，是天神通之所為作，是故不失、不破不壞、不可拭滅。",
        "translation": "In the Buddha’s stupa a jeweled plank was seen hanging down. The first ray of light, with the words sūtra and jing written on it, was created by heavenly supernatural powers; that is why it did not perish, does not break up, does not disintegrate, cannot be swept away.",
        "source": "T17n0721_044:0262c07_2"
    },
    {
        "source_sentence": "何故不失？",
        "translation": "Why is it not lost?",
        "source": "T17n0721_044:0262c09_3"
    },
    {
        "source_sentence": "迦迦村陀牟尼如來以為利益諸天人故，說此經典，於天人中如是說法。",
        "translation": "Because the Tathāgata Kassapamuni taught this sūtra for the benefit of gods and humans, he thus taught it to gods and humans.",
        "source": "T17n0721_044:0262c09_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T17n0721_044:0262c11_5"
    },
    {
        "source_sentence": "天中乃是人之善道，人中乃是天之善道。",
        "translation": "Among gods, it's the good path of humans, and among humans, it's the good path of gods.",
        "source": "T17n0721_044:0262c11_6"
    },
    {
        "source_sentence": "天退之時，悕人善道；",
        "translation": "When the gods withdrew, they pity humans on the good path.",
        "source": "T17n0721_044:0262c12_7"
    },
    {
        "source_sentence": "人死之時，悕天善道。",
        "translation": "When a human being dies, he ascends to the good path of heaven.",
        "source": "T17n0721_044:0262c13_0"
    },
    {
        "source_sentence": "如是天、人迭為善道，天之與人迭相愛樂。",
        "translation": "Thus, gods and humans are each on a good path, and gods and humans enjoy each other's happiness.",
        "source": "T17n0721_044:0262c13_1"
    },
    {
        "source_sentence": "『持戒不壞則生天中。",
        "translation": "'If observing precepts doesn't break down, they'll be born in heaven.",
        "source": "T17n0721_044:0262c14_2"
    },
    {
        "source_sentence": "持五戒者，則有二種。",
        "translation": "For someone who observes the five precepts, there are two kinds.",
        "source": "T17n0721_044:0262c14_3"
    },
    {
        "source_sentence": "彼持戒者，以愚癡故，生而不熟。",
        "translation": "Those who observe precepts are born and don't mature because of foolishness.",
        "source": "T17n0721_044:0262c15_4"
    },
    {
        "source_sentence": "唯癡者作，雖癡而信，以心信故，信於佛等，修行身善、口善、意善，",
        "translation": "The only one who is deluded does so. Although deluded, he believes in it. Because of his faith in the Buddha, he believes in such [teachings] as those of the Buddha and practices what is wholesome in body, speech, and thought.",
        "source": "T17n0721_044:0262c16_5"
    },
    {
        "source_sentence": "非是邪見。",
        "translation": "It's not a mistaken view.",
        "source": "T17n0721_044:0262c17_6"
    },
    {
        "source_sentence": "乃至命盡，信業果報，依法得物以自存活，不惱他人，敬重父母、供養父母，",
        "translation": "Even at the end of life, they believe in the results of their actions and rely on the law to obtain things for their livelihood. They do not harm others, honoring their parents and supporting their offerings.",
        "source": "T17n0721_044:0262c17_7"
    },
    {
        "source_sentence": "親近沙門、若婆羅門，恒聞正法。",
        "translation": "Being intimate with ascetics and priests, they'll always hear the right teaching.",
        "source": "T17n0721_044:0262c19_8"
    },
    {
        "source_sentence": "如是癡人，唯信相應。",
        "translation": "Such a deluded person is only associated with faith.",
        "source": "T17n0721_044:0262c20_9"
    },
    {
        "source_sentence": "彼雖癡鈍，具足修行身口意等相應善業，自性如是，不受禁戒。",
        "translation": "Even though they are ignorant and dull, they fully cultivate good actions associated with body, speech, mind, etc., which are accompanied by such [things] as bodily or verbal action. Their specific nature is like this: they do not accept the precepts.",
        "source": "T17n0721_044:0262c20_10"
    },
    {
        "source_sentence": "如是之人身壞命終生於善道天世界處，終心善故，得生天中。",
        "translation": "Such a person's body breaks up and his life ends, and he's born in the heavenly realm of the good path gods at the end of his life, and because his mind is good, he's born in the heavens.",
        "source": "T17n0721_044:0262c22_0"
    },
    {
        "source_sentence": "若得生於夜摩天處，劣於餘天身色形服及莊嚴具，諸天女眾、若行、若食一切皆劣，",
        "translation": "If they were to be born in the realm of Yama gods, they'd be inferior to the other goddesses in terms of body, form, clothing, and adornments, and all the goddesses would be inferior whether they walk or eat.",
        "source": "T17n0721_044:0262c23_1"
    },
    {
        "source_sentence": "則生羞慚。",
        "translation": "Then he becomes ashamed.",
        "source": "T17n0721_044:0262c25_2"
    },
    {
        "source_sentence": "光明亦少，一切欲事具足皆劣。",
        "translation": "It also has little light and is not endowed with all its desires.",
        "source": "T17n0721_044:0262c25_3"
    },
    {
        "source_sentence": "彼無智故，不知取戒，於有戒天有智慧者、知取戒者，則為減劣。",
        "translation": "Because of their lack of knowledge, they don't know the adherence to precepts, and those who have wisdom in the gods with precepts and know the adherents of precepts will become inferior.",
        "source": "T17n0721_044:0262c26_4"
    },
    {
        "source_sentence": "「『又彼癡故，不知取戒而修戒行，於佛等中生清淨信，乃至不能取一日戒，",
        "translation": "'Furthermore, because of their delusion, they don't know the precepts and cultivate them without observing them. They give rise to pure faith in buddhas and so forth, even to the point where they can't observe the precepts for a single day.",
        "source": "T17n0721_044:0262c28_0"
    },
    {
        "source_sentence": "身行善行、口行善行、意行善行，身口意中不能具足一切修行。",
        "translation": "Good conduct of body, good conduct of speech, and good conduct of mind can't be fully cultivated in body, speech, or thought.",
        "source": "T17n0721_044:0262c29_1"
    },
    {
        "source_sentence": "身善行者，謂不殺生及不邪行，不行偷盜，此是不能一切修行。",
        "translation": "Good bodily conduct means not taking life, not engaging in wrongful acts, not stealing, and not being unable to practice all of these.",
        "source": "T17n0721_044:0263a02_2"
    },
    {
        "source_sentence": "口行善行，唯不妄語，口之餘垢，一切不避。",
        "translation": "The only thing he does is not speak falsely. All the other impurities in his mouth are not avoided.",
        "source": "T17n0721_044:0263a03_3"
    },
    {
        "source_sentence": "如是唯行一分善行，不能具足一切善行。",
        "translation": "In this way, only one part of the wholesome conduct is practised: it cannot be supplied with all wholesome conduct.",
        "source": "T17n0721_044:0263a04_4"
    },
    {
        "source_sentence": "若意善行，唯信命盡或有餘業，或時唯信。",
        "translation": "In the case of mental good conduct, there is only faith at the end of life and sometimes with other actions; sometimes only faith.",
        "source": "T17n0721_044:0263a05_5"
    },
    {
        "source_sentence": "生夜摩天於次前者，轉更劣減，於餘修行受戒、持戒具足之天，形量身色、勝莊嚴具、若食若行、若天女眾、壽命長短、聲觸色香一切皆劣。",
        "translation": "The Yama gods who are born before them become even weaker, and the other gods who cultivate precepts and observe the full set of precepts lose their shape, body size, form, superior adornments, food and behavior, goddesses, longevity, sound, touch, form, odor, and taste.",
        "source": "T17n0721_044:0263a06_6"
    },
    {
        "source_sentence": "自見劣故，極生羞恥，慚於餘天受持戒者。",
        "translation": "Because he sees himself inferior, he becomes extremely embarrassed and ashamed to accept the precepts in other gods.",
        "source": "T17n0721_044:0263a09_7"
    },
    {
        "source_sentence": "「『復有愚癡不知取戒、持戒相應。",
        "translation": "'Furthermore, there's folly that doesn't know the associated with taking precepts and observing precepts.",
        "source": "T17n0721_044:0263a11_0"
    },
    {
        "source_sentence": "唯心正見，得聞佛法，敬信三寶佛、法、眾僧，乃至不取一日之戒。",
        "translation": "They only have right view of mind and hear the Buddha's teaching, respectfully believe in the Three Treasures, the Buddha, Dharma, and Saṃgha, and don't accept the precepts for a single day.",
        "source": "T17n0721_044:0263a11_1"
    },
    {
        "source_sentence": "聞持戒來或於知識教示聞來，或於所畏生忌難故，不作偷盜。",
        "translation": "When they hear someone who comes to observe the precepts, or when they're taught by a friend and shown to come, or when fear arises from fear, they don't steal.",
        "source": "T17n0721_044:0263a13_2"
    },
    {
        "source_sentence": "次第聞來，若聞佛說：「以餘業故，貧窮而生。」",
        "translation": "If they hear the Buddha say, It's because of other actions that they'll be born poor.",
        "source": "T17n0721_044:0263a14_3"
    },
    {
        "source_sentence": "如是之人畏現在世、畏未來世，故不偷盜。",
        "translation": "Such people fear the present and fear the future, so they won't steal.",
        "source": "T17n0721_044:0263a15_4"
    },
    {
        "source_sentence": "口中不說破壞之語，不迭相破，於破壞者令使和合，愛善業故。",
        "translation": "He doesn't speak harsh words in his mouth, doesn't repeatedly break each other, and causes those who break it to harmonize because he loves good actions.",
        "source": "T17n0721_044:0263a16_5"
    },
    {
        "source_sentence": "或時傳聞佛所說語：「彼破壞語餘業緣故，親舊知識、妻子奴婢一切破壞。",
        "translation": "Sometimes he heard the Buddha teach that, It's because they disrupt speech and other karmic conditions that their relatives, friends, wives, servants, and maidservants all disrupt it.",
        "source": "T17n0721_044:0263a17_6"
    },
    {
        "source_sentence": "以是業因，身壞命終墮於惡道，生地獄中。」",
        "translation": "Because of these karmic causes, they'll fall into a bad destiny at the end of their life and be born in hell.",
        "source": "T17n0721_044:0263a19_7"
    },
    {
        "source_sentence": "如是之人二種因緣故不兩舌。",
        "translation": "Such a person doesn't have two kinds of causes and conditions that make them not speak dually.",
        "source": "T17n0721_044:0263a20_8"
    },
    {
        "source_sentence": "彼人以是業因緣故，身壞命終，心有信故、或餘業故或生業故、信福田故，",
        "translation": "Because of these karmic causes and conditions, that person' s body breaks up at the end of life because their mind has faith. It may be because of other actions or because of karma that it gives rise to action.",
        "source": "T17n0721_044:0263a21_9"
    },
    {
        "source_sentence": "生夜摩天。",
        "translation": "He'll be born in the Yama Heaven.",
        "source": "T17n0721_044:0263a22_10"
    },
    {
        "source_sentence": "量色形相一切劣減，天女眾劣，若處處行、飲食等劣，聲觸亦劣，味色香命一切皆劣，",
        "translation": "The goddesses are inferior in all respects. If their movement, food and drink, etc., were inferior, sound and touch would be inferior, and taste, form, odor, and vitality would all be inferior.",
        "source": "T17n0721_044:0263a23_11"
    },
    {
        "source_sentence": "光明亦劣。",
        "translation": "The light is also inferior.",
        "source": "T17n0721_044:0263a25_12"
    },
    {
        "source_sentence": "於他天所，則生羞恥。",
        "translation": "In the presence of other gods, they'll become ashamed.",
        "source": "T17n0721_044:0263a25_13"
    },
    {
        "source_sentence": "如是放逸，不取戒故，如是三種，各生天中而有優劣。",
        "translation": "Thus, because they are careless and don't adhere to precepts, these three kinds of people are each born in the heavens, with superiority and inferiority.",
        "source": "T17n0721_044:0263a25_14"
    },
    {
        "source_sentence": "唯信佛故，或如是思——功德勝故，或時本性如是勝故，或以心體柔軟勝故，",
        "translation": "It's because of faith in the Buddha alone, or it's because of this kind of thought-because of superiority in merit, or sometimes by such superiority in their original nature, or because they're superior because of the superiority of the mind's body and flesh.",
        "source": "T17n0721_044:0263a27_15"
    },
    {
        "source_sentence": "或正見勝、深心信勝，不諂不曲、不熱惱他如是勝故；",
        "translation": "Sometimes right view is superior and deep-minded faith is superior: because of such superiority not being flattering or crooked, not tormenting others.",
        "source": "T17n0721_044:0263a28_16"
    },
    {
        "source_sentence": "供養父母，生敬重心如是勝故，或願勝故。",
        "translation": "It's because they make offerings to their parents and give rise to a respectful mind that's superior like this, or it's because they want to be superior.",
        "source": "T17n0721_044:0263a29_17"
    },
    {
        "source_sentence": "彼人如是如業之心，恒常相續，於福田中深心勢力，意思功德有下中上。",
        "translation": "That person's mind is thus like the mind of karma, which is constantly and continuously continuous, has profound mental momentum in the field of merit, and the power of thought has inferior, middling, and superior qualities.",
        "source": "T17n0721_044:0263b01_18"
    },
    {
        "source_sentence": "如是勝業，上生天中，業相似果決定受得，終不虛妄。",
        "translation": "Such superior karma is definitely experienced as the result of karma in the heavens above, and it's never false.",
        "source": "T17n0721_044:0263b03_19"
    },
    {
        "source_sentence": "不疑不得，如是定得。",
        "translation": "They don't doubt that they won't attain it, and thus they'll surely attain it.",
        "source": "T17n0721_044:0263b04_20"
    },
    {
        "source_sentence": "何況取戒，乃至涅槃，決定必得，終無虛妄。",
        "translation": "How much more so when they take the precepts and even attain nirvāṇa, which will surely be attained without falsehood in the end.",
        "source": "T17n0721_044:0263b05_21"
    },
    {
        "source_sentence": "「『幾種取戒？",
        "translation": "'How many kinds of taking the precepts?",
        "source": "T17n0721_044:0263b07_0"
    },
    {
        "source_sentence": "略而言之，四眾眷屬，四種受戒，彼皆攝果。",
        "translation": "Briefly, these are the four kinds of dependents and the four kinds of precepts that are received, which all include the fruit.",
        "source": "T17n0721_044:0263b07_1"
    },
    {
        "source_sentence": "何等為四？",
        "translation": "What are these four?",
        "source": "T17n0721_044:0263b08_2"
    },
    {
        "source_sentence": "所謂比丘、諸比丘尼、諸優婆塞、諸優婆夷，四眾受戒。",
        "translation": "It's called the four groups of monks, bhikṣus, bhikṣuṇīs, laymen, and laywomen who receive the precepts.",
        "source": "T17n0721_044:0263b08_3"
    },
    {
        "source_sentence": "彼如是人，可有幾種別別受戒？",
        "translation": "How many ways can such a person receive the precepts separately?",
        "source": "T17n0721_044:0263b09_4"
    },
    {
        "source_sentence": "「『彼優婆塞略有四種，何等四種？",
        "translation": "'In brief, there are four kinds of laymen. What are the four?",
        "source": "T17n0721_044:0263b10_5"
    },
    {
        "source_sentence": "一、一分行；",
        "translation": "The first is partial practice.",
        "source": "T17n0721_044:0263b11_0"
    },
    {
        "source_sentence": "二、半分行；",
        "translation": "The second is the practice of one-half a verse.",
        "source": "T17n0721_044:0263b11_1"
    },
    {
        "source_sentence": "三、數數行；",
        "translation": "The third is the practice of repeated repetition.",
        "source": "T17n0721_044:0263b11_2"
    },
    {
        "source_sentence": "四、一切行。",
        "translation": "4. all practices.",
        "source": "T17n0721_044:0263b11_3"
    },
    {
        "source_sentence": "一分行者，唯持一戒。",
        "translation": "A partial practitioner observes only one precept.",
        "source": "T17n0721_044:0263b11_4"
    },
    {
        "source_sentence": "半分行者，謂取三戒，行於三戒。",
        "translation": "Half-practicing means taking the three precepts and practicing the three precepts.",
        "source": "T17n0721_044:0263b12_5"
    },
    {
        "source_sentence": "數數行者，不常受戒。",
        "translation": "Those who practice repeatedly don't always receive the precepts.",
        "source": "T17n0721_044:0263b13_6"
    },
    {
        "source_sentence": "一切行者，受持五戒。",
        "translation": "All practitioners observe the five precepts.",
        "source": "T17n0721_044:0263b13_7"
    },
    {
        "source_sentence": "「『又復更有四種持戒，何等為四？",
        "translation": "'Furthermore, there are another four kinds of observance of precepts. What are they?",
        "source": "T17n0721_044:0263b15_0"
    },
    {
        "source_sentence": "一、希持戒；",
        "translation": "The first is that they wish to keep the precepts.",
        "source": "T17n0721_044:0263b15_1"
    },
    {
        "source_sentence": "二、半持戒；",
        "translation": "The second is half- observance of the precepts.",
        "source": "T17n0721_044:0263b15_2"
    },
    {
        "source_sentence": "三、悔持戒；",
        "translation": "The third is to repent and keep the precepts.",
        "source": "T17n0721_044:0263b16_3"
    },
    {
        "source_sentence": "四、合持戒。",
        "translation": "4. the combined observance of precepts.",
        "source": "T17n0721_044:0263b16_4"
    },
    {
        "source_sentence": "彼優婆塞於學句海次第漸取，初取三歸作優婆塞。",
        "translation": "That layman gradually grasps the ocean of words of training in order, and the first takes the three refuges to become a layman.",
        "source": "T17n0721_044:0263b16_5"
    },
    {
        "source_sentence": "彼人修心，復於久時善觀察已，取一學句，於彼學句堅持不缺、不穿、不孔。",
        "translation": "After cultivating his mind for a long time, that person then observes it well and takes one phrase of training, insisting on the words of training that aren't missing, penetrating, or porous.",
        "source": "T17n0721_044:0263b17_6"
    },
    {
        "source_sentence": "「『何者不缺？",
        "translation": "'What's not missing?",
        "source": "T17n0721_044:0263b20_0"
    },
    {
        "source_sentence": "何者不穿？",
        "translation": "Which one doesn't penetrate?",
        "source": "T17n0721_044:0263b20_1"
    },
    {
        "source_sentence": "何者不孔？",
        "translation": "What's not a hole?",
        "source": "T17n0721_044:0263b20_2"
    },
    {
        "source_sentence": "彼不缺者，乃至命盡，受持不捨，不起一念破戒之心，於他作者，心不隨喜，",
        "translation": "When they don’t lack it, up to the end of their life, they retain and don’t abandon it, don’t give rise to a single thought that breaks the precepts, and don’t delight in other authors.",
        "source": "T17n0721_044:0263b20_3"
    },
    {
        "source_sentence": "遮他人作或令他人安住法中，故名不缺。",
        "translation": "It's called not deficient because it obscures the actions of others or causes others to abide in the Dharma.",
        "source": "T17n0721_044:0263b22_4"
    },
    {
        "source_sentence": "彼不穿者，如彼所受一學句戒，乃於後時捨彼學句，次於後時復更攝取，",
        "translation": "Those who don't penetrate are like the precept against accepting one phrase of training, which they abandon at a later time that phrase of training and then take it up again at a later time.",
        "source": "T17n0721_044:0263b23_5"
    },
    {
        "source_sentence": "數捨數取，如是名穿。",
        "translation": "To repeatedly abandon and repeatedly grasp is thus called penetration.",
        "source": "T17n0721_044:0263b24_6"
    },
    {
        "source_sentence": "彼人如是學句不穿，離如是持。",
        "translation": "That person thus trains in words that don't penetrate, parts with such-and-such support.",
        "source": "T17n0721_044:0263b25_7"
    },
    {
        "source_sentence": "「『何者不孔？",
        "translation": "'What's not a hole?",
        "source": "T17n0721_044:0263b27_0"
    },
    {
        "source_sentence": "云何為孔？",
        "translation": "What is Kong?",
        "source": "T17n0721_044:0263b27_1"
    },
    {
        "source_sentence": "於此學句，初清淨心，知識邊取。",
        "translation": "Regarding these phrases of training, the first is to purify the mind and take them from the side of knowledge.",
        "source": "T17n0721_044:0263b27_2"
    },
    {
        "source_sentence": "取已後時，其心則悔，不能護持，心生疑惑。",
        "translation": "After they take it, their minds become remorseful and unable to guard it, and doubt and confusion arise in their minds.",
        "source": "T17n0721_044:0263b28_3"
    },
    {
        "source_sentence": "彼疑牽心，心濁而行，非多思行。",
        "translation": "They doubt and lead the mind, but their minds are turbid and they do not often think and act.",
        "source": "T17n0721_044:0263b29_4"
    },
    {
        "source_sentence": "彼人後時悔火所燒，如是燒已，則捨學句；",
        "translation": "At some point later, that person repents of being burned by the fire. Having been burned in this way, he then abandons the sentence on training.",
        "source": "T17n0721_044:0263b29_5"
    },
    {
        "source_sentence": "如是捨已，更不復取，此名為孔。",
        "translation": "After abandoning it in this way, he doesn't take it again, which is called Kong.",
        "source": "T17n0721_044:0263c01_6"
    },
    {
        "source_sentence": "若人不作如是住者，則名不孔。",
        "translation": "If someone doesn't thus abide, then they're called not obstructed.",
        "source": "T17n0721_044:0263c02_7"
    },
    {
        "source_sentence": "「『又彼希行優婆塞者，住於缺、穿、孔學句戒。",
        "translation": "'Furthermore, those laymen who wish to practice should abide in the precepts that are missing, penetrating, and Kong training in phrases.",
        "source": "T17n0721_044:0263c04_0"
    },
    {
        "source_sentence": "云何為缺？",
        "translation": "What's lacking?",
        "source": "T17n0721_044:0263c04_1"
    },
    {
        "source_sentence": "此心不滅、不破不壞，善心生已，則取學句，如芭蕉葉、如電相似。",
        "translation": "When this mind doesn't cease, doesn't break down, and doesn't disintegrate, and when a good mind arises, then he takes the words of training, which are like plantain leaves and lightning.",
        "source": "T17n0721_044:0263c05_2"
    },
    {
        "source_sentence": "如是動心歡喜取戒，信心敬重，後時復聞外道法已，心則生悔，癡垢濁心，",
        "translation": "Having thus moved his mind, he joyfully accepted the precepts with faith and reverence. Later, having heard the teaching of heretics, his mind becomes remorseful and his mind is stained by the stain of delusion.",
        "source": "T17n0721_044:0263c06_3"
    },
    {
        "source_sentence": "是故捨戒。",
        "translation": "That's why they abandon the precepts.",
        "source": "T17n0721_044:0263c08_4"
    },
    {
        "source_sentence": "復於後時，聞正法已，還復攝取，此名為缺。",
        "translation": "At a later time, after hearing the right teaching, they'll again take it in. This is called a deficiency.",
        "source": "T17n0721_044:0263c08_5"
    },
    {
        "source_sentence": "又復缺者，此優婆塞疑於學句，如是持戒，有供養天，憶念正法，作如是心：「我於今者，",
        "translation": "Again, if there is a deficiency, this layman doubts the words of his training and thus observes the precepts. Some offering heavenly beings, remembering the right teaching, think:",
        "source": "T17n0721_044:0263c10_0"
    },
    {
        "source_sentence": "為於佛語而得清淨，為於天所而得恩力？」",
        "translation": "In order to attain purity in the words of the Buddha and attain kindness in heavenly places?",
        "source": "T17n0721_044:0263c11_1"
    },
    {
        "source_sentence": "如是心故，二皆供養。",
        "translation": "Because of this mind, they both make offerings.",
        "source": "T17n0721_044:0263c12_2"
    },
    {
        "source_sentence": "如是疑心，依法持戒，此名為穿。",
        "translation": "Such a doubtful mind that observes the precepts according to the Dharma is called penetrating.",
        "source": "T17n0721_044:0263c13_3"
    },
    {
        "source_sentence": "又復孔者，內心有孔，外則善行，為他見故、為供養故，受持學句，此名為孔。",
        "translation": "Again, Kong means that there's a hole inside the mind and a hole outside the mind that practices well. For the sake of seeing others and for the sake of making offerings, it's called Kong when he receives and upholds the words of training.",
        "source": "T17n0721_044:0263c14_4"
    },
    {
        "source_sentence": "智者如是，一切皆捨。",
        "translation": "So it is with the wise one, who abandons everything.",
        "source": "T17n0721_044:0263c15_5"
    },
    {
        "source_sentence": "「『希持戒行優婆塞者，云何名為希持戒行優婆塞耶？",
        "translation": "「『希持戒行優婆塞者者希持戒行優婆塞者,何名為希持戒行優婆塞?",
        "source": "T17n0721_044:0263c16_6"
    },
    {
        "source_sentence": "此優婆塞取一學句，於多時中爾乃復取餘之學句，如是次第，非是一時，",
        "translation": "This layman takes one statement of training, and at many moments he takes the other statements of training. In this order, it is not a single time:",
        "source": "T17n0721_044:0263c17_7"
    },
    {
        "source_sentence": "不生一心、不從一師，如是久時希取學句。",
        "translation": "They don't give rise to one mind and don't follow one teacher, and thus for a long time they yearn for the words of training.",
        "source": "T17n0721_044:0263c19_8"
    },
    {
        "source_sentence": "此則名為希行學句優婆塞也。",
        "translation": "This is called a layman who wishes to practice and study the phrase upāsaka.",
        "source": "T17n0721_044:0263c20_9"
    },
    {
        "source_sentence": "「『又復第二半優婆塞。",
        "translation": "'Furthermore, the second and a half Upāsaka.",
        "source": "T17n0721_044:0263c21_0"
    },
    {
        "source_sentence": "半半取行或取二已，然後取三；",
        "translation": "They grasp one-half as an aspect; sometimes they grasp two. Then they grasp three.",
        "source": "T17n0721_044:0263c21_1"
    },
    {
        "source_sentence": "或取三已，然後取二；",
        "translation": "Some grasp three, and then they grasp two.",
        "source": "T17n0721_044:0263c22_2"
    },
    {
        "source_sentence": "或於後時爾乃取三；",
        "translation": "Or they may take three at a later time.",
        "source": "T17n0721_044:0263c22_3"
    },
    {
        "source_sentence": "或於久時方乃取二。",
        "translation": "Perhaps it's only after a long time that they take two.",
        "source": "T17n0721_044:0263c23_4"
    },
    {
        "source_sentence": "此名半行。",
        "translation": "This is called the half-line.",
        "source": "T17n0721_044:0263c23_5"
    },
    {
        "source_sentence": "於半半中，下增而行，增下而行。",
        "translation": "In the midst of a half-hour, it goes downward and increases while going upward; it goes downward and increases.",
        "source": "T17n0721_044:0263c23_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T17n0721_044:0263c24_7"
    },
    {
        "source_sentence": "半半學句并合而取。",
        "translation": "Half a dozen or so phrases of training are combined and taken together.",
        "source": "T17n0721_044:0263c24_8"
    },
    {
        "source_sentence": "如是合行而受持者，此名第二半半合行優婆塞也。",
        "translation": "Such a person who combines practice and receives and upholds it in this way is called the second and a half-combined practice layman.",
        "source": "T17n0721_044:0263c25_9"
    },
    {
        "source_sentence": "「『云何第三悔優婆塞？",
        "translation": "'What's the third repentance, Upāsaka?",
        "source": "T17n0721_044:0263c27_0"
    },
    {
        "source_sentence": "前不取戒，唯癡心故，但於佛等生深信心。",
        "translation": "In the past, they didn't adhere to precepts because they were only deluded, but they simply gave rise to deep faith in buddhas and so forth.",
        "source": "T17n0721_044:0263c27_1"
    },
    {
        "source_sentence": "彼優婆塞，或比丘所聞持戒果，功德無量，乃至涅槃。",
        "translation": "That layman or monk hears the fruit of observing precepts, and his merit is immeasurable until he attains nirvāṇa.",
        "source": "T17n0721_044:0263c28_2"
    },
    {
        "source_sentence": "既得聞已，悔火燒心，方生敬重，乃至命盡持戒不捨。",
        "translation": "Having heard it, he repents of his burning mind and becomes respectful until the end of his life and observes the precepts without abandoning them.",
        "source": "T17n0721_044:0263c29_3"
    },
    {
        "source_sentence": "此名第三悔優婆塞。",
        "translation": "This is called the third repentance, Upāsaka.",
        "source": "T17n0721_044:0264a01_4"
    },
    {
        "source_sentence": "「『又復第四合優婆塞。",
        "translation": "'Furthermore, the fourth combines Upāsaka and Upāsaka.",
        "source": "T17n0721_044:0264a03_0"
    },
    {
        "source_sentence": "彼持戒行一切具足。",
        "translation": "They observe precepts and conduct themselves completely.",
        "source": "T17n0721_044:0264a03_1"
    },
    {
        "source_sentence": "云何名為合持戒行優婆塞耶？",
        "translation": "What's called a layman who observes the precepts together?",
        "source": "T17n0721_044:0264a03_2"
    },
    {
        "source_sentence": "此優婆塞聞正法已，則得正法。",
        "translation": "After hearing the right teaching, this layman attains the right teaching.",
        "source": "T17n0721_044:0264a04_3"
    },
    {
        "source_sentence": "句句處處於經經中十二因緣，十二因緣以知如是十二因法，心中生念，",
        "translation": "The twelve causes and conditions that are found in all the expressions of the scriptures, and these twelve causes and conditions enable one to know these twelve causal factors.",
        "source": "T17n0721_044:0264a05_4"
    },
    {
        "source_sentence": "如是信已，唯以舌根一切持戒，攝取滿足。",
        "translation": "Having thus believed, he simply takes in and fulfills all the precepts with the tongue faculty as his only means of maintaining them.",
        "source": "T17n0721_044:0264a07_5"
    },
    {
        "source_sentence": "於一時中攝取五戒，堅持不缺、不穿、不孔，乃至命盡，常如是持，四優婆塞，",
        "translation": "At one time, he takes in the five precepts, adheres to them without fail, without penetration, without obstruction, up to the end of his life, and always keeps them in this way.",
        "source": "T17n0721_044:0264a08_6"
    },
    {
        "source_sentence": "如前所說。",
        "translation": "It's as explained above.",
        "source": "T17n0721_044:0264a09_7"
    },
    {
        "source_sentence": "「『又下、中、上如是次第一切中勝，具持五戒，於一切中最下劣者，",
        "translation": "'Furthermore, the inferior, middling, and superior are thus ranked in order among all the middle and superior, upholding the five precepts, which are the lowest of all.",
        "source": "T17n0721_044:0264a10_0"
    },
    {
        "source_sentence": "謂希持戒。",
        "translation": "It's the desire to observe precepts.",
        "source": "T17n0721_044:0264a11_1"
    },
    {
        "source_sentence": "最下持戒優婆塞者，唯一念中攝取持戒，天則不及，天魔王等悉皆不及。",
        "translation": "The lowest upāsaka who observes precepts takes in the observance of precepts with a single thought, but gods don't, and gods, Māra, kings, and so forth all don't.",
        "source": "T17n0721_044:0264a11_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T17n0721_044:0264a13_3"
    },
    {
        "source_sentence": "涅槃城法能攝取故。",
        "translation": "It's because the city of nirvāṇa is able to gather in dharmas.",
        "source": "T17n0721_044:0264a13_4"
    },
    {
        "source_sentence": "此一切天於涅槃城不悕不求。",
        "translation": "All these gods are in the city of nirvāṇa, neither angry nor seeking.",
        "source": "T17n0721_044:0264a14_0"
    },
    {
        "source_sentence": "「『彼地夜叉見持戒者，供養禮拜。",
        "translation": "'When the yakṣas of that land see someone who observes precepts, they make offerings and venerate them.",
        "source": "T17n0721_044:0264a15_0"
    },
    {
        "source_sentence": "虛空夜叉如是見已，供養禮拜。",
        "translation": "After thus seeing it, the space yakṣa makes offerings and venerates it.",
        "source": "T17n0721_044:0264a15_1"
    },
    {
        "source_sentence": "以如是人隨順法行，能報恩故、能調順故。",
        "translation": "It's because such a person who follows the practice of the Dharma can repay kindness and be disciplined.",
        "source": "T17n0721_044:0264a16_2"
    },
    {
        "source_sentence": "如是夜叉或向天說，如是之人得現世果，若王大臣或土田主而供養之，",
        "translation": "Thus, the yakṣa may teach it to gods, and such a person will attain its fruit in the present life. If kings, ministers, or landowners make offerings to them,",
        "source": "T17n0721_044:0264a17_3"
    },
    {
        "source_sentence": "或施財物，隨後行天，神通增長，有大勢力。",
        "translation": "Or they may give their possessions to the gods who subsequently travel through heaven, where their supernormal powers grow and have great strength.",
        "source": "T17n0721_044:0264a19_4"
    },
    {
        "source_sentence": "諸非法行惡夜叉等不能惱亂、不能破壞。",
        "translation": "The bad yakṣas and so forth who don't practice what's unlawful can't disturb or break it.",
        "source": "T17n0721_044:0264a20_5"
    },
    {
        "source_sentence": "隨心所須，種種意念皆得具足，稱情受樂，諸所作業皆悉成就，不多病患，",
        "translation": "Whatever their minds need, they’ll be supplied with all kinds of thoughts and feelings, praised and delighted. All their tasks will be accomplished, and there won’t be many illnesses.",
        "source": "T17n0721_044:0264a21_0"
    },
    {
        "source_sentence": "面色清淨，睡眠安隱，覺時喜樂。",
        "translation": "His countenance was pure and his sleep peaceful, and when he awoke he was delighted.",
        "source": "T17n0721_044:0264a22_1"
    },
    {
        "source_sentence": "妻子奴婢及餘客等，攝取不離。",
        "translation": "Their wives, servants, maidservants, and other guests are collected without separation.",
        "source": "T17n0721_044:0264a23_2"
    },
    {
        "source_sentence": "身壞命終生於善道，在彼天中量色形相一切皆勝。",
        "translation": "When the body breaks up and their life ends, they'll be born in a good path, which is superior in terms of form and shape to all the other gods.",
        "source": "T17n0721_044:0264a24_3"
    },
    {
        "source_sentence": "持戒勝故，如是勝生。",
        "translation": "Because adherence to precepts is superior, such superiority arises.",
        "source": "T17n0721_044:0264a25_4"
    },
    {
        "source_sentence": "如是業力，以持戒故，得是大果。",
        "translation": "Thus, the power of karma is such that it's because they observe precepts that they attain this great fruit.",
        "source": "T17n0721_044:0264a25_5"
    },
    {
        "source_sentence": "本人中時所集善業，夜摩天中放逸行故，一切皆盡。",
        "translation": "Good actions that are collected by the self at the time, because they're carelessly practiced in the Yama heavens, will all be exhausted.",
        "source": "T17n0721_044:0264a26_6"
    },
    {
        "source_sentence": "眾生之心業網縛故。",
        "translation": "It's because the minds of sentient beings are bound by the web of karma.",
        "source": "T17n0721_044:0264a27_7"
    },
    {
        "source_sentence": "復於後時，墮於地獄、餓鬼、畜生。",
        "translation": "At a later time, they'll fall into hell, hungry ghosts, and animals.",
        "source": "T17n0721_044:0264a28_8"
    },
    {
        "source_sentence": "是故皆應勤行精進，乃至未得聖印以來，如是精進。",
        "translation": "Therefore, they should all diligently practice exertion, such exertion since they haven't yet attained the noble seal.",
        "source": "T17n0721_044:0264a28_9"
    },
    {
        "source_sentence": "若心自在放逸而行，彼天退時心則生悔，墮於地獄、餓鬼、畜生，善業盡故。",
        "translation": "If the mind is self-willed and acts in a careless way, then when those gods retreat, their minds become remorseful and fall into hell, hungry ghosts, or animals because their good actions are ended.",
        "source": "T17n0721_044:0264b01_10"
    },
    {
        "source_sentence": "是以應當捨離放逸。",
        "translation": "Therefore, you should abandon carelessness.",
        "source": "T17n0721_044:0264b02_11"
    },
    {
        "source_sentence": "如是第四善優婆塞得現生樂，若能次第不斷精進，則到涅槃。",
        "translation": "Thus, this fourth good layman attains the bliss of present birth, and if he can continue to make effort in order, then he'll attain nirvāṇa.",
        "source": "T17n0721_044:0264b03_12"
    },
    {
        "source_sentence": "如是一種，是優婆塞，佛之眷屬。",
        "translation": "Thus, this is a type of layman who's a follower of the Buddha.",
        "source": "T17n0721_044:0264b04_13"
    },
    {
        "source_sentence": "「『次復云何是優婆夷，佛之眷屬？",
        "translation": "'Furthermore, what's this Upāsikā who's a follower of the Buddha?",
        "source": "T17n0721_044:0264b05_14"
    },
    {
        "source_sentence": "凡有幾種佛優婆夷？",
        "translation": "How many kinds of buddha-upāsikā are there?",
        "source": "T17n0721_044:0264b06_15"
    },
    {
        "source_sentence": "優婆夷者則有四種：一是有信；",
        "translation": "Upāsikā is of four kinds:",
        "source": "T17n0721_044:0264b06_16"
    },
    {
        "source_sentence": "二是種姓隨順次第；",
        "translation": "The second is the succession of seed natures.",
        "source": "T17n0721_044:0264b07_17"
    },
    {
        "source_sentence": "三、調伏行；",
        "translation": "The third is the practice of discipline.",
        "source": "T17n0721_044:0264b07_18"
    },
    {
        "source_sentence": "四、近住行。",
        "translation": "4. proximate abiding and practice.",
        "source": "T17n0721_044:0264b08_0"
    },
    {
        "source_sentence": "言有信者，彼優婆夷種姓熏心，其心柔軟，善修其心。",
        "translation": "When someone says there's faith, their mind is perfumed by the Upāsikā's castes, and their mind is flexible and well cultivated.",
        "source": "T17n0721_044:0264b08_1"
    },
    {
        "source_sentence": "彼優婆夷少聞佛語，聞已能知，知已得味，味已則入，謂入法律。",
        "translation": "That Upāsikā had only heard the Buddha’s words for a short time. Having heard them, he was able to recognize them and, having known them, tasted them. Having tasted them, he then entered [the buddha-dharma]: this is called entering the Dharma.",
        "source": "T17n0721_044:0264b09_2"
    },
    {
        "source_sentence": "彼優婆夷住善心已，然後受戒。",
        "translation": "After that layman abides in a good mind, he then receives the precepts.",
        "source": "T17n0721_044:0264b10_3"
    },
    {
        "source_sentence": "婦女之心不能拘執，聞外道語，心則不受，不捨佛法，乃至不與外道共語。",
        "translation": "The woman's mind can't cling to it, and when she hears the words of non-Buddhists, her mind doesn't accept them, doesn't abandon the Buddha's teaching, and doesn't speak with non-Buddhists.",
        "source": "T17n0721_044:0264b11_4"
    },
    {
        "source_sentence": "唯於佛等生清淨心，具受五戒。",
        "translation": "Only the buddhas and so forth give rise to a pure mind that fully receives the five precepts.",
        "source": "T17n0721_044:0264b13_5"
    },
    {
        "source_sentence": "此名有信優婆夷也。",
        "translation": "This is called a faithful Upāsikā.",
        "source": "T17n0721_044:0264b13_6"
    },
    {
        "source_sentence": "「『云何種姓隨順次第優婆夷耶？",
        "translation": "'What's the seed-nature that follows the order of Upāsikā?",
        "source": "T17n0721_044:0264b14_7"
    },
    {
        "source_sentence": "種姓賢善隨順法行，入法信法——法救法歸、法性法堅，不行惡業，他道論師不能破壞。",
        "translation": "Good people of good families who practice the Dharma and follow it well, enter the Dharma and believe in the Dharma - the Dharma saves the Dharma as refuge, the Dharma nature is resolute, doesn't do bad actions, and can't be destroyed by other teachers of the path.",
        "source": "T17n0721_044:0264b15_8"
    },
    {
        "source_sentence": "常優婆塞種姓中生，於佛等中極生信心。",
        "translation": "They're always born among laymen and laymen, and they give rise to great faith in buddhas and so forth.",
        "source": "T17n0721_044:0264b16_9"
    },
    {
        "source_sentence": "彼種姓中若生於女，彼女則能隨順次第，自從生來常聞佛語，供養沙門。",
        "translation": "If a woman of that family gives birth to a woman, she's able to follow them in order, always hear the Buddha's words from birth and make offerings to the ascetic.",
        "source": "T17n0721_044:0264b17_10"
    },
    {
        "source_sentence": "此優婆夷恒常聞義。",
        "translation": "This Upāsikā always hears the meaning.",
        "source": "T17n0721_044:0264b19_11"
    },
    {
        "source_sentence": "此優婆夷常一切時相續熏心，受戒持戒。",
        "translation": "This Upāsikā always continuously perfumes his mind at all times and receives the precepts and observes them.",
        "source": "T17n0721_044:0264b20_12"
    },
    {
        "source_sentence": "此是種姓隨順次第優婆夷也。",
        "translation": "This is a layman who follows the order of seeds.",
        "source": "T17n0721_044:0264b21_13"
    },
    {
        "source_sentence": "「『彼調伏行優婆夷者，謂本不信佛法僧等，彼若得近善知識故信於佛等。",
        "translation": "'That disciplined practitioner Upāsikā means someone who doesn't believe in the Buddha, Dharma, and Saṃgha in the past but believes in the Buddha and so forth because they've gotten close to a good teacher.",
        "source": "T17n0721_044:0264b22_0"
    },
    {
        "source_sentence": "近他因緣，他令使信，見他功德持戒具足，數數取戒。",
        "translation": "He approaches other causes and conditions, causes others to believe in him, sees the merits of others, observes precepts that are complete, and repeatedly takes the precepts.",
        "source": "T17n0721_044:0264b23_1"
    },
    {
        "source_sentence": "彼優婆夷則名調伏。",
        "translation": "That Upāsikā is called a disciplined one.",
        "source": "T17n0721_044:0264b24_2"
    },
    {
        "source_sentence": "「『彼近住行優婆夷者。",
        "translation": "'That's a Upāsikā who lives nearby and practices.",
        "source": "T17n0721_044:0264b25_3"
    },
    {
        "source_sentence": "若有女人常近外道，知外道法，見其威儀。",
        "translation": "Suppose there's a woman who always approaches non-Buddhists, knows the teachings of non-Buddhists, and sees their manner.",
        "source": "T17n0721_044:0264b25_4"
    },
    {
        "source_sentence": "知威儀已，爾乃後時近佛弟子沙門之所，見其威儀，從其聞法，形相行食舉動進止，",
        "translation": "Knowing his manner, he then approached the Buddha’s disciples and śramaṇas. Seeing their manner, they listened to the Dharma preached by him in terms of form, characteristics, deportment, food, gestures, movement, and so on.",
        "source": "T17n0721_044:0264b26_5"
    },
    {
        "source_sentence": "身著袈裟，去來寂靜。",
        "translation": "He put on his monastic robes and passed away in peace.",
        "source": "T17n0721_044:0264b28_6"
    },
    {
        "source_sentence": "如是見已，然後次第棄捨外道，信於佛等。",
        "translation": "After seeing it this way, they then gradually abandon the non-Buddhist teachings and believe in the Buddha.",
        "source": "T17n0721_044:0264b29_7"
    },
    {
        "source_sentence": "以相近故，是以調順，從其受戒，名近住行優婆夷也。",
        "translation": "Because of their proximity, they are disciplined and receive the precepts from them, which is called a layman who lives nearby.",
        "source": "T17n0721_044:0264c01_8"
    },
    {
        "source_sentence": "「『如是四種優婆夷眾，如是四種優婆塞眾，略說如是。",
        "translation": "'Such are the four kinds of congregations of laymen, and so are the four kinds of congregations of laymen, which are briefly described as such.",
        "source": "T17n0721_044:0264c03_0"
    },
    {
        "source_sentence": "有信解故、心相續故、他因緣故、次第近故，如前所說優婆塞眾所有因緣，",
        "translation": "Because of having faith and understanding, because of the successiveness of thought, because of other causes and conditions and because of being successively proximate. As has been said previously:",
        "source": "T17n0721_044:0264c04_1"
    },
    {
        "source_sentence": "優婆夷眾亦皆如是入於法律。",
        "translation": "The upāsikā also entered the Dharma in this way.",
        "source": "T17n0721_044:0264c05_2"
    },
    {
        "source_sentence": "如優婆夷所有因緣，優婆塞眾亦如是入。",
        "translation": "Just as there are causes and conditions for Upāsikā, so do the Upāsaka enter in this way.",
        "source": "T17n0721_044:0264c06_3"
    },
    {
        "source_sentence": "心相續故，優婆塞眾、優婆夷眾雜行不別一切善攝，正見正行。",
        "translation": "Because the mind is continuous, the mixed practices of laymen and laywomen are not separate from all goodness that's included in right view and right practice.",
        "source": "T17n0721_044:0264c07_4"
    },
    {
        "source_sentence": "彼心皆有下中上故，身壞命終皆悉生於善道天中。",
        "translation": "Because their minds are all inferior, middling, and superior, they're all born in the good destiny heaven when their bodies break up and their lives end.",
        "source": "T17n0721_044:0264c08_5"
    },
    {
        "source_sentence": "彼有生於夜摩天者，如所集戒，正行不同，如是生於餘天之中。",
        "translation": "Those who are born in Yama Heaven are like the precepts collected, but their correct practice is different, and they're thus born among other gods.",
        "source": "T17n0721_044:0264c10_6"
    },
    {
        "source_sentence": "以善持戒，和集相應，得生天已，放逸而行，不勤精進。",
        "translation": "Because of well-maintained precepts associated with harmonious accumulation, they'll be born in heaven and then practice carelessly without exerting effort.",
        "source": "T17n0721_044:0264c11_7"
    },
    {
        "source_sentence": "諸未得聖皆福業盡，復生地獄、餓鬼、畜生。",
        "translation": "All the noble ones who haven't yet attained it will be born again in hell, hungry ghosts, or animals when their meritorious actions have ended.",
        "source": "T17n0721_044:0264c12_8"
    },
    {
        "source_sentence": "福德盡故，放逸過故。",
        "translation": "Because of the exhaustion of virtue and because of the fault of heedlessness.",
        "source": "T17n0721_044:0264c13_9"
    },
    {
        "source_sentence": "若其有天不放逸行，彼則到於樂中樂處，彼以持戒善修行故。",
        "translation": "If there are gods who don't practice carelessly, they'll go to a pleasant place of pleasure because they observe precepts and skillfully cultivate them.",
        "source": "T17n0721_044:0264c14_10"
    },
    {
        "source_sentence": "是故不應起放逸心，此放逸者，如毒不異。",
        "translation": "Therefore, you shouldn't give rise to a mind of carelessness, which is like poison that isn't different.",
        "source": "T17n0721_044:0264c15_11"
    },
    {
        "source_sentence": "一切世間愚癡凡夫為貪所誑，而行一切不饒益行，一切生死繫縛不離。",
        "translation": "All the world's foolish mortals are deceived by craving and engage in all kinds of unbeneficial actions, and all the fetters of birth-and-death don't part from them.",
        "source": "T17n0721_044:0264c16_12"
    },
    {
        "source_sentence": "是故天人應捨放逸。",
        "translation": "Therefore, gods and humans should abandon carelessness.",
        "source": "T17n0721_044:0264c18_13"
    },
    {
        "source_sentence": "若天、若人如是持戒，故得生於第一好處。",
        "translation": "If gods and humans thus observe precepts, they'll attain the first benefit.",
        "source": "T17n0721_044:0264c18_14"
    },
    {
        "source_sentence": "放逸過故，福德則盡。",
        "translation": "Because of the fault of carelessness, their merits are exhausted.",
        "source": "T17n0721_044:0264c19_15"
    },
    {
        "source_sentence": "彼如是人自誑太甚，或墮惡道，或長久時流轉生死。』",
        "translation": "Such a person is self-indulgent and too great, or they may fall into a bad path or go through birth and death for a long time.'",
        "source": "T17n0721_044:0264c20_0"
    },
    {
        "source_sentence": "「牟修樓陀夜摩天王如是善心，示其天眾，彼佛塔中板上經字，作如是言：『彼佛世尊憐愍眾生，",
        "translation": "“Thus did the lord of the gods Mucilinda and Yama show their heavenly hosts such good intentions, saying these words of the scripture on a board in the Buddha’s stupa: O Bhagavat!",
        "source": "T17n0721_044:0264c21_1"
    },
    {
        "source_sentence": "利益天故，神通所化。』",
        "translation": "It's because they benefit the gods and are transformed by their supernormal powers.'",
        "source": "T17n0721_044:0264c23_2"
    },
    {
        "source_sentence": "彼天聞已，第一勝心，厭離生死，捨放逸行，如毒不異。",
        "translation": "After hearing this, that god's first superior mind becomes disillusioned with birth-and-death and abandons careless behavior like poison without differing.",
        "source": "T17n0721_044:0264c23_3"
    },
    {
        "source_sentence": "此優婆塞及優婆夷眷屬已說。",
        "translation": "These upāsaka and the Upāsikā's retinues have already explained this.",
        "source": "T17n0721_044:0264c25_4"
    },
    {
        "source_sentence": "正法念處經卷第四十四",
        "translation": "Sutra of the Mindfulness of the True Dharma, Volume 44",
        "source": "T17n0721_044:0264c26_0"
    }
]