[
    {
        "source_sentence": "正法念處經卷第六十六",
        "translation": "Sutra of the Mindfulness of the True Dharma, Volume 66",
        "source": "T17n0721_066:0390a02_0"
    },
    {
        "source_sentence": "元魏婆羅門瞿曇般若流支譯",
        "translation": "Yuan Wei translation of the Prajñāpāramitā-prajñāruci by the Brāhmaṇa Gautama",
        "source": "T17n0721_066:0390a04_0"
    },
    {
        "source_sentence": "身念處品之三",
        "translation": "The Third Part of the Chapter on the Mindfulness of the Body",
        "source": "T17n0721_066:0390a05_0"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0390a06_0"
    },
    {
        "source_sentence": "有何等風住我身中，或作安隱或不安隱？",
        "translation": "What kind of wind abides in my body, whether it makes me feel at ease or not?",
        "source": "T17n0721_066:0390a06_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見乾糞風：若我多食，風則不調，能令苦惱，入於身分筋脈之中，",
        "translation": "With the wisdom of hearing or with divine vision, they see dry excrement and wind: If I eat a lot, the wind won’t be able to regulate it. It can cause suffering and distress, entering into the tendons and veins of my body.",
        "source": "T17n0721_066:0390a07_2"
    },
    {
        "source_sentence": "令糞乾燥，或二日、三日、四日、五日，乃一便利乾燥少穢而甚苦痛。",
        "translation": "On the second, third, fourth, or fifth days it dries up and becomes a little dirty but very painful.",
        "source": "T17n0721_066:0390a09_3"
    },
    {
        "source_sentence": "若風調順，則無此病。",
        "translation": "If the wind is tempered, there will be no such illness.",
        "source": "T17n0721_066:0390a11_4"
    },
    {
        "source_sentence": "觀乾糞風已，如實知身。",
        "translation": "After observing the wind of dry dung, he knows his body as it really is.",
        "source": "T17n0721_066:0390a11_5"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0390a13_0"
    },
    {
        "source_sentence": "有何等風住我身中，或為安隱或不安隱？",
        "translation": "What kind of wind abides in my body, whether it's peaceful or not?",
        "source": "T17n0721_066:0390a13_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見兩傍風若不調順，為何所作？",
        "translation": "If they see both sides of the wind with the wisdom of hearing or with the divine eye, and if they don't follow it, what will they do?",
        "source": "T17n0721_066:0390a14_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：兩傍風行於身側，血則乾燥，以血乾燥，受大痛苦。",
        "translation": "With the wisdom of hearing, or with the divine eye, they may see that two sides of the wind travel to the side of their bodies, and their blood dries up, and because their blood drys up, they experience great pain.",
        "source": "T17n0721_066:0390a15_3"
    },
    {
        "source_sentence": "若風調順，則無此病。",
        "translation": "If the wind is tempered, there will be no such illness.",
        "source": "T17n0721_066:0390a17_4"
    },
    {
        "source_sentence": "觀兩傍風已，如實知身。",
        "translation": "After observing the wind at both sides, he knows his body as it really is.",
        "source": "T17n0721_066:0390a18_5"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0390a19_0"
    },
    {
        "source_sentence": "有何等風住我身中，或作安隱或不安隱？",
        "translation": "What kind of wind abides in my body, whether it makes me feel at ease or not?",
        "source": "T17n0721_066:0390a19_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼觀何等風住我身中，作何等業？",
        "translation": "What kind of wind does he observe with the wisdom of hearing or with the divine eye, what kind of wind abides in my body, and what kind of action does he do?",
        "source": "T17n0721_066:0390a20_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼觀見：有風名塞九孔，住在身中，若不調適，能令九孔閉塞不通——頭有七孔及大小便——九孔既塞，",
        "translation": "He observes with the wisdom of hearing or with the divine eye: There is a wind called ‘obstruction’ that abides in the body for nine holes. If it is uncontrolled, it can cause nine holes to be shut off and not accessible - there are seven holes at the top of the head and excreting and urinating- when these nine holes are shu",
        "source": "T17n0721_066:0390a21_3"
    },
    {
        "source_sentence": "身則病苦，入息出息不得安隱。",
        "translation": "The body is sick and painful, and when it inhales or exhales, it can't be comfortable.",
        "source": "T17n0721_066:0390a24_4"
    },
    {
        "source_sentence": "若風調順，令身安隱，乃能行法，以風持故，身得去來。",
        "translation": "If the wind is gentle and peaceful, they are able to practice the Dharma. Because the wind sustains them, their bodies can come and go.",
        "source": "T17n0721_066:0390a25_5"
    },
    {
        "source_sentence": "觀九孔風已，如實知身。",
        "translation": "After observing the nine pores of the wind, he knows his body as it really is.",
        "source": "T17n0721_066:0390a26_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0390a27_0"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見何等風住我身中，作何等業？",
        "translation": "What kind of wind does they see with the wisdom of hearing or with the divine eye, what kind of wind abides in my body, and what kind of action does it do?",
        "source": "T17n0721_066:0390a27_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風名斷身分，若不調順，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see a certain wind that's called stopping their identity. If they aren't disciplined, what will they do?",
        "source": "T17n0721_066:0390a28_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：斷身分風若不調不順，手指則癵，不得造作，手足皆癵，",
        "translation": "With the wisdom of hearing or with divine vision, they may see: If someone stops the wind in their body and doesn’t regulate it or doesn’t comply with it, their fingers will stand on end; they won’t be allowed to do anything, and their hands and feet will all stand on end.",
        "source": "T17n0721_066:0390b01_3"
    },
    {
        "source_sentence": "髀筋急痛，九麁筋脈弦弦而急，身分搖動，疲極無力。",
        "translation": "His thighs and tendons hurt heavily, and his nine calf muscles and veins are twisted and twitched in an acute way. His body trembles and he is overcome with exhaustion and powerlessness.",
        "source": "T17n0721_066:0390b03_4"
    },
    {
        "source_sentence": "斷身分風若調順者，則無如是所說諸病。",
        "translation": "If someone who stops the wind in their body and goes along with it, then there are no such-and-such described illnesses.",
        "source": "T17n0721_066:0390b04_5"
    },
    {
        "source_sentence": "觀斷身分風已，如實知身。",
        "translation": "After observing the wind that stops the body, he knows his body as it really is.",
        "source": "T17n0721_066:0390b05_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0390b06_0"
    },
    {
        "source_sentence": "有何等風住我身中，或作安隱或不安隱？",
        "translation": "What kind of wind abides in my body, whether it makes me feel at ease or not?",
        "source": "T17n0721_066:0390b06_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見內有風，名曰害火，住在身中，為何所作？",
        "translation": "With the wisdom of hearing or with divine vision, they see that there's wind inside their bodies called harming fire and abiding in their bodies, so what does it do?",
        "source": "T17n0721_066:0390b07_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：此風力能除火熱，令食不消，不消食故，不復憶食，",
        "translation": "With the wisdom of hearing or with divine vision they see: This power of wind is able to extinguish the heat of fire and prevent food from being digested. Because they do not digest food, they no longer remember it.",
        "source": "T17n0721_066:0390b09_3"
    },
    {
        "source_sentence": "不能食故，則無顏色。",
        "translation": "Because they can't eat, they lack color.",
        "source": "T17n0721_066:0390b10_4"
    },
    {
        "source_sentence": "何故無色？",
        "translation": "Why is it formless?",
        "source": "T17n0721_066:0390b11_5"
    },
    {
        "source_sentence": "血乾燥故。",
        "translation": "It's because the blood dries up.",
        "source": "T17n0721_066:0390b11_6"
    },
    {
        "source_sentence": "以血乾燥，肉則消盡，肉消盡故，筋則卷縮，不復生脂，不生脂故，骨亦乾燥，",
        "translation": "When the blood dries up, the flesh perishes; when the flesh perishes, the tendons contract and no fat is produced. Because no fat is produced, the bones also dry up.",
        "source": "T17n0721_066:0390b11_7"
    },
    {
        "source_sentence": "骨乾燥故，髓亦乾燥，髓乾燥故，遍身精盡。",
        "translation": "Because the bones are dry, the marrow is also dry, and because the marrow is dry, the semen pervading the body is exhausted.",
        "source": "T17n0721_066:0390b13_8"
    },
    {
        "source_sentence": "心中氣力，風吹故動。",
        "translation": "The mind is agitated by the power of energy, and it moves because the wind blows.",
        "source": "T17n0721_066:0390b14_9"
    },
    {
        "source_sentence": "若害火風調順安隱，則無如上所說病苦。",
        "translation": "If someone harms a fire or wind and is tamed and comfortable, then there won't be the illness and pain described above.",
        "source": "T17n0721_066:0390b14_10"
    },
    {
        "source_sentence": "觀害火風已，如實知身。",
        "translation": "After observing the harmful fire and wind, he knows his body as it really is.",
        "source": "T17n0721_066:0390b15_11"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0390b17_0"
    },
    {
        "source_sentence": "有何等風住我身中，作何等業？",
        "translation": "What kind of wind is there in my body and what kind of action does it do?",
        "source": "T17n0721_066:0390b17_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有風名作一切身分冷風，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see that there's a wind called cold wind for all bodies and what it does?",
        "source": "T17n0721_066:0390b18_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：一切身分冷風令身臭汗堅澁惡色，身體皺減，羸瘦毛竪，",
        "translation": "With the wisdom of hearing or with divine vision, they may see: All their bodies are cool and windy, causing them to smell bad odors, sweat, hardness, roughness, a bad color, less wrinkled, weak, thin hairs, and coarse flesh.",
        "source": "T17n0721_066:0390b19_3"
    },
    {
        "source_sentence": "身生黑瘡，膿出爛臭，搔爴汁流，或生赤瘡或大蒸熱；",
        "translation": "A black sores arose in their bodies, and the pus discharged with a foulsmelling odor. Some scratched abscesses and juice flowed out, some developing red sores, some very hot and scorching fever.",
        "source": "T17n0721_066:0390b21_4"
    },
    {
        "source_sentence": "或生白瘡，遍身麁大；",
        "translation": "Some develop white sores all over their bodies that are as large as the size of an abscess.",
        "source": "T17n0721_066:0390b22_5"
    },
    {
        "source_sentence": "或復其身如白象皮，麁澁生瘡；",
        "translation": "Again, some people’s bodies looked like white elephant skin covered with sores growing from abscesses.",
        "source": "T17n0721_066:0390b23_6"
    },
    {
        "source_sentence": "或復口齒希踈黧黑，手足生瘡，猶如工師，疲極頓乏，身生瘡癬，手足常熱，",
        "translation": "Again, if one’s mouth and teeth are rarely black in color and their hands and feet give rise to sores, it is as if a skilled artisan were exhausted and suddenly ill. Sores and scabies would appear on his body, and his hands and feet would always be hot.",
        "source": "T17n0721_066:0390b23_7"
    },
    {
        "source_sentence": "堅[革*卬]麁惡；",
        "translation": "It is hard, coarse, and evil.",
        "source": "T17n0721_066:0390b25_8"
    },
    {
        "source_sentence": "或生瘡爛，爪甲惡色，鼻柱萎倒，眼睫墮落；",
        "translation": "Or they may develop sores and blisters, bad complexions such as the color of their nails and armor, withered nose pillars, or eyelashes falling off.",
        "source": "T17n0721_066:0390b25_9"
    },
    {
        "source_sentence": "人所惡賤，一切施主之所惡見；",
        "translation": "They are badly esteemed by everyone and badly seen by all donors.",
        "source": "T17n0721_066:0390b26_10"
    },
    {
        "source_sentence": "眾蠅封著，爪甲墮落；",
        "translation": "The flock of flies clings to it, and their claws and armor fall off.",
        "source": "T17n0721_066:0390b27_11"
    },
    {
        "source_sentence": "若睡眠時，氣息惽濁，鼾睡大聲，不欲飲食或食不消，舌不得味。",
        "translation": "When he's asleep, his breath is coarse and muddy, the sound of snot and drowsiness is loud, and he doesn't want to eat or drink or eat or digest it, and his tongue doesn't taste it.",
        "source": "T17n0721_066:0390b28_12"
    },
    {
        "source_sentence": "如是一切身分冷風令身爛壞。",
        "translation": "Thus, all the bodies of sentient beings are cool and the wind causes their bodies to rot and disintegrate.",
        "source": "T17n0721_066:0390b29_13"
    },
    {
        "source_sentence": "若一切身分冷風調順，則顏色可愛，細軟滑澤，眾人所敬，暖汗津液出於毛孔，",
        "translation": "If all their bodies are cool and the wind is gentle, they’ll have pleasing features that are fine, soft, and slippery, respected by everyone. Their hair pores will be covered with warm sweat and moisture.",
        "source": "T17n0721_066:0390c01_14"
    },
    {
        "source_sentence": "則無如上所說諸病。",
        "translation": "Then there won't be the illnesses described above.",
        "source": "T17n0721_066:0390c03_15"
    },
    {
        "source_sentence": "觀一切身分冷風已，如實知身。",
        "translation": "After observing all the cold breezes in his body, he knows his body as it really is.",
        "source": "T17n0721_066:0390c03_16"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0390c05_0"
    },
    {
        "source_sentence": "有何等風住我身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in my body? Or is it tempered or not tempered? What kind of action does it do?",
        "source": "T17n0721_066:0390c05_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：有一風名破強健，住我身中，若不調順，令心怯怖，",
        "translation": "With the wisdom of hearing or with divine vision, they see: There is a wind called ‘breaking’ that abides strongly in my body. If I do not comply [with this wind], it will cause my mind to be fearful.",
        "source": "T17n0721_066:0390c06_2"
    },
    {
        "source_sentence": "一切身分皆悉苦痛，或身挺直，頻申不樂，出息入息悉不安隱，身體振掉，",
        "translation": "All their limbs are painful, and sometimes they’re straight and uncomfortable. Exhaling and inhaling all soundlessly, their bodies shake and tremble.",
        "source": "T17n0721_066:0390c08_3"
    },
    {
        "source_sentence": "不能衣服，苦患頭痛；",
        "translation": "They were unable to dress themselves and suffered from pain and headaches.",
        "source": "T17n0721_066:0390c10_4"
    },
    {
        "source_sentence": "若習禪觀，不得一心；",
        "translation": "Those who practice meditation and contemplation do not attain unity of mind.",
        "source": "T17n0721_066:0390c10_5"
    },
    {
        "source_sentence": "或見惡夢，心悶歐吐；",
        "translation": "Or they may see evil dreams and wail in distress.",
        "source": "T17n0721_066:0390c11_6"
    },
    {
        "source_sentence": "於好色中，生顛倒見，近見為遠，焦渴憔悴。",
        "translation": "In the midst of good appearance, they give rise to mistaken views that are viewed as distant and those that are viewed as near. They're burnt, hungry, and emaciated.",
        "source": "T17n0721_066:0390c11_7"
    },
    {
        "source_sentence": "若破健風調順和適，則無如上所說諸病。",
        "translation": "If he breaks down a strong wind and adjusts it, then there won't be the illnesses described above.",
        "source": "T17n0721_066:0390c12_8"
    },
    {
        "source_sentence": "觀破健風已，如實知身。",
        "translation": "After observing and destroying the strong wind, he knows his body as it really is.",
        "source": "T17n0721_066:0390c13_9"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0390c15_0"
    },
    {
        "source_sentence": "有何等風住我身中，作何等業？",
        "translation": "What kind of wind is there in my body and what kind of action does it do?",
        "source": "T17n0721_066:0390c15_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見身瞤風住我身中，或調不調，作何等業？",
        "translation": "With the wisdom of hearing, or with the divine eye, they see my body as a gust of wind that abides in my body, or whether it's regulated or unregulated, and what actions they do?",
        "source": "T17n0721_066:0390c16_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：身瞤風若不調適，耳中鳴喚，臂肉瞤動，一切身分皆亦瞤動，",
        "translation": "With the wisdom of hearing or with divine vision, they may see: Their bodies are rough and windy; if they aren’t adjusted, their ears sound and wail, their arms and flesh crude and shaken, and all their parts also crude and shake.",
        "source": "T17n0721_066:0390c17_3"
    },
    {
        "source_sentence": "處處逃走，不樂一處，更無餘病。",
        "translation": "Everywhere he fled, not enjoying a single place, and there was no other illness.",
        "source": "T17n0721_066:0390c19_4"
    },
    {
        "source_sentence": "若一切身瞤風調順，則無如上所說諸病。",
        "translation": "If all the bodies, abscesses, and wind were to be tamed, then there wouldn't be the illnesses described above.",
        "source": "T17n0721_066:0390c20_5"
    },
    {
        "source_sentence": "觀一切身瞤動風已，如實知身。",
        "translation": "After observing all the body's crude and moving winds, he knows his body as it really is.",
        "source": "T17n0721_066:0390c21_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0390c22_0"
    },
    {
        "source_sentence": "有何等風住我身中？",
        "translation": "What kind of wind abides in my body?",
        "source": "T17n0721_066:0390c22_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有熱風住我身中，或調不調，作何等業？",
        "translation": "With the wisdom of hearing, or with the divine eye, they see that there's a hot wind in my body, or it's regulated or unregulated, and what actions they do?",
        "source": "T17n0721_066:0390c23_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：此熱風若不調順，所食入口，咽之則燒，以是因緣，",
        "translation": "If this hot wind is uncontrolled, the food they eat enters their mouths and when they swallow it burns.",
        "source": "T17n0721_066:0390c24_3"
    },
    {
        "source_sentence": "四大不調，不得增長；",
        "translation": "When the four elements are not regulated, they cannot grow.",
        "source": "T17n0721_066:0390c26_4"
    },
    {
        "source_sentence": "或所食味不作二流，濁穢不淨。",
        "translation": "Or the taste of food that's eaten doesn't create two streams, which are defiled and impure.",
        "source": "T17n0721_066:0390c26_5"
    },
    {
        "source_sentence": "若有淨流，四大增長，唯有濁穢，則為病苦。",
        "translation": "If there are pure streams that grow with the four elements, but only dirt and filth, then it's sickness and suffering.",
        "source": "T17n0721_066:0390c27_6"
    },
    {
        "source_sentence": "若熱風不調，所食皆濁，不作清淨，是故得病。",
        "translation": "If a hot wind isn't regulated, everything he eats is turbid and doesn't become pure, which is why he gets sick.",
        "source": "T17n0721_066:0390c28_7"
    },
    {
        "source_sentence": "若熱風調順，若清、若濁二種食流四大平等，以平等故，則不為病。",
        "translation": "If the hot wind is tempered, and if the two kinds of food that are pure and turbid are fed by the four elements equally, then it won't be a disease because of equality.",
        "source": "T17n0721_066:0390c29_8"
    },
    {
        "source_sentence": "觀熱風已，如實知身。",
        "translation": "After observing the hot wind, he knows his body as it really is.",
        "source": "T17n0721_066:0391a01_9"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0391a03_0"
    },
    {
        "source_sentence": "有何等風住我身中，作何等業？",
        "translation": "What kind of wind is there in my body and what kind of action does it do?",
        "source": "T17n0721_066:0391a03_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：有一風名曰集蟲，此集蟲風遍身分中，能集能散，",
        "translation": "With the wisdom of hearing or with divine vision, they see: “There is a wind called ‘gathering insects’ that gathers worms. This wind of gathering insects pervades all parts of the body and can gather and disperse them.",
        "source": "T17n0721_066:0391a04_2"
    },
    {
        "source_sentence": "閉塞上下。",
        "translation": "It's shut and locked up above and below.",
        "source": "T17n0721_066:0391a06_0"
    },
    {
        "source_sentence": "從頂至足有十種蟲：一名頭行蟲；",
        "translation": "From the top to the feet there are ten kinds of worms:",
        "source": "T17n0721_066:0391a06_1"
    },
    {
        "source_sentence": "二名骨行蟲；",
        "translation": "The second is called the insect bone-follower.",
        "source": "T17n0721_066:0391a07_0"
    },
    {
        "source_sentence": "三名食髮蟲；",
        "translation": "The third is called the food-eating insect.",
        "source": "T17n0721_066:0391a07_1"
    },
    {
        "source_sentence": "四名耳行蟲；",
        "translation": "The fourth is called the auditory insect.",
        "source": "T17n0721_066:0391a07_2"
    },
    {
        "source_sentence": "五名鼻內蟲；",
        "translation": "The fifth is called the internal nose-mouth bug.",
        "source": "T17n0721_066:0391a07_3"
    },
    {
        "source_sentence": "六名脂內行蟲；",
        "translation": "The sixth is called the internally resident worm.",
        "source": "T17n0721_066:0391a08_4"
    },
    {
        "source_sentence": "七名節行蟲；",
        "translation": "The seventh is called the seasonal flying bug.",
        "source": "T17n0721_066:0391a08_5"
    },
    {
        "source_sentence": "八名食涎蟲；",
        "translation": "The eighth is called the worm that eats saliva.",
        "source": "T17n0721_066:0391a08_6"
    },
    {
        "source_sentence": "九名食齒根蟲；",
        "translation": "The ninth is called the worm feeding on the roots of teeth.",
        "source": "T17n0721_066:0391a09_7"
    },
    {
        "source_sentence": "十名歐吐蟲。",
        "translation": "Tenth, it's called the owl-mouthed bug.",
        "source": "T17n0721_066:0391a09_8"
    },
    {
        "source_sentence": "「復有十蟲在咽胸中：一名噉食蟲；",
        "translation": "Again, there were ten kinds of worms in their chests:",
        "source": "T17n0721_066:0391a10_0"
    },
    {
        "source_sentence": "二名食涎蟲；",
        "translation": "The second is called the worm that eats saliva.",
        "source": "T17n0721_066:0391a10_1"
    },
    {
        "source_sentence": "三名消唾蟲；",
        "translation": "The third is called the extinguishing spittle.",
        "source": "T17n0721_066:0391a11_2"
    },
    {
        "source_sentence": "四名歐吐蟲；",
        "translation": "The fourth is called the fruit-eating worm.",
        "source": "T17n0721_066:0391a11_3"
    },
    {
        "source_sentence": "五名十味流脈中行蟲；",
        "translation": "The fifth is called the worm of the ten flavors that move within the veins.",
        "source": "T17n0721_066:0391a11_4"
    },
    {
        "source_sentence": "六名甜醉蟲；",
        "translation": "The sixth is called the insect of sweet intoxication.",
        "source": "T17n0721_066:0391a12_5"
    },
    {
        "source_sentence": "七名嗜味蟲；",
        "translation": "The seventh is called the taste-eating bug.",
        "source": "T17n0721_066:0391a12_6"
    },
    {
        "source_sentence": "八名抒氣蟲；",
        "translation": "The eighth is called the worm lying inhalation.",
        "source": "T17n0721_066:0391a12_7"
    },
    {
        "source_sentence": "九名憎味蟲；",
        "translation": "The ninth is called the insect of unpleasant taste.",
        "source": "T17n0721_066:0391a13_8"
    },
    {
        "source_sentence": "十名嗜睡蟲。",
        "translation": "The tenth is called the addictive sleep bug.",
        "source": "T17n0721_066:0391a13_9"
    },
    {
        "source_sentence": "「復有十蟲生於血中肉中而行：一名食毛蟲；",
        "translation": "Again, there are ten kinds of worms that grow in the blood and move within the flesh:",
        "source": "T17n0721_066:0391a13_10"
    },
    {
        "source_sentence": "二名孔穴蟲；",
        "translation": "The second is called the hollow-mouthed worm.",
        "source": "T17n0721_066:0391a14_11"
    },
    {
        "source_sentence": "三名禪都蟲；",
        "translation": "The third is called the great worm of meditation.",
        "source": "T17n0721_066:0391a15_0"
    },
    {
        "source_sentence": "四名赤蟲；",
        "translation": "The fourth is called the red worm.",
        "source": "T17n0721_066:0391a15_1"
    },
    {
        "source_sentence": "五名食汁蟲；",
        "translation": "The fifth is called the worm that eats juice.",
        "source": "T17n0721_066:0391a15_2"
    },
    {
        "source_sentence": "六名毛燈蟲；",
        "translation": "The sixth is called the hairy lamp bug.",
        "source": "T17n0721_066:0391a15_3"
    },
    {
        "source_sentence": "七名瞋血蟲；",
        "translation": "The seventh is called the worm angry blood.",
        "source": "T17n0721_066:0391a16_4"
    },
    {
        "source_sentence": "八名食血蟲；",
        "translation": "The eighth is called the worm feeding on blood.",
        "source": "T17n0721_066:0391a16_5"
    },
    {
        "source_sentence": "九名[病-丙+習][病-丙+習]蟲；",
        "translation": "The ninth is called the worm sickness.",
        "source": "T17n0721_066:0391a16_6"
    },
    {
        "source_sentence": "十名酢蟲。",
        "translation": "Ten are called vinegary insects.",
        "source": "T17n0721_066:0391a17_0"
    },
    {
        "source_sentence": "如是十蟲生於血中，其蟲形相或短或團，微細無眼。",
        "translation": "These ten kinds of worms are born in the blood. Their shapes may be short or lumplike, subtle and without eyes.",
        "source": "T17n0721_066:0391a17_1"
    },
    {
        "source_sentence": "「復有十蟲作苦痛相，生於肉中：一名瘡味蟲；",
        "translation": "Again, there are ten kinds of worms that develop painful and painful appearances and arise in the flesh:",
        "source": "T17n0721_066:0391a18_2"
    },
    {
        "source_sentence": "二名惙惙蟲；",
        "translation": "The second is called the worm garuḍa.",
        "source": "T17n0721_066:0391a19_3"
    },
    {
        "source_sentence": "三名閉筋蟲；",
        "translation": "The third is called the worm that closes its tendons.",
        "source": "T17n0721_066:0391a19_4"
    },
    {
        "source_sentence": "四名動脈蟲；",
        "translation": "The fourth is called the worm movement of the veins.",
        "source": "T17n0721_066:0391a20_0"
    },
    {
        "source_sentence": "五名食皮蟲；",
        "translation": "The fifth is called the skin-eating insect.",
        "source": "T17n0721_066:0391a20_1"
    },
    {
        "source_sentence": "六名動脂蟲；",
        "translation": "The sixth is called the flying grease bug.",
        "source": "T17n0721_066:0391a20_2"
    },
    {
        "source_sentence": "七名和聚蟲；",
        "translation": "The seventh is called Magnolia.",
        "source": "T17n0721_066:0391a20_3"
    },
    {
        "source_sentence": "八名臭蟲；",
        "translation": "The eighth is called the foulsmelling bug.",
        "source": "T17n0721_066:0391a21_4"
    },
    {
        "source_sentence": "九名汗行蟲；",
        "translation": "The ninth is called the permeation bug.",
        "source": "T17n0721_066:0391a21_5"
    },
    {
        "source_sentence": "十名熱蟲。",
        "translation": "The tenth is called the hot bug.",
        "source": "T17n0721_066:0391a21_6"
    },
    {
        "source_sentence": "如是等蟲，從肉中生。",
        "translation": "Such insects as these arise from the flesh.",
        "source": "T17n0721_066:0391a21_7"
    },
    {
        "source_sentence": "「復有十蟲行於黃中：一名黑蟲；",
        "translation": "Again, there are ten kinds of worms that move among the yellow:",
        "source": "T17n0721_066:0391a22_8"
    },
    {
        "source_sentence": "二名苗花蟲；",
        "translation": "The second is called the seedling-flower bug.",
        "source": "T17n0721_066:0391a23_9"
    },
    {
        "source_sentence": "三名大諂曲蟲；",
        "translation": "The third is called the great crooked insect.",
        "source": "T17n0721_066:0391a23_10"
    },
    {
        "source_sentence": "四名蘇毘羅蟲；",
        "translation": "The fourth is called the sopiluo bug.",
        "source": "T17n0721_066:0391a23_11"
    },
    {
        "source_sentence": "五名烏蟲；",
        "translation": "The fifth is called the crow bug.",
        "source": "T17n0721_066:0391a24_12"
    },
    {
        "source_sentence": "六名大食蟲；",
        "translation": "The sixth is called the great food-eating bug.",
        "source": "T17n0721_066:0391a24_13"
    },
    {
        "source_sentence": "七名行熱蟲；",
        "translation": "The seventh is called the flying feverish bug.",
        "source": "T17n0721_066:0391a24_14"
    },
    {
        "source_sentence": "八名大熱蟲；",
        "translation": "The eighth is called the Great Heatworm.",
        "source": "T17n0721_066:0391a24_15"
    },
    {
        "source_sentence": "九名食味蟲；",
        "translation": "The ninth name is food-eating insect.",
        "source": "T17n0721_066:0391a25_16"
    },
    {
        "source_sentence": "十名大火蟲。",
        "translation": "Ten is called the great fire bug.",
        "source": "T17n0721_066:0391a25_17"
    },
    {
        "source_sentence": "如是等蟲行於陰中。",
        "translation": "These kinds of insects move within the aggregates.",
        "source": "T17n0721_066:0391a25_18"
    },
    {
        "source_sentence": "「諸身分中有十種蟲：一名舐骨蟲；",
        "translation": "“There are ten kinds of worms in all the social classes:",
        "source": "T17n0721_066:0391a26_19"
    },
    {
        "source_sentence": "二名嚙骨蟲；",
        "translation": "The second is called the bone-snatching insect.",
        "source": "T17n0721_066:0391a27_20"
    },
    {
        "source_sentence": "三名斷節蟲；",
        "translation": "The third is called the nourishing worm.",
        "source": "T17n0721_066:0391a27_21"
    },
    {
        "source_sentence": "四名臭蟲；",
        "translation": "The fourth is called the foulsmelling bug.",
        "source": "T17n0721_066:0391a27_22"
    },
    {
        "source_sentence": "五名消骨蟲；",
        "translation": "The fifth is called the skeleton-disparaging insect.",
        "source": "T17n0721_066:0391a27_23"
    },
    {
        "source_sentence": "六名赤口蟲；",
        "translation": "The sixth is called the ruby-mouthed bug.",
        "source": "T17n0721_066:0391a28_24"
    },
    {
        "source_sentence": "七名頭頭摩蟲；",
        "translation": "The seventh is called the worm hair curl.",
        "source": "T17n0721_066:0391a28_25"
    },
    {
        "source_sentence": "八名食皮蟲；",
        "translation": "The eighth is called the skin-eating insect.",
        "source": "T17n0721_066:0391a28_26"
    },
    {
        "source_sentence": "九名刀風蟲；",
        "translation": "The ninth name is Sword-Wind bug.",
        "source": "T17n0721_066:0391a29_27"
    },
    {
        "source_sentence": "十名刀口蟲。",
        "translation": "Ten are called the sword-mouthed insects.",
        "source": "T17n0721_066:0391a29_28"
    },
    {
        "source_sentence": "「復有十種蟲行於糞中：一名生蟲；",
        "translation": "Again, there were ten kinds of worms that lived in the dung:",
        "source": "T17n0721_066:0391a29_29"
    },
    {
        "source_sentence": "二名針口蟲；",
        "translation": "The second is called the needle-mouthed insect.",
        "source": "T17n0721_066:0391b01_30"
    },
    {
        "source_sentence": "三名白節蟲；",
        "translation": "The third is called the white-bark worm.",
        "source": "T17n0721_066:0391b01_31"
    },
    {
        "source_sentence": "四名無足蟲；",
        "translation": "The fourth is called the footless bug.",
        "source": "T17n0721_066:0391b02_32"
    },
    {
        "source_sentence": "五名散糞蟲；",
        "translation": "The fifth is called the dung-scattering insect.",
        "source": "T17n0721_066:0391b02_33"
    },
    {
        "source_sentence": "六名三燋蟲；",
        "translation": "The sixth is called the three gnats.",
        "source": "T17n0721_066:0391b02_34"
    },
    {
        "source_sentence": "七名破腸蟲；",
        "translation": "The seventh is called the worm intestines that breaks.",
        "source": "T17n0721_066:0391b03_0"
    },
    {
        "source_sentence": "八名閉塞蟲；",
        "translation": "The eighth is called the worm Shut-off.",
        "source": "T17n0721_066:0391b03_1"
    },
    {
        "source_sentence": "九名善色蟲；",
        "translation": "The ninth is called the bug of good color.",
        "source": "T17n0721_066:0391b03_2"
    },
    {
        "source_sentence": "十名穢門瘡蟲。",
        "translation": "Ten are called the sores of the defiled approach.",
        "source": "T17n0721_066:0391b03_3"
    },
    {
        "source_sentence": "其色可惡，是名糞中十種蟲也。",
        "translation": "These are called the ten kinds of worms in the dung.",
        "source": "T17n0721_066:0391b04_4"
    },
    {
        "source_sentence": "「復有十種蟲行脂髓中，何等為十？",
        "translation": "Again, there are ten kinds of worms that move among the fat and marrow. What are they?",
        "source": "T17n0721_066:0391b04_5"
    },
    {
        "source_sentence": "一名毛蟲；",
        "translation": "One was a hairy bug.",
        "source": "T17n0721_066:0391b05_6"
    },
    {
        "source_sentence": "二名黑口蟲；",
        "translation": "The second is called the black-mouthed bug.",
        "source": "T17n0721_066:0391b05_7"
    },
    {
        "source_sentence": "三名失力蟲；",
        "translation": "The third is called the worm losing its power.",
        "source": "T17n0721_066:0391b06_8"
    },
    {
        "source_sentence": "四名大痛蟲；",
        "translation": "The fourth is called the Great Painful bug.",
        "source": "T17n0721_066:0391b06_9"
    },
    {
        "source_sentence": "五名煩悶蟲；",
        "translation": "The fifth is called the insect of torpor.",
        "source": "T17n0721_066:0391b06_10"
    },
    {
        "source_sentence": "六名火色蟲；",
        "translation": "The sixth is called the fire-colored bug.",
        "source": "T17n0721_066:0391b07_11"
    },
    {
        "source_sentence": "七名下流蟲；",
        "translation": "The seventh is called the worm that goes downstream.",
        "source": "T17n0721_066:0391b07_12"
    },
    {
        "source_sentence": "八名起身根蟲；",
        "translation": "The eighth is called the body-generating worm.",
        "source": "T17n0721_066:0391b07_13"
    },
    {
        "source_sentence": "九名憶念蟲；",
        "translation": "The ninth is called the insect remembrance.",
        "source": "T17n0721_066:0391b08_14"
    },
    {
        "source_sentence": "十名歡喜蟲。",
        "translation": "The tenth is called the joyful bug.",
        "source": "T17n0721_066:0391b08_15"
    },
    {
        "source_sentence": "「如是等蟲，遍行一切身分之中，如意能行一切身中，行一切界，隨其行處，",
        "translation": "“Such-and-such worms travel throughout all their bodies, able to do so as they wish in all their bodies, traveling through all realms wherever they go.",
        "source": "T17n0721_066:0391b08_16"
    },
    {
        "source_sentence": "皆作過惡。",
        "translation": "They all commit faults and evils.",
        "source": "T17n0721_066:0391b10_17"
    },
    {
        "source_sentence": "是集蟲風一切身中，如意遍行此身，如是以風因緣，諸蟲流行。",
        "translation": "These are the causes and conditions that gather insects and wind in all their bodies and pervade this body as they wish, and these are the causes and conditions for the growth of insects.",
        "source": "T17n0721_066:0391b10_18"
    },
    {
        "source_sentence": "觀集蟲風已，如實知身。",
        "translation": "After observing the wind gathering insects, he knows his body as it really is.",
        "source": "T17n0721_066:0391b11_19"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0391b13_0"
    },
    {
        "source_sentence": "有何等風住我身中，作何等業？",
        "translation": "What kind of wind is there in my body and what kind of action does it do?",
        "source": "T17n0721_066:0391b13_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼觀見有風名曰上下，住在身中，或安不安，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they'll see that there's wind called up and down in their bodies, or they might be peaceful, so what will they do?",
        "source": "T17n0721_066:0391b14_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見上下風若不調適，行於五處，作何等業？",
        "translation": "With the wisdom of hearing or with the divine eye, what kind of action does he do when he sees up and down winds that aren't regulated by the wind and travels in five places?",
        "source": "T17n0721_066:0391b15_3"
    },
    {
        "source_sentence": "作出入氣。",
        "translation": "He creates an entering breath.",
        "source": "T17n0721_066:0391b17_4"
    },
    {
        "source_sentence": "人說為命，行於心頂，遍於身中，自在無礙，是為風力第一分也。",
        "translation": "People say that it's life, which travels at the top of their mind and pervades their bodies with freedom and unobstructedness, which is the first part of wind power.",
        "source": "T17n0721_066:0391b17_5"
    },
    {
        "source_sentence": "若風不調，能破壞身。",
        "translation": "If the wind isn't regulated, it can damage your body.",
        "source": "T17n0721_066:0391b19_0"
    },
    {
        "source_sentence": "是風亦令口中多唾，令身羸瘦，飲食反胃，逆歐而出，是為風力第二分也。",
        "translation": "This is the second part of the wind’s power.",
        "source": "T17n0721_066:0391b19_1"
    },
    {
        "source_sentence": "住於心胸，為何所作？",
        "translation": "What does it do when it's abiding in mind and chest?",
        "source": "T17n0721_066:0391b21_2"
    },
    {
        "source_sentence": "若氣在心，或憂或喜。",
        "translation": "If the energy is in the mind, it's either grieved or joyous.",
        "source": "T17n0721_066:0391b21_3"
    },
    {
        "source_sentence": "若氣從咽喉上至於頂，下入舌根，隨其所念，則能有語，能說文字，思惟諸義，",
        "translation": "The vital oṟgan enters the organ of smell from the throat up to the top of the abdomen, and then goes down to the base of the tongue. According to the thought which is generated thereby, it can speak; it can utter words; and it perceives all objectreferents.",
        "source": "T17n0721_066:0391b22_4"
    },
    {
        "source_sentence": "是為風力第三分也。",
        "translation": "This is the third part of the wind power.",
        "source": "T17n0721_066:0391b23_5"
    },
    {
        "source_sentence": "復有常為身火惱亂，令身流汗，是為風力第四分也。",
        "translation": "Again, there's always a body that's tormented by fire and causes sweat to flow through the body, which is the fourth part of the wind power.",
        "source": "T17n0721_066:0391b24_6"
    },
    {
        "source_sentence": "是風遍身，瞼眼視眴動一切身，思惟遍身。",
        "translation": "It's the wind that pervades his body, eyes that see and shake all bodies with lids and thoughts that pervade his body.",
        "source": "T17n0721_066:0391b25_7"
    },
    {
        "source_sentence": "依男女根能生子息，若男女行欲，如此風力，能集精血，能令女人髖骨多力，",
        "translation": "If a man or woman is engaged in sexual desire, the wind generates semen and blood by means of the power of this wind. It causes women to chew on their flesh and bones with great vigor.",
        "source": "T17n0721_066:0391b26_8"
    },
    {
        "source_sentence": "男女精血和合共集鉀羅婆身。",
        "translation": "Men and women's semen and blood are combined to form the body of Kālāva.",
        "source": "T17n0721_066:0391b28_9"
    },
    {
        "source_sentence": "薄精之時，風吹令厚，而作肉團；",
        "translation": "When their energy is weak, the wind blows and makes them thick, forming lumps of flesh.",
        "source": "T17n0721_066:0391b29_0"
    },
    {
        "source_sentence": "作肉摶已，次生五胞；",
        "translation": "After they cooked the meat, five shells arose one after another.",
        "source": "T17n0721_066:0391b29_1"
    },
    {
        "source_sentence": "生五胞已，或方或圓，隨身長短，識亦遍滿，隨種種相。",
        "translation": "After the five cells have arisen, either square or round, their bodies are long or short in length, and so is the pervasive consciousness, which follows various characteristics.",
        "source": "T17n0721_066:0391c01_2"
    },
    {
        "source_sentence": "譬如有人攢酪出酥，有酪有水、有瓮有攢，攢之出沫，知其已熟，收取生酥。",
        "translation": "Good man, it is analogous to someone who eats curds and produces butter. With curds there is water, and with a pot there is cream. Eating the curds, he knows that they have already cooked and collects together uncooked butter.",
        "source": "T17n0721_066:0391c02_3"
    },
    {
        "source_sentence": "如是風力及業煩惱，能集成身，亦復如是，是為第五風力分也。",
        "translation": "In the same way, the power of wind and the defilement by action can concentrate the body: this is the fifth aspect of the power of wind.",
        "source": "T17n0721_066:0391c04_4"
    },
    {
        "source_sentence": "若飲食噉味於舌根中、咽喉脈中，飲食充滿，乃至遍於毛根爪甲，氣力增長，",
        "translation": "If the taste of food and drink is found in the roots of the tongue or in the veins of the throat, if it's filled with food and drink... even pervaded by hair, faculties, nails, and scabies, its energy grows.",
        "source": "T17n0721_066:0391c05_5"
    },
    {
        "source_sentence": "作色香味。",
        "translation": "It creates form and fragrance.",
        "source": "T17n0721_066:0391c07_6"
    },
    {
        "source_sentence": "若風不調，下風上行，作四種惡，氣塞難出，遍身苦惱。",
        "translation": "If the wind isn't regulated, going down and up in the wind, they do four kinds of bad things, make it difficult to escape from the air obstruction, and experience pain and suffering all over their bodies.",
        "source": "T17n0721_066:0391c07_7"
    },
    {
        "source_sentence": "若離本處，一切諸根、一切識中皆得惱亂，喪失身命，既捨身已，失三種法：一、命；",
        "translation": "If they leave their original place, all the faculties and all conscious constructs will be disturbed. They will lose body and life.",
        "source": "T17n0721_066:0391c08_8"
    },
    {
        "source_sentence": "二、煖；",
        "translation": "The second is warmth.",
        "source": "T17n0721_066:0391c10_9"
    },
    {
        "source_sentence": "三、識。",
        "translation": "3. consciousness.",
        "source": "T17n0721_066:0391c10_10"
    },
    {
        "source_sentence": "「『若捨此身時，　　失命暖及識，",
        "translation": "'When you abandon this body, You'll lose your life, warmth, and consciousness.",
        "source": "T17n0721_066:0391c10_11"
    },
    {
        "source_sentence": "　　更無所覺知，　　猶如瓦木石。』",
        "translation": "There's nothing to perceive like a tile, wood, or stone.'",
        "source": "T17n0721_066:0391c10_11"
    },
    {
        "source_sentence": "是故偈言：「是則名為第一惡也。",
        "translation": "Therefore, the verse says, This is called the first bad thing.",
        "source": "T17n0721_066:0391c10_11"
    },
    {
        "source_sentence": "若不調適，作第二業，喘息麁重，不能調順，一切遍身苦惱所逼，逼之苦極，",
        "translation": "If they aren’t disciplined, they do the second action, panting and weighing heavily; they can’t be disciplined. All pervade their bodies with all kinds of torment and oppression, pressing them down to the utmost pain.",
        "source": "T17n0721_066:0391c13_12"
    },
    {
        "source_sentence": "則捨身命，是則名為第二惡也。",
        "translation": "Then you'll abandon body and life, which is called the second bad thing.",
        "source": "T17n0721_066:0391c15_13"
    },
    {
        "source_sentence": "是上行風若不調順，作第三惡，既惱諸根，一切遍身而作惱亂，喪失身命，",
        "translation": "If these winds blow upward but are not regulated, they do the third evil: because they disturb the sense faculties and all parts of the body. This is to say that if one acts in such a way, he will be disturbed by everything and lose his life.",
        "source": "T17n0721_066:0391c15_14"
    },
    {
        "source_sentence": "是則名為第三惡也。",
        "translation": "This is the third evil.",
        "source": "T17n0721_066:0391c17_15"
    },
    {
        "source_sentence": "是上行風若不調適，作第四惡，或大喘息或復微少，或致命終，或但傴身而不失命，",
        "translation": "If this wind blows upward but is not seasonal, it does the fourth evil: sometimes it blows with a sudden gust of wind and sometimes with a gentle breeze. Sometimes it blows until death; sometimes it bends its body but does not lose life.",
        "source": "T17n0721_066:0391c17_16"
    },
    {
        "source_sentence": "是則名曰第四惡也。",
        "translation": "This is called the fourth evil.",
        "source": "T17n0721_066:0391c19_17"
    },
    {
        "source_sentence": "若睡眠時，氣息出入，以時命根。",
        "translation": "When drowsy, it is the faculty life at the moment of breathing in and breathing out.",
        "source": "T17n0721_066:0391c20_18"
    },
    {
        "source_sentence": "如是觀上下風已，如實知身。",
        "translation": "After observing the wind above and below like this, he knows his body as it really is.",
        "source": "T17n0721_066:0391c21_19"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0391c22_0"
    },
    {
        "source_sentence": "有何等風，或安不安，作何等業？",
        "translation": "What kind of wind does it have? Or what kind of action does it do to make you feel at ease?",
        "source": "T17n0721_066:0391c22_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼觀見：有風名曰命風，住在身中，或令身肥或令羸瘦，",
        "translation": "With the wisdom of hearing or with the divine eye they see: There is a wind called vital wind that abides in their bodies, sometimes making them fat and sometimes thin.",
        "source": "T17n0721_066:0391c23_2"
    },
    {
        "source_sentence": "令心審諦，若風不調，心則輕動，所知皆失，曾聞亦忘失，見境不了，",
        "translation": "It causes the mind to be attentive, and if the wind isn’t tempered, the mind will tremble; all that it knows will be lost. All what it has heard will also be forgotten, and when it sees objects it won’t understand them.",
        "source": "T17n0721_066:0391c25_3"
    },
    {
        "source_sentence": "於聲不聞，如是鼻不知香、舌不知味、身不覺觸、意不知法，不識自他。",
        "translation": "If someone doesn't hear sounds, their nose doesn't know fragrance, their tongue doesn't know taste, their body doesn't experience touch, and their mind doesn't know the principle, and they don't know themselves or others.",
        "source": "T17n0721_066:0391c26_4"
    },
    {
        "source_sentence": "觀命風已，如實知身。",
        "translation": "After observing the wind of life, he knows his body as it really is.",
        "source": "T17n0721_066:0391c28_5"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0391c29_0"
    },
    {
        "source_sentence": "有何等風，作何等業？",
        "translation": "What kind of wind is there and what kind of action does it do?",
        "source": "T17n0721_066:0391c29_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見亂心風住於身中，若調不調，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see distracting mental winds that abide in their bodies. If they are tempered or unmatured, what do they do?",
        "source": "T17n0721_066:0392a01_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見於此風：若我心過，風不調順，隨心所行，或動或頑，",
        "translation": "With the wisdom of hearing or with divine vision, they see these winds:",
        "source": "T17n0721_066:0392a02_3"
    },
    {
        "source_sentence": "乾消癡亂，或所食味，邪流不正，如是惱亂其心，令於善法不生愛樂，",
        "translation": "Disturbing their minds in this way, they do not give rise to affection or pleasure for the virtuous things.",
        "source": "T17n0721_066:0392a04_4"
    },
    {
        "source_sentence": "流汗多唾，不耐冷觸；",
        "translation": "They sweated heavily and spit, unable to endure cold touch.",
        "source": "T17n0721_066:0392a05_5"
    },
    {
        "source_sentence": "若見色相，以有病故，不能如本、如實見色，身重難攝，身毛皆竪。",
        "translation": "If they see form and characteristics, it's because of illness that they can't see form as it is or as it really is, and their body weight is difficult to gather, and their hair on the body is all coarse.",
        "source": "T17n0721_066:0392a06_6"
    },
    {
        "source_sentence": "若風調順，則無如向所說之病。",
        "translation": "If the wind is tempered, there won't be the illness described above.",
        "source": "T17n0721_066:0392a07_7"
    },
    {
        "source_sentence": "觀亂心風已，如實知身。",
        "translation": "After observing the wind of confusion in his mind, he knows his body as it really is.",
        "source": "T17n0721_066:0392a08_8"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0392a09_0"
    },
    {
        "source_sentence": "有何等風住於身中，或安不安，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0392a09_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：有亂風住在身中，若不調順，多見惡夢，睡眠驚悟，",
        "translation": "With the wisdom of hearing or with divine vision, they may see that there’s a turbulent wind abiding in their bodies. If they aren’t disciplined, they often see bad dreams, sleep, and awakening.",
        "source": "T17n0721_066:0392a10_2"
    },
    {
        "source_sentence": "雖住溫煖而常覺冷；",
        "translation": "Though they abide in warmth, yet always feel cool.",
        "source": "T17n0721_066:0392a12_3"
    },
    {
        "source_sentence": "若見城邑村落人民，見為空聚，或見黃色，少於言語，不樂臥處；",
        "translation": "If they see cities, towns, villages, and people, they may see them as hollow clusters, or they may see the colors of yellow. They have little speech and do not delight in lying down.",
        "source": "T17n0721_066:0392a12_4"
    },
    {
        "source_sentence": "本曾聞法，皆悉忘失；",
        "translation": "They had all forgotten the teachings they had heard before.",
        "source": "T17n0721_066:0392a14_5"
    },
    {
        "source_sentence": "四大惱亂，其所食味住於心中，無緣生厭，妄見丘聚。",
        "translation": "The four elements are greatly disturbed, and the tastes they eat abide in their minds, which give rise to disillusionment without any reason. They deludedly see hills and mounds.",
        "source": "T17n0721_066:0392a14_6"
    },
    {
        "source_sentence": "若風調順，則無如上所說諸病。",
        "translation": "If the wind is tempered, then there are no illnesses as described above.",
        "source": "T17n0721_066:0392a15_7"
    },
    {
        "source_sentence": "觀亂風已，如實知身。",
        "translation": "After observing the wind, he knows his body as it really is.",
        "source": "T17n0721_066:0392a16_8"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0392a18_0"
    },
    {
        "source_sentence": "有何等風，作何等業？",
        "translation": "What kind of wind is there and what kind of action does it do?",
        "source": "T17n0721_066:0392a18_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：視眴風住在身中，若不調適，不得眴目。",
        "translation": "With the wisdom of hearing or with the divine eye, they might see: They look at the wind in their bodies as a gust of wind and stay inside them; if they aren't adjusted, they won't be able to see it.",
        "source": "T17n0721_066:0392a19_2"
    },
    {
        "source_sentence": "更無餘風，速於如此。",
        "translation": "There is no wind that blows any faster than this.",
        "source": "T17n0721_066:0392a20_3"
    },
    {
        "source_sentence": "視眴風者，行一切處，悉遍諸根，若不調順，則生此病。",
        "translation": "He who observes that the wind of anger travels everywhere, pervading all his faculties, and if he doesn't regulate it, this illness will arise.",
        "source": "T17n0721_066:0392a20_4"
    },
    {
        "source_sentence": "若風調順，則無如向所說諸病。",
        "translation": "If the wind is tempered, there are no illnesses as described above.",
        "source": "T17n0721_066:0392a22_5"
    },
    {
        "source_sentence": "觀視眴風已，如實知身。",
        "translation": "After observing the gust of wind, he knows his body as it really is.",
        "source": "T17n0721_066:0392a22_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0392a24_0"
    },
    {
        "source_sentence": "有何等風，或調不調，作何等業？",
        "translation": "What kind of wind does it have, or what kind of action does it do?",
        "source": "T17n0721_066:0392a24_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名互相閉，欲命終時，有五風起，或調不調，",
        "translation": "With the wisdom of hearing or with divine vision, they see a wind called mutual shuttering. When their life is about to end, five winds arise, sometimes blowing and sometimes not blowing:",
        "source": "T17n0721_066:0392a25_2"
    },
    {
        "source_sentence": "為作何業？",
        "translation": "What actions are they performed for?",
        "source": "T17n0721_066:0392a27_3"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：眼耳鼻舌身心壞故，於自境界色聲香味觸法中不能緣了，",
        "translation": "With the wisdom of hearing or with divine vision, they see: Because the eye, ear, nose, tongue, body and mind are broken, they can’t perceive form, sound, odor, taste, touch, or dharmas in their own realm as objects.",
        "source": "T17n0721_066:0392a27_4"
    },
    {
        "source_sentence": "若風不發，命則不斷，發則失命。",
        "translation": "If the wind doesn't arise, then life won't arise, and if it does arise, then life will be lost.",
        "source": "T17n0721_066:0392a29_5"
    },
    {
        "source_sentence": "觀五閉風已，如實知身。",
        "translation": "After observing the five closed winds, he knows his body as it really is.",
        "source": "T17n0721_066:0392a29_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0392b02_0"
    },
    {
        "source_sentence": "有何等風，或調不調，作何等業？",
        "translation": "What kind of wind does it have, or what kind of action does it do?",
        "source": "T17n0721_066:0392b02_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：壞胎藏風住在身中，若人初識入於母胎，先業因緣，",
        "translation": "With the wisdom of hearing or with divine vision, they see: The wind that breaks up the womb-store wind abides in their bodies.",
        "source": "T17n0721_066:0392b03_2"
    },
    {
        "source_sentence": "歌羅羅時即壞其命；",
        "translation": "At the time of Kālāra’s death his life was destroyed.",
        "source": "T17n0721_066:0392b05_3"
    },
    {
        "source_sentence": "若歌羅羅時不壞其命，至肉摶時乃斷其命，冷風入胎令其破壞；",
        "translation": "When the embryo is born, its life does not perish; when it dies after having undergone a carriage, its life is cut off.",
        "source": "T17n0721_066:0392b05_4"
    },
    {
        "source_sentence": "若肉摶時不斷其命，身分具足乃斷其命；",
        "translation": "If they do not cut off their life at the moment of eating meat, then cutting off their life when they are fully endowed.",
        "source": "T17n0721_066:0392b07_5"
    },
    {
        "source_sentence": "若身分具足不斷其命，諸根具足乃斷其命。",
        "translation": "If someone's identity is complete, they won't stop their life, and if their faculties are complete, they'll stop their life.",
        "source": "T17n0721_066:0392b08_6"
    },
    {
        "source_sentence": "隨其宿世殺業輕重，於胎藏中而斷其命。",
        "translation": "Depending on the severity of their past lives, they'll cut off their life in the womb.",
        "source": "T17n0721_066:0392b09_7"
    },
    {
        "source_sentence": "若於宿世不殺眾生，如所說風，不能殺害。",
        "translation": "If someone doesn't kill sentient beings in past lives, they won't be able to kill them as described by the wind.",
        "source": "T17n0721_066:0392b10_8"
    },
    {
        "source_sentence": "觀壞胎藏風已，如實知身。",
        "translation": "After observing the wind that destroys the womb store, he knows his body as it really is.",
        "source": "T17n0721_066:0392b11_9"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0392b12_0"
    },
    {
        "source_sentence": "有何等風，或調不調，作何等業？",
        "translation": "What kind of wind does it have, or what kind of action does it do?",
        "source": "T17n0721_066:0392b12_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名轉胎藏，住在身中，或亂不亂，作何等業？",
        "translation": "With the wisdom of hearing, or with the divine eye, they see a wind called womb-transforming wind that abides in their body, or which is neither disturbed nor undisturbed. What kind of action does it do?",
        "source": "T17n0721_066:0392b13_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：轉胎風以此眾生先世邪業，若是男子轉為女人，",
        "translation": "With the wisdom of hearing, or with divine vision, they may see that this sentient being who turns the wind in the womb by virtue of past wrong actions is a male and becomes a woman.",
        "source": "T17n0721_066:0392b15_3"
    },
    {
        "source_sentence": "或作黃門或胎中死，以惡業故；",
        "translation": "Sometimes they do eunuch actions or die in the womb, because of bad action.",
        "source": "T17n0721_066:0392b16_4"
    },
    {
        "source_sentence": "若於先世無惡業者，莫能為害。",
        "translation": "If someone hadn't done bad actions in a prior life, they couldn't harm them.",
        "source": "T17n0721_066:0392b17_5"
    },
    {
        "source_sentence": "觀轉胎藏風已，如實知身。",
        "translation": "After observing the wind of the womb store, he knows his body as it really is.",
        "source": "T17n0721_066:0392b18_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0392b19_0"
    },
    {
        "source_sentence": "有何等風住在身中，作何等業？",
        "translation": "What kind of wind is there in the body and what kind of action does it do?",
        "source": "T17n0721_066:0392b19_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見去來走擲風住在身中，或亂不亂，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see past and future goings and tossed wind in their bodies, or they may be confused and unconfused, so what do they do?",
        "source": "T17n0721_066:0392b20_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：去來走擲風若不調順，手足攣躄，身傴曲脊，不能行來，",
        "translation": "With the wisdom of hearing or with the divine eye they see: When going and coming, when going and tossed by wind, if they don’t go along with it, their hands and feet are trembling, and their bodies are twisted and crooked, unable to come and go.",
        "source": "T17n0721_066:0392b21_3"
    },
    {
        "source_sentence": "飲食仰他，不能自食，身根、智慧悉不清淨。",
        "translation": "They look up to others for food and drink and can't eat themselves, and their physical faculties and wisdom are completely impure.",
        "source": "T17n0721_066:0392b23_4"
    },
    {
        "source_sentence": "若風調順，身則能行去來進止，能走能擲，上下騎乘。",
        "translation": "If the wind is tempered, his body can move, come and go, advance and retreat, walk and toss, and ride up and down.",
        "source": "T17n0721_066:0392b24_5"
    },
    {
        "source_sentence": "觀去來走擲風已，如實知身。",
        "translation": "After observing the past and future, he knows his body as it really is after walking and tossed by the wind.",
        "source": "T17n0721_066:0392b25_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0392b27_0"
    },
    {
        "source_sentence": "有何等風，或調不調，作何等業？",
        "translation": "What kind of wind does it have, or what kind of action does it do?",
        "source": "T17n0721_066:0392b27_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見眼耳鼻舌身五根別風業之所作，業風所吹，一風與眼共緣。",
        "translation": "With the wisdom of hearing or with divine vision, they see the eye, ear, nose, tongue, body, and five faculties as a separate wind created by karma that's blown by the wind of karma, and one wind has the eye as its common condition.",
        "source": "T17n0721_066:0392b28_2"
    },
    {
        "source_sentence": "四大之中風力強故，故名為風。",
        "translation": "Among the four elements, wind is called wind because its power is strong.",
        "source": "T17n0721_066:0392c01_3"
    },
    {
        "source_sentence": "是風能令眼根四大清淨，見眾色像；",
        "translation": "It is the wind that causes the four elements of the eye faculty to be purified, seeing all forms.",
        "source": "T17n0721_066:0392c01_4"
    },
    {
        "source_sentence": "一風耳中，能令聞聲，鼻香、舌味、身觸亦復如是。",
        "translation": "The same applies to the smell of the nose, to the taste of the tongue and to bodily contact.",
        "source": "T17n0721_066:0392c02_5"
    },
    {
        "source_sentence": "如是五風，如實觀之。",
        "translation": "These five winds are observed as they really are.",
        "source": "T17n0721_066:0392c03_6"
    },
    {
        "source_sentence": "若風調順，於五境界無所障礙；",
        "translation": "If the wind is tempered, there is no obstruction in any of the five spheres.",
        "source": "T17n0721_066:0392c04_7"
    },
    {
        "source_sentence": "若不調順，則多障礙，不能如實知於境界。",
        "translation": "If they aren't disciplined, there are many obstacles, and they can't truly know the objective realm.",
        "source": "T17n0721_066:0392c05_8"
    },
    {
        "source_sentence": "如是觀於眼耳鼻舌身五種風已，如實知身。",
        "translation": "Thus, after observing the five kinds of wind in the eye, ear, nose, nose, tongue, and body, he knows the body as it really is.",
        "source": "T17n0721_066:0392c06_9"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0392c08_0"
    },
    {
        "source_sentence": "有何等風，或調不調，作何等業？",
        "translation": "What kind of wind does it have, or what kind of action does it do?",
        "source": "T17n0721_066:0392c08_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有刀風住在身中，或亂不亂，作何等業？",
        "translation": "With the wisdom of hearing, or with the divine eye, they see that there's a sword and wind in their body, or what actions they do when they're disturbed or not disturbed?",
        "source": "T17n0721_066:0392c09_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：命終時，刀風皆動，皮肉筋骨、脂髓精血一切解截，",
        "translation": "With the wisdom of hearing or with divine vision, they may see that when their life ends, the wind of the sword moves, and skin, flesh, tendons, bones, fat, marrow, semen, and blood are all cut off.",
        "source": "T17n0721_066:0392c10_3"
    },
    {
        "source_sentence": "令其乾燥，氣閉不流；",
        "translation": "It causes them to dry up and not flow when the air is shut off.",
        "source": "T17n0721_066:0392c12_4"
    },
    {
        "source_sentence": "身既乾燥，苦惱而死，如千炎刀而刺其身，十六分中猶不及一。",
        "translation": "His body dried up and died in distress, as if he were struck by a thousand-pronged sword. It did not amount to even one ounce of the sixteenth part [of the coin].",
        "source": "T17n0721_066:0392c12_5"
    },
    {
        "source_sentence": "若有善業，垂死之時，刀風微動，不多苦惱。",
        "translation": "If there's good action, it won't cause much pain or suffering when the sword and wind blow gently at the time of death.",
        "source": "T17n0721_066:0392c14_6"
    },
    {
        "source_sentence": "觀刀風已，如實知身。",
        "translation": "After observing the wind of the sword, he knows his body as it really is.",
        "source": "T17n0721_066:0392c15_7"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0392c16_0"
    },
    {
        "source_sentence": "有何等風，或調不調，作何等業？",
        "translation": "What kind of wind does it have, or what kind of action does it do?",
        "source": "T17n0721_066:0392c16_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見針刺風住在身中，或調不調，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see needles and pierce the wind in their bodies, or they may be tempered or not, but what do they do?",
        "source": "T17n0721_066:0392c17_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：命終時，風不調順，遍身諸節及一切脈、一切筋中、一切枝骨、一切毛孔、一切肉中、一切骨中、一切髓中，",
        "translation": "With the wisdom of hearing or with the divine eye they see: When their life ends, the wind doesn’t go along with them. Their bodies are all pervaded by knuckles and all veins, all tendons, all bones, all pores, all flesh, all bones, and all marrow.",
        "source": "T17n0721_066:0392c18_3"
    },
    {
        "source_sentence": "如燒炎針遍於身中來逼人身，如百千炎針皆刺其身，十六分中不及其一。",
        "translation": "It's like a burning hot needle that pervades your body and compresses it, or a hundred thousand hot needles that pierce your body, but within 16 parts of it, there's not even one.",
        "source": "T17n0721_066:0392c21_4"
    },
    {
        "source_sentence": "若於宿世有善業者，於命終時，是針刺風則不大苦。",
        "translation": "If someone had done good actions in a previous life, it wouldn't be very painful if this needle were to pierce the wind at the time of their death.",
        "source": "T17n0721_066:0392c23_5"
    },
    {
        "source_sentence": "觀針刺風已，如實知身。",
        "translation": "After observing the needle piercing the wind, he knows his body as it really is.",
        "source": "T17n0721_066:0392c24_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0392c26_0"
    },
    {
        "source_sentence": "有何等風，或調不調，作何等業？",
        "translation": "What kind of wind does it have, or what kind of action does it do?",
        "source": "T17n0721_066:0392c26_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼觀見有風，名曰惡黃，住在身中，若調不調，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see that there's a wind called bad yellowness that abides in their body, and if it's tempered or unregulated, what does it do?",
        "source": "T17n0721_066:0392c27_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：惡黃風若不調順，則生黃病，口中乾燥，遍身皆黃，",
        "translation": "With the wisdom of hearing or with divine vision they see: If bad yellow wind doesn’t go along with it, yellow sickness will arise. Their mouths will dry up and all their bodies will be yellow.",
        "source": "T17n0721_066:0392c29_3"
    },
    {
        "source_sentence": "面目爪甲一切皆黃，腹脹麁大，於其腹上青黃脈現，其身無力，食不能消，",
        "translation": "Their faces, eyes, nails, and armor are all yellow; their abdomen is swollen and gross, and blue and yellow veins appear in the upper part of their belly. Their bodies lack strength and they cannot eat or drink.",
        "source": "T17n0721_066:0393a01_4"
    },
    {
        "source_sentence": "口苦尿黃，身體羸瘦，目視眾色皆作青黃，不能起止，腹中常脹。",
        "translation": "Their mouths are painful and their urine is yellow, and their bodies are weak and thin. When they look at the various colors with their eyes, they all turn blue and yellow; they can't get up or stop, and their belly always swells in anguish.",
        "source": "T17n0721_066:0393a03_5"
    },
    {
        "source_sentence": "若黃風不調，則生此病；",
        "translation": "If the yellow wind is uncontrolled, this disease will arise.",
        "source": "T17n0721_066:0393a05_6"
    },
    {
        "source_sentence": "若黃風調順，則無此病。",
        "translation": "If the yellow wind were to go along with it, there would be no such illness.",
        "source": "T17n0721_066:0393a05_7"
    },
    {
        "source_sentence": "觀惡黃風已，如實知身。",
        "translation": "After observing the bad yellow wind, he knows his body as it really is.",
        "source": "T17n0721_066:0393a06_8"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0393a07_0"
    },
    {
        "source_sentence": "有何等風，或調不調，作何等業？",
        "translation": "What kind of wind does it have, or what kind of action does it do?",
        "source": "T17n0721_066:0393a07_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰破腸，或調不調，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see a wind called intestines that are broken and sometimes tempered but not tempered; what does it do?",
        "source": "T17n0721_066:0393a08_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：破腸風若不調順，若多飲食而復頻申，能破其腸，",
        "translation": "With the wisdom of hearing or with divine vision, they may see: If a wind breaks through their intestines and doesn't regulate it, or if there's plenty of food and drink and repeatedly expansion, it can break through their intestines.",
        "source": "T17n0721_066:0393a09_3"
    },
    {
        "source_sentence": "或雜骨食肉入其腸中，能破其腸，食則流出，腹大增長，生大苦痛，不能飲食；",
        "translation": "Or they may enter their intestines with mixed bones and eat meat, which can break the intestines. When they eat this, the flesh flows out; their belly becomes large and grows larger, producing great pain and suffering that cannot be sustained by food or drink.",
        "source": "T17n0721_066:0393a11_4"
    },
    {
        "source_sentence": "食力少故，身體微劣，手足皆腫，下門蒸熱，一切身分恒熱不定，口中乾燥，",
        "translation": "Because the power of food is small, their bodies are weak and feeble. Their hands and feet all swollen with abscesses. They feel feverish when coming from the lower part of the body. All parts of their bodies are constantly hot and indeterminate; their mouths dry up.",
        "source": "T17n0721_066:0393a13_5"
    },
    {
        "source_sentence": "常見惡夢。",
        "translation": "He often had bad dreams.",
        "source": "T17n0721_066:0393a15_0"
    },
    {
        "source_sentence": "腹中風動，一念不住。",
        "translation": "When the wind moves in his belly, he doesn't stop with a single thought.",
        "source": "T17n0721_066:0393a15_1"
    },
    {
        "source_sentence": "若破腸風調順和適，則無如向所說諸病。",
        "translation": "If someone breaks the wind of the intestines and goes along with it, then there won't be any illnesses as described above.",
        "source": "T17n0721_066:0393a15_2"
    },
    {
        "source_sentence": "觀破腸風已，如實知身。",
        "translation": "After observing the wind that breaks his intestines, he knows his body as it really is.",
        "source": "T17n0721_066:0393a16_3"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0393a18_0"
    },
    {
        "source_sentence": "有何等風，或調不調，作何等業？",
        "translation": "What kind of wind does it have, or what kind of action does it do?",
        "source": "T17n0721_066:0393a18_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰冷唾，若調不調，為何所作？",
        "translation": "If they see a wind called cold spittle with the wisdom of hearing or with the divine eye, what does it do if it's regulated or unregulated?",
        "source": "T17n0721_066:0393a19_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：冷唾風若不調順，口中味甘，其心忪忪，不憶飲食，",
        "translation": "With the wisdom of hearing or with divine vision they may see: If the cold spittering wind isn’t regulated, their mouths taste sweet and sweet, and their minds are dazed, not remembering food or drink.",
        "source": "T17n0721_066:0393a20_3"
    },
    {
        "source_sentence": "若欲坐禪，則生疑怠，舌重難語或咽喉痛，氣噫臭惡，心中臭氣上衝咽喉，",
        "translation": "If someone wants to sit in meditation, they become doubtful and lazy. Their tongues are heavy and difficult to speak, or they may experience pain in their throat or throat; their breath is coarse and foul-smelling, and the odor rises up into their throat with an odor in their mind.",
        "source": "T17n0721_066:0393a22_4"
    },
    {
        "source_sentence": "氣澁難出，不覺飢渴，咽喉閉塞。",
        "translation": "Their breath is short and difficult to exhale, they don't feel hunger or thirst, and their throat is shut.",
        "source": "T17n0721_066:0393a24_5"
    },
    {
        "source_sentence": "若冷風調順，則無如上所說諸病。",
        "translation": "If the cold wind is tempered, then there are no illnesses as described above.",
        "source": "T17n0721_066:0393a24_6"
    },
    {
        "source_sentence": "觀冷唾風已，如實知身。",
        "translation": "After observing the cold, spitting wind, he knows his body as it really is.",
        "source": "T17n0721_066:0393a25_7"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0393a27_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0393a27_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰傷髓，住在身中，若不調順，為何所作？",
        "translation": "With the wisdom of hearing or with divine vision, they see a wind called marrow-injuring wind that abides in their body. If they don't comply, what will they do?",
        "source": "T17n0721_066:0393a28_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：傷髓風若不調順，令身振動，身多疲極，不能遠行，",
        "translation": "With the wisdom of hearing or with divine vision, they may see: They hurt their marrow and wind. If they aren’t disciplined, causing their bodies to shake and become overcome by exhaustion, they can’t travel far.",
        "source": "T17n0721_066:0393b01_3"
    },
    {
        "source_sentence": "常多病疾，顏色醜惡，身體[病-丙+習][病-丙+習]，不能多語，",
        "translation": "They often suffer from illness and discomfort. Their complexions are ugly and unable to speak much.",
        "source": "T17n0721_066:0393b02_4"
    },
    {
        "source_sentence": "其心怯弱。",
        "translation": "Their minds are weak.",
        "source": "T17n0721_066:0393b03_5"
    },
    {
        "source_sentence": "是人晝夜骨髓常疼，身毛皆竪，諸脈劣弱，常患頭痛。",
        "translation": "That man's bones and marrow always ached day and night, his body hair stood on end, his veins weakened, and he often suffered from headaches.",
        "source": "T17n0721_066:0393b04_6"
    },
    {
        "source_sentence": "以此風故，常動腦蟲，以蟲動故，猶如針刺。",
        "translation": "Because of this wind, the worm always moves its brain; because it moves, it is like a needle twitching.",
        "source": "T17n0721_066:0393b05_7"
    },
    {
        "source_sentence": "若風調順，則無如上所說諸病。",
        "translation": "If the wind is tempered, then there are no illnesses as described above.",
        "source": "T17n0721_066:0393b06_8"
    },
    {
        "source_sentence": "觀傷髓風已，如實知身。",
        "translation": "After he wounds his marrow and wind, he knows his body as it really is.",
        "source": "T17n0721_066:0393b06_9"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0393b08_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0393b08_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼觀見有風，名曰害皮，住在身中，若不調順，為何所作？",
        "translation": "With the wisdom of hearing, or with the divine eye, they see that there's wind, which is called harmful skin and abides in their body; if they aren't disciplined, what will they do?",
        "source": "T17n0721_066:0393b09_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：害皮風若不調順，令我身皮其色醜惡，皆悉麁澁，",
        "translation": "With the wisdom of hearing, or with divine vision, they may see harmful winds that blow my skin and flesh; but if they don’t control it, their skin and flesh will all turn coarse and ugly.",
        "source": "T17n0721_066:0393b11_3"
    },
    {
        "source_sentence": "身皮破裂，設以蘇油而塗其身，速疾乾燥；",
        "translation": "The skin of the body breaks open and disintegrates, and if one rubs it with soap or oil they quickly dry up.",
        "source": "T17n0721_066:0393b12_4"
    },
    {
        "source_sentence": "身體手足皆悉堅直，難可屈伸，夢中多見垂墮嶮岸，暖飲食味，口中覺冷，",
        "translation": "Their bodies, hands, feet, and legs are all firm and straight, difficult to bend or stretch. In their dreams they often see people falling down a precipitous precipice, with the taste of warm food and drink and the sensation of cold in their mouths.",
        "source": "T17n0721_066:0393b13_5"
    },
    {
        "source_sentence": "舌瘡破裂不能飲食。",
        "translation": "His tongue sores and broken bones won't allow him to eat or drink.",
        "source": "T17n0721_066:0393b15_6"
    },
    {
        "source_sentence": "若害皮風調順和適，則無如向所說諸病。",
        "translation": "If they harm skin and wind and are tamed and adapted, then there won't be the illnesses described above.",
        "source": "T17n0721_066:0393b15_7"
    },
    {
        "source_sentence": "觀害皮風已，如實知身。",
        "translation": "After observing the wind that harms skin and wind, he knows his body as it really is.",
        "source": "T17n0721_066:0393b16_8"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0393b18_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0393b18_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰害血，住在身中，若不調順，為何所作？",
        "translation": "With the wisdom of hearing or with divine vision, they see a wind called harming blood that abides in their bodies. If they aren't disciplined, what will they do?",
        "source": "T17n0721_066:0393b19_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：害血風住在身中，若不調順，行於肺中作二種過——或上或下。",
        "translation": "With the wisdom of hearing or with the divine eye, they may see that harming blood and wind abide in their body, or if they aren't disciplined, they commit two kinds of faults in their lungs - either above or below.",
        "source": "T17n0721_066:0393b21_3"
    },
    {
        "source_sentence": "若血上行，令眼耳鼻血脈不調，諸大不安，大不調故，身體失力，顏色麁惡，",
        "translation": "If the blood moves upward and causes the eyes, ears, nose, blood vessels, and veins to be disturbed, great uneasiness arises because they are greatly disturbed. Their bodies lack strength and their complexions are coarse and ugly.",
        "source": "T17n0721_066:0393b23_4"
    },
    {
        "source_sentence": "不能去來，鼻中常臭；",
        "translation": "They cannot go or come back, and always smell bad odors are found in their noses.",
        "source": "T17n0721_066:0393b24_5"
    },
    {
        "source_sentence": "同梵行者，不與同行同處而坐。",
        "translation": "A practitioner of the same religious practice doesn't sit in the same place as his fellow practitioners.",
        "source": "T17n0721_066:0393b25_6"
    },
    {
        "source_sentence": "若血下行至大小便流血而下，作三種過：一者痔病；",
        "translation": "If someone walks down from the blood up to the excretion and urination streams blood, they commit three kinds of faults:",
        "source": "T17n0721_066:0393b25_7"
    },
    {
        "source_sentence": "二者苦惱；",
        "translation": "The second is distress.",
        "source": "T17n0721_066:0393b27_8"
    },
    {
        "source_sentence": "三者下血。",
        "translation": "Three, it's the blood below.",
        "source": "T17n0721_066:0393b27_9"
    },
    {
        "source_sentence": "若害血風和順調適，則無如上所說諸病。",
        "translation": "If they harm blood and wind and are harmonious and well-adjusted, then there won't be the illnesses described above.",
        "source": "T17n0721_066:0393b27_10"
    },
    {
        "source_sentence": "觀害血風已，如實知身。",
        "translation": "After observing the harmful blood and wind, he knows his body as it really is.",
        "source": "T17n0721_066:0393b28_11"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0393c01_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0393c01_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼觀見有風，名曰害肉，住在身中，若不調順，為何所作？",
        "translation": "With the wisdom of hearing, or with the divine eye, they see a wind called harming flesh that lives in their body. If they don't comply, what will they do?",
        "source": "T17n0721_066:0393c02_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：害肉風若不調順，令人身中生諸癰病，臭惡遍身，",
        "translation": "With the wisdom of hearing or with divine vision, they may see harming flesh and wind or not being disciplined, causing coarse illnesses to arise in their bodies that smell bad and pervade their bodies.",
        "source": "T17n0721_066:0393c04_3"
    },
    {
        "source_sentence": "破已臭惡，多有濃汁；",
        "translation": "After being broken it smelled bad and there was plenty of concentrated juice.",
        "source": "T17n0721_066:0393c05_4"
    },
    {
        "source_sentence": "耐冷惡熱，不耐辛苦，宜輕甜冷；",
        "translation": "They can endure cold and hot heat but cannot endure bitter pain. It is advisable to be mild and sweet and cool.",
        "source": "T17n0721_066:0393c06_5"
    },
    {
        "source_sentence": "一切身動，臭爛流出。",
        "translation": "All the bodily movements smelled bad and flowed out.",
        "source": "T17n0721_066:0393c07_0"
    },
    {
        "source_sentence": "若風調順，則無如向所說諸病。",
        "translation": "If the wind is tempered, there are no illnesses as described above.",
        "source": "T17n0721_066:0393c07_1"
    },
    {
        "source_sentence": "觀害肉風已，如實知身。",
        "translation": "After observing the wind that harms flesh, he knows his body as it really is.",
        "source": "T17n0721_066:0393c08_2"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0393c09_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0393c09_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼觀見有風，名曰害脂，若不調順作何等業？",
        "translation": "When they see wind with the wisdom of hearing or with the divine eye, it's called harming fat. What kind of actions will they do if they don't comply?",
        "source": "T17n0721_066:0393c10_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：害脂風若不調順，令脂增長，身生皰肉，高下不平，",
        "translation": "With the wisdom of hearing or with divine vision, they may see: harming fat and wind without regulation causes fat to grow, blistering flesh to arise in their bodies, uneven above and below.",
        "source": "T17n0721_066:0393c12_3"
    },
    {
        "source_sentence": "堆阜凹凸，或堅或滑，或有頑癡，無所覺觸。",
        "translation": "The hills and mounds are uneven, either hard or slippery. Some of them are stubborn and deluded, without feeling or touching anything.",
        "source": "T17n0721_066:0393c13_4"
    },
    {
        "source_sentence": "若害脂風和順調適，則無如上所說諸病。",
        "translation": "If they harm fat and wind and are harmonious and well-adjusted, then there won't be the illnesses described above.",
        "source": "T17n0721_066:0393c14_5"
    },
    {
        "source_sentence": "觀害脂風已，如實知身。",
        "translation": "After observing the harmful wind of fat, he knows his body as it really is.",
        "source": "T17n0721_066:0393c15_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0393c17_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0393c17_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見害骨風，若不調順，為何所作？",
        "translation": "If they harm the wind of hearing and wisdom or see with their divine eye, what will they do if they aren't disciplined?",
        "source": "T17n0721_066:0393c18_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：害骨風若不調順，令骨疼痛，其聲破散，晝夜不睡，",
        "translation": "With the wisdom of hearing or with divine vision they see: If wind blows and harms the bones, if they aren’t disciplined, it causes pain in their bones; its sound breaks off and disperses, and they don’t sleep day and night.",
        "source": "T17n0721_066:0393c19_3"
    },
    {
        "source_sentence": "項頸疼痛，一切筋骨皆緩不治，筋骨無力，身常疼痛，疲極苦惱，不能起止，",
        "translation": "The neck and neck ached, and all the tendons and bones became limp and unhealed. The tendons and bones were so weak that they could not be healed. Their bodies always ached and pained, and they felt exhausted and distressed, unable to rest.",
        "source": "T17n0721_066:0393c21_4"
    },
    {
        "source_sentence": "無一念樂。",
        "translation": "There's no single thought of bliss.",
        "source": "T17n0721_066:0393c23_5"
    },
    {
        "source_sentence": "若風調順，則無如向所說諸病。",
        "translation": "If the wind is tempered, there are no illnesses as described above.",
        "source": "T17n0721_066:0393c23_6"
    },
    {
        "source_sentence": "觀害骨風已，如實知身。",
        "translation": "After observing the wind that harms the bones, he knows his body as it really is.",
        "source": "T17n0721_066:0393c24_7"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0393c25_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0393c25_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰害精，住在身中，若不調順，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see a wind called harmful energy that abides in their bodies. If they don't comply, what will they do?",
        "source": "T17n0721_066:0393c26_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：害精風若不調順，誑惑於人，若人眠睡，戲弄於人，",
        "translation": "With the wisdom of hearing or with the divine eye they see: If a wind that harms energy blows and if it doesn’t go along with it, sexual misconduct deceives people. If someone sleeps and plays around with others,",
        "source": "T17n0721_066:0393c28_3"
    },
    {
        "source_sentence": "示人種種諸惡之念，以妄想心作非梵行。",
        "translation": "They show people various bad thoughts, and with deluded thoughts they engage in what's not the religious practice.",
        "source": "T17n0721_066:0393c29_4"
    },
    {
        "source_sentence": "風不調故，夜行鬼女虛誑破實，夢為其犯，令不憶食。",
        "translation": "Because the wind isn't regulating, nighttime ghosts and women who travel at night deceive people and break up real food, and in a dream they commit crimes so that they won't remember to eat.",
        "source": "T17n0721_066:0394a01_5"
    },
    {
        "source_sentence": "觀害精風已，如實知身。",
        "translation": "After observing the harmful wind of energy, he knows his body as it really is.",
        "source": "T17n0721_066:0394a03_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0394a04_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0394a04_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰皺風，住在身中，若不調順，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see a wind called wrinkled wind that abides in their bodies. If they aren't disciplined, what will they do?",
        "source": "T17n0721_066:0394a05_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼觀於皺風：若不調順，若足下足上、若[蹲-酋+(十\\/田\\/ㄙ)]若髀、若髖若背、若脇若乳、若咽若項、若肩若臂、若耳若眉一切身分皆悉皺減，",
        "translation": "If he observes the wrinkled wind with the wisdom of hearing or with the divine eye with the divine eye, if he doesn't regulate it, his body will all become wrinkled and diminished if he goes down from foot to foot, if he [crows - sheikh + (ten \\/ field \\/ embellishment)], if he walks on a leg, if he",
        "source": "T17n0721_066:0394a07_3"
    },
    {
        "source_sentence": "其身深皺，或開或合，其足尸破；",
        "translation": "Their bodies were deeply wrinkled, sometimes open and sometimes closed; their legs broke apart.",
        "source": "T17n0721_066:0394a10_4"
    },
    {
        "source_sentence": "設油塗身，尋即乾燥，令如老人。",
        "translation": "If he rubs oil on his body, it will dry up and become like an old man.",
        "source": "T17n0721_066:0394a11_5"
    },
    {
        "source_sentence": "觀皺風已，如實知身。",
        "translation": "After observing the wrinkled wind, he knows his body as it really is.",
        "source": "T17n0721_066:0394a12_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0394a13_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0394a13_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼觀見有風，名曰白髮，住在身中，若不調順，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, he observes that there's wind called white and abides in his body; if he doesn't comply, what will he do?",
        "source": "T17n0721_066:0394a14_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼觀：白髮風若不調順，能令少年髮白羸瘦猶如老人，",
        "translation": "With the wisdom of hearing or with the divine eye, they observe that white wind if it isn’t tempered, can cause youth to be white and weak like an old man.",
        "source": "T17n0721_066:0394a16_3"
    },
    {
        "source_sentence": "若在家人所生之子，如父速老，其子病故，無復子孕。",
        "translation": "If a child born in a householder's home is like a father who quickly grows old, and because his child is sick, there's no more child pregnant.",
        "source": "T17n0721_066:0394a18_0"
    },
    {
        "source_sentence": "以風力故，令年少者如老無異。",
        "translation": "Because of the power of wind, the young are no different from the old.",
        "source": "T17n0721_066:0394a19_1"
    },
    {
        "source_sentence": "是白髮風起於惡劫，隨諸眾生不順法行，風則增長。",
        "translation": "This white wind arises in a bad eon, following the actions of sentient beings who don't follow the Dharma, and the wind grows.",
        "source": "T17n0721_066:0394a19_2"
    },
    {
        "source_sentence": "若有福德，風則調順；",
        "translation": "If there is virtue, the wind will tame it.",
        "source": "T17n0721_066:0394a21_3"
    },
    {
        "source_sentence": "若無福德，風則不調。",
        "translation": "If there's no merit, the wind won't be tempered.",
        "source": "T17n0721_066:0394a21_4"
    },
    {
        "source_sentence": "觀白髮風已，如實知身。",
        "translation": "After observing the white wind, he knows his body as it really is.",
        "source": "T17n0721_066:0394a22_5"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0394a23_0"
    },
    {
        "source_sentence": "有何等風，或調不調，作何等業？",
        "translation": "What kind of wind does it have, or what kind of action does it do?",
        "source": "T17n0721_066:0394a23_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰損膩，住在身中，若不調順，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see a wind called damaged greasiness that abides in their bodies. If they don’t comply, what will they do?",
        "source": "T17n0721_066:0394a24_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼觀：損膩風若不調順，不憶飲食，令人衰弱，不憙膩食；",
        "translation": "They observe with the wisdom of hearing or with the divine eye: harming greedy wind and not being disciplined by it, not remembering food and drink, causing to weaken and not eating greedily.",
        "source": "T17n0721_066:0394a26_3"
    },
    {
        "source_sentence": "病之所起，因於晝寢。",
        "translation": "The cause of the illness was due to sleep during the daytime.",
        "source": "T17n0721_066:0394a27_4"
    },
    {
        "source_sentence": "風不調順，不樂甜食，嗜苦酢味；",
        "translation": "The wind is unruly and they do not enjoy sweet food or bitter and sour flavors.",
        "source": "T17n0721_066:0394a28_5"
    },
    {
        "source_sentence": "若不食膩，風則調順，身不疲極。",
        "translation": "If he doesn't eat grease, the wind will be gentle and his body won't be overcome with exhaustion.",
        "source": "T17n0721_066:0394a29_6"
    },
    {
        "source_sentence": "觀害膩風已，如實知身。",
        "translation": "After observing the harmful wind of greed, he knows his body as it really is.",
        "source": "T17n0721_066:0394a29_7"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0394b02_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0394b02_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有淋風住人身中，若不調順，為何所作？",
        "translation": "If they see with the wisdom of hearing or with the divine eye that there's a drenched wind in someone's body, what will they do if they aren't disciplined?",
        "source": "T17n0721_066:0394b03_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：淋病風若不調順，常多淋瀝，不能如意，身體無力，",
        "translation": "With the wisdom of hearing or with divine vision, they may see: They’re thirsty, sick, and windy. If they aren’t disciplined, they often drown and spit; they can’t do as they wish, and their bodies lack strength.",
        "source": "T17n0721_066:0394b05_0"
    },
    {
        "source_sentence": "其出入息麁濁不調，身色痿黃，羸瘦憔悴。",
        "translation": "His breathing and exhaling became coarse and uncontrolled, his body looked emaciated and yellow in color, and he was emaciated and exhausted.",
        "source": "T17n0721_066:0394b06_1"
    },
    {
        "source_sentence": "若風調順，則無如向所說諸病。",
        "translation": "If the wind is tempered, there are no illnesses as described above.",
        "source": "T17n0721_066:0394b07_2"
    },
    {
        "source_sentence": "觀淋風已，如實知身。",
        "translation": "After observing the drenched wind, he knows his body as it really is.",
        "source": "T17n0721_066:0394b08_3"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0394b09_0"
    },
    {
        "source_sentence": "有何等風，作何等業？",
        "translation": "What kind of wind is there and what kind of action does it do?",
        "source": "T17n0721_066:0394b09_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名食相應，若調不調，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see a wind associated with name and food. If it is tempered or unmatured, what does it do?",
        "source": "T17n0721_066:0394b10_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：食相應風若不調順，所食四分、五分之中三分歐吐，",
        "translation": "With the wisdom of hearing or with the divine eye they see: When the wind associated with nutriment is uncontrolled, four-fifths and one-third parts of that nutriment are vomited out.",
        "source": "T17n0721_066:0394b11_3"
    },
    {
        "source_sentence": "令人心亂，失於食力，不能視眴。",
        "translation": "They disturbed their minds and lost the power of eating, unable to look at the food.",
        "source": "T17n0721_066:0394b13_4"
    },
    {
        "source_sentence": "以風力故，意法不定。",
        "translation": "Because of the power of wind, mind and dharmas are indeterminate.",
        "source": "T17n0721_066:0394b14_5"
    },
    {
        "source_sentence": "若風調順，則無如向所說諸病。",
        "translation": "If the wind is tempered, there are no illnesses as described above.",
        "source": "T17n0721_066:0394b14_6"
    },
    {
        "source_sentence": "觀食相應風已，如實知身。",
        "translation": "After observing the wind associated with food, he knows his body as it really is.",
        "source": "T17n0721_066:0394b15_7"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0394b16_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0394b16_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名壞牙齒，住在身中，為何所作？",
        "translation": "With the wisdom of hearing, or with the divine eye, they see a wind called destroying teeth that lives in their body; what does it do?",
        "source": "T17n0721_066:0394b17_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：壞牙風若不調順，牙齒疼痛，毀壞墮落，齗中血爛，",
        "translation": "With the wisdom of hearing or with divine vision, they may see: If the wind breaks down their teeth and if they aren’t disciplined by it, their teeth hurt, disintegrate and fall apart, and blood rots in their gums.",
        "source": "T17n0721_066:0394b19_3"
    },
    {
        "source_sentence": "脣口生瘡，上腭生瘡，鼻塞不通。",
        "translation": "Their lips and mouths give rise to sores, their upper palates give rise to sores, and their noses are blocked and unable to pass.",
        "source": "T17n0721_066:0394b20_4"
    },
    {
        "source_sentence": "若風調順，則無如向所說諸病。",
        "translation": "If the wind is tempered, there are no illnesses as described above.",
        "source": "T17n0721_066:0394b21_5"
    },
    {
        "source_sentence": "觀壞牙齒風已，如實知身。",
        "translation": "After observing the destruction of teeth and wind, he knows his body as it really is.",
        "source": "T17n0721_066:0394b22_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0394b23_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0394b23_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰喉脈，住在身中，若不調順，為何所作？",
        "translation": "With the wisdom of hearing, or with the divine eye, they see a wind called the throat vein that lives in their body. If they aren't disciplined, what will they do?",
        "source": "T17n0721_066:0394b24_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：喉脈風若不調順，令咽項痛或咽喉腫，或其聲澁。",
        "translation": "With the wisdom of hearing, or with the divine eye they see: If the wind of the throat and veins aren't regulated, it causes pain in the neck and throat or swelling in the throat, or its sound is coarse.",
        "source": "T17n0721_066:0394b26_3"
    },
    {
        "source_sentence": "若風調順，則無如向所說諸病。",
        "translation": "If the wind is tempered, there are no illnesses as described above.",
        "source": "T17n0721_066:0394b28_4"
    },
    {
        "source_sentence": "觀喉脈風已，如實知身。",
        "translation": "After observing the wind of the throat and veins, he knows his body as it really is.",
        "source": "T17n0721_066:0394b28_5"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0394c01_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0394c01_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰下行，住在身中，或調不調，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see a wind called inferior conditioning that abides in their bodies or is tempered or unregulated; what does it do?",
        "source": "T17n0721_066:0394c02_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：下行風若不調順，令食過惡，力少不消。",
        "translation": "With the wisdom of hearing or with the divine eye they see: If the wind goes down and doesn't go along, it causes them to eat bad things that have little power and aren't digested.",
        "source": "T17n0721_066:0394c04_3"
    },
    {
        "source_sentence": "飲食消故，皮肉骨髓、精血增長；",
        "translation": "As a result of the disappearance of food and drink, skin, flesh, bones, marrow, semen, and blood increase.",
        "source": "T17n0721_066:0394c05_4"
    },
    {
        "source_sentence": "若食不消，風冷黃病，悉不調順。",
        "translation": "If he eats without being eliminated, or if he has a cold and yellow illness from wind, he won't be disciplined.",
        "source": "T17n0721_066:0394c06_5"
    },
    {
        "source_sentence": "是下行風若不調順，則失食力，食力少故，顏色憔悴。",
        "translation": "If the downward wind doesn't go along with it, they'll lose the power of eating, and because their power of eating is small, their appearance will be emaciated.",
        "source": "T17n0721_066:0394c07_6"
    },
    {
        "source_sentence": "若風調順，則無如向所說之病。",
        "translation": "If the wind is tempered, there won't be the illness described above.",
        "source": "T17n0721_066:0394c08_7"
    },
    {
        "source_sentence": "觀下行風已，如實知身。",
        "translation": "After observing the wind below, he knows his body as it really is.",
        "source": "T17n0721_066:0394c09_8"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0394c10_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0394c10_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰上行，住在身中，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see a wind called superior conditioning that abides in their body; what does it do?",
        "source": "T17n0721_066:0394c11_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：上行風住於頂上，若風調順，從頂而出，猶如煙氣，",
        "translation": "With the wisdom of hearing or with divine vision they see: The wind going upward stays above the top of the head. If the wind is harmonious, it comes out from the top of the head like smoke.",
        "source": "T17n0721_066:0394c13_3"
    },
    {
        "source_sentence": "從上而出，若住日中、若住陰中、若晝若夜常出不斷，凡人皆見。",
        "translation": "If he abides in the sun, abides in the aggregates, and always exits without stopping day or night, ordinary people will all see him.",
        "source": "T17n0721_066:0394c14_4"
    },
    {
        "source_sentence": "若風不調，則氣不出；",
        "translation": "If the wind isn’t regulated, then no breath comes out.",
        "source": "T17n0721_066:0394c16_5"
    },
    {
        "source_sentence": "若復頂氣斷已，三日不出，決定命終。",
        "translation": "If he again stops breathing at the top of his head and doesn't go out for three days, he'll surely die.",
        "source": "T17n0721_066:0394c16_6"
    },
    {
        "source_sentence": "觀上行風已，如實知身。",
        "translation": "After observing the wind above, he knows his body as it really is.",
        "source": "T17n0721_066:0394c17_7"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0394c19_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0394c19_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有傍風住在身中，若調不調，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see that there's a side wind abiding in their body, and if it's tempered or unregulated, what does it do?",
        "source": "T17n0721_066:0394c20_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見於傍風：若不調順，閉出入息，一切筋脈皆令掣縮，",
        "translation": "With the wisdom of hearing or with the divine eye, they see the wind at the side: If they aren’t disciplined, they shut their inhalation and exhalation, causing all their tendons and veins to contract.",
        "source": "T17n0721_066:0394c22_0"
    },
    {
        "source_sentence": "或聚或散、或牽或挽，或鼻瞤動，或淴淴作聲，後得大苦。",
        "translation": "Whether it's clustered, dispersed, drawn, pulled, or dragged, or with its nose twisted and shaken, or with its voice twisted and made to sound, great pain will follow.",
        "source": "T17n0721_066:0394c23_1"
    },
    {
        "source_sentence": "若傍風調順，則無如向所說之病。",
        "translation": "If the wind goes along with it, there won't be the illness described above.",
        "source": "T17n0721_066:0394c25_2"
    },
    {
        "source_sentence": "觀傍風已，如實知身。",
        "translation": "After observing the side wind, he knows his body as it really is.",
        "source": "T17n0721_066:0394c25_3"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0394c27_0"
    },
    {
        "source_sentence": "有何等風住在身中，或調不調，作何等業？",
        "translation": "What kind of wind does it have that abides in the body, or what kind of action does it do?",
        "source": "T17n0721_066:0394c27_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰轉筋，住在身中，若不調順，為何所作？",
        "translation": "With the wisdom of hearing or with the divine eye, they see a wind called twisting tendons that resides in their bodies. If they don't tame it, what will they do?",
        "source": "T17n0721_066:0394c28_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：轉筋風若不調順，令手筋脚筋、大小便筋、背筋、遍身諸筋皆悉捲并，",
        "translation": "With the wisdom of hearing or with the divine eye they see: If wind blows, and if it doesn’t go along with the wind, causing the tendons of the hands, legs, urinating, excreting, back, and all the tendons of the whole body to be rolled together.",
        "source": "T17n0721_066:0395a01_3"
    },
    {
        "source_sentence": "合為一處，堅急頑鈍，無所覺知。",
        "translation": "They are combined into one place, which is so steep and stubborn that they don't know anything.",
        "source": "T17n0721_066:0395a03_4"
    },
    {
        "source_sentence": "若風調順，則無如向所說諸病。",
        "translation": "If the wind is tempered, there are no illnesses as described above.",
        "source": "T17n0721_066:0395a04_5"
    },
    {
        "source_sentence": "觀轉筋風已，如實知身。",
        "translation": "After observing the wind of myriad winds, he knows his body as it really is.",
        "source": "T17n0721_066:0395a04_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0395a06_0"
    },
    {
        "source_sentence": "有何等風住在身中，若調不調，作何等業？",
        "translation": "What kind of wind abides in the body, and what kind of action does it do if it's regulated or unregulated?",
        "source": "T17n0721_066:0395a06_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰壞毛，住在身中，若調不調，為何所作？",
        "translation": "With the wisdom of hearing, or with the divine eye, they see a wind called hair loss that abides in their body. If it's tempered or unregulated, what does it do?",
        "source": "T17n0721_066:0395a07_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：壞毛風若不調順，一切身分所有諸毛皆悉墮落，",
        "translation": "With the wisdom of hearing or with the divine eye they see: If a wind breaks hair and doesn’t blow, all the hairs on all their bodies will fall off.",
        "source": "T17n0721_066:0395a09_3"
    },
    {
        "source_sentence": "身體痿黃，設更生毛，即隨墮落。",
        "translation": "Their bodies are emaciated and yellow, and if hair grows any longer, they'll fall down along with it.",
        "source": "T17n0721_066:0395a11_4"
    },
    {
        "source_sentence": "若風調順，則無如向所說之病。",
        "translation": "If the wind is tempered, there won't be the illness described above.",
        "source": "T17n0721_066:0395a11_5"
    },
    {
        "source_sentence": "觀壞毛風已，如實知身。",
        "translation": "After observing the destruction of hair and wind, he knows his body as it is.",
        "source": "T17n0721_066:0395a12_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0395a14_0"
    },
    {
        "source_sentence": "有何等風住在身中，若調不調，作何等業？",
        "translation": "What kind of wind abides in the body, and what kind of action does it do if it's regulated or unregulated?",
        "source": "T17n0721_066:0395a14_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名似少風，若風調順，為何所作？",
        "translation": "If they see a wind with the wisdom of hearing or with the divine eye, it's called seemingly little wind. If the wind is tempered, what does it do?",
        "source": "T17n0721_066:0395a15_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：似少風以調順故，十時風力，形貌色力、屈伸俯仰分分相似。",
        "translation": "With the wisdom of hearing or with the divine eye, they see: It's like a little wind because it's tempered, the power of wind at ten seasons, the power of form and shape in appearance, and the similarity of bend and down and upright parts.",
        "source": "T17n0721_066:0395a17_3"
    },
    {
        "source_sentence": "若風不調，於其身中心意流脈則便擾動，而發狂癡，心亂不正。",
        "translation": "If the wind doesn't regulate it, the mind and veins in the center of his body will be disturbed, and he'll become crazy and have a disordered mind.",
        "source": "T17n0721_066:0395a19_4"
    },
    {
        "source_sentence": "若其心意流脈調順，則不狂亂。",
        "translation": "If their minds, thoughts, and veins are disciplined, they won't go crazy.",
        "source": "T17n0721_066:0395a20_5"
    },
    {
        "source_sentence": "觀似少風已，如實知身。",
        "translation": "After observing the seemingly little wind, he knows his body as it really is.",
        "source": "T17n0721_066:0395a21_6"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0395a22_0"
    },
    {
        "source_sentence": "有何等風住在身中，若調不調，作何等業？",
        "translation": "What kind of wind abides in the body, and what kind of action does it do if it's regulated or unregulated?",
        "source": "T17n0721_066:0395a22_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名嗜睡眠，若不調順，為何所作？",
        "translation": "If they see a wind with the wisdom of hearing or with the divine eye, it's called addicted to sleep. If they aren't disciplined, what will they do?",
        "source": "T17n0721_066:0395a23_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：睡眠風若不調順，於聽法時，令人惽睡，聞不善法，",
        "translation": "With the wisdom of hearing or with divine vision they see: If a drowsy wind doesn’t go along with them, it causes them to sleep and hear unwholesome things while listening to the Dharma.",
        "source": "T17n0721_066:0395a25_0"
    },
    {
        "source_sentence": "心則樂聞；",
        "translation": "Their minds then delight in listening.",
        "source": "T17n0721_066:0395a26_1"
    },
    {
        "source_sentence": "若晝若夜欲正觀察，則為所亂，樂至酒肆。",
        "translation": "If he wants to observe it correctly day and night, then he'll be disturbed and happy to go to a wine store.",
        "source": "T17n0721_066:0395a26_2"
    },
    {
        "source_sentence": "若風調順，則無此病。",
        "translation": "If the wind is tempered, there will be no such illness.",
        "source": "T17n0721_066:0395a27_3"
    },
    {
        "source_sentence": "觀睡風已，如實知身。",
        "translation": "After observing the wind of sleep, he knows his body as it really is.",
        "source": "T17n0721_066:0395a28_4"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0395a29_0"
    },
    {
        "source_sentence": "有何等風住在身中，作何等業？",
        "translation": "What kind of wind is there in the body and what kind of action does it do?",
        "source": "T17n0721_066:0395a29_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰瞋風，住在身中，若不調順，為何所作？",
        "translation": "With the wisdom of hearing or with divine vision, they see a wind called the wind of anger that abides in their bodies. If they aren't disciplined, what will they do?",
        "source": "T17n0721_066:0395b01_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見：瞋恚風若不調順，以少因緣而起大瞋，為瞋所使，",
        "translation": "With the wisdom of hearing or with the divine eye they see: When the wind of hatred is uncontrolled, great hatred arises for a few reasons and is driven by hatred.",
        "source": "T17n0721_066:0395b03_3"
    },
    {
        "source_sentence": "一切世人起大瞋怒，身毛皆竪，心忪動亂，所見不了，以近為遠；",
        "translation": "All the people of the world became greatly angry and their hair stood on end. Their minds were agitated, and what they saw was unseen; nearby they thought it was far away.",
        "source": "T17n0721_066:0395b04_4"
    },
    {
        "source_sentence": "見於日月，生顛倒心，謂日為月，以月為日。",
        "translation": "When he sees the sun and moon, he gives rise to a mistaken thought that the sun is the moon and the moon is the day.",
        "source": "T17n0721_066:0395b06_5"
    },
    {
        "source_sentence": "若風調順，則無此病。",
        "translation": "If the wind is tempered, there will be no such illness.",
        "source": "T17n0721_066:0395b07_6"
    },
    {
        "source_sentence": "觀瞋風已，如實知身。",
        "translation": "After observing the wind of anger, he knows his body as it really is.",
        "source": "T17n0721_066:0395b07_7"
    },
    {
        "source_sentence": "「復次，修行者內身循身觀。",
        "translation": "“Furthermore, a practitioner observes the internal body as he follows the body.",
        "source": "T17n0721_066:0395b09_0"
    },
    {
        "source_sentence": "有何等風住在身中，作何等業？",
        "translation": "What kind of wind is there in the body and what kind of action does it do?",
        "source": "T17n0721_066:0395b09_1"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見有一風，名曰名字，若調不調，為何所作？",
        "translation": "If they see a wind called name with the wisdom of hearing or with the divine eye, what does it do if it's regulated or unregulated?",
        "source": "T17n0721_066:0395b10_2"
    },
    {
        "source_sentence": "彼以聞慧或以天眼見名字風：若其調順，能有言說，緣心數法，舌風言說，",
        "translation": "With the wisdom of hearing or with divine vision, they see names and winds: if they are harmonious, they can speak. They take mental factors as supporting object by means of awarenesses*!°; their tongue is spoken by means of [the sound] ‘by means of words’:",
        "source": "T17n0721_066:0395b11_3"
    },
    {
        "source_sentence": "隨心而行，能說無量名字句義。",
        "translation": "They act in accordance with mind and are able to teach infinite names, phrases, and meanings.",
        "source": "T17n0721_066:0395b13_4"
    },
    {
        "source_sentence": "如是舌說名字之風若不調順，則少言誤語或口瘖不語。",
        "translation": "Thus, if the wind that speaks words with tongues and names doesn't go along with it, then a little bit of false speech or verbal abuse won't be spoken.",
        "source": "T17n0721_066:0395b14_5"
    },
    {
        "source_sentence": "觀舌名字風已，如實知身。",
        "translation": "After observing the names and winds of the tongue, he knows his body as it really is.",
        "source": "T17n0721_066:0395b15_6"
    },
    {
        "source_sentence": "正法念處經卷第六十六",
        "translation": "Sutra of the Mindfulness of the True Dharma, Volume 66",
        "source": "T17n0721_066:0395b17_0"
    }
]