[
    {
        "source_sentence": "佛說懈怠耕者經",
        "translation": "Foshuo lazy plower jing",
        "source": "T17n0827_001:0870b03_0"
    },
    {
        "source_sentence": "宋沙門惠簡譯",
        "translation": "Song Dynasty Translation by the ascetic Huijian",
        "source": "T17n0827_001:0870b05_0"
    },
    {
        "source_sentence": "聞如是：一時佛在羅閱祇竹園中，與大比丘眾千二百五十人及眾菩薩俱。",
        "translation": "Thus I heard: One time, the Buddha was staying at Rājagṛha's bamboo grove, accompanied by a large congregation of one thousand two hundred and fifty monks and bodhisattvas.",
        "source": "T17n0827_001:0870b06_0"
    },
    {
        "source_sentence": "時佛從羅閱祇欲詣舍衛，諸菩薩導前，釋梵被服，又見身體如四天王，",
        "translation": "When the Buddha was about to go from Rājagṛha to Śrāvastī, the bodhisattvas led him before them. The god Brahmā, dressed in robes, also saw his body like that of the four heavenly kings.",
        "source": "T17n0827_001:0870b07_1"
    },
    {
        "source_sentence": "諸比丘僧悉從佛後，諸天、龍、神在上供養。",
        "translation": "The monks and nuns all followed the Buddha, and gods, dragons, and spirits came up to make offerings.",
        "source": "T17n0827_001:0870b09_2"
    },
    {
        "source_sentence": "去城不遠，時有一人在田耕種，遙見如來弟子侍從，端正殊妙，威神巍巍，",
        "translation": "Not far from the city, however, there was a man cultivating his fields. From a distance he saw the Tathāgata’s disciples attending him. They were very handsome and marvelous in appearance, endowed with majestic majesty.",
        "source": "T17n0827_001:0870b10_3"
    },
    {
        "source_sentence": "容貌殊好如星中月，奇相眾好，金光從容，三十二相皆出眾好。",
        "translation": "The thirty-two marks of great beauty emanated from their bodies like the moon in a constellation. They possessed all the extraordinary features and embellishments that are found in celestial objects. The golden light extended down to their chests, and each of the thirty-two marks produced all the secondary signs.",
        "source": "T17n0827_001:0870b11_4"
    },
    {
        "source_sentence": "遙見世尊，心便歡喜，欲往詣佛稽首作禮，諮受法義。",
        "translation": "Seeing the World-honored One from a distance, he was delighted and wished to visit the Buddha. He bowed his head in respect and asked him about the doctrine of the Dharma.",
        "source": "T17n0827_001:0870b13_5"
    },
    {
        "source_sentence": "「佛世難值，時時一現。」",
        "translation": "It's difficult to meet a buddha in the world, and it appears one time at a time.",
        "source": "T17n0827_001:0870b14_6"
    },
    {
        "source_sentence": "退自念言：「耕地未竟、下種未畢，須後閑時乃當見佛。」",
        "translation": "He withdrew and thought to himself, The field hasn't been plowed and the seeds haven't been planted; it's necessary to see the Buddha at a later time of leisure.",
        "source": "T17n0827_001:0870b15_7"
    },
    {
        "source_sentence": "時佛知心發此懈怠，世尊便笑，放五色光，光從口出照十方境界，安隱五道，",
        "translation": "Knowing that the Buddha’s mind had become lazy, the World-honored One smiled and emitted a five-colored ray of light. The light emanating from his mouth illumined all directions, enabling him to enter peacefully into the five realms of rebirth.",
        "source": "T17n0827_001:0870b16_8"
    },
    {
        "source_sentence": "皆乘光來集會佛所——地獄休息、餓鬼飽滿、畜生思善、人民求度、諸天龍神神聽道法。",
        "translation": "They all came to assemble at the Buddha's place with their light-the hells rest, hungry ghosts are full, animals think well, people seek salvation, and gods, dragons, spirits, and goddesses hear the teaching of the path.",
        "source": "T17n0827_001:0870b18_9"
    },
    {
        "source_sentence": "賢者阿難解了七應——義、法、時、節、身與他人——即詣佛所，長跪叉手，",
        "translation": "Good man, when the venerable Ānanda understood the meaning of the seven kinds of response-the teaching, the Dharma, the time, the season, the body, and others-then he approached the Buddha, knelt down with his palms joined.",
        "source": "T17n0827_001:0870b20_10"
    },
    {
        "source_sentence": "白佛言：「何因笑？",
        "translation": "He said to the Buddha, What's the reason for laughing?",
        "source": "T17n0827_001:0870b21_11"
    },
    {
        "source_sentence": "既笑，會當有意。」",
        "translation": "Since you're laughing, it will be intentional.",
        "source": "T17n0827_001:0870b21_12"
    },
    {
        "source_sentence": "佛告阿難：「汝見犁者不？」",
        "translation": "The Buddha told Ānanda, Do you see the plow?",
        "source": "T17n0827_001:0870b22_13"
    },
    {
        "source_sentence": "對曰：「已見。」",
        "translation": "He replied, I've seen it.",
        "source": "T17n0827_001:0870b22_14"
    },
    {
        "source_sentence": "佛言：「是人從維衛佛已來九十一劫於是耕種，每一見佛常自懈怠選軟，",
        "translation": "The Buddha said: For ninety-one cosmic aeons since the time of Vimalakīrti, this man has been plowing and sowing his fields. Every one of them have seen that the Buddha is always lazy and selectively weak.",
        "source": "T17n0827_001:0870b23_15"
    },
    {
        "source_sentence": "復後怱怱耕種生死罪法，不識法犁種無極田。",
        "translation": "Furthermore, they cultivate the sins of birth-and-death and don't know the rules for plowing the limitless field.",
        "source": "T17n0827_001:0870b24_16"
    },
    {
        "source_sentence": "已過六佛不得蒙度，於今見我，適發好心即便變悔，欲故懈怠，樂種罪根。」",
        "translation": "Having passed beyond the six buddhas, they won't be liberated, and now when they see me, they immediately change their good intentions and repent, become lazy because of desire, and delight in planting the roots of sin.",
        "source": "T17n0827_001:0870b25_17"
    },
    {
        "source_sentence": "時人遙聞，棄耕及田，來詣佛所稽首佛足，悔過自責：「愚癡無知，罪過甚重，",
        "translation": "The people then heard from a distance that they abandoned their fields and went to the Buddha’s place. Having bowed at his feet, they repented of their sins and reproached themselves by saying, “We are ignorant and ignorant.",
        "source": "T17n0827_001:0870b27_18"
    },
    {
        "source_sentence": "願見愍傷，原其罪過。",
        "translation": "I pray to be pitied and punished for my sins.",
        "source": "T17n0827_001:0870b29_19"
    },
    {
        "source_sentence": "蒙冥觝突，懈怠來久，唯見原恕，濟脫生死。」",
        "translation": "It's been a long time since I've been lazy and lazy, but I've only seen the original forgiveness to save me from birth and death.",
        "source": "T17n0827_001:0870b29_20"
    },
    {
        "source_sentence": "佛言：「善哉。",
        "translation": "The Buddha said, Good!",
        "source": "T17n0827_001:0870c01_21"
    },
    {
        "source_sentence": "卿能覺者，於法有益，終不為損。」",
        "translation": "If you can awaken, it's beneficial to the Dharma and never harmful.",
        "source": "T17n0827_001:0870c01_22"
    },
    {
        "source_sentence": "佛為說經，示懈怠之垢、精進之利，踴躍歡喜，立不退轉。",
        "translation": "The Buddha preached the sutra for them, revealing the defilement of laziness and the benefits of exertion. They were overjoyed and established in nonregression.",
        "source": "T17n0827_001:0870c02_23"
    },
    {
        "source_sentence": "諸天、龍、神無央數千皆發無上正真道意。",
        "translation": "Countless thousands of gods, dragons, and spirits all aroused the intention for the unsurpassed true path.",
        "source": "T17n0827_001:0870c03_24"
    },
    {
        "source_sentence": "「以故，學道常當精進，莫為懈怠，宛轉生死，動有劫數。」",
        "translation": "Because of this, you should always make effort to train in the path; don't be lazy, for there are eons when you're going through birth and death.",
        "source": "T17n0827_001:0870c04_25"
    },
    {
        "source_sentence": "佛說如是，賢者阿難，諸天、龍、神、阿須倫王，聞經歡喜，作禮而退。",
        "translation": "Good man, Ānanda, the gods, nāgas, yakṣa spirits, and asura kings who heard this sutra were delighted. They bowed their heads in reverence and withdrew.",
        "source": "T17n0827_001:0870c06_0"
    },
    {
        "source_sentence": "佛說懈怠耕者經",
        "translation": "Foshuo lazy plower jing",
        "source": "T17n0827_001:0870c08_0"
    }
]