[
    {
        "source_sentence": "佛說演道俗業經",
        "translation": "Foshuo演道俗業經佛說演道俗業經,",
        "source": "T17n0820_001:0834a16_0"
    },
    {
        "source_sentence": "乞伏秦沙門釋聖堅譯",
        "translation": "Translated by the Qifuqin ascetic Shi Shengjian",
        "source": "T17n0820_001:0834a18_0"
    },
    {
        "source_sentence": "聞如是：一時，佛在舍衛國祇樹給孤獨園，與大比丘眾千二百五十，菩薩無數，",
        "translation": "Thus I have heard: One time, when the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī, accompanied by one thousand two hundred and fifty great bhikṣus and countless bodhisattvas,",
        "source": "T17n0820_001:0834a19_0"
    },
    {
        "source_sentence": "四輩之眾，天、龍、鬼神、阿須倫會。",
        "translation": "The four groups of the assembly were gods, dragons, ghosts, and asuras.",
        "source": "T17n0820_001:0834a20_1"
    },
    {
        "source_sentence": "時，給孤獨氏與五百居士出舍衛城行詣佛所，稽首足下却坐一面。",
        "translation": "At the time, Anāthapiṇḍika and five hundred householders left Śrāvastī to go to the Buddha's place, bowed their heads at his feet, and withdrew to sit at one side.",
        "source": "T17n0820_001:0834a21_2"
    },
    {
        "source_sentence": "叉手問佛：「居處治家財有幾輩？",
        "translation": "He saluted the Buddha with his palms together and asked, How many groups of people live in a householder's property?",
        "source": "T17n0820_001:0834a23_0"
    },
    {
        "source_sentence": "出家修道行異同乎？",
        "translation": "Is the practice of renunciation and cultivation different from the same?",
        "source": "T17n0820_001:0834a23_1"
    },
    {
        "source_sentence": "當奉何法疾成無上正真之道？",
        "translation": "What teaching should we follow to quickly achieve the unsurpassed true path?",
        "source": "T17n0820_001:0834a24_2"
    },
    {
        "source_sentence": "復以何宜化眾生耶？」",
        "translation": "How is it appropriate to transform sentient beings?",
        "source": "T17n0820_001:0834a24_3"
    },
    {
        "source_sentence": "佛言：「善哉問也。",
        "translation": "The Buddha said, Good, good question.",
        "source": "T17n0820_001:0834a25_4"
    },
    {
        "source_sentence": "開發曈曚將來學施。」",
        "translation": "In the future, he'll cultivate generosity.",
        "source": "T17n0820_001:0834a25_5"
    },
    {
        "source_sentence": "佛言：「財有三輩：一曰下財；",
        "translation": "The Buddha said: There are three classes of wealth:",
        "source": "T17n0820_001:0834a26_6"
    },
    {
        "source_sentence": "二曰中財；",
        "translation": "The second is middle wealth.",
        "source": "T17n0820_001:0834a26_7"
    },
    {
        "source_sentence": "三曰上財。",
        "translation": "Three, it's called superior possessions.",
        "source": "T17n0820_001:0834a27_8"
    },
    {
        "source_sentence": "何謂下財？",
        "translation": "What's meant by inferior possessions?",
        "source": "T17n0820_001:0834a27_9"
    },
    {
        "source_sentence": "有人治產積聚錢財，不敢衣食，不修經戒，不能孝順供養二親，不樂隨時給足妻子，",
        "translation": "Suppose there is a person who controls his wealth and accumulates money, does not dare to provide food or clothing, does not practice the precepts of Buddhism, is unable to serve and support his two relatives with filial piety, and does not delight in providing for his wife and children at any time.",
        "source": "T17n0820_001:0834a27_10"
    },
    {
        "source_sentence": "欲其消息充饒飽賜，奴客、徒使衣裁蔽形、食係口腹，抱愚守惜如蜂愛蜜。",
        "translation": "Wishing to satisfy them with their news, the slaves and messengers cut off their robes and eat from their mouths and bellies, embracing foolish people and cherishing it like bees craving honey.",
        "source": "T17n0820_001:0834a29_11"
    },
    {
        "source_sentence": "不信先聖，不奉高士、沙門、道人，不好布施種福為德。",
        "translation": "They don't believe in the virtues of former sages, don't venerate high men, ascetics, or religious people, and don't give generously to the seeds of merit.",
        "source": "T17n0820_001:0834b02_12"
    },
    {
        "source_sentence": "心自計常，不慮對至——合者必散、禍福自追。",
        "translation": "The mind imagines itself to be permanent, and it doesn't think about opposing it - the conjunction will surely disperse, and misfortune and fortune will chase after themselves.",
        "source": "T17n0820_001:0834b03_13"
    },
    {
        "source_sentence": "貪慕身地不覺惱恨，咄嗟沒過入泥黎門。",
        "translation": "They covet their bodily state and don't feel anger, and they go into the door of Nirmāṇarati without offending it.",
        "source": "T17n0820_001:0834b04_14"
    },
    {
        "source_sentence": "其身緣食四大虺盛，神寄其中假號為名，羸弱猶化危脆不固，不解非常倚世之榮，",
        "translation": "Their bodies are conditioned by the food of the four great debilitating hindrances, and their spirits entrust to them nominal names as names. Weakened, still transformed, invulnerable, fragile, and unsteady, they don't understand the eternal glory of worldly dependence.",
        "source": "T17n0820_001:0834b05_15"
    },
    {
        "source_sentence": "心懷萬憂，謂亦長生，心存吾我，不達悉空。",
        "translation": "The mind harbors all kinds of sorrow, meaning that it's also long-lived, and the mind retains self and doesn't comprehend emptiness.",
        "source": "T17n0820_001:0834b07_16"
    },
    {
        "source_sentence": "三界尚虛，況人、物乎？",
        "translation": "The three realms are still empty, so why wouldn't people and things?",
        "source": "T17n0820_001:0834b08_0"
    },
    {
        "source_sentence": "汲汲迭惑——貪、婬、嫉妬。",
        "translation": "Accumulated and accumulated are the secondary mental disturbances - greed, hatred and jealousy.",
        "source": "T17n0820_001:0834b08_1"
    },
    {
        "source_sentence": "「如斯行者，奉養父母安和至心，出辭還返不失顏色，晨定暮省小心翼翼，",
        "translation": "“Those who practice in this way honor their parents with a mind of peace and harmony, leaving home and returning home without losing their appearance, being cautious in morning and evening meditations.",
        "source": "T17n0820_001:0834b09_0"
    },
    {
        "source_sentence": "念二親恩而無窮極，給足妻子應時衣食，恩情歸流與共同歡，妻子如是也終無私行，",
        "translation": "Being mindful of the kindnesses of his two relatives without limit, he provides for his wife and children with food and clothing at the right time, returns to their common joy with kindness, and never does anything privately.",
        "source": "T17n0820_001:0834b10_1"
    },
    {
        "source_sentence": "瞻視奴客、眷屬、徒使不令飢乏。",
        "translation": "They look out for their slaves, guests, retinues, and messengers so they won't starve.",
        "source": "T17n0820_001:0834b12_2"
    },
    {
        "source_sentence": "不信死後當復更生，謂死滅盡歸於無形。",
        "translation": "They do not believe that they will be reborn again after death. That is to say, when death ceases, it returns to formlessness.",
        "source": "T17n0820_001:0834b13_3"
    },
    {
        "source_sentence": "供孝所生念乳養恩，給足妻子戀恩愛情，瞻視僕使欲得其力，不能奉敬沙門、道人，",
        "translation": "Because of their filial piety, they give birth to thoughts of milk and nurturing kindness, provide for their wives and children with love and affection, look after their servants in order to attain their strength, and fail to honor the ascetics and religious practitioners.",
        "source": "T17n0820_001:0834b14_4"
    },
    {
        "source_sentence": "不肯行善布恩施德，後當得福與眾殊特，是謂中財。」",
        "translation": "If someone refuses to perform good acts of kindness and generosity and will later attain merit and extraordinary qualities, this is called middle wealth.",
        "source": "T17n0820_001:0834b16_5"
    },
    {
        "source_sentence": "「常能念乳養，　　孝順供二親，",
        "translation": "They are always mindful of the nurturing of milk, honoring and serving their two parents.",
        "source": "T17n0820_001:0834b17_6"
    },
    {
        "source_sentence": "　給足其妻子，　　隨時不失節；",
        "translation": "They provide for their wives and children at all times without losing moderation.",
        "source": "T17n0820_001:0834b17_6"
    },
    {
        "source_sentence": "　奴客及徒使，　　慰勞不加惡，",
        "translation": "Their slaves, guests, and messengers are comforted and not harmed.",
        "source": "T17n0820_001:0834b17_6"
    },
    {
        "source_sentence": "　下侍皆順從，　　遣行不違教。",
        "translation": "The attendants all complied, sending off the practice without disobeying the teaching.",
        "source": "T17n0820_001:0834b17_6"
    },
    {
        "source_sentence": "　不信後世生，　　聞之驚不喜，",
        "translation": "They won’t believe in future generations, and when they hear it, they’re frightened and disillusioned.",
        "source": "T17n0820_001:0834b17_6"
    },
    {
        "source_sentence": "　自計身有常，　　長存不終亡。",
        "translation": "They think their bodies are eternal, Abiding for a long time without dying out.",
        "source": "T17n0820_001:0834b17_6"
    },
    {
        "source_sentence": "　三界如幻化，　　當識此辭章，",
        "translation": "The three realms are like illusions, so you should recognize this chapter of the discourse.",
        "source": "T17n0820_001:0834b17_6"
    },
    {
        "source_sentence": "　己所為罪福，　　從本而受之。」",
        "translation": "What's his own sin and merit, he receives it from the source.",
        "source": "T17n0820_001:0834b17_6"
    },
    {
        "source_sentence": "佛於是頌曰：佛復告長者：「上財業者，謂其人若有財寶能自衣食，孝順父母不失時節，",
        "translation": "The Buddha then composed the following verse: Again, the Buddha said to the wealthy merchant:",
        "source": "T17n0820_001:0834b17_6"
    },
    {
        "source_sentence": "恒瞻顏色不令懷慼，出不犯禁入不違禮，造行清白不使污染，恭敬尊長謙遜智者，",
        "translation": "They always look at their appearance and don’t let them harbor ill-will. They go forth without violating the precepts or entering without disobedience. They conduct themselves in a pure and white way so as not to pollute others. They venerate those who are noble, upright, humble, and wise.",
        "source": "T17n0820_001:0834b27_7"
    },
    {
        "source_sentence": "啟受博聞等心不邪，下劣貧厄咸蒙仗荷，給贍妻子常令備豐，除諸邪念修以正治，",
        "translation": "He inspires the minds of well-versed people and so forth to be without error, bearing the burden of war on the inferior and the poor in all their miseries. Giving support to his wife and children always makes them abundant, he removes thoughts of error and cultivates righteousness as a remedy.",
        "source": "T17n0820_001:0834b29_8"
    },
    {
        "source_sentence": "消息奴使不令窮匱，不妄撾罵加之慈愍，奉敬先聖、至學、正士、出家順法沙門賢明，",
        "translation": "They do not let their servants and messengers be destitute, they do not harm or abuse them. They are kind and compassionate, honoring the ancient sages, the supreme learners, the correct scholars, renunciants, Buddhist ascetics, and śramaṇas who have renounced the world in order to follow the Dharma.",
        "source": "T17n0820_001:0834c02_9"
    },
    {
        "source_sentence": "夙夜行禮不失其意，布施所乏使成道德，恣講經典并化癡冥，以善方便不失其時，",
        "translation": "They performed rituals at all times of the day and night without losing their minds. Giving what they did not need to cultivate virtue, they taught scriptures freely and converted the ignorant and deluded. By means of skillful means they did not lose time.",
        "source": "T17n0820_001:0834c04_10"
    },
    {
        "source_sentence": "自安護彼一切眾生。",
        "translation": "They themselves will protect all those sentient beings.",
        "source": "T17n0820_001:0834c06_11"
    },
    {
        "source_sentence": "猶如牸牛食蒭出乳，乳出酪，酪出酥，酥出醍醐，醍醐最柔特妙。",
        "translation": "It's like when a cow eats milk that produces milk, which produces curds, cream that produces butter, and ghee that produces clarified butter, whose clarified butter is the most delicate and subtle.",
        "source": "T17n0820_001:0834c06_12"
    },
    {
        "source_sentence": "其自安身愍哀十方，多所慈念、多所安隱，諸天人民皆得蒙度。",
        "translation": "Because of his compassion and pity for the gods in the ten directions, he had many thoughts of kindness and peacefulness, and all the gods and people were liberated.",
        "source": "T17n0820_001:0834c08_13"
    },
    {
        "source_sentence": "是人最尊無上無比，為無儔匹、為世大雄，獨步無侶。」",
        "translation": "That person is the most honored, unsurpassed, and incomparable, without equal or worldly great hero, and he walks alone without companions.",
        "source": "T17n0820_001:0834c09_14"
    },
    {
        "source_sentence": "「若有眾財業，　　以自好衣食；",
        "translation": "“Suppose there is a wealthy business that provides for its own goods, such as clothing and food.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　供養孝父母，　　不失其顏色。",
        "translation": "They'll make offerings to their filial parents without losing their appearance.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　出遊不犯禁，　　還返不違禮；",
        "translation": "When going out and coming back, they don’t violate the precepts, And when returning home they don’t disrespect others.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　造行常清白，　　順法不荒迷。",
        "translation": "Their deeds are always pure and white, following the Dharma without confusion.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　供敬奉尊長，　　謙遜明智者，",
        "translation": "Venerable and venerable, humble and wise, they offer their respects to you.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　啟受博聞士，　　等心不慕邪。",
        "translation": "To inspire learned people who are well-versed, they don't crave equality in their minds.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　隨時給妻子，　　各令得其所，",
        "translation": "Give them to their wives and children at the appropriate time, And let them each get their places.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　慈賜奴僕使，　　衣食常豐足。",
        "translation": "They are kindly given to slaves, servants, and messengers, and their clothing and food are always abundant.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　奉沙門學士，　　布施授供養，",
        "translation": "He honored the śramaṇas, scholars, and bodhisattvas by bestowing gifts and offerings.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　從受深妙法，　　棄捐癡聾盲。",
        "translation": "Accepting the profound and marvelous teaching from him, he abandoned his delusion and deafness.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　愍傷十方人，　　不獨為身行，",
        "translation": "I pity the people of the ten directions, not just for their physical actions.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　常自安其已，　　亦解一切厄。",
        "translation": "After always settling himself, he also understands all the troubles.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　譬如酥醍醐，　　本從蒭草出，",
        "translation": "It's like the cream of ghee that originally comes out of dry grass.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　既可用安身，　　身和無疾疹。",
        "translation": "Since you can be at ease, your body will be harmonious and free of ailments.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　普哀眾生類，　　其心常平一，",
        "translation": "They have compassion for all sentient beings, Their minds always unified.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "　以是四等行，　　速逮成至佛。」",
        "translation": "Because of these four kinds of practices, he quickly attains buddhahood.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「出家修道學有三品：一曰聲聞；",
        "translation": "The Buddha then continued in verse: The Buddha said to the wealthy householders, “There are three kinds of people who have renounced domestic life and practiced Buddhism.",
        "source": "T17n0820_001:0834c10_15"
    },
    {
        "source_sentence": "二曰緣覺；",
        "translation": "The second is pratyekabuddha.",
        "source": "T17n0820_001:0834c27_16"
    },
    {
        "source_sentence": "三曰大乘。",
        "translation": "The third is the great vehicle.",
        "source": "T17n0820_001:0834c28_17"
    },
    {
        "source_sentence": "何謂聲聞？",
        "translation": "By what are śrāvakas meant?",
        "source": "T17n0820_001:0834c28_18"
    },
    {
        "source_sentence": "畏苦厭身，思無央數生死之難、周旋之患視身如怨，四大猶虺、五陰處賊，",
        "translation": "Fearing painful and disgusted bodies, they think of the difficulties of birth and death in measureless numbers and the dangers of circumference. They look upon their bodies as if they were enemies. The four elements are like thieves and the five aggregates are like thieves.",
        "source": "T17n0820_001:0834c28_19"
    },
    {
        "source_sentence": "坐禪數息安般守意，觀身惡露不淨之形，畏色欲本——痛、想、行、識，",
        "translation": "He sat in meditation, repeatedly calming his breath and guarding his thoughts, observing the body as bad and impure forms that are exposed, fearing form and desire as the root of pain, perception, volition, and consciousness.",
        "source": "T17n0820_001:0835a01_20"
    },
    {
        "source_sentence": "怖地獄苦、餓鬼之厄、畜生惱結、人中之難、天上別離，不可稱計、輪轉無休如獄中囚，",
        "translation": "They fear the suffering of hell, the miseries of hungry ghosts, the bonds of anguish in animals, the difficulties among humans, the separations in heaven, and the uncountable cycles of transmigration like prisoners.",
        "source": "T17n0820_001:0835a02_21"
    },
    {
        "source_sentence": "欲斷生死勤勞之罪，求無為樂泥洹之安。",
        "translation": "They want to end the sins of birth-and-death and diligence and seek the peace of nonproductivity and happiness in nirvāṇa.",
        "source": "T17n0820_001:0835a04_22"
    },
    {
        "source_sentence": "但自為己不念眾生，常執小慈不興大哀，倚于音聲不解空慧，三界猶幻，",
        "translation": "But for their own sake they do not think of sentient beings. They always cling to inferior kindness and do not give rise to great compassion. Relying on sounds, they do not understand the wisdom of emptiness. The three realms are like illusions.",
        "source": "T17n0820_001:0835a05_23"
    },
    {
        "source_sentence": "趣自濟己不顧恩慈，是為聲聞學。」",
        "translation": "To aspire to self- relief and not rely on kindness is the śrāvaka training.",
        "source": "T17n0820_001:0835a07_24"
    },
    {
        "source_sentence": "「畏無量生死，　　周旋之艱難，",
        "translation": "“Frightened by measureless births and deaths, Surrounded by hardships and difficulties,",
        "source": "T17n0820_001:0835a07_25"
    },
    {
        "source_sentence": "　心已懷恐懼，　　唯欲求自安。",
        "translation": "Their minds are already frightened, and they only want to find their own peace.",
        "source": "T17n0820_001:0835a07_25"
    },
    {
        "source_sentence": "　坐禪而數息，　　專精志安般，",
        "translation": "He sat in meditation and counted his breaths, concentrating his energy on calming himself.",
        "source": "T17n0820_001:0835a07_25"
    },
    {
        "source_sentence": "　觀身中惡露，　　不淨有若干。",
        "translation": "Observing the bad dew in the body, there are several kinds of impure ones.",
        "source": "T17n0820_001:0835a07_25"
    },
    {
        "source_sentence": "　棄捐三界色，　　斷欲得自安，",
        "translation": "Abandoning form in the three realms, he stops desire and attains self-confidence.",
        "source": "T17n0820_001:0835a07_25"
    },
    {
        "source_sentence": "　不能修大慈，　　唯志樂泥洹。」",
        "translation": "They can't cultivate great kindness but only aspire to nirvāṇa.",
        "source": "T17n0820_001:0835a07_25"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「緣覺者，本發大意為菩薩業，布施、持戒、忍辱、精進、一心、智慧，",
        "translation": "The Buddha then composed the following verse: The Buddha said to the householder pratyekabuddha: Originally a bodhisattva undertook great effort in order to accomplish the deeds of enlightening beings, such as generosity, observance of precepts, patience, effort, concentration, singlemindedness of mind, and wisdom.",
        "source": "T17n0820_001:0835a07_25"
    },
    {
        "source_sentence": "以用望想求為尊豪，天上、天下咸令自歸，三十二相八十種好，威神德重巍巍堂堂無能及者。",
        "translation": "He seeks to be honored as a noble person because of his hopes and perceptions, so that the gods and worlds will all take refuge in him, with thirty-two features and eighty kinds of beauty, authoritative qualities, great dignity, and majestic halls unsurpassed by anyone.",
        "source": "T17n0820_001:0835a16_26"
    },
    {
        "source_sentence": "不解如來色身所現，因世愚人不識大道，斷生死流不能反原，盡生死本故為現身，",
        "translation": "They do not understand that the physical body of Buddha is manifested in form. Because the ignorant people of the world do not know the path of enlightenment, they cut off the stream of transmigration and cannot turn it back. Because they have destroyed the root cause of transmigration, they show their bodies.",
        "source": "T17n0820_001:0835a18_27"
    },
    {
        "source_sentence": "相好嚴容、文辭言教以化愚冥顯示大明，及著相好謂審有色像。",
        "translation": "Their appearance is beautiful and adorned, their words are spoken and taught in order to transform the ignorant and show great insight, and they're attached to characteristics that are defined as colored images.",
        "source": "T17n0820_001:0835a20_28"
    },
    {
        "source_sentence": "雖行四等、四恩、六度無極、三十七品，觀十二緣欲拔其原，不解本無，",
        "translation": "Even though they practice the four kinds of equanimity, the four kinds of kindness, the six perfections without limit, and the thirty-seven qualities, they contemplate twelve conditions to remove their roots and don’t understand that they are originally nonexistent.",
        "source": "T17n0820_001:0835a22_29"
    },
    {
        "source_sentence": "悕望大道；",
        "translation": "I look forward to the great path.",
        "source": "T17n0820_001:0835a23_30"
    },
    {
        "source_sentence": "正使積德如虛空界，不得至佛。",
        "translation": "It's precisely because the accumulation of virtue is like the space realm that they can't reach Buddhahood.",
        "source": "T17n0820_001:0835a23_31"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T17n0820_001:0835a24_32"
    },
    {
        "source_sentence": "用不達故。",
        "translation": "It's because their function isn't comprehended.",
        "source": "T17n0820_001:0835a24_33"
    },
    {
        "source_sentence": "何謂不達？",
        "translation": "What's meant by not comprehending?",
        "source": "T17n0820_001:0835a25_34"
    },
    {
        "source_sentence": "布施、持戒、忍辱、精進、一心、智慧、四等、四恩有所悕望，念救一切五趣生死，",
        "translation": "“Great enlightening beings practice generosity, observance of precepts, patience, effort, concentration, singlemindedness of mind, wisdom, and the four kinds of benevolence. They have longing for all kinds of blessings, and they are intent on saving all sentient beings from the five states of birth and death.",
        "source": "T17n0820_001:0835a25_35"
    },
    {
        "source_sentence": "解空、無想、不願諸法，曉一切法如幻、化、夢、野馬、影響、芭蕉、泡沫皆無所有，",
        "translation": "Understanding the teachings of emptiness, nonconception, and wishlessness, they understand that all things are like illusions, transformations, dreams, wild horses, influences, plantains, and bubbles have no existence.",
        "source": "T17n0820_001:0835a26_36"
    },
    {
        "source_sentence": "道慧無形等如虛空，無所增壞普度眾生。」",
        "translation": "The wisdom of the path has no form like space, and nothing increases or decreases to save sentient beings.",
        "source": "T17n0820_001:0835a28_37"
    },
    {
        "source_sentence": "「本發菩薩意，　　志慕大乘業，",
        "translation": "Originally arousing the bodhisattva’s aspiration, He cherished the great vehicle practice.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "　但欲著佛身，　　不了無適莫。",
        "translation": "They simply want to attach themselves to the Buddha's body, but they don't understand it without adapting.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "　布施戒忍辱、　　精進禪息智，",
        "translation": "Their generosity, morality, tolerance, forbearance, effort, meditation, and wisdom.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "　四等恩六度，　　惟己樂無為；",
        "translation": "The four kinds of benevolence and the six perfections Are only for one’s own enjoyment, being unconditioned.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "　慕三十二相，　　八十好巍巍，",
        "translation": "They admire the thirty-two marks, The eighty secondary signs of greatness.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "　天上天下尊，　　脫五陰六衰。",
        "translation": "The gods and the world-honored ones are freed from the five aggregates and six degenerations.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "　但察其麁事，　　不能觀深微，",
        "translation": "They merely observe the gross things, Yet they cannot contemplate the subtle.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "　雖欲度十方，　　心口自相違。",
        "translation": "Even though they want to cross over to the ten directions, their minds and mouths are at odds with each other.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "　不了如幻化、　　水沫泡野馬、",
        "translation": "They don’t understand like illusions, Like bubbles of water and wild horses.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "　芭蕉如夢影，　　妄想甚眾多。",
        "translation": "The plantain is like the shadow of a dream, with many deluded thoughts.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "　正使作功德，　　猶如江河沙，",
        "translation": "The envoy's merit is like the sand of a river.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "　心懷無上真，　　不解除眾魔。」",
        "translation": "He harbors the unsurpassed truth in his mind and doesn't free himself from Māra.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「其大乘學，發無上正真道意，行于大慈等如虛空，",
        "translation": "The Buddha then composed the following verse: The Buddha said to the householders, “Those who study Mahayana teachings give rise to the thought of the supreme true path and practice great benevolence like space.",
        "source": "T17n0820_001:0835a29_38"
    },
    {
        "source_sentence": "而修大悲無所適莫，不自憂身但念五趣一切眾生普欲使安，奉四等心——慈、悲、喜、護，",
        "translation": "He cultivates great compassion and has no place for it. He does not grieve over his own body but thinks of all sentient beings in the five realms of rebirth, wishing to make them at ease. He dedicates himself to the four kinds of mind:",
        "source": "T17n0820_001:0835b14_39"
    },
    {
        "source_sentence": "惠施仁愛、益義等利救濟十方。",
        "translation": "He bestows kindness, benevolence, love, benefit, and so forth to save and rescue the ten directions.",
        "source": "T17n0820_001:0835b16_40"
    },
    {
        "source_sentence": "布施、持戒、忍辱、精進、一心、智慧，六度無極無所悕望，以施一切眾生之類。",
        "translation": "Giving, observing precepts, tolerating humility, exerting effort, being one-pointed, and wisdom are the six perfections without limit or expectation to be given to all kinds of sentient beings.",
        "source": "T17n0820_001:0835b17_0"
    },
    {
        "source_sentence": "觀于三界往返周旋，勤苦艱難不可稱計，念之如父、如母、如子、如身等而無異，",
        "translation": "He observes the three realms, going back and forth in all directions, with untold numbers of hardships and difficulties. Thinking of them as fathers, mothers, children, bodies, etc., he is no different.",
        "source": "T17n0820_001:0835b18_1"
    },
    {
        "source_sentence": "為之雨淚，欲令度厄至于大道。」",
        "translation": "It rains tears for their sake, wanting to save them from trouble and lead them to the great path.",
        "source": "T17n0820_001:0835b20_2"
    },
    {
        "source_sentence": "「發無上大意，　　行慈悲喜護，",
        "translation": "He arouses the supreme great intention to practice kindness, compassion, joy, and protection.",
        "source": "T17n0820_001:0835b21_3"
    },
    {
        "source_sentence": "　大哀如虛空，　　行等無適莫；",
        "translation": "Great compassion is like space; There is no place for such acts as these.",
        "source": "T17n0820_001:0835b21_3"
    },
    {
        "source_sentence": "　立德不為己，　　唯為十方施，",
        "translation": "He establishes virtue not for himself, but gives it only to the ten directions.",
        "source": "T17n0820_001:0835b21_3"
    },
    {
        "source_sentence": "　度脫諸群生，　　使至大道智。",
        "translation": "He liberates all sentient beings and causes them to attain the great path of wisdom.",
        "source": "T17n0820_001:0835b21_3"
    },
    {
        "source_sentence": "佛於是頌曰：「又有四事得至大乘：一曰布施給諸窮乏；",
        "translation": "The Buddha then continued in verse: Again, there are four ways to attain enlightenment:",
        "source": "T17n0820_001:0835b21_3"
    },
    {
        "source_sentence": "二曰不擇豪、劣，行輕、重心；",
        "translation": "The second is that they do not discriminate between the strong and the weak. They act with light or heavy thoughts.",
        "source": "T17n0820_001:0835b26_4"
    },
    {
        "source_sentence": "三曰所可施與，無所悕望不求還報；",
        "translation": "The third is that they give whatever they can, without expecting reward or reward.",
        "source": "T17n0820_001:0835b27_5"
    },
    {
        "source_sentence": "四曰以此功德施於眾生。」",
        "translation": "Fourth, it's called giving this merit to sentient beings.",
        "source": "T17n0820_001:0835b28_6"
    },
    {
        "source_sentence": "「布施攝貧窮，　　不行輕重心，",
        "translation": "Giving collects the poor, doesn’t practice light or heavy thoughts,",
        "source": "T17n0820_001:0835b28_7"
    },
    {
        "source_sentence": "　志慧無悕望，　　不求還得報；",
        "translation": "Their aspiration and wisdom have no expectation, Yet they do not seek rewards.",
        "source": "T17n0820_001:0835b28_7"
    },
    {
        "source_sentence": "　愍念於群黎，　　往來周旋者，",
        "translation": "Those who are compassionate and mindful of the masses, Who circumambulate everywhere,",
        "source": "T17n0820_001:0835b28_7"
    },
    {
        "source_sentence": "　以此功德施，　　悉令至大道。」",
        "translation": "Because of this meritorious gift, they'll all reach the great path.",
        "source": "T17n0820_001:0835b28_7"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「奉戒有四事，疾成大乘：一曰守口、護身心，",
        "translation": "The Buddha then composed the following verse: The Buddha said to the householders, There are four kinds of observance of the precepts that quickly lead to the attainment of enlightenment:",
        "source": "T17n0820_001:0835b28_7"
    },
    {
        "source_sentence": "不念非；",
        "translation": "They are not aware of what is right and wrong.",
        "source": "T17n0820_001:0835c06_8"
    },
    {
        "source_sentence": "二曰出入行步不失禮節；",
        "translation": "The second is the principle of not losing proper manners when going out and coming in.",
        "source": "T17n0820_001:0835c06_9"
    },
    {
        "source_sentence": "三曰不願生天、轉輪聖王、釋、梵之位；",
        "translation": "The third is that they do not wish to be reborn in heaven, the throne of universal kings, the throne of Sakra, or Brahmā.",
        "source": "T17n0820_001:0835c06_10"
    },
    {
        "source_sentence": "四曰以是禁戒惠施眾生。」",
        "translation": "Fourth, it's called giving to sentient beings because of the precepts that are forbidden.",
        "source": "T17n0820_001:0835c07_11"
    },
    {
        "source_sentence": "「常護身口意，　　心堅如太山，",
        "translation": "Always protecting body, speech, and mind, his mind is as firm as Mount Tai.",
        "source": "T17n0820_001:0835c08_12"
    },
    {
        "source_sentence": "　若出入行步，　　未曾失禮節；",
        "translation": "Those who go forth and those who walk have never lost their proper manners.",
        "source": "T17n0820_001:0835c08_12"
    },
    {
        "source_sentence": "　不願生天上，　　釋梵轉輪王，",
        "translation": "They do not wish to be born in the heavens, Like Indra and Brahma, wheel-turning kings.",
        "source": "T17n0820_001:0835c08_12"
    },
    {
        "source_sentence": "　則以此正行，　　用惠一切人。」",
        "translation": "With this right practice, he uses it to benefit all people.",
        "source": "T17n0820_001:0835c08_12"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「忍辱有四事，疾成大乘：一曰若罵詈者不計音聲；",
        "translation": "The Buddha then composed the following verse: The Buddha said to the householders, “There are four kinds of patience that quickly lead to the attainment of enlightenment.",
        "source": "T17n0820_001:0835c08_12"
    },
    {
        "source_sentence": "二曰若撾捶者計如無形；",
        "translation": "The second is that if one receives a beating, he imagines it to be formless.",
        "source": "T17n0820_001:0835c14_13"
    },
    {
        "source_sentence": "三曰若毀辱者謂如風吹；",
        "translation": "The third is that those who disparage others are said to be like the wind blowing in the sky.",
        "source": "T17n0820_001:0835c14_14"
    },
    {
        "source_sentence": "四曰有加害者常懷大哀。」",
        "translation": "Fourth, it's said that those who harm always have great compassion.",
        "source": "T17n0820_001:0835c15_15"
    },
    {
        "source_sentence": "「撾罵令默然，　　自計本無形，",
        "translation": "Having been scolded, he remained silent, imagining himself formless in the first place.",
        "source": "T17n0820_001:0835c16_16"
    },
    {
        "source_sentence": "　設有恨意起，　　心輒還自止；",
        "translation": "If there is enmity and hatred, The mind easily returns to itself.",
        "source": "T17n0820_001:0835c16_16"
    },
    {
        "source_sentence": "　和心顏色悅，　　眾人咸恭敬，",
        "translation": "Their minds are harmonious, their features pleasing; All the people venerate them.",
        "source": "T17n0820_001:0835c16_16"
    },
    {
        "source_sentence": "　用是得成佛，　　三十二相明。」",
        "translation": "This is the way to attain buddhahood, and the thirty-two characteristics are clear.",
        "source": "T17n0820_001:0835c16_16"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「精進有四事：一曰夙夜奉法未曾懈廢；",
        "translation": "The Buddha then composed the following verse: The Buddha told the householder, “There are four kinds of exertion.",
        "source": "T17n0820_001:0835c16_16"
    },
    {
        "source_sentence": "二曰寧失身命不違道教；",
        "translation": "The second was that he would rather lose his body and life than disobey the teaching of the Way.",
        "source": "T17n0820_001:0835c22_17"
    },
    {
        "source_sentence": "三曰勤諷深典不以懈惓；",
        "translation": "The third is to diligently recite the profound scriptures without laziness.",
        "source": "T17n0820_001:0835c22_18"
    },
    {
        "source_sentence": "四曰廣欲救濟諸危厄者——是為四。」",
        "translation": "Fourth, it's called someone who wants to save those in great danger-this is the fourth.",
        "source": "T17n0820_001:0835c23_19"
    },
    {
        "source_sentence": "「夙夜奉大法，　　未曾有忽忘，",
        "translation": "To serve the Great Dharma day and night, never forgetting it.",
        "source": "T17n0820_001:0835c24_20"
    },
    {
        "source_sentence": "　寧自失身命，　　不敢違道教；",
        "translation": "They would rather lose their own lives And not dare disobey the teaching of the Way.",
        "source": "T17n0820_001:0835c24_20"
    },
    {
        "source_sentence": "　誦習深經典，　　不以為懈惓，",
        "translation": "They recite and study the profound scriptures without laziness.",
        "source": "T17n0820_001:0835c24_20"
    },
    {
        "source_sentence": "　救濟眾危厄，　　不使心懷怨。」",
        "translation": "They rescue all the dangers and troubles, not harboring enemies in their minds.",
        "source": "T17n0820_001:0835c24_20"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「禪思有四事：一曰樂習精修閑居獨處；",
        "translation": "The Buddha then continued in verse: The Buddha said to the householders, “There are four kinds of meditation and thought.",
        "source": "T17n0820_001:0835c24_20"
    },
    {
        "source_sentence": "二曰靜身、口、心令不憒亂；",
        "translation": "The second is to keep the body, speech, and mind at ease so that they are not disturbed.",
        "source": "T17n0820_001:0836a01_21"
    },
    {
        "source_sentence": "三曰雖在眾閙常能定己；",
        "translation": "The third is that one can always control oneself, even in the midst of crowds and disturbances.",
        "source": "T17n0820_001:0836a01_22"
    },
    {
        "source_sentence": "四曰其心曠然而無所著。」",
        "translation": "Fourth, it's said that his mind is free and unattached.",
        "source": "T17n0820_001:0836a02_23"
    },
    {
        "source_sentence": "「恒好於精修，　　志閑居獨處，",
        "translation": "They are always fond of vigorous cultivation, Wishing to live in a quiet and secluded place.",
        "source": "T17n0820_001:0836a02_24"
    },
    {
        "source_sentence": "　靜其身口意，　　未曾念憒閙；",
        "translation": "Their bodies, speech, and thought are stilled; They never think of torpor or noise.",
        "source": "T17n0820_001:0836a02_24"
    },
    {
        "source_sentence": "　數處眾亂中，　　心定無忽變，",
        "translation": "In the midst of numerous disturbances, Their minds are not suddenly changed.",
        "source": "T17n0820_001:0836a02_24"
    },
    {
        "source_sentence": "　一心見十方，　　道慧起神足。」",
        "translation": "With one mind, he sees the ten directions and gives rise to the spiritual legs of enlightenment and wisdom.",
        "source": "T17n0820_001:0836a02_24"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「智慧有四事：一曰解於身空，四大合成、散壞本無主名；",
        "translation": "The Buddha then continued in verse: The Buddha said to the householders, “There are four kinds of wisdom.",
        "source": "T17n0820_001:0836a02_24"
    },
    {
        "source_sentence": "二曰其生三界皆心所為，心如幻化倚立眾形；",
        "translation": "The second is that arising in the three realms is all conditioned by thought, which is like an illusion.",
        "source": "T17n0820_001:0836a09_25"
    },
    {
        "source_sentence": "三曰了知五陰本無處所，隨其所著因有斯情；",
        "translation": "The third is the perception that the five aggregates are inherently nonexistent. Sentient beings exist by reason of their attachment.",
        "source": "T17n0820_001:0836a10_26"
    },
    {
        "source_sentence": "四曰曉十二緣本無根原，因對而對現——是為四。」",
        "translation": "Fourth, it's the understanding that the twelve conditions are originally without faculties and present in response to each other - these are the four.",
        "source": "T17n0820_001:0836a11_27"
    },
    {
        "source_sentence": "「悉解其身空，　　四大而合成，",
        "translation": "Understanding the emptiness of their bodies, They are combined by the four elements:",
        "source": "T17n0820_001:0836a12_28"
    },
    {
        "source_sentence": "　散滅無處所，　　從心而得生；",
        "translation": "Dispersal and extinction have no place: They arise from the mind.",
        "source": "T17n0820_001:0836a12_28"
    },
    {
        "source_sentence": "　五陰本無根，　　所著以為名，",
        "translation": "The five aggregates are originally without faculties, the name being what they cling to.",
        "source": "T17n0820_001:0836a12_28"
    },
    {
        "source_sentence": "　十二緣無端，　　了此至大安。」",
        "translation": "The twelve conditions have no limit, and understanding this leads to great peace.",
        "source": "T17n0820_001:0836a12_28"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「智慧復有六事：一曰解色如聚沫；",
        "translation": "The Buddha then continued in verse: Again, the Buddha said to the wealthy householder, “There are six kinds of wisdom.",
        "source": "T17n0820_001:0836a12_28"
    },
    {
        "source_sentence": "二曰了痛痒如水泡；",
        "translation": "The second is that it feels pain and itch like water bubbles.",
        "source": "T17n0820_001:0836a18_0"
    },
    {
        "source_sentence": "三曰思想如野馬；",
        "translation": "The third is that thought is like a wild horse.",
        "source": "T17n0820_001:0836a18_1"
    },
    {
        "source_sentence": "四曰曉生死如芭蕉；",
        "translation": "The fourth is the knowledge that birth and death are like plantains.",
        "source": "T17n0820_001:0836a18_2"
    },
    {
        "source_sentence": "五曰察識如幻；",
        "translation": "The fifth is the supervision of consciousness as illusory.",
        "source": "T17n0820_001:0836a19_3"
    },
    {
        "source_sentence": "六曰心神如影響，計本悉空皆無處所。」",
        "translation": "Sixth, it's said that mind and spirit are like influences, and the originally conceived emptiness has no place.",
        "source": "T17n0820_001:0836a19_4"
    },
    {
        "source_sentence": "「解色如聚沫，　　痛痒如水泡，",
        "translation": "解色如聚沫, 痛痒如水泡,",
        "source": "T17n0820_001:0836a20_5"
    },
    {
        "source_sentence": "　思想猶野馬，　　生死若芭蕉，",
        "translation": "Thoughts are like wild horses, birth and death like plantains.",
        "source": "T17n0820_001:0836a20_5"
    },
    {
        "source_sentence": "　了識假譬幻，　　三界無一好，",
        "translation": "Understanding that consciousness is metaphorical and illusory, there’s no single beauty in the three realms.",
        "source": "T17n0820_001:0836a20_5"
    },
    {
        "source_sentence": "　分別悉空無，　　爾乃至大道。」",
        "translation": "Discrimination is completely empty and nonexistent, so it goes on to the great path.",
        "source": "T17n0820_001:0836a20_5"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「慈有四事：一曰慈念十方；",
        "translation": "The Buddha then continued in verse: The Buddha said to the householders, “There are four kinds of compassion.",
        "source": "T17n0820_001:0836a20_5"
    },
    {
        "source_sentence": "二曰如母育子；",
        "translation": "The second is like a mother raising her child.",
        "source": "T17n0820_001:0836a25_6"
    },
    {
        "source_sentence": "三曰極愍念之；",
        "translation": "The third is to think of them with extreme affection.",
        "source": "T17n0820_001:0836a26_7"
    },
    {
        "source_sentence": "四曰如身無異——是為四。」",
        "translation": "The fourth says, Just as the body is not different - these are the four.",
        "source": "T17n0820_001:0836a26_8"
    },
    {
        "source_sentence": "「慈念於十方，　　如母育赤子，",
        "translation": "Mindful of compassion in the ten directions, like a mother nurturing a baby,",
        "source": "T17n0820_001:0836a27_9"
    },
    {
        "source_sentence": "　常懷極愍念，　　如身等無異。」",
        "translation": "He always harbors extreme thoughts of anger, just like the body and so forth without distinction.",
        "source": "T17n0820_001:0836a27_9"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「哀有四事：一曰愍之；",
        "translation": "The Buddha then composed the following verse: The Buddha said to the householder, “There are four kinds of sorrow.",
        "source": "T17n0820_001:0836a27_9"
    },
    {
        "source_sentence": "二曰為之雨淚；",
        "translation": "The second is shedding tears of rain for their sake.",
        "source": "T17n0820_001:0836b01_10"
    },
    {
        "source_sentence": "三曰身欲代罪；",
        "translation": "The third is the sin of sexual desire as a body.",
        "source": "T17n0820_001:0836b02_11"
    },
    {
        "source_sentence": "四曰以命濟之。",
        "translation": "The fourth is to rescue them with life.",
        "source": "T17n0820_001:0836b02_12"
    },
    {
        "source_sentence": "「喜有四事：一曰和顏；",
        "translation": "“There are four kinds of joy:",
        "source": "T17n0820_001:0836b02_13"
    },
    {
        "source_sentence": "二曰善言；",
        "translation": "The second is good speech.",
        "source": "T17n0820_001:0836b03_14"
    },
    {
        "source_sentence": "三曰說經；",
        "translation": "The third is preaching the scriptures.",
        "source": "T17n0820_001:0836b03_15"
    },
    {
        "source_sentence": "四曰解義。",
        "translation": "The fourth is the meaning of understanding.",
        "source": "T17n0820_001:0836b03_16"
    },
    {
        "source_sentence": "「護有四事：一曰教去惡就善；",
        "translation": "“Protection consists of four things:",
        "source": "T17n0820_001:0836b03_17"
    },
    {
        "source_sentence": "二曰常訓誨歸命三寶；",
        "translation": "The second is that they always instruct the Three Treasures in taking refuge in them.",
        "source": "T17n0820_001:0836b04_18"
    },
    {
        "source_sentence": "三曰使發道意；",
        "translation": "The third is enabling one to give rise to the intention for enlightenment.",
        "source": "T17n0820_001:0836b05_19"
    },
    {
        "source_sentence": "四曰開化眾生——是為四。」",
        "translation": "The fourth is to enlighten sentient beings - these are the four.",
        "source": "T17n0820_001:0836b05_20"
    },
    {
        "source_sentence": "「愍念為雨淚，　　身欲代其罪，",
        "translation": "With pity, he thinks of it as rain and tears, wanting to punish him for his sins.",
        "source": "T17n0820_001:0836b06_0"
    },
    {
        "source_sentence": "　捨命而濟之，　　不以為懷恨。",
        "translation": "I give up my life to save them And do not harbor hatred for their sake.",
        "source": "T17n0820_001:0836b06_0"
    },
    {
        "source_sentence": "　和顏演善言，　　講法分別義，",
        "translation": "The harmonious countenance uttered good words, Teaching the Dharma with discriminating meanings.",
        "source": "T17n0820_001:0836b06_0"
    },
    {
        "source_sentence": "　教去惡就善，　　誨歸命三寶。」",
        "translation": "Teaching to remove evil and turn it into goodness, he teaches the Three Treasures to return to life.",
        "source": "T17n0820_001:0836b06_0"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「有四法，疾成無上正真之道：一曰解空，學無所求；",
        "translation": "The Buddha then continued in verse: The Buddha said to the householders, “There are four kinds of ways by which one can quickly attain the unsurpassed true path.",
        "source": "T17n0820_001:0836b06_0"
    },
    {
        "source_sentence": "二曰無想、無所悕望；",
        "translation": "The second is that they have no ideation and no expectation.",
        "source": "T17n0820_001:0836b12_1"
    },
    {
        "source_sentence": "三曰無願，不慕所生；",
        "translation": "The third is wishlessness, not longing for anything to be produced.",
        "source": "T17n0820_001:0836b12_2"
    },
    {
        "source_sentence": "四曰常等三乘之業，無去、來、今——是為四。」",
        "translation": "The fourth is that the three vehicles of eternalism and so forth have no past, future, or present actions - these are the four.",
        "source": "T17n0820_001:0836b13_3"
    },
    {
        "source_sentence": "「解空無所求，　　無想悕望報，",
        "translation": "Understanding emptiness, there’s nothing to be sought, and the absence of ideation has no expectation or reward.",
        "source": "T17n0820_001:0836b14_4"
    },
    {
        "source_sentence": "　不慕願所生，　　常等三世行。」",
        "translation": "They don't crave what's produced by their vows, and they always practice in the three worlds equally.",
        "source": "T17n0820_001:0836b14_4"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「有四事法，疾成佛道：一曰一切皆悉本淨；",
        "translation": "The Buddha then composed the following verse: The Buddha said to the householder, “There are four things that quickly lead to attain buddhahood.",
        "source": "T17n0820_001:0836b14_4"
    },
    {
        "source_sentence": "二曰而解萬物普如幻化；",
        "translation": "The second is that they understand all things are like illusions.",
        "source": "T17n0820_001:0836b18_5"
    },
    {
        "source_sentence": "三曰生死斷滅皆從緣對；",
        "translation": "The third is that the cessation of birth and death are all opposed by conditions.",
        "source": "T17n0820_001:0836b18_6"
    },
    {
        "source_sentence": "四曰計其緣對本亦無形。」",
        "translation": "Fourth, it's called imagining that its conditions are also formless in relation to the original.",
        "source": "T17n0820_001:0836b19_7"
    },
    {
        "source_sentence": "「一切悉本淨，　　解物如幻化，",
        "translation": "Everything is inherently pure, Understanding things are like illusions.",
        "source": "T17n0820_001:0836b19_8"
    },
    {
        "source_sentence": "　生死從緣對，　　計本亦無形。」",
        "translation": "Birth and death are opposed by conditions, and the basis of imagination also has no form.",
        "source": "T17n0820_001:0836b19_8"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「有六法疾成正覺：一曰身常行慈，無怨無結；",
        "translation": "The Buddha then composed the following verse: The Buddha told the householder, “There are six kinds of people who quickly attain true awakening.",
        "source": "T17n0820_001:0836b19_8"
    },
    {
        "source_sentence": "二曰口常行慈，演深慧義；",
        "translation": "The second was the kindness of always practicing loving-kindness by mouth, expounding the meaning of profound wisdom.",
        "source": "T17n0820_001:0836b24_9"
    },
    {
        "source_sentence": "三者心慈、仁和、調隱，哀念十方；",
        "translation": "The third is compassionate, benevolent, harmonious, and peaceful. They have compassion for all living beings in the ten directions.",
        "source": "T17n0820_001:0836b24_10"
    },
    {
        "source_sentence": "四曰護戒不造，想求大乘之業；",
        "translation": "The fourth is the practice of observing precepts without violating them, conceptualizing and seeking the Great Vehicle.",
        "source": "T17n0820_001:0836b25_11"
    },
    {
        "source_sentence": "五曰正觀見十方空，道、俗不二；",
        "translation": "The fifth is that they correctly observe emptiness in all ten directions, seeing that the path and the mundane are not two.",
        "source": "T17n0820_001:0836b26_12"
    },
    {
        "source_sentence": "六曰供足乏食，救身之業以濟危厄——是為六。」",
        "translation": "Sixth, it's called making offerings to those who lack food and relieving their physical actions to save them from danger-this is the sixth.",
        "source": "T17n0820_001:0836b26_13"
    },
    {
        "source_sentence": "「身常行慈心，　　未曾捶怨結，",
        "translation": "His body always acts with kindness, Never opposing enemies.",
        "source": "T17n0820_001:0836b27_14"
    },
    {
        "source_sentence": "　口恒修言愍，　　演深慧之誼。",
        "translation": "His mouth always cultivates verbal criticism, expressing the meaning of profound wisdom.",
        "source": "T17n0820_001:0836b27_14"
    },
    {
        "source_sentence": "　心和仁調隱，　　哀念諸十方，",
        "translation": "Their minds are harmonious, benevolent, and peaceful, And they have compassion for all beings in the ten directions.",
        "source": "T17n0820_001:0836b27_14"
    },
    {
        "source_sentence": "　護戒不起想，　　正觀十方空。」",
        "translation": "Upholding precepts and not giving rise to perceptions, he correctly observes the emptiness of the ten directions.",
        "source": "T17n0820_001:0836b27_14"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「有四事疾成佛道：一曰奉精進業悉無所著；",
        "translation": "The Buddha then composed the following verse: The Buddha told the householder, “There are four things that quickly lead to attain buddhahood.",
        "source": "T17n0820_001:0836b27_14"
    },
    {
        "source_sentence": "二曰教化眾生道心不斷；",
        "translation": "The second is that the determination for enlightenment does not cease in teaching sentient beings.",
        "source": "T17n0820_001:0836c05_15"
    },
    {
        "source_sentence": "三曰遊于生死不以患厭；",
        "translation": "The third is that they wander through birth and death without wearying of suffering.",
        "source": "T17n0820_001:0836c05_16"
    },
    {
        "source_sentence": "四曰大慈大哀不捨權慧——是為四。」",
        "translation": "Fourth, great compassion and great pity that don't abandon righteousness and wisdom - these are the four.",
        "source": "T17n0820_001:0836c06_17"
    },
    {
        "source_sentence": "「精進無所著，　　教化未曾斷，",
        "translation": "“Great enlightening beings have no attachment or attachment to effort, Yet never give up the practice of enlightenment.",
        "source": "T17n0820_001:0836c07_18"
    },
    {
        "source_sentence": "　不患厭生死，　　不廢捨權慧。」",
        "translation": "They won't suffer from being disillusioned with birth and death, and they won't abandon right and wisdom.",
        "source": "T17n0820_001:0836c07_18"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「開化眾生有四事：一曰不信生死者，則以現事禍、福喻之；",
        "translation": "The Buddha then composed the following verse: The Buddha told the wealthy man, “There are four things that enlighten sentient beings.",
        "source": "T17n0820_001:0836c07_18"
    },
    {
        "source_sentence": "二曰不信三寶，顯示大道；",
        "translation": "The second is that they do not believe in the Three Treasures and show great enlightenment.",
        "source": "T17n0820_001:0836c11_19"
    },
    {
        "source_sentence": "三曰迷惑邪徑，指語三乘，佛道獨尊而無有侶；",
        "translation": "The third is the practice of delusion in regard to wrong paths, pointing out the teachings of the three vehicles. The Buddhist Way has alone preeminence and no companions.",
        "source": "T17n0820_001:0836c12_20"
    },
    {
        "source_sentence": "四曰三界所有悉如幻化無一真諦——是為四。」",
        "translation": "Fourth, it's said that all things in the three realms are illusory and have no single true truth - these are the four.",
        "source": "T17n0820_001:0836c13_21"
    },
    {
        "source_sentence": "「不信生死禍福示，　　墮邪見者顯大道，",
        "translation": "Not believing in the signs of birth and death, misfortune and blessedness, those who fall into wrong views reveal the great path.",
        "source": "T17n0820_001:0836c14_22"
    },
    {
        "source_sentence": "　佛道獨尊而無侶，　　三界悉空如幻化。」",
        "translation": "The Buddha Way is alone honored and has no companions, and the three realms are all empty like illusory transformation.",
        "source": "T17n0820_001:0836c14_22"
    },
    {
        "source_sentence": "佛於是頌曰：佛告長者：「開化復有七事：一曰慳貪者教令布施；",
        "translation": "The Buddha then said in verse: Again, there are seven matters of enlightenment.",
        "source": "T17n0820_001:0836c14_22"
    },
    {
        "source_sentence": "二曰犯惡者誨令奉戒；",
        "translation": "The second is to instruct those who commit evil and cause them to observe the precepts.",
        "source": "T17n0820_001:0836c18_23"
    },
    {
        "source_sentence": "三曰瞋恚者勸令忍辱；",
        "translation": "The third is encouraging those who are hostile to others and causing them to tolerate.",
        "source": "T17n0820_001:0836c18_24"
    },
    {
        "source_sentence": "四曰懈怠者化令精進；",
        "translation": "The fourth is to cause those who are lazy to be inspired with energy.",
        "source": "T17n0820_001:0836c19_25"
    },
    {
        "source_sentence": "五曰心亂者誨令定意；",
        "translation": "The fifth is to instruct those whose minds are disturbed so as to make them concentrate.",
        "source": "T17n0820_001:0836c19_26"
    },
    {
        "source_sentence": "六曰愚冥者教令至學智度無極；",
        "translation": "The sixth is that the ignorant should teach and enable those who are supremely ignorant to attain the transcendence of knowledge.",
        "source": "T17n0820_001:0836c20_27"
    },
    {
        "source_sentence": "七曰不知隨時顯權方便——是為七。」",
        "translation": "The seventh is that they don't know the right to reveal their skillful means at any time - these are the seven.",
        "source": "T17n0820_001:0836c21_0"
    },
    {
        "source_sentence": "「慳者教布施，　　犯惡令奉戒，",
        "translation": "Those who are stingy teach generosity, and those who commit evil make them observe precepts.",
        "source": "T17n0820_001:0836c21_1"
    },
    {
        "source_sentence": "　瞋恚勸忍辱，　　懈怠勸精進，",
        "translation": "Enmity encourages forbearance, Laziness encourages effort.",
        "source": "T17n0820_001:0836c21_1"
    },
    {
        "source_sentence": "　亂者使定意，　　愚冥教令學，",
        "translation": "Those who are confused make their minds concentrated, and ignorant people teach and cause them to learn.",
        "source": "T17n0820_001:0836c21_1"
    },
    {
        "source_sentence": "　智慧度無極，　　隨時發善權。」",
        "translation": "Their wisdom and liberation are limitless, and they give rise to good authority at any time.",
        "source": "T17n0820_001:0836c21_1"
    },
    {
        "source_sentence": "佛於是頌曰：隨時菩薩問佛：「何故學者有上、中、下，不悉普等至大乘乎？」",
        "translation": "The Buddha then spoke this verse, saying, At the time, the bodhisattva asked the Buddha, Why are there scholars of higher, middle, and lower degrees who aren't fully equal to the great vehicle?",
        "source": "T17n0820_001:0836c21_1"
    },
    {
        "source_sentence": "佛言：「學者其心，見有遠近、解有深淺、志有優劣，故示三乘。",
        "translation": "The Buddha said, A learner's mind sees that there's distance and nearness, understanding that there's depth and shallowness, and the intention that there's superiority and inferiority, so he shows the three vehicles.",
        "source": "T17n0820_001:0836c28_2"
    },
    {
        "source_sentence": "計本無三，假引為喻。",
        "translation": "To impute that there are originally no three is to metaphorically cite as a metaphor.",
        "source": "T17n0820_001:0836c29_3"
    },
    {
        "source_sentence": "譬如有人為國大臣聰明智慧，王之所重，參誼國事，一以委託不懷疑慮。",
        "translation": "It's like a person who's a minister of state who's intelligent and wise, valued by the king, engages in national affairs so that he can entrust them to him without doubt or worry.",
        "source": "T17n0820_001:0837a01_4"
    },
    {
        "source_sentence": "又斯大臣有三親友：一曰太子；",
        "translation": "Again, these ministers had three close friends:",
        "source": "T17n0820_001:0837a02_5"
    },
    {
        "source_sentence": "二曰尊者；",
        "translation": "The second was the venerable one.",
        "source": "T17n0820_001:0837a03_6"
    },
    {
        "source_sentence": "三曰凡人。",
        "translation": "Three, it's called a worldling.",
        "source": "T17n0820_001:0837a03_7"
    },
    {
        "source_sentence": "大臣舉治國之政頗有漏失，眾人潛入白之於王，謂圖逆辟。",
        "translation": "The ministers raised questions about the governance of the country and said that the government was quite corrupt, and the people secretly entered the king's office to report it to him, which is called a rebellion against the king.",
        "source": "T17n0820_001:0837a03_8"
    },
    {
        "source_sentence": "王聞懷疑，問諸臣曰：『當何罪之？』",
        "translation": "When the king heard this doubt, he asked the ministers, 'What's the offense?'",
        "source": "T17n0820_001:0837a05_9"
    },
    {
        "source_sentence": "諸臣得便各重罪之：或言斫頭，或言截手斷足，或言割耳及鼻、挑眼去舌。",
        "translation": "Each of the ministers were then charged with a grave offense, either by saying they cut off their heads, or by saying they cut off their hands and feet, or by saying they cut off their ears and nose and picked up their eyes and removed their tongues.",
        "source": "T17n0820_001:0837a06_10"
    },
    {
        "source_sentence": "王察眾臣所議甚重，告曰：『不然！",
        "translation": "The king examined the seriousness of what the ministers had discussed and told them, 'No!",
        "source": "T17n0820_001:0837a07_11"
    },
    {
        "source_sentence": "此人明達，偶有小失，不宜乃爾。",
        "translation": "This man clearly understands that there are occasional minor errors, so it's not appropriate for him to do so.",
        "source": "T17n0820_001:0837a08_12"
    },
    {
        "source_sentence": "當捉閉著獄。』",
        "translation": "You'll be caught and locked up in hell.'",
        "source": "T17n0820_001:0837a09_13"
    },
    {
        "source_sentence": "諸臣唯從不敢復言。",
        "translation": "The ministers simply didn't dare to say anything further.",
        "source": "T17n0820_001:0837a09_14"
    },
    {
        "source_sentence": "告邊臣曰：『速下文書，令收勅臣閉在刑獄。』",
        "translation": "He told the border officials, 'Should you quickly send down a document that orders you to collect the imperial officials and shut them up in prison?'",
        "source": "T17n0820_001:0837a09_15"
    },
    {
        "source_sentence": "「時，凡親友聞之悲念，欲使出獄，力劣不任，唯以衣被、飲食所乏，",
        "translation": "“At that time, the worldling’s relatives and friends heard this. They were overcome with sorrow and wished to be released from prison but their strength was too weak to allow them to do so. All they could do was lack clothing, food, shelter, and drink.",
        "source": "T17n0820_001:0837a10_16"
    },
    {
        "source_sentence": "日日供之；",
        "translation": "Every day he offered offerings to them.",
        "source": "T17n0820_001:0837a12_17"
    },
    {
        "source_sentence": "亦不能令不見考治。",
        "translation": "Nor can he cause them not to see the examination and correction.",
        "source": "T17n0820_001:0837a12_18"
    },
    {
        "source_sentence": "尊者又聞，心用辛酸，往至其所解喻獄吏，不令搒笞，痛苦休息，不堪出獄。",
        "translation": "Again, the venerable monk heard that his mind was so tortured and distressed that he went to the place where the jailer was imprisoned without being beaten or flogged. The pain ceased and he could not escape punishment.",
        "source": "T17n0820_001:0837a13_19"
    },
    {
        "source_sentence": "至太子聞，以為罔然，『是吾親親無有重罪，眾臣憎之，讒之於王，不宜取爾。』",
        "translation": "When the prince heard this, he thought to himself, 'There's no serious offense in my relatives and relatives, and the ministers resented them and pityed them for the king, not wanting to take them.'",
        "source": "T17n0820_001:0837a14_20"
    },
    {
        "source_sentence": "往詣王所，具陳本末，謂無逆肆，當用我故願赦其殃。",
        "translation": "He went to the king and told him the whole story, saying, “If you do not commit any heinous acts against me, let me be your refuge and forsake their misdeeds.",
        "source": "T17n0820_001:0837a16_21"
    },
    {
        "source_sentence": "王用愛子，即赦使出獄，與王相見令業如故。",
        "translation": "Using his beloved son, the king pardoned the messenger and released him from prison, and they met with the king and caused their actions to be as before.",
        "source": "T17n0820_001:0837a17_22"
    },
    {
        "source_sentence": "「其國王者謂如來。",
        "translation": "“The king of that country is called the Tathāgata.",
        "source": "T17n0820_001:0837a18_23"
    },
    {
        "source_sentence": "其太子者智慧度無極、善權方便菩薩，逮得無所從生法忍權慧之宜，乃能得出於三界獄，",
        "translation": "The prince was a bodhisattva who had transcended the infinity of wisdom and liberated himself from the three worlds by means of skillful means. Having attained the appropriateness of patience, righteousness, and wisdom in regard to phenomena that do not arise from anything, he was able to leave the hells of the triple world.",
        "source": "T17n0820_001:0837a18_24"
    },
    {
        "source_sentence": "得成為佛廣濟眾生。",
        "translation": "They'll become buddhas who will extensively save sentient beings.",
        "source": "T17n0820_001:0837a20_25"
    },
    {
        "source_sentence": "尊者親友謂行淨戒，免三惡趣不助三界，可受天上、人間福，不得至道。",
        "translation": "Venerable friends and relatives say that someone who practices pure precepts will be spared the three bad destinies and won't help the three realms, so they can receive merit in heaven or among humans and not attain the ultimate path.",
        "source": "T17n0820_001:0837a21_26"
    },
    {
        "source_sentence": "凡知友者謂布施業，此適能脫餓鬼之界，不免地獄、畜生之厄。",
        "translation": "Whoever knows that a friend refers to the activity of generosity, this person will be able to escape the realm of hungry ghosts and not escape the hells and the miseries of animals.",
        "source": "T17n0820_001:0837a23_0"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T17n0820_001:0837a24_1"
    },
    {
        "source_sentence": "如其所種各得其類，發無上正真道意，奉於大慈無極大哀，開化一切故，",
        "translation": "They develop the will for the supreme path of enlightenment, because they are devoted to great benevolence and infinite compassion, leading and inspiring all.",
        "source": "T17n0820_001:0837a24_2"
    },
    {
        "source_sentence": "得至佛道。",
        "translation": "They'll attain the Buddha Way.",
        "source": "T17n0820_001:0837a26_3"
    },
    {
        "source_sentence": "本典大道不達深法，不解進退中止自廢，故為緣覺。",
        "translation": "Because they do not understand the profound doctrine of the great path of the scriptures, and because they do not understand progress or retreat from it, they abandon it on their own. Therefore, they are pratyekabuddhas.",
        "source": "T17n0820_001:0837a26_4"
    },
    {
        "source_sentence": "畏生死難往返周旋，但欲自濟，不念苦人故，墮聲聞。",
        "translation": "Fearing the difficulties of birth and death, they simply want to save themselves but don't think of suffering people, so they fall into śrāvakas.",
        "source": "T17n0820_001:0837a27_5"
    },
    {
        "source_sentence": "各隨本行而獲致之。」",
        "translation": "Each one follows their original practice and obtains it.",
        "source": "T17n0820_001:0837a28_6"
    },
    {
        "source_sentence": "說是經時，給孤獨氏居士五百長者，皆發無上正真道意。",
        "translation": "When he taught this sūtra, five hundred elders of the solitary householders and orphaned monks all aroused the intention for the unsurpassed true path.",
        "source": "T17n0820_001:0837a29_7"
    },
    {
        "source_sentence": "有數千人遠塵離垢，諸法眼生。",
        "translation": "Hundreds of thousands of monks and nuns, free from dust and dirt, saw the miraculous birth of the Dharma eye.",
        "source": "T17n0820_001:0837b01_8"
    },
    {
        "source_sentence": "箜篌樂器不鼓自鳴，飛鳥走獸相和悲聲。",
        "translation": "The drums and instruments of music don't sound themselves, and flying birds and animals walk in harmony with compassion.",
        "source": "T17n0820_001:0837b02_9"
    },
    {
        "source_sentence": "當是之時，莫不歡喜自歸佛者。",
        "translation": "At the time, none of them rejoiced and returned to the Buddha for themselves.",
        "source": "T17n0820_001:0837b03_10"
    },
    {
        "source_sentence": "居士復問：「初學道者始以何志？」",
        "translation": "Again, the monk asked, What's the first intention of a beginner to train in the path?",
        "source": "T17n0820_001:0837b04_0"
    },
    {
        "source_sentence": "佛言：「先習五戒，自歸於三。",
        "translation": "The Buddha said, First, he cultivates the five precepts, which are self-contained in three.",
        "source": "T17n0820_001:0837b04_1"
    },
    {
        "source_sentence": "何謂五戒？",
        "translation": "What are the five kinds of morality?",
        "source": "T17n0820_001:0837b05_2"
    },
    {
        "source_sentence": "一曰慈心恩仁不殺；",
        "translation": "The first is the principle of kindness and not killing.",
        "source": "T17n0820_001:0837b05_3"
    },
    {
        "source_sentence": "二曰清廉節用不盜；",
        "translation": "The second is the principle of being pure and honest, not taking what is not given.",
        "source": "T17n0820_001:0837b06_0"
    },
    {
        "source_sentence": "三者貞良鮮潔不染；",
        "translation": "The third is that they are pure and genuine, impeccably clean.",
        "source": "T17n0820_001:0837b06_1"
    },
    {
        "source_sentence": "四曰篤信性和不欺；",
        "translation": "The fourth is devoted to faith and not deceitful.",
        "source": "T17n0820_001:0837b06_2"
    },
    {
        "source_sentence": "五曰要達志明不亂。",
        "translation": "The fifth is that the essentials are well-understood, and their intentions are not disturbed.",
        "source": "T17n0820_001:0837b07_3"
    },
    {
        "source_sentence": "何謂三自歸？",
        "translation": "What are the three kinds of self-reliance?",
        "source": "T17n0820_001:0837b07_4"
    },
    {
        "source_sentence": "一曰歸佛無上正真；",
        "translation": "The first is the supreme true taking of refuge in buddhas.",
        "source": "T17n0820_001:0837b08_5"
    },
    {
        "source_sentence": "二曰歸法以自御心；",
        "translation": "The second is the principle of taking refuge in the Dharma by controlling one’s own mind.",
        "source": "T17n0820_001:0837b08_6"
    },
    {
        "source_sentence": "三曰歸眾，聖眾之中所受廣大，猶如大海靡所不包。",
        "translation": "The third is called the congregation of refuge, which is as vast as the ocean and embraced by all the holy ones.",
        "source": "T17n0820_001:0837b09_7"
    },
    {
        "source_sentence": "復有四法：一曰道跡；",
        "translation": "(12) Again there is another fourfold doctrine that explains four kinds of causality:",
        "source": "T17n0820_001:0837b10_8"
    },
    {
        "source_sentence": "二曰往還；",
        "translation": "The second is called going and coming.",
        "source": "T17n0820_001:0837b10_9"
    },
    {
        "source_sentence": "三曰不還；",
        "translation": "The third is the principle of nonreturning.",
        "source": "T17n0820_001:0837b11_10"
    },
    {
        "source_sentence": "四曰無著。",
        "translation": "The fourth is the absence of attachment.",
        "source": "T17n0820_001:0837b11_11"
    },
    {
        "source_sentence": "緣覺至佛無上大道，得天、人身皆由之生。",
        "translation": "The pratyekabuddhas reach the Buddha's unsurpassed great path, and they attain heavenly and human bodies that all arise from it.",
        "source": "T17n0820_001:0837b11_12"
    },
    {
        "source_sentence": "次行四等、四恩、四辯、六度無極、大慈大哀，得成大道。",
        "translation": "Next, he practices the four kinds of equanimity, the four kinds of kindness, the four kinds of eloquence, the six perfections without limit, great compassion, and great pity to attain the great path.",
        "source": "T17n0820_001:0837b12_13"
    },
    {
        "source_sentence": "前知無窮却覩無極，教訓十方何智不逮？」",
        "translation": "The prior knowledge of infinity is without limit, but the debilitating hindrances are without limit, so why wouldn't that knowledge be acquired if it were to teach in ten directions?",
        "source": "T17n0820_001:0837b13_14"
    },
    {
        "source_sentence": "阿難問曰：「此經何名？",
        "translation": "Ānanda asked, What's the name of this sūtra?",
        "source": "T17n0820_001:0837b14_15"
    },
    {
        "source_sentence": "云何奉行？」",
        "translation": "How do you consecrate it?",
        "source": "T17n0820_001:0837b15_16"
    },
    {
        "source_sentence": "佛言：「名曰『解俗家業三品之財出家修道無上正真』，其要號曰『演道俗業』。」",
        "translation": "The Buddha said, It's called '解俗家業三品之財出家修道無上正真' and its essential title is '演道俗業'.",
        "source": "T17n0820_001:0837b15_17"
    },
    {
        "source_sentence": "佛說如是。",
        "translation": "The Buddha teaches thus.",
        "source": "T17n0820_001:0837b16_18"
    },
    {
        "source_sentence": "賢者阿難，給孤獨居士、五百清信士，莫不歡喜。",
        "translation": "Good man Ānanda, none of the five hundred pure faithful monks who gave them to the orphaned householder and five hundred pure faithful monks rejoiced.",
        "source": "T17n0820_001:0837b17_19"
    },
    {
        "source_sentence": "佛說演道俗業經",
        "translation": "Foshuo演道俗業經佛說演道俗業經,",
        "source": "T17n0820_001:0837b19_0"
    }
]