[
    {
        "source_sentence": "妙法聖念處經卷第三",
        "translation": "Sutra of the Sacred Mindfulness of the Wonderful Dharma, Volume 3",
        "source": "T17n0722_003:0424c06_0"
    },
    {
        "source_sentence": "大宋西天中印度摩伽陀國那爛陀寺",
        "translation": "Nalanda Monastery of the Indian country of Magadha in the Western Heaven",
        "source": "T17n0722_003:0424c08_0"
    },
    {
        "source_sentence": "三藏傳教大師賜紫沙門臣法天",
        "translation": "The Tripiṭaka Master Biographies of the Teachings of the Tripiṭaka bestowed purple-colored ascetics and ministers to the Dharma heaven",
        "source": "T17n0722_003:0424c09_0"
    },
    {
        "source_sentence": "奉　詔譯",
        "translation": "translated by imperial edict",
        "source": "T17n0722_003:0424c10_0"
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「若復有人於未來世，求生人天、厭離苦果，應當遠離諸業煩惱，",
        "translation": "It was then that the Buddha addressed the monks, saying: Again, if someone were to seek rebirth among humans and gods in a future existence and become disillusioned with suffering as its fruit, they would have to be free of all karmic afflictions.",
        "source": "T17n0722_003:0424c11_0"
    },
    {
        "source_sentence": "暴惡淫逸及離妄語，破壞損惱一切有情，修諸善業，漸令增長，相續恒時，",
        "translation": "All sentient beings are harmed by violence, wickedness, sexual misconduct, and abstention from false speech. Cultivating good deeds, they gradually increase and continue to do so at all times.",
        "source": "T17n0722_003:0424c12_1"
    },
    {
        "source_sentence": "獲報安樂，捨離苦惱。」",
        "translation": "They'll attain peace and happiness as a reward and be freed from suffering and distress.",
        "source": "T17n0722_003:0424c14_2"
    },
    {
        "source_sentence": "「暴惡能遠離，　　苦澁果非有，",
        "translation": "violent and evil can be avoided, but the results of suffering and anger are not present.",
        "source": "T17n0722_003:0424c15_3"
    },
    {
        "source_sentence": "　輕毀妄語無，　　聞名皆歡喜。",
        "translation": "They despise the absence of false speech and rejoice when they hear its name.",
        "source": "T17n0722_003:0424c15_3"
    },
    {
        "source_sentence": "　邪執宿冤賊，　　伏除令不起，",
        "translation": "Those who wrongly cling to past enemies and thieves They subdue and rid them so that they won’t arise.",
        "source": "T17n0722_003:0424c15_3"
    },
    {
        "source_sentence": "　覺悟煩惱染，　　恒修諸對治。」",
        "translation": "He perceives the defilement of afflictions and always cultivates antidotes.",
        "source": "T17n0722_003:0424c15_3"
    },
    {
        "source_sentence": "爾時，世尊即說偈言：爾時，佛告諸比丘言：「若復有人值遇違緣，於自及他應當覺悟；",
        "translation": "At that time the World-honored One spoke these verses: Then the Buddha said to the bhikṣus: Again, suppose there is another person who meets a disobedient condition.",
        "source": "T17n0722_003:0424c15_3"
    },
    {
        "source_sentence": "破壞遠離虛妄計執，想諸聖賢，修於忍行，又於財物，離貪妄想；",
        "translation": "They undertake the practice of forbearance, and also become free of craving and deluded conceptions regarding property.",
        "source": "T17n0722_003:0424c21_4"
    },
    {
        "source_sentence": "人及非人，世及出世，正道、非道，若男、若女，善惡業果，真實虛妄，",
        "translation": "Whether human or non-human, worldly or supramundane, right path or wrong path, whether male or female, the results of good and bad actions are real and false.",
        "source": "T17n0722_003:0424c22_5"
    },
    {
        "source_sentence": "宮殿房室，恭敬供養，乃至一切諸染淨境，勿起妄執，亦非憎嫉。",
        "translation": "Don't give rise to false attachments and don't hate or resent all the defiled and pure objects of palaces, dwellings, and houses with respect and offerings.",
        "source": "T17n0722_003:0424c24_6"
    },
    {
        "source_sentence": "真實離妄，悲愍有情，入聖階漸，遠離地獄，損壞琰魔，除滅黑暗，修習智慧。",
        "translation": "They are genuine, free of falsehood, compassionate to sentient beings, gradually entering the noble stages, far removed from hell, harming and destroying Māra, extinguishing darkness, and cultivating wisdom.",
        "source": "T17n0722_003:0424c25_7"
    },
    {
        "source_sentence": "貪、忿染因，猶如火毒，悉應捨離；",
        "translation": "The defiling causes of greed and anger are like the poison of fire. They should all be abandoned.",
        "source": "T17n0722_003:0424c27_8"
    },
    {
        "source_sentence": "業報艱辛，懺悔發露，不應覆藏。",
        "translation": "The karmic retribution is so difficult and painful that it shouldn't be hidden in repentance or revealed.",
        "source": "T17n0722_003:0424c28_9"
    },
    {
        "source_sentence": "文字曉了，宣說苦因，咸應遠離。」",
        "translation": "The words are clear, proclaiming the causes of suffering, and they should all be far removed.",
        "source": "T17n0722_003:0424c29_10"
    },
    {
        "source_sentence": "佛告比丘：「若復有人於諸惡友及他眷屬，勿生憎嫉，應起是念：『我從無始多劫已來，",
        "translation": "The Buddha said to the bhikṣus: Again, if someone is neither jealous of bad friends nor hostile toward their followers, he should think thus: “Since beginningless time for many kalpas I have never been angry with anyone.",
        "source": "T17n0722_003:0425a01_0"
    },
    {
        "source_sentence": "輪轉諸趣，父母親族，善友知識，輪轉生死往來不定；",
        "translation": "They transmigrate in all states of existence, with their parents, relatives, friends, and knowledgeable ones. The transmigration of birth and death is uncertain as to where they will come and go.",
        "source": "T17n0722_003:0425a02_1"
    },
    {
        "source_sentence": "於諸有情，應當悲愍起親愛想。』",
        "translation": "In sentient beings, they should compassionately give rise to thoughts of affection.'",
        "source": "T17n0722_003:0425a04_2"
    },
    {
        "source_sentence": "貪、瞋等惑，由此遠離。」",
        "translation": "As a result, they're free of the afflictions of greed and anger.",
        "source": "T17n0722_003:0425a04_3"
    },
    {
        "source_sentence": "時，諸比丘白世尊言：「若復有人虛妄兩舌，離間彼此，當感何果？",
        "translation": "The monks then said to the Bhagavān, Suppose there's another person who speaks falsely and duplicitously, separated from each other, what effect will they attain?",
        "source": "T17n0722_003:0425a06_0"
    },
    {
        "source_sentence": "願佛演說，我等樂聞利益未來一切有情。」",
        "translation": "May the Buddha teach it, and we'll happily hear it for the benefit of all sentient beings in the future.",
        "source": "T17n0722_003:0425a07_1"
    },
    {
        "source_sentence": "佛告比丘：「應知兩舌獲報差別，略有十種。",
        "translation": "The Buddha told the monks, You should know that there are slightly ten kinds of distinctions in the rewards received by duplicitous speech.",
        "source": "T17n0722_003:0425a08_2"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T17n0722_003:0425a09_3"
    },
    {
        "source_sentence": "一、種族卑賤，眷屬乖離；",
        "translation": "The first is that their clans are inferior, and their followers are divided.",
        "source": "T17n0722_003:0425a09_4"
    },
    {
        "source_sentence": "二、遠離善友，惡友增多；",
        "translation": "The second is to be far removed from good friends, increasing the number of bad friends.",
        "source": "T17n0722_003:0425a10_5"
    },
    {
        "source_sentence": "三、愚癡暗鈍，增長過非；",
        "translation": "The third is ignorance and dullness, which increases in error.",
        "source": "T17n0722_003:0425a10_6"
    },
    {
        "source_sentence": "四、毀謗聖賢，不信因果；",
        "translation": "The fourth is to disparage saints and wise ones, not believing in the law of cause and effect.",
        "source": "T17n0722_003:0425a11_7"
    },
    {
        "source_sentence": "五、藏護己失，樂說他非；",
        "translation": "The fifth is that they hide their faults to protect themselves, delighting in telling others what is not right.",
        "source": "T17n0722_003:0425a11_8"
    },
    {
        "source_sentence": "六、虛妄轉增，忠實行寡；",
        "translation": "The sixth is that falsehood increases, while the practice of loyalty is weak.",
        "source": "T17n0722_003:0425a12_9"
    },
    {
        "source_sentence": "七、死墮地獄，受苦無窮；",
        "translation": "The seventh is that they die and fall into hell, suffering endless pain.",
        "source": "T17n0722_003:0425a12_10"
    },
    {
        "source_sentence": "八、恣縱貪、瞋，惡名流布；",
        "translation": "The eighth is that they indulge in greed and hatred, which are widely known as evil.",
        "source": "T17n0722_003:0425a13_11"
    },
    {
        "source_sentence": "九、財貨散失，恒時憂苦；",
        "translation": "Their wealth and possessions are scattered, constantly grieved and distressed.",
        "source": "T17n0722_003:0425a13_12"
    },
    {
        "source_sentence": "十、遠離正法，恒生邊地。",
        "translation": "10. Being far removed from the right teaching, they'll always be born in a marginal place.",
        "source": "T17n0722_003:0425a14_13"
    },
    {
        "source_sentence": "比丘應知，兩舌之業獲報如是，不應執著，皆當棄捨。」",
        "translation": "A monk should know that the results of duplicitous actions are thus rewarded, so he shouldn't cling to them or abandon them.",
        "source": "T17n0722_003:0425a14_14"
    },
    {
        "source_sentence": "於是比丘復白佛言：「若有眾生發麁惡語，感於何果？」",
        "translation": "The monk then again said to the Buddha, If sentient beings give rise to angry words, what result will they attain?",
        "source": "T17n0722_003:0425a17_0"
    },
    {
        "source_sentence": "佛告比丘：「應知語業，獲報有十。",
        "translation": "The Buddha told the monks, You should know that there are ten rewards for verbal actions.",
        "source": "T17n0722_003:0425a18_1"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T17n0722_003:0425a18_2"
    },
    {
        "source_sentence": "一者、口出刃焰，焚燒自身；",
        "translation": "The first is that the flame of a sword emanates from their mouths and burns themselves.",
        "source": "T17n0722_003:0425a19_3"
    },
    {
        "source_sentence": "二者、邪見熾盛，無惡不作；",
        "translation": "The second is that wrong views flourish and there is neither evil nor non-evil.",
        "source": "T17n0722_003:0425a19_4"
    },
    {
        "source_sentence": "三者、遠離聖賢，日增惡友；",
        "translation": "3. Being far removed from the noble and virtuous, they increase in number of bad companions.",
        "source": "T17n0722_003:0425a20_5"
    },
    {
        "source_sentence": "四者、眾皆厭棄，猶如諸毒；",
        "translation": "The fourth is that all sentient beings are disgusted, just like poison.",
        "source": "T17n0722_003:0425a20_6"
    },
    {
        "source_sentence": "五者、外器險隘，高下不等；",
        "translation": "The fifth is that external vessels are dangerous and narrow, unequal in height.",
        "source": "T17n0722_003:0425a21_7"
    },
    {
        "source_sentence": "六者、煩惱熾盛，壞散財物；",
        "translation": "The sixth is that the defilements are so intense that they destroy and disperse property.",
        "source": "T17n0722_003:0425a22_8"
    },
    {
        "source_sentence": "七者、焚燒眾善，非法轉增；",
        "translation": "The seventh is that they burn up goodness and increase it unlawfully.",
        "source": "T17n0722_003:0425a22_9"
    },
    {
        "source_sentence": "八者、身體臭穢，聞皆嫌厭；",
        "translation": "The eighth is that their bodies smell bad and filthy, and all those who hear them dislike it.",
        "source": "T17n0722_003:0425a23_10"
    },
    {
        "source_sentence": "九者、支節枯乾，恒時病苦；",
        "translation": "The ninth is that their limbs are withered and dry, constantly suffering from illness.",
        "source": "T17n0722_003:0425a23_11"
    },
    {
        "source_sentence": "十者、死墮險趣，輪轉生死。",
        "translation": "10. Death falls into a dangerous destiny and transmigrates in birth-and-death.",
        "source": "T17n0722_003:0425a24_12"
    },
    {
        "source_sentence": "比丘應知，麁惡語業，招如斯報，汝應遠離。」",
        "translation": "A monk should know that such is the result of anger and bad speech, and you should be far removed from it.",
        "source": "T17n0722_003:0425a25_13"
    },
    {
        "source_sentence": "「眾善應可愛，　　如父復如母，",
        "translation": "All good deeds should be desirable, just like father and mother.",
        "source": "T17n0722_003:0425a27_0"
    },
    {
        "source_sentence": "　美善體安然，　　能離於喧諍；",
        "translation": "The essence of goodness and virtue is peaceful, Able to get rid of the noisy noise.",
        "source": "T17n0722_003:0425a27_0"
    },
    {
        "source_sentence": "　美善人天喜，　　美善增勤勇；",
        "translation": "Delighting in goodness, people and gods rejoice; Delighting in goodness, they increase diligence and courage.",
        "source": "T17n0722_003:0425a27_0"
    },
    {
        "source_sentence": "　美善眷屬多，　　美善三塗離；",
        "translation": "The followers of the virtuous one are numerous; The virtuous one is free from the three evil destinies.",
        "source": "T17n0722_003:0425a27_0"
    },
    {
        "source_sentence": "　美善息諸惡，　　美善離煩惱，",
        "translation": "Goodness ceases evil, and goodness is freed from afflictions.",
        "source": "T17n0722_003:0425a27_0"
    },
    {
        "source_sentence": "　能棄語過非，　　應修諸眾善。」",
        "translation": "If you can discard what's wrong and right, you should cultivate the goodness of all people.",
        "source": "T17n0722_003:0425a27_0"
    },
    {
        "source_sentence": "爾時，世尊乃說頌言：爾時，世尊說此偈已，告諸比丘：「如是所發麁惡之語，",
        "translation": "At that time the World-honored One uttered these verses: At that time, having uttered these verses, the World-honored One said to the monks:",
        "source": "T17n0722_003:0425a27_0"
    },
    {
        "source_sentence": "悉應遠離，伏除不起勿令增長，墮於地獄受飢渴苦，種種痛惱。",
        "translation": "They should all be far removed, subdued and not allowed to grow, and they'll fall into hell with hunger, thirst, pain, and various kinds of pain.",
        "source": "T17n0722_003:0425b06_1"
    },
    {
        "source_sentence": "於彼惡趣，恒時飢渴如火焚燒，常思飲食，量如芥子，終不能得，何況多食！",
        "translation": "In those evil destinies, they're constantly hungry and thirsty like a fire that burns them. They always think of food and drink as small as a mustard seed, but they can't get it, so why wouldn't they get much food?",
        "source": "T17n0722_003:0425b07_2"
    },
    {
        "source_sentence": "「比丘應知，彼諸有情，由此惡業極苦纏縛，飢渴焰火，相續逼迫時無暫息。",
        "translation": "“Monks, you should know that these sentient beings are bound by bad karma and extremely painful fetters of hunger, thirst, and the fire of flames, which continue to oppress them without cease for a long time.",
        "source": "T17n0722_003:0425b10_0"
    },
    {
        "source_sentence": "如是苦果，皆由虛妄、麁惡語業之所招感。",
        "translation": "Such painful results are all the result of actions that are induced by false speech and harsh words.",
        "source": "T17n0722_003:0425b11_1"
    },
    {
        "source_sentence": "比丘應知，虛妄惡業及諸功德、人天勝善，皆由心造。",
        "translation": "A monk should know that false bad actions, merits, humans and gods, and superior goodness are all created by the mind.",
        "source": "T17n0722_003:0425b12_2"
    },
    {
        "source_sentence": "若癡增上，輕毀賢善，起惡意業，遠離平等，樂說彼此長短是非，如油欲盡燈光漸暗，",
        "translation": "When delusion increases, one despises the wise and virtuous, produces bad thoughts and actions, is far removed from equanimity, delights in exchanging ideas of length and shortness, and right and wrong, like a flame that gradually disappears when it wants to run out of oil.",
        "source": "T17n0722_003:0425b13_3"
    },
    {
        "source_sentence": "智慧損減，過犯轉增。",
        "translation": "Their wisdom is impaired, and their transgressions increase.",
        "source": "T17n0722_003:0425b15_4"
    },
    {
        "source_sentence": "是故，比丘恒應遠離虛妄惡業，勿令侵害；",
        "translation": "For this reason, a monk should always abstain from unreal evil deeds and not allow others to do them.",
        "source": "T17n0722_003:0425b16_5"
    },
    {
        "source_sentence": "於他名利，若生嫉妬及諸忿等，惱亂身心，時無暫息。",
        "translation": "When jealousy and anger, etc., arise in relation to the fame or profit of others, they disturb body and mind without ceasing for a little while.",
        "source": "T17n0722_003:0425b17_6"
    },
    {
        "source_sentence": "比丘應知，此等惡因，焚燒自善，於當來世，必招苦果輪迴不息，應當棄捨。」",
        "translation": "A monk should know that these bad causes burn up their own goodness, which will surely bring painful results in future lives and won't stop transmigration; they should be abandoned.",
        "source": "T17n0722_003:0425b18_7"
    },
    {
        "source_sentence": "時，諸比丘復白佛言：「若有眾生於情、非情，恒起瞋忿，獲於何報？」",
        "translation": "The monks then again said to the Buddha, If sentient beings always become angry with feelings and non-feelings, what reward will they attain?",
        "source": "T17n0722_003:0425b20_0"
    },
    {
        "source_sentence": "佛告比丘：「應知瞋忿，於當來世，得十衰損。",
        "translation": "The Buddha told the monks, You should know that anger and wrath will cause ten kinds of decline in future lives.",
        "source": "T17n0722_003:0425b22_0"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T17n0722_003:0425b22_1"
    },
    {
        "source_sentence": "一者、冤家增盛，人皆嫌厭；",
        "translation": "The first is that enemies will flourish and all the people will become disgusted.",
        "source": "T17n0722_003:0425b23_2"
    },
    {
        "source_sentence": "二者、生於邊地，遠離正法。",
        "translation": "2. They're born in a marginal land and are far removed from the right teaching.",
        "source": "T17n0722_003:0425b23_3"
    },
    {
        "source_sentence": "三者、縈纏諸病，貧乏困苦；",
        "translation": "The third is that they are bound by the afflictions of disease and suffer from poverty and distress.",
        "source": "T17n0722_003:0425b24_4"
    },
    {
        "source_sentence": "四者、死墮豺狼，巇險暴惡；",
        "translation": "The fourth is that they die and fall into the hands of jackals and wolves, which are dangerous and violent.",
        "source": "T17n0722_003:0425b24_5"
    },
    {
        "source_sentence": "五者，或處毒蛇，恒時瞋恚；",
        "translation": "The fifth is that they may be in the presence of poisonous snakes and always angry.",
        "source": "T17n0722_003:0425b25_6"
    },
    {
        "source_sentence": "六者、諸根醜陋，眷屬乖離；",
        "translation": "The sixth is that their faculties are ugly, with divergent followers.",
        "source": "T17n0722_003:0425b26_7"
    },
    {
        "source_sentence": "七者、死墮黑繩，受苦相續；",
        "translation": "The seventh is that when they die they fall into the black rope and suffer continually.",
        "source": "T17n0722_003:0425b26_8"
    },
    {
        "source_sentence": "八者、肢體乾焦，眾苦燒然；",
        "translation": "The eighth is that their limbs and bodies become dry and scorched, with all kinds of pain and burning.",
        "source": "T17n0722_003:0425b27_9"
    },
    {
        "source_sentence": "九者、增於邪執，毀謗聖賢；",
        "translation": "The ninth is that they increase wrong attachment and slander saints and virtuous ones.",
        "source": "T17n0722_003:0425b27_10"
    },
    {
        "source_sentence": "十者、恒處三塗，輪轉不息。",
        "translation": "10. The three destinies of the eternal realm and the three destinies of transmigration don't cease.",
        "source": "T17n0722_003:0425b28_11"
    },
    {
        "source_sentence": "如是十種，皆由瞋恚。",
        "translation": "These ten are all due to hatred.",
        "source": "T17n0722_003:0425b29_12"
    },
    {
        "source_sentence": "比丘當知，悉應遠離。」",
        "translation": "A monk should know that they should all be kept away from them.",
        "source": "T17n0722_003:0425b29_13"
    },
    {
        "source_sentence": "爾時，比丘復白佛言：「若有眾生恒修無瞋，獲於何報？」",
        "translation": "It was then that the monk again said to the Buddha, If there are sentient beings who always cultivate no anger, what reward will they attain?",
        "source": "T17n0722_003:0425c02_0"
    },
    {
        "source_sentence": "佛告比丘：「得十勝利。",
        "translation": "The Buddha told the monks, They attain ten benefits.",
        "source": "T17n0722_003:0425c03_1"
    },
    {
        "source_sentence": "何等為十？",
        "translation": "What are these ten?",
        "source": "T17n0722_003:0425c03_2"
    },
    {
        "source_sentence": "一者、善美流布；",
        "translation": "The first is the spread of goodness and virtue.",
        "source": "T17n0722_003:0425c03_3"
    },
    {
        "source_sentence": "二者、遠離慢輕；",
        "translation": "The second is that they are free of conceit.",
        "source": "T17n0722_003:0425c04_4"
    },
    {
        "source_sentence": "三者、能伏瞋恚；",
        "translation": "The third is that they are able to quell anger.",
        "source": "T17n0722_003:0425c04_5"
    },
    {
        "source_sentence": "四者、三塗捨離；",
        "translation": "The fourth is that they abandon the three defilements.",
        "source": "T17n0722_003:0425c04_6"
    },
    {
        "source_sentence": "五者、冤敵不侵；",
        "translation": "The fifth is that enemies will not attack them.",
        "source": "T17n0722_003:0425c05_7"
    },
    {
        "source_sentence": "六者、恒生人天；",
        "translation": "The sixth is that they are constantly reborn among humans and gods.",
        "source": "T17n0722_003:0425c05_8"
    },
    {
        "source_sentence": "七者、眷屬圓滿；",
        "translation": "The seventh is the fulfillment of dependents.",
        "source": "T17n0722_003:0425c06_0"
    },
    {
        "source_sentence": "八者、諸根無缺；",
        "translation": "The eighth is that their faculties are not deficient.",
        "source": "T17n0722_003:0425c06_1"
    },
    {
        "source_sentence": "九者、色相具足；",
        "translation": "The ninth is that they are endowed with the characteristics of form.",
        "source": "T17n0722_003:0425c06_2"
    },
    {
        "source_sentence": "十者、成就解脫。",
        "translation": "Tenth, accomplishing liberation.",
        "source": "T17n0722_003:0425c07_3"
    },
    {
        "source_sentence": "比丘應知，如是勝利，汝當修習。」",
        "translation": "A monk should know that such benefits will be cultivated by you.",
        "source": "T17n0722_003:0425c07_4"
    },
    {
        "source_sentence": "「衰損由瞋業，　　沈淪苦海深，",
        "translation": "Their weakness is due to their anger, sinking into the deep sea of suffering.",
        "source": "T17n0722_003:0425c09_0"
    },
    {
        "source_sentence": "　諸根多缺陋，　　逼迫事難任。",
        "translation": "Their faculties are often lacking, and it's difficult to tolerate things that oppress them.",
        "source": "T17n0722_003:0425c09_0"
    },
    {
        "source_sentence": "　善因生善道，　　非法入埿梨，",
        "translation": "Good causes give rise to good paths, and it's not a violation to enter the store.",
        "source": "T17n0722_003:0425c09_0"
    },
    {
        "source_sentence": "　傍生并鬼趣，　　善惡業恒隨。」",
        "translation": "Paranirmita-vaśavartin and the ghostly destinies are always accompanied by good and bad actions.",
        "source": "T17n0722_003:0425c09_0"
    },
    {
        "source_sentence": "爾時，世尊乃說頌言：爾時，世尊說此偈已，告諸比丘：「善、惡之業，",
        "translation": "At that time the World-honored One uttered these verses: At that time, having uttered these verses, the World-honored One said to the monks:",
        "source": "T17n0722_003:0425c09_0"
    },
    {
        "source_sentence": "損、益不同，互相增減，隨業勢力，受報非虛。」",
        "translation": "The gains and losses are different, increasing and decreasing each other, and the rewards received according to the strength of karma aren't false.",
        "source": "T17n0722_003:0425c14_1"
    },
    {
        "source_sentence": "時，諸比丘復白佛言：「有情慳貪，不行惠施，自無依託，迷暗愚癡，",
        "translation": "The monks then again said to the Buddha: Sentient beings are stingy and greedy, not practicing charity or generosity. They do not rely on others for their support and are deluded in darkness and folly.",
        "source": "T17n0722_003:0425c16_0"
    },
    {
        "source_sentence": "不信因果，毀謗聖賢，獲報云何？」",
        "translation": "What's the reward for not believing in causes and effects and disparaging noble people?",
        "source": "T17n0722_003:0425c17_1"
    },
    {
        "source_sentence": "佛告比丘：「若諸有情，慳貪不信；",
        "translation": "The Buddha said to the bhikṣus: Sentient beings are greedy and unbelieving.",
        "source": "T17n0722_003:0425c19_0"
    },
    {
        "source_sentence": "於諸財物，自不受用，何況施他？",
        "translation": "They don't accept their own possessions for use, so why wouldn't they give them to others?",
        "source": "T17n0722_003:0425c19_1"
    },
    {
        "source_sentence": "應知，比丘！",
        "translation": "You should know, monks!",
        "source": "T17n0722_003:0425c20_2"
    },
    {
        "source_sentence": "無智愚人，遠離善友，復造諸非。",
        "translation": "A foolish man lacking knowledge is far removed from good friends and creates what's wrong again.",
        "source": "T17n0722_003:0425c20_3"
    },
    {
        "source_sentence": "由此因緣，墮諸地獄受苦無窮。」",
        "translation": "Because of these causes and conditions, they'll fall into the hells and suffer pain without limit.",
        "source": "T17n0722_003:0425c21_4"
    },
    {
        "source_sentence": "彼諸比丘聞是語已，憂愁悲惱，哽咽號泣。",
        "translation": "When those monks heard these words, they were grieved and distressed, choked and weeping.",
        "source": "T17n0722_003:0425c22_5"
    },
    {
        "source_sentence": "復白佛言：「此諸有情，復於何時，當捨此苦？",
        "translation": "Again, he said to the Buddha, When will these sentient beings again abandon this suffering?",
        "source": "T17n0722_003:0425c24_0"
    },
    {
        "source_sentence": "願佛演說，利益未來。」",
        "translation": "May the Buddha expound it for the benefit of the future.",
        "source": "T17n0722_003:0425c24_1"
    },
    {
        "source_sentence": "「人間六萬歲，　　阿部陀晝夜，",
        "translation": "At the age of sixty thousand years in the human world, A Forest of Pearls from the Dharma Garden, Volume II (Skt. abhidharma) it is day and night:",
        "source": "T17n0722_003:0425c26_0"
    },
    {
        "source_sentence": "　積彼年及月，　　初三萬六千；",
        "translation": "The accumulation of those years and months is the first thirty-six thousand [in number].",
        "source": "T17n0722_003:0425c26_0"
    },
    {
        "source_sentence": "　承斯餘壽命，　　後後二萬增，",
        "translation": "As a result, the remaining life span increases by twenty thousand years.",
        "source": "T17n0722_003:0425c26_0"
    },
    {
        "source_sentence": "　八寒大地獄，　　相續苦無盡。」",
        "translation": "The eight great hells of coldness continue to suffer endlessly.",
        "source": "T17n0722_003:0425c26_0"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘，乃說頌曰：爾時，世尊說此偈已，告諸比丘：「此大地獄受苦有情，",
        "translation": "At that time the World-honored One addressed the monks in verse: Having uttered these verses, the World-honored One said to the monks:",
        "source": "T17n0722_003:0425c26_0"
    },
    {
        "source_sentence": "由身、語、意，輕慢賢善，毀謗正法，造作非法，破壞佛形，焚燒經典，",
        "translation": "Because of their bodily, verbal, and mental actions, they despise the wise and good, disparage the true teaching, commit unlawful acts, disfigure the buddha image, burn scriptures,",
        "source": "T17n0722_003:0426a03_1"
    },
    {
        "source_sentence": "謗真實法，言無義味。",
        "translation": "They denigrate the true teaching, saying it has no meaningful taste.",
        "source": "T17n0722_003:0426a04_2"
    },
    {
        "source_sentence": "由此業因，牽引有情墮險惡處，種種治罰相續受苦而無窮盡。」",
        "translation": "As a result of these karmic causes, sentient beings are led into dangerous places and various punishments continue to experience suffering without limit.",
        "source": "T17n0722_003:0426a05_3"
    },
    {
        "source_sentence": "時，諸比丘復白佛言：「若復有人於佛正法，甚深經典讀誦演說，令他信受，",
        "translation": "The monks then again said to the Buddha: Suppose there is another person who recites and teaches the profound scripture of the true-dharma of the Buddha, so as to convince others to believe in it.",
        "source": "T17n0722_003:0426a07_0"
    },
    {
        "source_sentence": "發菩提心，獲何勝利？」",
        "translation": "What advantage does it obtain to give rise to the mind of enlightenment?",
        "source": "T17n0722_003:0426a08_1"
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「功德無量，微妙最勝！",
        "translation": "It was then that the Buddha addressed the monks, saying, The merit is immeasurable, subtle and most excellent!",
        "source": "T17n0722_003:0426a10_0"
    },
    {
        "source_sentence": "此諸有情，受持讀誦如是深法，敷演解說依法修行，起於正信；",
        "translation": "These sentient beings receive, retain, read, and recite such profound teachings; they develop, expound, explain, and practice them according to the Dharma. They engender right faith.",
        "source": "T17n0722_003:0426a10_1"
    },
    {
        "source_sentence": "伏除障染，遠離惡趣，恒處人天，安隱快樂，一切聖賢護助稱讚。",
        "translation": "He subdues the defilement of hindrances, is far removed from bad destinies, always abides among humans and gods, is peaceful and happy, and is praised by all sages and wise protectors.",
        "source": "T17n0722_003:0426a12_2"
    },
    {
        "source_sentence": "於當來世獲得最上，多聞、總持、福德、智慧；",
        "translation": "In the future he will attain the highest [achievement]: extensive learning, omniscience, merit, and wisdom.",
        "source": "T17n0722_003:0426a13_3"
    },
    {
        "source_sentence": "憶念不忘；",
        "translation": "They remember and do not forget.",
        "source": "T17n0722_003:0426a14_4"
    },
    {
        "source_sentence": "宮殿珍寶，悉皆具足；",
        "translation": "The palaces and jewels were all plentiful.",
        "source": "T17n0722_003:0426a15_0"
    },
    {
        "source_sentence": "乃至圓寂，速得成就；",
        "translation": "They quickly attain enlightenment, reaching the state of perfect quiescence.",
        "source": "T17n0722_003:0426a15_1"
    },
    {
        "source_sentence": "恒離老、病，慳貪、嫉妬，迷惑醉亂，毀謗正法，虛妄、邪執；",
        "translation": "They are always free of old age, sickness, avarice, greed, jealousy, delusion, intoxication, slander, falsehood, and wrong attachment.",
        "source": "T17n0722_003:0426a15_2"
    },
    {
        "source_sentence": "八難艱險及諸非法，悉能遠離。」",
        "translation": "Eight difficulties, difficulties, dangers, and unlawfulness can all be avoided.",
        "source": "T17n0722_003:0426a17_3"
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「若復有人愚迷邪執，於諸世間虛妄愛樂，廣造諸非；",
        "translation": "It was then that the Buddha addressed the monks, saying: Again, if there are those who are deluded and wrongly clinging, falsely delighting in worldly things and creating all kinds of unwholesomeness.",
        "source": "T17n0722_003:0426a18_0"
    },
    {
        "source_sentence": "於其所作，亦無悔恨，其心增盛，諸惡相續，不怖險處遠離善友。",
        "translation": "They have no regrets or resentment about what they do. Their minds become stronger and evil continues, and they aren't afraid of dangerous places or being far removed from good friends.",
        "source": "T17n0722_003:0426a19_1"
    },
    {
        "source_sentence": "由此業因，輪轉地獄受苦澁果，決定非虛。",
        "translation": "As a result of this action, the pain and suffering experienced in transmigration in hell definitely are not false.",
        "source": "T17n0722_003:0426a21_2"
    },
    {
        "source_sentence": "「比丘應知，諸有智者，悉皆捨離諸不善業，發起正信修習對治。",
        "translation": "“Monks, you should know that all wise people abandon unwholesome actions and give rise to right faith and cultivate the antidote.",
        "source": "T17n0722_003:0426a23_0"
    },
    {
        "source_sentence": "「比丘當知，由心造罪，獲果亦然；",
        "translation": "“Monks, you should know that sin is committed by reason of the mind. The same applies to sins acquired as fruit.",
        "source": "T17n0722_003:0426a25_0"
    },
    {
        "source_sentence": "解脫生死，流轉諸趣，亦由於心；",
        "translation": "Being liberated from birth and death, they also transmigrate in all states of existence through the mind.",
        "source": "T17n0722_003:0426a25_1"
    },
    {
        "source_sentence": "能行諂誑，又能調伏，亦能暴惡，能趣三塗，得大怖畏，亦由於心；",
        "translation": "They are able to engage in hypocrisy and deceit, they can also be disciplined. They are also able to commit violence or evil. They can proceed toward the three realms of rebirth (i.e., nirvana) and attain great fear through their minds.",
        "source": "T17n0722_003:0426a26_2"
    },
    {
        "source_sentence": "又能捨離，修諸善法；",
        "translation": "They can also relinquish and cultivate wholesome states.",
        "source": "T17n0722_003:0426a27_3"
    },
    {
        "source_sentence": "而能棄背，真實安樂；",
        "translation": "Instead, they are able to turn their backs and find true peace and happiness.",
        "source": "T17n0722_003:0426a28_4"
    },
    {
        "source_sentence": "及能遠離虛妄、顛倒，種種因緣、果報差別；",
        "translation": "They are also able to be free of falsehood and delusion, various reasons and distinctions in retribution.",
        "source": "T17n0722_003:0426a28_5"
    },
    {
        "source_sentence": "若假、若實，獲報決定及不決定，有益、無益，若善、非善，皆能遠離。",
        "translation": "Whether provisional or real, the rewards they receive are determined or indeterminate, beneficial or useless, and whether good or bad, they can all be avoided.",
        "source": "T17n0722_003:0426a29_6"
    },
    {
        "source_sentence": "亦能顯於二空之理，譬如明燈能破黑暗，復能顯現諸物像等，心亦如是。",
        "translation": "It can also express the principle of the two kinds of emptiness, like a bright lamp that breaks through darkness and manifests objects such as images. So it is with the mind.",
        "source": "T17n0722_003:0426b02_7"
    },
    {
        "source_sentence": "又如善惡，因果差別，互相隨逐，恒不捨離，輪轉諸趣，亦由於心；",
        "translation": "Also, just as good and evil are separated by distinctions in cause and effect, following each other without abandoning or distancing one from the other. The courses of transmigration also have mind for their support.",
        "source": "T17n0722_003:0426b03_8"
    },
    {
        "source_sentence": "又如染、淨、隱、顯雖殊，互相增減，假、實理事，亦非即離。",
        "translation": "Also, even though defilement, purity, concealment, and manifestation are different, they increase and decrease from one another, and neither the provisional nor the real principle is distinct.",
        "source": "T17n0722_003:0426b05_9"
    },
    {
        "source_sentence": "正見、邪執，愛、非愛業，出離、沈淪，理非即離，皆由心造。",
        "translation": "Right view and wrong attachment, desired and undesirable actions, renunciation and sinking are all created by the mind. The principle is not that they are separate:",
        "source": "T17n0722_003:0426b06_10"
    },
    {
        "source_sentence": "「比丘應知，諸業繫縛，往來生死猶如羂索，繫縛有情，恒不自在。",
        "translation": "“Monks, you should know that karma is bound by past and future births and deaths like a fetter, which binds sentient beings and never has control over them.",
        "source": "T17n0722_003:0426b08_0"
    },
    {
        "source_sentence": "愚迷虛妄，煩惱纏縛，障覆真理，令智不起，於法、非法不能了達；",
        "translation": "Foolish delusion is unreal, bound by the bonds of afflictions, obstructing truth and preventing knowledge from being produced. They do not comprehend doctrine or non doctrine.",
        "source": "T17n0722_003:0426b09_1"
    },
    {
        "source_sentence": "亦非修習趣證之行，二空真理，無由顯證。",
        "translation": "Nor is it the practice of cultivating the realization of destinies, and there's no way to reveal the truth of the two kinds of emptiness.",
        "source": "T17n0722_003:0426b10_2"
    },
    {
        "source_sentence": "「比丘當知，此由無明，迷於正理，於佛教法曾無所悟，障礙留難；",
        "translation": "“Monks, you should know that it is because of ignorance that they are deluded about the true doctrine. They have never awakened to the teachings of Buddhism and have been unable to find any obstacle or difficulty in them.",
        "source": "T17n0722_003:0426b12_0"
    },
    {
        "source_sentence": "自不依修，復障他學，妄說過非，深增厭離。",
        "translation": "They themselves do not rely on cultivation, and further hinder others from learning. Falsely speaking falsely about faults and errors, they deeply become disgusted with separation.",
        "source": "T17n0722_003:0426b13_1"
    },
    {
        "source_sentence": "由此業因，毀謗正法，諸佛冤賊，世世愚昧，恒墮黑暗地獄之中，備受眾苦而無窮盡；",
        "translation": "As a result of their actions, they denigrate the true teaching. The Buddhas are enemies and thieves, ignorant from generation to generation, constantly falling into dark hells, enduring countless tortures.",
        "source": "T17n0722_003:0426b14_2"
    },
    {
        "source_sentence": "從彼出已，復墮餓鬼，愚迷暴惡，互相殘害，恒時受苦，飢渴逼迫而無暫息，",
        "translation": "Having emerged from that, they will again fall into the realm of hungry ghosts. Foolish and deluded, they are wicked and violent, inflicting harm on each other. They suffer pain all the time, being oppressed by hunger and thirst without cease.",
        "source": "T17n0722_003:0426b16_3"
    },
    {
        "source_sentence": "受種種苦；",
        "translation": "They experience various kinds of suffering.",
        "source": "T17n0722_003:0426b17_4"
    },
    {
        "source_sentence": "復從彼出，墮畜生中，疲乏飢困，眾苦纏縛，恒無止息，瞋心增猛，互相食噉，",
        "translation": "Again, they emerge from that world and fall into the realm of animals. They are exhausted and hungry, bound by various painful fetters, constantly unable to rest. Their anger grows more intense and they feed on each other.",
        "source": "T17n0722_003:0426b18_5"
    },
    {
        "source_sentence": "極惡意樂，相續不斷。",
        "translation": "Their extremely bad intentions are continuous and unceasing.",
        "source": "T17n0722_003:0426b19_6"
    },
    {
        "source_sentence": "亦如世火能燒林野，此業亦爾，能燒眾善，損害有情。」",
        "translation": "It's also like the worldly fire that burns forests and fields, and so is this action that burns goodness and harms sentient beings.",
        "source": "T17n0722_003:0426b20_7"
    },
    {
        "source_sentence": "「迷惑諸有情，　　謗佛毀正法，",
        "translation": "Sentient beings are confused, denigrating the Buddha and disparaging the true teaching.",
        "source": "T17n0722_003:0426b22_0"
    },
    {
        "source_sentence": "　墮落於三塗，　　窮劫不能出；",
        "translation": "They will fall into the three evil realms And cannot escape for an entire aeon.",
        "source": "T17n0722_003:0426b22_0"
    },
    {
        "source_sentence": "　恒處地獄苦，　　黑暗絕光明，",
        "translation": "The hells are always painful, darkened by darkness and no light.",
        "source": "T17n0722_003:0426b22_0"
    },
    {
        "source_sentence": "　餓鬼及傍生，　　飢虛無窮盡；",
        "translation": "Hungry ghosts and the unenlightened have no limit to their hunger.",
        "source": "T17n0722_003:0426b22_0"
    },
    {
        "source_sentence": "　有情由業縛，　　智慧煩惱覆，",
        "translation": "Sentient beings are bound by the afflictions of action, and their knowledge is bound by the afflictions.",
        "source": "T17n0722_003:0426b22_0"
    },
    {
        "source_sentence": "　險惡海沈淪，　　劫壞不能免。」",
        "translation": "The dangerous ocean is submerged, and an eon of destruction can't escape it.",
        "source": "T17n0722_003:0426b22_0"
    },
    {
        "source_sentence": "爾時，世尊乃說頌曰：爾時，世尊說此偈已，告諸比丘：「由前謗法惡業之因，",
        "translation": "At that time the World-honored One uttered these verses: At that time, having uttered these verses, the World-honored One said to the monks:",
        "source": "T17n0722_003:0426b22_0"
    },
    {
        "source_sentence": "輪轉三塗受苦無量，從彼出已，若生人中，貧窮困苦，諸根不具，飢渴所逼，",
        "translation": "The suffering of the transmigration in the three destinies is immeasurable. Having emerged from them, if he were to be born among humans, he would suffer poverty and distress, not having all his faculties, being oppressed by hunger and thirst.",
        "source": "T17n0722_003:0426c01_1"
    },
    {
        "source_sentence": "煩惱增盛，其性暴惡，猶如象馬，[怡-台+龍]悷不調，愚迷邪執，",
        "translation": "Their passions grow in strength and their nature is violent like an elephant or a horse. They are unruly, wicked, ignorant, deluded, and holding wrong views.",
        "source": "T17n0722_003:0426c02_2"
    },
    {
        "source_sentence": "恒時相應，病苦纏縛而無間斷，其心放逸，虛妄攀緣，時無止息；",
        "translation": "They are constantly conjoined with each other, bound by the bondage of sickness and suffering without interruption. Their minds are undisciplined, falsely clinging to objects; they do not cease at any time.",
        "source": "T17n0722_003:0426c04_3"
    },
    {
        "source_sentence": "聾、盲、瘖、瘂，不值正法，恒處邊地，智慧乏少，愚癡邪執，受種種苦而無窮盡。",
        "translation": "They are deaf, blind, dumb, and dumb, unable to find the right teaching, always on the sidelines, lacking wisdom, ignorant, mistakenly attached, and subject to various kinds of suffering without end.",
        "source": "T17n0722_003:0426c05_4"
    },
    {
        "source_sentence": "比丘應知，謗法之罪，獲報無量，說不能盡。」",
        "translation": "A monk should know that the sin of denigrating the Dharma receives measureless rewards and can't be explained in full.",
        "source": "T17n0722_003:0426c07_5"
    },
    {
        "source_sentence": "佛告比丘：「若復有人修諸靜慮，趣求解脫，於佛、法、僧不生毀謗，",
        "translation": "The Buddha said to the bhikṣus: If there is another person who practices meditative absorption in order to seek liberation, he should not criticize the Buddha, Dharma, or Sangha.",
        "source": "T17n0722_003:0426c09_0"
    },
    {
        "source_sentence": "恒時尊重，稱讚信受，猶如父母，亦如善友，恒時愛護，尊敬信受，不起邪謗，",
        "translation": "They are always respected, praised, and believed, just like parents or good friends. They are always loved and protected, revered and believed, and refrain from speaking falsehoods.",
        "source": "T17n0722_003:0426c10_1"
    },
    {
        "source_sentence": "令心歡喜。」",
        "translation": "It causes the mind to rejoice.",
        "source": "T17n0722_003:0426c12_2"
    },
    {
        "source_sentence": "時，諸比丘復白佛言：「有情云何捨離過非，修習勝行？",
        "translation": "The monks then again said to the Buddha, How do sentient beings abandon what's wrong and cultivate superior practice?",
        "source": "T17n0722_003:0426c12_3"
    },
    {
        "source_sentence": "願佛演說，利益未來。」",
        "translation": "May the Buddha expound it for the benefit of the future.",
        "source": "T17n0722_003:0426c13_4"
    },
    {
        "source_sentence": "爾時，世尊告諸比丘：「諦聽，諦聽！",
        "translation": "It was then that the Bhagavān addressed the monks, Listen closely, and listen closely!",
        "source": "T17n0722_003:0426c15_0"
    },
    {
        "source_sentence": "今為汝說。",
        "translation": "Now, I'll explain it for you.",
        "source": "T17n0722_003:0426c15_1"
    },
    {
        "source_sentence": "若復有人捨離身、語諸不善業，恒修善業；",
        "translation": "“Furthermore, suppose there is another person who renounces unwholesome bodily or verbal action and always practices wholesome action.",
        "source": "T17n0722_003:0426c15_2"
    },
    {
        "source_sentence": "又於三世安住觀察，伏諸邪慢，尊重三寶，策勤三業，趣證菩提；",
        "translation": "He also observed the past, present, and future in all times. Overcoming their false pride, he honored the Three Jewels and exerted himself on these three practices to attain enlightenment.",
        "source": "T17n0722_003:0426c16_3"
    },
    {
        "source_sentence": "復於三時，遠離諸執及貪瞋等。",
        "translation": "At the same time, he or she does not cling to attachments, greed, hatred, etc.",
        "source": "T17n0722_003:0426c18_4"
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "Furthermore, monks!",
        "source": "T17n0722_003:0426c20_0"
    },
    {
        "source_sentence": "由於三業離諸過患，安住愛樂三聚淨戒，趣三菩提及三真如，遠離煩惱，",
        "translation": "Because of these three actions, they are free from all faults and distress, abide in the pure precepts of the three groups of love and joy, proceed toward the three enlightenment and three true natures, and are far removed from afflictions.",
        "source": "T17n0722_003:0426c20_1"
    },
    {
        "source_sentence": "安住思惟，令心平等，觀察最勝；",
        "translation": "Abiding peacefully in reflection, they cause their minds to be impartial. Observing and contemplating is supreme.",
        "source": "T17n0722_003:0426c21_2"
    },
    {
        "source_sentence": "復離慢、疑，三業清淨，伏除障染。",
        "translation": "Again, he’s free of conceit and doubt, the three activities are purified, and he subdues the defilement of hindrances.",
        "source": "T17n0722_003:0426c22_3"
    },
    {
        "source_sentence": "於一切處能離繫縛，修習正行，憶念苦、空，樂趣解脫，微妙甚深，遠離諸惡發起方便，",
        "translation": "In all places they can be freed from bondage, cultivate right practice, remember suffering and emptiness, enjoy liberation subtly and profoundly, become far removed from evil, and develop skillful means.",
        "source": "T17n0722_003:0426c23_4"
    },
    {
        "source_sentence": "破壞愚暗及諸貪欲。",
        "translation": "It destroys ignorance, darkness, and craving.",
        "source": "T17n0722_003:0426c25_5"
    },
    {
        "source_sentence": "是故，比丘！",
        "translation": "Therefore, monks!",
        "source": "T17n0722_003:0426c25_6"
    },
    {
        "source_sentence": "應修善行，棄捨諸非，及能遠離飢渴、寒熱，顏容憔悴，愚暗破裂，憂惱悔恨，",
        "translation": "They should cultivate good actions, abandon what’s not good, and be able to avoid hunger, thirst, cold, heat, emaciation, ignorance, darkness, grief, sorrow, regret, and resentment.",
        "source": "T17n0722_003:0426c26_7"
    },
    {
        "source_sentence": "種種諸苦皆悉捨離；",
        "translation": "They are free of all kinds of suffering.",
        "source": "T17n0722_003:0426c27_8"
    },
    {
        "source_sentence": "獲於人天，富饒安樂，聰慧廣聞，恒修捨行，及諸香、燈、花鬘、瓔珞諸供養具。",
        "translation": "They attain wealth and well-being among humans and gods, are wise and widely heard, constantly cultivate the practice of relinquishment, and make offerings of incense, lamps, flower garlands, jewelry, and other necessities.",
        "source": "T17n0722_003:0426c28_9"
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "Furthermore, monks!",
        "source": "T17n0722_003:0427a01_0"
    },
    {
        "source_sentence": "若起邪執、慳貪、嫉妬、虛妄、諂誑，墮於餓鬼受諸苦惱，逼迫殘害，",
        "translation": "If someone gives rise to wrong attachment, stinginess, greed, jealousy, hypocrisy, and deceitfulness, they'll fall into the suffering of hungry ghosts and be oppressed and harmed by them.",
        "source": "T17n0722_003:0427a01_1"
    },
    {
        "source_sentence": "相續無斷，飢渴焚燒。",
        "translation": "The stream continues uninterruptedly, and hunger and thirst burn it.",
        "source": "T17n0722_003:0427a02_2"
    },
    {
        "source_sentence": "業因熟時，纖毫難免；",
        "translation": "When the causes of action are ripe, it is extremely difficult to avoid.",
        "source": "T17n0722_003:0427a03_3"
    },
    {
        "source_sentence": "憂苦纏縛，遠離解脫。」",
        "translation": "Being bound by the tether of grief and suffering, he's far removed from liberation.",
        "source": "T17n0722_003:0427a03_4"
    },
    {
        "source_sentence": "時，諸比丘白世尊言：「此諸有情，云何得脫如是眾苦？",
        "translation": "The monks then said to the Bhagavān, How can these sentient beings be freed from such suffering?",
        "source": "T17n0722_003:0427a05_0"
    },
    {
        "source_sentence": "復於何時而得解脫，獲於正信？",
        "translation": "At what point will they again attain liberation and attain right faith?",
        "source": "T17n0722_003:0427a06_1"
    },
    {
        "source_sentence": "我今思惟，不能了達。",
        "translation": "Now, when I think about it, I can't comprehend it.",
        "source": "T17n0722_003:0427a06_2"
    },
    {
        "source_sentence": "又此有情於鬼趣中，日夜長時，恒受飢渴、寒熱憂苦，身首乾枯，癡暗迷覆，",
        "translation": "Furthermore, these sentient beings are constantly hungry and thirsty day and night in the realm of ghosts. Day and night they experience hunger, thirst, cold, heat, grief, sorrow, pain, drying up their bodies and hair, ignorance, darkness, and delusion.",
        "source": "T17n0722_003:0427a07_3"
    },
    {
        "source_sentence": "恒無暫捨。",
        "translation": "There's always no momentary equanimity.",
        "source": "T17n0722_003:0427a09_4"
    },
    {
        "source_sentence": "願佛演說，利益未來。」",
        "translation": "May the Buddha expound it for the benefit of the future.",
        "source": "T17n0722_003:0427a09_5"
    },
    {
        "source_sentence": "佛告比丘：「此諸有情，於過去世造諸惡業，不修福慧，慳嫉虛誑，煩惱熾盛，",
        "translation": "The Buddha said to the bhikṣus: These sentient beings have done evil deeds in past lives. They have not cultivated virtue and wisdom; they are greedy, jealous, hypocritical, and wicked, and their afflictions are intense.",
        "source": "T17n0722_003:0427a10_0"
    },
    {
        "source_sentence": "恣縱貪、瞋，不能伏除。",
        "translation": "Even if they indulge in greed and anger, they can't subdue them.",
        "source": "T17n0722_003:0427a11_1"
    },
    {
        "source_sentence": "命終之後，墮於地獄受苦無量；",
        "translation": "At the end of their life, they will fall into hell and suffer immeasurable pain.",
        "source": "T17n0722_003:0427a12_2"
    },
    {
        "source_sentence": "從彼出已，復墮餓鬼，眾苦逼迫，飢渴纏縛，於一切處恒時受苦，無救、無依，",
        "translation": "After emerging from that, they'll again fall into a hungry ghost, tormented by all kinds of suffering and bound by hunger and thirst, constantly suffering in all places without relief or support.",
        "source": "T17n0722_003:0427a12_3"
    },
    {
        "source_sentence": "思念飲食，終無所得，悔恨號哭，念我何時當捨此苦？",
        "translation": "When they think of food and drink, they never get anything. They grieve and wail in remorse, thinking, “When will I give up this suffering?",
        "source": "T17n0722_003:0427a14_4"
    },
    {
        "source_sentence": "「比丘應知，愚癡有情，煩惱纏縛，由惡三業輪轉三塗，受如斯苦。",
        "translation": "“Monks, you should know that foolish sentient beings are bound by the afflictive bonds of affliction and suffer such pain because of the three bad actions that transmigrate in the three destinies.",
        "source": "T17n0722_003:0427a16_0"
    },
    {
        "source_sentence": "「比丘當知，若復有人近事男、女諸天、魔、梵。",
        "translation": "“Monks, you should know that if another person approaches a man or woman who serves gods, Māra, or Brahmā.",
        "source": "T17n0722_003:0427a18_0"
    },
    {
        "source_sentence": "破彼惡業，修習善法，愛樂真諦，審觀自身四大、五蘊，苦、空無常；",
        "translation": "Destroying their evil deeds, they cultivate wholesome states and love the true truth. They examine for themselves that the four elements and five aggregates are impermanent in terms of suffering and emptiness.",
        "source": "T17n0722_003:0427a18_1"
    },
    {
        "source_sentence": "亦如水泡、芭蕉、夢、電，皆悉虛幻。",
        "translation": "It's also like water bubbles, plantains, dreams, and lightning, all illusory.",
        "source": "T17n0722_003:0427a20_2"
    },
    {
        "source_sentence": "是故，比丘於諸善法，修令增長；",
        "translation": "Because of this, the bhikṣu cultivates and develops good dharmas.",
        "source": "T17n0722_003:0427a21_3"
    },
    {
        "source_sentence": "於一切惡，對治不起；",
        "translation": "The antidote for all evils does not arise.",
        "source": "T17n0722_003:0427a21_4"
    },
    {
        "source_sentence": "安住人天，最勝可愛，皆得自在。",
        "translation": "The people and gods who live there are the most distinguished and desirable, and they all attain freedom.",
        "source": "T17n0722_003:0427a22_5"
    },
    {
        "source_sentence": "身、語、意業，遠離諸非，虛妄、欺詐及諸驚怖，決定棄捨。",
        "translation": "Their bodily, verbal, and mental actions are free of what's not good, false, deceptive, and terrifying, and they definitely abandon it.",
        "source": "T17n0722_003:0427a23_6"
    },
    {
        "source_sentence": "愛樂最勝，寂靜思惟，離諸散亂，造作眾善，初、中及後，令無間斷，",
        "translation": "Their craving and pleasure are the most superior. They meditate in quietude, getting rid of distraction, doing all kinds of good deeds, enabling them to continue uninterruptedly throughout the first, middle, and last stages.",
        "source": "T17n0722_003:0427a24_7"
    },
    {
        "source_sentence": "降伏諸根，捨離繫縛及諸惡趣。",
        "translation": "He subdues the faculties and abandons the fetters and bad destinies.",
        "source": "T17n0722_003:0427a25_8"
    },
    {
        "source_sentence": "愚癡黑暗，不了果因，廣作不善，輪迴三塗，被受眾苦。」",
        "translation": "Foolish and dark, they don't understand the causes of fruition, are widely unwholesome, transmigrate in the three destinies, and experience numerous sufferings.",
        "source": "T17n0722_003:0427a26_9"
    },
    {
        "source_sentence": "「若樂於住處，　　應觀胎藏苦，",
        "translation": "“If you delight in the abode, You should contemplate the womb as suffering.",
        "source": "T17n0722_003:0427a28_0"
    },
    {
        "source_sentence": "　遠離顛倒貪，　　破壞令不起；",
        "translation": "Being far removed from deluded craving, They destroy and cause it not to arise.",
        "source": "T17n0722_003:0427a28_0"
    },
    {
        "source_sentence": "　纏縛於業繩，　　三途苦無盡，",
        "translation": "Their fetters are bound by the bonds of action. The suffering of the three paths is inexhaustible.",
        "source": "T17n0722_003:0427a28_0"
    },
    {
        "source_sentence": "　來往似蟻環，　　沈淪難出離。」",
        "translation": "It's like an ant ring that comes and goes, and it's hard to escape from being sunken.",
        "source": "T17n0722_003:0427a28_0"
    },
    {
        "source_sentence": "爾時，世尊而說頌曰：爾時，世尊說此偈已，告諸比丘：「老、病、死苦，",
        "translation": "At that time the World-honored One uttered these verses: At that time, having uttered these verses, the World-honored One said to the monks:",
        "source": "T17n0722_003:0427a28_0"
    },
    {
        "source_sentence": "纏繞有情，恒不捨離。",
        "translation": "They entangle sentient beings and never abandon them.",
        "source": "T17n0722_003:0427b04_1"
    },
    {
        "source_sentence": "譬如魚、鹿，網、箭纏縛，亦復如是。",
        "translation": "Just as fish and deer are bound by a net or an arrow, so it is likewise.",
        "source": "T17n0722_003:0427b05_2"
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "Furthermore, monks!",
        "source": "T17n0722_003:0427b07_0"
    },
    {
        "source_sentence": "貪愛如毒，瞋忿似火，虛妄諂誑，迷覆淨心，熾然煩惱，恒相隨逐，令不出離。",
        "translation": "Desire and craving are like poison, anger and anger are like fire, falsely deceiving and flattering, deluded and pure minds, blazing with afflictions, constantly following each other so that they won't leave.",
        "source": "T17n0722_003:0427b07_1"
    },
    {
        "source_sentence": "若復有人貪求財物，廣行虛誑，養活身命，妄執纏縛，輪轉諸有。",
        "translation": "Suppose another person covets possessions, engages in extensive licentiousness, nourishes body and life, falsely clings to fetters, and transmigrates among existences.",
        "source": "T17n0722_003:0427b08_2"
    },
    {
        "source_sentence": "如魚吞鉤，因貪所起；",
        "translation": "It is like a fish that swallows its hook, which is produced by craving.",
        "source": "T17n0722_003:0427b10_3"
    },
    {
        "source_sentence": "如焰中水，從愛心生。」",
        "translation": "It's like water in a flame that arises from craving.",
        "source": "T17n0722_003:0427b10_4"
    },
    {
        "source_sentence": "「迷執虛妄見，　　業緣有幻身，",
        "translation": "“They are deluded in clinging to false views, And their karmic conditions have illusory bodies.",
        "source": "T17n0722_003:0427b12_0"
    },
    {
        "source_sentence": "　果因恒離倒，　　離因果非真。",
        "translation": "The cause of result is always free from error; Being free from cause and effect, it is not true.",
        "source": "T17n0722_003:0427b12_0"
    },
    {
        "source_sentence": "　輪轉因煩惱，　　了達證真空，",
        "translation": "The causes of transmigration are afflictions, Understanding and realizing the vacuum.",
        "source": "T17n0722_003:0427b12_0"
    },
    {
        "source_sentence": "　解脫煩惱離，　　真實理非無。",
        "translation": "Being liberated from afflictions and free of affliction, reality and principle are not nonexistent.",
        "source": "T17n0722_003:0427b12_0"
    },
    {
        "source_sentence": "　最上妙覺位，　　二障悉皆亡，",
        "translation": "In the supreme state of marvelous awakening, The two hindrances all disappear.",
        "source": "T17n0722_003:0427b12_0"
    },
    {
        "source_sentence": "　湛然恒不動，　　利樂諸有情。」",
        "translation": "They are perfectly still and unmoving, benefiting and welcoming sentient beings.",
        "source": "T17n0722_003:0427b12_0"
    },
    {
        "source_sentence": "爾時，世尊乃說頌言：爾時，世尊說此偈已，告諸比丘：「若復有人起謗不信，",
        "translation": "At that time the World-honored One uttered these verses: At that time, having uttered these verses, the World-honored One said to the monks:",
        "source": "T17n0722_003:0427b12_0"
    },
    {
        "source_sentence": "損壞三寶，花卉、果實貨易活命。",
        "translation": "It damages the Three Treasures and makes it easy to live with flowers, plants, fruits, and goods.",
        "source": "T17n0722_003:0427b20_1"
    },
    {
        "source_sentence": "以此因緣，墮於惡趣；",
        "translation": "Because of these causes and conditions they will fall into evil rebirths.",
        "source": "T17n0722_003:0427b20_2"
    },
    {
        "source_sentence": "彼有獯狐及諸鷲鳥，其嘴鋒利，猶如金剛，形貌醜惡，嬈亂驚怖，來集食噉身肉、手足、眼目、骨髓，",
        "translation": "Their beaked foxes and eagled birds, with sharp tails like diamond and their mouths as sharp as the tip of a hammer, were terrified and frightened. They came to feed on the flesh, hands, feet, eyes, bones, and marrow of these creatures.",
        "source": "T17n0722_003:0427b21_3"
    },
    {
        "source_sentence": "周遍無遺，受苦無量。",
        "translation": "They pervade everywhere without remainder and suffer immeasurable pain.",
        "source": "T17n0722_003:0427b23_4"
    },
    {
        "source_sentence": "業繩纏縛，隨逐不捨而無依怙，亦非救濟，輪轉如是，三惡往來，恒不捨離；",
        "translation": "They are bound by the fetters of the chain of action, which they follow and do not let go of without relying on. Nor is it to be relied upon or rescued. The transmigration is like this:",
        "source": "T17n0722_003:0427b24_0"
    },
    {
        "source_sentence": "從彼出已，復墮餓鬼，飢渴所逼，增長眾苦，口吐火焰，如山相續而無間斷。",
        "translation": "After emerging from that, they'll again fall into a hungry ghost, which is tormented by hunger and thirst, increases in suffering, and spits out the flame of fire with its mouth like a mountain that continues without interruption.",
        "source": "T17n0722_003:0427b25_1"
    },
    {
        "source_sentence": "設降大雨遍一切處，此惡業火終不能滅。",
        "translation": "Even if a great rain were to fall everywhere, this bad fire of karma wouldn't be extinguished.",
        "source": "T17n0722_003:0427b27_2"
    },
    {
        "source_sentence": "「比丘應知，若復有人修習施戒，乃至智慧，而能解脫種種眾苦。",
        "translation": "“Monks, you should know that if another person cultivates generosity, morality, and even wisdom, they’ll be able to liberate themselves from various kinds of suffering.",
        "source": "T17n0722_003:0427b29_0"
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "Furthermore, monks!",
        "source": "T17n0722_003:0427c02_0"
    },
    {
        "source_sentence": "惡業為因，招三塗果，有情迷執，不能伏除，分別俱生煩惱一百二十八使。",
        "translation": "Bad karma is the cause that brings about the results of the three destinies, and sentient beings who are deluded and attached can't subdue it, discriminating the one hundred and twenty-eight afflictive tendencies that arise from co-arising afflictions.",
        "source": "T17n0722_003:0427c02_1"
    },
    {
        "source_sentence": "於三界內，欲四諦行，乃有十二，上二合論，二十四行，約三界說。",
        "translation": "Within the three spheres, there are twelve aspects belonging to the four noble truths. The above-mentioned two combined doctrines and twenty-four aspects are spoken of in relation to the three spheres.",
        "source": "T17n0722_003:0427c03_2"
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "Furthermore, monks!",
        "source": "T17n0722_003:0427c06_0"
    },
    {
        "source_sentence": "四諦、四智乃有十六，及二見道；",
        "translation": "Of the four truths and of the four knowledges, there are sixteen:",
        "source": "T17n0722_003:0427c06_1"
    },
    {
        "source_sentence": "修四念處、八正道支、五根、五力，解脫暴惡，遠離焚燒。",
        "translation": "He cultivates the four abodes of mindfulness, the eightfold correct path, the five faculties, and the five powers, liberates himself from violent evil, and is far removed from burning.",
        "source": "T17n0722_003:0427c06_2"
    },
    {
        "source_sentence": "「復次，比丘！",
        "translation": "Furthermore, monks!",
        "source": "T17n0722_003:0427c09_0"
    },
    {
        "source_sentence": "最上二諦，智應修習，及三念住；",
        "translation": "The highest two truths are to be practised by knowledge and the three abodes of mindfulness.",
        "source": "T17n0722_003:0427c09_1"
    },
    {
        "source_sentence": "遠離眾魔及諸餓鬼，飢渴困苦，增長白法。」",
        "translation": "They're far removed from the Māras and hungry ghosts, suffer from hunger, thirst, and suffering, and grow white dharmas.",
        "source": "T17n0722_003:0427c09_2"
    },
    {
        "source_sentence": "「十惡因心造，　　沈淪路嶮巇，",
        "translation": "The ten evil deeds are caused by the mind, sinking down a precipitous path.",
        "source": "T17n0722_003:0427c11_0"
    },
    {
        "source_sentence": "　執貪癡境縛，　　果感必相隨；",
        "translation": "They cling to the fetters of craving and delusion as objects, Which necessarily follow one another in terms of their effect.",
        "source": "T17n0722_003:0427c11_0"
    },
    {
        "source_sentence": "　極苦泥梨趣，　　堪嗟無所依！",
        "translation": "The destinies of the most painful nirvāṇa can be admired without relying on anything!",
        "source": "T17n0722_003:0427c11_0"
    },
    {
        "source_sentence": "　緣熟如影嚮，　　壞劫報難移；",
        "translation": "Conditioned maturation is like the echo of a reflection, Unable to be moved by the retribution of destruction or kalpa.",
        "source": "T17n0722_003:0427c11_0"
    },
    {
        "source_sentence": "　三業勤精進，　　多聞習總持，",
        "translation": "They are diligent in the three activities, exerting themselves energetically, learning much and accumulating mastery.",
        "source": "T17n0722_003:0427c11_0"
    },
    {
        "source_sentence": "　二嚴修六度，　　圓滿證菩提。」",
        "translation": "The second is to adorn the cultivation of the six perfections and fully realize enlightenment.",
        "source": "T17n0722_003:0427c11_0"
    },
    {
        "source_sentence": "爾時，世尊乃說頌曰：爾時，世尊說是偈已，告諸比丘：「若復有人修三善業：施、戒、多聞，",
        "translation": "At that time, the World-honored One continued in verse: Having uttered these verses, the World-honored One said to the monks: Again, suppose there is a person who performs three kinds of meritorious deeds:",
        "source": "T17n0722_003:0427c11_0"
    },
    {
        "source_sentence": "捨離暴惡愚迷貪愛，解脫眾苦及離不善地獄、餓鬼。",
        "translation": "He's freed from violent folly and deluded craving, liberated from all suffering, and freed from the unwholesome hells and hungry ghosts.",
        "source": "T17n0722_003:0427c19_1"
    },
    {
        "source_sentence": "比丘應知，諸餓鬼界受種種苦：寒熱飢渴，痛惱逼迫，不能遠離。",
        "translation": "Monks, you should know that hungry ghosts experience various kinds of suffering: cold, heat, hunger, thirst, pain, and oppression, which they can't get rid of.",
        "source": "T17n0722_003:0427c20_2"
    },
    {
        "source_sentence": "由此惡業——我慢、虛詐——墮落三塗。",
        "translation": "Because of these bad actions - self-conceit and hypocrisy - they fall into the three destinies.",
        "source": "T17n0722_003:0427c22_3"
    },
    {
        "source_sentence": "於彼趣中，互相殘害，貪、瞋纏縛，恒時不捨。",
        "translation": "In those destinies, they harm each other and are bound by the fetters of greed and anger, which they always don't abandon.",
        "source": "T17n0722_003:0427c22_4"
    },
    {
        "source_sentence": "由昔遠離布施、持戒及於多聞，造作諸非，不能了知法、非法等，及於正信亦皆迷闇，",
        "translation": "Because in the past they were far removed from generosity, observance of precepts, and learning much. They committed evil deeds but could not know what is true or false. They were also deluded about right faith.",
        "source": "T17n0722_003:0427c23_5"
    },
    {
        "source_sentence": "而非省悟。",
        "translation": "They don't realize it.",
        "source": "T17n0722_003:0427c25_6"
    },
    {
        "source_sentence": "由此障礙人天善趣，不能修習，亦非觀察得失等事。」",
        "translation": "As a result, they're hindered by the good destinies of humans and gods who can't cultivate them, and they don't observe such things as gain or loss.",
        "source": "T17n0722_003:0427c25_7"
    },
    {
        "source_sentence": "時，諸比丘復白佛言：「阿素囉趣，何業所招？」",
        "translation": "The monks then again said to the Buddha, What's the karma that brings about the destinies of asuras?",
        "source": "T17n0722_003:0427c28_0"
    },
    {
        "source_sentence": "爾時，佛告諸比丘言：「應當諦聽，今為汝說。",
        "translation": "At that point, the Buddha addressed the monks, You should listen closely and now explain it for you.",
        "source": "T17n0722_003:0427c28_1"
    },
    {
        "source_sentence": "彼阿素囉，由昔虛詐，恒時諂曲業及諸惑，纏縛不捨，墮於彼趣。",
        "translation": "As a result of deceitfulness in the past, those asuras always flatter others with flattering actions and afflictions, bind them and don't abandon them, and fall into their destinies.",
        "source": "T17n0722_003:0427c29_2"
    },
    {
        "source_sentence": "亦由不信，謗毀賢善，於正因果，不能了悟，墮於彼趣，而無智慧；",
        "translation": "Because they do not believe in the right doctrine and slander wise and virtuous people. They are unable to understand correct causality, so they will fall into other states of existence without wisdom.",
        "source": "T17n0722_003:0428a02_3"
    },
    {
        "source_sentence": "愚迷妄執，怖畏怯懼，恒非安隱。」",
        "translation": "Foolish and deludedly attached, they're afraid and frightened, and they're always unsettled.",
        "source": "T17n0722_003:0428a03_4"
    },
    {
        "source_sentence": "「平坦三乘路，　　牟尼親所宣，",
        "translation": "“The path of the three vehicles is level, proclaimed by Muni himself.",
        "source": "T17n0722_003:0428a05_0"
    },
    {
        "source_sentence": "　真空無漏理，　　本體離諸纏。",
        "translation": "The uncontaminated principle of emptiness is inherently free from the afflictions.",
        "source": "T17n0722_003:0428a05_0"
    },
    {
        "source_sentence": "　應物興慈廣，　　懷悲愍苦深，",
        "translation": "Their compassion for sentient beings is extensive, They harbor compassion and pity for the depth of suffering.",
        "source": "T17n0722_003:0428a05_0"
    },
    {
        "source_sentence": "　光明恒照耀，　　不捨利他心。」",
        "translation": "His light always shines brightly, not abandoning his mind for the benefit of others.",
        "source": "T17n0722_003:0428a05_0"
    },
    {
        "source_sentence": "爾時，帝釋、忉利諸天，聞佛所說，歡喜踊躍，即於佛前以偈頌曰：爾時，",
        "translation": "At that time, having heard the Buddha’s discourse, Indra and the Trāyastriṃśa gods were delighted and jumped for joy. They stood before the Buddha in verse:",
        "source": "T17n0722_003:0428a05_0"
    },
    {
        "source_sentence": "帝釋說此偈已，合掌恭敬在一面立。",
        "translation": "After he spoke this verse, Indra joined his palms and stood to one side with respect.",
        "source": "T17n0722_003:0428a11_1"
    },
    {
        "source_sentence": "佛告天帝：「三乘淨法，汝應修習，離諸繫縛，平等清白；",
        "translation": "The Buddha said to Indra, “The pure teaching of the three vehicles should be practiced by you. Be free from all fetters and equally pure and genuine.",
        "source": "T17n0722_003:0428a11_2"
    },
    {
        "source_sentence": "能離險隘，絕諸黑暗，光明無染；",
        "translation": "They can be freed from danger, cut off darkness, and shine with undefiled light.",
        "source": "T17n0722_003:0428a13_3"
    },
    {
        "source_sentence": "猶如珍寶，體性清淨，諸天歡喜，愛樂最勝，寂靜修習，奉持不捨。",
        "translation": "It is like a rare treasure whose intrinsic nature is pure. The gods are delighted and most delighted, cultivating it in tranquility without giving up what they preserve.",
        "source": "T17n0722_003:0428a13_4"
    },
    {
        "source_sentence": "又於戒、施及三摩地，觀察愛樂。",
        "translation": "Also, he observes craving and pleasure in the precepts, generosity, and samādhi.",
        "source": "T17n0722_003:0428a15_5"
    },
    {
        "source_sentence": "亦如諸天，敬事天主，遠離過非，尊仰瞻奉；",
        "translation": "They are also like the gods, reverently serving the ruler of heaven, far removed from error and dishonesty, venerating and gazing upon him.",
        "source": "T17n0722_003:0428a16_0"
    },
    {
        "source_sentence": "及諸有情，柔軟和美。",
        "translation": "and sentient beings are gentle and graceful.",
        "source": "T17n0722_003:0428a16_1"
    },
    {
        "source_sentence": "若生天上，獲身淨妙，遠離貪、恚，息除塵垢及諸境界，貪、忿因緣，",
        "translation": "If someone is born in heaven, they’ll attain a body that’s pure and marvelous, free of craving and anger, calming the defilements and objects as well as the causes and conditions of craving and anger.",
        "source": "T17n0722_003:0428a17_2"
    },
    {
        "source_sentence": "解脫沈溺，破壞諸有，親族朋寮互相憎嫉，五欲淤泥，悉皆遠離。",
        "translation": "Their liberation is submerged, destroying all existences, their relatives and friends hate each other, and they're all free of the five desires that silt themselves away.",
        "source": "T17n0722_003:0428a18_3"
    },
    {
        "source_sentence": "處諸有情，謙敬和順，安住恒時。",
        "translation": "The sentient beings there are humble, respectful, and obedient, abiding peacefully at the eternal time.",
        "source": "T17n0722_003:0428a20_4"
    },
    {
        "source_sentence": "善離諸染，威儀有軌，抖擻煩惱，降伏魔羅。",
        "translation": "They are well freed from all defilements and have proper manners of behavior. They shake the afflictions and subdue Māra.",
        "source": "T17n0722_003:0428a21_5"
    },
    {
        "source_sentence": "智慧安住，最勝清淨，善護三業，恒習靜慮。",
        "translation": "Their wisdom abides peacefully and most excellently pure, well guards the three actions, and always practices meditation.",
        "source": "T17n0722_003:0428a22_6"
    },
    {
        "source_sentence": "棄捨惡友及非梵行，永離繫縛，恒處諸天。",
        "translation": "He abandons bad friends and non-Buddhist practices, permanently frees himself from fetters, and always stays in the heavens.",
        "source": "T17n0722_003:0428a23_7"
    },
    {
        "source_sentence": "良友知識，勸發大心，速登彼岸。」",
        "translation": "A good friend and knower encourages you to give rise to great intentions and quickly ascend to the other side.",
        "source": "T17n0722_003:0428a24_8"
    },
    {
        "source_sentence": "妙法聖念處經卷第三",
        "translation": "Sutra of the Sacred Mindfulness of the Wonderful Dharma, Volume 3",
        "source": "T17n0722_003:0428a25_0"
    }
]