[
    {
        "source_sentence": "佛說八大人覺經",
        "translation": "Sutra of the Eight Great Enlightened Ones",
        "source": "T17n0779_001:0715b03_0"
    },
    {
        "source_sentence": "後漢安息國三藏安世高譯",
        "translation": "Translated by An Shigao, the Tripiṭaka Master of Anxi in the Later Han Dynasty",
        "source": "T17n0779_001:0715b05_0"
    },
    {
        "source_sentence": "為佛弟子，常於晝夜，至心誦念，八大人覺：第一覺悟：世間無常，國土危脆；",
        "translation": "For the sake of the Buddha’s disciples he always recited these verses wholeheartedly day and night. Eight great men awakened at once:",
        "source": "T17n0779_001:0715b06_0"
    },
    {
        "source_sentence": "四大苦空，五陰無我；",
        "translation": "The four elements are emptiness of suffering, while the five aggregates are selfless.",
        "source": "T17n0779_001:0715b07_1"
    },
    {
        "source_sentence": "生滅變異，虛偽無主；",
        "translation": "Their arising and perishing, change and dissimilarity are unreal and without subjectivity.",
        "source": "T17n0779_001:0715b08_2"
    },
    {
        "source_sentence": "心是惡源，形為罪藪。",
        "translation": "The mind is the source of evil, and it's shaped like a sinful bush.",
        "source": "T17n0779_001:0715b08_3"
    },
    {
        "source_sentence": "如是觀察，漸離生死。",
        "translation": "Observing it this way, they gradually part with birth and death.",
        "source": "T17n0779_001:0715b09_4"
    },
    {
        "source_sentence": "第二覺知：多欲為苦，生死疲勞，從貪欲起；",
        "translation": "The second perception knows that much desire is unsatisfactoriness and the weariness of birth and death are produced from craving.",
        "source": "T17n0779_001:0715b10_0"
    },
    {
        "source_sentence": "少欲無為，身心自在。",
        "translation": "They have few desires and nothing, and their bodies and minds are unimpeded.",
        "source": "T17n0779_001:0715b10_1"
    },
    {
        "source_sentence": "第三覺知：心無厭足，唯得多求，增長罪惡；",
        "translation": "The third awakening knows: The mind is not satisfied. It only longs for many things, increasing sin and evil.",
        "source": "T17n0779_001:0715b12_0"
    },
    {
        "source_sentence": "菩薩不爾，常念知足，安貧守道，唯慧是業。",
        "translation": "A bodhisattva isn't like that, always mindful of the fulfillment of well-being and abiding in poverty while maintaining the path, but only wisdom is karma.",
        "source": "T17n0779_001:0715b12_1"
    },
    {
        "source_sentence": "第四覺知：懈怠墜落；",
        "translation": "The fourth awakening knows:",
        "source": "T17n0779_001:0715b14_0"
    },
    {
        "source_sentence": "常行精進，破煩惱惡，摧伏四魔，出陰界獄。",
        "translation": "He always conducted himself with energy, destroying the evil of defilement and conquering the four Māras. He came out of the hell of the aggregates.",
        "source": "T17n0779_001:0715b14_1"
    },
    {
        "source_sentence": "第五覺悟：愚癡生死。",
        "translation": "The fifth awakening: folly and birth-and-death.",
        "source": "T17n0779_001:0715b16_0"
    },
    {
        "source_sentence": "菩薩常念，廣學多聞，增長智慧，成就辯才，教化一切，悉以大樂。",
        "translation": "The enlightening beings are always mindful, learning extensively and widely; they increase knowledge and wisdom, perfecting the power of elucidation, teaching and edifying all with great bliss.",
        "source": "T17n0779_001:0715b16_1"
    },
    {
        "source_sentence": "第六覺知：貧苦多怨，橫結惡緣。",
        "translation": "The sixth awakening knows that poverty and suffering are often enemies, which are horizontally bound by bad conditions.",
        "source": "T17n0779_001:0715b18_0"
    },
    {
        "source_sentence": "菩薩布施，等念冤親，不念舊惡，不憎惡人。",
        "translation": "A bodhisattva's generosity is equally mindful of enemies and relatives, doesn't think of old evils, and doesn't hate evil people.",
        "source": "T17n0779_001:0715b18_1"
    },
    {
        "source_sentence": "第七覺悟：五欲過患。",
        "translation": "The seventh awakening: the five faults and distress of desire.",
        "source": "T17n0779_001:0715b20_0"
    },
    {
        "source_sentence": "雖為俗人，不染世樂；",
        "translation": "Even though they belong to the secular world, they are not affected by worldly pleasures.",
        "source": "T17n0779_001:0715b20_1"
    },
    {
        "source_sentence": "念三衣，瓶鉢法器；",
        "translation": "He remembered the three robes, the almsbowl, bowl, and vessel of the Teaching.",
        "source": "T17n0779_001:0715b20_2"
    },
    {
        "source_sentence": "志願出家，守道清白；",
        "translation": "They wish to renounce the householder’s life and keep the pure and genuine path.",
        "source": "T17n0779_001:0715b21_3"
    },
    {
        "source_sentence": "梵行高遠，慈悲一切。",
        "translation": "The practice of austerity is lofty and far-reaching, compassionate to all.",
        "source": "T17n0779_001:0715b21_4"
    },
    {
        "source_sentence": "第八覺知：生死熾然，苦惱無量。",
        "translation": "The eighth awakening knows that birth and death are blazing, and the suffering and distress are immeasurable.",
        "source": "T17n0779_001:0715b23_0"
    },
    {
        "source_sentence": "發大乘心，普濟一切；",
        "translation": "They awaken the determination for universal enlightenment to save all.",
        "source": "T17n0779_001:0715b23_1"
    },
    {
        "source_sentence": "願代眾生，受無量苦；",
        "translation": "“Great enlightening beings also undertake these vows:",
        "source": "T17n0779_001:0715b24_2"
    },
    {
        "source_sentence": "令諸眾生，畢竟大樂。",
        "translation": "It causes sentient beings to ultimately experience great happiness.",
        "source": "T17n0779_001:0715b24_3"
    },
    {
        "source_sentence": "如此八事，乃是諸佛菩薩大人之所覺悟。",
        "translation": "These eight things are the enlightenment of buddhas, bodhisattvas, and great men.",
        "source": "T17n0779_001:0715b26_0"
    },
    {
        "source_sentence": "精進行道，慈悲修慧，乘法身船，至涅槃岸；",
        "translation": "They diligently practiced the path, compassionately cultivating wisdom; they boarded the ship of the body of doctrine and reached the shore of nirvana.",
        "source": "T17n0779_001:0715b26_1"
    },
    {
        "source_sentence": "復還生死，度脫眾生。",
        "translation": "Again, they return to birth and death to liberate sentient beings.",
        "source": "T17n0779_001:0715b27_2"
    },
    {
        "source_sentence": "以前八事，開導一切，令諸眾生，覺生死苦，捨離五欲，修心聖道。",
        "translation": "The first eight deeds enlighten all sentient beings and cause them to realize the suffering of birth and death, abandon the five desires, and cultivate the noble path of mind.",
        "source": "T17n0779_001:0715b28_3"
    },
    {
        "source_sentence": "若佛弟子，誦此八事，於念念中，滅無量罪；",
        "translation": "Suppose a disciple of the Buddha recites these eight things, extinguishing countless sins in every moment of thought.",
        "source": "T17n0779_001:0715b29_4"
    },
    {
        "source_sentence": "進趣菩提，速登正覺；",
        "translation": "They proceed toward enlightenment and quickly attain true awakening.",
        "source": "T17n0779_001:0715c01_5"
    },
    {
        "source_sentence": "永斷生死，常住快樂。",
        "translation": "They permanently end birth and death and always abide in happiness.",
        "source": "T17n0779_001:0715c02_6"
    },
    {
        "source_sentence": "佛說八大人覺經",
        "translation": "Sutra of the Eight Great Enlightened Ones",
        "source": "T17n0779_001:0715c03_0"
    }
]