[
    {
        "source_sentence": "大佛頂如來密因修證了義諸",
        "translation": "The Tathāgata Mahāprajñāpāramitā-sūtra explains the meaning of cultivating and realizing the esoteric causes of the Tathāgata.",
        "source": "T19n0945_008:0141b17_0"
    },
    {
        "source_sentence": "菩薩萬行首楞嚴經卷第八(一名中印度那蘭陀大道場經，於灌頂部錄出別行)唐天竺沙門般剌蜜帝譯「阿難！",
        "translation": "Bodhisattva's Myriad Practices Śūraṃgama-sūtra, Volume 8 (a scripture of the great road site of Nāranda in Central India, with separate practices recorded in the Consecration section) translated by the Tang",
        "source": "T19n0945_008:0141b18_0"
    },
    {
        "source_sentence": "如是眾生一一類中，亦各各具十二顛倒；",
        "translation": "In each of these sentient beings there were twelve inversions.",
        "source": "T19n0945_008:0141b22_1"
    },
    {
        "source_sentence": "猶如揑目亂花發生，顛倒妙圓真淨明心，具足如斯虛妄亂想。",
        "translation": "It's like a distorted, marvelous, perfect, and truly pure mind of clarity that has such false and confusing conceptions.",
        "source": "T19n0945_008:0141b23_2"
    },
    {
        "source_sentence": "汝今修證佛三摩提，於是本因元所亂想，立三漸次方得除滅；",
        "translation": "Now you cultivate the realization of buddha-samādhi, which removes the originally disturbed ideation of causality by positing three gradual steps.",
        "source": "T19n0945_008:0141b24_3"
    },
    {
        "source_sentence": "如淨器中除去毒蜜，以諸湯水并雜灰香洗滌其器，後貯甘露。",
        "translation": "It's like in a pure container that removes poisonous honey, washes it with the scent of hot water and mixed ashes to remove poisonous honey, and then stores the ambrosia.",
        "source": "T19n0945_008:0141b25_4"
    },
    {
        "source_sentence": "云何名為三種漸次？",
        "translation": "What are the three kinds of gradual succession?",
        "source": "T19n0945_008:0141b27_5"
    },
    {
        "source_sentence": "一者修習，除其助因；",
        "translation": "The first is cultivation, getting rid of the supporting cause.",
        "source": "T19n0945_008:0141b27_6"
    },
    {
        "source_sentence": "二者真修，刳其正性；",
        "translation": "The second is cultivation of truth, examining its true nature.",
        "source": "T19n0945_008:0141b28_7"
    },
    {
        "source_sentence": "三者增進，違其現業。",
        "translation": "The third is the one who increases. This is contrary to his present action.",
        "source": "T19n0945_008:0141b28_8"
    },
    {
        "source_sentence": "「云何助因？",
        "translation": "What are the auxiliary causes?",
        "source": "T19n0945_008:0141c01_0"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0141c01_1"
    },
    {
        "source_sentence": "如是世界十二類生，不能自全依四食住，所謂段食、觸食、思食、識食，",
        "translation": "In this way, twelve kinds arise in the world. They are not able to depend entirely on the four kinds of nutriment for their subsistence:",
        "source": "T19n0945_008:0141c01_2"
    },
    {
        "source_sentence": "是故佛說一切眾生皆依食住。",
        "translation": "That's why the Buddha said that all sentient beings all abide based on food.",
        "source": "T19n0945_008:0141c02_3"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0141c03_4"
    },
    {
        "source_sentence": "一切眾生食甘故生，食毒故死。",
        "translation": "All sentient beings are born because they eat sweetness and die because they eat poison.",
        "source": "T19n0945_008:0141c03_5"
    },
    {
        "source_sentence": "是諸眾生求三摩提，當斷世間五種辛菜，是五種辛，熟食發婬，生啖增恚，",
        "translation": "When sentient beings seek samādhi, they should cut off the five kinds of spicy vegetables in the world. These are the five kinds of spicy vegetables that cooked food gives rise to abscesses and newly sprouting nourishment",
        "source": "T19n0945_008:0141c04_6"
    },
    {
        "source_sentence": "如是世界食辛之人，縱能宣說十二部經，十方天仙嫌其臭穢咸皆遠離，",
        "translation": "Thus, even if the people of this world who eat spices were able to expound twelve kinds of scriptures, the gods and sages in the ten directions would hate their foulsmelling odor and be far removed from it.",
        "source": "T19n0945_008:0141c06_7"
    },
    {
        "source_sentence": "諸餓鬼等因彼食次，舐其唇吻常與鬼住，福德日銷長無利益。",
        "translation": "Hungry ghosts and so forth, because of the order of their food, licked their lips and kisses and always stayed with the ghosts, whose merits diminished day by day without benefit.",
        "source": "T19n0945_008:0141c07_8"
    },
    {
        "source_sentence": "是食辛人修三摩地，菩薩、天仙、十方善神不來守護，大力魔王得其方便，",
        "translation": "When the bodhisattvas, celestial sages, and good deities of the ten directions did not come to protect him, powerful Māra King Mahāprajāpatī attained his skillful means.",
        "source": "T19n0945_008:0141c09_9"
    },
    {
        "source_sentence": "現作佛身來為說法，非毀禁戒讚婬怒癡，命終自為魔王眷屬，受魔福盡墮無間獄。",
        "translation": "They now become buddha-bodies to preach the Dharma for them, don't violate the precepts and praise lust, anger, and delusion, become members of the Māra king's retinue at the end of their life, and",
        "source": "T19n0945_008:0141c10_10"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0141c12_11"
    },
    {
        "source_sentence": "修菩提者永斷五辛，是則名為第一增進修行漸次。",
        "translation": "When someone cultivates enlightenment and permanently stops the five spices, this is called the first gradual advancement of cultivation.",
        "source": "T19n0945_008:0141c12_12"
    },
    {
        "source_sentence": "「云何正性？",
        "translation": "“What is righteousness?",
        "source": "T19n0945_008:0141c14_0"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0141c15_0"
    },
    {
        "source_sentence": "如是眾生入三摩地，要先嚴持清淨戒律，永斷婬心不飡酒肉，以火淨食無啖生氣。",
        "translation": "Thus, when sentient beings enter samādhi, they must first strictly observe the pure precepts, permanently stop anger, don't eat wine and meat, and use fire to purify food without chewing for breath.",
        "source": "T19n0945_008:0141c15_1"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0141c17_0"
    },
    {
        "source_sentence": "是修行人，若不斷婬及與殺生，出三界者無有是處。",
        "translation": "If this practitioner doesn't stop fighting and killing people, there's no place for someone who leaves the three realms.",
        "source": "T19n0945_008:0141c17_1"
    },
    {
        "source_sentence": "常觀婬欲猶如毒蛇、如見怨賊，先持聲聞四棄八棄執身不動，後行菩薩清淨律儀執心不起，",
        "translation": "He always observes that sexual desire is like a poisonous snake or seeing an enemy thief, first holding the four and abandoning the eight attachments of śrāvakas without moving his body, and then practicing the bodhisattva's",
        "source": "T19n0945_008:0141c18_2"
    },
    {
        "source_sentence": "禁戒成就，則於世間永無相生相殺之業，偷劫不行無相負累，亦於世間不還宿債。",
        "translation": "When the precepts are accomplished, then there's no markless form in the world that produces markless acts of killing, stealing and robbery that don't practice marklessness as a burden, and he doesn't return to",
        "source": "T19n0945_008:0141c20_3"
    },
    {
        "source_sentence": "是清淨人修三摩地，父母肉身不須天眼，自然觀見十方世界，覩佛聞法親奉聖旨，",
        "translation": "This pure person cultivates samādhi, naturally observing the worlds of the ten directions without need for divine vision in their parents’ physical bodies. Having seen the Buddha and heard the Teaching from him, they will obey his holy decree",
        "source": "T19n0945_008:0141c22_4"
    },
    {
        "source_sentence": "得大神通遊十方界，宿命清淨得無艱嶮。",
        "translation": "He attained great supernormal powers and traveled to the ten directions, where his past lives were pure and he attained no difficulties.",
        "source": "T19n0945_008:0141c24_5"
    },
    {
        "source_sentence": "是則名為第二增進修行漸次。",
        "translation": "This is called the second gradual advancement of cultivation.",
        "source": "T19n0945_008:0141c25_6"
    },
    {
        "source_sentence": "「云何現業？",
        "translation": "What's the present action?",
        "source": "T19n0945_008:0141c26_0"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0141c26_1"
    },
    {
        "source_sentence": "如是清淨持禁戒人心無貪婬，於外六塵不多流逸，因不流逸旋元自歸，",
        "translation": "Thus, a pure mind that observes the precepts has no craving or hatred and doesn't engage in sexual misconduct outside of the six external dust motes, and because it doesn't engage in sexual misconduct, it returns",
        "source": "T19n0945_008:0141c26_2"
    },
    {
        "source_sentence": "塵既不緣根無所偶，反流全一六用不行，十方國土皎然清淨，譬如琉璃內懸明月。",
        "translation": "Since the dust doesn't rely on the faculties, there's nothing to be matched, and the reverse flow is completely one or six functions that don't arise, and the lands in the ten directions are as clear and pure as",
        "source": "T19n0945_008:0141c28_0"
    },
    {
        "source_sentence": "身心快然妙圓平等獲大安隱，一切如來密圓淨妙皆現其中，是人即獲無生法忍。",
        "translation": "Their bodies and minds are blissful, marvelous, perfect, and equally peaceful, and all the Tathāgatas' esoteric, perfect, pure, and marvelous forms appear within them, which means they attain the",
        "source": "T19n0945_008:0141c29_1"
    },
    {
        "source_sentence": "從是漸修，隨所發行安立聖位，是則名為第三增進修行漸次。",
        "translation": "From this, gradual cultivation follows, and the noble stages are established according to what's produced. This is called the third gradual advancement of cultivation.",
        "source": "T19n0945_008:0142a02_2"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0142a05_0"
    },
    {
        "source_sentence": "是善男子欲愛乾枯根境不偶，現前殘質不復續生，執心虛明純是智慧，",
        "translation": "Good sons, these desires for dryness of the faculties and objects are not concomitant with each other. When manifested, they do not arise again from their residues. They cling to ignorance as mind because ignorance is wisdom.",
        "source": "T19n0945_008:0142a05_1"
    },
    {
        "source_sentence": "慧性明圓瑩十方界，乾有其慧名乾慧地。",
        "translation": "The nature of wisdom clarifies and perfects the realms in the ten directions, and when there's dry wisdom, it's called the ground of dry wisdom.",
        "source": "T19n0945_008:0142a06_2"
    },
    {
        "source_sentence": "欲習初乾未與如來法流水接，即以此心中中流入圓妙開敷，從真妙圓重發真妙，",
        "translation": "Those who want to cultivate the first practice of dryness but haven’t yet joined the flowing water of the Buddha’s teaching— within that mind flows the perfect and marvelous enlightenment, which develops from its true and marvelous round",
        "source": "T19n0945_008:0142a07_3"
    },
    {
        "source_sentence": "妙信常住，一切妄想滅盡無餘，中道純真名信心住。",
        "translation": "Marvelous faith always abides, all deluded conceptions cease without remainder, and the middle way is purely truly called the abode of faith.",
        "source": "T19n0945_008:0142a09_4"
    },
    {
        "source_sentence": "真信明了一切圓通，陰處界三不能為礙，如是乃至過去未來無數劫中捨身受身，",
        "translation": "True faith clearly understands all perfect penetrations, and the aggregates, fields, and realms can't be obstructed by the three. In this way, up to incalculably long eons past and future, they abandon their bodies and receive",
        "source": "T19n0945_008:0142a10_5"
    },
    {
        "source_sentence": "一切習氣皆現在前，是善男子皆能憶念，得無遺忘名念心住。",
        "translation": "All the karmic impressions are present, and these good men can remember them all, and they attain the mind-abiding state of mindfulness without forgetting anything.",
        "source": "T19n0945_008:0142a12_6"
    },
    {
        "source_sentence": "妙圓純真真精發化，無始習氣通一精明，唯以精明進趣真淨名精進心，",
        "translation": "The mind of enlightenment is born of the pure and genuine energy of marvelous perfect purity. Beginninglessly permeated with habit energy, it penetrates a single essence; but only by means of that essence does one enter the path of",
        "source": "T19n0945_008:0142a14_7"
    },
    {
        "source_sentence": "心精現前純以智慧名慧心住。",
        "translation": "The mind's essence is manifested purely because of wisdom, which is called the mind abode of wisdom.",
        "source": "T19n0945_008:0142a15_8"
    },
    {
        "source_sentence": "執持智明周遍寂湛，寂妙常凝，名定心住。",
        "translation": "The abode of the mind that clings to wisdom and insight pervades tranquility and subtlety, always concentrated, is called the abode of concentration.",
        "source": "T19n0945_008:0142a16_9"
    },
    {
        "source_sentence": "定光發明明性深入，唯進無退，名不退心。",
        "translation": "When the light of absorption is emitted, its luminosity penetrates deeply. It only advances and does not regress; it is called the mind that does not regress.",
        "source": "T19n0945_008:0142a17_10"
    },
    {
        "source_sentence": "心進安然保持不失，十方如來氣分交接，名護法心。",
        "translation": "When the mind advances, it's peaceful and maintained without loss, and the Tathāgata's energy is interconnected in ten directions, which is called guarding the Dharma mind.",
        "source": "T19n0945_008:0142a18_11"
    },
    {
        "source_sentence": "覺明保持，能以妙力迴佛慈光向佛安住，猶如雙鏡光明相對，其中妙影重重相入，",
        "translation": "It's like facing each other with the light of a pair of mirrors, where subtle shadows enter one into the other.",
        "source": "T19n0945_008:0142a19_12"
    },
    {
        "source_sentence": "名迴向心。",
        "translation": "It's called the mind of dedication of merit.",
        "source": "T19n0945_008:0142a21_13"
    },
    {
        "source_sentence": "心光密迴，獲佛常凝無上妙淨，安住無為得無遺失，名戒心住。",
        "translation": "The mind's light turns back and forth, attains the Buddha's eternally concentrated, unsurpassed marvelous purity, abides in nonproductivity, and attains nothing left to lose, which is called the mind abo",
        "source": "T19n0945_008:0142a21_14"
    },
    {
        "source_sentence": "住戒自在能遊十方，所去隨願，名願心住。",
        "translation": "Abiding freely in the precepts, they can travel to the ten directions and follow their vows wherever they go, which is called the vow mind abode.",
        "source": "T19n0945_008:0142a23_15"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0142a25_0"
    },
    {
        "source_sentence": "是善男子以真方便發此十心，心精發揮十用涉入，圓成一心，名發心住。",
        "translation": "Good sons, when these ten states of mind are aroused with true skillful means, their mental energy develops the ten functions that involve entry, and they completely become one mind, which is called the abode of arousal of mind.",
        "source": "T19n0945_008:0142a25_1"
    },
    {
        "source_sentence": "心中發明如淨瑠璃，內現精金，以前妙心履以成地，名治地住。",
        "translation": "The invention of the mind is like pure lapis lazuli, which internally manifests semen and gold, and the former wonderful mental footprints form the ground, which is called the abode of healing the earth.",
        "source": "T19n0945_008:0142a26_2"
    },
    {
        "source_sentence": "心地涉知俱得明了，遊履十方得無留礙，名修行住。",
        "translation": "When the mind ground is involved in knowing, they both attain insight and travel to the ten directions to attain unobstructedness, which is called the abode of cultivation.",
        "source": "T19n0945_008:0142a28_3"
    },
    {
        "source_sentence": "行與佛同受佛氣分，如中陰身自求父母，陰信冥通入如來種，名生貴住。",
        "translation": "Practice and the Buddha share the same part of feeling the Buddha's energy, which is like the intermediate aggregate body that seeks its own parents in order to enter the Tathāgata's lineage with faith, which is called the noble abode of",
        "source": "T19n0945_008:0142a29_4"
    },
    {
        "source_sentence": "既遊道胎親奉覺胤，如胎已成人相不缺，名方便具足住。",
        "translation": "Having traveled to the womb of enlightenment, he's personally consecrated to Jueyin, just as when he's born there, his adulthood doesn't lack characteristics, which is called the abode of skillful means that's",
        "source": "T19n0945_008:0142b02_5"
    },
    {
        "source_sentence": "容貌如佛心相亦同，名正心住。",
        "translation": "Their appearance is like the Buddha's mind and their characteristics are the same, which is called the abode of right mindfulness.",
        "source": "T19n0945_008:0142b03_6"
    },
    {
        "source_sentence": "身心合成日益增長，名不退住。",
        "translation": "When body and mind are combined and grow increasing, it's called the nonretrogressing abode.",
        "source": "T19n0945_008:0142b04_7"
    },
    {
        "source_sentence": "十身靈相一時具足，名童真住。",
        "translation": "The ten bodies are endowed with spiritual characteristics at one time, which is called the abode of the true abode of youth.",
        "source": "T19n0945_008:0142b04_8"
    },
    {
        "source_sentence": "形成出胎親為佛子，名法王子住。",
        "translation": "Forming and emerging from the womb is progenitor of the Buddha's child, which is called the prince of the Dharma abode.",
        "source": "T19n0945_008:0142b05_9"
    },
    {
        "source_sentence": "表以成人如國大王，以諸國事分委太子，彼剎利王世子長成陳列灌頂，",
        "translation": "The king of the kṣatriyas is like a great king, entrusted with all affairs of statehood to his crown princes. The princes of the kṣatriyas have always been coronated by displaying their adornments.",
        "source": "T19n0945_008:0142b06_10"
    },
    {
        "source_sentence": "名灌頂住。",
        "translation": "It's called the abode of consecration.",
        "source": "T19n0945_008:0142b07_11"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0142b09_0"
    },
    {
        "source_sentence": "是善男子成佛子已，具足無量如來妙德，十方隨順，名歡喜行。",
        "translation": "This good man, having become a buddha-child, is endowed with the immeasurable marvelous virtues of the Tathāgata and following them in all ten directions, which is called the practice of joy.",
        "source": "T19n0945_008:0142b09_1"
    },
    {
        "source_sentence": "善能利益一切眾生，名饒益行。",
        "translation": "Being able to benefit all sentient beings well is called practicing beneficially.",
        "source": "T19n0945_008:0142b10_2"
    },
    {
        "source_sentence": "自覺覺他得無違拒，名無嗔恨行。",
        "translation": "Being self-aware and aware of the attainments of others without opposing them is called the practice of no anger.",
        "source": "T19n0945_008:0142b11_3"
    },
    {
        "source_sentence": "種類出生窮未來際，三世平等十方通達，名無盡行。",
        "translation": "Their kinds of birth will end in the future, and they're equal in the three times and comprehended in ten directions, which is called inexhaustible practice.",
        "source": "T19n0945_008:0142b12_0"
    },
    {
        "source_sentence": "一切合同，種種法門得無差誤，名離癡亂行。",
        "translation": "All contracts, various approaches to the attainment of dharmas without distinctions and errors are called the practice of freedom from delusion.",
        "source": "T19n0945_008:0142b13_1"
    },
    {
        "source_sentence": "則於同中顯現群異，一一異相各各見同，名善現行。",
        "translation": "Thus, in the sameness, it manifests a group of di›erences. Each di›erence is seen to be the same as the other. This is called good manifestation.",
        "source": "T19n0945_008:0142b14_2"
    },
    {
        "source_sentence": "如是乃至十方虛空滿足微塵，一一塵中現十方界，現塵現界不相留礙，",
        "translation": "In this way, up to the extent that space in the ten directions is filled with atoms, each atom manifests the worlds of the ten directions. The manifestation of atoms does not obstruct one another:",
        "source": "T19n0945_008:0142b15_3"
    },
    {
        "source_sentence": "名無著行。",
        "translation": "It's called the practice of no attachment.",
        "source": "T19n0945_008:0142b17_0"
    },
    {
        "source_sentence": "種種現前咸是第一波羅蜜多，名尊重行。",
        "translation": "The various manifestations are all the first perfection, which is called the practice of reverence.",
        "source": "T19n0945_008:0142b17_1"
    },
    {
        "source_sentence": "如是圓融能成十方諸佛軌則，名善法行。",
        "translation": "Thus, this perfect interpenetration can form the guideline for the buddhas of the ten directions, which is called the practice of good qualities.",
        "source": "T19n0945_008:0142b18_2"
    },
    {
        "source_sentence": "一一皆是清淨無漏，一真無為性本然故，名真實行。",
        "translation": "Each one of them is pure and uncontaminated, because the single true nature of nonexistence is inherently present, which is called true practice.",
        "source": "T19n0945_008:0142b19_3"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0142b21_0"
    },
    {
        "source_sentence": "是善男子滿足神通成佛事已，純潔精真遠諸留患，當度眾生滅除度相，",
        "translation": "Good sons, after fulfilling the buddha-work of mystic powers and becoming buddhas, they will be pure and genuine, free from all hindrances, liberating sentient beings. They will eradicate their marks of liberation.",
        "source": "T19n0945_008:0142b21_1"
    },
    {
        "source_sentence": "迴無為心向涅槃路，名救護一切眾生離眾生相迴向。",
        "translation": "Turning the mind of nonproductivity toward the path to nirvāṇa is called saving all sentient beings and turning back on the characteristics of sentient beings that are free of sentient beings.",
        "source": "T19n0945_008:0142b22_2"
    },
    {
        "source_sentence": "壞其可壞遠離諸離，名不壞迴向。",
        "translation": "Destroying what's destructible and being far removed from what's free is called the indestructible dedication of merit.",
        "source": "T19n0945_008:0142b24_3"
    },
    {
        "source_sentence": "本覺湛然覺齊佛覺，名等一切佛迴向。",
        "translation": "The originally enlightened mind is perfectly enlightened and equal to the Buddha's enlightenment, which is called the dedication of merit equal to all buddhas.",
        "source": "T19n0945_008:0142b24_4"
    },
    {
        "source_sentence": "精真發明地如佛地，名至一切處迴向。",
        "translation": "The ground of subtle and true inquiry is like the Buddha's ground, which is called dedication of merit up to all places.",
        "source": "T19n0945_008:0142b25_5"
    },
    {
        "source_sentence": "世界如來互相涉入得無罣礙，名無盡功德藏迴向。",
        "translation": "The worlds and tathāgatas are unobstructed by each other's involvement and entry, which is called the dedication of the inexhaustible store of merit.",
        "source": "T19n0945_008:0142b26_6"
    },
    {
        "source_sentence": "於同佛地，地中各各生清淨因，依因發揮取涅槃道，名隨順平等善根迴向。",
        "translation": "In the same buddha stage, each stage produces pure causes and develops the path to nirvāṇa based on those causes, which is called following the equal dedication of good roots.",
        "source": "T19n0945_008:0142b27_7"
    },
    {
        "source_sentence": "真根既成，十方眾生皆我本性，性圓成就不失眾生，名隨順等觀一切眾生迴向。",
        "translation": "Once the true faculty has been accomplished, all sentient beings in the ten directions are self-natured by their original nature, and when their nature is complete and they don't lose sentient beings, it's called the dedication of",
        "source": "T19n0945_008:0142b29_8"
    },
    {
        "source_sentence": "即一切法離一切相，唯即與離二無所著，名如相迴向。",
        "translation": "That is, all dharmas are free of all characteristics, but only that they are free of both and have no attachment to them, which is called dedication of thusness.",
        "source": "T19n0945_008:0142c02_9"
    },
    {
        "source_sentence": "真得所如十方無礙，名無縛解脫迴向。",
        "translation": "What's truly attained is unobstructed in the ten directions as it is, which is called the dedication of liberation without fetters.",
        "source": "T19n0945_008:0142c03_10"
    },
    {
        "source_sentence": "性德圓成法界量滅，名法界無量迴向。",
        "translation": "The perfection of nature and virtue that accomplishes the cessation of the Dharma realm's measured cessation is called the immeasurable dedication of merit in the Dharma realm.",
        "source": "T19n0945_008:0142c04_11"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0142c05_12"
    },
    {
        "source_sentence": "是善男子盡是清淨四十一心，次成四種妙圓加行。",
        "translation": "Good sons, these are the forty-one pure mental states of purity that make up the next four kinds of subtle and perfect applied practices.",
        "source": "T19n0945_008:0142c05_13"
    },
    {
        "source_sentence": "即以佛覺用為己心，若出未出，猶如鑽火欲然其木，名為煖地。",
        "translation": "That is, he takes the Buddha's awakening as his own mind and uses it for his own sake, and if he emerges or doesn't emerge, it's like drilling a fire to remove its wood, which is called the warmth ground.",
        "source": "T19n0945_008:0142c06_14"
    },
    {
        "source_sentence": "又以己心成佛所履，若依非依如登高山，身入虛空下有微礙，名為頂地。",
        "translation": "It's also called the top ground because it's the path of self-transformation, and if someone relies on what's not relied upon like ascending a high mountain, their body enters space below with slight obstruction, which is called the",
        "source": "T19n0945_008:0142c08_15"
    },
    {
        "source_sentence": "心佛二同善得中道，如忍事人非懷非出，名為忍地。",
        "translation": "The two minds and buddhas are the same as well attaining the middle way, which is called the stage of forbearance like a person who tolerates what's neither harmed nor expelled.",
        "source": "T19n0945_008:0142c09_16"
    },
    {
        "source_sentence": "數量銷滅，迷覺中道二無所目，名世第一地。",
        "translation": "When the number ceases, there are two kinds of deluded awakening and middle path that have no eyes, which are called the world's first ground.",
        "source": "T19n0945_008:0142c10_17"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0142c12_0"
    },
    {
        "source_sentence": "是善男子於大菩提善得通達，覺通如來盡佛境界，名歡喜地。",
        "translation": "This good man well understands great enlightenment and perceives the Tathāgata's end of the Buddha's sphere, which is called the joyous stage.",
        "source": "T19n0945_008:0142c12_1"
    },
    {
        "source_sentence": "異性入同同性亦滅，名離垢地。",
        "translation": "The state of being free from defilement is when one enters the sphere of neither difference nor sameness and also extinguishes it.",
        "source": "T19n0945_008:0142c13_2"
    },
    {
        "source_sentence": "淨極明生，名發光地。",
        "translation": "Pure and extremely bright arise, which is called the ground of arousal of light.",
        "source": "T19n0945_008:0142c14_3"
    },
    {
        "source_sentence": "明極覺滿，名焰慧地。",
        "translation": "It's called the stage of blazing wisdom that explains the fullness of ultimate awakening.",
        "source": "T19n0945_008:0142c14_4"
    },
    {
        "source_sentence": "一切同異所不能至，名難勝地。",
        "translation": "The sphere of neither similarity nor dissimilarity that cannot be attained is called the difficult-to-overcome stage.",
        "source": "T19n0945_008:0142c15_5"
    },
    {
        "source_sentence": "無為真如性淨明露，名現前地。",
        "translation": "The pure and insightful manifestation of the true nature of nonexistence is called the stage of manifesting.",
        "source": "T19n0945_008:0142c15_6"
    },
    {
        "source_sentence": "盡真如際，名遠行地。",
        "translation": "At the end of the realm of reality, it's called the far-reaching stage of practice.",
        "source": "T19n0945_008:0142c16_7"
    },
    {
        "source_sentence": "一真如心，名不動地。",
        "translation": "The first is the mind of reality, which is called the immovable state.",
        "source": "T19n0945_008:0142c17_8"
    },
    {
        "source_sentence": "發真如用，名善慧地。",
        "translation": "To give rise to the function of true reality is called the stage of good wisdom.",
        "source": "T19n0945_008:0142c17_9"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0142c18_0"
    },
    {
        "source_sentence": "是諸菩薩從此已往，修習畢功功德圓滿，亦目此地名修習位，慈陰妙雲覆涅槃海，",
        "translation": "“Furthermore, the enlightening beings who have cultivated these practices from this point onward perfected their virtues and merits. They also see that this stage is called ‘cultivation’ because it covers the ocean of nirvana with",
        "source": "T19n0945_008:0142c18_1"
    },
    {
        "source_sentence": "名法雲地。",
        "translation": "It's called the ground of the Dharma-cloud.",
        "source": "T19n0945_008:0142c20_0"
    },
    {
        "source_sentence": "如來逆流，如是菩薩順行而至覺際入交，名為等覺。",
        "translation": "The Tathāgata goes against the flow, and thus a bodhisattva follows his practice up to the point of awakening and enters into intercourse, which is called equally enlightened.",
        "source": "T19n0945_008:0142c20_1"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0142c21_2"
    },
    {
        "source_sentence": "從乾慧心至等覺已，是覺始獲金剛心中初乾慧地，如是重重單複十二，",
        "translation": "From the mind of dry wisdom up to perfect enlightenment, this awakening begins to attain the first stage of dry wisdom in the adamantine mind.",
        "source": "T19n0945_008:0142c21_3"
    },
    {
        "source_sentence": "方盡妙覺成無上道，是種種地皆以金剛觀察如幻十種深喻，奢摩他中用諸如來毘婆舍那，",
        "translation": "These various stages all use the ten profound metaphors of adamantine contemplation as illusory, and in quietude they use the teachings of the enlightened ones.",
        "source": "T19n0945_008:0142c23_4"
    },
    {
        "source_sentence": "清淨修證漸次深入。",
        "translation": "He gradually enters deeper and deeper into the purity of cultivation and realization.",
        "source": "T19n0945_008:0142c25_5"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0142c25_6"
    },
    {
        "source_sentence": "如是皆以三增進故，善能成就五十五位真菩提路，作是觀者名為正觀；",
        "translation": "Because of these three advancements, they can skillfully accomplish the paths of enlightenment in fifty-five states. Those who contemplate like this are said to be rightly contemplating.",
        "source": "T19n0945_008:0142c25_7"
    },
    {
        "source_sentence": "若他觀者名為邪觀。」",
        "translation": "If someone else observes it, they're called wrongly observing.",
        "source": "T19n0945_008:0142c27_8"
    },
    {
        "source_sentence": "爾時，文殊師利法王子在大眾中即從座起，頂禮佛足而白佛言：「當何名是經？",
        "translation": "At the time, Mañjuśrī, the prince of the Dharma, stood up from his seat in the midst of the crowd, bowed his head at the Buddha's feet, and said to him, What will be the name of this sūtra?",
        "source": "T19n0945_008:0142c29_0"
    },
    {
        "source_sentence": "我及眾生云何奉持？」",
        "translation": "How do we and sentient beings uphold it?",
        "source": "T19n0945_008:0143a01_1"
    },
    {
        "source_sentence": "佛告文殊師利：「是經名『大佛頂悉怛多般怛囉無上寶印十方如來清淨海眼』；",
        "translation": "The Buddha told Mañjuśrī, This sūtra is called the pure ocean eye of the buddhas of the ten directions with the unsurpassed jeweled seal of Samantabhadra on the top of the Great Buddha’s head.",
        "source": "T19n0945_008:0143a02_2"
    },
    {
        "source_sentence": "亦名『救護親因度脫阿難及此會中性比丘尼得菩提心入遍知海』；",
        "translation": "It's also called rescuing their relatives, liberating Ānanda and the middle-natured bhikṣuṇīs in this assembly who have attained the mind of enlightenment and entered the ocean of omniscience.",
        "source": "T19n0945_008:0143a04_0"
    },
    {
        "source_sentence": "亦名『如來密因修證了義』，亦名『大方廣妙蓮華王十方佛母陀羅尼呪』；",
        "translation": "It is also called the Dhāraṇī of the Great Universally Extensive, Marvelous Lotus King Dhāraṇī of the Buddha Mothers of the Ten Directions.",
        "source": "T19n0945_008:0143a05_1"
    },
    {
        "source_sentence": "亦名『灌頂章句諸菩薩萬行首楞嚴』。",
        "translation": "It's also called the 'Consecration Chapter on the Consecration of the Ten Thousand Practices of the Bodhisattvas, Śūraṃgama-samādhi.'",
        "source": "T19n0945_008:0143a07_2"
    },
    {
        "source_sentence": "汝當奉持。」",
        "translation": "You must uphold it.",
        "source": "T19n0945_008:0143a07_3"
    },
    {
        "source_sentence": "說是語已，即時阿難及諸大眾，得蒙如來開示密印般怛囉義，兼聞此經了義名目，",
        "translation": "After he had uttered these words, Ānanda and the others in the assembly were immediately instructed by the Buddha to reveal the meaning of the esoteric scripture called ‘pankara’ and heard the full meaning of its title.",
        "source": "T19n0945_008:0143a09_0"
    },
    {
        "source_sentence": "頓悟禪那修進聖位，增上妙理心慮虛凝，斷除三界修心六品微細煩惱，",
        "translation": "He suddenly awakened to meditation and cultivated the noble state of enlightenment, his mind concentrated on the supremely sublime principle of mind and thought, eliminating the subtle afflictions of the six classes of cultivation of mind in the three",
        "source": "T19n0945_008:0143a10_1"
    },
    {
        "source_sentence": "即從座起頂禮佛足，合掌恭敬而白佛言：「大威德世尊！",
        "translation": "He rose from his seat, bowed his head at the Buddha's feet, joined his palms in respect, and said to him, Bhagavān!",
        "source": "T19n0945_008:0143a12_2"
    },
    {
        "source_sentence": "慈音無遮，善開眾生微細沈惑，令我今日身意快然得大饒益。",
        "translation": "The voice of compassion is unobstructed, which skillfully dispels the subtle afflictions of sentient beings and enables me today to attain great benefit in body and mind.",
        "source": "T19n0945_008:0143a13_3"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T19n0945_008:0143a15_4"
    },
    {
        "source_sentence": "若此妙明真淨妙心本來遍圓，如是乃至大地草木蠕動含靈本元真如，即是如來成佛真體。",
        "translation": "If this subtle insight is truly pure and marvelous, the mind originally pervasive and perfect, then it's the true essence of the Tathāgata becoming a buddha, which is the true body of the Tathāgata.",
        "source": "T19n0945_008:0143a15_5"
    },
    {
        "source_sentence": "佛體真實，云何復有地獄、餓鬼、畜生、修羅、人、天等道？",
        "translation": "If the Buddha's essence is real, then how could there be hells, hungry ghosts, animals, asuras, humans, gods, and other paths?",
        "source": "T19n0945_008:0143a17_6"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T19n0945_008:0143a18_7"
    },
    {
        "source_sentence": "此道為復本來自有？",
        "translation": "Is this path again originally existent?",
        "source": "T19n0945_008:0143a18_8"
    },
    {
        "source_sentence": "為是眾生妄習生起？",
        "translation": "Why are sentient beings produced by deluded accumulation?",
        "source": "T19n0945_008:0143a19_9"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T19n0945_008:0143a19_10"
    },
    {
        "source_sentence": "如寶蓮香比丘尼，持菩薩戒私行婬欲，妄言行婬非殺、非偷無有業報，",
        "translation": "It's like the jeweled lotus fragrance bhikṣuṇī who observes the bodhisattva precepts and privately engages in sexual misconduct, falsely saying that sexual misconduct is neither killing nor stealing",
        "source": "T19n0945_008:0143a19_11"
    },
    {
        "source_sentence": "發是語已，先於女根生大猛火，後於節節猛火燒然，墮無間獄。",
        "translation": "After they say this, a great fierce fire first arises from the female faculty and then burns it in all directions, and they fall into the hell of no-separation.",
        "source": "T19n0945_008:0143a21_12"
    },
    {
        "source_sentence": "瑠璃大王、善星比丘，瑠璃為誅瞿曇族姓，善星妄說一切法空，生身陷入阿鼻地獄。",
        "translation": "The great king of lapis lazuli and the monk Sunetra were born to punish the members of the Gautama family, and Sunetra falsely explained the emptiness of all dharmas and fell into the avīci hell.",
        "source": "T19n0945_008:0143a22_13"
    },
    {
        "source_sentence": "此諸地獄為有定處？",
        "translation": "Do these hells have a fixed place?",
        "source": "T19n0945_008:0143a24_14"
    },
    {
        "source_sentence": "為復自然？",
        "translation": "Why is it again natural?",
        "source": "T19n0945_008:0143a25_15"
    },
    {
        "source_sentence": "彼彼發業各各私受，唯垂大慈發開童蒙，令諸一切持戒眾生聞決定義，",
        "translation": "Each of those who give rise to karma receive it privately, but with great compassion they give rise to the children's enlightenment, causing all sentient beings who observe precepts to hear its definitive meaning.",
        "source": "T19n0945_008:0143a25_16"
    },
    {
        "source_sentence": "歡喜頂戴謹潔無犯。」",
        "translation": "Rejoicing, he puts his hair on his head and scrupulously cleans it without violating the rules.",
        "source": "T19n0945_008:0143a27_0"
    },
    {
        "source_sentence": "佛告阿難：「快哉此問！",
        "translation": "The Buddha told Ānanda, How wonderful this question!",
        "source": "T19n0945_008:0143a28_0"
    },
    {
        "source_sentence": "令諸眾生不入邪見。",
        "translation": "It causes sentient beings not to enter wrong views.",
        "source": "T19n0945_008:0143a28_1"
    },
    {
        "source_sentence": "汝今諦聽！",
        "translation": "Listen attentively now!",
        "source": "T19n0945_008:0143a28_2"
    },
    {
        "source_sentence": "當為汝說。",
        "translation": "I will explain it for you.",
        "source": "T19n0945_008:0143a29_3"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0143a29_4"
    },
    {
        "source_sentence": "一切眾生實本真淨，因彼妄見有妄習生，因此分開內分外分。",
        "translation": "All sentient beings are really originally true and pure, and because they have deluded views and deluded habits that arise from deluded views, they are divided into internal and external parts.",
        "source": "T19n0945_008:0143a29_5"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0143b01_6"
    },
    {
        "source_sentence": "內分即是眾生分內，因諸愛染發起妄情，情積不休能生愛水，是故眾生心憶珍羞口中水出，",
        "translation": "The internal part is that which belongs to living beings. Because of the defilement of craving, deluded feelings arise; and accumulating these feelings never stop producing water of craving. For this reason, living beings are mind",
        "source": "T19n0945_008:0143b02_7"
    },
    {
        "source_sentence": "心憶前人或憐或恨目中淚盈，貪求財寶心發愛涎舉體光潤，心著行婬男女二根自然流液。",
        "translation": "The mind remembers the past person, either pitying or resenting, with tears running down their eyes, craving possessions and treasures, arousing thirst and saliva, clinging to the body that's shining and moistened by",
        "source": "T19n0945_008:0143b04_8"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0143b06_9"
    },
    {
        "source_sentence": "諸愛雖別流結是同，潤濕不昇自然從墜，此名內分。",
        "translation": "Although the bond of craving is the same as the bond of distinct streams, it naturally follows moisture and does not go up or down. This is called internal part.",
        "source": "T19n0945_008:0143b06_10"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0143b08_0"
    },
    {
        "source_sentence": "外分即是眾生分外，因諸渴仰發明虛想，想積不休能生勝氣，是故眾生心持禁戒舉身輕清，",
        "translation": "The external part is that which belongs to sentient beings. Because of their cravings and aspirations, they give rise to false conceptions; the accumulation of these conceptions never stops producing superior energy. That is why sentient beings",
        "source": "T19n0945_008:0143b08_1"
    },
    {
        "source_sentence": "心持呪印顧眄雄毅，心欲生天夢想飛舉，心存佛國聖境冥現，事善知識自輕身命。",
        "translation": "The mind maintains the dhāraṇī mudrā and looks out for the heroic and resolute, wishing to be born in heaven with a dream of flying and rising, retaining the sacred realm of the Buddha's land in mysterious manifestation",
        "source": "T19n0945_008:0143b10_2"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0143b12_3"
    },
    {
        "source_sentence": "諸想雖別輕舉是同，飛動不沈自然超越，此名外分。",
        "translation": "Although the different conceptions are the same, they naturally transcend flying and not sinking. This is called the external part.",
        "source": "T19n0945_008:0143b12_4"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0143b14_0"
    },
    {
        "source_sentence": "一切世間生死相續，生從順習死從變流，臨命終時未捨暖觸，一生善惡俱時頓現，",
        "translation": "In all worlds birth and death continue in succession. Birth follows the process of accumulation, and death follows the process of change. When one dies, warmth is not relinquished. Good and bad simultaneously appear at the same time during one life",
        "source": "T19n0945_008:0143b14_1"
    },
    {
        "source_sentence": "死逆生順二習相交，純想即飛必生天上，若飛心中兼福兼慧及與淨願，",
        "translation": "When death and rebirth are combined with the two habits, pure perception immediately flies and must surely be born in heaven. If he flies, his mind is accompanied by merit, wisdom, and pure vow.",
        "source": "T19n0945_008:0143b16_2"
    },
    {
        "source_sentence": "自然心開見十方佛，一切淨土隨願往生；",
        "translation": "They naturally opened their minds to see the buddhas of the ten directions, being reborn in all pure lands as they wish.",
        "source": "T19n0945_008:0143b17_3"
    },
    {
        "source_sentence": "情少想多輕舉非遠，即為飛仙、大力鬼王、飛行夜叉、地行羅剎，遊於四天所去無礙，",
        "translation": "With few emotions and little ideation, he often held it lightly and not far away. That is, he traveled unobstructed to the four celestial realms of flying sages, great ghost kings, flying yakṣas, and",
        "source": "T19n0945_008:0143b18_4"
    },
    {
        "source_sentence": "其中若有善願善心護持我法，或護禁戒隨持戒人，或護神呪隨持呪者，",
        "translation": "Among them, if there's someone who wholeheartedly wishes to protect my teaching, or guards the precepts and follows the precepts, or guards the dhāraṇī spells and follows the dhāraṇī spells,",
        "source": "T19n0945_008:0143b20_5"
    },
    {
        "source_sentence": "或護禪定保綏法忍，是等親住如來座下；",
        "translation": "Some guard meditation and preserve the tolerance of the doctrine, these beings who are closely abiding under the Buddha’s seat.",
        "source": "T19n0945_008:0143b22_6"
    },
    {
        "source_sentence": "情想均等不飛不墜生於人間，想明斯聰情幽斯鈍；",
        "translation": "Sentient beings and ideas are evenly balanced, neither flying nor falling, born in the human world. Thoughts of insight are intelligent, while thoughts of depth are dull.",
        "source": "T19n0945_008:0143b23_7"
    },
    {
        "source_sentence": "情多想少流入橫生，重為毛群輕為羽族；",
        "translation": "Sentient beings have many ideas but few thoughts flowing into transmigration. The heavy ones are hair and the light ones feathers.",
        "source": "T19n0945_008:0143b24_8"
    },
    {
        "source_sentence": "七情三想沈下水輪，生於火際受氣猛火，身為餓鬼常被焚燒、水能害己，",
        "translation": "Seven feelings and three thoughts sink down the water wheel, and they're born at the edge of a fire and experience vigorous fire. They're hungry ghost bodies that are always burned up and can be harmed by water.",
        "source": "T19n0945_008:0143b25_9"
    },
    {
        "source_sentence": "無食無飲經百千劫；",
        "translation": "The absence of food and drink lasted for one hundred thousand eons.",
        "source": "T19n0945_008:0143b26_10"
    },
    {
        "source_sentence": "九情一想下洞火輪，身入風火二交過地，輕生有間重生無間二種地獄；",
        "translation": "In the ninth case, under one thought with nine emotions, there is the cakravartin-wheel of entering into fire. The body enters through wind and fire at two different moments above the earth; beings are slightly reborn again and again in",
        "source": "T19n0945_008:0143b27_11"
    },
    {
        "source_sentence": "純情即沈入阿鼻獄，若沈心中有謗大乘、毀佛禁戒、誑妄說法、虛貪信施、濫膺恭敬、五逆十重，",
        "translation": "If someone sinks into the great vehicle, disparages the Buddha's forbidden precepts, teaches falsely, covets faith and generosity, overweeningly venerates and respects it, and commits five heinous crimes or ten grave",
        "source": "T19n0945_008:0143b29_0"
    },
    {
        "source_sentence": "更生十方阿鼻地獄。",
        "translation": "They'll be reborn in the avīci hells of the ten directions.",
        "source": "T19n0945_008:0143c02_1"
    },
    {
        "source_sentence": "循造惡業雖則自招，眾同分中兼有元地。",
        "translation": "Even though they are self-inflicted by bad karma that follows the creation of bad karma, there's also the original stage in the homogeneous collection.",
        "source": "T19n0945_008:0143c02_2"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0143c04_0"
    },
    {
        "source_sentence": "此等皆是彼諸眾生自業所感，造十習因受六交報。",
        "translation": "These are all the causes and effects of those sentient beings' own actions that create the ten habituated causes and receive the six karmic retributions.",
        "source": "T19n0945_008:0143c04_1"
    },
    {
        "source_sentence": "云何十因？",
        "translation": "What are the ten causes?",
        "source": "T19n0945_008:0143c05_2"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0143c05_3"
    },
    {
        "source_sentence": "一者婬習交接，發於相磨，研磨不休，如是故有大猛火光於中發動，如人以手自相磨觸暖相現前；",
        "translation": "The first is the mutual influence of gross and subtle accumulation, which produces a characteristic that grinds without cease. Because of this, great ferocious flames of fire are generated in it.",
        "source": "T19n0945_008:0143c05_4"
    },
    {
        "source_sentence": "二習相然，故有鐵床銅柱諸事。",
        "translation": "Because these two habits are the same, there are iron beds, copper pillars, and other things.",
        "source": "T19n0945_008:0143c07_5"
    },
    {
        "source_sentence": "是故十方一切如來，色目行婬，同名欲火；",
        "translation": "For this reason, all the buddhas of the ten directions are likewise called the fire of desire.",
        "source": "T19n0945_008:0143c08_6"
    },
    {
        "source_sentence": "菩薩見欲如避火坑。",
        "translation": "The bodhisattva sees that desire is like avoiding a burning pit.",
        "source": "T19n0945_008:0143c09_7"
    },
    {
        "source_sentence": "「二者貪習交計，發於相吸，吸攬不止，如是故有積寒堅氷於中凍冽，",
        "translation": "The second is the conjunction of craving and habits, which give rise to feelings that are drawn by each other. These feelings are not exhausted when they are drawn together.",
        "source": "T19n0945_008:0143c10_0"
    },
    {
        "source_sentence": "如人以口吸縮風氣有冷觸生；",
        "translation": "It is like the case of a person who, by means of his mouth, inhales and exhales wind energy.",
        "source": "T19n0945_008:0143c11_1"
    },
    {
        "source_sentence": "二習相凌，故有吒吒波波囉囉，青赤白蓮寒氷等事。",
        "translation": "Because the two habits are mutually exclusive, there is a ṭaṭapāraka: blue, red, white lotus, cold ice and so on.",
        "source": "T19n0945_008:0143c12_2"
    },
    {
        "source_sentence": "是故十方一切如來，色目多求同名貪水；",
        "translation": "For this reason, all the buddhas of the ten directions are similarly called “craving water” because they seek form and vision.",
        "source": "T19n0945_008:0143c13_3"
    },
    {
        "source_sentence": "菩薩見貪如避瘴海。",
        "translation": "The bodhisattva sees that craving is like avoiding the ocean of delusion.",
        "source": "T19n0945_008:0143c14_4"
    },
    {
        "source_sentence": "「三者慢習交凌，發於相恃，馳流不息，如是故有騰逸奔波積波為水，",
        "translation": "(3) The three kinds of pride are mutually exclusive, relying on one another and chasing after the other without stopping. Because of this, there is a tendency to rise upward in speed and accumulate more and more waves as water.",
        "source": "T19n0945_008:0143c15_0"
    },
    {
        "source_sentence": "如人口舌自相綿味因而水發；",
        "translation": "It is as if water were to flow forth from the mouths of living beings whose tongues each have their own distinctive, subtle taste.",
        "source": "T19n0945_008:0143c16_1"
    },
    {
        "source_sentence": "二習相鼓，故有血河、灰河、熱沙、毒海、融銅灌吞諸事。",
        "translation": "The second is the drum of habits and characteristics, so there are rivers of blood, rivers of ash, hot sand, poisonous seas, and molten copper swallowing things.",
        "source": "T19n0945_008:0143c17_2"
    },
    {
        "source_sentence": "是故十方一切如來，色目我慢名飲癡水；",
        "translation": "That is why all buddhas of the ten directions are called ‘drinkers of the water of delusion’ because they have arrogance with respect to matter, vision, and self.",
        "source": "T19n0945_008:0143c18_3"
    },
    {
        "source_sentence": "菩薩見慢如避巨溺。",
        "translation": "The bodhisattva's view of conceit is like avoiding a great drought.",
        "source": "T19n0945_008:0143c19_4"
    },
    {
        "source_sentence": "「四者嗔習交衝，發於相忤，忤結不息，心熱發火鑄氣為金，如是故有刀山、鐵橛、劍樹、劍輪、斧鉞、鎗鋸，",
        "translation": "(4) The fourth is the practice of fighting with hatred and resentment, in which one cherishes feelings of disobedience toward others. Resentment does not cease even when they are hostile to each other. When their minds are overcome",
        "source": "T19n0945_008:0143c20_0"
    },
    {
        "source_sentence": "如人銜冤殺氣飛動；",
        "translation": "It is like a man holding an enemy’s breath and the energy of murderers flying in midair.",
        "source": "T19n0945_008:0143c22_1"
    },
    {
        "source_sentence": "二習相擊，故有宮、割、斬、斫、剉、刺、搥、擊諸事。",
        "translation": "Because the two habits strike each other, there's palace, cutting, chopping, beating, chewing, stabbing, thrusting, beating, and striking things.",
        "source": "T19n0945_008:0143c22_2"
    },
    {
        "source_sentence": "是故十方一切如來，色目嗔恚名利刀劍；",
        "translation": "That is why all the buddhas of the ten directions are called sharp swords because their color and eyes are hateful.",
        "source": "T19n0945_008:0143c23_3"
    },
    {
        "source_sentence": "菩薩見嗔如避誅戮。",
        "translation": "The bodhisattva sees anger as avoiding killing.",
        "source": "T19n0945_008:0143c24_4"
    },
    {
        "source_sentence": "「五者詐習交誘，發於相調，引起不住，如是故有繩木絞挍，如水浸田草木生長；",
        "translation": "The fifth is that deceptive habits are engendered by sexual misconduct. They arise in response to characteristics and regulations, causing them not to be maintained. Because of this, there are fetters such as ropes, logs,",
        "source": "T19n0945_008:0143c26_0"
    },
    {
        "source_sentence": "二習相延，故有杻械、枷鎖、鞭杖、撾棒諸事。",
        "translation": "Because the two habits are mutually reinforcing, there are fetters, fetters, whipping sticks, and beating sticks.",
        "source": "T19n0945_008:0143c27_1"
    },
    {
        "source_sentence": "是故十方一切如來，色目姦偽同名讒賊；",
        "translation": "For this reason, all the buddhas of the ten directions are likewise called thieves because their form and eyes are adulterous.",
        "source": "T19n0945_008:0143c28_2"
    },
    {
        "source_sentence": "菩薩見詐如畏犲狼。",
        "translation": "The bodhisattva sees fraudulence like fearing a cow or wolf.",
        "source": "T19n0945_008:0143c29_3"
    },
    {
        "source_sentence": "「六者誑習交欺，發於相誷，誣誷不止飛心造姦，如是故有塵土、屎尿、穢污不淨，",
        "translation": "(6) There is sexual misconduct, such as telling lies and deceiving others; there is sexual misconduct, such as engaging in sexual misconduct with one’s malefactors.",
        "source": "T19n0945_008:0144a02_0"
    },
    {
        "source_sentence": "如塵隨風各無所見；",
        "translation": "Like dust following the wind, they do not see anything at all.",
        "source": "T19n0945_008:0144a03_1"
    },
    {
        "source_sentence": "二習相加，故有沒溺、騰擲、飛墜、漂淪諸事。",
        "translation": "Because of the mutual influence of these two habits, there are such things as drowning, rising and tossing, flying and falling, and floating and sinking.",
        "source": "T19n0945_008:0144a04_2"
    },
    {
        "source_sentence": "是故十方一切如來，色目欺誑同名劫殺；",
        "translation": "For this reason, all the Tathågatas of the ten directions deceive each other with their physical and verbal deceit.",
        "source": "T19n0945_008:0144a05_3"
    },
    {
        "source_sentence": "菩薩見誑如踐蛇虺。",
        "translation": "The bodhisattva saw that the snake was like trampling a snake's shell.",
        "source": "T19n0945_008:0144a06_4"
    },
    {
        "source_sentence": "「七者怨習交嫌，發于銜恨，如是故有飛石、投礰、匣貯、車檻、甕盛、囊撲，",
        "translation": "“Seven: Enemies are accustomed to fighting and hating each other, and they give rise to grudges. For this reason there is flying rock, throwing stones into a pot, storing boxes, chariots, jars,",
        "source": "T19n0945_008:0144a07_0"
    },
    {
        "source_sentence": "如陰毒人懷抱畜惡；",
        "translation": "It is as if someone poisonous to the aggregates harbored evil.",
        "source": "T19n0945_008:0144a08_1"
    },
    {
        "source_sentence": "二習相吞，故有投擲、擒捉、擊射、挽撮諸事。",
        "translation": "Because the two habits are swallowed by each other, there's throwing, capturing, shooting, and dragging things.",
        "source": "T19n0945_008:0144a09_2"
    },
    {
        "source_sentence": "是故十方一切如來，色目怨家名違害鬼；",
        "translation": "That is why all the Tathågatas of the ten directions are said to be harmful ghosts.",
        "source": "T19n0945_008:0144a10_0"
    },
    {
        "source_sentence": "菩薩見怨如飲鴆酒。",
        "translation": "The bodhisattva sees that enemies are like drinking poisonous wine.",
        "source": "T19n0945_008:0144a10_1"
    },
    {
        "source_sentence": "「八者見習交明，如薩迦耶見戒禁取，邪悟諸業，發於違拒出生相返，",
        "translation": "The eighth is the mutual understanding of views and habits, as in the case of the view of attachment to precepts and prohibitions with regard to Sākāya, wrongly enlightened karma that gives rise to the characteristic of rebirth",
        "source": "T19n0945_008:0144a12_0"
    },
    {
        "source_sentence": "如是故有王使主吏證執文藉；",
        "translation": "Thus, the king had an envoy of officials who testified to the authenticity of these scriptures.",
        "source": "T19n0945_008:0144a13_1"
    },
    {
        "source_sentence": "如行路人來往相見，二習相交，故有勘問、權詐、考訊、推鞫、察訪、披究，",
        "translation": "Good man, it is like a road traveler coming and going who meets each other. Because the two modes of existence are mutually exclusive, there is questioning, deceitfulness, inquiry, investigation, examination, enquiry, and",
        "source": "T19n0945_008:0144a14_2"
    },
    {
        "source_sentence": "照明善惡童子手執文簿辭辯諸事。",
        "translation": "The boy Illumination of Good and Evil held the book in his hand and explained all the matters.",
        "source": "T19n0945_008:0144a15_3"
    },
    {
        "source_sentence": "是故十方一切如來，色目惡見同名見坑；",
        "translation": "For this reason, all the buddhas of the ten directions are likewise called ‘hell of vision’ because they have bad views of form and eyes.",
        "source": "T19n0945_008:0144a16_4"
    },
    {
        "source_sentence": "菩薩見諸虛妄遍執如入毒壑。",
        "translation": "The bodhisattva sees all the false and pervasive attachments like entering a poisonous valley.",
        "source": "T19n0945_008:0144a17_5"
    },
    {
        "source_sentence": "「九者枉習交加，發於誣謗，如是故有合山、合石、碾磑、耕磨，如讒賊人逼枉良善；",
        "translation": "(9) The nine kinds of injustice are accumulation, criticism, and misrepresentation. For this reason there is mountain building, rock building, crushing, and plowing, just as thieves oppress the wholesome.",
        "source": "T19n0945_008:0144a19_0"
    },
    {
        "source_sentence": "二習相排，故有押捺、搥按、蹙漉、衝度諸事。",
        "translation": "Because the two habits are mutually exclusive, there's suppressing, pressing, frowning, and overpowering things.",
        "source": "T19n0945_008:0144a20_1"
    },
    {
        "source_sentence": "是故十方一切如來，色目怨謗同名讒虎；",
        "translation": "For this reason, all the buddhas of the ten directions are similarly called tigers because their color and eyes hate each other.",
        "source": "T19n0945_008:0144a21_2"
    },
    {
        "source_sentence": "菩薩見枉如遭霹靂。",
        "translation": "The bodhisattva's view of injustice is like being tormented by thunder.",
        "source": "T19n0945_008:0144a22_3"
    },
    {
        "source_sentence": "「十者訟習交諠，發於藏覆，如是故有鑒見照燭，如於日中不能藏影；",
        "translation": "(10) Tenth, there is the permeation of disputes and controversies that give rise to obscurations in the store. For this reason a candle illumined by mirror vision is like not being able to hide its reflection in the sun.",
        "source": "T19n0945_008:0144a24_0"
    },
    {
        "source_sentence": "故有惡友、業鏡、火珠披露宿業對驗諸事。",
        "translation": "That's why there are bad friends, mirrors of karma, and fire beads that reveal past actions to testify to the events.",
        "source": "T19n0945_008:0144a25_1"
    },
    {
        "source_sentence": "是故十方一切如來，色目覆藏同名陰賊；",
        "translation": "Thus, all the buddhas of the ten directions are similarly called aggregate thieves because they hide their form and eyes.",
        "source": "T19n0945_008:0144a26_2"
    },
    {
        "source_sentence": "菩薩觀覆如戴高山履於巨海。",
        "translation": "The bodhisattva observes that it's like wearing a high mountain and walking in a great ocean.",
        "source": "T19n0945_008:0144a27_3"
    },
    {
        "source_sentence": "「云何六報？",
        "translation": "(5) What is the sixfold item that is to be experienced as retribution?",
        "source": "T19n0945_008:0144a28_4"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0144a28_5"
    },
    {
        "source_sentence": "一切眾生六識造業，所招惡報從六根出。",
        "translation": "All sentient beings create actions created by the six consciousnesses, and the bad retribution brought about comes from the six faculties.",
        "source": "T19n0945_008:0144a28_6"
    },
    {
        "source_sentence": "「云何惡報從六根出？",
        "translation": "What are the bad retributions that arise from the six faculties?",
        "source": "T19n0945_008:0144a29_7"
    },
    {
        "source_sentence": "一者見報招引惡果。",
        "translation": "One, seeing the results will bring bad consequences.",
        "source": "T19n0945_008:0144a29_8"
    },
    {
        "source_sentence": "此見業交，則臨終時先見猛火滿十方界，亡者神識飛墜乘煙，入無間獄發明二相：「一者明見，",
        "translation": "At the end of his life, he'll first see a fierce fire that fills the ten directions, and the deceased's spirit will fly down into the smoke and enter the hell without interruption to investigate two characteristics:",
        "source": "T19n0945_008:0144b01_9"
    },
    {
        "source_sentence": "則能遍見種種惡物，生無量畏；",
        "translation": "Then they can see all kinds of evil things everywhere and give rise to immeasurable fear.",
        "source": "T19n0945_008:0144b04_10"
    },
    {
        "source_sentence": "二者暗見，寂然不見，生無量恐。",
        "translation": "The second is the fear of seeing in darkness and not seeing in silence, which gives rise to immeasurable fear.",
        "source": "T19n0945_008:0144b04_11"
    },
    {
        "source_sentence": "如是見火、燒聽能為鑊湯洋銅；",
        "translation": "In the same way, seeing fire and burning are able to make a cauldron of hot water and pouring copper into it.",
        "source": "T19n0945_008:0144b05_12"
    },
    {
        "source_sentence": "燒息能為黑烟紫焰；",
        "translation": "Burning and exhaling can be black smoke or purple flame.",
        "source": "T19n0945_008:0144b06_13"
    },
    {
        "source_sentence": "燒味能為燋丸鐵糜；",
        "translation": "The flavor of this food is burned and it turns into uncooked rice balls or cooked iron gruel.",
        "source": "T19n0945_008:0144b06_14"
    },
    {
        "source_sentence": "燒觸能為熱灰爐炭；",
        "translation": "Burning and touch can be the charcoal of hot ashes.",
        "source": "T19n0945_008:0144b07_15"
    },
    {
        "source_sentence": "燒心能生星火迸灑煽鼓空界。",
        "translation": "A burning mind can give rise to stars and fires that burst into flames and stir up the space realm.",
        "source": "T19n0945_008:0144b07_16"
    },
    {
        "source_sentence": "「二者聞報招引惡果。",
        "translation": "The second is that hearing the retribution brings bad consequences.",
        "source": "T19n0945_008:0144b09_0"
    },
    {
        "source_sentence": "此聞業交，則臨終時先見波濤沒溺天地，亡者神識降注乘流，入無間獄發明二相：一者開聽，",
        "translation": "When the karma of hearing is mixed, then at the time of death he first sees a wave that submerges heaven and earth. The deceased’s supernormal consciousness sends down the stream of the vehicle to enter the unremitting hell",
        "source": "T19n0945_008:0144b09_1"
    },
    {
        "source_sentence": "聽種種鬧精神愗亂；",
        "translation": "They listened to the various noises and disturbances, and their minds were confused.",
        "source": "T19n0945_008:0144b11_2"
    },
    {
        "source_sentence": "二者閉聽，寂無所聞幽魄沈沒。",
        "translation": "The second is to shut off the listeners, who are silent and hear nothing, and their souls sink into obscurity.",
        "source": "T19n0945_008:0144b12_3"
    },
    {
        "source_sentence": "如是聞波，注聞則能為責為詰；",
        "translation": "In the same way, when there is a wave of hearing in this way, one can criticize and accuse those who have heard it.",
        "source": "T19n0945_008:0144b12_4"
    },
    {
        "source_sentence": "注見則能為雷為吼，為惡毒氣；",
        "translation": "When one observes it, they can cause thunder and roar as bad and poisonous odors.",
        "source": "T19n0945_008:0144b13_5"
    },
    {
        "source_sentence": "注息則能為雨為霧，灑諸毒虫周滿身體；",
        "translation": "When the water pours forth, it can make rain or mist and shower poisonous insects all over one’s body.",
        "source": "T19n0945_008:0144b14_6"
    },
    {
        "source_sentence": "注味則能為膿為血種種雜穢；",
        "translation": "By pouring in flavor, they are able to mix impurities such as pus and blood.",
        "source": "T19n0945_008:0144b15_7"
    },
    {
        "source_sentence": "注觸則能為畜為鬼為屎為尿；",
        "translation": "By focusing on contact, they can be animals, ghosts, dung, and urine.",
        "source": "T19n0945_008:0144b15_8"
    },
    {
        "source_sentence": "注意則能為電為雹摧碎心魄。",
        "translation": "Being attentive, he'll be able to destroy his mind and soul with lightning and hail.",
        "source": "T19n0945_008:0144b16_9"
    },
    {
        "source_sentence": "「三者嗅報招引惡果。",
        "translation": "Three, the results of smelling bring bad consequences.",
        "source": "T19n0945_008:0144b18_0"
    },
    {
        "source_sentence": "此嗅業交，則臨終時先見毒氣充塞遠近，亡者神識從地涌出，入無間獄發明二相：一者通聞，",
        "translation": "When the action of smell is combined with that of action of smelling, then at death one first sees a conflagration filled with poisonous gas. The deceased’?",
        "source": "T19n0945_008:0144b18_1"
    },
    {
        "source_sentence": "被諸惡氣薰極心擾；",
        "translation": "Their minds are greatly disturbed by the permeation of bad energy.",
        "source": "T19n0945_008:0144b20_2"
    },
    {
        "source_sentence": "二者塞聞，氣掩不通悶絕於地。",
        "translation": "The second is that when he stops hearing, his breath doesn't cover and he faints on the ground.",
        "source": "T19n0945_008:0144b21_3"
    },
    {
        "source_sentence": "如是嗅氣，衝息則能為質為履；",
        "translation": "In the same way, smelling and exhaling are able to act as a footstool for quality.",
        "source": "T19n0945_008:0144b21_4"
    },
    {
        "source_sentence": "衝見則能為火為炬；",
        "translation": "When they are rushed, they can be torches or flames.",
        "source": "T19n0945_008:0144b22_5"
    },
    {
        "source_sentence": "衝聽則能為沒為溺為洋為沸；",
        "translation": "When they rushed and listened to the teaching, they were able to do what is unwholesome, drowning, flooding, and buoyant.",
        "source": "T19n0945_008:0144b23_0"
    },
    {
        "source_sentence": "衝味則能為餒為爽；",
        "translation": "When one attacks the taste, they are able to make it sweet or refreshing.",
        "source": "T19n0945_008:0144b23_1"
    },
    {
        "source_sentence": "衝觸則能為綻為爛，為大肉山，有百千眼無量咂食；",
        "translation": "When struck, it is able to be broken and rotten, like a great mountain of flesh. With hundreds of thousands of myriad eyes the enlightening being eats boundlessly.",
        "source": "T19n0945_008:0144b24_2"
    },
    {
        "source_sentence": "衝思則能為灰為瘴，為飛砂礰擊碎身體。",
        "translation": "When he rushes, he's able to cause ashes and mud, flying sand and dust to smash his body.",
        "source": "T19n0945_008:0144b25_3"
    },
    {
        "source_sentence": "「四者味報招引惡果。",
        "translation": "Fourth, the taste reward brings bad consequences.",
        "source": "T19n0945_008:0144b27_0"
    },
    {
        "source_sentence": "此味業交，則臨終時先見鐵網猛炎熾烈周覆世界，亡者神識下透挂網倒懸其頭，",
        "translation": "When this taste is combined with karma, the deceased first sees a web of iron that's intensely hot and blazing and covers the world at the time of his death. Under his supernormal consciousness, he penetrates it and hangs",
        "source": "T19n0945_008:0144b27_1"
    },
    {
        "source_sentence": "入無間獄發明二相：一者吸氣，結成寒氷凍裂身肉；",
        "translation": "They enter the hell of unremitting rebirth and develop two characteristics:",
        "source": "T19n0945_008:0144b29_2"
    },
    {
        "source_sentence": "二者吐氣，飛為猛火燋爛骨髓。",
        "translation": "The second is the exhalation of breath, which flies into a fierce fire that scorches and burns the bone marrow.",
        "source": "T19n0945_008:0144c01_3"
    },
    {
        "source_sentence": "如是嘗味，歷嘗則能為承為忍；",
        "translation": "In the same way, when one tastes a certain food, he is able to endure and accept it as long as he eats.",
        "source": "T19n0945_008:0144c02_4"
    },
    {
        "source_sentence": "歷見則能為然金石；",
        "translation": "When they see each other one after the other, they are able to make rocks of gold and stone.",
        "source": "T19n0945_008:0144c03_0"
    },
    {
        "source_sentence": "歷聽則能為利兵刃；",
        "translation": "If one listens repeatedly, he can be the sharp sword of war.",
        "source": "T19n0945_008:0144c03_1"
    },
    {
        "source_sentence": "歷息則能為大鐵籠彌覆國土；",
        "translation": "When one breaths, he can become a great iron cage covering all the lands.",
        "source": "T19n0945_008:0144c03_2"
    },
    {
        "source_sentence": "歷觸則能為弓為箭為弩為射；",
        "translation": "When there is contact, it can be a bow, an arrow, a crossbow, or a shot.",
        "source": "T19n0945_008:0144c04_3"
    },
    {
        "source_sentence": "歷思則能為飛熱鐵從空雨下。",
        "translation": "Li Si then was able to fly the hot iron from the sky and rain down.",
        "source": "T19n0945_008:0144c05_4"
    },
    {
        "source_sentence": "「五者觸報招引惡果。",
        "translation": "The fifth is that the retribution of touch brings bad consequences.",
        "source": "T19n0945_008:0144c07_0"
    },
    {
        "source_sentence": "此觸業交，則臨終時先見大山四面來合無復出路，亡者神識見大鐵城，",
        "translation": "At the end of his life, he saw a great mountain coming together on all four sides and no longer leaving the path. The deceased man’s supernormal consciousness saw the great iron- citadel.",
        "source": "T19n0945_008:0144c07_1"
    },
    {
        "source_sentence": "火蛇火狗虎狼師子，牛頭獄卒、馬頭羅剎，手執槍矟驅入城門，向無間獄發明二相：一者合觸，",
        "translation": "Fire, snakes, fire dogs, dogs, tigers, wolves, lions, cow-headed jailers and horse-headed rākṣasa demons were driven into the city gates with spears in their hands and drove",
        "source": "T19n0945_008:0144c09_2"
    },
    {
        "source_sentence": "合山逼體骨肉血潰；",
        "translation": "Together with the mountain, they crushed their bodies into a mass of bones, flesh, and blood.",
        "source": "T19n0945_008:0144c11_3"
    },
    {
        "source_sentence": "二者離觸，刀劍觸身心肝屠裂。",
        "translation": "The second is freedom from touch, which is when a sword touches body and liver being slaughtered with a knife.",
        "source": "T19n0945_008:0144c11_4"
    },
    {
        "source_sentence": "如是合觸，歷觸則能為道為觀為廳為案；",
        "translation": "In the same way, when combined with sense perception, it is possible to make paths, contemplations, halls, and tables.",
        "source": "T19n0945_008:0144c12_5"
    },
    {
        "source_sentence": "歷見則能為燒為爇；",
        "translation": "When they see each other, they are able to be burned or scorched.",
        "source": "T19n0945_008:0144c13_6"
    },
    {
        "source_sentence": "歷聽則能為撞為擊為剚為射；",
        "translation": "When they go along with the listeners, they are able to cause striking or beating, flying or shooting.",
        "source": "T19n0945_008:0144c13_7"
    },
    {
        "source_sentence": "歷息則能為括為袋為拷為縛；",
        "translation": "When one breaths, he can make a bundle, a sack, a torture, or a bond.",
        "source": "T19n0945_008:0144c14_8"
    },
    {
        "source_sentence": "歷嘗則能為耕為鉗為斬為截；",
        "translation": "I am able to cultivate, tame, and cut [the land].",
        "source": "T19n0945_008:0144c15_9"
    },
    {
        "source_sentence": "歷思則能為墜為飛為煎為炙。",
        "translation": "Each thought is capable of falling, flying, boiling, and roasting.",
        "source": "T19n0945_008:0144c16_0"
    },
    {
        "source_sentence": "「六者思報招引惡果。",
        "translation": "Sixth, it's the result of deliberation that brings bad consequences.",
        "source": "T19n0945_008:0144c17_0"
    },
    {
        "source_sentence": "此思業交，則臨終時先見惡風吹壞國土，亡者神識被吹上空旋落乘風，",
        "translation": "When these thoughts and karmas are combined, then at the time of death they first see a bad wind blowing away their lands with an evil wind. The deceased’s spirit and consciousness are blown upward into space and spin around in the wind",
        "source": "T19n0945_008:0144c17_1"
    },
    {
        "source_sentence": "墮無間獄發明二相：一者不覺，迷極則荒奔走不息；",
        "translation": "They fall into the hell of unremitting rebirth and develop two characteristics:",
        "source": "T19n0945_008:0144c19_2"
    },
    {
        "source_sentence": "二者不迷，覺知則苦無量煎燒痛深難忍。",
        "translation": "The second is that they aren't confused, for when they perceive it, the pain of suffering is immeasurable and the pain of burning is profound and difficult to endure.",
        "source": "T19n0945_008:0144c20_3"
    },
    {
        "source_sentence": "如是邪思，結思則能為方為所；",
        "translation": "In this way, wrong conceptual thought is able to act as direction and as object.",
        "source": "T19n0945_008:0144c21_4"
    },
    {
        "source_sentence": "結見則能為鑒為證；",
        "translation": "When it is fettered by views, it can be seen and realized.",
        "source": "T19n0945_008:0144c21_5"
    },
    {
        "source_sentence": "結聽則能為大合石，為氷為霜為土為霧；",
        "translation": "When they are concentrated and listened to, they can form a great composite rock, which is like ice or frost or dirt or mist.",
        "source": "T19n0945_008:0144c22_6"
    },
    {
        "source_sentence": "結息則能為大火車火船火檻；",
        "translation": "When the conflagration stops, they can become great chariots, ships, and fire thresholds.",
        "source": "T19n0945_008:0144c23_7"
    },
    {
        "source_sentence": "結嘗則能為大叫喚，為悔為泣；",
        "translation": "The fetters can cause great wailing and screaming, as well as repentance and lamentation.",
        "source": "T19n0945_008:0144c24_8"
    },
    {
        "source_sentence": "結觸則能為大為小，為一日中萬生萬死，為偃為仰。",
        "translation": "When it's fettered and touched, it can be great or small, ten thousand births in a single day or ten thousand deaths in a single day, and it's rejected or raised.",
        "source": "T19n0945_008:0144c24_9"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0144c26_0"
    },
    {
        "source_sentence": "是名地獄十因六果，皆是眾生迷妄所造。",
        "translation": "These are called the ten causes and six effects of hell, all created by sentient beings in delusion.",
        "source": "T19n0945_008:0144c26_1"
    },
    {
        "source_sentence": "若諸眾生惡業圓造，入阿鼻獄受無量苦經無量劫；",
        "translation": "If sentient beings have completed evil deeds, they will fall into the avīci hell and suffer immeasurable pain for an innumerable number of kalpas.",
        "source": "T19n0945_008:0144c27_2"
    },
    {
        "source_sentence": "六根各造，及彼所作兼境兼根，是人則入八無間獄；",
        "translation": "When the six faculties are each formed by one another, and when what they do is combined with both objects and faculties: this person then enters eight hells of unremitting torture.",
        "source": "T19n0945_008:0144c28_3"
    },
    {
        "source_sentence": "身口意三，作殺盜婬，是人則入十八地獄；",
        "translation": "Volition can coexist with three courses of action: bodily, verbal and mental action. If one commits killing, stealing, or sexual misconduct, that person will go to the eighteen hells.",
        "source": "T19n0945_008:0144c29_4"
    },
    {
        "source_sentence": "三業不兼，中間或為一殺一盜，是人則入三十六地獄；",
        "translation": "If the three actions are not combined, and if in between they kill or steal for just one action, that person will fall into thirty-six hells.",
        "source": "T19n0945_008:0145a01_5"
    },
    {
        "source_sentence": "見見一根單犯一業，是人則入一百八地獄。",
        "translation": "If someone sees one faculty and simply commits one action, they'll go to the 108 hells.",
        "source": "T19n0945_008:0145a02_6"
    },
    {
        "source_sentence": "由是眾生別作別造，於世界中入同分地，妄想發生非本來有。",
        "translation": "Because sentient beings are created separately, they enter the same part of the world and deludedly conceive that it doesn't originally exist.",
        "source": "T19n0945_008:0145a03_7"
    },
    {
        "source_sentence": "「復次，阿難！",
        "translation": "Furthermore, Ānanda!",
        "source": "T19n0945_008:0145a05_0"
    },
    {
        "source_sentence": "是諸眾生非破律儀，犯菩薩戒，毀佛涅槃，諸餘雜業歷劫燒然，後還罪畢受諸鬼形；",
        "translation": "These sentient beings do not violate the precepts. They break the bodhisattva precepts and disparage the Buddha’s nirvana. The rest of their miscellaneous activities burn up for kalpas, and later return to be reborn",
        "source": "T19n0945_008:0145a05_1"
    },
    {
        "source_sentence": "若於本因貪物為罪，是人罪畢遇物成形，名為魑鬼；",
        "translation": "If someone commits the sin of covetousness toward things as their original cause, they are called a lustful ghost.",
        "source": "T19n0945_008:0145a07_2"
    },
    {
        "source_sentence": "貪色為罪，是人罪畢遇風成形，名為魑鬼；",
        "translation": "Lust for form is a blameworthy action. When this person, after having committed a sin, encounters wind and takes his form in the wind, which is called a hungry ghost.",
        "source": "T19n0945_008:0145a08_3"
    },
    {
        "source_sentence": "貪惑為罪，是人罪畢遇畜成形，名為魅鬼；",
        "translation": "The blameworthiness of craving and delusion is called a magical ghost when, having been condemned, the person encounters an animal that takes shape.",
        "source": "T19n0945_008:0145a09_4"
    },
    {
        "source_sentence": "貪恨為罪，是人罪畢遇蟲成形，名蠱毒鬼；",
        "translation": "Lust and hatred are sins. When a person is condemned, he meets an insect that takes on the form of a poisonous ghost after having been condemned.",
        "source": "T19n0945_008:0145a10_5"
    },
    {
        "source_sentence": "貪憶為罪，是人罪畢遇衰成形，名為癘鬼；",
        "translation": "Consciousness of greed is a blameworthy action. When this person, after having committed a sin, dies and takes his form as a ghost, they are called hungry ghosts.",
        "source": "T19n0945_008:0145a11_6"
    },
    {
        "source_sentence": "貪慠為罪，是人罪畢遇氣成形，名為餓鬼；",
        "translation": "Consciousness of greed and hatred is the blameworthiness. This person, having committed this blameworthy offense, meets a wind forming in his body, which is called a hungry ghost.",
        "source": "T19n0945_008:0145a12_7"
    },
    {
        "source_sentence": "貪罔為罪，是人罪畢遇幽為形，名為魘鬼；",
        "translation": "When a person is guilty of the sin of greed and ignorance, it is called a dreaming ghost.",
        "source": "T19n0945_008:0145a13_0"
    },
    {
        "source_sentence": "貪明為罪，是人罪畢遇精為形，名魍魎鬼；",
        "translation": "The craving for light is blameworthy. When this person, after having committed a sin, meets with semen as his physical form, he is called a coarse ghost.",
        "source": "T19n0945_008:0145a14_0"
    },
    {
        "source_sentence": "貪成為罪，是人罪畢遇明為形，名役使鬼；",
        "translation": "Desire becomes a transgression, and when this person is confronted with knowledge at the end of his transgression, it takes the form of an envoy ghost.",
        "source": "T19n0945_008:0145a14_1"
    },
    {
        "source_sentence": "貪黨為罪，是人罪畢遇人為形，名傳送鬼。",
        "translation": "Grasping is a sin, and this person's form is when they meet someone after committing a sin, which is called sending off a ghost.",
        "source": "T19n0945_008:0145a15_2"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0145a16_3"
    },
    {
        "source_sentence": "是人皆以純情墜落，業火燒乾上出為鬼，此等皆是自妄想業之所招引；",
        "translation": "These people all fell down because of their pure emotions, burned by the fire of karma and flew up like ghosts. They were all attracted by their own deluded thoughts and actions.",
        "source": "T19n0945_008:0145a16_4"
    },
    {
        "source_sentence": "若悟菩提，則妙圓明，本無所有。",
        "translation": "If someone realizes enlightenment, then they'll marvel at perfect clarity, which originally has no existence.",
        "source": "T19n0945_008:0145a18_5"
    },
    {
        "source_sentence": "「復次，阿難！",
        "translation": "Furthermore, Ānanda!",
        "source": "T19n0945_008:0145a20_0"
    },
    {
        "source_sentence": "鬼業既盡，則情與想二俱成空，方於世間與元負人怨對相值，身為畜生酬其宿債。",
        "translation": "When the demon's karma has ended, then both feelings and perceptions become empty, and it's only when they're enemies of the originally negative person in the world that they're born as an animal to repay their past debts.",
        "source": "T19n0945_008:0145a20_1"
    },
    {
        "source_sentence": "物怪之鬼物銷報盡，生於世間多為梟類；",
        "translation": "monsters and ghosts are born in the world, mostly as owls when their retribution is exhausted.",
        "source": "T19n0945_008:0145a22_2"
    },
    {
        "source_sentence": "風魑之鬼風銷報盡，生於世間多為咎徵一切異類；",
        "translation": "The wind and the wind demons have exhausted their retribution. They are born in the world but mostly blameworthy, pointing out all kinds of differences.",
        "source": "T19n0945_008:0145a23_3"
    },
    {
        "source_sentence": "畜魅之鬼畜死報盡，生於世間多為狐類；",
        "translation": "When the retribution of hungry ghosts and animals dies, they are mostly fox-like creatures born in the world.",
        "source": "T19n0945_008:0145a24_4"
    },
    {
        "source_sentence": "蟲蠱之鬼蟲滅報盡，生於世間多為毒類；",
        "translation": "When the retribution of these insects is exhausted, they are born in the world but mostly as poisonous creatures.",
        "source": "T19n0945_008:0145a25_5"
    },
    {
        "source_sentence": "衰癘之鬼衰窮報盡，生於世間多為蛔類；",
        "translation": "When the retribution of hungry ghosts is exhausted, they are born in the world but mostly as gadflies.",
        "source": "T19n0945_008:0145a26_6"
    },
    {
        "source_sentence": "受氣之鬼氣銷報盡，生於世間多為食類；",
        "translation": "When their karmic retribution is exhausted, they are born in the world but mostly as food.",
        "source": "T19n0945_008:0145a27_7"
    },
    {
        "source_sentence": "綿幽之鬼幽銷報盡，生於世間多為服類；",
        "translation": "Their retribution is exhausted, and they are born in the world mostly as garments.",
        "source": "T19n0945_008:0145a28_0"
    },
    {
        "source_sentence": "和精之鬼和銷報盡，生於世間多為應類；",
        "translation": "When the retribution of harmonious spirits and harmonious equanimity is exhausted, they are born in the world mostly as sentient beings.",
        "source": "T19n0945_008:0145a28_1"
    },
    {
        "source_sentence": "明靈之鬼明滅報盡，生於世間多為休徵一切諸類；",
        "translation": "When the retribution of mystical spirits is exhausted, they are born in the world and mostly serve as a resting place for all living beings.",
        "source": "T19n0945_008:0145a29_2"
    },
    {
        "source_sentence": "依人之鬼人亡報盡，生於世間多於循類。",
        "translation": "Depending on human beings, ghosts and humans die at the end of their retribution, and they're born in the world more often than other kinds.",
        "source": "T19n0945_008:0145b02_3"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0145b03_4"
    },
    {
        "source_sentence": "是等皆以業火乾枯，酬其宿債傍為畜生，此等亦皆自虛妄業之所招引；",
        "translation": "They are all dried up by the fire of action and repaying their past debts as animals. All of these, too, are attracted by their own false actions.",
        "source": "T19n0945_008:0145b03_5"
    },
    {
        "source_sentence": "若悟菩提，則此妄緣本無所有。",
        "translation": "If someone realizes enlightenment, then this false condition originally has no existence.",
        "source": "T19n0945_008:0145b04_6"
    },
    {
        "source_sentence": "如汝所言寶蓮香等，及瑠璃王善星比丘，如是惡業本自發明，非從天降亦非地出亦非人與，",
        "translation": "Just as you said, such [things] as the fragrance of jeweled lotus flowers and so on, together with the bhikṣu Sunetra Bhikṣus, king of lapis lazuli. Such evil deeds were original",
        "source": "T19n0945_008:0145b05_7"
    },
    {
        "source_sentence": "自妄所招還自來受；",
        "translation": "They are drawn by their own delusion and return to receive it in their own way.",
        "source": "T19n0945_008:0145b07_8"
    },
    {
        "source_sentence": "菩提心中皆為浮妄虛想凝結。",
        "translation": "In the mind of enlightenment, they all become floating, deluded, and unreal thoughts that are concentrated.",
        "source": "T19n0945_008:0145b08_9"
    },
    {
        "source_sentence": "「復次，阿難！",
        "translation": "Furthermore, Ānanda!",
        "source": "T19n0945_008:0145b09_0"
    },
    {
        "source_sentence": "從是畜生酬償先債，若彼酬者分越所酬，此等眾生還復為人返徵其剩，",
        "translation": "From this, the animals will repay their previous debts. If they do so, they'll be given a portion of what they had paid back. These sentient beings will again and again return it to someone else to ask for what remains.",
        "source": "T19n0945_008:0145b09_1"
    },
    {
        "source_sentence": "如彼有力兼有福德，則於人中不捨人身酬還彼力；",
        "translation": "In the same way, if they are powerful and endowed with virtue, then among humans they do not relinquish their human bodies to repay their strength.",
        "source": "T19n0945_008:0145b10_2"
    },
    {
        "source_sentence": "若無福者，還為畜生償彼餘直。",
        "translation": "If there's no merit, he'll return to the animals to pay for the rest of his straightforwardness.",
        "source": "T19n0945_008:0145b12_3"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0145b12_4"
    },
    {
        "source_sentence": "當知若用錢物或役其力，償足自停，如於中間殺彼身命或食其肉，如是乃至經微塵劫，",
        "translation": "You should know that if someone uses money, property, or power to pay for their own feet and stops on their own, just as in the interim he kills his life or eats its flesh, it's like this up to a tiny eon",
        "source": "T19n0945_008:0145b12_5"
    },
    {
        "source_sentence": "相食相誅猶如轉輪，互為高下無有休息；",
        "translation": "They feed on each other and kill each other just as if they were turning a wheel, going up and down one after the other without cease.",
        "source": "T19n0945_008:0145b14_6"
    },
    {
        "source_sentence": "除奢摩他及佛出世，不可停寢。",
        "translation": "Except for calm abiding and the Buddha's appearance in the world, he mustn't stop or sleep.",
        "source": "T19n0945_008:0145b15_7"
    },
    {
        "source_sentence": "汝今應知，彼梟倫者酬足復形，生人道中參合頑類；",
        "translation": "Good man, you should now know that this owl-monk is content and regains his form. He will be reborn in the human realm to live together with other stubborn people.",
        "source": "T19n0945_008:0145b16_8"
    },
    {
        "source_sentence": "彼咎徵者酬足復形，生人道中參合愚類；",
        "translation": "Those who are blamed and criticized will be reborn in the human realm, joining together with the ignorant.",
        "source": "T19n0945_008:0145b17_9"
    },
    {
        "source_sentence": "彼狐倫者酬足復形，生人道中參於佷類；",
        "translation": "That foul-mouthed one, having repaid his former form and regained it, was reborn in the human realm and joined the wicked.",
        "source": "T19n0945_008:0145b18_10"
    },
    {
        "source_sentence": "彼毒倫者酬足復形，生人道中參合庸類；",
        "translation": "Those poisonous companions, having repaid their former form and regained it, are reborn in the human realm but mix with the mediocre.",
        "source": "T19n0945_008:0145b19_11"
    },
    {
        "source_sentence": "彼蛔倫者酬足復形，生人道中參合微類；",
        "translation": "The asuras will be reborn in the human realm, mixing with various species.",
        "source": "T19n0945_008:0145b20_12"
    },
    {
        "source_sentence": "彼食倫者酬足復形，生人道中參合柔類；",
        "translation": "That food-eating companion, having been satisfied and restored to his form, is reborn in the human realm but mixes with other gentle beings.",
        "source": "T19n0945_008:0145b21_13"
    },
    {
        "source_sentence": "彼服倫者酬足復形，生人道中參合勞類；",
        "translation": "Those who follow the ways of companionship and repay their former forms are born in the human realm, where they may be mixed with other kinds of laborers.",
        "source": "T19n0945_008:0145b22_14"
    },
    {
        "source_sentence": "彼應倫者酬足復形，生人道中參於文類；",
        "translation": "Those worthy companions, having fulfilled [their duties] and regained physical form, were reborn in the human realm and studied literature.",
        "source": "T19n0945_008:0145b23_15"
    },
    {
        "source_sentence": "彼休徵者酬足復形，生人道中參合明類；",
        "translation": "Those who give up the request will be repaid and restored to their forms, born among humans in the human realm.",
        "source": "T19n0945_008:0145b24_16"
    },
    {
        "source_sentence": "彼諸循倫酬足復形，生人道中參於達類。",
        "translation": "Those followers of the śramaṇas and brāhmaṇas who were satisfied and restored their forms were born in the human realm and joined the Bodhisattvas.",
        "source": "T19n0945_008:0145b25_17"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0145b26_18"
    },
    {
        "source_sentence": "是等皆以宿債畢酬復形人道，皆無始來業計顛倒相生相殺，不遇如來不聞正法，",
        "translation": "They all repay their past debts and return to the human path. All of them, from beginningless time, engaged in misconstrual [and] killing each other because they did not meet the Buddha and did not hear the true teaching.",
        "source": "T19n0945_008:0145b26_19"
    },
    {
        "source_sentence": "於塵勞中法爾輪轉，此輩名為可憐愍者。",
        "translation": "In the wheel of the Dharma in the midst of worldly suffering, these people are called pitiable.",
        "source": "T19n0945_008:0145b28_20"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0145c01_0"
    },
    {
        "source_sentence": "復有從人不依正覺修三摩地，別修妄念存想固形，遊於山林人不及處，",
        "translation": "Again, some people cultivate samādhi from someone who doesn't rely on right awakening and separately cultivate deluded thoughts to preserve the fixed form of perception, traveling through mountains and forests where people don't like it.",
        "source": "T19n0945_008:0145c01_1"
    },
    {
        "source_sentence": "有十仙種。",
        "translation": "There are ten kinds of sages.",
        "source": "T19n0945_008:0145c02_2"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0145c03_3"
    },
    {
        "source_sentence": "彼諸眾生，堅固服餌而不休息，食道圓成，名地行仙；",
        "translation": "Those sentient beings were firm and did not rest when they ate the food. Their paths of feeding became perfectly formed, and they were called earth-practicing immortals.",
        "source": "T19n0945_008:0145c03_4"
    },
    {
        "source_sentence": "堅固草木而不休息，藥道圓成，名飛行仙；",
        "translation": "Steadfast as the grass and trees, he never rests; his path of healing is perfected. He is called the flying immortal.",
        "source": "T19n0945_008:0145c04_5"
    },
    {
        "source_sentence": "堅固金石而不休息，化道圓成，名遊行仙；",
        "translation": "He was a sage of the Way, renowned for his boldness and unremitting vigor.",
        "source": "T19n0945_008:0145c05_6"
    },
    {
        "source_sentence": "堅固動止而不休息，氣精圓成，名空行仙；",
        "translation": "The sage who is steadfast, agitated and unceasing, his vitality perfected. He is called the emperor traveling in space.",
        "source": "T19n0945_008:0145c06_7"
    },
    {
        "source_sentence": "堅固津液而不休息，潤德圓成，名天行仙；",
        "translation": "The sage who is steadfast and doesn’t rest, endowed with the perfection of nourishing qualities, is called the divine traveling sage.",
        "source": "T19n0945_008:0145c07_8"
    },
    {
        "source_sentence": "堅固精色而不休息，吸粹圓成，名通行仙；",
        "translation": "The sage who does not rest in the form of steadfast energy and whose juices are collected to perfect their formation is called the one who travels on the path.",
        "source": "T19n0945_008:0145c08_9"
    },
    {
        "source_sentence": "堅固呪禁而不休息，術法圓成，名道行仙；",
        "translation": "A sage steadfast incantations and not resting, perfected in all arts and sciences, he is called a practitioner of the Way.",
        "source": "T19n0945_008:0145c09_10"
    },
    {
        "source_sentence": "堅固思念而不休息，思憶圓成，名照行仙；",
        "translation": "Being steadfast in thought without resting, his thoughts and recollections perfected, he is called the phantom-practicing illumination.",
        "source": "T19n0945_008:0145c10_0"
    },
    {
        "source_sentence": "堅固交遘而不休息，感應圓成，名精行仙；",
        "translation": "The sage who is steadfast, engaged in debate without ceasing, and completely enlightened. He is called the spirit of zealous practice.",
        "source": "T19n0945_008:0145c10_1"
    },
    {
        "source_sentence": "堅固變化而不休息，覺悟圓成，名絕行仙。",
        "translation": "Being resolute in his transformations without resting, he's perfectly enlightened and accomplished, and he's called the immortal who stops practicing.",
        "source": "T19n0945_008:0145c11_2"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0145c12_3"
    },
    {
        "source_sentence": "是等皆於人中鍊心，不循正覺，別得生理壽千萬歲，休止深山或大海島絕於人境，",
        "translation": "They all cultivate their minds among humans and don’t follow right awakening. They attain separate physical life spans of a thousand years, so that they may live in the deep mountains or ocean islands without human beings.",
        "source": "T19n0945_008:0145c12_4"
    },
    {
        "source_sentence": "斯亦輪迴妄想流轉，不修三昧，報盡還來散入諸趣。",
        "translation": "They also transmigrate in the stream of deluded thoughts, don't cultivate samādhi, return when their retribution is exhausted, and disperse into the destinies.",
        "source": "T19n0945_008:0145c14_5"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0145c16_0"
    },
    {
        "source_sentence": "諸世間人不求常住，未能捨諸妻妾恩愛，於邪婬中心不流逸澄瑩生明，",
        "translation": "The people of the world don't seek permanence, aren't able to abandon their wives and concubines' kindnesses, and don't practice sexual misconduct in the midst of sexual misconduct that produces clarity and insight.",
        "source": "T19n0945_008:0145c16_1"
    },
    {
        "source_sentence": "命終之後隣於日月，如是一類名四天王天；",
        "translation": "At the end of their lifetimes, they will be next to the sun and moon. These beings are thus called the four guardian gods of heaven.",
        "source": "T19n0945_008:0145c17_2"
    },
    {
        "source_sentence": "於己妻房婬愛微薄，於淨居時不得全味，命終之後超日月明居人間頂，",
        "translation": "Their love for their own wife's room is weak, and they can't get the full flavor when they live in a pure place. After their life ends, they transcend the sun and moon and live at the top of the human world.",
        "source": "T19n0945_008:0145c18_3"
    },
    {
        "source_sentence": "如是一類名忉利天；",
        "translation": "In this way one kind is called the Trāyastriṃśa gods.",
        "source": "T19n0945_008:0145c20_4"
    },
    {
        "source_sentence": "逢欲暫交去無思憶，於人間世動少靜多，命終之後於虛空中朗然安住，",
        "translation": "When he was about to leave the world for a short time, he had no ideation of it. The human world moved slowly and quietly, but when his life came to an end he remained in space, shining peacefully.",
        "source": "T19n0945_008:0145c20_5"
    },
    {
        "source_sentence": "日月光明上照不及，是諸人等自有光明，如是一類名須焰摩天；",
        "translation": "The light of the sun and moon is not as bright as that which shines above. These beings themselves have their own light. Such a group is called the Sudarśana gods.",
        "source": "T19n0945_008:0145c22_6"
    },
    {
        "source_sentence": "一切時靜，有應觸來未能違戾，命終之後上昇精微，不接下界諸人天境，",
        "translation": "At all times it is still, and there are those who should be touched but cannot disobey it. When their life ends they rise up in the realm of sentient beings and gods; not humans or goddesses in the lower realms.",
        "source": "T19n0945_008:0145c24_7"
    },
    {
        "source_sentence": "乃至劫壞三災不及，如是一類名兜率陀天；",
        "translation": "As long as the world age of destruction and the three calamities do not come up, such a class is called the Tushita heaven.",
        "source": "T19n0945_008:0145c25_8"
    },
    {
        "source_sentence": "我無欲心應汝行事，於橫陳時味如嚼蠟，命終之後生越化地，如是一類名樂變化天；",
        "translation": "You should act according to my mind free from desire. When I manifest it, its taste is like that of chewing on the scented milk. After death, I will be reborn in the transfiguration realm. Such a being is called the Nirmāṇarati",
        "source": "T19n0945_008:0145c26_9"
    },
    {
        "source_sentence": "無世間心同世行事，於行事交了然超越，命終之後遍能出超化無化境，",
        "translation": "The absence of worldly awarenesses is the same as worldly action. They are simultaneous and transcend one another in terms of action. After death, they can go beyond all realms of apparitional beings and nonapparitional beings.",
        "source": "T19n0945_008:0145c28_10"
    },
    {
        "source_sentence": "如是一類名他化自在天。",
        "translation": "Thus, this one type is called the Paranirmita-vaśavartin Heaven.",
        "source": "T19n0945_008:0146a01_11"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_008:0146a01_12"
    },
    {
        "source_sentence": "如是六天，形雖出動心跡尚交，自此已還名為欲界。",
        "translation": "Thus these six celestials, even though their forms emerge and move, still share the same mental traces, and after that they're called the desire realm again.",
        "source": "T19n0945_008:0146a02_0"
    },
    {
        "source_sentence": "大佛頂萬行首楞嚴經卷第八",
        "translation": "Mahāprajñāpāramitā-sūtra, Volume 8",
        "source": "T19n0945_008:0146a04_0"
    }
]