[
    {
        "source_sentence": "大佛頂如來密因修證了義諸",
        "translation": "The Tathāgata Mahāprajñāpāramitā-sūtra explains the meaning of cultivating and realizing the esoteric causes of the Tathāgata.",
        "source": "T19n0945_006:0128b10_0"
    },
    {
        "source_sentence": "菩薩萬行首楞嚴經卷第六(一名中印度那蘭陀大道場經，於灌頂部錄出別行)唐天竺沙門般剌蜜帝譯爾時，",
        "translation": "Śūraṃgama-sutta-sūtra, vol. 6 (a scripture of the Great Path of Nāranda in Central India translated at that time by the Tang dynasty śramaṇa Pāramitā).",
        "source": "T19n0945_006:0128b11_0"
    },
    {
        "source_sentence": "觀世音菩薩即從座起，頂禮佛足而白佛言：「世尊！",
        "translation": "The Bodhisattva Avalokiteśvara rose from his seat, bowed his head at the Buddha's feet, and said to him, Bhagavān!",
        "source": "T19n0945_006:0128b15_1"
    },
    {
        "source_sentence": "憶念我昔無數恒河沙劫，於時有佛出現於世名觀世音，我於彼佛發菩提心，",
        "translation": "“Furthermore, Lord, I remember how many eons ago, as numerous as the grains of sand in the Ganges River, a buddha named Avalokiteśvara appeared in the world. To that buddha I set my mind on enlighten",
        "source": "T19n0945_006:0128b16_2"
    },
    {
        "source_sentence": "彼佛教我從聞思修入三摩地。",
        "translation": "That Buddhist teaching is that I enter samādhi from hearing, contemplating, and cultivating.",
        "source": "T19n0945_006:0128b18_0"
    },
    {
        "source_sentence": "初於聞中入流亡所，所入既寂，動靜二相了然不生，如是漸增，聞、所聞盡，",
        "translation": "The first is to enter the place of transmigration while hearing, and when that which one enters becomes extinguished, the two characteristics of movement and stillness do not arise after having been understood.",
        "source": "T19n0945_006:0128b18_1"
    },
    {
        "source_sentence": "盡聞不住，覺、所覺空，空覺極圓，空、所空滅，生滅既滅寂滅現前，",
        "translation": "When he hears all, he doesn’t abide; when he perceives emptiness and the emptiness of what he perceives, his perception of emptiness becomes ultimately perfect. Emptiness and that which is emptiness cea",
        "source": "T19n0945_006:0128b20_2"
    },
    {
        "source_sentence": "忽然超越世出世間，十方圓明獲二殊勝：一者上合十方諸佛本妙覺心，",
        "translation": "Suddenly, transcending mundane and supramundane, the perfect enlightenment of the ten directions suddenly attained two superiorities: first, it united the minds of the originally wonderfully enlightened buddhas of the ten directions,",
        "source": "T19n0945_006:0128b21_3"
    },
    {
        "source_sentence": "與佛如來同一慈力；",
        "translation": "They share the same compassion as buddhas and buddha-tathāgatas.",
        "source": "T19n0945_006:0128b23_4"
    },
    {
        "source_sentence": "二者下合十方一切六道眾生，與諸眾生同一悲仰。",
        "translation": "Second, it unites all the sentient beings of the six destinies in the ten directions and shares the same compassion and reverence with sentient beings.",
        "source": "T19n0945_006:0128b23_5"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T19n0945_006:0128b26_0"
    },
    {
        "source_sentence": "由我供養觀音如來，蒙彼如來授我如幻聞薰聞修金剛三昧，與佛如來同慈力故，",
        "translation": "Because of my offerings to the Tathāgata Avalokiteśvara, who taught me from that buddha the adamantine absorption of hearing and perfuming like illusions in the same kind of compassion as those of all buddhas.",
        "source": "T19n0945_006:0128b26_1"
    },
    {
        "source_sentence": "令我身成三十二應，入諸國土。",
        "translation": "It causes my body to form the thirty-two responses and enter all lands.",
        "source": "T19n0945_006:0128b28_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T19n0945_006:0128b28_1"
    },
    {
        "source_sentence": "若諸菩薩入三摩地，進修無漏勝解現圓，我現佛身而為說法，令其解脫；",
        "translation": "“If enlightening beings enter concentration and develop uncontaminated resolve, I manifest buddha-bodies to teach them so that they may be liberated.",
        "source": "T19n0945_006:0128b28_2"
    },
    {
        "source_sentence": "若諸有學寂靜妙明勝妙現圓，我於彼前現獨覺身而為說法，令其解脫；",
        "translation": "Those who are still, tranquil, subtle, and marvelously luminous I teach by revealing to them the form of self-enlightenedness in order to liberate them.",
        "source": "T19n0945_006:0128c01_3"
    },
    {
        "source_sentence": "若諸有學斷十二緣，緣斷勝性勝妙現圓，我於彼前現緣覺身而為說法，",
        "translation": "If there are those who have studied eliminating the twelve conditions as causal conditions and whose ultimate nature of elimination is transcendentally subtle and perfectly manifest, I will teach them the Dharma by appearing before them in the body of a pratyekabuddha",
        "source": "T19n0945_006:0128c03_4"
    },
    {
        "source_sentence": "令其解脫；",
        "translation": "I cause them to be liberated.",
        "source": "T19n0945_006:0128c04_5"
    },
    {
        "source_sentence": "若諸有學得四諦空，修道入滅勝性現圓，我於彼前現聲聞身而為說法，",
        "translation": "If there are students who attain emptiness of the four truths and cultivate the path to enter cessation, whose ultimate nature is manifested as perfect, I will expound the Dharma for them by appearing before them in the form of a śrāvaka",
        "source": "T19n0945_006:0128c05_6"
    },
    {
        "source_sentence": "令其解脫；",
        "translation": "I cause them to be liberated.",
        "source": "T19n0945_006:0128c06_7"
    },
    {
        "source_sentence": "若諸眾生欲心明悟，不犯欲塵欲身清淨，我於彼前現梵王身而為說法，",
        "translation": "“Furthermore, if all sentient beings whose minds are enlightened by their desires do not violate the precepts of sexual desire, I teach them the Dharma by changing myself into the form of Brahmā.",
        "source": "T19n0945_006:0128c06_8"
    },
    {
        "source_sentence": "令其解脫；",
        "translation": "I cause them to be liberated.",
        "source": "T19n0945_006:0128c08_9"
    },
    {
        "source_sentence": "若諸眾生欲為天主統領諸天，我於彼前現帝釋身而為說法，令其成就；",
        "translation": "If sentient beings want to be lords of the gods and rule over the gods, I teach them by revealing myself as Indra in front of them, thereby enabling them to do so.",
        "source": "T19n0945_006:0128c08_10"
    },
    {
        "source_sentence": "若諸眾生欲身自在遊行十方，我於彼前現自在天身而為說法，令其成就；",
        "translation": "If sentient beings travel in the ten directions freely according to their mentalities, I show them my celestial body and teach the Dharma so that they will attain enlightenment.",
        "source": "T19n0945_006:0128c10_11"
    },
    {
        "source_sentence": "若諸眾生欲身自在飛行虛空，我於彼前現大自在天身而為說法，令其成就；",
        "translation": "If sentient beings fly in space freely according to their desires, I show them the form of Maheśvaradeva and teach the Dharma so that they will attain enlightenment.",
        "source": "T19n0945_006:0128c12_12"
    },
    {
        "source_sentence": "若諸眾生愛統鬼神救護國土，我於彼前現天大將軍身而為說法，令其成就；",
        "translation": "Those sentient beings who wish to lead the spirits and rescue their lands I teach by showing them my celestial general’s body, thereby enabling them to do so.",
        "source": "T19n0945_006:0128c14_0"
    },
    {
        "source_sentence": "若諸眾生愛統世界保護眾生，我於彼前現四天王身而為說法，令其成就；",
        "translation": "If sentient beings wish to unify worlds and protect sentient beings, I show them the forms of the four celestial kings and teach truth so that they will attain enlightenment.",
        "source": "T19n0945_006:0128c15_1"
    },
    {
        "source_sentence": "若諸眾生愛生天宮驅使鬼神，我於彼前現四天王國太子身而為說法，令其成就；",
        "translation": "If sentient beings desire to be born in celestial palaces or driven away by ghosts and spirits, I show them the bodies of the princes of the four celestial kingdoms before me to preach for them, enabling",
        "source": "T19n0945_006:0128c17_2"
    },
    {
        "source_sentence": "若諸眾生樂為人主，我於彼前現人王身而為說法，令其成就；",
        "translation": "If sentient beings delight in becoming human leaders, I teach the truth to them by appearing as human kings before them, thereby enabling them to do so.",
        "source": "T19n0945_006:0128c19_3"
    },
    {
        "source_sentence": "若諸眾生愛主族姓世間推讓，我於彼前現長者身而為說法，令其成就；",
        "translation": "If sentient beings desire their leaders, clans, and castes to be abandoned by the world, I show them my form as an elder and teach enlightening being so that they will attain enlightenment.",
        "source": "T19n0945_006:0128c20_4"
    },
    {
        "source_sentence": "若諸眾生愛談名言清淨其居，我於彼前現居士身而為說法，令其成就；",
        "translation": "If all sentient beings desire to talk of names and words in order to purify their abodes, I teach them the Dharma by appearing before them as a householder, thereby enabling them to do so.",
        "source": "T19n0945_006:0128c22_5"
    },
    {
        "source_sentence": "若諸眾生愛治國土剖斷邦邑，我於彼前現宰官身而為說法，令其成就；",
        "translation": "If all sentient beings desire to rule their lands and cut off nations, I teach the truth for them by appearing before them as ruler, thereby enabling them to do so.",
        "source": "T19n0945_006:0128c24_6"
    },
    {
        "source_sentence": "若諸眾生愛諸數術攝衛自居，我於彼前現婆羅門身而為說法，令其成就；",
        "translation": "If all sentient beings love countless skillful means of self-protection, I show them the form of a brahman and explain to them the Teaching, enabling them to attain it.",
        "source": "T19n0945_006:0128c25_7"
    },
    {
        "source_sentence": "若有男子好學出家持諸戒律，我於彼前現比丘身而為說法，令其成就；",
        "translation": "“Furthermore, if there is a man who wishes to learn and renounce household life in order to keep the precepts, I will show him the form of a monk and teach him the Dharma so that he may attain enlightenment.",
        "source": "T19n0945_006:0128c27_8"
    },
    {
        "source_sentence": "若有女子好學出家持諸禁戒，我於彼前現比丘尼身而為說法，令其成就；",
        "translation": "Suppose there is a woman who wishes to learn and renounce the householder’s life. She keeps all the precepts. I reveal myself as a bhikṣuṇī in front of her, expounding the Dharma so that she will attain",
        "source": "T19n0945_006:0128c29_9"
    },
    {
        "source_sentence": "若有男子樂持五戒，我於彼前現優婆塞身而為說法，令其成就；",
        "translation": "If there is a man who wishes to keep the five precepts, I teach him the Dharma by appearing before him in the form of an layman and causing him to do so.",
        "source": "T19n0945_006:0129a01_10"
    },
    {
        "source_sentence": "若復女子五戒自居，我於彼前現優婆夷身而為說法，令其成就；",
        "translation": "“Furthermore, if a woman keeps the five precepts by herself, I will expound the Teaching to her in the form of an upāsikā and cause her to attain enlightenment.",
        "source": "T19n0945_006:0129a03_11"
    },
    {
        "source_sentence": "若有女人內政立身以修家國，我於彼前現女主身及國夫人命婦大家而為說法，",
        "translation": "If there is a woman who governs herself internally and establishes herself as a kingdom in order to cultivate her family, then I will show the queen’s body and the ladies of my kingdom before their wives so that they can teach me the Dharma",
        "source": "T19n0945_006:0129a04_12"
    },
    {
        "source_sentence": "令其成就；",
        "translation": "I cause them to attain enlightenment.",
        "source": "T19n0945_006:0129a06_13"
    },
    {
        "source_sentence": "若有眾生不壞男根，我於彼前現童男身而為說法，令其成就；",
        "translation": "If there are any sentient beings who do not break the male faculty, I teach them the Dharma by appearing to them in the form of a youthful boy and causing them to attain it.",
        "source": "T19n0945_006:0129a06_14"
    },
    {
        "source_sentence": "若有處女愛樂處身不求侵暴，我於彼前現童女身而為說法，令其成就；",
        "translation": "If there are any ladies who delight in bodily pleasures but do not seek sexual misconduct, I teach them the Dharma by changing myself into the form of a young woman before them to enable them to attain it.",
        "source": "T19n0945_006:0129a08_15"
    },
    {
        "source_sentence": "若有諸天樂出天倫，我現天身而為說法，令其成就；",
        "translation": "If there are any gods who delight in going forth from the heavenly realm, I manifest myself as a celestial being to teach them so that they will attain enlightenment.",
        "source": "T19n0945_006:0129a10_0"
    },
    {
        "source_sentence": "若有諸龍樂出龍倫，我現龍身而為說法，令其成就；",
        "translation": "If there are any nāgas who delight in leaving the company of nāgas, I manifest myself as a nāga and expound the Teaching to them, enabling them to do so.",
        "source": "T19n0945_006:0129a11_1"
    },
    {
        "source_sentence": "若有藥叉樂度本倫，我於彼前現藥叉身而為說法，令其成就；",
        "translation": "If there is a yakṣa who delights in liberating his fellow practitioners, I teach him the Dharma by expounding myself as a yakṣa and causing them to attain enlightenment.",
        "source": "T19n0945_006:0129a12_2"
    },
    {
        "source_sentence": "若乾闥婆樂脫其倫，我於彼前現乾闥婆身而為說法，令其成就；",
        "translation": "If there is a gandharva who delights in liberating others, I teach him the Dharma by appearing to him as a gandharva and enabling him to do so.",
        "source": "T19n0945_006:0129a13_3"
    },
    {
        "source_sentence": "若阿修羅樂脫其倫，我於彼前現阿修羅身而為說法，令其成就；",
        "translation": "If an asuras delight in liberation, I teach them the Dharma by appearing before them in the form of an asuras and enabling them to attain it.",
        "source": "T19n0945_006:0129a15_4"
    },
    {
        "source_sentence": "若緊陀羅樂脫其倫，我於彼前現緊陀羅身而為說法，令其成就；",
        "translation": "If there is a kinnara who delights in liberating others, I teach him the Dharma by appearing before him in the form of a kinnara and causing him to attain it.",
        "source": "T19n0945_006:0129a16_5"
    },
    {
        "source_sentence": "若摩呼羅伽樂脫其倫，我於彼前現摩呼羅伽身而為說法，令其成就；",
        "translation": "If the mahoraga is delighted to liberate others, I teach him the Dharma by appearing before him in the form of a mahoraga and enabling him to do so.",
        "source": "T19n0945_006:0129a18_6"
    },
    {
        "source_sentence": "若諸眾生樂人修人，我現人身而為說法，令其成就；",
        "translation": "If sentient beings delight in humans and cultivate humans, I manifest myself as a human being to teach them the Dharma, enabling them to attain enlightenment.",
        "source": "T19n0945_006:0129a19_7"
    },
    {
        "source_sentence": "若諸非人有形無形、有想無想，樂度其倫，我於彼前皆現其身而為說法，",
        "translation": "If any non-Buddhist is interested in liberating others who have form and formless forms, ideation and non-thought, I teach the Dharma by appearing to them.",
        "source": "T19n0945_006:0129a20_8"
    },
    {
        "source_sentence": "令其成就。",
        "translation": "It causes them to be accomplished.",
        "source": "T19n0945_006:0129a22_9"
    },
    {
        "source_sentence": "是名妙淨三十二應入國土身，皆以三昧聞薰聞修，無作妙力自在成就。",
        "translation": "These are called the thirty-two subtle and pure names that should be entered into the body of a land, which are all cultivated by hearing in samādhi and permeated by hearing, and accomplished with unconstructed marvelous powers",
        "source": "T19n0945_006:0129a22_10"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T19n0945_006:0129a25_0"
    },
    {
        "source_sentence": "我復以此聞薰聞修金剛三昧無作妙力，與諸十方三世六道一切眾生同悲仰故，",
        "translation": "Because of this mystical power of hearing, perfuming, listening, and cultivating the unconstructed diamond-like concentration, I share the same compassion and reverence as all sentient beings in the ten directions, past, present, and future",
        "source": "T19n0945_006:0129a25_1"
    },
    {
        "source_sentence": "令諸眾生於我身心，獲十四種無畏功德：一者由我不自觀音以觀觀者，",
        "translation": "They cause sentient beings to attain fourteen kinds of fearlessness in my body and mind:",
        "source": "T19n0945_006:0129a27_0"
    },
    {
        "source_sentence": "令彼十方苦惱眾生，觀其音聲即得解脫；",
        "translation": "Causing sentient beings in the ten directions to suffer, by listening to their voices they attain liberation.",
        "source": "T19n0945_006:0129a28_1"
    },
    {
        "source_sentence": "二者知見旋復，令諸眾生設入大火火不能燒；",
        "translation": "The second is the state of knowing and seeing that revolves, enabling sentient beings to enter a great furnace and not be burned by it.",
        "source": "T19n0945_006:0129a29_2"
    },
    {
        "source_sentence": "三者觀聽旋復，令諸眾生大水所漂水不能溺；",
        "translation": "The third is to observe and hear the evolving, causing sentient beings not to drown in the water where they are floating.",
        "source": "T19n0945_006:0129b01_3"
    },
    {
        "source_sentence": "四者斷滅妄想心無殺害，令諸眾生入諸鬼國鬼不能害；",
        "translation": "The fourth is to cut off deluded thoughts and minds without killing. They cause sentient beings to enter the realm of ghosts, so that ghosts won’t be able to harm them.",
        "source": "T19n0945_006:0129b02_4"
    },
    {
        "source_sentence": "五者薰聞成聞，六根銷復同於聲聽，能令眾生臨當被害刀段段壞，使其兵戈猶如割水，",
        "translation": "The fifth is that the permeation of hearing becomes hearing, and the disappearance of the six faculties is the same as sound. It can cause sentient beings who are about to be harmed by a sword to disintegrate into fragments",
        "source": "T19n0945_006:0129b04_0"
    },
    {
        "source_sentence": "亦如吹光性無搖動；",
        "translation": "It is also like the emission of light that never flinches.",
        "source": "T19n0945_006:0129b06_0"
    },
    {
        "source_sentence": "六者聞薰精明明遍法界，則諸幽暗性不能全，能令眾生，藥叉、羅剎、鳩槃茶鬼及毘舍遮、富單那等，",
        "translation": "The sixth is that when one hears the permeation of energy, it clearly pervades the realm of reality. Then the nature of darkness cannot be fulfilled. It can cause sentient beings: yakṣas, rāṣas, kumbh",
        "source": "T19n0945_006:0129b06_1"
    },
    {
        "source_sentence": "雖近其傍目不能視；",
        "translation": "Even though he was near them, his eyes were unable to see.",
        "source": "T19n0945_006:0129b08_2"
    },
    {
        "source_sentence": "七者音性圓銷，觀聽返入離諸塵妄，能令眾生禁繫枷鎖所不能著；",
        "translation": "The seventh is that the nature of sound is completely dispelled. By contemplating and hearing it, one returns to and enters without delusion in regard to objects. It can cause sentient beings to be unable to cling to them by fetters",
        "source": "T19n0945_006:0129b09_3"
    },
    {
        "source_sentence": "八者滅音圓聞遍生慈力，能令眾生經過嶮路賊不能劫；",
        "translation": "The eighth is the power of compassion produced from the pervasive hearing of the extinction of all sounds, able to cause sentient beings to pass through dangerous paths and not be robbed by thieves.",
        "source": "T19n0945_006:0129b10_4"
    },
    {
        "source_sentence": "九者薰聞離塵色所不劫，能令一切多婬眾生遠離貪欲；",
        "translation": "The ninth is the eon of perfuming and hearing, which is apart from form and dust. It can cause all coarse sentient beings to be far removed from craving.",
        "source": "T19n0945_006:0129b12_0"
    },
    {
        "source_sentence": "十者純音無塵，根境圓融無對所對，能令一切忿恨眾生離諸嗔恚；",
        "translation": "The tenth is pure sound without dust. It is the unity of faculties and objects, with no opponent or opponent. It can cause all angry sentient beings to be freed from anger.",
        "source": "T19n0945_006:0129b13_1"
    },
    {
        "source_sentence": "十一者銷塵旋明，法界身心猶如瑠璃朗徹無礙，能令一切昏鈍性障諸阿顛迦永離癡暗；",
        "translation": "The eleventh removes the dust and turns it into light. His body and mind in the cosmos of reality are like lapis lazuli, shining brightly and unobstructed. He can cause all the abhikṣus that are hinder",
        "source": "T19n0945_006:0129b14_2"
    },
    {
        "source_sentence": "十二者融形復聞，不動道場涉入世間，不壞世界能遍十方，供養微塵諸佛如來，",
        "translation": "(12) The enlightening being Universally Good is also heard again and again in unified forms; he enters the world without moving his footsteps at the site of enlightenment. He can reach all directions in unbroken worlds, offering support to",
        "source": "T19n0945_006:0129b16_3"
    },
    {
        "source_sentence": "各各佛邊為法王子，能令法界無子眾生，欲求男者誕生福德智慧之男；",
        "translation": "Each buddha is a prince of the Teaching, able to cause all sentient beings in the realm of reality who have no children to give birth to men of virtue and knowledge.",
        "source": "T19n0945_006:0129b18_4"
    },
    {
        "source_sentence": "十三者六根圓通，明照無二含十方界，立大圓鏡空如來藏，承順十方微塵如來，",
        "translation": "The thirteenth is the perfect penetration of the six faculties, which clearly illuminates the nondual containment of all worlds in the ten directions. It establishes a great storehouse of buddhas like mirror emptiness, following the example of",
        "source": "T19n0945_006:0129b20_5"
    },
    {
        "source_sentence": "祕密法門受領無失，能令法界無子眾生，欲求女者誕生端正福德柔順，",
        "translation": "The esoteric dharma-gate of enlightenment receives and apprehends without error, able to cause sentient beings in the realm of reality who have no children to give birth to those who wish for a woman.",
        "source": "T19n0945_006:0129b22_6"
    },
    {
        "source_sentence": "眾人愛敬有相之女；",
        "translation": "The people loved and respected the beautiful woman with marks.",
        "source": "T19n0945_006:0129b23_7"
    },
    {
        "source_sentence": "十四者此三千大千世界百億日月，現住世間諸法王子，有六十二恒河沙數修法垂範，",
        "translation": "14. In this universe consisting of a billion suns and moons, as many as the number of grains of sand in sixty-two Ganges Rivers, there will be princes of the Dharma who are present in the world.",
        "source": "T19n0945_006:0129b24_8"
    },
    {
        "source_sentence": "教化眾生隨順眾生，方便智慧各各不同，由我所得圓通本根發妙耳門，",
        "translation": "They teach sentient beings and follow sentient beings, each different in skillful means and wisdom. From the root faculty of perfect enlightenment attained by me they give rise to the wondrous door of hearing.",
        "source": "T19n0945_006:0129b26_9"
    },
    {
        "source_sentence": "然後身心微妙含容遍周法界，能令眾生持我名號，與彼共持六十二恒河沙諸法王子，",
        "translation": "Then the subtle containment of body and mind pervades the cosmos, able to cause sentient beings to retain my name. I will share with them the sixty-two sands of the Ganges River as princes of the Dharma.",
        "source": "T19n0945_006:0129b27_10"
    },
    {
        "source_sentence": "二人福德正等無異。",
        "translation": "The two people's merits are exactly the same, and there's no difference.",
        "source": "T19n0945_006:0129b29_11"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T19n0945_006:0129c01_12"
    },
    {
        "source_sentence": "我一號名與彼眾多名號無異，由我修習得真圓通。",
        "translation": "The names of my one name are no different from those of the many names, and it's because I cultivate them that I truly attain perfect penetration.",
        "source": "T19n0945_006:0129c01_13"
    },
    {
        "source_sentence": "是名十四施無畏力，福備眾生。",
        "translation": "These are called the fourteen powers of giving without fear, which endow sentient beings with merit.",
        "source": "T19n0945_006:0129c02_14"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T19n0945_006:0129c04_0"
    },
    {
        "source_sentence": "我又獲是圓通修證無上道故，又能善獲四不思議無作妙德：一者由我初獲妙妙聞心心精遺聞，",
        "translation": "Because I have attained this perfect penetration, cultivating and realizing the unsurpassed path, I am also able to skillfully attain four inconceivable and wonderful qualities.",
        "source": "T19n0945_006:0129c04_1"
    },
    {
        "source_sentence": "見聞覺知不能分隔，成一圓融清淨寶覺，故我能現眾多妙容，能說無邊祕密神呪，",
        "translation": "Because seeing, hearing, apprehending, and knowing can’t be separated, they form the enlightenment of perfect interpenetrating pure jewels; therefore, I can manifest many beautiful forms and teach boundless mysterious spells.",
        "source": "T19n0945_006:0129c06_2"
    },
    {
        "source_sentence": "其中或現一首三首五首七首九首十一首，如是乃至一百八首，千首萬首八萬四千爍迦囉首；",
        "translation": "Among them, some present a verse with three chapters, five chapters, seven chapters, nine chapters, and eleven chapters; in this way up to one hundred and eight chapters.",
        "source": "T19n0945_006:0129c08_3"
    },
    {
        "source_sentence": "二臂四臂六臂八臂十臂十二臂，十四十六十八二十至二十四，如是乃至一百八臂千臂萬臂，",
        "translation": "Two-armed, four-armed, six-armed, eight-armed, ten-armed, twelve-armed, fourteen, sixteen, eighteen, twenty-four, and so on up to one hundred and eight-armed,",
        "source": "T19n0945_006:0129c10_4"
    },
    {
        "source_sentence": "八萬四千母陀羅臂；",
        "translation": "“Great enlightening beings have eighty-four thousand kinds of celestial arms:",
        "source": "T19n0945_006:0129c12_5"
    },
    {
        "source_sentence": "二目三目四目九目，如是乃至一百八目千目萬目，八萬四千清淨寶目，",
        "translation": "They have two eyes, three eyes, four eyes, and nine eyes; thus they have one hundred and eight eyes, a thousand eyes, ten thousand eyes, and eighty-four thousand pure precious eyes.",
        "source": "T19n0945_006:0129c13_6"
    },
    {
        "source_sentence": "或慈或威或定或慧，救護眾生得大自在。",
        "translation": "Whether kindness, authority, concentration, or wisdom, they rescue sentient beings and attain great freedom.",
        "source": "T19n0945_006:0129c14_7"
    },
    {
        "source_sentence": "二者由我聞思脫出六塵，如聲度垣不能為礙，故我妙能現一一形，誦一一呪，",
        "translation": "The second is that by reason of my hearing and reflecting I am liberated from the six kinds of objects, just as sound crosses over an enclosure without obstruction. For this reason I can subtly manifest each form and recite each dhāraṇ",
        "source": "T19n0945_006:0129c15_8"
    },
    {
        "source_sentence": "其形其呪能以無畏施諸眾生，是故十方微塵國土皆名我為施無畏者。",
        "translation": "Because their form and spell can be given to sentient beings with fearlessness, the dusty lands in the ten directions are all called self because I'm the one who bestows fearlessness.",
        "source": "T19n0945_006:0129c17_9"
    },
    {
        "source_sentence": "三者由我修習本妙圓通清淨本根，所遊世界皆令眾生捨身珍寶求我哀愍。",
        "translation": "Third, it's because I cultivate my originally marvelous, perfect, and pure fundamental faculty, so that all the worlds I travel will cause sentient beings to abandon their physical treasures and seek pity from me.",
        "source": "T19n0945_006:0129c19_10"
    },
    {
        "source_sentence": "四者我得佛心證於究竟，能以珍寶種種供養十方如來，傍及法界六道眾生，",
        "translation": "“Furthermore, having attained buddha-confidence and realized the ultimate state of mind, I can offer various offerings of jewels to the Buddhas of the ten directions, as well as to sentient beings in the six realms",
        "source": "T19n0945_006:0129c20_11"
    },
    {
        "source_sentence": "求妻得妻、求子得子、求三昧得三昧、求長壽得長壽，如是乃至求大涅槃得大涅槃。",
        "translation": "Seeking a wife to obtain a wife, seeking a child to obtain a child, seeking samādhi to obtain samādhi, and seeking long life to obtain long life are likewise until they seek great nirvāṇa and attain great nirvāṇa.",
        "source": "T19n0945_006:0129c22_12"
    },
    {
        "source_sentence": "佛問圓通，我從耳門圓照三昧，緣心自在因入流相，得三摩提成就菩提斯為第一！",
        "translation": "The Buddha asks about the perfection of penetration, and I follow the perfect illuminating samādhi of the ear gate, which is the first to attain enlightenment based on the mind's unimpeded causal entry into the flowing characteristics",
        "source": "T19n0945_006:0129c24_13"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T19n0945_006:0129c26_14"
    },
    {
        "source_sentence": "彼佛如來歎我善得圓通法門，於大會中授記我為觀世音號，由我觀聽十方圓明，",
        "translation": "That buddha-tathāgata praised me for my well-obtainment of the teaching of perfect penetration, and in the great assembly he predicted to me that I would be the name of Avalokiteśvara. Because of my contemplation and hearing",
        "source": "T19n0945_006:0129c26_15"
    },
    {
        "source_sentence": "故觀音名遍十方界。」",
        "translation": "That's why Avalokitêśvara is called pervading the ten directional realms.",
        "source": "T19n0945_006:0129c28_16"
    },
    {
        "source_sentence": "爾時，世尊於師子座，從其五體同放寶光，遠灌十方微塵如來及法王子諸菩薩頂；",
        "translation": "At that time the World-honored One was seated on a lion’s throne, emanating from each of his five bodies a ray of jewel light which poured far and wide over the tops of the enlightening beings’ heads",
        "source": "T19n0945_006:0129c29_0"
    },
    {
        "source_sentence": "彼諸如來亦於五體同放寶光，從微塵方來灌佛頂，并灌會中諸大菩薩及阿羅漢，",
        "translation": "The buddhas also emanated jeweled light from their five bodies, pouring down water on the Buddha’s head from the tiny distance between them. All the great bodhisattvas and arhats who had gathered in the assembly were also",
        "source": "T19n0945_006:0130a01_1"
    },
    {
        "source_sentence": "林木池沼皆演法音，交光相羅如寶絲網，是諸大眾得未曾有，一切普獲金剛三昧。",
        "translation": "The forests, trees, ponds, and lakes all played the sound of the Dharma, interspersed with light like a jeweled silk mesh; this was the unprecedented way in which the masses attained adamantine concentration",
        "source": "T19n0945_006:0130a03_2"
    },
    {
        "source_sentence": "即時，天雨百寶蓮華，青黃赤白間錯紛糅，十方虛空成七寶色，此娑婆界大地山河俱時不現，",
        "translation": "Immediately, it rained a hundred jeweled lotus flowers of blue, yellow, red, and white in the sky in the ten directions, all mixing together to form the color of the seven jewels. The great mountains and rivers of this",
        "source": "T19n0945_006:0130a05_3"
    },
    {
        "source_sentence": "唯見十方微塵國土合成一界，梵唄詠歌自然數奏。",
        "translation": "Only the dusty lands of the ten directions are seen to form a single realm, and Brahma chants and sings spontaneously.",
        "source": "T19n0945_006:0130a07_4"
    },
    {
        "source_sentence": "於是如來告文殊師利法王子：「汝今觀此二十五無學諸大菩薩及阿羅漢，",
        "translation": "The Tathāgata then said to the crown prince Mañjuśrī, “Look over these twenty-five great bodhisattvas and arhats who are beyond training.",
        "source": "T19n0945_006:0130a08_5"
    },
    {
        "source_sentence": "各說最初成道方便，皆言修習真實圓通，彼等修行實無優劣、前後差別；",
        "translation": "Each explains the means of first attainment of enlightenment, all saying that they cultivate true and perfect supernormal knowledge. In reality these practitioners have no superiority or inferiority, there is no distinction before or after.",
        "source": "T19n0945_006:0130a10_6"
    },
    {
        "source_sentence": "我今欲令阿難開悟，二十五行誰當其根？",
        "translation": "Now, I want to cause Ānanda to awaken, but who will have the twenty-five practices as his faculties?",
        "source": "T19n0945_006:0130a12_7"
    },
    {
        "source_sentence": "兼我滅後，此界眾生入菩薩乘求無上道，何方便門得易成就？」",
        "translation": "After the cessation of self, what method will it be easy for sentient beings in this world to enter the bodhisattva vehicle and seek the unsurpassed path?",
        "source": "T19n0945_006:0130a13_8"
    },
    {
        "source_sentence": "「覺海性澄圓，　　圓澄覺元妙；",
        "translation": "“The ocean of enlightenment is inherently pure and perfect, Enlightenment being the essence of enlightenment.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　元明照生所，　　所立照性亡。",
        "translation": "It's originally explained that the illumination gives rise to what's established, but the illuminating nature that's established disappears.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　迷妄有虛空，　　依空立世界，",
        "translation": "They are deluded that space exists, Based on emptiness they establish worlds.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　想澄成國土，　　知覺乃眾生。",
        "translation": "Thoughts clarify the land, and knowledge and awakening are sentient beings.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　空生大覺中，　　如海一漚發，",
        "translation": "In the great awakening that arises from emptiness, It’s like a drop in the ocean.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　有漏微塵國，　　皆從空所生；",
        "translation": "The worlds of the tiny particles of contamination All arise from space.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　漚滅空本無，　　況復諸三有？",
        "translation": "The cessation of debilitating emptiness is originally nonexistent, so why wouldn't the three existences be?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　歸元性無二，　　方便有多門。",
        "translation": "The original nature of refuge is nondual, and there are many approaches to skillful means.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　聖性無不通，　　順逆皆方便；",
        "translation": "Their noble nature is not unfathomable, And their ways of going along with it are all skillful.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　初心入三昧，　　遲速不同倫。",
        "translation": "The first mind enters samādhi, but its speed is different from that of the others.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　色想結成塵，　　精了不能徹；",
        "translation": "Form and ideation are bound up as atoms, But cannot be penetrated by intellect.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　如何不明徹，　　於是獲圓通？",
        "translation": "How is it that they don't know how to penetrate, and then they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　音聲雜語言，　　但伊名句味；",
        "translation": "The sounds are mixed with words, Yet they have names and phrases for their taste.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　一非含一切，　　云何獲圓通？",
        "translation": "If one doesn't contain all, how can they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　香以合中知，　　離則元無有；",
        "translation": "Fragrance can be discerned by combining [it with smell], Yet apart from it there is no fragrance at all.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　不恒其所覺，　　云何獲圓通？",
        "translation": "If they don't always perceive it, how can they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　味性非本然，　　要以味時有；",
        "translation": "The nature of taste is not inherent, but exists only at the time of taste.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　其覺不恒一，　　云何獲圓通？",
        "translation": "If their perception isn't always one, how can they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　觸以所觸明，　　無所不明觸；",
        "translation": "tangible is the light of that which is touched, There is nothing unknown to be touched.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　合離性非定，　　云何獲圓通？",
        "translation": "If the nature of union and separation isn't determined, how can they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　法稱為內塵，　　憑塵必有所，",
        "translation": "The dharmas are said to be internal dust, but there must be something that exists depending on the dust.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　能所非遍涉，　　云何獲圓通？",
        "translation": "What's pervasive and what's not pervasive, so how can they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　見性雖洞然，　　明前不明後；",
        "translation": "Although the nature of views is enlightening, They clarify what comes before and not what comes after.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　四維虧一半，　　云何獲圓通？",
        "translation": "If the four intermediate directions are missing by half, how can they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　鼻息出入通，　　現前無交氣；",
        "translation": "The nose’s breathing, coming out and going in, flows through; There is no exchange of breath in the present.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　支離匪涉入，　　云何獲圓通？",
        "translation": "How can they attain perfect penetration if they're free of non- involvement and enter without involvement?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　舌非入無端，　　因味生覺了；",
        "translation": "The tongue does not enter without a beginning, Yet gives rise to perception and apprehension through taste.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　味亡了無有，　　云何獲圓通？",
        "translation": "When taste disappears, there's no existence, so how can we attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　身與所觸同，　　各非圓覺觀；",
        "translation": "The body and that which is touched are the same, Each not perfect enlightenment or contemplation.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　涯量不冥會，　　云何獲圓通？",
        "translation": "How can they attain perfect enlightenment if their boundlessness isn't obscured by the assembly?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　知根雜亂思，　　湛了終無見；",
        "translation": "Knowing the faculties are mixed and confused, One comprehends without seeing at all.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　想念不可脫，　　云何獲圓通？",
        "translation": "Thoughts and thoughts can't be liberated, so how can they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　識見雜三和，　　詰本稱非相；",
        "translation": "Consciousness and views are mixed into three harmonies, which are originally called non-characteristic.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　自體先無定，　　云何獲圓通？",
        "translation": "Since the intrinsic essence is not always fixed, how can one attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　心聞洞十方，　　生于大因力；",
        "translation": "The mind hears and penetrates the ten directions, Producing great causal power.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　初心不能入，　　云何獲圓通？",
        "translation": "If the first mind can't enter, how will it attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　鼻想本權機，　　秖令攝心住；",
        "translation": "The ideation of the nose is fundamentally expedient, Causing the mind to be collected and sustained.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　住成心所住，　　云何獲圓通？",
        "translation": "How can they attain perfect penetration if they abide in the abode of what's settled in the mind?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　說法弄音文，　　開悟先成者；",
        "translation": "He expounds the Teaching, plays words and syllables, Enlightening those who are first to attain enlightenment.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　名句非無漏，　　云何獲圓通？",
        "translation": "If names and phrases aren't uncontaminated, how can they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　持犯但束身，　　非身無所束；",
        "translation": "The offender is only bound to the body, not to anything other than the body.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　元非遍一切，　　云何獲圓通？",
        "translation": "If it doesn't originally pervade all, how can it attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　神通本宿因，　　何關法分別；",
        "translation": "What is the difference between the teaching and the doctrine in regard to the original causes of supernormal powers?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　念緣非離物，　　云何獲圓通？",
        "translation": "Mindfulness and its conditions aren't separate from things, so how can they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　若以地性觀，　　堅礙非通達；",
        "translation": "If one observes it by means of the earth-nature, It will be hard and obstructed but not penetrated.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　有為非聖性，　　云何獲圓通？",
        "translation": "Conditioned dharmas that are not sacred, how can they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　若以水性觀，　　想念非真實；",
        "translation": "If one observes it by means of the water element, Thoughts and thoughts are not real.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　如如非覺觀，　　云何獲圓通？",
        "translation": "If it's not perception and contemplation, how can they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　若以火性觀，　　厭有非真離；",
        "translation": "If one observes it by means of the nature of fire, One will be disgusted with existence and not truly detached.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　非初心方便，　　云何獲圓通？",
        "translation": "If it's not the method of the first mind, how can we attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　若以風性觀，　　動寂非無對；",
        "translation": "If one observes the wind by means of its nature, movement and quiescence are not without resistance.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　對非無上覺，　　云何獲圓通？",
        "translation": "How can he attain perfect penetration if he doesn't have unsurpassed awakening?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　若以空性觀，　　昏鈍先非覺；",
        "translation": "If one observes it by means of the nature of emptiness, One will be dull and not initially awake.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　無覺異菩提，　　云何獲圓通？",
        "translation": "If there's no awakening different from enlightenment, how can we attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　若以識性觀，　　觀識非常住；",
        "translation": "If one observes it by means of the nature of consciousness, He observes that consciousness does not abide.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　存心乃虛妄，　　云何獲圓通？",
        "translation": "To preserve the mind is false, so how can you attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　諸行是無常，　　念性元生滅；",
        "translation": "Conditioned things are impermanent, Originally arising and perishing by the nature of mindfulness.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　因果今殊感，　　云何獲圓通？",
        "translation": "Now that the cause and effect are different, how can they attain perfect penetration?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　我今白世尊：　　佛出娑婆界，",
        "translation": "I now say to the World-honored One: The Buddha came forth from the sahā world.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　此方真教體，　　清淨在音聞；",
        "translation": "The essence of the true doctrine of this land Is pure in hearing and hearing.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　欲取三摩提，　　實以聞中入。",
        "translation": "Those who want to grasp samādhi really enter it by hearing.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　離苦得解脫，　　良哉觀世音，",
        "translation": "Being free of suffering and attaining liberation, Excellent, O Avalokiteśvara!",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　於恒沙劫中，　　入微塵佛國，",
        "translation": "In an eon as numerous as the grains of sand in the Ganges River As atoms in buddha-lands:",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　得大自在力，　　無畏施眾生。",
        "translation": "Attaining great sovereignty, he bestows fearlessness on sentient beings.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　妙音觀世音，　　梵音海潮音，",
        "translation": "His wondrous voice is like that of the Avalokiteśvara Bodhisattva, The pure voice like Brahma’s ocean-high tide.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　救世悉安寧，　　出世獲常住。",
        "translation": "He saves the world and is completely at peace, transcends the world, and attains permanence.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　我今啟如來，　　如觀音所說，",
        "translation": "I now enlighten the Tathāgata, just as Avalokitêśvara teaches.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　譬如人靜居，　　十方俱擊皷，",
        "translation": "It’s like a man living in seclusion Whose ten directions are all stricken with anger.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　十處一時聞，　　此則圓真實。",
        "translation": "The ten places are heard at once, and this is the perfect reality.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　目非觀障外，　　口鼻亦復然，",
        "translation": "The eyes don’t contemplate outside the hindrances, So are the mouth and nose.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　身以合方知，　　心念紛無緒；",
        "translation": "The body is known only through conjunction, Thoughts and thoughts are not mixed.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　隔垣聽音響，　　遐邇俱可聞，",
        "translation": "The sound is heard far away from the walls, And far distant sounds can be heard even at a distance.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　五根所不齊，　　是則通真實。",
        "translation": "If the five faculties aren't aligned, then they're shared with reality.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　音聲性動靜，　　聞中為有無，",
        "translation": "Sound and sound are by their nature agitation and stillness, Whether they exist or not in the midst of hearing.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　無聲號無聞，　　非實聞無性；",
        "translation": "The absence of sounds and calls, the absence of hearing, And not really hearing has no essence.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　聲無既無滅，　　聲有亦非生，",
        "translation": "The absence of sound is not cessation, And the existence of sound is neither arising nor nonarising.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　生滅二圓離，　　是則常真實。",
        "translation": "When the two aspects of arising and ceasing are perfectly distinct, this is permanence and reality.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　縱令在夢想，　　不為不思無，",
        "translation": "Even if they are in a dream, They don’t do anything and don’t think nothing.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　覺觀出思惟，　　身心不能及。",
        "translation": "Their perception and contemplation are beyond the ability of bodies and minds to comprehend.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　今此娑婆國，　　聲論得宣明，",
        "translation": "Now in this country of Sāva, the sound treatise has gained profound illumination.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　眾生迷本聞，　　循聲故流轉；",
        "translation": "Sentient beings, deluded by their original hearing, Revolve because of the sound they make.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　阿難縱強記，　　不免落邪思，",
        "translation": "Ānanda, even if he were to memorize it forcefully, He could not avoid falling into error.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　豈非隨所淪，　　旋流獲無妄。",
        "translation": "Isn't it the case that following what they fall into, they scroll and attain nothing false?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　阿難汝諦聽，　　我承佛威力，",
        "translation": "Ānanda, listen attentively. By the power of my Buddha-qualities I am able to show you these teachings:",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　宣說金剛王，　　如幻不思議，",
        "translation": "He teaches that the adamantine king is like an illusion, inconceivable.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　佛母真三昧。　　汝聞微塵佛，",
        "translation": "The mother of buddhas is the true concentration.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　一切祕密門，　　欲漏不先除，",
        "translation": "All the esoteric approaches are not previously removed from the contaminants of desire.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　畜聞成過誤。　　將聞持佛佛，",
        "translation": "The animals hear that they have committed errors and will soon hear the Buddha who preserves them.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　何不自聞聞？　　聞非自然生，",
        "translation": "Why don’t you hear it for yourself?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　因聲有名字；　　旋聞與聲脫，",
        "translation": "Because of the sound, there is a name:",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　能脫欲誰名？　　一根既返源，",
        "translation": "Who is the name of the one who can get rid of desire?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　六根成解脫。　　見聞如幻翳，",
        "translation": "The seeing and hearing are like illusions, the six organs being liberated.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　三界若空花，　　聞復翳根除，",
        "translation": "If the three realms are like flowers of emptiness, then hearing will remove the root of anger.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　塵銷覺圓淨。　　淨極光通達，",
        "translation": "The enlightenment of the extinction of all objects is perfect purity, pure and extremely luminous.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　寂照含虛空；　　却來觀世間，",
        "translation": "Silent illumination contains space, yet it comes to observe the world.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　猶如夢中事，　　摩登伽在夢，",
        "translation": "It's like a thing in a dream, where Mātaṅga is in a dream.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　誰能留汝形？　　如世巧幻師，",
        "translation": "Who will be able to preserve your form?",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　幻作諸男女，　　雖見諸根動，",
        "translation": "Men and women who create illusions, even though they see their faculties moving,",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　要以一機抽；　　息機歸寂然，",
        "translation": "They must be pulled by one opportunity, and when the opportunity is exhausted they return to quiescence.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　諸幻成無性。　　六根亦如是，",
        "translation": "The same applies to the six faculties:",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　元依一精明，　　分成六和合；",
        "translation": "They are originally based on one illumination, Which is divided into six:",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　一處成休復，　　六用皆不成。",
        "translation": "In one place, it's formed and resting, but the six functions are not formed.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　塵垢應念銷，　　成圓明淨妙，",
        "translation": "Dust and dirt should be eliminated in each thought, to perfect clarity, purity, and wonder.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　餘塵尚諸學，　　明極即如來。",
        "translation": "The rest of the world is still learning, but it's clear that the ultimate is the Tathāgata.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　大眾及阿難，　　旋汝倒聞機，",
        "translation": "The great assembly and Ānanda, revolve around your perverted capacity for hearing.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　反聞聞自性，　　性成無上道，",
        "translation": "The self-nature of hearing and hearing instead is the highest path by its own nature.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　圓通實如是。　　此是微塵佛，",
        "translation": "Such is the reality of the interpenetration of perfect penetration.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　一路涅槃門，　　過去諸如來，",
        "translation": "All the way to the gate of nirvana, past buddhas.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　斯門已成就；　　現在諸菩薩，",
        "translation": "Having accomplished this practice, the enlightening beings of the present abide in it.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　今各入圓明，　　未來修學人，",
        "translation": "Each of them now enters into perfect clarity, and those who will cultivate it in the future",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　當依如是法。　　我亦從中證，",
        "translation": "You should rely on such a doctrine.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　非唯觀世音。　　誠如佛世尊，",
        "translation": "It is not just Avalokiteśvara; it is truly like the Buddha, the World-honored One.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　詢我諸方便，　　以救諸末劫，",
        "translation": "He inquired about my methods of salvation for the ages to come.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　求出世間人，　　成就涅槃心，",
        "translation": "Those who seek to leave the world Have perfected the mind of nirvana.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　觀世音為最。　　自餘諸方便，",
        "translation": "The best is the Avalokiteśvara Bodhisattva.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　皆是佛威神，　　即事捨塵勞，",
        "translation": "They are all the buddhas’ authoritative powers. That is to say, they abandon worldly worries and troubles.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　非是長修學，　　淺深同說法。",
        "translation": "It's not that they cultivate it for a long time, teaching the same Dharma as the shallow and profound.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　頂禮如來藏，　　無漏不思議；",
        "translation": "I bow my head to the treasury of the enlightened, Uncontaminated and inconceivable.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　願加被未來，　　於此門無惑，",
        "translation": "Wishing to be blessed in the future, there’s no confusion in this aspect.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　方便易成就；　　堪以教阿難，",
        "translation": "It is easy to accomplish through skillful means; one can teach Ānanda,",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　及末劫沈淪，　　但以此根修，",
        "translation": "And in the last kalpa they will sink. They cultivate it only through this faculty:",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "　圓通超餘者，　　真實心如是。」",
        "translation": "The perfect penetration transcends the others, and so is the true mind.",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "文殊師利法王子奉佛慈旨，即從座起頂禮佛足，承佛威神說偈對佛：於是阿難及諸大眾，",
        "translation": "The Dharma prince Mañjuśrī, in accordance with the Buddha’s compassionate decree, stood up from his seat and bowed at the Buddha’s feet. Influenced by the Buddha’s spiritual power, he spoke these verses to",
        "source": "T19n0945_006:0130a14_9"
    },
    {
        "source_sentence": "身心了然得大開示，觀佛菩提及大涅槃，猶如有人因事遠遊未得歸還，",
        "translation": "Their bodies and minds are clearly enlightened, they attain great instruction, contemplate the Buddha’s enlightenment, and realize great nirvana. It is just as when a person travels from place to place on account of some business",
        "source": "T19n0945_006:0131b23_10"
    },
    {
        "source_sentence": "明了其家所歸道路。",
        "translation": "They clearly understand the path to which their home is returning.",
        "source": "T19n0945_006:0131b25_11"
    },
    {
        "source_sentence": "普會大眾天龍八部有學二乘，及諸一切新發心菩薩，其數凡有十恒河沙，",
        "translation": "They assembled the great assembly of celestial beings, dragons, the eight groups of learned disciples of the two vehicles, and all the newly awakened enlightening beings, numbering as many as the number of grains of",
        "source": "T19n0945_006:0131b25_12"
    },
    {
        "source_sentence": "皆得本心，遠塵離垢獲法眼淨；",
        "translation": "They all attain their original minds, become far removed from the dust and dirt of defilement, and attain purity of the eye of truth.",
        "source": "T19n0945_006:0131b27_13"
    },
    {
        "source_sentence": "性比丘尼聞說偈已成阿羅漢；",
        "translation": "The bhikṣuṇīs by nature, having heard the discourse, became arhats.",
        "source": "T19n0945_006:0131b28_0"
    },
    {
        "source_sentence": "無量眾生皆發無等等阿耨多羅三藐三菩提心。",
        "translation": "Countless sentient beings all give rise to the mind of unsurpassed unsurpassed unsurpassed, correct, and complete enlightenment.",
        "source": "T19n0945_006:0131b28_1"
    },
    {
        "source_sentence": "阿難整衣服，望大眾中合掌頂禮，心迹圓明悲欣交集，欲益未來諸眾生故，",
        "translation": "Ānanda, dressed in proper clothes, greeted the assembly by joining his palms and bowing his forehead to the Buddha’s feet. The traces of his mind were perfectly clear, and he was filled with sadness and joy.",
        "source": "T19n0945_006:0131c01_0"
    },
    {
        "source_sentence": "稽首白佛：「大悲世尊！",
        "translation": "He bowed his head and said to the Buddha, Bhagavān!",
        "source": "T19n0945_006:0131c02_1"
    },
    {
        "source_sentence": "我今已悟成佛法門，是中修行得無疑惑，常聞如來說如是言：『自未得度先度人者，",
        "translation": "Having thus perfected my understanding of the buddha-dharma, I cultivate this practice and attain enlightenment without any doubt or perplexity.",
        "source": "T19n0945_006:0131c03_2"
    },
    {
        "source_sentence": "菩薩發心；",
        "translation": "Enlightening beings give rise to mind.",
        "source": "T19n0945_006:0131c05_3"
    },
    {
        "source_sentence": "自覺已圓能覺他者，如來應世。』",
        "translation": "Those who have perfected their own awakening and can awaken others, the Tathāgata responds to the world.'",
        "source": "T19n0945_006:0131c05_4"
    },
    {
        "source_sentence": "我雖未度，願度末劫一切眾生。",
        "translation": "Although I haven't yet liberated them, I want to save all sentient beings in the final eon.",
        "source": "T19n0945_006:0131c06_0"
    },
    {
        "source_sentence": "世尊！",
        "translation": "Bhagavān!",
        "source": "T19n0945_006:0131c06_1"
    },
    {
        "source_sentence": "此諸眾生去佛漸遠，邪師說法如恒河沙，欲攝其心入三摩地，云何令其安立道場遠諸魔事，",
        "translation": "These sentient beings are gradually far from the Buddha, and wrong teachers teach the Dharma like the sands of the Ganges River. Wishing to gather their minds into concentration, how can they be set up on the terrace of enlightenment in order",
        "source": "T19n0945_006:0131c06_2"
    },
    {
        "source_sentence": "於菩提心得無退屈？」",
        "translation": "Is there no retrogression in the mind that attains enlightenment?",
        "source": "T19n0945_006:0131c08_3"
    },
    {
        "source_sentence": "爾時，世尊於大眾中稱讚阿難：「善哉！",
        "translation": "At that point, the Bhagavān praised Ānanda in the crowd, Good!",
        "source": "T19n0945_006:0131c10_0"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T19n0945_006:0131c10_1"
    },
    {
        "source_sentence": "如汝所問，安立道場救護眾生末劫沈溺，汝今諦聽，當為汝說！」",
        "translation": "As you ask, establish a site of enlightenment to save sentient beings from drowning in the latter eon, listen closely and explain it for you!",
        "source": "T19n0945_006:0131c10_2"
    },
    {
        "source_sentence": "阿難大眾唯然奉教。",
        "translation": "Ānanda, the great assembly of monks simply accepted the teaching.",
        "source": "T19n0945_006:0131c12_3"
    },
    {
        "source_sentence": "佛告阿難：「汝常聞我毘奈耶中，宣說修行三決定義，所謂攝心為戒，",
        "translation": "The Buddha said to Ānanda: You should always hear from me, in my Vinaya, the exhortation on the practice of the three kinds of certainty, namely, that one’s mind is disciplined as a bhikṣu.",
        "source": "T19n0945_006:0131c13_0"
    },
    {
        "source_sentence": "因戒生定，因定發慧。",
        "translation": "Concentration arises from precepts, and wisdom arises from concentration.",
        "source": "T19n0945_006:0131c14_1"
    },
    {
        "source_sentence": "是則名為三無漏學。",
        "translation": "These are called the three uncontaminated trainings.",
        "source": "T19n0945_006:0131c15_0"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_006:0131c15_1"
    },
    {
        "source_sentence": "云何攝心我名為戒？",
        "translation": "How is the self that collects mind called precepts?",
        "source": "T19n0945_006:0131c15_2"
    },
    {
        "source_sentence": "若諸世界六道眾生其心不婬，則不隨其生死相續。",
        "translation": "If the minds of sentient beings in the six destinies of worlds aren't angry, then they won't follow birth-and-death as it continues.",
        "source": "T19n0945_006:0131c16_3"
    },
    {
        "source_sentence": "汝修三昧本出塵勞，婬心不除塵不可出，縱有多智禪定現前，如不斷婬必落魔道，",
        "translation": "You cultivate samādhi that originally removes the defilements, but your anger doesn't remove the defilements and you can't get rid of them. Even if there were many wise meditations to show up, it would be like not stop",
        "source": "T19n0945_006:0131c17_4"
    },
    {
        "source_sentence": "上品魔王、中品魔民、下品魔女，彼等諸魔亦有徒眾，各各自謂成無上道。",
        "translation": "The upper-level demon king, the middle-level demon people, and the lower-level demon women also have disciples, each claiming to have accomplished the unsurpassed path.",
        "source": "T19n0945_006:0131c19_5"
    },
    {
        "source_sentence": "我滅度後末法之中，多此魔民熾盛世間，廣行貪婬為善知識，令諸眾生落愛見坑失菩提路。",
        "translation": "In the latter part of the teaching after my extinction, many of these Māras and people flourish in the world, widely practice greed and lust as good teachers, causing sentient beings to fall into the pit of desire and views and lose",
        "source": "T19n0945_006:0131c20_6"
    },
    {
        "source_sentence": "汝教世人，修三摩地先斷心婬，是名如來先佛世尊第一決定清淨明誨。",
        "translation": "You teach people in the world to cultivate samādhi and first cut off mental anguish, which is called the Tathāgata's first definitive, pure, clear teaching of the Bhagavān who preceded the Buddha.",
        "source": "T19n0945_006:0131c22_7"
    },
    {
        "source_sentence": "「是故阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T19n0945_006:0131c24_8"
    },
    {
        "source_sentence": "若不斷婬修禪定者，如蒸沙石欲其成飯，經百千劫秖名熱沙。",
        "translation": "If someone doesn't cultivate meditation without stopping, it's like steaming sand and stone that wants to make rice for a hundred thousand eons, which is called hot sand.",
        "source": "T19n0945_006:0131c24_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T19n0945_006:0131c26_10"
    },
    {
        "source_sentence": "此非飯本石沙成故。",
        "translation": "This isn't because the rice is originally made of rocks and sand.",
        "source": "T19n0945_006:0131c26_11"
    },
    {
        "source_sentence": "汝以婬身求佛妙果，縱得妙悟皆是婬根，根本成婬，輪轉三途必不能出，",
        "translation": "Even if you seek the marvelous fruit of buddhahood with a coarse body, even if you attain marvelous awakening, they are all coarse faculties that fundamentally become coarse, and will surely never be able to get out",
        "source": "T19n0945_006:0131c26_12"
    },
    {
        "source_sentence": "如來涅槃何路修證？",
        "translation": "What path does the Tathāgata's nirvāṇa cultivate?",
        "source": "T19n0945_006:0131c28_13"
    },
    {
        "source_sentence": "必使婬機身心俱斷，斷性亦無，於佛菩提斯可希冀。",
        "translation": "It must cause the debilitating tendencies to be stopped in both body and mind, and there's no nature of cessation, so we can hope for the Buddha's enlightenment.",
        "source": "T19n0945_006:0131c29_0"
    },
    {
        "source_sentence": "如我此說名為佛說；",
        "translation": "What I teach here is called the Buddha’s teaching.",
        "source": "T19n0945_006:0132a01_1"
    },
    {
        "source_sentence": "不如此說即波旬說。",
        "translation": "What's not explained like this is what Pāpīyān teaches.",
        "source": "T19n0945_006:0132a01_2"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_006:0132a03_0"
    },
    {
        "source_sentence": "又諸世界六道眾生其心不殺，則不隨其生死相續。",
        "translation": "Furthermore, the sentient beings of the six destinies in the worlds don't kill with their minds, and they don't follow birth-and-death as it continues.",
        "source": "T19n0945_006:0132a03_1"
    },
    {
        "source_sentence": "汝修三昧本出塵勞，殺心不除塵不可出，縱有多智禪定現前，如不斷殺必落神道，",
        "translation": "You cultivate samādhi that originally removes the defilements, but your mind of killing doesn't remove the defilements and can't get rid of them. Even if there are many wise meditators present, just as you won't stop",
        "source": "T19n0945_006:0132a04_2"
    },
    {
        "source_sentence": "上品之人為大力鬼，中品即為飛行夜叉諸鬼帥等，下品當為地行羅剎，",
        "translation": "Those of the higher classes are great ghosts, those of the middle class are flying yakṣa spirits and commanders of ghosts, and those of the lower class will be earth-following rāṣasas.",
        "source": "T19n0945_006:0132a06_3"
    },
    {
        "source_sentence": "彼諸鬼神亦有徒眾，各各自謂成無上道。",
        "translation": "Those ghosts and spirits also had disciples, each claiming to have accomplished the unsurpassed path.",
        "source": "T19n0945_006:0132a07_4"
    },
    {
        "source_sentence": "我滅度後末法之中，多此神鬼熾盛世間，自言食肉得菩提路。",
        "translation": "In the latter part of the teaching after my extinction, many of these spirits and ghosts flourish in the world, claiming to eat meat to attain the path of enlightenment.",
        "source": "T19n0945_006:0132a08_5"
    },
    {
        "source_sentence": "阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_006:0132a10_6"
    },
    {
        "source_sentence": "我令比丘食五淨肉，此肉皆我神力化生本無命根，汝婆羅門地多蒸濕，",
        "translation": "I ordered the bhikṣus to eat five kinds of pure meat. These flesh were all born through my supernatural powers and originally lacked the vital faculty.",
        "source": "T19n0945_006:0132a10_7"
    },
    {
        "source_sentence": "加以沙石草菜不生，我以大悲神力所加，因大慈悲假名為肉，汝得其味，",
        "translation": "Also, as sand, stones, grass, and vegetables won't grow, it's because of my great compassion that I've been blessed with the miraculous power of great compassion. With great compassion, I'll provisionally call it",
        "source": "T19n0945_006:0132a12_0"
    },
    {
        "source_sentence": "奈何如來滅度之後，食眾生肉名為釋子。",
        "translation": "After the nirvāṇa of the Tathāgata, he eats the flesh of sentient beings and is called a Śākyamuni.",
        "source": "T19n0945_006:0132a13_1"
    },
    {
        "source_sentence": "汝等當知，是食肉人縱得心開似三摩地，皆大羅剎，報終必沈生死苦海，",
        "translation": "You should know that even if a person who eats meat were to open their minds with concentration similar to samādhi, they'd all be great rāṣasasas, and would surely sink into the ocean of suffering of birth-and-de",
        "source": "T19n0945_006:0132a14_2"
    },
    {
        "source_sentence": "非佛弟子，如是之人相殺相吞相食未已，云何是人得出三界？",
        "translation": "If someone who isn't a disciple of the Buddha and thus kills, swallows, and eats each other before they finish eating, how can that person escape the three realms?",
        "source": "T19n0945_006:0132a16_3"
    },
    {
        "source_sentence": "汝教世人，修三摩地次斷殺生，是名如來先佛世尊第二決定清淨明誨。",
        "translation": "You teach people in the world to cultivate samādhi and then stop killing, which is called the second definitively pure and insightful instruction of the Tathāgata, the Bhagavān, the first buddha.",
        "source": "T19n0945_006:0132a17_4"
    },
    {
        "source_sentence": "「是故阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T19n0945_006:0132a19_5"
    },
    {
        "source_sentence": "若不斷殺修禪定者，譬如有人自塞其耳，高聲大叫求人不聞，此等名為欲隱彌露。",
        "translation": "If someone doesn't stop killing and cultivating meditation, it's like a person who plucks their ears and screams loudly without hearing because they want to hide them, which is called wanting to hide in secret.",
        "source": "T19n0945_006:0132a19_6"
    },
    {
        "source_sentence": "清淨比丘及諸菩薩，於岐路行不踏生草，況以手拔；",
        "translation": "The pure bhikṣus and bodhisattvas did not tread on the grass growing at crossroads, much less pull it out with their hands.",
        "source": "T19n0945_006:0132a21_7"
    },
    {
        "source_sentence": "云何大悲取諸眾生血肉充食？",
        "translation": "What is great compassion that takes the flesh and blood of sentient beings and feeds them?",
        "source": "T19n0945_006:0132a22_8"
    },
    {
        "source_sentence": "若諸比丘不服東方絲綿絹帛，及是此土靴履裘毳、乳酪醍醐，如是比丘於世真脫，",
        "translation": "If the monks don't wear cotton silk and silk fabrics from the eastern direction, or shoes, footwear, woolen blankets, milk, curds, and ghee from this land, such a monk is truly liberated in the world",
        "source": "T19n0945_006:0132a23_9"
    },
    {
        "source_sentence": "酬還宿債不遊三界。",
        "translation": "He paid back his past debts and didn't travel to the three realms.",
        "source": "T19n0945_006:0132a25_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T19n0945_006:0132a25_11"
    },
    {
        "source_sentence": "服其身分皆為彼緣，如人食其地中百穀，足不離地；",
        "translation": "It is like the case of a man who eats all the grains that are found in the soil and his feet do not leave the earth.",
        "source": "T19n0945_006:0132a25_12"
    },
    {
        "source_sentence": "必使身心於諸眾生，若身、身分，身心二途不服不食，我說是人真解脫者。",
        "translation": "It must be so that body and mind are neither eaten nor subdued by sentient beings, whether they're bodies, identities, or bodies in the two paths of body and mind, and I say this person is truly liberated.",
        "source": "T19n0945_006:0132a27_0"
    },
    {
        "source_sentence": "如我此說名為佛說；",
        "translation": "What I teach here is called the Buddha’s teaching.",
        "source": "T19n0945_006:0132a28_1"
    },
    {
        "source_sentence": "不如此說即波旬說。",
        "translation": "What's not explained like this is what Pāpīyān teaches.",
        "source": "T19n0945_006:0132a29_2"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_006:0132b01_0"
    },
    {
        "source_sentence": "又復世界六道眾生其心不偷，則不隨其生死相續。",
        "translation": "Furthermore, if the minds of sentient beings in the six destinies in the world don't steal, then they won't continue to follow birth and death.",
        "source": "T19n0945_006:0132b01_1"
    },
    {
        "source_sentence": "汝修三昧本出塵勞，偷心不除塵不可出，縱有多智禪定現前，如不斷偷必落邪道，",
        "translation": "You cultivate samādhi that originally removes the defilements, but your thieving mind doesn't remove the defilements and can't get rid of them. Even if you have many wise meditations in front of you, like stealing without",
        "source": "T19n0945_006:0132b02_2"
    },
    {
        "source_sentence": "上品精靈、中品妖魅、下品邪人諸魅所著，彼等群邪亦有徒眾，各各自謂成無上道。",
        "translation": "The higher-level spirits, middle-level demons, and lower-level errors are all addicted by the afflictions of humans, and there are also followers of those errors, each claiming to have achieved the unsurpassed path.",
        "source": "T19n0945_006:0132b04_3"
    },
    {
        "source_sentence": "我滅度後末法之中，多此妖邪熾盛世間，潛匿姦欺稱善知識，各自謂己得上人法，",
        "translation": "In the latter part of the Dharma, after my nirvana, many of these demons and wicked people will flourish in the world. They will hide themselves in adultery and deceive others to call themselves good friends, each claiming to have",
        "source": "T19n0945_006:0132b06_4"
    },
    {
        "source_sentence": "詃惑無識恐令失心，所過之處其家耗散。",
        "translation": "Fearing that they'll lose their minds, those who are confused and lacking consciousness will disperse from their homes wherever they go.",
        "source": "T19n0945_006:0132b07_5"
    },
    {
        "source_sentence": "我教比丘循方乞食，令其捨貪成菩薩道，諸比丘等不自熟食，寄於殘生旅泊三界，",
        "translation": "I teach the monks to follow their directions in begging for food, so that they abandon craving and attain the bodhisattva path. The monks don't cook their own food on their own but send it to the three realms of residue",
        "source": "T19n0945_006:0132b08_6"
    },
    {
        "source_sentence": "示一往還去已無返；",
        "translation": "They show one going, one returning, and having gone, they never return.",
        "source": "T19n0945_006:0132b10_7"
    },
    {
        "source_sentence": "云何賊人假我衣服，禆販如來造種種業，皆言佛法却非出家，具戒比丘為小乘道？",
        "translation": "How did the thief pretend to buy my clothes and sell them to the Tathāgata to create various activities, saying that the Buddha's teaching is not renunciation but that a monk who observes precepts is on the path of the lesser vehicle?",
        "source": "T19n0945_006:0132b11_8"
    },
    {
        "source_sentence": "由是疑誤無量眾生墮無間獄。",
        "translation": "Because of this doubt, measureless sentient beings will fall into the unremitting hell.",
        "source": "T19n0945_006:0132b13_9"
    },
    {
        "source_sentence": "若我滅後，其有比丘發心決定修三摩提，能於如來形像之前，身然一燈、燒一指節，",
        "translation": "If, after my nirvana, some bhikṣus decide to practice absorption with determination and are able to light a lamp or burn one knuckle of the body before an image of the Tathāgata.",
        "source": "T19n0945_006:0132b13_10"
    },
    {
        "source_sentence": "及於身上爇一香炷，我說是人無始宿債一時酬畢，長挹世間永脫諸漏，",
        "translation": "I say that this man has paid his past debts from beginningless time at one time, and he will continue to accumulate the world for a long time. He will be freed from all contaminants forever.",
        "source": "T19n0945_006:0132b15_11"
    },
    {
        "source_sentence": "雖未即明無上覺路，是人於法已決定心，若不為此捨身微因，縱成無為必還生人酬其宿債，",
        "translation": "Even though they don't immediately explain the path of unsurpassed awakening, this person has determined his mind with respect to the teaching. If he doesn't abandon the subtle causes of body for this reason, even if he becomes nonproductive, he",
        "source": "T19n0945_006:0132b17_12"
    },
    {
        "source_sentence": "如我馬麥正等無異。",
        "translation": "It's like my horse and wheat, which are exactly the same as mine.",
        "source": "T19n0945_006:0132b19_13"
    },
    {
        "source_sentence": "汝教世人，修三摩地後斷偷盜，是名如來先佛世尊第三決定清淨明誨。",
        "translation": "Teach the world to stop stealing after cultivating samādhi, which is called the third definitively pure and insightful teaching of the Tathāgata, the Bhagavān, who was previously buddha.",
        "source": "T19n0945_006:0132b20_0"
    },
    {
        "source_sentence": "「是故阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T19n0945_006:0132b21_1"
    },
    {
        "source_sentence": "若不斷偷修禪定者，譬如有人水灌漏巵欲求其滿，縱經塵劫終無平復。",
        "translation": "If someone doesn't stop stealing and cultivating meditation, it's like a person who wants to fill a pot of water that's drenched with water and wants to make it full, but there's no peace even after an eon of duration.",
        "source": "T19n0945_006:0132b21_2"
    },
    {
        "source_sentence": "若諸比丘衣鉢之餘分寸不畜，乞食餘分施餓眾生，於大集會合掌禮眾，",
        "translation": "If the monks don't store the remaining inches of their robes and bowls, beg for food and give the remaining parts to hungry sentient beings, then they bow with joined palms to the crowd at the great assembly.",
        "source": "T19n0945_006:0132b23_3"
    },
    {
        "source_sentence": "有人捶罵同於稱讚，必使身心二俱捐捨，身肉骨血與眾生共，不將如來不了義說迴為己解以誤初學，",
        "translation": "When someone is scolded and praised in the same way, they'll surely cause both body and mind to abandon it, and their bodies, flesh, bones, and blood will be shared with sentient beings. The Tathāgata won't",
        "source": "T19n0945_006:0132b25_4"
    },
    {
        "source_sentence": "佛印是人得真三昧。",
        "translation": "This is the person who attains true samādhi with the Buddha's seal.",
        "source": "T19n0945_006:0132b27_5"
    },
    {
        "source_sentence": "如我所說名為佛說；",
        "translation": "As I teach them, they are called buddha-teachings.",
        "source": "T19n0945_006:0132b28_0"
    },
    {
        "source_sentence": "不如此說即波旬說。",
        "translation": "What's not explained like this is what Pāpīyān teaches.",
        "source": "T19n0945_006:0132b28_1"
    },
    {
        "source_sentence": "「阿難！",
        "translation": "Ānanda!",
        "source": "T19n0945_006:0132b29_0"
    },
    {
        "source_sentence": "如是世界六道眾生，雖則身心無殺盜婬，三行已圓；",
        "translation": "Thus, even though the beings in these worlds of the six realms are free from killing and stealing in body and mind, their three practices have already been completed.",
        "source": "T19n0945_006:0132b29_1"
    },
    {
        "source_sentence": "若大妄語，即三摩提不得清淨，成愛見魔失如來種。",
        "translation": "If someone speaks great falsely, that's when the samādhi doesn't become pure and becomes a demon of craving and losing the Tathāgata seed.",
        "source": "T19n0945_006:0132c01_2"
    },
    {
        "source_sentence": "所謂未得謂得、未證言證，或求世間尊勝第一，謂前人言：『我今已得須陀洹果、斯陀含果、阿那含果，",
        "translation": "Those who have not attained what is called acquisition and those who have not attained what is called realization, or who seek the worldly preeminent foremost. That is to say, someone before them said, “I have now attained the fruit",
        "source": "T19n0945_006:0132c02_3"
    },
    {
        "source_sentence": "阿羅漢道、辟支佛乘、十地、地前諸位菩薩。』",
        "translation": "The arhat path, the pratyekabuddha vehicle, the ten stages, and the bodhisattvas before the ground.'",
        "source": "T19n0945_006:0132c04_4"
    },
    {
        "source_sentence": "求彼禮懺貪其供養，是一顛迦銷滅佛種，如人以刀斷多羅木，佛記是人永殞善根無復知見，",
        "translation": "Requesting them to pay homage and repentance and coveting their offerings is like a man cutting down a palm tree with a knife, just as the Buddha remembers that person will permanently die of good roots and no longer have knowledge or vision.",
        "source": "T19n0945_006:0132c05_5"
    },
    {
        "source_sentence": "沈三苦海不成三昧。",
        "translation": "They sink into the three oceans of suffering and don't become samādhi.",
        "source": "T19n0945_006:0132c07_6"
    },
    {
        "source_sentence": "我滅度後，勅諸菩薩及阿羅漢應身生彼末法之中，作種種形度諸輪轉，",
        "translation": "“After my parinirvāṇa, I ordered the bodhisattvas and arhats to be born in that final state of existence.",
        "source": "T19n0945_006:0132c08_7"
    },
    {
        "source_sentence": "或作沙門、白衣居士、人王、宰官、童男、童女，如是乃至婬女、寡婦、姦偷、屠販，",
        "translation": "Or they may become ascetics, white-robed householders, human kings, rulers, officials, boys, girls, or young girls, such as prostitutes, widows, adulterers, thieves, or butchers.",
        "source": "T19n0945_006:0132c09_8"
    },
    {
        "source_sentence": "與其同事稱歎佛乘，令其身心入三摩地，終不自言我真菩薩、真阿羅漢。",
        "translation": "He and his colleagues praised the Buddha's vehicle, causing their bodies and minds to enter samādhi without ever saying that they are truly bodhisattvas or arhats.",
        "source": "T19n0945_006:0132c11_9"
    },
    {
        "source_sentence": "泄佛密因、輕言未學，唯除命終陰有遺付，云何是人惑亂眾生成大妄語？",
        "translation": "If someone discloses the Buddha's esoteric cause and speaks lightly but hasn't studied it, except for the existence of the final aggregate at the end of life with a bequeathed gift, how could this person confuse",
        "source": "T19n0945_006:0132c13_10"
    },
    {
        "source_sentence": "汝教世人，修三摩地後復斷除諸大妄語，是名如來先佛世尊第四決定清淨明誨。",
        "translation": "You teach people in the world to cultivate samādhi and then further eliminate great false speech, which is called the fourth definitive, pure, clear teaching of the Tathāgata, the Bhagavān, who was previously the Buddha.",
        "source": "T19n0945_006:0132c14_11"
    },
    {
        "source_sentence": "「是故阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T19n0945_006:0132c16_12"
    },
    {
        "source_sentence": "若不斷其大妄語者，如刻人糞為栴檀形，欲求香氣無有是處。",
        "translation": "If someone doesn't stop their great false speech, they're like carving human excrement into the shape of sandalwood and there's no place to seek its fragrance.",
        "source": "T19n0945_006:0132c16_13"
    },
    {
        "source_sentence": "我教比丘直心道場，於四威儀一切行中尚無虛假，云何自稱得上人法？",
        "translation": "I teach the monks to straighten their minds at the site of enlightenment, and there's no falsehood in all the four ways they conduct themselves, so how can they claim to have attained the way of a superior person?",
        "source": "T19n0945_006:0132c18_14"
    },
    {
        "source_sentence": "譬如窮人妄號帝王自取誅滅，況復法王如何妄竊？",
        "translation": "It's like a poor man who falsely calls himself the emperor and takes it for himself to be killed, so why wouldn't the king of the Dharma falsely steal it?",
        "source": "T19n0945_006:0132c20_0"
    },
    {
        "source_sentence": "因地不直果招紆曲，求佛菩提如噬臍人，欲誰成就？",
        "translation": "The causal ground is not straight and the result is twisted, and seeking Buddha's enlightenment is like a man who devours his navel, so who wants it to be accomplished?",
        "source": "T19n0945_006:0132c21_1"
    },
    {
        "source_sentence": "若諸比丘心如直絃一切真實，入三摩提永無魔事，我印是人成就菩薩無上知覺。",
        "translation": "If monks whose minds are like straight strings and all true, who enter samādhi without ever having any demonic activity, I'll seal that person to accomplish the bodhisattva's unsurpassed awakening of knowing.",
        "source": "T19n0945_006:0132c22_2"
    },
    {
        "source_sentence": "如我是說名為佛說；",
        "translation": "As I teach it, they are called buddha-teachings.",
        "source": "T19n0945_006:0132c24_3"
    },
    {
        "source_sentence": "不如此說即波旬說。",
        "translation": "What's not explained like this is what Pāpīyān teaches.",
        "source": "T19n0945_006:0132c24_4"
    },
    {
        "source_sentence": "大佛頂萬行首楞嚴經卷第六",
        "translation": "Śūraṃgama-sūtra, the Sixth Fascicle of the Mahāprajñāpāramitā",
        "source": "T19n0945_006:0132c26_0"
    }
]