[
    {
        "source_sentence": "四分律卷第五十三(第四分之四)",
        "translation": "Sifen lü, vol. 53 (fourth and fourth parts)",
        "source": "T22n1428_053:0958c13_0"
    },
    {
        "source_sentence": "姚秦罽賓三藏佛陀耶舍",
        "translation": "Yaoqin's Kāśmī-samādhi of the Tripiṭaka Buddhayaśas",
        "source": "T22n1428_053:0958c15_0"
    },
    {
        "source_sentence": "共竺佛念等譯",
        "translation": "translated by Zhu Fone and others",
        "source": "T22n1428_053:0958c16_0"
    },
    {
        "source_sentence": "雜揵度之三",
        "translation": "three kinds of mixed salvation",
        "source": "T22n1428_053:0958c17_0"
    },
    {
        "source_sentence": "爾時慈地比丘來至毘舍離國，彼與諸離奢親友知識，諸大離奢聞慈地比丘來至毘舍離，即往問訊，慈地比丘而不應答。",
        "translation": "It was then that the monk Maitreya came to Vaiśālī, who was intimate with his friends and relatives in Liccha. The great Licchavis, having heard that the monk Maitreya had come to Vaiśālī, immediately went to him to greet him, but the monk Maitreya did not answer.",
        "source": "T22n1428_053:0958c18_0"
    },
    {
        "source_sentence": "彼言：「長老！",
        "translation": "They said, Elder!",
        "source": "T22n1428_053:0958c20_1"
    },
    {
        "source_sentence": "我何所犯？",
        "translation": "What offense did I commit?",
        "source": "T22n1428_053:0958c21_2"
    },
    {
        "source_sentence": "故相問訊而不見答。」",
        "translation": "That's why they exchanged greetings and didn't see an answer.",
        "source": "T22n1428_053:0958c21_3"
    },
    {
        "source_sentence": "彼即答言：「我何用共汝等語為？",
        "translation": "They replied, Why would I use words that are shared with you?",
        "source": "T22n1428_053:0958c21_4"
    },
    {
        "source_sentence": "沓婆摩羅子輕慢惱我，而汝等不見佐助。」",
        "translation": "The Tathāgata Māra's son despises me, but you don't see him as an assistant.",
        "source": "T22n1428_053:0958c22_5"
    },
    {
        "source_sentence": "彼即言：「我當作何方便令沓婆摩羅子不惱汝？」",
        "translation": "He then said, What method will I use to make sure that the Dharmarakṣa doesn't disturb you?",
        "source": "T22n1428_053:0958c23_6"
    },
    {
        "source_sentence": "答言：「若汝往伺佛及眾僧大集時，往彼作如是言：『大德！",
        "translation": "He replied, If you go there to visit the Buddha and the great assembly of the saṃgha, go there and say, 'O great virtuous one!'",
        "source": "T22n1428_053:0958c24_7"
    },
    {
        "source_sentence": "有如是事者不善、不隨順、非威儀、不得時，我等謂此處清淨安樂無有恐怖，而反生憂惱，猶水生火。",
        "translation": "If someone does something like this, they're unwholesome, not compliant, not dignified, and not acting at the right time, and we say that this place is pure and peaceful without fear, but instead give rise to grief and distress in return, just as water gives rise to fire.",
        "source": "T22n1428_053:0958c26_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1428_053:0958c28_1"
    },
    {
        "source_sentence": "沓婆摩羅子侵犯我婦，眾僧當和合與作滅擯。』",
        "translation": "'The Tathāgata Māra's son violated my wife, and the saṃgha will harmonize with him and make a cease argument.'",
        "source": "T22n1428_053:0958c28_2"
    },
    {
        "source_sentence": "如是則不來惱我。」",
        "translation": "Thus, they won't come to harm me.",
        "source": "T22n1428_053:0958c29_3"
    },
    {
        "source_sentence": "即答言：「此有何難？」",
        "translation": "He replied, What's the difficulty here?",
        "source": "T22n1428_053:0959a01_4"
    },
    {
        "source_sentence": "彼大離奢往佛大眾所，說如上言。",
        "translation": "That great Licchavi went to the Buddha's congregation and explained it as above.",
        "source": "T22n1428_053:0959a01_5"
    },
    {
        "source_sentence": "時沓婆摩羅子去佛不遠坐，時佛知而故問沓婆摩羅子：「汝聞彼離奢語不？」",
        "translation": "When Dharmarakṣa didn't sit far from the Buddha, the Buddha knew and therefore asked Dharmarakṣa, Have you heard those words of Licchavi?",
        "source": "T22n1428_053:0959a02_6"
    },
    {
        "source_sentence": "答言：「聞，唯佛知之。」",
        "translation": "He replied, I've heard it; only the Buddha knows it.",
        "source": "T22n1428_053:0959a04_7"
    },
    {
        "source_sentence": "佛語沓婆摩羅子：「汝不應作如是答。",
        "translation": "The Buddha said to Dharmarakṣa, You shouldn't answer like this.",
        "source": "T22n1428_053:0959a04_8"
    },
    {
        "source_sentence": "實當言實、虛當言虛。」",
        "translation": "What's real should be called real, and what's false should be called false.",
        "source": "T22n1428_053:0959a05_9"
    },
    {
        "source_sentence": "時沓婆摩羅子聞佛語已，從坐起，偏露右肩、右膝著地，合掌白佛言：「我從生已來，未曾夢中犯婬，而況覺也。」",
        "translation": "After hearing the Buddha's words, Dharmarakṣa got up from his seat, bared his right shoulder and knelt with his right knee on the ground, joined his palms together, and said to the Buddha, Since my birth, I've never committed sexual misconduct in a dream, so why wouldn't I?",
        "source": "T22n1428_053:0959a06_10"
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, Good!",
        "source": "T22n1428_053:0959a08_11"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T22n1428_053:0959a08_12"
    },
    {
        "source_sentence": "沓婆摩羅子，此是好答。」",
        "translation": "This is a good answer, Dharmarakṣa, this is a good answer.",
        "source": "T22n1428_053:0959a09_13"
    },
    {
        "source_sentence": "爾時世尊告諸比丘言：「汝等問彼大離奢：『莫以無根不淨法謗此沓婆摩羅子清淨比丘。",
        "translation": "It was then that the Bhagavān addressed the monks, asking them, 'Ask that great Licchavi, 'Don't denigrate this pure monk Dharmôttara with the impure dharmas of no faculties.",
        "source": "T22n1428_053:0959a09_14"
    },
    {
        "source_sentence": "以無根不淨法謗清淨比丘得大重罪。』」",
        "translation": "By denigrating a pure monk with the absence of faculties and impure dharmas, he commits a great serious offense.'",
        "source": "T22n1428_053:0959a11_15"
    },
    {
        "source_sentence": "時諸比丘聞世尊教，即與大離奢共相詰問：「汝可說實。",
        "translation": "The monks then heard the Bhagavān's teaching, and they were questioned together with Mahāliśas, You may explain the truth.",
        "source": "T22n1428_053:0959a12_16"
    },
    {
        "source_sentence": "此事云何？",
        "translation": "What is this matter?",
        "source": "T22n1428_053:0959a13_17"
    },
    {
        "source_sentence": "莫以無根不淨法謗沓婆摩羅子，以無根不淨法謗清淨比丘得大重罪。」",
        "translation": "Don't denigrate the Tathāgata Māra because of his lack of faculties and impure qualities, and denigrate the pure monk because of his lack of faculties and impure qualities will result in a great serious offense.",
        "source": "T22n1428_053:0959a14_18"
    },
    {
        "source_sentence": "時諸大離奢得諸比丘詰問已，便作是言：「沓婆摩羅子清淨，無有不淨行。",
        "translation": "After the great Licchavi monks had been questioned, they said, Dharmaraṣṭhila is pure, and there's no impure action.",
        "source": "T22n1428_053:0959a15_19"
    },
    {
        "source_sentence": "此是慈地比丘教我耳。」",
        "translation": "This is the monk Maitreya who teaches me.",
        "source": "T22n1428_053:0959a17_20"
    },
    {
        "source_sentence": "諸比丘聞，中有少欲知足、行頭陀、樂學戒、知慚愧者，譏嫌彼大離奢言：「沓婆摩羅子實無不淨行，云何以無根不淨謗耶？」",
        "translation": "When the monks heard this, some of them who had few desires and were satisfied, practiced as an ascetic, enjoyed studying precepts, and knew modesty criticized Mahāliśas and said, How can you denigrate him because he has no faculties that are impure?",
        "source": "T22n1428_053:0959a18_21"
    },
    {
        "source_sentence": "諸比丘往世尊所，頭面禮足以此因緣具白世尊。",
        "translation": "The monks went to the Bhagavān, bowed their heads and faces, and explained these reasons in detail to the Bhagavān.",
        "source": "T22n1428_053:0959a21_0"
    },
    {
        "source_sentence": "世尊爾時集比丘僧，以無數方便呵責大離奢言：「汝所為非，不隨順行、非清淨行。",
        "translation": "At the time, the Bhagavān gathered the monks and saṃgha and reprimanded Mahāli Śākyamuni with countless skillful means, saying, What you're doing is wrong, not compliant or pure practice.",
        "source": "T22n1428_053:0959a22_1"
    },
    {
        "source_sentence": "云何以無根不淨法謗沓婆摩羅子耶？」",
        "translation": "How do you denigrate the Dharma-darśana child because of his lack of faculties and impure qualities?",
        "source": "T22n1428_053:0959a24_2"
    },
    {
        "source_sentence": "以無數方便呵責已，告諸比丘：「自今已去，與大離奢作覆鉢、不與往反言語，作白二羯磨。",
        "translation": "After he had been rebuked with countless skillful means, he told the monks, From now on, he'll cover his bowl with Mahāliśas and not speak back and forth or face each other, and he'll perform the two white karmas.",
        "source": "T22n1428_053:0959a25_3"
    },
    {
        "source_sentence": "白衣家有五法，應與作覆鉢：不孝順父、不孝順母、不敬沙門、不敬婆羅門、不供事比丘。",
        "translation": "There are five things that white-robed people should do to cover their bowls: not obeying their father, not obeying their mother, not honoring ascetics, not honoring brāhmaṇas, and not serving monks.",
        "source": "T22n1428_053:0959a27_4"
    },
    {
        "source_sentence": "有如是五法，應與作覆鉢。",
        "translation": "If there are these five things, you should make a covered bowl with them.",
        "source": "T22n1428_053:0959a29_5"
    },
    {
        "source_sentence": "有五法不應與作覆鉢。",
        "translation": "There are five things that shouldn't be given to make a covered bowl.",
        "source": "T22n1428_053:0959b01_6"
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are these five?",
        "source": "T22n1428_053:0959b01_7"
    },
    {
        "source_sentence": "孝順父、孝順母、恭敬沙門、恭敬婆羅門、敬事比丘。",
        "translation": "They are filial to their fathers, filial to their mothers, respectful to śramaṇas, respectful to brāhmaṇas, and respectful to the bhikṣus.",
        "source": "T22n1428_053:0959b01_8"
    },
    {
        "source_sentence": "有如是五法，不應與作覆鉢。",
        "translation": "If there are these five things, you shouldn't make a covered bowl with them.",
        "source": "T22n1428_053:0959b03_9"
    },
    {
        "source_sentence": "復有十法眾僧應與作覆鉢：罵謗比丘、為比丘作損減作無利益、方便令無住處、鬪亂比丘、於比丘前說佛法僧惡、以無根不淨法謗比丘、若犯比丘尼，有如是十法者，僧應與作覆鉢。",
        "translation": "Again, there are ten things that the saṃgha should give to cover their bowls: reviling monks, doing harmful things for monks for monks, using skillful means to make them lack a place to live, arguing with monks, speaking in front of monks about the evil of the Buddha and Dharma and the saṃgha before monks, denigrating monks because they lack faculties and impure qualities",
        "source": "T22n1428_053:0959b03_10"
    },
    {
        "source_sentence": "如是九、八、七、六、五、四、三、二、一法，罵謗比丘，僧應作覆鉢。",
        "translation": "In the same way, when nine, eight, seven, six, five, four, three, two, or one thing reviles a monk, the saṃgha should make a covering bowl.",
        "source": "T22n1428_053:0959b08_11"
    },
    {
        "source_sentence": "有如是一法，僧應與作覆鉢。",
        "translation": "If there's such a one thing, the saṃgha should make a covered bowl for it.",
        "source": "T22n1428_053:0959b09_12"
    },
    {
        "source_sentence": "應如是作，眾中應差堪能羯磨者如上，作如是白：『大德僧聽！",
        "translation": "You should do so, and the person in the congregation who sends the competent karma master as above will make this statement: 'Listen, monks of great virtue!'",
        "source": "T22n1428_053:0959b10_13"
    },
    {
        "source_sentence": "此大離奢，沓婆摩羅子清淨，而以無根波羅夷法謗。",
        "translation": "This great Licchavi, the Tathāgata-malāputra's pure and pure, yet he denigrates it with the principle of the absence of faculties as a pārājika.",
        "source": "T22n1428_053:0959b11_14"
    },
    {
        "source_sentence": "若僧時到僧忍聽，僧今為此大離奢作覆鉢不相來往。",
        "translation": "If the saṃgha arrives at the time, the saṃgha tolerates listening, and the saṃgha now makes a covered bowl for this great reliance for the sake of the saṃgha that doesn't come or go together.",
        "source": "T22n1428_053:0959b13_15"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T22n1428_053:0959b14_16"
    },
    {
        "source_sentence": "『大德僧聽！",
        "translation": "'Listen, great virtuous monks!",
        "source": "T22n1428_053:0959b14_17"
    },
    {
        "source_sentence": "此大離奢，沓婆摩羅子清淨，而以無根波羅夷法謗。",
        "translation": "This great Licchavi, the Tathāgata-malāputra's pure and pure, yet he denigrates it with the principle of the absence of faculties as a pārājika.",
        "source": "T22n1428_053:0959b14_18"
    },
    {
        "source_sentence": "今僧為作覆鉢不相往來。",
        "translation": "Now, the saṃgha made a covering bowl for him and didn't go back or forth.",
        "source": "T22n1428_053:0959b16_19"
    },
    {
        "source_sentence": "誰諸長老忍僧為大離奢作覆鉢不相往來者默然，誰不忍者說。』",
        "translation": "Those elders who tolerate the saṃgha's making a covered bowl for Mahāli and don't go or come to each other are silent, and those who don't tolerate it say so.'",
        "source": "T22n1428_053:0959b16_20"
    },
    {
        "source_sentence": "『僧已忍為大離奢作覆鉢不相往來竟，僧忍，默然故，是事如是持。』",
        "translation": "'The saṃgha has tolerated the making of a covered bowl for Mahāli and doesn't go back and forth with each other, and the saṃgha tolerates it because they're silent, thus holding it like this.'",
        "source": "T22n1428_053:0959b18_21"
    },
    {
        "source_sentence": "聽僧差使往大離奢所語如是言：『僧為汝作覆鉢不相往來作白二羯磨。』",
        "translation": "He heard the saṃgha send an envoy to Mahāliśa and said, 'The saṃgha made a covering bowl for you, didn't go back and forth to make two white karmas for you.'",
        "source": "T22n1428_053:0959b19_22"
    },
    {
        "source_sentence": "有八法者應差使往，能聽、能說、自解、能令他解、能受、能憶持、無謬失、別好惡義。",
        "translation": "There are eight things that should be sent to them, which they can hear, explain, understand for themselves, cause others to understand, receive, retain, avoid mistakes, and distinguish good and bad meanings.",
        "source": "T22n1428_053:0959b21_23"
    },
    {
        "source_sentence": "有如是八法者，應差為僧使。」",
        "translation": "If there are such eight things, they should be sent to the saṃgha as messengers.",
        "source": "T22n1428_053:0959b23_24"
    },
    {
        "source_sentence": "「若在大眾中，　　心無有怯弱；",
        "translation": "“If someone is in the assembly, Their minds are not faint-hearted.",
        "source": "T22n1428_053:0959b24_25"
    },
    {
        "source_sentence": "　所說亦不增，　　受教無損減。",
        "translation": "Nor does that which is taught increase, and there's no loss or gain in receiving instruction.",
        "source": "T22n1428_053:0959b24_25"
    },
    {
        "source_sentence": "　言無有錯亂，　　問時不移動；",
        "translation": "He speaks without confusion, And doesn’t move when asked.",
        "source": "T22n1428_053:0959b24_25"
    },
    {
        "source_sentence": "　有如是比丘，　　堪任為僧使。",
        "translation": "If there's a monk like this, he's capable of being an envoy to the saṃgha.",
        "source": "T22n1428_053:0959b24_25"
    },
    {
        "source_sentence": "而說偈言：「阿難！",
        "translation": "He spoke a verse, saying, Ānanda!",
        "source": "T22n1428_053:0959b24_25"
    },
    {
        "source_sentence": "有如是八法，聽差為僧使語彼大離奢：『今僧為汝作覆鉢不相往來白二羯磨。』",
        "translation": "There are these eight ways to listen to the saṃgha's messenger and tell them to Mahāliśas, 'Now, the saṃgha will make a covering bowl for you, not telling each other about the two karmas.'",
        "source": "T22n1428_053:0959b29_26"
    },
    {
        "source_sentence": "眾中差堪能羯磨者如上，作如是白：『大德僧聽！",
        "translation": "The competent karma-monk in the assembly, as above, made this statement, 'Listen, great monks!'",
        "source": "T22n1428_053:0959c02_27"
    },
    {
        "source_sentence": "若僧時到僧忍聽，僧今差阿難為僧使，往大離奢所語言：「今僧為汝作覆鉢不相往來。」",
        "translation": "If the saṃgha arrives at the time, the saṃgha will tolerate it. Now, the saṃgha sends Ānanda as an envoy to the saṃgha and goes to Mahāliśas to say, Now, the saṃgha will make a covered bowl for you so that they won't go or come together.",
        "source": "T22n1428_053:0959c03_28"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T22n1428_053:0959c05_29"
    },
    {
        "source_sentence": "『大德僧聽！",
        "translation": "'Listen, great virtuous monks!",
        "source": "T22n1428_053:0959c05_30"
    },
    {
        "source_sentence": "僧今差阿難為僧使，往大離奢所作如是言：「僧今為汝作覆鉢不相往來。」",
        "translation": "Now, the saṃgha sends Ānanda as an envoy to the saṃgha and goes to Mahāliśas to say, The saṃgha will now make a covering bowl for you so that they won't go or come together.",
        "source": "T22n1428_053:0959c05_31"
    },
    {
        "source_sentence": "誰諸長老忍僧差阿難為僧使者默然，誰不忍者說。』",
        "translation": "Those elders who tolerate the saṃgha and send Ānanda as an envoy to the saṃgha are silent, and those who don't tolerate it say so.'",
        "source": "T22n1428_053:0959c07_32"
    },
    {
        "source_sentence": "『僧已忍差阿難為僧使，往彼大離奢所語言：「僧為汝作覆鉢不相往來。」",
        "translation": "'After the saṃgha tolerated sending Ānanda as a messenger for the saṃgha, he went to that great Licchavi and said, The saṃgha will make a covered bowl for you without going or coming together.'",
        "source": "T22n1428_053:0959c08_33"
    },
    {
        "source_sentence": "竟。",
        "translation": "It's complete.",
        "source": "T22n1428_053:0959c10_34"
    },
    {
        "source_sentence": "僧忍，默然故，是事如是持。』」",
        "translation": "Because the saṃgha tolerated it and remained silent, these things are thus maintained.'",
        "source": "T22n1428_053:0959c10_35"
    },
    {
        "source_sentence": "爾時阿難著衣持鉢，往彼大離奢家。",
        "translation": "Ānanda then put on his robe, took his bowl, and went to that great Licchavi house.",
        "source": "T22n1428_053:0959c11_36"
    },
    {
        "source_sentence": "時大離奢在外門屋下梳頭，遙見阿難遠來，疾疾收髮前迎阿難白言：「大德善哉！",
        "translation": "When Mahāliśa was combing his hair under the door outside the house, he saw Ānanda coming from a distance and quickly withdrew to meet him, saying, Excellent, venerable!",
        "source": "T22n1428_053:0959c12_0"
    },
    {
        "source_sentence": "願前入舍。」",
        "translation": "May I enter the house in front of you.",
        "source": "T22n1428_053:0959c14_0"
    },
    {
        "source_sentence": "阿難報言：「我不應入汝家受床坐、飲食供養。」",
        "translation": "Ānanda replied, I shouldn't go into your house to accept a bed or seat and food and drink as an offering.",
        "source": "T22n1428_053:0959c14_1"
    },
    {
        "source_sentence": "離奢言：「大德阿難！",
        "translation": "Licchavi said, Venerable Ānanda!",
        "source": "T22n1428_053:0959c15_2"
    },
    {
        "source_sentence": "何以故？」",
        "translation": "Why is it so?",
        "source": "T22n1428_053:0959c15_3"
    },
    {
        "source_sentence": "答言：「僧已為汝作覆鉢不相往來故。」",
        "translation": "He replied, The saṃgha has made a covered bowl for you because they don't go back and forth.",
        "source": "T22n1428_053:0959c15_4"
    },
    {
        "source_sentence": "離奢言：「以何事故？」",
        "translation": "Licchavi said, What's the reason?",
        "source": "T22n1428_053:0959c16_5"
    },
    {
        "source_sentence": "阿難即為具說因緣。",
        "translation": "Ānanda then explained the causes and conditions for this.",
        "source": "T22n1428_053:0959c17_6"
    },
    {
        "source_sentence": "彼即言：「大德阿難！",
        "translation": "He then said, Venerable Ānanda!",
        "source": "T22n1428_053:0959c17_7"
    },
    {
        "source_sentence": "如是便為殺我耶？」",
        "translation": "Is this killing me?",
        "source": "T22n1428_053:0959c18_8"
    },
    {
        "source_sentence": "尋即悶絕倒地久乃醒悟，還起以手捫眼，白阿難言：「我當作何方便解我覆鉢還相往來耶？」",
        "translation": "He then fainted and fell to the ground for a long time before he woke up, raised his eyes with his palms together, and said to Ānanda, What method will I use to untie my covered bowl and return it to its place?",
        "source": "T22n1428_053:0959c18_9"
    },
    {
        "source_sentence": "阿難言：「汝應往懺悔眾僧。」",
        "translation": "Ānanda said, You should go and repent to the saṃgha.",
        "source": "T22n1428_053:0959c20_10"
    },
    {
        "source_sentence": "時大離奢隨順眾僧不敢違逆，從僧乞解覆鉢還相往來。",
        "translation": "The great Licchavi then complied with the saṃgha and didn't dare disobey it, asked the saṃgha to uncover his bowl and go back and forth from one place to another.",
        "source": "T22n1428_053:0959c21_11"
    },
    {
        "source_sentence": "時諸比丘白佛，佛言：「若大離奢隨順眾僧不敢違逆，從僧乞解覆鉢還相往來者，應為解作白二羯磨。",
        "translation": "The monks then said to the Buddha, who said, If the great renunciant follows the saṃgha and doesn't dare disobey it, and if he asks the saṃgha to remove the covered bowl and return it to him or her, he or she should perform the two karman rituals of liberation.",
        "source": "T22n1428_053:0959c22_12"
    },
    {
        "source_sentence": "眾中差堪能羯磨者如上，作如是白：『大德僧聽！",
        "translation": "The competent karma-monk in the assembly, as above, made this statement, 'Listen, great monks!'",
        "source": "T22n1428_053:0959c25_13"
    },
    {
        "source_sentence": "今僧為大離奢解覆鉢不相往來，彼隨順眾僧不敢違逆，從僧乞解覆鉢不相往來羯磨。",
        "translation": "Now, for the sake of Mahāli Śākyamuni, the saṃgha uncovers his bowl and doesn't go back and forth with each other, he follows the saṃgha and doesn't dare to disobey it, begs the saṃgha to uncover his bowl and doesn't go back and forth with each other.",
        "source": "T22n1428_053:0959c26_14"
    },
    {
        "source_sentence": "若僧時到僧忍聽，僧今為大離奢作解覆鉢還相往來。",
        "translation": "If the saṃgha arrives at the time, the saṃgha tolerates it and listens to it, and the saṃgha now makes an uncovered bowl for Mahāliśa that goes back and forth with each other.",
        "source": "T22n1428_053:0959c28_15"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T22n1428_053:0959c29_16"
    },
    {
        "source_sentence": "『大德僧聽！",
        "translation": "'Listen, great virtuous monks!",
        "source": "T22n1428_053:0960a01_17"
    },
    {
        "source_sentence": "僧為大離奢作覆鉢不相往來，彼隨順眾僧不敢違逆，從僧乞解覆鉢不相往來羯磨。",
        "translation": "When the saṃgha makes a covering bowl for Mahāli and doesn't go back and forth with each other, he follows the saṃgha and doesn't dare to disobey it, begs from the saṃgha to uncover his bowl and doesn't go back and forth with each other in the karman.",
        "source": "T22n1428_053:0960a01_18"
    },
    {
        "source_sentence": "今僧為大離奢解覆鉢還相往來。",
        "translation": "Now, the saṃgha discloses the covering bowl for Mahāli and goes back and forth with each other.",
        "source": "T22n1428_053:0960a03_19"
    },
    {
        "source_sentence": "誰諸長老忍僧為彼大離奢解覆鉢還相往來者默然，誰不忍者說。』",
        "translation": "Those elders who tolerate the saṃgha and tolerate it for that great Li Xia's sake, uncover their bowls and go back and forth with each other remain silent, and those who don't tolerate it say so.'",
        "source": "T22n1428_053:0960a04_20"
    },
    {
        "source_sentence": "『僧已忍為彼大離奢解覆鉢還相往來竟，僧忍，默然故，是事如是持。』」",
        "translation": "'After the saṃgha tolerated it for that Mahāli Śākyamuni's covering bowl, the saṃgha returned and went back and forth with each other, and the saṃgha tolerated it because they were silent, thus holding it like this.'",
        "source": "T22n1428_053:0960a05_21"
    },
    {
        "source_sentence": "時迦留陀夷在阿蘭若處住，彼於道路燒草，火勢蔓莚，遂乃燒王波斯匿鹿苑。",
        "translation": "Kālôdayin then stayed in a forest and burned grass on the roadway, and the fire grew so strong that it burned the deer park of King Prasenajit.",
        "source": "T22n1428_053:0960a07_22"
    },
    {
        "source_sentence": "時居士皆譏嫌言：「沙門釋子無有慚愧，斷眾生命。",
        "translation": "The householders then all criticized him, saying, The ascetic or Śākyamuni has no shame and cuts off the lives of sentient beings.",
        "source": "T22n1428_053:0960a09_23"
    },
    {
        "source_sentence": "彼自言：『我知正法。』",
        "translation": "They themselves say, 'I know the right teaching.'",
        "source": "T22n1428_053:0960a10_24"
    },
    {
        "source_sentence": "燒王鹿苑，如是何有正法耶？」",
        "translation": "How could there be a right teaching like this for burning the king's deer park?",
        "source": "T22n1428_053:0960a10_25"
    },
    {
        "source_sentence": "諸比丘往白佛，佛言：「不應爾。」",
        "translation": "The monks went to the Buddha and said, That's not right.",
        "source": "T22n1428_053:0960a11_26"
    },
    {
        "source_sentence": "時諸比丘道路行，有草妨閡，佛言：「聽以竹壓草，若石、若木鎮上。」",
        "translation": "When the monks were traveling on the road, there was grass that obstructed them, and the Buddha said, Listen, press grass with bamboo or stone or wood to calm it.",
        "source": "T22n1428_053:0960a12_27"
    },
    {
        "source_sentence": "時祇桓外有野火燒蔓莚來至，諸比丘不知云何？",
        "translation": "At the time, there was a wildfire outside of Jīvaka that burned vines and came to him, but the monks didn't know what it was.",
        "source": "T22n1428_053:0960a13_28"
    },
    {
        "source_sentence": "即白佛，佛言：「聽逆除中間草，若作坑塹斷、若以土滅、若逆燒時。」",
        "translation": "He then said to the Buddha, who said, Listen and remove the grass in between, whether it's made into a pit or ditch, destroyed with dirt, or burned up.",
        "source": "T22n1428_053:0960a15_29"
    },
    {
        "source_sentence": "有比丘羸老，不能無絡囊盛鉢無杖而行，彼作是念：「我當云何？」",
        "translation": "Some monks who were too old to carry their bowls and bowls without a wrapped bag or staff thought, What will I do?",
        "source": "T22n1428_053:0960a16_30"
    },
    {
        "source_sentence": "白諸比丘。",
        "translation": "He said to the monks.",
        "source": "T22n1428_053:0960a18_31"
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「聽僧與彼老比丘杖絡囊白二羯磨。",
        "translation": "The monks told the Buddha, and he said, Listen to the two white karmas of the saṃgha giving the old monk's staff, wrapped in a bag, and carrying it with him.",
        "source": "T22n1428_053:0960a18_32"
    },
    {
        "source_sentence": "應如是與，眾中應差堪能羯磨者如上，作如是白：『大德僧聽！",
        "translation": "You should thus give it to them, and the competent karma-monks in the congregation should send it as above, saying, 'Listen, Mañjuśrī!'",
        "source": "T22n1428_053:0960a19_33"
    },
    {
        "source_sentence": "此某甲比丘羸老，不能無絡囊盛鉢無杖而行，彼從僧乞杖絡囊。",
        "translation": "This certain monk is old and weak, so he can't walk without a wrapped bag or bowl to carry his bowl or walking with a staff.",
        "source": "T22n1428_053:0960a21_34"
    },
    {
        "source_sentence": "若僧時到僧忍聽，與某甲比丘杖絡囊。",
        "translation": "If the saṃgha arrives at the time, the saṃgha will tolerate it and give a certain monk's staff to wrap it in a bag.",
        "source": "T22n1428_053:0960a22_35"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T22n1428_053:0960a23_36"
    },
    {
        "source_sentence": "『大德僧聽！",
        "translation": "'Listen, great virtuous monks!",
        "source": "T22n1428_053:0960a23_37"
    },
    {
        "source_sentence": "此某甲比丘羸老，不能無杖絡囊而行，今從僧乞杖絡囊。",
        "translation": "This certain monk, aged and weak, couldn't walk without a staff wrapped in a bag, so now he begs the saṃgha for a staff wrapped in a bag.",
        "source": "T22n1428_053:0960a24_38"
    },
    {
        "source_sentence": "僧今與此比丘杖絡囊。",
        "translation": "Now, the saṃgha gave this monk's staff and bag to wrap it around him.",
        "source": "T22n1428_053:0960a25_39"
    },
    {
        "source_sentence": "誰諸長老忍僧與某甲比丘杖絡囊者默然，誰不忍者說。』",
        "translation": "Those elders who tolerate the saṃgha and give a certain monk's staff to wrap it in a bag are silent, and those who don't tolerate it say so.'",
        "source": "T22n1428_053:0960a26_40"
    },
    {
        "source_sentence": "『僧已忍與某甲比丘杖絡囊竟，僧忍，默然故，是事如是持。』」",
        "translation": "'After the saṃgha tolerated giving a certain monk's staff to wrap it in a bag, the saṃgha tolerated it and remained silent, thus holding it like this.'",
        "source": "T22n1428_053:0960a27_41"
    },
    {
        "source_sentence": "爾時舍利弗，見眾僧作非法羯磨，無同意者，欲默然任之。",
        "translation": "At the time, Śāriputra saw that the saṃgha was performing an unlawful karma and didn't agree, so he wanted to be silent and let it go.",
        "source": "T22n1428_053:0960a28_42"
    },
    {
        "source_sentence": "佛言：「聽默然。",
        "translation": "The Buddha said, Listen quietly.",
        "source": "T22n1428_053:0960b01_43"
    },
    {
        "source_sentence": "有五法不應默然：若如法羯磨而心不同，默然任之；",
        "translation": "There are five things by which one should not be silent:",
        "source": "T22n1428_053:0960b01_44"
    },
    {
        "source_sentence": "若得同意伴，亦默然任之；",
        "translation": "If they were to be accompanied by sympathy, they would also remain silent and let them go.",
        "source": "T22n1428_053:0960b02_45"
    },
    {
        "source_sentence": "若見小罪而默然；",
        "translation": "If one observes minor sins and remains silent, he or she will not commit any offense.",
        "source": "T22n1428_053:0960b03_46"
    },
    {
        "source_sentence": "為作別住而默然；",
        "translation": "He remained silent in order to establish a separate dwelling place.",
        "source": "T22n1428_053:0960b03_47"
    },
    {
        "source_sentence": "在戒場上而默然。",
        "translation": "He stayed silent on the site of the precepts.",
        "source": "T22n1428_053:0960b04_48"
    },
    {
        "source_sentence": "如是五法默然者非法。",
        "translation": "Thus, these five things are silent and unlawful.",
        "source": "T22n1428_053:0960b04_49"
    },
    {
        "source_sentence": "有五法應默然：見他非法而默然；",
        "translation": "There are five things by which one should be silent:",
        "source": "T22n1428_053:0960b05_50"
    },
    {
        "source_sentence": "不得伴默然；",
        "translation": "They were not allowed to accompany them and remained silent.",
        "source": "T22n1428_053:0960b05_51"
    },
    {
        "source_sentence": "犯重而默然；",
        "translation": "They committed a grave offense but remained silent.",
        "source": "T22n1428_053:0960b06_52"
    },
    {
        "source_sentence": "同住默然；",
        "translation": "They all stayed together in silence.",
        "source": "T22n1428_053:0960b06_53"
    },
    {
        "source_sentence": "在同住地默然。",
        "translation": "They're in the same place where they live and are silent.",
        "source": "T22n1428_053:0960b06_54"
    },
    {
        "source_sentence": "如是五法應默然。",
        "translation": "Thus, these five things should be silenced.",
        "source": "T22n1428_053:0960b07_55"
    },
    {
        "source_sentence": "有五事應和合。",
        "translation": "There are five things that should be combined.",
        "source": "T22n1428_053:0960b07_56"
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are these five?",
        "source": "T22n1428_053:0960b08_57"
    },
    {
        "source_sentence": "若如法應和合；",
        "translation": "If they are according to the teaching, they should be combined.",
        "source": "T22n1428_053:0960b08_58"
    },
    {
        "source_sentence": "若默然任之；",
        "translation": "If he remains silent, let him do so.",
        "source": "T22n1428_053:0960b08_59"
    },
    {
        "source_sentence": "若與欲；",
        "translation": "Suppose it is with sexual desire.",
        "source": "T22n1428_053:0960b08_60"
    },
    {
        "source_sentence": "若從可信人聞；",
        "translation": "Suppose one hears it from someone who is trustworthy.",
        "source": "T22n1428_053:0960b09_61"
    },
    {
        "source_sentence": "若先在中默然而坐。",
        "translation": "If he's first in the midst of it, he sits silently.",
        "source": "T22n1428_053:0960b09_62"
    },
    {
        "source_sentence": "如是五事應和合。」",
        "translation": "Thus, these five things should be combined.",
        "source": "T22n1428_053:0960b10_0"
    },
    {
        "source_sentence": "爾時世尊在祇桓中與無數眾說法。",
        "translation": "At the time, the Bhagavān was teaching to an incalculable number of people in Jīvaka.",
        "source": "T22n1428_053:0960b10_1"
    },
    {
        "source_sentence": "時世尊啑，諸比丘呪願言：「長壽！」",
        "translation": "When the Bhagavān was angry, the monks cursed and vowed, Long life!",
        "source": "T22n1428_053:0960b11_2"
    },
    {
        "source_sentence": "諸比丘、比丘尼、優婆塞、優婆夷亦言：「長壽。」",
        "translation": "The monks, nuns, laymen, and laymen also said, Long life.",
        "source": "T22n1428_053:0960b12_3"
    },
    {
        "source_sentence": "大眾遂便鬧亂，佛言：「不應爾。」",
        "translation": "The crowd then became in disarray, and the Buddha said, That's not right.",
        "source": "T22n1428_053:0960b13_4"
    },
    {
        "source_sentence": "時有居士啑，諸比丘畏慎不敢言長壽，居士皆譏嫌言：「我等啑，諸比丘不呪願長壽。」",
        "translation": "When a householder was angry, the monks were afraid and cautious and didn't dare to say long life, and the householders criticized him, saying, We are angry, but the monks won't curse or wish for long life.",
        "source": "T22n1428_053:0960b13_5"
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「聽呪願長壽。」",
        "translation": "The monks said to the Buddha, who said, Listen to the spell and wish for long life.",
        "source": "T22n1428_053:0960b15_6"
    },
    {
        "source_sentence": "時諸居士禮比丘，比丘畏慎不敢言長壽，世尊不聽我呪願。",
        "translation": "The householders then bowed to the monk, who was afraid and cautious and didn't dare say long life, and the Bhagavān didn't listen to my dhāraṇī vow.",
        "source": "T22n1428_053:0960b16_7"
    },
    {
        "source_sentence": "諸居士皆嫌言：「我等禮比丘，比丘不呪願我等長壽。」",
        "translation": "The monks all resented it, saying, We salute the monks, and the monks won't curse us for a long life.",
        "source": "T22n1428_053:0960b17_8"
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「聽呪願長壽。」",
        "translation": "The monks said to the Buddha, who said, Listen to the spell and wish for long life.",
        "source": "T22n1428_053:0960b19_9"
    },
    {
        "source_sentence": "爾時六群比丘有小事，便作呪咀言：「我若作如是，當墮地獄、餓鬼、畜生，不生佛法中。",
        "translation": "It was then that six groups of monks had some minor matters, and they made a dhāraṇī, saying, If I do so, I'll fall into hell, hungry ghosts, animals, and not be born in the Buddha's teaching.",
        "source": "T22n1428_053:0960b19_10"
    },
    {
        "source_sentence": "若餘人作如是事，亦當墮地獄、餓鬼、畜生，不生佛法中。」",
        "translation": "If other people do such things, they'll also fall into hell, hungry ghosts, or animals and won't be born in the Buddha's teaching.",
        "source": "T22n1428_053:0960b22_0"
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「不應爾。",
        "translation": "The monks said to the Buddha, who said, That shouldn't be so.",
        "source": "T22n1428_053:0960b23_1"
    },
    {
        "source_sentence": "聽作如是語：『若我作如是事，南無佛。",
        "translation": "They heard someone say, 'If I did such a thing, there would be no Buddha in the south.'",
        "source": "T22n1428_053:0960b23_2"
    },
    {
        "source_sentence": "若汝作如是事，亦言：「南無佛。」』」",
        "translation": "If you do such a thing, you also say, South is the Buddha.'",
        "source": "T22n1428_053:0960b24_3"
    },
    {
        "source_sentence": "爾時六群比丘畜腰帶頭安茸，佛言：「不應爾。」",
        "translation": "It was then that six groups of monks had stored their waistbands and hair, and the Buddha said, That shouldn't be so.",
        "source": "T22n1428_053:0960b25_4"
    },
    {
        "source_sentence": "彼畜革帶，佛言：「不應爾。」",
        "translation": "When he wore a leather belt, the Buddha said, That's not right.",
        "source": "T22n1428_053:0960b26_5"
    },
    {
        "source_sentence": "六群比丘畜闍提那帶，佛言：「不應爾。」",
        "translation": "Six groups of monks were carrying the jhāttiya belt, and the Buddha said, That's not right.",
        "source": "T22n1428_053:0960b27_6"
    },
    {
        "source_sentence": "彼畜散綖帶，佛言：「不應爾。",
        "translation": "When he was carrying a scattered sash, the Buddha said, That shouldn't be so.",
        "source": "T22n1428_053:0960b28_7"
    },
    {
        "source_sentence": "汝等癡人！",
        "translation": "You foolish people!",
        "source": "T22n1428_053:0960b28_8"
    },
    {
        "source_sentence": "避我所遮更作餘事。",
        "translation": "He avoids self and what's hindered, and he does other things.",
        "source": "T22n1428_053:0960b29_9"
    },
    {
        "source_sentence": "自今已去，如是一切帶不應畜。」",
        "translation": "From now on, such things shouldn't be stored in any belt.",
        "source": "T22n1428_053:0960b29_10"
    },
    {
        "source_sentence": "時六群比丘畜長廣帶，佛言：「不應爾。",
        "translation": "Six groups of monks then stored a long and wide belt, and the Buddha said, That's not right.",
        "source": "T22n1428_053:0960c01_11"
    },
    {
        "source_sentence": "聽作腰帶廣三指遶腰三周。」",
        "translation": "He hears you make a waistband three fingers wide and three rings around your waist.",
        "source": "T22n1428_053:0960c02_12"
    },
    {
        "source_sentence": "彼六群比丘大染真色作帶，佛言：「不應爾。」",
        "translation": "Those six groups of monks were greatly dyed true colors and made sashes, and the Buddha said, That shouldn't be so.",
        "source": "T22n1428_053:0960c02_13"
    },
    {
        "source_sentence": "彼作錦帶，佛言：「不應爾。」",
        "translation": "They made a brocaded belt, and the Buddha said, That shouldn't be so.",
        "source": "T22n1428_053:0960c03_14"
    },
    {
        "source_sentence": "彼作白帶，佛言：「不應爾。",
        "translation": "He made a white belt, and the Buddha said, That shouldn't be so.",
        "source": "T22n1428_053:0960c04_15"
    },
    {
        "source_sentence": "聽作袈裟色帶。」",
        "translation": "They'll be heard to make a monk's robe-colored belt.",
        "source": "T22n1428_053:0960c05_16"
    },
    {
        "source_sentence": "爾時有信樂陶師作種種器與諸比丘，比丘不敢受，白佛，佛言：「聽受。",
        "translation": "At the time, there was a faithful potter who made various vessels and gave them to the monks. The monks didn't dare to accept them and said to the Buddha, Listen and accept them.",
        "source": "T22n1428_053:0960c05_17"
    },
    {
        "source_sentence": "有二種器不應畜，瓦坐床、瓦斛瓦斗升合。」",
        "translation": "There are two kinds of containers that shouldn't be stored, which are tiled seats and tile-covered beds or tile-covered bowls and tile-covered buckets.",
        "source": "T22n1428_053:0960c07_18"
    },
    {
        "source_sentence": "爾時跋難陀釋子往陶師家，在瓦器上累髀坐，器破，仰倒地形露。",
        "translation": "It was then that the Śākyamuni Upananda went to the potter's house and sat cross-legged on a tile container, which broke apart and faced upward.",
        "source": "T22n1428_053:0960c08_19"
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「不應瓦器上坐，亦不應白衣家累髀坐。」",
        "translation": "The monks said to the Buddha, and he said, You shouldn't sit on a tile vessel; you shouldn't sit in a white-robed house with legs crossed.",
        "source": "T22n1428_053:0960c09_20"
    },
    {
        "source_sentence": "時六群比丘，誦外道安置舍宅吉凶符書呪、枝節呪、剎利呪、尸婆羅呪、知人生死吉凶呪、解諸音聲呪。",
        "translation": "The six groups of monks then recited the spell for telling the good and bad omens of the house where the non-Buddhist was staying, the spell for writing spells, the spell for branching knuckles, the spell for kṣatriya spells, the spell for śimbara spells, the spell for knowing the good and bad omens of birth and death, and the spell for understanding sounds.",
        "source": "T22n1428_053:0960c11_21"
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「不應爾。」",
        "translation": "The monks said to the Buddha, who said, That shouldn't be so.",
        "source": "T22n1428_053:0960c13_22"
    },
    {
        "source_sentence": "彼教他，佛言：「不應爾。」",
        "translation": "They teach others, and the Buddha says, That's not the case.",
        "source": "T22n1428_053:0960c14_23"
    },
    {
        "source_sentence": "彼以此活命，佛言：「不應爾。」",
        "translation": "Because of this livelihood, the Buddha said, That shouldn't be so.",
        "source": "T22n1428_053:0960c14_24"
    },
    {
        "source_sentence": "時諸比丘口臭，佛言：「應嚼楊枝。",
        "translation": "The monks then smelled bad in their mouths, and the Buddha said, You should chew a tooth stick.",
        "source": "T22n1428_053:0960c15_25"
    },
    {
        "source_sentence": "不嚼楊枝，有五事過：口氣臭、不別味、增益熱癊、不引食、眼不明。",
        "translation": "There are five things wrong with not chewing tooth sticks: the odor of their mouth is bad, they don't taste distinctly, increase in feverishness, don't draw food, and don't have eyes that don't know.",
        "source": "T22n1428_053:0960c16_26"
    },
    {
        "source_sentence": "不嚼楊枝，有如是五過。",
        "translation": "These are the five faults of not chewing tooth sticks.",
        "source": "T22n1428_053:0960c17_27"
    },
    {
        "source_sentence": "嚼楊枝有五事利益：一、口氣不臭。",
        "translation": "There are five benefits of chewing a tooth stick: 1. It doesn't smell bad in the mouth and breath.",
        "source": "T22n1428_053:0960c18_28"
    },
    {
        "source_sentence": "二、別味。",
        "translation": "2. specific taste...",
        "source": "T22n1428_053:0960c19_29"
    },
    {
        "source_sentence": "三、熱癊消。",
        "translation": "3. the disappearance of fever...",
        "source": "T22n1428_053:0960c19_30"
    },
    {
        "source_sentence": "四、引食。",
        "translation": "4. inducing food.",
        "source": "T22n1428_053:0960c19_31"
    },
    {
        "source_sentence": "五、眼明。",
        "translation": "5. clarity of vision.",
        "source": "T22n1428_053:0960c19_32"
    },
    {
        "source_sentence": "嚼楊枝有如是五事利益。」",
        "translation": "Chewing a tooth stick has these five benefits.",
        "source": "T22n1428_053:0960c19_33"
    },
    {
        "source_sentence": "世尊既聽嚼楊枝，彼嚼長楊枝，佛言：「不應爾。",
        "translation": "When the Bhagavān heard that he chewed a tooth relic, he chewed a long tooth relic, and the Buddha said, That's not right.",
        "source": "T22n1428_053:0960c20_34"
    },
    {
        "source_sentence": "聽極長者一搩手。」",
        "translation": "He listens to the extremely wealthy man's one hand.",
        "source": "T22n1428_053:0960c21_35"
    },
    {
        "source_sentence": "彼嚼楊枝奇者，佛言：「不應爾。」",
        "translation": "That's a marvelous thing to chew the tooth stick, and the Buddha said, It shouldn't be so.",
        "source": "T22n1428_053:0960c22_36"
    },
    {
        "source_sentence": "彼嚼雜葉者，佛言：「不應爾。」",
        "translation": "When he chews a mixed leaf, the Buddha says, That's not right.",
        "source": "T22n1428_053:0960c22_37"
    },
    {
        "source_sentence": "彼純嚼皮，佛言：「不應爾。」",
        "translation": "They simply chewed skin, and the Buddha said, That's not right.",
        "source": "T22n1428_053:0960c23_38"
    },
    {
        "source_sentence": "時有比丘嚼短楊枝，見佛恭敬故便咽即以為患。",
        "translation": "A monk then chewed a short tooth stick and saw the Buddha venerate it, so he swallowed it as a danger.",
        "source": "T22n1428_053:0960c24_39"
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「不應爾。",
        "translation": "The monks said to the Buddha, who said, That shouldn't be so.",
        "source": "T22n1428_053:0960c25_40"
    },
    {
        "source_sentence": "極短者長四指。」",
        "translation": "The shortest is four fingers long.",
        "source": "T22n1428_053:0960c25_41"
    },
    {
        "source_sentence": "彼於多人行處嚼楊枝，若在溫室、若在食堂、若在經行堂。",
        "translation": "They chew tooth sticks at the places where many people walk, whether they're in a greenhouse, a dining hall, or a meditation hall.",
        "source": "T22n1428_053:0960c26_42"
    },
    {
        "source_sentence": "諸比丘見惡之，往白佛，佛言：「不應爾。",
        "translation": "Seeing this evil, the monks went to the Buddha and told him, who said, You shouldn't do that.",
        "source": "T22n1428_053:0960c27_43"
    },
    {
        "source_sentence": "有三事應在屏處，大小便、嚼楊枝，如是三事應在屏處。」",
        "translation": "There are three things that should be done in a secluded place, which are defecating, excreting, and chewing tooth sticks; these three things should be done in a secluded place.",
        "source": "T22n1428_053:0960c28_44"
    },
    {
        "source_sentence": "時諸比丘舌上多垢，佛言：「聽作刮舌刀。」",
        "translation": "The monks then had a lot of dirt on their tongues, and the Buddha said, Listen to me make a tongue- scraping sword.",
        "source": "T22n1428_053:0960c29_45"
    },
    {
        "source_sentence": "彼用寶作，佛言：「不應爾。",
        "translation": "They made it with treasure, and the Buddha said, That shouldn't be so.",
        "source": "T22n1428_053:0961a01_46"
    },
    {
        "source_sentence": "聽用骨、牙、角、銅鐵、白鑞、鉛、錫、舍羅草、竹葦、木。」",
        "translation": "They hear it made of bones, teeth, horns, horns, copper, iron, white silk, lead, tin, śāla grass, bamboo, reeds, and wood.",
        "source": "T22n1428_053:0961a02_47"
    },
    {
        "source_sentence": "彼不洗便舉，餘比丘見惡之，佛言：「不應爾，應洗。」",
        "translation": "When they don't wash and then lift it, the other monks see it badly, and the Buddha says, You shouldn't; you should wash.",
        "source": "T22n1428_053:0961a03_48"
    },
    {
        "source_sentence": "彼洗已不曬燥便舉，生壞，佛言：「不應爾。」",
        "translation": "After washing it, he doesn't dry it and then lifts it up, which causes it to disintegrate, and the Buddha says, That shouldn't be so.",
        "source": "T22n1428_053:0961a04_49"
    },
    {
        "source_sentence": "時諸比丘患食物入齒間，佛言：「聽作摘齒物。」",
        "translation": "When the monks were suffering from food and entered between their teeth, the Buddha said, Listen to make something to remove their teeth.",
        "source": "T22n1428_053:0961a05_50"
    },
    {
        "source_sentence": "彼用寶作，佛言：「不應用寶作，聽用骨牙角乃至竹木作。」",
        "translation": "They made it with treasure, and the Buddha said, You won't make it with treasure; you can make it with bones, teeth, horns, or even bamboo or wood.",
        "source": "T22n1428_053:0961a06_51"
    },
    {
        "source_sentence": "彼用已不洗便舉，諸比丘見皆惡之，佛言：「不應爾。",
        "translation": "After he uses it, he doesn't wash it and then lifts it. When the monks see it, they all dislike it, and the Buddha says, That shouldn't be so.",
        "source": "T22n1428_053:0961a07_52"
    },
    {
        "source_sentence": "應洗。」",
        "translation": "You should wash it.",
        "source": "T22n1428_053:0961a09_53"
    },
    {
        "source_sentence": "彼洗已不曬燥便舉，生壞，佛言：「不應爾。",
        "translation": "After washing it, he doesn't dry it and then lifts it up, and it grows into decay. The Buddha said, That shouldn't be so.",
        "source": "T22n1428_053:0961a09_54"
    },
    {
        "source_sentence": "應令燥舉之。」",
        "translation": "You should make it dry and lift it up.",
        "source": "T22n1428_053:0961a10_55"
    },
    {
        "source_sentence": "時諸比丘患耳中有垢，佛言：「聽作挑耳篦。」",
        "translation": "The monks then suffered from defilement in their ears, and the Buddha said, Listen to me as I pick out my earrings.",
        "source": "T22n1428_053:0961a10_56"
    },
    {
        "source_sentence": "彼用寶作，佛言：「不應爾。",
        "translation": "They made it with treasure, and the Buddha said, That shouldn't be so.",
        "source": "T22n1428_053:0961a11_57"
    },
    {
        "source_sentence": "聽用骨牙角乃至竹木作。」",
        "translation": "They hear it made of bones, teeth, horns, horns, or even bamboo and wood.",
        "source": "T22n1428_053:0961a12_58"
    },
    {
        "source_sentence": "彼用已不洗便舉，諸比丘見惡之，佛言：「不應爾。",
        "translation": "After he uses it, he doesn't wash it and then lifts it up. When the monks see what's bad, the Buddha says, That shouldn't be so.",
        "source": "T22n1428_053:0961a12_59"
    },
    {
        "source_sentence": "應洗已舉之。」",
        "translation": "You should wash it and lift it up after washing it.",
        "source": "T22n1428_053:0961a14_0"
    },
    {
        "source_sentence": "彼不燥便舉，生壞，佛言：「不應爾。",
        "translation": "When it doesn't dry, they then rise and disintegrate, and the Buddha says, It shouldn't.",
        "source": "T22n1428_053:0961a14_1"
    },
    {
        "source_sentence": "應令燥已舉之。」",
        "translation": "You should make it dry and lift it up.",
        "source": "T22n1428_053:0961a15_2"
    },
    {
        "source_sentence": "爾時世尊在舍衛國。",
        "translation": "It was then that the Bhagavān was in Śrāvastī.",
        "source": "T22n1428_053:0961a15_3"
    },
    {
        "source_sentence": "時諸比丘多畜鸚鵡、鳥鸜、鵒鳥，初夜後夜鳴喚，亂諸比丘坐禪，諸比丘白佛，佛言：「不應畜如是鳥。」",
        "translation": "The monks then gathered a large amount of parrots, birds, turtles, and garuḍas. Early in the morning and late at night, they cried out to disturb the monks who were sitting in meditation.",
        "source": "T22n1428_053:0961a16_4"
    },
    {
        "source_sentence": "爾時世尊在拘睒彌。",
        "translation": "It was then that the Bhagavān was in Kauśāmbī.",
        "source": "T22n1428_053:0961a19_0"
    },
    {
        "source_sentence": "時跋難陀釋子畜狗子，見諸比丘吠。",
        "translation": "The Śākyamuni Upananda then kept a dog, and he saw the monks barking.",
        "source": "T22n1428_053:0961a19_1"
    },
    {
        "source_sentence": "比丘白佛，佛言：「不應畜。」",
        "translation": "The monks said to the Buddha, who said, You shouldn't store it.",
        "source": "T22n1428_053:0961a20_2"
    },
    {
        "source_sentence": "爾時世尊在婆祇提國。",
        "translation": "It was then that the Bhagavān was in the country of Vātsīputrīya.",
        "source": "T22n1428_053:0961a21_0"
    },
    {
        "source_sentence": "時毘舍離婆闍子比丘畜羆子，裂破比丘衣鉢坐具針筒，乃復傷比丘身體。",
        "translation": "At the time, the monk Vaiśravaṇa Vātsīputrī and the monk Pāṭikāputra were holding a bamboo bowl that split the monk's robe, bowl, sitting cloth, and needle tube, and then they again inflicted injury to the monk's body.",
        "source": "T22n1428_053:0961a21_1"
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「不應畜。」",
        "translation": "The monks said to the Buddha, and he said, You shouldn't store it.",
        "source": "T22n1428_053:0961a23_2"
    },
    {
        "source_sentence": "爾時世尊在毘舍離國。",
        "translation": "It was then that the Bhagavān was in Vaiśālī.",
        "source": "T22n1428_053:0961a24_0"
    },
    {
        "source_sentence": "時諸離奢，乘象馬車乘、輦輿、捉持刀劍，來欲見世尊。",
        "translation": "At that time the Licchavi clanspeople came to see the World-honored One, riding in elephants, horse carts, carriages, palanquins, swords, and swords.",
        "source": "T22n1428_053:0961a24_1"
    },
    {
        "source_sentence": "彼留刀杖在寺外，入內問訊。",
        "translation": "They left their swords and sticks outside the monastery and went inside to greet them.",
        "source": "T22n1428_053:0961a25_2"
    },
    {
        "source_sentence": "時六群比丘出外，輒乘彼象馬車乘、輦輿、捉持刀劍共戲。",
        "translation": "When six groups of monks came out from the outside, they would often ride in that elephant-horse chariot, carriage, mules, and carts carrying swords and swords to play together.",
        "source": "T22n1428_053:0961a26_3"
    },
    {
        "source_sentence": "時諸居士見皆共譏嫌言：「沙門釋子不知厭足無有慚愧，乃乘彼象馬車乘捉持刀劍共戲，猶如國王大臣。」",
        "translation": "When the monks saw him, they all criticized him and said, The ascetic or Śākyamuni doesn't know he's satisfied and has no shame, so he rides in that elephant-horse chariot to play with them, holding swords and swords like a king's minister.",
        "source": "T22n1428_053:0961a28_0"
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「比丘不應乘象馬車乘、輦輿而共戲笑，比丘亦不應捉持刀劍。」",
        "translation": "The monks said to the Buddha, who said, A monk shouldn't ride an elephant, horse cart, chariot, or carriage and laugh together, and a monk shouldn't hold a sword or sword.",
        "source": "T22n1428_053:0961b01_1"
    },
    {
        "source_sentence": "時諸上座老病比丘，不能從此住處至彼處，畏慎不敢騎乘，佛言：「聽乘步挽車。",
        "translation": "The elderly and sick monks of the superior seat then couldn't go from this place to another place, and they feared being cautious and didn't dare to ride it.",
        "source": "T22n1428_053:0961b03_2"
    },
    {
        "source_sentence": "若男子乘，一切畜生乘亦男。」",
        "translation": "If it's a man's vehicle, all the animal vehicles are also men.",
        "source": "T22n1428_053:0961b05_3"
    },
    {
        "source_sentence": "彼有命難、淨行難，畏慎不敢騎乘避走，佛言：「若有如是難，聽乘象馬避。」",
        "translation": "If someone has difficulty with life and difficulty with pure practice, they're afraid and cautious and don't dare to ride or run away from them, and the Buddha says, If there's such a difficulty, listen to riding an elephant or horse to avoid it.",
        "source": "T22n1428_053:0961b06_4"
    },
    {
        "source_sentence": "時諸白衣持刀劍來寄諸比丘藏，比丘畏慎不敢受，世尊有如是教不聽持刀劍。",
        "translation": "The white robes then came with swords and swords to the monks' treasury, and the monks were frightened and didn't dare to accept them; the Bhagavān had thus instructed them not to listen to those who held swords and swords.",
        "source": "T22n1428_053:0961b07_5"
    },
    {
        "source_sentence": "白佛，佛言：「聽為檀越牢堅故藏舉。」",
        "translation": "He said to the Buddha, who said, Listen, for the sake of the donor's firmness, he stored it up.",
        "source": "T22n1428_053:0961b09_6"
    },
    {
        "source_sentence": "爾時世尊在拘睒彌國。",
        "translation": "It was then that the Bhagavān was in Kauśāmbī.",
        "source": "T22n1428_053:0961b11_0"
    },
    {
        "source_sentence": "王憂陀延是賓頭盧親厚知識，王朝晡常往問訊。",
        "translation": "King Udāyana was a close friend of Piṇḍola, and the king's court always went to him to exchange greetings.",
        "source": "T22n1428_053:0961b11_1"
    },
    {
        "source_sentence": "時有不信樂婆羅門大臣從王，白王言：「云何大王朝晡問訊，此下賤業人而見王不起？」",
        "translation": "A minister who didn't believe in the pleasures of the Brāhmaṇa followed the king and said to the king, How did the great king come to this court to exchange greetings with a lowly worker who saw the king not rising?",
        "source": "T22n1428_053:0961b12_2"
    },
    {
        "source_sentence": "王即報言：「明日清旦當往，若故不起當奪其命。」",
        "translation": "The king then reported, Tomorrow morning, he'll go there, and if he doesn't get up for that reason, he'll take his life.",
        "source": "T22n1428_053:0961b14_3"
    },
    {
        "source_sentence": "王明日清旦便往賓頭盧所，遙見王來便作是念：「此王今懷惡心來，若我不起當奪我命。",
        "translation": "The next morning the king went to Piṇḍola. Seeing the king approaching him from a distance, he thought: This king is coming with an evil intention. If I do not rise, he will take my life.",
        "source": "T22n1428_053:0961b15_4"
    },
    {
        "source_sentence": "我今若起彼失王位，若我不起當奪我命而墮地獄。",
        "translation": "If I now arise, they'll lose their kingship, and if I don't arise, they'll take my life and fall into hell.",
        "source": "T22n1428_053:0961b18_5"
    },
    {
        "source_sentence": "令此王墮地獄耶？",
        "translation": "Did you cause this king to fall into hell?",
        "source": "T22n1428_053:0961b19_6"
    },
    {
        "source_sentence": "失王位耶？」",
        "translation": "Is it a loss of the king's position?",
        "source": "T22n1428_053:0961b19_7"
    },
    {
        "source_sentence": "尋復念言：「寧令失位，不可令墮地獄。」",
        "translation": "Again, he thought, I'd rather let you lose your position than let you fall into hell.",
        "source": "T22n1428_053:0961b20_8"
    },
    {
        "source_sentence": "即便起遠迎，先意問訊言：「善來大王！」",
        "translation": "He rose up from his seat and greeted him from a distance, intending to greet him, saying, Welcome, great king!",
        "source": "T22n1428_053:0961b21_0"
    },
    {
        "source_sentence": "王問言：「汝今何故起迎我耶？」",
        "translation": "The king asked, Why are you standing up to greet me now?",
        "source": "T22n1428_053:0961b21_1"
    },
    {
        "source_sentence": "答言：「為汝故起。」",
        "translation": "He replied, It's for your sake that it arises.",
        "source": "T22n1428_053:0961b22_2"
    },
    {
        "source_sentence": "王言：「昨日何故不起？」",
        "translation": "The king said, Why didn't you get up yesterday?",
        "source": "T22n1428_053:0961b22_3"
    },
    {
        "source_sentence": "答言：「亦為汝故。」",
        "translation": "He replied, It's also for your sake.",
        "source": "T22n1428_053:0961b23_4"
    },
    {
        "source_sentence": "王問言：「云何為我耶？」",
        "translation": "The king asked, What's for me?",
        "source": "T22n1428_053:0961b23_5"
    },
    {
        "source_sentence": "答言：「汝昨日善心來，今日懷惡心來。",
        "translation": "He replied, Yesterday you came with good intentions, and today you've come with bad intentions.",
        "source": "T22n1428_053:0961b24_6"
    },
    {
        "source_sentence": "若我不起當奪我命，若奪我命必墮地獄。",
        "translation": "If I don't arise, they'll take my life, and if they take my life, they'll surely fall into hell.",
        "source": "T22n1428_053:0961b25_7"
    },
    {
        "source_sentence": "我念言：『此王持惡心來，若我不起當奪我命，若我起者必失王位。",
        "translation": "I thought to myself, “This king is coming with evil intentions. If I do not arise, he will take my life. If I do so, I will surely lose the throne of kingship.",
        "source": "T22n1428_053:0961b26_8"
    },
    {
        "source_sentence": "若奪我命必墮地獄，寧當令失王位，不令墮地獄。』",
        "translation": "If you take my life, you'll surely fall into hell; rather than let me lose my kingship, I won't fall into hell.'",
        "source": "T22n1428_053:0961b27_9"
    },
    {
        "source_sentence": "是故起耳。」",
        "translation": "That's why it arises.",
        "source": "T22n1428_053:0961b29_0"
    },
    {
        "source_sentence": "王問言：「我當失位耶？」",
        "translation": "The king asked, Will I lose my position?",
        "source": "T22n1428_053:0961b29_1"
    },
    {
        "source_sentence": "答言：「失。」",
        "translation": "He replied, That's wrong.",
        "source": "T22n1428_053:0961b29_2"
    },
    {
        "source_sentence": "王復問言：「幾日當失？」",
        "translation": "The king again asked, How many days will it be lost?",
        "source": "T22n1428_053:0961b29_3"
    },
    {
        "source_sentence": "答言：「却後七日。」",
        "translation": "He replied, Seven days from now.",
        "source": "T22n1428_053:0961c01_4"
    },
    {
        "source_sentence": "時王即還拘睒彌，修治城塹，收檢穀食柴薪，聚集軍眾守城警備。",
        "translation": "The king then returned to Kauśāmbī, repaired the moats of the city, collected grain and firewood, gathered his troops, and guarded the city with alertness.",
        "source": "T22n1428_053:0961c01_5"
    },
    {
        "source_sentence": "數日過言：「今日是初日。」",
        "translation": "Several days later, he said, Today is the first day.",
        "source": "T22n1428_053:0961c03_6"
    },
    {
        "source_sentence": "如是乃至七日，作如是言：「沙門語虛。」",
        "translation": "For seven days after this, he said, The ascetic speaks falsely.",
        "source": "T22n1428_053:0961c04_0"
    },
    {
        "source_sentence": "便與諸婇女在恒水中乘船遊戲。",
        "translation": "He then joined the courtesans and women in the Ganges River to board a boat and play.",
        "source": "T22n1428_053:0961c04_1"
    },
    {
        "source_sentence": "時慰禪王國內七年不雨，彼聞摩竭國王瓶沙有出水珠，若出此珠天即降雨，彼便興四部兵往王舍城圍城而住。",
        "translation": "When it didn't rain for seven years in the kingdom of King Kauṣṭhila, he heard that the king of Magadha had a water pearl coming out of the vial and sands, and if this pearl came out, rain would fall. He then gathered his four armies to go to the city of Rājagṛha and surrounded it and stayed there.",
        "source": "T22n1428_053:0961c05_2"
    },
    {
        "source_sentence": "彼城牢固，非餘方便可得，唯水穀飲食盡，乃可得耳。",
        "translation": "The city is strong and cannot be obtained by any other means but by the exhaustion of water, grain, or food and drink.",
        "source": "T22n1428_053:0961c08_3"
    },
    {
        "source_sentence": "時城內有多方便智慧大臣，教以竹葦著池中，令眾蓮花在孔中生出竹上。",
        "translation": "At the time, there were many ministers of skillful means and wisdom in the city who taught them to put bamboo reeds in the pond and cause lotus flowers to grow on top of the bamboo in the hole.",
        "source": "T22n1428_053:0961c09_4"
    },
    {
        "source_sentence": "時彼大臣至瓶沙王所白言：「王今知不？",
        "translation": "The minister then went to the king of Vaiśravaṇa and said, Does the king know now?",
        "source": "T22n1428_053:0961c11_5"
    },
    {
        "source_sentence": "王舍城牢固，非餘方便可得，唯水穀盡乃可得耳。",
        "translation": "The royal residence is strong and cannot be obtained by any other means but by the exhaustion of water and grain.",
        "source": "T22n1428_053:0961c12_6"
    },
    {
        "source_sentence": "今應遣人語波羅殊提王如是言：『今可且停！",
        "translation": "Now, you should send someone to the king of Rāṣṭrapāla and say, 'Now, stop!'",
        "source": "T22n1428_053:0961c13_7"
    },
    {
        "source_sentence": "不須象馬車乘刀劍共鬪。",
        "translation": "They don't need elephants, horses, chariots, carriages, swords, and swords to fight together.",
        "source": "T22n1428_053:0961c14_8"
    },
    {
        "source_sentence": "汝今可用眾華優鉢羅、鉢頭摩、拘頭摩、分陀利華共鬪，我亦當以如是華共鬪。",
        "translation": "Now, you can fight with the flowers utpala, padma, kumuda, and puṇḍarīka, and I will also fight with such flowers.",
        "source": "T22n1428_053:0961c15_9"
    },
    {
        "source_sentence": "汝復可作飯摶相打共鬪，我亦作飯摶共鬪。』」",
        "translation": "You can also make a rice bowl and fight with each other, and I'll make a rice bowl and fight with you.'",
        "source": "T22n1428_053:0961c17_10"
    },
    {
        "source_sentence": "王言：「可爾。」",
        "translation": "The king said, That's right.",
        "source": "T22n1428_053:0961c18_11"
    },
    {
        "source_sentence": "時即遣使，往波羅殊提王所，具說上言。",
        "translation": "He then sent an envoy to the king of Vārāṣṭhī and explained the above.",
        "source": "T22n1428_053:0961c18_12"
    },
    {
        "source_sentence": "彼作是念：「王舍城牢固，唯有水穀飲食盡乃可得，而城內水穀飲食豐多。」",
        "translation": "They thought, The city of the king's house is strong, and there's plenty of water, grain, food, and drink in the city.",
        "source": "T22n1428_053:0961c19_13"
    },
    {
        "source_sentence": "彼即報使言：「我不為城故來，我國內七年不雨，聞汝國中有水珠，若出此珠時天即降雨，以是故來。」",
        "translation": "He then reported to the messenger, saying, I didn't come for the sake of the city; it doesn't rain in my country for seven years, and I heard that there's a water pearl in your country; if this pearl comes out, the gods will send down rain because of this.",
        "source": "T22n1428_053:0961c21_14"
    },
    {
        "source_sentence": "使答言：「大王！",
        "translation": "The envoy replied, Great king!",
        "source": "T22n1428_053:0961c23_15"
    },
    {
        "source_sentence": "初時何不言須珠？",
        "translation": "Why didn't he say it needed the pearl at the beginning?",
        "source": "T22n1428_053:0961c23_16"
    },
    {
        "source_sentence": "若言須珠，我即當與。",
        "translation": "If you say you need a pearl, I will give it to you.",
        "source": "T22n1428_053:0961c24_17"
    },
    {
        "source_sentence": "王今可去，尋當送珠。」",
        "translation": "The king may now go, and he'll send the pearl.",
        "source": "T22n1428_053:0961c24_18"
    },
    {
        "source_sentence": "王即還軍向拘睒彌國。",
        "translation": "The king then returned his army to the country of Kauśāmbī.",
        "source": "T22n1428_053:0961c25_19"
    },
    {
        "source_sentence": "彼聞王憂陀延與婇女遊戲聲，即問傍人言：「戲聲是何人？」",
        "translation": "When he heard the sound of King Udayana playing with a promiscuous woman, he asked the bystanders, Who's that playful sound?",
        "source": "T22n1428_053:0961c25_20"
    },
    {
        "source_sentence": "傍臣答言：「大王知不？",
        "translation": "The attendant ministers replied, Does the king know?",
        "source": "T22n1428_053:0961c27_21"
    },
    {
        "source_sentence": "王憂陀延與諸婇女乘船遊戲於恒水中，是彼戲聲。」",
        "translation": "The king Udayana and his court ladies boarded the boat and played in the water of the Ganges, which is their playful sound.",
        "source": "T22n1428_053:0961c27_22"
    },
    {
        "source_sentence": "王即勅傍人勿作聲，放象於恒水邊，彼即放第一白象藏守象人。",
        "translation": "The king then instructed the attendants not to make a noise and released the elephant at the edge of the Ganges River, and they released the first white elephant treasured by the elephant guardian.",
        "source": "T22n1428_053:0961c29_23"
    },
    {
        "source_sentence": "時王憂陀延大臣出見白象，白王言：「有野象。」",
        "translation": "When the king's minister Udayana saw a white elephant, he said to the king, There's a wild elephant.",
        "source": "T22n1428_053:0962a01_24"
    },
    {
        "source_sentence": "王即勅人言：「勿作聲牽船近岸。」",
        "translation": "The king then commanded the man, Don't make a noise and pull the boat near the shore.",
        "source": "T22n1428_053:0962a02_25"
    },
    {
        "source_sentence": "彼即近岸。",
        "translation": "He's near the shore.",
        "source": "T22n1428_053:0962a03_26"
    },
    {
        "source_sentence": "王憂陀延善知調象法術，即誦術彈琴往前取象。",
        "translation": "Knowing the method of taming the elephant well, King Udāyana recited the teaching and played the lute to go before him to fetch the elephant.",
        "source": "T22n1428_053:0962a03_27"
    },
    {
        "source_sentence": "時守象人即便捉王，王甚恐怖。",
        "translation": "The elephant guards then captured the king, and the king was terrified.",
        "source": "T22n1428_053:0962a04_28"
    },
    {
        "source_sentence": "彼問王言：「怖耶？」",
        "translation": "They asked the king, Are you afraid?",
        "source": "T22n1428_053:0962a05_29"
    },
    {
        "source_sentence": "王言：「我怖。」",
        "translation": "The king said, I'm afraid.",
        "source": "T22n1428_053:0962a06_0"
    },
    {
        "source_sentence": "彼言：「王勿怖。",
        "translation": "They said, Don't be afraid, king.",
        "source": "T22n1428_053:0962a06_1"
    },
    {
        "source_sentence": "波羅殊提王喚王。」",
        "translation": "The king of Vārāṇasī called the king.",
        "source": "T22n1428_053:0962a06_2"
    },
    {
        "source_sentence": "王更恐怖念言：「波羅殊提將無殺我并及侍從耶？」",
        "translation": "The king became even more frightened and thought, Wouldn't Vārāṣṭi kill me and my attendants?",
        "source": "T22n1428_053:0962a07_0"
    },
    {
        "source_sentence": "即便繫之，衛送往波羅殊提王所。",
        "translation": "He then tied him up and escorted him to the palace of King Prajñā Jyotipāla.",
        "source": "T22n1428_053:0962a08_1"
    },
    {
        "source_sentence": "問言：「汝怖耶？」",
        "translation": "He asked, Are you afraid?",
        "source": "T22n1428_053:0962a09_0"
    },
    {
        "source_sentence": "答言：「怖。」",
        "translation": "He replied, Fearful.",
        "source": "T22n1428_053:0962a09_1"
    },
    {
        "source_sentence": "王言：「勿怖！",
        "translation": "The king said, Don't be afraid!",
        "source": "T22n1428_053:0962a09_2"
    },
    {
        "source_sentence": "汝可教我兒瞿波羅調象術，并教我女彈琴。」",
        "translation": "You may teach my son, Gopalā, the method of taming elephants, and you may teach my daughter to play the lute.",
        "source": "T22n1428_053:0962a09_3"
    },
    {
        "source_sentence": "彼將至慰禪國七年中鎖脚。",
        "translation": "He was about to go to the country of Xiao Chan in the seventh year and locked his feet.",
        "source": "T22n1428_053:0962a10_4"
    },
    {
        "source_sentence": "時跋難陀釋子，從拘睒彌奢彌跋提夫人所，來至慰禪國憂陀延所，持王憂陀延信往夫人所。",
        "translation": "The Śākyamuni Upananda then came from the residence of Lady Kauṇḍinya and went to Udayana in the country of Kuśinagara, where he stayed at the lady's house.",
        "source": "T22n1428_053:0962a11_5"
    },
    {
        "source_sentence": "諸比丘白佛，佛言：「比丘不應為白衣作使，若作突吉羅。」",
        "translation": "The monks said to the Buddha, and he said, A monk shouldn't make an envoy for a white-robed man; if he makes a tukhāra.",
        "source": "T22n1428_053:0962a13_6"
    },
    {
        "source_sentence": "時彼教王兒調象術，教女彈琴。",
        "translation": "He then taught the king's boy to tame the elephant, and he taught his daughter to play the lute.",
        "source": "T22n1428_053:0962a15_7"
    },
    {
        "source_sentence": "後於異時遂與王女共通。",
        "translation": "Later, at another time, he shared it with the king's daughter.",
        "source": "T22n1428_053:0962a15_8"
    },
    {
        "source_sentence": "拘波羅王子知之，彼作是念：「若我白王必奪其命。",
        "translation": "Knowing this, the prince of Kapilavastu thought, If I tell the king, I'll surely snatch his life.",
        "source": "T22n1428_053:0962a16_9"
    },
    {
        "source_sentence": "彼是我師，教我辛苦。",
        "translation": "That's my teacher, and he teaches me hardship.",
        "source": "T22n1428_053:0962a17_10"
    },
    {
        "source_sentence": "此是王女，彼是王，得應爾耳。」",
        "translation": "This is the king's daughter, and that's the king who should have done so.",
        "source": "T22n1428_053:0962a18_11"
    },
    {
        "source_sentence": "即覆藏不語人。",
        "translation": "That is, he covers up the store and doesn't speak to people.",
        "source": "T22n1428_053:0962a18_12"
    },
    {
        "source_sentence": "後王憂陀延欲逃走，即自嚴疾行牸象。",
        "translation": "Later, King Udayana wanted to run away, so he prepared himself and quickly fled in an eunuch's carriage.",
        "source": "T22n1428_053:0962a19_13"
    },
    {
        "source_sentence": "拘婆羅知之，便作是念：「彼自嚴疾行象，必欲逃走。",
        "translation": "Knowing this, Kumārajīva thought:",
        "source": "T22n1428_053:0962a20_14"
    },
    {
        "source_sentence": "若我白王必奪其命，此是我師，教我辛苦。」",
        "translation": "If I tell the king that I'll surely snatch his life, this is my teacher who teaches me to suffer.",
        "source": "T22n1428_053:0962a21_15"
    },
    {
        "source_sentence": "遂藏不語人。",
        "translation": "He then stored it away and didn't tell anyone.",
        "source": "T22n1428_053:0962a22_16"
    },
    {
        "source_sentence": "彼安王女置象上，於象上飲，失琉璃器，未至地頃，已從慰禪至拘睒彌國。",
        "translation": "Ānanda, the king’s queen, lying on an elephant, took a drink from that elephant and lost her lapis lazuli vessel. Soon after reaching the ground, she left Siṃhala and went to Kauśāmbī.",
        "source": "T22n1428_053:0962a22_17"
    },
    {
        "source_sentence": "王即至奢彌跋提夫人所，語如是言：「我在彼繫時誓言：『當供養八婆羅門一切所須皆令具足。』",
        "translation": "The king then went to Lady Śrāmaṇerī and said, When I was bound there, I made a vow, 'I will make offerings to the eight brāhmaṇas so that they'll be supplied with everything they need.'",
        "source": "T22n1428_053:0962a24_18"
    },
    {
        "source_sentence": "今欲與之，便可辦具。」",
        "translation": "Now, if you want to give it to him, you can prepare the necessary provisions.",
        "source": "T22n1428_053:0962a26_19"
    },
    {
        "source_sentence": "夫人言：「若如是者，諸象馬車金銀七寶王及我身一切，當盡如許所有并與一人，彼亦都受猶無厭足。」",
        "translation": "The lady said, If that's the case, then all the elephants, horses, chariots, gold, silver, seven-jeweled kings, and my body will be given to one person as much as they allow, and they'll also receive it without tire.",
        "source": "T22n1428_053:0962a27_20"
    },
    {
        "source_sentence": "王言：「今當云何？」",
        "translation": "The king said, What will it be now?",
        "source": "T22n1428_053:0962a29_21"
    },
    {
        "source_sentence": "夫人言：「此摩訶迦旃延，是大婆羅門種。",
        "translation": "The lady said, This Mahākātyāyana is a great brāhmaṇa.",
        "source": "T22n1428_053:0962b01_22"
    },
    {
        "source_sentence": "今可請之并更請餘七婆羅門種比丘，以王如許供具與此八人。",
        "translation": "Now, you can invite them and the other seven brāhmaṇa bhikṣus to be invited, and give these eight people the offerings given to them by the king as he approves.",
        "source": "T22n1428_053:0962b02_23"
    },
    {
        "source_sentence": "彼法不受，若與亦不受。」",
        "translation": "They won't accept that teaching, and if they give it to them, they won't accept it either.",
        "source": "T22n1428_053:0962b03_24"
    },
    {
        "source_sentence": "王言：「可爾。」",
        "translation": "The king said, That's right.",
        "source": "T22n1428_053:0962b04_25"
    },
    {
        "source_sentence": "時王憂陀延即往迦旃延所，頭面禮足却坐一面，時迦旃延種種方便為王說法令得歡喜。",
        "translation": "King Udāyana then went to Kātyāyana, bowed his head and feet, and withdrew to sit at one side.",
        "source": "T22n1428_053:0962b04_26"
    },
    {
        "source_sentence": "時王聞法歡喜已，白如是言：「願受我明日請食，通已八人。」",
        "translation": "After hearing the teaching, the king rejoiced and said, Please accept my invitation to eat tomorrow, for which eight people have already been invited.",
        "source": "T22n1428_053:0962b06_27"
    },
    {
        "source_sentence": "時迦旃延默然受之。",
        "translation": "Kātyāyana then accepted it in silence.",
        "source": "T22n1428_053:0962b07_28"
    },
    {
        "source_sentence": "時王見迦旃延默然受請已，從座起頭面禮足歡喜而去。",
        "translation": "Seeing Kātyāyana, the king then remained silent and accepted the invitation, rose from his seat, bowed his head and feet, rejoiced, and departed.",
        "source": "T22n1428_053:0962b08_29"
    },
    {
        "source_sentence": "王還其家辦種種多美飲食，明日清旦往白時至。",
        "translation": "The king returned to his home and prepared a variety of delicious foods and drinks, and arrived at dawn the next morning.",
        "source": "T22n1428_053:0962b09_30"
    },
    {
        "source_sentence": "時大迦旃延，清旦著衣持鉢，通已八人，往王憂陀延宮敷座而坐。",
        "translation": "At dawn, Mahākātyāyana, dressed in his robes and with his bowl in hand, accompanied by eight attendants, went to the palace of King Udayana to spread out his seat and took his seat.",
        "source": "T22n1428_053:0962b10_31"
    },
    {
        "source_sentence": "王憂陀延手自斟酌種種多美飲食令得飽足，食已捨鉢，取金瓶盛水授之，以象布施。",
        "translation": "King Udāyana prepared various delicious foods to satisfy the hungry, and after he had eaten them, he forgot his bowl, took a golden pot, filled water with water, and gave it to him as an elephant gift.",
        "source": "T22n1428_053:0962b12_32"
    },
    {
        "source_sentence": "迦旃延言：「止！",
        "translation": "Kātyāyana said, Stop!",
        "source": "T22n1428_053:0962b14_33"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T22n1428_053:0962b14_34"
    },
    {
        "source_sentence": "王此便為供養已，我等不應受如是供養。」",
        "translation": "After making this offering, the king will then make an offering, and we won't accept such an offering.",
        "source": "T22n1428_053:0962b14_35"
    },
    {
        "source_sentence": "復以車馬人兼金銀、琉璃、頗梨、真珠、車璩、馬瑙七寶布施，迦旃延言：「止！",
        "translation": "Again, he gave a gift of the seven treasures of gold, silver, lapis lazuli, pāri, genuine pearl, chariothorse, and horse agate to Kātyāyana, saying, Stop!",
        "source": "T22n1428_053:0962b15_36"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T22n1428_053:0962b17_37"
    },
    {
        "source_sentence": "此便為供養，我等不應受如是供養。」",
        "translation": "This is an offering, and we shouldn't accept such an offering.",
        "source": "T22n1428_053:0962b17_38"
    },
    {
        "source_sentence": "時王憂陀延即禮迦旃延足已，更取卑床坐。",
        "translation": "King Udāyana then bowed his head at Kātyāyana's feet and took a humble seat.",
        "source": "T22n1428_053:0962b18_39"
    },
    {
        "source_sentence": "時迦旃延，種種為王說法，令得歡喜已，從坐起而去，還寺內白諸比丘。",
        "translation": "Kātyāyana then taught the king a variety of teachings to make him rejoice, rose from his seat, departed, returned inside the monastery, and told the monks.",
        "source": "T22n1428_053:0962b19_40"
    },
    {
        "source_sentence": "諸比丘白佛。",
        "translation": "The monks said to the Buddha,",
        "source": "T22n1428_053:0962b21_41"
    },
    {
        "source_sentence": "佛爾時以此因緣集比丘僧，為諸比丘說大小持戒揵度：「如來出世，應供、正遍知、明行足、為善逝、世間解、無上士、調御丈夫、天人師、佛、世尊，於一切諸天、世人、沙門、婆羅門、天魔、梵王，眾中而自覺悟證知為人說法。",
        "translation": "It was then that the Buddha gathered the monks and saṃgha for this reason and taught the great and small bhikṣus to observe precepts and disciplines, saying, When the Tathāgata appears in the world, he should make offerings, correctly pervade them, understand their fulfillment with insight and practice, become a Well-gone One, understand the world, be unsurpassed in understanding, tame men,",
        "source": "T22n1428_053:0962b21_42"
    },
    {
        "source_sentence": "初語亦善、中語亦善、下語亦善，文義具足開顯淨行。",
        "translation": "The first words are also good in the beginning, the middle words are also good in the middle, and the second words are also good in the lower words, with their meanings fully revealing pure practices.",
        "source": "T22n1428_053:0962b26_43"
    },
    {
        "source_sentence": "若居士居士子聞，若復餘種姓生者，彼聞正法便生信樂。",
        "translation": "If a householder or layman hears it, and if another family gives rise to it, they hear the right teaching and then become faithful and happy.",
        "source": "T22n1428_053:0962b27_44"
    },
    {
        "source_sentence": "以信樂心而作是念：『我今在居家妻子繫縛，不得純修梵行。",
        "translation": "With faith and happiness, he thought, 'Now that I'm bound by my wife and children at home, I won't be allowed to purely cultivate the religious practice.",
        "source": "T22n1428_053:0962b29_45"
    },
    {
        "source_sentence": "我今寧可剃除鬚髮、披袈裟，以信捨家入非家道。』",
        "translation": "Now, I'd better shave my hair and beard and put on my reddish-brown robes so that I can leave home with faith and enter the path of what's not home.'",
        "source": "T22n1428_053:0962c01_46"
    },
    {
        "source_sentence": "彼於異時，錢財若多、若少皆悉捨棄，親屬若多、若少皆亦捨離，剃除鬚髮、披袈裟，捨家入非家道。",
        "translation": "When it's different, they abandon their money and possessions whether large or small, abandon their relatives if large or small, shave off their hair, put on their reddish-brown robes, leave home, and enter the path that's not a home.",
        "source": "T22n1428_053:0962c02_47"
    },
    {
        "source_sentence": "彼與出家人同除捨飾好，與諸比丘同戒，不殺生放捨刀杖，常有慚愧慈念眾生，是為不殺生。",
        "translation": "They share the same removal and abandonment of decorations with renunciants, share the same precepts as monks, don't kill sentient beings, abandon their swords and sticks, and always have shame and a sense of shame and pity for sentient beings.",
        "source": "T22n1428_053:0962c05_48"
    },
    {
        "source_sentence": "捨偷盜，與便取、不與不取，其心清淨無有盜意，是為不偷盜。",
        "translation": "He abandons stealing, takes what is given and doesn't take what isn't given, and his mind is pure and has no intention of stealing; this is called not stealing.",
        "source": "T22n1428_053:0962c07_49"
    },
    {
        "source_sentence": "捨婬不淨行，修梵行勤精進，不著欲愛，清淨香潔而住，是為捨婬不淨行。",
        "translation": "He abandons coarse and impure behavior, cultivates religious practice with diligence and zeal, doesn’t cling to sensual desires, and abides in a pure and fragrant state. This is called abandoning coarse and impure behavior.",
        "source": "T22n1428_053:0962c08_50"
    },
    {
        "source_sentence": "捨妄語，如實不欺詐於世，是為不妄語。",
        "translation": "Rejecting false speech and not deceiving the world as it really is, this is called not speaking falsely.",
        "source": "T22n1428_053:0962c10_51"
    },
    {
        "source_sentence": "捨兩舌，若聞此語不傳至彼，若聞彼語不傳至此，不相壞亂。",
        "translation": "If they abandon duplicitous speech, if they hear this teaching and don't transmit it to them, or if they hear that teaching and don't transmit it to them, they won't be in disarray.",
        "source": "T22n1428_053:0962c11_52"
    },
    {
        "source_sentence": "若有離別善為和合，和合親愛常令歡喜，出和合言所說知時，是為不兩舌。",
        "translation": "If there's separation from distinctive goodness as a combination, harmony and affection that always makes them rejoice, and when he produces words that are combined and explained in terms of knowing, this is called not being divisive.",
        "source": "T22n1428_053:0962c13_53"
    },
    {
        "source_sentence": "離麁惡言，所言麁獷苦惱他人，令生瞋恚而不喜樂，斷除如是麁惡言，言則柔軟，不生怨害，能作利益，眾人愛樂，樂聞其言，常出如是利益善言，是為不麁惡言。",
        "translation": "Being free of harsh words, speaking harshly and harshly, inflicting anger upon others and causing them to become angry but not delighted, stops harsh words like this. When he speaks these words, he is gentle and doesn’t give rise to feelings of enmity or resentment. He can work for the benefit of others. People love his words and are happy to hear their words",
        "source": "T22n1428_053:0962c15_0"
    },
    {
        "source_sentence": "離無利益語，知時語、實語、利益語、法語、律語、滅諍語，有緣而說，所言知時，是為離無利益語。",
        "translation": "Being free of unbeneficial speech, he knows the words of the time, the words of reality, the words of benefit, the words of benefit, the words of the Dharma, the words of the vinaya, and the words to extinguish anger, and speaks them with perceptual objects. This is called being free of unbeneficial speech when he knows what he says.",
        "source": "T22n1428_053:0962c18_1"
    },
    {
        "source_sentence": "不飲酒離放逸處。",
        "translation": "He doesn't drink alcohol and parts with the place of carelessness.",
        "source": "T22n1428_053:0962c20_2"
    },
    {
        "source_sentence": "不著華香瓔珞，不歌舞倡伎亦不往觀聽，不高廣床上坐，非時不食。",
        "translation": "They don't wear flowers, fragrant necklaces, songs, dances, and tricks, don't go out to listen, don't sit on a high or wide bed, and don't eat at an ungodly hour.",
        "source": "T22n1428_053:0962c21_3"
    },
    {
        "source_sentence": "若是一食，不把持金銀七寶，不取妻妾童女，不畜養奴婢、象馬、車乘、鷄狗、猪羊、田宅、園觀、儲積畜養一切諸物，不欺詐輕秤小斗，不合和惡物，不治生販賣，斷他肢節殺害繫閉，斷他錢財役使作業。",
        "translation": "If this is a single meal, they don't carry the seven treasures of gold and silver, don't take wives, concubines, or girls, don't store up slaves, elephants, horses, chariots, chickens, dogs, pigs, sheep, homes, gardens, parks, stockpiles, animals, all kinds of things, don't fraudulently cheat",
        "source": "T22n1428_053:0962c23_0"
    },
    {
        "source_sentence": "言輒虛詐發起諍訟，棄捨他人，斷除如是諸不善事。",
        "translation": "They often speak falsely and give rise to arguments, abandon others, and stop such unwholesome things.",
        "source": "T22n1428_053:0962c27_1"
    },
    {
        "source_sentence": "行則知時、非時不行，量腹而食、度身而衣，取足而已。",
        "translation": "When he walks, he knows when it's the right time and doesn't do so when it's not the right time, eating with his belly and clothing with his body measured, and simply taking his feet.",
        "source": "T22n1428_053:0962c28_2"
    },
    {
        "source_sentence": "衣鉢自隨，猶若飛鳥羽翮身俱。",
        "translation": "Their robes and bowls follow them on their own, just as if they were flying with a bird's flapping feathers around their bodies.",
        "source": "T22n1428_053:0963a01_3"
    },
    {
        "source_sentence": "比丘如是所去之處，衣鉢隨身。",
        "translation": "Where the monk thus departed, his robe and bowl were carried along with him.",
        "source": "T22n1428_053:0963a01_4"
    },
    {
        "source_sentence": "如餘沙門婆羅門受他信施，求種種餘積飲食、衣服、香味觸法；",
        "translation": "“Other śramaṇas and brāhmaṇas, having received charity from their devotees, seek various other kinds of food, clothing, odor, taste, and tactile sensation that they have accumulated.",
        "source": "T22n1428_053:0963a02_5"
    },
    {
        "source_sentence": "離如是無厭足事。",
        "translation": "He's free of such unsatisfied things.",
        "source": "T22n1428_053:0963a04_6"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，聚集種子種殖樹木鬼神村；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on their devotees’ charity, collected seeds and planted trees in the villages of ghosts and spirits.",
        "source": "T22n1428_053:0963a04_7"
    },
    {
        "source_sentence": "離如是事。",
        "translation": "They're free of such things.",
        "source": "T22n1428_053:0963a05_8"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施。",
        "translation": "It's like the other ascetics and priests who eat others' faithful gifts.",
        "source": "T22n1428_053:0963a06_9"
    },
    {
        "source_sentence": "但作方便求諸利養，象牙雜寶高廣大床，種種文繡被褥，及與雜色諸皮；",
        "translation": "They simply made expedient offerings, such as ivory, mixed jewels, high and wide beds, embroidered mattresses in various colors, and variegated colored leather.",
        "source": "T22n1428_053:0963a06_10"
    },
    {
        "source_sentence": "離如是利養法。",
        "translation": "He's free of such a method of benefiting and nurturing.",
        "source": "T22n1428_053:0963a08_11"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，但作方便求自嚴身，酥油摩身、香水洗浴，以香塗身香澤梳頭，著好華鬘染眼紺色，種種莊嚴面首，色綖繫臂捉通中杖，執持刀劍并孔雀蓋，以珠為扇以鏡自照。",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, simply seek to adorn themselves with skillful means. They rub their bodies with ghee, bathe them in scented water, apply scented ointments to their bodies, cover their hair with perfumed hair dyed with fragrant hair combs, wear beautiful flower garlands, dye their",
        "source": "T22n1428_053:0963a08_12"
    },
    {
        "source_sentence": "著雜色革屣，著純白衣；",
        "translation": "They wore leather sandals of various colors and dressed in white clothes.",
        "source": "T22n1428_053:0963a13_13"
    },
    {
        "source_sentence": "能離如是莊嚴之事。",
        "translation": "He's able to part with such an adorned thing.",
        "source": "T22n1428_053:0963a14_14"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，專為嬉戲，棊局、博掩、樗蒱、八道、十道、或復拍石；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in various forms of playfulness such as chess, boxing, gambling, bowling, wickedness, the eightfold paths, the ten directions, and sometimes hitting rocks.",
        "source": "T22n1428_053:0963a14_15"
    },
    {
        "source_sentence": "斷除如是種種嬉戲。",
        "translation": "He stops these kinds of playfulness.",
        "source": "T22n1428_053:0963a16_16"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，但說妨道法，說王事、賊事、鬪戰軍馬事、大臣事、騎乘事、園觀出入事、臥起事、女人事、衣服飲食事、親里事、國土事、思憶世間入大海事；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on their devotees’ charity, teach instead doctrines that obstruct [the authentic path of religion] by teaching about the king’s affairs, thieves’ affairs, battles, armies, horses, ministers’ affairs, cavalrymen’s affairs, how to ride in a carriage, how to",
        "source": "T22n1428_053:0963a17_17"
    },
    {
        "source_sentence": "斷除如是一切妨道之業。",
        "translation": "He stops all these kinds of actions that obstruct the path.",
        "source": "T22n1428_053:0963a20_18"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，無數方便但作諛諂美辭，現相毀訾以利求利；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity received from their devotees, use innumerable skillful means to speak falsehoods or flattering words. They accuse each other in order to seek profit by deceitlessly disparaging one another.",
        "source": "T22n1428_053:0963a21_19"
    },
    {
        "source_sentence": "捨如是邪命諛諂。",
        "translation": "They abandon such wrong livelihood and flattery.",
        "source": "T22n1428_053:0963a23_20"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，常共講論諍言，或在園觀，若在浴池，或在講堂：『我知如是法律，汝無所知，汝趣邪道，我向正道，以前言著後。",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, often engage in arguments with each other. Some of them may stay at a pleasure park, some at a bathing pond, or they may be present in the assembly hall, saying, ‘I know this doctrine; you do not know anything about it. You have gone down a wrong path. I am",
        "source": "T22n1428_053:0963a23_21"
    },
    {
        "source_sentence": "後言著前。",
        "translation": "The latter says it's attached to the former.",
        "source": "T22n1428_053:0963a26_22"
    },
    {
        "source_sentence": "我能忍汝不能忍，我勝汝，汝但狂言，共汝論議我今得勝，能問便問。』",
        "translation": "I can tolerate it and you can't tolerate it; I'll overcome you, but you're just saying crazy things. Now that you've discussed with me, I'll be victorious, so ask questions if you can.'",
        "source": "T22n1428_053:0963a27_23"
    },
    {
        "source_sentence": "除斷如是一切諍事。",
        "translation": "He'll remove all these kinds of debilitating things.",
        "source": "T22n1428_053:0963a28_24"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，但作方便求為使命，若為王、王大臣、婆羅門、若居士通信，從此處往彼處，從彼還此，持此信往彼，持彼信來此，自作是教他作是；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees’ faith, engage in expediently seeking [the means of salvation] just to fulfill their  mission. If the king, his royal ministers, brahmans, or wealthy householders convey this message to them, going from one place to another, returning from one place to another, taking this letter back home",
        "source": "T22n1428_053:0963a29_25"
    },
    {
        "source_sentence": "能遠離如是使命事。",
        "translation": "He's able to be far removed from such a missionary task.",
        "source": "T22n1428_053:0963b04_26"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，但作種種鬪戲，或弓鬪、或刀鬪、或杖鬪、或鷄鬪、或狗鬪、或鬪猪、或鬪羖羊、或鬪羝羊、或鬪鹿、或鬪象、或鬪馬、或鬪駝、或鬪牛、或犎牛鬪、或水牛鬪、或鬪女人、或鬪男子、或鬪童男童女；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on their devotees’ charity, engage in various kinds of fighting: either with a bow, or with a sword, or with a stick, or with a fow, or with a dog, or with a pig, or with a sheep, or with a goat, or with a deer, or with a wild goat, or",
        "source": "T22n1428_053:0963b04_27"
    },
    {
        "source_sentence": "斷除如是一切嬉戲鬪事。",
        "translation": "He stops all these kinds of playful activities and fights.",
        "source": "T22n1428_053:0963b09_28"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，行妨道法邪命自活，瞻相男女好惡相，種種畜生以求利養；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in wrong livelihoods that obstruct [the authentic path of religion] and thus take up wrong livelihoods. They look at the male and female bodies with good and bad features and various kinds of animals to obtain profit and support.",
        "source": "T22n1428_053:0963b10_29"
    },
    {
        "source_sentence": "斷除如是種種妨道法。",
        "translation": "He stops these kinds of things that obstruct the path.",
        "source": "T22n1428_053:0963b12_30"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，行妨道法邪命自活，召喚鬼神或復驅遣種種厭禱；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in ignoble ways of life by learning false paths that obstruct [the authentic path of religion] and taking up wrong livelihoods for themselves. They may summon ghost spirits or drive away various kinds of detestable prayers.",
        "source": "T22n1428_053:0963b13_31"
    },
    {
        "source_sentence": "除斷如是妨道法。",
        "translation": "He'll remove such an obstruction to the path by stopping it.",
        "source": "T22n1428_053:0963b15_0"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，行妨道法邪命自活，或為人呪病、或誦惡術、或誦好呪、或治背病若為出汗、或行針治病、或治鼻或治下部病；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in ignoble ways of life by learning false paths that obstruct [the authentic path of religion] and taking up wrong livelihoods for their own sake. They may curse illnesses for others, recite evil spells, recite good spells, treat back ailments, or exhal",
        "source": "T22n1428_053:0963b15_1"
    },
    {
        "source_sentence": "除斷如是邪命妨道法。",
        "translation": "He'll remove such wrong livelihood that obstructs the path.",
        "source": "T22n1428_053:0963b18_2"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，行妨道法邪命自活，行藥療治人病或吐或下治男治女；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in ignoble ways of life that obstruct [the authentic path of religion] and thus take up wrong livelihoods for their own sake. They practice medicine to treat people’s illnesses; they may vomit it out or give it down to treat men or women.",
        "source": "T22n1428_053:0963b19_3"
    },
    {
        "source_sentence": "除斷如是妨道法。",
        "translation": "He'll remove such an obstruction to the path by stopping it.",
        "source": "T22n1428_053:0963b21_4"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，行妨道法邪命自活，或呪火、或呪行來令吉利、或誦剎利呪、或誦鳥呪、或誦枝節呪、或誦安置舍宅符呪，若火燒鼠嚙物能為解呪、或誦別死生書、或誦別夢書、或相手相肩、或誦天人問、或誦別鳥獸音聲書；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in evil ways of life that obstruct [the authentic path of religion] and thus take up wrong livelihoods for themselves. They may recite dhāraṇī spells such as fire spells, mantra spells to obtain good fortune through magic tricks, kṣatriya spells,",
        "source": "T22n1428_053:0963b21_5"
    },
    {
        "source_sentence": "除斷如是妨道法。",
        "translation": "He'll remove such an obstruction to the path by stopping it.",
        "source": "T22n1428_053:0963b27_6"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，邪命自活，瞻相天時，或言當雨、或言不雨、或言穀貴、或言穀賤、或言多病、或言少病、或言恐怖、或言安隱、或言地動、或言彗星現、或言月蝕、或言不蝕、或言日蝕、或言不蝕、或言星蝕、或言不蝕、或言月蝕有如是好報有如是惡報，日蝕星蝕亦如是；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, take up wrong livelihoods such that when they look out for the celestial bodies of other śramaṇas and brāhmaṇas, some say it is going to rain, some say it won’t rain, some say the grains are valuable, some say the grains are inferior, some",
        "source": "T22n1428_053:0963b27_7"
    },
    {
        "source_sentence": "除斷如是邪命法。",
        "translation": "He'll remove such wrong livelihood as this.",
        "source": "T22n1428_053:0963c05_8"
    },
    {
        "source_sentence": "如餘沙門婆羅門食他信施，行妨道法邪命自活，或言此國當勝彼國不如，或言彼國勝此國不如，或此勝彼不如，或言彼勝此不如，瞻如是吉凶好惡；",
        "translation": "“Other śramaṇas and brāhmaṇas, having subsisted on charity from their devotees, engage in ignoble ways of life by learning wrong paths that obstruct [the authentic path of religion] and thus taking up wrong livelihoods. They may claim that this country will be victorious or that another country won’t; they may claim that the other country will be victorious or that",
        "source": "T22n1428_053:0963c06_9"
    },
    {
        "source_sentence": "除斷如是妨道法。",
        "translation": "He'll remove such an obstruction to the path by stopping it.",
        "source": "T22n1428_053:0963c10_10"
    },
    {
        "source_sentence": "彼於此事中修集聖戒，內無所著其心安樂，眼雖視色而不取相，不為眼色所劫，眼根堅固寂然而住，無所貪欲而無憂患，不漏諸惡不善法，堅持戒品能善護眼根；",
        "translation": "They cultivate holy precepts in this regard, without attachment or attachment. Their minds are peaceful and at ease; though the eye sees form, it does not grasp its characteristics. It is not subject to the eclipse of form by the eye. The faculty of seeing remains steadfast and unmoving, with no desire or anxiety. Without covetousness they do not harm",
        "source": "T22n1428_053:0963c10_11"
    },
    {
        "source_sentence": "耳鼻舌身意亦如是。",
        "translation": "So it is with the ear, nose, tongue, body, and mind.",
        "source": "T22n1428_053:0963c14_12"
    },
    {
        "source_sentence": "於如是六觸入中善學護持調伏令得止息，猶若平地四交道頭駕象馬車乘，善調御者左執鞚右持鞭。",
        "translation": "Among these six sense-fields of touch, he well trains in guarding and taming them so that they can be calmed, just as if he were to ride an elephant or horse on a carriage at the four corners of the road on a level ground with his left hand holding a bowl and right whipping.",
        "source": "T22n1428_053:0963c15_13"
    },
    {
        "source_sentence": "善學護持、善學調伏、善學止息比丘亦如是，於六觸入中善學護持、善學調伏、善學止息，彼有如是聖戒得聖眼根，食知止足亦不貪味以養其身，而不貢高憍慢取自支身令無苦患，得修淨行，故苦消滅、新苦不生，無有增減，有力無事令身安樂。",
        "translation": "Similarly, a monk who well trains in guarding, disciplined, and calming himself is also like this. In the six sense-fields of touch, he well trains in guarding, disciplined, and calming himself; he well trains in protecting, disciplined, and calming himself. Such a monk has such noble precepts that enable him to attain the divine eye faculty [of",
        "source": "T22n1428_053:0963c17_14"
    },
    {
        "source_sentence": "猶如男子女人身患瘡，以藥塗之取令瘡差。",
        "translation": "It's like when a man or woman has a sores in their body and rubs it with medicine to make the sores heal.",
        "source": "T22n1428_053:0963c23_15"
    },
    {
        "source_sentence": "比丘食以知足，取令身安亦復如是。",
        "translation": "So it is with a monk who eats food because he knows he's satisfied and takes it so that his body is comfortable.",
        "source": "T22n1428_053:0963c24_16"
    },
    {
        "source_sentence": "譬如人以膏油膏車，為財物故，欲令轉載有所至到。",
        "translation": "It's like a person who wants to give an ointment, oil, or chariot for the sake of possessions and wants to make something arrive.",
        "source": "T22n1428_053:0963c25_17"
    },
    {
        "source_sentence": "比丘食知止足取令支身亦復如是。",
        "translation": "So it is with the body of a bhikṣu who eats and knows that he's satisfied by stopping.",
        "source": "T22n1428_053:0963c26_18"
    },
    {
        "source_sentence": "比丘有如是聖戒得聖諸根，於食中能知止足，初夜後夜精進覺悟，若在晝日若行若坐，常爾一心念除諸蓋。",
        "translation": "If a monk has such noble precepts and attains noble faculties, he'll be able to know when he's satisfied while eating, and he'll exert effort for the first night and second night to awaken, whether he's walking or sitting during the day, always with one-pointed mindfulness that removes the hindrances.",
        "source": "T22n1428_053:0963c27_19"
    },
    {
        "source_sentence": "彼於初夜若行若坐，常爾一心念除諸蓋。",
        "translation": "In the first watch of the night, whether he's walking or sitting, he always keeps this single mind in his mind to remove the hindrances.",
        "source": "T22n1428_053:0964a01_20"
    },
    {
        "source_sentence": "彼於中夜側右脇累脚而臥，念當時起繫想在明心無錯亂，至於後夜便起思惟，若行若坐常爾一心念除諸蓋。",
        "translation": "In the middle of the night, he's lying with legs crossed at his right side, mindful of the time when he's awake and bound to mindfulness without confusion in his bright mind, and on the latter part of the night, he arises to contemplate, always singlemindedly removing the hindrances with one thought whether he's walking or sitting, either.",
        "source": "T22n1428_053:0964a02_21"
    },
    {
        "source_sentence": "比丘有如是聖戒逮聖諸根，食知止足。",
        "translation": "A monk who thus observes the noble precepts acquires the noble faculties, and he eats to know that he's satisfied.",
        "source": "T22n1428_053:0964a04_22"
    },
    {
        "source_sentence": "初夜後夜精進覺悟，常爾一心念無錯亂。",
        "translation": "At the beginning of the night and at the end of the night, he's diligently awakened, always mindful with one-pointed concentration without confusion.",
        "source": "T22n1428_053:0964a05_23"
    },
    {
        "source_sentence": "「云何比丘念無錯亂？",
        "translation": "How is a monk mindful without confusion?",
        "source": "T22n1428_053:0964a06_24"
    },
    {
        "source_sentence": "比丘如是觀內身身念處，精進不懈念無錯亂，調伏慳貪世間憂惱；",
        "translation": "“Furthermore, a bhikṣu observes the inner body as an application of mindfulness in this way: exerting himself energetically without slackening or being disturbed, he tames the worldly torments of craving and stinginess.",
        "source": "T22n1428_053:0964a07_25"
    },
    {
        "source_sentence": "觀外身身念處，精進不懈念無錯亂，調伏慳貪世間憂惱；",
        "translation": "He observed the outer body as an application of mindfulness, exerting himself energetically without slackening or being disturbed. He subdued the worldly cravings and distress of avarice and greed.",
        "source": "T22n1428_053:0964a09_0"
    },
    {
        "source_sentence": "觀內外身身念處，精進不懈念無錯亂，調伏慳貪世間憂惱。",
        "translation": "He observes the mindful abode of internal and external body and body, makes effort without laziness or confusion, subdues worldly grief from stinginess and craving.",
        "source": "T22n1428_053:0964a10_1"
    },
    {
        "source_sentence": "受、心、法亦如是，是為比丘念無錯亂。",
        "translation": "Feeling, mind and dharmas are likewise; this is called a monk's mindfulness that's not confused.",
        "source": "T22n1428_053:0964a11_2"
    },
    {
        "source_sentence": "云何比丘一心？",
        "translation": "What, venerable friends, is a monk’s unity of mind?",
        "source": "T22n1428_053:0964a12_3"
    },
    {
        "source_sentence": "若行步入出，左右視瞻屈申俯仰，執持衣鉢、受取飯食，大小便利，睡眠覺悟，若坐若立，若有所說若復寂然，如是一切常爾一心，是為一心。",
        "translation": "If someone walks, steps in and out, looks left and right, looks up and down, holds their robes, bowls, takes food and drink, relieves themselves large and small, sleeps and awakens when they're asleep, whether they're sitting or standing, speaks or is still, and so forth, all of these things are always the same as one mind, which is one mind.",
        "source": "T22n1428_053:0964a12_4"
    },
    {
        "source_sentence": "譬如有人與大眾共行，若在前若在中若在後，常得安樂而無有畏。",
        "translation": "It's like when a person walks together with the masses, whether in front, inside, or behind them, they always attain peace and have no fear.",
        "source": "T22n1428_053:0964a16_5"
    },
    {
        "source_sentence": "比丘亦復如是，行步入出乃至默然，常爾一心。",
        "translation": "Similarly, a monk who walks step by step, enters and leaves, or remains silent, always with one mind.",
        "source": "T22n1428_053:0964a17_6"
    },
    {
        "source_sentence": "比丘有如是聖戒，得聖諸根，食知止足，初夜後夜精進覺悟，常爾一心無有錯亂，樂在阿蘭若處樹下住，或樂處山窟、若在露地糞聚邊、若在塚間水岸間，彼乞食還已洗足，安置衣鉢結加趺坐，直身正意繫念在前，斷除慳貪心不與俱，斷除瞋恚無有怨嫉，心住無瞋、清淨無恚常有慈愍，除去睡眠不與共俱，繫想在明念無錯亂，除斷調愧不與共俱，內心寂滅調愧心淨。",
        "translation": "If a monk has these noble precepts and attains the noble faculties, then he knows food and stops eating. On the first and second watches of the night his energy is awakened, always with one-pointedness of mind without confusion. He delights in dwelling at the foot of a tree in a forest or in a mountain cave, or on the edge of a pile of excrement",
        "source": "T22n1428_053:0964a18_7"
    },
    {
        "source_sentence": "除斷於疑，已度於疑，其心一向在於善法。",
        "translation": "They remove doubt and have overcome doubt, and their minds are always focused on good qualities.",
        "source": "T22n1428_053:0964a28_8"
    },
    {
        "source_sentence": "譬如有奴大家，與姓安隱脫奴。",
        "translation": "Suppose there's a slave family and their surname are peaceful and freed from the slave.",
        "source": "T22n1428_053:0964a29_9"
    },
    {
        "source_sentence": "彼自念言：『我先是奴，而今解脫安隱，已得自在，不復從人。』",
        "translation": "They thought to themselves, 'I was once a slave, but now I'm liberated and peaceful, have attained mastery, and won't follow anyone again.'",
        "source": "T22n1428_053:0964a29_10"
    },
    {
        "source_sentence": "以是因緣便得歡喜其心安樂。",
        "translation": "Because of these causes and conditions, they'll then attain joy and peace of mind.",
        "source": "T22n1428_053:0964b02_11"
    },
    {
        "source_sentence": "又如有人舉他財物而行治生能得利",
        "translation": "\\",
        "source": "T22n1428_053:0964b03_0"
    },
    {
        "source_sentence": "息，還本既畢復有餘在，足以養活妻子，彼自念言：『我先舉債以用治生，而得利息。",
        "translation": "When he had paid his debt and returned home, there was still enough to support his wife and children. They thought to themselves, “First, I raised a debt to pay the interest on my old debt in order to help me live.",
        "source": "T22n1428_053:0964b04_0"
    },
    {
        "source_sentence": "既得還本，復有餘在，足養妻子。",
        "translation": "Having returned to his native land, he had some spare time to provide for his wife and children.",
        "source": "T22n1428_053:0964b05_1"
    },
    {
        "source_sentence": "我今便得自在，不復畏人。』",
        "translation": "Now that I've attained freedom, I won't fear people again.'",
        "source": "T22n1428_053:0964b06_2"
    },
    {
        "source_sentence": "以是因緣便得歡喜其心安樂。",
        "translation": "Because of these causes and conditions, they'll then attain joy and peace of mind.",
        "source": "T22n1428_053:0964b07_3"
    },
    {
        "source_sentence": "如人久病從病得差，食飲消化身有色力，彼作是念：『我先有病而今得差，飲食消化身有色力。』",
        "translation": "Suppose a person who has been ill for a long time and is cured from illness, and the body of eating, drinking, and digestion have form and strength, and they think, 'I was sick before but now I've been cured, and the body of eating, drinking, and digestion have form and strength.'",
        "source": "T22n1428_053:0964b08_4"
    },
    {
        "source_sentence": "以是因緣便得歡喜其心安樂。",
        "translation": "Because of these causes and conditions, they'll then attain joy and peace of mind.",
        "source": "T22n1428_053:0964b10_5"
    },
    {
        "source_sentence": "如人久閉牢獄從獄安隱得脫，彼作是念：『我先繫閉，今已得脫，無所復畏。』",
        "translation": "Suppose a person who has been locked up in prison for a long time and escapes from jail in peace, and they think, 'I was previously locked up, but now I've been freed, and there's nothing more to fear.'",
        "source": "T22n1428_053:0964b11_6"
    },
    {
        "source_sentence": "以是因緣便得歡喜其心安隱。",
        "translation": "Because of these causes and conditions, they'll rejoice and attain peace of mind.",
        "source": "T22n1428_053:0964b12_7"
    },
    {
        "source_sentence": "如人多持財寶，度大曠野不遭賊劫安隱得過，彼作是念：『我先多持財寶從曠野得過，而今無所復畏。』",
        "translation": "Suppose a person who holds a large amount of wealth and treasure and crosses the great wilderness without being attacked by thieves and gains peacefulness, and they think, 'First, I held a large amount of wealth and treasure in the wilderness and gained it from the wilderness, but now I'm no longer afraid.'",
        "source": "T22n1428_053:0964b13_8"
    },
    {
        "source_sentence": "以是因緣便得歡喜其心安樂。",
        "translation": "Because of these causes and conditions, they'll then attain joy and peace of mind.",
        "source": "T22n1428_053:0964b16_9"
    },
    {
        "source_sentence": "比丘有五蓋亦復如是，如奴、負債、久病、在獄、行大曠野，自見未斷諸結，令心染污慧力不明。",
        "translation": "A monk with five kinds of hindrances is likewise, such as a slave, debt, long illness, imprisonment, and traveling in the great wilderness who sees for himself that he hasn't cut the bonds and causes his mind to be defiled by the power of wisdom.",
        "source": "T22n1428_053:0964b16_10"
    },
    {
        "source_sentence": "彼即捨欲惡不善法，與覺觀俱而受喜樂，得入初禪。",
        "translation": "That is, they abandon bad and unskillful things that are desired, experience joy and happiness together with feelings and contemplations, and enter the first dhyāna.",
        "source": "T22n1428_053:0964b19_11"
    },
    {
        "source_sentence": "彼以喜樂潤漬於身，遍滿盈溢無不遍處，如人巧浴器盛細末藥，以水漬之和合相得，其水潤漬無有不潤而無零落。",
        "translation": "It's like a person who skillfully bathes a container of finely blended medicine and mixes it with water to obtain it, and there's no place where the water doesn't wet and no place where it doesn't fall.",
        "source": "T22n1428_053:0964b20_12"
    },
    {
        "source_sentence": "比丘得入初禪亦復如是，喜樂遍身無有空處，此是最初現身得樂。",
        "translation": "A monk who enters the first dhyāna is likewise, and there's no place where joy and happiness pervade his body without emptiness; this is the first time he attains happiness in his present body.",
        "source": "T22n1428_053:0964b23_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1428_053:0964b25_14"
    },
    {
        "source_sentence": "由不放逸精進不懈，念無錯亂樂處寂靜故。",
        "translation": "It is due to the absence of carelessness, energy, effort, and non-restraint: because there is no disturbance in thought.",
        "source": "T22n1428_053:0964b25_15"
    },
    {
        "source_sentence": "彼捨覺觀便生內信，心在一處，無覺無觀，心定喜樂，入第二禪。",
        "translation": "He abandons perception and contemplation, then gives rise to internal faith, his mind is in one place, has no perception or contemplation, and his mind is concentrated with joy and happiness when he enters the second dhyāna.",
        "source": "T22n1428_053:0964b26_16"
    },
    {
        "source_sentence": "彼以心定喜樂潤漬於身，遍滿盈溢無不遍處。",
        "translation": "They are nourished by the joy and happiness of their mind's concentration, and there's no place where it doesn't pervade.",
        "source": "T22n1428_053:0964b27_17"
    },
    {
        "source_sentence": "猶如山頂之泉水自中出，亦不從東西南北及從上來，即此池中清冷水出，潤漬一池遍滿盈溢無有空處。",
        "translation": "It's like the spring water at the top of a mountain that comes out from within, and it doesn't come from east, west, south, north, or above. That is, clear and cool water emerges from this pool, moistening and enriching a pool that fills up with nothing but emptiness.",
        "source": "T22n1428_053:0964b28_18"
    },
    {
        "source_sentence": "比丘入第二禪亦復如是，心定喜樂遍滿盈溢，此是第二現身得樂。",
        "translation": "Similarly, when a monk enters the second dhyāna, his mind is concentrated and filled with joy and happiness, and this is the second bliss he attains in his present body.",
        "source": "T22n1428_053:0964c02_19"
    },
    {
        "source_sentence": "彼捨喜心，住護念樂，身受快樂，如聖所說護念快樂，入第三禪。",
        "translation": "He abandons the mind of joy, abides in the bliss of guarding mindfulness, and experiences physical bliss as explained by the noble one, and enters the third dhyāna.",
        "source": "T22n1428_053:0964c03_20"
    },
    {
        "source_sentence": "彼於身無喜，以樂潤漬，遍滿盈溢，無有空處。",
        "translation": "They have no joy in their bodies and are wet with pleasure, filling them all over with it; there is no place for emptiness.",
        "source": "T22n1428_053:0964c05_21"
    },
    {
        "source_sentence": "譬如優鉢羅華、拘頭摩、分陀利華，雖生出地而未出水，根莖華葉潤漬水中，無有空處而不潤漬。",
        "translation": "It's like when the utpala, kumuda, and puṇḍarīka flowers grow on the ground but don't emerge from water, and their roots, stems, flowers, leaves, and nourishment are wet in water, and there's no empty place that isn't wet.",
        "source": "T22n1428_053:0964c06_22"
    },
    {
        "source_sentence": "比丘入第三禪亦復如是，離喜住樂潤漬於身無不遍處，此是第三禪得現身快樂所遊戲處。",
        "translation": "A monk who enters the third dhyāna is likewise, parting with joy and abiding in bliss and moistening his body without fail, and this is the third dhyāna where he attains the pleasure of enjoyment of the present body as a playground.",
        "source": "T22n1428_053:0964c08_23"
    },
    {
        "source_sentence": "彼捨苦樂憂喜，先斷不苦不樂，護念清淨，入第四禪。",
        "translation": "He abandons pain, pleasure, grief, sorrow, and joy, first stops what’s neither painful nor pleasant, guards his mindfulness purely, and enters the fourth meditation.",
        "source": "T22n1428_053:0964c11_24"
    },
    {
        "source_sentence": "身心清淨具滿盈溢，無不遍處。",
        "translation": "Their bodies and minds are pure and fully filled, and there's no place where they don't pervade.",
        "source": "T22n1428_053:0964c12_25"
    },
    {
        "source_sentence": "由若男子女人沐浴淨潔，被以新白淨衣，無有不覆之處。",
        "translation": "It's because if a man or woman is bathed and clean, they're covered with new white pure clothing, and there's no place that isn't covered.",
        "source": "T22n1428_053:0964c13_26"
    },
    {
        "source_sentence": "比丘入第四禪亦復如是，其心清淨遍滿於身，無空缺處。",
        "translation": "Similarly, when a monk enters the fourth dhyāna, his mind is pure and pervades his body with no space or lack of space.",
        "source": "T22n1428_053:0964c14_27"
    },
    {
        "source_sentence": "彼入第四禪，心不掉動，亦不懈怠，不與愛恚相應，住無動地。",
        "translation": "He enters the fourth dhyāna, his mind isn't agitated, doesn't become lazy, doesn't associate with craving and anger, and abides in the ground of no movement.",
        "source": "T22n1428_053:0964c15_28"
    },
    {
        "source_sentence": "譬如密屋，內外泥治，堅閉戶嚮，無有風塵，於內然燈，無有人、非人、風鳥、扇動，其燈焰直上無有曲戾，恬定而然。",
        "translation": "It's like a secret house that's covered with mud inside and outside, which firmly closes its doors and echoes without wind or dust, and there's a lamp inside it that has no person, no non-person, wind, bird, or fan moving in it. The flame of the lamp goes straight upward without twisting or turning, remaining calm and still.",
        "source": "T22n1428_053:0964c17_29"
    },
    {
        "source_sentence": "比丘入第四禪亦復如是，無有掉動，心無懈怠，不與愛恚相應，已住無動地，此是第四禪現身得樂所遊戲處。",
        "translation": "A monk who enters the fourth dhyāna is likewise, without agitation, without laziness of mind, not associated with craving or hatred, and already abiding in the ground of no movement. This is the playful state of the fourth dhyāna where he manifests his body to attain bliss.",
        "source": "T22n1428_053:0964c20_30"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1428_053:0964c22_31"
    },
    {
        "source_sentence": "由不放逸精進不懈念不錯亂樂處寂靜故。",
        "translation": "It's because he doesn't lazily exert effort, doesn't lack mindfulness, and abides in the tranquility of a place of happiness that's not disturbed.",
        "source": "T22n1428_053:0964c22_32"
    },
    {
        "source_sentence": "「彼得定心清淨，無有垢穢，柔軟調伏住無動地。",
        "translation": "The mind of Peter's concentration is pure, without dirt or stain, gentle and subdued, and abiding in the ground of immovability.",
        "source": "T22n1428_053:0964c23_33"
    },
    {
        "source_sentence": "自於身中起心，能化作異身，肢節具足諸根無闕。",
        "translation": "They themselves give rise to minds within their bodies that can transform into different bodies, and their limbs are endowed with the faculties without fail.",
        "source": "T22n1428_053:0964c25_0"
    },
    {
        "source_sentence": "時即觀之，此身色四大合成，彼身色化有。",
        "translation": "He then observes that these four elements of body and form are combined, and that body and form exist by transformation.",
        "source": "T22n1428_053:0964c26_1"
    },
    {
        "source_sentence": "此四大身色異，彼化身四大色異，從此四大身色中起心化作，彼身諸根肢節具足。",
        "translation": "These four elements are different in form from the four elements of the body. The magic body is different in form from the four elements, and this magical creation arises from these four elements of the body as form.",
        "source": "T22n1428_053:0964c27_2"
    },
    {
        "source_sentence": "譬如有人鞘中拔刀，彼作是念：『此是鞘，此是刀，刀異鞘異。』",
        "translation": "It's like when someone pulls a knife out of a sheath and thinks, 'This is the sheath, this is the knife, and the knife is different from the sheath.'",
        "source": "T22n1428_053:0964c29_3"
    },
    {
        "source_sentence": "從此鞘中拔刀出。",
        "translation": "From this sheath, he pulls out his sword.",
        "source": "T22n1428_053:0965a01_4"
    },
    {
        "source_sentence": "亦如人筐中出蛇，彼作是念：『此是筐，此是蛇，筐異蛇異。』",
        "translation": "It's also like when a snake comes out of a person's basket and thinks, 'This is the basket, this is the snake, and the basket is different from the snake.'",
        "source": "T22n1428_053:0965a01_5"
    },
    {
        "source_sentence": "從此筐中出蛇。",
        "translation": "From this basket, a snake emerges.",
        "source": "T22n1428_053:0965a03_6"
    },
    {
        "source_sentence": "譬如有人從簏出衣，彼作是念：『此是簏，此是衣，簏異衣異。』",
        "translation": "Suppose there's a person who produces clothing from a garment and thinks, 'This is a garment, this is a garment, and the garment is different from the garment; the garment is different from the garment.'",
        "source": "T22n1428_053:0965a03_7"
    },
    {
        "source_sentence": "從簏中出衣。",
        "translation": "From the topknot, he emerges with his robe.",
        "source": "T22n1428_053:0965a05_8"
    },
    {
        "source_sentence": "比丘亦復如是。",
        "translation": "So it is with the monks.",
        "source": "T22n1428_053:0965a05_9"
    },
    {
        "source_sentence": "此是比丘初勝法，何以故？",
        "translation": "This is the bhikṣu’s first superior quality. Why is this so?",
        "source": "T22n1428_053:0965a05_10"
    },
    {
        "source_sentence": "由不放逸精進不懈，念無錯亂樂寂靜故，彼以定心清淨乃至入不動地。",
        "translation": "Because they aren't careless, make effort without laziness, and are mindful without confusion and happy in quiescence, their concentrated mind is purified until they enter the ground of immovability.",
        "source": "T22n1428_053:0965a06_11"
    },
    {
        "source_sentence": "從己四大色身中起心化作化身，一切諸根肢節具足，彼作是念：『此身是四大合成，彼身從化而有。』",
        "translation": "From the four major form bodies of his own mind that arise from the four major form bodies, he creates a transformation body with all their faculties and limbs, and he thinks, 'This body is made up of the four major composite bodies, and that body comes into existence from being transformed.'",
        "source": "T22n1428_053:0965a08_12"
    },
    {
        "source_sentence": "此四大色身異，彼化四大色身異，此心在此身、依此身、繫此身。",
        "translation": "These four elements are different from one form body to another; these magical elements are different from one form body to another. This awareness abides in this body, depends on this body, and binds this body.",
        "source": "T22n1428_053:0965a10_13"
    },
    {
        "source_sentence": "譬如琉璃摩尼珠瑩治甚明清淨無垢，若以青黃赤綖貫之，有眼男子置掌而觀：『此是珠，此是綖，珠異綖異，此珠繫在於綖。』",
        "translation": "It's like a lapis lazuli maṇi pearl that's perfectly shiny, clear, pure, and undefiled, and if you were to place it with blue, yellow, red, and black thread, a man with eyes would place his palms and look at it, saying, 'This is the pearl, this is the base, the pearl differs from the base, and this pearl is",
        "source": "T22n1428_053:0965a12_14"
    },
    {
        "source_sentence": "比丘亦復如是，從此四大色身，起心化作化身，一切諸根肢節具足，而作是念：『此身是四大合成，彼身從化而有。",
        "translation": "Similarly, the bhikṣu arouses the intention to create magical bodies emanating from the four elements of his material body. Endowed with all their faculties and limbs, he thinks: “This body consists of the combination of the four elements. That body comes into being through magic.",
        "source": "T22n1428_053:0965a15_0"
    },
    {
        "source_sentence": "此四大色身異，彼化四大色身異。",
        "translation": "These four elements are different from one form body to another. The same magical creation is different from the four elements:",
        "source": "T22n1428_053:0965a17_1"
    },
    {
        "source_sentence": "此心在此身、依此身、繫此身。』",
        "translation": "This mind is here in this body, relies on this body, and binds it to this body.'",
        "source": "T22n1428_053:0965a18_2"
    },
    {
        "source_sentence": "此是比丘第二勝法。",
        "translation": "This is the second superior quality of a monk.",
        "source": "T22n1428_053:0965a19_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1428_053:0965a19_4"
    },
    {
        "source_sentence": "由不放逸精進不懈念無錯亂樂寂靜故。",
        "translation": "It's because he doesn't lazily exert effort and doesn't lack mindfulness, has no confusion or confusion, and enjoys quiescence.",
        "source": "T22n1428_053:0965a19_5"
    },
    {
        "source_sentence": "彼以定心清淨，乃至入無動地，一心修習神通智證。",
        "translation": "Because their mind is purified by concentration, they enter the ground of immovability and singlemindedly cultivate the realization of supernormal cognition.",
        "source": "T22n1428_053:0965a20_6"
    },
    {
        "source_sentence": "彼便能作種種變化，以一身為無數身，無數身還為一身。",
        "translation": "They can then perform various transformations, making one body countless bodies with one body and countless bodies into one body.",
        "source": "T22n1428_053:0965a21_7"
    },
    {
        "source_sentence": "身能飛行石壁皆過，無所觸閡如行虛空，行住空中如鳥飛翔，出沒於地、如水涌波、或烟或焰、若大火積，手能捫摸日月，身至梵天。",
        "translation": "Their bodies can fly past rock walls without touching anything, just as if they were traveling through space. They move up and down in the sky like birds flying; they emerge and perish from the ground like waves of water, or smoke or flames, or a great heap of fire. With their hands they can touch the sun and moon, and their bodies reach the Brahma heavens.",
        "source": "T22n1428_053:0965a23_8"
    },
    {
        "source_sentence": "譬如陶師善調和泥，隨意所造，欲作何器便能成之而有利益。",
        "translation": "It's like a potter who well-adjusts the clay and creates any pot he wants to make that will be beneficial.",
        "source": "T22n1428_053:0965a26_9"
    },
    {
        "source_sentence": "譬如巧匠善能治木，隨意所造自在成之而有利益。",
        "translation": "It's like a skillful craftsman who well treats wood and creates it freely as he wishes for benefit.",
        "source": "T22n1428_053:0965a28_10"
    },
    {
        "source_sentence": "譬如治象牙師善能治牙，隨意所作自在成之而有利益。",
        "translation": "It's like an elephant-tooth healer who well treats the teeth and creates them freely as he wishes for benefit.",
        "source": "T22n1428_053:0965a29_11"
    },
    {
        "source_sentence": "譬如金師善鍊真金，隨意所作自在成之而有利益。",
        "translation": "It's like a gold smith who skillfully refines real gold, making it as he wishes and benefiting from it.",
        "source": "T22n1428_053:0965b01_12"
    },
    {
        "source_sentence": "比丘亦復如是，定心清淨至無動地，隨意所作乃至梵天，此是比丘第三勝法。",
        "translation": "Similarly, a monk whose mind is concentrated and pure until he reaches the ground of immovability and does as he wishes up to the Brahma heavens is the third superior quality of a monk.",
        "source": "T22n1428_053:0965b03_0"
    },
    {
        "source_sentence": "彼以定心清淨乃至入無動地，一心修習證天耳智，彼天耳清淨過出於人耳，聞二種聲：人、非人。",
        "translation": "Because their concentrated mind is purified up to the point where they enter the ground of immovability, they whole-heartedly cultivate the realization of the knowledge of the divine ear as a result of the purity of that divine ear, which transcends human hearing and hears two kinds of sounds: human and nonhuman.",
        "source": "T22n1428_053:0965b04_1"
    },
    {
        "source_sentence": "譬如於城郭國邑中有講堂廣大高顯，有聰耳人在中，不勞聽力而聞種種音聲。",
        "translation": "It's like when there's a lecture hall in a city or town that's vast and lofty, and there are people with intelligent ears who don't bother to hear various sounds without the power of hearing.",
        "source": "T22n1428_053:0965b07_2"
    },
    {
        "source_sentence": "比丘亦復如是，以心定故天耳清淨，得聞人、非人種種音聲。",
        "translation": "A monk is likewise, because his mind is concentrated, the divine ear is purified, and he can hear various sounds of humans and non-humans.",
        "source": "T22n1428_053:0965b09_3"
    },
    {
        "source_sentence": "此是比丘第四勝法。",
        "translation": "This is the fourth superior quality of a bhikṣu.",
        "source": "T22n1428_053:0965b10_4"
    },
    {
        "source_sentence": "彼以定心清淨乃至入無動地，一心修習證他心智，彼知外眾生心，有欲、無欲、有垢、無垢、有癡、無癡、廣心、略心、小心、大心、定心、亂心、縛心、脫心、上心、無上心，皆悉知之。",
        "translation": "They know the minds of external beings with desire, without desire, with defilement or without defilement, with delusion or without delusion, with a broad mind, an abbreviated mind, a careful mind, a great mind, a concentrated mind, a disturbed mind, a troubled mind, a fettered mind, a liberated mind, a superior mind, and an unsurpassed mind.",
        "source": "T22n1428_053:0965b11_0"
    },
    {
        "source_sentence": "譬如自喜男子女人以水鏡自照無不得見。",
        "translation": "It's like a man or woman who delights in himself and uses a mirror of water to illuminate themselves without being able to see.",
        "source": "T22n1428_053:0965b14_1"
    },
    {
        "source_sentence": "比丘亦復如是，以定心清淨故，知外一切眾生心之所念。",
        "translation": "A monk is likewise, because his concentrated mind is pure, he knows what all sentient beings outside the monastery think in their minds.",
        "source": "T22n1428_053:0965b15_2"
    },
    {
        "source_sentence": "此是比丘第五勝法。",
        "translation": "This is the fifth superior quality of a monk.",
        "source": "T22n1428_053:0965b17_3"
    },
    {
        "source_sentence": "彼以定心清淨乃至入無動地，一心修習宿命智證，便能憶識宿命無數若干種事，能憶一生、十生、百生、千生、無數百千生，劫燒都盡國土還生，我在彼生名字如是、種如是、姓如是、食如是、壽命如是、在世如是、壽盡如是、受苦樂如是。",
        "translation": "With a concentrated mind pure and genuine, he enters the state of immovability. He cultivates with one mind the knowledge of past lives in order to realize their realization. Then he is able to recall countless things from past lives. He can remember one lifetime, ten lifetimes, a hundred lifetimes, a thousand lifetimes, or countless hundreds of thousands of lifetimes; after all these eons have been burned up,",
        "source": "T22n1428_053:0965b17_4"
    },
    {
        "source_sentence": "從彼命終復生於彼，如是展轉來生於此，如是形色相貌無數種種皆悉憶識。",
        "translation": "At the end of their life, they'll again be born there, and in this way they'll be born here in succession, with such forms and appearances that are countless and various, all remembering consciousnesses.",
        "source": "T22n1428_053:0965b23_5"
    },
    {
        "source_sentence": "譬如有人從己村落往至他國，在於彼間若行、若住、若語、若默，從彼國復往餘國，若行、若住、若語、若默，如是展轉復還其國，不勞多力而能憶識所行諸國：『我從此國乃往彼國，在彼國內如是行、如是住、如是語、如是默；",
        "translation": "“Good man, this is analogous to someone who goes from his own village to another country. If he walks, stays, speaks, or remains silent in that place, and returns again and again from that country without exerting much effort [to do so], then whatever he does, whether he walks, stays, speaks, or remains silent, he can recall the countries where he has traveled:",
        "source": "T22n1428_053:0965b25_0"
    },
    {
        "source_sentence": "從彼國復至彼國，在彼國如是行、如是住、如是語、如是默；",
        "translation": "“Departing from that country and returning to another, they traveled thus in that country, lived thus, spoke thus, and remained thus silent.",
        "source": "T22n1428_053:0965c01_1"
    },
    {
        "source_sentence": "如是展轉還至本國。』",
        "translation": "In this way, they'll go back to their own country in turn.'",
        "source": "T22n1428_053:0965c02_2"
    },
    {
        "source_sentence": "比丘亦如是，能以定心清淨乃至無動地，以宿命智證，能憶無數百千劫種種眾事。",
        "translation": "Similarly, a monk can use his concentration to purify his mind and even reach the ground of immovability, realize it with the knowledge of past lives, and be able to recollect countless hundreds of thousands of eons of various things.",
        "source": "T22n1428_053:0965c03_3"
    },
    {
        "source_sentence": "此是比丘得第一明。",
        "translation": "This is the first insight that a monk attains.",
        "source": "T22n1428_053:0965c05_4"
    },
    {
        "source_sentence": "斷滅無明，明法生、闇已去，明曉法存，此是比丘憶宿命智證明。",
        "translation": "He stops ignorance, explains that the Dharma arises and disappears after darkness, and explains that the Dharma exists when dawn comes. This is a monk who remembers past lives and proves it with knowledge.",
        "source": "T22n1428_053:0965c05_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1428_053:0965c07_6"
    },
    {
        "source_sentence": "由不放逸精進不懈，心無錯亂樂處寂靜故。",
        "translation": "It is due to the absence of carelessness, energy, effort, and non-restraint: because the mind is not disturbed or disturbed. The blissful state of absorption is tranquil.",
        "source": "T22n1428_053:0965c07_7"
    },
    {
        "source_sentence": "彼以定心清淨乃至無動地，一心修習見眾生死此生彼，智證彼天眼清淨，見眾生死此生彼，形色好醜善惡、諸道尊貴卑賤，隨眾生所造業報因緣皆能知之。",
        "translation": "Because their concentrated mind is purified, up to the ground of immovability, they cultivate with one mind that they see sentient beings dying here and being born there, and their knowledge realizes that their divine eye is purified, that they see sentient beings dying here and being born here, whose form is good and beautiful, good and bad, and the paths are noble and inferior, and they can know them according",
        "source": "T22n1428_053:0965c08_8"
    },
    {
        "source_sentence": "如此人造身惡行、口惡行、心惡行，誹謗賢聖、邪見。",
        "translation": "Such people commit bad physical actions, bad verbal actions, and bad mental actions, denigrating the noble ones and holding wrong views.",
        "source": "T22n1428_053:0965c11_9"
    },
    {
        "source_sentence": "以邪見報故，墮地獄、餓鬼、畜生。",
        "translation": "Because of the retribution of wrong views, they'll fall into hell, hungry ghosts, and animals.",
        "source": "T22n1428_053:0965c13_10"
    },
    {
        "source_sentence": "如此眾生，身行善、口行善、心念善，不誹謗賢聖、正見、修習正業，身死得生天上人中。",
        "translation": "Such sentient beings are good in body, good in speech, and good in mind, don't denigrate the noble ones, right view, and cultivate right action, and will be born among gods and humans when their bodies die.",
        "source": "T22n1428_053:0965c13_11"
    },
    {
        "source_sentence": "如是天眼清淨，見眾生死此生彼，隨眾生所造業因，皆悉知之。",
        "translation": "Thus, the divine eye is purified, which sees the causes of the actions created by sentient beings and knows them all according to the causes of their actions.",
        "source": "T22n1428_053:0965c15_12"
    },
    {
        "source_sentence": "譬如廣大平地四交道頭有高顯大堂，有明眼人在中，見眾生從東方來至西方，從西方往東方，從南方往北方，從北方往南方。",
        "translation": "Suppose there's a large, flat ground at the four intersections of the path with a high, raised hall in which there's a person with insight who sees sentient beings coming from the east to the west, going from the west to the east, going from the south to the north, and going from the north to the south.",
        "source": "T22n1428_053:0965c17_13"
    },
    {
        "source_sentence": "比丘如是，以定心清淨乃至無動地，見眾生死此生彼，智證以天眼清淨，見眾生死此生彼，乃至隨眾生所造業報因緣，皆悉知之。",
        "translation": "In the same way, when a bhikṣu observes that all sentient beings die here and are reborn there because his mind is concentrated [in absorption] and his supernormal vision is purified by means of this knowledge, he sees all sentient beings who die here and are reborn there. He knows everything according to the causes and conditions for the karmic retribution of actions created by sentient beings.",
        "source": "T22n1428_053:0965c20_14"
    },
    {
        "source_sentence": "此是比丘得第二明。",
        "translation": "This is the second insight that a monk attains.",
        "source": "T22n1428_053:0965c23_15"
    },
    {
        "source_sentence": "斷無明，明法生、闇已去，明曉法存，此是見眾生死此生彼智證明。",
        "translation": "He stops ignorance, explains the arising of dharmas and the departure of darkness, and he clearly understands the existence of dharmas. This is the realization of seeing that sentient beings die here and are born there with knowledge.",
        "source": "T22n1428_053:0965c23_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1428_053:0965c25_17"
    },
    {
        "source_sentence": "由不放逸精進不懈，心不錯亂樂寂靜故。",
        "translation": "It is due to the absence of carelessness, energy, effort, and non-restraint. The mind is not disturbed or disturbed; it enjoys peace and quietude.",
        "source": "T22n1428_053:0965c25_18"
    },
    {
        "source_sentence": "彼以定心清淨，乃至無動地，一心修習無漏智證。",
        "translation": "Because their mind is purified by concentration, they cultivate the realization of uncontaminated cognition with one mind that's pure, even up to the ground of immovability.",
        "source": "T22n1428_053:0965c26_19"
    },
    {
        "source_sentence": "彼如實知苦聖諦集盡道諦，如實知有漏、漏集、漏盡、如實知趣漏盡道聖諦。",
        "translation": "They truly know the noble truths of suffering, accumulation, cessation, and the path, and truly know the noble truths of contaminants, accumulation, cessation, and the path to ending contaminants as they really are.",
        "source": "T22n1428_053:0965c27_20"
    },
    {
        "source_sentence": "彼如是知、如是見，從欲漏、有漏、無明漏心得解脫。",
        "translation": "They thus know and thus see, and their minds are liberated from the contaminants of desire, existence, and ignorance.",
        "source": "T22n1428_053:0965c29_21"
    },
    {
        "source_sentence": "已得解脫智，我生已盡，梵行已立，所作已辦，更不復生。",
        "translation": "He has attained the knowledge of liberation, my birth has ended, the religious practice has been established, what was to be done has been done, and it won't arise again.",
        "source": "T22n1428_053:0966a01_22"
    },
    {
        "source_sentence": "譬如清水中，有木石魚鼈水性之屬，東西遊行。",
        "translation": "It's like when there's wood, stone, fish, and the water element in clear water that travel east and west.",
        "source": "T22n1428_053:0966a03_0"
    },
    {
        "source_sentence": "有眼者觀之，見木石魚鼈：『此是木石，此是魚鼈東西遊行。』",
        "translation": "Someone with eyes observes it, and they see a wooden stone fish turtle: 'This is a wooden stone; this is a fish turtle traveling east and west.'",
        "source": "T22n1428_053:0966a04_1"
    },
    {
        "source_sentence": "比丘亦復如是，以定心清淨至無動地，得無漏智證，乃至不復更生。",
        "translation": "Similarly, a monk with a concentrated mind that's pure up to the ground of immovability attains the realization of uncontaminated cognition until it doesn't arise again.",
        "source": "T22n1428_053:0966a05_2"
    },
    {
        "source_sentence": "此是比丘得第三明。",
        "translation": "This is the third insight that a monk attains.",
        "source": "T22n1428_053:0966a07_3"
    },
    {
        "source_sentence": "斷無明，明法生、闇法去，明曉法存，是為無漏智明。",
        "translation": "He stops ignorance, explains the arising of dharmas and the departure of dharmas of darkness, and understands the existence of dharmas. This is the insight of untainted cognition.",
        "source": "T22n1428_053:0966a07_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1428_053:0966a08_5"
    },
    {
        "source_sentence": "由不放逸精進不懈，念無錯亂樂處寂靜故。」",
        "translation": "It's because they aren't lazy, don't exert effort, and are mindful of the tranquility of the pleasant place without confusion.",
        "source": "T22n1428_053:0966a09_0"
    },
    {
        "source_sentence": "(雜揵度具足竟)",
        "translation": "(after the completion of the fulfillment of the cross-legged path)",
        "source": "T22n1428_053:0966a10_0"
    },
    {
        "source_sentence": "四分律卷第五十三",
        "translation": "Sifen lü, vol. 53",
        "source": "T22n1428_053:0966a11_0"
    }
]