[
    {
        "source_sentence": "摩訶僧祇律卷第一(初比丘僧戒法學)東晉天竺三藏佛陀跋陀羅共法顯譯明四波羅夷法之一(婬戒之一)若篤信善男子欲得五事利益者，當盡受持此律。",
        "translation": "Mohe 無僧祇律卷第一(初比丘僧戒法學)東晉天竺三藏佛陀跋陀羅共法顯譯明四波羅夷法之一(戒之一)若篤信善男子欲得五事利益者,當盡受持此律。",
        "source": "T22n1425_001:0227a03_0"
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are these five?",
        "source": "T22n1425_001:0227a09_1"
    },
    {
        "source_sentence": "若善男子欲建立佛法者，當盡受持此律。",
        "translation": "If good sons want to establish the Buddha's teaching, they should fully accept and uphold this precept.",
        "source": "T22n1425_001:0227a09_2"
    },
    {
        "source_sentence": "欲令正法久住者，當盡受持此律。",
        "translation": "Those who want to cause the right teaching to abide for a long time will fully accept and uphold this precept.",
        "source": "T22n1425_001:0227a10_3"
    },
    {
        "source_sentence": "不欲有疑悔請問他人者，當盡受持此律。",
        "translation": "Those who don't want to have doubts or regrets and ask others questions should fully accept and uphold this precept.",
        "source": "T22n1425_001:0227a11_0"
    },
    {
        "source_sentence": "諸有比丘、比丘尼犯罪恐怖，為作依怙者，當盡受持此律。",
        "translation": "If there are monks or nuns who commit crimes of fear and serve as their support, they should fully observe this precept.",
        "source": "T22n1425_001:0227a11_1"
    },
    {
        "source_sentence": "欲遊化諸方而無礙者，當盡受持此律。",
        "translation": "Those who want to travel and teach in all directions without obstruction should fully accept and uphold this precept.",
        "source": "T22n1425_001:0227a13_2"
    },
    {
        "source_sentence": "是名篤信善男子受持此律，得五事利益。",
        "translation": "This is called a faithful, good man who adheres to these precepts and receives the benefits of five things.",
        "source": "T22n1425_001:0227a14_3"
    },
    {
        "source_sentence": "　　　若能盡受持，　　調御威儀戒；",
        "translation": "If they can fully accept and uphold them, They will be disciplined by the precepts of deportment.",
        "source": "T22n1425_001:0227a15_0"
    },
    {
        "source_sentence": "　五事功德利，　　世尊之所說。",
        "translation": "The five benefits of merit and virtue are explained by the Bhagavān.",
        "source": "T22n1425_001:0227a16_0"
    },
    {
        "source_sentence": "　受持此律者，　　如其義善聽；",
        "translation": "Those who accept and uphold this vinaya Listen attentively And listen appropriately to its meaning.",
        "source": "T22n1425_001:0227a17_0"
    },
    {
        "source_sentence": "　若能盡受持，　　調御戒律儀，",
        "translation": "If they can fully accept and uphold the disciplines, regulate precepts and observing restraint,",
        "source": "T22n1425_001:0227a18_0"
    },
    {
        "source_sentence": "　建立世尊教，　　是名真佛子。",
        "translation": "Establishing the teachings of the Bhagavat is called truly the Buddha-child.",
        "source": "T22n1425_001:0227a19_0"
    },
    {
        "source_sentence": "　佛法得久住，　　能行正法施，",
        "translation": "The Buddha’s doctrine abides for a long time. He can practice giving the true doctrine.",
        "source": "T22n1425_001:0227a20_0"
    },
    {
        "source_sentence": "　亦無疑悔起，　　請問於他人。",
        "translation": "Nor does he have doubts or regrets that arise and ask questions to others.",
        "source": "T22n1425_001:0227a21_0"
    },
    {
        "source_sentence": "　比丘比丘尼，　　犯罪得依怙；",
        "translation": "Monks and nuns receive support for their crimes.",
        "source": "T22n1425_001:0227a22_0"
    },
    {
        "source_sentence": "　遊化於諸方，　　所往無罣礙。",
        "translation": "He travels and transforms in all directions Without obstruction wherever he goes.",
        "source": "T22n1425_001:0227a23_0"
    },
    {
        "source_sentence": "婆伽婆、三藐三佛陀從本發意所修習者，今已成就，欲度人故住舍衛城，諸天世人恭敬供養、尊重讚歎，名聞十方供養中最。",
        "translation": "Bhagavān and Samyak-saṃbuddha had originally arisen the intention to cultivate it, but now they've accomplished it, wanting to save people who formerly lived in Śrāvastī, and gods and people respectfully offer support and venerate and praise it, which is called the best of the offerings heard in the ten directions.",
        "source": "T22n1425_001:0227a24_0"
    },
    {
        "source_sentence": "為求福眾生得建立於福，求果眾生得建立於果，苦惱眾生而得安隱，為諸天人開甘露門，於十六大國莫不宗伏、知見自覺。",
        "translation": "Because sentient beings who seek merit attain the establishment of merit, sentient beings who seek results attain the establishment of results, and painful sentient beings attain peace. For gods and humans, they open the gate of immortality for them, and none of the sixteen great kingdoms don't subdue their doctrine or know and see themselves as self-realized.",
        "source": "T22n1425_001:0227a26_1"
    },
    {
        "source_sentence": "佛所住者，住於天住、住於梵住、住賢聖住、住最勝住、住一切智心，得自在隨意所住，是故如來住舍衛國。",
        "translation": "The Buddha's abode is abiding in heaven, abiding in Brahma, abiding in the abode of goodness and nobleness, abiding in the supreme abode, abiding in the mind of omniscience, and attaining freedom to abide wherever he wishes. That's why the Tathāgata lives in Śrāvastī.",
        "source": "T22n1425_001:0227a29_2"
    },
    {
        "source_sentence": "爾時尊者舍利弗，獨一靜處結加趺坐正受三昧。",
        "translation": "It was then that Venerable Śāriputra sat cross-legged in a solitary, quiet place and meditated in concentration.",
        "source": "T22n1425_001:0227b03_3"
    },
    {
        "source_sentence": "三昧覺已作是思惟：「有何因緣，諸佛世尊滅度之後法不久住？",
        "translation": "Having awakened from samādhi, he thought, What are the reasons why the buddhas and world-honored ones won't live for a long time after their parinirvāṇa?",
        "source": "T22n1425_001:0227b04_4"
    },
    {
        "source_sentence": "有何因緣，諸佛世尊滅度之後法教久住？」",
        "translation": "What are the causes and conditions for the long abiding of the teachings of the Dharma after the parinirvāṇa of the Bhagavān?",
        "source": "T22n1425_001:0227b05_5"
    },
    {
        "source_sentence": "於是尊者舍利弗，晡時從三昧起詣世尊所，頭面禮足却坐一面。",
        "translation": "Venerable Śāriputra then rose from samādhi in the late afternoon and went to the Bhagavān, bowed his head and feet, and withdrew to sit at one side.",
        "source": "T22n1425_001:0227b06_6"
    },
    {
        "source_sentence": "坐一面已白佛言：「世尊！",
        "translation": "He sat to one side and said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0227b08_7"
    },
    {
        "source_sentence": "我於靜處正受三昧，三昧覺已作是思惟：『有何因緣，諸佛世尊滅度之後法不久住？",
        "translation": "Having entered concentration in a secluded place, I thought: O World-honored One, for what reason will the Dharma not last long after the parinirvāṇa of all buddhas?",
        "source": "T22n1425_001:0227b08_8"
    },
    {
        "source_sentence": "有何因緣，諸佛世尊滅度之後法教久住？』」",
        "translation": "What are the causes and conditions for the long abiding of the teachings of the Dharma after the parinirvāṇa of the Bhagavān?'",
        "source": "T22n1425_001:0227b10_9"
    },
    {
        "source_sentence": "爾時佛告舍利弗：「有如來不為弟子廣說修多羅、祇夜、授記、伽陀、憂陀那，如是語、本生、方廣、未曾有經。",
        "translation": "It was then that the Buddha addressed Śāriputra, Suppose there's a Tathāgata who doesn't explain extensively for his disciples sūtra, pratyekabuddha, ācārya, kāda, and udāna, such-and-such words spoken in their original birth, breadth, and unprecedentedness.",
        "source": "T22n1425_001:0227b11_10"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T22n1425_001:0227b13_11"
    },
    {
        "source_sentence": "諸佛如來不為聲聞制戒，不立說波羅提木叉法，是故如來滅度之後法不久住。",
        "translation": "The buddhas and tathāgatas don't prescribe precepts for śrāvakas, and they don't establish the teaching of the prātimokṣaṣa teaching; therefore, the teaching will not last long after the Tathāgata's passing away.",
        "source": "T22n1425_001:0227b13_12"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T22n1425_001:0227b15_13"
    },
    {
        "source_sentence": "譬如鬘師、鬘師弟子，以種種色花著於案上，不以線連，若四方風吹則隨風散。",
        "translation": "It's like when a miller or miller's disciple puts flowers of various colors on a desk and doesn't line them up with thread, and if the wind blows in four directions, they scatter according to the wind.",
        "source": "T22n1425_001:0227b15_14"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1425_001:0227b17_15"
    },
    {
        "source_sentence": "無線連故。",
        "translation": "It's because it's connected by the sound of the waves.",
        "source": "T22n1425_001:0227b17_16"
    },
    {
        "source_sentence": "如是舍利弗！",
        "translation": "Thus, Śāriputra!",
        "source": "T22n1425_001:0227b18_17"
    },
    {
        "source_sentence": "如來不廣為弟子說九部法，不為聲聞制戒，不立說波羅提木叉法，是故如來滅後法不久住。",
        "translation": "The Tathāgata doesn't explain the nine parts of the teaching extensively for his disciples, doesn't prescribe precepts for śrāvakas, and doesn't establish a teaching that teaches the prātimokṣa dharma; therefore, it won't be long before the Tathāgata ceases.",
        "source": "T22n1425_001:0227b18_18"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T22n1425_001:0227b20_19"
    },
    {
        "source_sentence": "以如來廣為弟子說九部法，為聲聞制戒，立說波羅提木叉法，是故如來滅度之後教法久住。",
        "translation": "Because the Tathāgata extensively taught the nine divisions of the Dharma for his disciples, established precepts for śrāvakas and established the teaching of the prātimokṣaṣa dharma for the sake of those who heard it, the teaching of the Dharma will abide for a long time after the parinirvāṇa of the Tathāgata.",
        "source": "T22n1425_001:0227b20_20"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T22n1425_001:0227b22_21"
    },
    {
        "source_sentence": "譬如鬘師、鬘師弟子，以種種色花以線連之，若四方風吹不隨風散。",
        "translation": "It's like when a miller or miller's disciple connects various kinds of flowers with thread, and if the wind blows in four directions and doesn't follow the wind to disperse them.",
        "source": "T22n1425_001:0227b22_22"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T22n1425_001:0227b24_23"
    },
    {
        "source_sentence": "以線連故。",
        "translation": "It's because the threads are connected.",
        "source": "T22n1425_001:0227b24_24"
    },
    {
        "source_sentence": "如是舍利弗！",
        "translation": "Thus, Śāriputra!",
        "source": "T22n1425_001:0227b24_25"
    },
    {
        "source_sentence": "如來廣說九部經，為聲聞制戒，立說波羅提木叉法，是以如來滅後法得久住。",
        "translation": "The Tathāgata spoke extensively of nine kinds of scriptures, established the precepts for śrāvakas, and taught the prātimokṣaṣa-dharma. This is how the dharma that comes after the demise of the Tathāgata can abide for a long time.",
        "source": "T22n1425_001:0227b25_26"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T22n1425_001:0227b27_0"
    },
    {
        "source_sentence": "以是因緣故，教法有久住、有不久住者。」",
        "translation": "Because of these causes and conditions, there are those who teach that the Dharma has a long abiding and those who have a short abiding.",
        "source": "T22n1425_001:0227b27_1"
    },
    {
        "source_sentence": "爾時尊者舍利弗白佛言：「唯願世尊！",
        "translation": "It was then that Venerable Śāriputra said to the Buddha, Please, Bhagavān!",
        "source": "T22n1425_001:0227b28_2"
    },
    {
        "source_sentence": "廣說九部經，善為聲聞制戒，立說波羅提木叉法，令教法久住，為諸天世人開甘露門。」",
        "translation": "He extensively teaches nine kinds of scriptures that well establish precepts for śrāvakas, establishes the prātimokṣa teachings, causes the teachings to abide for a long time, and opens the gate of ambrosia for gods and humans.",
        "source": "T22n1425_001:0227b28_3"
    },
    {
        "source_sentence": "爾時佛告舍利弗：「如來不以無過患因緣而為弟子制戒、立說波羅提木叉法。",
        "translation": "It was then that the Buddha addressed Śāriputra, The Tathāgata doesn't establish precepts and explain the prātimokṣa teachings for his disciples because of faultless causes and conditions.",
        "source": "T22n1425_001:0227c01_4"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T22n1425_001:0227c03_5"
    },
    {
        "source_sentence": "譬如轉輪聖王不以無過而為婆羅門居士而制刑罰。",
        "translation": "It's like a wheel-turning sage king who doesn't impose punishment on a Brāhmaṇa householder because he doesn't do so without fault.",
        "source": "T22n1425_001:0227c03_6"
    },
    {
        "source_sentence": "如是舍利弗！",
        "translation": "Thus, Śāriputra!",
        "source": "T22n1425_001:0227c05_0"
    },
    {
        "source_sentence": "如來亦復如是，不以無過患因緣而為弟子制戒、立說波羅提木叉法。",
        "translation": "The Tathagata is also like this: he does not establish the precepts or expound the prātimokṣa-dharma for his disciples by means of faultless causes and conditions.",
        "source": "T22n1425_001:0227c05_1"
    },
    {
        "source_sentence": "然舍利弗！",
        "translation": "Still, Śāriputra!",
        "source": "T22n1425_001:0227c06_2"
    },
    {
        "source_sentence": "當來有正信善男子，於佛法中信家非家捨家出家，或有心亂顛倒起於淨想，三毒熾盛而犯諸罪。",
        "translation": "In the future, if there are right faithful good men who believe in the Buddha's teaching and leave home or renounce home without home, or if they have a mind that's disturbed and mistaken and give rise to pure thoughts, the three poisons will be so intense that they'll commit crimes.",
        "source": "T22n1425_001:0227c07_3"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T22n1425_001:0227c09_4"
    },
    {
        "source_sentence": "是時如來當為弟子制戒、立說波羅提木叉法。",
        "translation": "The Tathāgata then will establish the precepts for his disciples and explain the prātimokṣaṣa dharma for them.",
        "source": "T22n1425_001:0227c09_5"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T22n1425_001:0227c10_6"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T22n1425_001:0227c10_7"
    },
    {
        "source_sentence": "如來自當知時。」",
        "translation": "When the Tathāgata knows, he'll know.",
        "source": "T22n1425_001:0227c10_8"
    },
    {
        "source_sentence": "舍利弗言：「唯然世尊！",
        "translation": "Śāriputra said, Yes, Bhagavān!",
        "source": "T22n1425_001:0227c11_9"
    },
    {
        "source_sentence": "如來自當知時。」",
        "translation": "When the Tathāgata knows, he'll know.",
        "source": "T22n1425_001:0227c11_10"
    },
    {
        "source_sentence": "　是時舍利弗，　　偏袒而合掌，",
        "translation": "Śāriputra then bared his shoulders and joined his palms.",
        "source": "T22n1425_001:0227c12_0"
    },
    {
        "source_sentence": "　隨順轉法輪，　　請求最勝說。",
        "translation": "Following the turning of the wheel of the Dharma, he asks for the most excellent explanation.",
        "source": "T22n1425_001:0227c13_0"
    },
    {
        "source_sentence": "　勸請於世尊：　　「今正是其時，",
        "translation": "Encourage the Bhagavān, “Now is the right occasion.",
        "source": "T22n1425_001:0227c14_0"
    },
    {
        "source_sentence": "　願為弟子眾，　　廣制戒律儀。",
        "translation": "I pray that my disciples will extensively regulate the precepts and restraints.",
        "source": "T22n1425_001:0227c15_0"
    },
    {
        "source_sentence": "　能令佛正法，　　長夜得久住；",
        "translation": "They can cause the Buddha’s true teaching To remain for a long time, For a long time to come.",
        "source": "T22n1425_001:0227c16_0"
    },
    {
        "source_sentence": "　顯示甘露門，　　開化天人眾。」",
        "translation": "He reveals the gate of ambrosia and enlightens the gods and humans.",
        "source": "T22n1425_001:0227c17_0"
    },
    {
        "source_sentence": "　彼住最後身，　　作此勸請已；",
        "translation": "In their final body, Having undertaken this exhortation, The enlightening beings abide in the state of nonobstruction:",
        "source": "T22n1425_001:0227c18_0"
    },
    {
        "source_sentence": "　爾時最勝告，　　尊者舍利弗：",
        "translation": "It was then that the Supreme One addressed Venerable Śāriputra,",
        "source": "T22n1425_001:0227c19_0"
    },
    {
        "source_sentence": "「弟子未有罪，　　眾僧悉清淨；",
        "translation": "The disciples are not guilty, yet the community of monks is completely pure.",
        "source": "T22n1425_001:0227c20_0"
    },
    {
        "source_sentence": "　諸佛未曾有，　　無過而制戒。",
        "translation": "Unprecedented is the buddha-work of setting precepts without error.",
        "source": "T22n1425_001:0227c21_0"
    },
    {
        "source_sentence": "　譬如世界主，　　王領其國土；",
        "translation": "It is as if the ruler of a world ruled his kingdom.",
        "source": "T22n1425_001:0227c22_0"
    },
    {
        "source_sentence": "　無有無過人，　　而加其刑罰。",
        "translation": "There is no one who does not violate the precepts And yet imposes punishment upon them.",
        "source": "T22n1425_001:0227c23_0"
    },
    {
        "source_sentence": "　彼喻此亦然，　　世尊天人師；",
        "translation": "The same is true of this metaphor, Bhagavān, teacher of gods and humans.",
        "source": "T22n1425_001:0227c24_0"
    },
    {
        "source_sentence": "　未有無過患，　　而制弟子戒。",
        "translation": "There are no faults or distress, Yet they regulate the disciples’ precepts.",
        "source": "T22n1425_001:0227c25_0"
    },
    {
        "source_sentence": "　過患既已起，　　時有犯惡者；",
        "translation": "When faults and distress have already arisen, Someone commits evil deeds.",
        "source": "T22n1425_001:0227c26_0"
    },
    {
        "source_sentence": "　是時天人師，　　為眾制律儀。",
        "translation": "The teacher of gods and humans then established the precepts for the sake of the crowd.",
        "source": "T22n1425_001:0227c27_0"
    },
    {
        "source_sentence": "　過去、未來世，　　佛眼靡不見；",
        "translation": "In past and future ages The Buddha’s eye does not see anyone.",
        "source": "T22n1425_001:0227c28_0"
    },
    {
        "source_sentence": "　隨其事輕重，　　隨其輕重制。」",
        "translation": "According to the relative seriousness of these things, they are regulated according to their relative seriousness.",
        "source": "T22n1425_001:0227c29_0"
    },
    {
        "source_sentence": "　說此正法時，　　在於祇洹林；",
        "translation": "When he preached this true teaching, He was staying at Jeta’s Grove.",
        "source": "T22n1425_001:0228a01_0"
    },
    {
        "source_sentence": "　舍利弗勸請，　　世尊答如是。",
        "translation": "Śāriputra encouraged him, and the Bhagavān answered in this way.",
        "source": "T22n1425_001:0228a02_0"
    },
    {
        "source_sentence": "爾時諸比丘白佛言：「世尊！",
        "translation": "It was then that the monks said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0228a03_0"
    },
    {
        "source_sentence": "云何尊者舍利弗，諸比丘未有過患，而請世尊制戒、立說波羅提木叉法？」",
        "translation": "How did Venerable Śāriputra, the monks who had no faults and invited the Bhagavān to establish precepts and teach the prātimokṣa-dharma?",
        "source": "T22n1425_001:0228a03_1"
    },
    {
        "source_sentence": "佛告諸比丘：「舍利弗不但今日未有過患而請制戒，彼於昔時在一城邑聚落，人民居士未有過患，亦曾請我制諸刑罰。」",
        "translation": "The Buddha told the monks, Not only did Śāriputra not have any faults today, but he asked me to regulate the precepts; in the past, he was in a town or village, and his people and householders had no faults, so he asked me to regulate the punishments.",
        "source": "T22n1425_001:0228a05_2"
    },
    {
        "source_sentence": "諸比丘白佛言：「世尊！",
        "translation": "The monks said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0228a07_3"
    },
    {
        "source_sentence": "乃往昔時已有此耶？」",
        "translation": "Is there something like this in the past?",
        "source": "T22n1425_001:0228a08_4"
    },
    {
        "source_sentence": "佛言：「如是。」",
        "translation": "The Buddha said, So it is.",
        "source": "T22n1425_001:0228a08_5"
    },
    {
        "source_sentence": "諸比丘白佛言：「世尊！",
        "translation": "The monks said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0228a09_6"
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "I'd like to hear it.",
        "source": "T22n1425_001:0228a09_7"
    },
    {
        "source_sentence": "佛告諸比丘：「過去世時有城名波羅奈，國名迦尸。",
        "translation": "The Buddha told the monks, In a past life, there was a city named Vārāṇasī and a country named Kāśi.",
        "source": "T22n1425_001:0228a09_8"
    },
    {
        "source_sentence": "彼時國王號曰大名稱，以法治化，無有怨敵，布施持戒，汎愛人物、善攝眷屬。",
        "translation": "The king of that country, named Mahāmaudgalyāyana, ruled and educated the people according to the Dharma without any enemies or opponents. He bestowed charity on them and observed the precepts; he loved all living beings and had well-maintained assemblies of followers.",
        "source": "T22n1425_001:0228a11_0"
    },
    {
        "source_sentence": "法王御世，人民殷盛，富樂豐實，聚落村邑雞飛相接，舉國人民更相敬愛，種種眾伎共相娛樂。",
        "translation": "The king of the Dharma ruled over the world. His people were prosperous and wealthy, rich and prosperous; villages and towns lived together like birds flying in close proximity to each other. All the citizens of the country loved one another and enjoyed various kinds of amusements with him.",
        "source": "T22n1425_001:0228a12_1"
    },
    {
        "source_sentence": "時有大臣名曰陶利，多諸策謀，作是思惟：『今此王境自然富樂人民熾盛，城邑聚落雞飛相接，舉國人民更相敬愛，種種眾伎共相娛樂。』",
        "translation": "A minister named Tauli then had many strategies and thoughts, saying, 'Now that this kingdom's territory is naturally wealthy and prosperous, the cities and villages are connected by flying chickens, the people of the country become more respectful to each other, and various kinds of tricks are played together.'",
        "source": "T22n1425_001:0228a14_2"
    },
    {
        "source_sentence": "時彼大臣往白王言：『今日境界自然富樂人民熾盛，城邑聚落雞飛相接，舉國人民更相敬愛，種種伎樂共相娛樂。",
        "translation": "The minister then went to the king and said, 'Today, the realm of natural wealth and happiness and the people are so prosperous that cities and villages fly together, and all the citizens of the country love each other and enjoy various kinds of music and games.",
        "source": "T22n1425_001:0228a17_3"
    },
    {
        "source_sentence": "願王當為斯等制立刑罰，莫令極樂生諸過患。』",
        "translation": "May the king impose punishment for these things, so that they won't cause their faults and distress to arise in paradise.'",
        "source": "T22n1425_001:0228a20_4"
    },
    {
        "source_sentence": "王言：『止！",
        "translation": "The king said, 'Stop!",
        "source": "T22n1425_001:0228a21_5"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T22n1425_001:0228a21_6"
    },
    {
        "source_sentence": "此言不可。",
        "translation": "This is called 'unacceptable.'",
        "source": "T22n1425_001:0228a21_7"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T22n1425_001:0228a22_8"
    },
    {
        "source_sentence": "過患未起而欲制罰。』",
        "translation": "Before the faults and distress arise, they want to punish them.'",
        "source": "T22n1425_001:0228a22_9"
    },
    {
        "source_sentence": "臣復白王：『當防未來，莫令極樂生諸過患。』",
        "translation": "The ministers again said to the king, 'Should you guard against future troubles and not cause extreme happiness to give rise to faults and distress?'",
        "source": "T22n1425_001:0228a22_10"
    },
    {
        "source_sentence": "時王作是思惟：『今此大臣聰明智謀，多諸朋黨不可卒制，今若呵責或生咎釁。』",
        "translation": "The king then thought, 'Now, this minister is so wise and cunning that many of his friends can't be disciplined; now, if they criticize him or blame him.'",
        "source": "T22n1425_001:0228a23_11"
    },
    {
        "source_sentence": "「『勢力喜瞋恚，　　難可卒呵制；",
        "translation": "'It's difficult to stop the momentum of joy and anger that can't be overcome by a sudden rebuke.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　橫生人過患，　　此事甚不可。",
        "translation": "This is really unacceptable for the faults and distress of people who are born horizontally.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　大人多慈愍，　　知人實有過；",
        "translation": "The great man is compassionate and kind, Knowing people’s true faults.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　猶尚復觀察，　　哀愍加其罰。",
        "translation": "They're still observing it, and they're pitifully punished.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　惡人喜惱他，　　不審其過罪；",
        "translation": "A bad person delights in harming others And doesn’t judge their faults.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　而加其刑罰，　　自損惡名增。",
        "translation": "Instead, they'll be subject to punishment, which will harm themselves and increase their bad reputation.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　如王好威怒，　　枉害加良善；",
        "translation": "Like the king’s good and mighty anger, They inflict harm on those who do good deeds.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　惡名流四遠，　　死則墮惡道。",
        "translation": "A bad reputation flows for four long distances, and when he dies, he'll fall into a bad path.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　正法化黎庶，　　身口意清淨；",
        "translation": "The right teaching transforms the masses, His body, speech, and thought are pure.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　忍辱行四等，　　是謂人中王。",
        "translation": "The four forms of forbearance and conduct are said to be the king among humans.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　王為人中上，　　宜制忿怒心：",
        "translation": "The king is the best among men, so it's better to restrain his wrathful mind:",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　仁愛恕有罪，　　哀愍加刑罰。』",
        "translation": "benevolent and sympathetic, forgive the sins of those who compassionately punish them.'",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "「『最勝人中王，　　願永蔭黎庶；",
        "translation": "The supreme among humans is the king, Who wishes to give eternal shade to the common people.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　忍辱自調伏，　　道化怨自降。",
        "translation": "Forbearance is self-controlled, and the path transforms enemies to subdue themselves.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　王德被無外，　　祚隆永無窮；",
        "translation": "The king’s virtue is unattached, And his prosperity never ends.",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "　　以道治天下，　　常為天人王。』」",
        "translation": "He governs the world with the path, always being the king of gods and humans.'",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "爾時國王欲微誨大臣，即說偈言：「爾時大臣聞王所說，心大歡喜而說偈言：佛告諸比丘：「爾時國王大名稱者，豈異人乎？",
        "translation": "Desiring to briefly admonish the ministers, the king then spoke a verse, saying, When the ministers heard what the king said, they rejoiced and spoke in verse, saying, The Buddha told the monks, Isn't that someone else who was so greatly renowned by the king at the time?",
        "source": "T22n1425_001:0228a25_12"
    },
    {
        "source_sentence": "則我身是。",
        "translation": "Then the self-body is self.",
        "source": "T22n1425_001:0228b16_0"
    },
    {
        "source_sentence": "時大臣陶利者，舍利弗是。",
        "translation": "The minister of the time,陶利, was Śāriputra.",
        "source": "T22n1425_001:0228b16_1"
    },
    {
        "source_sentence": "爾時城邑聚落長者居士未有過患，而彼請我令制刑罰。",
        "translation": "It was then that the city and village elders and householders didn't have any faults, but they asked me to punish them.",
        "source": "T22n1425_001:0228b16_2"
    },
    {
        "source_sentence": "今諸比丘過患未起，而復請我為諸弟子制戒、立說波羅提木叉法。」",
        "translation": "Now, the monks' faults and distress haven't yet arisen, but they also invite me to establish precepts for their disciples and teach them the prātimokṣa-dharma.",
        "source": "T22n1425_001:0228b18_3"
    },
    {
        "source_sentence": "爾時世尊從舍衛城隨所樂住已，於憍薩羅國人間遊行，與大比丘眾五百人前後圍遶，詣憍薩羅國耕田婆羅門聚落。",
        "translation": "After the Bhagavān had left Sāvatthī and stayed there as he wished, the Bhagavān traveled among the people of Tathāgata's country, surrounded by a large group of five hundred monks in front and behind him, to the Brāhmaṇa village where he cultivated his land in Tathāgata's country.",
        "source": "T22n1425_001:0228b19_4"
    },
    {
        "source_sentence": "到已於耕田林中住。",
        "translation": "When he arrived, he stayed in the cultivated fields and forests.",
        "source": "T22n1425_001:0228b22_5"
    },
    {
        "source_sentence": "於是世尊晡時從三昧起，周遍觀察上下諸方又復視前平地，而發微笑往來經行。",
        "translation": "The Bhagavān then rose from his samādhi when he was hungry and looked around in all directions, looked up and down in all directions, looked at the front level ground again, smiled, and walked back and forth.",
        "source": "T22n1425_001:0228b22_6"
    },
    {
        "source_sentence": "時舍利弗見世尊從三昧起周遍觀察上下諸方又復視前平地，而發微笑往來經行，見已往詣眾多比丘所，語比丘言：「諸長老！",
        "translation": "When Śāriputra saw the Bhagavān rise from his samādhi, he looked around in all directions, looked up and down in all directions, looked at the front level ground again, smiled, walked back and forth, went to the many monks when he saw them, and said to the monks, Elders!",
        "source": "T22n1425_001:0228b24_7"
    },
    {
        "source_sentence": "我向見世尊從三昧起，觀察諸方乃至往來經行。",
        "translation": "I've seen the Bhagavān arise from samādhi and observed his past and future sūtras in all directions.",
        "source": "T22n1425_001:0228b27_8"
    },
    {
        "source_sentence": "諸長老！",
        "translation": "Elders!",
        "source": "T22n1425_001:0228b28_9"
    },
    {
        "source_sentence": "如來、應供、正遍知，不以無因緣而起微笑。",
        "translation": "The Tathāgata, Worthy of Offerings, and Perfectly Enlightened One don't smile without a reason.",
        "source": "T22n1425_001:0228b28_10"
    },
    {
        "source_sentence": "若往請問，必當聞說過去宿命久遠之事。",
        "translation": "If you go there to ask questions, you'll surely hear about the long-standing events of past lives.",
        "source": "T22n1425_001:0228b29_11"
    },
    {
        "source_sentence": "我等今日當詣世尊問如此義，如佛所說我當奉行。」",
        "translation": "Today, we will go to the Bhagavān to ask him about this meaning, and as the Buddha explains it, we will follow it.",
        "source": "T22n1425_001:0228c01_12"
    },
    {
        "source_sentence": "諸比丘聞舍利弗說已，即與舍利弗，共詣世尊所頭面禮足，禮足已隨佛經行。",
        "translation": "After hearing what Śāriputra said, the monks and Śāriputra went together to the Bhagavān's place and bowed their foreheads and feet at his feet, and after bowing their feet, they followed the Buddha's steps.",
        "source": "T22n1425_001:0228c02_13"
    },
    {
        "source_sentence": "時尊者舍利弗白佛言：「向見世尊從三昧起，觀察諸方乃至往來經行，我即往詣眾多比丘所，語比丘言：『諸長老！",
        "translation": "Venerable Śāriputra then said to the Buddha, I've seen the Bhagavān rise from his samādhi and observed all directions up to the places where he came and went, so I went to the many monks and said to the monks, 'Elders!",
        "source": "T22n1425_001:0228c04_14"
    },
    {
        "source_sentence": "我向見世尊從三昧起，觀察諸方乃至往來經行。",
        "translation": "I've seen the Bhagavān arise from samādhi and observed his past and future sūtras in all directions.",
        "source": "T22n1425_001:0228c07_15"
    },
    {
        "source_sentence": "諸長老！",
        "translation": "Elders!",
        "source": "T22n1425_001:0228c08_16"
    },
    {
        "source_sentence": "如來、應供、正遍知，不以無因緣而笑。",
        "translation": "The Tathāgata, Worthy of Offerings, and Perfectly Enlightened One don't laugh for no reason.",
        "source": "T22n1425_001:0228c08_17"
    },
    {
        "source_sentence": "若往請問，必當聞說過去宿命久遠之事。",
        "translation": "If you go there to ask questions, you'll surely hear about the long-standing events of past lives.",
        "source": "T22n1425_001:0228c09_18"
    },
    {
        "source_sentence": "我等今日當詣世尊問如此義，如佛所說我當奉行。』",
        "translation": "Today, we will go to the Bhagavān to ask him about this meaning, and as the Buddha explains it, we will follow it.'",
        "source": "T22n1425_001:0228c10_19"
    },
    {
        "source_sentence": "不審世尊！",
        "translation": "I don't know, Bhagavān!",
        "source": "T22n1425_001:0228c11_20"
    },
    {
        "source_sentence": "有何因緣而發微笑？」",
        "translation": "What are the causes and conditions that make a smile?",
        "source": "T22n1425_001:0228c11_21"
    },
    {
        "source_sentence": "爾時世尊，出金色臂指地告舍利弗：「汝見此地不？」",
        "translation": "It was then that the Bhagavān emerged from the ground with golden-colored arms and fingers and addressed Śāriputra, Do you see this ground?",
        "source": "T22n1425_001:0228c12_22"
    },
    {
        "source_sentence": "舍利弗言：「唯然已見。」",
        "translation": "Śāriputra said, Yes, I've seen it.",
        "source": "T22n1425_001:0228c13_23"
    },
    {
        "source_sentence": "佛言：「此地是迦葉佛故園林處，此一處是迦葉佛精舍處，此一處是經行處，此一處是坐禪處。」",
        "translation": "The Buddha said, This place is the place where Kāśyapa Buddha's old garden and forest are located, this place is where Kāśyapa Buddha's monastery is located, this place is where he walks up and down, and this place is where he sits in meditation.",
        "source": "T22n1425_001:0228c13_24"
    },
    {
        "source_sentence": "爾時尊者舍利弗，即取僧伽梨襞為四褺，即布是地。",
        "translation": "At the time, Venerable Śāriputra took the saṃghṛṣaṇī into four bowls and spread it on this ground.",
        "source": "T22n1425_001:0228c15_25"
    },
    {
        "source_sentence": "布是地已，偏袒右肩、右膝著地，合掌白佛言：「唯願世尊！",
        "translation": "After spreading it on the ground, he bared his right shoulder and knelt with his right knee on the ground, joined his palms together, and said to the Buddha, Please, Bhagavān!",
        "source": "T22n1425_001:0228c17_26"
    },
    {
        "source_sentence": "坐此座上，當令此地為二佛坐處。」",
        "translation": "If you sit on this seat, you will cause this place to be the seat of the two buddhas.",
        "source": "T22n1425_001:0228c18_27"
    },
    {
        "source_sentence": "爾時世尊即受而坐，尊者舍利弗禮佛足已，於一面坐而白佛言：「世尊！",
        "translation": "It was then that the Bhagavān accepted it and sat down, and Venerable Śāriputra bowed at his feet, sat to one side, and said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0228c19_28"
    },
    {
        "source_sentence": "有幾事利益，如來、應供、正遍知為弟子制戒、立說波羅提木叉法？」",
        "translation": "How many things are beneficial to the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One who establishes precepts for his disciples and explains the prātimokṣa teachings for them?",
        "source": "T22n1425_001:0228c20_29"
    },
    {
        "source_sentence": "佛告舍利弗：「有十事利益故，諸佛如來為諸弟子制戒、立說波羅提木叉法。",
        "translation": "The Buddha told Śāriputra, There are ten things that benefit the buddhas and tathāgatas who establish precepts for their disciples and explain the prātimokṣa-dharma for their sake.",
        "source": "T22n1425_001:0228c22_30"
    },
    {
        "source_sentence": "何等十？",
        "translation": "What are these ten?",
        "source": "T22n1425_001:0228c23_31"
    },
    {
        "source_sentence": "一者攝僧故；",
        "translation": "The first is because it includes the samgha.",
        "source": "T22n1425_001:0228c24_32"
    },
    {
        "source_sentence": "二者極攝僧故；",
        "translation": "The second is because they ultimately embrace the samgha.",
        "source": "T22n1425_001:0228c24_33"
    },
    {
        "source_sentence": "三者令僧安樂故；",
        "translation": "The third is to bring peace and happiness to the sangha.",
        "source": "T22n1425_001:0228c24_34"
    },
    {
        "source_sentence": "四者折伏無羞人故；",
        "translation": "The fourth is to subdue those without shame.",
        "source": "T22n1425_001:0228c25_35"
    },
    {
        "source_sentence": "五者有慚愧人得安隱住故；",
        "translation": "The fifth is because those with shame are able to abide peacefully.",
        "source": "T22n1425_001:0228c25_36"
    },
    {
        "source_sentence": "六者不信者令得信故；",
        "translation": "The sixth is to cause those who disbelieve to attain faith.",
        "source": "T22n1425_001:0228c26_37"
    },
    {
        "source_sentence": "七者已信者增益信故；",
        "translation": "The seventh is that those who have faith increase in faith.",
        "source": "T22n1425_001:0228c26_38"
    },
    {
        "source_sentence": "八者於現法中得漏盡故；",
        "translation": "The eighth is the attainment of cessation of contamination in the present life.",
        "source": "T22n1425_001:0228c27_39"
    },
    {
        "source_sentence": "九者未生諸漏令不生故；",
        "translation": "The ninth is to prevent the arising of impure influences that have not yet arisen.",
        "source": "T22n1425_001:0228c27_40"
    },
    {
        "source_sentence": "十者正法得久住，為諸天人開甘露施門故。",
        "translation": "Tenth, the right teaching obtains long abiding because it opens the gate of ambrosia giving for gods and humans.",
        "source": "T22n1425_001:0228c28_41"
    },
    {
        "source_sentence": "以是十事，如來、應供、正遍知為諸弟子制戒、立說波羅提木叉法。」",
        "translation": "Because of these ten things, the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One established precepts for his disciples and taught them the prātimokṣa-dharma.",
        "source": "T22n1425_001:0228c29_42"
    },
    {
        "source_sentence": "　是時舍利弗，　　偏袒而合掌；",
        "translation": "Śāriputra then bared his shoulders and joined his palms.",
        "source": "T22n1425_001:0229a02_0"
    },
    {
        "source_sentence": "　隨順轉法輪，　　請問於最勝。",
        "translation": "Following the turning of the wheel of the Dharma, he asks the most superior questions.",
        "source": "T22n1425_001:0229a03_0"
    },
    {
        "source_sentence": "　彼住最後身，　　合掌請問已，",
        "translation": "In his last body, he joins his palms and asks questions.",
        "source": "T22n1425_001:0229a04_0"
    },
    {
        "source_sentence": "　爾時最勝告，　　尊者舍利弗：",
        "translation": "It was then that the Supreme One addressed Venerable Śāriputra,",
        "source": "T22n1425_001:0229a05_0"
    },
    {
        "source_sentence": "「有十功德利，　　如來所知見，",
        "translation": "“There are ten virtues and benefits that the Tathāgata knows and sees.",
        "source": "T22n1425_001:0229a06_0"
    },
    {
        "source_sentence": "　故為諸弟子，　　廣制戒律儀。",
        "translation": "That's why the disciples established extensive precepts and restraints.",
        "source": "T22n1425_001:0229a07_0"
    },
    {
        "source_sentence": "　攝僧、極攝故；　　令僧安樂住；",
        "translation": "It is because it brings together the samgha and its extremes, enabling the samgha to abide in ease.",
        "source": "T22n1425_001:0229a08_0"
    },
    {
        "source_sentence": "　折伏無羞人；　　慚愧得安隱；",
        "translation": "He subdued the shameless and found peace in shame.",
        "source": "T22n1425_001:0229a09_0"
    },
    {
        "source_sentence": "　不信令入信；　　已信者增益；",
        "translation": "Those who do not believe cause others to believe, and those who have already believed increase.",
        "source": "T22n1425_001:0229a10_0"
    },
    {
        "source_sentence": "　現法得漏盡；　　未生漏不生；",
        "translation": "In the present life, they attain the extinction of the defilements and do not produce the defilements that have not yet arisen.",
        "source": "T22n1425_001:0229a11_0"
    },
    {
        "source_sentence": "　正法得久住，　　開甘露施門。」",
        "translation": "The right teaching has been abiding for a long time, and it opens the gate of ambrosia giving.",
        "source": "T22n1425_001:0229a12_0"
    },
    {
        "source_sentence": "　說是正法時，　　在於耕田林，",
        "translation": "When he teaches the right teaching, He's in a plowing field or forest.",
        "source": "T22n1425_001:0229a13_0"
    },
    {
        "source_sentence": "　舍利弗請問，　　世尊答如是。",
        "translation": "Śāriputra asked the question, and the Bhagavān answered like this.",
        "source": "T22n1425_001:0229a14_0"
    },
    {
        "source_sentence": "爾時世尊於耕田聚落隨所樂住已，從憍薩羅國遊行向跋耆國。",
        "translation": "After the Bhagavān had settled in a cultivated village wherever he wished, he traveled from Kośala to Vajji.",
        "source": "T22n1425_001:0229a15_0"
    },
    {
        "source_sentence": "爾時世尊與五百比丘俱，到跋耆國毘舍離城，住大林重閣精舍。",
        "translation": "The Bhagavān and his five hundred monks then went to the city of Vaiśālī in the country of Vṛji and stayed in a large forest pavilion monastery.",
        "source": "T22n1425_001:0229a16_1"
    },
    {
        "source_sentence": "爾時毘舍離城，人民飢饉五穀不熟，白骨縱橫乞食難得。",
        "translation": "At the time, the city of Vaiśālī was starving and the five grains didn't ripen, and white bones were lying horizontally begging for food that was difficult to obtain.",
        "source": "T22n1425_001:0229a17_2"
    },
    {
        "source_sentence": "毘舍離城有長者子，名曰耶舍，信家非家、捨家出家，其父名迦蘭陀，故諸梵行者皆稱為迦蘭陀子。",
        "translation": "In Vaiśālī, there was an elderly man's son named Yaśas who believed that the home was not a home and left home; his father was named Kālānda, so all religious practitioners called him the Kālānda child.",
        "source": "T22n1425_001:0229a19_3"
    },
    {
        "source_sentence": "時世飢饉乞食難得，每至食時多還家食，其母告耶舍言：「子！",
        "translation": "When the world was hungry and begged for food that was difficult to obtain, his mother told Yaśas, Son!",
        "source": "T22n1425_001:0229a21_4"
    },
    {
        "source_sentence": "汝甚為大苦，剃除鬚髮著弊納衣，持鉢乞食為世人所笑。",
        "translation": "You're so painful that you shaved your hair and beard, put on the outdated undergarments, carried bowls to solicit alms, and were laughed at by the world.",
        "source": "T22n1425_001:0229a22_5"
    },
    {
        "source_sentence": "今此家中大有財物，汝父母錢及餘先祖財寶，恣汝所欲；",
        "translation": "Your parents’ money and the riches of your ancestors’ property are freely given to you as you wish.",
        "source": "T22n1425_001:0229a24_6"
    },
    {
        "source_sentence": "且汝愛婦今猶故在，當共生活，何以如是受諸勤苦？",
        "translation": "Now that your beloved wife is still here, why would you endure such pain and suffering if you were to live together?",
        "source": "T22n1425_001:0229a25_7"
    },
    {
        "source_sentence": "汝當歸家受五欲樂，自恣布施、種諸功德、供養三寶。」",
        "translation": "You must return home to receive the five desires and pleasures, make your own offerings, plant merits, and make offerings to the Three Treasures.",
        "source": "T22n1425_001:0229a26_8"
    },
    {
        "source_sentence": "爾時耶舍白母言：「願母止！",
        "translation": "It was then that Yaśas said to his mother, May she stop!",
        "source": "T22n1425_001:0229a27_9"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T22n1425_001:0229a28_10"
    },
    {
        "source_sentence": "我樂修梵行。」",
        "translation": "I'm happy to cultivate the religious practice.",
        "source": "T22n1425_001:0229a28_11"
    },
    {
        "source_sentence": "其母復第二、第三所勸如初，耶舍答亦如先。",
        "translation": "The second and third words of his mother's exhortation are like the first, and Yaśas answered as before.",
        "source": "T22n1425_001:0229a28_12"
    },
    {
        "source_sentence": "母復重言：「汝若不樂在家者，當乞我種以續繼嗣，莫令門戶斷絕、財物沒官。」",
        "translation": "Again, the mother said again, If you don't enjoy staying at home, ask my family to continue to inherit it so that their doors won't be cut off and their possessions won't disappear.",
        "source": "T22n1425_001:0229a29_13"
    },
    {
        "source_sentence": "爾時耶舍即白母言：「今欲使我於此中留種子者，當奉此勅。」",
        "translation": "It was then that Yaśas said to his mother, Now, if you want me to leave the seeds here, you must follow this command.",
        "source": "T22n1425_001:0229b02_14"
    },
    {
        "source_sentence": "母即歡喜疾入婦房語新婦言：「汝速莊嚴，著耶舍本所愛樂嚴身之服，與之相見。」",
        "translation": "The mother then joyfully and quickly entered the woman's room and said to the new wife, Quickly adorn yourself, put on the robe that Yaśas originally loved and adorned your body, and see each other.",
        "source": "T22n1425_001:0229b03_15"
    },
    {
        "source_sentence": "新婦答言：「爾。」",
        "translation": "The new wife replied, Yes.",
        "source": "T22n1425_001:0229b05_16"
    },
    {
        "source_sentence": "即便莊嚴如教所勅。",
        "translation": "It's even adorned as instructed by the teaching.",
        "source": "T22n1425_001:0229b05_17"
    },
    {
        "source_sentence": "爾時耶舍即與其婦共相娛樂，如其俗法，於是其婦遂便有娠，月滿生子。",
        "translation": "It was then that Yaśas and his wife were entertained together, according to their custom. So the woman became pregnant and gave birth to a child in full moon.",
        "source": "T22n1425_001:0229b06_18"
    },
    {
        "source_sentence": "其家議言：「本為乞種故，今當立字名為續種。」",
        "translation": "The family councilor said, In the past, it was for the sake of the seed of begging, so now we'll establish the word'seed of continuity.'",
        "source": "T22n1425_001:0229b08_19"
    },
    {
        "source_sentence": "爾時世人皆名為續種，父續種、母續種、祖續種，錢財一切皆名續種。",
        "translation": "At the time, all people in the world were called continuing seeds, and their fathers were continuing seeds, mothers were continuing seeds, and grandfathers were continuing seeds, and all money and possessions were all called continuing seeds.",
        "source": "T22n1425_001:0229b09_20"
    },
    {
        "source_sentence": "所有如是惡名流布，道俗悉聞。",
        "translation": "All such bad names are spread, and all the monks and laypeople hear them.",
        "source": "T22n1425_001:0229b10_21"
    },
    {
        "source_sentence": "爾時耶舍聞惡名已，為續種子父，大自慚愧，恥其所聞，作是思惟：「沙門釋種中，未曾見聞有如此事。",
        "translation": "Yaśas then heard the bad reputation and became the father of the next generation of seedlings. Being greatly embarrassed and ashamed of what he had heard, he thought: I have never seen or heard anything like this among the śramaṇas and brāhmaṇas of the Śākya clan.",
        "source": "T22n1425_001:0229b11_22"
    },
    {
        "source_sentence": "此為法耶？",
        "translation": "Is this the Dharma?",
        "source": "T22n1425_001:0229b13_23"
    },
    {
        "source_sentence": "為非法耶？",
        "translation": "Is it unlawful?",
        "source": "T22n1425_001:0229b13_24"
    },
    {
        "source_sentence": "我今當以此事廣白尊者舍利弗，舍利弗當以此事具白世尊，如世尊教，我當奉行。」",
        "translation": "Now, I will explain this matter to Venerable Śāriputra in detail, and Śāriputra will explain it to the Bhagavān in detail, just as the Bhagavān teaches, and I will follow it.",
        "source": "T22n1425_001:0229b14_25"
    },
    {
        "source_sentence": "時耶舍疾往詣尊者舍利弗所，廣說上事。",
        "translation": "Yaśas then quickly went to Venerable Śāriputra and explained the above matter in detail.",
        "source": "T22n1425_001:0229b16_26"
    },
    {
        "source_sentence": "尊者舍利弗，與耶舍共詣世尊所，頭面禮足却坐一面。",
        "translation": "Venerable Śāriputra went with Yaśas to the Bhagavān, bowed his head and feet, and withdrew to sit at one side.",
        "source": "T22n1425_001:0229b17_0"
    },
    {
        "source_sentence": "坐已尊者舍利弗具以上事廣白世尊。",
        "translation": "After he sat down, Venerable Śāriputra explained the above to the Bhagavān in detail.",
        "source": "T22n1425_001:0229b18_1"
    },
    {
        "source_sentence": "佛問耶舍：「汝實有是事不？」",
        "translation": "The Buddha asked Yaśas, Do you really have this thing?",
        "source": "T22n1425_001:0229b19_2"
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, Indeed.",
        "source": "T22n1425_001:0229b19_3"
    },
    {
        "source_sentence": "佛言：「耶舍！",
        "translation": "The Buddha said, Yes!",
        "source": "T22n1425_001:0229b19_4"
    },
    {
        "source_sentence": "是為大過，比丘僧中未曾有此。",
        "translation": "This is a great error, unprecedented among the monks and nuns of the saṃgha.",
        "source": "T22n1425_001:0229b20_5"
    },
    {
        "source_sentence": "汝愚癡人！",
        "translation": "You foolish man!",
        "source": "T22n1425_001:0229b20_6"
    },
    {
        "source_sentence": "最初開大罪門，未有漏患而起漏患。",
        "translation": "The first opens the door to great sin, which produces contaminants and afflictions before there are contaminants.",
        "source": "T22n1425_001:0229b21_7"
    },
    {
        "source_sentence": "天魔波旬常求諸比丘短而不能得，汝今最初開魔徑路。",
        "translation": "Deva Māra Pāpīyān always asks for the monks' shortcomings but can't get them, so now you're the first to open the demon's path.",
        "source": "T22n1425_001:0229b22_0"
    },
    {
        "source_sentence": "汝今便為毀正法幢、建波旬幢。",
        "translation": "Now, you've disparaged the banner of the right teaching and built the banner of Pāpīyān.",
        "source": "T22n1425_001:0229b23_1"
    },
    {
        "source_sentence": "汝愚癡人！",
        "translation": "You foolish man!",
        "source": "T22n1425_001:0229b23_2"
    },
    {
        "source_sentence": "寧以利刀割截身生，若著毒蛇口中、若狂狗口中，若大火中、若灰炭中，不應與女人共行婬欲。",
        "translation": "If he cuts off his body with a sharp sword and puts it into the mouth of a poisonous snake, into the mouth of a mad dog, into a great fire, or into ashes and charcoal, he shouldn't share sexual desire with women.",
        "source": "T22n1425_001:0229b24_3"
    },
    {
        "source_sentence": "耶舍！",
        "translation": "Yaśas!",
        "source": "T22n1425_001:0229b26_4"
    },
    {
        "source_sentence": "汝常不聞我無數方便呵責婬欲：欲為迷醉，欲如大火燒人善根，欲為大患。",
        "translation": "Don't you always hear my countless skillful ways to rebuke sexual desire: wanting is a great misfortune, wanting is like a great fire that burns the good roots of people and wants is a great danger.",
        "source": "T22n1425_001:0229b26_5"
    },
    {
        "source_sentence": "我常種種方便稱歎離欲、斷欲、度欲。",
        "translation": "I always praise various ways to be free of desire, abandon desire, and liberate myself from desire.",
        "source": "T22n1425_001:0229b28_6"
    },
    {
        "source_sentence": "汝今云何作是不善？",
        "translation": "What are you doing now that's not good?",
        "source": "T22n1425_001:0229b28_7"
    },
    {
        "source_sentence": "耶舍！",
        "translation": "Yaśas!",
        "source": "T22n1425_001:0229b29_8"
    },
    {
        "source_sentence": "此非法、非律、非如佛教，不可以是長養善法。」",
        "translation": "This is unlawful, not according to the precepts, and not like Buddhism, and it can't be cultivated as a good dharma.",
        "source": "T22n1425_001:0229b29_9"
    },
    {
        "source_sentence": "時諸比丘白佛言：「世尊！",
        "translation": "The monks then said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0229c01_10"
    },
    {
        "source_sentence": "云何是耶舍比丘，僧中未曾有此，而彼耶舍初開罪門，未有漏患而起漏患？」",
        "translation": "How is it that this monk Yaśas has never had such a thing in the saṃgha, and that Yaśas initially opened the door to sin but gave rise to the contaminants without any contaminants?",
        "source": "T22n1425_001:0229c02_0"
    },
    {
        "source_sentence": "佛告諸比丘：「是人不但今日於我法中未有漏患而起漏患。」",
        "translation": "The Buddha told the monks, Not only will this person today give rise to contaminants and troubles in my teaching that aren't contaminated.",
        "source": "T22n1425_001:0229c03_1"
    },
    {
        "source_sentence": "諸比丘白佛言：「彼過去時已曾有是事耶？」",
        "translation": "The monks said to the Buddha, Has there ever been such a thing in the past?",
        "source": "T22n1425_001:0229c05_2"
    },
    {
        "source_sentence": "佛言：「如是。」",
        "translation": "The Buddha said, So it is.",
        "source": "T22n1425_001:0229c06_3"
    },
    {
        "source_sentence": "諸比丘白佛言：「世尊！",
        "translation": "The monks said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0229c06_4"
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "I'd like to hear it.",
        "source": "T22n1425_001:0229c06_5"
    },
    {
        "source_sentence": "佛告諸比丘：「過去世時此世界劫盡時，諸眾生生光音天上，而此大地還已成立，諸眾生等從光音天還來至此。",
        "translation": "The Buddha told the monks, In a past life, when this world eon ended, sentient beings were born in Ābhāsvara Heaven, but this earth had been established again, and sentient beings returned from Ābhāsvara Heaven to this place.",
        "source": "T22n1425_001:0229c07_6"
    },
    {
        "source_sentence": "時彼眾生身有妙光，神足自在禪悅為食，諸有所須隨意所欲。",
        "translation": "Those sentient beings then had a marvelous radiance in their bodies, and their miraculous abilities and unimpeded meditation were food for them, and whatever they needed and wanted.",
        "source": "T22n1425_001:0229c09_7"
    },
    {
        "source_sentence": "是諸眾生身光相照，無有日月星宿亦無晝夜，亦無一月、半月、四時歲數。",
        "translation": "These sentient beings are illuminated by the light of their bodies, which has no sun, moon, stars, constellations, days, nights, a month, half a month, or four seasons and years.",
        "source": "T22n1425_001:0229c11_0"
    },
    {
        "source_sentence": "時此大地便有自然地味，色香美味皆悉具足，如天甘露等無有異。",
        "translation": "At the time, this earth had a natural taste of earth, and its color, odor, taste, and flavor were all present, like heavenly ambrosia and so forth, without any difference.",
        "source": "T22n1425_001:0229c12_1"
    },
    {
        "source_sentence": "時有一輕躁貪欲眾生，嘗此地味覺其香美，漸取食之即生著心。",
        "translation": "At the time, there was a slight and agitated cravinging sentient being who tasted the taste of this place and perceived its fragrance, gradually taking it and eating it, and then became attached to it.",
        "source": "T22n1425_001:0229c14_2"
    },
    {
        "source_sentence": "其餘眾生見其如此，展轉相効皆競取食。",
        "translation": "When the other sentient beings saw this, they all rushed to get food in turn.",
        "source": "T22n1425_001:0229c15_3"
    },
    {
        "source_sentence": "爾時眾生食地味已，身體沈重光明即滅，貪著五欲退失神足。",
        "translation": "After the sentient beings ate the taste of the earth, their bodies sank into heavy light and disappeared, and they became addicted to the five desires and lost their supernormal abilities.",
        "source": "T22n1425_001:0229c16_4"
    },
    {
        "source_sentence": "然後世間便有日月星宿昏明，半月、一月、春秋冬夏。」",
        "translation": "Then, in the world, there's the sun, moon, stars, and constellations that are darkened by a half-moon, a month, spring, autumn, and summer.",
        "source": "T22n1425_001:0229c18_0"
    },
    {
        "source_sentence": "佛告諸比丘：「爾時輕躁眾生者，豈異人乎？",
        "translation": "The Buddha told the monks, Isn't that a different person for those who were so impetuous at the time?",
        "source": "T22n1425_001:0229c19_1"
    },
    {
        "source_sentence": "即耶舍比丘是。",
        "translation": "That's the monk Yaśas.",
        "source": "T22n1425_001:0229c20_2"
    },
    {
        "source_sentence": "彼時耶舍於諸眾生，漏患未起而先起漏；",
        "translation": "At that time Yaśas first produced the taints for sentient beings when the danger of the taints did not arise.",
        "source": "T22n1425_001:0229c20_3"
    },
    {
        "source_sentence": "今日復於清淨僧中先開漏門。」",
        "translation": "Today, we'll again open the contaminants gate first among the pure saṃgha.",
        "source": "T22n1425_001:0229c21_4"
    },
    {
        "source_sentence": "諸比丘白佛言：「世尊！",
        "translation": "The monks said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0229c22_5"
    },
    {
        "source_sentence": "彼耶舍比丘先世已來乃如是耶？",
        "translation": "Is that monk Yaśas like this since a long time ago?",
        "source": "T22n1425_001:0229c22_6"
    },
    {
        "source_sentence": "云何其母巧作方便以婬欲誘誑其子？」",
        "translation": "How did the mother skillfully create a method to sexually tempt her child?",
        "source": "T22n1425_001:0229c23_7"
    },
    {
        "source_sentence": "佛告諸比丘：「是耶舍母不但今日巧作方便誘誑其子，過去世時亦曾誘誑。」",
        "translation": "The Buddha told the monks, Not only did Yaśas' mother skillfully and skillfully tempt her son today, but she also tempted him in a past life.",
        "source": "T22n1425_001:0229c24_8"
    },
    {
        "source_sentence": "諸比丘白佛言：「世尊！",
        "translation": "The monks said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0229c25_9"
    },
    {
        "source_sentence": "已曾爾耶？」",
        "translation": "Has it ever been like this?",
        "source": "T22n1425_001:0229c26_10"
    },
    {
        "source_sentence": "佛言：「如是。」",
        "translation": "The Buddha said, So it is.",
        "source": "T22n1425_001:0229c26_11"
    },
    {
        "source_sentence": "諸比丘白佛言：「世尊！",
        "translation": "The monks said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0229c26_12"
    },
    {
        "source_sentence": "願樂欲聞。」",
        "translation": "I'd like to hear it.",
        "source": "T22n1425_001:0229c27_13"
    },
    {
        "source_sentence": "佛告諸比丘：「過去世時有城名波羅奈，國名迦尸。",
        "translation": "The Buddha told the monks, In a past life, there was a city named Vārāṇasī and a country named Kāśi.",
        "source": "T22n1425_001:0229c27_14"
    },
    {
        "source_sentence": "時彼國王號大名稱，離諸怨敵，布施汎戒，持愛人物，以法治化，善攝眷屬。",
        "translation": "The king of that country, called Mahāprajñāpāramitā, was free of enemies and enemies, bestowed universal precepts, maintained affectionate people to rule and transform them, and well gathered his retinue.",
        "source": "T22n1425_001:0229c28_15"
    },
    {
        "source_sentence": "時王第一夫人，晨朝上高樓上觀察星宿，見一金色鹿王從南方來陵虛北逝。",
        "translation": "The first wife of the king then went up a high building in the morning to observe the stars and constellations and saw a golden-colored deer king coming from the south and fleeing in the north.",
        "source": "T22n1425_001:0230a01_16"
    },
    {
        "source_sentence": "夫人見已即作是念：『我若得此金色鹿皮持作褥者，沒無遺恨；",
        "translation": "Seeing this, the queen thought: If I were to obtain these golden-colored sandalwood mattresses made of deer skin she would not have any grudge against me.",
        "source": "T22n1425_001:0230a03_17"
    },
    {
        "source_sentence": "若不得者，用作此王夫人為？』",
        "translation": "If you don't get it, why would you use it to make this king's wife?'",
        "source": "T22n1425_001:0230a04_18"
    },
    {
        "source_sentence": "即自念曰：『若我語人：「見金色鹿王。」",
        "translation": "He then thought to himself, 'Suppose I tell someone, See the golden-colored deer king.",
        "source": "T22n1425_001:0230a05_19"
    },
    {
        "source_sentence": "誰當信者？』",
        "translation": "Who will believe it?'",
        "source": "T22n1425_001:0230a05_20"
    },
    {
        "source_sentence": "又作是念：『若言是鹿，不應乘虛；",
        "translation": "Again, he thought: If I say this is a deer, I should not ride in vain.",
        "source": "T22n1425_001:0230a06_21"
    },
    {
        "source_sentence": "若乘虛行，不應言鹿。』",
        "translation": "If you ride a false path, you shouldn't say it's a deer.'",
        "source": "T22n1425_001:0230a06_22"
    },
    {
        "source_sentence": "夫人愁憂，恐不信故，即脫瓔珞著垢弊衣入憂惱房。",
        "translation": "The queen was overcome with sorrow and feared that she would not believe in Buddhism. So she dismounted from her jewelry, donned dirty clothes, and entered the chamber of distress.",
        "source": "T22n1425_001:0230a07_23"
    },
    {
        "source_sentence": "王於殿上治政事訖，還入其室不見第一夫人，即問侍者。",
        "translation": "When the king had completed his duties in the palace, he returned to his room and didn't see the first wife, so he asked the attendant.",
        "source": "T22n1425_001:0230a08_24"
    },
    {
        "source_sentence": "侍者答言：『夫人向入憂惱房住。』",
        "translation": "The attendant replied, 'The lady is headed for the room where she's staying in distress.'",
        "source": "T22n1425_001:0230a09_25"
    },
    {
        "source_sentence": "王便往就，問夫人言：『誰犯汝者？",
        "translation": "The king then approached the queen and asked her, 'Who committed this offense against you?'",
        "source": "T22n1425_001:0230a10_26"
    },
    {
        "source_sentence": "為大臣、王子？",
        "translation": "For ministers and princes?",
        "source": "T22n1425_001:0230a11_27"
    },
    {
        "source_sentence": "為餘夫人及餘侍者？",
        "translation": "For the sake of other wives and other attendants?",
        "source": "T22n1425_001:0230a11_28"
    },
    {
        "source_sentence": "若犯汝者，我當為汝重治其罪。",
        "translation": "If someone violates your precepts, I will punish their sins for you.",
        "source": "T22n1425_001:0230a12_29"
    },
    {
        "source_sentence": "汝今將無有所須耶？",
        "translation": "Wouldn't you need anything?",
        "source": "T22n1425_001:0230a12_30"
    },
    {
        "source_sentence": "若欲須金銀、珍寶、香花、瓔珞，當相供給；",
        "translation": "If they want gold, silver, rare treasures, incense, flowers, and jewelry, they should offer them to each other.",
        "source": "T22n1425_001:0230a13_31"
    },
    {
        "source_sentence": "若欲殺罰，便可見語。』",
        "translation": "If you want to be punished by killing, then you can speak clearly.'",
        "source": "T22n1425_001:0230a14_32"
    },
    {
        "source_sentence": "王種種問已，夫人不答。",
        "translation": "After the king had asked various questions, the queen didn't answer.",
        "source": "T22n1425_001:0230a14_33"
    },
    {
        "source_sentence": "王即出去，告餘夫人、大臣、太子及餘人等：『卿等率往問夫人意。』",
        "translation": "The king then went out and told the other wives, ministers, princes, and others, 'Your majesty, go ask the lady about her thoughts.'",
        "source": "T22n1425_001:0230a15_34"
    },
    {
        "source_sentence": "諸人受教各各問已，夫人猶故默然不對。",
        "translation": "Each of the people had been instructed to ask questions, but the lady remained silent and didn't answer.",
        "source": "T22n1425_001:0230a16_35"
    },
    {
        "source_sentence": "王使耆舊青衣更問夫人，此青衣者生長王宮多有方便，即往入房問夫人言：『王是夫人之所恃怙，如何王問而默然不答？",
        "translation": "The king asked the elderly man's old woman in blue to ask her again, and this woman in blue grew up in the king's palace with many skillful means. So he went into his room and asked the queen, 'The king is the wife's support, so why did the king ask questions but remain silent?'",
        "source": "T22n1425_001:0230a17_36"
    },
    {
        "source_sentence": "若有所求何緣可得？",
        "translation": "If there's something to be sought, what causes it to be obtained?",
        "source": "T22n1425_001:0230a20_37"
    },
    {
        "source_sentence": "誰犯夫人？",
        "translation": "Who's violating the wife?",
        "source": "T22n1425_001:0230a20_38"
    },
    {
        "source_sentence": "為大臣、王子及餘夫人？",
        "translation": "For ministers, princes, and other wives?",
        "source": "T22n1425_001:0230a20_39"
    },
    {
        "source_sentence": "欲有殺罰宜應白王。",
        "translation": "If you want to have the punishment of killing, it's appropriate to tell the king.",
        "source": "T22n1425_001:0230a21_40"
    },
    {
        "source_sentence": "夫人默恨無乃失耶？",
        "translation": "Is the queen's silence of hatred not a failure?",
        "source": "T22n1425_001:0230a21_41"
    },
    {
        "source_sentence": "夫人若喪，王終不能相與俱死，正可憂惱月日之間，國中自有剎利、婆羅門、長者、居士等，皆各有女端正妙好，與相娛樂足以忘憂。",
        "translation": "If the queen were to die, the king would be unable to share her death with them. For months and days he was overcome with grief but on each day all the kṣatriyas, brāhmaṇas, brahmans, wealthy merchants, householders, and other members of the royal family in that country had their own daughters, beautiful and handsome, entertained enough to forget sorrow.",
        "source": "T22n1425_001:0230a22_42"
    },
    {
        "source_sentence": "夫人正可徒自死耳！",
        "translation": "The lady must have died on her own!",
        "source": "T22n1425_001:0230a25_43"
    },
    {
        "source_sentence": "喻若瘂人眠中得夢，誰能瞻者？",
        "translation": "It's a metaphor if a deaf person has a dream in their sleep, but who can look at it?",
        "source": "T22n1425_001:0230a25_44"
    },
    {
        "source_sentence": "夫人不語，難知亦爾。』",
        "translation": "The lady won't speak, and so it's hard to know.'",
        "source": "T22n1425_001:0230a26_45"
    },
    {
        "source_sentence": "爾時夫人聞青衣語，即自惟曰：『此是名語。』",
        "translation": "It was then that the lady heard the words of the blue-robed man and thought to herself, 'This is a name.'",
        "source": "T22n1425_001:0230a26_46"
    },
    {
        "source_sentence": "便答青衣：『無犯我者，別有所憶故不語耳。",
        "translation": "He then answered the man in blue robes, 'There's no offense against me because there's something else to remember, so I won't say anything.",
        "source": "T22n1425_001:0230a27_47"
    },
    {
        "source_sentence": "汝聽我說，吾近晨朝登樓觀看星宿，時見有一金色鹿王，乘空南來凌虛北逝。",
        "translation": "Listen to my explanation. In the early morning I climbed up a building to see the stars and constellations, and at that time I saw a golden deer king flying in the sky toward the south and fleeing toward the north.",
        "source": "T22n1425_001:0230a28_48"
    },
    {
        "source_sentence": "若語人言：「鹿能乘虛。」",
        "translation": "Suppose someone says to someone, A deer can ride in space.",
        "source": "T22n1425_001:0230b01_49"
    },
    {
        "source_sentence": "誰能信者？",
        "translation": "Who can believe it?",
        "source": "T22n1425_001:0230b02_50"
    },
    {
        "source_sentence": "我欲得其皮持用作褥而不能得，是以生惱，自念：「用作王夫人為？」』",
        "translation": "I want to obtain its skin and use it for a mattress, but I can't get it. That's why I became angry and thought to myself, What is the king's wife for you?",
        "source": "T22n1425_001:0230b02_51"
    },
    {
        "source_sentence": "是時青衣聞此語已，具白大王。",
        "translation": "After hearing these words, the monk in blue robes reported them to the king.",
        "source": "T22n1425_001:0230b03_52"
    },
    {
        "source_sentence": "王知其意，甚大歡喜，即問傍臣：『誰能得此金色鹿皮？",
        "translation": "Knowing his intention, the king was overjoyed and asked the attendant ministers, 'Who will obtain this golden-colored deer skin?'",
        "source": "T22n1425_001:0230b04_53"
    },
    {
        "source_sentence": "我今須之持用作褥。』",
        "translation": "Now, I need to use it as a mattress.'",
        "source": "T22n1425_001:0230b05_54"
    },
    {
        "source_sentence": "諸臣答言：『當問獵者。』",
        "translation": "The ministers replied, 'Should I ask the hunter?'",
        "source": "T22n1425_001:0230b06_55"
    },
    {
        "source_sentence": "王告大臣：『勅我境內國中獵師，盡使令集。』",
        "translation": "The king told his ministers, 'I've ordered all the hunters in my territory to gather here.'",
        "source": "T22n1425_001:0230b06_56"
    },
    {
        "source_sentence": "「『諸天隨念感，　　王者隨聲至；",
        "translation": "The heavenly beings responded to the king’s call, and the king followed his announcement.",
        "source": "T22n1425_001:0230b07_57"
    },
    {
        "source_sentence": "　　富者以財得，　　貧人以力辦。』",
        "translation": "The wealthy get it with their possessions, and the poor manage it with their strength.'",
        "source": "T22n1425_001:0230b07_57"
    },
    {
        "source_sentence": "如偈所說：「如是王教出已，國中獵師一切皆集。",
        "translation": "As the verse says, Thus, after the king had taught them to leave, all the hunters in his country gathered together.",
        "source": "T22n1425_001:0230b07_57"
    },
    {
        "source_sentence": "獵師白王：『何所約勅？』",
        "translation": "The hunter said to the king, 'What's the order?'",
        "source": "T22n1425_001:0230b10_58"
    },
    {
        "source_sentence": "王告獵者：『我今急須金色鹿皮持用作褥，卿等為吾疾速求之。』",
        "translation": "The king told the hunter, 'Now, I urgently need golden-colored deer skin to carry and make a mattress for me; you must quickly seek it out for my sake.'",
        "source": "T22n1425_001:0230b11_59"
    },
    {
        "source_sentence": "獵師答王：『願聽小還共論此事。』",
        "translation": "The hunter answered the king, 'May I hear you return and discuss this matter with me for a little while?'",
        "source": "T22n1425_001:0230b12_60"
    },
    {
        "source_sentence": "王曰：『可爾。』",
        "translation": "The king said, 'That's right.'",
        "source": "T22n1425_001:0230b13_61"
    },
    {
        "source_sentence": "獵師還已共相謂言：『汝等遊獵頗曾見聞金色鹿不？』",
        "translation": "The hunter returned and said to each other, 'Have you ever seen or heard of a golden-colored deer when you were hunting?'",
        "source": "T22n1425_001:0230b13_62"
    },
    {
        "source_sentence": "彼各對曰：『我等先祖已來常行遊獵，未曾有聞金色鹿名，況復眼見！』",
        "translation": "Each of them replied, 'Since our ancestors always traveled and hunted, we've never heard the name of a golden-colored deer, so why wouldn't we see it with our eyes?'",
        "source": "T22n1425_001:0230b14_63"
    },
    {
        "source_sentence": "時諸獵師共作要言：『今往答王，無使不同。』",
        "translation": "The hunters then made a general statement, saying, 'Now, I'll answer the king, but there's no difference.'",
        "source": "T22n1425_001:0230b16_64"
    },
    {
        "source_sentence": "既見王已各白王言：『我先祖已來相承遊獵，初未曾聞金色鹿名，況復眼見。』",
        "translation": "After seeing the king, they each said to the king, 'Since my ancestors traveled and hunted together, I've never heard the name of a golden-colored deer before, so why wouldn't I see it with my eyes?'",
        "source": "T22n1425_001:0230b17_65"
    },
    {
        "source_sentence": "「『王者力自在，　　所求欲如教。』",
        "translation": "'The king's power is unimpeded, and his desires are as he teaches.'",
        "source": "T22n1425_001:0230b19_66"
    },
    {
        "source_sentence": "如所說：「王即勅有司令執諸獵者繫著牢獄。",
        "translation": "As it's said, The king then ordered a commander to bind the hunters in prison.",
        "source": "T22n1425_001:0230b19_66"
    },
    {
        "source_sentence": "時有一獵師名曰刪闍，勇健多力走及奔獸，仰射飛鳥箭無空落，彼即念言：『我諸獵黨自惟無罪而見囚執，當設權計脫此苦難。",
        "translation": "At that time a hunter named Sāṅga, a bold and powerful hunter known as Shanzhao, flew upward to shoot the flying birds and arrows without dropping anything in the air. He thought: The hunting party of mine thinks they are not guilty but sees the prisoners holding them.",
        "source": "T22n1425_001:0230b21_67"
    },
    {
        "source_sentence": "我當白王應募求鹿，若得者善，若不得者，我且遊散，諸伴得出。』",
        "translation": "I'll tell the king to solicit a deer for it, and if he gets it, it's good; if he doesn't get it, I'll wander around and scatter it, and my companions will escape.'",
        "source": "T22n1425_001:0230b24_68"
    },
    {
        "source_sentence": "便白王言：『頗有見聞金色鹿不？』",
        "translation": "He then said to the king, 'Has anyone seen or heard of a golden-colored deer?'",
        "source": "T22n1425_001:0230b26_69"
    },
    {
        "source_sentence": "王告獵者：『汝等自可往問夫人。』",
        "translation": "The king told the hunter, 'You may go and ask the lady about it for yourself.'",
        "source": "T22n1425_001:0230b26_70"
    },
    {
        "source_sentence": "爾時獵者即詣王宮白夫人曰：『誰有見聞金色鹿者？』",
        "translation": "It was then that the hunter went to the king's palace and said to his wife, 'Who has seen or heard of a golden-colored deer?'",
        "source": "T22n1425_001:0230b27_71"
    },
    {
        "source_sentence": "夫人答言：『我親自見。』",
        "translation": "The lady replied, 'I've seen it myself.'",
        "source": "T22n1425_001:0230b28_72"
    },
    {
        "source_sentence": "獵師白言：『見在何處？』",
        "translation": "The hunter said, 'Where do you see it?'",
        "source": "T22n1425_001:0230b29_73"
    },
    {
        "source_sentence": "夫人答言：『我於樓上觀於星宿，晨朝見一金色鹿王，從南方來陵虛北逝。』",
        "translation": "The lady answered, 'In the morning, I'll see a golden-colored deer king coming from the south and fleeing in the sky to the north.'",
        "source": "T22n1425_001:0230b29_74"
    },
    {
        "source_sentence": "時彼獵師善相禽獸，知此鹿王止宿在南、食處在北，止宿之處永無可得，當於食處而求取之。",
        "translation": "Knowing that the deer king was staying overnight in the south and his feeding place was in the north, there was nothing to be obtained where he stayed overnight.",
        "source": "T22n1425_001:0230c02_75"
    },
    {
        "source_sentence": "於是獵師便持弓箭，漸次北行到彼雪山。",
        "translation": "The hunter then took his bow and arrow and gradually traveled north to the other side of the Snowy Mountains.",
        "source": "T22n1425_001:0230c04_76"
    },
    {
        "source_sentence": "時彼山中有仙人住，流泉浴池花果茂盛。",
        "translation": "At the time, there was a sage living on that mountain, and flowing springs, bathing pools, flowers, and fruit flourished in abundance.",
        "source": "T22n1425_001:0230c05_77"
    },
    {
        "source_sentence": "彼中仙人以二事除欲：一者苦行，二者閑居。",
        "translation": "The sage among them was freed from desire by two things: first, ascetic practices and second, seclusion.",
        "source": "T22n1425_001:0230c06_78"
    },
    {
        "source_sentence": "爾時獵師藏諸獵具假以人服，詣仙人所禮拜問訊。",
        "translation": "At the time, the hunter stored all his hunting implements and assumed human clothing, went to the sage, venerated him, and greeted him.",
        "source": "T22n1425_001:0230c07_79"
    },
    {
        "source_sentence": "彼仙人者處在山澤久不見人，得獵者至甚大歡喜，命令就坐，與甘果美漿共相慰勞。",
        "translation": "That sage hadn't seen anyone in the swamp for a long time, and when he found the hunter very joyous, he ordered him to take his seat and gave him sweet fruit and delicious juice to comfort him.",
        "source": "T22n1425_001:0230c08_80"
    },
    {
        "source_sentence": "獵師白言：『止此久近？』",
        "translation": "The hunter said, 'Have you stayed here for a long time?'",
        "source": "T22n1425_001:0230c10_81"
    },
    {
        "source_sentence": "答言：『止此以來經爾所時。』",
        "translation": "He replied, 'It's been so long since I stopped here.'",
        "source": "T22n1425_001:0230c11_82"
    },
    {
        "source_sentence": "復白仙人：『止此已來，頗曾見有奇異事不？』",
        "translation": "Again, he said to the sage, 'Has there ever been a strange thing that you've seen since you stopped here?'",
        "source": "T22n1425_001:0230c11_83"
    },
    {
        "source_sentence": "答言：『曾見。』",
        "translation": "He replied, 'I've seen it before.'",
        "source": "T22n1425_001:0230c12_84"
    },
    {
        "source_sentence": "復問：『為見何等？』",
        "translation": "Again, he asked, 'What's the view?'",
        "source": "T22n1425_001:0230c12_85"
    },
    {
        "source_sentence": "答曰：『此山南有一樹名尼拘律，常有金色鹿王飛來在上，食彼樹葉飽已而去。』",
        "translation": "He answered, 'There's a tree south of this mountain named Nirgrantha, and there's always a golden-colored deer king flying above it, eating its leaves and leaving after they've eaten them.'",
        "source": "T22n1425_001:0230c13_86"
    },
    {
        "source_sentence": "獵師聞此甚大歡喜，作是念言：『必是夫人所見金色鹿王，今已得聞，我願將果。』",
        "translation": "The hunter was greatly delighted to hear this, and he thought, 'That must be the golden-colored deer king whom the queen saw, but now that she's heard it, I want to give it to her.'",
        "source": "T22n1425_001:0230c15_0"
    },
    {
        "source_sentence": "獵師方便更說餘事，然後乃問：『趣尼俱律樹道在何處？』",
        "translation": "The hunter then asked, 'Where's the path leading to the tree of Kālôdayin?'",
        "source": "T22n1425_001:0230c16_1"
    },
    {
        "source_sentence": "仙人答言：『從此而去。』",
        "translation": "The sage answered, 'Depart from here.'",
        "source": "T22n1425_001:0230c18_0"
    },
    {
        "source_sentence": "中間曲路委悉語之。",
        "translation": "In the interim, he twisted the road and spoke to him in full.",
        "source": "T22n1425_001:0230c18_1"
    },
    {
        "source_sentence": "獵師聞喜，呪願而去。",
        "translation": "The hunter was delighted to hear it and departed with a magical vow.",
        "source": "T22n1425_001:0230c18_2"
    },
    {
        "source_sentence": "還執持獵具順道而進，漸次前行，遙見彼樹枝葉扶疎蔭覆彌廣，至彼樹下尋覓鹿王，不見蹤跡又無食處。",
        "translation": "He then took his hunting implements and proceeded along the path. Going one step after another, he saw from a distance that the branches and leaves of the tree shaded it even more extensively. At the foot of the tree he looked for the deer king but could not find any trace of him or any place to feed.",
        "source": "T22n1425_001:0230c19_3"
    },
    {
        "source_sentence": "獵師便於樹下潛微伺之，伺之不久便見鹿王，譬如鴈王陵虛而來止此樹上，形色光明照耀山谷，食彼樹葉飽則還南。",
        "translation": "The hunter went to the foot of the tree to search for it. Soon after seeking it, he saw the deer king. It was as if a deer king came and stayed on top of this tree in the sky above the royal palace. Form and color shone brilliantly over the mountain valleys, and when he eats the leaves of that tree, he returned south.",
        "source": "T22n1425_001:0230c21_4"
    },
    {
        "source_sentence": "尋復思惟：『此樹高遠，非是網羂弓矢所及，云何可得？",
        "translation": "Again, he thought, 'This tree is so high that it's beyond the range of a net or bow and arrow, so how could it be obtained?'",
        "source": "T22n1425_001:0230c24_5"
    },
    {
        "source_sentence": "我今當還波羅奈城。",
        "translation": "I will now return to the city of Vārāṇasī.",
        "source": "T22n1425_001:0230c25_6"
    },
    {
        "source_sentence": "彼有大臣、王子聰明智德，我當問之。』",
        "translation": "If there's a minister or prince who's intelligent and wise, I will ask him about it.'",
        "source": "T22n1425_001:0230c26_7"
    },
    {
        "source_sentence": "即還其國便白王言：『如夫人所見，但鹿所止住，非網羂弓矢所及，無由得之。』",
        "translation": "He returned to his country and said to the king, 'As the lady saw it, it's just a place where deer live; they can't be caught by a net, a bow, or a arrow, and there's no way to get it.'",
        "source": "T22n1425_001:0230c27_0"
    },
    {
        "source_sentence": "王告獵師：『汝可自往具白夫人。』",
        "translation": "The king told the hunter, 'You may go and tell your wife.'",
        "source": "T22n1425_001:0230c28_1"
    },
    {
        "source_sentence": "獵師即白夫人：『已見金色鹿王，都非網羂弓矢所及，不知何由而得？』",
        "translation": "The hunter then said to his wife, 'I've seen a golden-colored deer king that's beyond the reach of nets, arrows, and bows, but I don't know how to get it.'",
        "source": "T22n1425_001:0230c29_2"
    },
    {
        "source_sentence": "夫人問言：『彼鹿所住為在何處？』",
        "translation": "The lady asked, 'Where is the place where that deer lives?'",
        "source": "T22n1425_001:0231a01_3"
    },
    {
        "source_sentence": "答言：『住在尼拘律樹上，食彼樹葉飽已還南。』",
        "translation": "He replied, 'I'll stay at a tree in Nirgrantha and eat the leaves of that tree and return south after they're full.'",
        "source": "T22n1425_001:0231a02_4"
    },
    {
        "source_sentence": "「『剎利百方便，　　婆羅門增倍；",
        "translation": "'The kṣatriyas do a hundred things, and the brāhmaṇas multiply.",
        "source": "T22n1425_001:0231a03_5"
    },
    {
        "source_sentence": "　　王有千種計，　　女人策無量。』",
        "translation": "The king has a thousand kinds of calculations, and women are immeasurable.'",
        "source": "T22n1425_001:0231a03_5"
    },
    {
        "source_sentence": "如所說：「如是王夫人多諸方便，便教獵者：『汝持蜜去，至彼樹上蜜塗樹葉，鹿聞蜜香必食樹葉噉盡，次第塗下至彼施網羂處。』",
        "translation": "As it's said, Thus, the king's wife had many skillful means, so she told the hunter, 'Take the honey away and go up to the top of that tree with honey smeared on its leaves, and when a deer hears the sweet smell of honey, they'll surely eat the leaves; they'll rub them down one by one until they reach the place where the net is given.",
        "source": "T22n1425_001:0231a03_5"
    },
    {
        "source_sentence": "獵師如教還於山中，持蜜上樹塗其樹葉。",
        "translation": "The hunter returned to the mountain as instructed, took the honey and rubbed it on top of the tree with its leaves.",
        "source": "T22n1425_001:0231a08_6"
    },
    {
        "source_sentence": "彼鹿來食隨蜜食盡，蜜不塗處鹿輒不食，隨蜜食葉漸次而下。",
        "translation": "When that deer comes and eats, it follows the leaves of honey as they fall down one after the other.",
        "source": "T22n1425_001:0231a09_7"
    },
    {
        "source_sentence": "「『野獸信其鼻，　　梵志依相書，",
        "translation": "' wild animals believe in their noses, and priests rely on the signs to write.",
        "source": "T22n1425_001:0231a11_8"
    },
    {
        "source_sentence": "　　王者委有司，　　各各有所信。』",
        "translation": "The king entrusts each one with a minister, and each has some faith.'",
        "source": "T22n1425_001:0231a11_8"
    },
    {
        "source_sentence": "如所說：「彼鹿尋香食彼樹葉，漸下到其施網羂處，即便著羂。",
        "translation": "As it's said, That deer searched for the fragrance and ate the leaves of that tree, gradually descended down to the place where he gave them as a mesh net, and then became attached to the mesh.",
        "source": "T22n1425_001:0231a11_8"
    },
    {
        "source_sentence": "獵師念言：『我若殺取其皮，不足為貴，當活將去。』",
        "translation": "The hunter thought, 'If I kill it and take its skin, it won't be valuable; I'll live and depart.'",
        "source": "T22n1425_001:0231a15_9"
    },
    {
        "source_sentence": "於是驅還。",
        "translation": "He then expelled them and returned.",
        "source": "T22n1425_001:0231a16_10"
    },
    {
        "source_sentence": "獵師籠羈過仙人處，仙人遙見驚而歎曰：『咄哉！",
        "translation": "When the hunter caged and passed by the place where the sage lived, the sage was startled to see him from a distance and praised him, saying, 'Duh!",
        "source": "T22n1425_001:0231a16_11"
    },
    {
        "source_sentence": "禍酷。",
        "translation": "It's painful and cruel.",
        "source": "T22n1425_001:0231a17_12"
    },
    {
        "source_sentence": "雖能乘虛而不能免此惡人之手。』",
        "translation": "Even though they can ride in space, they can't escape the hand of this bad person.'",
        "source": "T22n1425_001:0231a17_13"
    },
    {
        "source_sentence": "即問獵者：『惡人！",
        "translation": "He then asked the hunter, 'Evil man!",
        "source": "T22n1425_001:0231a18_14"
    },
    {
        "source_sentence": "汝用是為？』",
        "translation": "What do you use it for?'",
        "source": "T22n1425_001:0231a18_15"
    },
    {
        "source_sentence": "獵師答言：『迦尸國王第一夫人須此鹿皮持用作褥。』",
        "translation": "The hunter answered, 'The first wife of the king of Kāśi asked for this deer skin to be used as a mattress.'",
        "source": "T22n1425_001:0231a19_16"
    },
    {
        "source_sentence": "仙人復言：『汝謂此鹿死後色如是耶？",
        "translation": "Again, the sage said, 'Do you think this deer's color will be like this after death?'",
        "source": "T22n1425_001:0231a20_17"
    },
    {
        "source_sentence": "內有生氣故外色如是。",
        "translation": "Because there's internal arising energy, external form is like this.",
        "source": "T22n1425_001:0231a21_18"
    },
    {
        "source_sentence": "可活將去，汝可得賞。』",
        "translation": "You can live and leave, and you'll be rewarded.'",
        "source": "T22n1425_001:0231a21_19"
    },
    {
        "source_sentence": "仙人復問：『汝作何方便而得此鹿？』",
        "translation": "Again, the sage asked, 'What method did you use to get this deer?'",
        "source": "T22n1425_001:0231a22_20"
    },
    {
        "source_sentence": "答言：『我作如是方便而得此鹿。』",
        "translation": "He replied, 'I did this kind of skillful means to get this deer.'",
        "source": "T22n1425_001:0231a22_21"
    },
    {
        "source_sentence": "爾時仙人自慶善寂無此諸惡，悲念夫人能為巧惡方便，痛彼鹿王貪味受困。",
        "translation": "At the time, the sage rejoiced to be well-quiet and had no such evil, and he was grieved that his wife could skillfully do evil deeds to harm the deer king's craving for food and being trapped.",
        "source": "T22n1425_001:0231a23_22"
    },
    {
        "source_sentence": "「『世間之大惡，　　莫過於嗜味；",
        "translation": "The great evil of the world Is nothing greater than addictive taste.",
        "source": "T22n1425_001:0231a25_23"
    },
    {
        "source_sentence": "　　欺誑凡夫人，　　及諸林野獸；",
        "translation": "They deceive ordinary people and the wild animals of the forests.",
        "source": "T22n1425_001:0231a25_23"
    },
    {
        "source_sentence": "　　因風著香味，　　受斯苦惱患。』",
        "translation": "As a result of the wind's attachment to fragrance, they experience this painful and distressing suffering.'",
        "source": "T22n1425_001:0231a25_23"
    },
    {
        "source_sentence": "爾時仙人即說偈言：「獵師問曰：『我作何方便養育此鹿得生歸我國？』",
        "translation": "It was then that the sage spoke a verse, The hunter asked, 'What method will I use to raise this deer and return it to my country?'",
        "source": "T22n1425_001:0231a25_23"
    },
    {
        "source_sentence": "仙人答言：『以蜜塗樹葉而用養之。",
        "translation": "The sage answered, 'I'll apply honey to the leaves of a tree and nourish them with it.",
        "source": "T22n1425_001:0231b01_24"
    },
    {
        "source_sentence": "若到人間以蜜和麨。』",
        "translation": "If you go to the people, mix it with honey and bread.'",
        "source": "T22n1425_001:0231b01_25"
    },
    {
        "source_sentence": "如是教令養之。",
        "translation": "He teaches them to nourish them in this way.",
        "source": "T22n1425_001:0231b02_26"
    },
    {
        "source_sentence": "漸漸還國遂到人間。",
        "translation": "Gradually, he returned to his country and arrived among the people.",
        "source": "T22n1425_001:0231b02_27"
    },
    {
        "source_sentence": "此鹿形貌端正色若天金，角白如珂，目紫紺色，一切人見莫不雅奇。",
        "translation": "The deer’s appearance was as beautiful as the color of heavenly gold. The horns were white like cow dung and its eyes were purplish-blue in color. All the people saw it, but none did not marvel at its beauty.",
        "source": "T22n1425_001:0231b03_28"
    },
    {
        "source_sentence": "漸次行詣波羅奈城，王聞鹿至，勅諸城內平治道路，掃灑燒香、搥鍾擊鼓往迎鹿王。",
        "translation": "When the king heard that the deer was arriving, he ordered all the cities to level the roads and sweep away incense, beat bells and drums, and go to meet the deer king.",
        "source": "T22n1425_001:0231b04_29"
    },
    {
        "source_sentence": "觀者如雲莫不歡喜，慶賀大王吉祥遠至。",
        "translation": "The observers were like clouds and all rejoiced, congratulating the great king's auspicious arrival from a distance.",
        "source": "T22n1425_001:0231b06_30"
    },
    {
        "source_sentence": "夫人見已歡喜踊躍不能自勝，以愛心重故前抱鹿王，以昔染污心重故，令彼鹿王金色即滅。",
        "translation": "When the queen saw this, she was overjoyed and jumped up and down in joy but could not control herself. Because of her affection for the deer king, she went forward to embrace him; and because of the weakness of her deer king’s past defiled mind, she caused his golden color to cease.",
        "source": "T22n1425_001:0231b07_31"
    },
    {
        "source_sentence": "王告夫人：『此鹿金色忽變當如之何？』",
        "translation": "The king told his wife, 'What will this deer's golden color suddenly change like?'",
        "source": "T22n1425_001:0231b09_32"
    },
    {
        "source_sentence": "夫人答王：『此今便是無施之物，放使令去。』」",
        "translation": "The queen answered the king, 'Now, this is nothing to give, and I'll let you go.'",
        "source": "T22n1425_001:0231b10_33"
    },
    {
        "source_sentence": "爾時佛告諸比丘：「彼時金色鹿王豈異人乎？",
        "translation": "It was then that the Buddha addressed the monks, Isn't that a different person than the golden-colored deer king of that time?",
        "source": "T22n1425_001:0231b11_34"
    },
    {
        "source_sentence": "今耶舍比丘是。",
        "translation": "This is the present-day monk Yaśas.",
        "source": "T22n1425_001:0231b12_35"
    },
    {
        "source_sentence": "時夫人者，今耶舍母是。",
        "translation": "The lady of that time is now Yaśasā’s mother.",
        "source": "T22n1425_001:0231b12_36"
    },
    {
        "source_sentence": "往昔已來曾作方便誘誑其子，令墮貪著受諸苦惱。」",
        "translation": "Since the distant past, I've used skillful means to tempt my child and cause him to fall into craving and suffering.",
        "source": "T22n1425_001:0231b13_37"
    },
    {
        "source_sentence": "佛告諸比丘：「依止毘舍離比丘皆悉令集。」",
        "translation": "The Buddha told the monks, Relying on Vaiśālī, all the monks will be gathered together.",
        "source": "T22n1425_001:0231b14_38"
    },
    {
        "source_sentence": "爾時世尊以是因緣向諸比丘廣說過患事起，種種因緣呵責過患起已，為諸比丘隨順說法：「有十事利益，如來、應供、正遍知為諸弟子制戒、立說波羅提木叉法。",
        "translation": "At the time, the Bhagavān explained these causes and conditions to the monks in detail about the emergence of faults and distress, and after various causes and conditions rebuked the emergence of faults and distress, he taught the monks accordingly, There are ten things that benefit the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One who establishes precepts and explains the prāt",
        "source": "T22n1425_001:0231b15_39"
    },
    {
        "source_sentence": "十事利益廣說如上。",
        "translation": "The benefits of the ten things are explained in detail as above.",
        "source": "T22n1425_001:0231b19_0"
    },
    {
        "source_sentence": "是故如來從今日當為諸比丘制戒，未聞者令聞，已聞者當重聞。",
        "translation": "That's why the Tathāgata will establish precepts for the monks from today, causing those who haven't heard them to hear them and those who have heard them to hear them again.",
        "source": "T22n1425_001:0231b19_1"
    },
    {
        "source_sentence": "若比丘於和合僧中受具足戒，行婬法，是比丘得波羅夷，不共住。」",
        "translation": "If a monk receives the full set of precepts and practices sexual misconduct among the harmonious saṃgha, that monk attains pārājika and doesn't live together.",
        "source": "T22n1425_001:0231b20_2"
    },
    {
        "source_sentence": "復次佛住毘舍離，廣說如上。",
        "translation": "Furthermore, the Buddha abides in Vaiśālī: as has been said elaborately above.",
        "source": "T22n1425_001:0231b23_0"
    },
    {
        "source_sentence": "時毘舍離城有二離車子，信家非家、捨家出家，於毘耶離眾所知識，能致供養四事具足。",
        "translation": "At the time, there were two Licchavi ministers in Vaiśālī who believed that their homes were not homes and renounced home; they renounced home and left home. Known by the people of Vaiśālī, they were able to make offerings with a full set of four things.",
        "source": "T22n1425_001:0231b23_1"
    },
    {
        "source_sentence": "彼比丘時至，著入聚落衣持鉢入城乞食，不能攝身口意繫念在前，心意馳亂不攝諸根，染著色欲取色淨相，欲心熾盛便作是念：「我著法服為此欲事甚為不可，我當捨於法服著彼俗衣，七日之內不還僧中隨意所為。」",
        "translation": "When that monk arrives, he puts his robe into a village, takes his bowl and enters the city to solicit alms, doesn't gather his body or mind in front of him, becomes mentally agitated, doesn't gather his faculties, becomes attached to form and desires to take form and purify its appearance, and then thinks, I'm wearing a Dharma robe because this is so unaccepta",
        "source": "T22n1425_001:0231b25_2"
    },
    {
        "source_sentence": "作是念已，即脫袈裟著彼俗衣便行欲事。",
        "translation": "After he had this thought, he took off his reddish-brown robe and put on his layman's robe and engaged in sexual misconduct.",
        "source": "T22n1425_001:0231c01_3"
    },
    {
        "source_sentence": "過七日已還著法服而來入僧，入僧已還自厭污愧身所行，便作是念：「都不見聞餘諸沙門有如是事，我今當以此事白尊者舍利弗，舍利弗當向世尊具陳此事。",
        "translation": "After seven days had passed, he returned to put on his religious robes and entered the saṃgha. Having entered the saṃgha, he became disgusted with himself and felt ashamed of what he was doing. Then he thought: I have never seen or heard anyone among the other śramaṇas do such things. Now, I will tell this matter to Venerable Sāriputta.",
        "source": "T22n1425_001:0231c02_4"
    },
    {
        "source_sentence": "若佛有所教勅我當奉行。」",
        "translation": "If the Buddha teaches anything, I will follow it.",
        "source": "T22n1425_001:0231c06_5"
    },
    {
        "source_sentence": "時二比丘往詣尊者舍利弗所廣說如上。",
        "translation": "The two monks then went to Venerable Śāriputra and explained it in detail as above.",
        "source": "T22n1425_001:0231c06_6"
    },
    {
        "source_sentence": "時尊者舍利弗將二比丘往詣世尊，禮足已，却住一面，以上因緣廣白世尊。",
        "translation": "Venerable Śāriputra then led the two monks to the Bhagavān, bowed his feet, withdrew to one side, and explained the above causes and conditions in detail to the Bhagavān.",
        "source": "T22n1425_001:0231c07_7"
    },
    {
        "source_sentence": "佛告舍利弗：「應遣令去。",
        "translation": "The Buddha told Śāriputra, You should send him away.",
        "source": "T22n1425_001:0231c09_8"
    },
    {
        "source_sentence": "是愚癡人！",
        "translation": "This is a foolish man!",
        "source": "T22n1425_001:0231c10_0"
    },
    {
        "source_sentence": "不復得在如來法中更出家受具戒。」",
        "translation": "They won't again be allowed to leave home and receive the full set of precepts in the Tathāgata's teaching.",
        "source": "T22n1425_001:0231c10_1"
    },
    {
        "source_sentence": "時舍利弗以哀愍故，偏袒右肩胡跪合掌白佛言：「世尊！",
        "translation": "Because of his compassion, Śāriputra bared his right shoulder and knelt down with his palms joined and said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0231c11_2"
    },
    {
        "source_sentence": "當來有善男子，於世尊法中信家非家、捨家出家，迷意顛倒起於淨想，無慚無愧三毒熾盛。",
        "translation": "In the future, there will be a good man who believes in the Bhagavān's teaching that home is not home and leaves home, abandons home and leaves home, becomes deluded and mistaken, gives rise to pure thoughts, and has no shame or scruples, and the three poisons of shame and modesty will be intense.",
        "source": "T22n1425_001:0231c12_3"
    },
    {
        "source_sentence": "唯願世尊為開方便，令是善男子更於如來法中得出家受具足戒。」",
        "translation": "May the Bhagavān, for the sake of initiating skillful means, cause these good men to again leave home in the Tathāgata's teaching and receive the full set of precepts.",
        "source": "T22n1425_001:0231c14_4"
    },
    {
        "source_sentence": "爾時佛告諸比丘：「依止毘舍離諸比丘皆悉令集。",
        "translation": "It was then that the Buddha addressed the monks, Relying on Vaiśālī, all the monks were assembled.",
        "source": "T22n1425_001:0231c15_5"
    },
    {
        "source_sentence": "為諸比丘制戒，乃至已聞者當重聞。",
        "translation": "The precepts are established for the monks, and even those who have heard them will hear them again.",
        "source": "T22n1425_001:0231c17_0"
    },
    {
        "source_sentence": "若比丘於和合僧中受具戒，若不還戒而行婬法，是比丘得波羅夷罪，不應共住。」",
        "translation": "If a monk receives the full set of precepts among the harmonious saṃgha and practices sexual misconduct without returning to the precepts, that monk will be guilty of the offense of pārājika and won't live together.",
        "source": "T22n1425_001:0231c17_1"
    },
    {
        "source_sentence": "復次佛住毘舍離，廣說如上。",
        "translation": "Furthermore, the Buddha abides in Vaiśālī: as has been said elaborately above.",
        "source": "T22n1425_001:0231c20_0"
    },
    {
        "source_sentence": "時諸比丘處處安居，安居已還詣毘舍離，到世尊所禮拜問訊。",
        "translation": "The monks then settled in various places, returned to Vaiśālī after settling there, and went to the Bhagavān to venerate and greet him.",
        "source": "T22n1425_001:0231c20_1"
    },
    {
        "source_sentence": "問訊已次第付房而住。",
        "translation": "After he had greeted them, he gave them to the room in order and stayed there.",
        "source": "T22n1425_001:0231c22_2"
    },
    {
        "source_sentence": "房盡不受，有依屋欄、草庵、空地、樹下住者。",
        "translation": "When the room was exhausted, he didn't accept it, and some relied on a railing, a grass hermitage, an empty space, or a tree to live.",
        "source": "T22n1425_001:0231c22_3"
    },
    {
        "source_sentence": "爾時有一比丘依樹下坐，作是思惟：「佛法出家甚為大苦，修習梵行亦為甚難。",
        "translation": "At the time, there was a monk sitting under a tree and thinking, It's very painful to leave home in the Buddha's way, and it's very difficult to cultivate the religious practice.",
        "source": "T22n1425_001:0231c23_4"
    },
    {
        "source_sentence": "晝則風飄日炙，夜則蚊虻毒虫所嚙，我欲不堪於佛法中修淨梵行。」",
        "translation": "When it's day, the wind blows and the sun roasts, and when it's night, mosquitoes, gadflies, and poisonous insects bite me; I want to be unable to cultivate the pure religious practice in the Buddha's teaching.",
        "source": "T22n1425_001:0231c25_5"
    },
    {
        "source_sentence": "彼比丘作是心念口言，諸比丘聞已便謂此比丘言：「汝捨戒耶？」",
        "translation": "That monk had this thought and said, After the monks heard it, they said to that monk, Have you renounced the precepts?",
        "source": "T22n1425_001:0231c26_6"
    },
    {
        "source_sentence": "答言：「不捨！",
        "translation": "He replied, No!",
        "source": "T22n1425_001:0231c28_7"
    },
    {
        "source_sentence": "我但作是念：『我不堪於如來法中修淨梵行。』」",
        "translation": "I simply think, 'I can't cultivate the pure religious practice in the Tathāgata's teaching.'",
        "source": "T22n1425_001:0231c28_8"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊：「是比丘捨戒。」",
        "translation": "For this reason, the monks went to the Bhagavān and said, That monk renounced the precepts.",
        "source": "T22n1425_001:0231c29_9"
    },
    {
        "source_sentence": "爾時世尊告諸比丘：「喚彼比丘來。」",
        "translation": "It was then that the Bhagavān addressed the monks, calling that monk to come.",
        "source": "T22n1425_001:0232a01_10"
    },
    {
        "source_sentence": "來已，佛問比丘：「汝實捨戒耶？」",
        "translation": "After coming, the Buddha asked the monk, Have you really abandoned the precepts?",
        "source": "T22n1425_001:0232a02_11"
    },
    {
        "source_sentence": "答言：「不捨。」",
        "translation": "He replied, I won't abandon it.",
        "source": "T22n1425_001:0232a02_12"
    },
    {
        "source_sentence": "佛言：「何緣致此？」",
        "translation": "The Buddha said, What's the reason for this?",
        "source": "T22n1425_001:0232a03_13"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T22n1425_001:0232a03_14"
    },
    {
        "source_sentence": "我於樹下作是心念口言：『於佛法中捨家出家甚為大苦，我不堪於如來法中修淨梵行。』」",
        "translation": "At the foot of a tree, I thought to myself and said, 'It's very painful for me to abandon home and leave home in the Buddha's teaching; I can't cultivate the pure religious practice in the Tathāgata's teaching.'",
        "source": "T22n1425_001:0232a03_15"
    },
    {
        "source_sentence": "佛告比丘：「汝云何於如來法中信家非家、捨家出家，而作是念：『我不堪忍於如來法中修淨梵行。』」",
        "translation": "The Buddha told the monks, How do you believe in the Tathāgata's teaching that home is not a home and renunciation of home makes you think, 'I can't tolerate cultivating the pure religious practice in the Tathāgata's teaching.'",
        "source": "T22n1425_001:0232a05_16"
    },
    {
        "source_sentence": "佛言：「是比丘不名捨戒，是名戒羸。",
        "translation": "The Buddha said, That monk isn't called a renunciant of the precepts, which is called a weakness in the precepts.",
        "source": "T22n1425_001:0232a07_17"
    },
    {
        "source_sentence": "彼作戒羸說語，得偷蘭罪。」",
        "translation": "If they speak poorly according to the precepts, they'll be guilty of stealing a pārājika.",
        "source": "T22n1425_001:0232a08_18"
    },
    {
        "source_sentence": "爾時佛告諸比丘：「依止毘舍離比丘皆悉令集，乃至未聞者當聞、已聞者重聞。",
        "translation": "It was then that the Buddha addressed the monks, Relying on Vaiśālī, all the monks will be assembled, even those who haven't heard it will hear it and those who have heard it will hear it again.",
        "source": "T22n1425_001:0232a09_19"
    },
    {
        "source_sentence": "若比丘於和合僧中受具足戒，不還戒，戒羸，不捨戒便行婬法，是比丘得波羅夷罪，不應共住。」",
        "translation": "If a monk who receives the full set of precepts among the harmonious saṃgha and doesn't return to the precepts, whose precepts are weak, or who practices sexual misconduct without renouncing them, that monk will be guilty of the offense of pārājika and won't live together.",
        "source": "T22n1425_001:0232a10_20"
    },
    {
        "source_sentence": "復次佛住舍衛城，廣說如上。",
        "translation": "Furthermore, the Buddha stayed in Śrāvastī and explained it in detail as above.",
        "source": "T22n1425_001:0232a13_0"
    },
    {
        "source_sentence": "時舍衛城有長老名難提，信家非家、捨家出家，於舍衛城眾所知識，能致供養四事具足。",
        "translation": "At the time, there was an elder named Nandi in Sāvatthī who believed that home is not home and renounced home; he renounced home and left home. Known by the people in Sāvatthī, he was able to cause them to make offerings of all four kinds.",
        "source": "T22n1425_001:0232a13_1"
    },
    {
        "source_sentence": "餘多有名難提是，但是長老行時亦禪、住時亦禪、坐時亦禪、臥時亦禪，時人名之為禪難提。",
        "translation": "But the elder also meditates while walking, he meditates while standing, meditates while sitting, and meditates while lying down.",
        "source": "T22n1425_001:0232a15_2"
    },
    {
        "source_sentence": "時難提於開眼林中作草庵舍，彼於其中初中後夜修行自業，得世俗正受乃經七年。",
        "translation": "Nandi then made a hermitage of grass in the open-eyed forest, where he cultivated his own practice late in the morning and late at night, and it took seven years to attain worldly correct enlightenment.",
        "source": "T22n1425_001:0232a17_3"
    },
    {
        "source_sentence": "過七年已退失禪定，復依一樹下還習正受乃求本定。",
        "translation": "After seven years had passed, he retreated from meditation and relied on a tree to return to cultivate right reception, then seeking his original concentration.",
        "source": "T22n1425_001:0232a19_4"
    },
    {
        "source_sentence": "時魔眷屬常作方便，於行正法人伺求其短，變為人形端正無比，種種花香瓔珞以嚴其身，於難提前住，謂難提言：「比丘！",
        "translation": "At the time, Māra's retinue always used skillful means to search for a person who was practicing righteousness and seeking their shortcomings, transformed into a human form that was incomparably good-looking, adorned his body with various flowers, fragrant necklaces, and jewelry, and stayed ahead of Nandi, saying, Monk!",
        "source": "T22n1425_001:0232a20_5"
    },
    {
        "source_sentence": "共相娛樂行婬事來。」",
        "translation": "They'll come together to entertain each other and perform debauchery.",
        "source": "T22n1425_001:0232a23_6"
    },
    {
        "source_sentence": "時難提言：「惡邪速滅！",
        "translation": "Nandi then said, Quickly extinguish evil!",
        "source": "T22n1425_001:0232a24_7"
    },
    {
        "source_sentence": "惡邪速滅！」",
        "translation": "Bad and evil will quickly cease!",
        "source": "T22n1425_001:0232a24_8"
    },
    {
        "source_sentence": "口作此言而目不視。",
        "translation": "He spoke these words with his mouth but didn't look around.",
        "source": "T22n1425_001:0232a24_9"
    },
    {
        "source_sentence": "天女復第二、第三所說如上。",
        "translation": "Again, the second and third teachings of the goddesses are as explained above.",
        "source": "T22n1425_001:0232a25_10"
    },
    {
        "source_sentence": "時難提第二、第三亦如是說：「惡邪速滅！",
        "translation": "The second and third Nandikas then also said, So be it, quickly extinguish evil!",
        "source": "T22n1425_001:0232a25_11"
    },
    {
        "source_sentence": "惡邪速滅！」",
        "translation": "Bad and evil will quickly cease!",
        "source": "T22n1425_001:0232a26_12"
    },
    {
        "source_sentence": "而不觀視。",
        "translation": "They don't look at it.",
        "source": "T22n1425_001:0232a27_13"
    },
    {
        "source_sentence": "時天女便脫瓔珞之服露其形體，立難提前語難提言：「共行婬來。」",
        "translation": "The goddess then took off her diadem robe and revealed her body, stood up, and said to Nandi in advance, Come along with me.",
        "source": "T22n1425_001:0232a27_14"
    },
    {
        "source_sentence": "時難提見其形相而生欲心，答言：「可爾。」",
        "translation": "Seeing his form and characteristics, Nandi gave rise to the mind of desire and replied, Yes.",
        "source": "T22n1425_001:0232a28_15"
    },
    {
        "source_sentence": "時天女漸漸却行，難提喚言：「汝可小住，共相娛樂。」",
        "translation": "The goddesses then gradually withdrew, and Nandi called out, You may stay a little bit longer to enjoy yourself.",
        "source": "T22n1425_001:0232a29_16"
    },
    {
        "source_sentence": "難提往就，天女疾疾而去。",
        "translation": "Nandi came and went, and the heavenly maidens departed in distress.",
        "source": "T22n1425_001:0232b01_17"
    },
    {
        "source_sentence": "難提追逐到祇洹塹，塹中有王家死馬，天女到死馬所隱形不現。",
        "translation": "Nandi chased it to the Jetavana moat, where there was a dead horse belonging to the king's family in a moat, and the goddess went to the place where the dead horse was hiding but didn't show up.",
        "source": "T22n1425_001:0232b02_18"
    },
    {
        "source_sentence": "時難提欲心熾盛即婬死馬。",
        "translation": "At the time, Nandika's mind was full of desire, which is to gnaw a dead horse.",
        "source": "T22n1425_001:0232b03_19"
    },
    {
        "source_sentence": "欲心息已便作是念：「我甚不善，非沙門法，以信出家而犯波羅夷罪，用著法服食人信施為？」",
        "translation": "After calming his mind with desire, he thought, I'm very unwholesome, not according to the ascetic teachings, and it's a sin to leave home because of faith and commit the offense of pārājika by wearing religious robes and feeding people who believe in giving.",
        "source": "T22n1425_001:0232b04_20"
    },
    {
        "source_sentence": "即脫法服著右手中，左手掩形而趣祇洹語比丘言：「長老！",
        "translation": "He then took off his Dharma robe, put it in his right hand, covered his form with his left hand, and headed for Jīvaka, saying to the monk, Elder!",
        "source": "T22n1425_001:0232b06_21"
    },
    {
        "source_sentence": "我犯波羅夷！",
        "translation": "I've violated the pārājika!",
        "source": "T22n1425_001:0232b07_22"
    },
    {
        "source_sentence": "我犯波羅夷！」",
        "translation": "I've violated the pārājika!",
        "source": "T22n1425_001:0232b08_23"
    },
    {
        "source_sentence": "時諸比丘在祇洹門間經行仿佯思惟自業，共相謂言：「此是坐禪難提，修梵行人不應犯波羅夷。」",
        "translation": "The monks then went to the entrance of Jeta's gate, walked through it, contemplated their own actions, and said to each other, This is Nandi sitting in meditation, cultivating religious practice so that he won't violate the pārājika.",
        "source": "T22n1425_001:0232b08_24"
    },
    {
        "source_sentence": "難提復言：「諸長老！",
        "translation": "Again, Nandi said, Elders!",
        "source": "T22n1425_001:0232b10_25"
    },
    {
        "source_sentence": "不爾，我實犯波羅夷。」",
        "translation": "If that's not the case, I really committed a pārājika.",
        "source": "T22n1425_001:0232b11_0"
    },
    {
        "source_sentence": "諸比丘即問其因緣，難提具說上事。",
        "translation": "The monks then asked their causes and conditions, and Nandi explained the above matter in detail.",
        "source": "T22n1425_001:0232b11_1"
    },
    {
        "source_sentence": "諸比丘以是事具白世尊。",
        "translation": "The monks told the Bhagavān about these things.",
        "source": "T22n1425_001:0232b12_2"
    },
    {
        "source_sentence": "佛告諸比丘：「是難提善男子自說所犯重罪，應當驅出。」",
        "translation": "The Buddha told the monks, This is a good man named Nandi who says for himself that he's committed a serious offense and should be expelled.",
        "source": "T22n1425_001:0232b12_3"
    },
    {
        "source_sentence": "時諸比丘如教驅出。",
        "translation": "The monks then expelled him as instructed.",
        "source": "T22n1425_001:0232b14_4"
    },
    {
        "source_sentence": "諸比丘白佛言：「世尊！",
        "translation": "The monks said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0232b14_5"
    },
    {
        "source_sentence": "云何長老難提久修梵行，而為此天女之所誑惑？」",
        "translation": "How did the elder Nandi cultivate religious practice for a long time and be tormented by this goddess?",
        "source": "T22n1425_001:0232b15_6"
    },
    {
        "source_sentence": "佛告諸比丘：「是難提比丘不但今日為天女所惑退失梵行，過去世時亦為彼所惑失於梵行。」",
        "translation": "The Buddha told the monks, Not only is this monk Nandi today deluded by goddesses and lost his religious practice, but in a past life he was also deluded by them and lost their religious practice.",
        "source": "T22n1425_001:0232b16_7"
    },
    {
        "source_sentence": "諸比丘白佛言：「已曾爾耶？」",
        "translation": "The monks said to the Buddha, Have you ever done that?",
        "source": "T22n1425_001:0232b18_8"
    },
    {
        "source_sentence": "佛言：「如是。」",
        "translation": "The Buddha said, So it is.",
        "source": "T22n1425_001:0232b19_0"
    },
    {
        "source_sentence": "佛告諸比丘：「過去世時有城名波羅奈，國名迦尸。",
        "translation": "The Buddha told the monks, In a past life, there was a city named Vārāṇasī and a country named Kāśi.",
        "source": "T22n1425_001:0232b19_1"
    },
    {
        "source_sentence": "時南方阿槃提國，有迦葉氏外道出家，聰明博識綜練群籍，眾技妙術靡不開達，彼外道者助王治國。",
        "translation": "In the southern country of Avanti, there was a renunciant named Kāśyapa who had renounced the householder’s life. He was an intelligent and erudite man and well versed in all the disciplinary disciplines. All his skills and knowledge were enlightened; those non-Buddhist practitioners assisted the king in governing his country.",
        "source": "T22n1425_001:0232b20_2"
    },
    {
        "source_sentence": "時彼國王執持姦賊種種治罪，或截手足、髡其耳鼻，治之甚苦。",
        "translation": "The king of that country then held the adulterous thief and variously punished him, cutting off his hands, feet, ears, and nose, and treating him with extreme pain.",
        "source": "T22n1425_001:0232b22_3"
    },
    {
        "source_sentence": "時彼外道深自惟念：『我已出家云何與王共參此事？』",
        "translation": "That non-Buddhist then deeply thought to himself, 'How can I go along with the king in this matter when I've left home?'",
        "source": "T22n1425_001:0232b24_4"
    },
    {
        "source_sentence": "便白王言：『聽我出家。』",
        "translation": "He then said to the king, 'Listen as I leave home.'",
        "source": "T22n1425_001:0232b25_5"
    },
    {
        "source_sentence": "王即答言：『師已出家，云何方言復欲出家？』",
        "translation": "The king then answered, 'The teacher has left home, so how could he say he wants to leave home again?'",
        "source": "T22n1425_001:0232b25_6"
    },
    {
        "source_sentence": "答言：『大王！",
        "translation": "He replied, 'Great king!",
        "source": "T22n1425_001:0232b26_7"
    },
    {
        "source_sentence": "我今豫此種種刑罰苦惱眾生，何名出家？』",
        "translation": "Now that I've prepared these various punishments and painful sentient beings, what's the name for leaving home?'",
        "source": "T22n1425_001:0232b26_8"
    },
    {
        "source_sentence": "王即問言：『師今欲於何道出家？』",
        "translation": "The king then asked, 'What path does the teacher want to leave home now?'",
        "source": "T22n1425_001:0232b27_9"
    },
    {
        "source_sentence": "答言：『大王！",
        "translation": "He replied, 'Great king!",
        "source": "T22n1425_001:0232b28_10"
    },
    {
        "source_sentence": "欲學仙人出家。』",
        "translation": "I want to train as a sage and leave home.'",
        "source": "T22n1425_001:0232b28_11"
    },
    {
        "source_sentence": "王言：『可爾，隨意出家。』",
        "translation": "The king said, 'That's right, leave home as you wish.'",
        "source": "T22n1425_001:0232b29_12"
    },
    {
        "source_sentence": "去城不遙有百巖山，有流泉浴池花果茂盛，即造彼山起立精舍。",
        "translation": "Not far from the city, there are a hundred rocky mountains with flowing springs and bathing ponds that offer plenty of flowers and fruit. So they built a monastery on those mountains to establish it.",
        "source": "T22n1425_001:0232b29_13"
    },
    {
        "source_sentence": "彼於山中修習外道，得世俗定起五神通。",
        "translation": "He cultivates non-Buddhist practices in the mountain, attains worldly concentration, and produces five supernormal powers.",
        "source": "T22n1425_001:0232c02_14"
    },
    {
        "source_sentence": "於春後月食諸果蓏四大不適，因其小行不淨流出。",
        "translation": "In the months after spring, he eats fruits and garlands that are unfit for the four major foods, and because of his minor actions, impure flows flow out.",
        "source": "T22n1425_001:0232c03_15"
    },
    {
        "source_sentence": "時鹿愛群共相馳逐，渴乏求水飲此小便，不淨著舌舐其產道，眾生行報不可思議因是受胎，常在廬側食草飲水，至期月滿產一小兒。",
        "translation": "The deer then loved the herd and chased after each other, became hungry and thirsty, asked for water to drink this urine, touched it with their tongues and licked its way, and the karmic retribution of sentient beings was unfathomable.",
        "source": "T22n1425_001:0232c04_16"
    },
    {
        "source_sentence": "爾時仙人出行採果，鹿產難故即大悲鳴，仙人聞鹿鳴急謂為惡虫所害，欲往救之，遂見生一小兒。",
        "translation": "At the time, the sage was traveling to gather fruit when a deer had difficulty producing it and therefore cried out in great sorrow. When the sage heard the sound of the deer's voice, he quickly thought that he had been harmed by a bad bug, and wanted to rescue him, so he saw a small child born.",
        "source": "T22n1425_001:0232c07_17"
    },
    {
        "source_sentence": "仙人見已怪而念曰：『云何畜生而生於人？』",
        "translation": "Seeing this, the sage wondered and thought, 'How are animals born in humans?'",
        "source": "T22n1425_001:0232c09_18"
    },
    {
        "source_sentence": "尋入定思惟，見本因緣，即是我子。",
        "translation": "When he enters into meditation and contemplates, he sees the original causes and conditions as my child.",
        "source": "T22n1425_001:0232c10_19"
    },
    {
        "source_sentence": "於彼小兒便生愛心，裹以皮衣持歸養之。",
        "translation": "They then became attached to the boy and wrapped him in leather clothes to support him.",
        "source": "T22n1425_001:0232c11_20"
    },
    {
        "source_sentence": "仙人抱舉鹿母乳之，漸漸長大名為鹿斑。",
        "translation": "The sage held the deer in his arms and fed it to him, gradually growing into what's called the deer stain.",
        "source": "T22n1425_001:0232c12_21"
    },
    {
        "source_sentence": "依母生故體斑似母，是故作字名曰鹿斑。",
        "translation": "Depending on the mother's birth, his body is mottled like a mother; therefore, he makes the name deer mottled.",
        "source": "T22n1425_001:0232c13_22"
    },
    {
        "source_sentence": "是童子漸漸長大至年七歲，遜弟尊長、仁愛孝慈，採取水果供養仙人。",
        "translation": "The boy grew up gradually until he was seven years old, and his humble disciples, the venerable elders, kindness, filial piety, and compassion collected fruit to make offerings to the sage.",
        "source": "T22n1425_001:0232c14_23"
    },
    {
        "source_sentence": "是時仙人念言：『天下可畏無過女人。』",
        "translation": "The sage then thought, 'There's nothing more fearful in the world than a woman.'",
        "source": "T22n1425_001:0232c15_24"
    },
    {
        "source_sentence": "即便教誡子言：『可畏之甚無過女人，敗正毀德靡不由之。』",
        "translation": "He even instructed his son, saying, 'There's nothing more to be feared than a woman who doesn't defeat or disparage virtue because of her.'",
        "source": "T22n1425_001:0232c16_25"
    },
    {
        "source_sentence": "於是教以禪定化以五通。",
        "translation": "He then taught that he transformed the five supernormal powers with meditation.",
        "source": "T22n1425_001:0232c17_26"
    },
    {
        "source_sentence": "「『一切眾生類，　　靡不歸於死；",
        "translation": "'All sentient beings of all kinds All return to death.",
        "source": "T22n1425_001:0232c18_27"
    },
    {
        "source_sentence": "　　隨其業所趣，　　自受其果報。",
        "translation": "According to the course of their actions, they'll receive their own results.",
        "source": "T22n1425_001:0232c18_27"
    },
    {
        "source_sentence": "　　為善者生天，　　惡行入地獄；",
        "translation": "Those who do good deeds will be reborn in heaven, And those who commit evil deeds will go to hell.",
        "source": "T22n1425_001:0232c18_27"
    },
    {
        "source_sentence": "　　行道修梵行，　　漏盡得泥洹。』",
        "translation": "Practicing the path and cultivating religious practice, he'll end the contaminants and attain nirvāṇa.'",
        "source": "T22n1425_001:0232c18_27"
    },
    {
        "source_sentence": "如所說：「爾時仙人便即命終，於是童子淨修梵行得外道四禪，起五神通有大神力，能移山住流捫摸日月。",
        "translation": "As he said, The sage then died, so the boy cultivated pure religious practices and attained the fourth meditation of non-Buddhistism, produced five supernormal powers with great supernormal abilities that moved the mountain and stayed in the stream to touch the sun and moon.",
        "source": "T22n1425_001:0232c18_27"
    },
    {
        "source_sentence": "爾時釋提桓因乘白龍象案行世間，誰有孝順父母、供養沙門婆羅門，有能布施持戒修梵行者？",
        "translation": "At the time, when Śakra Devānām-Indra was traveling in the world on a white dragon elephant desk, who would be able to follow their parents and make offerings to ascetics and priests who were capable of generosity, observe precepts, and cultivate the religious practice?",
        "source": "T22n1425_001:0232c25_28"
    },
    {
        "source_sentence": "案行世界時見是仙人童子，天帝念言：『若是童子欲求帝釋梵王，皆悉能得，宜應早壞。』",
        "translation": "When he was traveling in the world, he saw this sage boy, and Indra thought, 'If this boy wants to seek Indra or Brahmā, they'll all attain it; it's better to destroy it sooner.'",
        "source": "T22n1425_001:0232c27_29"
    },
    {
        "source_sentence": "「『諸天及世人，　　一切眾生類；",
        "translation": "'The gods and humans, All the sentient beings of all kinds.",
        "source": "T22n1425_001:0232c29_30"
    },
    {
        "source_sentence": "　　莫不為結縛，　　命終墮惡道。』",
        "translation": "None of them are bound by bonds, and they'll fall into a bad path at the end of their life.'",
        "source": "T22n1425_001:0232c29_30"
    },
    {
        "source_sentence": "如所說：「皆為慳嫉二結所縛。",
        "translation": "As explained, they're all bound by the two bonds of stinginess and jealousy.",
        "source": "T22n1425_001:0232c29_30"
    },
    {
        "source_sentence": "諸天有三時鼓：諸天阿修羅共戰時打第一鼓；",
        "translation": "The gods have three kinds of drums at different times:",
        "source": "T22n1425_001:0233a03_31"
    },
    {
        "source_sentence": "俱毘羅園眾花開敷時打第二鼓；",
        "translation": "When the flowers in Kapilavastu are blooming, he beats the second drum.",
        "source": "T22n1425_001:0233a04_32"
    },
    {
        "source_sentence": "集善法講堂聽善法時打第三鼓。",
        "translation": "When he gathers in the hall of the good dharma and listens to the good dharma, he beats the third drum.",
        "source": "T22n1425_001:0233a05_33"
    },
    {
        "source_sentence": "釋提桓因扣說法鼓，無數百千天子皆悉來集，俱白帝釋：『何所誨勅？』",
        "translation": "When Śakra Devānām-Indra stopped the preaching drum, countless hundreds of thousands of celestial beings gathered together and all said to Indra, 'What's the teaching?'",
        "source": "T22n1425_001:0233a06_0"
    },
    {
        "source_sentence": "帝釋告言：『閻浮提有仙人童子，名曰鹿斑，有大功德，欲方便壞之。』",
        "translation": "Śakra told him, 'There's a sage boy named Deer Spot in Jambudvīpa who has great merit and wants to destroy it with skillful means.'",
        "source": "T22n1425_001:0233a07_1"
    },
    {
        "source_sentence": "時無數天子聞此不樂，便自念言：『壞此人者，將減損諸天眾、增益阿修羅。』",
        "translation": "When countless celestial beings heard this unpleasant, they thought to themselves, 'If we destroy this person, we'll decrease the number of gods and increase the number of asuras.'",
        "source": "T22n1425_001:0233a09_0"
    },
    {
        "source_sentence": "中有平心無當成敗無在，又復歡喜助欲壞之。",
        "translation": "There's a peaceful mind in the middle that has no future formation or demise and no presence, and it's also rejoicing and wanting to help destroy it.",
        "source": "T22n1425_001:0233a10_1"
    },
    {
        "source_sentence": "有一天子而唱是言：『誰應行者？』",
        "translation": "The celestial beings then called out, 'Who should practice?'",
        "source": "T22n1425_001:0233a11_2"
    },
    {
        "source_sentence": "時有答言：『是天女應行。",
        "translation": "Someone then answered, 'That's what the goddess should do.",
        "source": "T22n1425_001:0233a12_3"
    },
    {
        "source_sentence": "是諸天人遊觀諸園，在歡喜園者、在雜色園者、在麁澁園者，天女應行。』",
        "translation": "Those gods and humans who are in the joyful park, those in the mixed-colored park, and those in the garland park should go there, goddesses.'",
        "source": "T22n1425_001:0233a12_4"
    },
    {
        "source_sentence": "而便召之。",
        "translation": "He then summoned him.",
        "source": "T22n1425_001:0233a14_5"
    },
    {
        "source_sentence": "應時百千天女皆悉來集。",
        "translation": "At the time, a hundred thousand goddesses all gathered here.",
        "source": "T22n1425_001:0233a14_6"
    },
    {
        "source_sentence": "有一天女名阿藍浮，其髮雜色，髮有四色青黃赤白，故名雜色，差此天女往閻浮提壞鹿斑童子。",
        "translation": "The goddess named Ārūpyadhvaja had a mixed complexion of the four colors of blue, yellow, red, and white; so she was sent to Jambudvīpa to destroy the deer-colored youth.",
        "source": "T22n1425_001:0233a15_7"
    },
    {
        "source_sentence": "時彼天女白帝釋言：『我自昔以來數壞人梵行令失神通，願更遣餘天女端正嚴好令人樂者。』",
        "translation": "That goddess then said to Śakra, 'Since the distant past, I've repeatedly disrupted people's religious practice and caused them to lose their supernormal powers, wishing to send other goddesses who are beautiful and delightful.'",
        "source": "T22n1425_001:0233a17_8"
    },
    {
        "source_sentence": "時天帝釋復於眾中種種說偈勸喻天女：『阿藍浮！",
        "translation": "Again, Indra again spoke various verses to the goddess in the crowd and encouraged her with these metaphors, saying, 'Alambana!",
        "source": "T22n1425_001:0233a19_9"
    },
    {
        "source_sentence": "汝可使行壞俱舍頻頭。』",
        "translation": "You may cause the practice to disintegrate Kuśinagara's frequent head.'",
        "source": "T22n1425_001:0233a20_10"
    },
    {
        "source_sentence": "如《生經》中說。",
        "translation": "It's as explained in the Birth Sutra.",
        "source": "T22n1425_001:0233a21_11"
    },
    {
        "source_sentence": "於是天女即壞仙人童子。」",
        "translation": "The goddess then destroyed the sage boy.",
        "source": "T22n1425_001:0233a21_12"
    },
    {
        "source_sentence": "佛告諸比丘：「爾時仙人童子俱舍頻頭者豈異人乎？",
        "translation": "The Buddha told the monks, Isn't that a different person than the sage boy Kauśinagara?",
        "source": "T22n1425_001:0233a22_13"
    },
    {
        "source_sentence": "即今禪難提是。",
        "translation": "That's what Nandi is in the present dhyāna.",
        "source": "T22n1425_001:0233a23_14"
    },
    {
        "source_sentence": "天女阿藍浮者，今此天女是。",
        "translation": "The goddess Ārāpaṇeṣa is now this goddess.",
        "source": "T22n1425_001:0233a23_15"
    },
    {
        "source_sentence": "而難提曾已為其所壞，今作比丘復為其所壞。」",
        "translation": "Nandi had been destroyed by him before, and now he's a monk again destroyed by him.",
        "source": "T22n1425_001:0233a24_16"
    },
    {
        "source_sentence": "爾時世尊語諸比丘：「乃至非人中亦犯波羅夷，不應共住。」",
        "translation": "It was then that the Bhagavān said to the monks, Even if someone isn't a human being and violates the pārājika, they shouldn't live together.",
        "source": "T22n1425_001:0233a25_17"
    },
    {
        "source_sentence": "復次佛住王舍城，廣說如上。",
        "translation": "Furthermore, the Buddha stayed in Rājagṛha and explained it in detail as above.",
        "source": "T22n1425_001:0233a27_0"
    },
    {
        "source_sentence": "時諸比丘處處夏安居，安居已來詣王舍城禮拜問訊世尊，各隨所樂住，或住毘婆羅精舍、或住白山精舍、或住方山精舍、或住仙人窟、或住耆闍崛山窟、或住辯才巖窟、或住拘利園精舍、或住賴咤園精舍、或住師子園精舍、或住七葉園精舍、或住溫泉精舍、或住散蓋窟、或住菴羅窟、或住卑尸窟、或住猿猴精舍。",
        "translation": "The monks then spent the summer retreat in various places. Having completed their retreat, they came to the city of Rājagṛha to pay their respects and greetings to the World-honored One. Each of them lived according to his wishes, either in a monastery at Vaibhā Monastery, or in one of the white mountain monasteries, or in one of the monasteries on the side",
        "source": "T22n1425_001:0233a27_1"
    },
    {
        "source_sentence": "時有客比丘到此猿猴精舍，詣先住知識比丘所共相慰勞。",
        "translation": "A guest monk then came to this monkey monastery and went to the monkey's monastery, visited the monks who lived there before him, and comforted them.",
        "source": "T22n1425_001:0233b05_2"
    },
    {
        "source_sentence": "相慰勞已，彼舊住比丘供給澡水洗於手足，與中後漿示房舍處，時客比丘各得止息。",
        "translation": "After they had comforted each other, the old monks who lived there offered water for washing their hands and feet, gave them some juice to show them where to live. The guest monks were allowed to stop at that time.",
        "source": "T22n1425_001:0233b07_3"
    },
    {
        "source_sentence": "爾時山頭有一雌猿猴，從上來下到舊比丘前背住，現受婬相。",
        "translation": "At the top of the mountain, there's a female monkey at the top that comes down from above and goes to the old monk in front of him with its back turned, and now it's suffering debilitating appearance.",
        "source": "T22n1425_001:0233b09_4"
    },
    {
        "source_sentence": "時舊比丘呵叱令去，如是復至餘比丘前背住，現受婬相。",
        "translation": "The old monk then scolded him and told him to leave, and so he went back to the other monks who were standing with their backs turned in front of him and showed them a crude appearance.",
        "source": "T22n1425_001:0233b10_5"
    },
    {
        "source_sentence": "時客比丘作是念：「野獸之法甚易恐怖，而今驅遣不能令去，此必有以，是中將無有共此雌猿猴作不淨行耶？」",
        "translation": "The guest monk then had this thought, wild animals are so easy to fear that they can't be driven away, but there must be a reason for doing so; isn't there a reason for sharing the impure actions of females, monkeys, and females with these females?",
        "source": "T22n1425_001:0233b11_6"
    },
    {
        "source_sentence": "時客比丘語舊比丘言：「長老！",
        "translation": "The guest monk then said to the old monk, Elder!",
        "source": "T22n1425_001:0233b14_7"
    },
    {
        "source_sentence": "我今欲去，汝可還攝床褥。」",
        "translation": "Now that I want to leave, you may return with the bed and mattress.",
        "source": "T22n1425_001:0233b15_0"
    },
    {
        "source_sentence": "舊比丘言：「諸長老！",
        "translation": "The old monks said, Elders!",
        "source": "T22n1425_001:0233b15_1"
    },
    {
        "source_sentence": "今此住處有好床褥前食後食，安隱快樂，幸可留意共於此住。」",
        "translation": "Now, there's a nice bed and bedding in this dwelling place where they eat before and eat after the food, and they're comfortable and happy, so it's fortunate that they can remember to live together here.",
        "source": "T22n1425_001:0233b16_0"
    },
    {
        "source_sentence": "答言：「不住！」",
        "translation": "He replied, Don't!",
        "source": "T22n1425_001:0233b17_1"
    },
    {
        "source_sentence": "舊比丘慇懃三請，客比丘不受彼請，於是而去。",
        "translation": "The old monk accepted the three invitations, and the guest monk didn't accept them, so he departed.",
        "source": "T22n1425_001:0233b17_2"
    },
    {
        "source_sentence": "時客比丘心無疑者出便即去，心有疑者便於近處隱身各共伺之。",
        "translation": "When the guest monk's mind isn't doubtful, he exits and immediately leaves, and those who have doubts in their minds then go to a nearby secluded place to investigate them together.",
        "source": "T22n1425_001:0233b18_3"
    },
    {
        "source_sentence": "時舊比丘見客比丘去已便攝臥具，攝臥具已洗足而坐。",
        "translation": "Seeing the guest monk's departure, the old monk gathered his bedding, washed his feet after gathering it, and sat down.",
        "source": "T22n1425_001:0233b20_4"
    },
    {
        "source_sentence": "爾時山頂雌猿猴，復從山上下至比丘前背住。",
        "translation": "At that point, the female monkeys at the top of the mountain again descended up and down from the mountain to stand with their backs in front of the monk.",
        "source": "T22n1425_001:0233b21_5"
    },
    {
        "source_sentence": "時舊比丘便共此猿猴行於非法，客比丘遙見已共相謂言：「如我所疑，今已顯露。」",
        "translation": "The old monk then traveled with this monkey to an unlawful place, and the guest monk saw him from a distance and said to each other, As I doubt it, I've now revealed it.",
        "source": "T22n1425_001:0233b22_6"
    },
    {
        "source_sentence": "以是因緣往白世尊：「長尾園中舊住比丘作如是惡法。」",
        "translation": "For this reason, he went to the Bhagavān and said, That monk who used to live in the long-tailed park did such a bad deed.",
        "source": "T22n1425_001:0233b24_7"
    },
    {
        "source_sentence": "佛言：「呼是比丘來！」",
        "translation": "The Buddha said, Call that monk to come!",
        "source": "T22n1425_001:0233b25_8"
    },
    {
        "source_sentence": "來已，佛問比丘：「汝實作是事不？」",
        "translation": "After coming, the Buddha asked the monk, Did you really do this?",
        "source": "T22n1425_001:0233b26_9"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1425_001:0233b26_10"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1425_001:0233b27_0"
    },
    {
        "source_sentence": "佛告比丘：「汝不知佛制戒不得行婬法耶？」",
        "translation": "The Buddha told the monk, Don't you know that the Buddha precept forbids you to practice sexual misconduct?",
        "source": "T22n1425_001:0233b27_1"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T22n1425_001:0233b28_2"
    },
    {
        "source_sentence": "我知制戒，自謂不得與人非人，不謂畜生。」",
        "translation": "I know the precepts, saying that I won't be allowed to give them to people or non-people, not to animals.",
        "source": "T22n1425_001:0233b28_3"
    },
    {
        "source_sentence": "佛言：「比丘犯畜生者，亦波羅夷。",
        "translation": "The Buddha said, A monk who violates the rules for animals also commits pārājika.",
        "source": "T22n1425_001:0233b29_4"
    },
    {
        "source_sentence": "比丘當知有三事犯波羅夷。",
        "translation": "A monk should know that there are three ways to violate the pārājika.",
        "source": "T22n1425_001:0233b29_5"
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are these three?",
        "source": "T22n1425_001:0233c01_6"
    },
    {
        "source_sentence": "人、非人、畜生是為三。」",
        "translation": "Humans, nonhumans, and animals are the three.",
        "source": "T22n1425_001:0233c01_7"
    },
    {
        "source_sentence": "復次佛住舍衛城，廣說如上。",
        "translation": "Furthermore, the Buddha stayed in Śrāvastī and explained it in detail as above.",
        "source": "T22n1425_001:0233c03_0"
    },
    {
        "source_sentence": "有一比丘，時到著入聚落衣持鉢入城，次行乞食至一家。",
        "translation": "When a monk arrived, he put on his robes, entered the village, took his bowl into the city, and went to one house to solicit alms.",
        "source": "T22n1425_001:0233c03_1"
    },
    {
        "source_sentence": "有一女人語比丘言：「可入大德共作是事。」",
        "translation": "A woman said to the monk, You may enter and work together with the great virtuous one for this.",
        "source": "T22n1425_001:0233c04_2"
    },
    {
        "source_sentence": "比丘答言：「世尊制戒不得行婬。」",
        "translation": "The monk answered, Bhagavān, the Bhagavān prescribes that you mustn't practice sexual misconduct.",
        "source": "T22n1425_001:0233c05_3"
    },
    {
        "source_sentence": "女人復言：「我知不得常道中行，自可於非道中行。」",
        "translation": "The woman again said, I know that I can't practice in the eternal path; I can practice in what's not the path.",
        "source": "T22n1425_001:0233c06_4"
    },
    {
        "source_sentence": "時此比丘即共女人於非道行婬。",
        "translation": "That monk then had sexual intercourse with a woman who was not practicing the path.",
        "source": "T22n1425_001:0233c07_5"
    },
    {
        "source_sentence": "行婬已尋起疑悔，往白世尊。",
        "translation": "After he had done so, he asked questions and regretted his doubts and went to the Bhagavān.",
        "source": "T22n1425_001:0233c08_6"
    },
    {
        "source_sentence": "佛告比丘：「汝不知佛制戒不得行婬耶？」",
        "translation": "The Buddha told the monk, Don't you know that the Buddha precept forbids you to practice sexual misconduct?",
        "source": "T22n1425_001:0233c09_7"
    },
    {
        "source_sentence": "「世尊我知制戒，自謂不得常道行婬，不謂非道。」",
        "translation": "Bhagavān, I know the precepts and tell myself that I won't attain the eternal path and practice sexual misconduct, but I don't say it's not the path.",
        "source": "T22n1425_001:0233c10_8"
    },
    {
        "source_sentence": "佛告比丘：「非道亦犯波羅夷。」",
        "translation": "The Buddha told the monk, If you don't follow the path, you'll also commit pārājika.",
        "source": "T22n1425_001:0233c11_9"
    },
    {
        "source_sentence": "復次佛住舍衛城，廣說如上。",
        "translation": "Furthermore, the Buddha stayed in Śrāvastī and explained it in detail as above.",
        "source": "T22n1425_001:0233c12_0"
    },
    {
        "source_sentence": "有一比丘，時到著入聚落衣持鉢入城，次行乞食至一家。",
        "translation": "When a monk arrived, he put on his robes, entered the village, took his bowl into the city, and went to one house to solicit alms.",
        "source": "T22n1425_001:0233c12_1"
    },
    {
        "source_sentence": "爾時家中有一男子謂比丘言：「可前大德共作如是事來。」",
        "translation": "At the time, there was a man at home who said to the monk, Let's go along with the previous great virtuous one and do this kind of work.",
        "source": "T22n1425_001:0233c13_2"
    },
    {
        "source_sentence": "比丘答言：「世尊制戒不得行婬。」",
        "translation": "The monk answered, Bhagavān, the Bhagavān prescribes that you mustn't practice sexual misconduct.",
        "source": "T22n1425_001:0233c15_3"
    },
    {
        "source_sentence": "彼言：「我知制戒，不得與女人行婬，而我是男子。」",
        "translation": "They said, I know the precept against sexual misconduct with women, but I'm a man.",
        "source": "T22n1425_001:0233c15_4"
    },
    {
        "source_sentence": "是比丘便隨彼意。",
        "translation": "That monk then followed their wishes.",
        "source": "T22n1425_001:0233c17_0"
    },
    {
        "source_sentence": "隨彼意已尋生疑悔，具白世尊。",
        "translation": "Having investigated them according to their wishes, they had doubts and repented, and they told the Bhagavān in detail.",
        "source": "T22n1425_001:0233c17_1"
    },
    {
        "source_sentence": "佛告比丘：「汝不知佛制戒不得行婬耶？」",
        "translation": "The Buddha told the monk, Don't you know that the Buddha precept forbids you to practice sexual misconduct?",
        "source": "T22n1425_001:0233c18_2"
    },
    {
        "source_sentence": "「世尊我知制戒，自謂不得與女人行婬，不謂男子。」",
        "translation": "Bhagavān, I know the precepts and tell myself that I won't engage in sexual misconduct with women, not men.",
        "source": "T22n1425_001:0233c19_3"
    },
    {
        "source_sentence": "佛言：「比丘、男子亦犯波羅夷。」",
        "translation": "The Buddha said, Monks and men also violate the pārājika.",
        "source": "T22n1425_001:0233c20_4"
    },
    {
        "source_sentence": "復次佛住舍衛城，廣說如上。",
        "translation": "Furthermore, the Buddha stayed in Śrāvastī and explained it in detail as above.",
        "source": "T22n1425_001:0233c21_0"
    },
    {
        "source_sentence": "有一比丘，時到著入聚落衣持鉢入城，次行乞食至一家。",
        "translation": "When a monk arrived, he put on his robes, entered the village, took his bowl into the city, and went to one house to solicit alms.",
        "source": "T22n1425_001:0233c21_1"
    },
    {
        "source_sentence": "有一黃門謂比丘言：「可前大德共作如是事來。」",
        "translation": "There was a yellow monk who said to the monk, Come here, you may have done this kind of work together with the previous great virtuous one.",
        "source": "T22n1425_001:0233c23_0"
    },
    {
        "source_sentence": "比丘言：「世尊制戒不得行婬。」",
        "translation": "The monks said, Bhagavān, the Bhagavān prescribes that you mustn't practice sexual misconduct.",
        "source": "T22n1425_001:0233c24_1"
    },
    {
        "source_sentence": "彼言：「我知制戒，不得與男女行婬，我非男非女。」",
        "translation": "They said, I know the precept against sexual misconduct with men and women, but I'm neither a man nor a woman.",
        "source": "T22n1425_001:0233c24_2"
    },
    {
        "source_sentence": "是比丘便隨彼意。",
        "translation": "That monk then followed their wishes.",
        "source": "T22n1425_001:0233c25_3"
    },
    {
        "source_sentence": "隨彼意已即生疑悔，具白世尊。",
        "translation": "After following their thoughts, they immediately had doubts and regrets and reported them to the Bhagavān.",
        "source": "T22n1425_001:0233c26_4"
    },
    {
        "source_sentence": "佛告比丘：「汝不知佛制戒不得行婬耶？」",
        "translation": "The Buddha told the monk, Don't you know that the Buddha precept forbids you to practice sexual misconduct?",
        "source": "T22n1425_001:0233c26_5"
    },
    {
        "source_sentence": "「世尊我知制戒，自謂不得與男女行婬，今此黃門非男非女。」",
        "translation": "Bhagavān, I know the restraints of the precepts and say that I won't engage in sexual misconduct with men or women, but now this yellow monk is neither a man nor a woman.",
        "source": "T22n1425_001:0233c27_6"
    },
    {
        "source_sentence": "佛言：「比丘婬黃門亦犯波羅夷。」",
        "translation": "The Buddha said, A monk who deceives the yellow gate also commits pārājika.",
        "source": "T22n1425_001:0233c29_7"
    },
    {
        "source_sentence": "佛言：「比丘三處犯波羅夷。",
        "translation": "The Buddha said, A monk commits a pārājika in three places.",
        "source": "T22n1425_001:0233c29_8"
    },
    {
        "source_sentence": "何等三？",
        "translation": "What are these three?",
        "source": "T22n1425_001:0234a01_9"
    },
    {
        "source_sentence": "男、女、黃門是為三。」",
        "translation": "Men, women, and the yellow gate are three.",
        "source": "T22n1425_001:0234a01_10"
    },
    {
        "source_sentence": "復次佛住毘舍離，廣說如上。",
        "translation": "Furthermore, the Buddha abides in Vaiśālī: as has been said elaborately above.",
        "source": "T22n1425_001:0234a03_0"
    },
    {
        "source_sentence": "時有一比丘，時至著入聚落衣持鉢入城，次行乞食至一家。",
        "translation": "When a monk arrived, he put on his robe and entered the village, took his bowl into the city, and went to one house to solicit alms.",
        "source": "T22n1425_001:0234a03_1"
    },
    {
        "source_sentence": "有一女人語比丘言：「可前大德共作如是事來。」",
        "translation": "A woman said to the monk, Let's go along with the previous great virtuous one who did such a thing.",
        "source": "T22n1425_001:0234a05_0"
    },
    {
        "source_sentence": "比丘答言：「世尊制戒不得行婬。」",
        "translation": "The monk answered, Bhagavān, the Bhagavān prescribes that you mustn't practice sexual misconduct.",
        "source": "T22n1425_001:0234a06_1"
    },
    {
        "source_sentence": "女言：「我知不得，汝可裹身我便露形。」",
        "translation": "The woman said, I know you can't; wrap it around me and I'll reveal my form.",
        "source": "T22n1425_001:0234a06_2"
    },
    {
        "source_sentence": "是比丘便隨彼意。",
        "translation": "That monk then followed their wishes.",
        "source": "T22n1425_001:0234a07_3"
    },
    {
        "source_sentence": "隨彼意已即生疑悔，具白世尊，佛告比丘：「汝不知佛制戒不得行婬耶？」",
        "translation": "After following their thoughts, they immediately became doubtful and repented and reported to the Bhagavān, and the Buddha told the monk, Don't you know that the Buddha precepts prevent you from practicing sexual misconduct?",
        "source": "T22n1425_001:0234a08_0"
    },
    {
        "source_sentence": "「世尊我知制戒，但我裹身彼則露形。」",
        "translation": "Bhagavān, I know the precepts, but when I wrap my body around them, they reveal their form.",
        "source": "T22n1425_001:0234a09_1"
    },
    {
        "source_sentence": "佛告比丘：「裹身、露形亦犯波羅夷。」",
        "translation": "The Buddha told the monk, It's also a violation to wrap one's body or expose one's form in pārājika.",
        "source": "T22n1425_001:0234a10_2"
    },
    {
        "source_sentence": "復次佛住毘舍離，廣說如上。",
        "translation": "Furthermore, the Buddha abides in Vaiśālī: as has been said elaborately above.",
        "source": "T22n1425_001:0234a12_0"
    },
    {
        "source_sentence": "有一比丘，時至著入聚落衣持鉢入城，次行乞食至一家。",
        "translation": "When a monk arrived, he put on his robes, entered the village, took his bowl into the city, and went to one house to solicit alms.",
        "source": "T22n1425_001:0234a12_1"
    },
    {
        "source_sentence": "時有一女人語比丘言：「可入大德共作此事。」",
        "translation": "A woman then said to the monk, You may enter this place and work together with the great virtuous one.",
        "source": "T22n1425_001:0234a13_2"
    },
    {
        "source_sentence": "比丘答言：「世尊制戒不得行婬。」",
        "translation": "The monk answered, Bhagavān, the Bhagavān prescribes that you mustn't practice sexual misconduct.",
        "source": "T22n1425_001:0234a14_3"
    },
    {
        "source_sentence": "女言：「我知，汝但露形我自覆身。」",
        "translation": "The woman said, I know that you've only revealed my form to cover your own body.",
        "source": "T22n1425_001:0234a15_4"
    },
    {
        "source_sentence": "比丘便隨彼意。",
        "translation": "The monk then followed their wishes.",
        "source": "T22n1425_001:0234a16_5"
    },
    {
        "source_sentence": "隨彼意已尋生疑悔，具白世尊。",
        "translation": "Having investigated them according to their wishes, they had doubts and repented, and they told the Bhagavān in detail.",
        "source": "T22n1425_001:0234a16_6"
    },
    {
        "source_sentence": "佛告比丘：「汝不知佛制戒不得行婬耶？」",
        "translation": "The Buddha told the monk, Don't you know that the Buddha precept forbids you to practice sexual misconduct?",
        "source": "T22n1425_001:0234a17_7"
    },
    {
        "source_sentence": "「世尊我知制戒，但彼覆身我露形。」",
        "translation": "Bhagavān, I know the precepts, but they cover my body and reveal my form.",
        "source": "T22n1425_001:0234a18_8"
    },
    {
        "source_sentence": "佛言：「彼覆汝露，亦犯波羅夷。",
        "translation": "The Buddha said, They cover up your exposedness and also violate the pārājika.",
        "source": "T22n1425_001:0234a19_9"
    },
    {
        "source_sentence": "乃至齊如胡麻，亦犯波羅夷」復次佛住舍衛城，廣說如上。",
        "translation": "Even if it's equal to sesame, it's also a violation of pārājika. Furthermore, the Buddha lives in Śrāvastī and explains it as above.",
        "source": "T22n1425_001:0234a19_10"
    },
    {
        "source_sentence": "爾時有比丘從異方來，身生長大自於後道行欲。",
        "translation": "At the time, there was a monk from another place who grew up with a large body and desired to follow the latter path.",
        "source": "T22n1425_001:0234a21_11"
    },
    {
        "source_sentence": "行欲已然後疑悔，具白世尊，佛告比丘：「汝不知佛制戒不得行婬耶？」",
        "translation": "After he had done so, he doubted and repented, reported it to the Bhagavān, and the Buddha told the monk, Don't you know that the Buddha precepts prevent you from practicing sexual misconduct?",
        "source": "T22n1425_001:0234a22_12"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T22n1425_001:0234a24_13"
    },
    {
        "source_sentence": "我知制戒，謂為制他，不謂自己。」",
        "translation": "I know the precepts, which are to restrain others and not myself.",
        "source": "T22n1425_001:0234a24_14"
    },
    {
        "source_sentence": "佛言：「於自己行欲，亦犯波羅夷。」",
        "translation": "The Buddha said, They'll also violate the pārājika in their own acts of desire.",
        "source": "T22n1425_001:0234a25_15"
    },
    {
        "source_sentence": "復次佛住舍衛城，廣說如上。",
        "translation": "Furthermore, the Buddha stayed in Śrāvastī and explained it in detail as above.",
        "source": "T22n1425_001:0234a26_0"
    },
    {
        "source_sentence": "有一比丘從南方來，先是伎兒，支節調柔婬欲熾盛，便於自口中行婬。",
        "translation": "A certain monk came from the south. Formerly he was a youthful boy but his licentious limbs were unable to be tamed and his sexual desires became so strong that he indulged in sexual misconduct within his mouth.",
        "source": "T22n1425_001:0234a26_1"
    },
    {
        "source_sentence": "行婬已即生疑悔，具白世尊，佛告比丘：「汝不知佛制戒不得行婬耶？」",
        "translation": "After practicing sexual misconduct, he immediately became doubtful and repented and reported it to the Bhagavān, and the Buddha told the monk, Don't you know that the Buddha precepts prevent you from practicing sexual misconduct?",
        "source": "T22n1425_001:0234a28_2"
    },
    {
        "source_sentence": "「世尊！",
        "translation": "Bhagavān!",
        "source": "T22n1425_001:0234a29_3"
    },
    {
        "source_sentence": "我知制戒，非謂自口。」",
        "translation": "I know the precepts and don't call them my own words.",
        "source": "T22n1425_001:0234b01_0"
    },
    {
        "source_sentence": "佛言：「自口亦犯波羅夷。",
        "translation": "The Buddha said, Self-mouthing is also a violation of pārājika.",
        "source": "T22n1425_001:0234b01_1"
    },
    {
        "source_sentence": "比丘於三處行婬：口、大、小便道，盡犯波羅夷。」",
        "translation": "A monk who engages in sexual misconduct in three places: his mouth, the large, and the urinating stool are all violations of the pārājika.",
        "source": "T22n1425_001:0234b02_0"
    },
    {
        "source_sentence": "復次佛住王舍城，廣說如上。",
        "translation": "Furthermore, the Buddha stayed in Rājagṛha and explained it in detail as above.",
        "source": "T22n1425_001:0234b03_0"
    },
    {
        "source_sentence": "有一比丘，時到著入聚落衣持鉢，次行乞食到一婬女家。",
        "translation": "When a monk arrived, he put on his robes, entered the village, carried his bowl, and went to a house of a promiscuous woman to solicit alms.",
        "source": "T22n1425_001:0234b03_1"
    },
    {
        "source_sentence": "婬女語比丘言：「大德可前共作是事。」",
        "translation": "The promiscuous woman said to the monk, Mañjuśrī, you may do this for me.",
        "source": "T22n1425_001:0234b04_2"
    },
    {
        "source_sentence": "比丘言：「世尊制戒不得行婬。」",
        "translation": "The monks said, Bhagavān, the Bhagavān prescribes that you mustn't practice sexual misconduct.",
        "source": "T22n1425_001:0234b05_3"
    },
    {
        "source_sentence": "女人答言：「我亦知不得行婬，但身內行欲、外出不淨。」",
        "translation": "The woman replied, I also know that I can't engage in sexual misconduct, but my internal desires and external desires are impure.",
        "source": "T22n1425_001:0234b06_4"
    },
    {
        "source_sentence": "比丘便隨彼意。",
        "translation": "The monk then followed their wishes.",
        "source": "T22n1425_001:0234b07_5"
    },
    {
        "source_sentence": "隨彼意已心生疑悔，具白世尊，佛告比丘：「汝不知我制戒不得行婬耶？」",
        "translation": "Following that thought, he became doubtful and repented, reported it to the Bhagavān, and the Buddha told the monk, Don't you know that my precept forbids me from sexual misconduct?",
        "source": "T22n1425_001:0234b07_6"
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "He replied, Bhagavān!",
        "source": "T22n1425_001:0234b09_7"
    },
    {
        "source_sentence": "我知制戒，但身內行婬、外出不淨。」",
        "translation": "I know the precepts, but my internal actions are crude and impure, and my external actions are unclean.",
        "source": "T22n1425_001:0234b09_8"
    },
    {
        "source_sentence": "佛言：「內行於欲、外出不淨，外行於欲、內出不淨，乃至齊如胡麻，亦犯波羅夷」復次佛住王舍城，廣說如上。",
        "translation": "The Buddha said, If someone's internal actions are purified by desire and outside action, and their external actions are purified by desire and outside action, they'll also violate the pārājika, even up to the point where they're like sesame. Furthermore, the Buddha stayed in Rājagṛha and explained it in detail as above.",
        "source": "T22n1425_001:0234b10_9"
    },
    {
        "source_sentence": "時北方有諸商客，從遠方來到，作是思惟：「我從彼來安隱至此，不逢賊難宜應自慶。」",
        "translation": "Some merchants in the north then came from a distant place and thought, I've come from that place to stay here safely, so I won't meet thieves; it's not appropriate for me to congratulate myself.",
        "source": "T22n1425_001:0234b13_10"
    },
    {
        "source_sentence": "便辦種種飲食，集諸伎樂欲自娛樂。",
        "translation": "He then prepared various foods and drinks, gathered all kinds of tricks and music, and wanted to entertain himself.",
        "source": "T22n1425_001:0234b15_11"
    },
    {
        "source_sentence": "爾時王舍城中有五百婬女共在一處，時商人遣信喚彼最勝第一婬女言：「汝來娛樂我等。」",
        "translation": "It was then that five hundred nymphlike women were in the city of Rājagṛha together at one place, and the merchant sent a letter to summon the most superior nymphlike woman, saying, Come and entertain us.",
        "source": "T22n1425_001:0234b16_12"
    },
    {
        "source_sentence": "婬女答言：「我先與王期夜輒往宿，君若見喚晝當相詣。」",
        "translation": "The promiscuous woman replied, I'll go to sleep with the king early in the night; if you see him and call him, they'll come together during the day.",
        "source": "T22n1425_001:0234b18_13"
    },
    {
        "source_sentence": "商人忿言：「無知弊物！",
        "translation": "The merchant angrily said, Don't know the bad things!",
        "source": "T22n1425_001:0234b19_14"
    },
    {
        "source_sentence": "汝常到王所為何所得？",
        "translation": "What did you always get when you went to the king's place?",
        "source": "T22n1425_001:0234b20_15"
    },
    {
        "source_sentence": "汝今若來娛樂我等，我等當多與汝種種寶物。」",
        "translation": "Now, if you come to entertain us, we'll give you a lot of various treasures.",
        "source": "T22n1425_001:0234b20_16"
    },
    {
        "source_sentence": "時婬女貪寶物故即許商人，便詐莊嚴一端正婢遣令詣王，便勅婢言：「汝詣王所善作方便如我形相，莫令王覺知非我身。」",
        "translation": "The promiscuous woman then craved the treasure and gave it to the merchant, so she fraudulently adorned a correct maidservant and sent her to the king, who then instructed the maidservant, You must go to the king's place and skillfully create an appearance like mine for him, so that he won't realize that it's not my body.",
        "source": "T22n1425_001:0234b21_17"
    },
    {
        "source_sentence": "時王沐浴莊嚴待彼婬女，遲想其至須臾便到。",
        "translation": "The king then bathed in adornment and waited for the promiscuous woman, who arrived as soon as he thought of her arrival.",
        "source": "T22n1425_001:0234b24_18"
    },
    {
        "source_sentence": "王遙見婢來便知其非，即逆罵言：「汝是何人而來至此？」",
        "translation": "Seeing the maidservant coming from a distance, the king knew what was wrong and rebuked him, saying, Who are you who came here?",
        "source": "T22n1425_001:0234b25_19"
    },
    {
        "source_sentence": "婢時惶怖以實白王：「北方商人持寶遠至，大持寶物與我大家。",
        "translation": "The maid was frightened and reported to the king in truth, saying, “There are merchants from the north who have come from a distant land holding treasures.",
        "source": "T22n1425_001:0234b26_20"
    },
    {
        "source_sentence": "大家利其財重，故遣我來以副先期，冀王不覺。」",
        "translation": "The people wanted to benefit their wealth, so they sent me here to replace the prior appointment, hoping that the king wouldn't perceive it.",
        "source": "T22n1425_001:0234b28_21"
    },
    {
        "source_sentence": "王聞婢言即大瞋罵：「何弊女人敢見輕欺。」",
        "translation": "When the king heard the maidservant's words, he became angry and scolded her, What a bad woman would dare to deceive me?",
        "source": "T22n1425_001:0234b29_22"
    },
    {
        "source_sentence": "即遣使者割去女形。",
        "translation": "He then sent an envoy to cut off the woman's form.",
        "source": "T22n1425_001:0234c01_23"
    },
    {
        "source_sentence": "時商人等遙見使來，知王所遣即便奔走。",
        "translation": "When the merchants and others saw the messenger coming from a distance, they knew what the king sent and ran away.",
        "source": "T22n1425_001:0234c01_24"
    },
    {
        "source_sentence": "使者即捉婬女割去女形，王使既返。",
        "translation": "The messenger then grabbed the promiscuous woman and cut off her female form, and the king's messenger returned.",
        "source": "T22n1425_001:0234c02_25"
    },
    {
        "source_sentence": "商人即還見婬女如此心各憐念，重賞良醫以治其患，此醫多方瘡遂平復。",
        "translation": "The merchants then returned to see the promiscuous woman with such compassion, and they each praised a good doctor to treat her illness, and this doctor's sores in many ways were healed.",
        "source": "T22n1425_001:0234c03_26"
    },
    {
        "source_sentence": "時尊者優波離，因此婬女知時而問：「世尊！",
        "translation": "Venerable Upāli then knew the time and asked, Bhagavān!",
        "source": "T22n1425_001:0234c05_27"
    },
    {
        "source_sentence": "若有人割去其形，若有比丘於壞形中行婬，犯波羅夷罪不？」",
        "translation": "If someone cuts off their form, and if a monk commits sexual misconduct in a broken form, does he commit the sin of pārājika?",
        "source": "T22n1425_001:0234c06_0"
    },
    {
        "source_sentence": "佛言：「波羅夷。」",
        "translation": "The Buddha said, Pārājika.",
        "source": "T22n1425_001:0234c07_1"
    },
    {
        "source_sentence": "又復問言：「世尊！",
        "translation": "Again, he asked, Bhagavān!",
        "source": "T22n1425_001:0234c07_2"
    },
    {
        "source_sentence": "若形離其身，就此離形行婬，波羅夷不？」",
        "translation": "If form is separated from his body, and he's free of form and engages in sexual misconduct here, is that a pārājika?",
        "source": "T22n1425_001:0234c08_3"
    },
    {
        "source_sentence": "佛言：「得偷蘭罪。」",
        "translation": "The Buddha said, You've committed the sin of stealing a forest.",
        "source": "T22n1425_001:0234c09_0"
    },
    {
        "source_sentence": "又復問言：「世尊！",
        "translation": "Again, he asked, Bhagavān!",
        "source": "T22n1425_001:0234c09_1"
    },
    {
        "source_sentence": "此形還合瘡未愈於中行婬，犯波羅夷不？」",
        "translation": "Is this form still combined with the sores that aren't healed, and is it a violation of pārājika if he walks around in them?",
        "source": "T22n1425_001:0234c09_2"
    },
    {
        "source_sentence": "佛言：「波羅夷。」",
        "translation": "The Buddha said, Pārājika.",
        "source": "T22n1425_001:0234c10_3"
    },
    {
        "source_sentence": "復次佛住王舍城，廣說如上。",
        "translation": "Furthermore, the Buddha stayed in Rājagṛha and explained it in detail as above.",
        "source": "T22n1425_001:0234c11_0"
    },
    {
        "source_sentence": "時阿闍世王生一童子，字優陀夷跋陀羅。",
        "translation": "The king of Ajātaśatru then gave birth to a boy named Udayana Bhadra.",
        "source": "T22n1425_001:0234c11_1"
    },
    {
        "source_sentence": "此兒陰為虫所食，以種種藥治不能令差。",
        "translation": "This child's aggregate is eaten by an insect, and it can't be healed with various medicines that won't make it so.",
        "source": "T22n1425_001:0234c12_2"
    },
    {
        "source_sentence": "見兒患此瘡故，時抱養者常以口含其陰，暖氣噓之其痛小差。",
        "translation": "When he saw that his child was suffering from this sores, the embracer always contained their aggregates in his mouth, and warm air exclaimed to him with a small difference in pain.",
        "source": "T22n1425_001:0234c13_3"
    },
    {
        "source_sentence": "數數含之不止，彼得暖氣便失不淨，失不淨時虫便隨精而出。",
        "translation": "When they don't stop containing it again and again, Peter's warm air loses its impurity, and when he loses his impurity, the worm goes along with his semen and comes out.",
        "source": "T22n1425_001:0234c15_0"
    },
    {
        "source_sentence": "此兒於是得差苦痛除愈，從是已後常習此法。",
        "translation": "The boy was cured of his pain and healed, and from then on he always practiced this method.",
        "source": "T22n1425_001:0234c16_1"
    },
    {
        "source_sentence": "口中行婬如是轉久，乃至強牽餘母人於口中行婬。",
        "translation": "He walks around in his mouth like this for a long time, until he forcibly pulls another mother into his mouth and walks around.",
        "source": "T22n1425_001:0234c17_2"
    },
    {
        "source_sentence": "其兒有婦即作是念：「彼習此不已當復及我，宜豫作方便止此惡法。」",
        "translation": "The child's wife then thought, They won't stop cultivating this, and they'll be like me again; it's better to prepare a way to stop this bad thing.",
        "source": "T22n1425_001:0234c18_3"
    },
    {
        "source_sentence": "於是脫衣裹面露其形體，往詣姑所禮拜問訊。",
        "translation": "He then took off his robe, wrapped it around his face and revealed his body, went to his aunt, paid homage, and greeted her.",
        "source": "T22n1425_001:0234c20_4"
    },
    {
        "source_sentence": "時姑呵言：「汝癡狂耶？",
        "translation": "The aunt then rebuked him, saying, Are you crazy?",
        "source": "T22n1425_001:0234c21_5"
    },
    {
        "source_sentence": "何得如是？」",
        "translation": "How could it be like this?",
        "source": "T22n1425_001:0234c21_6"
    },
    {
        "source_sentence": "答言：「不狂，但大家子捨於常道而用其口，是故覆之。」",
        "translation": "He replied, Not crazy, but the layman abandons the eternal path and uses his mouth; therefore, he covers it.",
        "source": "T22n1425_001:0234c22_0"
    },
    {
        "source_sentence": "即向其姑具說上事。",
        "translation": "He then explained the above matter to his aunt.",
        "source": "T22n1425_001:0234c23_1"
    },
    {
        "source_sentence": "爾時宮內展轉相語，乃至外舍盡共聞知，多共為此口中行欲。",
        "translation": "At that point, they'll talk to each other inside the palace and throughout the outer dwelling as many of them will hear and know, and they'll often have sexual desires in their mouth for this.",
        "source": "T22n1425_001:0234c23_2"
    },
    {
        "source_sentence": "時王舍城婆羅門居士，詣阿闍世王所白言：「大王！",
        "translation": "The Brāhmaṇa householder of Rājagṛha then went to King Ajātaśatru and said, Great king!",
        "source": "T22n1425_001:0234c25_3"
    },
    {
        "source_sentence": "國中有此惡法流行，云何口中是飲食處而行不淨？」",
        "translation": "If this bad dharma is prevalent in the country, how can it be that food and drink are placed in my mouth and I'm walking impurely?",
        "source": "T22n1425_001:0234c26_4"
    },
    {
        "source_sentence": "王聞此言甚用不可，即作教令：「從今已去若有作此及教他者，當重治其罪。」",
        "translation": "When the king heard these words, he didn't use them very much, so he made an instruction, From now on, if someone does this or teaches others to do it, they'll be punished again for their sins.",
        "source": "T22n1425_001:0234c27_5"
    },
    {
        "source_sentence": "爾時尊者優波離知時而問：「世尊！",
        "translation": "Knowing the time, Venerable Upāli asked, Bhagavān!",
        "source": "T22n1425_001:0234c29_0"
    },
    {
        "source_sentence": "若比丘比丘共口中行婬者，犯波羅夷不？」",
        "translation": "If monks and monks engage in sexual misconduct together in their mouths, is it a violation of the pārājika?",
        "source": "T22n1425_001:0234c29_1"
    },
    {
        "source_sentence": "佛言：「俱波羅夷。」",
        "translation": "The Buddha said, Kauṇḍinya.",
        "source": "T22n1425_001:0235a01_2"
    },
    {
        "source_sentence": "又復白佛言：「世尊！",
        "translation": "Again, he said to the Buddha, Bhagavān!",
        "source": "T22n1425_001:0235a02_3"
    },
    {
        "source_sentence": "比丘與沙彌共口中行婬，犯波羅夷不？」",
        "translation": "Does a monk who engages in verbal sexual misconduct with a novice violate the pārājika?",
        "source": "T22n1425_001:0235a02_4"
    },
    {
        "source_sentence": "佛言：「比丘波羅夷，沙彌驅出。」",
        "translation": "The Buddha said, Bhikṣu Pārājika, the novice expelled him.",
        "source": "T22n1425_001:0235a03_5"
    },
    {
        "source_sentence": "又復白言：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T22n1425_001:0235a04_6"
    },
    {
        "source_sentence": "比丘與白衣共口中行婬云何？」",
        "translation": "What's the monk and the white-robed man doing sexual misconduct together in their mouths?",
        "source": "T22n1425_001:0235a04_7"
    },
    {
        "source_sentence": "佛言：「比丘波羅夷，白衣知如之何。」",
        "translation": "The Buddha said, Bhikṣu Paranirmita-vaśavartin, the white man knows what he's like.",
        "source": "T22n1425_001:0235a05_8"
    },
    {
        "source_sentence": "又白：「世尊！",
        "translation": "Again, he said, Bhagavān!",
        "source": "T22n1425_001:0235a05_9"
    },
    {
        "source_sentence": "比丘、比丘尼共口中行婬，犯波羅夷不？」",
        "translation": "Is it a violation of the pārājika if monks and nuns engage in sexual misconduct with each other in their mouths?",
        "source": "T22n1425_001:0235a06_10"
    },
    {
        "source_sentence": "佛言：「俱波羅夷。」",
        "translation": "The Buddha said, Kauṇḍinya.",
        "source": "T22n1425_001:0235a07_11"
    },
    {
        "source_sentence": "乃至「外道出家、比丘共口中行婬云何？」",
        "translation": "It goes so far as to say, What's the argument between a non-Buddhist renunciant and a monk who practices together in his mouth?",
        "source": "T22n1425_001:0235a07_12"
    },
    {
        "source_sentence": "佛言：「比丘波羅夷，外道知如之何。」",
        "translation": "The Buddha said, Bhikṣu Paranirmita-vaśavartin, what do non-Buddhists know?",
        "source": "T22n1425_001:0235a08_13"
    },
    {
        "source_sentence": "摩訶僧祇律卷第一",
        "translation": "Mahāsāṃghika-vinaya, Volume 1",
        "source": "T22n1425_001:0235a10_0"
    }
]