[
    {
        "source_sentence": "四分律卷第十一(初分之十一)",
        "translation": "Sifen lü, vol. 11 (first part of the eleventh)",
        "source": "T22n1428_011:0634a04_0"
    },
    {
        "source_sentence": "姚秦罽賓三藏佛陀耶舍",
        "translation": "Yaoqin's Kāśmī-samādhi of the Tripiṭaka Buddhayaśas",
        "source": "T22n1428_011:0634a06_0"
    },
    {
        "source_sentence": "共竺佛念等譯",
        "translation": "translated by Zhu Fone and others",
        "source": "T22n1428_011:0634a07_0"
    },
    {
        "source_sentence": "九十單提法之一",
        "translation": "one of the ninety monastic rules",
        "source": "T22n1428_011:0634a08_0"
    },
    {
        "source_sentence": "爾時佛在釋翅瘦迦維羅衛尼拘類園中。",
        "translation": "It was then that the Buddha was staying at the Śākyamuni's retreat in Kapilavastu, Kapilavastu, and Kapilavastu.",
        "source": "T22n1428_011:0634a09_0"
    },
    {
        "source_sentence": "爾時釋種中有釋迦子，字象力，善能談論，常與外道梵志論議，若不如時便違反前語，",
        "translation": "At the time, there was a disciple of the Śākyas in the Śākya clan, named Elephant Power, who was good at talking and often argued with heretics and brahmins. If he didn't, then he would have violated what he had said before.",
        "source": "T22n1428_011:0634a10_0"
    },
    {
        "source_sentence": "若僧中問是語時，即復違反前語，於眾中知而妄語。",
        "translation": "When the saṃgha asks this question, they'll again violate the previous statement and knowingly speak falsely in the midst of the crowd.",
        "source": "T22n1428_011:0634a12_1"
    },
    {
        "source_sentence": "諸梵志等譏嫌言：「沙門釋子無有慚愧常作妄語，而自稱言：『我行正法。』",
        "translation": "The priests and others criticized him, saying, An ascetic or a son of the Śākyamuni has no shame for always speaking falsely, yet he claims to say, 'I'm practicing the right teaching.'",
        "source": "T22n1428_011:0634a13_2"
    },
    {
        "source_sentence": "如今有何正法？",
        "translation": "What's the right teaching now?",
        "source": "T22n1428_011:0634a15_0"
    },
    {
        "source_sentence": "論議不如時便違反前語，於眾僧中問時復違反前語，於眾中知而妄語。」",
        "translation": "When the discussion doesn't go along, they then violate the prior statement; when asked by the saṃgha, they also violate the prior statement; and knowing it in the crowd, they speak falsely.",
        "source": "T22n1428_011:0634a15_1"
    },
    {
        "source_sentence": "諸比丘聞，其中有少欲知足、行頭陀、樂學戒、知慚愧者，呵責象力釋子：「汝云何與梵志共論議，",
        "translation": "When the monks heard this, some of them who had few desires and were satisfied, practiced asceticism, enjoyed studying the precepts, and knew shamefulness rebuked the elephant-powered Śāriputra, saying, “How are you discussing with the brahmin?",
        "source": "T22n1428_011:0634a17_2"
    },
    {
        "source_sentence": "設不如時便自違反前語，於眾僧中問即復違反前語，於眾僧中知而妄語耶？」",
        "translation": "If he doesn't do so, then he himself violates the previous statement and asks questions among the saṃgha, which also violates the previous statement, and speaks falsely when he knows it among the saṃgha?",
        "source": "T22n1428_011:0634a19_3"
    },
    {
        "source_sentence": "時諸比丘往世尊所，頭面禮足在一面坐，以此因緣具白世尊。",
        "translation": "The monks then went to the Bhagavān, bowed their heads and feet, and sat at one side. They reported this story to the Bhagavān.",
        "source": "T22n1428_011:0634a21_4"
    },
    {
        "source_sentence": "世尊爾時以此因緣集比丘僧，呵責象力比丘：「汝所為非，非威儀、非沙門法、非淨行、非隨順行，",
        "translation": "The Bhagavān then gathered the monks for this reason and reprimanded the elephant-powered monk, What you're doing is wrong, isn't dignified, isn't according to the ascetic teachings, isn't pure practice, isn't compliant practice,",
        "source": "T22n1428_011:0634a22_5"
    },
    {
        "source_sentence": "所不應為。",
        "translation": "What shouldn't be done?",
        "source": "T22n1428_011:0634a25_6"
    },
    {
        "source_sentence": "云何象力比丘！",
        "translation": "What, monks of elephant power!",
        "source": "T22n1428_011:0634a25_7"
    },
    {
        "source_sentence": "與梵志共論議，設不如時便違反前語，於眾僧中問即復違反前語，於眾中知而妄語耶？」",
        "translation": "When he had a discussion with the priest, if he didn't do so, then he violated the previous statement and asked questions among the saṃgha, which also violated the previous statement, knowing it in the crowd but speaking falsely?",
        "source": "T22n1428_011:0634a25_8"
    },
    {
        "source_sentence": "爾時世尊無數方便呵責象力比丘已，告諸比丘：「此癡人！",
        "translation": "After the Bhagavān had reprimanded the elephant-powered monk with countless skillful means, he addressed the monks, This foolish man!",
        "source": "T22n1428_011:0634a27_9"
    },
    {
        "source_sentence": "多種有漏處，最初犯戒。",
        "translation": "There are many kinds of contaminated places where they first violate the precepts.",
        "source": "T22n1428_011:0634a29_10"
    },
    {
        "source_sentence": "自今已去與比丘結戒，集十句義乃至正法久住，欲說戒者當如是說：若比丘知而妄語者，",
        "translation": "Those who wish to preach the precepts should explain them in this way: “If a monk knows and speaks falsely,",
        "source": "T22n1428_011:0634a29_11"
    },
    {
        "source_sentence": "波逸提。」",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0634b02_12"
    },
    {
        "source_sentence": "比丘義如上。",
        "translation": "The meaning of monk is as above.",
        "source": "T22n1428_011:0634b02_13"
    },
    {
        "source_sentence": "知而妄語者，不見言見、不聞言聞，不觸言觸、不知言知，見言不見、聞言不聞，",
        "translation": "Someone who knows but speaks falsely doesn’t see words, doesn’t hear words and don’t hear words, doesn’t touch words that are touched, doesn’t know words that are known, sees words that aren’t seen, hears words that aren’t heard.",
        "source": "T22n1428_011:0634b03_14"
    },
    {
        "source_sentence": "觸言不觸、知言不知。",
        "translation": "What's touched is called not touched, and what's known is called not known.",
        "source": "T22n1428_011:0634b05_0"
    },
    {
        "source_sentence": "見者，眼識能見。",
        "translation": "Seeing means that the eye consciousness is able to see.",
        "source": "T22n1428_011:0634b05_1"
    },
    {
        "source_sentence": "聞者，耳識能聞。",
        "translation": "“Hearing”: The consciousness of the ear is able to hear.",
        "source": "T22n1428_011:0634b05_2"
    },
    {
        "source_sentence": "觸者，三識能觸，鼻識、舌識、身識。",
        "translation": "“ touches”: Three forms of consciousness can touch: the consciousness of the nose, the consciousness of the tongue and the consciousness of the body.",
        "source": "T22n1428_011:0634b06_3"
    },
    {
        "source_sentence": "知者，意識能知。",
        "translation": "Knowing is what the thinking consciousness can know.",
        "source": "T22n1428_011:0634b06_4"
    },
    {
        "source_sentence": "不見者，除眼識，餘五識是。",
        "translation": "Not seeing: exception made for the consciousness of the eye. The other five forms of consciousness are this.",
        "source": "T22n1428_011:0634b07_5"
    },
    {
        "source_sentence": "不聞者，除耳識，餘五識是。",
        "translation": "exception made for the consciousness of the ear. The other five forms of consciousness are this.",
        "source": "T22n1428_011:0634b07_6"
    },
    {
        "source_sentence": "不觸者，除三識，餘眼識、耳識、意識是。",
        "translation": "“Not touching”: Exception made for three consciousnesses, the other conscious construction of the eye, the conscious construction of the ear and the consciousness of the mind are.",
        "source": "T22n1428_011:0634b08_7"
    },
    {
        "source_sentence": "不知者，除意識，餘五識是。",
        "translation": "Not knowing: exception made for consciousness of the mind and the other five forms of consciousness.",
        "source": "T22n1428_011:0634b09_8"
    },
    {
        "source_sentence": "若不見、不聞、不觸、不知，彼如是言：「我見聞觸知。」",
        "translation": "If they don't see, don't hear, don't touch, and don't know, they thus say, I see, hear, touch, and know.",
        "source": "T22n1428_011:0634b10_0"
    },
    {
        "source_sentence": "知而妄語者，波逸提。",
        "translation": "Someone who knows but speaks falsely, pratyekabuddha.",
        "source": "T22n1428_011:0634b11_1"
    },
    {
        "source_sentence": "若不見、不聞、不觸、不知，是中見想聞想觸想知想，彼便言：「我不見、不聞、不觸、不知。」",
        "translation": "If someone doesn't see, hear, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch, touch.",
        "source": "T22n1428_011:0634b11_2"
    },
    {
        "source_sentence": "知而妄語者，波逸提。",
        "translation": "Someone who knows but speaks falsely, pratyekabuddha.",
        "source": "T22n1428_011:0634b13_3"
    },
    {
        "source_sentence": "若不見、不聞、不觸、不知，意中生疑，彼作是言：「我無有疑，便言我見、我聞、我觸、我知。」",
        "translation": "If someone doesn't see, doesn't hear, doesn't touch, and doesn't know, and doubt arises in their mind, they say, I have no doubt, so they say I see, hear, touch, and know.",
        "source": "T22n1428_011:0634b13_4"
    },
    {
        "source_sentence": "知而妄語者，波逸提。",
        "translation": "Someone who knows but speaks falsely, pratyekabuddha.",
        "source": "T22n1428_011:0634b15_5"
    },
    {
        "source_sentence": "若不見不聞不觸不知，意中有疑，便言：「我是中無疑，便言我不見不聞不觸不知。」",
        "translation": "If someone doesn't see and doesn't hear, doesn't touch and doesn't know, and has doubt in their mind, they say, There's no doubt in me, and then they say, I don't see and don't hear and don't touch and don't know.",
        "source": "T22n1428_011:0634b16_6"
    },
    {
        "source_sentence": "知而妄語者，波逸提。",
        "translation": "Someone who knows but speaks falsely, pratyekabuddha.",
        "source": "T22n1428_011:0634b18_7"
    },
    {
        "source_sentence": "若不見不聞不觸不知，意中無復疑便言：「我有疑，我見我聞我觸我知。」",
        "translation": "If he doesn't see, doesn't hear, doesn't touch, and doesn't know, then he has no further doubt in his mind and says, I have doubts, and I see me, hear me, touch me, and know me.",
        "source": "T22n1428_011:0634b18_8"
    },
    {
        "source_sentence": "知而妄語者，波逸提。",
        "translation": "Someone who knows but speaks falsely, pratyekabuddha.",
        "source": "T22n1428_011:0634b20_9"
    },
    {
        "source_sentence": "我不見、我不聞、我不觸、我不知，意中無疑，便言：「我有疑，我不見、不聞、不觸、不知。」",
        "translation": "When I don't see, don't hear, don't touch, and don't know, and have no doubt in my mind, I say, 'I have doubt; I don't see, don't hear, don't touch, and don't know.'",
        "source": "T22n1428_011:0634b20_10"
    },
    {
        "source_sentence": "知而妄語者，波逸提。",
        "translation": "Someone who knows but speaks falsely, pratyekabuddha.",
        "source": "T22n1428_011:0634b22_11"
    },
    {
        "source_sentence": "此應廣說，本作是念：「我當妄語。」",
        "translation": "This should be explained in detail, and the original thought is, I will speak falsely.",
        "source": "T22n1428_011:0634b22_12"
    },
    {
        "source_sentence": "妄語時自知是妄語，妄語已知是妄語，故妄語，波逸提。",
        "translation": "When he speaks falsely, he knows for himself that what he speaks is false speech, and after speaking falsely, he knows that what he speaks is false speech; therefore, false speech, pāyattika.",
        "source": "T22n1428_011:0634b23_13"
    },
    {
        "source_sentence": "本作是念：「我當妄語。」",
        "translation": "He originally thought, I'll speak falsely.",
        "source": "T22n1428_011:0634b24_14"
    },
    {
        "source_sentence": "妄語時自知是妄語，妄語竟不自憶作妄語，故妄語，波逸提。",
        "translation": "When he speaks falsely, he knows for himself that it's false speech, and after speaking falsely, he doesn't remember speaking falsely; therefore, speaking falsely, pratyekabuddha.",
        "source": "T22n1428_011:0634b25_15"
    },
    {
        "source_sentence": "本不作是念：「我當妄語。」",
        "translation": "The originally unconstructed thought, I will speak falsely.",
        "source": "T22n1428_011:0634b26_16"
    },
    {
        "source_sentence": "妄語時自知是妄語，妄語竟知是妄語，故妄語，波逸提。",
        "translation": "When he speaks falsely, he knows for himself that it's false speech, and when he speaks falsely, he fully knows that it's false speech; therefore, false speech, pratyekabuddha.",
        "source": "T22n1428_011:0634b27_17"
    },
    {
        "source_sentence": "本不作妄語意，妄語時知是妄語，妄語已不憶是妄語，故妄語，波逸提。",
        "translation": "When he speaks falsely, he knows it to be false speech; after speaking falsely, he doesn't remember that it's false speech; therefore, false speech, pāyattika.",
        "source": "T22n1428_011:0634b28_18"
    },
    {
        "source_sentence": "所見異、所忍異、本所欲異、所觸異、所想異、所心異，如此諸事皆是妄語，",
        "translation": "Such things are all false speech, because they diverge in views, diverge in tolerance, diverge in original desires, diverge in contact, diverge in ideation, and diverge in thought.",
        "source": "T22n1428_011:0634c01_19"
    },
    {
        "source_sentence": "於大眾中知而妄語者，波逸提。",
        "translation": "Someone who knows and speaks falsely among the masses, pratyekabuddha.",
        "source": "T22n1428_011:0634c03_0"
    },
    {
        "source_sentence": "說而了了者，波逸提；",
        "translation": "Someone who speaks but understands, pratyekabuddha.",
        "source": "T22n1428_011:0634c03_1"
    },
    {
        "source_sentence": "說而不了了者，突吉羅。",
        "translation": "Someone who speaks but doesn't understand, tukhila.",
        "source": "T22n1428_011:0634c04_2"
    },
    {
        "source_sentence": "說戒時乃至三問憶念罪而不說者，突吉羅。",
        "translation": "When he teaches the precepts up to three questions, he remembers sins and doesn't explain them, tukhila.",
        "source": "T22n1428_011:0634c04_3"
    },
    {
        "source_sentence": "比丘尼，波逸提；",
        "translation": "A bhikṣuṇī is a pratyekabuddha.",
        "source": "T22n1428_011:0634c05_4"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1428_011:0634c06_5"
    },
    {
        "source_sentence": "是謂為犯。",
        "translation": "This is called a violation.",
        "source": "T22n1428_011:0634c06_6"
    },
    {
        "source_sentence": "不犯者，不見言不見、不聞言不聞、不觸言不觸、不知言不知，見言見、聞言聞、觸言觸、知言知，",
        "translation": "A person who doesn't violate the precepts doesn't see words and don't see them, doesn't hear words and don't hear them, doesn't touch words and don't touch them, doesn't know words and doesn't know them, sees words and views, hears words and hears sounds, touches words and touches, and knows words.",
        "source": "T22n1428_011:0634c07_7"
    },
    {
        "source_sentence": "意有見想便說者，不犯。",
        "translation": "It's not a violation if someone's mind has views and perceptions and then explains them.",
        "source": "T22n1428_011:0634c09_8"
    },
    {
        "source_sentence": "不犯者，最初未制戒，癡狂、心亂、痛惱所纏。",
        "translation": "A person who doesn't violate the precepts at first is bound by delusion, mental disturbance, and pain.",
        "source": "T22n1428_011:0634c10_0"
    },
    {
        "source_sentence": "(一竟)",
        "translation": "(1 complete)",
        "source": "T22n1428_011:0634c11_0"
    },
    {
        "source_sentence": "爾時佛在舍衛國祇樹給孤獨園。",
        "translation": "It was then that the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T22n1428_011:0634c12_0"
    },
    {
        "source_sentence": "時六群比丘斷諍事種類罵比丘，比丘慚愧忘失前後不得語。",
        "translation": "Six groups of monks then cut off sexual misconduct and abused the monk, and the monk was shameful and forgot to say anything before or after.",
        "source": "T22n1428_011:0634c12_1"
    },
    {
        "source_sentence": "諸比丘聞，其中有少欲知足、行頭陀、樂學戒、知慚愧者，呵責六群比丘：「云何六群比丘，",
        "translation": "When the monks heard this, some of them who had few desires and were satisfied, practiced asceticism, enjoyed studying the precepts, and knew shamefulness rebuked the six groups of monks, saying, “What are these six groups of monks?",
        "source": "T22n1428_011:0634c14_2"
    },
    {
        "source_sentence": "斷諍事種類罵比丘，使慚愧忘失前後不得語。」",
        "translation": "He stops the kind of verbal abuse that causes a monk to become shameful and forgets what he said before or after.",
        "source": "T22n1428_011:0634c16_3"
    },
    {
        "source_sentence": "時諸比丘往世尊所，頭面禮足在一面坐，以此因緣具白世尊。",
        "translation": "The monks then went to the Bhagavān, bowed their heads and feet, and sat at one side. They reported this story to the Bhagavān.",
        "source": "T22n1428_011:0634c17_4"
    },
    {
        "source_sentence": "世尊爾時以此因緣集比丘僧，呵責六群比丘：「汝所為非，非威儀、非沙門法、非淨行、非隨順行，",
        "translation": "The Bhagavat then gathered the monks for this reason and reprimanded the six groups of monks, saying: What you have done is wrong. It is not proper for you to do so; it is not proper for you to behave with deportment; it is not proper for you to follow the way of a sramana; it is not proper for you to practice purely; it is not",
        "source": "T22n1428_011:0634c19_0"
    },
    {
        "source_sentence": "所不應為。",
        "translation": "What shouldn't be done?",
        "source": "T22n1428_011:0634c21_1"
    },
    {
        "source_sentence": "云何六群比丘！",
        "translation": "What are the six groups of monks?",
        "source": "T22n1428_011:0634c21_2"
    },
    {
        "source_sentence": "斷諍事種類罵比丘，使慚愧忘失前後使不得語？」",
        "translation": "He stops the kind of sexual misconduct that causes a monk to become ashamed and forgets what happened before and after, so he can't speak.",
        "source": "T22n1428_011:0634c21_3"
    },
    {
        "source_sentence": "爾時世尊以無數方便呵責六群比丘已，告諸比丘：「往古世時得剎尸羅國婆羅門有牛，",
        "translation": "After the Bhagavān had reprimanded the six groups of monks with countless skillful means, he addressed the monks, Once upon a time in the distant past, there was a cow among the brāhmaṇas of Śīlabhadra who attained buddhahood.",
        "source": "T22n1428_011:0634c23_4"
    },
    {
        "source_sentence": "晝夜養飤刮刷摩捫。",
        "translation": "Day and night, he nourishes his hair, scrapes it, and brushes it away.",
        "source": "T22n1428_011:0634c25_5"
    },
    {
        "source_sentence": "時得剎尸羅國復有長者，於城市街巷遍自唱言：『誰有力牛，與我力牛共駕百車，",
        "translation": "An elderly householder from the country of Kuśinagara then called out in all the streets and alleys of the city, “Who is there a strong cow that can drive a hundred carts with me?",
        "source": "T22n1428_011:0634c25_6"
    },
    {
        "source_sentence": "[貝*為]金千兩？』",
        "translation": "[貝*為]金千兩?'",
        "source": "T22n1428_011:0634c27_7"
    },
    {
        "source_sentence": "時婆羅門牛聞唱聲自念：『此婆羅門晝夜餧飤我刮刷摩捫，我今宜當盡力自竭，",
        "translation": "The Brahman cow then heard the sound of his voice and thought to himself, “This brahman is attacking me day and night.",
        "source": "T22n1428_011:0634c27_8"
    },
    {
        "source_sentence": "取彼千兩金報此人恩。』",
        "translation": "Take a thousand taels of gold to repay this person's kindness.'",
        "source": "T22n1428_011:0634c29_9"
    },
    {
        "source_sentence": "時彼牛即語婆羅門言：『汝今當知，得剎尸羅國中有長者作是唱言：「誰有牛，",
        "translation": "The cow then said to the brāhmaṇa, “You should know that there is an elderly householder in the country of Kuśinagara who says:",
        "source": "T22n1428_011:0635a01_10"
    },
    {
        "source_sentence": "與我牛共駕百車，[貝*為]金千兩？」",
        "translation": "Together with my cow, you'll drive a hundred chariots of [pudgala*for] a thousand taels of gold?",
        "source": "T22n1428_011:0635a03_11"
    },
    {
        "source_sentence": "主今可往至彼長者家語言：「我有牛，可與汝牛共駕百車，[貝*為]金千兩。」』",
        "translation": "Now, the lord may go to that elder's house and say, 'I have a cow, so I can share with your cow a hundred chariots [for] a thousand taels of gold.'",
        "source": "T22n1428_011:0635a03_12"
    },
    {
        "source_sentence": "時婆羅門即往至長者家語言：『我有牛，可與汝牛共駕百車，[貝*為]金千兩。』",
        "translation": "The Brāhmaṇa then went to the elder's house and said, 'I have a cow; I can share with you your cow a hundred chariots [for] a thousand taels of gold.'",
        "source": "T22n1428_011:0635a05_13"
    },
    {
        "source_sentence": "長者報言：『今正是時。』",
        "translation": "The elder replied, 'Now is the right time.'",
        "source": "T22n1428_011:0635a07_14"
    },
    {
        "source_sentence": "婆羅門即牽己牛與長者牛共駕百車，[貝*為]金千兩。",
        "translation": "The Brāhmaṇa then took his own cow and the wealthy man's cow with him to drive a hundred chariots of gold [coarse*for] a thousand taels.",
        "source": "T22n1428_011:0635a07_15"
    },
    {
        "source_sentence": "時多人觀看，婆羅門於眾人前作毀呰語：『一角可牽。』",
        "translation": "When many people saw him, the Brāhmaṇa disparaged him in front of them, saying, 'A horn can be pulled.'",
        "source": "T22n1428_011:0635a08_16"
    },
    {
        "source_sentence": "時牛聞毀呰語，即懷慚愧不肯出力與對諍競，於是長者牛勝。",
        "translation": "When the cow heard the disparaging words, he became ashamed and refused to give up his strength to compete against it, and the elder's cow was victorious.",
        "source": "T22n1428_011:0635a10_17"
    },
    {
        "source_sentence": "婆羅門牛不如，輸金千兩。",
        "translation": "The Brahman cattle were inferior and offered a thousand taels of gold.",
        "source": "T22n1428_011:0635a11_18"
    },
    {
        "source_sentence": "時婆羅門語彼牛言：『我晝夜餧飤摩捫刮刷，望汝當與我盡力勝彼牛。",
        "translation": "The Brāhmaṇa then said to the cow,'Day and night, I've been scraping it day and night, hoping you'll give me my full strength to overcome that cow.",
        "source": "T22n1428_011:0635a12_19"
    },
    {
        "source_sentence": "云何今日反更使我輸金千兩耶？』",
        "translation": "How could you have asked me to return a thousand taels of gold today?'",
        "source": "T22n1428_011:0635a14_20"
    },
    {
        "source_sentence": "牛語婆羅門言：『汝於眾人前毀呰我言：「一角可牽。」",
        "translation": "The cow said to the Brāhmaṇa, 'In front of the crowd, you disparage me and say, One horn can be pulled.'",
        "source": "T22n1428_011:0635a14_21"
    },
    {
        "source_sentence": "使我大慚愧於眾人，是故不能復出力與彼競駕。",
        "translation": "Because I'm so greatly ashamed of the people, I can't again give up my strength to compete with them.",
        "source": "T22n1428_011:0635a16_22"
    },
    {
        "source_sentence": "若能改往言，更不名字形相毀我者，便可往語彼長者言：「能更與我牛共駕百車者，",
        "translation": "If you can change what you say and go there, and if you don't disparage me by name or form, then you can go there and tell the elder, 'Can you give me another cow to ride in a hundred chariots?'",
        "source": "T22n1428_011:0635a17_23"
    },
    {
        "source_sentence": "更倍出二千兩金。」』",
        "translation": "It's even doubled by 2,000 taels of gold.'",
        "source": "T22n1428_011:0635a19_24"
    },
    {
        "source_sentence": "婆羅門語牛言：『勿復令我更輸二千兩金。』",
        "translation": "The Brāhmaṇa said to the cow, 'Don't let me again give you another 2,000 taels of gold.'",
        "source": "T22n1428_011:0635a19_25"
    },
    {
        "source_sentence": "牛報婆羅門言：『汝勿復在眾人前毀呰我言：「一角可牽。」",
        "translation": "The ox reported to the Brāhmaṇa, saying, 'Don't criticize me again in front of the crowd and say, One horn can be pulled.'",
        "source": "T22n1428_011:0635a20_26"
    },
    {
        "source_sentence": "於眾人前當讚歎我：「好牽端嚴好角。」』",
        "translation": "In front of the crowd, they'll praise me, Good pulling and adorning horns.'",
        "source": "T22n1428_011:0635a22_27"
    },
    {
        "source_sentence": "時婆羅門至彼長者家語言：『能更與我牛共駕百車者，[貝*為]二千兩金。』",
        "translation": "The Brāhmaṇa then went to that elder's house and said, 'If you can share a hundred chariots with my cow and drive them in one hundred carriages, [paying for] 2,000 taels of gold.'",
        "source": "T22n1428_011:0635a23_0"
    },
    {
        "source_sentence": "長者報言：『今正是時。』",
        "translation": "The elder replied, 'Now is the right time.'",
        "source": "T22n1428_011:0635a24_1"
    },
    {
        "source_sentence": "時婆羅門牛與長者牛共駕百車，[貝*為]二千兩金，多人共看。",
        "translation": "The Brahman cow and the wealthy man's cow drove together in a hundred carts, [boiled*for] 2,000 taels of gold, and many people saw it together.",
        "source": "T22n1428_011:0635a25_2"
    },
    {
        "source_sentence": "時婆羅門於眾人前讚歎牛言：『好牽端嚴好角。』",
        "translation": "The Brāhmaṇa then praised the ox in front of the crowd, saying, 'It's nice to pull its horns and beautiful horns.'",
        "source": "T22n1428_011:0635a26_3"
    },
    {
        "source_sentence": "牛聞此語，即便勇力與彼競駕，婆羅門牛得勝。",
        "translation": "When the cow heard these words, it even rushed with courage to compete with them in a chariot. The Brahman cow was victorious.",
        "source": "T22n1428_011:0635a27_4"
    },
    {
        "source_sentence": "長者牛不如，婆羅門得二千兩金。」",
        "translation": "The wealthy man's cow isn't like that, and the Brāhmaṇa got 2,000 taels of gold.",
        "source": "T22n1428_011:0635a28_5"
    },
    {
        "source_sentence": "爾時佛語諸比丘：「凡人欲有所說，當說善語、不應說惡語，善語者善、惡語者自熱惱。",
        "translation": "It was then that the Buddha said to the monks, Ordinary people who want to teach something should speak good words and not speak bad words, and those who speak good words are good and those who speak bad words are self-inflicted with anguish.",
        "source": "T22n1428_011:0635a29_6"
    },
    {
        "source_sentence": "是故諸比丘！",
        "translation": "Therefore, monks!",
        "source": "T22n1428_011:0635b02_7"
    },
    {
        "source_sentence": "畜生得人毀呰，猶自慚愧不堪進力；",
        "translation": "An animal that receives criticism from others is still ashamed of itself and unable to make effort.",
        "source": "T22n1428_011:0635b02_8"
    },
    {
        "source_sentence": "況復於人，得他毀辱能不有慚愧耶！",
        "translation": "How could a person who is disgraced by others not have shame?",
        "source": "T22n1428_011:0635b03_9"
    },
    {
        "source_sentence": "此六群比丘癡人，斷諍事種類罵諸比丘，使慚愧忘前失後使不得語。」",
        "translation": "These six groups of monks are ignorant people who stop sexual misconduct and verbally abuse the monks, so they'll be shameful and forget their past failures and won't say anything.",
        "source": "T22n1428_011:0635b04_10"
    },
    {
        "source_sentence": "爾時世尊以無數方便呵責六群比丘已，告諸比丘：「此癡人！",
        "translation": "After the Bhagavān had reprimanded the six groups of monks with countless skillful means, he addressed the monks, This foolish man!",
        "source": "T22n1428_011:0635b06_11"
    },
    {
        "source_sentence": "多種有漏處，最初犯戒。",
        "translation": "There are many kinds of contaminated places where they first violate the precepts.",
        "source": "T22n1428_011:0635b07_12"
    },
    {
        "source_sentence": "自今已去與比丘結戒，集十句義乃至正法久住，欲說戒者當如是說：若比丘種類毀呰語者，",
        "translation": "Those who wish to preach the precepts should explain them in this way: “If a monk is divided into different kinds of disparaging speech,",
        "source": "T22n1428_011:0635b08_13"
    },
    {
        "source_sentence": "波逸提。」",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0635b10_14"
    },
    {
        "source_sentence": "比丘義如上說。",
        "translation": "The meaning of monk is as explained above.",
        "source": "T22n1428_011:0635b10_15"
    },
    {
        "source_sentence": "種類毀呰人者，卑姓家生，行業亦卑，伎術工巧亦卑，或言：「汝是犯過人。」",
        "translation": "A person who disparages people of various kinds is born from a humble family, with humble activities and humble skills, or he might say, You're a transgressor.",
        "source": "T22n1428_011:0635b11_16"
    },
    {
        "source_sentence": "或言：「汝多結使人。」",
        "translation": "Some people may say, You're often binding messengers.",
        "source": "T22n1428_011:0635b12_17"
    },
    {
        "source_sentence": "或言：「汝盲人。」",
        "translation": "Some say, You blind man.",
        "source": "T22n1428_011:0635b13_18"
    },
    {
        "source_sentence": "或言：「汝禿瞎人。」",
        "translation": "Some say, You're a baldie!",
        "source": "T22n1428_011:0635b13_19"
    },
    {
        "source_sentence": "卑者，旃陀羅種、除糞種、竹師種、車師種。",
        "translation": "The lowest is the caṇḍāla-seed, the excrement-seed, the bamboo-seed and the chariot-seed.",
        "source": "T22n1428_011:0635b14_0"
    },
    {
        "source_sentence": "卑姓者，拘湊、拘尸婆蘇晝、迦葉、阿提利夜、婆羅墮，若本非卑姓習卑伎術即是卑姓。",
        "translation": "A humble family is a humble family, such as Kauṇḍinya, Kauśinagara, Kāśyapa, Ārya, and Vārāṇasī; if someone who isn't originally a humble family and practices humble tricks, they're a humble family.",
        "source": "T22n1428_011:0635b14_1"
    },
    {
        "source_sentence": "卑業者，販賣猪羊、殺牛、放鷹鷂、獵人網魚、作賊、捕賊者、守城知刑獄。",
        "translation": "A lowly activity is that of selling pigs and sheep, killing cattle, releasing eagles and hawks, hunting net fish, committing thieves, catching thieves, guarding the city, and punishing prisoners.",
        "source": "T22n1428_011:0635b16_2"
    },
    {
        "source_sentence": "卑伎者，鍛作、木作、瓦陶作、皮韋作、剃髮作、簸箕作。",
        "translation": "A humble trick is made of wood, made of wood, made of tile, made of leather, made of shaved cloth, and made of bumps.",
        "source": "T22n1428_011:0635b18_3"
    },
    {
        "source_sentence": "犯者，波羅夷、僧伽婆尸沙、波逸提、波羅提提舍尼、偷蘭遮、突吉羅、惡說。",
        "translation": "A violator of the precepts is a pārājika, a saṃghâvaśeṣa, a pratyekabuddha, a pratideśanīya, a pāranjana, a tukhila, or a bad speaker.",
        "source": "T22n1428_011:0635b19_4"
    },
    {
        "source_sentence": "結者，從瞋恚乃至五百結。",
        "translation": "The fetters are from anger up to the five hundred fetters.",
        "source": "T22n1428_011:0635b21_5"
    },
    {
        "source_sentence": "盲瞎者，盲瞎、癵躄跛、聾瘂，及餘眾患所加。",
        "translation": "Blindness and blindness are blind, dumb, crippled, deaf-blind, and other afflictions.",
        "source": "T22n1428_011:0635b21_6"
    },
    {
        "source_sentence": "若比丘罵餘比丘言：「汝生卑賤家、汝業卑、伎術卑，汝犯、汝結使、汝禿瞎。」",
        "translation": "If a monk scolds another monk, saying, You're born in a humble home, your actions are humble, your skills are humble, you violate the precepts, you're bound by bonds, and you're bald and blind.",
        "source": "T22n1428_011:0635b22_7"
    },
    {
        "source_sentence": "如是等若面罵、若喻罵、若自比罵。",
        "translation": "Such people are verbally abused, verbally abused metaphorically, and verbally abused on their own.",
        "source": "T22n1428_011:0635b24_8"
    },
    {
        "source_sentence": "面罵者，言：「汝是旃陀羅家生、除糞家生、竹師種、車師種，拘湊、拘尸婆蘇晝、迦葉、阿提梨夜、婆羅墮種。」",
        "translation": "He faced the scold and said, You're born in a caṇḍāla family, born in a house of excrement, born in a bamboo or chariot family, born in Kuśinagara, born in Kuśinagara, born in Kāśyapa, born in Atinīya, and born in Bālāditya.",
        "source": "T22n1428_011:0635b25_9"
    },
    {
        "source_sentence": "若本非卑姓習卑伎術即是卑姓，汝是販賣人、殺牛猪羊人，汝是作賊捕賊人，",
        "translation": "If you weren't originally from a humble family and cultivated humble tricks, that would be a humble family. You're a seller, a cowherd, a pig or sheep killer, and you're a thief or thief catcher.",
        "source": "T22n1428_011:0635b27_10"
    },
    {
        "source_sentence": "汝是守城知刑獄人，汝是鍛作、木作、瓦陶作、皮韋作、剃髮作人。",
        "translation": "You're the guard of the city who knows that you're a prisoner, and you're the person who forges, makes wood, makes tiles, makes leather, and shaves.",
        "source": "T22n1428_011:0635b29_11"
    },
    {
        "source_sentence": "汝是犯波羅夷、僧伽婆尸沙、波逸提、波羅提提舍尼、偷蘭遮、突吉羅、惡說人，",
        "translation": "You're a person who violates the precepts of pārājika, saṃghâvaśeṣa, pratyekabuddha, pratideśanīya, pāratediṣṭhāna, kalala, tukhila, and harsh speech.",
        "source": "T22n1428_011:0635c01_12"
    },
    {
        "source_sentence": "汝是從瞋恚結人，乃至五百結人，汝是盲瞎、禿、躄跛、瘂聾，及眾患所加人。",
        "translation": "You're someone who's bound by the bond of anger, up to 500 bonds, and you're a person who's blind, blind, bald, dumb, crippled, deaf, and afflicted by various afflictions.",
        "source": "T22n1428_011:0635c03_13"
    },
    {
        "source_sentence": "喻罵者，汝似旃陀羅種、汝似除糞種、汝似竹師種、汝似車師種、汝似拘湊、汝似拘尸婆蘇晝種、汝似迦葉種、汝似阿提梨夜種、汝似婆羅墮種，",
        "translation": "You're like the caṇḍāla seed, you're like the excrement seed, you're like the bamboo teacher seed, you're like the charioteer seed, you're like the Kuśinagara seed, you're like the Kuśinagara day seed, you're like the Kāśyapa seed, you're like",
        "source": "T22n1428_011:0635c05_14"
    },
    {
        "source_sentence": "汝似販賣猪羊人、汝似殺牛人、汝似放鷹鷂人、汝似網魚獵人、汝似作賊者、捕賊者、汝似守城知刑獄人、汝似鍛作人、汝似木作人、汝似瓦陶作人、汝似皮韋作人、汝似剃髮人，",
        "translation": "You're like a person selling pigs and sheep, you're like a person killing cattle, you're like an eagle or hawk, you're like a net fisher, you're like a thief, a thief catcher, you're like a jailer guarding the city, you're like a forger, you're like a woodworker,",
        "source": "T22n1428_011:0635c08_15"
    },
    {
        "source_sentence": "汝似犯波羅夷人、汝似犯僧伽婆尸沙人、汝似犯波逸提人、汝似犯波羅提提舍尼人、汝似犯偷蘭遮人、汝似犯突吉羅人、汝似犯惡說人、汝似結使人、汝似盲瞎人、汝似禿人、汝似躄跛人、汝似瘂聾人。",
        "translation": "You're like a person who violates the pārājika, you're like a person who violates the saṃghâvaśeṣa, you're like a person who violates the pratyekabuddha, you're like a person who violates the pārājika, you're like a person who violates the pārājika, you're like a person who violates",
        "source": "T22n1428_011:0635c12_16"
    },
    {
        "source_sentence": "自比罵者，我非旃陀羅種、我非除糞種、我非竹師種、我非車師種、我非拘湊、拘尸婆蘇晝、迦葉、阿提梨夜、婆羅墮、販賣猪羊、殺牛人、放鷹鷂人、網魚獵人、作賊人、捕賊、守城、知刑獄人、鍛作人、木作人、竹作人、車作人、瓦陶作人、皮韋作人、剃髮人，",
        "translation": "Those who criticize themselves, saying, 'I'm not a caṇḍāla, I'm not a man of excrement, I'm not a bamboo maker, I'm not a charioteer, I'm not a Kauśinagara, Kauśinagara, Kāśyapa, Atirīya, Bālādatta, a pig or sheep trader,",
        "source": "T22n1428_011:0635c17_17"
    },
    {
        "source_sentence": "我非犯波羅夷人、僧伽婆尸沙人、波逸提人、波羅提提舍尼、偷蘭遮、突吉羅、惡說人，",
        "translation": "I am not a pārājika, a Saṃghâvaśeṣa, a pratyekabuddha, a pāyattika, a pārādeśanīya, a pāranjana, a tukhila, or a heretic.",
        "source": "T22n1428_011:0635c22_18"
    },
    {
        "source_sentence": "我非結使、我非盲瞎、禿、跛躄、瘂聾人。",
        "translation": "I'm not a messenger, and I'm not blind, blind, bald, crippled, or dumb.",
        "source": "T22n1428_011:0635c24_19"
    },
    {
        "source_sentence": "若比丘如上說種類毀呰者，波逸提。",
        "translation": "If a monk as described above disparages people of various kinds, pratyekabuddha.",
        "source": "T22n1428_011:0635c25_20"
    },
    {
        "source_sentence": "若種類毀呰語了了，波逸提；",
        "translation": "If a certain kind of disparaging speech understands it, pratyekabuddha.",
        "source": "T22n1428_011:0635c26_21"
    },
    {
        "source_sentence": "不了了者，突吉羅。",
        "translation": "Someone who doesn't understand it is a tukhila.",
        "source": "T22n1428_011:0635c27_22"
    },
    {
        "source_sentence": "若以說善法而面罵、若喻罵、自比罵。",
        "translation": "If he speaks the good Dharma and ridicules it with his face, ridicules it in terms of metaphors or ridicules himself.",
        "source": "T22n1428_011:0635c27_23"
    },
    {
        "source_sentence": "說善法者，阿蘭若、乞食、補納衣，乃至坐禪人。",
        "translation": "Someone who teaches the good Dharma is an arhat, a beggar, a patched-robed monk, or even a meditation practitioner.",
        "source": "T22n1428_011:0635c28_24"
    },
    {
        "source_sentence": "說善法面罵者，汝是阿蘭若乃至坐禪人。",
        "translation": "You're an arhat or even a meditation practitioner who speaks of the good dharma-face and scolds it.",
        "source": "T22n1428_011:0635c29_25"
    },
    {
        "source_sentence": "喻罵者，汝似阿練若乃至坐禪人。",
        "translation": "It's a metaphor for someone who scolds you, saying, 'You're like an arya or even a person sitting in meditation.'",
        "source": "T22n1428_011:0636a01_26"
    },
    {
        "source_sentence": "自比罵者，我非是阿練若，乃至我非坐禪人。",
        "translation": "Someone who compares himself to someone who ridicules themselves, saying, 'I'm not an arhat, and I'm not a person in meditation.'",
        "source": "T22n1428_011:0636a02_27"
    },
    {
        "source_sentence": "若比丘說善法，面罵、人喻罵、自比罵，說而了了者，突吉羅；",
        "translation": "If a monk teaches the true Dharma but is verbally abused, ridiculed by others or ridiculed by himself, and if he expounds [what he teaches] and understands [what he teaches], that is a grave offense.",
        "source": "T22n1428_011:0636a03_28"
    },
    {
        "source_sentence": "說不了了者，亦突吉羅。",
        "translation": "Those who say they don't understand are also pratyekabuddhas.",
        "source": "T22n1428_011:0636a04_29"
    },
    {
        "source_sentence": "比丘尼，波逸提；",
        "translation": "A bhikṣuṇī is a pratyekabuddha.",
        "source": "T22n1428_011:0636a05_30"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1428_011:0636a05_31"
    },
    {
        "source_sentence": "是謂為犯。",
        "translation": "This is called a violation.",
        "source": "T22n1428_011:0636a06_32"
    },
    {
        "source_sentence": "不犯者，相利故說、為法故說、為律故說、為教授故說、為親友故說、或戲笑故說、或因語次失口說、或在獨處說、或於夢中語、或欲說此而誤說彼，",
        "translation": "A person who doesn't violate it explains it for the sake of benefit, explains it for the sake of the Dharma, explains it for the sake of the precepts, explains it for the sake of instruction, explains it for the sake of friends and relatives, or explains it because they're laughing, or explains it because they lose control of their speech in order",
        "source": "T22n1428_011:0636a06_33"
    },
    {
        "source_sentence": "無犯。",
        "translation": "It's not a violation.",
        "source": "T22n1428_011:0636a10_34"
    },
    {
        "source_sentence": "無犯者，最初未制戒，癡狂、心亂、痛惱所纏。",
        "translation": "A person who doesn't violate the precepts at first is bound by delusion, mental disturbance, and pain.",
        "source": "T22n1428_011:0636a10_35"
    },
    {
        "source_sentence": "(二竟)爾時佛在舍衛國祇樹給孤獨園。",
        "translation": "(2nd completion) It was then that the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T22n1428_011:0636a11_36"
    },
    {
        "source_sentence": "爾時六群比丘傳彼此語，傳此屏語向彼說，傳彼屏語向此說，如是不息，",
        "translation": "It was then that the six groups of monks transmitted their words to each other, transmitting these quiet words and addressing them to others, and transmitting those quiet words and addressing them here, thus not ceasing.",
        "source": "T22n1428_011:0636a12_37"
    },
    {
        "source_sentence": "遂至眾中未有鬪事而生鬪事，已有鬪事而不滅。",
        "translation": "He then arrived among the crowd without any fighting and produced a fight, but there was already a fight that didn't cease.",
        "source": "T22n1428_011:0636a14_38"
    },
    {
        "source_sentence": "諸比丘各作是念：「眾僧以何因緣，本無鬪諍而有此諍，已有諍事而不能滅耶？」",
        "translation": "Each of the monks thought, What are the reasons why the saṃgha didn't have this dispute in the past and why they won't be able to extinguish it?",
        "source": "T22n1428_011:0636a15_39"
    },
    {
        "source_sentence": "諸比丘自知此六群比丘傳彼此語，遂至僧中鬪諍，先未有諍事而生諍事，",
        "translation": "The monks knew for themselves that the words of these six groups of monks had been transmitted to each other, so they went to fight among the saṃgha. There was no dispute before and a dispute arose in them.",
        "source": "T22n1428_011:0636a17_40"
    },
    {
        "source_sentence": "已有諍事而不能滅。",
        "translation": "There are already debilitating things that can't be extinguished.",
        "source": "T22n1428_011:0636a19_41"
    },
    {
        "source_sentence": "時眾中有少欲知足、行頭陀、樂學戒、知慚愧者，呵責六群比丘言：「云何汝等傳彼此語，",
        "translation": "Those in the assembly who had few desires and were satisfied, practiced asceticism, enjoyed studying the precepts, and knew shamefulness reprimanded the six groups of monks, saying, How did you transmit each other’s words?",
        "source": "T22n1428_011:0636a20_42"
    },
    {
        "source_sentence": "遂至僧中先未有諍事而生諍事，已有諍事而不能滅？」",
        "translation": "He then went to the saṃgha where there were no disputes that arose before, and there were already disputes that couldn't be resolved?",
        "source": "T22n1428_011:0636a22_43"
    },
    {
        "source_sentence": "諸比丘往至世尊所，頭面禮足在一面坐，以此因緣具白世尊。",
        "translation": "The monks went to the Bhagavān, bowed their foreheads and feet, and sat at one side. They reported this story to the Bhagavān.",
        "source": "T22n1428_011:0636a23_44"
    },
    {
        "source_sentence": "世尊以此因緣集比丘僧，呵責六群比丘：「云何汝等傳彼此語，遂至僧中先未有諍事而生諍事，",
        "translation": "Because of these causes and conditions, the Bhagavān gathered the monks and reprimanded the six groups of monks, saying, How did you transmit each other’s words to the saṃgha so that there were no disputes or controversies among them?",
        "source": "T22n1428_011:0636a24_45"
    },
    {
        "source_sentence": "已有諍事而不滅耶？」",
        "translation": "Is there already a dispute that won't cease?",
        "source": "T22n1428_011:0636a27_46"
    },
    {
        "source_sentence": "爾時世尊以無數方便呵責六群比丘已，告諸比丘：「汝等當聽，古昔有兩惡獸為伴，",
        "translation": "After having reprimanded the six groups of monks with countless skillful means, the World-honored One said to them: O bhikṣus, listen attentively. Formerly there were two evil animals as companions in the ancient world.",
        "source": "T22n1428_011:0636a27_47"
    },
    {
        "source_sentence": "一名善牙師子，二名善博虎，晝夜伺捕眾鹿。",
        "translation": "One was a lion with good teeth and two were well-known tigers. Day and night they waited to catch the deer.",
        "source": "T22n1428_011:0636a29_48"
    },
    {
        "source_sentence": "時有一野干逐彼二獸後，食其殘肉以自全命。",
        "translation": "At the time, there was a wild goose chasing after those two animals and eating their leftover flesh for its own life.",
        "source": "T22n1428_011:0636b01_49"
    },
    {
        "source_sentence": "時彼野干竊自生念：『我今不能久與相逐，當以何方便鬪亂彼二獸令不復相隨。』",
        "translation": "That wild boar then secretly thought to himself, 'Now that I can't go with them for a long time, what method will I use to fight those two animals so they won't follow each other?'",
        "source": "T22n1428_011:0636b03_0"
    },
    {
        "source_sentence": "時野干即往善牙師子所，如是語善牙：『善博虎有如是語言：「我生處勝、種姓勝、形色勝汝、力勢勝汝。",
        "translation": "The wild boar then went to the good-fanged lion and said to him, 'Sudatta, there's a good-fanged tiger that says, 'My place of birth is superior, my family name is superior, my form is superior to you, and my strength is superior to you.",
        "source": "T22n1428_011:0636b04_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1428_011:0636b07_2"
    },
    {
        "source_sentence": "我日日得好美食。",
        "translation": "Every day, I'll obtain good food and drink.",
        "source": "T22n1428_011:0636b07_3"
    },
    {
        "source_sentence": "善牙師子逐我後，食我殘肉以自全命。」』",
        "translation": "The good-fanged lion follows me and eats my leftover flesh for his own life.'",
        "source": "T22n1428_011:0636b07_4"
    },
    {
        "source_sentence": "「『形色及所生，　　大力而復勝；",
        "translation": "Form and form, as well as that which is produced, Will be powerful and even more powerful.",
        "source": "T22n1428_011:0636b08_5"
    },
    {
        "source_sentence": "　　善牙不能善。　　善博如是語。』",
        "translation": "Good teeth can’t be good, and such words are well-versed.’",
        "source": "T22n1428_011:0636b08_5"
    },
    {
        "source_sentence": "即說偈言：「善牙問野干言：『汝以何事得知？』",
        "translation": "He then spoke a verse, saying, Good teeth asked the wild boar, 'What do you know?'",
        "source": "T22n1428_011:0636b08_5"
    },
    {
        "source_sentence": "答言：『汝等二獸共集一處相見自知。』",
        "translation": "He replied, 'You two animals gathered together in one place to see each other and know for themselves.'",
        "source": "T22n1428_011:0636b12_6"
    },
    {
        "source_sentence": "爾時野干竊語善牙已，便往語善博虎言：『汝知不？",
        "translation": "After he had secretly talked to Shanya, the wild boar then went to speak to Shanbo Hu and said, 'Do you know?'",
        "source": "T22n1428_011:0636b13_7"
    },
    {
        "source_sentence": "善牙有如是語：「而我今日種姓、生處悉皆勝汝，力勢亦勝。",
        "translation": "Sunetra then said, “Today I am superior to you in terms of my caste and place of birth, as well as in strength.",
        "source": "T22n1428_011:0636b14_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1428_011:0636b16_9"
    },
    {
        "source_sentence": "我常食好肉。",
        "translation": "I always eat good flesh.",
        "source": "T22n1428_011:0636b16_10"
    },
    {
        "source_sentence": "善博虎食我殘肉而自活命。」』",
        "translation": "That well-versed tiger eats my leftover flesh and lives on its own.'",
        "source": "T22n1428_011:0636b16_11"
    },
    {
        "source_sentence": "「『形色及所生，　　大力而復勝；",
        "translation": "Form and form, as well as that which is produced, Will be powerful and even more powerful.",
        "source": "T22n1428_011:0636b17_12"
    },
    {
        "source_sentence": "　　善博不能善。　　善牙如是語。』",
        "translation": "He’s well versed but unable to speak well, and his good teeth say this.’",
        "source": "T22n1428_011:0636b17_12"
    },
    {
        "source_sentence": "即說偈言：「善博問言：『汝以何事得知？』",
        "translation": "He then spoke a verse, saying, Shanbao asked, 'What do you know about it?'",
        "source": "T22n1428_011:0636b17_12"
    },
    {
        "source_sentence": "答言：『汝等二獸共集一處相見自知。』",
        "translation": "He replied, 'You two animals gathered together in one place to see each other and know for themselves.'",
        "source": "T22n1428_011:0636b20_13"
    },
    {
        "source_sentence": "後二獸共集一處，瞋眼相視，善牙師子便作是念：『我不應不問便先下手打彼。』",
        "translation": "The next two animals gathered together in one place and looked at each other with angry eyes, and the good-fanged lion then thought, 'Shouldn't I first strike them with my hand without asking?'",
        "source": "T22n1428_011:0636b21_14"
    },
    {
        "source_sentence": "「『形色及所生，　　大力而復勝；",
        "translation": "Form and form, as well as that which is produced, Will be powerful and even more powerful.",
        "source": "T22n1428_011:0636b23_15"
    },
    {
        "source_sentence": "　　善牙不如我。　　善博說是耶？』",
        "translation": "Good teeth aren’t as good as mine, is that what Shanbao said?’",
        "source": "T22n1428_011:0636b23_15"
    },
    {
        "source_sentence": "爾時善牙師子向善博虎而說偈問：「彼自念言：『必是野干鬪亂我等。』",
        "translation": "It was then that the good-fanged lion said to the well-armed tiger in verse, He thought to himself, 'It must be a wilderness where we're fighting and disturbing.'",
        "source": "T22n1428_011:0636b23_15"
    },
    {
        "source_sentence": "「『善博不說是，　　形色及所生；",
        "translation": "Good and extensive don't say this is form and what it produces.",
        "source": "T22n1428_011:0636b27_16"
    },
    {
        "source_sentence": "　　大力而復勝，　　善牙不能善。",
        "translation": "With great power, he's still superior, but his good teeth can't be good.",
        "source": "T22n1428_011:0636b27_16"
    },
    {
        "source_sentence": "　　若受無利言，　　信他彼此語；",
        "translation": "If someone receives unbeneficial words, They will believe the words of others.",
        "source": "T22n1428_011:0636b27_16"
    },
    {
        "source_sentence": "　　親厚自破壞，　　便成於冤家。",
        "translation": "Being intimate and self-defeated, they'll become an enemy.",
        "source": "T22n1428_011:0636b27_16"
    },
    {
        "source_sentence": "　　若以知真實，　　當滅除瞋惱；",
        "translation": "If someone knows the truth, They will annihilate anger and torment.",
        "source": "T22n1428_011:0636b27_16"
    },
    {
        "source_sentence": "　　今可至誠說，　　令身得利益。",
        "translation": "Now, we can speak with utmost sincerity for the benefit of our bodies.",
        "source": "T22n1428_011:0636b27_16"
    },
    {
        "source_sentence": "　　今當善降伏，　　除滅惡知識；",
        "translation": "I will now skillfully subdue them And rid them of bad companions.",
        "source": "T22n1428_011:0636b27_16"
    },
    {
        "source_sentence": "　　可殺此野干，　　鬪亂我等者。』",
        "translation": "You can kill this wild boar and disturb us.'",
        "source": "T22n1428_011:0636b27_16"
    },
    {
        "source_sentence": "善博虎說偈答善牙師子言：「即打野干殺，二獸還和合。」",
        "translation": "The well-versed tiger spoke a verse in reply to the good-fanged lion, saying, That's when he strikes a wild boar and kills it, and the two animals return together.",
        "source": "T22n1428_011:0636b27_16"
    },
    {
        "source_sentence": "爾時佛告諸比丘：「此二獸為彼所破，共集一處相見不悅；",
        "translation": "It was then that the Buddha said to the monks: These two animals were destroyed by those others. They assembled together in one place but they did not like each other.",
        "source": "T22n1428_011:0636c08_17"
    },
    {
        "source_sentence": "況復於人，為人所破心能不惱？",
        "translation": "How could a person whose mind is broken by someone not be disturbed?",
        "source": "T22n1428_011:0636c10_0"
    },
    {
        "source_sentence": "云何六群比丘鬪亂彼此，先無諍事而生諍事，已有諍事而不能滅。」",
        "translation": "How are the six groups of monks who fight against each other and give rise to disputes when there's no dispute in the past, and they can't cease if there's already a dispute?",
        "source": "T22n1428_011:0636c10_1"
    },
    {
        "source_sentence": "爾時世尊以無數方便呵責六群比丘已，告諸比丘：「此癡人！",
        "translation": "After the Bhagavān had reprimanded the six groups of monks with countless skillful means, he addressed the monks, This foolish man!",
        "source": "T22n1428_011:0636c12_2"
    },
    {
        "source_sentence": "多種有漏處，最初犯戒。",
        "translation": "There are many kinds of contaminated places where they first violate the precepts.",
        "source": "T22n1428_011:0636c13_3"
    },
    {
        "source_sentence": "自今已去與比丘結戒，集十句義乃至正法久住，欲說戒者當如是說：若比丘兩舌語，",
        "translation": "Those who wish to preach the precepts should explain them in this way: If a monk speaks duplicitously or falsely,",
        "source": "T22n1428_011:0636c14_4"
    },
    {
        "source_sentence": "波逸提。」",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0636c16_5"
    },
    {
        "source_sentence": "比丘義如上說。",
        "translation": "The meaning of monk is as explained above.",
        "source": "T22n1428_011:0636c16_6"
    },
    {
        "source_sentence": "兩舌者，比丘鬪亂比丘、比丘尼、式叉摩那、沙彌、沙彌尼、優婆塞、優婆夷、國王及大臣、外道、異學沙門、婆羅門。",
        "translation": "Duplicitous speech is when a monk disputes with a monk, a bhikṣu, a bhikṣuṇī, a bhikṣuṇī, a śrāmaṇer, a novice, a novice, a śrāmaṇī, an upāsaka, a layman, a king or minister, a non-Buddhist, a heretical ascetic",
        "source": "T22n1428_011:0636c17_0"
    },
    {
        "source_sentence": "比丘尼還鬪亂比丘尼、式叉摩那、沙彌、沙彌尼、優婆塞、優婆夷、國王及大臣、外道、異學沙門、婆羅門比丘。",
        "translation": "The bhikṣuṇīs returned to fight against the bhikṣuṇīs, śikṣamāṇas, novices, novices, nuns, laymen, laymen, laymen, kings, ministers, non-Buddhists, heretics, ascetics, and brāhmaṇa monks.",
        "source": "T22n1428_011:0636c19_1"
    },
    {
        "source_sentence": "式叉摩那還鬪亂式叉摩那、沙彌、沙彌尼、優婆塞、優婆夷、國王及大臣、外道、異學沙門、婆羅門、比丘、比丘尼。",
        "translation": "Śākyamuni returns to fight, and Śākyamuni, the śrāmaṇer, śrāmaṇerī, śrāmaṇīs, upāsaka, upāsikā, kings and ministers, non-Buddhists, heretics, ascetics, brāhmaṇas, monks, bhikṣus, and bhikṣuṇīs.",
        "source": "T22n1428_011:0636c21_2"
    },
    {
        "source_sentence": "沙彌還鬪亂沙彌、沙彌尼、優婆塞、優婆夷、國王及大臣、外道、異學沙門、婆羅門、比丘、比丘尼、式叉摩那。",
        "translation": "The śrāmaṇer returns to fight and disturbs the śrāmaṇerīs, śrāmaṇerīs, upāsaka, upāsikā, upāsikā, kings and ministers, non-Buddhists, heretics, ascetics of different schools, ascetics, brāhmaṇas, monks, bhikṣuṇīs, and Ś",
        "source": "T22n1428_011:0636c24_0"
    },
    {
        "source_sentence": "沙彌尼還鬪亂沙彌尼、優婆塞、優婆夷、國王及大臣、外道、異學沙門、婆羅門、比丘、比丘尼、式叉摩那、沙彌、沙彌尼。",
        "translation": "The śrāmaṇerīs return to fight with the śrāmaṇerīs, laymen, laymen, kings and ministers, heretics, non-Buddhists, heretical ascetics, brahmans, brahmans, monks, bhikṣuṇīs, Śākyamunis, śrāmaṇeras, and śrāmaṇerīs.",
        "source": "T22n1428_011:0636c26_1"
    },
    {
        "source_sentence": "優婆塞還鬪亂優婆塞、優婆夷、國王及大臣、外道、異學沙門、婆羅門、比丘、比丘尼、式叉摩那、沙彌、沙彌尼。",
        "translation": "The laymen return to fight and disturb the laymen, laymen, laywomen, kings, ministers, non-Buddhists, heretics, heretical ascetics, brahmans, brāhmaṇas, monks, nuns, bhikṣuṇīs, śrāmaṇeras, novices, and novices.",
        "source": "T22n1428_011:0636c28_2"
    },
    {
        "source_sentence": "優婆夷還鬪亂優婆夷、國王及大臣、外道、異學沙門、婆羅門、比丘、比丘尼、式叉摩那、沙彌、沙彌尼、優婆塞。",
        "translation": "Upāsikā returned to fight against Upāsikā, the king and his ministers, non-Buddhists, heretics, ascetics, priests, brahmans, monks, nuns, bhikṣuṇīs, śrāmaṇeras, śrāmaṇerīs, and upāsaka.",
        "source": "T22n1428_011:0637a02_3"
    },
    {
        "source_sentence": "國王還鬪亂國王及大臣、外道、異學沙門、婆羅門、比丘、比丘尼、式叉摩那、沙彌、沙彌尼、優婆塞、優婆夷。",
        "translation": "The king returned to fight with the king, his ministers, non-Buddhists, heretics, ascetics, priests, monks, brahmans, monks, bhikṣuṇīs, śrāmaṇeras, śrāmaṇerīs, upāsaka, and upāsikā.",
        "source": "T22n1428_011:0637a04_4"
    },
    {
        "source_sentence": "大臣還鬪亂大臣、外道、異學沙門、婆羅門、比丘、比丘尼、式叉摩那、沙彌、沙彌尼、優婆塞、優婆夷、國王。",
        "translation": "The ministers returned to fight and disturb the ministers, non-Buddhists, heretics, ascetics, brahmans, brāhmaṇas, monks, bhikṣus, bhikṣuṇīs, śrāmaṇeras, śrāmaṇerīs, upāsaka, upāsikā, and kings of the country.",
        "source": "T22n1428_011:0637a06_5"
    },
    {
        "source_sentence": "種種外道、沙門、婆羅門還鬪亂種種外道、沙門、婆羅門、比丘、比丘尼、式叉摩那、沙彌、沙彌尼、優婆塞、優婆夷、國王大臣。",
        "translation": "Various non-Buddhists, ascetics, ascetics, and brāhmaṇas returned to fight with various non-Buddhists, ascetics, ascetics, brāhmaṇas, monks, bhikṣus, bhikṣuṇīs, śrāmaṇeras, śrāmaṇerīs, upāsaka, upāsikā, and",
        "source": "T22n1428_011:0637a08_6"
    },
    {
        "source_sentence": "鬪亂者，某甲說是言：「汝是旃陀羅種、除糞種、竹師種、車師種、拘湊、拘尸婆、蘇晝種、迦葉、阿提梨夜、婆羅墮，",
        "translation": "A certain person said, You're of the caṇḍāla type, except for the dung type, the bamboo type, the chariot type, the Kuśinagara type, the Kuśinagara type, the Sudarśana type, the Kāśyapa type, the ādiriya type, and the Bālāditya type.",
        "source": "T22n1428_011:0637a11_7"
    },
    {
        "source_sentence": "販賣猪羊、殺牛、放鷹、網魚、獵師、作賊、捕賊、守城刑獄、鍛作、陶師、皮師、剃髮師，",
        "translation": "They trade in pigs and sheep, slaughter cattle, release eagles, net fish, hunters, thieves, bandits, jailers, torturers, potter men, leathermen, and shavers.",
        "source": "T22n1428_011:0637a13_8"
    },
    {
        "source_sentence": "汝犯波羅夷、僧伽婆尸沙、波逸提、波羅提提舍尼、偷蘭遮、突吉羅、惡說。",
        "translation": "You've violated the precepts of pārājika, saṃghâvaśeṣa, pratyekabuddha, pratideśanīya, pāranjana, tukhila, and bad speech.",
        "source": "T22n1428_011:0637a15_9"
    },
    {
        "source_sentence": "結使者，從瞋恚乃至五百結，禿、盲瞎、跛躄、聾瘂。」",
        "translation": "The messenger of bondage is from anger up to the five hundred bonds, which are bald, blind, crippled, and deaf.",
        "source": "T22n1428_011:0637a17_10"
    },
    {
        "source_sentence": "若有比丘破皆是比丘鬪亂，說而了了者，波逸提；",
        "translation": "If, [however] if a monk breaks this doctrine, it is all because the monks are at odds with one another and expounds what they understand, pratyekabuddha.",
        "source": "T22n1428_011:0637a18_11"
    },
    {
        "source_sentence": "說而不了了者，突吉羅。",
        "translation": "Someone who speaks but doesn't understand, tukhila.",
        "source": "T22n1428_011:0637a19_12"
    },
    {
        "source_sentence": "比丘尼，波逸提；",
        "translation": "A bhikṣuṇī is a pratyekabuddha.",
        "source": "T22n1428_011:0637a19_13"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1428_011:0637a20_14"
    },
    {
        "source_sentence": "是謂為犯。",
        "translation": "This is called a violation.",
        "source": "T22n1428_011:0637a21_0"
    },
    {
        "source_sentence": "不犯者，破惡知識、破惡伴黨、破方便壞僧者、破助壞僧者、破二人三人作羯磨者。",
        "translation": "Those who don't violate the precepts are those who break bad friends, break bad companions, break skillful means to disrupt the saṃgha, break help disrupt the saṃgha, and break two or three people who make a karma.",
        "source": "T22n1428_011:0637a21_1"
    },
    {
        "source_sentence": "破若作非法羯磨、非律羯磨者，破若僧、若塔、若廟、若和上、同和上、若阿闍梨、同阿闍梨、若知識、若親友、若數數語者、無義無利、欲方便作無義無利，",
        "translation": "If someone breaks it and does an unlawful karma or an unlawful karma, they'll break it if the saṃgha, a stūpa, a shrine, a temple, a monk, a fellow monk, a preceptor, a fellow preceptor, a teacher, a friend, a friend, or a person who speaks repeatedly, which has no meaning and no",
        "source": "T22n1428_011:0637a23_2"
    },
    {
        "source_sentence": "破如是人者，不犯。",
        "translation": "It's not a violation if someone breaks such a person.",
        "source": "T22n1428_011:0637a26_3"
    },
    {
        "source_sentence": "不犯者，最初未制戒，癡狂、心亂、痛惱所纏。",
        "translation": "A person who doesn't violate the precepts at first is bound by delusion, mental disturbance, and pain.",
        "source": "T22n1428_011:0637a27_4"
    },
    {
        "source_sentence": "(三竟)爾時佛在舍衛國祇樹給孤獨園。",
        "translation": "(3 complete) At the time, the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T22n1428_011:0637a28_5"
    },
    {
        "source_sentence": "爾時尊者阿那律從舍衛國向拘薩羅國中，路至無比丘住處村，問言：「誰與我住處？」",
        "translation": "It was then that Venerable Anuruddha departed from Sāvatthī and headed for Kośala, went to a village where there were no monks living, and asked, Who will give me the place to live?",
        "source": "T22n1428_011:0637a29_6"
    },
    {
        "source_sentence": "聞彼有一婬女家，常安止賓客在門屋下住。",
        "translation": "I've heard that there's a house of a promiscuous woman who always keeps her guests living under the door.",
        "source": "T22n1428_011:0637b02_7"
    },
    {
        "source_sentence": "時阿那律即往至彼婬女家語言：「大妹！",
        "translation": "Aniruddha then went to that woman's house and said, Great sister!",
        "source": "T22n1428_011:0637b03_8"
    },
    {
        "source_sentence": "欲寄止一宿可得爾不？」",
        "translation": "Would you like to stay for one night and get it?",
        "source": "T22n1428_011:0637b04_9"
    },
    {
        "source_sentence": "婬女答曰：「可住，門下寬廣隨意止宿。」",
        "translation": "The promiscuous woman replied, You can stay here; the door is wide enough to allow you to spend the night as you wish.",
        "source": "T22n1428_011:0637b05_10"
    },
    {
        "source_sentence": "阿那律即入門下，自敷草蓐坐具結加趺坐，一心思惟繫念在前。",
        "translation": "Aniruddha then entered the door, spread out his own sitting cloth and sat cross-legged in front of him, concentrating his thoughts with one thought.",
        "source": "T22n1428_011:0637b06_11"
    },
    {
        "source_sentence": "爾時拘薩羅國諸長者有行緣之便，亦投彼村求覓宿處，亦復聞彼婬女家常止賓客，",
        "translation": "It was then that the elders of Kośala, having some business to do, also went to the village and asked for lodging. They also heard that the house of the promiscuous woman was always staying there as a guest.",
        "source": "T22n1428_011:0637b07_12"
    },
    {
        "source_sentence": "即便往其家求寄宿言：「欲於此寄一宿可爾不？」",
        "translation": "He went to his house and asked the constellation to send him there, saying, Would you like to send one night here?",
        "source": "T22n1428_011:0637b09_13"
    },
    {
        "source_sentence": "婬女答言：「我已先聽一沙門宿，君可問彼沙門，可得共宿者便可止宿。」",
        "translation": "The promiscuous woman replied, I've already heard that one ascetic sleeps, so you may ask that ascetic; he can stay together and then stop the night.",
        "source": "T22n1428_011:0637b11_0"
    },
    {
        "source_sentence": "其人即往阿那律所語言：「我向語主人求宿即見聽許，今欲共宿不相妨耶？」",
        "translation": "That person then went to Anāthapiṇḍika and said, I've told my host to ask for permission to stay overnight, so I'll see and hear it.",
        "source": "T22n1428_011:0637b12_1"
    },
    {
        "source_sentence": "阿那律答言：「我草蓐敷竟，門屋寬大，可隨意宿，勿疑也。」",
        "translation": "Aniruddha replied, I've finished laying out my bed of grass, and the door and house are so wide that you can sleep as you wish without doubt.",
        "source": "T22n1428_011:0637b14_2"
    },
    {
        "source_sentence": "時諸長者即入門屋下，長者伴多坐相逼近。",
        "translation": "The elders then went to the door and entered the room, where their companions sat closely together.",
        "source": "T22n1428_011:0637b16_0"
    },
    {
        "source_sentence": "時婬女見已即生愍念心言：「此阿那律是豪貴子孫，習樂來久不能忍苦。",
        "translation": "Seeing this, the promiscuous woman then became angry and said, This Aniruddha is a noble son and grandson who's cultivated happiness for a long time and can't tolerate suffering.",
        "source": "T22n1428_011:0637b17_0"
    },
    {
        "source_sentence": "今諸長者共相逼近。」",
        "translation": "Now, the elders are crowding each other.",
        "source": "T22n1428_011:0637b18_1"
    },
    {
        "source_sentence": "即至阿那律所語言：「尊者習樂來久不能忍苦，今諸長者共相逼近，尊者能入我舍內宿不？」",
        "translation": "He went to Anāthapiṇḍika and said, Venerable, you've cultivated pleasure for a long time but can't bear suffering; now that the elders are pressing each other, can you enter my dwelling to spend the night?",
        "source": "T22n1428_011:0637b19_2"
    },
    {
        "source_sentence": "即報言：「可。」",
        "translation": "He replied, Yes.",
        "source": "T22n1428_011:0637b21_3"
    },
    {
        "source_sentence": "爾時尊者阿那律即便入舍，在其坐處結加趺坐繫念在前。",
        "translation": "Venerable Aniruddha then went into his dwelling and sat cross-legged in front of him at the place where he was seated.",
        "source": "T22n1428_011:0637b21_4"
    },
    {
        "source_sentence": "時婬女室中然燈燭竟夕不絕，彼婬女於初夜來往阿那律所語言：「近有諸長者婆羅門種，",
        "translation": "On the first watch of the night, the promiscuous woman approached Aniruddha and said to him, “There are some wealthy brāhmaṇas in the village.",
        "source": "T22n1428_011:0637b23_0"
    },
    {
        "source_sentence": "多諸財寶，皆來語我言：『可與我作婦。』",
        "translation": "Many wealthy people and treasures all came to me and said, 'Should you give me a wife?'",
        "source": "T22n1428_011:0637b25_1"
    },
    {
        "source_sentence": "我即語彼諸長者言：『汝等醜陋，不能為汝等作婦，若是端正者我今當為其作婦。』",
        "translation": "I then said to those elders, 'You're ugly and can't be your wife; if you're handsome, I will now become their wife.'",
        "source": "T22n1428_011:0637b26_2"
    },
    {
        "source_sentence": "我觀尊者形貌端正，可為我作夫耶？」",
        "translation": "I observe that the Bhagavān's appearance is correct, so can I be his husband?",
        "source": "T22n1428_011:0637b28_3"
    },
    {
        "source_sentence": "時尊者阿那律雖聞此語，默然不答，亦不觀視。",
        "translation": "Although Venerable Anuruddha heard these words, he remained silent and didn't answer them, and he didn't look around.",
        "source": "T22n1428_011:0637b29_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1428_011:0637c01_1"
    },
    {
        "source_sentence": "由尊者得無上二俱解脫故。",
        "translation": "It's because the Bhagavān has attained the unsurpassed liberation of both.",
        "source": "T22n1428_011:0637c01_2"
    },
    {
        "source_sentence": "到後夜末明相欲出，時復語阿那律言：「諸婆羅門長者種皆多財寶語我言：『為我作婦。』",
        "translation": "When the latter part of the night approached dawn, he said to Aniruddha, All the wealthy brāhmaṇas and elders all spoke to me, saying,'Make a wife for me.'",
        "source": "T22n1428_011:0637c02_0"
    },
    {
        "source_sentence": "我即不許。",
        "translation": "That is, I won't allow it.",
        "source": "T22n1428_011:0637c04_1"
    },
    {
        "source_sentence": "然阿那律顏貌端政，可為我作夫耶？」",
        "translation": "Still, Anuruddha's appearance is so handsome that can you be my husband?",
        "source": "T22n1428_011:0637c04_2"
    },
    {
        "source_sentence": "阿那律復默然不答，亦不觀視。",
        "translation": "Aniruddha remained silent and didn't answer, nor did he look around.",
        "source": "T22n1428_011:0637c05_3"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1428_011:0637c06_0"
    },
    {
        "source_sentence": "由是尊者得無上二俱解脫故。",
        "translation": "It's because the Bhagavān has attained the unsurpassed liberation of both.",
        "source": "T22n1428_011:0637c06_1"
    },
    {
        "source_sentence": "爾時此婬女即脫衣來前捉之，時阿那律以神足力踊身在空中。",
        "translation": "At the time, this promiscuous woman took off her robes and came before him to catch him, and Aniruddha then jumped up into the air with miraculous powers.",
        "source": "T22n1428_011:0637c06_2"
    },
    {
        "source_sentence": "婬女見之慚愧，裸身蹲住，即疾疾取衣著已，叉手合掌，仰面空中向阿那律言：「懺悔！",
        "translation": "Seeing this, the promiscuous woman was ashamed and crouched naked. She quickly took off her clothes, put them on, saluted him with joined palms, looked up in the air toward Aniruddha, and said:",
        "source": "T22n1428_011:0637c08_3"
    },
    {
        "source_sentence": "懺悔！」",
        "translation": "repentance!",
        "source": "T22n1428_011:0637c10_4"
    },
    {
        "source_sentence": "如是至三。",
        "translation": "Thus, it's up to three.",
        "source": "T22n1428_011:0637c10_5"
    },
    {
        "source_sentence": "「願尊者還來在本處坐。」",
        "translation": "May the Bhagavān return to his seat here.",
        "source": "T22n1428_011:0637c11_0"
    },
    {
        "source_sentence": "阿那律即下在本處坐。",
        "translation": "Aniruddha then sat down in his original place.",
        "source": "T22n1428_011:0637c11_1"
    },
    {
        "source_sentence": "此女人禮阿那律足已却坐一面，阿那律為說種種微妙法，所謂施義、戒義、生天之義，",
        "translation": "The woman bowed at Anavatapta’s feet, withdrew, and sat to one side. Anavatapta taught her various subtle doctrines:",
        "source": "T22n1428_011:0637c12_2"
    },
    {
        "source_sentence": "呵欲不淨、度有漏縛，稱讚出離為樂、增益解脫。",
        "translation": "They disparage the impurity of desire and liberate themselves from the contaminated bonds, praise renunciation as bliss, and increase liberation.",
        "source": "T22n1428_011:0637c14_3"
    },
    {
        "source_sentence": "時婬女即於座上諸塵垢盡得法眼淨。",
        "translation": "The promiscuous woman then ended the defilements on her seat and attained purity of the Dharma eye.",
        "source": "T22n1428_011:0637c15_4"
    },
    {
        "source_sentence": "時婬女見法得法已：「唯願聽許為優婆夷，歸依佛法僧，自今已去盡形壽不殺生，",
        "translation": "The promiscuous woman then saw the Dharma and attained the Dharma, saying, “All I ask is that you allow me to become a layman and take refuge in the Buddha, Dharma, and Sangha. From now until the end of my life I will not kill living beings.",
        "source": "T22n1428_011:0637c16_5"
    },
    {
        "source_sentence": "乃至不飲酒。",
        "translation": "It doesn't even drink alcohol.",
        "source": "T22n1428_011:0637c18_6"
    },
    {
        "source_sentence": "願尊者今日受我請食。」",
        "translation": "May the Bhagavān accept my invitation to eat today.",
        "source": "T22n1428_011:0637c18_7"
    },
    {
        "source_sentence": "阿那律默然受之。",
        "translation": "Aniruddha accepted it quietly.",
        "source": "T22n1428_011:0637c18_8"
    },
    {
        "source_sentence": "彼婬女知阿那律默然受請已，即辦具種種甘饍飲食而供養之，食已取一小床在阿那律前坐。",
        "translation": "Knowing that Anuruddha had remained silent and accepted the invitation, the promiscuous woman prepared a variety of sweet foods and drinks to offer as an offering, and after eating them, she took a small bed and sat down in front of Anuruddha.",
        "source": "T22n1428_011:0637c19_9"
    },
    {
        "source_sentence": "阿那律為說種種法，勸喻令其心喜，為說法已從坐而去。",
        "translation": "Aniruddha explained the various teachings for him, exhorted them with examples to make their minds happy, and departed from his seat after explaining the teaching.",
        "source": "T22n1428_011:0637c21_10"
    },
    {
        "source_sentence": "還僧伽藍中，以此因緣具向諸比丘說。",
        "translation": "Returning to the monastery, he explained these causes and conditions to the monks.",
        "source": "T22n1428_011:0637c23_0"
    },
    {
        "source_sentence": "時眾中有少欲知足、行頭陀、樂學戒、知慚愧者，譏嫌阿那律言：「云何阿那律！",
        "translation": "Among the people in the assembly who had few desires and were satisfied, practiced as an ascetic, enjoyed studying precepts, and knew modesty, he ridiculed Anavatapta and said, What's Anavatapta?",
        "source": "T22n1428_011:0637c23_1"
    },
    {
        "source_sentence": "與婦女同室宿耶？」",
        "translation": "Are you staying with women in the same room?",
        "source": "T22n1428_011:0637c25_2"
    },
    {
        "source_sentence": "諸比丘往至世尊所，頭面禮足在一面坐，以此因緣具白世尊。",
        "translation": "The monks went to the Bhagavān, bowed their foreheads and feet, and sat at one side. They reported this story to the Bhagavān.",
        "source": "T22n1428_011:0637c26_3"
    },
    {
        "source_sentence": "世尊即以此因緣集比丘僧，知而故問阿那律言：「汝實與女人獨同室宿不？」",
        "translation": "Knowing this, the Bhagavān gathered the monks and nuns for this reason and asked Aniruddha, Are you really staying with a woman alone in your room?",
        "source": "T22n1428_011:0637c27_4"
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, Indeed.",
        "source": "T22n1428_011:0637c29_5"
    },
    {
        "source_sentence": "佛無數方便呵責阿那律言：「汝所為非，非威儀、非沙門法、非淨行、非隨順行，",
        "translation": "Countless skillful means were used by the Buddha to reprimand Aniruddha, saying: “Your conduct is not proper; it is not dignified; it is not the way of a renunciant; it is not pure practice; it is not compliant.",
        "source": "T22n1428_011:0637c29_6"
    },
    {
        "source_sentence": "所不應為。",
        "translation": "What shouldn't be done?",
        "source": "T22n1428_011:0638a02_7"
    },
    {
        "source_sentence": "云何阿那律！",
        "translation": "What's Anavatapta?",
        "source": "T22n1428_011:0638a02_8"
    },
    {
        "source_sentence": "與婦女同室宿？」",
        "translation": "To sleep with women in the same room?",
        "source": "T22n1428_011:0638a03_9"
    },
    {
        "source_sentence": "世尊以無數方便呵責阿那律已，告諸比丘：「自今已去與諸比丘結戒，",
        "translation": "After the Bhagavān had reprimanded Aniruddha with countless skillful means, he addressed the monks, From now on, I'll conclude the precepts with the monks.",
        "source": "T22n1428_011:0638a03_10"
    },
    {
        "source_sentence": "集十句義乃至正法久住，欲說戒者當如是說：若比丘與婦女同室宿者，",
        "translation": "If you want to preach the precepts, you should explain them in this way: “If a monk spends the night in the same room as a woman,",
        "source": "T22n1428_011:0638a05_11"
    },
    {
        "source_sentence": "波逸提。」",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0638a06_12"
    },
    {
        "source_sentence": "比丘義如上說。",
        "translation": "The meaning of monk is as explained above.",
        "source": "T22n1428_011:0638a07_13"
    },
    {
        "source_sentence": "婦女者，人女、有知、命根不斷。",
        "translation": "A woman is a woman who doesn't stop the human, wise, and life faculties.",
        "source": "T22n1428_011:0638a07_14"
    },
    {
        "source_sentence": "室者，有四周牆壁，障上有覆，或前敞而無壁，或有四壁上無覆，或有雖覆而不遍，",
        "translation": "A room is a wall surrounded by four walls that are either covered above the obstruction, or open but without walls in front of it. Some have four walls that are neither covered nor uncovered; sometimes they are covered but not covering.",
        "source": "T22n1428_011:0638a08_15"
    },
    {
        "source_sentence": "或有雖覆遍而有開處，是謂室。",
        "translation": "Or there may be an opening place that's covered and pervaded but has an opening place, which is called a room.",
        "source": "T22n1428_011:0638a10_16"
    },
    {
        "source_sentence": "若比丘先宿、婦女後至，或婦女先至、比丘後到，或二人俱至，若亞臥隨脇著地，",
        "translation": "If a monk sleeps first and a woman arrives later, or if a woman arrives first and a monk arrives later, or if two people come together, or if he lies down and puts his armpit to the ground,",
        "source": "T22n1428_011:0638a11_17"
    },
    {
        "source_sentence": "波逸提。",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0638a12_18"
    },
    {
        "source_sentence": "隨轉側，波逸提。",
        "translation": "The side that follows, pratyekabuddha.",
        "source": "T22n1428_011:0638a13_19"
    },
    {
        "source_sentence": "若天女、阿修羅女、若龍女、夜叉女、餓鬼女同室宿者，突吉羅。",
        "translation": "If goddesses, asura maidens, dragon maidens, yakṣa maidens, and hungry ghost maidens live together in the same dwelling place, it's a grave offense.",
        "source": "T22n1428_011:0638a13_20"
    },
    {
        "source_sentence": "與畜生女能變化、不能變化者同室宿，突吉羅。",
        "translation": "If he shares the same room with an animal-born woman who can change and someone who can't change, it's a grave offense.",
        "source": "T22n1428_011:0638a14_21"
    },
    {
        "source_sentence": "若與黃門、二根人同室宿，突吉羅。",
        "translation": "If he's staying in the same room with someone from the yellow gate or two faculties, it's a grave offense.",
        "source": "T22n1428_011:0638a15_22"
    },
    {
        "source_sentence": "晝日婦女立，比丘臥者，突吉羅。",
        "translation": "Every day, when a woman stands up and a monk lies down, it's a grave offense.",
        "source": "T22n1428_011:0638a16_23"
    },
    {
        "source_sentence": "比丘尼，波逸提；",
        "translation": "A bhikṣuṇī is a pratyekabuddha.",
        "source": "T22n1428_011:0638a17_24"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1428_011:0638a17_25"
    },
    {
        "source_sentence": "是謂為犯。",
        "translation": "This is called a violation.",
        "source": "T22n1428_011:0638a18_26"
    },
    {
        "source_sentence": "不犯者，若比丘不知彼室內有婦女而宿；",
        "translation": "A person who doesn’t violate the precepts is if a monk doesn’t know that there are women living in those chambers.",
        "source": "T22n1428_011:0638a18_27"
    },
    {
        "source_sentence": "若比丘先至而婦女後至，比丘不知；",
        "translation": "If the bhikṣu arrives first but the woman arrives later, the bhikṣu does not know.",
        "source": "T22n1428_011:0638a19_28"
    },
    {
        "source_sentence": "若屋有覆而無四邊障，或盡覆而半障，或盡覆而少障，或盡障而不覆，",
        "translation": "If a house is covered but has no four side hindrances, or if it's completely covered but half the hindrances, or if it's completely covered but few hindrances, or if it's completely covered but doesn't cover all the hindrances,",
        "source": "T22n1428_011:0638a20_29"
    },
    {
        "source_sentence": "或有盡障而少覆，或半覆半障，或少覆少障，或不覆不障露地，無犯。",
        "translation": "It's not a violation if there's an end of the obstruction but a little obstruction, or a half-obstruction or half-obstruction, or a little obstruction or little obstruction, or something that doesn't obstruct and doesn't obstruct the exposed ground.",
        "source": "T22n1428_011:0638a22_30"
    },
    {
        "source_sentence": "此室中若行若坐，無犯。",
        "translation": "Whether walking or sitting in this room, it's not a violation.",
        "source": "T22n1428_011:0638a23_31"
    },
    {
        "source_sentence": "若頭眩倒地、若病臥，無犯。",
        "translation": "It's not a violation if the head is dazzled and falls to the ground or if he's sick and lying down.",
        "source": "T22n1428_011:0638a24_32"
    },
    {
        "source_sentence": "或為強力所捉、若為人所縛、若命難、淨行難，無犯。",
        "translation": "It's not a violation if someone is caught by force, bound by someone, or has difficulty with their life or pure practice.",
        "source": "T22n1428_011:0638a25_0"
    },
    {
        "source_sentence": "無犯者，最初未制戒，癡狂、心亂、痛惱所纏。",
        "translation": "A person who doesn't violate the precepts at first is bound by delusion, mental disturbance, and pain.",
        "source": "T22n1428_011:0638a26_1"
    },
    {
        "source_sentence": "(四竟)爾時世尊在曠野城。",
        "translation": "(End of the Fourth) It was then that the Bhagavān was in the wilderness city.",
        "source": "T22n1428_011:0638a27_2"
    },
    {
        "source_sentence": "六群比丘與諸長者共在講堂止住，時六群中有一人散亂心睡眠無所覺知，",
        "translation": "When the six groups of monks and their elders were staying together in the assembly hall, one of the six groups of monks was scattered to sleep without knowing.",
        "source": "T22n1428_011:0638a28_3"
    },
    {
        "source_sentence": "小轉側形體發露。",
        "translation": "The shape of the small turning side is revealed in essence.",
        "source": "T22n1428_011:0638b01_4"
    },
    {
        "source_sentence": "時有比丘以衣覆已，復更轉側露形，一比丘復以衣覆之。",
        "translation": "After covering it with his robe, a monk then turns around and reveals his side again, and another monk covers it with his robe.",
        "source": "T22n1428_011:0638b01_5"
    },
    {
        "source_sentence": "尋復轉側而形起。",
        "translation": "They then turned to one side and took their forms.",
        "source": "T22n1428_011:0638b03_6"
    },
    {
        "source_sentence": "時諸長者見已，便生譏嫌大笑調弄。",
        "translation": "Seeing this, the elders became disgusted and laughed in derision.",
        "source": "T22n1428_011:0638b03_7"
    },
    {
        "source_sentence": "時眠比丘心懷慚愧無顏，諸比丘亦慚愧。",
        "translation": "The sleeping monks then felt shameful and didn't look ashamed, and the monks were also shameful.",
        "source": "T22n1428_011:0638b04_8"
    },
    {
        "source_sentence": "其中有少欲知足、知慚愧、行頭陀、樂學戒者，譏嫌此比丘言：「云何六群比丘與諸長者共止宿耶？」",
        "translation": "Some of them who had few desires and were satisfied, knew shamefulness, practiced as an ascetic, and enjoyed studying the precepts criticized this monk, saying, How did the six groups of monks and the elders stay together?",
        "source": "T22n1428_011:0638b05_9"
    },
    {
        "source_sentence": "時諸比丘即往世尊所，頭面禮足在一面坐，以此因緣具白世尊。",
        "translation": "The monks then went to the Bhagavān, bowed their heads and feet, and sat at one side. They reported this cause and condition to the Bhagavān.",
        "source": "T22n1428_011:0638b07_10"
    },
    {
        "source_sentence": "世尊爾時以此因緣集諸比丘，呵責六群比丘：「汝所為非，非威儀、非沙門法、非淨行、非隨順行，",
        "translation": "The Bhagavat then gathered the monks for this reason and reprimanded the six groups of monks, saying: What you have done is wrong. It is not proper for you to do so; it is not proper for you to behave with deportment; it is not proper for you to follow the way of a sramana; it is not proper for you to practice purely; it is not",
        "source": "T22n1428_011:0638b09_11"
    },
    {
        "source_sentence": "所不應為。",
        "translation": "What shouldn't be done?",
        "source": "T22n1428_011:0638b11_12"
    },
    {
        "source_sentence": "云何六群比丘！",
        "translation": "What are the six groups of monks?",
        "source": "T22n1428_011:0638b11_13"
    },
    {
        "source_sentence": "與諸長者共止宿耶？」",
        "translation": "Are you staying with the elders?",
        "source": "T22n1428_011:0638b12_14"
    },
    {
        "source_sentence": "以無數方便呵責六群比丘已，告諸比丘言：「此六群比丘癡人！",
        "translation": "After he had rebuked the six groups of monks with countless skillful means, he told the monks, These six groups of monks are foolish!",
        "source": "T22n1428_011:0638b12_15"
    },
    {
        "source_sentence": "多種有漏處，最初犯戒。",
        "translation": "There are many kinds of contaminated places where they first violate the precepts.",
        "source": "T22n1428_011:0638b14_16"
    },
    {
        "source_sentence": "自今已去與比丘結戒，集十句義乃至正法久住，欲說戒者當如是說：若比丘與未受大戒人共宿，",
        "translation": "Those who wish to preach the precepts should explain them in this way: “If a monk spends the night together with someone who has not received the higher ordination”:",
        "source": "T22n1428_011:0638b14_17"
    },
    {
        "source_sentence": "波逸提。」",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0638b17_18"
    },
    {
        "source_sentence": "如是世尊與比丘結戒。",
        "translation": "Thus, the Bhagavān and the monks formed the precepts.",
        "source": "T22n1428_011:0638b17_19"
    },
    {
        "source_sentence": "爾時佛在拘睒毘國，諸比丘如是言：「佛不聽我曹與未受大戒人共宿，",
        "translation": "At that time the Buddha was staying in Kauśinagara. The monks spoke thus: The Buddha will not allow me to spend the night together with anyone who has not received the higher ordination.",
        "source": "T22n1428_011:0638b17_20"
    },
    {
        "source_sentence": "當遣羅云出去。」",
        "translation": "I'll send Luo Yun out.",
        "source": "T22n1428_011:0638b19_21"
    },
    {
        "source_sentence": "時羅云無屋住往廁上宿，時佛知之，往詣廁所作謦欬聲。",
        "translation": "When Rāhula had no room to sleep and went to the toilet, the Buddha knew him, went to the toilet, and made a loud noise.",
        "source": "T22n1428_011:0638b20_0"
    },
    {
        "source_sentence": "時羅云亦復謦欬，世尊知而故問：「此中有誰？」",
        "translation": "Knowing that Rāhula was also angry, the Bhagavān asked, Who is there here?",
        "source": "T22n1428_011:0638b21_1"
    },
    {
        "source_sentence": "羅云答言：「我是羅云。」",
        "translation": "Rāhula replied, I'm Rāhula.",
        "source": "T22n1428_011:0638b22_2"
    },
    {
        "source_sentence": "復問：「汝在此中作何等耶？」",
        "translation": "Again, he asked, What are you doing here?",
        "source": "T22n1428_011:0638b22_3"
    },
    {
        "source_sentence": "答言：「諸比丘言：『不得與未受具戒人共宿。』",
        "translation": "He replied, The monks said, 'They say, 'You mustn't sleep with someone who hasn't received the full set of precepts.'",
        "source": "T22n1428_011:0638b23_4"
    },
    {
        "source_sentence": "驅我出。」",
        "translation": "Expel me out!",
        "source": "T22n1428_011:0638b24_5"
    },
    {
        "source_sentence": "世尊即便言：「云何愚癡比丘無有慈心，乃驅小兒出？",
        "translation": "The Bhagavān then said, How is it that a foolish monk with no compassion drives the little boy out?",
        "source": "T22n1428_011:0638b24_6"
    },
    {
        "source_sentence": "是佛子不護我意耶？」",
        "translation": "Is this the Buddha-son who doesn't protect my mind?",
        "source": "T22n1428_011:0638b26_7"
    },
    {
        "source_sentence": "即便授指與之令捉，將來自入住房共止一宿。",
        "translation": "He then gave him his fingers and told him to catch them, and they were about to leave the house and stayed together for one night.",
        "source": "T22n1428_011:0638b26_8"
    },
    {
        "source_sentence": "明日清旦集諸比丘告言：「汝等無慈心，乃驅出小兒，是佛子不護我意耶！",
        "translation": "The next morning, they gathered the monks and told them, You're not compassionate, so you drive out the little boy, isn't that a Buddha-child who doesn't guard my thoughts?",
        "source": "T22n1428_011:0638b27_9"
    },
    {
        "source_sentence": "自今已去聽諸比丘與未受大戒人共二宿，若至三宿，明相未出時應起避去。",
        "translation": "From now on, they'll listen to the monks who share two nights with someone who hasn't received the great precepts for two nights, and if they reach three nights, they'll explain that they should get up and avoid them when their characteristics haven't emerged.",
        "source": "T22n1428_011:0638b29_10"
    },
    {
        "source_sentence": "若至第四宿，若自去、若使未受戒人去。",
        "translation": "If he reaches the fourth lunar station, he'll leave on his own or send someone who hasn't received the precepts to leave.",
        "source": "T22n1428_011:0638c02_11"
    },
    {
        "source_sentence": "自今已去當如是說戒：若比丘與未受大戒人共宿，過二宿至三宿，波逸提。」",
        "translation": "From now on, he'll explain the precepts in this way: If a monk sleeps with someone who hasn't received the great precepts and goes from two nights to three nights together, pratyekabuddha.",
        "source": "T22n1428_011:0638c03_12"
    },
    {
        "source_sentence": "比丘義如上說。",
        "translation": "The meaning of monk is as explained above.",
        "source": "T22n1428_011:0638c05_13"
    },
    {
        "source_sentence": "未受戒人者，除比丘、比丘尼，餘未受大戒人是。",
        "translation": "A person who hasn't received the precepts is a monk or bhikṣuṇī other than a monk or bhikṣuṇī who hasn't received the great precepts.",
        "source": "T22n1428_011:0638c05_14"
    },
    {
        "source_sentence": "同室宿者，如前說。",
        "translation": "A constellation in the same room is as explained above.",
        "source": "T22n1428_011:0638c06_15"
    },
    {
        "source_sentence": "若比丘先至、未受大戒人後至，未受戒人前至、比丘後至，或二人俱至，",
        "translation": "If a monk arrives before and a person who has not received the great precepts arrives after, or if a person who has not received the precepts arrives before and a monk arrives after, or if two people arrive together,",
        "source": "T22n1428_011:0638c06_16"
    },
    {
        "source_sentence": "若脇著地犯，若小轉側亦犯。",
        "translation": "It's a violation if he puts his flanks on the ground, and it's also a violation if he turns sideways for a little bit.",
        "source": "T22n1428_011:0638c08_17"
    },
    {
        "source_sentence": "若天男、阿須羅男、乾闥婆男、夜叉男、餓鬼男，及與畜生中能變化者、不能變化者，",
        "translation": "Suppose there are divine men, asuras, gandharvas, yakṣa men, hungry ghost men, and animals who can change and those who can't.",
        "source": "T22n1428_011:0638c09_18"
    },
    {
        "source_sentence": "共過二宿三宿，突吉羅。",
        "translation": "Together with two or three constellations, it's a grave offense.",
        "source": "T22n1428_011:0638c11_19"
    },
    {
        "source_sentence": "比丘尼，波逸提；",
        "translation": "A bhikṣuṇī is a pratyekabuddha.",
        "source": "T22n1428_011:0638c11_20"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1428_011:0638c12_21"
    },
    {
        "source_sentence": "是謂為犯。",
        "translation": "This is called a violation.",
        "source": "T22n1428_011:0638c12_22"
    },
    {
        "source_sentence": "不犯者，若比丘先不知在彼住、而未受戒人在後至，若未受戒人在前至、比丘在後至，",
        "translation": "If a monk doesn't know that he's staying there before and the person who hasn't received the precepts arrives later, and if the person who hasn't received the precepts arrives earlier and the monk arrives later,",
        "source": "T22n1428_011:0638c13_23"
    },
    {
        "source_sentence": "若屋上有覆無四障、或盡覆而半障、或有盡障而少覆、或半障半覆、或少障少覆，",
        "translation": "If a house is covered without four hindrances, or if it's completely covered but half-covered, or if it has fully covered but little covering, or if it's half-covered and half-covered by half-covering, or if it has few hindrances and little covering,",
        "source": "T22n1428_011:0638c15_24"
    },
    {
        "source_sentence": "若空露地，若坐、若經行，不犯。",
        "translation": "It's not a violation if he sits or walks in an open space or exposes himself to the ground, or if he's sitting or walking up and down.",
        "source": "T22n1428_011:0638c17_25"
    },
    {
        "source_sentence": "若頭眩倒地、若病臥、或為強力所執、若為繫閉、若命難、淨行難，是為不犯。",
        "translation": "It's not a violation if his head is dazzled by the ground, he's sick and lying down, or he's strongly held, bound, has difficulty with life, and has difficulty with pure practices.",
        "source": "T22n1428_011:0638c17_26"
    },
    {
        "source_sentence": "不犯者，最初未制戒，癡狂、心亂、痛惱所纏。",
        "translation": "A person who doesn't violate the precepts at first is bound by delusion, mental disturbance, and pain.",
        "source": "T22n1428_011:0638c19_27"
    },
    {
        "source_sentence": "(五竟)爾時佛在曠野城。",
        "translation": "(Fifth) At the time, the Buddha was in the wilderness city.",
        "source": "T22n1428_011:0638c20_28"
    },
    {
        "source_sentence": "六群比丘與諸長者共在講堂誦佛經語，語聲高大，如婆羅門誦書聲無異，",
        "translation": "The six groups of monks and the elders were together in the assembly hall, reciting the words of the Buddha’s discourse. The sound of their recitation was as lofty as that of a brahman’s calligraphy, no different.",
        "source": "T22n1428_011:0638c21_29"
    },
    {
        "source_sentence": "亂諸坐禪者。",
        "translation": "He disturbs those who are sitting in meditation.",
        "source": "T22n1428_011:0638c23_30"
    },
    {
        "source_sentence": "時諸比丘聞已，其中有少欲知足、行頭陀、樂學戒、知慚愧者，譏嫌六群比丘言：「云何與諸長者在講堂中，",
        "translation": "When the monks heard this, some of them who had few desires and were satisfied, practiced as an ascetic, enjoyed studying the precepts, and knew shamefulness criticized the six groups of monks, saying, How can you be with the elders in the assembly hall?",
        "source": "T22n1428_011:0638c23_31"
    },
    {
        "source_sentence": "共誦經如婆羅門誦書聲耶？」",
        "translation": "Do you recite the sūtras together like the sounds of a Brāhmaṇa recitation and writing?",
        "source": "T22n1428_011:0638c26_32"
    },
    {
        "source_sentence": "時諸比丘往至世尊所，頭面禮足在一面坐，以此因緣具白世尊。",
        "translation": "The monks then went to the Bhagavān, bowed their heads and feet, and sat at one side. They reported this story to the Bhagavān.",
        "source": "T22n1428_011:0638c26_33"
    },
    {
        "source_sentence": "世尊爾時以此因緣集比丘僧，呵責六群比丘：「汝等云何與長者共在講堂中，",
        "translation": "It was then that the World-honored One gathered the monks and nuns for this reason and reprimanded the sixfold assembly of monks, saying: “How are you staying together with the householders in the assembly hall?",
        "source": "T22n1428_011:0638c28_34"
    },
    {
        "source_sentence": "誦經聲如婆羅門無異耶？」",
        "translation": "Is the sound of recitation of the sūtras like that of a brāhmaṇa without difference?",
        "source": "T22n1428_011:0639a01_35"
    },
    {
        "source_sentence": "世尊以無數方便呵責六群比丘已，告諸比丘：「此癡人！",
        "translation": "After the Bhagavān had reprimanded the six groups of monks with countless skillful means, he addressed the monks, This foolish man!",
        "source": "T22n1428_011:0639a01_36"
    },
    {
        "source_sentence": "多種有漏處，最初犯戒。",
        "translation": "There are many kinds of contaminated places where they first violate the precepts.",
        "source": "T22n1428_011:0639a03_37"
    },
    {
        "source_sentence": "自今已去與比丘結戒，集十句義乃至正法久住，欲說戒者當如是說：若比丘與未受戒人共誦者，",
        "translation": "Those who wish to preach the precepts should explain them in this way: “If a monk recites [the precepts] together with someone who has not received the precepts, then he is bound by the five precepts.",
        "source": "T22n1428_011:0639a03_38"
    },
    {
        "source_sentence": "波逸提。」",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0639a06_0"
    },
    {
        "source_sentence": "比丘義如上說。",
        "translation": "The meaning of monk is as explained above.",
        "source": "T22n1428_011:0639a06_1"
    },
    {
        "source_sentence": "未受戒者，除比丘、比丘尼，餘者是。",
        "translation": "Those who haven't received the precepts are except monks and nuns, and the rest are monks and nuns.",
        "source": "T22n1428_011:0639a06_2"
    },
    {
        "source_sentence": "句義非句義，句味非句味，字義非字義。",
        "translation": "The meaning of a phrase is not the meaning of a phrase, the taste of a phrase is not the taste of a phrase, and the meaning of a word is not the meaning of a word.",
        "source": "T22n1428_011:0639a07_3"
    },
    {
        "source_sentence": "句義者，與人同誦不前不後，「諸惡莫作，諸善奉行；",
        "translation": "The meaning of the phrase is that they recite it together with others, neither before nor after. Don’t do evil and practice wholesomeness.",
        "source": "T22n1428_011:0639a08_4"
    },
    {
        "source_sentence": "自淨其意，是諸佛教。」",
        "translation": "To purify one's own mind is Buddhism.",
        "source": "T22n1428_011:0639a09_5"
    },
    {
        "source_sentence": "非句義者，如一人說諸惡莫作未竟，第二人抄前言諸惡莫作。",
        "translation": "What's not the meaning of the phrase is like a person who says, Don't do evil and doesn't finish it, and the second person copies the previous statement, Don't do evil.",
        "source": "T22n1428_011:0639a09_6"
    },
    {
        "source_sentence": "句味者，二人共誦不前不後，「眼無常、耳無常，乃至意無常。」",
        "translation": "The taste of the phrase is when two people recite it together, neither before nor after, saying, The eye is impermanent, the ear is impermanent, and even the mind is impermanent.",
        "source": "T22n1428_011:0639a11_7"
    },
    {
        "source_sentence": "非句味者，如一人未稱眼無常，第二人抄前言眼無常。",
        "translation": "It's not the taste of words, like when one person doesn't claim that the eye is impermanent, and the second person copies the previous statement that the eye is impermanent.",
        "source": "T22n1428_011:0639a12_8"
    },
    {
        "source_sentence": "字義者，二人共誦不前不後，「阿羅波遮那。」",
        "translation": "The meaning of the word is that two people recite it together without going forward or backwards, arapacana.",
        "source": "T22n1428_011:0639a14_9"
    },
    {
        "source_sentence": "非字義者，如一人未稱言阿也，第二人抄前言阿也。",
        "translation": "The meaning of the non-syllable is like when one person doesn't call it a, and the second person copies the previous word a.",
        "source": "T22n1428_011:0639a15_0"
    },
    {
        "source_sentence": "句法者，佛所說、聲聞所說、仙人所說、諸天所說。",
        "translation": "The phrase dharma refers to what the Buddha teaches, what śrāvakas teach, what sages teach, and what gods teach.",
        "source": "T22n1428_011:0639a16_1"
    },
    {
        "source_sentence": "若比丘與未受戒人共誦，一說、二說、三說，若口授、若書授，若了了，",
        "translation": "Suppose a monk recites it together with someone who hasn’t received the precepts, saying one thing, two things, or three things, whether he teaches it verbally or in writing, or understands it.",
        "source": "T22n1428_011:0639a17_2"
    },
    {
        "source_sentence": "波逸提；",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0639a18_3"
    },
    {
        "source_sentence": "說而不了了，突吉羅。",
        "translation": "It's explained but not comprehended, tukhila.",
        "source": "T22n1428_011:0639a19_0"
    },
    {
        "source_sentence": "天子、阿修羅子、夜叉子、龍子、乾闥婆子、畜生能變化者，一說、二說、三說，",
        "translation": "Sons of gods, asura children, yakṣa children, dragon children, gandharva children, and animals who can change are taught by one, taught by two, and taught by three.",
        "source": "T22n1428_011:0639a19_1"
    },
    {
        "source_sentence": "說而了了、不了了者，突吉羅。",
        "translation": "Someone who explains but understands and doesn't understand, tukhila.",
        "source": "T22n1428_011:0639a21_2"
    },
    {
        "source_sentence": "若師不教言：「我說竟，汝可說。」",
        "translation": "If the teacher doesn't teach, saying, I've finished speaking, you can explain it.",
        "source": "T22n1428_011:0639a21_3"
    },
    {
        "source_sentence": "者，師突吉羅。",
        "translation": "That's the teacher, Tukhāra.",
        "source": "T22n1428_011:0639a22_4"
    },
    {
        "source_sentence": "比丘尼，波逸提；",
        "translation": "A bhikṣuṇī is a pratyekabuddha.",
        "source": "T22n1428_011:0639a22_5"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1428_011:0639a23_6"
    },
    {
        "source_sentence": "是謂為犯。",
        "translation": "This is called a violation.",
        "source": "T22n1428_011:0639a23_7"
    },
    {
        "source_sentence": "不犯者，我說竟汝說、一人誦竟一人書、若二人同業同誦，或戲笑語、或疾疾語、或獨語、或夢中語、或欲說此乃說彼，",
        "translation": "A person who doesn't violate the precepts says, 'After I say it, you say it; after one person recites it, one person writes it; if two people recite it together in the same book; or if they both play and laugh at it; or speak quickly; or speak alone; or speak in a dream; or speak to someone else when they want to explain it.'",
        "source": "T22n1428_011:0639a24_8"
    },
    {
        "source_sentence": "無犯。",
        "translation": "It's not a violation.",
        "source": "T22n1428_011:0639a26_9"
    },
    {
        "source_sentence": "無犯者，最初未制戒，癡狂、心亂、痛惱所纏。",
        "translation": "A person who doesn't violate the precepts at first is bound by delusion, mental disturbance, and pain.",
        "source": "T22n1428_011:0639a27_0"
    },
    {
        "source_sentence": "(六竟)",
        "translation": "(6 complete)",
        "source": "T22n1428_011:0639a28_0"
    },
    {
        "source_sentence": "爾時佛在羅閱城耆闍崛山中。",
        "translation": "It was then that the Buddha was staying at Mount Gṛdhrakūṭa in Rājagṛha.",
        "source": "T22n1428_011:0639a29_0"
    },
    {
        "source_sentence": "時有行波利婆沙摩那埵比丘在下行坐，時六群比丘語諸白衣：「汝等知如許人在下行坐者不耶？」",
        "translation": "When there was a monk practicing parivāsa-māṇava who was walking down and sitting, the six groups of monks said to the white robes, Do you know that it's permissible for someone to walk down and sit?",
        "source": "T22n1428_011:0639a29_1"
    },
    {
        "source_sentence": "白衣報言：「我等不知。」",
        "translation": "The white-robed monks replied, We don't know.",
        "source": "T22n1428_011:0639b03_2"
    },
    {
        "source_sentence": "六群比丘語言：「此等犯如是事，犯如是事故，眾僧罰使在下行坐。」",
        "translation": "The six groups of monks said, These are offenses like this, and if they commit such offenses, the saṃgha will punish them by sending them down to walk and sit.",
        "source": "T22n1428_011:0639b03_3"
    },
    {
        "source_sentence": "有過比丘聞之慚愧，餘比丘聞之亦慚愧。",
        "translation": "If there's a fault, the monk is ashamed when he hears it, and the other monks are ashamed when they hear it.",
        "source": "T22n1428_011:0639b05_4"
    },
    {
        "source_sentence": "中有少欲知足、行頭陀、樂學戒、知慚愧者，譏嫌六群比丘言：「云何比丘犯麁惡事，",
        "translation": "Those who had few desires and were contentious, practiced as an ascetic, enjoyed studying the precepts, and knew shamefulness criticized the six groups of monks, saying, How does a monk commit sexual misconduct?",
        "source": "T22n1428_011:0639b06_5"
    },
    {
        "source_sentence": "乃向白衣說耶？」",
        "translation": "Is it explained to the white-robed?",
        "source": "T22n1428_011:0639b08_6"
    },
    {
        "source_sentence": "諸比丘往世尊所，頭面禮足在一面坐，以此因緣具白世尊。",
        "translation": "The monks went to the Bhagavān, bowed their foreheads and feet, and sat at one side. They reported this story to the Bhagavān.",
        "source": "T22n1428_011:0639b08_7"
    },
    {
        "source_sentence": "世尊以此因緣集比丘僧，呵責六群比丘言：「汝等云何知比丘犯麁惡事，",
        "translation": "Because of these causes and conditions, the Bhagavān gathered the monks and reprimanded the six groups of monks, saying, How do you know that monks commit sexual misconduct?",
        "source": "T22n1428_011:0639b09_8"
    },
    {
        "source_sentence": "乃向白衣說耶？」",
        "translation": "Is it explained to the white-robed?",
        "source": "T22n1428_011:0639b11_9"
    },
    {
        "source_sentence": "以無數方便呵責已，告諸比丘：「此癡人！",
        "translation": "After he had been rebuked with countless skillful means, he told the monks, This foolish man!",
        "source": "T22n1428_011:0639b12_10"
    },
    {
        "source_sentence": "多種有漏處，最初犯戒。",
        "translation": "There are many kinds of contaminated places where they first violate the precepts.",
        "source": "T22n1428_011:0639b12_11"
    },
    {
        "source_sentence": "自今已去與比丘結戒，集十句義乃至正法久住，欲說戒者當如是說：若比丘比丘犯麁惡罪，",
        "translation": "Those who wish to preach the precepts should explain them in this way: “Suppose a monk or a nun commits a heinous sin of sexual misconduct.",
        "source": "T22n1428_011:0639b13_12"
    },
    {
        "source_sentence": "向未受大戒人說，波逸提。」",
        "translation": "It's said to someone who hasn't yet received the great precepts, pratyekabuddha.",
        "source": "T22n1428_011:0639b15_13"
    },
    {
        "source_sentence": "如是世尊與比丘結戒。",
        "translation": "Thus, the Bhagavān and the monks formed the precepts.",
        "source": "T22n1428_011:0639b16_14"
    },
    {
        "source_sentence": "爾時比丘，或不知麁惡、不知不麁惡，後乃方知麁惡，或有作波逸提懺悔者，",
        "translation": "At the time, a monk might not know what’s unwholesome and what’s not unwholesome, but only later will he know what’s unwholesome. Someone who repents by making a pāyattika",
        "source": "T22n1428_011:0639b16_15"
    },
    {
        "source_sentence": "或有畏慎者。",
        "translation": "Perhaps there's someone who's afraid and cautious.",
        "source": "T22n1428_011:0639b18_16"
    },
    {
        "source_sentence": "佛言：「不知，無犯。",
        "translation": "The Buddha said, I don't know, but it's not a violation.",
        "source": "T22n1428_011:0639b19_0"
    },
    {
        "source_sentence": "自今已去當如是說戒：若比丘知比丘犯麁惡罪，向未受大戒人說者，波逸提。」",
        "translation": "From now on, he'll explain the precepts in this way: 'If a monk knows that a monk commits a crude and bad sin and speaks to someone who hasn't received the great precepts, pratyekabuddha.'",
        "source": "T22n1428_011:0639b19_1"
    },
    {
        "source_sentence": "如是世尊與比丘結戒。",
        "translation": "Thus, the Bhagavān and the monks formed the precepts.",
        "source": "T22n1428_011:0639b21_2"
    },
    {
        "source_sentence": "爾時舍利弗為眾所差，在王眾中及諸人民眾中說調達過：「調達所作者，",
        "translation": "It was then that Śāriputra, who had been appointed by the assembly, spoke of the faults of discipline to the king's assembly and the people among themselves, saying, The author of the discipline is...",
        "source": "T22n1428_011:0639b21_3"
    },
    {
        "source_sentence": "莫言是佛法僧，當知是調達所作。」",
        "translation": "Don't say that it's the Buddha, Dharma, or saṃgha, and you should know that it's what Tathāgata does.",
        "source": "T22n1428_011:0639b23_4"
    },
    {
        "source_sentence": "舍利弗聞已便生畏慎心，諸比丘知已往白世尊，世尊告言：「眾僧所差，",
        "translation": "Having heard this, Śāriputra became frightened and cautious. Knowing this, the monks went to the World-honored One. The World-honored One said:",
        "source": "T22n1428_011:0639b24_5"
    },
    {
        "source_sentence": "無犯。",
        "translation": "It's not a violation.",
        "source": "T22n1428_011:0639b26_0"
    },
    {
        "source_sentence": "自今已去當如是說戒：若比丘知他有麁惡罪，向未受大戒人說，除僧羯磨，",
        "translation": "From now on, you should explain the precepts in this way: If a monk knows that another person is guilty of sexual misconduct and speaks to someone who hasn't received the great precepts except for the saṃghāma-kāma,",
        "source": "T22n1428_011:0639b26_1"
    },
    {
        "source_sentence": "波逸提。」",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0639b28_0"
    },
    {
        "source_sentence": "比丘義如上說。",
        "translation": "The meaning of monk is as explained above.",
        "source": "T22n1428_011:0639b28_1"
    },
    {
        "source_sentence": "未受大戒者，除比丘、比丘尼，餘者是。",
        "translation": "Those who haven't received the great precepts are except monks and nuns, and the rest are monks and nuns.",
        "source": "T22n1428_011:0639b28_2"
    },
    {
        "source_sentence": "麁惡罪者，四波羅夷、僧伽婆尸沙。",
        "translation": "A debilitating sin is the four pārājikas and crimes against the saṃghâvaśeṣa.",
        "source": "T22n1428_011:0639b29_3"
    },
    {
        "source_sentence": "僧者，一羯磨、一說戒。",
        "translation": "A monk is a karman and a precept preached.",
        "source": "T22n1428_011:0639c01_4"
    },
    {
        "source_sentence": "若比丘知他有麁惡罪，向未受大戒人說，除僧羯磨，波逸提。",
        "translation": "If a monk knows that others have crude sins and speaks to someone who hasn't received the great precepts except for the saṃghāma, pratyekabuddha.",
        "source": "T22n1428_011:0639c01_5"
    },
    {
        "source_sentence": "若說了了，波逸提；",
        "translation": "If someone explains that they understand, pratyekabuddha.",
        "source": "T22n1428_011:0639c03_6"
    },
    {
        "source_sentence": "不了了者，突吉羅。",
        "translation": "Someone who doesn't understand it is a tukhila.",
        "source": "T22n1428_011:0639c03_7"
    },
    {
        "source_sentence": "除麁惡罪已，更以餘罪，向未受大戒人說者，突吉羅。",
        "translation": "If someone who removes the sin of sexual misconduct and explains it to someone who hasn't received the great precepts with other sins, that's a grave offense.",
        "source": "T22n1428_011:0639c04_8"
    },
    {
        "source_sentence": "自犯麁惡罪，向未受大戒人說者，突吉羅。",
        "translation": "If someone commits a crude and bad sin on their own and speaks to someone who hasn't received the great precepts, it's a grave offense.",
        "source": "T22n1428_011:0639c05_9"
    },
    {
        "source_sentence": "除比丘、比丘尼，以餘人麁惡罪，向未受大戒人說者，突吉羅。",
        "translation": "Except for monks and bhikṣus and bhikṣuṇīs, it's a grave offense for others to commit sexual misconduct and teach it to someone who hasn't received the great precepts, tukhila.",
        "source": "T22n1428_011:0639c06_10"
    },
    {
        "source_sentence": "麁惡罪麁惡想，波逸提。",
        "translation": "Bad thoughts of anger and bad sins, pratyekabuddha.",
        "source": "T22n1428_011:0639c07_11"
    },
    {
        "source_sentence": "麁惡罪疑，突吉羅。",
        "translation": "To doubt the blameworthiness of bad sins is a grave offense, a grave offense.",
        "source": "T22n1428_011:0639c08_12"
    },
    {
        "source_sentence": "非麁惡麁惡罪想，突吉羅。",
        "translation": "It's not the perception of crude and bad crude sins, tukhila.",
        "source": "T22n1428_011:0639c08_13"
    },
    {
        "source_sentence": "非麁惡疑，突吉羅。",
        "translation": "It's not a crude and bad doubt, tukhila.",
        "source": "T22n1428_011:0639c09_14"
    },
    {
        "source_sentence": "比丘尼，波逸提；",
        "translation": "A bhikṣuṇī is a pratyekabuddha.",
        "source": "T22n1428_011:0639c09_15"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1428_011:0639c10_16"
    },
    {
        "source_sentence": "是謂為犯。",
        "translation": "This is called a violation.",
        "source": "T22n1428_011:0639c10_17"
    },
    {
        "source_sentence": "不犯者，若不知、若眾僧差、麁惡非麁惡想，若白衣先已聞此麁惡罪，",
        "translation": "A person who doesn't violate the precepts if they don't know or if the saṃgha sends them, and if they have crude thoughts that are neither crude nor crude, or if a white-robed man has heard this crude sin before.",
        "source": "T22n1428_011:0639c11_18"
    },
    {
        "source_sentence": "無犯。",
        "translation": "It's not a violation.",
        "source": "T22n1428_011:0639c12_19"
    },
    {
        "source_sentence": "無犯者，最初未制戒，癡狂、心亂、痛惱所纏。",
        "translation": "A person who doesn't violate the precepts at first is bound by delusion, mental disturbance, and pain.",
        "source": "T22n1428_011:0639c12_20"
    },
    {
        "source_sentence": "(七竟)爾時佛在毘舍離獼猴池樓閣精舍，以此因緣集比丘僧，佛知而故問：「婆求園比丘頗實爾耶？」",
        "translation": "(After the completion of the seventh) It was then that the Buddha gathered the monks and saṃgha in Vaiśālī's monkey-pond tower monastery for this reason. Knowing this, the Buddha asked, Is it true that the monk at Vātsīputrīya Park is a monk?",
        "source": "T22n1428_011:0639c13_21"
    },
    {
        "source_sentence": "白佛言：「實爾。",
        "translation": "He said to the Buddha, Indeed.",
        "source": "T22n1428_011:0639c16_22"
    },
    {
        "source_sentence": "世尊。」",
        "translation": "Bhagavān.",
        "source": "T22n1428_011:0639c16_23"
    },
    {
        "source_sentence": "佛言：「汝等癡人！",
        "translation": "The Buddha said, You foolish people!",
        "source": "T22n1428_011:0639c16_24"
    },
    {
        "source_sentence": "真實猶不得向人說，何況不實？」",
        "translation": "It's still true and can't be explained to others, so why wouldn't it be true?",
        "source": "T22n1428_011:0639c17_25"
    },
    {
        "source_sentence": "世尊以無數方便，呵責婆求園比丘已，告諸比丘：「此癡人！",
        "translation": "After the Bhagavān had reprimanded the monk Vātsīputrīya Park with countless skillful means, he addressed the monks, This foolish man!",
        "source": "T22n1428_011:0639c17_26"
    },
    {
        "source_sentence": "多種有漏處，最初犯戒。",
        "translation": "There are many kinds of contaminated places where they first violate the precepts.",
        "source": "T22n1428_011:0639c19_27"
    },
    {
        "source_sentence": "自今已去與比丘結戒，集十句義乃至正法久住，欲說戒者當如是說：若比丘向未受大戒人說過人法，",
        "translation": "If a monk wants to preach the precepts, he should explain them in this way: “If a monk teaches superhuman qualities to someone who has not received the great precepts” [to others].",
        "source": "T22n1428_011:0639c19_28"
    },
    {
        "source_sentence": "言：『我見是、我知是。』",
        "translation": "They say, 'This is the view of self and the knowledge of self.'",
        "source": "T22n1428_011:0639c22_29"
    },
    {
        "source_sentence": "實者，波逸提。」",
        "translation": "The real one, pratyekabuddha.",
        "source": "T22n1428_011:0639c22_30"
    },
    {
        "source_sentence": "比丘義如上說。",
        "translation": "The meaning of monk is as explained above.",
        "source": "T22n1428_011:0639c23_0"
    },
    {
        "source_sentence": "未受大戒者，除比丘、比丘尼，餘者是。",
        "translation": "Those who haven't received the great precepts are except monks and nuns, and the rest are monks and nuns.",
        "source": "T22n1428_011:0639c23_1"
    },
    {
        "source_sentence": "人法者，人界、人陰、人入。",
        "translation": "A person's dharma refers to the human realm, the human aggregate, and the human entry.",
        "source": "T22n1428_011:0639c24_2"
    },
    {
        "source_sentence": "上人法者，諸法出要，自言：「得身念善思惟，有戒、有欲、有不放逸、有精進、有定、有正定、有道、有修行、有智慧、有見、有得、有果。」",
        "translation": "The superior person's teaching is that all dharmas are essential, and he says, Attaining mindfulness of body and good contemplation has precepts, desires, nonfrivolity, effort, concentration, right concentration, the path, cultivation, wisdom, insight, views, attainment, and results.",
        "source": "T22n1428_011:0639c24_3"
    },
    {
        "source_sentence": "若彼真實有此事，向未受大戒人說，了了者，波逸提；",
        "translation": "If someone really has this matter and explains it to anyone who has not received the great precepts, and understands it, pratyekabuddha.",
        "source": "T22n1428_011:0639c27_4"
    },
    {
        "source_sentence": "說而不了了者，突吉羅。",
        "translation": "Someone who speaks but doesn't understand, tukhila.",
        "source": "T22n1428_011:0639c29_0"
    },
    {
        "source_sentence": "若手印書、若作知相遣人，了了，波逸提；",
        "translation": "If someone were to write with their hand or send it to anyone who knew the characteristics, and understand them, pratyekabuddha.",
        "source": "T22n1428_011:0639c29_1"
    },
    {
        "source_sentence": "不了了，突吉羅。",
        "translation": "If you don't understand, it's a grave offense.",
        "source": "T22n1428_011:0640a01_2"
    },
    {
        "source_sentence": "若天子、阿修羅子、夜叉子、乾闥婆子、龍子、餓鬼子、畜生能變化、不能變化者，",
        "translation": "If a god, an asura, a yakṣa, a gandharva, a dragon, a hungry ghost, or an animal can change and can't change,",
        "source": "T22n1428_011:0640a01_3"
    },
    {
        "source_sentence": "向說得上人法，了了、不了了，突吉羅。",
        "translation": "It's been said that someone who has attained the higher person's teaching and understands it or doesn't understand it, tukhila.",
        "source": "T22n1428_011:0640a03_4"
    },
    {
        "source_sentence": "若實得上人法，向受大戒人非同意者說，突吉羅。",
        "translation": "If someone really attains the higher person's teaching and teaches it to someone who doesn't agree with those who receive the great precepts, that's a grave offense.",
        "source": "T22n1428_011:0640a04_5"
    },
    {
        "source_sentence": "若自稱言：「我得根、力、覺、道、禪定、解脫入三昧。」",
        "translation": "If he says to himself, I've attained faculties, powers, awakening, the path, meditation, liberation, and entering samādhi.",
        "source": "T22n1428_011:0640a05_6"
    },
    {
        "source_sentence": "向人說者，波逸提。",
        "translation": "He who teaches it to others, pratyekabuddha.",
        "source": "T22n1428_011:0640a06_7"
    },
    {
        "source_sentence": "比丘尼，波逸提；",
        "translation": "A bhikṣuṇī is a pratyekabuddha.",
        "source": "T22n1428_011:0640a07_8"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1428_011:0640a07_9"
    },
    {
        "source_sentence": "是謂為犯。",
        "translation": "This is called a violation.",
        "source": "T22n1428_011:0640a08_10"
    },
    {
        "source_sentence": "不犯者，若增上慢、若自言是業報、不言是修得，若實得上人法向同意比丘說，",
        "translation": "A person who doesn't violate the precepts is said to be overweeningly conceited, says it's the result of karma and doesn't say it's cultivation, and if he really has attained the teaching of a superior person who agrees with the teaching taught by a monk, then he'll teach it.",
        "source": "T22n1428_011:0640a08_11"
    },
    {
        "source_sentence": "若說根、力、覺、道、解脫入三昧，不向人說我得，或戲笑語獨語，若夢中語，",
        "translation": "If he teaches about faculties, powers, feelings, paths, liberations, and entering samādhi, he doesn't tell others about my attainments, or he speaks laughingly and alone, or he speaks in a dream.",
        "source": "T22n1428_011:0640a10_12"
    },
    {
        "source_sentence": "欲說此乃說彼，無犯。",
        "translation": "It's not a violation to say this and then say that.",
        "source": "T22n1428_011:0640a12_0"
    },
    {
        "source_sentence": "無犯者，最初未制戒，癡狂、心亂、痛惱所纏。",
        "translation": "A person who doesn't violate the precepts at first is bound by delusion, mental disturbance, and pain.",
        "source": "T22n1428_011:0640a12_1"
    },
    {
        "source_sentence": "(八竟)爾時佛在舍衛國祇樹給孤獨園。",
        "translation": "(8) It was then that the Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T22n1428_011:0640a13_2"
    },
    {
        "source_sentence": "爾時尊者迦留陀夷，時到著衣持鉢詣一大長者家，在姑前與兒婦耳語說法。",
        "translation": "When Venerable Kālôdayin arrived, he put on his robes and bowl and went to the house of a large elderly man who was teaching the Dharma in front of his aunt's wife and children's ears.",
        "source": "T22n1428_011:0640a14_3"
    },
    {
        "source_sentence": "姑見已即問婦言：「向比丘說何等事耶？」",
        "translation": "Seeing this, the aunt asked the woman, What did you say to the monk?",
        "source": "T22n1428_011:0640a16_4"
    },
    {
        "source_sentence": "婦報言：「與我說法。」",
        "translation": "The woman replied, Teach me the Dharma.",
        "source": "T22n1428_011:0640a17_5"
    },
    {
        "source_sentence": "姑語婦言：「若說法者，當高聲說令我等聞，云何耳中獨言耶？」",
        "translation": "The aunt said to the woman, If you teach the Dharma, you must speak loudly so that we'll hear it, so why are you speaking alone in our ears?",
        "source": "T22n1428_011:0640a18_6"
    },
    {
        "source_sentence": "其婦報言：「向者語如兄弟語無異，更無餘過失。」",
        "translation": "The woman replied, There's no difference between the words of the aforementioned and the words of the brothers, and there's nothing left to lose.",
        "source": "T22n1428_011:0640a19_7"
    },
    {
        "source_sentence": "時乞食比丘聞已，即呵責迦留陀夷言：「云何尊者於姑前與兒婦耳語說法耶？」",
        "translation": "After the begging monk heard this, he reprimanded Kālôdayin and said, How did the Bhagavān explain the teaching to his children and women in front of his aunt?",
        "source": "T22n1428_011:0640a20_8"
    },
    {
        "source_sentence": "爾時乞食比丘還至僧伽藍中，以此因緣具向諸比丘說。",
        "translation": "It was then that the begging monk returned to the monastery and explained these causes and conditions to the monks.",
        "source": "T22n1428_011:0640a22_9"
    },
    {
        "source_sentence": "其中有少欲知足、行頭陀、樂學戒、知慚愧者，譏嫌迦留陀夷：「云何尊者在姑前為他兒婦耳語說法耶？」",
        "translation": "Some of them who had few desires and were satisfied, practiced as an ascetic, enjoyed studying the precepts, and knew shamefulness criticized Kālôdayin, How did the venerable speak for the sake of the wife of another's child in front of his aunt?",
        "source": "T22n1428_011:0640a23_10"
    },
    {
        "source_sentence": "諸比丘往世尊所，頭面禮足在一面坐，以此因緣具白世尊。",
        "translation": "The monks went to the Bhagavān, bowed their foreheads and feet, and sat at one side. They reported this story to the Bhagavān.",
        "source": "T22n1428_011:0640a26_11"
    },
    {
        "source_sentence": "世尊即集比丘僧，知而故問迦留陀夷：「汝實爾於姑前與他兒婦耳語說法耶？」",
        "translation": "The Bhagavān then gathered the monks and knew and asked Kālôdayin, Is it true that you were teaching the Dharma in front of your aunt to another child's wife?",
        "source": "T22n1428_011:0640a27_12"
    },
    {
        "source_sentence": "答曰：「實爾。」",
        "translation": "He replied, Indeed.",
        "source": "T22n1428_011:0640a29_13"
    },
    {
        "source_sentence": "爾時世尊以無數方便呵責迦留陀夷：「汝所為非，非威儀、非沙門法、非淨行、非隨順行，",
        "translation": "It was then that the Bhagavān reprimanded Kālôdayin with countless skillful means, What you have done is wrong, not in terms of manner, not in terms of ascetic practices, not in terms of pure practices, and not in terms of compliant practices.",
        "source": "T22n1428_011:0640a29_14"
    },
    {
        "source_sentence": "所不應為。",
        "translation": "What shouldn't be done?",
        "source": "T22n1428_011:0640b02_15"
    },
    {
        "source_sentence": "汝云何於姑前為他兒婦耳語說法耶？」",
        "translation": "How did you explain the words of your aunt's ears to other children and women?",
        "source": "T22n1428_011:0640b03_16"
    },
    {
        "source_sentence": "呵責迦留陀夷已，告諸比丘：「此迦留陀夷癡人！",
        "translation": "After he reprimanded Kālôdayin, he told the monks, This Kālôdayin is a fool!",
        "source": "T22n1428_011:0640b04_17"
    },
    {
        "source_sentence": "多種有漏處，最初犯戒。",
        "translation": "There are many kinds of contaminated places where they first violate the precepts.",
        "source": "T22n1428_011:0640b05_18"
    },
    {
        "source_sentence": "自今已去與比丘結戒，集十句義乃至正法久住，欲說戒者當如是說：若比丘與女人說法，",
        "translation": "Those who wish to preach the precepts should explain them in this way: “If a monk teaches the Dharma to women,",
        "source": "T22n1428_011:0640b05_19"
    },
    {
        "source_sentence": "波逸提。」",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0640b07_20"
    },
    {
        "source_sentence": "如是世尊與比丘結戒。",
        "translation": "Thus, the Bhagavān and the monks formed the precepts.",
        "source": "T22n1428_011:0640b08_21"
    },
    {
        "source_sentence": "時有諸女人請諸比丘言：「唯願諸尊與我等說法。」",
        "translation": "Some women then invited the monks, saying, Please, venerable ones, explain the teaching to us.",
        "source": "T22n1428_011:0640b08_22"
    },
    {
        "source_sentence": "時諸比丘各有畏慎心，世尊制戒比丘不得與女人說法。",
        "translation": "Each of the monks then had a fearful and cautious mind, and the Bhagavān instructed the monks who observed the precepts not to teach the Dharma to women.",
        "source": "T22n1428_011:0640b09_23"
    },
    {
        "source_sentence": "諸比丘以此因緣具白世尊。",
        "translation": "The monks told the Bhagavān about this cause and condition.",
        "source": "T22n1428_011:0640b11_24"
    },
    {
        "source_sentence": "世尊告曰：「自今已去，聽諸比丘與女人五六語說法。",
        "translation": "The Bhagavān told them, From now on, listen to the five or six words of the bhikṣus and women who teach the Dharma in five or six ways.",
        "source": "T22n1428_011:0640b11_25"
    },
    {
        "source_sentence": "自今已去當如是說戒：若比丘為女人說法，過五六語，波逸提。」",
        "translation": "From now on, he'll explain the precepts in this way: If a monk teaches to women and goes beyond five or six words, pratyekabuddha.",
        "source": "T22n1428_011:0640b13_26"
    },
    {
        "source_sentence": "如是世尊與比丘結戒。",
        "translation": "Thus, the Bhagavān and the monks formed the precepts.",
        "source": "T22n1428_011:0640b14_27"
    },
    {
        "source_sentence": "諸比丘復有畏慎心，以無有知男子便休，不與女人說法。",
        "translation": "The monks were also frightened and cautious, so they stopped because there was no man who knew them to be men and didn't teach the Dharma to women.",
        "source": "T22n1428_011:0640b15_28"
    },
    {
        "source_sentence": "佛告諸比丘：「自今已去有有知男子，聽過五六語與女人說法。",
        "translation": "The Buddha told the monks, From now on, there's a man with knowledge who hears five or six words and teaches them to women.",
        "source": "T22n1428_011:0640b16_29"
    },
    {
        "source_sentence": "自今已去當如是說戒：若比丘與女人說法，過五六語，除有知男子，波逸提。」",
        "translation": "From now on, he'll explain the precepts in this way: If a monk teaches to a woman and speaks words that are more than five or six words, except for knowing men, pratyekabuddha.",
        "source": "T22n1428_011:0640b18_30"
    },
    {
        "source_sentence": "時有諸女人請諸比丘言：「大德！",
        "translation": "Some women then invited the monks, saying, Mañjuśrī!",
        "source": "T22n1428_011:0640b19_31"
    },
    {
        "source_sentence": "願授我五戒。」",
        "translation": "May you bestow on me the five precepts.",
        "source": "T22n1428_011:0640b20_32"
    },
    {
        "source_sentence": "時諸比丘有畏慎心，以無有知男子，便不與戒。",
        "translation": "The monks then became frightened and cautious, and because there were no men of knowledge, they didn't give the precepts.",
        "source": "T22n1428_011:0640b21_0"
    },
    {
        "source_sentence": "佛言：「自今已去聽無有知男子，與女人受五戒。」",
        "translation": "The Buddha said, From now on, there's no man who knows the five precepts and accepts the five precepts with women.",
        "source": "T22n1428_011:0640b22_1"
    },
    {
        "source_sentence": "時有女人請諸比丘：「大德！",
        "translation": "A woman then asked the monks, Mañjuśrī!",
        "source": "T22n1428_011:0640b23_2"
    },
    {
        "source_sentence": "為我說五戒法。」",
        "translation": "He explains the five precepts for me.",
        "source": "T22n1428_011:0640b23_3"
    },
    {
        "source_sentence": "時無有知男子，比丘有畏慎心，不與說五戒法。",
        "translation": "At the time, there were no men of knowledge, and the monk was frightened and cautious, so he didn't tell them the five precepts.",
        "source": "T22n1428_011:0640b24_4"
    },
    {
        "source_sentence": "佛告諸比丘：「自今已去聽諸比丘，無有知男子，與女人說五戒法。」",
        "translation": "The Buddha told the monks, From now on, listen to the monks as they go, for there are no men who know the five precepts and teach them to women.",
        "source": "T22n1428_011:0640b25_5"
    },
    {
        "source_sentence": "時有諸女人欲受八關齋法，諸比丘有畏慎心，以無有知男子，不與受齋法。",
        "translation": "When some women wanted to receive the eight precepts for fasting, the monks were frightened and cautious, so they didn't allow them to accept the precepts because there were no wise men.",
        "source": "T22n1428_011:0640b27_0"
    },
    {
        "source_sentence": "佛告諸比丘：「自今已去聽諸比丘，無有知男子，與女人受八關齋法。」",
        "translation": "The Buddha told the monks, From now on, listen to the monks as they go. There are no men or women who know the eight precepts and receive the eight precepts with women.",
        "source": "T22n1428_011:0640b28_1"
    },
    {
        "source_sentence": "時諸女人請諸比丘：「大德！",
        "translation": "The women then invited the monks, Mañjuśrī!",
        "source": "T22n1428_011:0640c01_2"
    },
    {
        "source_sentence": "為我說八關齋法。」",
        "translation": "Explain the eight precepts for me.",
        "source": "T22n1428_011:0640c02_3"
    },
    {
        "source_sentence": "時無有知男子，比丘畏慎心，不與說八關齋法。",
        "translation": "There were no men of knowledge at the time, and the monk was afraid to be cautious and didn't explain the eight precepts.",
        "source": "T22n1428_011:0640c02_4"
    },
    {
        "source_sentence": "佛告諸比丘：「自今已去聽諸比丘，無有知男子，與女人說八關齋法。」",
        "translation": "The Buddha told the monks, From now on, listen to the monks as they go. There are no knowing men who teach women the eight precepts for fasting.",
        "source": "T22n1428_011:0640c03_5"
    },
    {
        "source_sentence": "爾時諸女人白諸比丘：「大德！",
        "translation": "It was then that the women said to the monks, Great virtuous one!",
        "source": "T22n1428_011:0640c05_6"
    },
    {
        "source_sentence": "我等欲聞八賢聖道法。」",
        "translation": "We want to hear the teaching of the eight noble paths of goodness.",
        "source": "T22n1428_011:0640c05_7"
    },
    {
        "source_sentence": "時無有知男子，比丘心有畏慎，不與說八聖道法。",
        "translation": "There was no knowing man at the time, and the monk's mind was fearful and cautious, so he didn't explain the teaching of the eight noble paths.",
        "source": "T22n1428_011:0640c06_8"
    },
    {
        "source_sentence": "佛告諸比丘：「自今已去聽比丘，無有知男子，與女人說八聖道法。」",
        "translation": "The Buddha told the monks, From now on, there's no knowing man to listen to a monk who goes away and teaches women the eight noble principles of the path.",
        "source": "T22n1428_011:0640c07_9"
    },
    {
        "source_sentence": "時有諸女人白諸比丘言：「大德！",
        "translation": "Some women then said to the monks, Mañjuśrī!",
        "source": "T22n1428_011:0640c09_10"
    },
    {
        "source_sentence": "為我說十不善法。」",
        "translation": "Explain the ten unwholesome qualities for me.",
        "source": "T22n1428_011:0640c09_11"
    },
    {
        "source_sentence": "時無有知男子，比丘心有畏慎，不與說十不善法。",
        "translation": "There was no knowing man at the time, and the monk's mind was fearful and cautious, so he didn't explain the ten unwholesome qualities.",
        "source": "T22n1428_011:0640c10_12"
    },
    {
        "source_sentence": "佛告諸比丘：「自今已去聽諸比丘，無有知男子，與女人說十不善法。」",
        "translation": "The Buddha told the monks, From now on, listen to the monks as they go, for there's no knowing man who teaches women the ten unwholesome qualities.",
        "source": "T22n1428_011:0640c11_13"
    },
    {
        "source_sentence": "時有諸女人白諸比丘：「大德！",
        "translation": "Some women then said to the monks, Mañjuśrī!",
        "source": "T22n1428_011:0640c13_14"
    },
    {
        "source_sentence": "為我等說十善法。」",
        "translation": "He explains the ten good qualities for us.",
        "source": "T22n1428_011:0640c14_0"
    },
    {
        "source_sentence": "諸比丘有畏慎心，無有知男子，不與說十善法。",
        "translation": "The monks were fearful and cautious, and there were no men of knowledge who didn't teach the ten good qualities to them.",
        "source": "T22n1428_011:0640c14_1"
    },
    {
        "source_sentence": "佛告諸比丘：「自今已去聽諸比丘，無有知男子，與女人說十善法。」",
        "translation": "The Buddha told the monks, From now on, listen to the monks as they go, for there's no knowing man who teaches women the ten good qualities.",
        "source": "T22n1428_011:0640c15_2"
    },
    {
        "source_sentence": "時有諸女人來問諸比丘義，比丘有畏慎心，以無有知男子，不答諸女人問義。",
        "translation": "When some women came and asked the monks what they meant, the monks were frightened and cautious, because there were no men of knowledge who didn't answer the women's questions.",
        "source": "T22n1428_011:0640c17_3"
    },
    {
        "source_sentence": "佛告比丘：「自今已去聽無有知男子，答諸女人問義。",
        "translation": "The Buddha told the monks, From now on, there's no knowing man to listen and answer the meaning of the women's questions.",
        "source": "T22n1428_011:0640c19_0"
    },
    {
        "source_sentence": "若不解當廣為說。",
        "translation": "If you don't understand it, you should explain it in detail.",
        "source": "T22n1428_011:0640c20_1"
    },
    {
        "source_sentence": "自今已去欲說戒者當如是說：若比丘與女人說法，過五六語，除有知男子，",
        "translation": "If a monk who wants to preach the precepts from now on, he should explain them in this way: “When a monk teaches the Dharma to women, he goes beyond five or six [words] except for those who have knowledge of men.",
        "source": "T22n1428_011:0640c20_2"
    },
    {
        "source_sentence": "波逸提。」",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0640c22_3"
    },
    {
        "source_sentence": "比丘義如上說。",
        "translation": "The meaning of monk is as explained above.",
        "source": "T22n1428_011:0640c22_4"
    },
    {
        "source_sentence": "女人亦如上說。",
        "translation": "The woman is likewise as explained above.",
        "source": "T22n1428_011:0640c23_0"
    },
    {
        "source_sentence": "五語者，色無我、受想行識無我。",
        "translation": "The five words mean that form is without self and feeling, perception, volition, and consciousness are without self.",
        "source": "T22n1428_011:0640c23_1"
    },
    {
        "source_sentence": "六語者，眼無常、耳鼻舌身意無常。",
        "translation": "The six kinds of speech are impermanent for the eye and impermanent for the ear, nose, tongue, body, and mind.",
        "source": "T22n1428_011:0640c24_2"
    },
    {
        "source_sentence": "有知男子者，解麁惡、不麁惡事。",
        "translation": "Someone who knows that a man understands crude and not crude bad things.",
        "source": "T22n1428_011:0640c24_3"
    },
    {
        "source_sentence": "若比丘為女人說法過五六語，除有知男子，說而了了者，波逸提；",
        "translation": "If a monk expounds the doctrine for women in five or six syllables and, with the exception of men who have knowledge, explains it but understands it, pratyekabuddha.",
        "source": "T22n1428_011:0640c25_4"
    },
    {
        "source_sentence": "不了了者，突吉羅。",
        "translation": "Someone who doesn't understand it is a tukhila.",
        "source": "T22n1428_011:0640c27_5"
    },
    {
        "source_sentence": "若天女、阿修羅女、龍女、夜叉女、乾闥婆女、餓鬼女、畜生女能變化者，",
        "translation": "If goddesses, asura maidens, dragon maidens, yakṣa maidens, gandharva maidens, hungry ghost maidens, and animals maidens can transform themselves,",
        "source": "T22n1428_011:0640c27_6"
    },
    {
        "source_sentence": "為說過五六語，了了、不了了，突吉羅。",
        "translation": "If someone speaks five or six words that they understand and don't understand, it's a grave offense.",
        "source": "T22n1428_011:0640c29_7"
    },
    {
        "source_sentence": "畜生中有不能變化者，為說過五六語，一切突吉羅。",
        "translation": "Among animals, there are those who can't change and say anything more than five or six words for them, all the tukhilas.",
        "source": "T22n1428_011:0640c29_8"
    },
    {
        "source_sentence": "比丘尼，波逸提；",
        "translation": "A bhikṣuṇī is a pratyekabuddha.",
        "source": "T22n1428_011:0641a02_9"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1428_011:0641a02_10"
    },
    {
        "source_sentence": "是謂為犯。",
        "translation": "This is called a violation.",
        "source": "T22n1428_011:0641a03_11"
    },
    {
        "source_sentence": "不犯者，若五六語，有知男子前過說；",
        "translation": "A person who doesn’t violate the precepts is if he speaks five or six words and there are people who know what a man has said in front of him.",
        "source": "T22n1428_011:0641a03_12"
    },
    {
        "source_sentence": "若無有知男子前，授優婆夷五戒，及說五戒法，與八關齋法，說八齋法，",
        "translation": "If someone doesn't know the five precepts for a layman who teaches the five precepts and explains the five precepts in front of a man, or the eight precepts for an upāsaka who teaches the eight precepts together with the eight precepts.",
        "source": "T22n1428_011:0641a04_13"
    },
    {
        "source_sentence": "及說八聖道法，為說十不善法，十善法及女人問義，如是無有知男子應答，",
        "translation": "He teaches the eightfold noble path, explains the ten unwholesome dharmas, the ten wholesome dharmas, and the meaning of women’s questions. In this way, there is no knowing man to answer.",
        "source": "T22n1428_011:0641a05_14"
    },
    {
        "source_sentence": "若不解得廣為說。",
        "translation": "If someone doesn't understand it, they can explain it in detail.",
        "source": "T22n1428_011:0641a07_15"
    },
    {
        "source_sentence": "若戲笑語、疾疾語、獨語夢中語、欲說此乃說彼，無犯。",
        "translation": "It's not a violation if he speaks laughingly, speaking quickly, speaking alone, speaking in a dream, or speaking here when he wants to say this and then speaking there.",
        "source": "T22n1428_011:0641a08_16"
    },
    {
        "source_sentence": "無犯者，最初未制戒，癡狂、心亂、痛惱所纏。",
        "translation": "A person who doesn't violate the precepts at first is bound by delusion, mental disturbance, and pain.",
        "source": "T22n1428_011:0641a09_17"
    },
    {
        "source_sentence": "(九竟)◎◎爾時佛在曠野城。",
        "translation": "(End of Nine) At the time, the Buddha was in the wilderness city.",
        "source": "T22n1428_011:0641a10_18"
    },
    {
        "source_sentence": "時六群比丘與佛修治講堂，遶堂周匝自掘地。",
        "translation": "Six groups of monks and the Buddha then cultivated the lecture hall with six groups of monks, circumambulated the hall, and dug their own ground all around it.",
        "source": "T22n1428_011:0641a11_19"
    },
    {
        "source_sentence": "時諸長者見譏嫌言：「沙門釋子不知慚恥斷他命根，外自稱言：『我知正法。』",
        "translation": "When the elders saw this, they criticized him, saying, The ascetic or Śākyamuni doesn't know shame and cut off the life root of others, and outsiders claim to say, 'I know the right teaching.'",
        "source": "T22n1428_011:0641a12_20"
    },
    {
        "source_sentence": "如今觀之有何正法？",
        "translation": "What's the right teaching for observing it now?",
        "source": "T22n1428_011:0641a14_21"
    },
    {
        "source_sentence": "而自掘地斷他命根。」",
        "translation": "He digs out his own ground and cuts off the life root of others.",
        "source": "T22n1428_011:0641a14_22"
    },
    {
        "source_sentence": "諸比丘聞，其中有少欲知足、行頭陀、樂學戒、知慚愧者，譏嫌六群比丘言：「云何為佛修治講堂自掘地，",
        "translation": "When the monks heard this, some of them who had few desires and were contentious, practiced asceticism, enjoyed studying the precepts, and knew shamefulness criticized the six groups of monks, saying, How did you cultivate yourselves in the assembly hall for the Buddha?",
        "source": "T22n1428_011:0641a15_23"
    },
    {
        "source_sentence": "使諸長者譏嫌耶？」",
        "translation": "Does it cause the elders to criticize him?",
        "source": "T22n1428_011:0641a17_24"
    },
    {
        "source_sentence": "諸比丘即往世尊所，頭面禮足在一面坐，以此因緣具白世尊。",
        "translation": "The monks then went to the Bhagavān, bowed their heads and feet, and sat at one side. They reported this story to the Bhagavān.",
        "source": "T22n1428_011:0641a18_25"
    },
    {
        "source_sentence": "世尊爾時以無數方便呵責六群比丘：「汝所為非，非威儀、非沙門法、非淨行、非隨順行，",
        "translation": "The Bhagavān then reprimanded the six groups of monks with countless skillful means, saying, What you're doing is wrong, not according to your manner, not according to the rules of ascetics, not pure practices, and not compliant practices.",
        "source": "T22n1428_011:0641a19_26"
    },
    {
        "source_sentence": "所不應為。",
        "translation": "What shouldn't be done?",
        "source": "T22n1428_011:0641a21_27"
    },
    {
        "source_sentence": "云何自掘地使諸長者譏嫌耶？」",
        "translation": "How did he dig himself up the ground so that the elders would criticize him?",
        "source": "T22n1428_011:0641a22_28"
    },
    {
        "source_sentence": "世尊以無數方便呵責六群比丘已，告諸比丘：「此癡人！",
        "translation": "After the Bhagavān had reprimanded the six groups of monks with countless skillful means, he addressed the monks, This foolish man!",
        "source": "T22n1428_011:0641a22_29"
    },
    {
        "source_sentence": "多種有漏處，最初犯戒。",
        "translation": "There are many kinds of contaminated places where they first violate the precepts.",
        "source": "T22n1428_011:0641a24_30"
    },
    {
        "source_sentence": "自今已去與比丘結戒，集十句義乃至正法久住，欲說戒者當如是說：若比丘自手掘地，",
        "translation": "Those who wish to preach the precepts should explain them in this way: “If a monk digs up a ground with his own hands,",
        "source": "T22n1428_011:0641a24_31"
    },
    {
        "source_sentence": "波逸提。」",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0641a26_32"
    },
    {
        "source_sentence": "如是世尊與比丘結戒。",
        "translation": "Thus, the Bhagavān and the monks formed the precepts.",
        "source": "T22n1428_011:0641a27_0"
    },
    {
        "source_sentence": "爾時六群比丘修治講堂教人掘地言：「掘是、置是。」",
        "translation": "It was then that six groups of monks repaired the lecture hall and taught them to dig up the ground, saying, Dig it up and leave it there.",
        "source": "T22n1428_011:0641a27_1"
    },
    {
        "source_sentence": "時諸長者見已譏嫌：「云何沙門釋子不知慚愧，教人掘地，斷他命無有慈心。",
        "translation": "Seeing this, the elders ridiculed him, saying, Why doesn't the ascetic or Śākyamuni know shame and teach people to dig up a place where they cut off others' lives without compassion?",
        "source": "T22n1428_011:0641a28_2"
    },
    {
        "source_sentence": "自稱：『我知正法。』",
        "translation": "They declare themselves, 'I know the right teaching.'",
        "source": "T22n1428_011:0641b01_3"
    },
    {
        "source_sentence": "如今觀之何有正法？」",
        "translation": "How could there be a right teaching in observing it now?",
        "source": "T22n1428_011:0641b02_0"
    },
    {
        "source_sentence": "爾時諸比丘聞已，其中有少欲知足、行頭陀、樂學戒、知慚愧者，譏嫌六群比丘：「云何修治佛講堂教人掘地言：『掘是、置是。』",
        "translation": "After the monks heard this, some of them who had few desires and were satisfied, practiced as an ascetic, enjoyed studying precepts, and knew modesty criticized the six groups of monks, How did they cultivate the Buddha's lecture hall and teach people to dig up the ground, saying,'Dig it up and leave it here.'",
        "source": "T22n1428_011:0641b02_1"
    },
    {
        "source_sentence": "使諸長者譏嫌耶？」",
        "translation": "Does it cause the elders to criticize him?",
        "source": "T22n1428_011:0641b05_2"
    },
    {
        "source_sentence": "呵責已，往世尊所，頭面禮足在一面坐，以此因緣具白世尊。",
        "translation": "After he had been reprimanded, he went to the Bhagavān, bowed his head and feet, and sat at one side. He told the Bhagavān exactly this story.",
        "source": "T22n1428_011:0641b05_3"
    },
    {
        "source_sentence": "世尊即集比丘僧，呵責六群比丘：「汝所為非，非威儀、非沙門法、非淨行、非隨順行，",
        "translation": "The Bhagavān then assembled the monks and reprimanded the six groups of monks, saying, What you have done is wrong, not with deportment, not according to the teachings of a renunciant, not pure practice, not compliant practice.",
        "source": "T22n1428_011:0641b07_4"
    },
    {
        "source_sentence": "所不應為。",
        "translation": "What shouldn't be done?",
        "source": "T22n1428_011:0641b09_5"
    },
    {
        "source_sentence": "云何修治講堂，教人掘地言：『掘是、置是。』",
        "translation": "How does he cultivate the lecture hall and teach people to dig up the ground, saying,'Dig it up and leave it here.'",
        "source": "T22n1428_011:0641b09_6"
    },
    {
        "source_sentence": "使諸長者譏嫌耶？」",
        "translation": "Does it cause the elders to criticize him?",
        "source": "T22n1428_011:0641b10_7"
    },
    {
        "source_sentence": "世尊以無數方便呵責已，告諸比丘：「自今已去與比丘結戒：若比丘自手掘地、若教人掘者，",
        "translation": "After the Bhagavān had rebuked them with countless skillful means, he told the monks, From now on, I'll conclude the precepts with the monks: If a monk digs up earth with his own hands or teaches someone else to dig it,",
        "source": "T22n1428_011:0641b11_0"
    },
    {
        "source_sentence": "波逸提。」",
        "translation": "pratyekabuddha.",
        "source": "T22n1428_011:0641b13_1"
    },
    {
        "source_sentence": "比丘義如上說。",
        "translation": "The meaning of monk is as explained above.",
        "source": "T22n1428_011:0641b13_2"
    },
    {
        "source_sentence": "地者，已掘地、未掘地。",
        "translation": "A ground is a ground that has been dug and a ground that hasn't been dug.",
        "source": "T22n1428_011:0641b13_3"
    },
    {
        "source_sentence": "若已掘地經四月，被雨漬還如本，若用鋤或以钁斲、或以椎打、或以鎌刀刺，",
        "translation": "If he has dug the ground for four months, and is wet by rain and returned to his original condition, he'll use a plow or hammer, beaten with a hammer, struck with a hammer, or stabbed with a sickle.",
        "source": "T22n1428_011:0641b14_4"
    },
    {
        "source_sentence": "乃至指爪搯傷地，一切波逸提。",
        "translation": "It goes so far as to touch the ground with their fingernails and nails, all pāyattika.",
        "source": "T22n1428_011:0641b16_5"
    },
    {
        "source_sentence": "打橛入地者，波逸提。",
        "translation": "Someone who strikes and enters the ground, pratyekabuddha.",
        "source": "T22n1428_011:0641b16_6"
    },
    {
        "source_sentence": "地上然火，波逸提。",
        "translation": "The earth is still on fire, pratyekabuddha.",
        "source": "T22n1428_011:0641b17_7"
    },
    {
        "source_sentence": "地有地想，波逸提。",
        "translation": "The earth has conceptions of earth, pratyekabuddha.",
        "source": "T22n1428_011:0641b17_8"
    },
    {
        "source_sentence": "若不教言：「看是知是。」",
        "translation": "If someone doesn't teach it, they'll say, Look at this and know it's right.",
        "source": "T22n1428_011:0641b18_9"
    },
    {
        "source_sentence": "突吉羅。",
        "translation": "Tukhāra.",
        "source": "T22n1428_011:0641b18_10"
    },
    {
        "source_sentence": "比丘尼，波逸提；",
        "translation": "A bhikṣuṇī is a pratyekabuddha.",
        "source": "T22n1428_011:0641b18_11"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1428_011:0641b19_12"
    },
    {
        "source_sentence": "是謂為犯。",
        "translation": "This is called a violation.",
        "source": "T22n1428_011:0641b20_0"
    },
    {
        "source_sentence": "不犯者，若語言：「知是看是。」",
        "translation": "If someone who doesn't violate the precepts says, Know that this is to look at it.",
        "source": "T22n1428_011:0641b20_1"
    },
    {
        "source_sentence": "若曳材木、曳竹，若蘺倒地扶正，若反塼石取牛屎取崩岸土，若取鼠壤土，",
        "translation": "If he drags lumber, wood, or drags bamboo, or if he climbs up and down the ground to support it, or if he takes cow dung from a broken piece of dirt that's not grasped, or if he takes dirt made of rat soil,",
        "source": "T22n1428_011:0641b20_2"
    },
    {
        "source_sentence": "若除經行處土，若除屋內土，若來往經行，若掃地，若杖築地，若不故掘，",
        "translation": "If he removes the dirt where he walks, if he removes the dirt inside his house, or goes back and forth to walk, sweeps up dirt, builds dirt with a walking stick, or doesn’t dig dirt.",
        "source": "T22n1428_011:0641b22_3"
    },
    {
        "source_sentence": "一切不犯。",
        "translation": "It's not a violation at all.",
        "source": "T22n1428_011:0641b24_4"
    },
    {
        "source_sentence": "不犯者，最初未制戒，癡狂、心亂、痛惱所纏。",
        "translation": "A person who doesn't violate the precepts at first is bound by delusion, mental disturbance, and pain.",
        "source": "T22n1428_011:0641b24_5"
    },
    {
        "source_sentence": "(十竟)◎四分律卷第十一",
        "translation": "(ten complete) ◎ Sifen lü, vol. 11",
        "source": "T22n1428_011:0641b25_6"
    }
]