[
    {
        "source_sentence": "摩訶僧祇律卷第二十三",
        "translation": "Mahāsāṃghika-vinaya, Volume 23",
        "source": "T22n1425_023:0412b19_0"
    },
    {
        "source_sentence": "東晉天竺三藏佛陀跋陀羅",
        "translation": "Buddhabhadra of the Tripiṭaka of India in the Eastern Jin Dynasty",
        "source": "T22n1425_023:0412b21_0"
    },
    {
        "source_sentence": "共法顯譯",
        "translation": "Simultaneous Translation of the Dharma-Expository",
        "source": "T22n1425_023:0412b22_0"
    },
    {
        "source_sentence": "明雜誦跋渠法之一",
        "translation": "Mañjuśrī's mixed recitation of the one part of the vajra teaching",
        "source": "T22n1425_023:0412b23_0"
    },
    {
        "source_sentence": "世尊成道五年，比丘僧悉清淨，自是已後漸漸為非，世尊隨事為制戒，立說波羅提木叉四種具足法：自具足、善來具足、十眾具足、五眾具足。",
        "translation": "In the fifth year after the World-honored One had accomplished enlightenment, all the monks and nuns became completely pure. After that, gradually becoming non-Buddhist, the World-honored One established four kinds of prātimokṣa precepts for the sake of discipline in accordance with circumstances: those who are self-sufficient, those who come from a good source of support, those who are fully endo",
        "source": "T22n1425_023:0412b24_0"
    },
    {
        "source_sentence": "自具足者，世尊在菩提樹下，最後心廓然大悟，自覺妙證善具足，如線經中廣說，是名自具足。",
        "translation": "Self-contained means that the Bhagavān was at the foot of the bodhi tree, his final mind clear and greatly enlightened, self-realized and well-contained, as explained in detail in the thread sūtras, which is called self-contained.",
        "source": "T22n1425_023:0412b27_1"
    },
    {
        "source_sentence": "善來具足者，佛住王舍城迦蘭陀竹園，佛告諸比丘：「如來處處度人，比丘、比丘尼、優婆塞、優婆夷，汝等亦當効如來廣行度人。」",
        "translation": "Suppose the well-come one is fully endowed, and the Buddha lives in the Kalandaka's bamboo grove in Rājagṛha, and the Buddha tells the monks, The Tathāgata saves people everywhere, and you monks, nuns, laymen, and laymen, you should also work with the Tathāgata to save people.",
        "source": "T22n1425_023:0412b29_2"
    },
    {
        "source_sentence": "爾時諸比丘聞世尊教已遊行諸國，見有信善男子求出家者，諸比丘亦斆如來喚：「善來比丘。」",
        "translation": "After the monks heard the Bhagavān's teaching, they traveled to various countries and saw faithful good men who were seeking to leave home, and the monks also pityed the Tathāgata and called out to them, Well-coming monks.",
        "source": "T22n1425_023:0412c03_3"
    },
    {
        "source_sentence": "度人出家。",
        "translation": "He liberates people and leaves home.",
        "source": "T22n1425_023:0412c05_4"
    },
    {
        "source_sentence": "威儀進止，左右顧視，著衣持鉢，皆不如法，為世人所譏，作是言：「世尊所度善來比丘，威儀進止，左右顧視，著衣持鉢，皆悉如法。",
        "translation": "The monks, dressed in the proper robes and holding bowls, were all acting in accordance with the Dharma. Having been criticized by the people of the world, they said, “The World-honored One, the well-come bhikṣu whom you have liberated, is dressed in the proper robes and bearing bowls.",
        "source": "T22n1425_023:0412c05_5"
    },
    {
        "source_sentence": "諸比丘所度，亦名善來，威儀進止，左右顧視，著衣持鉢，皆不如法。」",
        "translation": "The monks who are liberated are also called well-come, whose manner is so dignified that they look at each other from left to right and put on their robes and bowls in ways that aren't according to the rules.",
        "source": "T22n1425_023:0412c08_6"
    },
    {
        "source_sentence": "爾時尊者舍利弗聞是語已，在閑靜處加趺而坐作是思惟：「俱是善來，何故世尊所度善來比丘，皆悉如法；",
        "translation": "Having heard these words, Venerable Sāriputta sat cross-legged in a secluded place and thought:",
        "source": "T22n1425_023:0412c09_7"
    },
    {
        "source_sentence": "諸比丘所度善來比丘，皆不如法？",
        "translation": "The well-come bhikṣus whom the monks have liberated are all not in accordance with the Dharma?",
        "source": "T22n1425_023:0412c12_8"
    },
    {
        "source_sentence": "云何令諸比丘度人善受具足，皆悉如法，共一戒、一竟、一住、一食、一學、一說。」",
        "translation": "How can you cause the monks to liberate people and well-acquire them, all in accordance with the teaching, by sharing one precept, one completion, one abode, one food, one training, and one teaching?",
        "source": "T22n1425_023:0412c13_9"
    },
    {
        "source_sentence": "舍利弗晡時從禪覺已往詣佛所，頭面禮足，却坐一面，白佛言：「世尊！",
        "translation": "Śāriputra then, having awakened from meditation, approached the Buddha. After venerating him by bowing his forehead at his feet, he sat to one side and said to the Buddha:",
        "source": "T22n1425_023:0412c14_10"
    },
    {
        "source_sentence": "我向靜處作是思惟：『俱名善來，何故世尊所度皆悉如法；",
        "translation": "Going toward the secluded place, I thought: They are all called “well-come.” Why is it so? The World-honored One’s rescue of them all follows the Dharma.",
        "source": "T22n1425_023:0412c16_11"
    },
    {
        "source_sentence": "諸比丘所度皆不如法？",
        "translation": "What the monks save is not according to the Dharma?",
        "source": "T22n1425_023:0412c17_12"
    },
    {
        "source_sentence": "云何使諸比丘度人善受具足，皆悉如法，共一戒、一竟、一住、一食、一學、一說。』",
        "translation": "How can it be that monks who liberate people and well-accompanied them are all fully endowed with one precept, one completion, one abode, one food, one training, and one teaching together according to the teaching?'",
        "source": "T22n1425_023:0412c18_13"
    },
    {
        "source_sentence": "唯願世尊具為解說。」",
        "translation": "Please, Bhagavān, explain it for me.",
        "source": "T22n1425_023:0412c20_14"
    },
    {
        "source_sentence": "佛告舍利弗：「如來所度阿若憍陳如等五人，善來出家善受具足，共一戒、一竟、一住、一食、一學、一說，次度滿慈子等三十人，次度波羅奈城善勝子，次度優樓頻螺迦葉五百人，次度那提迦葉三百人，次度伽耶迦葉二百人，次度優波斯那等二百五十人，次度汝、大目連各二百五十人，次度摩訶迦葉、闡陀、迦留陀夷、優波離，次度釋種子五百人，次度跋度帝五百人，次度群賊五百人，次度長者子善來。",
        "translation": "The Buddha told Śāriputra, The five people whom the Tathāgata had liberated were called Ājñāta-kauṇḍinya and so forth, who came to renounce household life and became well ordained. They shared one precept, one rule, one practice, one abode, one meal, one discipline, one discourse, thirty [monks] like Pūrṇa Maitrāyaniputra; they then liberated",
        "source": "T22n1425_023:0412c20_15"
    },
    {
        "source_sentence": "如是等如來所度善來比丘，出家善受具足，共一戒、一竟、一住、一食、一學、一說。",
        "translation": "Good-coming monks like these, who had been liberated by the Tathāgata, renounced home and were well ordained, shared one precept, one completion, one abode, one food, one training, and one teaching.",
        "source": "T22n1425_023:0412c29_16"
    },
    {
        "source_sentence": "舍利弗！",
        "translation": "Śāriputra!",
        "source": "T22n1425_023:0413a02_17"
    },
    {
        "source_sentence": "諸比丘所可度人，亦名善來，出家善受具足，乃至共一說，是名善來受具足十眾受具足者。」",
        "translation": "The people that the monks can save are also called well-comers, renunciants who are well-accompanied and fully ordained, or even those who say one thing together, which is called well-accompanied and fully ordained by the ten members of the congregation.",
        "source": "T22n1425_023:0413a02_18"
    },
    {
        "source_sentence": "佛告舍利弗：「從今日制受具足法，十眾和合、一白三羯磨無遮法，是名善受具足。」",
        "translation": "The Buddha told Śāriputra, From today, the rules for accepting the full set of precepts, the ten congregations are harmonized, and one white-and-three karmas are unobstructed by the Dharma, which is called well-accompanied.",
        "source": "T22n1425_023:0413a04_19"
    },
    {
        "source_sentence": "欲受具足人初入僧中，一一頭面禮僧足已，先求和上。",
        "translation": "Those who want to receive the full set of precepts first enter the saṃgha, bowed their heads and faces one by one at the feet of the saṃgha, and then asked for a monk's permission.",
        "source": "T22n1425_023:0413a06_20"
    },
    {
        "source_sentence": "偏袒右肩，胡跪接足，作是言：「我從尊乞求和上，尊為我作和上，與我受具足。」",
        "translation": "He bared his right shoulder, knelt down at my feet, and said, I beg from the venerable to make a pact for me, and the venerable will make a pact for me and give me the full set of food.",
        "source": "T22n1425_023:0413a07_21"
    },
    {
        "source_sentence": "如是至三。",
        "translation": "Thus, it's up to three.",
        "source": "T22n1425_023:0413a09_22"
    },
    {
        "source_sentence": "和上應語：「發喜心。」",
        "translation": "The monk should say, Aroused with joy.",
        "source": "T22n1425_023:0413a09_23"
    },
    {
        "source_sentence": "答言：「我頂戴持。」",
        "translation": "He replied, I'll carry it on my head.",
        "source": "T22n1425_023:0413a10_24"
    },
    {
        "source_sentence": "和上先已與求衣鉢、與求眾、與求戒師、與求空靜處教師，推與眾僧。",
        "translation": "Venerable Vātsīputrīya had previously offered robes and bowls to those who asked for them, clothing and bowls to those who asked for them, religious precepts to those who asked for them, and teacher in an empty and quiet place to those who asked for them to be given to the saṃgha.",
        "source": "T22n1425_023:0413a10_25"
    },
    {
        "source_sentence": "羯磨師應問：「誰與某甲空靜處作教師。」",
        "translation": "The karma master should ask, Who will be the teacher for a certain person's place of emptiness and stillness?",
        "source": "T22n1425_023:0413a12_0"
    },
    {
        "source_sentence": "答言：「我能。」",
        "translation": "He replied, I can.",
        "source": "T22n1425_023:0413a12_1"
    },
    {
        "source_sentence": "羯磨師應作是說：「大德僧聽！",
        "translation": "The karma master should say, Listen, great virtuous monks!",
        "source": "T22n1425_023:0413a13_2"
    },
    {
        "source_sentence": "某甲從某甲受具足，若僧時到，僧某甲、和上某甲、某甲能空靜處作教師。",
        "translation": "Suppose a certain person receives the full set of precepts from a certain person, and if the saṃgha arrives at the right time, a certain person in the saṃgha, a certain person in the upper chamber, or a certain person can become a teacher in an empty and quiet place.",
        "source": "T22n1425_023:0413a13_3"
    },
    {
        "source_sentence": "諸大德聽！",
        "translation": "Listen, great virtuous ones!",
        "source": "T22n1425_023:0413a15_4"
    },
    {
        "source_sentence": "某甲、和上某甲、某甲能空靜處作教師，僧忍默然故，是事如是持。」",
        "translation": "A certain person, a superior person, or a certain person can be a teacher in an empty and quiet place, and the saṃgha tolerates silence because it's thus maintained.",
        "source": "T22n1425_023:0413a15_5"
    },
    {
        "source_sentence": "教師應將離眾不近不遠。",
        "translation": "The teacher should be about to leave the congregation, not near or far from it.",
        "source": "T22n1425_023:0413a17_6"
    },
    {
        "source_sentence": "教有二種：若略、若廣。",
        "translation": "There are two kinds of teaching: whether abbreviated or extensive.",
        "source": "T22n1425_023:0413a17_7"
    },
    {
        "source_sentence": "云何略？",
        "translation": "What's brief?",
        "source": "T22n1425_023:0413a18_8"
    },
    {
        "source_sentence": "今僧中當問：「汝有者言有、無者言無。」",
        "translation": "Now, the saṃgha will ask, If you have it, say yes; if you don't, say no.",
        "source": "T22n1425_023:0413a18_9"
    },
    {
        "source_sentence": "云何廣？",
        "translation": "What's the breadth?",
        "source": "T22n1425_023:0413a19_10"
    },
    {
        "source_sentence": "如後僧中一一說。",
        "translation": "It's as explained one by one in the subsequent saṃgha.",
        "source": "T22n1425_023:0413a19_11"
    },
    {
        "source_sentence": "教師來入僧中，白言：「某甲問已訖，自說清淨無遮法。」",
        "translation": "The teacher came into the saṃgha and said, After I've asked this question, that certain person will explain for himself the pure and unobstructed Dharma.",
        "source": "T22n1425_023:0413a19_12"
    },
    {
        "source_sentence": "羯磨師應作是說：「大德僧聽！",
        "translation": "The karma master should say, Listen, great virtuous monks!",
        "source": "T22n1425_023:0413a21_13"
    },
    {
        "source_sentence": "某甲從某甲受具足，某甲已空靜處教問訖。",
        "translation": "A certain person has received the full set of precepts from a certain person, and a certain person has finished asking questions in an empty and quiet place.",
        "source": "T22n1425_023:0413a21_14"
    },
    {
        "source_sentence": "若僧時到，僧某甲和上某甲，某甲聽入僧中。",
        "translation": "If the saṃgha arrives at the time, a certain person in the saṃgha and a certain person in the superior councilor of the saṃgha will be allowed to enter the saṃgha.",
        "source": "T22n1425_023:0413a22_15"
    },
    {
        "source_sentence": "諸大德聽！",
        "translation": "Listen, great virtuous ones!",
        "source": "T22n1425_023:0413a23_16"
    },
    {
        "source_sentence": "某甲、和上某甲、某甲聽入僧中，僧忍默然故，是事如是持。」",
        "translation": "A certain person, a superior person, or a certain person listens to the saṃgha's entry into the saṃgha because the saṃgha tolerates silence and thus maintains this kind of thing.",
        "source": "T22n1425_023:0413a24_17"
    },
    {
        "source_sentence": "欲受戒人應入僧中，一一頭面禮僧足已，在戒師前，胡跪合掌，授與衣鉢，教受，作是言：「此是我鉢多羅，應量受用，乞食器，今受持。」",
        "translation": "Those who want to receive the precepts should enter the saṃgha, bowed their heads and feet one by one at the feet of the saṃgha, knelt down in front of the preceptor, joined their palms, gave them robes and bowls, taught them to receive them, and said, This is my almsbowl, which should be used for measuring it, begged for a food container, and",
        "source": "T22n1425_023:0413a25_18"
    },
    {
        "source_sentence": "如是三說。",
        "translation": "These are the three teachings.",
        "source": "T22n1425_023:0413a28_19"
    },
    {
        "source_sentence": "「此是僧伽梨、此是欝多羅僧、此是安陀會，此是我三衣，此三衣不離宿受持。」",
        "translation": "These are the three robes of the saṃghāṭika, this is the kṣatāra-saṃgha, this is the undergarbha assembly, and these are my three robes; these three robes won't be received and maintained without leaving the night.",
        "source": "T22n1425_023:0413a28_20"
    },
    {
        "source_sentence": "如是三說。",
        "translation": "These are the three teachings.",
        "source": "T22n1425_023:0413b01_21"
    },
    {
        "source_sentence": "羯磨師應作是說：「大德僧聽！",
        "translation": "The karma master should say, Listen, great virtuous monks!",
        "source": "T22n1425_023:0413b01_22"
    },
    {
        "source_sentence": "某甲從某甲受具足，某甲已空靜處教問訖。",
        "translation": "A certain person has received the full set of precepts from a certain person, and a certain person has finished asking questions in an empty and quiet place.",
        "source": "T22n1425_023:0413b02_23"
    },
    {
        "source_sentence": "若僧時到，僧某甲、和上某甲，某甲欲從僧乞受具足。",
        "translation": "If the saṃgha arrives at the right time, a certain person in the saṃgha or a certain person in the upper councilor wants to beg from the saṃgha to receive the full set of begging.",
        "source": "T22n1425_023:0413b03_24"
    },
    {
        "source_sentence": "諸大德聽！",
        "translation": "Listen, great virtuous ones!",
        "source": "T22n1425_023:0413b04_25"
    },
    {
        "source_sentence": "某甲、和上某甲，某甲欲從僧乞受具足，僧忍默然故，是事如是持。」",
        "translation": "A certain person or a superior person wants to receive the full set of begging from the saṃgha, and the saṃgha tolerates being silent because it's thus maintained.",
        "source": "T22n1425_023:0413b04_26"
    },
    {
        "source_sentence": "戒師應教乞作是言：「大德僧聽！",
        "translation": "The preceptor should be instructed to beg, saying, Listen, great virtuous monks!",
        "source": "T22n1425_023:0413b06_27"
    },
    {
        "source_sentence": "我某甲從和上某甲受具足，阿闍梨某甲已空靜處教問訖。",
        "translation": "I, a certain person, have received the full set of precepts from a certain person in Vaiśravaṇa, and that certain person as an ācārya has finished teaching and asking questions in an empty and quiet place.",
        "source": "T22n1425_023:0413b07_28"
    },
    {
        "source_sentence": "我某甲、和上某甲，今從僧乞受具足，唯願僧與我受具足，哀愍我故！」",
        "translation": "Now that I, a certain person, or a superior person, have begged from the saṃgha to receive the full set of precepts, may the saṃgha give me the full set of precepts and pity me!",
        "source": "T22n1425_023:0413b08_29"
    },
    {
        "source_sentence": "如是至三。",
        "translation": "Thus, it's up to three.",
        "source": "T22n1425_023:0413b10_30"
    },
    {
        "source_sentence": "羯磨師應作是說：「大德僧聽！",
        "translation": "The karma master should say, Listen, great virtuous monks!",
        "source": "T22n1425_023:0413b10_31"
    },
    {
        "source_sentence": "某甲從某甲受具足，某甲已空靜處教問訖，已從僧中乞受具足。",
        "translation": "A certain person receives the full set of precepts from a certain person, has finished teaching and questioning in an empty and quiet place, and has begged to receive the full set of precepts from the saṃgha.",
        "source": "T22n1425_023:0413b11_0"
    },
    {
        "source_sentence": "若僧時到，僧某甲，和上某甲，某甲欲於僧中問遮法。",
        "translation": "If the saṃgha arrives at the right time, a certain person in the saṃgha or a certain person in the superior councilor wants to ask about the refutation of the teaching within the saṃgha.",
        "source": "T22n1425_023:0413b12_1"
    },
    {
        "source_sentence": "諸大德聽！",
        "translation": "Listen, great virtuous ones!",
        "source": "T22n1425_023:0413b13_2"
    },
    {
        "source_sentence": "某甲，和上某甲，某甲欲於僧中問遮法，僧忍默然故，是事如是持。」",
        "translation": "A certain person, a certain person who wants to ask questions about the refutation of the teaching in the saṃgha, and the saṃgha tolerates silence because it's thus maintained.",
        "source": "T22n1425_023:0413b13_3"
    },
    {
        "source_sentence": "「善男子聽！",
        "translation": "Good sons, listen!",
        "source": "T22n1425_023:0413b15_4"
    },
    {
        "source_sentence": "今是至誠時，是實語時，於諸天、世間、天魔、諸梵、沙門、婆羅門、諸天、世人、阿修羅。",
        "translation": "This is the time of utmost sincerity, and this is the time when he speaks truth to gods, worldly beings, god Māra, Brahmā, ascetics, śramaṇas, brāhmaṇas, gods, humans, and asuras.",
        "source": "T22n1425_023:0413b15_5"
    },
    {
        "source_sentence": "若不實者，便於中欺誑，亦復於如來、應供、正遍知聲聞眾中欺誑，此是大罪。",
        "translation": "If someone doesn't really exist, they'll be deceived there, and they'll also deceive the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One among the śrāvakas, which is a great sin.",
        "source": "T22n1425_023:0413b17_6"
    },
    {
        "source_sentence": "今僧中問汝，有者言有，無者言無。",
        "translation": "Now, the saṃgha asks you, 'If there is, it's said to be existent; if there isn't, it's said to be nonexistent.'",
        "source": "T22n1425_023:0413b19_7"
    },
    {
        "source_sentence": "父母聽不？",
        "translation": "Are your parents listening?",
        "source": "T22n1425_023:0413b19_8"
    },
    {
        "source_sentence": "求和上未？",
        "translation": "Haven't you asked for the superior?",
        "source": "T22n1425_023:0413b20_9"
    },
    {
        "source_sentence": "三衣鉢具不？",
        "translation": "Are the three robes, bowls, and implements?",
        "source": "T22n1425_023:0413b20_10"
    },
    {
        "source_sentence": "是男子不？",
        "translation": "Is it a man?",
        "source": "T22n1425_023:0413b20_11"
    },
    {
        "source_sentence": "年滿二十不？",
        "translation": "Is he 20 years old?",
        "source": "T22n1425_023:0413b20_12"
    },
    {
        "source_sentence": "非是非人不？",
        "translation": "Isn't that right or wrong person?",
        "source": "T22n1425_023:0413b21_13"
    },
    {
        "source_sentence": "非是不能男不？",
        "translation": "Isn't it because he can't be a man?",
        "source": "T22n1425_023:0413b21_14"
    },
    {
        "source_sentence": "汝字何等？」",
        "translation": "What's your word?",
        "source": "T22n1425_023:0413b21_15"
    },
    {
        "source_sentence": "若言：「字某。」",
        "translation": "If he says, I'll call you by that name.",
        "source": "T22n1425_023:0413b22_0"
    },
    {
        "source_sentence": "「和上字誰？」",
        "translation": "Who is the word for superior?",
        "source": "T22n1425_023:0413b22_1"
    },
    {
        "source_sentence": "答言：「字某。」",
        "translation": "He replied, It's called'someone.'",
        "source": "T22n1425_023:0413b22_2"
    },
    {
        "source_sentence": "「不壞比丘尼淨行不？",
        "translation": "Does it not destroy the pure conduct of monks and nuns?",
        "source": "T22n1425_023:0413b22_3"
    },
    {
        "source_sentence": "非賊盜住不？",
        "translation": "Isn't thief stealing the abode?",
        "source": "T22n1425_023:0413b23_4"
    },
    {
        "source_sentence": "非越濟人不？",
        "translation": "Isn't that a surpassing person?",
        "source": "T22n1425_023:0413b23_5"
    },
    {
        "source_sentence": "非自出家不？",
        "translation": "Isn't it self- renunciation?",
        "source": "T22n1425_023:0413b23_6"
    },
    {
        "source_sentence": "不殺父母不？",
        "translation": "Doesn't he kill his parents?",
        "source": "T22n1425_023:0413b24_7"
    },
    {
        "source_sentence": "不殺阿羅漢不？",
        "translation": "Does it not kill arhats?",
        "source": "T22n1425_023:0413b24_8"
    },
    {
        "source_sentence": "不破僧不？",
        "translation": "Doesn't it break the saṃgha?",
        "source": "T22n1425_023:0413b24_9"
    },
    {
        "source_sentence": "不惡心出佛身血不(佛久已般泥洹故依舊文)？",
        "translation": "Doesn't the blood of the Buddha's body come out with a mind that's not bad (the text remains as before because the Buddha has been in nirvāṇa for a long time)?",
        "source": "T22n1425_023:0413b25_0"
    },
    {
        "source_sentence": "汝本曾受具足不？」",
        "translation": "Have you been fully ordained in the past?",
        "source": "T22n1425_023:0413b25_1"
    },
    {
        "source_sentence": "答言：「曾受。」",
        "translation": "He replied, I've received it before.",
        "source": "T22n1425_023:0413b26_2"
    },
    {
        "source_sentence": "「不犯四事不？」",
        "translation": "Is it not a violation of the four things?",
        "source": "T22n1425_023:0413b26_3"
    },
    {
        "source_sentence": "若言：「犯。」",
        "translation": "If he says, It's a violation.",
        "source": "T22n1425_023:0413b26_4"
    },
    {
        "source_sentence": "應語：「去！",
        "translation": "You should say, Go away!",
        "source": "T22n1425_023:0413b26_5"
    },
    {
        "source_sentence": "不得受具足。」",
        "translation": "They won't be able to receive the full set.",
        "source": "T22n1425_023:0413b27_6"
    },
    {
        "source_sentence": "若言：「不犯。」",
        "translation": "If he says, It's not a violation, then...",
        "source": "T22n1425_023:0413b27_7"
    },
    {
        "source_sentence": "次問十三事。",
        "translation": "Next, he asks about 13 questions.",
        "source": "T22n1425_023:0413b27_8"
    },
    {
        "source_sentence": "「一一事中有犯不？」",
        "translation": "Is there a violation in each case?",
        "source": "T22n1425_023:0413b28_0"
    },
    {
        "source_sentence": "若言：「犯。」",
        "translation": "If he says, It's a violation.",
        "source": "T22n1425_023:0413b28_1"
    },
    {
        "source_sentence": "「受具足訖，此罪能如法作不？」",
        "translation": "After receiving the full set of precepts, can this offense be done according to the rules?",
        "source": "T22n1425_023:0413b28_2"
    },
    {
        "source_sentence": "答言：「能。」",
        "translation": "He replied, Yes.",
        "source": "T22n1425_023:0413b29_3"
    },
    {
        "source_sentence": "「本捨戒不？」",
        "translation": "Does he originally renounce the precepts?",
        "source": "T22n1425_023:0413b29_4"
    },
    {
        "source_sentence": "答言：「捨。」",
        "translation": "He replied, Equanimity.",
        "source": "T22n1425_023:0413b29_5"
    },
    {
        "source_sentence": "「汝非奴不？",
        "translation": "Are you not a slave?",
        "source": "T22n1425_023:0413b29_6"
    },
    {
        "source_sentence": "非養兒不？",
        "translation": "Isn't it a nurturing child?",
        "source": "T22n1425_023:0413c01_7"
    },
    {
        "source_sentence": "不負人債不？",
        "translation": "Isn't it a debt to someone?",
        "source": "T22n1425_023:0413c01_8"
    },
    {
        "source_sentence": "非王臣不？",
        "translation": "Is it not the king's minister?",
        "source": "T22n1425_023:0413c01_9"
    },
    {
        "source_sentence": "不陰謀王家不？",
        "translation": "Isn't it the king's family who secretly plots?",
        "source": "T22n1425_023:0413c01_10"
    },
    {
        "source_sentence": "汝黃門不？",
        "translation": "Do you have the yellow gate?",
        "source": "T22n1425_023:0413c02_11"
    },
    {
        "source_sentence": "汝非二根不？",
        "translation": "Aren't you two faculties?",
        "source": "T22n1425_023:0413c02_12"
    },
    {
        "source_sentence": "汝是丈夫不？",
        "translation": "Are you a man?",
        "source": "T22n1425_023:0413c02_13"
    },
    {
        "source_sentence": "汝無如是諸病：癬疥、黃爛、癩病、癰痤、痔病、不禁、黃病、瘧病、欬嗽、消盡、癲狂、熱病、風腫、水腫、腹腫，如是種種更有餘病著身不？」",
        "translation": "Do you have these kinds of illnesses: ringworm, yellow rot, leprosy, scabies, abscesses, hemorrhoids, dysentery, yellowness, malaria, coughing, extinction, epilepsy, fever, swelling from wind, swelling from water, swelling from the abdomen, and so forth?",
        "source": "T22n1425_023:0413c03_14"
    },
    {
        "source_sentence": "答言：「無。」",
        "translation": "He replied, No.",
        "source": "T22n1425_023:0413c06_15"
    },
    {
        "source_sentence": "羯磨師應作是說：「大德僧聽！",
        "translation": "The karma master should say, Listen, great virtuous monks!",
        "source": "T22n1425_023:0413c06_16"
    },
    {
        "source_sentence": "某甲從某甲受具足，某甲已空靜處教問訖，某甲已從僧中乞受具足，父母已聽，已求和上，三衣鉢具，是男子，年滿二十，自說清淨無遮法。",
        "translation": "A certain person receives the full set of precepts from a certain person, has finished teaching and questioning in an empty and quiet place, has begged to receive the full set of precepts from the saṃgha, has been heard by his parents, has asked for their harmonization, and has provided the three robes, bowl, and other necessities. This man, 20 years old, explains the pure and unobstructed",
        "source": "T22n1425_023:0413c06_17"
    },
    {
        "source_sentence": "若僧時到，僧今與某甲受具足，和上某甲。",
        "translation": "If the saṃgha arrives at the right time, the saṃgha will now give it to a certain person to receive the full set of precepts, and he'll pay homage to that person.",
        "source": "T22n1425_023:0413c10_18"
    },
    {
        "source_sentence": "如是白。」",
        "translation": "It's thus white.",
        "source": "T22n1425_023:0413c11_0"
    },
    {
        "source_sentence": "白三羯磨，乃至「僧忍默然故，是事如是持。」",
        "translation": "He explains the three karmas, up to the point where he says, Because the saṃgha tolerates silence, this is thus maintained.",
        "source": "T22n1425_023:0413c11_1"
    },
    {
        "source_sentence": "佛住舍衛城，廣說如上。",
        "translation": "The Buddha stayed in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0413c12_2"
    },
    {
        "source_sentence": "爾時有無歲比丘，著好新淨染衣，往世尊所禮拜問訊。",
        "translation": "It was then that a monk of no age, wearing good, new, and pure dyed robes, went to the Bhagavān to venerate and greet him.",
        "source": "T22n1425_023:0413c12_3"
    },
    {
        "source_sentence": "是比丘後於餘時著垢膩破衣，往世尊所禮拜問訊。",
        "translation": "At some other time, that monk puts on his soiled and ruined robes and goes to the Bhagavān to venerate and greet him.",
        "source": "T22n1425_023:0413c13_4"
    },
    {
        "source_sentence": "佛知而故問：「比丘！",
        "translation": "Knowing this, the Buddha asked, Monk!",
        "source": "T22n1425_023:0413c15_5"
    },
    {
        "source_sentence": "汝先著好新淨染衣來到我所，今所著衣何故破壞乃爾？」",
        "translation": "You've previously worn good, new, pure, and dyed clothing to come to me, but why are the clothes you're wearing now destroyed like that?",
        "source": "T22n1425_023:0413c15_6"
    },
    {
        "source_sentence": "白言：「此故是先衣，但歲久破壞。」",
        "translation": "He said, This is because it's a prior garment that's only been damaged over time.",
        "source": "T22n1425_023:0413c16_7"
    },
    {
        "source_sentence": "佛言：「汝不能補治耶？」",
        "translation": "The Buddha said, Can you not remedy it?",
        "source": "T22n1425_023:0413c17_8"
    },
    {
        "source_sentence": "白佛言：「能治，但無物可補。」",
        "translation": "He said to the Buddha, There's nothing to remedy, but there's nothing to be done.",
        "source": "T22n1425_023:0413c17_9"
    },
    {
        "source_sentence": "佛言：「汝不能巷中拾故弊衣淨浣染補耶？」",
        "translation": "The Buddha said, Can't you pick up old rags and robes in the alley to cleanse and dye them?",
        "source": "T22n1425_023:0413c18_10"
    },
    {
        "source_sentence": "白言：「世尊！",
        "translation": "He said, Bhagavān!",
        "source": "T22n1425_023:0413c19_11"
    },
    {
        "source_sentence": "糞掃衣不淨，我甚惡之，不能受持。」",
        "translation": "My clothes made of rags are impure, and I'm so bad at it that I can't accept them.",
        "source": "T22n1425_023:0413c19_12"
    },
    {
        "source_sentence": "佛語比丘：「止！",
        "translation": "The Buddha said to the monk, Stop!",
        "source": "T22n1425_023:0413c20_13"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T22n1425_023:0413c20_14"
    },
    {
        "source_sentence": "莫作是語。",
        "translation": "Don't say that.",
        "source": "T22n1425_023:0413c20_15"
    },
    {
        "source_sentence": "糞掃衣少事易得，應淨無諸過，隨順沙門法服，依是出家。」",
        "translation": "It's easy to obtain robes made of rags with few things, should be pure and without faults, follow the ascetic's religious robes, and leave home based on them.",
        "source": "T22n1425_023:0413c21_16"
    },
    {
        "source_sentence": "爾時世尊往眾多比丘所，敷尼師壇坐，為諸比丘具說上事。",
        "translation": "At the time, the Bhagavān went to the many monks, spread out his altar and sits there, and explained the above-mentioned things for the monks.",
        "source": "T22n1425_023:0413c22_17"
    },
    {
        "source_sentence": "佛告諸比丘：「如來、應供、正遍知欲饒益故，於聲聞眾中正說制初依。",
        "translation": "The Buddha told the monks, Because the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One want to benefit them, they correctly explain the first basis of discipline among the śrāvakas.",
        "source": "T22n1425_023:0413c23_18"
    },
    {
        "source_sentence": "若堪忍直信善男子，與受具足；",
        "translation": "If they can tolerate it and directly believe in it, good men will be given the full ordination.",
        "source": "T22n1425_023:0413c25_19"
    },
    {
        "source_sentence": "不堪忍者，不應與受。」",
        "translation": "Those who aren't capable of tolerating it shouldn't accept it.",
        "source": "T22n1425_023:0413c26_0"
    },
    {
        "source_sentence": "佛住迦維羅衛尼拘律樹釋氏精舍，如來、應供、正遍知五事利益故，五日一行諸比丘房。",
        "translation": "When the Buddha was staying at the Śākyamuni monastery in Kapilavastu, the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One benefited from five things, he traveled to the monks' quarters for five days.",
        "source": "T22n1425_023:0413c26_1"
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are these five?",
        "source": "T22n1425_023:0413c28_2"
    },
    {
        "source_sentence": "我聲聞弟子中不好有為事不？",
        "translation": "Among my śrāvaka disciples, isn't there a bad conditioned thing?",
        "source": "T22n1425_023:0413c28_3"
    },
    {
        "source_sentence": "不樂說無益語不？",
        "translation": "Doesn't he delight in speaking useless words?",
        "source": "T22n1425_023:0413c29_4"
    },
    {
        "source_sentence": "不樂著睡眠不？",
        "translation": "Doesn't he delight in attachment to sleep?",
        "source": "T22n1425_023:0413c29_5"
    },
    {
        "source_sentence": "為看病比丘故，為信心善男子見如來威儀庠序，發歡喜心故。",
        "translation": "It's because they look after the sick monks and believe that good men who see the Tathāgata's dignified demeanor and manner give rise to joyous thoughts.",
        "source": "T22n1425_023:0414a01_6"
    },
    {
        "source_sentence": "以是五事，行諸比丘房。",
        "translation": "Because of these five things, he traveled to the monks' quarters.",
        "source": "T22n1425_023:0414a02_7"
    },
    {
        "source_sentence": "見一比丘病痿黃羸瘦，佛知而故問：「比丘！",
        "translation": "Seeing a monk who was sick and exhausted, yellow and thin, the Buddha knew and asked, Monk!",
        "source": "T22n1425_023:0414a03_8"
    },
    {
        "source_sentence": "汝氣力調和不？」",
        "translation": "Do you have the energy to regulate it?",
        "source": "T22n1425_023:0414a04_0"
    },
    {
        "source_sentence": "白佛言：「世尊！",
        "translation": "He said to the Buddha, Bhagavān!",
        "source": "T22n1425_023:0414a04_1"
    },
    {
        "source_sentence": "我患飢，氣力不足。」",
        "translation": "I'm hungry, and my energy isn't sufficient.",
        "source": "T22n1425_023:0414a04_2"
    },
    {
        "source_sentence": "佛語比丘：「汝不能乞食耶？」",
        "translation": "The Buddha said to the monk, Can't you beg for food?",
        "source": "T22n1425_023:0414a05_3"
    },
    {
        "source_sentence": "白言：「世尊！",
        "translation": "He said, Bhagavān!",
        "source": "T22n1425_023:0414a05_4"
    },
    {
        "source_sentence": "是拘薩羅國但乞人殘食，不乞非殘，是殘食不淨，我不能噉，是故羸瘦。」",
        "translation": "This is the country of Kośala that only begs for leftover food and doesn't ask for it; this leftover food is impure, and I can't eat it; therefore, I'm weak.",
        "source": "T22n1425_023:0414a06_0"
    },
    {
        "source_sentence": "佛語比丘：「止！",
        "translation": "The Buddha said to the monk, Stop!",
        "source": "T22n1425_023:0414a07_1"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T22n1425_023:0414a07_2"
    },
    {
        "source_sentence": "莫作是語。",
        "translation": "Don't say that.",
        "source": "T22n1425_023:0414a08_0"
    },
    {
        "source_sentence": "乞殘食少事易得，應淨無諸過，依是出家。」",
        "translation": "It's easy to obtain a small amount of food that's left over from begging, so it should be pure and without any faults, and leave home based on this.",
        "source": "T22n1425_023:0414a08_1"
    },
    {
        "source_sentence": "爾時世尊往眾多比丘所，敷尼師壇坐，為諸比丘具說上事。",
        "translation": "At the time, the Bhagavān went to the many monks, spread out his altar and sits there, and explained the above-mentioned things for the monks.",
        "source": "T22n1425_023:0414a09_2"
    },
    {
        "source_sentence": "佛告諸比丘：「從今日如來、應供、正遍知欲饒益故，於聲聞眾中正說制第二依。",
        "translation": "The Buddha told the monks, From today, because the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One want to benefit them, he's correctly explaining the second support among the śrāvakas who regulate the second support.",
        "source": "T22n1425_023:0414a10_3"
    },
    {
        "source_sentence": "若堪忍直信善男子，與受具足；",
        "translation": "If they can tolerate it and directly believe in it, good men will be given the full ordination.",
        "source": "T22n1425_023:0414a12_4"
    },
    {
        "source_sentence": "不堪忍者，不應與受。」",
        "translation": "Those who aren't capable of tolerating it shouldn't accept it.",
        "source": "T22n1425_023:0414a13_5"
    },
    {
        "source_sentence": "佛住舍衛城，廣說如上。",
        "translation": "The Buddha stayed in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0414a13_6"
    },
    {
        "source_sentence": "如來、應供、正遍知五日一行諸比丘房，見一比丘坐樹下，作是語：「沙門出家修梵行在樹下苦，晝則風吹日炙，夜則蚊虻所螫，我不堪。」",
        "translation": "When the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One saw a monk sitting under a tree in the monk's room for five days, he said, An ascetic or renunciant who cultivates religious practice under a tree is suffering from being stung by a wind that blows on the day and burns it on the night, and I'm unable to endure being stung by a",
        "source": "T22n1425_023:0414a14_7"
    },
    {
        "source_sentence": "佛語比丘：「止！",
        "translation": "The Buddha said to the monk, Stop!",
        "source": "T22n1425_023:0414a17_8"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T22n1425_023:0414a17_9"
    },
    {
        "source_sentence": "莫作是語。",
        "translation": "Don't say that.",
        "source": "T22n1425_023:0414a17_10"
    },
    {
        "source_sentence": "樹下坐少事易得，應淨無諸過，隨順沙門法，依是出家。」",
        "translation": "Sitting under a tree is easy to obtain for few things, so you should be pure and without faults, follow the ascetic's teaching, and leave home based on it.",
        "source": "T22n1425_023:0414a17_11"
    },
    {
        "source_sentence": "爾時世尊往眾多比丘所，敷尼師壇坐，為諸比丘具說上事。",
        "translation": "At the time, the Bhagavān went to the many monks, spread out his altar and sits there, and explained the above-mentioned things for the monks.",
        "source": "T22n1425_023:0414a19_0"
    },
    {
        "source_sentence": "佛告諸比丘：「從今日如來、應供、正遍知欲饒益故，於聲聞眾中正說制第三依。",
        "translation": "The Buddha told the monks, From today, because the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One want to benefit them, he's correctly teaching the third support among the śrāvakas.",
        "source": "T22n1425_023:0414a20_1"
    },
    {
        "source_sentence": "若堪忍直心善男子，與受具足；",
        "translation": "If they are able to tolerate it, good men with straightforward minds will be given the full ordination.",
        "source": "T22n1425_023:0414a22_2"
    },
    {
        "source_sentence": "不堪忍者，不應與受。」",
        "translation": "Those who aren't capable of tolerating it shouldn't accept it.",
        "source": "T22n1425_023:0414a22_3"
    },
    {
        "source_sentence": "佛住迦維羅衛尼拘律樹釋氏精舍，如來、應供、正遍知五日一行諸比丘房，見一病比丘羸瘦痿黃。",
        "translation": "When the Buddha was staying at the monastery of the Śākya family in Kapilavastu, the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One traveled to the monks' quarters for five days and saw a sick monk who was emaciated and yellow.",
        "source": "T22n1425_023:0414a23_4"
    },
    {
        "source_sentence": "佛知而故問：「比丘！",
        "translation": "Knowing this, the Buddha asked, Monk!",
        "source": "T22n1425_023:0414a25_5"
    },
    {
        "source_sentence": "氣力調和不？」",
        "translation": "Is the energy tempered?",
        "source": "T22n1425_023:0414a26_0"
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "He replied, Bhagavān!",
        "source": "T22n1425_023:0414a26_1"
    },
    {
        "source_sentence": "我病苦，氣力不和。」",
        "translation": "My illness is painful, and my energy isn't in harmony.",
        "source": "T22n1425_023:0414a26_2"
    },
    {
        "source_sentence": "佛問比丘：「汝不能服隨病藥、隨病食耶？」",
        "translation": "The Buddha asked the monk, Can't you take the medicine or food that follows illness?",
        "source": "T22n1425_023:0414a27_0"
    },
    {
        "source_sentence": "白言：「世尊！",
        "translation": "He said, Bhagavān!",
        "source": "T22n1425_023:0414a27_1"
    },
    {
        "source_sentence": "我無藥直、復無施者，是故病苦。」",
        "translation": "I don't have medicine, and there's no donor; therefore, illness is painful.",
        "source": "T22n1425_023:0414a28_2"
    },
    {
        "source_sentence": "佛問比丘：「汝不能服陳棄藥耶？」",
        "translation": "The Buddha asked the monk, Can't you take it and discard the medicine?",
        "source": "T22n1425_023:0414a28_3"
    },
    {
        "source_sentence": "白言：「世尊！",
        "translation": "He said, Bhagavān!",
        "source": "T22n1425_023:0414a29_4"
    },
    {
        "source_sentence": "是陳棄藥不淨，我不能服。」",
        "translation": "This is a discard of medicine that's impure, and I can't take it.",
        "source": "T22n1425_023:0414a29_5"
    },
    {
        "source_sentence": "佛語比丘：「止！",
        "translation": "The Buddha said to the monk, Stop!",
        "source": "T22n1425_023:0414b01_6"
    },
    {
        "source_sentence": "止！",
        "translation": "Don't!",
        "source": "T22n1425_023:0414b01_7"
    },
    {
        "source_sentence": "莫作是語。",
        "translation": "Don't say that.",
        "source": "T22n1425_023:0414b01_8"
    },
    {
        "source_sentence": "陳棄藥少事易得，應淨無諸過，隨順沙門法，依是出家。」",
        "translation": "It's easy to obtain a small amount of medicine that's discarded, which should be pure and without any faults, follow the ascetic teachings, and leave home based on them.",
        "source": "T22n1425_023:0414b02_0"
    },
    {
        "source_sentence": "爾時世尊往眾多比丘所，敷尼師壇坐，為諸比丘具說上事。",
        "translation": "At the time, the Bhagavān went to the many monks, spread out his altar and sits there, and explained the above-mentioned things for the monks.",
        "source": "T22n1425_023:0414b03_1"
    },
    {
        "source_sentence": "佛告諸比丘：「從今日如來、應供、正遍知欲饒益故，於聲聞眾中正說制第四依。",
        "translation": "The Buddha told the monks, From today, because the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One want to benefit them, he's correctly explaining the fourth support among the śrāvakas.",
        "source": "T22n1425_023:0414b04_2"
    },
    {
        "source_sentence": "若堪忍直心善男子，與受具足；",
        "translation": "If they are able to tolerate it, good men with straightforward minds will be given the full ordination.",
        "source": "T22n1425_023:0414b06_3"
    },
    {
        "source_sentence": "不堪忍者，不應與受。」",
        "translation": "Those who aren't capable of tolerating it shouldn't accept it.",
        "source": "T22n1425_023:0414b07_4"
    },
    {
        "source_sentence": "佛住舍衛城，廣說如上。",
        "translation": "The Buddha stayed in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0414b07_5"
    },
    {
        "source_sentence": "爾時都夷聚落有年少婆羅門，求諸比丘出家受具足已，然後受四依。",
        "translation": "It was then that there were young brāhmaṇas in the village of Tuṣita who asked the monks to leave home and receive their full ordination, and they then received the four supports.",
        "source": "T22n1425_023:0414b08_6"
    },
    {
        "source_sentence": "「糞掃衣少事易得，應淨無諸過，隨順沙門法，依是出家受具足。",
        "translation": "It's easy to obtain robes made of rags with few things, should be pure and without faults, follow the ascetic's rules, and rely on them to leave home and receive their fulfillment.",
        "source": "T22n1425_023:0414b09_7"
    },
    {
        "source_sentence": "是中盡壽能堪忍不？」",
        "translation": "Can you tolerate it for the rest of your life?",
        "source": "T22n1425_023:0414b11_8"
    },
    {
        "source_sentence": "答言：「不能忍。」",
        "translation": "He replied, I can't bear it.",
        "source": "T22n1425_023:0414b11_9"
    },
    {
        "source_sentence": "問言：「汝何故出家？」",
        "translation": "He asked, Why are you leaving home?",
        "source": "T22n1425_023:0414b11_10"
    },
    {
        "source_sentence": "答言：「我見沙門釋子著好細輕衣，我貪著此衣，是故出家。」",
        "translation": "He replied, I've seen the ascetic or Śākyamuni wearing nice, fine, and light clothing, and I crave these clothes; therefore, I'll leave home.",
        "source": "T22n1425_023:0414b12_11"
    },
    {
        "source_sentence": "諸比丘言：「何有一切比丘出家皆得此好衣？」",
        "translation": "The monks said, How could there be any monks who leave home and attain this good robe?",
        "source": "T22n1425_023:0414b13_12"
    },
    {
        "source_sentence": "復授第二依：「乞殘食少事易得，應淨無諸過，隨順沙門法，依是出家受具足。",
        "translation": "Again, he gave the second supporting principle, It's easy to obtain a small amount of food that's left over after begging for it, should be pure and without any faults, follow the ascetic teachings, and rely on them to leave home and receive their fulfillment.",
        "source": "T22n1425_023:0414b14_13"
    },
    {
        "source_sentence": "是中盡壽能堪忍不？」",
        "translation": "Can you tolerate it for the rest of your life?",
        "source": "T22n1425_023:0414b16_14"
    },
    {
        "source_sentence": "答言：「我不堪忍。」",
        "translation": "He replied, I can't bear it.",
        "source": "T22n1425_023:0414b16_15"
    },
    {
        "source_sentence": "問言：「汝何故出家？」",
        "translation": "He asked, Why are you leaving home?",
        "source": "T22n1425_023:0414b17_16"
    },
    {
        "source_sentence": "答言：「我見沙門釋子食白粳米飯，種種餅肉飲食。",
        "translation": "He replied, I've seen the ascetic or Śākyamuni eat white millet rice and various kinds of cakes, meat, and food.",
        "source": "T22n1425_023:0414b17_17"
    },
    {
        "source_sentence": "我貪此好食，是故出家。」",
        "translation": "Because I crave this good food, I'll leave home.",
        "source": "T22n1425_023:0414b18_18"
    },
    {
        "source_sentence": "諸比丘言：「何有一切比丘出家皆得此好食？」",
        "translation": "The monks said, How could all the monks who leave home attain this good food?",
        "source": "T22n1425_023:0414b19_19"
    },
    {
        "source_sentence": "復受第三依：「樹下坐少事易得，應淨無諸過，隨順沙門法，依是出家受具足。",
        "translation": "Again, he receives the third support, Sitting under a tree with few things easy to obtain, he should be pure and without faults, follow the ascetic's rules, and rely on them to leave home and become fully ordained.",
        "source": "T22n1425_023:0414b20_20"
    },
    {
        "source_sentence": "是中盡壽能堪忍不？」",
        "translation": "Can you tolerate it for the rest of your life?",
        "source": "T22n1425_023:0414b22_0"
    },
    {
        "source_sentence": "答言：「不堪忍。」",
        "translation": "He replied, I can't bear it.",
        "source": "T22n1425_023:0414b22_1"
    },
    {
        "source_sentence": "諸比丘言：「汝何故出家？」",
        "translation": "The monks said, Why are you leaving home?",
        "source": "T22n1425_023:0414b22_2"
    },
    {
        "source_sentence": "答言：「我見沙門釋子坐大房舍重樓閣舍，我貪住此舍，是故出家。」",
        "translation": "He replied, I've seen the ascetic or Śākyamuni sitting in a large dwelling and a heavy pavilion, and I covet to live in this dwelling; therefore, I'll leave home.",
        "source": "T22n1425_023:0414b23_3"
    },
    {
        "source_sentence": "諸比丘言：「何處一切出家比丘皆得此好舍？」",
        "translation": "The monks said, Where did all the renunciant monks attain this nice dwelling?",
        "source": "T22n1425_023:0414b24_4"
    },
    {
        "source_sentence": "復受第四依：「陳棄藥少事易得，應淨無諸過，隨順沙門法，依是出家受具足。",
        "translation": "Again, he accepted the fourth supporting principle, saying, It's easy to discard medicine for a few things, purify it without any faults, follow the ascetic teachings, and rely on them to leave home and be fully ordained.",
        "source": "T22n1425_023:0414b25_5"
    },
    {
        "source_sentence": "是中盡壽能堪忍不？」",
        "translation": "Can you tolerate it for the rest of your life?",
        "source": "T22n1425_023:0414b27_6"
    },
    {
        "source_sentence": "答言：「不堪忍。」",
        "translation": "He replied, I can't bear it.",
        "source": "T22n1425_023:0414b27_7"
    },
    {
        "source_sentence": "問言：「汝何故出家？」",
        "translation": "He asked, Why are you leaving home?",
        "source": "T22n1425_023:0414b28_8"
    },
    {
        "source_sentence": "答言：「我見沙門釋子服酥油蜜石蜜及餘種種藥，我貪服此藥，是故出家。」",
        "translation": "He replied, I've seen the ascetic or Śākyamuni taking ghee, honey, rock honey, and various other medicines, and I covet to take these medicines; therefore, I'll leave home.",
        "source": "T22n1425_023:0414b28_9"
    },
    {
        "source_sentence": "諸比丘言：「何有一切比丘出家皆得此好藥？」",
        "translation": "The monks said, How could all the monks who leave home attain this good medicine?",
        "source": "T22n1425_023:0414c01_10"
    },
    {
        "source_sentence": "諸比丘以是因緣，往白世尊。",
        "translation": "Because of these causes and conditions, the monks went to the Bhagavān.",
        "source": "T22n1425_023:0414c02_11"
    },
    {
        "source_sentence": "佛言：「汝云何先與受具足，後授四依？",
        "translation": "The Buddha said, How did you first give them the full set of precepts and then give them the four supports?",
        "source": "T22n1425_023:0414c03_0"
    },
    {
        "source_sentence": "從今日後不得先受具足後授四依，當先授四依，能堪忍者與受具足。",
        "translation": "From today onward, they won't be able to receive the full set of precepts first and then give the four supports, but they will first give the four supports, which are capable of tolerating a ninja who receives the full set of precepts.",
        "source": "T22n1425_023:0414c03_1"
    },
    {
        "source_sentence": "若言：『不堪。』",
        "translation": "If someone says, 'It's unworthy,'",
        "source": "T22n1425_023:0414c05_2"
    },
    {
        "source_sentence": "不應與受具足。",
        "translation": "They shouldn't be given the full set of sensations.",
        "source": "T22n1425_023:0414c05_3"
    },
    {
        "source_sentence": "若先授具足，後授四依者，得名受具足，一切僧得越比尼罪。」",
        "translation": "If someone first gives them the full set of precepts and then gives them the four supports, they'll be called receiving the full set of precepts, and all the saṃgha will be guilty of transgressing the vinaya.",
        "source": "T22n1425_023:0414c06_4"
    },
    {
        "source_sentence": "授四依時，應先作求聽羯磨：「大德僧聽！",
        "translation": "When he gives the four supports, he should first make a request to hear the karman, Listen, Mañjuśrī!",
        "source": "T22n1425_023:0414c07_5"
    },
    {
        "source_sentence": "某甲從某甲受具足，某甲已空靜處教問訖，已於僧中乞受具足，父母已聽，已求和上、三衣鉢具，是男子、年滿二十，自說清淨無遮法。",
        "translation": "A certain person receives the full set of precepts from a certain person, has finished teaching and questioning in an empty and quiet place, has begged to receive the full set of precepts in the saṃgha, has listened to his parents, and has asked for the restraints and almsbowl for the three robes and bowls, this man, who's 20 years old, explains the pure and unobstruct",
        "source": "T22n1425_023:0414c08_6"
    },
    {
        "source_sentence": "若僧時到，僧某甲，和上某甲，欲於僧中說四依。」",
        "translation": "If the saṃgha arrives at the right time, a certain person in the saṃgha or a certain person in the upper chamber wants to explain the four supports in the saṃgha.",
        "source": "T22n1425_023:0414c11_7"
    },
    {
        "source_sentence": "「諸大德僧聽！",
        "translation": "Venerable monks, listen!",
        "source": "T22n1425_023:0414c12_8"
    },
    {
        "source_sentence": "某甲，和上某甲，欲於僧中說四依，僧忍默然故，是事如是持。」",
        "translation": "A certain monk, a superior monk, wants to explain the four supports in the saṃgha, and the saṃgha tolerates silence because it's thus maintained.",
        "source": "T22n1425_023:0414c12_9"
    },
    {
        "source_sentence": "「善男子聽！",
        "translation": "Good sons, listen!",
        "source": "T22n1425_023:0414c14_10"
    },
    {
        "source_sentence": "此是如來、應供、正遍知欲饒益故，於聲聞眾中正說制四依。",
        "translation": "Because these are the desires of the Tathāgata, Worthy of Offerings, and Perfectly Enlightened One to benefit, he correctly explains the four supports among the śrāvakas.",
        "source": "T22n1425_023:0414c14_11"
    },
    {
        "source_sentence": "若堪忍直信善男子，與受具足；",
        "translation": "If they can tolerate it and directly believe in it, good men will be given the full ordination.",
        "source": "T22n1425_023:0414c15_12"
    },
    {
        "source_sentence": "不堪忍者，不應與受依。",
        "translation": "A person who doesn't tolerate it shouldn't be given the support of sensation.",
        "source": "T22n1425_023:0414c16_13"
    },
    {
        "source_sentence": "糞掃衣少事易得，應淨無諸過，隨順沙門法，依是出家受具足，得作比丘。",
        "translation": "It's easy to obtain robes made of rags with few things, which should be pure and without faults, follow the ascetic teachings, leave home, receive their fulfillment, and become a monk accordingly.",
        "source": "T22n1425_023:0414c17_14"
    },
    {
        "source_sentence": "是中盡壽能堪忍持糞掃衣不？」",
        "translation": "Will you be able to tolerate carrying a garbage sweeping robe for the rest of your life?",
        "source": "T22n1425_023:0414c18_15"
    },
    {
        "source_sentence": "答言：「能。」",
        "translation": "He replied, Yes.",
        "source": "T22n1425_023:0414c19_16"
    },
    {
        "source_sentence": "「若長得欽婆羅衣、疊衣、芻摩衣、拘舍耶衣、舍那衣麻衣、丘牟提衣。」",
        "translation": "Suppose someone long obtains a kambala robe, a cotton robe, a monk's robe, a monk's robe, a kośeya robe, a sanā robe, a hemp robe, or a bhikṣuṇī robe.",
        "source": "T22n1425_023:0414c19_17"
    },
    {
        "source_sentence": "「依乞殘食少事易得，應淨無諸過，隨順沙門法，依是出家受具足，得作比丘。",
        "translation": "Relying on the few things that are easy to obtain based on begging for leftover food, they should be pure and without faults, follow the ascetic teachings, leave home, receive their fulfillment, and become a monk accordingly.",
        "source": "T22n1425_023:0414c21_18"
    },
    {
        "source_sentence": "是中盡壽能堪忍乞食不？」",
        "translation": "Is it possible to tolerate begging for food for the rest of your life?",
        "source": "T22n1425_023:0414c23_0"
    },
    {
        "source_sentence": "答言：「能。」",
        "translation": "He replied, Yes.",
        "source": "T22n1425_023:0414c23_1"
    },
    {
        "source_sentence": "「若長得月八日十四日十五日，說戒食籌食請食。」",
        "translation": "If he receives the precepts on the eighth, fourteenth, and fifteenth days of the month for a long time, he explains the precepts and asks for food.",
        "source": "T22n1425_023:0414c23_2"
    },
    {
        "source_sentence": "「依樹下坐少事易得，應淨無諸過，隨順沙門法，依是出家受具足，得作比丘。",
        "translation": "It's easy to sit under a tree with few things to obtain, which should be pure and without faults, follow the ascetic teachings, and rely on them to leave home, receive their full ordination, and become a monk.",
        "source": "T22n1425_023:0414c24_3"
    },
    {
        "source_sentence": "是中盡壽能堪忍樹下坐不？」",
        "translation": "Will he be able to tolerate sitting under a tree for the rest of his life?",
        "source": "T22n1425_023:0414c26_4"
    },
    {
        "source_sentence": "答言：「能。」",
        "translation": "He replied, Yes.",
        "source": "T22n1425_023:0414c27_5"
    },
    {
        "source_sentence": "「若長得大舍、重樓、閣舍、門舍、窟舍。」",
        "translation": "“Suppose someone were to obtain a large dwelling, a heavy building, a pavilion, a gatehouse, or a cave dwelling for a long time.",
        "source": "T22n1425_023:0414c27_6"
    },
    {
        "source_sentence": "「依陳棄藥少事易得，應淨無諸過，隨順沙門法，依是出家受具足，得作比丘。",
        "translation": "It's easy to obtain a little bit of medicine based on the fact that it's discarded, should be pure and without faults, follow the ascetic teachings, and rely on this renunciant to be fully ordained and become a monk.",
        "source": "T22n1425_023:0414c28_7"
    },
    {
        "source_sentence": "是中盡壽能堪忍服陳棄藥不？」",
        "translation": "Will he be able to tolerate taking and discard the medicine for the rest of his life?",
        "source": "T22n1425_023:0414c29_8"
    },
    {
        "source_sentence": "答言：「能。」",
        "translation": "He replied, Yes.",
        "source": "T22n1425_023:0415a01_9"
    },
    {
        "source_sentence": "「若長得酥油蜜石蜜生酥及脂。",
        "translation": "If he grows, he'll obtain ghee, oil, honey, rock honey, butter, and fat.",
        "source": "T22n1425_023:0415a01_10"
    },
    {
        "source_sentence": "依此四聖種，當隨順學。」",
        "translation": "Relying on these four noble seeds, you should follow and study them.",
        "source": "T22n1425_023:0415a02_11"
    },
    {
        "source_sentence": "羯磨師應作是說：「大德僧聽！",
        "translation": "The karma master should say, Listen, great virtuous monks!",
        "source": "T22n1425_023:0415a03_0"
    },
    {
        "source_sentence": "某甲從某甲受具足，某甲已空靜處教問訖，某甲已從僧中乞受具足。",
        "translation": "A certain person receives the full set of precepts from a certain person, has finished teaching and questioning in an empty and quiet place, and has begged to receive the full set of precepts from the saṃgha.",
        "source": "T22n1425_023:0415a03_1"
    },
    {
        "source_sentence": "父母已聽，已求和上、三衣鉢具，是男子、年滿二十，自說清淨無遮法已，堪忍四依。",
        "translation": "After his parents had heard it, they asked for the restraints and three robes, bowls, and almsbowl. That man, who was twenty years old, explained the pure and unobstructed dharma to himself, tolerating the four supports.",
        "source": "T22n1425_023:0415a05_2"
    },
    {
        "source_sentence": "若僧時倒，僧今與某甲受具足，和上某甲。",
        "translation": "If the saṃgha is mistaken at the time, the saṃgha will now give it to a certain person to receive the full set of precepts, and he'll pay homage to that person.",
        "source": "T22n1425_023:0415a07_3"
    },
    {
        "source_sentence": "白如是。」",
        "translation": "The white is like this.",
        "source": "T22n1425_023:0415a08_4"
    },
    {
        "source_sentence": "「大德僧聽！",
        "translation": "Venerable monks, listen!",
        "source": "T22n1425_023:0415a08_5"
    },
    {
        "source_sentence": "某甲從某甲受具足，某甲已空靜處教問訖，某甲已從僧中乞受具足，父母已聽，已求和上、三衣鉢具足，是男子、年滿二十，自說清淨無遮法已，堪忍四依。",
        "translation": "A certain person has received the full set of precepts from a certain person, a certain person has finished teaching and questioning in an empty and quiet place, a certain person has begged to receive the full set of precepts from the saṃgha, his parents have heard them, and they've asked for the restraints and three robes and bowls that are complete, and this man, 20 years old and fully ordained, has explained",
        "source": "T22n1425_023:0415a08_6"
    },
    {
        "source_sentence": "僧今與某甲受具足，和上某甲。",
        "translation": "Now, the saṃgha will give a certain person to receive the full set of precepts, and he'll pay homage to that person.",
        "source": "T22n1425_023:0415a12_7"
    },
    {
        "source_sentence": "諸大德忍僧與某甲受具足，和上某甲，忍者僧默然，若不忍便說。",
        "translation": "The great virtuous monks tolerated the saṃgha to accept the full set of precepts with a certain person, and when they reconciled with that person, the ninja monks were silent, and if they didn't tolerate it, they said so.",
        "source": "T22n1425_023:0415a12_8"
    },
    {
        "source_sentence": "是第一羯磨成就不？」",
        "translation": "Is this the accomplishment of the first karma?",
        "source": "T22n1425_023:0415a14_9"
    },
    {
        "source_sentence": "第二、第三亦如是說。",
        "translation": "The second and third are likewise explained.",
        "source": "T22n1425_023:0415a14_10"
    },
    {
        "source_sentence": "「僧已忍與某甲受具足竟，和上某甲，僧忍默然故，是事如是持。」",
        "translation": "After the saṃgha has tolerated the acceptance of the full set of precepts for a certain person, he reconciles with that person, and because the saṃgha tolerates silence, it's thus maintained.",
        "source": "T22n1425_023:0415a15_11"
    },
    {
        "source_sentence": "「善男子！",
        "translation": "Good sons!",
        "source": "T22n1425_023:0415a16_12"
    },
    {
        "source_sentence": "汝已受具足，善受具足一白三羯磨無遮法，眾僧和合非不和合，十眾十眾已上。",
        "translation": "You've already received the full set of precepts, well received the full set of one white and three karman precepts without obstructing the Dharma, which are combined by the saṃgha and not unified by the ten congregations or more than ten congregations.",
        "source": "T22n1425_023:0415a16_13"
    },
    {
        "source_sentence": "汝今當敬重於佛、敬重於法、敬重於比丘僧、敬重和上、敬重阿闍梨。",
        "translation": "You must now revere the Buddha, revere the Dharma, revere the bhikṣus and saṃgha, revere the monks and nuns, revere the upāsaka, and revere the Ajñātaśatru.",
        "source": "T22n1425_023:0415a18_14"
    },
    {
        "source_sentence": "汝已遭遇莫復失，人身難得，佛世難值，聞法亦難，眾僧和合意願成就難，頂禮釋師子及諸聲聞眾已得具足，如無憂華離於塵水，當依傍修習泥洹善法。",
        "translation": "You have already encountered it, so don't lose it again; your human body is difficult to meet, the Buddha world is difficult to meet, listening to the teaching is also difficult, and the saṃgha harmonizes with the intention to accomplish what's difficult, bowing to the Śākyamuni and the śrāvakas who have attained endowment, like the flower of no sorrow that's free of dust and",
        "source": "T22n1425_023:0415a20_15"
    },
    {
        "source_sentence": "已得受具足，此戒序法、四波羅夷、十三僧伽婆尸沙、二不定法、三十尼薩耆波夜提、九十二純波夜提、四波羅提提舍尼、眾學法、七滅諍法、隨順法，我今略說教誡汝。",
        "translation": "These precepts, the four pārājikas, 13 saṃghâvaśeṣas, 2 indeterminate rules, 30 rules for nuns,92 rules for ninety-two pure rules, 4 rules for pratyekabuddhas, 5 rules for religious practitioners, 7 rules for extinguishing disputes, and 8 rules for those who follow them. I will now briefly admonish you.",
        "source": "T22n1425_023:0415a23_16"
    },
    {
        "source_sentence": "如是，後和上、阿闍梨當廣為汝說。",
        "translation": "Thus, the latter monk or preceptor will explain it to you in detail.",
        "source": "T22n1425_023:0415a27_17"
    },
    {
        "source_sentence": "是名十眾受戒，五眾受具足者。」",
        "translation": "These are called the ten groups of people who receive the precepts and the five groups of people who receive the full set of precepts.",
        "source": "T22n1425_023:0415a28_18"
    },
    {
        "source_sentence": "佛住王舍城尸陀林中。",
        "translation": "The Buddha was staying in the cemetery forest in Rājagṛha.",
        "source": "T22n1425_023:0415a29_19"
    },
    {
        "source_sentence": "時城中有居士，名曰欝虔，宗室豪強財產無量，聞如來出現於世，在尸陀林中，歡喜踊躍，欲請佛及僧施設飯食，莊嚴室內灑掃塗地。",
        "translation": "At the time, there was a householder in the city named Kauṇḍinya, whose clansmen were wealthy and possessed immeasurable property. When he heard that the Tathāgata had appeared in the world, he rejoiced and jumped for joy. Wishing to invite the Buddha and the members of the sangha to prepare food and drink for them, he adorned his dwelling and swept away the dirt",
        "source": "T22n1425_023:0415a29_20"
    },
    {
        "source_sentence": "時舍衛城中有居士，名阿那邠坻，素與欝虔特相親友。",
        "translation": "At the time, there was a householder named Anavatapta in Śrāvastī who had always been intimate with Vaiśravaṇa.",
        "source": "T22n1425_023:0415b03_21"
    },
    {
        "source_sentence": "來到其家，見其怱務莊嚴灑掃，即問言：「居士！",
        "translation": "When he came to his house, he saw the monk's deportment and adornment sweeping it up and down, and asked,居士!",
        "source": "T22n1425_023:0415b05_0"
    },
    {
        "source_sentence": "何故怱務？",
        "translation": "What's the reason for this?",
        "source": "T22n1425_023:0415b06_0"
    },
    {
        "source_sentence": "欲嫁女娶婦、請婆羅門、請王大臣耶？」",
        "translation": "Do you want to marry a woman, take a wife, invite a brāhmaṇa, or invite the king's ministers?",
        "source": "T22n1425_023:0415b06_1"
    },
    {
        "source_sentence": "答言：「我不嫁女娶婦、請婆羅門、王及大臣也。",
        "translation": "He replied, I won't marry a woman or take a wife, invite brāhmaṇas, kings, or ministers.",
        "source": "T22n1425_023:0415b07_2"
    },
    {
        "source_sentence": "汝不聞，白淨王子出家成佛，號曰如來、應供、正遍知，出現於世間耶？",
        "translation": "Didn't you hear that the white pure prince who left home and became a buddha named the Tathāgata, Worthy of Offerings, Perfectly Enlightened One, appeared in the world?",
        "source": "T22n1425_023:0415b08_3"
    },
    {
        "source_sentence": "今在尸陀林中，我今灑掃嚴飾，正欲請佛及僧，是故怱務。」",
        "translation": "Now that I'm in the cemetery, I'll sweep and adorn it, just as I want to invite the Buddha and the saṃgha, so I'll do my duty.",
        "source": "T22n1425_023:0415b09_4"
    },
    {
        "source_sentence": "邠坻聞已，心大欣悅，即便問言：「我欲禮覲，可得見不？」",
        "translation": "Having heard this, he was greatly delighted and asked, I want to pay my respects, can I see you?",
        "source": "T22n1425_023:0415b10_5"
    },
    {
        "source_sentence": "答言：「可見！",
        "translation": "He replied, Yes!",
        "source": "T22n1425_023:0415b12_6"
    },
    {
        "source_sentence": "佛者普潤，見無不益，宜知是時。」",
        "translation": "The Buddha is universally nourished, and views are not unbeneficial; it's appropriate to know this time.",
        "source": "T22n1425_023:0415b12_7"
    },
    {
        "source_sentence": "聞是語已，敬心內發企遲明相。",
        "translation": "After hearing these words, he venerates them and gives rise to the latent sign of dejection in his mind.",
        "source": "T22n1425_023:0415b13_8"
    },
    {
        "source_sentence": "佛照其心，夜放光明，普耀城內。",
        "translation": "The Buddha illumined their minds, and at night he radiated a ray of light that shone brightly throughout the city.",
        "source": "T22n1425_023:0415b13_9"
    },
    {
        "source_sentence": "邠坻見明，謂是天曉即便起行，門自然開。",
        "translation": "When he saw the light, he thought it was dawn and immediately got up to walk, and the door opened naturally.",
        "source": "T22n1425_023:0415b14_10"
    },
    {
        "source_sentence": "適向城門，城門復開。",
        "translation": "As he approached the city gates, the city gates opened again.",
        "source": "T22n1425_023:0415b15_11"
    },
    {
        "source_sentence": "出門已有一天祠，近於道側，欲先禮敬，然後詣佛。",
        "translation": "After leaving the monastery, a deva shrine was built next to the road. He wished to pay his respects first and then went to see the Buddha.",
        "source": "T22n1425_023:0415b15_12"
    },
    {
        "source_sentence": "迴向祠門，于時天地還闇，彼即恐怖，進退迷惑，莫知所向。",
        "translation": "When they return to the shrine gate, heaven and earth return to darkness, and they become frightened and confused, not knowing where to turn.",
        "source": "T22n1425_023:0415b17_13"
    },
    {
        "source_sentence": "時空中有天，語邠坻言：「今正是時，但行莫怖。」",
        "translation": "A god then flew up into the sky and said to Śāriputra, Now is the right time, but don't be afraid when you walk.",
        "source": "T22n1425_023:0415b18_14"
    },
    {
        "source_sentence": "「牛馬車百乘，　　皆七寶莊嚴，",
        "translation": "A hundred carts of cattle and horses, decorated with the seven kinds of treasure,",
        "source": "T22n1425_023:0415b19_15"
    },
    {
        "source_sentence": "　盡持用布施，　　計彼之功德，",
        "translation": "Giving with full support, calculating their merits,",
        "source": "T22n1425_023:0415b19_15"
    },
    {
        "source_sentence": "　比汝行一步，　　十六不及一。",
        "translation": "It's less than one step as you walk, and it's not one of the sixteen.",
        "source": "T22n1425_023:0415b19_15"
    },
    {
        "source_sentence": "　雪山百龍象，　　亦以七寶嚴，",
        "translation": "A hundred dragons and elephants of the Himalayan mountains Are also adorned with the seven kinds of treasure.",
        "source": "T22n1425_023:0415b19_15"
    },
    {
        "source_sentence": "　持用行布施，　　功德之福報，",
        "translation": "It's the merit of maintaining, practicing, and bestowing virtue as a reward.",
        "source": "T22n1425_023:0415b19_15"
    },
    {
        "source_sentence": "　比汝行一步，　　十六不及一。",
        "translation": "It's less than one step as you walk, and it's not one of the sixteen.",
        "source": "T22n1425_023:0415b19_15"
    },
    {
        "source_sentence": "　百好天玉女，　　七寶瓔珞身，",
        "translation": "A hundred beautiful celestial jadelike maidens with a seven-jeweled diadem body.",
        "source": "T22n1425_023:0415b19_15"
    },
    {
        "source_sentence": "　持用行布施，　　計彼之福報，",
        "translation": "They maintain and practice giving, calculating the rewards of their goodness.",
        "source": "T22n1425_023:0415b19_15"
    },
    {
        "source_sentence": "　比汝行一步，　　十六不及一。」",
        "translation": "It's one step behind you when you walk, and 16 isn't one.",
        "source": "T22n1425_023:0415b19_15"
    },
    {
        "source_sentence": "即說偈言：爾時阿那邠坻聞此偈已，倍生敬信，尋詣佛所，頭面禮足，却住一面。",
        "translation": "Hearing this verse, Anavatapta doubled his respect and confidence. Seeking to see the Buddha, he bowed his forehead at [the Buddha’s] feet and withdrew to one side.",
        "source": "T22n1425_023:0415b19_15"
    },
    {
        "source_sentence": "佛為說法，示教利喜，白佛言：「世尊！",
        "translation": "The Buddha taught the Dharma for them, showed them benefits and joy, and said to the Buddha, Bhagavān!",
        "source": "T22n1425_023:0415c01_16"
    },
    {
        "source_sentence": "我欲還舍衛城起立精舍，請佛及僧。",
        "translation": "I want to return to Sāvatthī and build a monastery in the city of Sāvatthī, inviting the Buddha and the monks.",
        "source": "T22n1425_023:0415c02_17"
    },
    {
        "source_sentence": "唯願世尊哀受我請。",
        "translation": "Please, Bhagavān, have mercy on me and accept my invitation.",
        "source": "T22n1425_023:0415c03_18"
    },
    {
        "source_sentence": "復願世尊遣一比丘鑑理處分。」",
        "translation": "Again, may the Bhagavān send a monk to examine the principle of the doctrine.",
        "source": "T22n1425_023:0415c03_19"
    },
    {
        "source_sentence": "如《比羅經》中廣說，乃至佛告舍利弗、目連：「汝等往彼觀地形勢，隨僧住便料理處分，安置房舍。」",
        "translation": "As explained in detail in the Paranirmita-vaśavartin Sutra, the Buddha told Śāriputra and Maudgalyāyana, Go there to observe the land and its movements, follow the saṃgha's whereabouts, then arrange their places and lodging quarters accordingly.",
        "source": "T22n1425_023:0415c04_20"
    },
    {
        "source_sentence": "舍利弗、目連受教，即往至彼。",
        "translation": "Śāriputra and Maudgalyāyana accepted the teaching and went there.",
        "source": "T22n1425_023:0415c06_21"
    },
    {
        "source_sentence": "時居士邠坻以十八億金買地，十八億金作僧房舍，十八億金供養眾僧，合五十四億金。",
        "translation": "The layman then purchased the land for 18 billion gold, made a dwelling for the saṃgha with 18 billion gold, and offered 18 billion gold to support the saṃgha with 5,400 million gold.",
        "source": "T22n1425_023:0415c07_22"
    },
    {
        "source_sentence": "是居士方欲更興供養故，遣富樓那入海採寶，佛威神護念故，四大天王、帝釋及梵天王衛護此人，往還七反，大獲珍寶，不遭留難。",
        "translation": "Wishing to make further offerings, the householder sent Pūrṇa into the ocean to gather treasure, and because the Buddha's authoritative power protected him, the four great heavenly kings, Indra, and Brahmā guarded him seven times before he went back and forth, gaining a great deal of treasure that didn't cause him any difficulty.",
        "source": "T22n1425_023:0415c09_23"
    },
    {
        "source_sentence": "富樓那白邠坻言：「唯願居士聽我出家。」",
        "translation": "Pūrṇa said to the monk, Please, householder, listen to me as I leave home.",
        "source": "T22n1425_023:0415c12_24"
    },
    {
        "source_sentence": "居士即許。",
        "translation": "The householder then agreed.",
        "source": "T22n1425_023:0415c13_0"
    },
    {
        "source_sentence": "將至佛所，頭面禮足，却住一面，白佛言：「此人欲出家，唯願世尊哀愍度脫。」",
        "translation": "He was about to go to the Buddha, bowed his head and feet, withdrew to one side, and said to the Buddha, This man wants to leave home, so may the Bhagavān have mercy and liberation.",
        "source": "T22n1425_023:0415c13_1"
    },
    {
        "source_sentence": "佛即度之。",
        "translation": "The Buddha then liberated him.",
        "source": "T22n1425_023:0415c14_2"
    },
    {
        "source_sentence": "既出家已，白佛言：「世尊！",
        "translation": "After leaving home, he said to the Buddha, Bhagavān!",
        "source": "T22n1425_023:0415c15_3"
    },
    {
        "source_sentence": "唯願為我略說教誡，我欲到輸那國土，如說修行。」",
        "translation": "Please give me a brief instruction, and I want to go to the land of Śāna and cultivate it as you've been taught.",
        "source": "T22n1425_023:0415c15_4"
    },
    {
        "source_sentence": "佛即為隨順教誡，如綖經中廣說。",
        "translation": "The Buddha then follows and admonishes them, as explained in detail in the Śākyamuni sūtras.",
        "source": "T22n1425_023:0415c16_5"
    },
    {
        "source_sentence": "富樓那受教誡已，到輸那國。",
        "translation": "After Pūrṇa had received the instruction, he went to the country of Śāna.",
        "source": "T22n1425_023:0415c17_6"
    },
    {
        "source_sentence": "彼國中有一長者，名曰闥婆，為立栴檀房。",
        "translation": "In that country there was an elder named Upavāsa, who built a sandalwood dwelling for him.",
        "source": "T22n1425_023:0415c18_7"
    },
    {
        "source_sentence": "此中應廣說億耳因緣，乃至求請出家。",
        "translation": "Here, you should explain in detail the causes and conditions of millions of ears, even to the point where you ask for permission to leave home.",
        "source": "T22n1425_023:0415c19_8"
    },
    {
        "source_sentence": "富樓那度令出家作沙彌，乃至七年眾僧難得，不得受具足。",
        "translation": "Pūrṇa ordered him to leave home and become a novice, but even for seven years it was difficult for the saṃgha to receive the full ordination.",
        "source": "T22n1425_023:0415c20_9"
    },
    {
        "source_sentence": "七年已闥婆作栴檀房成，莊挍嚴飾，廣請眾僧施設供養，以房施富樓那。",
        "translation": "In the seventh year he had already built a sandalwood dwelling for the monks, decorated with ornaments and decorations. He invited the monks of the sangha to make offerings to furnishing the dwelling and gave it to Pūrṇa.",
        "source": "T22n1425_023:0415c21_10"
    },
    {
        "source_sentence": "爾時眾僧通持律十人，富樓那因僧集故，與億耳受具足。",
        "translation": "At the time, the saṃgha had ten people in common who upheld the precepts, and it was because the saṃgha gathered that Pūrṇa received the full set of precepts with a hundred million ears.",
        "source": "T22n1425_023:0415c23_11"
    },
    {
        "source_sentence": "受具足已，即白和上言：「我欲到舍衛禮覲世尊，唯願聽許。」",
        "translation": "After receiving the full set, he said to the monk, I want to go to Śrāvastī to pay my respects to the Bhagavān, but I'd like to hear his permission.",
        "source": "T22n1425_023:0415c24_12"
    },
    {
        "source_sentence": "答言：「隨意！",
        "translation": "He replied, As you wish!",
        "source": "T22n1425_023:0415c25_13"
    },
    {
        "source_sentence": "汝持我名問訊世尊，并乞五願。」",
        "translation": "Take my name and greet the Bhagavān, and ask for five vows.",
        "source": "T22n1425_023:0415c26_0"
    },
    {
        "source_sentence": "億耳受教，便行到佛所，頭面禮足，却住一面。",
        "translation": "Having been instructed by the Buddha, Kauṇḍinya went to the place where the Buddha was. After venerating him by bowing his forehead and feet, he withdrew and remained off to one side.",
        "source": "T22n1425_023:0415c26_1"
    },
    {
        "source_sentence": "佛語阿難：「為客比丘敷床褥。」",
        "translation": "The Buddha said to Ānanda, Set up a bed and mattress for the guest monk.",
        "source": "T22n1425_023:0415c27_2"
    },
    {
        "source_sentence": "若語阿難敷床褥者，當知與世尊同房宿；",
        "translation": "If you tell Ānanda to spread out a bed and bedding, you should know that you are sleeping in the same room as the World-honored One.",
        "source": "T22n1425_023:0415c28_3"
    },
    {
        "source_sentence": "若語尊者陀驃摩羅子者，當知隨次與房。",
        "translation": "If he speaks to Venerable Dharmarakṣa, you should know that he'll give them a room in order.",
        "source": "T22n1425_023:0415c29_4"
    },
    {
        "source_sentence": "如來初夜為諸聲聞說法，中夜還房圓光常明。",
        "translation": "On the first night, the Tathāgata preached the Dharma for the śrāvakas, and in the middle of the night he returned to his room with a circular light that always shone brightly.",
        "source": "T22n1425_023:0416a01_5"
    },
    {
        "source_sentence": "佛問比丘：「汝誦經不？」",
        "translation": "The Buddha asked the monk, Do you recite the sūtras?",
        "source": "T22n1425_023:0416a02_6"
    },
    {
        "source_sentence": "答言：「誦。」",
        "translation": "He replied, Recite it.",
        "source": "T22n1425_023:0416a02_7"
    },
    {
        "source_sentence": "「誦何等經？」",
        "translation": "What kind of sūtra does he recite?",
        "source": "T22n1425_023:0416a03_0"
    },
    {
        "source_sentence": "「誦《八跋祇經》。」",
        "translation": "Recite the Eight Fascicle Sutra.",
        "source": "T22n1425_023:0416a03_1"
    },
    {
        "source_sentence": "佛言：「汝可誦之。」",
        "translation": "The Buddha said, You may recite it.",
        "source": "T22n1425_023:0416a03_2"
    },
    {
        "source_sentence": "即細聲誦已，問於句義，一一能答。",
        "translation": "After reciting it in a subtle voice, he asks questions about the meaning of each phrase and can answer them one by one.",
        "source": "T22n1425_023:0416a03_3"
    },
    {
        "source_sentence": "佛言：「善哉！",
        "translation": "The Buddha said, Good!",
        "source": "T22n1425_023:0416a04_4"
    },
    {
        "source_sentence": "比丘，汝所誦者文字句義，如我先說。」",
        "translation": "Monks, the words and phrases that you recite have the same meaning as I've explained before.",
        "source": "T22n1425_023:0416a05_0"
    },
    {
        "source_sentence": "「聖人不樂惡，　　惡人不樂聖；",
        "translation": "“Noble people don’t delight in evil, And evil people don’t delight in the noble.",
        "source": "T22n1425_023:0416a05_1"
    },
    {
        "source_sentence": "　若見世間過，　　發心趣泥洹。」",
        "translation": "If he sees worldly faults, he arouses the intention to enter nirvāṇa.",
        "source": "T22n1425_023:0416a05_1"
    },
    {
        "source_sentence": "爾時世尊即說偈言：佛言：「善哉！",
        "translation": "It was then that the Bhagavān spoke a verse, saying, The Buddha said, Good!",
        "source": "T22n1425_023:0416a05_1"
    },
    {
        "source_sentence": "我弟子中捷疾解悟，億耳第一。」",
        "translation": "Among my disciples, I'm the quickest to understand and awaken, with a hundred million ears at the top.",
        "source": "T22n1425_023:0416a09_2"
    },
    {
        "source_sentence": "億耳即起頭面禮佛足，持和上名，從佛乞五願。",
        "translation": "The billion ears then stood up, bowed their heads and faces at the Buddha's feet, held Vātsīputrīya's name, and begged for five vows from the Buddha.",
        "source": "T22n1425_023:0416a09_3"
    },
    {
        "source_sentence": "如來聞是語已，晨起往眾多比丘所，敷尼師壇坐。",
        "translation": "After hearing these words, the Tathāgata got up in the morning and went to the many monks, spread out his nun's altar, and sat down.",
        "source": "T22n1425_023:0416a11_4"
    },
    {
        "source_sentence": "佛告諸比丘：「富樓那在輸那邊國，遣億耳來，從我乞五願。",
        "translation": "The Buddha told the monks, Pūrṇa was in the borderland of Śāna and sent millions of ears to ask for five vows from me.",
        "source": "T22n1425_023:0416a12_5"
    },
    {
        "source_sentence": "從今日後聽輸那邊國五願。",
        "translation": "From today onward, he'll hear the five vows of the kingdom of Śubhavyūha.",
        "source": "T22n1425_023:0416a13_6"
    },
    {
        "source_sentence": "何等五？",
        "translation": "What are these five?",
        "source": "T22n1425_023:0416a14_7"
    },
    {
        "source_sentence": "一者輸那邊地淨潔自喜，聽日日澡洗，此間半月。",
        "translation": "The first is that the people of the frontier [of Sāvatthī] are delighted with purity and cleanliness. They bathe and wash every day for one-half a month in this way.",
        "source": "T22n1425_023:0416a14_8"
    },
    {
        "source_sentence": "二者輸那邊地多礓石土塊及諸刺木，聽著兩重革屣，此間一重。",
        "translation": "Second, there are many lumps of pebble stones and thorns in the land bordering on Sūrya. They may hear two pairs of leather sandals, one of which is located here.",
        "source": "T22n1425_023:0416a15_9"
    },
    {
        "source_sentence": "三者輸那邊地少諸敷具、多諸皮韋，聽彼皮韋作敷具，此間不聽。",
        "translation": "Third, in the frontier of Sūrya there are few cloths and many leather garments. If one hears that leather garment is used for making cloths, he or she will not be allowed to do so here.",
        "source": "T22n1425_023:0416a17_10"
    },
    {
        "source_sentence": "四者輸那邊地少衣物、多死人衣，聽彼著死人衣，此間亦聽。",
        "translation": "Fourth, if there are few clothing and many dead people's robes in the borderlands of Śunā, listen while they wear dead people's robes, and this is also heard here.",
        "source": "T22n1425_023:0416a18_11"
    },
    {
        "source_sentence": "五者輸那邊地少於比丘，聽彼五眾受具足，此間十眾自受具足，善來受具足，十眾白三羯磨受具足。",
        "translation": "Fifth, a monk from the side of Śunā listens to the five groups of people who receive the full set of precepts. The ten groups of people here receive the full set of precepts for themselves, the well-comed one receives the full set of precepts, and the ten groups of people give the full set of precepts to the three bhikṣus.",
        "source": "T22n1425_023:0416a19_12"
    },
    {
        "source_sentence": "輸那邊地五眾白三羯磨受具足，是名四種受具足。」",
        "translation": "These are the four kinds of recipients who receive the full set of the three white karmas from the five congregations at the side of Śāna, which are called the four kinds of recipients.",
        "source": "T22n1425_023:0416a22_13"
    },
    {
        "source_sentence": "復次佛住舍衛城，廣說如上。",
        "translation": "Furthermore, the Buddha stayed in Śrāvastī and explained it in detail as above.",
        "source": "T22n1425_023:0416a23_14"
    },
    {
        "source_sentence": "爾時尊者優波離有二沙彌：一名陀婆伽，二名婆羅伽。",
        "translation": "It was then that Venerable Upāli had two śrāmaṇeras, one named Devadatta and two named Bālāga.",
        "source": "T22n1425_023:0416a24_0"
    },
    {
        "source_sentence": "此二沙彌小小長養，年滿二十欲受具足，作是念：「若當先與一受者，後者必有恨心，得同一和上、一眾、一戒師、一時並受具足不？」",
        "translation": "These two śrāmaṇeras, a small and long-lived monk who was 20 years old and wanted to receive the full set of precepts, thought, If he were to give one precept first, would the latter have an angry mind and attain the same level of superiority, congregation, preceptor, or timely endowment?",
        "source": "T22n1425_023:0416a25_1"
    },
    {
        "source_sentence": "優波離作是念已，往至佛所，頭面禮足却坐一面，具以上事，白佛言：「世尊！",
        "translation": "After he had this thought, Upāli went to the Buddha, bowed his head and feet, withdrew to sit at one side, explained the above, and said to the Buddha, Bhagavān!",
        "source": "T22n1425_023:0416a28_2"
    },
    {
        "source_sentence": "得共一和上、一戒師、一眾，得並受具足不？」",
        "translation": "Can you share with one monk, one preceptor, one preceptor, and one congregation the full set of precepts?",
        "source": "T22n1425_023:0416a29_3"
    },
    {
        "source_sentence": "佛言：「得。」",
        "translation": "The Buddha said, Yes.",
        "source": "T22n1425_023:0416b01_4"
    },
    {
        "source_sentence": "如是二人、三人亦得並受，不得眾受，是名受具足。",
        "translation": "Thus, these two people and three people can also receive it together, but they can't receive it in many ways, which is called receiving the full set of precepts.",
        "source": "T22n1425_023:0416b01_5"
    },
    {
        "source_sentence": "一人、二和上、三和上、眾多和上，不名受具足。",
        "translation": "One person, two monks, three monks, and many monks aren't called fully ordained.",
        "source": "T22n1425_023:0416b03_6"
    },
    {
        "source_sentence": "無羯磨師不名受具足。",
        "translation": "There's no karma master who isn't called a fully ordained one.",
        "source": "T22n1425_023:0416b04_7"
    },
    {
        "source_sentence": "二人、三人共一羯磨師，別和上，共一眾並受，不名受具足。",
        "translation": "When two people or three people share the same karma master, they're separately reconciled and accepted together with one group of people, which isn't called receiving the full set of precepts.",
        "source": "T22n1425_023:0416b04_8"
    },
    {
        "source_sentence": "二人，羯磨二人、三人羯磨，三人別和上，共一眾並受，不名受具足。",
        "translation": "Two people, two people in the karma, two people in the karma, three people in the karma, three people who are separately reconciled and accepted together with one group of people, aren't called fully ordained.",
        "source": "T22n1425_023:0416b06_0"
    },
    {
        "source_sentence": "復有不名受具足，和上在十人數，不名受具足，以欲受具足人足十人數、以比丘尼足十人數、以與欲人足十人數者，不名受具足。",
        "translation": "Again, there's someone who isn't called receiving the full set of precepts, and the monk or nun who receives the full set of precepts because he wants to receive the full set of precepts for ten people, ten people by reason of their number, ten people by reason of their number, ten people by reason of their number, and ten people by reason of their number doesn't receive the full set of precepts",
        "source": "T22n1425_023:0416b07_1"
    },
    {
        "source_sentence": "若不稱和上名字、不稱受具足人名字、不稱僧名字，不名受具足。",
        "translation": "If someone doesn't call the names of the superiors, don't call the names of the people who are fully ordained, and don't call the names of the saṃgha, they aren't called fully ordained.",
        "source": "T22n1425_023:0416b10_2"
    },
    {
        "source_sentence": "若和上說羯磨、受具足人說羯磨、比丘尼說羯磨，皆不名受具足。",
        "translation": "If a monk explains the karma, a person who receives the full set of precepts explains the karma, and a monk or nun explains the karma, they aren't called receiving the full set of precepts.",
        "source": "T22n1425_023:0416b11_3"
    },
    {
        "source_sentence": "若和上在空中、受戒人在空中、僧在空中、一切在空中，皆不名受具足。",
        "translation": "If the monk is in the air, the person who receives the precepts is in the air, the saṃgha is in the air, and all of them are in the air, they aren't called fully ordained.",
        "source": "T22n1425_023:0416b13_4"
    },
    {
        "source_sentence": "若半在地、半在空中，不名受具足。",
        "translation": "If it's half on the ground and half in the air, it's not called fully ordained.",
        "source": "T22n1425_023:0416b15_0"
    },
    {
        "source_sentence": "若隔障，不名受具足。",
        "translation": "If they are separated by hindrances, they aren't called fully endowed with sensation.",
        "source": "T22n1425_023:0416b15_1"
    },
    {
        "source_sentence": "半在覆處、中間隔障，不名受具足。",
        "translation": "It's not called receiving the full set of precepts when it's halfway between the obscurations and the intermediate hindrances.",
        "source": "T22n1425_023:0416b16_2"
    },
    {
        "source_sentence": "半覆半露地、申手不相及，不名受具足。",
        "translation": "It's not called receiving the full set of precepts when it's half covered, half exposed, or with hands that aren't touching each other.",
        "source": "T22n1425_023:0416b17_0"
    },
    {
        "source_sentence": "一切露處坐，身手不相及，一切覆處不得離見聞處，離者不名受具足。",
        "translation": "When he sits in all open places, his body and hands don't touch each other, and when he doesn't leave the place where he sees and hears anything covered, those who leave it aren't called fully ordained.",
        "source": "T22n1425_023:0416b17_1"
    },
    {
        "source_sentence": "復次不名受具足者，若眠、若癡、若狂、若心亂、若苦病所纏，不名受具足。",
        "translation": "Furthermore, it's not called receiving the full set of precepts because it's not called receiving the full set if it's drowsy, deluded, crazy, mentally disturbed, or tethered by pain and illness.",
        "source": "T22n1425_023:0416b19_2"
    },
    {
        "source_sentence": "復次不名受具足者，若受具足人不語、若心念、若大喚，不名受具足。",
        "translation": "Furthermore, it's not called receiving the full set of precepts because if someone who receives the full set doesn't speak, or if they are mindful and call out loudly, they aren't called receiving the full set of precepts.",
        "source": "T22n1425_023:0416b21_3"
    },
    {
        "source_sentence": "復次不名受具足者，若遣書、遣印、舉手、作相，不名受具足。",
        "translation": "Furthermore, someone who isn't called fully ordained is not called fully ordained if he sends a letter, sends out a seal, raises his hand, or makes a sign, and they aren't called fully ordained.",
        "source": "T22n1425_023:0416b22_4"
    },
    {
        "source_sentence": "人不現前、不問前人不欲、非法不和合、眾不成就、白不成就、羯磨不成就，若一一不成就，不名受具足。",
        "translation": "If someone doesn't appear before them, doesn't ask questions that the person before them don't want, doesn't harmonize with what's unlawful, doesn't accomplish it in congregations, doesn't accomplish it in words, and doesn't accomplish it in karman, and doesn't accomplish it in one by one, they won't be called fully ordained.",
        "source": "T22n1425_023:0416b24_0"
    },
    {
        "source_sentence": "復次不名受具足者，壞比丘尼淨行、賊盜住、越濟人、五逆、六種不男、太少、太老、截手、截脚、截手脚、截耳、截鼻、復截耳鼻、若盲、若聾、若盲聾、若瘂、若躄、若瘂躄、若鞭瘢、印瘢、若拔筋、剋筋、曲脊、王臣、負債、病、外道兒、奴身、不具、陋色、壞比丘尼淨行者。",
        "translation": "Furthermore, those who aren't called recipients of the precepts will disrupt the pure practices of monks and nuns, thieves and thieves, surpass people, the five heinous crimes, the six kinds of non-male, too young, too old, cutting their hands, cutting their feet, cutting their hands, cutting their feet, cutting their ears, cutting their nose,",
        "source": "T22n1425_023:0416b26_1"
    },
    {
        "source_sentence": "佛住毘舍離，爾時奄婆羅離車童子，壞法豫比丘尼弟子梵行。",
        "translation": "When the Buddha was staying at Vaiśālī, it was then that the boy Ambapālī's chariot boy disrupted the religious practice of the monks and nuns of Fayuan.",
        "source": "T22n1425_023:0416c03_0"
    },
    {
        "source_sentence": "時法豫比丘尼往世尊所，頭面禮足却住一面，白佛言：「世尊！",
        "translation": "The monks and nuns then went to the Bhagavān, bowed their heads and feet, withdrew to one side, and said to the Buddha, Bhagavān!",
        "source": "T22n1425_023:0416c04_1"
    },
    {
        "source_sentence": "離車童子壞我弟子梵行。」",
        "translation": "Boy Licchavi breaks my disciple's religious practice.",
        "source": "T22n1425_023:0416c05_2"
    },
    {
        "source_sentence": "作是語已，禮佛而去。",
        "translation": "Having said these words, he bowed to the Buddha and departed.",
        "source": "T22n1425_023:0416c06_3"
    },
    {
        "source_sentence": "佛語阿難：「汝取我僧伽梨來，入毘舍離城。」",
        "translation": "The Buddha said to Ānanda, Take my saṃghāraṇī and enter the city of Vaiśālī.",
        "source": "T22n1425_023:0416c06_4"
    },
    {
        "source_sentence": "阿難即取僧伽梨來，授與世尊。",
        "translation": "Ānanda then took the saṃghāṭi and gave it to the Bhagavān.",
        "source": "T22n1425_023:0416c07_5"
    },
    {
        "source_sentence": "如來、應供、正遍知從成佛已來，未曾食後入城邑聚落。",
        "translation": "The Tathāgata, Worthy of Offerings, and Perfectly Enlightened One have never entered cities or villages after they've become buddhas since they became buddhas.",
        "source": "T22n1425_023:0416c08_6"
    },
    {
        "source_sentence": "爾時世尊與阿難共入毘舍離城，時五百離車集在論議堂上，欲論餘事。",
        "translation": "It was then that the Bhagavān and Ānanda entered the city of Vaiśālī together, and five hundred Licchavi chariots assembled in the discussion hall to discuss other matters.",
        "source": "T22n1425_023:0416c09_7"
    },
    {
        "source_sentence": "遙見世尊來，展轉自相謂言：「如來有何事故，食後入城？",
        "translation": "From a distance, they saw the Bhagavān coming and said to each other in turn, What's the matter with the Tathāgata that he entered the city after his meal?",
        "source": "T22n1425_023:0416c11_8"
    },
    {
        "source_sentence": "故當有以。」",
        "translation": "Therefore, there will be a way to do so.",
        "source": "T22n1425_023:0416c12_9"
    },
    {
        "source_sentence": "時梨車等即起，與佛敷座往迎世尊，[跍*月]跪合掌，白佛言：「善來世尊！",
        "translation": "Licchavi and the others then rose, spread their seats with the Buddha to greet the Bhagavān, knelt down with joined palms, and said to him, Well come, Bhagavān!",
        "source": "T22n1425_023:0416c12_10"
    },
    {
        "source_sentence": "唯願世尊坐此座上。」",
        "translation": "Please, Bhagavān, please sit on this seat.",
        "source": "T22n1425_023:0416c14_11"
    },
    {
        "source_sentence": "爾時世尊敷尼師壇坐，諸梨車頭面禮佛足，却坐一面。",
        "translation": "At that time the World-honored One was seated on the prepared altar. The Licchavi Vimalakīrti bowed at the Buddha’s feet and withdrew to sit off to one side.",
        "source": "T22n1425_023:0416c14_12"
    },
    {
        "source_sentence": "佛語梨車：「汝等眷屬宜應防護，如我弟子比丘尼亦應防護。",
        "translation": "The Buddha said to Licchavi, It's advisable for your retinues to guard them, just as my disciples and monks and nuns should guard them.",
        "source": "T22n1425_023:0416c16_13"
    },
    {
        "source_sentence": "設人侵犯，若欲不欲壞梵行者，如我法中盡壽不共語、不共住、不共食。」",
        "translation": "Suppose someone violates it and wants to or doesn't want to disrupt the religious practice, then according to my teaching, they won't speak, live together, or eat together for the rest of their life.",
        "source": "T22n1425_023:0416c17_14"
    },
    {
        "source_sentence": "梨車白佛言：「如世尊法中，壞梵行者，不共語、不共住、不共食。",
        "translation": "Licchavi Vimalakīrti said to the Buddha: According to the teaching of the World-honored One, anyone who disrupts the practice of austerity should not speak, live, or eat together.",
        "source": "T22n1425_023:0416c19_0"
    },
    {
        "source_sentence": "我俗法中亦復如是，盡壽不共語、不共住、不共食。」",
        "translation": "So it is with self and secular dharmas that they don't speak together, live together, or eat together for the rest of their lives.",
        "source": "T22n1425_023:0416c20_1"
    },
    {
        "source_sentence": "爾時世尊為諸梨車隨順說法，發歡喜心已而去。",
        "translation": "The Bhagavān then taught the Dharma to the Licchavi, became joyous, and departed.",
        "source": "T22n1425_023:0416c21_2"
    },
    {
        "source_sentence": "去不久，法豫比丘尼尋至梨車所，作是語：「諸居士！",
        "translation": "Soon after his departure, the monks and nuns of Fayu went to Licchavi and said, householders!",
        "source": "T22n1425_023:0416c22_3"
    },
    {
        "source_sentence": "奄婆羅梨車童子壞我弟子梵行，此是不善非是順法。」",
        "translation": "This is an unwholesome and not a compliant practice for the boy Amṛta, who disrupts my disciple's religious practice.",
        "source": "T22n1425_023:0416c24_0"
    },
    {
        "source_sentence": "諸梨車聞已，自相謂言：「世尊向所說正為此耳。」",
        "translation": "After they heard it, the Licchavi said to each other, Bhagavān, this is exactly what you've been saying.",
        "source": "T22n1425_023:0416c25_1"
    },
    {
        "source_sentence": "即大慚愧，語比丘尼言：「欲使我等作何等治？」",
        "translation": "He was greatly ashamed and said to the monks and nuns, What kind of remedy would you like us to do?",
        "source": "T22n1425_023:0416c26_2"
    },
    {
        "source_sentence": "比丘尼言：「當易其姓，唱非梨車，迴門西向，破其食厨，壞其屋檐周匝一肘。」",
        "translation": "The monks and nuns said, You must change your family name, call out a non-frivolous chariot, turn around to the west of the door, break open the food kitchen, and destroy the eaves of the house one elbow in circumference.",
        "source": "T22n1425_023:0416c27_3"
    },
    {
        "source_sentence": "答言：「受教。」",
        "translation": "He replied, Accept the teaching.",
        "source": "T22n1425_023:0416c29_0"
    },
    {
        "source_sentence": "即唱非梨車，迴門西向乃至毀其屋檐。",
        "translation": "He then called out a non-riding chariot, turned westward through the door, and even destroyed its roof.",
        "source": "T22n1425_023:0416c29_1"
    },
    {
        "source_sentence": "爾時世尊往眾多比丘所，敷尼師壇坐，以是上事具為諸比丘說：「破尼淨行者，若阿羅漢尼、阿那含尼，若初中後，一切皆名壞尼淨行。",
        "translation": "It was then that the Bhagavān went to the many monks, spread out his altar and seated himself at the nun's master's seat, and explained these above-mentioned things for the monks, A woman who breaks the nun's pure practice is called a woman who breaks the nun's pure practice if she's an arhat or non-returner, or if she doesn't follow them",
        "source": "T22n1425_023:0417a01_2"
    },
    {
        "source_sentence": "若斯陀含尼、須陀洹尼、凡夫持戒尼，初若受樂者，是名壞尼淨行，中後不名壞。」",
        "translation": "If a once-returner nun, a stream entrant nun, a stream entrant nun, or a worldly nun who observes precepts are first to receive pleasure, this is called a broken nun's pure practice, and the middle and latter aren't called a break.",
        "source": "T22n1425_023:0417a04_3"
    },
    {
        "source_sentence": "爾時有摩訶羅，本俗人時壞比丘尼淨行，心生疑惑，即白佛言：「世尊！",
        "translation": "At the time, there was Mahāra, a native layman who disrupted the bhikṣuṇī's pure practice and had doubts in his mind, and he said to the Buddha, Bhagavān!",
        "source": "T22n1425_023:0417a06_0"
    },
    {
        "source_sentence": "我本俗人時壞比丘尼淨行。」",
        "translation": "When I was a layman in my native land, I disrupted the pure practice of monks and nuns.",
        "source": "T22n1425_023:0417a07_1"
    },
    {
        "source_sentence": "佛告諸比丘：「是摩呵羅自言壞比丘尼淨行，驅出。」",
        "translation": "The Buddha told the monks, This is Mahāra who says he destroys the bhikṣuṇī's pure practice and drives it out.",
        "source": "T22n1425_023:0417a08_2"
    },
    {
        "source_sentence": "諸比丘即驅出。",
        "translation": "The monks then expelled him.",
        "source": "T22n1425_023:0417a09_3"
    },
    {
        "source_sentence": "若壞比丘尼淨行，不應與出家；",
        "translation": "If a bhikṣuṇī breaks the precepts, he or she should not be allowed to renounce household life.",
        "source": "T22n1425_023:0417a09_4"
    },
    {
        "source_sentence": "若已出家者應驅出。",
        "translation": "If someone has left home, they should be expelled.",
        "source": "T22n1425_023:0417a10_5"
    },
    {
        "source_sentence": "若度出家受具足，越比尼罪。",
        "translation": "If he renounces the householder's life and receives full ordination, he'll be guilty of transgressing the vinaya.",
        "source": "T22n1425_023:0417a10_6"
    },
    {
        "source_sentence": "是名壞比丘尼淨行。",
        "translation": "This is called the pure practice of destroying monks and nuns.",
        "source": "T22n1425_023:0417a11_7"
    },
    {
        "source_sentence": "盜住者，佛住舍衛城，廣說如上。",
        "translation": "Stealing is when the Buddha lives in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0417a12_0"
    },
    {
        "source_sentence": "爾時有檀越就精舍中飯僧，時有一人黑色大腹來在上座處坐，須臾僧上座來問：「汝幾臘？」",
        "translation": "It was then that a donor went to the monastery to feed the saṃgha, and a man with a large black belly came to sit in the upper seat.",
        "source": "T22n1425_023:0417a13_1"
    },
    {
        "source_sentence": "答言：「坐處食飯一種，用苦問歲為？」",
        "translation": "He replied, There's one kind of food that's eaten at the seat, and what's the year for which it's asked with pain?",
        "source": "T22n1425_023:0417a15_2"
    },
    {
        "source_sentence": "上座威德嚴肅言：「咄！",
        "translation": "The superior monk's authoritative and solemn voice was, Duh!",
        "source": "T22n1425_023:0417a16_3"
    },
    {
        "source_sentence": "汝下去！」",
        "translation": "Come down!",
        "source": "T22n1425_023:0417a16_4"
    },
    {
        "source_sentence": "復坐第二上座處，須臾第二上座來問：「汝幾歲？」",
        "translation": "Again, he sat at the place of the second supreme seat, and a moment later, the second supreme seat came and asked, How old are you?",
        "source": "T22n1425_023:0417a17_5"
    },
    {
        "source_sentence": "答言：「坐處食飯一種，用苦問為？」",
        "translation": "He replied, What's the kind of food that's eaten at the seat and asked for with pain?",
        "source": "T22n1425_023:0417a18_6"
    },
    {
        "source_sentence": "如是展轉，乃至沙彌中，沙彌推排問言：「誰是汝和上？",
        "translation": "In this way they proceeded one after the other, until among the śrāmaṇerīs. The śrāmaṇeras questioned them in vain, saying: Who is your superior?",
        "source": "T22n1425_023:0417a18_7"
    },
    {
        "source_sentence": "誰是汝師？",
        "translation": "Who is your teacher?",
        "source": "T22n1425_023:0417a20_8"
    },
    {
        "source_sentence": "沙彌有幾戒？",
        "translation": "How many precepts does a novice have?",
        "source": "T22n1425_023:0417a20_9"
    },
    {
        "source_sentence": "沙彌應數有幾？",
        "translation": "How many śrāmaṇeras should there be?",
        "source": "T22n1425_023:0417a20_10"
    },
    {
        "source_sentence": "初名何等？",
        "translation": "What's the first name?",
        "source": "T22n1425_023:0417a21_0"
    },
    {
        "source_sentence": "一者、一切眾生皆仰食。",
        "translation": "1. All sentient beings aspire to food.",
        "source": "T22n1425_023:0417a21_1"
    },
    {
        "source_sentence": "二、二名色。",
        "translation": "2. the two names and forms.",
        "source": "T22n1425_023:0417a21_2"
    },
    {
        "source_sentence": "三、三痛想。",
        "translation": "3. the perception of the three pains...",
        "source": "T22n1425_023:0417a22_0"
    },
    {
        "source_sentence": "四、四聖諦。",
        "translation": "4. the four noble truths.",
        "source": "T22n1425_023:0417a22_1"
    },
    {
        "source_sentence": "五、五陰。",
        "translation": "5. the five aggregates...",
        "source": "T22n1425_023:0417a22_2"
    },
    {
        "source_sentence": "六、六入。",
        "translation": "6. the six sense-fields...",
        "source": "T22n1425_023:0417a22_3"
    },
    {
        "source_sentence": "七、七覺意。",
        "translation": "7. the meaning of the seven kinds of awakening...",
        "source": "T22n1425_023:0417a22_4"
    },
    {
        "source_sentence": "八、八正道。",
        "translation": "The eighth and eighth are the right path.",
        "source": "T22n1425_023:0417a23_5"
    },
    {
        "source_sentence": "九、九眾生居。",
        "translation": "9. the nine abodes of sentient beings...",
        "source": "T22n1425_023:0417a23_6"
    },
    {
        "source_sentence": "十、十一切入。",
        "translation": "10. The ten all-inclusive entry.",
        "source": "T22n1425_023:0417a23_7"
    },
    {
        "source_sentence": "沙彌法應如是數。」",
        "translation": "Such are the number of śrāmaṇer dharmas that should be counted.",
        "source": "T22n1425_023:0417a24_0"
    },
    {
        "source_sentence": "答言：「我是難陀、優波難陀上眾弟子。」",
        "translation": "He replied, I'm the superior disciples of Nanda and Upananda.",
        "source": "T22n1425_023:0417a24_1"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊。",
        "translation": "The monks went to the Bhagavān for this reason and told him.",
        "source": "T22n1425_023:0417a25_2"
    },
    {
        "source_sentence": "佛言：「非難陀、優波難陀上眾弟子，此是自出家人。",
        "translation": "The Buddha said, These aren't the disciples of Upananda and Upananda, but these are their own renunciants.",
        "source": "T22n1425_023:0417a25_3"
    },
    {
        "source_sentence": "若如是人比未曾入布薩自恣中，後有好心得與出家受具足。",
        "translation": "If such a person has never entered the self-restraint of the bodhisattva before, then they'll have a good intention to leave home and be fully ordained.",
        "source": "T22n1425_023:0417a27_0"
    },
    {
        "source_sentence": "若曾入布薩自恣中者，是名盜住，不聽出家受具足。",
        "translation": "If someone has ever entered the bodhisattva's self-restraint, this is called a stealing abode that doesn't allow them to leave home and be fully ordained.",
        "source": "T22n1425_023:0417a28_1"
    },
    {
        "source_sentence": "若王子、若大臣子避難故自著袈裟，未經布薩自恣者，得與出家。",
        "translation": "If a prince or a minister's son has taken refuge and puts on his own reddish-brown robes, he can be given to leave home if he doesn't perform the self-restraint without having done so.",
        "source": "T22n1425_023:0417a29_2"
    },
    {
        "source_sentence": "若曾經布薩自恣者，不聽出家。」",
        "translation": "If someone had previously performed a ritual for self-restraint, they won't be allowed to leave home.",
        "source": "T22n1425_023:0417b02_3"
    },
    {
        "source_sentence": "若沙彌作是念：「說戒時論說何等？」",
        "translation": "Suppose a monk thinks, What's taught in the discussion when he teaches the precepts?",
        "source": "T22n1425_023:0417b02_4"
    },
    {
        "source_sentence": "即先入上座床下盜聽。",
        "translation": "He then first entered the upper seat under the bed and stole to listen.",
        "source": "T22n1425_023:0417b03_5"
    },
    {
        "source_sentence": "若沙彌聰明、若覺知初中後語者，後不得受具足。",
        "translation": "If a novice is intelligent and perceives the first and second words in the beginning, he won't be able to receive the full set of precepts later.",
        "source": "T22n1425_023:0417b04_6"
    },
    {
        "source_sentence": "若闇鈍、若眠、若意緣餘念，不記初中後語者，後得受具足。",
        "translation": "If he's dull, sleepy, or mentally conditioned by other thoughts, and doesn't record the first, middle, or last words, he'll subsequently attain their fulfillment.",
        "source": "T22n1425_023:0417b05_7"
    },
    {
        "source_sentence": "若盜住，不應與出家；",
        "translation": "If someone steals, they should not be allowed to renounce the householder’s life.",
        "source": "T22n1425_023:0417b06_8"
    },
    {
        "source_sentence": "若已出家者，應驅出。",
        "translation": "If someone has left home, they should be expelled.",
        "source": "T22n1425_023:0417b07_0"
    },
    {
        "source_sentence": "若度出家受具足者，得越比尼罪，是名盜住。",
        "translation": "If someone who renounces the householder's life and receives the full set of precepts commits the sin of transgressing the vinaya, which is called stealing and abiding.",
        "source": "T22n1425_023:0417b07_1"
    },
    {
        "source_sentence": "越濟者，佛住舍衛城，廣說如上。",
        "translation": "A transgression is when the Buddha lives in Śrāvastī and explains it in detail as above.",
        "source": "T22n1425_023:0417b08_2"
    },
    {
        "source_sentence": "爾時有人食前著沙門標幟，手捉黑鉢入聚落乞食，食後著外道標幟，手捉木鉢，復逐人入林中池水園觀處乞食，為世人所嫌：「云何沙門釋子入聚落中，從我家乞食，今來入林復不得脫？」",
        "translation": "It was then that a man wearing the sign of the ascetic in front of his food and holding a black bowl in his hand entered the village to solicit alms. After he ate, he wore the sign of the non-Buddhist path in front of him, held a wooden bowl in his hand, and again followed someone else into the forest to beg for food at the pond, water, park, and monastery,",
        "source": "T22n1425_023:0417b09_3"
    },
    {
        "source_sentence": "復有人言：「汝不知耶？",
        "translation": "Again, someone said, Don't you know?",
        "source": "T22n1425_023:0417b13_4"
    },
    {
        "source_sentence": "此沙門諂曲，為衣食故兼兩入。」",
        "translation": "This ascetic is flattering, and he enters both ways for the sake of food and clothing.",
        "source": "T22n1425_023:0417b14_5"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊。",
        "translation": "The monks went to the Bhagavān for this reason and told him.",
        "source": "T22n1425_023:0417b14_6"
    },
    {
        "source_sentence": "佛言：「此名越濟人，捨沙門標幟，執外道標幟；",
        "translation": "The Buddha said: This is called the people of Yueji. They abandoned the signposts for renunciants and adopted the signposts for heretics.",
        "source": "T22n1425_023:0417b15_7"
    },
    {
        "source_sentence": "捨外道標幟，復執沙門標幟，如是越濟人不應與出家，若與出家者應驅出。",
        "translation": "They abandon the signs of non-Buddhist teachings and again carry the signs of ascetics. Thus, people in Yueji shouldn't be given renunciation, and if they are given renunciation, they should be expelled.",
        "source": "T22n1425_023:0417b16_8"
    },
    {
        "source_sentence": "若度出家受具足者，得越比尼罪。",
        "translation": "If someone renounces the householder's life and receives the full ordination, they'll be guilty of transgressing the vinaya.",
        "source": "T22n1425_023:0417b18_9"
    },
    {
        "source_sentence": "是名越濟人。」",
        "translation": "This is called a person of transcendence.",
        "source": "T22n1425_023:0417b19_10"
    },
    {
        "source_sentence": "五無間者，佛住舍衛城，廣說如上。",
        "translation": "The five kinds of unremitting are when the Buddha abides in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0417b19_11"
    },
    {
        "source_sentence": "爾時都夷婆羅門是舍利弗舊善知識，來至舍利弗所作是言：「尊者！",
        "translation": "It was then that the Brāhmaṇa Tuṣita, an old good friend of Śāriputra's, came to Śāriputra and said, Venerable!",
        "source": "T22n1425_023:0417b20_12"
    },
    {
        "source_sentence": "與我出家。」",
        "translation": "Give me permission to leave home.",
        "source": "T22n1425_023:0417b21_13"
    },
    {
        "source_sentence": "舍利弗答言：「此是好事，汝婆羅門常與沙門相反，何處得信心？",
        "translation": "Śāriputra replied, This is good. You brāhmaṇas always oppose the śramaṇas, so where can you have faith?",
        "source": "T22n1425_023:0417b21_14"
    },
    {
        "source_sentence": "從誰聞法發歡喜心？",
        "translation": "From whom did you hear the Dharma and give rise to the mind of joy?",
        "source": "T22n1425_023:0417b23_15"
    },
    {
        "source_sentence": "世尊邊耶？",
        "translation": "Is the Bhagavān's side?",
        "source": "T22n1425_023:0417b23_16"
    },
    {
        "source_sentence": "諸比丘邊耶？」",
        "translation": "Is it the limit of the monks?",
        "source": "T22n1425_023:0417b24_17"
    },
    {
        "source_sentence": "婆羅門言：「我亦無信心，復無歡喜，亦不從他聞。",
        "translation": "The brāhmaṇa said, “I have no faith either. I am neither encouraged nor delighted; I do not listen to anyone’s words.",
        "source": "T22n1425_023:0417b24_18"
    },
    {
        "source_sentence": "但我殺母欲除此罪，是故出家。」",
        "translation": "But I killed my mother in order to remove this sin, so I left home.",
        "source": "T22n1425_023:0417b25_19"
    },
    {
        "source_sentence": "舍利弗言：「待我問世尊還。」",
        "translation": "Śāriputra said, Wait until I ask the Bhagavān to return.",
        "source": "T22n1425_023:0417b26_20"
    },
    {
        "source_sentence": "舍利弗以是因緣往白世尊。",
        "translation": "Śāriputra went to the Bhagavān for this reason.",
        "source": "T22n1425_023:0417b26_21"
    },
    {
        "source_sentence": "佛言：「此人殺母作無間罪，腐敗爛種，於正法中不生聖法，不應與出家。」",
        "translation": "The Buddha said, This man killed his mother because he committed an unremitting sin and rotted the rotten seeds, which won't give rise to the noble Dharma in the right teaching and shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0417b27_22"
    },
    {
        "source_sentence": "復次佛住舍衛城，廣說如上。",
        "translation": "Furthermore, the Buddha stayed in Śrāvastī and explained it in detail as above.",
        "source": "T22n1425_023:0417b28_23"
    },
    {
        "source_sentence": "都夷婆羅門是阿難舊善知識，往阿難所作是言：「尊者！",
        "translation": "The śramaṇa Kauṇḍinya, who was an old friend of Ānanda's, went to Ānanda and said, Venerable!",
        "source": "T22n1425_023:0417b29_24"
    },
    {
        "source_sentence": "我欲出家。」",
        "translation": "I want to leave home.",
        "source": "T22n1425_023:0417c01_25"
    },
    {
        "source_sentence": "阿難言：「此是好事。」",
        "translation": "Ānanda said, This is good.",
        "source": "T22n1425_023:0417c02_26"
    },
    {
        "source_sentence": "乃至佛語阿難：「此人殺父作無間罪，腐敗壞爛，於正法中不能生道根栽，正使七佛一時出世為其說法，於正法中終不生善。",
        "translation": "Even so, the Buddha said to Ānanda, This man killed his father and committed an unremitting sin, rotting away and disintegrating, which prevents the roots of the path from being planted in the right teaching. It's precisely because seven buddhas will appear in the world at once to preach for him, and goodness won't arise in the right teaching.",
        "source": "T22n1425_023:0417c02_27"
    },
    {
        "source_sentence": "喻如多羅樹頭斷則不生，不青亦不中種。",
        "translation": "It's a metaphor like the top of a palm tree that doesn't grow when it's cut off, which isn't blue and doesn't plant in the middle.",
        "source": "T22n1425_023:0417c05_28"
    },
    {
        "source_sentence": "是五無間罪亦復如是，於正法中不生聖種。",
        "translation": "So it is with these five kinds of unremitting sins, which don't give rise to noble seeds in the right teaching.",
        "source": "T22n1425_023:0417c06_29"
    },
    {
        "source_sentence": "若作五無間罪者，不應與出家；",
        "translation": "If someone commits one of the five kinds of unremitting sins, they should not be allowed to leave home.",
        "source": "T22n1425_023:0417c07_30"
    },
    {
        "source_sentence": "已與出家者，應驅出。",
        "translation": "Those who have renounced the householder's life should be expelled.",
        "source": "T22n1425_023:0417c08_31"
    },
    {
        "source_sentence": "若度出家受具足，越比尼罪。",
        "translation": "If he renounces the householder's life and receives full ordination, he'll be guilty of transgressing the vinaya.",
        "source": "T22n1425_023:0417c08_32"
    },
    {
        "source_sentence": "餘三無間亦如是，是名五無間罪。」",
        "translation": "The other three kinds of unremitting are likewise, which are called the five unremitting sins.",
        "source": "T22n1425_023:0417c09_33"
    },
    {
        "source_sentence": "六種不能男者，佛住舍衛城，廣說如上。",
        "translation": "The six kinds of those who can't be male are the buddhas living in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0417c09_34"
    },
    {
        "source_sentence": "爾時諸比丘夜房中眠，有人來摸索脚、摸索髀腹，復至非處。",
        "translation": "It was then that the monks were sleeping in their room at night, and someone came to touch their feet or thighs and belly and went back to a place where they hadn't been.",
        "source": "T22n1425_023:0417c10_35"
    },
    {
        "source_sentence": "比丘欲捉取，便走出去。",
        "translation": "The monk wanted to take it, so he went out of the house.",
        "source": "T22n1425_023:0417c12_36"
    },
    {
        "source_sentence": "復到餘處、堂上、溫室處處如是。",
        "translation": "Again, he goes to other places, halls, and warm quarters like this.",
        "source": "T22n1425_023:0417c12_37"
    },
    {
        "source_sentence": "明日諸比丘共聚一處，自相謂言：「諸長老！",
        "translation": "On the next day, the monks gathered together in one place and said to each other, Elders!",
        "source": "T22n1425_023:0417c13_38"
    },
    {
        "source_sentence": "昨夜眠時有人來，處處摸索，乃至非處。",
        "translation": "Yesterday night someone came when he was asleep, touching everywhere and even going to the wrong place.",
        "source": "T22n1425_023:0417c14_39"
    },
    {
        "source_sentence": "正欲捉取即便走去。」",
        "translation": "They're just about to grab it and even run away.",
        "source": "T22n1425_023:0417c15_40"
    },
    {
        "source_sentence": "復有比丘言：「我亦如是。」",
        "translation": "Another monk said, So it is with me.",
        "source": "T22n1425_023:0417c15_41"
    },
    {
        "source_sentence": "乃至眾多亦復如是。",
        "translation": "It's likewise with many people.",
        "source": "T22n1425_023:0417c16_42"
    },
    {
        "source_sentence": "有一比丘作是念：「我今夜要當伺捕捉取。」",
        "translation": "A monk thought, Tonight, I'll have to wait and catch it.",
        "source": "T22n1425_023:0417c16_43"
    },
    {
        "source_sentence": "是比丘至暮，先眠伺之。",
        "translation": "When the monk arrived at dusk, he first slept and waited for him.",
        "source": "T22n1425_023:0417c17_44"
    },
    {
        "source_sentence": "諸比丘眠已，復來摸索如前，即便捉得，作是語：「諸長老！",
        "translation": "After the monks had slept, they came back and touched it as before, caught it, and said, Elders!",
        "source": "T22n1425_023:0417c18_45"
    },
    {
        "source_sentence": "使持燈來。」",
        "translation": "I'll send you to bring the lamp.",
        "source": "T22n1425_023:0417c19_46"
    },
    {
        "source_sentence": "來已問言：「汝是誰？」",
        "translation": "After coming, he asked, Who are you?",
        "source": "T22n1425_023:0417c19_47"
    },
    {
        "source_sentence": "答言：「我是王女。」",
        "translation": "He replied, I'm the king's daughter.",
        "source": "T22n1425_023:0417c20_48"
    },
    {
        "source_sentence": "復問：「云何是女？」",
        "translation": "Again, he asked, What's a woman?",
        "source": "T22n1425_023:0417c20_49"
    },
    {
        "source_sentence": "答言：「我是兩種，非男非女。」",
        "translation": "He replied, These are two kinds of people, neither male nor female.",
        "source": "T22n1425_023:0417c20_50"
    },
    {
        "source_sentence": "復問：「汝何故出家？」",
        "translation": "Again, he asked, Why are you leaving home?",
        "source": "T22n1425_023:0417c21_51"
    },
    {
        "source_sentence": "答言：「我聞沙門無婦，我來欲為作婦。」",
        "translation": "He replied, I've heard that the ascetic has no wife, and I'm here to become his wife.",
        "source": "T22n1425_023:0417c21_52"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊。",
        "translation": "The monks went to the Bhagavān for this reason and told him.",
        "source": "T22n1425_023:0417c22_53"
    },
    {
        "source_sentence": "佛言：「是不能男。」",
        "translation": "The Buddha said, That's not a man.",
        "source": "T22n1425_023:0417c23_54"
    },
    {
        "source_sentence": "不能男者有六種：何等六？",
        "translation": "There are six kinds of being unable to be male:",
        "source": "T22n1425_023:0417c23_55"
    },
    {
        "source_sentence": "一者生；",
        "translation": "The first is birth.",
        "source": "T22n1425_023:0417c24_56"
    },
    {
        "source_sentence": "二者捺破；",
        "translation": "The second is refutation.",
        "source": "T22n1425_023:0417c24_57"
    },
    {
        "source_sentence": "三者割却；",
        "translation": "The third is to cut them off.",
        "source": "T22n1425_023:0417c24_58"
    },
    {
        "source_sentence": "四者因他；",
        "translation": "The fourth is other-causation.",
        "source": "T22n1425_023:0417c25_59"
    },
    {
        "source_sentence": "五者妬；",
        "translation": "The fifth is jealousy.",
        "source": "T22n1425_023:0417c25_60"
    },
    {
        "source_sentence": "六者半月。",
        "translation": "The sixth is the half-moon.",
        "source": "T22n1425_023:0417c25_61"
    },
    {
        "source_sentence": "生者，從生不能男，是名生。",
        "translation": "Birth means that it can't be male from birth, which is called birth.",
        "source": "T22n1425_023:0417c25_62"
    },
    {
        "source_sentence": "捺破者，妻妾生兒，共相妬嫉，小時捺破，是名捺破。",
        "translation": "A woman's wife, concubine, and child are jealous of each other, and when they become jealous at the same time, this is called a woman who suppresses.",
        "source": "T22n1425_023:0417c26_63"
    },
    {
        "source_sentence": "不能男割去者，若王、大臣取人割却男根，以備門閤，是名割却不能男。",
        "translation": "If a king or minister takes someone and cuts off their male faculty and prepares it for the entrance gate, this is called cutting off those who can't be men.",
        "source": "T22n1425_023:0417c27_64"
    },
    {
        "source_sentence": "因他者，因前人觸故身生起，是名因他不能男。",
        "translation": "A body that arises because of the contact of someone else is called a man who can't be male because of other things.",
        "source": "T22n1425_023:0417c29_65"
    },
    {
        "source_sentence": "妬者，見他行婬事，然後身生起，是名妬不能男。",
        "translation": "Jealousy is seeing others commit sexual misconduct and then the body arises, which is called jealousy that can't be male.",
        "source": "T22n1425_023:0418a01_66"
    },
    {
        "source_sentence": "半月者，半月能男、半月不能男，是名半月不能男。",
        "translation": "A half-moon is a half-moon that can be male and a half-moon that can't be male, which is called a half-moon that can't be male.",
        "source": "T22n1425_023:0418a02_67"
    },
    {
        "source_sentence": "是中生不能男、捺破不能男、割却不能男，此三種不能男，不應與出家；",
        "translation": "These three kinds of being unable to be male are the ones who give rise to what is not male, those who do not give rise to what is not male, and those who cut off what is not male.",
        "source": "T22n1425_023:0418a03_68"
    },
    {
        "source_sentence": "若已出家者，應驅出。",
        "translation": "If someone has left home, they should be expelled.",
        "source": "T22n1425_023:0418a05_69"
    },
    {
        "source_sentence": "因他起不能男、妬不能男、半月不能男，是三種不能男，不應與出家；",
        "translation": "Because of the arising of other things, they cannot be male; because of jealousy, they cannot be male; and because for one fortnight they cannot be male. These are the three kinds of unable to be male. They should not be allowed to leave home.",
        "source": "T22n1425_023:0418a05_70"
    },
    {
        "source_sentence": "若已出家者，不應驅出，後若婬起者，應驅出。",
        "translation": "If someone has renounced the householder's life, they shouldn't be expelled, and if they argue later, they should be expelled.",
        "source": "T22n1425_023:0418a07_71"
    },
    {
        "source_sentence": "是六種不能男，不應與出家，若度出家受具足者，越比尼罪，是名六種不能男。",
        "translation": "These are the six kinds of incapable men who shouldn't be given renunciation, and if they were to leave home and receive their full ordination, transgressing the vinaya would be a sin, which is called the six kinds of incapable men.",
        "source": "T22n1425_023:0418a08_72"
    },
    {
        "source_sentence": "大少者，佛住舍衛城，廣說如上。",
        "translation": "The large and small are the Buddha's abode in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0418a09_73"
    },
    {
        "source_sentence": "爾時諸比丘度小兒出家，臥起須人扶持，出入屎尿不淨，污僧臥褥，眠起啼喚，為世人譏嫌：「云何沙門釋子度小兒出家，未知宜法語言好惡？",
        "translation": "At the time, the monks were liberating a small child to leave home, lying up in bed and needing someone to support him, exhaling and urinating impure excrement, defiling the saṃgha's bedding, waking from sleep and wailing, and being ridiculed by the world, saying, How is it that the ascetic or Śākyamuni saves a small child who leaves home",
        "source": "T22n1425_023:0418a10_74"
    },
    {
        "source_sentence": "此壞敗人，何道之有？」",
        "translation": "What path does this person who breaks down exist?",
        "source": "T22n1425_023:0418a13_75"
    },
    {
        "source_sentence": "復有人言：「汝知不耶？",
        "translation": "Again, someone said, Do you know?",
        "source": "T22n1425_023:0418a14_76"
    },
    {
        "source_sentence": "是沙門無兒，養他小兒作己生想，以自娛樂。」",
        "translation": "That ascetic has no children, raises other children and creates the perception of self-birth to amuse himself.",
        "source": "T22n1425_023:0418a14_77"
    },
    {
        "source_sentence": "復有人言：「是諸沙門唯不度二種人：一者死人，二者前人不樂出家。",
        "translation": "Again, someone said, These ascetics only don't save two kinds of people: those who die and those who aren't allowed to leave home.",
        "source": "T22n1425_023:0418a15_78"
    },
    {
        "source_sentence": "若不度者，眾不增長，是故多度。」",
        "translation": "If someone isn't liberated, the multitude won't grow; therefore, they'll often be liberated.",
        "source": "T22n1425_023:0418a17_79"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊，佛言：「喚是比丘來。」",
        "translation": "For this reason, the monks went to the Bhagavān and told him, and the Buddha said, summoned this monk to come.",
        "source": "T22n1425_023:0418a18_80"
    },
    {
        "source_sentence": "來已，佛具問上事：「汝實爾不？」",
        "translation": "After coming, the Buddha asked the above questions in detail, Is is that true?",
        "source": "T22n1425_023:0418a19_81"
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, Indeed.",
        "source": "T22n1425_023:0418a19_82"
    },
    {
        "source_sentence": "佛言：「從今日後太少不應與出家。」",
        "translation": "The Buddha said, From today on, too few people shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0418a20_83"
    },
    {
        "source_sentence": "太少者，若減七歲、若滿七歲，不知好惡，皆不應與出家。",
        "translation": "If someone is too young, they won't be allowed to leave home if they're less than seven years old or full seven years old and don't know good and bad.",
        "source": "T22n1425_023:0418a20_84"
    },
    {
        "source_sentence": "若滿七歲解知好惡，應與出家。",
        "translation": "If he's seven years old and understands good and bad, he should be given to leave home.",
        "source": "T22n1425_023:0418a22_85"
    },
    {
        "source_sentence": "若小兒先已出家，不應驅出。",
        "translation": "If a small child has previously left home, they shouldn't be expelled.",
        "source": "T22n1425_023:0418a22_86"
    },
    {
        "source_sentence": "若度出家者，越毘尼罪，是名太少。",
        "translation": "If someone who has renounced the householder's life is guilty of transgressing the vinaya, this is called too little.",
        "source": "T22n1425_023:0418a23_87"
    },
    {
        "source_sentence": "太老者，佛住舍衛城，廣說如上。",
        "translation": "The Tathāgata is the Buddha who lives in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0418a24_88"
    },
    {
        "source_sentence": "爾時諸比丘度八十、九十人出家，頭白背僂、脊屈隱現、諸根不禁，或小便時大便漏出、進止須人、不能自起。",
        "translation": "It was then that eighty or ninety monks were allowed to leave home, their heads white and bowed at the back, their backs crooked and hidden, and their faculties didn't stop, or they might urinate when they defecate and excrete when they defecate, require people to enter and exit, and can't get up on their own.",
        "source": "T22n1425_023:0418a25_0"
    },
    {
        "source_sentence": "若於房中、溫室中、洗脚處、經行處、短氣連欶、洟唾流迸湔、污僧淨地，為世人所譏：「云何沙門釋子度此老翁，頭白背僂、欬嗽振動、起止須人？",
        "translation": "If someone washes their feet in a room, walks up and down, speaks shortly, spits and bursts into flames, defiles the saṃgha's pure ground, and is criticized by the world, saying, How did the ascetic or Śākyamuni save this old man with white hair on his head and back, coughing and trembling, and rising and stopping requires people to do so",
        "source": "T22n1425_023:0418a27_1"
    },
    {
        "source_sentence": "出家之人宜應康健，坐禪、誦經、修習諸業。",
        "translation": "It's advisable for renunciant people to be healthy, sitting in meditation, reciting sūtras, and cultivating various activities.",
        "source": "T22n1425_023:0418b01_2"
    },
    {
        "source_sentence": "此壞敗人，何道之有？」",
        "translation": "What path does this person who breaks down exist?",
        "source": "T22n1425_023:0418b02_3"
    },
    {
        "source_sentence": "復有人言：「汝不知耶沙門釋子出家無父，養此老翁當作父想。」",
        "translation": "Again, someone said, Don't you know that the Śākyamuni renunciant leaves home without a father and raises this old man to think of him as a father?",
        "source": "T22n1425_023:0418b03_4"
    },
    {
        "source_sentence": "復有人言：「此諸沙門唯二種人不度：一者死人，二者不欲出家。",
        "translation": "Again, someone said, These ascetics are only two kinds of people who aren't liberated: those who die and those who don't want to leave home.",
        "source": "T22n1425_023:0418b04_5"
    },
    {
        "source_sentence": "若不度者，眾不增長。」",
        "translation": "If someone doesn't save them, the multitude won't grow.",
        "source": "T22n1425_023:0418b06_6"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊。",
        "translation": "The monks went to the Bhagavān for this reason and told him.",
        "source": "T22n1425_023:0418b06_7"
    },
    {
        "source_sentence": "佛言：「喚是比丘來。」",
        "translation": "The Buddha said, Summon this monk to come.",
        "source": "T22n1425_023:0418b07_8"
    },
    {
        "source_sentence": "來已，佛具問上事：「汝實爾不？」",
        "translation": "After coming, the Buddha asked the above questions in detail, Is is that true?",
        "source": "T22n1425_023:0418b07_9"
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, Indeed.",
        "source": "T22n1425_023:0418b08_10"
    },
    {
        "source_sentence": "佛言：「從今日後太老不應與出家。」",
        "translation": "The Buddha said, From today on, the old man shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0418b08_11"
    },
    {
        "source_sentence": "太老者，過七十、若減七十，不堪造事，臥起須人，是人不聽出家。",
        "translation": "A great old man who's over seventy or less than seventy years old and unable to perform tasks, lies down and requires someone to do so, and that person won't be allowed to leave home.",
        "source": "T22n1425_023:0418b09_12"
    },
    {
        "source_sentence": "若過七十能有所作，是亦不聽。",
        "translation": "If someone over seventy can do anything, they won't hear it either.",
        "source": "T22n1425_023:0418b10_13"
    },
    {
        "source_sentence": "年滿七十康健能修習諸業，聽與出家。",
        "translation": "When he was seventy years old, Kangkan was able to cultivate various activities and allowed him to leave home.",
        "source": "T22n1425_023:0418b11_14"
    },
    {
        "source_sentence": "若太老不應與出家。",
        "translation": "If the old man doesn't leave home, he shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0418b12_15"
    },
    {
        "source_sentence": "若已出家者，不應驅出。",
        "translation": "If someone has left home, they shouldn't be expelled.",
        "source": "T22n1425_023:0418b12_16"
    },
    {
        "source_sentence": "若度出家受具足者，越比尼罪。",
        "translation": "If someone leaves home and receives the full set of precepts, they're guilty of transgressing the vinaya.",
        "source": "T22n1425_023:0418b13_17"
    },
    {
        "source_sentence": "是名太老。",
        "translation": "This is called Tai老.",
        "source": "T22n1425_023:0418b14_18"
    },
    {
        "source_sentence": "截手者，佛住舍衛城，廣說如上。",
        "translation": "The cutting off of hands is when the Buddha lives in Śrāvastī and explains it as above.",
        "source": "T22n1425_023:0418b14_19"
    },
    {
        "source_sentence": "爾時有比丘度截手人出家，為世人所譏：「云何沙門釋子度犯王法截手人出家？",
        "translation": "At the time, there was a monk who had renounced the householder's life by cutting off his hands and was criticized by the worldly people, saying, How did the ascetic or Śāriputra renounce the householder's life by cutting off his hands in violation of the king's rules?",
        "source": "T22n1425_023:0418b15_20"
    },
    {
        "source_sentence": "出家之人應身體完具，此壞敗人，有何道法？」",
        "translation": "A renunciant should have a body that's complete, so what teaching is there for this person who breaks down?",
        "source": "T22n1425_023:0418b16_21"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊。",
        "translation": "The monks went to the Bhagavān for this reason and told him.",
        "source": "T22n1425_023:0418b17_22"
    },
    {
        "source_sentence": "佛言：「喚是比丘來。」",
        "translation": "The Buddha said, Summon this monk to come.",
        "source": "T22n1425_023:0418b18_23"
    },
    {
        "source_sentence": "來已，佛問比丘：「汝實爾不？」",
        "translation": "After coming, the Buddha asked the monk, Is that true?",
        "source": "T22n1425_023:0418b19_0"
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, Indeed.",
        "source": "T22n1425_023:0418b19_1"
    },
    {
        "source_sentence": "佛言：「從今日後截手人，不應與出家。」",
        "translation": "The Buddha said, From today on, a person who cuts off their hand shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0418b19_2"
    },
    {
        "source_sentence": "截手者，若截手、若截腕、若截小指、若大指，不應與出家。",
        "translation": "A person who cuts off their hand shouldn't be given a renunciant if they cut off their hand, cut off their wrist, cut off their pinky, or cut off their big finger.",
        "source": "T22n1425_023:0418b20_3"
    },
    {
        "source_sentence": "若已出家，不應驅出。",
        "translation": "If someone has left home, they shouldn't be expelled.",
        "source": "T22n1425_023:0418b22_0"
    },
    {
        "source_sentence": "若度出家受具足者，越比尼罪。",
        "translation": "If someone leaves home and receives the full set of precepts, they're guilty of transgressing the vinaya.",
        "source": "T22n1425_023:0418b22_1"
    },
    {
        "source_sentence": "是名截手。",
        "translation": "This is called cutting off one’s hands.",
        "source": "T22n1425_023:0418b23_2"
    },
    {
        "source_sentence": "截脚者，佛住舍衛城，廣說如上。",
        "translation": "The one who cut off his legs is the Buddha staying in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0418b23_3"
    },
    {
        "source_sentence": "爾時有比丘度截脚人出家，為世人所譏，乃至佛言：「從今日後截脚人不應與出家。」",
        "translation": "It was then that a monk allowed a footstool to leave home and was criticized by the world, up to the point where the Buddha said, From today on, a footstool shouldn't be given to someone who leaves home.",
        "source": "T22n1425_023:0418b24_4"
    },
    {
        "source_sentence": "截脚者，若截脚、若截腕、若小指、若大指，不應與出家。",
        "translation": "A person who cuts off their legs shouldn't be given a renunciant if they cut off their legs, cut off their wrists, or cut off their pinkies or big fingers.",
        "source": "T22n1425_023:0418b26_5"
    },
    {
        "source_sentence": "若已出家者，不應驅出。",
        "translation": "If someone has left home, they shouldn't be expelled.",
        "source": "T22n1425_023:0418b27_6"
    },
    {
        "source_sentence": "乃至得越比尼罪。",
        "translation": "They'll even be guilty of transgressing the vinaya.",
        "source": "T22n1425_023:0418b27_7"
    },
    {
        "source_sentence": "是名截脚。",
        "translation": "This is called cutting off one’s leg.",
        "source": "T22n1425_023:0418b28_8"
    },
    {
        "source_sentence": "截手脚者，佛住舍衛城，廣說如上。",
        "translation": "A person who cuts off their hands and feet is the Buddha staying in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0418b28_9"
    },
    {
        "source_sentence": "爾時比丘度截手脚人出家，為世人所譏：「云何沙門釋子度犯王法截手脚人？",
        "translation": "It was then that the monk had his hands and feet cut off and left home, and the world criticized him, How did the ascetic or Śākyamuni who cut off his hands and feet for violating the king's rules have his hands and feet cut off?",
        "source": "T22n1425_023:0418b29_10"
    },
    {
        "source_sentence": "一事不具尚不得出家，況復兩事。",
        "translation": "If one thing doesn't exist, they still won't be allowed to leave home, so why wouldn't two things?",
        "source": "T22n1425_023:0418c02_11"
    },
    {
        "source_sentence": "此壞敗人，何道之有？」",
        "translation": "What path does this person who breaks down exist?",
        "source": "T22n1425_023:0418c02_12"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊。",
        "translation": "The monks went to the Bhagavān for this reason and told him.",
        "source": "T22n1425_023:0418c03_13"
    },
    {
        "source_sentence": "佛言：「喚是比丘來。」",
        "translation": "The Buddha said, Summon this monk to come.",
        "source": "T22n1425_023:0418c04_0"
    },
    {
        "source_sentence": "來已，佛問比丘：「汝實爾不？」",
        "translation": "After coming, the Buddha asked the monk, Is that true?",
        "source": "T22n1425_023:0418c04_1"
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, Indeed.",
        "source": "T22n1425_023:0418c05_2"
    },
    {
        "source_sentence": "佛言：「從今日後截手脚人不應與出家。」",
        "translation": "The Buddha said, From today on, a person who cuts off their hands and feet won't be allowed to leave home.",
        "source": "T22n1425_023:0418c05_3"
    },
    {
        "source_sentence": "截手脚者，若截右手左脚；",
        "translation": "The one who cuts off the hands and feet is when cutting off the left foot of the right hand.",
        "source": "T22n1425_023:0418c06_4"
    },
    {
        "source_sentence": "若截左手右脚；",
        "translation": "Suppose he cuts off the left hand and right foot.",
        "source": "T22n1425_023:0418c06_5"
    },
    {
        "source_sentence": "若截左手左脚；",
        "translation": "Suppose he cuts off the left hand and the left foot.",
        "source": "T22n1425_023:0418c07_6"
    },
    {
        "source_sentence": "若截右手右脚，不應與出家。",
        "translation": "If he cuts off his right foot with his right hand, he shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0418c07_7"
    },
    {
        "source_sentence": "若已出家者，不應驅出。",
        "translation": "If someone has left home, they shouldn't be expelled.",
        "source": "T22n1425_023:0418c08_8"
    },
    {
        "source_sentence": "若與出家受具足者，越比尼罪。",
        "translation": "If someone leaves home and receives the full set of precepts, they'll be guilty of transgressing the vinaya.",
        "source": "T22n1425_023:0418c08_9"
    },
    {
        "source_sentence": "是名截手脚。",
        "translation": "This is called cutting off one’s hands and feet.",
        "source": "T22n1425_023:0418c09_10"
    },
    {
        "source_sentence": "截耳者，佛住舍衛城，廣說如上。",
        "translation": "Cutting off the ear is when the Buddha lives in Śrāvastī and explains it in detail as above.",
        "source": "T22n1425_023:0418c09_11"
    },
    {
        "source_sentence": "爾時有比丘，度截耳人出家，為世人所譏：「云何沙門釋子度犯王法截耳人？」",
        "translation": "At the time, there was a monk who had cut off his ears and left home, and the world criticized him, How did the ascetic or Śāriputra cut off his ears for violating the king's rules?",
        "source": "T22n1425_023:0418c10_12"
    },
    {
        "source_sentence": "乃至佛言：「從今日後，截耳人不應與出家。」",
        "translation": "Even the Buddha said, From today on, a person who cuts off their ears won't be allowed to leave home.",
        "source": "T22n1425_023:0418c12_13"
    },
    {
        "source_sentence": "截耳者，若截耳、若截耳輪、若先穿耳，決能令還合者，得與出家。",
        "translation": "A person who cuts off their ears will be given to leave home if they cut off their ears, cut off the ear wheel or first pierce their ears and are able to make them return together.",
        "source": "T22n1425_023:0418c13_14"
    },
    {
        "source_sentence": "截耳人，不應與出家。",
        "translation": "A person who has cut off their ears shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0418c14_15"
    },
    {
        "source_sentence": "若已出家者，不應驅出。",
        "translation": "If someone has left home, they shouldn't be expelled.",
        "source": "T22n1425_023:0418c14_16"
    },
    {
        "source_sentence": "若度出家受具足者，越比尼罪。",
        "translation": "If someone leaves home and receives the full set of precepts, they're guilty of transgressing the vinaya.",
        "source": "T22n1425_023:0418c15_17"
    },
    {
        "source_sentence": "是名截耳。",
        "translation": "This is called cutting off the ear.",
        "source": "T22n1425_023:0418c16_18"
    },
    {
        "source_sentence": "截鼻者，佛住舍衛城，廣說如上。",
        "translation": "Cutting off the nose is when the Buddha lives in Śrāvastī and explains it as above.",
        "source": "T22n1425_023:0418c16_19"
    },
    {
        "source_sentence": "爾時諸比丘度截鼻人出家，為世人所嫌：「云何沙門釋子度犯王法截鼻人出家？",
        "translation": "It was then that the monks were disliked by the world, saying, How did the ascetic or Śākyamuni who had cut off his nose to save someone who violated the king's rules and left home?",
        "source": "T22n1425_023:0418c17_20"
    },
    {
        "source_sentence": "此壞敗人，有何道法？」",
        "translation": "What's the teaching of this person who breaks down?",
        "source": "T22n1425_023:0418c19_0"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊。",
        "translation": "The monks went to the Bhagavān for this reason and told him.",
        "source": "T22n1425_023:0418c19_1"
    },
    {
        "source_sentence": "乃至佛言：「從今日後截鼻人不應與出家。」",
        "translation": "Even the Buddha said, From today on, a person who cuts off their nose shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0418c20_2"
    },
    {
        "source_sentence": "截鼻者，若截鼻、若決鼻，不應與出家，乃至是名截鼻。",
        "translation": "If someone cuts off their nose, they shouldn't leave home if they cut off their nose or decide to cut off their nose, even up to this point is called cutting off their nose.",
        "source": "T22n1425_023:0418c21_3"
    },
    {
        "source_sentence": "截耳鼻者。",
        "translation": "He who cuts off his ears and nose.",
        "source": "T22n1425_023:0418c22_4"
    },
    {
        "source_sentence": "佛住舍衛城，廣說如上。",
        "translation": "The Buddha stayed in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0418c22_5"
    },
    {
        "source_sentence": "爾時比丘度截耳鼻人出家，為世人所譏：「云何沙門釋子度截耳鼻人出家？",
        "translation": "It was then that the monk disciplined a man who had cut off his ears and nose and left home, and the world criticized him, How did the ascetic or Śāriputra discipline a man who cut off his ears and nose and leave home?",
        "source": "T22n1425_023:0418c23_6"
    },
    {
        "source_sentence": "截一尚不得出家，況復截兩。",
        "translation": "If you cut off one, you still won't be allowed to leave home, so why would you cut off two?",
        "source": "T22n1425_023:0418c24_7"
    },
    {
        "source_sentence": "此壞敗人，何道之有？」",
        "translation": "What path does this person who breaks down exist?",
        "source": "T22n1425_023:0418c25_8"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊，乃至佛言：「從今日後截耳鼻人不應與出家。」",
        "translation": "Because of these causes and conditions, the monks went to the Bhagavān and said to the Buddha, From today on, a man who has cut off his ears and nose won't be allowed to leave home.",
        "source": "T22n1425_023:0418c25_9"
    },
    {
        "source_sentence": "乃至是名截耳鼻。",
        "translation": "It's even called cutting off the ear and nose.",
        "source": "T22n1425_023:0418c27_10"
    },
    {
        "source_sentence": "盲者，佛住舍衛城，廣說如上。",
        "translation": "A blind man, the Buddha lives in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0418c28_0"
    },
    {
        "source_sentence": "爾時有比丘度盲人出家，牽臂將行，為世人所譏：「云何沙門釋子度盲人出家？",
        "translation": "At the time, there was a monk who had liberated a blind man from home and was about to leave home with his arm drawn. He was criticized by the people of the world, saying, How did the ascetic and Śāriputra liberate a blind man from home?",
        "source": "T22n1425_023:0418c28_1"
    },
    {
        "source_sentence": "不能自行，捉手牽之。",
        "translation": "They can't do it themselves, but they grasp and pull it with their hands.",
        "source": "T22n1425_023:0419a01_2"
    },
    {
        "source_sentence": "出家之人宜當諸根具足，此壞敗人，何道之有？」",
        "translation": "It's advisable for renunciant people to be endowed with all their faculties, but what path is there for someone who breaks down like this?",
        "source": "T22n1425_023:0419a01_3"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊，佛言：「喚是比丘來。」",
        "translation": "For this reason, the monks went to the Bhagavān and told him, and the Buddha said, summoned this monk to come.",
        "source": "T22n1425_023:0419a03_0"
    },
    {
        "source_sentence": "來已，佛問比丘：「汝實爾不？」",
        "translation": "After coming, the Buddha asked the monk, Is that true?",
        "source": "T22n1425_023:0419a04_1"
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, Indeed.",
        "source": "T22n1425_023:0419a04_2"
    },
    {
        "source_sentence": "佛言：「從今日後盲人不應與出家。」",
        "translation": "The Buddha said, From today on, a blind person shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0419a05_0"
    },
    {
        "source_sentence": "盲者，眼一切不見色，若見手掌文者，若雀目不得與出家。",
        "translation": "A blind man's eyes don't see form in anything, and if he sees the palm of his hand with a text, or if he has the eyes of a bird, he won't be allowed to leave home.",
        "source": "T22n1425_023:0419a05_1"
    },
    {
        "source_sentence": "若已出家，不應驅出。",
        "translation": "If someone has left home, they shouldn't be expelled.",
        "source": "T22n1425_023:0419a07_2"
    },
    {
        "source_sentence": "若與出家受具足者，越比尼罪。",
        "translation": "If someone leaves home and receives the full set of precepts, they'll be guilty of transgressing the vinaya.",
        "source": "T22n1425_023:0419a07_3"
    },
    {
        "source_sentence": "是名盲。",
        "translation": "This is called blindness.",
        "source": "T22n1425_023:0419a08_4"
    },
    {
        "source_sentence": "聾者，佛住舍衛城，廣說如上。",
        "translation": "A deaf person is the Buddha who lives in Śrāvastī and explains it as above.",
        "source": "T22n1425_023:0419a08_5"
    },
    {
        "source_sentence": "爾時比丘度聾人出家，為世人所譏：「云何沙門釋子度聾人出家？",
        "translation": "It was then that the monk released the deaf and left home, and the world criticized him, How did the ascetic or Śāriputra release the deaf?",
        "source": "T22n1425_023:0419a09_6"
    },
    {
        "source_sentence": "不聞善惡語言，何能聽法？",
        "translation": "If they don't hear good and bad words, how can they hear the Dharma?",
        "source": "T22n1425_023:0419a10_7"
    },
    {
        "source_sentence": "此壞敗人，何道之有？」",
        "translation": "What path does this person who breaks down exist?",
        "source": "T22n1425_023:0419a11_8"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊，乃至佛言：「從今日後聾人不應與出家。」",
        "translation": "For this reason, the monks went to the Bhagavān and said to the Buddha, From today on, a deaf person shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0419a11_9"
    },
    {
        "source_sentence": "聾者，不聞一切聲，若聞高聲者，得與出家，乃至是名聾。",
        "translation": "A deaf person doesn't hear all sounds, and if they hear a loud sound, they'll be allowed to leave home, even up to the point where they're called deaf.",
        "source": "T22n1425_023:0419a13_10"
    },
    {
        "source_sentence": "盲聾者，佛住舍衛城，廣說如上。",
        "translation": "The blind and deaf are the Buddha's abode in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0419a14_11"
    },
    {
        "source_sentence": "爾時有比丘度盲聾之人出家，為世人所譏：「云何沙門釋子度盲聾之人出家，不能見聞？",
        "translation": "At the time, there was a monk who liberated a blind and deaf person from home and was criticized by the world, Why did the ascetic or Śāriputra liberate a blind and deaf person who leaves home but can't see or hear?",
        "source": "T22n1425_023:0419a15_12"
    },
    {
        "source_sentence": "出家之人宜當諸根具足，盲者尚不得，況復盲聾。",
        "translation": "It's advisable for renunciants to have all their faculties perfected, but those who are blind can't get it, so why wouldn't they be blind and deaf?",
        "source": "T22n1425_023:0419a17_13"
    },
    {
        "source_sentence": "此壞敗人，何道之有？」",
        "translation": "What path does this person who breaks down exist?",
        "source": "T22n1425_023:0419a18_14"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊，乃至佛言：「從今日後盲聾人不應與出家。」",
        "translation": "Because of these causes and conditions, the monks went to the Bhagavān and said to the Buddha, From today on, a blind or deaf person shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0419a18_15"
    },
    {
        "source_sentence": "乃至是名盲。",
        "translation": "It's even called blindness.",
        "source": "T22n1425_023:0419a20_16"
    },
    {
        "source_sentence": "聾瘂者，佛住舍衛城，廣說如上。",
        "translation": "The deaf and dumb are the Buddha's abode in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0419a20_17"
    },
    {
        "source_sentence": "爾時比丘度瘂人出家，手作相語，為世人所譏：「云何沙門釋子度瘂人出家？",
        "translation": "At that time, the bhikṣu had renounced the householder’s life. He spoke to each other with his palms together and was criticized by the people of the world: “How did the śramaṇa or son of the Śākyamuni renounce the householder’s life?",
        "source": "T22n1425_023:0419a21_18"
    },
    {
        "source_sentence": "不能語言，而作手相語。",
        "translation": "They can't speak, but they talk to each other with their hands.",
        "source": "T22n1425_023:0419a23_19"
    },
    {
        "source_sentence": "此壞敗人，何道之有？」",
        "translation": "What path does this person who breaks down exist?",
        "source": "T22n1425_023:0419a23_20"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊，乃至佛言：「從今日後瘂人不應與出家。」",
        "translation": "Because of these causes and conditions, the monks went to the Bhagavān and said to the Buddha, From today on, you shouldn't leave home if you have sexual misconduct.",
        "source": "T22n1425_023:0419a24_21"
    },
    {
        "source_sentence": "瘂者，不能語，用手示語相，不應與出家。",
        "translation": "A monk who doesn't speak and uses his hand to show the characteristics of speech shouldn't leave home.",
        "source": "T22n1425_023:0419a25_22"
    },
    {
        "source_sentence": "若已出家者，不應驅出，乃至是名瘂。",
        "translation": "If someone has left home, they shouldn't be expelled, even to the point where they're called a monk.",
        "source": "T22n1425_023:0419a26_23"
    },
    {
        "source_sentence": "躄者，佛住舍衛城，廣說如上。",
        "translation": "It's because the Buddha was staying in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0419a27_24"
    },
    {
        "source_sentence": "爾時比丘度躄人出家，為世人所譏：「云何沙門釋子度躄不能行人出家？",
        "translation": "It was then that the monk renounced his householder's life, and the world criticized him, How could the ascetic or Śākyamuni who renounced his householder's life because he didn't practice it?",
        "source": "T22n1425_023:0419a28_25"
    },
    {
        "source_sentence": "此壞敗人，何道之有？」",
        "translation": "What path does this person who breaks down exist?",
        "source": "T22n1425_023:0419a29_26"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊，乃至佛言：「從今日後躄人不應與出家。」",
        "translation": "Because of these causes and conditions, the monks went to the Bhagavān and said to the Buddha, From today on, you shouldn't leave home if you have sexual misconduct.",
        "source": "T22n1425_023:0419b01_27"
    },
    {
        "source_sentence": "躄者，兩手捉屐曳尻而行，不應與出家。",
        "translation": "A monk who walks with both hands holding a sandal and dragging it around his buttocks shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0419b02_28"
    },
    {
        "source_sentence": "若已出家，不應驅出，乃至是名躄。",
        "translation": "If someone has left home, they shouldn't be expelled, even to the extent that this is called a dispute.",
        "source": "T22n1425_023:0419b03_29"
    },
    {
        "source_sentence": "瘂躄者，佛住舍衛城，廣說如上。",
        "translation": "It's because the Buddha was staying in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0419b04_30"
    },
    {
        "source_sentence": "爾時諸比丘度瘂躄人出家，乃至與出家受具足者，越比尼罪，是名瘂躄。",
        "translation": "At the time, those monks who liberate a woman from home and leave home or give her to someone who leaves home and receives the full set of precepts are guilty of transgressing the vinaya, which is called sexual misconduct.",
        "source": "T22n1425_023:0419b05_31"
    },
    {
        "source_sentence": "鞭瘢者，佛住舍衛城，廣說如上。",
        "translation": "The wound of whipping is when the Buddha lives in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0419b06_32"
    },
    {
        "source_sentence": "爾時比丘度鞭瘢人出家，為世人所譏：「云何沙門釋子度犯王法鞭瘢人出家？",
        "translation": "It was then that the monk released the whipping-scarred man and left home, and the world criticized him, How did the ascetic or Śākyamuni release the whipping-scarred man who violated the king's rules?",
        "source": "T22n1425_023:0419b07_33"
    },
    {
        "source_sentence": "出家之人應當身體完淨。",
        "translation": "A renunciant should have a body that's perfectly pure.",
        "source": "T22n1425_023:0419b09_34"
    },
    {
        "source_sentence": "此壞敗人，何道之有？」",
        "translation": "What path does this person who breaks down exist?",
        "source": "T22n1425_023:0419b10_0"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊。",
        "translation": "The monks went to the Bhagavān for this reason and told him.",
        "source": "T22n1425_023:0419b10_1"
    },
    {
        "source_sentence": "佛言：「喚是比丘來。」",
        "translation": "The Buddha said, Summon this monk to come.",
        "source": "T22n1425_023:0419b11_2"
    },
    {
        "source_sentence": "來已，佛問：「汝實爾不？」",
        "translation": "After coming, the Buddha asked, Is that true?",
        "source": "T22n1425_023:0419b11_3"
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, Indeed.",
        "source": "T22n1425_023:0419b12_4"
    },
    {
        "source_sentence": "佛言：「從今日後鞭瘢人不應度出家。」",
        "translation": "The Buddha said, From now on, you shouldn't allow a whipping-scarred person to leave home.",
        "source": "T22n1425_023:0419b12_5"
    },
    {
        "source_sentence": "鞭瘢者，若凸、若凹，若能治瘢還平復，與肉膚不異者，得與出家；",
        "translation": "If the wound of whipping is protubered or bruised, and if it can be healed and restored to a level condition no different from that of flesh and skin, he will be allowed to renounce the householder’s life.",
        "source": "T22n1425_023:0419b13_6"
    },
    {
        "source_sentence": "鞭瘢人不應與出家。",
        "translation": "A person who is whipped and scarred shouldn't be allowed to leave home.",
        "source": "T22n1425_023:0419b14_7"
    },
    {
        "source_sentence": "若已出家者，不應驅出。",
        "translation": "If someone has left home, they shouldn't be expelled.",
        "source": "T22n1425_023:0419b15_8"
    },
    {
        "source_sentence": "若與出家受具足者，越比尼罪。",
        "translation": "If someone leaves home and receives the full set of precepts, they'll be guilty of transgressing the vinaya.",
        "source": "T22n1425_023:0419b15_9"
    },
    {
        "source_sentence": "是名鞭瘢。",
        "translation": "This is called a wound of whipping.",
        "source": "T22n1425_023:0419b16_10"
    },
    {
        "source_sentence": "印瘢者，佛住舍衛城，廣說如上。",
        "translation": "The wound of the mudrā is when the Buddha lives in Śrāvastī and explains it as above.",
        "source": "T22n1425_023:0419b16_11"
    },
    {
        "source_sentence": "爾時比丘度印瘢人出家，為世人所譏：「云何沙門釋子度犯王法印瘢人出家？",
        "translation": "It was then that the monk released the sealed-scarred man and left home, and the world criticized him, How did the ascetic or Śākyamuni release the sealed-scarred man who violated the king's law?",
        "source": "T22n1425_023:0419b17_12"
    },
    {
        "source_sentence": "出家之人宜當完淨。",
        "translation": "It's advisable for renunciant practitioners to be perfectly pure.",
        "source": "T22n1425_023:0419b19_13"
    },
    {
        "source_sentence": "此壞敗人，何道之有？」",
        "translation": "What path does this person who breaks down exist?",
        "source": "T22n1425_023:0419b19_14"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊，乃至佛言：「從今日後印瘢人不應與出家。」",
        "translation": "Because of these causes and conditions, the monks went to the Bhagavān and said to the Buddha, From today on, you shouldn't leave home if you're a man with scars.",
        "source": "T22n1425_023:0419b20_15"
    },
    {
        "source_sentence": "印瘢者，破肉以孔雀膽、銅青等畫作字作種種鳥獸像，不應與出家。",
        "translation": "A seal scar is a broken flesh that's made into various bird and animal images with the words painted on pores of peacock bile, copper blue, and so forth, and it shouldn't be given as a renunciant.",
        "source": "T22n1425_023:0419b21_16"
    },
    {
        "source_sentence": "若已出家者，不應驅出。",
        "translation": "If someone has left home, they shouldn't be expelled.",
        "source": "T22n1425_023:0419b23_17"
    },
    {
        "source_sentence": "若與出家受具足者，越比尼罪。",
        "translation": "If someone leaves home and receives the full set of precepts, they'll be guilty of transgressing the vinaya.",
        "source": "T22n1425_023:0419b23_18"
    },
    {
        "source_sentence": "是名印瘢。",
        "translation": "This is called the sign of scarring.",
        "source": "T22n1425_023:0419b24_19"
    },
    {
        "source_sentence": "剋筋者，佛住舍衛城，廣說如上。",
        "translation": "Grasping the tendons means that the Buddha lives in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0419b24_20"
    },
    {
        "source_sentence": "爾時有比丘度剋筋人出家，曳脚而行，為世人所譏：「云何沙門釋子度剋筋人出家？",
        "translation": "At the time, there was a monk who had renounced the householder's life and left home, walking with his feet towed. The people criticized him, saying, How did the ascetic or Śākyamuni renunciant leave home?",
        "source": "T22n1425_023:0419b25_21"
    },
    {
        "source_sentence": "曳脚而行，出家之人應身體完具。",
        "translation": "When he walks with his feet towed, the renunciant's body is fully equipped.",
        "source": "T22n1425_023:0419b27_22"
    },
    {
        "source_sentence": "此壞敗人，何道之有？」",
        "translation": "What path does this person who breaks down exist?",
        "source": "T22n1425_023:0419b28_23"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊，乃至佛言：「從今日後剋筋人不應與出家。」",
        "translation": "Because of these causes and conditions, the monks went to the Bhagavān and said to the Buddha, From today on, you shouldn't be allowed to leave home if you cut off your tendons.",
        "source": "T22n1425_023:0419b28_24"
    },
    {
        "source_sentence": "剋筋者，剋脚踵筋，不應與出家，乃至越比尼罪，是名剋筋。",
        "translation": "To suppress the tendons is to suppress the tendons that follow one's feet and shouldn't be given as a renunciant, up to the sin of transgressing the vinaya, which is called suppressing the tendons.",
        "source": "T22n1425_023:0419c01_25"
    },
    {
        "source_sentence": "拔筋者，佛住舍衛城，廣說如上。",
        "translation": "The one who pulls out the tendons is when the Buddha lives in Śrāvastī, as explained above.",
        "source": "T22n1425_023:0419c02_26"
    },
    {
        "source_sentence": "爾時比丘度拔筋人出家，為世人所譏：「云何沙門釋子度拔筋人出家？",
        "translation": "It was then that the monk renounced his householder's life, and the world criticized him, How did the ascetic or Śākyamuni renounce his householder's life?",
        "source": "T22n1425_023:0419c03_27"
    },
    {
        "source_sentence": "出家之人應當身體完具。」",
        "translation": "A renunciant should be fully endowed in body and mind.",
        "source": "T22n1425_023:0419c05_28"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊，乃至佛言：「從今日後拔筋人不應與出家。」",
        "translation": "Because of these causes and conditions, the monks went to the Bhagavān and said to the Buddha, From today on, you shouldn't be allowed to leave home if you pull out your tendons.",
        "source": "T22n1425_023:0419c05_29"
    },
    {
        "source_sentence": "拔筋者，從脚跟抽至項顀，從項顀抽至脚跟，不應與出家，乃至越比尼罪，是名拔筋。",
        "translation": "pulling out the tendons is called pulling out the tendons, which are pulled from the heels of the feet up to the neckline, and they're pulled from the neckline up to the heels of the feet, so they shouldn't be given renunciation or even transgressions by nuns.",
        "source": "T22n1425_023:0419c07_30"
    },
    {
        "source_sentence": "傴脊者，佛住舍衛城，廣說如上。",
        "translation": "The crooked ridge refers to the fact that the Buddha resided in Śrāvastī and explained it in detail above.",
        "source": "T22n1425_023:0419c09_31"
    },
    {
        "source_sentence": "爾時比丘度曲脊侏儒人出家，為世人所譏：「云何沙門釋子度王家戲弄曲脊人出家？",
        "translation": "It was then that the monk renounced the householder's life and left home, and he was criticized by the people of the world, How did the ascetic or Śāriputra renounce the householder's life when he renounced the householder's life?",
        "source": "T22n1425_023:0419c10_0"
    },
    {
        "source_sentence": "出家之人應當身體調直。",
        "translation": "A renunciant should be disciplined in body and mind.",
        "source": "T22n1425_023:0419c11_1"
    },
    {
        "source_sentence": "此壞敗人，何道之有？」",
        "translation": "What path does this person who breaks down exist?",
        "source": "T22n1425_023:0419c12_2"
    },
    {
        "source_sentence": "諸比丘以是因緣往白世尊，乃至佛言：「從今日後曲脊人不應與出家。」",
        "translation": "Because of these causes and conditions, the monks went to the Bhagavān and said to the Buddha, From today on, you shouldn't leave home for someone with a crooked back.",
        "source": "T22n1425_023:0419c13_0"
    },
    {
        "source_sentence": "曲脊者，不正直也。",
        "translation": "A crooked back is not upright.",
        "source": "T22n1425_023:0419c14_1"
    },
    {
        "source_sentence": "侏儒者，或上長下短、或上短下長。",
        "translation": "A dwarf is sometimes long and sometimes short, sometimes short and sometimes long.",
        "source": "T22n1425_023:0419c15_0"
    },
    {
        "source_sentence": "一切最短者，是不應與出家，乃至越比尼罪，是名侏儒。",
        "translation": "The shortest of all, which shouldn't be given to renunciant monks or even transgress the vinaya offense, is called a tiny child.",
        "source": "T22n1425_023:0419c15_1"
    },
    {
        "source_sentence": "摩訶僧祇律卷第二十三",
        "translation": "Mahāsāṃghika-vinaya, Volume 23",
        "source": "T22n1425_023:0419c18_0"
    }
]