[
    {
        "source_sentence": "五分律卷第二(彌沙塞)",
        "translation": "Five Part Vinaya, Volume 2 (Mishi塞)",
        "source": "T22n1421_002:0007a22_0"
    },
    {
        "source_sentence": "宋罽賓三藏佛陀什",
        "translation": "Song Dynasty Buddhism of the Tripiṭaka of Kāśmīra",
        "source": "T22n1421_002:0007a24_0"
    },
    {
        "source_sentence": "共竺道生等譯",
        "translation": "Together with the translations by Zhu Daosheng and others",
        "source": "T22n1421_002:0007a25_0"
    },
    {
        "source_sentence": "第一分初第三事",
        "translation": "the first and third parts of the first part",
        "source": "T22n1421_002:0007a26_0"
    },
    {
        "source_sentence": "佛在毘舍離。",
        "translation": "The Buddha was in Vaiśālī.",
        "source": "T22n1421_002:0007a27_0"
    },
    {
        "source_sentence": "爾時世尊告諸比丘修不淨觀得大果利。",
        "translation": "It was then that the Bhagavān addressed the monks and cultivated the contemplation of impurity to attain great fruition.",
        "source": "T22n1421_002:0007a27_1"
    },
    {
        "source_sentence": "時諸比丘即皆修習，深入厭惡，恥愧此身。",
        "translation": "The monks then all cultivated it, became deeply disgusted with it, and felt ashamed of this body.",
        "source": "T22n1421_002:0007a28_2"
    },
    {
        "source_sentence": "譬如少年好憙淨潔，澡浴塗身，著新淨衣，忽以三屍嬰加其頸，膿血逼身，虫流滿體。",
        "translation": "Good man, it is analogous to a young brahman who enjoys cleanliness and scruples. Having bathed, bathed, and anointed his body, he puts on fresh, clean clothes and suddenly adds three corpses to his neck. His flesh is crushed by pus and blood, and all the infestations of insects flow through his body.",
        "source": "T22n1421_002:0007a29_3"
    },
    {
        "source_sentence": "其人苦毒，無復餘想，但念：「何當脫此恥辱？」",
        "translation": "The man suffered so much pain and no longer had any thoughts but thought, How will you be freed from this shame?",
        "source": "T22n1421_002:0007b02_4"
    },
    {
        "source_sentence": "諸比丘厭惡此身，亦復如是，其中或有自殺，展轉相害，或索刀、繩，或服毒藥。",
        "translation": "Monks who are disgusted with this body also likewise may commit suicide and inflict harm on each other, or ask for a sword, a rope, or take poison.",
        "source": "T22n1421_002:0007b03_0"
    },
    {
        "source_sentence": "有一比丘厭惡身已，便往彌隣旃陀羅所，語言：「為我斷命，衣鉢相與。」",
        "translation": "After he became disillusioned with his bad body, a monk went to Miliṇḍāra and said, Give me your robes and bowl for my sake.",
        "source": "T22n1421_002:0007b04_1"
    },
    {
        "source_sentence": "時旃陀羅為衣鉢故，即以利刀而斷其命。",
        "translation": "Gandhāra then cut off his life with a sharp sword for the sake of his robe and bowl.",
        "source": "T22n1421_002:0007b06_2"
    },
    {
        "source_sentence": "有血污刀，持至婆求末河洗之，尋生悔心，作是念：「我今不善。",
        "translation": "Someone soiled his sword with blood and carried it to Vātsīputrīya to wash it in the Ganges River. Having felt remorseful, he thought:",
        "source": "T22n1421_002:0007b07_3"
    },
    {
        "source_sentence": "云何為小利故，而斷持戒沙門性命，得無量罪？」",
        "translation": "How did you cut off the nature and life of a precept-holding ascetic for the sake of minor gain and attain measureless sins?",
        "source": "T22n1421_002:0007b08_4"
    },
    {
        "source_sentence": "時自在天魔知其心念，譬如壯士屈伸臂頃，來至其前，從水踊出，立於水上，讚言：「善哉！",
        "translation": "Knowing his thoughts, the self-willed god Māra then knew them, like a strong man who flexes his arm and comes before him, emerges from the water, stands up in the water, and praises it, saying, Good!",
        "source": "T22n1421_002:0007b09_5"
    },
    {
        "source_sentence": "汝得大利，斷持戒沙門命，未度者度，福慶無量。",
        "translation": "You will attain great reward by cutting off the life of a śramaṇa who keeps the precepts and liberating those who have not yet been liberated. The merit you will obtain will be immeasurable.",
        "source": "T22n1421_002:0007b11_6"
    },
    {
        "source_sentence": "天神記錄，故來告汝。」",
        "translation": "The gods and goddesses recorded it, so they came to tell you.",
        "source": "T22n1421_002:0007b12_7"
    },
    {
        "source_sentence": "時旃陀羅便生惡邪見，心大歡喜：「我今當更度未度者。」",
        "translation": "Candra then gave rise to a bad view and became overjoyed, Now, I will save those who haven't been saved.",
        "source": "T22n1421_002:0007b13_8"
    },
    {
        "source_sentence": "彼旃陀羅善知厭身、未厭身相：「若凡夫比丘未離於欲，舉刀向時，心恐怖者是未厭身，我若殺之得福甚少。",
        "translation": "That caṇḍāla well knows the characteristics of a disillusioned body and a body that's not yet disillusioned, saying, If an ordinary monk isn't free of desire and raises a sword when he's facing it, his mind is frightened because he's not disillusioned with the body, and if I kill him, very little merit will be gained.",
        "source": "T22n1421_002:0007b14_9"
    },
    {
        "source_sentence": "我今當求已得道果、無恐怖者。」",
        "translation": "Now, I will seek the fruit of the path and have no fear.",
        "source": "T22n1421_002:0007b16_10"
    },
    {
        "source_sentence": "於是手執長刀，從房至房，從經行處至經行處，高聲唱言：「欲滅度者，我當度之。」",
        "translation": "He then held a long sword in his hand, went from room to room, traveled from the place where he was walking to the place where he was walking, and called out loudly, I will save those who want to be liberated.",
        "source": "T22n1421_002:0007b17_11"
    },
    {
        "source_sentence": "時諸比丘厭惡身者，皆出就之，尋斷其命。",
        "translation": "The monks who were disgusted with the bad body then all left and went to it, seeking to cut off their life.",
        "source": "T22n1421_002:0007b19_12"
    },
    {
        "source_sentence": "於一日中，殺十、二十乃至六十，以是因緣僧數減少，大德聲聞悉不復現。",
        "translation": "In a single day, they kill ten, twenty, or even 60 people, and because of this cause the number of monks decreases, the great virtuous śrāvakas don't appear again.",
        "source": "T22n1421_002:0007b20_13"
    },
    {
        "source_sentence": "爾時世尊從三昧起，在露處坐，大眾圍繞；",
        "translation": "At that time the World-honored One rose from his concentration and remained seated in the open air, surrounded by a great assembly.",
        "source": "T22n1421_002:0007b21_14"
    },
    {
        "source_sentence": "觀視僧眾，告阿難言：「今日僧眾何故減少？」",
        "translation": "Observing the assembled monks, he told Ānanda, Why are the assembled monks diminishing today?",
        "source": "T22n1421_002:0007b22_15"
    },
    {
        "source_sentence": "阿難白佛：「世尊一時為諸比丘說不淨觀，比丘修習厭惡身苦，轉相殘殺，乃至彌隣一日之中，傷害梵行六十人命，是故今日僧眾減少。",
        "translation": "Ānanda said to the Buddha: World-honored One time, when the World-honored One taught the bhikṣus a discourse on the contemplation of impurity, those bhikṣus became disgusted with bodily pain and committed many different kinds of cruel acts such as killing each other. In just one day they inflicted harm upon the lives of sixty bhikṣus who were engaged in",
        "source": "T22n1421_002:0007b23_16"
    },
    {
        "source_sentence": "善哉，世尊！",
        "translation": "Excellent, Bhagavān!",
        "source": "T22n1421_002:0007b26_17"
    },
    {
        "source_sentence": "唯願更說餘善道法，令諸比丘得安樂住。」",
        "translation": "Please explain the other good paths again so that the monks will attain peaceful abiding.",
        "source": "T22n1421_002:0007b27_18"
    },
    {
        "source_sentence": "佛告阿難：「汝今宣令依止毘舍離比丘，皆使來集普會講堂。」",
        "translation": "The Buddha told Ānanda, Now, you've ordered all the monks who rely on Vaiśālī to come and assemble in the assembly hall.",
        "source": "T22n1421_002:0007b28_0"
    },
    {
        "source_sentence": "阿難受教，即呼來集。",
        "translation": "Ānanda received the instruction and summoned the monks to the assembly.",
        "source": "T22n1421_002:0007b29_1"
    },
    {
        "source_sentence": "集已，白言：「唯聖知時。」",
        "translation": "After the assembly, he said, Only the noble one knows the time.",
        "source": "T22n1421_002:0007b29_2"
    },
    {
        "source_sentence": "世尊從坐起，至講堂就座而坐，問諸比丘：「實有上事不？」",
        "translation": "The Bhagavān rose from his seat, went to the lecture hall, took his seat in his seat, and asked the monks, Is there really a superior thing?",
        "source": "T22n1421_002:0007c01_3"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0007c02_4"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0007c02_5"
    },
    {
        "source_sentence": "佛種種呵責：「汝等愚癡，所作非法！",
        "translation": "The Buddha variously rebuked them, saying, You foolish people, what you do is unlawful!",
        "source": "T22n1421_002:0007c02_6"
    },
    {
        "source_sentence": "豈不聞我所說慈忍，護念眾生；",
        "translation": "Haven’t you heard me teach compassion and patience, protecting sentient beings?",
        "source": "T22n1421_002:0007c03_7"
    },
    {
        "source_sentence": "而今云何不憶此法？」",
        "translation": "Why don't you remember this teaching now?",
        "source": "T22n1421_002:0007c04_8"
    },
    {
        "source_sentence": "呵已，告諸比丘：「若自殺身，得偷羅遮罪。」",
        "translation": "After he had been reprimanded, he told the monks, If you commit suicide, you'll be guilty of stealing and obstruction.",
        "source": "T22n1421_002:0007c04_9"
    },
    {
        "source_sentence": "又告：「從今已後，應修安般念，樂淨觀，樂喜觀。",
        "translation": "Again, he said, From now on, you should cultivate mindfulness of breathing in and breathing out, delighting in contemplation of purity and delighting in contemplation of joy.",
        "source": "T22n1421_002:0007c05_10"
    },
    {
        "source_sentence": "觀已，生惡不善法，即能除滅。",
        "translation": "After observing them, bad and unskillful qualities arise, and they can then be removed.",
        "source": "T22n1421_002:0007c06_11"
    },
    {
        "source_sentence": "以十利故為諸比丘結戒，從今是戒應如是說：「若比丘，手自殺人，斷其命，是比丘得波羅夷，不共住。」",
        "translation": "It's because of the ten benefits that the monks have established the precepts for their sake, and from now on these precepts should be explained in this way, If a monk kills himself with his hand and cuts off his life, that monk will attain pārājika and won't live together.",
        "source": "T22n1421_002:0007c07_12"
    },
    {
        "source_sentence": "爾時眾多比丘得重病，有諸比丘來問訊言：「大德！",
        "translation": "It was then that many monks became seriously ill, and some monks came to greet them, saying, Mañjuśrī!",
        "source": "T22n1421_002:0007c10_0"
    },
    {
        "source_sentence": "病寧有損，苦可忍不？」",
        "translation": "How could illness be harmful, and how could suffering be endured?",
        "source": "T22n1421_002:0007c11_1"
    },
    {
        "source_sentence": "病比丘言：「病猶未損，苦不可忍。」",
        "translation": "The sick monk said, My illness is still unhurt, and I can't bear the pain.",
        "source": "T22n1421_002:0007c11_2"
    },
    {
        "source_sentence": "便語諸比丘：「與我刀、繩，與我毒藥，與我增病食，將我至高岸邊。」",
        "translation": "He then said to the monks, Give me my sword and rope, give me poison and medicine, give me food that increases my illness, and take me to the side of the high bank.",
        "source": "T22n1421_002:0007c12_3"
    },
    {
        "source_sentence": "時諸比丘皆隨與之。",
        "translation": "The monks then gave it to him.",
        "source": "T22n1421_002:0007c13_4"
    },
    {
        "source_sentence": "病比丘或以刀自刺，或以繩自絞，或服毒藥，或食增病食，或墜高岸自斷其命。",
        "translation": "A sick monk might stab himself with a knife, drag himself with a rope, take poisonous medicine, eat food that increases his illness, or fall to a high bank and cut off his life on its own.",
        "source": "T22n1421_002:0007c14_5"
    },
    {
        "source_sentence": "諸比丘見其死已，便生悔心，以白阿難。",
        "translation": "Seeing his death, the monks felt remorse and reported it to Ānanda.",
        "source": "T22n1421_002:0007c16_0"
    },
    {
        "source_sentence": "阿難將至佛所，以事白佛。",
        "translation": "Ānanda was about to go to the Buddha and reported these matters to him.",
        "source": "T22n1421_002:0007c16_1"
    },
    {
        "source_sentence": "佛以是事集比丘僧，問諸比丘：「汝等實爾不？」",
        "translation": "Because of this, the Buddha gathered the monks and asked the monks, Is that true?",
        "source": "T22n1421_002:0007c17_2"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0007c18_3"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0007c18_4"
    },
    {
        "source_sentence": "佛種種呵責：「汝等愚癡，自斷人命、與刀令死，有何等異？",
        "translation": "The Buddha variously rebuked them, saying, What's the difference between you foolish people who cut off your own lives and cause death with a sword?",
        "source": "T22n1421_002:0007c18_5"
    },
    {
        "source_sentence": "從今是戒應如是說：「若比丘，自斷人命，持刀授與，得波羅夷，不共住。」",
        "translation": "From now on, this precept should be explained in this way: If a monk cuts off his own life and gives it to someone with a sword, he'll attain pārājika and won't live together.",
        "source": "T22n1421_002:0007c20_6"
    },
    {
        "source_sentence": "復有比丘得重病，諸比丘來問訊，如上語諸比丘：「與我刀、繩、毒藥。」",
        "translation": "Again, there was a monk who became seriously ill and the monks came to greet him, saying to the monks as above, Give me my sword, rope, and poisoned medicine.",
        "source": "T22n1421_002:0007c21_7"
    },
    {
        "source_sentence": "諸比丘言：「佛不聽我與人自殺之具；",
        "translation": "The monks said, “The Buddha will not allow me to give you the instrument for killing people.",
        "source": "T22n1421_002:0007c23_8"
    },
    {
        "source_sentence": "然我有知識獵師，當為汝喚，令斷汝命。」",
        "translation": "Still, I have a hunter of knowledge who will summon you and cause you to cut off your life.",
        "source": "T22n1421_002:0007c23_9"
    },
    {
        "source_sentence": "病比丘言：「為我速喚！」",
        "translation": "The sick monk said, Give me a quick call!",
        "source": "T22n1421_002:0007c24_10"
    },
    {
        "source_sentence": "彼比丘走語獵師言：「此有比丘得重病，不復樂生。",
        "translation": "That monk ran away and said to the hunter, “There’s a monk here who is seriously ill and no longer enjoys life.",
        "source": "T22n1421_002:0007c25_11"
    },
    {
        "source_sentence": "汝為斷命，可得大福。」",
        "translation": "If you cut off your life, you'll attain great merit.",
        "source": "T22n1421_002:0007c26_12"
    },
    {
        "source_sentence": "獵師言：「若殺生得大福者，屠膾之人得大福耶？",
        "translation": "The hunter said, If killing a living being obtains great fortune, will the butcher who slaughters it obtain great fortune?",
        "source": "T22n1421_002:0007c26_13"
    },
    {
        "source_sentence": "汝等比丘自言有慈悲心，今教人殺。",
        "translation": "You monks said you had a compassionate mind, so now you're teaching people to kill.",
        "source": "T22n1421_002:0007c27_14"
    },
    {
        "source_sentence": "教人殺與自殺，有何等異？」",
        "translation": "What's the difference between teaching people to kill and committing suicide?",
        "source": "T22n1421_002:0007c28_15"
    },
    {
        "source_sentence": "時諸比丘皆生悔心，往白阿難。",
        "translation": "The monks then all became remorseful and went to Ānanda.",
        "source": "T22n1421_002:0007c29_16"
    },
    {
        "source_sentence": "阿難將至佛所，以事白佛。",
        "translation": "Ānanda was about to go to the Buddha and reported these matters to him.",
        "source": "T22n1421_002:0008a01_17"
    },
    {
        "source_sentence": "佛以是事集比丘僧，問諸比丘：「汝實爾不？」",
        "translation": "Because of this, the Buddha gathered the monks and asked the monks, Is that true?",
        "source": "T22n1421_002:0008a01_18"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0008a02_19"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0008a02_20"
    },
    {
        "source_sentence": "佛種種呵責，語諸比丘言：「自殺、教人殺，有何等異？",
        "translation": "The Buddha reprimanded them in various ways and said to the monks, What's the difference between committing suicide and teaching others to kill?",
        "source": "T22n1421_002:0008a03_0"
    },
    {
        "source_sentence": "從今是戒應如是說：「若比丘，自殺、教人殺，得波羅夷，不共住。」",
        "translation": "From now on, this precept should be explained like this, If a monk kills himself and teaches others to kill him, he'll attain pārājika and won't live together.",
        "source": "T22n1421_002:0008a04_1"
    },
    {
        "source_sentence": "復有比丘得重病，諸比丘問訊如上，語病者言：「汝等戒行具足，應受天福，若自殺者，必得生天。",
        "translation": "Again, there was a monk who became seriously ill. The monks exchanged greetings as above and said to the sick man, “You should receive heavenly rewards for your good deeds; if you kill yourself, you will surely be reborn in heaven.",
        "source": "T22n1421_002:0008a06_0"
    },
    {
        "source_sentence": "何用如是久受苦為？」",
        "translation": "Why is it necessary to experience suffering for such a long time?",
        "source": "T22n1421_002:0008a08_1"
    },
    {
        "source_sentence": "病比丘言：「若當如是，雖有此苦，不能自殺。",
        "translation": "The sick monk said, If you do so, even though you experience this pain, you won't be able to kill yourself.",
        "source": "T22n1421_002:0008a08_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1421_002:0008a09_3"
    },
    {
        "source_sentence": "若自殺者，犯偷羅遮罪；",
        "translation": "If someone kills themselves, they commit the sin of pārājika.",
        "source": "T22n1421_002:0008a09_4"
    },
    {
        "source_sentence": "又復不得廣修梵行。」",
        "translation": "Again, they won't be allowed to cultivate the religious practice extensively.",
        "source": "T22n1421_002:0008a10_5"
    },
    {
        "source_sentence": "又呵言：「自手殺人、教人自殺，有何等異？",
        "translation": "Again, he reprimanded them, saying, What's the difference between killing someone with one's own hand and teaching someone to kill themselves?",
        "source": "T22n1421_002:0008a10_6"
    },
    {
        "source_sentence": "而汝比丘為此惡業！」",
        "translation": "And you monks are doing this bad action!",
        "source": "T22n1421_002:0008a11_7"
    },
    {
        "source_sentence": "諸長老比丘聞，種種呵責，將至佛所，以事白佛。",
        "translation": "When the elder monks heard this, they were variously rebuked and led to the Buddha's presence, where they reported the matter to him.",
        "source": "T22n1421_002:0008a12_8"
    },
    {
        "source_sentence": "佛以是事集比丘僧，問諸比丘：「汝實爾不？」",
        "translation": "Because of this, the Buddha gathered the monks and asked the monks, Is that true?",
        "source": "T22n1421_002:0008a13_9"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0008a14_10"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0008a14_11"
    },
    {
        "source_sentence": "佛種種呵責：「汝等愚癡，自手殺人、教人自殺，有何等異？",
        "translation": "The Buddha variously rebuked them, saying, What's the difference between you foolish people who kill with your own hands and those who teach others to kill themselves?",
        "source": "T22n1421_002:0008a14_12"
    },
    {
        "source_sentence": "從今是戒應如是說：「若比丘，自手殺人，教人自殺，得波羅夷，不共住。」",
        "translation": "From now on, this is the precept that should be explained in this way: If a monk kills someone with his own hand and teaches others to kill themselves, they'll attain pārājika and won't live together.",
        "source": "T22n1421_002:0008a15_13"
    },
    {
        "source_sentence": "復有比丘得重病，諸比丘問訊如上，亦語病者言：「汝等梵行已立，死受天樂。",
        "translation": "Again, there was a monk who became seriously ill. The monks greeted him as described above and also said to the sick man, “Your religious practice has been established, and you will die and be reborn in heavenly bliss.",
        "source": "T22n1421_002:0008a18_0"
    },
    {
        "source_sentence": "何用久受如此病苦，而不自殺？」",
        "translation": "Why would it be necessary to endure such illness and suffering for a long time without committing suicide?",
        "source": "T22n1421_002:0008a19_1"
    },
    {
        "source_sentence": "病比丘言：「我等雖爾，不能自殺。",
        "translation": "The sick monks said, Even so, we can't kill ourselves.",
        "source": "T22n1421_002:0008a20_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1421_002:0008a21_3"
    },
    {
        "source_sentence": "佛制自殺，犯偷羅遮；",
        "translation": "When the Buddha disciplined a person to kill himself, he commits a grave offense.",
        "source": "T22n1421_002:0008a21_4"
    },
    {
        "source_sentence": "又我病差，得修梵行。」",
        "translation": "Also, I'm sick and ill, so I can cultivate the religious practice.",
        "source": "T22n1421_002:0008a21_5"
    },
    {
        "source_sentence": "爾時彼國又有賊難，諸白衣骨肉分離，備諸痛惱。",
        "translation": "At the time, there was another thief in that country, with white robes and bones separated from each other, and it was filled with pain and suffering.",
        "source": "T22n1421_002:0008a22_6"
    },
    {
        "source_sentence": "比丘語言：「汝等已修生天福業，何用受此骨肉生離，憂悲之苦，而不自殺？」",
        "translation": "The monks said, You've cultivated the good karma of birth in heaven, so why wouldn't you have to experience the painful suffering of grief and sorrow that arises from this flesh and bones without killing yourself?",
        "source": "T22n1421_002:0008a23_7"
    },
    {
        "source_sentence": "答言：「我雖憂悲，不能自殺。",
        "translation": "He replied, Even though I'm grieved, I can't kill myself.",
        "source": "T22n1421_002:0008a25_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T22n1421_002:0008a25_9"
    },
    {
        "source_sentence": "在世遭苦，知修道業。」",
        "translation": "He's suffering in the world and knows the actions of cultivation.",
        "source": "T22n1421_002:0008a25_10"
    },
    {
        "source_sentence": "又呵言：「沙門之道，慈忍眾生。",
        "translation": "Again, he reprimanded them, saying, The path of the ascetic is to tolerate sentient beings with kindness.",
        "source": "T22n1421_002:0008a26_11"
    },
    {
        "source_sentence": "云何讚死，欲人自殺？",
        "translation": "How do you praise death and want people to kill themselves?",
        "source": "T22n1421_002:0008a26_12"
    },
    {
        "source_sentence": "自殺、讚死，有何等異？」",
        "translation": "What's the difference between committing suicide and praising death?",
        "source": "T22n1421_002:0008a27_13"
    },
    {
        "source_sentence": "諸長老比丘聞，種種呵責，將至佛所，以事白佛。",
        "translation": "When the elder monks heard this, they were variously rebuked and led to the Buddha's presence, where they reported the matter to him.",
        "source": "T22n1421_002:0008a27_14"
    },
    {
        "source_sentence": "佛以是事集比丘僧，問諸比丘：「汝實爾不？」",
        "translation": "Because of this, the Buddha gathered the monks and asked the monks, Is that true?",
        "source": "T22n1421_002:0008a28_15"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0008a29_16"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0008b01_17"
    },
    {
        "source_sentence": "佛種種呵責：「汝所作非法，自殺、讚死，有何等異？",
        "translation": "The Buddha variously rebuked them, saying, What's the difference between what you do that's unlawful, which is committing suicide and praising death?",
        "source": "T22n1421_002:0008b01_18"
    },
    {
        "source_sentence": "從今是戒應如是說：「若比丘，若人、若似人，若自殺、若與刀藥殺、若教人殺、若教自殺，譽死、讚死：『咄！",
        "translation": "From now on, this is the precept that should be explained in this way: If a monk kills himself, or if he kills someone with a sword or medicine, teaches someone else to kill him, or teaches someone else to kill him, praises death and praises death: 'Duh!",
        "source": "T22n1421_002:0008b02_19"
    },
    {
        "source_sentence": "人用惡活為？",
        "translation": "What's the purpose of people using bad livelihood?",
        "source": "T22n1421_002:0008b04_20"
    },
    {
        "source_sentence": "死勝生。』",
        "translation": "Death is superior to birth.'",
        "source": "T22n1421_002:0008b04_21"
    },
    {
        "source_sentence": "作是心，隨心殺；",
        "translation": "To think like this, they kill according to their thoughts.",
        "source": "T22n1421_002:0008b04_22"
    },
    {
        "source_sentence": "如是種種因緣，彼因是死，是比丘得波羅夷，不共住。」",
        "translation": "Such are the various causes and conditions that cause them to die, and this monk attains pārājika and doesn't live together.",
        "source": "T22n1421_002:0008b05_23"
    },
    {
        "source_sentence": "入母胎已後至四十九日，名為似人。",
        "translation": "On the forty-nineth day after entering his mother's womb, he's called resembling a human being.",
        "source": "T22n1421_002:0008b07_0"
    },
    {
        "source_sentence": "過此已後，盡名為人。",
        "translation": "After this, they'll all be called people.",
        "source": "T22n1421_002:0008b07_1"
    },
    {
        "source_sentence": "自以手、足、刀、杖、毒藥等殺，是名自殺。",
        "translation": "To kill yourself with your own hands, feet, swords, sticks, poisoned medicine, and so forth is called killing yourself.",
        "source": "T22n1421_002:0008b08_2"
    },
    {
        "source_sentence": "彼欲自殺，求殺具與之，是名與刀、藥殺。",
        "translation": "When they want to kill themselves, they ask for the instrument of killing and give it to them, which is called giving a sword or medicine to kill.",
        "source": "T22n1421_002:0008b09_3"
    },
    {
        "source_sentence": "使人殺，是名教人殺。",
        "translation": "Causing someone to kill is called teaching someone to kill.",
        "source": "T22n1421_002:0008b10_4"
    },
    {
        "source_sentence": "教人取死，是名教自殺。",
        "translation": "Teaching someone to take life is called teaching them to commit suicide.",
        "source": "T22n1421_002:0008b10_5"
    },
    {
        "source_sentence": "言死勝生，是名譽死、讚死。",
        "translation": "When death is called superior birth, it's called praising death and praising death.",
        "source": "T22n1421_002:0008b11_6"
    },
    {
        "source_sentence": "隨心遣諸鬼神殺，是名作是心，隨心殺。",
        "translation": "To send ghosts and spirits to kill according to their minds is called having this mind and killing according to their minds.",
        "source": "T22n1421_002:0008b11_7"
    },
    {
        "source_sentence": "是中犯者：自殺，遣使，展轉使，重遣使，指示，言說，眠時說，向眠說，醉時說，向醉說，狂時說，向狂說，亂心說，向亂心說，病壞心說，向病壞心說，遣書，作相，手語，相似語；",
        "translation": "Among these offenses, the first is to kill oneself; the second is to send an envoy; the third is to repeatedly send an envoy; the fourth is to again send an envoy; the fifth is to instruct [oneself] with words at the time of sleep; the sixth is to speak while facing toward sleep; the seventh is to speak while drunk; the eighth is to speak while",
        "source": "T22n1421_002:0008b13_0"
    },
    {
        "source_sentence": "獨、獨想，不獨、獨想，獨、不獨想；",
        "translation": "Thinking alone or alone, they think not alone. Thinking alone or alone, they think alone or not alone.",
        "source": "T22n1421_002:0008b16_1"
    },
    {
        "source_sentence": "戲語，色，聲，香，味，觸，優波頭，優波奢，優波害。",
        "translation": "What's playful, form, sound, smell, odor, taste, touch, upagupta, upāsaka, and upāsa are harmful.",
        "source": "T22n1421_002:0008b17_2"
    },
    {
        "source_sentence": "自殺者：自以手、足、刀、杖等殺；",
        "translation": "Suicide means killing oneself with one’s own hand, feet, sword, stick, etc.",
        "source": "T22n1421_002:0008b18_0"
    },
    {
        "source_sentence": "彼人死者，波羅夷。",
        "translation": "When that person dies, it's a pārājika.",
        "source": "T22n1421_002:0008b18_1"
    },
    {
        "source_sentence": "遣使者：遣使殺彼人；",
        "translation": "Dispatching envoy: Dispatching an envoy to kill someone.",
        "source": "T22n1421_002:0008b19_2"
    },
    {
        "source_sentence": "彼人死者，波羅夷。",
        "translation": "When that person dies, it's a pārājika.",
        "source": "T22n1421_002:0008b19_3"
    },
    {
        "source_sentence": "展轉使者：遣某甲殺，某甲不自殺，轉使乙殺；",
        "translation": "In succession, the messenger: sends a certain person to kill; a certain person does not kill himself; in succession, the messenger kills.",
        "source": "T22n1421_002:0008b19_4"
    },
    {
        "source_sentence": "死者，波羅夷。",
        "translation": "Death is pārājika.",
        "source": "T22n1421_002:0008b21_0"
    },
    {
        "source_sentence": "重遣者：始受使人不得殺，還報比丘，比丘更遣使殺；",
        "translation": "A grave rejecting means that when the envoy is initially accepted, no one may kill him. The bhikṣu who returns to report this fact to the bhikṣu and the bhikṣu then sends another messenger to kill him.",
        "source": "T22n1421_002:0008b21_1"
    },
    {
        "source_sentence": "死者，波羅夷。",
        "translation": "Death is pārājika.",
        "source": "T22n1421_002:0008b22_2"
    },
    {
        "source_sentence": "指示者：指示日、月、星宿，語人言：「汝福應生彼，汝可自殺。」",
        "translation": "The instruction: Showing the sun, moon, and stars, he tells people, You should be born there for your good fortune; you can kill yourself.",
        "source": "T22n1421_002:0008b22_3"
    },
    {
        "source_sentence": "從而死者，波羅夷。",
        "translation": "Someone who follows and dies is a pārājika.",
        "source": "T22n1421_002:0008b24_0"
    },
    {
        "source_sentence": "言說者：說生過惡，讚歎死好；",
        "translation": "“Explanation”: Explaining the faults of birth and praising the goodness of death.",
        "source": "T22n1421_002:0008b24_1"
    },
    {
        "source_sentence": "因此死者，波羅夷。",
        "translation": "It's a pārājika for someone who dies because of this.",
        "source": "T22n1421_002:0008b25_2"
    },
    {
        "source_sentence": "眠時說者：比丘眠中說先所念言：「汝功德已成，應可自殺。」",
        "translation": "Someone who says it while asleep: A monk goes to sleep and says what he thought before, You've accomplished your virtue, so you should kill yourself.",
        "source": "T22n1421_002:0008b25_3"
    },
    {
        "source_sentence": "彼人聞已，待覺問言：「汝何故說此？」",
        "translation": "After hearing this, that person waits to awaken and asks, Why are you saying this?",
        "source": "T22n1421_002:0008b26_4"
    },
    {
        "source_sentence": "答言：「我眠中，欲利益汝故，作是語汝；",
        "translation": "He replied, “In my sleep I want to benefit you by telling you this.",
        "source": "T22n1421_002:0008b27_5"
    },
    {
        "source_sentence": "今覺，亦作是語。",
        "translation": "Now that I'm awake, I'll also say this.",
        "source": "T22n1421_002:0008b28_6"
    },
    {
        "source_sentence": "汝可隨我語死。」",
        "translation": "You can follow my words and die.",
        "source": "T22n1421_002:0008b28_7"
    },
    {
        "source_sentence": "彼因是死者，波羅夷。",
        "translation": "It's a grave offense for someone who dies because of this.",
        "source": "T22n1421_002:0008b29_8"
    },
    {
        "source_sentence": "向眠說者：向眠人作是語：「汝功德已成，可以刀等自殺。」",
        "translation": "Someone who speaks to a sleeping person: They say this to the sleeping person, 'Your virtue has been accomplished, so you can kill yourself with a knife or so.'",
        "source": "T22n1421_002:0008b29_9"
    },
    {
        "source_sentence": "鬼神令眠中聞，即覺問言：「汝何故說此？」",
        "translation": "When the spirit caused him to sleep and hear it, he awakened and asked, Why are you saying this?",
        "source": "T22n1421_002:0008c01_10"
    },
    {
        "source_sentence": "答言：「汝眠時，我欲利益汝故，作是語；",
        "translation": "He replied, “When you sleep I want to benefit you by saying these words.",
        "source": "T22n1421_002:0008c02_11"
    },
    {
        "source_sentence": "汝今覺，亦作是語。",
        "translation": "Now that you've awakened, you also say this.",
        "source": "T22n1421_002:0008c03_12"
    },
    {
        "source_sentence": "汝可隨我語死。」",
        "translation": "You can follow my words and die.",
        "source": "T22n1421_002:0008c04_0"
    },
    {
        "source_sentence": "因是死者，波羅夷。",
        "translation": "A person who dies because of this is a pārājika.",
        "source": "T22n1421_002:0008c04_1"
    },
    {
        "source_sentence": "醉時說者：醉中說先所念言：「汝功德已成，應以刀等自殺。」",
        "translation": "When he's drunk, he says, In the midst of drunkenness, he says what he thought before, You've accomplished your virtue; you should kill yourself with a knife or so.",
        "source": "T22n1421_002:0008c04_2"
    },
    {
        "source_sentence": "彼人聞已，待醒問言：「汝何故說此？」",
        "translation": "After hearing this, that person waits to awaken and asks, Why are you saying this?",
        "source": "T22n1421_002:0008c06_3"
    },
    {
        "source_sentence": "答言：「我醉時，欲利益汝故，作是語；",
        "translation": "He replied, I say this because I want to benefit you when I am drunk.",
        "source": "T22n1421_002:0008c06_4"
    },
    {
        "source_sentence": "今醒，亦作是語。",
        "translation": "Now that I'm awake, I'll also say this.",
        "source": "T22n1421_002:0008c07_5"
    },
    {
        "source_sentence": "汝可隨我語死。」",
        "translation": "You can follow my words and die.",
        "source": "T22n1421_002:0008c07_6"
    },
    {
        "source_sentence": "因是死者，波羅夷。",
        "translation": "A person who dies because of this is a pārājika.",
        "source": "T22n1421_002:0008c08_7"
    },
    {
        "source_sentence": "向醉說者：作是言：「汝功德已成，汝可以刀等自殺。」",
        "translation": "He said to the drunken man, saying, You've accomplished your virtue, so you can kill yourself with a knife or so.",
        "source": "T22n1421_002:0008c08_8"
    },
    {
        "source_sentence": "醉醒已問言：「汝何故說此？」",
        "translation": "After he got drunk and woke up, he asked, Why are you saying this?",
        "source": "T22n1421_002:0008c09_9"
    },
    {
        "source_sentence": "答言：「我欲利益汝故，汝醉時，作是語；",
        "translation": "He replied, I want to benefit you. When you're drunk, I say these words.",
        "source": "T22n1421_002:0008c10_10"
    },
    {
        "source_sentence": "汝今醒，亦作是語。",
        "translation": "Now that you're awake, you also say this.",
        "source": "T22n1421_002:0008c11_11"
    },
    {
        "source_sentence": "汝可隨我語死。」",
        "translation": "You can follow my words and die.",
        "source": "T22n1421_002:0008c11_12"
    },
    {
        "source_sentence": "因此死者，波羅夷。",
        "translation": "It's a pārājika for someone who dies because of this.",
        "source": "T22n1421_002:0008c12_0"
    },
    {
        "source_sentence": "狂時說、向狂說、亂心說、向亂心說、病壞心說、向病壞心說亦如是。",
        "translation": "It's likewise when someone goes crazy, speaks to someone who's crazy, speaks to someone who's confused, speaks to someone who's confused, speaks to someone who's sick and breaks up, and speaks to someone who's sick and breaks up.",
        "source": "T22n1421_002:0008c12_1"
    },
    {
        "source_sentence": "遣書者：比丘遣書令殺。",
        "translation": "A person who sends a letter: A monk sends a letter to order someone to kill.",
        "source": "T22n1421_002:0008c13_2"
    },
    {
        "source_sentence": "彼作書，字字偷羅遮；",
        "translation": "They composed a book, the Sanskrit phonemes kalala and rākṣatra.",
        "source": "T22n1421_002:0008c14_3"
    },
    {
        "source_sentence": "書至彼，彼因是殺；",
        "translation": "When the letter reaches them, it is because of this that they are killed.",
        "source": "T22n1421_002:0008c14_4"
    },
    {
        "source_sentence": "死者，波羅夷。",
        "translation": "Death is pārājika.",
        "source": "T22n1421_002:0008c15_5"
    },
    {
        "source_sentence": "作相者：比丘語人言：「汝看我坐起，舉手，下手，口言寒暑時，便殺彼。」",
        "translation": "Someone who makes a mark: A monk says to someone, 'Look at me when I'm sitting up, raising my hand and touching it, saying, It's cold and hot, so I'll kill them.'",
        "source": "T22n1421_002:0008c15_6"
    },
    {
        "source_sentence": "彼見相便殺；",
        "translation": "When they see their marks, they kill.",
        "source": "T22n1421_002:0008c17_7"
    },
    {
        "source_sentence": "死者，波羅夷。",
        "translation": "Death is pārājika.",
        "source": "T22n1421_002:0008c17_8"
    },
    {
        "source_sentence": "手語者：作手語教人殺，彼隨此殺；",
        "translation": "“Manual expressions”: Making verbal expressions to instruct someone to be killed, they are subsequently killed.",
        "source": "T22n1421_002:0008c17_9"
    },
    {
        "source_sentence": "死者，波羅夷。",
        "translation": "Death is pārājika.",
        "source": "T22n1421_002:0008c18_10"
    },
    {
        "source_sentence": "相似語者：比丘作相似語教人殺，彼隨此殺；",
        "translation": "“Similar verbal expression”: A bhikṣu makes similar verbal expressions and instructs someone to kill.",
        "source": "T22n1421_002:0008c18_11"
    },
    {
        "source_sentence": "死者，波羅夷。",
        "translation": "Death is pārājika.",
        "source": "T22n1421_002:0008c19_12"
    },
    {
        "source_sentence": "獨、獨想者，突吉羅；",
        "translation": "To be alone and thinking alone is a grave offense.",
        "source": "T22n1421_002:0008c20_0"
    },
    {
        "source_sentence": "不獨、獨想，獨、不獨想者，偷羅遮。",
        "translation": "Not being alone or thinking alone, and not being alone or thinking alone, is a pārājika.",
        "source": "T22n1421_002:0008c20_1"
    },
    {
        "source_sentence": "戲語者：比丘戲笑語：「汝功德已成，可應自殺。」",
        "translation": "Someone who talks amusingly: The monk laughs and says, You've accomplished your virtue, so you should kill yourself.",
        "source": "T22n1421_002:0008c21_2"
    },
    {
        "source_sentence": "彼人問言：「何故說此？」",
        "translation": "The man asked, Why do you say this?",
        "source": "T22n1421_002:0008c22_3"
    },
    {
        "source_sentence": "比丘答言：「我先雖是戲言，今意實爾；",
        "translation": "The monks replied, “Even though I used to say this in a frivolous way, what do you really mean now?",
        "source": "T22n1421_002:0008c22_4"
    },
    {
        "source_sentence": "汝可自殺。」",
        "translation": "You may kill yourself.",
        "source": "T22n1421_002:0008c23_5"
    },
    {
        "source_sentence": "因此死者，波羅夷。",
        "translation": "It's a pārājika for someone who dies because of this.",
        "source": "T22n1421_002:0008c23_6"
    },
    {
        "source_sentence": "色者：若比丘作呪術，召惡色鬼神，使恐怖人。",
        "translation": "Form: Suppose a monk creates a spell that summons bad- colored ghosts and spirits to cause fearful people.",
        "source": "T22n1421_002:0008c24_7"
    },
    {
        "source_sentence": "因此死者，波羅夷。",
        "translation": "It's a pārājika for someone who dies because of this.",
        "source": "T22n1421_002:0008c25_8"
    },
    {
        "source_sentence": "聲者：若比丘作是語：「汝父母兒女已死，財物破散。」",
        "translation": "The sound: Suppose a monk says, Your parents and children have died, and your possessions are scattered.",
        "source": "T22n1421_002:0008c25_9"
    },
    {
        "source_sentence": "作如是語，欲令憂惱自殺；",
        "translation": "They say such things in order to cause sorrow and kill themselves.",
        "source": "T22n1421_002:0008c26_10"
    },
    {
        "source_sentence": "因此死者，波羅夷。",
        "translation": "It's a pārājika for someone who dies because of this.",
        "source": "T22n1421_002:0008c27_11"
    },
    {
        "source_sentence": "香者，以毒合和諸香，令嗅便死；",
        "translation": "A fragrance is a combination of poison and odors that causes one to smell it and die.",
        "source": "T22n1421_002:0008c27_12"
    },
    {
        "source_sentence": "因是死者，波羅夷。",
        "translation": "A person who dies because of this is a pārājika.",
        "source": "T22n1421_002:0008c28_13"
    },
    {
        "source_sentence": "味者：以毒著食中令食；",
        "translation": "Taste means to put poison in food and cause it to be eaten.",
        "source": "T22n1421_002:0008c28_14"
    },
    {
        "source_sentence": "因是死者，波羅夷。",
        "translation": "A person who dies because of this is a pārājika.",
        "source": "T22n1421_002:0008c29_15"
    },
    {
        "source_sentence": "觸者：以迦毘毒藥塗身殺；",
        "translation": "The tangible is: killing with the body coated with the poisonous medicine Kapilavastu.",
        "source": "T22n1421_002:0008c29_16"
    },
    {
        "source_sentence": "因是死者，波羅夷。",
        "translation": "A person who dies because of this is a pārājika.",
        "source": "T22n1421_002:0009a01_17"
    },
    {
        "source_sentence": "優波頭者：為一切眾生作穽殺，若人墮死，波羅夷；",
        "translation": "Upagupta: Committing wickedness and killing for the sake of all living beings. If someone falls to death, it is a pārājika.",
        "source": "T22n1421_002:0009a01_18"
    },
    {
        "source_sentence": "非人墮死，偷羅遮；",
        "translation": "A person who is not a human being and falls into death is a pārājika.",
        "source": "T22n1421_002:0009a02_19"
    },
    {
        "source_sentence": "畜生墮死，波逸提。",
        "translation": "An animal that falls into death, pratyekabuddha.",
        "source": "T22n1421_002:0009a03_20"
    },
    {
        "source_sentence": "優波奢者：作弱床薄覆其上，下安殺具，使人坐上；",
        "translation": "Upāsaka: Making a weak bed to cover it thinly, placing the instrument of torture beneath it and enabling one to sit on it.",
        "source": "T22n1421_002:0009a03_21"
    },
    {
        "source_sentence": "因是死者，波羅夷。",
        "translation": "A person who dies because of this is a pārājika.",
        "source": "T22n1421_002:0009a04_22"
    },
    {
        "source_sentence": "優波害者：作蠱毒殺；",
        "translation": "Upāsaka’s harmfulness is that he commits killing by magic.",
        "source": "T22n1421_002:0009a05_23"
    },
    {
        "source_sentence": "因是死者，波羅夷。",
        "translation": "A person who dies because of this is a pārājika.",
        "source": "T22n1421_002:0009a05_24"
    },
    {
        "source_sentence": "若比丘作是念：「我當殺彼人。」",
        "translation": "Suppose a monk thinks, I will kill that person.",
        "source": "T22n1421_002:0009a06_25"
    },
    {
        "source_sentence": "發心時，突吉羅；",
        "translation": "When one gives rise to mind, it is a grave offense.",
        "source": "T22n1421_002:0009a06_26"
    },
    {
        "source_sentence": "作方便時，偷羅遮；",
        "translation": "When they do so, it is a pārājika.",
        "source": "T22n1421_002:0009a07_27"
    },
    {
        "source_sentence": "死者，波羅夷。",
        "translation": "Death is pārājika.",
        "source": "T22n1421_002:0009a07_28"
    },
    {
        "source_sentence": "若殺非人，偷羅遮；",
        "translation": "If one kills someone who is not a human being, it is a pārājika.",
        "source": "T22n1421_002:0009a07_29"
    },
    {
        "source_sentence": "若殺畜生，波逸提。",
        "translation": "If someone kills an animal, pratyekabuddha.",
        "source": "T22n1421_002:0009a08_30"
    },
    {
        "source_sentence": "比丘尼亦如是。",
        "translation": "So it is with the bhikṣuṇīs.",
        "source": "T22n1421_002:0009a08_31"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1421_002:0009a09_32"
    },
    {
        "source_sentence": "不犯者：慈愍心、無殺心(第三事竟)。",
        "translation": "A person who doesn't violate the precepts has a compassionate mind and a mind free of killing (after the third thing).",
        "source": "T22n1421_002:0009a09_33"
    },
    {
        "source_sentence": "佛在毘舍離。",
        "translation": "The Buddha was in Vaiśālī.",
        "source": "T22n1421_002:0009a11_0"
    },
    {
        "source_sentence": "時世飢饉乞食難得，諸比丘入城分衛，都無所獲。",
        "translation": "At the time, the world was hungry and begged for food that was difficult to obtain, and the monks entered the city to guard it, but they didn't get anything.",
        "source": "T22n1421_002:0009a11_1"
    },
    {
        "source_sentence": "爾時世尊告諸比丘：「汝等各隨知識，就彼安居。",
        "translation": "It was then that the Bhagavān addressed the monks, Each of you, follow your friends and go to their retreat.",
        "source": "T22n1421_002:0009a12_2"
    },
    {
        "source_sentence": "莫住於此，受飢饉苦。」",
        "translation": "Don't stay here, and you'll suffer from hunger and thirst.",
        "source": "T22n1421_002:0009a13_3"
    },
    {
        "source_sentence": "比丘受教，有往摩竭國者，有往婆求末河邊聚落中者。",
        "translation": "When a monk receives the teaching, some go to the country of Magadha and some go to the village at the edge of the river in Vātsīputrīya.",
        "source": "T22n1421_002:0009a14_0"
    },
    {
        "source_sentence": "往河邊諸比丘集，共議言：「今乞食難得，此聚落中有信樂者，我等當共更相讚歎：『某得初禪，我亦得之；",
        "translation": "The bhikṣus at the riverside assembled and discussed among themselves, “It is difficult to obtain almsfood in this village. If there are those who believe in it, we should praise each other:",
        "source": "T22n1421_002:0009a15_1"
    },
    {
        "source_sentence": "某得二禪、三禪、四禪、四無量處、四無色定，我亦如是；",
        "translation": "So it is with me when I attain the second, third, fourth, and fifth meditations.",
        "source": "T22n1421_002:0009a17_2"
    },
    {
        "source_sentence": "某得四念處，乃至八正道分、三解脫門，我亦如是；",
        "translation": "So it is with me when I attain the four abodes of mindfulness, up to the eightfold correct path and the three gates of liberation.",
        "source": "T22n1421_002:0009a18_3"
    },
    {
        "source_sentence": "某得八解脫、九次第定、十一切入、十直道，我亦如是；",
        "translation": "So it is with me when I attain the eight liberations, the nine graduated concentrations, the ten universal states of enlightenment, and the ten direct paths.",
        "source": "T22n1421_002:0009a19_4"
    },
    {
        "source_sentence": "某得堅信、堅法、四沙門果、三明六神通，我亦如是。』",
        "translation": "I've attained resolute faith, resolute dharmas, the four fruits of asceticism, the three insights, and the six supernormal powers, and so have I.'",
        "source": "T22n1421_002:0009a21_0"
    },
    {
        "source_sentence": "諸居士聞，必生希有心，作是語：『我得善利，乃有如是得道聖人安居我邑。』",
        "translation": "When the householders heard this, they must have a rare feeling of wonder and say, 'I've gained good benefits, so why would there be such a noble person who has attained the Way to live in my town?'",
        "source": "T22n1421_002:0009a22_1"
    },
    {
        "source_sentence": "便當具諸餚饍供養我等，我等無乏得安樂住。」",
        "translation": "You will then have all the food and drink to offer to us, and we'll be able to live in comfort without lack.",
        "source": "T22n1421_002:0009a23_2"
    },
    {
        "source_sentence": "議已即便入城，到諸富家共相稱讚，如上所說，語言：「汝得大利，聖眾福田依汝聚落。」",
        "translation": "After the council had passed, he went into the city and went to the wealthy families to praise each other, as described above, saying, You've obtained great benefits, and the noble people of the field of merit rely on your village.",
        "source": "T22n1421_002:0009a24_3"
    },
    {
        "source_sentence": "諸居士聞，生希有心，歎未曾遇；",
        "translation": "When the householders heard this, they wondered in wonder and praised it as unprecedented.",
        "source": "T22n1421_002:0009a26_4"
    },
    {
        "source_sentence": "皆減己分，不復祭祠，斷施餘人并以供養。",
        "translation": "They all reduced their own portion and stopped performing sacrifices, cutting off the offerings to others and making offerings.",
        "source": "T22n1421_002:0009a27_5"
    },
    {
        "source_sentence": "諸佛常法，二時大會，春、夏末月諸方比丘皆來問訊。",
        "translation": "The Buddha always teaches the Dharma, and there are two timely assemblies of monks in spring and late summer. All the monks from different directions come to greet him.",
        "source": "T22n1421_002:0009a28_6"
    },
    {
        "source_sentence": "摩竭國諸比丘安居竟，羸瘦、憔悴來詣佛所，頂禮佛足，却住一面。",
        "translation": "When the monks of Magadha had settled down, they came to the place where the Buddha was staying. Weak and emaciated, weary and exhausted, they bowed their heads at his feet and withdrew to one side.",
        "source": "T22n1421_002:0009a29_7"
    },
    {
        "source_sentence": "諸佛常法，客比丘來皆加慰問，問言：「汝等安居和合，乞食易得，道路不疲耶？」",
        "translation": "It's always the Buddha's teaching, so when visiting monks come to greet them, they ask, Are you living in harmony and begging for food easy to obtain, and are you not weary on the road?",
        "source": "T22n1421_002:0009b02_0"
    },
    {
        "source_sentence": "諸比丘言：「安居和合，道路不疲，但乞食難得。」",
        "translation": "The monks said, They live in harmony, don't tire of the path, but it's difficult to beg for food.",
        "source": "T22n1421_002:0009b03_1"
    },
    {
        "source_sentence": "時佛為說種種妙法，示教利喜，令隨所住。",
        "translation": "The Buddha then explained various wonderful teachings for them, showed them benefits and joy, and caused them to abide wherever they were.",
        "source": "T22n1421_002:0009b04_2"
    },
    {
        "source_sentence": "婆求末河諸比丘身體充悅，來詣佛所，頂禮佛足，却住一面。",
        "translation": "The bhikṣus of Vātsīputrīya came to the place where the Buddha was. Having saluted him by bowing their foreheads at his feet, they withdrew and remained off to one side.",
        "source": "T22n1421_002:0009b05_3"
    },
    {
        "source_sentence": "佛亦如上慰問，諸比丘白言：「安居和合，乞食易得，道路不疲。」",
        "translation": "The Buddha also comforted them as above, and the monks said, Peaceful and harmonious, it's easy to obtain almsfood and the road isn't exhausted.",
        "source": "T22n1421_002:0009b07_0"
    },
    {
        "source_sentence": "佛即問言：「今世飢饉，乞求難得。",
        "translation": "The Buddha then asked, Nowadays there's hunger in the world, and it's difficult to ask for alms.",
        "source": "T22n1421_002:0009b08_1"
    },
    {
        "source_sentence": "汝等云何而獨言易？」",
        "translation": "How do you say it's easy by yourself?",
        "source": "T22n1421_002:0009b09_2"
    },
    {
        "source_sentence": "諸比丘白佛：「我等在彼，以乞食難得，更相讚歎。」",
        "translation": "The monks said to the Buddha, We're there, and it's difficult for us to beg for food, so we praise each other.",
        "source": "T22n1421_002:0009b09_3"
    },
    {
        "source_sentence": "具說如上。",
        "translation": "It's explained in detail as above.",
        "source": "T22n1421_002:0009b10_4"
    },
    {
        "source_sentence": "佛即問言：「汝等讚歎，為實、為虛？」",
        "translation": "The Buddha then asked, Do you praise them as real or false?",
        "source": "T22n1421_002:0009b10_5"
    },
    {
        "source_sentence": "比丘白佛：「有實、有虛。」",
        "translation": "The monks said to the Buddha, There's real and there's false.",
        "source": "T22n1421_002:0009b11_6"
    },
    {
        "source_sentence": "佛種種呵責虛者：「汝等非法，不隨順道，出家之人所不應作！",
        "translation": "The Buddha variously rebuked the false, saying, You're unlawful, you don't follow the path, and renunciants shouldn't do it!",
        "source": "T22n1421_002:0009b12_0"
    },
    {
        "source_sentence": "寧噉燒石，吞飲洋銅，不以虛妄，食人信施。",
        "translation": "Rather they burn rocks and swallow cooked copper. They do not give charity to those who eat it by believing in falsehood.",
        "source": "T22n1421_002:0009b13_1"
    },
    {
        "source_sentence": "汝等豈不聞，我毀呰妄語之罪，種種讚歎不妄語德耶？",
        "translation": "Don't you hear that I disparage the sin of false speech and variously praise the virtue of not speaking falsely?",
        "source": "T22n1421_002:0009b14_2"
    },
    {
        "source_sentence": "而今云何為利養故虛誑，自說得過人法？」",
        "translation": "How is it now that they speak falsely for profit and deceit, saying to themselves that they've attained the teaching beyond human beings?",
        "source": "T22n1421_002:0009b15_3"
    },
    {
        "source_sentence": "復呵責言：「諸比丘！",
        "translation": "Again, he reprimanded them and said, Monks!",
        "source": "T22n1421_002:0009b16_4"
    },
    {
        "source_sentence": "世間有五大賊：一者、作百人至千人主，破城、聚落，害人取物；",
        "translation": "There are five great thieves in the world:",
        "source": "T22n1421_002:0009b16_5"
    },
    {
        "source_sentence": "二者、有惡比丘將諸比丘遊行人間，邪命說法；",
        "translation": "The second is that if there are evil bhikṣus, they will lead the bhikṣus away among the people and preach false doctrines.",
        "source": "T22n1421_002:0009b18_6"
    },
    {
        "source_sentence": "三者、有惡比丘於佛所說法，自稱是我所造；",
        "translation": "3. A bad bhikṣu teaches the Dharma taught by the Buddha, claiming to have created it for me.",
        "source": "T22n1421_002:0009b19_7"
    },
    {
        "source_sentence": "四者、有惡比丘不修梵行，自言我修梵行；",
        "translation": "Fourth, there are evil bhikṣus who do not practice the holy life but claim to be practising it.",
        "source": "T22n1421_002:0009b20_8"
    },
    {
        "source_sentence": "五者、有惡比丘為利養故，空無過人法，自稱我得。",
        "translation": "5. If there's a bad monk who wants to benefit, emptiness is nothing beyond the dharmas of people and calls himself self-obtained.",
        "source": "T22n1421_002:0009b21_9"
    },
    {
        "source_sentence": "此第五賊，名為一切世間天、人、魔、梵、沙門、婆羅門中之最大賊。",
        "translation": "This fifth thief is called the greatest thief among all the world's gods, humans, Māra, Brahmā, ascetics, and brāhmaṇas.",
        "source": "T22n1421_002:0009b22_10"
    },
    {
        "source_sentence": "汝等云何為小利養，作最大賊？」",
        "translation": "How did you become the greatest thief for minor gain?",
        "source": "T22n1421_002:0009b23_11"
    },
    {
        "source_sentence": "如是呵責已，告諸比丘：「以十利故，為諸比丘結戒，從今是戒應如是說：「若比丘，不知、不見過人法，聖利滿足，自稱我如是知、如是見。",
        "translation": "After he had been reprimanded in this way, he told the monks, For the sake of these ten benefits, he formed the precepts for the monks, and from now on these precepts should be explained like this: If a monk doesn't know or doesn't see the teaching that goes beyond people, the noble benefits are fulfilled, and he claims to have thus known and thus seen me.",
        "source": "T22n1421_002:0009b24_12"
    },
    {
        "source_sentence": "後時，若問、若不問，為出罪，求清淨故，作是言：『我不知言知，不見言見，虛誑妄語。』",
        "translation": "Later, if someone asks or doesn't ask questions, they say, 'In order to exonerate sins and seek purity, I don't know words that are known, don't see words that are seen, and speak falsely and falsely.'",
        "source": "T22n1421_002:0009b27_13"
    },
    {
        "source_sentence": "是比丘得波羅夷，不共住。」",
        "translation": "That monk attains pārājika and doesn't live together.",
        "source": "T22n1421_002:0009b29_14"
    },
    {
        "source_sentence": "佛在舍衛城。",
        "translation": "The Buddha was in Śrāvastī.",
        "source": "T22n1421_002:0009c01_0"
    },
    {
        "source_sentence": "有眾多少聞比丘，不學、不問，無過人法，自謂我知、我見、我證。",
        "translation": "A large group of well-versed monks, who had neither studied nor asked questions, and weren't above the teachings of others, said to themselves, 'I know, I see, and I realize.'",
        "source": "T22n1421_002:0009c01_1"
    },
    {
        "source_sentence": "彼於後時，聞諸比丘講論得道、未得道相，乃悟非道；",
        "translation": "Later on, when they had heard the bhikṣus discussing the path and those who had not yet attained it, they perceived what was not the path.",
        "source": "T22n1421_002:0009c02_2"
    },
    {
        "source_sentence": "生慚愧心，作是念：「我等先未得謂得，將無犯波羅夷罪？」",
        "translation": "Arising from a sense of shame, they thought, We didn't previously claim to have attained it, so won't we commit the offense of pārājika?",
        "source": "T22n1421_002:0009c03_3"
    },
    {
        "source_sentence": "復有少聞比丘，不學、不問，無過人法，自謂我知、我見、我證。",
        "translation": "Again, there are well-versed monks who don't train or ask questions, aren't above the teachings of others, and claim to know, see, and realize them for themselves.",
        "source": "T22n1421_002:0009c05_4"
    },
    {
        "source_sentence": "彼於後時，廣學諸經，生慚愧心，作是念：「如我今解佛所說法，先未得謂得，是增上慢，將無犯波羅夷罪？」",
        "translation": "At a later time, he studied the sūtras extensively and became ashamed and thought, Suppose I now understand the Buddha's teaching but didn't previously claim to have attained it, is this an act of overweening conceit that won't violate the offense of pārājika?",
        "source": "T22n1421_002:0009c06_5"
    },
    {
        "source_sentence": "復有少聞比丘，不學、不問，無過人法，自謂我知、我見、我證。",
        "translation": "Again, there are well-versed monks who don't train or ask questions, aren't above the teachings of others, and claim to know, see, and realize them for themselves.",
        "source": "T22n1421_002:0009c08_6"
    },
    {
        "source_sentence": "彼於後時，廣修梵行，得入道果；",
        "translation": "At a later time he cultivated religious practice extensively and attained the fruit of the path of enlightenment.",
        "source": "T22n1421_002:0009c10_0"
    },
    {
        "source_sentence": "生慚愧心，作是念：「我先未得謂得，是增上慢，將無犯波羅夷罪？」",
        "translation": "Arising from a sense of shame, he thought, Did I say that I hadn't previously attained it, which is an arrogant conceit that won't commit the sin of violating the pārājika?",
        "source": "T22n1421_002:0009c10_1"
    },
    {
        "source_sentence": "諸比丘念已，各詣阿難，皆以問之。",
        "translation": "Having thought of this, the bhikṣus each approached Ānanda and asked him questions.",
        "source": "T22n1421_002:0009c12_2"
    },
    {
        "source_sentence": "阿難將至佛所，具以白佛。",
        "translation": "Ānanda approached the Buddha and reported this to him in detail.",
        "source": "T22n1421_002:0009c12_3"
    },
    {
        "source_sentence": "佛以是事集比丘僧，各隨其事問諸比丘：「汝實爾不？」",
        "translation": "The Buddha gathered the monks and nuns for this reason, each asked the monks according to their affairs, Is that true?",
        "source": "T22n1421_002:0009c13_4"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0009c14_5"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0009c14_6"
    },
    {
        "source_sentence": "佛告諸比丘：「有五種現過人法：一者、愚癡；",
        "translation": "The Buddha said to the bhikṣus: There are five kinds of dharmas that offend people in appearance.",
        "source": "T22n1421_002:0009c15_7"
    },
    {
        "source_sentence": "二者、亂心；",
        "translation": "The second is the state of confusion.",
        "source": "T22n1421_002:0009c16_8"
    },
    {
        "source_sentence": "三者、隨惡；",
        "translation": "The third is that which follows evil.",
        "source": "T22n1421_002:0009c16_9"
    },
    {
        "source_sentence": "四者、增上慢；",
        "translation": "The fourth is overweening pride.",
        "source": "T22n1421_002:0009c16_10"
    },
    {
        "source_sentence": "五者、實有。",
        "translation": "The fifth is real existence.",
        "source": "T22n1421_002:0009c16_11"
    },
    {
        "source_sentence": "若愚癡、亂心、增上慢、實有，而自言我得，犯波羅夷者，無有是處。",
        "translation": "If someone is foolish, confused, arrogant, overweeningly conceited, and really existent but says they've attained it, there's no place for someone who commits a pārājika to violate it.",
        "source": "T22n1421_002:0009c17_12"
    },
    {
        "source_sentence": "從今是戒應如是說：「若比丘，不知、不見過人法，聖利滿足，自稱我如是知，如是見。",
        "translation": "From now on, this precept should be explained in this way: Suppose a monk doesn't know or doesn't see the teachings of supernormal abilities, fulfills holy benefits, and claims to have such knowledge and such views for himself.",
        "source": "T22n1421_002:0009c18_13"
    },
    {
        "source_sentence": "是比丘後時，若問、若不問，為出罪，求清淨故，作是言：『我不知言知，不見言見，虛誑妄語。』",
        "translation": "Later, that monk asks questions or doesn't ask questions, and in order to exonerate himself from his sins and seek purity, he says, 'I don't know the words I know, don't see the words I see, and speak falsely and falsely.'",
        "source": "T22n1421_002:0009c20_14"
    },
    {
        "source_sentence": "除增上慢，是比丘得波羅夷，不共住。」",
        "translation": "Removing their overweening conceit, this monk attains pārājika and doesn't live together.",
        "source": "T22n1421_002:0009c22_15"
    },
    {
        "source_sentence": "不知、不見者：不知、不見過人法。",
        "translation": "Someone who doesn't know and doesn't see: they don't know and don't see the teaching that goes beyond people.",
        "source": "T22n1421_002:0009c24_0"
    },
    {
        "source_sentence": "一切出要法，謂諸禪、解脫、三昧、正受，諸聖道果，是名過人法。",
        "translation": "All the essential dharmas that arise, which are meditations, liberations, samādhis, meditative absorptions, and the fruits of the noble paths, are called superhuman dharmas.",
        "source": "T22n1421_002:0009c24_1"
    },
    {
        "source_sentence": "於佛所說苦集滅道，已辦、已足，更無所求，是名聖利滿足。",
        "translation": "Having accomplished what the Buddha teaches about the path of suffering, accumulation, cessation, and enlightenment, having fulfilled it and not seeking anything more, this is called the fulfillment of noble benefits.",
        "source": "T22n1421_002:0009c26_2"
    },
    {
        "source_sentence": "自說：我如是知見法，法亦知見我，是名自稱我如是知，如是見。",
        "translation": "He himself says, 'I thus know and see things, and dharmas also know and see me.' This is called self-declaring that I thus know and thus see.",
        "source": "T22n1421_002:0009c27_3"
    },
    {
        "source_sentence": "若一月乃至一歲後，問：「汝云何得？",
        "translation": "If it's a month or even a year later, he asks, How did you get it?",
        "source": "T22n1421_002:0009c28_4"
    },
    {
        "source_sentence": "何處得？",
        "translation": "Where will it be obtained?",
        "source": "T22n1421_002:0009c29_5"
    },
    {
        "source_sentence": "從誰得？",
        "translation": "Where did it come from?",
        "source": "T22n1421_002:0009c29_6"
    },
    {
        "source_sentence": "以何法得？」",
        "translation": "What is the method for attaining it?",
        "source": "T22n1421_002:0009c29_7"
    },
    {
        "source_sentence": "若不問，而自發露所犯，求戒淨、心淨、見淨、疑淨，言：「我不知、不見苦集滅道，言知、言見，虛誑妄語。」",
        "translation": "If someone doesn't ask questions and reveals their offenses themselves, seeking the purity of precepts, purity of mind, purity of views, purity of doubt, and purity of doubt, they say, I don't know or don't see the path to suffering, accumulation, cessation, and cessation, speak knowing and seeing, and speak falsely and falsely.",
        "source": "T22n1421_002:0010a01_8"
    },
    {
        "source_sentence": "雖作如此發露，故得波羅夷。",
        "translation": "Even though he did so, he revealed it in this way, and therefore he attained pārājika.",
        "source": "T22n1421_002:0010a03_9"
    },
    {
        "source_sentence": "是中犯者：有二種得波羅夷：一者、先作是念：「我當虛說得過人法。」",
        "translation": "Here are the offenders: There are two kinds of attainment of pārājika: first, they first think, I will falsely explain the teaching that's wrong with people.",
        "source": "T22n1421_002:0010a04_0"
    },
    {
        "source_sentence": "二者、當說時，作是念：「我今虛說得過人法。」",
        "translation": "Second, when he teaches it, he thinks, Now, I'll speak falsely about the teaching that transcends human dharmas.",
        "source": "T22n1421_002:0010a05_1"
    },
    {
        "source_sentence": "復有三種得波羅夷：二如上說；",
        "translation": "Again, there are three kinds of acquisition of a pārājika:",
        "source": "T22n1421_002:0010a06_2"
    },
    {
        "source_sentence": "三者、作是念：「我已虛說得過人法。」",
        "translation": "Third, he thinks, I've been speaking falsely about the teaching that goes beyond people.",
        "source": "T22n1421_002:0010a07_3"
    },
    {
        "source_sentence": "復有四種得波羅夷：三如上說；",
        "translation": "Again, there are four kinds of acquisition of a pārājika:",
        "source": "T22n1421_002:0010a07_4"
    },
    {
        "source_sentence": "四者、異見說過人法。",
        "translation": "Fourth, it's a dissimilar view that teaches what's wrong with people and dharmas.",
        "source": "T22n1421_002:0010a08_5"
    },
    {
        "source_sentence": "復有五種得波羅夷：四如上說；",
        "translation": "Again, there are five kinds of acquisition of a pārājika:",
        "source": "T22n1421_002:0010a09_6"
    },
    {
        "source_sentence": "五者、異想說過人法。",
        "translation": "The fifth is that it's a different conception that teaches what's wrong with people and things.",
        "source": "T22n1421_002:0010a09_7"
    },
    {
        "source_sentence": "復有六種得波羅夷：五如上說；",
        "translation": "Again, there are six kinds of acquisition of a pārājika:",
        "source": "T22n1421_002:0010a10_8"
    },
    {
        "source_sentence": "六者、異忍說過人法。",
        "translation": "The sixth is that it's a different kind of forbearance that teaches what's wrong with people.",
        "source": "T22n1421_002:0010a10_9"
    },
    {
        "source_sentence": "復有七種得波羅夷：六如上說；",
        "translation": "“Furthermore, there are seven forms of acquisition of a pārājika:",
        "source": "T22n1421_002:0010a11_10"
    },
    {
        "source_sentence": "七者、異樂說過人法。",
        "translation": "7. It's a dissimilar pleasure to teach the Dharma that's beyond human beings.",
        "source": "T22n1421_002:0010a12_11"
    },
    {
        "source_sentence": "復有八種得波羅夷：七如上說；",
        "translation": "“Furthermore, there are eight forms of acquisition of a pārājika:",
        "source": "T22n1421_002:0010a12_12"
    },
    {
        "source_sentence": "八者、不隨問答說過人法。",
        "translation": "Eighth, they don't follow questions and answers to explain the faults of people and dharmas.",
        "source": "T22n1421_002:0010a13_13"
    },
    {
        "source_sentence": "有四種非聖語、四種聖語。",
        "translation": "There are four kinds of non-holy speech and four kinds of noble speech.",
        "source": "T22n1421_002:0010a13_14"
    },
    {
        "source_sentence": "非聖語者：不見言見，不聞言聞，不覺言覺，不知言知。",
        "translation": "Someone who doesn't see words and sees, doesn't hear words and hear words, doesn't perceive words and perceive them, and doesn't know words and know them.",
        "source": "T22n1421_002:0010a14_15"
    },
    {
        "source_sentence": "聖語者：見言見，聞言聞，覺言覺，知言知。",
        "translation": "The holy saying is that seeing is seeing, hearing is hearing, apprehension is apprehending, and knowing is knowing.",
        "source": "T22n1421_002:0010a15_16"
    },
    {
        "source_sentence": "又八種非聖語、八種聖語。",
        "translation": "Also, there are eight kinds of non-holy speech and eight kinds of noble speech.",
        "source": "T22n1421_002:0010a16_17"
    },
    {
        "source_sentence": "非聖語者：不見言見，見言不見，不聞言聞，聞言不聞，不覺言覺，覺言不覺，不知言知，知言不知；",
        "translation": "Someone who does not see what is said to be seen, sees what is said to be seen, doesn’t hear what is said to be heard, doesn’t hear what is said to be heard, doesn’t perceive what is said to be perceived, doesn’t perceive what is said to be perceived, doesn’t know what is known, and knows what is known.",
        "source": "T22n1421_002:0010a17_18"
    },
    {
        "source_sentence": "反上名八聖語。",
        "translation": "The opposite of the above is called the eight noble words.",
        "source": "T22n1421_002:0010a19_19"
    },
    {
        "source_sentence": "又十六非聖語、十六聖語。",
        "translation": "Also, there are 16 things that aren't noble words and 16 noble words.",
        "source": "T22n1421_002:0010a19_20"
    },
    {
        "source_sentence": "非聖語者：不見言見，不聞言聞，不覺言覺，不知言知，見言不見，聞言不聞，覺言不覺，知言不知，見疑言不疑，聞疑言不疑，覺疑言不疑，知疑言不疑，見不疑言疑，聞不疑言疑，覺不疑言疑，知不疑言疑；",
        "translation": "Those who do not see what is said to be seeing, do not hear what is said to be hearing, do not perception what is said to be perceiving, do not know what is said to be knowing, do not perceive what is said to be seeing, do not perceive what is said to be cognized, do not perceive what is said to be cognized, do not perceive what is said to be cognized",
        "source": "T22n1421_002:0010a20_21"
    },
    {
        "source_sentence": "反上名十六聖語。",
        "translation": "The opposite of the above is called the sixteen noble words.",
        "source": "T22n1421_002:0010a24_22"
    },
    {
        "source_sentence": "若比丘向人自稱得過人法，解者，波羅夷；",
        "translation": "If a monk tells another person and claims to have gained the superhuman dharma, and if he understands it, [this is] a pārājika.",
        "source": "T22n1421_002:0010a26_0"
    },
    {
        "source_sentence": "不解者，偷羅遮。",
        "translation": "Someone who doesn't understand it is a pārājika.",
        "source": "T22n1421_002:0010a26_1"
    },
    {
        "source_sentence": "向非人說，偷羅遮；",
        "translation": "To teach it to someone who is not a human being is a pārājika.",
        "source": "T22n1421_002:0010a27_2"
    },
    {
        "source_sentence": "向畜生說，突吉羅。",
        "translation": "He spoke to the animals, pratyekabuddha.",
        "source": "T22n1421_002:0010a27_3"
    },
    {
        "source_sentence": "比丘尼亦如是。",
        "translation": "So it is with the bhikṣuṇīs.",
        "source": "T22n1421_002:0010a28_4"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1421_002:0010a28_5"
    },
    {
        "source_sentence": "不犯者：實語(第四戒竟)。",
        "translation": "Those who don't violate the precepts are those who speak truthfully (after the fourth precept).",
        "source": "T22n1421_002:0010a29_6"
    },
    {
        "source_sentence": "五分律第一分之二僧殘法",
        "translation": "the first part of the five parts of the Vinaya, the two saṃghâvaśeṣa dharma",
        "source": "T22n1421_002:0010b01_0"
    },
    {
        "source_sentence": "佛在舍衛城。",
        "translation": "The Buddha was in Śrāvastī.",
        "source": "T22n1421_002:0010b02_0"
    },
    {
        "source_sentence": "爾時長老優陀夷為欲火所燒，身體羸瘦，纔有氣息。",
        "translation": "At the time, the elder Udayana was burned by the fire of desire, and his body was so thin that he could only breathe.",
        "source": "T22n1421_002:0010b02_1"
    },
    {
        "source_sentence": "以手出不淨，得安樂住。",
        "translation": "He puts out an impure object with his hand and obtains a peaceful abode.",
        "source": "T22n1421_002:0010b03_2"
    },
    {
        "source_sentence": "有異比丘亦復羸瘦。",
        "translation": "A different monk was also thin.",
        "source": "T22n1421_002:0010b04_3"
    },
    {
        "source_sentence": "優陀夷問：「汝何故爾？」",
        "translation": "Udāyin asked, Why are you like that?",
        "source": "T22n1421_002:0010b04_4"
    },
    {
        "source_sentence": "答言：「長老！",
        "translation": "He replied, Elder!",
        "source": "T22n1421_002:0010b05_5"
    },
    {
        "source_sentence": "我為欲火所燒，是故如是。」",
        "translation": "Because I'm burned by the fire of desire, it's like this.",
        "source": "T22n1421_002:0010b05_6"
    },
    {
        "source_sentence": "優陀夷言：「我先亦爾，以手出不淨，得安樂住。",
        "translation": "Udāyin said, So it was with me, who took out an impure object with my hand and attained a peaceful abode.",
        "source": "T22n1421_002:0010b05_7"
    },
    {
        "source_sentence": "汝若法我，亦當如是。」",
        "translation": "If you teach the self, it will be likewise.",
        "source": "T22n1421_002:0010b06_8"
    },
    {
        "source_sentence": "彼比丘言：「汝所作非法，非清淨行，破沙門法，不隨順道！",
        "translation": "That monk said, What you've done is unlawful, not a pure practice that breaks the ascetic's teaching and doesn't follow the path!",
        "source": "T22n1421_002:0010b07_9"
    },
    {
        "source_sentence": "世尊種種呵欲、欲想、欲覺、欲熱；",
        "translation": "“World-honored One, the World-honored One has variously condemned desire, perception of desire, feeling of desire, and fever of desire.",
        "source": "T22n1421_002:0010b08_10"
    },
    {
        "source_sentence": "斷欲想、除欲覺、滅欲熱；",
        "translation": "They cut off all thoughts of desire, relieve all feelings of desire, and extinguish the burning heat of desire.",
        "source": "T22n1421_002:0010b09_11"
    },
    {
        "source_sentence": "說欲如赤骨，如毒藥。",
        "translation": "It's said that desire is like red bones and poisonous medicine.",
        "source": "T22n1421_002:0010b09_12"
    },
    {
        "source_sentence": "汝今云何以此手出於不淨，受人信施，復以教人？」",
        "translation": "How did you now use this hand to get rid of impurity, receive people's faith and gifts, and then teach them again?",
        "source": "T22n1421_002:0010b10_13"
    },
    {
        "source_sentence": "呵責已，將至佛所，以事白佛。",
        "translation": "After he had been reprimanded, he went to the Buddha and told him about his affairs.",
        "source": "T22n1421_002:0010b11_14"
    },
    {
        "source_sentence": "佛以是事集比丘僧，問優陀夷：「汝實爾不？」",
        "translation": "Because of this, the Buddha gathered the monks and asked Udayana, Is that true?",
        "source": "T22n1421_002:0010b12_15"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0010b13_16"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0010b13_17"
    },
    {
        "source_sentence": "佛亦種種如上呵責已，告諸比丘：「以十利故，為諸比丘結戒，從今是戒應如是說：「若比丘，故出不淨，僧伽婆尸沙。」",
        "translation": "After the Buddha had been rebuked in various ways as above, he told the monks, For the sake of the ten benefits, he formed the precepts for the monks, and from now on these precepts should be explained like this, 'If a monk leaves them because they're impure, it's Saṃghâvaśeṣa.'",
        "source": "T22n1421_002:0010b13_18"
    },
    {
        "source_sentence": "爾時諸比丘不一其心，夢失不淨，覺作是念：「我夢中亦有心，亦動身，失不淨。",
        "translation": "At the time, the monks didn't concentrate their minds, and in a dream they lost impurity. They felt this thought, I had a mind in a dream that also moved my body and lost impurity.",
        "source": "T22n1421_002:0010b16_0"
    },
    {
        "source_sentence": "將無犯僧伽婆尸沙耶？」",
        "translation": "Will there be no violation of the saṃghâvaśeṣa?",
        "source": "T22n1421_002:0010b17_1"
    },
    {
        "source_sentence": "或有發露者、或有行摩那埵者、或有出罪者、或有直白佛者。",
        "translation": "Some people who reveal it, some who practice manasattvas, some who expel sins, and some who directly tell the Buddha.",
        "source": "T22n1421_002:0010b18_2"
    },
    {
        "source_sentence": "佛以是事集比丘僧，問諸比丘：「汝等實爾不？」",
        "translation": "Because of this, the Buddha gathered the monks and asked the monks, Is that true?",
        "source": "T22n1421_002:0010b19_3"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0010b20_4"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0010b20_5"
    },
    {
        "source_sentence": "佛種種呵責：「汝等不應散亂心眠，若散亂心眠，犯突吉羅。」",
        "translation": "The Buddha variously rebuked them, You shouldn't sleep with distracted minds; if you sleep with distracted minds, it's a violation of the grave.",
        "source": "T22n1421_002:0010b20_6"
    },
    {
        "source_sentence": "散亂心眠，有五過失：一者、惡夢；",
        "translation": "There are five faults in sleepiness of the distracted mind:",
        "source": "T22n1421_002:0010b22_7"
    },
    {
        "source_sentence": "二者、善神不護；",
        "translation": "The second is that they are not guarded by good deities.",
        "source": "T22n1421_002:0010b22_8"
    },
    {
        "source_sentence": "三者、不得明想；",
        "translation": "The third is that they do not attain perceptions of insight.",
        "source": "T22n1421_002:0010b23_9"
    },
    {
        "source_sentence": "四者、無覺法心；",
        "translation": "The fourth is the mental state of nonenlightenment regarding phenomena.",
        "source": "T22n1421_002:0010b23_10"
    },
    {
        "source_sentence": "五者、失不淨。",
        "translation": "5. loss of impurity.",
        "source": "T22n1421_002:0010b23_11"
    },
    {
        "source_sentence": "不散亂心眠，有五德：無惡夢、善神護、得明想、有覺法心、不失不淨。",
        "translation": "A mind that isn't distracted by mental sleep has five virtues: being free of bad dreams, guarded by good spirits, attaining insight, having a mind that perceives the Dharma, and not losing impurity.",
        "source": "T22n1421_002:0010b24_12"
    },
    {
        "source_sentence": "有五因緣眠時形起：一者、大便盛；",
        "translation": "There are five reasons for the appearance that occurs at the time of sleep:",
        "source": "T22n1421_002:0010b25_13"
    },
    {
        "source_sentence": "二者、小便盛；",
        "translation": "The second is that their urine becomes abundant.",
        "source": "T22n1421_002:0010b26_14"
    },
    {
        "source_sentence": "三者、風盛；",
        "translation": "The third is the great wind.",
        "source": "T22n1421_002:0010b26_15"
    },
    {
        "source_sentence": "四者、虫嚙；",
        "translation": "The fourth is that they are attacked by insects.",
        "source": "T22n1421_002:0010b26_16"
    },
    {
        "source_sentence": "五者、欲盛。",
        "translation": "5. the craving that flourishes...",
        "source": "T22n1421_002:0010b27_17"
    },
    {
        "source_sentence": "復告諸比丘：「若未離欲恚癡，散亂心眠，必失不淨；",
        "translation": "Again, he said to the bhikṣus: If one is not free from desire, hatred, and delusion, [and] sleeps in a distracted state of mind, one will surely lose that which is impure.",
        "source": "T22n1421_002:0010b27_18"
    },
    {
        "source_sentence": "雖未能離，以繫念心眠者，無有是過。",
        "translation": "Even though they can't part with it, there's nothing wrong with someone who's bound by mindfulness of mind and sleep.",
        "source": "T22n1421_002:0010b28_19"
    },
    {
        "source_sentence": "從今是戒應如是說：「若比丘，故出不淨，除夢中，僧伽婆尸沙。」",
        "translation": "From now on, this is the precept that should be explained in this way, Suppose a monk intentionally produces impurity and removes it from his dream, Saṃghâvaśeṣa.",
        "source": "T22n1421_002:0010b29_20"
    },
    {
        "source_sentence": "故出不淨者：發心，身動，出不淨也。",
        "translation": "Therefore, what's impure is produced: the arousal of mind, bodily movement, and exhalation are impure.",
        "source": "T22n1421_002:0010c01_21"
    },
    {
        "source_sentence": "僧伽婆尸沙者：此罪有殘，猶有因緣尚可治，有恃怙，得在僧中求除滅也。",
        "translation": "Saṃghâvaśeṣa: This sin is so grave that there are still causes and conditions for it to be cured, and there's a relying person who can seek to remove it in the saṃgha.",
        "source": "T22n1421_002:0010c02_22"
    },
    {
        "source_sentence": "不淨有十種：一者、青色；",
        "translation": "4.5.29 There are ten kinds of impure:",
        "source": "T22n1421_002:0010c04_23"
    },
    {
        "source_sentence": "二者、黃色；",
        "translation": "The second is yellow.",
        "source": "T22n1421_002:0010c04_24"
    },
    {
        "source_sentence": "三者、紅色；",
        "translation": "The third is red.",
        "source": "T22n1421_002:0010c04_25"
    },
    {
        "source_sentence": "四者、黑色；",
        "translation": "The fourth is black.",
        "source": "T22n1421_002:0010c05_26"
    },
    {
        "source_sentence": "五者、赤色；",
        "translation": "The fifth is the color red.",
        "source": "T22n1421_002:0010c05_27"
    },
    {
        "source_sentence": "六者、白色；",
        "translation": "The sixth is white.",
        "source": "T22n1421_002:0010c05_28"
    },
    {
        "source_sentence": "七者、乳色；",
        "translation": "The seventh is the color of milk.",
        "source": "T22n1421_002:0010c05_29"
    },
    {
        "source_sentence": "八者、酥色；",
        "translation": "The eighth is the color of butter.",
        "source": "T22n1421_002:0010c06_0"
    },
    {
        "source_sentence": "九者、油色；",
        "translation": "The ninth is the color of oil.",
        "source": "T22n1421_002:0010c06_1"
    },
    {
        "source_sentence": "十者、蜜色。",
        "translation": "Tenth, the color of honey.",
        "source": "T22n1421_002:0010c06_2"
    },
    {
        "source_sentence": "若發心，身動，欲出青色，而黃色乃至蜜色出，皆僧伽婆尸沙。",
        "translation": "If he arouses the intention, his body moves and wants to produce blue color, but yellow or even honey color comes out, which are all sands of Saṃghâvaśeṣa.",
        "source": "T22n1421_002:0010c06_3"
    },
    {
        "source_sentence": "若發心，身動，欲出黃色乃至蜜色，而餘色出，亦如是。",
        "translation": "When one decides to make a vow, the body moves and desires to produce the color of yellow or even the color of honey. The same applies up to when other colors are produced:",
        "source": "T22n1421_002:0010c08_4"
    },
    {
        "source_sentence": "有十種發心，身動，出不淨，皆僧伽婆尸沙：一者、自試；",
        "translation": "There are ten kinds of arousal of the determination for enlightenment:",
        "source": "T22n1421_002:0010c09_5"
    },
    {
        "source_sentence": "二者、除病；",
        "translation": "The second is the removal of sickness.",
        "source": "T22n1421_002:0010c10_6"
    },
    {
        "source_sentence": "三者、為顏色；",
        "translation": "The third is for the sake of appearance.",
        "source": "T22n1421_002:0010c10_7"
    },
    {
        "source_sentence": "四者、為力；",
        "translation": "The fourth is power.",
        "source": "T22n1421_002:0010c10_8"
    },
    {
        "source_sentence": "五者、為樂；",
        "translation": "The fifth is happiness.",
        "source": "T22n1421_002:0010c11_9"
    },
    {
        "source_sentence": "六者、為布施；",
        "translation": "The sixth is generosity.",
        "source": "T22n1421_002:0010c11_10"
    },
    {
        "source_sentence": "七者、為生天；",
        "translation": "The seventh is birth as a celestial being.",
        "source": "T22n1421_002:0010c11_11"
    },
    {
        "source_sentence": "八者、為外道祠天會；",
        "translation": "The eighth is the assembly for the sake of non-Buddhist shrines and celestial beings.",
        "source": "T22n1421_002:0010c11_12"
    },
    {
        "source_sentence": "九者、為種子；",
        "translation": "The ninth is that they are seeds.",
        "source": "T22n1421_002:0010c12_13"
    },
    {
        "source_sentence": "十者、為火祠。",
        "translation": "Tenth, it's a fire shrine.",
        "source": "T22n1421_002:0010c12_14"
    },
    {
        "source_sentence": "有五種發心，身動，出不淨，皆僧伽婆尸沙：內色、外色、虛空、風、水。",
        "translation": "There are five kinds of arousal of mind that move the body and produce impurity, which are all incalculable: internal form, external form, space, wind, and water.",
        "source": "T22n1421_002:0010c12_15"
    },
    {
        "source_sentence": "內色者，己身。",
        "translation": "'Inward form' is self.",
        "source": "T22n1421_002:0010c14_16"
    },
    {
        "source_sentence": "外色者，他身。",
        "translation": "“External matter”: The other body.",
        "source": "T22n1421_002:0010c14_17"
    },
    {
        "source_sentence": "虛空者，空中動身。",
        "translation": "Space refers to the body that moves in space.",
        "source": "T22n1421_002:0010c14_18"
    },
    {
        "source_sentence": "風者，向風行。",
        "translation": "Wind is going toward wind.",
        "source": "T22n1421_002:0010c15_19"
    },
    {
        "source_sentence": "水者，逆水行。",
        "translation": "Water is going against water.",
        "source": "T22n1421_002:0010c15_20"
    },
    {
        "source_sentence": "又有五種發心，身動，出不淨，僧伽婆尸沙：大便盛、小便盛、風盛、虫嚙、欲盛。",
        "translation": "Again, there are five kinds of arousal of mind that move the body and produce impurity, which are as numerous as the sands of Saṃghâvaśeṣa: large with urination, small with urination, large with wind, large with insect clinging, and large with desire.",
        "source": "T22n1421_002:0010c15_21"
    },
    {
        "source_sentence": "若發心，身不動，不出不淨；",
        "translation": "If one decides to undertake enlightenment, his body does not move, and he does not produce impurity.",
        "source": "T22n1421_002:0010c17_22"
    },
    {
        "source_sentence": "發心，身不動，出不淨，皆突吉羅。",
        "translation": "When he arouses the intention, his body doesn't move, and when he produces impurity, it's all a grave offense.",
        "source": "T22n1421_002:0010c18_23"
    },
    {
        "source_sentence": "發心，身動，不出不淨，偷羅遮。",
        "translation": "When he gives rise to the intention, his body moves and doesn't emit impure things, which are pārājika.",
        "source": "T22n1421_002:0010c18_24"
    },
    {
        "source_sentence": "不發心，身動，不出不淨；",
        "translation": "They do not give rise to the thought of enlightenment, their bodies move and they do not emit impurity.",
        "source": "T22n1421_002:0010c19_25"
    },
    {
        "source_sentence": "不發心，身動，出不淨；",
        "translation": "They do not give rise to the thought of enlightenment; their bodies move, and they emit impurity.",
        "source": "T22n1421_002:0010c20_26"
    },
    {
        "source_sentence": "不發心，身不動，出不淨，皆不犯。",
        "translation": "It's not a violation if someone doesn't give rise to the intention, doesn't move their body, and produces impurity.",
        "source": "T22n1421_002:0010c20_27"
    },
    {
        "source_sentence": "眠時出不淨，覺時發心，身動，偷羅遮；",
        "translation": "When lying asleep, it is impure; when awake, it is with the arousal of mind; when bodily movement occurs, it is a pārājika.",
        "source": "T22n1421_002:0010c21_28"
    },
    {
        "source_sentence": "眠時身動，覺時發心，出不淨，突吉羅；",
        "translation": "When one is asleep, his body moves; when awake, he gives rise to mind; and when one comes out of the womb, he produces impurity.",
        "source": "T22n1421_002:0010c22_29"
    },
    {
        "source_sentence": "眠時發心，覺時身不動，出不淨，不犯。",
        "translation": "When he's asleep, he arouses his mind, doesn't move his body when he awakens, and produces impurity that isn't a violation.",
        "source": "T22n1421_002:0010c22_30"
    },
    {
        "source_sentence": "沙彌，突吉羅(一戒竟)。",
        "translation": "Śrāmaṇer, a tukhila (after the completion of one precept).",
        "source": "T22n1421_002:0010c23_31"
    },
    {
        "source_sentence": "佛在舍衛城。",
        "translation": "The Buddha was in Śrāvastī.",
        "source": "T22n1421_002:0010c25_0"
    },
    {
        "source_sentence": "爾時長老優陀夷為欲火所燒，作是念：「故出不淨，世尊已制，今當方便與女人相觸，取細滑樂。」",
        "translation": "It was then that the elder Udayana, burned by the fire of desire, thought, That's why he emerged impure; the Bhagavān has disciplined him, so now he'll skillfully touch a woman and take a fine, slippery bliss.",
        "source": "T22n1421_002:0010c25_1"
    },
    {
        "source_sentence": "便掃灑房內，敷好床座，取一小床於露地坐。",
        "translation": "He then swept his room, spread out a good bed and seat, took a small bed, and sat in the open air.",
        "source": "T22n1421_002:0010c27_2"
    },
    {
        "source_sentence": "有諸女人同來遊觀，語優陀夷言：「我等故來欲看房舍。」",
        "translation": "Some women came together to wander around and said to Udayana, We've always come here to look at the dwelling.",
        "source": "T22n1421_002:0010c28_3"
    },
    {
        "source_sentence": "答言：「姊妹！",
        "translation": "He replied, Sister!",
        "source": "T22n1421_002:0010c29_4"
    },
    {
        "source_sentence": "隨意看之。」",
        "translation": "Look at it as you wish.",
        "source": "T22n1421_002:0010c29_5"
    },
    {
        "source_sentence": "便將入房，閉戶開窓，種種摩觸，或捉、或抱、或案、或摩、或舉上、或舉下、或騎、或越。",
        "translation": "He then entered the room, closed the door and opened the window, touching it with various kinds of grasping, embracing it, folding it, moistening it, raising it higher, lowering it, riding it, or passing through it.",
        "source": "T22n1421_002:0011a01_6"
    },
    {
        "source_sentence": "其中喜者，便語之言：「何不正作，徒用此為？」",
        "translation": "The joyful one of them said to him, Why don't you do it correctly and use this as your only thing?",
        "source": "T22n1421_002:0011a02_7"
    },
    {
        "source_sentence": "優陀夷言：「佛不聽我作根本事。」",
        "translation": "Udayana said, The Buddha won't allow me to do the fundamental work.",
        "source": "T22n1421_002:0011a03_8"
    },
    {
        "source_sentence": "其不喜者，便瞋恚言：「本謂此處安隱，而今反成恐怖之地，水中火然，未足為喻。",
        "translation": "Those who weren't delighted then became angry and said, Originally I thought this place was peaceful, but now it's turned into a terrifying place with a fire burning in the water, which isn't enough to be described.",
        "source": "T22n1421_002:0011a04_9"
    },
    {
        "source_sentence": "白衣在家，猶恥此事，云何比丘乃作是惡？」",
        "translation": "A layman at home is still ashamed of this, so why would a monk do such a bad thing?",
        "source": "T22n1421_002:0011a06_10"
    },
    {
        "source_sentence": "即歸其家，人人宣語。",
        "translation": "He immediately returned home and told the story to everyone in his house.",
        "source": "T22n1421_002:0011a07_11"
    },
    {
        "source_sentence": "諸不信樂佛法者，種種呵罵，言：「我等白衣摩觸女身，沙門釋子亦復如是。",
        "translation": "Those who didn't believe in the Buddha's teaching and variously disparaged them, saying, We white-robed monks touched the woman's body, and so did the ascetics and Śākyamunis.",
        "source": "T22n1421_002:0011a07_12"
    },
    {
        "source_sentence": "徒剃此頭，與我何異？",
        "translation": "What's the difference between shaving this head in vain and me?",
        "source": "T22n1421_002:0011a09_13"
    },
    {
        "source_sentence": "無沙門行，破沙門法！」",
        "translation": "If there's no ascetic practice, it destroys the ascetic teaching!",
        "source": "T22n1421_002:0011a09_14"
    },
    {
        "source_sentence": "如是，惡名流布天下。",
        "translation": "Thus, bad reputation spreads throughout the world.",
        "source": "T22n1421_002:0011a10_15"
    },
    {
        "source_sentence": "復有一婆羅門將婦遊觀，次到優陀夷房語言：「我欲與婦同看房舍。」",
        "translation": "Another Brāhmaṇa led his wife on a pleasure trip and went to the room in Udayana's quarters, saying, I want to go with my wife to look after the dwelling.",
        "source": "T22n1421_002:0011a10_16"
    },
    {
        "source_sentence": "優陀夷言：「不得一時，可前後入。」",
        "translation": "Udayana said, You can't enter at one time; you can enter before or after.",
        "source": "T22n1421_002:0011a12_17"
    },
    {
        "source_sentence": "婆羅門言：「若不得俱，聽婦先入。」",
        "translation": "The Brāhmaṇa said, If you can't join them, listen to the woman before she enters.",
        "source": "T22n1421_002:0011a13_0"
    },
    {
        "source_sentence": "婦既入房，優陀夷亦復如前，種種摩觸，久久乃出。",
        "translation": "When the woman entered the room, Udāyin did as before, touching her in various ways for a long time and then leaving.",
        "source": "T22n1421_002:0011a13_1"
    },
    {
        "source_sentence": "夫語婦言：「何以乃久，不復欲看餘房舍耶？」",
        "translation": "The husband said to the woman, Why is it so long ago that you don't want to look at the other dwelling?",
        "source": "T22n1421_002:0011a14_2"
    },
    {
        "source_sentence": "婦言：「止，止！",
        "translation": "The woman said, Stop, stop!",
        "source": "T22n1421_002:0011a15_3"
    },
    {
        "source_sentence": "莫作是語。",
        "translation": "Don't say that.",
        "source": "T22n1421_002:0011a16_4"
    },
    {
        "source_sentence": "但入一房，垂死得出。",
        "translation": "He simply entered one room and escaped by dying.",
        "source": "T22n1421_002:0011a16_5"
    },
    {
        "source_sentence": "何應復看諸餘房舍？」",
        "translation": "Why should you look at the other dwellings?",
        "source": "T22n1421_002:0011a16_6"
    },
    {
        "source_sentence": "夫問所以，婦具以答。",
        "translation": "The husband asked why, and the woman answered with an answer.",
        "source": "T22n1421_002:0011a17_7"
    },
    {
        "source_sentence": "時婆羅門即便罵言：「沙門釋子，云何乃作如此惡業？」",
        "translation": "The Brāhmaṇa then even scolded him, saying, How did the ascetic or Śākyamuni do such bad actions?",
        "source": "T22n1421_002:0011a17_8"
    },
    {
        "source_sentence": "入舍衛城，四衢道中、街巷、市里，處處唱言：「沙門釋子摩觸我婦。」",
        "translation": "He entered the city of Śrāvastī, and in the four thoroughfares, streets, lanes, and markets, he called out everywhere, The ascetic or Śākyamuni touches my wife.",
        "source": "T22n1421_002:0011a18_9"
    },
    {
        "source_sentence": "諸不信佛法者，種種呵罵：「沙門釋子行惡如此，云何自稱淨修梵行？」",
        "translation": "Those who didn't believe in the Buddha's teachings were variously rebuked, saying, Such is the way an ascetic or a prince commits evil, so how can he claim to be pursuing the religious practice?",
        "source": "T22n1421_002:0011a20_10"
    },
    {
        "source_sentence": "諸長老比丘聞，種種呵責，具以白佛。",
        "translation": "When the elder monks heard this, they were variously rebuked and reported it to the Buddha.",
        "source": "T22n1421_002:0011a21_11"
    },
    {
        "source_sentence": "佛以是事集比丘僧，問優陀夷：「汝實爾不？」",
        "translation": "Because of this, the Buddha gathered the monks and asked Udayana, Is that true?",
        "source": "T22n1421_002:0011a22_12"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0011a23_13"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0011a23_14"
    },
    {
        "source_sentence": "佛種種呵責已，告諸比丘：「以十利故，與諸比丘結戒，從今是戒應如是說：「若比丘，欲盛變心，觸女人身。",
        "translation": "After the Buddha had rebuked them in various ways, he told the monks, For the sake of the ten benefits, he bound the precepts to the monks, and from now on these precepts should be explained like this: Suppose a monk desires to change his mind and touches a woman's body.",
        "source": "T22n1421_002:0011a23_15"
    },
    {
        "source_sentence": "若捉手、若捉髮、若捉一一身分，摩著細滑，僧伽婆尸沙。」",
        "translation": "If you grasp the hand, grasp it, or grasp one part of your body, and rub it on a fine, slippery surface, it's called saṃghâvaśeṣa.",
        "source": "T22n1421_002:0011a26_16"
    },
    {
        "source_sentence": "欲盛變心者：向欲心，深發心，事幾成；",
        "translation": "“The awarenesses of sexual passion are dominant”: When proceeding toward awarenesses relating to sexual passion and when deeply engendering awarenesses, how many actual entities are accomplished?",
        "source": "T22n1421_002:0011a28_0"
    },
    {
        "source_sentence": "變善法、無記法，墮不善處。",
        "translation": "They change good qualities and indeterminate qualities and fall into an unwholesome place.",
        "source": "T22n1421_002:0011a28_1"
    },
    {
        "source_sentence": "女人者：人女乃至初生。",
        "translation": "“Women”: People and women up to the first birth.",
        "source": "T22n1421_002:0011a29_2"
    },
    {
        "source_sentence": "觸者：身上處處種種摩觸，乃至一髮。",
        "translation": "touches: various kinds of touch on the body everywhere, up to one.",
        "source": "T22n1421_002:0011a29_3"
    },
    {
        "source_sentence": "比丘五事觸女人，僧伽婆尸沙：女、女想、人女、活女、心染，以親近情摩觸，覺而受；",
        "translation": "When a bhikṣu touches a woman by touching her with five things, he feels [the sensation of] saṃghâvaśeṣa: “woman,” “female perception,” “women,” “living women,” and “defilement of the mind.",
        "source": "T22n1421_002:0011b01_4"
    },
    {
        "source_sentence": "乃至觸髮，亦如是。",
        "translation": "It's likewise with touch.",
        "source": "T22n1421_002:0011b03_5"
    },
    {
        "source_sentence": "五事觸女人，偷羅遮：女、女想、人女、活女、心染，不以親近情摩觸，覺而受；",
        "translation": "When touching a woman with five things, it is a pārājika: women, conceptions of women, human women, living women, and defilement of the mind.",
        "source": "T22n1421_002:0011b03_6"
    },
    {
        "source_sentence": "乃至觸髮，亦如是。",
        "translation": "It's likewise with touch.",
        "source": "T22n1421_002:0011b05_7"
    },
    {
        "source_sentence": "女人觸比丘，亦如是。",
        "translation": "It's likewise when a woman touches a monk.",
        "source": "T22n1421_002:0011b05_8"
    },
    {
        "source_sentence": "五事觸女人不犯：女、女想、人女、活女、心染，不以親近情；",
        "translation": "It is no offense to touch a woman with five things: a woman, the ideation of a woman, human women, living women, and defilement of mind by not being intimate.",
        "source": "T22n1421_002:0011b06_9"
    },
    {
        "source_sentence": "而女人捉比丘，比丘作方便求脫。",
        "translation": "The woman caught the monk, and the monk made an effort to seek liberation.",
        "source": "T22n1421_002:0011b07_10"
    },
    {
        "source_sentence": "雖覺觸，而不受。",
        "translation": "Even though they perceive and touch, they don't experience it.",
        "source": "T22n1421_002:0011b08_11"
    },
    {
        "source_sentence": "乃至觸髮亦如是。",
        "translation": "It's likewise with touch.",
        "source": "T22n1421_002:0011b08_12"
    },
    {
        "source_sentence": "又女，女想、女疑、女無根想、女二根想，觸，僧伽婆尸沙。",
        "translation": "Also, if a woman has conceptions of women, doubts about women, conceptions of women without faculties, and conceptions of women with two faculties touching each other, it's like the sands of Saṃghâvaśeṣa.",
        "source": "T22n1421_002:0011b09_13"
    },
    {
        "source_sentence": "女，男想、女黃門想，觸，偷羅遮。",
        "translation": "The perception of women, the perception of men, the perception of women as yellow gates, and touch are called pārājika.",
        "source": "T22n1421_002:0011b10_14"
    },
    {
        "source_sentence": "男，男想、男疑、男黃門想，觸，突吉羅。",
        "translation": "Men, conceptions of men, thoughts of men, doubts about men, perceptions of men's yellow-mouthed approaches, and tactile sensations are purgatory.",
        "source": "T22n1421_002:0011b11_0"
    },
    {
        "source_sentence": "男，女想、男無根想、男二根想，觸，偷羅遮。",
        "translation": "Men, conceptions of women, conceptions of men without faculties, conceptions of men with two faculties, and sensations are called pārājika when touched.",
        "source": "T22n1421_002:0011b11_1"
    },
    {
        "source_sentence": "黃門亦如是。",
        "translation": "The Yellow Gate is likewise.",
        "source": "T22n1421_002:0011b12_2"
    },
    {
        "source_sentence": "無根，無根想、無根疑、無根二根想、無根女想，觸，僧伽婆尸沙；",
        "translation": "In the absence of faculties, in the absence of ideation of faculties, in the absence of doubt about faculties, in the absence of faculties, in the absence of ideation of faculties as two faculties, and in the absence of ideation of faculties as a woman, when touched, it would be like the sands of Saṃghâvaśeṣa",
        "source": "T22n1421_002:0011b12_3"
    },
    {
        "source_sentence": "無根男想、無根黃門想，觸，偷羅遮。",
        "translation": "The perception of a man without faculties and the perception of a yellow gate without faculties, touching it, is a pārājika.",
        "source": "T22n1421_002:0011b14_4"
    },
    {
        "source_sentence": "二根亦如是。",
        "translation": "So it is with the two faculties.",
        "source": "T22n1421_002:0011b15_0"
    },
    {
        "source_sentence": "比丘與無衣女人相觸，僧伽婆尸沙；",
        "translation": "When a bhikṣu came into contact with an unclothed woman, it was as big as the sands of Saṃghâvaśeṣa.",
        "source": "T22n1421_002:0011b15_1"
    },
    {
        "source_sentence": "與有衣女人相觸，偷羅遮。",
        "translation": "If he touches a woman with robes and women, it's a pārājika.",
        "source": "T22n1421_002:0011b16_2"
    },
    {
        "source_sentence": "女人捉無衣比丘，僧伽婆尸沙；",
        "translation": "The woman caught the monk without robes, Saṃghâvaśeṣa.",
        "source": "T22n1421_002:0011b16_3"
    },
    {
        "source_sentence": "捉有衣比丘，偷羅遮。",
        "translation": "He caught a monk in robes and stole his robe.",
        "source": "T22n1421_002:0011b17_4"
    },
    {
        "source_sentence": "比丘與女人俱有衣，相觸，突吉羅。",
        "translation": "If a monk and woman both have robes and touch each other, it's a grave offense.",
        "source": "T22n1421_002:0011b17_5"
    },
    {
        "source_sentence": "比丘捉女人衣，女人捨衣與比丘，偷羅遮。",
        "translation": "When a monk takes a woman's robe, the woman gives it to the monk with her robe and steals it.",
        "source": "T22n1421_002:0011b18_6"
    },
    {
        "source_sentence": "女人捉比丘衣，比丘不捨衣與女人，突吉羅。",
        "translation": "A woman who takes a monk's robe and doesn't give it to a woman without giving up his robe, that's a grave offense.",
        "source": "T22n1421_002:0011b19_7"
    },
    {
        "source_sentence": "比丘觸死人女、非人女，偷羅遮；",
        "translation": "If a monk touches a dead woman or a woman who is not a woman, he steals the precepts.",
        "source": "T22n1421_002:0011b20_8"
    },
    {
        "source_sentence": "捉畜生女，突吉羅。",
        "translation": "Grasping an animal's daughter, it's a grave offense.",
        "source": "T22n1421_002:0011b21_9"
    },
    {
        "source_sentence": "沙彌突，吉羅。",
        "translation": "Śrāmaṇetu, Kālā.",
        "source": "T22n1421_002:0011b21_10"
    },
    {
        "source_sentence": "佛在舍衛城。",
        "translation": "The Buddha was in Śrāvastī.",
        "source": "T22n1421_002:0011b23_0"
    },
    {
        "source_sentence": "爾時長老優陀夷為欲火所燒，作是念：「故出不淨、觸女人身，世尊已制。",
        "translation": "It was then that the elder Udayana, burned by the fire of desire, thought, That's why he emerged impure and touched a woman's body, which the Bhagavān had restrained.",
        "source": "T22n1421_002:0011b23_1"
    },
    {
        "source_sentence": "今當更作方便向諸女人作麁惡語，取悅欲樂。」",
        "translation": "Now, I'll make another method of speaking crudely and badly to women, taking pleasure in their desires and pleasures.",
        "source": "T22n1421_002:0011b24_2"
    },
    {
        "source_sentence": "復掃灑房於露地坐，女人來觀，將入閉戶，皆如上說。",
        "translation": "Again, she swept the room clean and sat in the open air. When the woman came to look around, she was about to close the door as described above.",
        "source": "T22n1421_002:0011b25_3"
    },
    {
        "source_sentence": "便於房內與女人種種麁惡語，作如是問：「汝手、脚、髀、膊、腰、腹、頸、乳、頭、面、爪、髮、大小便處何似？」",
        "translation": "He then spoke various kinds of crude words to the woman in his room and asked, What's the shape of your hands, feet, thighs, arms, waist, belly, neck, breasts, head, face, nails, and relics?",
        "source": "T22n1421_002:0011b27_4"
    },
    {
        "source_sentence": "復言：「姊妹！",
        "translation": "Again, he said, Sister!",
        "source": "T22n1421_002:0011b29_5"
    },
    {
        "source_sentence": "汝手、脚，乃至大小便處惡。」",
        "translation": "Your hands, feet, and even the places where you urinate are bad.",
        "source": "T22n1421_002:0011b29_6"
    },
    {
        "source_sentence": "又言：「姊妹！",
        "translation": "Again, he said, Sister!",
        "source": "T22n1421_002:0011c01_0"
    },
    {
        "source_sentence": "汝手、脚，乃至大小便處好。」",
        "translation": "Your hands, feet, and even the place where you urinate are good.",
        "source": "T22n1421_002:0011c01_1"
    },
    {
        "source_sentence": "又問：「汝夫近汝時，云何？」",
        "translation": "Again, he asked, What happens when your husband approaches you?",
        "source": "T22n1421_002:0011c01_2"
    },
    {
        "source_sentence": "又教：「汝若隨我意，與汝珍寶。」",
        "translation": "He also taught, If you follow my wishes, I'll give you your treasures.",
        "source": "T22n1421_002:0011c02_3"
    },
    {
        "source_sentence": "又從乞願：「與我從事，一切天神皆證我心。」",
        "translation": "They also begged, Follow me and all the gods and goddesses will realize my mind.",
        "source": "T22n1421_002:0011c03_0"
    },
    {
        "source_sentence": "諸女人聞，喜不喜者，亦如上說。",
        "translation": "The same applies to women who are delighted and not delighted when hearing.",
        "source": "T22n1421_002:0011c03_1"
    },
    {
        "source_sentence": "長老比丘聞，種種呵責，以事白佛。",
        "translation": "When the elder bhikṣu heard this, he was criticized in various ways and reported it to the Buddha.",
        "source": "T22n1421_002:0011c04_2"
    },
    {
        "source_sentence": "佛以是事集比丘僧，問優陀夷：「汝實爾不？」",
        "translation": "Because of this, the Buddha gathered the monks and asked Udayana, Is that true?",
        "source": "T22n1421_002:0011c05_3"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0011c06_4"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0011c06_5"
    },
    {
        "source_sentence": "佛種種呵責已，告諸比丘：「以十利故與諸比丘結戒，從今是戒應如是說：「若比丘，欲盛變心，向女人麁惡語，隨婬欲法說，僧伽婆尸沙。」",
        "translation": "After the Buddha had been rebuked in various ways, he told the monks, For the sake of the ten benefits, I've bound the precepts to the monks, and from now on these precepts should be explained like this: If a monk wants to change his mind and speak harshly to women with anger and bad words, speaking according to the law of sexual desire, Saṃghâvaśeṣa",
        "source": "T22n1421_002:0011c06_6"
    },
    {
        "source_sentence": "是中犯者：毀、譽、乞、願、問、反問、教。",
        "translation": "Here, the offender: disparages, praises, begs, vows, questions, replies, and teaches.",
        "source": "T22n1421_002:0011c10_0"
    },
    {
        "source_sentence": "比丘五事與女人麁惡語：女，女想，人女，活女，心染，以親近情，從毀譽乃至教，彼解者，僧伽婆尸沙；",
        "translation": "A bhikṣu engages in sexual misconduct with a woman for five reasons: (i) because of the desire to be intimate with her, [he or she] disparages others and even teaches them. If they do so, he or she will be sentenced to imprisonment according to the rules laid down by the Sangha.",
        "source": "T22n1421_002:0011c10_1"
    },
    {
        "source_sentence": "不解者，偷羅遮。",
        "translation": "Someone who doesn't understand it is a pārājika.",
        "source": "T22n1421_002:0011c12_2"
    },
    {
        "source_sentence": "毀者：毀呰女人三處，若小、若大、形色惡。",
        "translation": "Disparaging: disparaging women in three places, whether small or large, and with bad appearance.",
        "source": "T22n1421_002:0011c13_3"
    },
    {
        "source_sentence": "譽者：讚歎女人三處不小、不大、形色好。",
        "translation": "He praises the three places where women are not small, not large, and of good appearance.",
        "source": "T22n1421_002:0011c14_4"
    },
    {
        "source_sentence": "乞者：從女人乞三處：「若能與我，我能隨汝意。」",
        "translation": "The beggar: From the woman, he asks three things, If you can give it to me, I'll follow your wishes.",
        "source": "T22n1421_002:0011c15_0"
    },
    {
        "source_sentence": "願者：「願得汝三處，得汝三處是福樂人。」",
        "translation": "The vow: May you attain your three places, and obtaining your three places is a person of merit and happiness.",
        "source": "T22n1421_002:0011c16_0"
    },
    {
        "source_sentence": "問者：問：「汝夫於三處中幾種行欲？",
        "translation": "Question: Q: How many kinds of sexual desire do you have in the three places?",
        "source": "T22n1421_002:0011c16_1"
    },
    {
        "source_sentence": "幾時作？」",
        "translation": "How long will it be done?",
        "source": "T22n1421_002:0011c17_2"
    },
    {
        "source_sentence": "反問者：問：「汝夫於三處中不如是作耶？」",
        "translation": "The counter-questioner asks, Q: Isn't this what you do in three places?",
        "source": "T22n1421_002:0011c17_3"
    },
    {
        "source_sentence": "教者：教言：「汝以三處隨男子意，則為男子之所敬愛。」",
        "translation": "The teacher: He teaches, saying, Follow the men's wishes in three places, and they'll be respected by men.",
        "source": "T22n1421_002:0011c18_4"
    },
    {
        "source_sentence": "女、女想，乃至二根、二根想，皆如上說。",
        "translation": "The perception of women, the perception of women, and even the perception of the two faculties and two faculties are all explained above.",
        "source": "T22n1421_002:0011c19_5"
    },
    {
        "source_sentence": "又有五種：遣使、書、作相、動手、相似語。",
        "translation": "Again, there are five kinds: sending an envoy, writing, making a mark, moving your hand, and similar words.",
        "source": "T22n1421_002:0011c20_6"
    },
    {
        "source_sentence": "彼解者，偷羅遮；",
        "translation": "Understanding is a pārājika.",
        "source": "T22n1421_002:0011c21_7"
    },
    {
        "source_sentence": "不解者，突吉羅。",
        "translation": "Someone who doesn't understand it is a tukhila.",
        "source": "T22n1421_002:0011c21_8"
    },
    {
        "source_sentence": "比丘面與人女麁惡語，解者，僧伽婆尸沙；",
        "translation": "If a bhikṣu lies face-to-face with a woman who has sexual misconduct and speaks harshly to her, and if he understands this, it will be as many as the sands of Saṃghabhisheṣa.",
        "source": "T22n1421_002:0011c22_9"
    },
    {
        "source_sentence": "不解者，偷羅遮。",
        "translation": "Someone who doesn't understand it is a pārājika.",
        "source": "T22n1421_002:0011c23_10"
    },
    {
        "source_sentence": "向非人女麁惡語，偷羅遮；",
        "translation": "To speak harshly to a woman who is not a human being is a pārājika.",
        "source": "T22n1421_002:0011c23_11"
    },
    {
        "source_sentence": "向畜生女麁惡語，突吉羅。",
        "translation": "It's a grave offense to speak harshly to an animal-born woman.",
        "source": "T22n1421_002:0011c24_12"
    },
    {
        "source_sentence": "沙彌，突吉羅(三戒竟)。",
        "translation": "Śrāmaṇer, pratyekabuddha (after the three precepts).",
        "source": "T22n1421_002:0011c24_13"
    },
    {
        "source_sentence": "佛在舍衛城。",
        "translation": "The Buddha was in Śrāvastī.",
        "source": "T22n1421_002:0011c26_0"
    },
    {
        "source_sentence": "爾時長老優陀夷為欲火所燒，作是念：「故出不淨、摩觸女身、向女人麁惡語，佛皆已制。",
        "translation": "At the time, the elder Udayana was burned by the fire of desire and thought, That's why he left out impure, touched a woman's body, and spoke harshly to women, and the Buddha had restrained them all.",
        "source": "T22n1421_002:0011c26_1"
    },
    {
        "source_sentence": "我今當向女人自讚供養身，取悅意樂。」",
        "translation": "Now, I will praise myself to the woman for making offerings to my body and take pleasure in it.",
        "source": "T22n1421_002:0011c28_2"
    },
    {
        "source_sentence": "又掃灑房種種如上。",
        "translation": "He also sweeps and sprinkles the room in various ways as above.",
        "source": "T22n1421_002:0011c29_3"
    },
    {
        "source_sentence": "便於房內語女人言：「姊妹！",
        "translation": "He then said to the woman inside his room, Sister!",
        "source": "T22n1421_002:0011c29_4"
    },
    {
        "source_sentence": "汝供養沙門、婆羅門，乃至入禪定、得四道果，不如以婬欲供養持戒者。」",
        "translation": "You should make offerings to ascetics and priests, even if you enter meditation and attain the fruit of the four paths, aren't as good as making offerings to those who observe precepts with sexual desire.",
        "source": "T22n1421_002:0012a01_5"
    },
    {
        "source_sentence": "諸女人聞，有喜不喜，乃至佛種種呵責，皆如上說。",
        "translation": "When the women heard this, they were both delighted and displeased, and even the Buddha's various criticisms were as explained above.",
        "source": "T22n1421_002:0012a02_6"
    },
    {
        "source_sentence": "呵責已告諸比丘：「以十利故，為諸比丘結戒，從今是戒應如是說：「若比丘，欲盛變心，向女人自讚供養身，言：『姊妹！",
        "translation": "After he had reprimanded them, he told the monks, For the sake of the ten benefits, he formed the precepts for the monks, and from now on these precepts should be explained in this way: Suppose a monk wants to change his mind and praises himself as an offering to a woman's body, saying, 'Sister!",
        "source": "T22n1421_002:0012a03_7"
    },
    {
        "source_sentence": "婬欲供養是第一供養。』",
        "translation": "The offering of sexual desire is the first offering.'",
        "source": "T22n1421_002:0012a06_8"
    },
    {
        "source_sentence": "僧伽婆尸沙。」",
        "translation": "Saṃghâvaśeṣa.",
        "source": "T22n1421_002:0012a06_9"
    },
    {
        "source_sentence": "若作種種語讚欲供養身，語語突吉羅；",
        "translation": "If someone praises the body in various ways and wants to make offerings to it, they speak words or phrases as a grave offense.",
        "source": "T22n1421_002:0012a08_0"
    },
    {
        "source_sentence": "若言：「不如以婬欲供養。」",
        "translation": "If he says, It's not as good as making offerings with sexual desire.",
        "source": "T22n1421_002:0012a08_1"
    },
    {
        "source_sentence": "語語偷羅遮；",
        "translation": "(Skt. pārāṣṭrapāla) is speech and speech.",
        "source": "T22n1421_002:0012a09_2"
    },
    {
        "source_sentence": "若言：「婬欲供養是第一供養。」",
        "translation": "Suppose someone says, The offering of sexual desire is the first offering.",
        "source": "T22n1421_002:0012a09_3"
    },
    {
        "source_sentence": "僧伽婆尸沙。",
        "translation": "It's the sand of Saṃghâvaśeṣa.",
        "source": "T22n1421_002:0012a10_4"
    },
    {
        "source_sentence": "以五事自讚供養身：女、女想、人女、活女、心染，以親近情，言：「婬欲供養是第一供養。」",
        "translation": "They praise themselves for five things to make offerings to their bodies: women, conceptions of women, human women, living women, and mental defilement, and because they're intimate with feelings, they say, The offering of sexual desire is the first offering.",
        "source": "T22n1421_002:0012a10_5"
    },
    {
        "source_sentence": "解者，僧伽婆尸沙；",
        "translation": "Understanding is the sand of saṃghâvaśeṣa.",
        "source": "T22n1421_002:0012a12_6"
    },
    {
        "source_sentence": "不解者，偷羅遮。",
        "translation": "Someone who doesn't understand it is a pārājika.",
        "source": "T22n1421_002:0012a12_7"
    },
    {
        "source_sentence": "女、女想乃至二根、二根想，遣使，乃至相似語，面與女語，向非人女、畜生女，皆如上說。",
        "translation": "The perception of women, the perception of women up to the perception of two faculties and two faculties, the dismissal of messengers, even similar speech, face-to-face talk with women, and speaking to non-human or animal women are all as explained above.",
        "source": "T22n1421_002:0012a13_8"
    },
    {
        "source_sentence": "沙彌突吉羅(四戒竟)。",
        "translation": "Śāriputra (after the completion of the four precepts).",
        "source": "T22n1421_002:0012a15_9"
    },
    {
        "source_sentence": "佛在舍衛城。",
        "translation": "The Buddha was in Śrāvastī.",
        "source": "T22n1421_002:0012a16_0"
    },
    {
        "source_sentence": "爾時有長者名迦留，聰明利根，善斷人疑，舍衛城人凡有所作，乃至婚姻無不諮問，言與，便與；",
        "translation": "At that time there was an elder named Kālôdayin, a man of sharp intellect and keen faculties who had cut off doubts in the minds of others. The people of Sāvatthī gave whatever they wished to him as soon as they were married.",
        "source": "T22n1421_002:0012a16_1"
    },
    {
        "source_sentence": "不與，便不與。",
        "translation": "If you don't give it, then you won't give it.",
        "source": "T22n1421_002:0012a18_2"
    },
    {
        "source_sentence": "得好者言：「由迦留故我得是好，當使迦留亦得是樂。」",
        "translation": "Those who attain goodness say, Because of Kālôdayin, I'll attain this goodness, so that Kālôdayin will also attain this happiness.",
        "source": "T22n1421_002:0012a18_3"
    },
    {
        "source_sentence": "得惡者言：「由迦留故我得是惡，亦使迦留受是苦劇。」",
        "translation": "Those who attain evil say, It's because of Kālôdayin that I attain this evil, and it causes Kālôdayin to experience this painful suffering.",
        "source": "T22n1421_002:0012a19_4"
    },
    {
        "source_sentence": "如是醜名、善譽充塞一國。",
        "translation": "Thus, such ugly names and good reputation fill one country.",
        "source": "T22n1421_002:0012a21_5"
    },
    {
        "source_sentence": "迦留後時以信出家，諸諮問者日月更甚，乃至波斯匿王亦自親詣諮問國事，喜怒之聲轉倍於前。",
        "translation": "At a later time Kālôdayin renounced the householder’s life because he believed in Buddhism. The number of those who asked questions increased day by day, and King Prasenajit also approached them to enquire about state affairs with his own mind. The sound of joy and anger grew even faster than before.",
        "source": "T22n1421_002:0012a21_6"
    },
    {
        "source_sentence": "時有寡婦，其女色貌邑里第一，求婚者眾，皆不許之，答言：「若就我居如子法者，乃當相與。」",
        "translation": "A widow then had a woman whose appearance was the best in the township, and all those who asked to marry her wouldn't allow her, but they replied, If you live with me as my child, I'll give her to you.",
        "source": "T22n1421_002:0012a23_7"
    },
    {
        "source_sentence": "時有婆羅門，財富無量，語寡婦言：「與我兒婚，汝女可得長處安樂。」",
        "translation": "A Brāhmaṇa of immeasurable wealth then said to the widow, Marry me to my child, and your daughter will be able to live a long life in comfort.",
        "source": "T22n1421_002:0012a25_8"
    },
    {
        "source_sentence": "答亦如初。",
        "translation": "The answer is the same as the first.",
        "source": "T22n1421_002:0012a27_9"
    },
    {
        "source_sentence": "於是婆羅門便訪眾人，誰數來往此人家者。",
        "translation": "The Brāhmaṇa then asked the crowd, Who came and went frequently to this house?",
        "source": "T22n1421_002:0012a27_10"
    },
    {
        "source_sentence": "有人語言：「沙門迦留與此家數。」",
        "translation": "Someone said, The ascetic Kālôdayin and this family are numbered.",
        "source": "T22n1421_002:0012a28_11"
    },
    {
        "source_sentence": "即請迦留長供養之，既相狎習，便以事白：「我欲為兒求某甲女，願屈大德為我語之。」",
        "translation": "He then invited Kālôdayin to make offerings to him for a long time, and after they had gotten intimate with each other, he told them about his affairs, I want to ask a certain woman for my child, and I'd like to speak to her for me.",
        "source": "T22n1421_002:0012a29_12"
    },
    {
        "source_sentence": "迦留便著衣持鉢，往到彼舍，寡婦即出，禮拜問訊。",
        "translation": "Kālôdayin then put on his robes, took his bowl, and went to that house. The widow came out of the house to pay her respects and greetings.",
        "source": "T22n1421_002:0012b02_13"
    },
    {
        "source_sentence": "迦留語言：「汝可以女與某甲婚，其家饒富，必得安樂。」",
        "translation": "Kālôdayin said, You can marry a certain woman to that man, and his family will surely be prosperous and at ease.",
        "source": "T22n1421_002:0012b03_14"
    },
    {
        "source_sentence": "答由如初。",
        "translation": "Answer: It's because it's like the first.",
        "source": "T22n1421_002:0012b04_15"
    },
    {
        "source_sentence": "迦留復言：「若不與者，此女後大，必當委叛。",
        "translation": "Kālôdayin again said, If you don't give it to her, this woman will surely be betrayed when she grows old.",
        "source": "T22n1421_002:0012b04_16"
    },
    {
        "source_sentence": "何為失女，又去好婿？」",
        "translation": "Why did you lose your daughter and leave the good son-in-law?",
        "source": "T22n1421_002:0012b05_17"
    },
    {
        "source_sentence": "寡婦聞此，僶俛從許。",
        "translation": "When the widow heard this, she gave her permission.",
        "source": "T22n1421_002:0012b06_18"
    },
    {
        "source_sentence": "迦留還報，即便成婚。",
        "translation": "Kālôdayin returned as a reward and they were even married.",
        "source": "T22n1421_002:0012b06_19"
    },
    {
        "source_sentence": "其後夫家遇婦甚苦，遣信白母：「願語夫家，小得閑樂。」",
        "translation": "Later, his husband's family met with a woman who was so painful that he sent a letter to his mother, saying, May you tell your husband's family that you'll be able to have a little peace and happiness.",
        "source": "T22n1421_002:0012b07_20"
    },
    {
        "source_sentence": "母報女言：「須迦留來，當使語之。」",
        "translation": "The mother replied to the woman, Suppose Kālôdayin comes, and I'll tell him.",
        "source": "T22n1421_002:0012b08_21"
    },
    {
        "source_sentence": "迦留後日到寡婦家，寡婦具白女之辛苦：「婚本相由，願為語之。」",
        "translation": "On the day after Kālôdayin arrived at the house of a widow, the widow explained the hardships of her daughter's marriage, saying, I wish to speak for her.",
        "source": "T22n1421_002:0012b09_0"
    },
    {
        "source_sentence": "迦留答言：「此女無福，致此苦劇。",
        "translation": "Kālôdayin replied, This woman has no blessedness and caused this kind of suffering.",
        "source": "T22n1421_002:0012b10_1"
    },
    {
        "source_sentence": "若有福者，何緣至此？",
        "translation": "If there is merit, why does it come here?",
        "source": "T22n1421_002:0012b11_2"
    },
    {
        "source_sentence": "我沙門法，不應知人此世俗事。」",
        "translation": "I, as an ascetic, shouldn't know people here worldly affairs.",
        "source": "T22n1421_002:0012b11_3"
    },
    {
        "source_sentence": "寡婦罵言：「先知人事，今云不應。",
        "translation": "The widow abused her, saying, “I knew the people before but now I say it should not be done.",
        "source": "T22n1421_002:0012b12_4"
    },
    {
        "source_sentence": "如此惡人終令不吉！」",
        "translation": "Such a bad person will never be fortunate!",
        "source": "T22n1421_002:0012b13_0"
    },
    {
        "source_sentence": "種種呪罵，言辭苦切。",
        "translation": "Various kinds of incantations and harsh words are painful.",
        "source": "T22n1421_002:0012b13_1"
    },
    {
        "source_sentence": "隣人聞之，咸來諫言：「汝女薄相，致此苦劇。",
        "translation": "When the neighbors heard this, they all came to admonish her, saying, “Your daughter’s weak appearance has caused this kind of suffering.",
        "source": "T22n1421_002:0012b13_2"
    },
    {
        "source_sentence": "何豫沙門，而苦呪罵？」",
        "translation": "Why did you prepare the ascetic and curse him with a painful spell?",
        "source": "T22n1421_002:0012b14_3"
    },
    {
        "source_sentence": "寡婦答言：「汝豈不知，由此沙門使我稚女致此苦劇。」",
        "translation": "The widow replied, Don't you know that this ascetic causes my young daughter to cause this kind of suffering?",
        "source": "T22n1421_002:0012b15_4"
    },
    {
        "source_sentence": "時不信樂佛法者，皆作是言：「汝信沙門，女受此苦。",
        "translation": "Those who didn't believe in the Buddha's teaching all said, Believe this, as a śramaṇa, that a woman is subject to this kind of suffering.",
        "source": "T22n1421_002:0012b16_5"
    },
    {
        "source_sentence": "若復用其語，方當劇是。」",
        "translation": "If you use his words again, it'll be a disaster.",
        "source": "T22n1421_002:0012b17_6"
    },
    {
        "source_sentence": "復呵罵言：「我等白衣行媒嫁法，沙門釋子亦復如是。",
        "translation": "Again, he scolded them and said, We white-robed practitioners practice the method of matchless marriage, and so it is with the ascetics and Śākyamunis.",
        "source": "T22n1421_002:0012b18_7"
    },
    {
        "source_sentence": "徒剃此頭，著壞色衣！",
        "translation": "Why don't you shave this head and put on a broken colored robe!",
        "source": "T22n1421_002:0012b19_8"
    },
    {
        "source_sentence": "所行如此，與我何異？」",
        "translation": "What's the difference between what you do like this and me?",
        "source": "T22n1421_002:0012b19_9"
    },
    {
        "source_sentence": "於是惡名流布遠近。",
        "translation": "That's when bad reputation spread far and near.",
        "source": "T22n1421_002:0012b20_10"
    },
    {
        "source_sentence": "諸長老比丘聞，種種呵責，將至佛所，以事白佛。",
        "translation": "When the elder monks heard this, they were variously rebuked and led to the Buddha's presence, where they reported the matter to him.",
        "source": "T22n1421_002:0012b20_11"
    },
    {
        "source_sentence": "佛以是事集比丘僧，問迦留：「汝實爾不？」",
        "translation": "Because of this, the Buddha gathered the monks and asked Kālôdayin, Is that true?",
        "source": "T22n1421_002:0012b21_12"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0012b22_13"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0012b23_0"
    },
    {
        "source_sentence": "佛種種呵責已，告諸比丘：「以十利故為諸比丘結戒，從今是戒應如是說：「若比丘，行媒法，僧伽婆尸沙。」",
        "translation": "After the Buddha had been rebuked in various ways, he told the monks, For the sake of the ten benefits, they formed the precepts for the monks, and from now on these precepts should be explained like this, 'Suppose a monk practices the method of matchmaking, Saṃghâvaśeṣa.'",
        "source": "T22n1421_002:0012b23_1"
    },
    {
        "source_sentence": "爾時舍衛城中諸豪姓，欲得年長童女共行私通；",
        "translation": "It was then that the wealthy families in Sāvatthī wished to have young girls who shared their private affairs.",
        "source": "T22n1421_002:0012b26_0"
    },
    {
        "source_sentence": "恥自宣意，因無行人，便語六群比丘：「汝可為我宣此意旨。",
        "translation": "Because there were no practitioners, he said to the six groups of monks, You may proclaim this intention for me.",
        "source": "T22n1421_002:0012b27_1"
    },
    {
        "source_sentence": "若須物者，一日一宿乃至一會，為須幾許？」",
        "translation": "If you need things, how much do you need them for a day, a night, or even an assembly?",
        "source": "T22n1421_002:0012b28_2"
    },
    {
        "source_sentence": "六群比丘即詣諸女，具以意問。",
        "translation": "The six groups of monks then went to the women and asked questions with their minds.",
        "source": "T22n1421_002:0012b29_3"
    },
    {
        "source_sentence": "有人見之，皆共譏論：「沙門釋子淨修梵行，而今云何行此惡業？",
        "translation": "Some people saw him and criticized him, saying, “The śramaṇas and brāhmaṇas cultivate the pure practice of austerity but how can they now commit such evil deeds?",
        "source": "T22n1421_002:0012c01_4"
    },
    {
        "source_sentence": "搆合邪非，白衣所恥！",
        "translation": "It's shameful for the white robes who combine what's wrong with what's wrong!",
        "source": "T22n1421_002:0012c02_5"
    },
    {
        "source_sentence": "此諸沙門無有慚愧！」",
        "translation": "These ascetics have no shame!",
        "source": "T22n1421_002:0012c02_6"
    },
    {
        "source_sentence": "諸長老比丘聞，種種呵責，將至佛所，以事白佛。",
        "translation": "When the elder monks heard this, they were variously rebuked and led to the Buddha's presence, where they reported the matter to him.",
        "source": "T22n1421_002:0012c03_7"
    },
    {
        "source_sentence": "佛以是事集比丘僧，問六群比丘：「汝實爾不？」",
        "translation": "Because of this, the Buddha gathered the monks and asked the six groups of monks, Is that true?",
        "source": "T22n1421_002:0012c04_8"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0012c05_9"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0012c05_10"
    },
    {
        "source_sentence": "佛種種呵責已，告諸比丘：「從今是戒應如是說：「若比丘，行媒法，若為私通事，持男意至女邊，持女意至男邊，乃至一交會，僧伽婆尸沙。」",
        "translation": "After the Buddha had been rebuked in various ways, he told the monks, From now on, this is the precept that should be explained in this way: If a monk practices the method of sexual misconduct for private affairs, holding male intentions up to the side of a woman and holding female intentions up to the side of a man, or even one sexual encounter, it's Saṃghâvaśeṣa",
        "source": "T22n1421_002:0012c05_11"
    },
    {
        "source_sentence": "有十種女、十種男。",
        "translation": "There are ten kinds of women and ten kinds of men.",
        "source": "T22n1421_002:0012c09_0"
    },
    {
        "source_sentence": "十種女者：父母所護、兄姊所護、親里所護、自護、法護、自任、衣物、共誓、有主、作信。",
        "translation": "Ten kinds of women: protected by parents, protected by brothers and sisters, protected by relatives, protected by self-protection, protected by the Dharma, protected by self-reliance, protected by clothing, shared vow, with a master, and having faith.",
        "source": "T22n1421_002:0012c09_1"
    },
    {
        "source_sentence": "父母所護者：女有父母，父母能與、能奪。",
        "translation": "Protected by parents: A woman has parents, and their parents can give it to her or take it away.",
        "source": "T22n1421_002:0012c11_2"
    },
    {
        "source_sentence": "兄姊、親里亦如是。",
        "translation": "So it is with the brothers, sisters, and relatives.",
        "source": "T22n1421_002:0012c12_3"
    },
    {
        "source_sentence": "自護者：自得自在，自與、自奪。",
        "translation": "Self-protection: self-acquisition of self-dependence, self-giving and self-grasping.",
        "source": "T22n1421_002:0012c12_4"
    },
    {
        "source_sentence": "法護者：正法出家，修行梵行。",
        "translation": "Dharma protector: A renunciant of the right teaching who cultivates the religious practice.",
        "source": "T22n1421_002:0012c13_5"
    },
    {
        "source_sentence": "自任者：自隨所樂。",
        "translation": "Self-dependence means to follow one's own pleasure.",
        "source": "T22n1421_002:0012c13_6"
    },
    {
        "source_sentence": "衣物者：受他衣物。",
        "translation": "A garment is someone who receives the clothing of others.",
        "source": "T22n1421_002:0012c14_7"
    },
    {
        "source_sentence": "共誓者：與人要誓。",
        "translation": "A common vow is a vow that's made with someone.",
        "source": "T22n1421_002:0012c14_8"
    },
    {
        "source_sentence": "有主者：女人屬夫。",
        "translation": "“There is a master”: Women belong to men.",
        "source": "T22n1421_002:0012c15_9"
    },
    {
        "source_sentence": "作信者：受他片致，要一日、一月，乃至一交會。",
        "translation": "Someone who makes a faith: accepting someone else's piece of money for a day, a month, or even one exchange.",
        "source": "T22n1421_002:0012c15_10"
    },
    {
        "source_sentence": "十種男亦如是。",
        "translation": "So it is with the ten kinds of men.",
        "source": "T22n1421_002:0012c16_11"
    },
    {
        "source_sentence": "若比丘受父母所護男語，突吉羅；",
        "translation": "If a monk receives the words of a man protected by his parents, it is a grave offense.",
        "source": "T22n1421_002:0012c16_12"
    },
    {
        "source_sentence": "語父母所護女乃至作信女，偷羅遮；",
        "translation": "To speak of a woman protected by one’s parents and even become a faithful daughter is a grave offense.",
        "source": "T22n1421_002:0012c17_13"
    },
    {
        "source_sentence": "不許，還報，偷羅遮；",
        "translation": "If you don’t allow it, you will be repaid back as a pārājika.",
        "source": "T22n1421_002:0012c18_14"
    },
    {
        "source_sentence": "許，還報，僧伽婆尸沙。",
        "translation": "He agreed and returned with the reward, Saṃghâvaśeṣa.",
        "source": "T22n1421_002:0012c18_15"
    },
    {
        "source_sentence": "若比丘，受父母所護男語，語父母所護女，女言：「可語我父母。」",
        "translation": "If a monk receives the words of a man guarded by his parents and speaks to the woman guarded by his parents, the woman says, Tell me my parents.",
        "source": "T22n1421_002:0012c19_16"
    },
    {
        "source_sentence": "比丘以此語還報，偷羅遮；",
        "translation": "A monk who returns with these words as a reward is a pārājika.",
        "source": "T22n1421_002:0012c20_17"
    },
    {
        "source_sentence": "父母所護男，又令比丘語彼女父母，受此語，突吉羅；",
        "translation": "A man who is protected by his parents and also causes a monk to tell the woman’s parents what he has said, and receives these words, grave offense.",
        "source": "T22n1421_002:0012c21_18"
    },
    {
        "source_sentence": "語彼女父母及不許，還報，偷羅遮；",
        "translation": "He told the woman’s parents and those who refused to allow him to do so, and when he returned the reward, it was a pārājika.",
        "source": "T22n1421_002:0012c22_19"
    },
    {
        "source_sentence": "許，還報，僧伽婆尸沙。",
        "translation": "He agreed and returned with the reward, Saṃghâvaśeṣa.",
        "source": "T22n1421_002:0012c23_20"
    },
    {
        "source_sentence": "受父母所護男語，語兄姊親里所護女亦如是。",
        "translation": "Accepting the words of a man who's guarded by his parents and speaking to their brothers, sisters, relatives, and women who are guarded by them is likewise.",
        "source": "T22n1421_002:0012c23_21"
    },
    {
        "source_sentence": "乃至受作信男語，語父母所護女乃至語作信女亦如是。",
        "translation": "It's likewise with a faithful man who speaks to a woman guarded by his parents or a faithful woman who speaks.",
        "source": "T22n1421_002:0012c24_22"
    },
    {
        "source_sentence": "若比丘受父母所護女乃至作信女語，語父母所護男乃至語作信男亦如是。",
        "translation": "If a monk receives the words of a woman guarded by his parents or even speaks to a woman who believes, and he speaks to a man guarded by his parents or even speaks to a man who believes, it's likewise.",
        "source": "T22n1421_002:0012c26_23"
    },
    {
        "source_sentence": "有六種語：自、使、書、使使、相似語、相。",
        "translation": "There are six kinds of speech: self, messenger, book, messenger, similar speech and characteristic marks.",
        "source": "T22n1421_002:0012c27_24"
    },
    {
        "source_sentence": "若比丘受自語，自語彼，自還報，僧伽婆尸沙。",
        "translation": "If a monk accepts his own words and tells them to others, and he returns with his own reward, it's Saṃghâvaśeṣa.",
        "source": "T22n1421_002:0012c28_25"
    },
    {
        "source_sentence": "若比丘受自語，使語彼，自還報；",
        "translation": "If a monk receives his own words, an envoy speaks to them and returns the retribution by himself.",
        "source": "T22n1421_002:0012c29_26"
    },
    {
        "source_sentence": "受自語，自語彼，使還報；",
        "translation": "Accepting one’s own words, one tells others and causes them to return the message.",
        "source": "T22n1421_002:0013a01_27"
    },
    {
        "source_sentence": "受自語，使語彼，使還報，皆僧伽婆尸沙。",
        "translation": "They receive their own words, messengers speak to them, and messengers return with their rewards, which are all sands of the saṃghâvaśeṣa.",
        "source": "T22n1421_002:0013a01_28"
    },
    {
        "source_sentence": "受自語，乃至相語彼，相還報亦如是。",
        "translation": "The same applies up to the one who receives self-word or up to what is spoken of by marks and speaking to another: the characteristic marks as retribution.",
        "source": "T22n1421_002:0013a02_29"
    },
    {
        "source_sentence": "若比丘乃至受相語亦如是。",
        "translation": "It's likewise with a monk who receives the words of marks.",
        "source": "T22n1421_002:0013a03_30"
    },
    {
        "source_sentence": "若比丘為人男，人女邊行媒法，僧伽婆尸沙；",
        "translation": "If a bhikṣu behaves like a man or woman accompanied by men and women, the dharma of sexual misconduct is Saṃghâvaśeṣa; if a bhikṣu acts like a man or woman accompanied by men.",
        "source": "T22n1421_002:0013a04_31"
    },
    {
        "source_sentence": "人男，非人女邊行媒法，偷羅遮；",
        "translation": "Men and women who do not practice the law of sexual misconduct at the side of men and women, a pārājika.",
        "source": "T22n1421_002:0013a05_32"
    },
    {
        "source_sentence": "人男，畜生女邊行媒法，突吉羅。",
        "translation": "A human male, an animal female who practices the method of sexual misconduct at the side of a woman, is a tukhila.",
        "source": "T22n1421_002:0013a05_33"
    },
    {
        "source_sentence": "為人女亦如是。",
        "translation": "It's likewise for a human woman.",
        "source": "T22n1421_002:0013a06_34"
    },
    {
        "source_sentence": "為非人男，人女邊行媒法，偷羅遮；",
        "translation": "It is a pārājika to act as an intermediary between men and women who are not men, but practitioners of the law at the side of men and women.",
        "source": "T22n1421_002:0013a06_35"
    },
    {
        "source_sentence": "畜生男，人女邊行媒法，突吉羅。",
        "translation": "An animal that's male, a woman who practices the method of sexual misconduct at the side of humans and women, is a tukhila.",
        "source": "T22n1421_002:0013a07_36"
    },
    {
        "source_sentence": "為人女，黃門邊行媒法，突吉羅。",
        "translation": "Because she's a human woman who practices the method of matching people at the side of the yellow gate, it's a grave offense.",
        "source": "T22n1421_002:0013a08_37"
    },
    {
        "source_sentence": "若比丘，為男借女、為女借男長使，偷羅遮。",
        "translation": "If a monk borrows a woman for a man and borrows a man's long-term messenger for a woman, it's a pārājika.",
        "source": "T22n1421_002:0013a09_38"
    },
    {
        "source_sentence": "比丘尼亦如是。",
        "translation": "So it is with the bhikṣuṇīs.",
        "source": "T22n1421_002:0013a10_39"
    },
    {
        "source_sentence": "式叉摩那、沙彌、沙彌尼，突吉羅。",
        "translation": "Śikṣamāṇā, śrāmaṇerīs, and śrāmaṇerīs are grave offenses.",
        "source": "T22n1421_002:0013a10_40"
    },
    {
        "source_sentence": "不犯者：為和合故(五戒竟)。",
        "translation": "Those who don't violate it: for the sake of harmony (after the end of the five precepts).",
        "source": "T22n1421_002:0013a11_41"
    },
    {
        "source_sentence": "佛在舍衛城。",
        "translation": "The Buddha was in Śrāvastī.",
        "source": "T22n1421_002:0013a12_0"
    },
    {
        "source_sentence": "爾時阿荼髀邑諸比丘自乞作房，從諸居士求車、求車直，求人、求人直，材、木、草、竹，皆從求索。",
        "translation": "At the time, the monks in Ādatta's village begged for a room to build their own dwelling, seeking chariots and carriages directly from the householders, soliciting and soliciting directly, and asking for lumber, wood, wood, grass, and bamboo from all of them.",
        "source": "T22n1421_002:0013a12_1"
    },
    {
        "source_sentence": "居士厭之，見皆逃避。",
        "translation": "The householders disliked them and fled in fear of what they saw.",
        "source": "T22n1421_002:0013a14_2"
    },
    {
        "source_sentence": "諸比丘乞不復能得，便自斫伐草木，掘地取土。",
        "translation": "The monks begged and couldn't get it again, so they cut down the grass and trees on their own plots of land and dug up the earth to obtain dirt.",
        "source": "T22n1421_002:0013a14_3"
    },
    {
        "source_sentence": "有一大德比丘自斫神樹，樹神小兒時戲樹間，斫斷其指。",
        "translation": "There was a great virtuous monk who sat cross-legged at the tree, and when the spirit of the tree was playing among the trees, he cut off his fingers.",
        "source": "T22n1421_002:0013a15_4"
    },
    {
        "source_sentence": "樹神痛惱便興惡意，欲來打之；",
        "translation": "The tree spirit was greatly distressed and thought evil, wanting to strike him.",
        "source": "T22n1421_002:0013a17_5"
    },
    {
        "source_sentence": "復作是念：「此大威德，若我打者，或以之死，使我長夜受諸苦惱。」",
        "translation": "Again, he thought, This is the great and mighty virtue that if I were to beat it, or die because of it, would cause me to suffer pain and suffering for a long time.",
        "source": "T22n1421_002:0013a17_6"
    },
    {
        "source_sentence": "又作是念：「世尊今在此城，當往白之，佛有教勅我當奉行。」",
        "translation": "Again, he thought, Bhagavān, the Bhagavān is here in the city now, so I'll go to tell him, and the Buddha has instructed me to follow it.",
        "source": "T22n1421_002:0013a19_7"
    },
    {
        "source_sentence": "即詣祇桓，具以白佛。",
        "translation": "He went to Jīvaka and told the Buddha in detail.",
        "source": "T22n1421_002:0013a20_8"
    },
    {
        "source_sentence": "爾時世尊讚歎樹神：「善哉，善哉！",
        "translation": "It was then that the Bhagavān praised the tree god, Good, good!",
        "source": "T22n1421_002:0013a21_9"
    },
    {
        "source_sentence": "汝所念善！",
        "translation": "Good, what you think!",
        "source": "T22n1421_002:0013a21_10"
    },
    {
        "source_sentence": "今此比丘實有威德，若當打者，必受苦報。」",
        "translation": "Now, this monk really has authority and virtue, and if he were to beat him, he'd surely experience painful retribution.",
        "source": "T22n1421_002:0013a22_0"
    },
    {
        "source_sentence": "復告樹神：「某處有大樹未有所屬，汝可依之。」",
        "translation": "Again, he told the tree god, There's a large tree somewhere that doesn't have anything to rely on, so you can rely on it.",
        "source": "T22n1421_002:0013a22_1"
    },
    {
        "source_sentence": "受教即往。",
        "translation": "Accepting the teaching, he'll go there.",
        "source": "T22n1421_002:0013a23_2"
    },
    {
        "source_sentence": "於是世尊漸漸遊行到阿荼髀邑。",
        "translation": "The Bhagavān then gradually traveled to the town of Ādaśatru.",
        "source": "T22n1421_002:0013a24_3"
    },
    {
        "source_sentence": "長老大迦葉晨朝著衣持鉢入城乞食，居士見之悉皆逃走；",
        "translation": "The elder Mahākāśyapa entered the city in the morning, wearing his outer robe and with his almsbowl in hand, to beg for food. Seeing him, the householders ran away.",
        "source": "T22n1421_002:0013a24_4"
    },
    {
        "source_sentence": "迦葉怪之，問於行人。",
        "translation": "Kāśyapa wondered about this and asked the practitioner.",
        "source": "T22n1421_002:0013a26_5"
    },
    {
        "source_sentence": "行人答言：「此諸比丘造作房舍，乞求無厭。",
        "translation": "The practitioners replied, These monks built a dwelling and begged for it without tire.",
        "source": "T22n1421_002:0013a26_6"
    },
    {
        "source_sentence": "邑人患苦，所以見仁皆悉逃走。」",
        "translation": "The townspeople are suffering, so they all flee when they see kindness.",
        "source": "T22n1421_002:0013a27_7"
    },
    {
        "source_sentence": "迦葉食後還到佛所以事白佛。",
        "translation": "Kāśyapa returned to the Buddha after he ate, so he told him about this matter.",
        "source": "T22n1421_002:0013a28_8"
    },
    {
        "source_sentence": "佛以是事集比丘僧，問諸比丘：「汝等實爾不？」",
        "translation": "Because of this, the Buddha gathered the monks and asked the monks, Is that true?",
        "source": "T22n1421_002:0013a29_9"
    },
    {
        "source_sentence": "答言：「實爾。",
        "translation": "He replied, Indeed.",
        "source": "T22n1421_002:0013b01_10"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T22n1421_002:0013b01_11"
    },
    {
        "source_sentence": "佛種種呵責：「汝等應修少欲知足，不應多事乞求無厭。」",
        "translation": "The Buddha variously rebuked them, saying, You should cultivate few desires and know enough, and you shouldn't beg for many things without tire.",
        "source": "T22n1421_002:0013b01_12"
    },
    {
        "source_sentence": "又告比丘：「乃過去世，於恒水邊，有一仙人住於石窟。",
        "translation": "Again, he told the monk, In a past life, there was a sage living in a stone cave at the edge of the Ganges River.",
        "source": "T22n1421_002:0013b02_13"
    },
    {
        "source_sentence": "爾時龍王日從水出，以身七匝圍繞仙人，舒頭在上，下向敬視。",
        "translation": "It was then that the dragon king emerged from the water seven times a day, surrounded the sage seven times with his body, spread his head above him, and looked down in respect.",
        "source": "T22n1421_002:0013b04_0"
    },
    {
        "source_sentence": "仙人後時遊行人間，弟子守窟，龍亦如前日來恭敬，弟子怖畏即大羸瘦。",
        "translation": "When the sage later traveled among the people, his disciple guarded the cave and the dragon also came to pay respect to him as before. The disciple was frightened and became very weak.",
        "source": "T22n1421_002:0013b05_1"
    },
    {
        "source_sentence": "我於爾時行菩薩道，遊恒水邊，見其如此即問其故，具答如是。",
        "translation": "At the time, I was practicing the bodhisattva path and traveling to the edge of the Ganges River, and when I saw him like this, I asked him why, and he answered in exactly the same way.",
        "source": "T22n1421_002:0013b07_2"
    },
    {
        "source_sentence": "我復問言：『汝今欲不復見龍耶？』",
        "translation": "Again, I asked, 'Do you want to no longer see the dragon?'",
        "source": "T22n1421_002:0013b08_3"
    },
    {
        "source_sentence": "答言：『爾！』",
        "translation": "He replied, 'Yes!'",
        "source": "T22n1421_002:0013b09_4"
    },
    {
        "source_sentence": "又問：『汝見龍咽下有何等物？』",
        "translation": "Again, he asked, 'Do you see anything under the dragon's throat?'",
        "source": "T22n1421_002:0013b09_5"
    },
    {
        "source_sentence": "答言：『有摩尼珠。』",
        "translation": "He replied, 'There's a maṇi pearl.'",
        "source": "T22n1421_002:0013b10_6"
    },
    {
        "source_sentence": "吾復語言：『龍若來時，汝便合掌向龍作如是語：「我今須汝咽下摩尼。",
        "translation": "Again, I said, 'When the dragon comes, you'll then join your palms and say this to the dragon, Now, I need you to swallow the maṇi.",
        "source": "T22n1421_002:0013b10_7"
    },
    {
        "source_sentence": "願以施我！」』",
        "translation": "May you give it to me!'",
        "source": "T22n1421_002:0013b11_8"
    },
    {
        "source_sentence": "爾時仙人弟子聞我語已，龍從水出，便從索之。",
        "translation": "It was then that the sage disciple heard my words, and the dragon emerged from the water and asked for it.",
        "source": "T22n1421_002:0013b12_9"
    },
    {
        "source_sentence": "龍聞乞珠，不前不却，默然而住。",
        "translation": "When the dragon heard that he begged for the pearl, he didn't advance or retreat, and remained silent.",
        "source": "T22n1421_002:0013b13_10"
    },
    {
        "source_sentence": "「『龍王今須汝，　　咽下摩尼珠，",
        "translation": "'Now, king of dragons, you must swallow the maṇi-pearl.",
        "source": "T22n1421_002:0013b13_11"
    },
    {
        "source_sentence": "　　意甚愛樂之，　　如何默無言？』",
        "translation": "My mind loves them so much, so how can I be silent and not say anything?'",
        "source": "T22n1421_002:0013b13_11"
    },
    {
        "source_sentence": "「『我一切所須，　　皆由此珠得，",
        "translation": "'All my needs are obtained from this pearl,",
        "source": "T22n1421_002:0013b13_11"
    },
    {
        "source_sentence": "　　汝今從吾乞，　　永絕不復來。",
        "translation": "Now, you're begging from me, so never come back.",
        "source": "T22n1421_002:0013b13_11"
    },
    {
        "source_sentence": "　　如火急爆聲，　　使人心恐懼。",
        "translation": "It's like the sound of a fire that quickly blows and causes people to become frightened.",
        "source": "T22n1421_002:0013b13_11"
    },
    {
        "source_sentence": "　　我今聞汝言，　　惶怖踰於是。』」",
        "translation": "Now that I've heard your words, I'm frightened and overweened them.'",
        "source": "T22n1421_002:0013b13_11"
    },
    {
        "source_sentence": "「乞者人不愛，　　數則致怨憎。",
        "translation": "A beggar who doesn't love people and repeatedly causes resentment.",
        "source": "T22n1421_002:0013b13_11"
    },
    {
        "source_sentence": "　龍王聞乞聲，　　一去不復還。」",
        "translation": "When the dragon king heard the sound of begging, he left and didn't return.",
        "source": "T22n1421_002:0013b13_11"
    },
    {
        "source_sentence": "「時仙人弟子，復為龍王說此偈言：「龍即以偈答：於是世尊引古說偈：又告比丘：「龍王受自然業報，猶尚不憙聞於乞聲。",
        "translation": "Again, the disciple of the sage spoke this verse to the dragon king, saying, The dragon answered in verse: The Bhagavān then quoted an an ancient verse that also told the monk, The dragon king is subject to the results of natural karmic retribution, but he still doesn't want to hear the sound of begging.",
        "source": "T22n1421_002:0013b13_11"
    },
    {
        "source_sentence": "今諸居士營求孜孜，困苦所得，汝等云何數數從乞？」",
        "translation": "Now that you householders are seeking diligently and suffering from hunger, how can you repeatedly beg for what you have?",
        "source": "T22n1421_002:0013b26_12"
    },
    {
        "source_sentence": "又告比丘：「吾昔一時在舍衛城，有比丘安居竟，來至我所。",
        "translation": "Again, he said to the bhikṣus: Once, while I was staying at Sāvatthī, a certain monk came to me after his sojourn in Sāvatthī.",
        "source": "T22n1421_002:0013b27_13"
    },
    {
        "source_sentence": "我時問言：『何處安居，安居安隱，乞食易得，道路不疲耶？』",
        "translation": "I then asked, 'Where is your retreat? Is your retreat peaceful, easy to get almsfood, and the path isn't exhausted?'",
        "source": "T22n1421_002:0013b28_14"
    },
    {
        "source_sentence": "彼答我言：『在雪山脇林下安居，安居安隱，乞食易得，行路不疲。",
        "translation": "They replied to me, saying, 'I'm staying at the foot of the snowy mountain in the forest, living peacefully and quietly. It's easy to beg for food, and I won't tire of walking along the path.",
        "source": "T22n1421_002:0013b29_15"
    },
    {
        "source_sentence": "唯患眾鳥夜鳴所亂，不得專一坐禪思惟。』",
        "translation": "It's only because they're disturbed by the birds that sing at night and can't concentrate on a single seat of meditation or contemplation.'",
        "source": "T22n1421_002:0013c02_16"
    },
    {
        "source_sentence": "我問比丘：『汝等今猶樂彼林不？』",
        "translation": "I asked the monks, 'Are you still enjoying that forest now?'",
        "source": "T22n1421_002:0013c03_17"
    },
    {
        "source_sentence": "答言：『甚樂！』",
        "translation": "He replied, 'It's very pleasant!'",
        "source": "T22n1421_002:0013c03_18"
    },
    {
        "source_sentence": "我言：『汝便還彼，眾鳥暮來，合掌向言：「我今須汝毛羽，可以見與。」",
        "translation": "I said, 'Go back there, and the birds came at sunset, joined their palms together, and said, Now that I need your hair and feathers, I can show them to you.'",
        "source": "T22n1421_002:0013c04_19"
    },
    {
        "source_sentence": "中夜、後夜亦復如是。』",
        "translation": "So it is with the middle and latter parts of the night.'",
        "source": "T22n1421_002:0013c05_20"
    },
    {
        "source_sentence": "比丘受教，如勅從乞。",
        "translation": "The monk accepted the teaching and complied with the order to beg.",
        "source": "T22n1421_002:0013c06_0"
    },
    {
        "source_sentence": "於是眾鳥夜共議言：『今此比丘從我等乞，為當與不？』",
        "translation": "The birds then conferred with each other at night, saying, 'Now, will this monk give us what he asks for?'",
        "source": "T22n1421_002:0013c06_1"
    },
    {
        "source_sentence": "皆曰不可，便飛而去，永不復還。」",
        "translation": "They all said no, so they flew away and never returned.",
        "source": "T22n1421_002:0013c07_2"
    },
    {
        "source_sentence": "告諸比丘：「鳥猶不喜聞有乞聲，況於人乎？」",
        "translation": "He told the monks, Still don't birds like to hear sounds of begging, so why wouldn't people?",
        "source": "T22n1421_002:0013c08_3"
    },
    {
        "source_sentence": "又告比丘：「過去世時，有迦夷國王，好憙布施，給諸窮乏。",
        "translation": "Again, he told the monk, In a past life, there was a king of Kāśyapa who liked to give alms and gave it to the poor.",
        "source": "T22n1421_002:0013c09_4"
    },
    {
        "source_sentence": "時有梵志，王甚愛重，未甞從王有所求乞。",
        "translation": "At the time, there was a priest whom the king loved so much that he didn't beg for anything from the king.",
        "source": "T22n1421_002:0013c10_5"
    },
    {
        "source_sentence": "「『人皆從遠來，　　無方從吾乞；",
        "translation": "People come from far and wide, Yet there is no place to ask me for alms.",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "　　而汝今在此，　　不求有何意？』",
        "translation": "What's the point of not seeking what you're here now?'",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "「『乞者人不喜，　　不與致怨憎；",
        "translation": "'The beggar's people aren't happy, and not giving it to them causes resentment.",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "　　所以默無求，　　恐離親愛情。』",
        "translation": "That's why they're silent and don't ask for anything, fearing that they'll part with their affection.'",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "「『智者不惡乞，　　思聞來求聲；",
        "translation": "A wise person who doesn’t beg evil And deliberates on hearing the sound of those who come to ask for it.",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "　　況汝所親愛，　　豈容有悋心！",
        "translation": "How much more so when you're loved by someone who doesn't allow a compassionate mind!",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "　　守貧愧有求，　　應得處不取，",
        "translation": "He guards the poor and wretched with modesty, seeking what should be obtained but not taking it.",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "　　喪人虛心福，　　而自困於己；",
        "translation": "They lose the blessings of their own minds, And find themselves trapped in self-conceit.",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "　　安貧不恥求，　　應得處便取，",
        "translation": "An impoverished and not ashamed to beg, he takes it wherever he can.",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "　　既成人之善，　　而自長安樂。",
        "translation": "Because of the goodness of their adulthood, they'll grow to be comfortable on their own.",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "　　乞非傷德行，　　亦無身口過，",
        "translation": "Begging doesn’t hurt virtuous behavior, Nor is there any fault in body or speech.",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "　　損有以補無，　　何為而不索？』",
        "translation": "What's the reason not to ask for what's lost and what's missing in order to make up for what's lost?'",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "「『賢人不言乞，　　言乞必不賢，",
        "translation": "'Good men don't say begging, and if they say begging, they mustn't be good.",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "　　默然不有求，　　是謂為大人。』",
        "translation": "Being silent and not seeking, this is called a great man.'",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "爾時彼王為說偈言：「梵志即以偈答：「王復說偈：「梵志復以偈答：「時王聞說賢人之偈，心大歡喜，即以牛王一頭，及餘千牛而施與之。」",
        "translation": "It was then that the king spoke a verse for him, saying, The priest answered in verse, The king again spoke a verse, and the priest answered in verse, When the king heard the wise man's verse, he was overjoyed at heart and gave it to him with one head of the king of cattle and a thousand other cows.",
        "source": "T22n1421_002:0013c11_6"
    },
    {
        "source_sentence": "告諸比丘：「王與梵志雖相愛重，猶難有求；",
        "translation": "He said to the monks: Although the king and the brahmins love each other deeply, it is still difficult for them to ask for anything.",
        "source": "T22n1421_002:0014a02_7"
    },
    {
        "source_sentence": "況諸居士，於汝無愛而多求乎？」",
        "translation": "How could it be that you, householders, have no craving and much desire for you?",
        "source": "T22n1421_002:0014a03_8"
    },
    {
        "source_sentence": "又告比丘：「昔有族姓子，名羅吒波羅，父母重愛；",
        "translation": "Again, he said to the bhikṣus: Once there was a clansman named Rāṣṭrapāla, beloved by his parents.",
        "source": "T22n1421_002:0014a04_9"
    },
    {
        "source_sentence": "自以出家，不從父母有所求索。",
        "translation": "He renounced the householder’s life on his own and did not ask for anything from his parents.",
        "source": "T22n1421_002:0014a05_10"
    },
    {
        "source_sentence": "「『人皆從遠來，　　無方從吾乞。",
        "translation": "'The people all come from afar, and there's no place to ask for them from me.",
        "source": "T22n1421_002:0014a06_0"
    },
    {
        "source_sentence": "　　汝親吾愛子，　　不求有何意？』",
        "translation": "You're close to my beloved child, what do you think about not seeking it?'",
        "source": "T22n1421_002:0014a06_0"
    },
    {
        "source_sentence": "「『乞者人不憙，　　不與致怨憎。",
        "translation": "'The beggar doesn't get angry, and he doesn't give it to someone who causes resentment.",
        "source": "T22n1421_002:0014a06_0"
    },
    {
        "source_sentence": "　　我既已出家，　　不應復有求。』",
        "translation": "Since I've left home, I shouldn't have any more to ask for.'",
        "source": "T22n1421_002:0014a06_0"
    },
    {
        "source_sentence": "時父母亦以偈問：「羅吒波羅即以偈答：「諸比丘！",
        "translation": "The parents then also asked in verse, Rāṣṭrapāla answered in verse, Monks!",
        "source": "T22n1421_002:0014a06_0"
    },
    {
        "source_sentence": "羅吒波羅父母愛重，尚以出家不還求索；",
        "translation": "Rāṣṭrapāla’s parents loved him greatly, but he renounced the householder’s life and did not go back to ask for anything.",
        "source": "T22n1421_002:0014a12_1"
    },
    {
        "source_sentence": "況諸居士於汝無親，而多求乎？」",
        "translation": "How could it be that the laymen have no relatives for you and seek so much?",
        "source": "T22n1421_002:0014a13_2"
    },
    {
        "source_sentence": "如是種種呵責已，告諸比丘：「以十利故為諸比丘結戒，從今是戒應如是說：「若比丘，自乞作房，無主，為身，應如量作：長佛十二礫手，廣七礫手。",
        "translation": "After he had been reprimanded in various ways, he told the monks, For the sake of the ten benefits, he formed the precepts for the monks, and from now on these precepts should be explained like this: If a monk asks to build a dwelling for himself with no owner or owner, he should do so for his body as long as twelve pieces of hand-long Buddha's hands and seven",
        "source": "T22n1421_002:0014a13_3"
    },
    {
        "source_sentence": "應將諸比丘求作處，諸比丘應示作處，無難處，有行處。",
        "translation": "You should lead the monks to seek a place to work, and the monks should show them a place to work, a place where there's no difficulty and a place of practice.",
        "source": "T22n1421_002:0014a17_4"
    },
    {
        "source_sentence": "若不將諸比丘求作處，若過量，僧伽婆尸沙。」",
        "translation": "If you don't ask the monks to make a place for them, or if they go beyond measurement, it's sand of Saṃghâvaśeṣa.",
        "source": "T22n1421_002:0014a18_5"
    },
    {
        "source_sentence": "自乞者：比丘為己，從他乞。",
        "translation": "Someone who begs for themselves: A monk asks for his own sake and from others.",
        "source": "T22n1421_002:0014a20_0"
    },
    {
        "source_sentence": "房者：於中可得行、立、坐、臥，行四威儀。",
        "translation": "A room: Here, he can walk, stand, sit, and lie down, and perform the four comportments.",
        "source": "T22n1421_002:0014a20_1"
    },
    {
        "source_sentence": "無主者：無有檀越。",
        "translation": "The absence of an owner means that there's no donor.",
        "source": "T22n1421_002:0014a21_2"
    },
    {
        "source_sentence": "為身者：為己，不為人，亦不為僧。",
        "translation": "For the sake of body: for oneself, not for someone else, and not for the sake of the sangha.",
        "source": "T22n1421_002:0014a21_3"
    },
    {
        "source_sentence": "應將諸比丘求作處者：應將知法、持律比丘，示己作處。",
        "translation": "Those who should lead the monks to seek a place to work: They should lead the monks who know the teachings and observe the precepts to show them a place to work.",
        "source": "T22n1421_002:0014a22_4"
    },
    {
        "source_sentence": "諸比丘應示作處，無難處、有行處者：難處名四衢道中多人聚戲處、婬女處、市肆處、放牧處、師子虎狼惡獸處、嶮岸處、水湯湥處、社樹大樹處、好園田處、墳墓處；",
        "translation": "Venerable friends, the bhikṣus should show them how to do so. There is no difficulty in doing so and there are places where one can go. The difficulty-free place is called a place where many people have gathered to play on the four sides of the road; a place where courtesans live; a marketplace; a herding place; a place where lions, tigers, wolves, and other dangerous animals",
        "source": "T22n1421_002:0014a23_5"
    },
    {
        "source_sentence": "或逼村、或去村遠，道路嶮巇，是名難處。",
        "translation": "It's called a difficult place where the roads are narrow and precipitous, whether it's crowded with villages or far from villages.",
        "source": "T22n1421_002:0014a27_6"
    },
    {
        "source_sentence": "無此諸難是名無難處。",
        "translation": "The absence of these difficulties is called the state of no difficulty.",
        "source": "T22n1421_002:0014a28_7"
    },
    {
        "source_sentence": "有行處者：繞四邊得通車，是名有行處。",
        "translation": "Someone with a place of practice: circumambulating the four sides to obtain a chariot, this is called someone with a place of practice.",
        "source": "T22n1421_002:0014a28_8"
    },
    {
        "source_sentence": "若有上諸難處，無行處者，諸比丘應語彼比丘：「汝莫取是處。」",
        "translation": "If there are difficult places up there and no places of practice, the monks should tell that monk, Don't take this place.",
        "source": "T22n1421_002:0014a29_9"
    },
    {
        "source_sentence": "若無上諸難處，有行處，諸比丘應語是比丘：「汝取是處。」",
        "translation": "If there's an unsurpassed difficult place and a place of practice, the monks should say to that monk, Take this place.",
        "source": "T22n1421_002:0014b02_10"
    },
    {
        "source_sentence": "是比丘應從僧乞示作處，偏袒右肩，脫革屣，[跍*月]跪合掌，作如是言：「大德僧聽！",
        "translation": "That monk should ask the saṃgha to show him a place to work, bare his right shoulder, remove his leather sandals, kneel down with joined palms, and say, Listen, Venerable Saṃgha!",
        "source": "T22n1421_002:0014b03_11"
    },
    {
        "source_sentence": "我某甲比丘自乞作房，無主，為身，今從僧乞示作處。",
        "translation": "I, a certain monk, beg to build a dwelling for myself. Without an owner, I am building it for the sake of my own living quarters.",
        "source": "T22n1421_002:0014b05_12"
    },
    {
        "source_sentence": "願僧現前示我作處！」",
        "translation": "May the saṃgha show me where to work!",
        "source": "T22n1421_002:0014b06_13"
    },
    {
        "source_sentence": "如是三乞。",
        "translation": "These are the three kinds of begging.",
        "source": "T22n1421_002:0014b06_14"
    },
    {
        "source_sentence": "僧中應一人白：「大德僧聽！",
        "translation": "One of the saṃgha should say, Listen, great virtuous monks!",
        "source": "T22n1421_002:0014b06_15"
    },
    {
        "source_sentence": "此某甲比丘自乞作房，無主，為身，從僧乞示作處。",
        "translation": "This certain monk begged the saṃgha to make a dwelling for himself, without an owner; he asked the saṃgha to make a place for him.",
        "source": "T22n1421_002:0014b07_16"
    },
    {
        "source_sentence": "今僧為某甲示作處，無難處、有行處。",
        "translation": "Now, the saṃgha has shown me a place to work for someone, a place where there's no difficulty and a place of practice.",
        "source": "T22n1421_002:0014b08_17"
    },
    {
        "source_sentence": "若僧時到僧忍聽。",
        "translation": "If the saṃgha arrives at the saṃgha's time, the saṃgha will tolerate listening.",
        "source": "T22n1421_002:0014b09_18"
    },
    {
        "source_sentence": "白如是。」",
        "translation": "The white is like this.",
        "source": "T22n1421_002:0014b09_19"
    },
    {
        "source_sentence": "「大德僧聽！",
        "translation": "Venerable monks, listen!",
        "source": "T22n1421_002:0014b10_20"
    },
    {
        "source_sentence": "此某甲比丘自乞作房，無主，為身；",
        "translation": "This certain bhikṣu begged [the Buddha] to make a dwelling for himself, but it had no owner and was only his body.",
        "source": "T22n1421_002:0014b10_21"
    },
    {
        "source_sentence": "從僧乞示作處。",
        "translation": "He begs from the saṃgha to show him where he's done.",
        "source": "T22n1421_002:0014b11_22"
    },
    {
        "source_sentence": "今僧為某甲示作處，無難處、有行處。",
        "translation": "Now, the saṃgha has shown me a place to work for someone, a place where there's no difficulty and a place of practice.",
        "source": "T22n1421_002:0014b11_23"
    },
    {
        "source_sentence": "誰諸長老忍，默然；",
        "translation": "Those elders who tolerated it remained silent.",
        "source": "T22n1421_002:0014b12_24"
    },
    {
        "source_sentence": "不忍者，說。",
        "translation": "Those who can't tolerate it, say.",
        "source": "T22n1421_002:0014b12_25"
    },
    {
        "source_sentence": "僧已為某甲示作處，無難處、有行處竟。",
        "translation": "The saṃgha has shown the place where he's done it for a certain person, which is not a difficult place or a place of practice.",
        "source": "T22n1421_002:0014b12_26"
    },
    {
        "source_sentence": "僧忍，默然故。",
        "translation": "The monks tolerated it because they were silent.",
        "source": "T22n1421_002:0014b13_27"
    },
    {
        "source_sentence": "是事如是持。」",
        "translation": "These things are thus maintained.",
        "source": "T22n1421_002:0014b14_28"
    },
    {
        "source_sentence": "若僧示難處、無行處，僧突吉羅；",
        "translation": "If the samgha indicates a place of difficulty or a place of no-practice, it is a monk’s grave offense.",
        "source": "T22n1421_002:0014b14_29"
    },
    {
        "source_sentence": "若於此處作者，亦如是。",
        "translation": "If the author is here, it's likewise.",
        "source": "T22n1421_002:0014b15_30"
    },
    {
        "source_sentence": "若不將諸比丘示作處，從發心及治地至麁泥，皆突吉羅；",
        "translation": "If you do not show the occupation to the bhikṣus, it will be a grave offense if you go from the place where you have undertaken the aspiration for enlightenment or the place where you are practicing meditation up to the place where you entered nirvana.",
        "source": "T22n1421_002:0014b15_31"
    },
    {
        "source_sentence": "細泥，偷羅遮；",
        "translation": "The fine mud is a pārājika.",
        "source": "T22n1421_002:0014b16_32"
    },
    {
        "source_sentence": "作竟，僧伽婆尸沙。",
        "translation": "After it's done, there's the sand of Saṃghâvaśeṣa.",
        "source": "T22n1421_002:0014b17_33"
    },
    {
        "source_sentence": "雜金銀珍寶作，及完成瓦屋，乃至僧地中作，皆偷羅遮。",
        "translation": "It's made of mixed gold, silver, precious treasures, and finished tile houses, up to those made in the saṃgha ground, are all made of pārājika.",
        "source": "T22n1421_002:0014b17_34"
    },
    {
        "source_sentence": "沙彌，突吉羅(六戒竟)。",
        "translation": "Śrāmaṇer, tukhila (after the completion of the six precepts).",
        "source": "T22n1421_002:0014b18_35"
    },
    {
        "source_sentence": "五分律卷第二",
        "translation": "Five Part Vinaya, Volume 2",
        "source": "T22n1421_002:0014b20_0"
    }
]