[
    {
        "source_sentence": "根本說一切有部毘奈耶皮革事",
        "translation": "Mūlasarvâstivāda-vinaya leather deeds",
        "source": "T23n1447_001:1048c03_0"
    },
    {
        "source_sentence": "卷上",
        "translation": "Shangshou",
        "source": "T23n1447_001:1048c04_0"
    },
    {
        "source_sentence": "大唐三藏義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Jīvaka of the Great Tang",
        "source": "T23n1447_001:1048c06_0"
    },
    {
        "source_sentence": "爾時薄伽梵在室羅筏城逝多林給孤獨園。",
        "translation": "It was then that the Bhagavān stayed at Anāthapiṇḍada Park in Jeta's Grove in Śrāvastī.",
        "source": "T23n1447_001:1048c07_0"
    },
    {
        "source_sentence": "時婆索迦聚落，彼有長者名曰力軍，財如毘沙門天王，娶妻經久一無子息，",
        "translation": "In the village of Vasaka there was an elder named Lijun, whose wealth was like that of Vaiśravaṇa and his wife had been married for a long time but he had no children.",
        "source": "T23n1447_001:1048c08_0"
    },
    {
        "source_sentence": "便生愁念：「我今大富多有珍財，了無子息，一朝身死，以無後嗣，財物沒官。」",
        "translation": "He then became sad and thought, Now that I'm so wealthy and have a lot of treasures and possessions, I don't have any children or heirs, and one day my body dies because there's no successor, and my possessions go to the official.",
        "source": "T23n1447_001:1048c09_1"
    },
    {
        "source_sentence": "親識知聞，咸來慰問：「何故如斯愁惱而住？」",
        "translation": "Knowing what they heard, their relatives and friends all came to comfort them, asking, Why are you staying so sad and distressed?",
        "source": "T23n1447_001:1048c11_2"
    },
    {
        "source_sentence": "答曰：「我無男女，恐身死後財物入官，是故憂耳。」",
        "translation": "He answered, I have no men or women, and I'm afraid that my possessions will enter the officialdom after my death, which is why I'm sad.",
        "source": "T23n1447_001:1048c12_3"
    },
    {
        "source_sentence": "諸親報曰：「應可祈請神祇，當得男女。」",
        "translation": "The relatives replied, You should pray to the gods and goddesses that you'll attain men and women.",
        "source": "T23n1447_001:1048c13_4"
    },
    {
        "source_sentence": "即便答曰：「若如是者，我當求請。」",
        "translation": "He then answered, If that's the case, I will ask for it.",
        "source": "T23n1447_001:1048c14_5"
    },
    {
        "source_sentence": "為求子故，即便祈請大自在天、四大海神、毘沙門天、帝釋、梵王，諸天神等悉皆祈請求其男女，",
        "translation": "For the sake of their children, they prayed to the Maheśvaradeva gods, the four great ocean gods, the Vaiśravaṇa gods, Indra, and Brahmā, and all the other heavenly gods and goddesses begged for their sons and daughters.",
        "source": "T23n1447_001:1048c14_6"
    },
    {
        "source_sentence": "諸園林神、曠野等神、四衢道神、受祭神、同生神、同法神，常隨神等，",
        "translation": "The gods of the parks, forests, wilderness, and so forth, the gods of the four quarters, the gods who receive offerings, the gods who are born together, the gods who share the same principles, the gods who always follow them, and so forth.",
        "source": "T23n1447_001:1048c17_0"
    },
    {
        "source_sentence": "悉皆求之。",
        "translation": "They all asked for it.",
        "source": "T23n1447_001:1048c18_1"
    },
    {
        "source_sentence": "諸人見彼祈請眾神，尚無男女，咸作是言：「若求天神，得男女者，世間諸人，",
        "translation": "The people saw that the gods who prayed to them had neither men nor women. They all said, “If you seek heavenly gods and find a man or woman, everyone in the world will be like this:",
        "source": "T23n1447_001:1048c18_2"
    },
    {
        "source_sentence": "求者皆得，便滿千子，如轉輪王，等無有異。」",
        "translation": "Those who seek it will all attain it and then fill a thousand children, just like the wheel-turning king, without any difference.",
        "source": "T23n1447_001:1048c20_3"
    },
    {
        "source_sentence": "然由三事現前，方有男女。",
        "translation": "But it is only by reason of these three things that a male and a female can be born.",
        "source": "T23n1447_001:1048c21_4"
    },
    {
        "source_sentence": "云何為三？",
        "translation": "What are these three?",
        "source": "T23n1447_001:1048c21_5"
    },
    {
        "source_sentence": "所為父母要有欲心和合一處、母月期至、中有現前，具此諸緣，方有子息。",
        "translation": "It's because the parents must have a place where their desires are harmonious and unified, the mother's moon is due to arrive, and there's an intermediate being present, and it's only when these conditions are present that there's a child who stops.",
        "source": "T23n1447_001:1048c22_6"
    },
    {
        "source_sentence": "然彼長者，為求男女祈請不息。",
        "translation": "Still, that elderly man begged for men and women without stopping to pray.",
        "source": "T23n1447_001:1048c23_7"
    },
    {
        "source_sentence": "後於異時，有一薩埵餘處命終，遂便託娠於長者妻腹。",
        "translation": "Later, at another time, there was a sattva whose life ended elsewhere, so he entrusted the elder's wife and belly to become pregnant.",
        "source": "T23n1447_001:1048c24_8"
    },
    {
        "source_sentence": "有智女人善知五事。",
        "translation": "A wise woman well knows five things.",
        "source": "T23n1447_001:1048c25_9"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T23n1447_001:1048c26_10"
    },
    {
        "source_sentence": "一、知男子有染心無染心；",
        "translation": "The first is that they know men have defiled or undefiled states of mind.",
        "source": "T23n1447_001:1048c26_11"
    },
    {
        "source_sentence": "二、知時知節；",
        "translation": "The second is that they know the time and observe moderation.",
        "source": "T23n1447_001:1048c27_12"
    },
    {
        "source_sentence": "三、知得娠；",
        "translation": "The third is to know that they have become pregnant.",
        "source": "T23n1447_001:1048c27_13"
    },
    {
        "source_sentence": "四、知從彼男得娠；",
        "translation": "The fourth is the knowledge that they have become pregnant from their male offspring.",
        "source": "T23n1447_001:1048c27_14"
    },
    {
        "source_sentence": "五、知是男女，若是男時胎在右邊，女在左邊。",
        "translation": "5. Knowing that this is a man or woman, if it's a man, the womb is on the right side and the woman is on the left side.",
        "source": "T23n1447_001:1048c28_15"
    },
    {
        "source_sentence": "其長者妻既得娠已，生大歡喜，報其夫曰：「賢首！",
        "translation": "When the elder's wife became pregnant, she became very joyful and reported to her husband, Good man!",
        "source": "T23n1447_001:1048c29_16"
    },
    {
        "source_sentence": "仁今知不？",
        "translation": "Do you know it now, sir?",
        "source": "T23n1447_001:1049a01_17"
    },
    {
        "source_sentence": "我已有子，今在右邊，必知是男。」",
        "translation": "I already have a child, and now he's on the right side, who will surely know it's a boy.",
        "source": "T23n1447_001:1049a01_18"
    },
    {
        "source_sentence": "長者聞已，甚大歡喜，便舉右手，仰面而笑，作如是語：「我於多時，",
        "translation": "Having heard these words, the householder was greatly delighted. Hearing them, he raised his right hand, looked up in respect, smiled, and said:",
        "source": "T23n1447_001:1049a02_19"
    },
    {
        "source_sentence": "祈請天神，求覓男女，助我家事，代我劬勞。",
        "translation": "I pray to the gods and goddesses to find men and women who will help me with my household affairs and take care of my daily needs.",
        "source": "T23n1447_001:1049a03_20"
    },
    {
        "source_sentence": "我所不及，當為我作，子孫昌延，得長久住。",
        "translation": "I won't be able to do it for myself, and my descendants will live a long time in Chang'an.",
        "source": "T23n1447_001:1049a04_21"
    },
    {
        "source_sentence": "我若死後，為我追福稱我名字，當願我父生於善處。」",
        "translation": "If I were to claim my name after death and pursue merit for me, you would wish that my father would be born in a good place.",
        "source": "T23n1447_001:1049a05_22"
    },
    {
        "source_sentence": "既知有子，即令安置在高樓上，任情遊戲，寒時進火，熱時招涼，飲食知時，",
        "translation": "Knowing that he had a child, the king ordered him to be housed in a high building and let him play freely. He entered the fire in cold seasons and cooled himself in hot seasons.",
        "source": "T23n1447_001:1049a06_23"
    },
    {
        "source_sentence": "宜食給與。",
        "translation": "It's advisable to give them food.",
        "source": "T23n1447_001:1049a08_24"
    },
    {
        "source_sentence": "六時相順者依時而進，悉皆如法。",
        "translation": "The six seasons are mutually concomitant. They proceed according to the seasons and all do so in accordance with the Dharma.",
        "source": "T23n1447_001:1049a08_25"
    },
    {
        "source_sentence": "嚴身瓔珞，一如天女遊歡喜園，從床至床，從蹬至蹬，足不履地，又亦不令聞惡音聲。",
        "translation": "He adorned his body with a necklace, just like a heavenly maiden traveling to the park of joy, going from bed to bed and from footstool to footstool, not treading on the ground or causing bad sounds to be heard.",
        "source": "T23n1447_001:1049a09_26"
    },
    {
        "source_sentence": "十月滿足，至欲生時，在於聞星下生。",
        "translation": "When the tenth moon is complete, he's born underneath the star of hearing when he wants to be born.",
        "source": "T23n1447_001:1049a11_27"
    },
    {
        "source_sentence": "其子端正，令人樂見，耳上便有寶璫，珠自然而出。",
        "translation": "The prince was so handsome that people would be delighted to see him. On the top of his ears were jeweled bells and pearls, which came out spontaneously.",
        "source": "T23n1447_001:1049a11_28"
    },
    {
        "source_sentence": "其父告左右曰：「汝可喚別寶之人。」",
        "translation": "His father told his attendants, You may call the person who belongs to another treasure.",
        "source": "T23n1447_001:1049a13_0"
    },
    {
        "source_sentence": "既喚來已，告言：「此寶價直幾許？」",
        "translation": "After calling them, he told them, What's the value of this treasure?",
        "source": "T23n1447_001:1049a13_1"
    },
    {
        "source_sentence": "答曰：「無能作價；",
        "translation": "He answered, “There is no one who can make a price.",
        "source": "T23n1447_001:1049a14_2"
    },
    {
        "source_sentence": "常法無價之寶，皆作一俱胝金錢而准。」",
        "translation": "The treasure of the eternal Dharma is priceless, and they'll all make a coin for it.",
        "source": "T23n1447_001:1049a14_3"
    },
    {
        "source_sentence": "是時其子生來，已經三七日，集諸眷屬，建立名號。",
        "translation": "After thirty-seven days had passed since the birth of his son, he gathered his followers and established their names.",
        "source": "T23n1447_001:1049a15_4"
    },
    {
        "source_sentence": "爾時親屬共相議曰：「欲立何名？」",
        "translation": "It was then that the relatives discussed with each other, What name do you want to establish?",
        "source": "T23n1447_001:1049a16_5"
    },
    {
        "source_sentence": "諸親共言：「此是聞星中生，復有寶耳璫珠莊嚴其耳，此寶價直俱胝。",
        "translation": "The relatives all said, “This is the one who was born in the star of hearing. His ears were also adorned with jeweled earrings and pearls; these treasures were worth as much as a koṭi.",
        "source": "T23n1447_001:1049a17_6"
    },
    {
        "source_sentence": "為斯事故。",
        "translation": "It's for this reason.",
        "source": "T23n1447_001:1049a19_7"
    },
    {
        "source_sentence": "孩子可名曰聞俱胝耳。」",
        "translation": "A child can be called a hearer, Kauṇḍinya.",
        "source": "T23n1447_001:1049a19_8"
    },
    {
        "source_sentence": "當生之日，長者家內，婢生二子，一名曰奴，二名擁護。",
        "translation": "On the day he was born, two children were born to the maidservants in the house of the wealthy merchant. One was called a slave and the other was named Upagupta.",
        "source": "T23n1447_001:1049a19_9"
    },
    {
        "source_sentence": "長者即令乳養，置八乳母看之：二常懷抱、二常乳食、二人洗浴、二常共遊戲作樂。",
        "translation": "The elder then ordered the milk to be nurtured, leaving eight nurses to look after it: two always holding it in their arms, two always eating milk, two always bathing, and two always playing together.",
        "source": "T23n1447_001:1049a21_0"
    },
    {
        "source_sentence": "此八嬭母日夜供侍，常以乳酪酥及醍醐勝妙甘美飲食供給，如蓮在水，",
        "translation": "These goddesses were attended day and night by their attendants, who provided them with milk, curds, butter, ghee, and delicious food like lotus blossoms in water.",
        "source": "T23n1447_001:1049a22_1"
    },
    {
        "source_sentence": "速能長大。",
        "translation": "They'll quickly grow in size.",
        "source": "T23n1447_001:1049a24_2"
    },
    {
        "source_sentence": "既長成已，即教學藝，先學文字算數，及知物價，別衣別木，別寶別象，",
        "translation": "Once they had grown up, he taught them the arts and sciences. They first studied grammar, calculation, and mathematics, and knew the value of property. They were dressed in different clothes, made of different materials, and elephant-drawn with different treasures.",
        "source": "T23n1447_001:1049a24_3"
    },
    {
        "source_sentence": "別男別女，如是八種，悉皆明了。",
        "translation": "These eight kinds of men and women are all clearly distinguished.",
        "source": "T23n1447_001:1049a26_4"
    },
    {
        "source_sentence": "其父便為造三種堂室，謂冬、夏、秋。",
        "translation": "His father then built three kinds of halls for him: winter, summer, and autumn.",
        "source": "T23n1447_001:1049a27_0"
    },
    {
        "source_sentence": "復作三種園苑，三種宮殿，上、中、下別。",
        "translation": "Again, there are three kinds of gardens and three kinds of palaces, which are separated by the top, middle, and bottom.",
        "source": "T23n1447_001:1049a27_1"
    },
    {
        "source_sentence": "聞俱胝耳共諸婇女，往詣閣上遊戲。",
        "translation": "I heard that Kauṇḍinya and the other court ladies went up to the pavilion to play.",
        "source": "T23n1447_001:1049a28_2"
    },
    {
        "source_sentence": "力軍長者，所有家事農業耕墾，皆悉自作。",
        "translation": "The wealthy householders with strong armies did all the household chores, such as farming and plowing, they did for themselves.",
        "source": "T23n1447_001:1049a29_3"
    },
    {
        "source_sentence": "其子見父自為農業墾耕之作，告其父曰：「云何躬自執作？」",
        "translation": "Seeing his father doing it for himself, the son told his father, How did you do it yourself?",
        "source": "T23n1447_001:1049b01_4"
    },
    {
        "source_sentence": "長者告曰：「我往亦如汝在閣上遊戲快樂，其樂不久便盡。」",
        "translation": "The elder told him, I'll go there, just as you did when you were playing in the pavilion, and it won't be long before its pleasure ends.",
        "source": "T23n1447_001:1049b02_5"
    },
    {
        "source_sentence": "子白父言：「若如是者，當賜處分，我應入海採寶。」",
        "translation": "The son said to his father, If that's the case, he'll be given a share of the land, and I'll go into the ocean to gather treasure.",
        "source": "T23n1447_001:1049b03_6"
    },
    {
        "source_sentence": "父曰：「如人所食麻米五穀，汝所食寶我亦能辦。",
        "translation": "The father said, “Suppose someone eats the five kinds of rice and millet that are commonly eaten by people.",
        "source": "T23n1447_001:1049b05_0"
    },
    {
        "source_sentence": "我之財物，終不少乏，汝何用入海？」",
        "translation": "My possessions are never in short supply, so why would you need to enter the sea?",
        "source": "T23n1447_001:1049b06_1"
    },
    {
        "source_sentence": "子便三請，復白父言：「願賜處分，放我入海。」",
        "translation": "The son then asked three times, and he said to his father, Please give me a share of the place and let me go into the sea.",
        "source": "T23n1447_001:1049b06_2"
    },
    {
        "source_sentence": "其父不隨所請，子復白言：「許我入海。」",
        "translation": "The father didn't follow what was asked, and the son again said, Allow me to enter the sea.",
        "source": "T23n1447_001:1049b07_3"
    },
    {
        "source_sentence": "父知子意決定不移，即放令去。",
        "translation": "Knowing his son's intention, the father didn't move it, so he released him and told him to leave.",
        "source": "T23n1447_001:1049b08_4"
    },
    {
        "source_sentence": "是時長者於聚落中，搖鈴宣告：「在此居住之人願聞，我子今欲入海採寶。",
        "translation": "The elder then shook his bell in the village and announced, May the people living here hear that my son is about to go into the ocean to gather treasure.",
        "source": "T23n1447_001:1049b09_5"
    },
    {
        "source_sentence": "若有人去者，在路無課，亦不輸脚，及無差科，當自辦財物。」",
        "translation": "If someone leaves, they'll be on the road without a lesson, don't carry their feet, and have no difference in grades, and will manage their own possessions.",
        "source": "T23n1447_001:1049b10_6"
    },
    {
        "source_sentence": "時有五百商人，各辦米糧。",
        "translation": "At that time there were five hundred merchants, each of whom prepared rice and provisions.",
        "source": "T23n1447_001:1049b12_7"
    },
    {
        "source_sentence": "于時婆羅仙長者，請五百商人，家中設食已，告諸商人曰：「如我愛子，",
        "translation": "At that time the holy elder Vārāṇasī invited five hundred merchants to his house. Having prepared a meal, he said to the merchants, “O my beloved children!",
        "source": "T23n1447_001:1049b12_8"
    },
    {
        "source_sentence": "亦如汝子。",
        "translation": "It's like your child.",
        "source": "T23n1447_001:1049b14_9"
    },
    {
        "source_sentence": "若作不善無利益事，當須勸諫，勿令作惡。」",
        "translation": "If you do unwholesome and useless things, you must be advised not to do evil.",
        "source": "T23n1447_001:1049b14_10"
    },
    {
        "source_sentence": "時諸商人，並皆敬諾，又告子曰：「汝聞我語，皆應奉行，若商人有教，",
        "translation": "The merchants all agreed and said to Ziqiao, “If you hear my words, you should follow them.",
        "source": "T23n1447_001:1049b15_11"
    },
    {
        "source_sentence": "亦如我言。",
        "translation": "It's also like what I said.",
        "source": "T23n1447_001:1049b17_12"
    },
    {
        "source_sentence": "莫在前行，亦莫在後。",
        "translation": "Don't go before it, and don't go after it.",
        "source": "T23n1447_001:1049b17_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1447_001:1049b17_14"
    },
    {
        "source_sentence": "或有強賊、或有力弱。",
        "translation": "There may be strong thieves or powerful thieves, or weak thieves.",
        "source": "T23n1447_001:1049b18_0"
    },
    {
        "source_sentence": "其勇健者，在商人前來；",
        "translation": "The brave and strong man came before the merchants.",
        "source": "T23n1447_001:1049b18_1"
    },
    {
        "source_sentence": "然力弱者，從後而來。",
        "translation": "The weak one, however, comes from the latter.",
        "source": "T23n1447_001:1049b19_0"
    },
    {
        "source_sentence": "若商主被損，商眾總損。」",
        "translation": "If the merchant owner is harmed, the merchants are generally harmed.",
        "source": "T23n1447_001:1049b19_1"
    },
    {
        "source_sentence": "子聞其父說此語已，父又喚彼家生二奴：「汝等當聽！",
        "translation": "When the son heard this, his father said these words, and his father again summoned the two slaves who were born in that house, Listen!",
        "source": "T23n1447_001:1049b20_0"
    },
    {
        "source_sentence": "汝之二人，不得一人輒離我子。」",
        "translation": "You two, don't allow one of you to easily leave my child.",
        "source": "T23n1447_001:1049b21_1"
    },
    {
        "source_sentence": "二奴啟曰：「誠如聖言！",
        "translation": "The two slaves asked, Just as the sage said!",
        "source": "T23n1447_001:1049b21_2"
    },
    {
        "source_sentence": "誠如聖言！」",
        "translation": "It's really as the sage says!",
        "source": "T23n1447_001:1049b22_3"
    },
    {
        "source_sentence": "其長者復作思惟：「欲令我子乘騎何乘？",
        "translation": "The elder then again thought, What vehicle do you want my son to ride?",
        "source": "T23n1447_001:1049b22_4"
    },
    {
        "source_sentence": "若與象馬，乘騎費糧。",
        "translation": "If he gives an elephant or horse, he'll ride it and pay for its provisions.",
        "source": "T23n1447_001:1049b23_5"
    },
    {
        "source_sentence": "當與乘驢，而為輕省。」",
        "translation": "You'll give it to the donkey-riding butcher and make light of it.",
        "source": "T23n1447_001:1049b23_6"
    },
    {
        "source_sentence": "作是念已，即辦驢乘發遣，道路所須，具皆悉備。",
        "translation": "After he had this thought, he prepared the donkey's carriage and dismounted it, and all the necessities for the road were provided.",
        "source": "T23n1447_001:1049b24_7"
    },
    {
        "source_sentence": "其長者子往詣母所，白言：「阿母！",
        "translation": "The elder's son went to his mother and said, Mother!",
        "source": "T23n1447_001:1049b25_8"
    },
    {
        "source_sentence": "我今入海採寶。」",
        "translation": "Now, I'll go into the ocean to gather treasure.",
        "source": "T23n1447_001:1049b26_9"
    },
    {
        "source_sentence": "時母聞已，迷悶悲啼，勸不令去，告曰：「何時更得見汝？」",
        "translation": "After hearing this, the mother became confused and cried in distress, exhorted her not to leave, and told her, When will I see you again?",
        "source": "T23n1447_001:1049b26_10"
    },
    {
        "source_sentence": "子生瞋故答曰：「於惡趣中相見。」",
        "translation": "The son became angry and answered, They'll see each other in a bad destiny.",
        "source": "T23n1447_001:1049b27_11"
    },
    {
        "source_sentence": "母報子言：「汝所出語，極為麁穢不善，宜應悔過令罪減少。」",
        "translation": "The mother replied to her son, What you say is so crude and unwholesome that it's advisable to repent and reduce your sins.",
        "source": "T23n1447_001:1049b28_12"
    },
    {
        "source_sentence": "即於母前，而便悔過。",
        "translation": "He then repented in front of his mother.",
        "source": "T23n1447_001:1049b29_13"
    },
    {
        "source_sentence": "既悔過已，乘騎進發。",
        "translation": "Having repented of his sins, he mounted the chariot and set out.",
        "source": "T23n1447_001:1049c01_14"
    },
    {
        "source_sentence": "時諸婆羅門等，為作吉祥呪願已，即以運戴貨物，應所須者，皆悉持去。",
        "translation": "After performing the auspicious dhāraṇī, the Brāhmaṇas then carried the goods and whatever they needed to carry them away with them.",
        "source": "T23n1447_001:1049c01_15"
    },
    {
        "source_sentence": "漸漸遊行，經無量聚落城邑，方至大海。",
        "translation": "He gradually traveled, passing through innumerable villages and cities before reaching the great sea.",
        "source": "T23n1447_001:1049c03_16"
    },
    {
        "source_sentence": "即共五百商人，持五百金錢，用雇船舶及五船師：一人執柁、一人知進、一人知退、一人修補船、一人別水。",
        "translation": "He had five hundred merchants with him, each carrying five hundred coins, hired a boat and five captains to build it. One of them carried the raft; the other one knew how to proceed; the other one knew how to retreat; the other one repaired the boat for her; and the other one provided water for her separately.",
        "source": "T23n1447_001:1049c04_17"
    },
    {
        "source_sentence": "既裝束已，再三祈願。",
        "translation": "After he had dressed himself, he repeated his vow three times.",
        "source": "T23n1447_001:1049c06_18"
    },
    {
        "source_sentence": "于時商主長者子，擊鼓宣令，論說海中善不善事。",
        "translation": "At the time, the merchant owner's elder son beat his drum and proclaimed an order to discuss good and unskillful deeds in the ocean.",
        "source": "T23n1447_001:1049c06_19"
    },
    {
        "source_sentence": "舶發去已，便至寶所多取寶物，安穩而迴，還到海岸。",
        "translation": "After the ship had set out and departed, he went to the treasure spot to collect a large quantity of valuables. Steadfastly turning around, he returned to the shore.",
        "source": "T23n1447_001:1049c08_20"
    },
    {
        "source_sentence": "爾時商主長者子，別於一方，於沙灘上居止，共二家生計算來去用度之物。",
        "translation": "At the time, the merchant lord and elder son were separated from each other, staying at the bathhouse on one side, and together with two families, they produced a calculation of what came and went to use for salvation.",
        "source": "T23n1447_001:1049c09_21"
    },
    {
        "source_sentence": "其長者子告自奴曰：「馱索迦！",
        "translation": "The elder's son told his own slave, Dāsaka!",
        "source": "T23n1447_001:1049c10_22"
    },
    {
        "source_sentence": "汝往看諸商人，今作何事？」",
        "translation": "Go and see the merchants. What will you do now?",
        "source": "T23n1447_001:1049c11_23"
    },
    {
        "source_sentence": "奴往急看，乃見商人並皆眠臥，奴便睡眠。",
        "translation": "The slave went in an hurry to see the merchants and saw them all asleep. Then he fell asleep.",
        "source": "T23n1447_001:1049c12_24"
    },
    {
        "source_sentence": "其長者子，後命令擁護往看商人，今作何事？",
        "translation": "That wealthy man's son was later instructed to embrace the merchant and look after him. What will he do now?",
        "source": "T23n1447_001:1049c13_25"
    },
    {
        "source_sentence": "時波洛迦見諸商人皆悉被辦，馱乘欲發。",
        "translation": "When Vārāṇasī saw that all the merchants were fully prepared, he wanted to set out in his carriage.",
        "source": "T23n1447_001:1049c14_26"
    },
    {
        "source_sentence": "其馱索迦謂言：「波洛迦報。」",
        "translation": "The Tathāgata said, 'The reward of the prātimokṣaṇa.'",
        "source": "T23n1447_001:1049c15_27"
    },
    {
        "source_sentence": "波洛迦復謂：「馱索迦報彼商主。」",
        "translation": "Again, Pālaka said, Dāsaka rewards the merchant owner.",
        "source": "T23n1447_001:1049c15_28"
    },
    {
        "source_sentence": "是時二奴隨商人去。",
        "translation": "The two slaves then went with the merchants.",
        "source": "T23n1447_001:1049c16_29"
    },
    {
        "source_sentence": "至天明已，二奴既不見長者子東西驅走，問諸商人曰：「長者子今何所在？」",
        "translation": "When he arrived in heaven, the two slaves didn't see the elder's son running east or west and asked the merchants, Where is the elder's son now?",
        "source": "T23n1447_001:1049c16_30"
    },
    {
        "source_sentence": "或有答言：「在前。」",
        "translation": "Some people answered, It's in front of him.",
        "source": "T23n1447_001:1049c18_31"
    },
    {
        "source_sentence": "或言：「在後。」",
        "translation": "Some people may say, It's behind.",
        "source": "T23n1447_001:1049c18_32"
    },
    {
        "source_sentence": "皆覓不見。",
        "translation": "They all looked for it but couldn't find it.",
        "source": "T23n1447_001:1049c19_33"
    },
    {
        "source_sentence": "諸商人等各相告言：「我等棄捨商主，甚為非理，急須往覓。」",
        "translation": "The merchants and others each told each other, It's quite unreasonable for us to abandon the owner of the merchant, so we urgently need to look for him.",
        "source": "T23n1447_001:1049c19_34"
    },
    {
        "source_sentence": "時諸商人，或有言：「此路極險，若覓商主，我等皆死；",
        "translation": "Some of the merchants said, “This road is extremely dangerous. If you look for the owner of the goods, we will all die.",
        "source": "T23n1447_001:1049c20_35"
    },
    {
        "source_sentence": "然而商主覓不可得。",
        "translation": "However, the merchant owner couldn't find it.",
        "source": "T23n1447_001:1049c21_36"
    },
    {
        "source_sentence": "我等共為方便，若至家時父問商主，在前行者云：『商主在後。』",
        "translation": "When we go home, the father asks the merchant owner when he's at home, and the practitioner who walks in front of him says, 'The merchant owner is behind me.'",
        "source": "T23n1447_001:1049c22_37"
    },
    {
        "source_sentence": "若問在後，云：『商主在前。』",
        "translation": "If he asks after them, he says, 'The merchant's owner is in front of him.'",
        "source": "T23n1447_001:1049c23_38"
    },
    {
        "source_sentence": "然不得云：『失却商主。』」",
        "translation": "However, they can't say,'Lose the merchant lord.'",
        "source": "T23n1447_001:1049c24_39"
    },
    {
        "source_sentence": "作是語已，漸至本村。",
        "translation": "After saying these words, he gradually returned to his native village.",
        "source": "T23n1447_001:1049c24_40"
    },
    {
        "source_sentence": "其婆羅仙長者，聞諸商人來至，歡喜前行，問諸人曰：「我子何在？」",
        "translation": "When the elder Brahmā heard that the merchants were coming, he rejoiced and went ahead, asking them, Where's my son?",
        "source": "T23n1447_001:1049c25_0"
    },
    {
        "source_sentence": "其前行者答曰：「在後。」",
        "translation": "The practitioner before him answered, Later.",
        "source": "T23n1447_001:1049c26_1"
    },
    {
        "source_sentence": "其在後人，告言：「向前。」",
        "translation": "The person behind him told him, Go ahead.",
        "source": "T23n1447_001:1049c26_2"
    },
    {
        "source_sentence": "其婆羅仙便作是念：「此等諸人誑惑於我，我子應死為復失耶？」",
        "translation": "The Brāhmaṇa then thought, Are these people deceiving me, or will my son die and lose it again?",
        "source": "T23n1447_001:1049c27_3"
    },
    {
        "source_sentence": "爾時長者無希望心，生大苦惱，親屬聚集，俱時啼泣。",
        "translation": "At the time, the elder's hopeless mind gave rise to great suffering and distress, and his relatives gathered together, all weeping and wailing.",
        "source": "T23n1447_001:1049c28_4"
    },
    {
        "source_sentence": "眾人皆往長者家，舉聲大哭。",
        "translation": "The people all went to the house of the elder and cried out in tears.",
        "source": "T23n1447_001:1050a01_0"
    },
    {
        "source_sentence": "為哭多故，其長者及婦，二俱眼盲，四遠諸人皆知長者子於大海中失沒。",
        "translation": "Because they wept so much, the elder and his wife were blinded by both eyes, and everyone in the four directions knew that the elder's son had been lost in the ocean.",
        "source": "T23n1447_001:1050a01_1"
    },
    {
        "source_sentence": "其婆羅仙長者久持孝服，子在之日，所有鞋履衣服文書受用之具，皆悉施與村中祕祠，",
        "translation": "On the day when his son was alive, all the footwear, clothes, and instruments used for religious ceremonies were given to a secret shrine in the village.",
        "source": "T23n1447_001:1050a03_2"
    },
    {
        "source_sentence": "即發誓言：「若我子命存，所在之處，安穩速達。",
        "translation": "He then made a vow, saying, If my son's life survives, wherever he is, he'll be stable and quickly reach him.",
        "source": "T23n1447_001:1050a05_3"
    },
    {
        "source_sentence": "若身已死，願生勝處。」",
        "translation": "If my body has died, I wish to be born in a superior place.",
        "source": "T23n1447_001:1050a06_4"
    },
    {
        "source_sentence": "其長者子睡，時被日照身，覺已為風吹沙乃不見路，不知商人從何處去？",
        "translation": "When the wealthy man's son was asleep, the sun shone on his body and he woke up with wind blowing sand. He didn't see the road but didn't know where the merchant was coming from.",
        "source": "T23n1447_001:1050a06_5"
    },
    {
        "source_sentence": "即乘驢而行。",
        "translation": "He then rode on a donkey and walked.",
        "source": "T23n1447_001:1050a08_6"
    },
    {
        "source_sentence": "驢省非是舊路，徐徐而行。",
        "translation": "The donkey observed that this was not the old path and walked slowly along it.",
        "source": "T23n1447_001:1050a08_7"
    },
    {
        "source_sentence": "其長者子為驢行緩，以杖打之，驢被打困更不能行。",
        "translation": "The wealthy man's son was walking slowly because of the donkey, and he struck him with a stick, and the donkey was trapped and unable to walk.",
        "source": "T23n1447_001:1050a09_8"
    },
    {
        "source_sentence": "長者子復作思惟：「誰忍見此困苦之事，無慈愍心更打此驢？」",
        "translation": "Again, the elderly man's son thought, Who would tolerate this kind of distress and suffering and beat this donkey with a lack of compassion?",
        "source": "T23n1447_001:1050a10_9"
    },
    {
        "source_sentence": "即自步行，驅驢而去。",
        "translation": "He then went on foot, drove the donkey away, and departed.",
        "source": "T23n1447_001:1050a11_10"
    },
    {
        "source_sentence": "見一鐵城，其城廣大，牆壁極高，其中寬大。",
        "translation": "He saw an iron castle, which was so large that its walls were so high and wide.",
        "source": "T23n1447_001:1050a12_11"
    },
    {
        "source_sentence": "至城門所，見一丈夫，其身長大，黑色赤精，遍身有毛，其腹麁大，甚可怖畏，",
        "translation": "At the entrance to the city gates he saw a man of great stature, black and red in color, with hair growing all over his body. His hunchbacked belly was large and very fearsome.",
        "source": "T23n1447_001:1050a13_12"
    },
    {
        "source_sentence": "執杖而住。",
        "translation": "He held his staff and stayed there.",
        "source": "T23n1447_001:1050a15_0"
    },
    {
        "source_sentence": "時長者子問其人曰：「丈夫！",
        "translation": "The elder's son then asked the man, husband!",
        "source": "T23n1447_001:1050a15_1"
    },
    {
        "source_sentence": "此中有水不？」",
        "translation": "Is there water here?",
        "source": "T23n1447_001:1050a15_2"
    },
    {
        "source_sentence": "彼默不言。",
        "translation": "They were silent and didn't say anything.",
        "source": "T23n1447_001:1050a16_3"
    },
    {
        "source_sentence": "長者子問已，即入城中。",
        "translation": "After the elder's son asked, he went into the city.",
        "source": "T23n1447_001:1050a16_4"
    },
    {
        "source_sentence": "為渴所逼，迷悶東西，求覓水故，竟無可得，不稱所求，遂即大聲云：「水！",
        "translation": "Being overcome by thirst, he lost his way and wandered east and west in confusion, searching for water but could not find it. He didn't claim to be seeking it, so he shouted out loudly, Water!",
        "source": "T23n1447_001:1050a16_5"
    },
    {
        "source_sentence": "水！」",
        "translation": "water!",
        "source": "T23n1447_001:1050a18_6"
    },
    {
        "source_sentence": "時有五百餓鬼，一時而來，如燒木柱，自髮覆體，咽如針孔，腹如大山，",
        "translation": "The five hundred hungry ghosts then came at once, like burning wooden pillars that cover their bodies, swallowing [their food] like a needle in a needle’s eye and belly like a great mountain.",
        "source": "T23n1447_001:1050a18_7"
    },
    {
        "source_sentence": "節節火出，赫然俱熾，告商主曰：「汝大慈悲，與我水飲，我等渴逼。」",
        "translation": "Everywhere the fire came out, blazing brightly and intensely hot, and he told the merchant owner, With great compassion, give me water to drink, and we'll be overcome by thirst.",
        "source": "T23n1447_001:1050a20_8"
    },
    {
        "source_sentence": "長者子曰：「我為渴逼求水，故入此城中。」",
        "translation": "The elder's son said, Because I'm thirsty and hungry for water, I entered this city.",
        "source": "T23n1447_001:1050a21_9"
    },
    {
        "source_sentence": "餓鬼報言：「此是餓鬼之城，何處得水？",
        "translation": "The hungry ghosts replied, This is the city of the hungry ghosts, so where can they get water?",
        "source": "T23n1447_001:1050a22_10"
    },
    {
        "source_sentence": "十二年中，我等不聞水名。」",
        "translation": "For twelve years, we haven't heard the name of water.",
        "source": "T23n1447_001:1050a23_11"
    },
    {
        "source_sentence": "長者子問曰：「造何罪業，生在此中？」",
        "translation": "The elder asked, What sins did you commit here?",
        "source": "T23n1447_001:1050a23_12"
    },
    {
        "source_sentence": "餓鬼答曰：「贍部洲人，多生難信，我今若說，汝亦不信。」",
        "translation": "The hungry ghost answered, Many people in Jambudvīpa have difficulty believing it; if I explain it now, you won't believe it either.",
        "source": "T23n1447_001:1050a24_13"
    },
    {
        "source_sentence": "長者子告曰：「我今對驗，面前而見，云何不信？」",
        "translation": "The elderly man's son told him, Now that I've testified to it, why don't I believe it when I see it before me?",
        "source": "T23n1447_001:1050a25_14"
    },
    {
        "source_sentence": "「我曾罵詈常瞋恚，　　慳悋惜財不與人；",
        "translation": "“I once ridiculed and hated those who were always angry, Being stingy with money and not giving it to others.",
        "source": "T23n1447_001:1050a26_15"
    },
    {
        "source_sentence": "　亦不曾行於布施，　　緣此業故生餓鬼。」",
        "translation": "Nor has he ever practiced generosity, and because of this action, a hungry ghost arises.",
        "source": "T23n1447_001:1050a26_15"
    },
    {
        "source_sentence": "是時餓鬼而說頌言：時長者子，生厭離煩惱之心，即急出城，告彼丈夫曰：「汝當報我，",
        "translation": "The hungry ghost then spoke these verses: At that time the wealthy man’s son, disgusted with his desire to be freed from the afflictions, quickly left the city and said to the husband, “You should repay me.",
        "source": "T23n1447_001:1050a26_15"
    },
    {
        "source_sentence": "此是餓鬼城耶？",
        "translation": "Is this the city of hungry ghosts?",
        "source": "T23n1447_001:1050b02_16"
    },
    {
        "source_sentence": "我當不入。」",
        "translation": "I won't enter.",
        "source": "T23n1447_001:1050b02_17"
    },
    {
        "source_sentence": "丈夫答曰：「商主！",
        "translation": "The husband answered, Master merchant!",
        "source": "T23n1447_001:1050b03_0"
    },
    {
        "source_sentence": "汝可見聞入餓鬼城，更有得出者不？",
        "translation": "Do you see and hear that he enters the city of the hungry ghosts? Is there anyone else who can escape?",
        "source": "T23n1447_001:1050b03_1"
    },
    {
        "source_sentence": "為汝有大福威德，今得重出。",
        "translation": "Because you have great merit and authoritative virtue, now you've been reborn.",
        "source": "T23n1447_001:1050b04_2"
    },
    {
        "source_sentence": "好去！",
        "translation": "Good, go away!",
        "source": "T23n1447_001:1050b04_3"
    },
    {
        "source_sentence": "好去！」",
        "translation": "Good, go!",
        "source": "T23n1447_001:1050b04_4"
    },
    {
        "source_sentence": "時長者子漸漸前行，日欲暮時，乃見化天宮處。",
        "translation": "The wealthy man's son then gradually advanced, and when the sun was about to set, he saw the place of the palace of the transformation heaven.",
        "source": "T23n1447_001:1050b05_5"
    },
    {
        "source_sentence": "有一天子，復有四天女，共為歡樂遊戲天宮。",
        "translation": "A celestial being and another four heavenly maidens shared the pleasure of play in the heavenly palace.",
        "source": "T23n1447_001:1050b06_6"
    },
    {
        "source_sentence": "其天遙見長者子，告曰：「商主無病。",
        "translation": "The god saw the wealthy man’s son from a distance and said to him, “The merchant lord is not ill.",
        "source": "T23n1447_001:1050b07_7"
    },
    {
        "source_sentence": "汝有飢渴不？」",
        "translation": "Do you have hunger and thirst?",
        "source": "T23n1447_001:1050b07_8"
    },
    {
        "source_sentence": "答言：「甚飢渴耳！」",
        "translation": "He replied, Very hungry and thirsty!",
        "source": "T23n1447_001:1050b08_9"
    },
    {
        "source_sentence": "于時天子即令商主洗浴，供妙飲食，其夜止宿。",
        "translation": "The celestial prince then ordered the merchant owner to bathe and offer him a wonderful food and drink, and he spent the night there.",
        "source": "T23n1447_001:1050b08_10"
    },
    {
        "source_sentence": "至天曉已，於日出時，其宮變化，前四天女變為黧狗，捉此天子，覆面撲著於熱鐵床上，",
        "translation": "The first four heavenly maidens transformed themselves into hound dogs and caught the celestial being, covering his face and throwing him onto a hot iron bed.",
        "source": "T23n1447_001:1050b09_11"
    },
    {
        "source_sentence": "猛焰星流，食其背肉。",
        "translation": "Fierce flames and stars flowed, eating the flesh on his back.",
        "source": "T23n1447_001:1050b11_12"
    },
    {
        "source_sentence": "復至暮間日欲沒時，還復變為天宮，狗乃變為天女。",
        "translation": "Again, when the sun was about to set in the evening, the dog returned and transformed itself into a heavenly palace. The dog then transformed itself into a heavenly maiden.",
        "source": "T23n1447_001:1050b12_0"
    },
    {
        "source_sentence": "然長者子眼親見已，情切怪異，即告彼天子曰：「汝作何業今生此處？」",
        "translation": "Still, the elder son's eyes saw it for himself and wondered why he was so frightened.",
        "source": "T23n1447_001:1050b13_1"
    },
    {
        "source_sentence": "時天子答曰：「商主！",
        "translation": "The celestial prince then answered, Lord of the merchants!",
        "source": "T23n1447_001:1050b14_2"
    },
    {
        "source_sentence": "南贍部洲人多難信。」",
        "translation": "Many people in Jambudvīpa in the south have difficulty believing it.",
        "source": "T23n1447_001:1050b15_3"
    },
    {
        "source_sentence": "長者子曰：「我今目驗，云何不信？」",
        "translation": "The elder son said, Now that I've tested my eyes, why don't I believe it?",
        "source": "T23n1447_001:1050b15_4"
    },
    {
        "source_sentence": "「昔時白日損他命，　　夜則持戒勤修行；",
        "translation": "“Once, in the past, on a white day they harmed others’ lives; At night they observed precepts and diligently practiced.",
        "source": "T23n1447_001:1050b16_5"
    },
    {
        "source_sentence": "　以此因緣生此中，　　今受如是善惡業。」",
        "translation": "Because of these causes and conditions, they'll be born here, and now they'll experience such good and bad actions.",
        "source": "T23n1447_001:1050b16_5"
    },
    {
        "source_sentence": "爾時天子說往昔業緣，以頌答曰：時長者子聞此頌已白言：「頌有何義？」",
        "translation": "It was then that the celestial son explained the karmic conditions of past actions and answered in verse, After hearing this verse, the elder son said, What's the meaning of the verse?",
        "source": "T23n1447_001:1050b16_5"
    },
    {
        "source_sentence": "天子答曰：「商主！",
        "translation": "The celestial prince answered, Merchant lord!",
        "source": "T23n1447_001:1050b19_6"
    },
    {
        "source_sentence": "我往昔時在婆索村中，身為屠兒，常以殺羊賣肉自養育身。",
        "translation": "Formerly, when I was a butcher in Vātsīputrīya’s village, I always slaughtered sheep and sold meat to raise my own body.",
        "source": "T23n1447_001:1050b20_7"
    },
    {
        "source_sentence": "時有聖者苾芻，名迦多演那，勸我改悔，勿造斯業，無有盡期。",
        "translation": "At the time, there was a noble monk named Kātyāyana who encouraged me to repent and not do such actions for an endless number of years.",
        "source": "T23n1447_001:1050b21_8"
    },
    {
        "source_sentence": "既勸不得，是時聖者又復勸我，令夜持戒。",
        "translation": "When he hadn't been encouraged, the sage then again encouraged me to observe the precepts at night.",
        "source": "T23n1447_001:1050b22_9"
    },
    {
        "source_sentence": "我即依教。",
        "translation": "The self is the basis of the teaching.",
        "source": "T23n1447_001:1050b23_10"
    },
    {
        "source_sentence": "以此業故，今者白日受苦；",
        "translation": "Because of this action, they are now undergoing painful rebirth day and night.",
        "source": "T23n1447_001:1050b24_11"
    },
    {
        "source_sentence": "為夜持戒，夜受如是快樂果報。",
        "translation": "In order to observe the precepts at night, he receives such a pleasant reward for observing them at night.",
        "source": "T23n1447_001:1050b24_12"
    },
    {
        "source_sentence": "商主！",
        "translation": "Lord of the merchants!",
        "source": "T23n1447_001:1050b25_13"
    },
    {
        "source_sentence": "若至彼村見我男女，為我告言：『我見汝父極受苦報，汝今改悔休作此業。』」",
        "translation": "If you go to that village and see my men and women, tell them for me, 'I've seen your father suffer the most painful retribution, so now repent and stop doing this action.'",
        "source": "T23n1447_001:1050b25_14"
    },
    {
        "source_sentence": "時長者子告曰：「汝今自說南贍部人難化難信。」",
        "translation": "The elder's son then told him, Now, tell yourself that the people of southern Jambudvīpa are difficult to convert and difficult to believe.",
        "source": "T23n1447_001:1050b27_15"
    },
    {
        "source_sentence": "天子報曰：「為將一信，報我子言：『其殺羊處地下有一瓶金，爾可穿取隨意受用，",
        "translation": "The celestial prince replied, “If you wish to have a piece of faith, tell my son, ‘There’s a pot of gold under the ground at the place where he killed his sheep.",
        "source": "T23n1447_001:1050b28_16"
    },
    {
        "source_sentence": "自然快樂。",
        "translation": "He's naturally happy.",
        "source": "T23n1447_001:1050b29_17"
    },
    {
        "source_sentence": "亦應時時供養聖者迦多演那，是人天福田。",
        "translation": "Also, it's a field of merit for humans and gods to make offerings to the noble Kātyāyana at the right time and time.",
        "source": "T23n1447_001:1050c01_18"
    },
    {
        "source_sentence": "所供養者，布施之時，稱讚我名願罪消滅。』」",
        "translation": "When he makes an offering, he praises my name and vows that sins will cease.'",
        "source": "T23n1447_001:1050c02_19"
    },
    {
        "source_sentence": "是時商主聞此語已，漸進前行，復見天宮。",
        "translation": "After hearing these words, the merchant lord gradually advanced forward and saw the heavenly palace again.",
        "source": "T23n1447_001:1050c03_20"
    },
    {
        "source_sentence": "有一天子，共諸天女歡喜遊戲，遙見長者子告言：「商主！",
        "translation": "When the celestial beings and goddesses were joyfully playing together, they saw the elder's son from a distance and told him, Merchant lord!",
        "source": "T23n1447_001:1050c04_21"
    },
    {
        "source_sentence": "願爾無病，不有飢渴耶？」",
        "translation": "May you be free of illness and not hungry and thirsty?",
        "source": "T23n1447_001:1050c05_22"
    },
    {
        "source_sentence": "長者子曰：「我有飢渴。」",
        "translation": "The elder son said, I'm hungry and thirsty.",
        "source": "T23n1447_001:1050c05_23"
    },
    {
        "source_sentence": "天子即令洗浴，設諸飲食，止息安臥。",
        "translation": "The celestial prince then ordered him to wash, bathe, prepare food and drink, and lie down quietly.",
        "source": "T23n1447_001:1050c06_24"
    },
    {
        "source_sentence": "至日暮時，天宮復變，天女為大蛇，繞天子身，周匝食腦。",
        "translation": "At sunset the celestial palace changed again and the heavenly maidens became large serpents, surrounding the goddesses’ bodies and feeding on their brains.",
        "source": "T23n1447_001:1050c07_25"
    },
    {
        "source_sentence": "至日出時，還復天宮，作天子形及以天女。",
        "translation": "When the sun rises, he returns to the palace of heaven and takes the form of a celestial prince or goddess.",
        "source": "T23n1447_001:1050c08_26"
    },
    {
        "source_sentence": "其商主怪異，問彼天子曰：「曾造何業生於此中？」",
        "translation": "The merchant lord wondered, and asked the celestial prince, What actions did you create here?",
        "source": "T23n1447_001:1050c09_27"
    },
    {
        "source_sentence": "天子報曰：「南贍部洲人，難化難信，我不能說。」",
        "translation": "The celestial prince replied, The people of Jambudvīpa in the south are difficult to convert and difficult to believe, so I can't explain.",
        "source": "T23n1447_001:1050c10_28"
    },
    {
        "source_sentence": "時長者子答曰：「我目親見，云何無信？」",
        "translation": "The elder son then answered, I've seen it myself, so why wouldn't I believe it?",
        "source": "T23n1447_001:1050c11_29"
    },
    {
        "source_sentence": "「夜共他婦宿，　　晝日護尸羅；",
        "translation": "To spend the night with another woman, he guards Śīlabhadra day and night.",
        "source": "T23n1447_001:1050c12_30"
    },
    {
        "source_sentence": "　緣此業果故，　　受斯善惡報。」",
        "translation": "Because of the results of this action, they'll receive these good and bad rewards.",
        "source": "T23n1447_001:1050c12_30"
    },
    {
        "source_sentence": "爾時天子說伽他曰：時長者子問曰：「此說何義？」",
        "translation": "It was then that the celestial prince said to Kālāma, The elder son asked, What's the meaning of this explanation?",
        "source": "T23n1447_001:1050c12_30"
    },
    {
        "source_sentence": "天子答曰：「我曾往昔在婆索婆村中，常行婬欲，婬他女婦。",
        "translation": "The celestial replied, Once in the past, I was in the village of Vasubandhu, always engaged in sexual misconduct and had sexual intercourse with other women.",
        "source": "T23n1447_001:1050c15_31"
    },
    {
        "source_sentence": "後逢聖者迦多演那，勸我悔造非法惡業。",
        "translation": "Later, I met the sage Kātyāyana and asked me to repent of unwholesome bad actions.",
        "source": "T23n1447_001:1050c16_32"
    },
    {
        "source_sentence": "我由不斷斯事，聖者復言：『汝不常斷者，白日持戒、夜還行非。』",
        "translation": "Because I don't stop these things, the noble person also says, 'If you don't always stop them, it's because you observe precepts on the white day and return at night to do what's wrong.'",
        "source": "T23n1447_001:1050c17_33"
    },
    {
        "source_sentence": "緣此事故白日受天快樂，夜受苦報。",
        "translation": "Because of this event, he experienced heavenly bliss on a white day and suffered the painful retribution of suffering at night.",
        "source": "T23n1447_001:1050c19_34"
    },
    {
        "source_sentence": "善哉長者子！",
        "translation": "Excellent, my lord!",
        "source": "T23n1447_001:1050c20_0"
    },
    {
        "source_sentence": "去至彼村，我有一子，幸為報之。",
        "translation": "When I went to that village, I had a son who was fortunate enough to repay him.",
        "source": "T23n1447_001:1050c20_1"
    },
    {
        "source_sentence": "我見汝父作如是言：『我由前生曾作此業，婬他女婦受地獄苦。』」",
        "translation": "Seeing your father, I said, 'I've done this action in a previous life that caused me to sexualize other women and suffer the pain of hell.'",
        "source": "T23n1447_001:1050c21_0"
    },
    {
        "source_sentence": "時長者子言：「南贍部洲人難化難信，云何肯受？」",
        "translation": "The elder son then said, How will the people of Jambudvīpa in the south who are difficult to convert and difficult to believe be willing to accept it?",
        "source": "T23n1447_001:1050c22_1"
    },
    {
        "source_sentence": "天子報曰：「若不信時，告言：『我生存日，祭火爐地下有二瓶金，當可穿取，",
        "translation": "The celestial beings replied, “If you do not believe me, tell me: On the day of my birth as a human being, offer two jars of gold to the fire altar so that it can be pierced and taken.",
        "source": "T23n1447_001:1050c23_2"
    },
    {
        "source_sentence": "自受快樂。",
        "translation": "They experience happiness for themselves.",
        "source": "T23n1447_001:1050c25_3"
    },
    {
        "source_sentence": "又復時時供養人天所奉大迦多演那，發弘誓願，稱我名號，願罪消除，",
        "translation": "Again, from time to time he honored the Great Kātyāyana whom humans and gods worshiped. He made a great vow that they should call me by my name in order to extinguish their sins.",
        "source": "T23n1447_001:1050c25_4"
    },
    {
        "source_sentence": "得生善趣。』」",
        "translation": "They'll be born in a good destiny.'",
        "source": "T23n1447_001:1050c26_5"
    },
    {
        "source_sentence": "時長者子領受此語，次復前行，去此未遠，乃更遙見園苑。",
        "translation": "Accepting these words, the wealthy man's son then went on his way again, and not far from here, he saw a garden at a distance.",
        "source": "T23n1447_001:1050c27_6"
    },
    {
        "source_sentence": "其中有師子座，座上有一婦女而坐，顏容妙好，人所喜見。",
        "translation": "Among them was a lion seat, on which there was a woman sitting with a beautiful appearance and delighted to be seen.",
        "source": "T23n1447_001:1050c28_7"
    },
    {
        "source_sentence": "座四脚下各有一餓鬼，縛著座脚而住。",
        "translation": "Below each of the four feet of the seat was a hungry ghost, bound to the foot of the seat and standing there.",
        "source": "T23n1447_001:1050c29_8"
    },
    {
        "source_sentence": "時此婦人遙見長者子來，告言：「商主！",
        "translation": "The woman then saw the elder's son coming from a distance and told him, Merchant lord!",
        "source": "T23n1447_001:1051a01_9"
    },
    {
        "source_sentence": "無病少惱。",
        "translation": "There's no illness and little affliction.",
        "source": "T23n1447_001:1051a02_10"
    },
    {
        "source_sentence": "有飢渴耶？」",
        "translation": "Is there hunger and thirst?",
        "source": "T23n1447_001:1051a02_11"
    },
    {
        "source_sentence": "答曰：「我甚飢渴！」",
        "translation": "He replied, I'm so hungry and thirsty!",
        "source": "T23n1447_001:1051a02_12"
    },
    {
        "source_sentence": "時彼婦人告長者子曰：「與汝諸漿。",
        "translation": "The woman then addressed the elder's son, Give him some of your juice.",
        "source": "T23n1447_001:1051a03_13"
    },
    {
        "source_sentence": "汝可作盟：今所與漿，勿得與此四箇飢鬼。」",
        "translation": "You may make an alliance, saying, Don't give the juice that you're giving now to these four hungry ghosts.",
        "source": "T23n1447_001:1051a04_0"
    },
    {
        "source_sentence": "長者子答曰：「敬諾所言。」",
        "translation": "The elder replied, I respectfully promised what I said.",
        "source": "T23n1447_001:1051a04_1"
    },
    {
        "source_sentence": "既蒙設漿及妙飲食，時彼婦人欲現餓鬼業報之事故，便入一房，隱身藏住。",
        "translation": "When they were given a drink of wine and good food, the woman wanted to show the consequences of hungry ghostly actions, so she went into one room and hid herself in hiding.",
        "source": "T23n1447_001:1051a05_2"
    },
    {
        "source_sentence": "諸餓鬼等即白長者子曰：「汝大慈悲，願賜少許飲食。」",
        "translation": "The hungry ghosts and others then said to the elder's son, With great compassion, may you give me a little food and drink.",
        "source": "T23n1447_001:1051a07_3"
    },
    {
        "source_sentence": "其長者子心生憐愍，即擲食與。",
        "translation": "The elder's son became compassionate, and he tossed the food away.",
        "source": "T23n1447_001:1051a08_4"
    },
    {
        "source_sentence": "第一得食，變為炎熱鐵團；",
        "translation": "When the first food is obtained, it turns into a hot iron ball.",
        "source": "T23n1447_001:1051a09_5"
    },
    {
        "source_sentence": "第二得食，變為麥糠；",
        "translation": "The second obtains food and is transformed into rice bran.",
        "source": "T23n1447_001:1051a09_6"
    },
    {
        "source_sentence": "第三得食，變為膿血不淨；",
        "translation": "The third obtains food and turns it into pus and blood that is impure.",
        "source": "T23n1447_001:1051a10_7"
    },
    {
        "source_sentence": "第四得食，乃還食噉自身肉血。",
        "translation": "The fourth obtains food and then returns to eat the flesh and blood of his own body.",
        "source": "T23n1447_001:1051a10_8"
    },
    {
        "source_sentence": "爾時餓鬼吞熱鐵丸者，燒身臭穢，婦人聞氣，即出高聲告長者子曰：「汝所作者甚為非理，",
        "translation": "It was then that the hungry ghost swallowed the hot iron ball and burned his body, smelling foul and foul. The woman who heard the spirit breathed out in a loud voice and said to the wealthy man’s son, “Your action is quite unreasonable.",
        "source": "T23n1447_001:1051a11_9"
    },
    {
        "source_sentence": "不應與彼飲食。」",
        "translation": "You shouldn't give them food and drink.",
        "source": "T23n1447_001:1051a13_10"
    },
    {
        "source_sentence": "其長者子答曰：「妹子！",
        "translation": "The elder's son answered, Sister!",
        "source": "T23n1447_001:1051a13_11"
    },
    {
        "source_sentence": "彼見求我，心生慈悲，云何不與？」",
        "translation": "When they see me and seek me, their minds become compassionate, so why don't they give it to me?",
        "source": "T23n1447_001:1051a14_12"
    },
    {
        "source_sentence": "時婦人言：「我心慈悲，更大於汝。",
        "translation": "The woman then said, My compassionate mind is greater than yours.",
        "source": "T23n1447_001:1051a14_13"
    },
    {
        "source_sentence": "然此餓鬼：一者是我夫婿，二者是我之子，三者是我新婦，四者是我家奴。」",
        "translation": "Still, these hungry ghosts: one is my husband's son-in-law, two are my children, three are my new wife, and four are my servants.",
        "source": "T23n1447_001:1051a15_14"
    },
    {
        "source_sentence": "是時長者子問曰：「曾造何罪，生在此中？」",
        "translation": "The elder son then asked, What sin did you commit in the past to be born here?",
        "source": "T23n1447_001:1051a17_15"
    },
    {
        "source_sentence": "婦人告曰：「南贍部洲人難化難信，說有何益？」",
        "translation": "The woman told him, What good is it to say that the people of Jambudvīpa in the south are difficult to convert and difficult to believe?",
        "source": "T23n1447_001:1051a18_16"
    },
    {
        "source_sentence": "長者子曰：「我今現見，云何不信？」",
        "translation": "The elder son said, Now that I've seen it, why don't I believe it?",
        "source": "T23n1447_001:1051a19_17"
    },
    {
        "source_sentence": "時婦人言：「我於往昔，於婆索婆村，曾為梵志女，因歲星節日家中設食，",
        "translation": "The woman said, “In the past I was once a brahman’s daughter in Vasuba Monastery.",
        "source": "T23n1447_001:1051a19_18"
    },
    {
        "source_sentence": "乃有聖者人天所奉迦多演那，來乞飯食。",
        "translation": "Then a holy man named Kātyāyana, who was worshiped by humans and gods, came to beg for food.",
        "source": "T23n1447_001:1051a21_19"
    },
    {
        "source_sentence": "我生歡喜，施滿鉢盂食。",
        "translation": "Rejoicing, I gave my bowl full of food.",
        "source": "T23n1447_001:1051a22_20"
    },
    {
        "source_sentence": "我復生念：『今可告夫，冀生隨喜施食之因。』",
        "translation": "Again, I had this thought, 'Now, may I tell you, husband, that it's a cause for giving food with the intention of producing joyfulness.'",
        "source": "T23n1447_001:1051a22_21"
    },
    {
        "source_sentence": "其夫瞋恚婦曰：『尚未供養諸婆羅門，因何先施禿頭之人。",
        "translation": "The angry woman said, 'I haven't yet offered support to the brāhmaṇas, so why did I first give it to a baldie?'",
        "source": "T23n1447_001:1051a23_22"
    },
    {
        "source_sentence": "云何不與熱鐵丸？』",
        "translation": "Why don't you give him a hot iron ball?'",
        "source": "T23n1447_001:1051a25_23"
    },
    {
        "source_sentence": "既不遂情。",
        "translation": "Since they didn't fulfill their feelings, they said.",
        "source": "T23n1447_001:1051a25_24"
    },
    {
        "source_sentence": "次當勸子，子復報云：『何不食其麥糠？』",
        "translation": "Next, he should encourage his son, and the son then replies, 'Why don't you eat the wheat bran?'",
        "source": "T23n1447_001:1051a25_25"
    },
    {
        "source_sentence": "後時我遣一奴送食與諸親眷，奴得食已，在路自飡上妙好者。",
        "translation": "Later, I sent a slave to send food to my relatives and friends, and when he had eaten it, he was on the road eating his best food.",
        "source": "T23n1447_001:1051a26_26"
    },
    {
        "source_sentence": "迴至勘問，其奴便諱：『我若在路食之，願我當食自身膿血。』",
        "translation": "When he returned to investigate, the slave said, 'If I were to eat it on the road, may I eat my own pus and blood.'",
        "source": "T23n1447_001:1051a28_27"
    },
    {
        "source_sentence": "後時諸親又送食來，新婦盜食。",
        "translation": "Later, his relatives again sent food to him, and the new wife stole food.",
        "source": "T23n1447_001:1051a29_28"
    },
    {
        "source_sentence": "我又問之，答言：『不食！",
        "translation": "Again, I asked him, and he replied, 'Don't eat!",
        "source": "T23n1447_001:1051b01_29"
    },
    {
        "source_sentence": "若食，願我自食身肉。』」",
        "translation": "If you eat it, may I eat my own flesh.'",
        "source": "T23n1447_001:1051b01_30"
    },
    {
        "source_sentence": "白言：「商主！",
        "translation": "They said, Merchant lord!",
        "source": "T23n1447_001:1051b02_31"
    },
    {
        "source_sentence": "其夫婿、兒子、新婦，及奴者，此餓鬼等是，並由自作，今受餓鬼。",
        "translation": "Their husbands, sons, new wives, and slaves are hungry ghosts, and they're all self-created, but now they're subject to hungry ghosts.",
        "source": "T23n1447_001:1051b02_32"
    },
    {
        "source_sentence": "由我布施聖者迦多演那一飡之食，作如是言：『汝若受報，我當眼見。』",
        "translation": "Because of the food given to me by the noble person Kātyāyana as a gift, he said, 'If you receive the reward, I will see it with my eyes.'",
        "source": "T23n1447_001:1051b03_33"
    },
    {
        "source_sentence": "我先布施天人所供迦多演那，應生帝釋天宮；",
        "translation": "I should be reborn in the heavenly palace of Tīrṣa-deva at Kātyāyana, which was previously offered to me by my benefactors.",
        "source": "T23n1447_001:1051b05_34"
    },
    {
        "source_sentence": "由發惡願故，今墮餓鬼道中。",
        "translation": "Because of their bad vows, they'll now fall into the path of hungry ghosts.",
        "source": "T23n1447_001:1051b06_35"
    },
    {
        "source_sentence": "商主！",
        "translation": "Lord of the merchants!",
        "source": "T23n1447_001:1051b06_36"
    },
    {
        "source_sentence": "仁若往訪婆索婆村，我有一女，在彼村中為婬女，幸可為報云：『汝父母兄嫂及奴，",
        "translation": "Good man, you may go to the village of Vasubandhu. I have a daughter who is in that village as a nymphomaniacal woman.",
        "source": "T23n1447_001:1051b07_37"
    },
    {
        "source_sentence": "墮在餓鬼趣中受苦，由先作惡今受此苦，汝今應可悔過，莫作斯惡，當受苦報。』」",
        "translation": "They'll fall into the retribution of suffering in the destinies of hungry ghosts because they did evil in the past and now suffer this kind of pain. Now, you should repent and don't do such evil; you'll experience the results of suffering.'",
        "source": "T23n1447_001:1051b08_38"
    },
    {
        "source_sentence": "長者子曰：「南贍部洲人多難信，不受我語。」",
        "translation": "The elder son said, Many people in southern Jambudvīpa have difficulty believing it and won't accept my words.",
        "source": "T23n1447_001:1051b10_39"
    },
    {
        "source_sentence": "白言：「商主！",
        "translation": "They said, Merchant lord!",
        "source": "T23n1447_001:1051b11_40"
    },
    {
        "source_sentence": "彼若不信者，便當告：『我先臥床下，有四瓶金并一金杖及金澡罐，汝當出取金瓶任意受用。",
        "translation": "If they don't believe it, then they'll tell them, 'First, while lying on my bed, there are four gold vases, a gold staff, and a gold bathing pot; you must go out and take the gold vase and use it freely.",
        "source": "T23n1447_001:1051b11_41"
    },
    {
        "source_sentence": "復須時時供養天人所識迦多演那美妙飲食，并稱我名令我得福罪當輕薄。』」",
        "translation": "It's also necessary to make offerings at the appropriate time to the gods and humans who know Kātyāyana for their good food and drink, and call me by my name so that I'll attain merit and sin will be weakened.'",
        "source": "T23n1447_001:1051b13_42"
    },
    {
        "source_sentence": "時長者子既聞語已，即便辭別，入房眠睡。",
        "translation": "After hearing what he said, the elder's son then left and went into his room to sleep.",
        "source": "T23n1447_001:1051b15_43"
    },
    {
        "source_sentence": "爾時諸鬼互相告曰：「汝等應知，此長者子正睡，可持送往婆索婆村，",
        "translation": "The ghosts then said to each other, “You should know that this wealthy man’s son is asleep.",
        "source": "T23n1447_001:1051b16_44"
    },
    {
        "source_sentence": "置靈床上。」",
        "translation": "Put it on the spiritual bed.",
        "source": "T23n1447_001:1051b18_45"
    },
    {
        "source_sentence": "時諸鬼等，依言將往。",
        "translation": "The ghosts then relied on the words and were about to go.",
        "source": "T23n1447_001:1051b18_46"
    },
    {
        "source_sentence": "是時商主至明清旦日欲出時，即便睡覺，乃見諸床及以小床、靴履之物，",
        "translation": "At that time the merchant’s lord, who was about to go out at dawn, immediately awoke and saw all the beds, small chairs, footwear, and other goods.",
        "source": "T23n1447_001:1051b18_47"
    },
    {
        "source_sentence": "一切資具之上皆有其名字。",
        "translation": "Above all the necessities, they all have their names.",
        "source": "T23n1447_001:1051b20_48"
    },
    {
        "source_sentence": "次第讀看有如是語：「我今所施此物，願子早來。",
        "translation": "In order, they read and look at it one after the other, saying, Now that I've given this gift, may my son come sooner.",
        "source": "T23n1447_001:1051b21_49"
    },
    {
        "source_sentence": "如若死者，隨所生處願此諸物，並皆隨從。」",
        "translation": "Suppose someone dies and wishes for these things to follow them wherever they're born.",
        "source": "T23n1447_001:1051b22_50"
    },
    {
        "source_sentence": "見斯事已，即思惟言：「我之父母，既知我死，何須更住？",
        "translation": "Seeing this, he thought to himself: Since my parents knew that I was dead, why would they need to live any longer?",
        "source": "T23n1447_001:1051b23_51"
    },
    {
        "source_sentence": "宜可往詣聖者迦多演那所，而為出家，修其梵行。」",
        "translation": "It's advisable to go to the noble Kātyāyana and become a renunciant and cultivate his religious practice.",
        "source": "T23n1447_001:1051b24_52"
    },
    {
        "source_sentence": "作是念已，即便往詣迦多演那所。",
        "translation": "After he had this thought, he went to Kātyāyana.",
        "source": "T23n1447_001:1051b25_53"
    },
    {
        "source_sentence": "時具壽迦多演那，遙見長者子來，見已即告語言：「善來商主！",
        "translation": "Kauṣṭhila Kātyāyana saw the elder's son coming from a distance, and when he saw him, he told him, Well come, merchant lord!",
        "source": "T23n1447_001:1051b26_54"
    },
    {
        "source_sentence": "汝今見此生死過患耶？」",
        "translation": "Do you now see the faults of birth-and-death?",
        "source": "T23n1447_001:1051b27_55"
    },
    {
        "source_sentence": "白言：「聖者！",
        "translation": "He said, Sage!",
        "source": "T23n1447_001:1051b28_56"
    },
    {
        "source_sentence": "我今已見。」",
        "translation": "Now, I've seen it.",
        "source": "T23n1447_001:1051b28_57"
    },
    {
        "source_sentence": "又即白言：「願與出家供侍聖者，斷婬怒癡修於梵行。」",
        "translation": "He also said, May I give it to a renunciant who serves the sage and stops lust, anger, and delusion and cultivates religious practice?",
        "source": "T23n1447_001:1051b28_58"
    },
    {
        "source_sentence": "時具壽迦多演那言：「汝可先傳彼語，然後可來出家。」",
        "translation": "Kauṣṭhila Kātyāyana then said to him, You may first transmit their words, and then you can come and leave home.",
        "source": "T23n1447_001:1051b29_59"
    },
    {
        "source_sentence": "白言：「可爾！」",
        "translation": "He said, Yes!",
        "source": "T23n1447_001:1051c01_60"
    },
    {
        "source_sentence": "既聞聖者告已，即往彼村殺羊之處，到其人所，告曰：「汝今知不？",
        "translation": "Having heard the announcement, the holy man immediately went to that village where the sheep were slaughtered.",
        "source": "T23n1447_001:1051c02_61"
    },
    {
        "source_sentence": "於惡趣中，曾見汝父，遣傳此語：『汝可迴斯殺羊惡業非法之事。』」",
        "translation": "In a bad destiny, I once saw your father and sent this message, saying, 'You may return to this bad act of killing sheep as an unlawful thing.'",
        "source": "T23n1447_001:1051c03_62"
    },
    {
        "source_sentence": "彼乃答言：「我父死來經十二年，豈有傳信別生中事，汝從他聞為自見耶？」",
        "translation": "They replied, Twelve years after my father's death, isn't there a rumor that you'll hear it from someone else and see it for yourself?",
        "source": "T23n1447_001:1051c05_0"
    },
    {
        "source_sentence": "答曰：「我從惡趣中來。",
        "translation": "He answered, I came from a bad destiny.",
        "source": "T23n1447_001:1051c06_1"
    },
    {
        "source_sentence": "若不信者，汝父報言：『汝屠羊處地下有一金瓶，穿取其金將為受用，",
        "translation": "If you don't believe it, your father will tell you, 'There's a gold pot underground at the butcher' s sheep' s place that penetrates and takes the gold for their use.",
        "source": "T23n1447_001:1051c07_2"
    },
    {
        "source_sentence": "并復時時供養聖者迦多演那食，稱讚我名願罪業消滅。』」",
        "translation": "It's also a time to make offerings to the noble Kātyāyana food and praise my name, wishing for the cessation of sinful actions.'",
        "source": "T23n1447_001:1051c08_3"
    },
    {
        "source_sentence": "然此屠兒即穿地下，遂得金瓶，乃知證驗。",
        "translation": "The butcher then penetrated the ground and found a golden vase, which he knew to be his proof.",
        "source": "T23n1447_001:1051c09_4"
    },
    {
        "source_sentence": "時長者子又即往訪婬逸之子，到已告曰：「我見汝父，令報汝斯事：『我所造業果報成熟，",
        "translation": "Then the wealthy man’s son visited Kauṇḍinya and said to him, “I see your father and will tell you this:",
        "source": "T23n1447_001:1051c10_5"
    },
    {
        "source_sentence": "現受眾苦。』」",
        "translation": "I'll now experience all kinds of suffering.'",
        "source": "T23n1447_001:1051c12_6"
    },
    {
        "source_sentence": "斯人答曰：「我父死來，經今十二年。",
        "translation": "The man replied, “My father died twelve years ago.",
        "source": "T23n1447_001:1051c13_7"
    },
    {
        "source_sentence": "豈從他生中來？",
        "translation": "Does it come from the birth of others?",
        "source": "T23n1447_001:1051c13_8"
    },
    {
        "source_sentence": "為復聞他說耶？",
        "translation": "Why do you hear others again?",
        "source": "T23n1447_001:1051c14_9"
    },
    {
        "source_sentence": "為自見耶？」",
        "translation": "Is it for self-view?",
        "source": "T23n1447_001:1051c14_10"
    },
    {
        "source_sentence": "長者子曰：「我從餓鬼中來，具見斯事。",
        "translation": "The wealthy man’s son said, “I came from among the hungry ghosts to see this.",
        "source": "T23n1447_001:1051c14_11"
    },
    {
        "source_sentence": "若不信者，汝父信曰：『向汝事火爐下有二金瓶，汝應穿取受用，及將一分時時供養聖者迦多演那一團之食，",
        "translation": "If you don't believe it, your father will believe it, saying, 'There are two golden vases under the fire altar for you to serve, so you should pierce and accept them, and offer a lump of food to the noble Kātyāyana as an offering at one time.",
        "source": "T23n1447_001:1051c15_12"
    },
    {
        "source_sentence": "稱讚我名願我罪業除滅。』」",
        "translation": "Praise me for my name and wish that my sins be removed.'",
        "source": "T23n1447_001:1051c18_13"
    },
    {
        "source_sentence": "子即穿地乃見金瓶，始知現驗。",
        "translation": "The boy then penetrated the ground and saw the golden vase, which he first knew to be alive.",
        "source": "T23n1447_001:1051c18_14"
    },
    {
        "source_sentence": "時長者子又往彼婬女之處告言：「汝復當知，我於惡趣，見汝父母兄嫂及奴，",
        "translation": "The wealthy man’s son then went to the promiscuous woman again and said, “You should also know that I saw your parents, brothers, sisters, and servants in a bad destiny.",
        "source": "T23n1447_001:1051c19_15"
    },
    {
        "source_sentence": "令報汝知，急悔已過惡業之事。」",
        "translation": "I'll tell you to quickly repent of the bad actions that have been done.",
        "source": "T23n1447_001:1051c21_16"
    },
    {
        "source_sentence": "答商主曰：「彼並死來，經今十二年，誰復見聞？",
        "translation": "They replied to the merchant lord, “They all died. Who will see or hear them again in twelve years’ time?",
        "source": "T23n1447_001:1051c21_17"
    },
    {
        "source_sentence": "爾從何處來耶？」",
        "translation": "Where did you come from?",
        "source": "T23n1447_001:1051c22_18"
    },
    {
        "source_sentence": "答曰：「我從地獄中來。",
        "translation": "He replied, I came from hell.",
        "source": "T23n1447_001:1051c23_19"
    },
    {
        "source_sentence": "若不信者，汝父母言：『我眠臥處床四足下，各有一金瓶，其中并有金杖澡瓶。",
        "translation": "If you don't believe it, your parents will say, 'When I sleep and lie down on the four feet of my bed, there's a gold vial under each of the four feet, with a golden staff in it and a bathing vial made of gold.",
        "source": "T23n1447_001:1051c23_20"
    },
    {
        "source_sentence": "汝可穿取歡樂受用，及以時時供養聖者人天所奉迦多演那，當稱讚我名願我罪滅。』」",
        "translation": "You may pass through it and enjoy it, and at the right time and place to make offerings to the noble person's Kātyāyana offered by humans and gods will praise my name and wish that my sins be extinguished.'",
        "source": "T23n1447_001:1051c25_21"
    },
    {
        "source_sentence": "當即穿地，一如來信。",
        "translation": "You should immediately penetrate the ground, and the Tathāgata will believe it.",
        "source": "T23n1447_001:1051c27_22"
    },
    {
        "source_sentence": "時長者子笑曰：「人皆信金，不信我語。」",
        "translation": "The elderly man then laughed and said, Everyone believes in gold, but they don't believe what I say.",
        "source": "T23n1447_001:1051c27_23"
    },
    {
        "source_sentence": "因笑露齒，女見金齒，乃知斯人是彼長者之子，問曰：「聖者！",
        "translation": "When she saw the woman's golden teeth, she knew that they were the elder's children and asked, Sage!",
        "source": "T23n1447_001:1051c28_24"
    },
    {
        "source_sentence": "仁豈不是婆羅仙子耶？」",
        "translation": "Isn't that the ṛṣi Upāsaka Bālā?",
        "source": "T23n1447_001:1051c29_25"
    },
    {
        "source_sentence": "報曰：「眾人皆道我是。」",
        "translation": "He replied, All the people will know that I am him.",
        "source": "T23n1447_001:1052a01_26"
    },
    {
        "source_sentence": "其女即走往至其家，切報父母。",
        "translation": "The woman then ran to her house and reported it to her parents.",
        "source": "T23n1447_001:1052a01_27"
    },
    {
        "source_sentence": "父母聞已，當由未信。",
        "translation": "After their parents hear it, they must have believed it because they didn't believe it.",
        "source": "T23n1447_001:1052a02_28"
    },
    {
        "source_sentence": "其長者子自往家中，作謦咳聲。",
        "translation": "The elder's son went home on his own and made a noise of coughing.",
        "source": "T23n1447_001:1052a02_29"
    },
    {
        "source_sentence": "父母猜覺，乃知是子，即抱子頭，號聲大哭。",
        "translation": "The parents suspected that he was the boy and knew it. They embraced him by touching his head and cried aloud in tears.",
        "source": "T23n1447_001:1052a03_30"
    },
    {
        "source_sentence": "父母先盲，因哭眼膜除，得見子面。",
        "translation": "His parents had previously been blind, so they cried out and removed their eyes and membranes to allow them to see the face of their child.",
        "source": "T23n1447_001:1052a04_31"
    },
    {
        "source_sentence": "時長者子白父母：「我欲出家，願見賜許。」",
        "translation": "The elder son then said to his parents, I want to leave home, and I'd like to see you give me permission.",
        "source": "T23n1447_001:1052a05_32"
    },
    {
        "source_sentence": "父母告曰：「比者為汝眼目雙盲，我等命存已來，不得出家，二俱死後隨汝所欲。」",
        "translation": "The parents told him, That's because your eyes and eyes are both blind, and since our lives have survived, we won't be allowed to leave home; after they both die, we'll follow your wishes.",
        "source": "T23n1447_001:1052a06_33"
    },
    {
        "source_sentence": "時長者子雖復在家，而常學讀誦，遂證預流果。",
        "translation": "Although the wealthy man's son was still at home, he always studied and recited it, and he then realized the fruit of stream-winner.",
        "source": "T23n1447_001:1052a08_0"
    },
    {
        "source_sentence": "復為父母說四真諦法，父母聞已以慧金剛杵，摧破二十種薩迦耶見山證預流果。",
        "translation": "Again, he taught his parents the Dharma of the four true truths, and when they heard them, they used the vajra of wisdom to destroy 20 kinds of mountains of saṃghâya views and realize the fruit of stream-winner.",
        "source": "T23n1447_001:1052a09_1"
    },
    {
        "source_sentence": "於後父母二俱身亡。",
        "translation": "Later, both his parents died.",
        "source": "T23n1447_001:1052a10_2"
    },
    {
        "source_sentence": "于時長者子悲愁離別戀父母故，廣行布施修諸福業已，往詣聖者迦多演那所，",
        "translation": "“Then the wealthy man’s son, overcome with sorrow and grief because of his separation from his parents, having practiced generosity extensively and performed meritorious deeds, approached the holy Kātyāyana.",
        "source": "T23n1447_001:1052a11_3"
    },
    {
        "source_sentence": "頭面頂禮白言：「聖者！",
        "translation": "He bowed his head and face at the top of his head and said, Sage!",
        "source": "T23n1447_001:1052a13_4"
    },
    {
        "source_sentence": "願於善說法律中而為出家，修行梵行并受近圓。」",
        "translation": "May I become a renunciant in the midst of well-explained dharmas, cultivate the religious practice, and experience near completion.",
        "source": "T23n1447_001:1052a13_5"
    },
    {
        "source_sentence": "爾時聖者既觀察已，即與億耳出家，而為求寂證一來果。",
        "translation": "After observing it, the noble person then left home with myriad ears and realized the fruit of the once-returner in order to seek quiescence.",
        "source": "T23n1447_001:1052a14_6"
    },
    {
        "source_sentence": "時彼住處，是其邊地，少有苾芻，難得受具且為求寂。",
        "translation": "At the time, their dwelling place was a marginal place where there were few monks who didn't have difficulty receiving the precepts and seeking quiescence.",
        "source": "T23n1447_001:1052a16_7"
    },
    {
        "source_sentence": "所有求寂行法悉已教之，證不還果。",
        "translation": "They've all taught them the method of seeking quiescence, and they've realized the fruit of nonreturning.",
        "source": "T23n1447_001:1052a17_8"
    },
    {
        "source_sentence": "諸佛常法歲二大會，一切苾芻悉皆來集。",
        "translation": "All the monks of the Buddha's eternal Dharma yearly assembly gathered here.",
        "source": "T23n1447_001:1052a18_9"
    },
    {
        "source_sentence": "言二時者，所為春末及以夏後。",
        "translation": "The term two seasons refers to the end of spring and after the summer.",
        "source": "T23n1447_001:1052a19_10"
    },
    {
        "source_sentence": "凡有大小聲聞等眾，普皆雲集。",
        "translation": "Wherever there were great and small śrāvakas and so forth, they all gathered together like a cloud.",
        "source": "T23n1447_001:1052a19_11"
    },
    {
        "source_sentence": "具壽聖者迦多演那弟子，及諸苾芻等，在於餘處三月安居。",
        "translation": "The sage Kauśinagara, the disciples of Kātyāyana and the monks stayed in other places for three months.",
        "source": "T23n1447_001:1052a20_12"
    },
    {
        "source_sentence": "安居既竟洗浣衣訖，著衣持鉢漸漸遊行，往婆索婆村，方滿十眾。",
        "translation": "After he had finished washing and washing his clothes, he put on his robes, took his bowl, and gradually traveled to the village of Vasubandhu, where there were ten people in attendance.",
        "source": "T23n1447_001:1052a21_13"
    },
    {
        "source_sentence": "時聖者迦多演那，即與億耳近圓。",
        "translation": "The sage Kātyāyana then approached him with a hundred million ears.",
        "source": "T23n1447_001:1052a23_14"
    },
    {
        "source_sentence": "既近圓已，所有律行悉皆教學，斷諸煩惱證無學果。",
        "translation": "Once they're nearing completion, all the restraints and practices of discipline are taught, cutting off afflictions, and realizing the fruit of post-learning.",
        "source": "T23n1447_001:1052a24_15"
    },
    {
        "source_sentence": "既獲果已，堪受人天上妙供養，如上廣說。",
        "translation": "Having obtained the fruit, they're capable of receiving marvelous offerings from humans and gods as explained above.",
        "source": "T23n1447_001:1052a25_16"
    },
    {
        "source_sentence": "時諸苾芻等，往聖者迦多演那所白言：「大德！",
        "translation": "The monks and others then went to the noble Kātyāyana and said, Mañjuśrī!",
        "source": "T23n1447_001:1052a26_17"
    },
    {
        "source_sentence": "比住此間，供養聖者，所有事法悉皆作了，今欲禮覲大師世尊。」",
        "translation": "It's better to stay here and make offerings to the noble one, who has accomplished all his duties and dharmas, and now I want to pay homage to the Bhagavān, the great teacher.",
        "source": "T23n1447_001:1052a27_18"
    },
    {
        "source_sentence": "聖者報言：「善哉隨去！」",
        "translation": "The sage replied, Good, go along!",
        "source": "T23n1447_001:1052a28_19"
    },
    {
        "source_sentence": "既蒙許已，嚴持衣鉢，往室羅筏城。",
        "translation": "Having received the king’s permission, Śāriputra carried his robe and bowl in a proper manner and proceeded to the city of Śrāvastī.",
        "source": "T23n1447_001:1052a29_20"
    },
    {
        "source_sentence": "于時聖者億耳從坐而起，整衣服合掌恭敬，白迦多演那言：「鄔波馱耶！",
        "translation": "The noble monk then stood up from his seat with myriad ears, straightened his clothes, joined his palms in respect, and said to Kātyāyana, Upāsāya!",
        "source": "T23n1447_001:1052a29_21"
    },
    {
        "source_sentence": "我有諮白，願見聽許。",
        "translation": "I have something to ask for your permission. May I see and hear?",
        "source": "T23n1447_001:1052b02_22"
    },
    {
        "source_sentence": "我今但見鄔波馱耶，未見世尊。",
        "translation": "Now, I've only seen Upadaya, but not the Bhagavān.",
        "source": "T23n1447_001:1052b02_23"
    },
    {
        "source_sentence": "雖見法身，未見色身。",
        "translation": "Even though they see the Dharma body, they don't see the form body.",
        "source": "T23n1447_001:1052b03_24"
    },
    {
        "source_sentence": "若親教聽我見如來色身相好者，今亦欲去。」",
        "translation": "If you were to personally teach and hear me see the Tathāgata's physical appearance and features, I'd like to leave now as well.",
        "source": "T23n1447_001:1052b04_25"
    },
    {
        "source_sentence": "是時聖者迦多演那告億耳曰：「諸佛如來，難可得見。",
        "translation": "The sage Kātyāyana then addressed Kauṇḍinya, saying, It's difficult to see the buddha-tathāgatas.",
        "source": "T23n1447_001:1052b05_26"
    },
    {
        "source_sentence": "時久乃逢，如鄔曇花。",
        "translation": "It's a long time before they meet, like the udumbara flower.",
        "source": "T23n1447_001:1052b06_27"
    },
    {
        "source_sentence": "汝今欲去，宜可知時。」",
        "translation": "Now that you want to leave, it's a good idea to know the time.",
        "source": "T23n1447_001:1052b06_28"
    },
    {
        "source_sentence": "迦多演那告言：「汝至世尊所，代我頭面禮足問訊世尊：『少病少惱，",
        "translation": "Kātyāyana said to him, “Come to the place where the World-honored One is. On my behalf, greet him by bowing one’s forehead and feet:",
        "source": "T23n1447_001:1052b07_29"
    },
    {
        "source_sentence": "起居輕利安樂住不？』",
        "translation": "Does he give rise to the abode of lightness and comfort and live in peace?'",
        "source": "T23n1447_001:1052b08_30"
    },
    {
        "source_sentence": "并持五事往白世尊：『婆索婆村，地是邊國，有欲近圓，十眾難得。",
        "translation": "They also brought five items to the World-honored One and said: The village of Vasubandhu is a frontier country, where it is difficult to find ten kinds of religious devotees.",
        "source": "T23n1447_001:1052b09_31"
    },
    {
        "source_sentence": "又彼國人常以水澡洗為淨。",
        "translation": "Furthermore, the people of that country always bathe and wash with water as purity.",
        "source": "T23n1447_001:1052b10_32"
    },
    {
        "source_sentence": "其地堅鞕，牛若行時有脚迹，不同諸國地土柔軟。",
        "translation": "The land is hard and rough, and there are footprints on the ground when an ox walks, which are different from those of other countries and lands in that it's soft and supple.",
        "source": "T23n1447_001:1052b11_33"
    },
    {
        "source_sentence": "又東國人用如是臥具，所謂羖羊皮、鹿皮、牛皮等。",
        "translation": "The people of the eastern countries use such bedding, which is made of woolen sheep skin, deer skin, ox skin, cow skin, and so forth.",
        "source": "T23n1447_001:1052b12_34"
    },
    {
        "source_sentence": "若有苾芻，與餘苾芻送衣，聞有衣來，而未入手，恐犯過十日捨罪，不知云何？",
        "translation": "If a monk sends his robe to another monk and hears that a robe is coming but doesn't get it, he's afraid he'll commit the offense for more than ten days without knowing what it will be.",
        "source": "T23n1447_001:1052b13_35"
    },
    {
        "source_sentence": "將此請緣具白世尊，世尊有教，我敬奉行。』」",
        "translation": "I'll explain this invitation to the Bhagavān in detail, and the Bhagavān has taught it, so I respectfully follow it.'",
        "source": "T23n1447_001:1052b15_36"
    },
    {
        "source_sentence": "是時億耳一心專念，既辭師已，其夜在彼村宿，至明清旦，著衣持鉢漸漸遊行。",
        "translation": "After leaving his teacher, he spent the night in that village. At dawn and at dusk, he put on his robes, took his bowl, and gradually wandered about until dawn.",
        "source": "T23n1447_001:1052b16_37"
    },
    {
        "source_sentence": "乞食已訖，至於食後，別其主人，還臥具竟，執持衣鉢，往室羅筏城，",
        "translation": "Having finished begging for food, he went to the city of Śrāvastī at the end of the day. As soon as he had eaten, he dismissed his host and returned home with his bedding.",
        "source": "T23n1447_001:1052b17_38"
    },
    {
        "source_sentence": "隨路而去。",
        "translation": "He followed the road and departed.",
        "source": "T23n1447_001:1052b19_39"
    },
    {
        "source_sentence": "經諸村落，方達彼城至逝多林，安置衣鉢洗手足訖，即往頂禮世尊。",
        "translation": "Going through various villages, they then reached the city and went to Jeta's Grove, placed their robes, bowls, and feet, washed their hands and feet, and went there to pay homage to the Bhagavān.",
        "source": "T23n1447_001:1052b19_40"
    },
    {
        "source_sentence": "爾時世尊為諸四眾及諸天、龍、鬼神、國王、大臣、沙門、婆羅門等說法。",
        "translation": "It was then that the Bhagavān taught the Dharma to the fourfold assembly of gods, dragons, ghost spirits, kings, ministers, ascetics, and brāhmaṇas.",
        "source": "T23n1447_001:1052b21_41"
    },
    {
        "source_sentence": "佛既遙見億耳從遠方來，而告阿難陀曰：「可於房內與敷億耳床褥臥具。」",
        "translation": "Seeing from a distance that hundred million ears had come from a distant place, the Buddha told Ānanda, You can give me a hundred million ear-beds, bedding, and bedding in my room.",
        "source": "T23n1447_001:1052b22_42"
    },
    {
        "source_sentence": "阿難奉教，即往敷床臥具。",
        "translation": "Ānanda obeyed the instruction, he went to spread out his bed and bedding.",
        "source": "T23n1447_001:1052b24_43"
    },
    {
        "source_sentence": "既敷設已白世尊曰：「願聖知時。」",
        "translation": "After laying out the bed, he said to the Bhagavān, May the noble one know the time.",
        "source": "T23n1447_001:1052b24_44"
    },
    {
        "source_sentence": "佛既洗足入於房內，右脇而臥，兩足相壘，作光明相，正念當起如是作意。",
        "translation": "When the Buddha had washed his feet, he entered the room, lay down on his right side, and padded his legs with both feet pressed together to make a shining sign, and correctly thought that such thoughts would arise.",
        "source": "T23n1447_001:1052b25_45"
    },
    {
        "source_sentence": "爾時億耳，於寺門外，洗足已入房安置，同前右脇而臥，作光明相，念當早起。",
        "translation": "At the time, Bālāditya was outside the monastery's entrance, bathed his feet, entered his room, and lay down on his right side as before, making a shining sign to think he would get up early.",
        "source": "T23n1447_001:1052b27_46"
    },
    {
        "source_sentence": "如是作意，而於夜中，竟無言語，默然而住。",
        "translation": "In the middle of the night he did not utter a word and remained silent.",
        "source": "T23n1447_001:1052b29_0"
    },
    {
        "source_sentence": "夜欲已過，億耳即便結跏趺坐，直身定意，正念現前。",
        "translation": "After the night had passed, he sat cross-legged with his ears closed and his body straightened in concentration. His thoughts were clearly visible before him.",
        "source": "T23n1447_001:1052b29_1"
    },
    {
        "source_sentence": "佛告億耳苾芻：「汝可誦我所說經律，如我成道所說之者。」",
        "translation": "The Buddha told the billion-eyed monks, You may recite the sūtras and vinaya that I teach, just as I taught them when I became a buddha.",
        "source": "T23n1447_001:1052c02_2"
    },
    {
        "source_sentence": "即教誦經，億耳既誦經已，佛即讚言：「善哉，善哉！",
        "translation": "He then taught them to recite the sūtras, and when they had recited the sūtras with a hundred million ears, the Buddha praised them, saying, Good, good!",
        "source": "T23n1447_001:1052c03_3"
    },
    {
        "source_sentence": "汝所誦經極為清淨微妙。」",
        "translation": "The sūtras you recite are extremely pure and subtle.",
        "source": "T23n1447_001:1052c04_4"
    },
    {
        "source_sentence": "時億耳即作是念：「鄔波馱耶！",
        "translation": "Myriad ears then had this thought, Upāsaka!",
        "source": "T23n1447_001:1052c05_5"
    },
    {
        "source_sentence": "令我請者，今正是時。",
        "translation": "It's now the right time to ask me to do so.",
        "source": "T23n1447_001:1052c05_6"
    },
    {
        "source_sentence": "如鄔波馱耶所問之事，今應請之。」",
        "translation": "As Upāsaka asked, you should now ask him to do so.",
        "source": "T23n1447_001:1052c06_7"
    },
    {
        "source_sentence": "作是念已，即從座起，頂禮佛足白言：「大德！",
        "translation": "After this thought, he rose from his seat, bowed his head at the Buddha's feet, and said, Mañjuśrī!",
        "source": "T23n1447_001:1052c06_8"
    },
    {
        "source_sentence": "我住處阿濕婆蘭德伽國婆索婆村，其地邊方，彼有聖者迦多演那，是親教師，",
        "translation": "I live in the village of Vasubandhu in the country of Asvarūpa. On the peripheral flank of that village there lives a holy man named Kasyapa, who is my personal teacher.",
        "source": "T23n1447_001:1052c07_9"
    },
    {
        "source_sentence": "稽首頂禮佛足，問訊世尊：『少病少惱，起居輕利安樂住不？",
        "translation": "He bowed his head at the Buddha’s feet and greeted the World-honored One, saying: O World-honored One, are you living in peace and comfort with little illness and little discomfort?",
        "source": "T23n1447_001:1052c09_10"
    },
    {
        "source_sentence": "并以五事請問世尊：彼國是邊地，十眾近圓極為難得。",
        "translation": "He also asked the Bhagavān five questions: That country is a marginal land, and it's difficult to attain the nearness of ten congregations.",
        "source": "T23n1447_001:1052c10_11"
    },
    {
        "source_sentence": "又彼國人，常以洗浴，以為清淨。",
        "translation": "Also, the people of that country always bathe themselves to make sure they are pure.",
        "source": "T23n1447_001:1052c12_12"
    },
    {
        "source_sentence": "彼國地土，極惡堅硬，牛蹋足迹，日曬乾已，人行不得，不同餘國。",
        "translation": "The soil of that country is extremely bad and hard, with the footprints of an ox stepping on it. When the sun has dried it up, no one can walk there; they are not the same as in other countries.",
        "source": "T23n1447_001:1052c12_13"
    },
    {
        "source_sentence": "彼國常用如是臥具：毛蓐、羊皮、鹿皮、牛皮、羖羊皮，以為臥具。",
        "translation": "That country always uses such bedding: woolen woolen blankets made of woolen cloth, sheep skin, deer skin, ox skin, mucus skin, and sheep skin as bedding.",
        "source": "T23n1447_001:1052c14_14"
    },
    {
        "source_sentence": "若苾芻與餘苾芻送衣，聞有衣來，而未入手，過十日，恐成犯捨，不知云何？』」",
        "translation": "If a monk sends his robe to another monk and hears that a robe comes along but doesn't obtain it before ten days have passed, he's afraid he'll violate the rules and won't know what to do.'",
        "source": "T23n1447_001:1052c15_15"
    },
    {
        "source_sentence": "佛告億耳苾芻：「汝所問者，今非是時，我今不說，且置是事。",
        "translation": "The Buddha told Kauṇḍinya Bhikṣu, What you're asking is not the right time now; I won't explain it now, so let's leave this matter alone.",
        "source": "T23n1447_001:1052c17_16"
    },
    {
        "source_sentence": "當於眾中問，我於大眾之中為汝決疑。」",
        "translation": "You should ask questions in the assembly, and I'll resolve your doubts for you in the assembly.",
        "source": "T23n1447_001:1052c18_17"
    },
    {
        "source_sentence": "既至平旦，佛即起來，眾中就座而坐。",
        "translation": "When he arrived at dawn, the Buddha rose and took his seat in the midst of the assembly.",
        "source": "T23n1447_001:1052c19_18"
    },
    {
        "source_sentence": "佛既坐已，時億耳苾芻即從座起，整理衣服合掌頂禮世尊，白言：「東方邊國婆索婆聚落，",
        "translation": "After the Buddha had taken his seat, the monk Kauśinagara rose from his seat, arranged his clothes, joined his palms and bowed his head in respect to the World-honored One, and said:",
        "source": "T23n1447_001:1052c20_19"
    },
    {
        "source_sentence": "聖者迦多演那在彼而住，是我鄔波馱耶，頭面禮佛足，問訊世尊：『少病少惱、起居輕利、安樂住不？",
        "translation": "The holy Kātyāyana was staying there. This is Upādayana. He bowed his forehead at the Buddha’s feet and greeted the World-honored One, saying:",
        "source": "T23n1447_001:1052c22_20"
    },
    {
        "source_sentence": "彼國邊方，欲受近圓，十眾難得。",
        "translation": "At the border of that country, it's hard for ten people to get close to a perfect completion if they want to receive it.",
        "source": "T23n1447_001:1052c24_21"
    },
    {
        "source_sentence": "彼國人民，常以水洗浴，便為清淨。",
        "translation": "The people of that country always wash and bathe with water, and it becomes pure.",
        "source": "T23n1447_001:1052c25_22"
    },
    {
        "source_sentence": "國內地土極為堅硬，牛行蹋地足迹，日曬乾已，人行不得，不同餘國。",
        "translation": "The soil of the native land is extremely hard and there are traces of ox-following footprints on the ground. When the sun has dried it up, no one can walk on it, unlike in other countries.",
        "source": "T23n1447_001:1052c26_23"
    },
    {
        "source_sentence": "國法復用如是臥具，所謂羊毛、羊皮、鹿、牛、羖羊等皮，以為臥具。",
        "translation": "The national law also uses such bedding, which is called woolen wool, sheep skin, deer, ox, cow, mules, sheep skin, etc., as bedding.",
        "source": "T23n1447_001:1052c27_24"
    },
    {
        "source_sentence": "有苾芻遣信與苾芻衣，聞有衣來，其衣未至，便過十日，恐犯捨墮，不知云何？』」",
        "translation": "A monk sends a letter to give the monk's robe and hears that a robe has come, but before his robe arrives, it's more than ten days away, so he's afraid of violating or abandoning it; he doesn't know what it is.'",
        "source": "T23n1447_001:1052c29_0"
    },
    {
        "source_sentence": "爾時世尊以此因緣，告諸苾芻曰：「從今已後，聽諸苾芻，於邊方國，",
        "translation": "It was then that the World-honored One, on account of this causality, addressed the monks: From now on, I will allow you, bhikṣus, to remain in my country.",
        "source": "T23n1447_001:1053a01_1"
    },
    {
        "source_sentence": "持律苾芻五人，得為近圓。",
        "translation": "The five monks who uphold the precepts attain near perfect enlightenment.",
        "source": "T23n1447_001:1053a03_2"
    },
    {
        "source_sentence": "邊方地土惡處，開著一重革屣，不得二重、三重，底若穿破應補。",
        "translation": "In a bad place on the peripheral land, he opens a pair of leather sandals and doesn't get two or three pairs; if he breaks them, he should make up for it.",
        "source": "T23n1447_001:1053a03_3"
    },
    {
        "source_sentence": "若苾芻遣信送衣與餘苾芻，彼未得衣，無犯捨罪。」",
        "translation": "If a monk sends his robe to another monk with a letter and gives it to him, he won't be guilty of the offense of giving up his robe if he doesn't obtain it.",
        "source": "T23n1447_001:1053a05_4"
    },
    {
        "source_sentence": "時具壽鄔波離在於眾中，從座而起整理衣服，合掌白佛言：「世尊大德！",
        "translation": "Kauśāmbī Upāli then rose from his seat in the midst of the crowd, arranged his clothes, joined his palms together, and said to the Buddha, Bhagavān!",
        "source": "T23n1447_001:1053a06_5"
    },
    {
        "source_sentence": "向開邊方持律五人近圓，不知從何處以來是邊方處？」",
        "translation": "He's facing east to open the side of the five people who uphold the precepts and are close to their completion, but he doesn't know where they came from or where they came from.",
        "source": "T23n1447_001:1053a07_6"
    },
    {
        "source_sentence": "佛言：「從此東方，有奔荼林，彼有水，名曰奔荼，從此已去名為邊國。",
        "translation": "The Buddha said: To the east of here is a forest called Puṇḍaparvata, where there is a body of water called Puṇḍaparvata.",
        "source": "T23n1447_001:1053a09_7"
    },
    {
        "source_sentence": "南方有國，名攝伐羅佛底，有水亦名攝伐羅佛底，從此已外亦名邊方。",
        "translation": "To the south, there's a country named Śavarabuddhi, which has water and is also called Śavarabuddhi, and from here on outward it's also called Boundless.",
        "source": "T23n1447_001:1053a10_8"
    },
    {
        "source_sentence": "西方有國，名窣吐奴，鄔波窣吐奴婆羅門村此外名邊方。",
        "translation": "In the west, there's a country named Kauṣṭhila, and the Brāhmaṇa village of Upagupta is also called Boundless.",
        "source": "T23n1447_001:1053a12_9"
    },
    {
        "source_sentence": "北方有山，名嗢尸羅，此山之外，名曰邊方。」",
        "translation": "To the north, there's a mountain named Kauśīla, and beyond that mountain is called Bodhidharma.",
        "source": "T23n1447_001:1053a13_10"
    },
    {
        "source_sentence": "諸苾芻等生疑，白佛言：「世尊！",
        "translation": "The monks and others had doubts and said to the Buddha, Bhagavān!",
        "source": "T23n1447_001:1053a14_11"
    },
    {
        "source_sentence": "此億耳苾芻，曾作何業？",
        "translation": "What did this billion ear monk do in the past?",
        "source": "T23n1447_001:1053a15_12"
    },
    {
        "source_sentence": "生大富貴家，財寶無量，於母胎中，耳上自然有此妙寶耳璫，價直無量。",
        "translation": "He was born in a house of great wealth and prosperity, possessing immeasurable riches and treasures. In his mother’s womb the embryo naturally had on its ear lobe this beautiful jeweled earring ring, worth immeasurable in value.",
        "source": "T23n1447_001:1053a15_13"
    },
    {
        "source_sentence": "復得出家近圓，不見世尊得無學果，斷除煩惱。」",
        "translation": "Again, when he leaves home and approaches completion, he doesn't see the Bhagavān attain the fruit of post-learning and stops his afflictions.",
        "source": "T23n1447_001:1053a17_14"
    },
    {
        "source_sentence": "佛告諸苾芻：「此億耳苾芻，先所作業，自作自受。",
        "translation": "The Buddha told the monks, These hundred million ears of monks did their previous actions for themselves and received them for themselves.",
        "source": "T23n1447_001:1053a18_15"
    },
    {
        "source_sentence": "因緣會遇，如暴水流，決定須受。",
        "translation": "When they are encountered by causes and conditions, it's like a sudden stream of water that must surely be experienced.",
        "source": "T23n1447_001:1053a19_16"
    },
    {
        "source_sentence": "今始會遇，合受斯報，亦非地水火風能令有壞果報，身必自受。",
        "translation": "Because earth, water, fire, and wind are not capable of causing the retributive result of disintegration. The body necessarily experiences it itself.",
        "source": "T23n1447_001:1053a20_17"
    },
    {
        "source_sentence": "「『假令經百劫，　　所作業不亡，",
        "translation": "'Even if it were to pass for a hundred eons, Their actions wouldn't perish.",
        "source": "T23n1447_001:1053a21_18"
    },
    {
        "source_sentence": "　　因緣會遇時，　　果報還自受。』」",
        "translation": "When the causes and conditions meet, the result will be self-accompanied.'",
        "source": "T23n1447_001:1053a21_18"
    },
    {
        "source_sentence": "如有頌云：告諸苾芻曰：「乃往過去，於此賢劫中人壽二萬歲時，有佛出世，",
        "translation": "The Buddha said to the bhikṣus: In the past, when the human life span in this world was twenty thousand years in length during the Bhadrakalpa, a buddha appeared in the world.",
        "source": "T23n1447_001:1053a21_18"
    },
    {
        "source_sentence": "號迦攝波如來，十號具足，住波羅痆斯國仙人墮處施鹿林中。",
        "translation": "He was named Kāśyapa Tathāgata, fully endowed with the ten epithets, and he lived in the Deer Forest of Giving place to the Sage of Vārāṇasī.",
        "source": "T23n1447_001:1053a25_19"
    },
    {
        "source_sentence": "其國有王，名訖里伽，而為王化，人民熾盛，飲食豐足，無諸衰患，悉皆安樂。",
        "translation": "In that country there was a king named Kālīyaka, who transformed himself into a king. The people prospered and the food and drink were plentiful without any decline or distress, and everyone lived in peace and happiness.",
        "source": "T23n1447_001:1053a26_20"
    },
    {
        "source_sentence": "無賊無畏，一切具足，無所乏少，以法治世。",
        "translation": "They have no thieves and no fear, are fully endowed with everything, and have nothing to lack in order to rule the world.",
        "source": "T23n1447_001:1053a28_21"
    },
    {
        "source_sentence": "彼王有子，名曰善生，立為太子。",
        "translation": "The king had a son named Shansheng, who was installed as the prince.",
        "source": "T23n1447_001:1053a29_22"
    },
    {
        "source_sentence": "時迦攝波如來化緣既畢，如薪盡火滅而入涅槃。",
        "translation": "After the Tathāgata Kāśyapa had completed his transformational conditions, he entered nirvāṇa like a fire burning out of wood when its fire went out.",
        "source": "T23n1447_001:1053b01_23"
    },
    {
        "source_sentence": "時訖里伽王即取香木以用荼毘，又用牛乳滅火，收拾設利羅，用四種寶造瓶，",
        "translation": "The king of Kaḷāraka then took the incense wood and mixed it with dabhi, extinguished the fire with cow’s milk, stored up the relics, and made a pot out of four kinds of precious substances.",
        "source": "T23n1447_001:1053b02_24"
    },
    {
        "source_sentence": "於四衢中起七寶塔，安置設利羅，高一俱盧舍。",
        "translation": "In the four quarters of the city a seven-jeweled stupa was built to place the relics, one krośa in height.",
        "source": "T23n1447_001:1053b04_25"
    },
    {
        "source_sentence": "其國東境所有貢物，盡施於塔。",
        "translation": "In the eastern part of the kingdom, all the tribute goods he gave to the stupa were given in full.",
        "source": "T23n1447_001:1053b05_26"
    },
    {
        "source_sentence": "後時其王命終，便立太子為王，即與諸大臣等共撿庫藏其物多少。",
        "translation": "Later, when the king's life ended, he appointed the prince as king and shared with his ministers the amount of what was stored in the treasury.",
        "source": "T23n1447_001:1053b05_27"
    },
    {
        "source_sentence": "并見國之東境所出貢物，悉施於塔。",
        "translation": "They also saw all the tribute that had been offered to the stupa from the eastern part of the empire.",
        "source": "T23n1447_001:1053b07_28"
    },
    {
        "source_sentence": "諸臣白王：『先有王所施塔之物，應還取不？』",
        "translation": "The ministers said to the king, 'There was previously something that the king gave to the stūpa, so should he take it back?'",
        "source": "T23n1447_001:1053b08_29"
    },
    {
        "source_sentence": "新王答曰：『我父先王所作之事，如釋梵天王，我今豈敢還取斯物。』",
        "translation": "The new king answered, 'The things my father did as a former king are like the Śākyamuni and Brahmā kings, so why would I dare to take them back now?'",
        "source": "T23n1447_001:1053b09_30"
    },
    {
        "source_sentence": "然諸臣等皆不信樂佛法，共作是念：『我今當設方便，施塔之物悉還收取。』",
        "translation": "Still, the ministers and others didn't believe in the Buddha's teaching and thought together, 'Now, I will set up a method to collect all the things that are given to the stūpa.'",
        "source": "T23n1447_001:1053b10_31"
    },
    {
        "source_sentence": "即閉城東門，所有財物皆悉不入，其塔彩色脫落，並皆破壞。",
        "translation": "He then closed the east gate of the city and didn't enter any of his possessions, and the stūpa's color escaped and fell apart, all destroying it.",
        "source": "T23n1447_001:1053b12_32"
    },
    {
        "source_sentence": "「北方有一商主，將諸商人來至此國，於塔傍住。",
        "translation": "To the north, there's a merchant lord who brings his merchants to this country and lives beside the stūpa.",
        "source": "T23n1447_001:1053b13_33"
    },
    {
        "source_sentence": "爾時商主塔所禮敬，見塔破壞，復見一女人，無有男女灑掃供養。",
        "translation": "At the time, the merchant owner of the stūpa paid homage to him and saw that the stūpa was destroyed, and he also saw a woman with no men or women to clean it up and make offerings.",
        "source": "T23n1447_001:1053b14_34"
    },
    {
        "source_sentence": "然彼女人，既見迦攝波如來、應、正等覺，於彼佛所發心受學。",
        "translation": "Still, seeing the Kāśyapa Tathāgata, Arhat, and Completely Enlightened One, that woman arouses the mind to train with those buddhas.",
        "source": "T23n1447_001:1053b16_35"
    },
    {
        "source_sentence": "商主問女曰：『此是誰塔？』",
        "translation": "The merchant owner asked the woman, 'Whose stūpa is this?'",
        "source": "T23n1447_001:1053b17_36"
    },
    {
        "source_sentence": "女便廣說因緣：『此是迦攝波佛塔。』",
        "translation": "The woman then explained the causes and conditions in detail, saying, 'This is the stūpa of Kāśyapa Buddha.'",
        "source": "T23n1447_001:1053b18_37"
    },
    {
        "source_sentence": "商主聞已，心生歡喜，即脫耳璫奉彼女人，令賣取直用修營塔：『我若迴還，",
        "translation": "Having heard this, the merchant owner was overjoyed. Hearing it, he took off his earrings and presented them to the woman’s maidservant, telling her to sell and repair the stupa for her own use:",
        "source": "T23n1447_001:1053b18_38"
    },
    {
        "source_sentence": "當更布施。』",
        "translation": "I'll give it again.'",
        "source": "T23n1447_001:1053b20_39"
    },
    {
        "source_sentence": "女人得已，即便莊嚴。",
        "translation": "After she had obtained it, the woman adorned it.",
        "source": "T23n1447_001:1053b20_40"
    },
    {
        "source_sentence": "商主迴還，到彼塔邊瞻仰無盡，即便發心，更造寶蓋幢幡以用供養，如是發願：『我今供養此迦攝波如來塔所有善根，",
        "translation": "When the merchant leader returned home, he went to the side of the stupa and looked up at it endlessly. Then he made an intention to make offerings with jeweled canopies, banners, and streamers. In this way he made the following vow: I should now pay homage to the roots of virtue that are found in the stupas of the Tathāgata Kass",
        "source": "T23n1447_001:1053b21_41"
    },
    {
        "source_sentence": "願我當來生處，常得富貴尊高。",
        "translation": "May I always attain wealth and prosperity in my future birthplace.",
        "source": "T23n1447_001:1053b24_0"
    },
    {
        "source_sentence": "於當佛所，願得出家，斷除煩惱，證無學果。』」",
        "translation": "At the Buddha's place, I wish to leave home, cut off afflictions, and realize the fruit of post-learning.'",
        "source": "T23n1447_001:1053b24_1"
    },
    {
        "source_sentence": "佛告諸苾芻：「其商主者，豈異人乎？",
        "translation": "The Buddha told the monks, Is that a different person from the merchant lord?",
        "source": "T23n1447_001:1053b26_0"
    },
    {
        "source_sentence": "即此億耳苾芻是。",
        "translation": "That's this hundred million ear monks.",
        "source": "T23n1447_001:1053b26_1"
    },
    {
        "source_sentence": "由供養迦攝波佛塔故，生生常得富貴家生，於母胎中，便有寶耳璫珠自然在耳。",
        "translation": "As a result of making offerings to the Kāśyapa Buddha's stūpa, he'll always be born in a wealthy family when he's born, and his precious ear is naturally present in his mother's womb with a jeweled ear-shaped pearl in his ear.",
        "source": "T23n1447_001:1053b27_2"
    },
    {
        "source_sentence": "復願當來出家，斷除煩惱，得阿羅漢果。",
        "translation": "I also wish to renounce the householder’s life in the future, eradicate defilements, and attain arhatship.",
        "source": "T23n1447_001:1053b29_0"
    },
    {
        "source_sentence": "復於母所，出惡言故，由斯業力，見諸地獄。」",
        "translation": "Again, because he spoke bad words at his mother's place, he saw the hells because of the power of this action.",
        "source": "T23n1447_001:1053b29_1"
    },
    {
        "source_sentence": "佛告諸苾芻：「若作白業得白果報，若作黑業得黑報，雜業雜報。",
        "translation": "The Buddha told the monks, If you do white actions, you'll attain white results; if you do black actions, you'll attain black results; and if you do mixed actions, you'll have mixed results.",
        "source": "T23n1447_001:1053c02_0"
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T23n1447_001:1053c03_1"
    },
    {
        "source_sentence": "當離雜、黑業，當修白業。」",
        "translation": "You must part with mixed and black karma and cultivate white karma.",
        "source": "T23n1447_001:1053c03_2"
    },
    {
        "source_sentence": "告諸苾芻：「此是我教。」",
        "translation": "He told the monks, This is my teaching.",
        "source": "T23n1447_001:1053c04_3"
    },
    {
        "source_sentence": "諸苾芻等聞佛說已，歡喜奉行。",
        "translation": "Having heard the Buddha’s discourse, the bhikṣus were delighted and remembered it well. ****** 13.",
        "source": "T23n1447_001:1053c04_4"
    },
    {
        "source_sentence": "根本說一切有部毘奈耶皮革事卷上",
        "translation": "Mūlasarvâstivāda-vinaya leather deeds of the Sarvâstivāda school",
        "source": "T23n1447_001:1053c06_0"
    }
]