[
    {
        "source_sentence": "根本說一切有部苾芻尼毘奈耶",
        "translation": "Mūlasarvâstivāda Bhikṣuṇī-vinaya",
        "source": "T23n1443_010:0957c24_0"
    },
    {
        "source_sentence": "卷第十",
        "translation": "Vol. 10",
        "source": "T23n1443_010:0957c25_0"
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yogâcārabhūmi in Sanskrit",
        "source": "T23n1443_010:0957c27_0"
    },
    {
        "source_sentence": "　捉金銀出納、　　賣買鉢乞線、",
        "translation": "grasping gold and silver, going out to accept it, selling bowls and begging for thread,",
        "source": "T23n1443_010:0957c28_0"
    },
    {
        "source_sentence": "　織師自奪衣、　　迴他病長鉢。",
        "translation": "The weaver took his own robe and turned it over to another's sick bowl for a long time.",
        "source": "T23n1443_010:0957c28_0"
    },
    {
        "source_sentence": "第二攝頌曰：捉寶學處第十一爾時薄伽梵在室羅伐城逝多林給孤獨園。",
        "translation": "The second collected verse says, Tenth, the place of training for grasping treasures At that time, the Bhagavān was staying at Anāthapiṇḍada Park in Jeta's Grove in Śrāvastī.",
        "source": "T23n1443_010:0957c28_0"
    },
    {
        "source_sentence": "時六眾苾芻，自手捉金銀、或教他捉，造作房舍、或置床座上。",
        "translation": "The six monks then grabbed gold and silver with their own hands, taught others to grab it, built a dwelling, or placed it on a bed or seat.",
        "source": "T23n1443_010:0958a04_0"
    },
    {
        "source_sentence": "時外道見生嫌賤言：「此沙門釋子，自手執捉金銀錢等、或教他捉。",
        "translation": "Seeing this, the non-Buddhist became disgusted and said, This is an ascetic or a son of the Śākyamuni who holds gold, silver, money, etc., in his own hand or teaches others to grasp them.",
        "source": "T23n1443_010:0958a05_1"
    },
    {
        "source_sentence": "廣說如上。",
        "translation": "It's explained in detail as above.",
        "source": "T23n1443_010:0958a06_2"
    },
    {
        "source_sentence": "諸餘俗人皆亦如是，斯與我等有何別處？",
        "translation": "The other laypeople are likewise. What is the difference between them and me?",
        "source": "T23n1443_010:0958a07_3"
    },
    {
        "source_sentence": "云何令他婆羅門居士等深生敬信，持諸飲食惠此禿人？」",
        "translation": "How does it cause other Brāhmaṇas and laymen to deeply respect and believe in this baldie by maintaining food and drink?",
        "source": "T23n1443_010:0958a08_0"
    },
    {
        "source_sentence": "苾芻白佛。",
        "translation": "The monks said to the Buddha.",
        "source": "T23n1443_010:0958a09_1"
    },
    {
        "source_sentence": "佛以此緣，同前集眾問實訶責，廣說乃至「制其學處，應如是說：「若復苾芻尼，",
        "translation": "For this reason, the Buddha shared the previous assembly of monks and nuns who had been questioned and reprimanded, explaining in detail up to the point where they were restrained from training, saying:",
        "source": "T23n1443_010:0958a09_2"
    },
    {
        "source_sentence": "自手捉金銀錢等、若教他捉，泥薩祇波逸底迦。」",
        "translation": "If he takes gold, silver coins, and so forth with his own hand and teaches others to take them, it's nirvāṇa-pāyattika.",
        "source": "T23n1443_010:0958a11_3"
    },
    {
        "source_sentence": "尼者，謂此法中尼。",
        "translation": "A nun refers to a nun in this teaching.",
        "source": "T23n1443_010:0958a12_4"
    },
    {
        "source_sentence": "自手捉者，謂以手捉。",
        "translation": "Grasping with one's own hand means grasping with one's hand.",
        "source": "T23n1443_010:0958a12_5"
    },
    {
        "source_sentence": "金銀者，謂金銀及貝齒。",
        "translation": "Gold and silver refers to gold, silver, and shellfish teeth.",
        "source": "T23n1443_010:0958a13_6"
    },
    {
        "source_sentence": "錢者，金等錢。",
        "translation": "A coin is money like gold and so forth.",
        "source": "T23n1443_010:0958a13_7"
    },
    {
        "source_sentence": "教人亦爾，皆犯捨墮。",
        "translation": "The same applies to the one who teaches. All are transgressing and falling in relation to what is abandoned.",
        "source": "T23n1443_010:0958a14_8"
    },
    {
        "source_sentence": "捨悔之法廣說如上。",
        "translation": "The method of renunciation and repentance is explained in detail as above.",
        "source": "T23n1443_010:0958a14_9"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_010:0958a15_10"
    },
    {
        "source_sentence": "若教他取時，其事不同有十八種，咸成其犯。",
        "translation": "When he teaches others to take it, there are 18 different kinds of things that make it a violation.",
        "source": "T23n1443_010:0958a15_11"
    },
    {
        "source_sentence": "　汝取此物，　　汝於此取，　　汝取此爾許！",
        "translation": "You grasp this thing, you grasp it here, and you grasp something like this!",
        "source": "T23n1443_010:0958a16_12"
    },
    {
        "source_sentence": "　汝將此物，　　汝於此將，　　汝將此爾許！",
        "translation": "Take this thing, and you'll take it here; take this as your general.",
        "source": "T23n1443_010:0958a16_12"
    },
    {
        "source_sentence": "　汝置此物，　　汝於此置，　　汝置此爾許！",
        "translation": "You put this thing here, you put it here, and you put it here so far!",
        "source": "T23n1443_010:0958a16_12"
    },
    {
        "source_sentence": "　汝取彼物，　　汝於彼取，　　汝取彼爾許！",
        "translation": "You grasp that thing, you grasp it, and you grasp it, and you grasp what's there.",
        "source": "T23n1443_010:0958a16_12"
    },
    {
        "source_sentence": "　汝將彼物，　　汝於彼將，　　汝將彼爾許！",
        "translation": "You'll take that thing, you'll take it, and you'll take it, and you'll take it so far away!",
        "source": "T23n1443_010:0958a16_12"
    },
    {
        "source_sentence": "　汝置彼物，　　汝於彼置，　　汝置彼爾許！",
        "translation": "You put that thing away, you put it there, and you put it there, and you put it so far away!",
        "source": "T23n1443_010:0958a16_12"
    },
    {
        "source_sentence": "謂告彼云：言汝取此物者，謂金銀等於可見處，教他取，得惡作罪，捉舉之時犯捨墮罪。",
        "translation": "It's telling them, saying, When you take this thing, it's the case that gold and silver are taught to be taken where they can be seen, which is the sin of bad action and the sin of equanimity when held up.",
        "source": "T23n1443_010:0958a16_12"
    },
    {
        "source_sentence": "言汝於此取者，謂於諸帒及鐵木等箱器之中，教他取物，得罪同前。",
        "translation": "When you say you take something here, it's the same as the previous offense of teaching someone else to take things in a box or container that's made of rags and iron or wood.",
        "source": "T23n1443_010:0958a24_13"
    },
    {
        "source_sentence": "已下諸句罪皆同此。",
        "translation": "The following sentences and sins are the same as these.",
        "source": "T23n1443_010:0958a26_14"
    },
    {
        "source_sentence": "言汝取爾許者，謂百千億等，教他取物。",
        "translation": "The expression 'taken by you' means to teach others to take things that are hundreds of thousands of millions and so forth.",
        "source": "T23n1443_010:0958a26_15"
    },
    {
        "source_sentence": "言汝將此物者，謂金銀等物，教他將來。",
        "translation": "When you say you'll take this thing, it means that gold and silver things will be taught to others in the future.",
        "source": "T23n1443_010:0958a27_16"
    },
    {
        "source_sentence": "言汝於此將者，謂於帒等箱器之中，教他取物。",
        "translation": "When you say you're general here, it means to tell someone else to take things from a box or container like a bowl.",
        "source": "T23n1443_010:0958a28_17"
    },
    {
        "source_sentence": "言汝將此爾許者，謂百千億等，教他取時。",
        "translation": "When you say you're going to take this amount, it means a hundred trillion and so forth when you teach others to take it.",
        "source": "T23n1443_010:0958a29_18"
    },
    {
        "source_sentence": "言汝置此物者，謂金銀等，教他置時。",
        "translation": "When you say you're putting this thing away, it means gold and silver, etc., when you teach others to put it away.",
        "source": "T23n1443_010:0958b01_19"
    },
    {
        "source_sentence": "言汝於此置者，謂於箱器等中，教安置時。",
        "translation": "When you say you put it here, it means to place it in a box, container, or so forth, and teach it to be placed there.",
        "source": "T23n1443_010:0958b02_20"
    },
    {
        "source_sentence": "言汝置此爾許者，謂百千億等，教他置時。",
        "translation": "When you say you've placed this amount here, it means a hundred thousand billion eons and so forth when you teach others to place it.",
        "source": "T23n1443_010:0958b03_21"
    },
    {
        "source_sentence": "此九皆據可見之處，教他作也。",
        "translation": "These nine are all based on the place where they can be seen and taught others to do them.",
        "source": "T23n1443_010:0958b04_22"
    },
    {
        "source_sentence": "言汝取彼物者，謂金銀等於不見處，教他取物，得惡作罪，捉舉之時犯捨墮罪。",
        "translation": "When you say you take those things, it means that gold and silver are invisible places, teach others to take things, commit the sin of misdeeds, and when you hold them up, you commit the sin of forfeiture.",
        "source": "T23n1443_010:0958b04_23"
    },
    {
        "source_sentence": "言汝於彼取者，謂於諸帒及鐵木等箱器之中，教他取物。",
        "translation": "When you say you're taking something from them, it means to teach others to take things from the boxes and containers made of wood or iron.",
        "source": "T23n1443_010:0958b06_24"
    },
    {
        "source_sentence": "言汝取彼爾許者，謂百千億等，教他取物。",
        "translation": "The expression 'taken by you' means to teach others to take things that are hundreds of thousands of millions and so forth.",
        "source": "T23n1443_010:0958b08_0"
    },
    {
        "source_sentence": "言汝將彼物者，謂金銀等物，教他將來。",
        "translation": "When you say you'll take those things, it means gold and silver, etc., and teach them to others in the future.",
        "source": "T23n1443_010:0958b08_1"
    },
    {
        "source_sentence": "言汝於彼將者，謂於帒等箱器之中，教他取物。",
        "translation": "When you say you're going there, it means to tell someone else to take things from a container like a bowl and so forth.",
        "source": "T23n1443_010:0958b09_2"
    },
    {
        "source_sentence": "言汝將彼爾許者，謂百千億等，教他取時。",
        "translation": "When you say you're going to take that amount, it means a hundred thousand koṭis of such things when you teach others to take them.",
        "source": "T23n1443_010:0958b10_3"
    },
    {
        "source_sentence": "言汝置彼物者，謂金銀等，教他置時。",
        "translation": "When you say you're putting that thing away, it means gold and silver, etc., when you teach others to put it away.",
        "source": "T23n1443_010:0958b11_4"
    },
    {
        "source_sentence": "言汝於彼置者，謂於箱器等中安置。",
        "translation": "When you say you're putting it there, it means placing it in a box or container.",
        "source": "T23n1443_010:0958b12_5"
    },
    {
        "source_sentence": "言汝置彼爾許者，謂百千億等教他置時，得罪同前。",
        "translation": "When you tell someone to place it there, they'll be punished with the same offense as the previous one.",
        "source": "T23n1443_010:0958b13_6"
    },
    {
        "source_sentence": "此九皆據不可見處，教他作也。",
        "translation": "These nine are all based on the invisible place and teach others to do it.",
        "source": "T23n1443_010:0958b14_7"
    },
    {
        "source_sentence": "若苾芻尼自捉金銀、錢、貝齒者，犯捨墮。",
        "translation": "If a bhikṣuṇī takes gold, silver, money, or shellfish teeth for herself, it's a violation to abandon them.",
        "source": "T23n1443_010:0958b15_8"
    },
    {
        "source_sentence": "若苾芻尼捉成未成金銀者，犯捨墮。",
        "translation": "If a bhikṣuṇī takes gold and silver that's made into gold or silver that's not made into gold, it's a violation to abandon it.",
        "source": "T23n1443_010:0958b16_9"
    },
    {
        "source_sentence": "苾芻尼捉文相成就金銀錢貝齒者，犯捨墮。",
        "translation": "A bhikṣuṇī who possesses the characteristics of gold, silver, money, shellfish, and teeth that are collected by a monk or nun commits the offense of forfeiture.",
        "source": "T23n1443_010:0958b17_10"
    },
    {
        "source_sentence": "苾芻尼觸末尼寶、薜琉璃寶，犯捨墮。",
        "translation": "If a monk or nun touches a maṇi treasure or a lapis lazuli treasure, he or she commits the offense of forfeiture.",
        "source": "T23n1443_010:0958b18_11"
    },
    {
        "source_sentence": "苾芻尼捉方國共所用錢，犯捨墮。",
        "translation": "A bhikṣuṇī who takes the money shared with a country and spends it on commonly used money commits an offense of forfeiture.",
        "source": "T23n1443_010:0958b19_0"
    },
    {
        "source_sentence": "若捉非方國所用錢，得惡作罪。",
        "translation": "If he grasps money used by someone from a country outside of his native land, he'll be guilty of misdeeds.",
        "source": "T23n1443_010:0958b19_1"
    },
    {
        "source_sentence": "若捉赤銅、鍮石、銅鐵、鉛錫者無犯。",
        "translation": "It's not a violation if he takes red copper, brass, copper, iron, lead, or tin.",
        "source": "T23n1443_010:0958b20_2"
    },
    {
        "source_sentence": "如是世尊為諸聲聞制學處已，佛在逝多林。",
        "translation": "Thus, the Bhagavān had established a place of training for the śrāvakas, and the Buddha was in Jeta's Grove.",
        "source": "T23n1443_010:0958b21_3"
    },
    {
        "source_sentence": "于時占波國有一長者在此城住，深信純善，以上妙物而為惠施。",
        "translation": "At the time, there was an elderly man in Jambudvīpa who lived in this city and believed it to be pure and good, gave more marvelous things as alms.",
        "source": "T23n1443_010:0958b22_4"
    },
    {
        "source_sentence": "時彼長者為佛及僧造立住處，門戶窓牖欄楯校飾，殊妙莊嚴令人樂見，",
        "translation": "That wealthy man then built a dwelling place for the Buddha and the saṃgha, decorated with doors, windows, brick walls, and railings, exquisitely adorned so as to be seen.",
        "source": "T23n1443_010:0958b23_5"
    },
    {
        "source_sentence": "為生天路。",
        "translation": "It's the path to being born in heaven.",
        "source": "T23n1443_010:0958b25_6"
    },
    {
        "source_sentence": "多諸尼眾在此安居，既安居了隨意事訖，白長者曰：「我等今欲向室羅伐城禮大師足，",
        "translation": "Many of the nuns were staying at Sāvatthī. Having settled there, they did as they wished and said to the wealthy householder, “We now wish to go to the city of Śrāvastī to pay homage at the feet of the Master.",
        "source": "T23n1443_010:0958b25_7"
    },
    {
        "source_sentence": "及諸耆宿尊老。",
        "translation": "It's the same as the old and venerable elders of the ages.",
        "source": "T23n1443_010:0958b27_8"
    },
    {
        "source_sentence": "苾芻尼現闕衣服，時當見施。」",
        "translation": "A bhikṣuṇī who lacks clothing now will see it when he or she gives it.",
        "source": "T23n1443_010:0958b27_9"
    },
    {
        "source_sentence": "長者報言：「聖者！",
        "translation": "The elder replied, Sage!",
        "source": "T23n1443_010:0958b28_10"
    },
    {
        "source_sentence": "此處之人無上妙衣疊，今聞商侶將欲到來，待來至時當以奉施。」",
        "translation": "The people here don't wear the highest and most wonderful robes, but now I've heard that the merchants are about to come, so I'll give them to them when they come.",
        "source": "T23n1443_010:0958b28_11"
    },
    {
        "source_sentence": "苾芻尼曰：「長者！",
        "translation": "The monks and nuns said, Elder!",
        "source": "T23n1443_010:0958c01_12"
    },
    {
        "source_sentence": "若無好物，與麁惡者。」",
        "translation": "If you don't have good things, give them to someone who is crude and evil.",
        "source": "T23n1443_010:0958c01_13"
    },
    {
        "source_sentence": "長者答曰：「聖者！",
        "translation": "The elder replied, Sage!",
        "source": "T23n1443_010:0958c02_14"
    },
    {
        "source_sentence": "我之立性常施好物，云何於今以惡物與？",
        "translation": "My established nature always gives good things, so how can I give bad things now?",
        "source": "T23n1443_010:0958c02_15"
    },
    {
        "source_sentence": "若不待者，衣直之錢可持將去。」",
        "translation": "If you don't wait, the money that's straightforward in clothing can be carried and taken away.",
        "source": "T23n1443_010:0958c03_16"
    },
    {
        "source_sentence": "答言：「長者！",
        "translation": "He replied, Sir!",
        "source": "T23n1443_010:0958c04_17"
    },
    {
        "source_sentence": "世尊制戒遮我捉錢。」",
        "translation": "Bhagavān, the Bhagavān has established precepts to prevent me from taking money.",
        "source": "T23n1443_010:0958c04_18"
    },
    {
        "source_sentence": "長者報曰：「若如是者，我寧不施，不能以惡物惠人。」",
        "translation": "The elder replied, If that's the case, I'd rather not give it than give it to someone with bad things.",
        "source": "T23n1443_010:0958c04_19"
    },
    {
        "source_sentence": "時諸尼眾竟無所獲，即便捨去。",
        "translation": "The nuns then had nothing to gain, so they abandoned it.",
        "source": "T23n1443_010:0958c06_0"
    },
    {
        "source_sentence": "隨路而進至室羅伐城，諸尼見告：「善來姊妹！",
        "translation": "He went on his way to the city of Śrāvastī, and when the nuns saw him, they said, Well come, sister!",
        "source": "T23n1443_010:0958c06_1"
    },
    {
        "source_sentence": "豈非仁等於安居處多得衣服，云何著此麁破衣服而至此耶？」",
        "translation": "Isn't it true that you and others often obtained clothing at the place of their retreat, so why did you put on this garment and break your clothes and come here?",
        "source": "T23n1443_010:0958c07_2"
    },
    {
        "source_sentence": "彼便答曰：「無衣可得。」",
        "translation": "He then answered, There's no robe to obtain.",
        "source": "T23n1443_010:0958c09_3"
    },
    {
        "source_sentence": "苾芻尼曰：「仁在何處而作安居？」",
        "translation": "The monks and nuns said, Where did you make your retreat?",
        "source": "T23n1443_010:0958c09_4"
    },
    {
        "source_sentence": "答曰：「在占波國。」",
        "translation": "He answered, It's in the country of Campā.",
        "source": "T23n1443_010:0958c10_5"
    },
    {
        "source_sentence": "又問：「依誰而住？」",
        "translation": "Again, he asked, By whom do you live?",
        "source": "T23n1443_010:0958c10_6"
    },
    {
        "source_sentence": "答曰：「某甲長者。」",
        "translation": "He answered, That's a certain elder.",
        "source": "T23n1443_010:0958c11_7"
    },
    {
        "source_sentence": "諸尼告曰：「聞彼長者好施上衣，豈不施耶？」",
        "translation": "The nuns told him, Haven't you heard that the elder likes to give his superior robes?",
        "source": "T23n1443_010:0958c11_8"
    },
    {
        "source_sentence": "答曰：「袛緣此故，我不得衣。」",
        "translation": "He replied, It's because of this that I won't get my robe.",
        "source": "T23n1443_010:0958c12_9"
    },
    {
        "source_sentence": "諸尼問曰：「有何所以？」",
        "translation": "The nuns asked, What's the reason?",
        "source": "T23n1443_010:0958c12_10"
    },
    {
        "source_sentence": "彼具陳事。",
        "translation": "They presented the matter in detail.",
        "source": "T23n1443_010:0958c13_11"
    },
    {
        "source_sentence": "諸尼聞已白諸苾芻，苾芻白佛。",
        "translation": "After the nuns heard this, they told the monks, and the monks told the Buddha.",
        "source": "T23n1443_010:0958c13_12"
    },
    {
        "source_sentence": "佛作是念：「諸有敬信婆羅門長者居士等，歡喜欲施苾芻尼衣價，我諸弟子情欲得衣，",
        "translation": "The Buddha had this thought, Those who respected the brāhmaṇas, wealthy householders, and so forth, were delighted to give their robes to bhikṣuṇīs.",
        "source": "T23n1443_010:0958c14_13"
    },
    {
        "source_sentence": "我應作法令諸苾芻尼得無廢闕。」",
        "translation": "I should make an order that the monks and nuns attain it without fail.",
        "source": "T23n1443_010:0958c16_14"
    },
    {
        "source_sentence": "告諸苾芻尼曰：「若有他施衣價，欲須便受，受已即作彼人物心而為持畜，",
        "translation": "He said to the bhikṣus and nuns, “If someone else gives you money for a garment, accept it if you need it. Having accepted it, make up your mind to keep it for that person.",
        "source": "T23n1443_010:0958c17_15"
    },
    {
        "source_sentence": "然諸苾芻尼應可求覓執事人。」",
        "translation": "Still, monks and nuns should seek out someone to serve them.",
        "source": "T23n1443_010:0958c18_16"
    },
    {
        "source_sentence": "苾芻尼不知欲覓何人？",
        "translation": "The monks and nuns didn't know who they wanted to look for.",
        "source": "T23n1443_010:0958c19_17"
    },
    {
        "source_sentence": "佛言：「應求寺家人，或鄔波斯迦。",
        "translation": "The Buddha said, You should ask the monks of the monastery or Upāsaka.",
        "source": "T23n1443_010:0958c19_18"
    },
    {
        "source_sentence": "寺家人者，謂是淨人。",
        "translation": "A monk in a temple is said to be a pure person.",
        "source": "T23n1443_010:0958c20_19"
    },
    {
        "source_sentence": "鄔波斯迦者，謂受三歸五戒。",
        "translation": "Upāsaka refers to the acceptance of the three refuges and five precepts.",
        "source": "T23n1443_010:0958c21_20"
    },
    {
        "source_sentence": "應問彼云：『汝能為我作施主不？』",
        "translation": "You should ask them, 'Can you be the donor for me?'",
        "source": "T23n1443_010:0958c21_21"
    },
    {
        "source_sentence": "若言：『能。』",
        "translation": "If he says, 'Are you able?'",
        "source": "T23n1443_010:0958c22_22"
    },
    {
        "source_sentence": "者，即作委寄此人心而畜其物，可使人持不應自捉。」",
        "translation": "That's to entrust this person with the task of storing his things, so that they can be held by someone who doesn't take them for themselves.",
        "source": "T23n1443_010:0958c22_23"
    },
    {
        "source_sentence": "時有苾芻尼，向他方處作如是念：「我今至此亦未有施主。」",
        "translation": "A bhikṣuṇī then had this thought when she went to another place, Now that I've arrived here, there's no donor.",
        "source": "T23n1443_010:0958c23_24"
    },
    {
        "source_sentence": "起追悔心。",
        "translation": "He gives rise to the mind of pursuing regret.",
        "source": "T23n1443_010:0958c25_25"
    },
    {
        "source_sentence": "尼白苾芻，苾芻白佛。",
        "translation": "The nun said to the monk, and the monk said to the Buddha.",
        "source": "T23n1443_010:0958c25_26"
    },
    {
        "source_sentence": "佛言：「縱令遠去，但令彼人命存已來，常是施主。」",
        "translation": "The Buddha said, Even if you cause someone to go far away, but make them stay alive after their lives are preserved, they'll always be the donor.",
        "source": "T23n1443_010:0958c25_27"
    },
    {
        "source_sentence": "時有苾芻尼未求得施主，他施與物，苾芻尼疑不敢為受，佛言：「應受。",
        "translation": "When a bhikṣuṇī didn't ask for a donor, and another gave something to him or her, the bhikṣuṇī doubted it and didn't dare accept it, and the Buddha said, You should accept it.",
        "source": "T23n1443_010:0958c26_28"
    },
    {
        "source_sentence": "受已持物，對一苾芻尼作如是語：『具壽存念。",
        "translation": "After accepting the gift, he spoke to a monk or nun who said, 'Long live and keep it in mind.",
        "source": "T23n1443_010:0958c28_29"
    },
    {
        "source_sentence": "我苾芻尼某甲，得此不淨物，我當持此不淨之物換取淨財。』",
        "translation": "I, a certain monk or nun, will obtain this impure thing, and I'll take this impure thing and exchange it for pure possessions.'",
        "source": "T23n1443_010:0958c29_30"
    },
    {
        "source_sentence": "如是三說，隨情受用勿致疑心。」",
        "translation": "These three teachings are to be used according to one's feelings and not to cause doubt.",
        "source": "T23n1443_010:0959a01_31"
    },
    {
        "source_sentence": "時有施主，於邊隅處造寺施僧。",
        "translation": "At the time, there was a donor who built a temple at a corner and gave it to the saṃgha.",
        "source": "T23n1443_010:0959a02_32"
    },
    {
        "source_sentence": "時時有賊來相驚怖，彼苾芻尼棄寺而去，便有賊來取寺家物。",
        "translation": "From time to time, thieves came and frightened each other, and the monks and nuns abandoned the temple and departed, and then thieves came and took the property of the temple.",
        "source": "T23n1443_010:0959a03_33"
    },
    {
        "source_sentence": "佛言：「若僧伽物、若窣覩波物，所有金銀錢寶等，應牢藏舉方可移去。」",
        "translation": "The Buddha said, Suppose you have gold, silver, money, and other treasures that are the property of the saṃgha or the possessions of the gandharva, and you can move them away only when they're held in a secure place.",
        "source": "T23n1443_010:0959a04_34"
    },
    {
        "source_sentence": "雖言遣藏，尼便不知欲遣誰藏？",
        "translation": "Even though he says he's sending the store, the nun doesn't know whose store he wants to send.",
        "source": "T23n1443_010:0959a06_35"
    },
    {
        "source_sentence": "佛言：「若淨人、或鄔波索迦。」",
        "translation": "The Buddha said, Suppose a pure person or Upāsaka.",
        "source": "T23n1443_010:0959a06_36"
    },
    {
        "source_sentence": "令其藏舉，彼藏舉者便偷其物，佛言：「有深信鄔波索迦令其藏舉，若無深信應使求寂女，",
        "translation": "He causes the store to be lifted up, and those who lift it steal its things. The Buddha said, If there's a woman with deep faith in Upāsaka who wants her store to be lifted up, then if she has no deep faith, she should be made to seek tranquility.",
        "source": "T23n1443_010:0959a07_37"
    },
    {
        "source_sentence": "求寂女若無，尼自手藏。」",
        "translation": "If the woman seeking quiescence doesn't exist, the nun hides it in her own hand.",
        "source": "T23n1443_010:0959a09_38"
    },
    {
        "source_sentence": "尼復不知若為藏舉？",
        "translation": "Doesn't the nun also know that it's a store lifting?",
        "source": "T23n1443_010:0959a10_0"
    },
    {
        "source_sentence": "佛言：「應可穿坑。」",
        "translation": "The Buddha said, You should penetrate the pit.",
        "source": "T23n1443_010:0959a10_1"
    },
    {
        "source_sentence": "不知使誰？",
        "translation": "I don't know who the messenger is?",
        "source": "T23n1443_010:0959a10_2"
    },
    {
        "source_sentence": "佛言：「應使淨人、若鄔波索迦。",
        "translation": "The Buddha said, You should let the pure person or Upāsaka do so.",
        "source": "T23n1443_010:0959a11_3"
    },
    {
        "source_sentence": "彼便偷物，應令信者。",
        "translation": "They then steal things, and they should cause those who believe them to do so.",
        "source": "T23n1443_010:0959a11_4"
    },
    {
        "source_sentence": "此若無者，應令求寂女。",
        "translation": "If this doesn't exist, he should cause the woman to seek extinction.",
        "source": "T23n1443_010:0959a12_5"
    },
    {
        "source_sentence": "求寂女若無，應自穿掘。",
        "translation": "If the woman seeking to be extinguished doesn't exist, she should dig it herself.",
        "source": "T23n1443_010:0959a12_6"
    },
    {
        "source_sentence": "賊去之後應可如前而取，其物還與僧伽。」",
        "translation": "After the thief leaves, you should take it as before and return it to the saṃgha.",
        "source": "T23n1443_010:0959a13_7"
    },
    {
        "source_sentence": "佛言：「如我為難緣事開者，難去之後則不應行。",
        "translation": "The Buddha said, Suppose I were to open the door for someone who has difficulties with conditions, and then they won't do it after they have difficulty leaving.",
        "source": "T23n1443_010:0959a14_8"
    },
    {
        "source_sentence": "若仍行者，得越法罪。」",
        "translation": "If you still practice it, you'll be guilty of transgressing the Dharma.",
        "source": "T23n1443_010:0959a15_9"
    },
    {
        "source_sentence": "出納求利學處第十二",
        "translation": "The Twelfth Place of Studying for the Benefits of Delivering and Seeking",
        "source": "T23n1443_010:0959a16_0"
    },
    {
        "source_sentence": "緣在室羅伐城。",
        "translation": "The reason for this was in the city of Śrāvastī.",
        "source": "T23n1443_010:0959a17_0"
    },
    {
        "source_sentence": "世尊在逝多林給孤獨園，遠近皆聞中國有佛出現於世，彼諸聲聞弟子有大神通作諸變化廣說妙法。",
        "translation": "The Bhagavān was staying at Anāthapiṇḍada's Park in Jeta's Grove, and people from far and near heard that a buddha had appeared in the world in China, and those śrāvaka disciples had great supernormal powers to create miraculous transformations and explain the wonderful Dharma in detail.",
        "source": "T23n1443_010:0959a17_1"
    },
    {
        "source_sentence": "若有人能於彼弟子作供養者，得大果報饒益增廣。",
        "translation": "If someone can make an offering to that disciple, they'll attain great rewards and increase in benefit.",
        "source": "T23n1443_010:0959a19_2"
    },
    {
        "source_sentence": "是時北方有諸商客，聞此聲譽自相謂曰：「諸君當知！",
        "translation": "At the time, there were merchants in the north who heard this reputation and said to each other, You should know!",
        "source": "T23n1443_010:0959a20_3"
    },
    {
        "source_sentence": "我等宜往中國興易，一則多得利潤，二乃供養三寶。」",
        "translation": "It's advisable for us to go to China and prosper, where the first will attain much profit and benefit, and the second will make offerings to the Three Treasures.",
        "source": "T23n1443_010:0959a22_4"
    },
    {
        "source_sentence": "時諸商人多齎貨物至室羅伐城。",
        "translation": "The merchants then brought a large amount of goods to Śrāvastī.",
        "source": "T23n1443_010:0959a23_5"
    },
    {
        "source_sentence": "於此城中有一露形外道，善識天文占察前事，詣商主所告言：「善來商主！",
        "translation": "In this city, there was a non-Buddhist in bare form who had good knowledge of astronomy and divination and went to the merchant's place and told him, Welcome, merchant lord!",
        "source": "T23n1443_010:0959a24_6"
    },
    {
        "source_sentence": "汝父名某甲、母名某甲，將如是貨來詣此方，齊某日來得爾許利。」",
        "translation": "Your father's name is so-and-so, and your mother's name is so-and-so, and you brought such goods to this place on a certain day to obtain such benefits.",
        "source": "T23n1443_010:0959a25_7"
    },
    {
        "source_sentence": "商主聞已作如是念：「我比曾聞世尊弟子有大神變，騰煙注雨未萌先測，",
        "translation": "Having heard this, the merchant leader thought: I have never before heard that the disciples of the World-honored One had a great supernatural power to cause smoke and rain to rise but it has not yet been measured.",
        "source": "T23n1443_010:0959a27_8"
    },
    {
        "source_sentence": "此即其人。」",
        "translation": "This is the person.",
        "source": "T23n1443_010:0959a28_9"
    },
    {
        "source_sentence": "便以北方朱色毛緂及諸奇果，持奉外道。",
        "translation": "He then offered the red-colored hair and other rare fruits to the non-Buddhist monks in the north.",
        "source": "T23n1443_010:0959a29_10"
    },
    {
        "source_sentence": "彼既得已即便披緂往同徒處，伴見便問，彼具陳說。",
        "translation": "After he had attained it, he put on his robes and went to the same place as the disciples, and when they saw him, they asked questions, and he explained them in detail.",
        "source": "T23n1443_010:0959b01_11"
    },
    {
        "source_sentence": "同徒告曰：「仁者！",
        "translation": "The fellow practitioners told him, Sir!",
        "source": "T23n1443_010:0959b02_12"
    },
    {
        "source_sentence": "我等常被沙門釋子之所輕蔑，每告我曰：『汝等曾不親近貴勝好人，但唯狎習傭力賤品旃茶羅類。』",
        "translation": "We're always despised by the ascetics and Śākyamunis, and they often tell us, 'Haven't you ever been intimate with noble people or good men but only those who cultivate servants, strong men, and low-ranking caṇḍalas?'",
        "source": "T23n1443_010:0959b02_13"
    },
    {
        "source_sentence": "仁今宜可披此貴服詣釋子處刺其心胸。」",
        "translation": "Now, it's better for you to put on this noble robe and go to the place where the Śākyamuni is and pierce his heart and chest.",
        "source": "T23n1443_010:0959b04_14"
    },
    {
        "source_sentence": "即披毛緂詣逝多林。",
        "translation": "He then covered his hair and went to Jeta's Grove.",
        "source": "T23n1443_010:0959b05_15"
    },
    {
        "source_sentence": "時鄔波難陀於逝多林門外經行遊步，遙見彼來便作是念：「外道披者是好貴物，",
        "translation": "Upananda then walked up and down outside the entrance to Jeta’s Grove. Seeing them from a distance, Upananda thought:",
        "source": "T23n1443_010:0959b06_16"
    },
    {
        "source_sentence": "我若不能得此物者，不復更名鄔波難陀矣！」",
        "translation": "If I can't get this thing, I won't be called Upananda again!",
        "source": "T23n1443_010:0959b08_17"
    },
    {
        "source_sentence": "既漸相近，問言：「外道！",
        "translation": "They gradually approached each other and asked, Non-Buddhist!",
        "source": "T23n1443_010:0959b09_18"
    },
    {
        "source_sentence": "汝今豈可新歸俗耶？」",
        "translation": "How can you now return to the secular world?",
        "source": "T23n1443_010:0959b09_19"
    },
    {
        "source_sentence": "答言：「我不歸俗。」",
        "translation": "He replied, I won't return to the secular world.",
        "source": "T23n1443_010:0959b10_20"
    },
    {
        "source_sentence": "「若如是者，何得披此俗衣？」",
        "translation": "If that's the case, how can you wear this layman's robe?",
        "source": "T23n1443_010:0959b10_21"
    },
    {
        "source_sentence": "彼具陳說。",
        "translation": "They explain it in detail.",
        "source": "T23n1443_010:0959b11_22"
    },
    {
        "source_sentence": "鄔波難陀曰：「此非善事！",
        "translation": "Upananda said, That's not a good thing!",
        "source": "T23n1443_010:0959b11_23"
    },
    {
        "source_sentence": "此非善事！",
        "translation": "This is not a good thing!",
        "source": "T23n1443_010:0959b11_24"
    },
    {
        "source_sentence": "豈容年邁衰朽為破戒耶？",
        "translation": "How can old age and decay be a violation of the precepts?",
        "source": "T23n1443_010:0959b12_25"
    },
    {
        "source_sentence": "宜應暫坐聊聽法要。」",
        "translation": "It's advisable to sit for a while and listen briefly to the essentials of the Dharma.",
        "source": "T23n1443_010:0959b12_26"
    },
    {
        "source_sentence": "時彼外道隨言即坐，鄔波難陀以歡喜心為其說法。",
        "translation": "That non-Buddhist then sat down as he said, and Upananda taught him the Dharma with joy.",
        "source": "T23n1443_010:0959b13_27"
    },
    {
        "source_sentence": "若鄔波難陀為他宣說捨施法時，聞者皆欲自割身肉持以相施。",
        "translation": "When Upananda explains the teaching of giving for others, those who hear it want to cut off their own flesh and maintain it as a mark of generosity.",
        "source": "T23n1443_010:0959b14_28"
    },
    {
        "source_sentence": "復告外道：「汝之大師性愛麁弊，教汝門徒露形拔髮，多行少住常臥于地；",
        "translation": "Again, he said to the heretics: Your great teacher is fond of sexual misconduct. He teaches your disciples to expose their bodies and pull them out. They often lie on the ground with little movement.",
        "source": "T23n1443_010:0959b15_29"
    },
    {
        "source_sentence": "若汝大師情所愛樂好衣食者，當許汝著價直千萬上妙之衣、百味飲食隨意飡噉，",
        "translation": "If your great teacher loves clothing and food with affection, he will allow you to wear clothes worth thousands of myriads of koṭis of marvelous coins or hundreds of flavors of food and drink as you wish.",
        "source": "T23n1443_010:0959b17_30"
    },
    {
        "source_sentence": "所住房舍價當百千。",
        "translation": "The houses and dwellings he built will be worth a hundred thousand [Chinese] yuan.",
        "source": "T23n1443_010:0959b19_31"
    },
    {
        "source_sentence": "由彼狹情不見容許。",
        "translation": "It's because they are narrow-minded and don't see room for them.",
        "source": "T23n1443_010:0959b19_32"
    },
    {
        "source_sentence": "我之大師情懷廣大，許我弟子著萬價衣食百味食，所居房舍數直千金。",
        "translation": "My great teacher's sentiment was so vast that he agreed to allow my disciples to wear ten thousand-worth of clothing, food, and a hundred flavors of food, and the dwelling quarters where they lived amounted to thousands of gold.",
        "source": "T23n1443_010:0959b20_33"
    },
    {
        "source_sentence": "若汝披此貴價好服行乞食者，信敬之人作如是念：『今此外道身行破戒。』",
        "translation": "If you don't wear these valuable and beautiful clothing to practice begging for food, the faithful person will think, 'Now, there are other paths that violate the precepts in their bodily actions.'",
        "source": "T23n1443_010:0959b21_34"
    },
    {
        "source_sentence": "至於飲食難以供身。",
        "translation": "As for food and drink, it's difficult to make offerings to the body.",
        "source": "T23n1443_010:0959b23_35"
    },
    {
        "source_sentence": "汝此上衣宜應與我，我有毛緂持以相換，我當披著巡家乞食。",
        "translation": "It's advisable for you to give me this upper garment. I have a hair standing on my neck to exchange it with you, and I will put it on and go around the house begging for food.",
        "source": "T23n1443_010:0959b24_0"
    },
    {
        "source_sentence": "若淨信人來問於我，我當答曰：『有露形人名姓某甲，輟已相惠。』",
        "translation": "If a pure believer comes to me and asks questions, I'll answer, 'There's a man named So-and-so in revealed form whose name is so-and-so, who has given up his kindness.'",
        "source": "T23n1443_010:0959b25_1"
    },
    {
        "source_sentence": "彼便知汝是深信人，汝乞食時，彼若見者，當以酒糟盛滿銅器供養於汝。」",
        "translation": "They'll then know that you're a man of deep faith, and when you're begging for food, if they see you, they'll offer you a copper vessel full of wine and grated rice.",
        "source": "T23n1443_010:0959b26_2"
    },
    {
        "source_sentence": "時彼露形聞是語已，便生信喜作如是言：「大德！",
        "translation": "After hearing these words, the monk in disguise became convinced and said, Mañjuśrī!",
        "source": "T23n1443_010:0959b28_3"
    },
    {
        "source_sentence": "若如是者可取此衣。」",
        "translation": "If you do so, you can take this robe.",
        "source": "T23n1443_010:0959b29_4"
    },
    {
        "source_sentence": "鄔波難陀便即呪願曰：「無病長壽，然汝徒黨貧苦是常，聞汝施時還令相奪。」",
        "translation": "Upananda then made a vow, saying, There's no illness and long life, but it's always the case that your followers are poor and suffering, and when they hear you give them back, they'll be taken away from each other.",
        "source": "T23n1443_010:0959c01_5"
    },
    {
        "source_sentence": "彼言：「大德！",
        "translation": "They said, Mañjuśrī!",
        "source": "T23n1443_010:0959c02_6"
    },
    {
        "source_sentence": "此之毛緂豈彼物耶？",
        "translation": "Is this hair that grows on the back of your head, isn't it something else?",
        "source": "T23n1443_010:0959c03_7"
    },
    {
        "source_sentence": "是我自由，幸見無慮。」",
        "translation": "This is my freedom, so fortunately I'll see it without worry.",
        "source": "T23n1443_010:0959c03_8"
    },
    {
        "source_sentence": "「若如是者，我當為受。」",
        "translation": "If that's the case, I will accept it for you.",
        "source": "T23n1443_010:0959c04_9"
    },
    {
        "source_sentence": "既受得已，即便與一麁鞕毛緂。",
        "translation": "After he had received it, he gave it to him as a patch of hair.",
        "source": "T23n1443_010:0959c04_10"
    },
    {
        "source_sentence": "時彼外道披著而去，至同梵行邊，彼便問曰：「仁者何處更得此衣？」",
        "translation": "The non-Buddhist then put on his robes and departed, went to the side of the same religious practice, and asked, Sir, where else could you get this robe?",
        "source": "T23n1443_010:0959c05_11"
    },
    {
        "source_sentence": "彼即具陳換衣所由。",
        "translation": "They then explained the reason for changing their robes.",
        "source": "T23n1443_010:0959c06_12"
    },
    {
        "source_sentence": "聞皆怒言：「仁者！",
        "translation": "They all heard him angrily say, Sir!",
        "source": "T23n1443_010:0959c07_13"
    },
    {
        "source_sentence": "此之釋子常思殺我，餘雖見欺不同六眾，六人之內無越彼一。",
        "translation": "This Śākyamuni always thought of killing me, but even though the others deceived him, they weren't different from the six groups of people, and among the six people there was no one who surpassed them.",
        "source": "T23n1443_010:0959c07_14"
    },
    {
        "source_sentence": "仁若施與餘大德者，我亦隨喜。",
        "translation": "Good man, if you give it to other great virtuous people, I'll also rejoice.",
        "source": "T23n1443_010:0959c08_15"
    },
    {
        "source_sentence": "而鄔波難陀欲飲我血，將衣施彼誰堪忍耶？",
        "translation": "Who will tolerate it if Upananda wants to drink my blood and gives his robe to him?",
        "source": "T23n1443_010:0959c09_16"
    },
    {
        "source_sentence": "即宜往索。",
        "translation": "It's better to go and ask for it.",
        "source": "T23n1443_010:0959c10_17"
    },
    {
        "source_sentence": "若得者善；",
        "translation": "Those who have attained it are good.",
        "source": "T23n1443_010:0959c10_18"
    },
    {
        "source_sentence": "若不得者我同擯汝，移汝坐處覆汝食器，不須共語。」",
        "translation": "If you don't get it, I'll take pity on you and move the place where you're sitting to cover your food container, so you won't need to speak together.",
        "source": "T23n1443_010:0959c11_19"
    },
    {
        "source_sentence": "彼便怕怖，往鄔波難陀所。",
        "translation": "Fearful, he went to Upananda.",
        "source": "T23n1443_010:0959c12_20"
    },
    {
        "source_sentence": "彼遙見來即作是念：「看此外道舉動形勢，必當奪我上好毛緂。」",
        "translation": "Seeing him from a distance, he thought, Look at the other paths that raise their form and momentum, they'll surely snatch away my hair on top of my head.",
        "source": "T23n1443_010:0959c12_21"
    },
    {
        "source_sentence": "便急入房閉戶而住。",
        "translation": "He quickly entered the room, closed the door, and stayed there.",
        "source": "T23n1443_010:0959c14_22"
    },
    {
        "source_sentence": "外道即至扣門相喚，鄔波難陀默然不對，諸苾芻見問言：「外道！",
        "translation": "When the non-Buddhist monks went to the door and called each other, Upananda remained silent and didn't answer, and the monks saw him and asked, Non-Buddhist monks!",
        "source": "T23n1443_010:0959c14_23"
    },
    {
        "source_sentence": "汝何所須？」",
        "translation": "What do you need?",
        "source": "T23n1443_010:0959c16_24"
    },
    {
        "source_sentence": "報言：「將我毛緂故來相覓。」",
        "translation": "He replied, They'll come to search for each other because they're wearing my hair.",
        "source": "T23n1443_010:0959c16_25"
    },
    {
        "source_sentence": "苾芻報曰：「汝若欲得，往世尊所求哀歸向。」",
        "translation": "The monk replied, If you want to get it, go to the Bhagavān's place and return with pity.",
        "source": "T23n1443_010:0959c17_26"
    },
    {
        "source_sentence": "時彼外道往詣佛所。",
        "translation": "That non-Buddhist then went to the Buddha.",
        "source": "T23n1443_010:0959c18_27"
    },
    {
        "source_sentence": "爾時世尊遙見外道來，告諸苾芻：「汝等見彼外道來不？」",
        "translation": "The Bhagavān then saw the non-Buddhist coming from a distance and told the monks, Do you see that non-Buddhist coming?",
        "source": "T23n1443_010:0959c19_0"
    },
    {
        "source_sentence": "白佛言：「見。」",
        "translation": "He said to the Buddha, See.",
        "source": "T23n1443_010:0959c20_1"
    },
    {
        "source_sentence": "佛言：「彼為毛緂故來。",
        "translation": "The Buddha said, They came because of their hair standing on end.",
        "source": "T23n1443_010:0959c20_2"
    },
    {
        "source_sentence": "若索得者善。",
        "translation": "If you ask for it, it's good.",
        "source": "T23n1443_010:0959c21_0"
    },
    {
        "source_sentence": "若不得者，便歐熱血而致命終。」",
        "translation": "If he doesn't get it, he'll burn hot blood and die.",
        "source": "T23n1443_010:0959c21_1"
    },
    {
        "source_sentence": "外道來至佛所，作如是白：「大德！",
        "translation": "The non-Buddhist came to the Buddha and said, Mañjuśrī!",
        "source": "T23n1443_010:0959c22_0"
    },
    {
        "source_sentence": "鄔波難陀取我毛緂，唯願世尊慈悲哀愍令彼還我。",
        "translation": "Upananda took my hair and stood on end. May the World-honored One have mercy, pity, and compassion and allow him to return it to me!",
        "source": "T23n1443_010:0959c22_1"
    },
    {
        "source_sentence": "若不還者，我等同梵行者擯斥於我。」",
        "translation": "If you don't return, we religious practitioners who practice the same celibacy will scold me.",
        "source": "T23n1443_010:0959c23_2"
    },
    {
        "source_sentence": "如前具說。",
        "translation": "It's as explained above.",
        "source": "T23n1443_010:0959c24_3"
    },
    {
        "source_sentence": "爾時世尊告具壽阿難陀曰：「汝自往告鄔波難陀言：『汝得無病。』",
        "translation": "It was then that the Bhagavān addressed Kauṇḍinya Ānanda, Go tell Upananda yourself, 'You'll attain freedom from illness.'",
        "source": "T23n1443_010:0959c25_0"
    },
    {
        "source_sentence": "仍告之曰：『汝當還彼外道毛緂，若不還者當歐熱血而死。』」",
        "translation": "He still told him, 'You must return to that non-Buddhist's hair standing on end; if you don't return, you'll be burned by hot blood and die.'",
        "source": "T23n1443_010:0959c26_1"
    },
    {
        "source_sentence": "時具壽阿難陀依佛言告，彼聞語已即從坐起：「我今敬禮，無上尊教豈敢有違。",
        "translation": "Ānanda Kauṣṭhila then followed the Buddha's words and told him, and when he heard his words, he rose from his seat and said, Now, I respectfully bow my head in homage, how dare I disobey the teaching of the unsurpassed honored one?",
        "source": "T23n1443_010:0959c27_2"
    },
    {
        "source_sentence": "若非佛教遣我還者，縱令外道滿贍部洲數如竹葦皆歐熱血一時命終，我鄔波難陀一毛不動。",
        "translation": "If it's not the case that Buddhism sends me back, then even if a non-Buddhist were to fill Jambudvīpa with as many buddha-teachings as there are bamboo and reeds, all of which die at one time in hot blood, my hair on Upananda wouldn't budge.",
        "source": "T23n1443_010:0959c29_3"
    },
    {
        "source_sentence": "具壽阿難陀可去，我當還彼。」",
        "translation": "Kauṣṭhila Ānanda may go, and I'll return there.",
        "source": "T23n1443_010:0960a02_4"
    },
    {
        "source_sentence": "便語外道曰：「汝之大師先行妄語欺誑世間，彼命終已墮在無間大地獄中，",
        "translation": "He said to the heretic, “Your great teacher has been lying and deceiving the world for a long time. At the end of his life he will fall into the great hell of unremitting hell.",
        "source": "T23n1443_010:0960a03_5"
    },
    {
        "source_sentence": "在彼舌上有五百犁，晝夜耕墾。",
        "translation": "On his tongue there were five hundred plows to plow day and night.",
        "source": "T23n1443_010:0960a04_6"
    },
    {
        "source_sentence": "汝今妄語更倍於彼，當有千犁常耕汝舌。",
        "translation": "Your false speech now is even greater than that, and you'll have a thousand plows always plowing your tongue.",
        "source": "T23n1443_010:0960a05_7"
    },
    {
        "source_sentence": "汝已著我毛緂，汝物我曾不用。」",
        "translation": "You've already touched my hair, and I didn't use your things.",
        "source": "T23n1443_010:0960a06_8"
    },
    {
        "source_sentence": "外道答言：「我亦不著。」",
        "translation": "The non-Buddhist replied, Neither am I attached.",
        "source": "T23n1443_010:0960a07_9"
    },
    {
        "source_sentence": "時鄔波難陀取彼毛緂解其邊結，襵為四疊安左手中，右手摋拍開張其緂搭彼頭上，",
        "translation": "Upananda then took that hair, untied its side fetters, folded it into four piles and placed them in his left hand.",
        "source": "T23n1443_010:0960a07_10"
    },
    {
        "source_sentence": "遂便倒地脚蹴其脅，語言：「外道急去！",
        "translation": "He then fell to the ground and kicked his threatened, saying, Non-Buddhist, go quickly!",
        "source": "T23n1443_010:0960a09_11"
    },
    {
        "source_sentence": "急去！",
        "translation": "Go quickly!",
        "source": "T23n1443_010:0960a10_12"
    },
    {
        "source_sentence": "勿令糞穢污我僧田。」",
        "translation": "Don't let the dung and filthy dirt stain my saṃgha field.",
        "source": "T23n1443_010:0960a10_13"
    },
    {
        "source_sentence": "外道報言：「大德！",
        "translation": "The non-Buddhist replied, Mañjuśrī!",
        "source": "T23n1443_010:0960a11_14"
    },
    {
        "source_sentence": "我今命存得出去者，更不敢入逝多園林。」",
        "translation": "Now that I've been ordered to go out, I won't dare enter Jeta's forest.",
        "source": "T23n1443_010:0960a11_15"
    },
    {
        "source_sentence": "此是緣起，然佛世尊尚未制戒。",
        "translation": "This is conditioned arising, but the Bhagavān has yet to regulate the precepts.",
        "source": "T23n1443_010:0960a12_16"
    },
    {
        "source_sentence": "爾時六眾苾芻種種出息，或取、或與、或生、或質，以成取成、以未成取成、以成取未成、以未成取未成。",
        "translation": "It was then that the six monks in the assembly variously exhaled, either taking, or giving, or production, or quality, to make it possible to take what's formed, to make it possible to take what's not yet taken, to make it possible to take what's not yet taken, and to make it possible to take what's not yet taken.",
        "source": "T23n1443_010:0960a13_17"
    },
    {
        "source_sentence": "言取者，謂即收取，他方愛樂所有貨物，載運將去，覓防守人立諸券契，",
        "translation": "The expression taking refers to the act of collecting, which is to pick up goods beloved by others and carry them on a carriage that's about to leave.",
        "source": "T23n1443_010:0960a15_18"
    },
    {
        "source_sentence": "是名為取。",
        "translation": "This is called grasping.",
        "source": "T23n1443_010:0960a16_19"
    },
    {
        "source_sentence": "言與者，謂與他物八日、十日等而立契證，是名為與。",
        "translation": "The expression giving refers to the eighth day, tenth day, and so forth when you establish an agreement with someone else's property, which is called giving.",
        "source": "T23n1443_010:0960a17_20"
    },
    {
        "source_sentence": "言生者，謂是生利，與他少物多取穀麥，或加五、或一倍、二倍等，貯畜升斗立其券契，",
        "translation": "The expression arising refers to the benefit of arising, which is to give a small amount of grain or wheat to someone else and take a large amount of grain or wheat with a small amount of goods, sometimes by multiplying it by five, sometimes by one, sometimes by two, etc., and store it in a sheng-dollar account and set up a promissory note for it",
        "source": "T23n1443_010:0960a18_21"
    },
    {
        "source_sentence": "是名為生。",
        "translation": "This is called birth.",
        "source": "T23n1443_010:0960a20_22"
    },
    {
        "source_sentence": "言質者，謂納質取珠寶等，同前立契求好保證與其財物，是名為質。",
        "translation": "The expression quality refers to the fact that someone who collects goods, takes jewels, and so forth, as before, establishes an agreement to seek goods and promises them their possessions, which is called quality.",
        "source": "T23n1443_010:0960a20_23"
    },
    {
        "source_sentence": "言成取成者，謂以金銀等器取他成器。",
        "translation": "When it's formed, it means to take gold and silver vessels that are made into vessels with other vessels.",
        "source": "T23n1443_010:0960a22_24"
    },
    {
        "source_sentence": "言未成取成者，謂以金鋌取他金器。",
        "translation": "Someone who says it's not yet formed and takes what's formed means to take another person's gold vessel with a golden bowl.",
        "source": "T23n1443_010:0960a23_0"
    },
    {
        "source_sentence": "言成取未成者，謂以金器取他金鋌。",
        "translation": "When it's formed and not yet formed, it means to take another person's gold bowl with a gold container.",
        "source": "T23n1443_010:0960a23_1"
    },
    {
        "source_sentence": "言以未成取未成者，謂以金鋌取他碎金。",
        "translation": "When it's said to take what's not yet formed with what's not yet formed, it means to take another person's broken gold with a gold bowl and pick it up.",
        "source": "T23n1443_010:0960a24_2"
    },
    {
        "source_sentence": "苾芻如是交易以求其利。",
        "translation": "A monk thus trades to seek profit.",
        "source": "T23n1443_010:0960a25_3"
    },
    {
        "source_sentence": "時諸外道、婆羅門、居士、長者見是事已皆生嫌賤：「云何沙門釋子出物求利，",
        "translation": "When non-Buddhists, brahmans, householders, and wealthy people saw this, they all became disgusted, saying, How is it that the ascetic or Śākyamuni produces things to seek profit?",
        "source": "T23n1443_010:0960a26_4"
    },
    {
        "source_sentence": "與俗何殊？",
        "translation": "What's the difference between it and the conventional?",
        "source": "T23n1443_010:0960a27_5"
    },
    {
        "source_sentence": "誰能與彼衣食而相供給？」",
        "translation": "Who will be able to offer them food and clothing?",
        "source": "T23n1443_010:0960a28_6"
    },
    {
        "source_sentence": "諸苾芻白佛。",
        "translation": "The monks said to the Buddha,",
        "source": "T23n1443_010:0960a28_7"
    },
    {
        "source_sentence": "佛以此緣，同前集眾問實訶責，廣說乃至「制其學處，應如是說：「若復苾芻尼，",
        "translation": "For this reason, the Buddha shared the previous assembly of monks and nuns who had been questioned and reprimanded, explaining in detail up to the point where they were restrained from training, saying:",
        "source": "T23n1443_010:0960a29_8"
    },
    {
        "source_sentence": "種種出納求利者，泥薩祇波逸底迦。」",
        "translation": "Those who come out in various ways to seek profit are called nisaji pratyekabuddhas.",
        "source": "T23n1443_010:0960b02_9"
    },
    {
        "source_sentence": "言苾芻尼者，謂此法中尼。",
        "translation": "The term bhikṣuṇī refers to the nun in this teaching.",
        "source": "T23n1443_010:0960b03_10"
    },
    {
        "source_sentence": "言種種者，謂非一事。",
        "translation": "The expression various refers to not one thing.",
        "source": "T23n1443_010:0960b03_11"
    },
    {
        "source_sentence": "出納求利者，謂作取與出納而覓利潤。",
        "translation": "Those who leave and seek profit are those who make gains by taking what's received and leaving, and they search for profit.",
        "source": "T23n1443_010:0960b04_12"
    },
    {
        "source_sentence": "得捨墮罪者，廣說如上。",
        "translation": "Those who attain equanimity and fall into sin are explained in detail as above.",
        "source": "T23n1443_010:0960b05_13"
    },
    {
        "source_sentence": "此中犯相者，若苾芻尼為求利故，收聚貨物作諸方便，驅馳車乘往詣他方，",
        "translation": "The characteristic of this offense is that if a monk or nun, out of desire for profit, collects his or her goods and makes various preparations to drive their chariots and vehicles to another place.",
        "source": "T23n1443_010:0960b05_14"
    },
    {
        "source_sentence": "立契保人持輸稅物，乃至未得利來得惡作罪，若得利時便招捨墮。",
        "translation": "It's a sin to establish a contract for the protection of someone who carries a tax, even if they don't attain profit and become guilty of misdeeds, and if they attain profit, then they'll be invited to abandon it.",
        "source": "T23n1443_010:0960b07_15"
    },
    {
        "source_sentence": "若苾芻尼為求利故，以諸財貨金銀等物，出與他人共立契保，乃至得罪如前廣說。",
        "translation": "If a monk or nun, out of desire for profit, gives his or her possessions, gold, silver, and other things to others in order to establish a security agreement with them, then he or she will be guilty as described above.",
        "source": "T23n1443_010:0960b08_16"
    },
    {
        "source_sentence": "若苾芻尼為求生利，將諸財穀舉與他人，升斗校量共立契證，乃至得罪如前。",
        "translation": "If a bhikṣuṇī seeks the profit of birth and gives his or her possessions to someone else, he or she weighs up an amount of grain that's equal to one sheng and establishes a common understanding with him or her, and then he or she commits the sin as before.",
        "source": "T23n1443_010:0960b10_17"
    },
    {
        "source_sentence": "苾芻尼為求利故，納取珍寶真珠貝玉，計時取利，得不得利亦如上說。",
        "translation": "Because they seek profit, the bhikṣuṇīs take treasures, genuine pearls, shellfish, and jade, and calculate the amount of profit at the right time. The same applies to gaining or losing profit as explained above.",
        "source": "T23n1443_010:0960b12_18"
    },
    {
        "source_sentence": "若苾芻尼為利故，以己衣共他換易，得惡作罪，得利犯捨墮。",
        "translation": "If a monk or nun for profit shares his or her robe with someone else to exchange it for another, he or she commits the misdeed and receives an unbeneficial offense.",
        "source": "T23n1443_010:0960b14_19"
    },
    {
        "source_sentence": "爾時世尊在廣嚴城獼猴池側高閣堂中。",
        "translation": "It was then that the Bhagavān was in a high pavilion beside the rhesus monkey pond in Vaiśravaṇa's city.",
        "source": "T23n1443_010:0960b16_0"
    },
    {
        "source_sentence": "於此城中栗姑毘等自所住宅舉高六重，見諸苾芻尼所居卑下，即便為造高六七重嚴好房舍。",
        "translation": "In this city, Ristic and others built six or seven stories high dwelling houses of their own homes. Seeing the monks and nuns living in lowly places, they built six or seven stories high, beautiful dwelling houses for them.",
        "source": "T23n1443_010:0960b16_1"
    },
    {
        "source_sentence": "其舍經久多並隤壞，施主見已咸作是念：「我等現存，寺皆破壞，命過之後其欲如何？",
        "translation": "When the donors saw this, they all thought, “We are still alive. The monastery has been completely destroyed. What will we want after our lives pass away?",
        "source": "T23n1443_010:0960b19_2"
    },
    {
        "source_sentence": "我等宜應施無盡物令其營造。」",
        "translation": "It's appropriate for us to give inexhaustible things and cause them to be built.",
        "source": "T23n1443_010:0960b21_0"
    },
    {
        "source_sentence": "便持施物到苾芻尼所，報言：「聖者！",
        "translation": "He then took the gift to the bhikṣuṇī and reported, Sage!",
        "source": "T23n1443_010:0960b21_1"
    },
    {
        "source_sentence": "此是無盡施物，為擬修補，當可受之。」",
        "translation": "This is an inexhaustible gift that's intended to be cultivated and will be accepted.",
        "source": "T23n1443_010:0960b22_2"
    },
    {
        "source_sentence": "諸苾芻尼報曰：「世尊制戒，我不合受。」",
        "translation": "The monks and nuns replied, Bhagavān, the precepts are established by the Bhagavān, but I won't accept them.",
        "source": "T23n1443_010:0960b23_3"
    },
    {
        "source_sentence": "時諸苾芻尼白諸苾芻，苾芻白佛。",
        "translation": "The monks and nuns then told the monks, and the monks told the Buddha.",
        "source": "T23n1443_010:0960b24_4"
    },
    {
        "source_sentence": "佛告諸苾芻尼：「若為僧伽有所營造，得受無盡物。",
        "translation": "The Buddha told the monks and nuns, If you build something for the saṃgha, you'll be able to receive inexhaustible things.",
        "source": "T23n1443_010:0960b24_5"
    },
    {
        "source_sentence": "然苾芻毘訶羅應三重作，若苾芻尼應兩重作。」",
        "translation": "Still, monks and nuns should make it threefold, and if monks and nuns make it twofold.",
        "source": "T23n1443_010:0960b25_6"
    },
    {
        "source_sentence": "時諸苾芻尼得無盡物置僧庫中。",
        "translation": "The monks and nuns then obtained the inexhaustible property and placed it in the saṃgha's storehouse.",
        "source": "T23n1443_010:0960b27_0"
    },
    {
        "source_sentence": "時施主來問言：「聖者！",
        "translation": "The donor then came and asked, Sage!",
        "source": "T23n1443_010:0960b27_1"
    },
    {
        "source_sentence": "何意毘訶羅仍不修補？」",
        "translation": "What does it mean that Vaiśravaṇa still doesn't cultivate the patch?",
        "source": "T23n1443_010:0960b28_2"
    },
    {
        "source_sentence": "苾芻尼報言：「賢首！",
        "translation": "The monks and nuns replied, Good man!",
        "source": "T23n1443_010:0960b28_3"
    },
    {
        "source_sentence": "為無飲食。」",
        "translation": "It's because there's no food or drink.",
        "source": "T23n1443_010:0960b29_4"
    },
    {
        "source_sentence": "施主曰：「我豈不施無盡物耶？」",
        "translation": "The donor said, Don't I give inexhaustible things?",
        "source": "T23n1443_010:0960b29_5"
    },
    {
        "source_sentence": "報言：「賢首！",
        "translation": "He replied, Good man!",
        "source": "T23n1443_010:0960c01_6"
    },
    {
        "source_sentence": "其無盡物我豈敢食，安僧庫中今皆現在。」",
        "translation": "How could I dare to eat those inexhaustible things that are placed in the saṃgha's storehouse now?",
        "source": "T23n1443_010:0960c01_7"
    },
    {
        "source_sentence": "施主報曰：「其無盡物不合如是，我之家中豈無安處，何不迴易求生利耶？」",
        "translation": "The donor replied, That inexhaustible thing doesn't fit like this, so why wouldn't there be a peaceful place in my home and why wouldn't I turn around to seek the benefits of birth?",
        "source": "T23n1443_010:0960c02_8"
    },
    {
        "source_sentence": "尼曰：「佛遮我等不許求利。」",
        "translation": "The nun said, The Buddha obstructed us and didn't allow us to seek profit.",
        "source": "T23n1443_010:0960c03_9"
    },
    {
        "source_sentence": "諸尼白苾芻，苾芻白佛。",
        "translation": "The nuns told the monks, and the monks told the Buddha.",
        "source": "T23n1443_010:0960c04_10"
    },
    {
        "source_sentence": "佛言：「若為僧伽應求利潤。」",
        "translation": "The Buddha said, If you're a monk, you should seek profit for the sake of the saṃgha.",
        "source": "T23n1443_010:0960c05_0"
    },
    {
        "source_sentence": "聞佛語已，諸有信心婆羅門居士等，為佛法僧故施無盡物，此三寶物亦應迴轉求利，",
        "translation": "Having heard the Buddha’s words, the faithful brahman householders and others gave inexhaustible gifts for the sake of the Buddha, Dharma, and Sangha. These things belonging to the Triple Gem should also be turned around seeking profit.",
        "source": "T23n1443_010:0960c05_1"
    },
    {
        "source_sentence": "所得利物還於三寶而作供養。",
        "translation": "The benefits they receive return to the Three Treasures and make offerings to them.",
        "source": "T23n1443_010:0960c07_2"
    },
    {
        "source_sentence": "時諸苾芻尼還將此物與彼施主，索利之時多興諍競，便作是語：「聖者！",
        "translation": "The monks and nuns then returned this property to the donor, and when they asked for a reward, there were many arguments and disputes, so they said, Sage!",
        "source": "T23n1443_010:0960c08_3"
    },
    {
        "source_sentence": "豈我己物合鬪諍耶？」",
        "translation": "Isn't it the case that my own things are combined with a fight?",
        "source": "T23n1443_010:0960c09_4"
    },
    {
        "source_sentence": "時諸苾芻尼白諸苾芻，苾芻白佛。",
        "translation": "The monks and nuns then told the monks, and the monks told the Buddha.",
        "source": "T23n1443_010:0960c10_5"
    },
    {
        "source_sentence": "佛言：「不應共彼而作出息。」",
        "translation": "The Buddha said, You shouldn't make a cease together with them.",
        "source": "T23n1443_010:0960c11_6"
    },
    {
        "source_sentence": "復共富貴者而為出息，索物之時恃官勢故不肯相還，佛言：「不應共此而作交易。」",
        "translation": "Again, they shared the wealthy and noble for their own sake and didn't want to return because they relied on official power when they asked for property, and the Buddha said, You shouldn't share it with them and make a deal here.",
        "source": "T23n1443_010:0960c11_7"
    },
    {
        "source_sentence": "復共貧人而為出息，索時無物，佛言：「若與物時應可分明兩倍納質，",
        "translation": "Again, he went out with the poor man to collect his money and asked for nothing at the time. The Buddha said, “If you were to give me something, I would be able to pay double the amount [to my wages] by charging it.” When the poor man had done so, the Buddha said:",
        "source": "T23n1443_010:0960c13_8"
    },
    {
        "source_sentence": "書其券契并立保證，記其年月，安上座名及授事人字。",
        "translation": "He wrote the name of the superior monk and the names of the officials in charge, as well as the years and months of his service.",
        "source": "T23n1443_010:0960c15_0"
    },
    {
        "source_sentence": "假令信心鄔波索迦受五學處，亦應兩倍而納其質。」",
        "translation": "Suppose someone believes that Upāsaka receives the five places of training, and they should also accept their quality by doubling it.",
        "source": "T23n1443_010:0960c16_1"
    },
    {
        "source_sentence": "販賣學處第十三",
        "translation": "Thirteenth, the place of training in selling and selling goods.",
        "source": "T23n1443_010:0960c18_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_010:0960c19_0"
    },
    {
        "source_sentence": "時六眾苾芻種種交易取與買賣，賤糴貴糶貯畜而住，諸婆羅門長者見共譏恥。",
        "translation": "The six monks then bartered, bought, traded, and sold various merchandise, stored their valuables, and lived there, and the elders of the Brāhmaṇas were shameful to see them.",
        "source": "T23n1443_010:0960c19_1"
    },
    {
        "source_sentence": "諸苾芻白佛。",
        "translation": "The monks said to the Buddha,",
        "source": "T23n1443_010:0960c21_2"
    },
    {
        "source_sentence": "佛以此緣，同前集眾問實訶責，乃至「制其學處，應如是說：若復苾芻尼，",
        "translation": "Because of these reasons, the Buddha was likewise reprimanded by the assembly of monks and nuns who had previously assembled to ask questions in truth. Up to regulate their places of training, they should be instructed:",
        "source": "T23n1443_010:0960c21_3"
    },
    {
        "source_sentence": "種種賣買者，泥薩祇波逸底迦。」",
        "translation": "Various kinds of buyers and sellers are called nisajipāyattika.",
        "source": "T23n1443_010:0960c22_4"
    },
    {
        "source_sentence": "苾芻尼者，謂此法中尼。",
        "translation": "A bhikṣuṇī refers to a nun in this teaching.",
        "source": "T23n1443_010:0960c23_5"
    },
    {
        "source_sentence": "種種者，謂非一事。",
        "translation": "Various means that they are not one thing.",
        "source": "T23n1443_010:0960c24_6"
    },
    {
        "source_sentence": "取與買賣者，取謂餘處物賤、此處物貴，即從彼取。",
        "translation": "Taking and selling refers to the taking of things that are inferior in other places and valuable in this place, which is to take from them.",
        "source": "T23n1443_010:0960c24_7"
    },
    {
        "source_sentence": "與者，謂此處賤、餘處貴，即從此持去。",
        "translation": "Giving means that this place is inferior and the other places are valuable, so they're taken away from here.",
        "source": "T23n1443_010:0960c25_8"
    },
    {
        "source_sentence": "豐時買取、儉時當賣。",
        "translation": "When it's abundant, he buys it and sells it when he's frugal.",
        "source": "T23n1443_010:0960c26_9"
    },
    {
        "source_sentence": "泥薩祇者廣如前說。",
        "translation": "'Nisaṅga' is as explained above.",
        "source": "T23n1443_010:0960c27_10"
    },
    {
        "source_sentence": "此中犯者，苾芻尼為利故而作賣買，買時惡作，賣時犯捨墮。",
        "translation": "Here, the offender is a monk or nun who sells and buys for profit, does evil when he or she buys, and commits an equanimous offense when he or she sells.",
        "source": "T23n1443_010:0960c27_11"
    },
    {
        "source_sentence": "若為利故買、不為利賣，買時惡作，賣時無犯。",
        "translation": "If he buys it for profit and doesn't sell it for profit, he commits misdeeds when he buys it, and it's not a violation when he sells it.",
        "source": "T23n1443_010:0960c28_12"
    },
    {
        "source_sentence": "若不為利買、為利故賣，買時無犯，賣時捨墮。",
        "translation": "If someone doesn't buy for profit or sell for profit, there's no offense when they buy it, and they abandon it when they sell it.",
        "source": "T23n1443_010:0960c29_13"
    },
    {
        "source_sentence": "不為利買、不為利賣，二俱無犯。",
        "translation": "It's neither a violation to buy for profit nor sell for profit, and neither is a violation to both.",
        "source": "T23n1443_010:0961a01_14"
    },
    {
        "source_sentence": "若向餘方買物不為求利，到處賣時雖復得利，而無有犯。",
        "translation": "If someone buys goods from another place and doesn't seek profit, and even though they still get profit when they go to sell them, there's no offense.",
        "source": "T23n1443_010:0961a02_15"
    },
    {
        "source_sentence": "乞鉢學處第十四",
        "translation": "The 14th Place of Study for Begging bowls",
        "source": "T23n1443_010:0961a04_0"
    },
    {
        "source_sentence": "緣起廣說，具如苾芻律，乃至「制其學處，應如是說：若復苾芻尼，有鉢減五綴，",
        "translation": "Conditioned arising is extensively explained in accordance with the Bhikṣu vinaya, up to the point where one prescribes a place of training for him or her:",
        "source": "T23n1443_010:0961a05_0"
    },
    {
        "source_sentence": "堪得受用，為好故更求餘鉢，得者，泥薩祇波逸底迦。",
        "translation": "Those who are able to receive and use it and seek other bowls for good reasons, and those who obtain them are nisajipāyattika.",
        "source": "T23n1443_010:0961a06_1"
    },
    {
        "source_sentence": "彼苾芻尼當於眾中捨此鉢，取眾中最下鉢與彼苾芻尼，報言：『此鉢還汝，",
        "translation": "That bhikṣuṇī should abandon this bowl in the midst of the assembly and take the lowest bowl from among the bowls in the assembly and give it to that bhikṣuṇī.",
        "source": "T23n1443_010:0961a07_2"
    },
    {
        "source_sentence": "不應守持、不應分別，亦不施人，應自審詳，徐徐受用，乃至破應護持。",
        "translation": "You shouldn't guard it, don't discriminate it, and don't give it to someone; you should carefully examine yourself, slowly accept it, or even refute it.",
        "source": "T23n1443_010:0961a09_3"
    },
    {
        "source_sentence": "此是法。』」",
        "translation": "This is the teaching.'",
        "source": "T23n1443_010:0961a11_4"
    },
    {
        "source_sentence": "苾芻尼者，謂此法中尼，餘義如上。",
        "translation": "A bhikṣuṇī refers to a nun in this teaching, and the rest are as above.",
        "source": "T23n1443_010:0961a11_5"
    },
    {
        "source_sentence": "減五綴者，謂不滿五綴。",
        "translation": "Decreasing by five patches means that it doesn't fulfill the five patches.",
        "source": "T23n1443_010:0961a12_6"
    },
    {
        "source_sentence": "堪受用者，謂得守持。",
        "translation": "Those who are capable of receiving and using refers to those who can uphold it.",
        "source": "T23n1443_010:0961a12_7"
    },
    {
        "source_sentence": "為好故更求餘鉢者，為欲貪好更求第二鉢。",
        "translation": "Someone who seeks another bowl for good reasons and wants the second bowl because they want to crave goodness.",
        "source": "T23n1443_010:0961a13_8"
    },
    {
        "source_sentence": "好謂勝妙。",
        "translation": "Good is called superior and subtle.",
        "source": "T23n1443_010:0961a14_9"
    },
    {
        "source_sentence": "得者，謂求得入手。",
        "translation": "Attaining means seeking to attain it.",
        "source": "T23n1443_010:0961a14_10"
    },
    {
        "source_sentence": "泥薩祇者，廣說如上。",
        "translation": "A nisaji is explained in detail as above.",
        "source": "T23n1443_010:0961a14_11"
    },
    {
        "source_sentence": "彼苾芻尼，謂是犯人。",
        "translation": "That monk or nun is said to be a offender.",
        "source": "T23n1443_010:0961a15_12"
    },
    {
        "source_sentence": "彼苾芻尼應於眾中捨此鉢者，當於眾中應差一苾芻尼令行有犯鉢。",
        "translation": "If that monk or nun should abandon this bowl in the midst of the congregation, he or she should send a monk or nun among the congregation to cause someone who practices it to violate the bowl.",
        "source": "T23n1443_010:0961a15_13"
    },
    {
        "source_sentence": "若無五德不應差，若差不應令作。",
        "translation": "If there are no five virtues, they shouldn't be changed, and if they are changed, they shouldn't be made to do so.",
        "source": "T23n1443_010:0961a17_14"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T23n1443_010:0961a18_15"
    },
    {
        "source_sentence": "有愛、恚、怖、癡、不知行與不行。",
        "translation": "There's craving, anger, anger, fear, delusion, and ignorance that act and don't act.",
        "source": "T23n1443_010:0961a18_16"
    },
    {
        "source_sentence": "若具五德，未差應差，差已令作。",
        "translation": "If he possesses the five virtues, he should change them without changing them, and after changing them, he'll cause them to be done.",
        "source": "T23n1443_010:0961a19_17"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T23n1443_010:0961a19_18"
    },
    {
        "source_sentence": "反上應知。",
        "translation": "The opposite of the above should be known.",
        "source": "T23n1443_010:0961a20_19"
    },
    {
        "source_sentence": "應如是差，鳴犍稚集眾，先問：能不？",
        "translation": "You should thus make this distinction, sound the gandhi and gather the crowd, first asking, Can you do it?",
        "source": "T23n1443_010:0961a20_20"
    },
    {
        "source_sentence": "「汝某甲能與僧伽行有犯鉢不？」",
        "translation": "Can you, Mr. A., give the saṃgha to someone who practices with a transgressing bowl?",
        "source": "T23n1443_010:0961a21_21"
    },
    {
        "source_sentence": "彼答言：「能。」",
        "translation": "They replied, Yes.",
        "source": "T23n1443_010:0961a21_22"
    },
    {
        "source_sentence": "次一苾芻尼作白羯磨，如是應作(廣如百一羯磨)。",
        "translation": "The next monk or nun who makes a white karma should make it like this (as many as one hundred and one karmas).",
        "source": "T23n1443_010:0961a22_23"
    },
    {
        "source_sentence": "佛言：「行有犯鉢苾芻尼，所有行法我今說之。",
        "translation": "The Buddha said, If there's a monk or nun who violates the bowl and practices it, I'll explain all the rules of practice.",
        "source": "T23n1443_010:0961a22_24"
    },
    {
        "source_sentence": "其苾芻尼應在和合眾中作如是白：『大德！",
        "translation": "That monk or nun should say this to the congregation in harmony, 'O great virtuous one!",
        "source": "T23n1443_010:0961a23_25"
    },
    {
        "source_sentence": "我苾芻尼某甲，當行有犯鉢。",
        "translation": "I, a certain monk or nun, will practice with a bowl that's violated.",
        "source": "T23n1443_010:0961a24_26"
    },
    {
        "source_sentence": "諸大德！",
        "translation": "O great virtuous ones!",
        "source": "T23n1443_010:0961a25_27"
    },
    {
        "source_sentence": "明日各各自持己鉢來至僧中。』",
        "translation": "Each of them will bring their bowls to the saṃgha tomorrow.'",
        "source": "T23n1443_010:0961a25_28"
    },
    {
        "source_sentence": "既至明日，行鉢苾芻尼敷座褥，鳴犍稚，諸苾芻尼各持己鉢往至眾中。",
        "translation": "On the day after tomorrow, the monks and nuns who carried bowls spread out their seats and mattresses and sounded the gandharva. Each of them took their bowls and went to the assembly.",
        "source": "T23n1443_010:0961a26_29"
    },
    {
        "source_sentence": "時行鉢苾芻尼，應持其鉢向上座前立，讚歎其鉢：『上座！",
        "translation": "The monks and nuns who were carrying bowls at the time should take their bowls upstairs in front of the throne and praise their bowls, saying, 'O throne!",
        "source": "T23n1443_010:0961a28_30"
    },
    {
        "source_sentence": "此鉢清淨圓滿堪得受用，若欲得者隨意應取。』",
        "translation": "This bowl is pure and complete enough to be used, so if you want to get it, you should take it as you like.'",
        "source": "T23n1443_010:0961a29_31"
    },
    {
        "source_sentence": "若其上座取此鉢者，行鉢之人應取上座舊鉢，轉與第二上座。",
        "translation": "If the superior seat takes this bowl, the practitioner of the bowl should take the old bowl of the superior seat and give it to the second superior seat.",
        "source": "T23n1443_010:0961b01_32"
    },
    {
        "source_sentence": "若不取者轉與第三。",
        "translation": "If someone doesn't take it, they'll turn it to the third.",
        "source": "T23n1443_010:0961b02_33"
    },
    {
        "source_sentence": "第三取時，上座更索，初索不應與，第二索亦不應與，第三索應與，上座得越法罪，",
        "translation": "When he takes the third, the superior monk asks again, but the first request shouldn't be given; the second request shouldn't be given; the third request should be given; and the superior monk is guilty of transgressing the Dharma.",
        "source": "T23n1443_010:0961b03_34"
    },
    {
        "source_sentence": "如法應悔。",
        "translation": "They should repent according to the teaching.",
        "source": "T23n1443_010:0961b05_35"
    },
    {
        "source_sentence": "如是乃至眾中最小者取此鉢。",
        "translation": "Thus, even the smallest of the many takes this bowl.",
        "source": "T23n1443_010:0961b05_36"
    },
    {
        "source_sentence": "時行未了，第三方索鉢者，其法與上座相似。",
        "translation": "The third person who asks for a bowl before he's done so, which is similar to the superior monk's teaching.",
        "source": "T23n1443_010:0961b06_37"
    },
    {
        "source_sentence": "乃至行了所得一鉢，行鉢苾芻尼應持此鉢付彼苾芻尼，作如是語：『苾芻尼！",
        "translation": "Even if a monk or nun who practices the bowl and obtains one bowl after practicing it should carry this bowl and give it to that monk or nun, he or she will say, 'Monk or nun!",
        "source": "T23n1443_010:0961b07_38"
    },
    {
        "source_sentence": "此鉢不應分別，亦不與人，詳審徐徐如法而用，乃至破壞。",
        "translation": "This bowl shouldn't be discriminated, nor given to someone else; he carefully examines it and uses it slowly and gently according to the rules until it breaks down.",
        "source": "T23n1443_010:0961b08_39"
    },
    {
        "source_sentence": "此是其法。』",
        "translation": "This is their teaching.'",
        "source": "T23n1443_010:0961b10_40"
    },
    {
        "source_sentence": "若行鉢苾芻尼不依法行者，得越法罪。」",
        "translation": "If a monk or nun who practices the bowl and doesn't follow the Dharma will be guilty of transgressing the Dharma.",
        "source": "T23n1443_010:0961b10_41"
    },
    {
        "source_sentence": "佛言：「得鉢苾芻尼所有行法，我今當制。",
        "translation": "The Buddha said, Now, I will regulate all the practices of the bhikṣuṇī who obtains a bowl.",
        "source": "T23n1443_010:0961b11_42"
    },
    {
        "source_sentence": "應畜二鉢帒，好者應安長鉢，不好者應安舊鉢。",
        "translation": "You should store two bowls and bowls, a good bowl should be placed in a long bowl, and a bad bowl should be placed in an old bowl.",
        "source": "T23n1443_010:0961b12_43"
    },
    {
        "source_sentence": "若乞食時應將二鉢，得乾飯者著長鉢中，若得濕飯著舊鉢中。",
        "translation": "When you're begging for food, you should put two bowls in the long bowl if you get dry rice, and put dry rice in the old bowl if you get wet rice.",
        "source": "T23n1443_010:0961b13_44"
    },
    {
        "source_sentence": "至住處已作曼茶羅安置二鉢，應於舊鉢中食。",
        "translation": "When he arrives at his dwelling place, he makes a maṇḍala and places two bowls in the old bowl to eat.",
        "source": "T23n1443_010:0961b14_45"
    },
    {
        "source_sentence": "食已應先洗長鉢，次洗舊鉢。",
        "translation": "After he eats, he should first wash his long bowl and second wash his old bowl.",
        "source": "T23n1443_010:0961b15_46"
    },
    {
        "source_sentence": "如是乃至曬曝安置，皆以長鉢為先。",
        "translation": "Thus, it's always preceded by a long bowl until it's dried and placed in place.",
        "source": "T23n1443_010:0961b16_47"
    },
    {
        "source_sentence": "若內安龕及火熏時，皆於好處先安長鉢。",
        "translation": "If a niche and a fire are placed inside it, they'll all place a long bowl in the almsbowl first.",
        "source": "T23n1443_010:0961b17_48"
    },
    {
        "source_sentence": "若道行時，舊鉢遣人持，長鉢當自持。",
        "translation": "When he's walking on the path, his old bowl is sent to be held by someone else, and the long bowl should be held by himself.",
        "source": "T23n1443_010:0961b18_49"
    },
    {
        "source_sentence": "無人為擎者，長鉢安在左肩，舊鉢應安右畔，自持而去。",
        "translation": "The long bowl is placed on the left shoulder. The old bowl should be placed on the right side, hold its own bowl, and go away.",
        "source": "T23n1443_010:0961b19_0"
    },
    {
        "source_sentence": "若得鉢苾芻尼，於此行法不依行者，得越法罪。",
        "translation": "If a bhikṣuṇī obtains a bowl and doesn't rely on the practice of this practice, she'll be guilty of transgressing the law.",
        "source": "T23n1443_010:0961b20_1"
    },
    {
        "source_sentence": "此之治罰乃至盡形，或鉢破來應好守護。」",
        "translation": "This is a punishment up to the point where they'll be in full form, or when their bowl breaks down, they should guard it well.",
        "source": "T23n1443_010:0961b21_2"
    },
    {
        "source_sentence": "得泥薩祇者廣如上說。",
        "translation": "Those who attain nisaji are explained in detail as above.",
        "source": "T23n1443_010:0961b22_3"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_010:0961b22_4"
    },
    {
        "source_sentence": "若苾芻尼鉢破堪為一綴，雖未安綴尚得受用，更求餘鉢者，求時犯惡作罪，",
        "translation": "If a bhikṣuṇī's bowl breaks into pieces and is capable of being used as a single bowl, and even though it hasn't been worn, he or she can still experience it. Those who seek other bowls at the same time commit the sin of doing evil deeds.",
        "source": "T23n1443_010:0961b23_5"
    },
    {
        "source_sentence": "得便招捨墮。",
        "translation": "When he attains it, he'll then invite equanimity and fall.",
        "source": "T23n1443_010:0961b24_6"
    },
    {
        "source_sentence": "若苾芻尼鉢破堪為二綴，雖未安綴尚得受用，更求餘鉢，得罪同前。",
        "translation": "If a bhikṣuṇī's bowl breaks down and is capable of being made into two attachments, but even though it hasn't been set up, it can still be used, and if he asks for another bowl, the offense is the same as the previous one.",
        "source": "T23n1443_010:0961b25_7"
    },
    {
        "source_sentence": "如是三綴、四綴事亦如前。",
        "translation": "The same applies to these three forms of fasting and to the four forms of fasting.",
        "source": "T23n1443_010:0961b26_8"
    },
    {
        "source_sentence": "苾芻尼鉢破堪為一綴，安一綴已現得受用，更求餘鉢，求時惡作，得便捨墮。",
        "translation": "A bhikṣuṇī's bowl breaks into two pieces and becomes one piece, and once placed into one piece, he or she receives it in the present and then asks for another bowl. Seeking to do evil deeds at the time, he or she abandons them.",
        "source": "T23n1443_010:0961b27_9"
    },
    {
        "source_sentence": "如是乃至四綴，得罪亦爾。",
        "translation": "The same applies up to the fourfold dress.",
        "source": "T23n1443_010:0961b29_10"
    },
    {
        "source_sentence": "若鉢堪為五綴，隨綴不綴或堪用不堪用，便求餘鉢者無犯。",
        "translation": "If a bowl is capable of being decorated with five ornaments and doesn't decorate it accordingly or if it can't be used, then someone who asks for another bowl won't violate the precept.",
        "source": "T23n1443_010:0961b29_11"
    },
    {
        "source_sentence": "若鉢是買得或施得，此亦無犯。",
        "translation": "If the bowl is bought or given as a gift, it's not a violation either.",
        "source": "T23n1443_010:0961c02_0"
    },
    {
        "source_sentence": "自乞縷使非親織師織作衣學處第十五緣處廣說，具如苾芻律，乃至「制其學處，",
        "translation": "The fifteenth place of training in weaving clothes for self- beggars and messengers who are not themselves weavers is explained in detail in the context of the fifteenth place of training, as detailed in the Bhikṣu Vinaya, up to the point where they regulate their training.",
        "source": "T23n1443_010:0961c03_0"
    },
    {
        "source_sentence": "應如是說：若復苾芻尼，自乞縷線，使非親織師織作衣。",
        "translation": "You should explain it in this way: Again, if a monk or nun asks for thread on their own, he or she causes someone who isn't his or her own weaver to weave clothing.",
        "source": "T23n1443_010:0961c04_1"
    },
    {
        "source_sentence": "若得衣者，泥薩祇波逸底迦。」",
        "translation": "If someone obtains a robe, it's Nirvāṇarati-pāyattika.",
        "source": "T23n1443_010:0961c06_2"
    },
    {
        "source_sentence": "苾芻尼者，謂此法中尼，餘義如上。",
        "translation": "A bhikṣuṇī refers to a nun in this teaching, and the rest are as above.",
        "source": "T23n1443_010:0961c06_3"
    },
    {
        "source_sentence": "自乞縷者，或一兩半兩等。",
        "translation": "Someone who begs for thread on their own may ask for one-half, two-half, or so.",
        "source": "T23n1443_010:0961c07_4"
    },
    {
        "source_sentence": "使非親者，廣說如上。",
        "translation": "Those who aren't relatives are explained in detail as above.",
        "source": "T23n1443_010:0961c08_5"
    },
    {
        "source_sentence": "織師者，謂客織人。",
        "translation": "A weaver is a guest weaver.",
        "source": "T23n1443_010:0961c08_6"
    },
    {
        "source_sentence": "衣有七種，亦如上說。",
        "translation": "There are seven kinds of garments, as explained above.",
        "source": "T23n1443_010:0961c09_7"
    },
    {
        "source_sentence": "若得衣者犯捨墮，捨墮法如上。",
        "translation": "If someone who obtains a robe commits the offense of abandoning it, and the rules for abandoning it are as above.",
        "source": "T23n1443_010:0961c09_8"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_010:0961c10_9"
    },
    {
        "source_sentence": "若苾芻尼，從非親乞縷、使非親織，皆得惡作；",
        "translation": "If a bhikṣuṇī weaves thread that is not his or her own begging thread, or woven by an envoy who is not his or her own weaver, he or she will commit misdeeds.",
        "source": "T23n1443_010:0961c10_10"
    },
    {
        "source_sentence": "得衣之時，便犯捨墮。",
        "translation": "When they obtain their robes, they'll then violate the rules of forfeiture.",
        "source": "T23n1443_010:0961c11_11"
    },
    {
        "source_sentence": "苾芻尼從非親乞縷、使親織衣，乞時惡作，得衣無罪。",
        "translation": "A bhikṣuṇī who doesn't personally beg for thread or asks someone else to weave clothing and does evil at the time of begging gets a garment without guilt.",
        "source": "T23n1443_010:0961c12_12"
    },
    {
        "source_sentence": "苾芻尼從親乞縷、使非親織，乞時無犯，得衣捨墮。",
        "translation": "A bhikṣuṇī who begs for thread from a relative or an envoy who's not a relative and weaves it, doesn't violate the precept when begging, and he or she obtains his or her robe and drops it.",
        "source": "T23n1443_010:0961c13_13"
    },
    {
        "source_sentence": "苾芻尼從親乞縷、使親而織，二俱無犯。",
        "translation": "A bhikṣuṇī weaves thread from a relative's begging and an envoy's relative's weaving, neither of which is a violation.",
        "source": "T23n1443_010:0961c14_14"
    },
    {
        "source_sentence": "苾芻尼從非親乞縷、自織其疊，乞時惡作，衣成亦惡作。",
        "translation": "A bhikṣuṇī who begs for thread from someone who isn't a relative and weaves his own cotton cloth does badly at the time of begging, and he or she does so when the cloth is made.",
        "source": "T23n1443_010:0961c15_15"
    },
    {
        "source_sentence": "苾芻尼從親乞縷、自織其疊，乞時無犯，衣成惡作。",
        "translation": "When a monk or nun begs for thread from his or her relatives and weaves his or her own cloth, it's not a violation when he or she begs, and the garment becomes badly done.",
        "source": "T23n1443_010:0961c16_16"
    },
    {
        "source_sentence": "若酬價者無犯。",
        "translation": "If someone pays the price, it's not a violation.",
        "source": "T23n1443_010:0961c17_17"
    },
    {
        "source_sentence": "勸織師學處第十六",
        "translation": "The Sixteenth Place of Study for Encouragement to Weavers",
        "source": "T23n1443_010:0961c19_0"
    },
    {
        "source_sentence": "緣處廣說，如苾芻律，乃至「制其學處，應如是說：若復苾芻尼，有非親居士、居士婦，",
        "translation": "Conditioned by the place of residence, it is spoken of elaborately: as in the Vinaya for monks and nuns. Up to regulating their places of training, they should be explained in this way:",
        "source": "T23n1443_010:0961c20_0"
    },
    {
        "source_sentence": "為苾芻尼使非親織師織作衣。",
        "translation": "It's for a bhikṣuṇī to cause someone who isn't a relative weavers to weave clothing that's made by a master.",
        "source": "T23n1443_010:0961c21_1"
    },
    {
        "source_sentence": "此苾芻尼先不受請，便生異念，詣彼織師所作如是言：『汝今知不？",
        "translation": "This bhikṣuṇī didn't accept the invitation, so she had a different thought. She went to the weaver and said, 'Do you know now?'",
        "source": "T23n1443_010:0961c22_2"
    },
    {
        "source_sentence": "此衣為我織。",
        "translation": "This robe is woven for me.",
        "source": "T23n1443_010:0961c24_3"
    },
    {
        "source_sentence": "善哉織師！",
        "translation": "Excellent, weaver!",
        "source": "T23n1443_010:0961c24_4"
    },
    {
        "source_sentence": "應好織淨梳治善揀擇極堅打，我當以少鉢食、或鉢食類、或復食直而相濟給。』",
        "translation": "You should weave it well, comb it cleanly, dress it well, and choose a very hard beating, and I'll give it to you with a little bowl food, some bowl food, or some other food that's straightforward.'",
        "source": "T23n1443_010:0961c24_5"
    },
    {
        "source_sentence": "若苾芻尼以如是物與織師求得衣者，泥薩祇波逸底迦。」",
        "translation": "If a monk or nun gives such things to a weaver and asks for a robe with them, it's nisajipāyattika.",
        "source": "T23n1443_010:0961c26_6"
    },
    {
        "source_sentence": "苾芻尼者，謂此法中尼，餘義如上。",
        "translation": "A bhikṣuṇī refers to a nun in this teaching, and the rest are as above.",
        "source": "T23n1443_010:0961c27_7"
    },
    {
        "source_sentence": "親非親義乃至七種衣，廣如上說。",
        "translation": "What's close and what's not close, up to the seven kinds of clothing, are explained in detail as above.",
        "source": "T23n1443_010:0961c28_8"
    },
    {
        "source_sentence": "先不受請者，謂未曾告知。",
        "translation": "Someone who previously didn't accept the invitation means they haven't been told.",
        "source": "T23n1443_010:0961c29_9"
    },
    {
        "source_sentence": "便生異念者，謂心欲求衣。",
        "translation": "Someone who immediately gives rise to dissimilar thoughts means that the mind desires clothing.",
        "source": "T23n1443_010:0961c29_10"
    },
    {
        "source_sentence": "語彼織師等者，謂自述其意。",
        "translation": "He who speaks to those weavers and so forth means he explains his own thoughts.",
        "source": "T23n1443_010:0962a01_11"
    },
    {
        "source_sentence": "為我織者，明為己身。",
        "translation": "Weavers who weave for self explain that they weave for themselves.",
        "source": "T23n1443_010:0962a02_12"
    },
    {
        "source_sentence": "應好織者，欲令衣長善應量故。",
        "translation": "It should be woven well because it wants to make the garments long and well-proportioned.",
        "source": "T23n1443_010:0962a02_13"
    },
    {
        "source_sentence": "淨梳治者，欲令衣廣及鮮白故。",
        "translation": "It's because they want to make their robes wide and pure white.",
        "source": "T23n1443_010:0962a03_14"
    },
    {
        "source_sentence": "善揀擇者，謂除其結纇令精細故。",
        "translation": "Those who skillfully discriminate are those who remove the fetters and make them subtle by removing the fetters.",
        "source": "T23n1443_010:0962a04_15"
    },
    {
        "source_sentence": "極堅打者，欲令滑澤及密緻故。",
        "translation": "It's extremely hard to beat because it wants to make it slippery and dense.",
        "source": "T23n1443_010:0962a04_16"
    },
    {
        "source_sentence": "我當以鉢食者，謂與五種珂但尼食、五種蒲膳尼食。",
        "translation": "I will give five kinds of food to the kṣatriyas and five kinds of food to the upāsikā.",
        "source": "T23n1443_010:0962a05_17"
    },
    {
        "source_sentence": "或以鉢食之類者，謂生穀等。",
        "translation": "Or it's a type of bowl-eating food, which is produced from grain and so forth.",
        "source": "T23n1443_010:0962a06_18"
    },
    {
        "source_sentence": "或復食直者，謂與其價。",
        "translation": "Or another person who eats straight refers to giving it for its price.",
        "source": "T23n1443_010:0962a07_19"
    },
    {
        "source_sentence": "言苾芻尼者，謂此法中尼。",
        "translation": "The term bhikṣuṇī refers to the nun in this teaching.",
        "source": "T23n1443_010:0962a07_20"
    },
    {
        "source_sentence": "以如是物者，謂是上事。",
        "translation": "Because such things are like this, it's called a superior thing.",
        "source": "T23n1443_010:0962a08_21"
    },
    {
        "source_sentence": "得衣者，得衣入手。",
        "translation": "Someone who obtains a garment acquires the garment when he obtains it.",
        "source": "T23n1443_010:0962a09_22"
    },
    {
        "source_sentence": "泥薩祇者，並如上說。",
        "translation": "The nisaji is as has been said above.",
        "source": "T23n1443_010:0962a09_23"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_010:0962a10_0"
    },
    {
        "source_sentence": "若苾芻尼為求衣故，從座而起整理衣服，持二五食等授與織師，勸令好織皆得惡作，",
        "translation": "If a bhikṣuṇī, out of desire for clothing, rises from her seat and arranges his or her clothes, takes two or five kinds of food and gives them to a weaver with the encouragement that good weavers will all attain bad work,",
        "source": "T23n1443_010:0962a10_1"
    },
    {
        "source_sentence": "得衣犯捨墮。",
        "translation": "When he obtains a robe, he violates the rules and abandons it.",
        "source": "T23n1443_010:0962a12_2"
    },
    {
        "source_sentence": "親非親等並如上說。",
        "translation": "What's related and what's not related are as explained above.",
        "source": "T23n1443_010:0962a12_3"
    },
    {
        "source_sentence": "奪衣學處第十七",
        "translation": "The Seventeenth Place of Study for Taking Off Your Clothes",
        "source": "T23n1443_010:0962a14_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_010:0962a15_0"
    },
    {
        "source_sentence": "時難提苾芻與弟子衣，告言：「共汝遊行人間。」",
        "translation": "The monk Nandi then gave his disciple's robe and told him, Travel among the people with you.",
        "source": "T23n1443_010:0962a15_1"
    },
    {
        "source_sentence": "弟子情不欲去，難提苾芻却奪其衣。",
        "translation": "The disciple's feeling didn't want to leave, so the monk Nandi snatched his robe.",
        "source": "T23n1443_010:0962a16_2"
    },
    {
        "source_sentence": "時諸苾芻以事白佛。",
        "translation": "The monks then reported the matter to the Buddha.",
        "source": "T23n1443_010:0962a17_3"
    },
    {
        "source_sentence": "佛以此緣，同前集眾問實訶責，廣說乃至「制其學處，應如是說：「若復苾芻尼，",
        "translation": "For this reason, the Buddha shared the previous assembly of monks and nuns who had been questioned and reprimanded, explaining in detail up to the point where they were restrained from training, saying:",
        "source": "T23n1443_010:0962a17_4"
    },
    {
        "source_sentence": "與苾芻尼衣，彼於後時惱瞋罵詈生嫌賤心，若自奪、若教人奪，報言：『還我衣來，",
        "translation": "When he gives a bhikṣuṇī's robe to a woman, she becomes angry and reviles at later moments and becomes disgusted. If he takes it for himself or teaches someone else to take it, he replies, saying, 'Give me back my robe.",
        "source": "T23n1443_010:0962a19_5"
    },
    {
        "source_sentence": "不與汝。』",
        "translation": "I won't give it to you.'",
        "source": "T23n1443_010:0962a21_6"
    },
    {
        "source_sentence": "若衣離彼身、自受用者，泥薩祇波逸底迦。」",
        "translation": "If the robe is free of that body and self-enjoyed, it's a niṣāyattikā.",
        "source": "T23n1443_010:0962a21_7"
    },
    {
        "source_sentence": "苾芻尼者，謂此法中尼。",
        "translation": "A bhikṣuṇī refers to a nun in this teaching.",
        "source": "T23n1443_010:0962a22_8"
    },
    {
        "source_sentence": "與苾芻尼者，謂與餘尼。",
        "translation": "To give it to a bhikṣuṇī is to give it to another nun.",
        "source": "T23n1443_010:0962a22_9"
    },
    {
        "source_sentence": "衣有七種，如前廣說。",
        "translation": "There are seven kinds of garments:",
        "source": "T23n1443_010:0962a23_10"
    },
    {
        "source_sentence": "與衣者，謂與共住門人或復餘類。",
        "translation": "Giving robes means giving them to someone who lives together with the gatekeeper or other kinds of people.",
        "source": "T23n1443_010:0962a23_11"
    },
    {
        "source_sentence": "後時者，謂於別日。",
        "translation": "The latter time refers to a different day.",
        "source": "T23n1443_010:0962a24_12"
    },
    {
        "source_sentence": "惱瞋罵詈生嫌賤心者，謂身語心現瞋恚相。",
        "translation": "Disturbing anger and reviling gives rise to a mind of dislike, which is defined as the manifestation of anger in body, speech, and mind.",
        "source": "T23n1443_010:0962a25_13"
    },
    {
        "source_sentence": "自作、使人奪，取彼衣離身者，謂總離身。",
        "translation": "Someone who takes the robe and parts with his body when he makes it for himself or causes someone else to take it from him means that he parts with his body in general.",
        "source": "T23n1443_010:0962a26_14"
    },
    {
        "source_sentence": "自受用者，謂是屬己。",
        "translation": "self-enjoyment means that it belongs to oneself.",
        "source": "T23n1443_010:0962a27_0"
    },
    {
        "source_sentence": "釋罪名者，廣如前說。",
        "translation": "The explanation of the name of the offense is as explained above.",
        "source": "T23n1443_010:0962a27_1"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_010:0962a27_2"
    },
    {
        "source_sentence": "有三種相：謂身、語、二俱。",
        "translation": "There are three kinds of characteristic marks: bodily, verbal and twofold.",
        "source": "T23n1443_010:0962a28_3"
    },
    {
        "source_sentence": "身者，若先與衣後懷瞋恨，手自奪取或牽或挽，然口不言，乃至衣角未離身來得惡作罪，",
        "translation": "A body is when someone first gives a garment and then harbors anger, takes it with his own hand or pulls it or pulls it but doesn't say anything, even to the point where the horns of the garment don't part from the body and commits a misdeed.",
        "source": "T23n1443_010:0962a29_0"
    },
    {
        "source_sentence": "離身之時便招捨墮，是名身業。",
        "translation": "When he leaves his body, he then invites equanimity and falls, which is called bodily action.",
        "source": "T23n1443_010:0962b02_0"
    },
    {
        "source_sentence": "語者，謂出瞋言而奪彼衣不動身手，結罪同前。",
        "translation": "A voice means to speak angrily and steal that robe without moving one's body or hands, which is the same as the previous sin.",
        "source": "T23n1443_010:0962b02_1"
    },
    {
        "source_sentence": "二俱者，謂以身語而奪其衣，結罪同前。",
        "translation": "The second is with both: taking away one’s clothes by body or speech.",
        "source": "T23n1443_010:0962b03_2"
    },
    {
        "source_sentence": "言教他者，若教苾芻尼奪彼衣時，衣未離身，二俱惡作；",
        "translation": "When someone tells a bhikṣuṇī to steal another’s robe, the robe does not leave his or her body when he or she is told to steal.",
        "source": "T23n1443_010:0962b04_3"
    },
    {
        "source_sentence": "若離身者，俱得墮罪，主有捨過。",
        "translation": "If someone parts with their body, they'll both fall into sins, and the lord has the fault of abandoning it.",
        "source": "T23n1443_010:0962b06_4"
    },
    {
        "source_sentence": "若教苾芻奪罪亦同此，下之三眾皆得惡作。",
        "translation": "If he teaches a monk to snatch it, the same offense is committed, and the next three groups of people will all commit misdeeds.",
        "source": "T23n1443_010:0962b06_5"
    },
    {
        "source_sentence": "若諸俗人男女奪者，得無量罪。",
        "translation": "If secular people take it from men and women, they'll be guilty of an immeasurable offense.",
        "source": "T23n1443_010:0962b07_6"
    },
    {
        "source_sentence": "無犯者有二種：一、為難事，二、為順教。",
        "translation": "There are two kinds of people who aren't offenders: 1. those who do difficult things and 2. those who follow the teaching.",
        "source": "T23n1443_010:0962b08_7"
    },
    {
        "source_sentence": "言難事者，若其二師見己門徒於恐怖等處，或在非時河岸涉險，恐其失落強奪彼衣，",
        "translation": "Those who say it's difficult to work: if their two teachers see their disciples in places like fear or on dangerous river banks at an ungodly hour and are afraid they'll lose their robes and forcibly take them away.",
        "source": "T23n1443_010:0962b09_8"
    },
    {
        "source_sentence": "此皆無犯。",
        "translation": "These are all non-transgressions.",
        "source": "T23n1443_010:0962b11_9"
    },
    {
        "source_sentence": "言順教者，若師見門徒與惡知識而為狎習、或同路行去，奪取其衣勿令造惡，",
        "translation": "Someone who follows the teaching means that if a teacher sees his disciples or bad friends and engages in sexual misconduct, or if they're traveling together, he takes their robes and doesn't allow them to do evil.",
        "source": "T23n1443_010:0962b11_10"
    },
    {
        "source_sentence": "是名順教。",
        "translation": "This is called following the teaching.",
        "source": "T23n1443_010:0962b13_11"
    },
    {
        "source_sentence": "迴眾物入己學處第十八",
        "translation": "Turning back all things into one's own place of training, number 18",
        "source": "T23n1443_010:0962b14_0"
    },
    {
        "source_sentence": "緣處廣說，具如苾芻律，乃至「制其學處，應如是說：若復苾芻尼，知他與眾物，",
        "translation": "Their conditions are explained in detail, as is the case with the bhikṣu vinaya, up to the point where they regulate their places of training, which should be explained like this:",
        "source": "T23n1443_010:0962b15_0"
    },
    {
        "source_sentence": "自迴入己者，泥薩祇波逸底迦。」",
        "translation": "Those who turn themselves back into themselves are nisvāda pratyekabuddhas.",
        "source": "T23n1443_010:0962b16_1"
    },
    {
        "source_sentence": "苾芻尼者，謂此法中尼。",
        "translation": "A bhikṣuṇī refers to a nun in this teaching.",
        "source": "T23n1443_010:0962b17_2"
    },
    {
        "source_sentence": "知者，或自知或因他告知。",
        "translation": "Knower: Someone who knows it for themselves or tells it to others because they know it.",
        "source": "T23n1443_010:0962b17_3"
    },
    {
        "source_sentence": "僧伽者，謂佛聲聞弟子。",
        "translation": "A monk is a disciple of the Buddha or śrāvaka.",
        "source": "T23n1443_010:0962b18_4"
    },
    {
        "source_sentence": "眾物者，有二種：謂食利物、衣利物，此處所言，謂是衣利。",
        "translation": "There are two kinds of things, which are food for profit and clothing for profit. What is mentioned here is clothing for profit.",
        "source": "T23n1443_010:0962b19_5"
    },
    {
        "source_sentence": "迴者，物定屬他，化將入己。",
        "translation": "Someone who turns back means that things are bound to belong to others, and their transformation is about to enter themselves.",
        "source": "T23n1443_010:0962b20_6"
    },
    {
        "source_sentence": "泥薩祇波逸底迦，釋罪如上。",
        "translation": "Niṣāyattikā explains the offense as above.",
        "source": "T23n1443_010:0962b20_7"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_010:0962b21_8"
    },
    {
        "source_sentence": "若苾芻尼知屬一苾芻尼物，自迴入己，迴時惡作，得便捨墮。",
        "translation": "If a monk or nun knows that they belong to one monk or nun's property, he or she returns it to himself or herself and does evil deeds at the time of returning it, then he or she will abandon it.",
        "source": "T23n1443_010:0962b22_9"
    },
    {
        "source_sentence": "如是乃至知屬二人、三人、或屬僧伽，自迴入己，得罪同前。",
        "translation": "If someone thus knows that they belong to two, three people, or a saṃgha and turns back into themselves, the offense will be the same as the previous one.",
        "source": "T23n1443_010:0962b23_10"
    },
    {
        "source_sentence": "若苾芻尼知屬一苾芻尼物，迴與他一人，迴時惡作，得時亦惡作。",
        "translation": "If a bhikṣuṇī knows that it belongs to one bhikṣuṇī and returns it to another person, he or she will do evil when he or she returns it, and he or she will do evil when he or she obtains it.",
        "source": "T23n1443_010:0962b24_11"
    },
    {
        "source_sentence": "如是乃至知屬一人，迴與二人、三人、或迴與僧伽，得罪同前。",
        "translation": "If someone thus knows they belong to one person and returns it to two people, three people, or a saṃgha, the offense is the same as the previous one.",
        "source": "T23n1443_010:0962b26_12"
    },
    {
        "source_sentence": "若苾芻尼知屬僧伽物，迴與一人，迴時惡作，得時亦惡作。",
        "translation": "If a bhikṣuṇī knows that it belongs to the saṃgha and returns it to one person, he or she does evil when he or she returns it, and he or she does evil when he or she obtains it.",
        "source": "T23n1443_010:0962b27_13"
    },
    {
        "source_sentence": "如是乃至知屬僧伽，迴與二人、三人，迴時惡作，得時亦惡作。",
        "translation": "Thus, it's even known that they belong to the saṃgha and are given back to two or three people, who do bad actions when they turn around and do bad actions when they attain them.",
        "source": "T23n1443_010:0962b28_14"
    },
    {
        "source_sentence": "若苾芻尼知屬一僧伽物，迴與多僧伽，迴時惡作，得時亦惡作。",
        "translation": "If a monk or nun knows that they belong to one property of the saṃgha and returns it to many saṃgha, he or she will do evil when he or she returns it, and he or she will do evil when he or she obtains it.",
        "source": "T23n1443_010:0962c01_15"
    },
    {
        "source_sentence": "若知與苾芻尼僧伽，迴與苾芻僧伽；",
        "translation": "If he knows the saṃgha is given to a bhikṣuṇī, he returns it to that bhikṣu.",
        "source": "T23n1443_010:0962c02_16"
    },
    {
        "source_sentence": "知與苾芻僧伽，迴與苾芻尼僧伽；",
        "translation": "Knowing to give it to the monks and nuns, one returns it to the monks and nuns.",
        "source": "T23n1443_010:0962c03_17"
    },
    {
        "source_sentence": "知與二部僧伽，迴與苾芻僧伽；",
        "translation": "Knowing this, they give it to the twofold sangha and return it to the bhikṣu sangha.",
        "source": "T23n1443_010:0962c04_18"
    },
    {
        "source_sentence": "知與二部僧伽，迴與苾芻尼僧伽；",
        "translation": "Knowing this, they give it to the twofold assembly and return it to the bhikṣuṇī.",
        "source": "T23n1443_010:0962c05_0"
    },
    {
        "source_sentence": "若知與苾芻僧伽，迴與二部僧伽；",
        "translation": "If someone knows to give it to the monks and nuns, they return it to the two orders of monks.",
        "source": "T23n1443_010:0962c05_1"
    },
    {
        "source_sentence": "知與苾芻尼僧伽物，迴與二部僧伽；",
        "translation": "Knowing to give things to the bhikṣuṇīs and nuns, they return them to the two orders of monks.",
        "source": "T23n1443_010:0962c06_2"
    },
    {
        "source_sentence": "若其僧伽破為二部，知與此部，迴與彼部；",
        "translation": "If the saṃghâva is divided into two divisions, one gives it to this division and returns it to that other division.",
        "source": "T23n1443_010:0962c07_3"
    },
    {
        "source_sentence": "或知與此寺，迴與彼寺，知與此房，迴與彼房；",
        "translation": "Or they may know to give this monastery and return it to another monastery; or they may know to give this room [to me] and return it to that room.",
        "source": "T23n1443_010:0962c08_4"
    },
    {
        "source_sentence": "知與此廊，迴與彼廊；",
        "translation": "Knowing to give it to this corridor, they return it to that other corridor.",
        "source": "T23n1443_010:0962c09_5"
    },
    {
        "source_sentence": "或於房廊更互迴與，或與此柱間迴與彼柱間，或柱間物迴與門處，或以門物迴與閣上，",
        "translation": "Or they may return to each other in a corridor, or between these pillars and those pillars, or between the pillars and the doorway, or by means of the doors and things inside the pavilion.",
        "source": "T23n1443_010:0962c09_6"
    },
    {
        "source_sentence": "如是廣說，乃至展轉相迴，皆得惡作。",
        "translation": "Thus explained in detail, they'll all attain bad actions in turn.",
        "source": "T23n1443_010:0962c11_7"
    },
    {
        "source_sentence": "若苾芻尼，知與此佛像物，迴與餘佛像；",
        "translation": "Suppose a bhikṣuṇī, knowing what he or she has given to an image of this buddha, returns it to another one.",
        "source": "T23n1443_010:0962c12_8"
    },
    {
        "source_sentence": "若知與此窣覩波物，迴與餘窣覩波；",
        "translation": "Suppose someone knows that they give this garbha thing to the garbha and return it to the other garbha.",
        "source": "T23n1443_010:0962c13_9"
    },
    {
        "source_sentence": "若知與踏道初蹬，迴與第二等、或迴與塔身、或與簷級；",
        "translation": "If you know that it is the same as the first step of a stepping stones or the second one, turn it around and give it to the body of a stupa or the eaves.",
        "source": "T23n1443_010:0962c14_10"
    },
    {
        "source_sentence": "或此畔物迴與餘畔、或迴與覆鉢、或迴與方臺輪相初級乃至寶瓶法輪立柱、或復從此迴至下基，",
        "translation": "Or this side may be turned back to the other side, or it may be turned back to cover the bowl, or it may be turned back to the shape of a square dais or even the first level up to the place where the precious vial and the dharma-wheel stands, or it may again turn from here down to the base.",
        "source": "T23n1443_010:0962c15_11"
    },
    {
        "source_sentence": "如上迴互皆得惡作罪。",
        "translation": "As above, they'll all be guilty of misdeeds.",
        "source": "T23n1443_010:0962c17_12"
    },
    {
        "source_sentence": "若王力使迴者，無犯。",
        "translation": "If the king's power causes someone to turn back, it's not a violation.",
        "source": "T23n1443_010:0962c18_13"
    },
    {
        "source_sentence": "若欲與此貧人物，迴與彼貧人，得惡作罪。",
        "translation": "If you want to give it to this poor man and return it to that poor man, you'll be guilty of a misdeed.",
        "source": "T23n1443_010:0962c18_14"
    },
    {
        "source_sentence": "若覓不得者，迴與無犯。",
        "translation": "If someone doesn't find it, they return it to them without violating the precepts.",
        "source": "T23n1443_010:0962c19_15"
    },
    {
        "source_sentence": "若苾芻尼，與此傍生食，迴與彼傍生，得惡作罪。",
        "translation": "If a monk or nun gives food to this bystander and returns it to that bystander, he or she commits the misdeed.",
        "source": "T23n1443_010:0962c20_16"
    },
    {
        "source_sentence": "若覓不得，迴與無犯。",
        "translation": "If he doesn't find it, he returns it to him without violating the rules.",
        "source": "T23n1443_010:0962c21_17"
    },
    {
        "source_sentence": "若擬與傍生物迴將與人，擬與人物迴與傍生，得惡作罪。",
        "translation": "If someone intends to return it to an animal that's nearby and give it to someone else, or if they intend to return it to an animal that's nearby and give it to someone else, they'll be guilty of a misdeed.",
        "source": "T23n1443_010:0962c22_0"
    },
    {
        "source_sentence": "若與出家物迴與俗人，或復翻此，得惡作罪；",
        "translation": "If one gives the property of a renunciant to a layman and returns it to him or vice versa, they commit an evil deed.",
        "source": "T23n1443_010:0962c23_1"
    },
    {
        "source_sentence": "若覓不得者無犯。",
        "translation": "If someone doesn't find it, it's not a violation.",
        "source": "T23n1443_010:0962c24_2"
    },
    {
        "source_sentence": "如是女男半擇迦、苾芻及下三眾，若多若少與此與彼，更相迴互准前應說。",
        "translation": "Thus, these women and men, half a tathāgata, monks, and the next three groups of people, whether numerous or few, are given to this and that, and they go back and forth with each other as explained above.",
        "source": "T23n1443_010:0962c24_3"
    },
    {
        "source_sentence": "若覓不得，雖違本心與餘無犯。",
        "translation": "If someone doesn't find it, it's not a violation even though they disobey their original mind and the others.",
        "source": "T23n1443_010:0962c26_4"
    },
    {
        "source_sentence": "服過七日藥學處第十九",
        "translation": "He takes the prescription for seven days and goes to the nineteenth place of training.",
        "source": "T23n1443_010:0962c28_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_010:0962c29_0"
    },
    {
        "source_sentence": "時尊者畢陵伽婆蹉門人弟子，所有諸藥自觸令他觸、或與飲食細末相雜、或更互相和、或自類相染，",
        "translation": "The disciples of the venerable Pilinda-vatsa then touched each other with their own medicines and caused others to touch them, or mixed them with subtle powders of food and drink, or mixed them together again and again, or stained each other in their own way.",
        "source": "T23n1443_010:0962c29_1"
    },
    {
        "source_sentence": "同在一處不知應捨不捨、時與非時，任情取食。",
        "translation": "When they are in the same place, they don't know what to abandon or not abandon, and at the right time or wrong time, they freely take food with their feelings.",
        "source": "T23n1443_010:0963a02_2"
    },
    {
        "source_sentence": "諸有少欲苾芻，見是事已起嫌賤心，以緣白佛。",
        "translation": "When some monks with few desires saw this, they became disgusted and reported it to the Buddha for his sake.",
        "source": "T23n1443_010:0963a03_3"
    },
    {
        "source_sentence": "佛以此緣，同前集眾問實訶責，廣說乃至「制其學處，應如是說：如世尊說，",
        "translation": "For this reason, the Buddha similarly reprimanded the assembly of monks who had previously assembled and questioned them in truth. He extensively explained [the doctrine] up to the point where he instructed them:",
        "source": "T23n1443_010:0963a04_4"
    },
    {
        "source_sentence": "聽諸病苾芻尼所有諸藥隨意服食，謂酥、油、糖、蜜，於七日中應自守持觸宿而服。",
        "translation": "He listens to the medicines that sick monks and nuns take as they wish, which are called butter, oil, sugar, and honey, and for seven days he or she takes them on his or her own, keeping them in touch with the constellations.",
        "source": "T23n1443_010:0963a06_5"
    },
    {
        "source_sentence": "若苾芻尼過七日服者，泥薩祇波逸底迦。」",
        "translation": "If a bhikṣuṇī takes it for more than seven days, he'll be disciplined by nisvāda pratyekabuddha.",
        "source": "T23n1443_010:0963a08_6"
    },
    {
        "source_sentence": "如世尊者，謂如來應正等覺。",
        "translation": "It's like the Bhagavān, which means that the Tathāgata should be perfectly enlightened.",
        "source": "T23n1443_010:0963a09_7"
    },
    {
        "source_sentence": "說者，有所曉示。",
        "translation": "Someone who teaches something clearly shows it.",
        "source": "T23n1443_010:0963a09_8"
    },
    {
        "source_sentence": "病苾芻尼者，謂此法中尼身嬰疾病。",
        "translation": "A sick bhikṣuṇī refers to a nun who's sick with an illness in the body of a nun in this teaching.",
        "source": "T23n1443_010:0963a10_9"
    },
    {
        "source_sentence": "所有諸藥隨意服食者，謂與病狀相宜清淨堪食。",
        "translation": "Those who take the medicines as they wish because they're appropriate and pure enough to eat according to their illnesses are those who take them at will.",
        "source": "T23n1443_010:0963a11_0"
    },
    {
        "source_sentence": "酥者，謂諸酥。",
        "translation": "butter refers to various kinds of butter.",
        "source": "T23n1443_010:0963a12_1"
    },
    {
        "source_sentence": "油謂諸油。",
        "translation": "Oil refers to oil.",
        "source": "T23n1443_010:0963a12_2"
    },
    {
        "source_sentence": "糖謂沙糖。",
        "translation": "sugar refers to sand and sugar.",
        "source": "T23n1443_010:0963a12_3"
    },
    {
        "source_sentence": "蜜謂蜂蜜。",
        "translation": "Honey is honey.",
        "source": "T23n1443_010:0963a12_4"
    },
    {
        "source_sentence": "於七日者，謂七日夜。",
        "translation": "On the seventh day, it's seven days and nights.",
        "source": "T23n1443_010:0963a13_5"
    },
    {
        "source_sentence": "應自守持宿觸而服者，謂得自取而食。",
        "translation": "Someone who takes it by guarding themselves with past contact means that they can take it on their own and eat it.",
        "source": "T23n1443_010:0963a13_6"
    },
    {
        "source_sentence": "過七日者，謂越限齊。",
        "translation": "The one who goes beyond seven days means that they go beyond the limitations.",
        "source": "T23n1443_010:0963a14_7"
    },
    {
        "source_sentence": "泥薩祇波逸底迦者，此物應捨罪應說悔。",
        "translation": "Niṣāyattikā, this thing should abandon sins and repent.",
        "source": "T23n1443_010:0963a15_8"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_010:0963a16_9"
    },
    {
        "source_sentence": "若苾芻尼，月一日得藥，此藥即應於七日內自作守持、或可捨、或與餘人；",
        "translation": "If a bhikṣuṇī obtains medicine on the first day of the seventh month, that medicine should be preserved within seven days for herself or given to another person.",
        "source": "T23n1443_010:0963a16_10"
    },
    {
        "source_sentence": "若不持、不捨、不與餘人，至第八日明相出時，得捨墮罪。",
        "translation": "If someone doesn't maintain, abandon, or give it to others until the eighth day when they clearly emerge, they'll be released and fall into sin.",
        "source": "T23n1443_010:0963a18_11"
    },
    {
        "source_sentence": "若苾芻尼，一日得藥、二日不得，三日得乃至七日得，此藥即應於七日內自作守持、或可捨、或與餘人；",
        "translation": "If a bhikṣuṇī obtains the medicine for one day and doesn’t get it for two days, or if she obtains it for three days or up to seven days, that medicine should be maintained by herself, discarded, or given to someone else within seven days.",
        "source": "T23n1443_010:0963a19_12"
    },
    {
        "source_sentence": "若不持、不捨、不與餘人，至八日明相出時，得捨墮罪。",
        "translation": "If someone doesn't maintain, abandon, or give it to another person until the eighth day when they emerge in the morning, they'll be released and fall into sin.",
        "source": "T23n1443_010:0963a21_13"
    },
    {
        "source_sentence": "若苾芻尼，一日得藥、二日亦得，於七日內此初日藥應守持，二日藥或捨、與餘人，",
        "translation": "If a bhikṣuṇī obtains the medicine for one day and it's also obtained for two days, she should keep this medicine for the first day within seven days. For the second day, she may give it away or give it to someone else.",
        "source": "T23n1443_010:0963a23_0"
    },
    {
        "source_sentence": "或第二日藥自作守持，初日藥或捨、或與餘人；",
        "translation": "Or the second day’s medicine is to be kept by oneself, while the first day’s medicine either is to be abandoned or given to someone else.",
        "source": "T23n1443_010:0963a24_1"
    },
    {
        "source_sentence": "若不持、不捨、不與餘人，至八日明相出時，得捨墮罪。",
        "translation": "If someone doesn't maintain, abandon, or give it to another person until the eighth day when they emerge in the morning, they'll be released and fall into sin.",
        "source": "T23n1443_010:0963a25_2"
    },
    {
        "source_sentence": "若苾芻尼，如於一日二日相對作法，如是二日、三日乃至六、七日相對作法，",
        "translation": "If a bhikṣuṇī thus performs the duty for one day and two days in pairs, or if he does so for two days, three days, up to six days, or seven days in pairs,",
        "source": "T23n1443_010:0963a27_3"
    },
    {
        "source_sentence": "餘如上法。",
        "translation": "The rest are as above.",
        "source": "T23n1443_010:0963a28_4"
    },
    {
        "source_sentence": "若苾芻尼，月一日得眾多藥，此藥即應於七日內自作守持、或捨、或與餘人；",
        "translation": "If a bhikṣuṇī obtains many medicines for one day of the month, that medicine should be preserved by herself within seven days or given away or given to someone else.",
        "source": "T23n1443_010:0963a29_0"
    },
    {
        "source_sentence": "若不持、不捨、不與餘人，至第八日明相出時，得捨墮罪。",
        "translation": "If someone doesn't maintain, abandon, or give it to others until the eighth day when they clearly emerge, they'll be released and fall into sin.",
        "source": "T23n1443_010:0963b01_1"
    },
    {
        "source_sentence": "若苾芻尼如於一日，如是乃至七日得眾多藥，此藥應於七日內自作守持、或捨、或與人；",
        "translation": "If a bhikṣuṇī obtains many kinds of medicine for one day and so on, up to seven days, he or she should preserve, discard, or give it to someone within seven days.",
        "source": "T23n1443_010:0963b02_2"
    },
    {
        "source_sentence": "若不持、不捨、不與人，至第八日明相出時，得捨墮罪。",
        "translation": "If someone doesn't maintain, abandon, or give it to someone until the eighth day when they clearly emerge, they'll be released and fall into sin.",
        "source": "T23n1443_010:0963b04_3"
    },
    {
        "source_sentence": "若苾芻尼，一日得眾多藥，二日亦得眾多藥，此初日藥於七日內應守持，",
        "translation": "If a bhikṣuṇī obtains many medicines for one day and also obtains many medicines for two days, this first-day medicine should be maintained within seven days.",
        "source": "T23n1443_010:0963b06_4"
    },
    {
        "source_sentence": "二日藥或捨、或與人；",
        "translation": "The second is to give away the medicine for two days or give it to someone else.",
        "source": "T23n1443_010:0963b07_5"
    },
    {
        "source_sentence": "或第二日藥自作守持，初日藥或捨、或與人。",
        "translation": "Or the second day's medicine is self-maintained, and the first day's medicine is either discarded or given to someone.",
        "source": "T23n1443_010:0963b08_6"
    },
    {
        "source_sentence": "若不捨、不與餘人，至第八日明相出時，得捨墮罪。",
        "translation": "If someone doesn't abandon it or give it to another person until the eighth day when they clearly emerge, they'll be given up and fall into a sin.",
        "source": "T23n1443_010:0963b09_7"
    },
    {
        "source_sentence": "若苾芻尼，一日不得眾多藥，二日亦不得眾多藥，乃至第六第七日方得眾多藥，",
        "translation": "If a bhikṣuṇī doesn't obtain many medicines for one day and doesn't obtain many medicines for two days, or if she doesn't obtain many medicines on the sixth or seventh day until she has obtained many medicines,",
        "source": "T23n1443_010:0963b10_8"
    },
    {
        "source_sentence": "第六日藥於七日內應守持，第七日藥或捨、與人；",
        "translation": "The medicine for the sixth day should be preserved for seven days. On the seventh day the medicine may be discarded or given to someone else.",
        "source": "T23n1443_010:0963b12_9"
    },
    {
        "source_sentence": "若不捨、不與人，至第八日明相出時，得捨墮罪。",
        "translation": "If he doesn't abandon it or give it to someone until the eighth day, when he emerges from his luminous appearance, he'll be released and fall into sin.",
        "source": "T23n1443_010:0963b13_10"
    },
    {
        "source_sentence": "若苾芻尼，所有諸藥自觸令他觸，或與餘食細末相觸，或更互相和，或同類相雜，",
        "translation": "If a monk or nun touches all the medicines themselves and causes others to touch them, or if they touch each other's fine powdered foods, or mixes them with one another, or mixes them together in the same kind, then he or she won't be able to eat.",
        "source": "T23n1443_010:0963b14_11"
    },
    {
        "source_sentence": "同在一處不能分別者，此藥即應與寺家淨人，或施求寂女。",
        "translation": "If they're both in one place and can't distinguish them, this medicine should be given to a pure person at the temple or to a woman seeking quiescence.",
        "source": "T23n1443_010:0963b16_12"
    },
    {
        "source_sentence": "若復苾芻尼，於此諸藥不自觸不令他觸，不與餘食細末相觸，亦不更互相和、亦不同類相染、亦不同在一處，",
        "translation": "“Furthermore, if a bhikṣuṇī doesn’t touch these medicines on her own and doesn’t allow others to touch them, doesn’t touch the subtle powders of other foods, doesn’t mix them with each other, doesn’t defile each other differently, doesn’t stain each other differently, and doesn’t differ in one place.",
        "source": "T23n1443_010:0963b17_13"
    },
    {
        "source_sentence": "捨與不捨、時與非時能善分別，於七日內自為守持自取服食。",
        "translation": "Being able to skillfully discriminate between equanimity and non-equanimity, time and non-time, he guards himself for seven days and takes his own food and drink.",
        "source": "T23n1443_010:0963b20_14"
    },
    {
        "source_sentence": "應如是守持，應在午前，當淨洗手受取其藥，對一同梵行者作如是說：「具壽存念！",
        "translation": "You should thus guard it, and you should wash your hands cleanly in the morning to receive the medicine and say this to those religious practitioners who are with you, Kauśinagara, keep an eye on it!",
        "source": "T23n1443_010:0963b21_15"
    },
    {
        "source_sentence": "我苾芻尼某甲有此病緣，清淨醫藥我今守持，於七日內自服，及同梵行者。」",
        "translation": "A certain bhikṣuṇī of mine has this condition for illness, and I now preserve the pure medicine that I'll take for seven days to treat myself and those who practice it together with the religious practitioners.",
        "source": "T23n1443_010:0963b23_16"
    },
    {
        "source_sentence": "第二、第三亦如是說。",
        "translation": "The second and third are likewise explained.",
        "source": "T23n1443_010:0963b25_17"
    },
    {
        "source_sentence": "若已服一日，即告同梵行者：「我此病藥已服一日，餘有六日在，我當服食。」",
        "translation": "If he has taken it for one day, he tells the fellow religious practitioner, I've taken this medicine for illness for one day; there are another six days when I'll take it.",
        "source": "T23n1443_010:0963b25_18"
    },
    {
        "source_sentence": "如是乃至七日皆應告知。",
        "translation": "It should be notified in this way up to seven days.",
        "source": "T23n1443_010:0963b27_19"
    },
    {
        "source_sentence": "若滿七日已尚有餘藥，應捨與淨人、或與求寂女。",
        "translation": "If there's still medicine left after seven days have passed, he should give it to the pure person or to a woman seeking extinction.",
        "source": "T23n1443_010:0963b27_20"
    },
    {
        "source_sentence": "若不捨者至，第八日明相出時，犯捨墮罪。",
        "translation": "If someone doesn't abandon it until the eighth day, they'll be guilty of committing the sin of forfeiture on the eighth day when they clearly show their appearance.",
        "source": "T23n1443_010:0963b29_0"
    },
    {
        "source_sentence": "若苾芻尼，有捨墮藥，不捨與人、不為間隔、罪不說悔，若更得餘藥，",
        "translation": "If a bhikṣuṇī discards the medicine and doesn't give it to someone, doesn't separate it from them, doesn't confess crimes, and doesn't tell others about their repentance, or if she gets another medicine,",
        "source": "T23n1443_010:0963b29_1"
    },
    {
        "source_sentence": "悉犯捨墮，由前染故。",
        "translation": "All the transgressions are abandoned because of the previous defilement.",
        "source": "T23n1443_010:0963c02_2"
    },
    {
        "source_sentence": "若苾芻尼犯捨墮藥，雖已捨訖、未為間隔、罪未說悔，若更得餘藥，皆犯捨墮，",
        "translation": "If a bhikṣuṇī violates the rules for giving up and losing medicine, even though she has given up it after finishing it, without being separated from it, or without confessing her sins, and if she gets another medicine, they all violate the rules for giving up and losing it.",
        "source": "T23n1443_010:0963c02_3"
    },
    {
        "source_sentence": "由前染故。",
        "translation": "It's because of the previous defilement.",
        "source": "T23n1443_010:0963c04_4"
    },
    {
        "source_sentence": "若苾芻尼犯捨墮藥，雖已捨訖、已為間隔、罪未說悔，若更得餘藥，皆犯捨墮。",
        "translation": "If a monk or nun violates the rules for abandoning and losing medicine, even though he or she has abandoned it, distanced himself or herself from it, committed an offense that has yet to be confessed, or if he or she obtains another medicine, they all violate the rules for abandoning and losing it.",
        "source": "T23n1443_010:0963c04_5"
    },
    {
        "source_sentence": "若苾芻尼藥犯捨墮，未為三事，若更得餘鉢絡腰絛，但是沙門所畜資具活命之物，",
        "translation": "If a bhikṣuṇī's medicine violates the precepts and abandons it without doing any of the three things, then if he or she obtains another bowl with a waistband around it but only the necessities for livelihood that are stored by the ascetic,",
        "source": "T23n1443_010:0963c06_6"
    },
    {
        "source_sentence": "若受畜者皆犯捨墮，由前染故。",
        "translation": "If someone receives an animal, they'll all violate the rules of equanimity because they've been defiled before.",
        "source": "T23n1443_010:0963c08_7"
    },
    {
        "source_sentence": "若苾芻尼犯捨墮藥，已捨、已為間隔、罪已說悔，更得餘藥者無犯。",
        "translation": "If a monk or nun violates the rules and abandons the medicine, abandons it, places it separately, and repents after committing an offense, and then he or she obtains another medicine, it's not a violation.",
        "source": "T23n1443_010:0963c09_8"
    },
    {
        "source_sentence": "畜長鉢學處第二十",
        "translation": "Twenty-second Place of Study for storing the Long bowl",
        "source": "T23n1443_010:0963c11_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_010:0963c12_0"
    },
    {
        "source_sentence": "時十二眾苾芻尼，所得長鉢唯知貯畜，自不受用亦不與他。",
        "translation": "The twelve monks and nuns then obtained a long bowl that they only knew to store, not accepting it for use or giving it to others.",
        "source": "T23n1443_010:0963c12_1"
    },
    {
        "source_sentence": "尼白苾芻，苾芻白佛。",
        "translation": "The nun said to the monk, and the monk said to the Buddha.",
        "source": "T23n1443_010:0963c13_2"
    },
    {
        "source_sentence": "佛以此緣，同前集眾問實訶責，廣說乃至「制其學處，應如是說：若復苾芻尼，",
        "translation": "For this reason, the Buddha similarly reprimanded the assembly of monks and nuns who had gathered together as before by asking questions about the real rebuke, extensively explaining it in detail up to regulating its place of training:",
        "source": "T23n1443_010:0963c14_3"
    },
    {
        "source_sentence": "畜長鉢得經一宿。",
        "translation": "He kept a long bowl for one night.",
        "source": "T23n1443_010:0963c15_4"
    },
    {
        "source_sentence": "若過者，泥薩祇波逸底迦。」",
        "translation": "If it's a mistake, it's Nirvāṇarati-pāyattika.",
        "source": "T23n1443_010:0963c16_5"
    },
    {
        "source_sentence": "苾芻尼畜長鉢唯得經一宿，過一宿者，謂過一宿。",
        "translation": "A bhikṣuṇī who stores a long bowl for only one night gets it for more than one night, and someone who goes beyond that number means they go beyond that number.",
        "source": "T23n1443_010:0963c16_6"
    },
    {
        "source_sentence": "長鉢者，除守持鉢餘者名長。",
        "translation": "A long bowl is called a long bowl except for those who guard their bowls and the rest are called long.",
        "source": "T23n1443_010:0963c18_7"
    },
    {
        "source_sentence": "畜者，作屬己心。",
        "translation": "An animal is someone who acts according to their own mind.",
        "source": "T23n1443_010:0963c18_8"
    },
    {
        "source_sentence": "若更畜者得捨墮罪，捨法如上。",
        "translation": "If someone else keeps it, they'll be able to abandon the sin of falling, and they'll abandon the teaching as above.",
        "source": "T23n1443_010:0963c19_9"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_010:0963c19_10"
    },
    {
        "source_sentence": "若苾芻尼月一日得鉢，於一日內應持、應分別、應捨、應與他，如是次第及以起問，",
        "translation": "If a bhikṣuṇī obtains a bowl for one day in a month, she should keep it for one day, discern it, dispose of it, and give it to someone else, this is the order and the question that arises.",
        "source": "T23n1443_010:0963c20_11"
    },
    {
        "source_sentence": "如初衣戒中廣說其事，乃至捨之法式皆悉同前。",
        "translation": "As explained in detail in the first garment precepts, these things and the rules for abandoning them are the same as the previous ones.",
        "source": "T23n1443_010:0963c22_12"
    },
    {
        "source_sentence": "若小若白色，或為擬與欲受戒人者，無犯。",
        "translation": "It's not a violation if it's small or white, or if it's intended to be given to someone who wants to receive the precepts.",
        "source": "T23n1443_010:0963c23_13"
    },
    {
        "source_sentence": "根本說一切有部苾芻尼毘奈耶卷第十",
        "translation": "Mūlasarvâstivāda-vinaya, vol. 10",
        "source": "T23n1443_010:0963c25_0"
    }
]