[
    {
        "source_sentence": "根本說一切有部苾芻尼毘奈耶",
        "translation": "Mūlasarvâstivāda Bhikṣuṇī-vinaya",
        "source": "T23n1443_016:0991c09_0"
    },
    {
        "source_sentence": "卷第十六",
        "translation": "Vol. 16",
        "source": "T23n1443_016:0991c10_0"
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yogâcārabhūmi in Sanskrit",
        "source": "T23n1443_016:0991c12_0"
    },
    {
        "source_sentence": "與賊同行學處第五十五",
        "translation": "fifty-fifth place of training where he travels with thieves",
        "source": "T23n1443_016:0991c13_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_016:0991c14_0"
    },
    {
        "source_sentence": "有一苾芻於王舍城夏安居竟，時有商人欲向室羅伐城，此之商人是偷稅者，苾芻不知，共相隨去。",
        "translation": "When a monk had finished his summer retreat in Rājagṛha, a merchant wanted to go to Śrāvastī, but this merchant was a tax evader. The monk didn't know that and went with him.",
        "source": "T23n1443_016:0991c14_1"
    },
    {
        "source_sentence": "偷道而行，遂便撿獲俱縛將來，廣說乃至世尊告言：「我觀十利，為二部弟子制其學處，應如是說：「若復苾芻尼，與賊商旅共同道行，乃至一村間者，波逸底迦。」",
        "translation": "When he steals the path and walks along it, he then picks up the fetters and explains them in detail until the Bhagavān tells him, I'm observing the ten benefits for the sake of two groups of disciples to regulate their places of training, and you should thus say, 'Suppose another monk or nun travels along the path together with a thief or caravan of merchants",
        "source": "T23n1443_016:0991c16_2"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0991c21_0"
    },
    {
        "source_sentence": "與賊者，謂破壞村坊及偷關稅。",
        "translation": "A thief is someone who destroys a village or steals the customs duty.",
        "source": "T23n1443_016:0991c21_1"
    },
    {
        "source_sentence": "同道行者，謂逈遠處共為伴侶，乃至一村間得波逸底迦。",
        "translation": "Practitioners of the same path are said to be companions at a distance, up to acquiring pratyekabuddhahood between one village.",
        "source": "T23n1443_016:0991c21_2"
    },
    {
        "source_sentence": "若以賊為防援、引導人者，同行無犯。",
        "translation": "If someone uses thieves to protect and guide people, it's not a violation if they travel with them.",
        "source": "T23n1443_016:0991c23_3"
    },
    {
        "source_sentence": "或迷失道，彼來指示者，雖同道去，此亦無犯。",
        "translation": "It's not a violation if someone who goes along the same path or loses the path and is instructed by someone else, even though they're going on the same path.",
        "source": "T23n1443_016:0991c24_4"
    },
    {
        "source_sentence": "壞生地學處第五十六",
        "translation": "fifty-sixth place of training for the destruction of the ground of birth",
        "source": "T23n1443_016:0991c26_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_016:0991c27_0"
    },
    {
        "source_sentence": "時六眾苾芻自手掘地、或教人掘，俗旅見譏，乃至以緣白佛。",
        "translation": "When six monks dug the ground with their own hands or taught others to dig it, the laity traveled and criticized them, even telling the Buddha about this as a reason.",
        "source": "T23n1443_016:0991c27_1"
    },
    {
        "source_sentence": "佛集苾芻，以種種方便，讚歎持戒少欲知足，訶責多欲，告言：「我觀十利，為二部弟子制其學處，應如是說：「若復苾芻尼，自手掘地、若教人掘者，波逸底迦。」",
        "translation": "The Buddha gathered the monks, praised them for various ways to observe precepts with few desires and contentment, reprimanded them for having many desires, and told them, I've observed the ten benefits and instructed two groups of disciples to regulate their places of training, and you should thus say, 'Suppose another monk or nun digs a ground with his own hand or teaches",
        "source": "T23n1443_016:0991c28_2"
    },
    {
        "source_sentence": "餘義如上，自他同前。",
        "translation": "The other meanings are as above. Self and others are the same as before.",
        "source": "T23n1443_016:0992a04_0"
    },
    {
        "source_sentence": "地者，有其二種：謂生地、非生地。",
        "translation": "“Earth”: There are two kinds: that is, the stage of arising and the stage of not-arising.",
        "source": "T23n1443_016:0992a04_1"
    },
    {
        "source_sentence": "云何生地？",
        "translation": "What is the stage of arising?",
        "source": "T23n1443_016:0992a05_2"
    },
    {
        "source_sentence": "謂性是生地，或因發掘於三月中經天大雨是名生地；",
        "translation": "Its nature is that of being the land of birth. Or, when a great rain falls during the three months due to excavation, it is said to be the land of birth.",
        "source": "T23n1443_016:0992a05_3"
    },
    {
        "source_sentence": "若無雨者經六月後方名為生。",
        "translation": "If there's no rain, it's called birth after six months.",
        "source": "T23n1443_016:0992a06_4"
    },
    {
        "source_sentence": "釋罪如上。",
        "translation": "The explanation of the offense is as above.",
        "source": "T23n1443_016:0992a07_5"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_016:0992a07_6"
    },
    {
        "source_sentence": "若尼掘損生地，得墮罪；",
        "translation": "If a nun digs up and damages the land where she was born, she will fall into sin.",
        "source": "T23n1443_016:0992a08_7"
    },
    {
        "source_sentence": "若非生地，得惡作罪。",
        "translation": "If it's not the native land, they'll be guilty of misdeeds.",
        "source": "T23n1443_016:0992a08_8"
    },
    {
        "source_sentence": "若舉地皮時、若與地性相連者，波逸底迦；",
        "translation": "When the earth skin is lifted up, or when it is connected to the earth-nature: this is pratyekabuddha.",
        "source": "T23n1443_016:0992a09_9"
    },
    {
        "source_sentence": "若不相連者，得惡作罪。",
        "translation": "If they aren't connected, they'll be guilty of misdeeds.",
        "source": "T23n1443_016:0992a10_10"
    },
    {
        "source_sentence": "若尼釘橛者，波逸底迦；",
        "translation": "If a nun were to spit on someone, it would be a pāyattika.",
        "source": "T23n1443_016:0992a10_11"
    },
    {
        "source_sentence": "若拔橛者，得惡作罪。",
        "translation": "If someone pulls out a garland, they'll be guilty of misdeeds.",
        "source": "T23n1443_016:0992a11_12"
    },
    {
        "source_sentence": "若尼輒畫地者，得惡作罪。",
        "translation": "If a nun paints the ground lightly, she'll be guilty of misdeeds.",
        "source": "T23n1443_016:0992a11_13"
    },
    {
        "source_sentence": "若輕為記數者，無犯。",
        "translation": "If someone despises it for the sake of memory, it's not a violation.",
        "source": "T23n1443_016:0992a12_14"
    },
    {
        "source_sentence": "若牛糞著地而發起者，得惡作罪；",
        "translation": "If someone were to lay cow dung on the ground and give it up, they would be guilty of misdeeds.",
        "source": "T23n1443_016:0992a12_15"
    },
    {
        "source_sentence": "若但取牛糞者，無犯。",
        "translation": "If someone simply takes cow dung, it's not a violation.",
        "source": "T23n1443_016:0992a13_16"
    },
    {
        "source_sentence": "若尼崩河岸時損生地者，波逸底迦；",
        "translation": "If a nun breaks down on the bank of a river and damages the land of birth, that is pratyekabuddha.",
        "source": "T23n1443_016:0992a13_17"
    },
    {
        "source_sentence": "若有璺裂而崩墮者，得惡作罪。",
        "translation": "If someone breaks open and falls down, they'll be guilty of misdeeds.",
        "source": "T23n1443_016:0992a14_18"
    },
    {
        "source_sentence": "若尼搖動河池中泥者，得惡作罪。",
        "translation": "If a nun shakes mud in a river or pond, she'll be guilty of misdeeds.",
        "source": "T23n1443_016:0992a15_19"
    },
    {
        "source_sentence": "若瓨在泥處而擎起者，得惡作罪。",
        "translation": "If someone raises a bowl in the mud and lifts it up, they'll be guilty of misdeeds.",
        "source": "T23n1443_016:0992a16_20"
    },
    {
        "source_sentence": "若牆上釘杙者，波逸底迦。",
        "translation": "If a nail is placed on the wall, it's pratyekabuddha.",
        "source": "T23n1443_016:0992a16_21"
    },
    {
        "source_sentence": "若牛糞著牆發舉者，得惡作罪。",
        "translation": "If someone puts cow dung on a wall and raises it, they'll be guilty of misdeeds.",
        "source": "T23n1443_016:0992a17_22"
    },
    {
        "source_sentence": "若推牆壁與濕性相連者，得波逸底迦；",
        "translation": "If one were to presume that walls are connected with the nature of moisture, they would attain pratyekabuddha.",
        "source": "T23n1443_016:0992a18_23"
    },
    {
        "source_sentence": "若有璺裂者，得惡作罪。",
        "translation": "If someone breaks it open, they'll be guilty of misdeeds.",
        "source": "T23n1443_016:0992a19_24"
    },
    {
        "source_sentence": "若畫壁，得惡作罪；",
        "translation": "If you paint a wall, you will be guilty of misdeeds.",
        "source": "T23n1443_016:0992a19_25"
    },
    {
        "source_sentence": "若作記數想者，無犯。",
        "translation": "It's not a violation if someone gives rise to perceptions of memory.",
        "source": "T23n1443_016:0992a20_26"
    },
    {
        "source_sentence": "若牆上生青衣損動者，得惡作罪。",
        "translation": "If a green robe grows on the wall and damages it, he'll be guilty of misdeeds.",
        "source": "T23n1443_016:0992a20_27"
    },
    {
        "source_sentence": "若掘石地，石少土多者，得波逸底迦罪；",
        "translation": "If one digs up a piece of rocky soil with little rock and much dirt, he is guilty of the transgression of pratyekabuddha.",
        "source": "T23n1443_016:0992a21_28"
    },
    {
        "source_sentence": "若土少者，得惡作罪；",
        "translation": "If the soil is small they will be guilty of misdeeds.",
        "source": "T23n1443_016:0992a22_29"
    },
    {
        "source_sentence": "若純石者，無犯。",
        "translation": "If it's pure stone, it's not a violation.",
        "source": "T23n1443_016:0992a22_30"
    },
    {
        "source_sentence": "若掘砂地，砂少土多者，得波逸底迦；",
        "translation": "If one digs into the ground of sand and finds only a little bit of sand but much dirt, he obtains pratyekabuddha.",
        "source": "T23n1443_016:0992a23_0"
    },
    {
        "source_sentence": "若砂多者，得惡作罪；",
        "translation": "If it is full of sand, they will be guilty of misdeeds.",
        "source": "T23n1443_016:0992a23_1"
    },
    {
        "source_sentence": "若純砂者，無犯。",
        "translation": "If it's pure sand, it's not a violation.",
        "source": "T23n1443_016:0992a24_2"
    },
    {
        "source_sentence": "若營作苾芻尼欲定基時，得好星候吉辰，無有淨人，應自以橛釘地，欲記疆界深四指者，無犯。",
        "translation": "It's not a violation if a monk or nun who wants to build a foundation and gets good weather and good fortune on an auspicious day doesn't have a pure person, so he or she should nail the ground with his or her spear and want to mark the depth of the four fingers of the border.",
        "source": "T23n1443_016:0992a24_3"
    },
    {
        "source_sentence": "過四月索食學處第五十七",
        "translation": "The fifty-seventh place where he goes beyond the fourth month and asks for food",
        "source": "T23n1443_016:0992a27_0"
    },
    {
        "source_sentence": "緣在劫比羅城。",
        "translation": "The condition is in the city of Kapilavastu.",
        "source": "T23n1443_016:0992a28_0"
    },
    {
        "source_sentence": "時釋迦大名請佛及僧三月飲食供養，并及一切所須之物不令有闕。",
        "translation": "The great Śākyamuni then invited the Buddha and the saṃgha to make offerings of food and drink for three months, as well as all the necessities without missing anything.",
        "source": "T23n1443_016:0992a28_1"
    },
    {
        "source_sentence": "時六眾於三月中常噉好食皆如醫教，三月既了尚從厨人索好美味，大名譏嫌，受他請了非分強索，以緣白佛，佛言：「勿復從施主強為乞索因生忿惱。」",
        "translation": "The six members of the congregation then always ate good food for three months, all according to the doctor's instructions. After three months had passed, they still asked from the cook for good and delicious food, which was greatly resented by the criticism, accepted it or didn't accept it with an unreasonable request, and reported it to the Buddha because of this, who said, Don't again beg for it",
        "source": "T23n1443_016:0992a29_2"
    },
    {
        "source_sentence": "廣說先緣，乃至種種訶責，告諸苾芻：「我觀十利，為二部弟子制其學處，應如是說：「若復苾芻尼，有四月請，須時應受。",
        "translation": "He explained in detail the previous conditions and various reprimands, telling the monks, I'm observing the ten benefits for two groups of disciples who regulate their places of training, and you should thus say, 'Suppose another monk or nun is invited for four months, and he or she accepts them at the right time.",
        "source": "T23n1443_016:0992b04_3"
    },
    {
        "source_sentence": "若過受者，波逸底迦。」",
        "translation": "If someone goes beyond accepting it, pratyekabuddha.",
        "source": "T23n1443_016:0992b07_4"
    },
    {
        "source_sentence": "如是制已，時勝光大王請佛及僧三月供養。",
        "translation": "After this rule, the great king of Vaiśravaṇa then invited the Buddha and the saṃgha to make offerings for three months.",
        "source": "T23n1443_016:0992b09_0"
    },
    {
        "source_sentence": "時有苾芻施主復請，佛言：「我今隨開，若別別請者應受無犯。」",
        "translation": "A monk then asked the donor again, and the Buddha said, Now, I'll follow it up, but if you ask for it separately, it won't be a violation.",
        "source": "T23n1443_016:0992b10_0"
    },
    {
        "source_sentence": "復有客來，不被王請遂行乞食，王因見之。",
        "translation": "When another guest came and was not invited by the king, he went out to solicit alms.",
        "source": "T23n1443_016:0992b11_1"
    },
    {
        "source_sentence": "問言：「我請眾僧，何因乞食？」",
        "translation": "He asked, Why did I invite the saṃgha to beg for food?",
        "source": "T23n1443_016:0992b12_2"
    },
    {
        "source_sentence": "答言：「我不受請。」",
        "translation": "He replied, I won't accept the invitation.",
        "source": "T23n1443_016:0992b13_0"
    },
    {
        "source_sentence": "王曰：「我今更請食。」",
        "translation": "The king said, Now, I'll invite you to eat again.",
        "source": "T23n1443_016:0992b13_1"
    },
    {
        "source_sentence": "佛言：「若更請者應受。」",
        "translation": "The Buddha said, If you're invited again, you should accept it.",
        "source": "T23n1443_016:0992b13_2"
    },
    {
        "source_sentence": "乃至慇懃重請，王請食了而行乞食。",
        "translation": "Even after he had repeatedly requested it, the king invited him to eat and went begging for food.",
        "source": "T23n1443_016:0992b14_3"
    },
    {
        "source_sentence": "王復常請，佛言：「若常請者亦應受。」",
        "translation": "Again, the king always invited them, and the Buddha said, If you always invite them, you should accept them as well.",
        "source": "T23n1443_016:0992b15_4"
    },
    {
        "source_sentence": "世尊讚歎持戒少欲，訶責多欲，告諸苾芻曰：「前是創制、今更隨開，應如是說：「若復苾芻尼，有四月請，須時應受。",
        "translation": "The Bhagavān praised the observance of precepts with few desires and reprimanded those who had many desires, telling the monks, Formerly it was established but now it's further opened, so you should explain it this way: If a monk or nun is invited for another four months, he or she should accept it at the right time.",
        "source": "T23n1443_016:0992b15_5"
    },
    {
        "source_sentence": "若過受者，除餘時，波逸底迦。",
        "translation": "If it's received in excess, except at other times, pratyekabuddha.",
        "source": "T23n1443_016:0992b18_6"
    },
    {
        "source_sentence": "餘時者，謂別請、更請、慇懃請、常請，此是時。」",
        "translation": "The other time refers to the time when someone is invited separately, invited again, repeatedly invited, and always invited.",
        "source": "T23n1443_016:0992b19_7"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0992b21_0"
    },
    {
        "source_sentence": "四月者，謂齊四月。",
        "translation": "The fourth month refers to the fourth month of Qi.",
        "source": "T23n1443_016:0992b21_1"
    },
    {
        "source_sentence": "請受者，請許其事。",
        "translation": "Those who are invited to accept it ask permission for their work.",
        "source": "T23n1443_016:0992b21_2"
    },
    {
        "source_sentence": "若過者，請過期限。",
        "translation": "If there's a mistake, he asks for an overdue period of time.",
        "source": "T23n1443_016:0992b22_3"
    },
    {
        "source_sentence": "除餘時者，謂別請時，即是不同餘人。",
        "translation": "“Exception made for other moments”: At the moment of being requested separately, it exactly is different from other persons.",
        "source": "T23n1443_016:0992b22_4"
    },
    {
        "source_sentence": "更請，謂數數更請。",
        "translation": "Requesting again means repeatedly requesting again and again.",
        "source": "T23n1443_016:0992b23_5"
    },
    {
        "source_sentence": "慇懃請者，謂更慇懃盡心而請。",
        "translation": "Requesting means to ask with a mind that's even more earnest and sincere.",
        "source": "T23n1443_016:0992b23_6"
    },
    {
        "source_sentence": "常請者，謂是長時延請。",
        "translation": "Someone who always invites means to extend an invitation for a long time.",
        "source": "T23n1443_016:0992b24_7"
    },
    {
        "source_sentence": "此是時者，謂隨開時。",
        "translation": "“This is the right time”:",
        "source": "T23n1443_016:0992b25_8"
    },
    {
        "source_sentence": "釋罪如上。",
        "translation": "The explanation of the offense is as above.",
        "source": "T23n1443_016:0992b25_9"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_016:0992b25_10"
    },
    {
        "source_sentence": "若尼他請麁食、從索美好，索時惡作，食便墮罪。",
        "translation": "If a nun asks for food or asks for something good, and if he asks for something bad at the time, then he'll be guilty of eating it.",
        "source": "T23n1443_016:0992b26_11"
    },
    {
        "source_sentence": "若他與好食、從索麁者，索時惡作，食時無犯。",
        "translation": "If someone gives good food or asks for a meal from another person, they do evil when asked, and it's not a violation when they eat.",
        "source": "T23n1443_016:0992b27_12"
    },
    {
        "source_sentence": "如與乳等時，便從索酪等，索時惡作，食時墮罪。",
        "translation": "It's like when you give milk and so forth, you then ask for such things as cheese. When you ask for it, you commit misdeeds, and you'll fall into a sin when you eat it.",
        "source": "T23n1443_016:0992b28_13"
    },
    {
        "source_sentence": "若病者無犯。",
        "translation": "If he's sick, it's not a violation.",
        "source": "T23n1443_016:0992b29_14"
    },
    {
        "source_sentence": "若巡家乞食，主人見已持食而出，尼情悕者應告彼曰：「更不須飯。」",
        "translation": "If a visiting monk begs for food and the host sees that he's finished taking food and leaves, the nun with compassion should tell him, I don't need any more food.",
        "source": "T23n1443_016:0992b29_15"
    },
    {
        "source_sentence": "若返問言：「聖者！",
        "translation": "If he returns and asks, Sage!",
        "source": "T23n1443_016:0992c02_16"
    },
    {
        "source_sentence": "更何所須？」",
        "translation": "What else is there to need?",
        "source": "T23n1443_016:0992c02_17"
    },
    {
        "source_sentence": "者，此即是請，隨所須者當就覓之，無犯。",
        "translation": "This is an invitation, so whatever you need, you'll look for it, and it won't be a violation.",
        "source": "T23n1443_016:0992c02_18"
    },
    {
        "source_sentence": "遮傳教學處第五十八",
        "translation": "The fifty-eighth place where the teachings are transmitted and taught accordingly.",
        "source": "T23n1443_016:0992c04_0"
    },
    {
        "source_sentence": "緣在王舍城。",
        "translation": "The reason for this was in the city of Rājagṛha.",
        "source": "T23n1443_016:0992c05_0"
    },
    {
        "source_sentence": "世尊法爾，若制二部共學處時，即二部僧伽並皆須集，此之學處是二部共有，然尼眾不集。",
        "translation": "Bhagavān, it's true that when the two parts of the teaching are established as common places for training, the two parts of the saṃgha must all gather together, and this place of training is shared by the two parts, but the nuns won't gather.",
        "source": "T23n1443_016:0992c05_1"
    },
    {
        "source_sentence": "佛告具壽阿難陀：「汝可語朱荼半託迦：『汝當持此學處詣苾芻尼眾而為宣告。』」",
        "translation": "The Buddha told Kauṣṭhila Ānanda, You may say to the half-trance of Zhuda, 'Take this place of training and go to the congregation of monks and nuns to announce it for them.'",
        "source": "T23n1443_016:0992c07_2"
    },
    {
        "source_sentence": "彼奉佛教已，便往尼寺欲宣佛教。",
        "translation": "After they had received the Buddha's teaching, they went to a nun's monastery to proclaim it.",
        "source": "T23n1443_016:0992c09_3"
    },
    {
        "source_sentence": "於其中路見六眾問：「是何學處？」",
        "translation": "On the way there, he saw six groups of people and asked, Where is this place of training?",
        "source": "T23n1443_016:0992c09_4"
    },
    {
        "source_sentence": "即為陳說。",
        "translation": "That's to say, it's explained for Chen.",
        "source": "T23n1443_016:0992c10_5"
    },
    {
        "source_sentence": "「若復苾芻尼，有四月請須時應受。",
        "translation": "Again, if a monk or nun asks for an invitation for four months, he or she should accept it at the right time.",
        "source": "T23n1443_016:0992c10_6"
    },
    {
        "source_sentence": "若過受者，除餘時，波逸底迦，乃至此是時。」",
        "translation": "If someone receives it wrongly, except at other times, pratyekabuddha, up to this point.",
        "source": "T23n1443_016:0992c11_7"
    },
    {
        "source_sentence": "既為說已，六眾報曰：「汝是愚癡，不分明、不善好，豈用汝言？",
        "translation": "After he had explained it for them, the six members of the assembly replied, You're foolish, you don't understand clearly and aren't good-looking, so why would you use your words?",
        "source": "T23n1443_016:0992c12_8"
    },
    {
        "source_sentence": "我若見餘善閑三藏者，當隨彼言受行學處。」",
        "translation": "If I see other well- leisurely tripiṭaka, I'll follow their words and accept the place of training.",
        "source": "T23n1443_016:0992c13_9"
    },
    {
        "source_sentence": "作是罵已遂便捨去。",
        "translation": "After he did so, he then abandoned it.",
        "source": "T23n1443_016:0992c14_10"
    },
    {
        "source_sentence": "又至十二眾尼處，彼亦作非法言。",
        "translation": "When he arrived at the place where the twelve nuns were staying, they also said something unlawful.",
        "source": "T23n1443_016:0992c15_11"
    },
    {
        "source_sentence": "餘眾苾芻、苾芻尼聞已歡喜頂受奉行，廣說乃至世尊問實訶責，告言：「我觀十利制其學處，應如是說：「若復苾芻尼，聞諸苾芻尼作如是語：『具壽！",
        "translation": "When the other monks and nuns heard this, they rejoiced and accepted it with their heads and bowed in respect, explained it in detail, asked the Bhagavān for a real rebuke, and told him, I'll observe the ten benefits that regulate their training place, and you should thus say, 'Suppose another monk or nun hears these words of the monks and nuns, '",
        "source": "T23n1443_016:0992c16_12"
    },
    {
        "source_sentence": "仁當習行如是學處。』",
        "translation": "Kindness, you should cultivate such a place of training.'",
        "source": "T23n1443_016:0992c19_13"
    },
    {
        "source_sentence": "彼作是語：『我實不能用，汝愚癡、不分明、不善解者所說之言受行學處。",
        "translation": "They say, 'In truth, I can't use it; you're foolish, don't understand clearly, and don't well understand the words that are taught by those who practice what's a place of training.",
        "source": "T23n1443_016:0992c20_14"
    },
    {
        "source_sentence": "我若見餘善閑三藏，當隨彼言而受行。』",
        "translation": "If I see other good and leisurely tripiṭaka, I'll follow their words and receive and practice them.'",
        "source": "T23n1443_016:0992c22_0"
    },
    {
        "source_sentence": "者，波逸底迦。",
        "translation": "This is pratyekabuddha.",
        "source": "T23n1443_016:0992c22_1"
    },
    {
        "source_sentence": "若彼苾芻尼實欲求解者，當問三藏，此是時。」",
        "translation": "If those monks and nuns really want to seek understanding, they should ask the Tripiṭaka, which is the right time.",
        "source": "T23n1443_016:0992c23_2"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0992c25_0"
    },
    {
        "source_sentence": "「具壽！",
        "translation": "Guoshou!",
        "source": "T23n1443_016:0992c25_1"
    },
    {
        "source_sentence": "仁今當習如是學處」者，謂是所傳學處。",
        "translation": "Now, you will cultivate such a place of training. This means that this is the place of training that's transmitted.",
        "source": "T23n1443_016:0992c25_2"
    },
    {
        "source_sentence": "「不能用汝愚癡」等者，謂思其惡思、說其惡說、作其惡作，名之為愚。",
        "translation": "The phrase can't use your folly and so forth refers to thinking about bad thoughts, speaking bad words, and doing bad actions, which are called folly.",
        "source": "T23n1443_016:0992c26_3"
    },
    {
        "source_sentence": "若不持經律論，名之為癡。",
        "translation": "If someone doesn't maintain sūtras, vinaya, and treatises, it's called delusion.",
        "source": "T23n1443_016:0992c27_4"
    },
    {
        "source_sentence": "若於三藏不了其義，名不分明。",
        "translation": "If they don't understand the meaning of the three collections, their names won't be clearly expressed.",
        "source": "T23n1443_016:0992c28_5"
    },
    {
        "source_sentence": "若於三藏不善決擇，名不善解。",
        "translation": "If someone doesn't well discriminate among the three collections, they're called an unskillful understanding.",
        "source": "T23n1443_016:0992c29_0"
    },
    {
        "source_sentence": "餘文易知，乃至釋罪皆如上說。",
        "translation": "The rest of the text is easy to understand, and even the explanation of the offense is as explained above.",
        "source": "T23n1443_016:0992c29_1"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_016:0993a01_2"
    },
    {
        "source_sentence": "若尼告餘尼，作如是語：「仁可習行如是學處。」",
        "translation": "If a nun tells another nun, he says, Sir, you may cultivate such a place of training.",
        "source": "T23n1443_016:0993a01_3"
    },
    {
        "source_sentence": "彼便報云：「我不能用汝語。」",
        "translation": "They then replied, I can't use your words.",
        "source": "T23n1443_016:0993a02_4"
    },
    {
        "source_sentence": "便以愚等四事，一一說時皆得墮罪。",
        "translation": "It's because of these four things, such as foolishness and so forth, that they'll all fall into sin when they say one by one.",
        "source": "T23n1443_016:0993a03_5"
    },
    {
        "source_sentence": "若彼前人是實愚等，說時無犯。",
        "translation": "If the person before him is really stupid and so forth, it's not a violation when he explains it.",
        "source": "T23n1443_016:0993a04_6"
    },
    {
        "source_sentence": "默聽鬪諍學處第五十九",
        "translation": "Silently listening to the fifty-nineth place of training for fighting.",
        "source": "T23n1443_016:0993a06_0"
    },
    {
        "source_sentence": "緣在室羅伐城。",
        "translation": "The reason for this was in the city of Śrāvastī.",
        "source": "T23n1443_016:0993a07_0"
    },
    {
        "source_sentence": "時十七眾見六眾中有命過者，鄔陀夷依大眾住。",
        "translation": "When the seventeen members of the assembly saw that there was a vital error in the sixfold assembly, Udayana stayed depending on the crowd.",
        "source": "T23n1443_016:0993a07_1"
    },
    {
        "source_sentence": "時十七眾憶先被欺，於食堂中共為籌議，欲與鄔波難陀作捨置羯磨，彼便詣其窓所側耳而聽，即入堂中苦為剋責。",
        "translation": "When the seventeen members of the assembly remembered that they had been deceived, they deliberated among themselves in the dining hall and wanted to perform the equanimity ritual with Upananda, so he went to the side of the door to his ears and listened, entered the hall, suffered torture, and was disciplined.",
        "source": "T23n1443_016:0993a08_2"
    },
    {
        "source_sentence": "如是十七眾在處議論，皆往竊聽共為鬪亂。",
        "translation": "Thus, the seventeen members of the assembly were discussing with each other and they all went there to listen quietly and became into arguments.",
        "source": "T23n1443_016:0993a11_3"
    },
    {
        "source_sentence": "廣說乃至世尊訶責告言：「我觀十利，為二部弟子制其學處，應如是說：「若復苾芻尼，知餘苾芻尼評論事生，求過紛擾諍競而住，默然往彼聽其所說，作如是念：『我欲聽已，當令鬪亂。』",
        "translation": "It's explained in detail up to the point where the Bhagavān reprimanded them, saying, 'I observe the ten benefits and regulate their training places for the sake of two groups of disciples, so I should explain it this way: If another monk or nun knows that other monks and nuns comment on a situation, seek faults, engage in disputes, and stay quietly there to listen to what they say",
        "source": "T23n1443_016:0993a12_4"
    },
    {
        "source_sentence": "以此為緣者，波逸底迦。」",
        "translation": "This is the condition for this, pratyekabuddha.",
        "source": "T23n1443_016:0993a16_5"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0993a18_0"
    },
    {
        "source_sentence": "言評論事者，謂初見不可意事始作評論。",
        "translation": "The expression commentary refers to the first instance where a person who sees something that's not intended begins to comment on it.",
        "source": "T23n1443_016:0993a18_1"
    },
    {
        "source_sentence": "言求過者，謂求覓過愆更相道說。",
        "translation": "Those who say they seek faults are those who seek faults and discuss them in terms of looking for faults.",
        "source": "T23n1443_016:0993a19_2"
    },
    {
        "source_sentence": "紛擾者，謂情不含忍發舉其事。",
        "translation": "Disturbance means that feelings don't contain forbearance and give rise to things.",
        "source": "T23n1443_016:0993a19_3"
    },
    {
        "source_sentence": "諍競者，以此諍事入鬪諍門，自結朋黨共相扶扇。",
        "translation": "A disputer enters the gate of fighting because of this dispute, forming his own groups of friends and joining together to support each other.",
        "source": "T23n1443_016:0993a20_4"
    },
    {
        "source_sentence": "鬪諍而住默而聽者，謂竊聽其言隨彼所說。",
        "translation": "Someone who remains silent while fighting and listens quietly means to secretly listen to what they say according to what they say.",
        "source": "T23n1443_016:0993a21_5"
    },
    {
        "source_sentence": "鬪亂者，欲令紛競不止息也。",
        "translation": "A quarreling is someone who wants to cause a dispute that doesn't stop.",
        "source": "T23n1443_016:0993a22_6"
    },
    {
        "source_sentence": "釋罪如上。",
        "translation": "The explanation of the offense is as above.",
        "source": "T23n1443_016:0993a23_7"
    },
    {
        "source_sentence": "此中犯相，若尼在於閣共為議論，有餘苾芻尼昇閣之時，應蹈階道作聲、或謦欬、或彈指。",
        "translation": "If the nuns are in the pavilion to discuss it together, and there are other bhikṣuṇīs ascending to the pavilion, they should walk up the steps and make a sound, either by beating or snapping their fingers.",
        "source": "T23n1443_016:0993a23_8"
    },
    {
        "source_sentence": "若不作如是事昇閣之時，但聞言聲未解其義，得惡作罪；",
        "translation": "If someone doesn’t do anything like this but hears the sound of words and doesn’t understand their meaning, they will be guilty of misdeeds.",
        "source": "T23n1443_016:0993a25_9"
    },
    {
        "source_sentence": "若解言義便得墮罪。",
        "translation": "If someone understands the meaning of words, they'll fall into sin.",
        "source": "T23n1443_016:0993a26_10"
    },
    {
        "source_sentence": "廣說如前，乃至門屋輕重之罪，隨事應知。",
        "translation": "It's explained in detail as before, even the relative seriousness of the offense at the door and house should be known according to circumstances.",
        "source": "T23n1443_016:0993a27_11"
    },
    {
        "source_sentence": "若經行處、若靜林中，亦准事應識。",
        "translation": "Whether it's in a place where the sūtras are practiced or in a quiet forest, they should also be known according to their situation.",
        "source": "T23n1443_016:0993a28_12"
    },
    {
        "source_sentence": "若隨路行時共為籌議，苾芻尼後來，所有行法皆准昇閣應知，若不作者得罪輕重如上。",
        "translation": "If they travel along the path and discuss it together, the monks and nuns will know that all the rules for their subsequent actions are based on ascending to the pavilion, and if they don't do so, they'll be charged with a minor or major offense as above.",
        "source": "T23n1443_016:0993a29_13"
    },
    {
        "source_sentence": "若先無讐隙，偶爾聞之，或復聽已，欲令鬪諍方便殄息者，無犯。",
        "translation": "It's not a violation if someone who previously had no enemies and occasionally heard them, or after hearing them again, wants to cause the fighting to be stopped by skillful means.",
        "source": "T23n1443_016:0993b02_14"
    },
    {
        "source_sentence": "不與欲默然起去學處第六十",
        "translation": "Sixty-sixth, the place of training that is not accompanied by a desire to be silent and get up and leave.",
        "source": "T23n1443_016:0993b04_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_016:0993b05_0"
    },
    {
        "source_sentence": "時鄔陀夷斷諸結惑，廣如上說。",
        "translation": "Udayana then ended the bonds and afflictions, as explained above.",
        "source": "T23n1443_016:0993b05_1"
    },
    {
        "source_sentence": "乃至十七眾共為籌議，集苾芻眾已詣上座前，作如是白：「我今有所詰問……乃至欲與鄔波難陀作捨置羯磨。」",
        "translation": "After the seventeen members of the congregation had deliberated together, they gathered the monks and went to the superior seat before the saṃgha and said, Now, I've asked a question... even if I want to perform the equanimity karma with Upananda.",
        "source": "T23n1443_016:0993b05_2"
    },
    {
        "source_sentence": "難陀聞已遂生怖懼，默而起去，廣說乃至世尊訶責告言：「我觀十利，為二部弟子制其學處，應如是說：「若復苾芻尼，知眾如法評論事時，默然從座起去者，波逸底迦。」",
        "translation": "After hearing this, Nanda became frightened and quietly got up and departed, explained in detail, and the Bhagavān reprimanded him, saying, I'm observing the ten benefits for the sake of the two groups of disciples to regulate their places of training, and you should thus say, 'Suppose another monk or nun who knows that when the congregation is discussing things according to the teaching",
        "source": "T23n1443_016:0993b08_3"
    },
    {
        "source_sentence": "如是制已，時諸苾芻尼久在眾中，其看病人及授事人，事有廢闕。",
        "translation": "After this rule was passed, the monks and nuns stayed in the congregation for a long time, but there were discrepancies in the way they looked after the sick and served their servants.",
        "source": "T23n1443_016:0993b13_0"
    },
    {
        "source_sentence": "由此為緣，佛更聽許：「若有緣者應囑授去。」",
        "translation": "Because of this condition, the Buddha again agreed to allow it, saying, If there's a condition, you should ask him to leave.",
        "source": "T23n1443_016:0993b14_1"
    },
    {
        "source_sentence": "世尊讚歎持戒，乃至廣說：「前是創制、此是隨開，應如是說：「若復苾芻尼，知眾如法評論事時，默然從座起去，有苾芻尼不囑授者，除餘緣故，波逸底迦。」",
        "translation": "The Bhagavān praised observance of the precepts, even going so far as to say, This is a creation and this is a follow-on, and it should be explained in detail, Suppose another bhikṣuṇī knows that when the congregation correctly discusses things with the Dharma, she stands silently from her seat and leaves, and there's a bhikṣuṇī who doesn't",
        "source": "T23n1443_016:0993b15_2"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0993b20_0"
    },
    {
        "source_sentence": "眾謂佛弟子。",
        "translation": "The crowd called themselves disciples of the Buddha.",
        "source": "T23n1443_016:0993b20_1"
    },
    {
        "source_sentence": "如法評論者，謂是如法單白、白二、白四羯磨。",
        "translation": "Commenting according to the teaching means that it's a simple, white, two-fold, and four-fold karma in accordance with the teaching.",
        "source": "T23n1443_016:0993b20_2"
    },
    {
        "source_sentence": "默然從座起去者，謂出勢分外。",
        "translation": "Someone who rises and leaves from his seat in silence means to go outside the momentum section.",
        "source": "T23n1443_016:0993b21_3"
    },
    {
        "source_sentence": "不囑授者，有尼不語知而去。",
        "translation": "If someone doesn't entrust it, a nun who leaves without saying anything will know.",
        "source": "T23n1443_016:0993b22_4"
    },
    {
        "source_sentence": "釋罪同前。",
        "translation": "The explanation of the offense is the same as the previous one.",
        "source": "T23n1443_016:0993b22_5"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_016:0993b23_6"
    },
    {
        "source_sentence": "若苾芻尼，知眾有如法事言論決擇，有尼不囑授，默然從座而起去者，乃至言聲所及處來，得惡作罪。",
        "translation": "If a monk or nun knows that there's a congregation who speaks and decides according to the rules, but if a nun doesn't instruct him or her, silently rises from his or her seat and leaves it, or even goes wherever he or she says he or she is going, he or she will be guilty of misdeeds.",
        "source": "T23n1443_016:0993b23_7"
    },
    {
        "source_sentence": "捨此處時，得根本罪。",
        "translation": "When he abandons this place, he'll attain the fundamental sin.",
        "source": "T23n1443_016:0993b25_8"
    },
    {
        "source_sentence": "　不恭敬飲食、　　入聚往餘家、",
        "translation": "They don't respect food and drink, enter groups and go to other homes,",
        "source": "T23n1443_016:0993b27_0"
    },
    {
        "source_sentence": "　明相攝耳筩、　　床足綿敷具。",
        "translation": "It's clear that the characteristics include earrings, feet, beds, seats, and cotton cloth.",
        "source": "T23n1443_016:0993b27_0"
    },
    {
        "source_sentence": "第七攝頌曰：不恭敬學處第六十一緣在王舍城。",
        "translation": "The seventh collected verse says, The sixty-first condition of disrespectful training is in the city of Rājagṛha.",
        "source": "T23n1443_016:0993b27_0"
    },
    {
        "source_sentence": "時有二苾芻，知諸苾芻集食堂中欲殄諍事，一順眾命，一便違教不赴眾所。",
        "translation": "Two monks then knew that the monks were assembled in the dining hall to discuss sexual misconduct, and one obeyed the orders of the others, while the other didn't go to the congregation.",
        "source": "T23n1443_016:0993c02_1"
    },
    {
        "source_sentence": "以緣白佛，佛以此緣同前訶責，「為二部弟子制其學處，應如是說：「若復苾芻尼，不恭敬者，波逸底迦。」",
        "translation": "He told the Buddha for this reason, and because of this reason the Buddha reprimanded him as before, saying, For the sake of the two groups of disciples who regulate their places of training, you should thus say, 'Suppose another monk or nun doesn't respect them, pratyekabuddha.'",
        "source": "T23n1443_016:0993c04_2"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0993c07_0"
    },
    {
        "source_sentence": "不恭敬者，其有二種：一、謂大眾，二、是別人，於此二處不恭敬時，皆得墮罪。",
        "translation": "There are two kinds of people who aren't respected: 1. the masses and 2. those who are other people, and when they aren't respected in these two places, they'll all fall into sin.",
        "source": "T23n1443_016:0993c07_1"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_016:0993c08_2"
    },
    {
        "source_sentence": "若尼知大眾集評論事時，喚令赴集而不來者，便得墮罪。",
        "translation": "If a nun knows that the masses are assembled to discuss things and summons someone who goes to the assembly but doesn't come, then they'll fall into sin.",
        "source": "T23n1443_016:0993c09_3"
    },
    {
        "source_sentence": "喚住不住、遣去不去，遣取臥具而不肯取、不遣取時即便強取，遣詣房等事皆同此，違眾教時皆得墮罪。",
        "translation": "When he calls, stays, doesn't abide, sends away, leaves, and doesn't take the bedding, refuses to take it or forcibly takes it when he doesn't send it, sends it to his room, and so forth, all these things are the same as this, and they'll fall into sin when they disobey the teachings of the crowd.",
        "source": "T23n1443_016:0993c10_4"
    },
    {
        "source_sentence": "若尼見親教、軌範二師作如是語，喚來不來乃至房等事，違別人教時皆得惡作。",
        "translation": "If a nun sees two masters who say such words to her relatives, the precepts and the rules, or calls for things that don't come or even go up to their room, they'll all be badly done when they disobey someone else's teaching.",
        "source": "T23n1443_016:0993c13_5"
    },
    {
        "source_sentence": "若依道理而白知者、非不恭敬，此皆無犯。",
        "translation": "If someone relies on reason and tells the knower or doesn't disrespect them, it's not a violation.",
        "source": "T23n1443_016:0993c14_6"
    },
    {
        "source_sentence": "飲酒學處第六十二",
        "translation": "Sixty-second Place of Study for Drinking alcohol",
        "source": "T23n1443_016:0993c16_0"
    },
    {
        "source_sentence": "緣在室羅伐城。",
        "translation": "The reason for this was in the city of Śrāvastī.",
        "source": "T23n1443_016:0993c17_0"
    },
    {
        "source_sentence": "有一長者名曰浮圖，大富多財衣食豐足，娶妻未久誕生一女，顏貌端正人所愛樂。",
        "translation": "There was an elderly man named Puṇḍarīka, who was very wealthy and had plenty of possessions, clothing, food, and property. Not long after he married his wife, a daughter born before long. Her appearance was graceful and pleasing to people.",
        "source": "T23n1443_016:0993c17_1"
    },
    {
        "source_sentence": "至年長大，娉與給孤獨長者男為妻，後誕一息。",
        "translation": "When she grew up, he gave her to Anāthapiṇḍika's old man as his wife and later gave birth to a son.",
        "source": "T23n1443_016:0993c19_2"
    },
    {
        "source_sentence": "父見歡喜，唱言：「善來！",
        "translation": "Seeing this, the father rejoiced and called out, Good friend!",
        "source": "T23n1443_016:0993c20_3"
    },
    {
        "source_sentence": "善來！」",
        "translation": "Welcome!",
        "source": "T23n1443_016:0993c20_4"
    },
    {
        "source_sentence": "時諸親族因與立名，號曰善來。",
        "translation": "The relatives then gave him a name, which was called Shanlai.",
        "source": "T23n1443_016:0993c20_5"
    },
    {
        "source_sentence": "由此孩兒薄福力故，所有家產日就消亡，父母俱喪。",
        "translation": "Because of this, the boy's weak power of fortune, his family property disappeared on a daily basis, and his parents died.",
        "source": "T23n1443_016:0993c21_6"
    },
    {
        "source_sentence": "時諸人眾見其如此，遂號惡來。",
        "translation": "Seeing him like this, the people then called out to evil.",
        "source": "T23n1443_016:0993c22_7"
    },
    {
        "source_sentence": "與乞匃人共為半侶，以乞活命。",
        "translation": "He and the beggar were half-companions, begging for their livelihood.",
        "source": "T23n1443_016:0993c23_8"
    },
    {
        "source_sentence": "「昔於諸佛所，　　但持瓦鐵身；",
        "translation": "“In the past, in the presence of all buddhas They merely carried iron bodies made of bricks and tiles.",
        "source": "T23n1443_016:0993c24_9"
    },
    {
        "source_sentence": "　今聞世尊教，　　轉作真金體。",
        "translation": "Now that I've heard the Bhagavān teach, I'll turn it into a truly golden body.",
        "source": "T23n1443_016:0993c24_9"
    },
    {
        "source_sentence": "　我於生死中，　　更不受後有；",
        "translation": "In the midst of birth and death, I won’t experience another existence.",
        "source": "T23n1443_016:0993c24_9"
    },
    {
        "source_sentence": "　奉持無漏法，　　安趣涅槃城。",
        "translation": "Observing the uncontaminated Dharma, he's headed for the city of nirvāṇa.",
        "source": "T23n1443_016:0993c24_9"
    },
    {
        "source_sentence": "　若人樂珍寶，　　及生天解脫；",
        "translation": "If people enjoy treasures and jewels, They’ll be born in heaven and attain liberation.",
        "source": "T23n1443_016:0993c24_9"
    },
    {
        "source_sentence": "　當近善知識，　　所欲皆隨意。」",
        "translation": "You should approach a good teacher and follow whatever you want.",
        "source": "T23n1443_016:0993c24_9"
    },
    {
        "source_sentence": "廣說乃至修青處觀影像現前，世尊復為演說法要示教利喜，便證見諦，出家離俗修持梵行，發大勇猛守堅固心，於初後夜思惟忘倦，斷除結惑證阿羅漢果，說伽他曰：時不信敬者便生嫌議：「沙門喬答摩！",
        "translation": "When the Bhagavān again taught the essentials of the Dharma, showed them benefits and joy, then realized the truth, renounced home, became secular, cultivated religious practice, aroused great courage and maintained a firm mind, forgot to contemplate late in the morning and late at night, cut off the bonds and afflictions, and realized the fruit of arhatship, he said to Kātyāyana, Those who",
        "source": "T23n1443_016:0993c24_9"
    },
    {
        "source_sentence": "貧賤愚人皆度出家，以為走使。」",
        "translation": "The poor and foolish are all freed from the householder's life and made to leave home as messengers.",
        "source": "T23n1443_016:0994a06_10"
    },
    {
        "source_sentence": "世尊為欲發起善來德故，令調毒龍，乃至龍受三歸并五學處。",
        "translation": "Because the Bhagavān wanted to give rise to the virtue of a good teacher, he caused poisonous dragons and even dragons to receive the three refuges and five places of training.",
        "source": "T23n1443_016:0994a07_11"
    },
    {
        "source_sentence": "佛告諸苾芻：「我諸弟子聲聞之中降伏毒龍，善來第一。」",
        "translation": "The Buddha told the monks, Among my disciples and śrāvakas who subdued poisonous dragons, Sunetra is the first.",
        "source": "T23n1443_016:0994a08_12"
    },
    {
        "source_sentence": "時收摩羅山遠近諸人婆羅門等，見伏毒龍眾無惱害。",
        "translation": "At the time, he gathered a crowd of people and priests from distant places on Mount Malla who saw him subdue the poisonous dragons without harming them.",
        "source": "T23n1443_016:0994a10_13"
    },
    {
        "source_sentence": "時有婆羅門奉請善來，以上妙飲食至誠供養令飽食已，欲使善來食速消化，便以少許飲象之酒置飲漿中。",
        "translation": "A Brāhmaṇa then invited the goodcomer and offered him these wonderful foods as sincere offerings, so that he would be able to eat them. Wishing to make the goodcomer's food quickly digested, he put a small amount of wine from the drinking elephant in the juice.",
        "source": "T23n1443_016:0994a11_14"
    },
    {
        "source_sentence": "善來不知，飲此漿已醉臥于地。",
        "translation": "The good man didn't know, and after drinking this juice, he got drunk and lay on the ground.",
        "source": "T23n1443_016:0994a13_15"
    },
    {
        "source_sentence": "諸佛世尊於一切時得不忘念，便於善來臥處化為草菴，蓋覆其身不令人見，告諸苾芻曰：「汝等當觀善來所作，於江猪山處降伏菴婆毒龍，豈復今時能調小蟹？",
        "translation": "The buddhas and world-honored ones, being mindful of everything at all times without forgetting anything, then transformed themselves into grass duvets in the place where Shanlai was lying and covered their bodies so that no one would see them. They said to the monks, “You should observe what Shanlai has done. You must subdue the poisonous dragon gandharva on Mount Jiangzhi. How could you",
        "source": "T23n1443_016:0994a14_16"
    },
    {
        "source_sentence": "汝諸苾芻！",
        "translation": "You monks!",
        "source": "T23n1443_016:0994a18_17"
    },
    {
        "source_sentence": "若飲酒者有斯大失。」",
        "translation": "If someone drinks alcohol, there's this great error.",
        "source": "T23n1443_016:0994a18_18"
    },
    {
        "source_sentence": "即以無量百千網鞔輪相福德殊勝莊嚴王手，摩善來頂，告言：「善來！",
        "translation": "He then put his hand on the king's head with measureless hundreds of thousands of webs of silhouetted rings of merit and extraordinary adornments, touched him, and said, Welcome!",
        "source": "T23n1443_016:0994a18_19"
    },
    {
        "source_sentence": "何不觀察受斯困頓？」",
        "translation": "Why don't you observe and experience this kind of distress?",
        "source": "T23n1443_016:0994a20_20"
    },
    {
        "source_sentence": "爾時善來得少醒悟，隨從佛後至逝多林。",
        "translation": "It was then that the well-come man attained a little awakening and followed the Buddha to Jeta's Grove after him.",
        "source": "T23n1443_016:0994a20_21"
    },
    {
        "source_sentence": "佛洗足已，於如常座就之而坐，告諸苾芻曰：「汝等當觀，諸飲酒者有斯過失。」",
        "translation": "After washing his feet, the Buddha sat down on his regular seat and said to the monks, You should observe that these are the faults of those who drink alcohol.",
        "source": "T23n1443_016:0994a21_22"
    },
    {
        "source_sentence": "讚歎持戒，廣說乃至「我觀十利，為二部弟子制其學處，應如是說：「若復苾芻尼，飲諸酒者，波逸底迦。」",
        "translation": "He praises observance of the precepts and explains them in detail, saying, I observe the ten benefits for two groups of disciples to regulate their places of training, and you should thus say, 'Suppose another monk or nun drinks alcohol, pratyekabuddha.'",
        "source": "T23n1443_016:0994a23_23"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0994a26_0"
    },
    {
        "source_sentence": "言諸酒者，謂米麴酒，或以根莖皮葉花果相和成酒，此等諸酒飲時令人惛醉。",
        "translation": "The term wine refers to rice and wine, which are made into wine by combining roots, stems, skin, leaves, flowers, fruit, and fruits, and these wines make people drunk when they drink them.",
        "source": "T23n1443_016:0994a26_1"
    },
    {
        "source_sentence": "飲者，謂吞咽。",
        "translation": "A drinker means to swallow.",
        "source": "T23n1443_016:0994a28_2"
    },
    {
        "source_sentence": "釋罪如前。",
        "translation": "The explanation of the offense is as before.",
        "source": "T23n1443_016:0994a28_3"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_016:0994a28_4"
    },
    {
        "source_sentence": "若尼飲諸酒時能令人醉，波逸底迦；",
        "translation": "If a nun is able to get someone drunk while drinking alcohol, pratyekabuddha; if she is able to get someone drunk while drinking alcohol, pratyekabuddha.",
        "source": "T23n1443_016:0994a29_5"
    },
    {
        "source_sentence": "若不醉人飲，得惡作罪。",
        "translation": "If someone who isn't drunk and drinks it, they'll be guilty of a misdeed.",
        "source": "T23n1443_016:0994a29_6"
    },
    {
        "source_sentence": "若尼見彼諸酒，有酒色酒氣酒味，若能醉者波逸底迦；",
        "translation": "If a nun sees any of those wines with the color, aroma, or taste of wine, and if she is able to get drunk, it will be a pāyattika.",
        "source": "T23n1443_016:0994b01_7"
    },
    {
        "source_sentence": "若不醉者得三惡作。",
        "translation": "If someone isn't drunk, they'll attain the three bad actions.",
        "source": "T23n1443_016:0994b02_8"
    },
    {
        "source_sentence": "若尼飲諸酒時，有酒色酒氣，若能醉者波逸底迦；",
        "translation": "If a nun drinks alcohol, she will have the color of alcohol and the energy of alcohol. If she can get drunk, it is pāyattika.",
        "source": "T23n1443_016:0994b03_9"
    },
    {
        "source_sentence": "若不醉者，得二惡作。",
        "translation": "If someone isn't drunk, they'll attain two bad actions.",
        "source": "T23n1443_016:0994b04_10"
    },
    {
        "source_sentence": "若尼飲諸酒時，但有酒色，若能醉者隨罪，若不醉者得一惡作。",
        "translation": "If a nun drinks alcohol but has the color of alcohol when she's drunk, and if she can get drunk, she'll be guilty of crimes, and if she doesn't get drunk, she'll attain one bad action.",
        "source": "T23n1443_016:0994b04_11"
    },
    {
        "source_sentence": "若食酒糟醉者墮罪，若不醉者得惡作罪。",
        "translation": "If someone eats alcohol and becomes drunk, they'll be guilty of a sin, and if they aren't drunk, they'll be guilty of a misdeed.",
        "source": "T23n1443_016:0994b06_12"
    },
    {
        "source_sentence": "若尼食諸根莖葉花果能醉人者，皆得惡作。",
        "translation": "If a nun eats the roots, stems, leaves, flowers, and fruits that can get drunk, they'll all be badly done.",
        "source": "T23n1443_016:0994b07_13"
    },
    {
        "source_sentence": "佛告諸苾芻苾芻尼：「汝等若以我為師者，凡是諸酒不應自飲，亦不與人，乃至不以茅端渧酒而著口中，若故違者得越法罪。",
        "translation": "The Buddha told the monks and nuns, If you take me as your teacher, all of you shouldn't drink this wine for yourself, give it to others, or put it in your mouths with a drop of wine on a blade of thatch; if you do so, you'll be guilty of transgressing the teaching.",
        "source": "T23n1443_016:0994b09_0"
    },
    {
        "source_sentence": "若苾芻尼飲醋之時，有酒色者，飲之無犯。",
        "translation": "If a bhikṣuṇī has the color of wine when she drinks vinegar, it's not a violation to drink it.",
        "source": "T23n1443_016:0994b11_1"
    },
    {
        "source_sentence": "若飲熟煮酒者，此亦無犯。",
        "translation": "If someone drinks cooked and boiled wine, it's not a violation either.",
        "source": "T23n1443_016:0994b12_2"
    },
    {
        "source_sentence": "若是醫人令含酒，或塗身者，無犯。」",
        "translation": "If this is a doctor who tells someone to contain wine or rubs it on their body, it's not a violation.",
        "source": "T23n1443_016:0994b13_3"
    },
    {
        "source_sentence": "非時入聚落不囑授苾芻尼學處第六十三緣處同前。",
        "translation": "When it's not the right time, he enters a village and doesn't entrust the place of training for monks and nuns. The sixty-third causal locus is the same as the previous one.",
        "source": "T23n1443_016:0994b15_0"
    },
    {
        "source_sentence": "時有餘處婆羅門，來此城中娶婦同居，未經多時誕生一女。",
        "translation": "At the time, there were other Brāhmaṇas who came to this city to marry and lived together with their wives, and before long a woman was born.",
        "source": "T23n1443_016:0994b16_1"
    },
    {
        "source_sentence": "年漸長大，共諸童女往逝多林至寺門前。",
        "translation": "As he grew up, he went to Jeta's Grove with the other children and went in front of the temple gate.",
        "source": "T23n1443_016:0994b17_2"
    },
    {
        "source_sentence": "時鄔陀夷見此女人顏容姿媚，遂起染心，即摩觸彼身鳴唼其口。",
        "translation": "Udayana then saw the woman's beautiful appearance and became defiled, and he touched her body and clapped her mouth.",
        "source": "T23n1443_016:0994b18_3"
    },
    {
        "source_sentence": "是時童女欲行非法，鄔陀夷不然其事。",
        "translation": "The young woman then wanted to do something unlawful, but Udayana didn't.",
        "source": "T23n1443_016:0994b20_0"
    },
    {
        "source_sentence": "女懷瞋忿，遂以指甲自爴身形，既還家已告其父曰：「鄔陀夷損我童女。」",
        "translation": "The woman became angry and wrathful, so she covered her body with fingernails. After returning home, she told her father, Udayana harmed my young daughter.",
        "source": "T23n1443_016:0994b20_1"
    },
    {
        "source_sentence": "其父即告五百婆羅門，各懷瞋忿共集一處，欲打鄔陀夷。",
        "translation": "The father then told the five hundred brahmans, each with anger and anger, to assemble in one place and want to strike Udayana.",
        "source": "T23n1443_016:0994b22_2"
    },
    {
        "source_sentence": "時五百人即至其所俱共牽曳，乃至移足亦不能令動。",
        "translation": "The five hundred people then went to him, dragged it together, and even when they lifted their legs they couldn't move.",
        "source": "T23n1443_016:0994b23_3"
    },
    {
        "source_sentence": "世尊知已作如是念：「此是最後教誡鄔陀夷事。」",
        "translation": "Knowing this, the Bhagavān had this thought, This is the final act of admonishing Udayana.",
        "source": "T23n1443_016:0994b25_0"
    },
    {
        "source_sentence": "佛衰其力令無所堪，諸婆羅門見其力弱，即共熟打幾將至死，曳至王門。",
        "translation": "When the Buddha's strength weakened, he became incapable of doing so. Seeing his weakness, the brāhmaṇas beat him together for a long time before he died and dragged him to the king's gate.",
        "source": "T23n1443_016:0994b26_1"
    },
    {
        "source_sentence": "時王於高樓上晝日而睡，佛以神力令王驚覺，廣說乃至勝鬘夫人告令改悔。",
        "translation": "When the king was sleeping in a high tower during the day, the Buddha used his miraculous powers to cause the king to be frightened and awakened, explaining it in detail up to the point where Lady Śrīmālā told him to repent.",
        "source": "T23n1443_016:0994b27_2"
    },
    {
        "source_sentence": "聞斯責已發勇猛心，未久之間，眾惑皆斷證阿羅漢果，廣度人民，世尊記為教化人中最為第一。",
        "translation": "After hearing this rebuke, he arouses a courageous mind and soon stops all the afflictions, realizes the fruit of arhatship, and saves many people, which the Bhagavān remembers as the best among those who teach.",
        "source": "T23n1443_016:0994b29_3"
    },
    {
        "source_sentence": "後因夜入他舍，非理被殺棄糞聚中。",
        "translation": "Later, he entered another's house at night and was unreasonably killed and thrown into a pile of dung.",
        "source": "T23n1443_016:0994c02_4"
    },
    {
        "source_sentence": "爾時世尊至住處已，告諸苾芻：「此由非時行，招斯大過。」",
        "translation": "After the Bhagavān arrived at his dwelling place, he told the monks, This is a great mistake because it's not the right time to do so.",
        "source": "T23n1443_016:0994c03_5"
    },
    {
        "source_sentence": "廣說乃至「我觀十利，為二部弟子制其學處，應如是說：若復苾芻尼，非時入聚落者，波逸底迦。」",
        "translation": "It's explained in detail up to I observe the ten benefits and regulate their places of training for two groups of disciples, and you should explain it this way: 'Suppose another monk or nun enters a village at an ungodly hour, pratyekabuddha.'",
        "source": "T23n1443_016:0994c04_6"
    },
    {
        "source_sentence": "如是制已，諸苾芻尼有看病人，不得非時入村，遂闕瞻視；",
        "translation": "Having made this rule, the bhikṣus and nuns who looked after the ill were not allowed to enter the village at an ungodly hour.",
        "source": "T23n1443_016:0994c06_7"
    },
    {
        "source_sentence": "知僧事者僧事廢闕。",
        "translation": "Those who know the affairs of the saṃgha have discarded the affairs of the saṃgha.",
        "source": "T23n1443_016:0994c08_8"
    },
    {
        "source_sentence": "以事白佛，佛言：「有苾芻尼者囑授應去。",
        "translation": "He told the Buddha about this, and he said, There's a bhikṣuṇī who instructed him to leave.",
        "source": "T23n1443_016:0994c08_9"
    },
    {
        "source_sentence": "應告彼曰：『具壽存念！",
        "translation": "You should tell them, 'Gushou存念!",
        "source": "T23n1443_016:0994c09_10"
    },
    {
        "source_sentence": "我有看病因緣、或為眾事，須非時入聚落。",
        "translation": "I have to see the causes and conditions of illness or various things, so I must enter a village at an ungodly hour.",
        "source": "T23n1443_016:0994c09_11"
    },
    {
        "source_sentence": "白具壽知。』",
        "translation": "He said, 'I'll tell you the full life span.'",
        "source": "T23n1443_016:0994c10_12"
    },
    {
        "source_sentence": "彼答云：『奧箄迦。』」",
        "translation": "They replied, 'Abhidharma.'",
        "source": "T23n1443_016:0994c11_13"
    },
    {
        "source_sentence": "時有苾芻於俗舍內先寄衣鉢，其舍非時忽然火起，即便往取；",
        "translation": "A bhikṣu had previously sent his robe and bowl to a layman’s dwelling. At an ungodly hour the house suddenly caught on fire and immediately went out to take it.",
        "source": "T23n1443_016:0994c11_14"
    },
    {
        "source_sentence": "行至中路憶不囑授，遂即迴還，衣鉢燒盡，佛言：「除因緣故。",
        "translation": "When he reached the middle of the road, he remembered that he hadn't instructed him to do so, and then returned with his robes and bowl burned up.",
        "source": "T23n1443_016:0994c12_15"
    },
    {
        "source_sentence": "前是創制、今更隨開，應如是說：「若復苾芻尼非時入聚落，不囑授餘苾芻尼，除因緣故，波逸底迦。」",
        "translation": "Formerly, this was the creation of the system but now it's further opened, so you should say, If another monk or nun enters a village at an ungodly hour and doesn't entrust it to another monk or nun, except for causes and conditions, pratyekabuddha.",
        "source": "T23n1443_016:0994c14_16"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0994c17_0"
    },
    {
        "source_sentence": "非時者，有二分齊：謂從過午至明相未出。",
        "translation": "When it is not the right time, there are two distinctive characteristics: from past noon up to when the light has yet to emerge.",
        "source": "T23n1443_016:0994c17_1"
    },
    {
        "source_sentence": "聚落義如上。",
        "translation": "The meaning of a village is as above.",
        "source": "T23n1443_016:0994c18_2"
    },
    {
        "source_sentence": "入者，謂至村門。",
        "translation": "“Entry”: arriving at the village gate.",
        "source": "T23n1443_016:0994c18_3"
    },
    {
        "source_sentence": "餘苾芻尼者，謂於其處既有苾芻尼而不告語。",
        "translation": "The rest of the bhikṣuṇīs means that there are bhikṣuṇīs who aren't told where they are located.",
        "source": "T23n1443_016:0994c18_4"
    },
    {
        "source_sentence": "除時因緣者，謂有難緣，餘義如上。",
        "translation": "“Exception made for the supporting object at the moment”: Conditioned by what is difficult, the other meanings are as above.",
        "source": "T23n1443_016:0994c19_5"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1443_016:0994c20_6"
    },
    {
        "source_sentence": "若苾芻尼，於非時非時想疑，得根本罪；",
        "translation": "If a bhikṣuṇī perceives doubt at an ungodly hour, he or she will be guilty of the fundamental sin.",
        "source": "T23n1443_016:0994c21_7"
    },
    {
        "source_sentence": "於時作非時想疑，得惡作罪。",
        "translation": "A person who doubts what's done at the right time and what's not done at the right time commits the sin of bad action.",
        "source": "T23n1443_016:0994c22_0"
    },
    {
        "source_sentence": "餘二無犯。",
        "translation": "The other two are not offenses.",
        "source": "T23n1443_016:0994c22_1"
    },
    {
        "source_sentence": "餘有昔因緣，同苾芻說。",
        "translation": "The rest had causes and conditions from the past, which are the same as those explained by the monks.",
        "source": "T23n1443_016:0994c22_2"
    },
    {
        "source_sentence": "受食前食後請學處第六十四",
        "translation": "Sixty-seventh Place of Cultivation Before Accepting Food and After Eating, and after Invited by the Buddha",
        "source": "T23n1443_016:0994c24_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_016:0994c25_0"
    },
    {
        "source_sentence": "時此城中有一長者，大富多財受用豐足。",
        "translation": "At the time, there was an elderly man in this city who was very wealthy and had plenty of possessions to use.",
        "source": "T23n1443_016:0994c25_1"
    },
    {
        "source_sentence": "時鄔陀夷因乞食至其舍，為說法要：施食之人獲五功德，謂長命、色、力、安樂、詞辯。",
        "translation": "Udayana then went to his house for almsfood and taught the essentials of the Dharma: Those who give food will attain five virtues, which are long life, form, strength, peace and happiness, and eloquence.",
        "source": "T23n1443_016:0994c26_2"
    },
    {
        "source_sentence": "長者聞已持食奉施，深心歡喜頂禮其足，歸依三寶受五學處。",
        "translation": "After hearing this, the elderly man offered food and gave it to him, profoundly bowed his head at his feet with joy, relied on the Three Treasures, and accepted the five places of training.",
        "source": "T23n1443_016:0994c27_3"
    },
    {
        "source_sentence": "時鄔陀夷復於他日至長者家，長者白言：「我請佛僧就舍而食，仁可早來。」",
        "translation": "Udayana then went back to the elder's house from another place, and the elder said, I've invited the Buddha and Saṃgha to go to their dwelling to eat, so please come early.",
        "source": "T23n1443_016:0994c29_4"
    },
    {
        "source_sentence": "即於晨朝至長者宅，報曰：「我有緣事暫至餘家，我若未來不須行食。」",
        "translation": "In the morning, he went to the elder's house and reported, I have a reason to go to another house for a while, so if I don't need to eat in the future.",
        "source": "T23n1443_016:0995a02_0"
    },
    {
        "source_sentence": "佛將大眾詣長者家，時諸苾芻報長者曰：「應唱隨意。」",
        "translation": "When the Buddha led the crowd to the elder's house, the monks reported to the elder, You should sing it as you wish.",
        "source": "T23n1443_016:0995a03_1"
    },
    {
        "source_sentence": "長者報曰：「聖者！",
        "translation": "The elder replied, Sage!",
        "source": "T23n1443_016:0995a04_2"
    },
    {
        "source_sentence": "我為大眾設斯座褥。」",
        "translation": "I'll set up this seat mat for the masses.",
        "source": "T23n1443_016:0995a05_3"
    },
    {
        "source_sentence": "佛言：「此即便是唱隨意訖，宜應就坐。」",
        "translation": "The Buddha said, Even so, it's appropriate to take a seat after the recitation is done as you wish.",
        "source": "T23n1443_016:0995a05_4"
    },
    {
        "source_sentence": "時鄔陀夷時欲將過方至行食，諸苾芻輩有噉少許、有不食者，佛為長者說施頌已，從座而去。",
        "translation": "When Udayana was about to leave and went to eat, some of the monks with little anger and some who didn't eat, the Buddha spoke a verse of generosity for the elderly man, left his seat, and departed.",
        "source": "T23n1443_016:0995a06_5"
    },
    {
        "source_sentence": "鄔波難陀即於此住不往寺中，當時是十五日眾僧長淨不來赴集，復無持欲人，眾皆久坐妨廢法事，求覓不得令眾疲勞，廣說乃至「我觀十利，為二部弟子制其學處，應如是說：「若復苾芻尼，受食家請，食前食後行詣餘家者，波逸底迦。」",
        "translation": "Upananda then stayed here and didn't go to the monastery, but on the fifteenth day, the monks of the saṃgha were so long purified that they didn't come to the assembly, and there were no people who held desires for them.",
        "source": "T23n1443_016:0995a08_6"
    },
    {
        "source_sentence": "如是制已，時有看病、知僧事者同前過起，佛聞此已，告曰：「前是創制、今復隨開，應如是說：「若復苾芻尼，受食家請，食前食後行詣餘家不囑授者，除因緣故，波逸底迦。」",
        "translation": "After this rule is established, if someone who's sick and knows the saṃgha's affairs are the same as the previous one, then the Buddha hears it and tells them, This was a rule that was created before and now follows it, so he or she should say, Suppose another bhikṣuṇī accepts an invitation to eat at home and goes to another house without entrusting it, except for causes and conditions",
        "source": "T23n1443_016:0995a15_0"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0995a19_0"
    },
    {
        "source_sentence": "食家請者，謂他請喚。",
        "translation": "Those who are invited by the food family refer to those who are invited by others.",
        "source": "T23n1443_016:0995a19_1"
    },
    {
        "source_sentence": "食前者，謂是午前，若出行時過二家者，便得墮罪。",
        "translation": "Before he eats, it's called morning. If he travels past the two houses at the time of his journey, he'll be guilty of a sin.",
        "source": "T23n1443_016:0995a19_2"
    },
    {
        "source_sentence": "食後者，謂過午已後，若出行時過三家者，便得墮罪。",
        "translation": "The latter refers to someone who goes beyond the noon hour and goes beyond the three houses when traveling, and then they'll fall into sin.",
        "source": "T23n1443_016:0995a20_3"
    },
    {
        "source_sentence": "不囑授者，謂不報人，應囑施主云：「我往某處。」",
        "translation": "Someone who doesn't entrust means someone who doesn't repay the donor and should entrust the donor with the task, saying, I'll go to a certain place.",
        "source": "T23n1443_016:0995a22_0"
    },
    {
        "source_sentence": "或囑苾芻尼云：「向某處。」",
        "translation": "Perhaps he or she asks a monk or nun to say, To a certain place.",
        "source": "T23n1443_016:0995a23_0"
    },
    {
        "source_sentence": "結罪如上。",
        "translation": "The binding sins are as above.",
        "source": "T23n1443_016:0995a23_1"
    },
    {
        "source_sentence": "此中犯相，若受食家請，食前行過二家、食後行過三家，不囑授得墮罪。",
        "translation": "These are the signs of a violation: if someone is invited by a food house to eat, walks past two houses before eating, and goes past three houses after eating without asking them to do so, they'll fall into sin.",
        "source": "T23n1443_016:0995a23_2"
    },
    {
        "source_sentence": "若不以此苾芻尼為先首而請喚者，無犯。",
        "translation": "If someone doesn't make this monk or nun the first to summon them, it's not a violation.",
        "source": "T23n1443_016:0995a25_3"
    },
    {
        "source_sentence": "入王宮學處第六十五",
        "translation": "Sixty-fifth Place of Study Entering the Palace of the King",
        "source": "T23n1443_016:0995a27_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_016:0995a28_0"
    },
    {
        "source_sentence": "時鄔陀夷不知機變，夜聞兵馬鈴鐸之響，即便驚覺作如是念：「豈非王眾有事他行？」",
        "translation": "When Udayana didn't know the opportunity to change, he heard the sound of soldiers and horses ringing bells and chimes at night and even became frightened when he heard them.",
        "source": "T23n1443_016:0995a28_1"
    },
    {
        "source_sentence": "即於未明作天明想，執持衣鉢入王宮中。",
        "translation": "That's when he creates the notion of divine illumination in the unknown, takes his robe and bowl into the king's palace with his robe and bowl.",
        "source": "T23n1443_016:0995b01_2"
    },
    {
        "source_sentence": "勝鬘夫人聞已，迎接敬受經教，再三反覆猶未天明。",
        "translation": "After hearing this, Lady Vaiśravaṇa greeted and respectfully accepted the sūtras and teachings, repeating them three times and three times as if they hadn't been taught by heavenly illumination.",
        "source": "T23n1443_016:0995b02_3"
    },
    {
        "source_sentence": "宮人譏議：「王雖敬信，情無間然，苾芻不識時機中宵而至，王未藏寶及諸寶類，而便造次輒到宮門。」",
        "translation": "The palace officials criticized him, saying, Although the king respected and believed it, his feelings were unremitting, and the monks didn't know the time and opportunity to arrive late at night; the king didn't store treasures or other kinds of treasures, so he went straight to the palace gate in order.",
        "source": "T23n1443_016:0995b03_4"
    },
    {
        "source_sentence": "廣說乃至佛以此緣，告諸苾芻苾芻尼：「入王宮者有十種過失，廣說具如大苾芻律，乃至我觀十利，為二部弟子制其學處，應如是說：「若復苾芻尼明相未出，剎帝利灌頂王未藏寶及寶類，若入過宮門閫者，波逸底迦。」",
        "translation": "For this reason, the Buddha explained it in detail and told the monks and nuns, There are ten kinds of faults that those who enter the king's palace have, and he explained it in detail as described in the Mahāprajñāpāramitā, even up to the point where I observe the ten benefits for the two groups of disciples regulate their training places for them, and they should thus say, Suppose another",
        "source": "T23n1443_016:0995b05_5"
    },
    {
        "source_sentence": "如是制已，復於異時，王請佛僧。",
        "translation": "After this rule, there was another time when the king invited the buddhas and monks.",
        "source": "T23n1443_016:0995b11_0"
    },
    {
        "source_sentence": "世尊不去，令舍利子與眾俱行。",
        "translation": "The Bhagavān didn't go, and he caused Śāriputra to walk with the crowd.",
        "source": "T23n1443_016:0995b11_1"
    },
    {
        "source_sentence": "既至王門不敢輒入，王命令進。",
        "translation": "When he arrived at the king's entrance, he didn't dare to enter it lightly, and the king ordered him to enter.",
        "source": "T23n1443_016:0995b12_2"
    },
    {
        "source_sentence": "舍利子作念：「世尊制戒，不許輒入宮門。",
        "translation": "Śāriputra thought, Bhagavān, the Bhagavān has established precepts that won't allow him to enter the palace gate easily.",
        "source": "T23n1443_016:0995b13_3"
    },
    {
        "source_sentence": "今得王教，復不許違。",
        "translation": "Now that I have received the king’s instruction, I will not allow anyone to disobey me.",
        "source": "T23n1443_016:0995b14_0"
    },
    {
        "source_sentence": "佛以此緣或容開許。」",
        "translation": "Because of this condition, the Buddha may allow it to be permitted.",
        "source": "T23n1443_016:0995b14_1"
    },
    {
        "source_sentence": "即入宮內。",
        "translation": "He then entered the palace.",
        "source": "T23n1443_016:0995b14_2"
    },
    {
        "source_sentence": "還至佛所，述如上事。",
        "translation": "He returned to the Buddha and told him the above story.",
        "source": "T23n1443_016:0995b15_3"
    },
    {
        "source_sentence": "佛告舍利子：「善哉！",
        "translation": "The Buddha told Śāriputra, Good!",
        "source": "T23n1443_016:0995b15_4"
    },
    {
        "source_sentence": "我未開許汝已知時。",
        "translation": "I won't allow you to know it.",
        "source": "T23n1443_016:0995b16_5"
    },
    {
        "source_sentence": "汝等當知，前是創制、今更隨開，為諸弟子應如是說：「若復苾芻尼，明相未出，剎帝利灌頂王未藏寶及寶類，若入過宮門閫者，除餘緣故，波逸底迦。」",
        "translation": "You should know that the rules were created before and are now being opened, and you should explain them to the disciples in this way, Suppose another monk or nun whose luminous features haven't yet emerged but who hasn't hidden treasures or other treasures from the king of the kṣatriya consecration doesn't enter through the palace gate if he enters it, except for some other reason, pratyekabud",
        "source": "T23n1443_016:0995b16_6"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0995b21_0"
    },
    {
        "source_sentence": "明相未出者，謂天未曉，有三種相。",
        "translation": "Someone who explains the three kinds of characteristics before they emerge means that there are three kinds of characteristics before the gods awaken.",
        "source": "T23n1443_016:0995b21_1"
    },
    {
        "source_sentence": "王及寶等並如餘說。",
        "translation": "The king and the treasures are as explained above.",
        "source": "T23n1443_016:0995b22_0"
    },
    {
        "source_sentence": "宮門閫者，有三種別：謂城門、王門、宮門。",
        "translation": "The gates of the palace are divided into three kinds: city gates, king gates, and palace gates.",
        "source": "T23n1443_016:0995b22_1"
    },
    {
        "source_sentence": "過者，謂舉足越。",
        "translation": "A mistake is to lift one's feet and go beyond.",
        "source": "T23n1443_016:0995b23_2"
    },
    {
        "source_sentence": "除餘緣故者，除得勝法如舍利子等。",
        "translation": "“Exception made for the other supporting objects”: Exception made for the acquisition of a superior factor - as such [things] as Sāriputta, etc.",
        "source": "T23n1443_016:0995b23_3"
    },
    {
        "source_sentence": "釋罪如上。",
        "translation": "The explanation of the offense is as above.",
        "source": "T23n1443_016:0995b24_4"
    },
    {
        "source_sentence": "此中犯相，若尼未曉未曉想及疑，越城門者，得惡作罪；",
        "translation": "These are the signs of an offense. If a nun who has no ideation or doubt but does not have no ideation and goes beyond the city gates, he is guilty of misdeeds.",
        "source": "T23n1443_016:0995b24_5"
    },
    {
        "source_sentence": "曉未曉想疑，亦得惡作。",
        "translation": "Knowing and not knowing, perception and doubt can also be badly done.",
        "source": "T23n1443_016:0995b26_0"
    },
    {
        "source_sentence": "王門亦爾。",
        "translation": "So it is with the king's approach.",
        "source": "T23n1443_016:0995b26_1"
    },
    {
        "source_sentence": "若越宮門想疑，本罪；",
        "translation": "If one transgresses through the door of a palace and perceives doubt, this is the original sin.",
        "source": "T23n1443_016:0995b26_2"
    },
    {
        "source_sentence": "次二惡作；",
        "translation": "The next two are unwholesome deeds.",
        "source": "T23n1443_016:0995b27_3"
    },
    {
        "source_sentence": "後二句無犯。",
        "translation": "The last two sentences are not offenses.",
        "source": "T23n1443_016:0995b27_4"
    },
    {
        "source_sentence": "若王妃及太子大臣喚，亦無犯。",
        "translation": "If the king, queen, or princes and ministers call it, it's not a violation.",
        "source": "T23n1443_016:0995b27_5"
    },
    {
        "source_sentence": "詐言不知學處第六十六",
        "translation": "Sixty-sixth place of training that doesn't know the basis of fraudulent speech",
        "source": "T23n1443_016:0995b29_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_016:0995c01_0"
    },
    {
        "source_sentence": "佛言：「半月半月應說波羅底木叉戒。」",
        "translation": "The Buddha said, Half a month and half a month should be spent teaching the prātimokṣa precepts.",
        "source": "T23n1443_016:0995c01_1"
    },
    {
        "source_sentence": "奉教而說。",
        "translation": "They follow the teaching and explain it.",
        "source": "T23n1443_016:0995c02_2"
    },
    {
        "source_sentence": "六眾聽戒之時，作如是語：「我今始知是法在戒經中說。」",
        "translation": "When the six groups of people listened to the precepts, they said, Now, I'll first know that this teaching is explained in the precepts sūtras.",
        "source": "T23n1443_016:0995c02_3"
    },
    {
        "source_sentence": "諸苾芻曰：「仁等比來豈不聞耶？」",
        "translation": "The monks said, Haven't you heard it, sirs?",
        "source": "T23n1443_016:0995c03_4"
    },
    {
        "source_sentence": "答曰：「豈可我等唯聽說此更無餘事？」",
        "translation": "He answered, How can we listen only to this and have nothing else?",
        "source": "T23n1443_016:0995c04_5"
    },
    {
        "source_sentence": "乃至世尊訶責，「為二部弟子制其學處，應如是說：「若復苾芻尼，半月半月說戒經時，作如是語：『具壽！",
        "translation": "The Bhagavān then reprimanded them, saying, 'For the sake of the two groups of disciples who regulate their places of training, you should thus say, 'Suppose another monk or nun says this, 'Gushou!' when he or she teaches the precepts for half a month or half a month, and he or she says:",
        "source": "T23n1443_016:0995c05_6"
    },
    {
        "source_sentence": "我今始知是法戒經中說。』",
        "translation": "Now, I've just come to know that it's explained in the Dharma precepts sūtras.'",
        "source": "T23n1443_016:0995c08_7"
    },
    {
        "source_sentence": "諸苾芻尼知是苾芻尼若二、若三同作長淨，況復過此，應語彼言：『具壽！",
        "translation": "If the monks and nuns know that this is a monk or nun who shares the same long-lasting purity with two or three, how much more so if they say, 'Gushou!'",
        "source": "T23n1443_016:0995c08_8"
    },
    {
        "source_sentence": "非不知故得免其罪，汝所犯罪應如法說悔。』",
        "translation": "It's not because you don't know that you'll be excused for your sins, and whatever crimes you commit should be expiated according to the rules.'",
        "source": "T23n1443_016:0995c10_9"
    },
    {
        "source_sentence": "當勸喻言：『具壽！",
        "translation": "You should encourage metaphors, saying, 'Gushou!",
        "source": "T23n1443_016:0995c11_10"
    },
    {
        "source_sentence": "此法希奇難可逢遇，汝說戒時，不恭敬、不住心、不殷重、不作意、不一想、不攝耳、不策念而聽法。』",
        "translation": "When you teach the precepts, you don't venerate them, don't abide in mind, don't pay attention, don't concentrate, don't singlemindedly think, don't collect your ears, and don't meditate to hear the teaching.'",
        "source": "T23n1443_016:0995c11_11"
    },
    {
        "source_sentence": "者，波逸底迦。」",
        "translation": "That's pratyekabuddha.",
        "source": "T23n1443_016:0995c13_12"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0995c15_0"
    },
    {
        "source_sentence": "說戒經時者，謂從八他勝乃至七滅諍法，相次而說詮其要義。",
        "translation": "When the scripture on moral precepts is preached, it means that from the eight superior qualities of others up to the seven rules for extinguishing disputes are explained in order and their essential meanings are expressed.",
        "source": "T23n1443_016:0995c15_1"
    },
    {
        "source_sentence": "我今始知等者，謂六眾與餘苾芻屢同聽戒，而彼故言我不知者，意欲令他心生憂悔故諠惱時眾。",
        "translation": "Those who say 'I don't know now' means that the six groups of people and the other monks often listen to the precepts together, but they therefore say 'I don't know' because I want to cause others to become sad and remorseful in their minds.",
        "source": "T23n1443_016:0995c16_2"
    },
    {
        "source_sentence": "諸苾芻當勸喻言等者，明不恭敬等有所虧失故。",
        "translation": "The bhikṣus should encourage metaphors such as saying, etc., because they explain that disrespect and so forth are deficient.",
        "source": "T23n1443_016:0995c18_3"
    },
    {
        "source_sentence": "此中犯相者，尼見說八他勝時如是乃至二十一殘罪七滅諍法，作如是說者，一一說時皆得墮罪。",
        "translation": "Here, the characteristic of a violation is that when a nun sees someone who teaches eight others' superiority, they'll be like this or twenty-one grave crimes and seven ways to extinguish anger, and if they say so, they'll all fall into sin when they teach each one.",
        "source": "T23n1443_016:0995c20_0"
    },
    {
        "source_sentence": "若實不了知如愚癡人者，說實無犯。",
        "translation": "If someone really doesn't know it like a foolish man, they say it's really not a violation.",
        "source": "T23n1443_016:0995c22_1"
    },
    {
        "source_sentence": "作針筒學處第六十七",
        "translation": "The Sixty-seventh Place of Study for Making a needle tube",
        "source": "T23n1443_016:0995c24_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_016:0995c25_0"
    },
    {
        "source_sentence": "有一工人名曰達摩，善牙骨作，先於外道心生敬信，因來寺中而聽法要，棄彼偽教契想真宗，念曰：「然我家貧難修福業，宜可自勵役己惠人。」",
        "translation": "There was a worker named Dharma, made of good teeth and bones, who first had faith in the minds of non-Buddhists. So he came to a monastery to hear the essentials of the Dharma and abandoned their false teachings and cultivated the true doctrine, thinking, Still, my home is poor and difficult to cultivate meritorious activities, so it's better to encourage oneself and help others.",
        "source": "T23n1443_016:0995c25_1"
    },
    {
        "source_sentence": "白諸苾芻、苾芻尼曰：「我善牙作及骨，若須針筒，我當施手為造。」",
        "translation": "He said to the monks and nuns, I'll make my good teeth and bones for you, and if you need a needle or syringe, I'll give it to you to make them with my hand.",
        "source": "T23n1443_016:0995c28_2"
    },
    {
        "source_sentence": "時彼工入因致貧困，衣不掩形、食不充口。",
        "translation": "That worker then became poor because he entered, and his clothing didn't cover his form and food didn't fill his mouth.",
        "source": "T23n1443_016:0995c29_3"
    },
    {
        "source_sentence": "外道見問：「汝於先時家道豐贍，今依剃髮遂致貧窮。",
        "translation": "The non-Buddhist monks saw him and asked, In the past, your family was prosperous in Buddhism, but now you've become poor because of shaving.",
        "source": "T23n1443_016:0996a01_4"
    },
    {
        "source_sentence": "以此察之，孰為勝友？」",
        "translation": "Who would be the best friend to examine them with this?",
        "source": "T23n1443_016:0996a02_5"
    },
    {
        "source_sentence": "廣說乃至世尊訶責，告諸苾芻：「我觀十利，為二部弟子制其學處，應如是說：「若復苾芻尼，用骨牙角作針筒，成者應打碎，波逸底迦。」",
        "translation": "It's explained in detail up to the point where the Bhagavān reprimanded them and told the monks, I observe the ten benefits for two groups of disciples who regulate their places of training, and they should thus say, 'Suppose another monk or nun uses a needle tube made of bones, teeth, horns, and horns to make a needle tube, and when it's",
        "source": "T23n1443_016:0996a03_6"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0996a08_0"
    },
    {
        "source_sentence": "其骨牙角如事可知。",
        "translation": "The bones, teeth, horns, and horns are as you can see.",
        "source": "T23n1443_016:0996a08_1"
    },
    {
        "source_sentence": "有二種針筒：一、筒，二、管。",
        "translation": "There are two kinds of needle and tube: 1. the tube and 2. the tube.",
        "source": "T23n1443_016:0996a08_2"
    },
    {
        "source_sentence": "若用骨牙角作者，二皆不許。",
        "translation": "If the author uses bones, teeth, horns, and horns, neither of them will be allowed.",
        "source": "T23n1443_016:0996a09_3"
    },
    {
        "source_sentence": "若自、若他並不應作。",
        "translation": "Whether it's self or other, it shouldn't be done.",
        "source": "T23n1443_016:0996a09_4"
    },
    {
        "source_sentence": "若成者即應打碎，其罪說悔。",
        "translation": "If it's accomplished, they should be beaten and broken, and their sins are explained as repentance.",
        "source": "T23n1443_016:0996a10_5"
    },
    {
        "source_sentence": "其所對人應問云：「爾針筒打碎未？」",
        "translation": "The person facing him should ask, Have you broken the needle and syringe?",
        "source": "T23n1443_016:0996a11_6"
    },
    {
        "source_sentence": "若不問者得惡作罪。",
        "translation": "If someone doesn't ask, they'll be guilty of misdeeds.",
        "source": "T23n1443_016:0996a11_7"
    },
    {
        "source_sentence": "問已方悔。",
        "translation": "After he asked, he then repented.",
        "source": "T23n1443_016:0996a12_8"
    },
    {
        "source_sentence": "尼應用竹[竺-二+韋]為筒，或氈片等以安其針，時可數看勿令生垢，此皆無犯。",
        "translation": "If a nun uses bamboo [Zhu-ji+Wei] as a tube or puts blankets, cloth, etc., into the needle and repeatedly looks at it so that dirt doesn't grow, this is not a violation; neither of these are offenses.",
        "source": "T23n1443_016:0996a12_9"
    },
    {
        "source_sentence": "作過量床學處第六十八",
        "translation": "Sixty-eighth Place of Study for Making Oversized chairs",
        "source": "T23n1443_016:0996a15_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_016:0996a16_0"
    },
    {
        "source_sentence": "時有苾芻人間遊行至逝多林間，日暮門閉。",
        "translation": "A group of monks then traveled to the Jeta grove and closed the door at sunset.",
        "source": "T23n1443_016:0996a16_1"
    },
    {
        "source_sentence": "即於門屋下坐，短脚床洗足歛身入定。",
        "translation": "He then sat under the door and entered meditation on a short-legged bed, washed his feet, and covered his body.",
        "source": "T23n1443_016:0996a17_2"
    },
    {
        "source_sentence": "有蛇愛冷在床前住，見苾芻垂頭，遂螫其額，因即身亡生三十三天。",
        "translation": "A snake with a thirst for coldness was standing in front of the bed, and when it saw the monk's head hanging down, it stung his forehead, and he died and was reborn in the thirty-three heavens.",
        "source": "T23n1443_016:0996a18_3"
    },
    {
        "source_sentence": "廣說乃至以事白佛，佛言：「不應下小床上而為寢臥，亦不應床前洗足，違者得越法罪。」",
        "translation": "He explained this extensively and even told the Buddha about these things, and he said, You shouldn't go down on a small bed to sleep or wash your feet in front of the bed; someone who disobeys will be guilty of transgressing the Dharma.",
        "source": "T23n1443_016:0996a19_4"
    },
    {
        "source_sentence": "時六眾聞是制已，遂作高床，脚長七肘緣梯上下，俗旅譏嫌。",
        "translation": "After the six members of the assembly heard this rule, they made a high bed seven feet in height with legs that climbed up and down from the ladder. The common travelers resented it.",
        "source": "T23n1443_016:0996a21_5"
    },
    {
        "source_sentence": "世尊訶責告諸苾芻：「我觀十利，為二部弟子制其學處，應如是說：「若復苾芻尼，作大小床足，應高佛八指。",
        "translation": "The Bhagavān reprimanded them and told the monks, I'm observing the ten benefits, regulating their training places for the sake of two groups of disciples, and you should say this, 'Suppose another monk or nun makes a large or small bed legs that should be eight fingers high for the Buddha.",
        "source": "T23n1443_016:0996a23_6"
    },
    {
        "source_sentence": "若過作者應截去，波逸底迦。」",
        "translation": "If someone goes beyond the author, they should be cut off, pratyekabuddha.",
        "source": "T23n1443_016:0996a25_7"
    },
    {
        "source_sentence": "如是制已，時鄔陀夷身形長大，坐彼床時頦拄著膝，佛言：「此更隨開，除入梐木，若過者應截去，波逸底迦。」",
        "translation": "After this rule was made, the body of Udayana grew in size and when he sat on that bed, he put his foot against his knees, and the Buddha said, This is further to be opened, except for entering into the charcoal wood; if you go beyond it, you should remove it, pratyekabuddha.",
        "source": "T23n1443_016:0996a27_0"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0996b01_0"
    },
    {
        "source_sentence": "作大小床者，謂自作使人造。",
        "translation": "Someone who makes large and small beds refers to someone who makes them for themselves and causes others to make them.",
        "source": "T23n1443_016:0996b01_1"
    },
    {
        "source_sentence": "此大床及小座時應高佛八指者，佛謂大師，此之八指長中人一肘。",
        "translation": "When this large bed or small seat should be eight fingers high for the Buddha, the Buddha is called a great teacher, and these eight fingers are one elbow in height for the middle person.",
        "source": "T23n1443_016:0996b01_2"
    },
    {
        "source_sentence": "除入梐木者，除床脚入梐木，此非是量。",
        "translation": "This is not a measure. “Exception made for entering into logs”: Exception made for entering into logs with the legs of a bed - exception made for entering into logs with the legs, this is not a limitation.",
        "source": "T23n1443_016:0996b03_3"
    },
    {
        "source_sentence": "若過作者，謂量若過應截去。",
        "translation": "If there's a mistake by the author, it means that measurement or error should be cut off.",
        "source": "T23n1443_016:0996b04_4"
    },
    {
        "source_sentence": "墮罪應說悔。",
        "translation": "You should explain repentance if you've fallen into sin.",
        "source": "T23n1443_016:0996b04_5"
    },
    {
        "source_sentence": "此中犯相，若為僧作、若自為作，過八指量者應截去。",
        "translation": "These are the signs of a violation, which should be removed if they're made for the saṃgha or made for themselves, and those who go beyond the eight fingers should be removed.",
        "source": "T23n1443_016:0996b05_6"
    },
    {
        "source_sentence": "其罪說除。",
        "translation": "Their sins are said to be removed.",
        "source": "T23n1443_016:0996b06_7"
    },
    {
        "source_sentence": "對說罪者，應可問言：「床脚截未？」",
        "translation": "To someone who confesses a sin, they should ask, Has the footstool of the bed been cut off?",
        "source": "T23n1443_016:0996b06_8"
    },
    {
        "source_sentence": "若不問者得惡作罪，其罪不應說悔。",
        "translation": "If someone doesn't ask, they'll be guilty of misdeeds, and they won't confess their sins.",
        "source": "T23n1443_016:0996b07_9"
    },
    {
        "source_sentence": "若依量作者無犯。",
        "translation": "If the author relies on measurement, it's not a violation.",
        "source": "T23n1443_016:0996b08_10"
    },
    {
        "source_sentence": "用草木綿貯床學處第六十九",
        "translation": "He uses grass, wood, cotton, and cotton to store the sixty-sixth place of training.",
        "source": "T23n1443_016:0996b09_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_016:0996b10_0"
    },
    {
        "source_sentence": "時鄔波難陀分得大床，以木綿貯安儭而臥。",
        "translation": "Upananda then partially obtained a large bed, stored it in wooden cotton cloth, and lay down there.",
        "source": "T23n1443_016:0996b10_1"
    },
    {
        "source_sentence": "有年老者來，合與臥具時，便去儭物以散木綿，令其寢息，身衣總白。",
        "translation": "When an elderly man came and joined his bedding, he removed the coarse objects and spread wooden cotton cloth to make them sleep. His body and clothes were white in color.",
        "source": "T23n1443_016:0996b11_2"
    },
    {
        "source_sentence": "以緣白佛，佛言：「我觀十利，為二部弟子制其學處，應如是說：若復苾芻尼，以木綿等貯僧床座者，應撤去，波逸底迦。」",
        "translation": "Because of this, he said to the Buddha, I'm observing the ten benefits, and for the sake of the two groups of disciples who regulate their places of training, I should explain it like this: 'Suppose another monk or nun stores wooden cotton cloth or other saṃghâvaśeṣa seats for the saṃgha, which should be removed, pratyekabuddha.'",
        "source": "T23n1443_016:0996b12_3"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0996b16_0"
    },
    {
        "source_sentence": "言貯物者有五種：一、苫末梨，二、荻苫，三、頞迦，四、蒲薹，五、羊毛。",
        "translation": "When it comes to storing things, there are five kinds: 1. tamari, 2. anguḍa, 3. khaṭika, 4. paṭikā, and 5. sheep hair.",
        "source": "T23n1443_016:0996b16_1"
    },
    {
        "source_sentence": "若尼以五種物自貯、教人貯，皆得墮罪。",
        "translation": "If a nun stores five kinds of things for herself and teaches others to store them, they'll all fall into sin.",
        "source": "T23n1443_016:0996b17_2"
    },
    {
        "source_sentence": "此中犯者，苾芻尼若僧、私床座，以木綿等而散貯者，皆得墮罪。",
        "translation": "If someone commits this offense, a monk, nun, saṃgha, or private seat with wooden cotton and so forth that's stored away will all fall into sin.",
        "source": "T23n1443_016:0996b18_3"
    },
    {
        "source_sentence": "絮應撤去，罪應說悔，餘並同前。",
        "translation": "The flourish should be removed, and the offense should be expiated. The rest is the same as the previous one.",
        "source": "T23n1443_016:0996b20_0"
    },
    {
        "source_sentence": "過量作尼師但那學處第七十",
        "translation": "The Seventy-seventh Place of Study, Upāsaka Pūrṇa Maitrāyaniputra",
        "source": "T23n1443_016:0996b21_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_016:0996b22_0"
    },
    {
        "source_sentence": "如世尊說：「若受用僧伽臥具及餘人物乃至私物，應用儭身替。」",
        "translation": "As the Bhagavān said, Suppose someone uses a monk's bedding, other people, or even private property to replace it with a patched body.",
        "source": "T23n1443_016:0996b22_1"
    },
    {
        "source_sentence": "不識其量遂便大作，小者棄擲或嫌長短，廣說乃至世尊「為二部弟子制其學處，應如是說：「若復苾芻尼，作尼師但那當應量作。",
        "translation": "They don't know its size, so they make a large one, abandon the small one and toss it away or dislike longness and shortness, explaining in detail up to the Bhagavān, For the sake of the two groups of disciples who regulate their places of training, you should thus say, 'Suppose another monk or nun makes a nun, but he or she does it according to his or her",
        "source": "T23n1443_016:0996b23_2"
    },
    {
        "source_sentence": "是中量者，長佛二張手、廣一張手半。",
        "translation": "This is the middle measure of the Buddha's length, which is two hands long and one and a half hands wide.",
        "source": "T23n1443_016:0996b26_3"
    },
    {
        "source_sentence": "若過作者，波逸底迦。」",
        "translation": "If it's beyond the author, pratyekabuddha.",
        "source": "T23n1443_016:0996b27_4"
    },
    {
        "source_sentence": "如是制已，時吐羅尼身形長大，每至臥時為護臥具故，於其足邊以諸樹葉而為儭替，乃至佛言：「此復重開，長中更增一張手。",
        "translation": "After this rule was made, the Tārāṇī's body became so large that each time he lay down to protect his bedding, he replaced it with leaves on the side of his feet and placed a pair of tree leaves around him, even as if the Buddha said, Again, this is another hand that opens again and increases by one hand.",
        "source": "T23n1443_016:0996b28_5"
    },
    {
        "source_sentence": "若過作者應截去，波逸底迦。」",
        "translation": "If someone goes beyond the author, they should be cut off, pratyekabuddha.",
        "source": "T23n1443_016:0996c02_0"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0996c03_0"
    },
    {
        "source_sentence": "尼師但那者，謂敷具也。",
        "translation": "A nun's teacher named Danna refers to a set of implements.",
        "source": "T23n1443_016:0996c03_1"
    },
    {
        "source_sentence": "若自作、使人，皆悉同犯。",
        "translation": "If they do it themselves or the messengers, they're all the same offense.",
        "source": "T23n1443_016:0996c03_2"
    },
    {
        "source_sentence": "應量者，如文可知。",
        "translation": "The one that should be measured is as can be seen from the text.",
        "source": "T23n1443_016:0996c04_3"
    },
    {
        "source_sentence": "若佛一張手，當中人三張手，總長九張手，合有四肘半。",
        "translation": "If the Buddha's one hand is threefold, the person inside it has a total length of nine hands, which are four and a half zhou in all.",
        "source": "T23n1443_016:0996c04_4"
    },
    {
        "source_sentence": "廣一張手半者，當中人四張手，復有六指。",
        "translation": "The one-and-a-half hand is four hands wide, and there are six fingers in between.",
        "source": "T23n1443_016:0996c05_5"
    },
    {
        "source_sentence": "若不依此量而過作者，物應截去，罪應說悔，餘問答等並如上說。",
        "translation": "If someone doesn't rely on this measure but goes beyond the author, the object should be cut off, and the offense should be confessed. The rest of the questions and answers are as explained above.",
        "source": "T23n1443_016:0996c06_6"
    },
    {
        "source_sentence": "　覆瘡佛衣量、　　蒜剃洗手拍、",
        "translation": "He covered the sores with the size of the Buddha's robe, shaved his hands and clapped his feet with garlic.",
        "source": "T23n1443_016:0996c09_0"
    },
    {
        "source_sentence": "　自煮食水灑、　　生草棄牆外。",
        "translation": "He cooks his own food and water, sprinkles it with water, and throws growing grass outside the wall.",
        "source": "T23n1443_016:0996c09_0"
    },
    {
        "source_sentence": "第八攝頌曰：作覆瘡衣學處第七十一緣處同前。",
        "translation": "The eighth gathering verse says, 'The seventh and eleventh conditions for making sores-covering robes and training places are the same as the previous ones.'",
        "source": "T23n1443_016:0996c09_0"
    },
    {
        "source_sentence": "如世尊說：「作覆瘡衣。」",
        "translation": "As the Bhagavān said, Make a sores-covering robe.",
        "source": "T23n1443_016:0996c13_1"
    },
    {
        "source_sentence": "苾芻及尼不知當云何作？",
        "translation": "A monk or nun doesn't know how to do it?",
        "source": "T23n1443_016:0996c13_2"
    },
    {
        "source_sentence": "其量過大或時太小。",
        "translation": "It's too large or too small at times.",
        "source": "T23n1443_016:0996c14_3"
    },
    {
        "source_sentence": "乃至世尊「制其學處，應如是說：若復苾芻尼，作覆瘡衣當應量作。",
        "translation": "It's even the Bhagavān who instructed them to prescribe their place of training, saying, Suppose another monk or nun makes a sores-covering robe that should be made in moderation.",
        "source": "T23n1443_016:0996c14_4"
    },
    {
        "source_sentence": "是中量者，長佛四張手、廣二張手。",
        "translation": "This is the middle measure, which is four hands long and two hands wide as long as the Buddha's long hand.",
        "source": "T23n1443_016:0996c16_5"
    },
    {
        "source_sentence": "若過作者應截去，波逸底迦。」",
        "translation": "If someone goes beyond the author, they should be cut off, pratyekabuddha.",
        "source": "T23n1443_016:0996c17_0"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0996c18_0"
    },
    {
        "source_sentence": "覆瘡衣者，謂覆身瘡疥也。",
        "translation": "The sores-covering robe refers to the sores that cover the body.",
        "source": "T23n1443_016:0996c18_1"
    },
    {
        "source_sentence": "其佛張手及有過截，并說罪等，廣如上說。",
        "translation": "The Buddha opens his hand and has a faulty cut, explains the sins, and so forth, as explained above.",
        "source": "T23n1443_016:0996c18_2"
    },
    {
        "source_sentence": "同佛衣量作衣學處第七十二",
        "translation": "The seventy-second place of training for making robes the same as the Buddha's robe in terms of measurement",
        "source": "T23n1443_016:0996c20_0"
    },
    {
        "source_sentence": "緣處同前。",
        "translation": "The locus of cognition is the same as the previous one.",
        "source": "T23n1443_016:0996c21_0"
    },
    {
        "source_sentence": "時鄔波難陀與佛等量作衣，但披一邊、餘聚肩上。",
        "translation": "Upananda then made a robe equal in size to the Buddha's, but he wore it on one side and the rest of his shoulders.",
        "source": "T23n1443_016:0996c21_1"
    },
    {
        "source_sentence": "佛以此緣告諸苾芻：「我觀十利，為二部弟子制其學處，應如是說：「若復苾芻尼，同佛衣量作衣或復過者，波逸底迦。",
        "translation": "Because of this, the Buddha told the monks, I observe the ten benefits and regulate their training places for the sake of the two groups of disciples, so that they should thus say, 'Suppose another monk or nun makes a robe the same size as the Buddha's robe or goes beyond it, pratyekabuddha.",
        "source": "T23n1443_016:0996c22_2"
    },
    {
        "source_sentence": "是中佛衣量者，長佛十張手、廣六張手，此是佛衣量。」",
        "translation": "The measure of the Buddha's robe here is ten hands long and six hands wide, which are the measures of the Buddha's robe.",
        "source": "T23n1443_016:0996c25_3"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1443_016:0996c27_0"
    },
    {
        "source_sentence": "佛衣者，大師衣也。",
        "translation": "The Buddha's robe is the great teacher's robe.",
        "source": "T23n1443_016:0996c27_1"
    },
    {
        "source_sentence": "長佛十張手，當中人三十張手有十五肘。",
        "translation": "The long buddha's ten-pronged hand is fifteen feet long, and the thirty-pronged hand in between is fifteen feet long.",
        "source": "T23n1443_016:0996c27_2"
    },
    {
        "source_sentence": "廣六者，當十八張手有九肘，或復過此皆犯墮罪。",
        "translation": "The sixth is nine zhou in breadth, which should be eighteen hands wide, or more than that, and it's a sin to violate it.",
        "source": "T23n1443_016:0996c28_3"
    },
    {
        "source_sentence": "廣如上說。",
        "translation": "It's explained in detail as above.",
        "source": "T23n1443_016:0996c29_4"
    },
    {
        "source_sentence": "根本說一切有部苾芻尼毘奈耶卷第十六",
        "translation": "Mūlasarvâstivāda-vinaya, vol. 16",
        "source": "T23n1443_016:0997a01_0"
    }
]