[
    {
        "source_sentence": "根本說一切有部毘奈耶卷第四",
        "translation": "Mūlasarvâstivāda-vinaya, vol. 4",
        "source": "T23n1442_043:0860c08_0"
    },
    {
        "source_sentence": "十三",
        "translation": "thirteen",
        "source": "T23n1442_043:0860c09_0"
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yogâcārabhūmi in Sanskrit",
        "source": "T23n1442_043:0860c11_0"
    },
    {
        "source_sentence": "非時入聚落不囑苾芻學處第八十之餘爾時鄔陀夷既得果已便作是念：「世尊慈父於我實有大恩，",
        "translation": "At an ungodly hour, he enters a village and doesn't entrust the monk with the eighty-eighth place of training. After attaining the fruit, Udayana then had this thought, Bhagavān, my loving father, truly has great kindness for me,",
        "source": "T23n1442_043:0860c12_0"
    },
    {
        "source_sentence": "今作何事而能報德？",
        "translation": "What's the merit that can be rewarded by doing it now?",
        "source": "T23n1442_043:0860c14_1"
    },
    {
        "source_sentence": "除利有情餘無報者。」",
        "translation": "Except for those who benefit sentient beings, the rest are without reward.",
        "source": "T23n1442_043:0860c14_2"
    },
    {
        "source_sentence": "時鄔陀夷遂即隨緣而行教化。",
        "translation": "Udayana then followed the conditions and practiced teaching.",
        "source": "T23n1442_043:0860c15_3"
    },
    {
        "source_sentence": "爾時世尊告諸苾芻曰：「我諸弟子聲聞眾中，教化有情令得聖果者，鄔陀夷為第一。」",
        "translation": "It was then that the Bhagavān addressed the monks, Among the śrāvakas among my disciples who teach sentient beings to attain the noble fruit, Udayana is the first.",
        "source": "T23n1442_043:0860c16_0"
    },
    {
        "source_sentence": "　大天大髻珠，　　醫人僧眾腹；",
        "translation": "The great celestial jewel of the great topknot is on the chests of the healing monks and nuns.",
        "source": "T23n1442_043:0860c18_0"
    },
    {
        "source_sentence": "　梯受用兩倍，　　暴惡及童年；",
        "translation": "The enjoyment of a ladder is twofold: violence and childhood.",
        "source": "T23n1442_043:0860c18_0"
    },
    {
        "source_sentence": "　鉢及相撲人，　　是謂十三事；",
        "translation": "bowls and wrestlers, These are the thirteen things.",
        "source": "T23n1442_043:0860c18_0"
    },
    {
        "source_sentence": "　廣化十八億，　　咸令出苦津。",
        "translation": "He extensively transformed eighteen billion people And caused them all to leave the river of suffering.",
        "source": "T23n1442_043:0860c18_0"
    },
    {
        "source_sentence": "攝頌曰：大天者，時具壽鄔陀夷作如是念：「今諸有情誰繫屬我先受教化？」",
        "translation": "The gathering verse says, Great god, the long-lived Upāsikā then had this thought, Who among sentient beings are bound to me now that I've previously taught them?",
        "source": "T23n1442_043:0860c18_0"
    },
    {
        "source_sentence": "觀見一婆羅門承事大天堪任濟度。",
        "translation": "He observed that a Brāhmaṇa who served the great gods was capable of rescuing him.",
        "source": "T23n1442_043:0860c24_1"
    },
    {
        "source_sentence": "時鄔陀夷於日初分執持衣鉢，入室羅伐城次行乞食，見彼婆羅門備設供養。",
        "translation": "At the beginning of the day, Udayana took his robe and bowl in hand and entered Śrāvastī to solicit alms. He saw that brahman prepare an offering for him.",
        "source": "T23n1442_043:0860c25_2"
    },
    {
        "source_sentence": "覓婆羅門與其飲食，高聲唱言：「誰是婆羅門？",
        "translation": "Looking for a Brāhmaṇa to give him food and drink, he raised his voice and called out, Who's that Brāhmaṇa?",
        "source": "T23n1442_043:0860c27_3"
    },
    {
        "source_sentence": "我當與食。」",
        "translation": "I will give you food.",
        "source": "T23n1442_043:0860c28_4"
    },
    {
        "source_sentence": "鄔陀夷曰：「我是婆羅門，吾之大師是最上婆羅門。」",
        "translation": "Udayana said, I'm a brāhmaṇa, and my teacher is the highest brāhmaṇa.",
        "source": "T23n1442_043:0860c28_5"
    },
    {
        "source_sentence": "彼人報曰：「汝非婆羅門，是禿頭沙門。」",
        "translation": "The man replied, You're not a brāhmaṇa; you're a bald-headed ascetic.",
        "source": "T23n1442_043:0860c29_6"
    },
    {
        "source_sentence": "鄔陀夷曰：「我今共汝往問大天，我是婆羅門不？」",
        "translation": "Udayin said, Now, I'll go with you to the great god and ask him, Am I a Brāhmaṇa?",
        "source": "T23n1442_043:0861a01_7"
    },
    {
        "source_sentence": "二人共往至大天像所，鄔陀夷問曰：「我是婆羅門不？」",
        "translation": "The two men went together to the great celestial statue and Udayana asked, Is this a brāhmaṇa?",
        "source": "T23n1442_043:0861a02_8"
    },
    {
        "source_sentence": "時大天像出言告曰：「聖者鄔陀夷！",
        "translation": "The great celestial image then spoke out and told him, Sage Udayana!",
        "source": "T23n1442_043:0861a03_9"
    },
    {
        "source_sentence": "實是婆羅門，其師更是最勝大婆羅門。」",
        "translation": "He's really a brāhmaṇa, and his teacher is the most excellent great brāhmaṇa.",
        "source": "T23n1442_043:0861a04_10"
    },
    {
        "source_sentence": "彼見大天像語，便大驚怪歎未曾有，於佛教中深生敬信，即請鄔陀夷宅中供養。",
        "translation": "Seeing the words of the great celestial image, he was greatly surprised and marveled at this unprecedented occurrence. With deep respect and faith in Buddhism, he invited Udayana to his house to make offerings to it.",
        "source": "T23n1442_043:0861a05_11"
    },
    {
        "source_sentence": "飯食訖即為說法示教利喜，彼聞法已見真諦獲初果，歸依三寶受五學處，",
        "translation": "After he had finished his meal, he taught the Dharma and showed it to them. Having heard the Dharma, they saw the true truth and attained the first fruit of enlightenment. They relied on the Triple Gem and accepted the five paths of training.",
        "source": "T23n1442_043:0861a06_12"
    },
    {
        "source_sentence": "至盡形壽不殺生等，白言：「聖者！",
        "translation": "Up to the end of their physical life, they don't kill people and so forth, and they say, Sage!",
        "source": "T23n1442_043:0861a08_13"
    },
    {
        "source_sentence": "我願盡形壽，供給一切所須之物飲食衣服臥具醫藥，幸為納受。」",
        "translation": "I wish to spend my whole life providing all the things I need, food, drink, clothing, bedding, and medicine, and I'm fortunate enough to accept them.",
        "source": "T23n1442_043:0861a09_14"
    },
    {
        "source_sentence": "告曰：「我於餘人化緣未盡，不應受此。」",
        "translation": "He told them, I won't accept this because the conditions for transforming others haven't ended.",
        "source": "T23n1442_043:0861a10_15"
    },
    {
        "source_sentence": "說是語已從座而去。",
        "translation": "After he said these words, he departed from his seat.",
        "source": "T23n1442_043:0861a11_16"
    },
    {
        "source_sentence": "大髻者，時具壽鄔陀夷復於他日，觀諸有情誰堪受化。",
        "translation": "The great topknot is when the long-lived Udayana goes back to another day and observes which sentient beings are capable of undergoing transformation.",
        "source": "T23n1442_043:0861a13_0"
    },
    {
        "source_sentence": "見一婆羅門亦事大天不信三寶，知堪受化。",
        "translation": "Seeing a Brāhmaṇa who also served the great gods and didn't believe in the Three Treasures, he knew he was capable of being transformed.",
        "source": "T23n1442_043:0861a14_1"
    },
    {
        "source_sentence": "即於晨朝執持衣鉢入室羅伐城，見彼婆羅門同前設食，覓婆羅門情希供養。",
        "translation": "In the early morning, he took his robe and bowl into Śrāvastī and entered the city of Śrāvastī, saw that Brāhmaṇa offering food to him in the same way as before, and looked for a Brāhmaṇa who wanted to make offerings.",
        "source": "T23n1442_043:0861a15_2"
    },
    {
        "source_sentence": "唱言：「誰是婆羅門？",
        "translation": "They called out, Who's the Brāhmaṇa?",
        "source": "T23n1442_043:0861a17_0"
    },
    {
        "source_sentence": "我當與食。」",
        "translation": "I will give you food.",
        "source": "T23n1442_043:0861a17_1"
    },
    {
        "source_sentence": "鄔陀夷曰：「我是婆羅門，吾之大師是最上婆羅門。」",
        "translation": "Udayana said, I'm a brāhmaṇa, and my teacher is the highest brāhmaṇa.",
        "source": "T23n1442_043:0861a17_2"
    },
    {
        "source_sentence": "彼人報曰：「汝非婆羅門，是禿沙門。",
        "translation": "The man replied, You're not a brāhmaṇa; you're a baldie.",
        "source": "T23n1442_043:0861a18_3"
    },
    {
        "source_sentence": "若真婆羅門不作如是形相。」",
        "translation": "If a true brāhmaṇa doesn't create such forms and characteristics, then he won't do so.",
        "source": "T23n1442_043:0861a19_4"
    },
    {
        "source_sentence": "鄔陀夷曰：「婆羅門相其狀如何？」",
        "translation": "Udayana said, What's the characteristic of a brāhmaṇa?",
        "source": "T23n1442_043:0861a20_5"
    },
    {
        "source_sentence": "答曰：「婆羅門者其髻高大猶如冠帽。」",
        "translation": "He answered, A Brāhmaṇa's topknot is as tall as a crown cap.",
        "source": "T23n1442_043:0861a20_6"
    },
    {
        "source_sentence": "鄔陀夷曰：「若如是者我即其人。」",
        "translation": "Udayana said, If that's the case, I am that person.",
        "source": "T23n1442_043:0861a21_7"
    },
    {
        "source_sentence": "以手摩頂，大髻如冠忽然自現。",
        "translation": "When he touched his head with his hand, the great topknot like a crown suddenly appeared on its own.",
        "source": "T23n1442_043:0861a22_8"
    },
    {
        "source_sentence": "彼人見已深生信仰，發希有心請入受食。",
        "translation": "Seeing this, the man became deeply faithful and gave rise to a rare intention to invite him into the house to receive food.",
        "source": "T23n1442_043:0861a23_9"
    },
    {
        "source_sentence": "食已為其說法示教利喜，其婆羅門及婦俱獲初果。",
        "translation": "After he ate, he taught them the Dharma and showed them how to benefit and delight in it, and the Brāhmaṇa and his wife all obtained the first fruit.",
        "source": "T23n1442_043:0861a24_10"
    },
    {
        "source_sentence": "既得果已歸三寶受學處，奉四事至盡形。",
        "translation": "Having attained the fruit, he returned to the place where the Three Treasures had studied and consecrated himself in four ways up to the end of his life.",
        "source": "T23n1442_043:0861a25_11"
    },
    {
        "source_sentence": "尊者告曰：「我有化緣。」",
        "translation": "The venerable told him, I have the conditions for transforming myself.",
        "source": "T23n1442_043:0861a26_12"
    },
    {
        "source_sentence": "捨之而去。",
        "translation": "He abandoned it and departed.",
        "source": "T23n1442_043:0861a26_13"
    },
    {
        "source_sentence": "往買珠者，時具壽鄔陀夷復於他日，觀諸有情誰堪受化？",
        "translation": "When he went to buy the pearl, Kauṣṭhila Udayana again looked at the other day and observed which sentient beings were capable of undergoing transformation.",
        "source": "T23n1442_043:0861a27_0"
    },
    {
        "source_sentence": "見一婆羅門亦事大天不信三寶，知堪受化。",
        "translation": "Seeing a Brāhmaṇa who also served the great gods and didn't believe in the Three Treasures, he knew he was capable of being transformed.",
        "source": "T23n1442_043:0861a28_1"
    },
    {
        "source_sentence": "即於晨朝持衣鉢入城中，至婆羅門家門外而立。",
        "translation": "In the early morning, he took his robe and bowl into the city, went outside the door of the Brāhmaṇa's house, and stood there.",
        "source": "T23n1442_043:0861a29_2"
    },
    {
        "source_sentence": "知彼婦意欲得好珠，即便化身為賣珠者，入其舍內示彼好珠，光彩鮮明形狀可愛，",
        "translation": "Knowing that the woman’s wish was to obtain a beautiful gem, she transformed herself into a prostitute and went inside the house to show her the gem, which was shiny, colorful, brilliant, and attractive in shape.",
        "source": "T23n1442_043:0861b01_3"
    },
    {
        "source_sentence": "告言：「我賣此珠，汝若須者隨意當取。」",
        "translation": "He told them, I'll sell this pearl; if you need it, take it as you wish.",
        "source": "T23n1442_043:0861b03_4"
    },
    {
        "source_sentence": "時婆羅門問其價直，鄔陀夷曰：「隨汝所酬。」",
        "translation": "The Brāhmaṇa then asked him for his price, and Udayana said, As you'll pay it.",
        "source": "T23n1442_043:0861b04_5"
    },
    {
        "source_sentence": "彼少還價百分未一，鄔陀夷即取其價。",
        "translation": "The value of the small return was less than a hundredth part in value, and Udayana then took its value.",
        "source": "T23n1442_043:0861b05_6"
    },
    {
        "source_sentence": "時彼夫婦怪未曾有，私自歎曰：「何意貴珠而取賤價？」",
        "translation": "The couple wondered at this unprecedented thing and privately praised themselves, Why would you take a valuable pearl for a low price?",
        "source": "T23n1442_043:0861b06_7"
    },
    {
        "source_sentence": "鄔陀夷知其根熟便復本形，時彼夫婦倍深信敬，遂以上妙飲食供養。",
        "translation": "Knowing that his faculties were ripe, Udayana then returned to their original form, the couple became even more convinced and respectful, so they offered him the best food and drink.",
        "source": "T23n1442_043:0861b07_8"
    },
    {
        "source_sentence": "食已澡漱，為說施頌復演深法，夫婦聞已皆證初果歸依受戒，盡形供養廣說如前。",
        "translation": "After they had eaten, they washed and rinsed it for the sake of being taught the verse on generosity and further explained the profound teachings, and when the couple heard it, they all realized the first realization, relied on them to receive the precepts, made offerings in full form, and explained it in detail as before.",
        "source": "T23n1442_043:0861b08_9"
    },
    {
        "source_sentence": "時鄔陀夷捨之而去。",
        "translation": "Udayana then abandoned it and departed.",
        "source": "T23n1442_043:0861b10_10"
    },
    {
        "source_sentence": "醫人者，時室羅伐城有婆羅門，於三寶中心無信敬，身嬰疾苦綿歷多年，",
        "translation": "The physician: At that time there was a brahman in the city of Śrāvastī who did not have faith in the Triple Gem. His body became ill and suffered from pain for many years.",
        "source": "T23n1442_043:0861b12_0"
    },
    {
        "source_sentence": "所有醫人無不棄捨，云：「是惡病不可療治。」",
        "translation": "All the doctors there are won't abandon it, saying, This is a bad illness that can't be treated.",
        "source": "T23n1442_043:0861b13_1"
    },
    {
        "source_sentence": "時婆羅門更不求醫，端然待死。",
        "translation": "The Brāhmaṇa then didn't seek a doctor, but simply waited until he died.",
        "source": "T23n1442_043:0861b14_2"
    },
    {
        "source_sentence": "鄔陀夷觀彼機堪受化，持衣鉢入城中，到彼家立門外，化作醫人，報言：「我善醫療。」",
        "translation": "Observing their abilities, Udayana was able to undergo transformation, took his robe and bowl into the city, went to that house, stood outside the door, transformed himself into a doctor, and reported, I'm good at medicine.",
        "source": "T23n1442_043:0861b15_3"
    },
    {
        "source_sentence": "家人喚入，病者告曰：「我病多時諸醫皆棄，但知守死無可歸依。」",
        "translation": "The family members called in, and the sick man told them, Many times when I'm ill, the doctors abandon me, but they know that there's nothing to rely on for protection.",
        "source": "T23n1442_043:0861b17_4"
    },
    {
        "source_sentence": "化醫報曰：「汝不須憂，呪術良藥力不思議，須臾之間令得平復。」",
        "translation": "The transformation doctor replied, You don't need to worry, for the power of good spells and medicine is inconceivable, and it takes a moment to attain peace.",
        "source": "T23n1442_043:0861b18_5"
    },
    {
        "source_sentence": "病人聞已深生欣慶。",
        "translation": "After hearing this, the sick man was deeply delighted.",
        "source": "T23n1442_043:0861b19_6"
    },
    {
        "source_sentence": "鄔陀夷即為誦呪稱三寶名，彼婆羅門既聞呪已眾病皆除，平復如故。",
        "translation": "Udayana then recited the dhāraṇī and called it the name of the Three Treasures, and when that Brāhmaṇa heard the dhāraṇī, his illnesses were all removed, just as before.",
        "source": "T23n1442_043:0861b20_7"
    },
    {
        "source_sentence": "尊者見已還復本形，彼家夫婦倍生敬信歎未曾有，辦妙飲食請受供養。",
        "translation": "Seeing this, the venerable returned to his original form, and the husband and wife of that house became even more respectful and believed it was unprecedented, prepared a wonderful food and drink, and invited him to accept the offerings.",
        "source": "T23n1442_043:0861b22_0"
    },
    {
        "source_sentence": "食已說法俱證初果，為受歸戒廣說如前，乃至捨之而去。",
        "translation": "After he eats it, he teaches the Dharma and both realizes the first realization, explains it in detail as before for the sake of taking refuge in the precepts, and leaves them.",
        "source": "T23n1442_043:0861b23_1"
    },
    {
        "source_sentence": "僧眾者，時室羅伐城有一婆羅門，於三寶所不生信敬，大富多財，稟性慳悋無心捨施，",
        "translation": "At that time there was a brahman in the city of Śrāvastī who did not have faith in the Triple Gem. He was very wealthy and possessed many riches, but his nature was stingy and he gave alms without intention.",
        "source": "T23n1442_043:0861b24_2"
    },
    {
        "source_sentence": "樂多積聚。",
        "translation": "The pleasures are numerous and accumulated.",
        "source": "T23n1442_043:0861b26_3"
    },
    {
        "source_sentence": "時鄔陀夷知彼根熟，數往其舍頻從乞求，雖勞去來竟無所得。",
        "translation": "Knowing that his faculties were ripe, Udayana went to his house repeatedly and frequently begged for almsfood, but even though he worked hard, he didn't get anything.",
        "source": "T23n1442_043:0861b27_4"
    },
    {
        "source_sentence": "後於他日執持衣鉢，還入彼家空鉢而出，適到門首彼婆羅門從外而入，",
        "translation": "On another day, he took his robe and bowl in his hands, went back into that house, returned with an empty bowl at the door, and departed.",
        "source": "T23n1442_043:0861b28_5"
    },
    {
        "source_sentence": "問言：「苾芻！",
        "translation": "He asked, Monk!",
        "source": "T23n1442_043:0861c01_6"
    },
    {
        "source_sentence": "於我舍中有所得不？」",
        "translation": "Is there something to be gained in my dwelling?",
        "source": "T23n1442_043:0861c01_7"
    },
    {
        "source_sentence": "尊者見彼無信敬心密言告曰：「汝既自無將何見與？」",
        "translation": "Seeing them without faith or respect, the venerable man secretly told them, Since you yourself have nothing, what will you give them?",
        "source": "T23n1442_043:0861c01_8"
    },
    {
        "source_sentence": "彼聞瞋怒報言：「沙門！",
        "translation": "They heard the angry retribution, saying, As a monk!",
        "source": "T23n1442_043:0861c03_9"
    },
    {
        "source_sentence": "我有財食皆能周贍，汝之眷屬何意言無輒相輕賤？」",
        "translation": "I have both wealth and food that can be distributed, so what do your followers say they don't easily despise each other?",
        "source": "T23n1442_043:0861c03_10"
    },
    {
        "source_sentence": "答曰：「若如是者明日我來就汝受食。」",
        "translation": "He replied, If that's the case, I'll come tomorrow to accept food for you.",
        "source": "T23n1442_043:0861c04_11"
    },
    {
        "source_sentence": "婆羅門曰：「斯誠善事。」",
        "translation": "The Brāhmaṇa said, This is a sincere good thing.",
        "source": "T23n1442_043:0861c05_12"
    },
    {
        "source_sentence": "時鄔陀夷更詣餘家，乞得食已還至本處，食訖禮佛白言：「世尊！",
        "translation": "Udayana then went to another house, begged for food, returned to his original place, and after he had eaten, bowed to the Buddha and said, Bhagavān!",
        "source": "T23n1442_043:0861c05_13"
    },
    {
        "source_sentence": "有婆羅門不信三寶，稟性慳悋積聚為務，無捨施心。",
        "translation": "A Brāhmaṇa who doesn't believe in the Three Treasures is naturally stingy and greedy, accumulates as a servant, and doesn't abandon his mind of generosity.",
        "source": "T23n1442_043:0861c07_14"
    },
    {
        "source_sentence": "今日忽然言請於我佛及僧眾明朝來食。」",
        "translation": "Today, they suddenly say they're inviting me, the Buddha, and the saṃgha to eat with them tomorrow morning.",
        "source": "T23n1442_043:0861c08_15"
    },
    {
        "source_sentence": "佛默然受。",
        "translation": "The Buddha accepted it in silence.",
        "source": "T23n1442_043:0861c09_16"
    },
    {
        "source_sentence": "彼婆羅門既至明日，於其舍內初無營辦。",
        "translation": "When the brāhmaṇa arrived on the morning, he didn't prepare anything inside his dwelling.",
        "source": "T23n1442_043:0861c09_17"
    },
    {
        "source_sentence": "時給孤獨及餘長者，聞請佛僧皆往彼宅，見無備辦，告婆羅門曰：「汝請鄔陀夷并其眷屬，",
        "translation": "When Anāthapiṇḍika and the other elders heard that the Buddha and the saṃgha were invited, they all went to their houses. Seeing that nothing was prepared, they told the brahman, “Invited by you, Udayana and his retinue:",
        "source": "T23n1442_043:0861c10_18"
    },
    {
        "source_sentence": "即是佛及僧眾來汝宅中受一時食。",
        "translation": "That's when the Buddha and the saṃgha came to your house to receive a meal at one time.",
        "source": "T23n1442_043:0861c12_19"
    },
    {
        "source_sentence": "汝今何故無營辦耶？」",
        "translation": "Why aren't you doing it now?",
        "source": "T23n1442_043:0861c13_20"
    },
    {
        "source_sentence": "答言：「我不與食。」",
        "translation": "He replied, I won't give you food.",
        "source": "T23n1442_043:0861c13_21"
    },
    {
        "source_sentence": "諸人告曰：「若於今日佛及僧眾來汝家中，不施食者，勝光大王必見治罰不相容捨。」",
        "translation": "The people told him, If the Buddha and the saṃgha come to your house today and don't give food, great king Vaiśravaṇa will surely see that they'll be punished and won't allow each other to abandon it.",
        "source": "T23n1442_043:0861c14_22"
    },
    {
        "source_sentence": "時婆羅門聞已大懼，復緣宿世善根現前開發，遂多出物備辦上供擬施佛僧。",
        "translation": "After hearing this, the Brāhmaṇa was greatly frightened, and again because of the good roots from his past lives that had been cultivated in the present, he produced a large amount of property to prepare an offering for the Buddha and Saṃgha.",
        "source": "T23n1442_043:0861c16_23"
    },
    {
        "source_sentence": "爾時世尊於日初分，大眾圍繞往到彼宅，就所敷座安詳而坐。",
        "translation": "At the beginning of the day, the Bhagavān, surrounded by the crowd, went to his house and sat quietly on the seat that was spread out for him.",
        "source": "T23n1442_043:0861c17_24"
    },
    {
        "source_sentence": "時婆羅門親自奉獻上妙飲食，佛僧食已澡漱訖，從座而去。",
        "translation": "The Brāhmaṇa then personally offered the most wonderful food and drink, and after the Buddha and Saṃgha had eaten it, they rinsed it up and departed from their seats.",
        "source": "T23n1442_043:0861c19_25"
    },
    {
        "source_sentence": "時鄔陀夷獨留而坐，為彼夫婦演說妙法，即於座上俱得見諦，歸依三寶受五學處，",
        "translation": "Udayana then sat alone, expounding the sublime Dharma for the sake of those couples. On that seat they all attained insight and relied on the Triple Gem to receive their five higher trainings.",
        "source": "T23n1442_043:0861c20_26"
    },
    {
        "source_sentence": "廣說如前。",
        "translation": "It's explained in detail as before.",
        "source": "T23n1442_043:0861c22_27"
    },
    {
        "source_sentence": "腹者，室羅伐城有婆羅門，亦於三寶無敬信心，其婦端正罕有儔匹。",
        "translation": "In the city of Śrāvastī, there's a Brāhmaṇa who also doesn't respect and believe in the Three Treasures, and his wife is so handsome that there's rarely anyone like her.",
        "source": "T23n1442_043:0861c23_0"
    },
    {
        "source_sentence": "其人於婦極生愛念，曾不許人輒入其宅。",
        "translation": "That man had great affection for the woman and never allowed anyone to enter her house.",
        "source": "T23n1442_043:0861c24_1"
    },
    {
        "source_sentence": "時鄔陀夷同前觀察堪受化者，見彼夫婦解脫時至，執持衣鉢次第乞食。",
        "translation": "Udayana then shared the previous observation of those who were capable of being transformed, saw that husband and wife at the time of their liberation, took their robes and bowls, and begged for food in order.",
        "source": "T23n1442_043:0861c25_2"
    },
    {
        "source_sentence": "到彼門前欲入其舍，時婆羅門見而不許，遂去小便。",
        "translation": "When he arrived in front of that door and wanted to enter his dwelling, the Brāhmaṇa didn't allow him to do so, so he went to urinate.",
        "source": "T23n1442_043:0861c27_3"
    },
    {
        "source_sentence": "時鄔陀夷令彼小便出不停息，即入其舍面見其婦，其婦慢心不相瞻視，",
        "translation": "Udayana then caused her to urinate without stopping, and he went inside the house to see her face. The woman was too conceited to look at him.",
        "source": "T23n1442_043:0861c28_4"
    },
    {
        "source_sentence": "鄔陀夷化其婦腸令出腹外。",
        "translation": "Udayana transformed his wife's intestines and caused her to go outside the abdomen.",
        "source": "T23n1442_043:0861c29_5"
    },
    {
        "source_sentence": "時婆羅門來見驚怖生厭惡心，遂禮尊者請求懺謝。",
        "translation": "Seeing this, the Brāhmaṇa was frightened and became disgusted, so he bowed to the Venerable and begged him to repent.",
        "source": "T23n1442_043:0862a01_6"
    },
    {
        "source_sentence": "鄔陀夷即攝神變，令彼婦身平復如故，夫婦二人歎未曾有。",
        "translation": "Udayana then gathered the miraculous transformation and caused the woman's body to be restored to its original form, and the couple praised it as unprecedented.",
        "source": "T23n1442_043:0862a02_7"
    },
    {
        "source_sentence": "鄔陀夷因為說法，言身不淨無可保愛，夫婦聞法俱證初果，廣說如前。",
        "translation": "Udayana then taught the Dharma, saying that his body was impure and unworthy of being loved, and both husband and wife heard the teaching and realized the first realization, as explained in detail earlier.",
        "source": "T23n1442_043:0862a04_8"
    },
    {
        "source_sentence": "昇梯者，室羅伐城有婆羅門，其婦端正，婦心不信敬。",
        "translation": "He ascended the ladder because there was a Brāhmaṇa in Śrāvastī, whose wife was so beautiful that she didn't believe in respect.",
        "source": "T23n1442_043:0862a06_0"
    },
    {
        "source_sentence": "鄔陀夷念誰當受教？",
        "translation": "Udayana thought, Who will receive the teaching?",
        "source": "T23n1442_043:0862a07_1"
    },
    {
        "source_sentence": "觀彼夫婦宿世善根，繫屬於我機緣堪化，便持衣鉢往到彼家。",
        "translation": "Observing that the couple's good roots of past lives belong to me, and their abilities are capable of being transformed, they take their robes and bowls and go to their house.",
        "source": "T23n1442_043:0862a07_2"
    },
    {
        "source_sentence": "時婆羅門有事先出，尊者即入其舍。",
        "translation": "The Brāhmaṇa then had a prior departure, and the venerable entered his house.",
        "source": "T23n1442_043:0862a09_3"
    },
    {
        "source_sentence": "彼婦遙見避之入室，尊者隨入。",
        "translation": "Seeing him from a distance, the woman avoided him and entered the room. The venerable one followed him into her room.",
        "source": "T23n1442_043:0862a09_4"
    },
    {
        "source_sentence": "婦遂昇梯而上高閣，尊者亦上。",
        "translation": "The woman then ascended the ladder and went up to the high pavilion, where the venerable was also.",
        "source": "T23n1442_043:0862a10_5"
    },
    {
        "source_sentence": "其婦即便推梯令竪，是時尊者因墮于地入滅盡定。",
        "translation": "The woman pushed the ladder and made it fall down, and then the venerable fell to the ground and entered the concentration of total extinction.",
        "source": "T23n1442_043:0862a11_6"
    },
    {
        "source_sentence": "時婦遙觀無有喘息，謂之已死。",
        "translation": "The woman then looked from a distance without panting and said she had died.",
        "source": "T23n1442_043:0862a12_7"
    },
    {
        "source_sentence": "正梯而下以手擎持，雖盡氣力竟不能動，便命家人共來擎舉亦不移動。",
        "translation": "He went down the straight ladder and held it in his hand, but even though he exhausted his energy, he couldn't move it, so he ordered his family to join him in holding it up without moving it.",
        "source": "T23n1442_043:0862a13_8"
    },
    {
        "source_sentence": "時婆羅門從外而來，驚怪其事略問知已，即自扶持亦不能舉，其家惶怖設計無由。",
        "translation": "The Brāhmaṇa then came from the outside and wondered about this matter. Having asked briefly, he supported himself but could not lift it up; his family was frightened and thought that there was no way to do so.",
        "source": "T23n1442_043:0862a14_9"
    },
    {
        "source_sentence": "時有婆羅門鄔波索迦，是其知識，從外而至。",
        "translation": "At the time, there was a Brāhmaṇa Upāsaka, who was his friend and came from the outside.",
        "source": "T23n1442_043:0862a16_10"
    },
    {
        "source_sentence": "見是尊者鄔陀夷，告主人曰：「此非已死，是入勝定，為相濟拔來至汝家，",
        "translation": "Seeing this, Venerable Udayana said to his host, “This is not someone who has already died.",
        "source": "T23n1442_043:0862a17_11"
    },
    {
        "source_sentence": "故現化耳。",
        "translation": "That's why they're being transformed.",
        "source": "T23n1442_043:0862a19_12"
    },
    {
        "source_sentence": "宜可慇懃求哀懺謝。」",
        "translation": "It's better to beg for pity and repentance.",
        "source": "T23n1442_043:0862a19_13"
    },
    {
        "source_sentence": "時婆羅門執足頂禮求哀懺悔，尊者出定因為說法，便獲初果，廣說如前。",
        "translation": "The Brāhmaṇa then lifted his feet, bowed his head, and begged for pity and repentance, and the venerable one came out of concentration to preach so that he would attain the first realization, which was explained in detail as before.",
        "source": "T23n1442_043:0862a20_14"
    },
    {
        "source_sentence": "受用者，室羅伐城有婆羅門，娶族望女以為妻室，儀容挺特好自誇談。",
        "translation": "In the city of Śrāvastī, there was a Brāhmaṇa who married a woman from his clan to become his wife and had a distinctive appearance that made him proud.",
        "source": "T23n1442_043:0862a22_0"
    },
    {
        "source_sentence": "時鄔陀夷觀知此婦根機時熟堪任受化，執持衣鉢隨緣入城至其宅內。",
        "translation": "Knowing that the woman's faculties were ripe, Udayana then took her robe and bowl into the city and went inside her house as she wished.",
        "source": "T23n1442_043:0862a23_1"
    },
    {
        "source_sentence": "時婆羅門有緣已出，其婦傲慢雖見苾芻一無所施，亦不共語。",
        "translation": "The Brāhmaṇa then had a reason to leave, and even though his wife was arrogant and saw that the monk had nothing to give, she didn't speak together.",
        "source": "T23n1442_043:0862a25_2"
    },
    {
        "source_sentence": "「汝今受用昔時業，　　現在無心行捨施；",
        "translation": "“Now you have received and enjoyed past actions, but now you do not mindfully give.",
        "source": "T23n1442_043:0862a26_3"
    },
    {
        "source_sentence": "　曾見美女淚霑襟，　　不久還當自啼泣。」",
        "translation": "I once saw a beautiful woman with tears falling down her chest, and soon she'll return to weep.",
        "source": "T23n1442_043:0862a26_3"
    },
    {
        "source_sentence": "尊者順彼機緣宿世之事，說伽他曰：為說頌已出門而去。",
        "translation": "Venerable, in accordance with the circumstances of those past lives, the Bhagavān explained the verse to the kṣatriyas, saying, After speaking this verse, he left and departed.",
        "source": "T23n1442_043:0862a26_3"
    },
    {
        "source_sentence": "于時彼婦不閑句義，便作是念：「此之沙門罵詈於我。」",
        "translation": "The woman then had no leisurely words and thought, This ascetic scolds me.",
        "source": "T23n1442_043:0862b01_4"
    },
    {
        "source_sentence": "心懷瞋惱，婆羅門還見問曰：「有何苦耶？」",
        "translation": "With anger in his mind, the Brāhmaṇa returned to see him and asked, What's so painful?",
        "source": "T23n1442_043:0862b02_5"
    },
    {
        "source_sentence": "婦曰：「向有沙門來罵辱我，彼若活者我命不全。」",
        "translation": "The woman said, There's an ascetic who came to abuse me, and if he lives, my life won't be complete.",
        "source": "T23n1442_043:0862b03_6"
    },
    {
        "source_sentence": "其夫聞已怒目叱吒，手援利劍逐彼苾芻欲斷其命。",
        "translation": "After hearing this, the husband angrily scolded him with his eyes and raised a sharp sword in his hand to chase that monk away in order to cut off his life.",
        "source": "T23n1442_043:0862b04_7"
    },
    {
        "source_sentence": "時鄔陀夷遙見彼來，化為小室閉戶而坐，其婆羅門喚令開戶，尊者告曰：「汝可棄劍我當為開。」",
        "translation": "Udayana then saw him from a distance and transformed himself into a small room, closed the door, and sat down. The Brāhmaṇa summoned him to open the door, and the venerable told him, You can abandon your sword; I will open it for you.",
        "source": "T23n1442_043:0862b05_8"
    },
    {
        "source_sentence": "婆羅門即作是念：「但得相及拳打令死。」",
        "translation": "The Brāhmaṇa then had this thought, They'll only get their marks and fist and be beaten to death.",
        "source": "T23n1442_043:0862b07_9"
    },
    {
        "source_sentence": "便放其劍，以極瞋心急喚開戶。",
        "translation": "He then released his sword and called out with extreme anger to open the door.",
        "source": "T23n1442_043:0862b08_10"
    },
    {
        "source_sentence": "尊者報曰：「捨此瞋怒暴惡之意當為汝開。」",
        "translation": "The venerable replied, Give up this angry and violent intention to open it for you.",
        "source": "T23n1442_043:0862b09_11"
    },
    {
        "source_sentence": "聞已竊念：「此是聖人知我惡意。」",
        "translation": "After hearing this, he thought secretly, This is the noble person who knows my bad intentions.",
        "source": "T23n1442_043:0862b10_12"
    },
    {
        "source_sentence": "便自悔責捨除害心，即為開戶。",
        "translation": "He then repented and abandoned his harmful thoughts, which is to open the door for him.",
        "source": "T23n1442_043:0862b11_13"
    },
    {
        "source_sentence": "其人入已為說妙法，便獲初果受三歸五戒，告言：「我於汝婦無惡罵詈，",
        "translation": "Having entered, he taught the wonderful Dharma to them. They then attained the first realization and received the three refuges and five precepts. He told them, “I will not abuse your wife.",
        "source": "T23n1442_043:0862b11_14"
    },
    {
        "source_sentence": "為說伽他令思往事，彼愚不解更起瞋心。",
        "translation": "He teaches the kṣatriya to think of past events, and that foolish man doesn't understand them and becomes angry again.",
        "source": "T23n1442_043:0862b13_15"
    },
    {
        "source_sentence": "今可諦聽！",
        "translation": "Now, listen closely!",
        "source": "T23n1442_043:0862b14_16"
    },
    {
        "source_sentence": "當為汝說。",
        "translation": "I will explain it for you.",
        "source": "T23n1442_043:0862b14_17"
    },
    {
        "source_sentence": "乃往昔時有一貧女，見他美女綺飾莊嚴，僕從自隨眾人愛敬。",
        "translation": "Once in the past, there was a poor woman who saw other beautiful women of great beauty and adornment, and her servants followed her along with their love and respect.",
        "source": "T23n1442_043:0862b14_18"
    },
    {
        "source_sentence": "貧女懊惱啼泣作如是念：『我今以何方便可得如是隨意事耶？』",
        "translation": "The poor woman was distressed and cried out, thinking, 'What method can I use now to get such a thing as that?'",
        "source": "T23n1442_043:0862b16_19"
    },
    {
        "source_sentence": "時有鄔波斯迦，是其知友，告曰：『汝何憂苦？』",
        "translation": "Upāsaka then had a friend who knew him and told him, 'What's the grief and suffering of you?'",
        "source": "T23n1442_043:0862b17_20"
    },
    {
        "source_sentence": "女以事白，答曰：『憂惱無益，他之果報從因所生。』",
        "translation": "The woman told him about this, and he answered, 'Suffering is useless; the results of others arise from causes.'",
        "source": "T23n1442_043:0862b18_21"
    },
    {
        "source_sentence": "貧女問曰：『其因者何？』",
        "translation": "The poor woman asked, 'What's the cause?'",
        "source": "T23n1442_043:0862b19_22"
    },
    {
        "source_sentence": "答曰：『於勝福田施以飲食，至誠發願必獲其果。』",
        "translation": "He answered, 'The fruit of giving food and drink to the superior field of merit will surely be obtained if you sincerely make a vow.'",
        "source": "T23n1442_043:0862b20_23"
    },
    {
        "source_sentence": "時有獨覺聖人來從乞食，女持食施，心有所希。",
        "translation": "At the time, there was a solitary realizer sage who came from begging for food, and the woman gave her food to him because she wanted it.",
        "source": "T23n1442_043:0862b21_24"
    },
    {
        "source_sentence": "時彼獨覺為現神變，貧女生信即發願言：『願我以此供養善根，所生之處莫遭貧苦。",
        "translation": "The solitary realizer then manifested a miraculous transformation, and the poor woman believed it and made a vow, saying, 'May I make offerings to these good roots so that they won't suffer from poverty where they were born.",
        "source": "T23n1442_043:0862b22_25"
    },
    {
        "source_sentence": "若得人身端正姝妙見者歡喜，受用無闕。』",
        "translation": "If someone attains a person's body that's handsome and beautiful, they'll rejoice and experience it without fail.'",
        "source": "T23n1442_043:0862b24_26"
    },
    {
        "source_sentence": "汝婦由先施業發願力故，獲端正報受用豐足，生勝族中人所愛重。",
        "translation": "Because of the power of your previous vow to give alms, your wife attained good looks and received abundant nourishment, and she was born in a superior family that's loved by people.",
        "source": "T23n1442_043:0862b25_0"
    },
    {
        "source_sentence": "今乃不信當何得耶？」",
        "translation": "How will it be attained if you don't believe in it now?",
        "source": "T23n1442_043:0862b26_1"
    },
    {
        "source_sentence": "時婆羅門既獲勝果，復聞宿世因緣之事，便請尊者還其本居，為設種種上妙飲食。",
        "translation": "When the Brāhmaṇa had attained a superior result, he also heard about the causes and conditions of past lives, so he asked the venerable to return to his original home and offer various kinds of delicious food and drink.",
        "source": "T23n1442_043:0862b27_0"
    },
    {
        "source_sentence": "食已為說法要，婦聞法已亦證初果，求受三歸五戒，廣說如前。",
        "translation": "After she had eaten it, he taught the essentials of the Dharma for her, and after she heard the teaching, the woman also realized the first fruit and asked to receive the three refuges and five precepts, as explained in detail earlier.",
        "source": "T23n1442_043:0862b28_1"
    },
    {
        "source_sentence": "兩倍者，室羅伐城有婆羅門，其家巨富情懷慳悋，有事他行，即便支計妻食之分，",
        "translation": "In the city of Śrāvastī there was a brāhmaṇa whose family was very wealthy and his mind was stingy. When he engaged in activities for others, he even accounted for the portion of his wife’s food [to be provided for her].",
        "source": "T23n1442_043:0862c02_0"
    },
    {
        "source_sentence": "餘有庫藏泥封而去。",
        "translation": "The rest of the storehouse is sealed in mud and removed.",
        "source": "T23n1442_043:0862c03_1"
    },
    {
        "source_sentence": "時鄔陀夷知婦堪化，入其舍從乞食，婦持己食一升米飯以施苾芻，迴視器中食還如舊。",
        "translation": "Knowing that the woman was capable of transforming herself, Udayana entered her house to beg for food. The woman took a sheng of rice and gave it to the bhikṣu as food, looked inside the pot, and returned to eating as before.",
        "source": "T23n1442_043:0862c04_2"
    },
    {
        "source_sentence": "時鄔陀夷復於明日更將一伴來至其舍，婦人見已二俱請食，還同昨日飯器無減。",
        "translation": "On the next day, Udayin again brought another companion to his house, and when the two women saw him, they both invited food, which was the same as the yesterday's rice container.",
        "source": "T23n1442_043:0862c06_3"
    },
    {
        "source_sentence": "明將四人，如是倍增至六十四人來，皆施食一升米飯，不減如常。",
        "translation": "It's clear that the four people will thus double to sixty-four people, and they'll all give food for a sheng of rice and rice without diminishing as usual.",
        "source": "T23n1442_043:0862c08_4"
    },
    {
        "source_sentence": "此六十四人日日來食，餘人見之心生嫉妬，夫至告曰：「汝婦在家多為費損，",
        "translation": "When these sixty-four people came to eat every day, the others became jealous of them. The husband said, “Your wife is paying a great deal of expense at home.",
        "source": "T23n1442_043:0862c09_5"
    },
    {
        "source_sentence": "常於日日食設百人，看此所為汝家當破。」",
        "translation": "He always sets up a hundred people to eat every day, and he'll see this as your home that will be destroyed.",
        "source": "T23n1442_043:0862c11_6"
    },
    {
        "source_sentence": "時婆羅門聞斯語已，還至家中呵責其婦：「何故我暫不在廣為破費？」",
        "translation": "After hearing these words, the Brāhmaṇa returned home and reprimanded his wife, Why am I not staying here for a while to break my money?",
        "source": "T23n1442_043:0862c12_7"
    },
    {
        "source_sentence": "婦便告曰：「仁不須瞋，所留我分持以供僧，於餘庫物一無虧損。」",
        "translation": "The woman then told him, Sir, don't be angry; let me keep the portion of what you leave to offer to the saṃgha, and there won't be any loss in the rest of your storehouse.",
        "source": "T23n1442_043:0862c13_8"
    },
    {
        "source_sentence": "其夫聞已深怪所言，心欲試之驗其虛實。",
        "translation": "After hearing this, the man was deeply surprised by what he said and wanted to test it with his mind in order to see if it was true.",
        "source": "T23n1442_043:0862c15_9"
    },
    {
        "source_sentence": "時鄔陀夷欲至食時，還將爾許苾芻來入，同前食訖飯器仍滿。",
        "translation": "When he was about to eat, Udayana returned with a certain number of monks and entered, the same as when he had finished his previous meal and filled the rice container.",
        "source": "T23n1442_043:0862c16_10"
    },
    {
        "source_sentence": "婆羅門見已倍生希有深發信心，即請眾僧廣設供養。",
        "translation": "Seeing this, the Brāhmaṇa doubled his rare and deeply aroused faith and invited the saṃgha to make extensive offerings.",
        "source": "T23n1442_043:0862c17_11"
    },
    {
        "source_sentence": "食已說法，于時夫婦俱見真諦，為受歸戒，捨之而去。",
        "translation": "After they had eaten the food, he taught the Dharma, and then both husband and wife saw the true truth, accepted the precepts for refuge, abandoned them, and departed.",
        "source": "T23n1442_043:0862c18_12"
    },
    {
        "source_sentence": "暴惡者，室羅伐城有婆羅門，婦性暴惡。",
        "translation": "violent: In the city of Śrāvastī, there's a Brāhmaṇa whose wife is violent by nature.",
        "source": "T23n1442_043:0862c21_0"
    },
    {
        "source_sentence": "至節會日，其婆羅門作如是念：「今日定有諸親識來，對彼親賓婦若罵詈深為醜惡。」",
        "translation": "On the day of the feast, the Brāhmaṇa had this thought, Today, there must be relatives and friends who come to confront those relatives and guests' wives with a verbal abuse that's deeply ugly.",
        "source": "T23n1442_043:0862c21_1"
    },
    {
        "source_sentence": "作是念已便擕稚子避向餘村。",
        "translation": "After he had this thought, he then fled to another village.",
        "source": "T23n1442_043:0862c23_2"
    },
    {
        "source_sentence": "鄔陀夷觀知彼婦化緣時至，持衣鉢到彼家，見彼婦人料理飲食。",
        "translation": "Knowing the time for that woman's transformation, Udayana went to her house with his robe and bowl and saw the woman prepare food and drink.",
        "source": "T23n1442_043:0862c24_3"
    },
    {
        "source_sentence": "尊者去之不遠而住，婦人告曰：「爾欲覓食，假令努眼大若鉢盂，食終難得。」",
        "translation": "The Venerable didn't go far from them and stayed there, and the woman told him, If you want to search for food, suppose you allow nourishment to be as large as a bowl or bowl; it's really difficult to find food.",
        "source": "T23n1442_043:0862c26_0"
    },
    {
        "source_sentence": "是時尊者即開兩眼大若鉢盂，婦人又曰：「設使汝身分為兩叚，我亦不與。」",
        "translation": "The venerable then opened the bowl with both eyes as large as a bowl, and the woman said, Suppose you were to make two gifts of your identity, and I wouldn't give it to you.",
        "source": "T23n1442_043:0862c27_1"
    },
    {
        "source_sentence": "尊者化身即為兩叚。",
        "translation": "The Bhagavān's transformation body is the two kinds of anger.",
        "source": "T23n1442_043:0862c29_2"
    },
    {
        "source_sentence": "于時婢使告婦人曰：「若殺苾芻犯國刑法，當為官婢役使終身。」",
        "translation": "The maidservants then told the woman, If you kill a monk who violates the country's punishment law, you'll be an official maidservant for the rest of your life.",
        "source": "T23n1442_043:0862c29_3"
    },
    {
        "source_sentence": "其婦驚怖欲持死屍棄深坑內，尊者入滅盡定不能移動，即便執足懇到懺謝，",
        "translation": "The woman was frightened and wished to throw the corpse into a deep pit. But the venerable monk entered the absorption of extinction and could not move his body. So he took her feet and went in earnestly to confession.",
        "source": "T23n1442_043:0863a02_4"
    },
    {
        "source_sentence": "願復本形，餅食任取。",
        "translation": "I wish to return to my original form and take the cakes and food at will.",
        "source": "T23n1442_043:0863a03_5"
    },
    {
        "source_sentence": "尊者即起從其索餅。",
        "translation": "The venerable then got up and gave him the cake he asked for.",
        "source": "T23n1442_043:0863a04_6"
    },
    {
        "source_sentence": "婦人欲覓惡者施與，觀察籠中悉皆是好，隨將一箇持與苾芻，諸餅皆出，",
        "translation": "The woman wished to find the evil one and gave it to him, observing that all the cakes in the cage were good.",
        "source": "T23n1442_043:0863a04_7"
    },
    {
        "source_sentence": "問尊者曰：「豈總將耶？」",
        "translation": "He asked the venerable, Is it general?",
        "source": "T23n1442_043:0863a06_8"
    },
    {
        "source_sentence": "報曰：「我同梵行乃有多人，汝自往行斯為大善。」",
        "translation": "He replied, There are many people who practice the same religious practice as me, so it's a great good idea for you to go and practice it yourself.",
        "source": "T23n1442_043:0863a07_9"
    },
    {
        "source_sentence": "婦人持餅往給孤獨長者家，見佛僧眾儼然而坐，婦人持餅人各與一餅仍不盡。",
        "translation": "The woman took the cake and went to the house of an orphaned elderly man, saw the Buddha and the saṃgha sitting quietly, and the woman gave each one piece of cake to him, but it wasn't enough.",
        "source": "T23n1442_043:0863a08_10"
    },
    {
        "source_sentence": "婦人見已歎未曾有深生敬信，因為說法便獲初果，還至宅中見餅如舊。",
        "translation": "Seeing this, the woman marveled at what she had never done before and became deeply jealous of it. As she preached the Dharma she obtained the first fruit but returned home and found the cakes as before.",
        "source": "T23n1442_043:0863a10_0"
    },
    {
        "source_sentence": "婆羅門知節會日過，與子俱來，見婦容儀詳審沈默，觀其所作有異常時，",
        "translation": "The brāhmaṇa, knowing that the feast was coming on a wrong day, came with his children. Seeing the queen’s manner, he paid close attention to her and remained silent. He observed that she was acting at an unusual time.",
        "source": "T23n1442_043:0863a11_1"
    },
    {
        "source_sentence": "「汝先志猖狂，　　何因今意別？",
        "translation": "You were previously crazy about your intentions, so why are you now thinking differently?",
        "source": "T23n1442_043:0863a13_2"
    },
    {
        "source_sentence": "　我觀爾所作，　　與昔事不同。」",
        "translation": "I'll observe what you did, which is different from the things of the past.",
        "source": "T23n1442_043:0863a13_2"
    },
    {
        "source_sentence": "「我昔不是狂，　　今非有別意；",
        "translation": "“In the past I was not crazy, but now I do not think differently.",
        "source": "T23n1442_043:0863a13_2"
    },
    {
        "source_sentence": "　但由世尊教，　　見諦預真流。」",
        "translation": "It's simply because of the Bhagavān's teaching that they see the truth and anticipate the true flow.",
        "source": "T23n1442_043:0863a13_2"
    },
    {
        "source_sentence": "說伽他曰：其婦答曰：其婦即以上事具白。",
        "translation": "He said to Kālāma, The woman answered, That woman told him about the above.",
        "source": "T23n1442_043:0863a13_2"
    },
    {
        "source_sentence": "其夫婆羅門聞已，歎未曾有倍深敬信，遂往逝多林，請鄔陀夷及佛僧眾明當就食。",
        "translation": "Having heard this, the brāhmaṇa exclaimed that he had never before experienced such great reverence and deep faith. So he went to Jeta’s Grove and invited Udayana and the Buddha and other members of the sangha to take their meal at once.",
        "source": "T23n1442_043:0863a19_3"
    },
    {
        "source_sentence": "鄔陀夷受已為白佛僧，如常廣說，乃至佛僧食已還歸住處。",
        "translation": "Udayana accepted it and reported it to the Buddha and Saṃgha, as always explained in detail, up to the point where the Buddha and Saṃgha returned to their abode after they had eaten.",
        "source": "T23n1442_043:0863a21_4"
    },
    {
        "source_sentence": "時鄔陀夷獨留其舍為說法要，令證道果得見真諦。",
        "translation": "Udayana then stayed alone in his house to preach the essentials of the Dharma for him, so that he would realize the fruit of the path and see the true truth.",
        "source": "T23n1442_043:0863a22_5"
    },
    {
        "source_sentence": "是時夫婦乃至盡形延請供養，尊者不受，其婦白言：「我設一座，唯願尊者餘處乞食就此而食。」",
        "translation": "The couple then invited the honored one to make offerings in full form, but the honored one didn't accept them, and the woman said, I'll set up a pavilion, just ask the honored one to beg for food elsewhere and eat here.",
        "source": "T23n1442_043:0863a23_6"
    },
    {
        "source_sentence": "尊者哀愍為受而去。",
        "translation": "The venerable monk pitied them and departed for their sake.",
        "source": "T23n1442_043:0863a26_0"
    },
    {
        "source_sentence": "童年者，室羅伐城有五百婆羅門子，至節會日各持飲食，詣園林中欲為聚集。",
        "translation": "When he was a child, there were five hundred Brāhmaṇa children in the city of Śrāvastī who each brought food and drink to the park every day at the monastery on their way to gather together.",
        "source": "T23n1442_043:0863a27_0"
    },
    {
        "source_sentence": "時鄔陀夷便作是念：「今復何人堪應受化？」",
        "translation": "Udayana then had this thought, Now, what person is capable of being transformed?",
        "source": "T23n1442_043:0863a28_1"
    },
    {
        "source_sentence": "知彼五百婆羅門子根機將熟，即於晨朝持衣鉢入園中，就彼少年聚集之處。",
        "translation": "Knowing that the five hundred brāhmaṇas’ faculties were about to mature, in the morning they entered the park with their robes and bowls at the place where the young bhikṣus had gathered.",
        "source": "T23n1442_043:0863a29_2"
    },
    {
        "source_sentence": "諸人見已自相問曰：「此之苾芻是何種族而作出家？」",
        "translation": "Seeing this, the people asked each other, What kind of family is this monk from?",
        "source": "T23n1442_043:0863b02_3"
    },
    {
        "source_sentence": "有委知者答眾人曰：「此是婆羅門種，捨高貴族而作沙門。」",
        "translation": "Some envoys answered the crowd, This is a Brāhmaṇa who abandoned his noble family and became a śramaṇa.",
        "source": "T23n1442_043:0863b03_4"
    },
    {
        "source_sentence": "諸人聞已問尊者曰：「仁是大臣之子族胄高勝，云何捨棄於此雜類卑下人中，",
        "translation": "When the people heard this, they asked the venerable monk, “Your majesty, these ministers are sons of wealthy families and powerful clanspeople.",
        "source": "T23n1442_043:0863b04_5"
    },
    {
        "source_sentence": "食無簡別坐無次第而為出家？」",
        "translation": "There's no simple food, no separate seats, and no order to leave home?",
        "source": "T23n1442_043:0863b06_6"
    },
    {
        "source_sentence": "尊者答曰：「世間婆羅門有名無義，我所投者，無上大師及諸聖眾能除罪惡，",
        "translation": "Venerable Śāriputra replied, Worldly brāhmaṇas have names and meanings that make no sense to me. Those whom I cast into the path are the highest among all great śramaṇas and brāhmaṇas, capable of getting rid of sins and evils.",
        "source": "T23n1442_043:0863b07_7"
    },
    {
        "source_sentence": "此即皆是真婆羅門。」",
        "translation": "These are all true brāhmaṇas.",
        "source": "T23n1442_043:0863b09_8"
    },
    {
        "source_sentence": "時彼少年聞是語已撫手而笑。",
        "translation": "When that boy heard these words, he touched his hand and smiled.",
        "source": "T23n1442_043:0863b09_9"
    },
    {
        "source_sentence": "于時尊者以神通力，令諸年少頭上花纓悉皆變為葱蒜鬘帶，所有餅食盡作牛皮、諸雜餚饌俱成牛肉、乳及飲漿盡變為酒，",
        "translation": "Through his supernatural powers, the venerable then caused all the flowers and garlands on their heads of the young men to turn into scallions, garlic sprouts, and ribbons, and all the cakes and foods they consumed became cow skin, and all the various delicacies they consumed became beef, milk, and wine.",
        "source": "T23n1442_043:0863b10_10"
    },
    {
        "source_sentence": "此等皆非婆羅門種食用之物。",
        "translation": "These aren't things that the Brāhmaṇas eat.",
        "source": "T23n1442_043:0863b13_11"
    },
    {
        "source_sentence": "時彼尊者於己鉢中變作種種清淨飯食，告諸人曰：「汝觀我鉢及以身形，",
        "translation": "The venerable then transformed various kinds of pure rice and food into his bowl and told the people, “Look at my bowl and its shape.",
        "source": "T23n1442_043:0863b13_12"
    },
    {
        "source_sentence": "比汝所為，誰是清淨？",
        "translation": "Who is cleaner than what you do?",
        "source": "T23n1442_043:0863b15_13"
    },
    {
        "source_sentence": "誰無簡別？」",
        "translation": "Who doesn't have a simple distinction?",
        "source": "T23n1442_043:0863b15_14"
    },
    {
        "source_sentence": "時諸少年聞是語已，各各循省自知鄙惡，即相謂曰：「是彼尊者以神通力，",
        "translation": "Having heard these words, each of the young men examined his own conduct and knew that he was mean. They said among themselves, “That venerable monk used his supernatural powers to commit a heinous crime:",
        "source": "T23n1442_043:0863b16_15"
    },
    {
        "source_sentence": "令我花纓及諸食飲，並成雜惡不堪食噉。",
        "translation": "It causes my flowers, garlands, food, and drinks to become mixed and unworthy of eating and drinking.",
        "source": "T23n1442_043:0863b17_16"
    },
    {
        "source_sentence": "我等今時更無別計，宜當就彼以申懺謝。」",
        "translation": "We don't have any special thoughts at the present time, so we should go to them to express our repentance.",
        "source": "T23n1442_043:0863b18_17"
    },
    {
        "source_sentence": "即俱禮足白言：「聖者！",
        "translation": "They bowed their heads at their feet and said, Sage!",
        "source": "T23n1442_043:0863b19_18"
    },
    {
        "source_sentence": "我輩愚癡肉眼無識，恃己族姓出鄙惡言，於聖者所輒相輕觸，唯願慈悲受我懺謝。」",
        "translation": "We're foolish and lacking consciousness in our physical eyes, relying on our own clans to speak vulgarly and harshly, and we'll often touch each other at the noble person's place, so please have mercy and compassion and accept my repentance.",
        "source": "T23n1442_043:0863b20_19"
    },
    {
        "source_sentence": "「皮肉血便利，　　苦樂根不殊；",
        "translation": "skin, flesh, blood, and convenience are not different in their faculties of pain and pleasure.",
        "source": "T23n1442_043:0863b22_20"
    },
    {
        "source_sentence": "　咸同垢穢身，　　云何四姓別？",
        "translation": "They are all the same as defiled bodies, so why are the four castes distinguished?",
        "source": "T23n1442_043:0863b22_20"
    },
    {
        "source_sentence": "　若身離諸惡，　　口亦無過犯；",
        "translation": "If one is free from evil in body and speech, There is no transgression.",
        "source": "T23n1442_043:0863b22_20"
    },
    {
        "source_sentence": "　心極清淨者，　　名真婆羅門。",
        "translation": "The supremely pure mind is called a true brāhmaṇa.",
        "source": "T23n1442_043:0863b22_20"
    },
    {
        "source_sentence": "　勝妙法莊嚴，　　善調修梵行；",
        "translation": "Adorned with the supremely sublime teaching, They skillfully harmonize and cultivate religious practice.",
        "source": "T23n1442_043:0863b22_20"
    },
    {
        "source_sentence": "　能除眾惡業，　　是真婆羅門。」",
        "translation": "Being able to remove all bad actions is a true brāhmaṇa.",
        "source": "T23n1442_043:0863b22_20"
    },
    {
        "source_sentence": "異口同音說伽他曰：時鄔陀夷聞說伽陀知其根熟，便為說法示教利喜，",
        "translation": "Having heard [the Buddha’s discourse], Udayana, knowing that his faculties were matured, taught the Dharma to him, encouraging, benefiting, and delighting him.",
        "source": "T23n1442_043:0863b22_20"
    },
    {
        "source_sentence": "五百童子即於座上斷煩惱見真諦。",
        "translation": "Five hundred children then stopped the afflictions and saw the true truth on their seat.",
        "source": "T23n1442_043:0863c01_21"
    },
    {
        "source_sentence": "身及飲食清淨如舊，各受歸戒，廣說如前。",
        "translation": "Their bodies and food and drink are pure as before, and they each receive the precepts of refuge, as explained above.",
        "source": "T23n1442_043:0863c02_0"
    },
    {
        "source_sentence": "鉢者，室羅伐城有婆羅門，善持呪術不信三寶，常以呪力驅策鬼神，令其駕車隨意遊涉。",
        "translation": "A bowl means that there's a Brāhmaṇa in the city of Śrāvastī who well maintains spells and doesn't believe in the Three Treasures, and he always drives ghosts and spirits with the power of spells to cause them to drive their chariots and wander around as they wish.",
        "source": "T23n1442_043:0863c03_0"
    },
    {
        "source_sentence": "時鄔陀夷復觀有情，誰堪引接能入真諦？",
        "translation": "Udayana then again observed sentient beings, who are capable of attracting and entering the true truth?",
        "source": "T23n1442_043:0863c05_0"
    },
    {
        "source_sentence": "見此婆羅門根器將熟，即持衣鉢往趣其家，見婆羅門誦呪使神御車將出，",
        "translation": "Seeing that the Brahman’s faculties and vessels were about to mature, they went home with their robes and almsbowl in hand.",
        "source": "T23n1442_043:0863c05_1"
    },
    {
        "source_sentence": "暫還下車旋液方去，尊者令其小便出不停止，即解其呪放彼鬼神。",
        "translation": "After a moment's rest, he descended from his chariot and circled the water until he departed, and the venerable allowed him to urinate without stopping, so he unlocked his spell and released the spirit.",
        "source": "T23n1442_043:0863c07_2"
    },
    {
        "source_sentence": "時婆羅門少頃來至，見鬼神皆散車不能動，雖誦呪術悉皆無驗，事窮失計。",
        "translation": "When the priest came back in a short time, he saw that all the ghosts and spirits scattered their chariots and couldn't move, and even though he recited the spell, there was no experience of it, so he didn't calculate its amount.",
        "source": "T23n1442_043:0863c09_3"
    },
    {
        "source_sentence": "告苾芻曰：「由汝解呪所作不成，今欲遣誰給侍於我？」",
        "translation": "He told the monk, It's because you understand that what you've done with the spell won't work, so who do you want to send someone to serve me now?",
        "source": "T23n1442_043:0863c10_4"
    },
    {
        "source_sentence": "尊者取鉢開示告曰：「此當與汝作給侍人。」",
        "translation": "The venerable took the bowl and showed it to him, saying, Here, I'll give it to you as an attendant.",
        "source": "T23n1442_043:0863c12_5"
    },
    {
        "source_sentence": "婆羅門曰：「此黑鐵盂如何侍我？」",
        "translation": "The Brāhmaṇa said, How will this black iron pot serve me?",
        "source": "T23n1442_043:0863c13_0"
    },
    {
        "source_sentence": "尊者曰：「隨汝所念皆從此出。」",
        "translation": "The venerable said, Whatever you think, they all come out from here.",
        "source": "T23n1442_043:0863c13_1"
    },
    {
        "source_sentence": "彼聞是語即試思念百味飲食，纔念之時眾味具足滿此鉢中。",
        "translation": "Hearing these words, he then tried to think of a hundred flavors of food and drink, and when he thought about them, all the flavors are fully present in this bowl.",
        "source": "T23n1442_043:0863c14_2"
    },
    {
        "source_sentence": "彼見斯事歎未曾有，告言：「大聖！",
        "translation": "Seeing this, he praised it as unprecedented and told them, Great sage!",
        "source": "T23n1442_043:0863c15_3"
    },
    {
        "source_sentence": "斯之妙術願當惠我。」",
        "translation": "May this marvelous technique be beneficial to me.",
        "source": "T23n1442_043:0863c16_4"
    },
    {
        "source_sentence": "「明呪不惠人，　　以呪換方與，",
        "translation": "It's clear that the mantra doesn't benefit people, but it's given to them in exchange for the mantra.",
        "source": "T23n1442_043:0863c16_5"
    },
    {
        "source_sentence": "　或時得供給，　　或多獲珍財，",
        "translation": "Sometimes they'll get an offering, or they'll attain a lot of treasures.",
        "source": "T23n1442_043:0863c16_5"
    },
    {
        "source_sentence": "　若不如是者，　　縱死不傳授。」",
        "translation": "If someone doesn't do so, they won't transmit it even if they die.",
        "source": "T23n1442_043:0863c16_5"
    },
    {
        "source_sentence": "尊者即說伽他而告之曰：時婆羅門聞伽他已，為求呪故審諦思惟：「知神呪力有不思議，",
        "translation": "The venerable one then addressed Kāta and said to him: When the brāhmaṇa heard this, he deliberated with careful consideration in order to find a spell. Knowing that the power of the divine spell is inconceivable,",
        "source": "T23n1442_043:0863c16_5"
    },
    {
        "source_sentence": "既不授人何緣能得？」",
        "translation": "Since it's not given to someone, what is the reason they can attain it?",
        "source": "T23n1442_043:0863c22_6"
    },
    {
        "source_sentence": "白尊者曰：「我無妙術可共相換，復無珍財持用供奉，但有身力以相給侍，",
        "translation": "He said to the venerable monk, “There is no marvelous thing that I can exchange for you. Nor am I able to offer you precious things as my offerings; rather, I have physical strength to serve you.",
        "source": "T23n1442_043:0863c22_7"
    },
    {
        "source_sentence": "幸願慈悲教我明呪。」",
        "translation": "May you have mercy and compassion and teach me the clear spell.",
        "source": "T23n1442_043:0863c24_8"
    },
    {
        "source_sentence": "尊者報曰：「爾欲得者可於如來善說法律而為出家，我當與汝如意神呪。」",
        "translation": "The venerable replied, If you want to attain it, you can leave home because you well explain the Tathāgata's teaching of the Dharma, and I will give you a wish-granting dhāraṇī.",
        "source": "T23n1442_043:0863c25_9"
    },
    {
        "source_sentence": "彼為呪故依教出家，剃除鬚髮著法服已，白師言：「鄔波馱耶！",
        "translation": "For the sake of the spell, he relied on the teaching to leave home, shaved his hair and beard, put on the Dharma robes, and said to the master, Upāsaka!",
        "source": "T23n1442_043:0863c26_10"
    },
    {
        "source_sentence": "授我明呪。」",
        "translation": "Give me a clear spell.",
        "source": "T23n1442_043:0863c28_11"
    },
    {
        "source_sentence": "師曰：「汝可受之。」",
        "translation": "The teacher said, You may accept it.",
        "source": "T23n1442_043:0863c28_12"
    },
    {
        "source_sentence": "弟子曰：「何謂也？」",
        "translation": "The disciple said, What does it mean?",
        "source": "T23n1442_043:0863c28_13"
    },
    {
        "source_sentence": "師曰：「所謂諸行皆無常，一切法無我，涅槃真寂滅。",
        "translation": "The teacher said, All conditioned phenomena are impermanent, all dharmas are without self, and nirvāṇa is truly tranquil.",
        "source": "T23n1442_043:0863c29_0"
    },
    {
        "source_sentence": "此是鉢中明呪，於三夜中汝勤修習必有神驗，於此句義當善思惟。」",
        "translation": "This is a clear spell in the bowl, and if you diligently cultivate it for three nights, you'll surely experience miraculous results; you should well contemplate the meaning of this phrase.",
        "source": "T23n1442_043:0864a01_1"
    },
    {
        "source_sentence": "時彼弟子為求驗故冀有成功，於日夜中一心相續思三句法，妙解真源眾惑斷除證阿羅漢，",
        "translation": "In order to test his supernatural abilities, that disciple, wishing to attain enlightenment, continually thought with a concentrated mind day and night about the three doctrines in three sentences: “I have subtly understood the true source of all buddha-teachings, having eliminated all passions.",
        "source": "T23n1442_043:0864a02_2"
    },
    {
        "source_sentence": "便詣師處禮足白言：「我今實得無上明呪，我生已盡、梵行已立、不受後有、如實而知。」",
        "translation": "He then went to the teacher's place, bowed his feet, and said, Now that I've really attained the unsurpassed mantra of insight, I've ended birth, established the religious practice, won't accept future existence, and know it as it really is.",
        "source": "T23n1442_043:0864a04_3"
    },
    {
        "source_sentence": "鄔陀夷曰：「善哉！",
        "translation": "Udayana said, Good!",
        "source": "T23n1442_043:0864a06_4"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T23n1442_043:0864a06_5"
    },
    {
        "source_sentence": "汝是真報佛恩自他俱利，於三有海不復輪迴。」",
        "translation": "You truly repay the Buddha's kindness to self and others for their mutual benefit, and you won't return to the ocean of the three existences again.",
        "source": "T23n1442_043:0864a07_6"
    },
    {
        "source_sentence": "相撲者，爾時有一壯士從南方來，欲於中國求人捔力。",
        "translation": "At the time, there was a strong man coming from the south who wanted to search for strength in China.",
        "source": "T23n1442_043:0864a09_0"
    },
    {
        "source_sentence": "至室羅伐城於城門下脫衣拍髀，高聲大叫：「我從遠來覓人相撲，若有能者可來接手。」",
        "translation": "When he arrived at the city of Śrāvastī, he took off his robes and patted his thighs under the city's entrance and cried out in a loud voice, I've come from afar to search for someone to wrestle me; if there's someone capable, they can come to take my hand.",
        "source": "T23n1442_043:0864a10_1"
    },
    {
        "source_sentence": "時此城中無人對敵。",
        "translation": "At the time, there were no opponents in this city.",
        "source": "T23n1442_043:0864a12_2"
    },
    {
        "source_sentence": "時鄔陀夷知此壯士堪任受化，於晨朝時執持衣鉢欲行乞食，至城門下見斯壯士告言：「男子！",
        "translation": "Knowing that this strong man was capable of undergoing transformation, Udayana took his robe and bowl in the morning and went to the city gates to solicit alms.",
        "source": "T23n1442_043:0864a12_3"
    },
    {
        "source_sentence": "汝是壯兒欲求相撲？」",
        "translation": "Are you a strong man who wants to fight?",
        "source": "T23n1442_043:0864a14_4"
    },
    {
        "source_sentence": "答曰：「如是。」",
        "translation": "He replied, So it is.",
        "source": "T23n1442_043:0864a15_5"
    },
    {
        "source_sentence": "鄔陀夷曰：「汝當共我相撲為？",
        "translation": "Udāyin said, Will you fight with me for it?",
        "source": "T23n1442_043:0864a15_6"
    },
    {
        "source_sentence": "當共我所撲得者而相撲乎？」",
        "translation": "Will you fight each other with what I've won?",
        "source": "T23n1442_043:0864a16_7"
    },
    {
        "source_sentence": "壯士答曰：「仁撲得者，我且撲之。」",
        "translation": "The strong man answered, Sir, I'll fight him if he wins.",
        "source": "T23n1442_043:0864a16_8"
    },
    {
        "source_sentence": "鄔陀夷曰：「彼有強力汝不能禁。」",
        "translation": "Udayana said, They're powerful, and you can't restrain them.",
        "source": "T23n1442_043:0864a17_9"
    },
    {
        "source_sentence": "壯士曰：「要待對敵方知強弱。」",
        "translation": "The strong man said, You must wait until you're confronted by an enemy before you know weakness.",
        "source": "T23n1442_043:0864a18_10"
    },
    {
        "source_sentence": "鄔陀夷曰：「貪、瞋、癡三是我所伏，汝試撲之。」",
        "translation": "Udayana said, The three kinds of craving, anger, and delusion are subdued by me; you must try to suppress them.",
        "source": "T23n1442_043:0864a18_11"
    },
    {
        "source_sentence": "壯士曰：「此有大力欺一切人，我何方便能為彼敵？」",
        "translation": "The strong man said, This person has great strength to deceive all people, so what method can I use to be their opponent?",
        "source": "T23n1442_043:0864a19_12"
    },
    {
        "source_sentence": "鄔陀夷曰：「先可出家方能對敵。」",
        "translation": "Udayana said, You can first leave home and then you'll be able to confront an enemy.",
        "source": "T23n1442_043:0864a20_13"
    },
    {
        "source_sentence": "即剃髮染衣思降三毒，未久之頃結惑皆除證阿羅漢，詣鄔陀夷所白言：「大師！",
        "translation": "Soon after shaving his dyed robes and contemplating the three poisons, they all removed their afflictions and realized arhatship, went to Udayana, said, Great teacher!",
        "source": "T23n1442_043:0864a21_14"
    },
    {
        "source_sentence": "我已降伏三種，壯士四事究竟。」",
        "translation": "I've subdued three kinds of people, and the strong man has accomplished four things.",
        "source": "T23n1442_043:0864a23_15"
    },
    {
        "source_sentence": "廣如上說，如是鄔陀夷苾芻於室羅伐城，教化十八億家皆令解脫。",
        "translation": "As explained in detail above, thus did the monk Udayana teach and transform  1.8 billion families in Śrāvastī to be liberated.",
        "source": "T23n1442_043:0864a24_16"
    },
    {
        "source_sentence": "爾時鄔陀夷化暴惡女令得見諦，廣說如前，乃至為受食座。",
        "translation": "At the time, Udayin transformed a violent woman so that she'll see the truth and explain it in detail as before, even to the point where she'll accept a food seat.",
        "source": "T23n1442_043:0864a26_0"
    },
    {
        "source_sentence": "未久之頃時暴惡女為兒娶妻，身嬰疾病臨死之時告家人曰：「我死之後隨有何事，",
        "translation": "Soon afterward, the wicked woman took a wife for her child. She became ill and died soon thereafter.",
        "source": "T23n1442_043:0864a27_1"
    },
    {
        "source_sentence": "勿廢聖者鄔陀夷食座。」",
        "translation": "Don't abandon the noble person Udayana's food seat.",
        "source": "T23n1442_043:0864a29_2"
    },
    {
        "source_sentence": "說是語已須臾命終。",
        "translation": "After he spoke these words, his life ended in a moment.",
        "source": "T23n1442_043:0864a29_3"
    },
    {
        "source_sentence": "彼婆羅門隨次而終，其子憂感經時漸捨，便棄其婦求學他方。",
        "translation": "That Brāhmaṇa died one after the other, and his son was grieved when he gradually abandoned it at the time of the sūtra, so he abandoned his wife and went to another place to study.",
        "source": "T23n1442_043:0864b01_4"
    },
    {
        "source_sentence": "妻於後時煩惱增盛，乃與賊帥密行非法。",
        "translation": "Later, when his wife became increasingly afflicted, he secretly practiced unlawfully with the thief's commander.",
        "source": "T23n1442_043:0864b02_5"
    },
    {
        "source_sentence": "尊者每至其家於座而食，觀知此婦性多煩惱，常為演說離欲之法。",
        "translation": "Whenever the venerable came to his house and ate from his seat, he observed that the woman's nature was full of afflictions and always taught her the Dharma of freedom from desire.",
        "source": "T23n1442_043:0864b03_6"
    },
    {
        "source_sentence": "彼婦便念：「尊者聖力能了他心，知我與人有私通事，我夫若至必當告知。",
        "translation": "The woman then thought, Venerable, the sage's power can tell others to know that I have private affairs with someone else, and if my husband arrives, he'll surely tell them.",
        "source": "T23n1442_043:0864b05_7"
    },
    {
        "source_sentence": "今我宜應預斷其命。」",
        "translation": "Now, it's appropriate for me to cut off his life.",
        "source": "T23n1442_043:0864b06_8"
    },
    {
        "source_sentence": "即詐現病相告使女曰：「我今有疾，汝今可往白尊者知屈來至宅。」",
        "translation": "He then fraudulently showed his illness and told the messenger woman, Now that I'm ill, you may go to the house of the honored one who knows he's coming.",
        "source": "T23n1442_043:0864b07_9"
    },
    {
        "source_sentence": "使女往報，是時尊者不預觀察，來至其家，固留至夜。",
        "translation": "When the envoy's daughter returned to report, the venerable didn't look ahead, came to his house, and stayed until late at night.",
        "source": "T23n1442_043:0864b08_10"
    },
    {
        "source_sentence": "令喚賊帥，至便告曰：「若此苾芻命得存者，我終不活。」",
        "translation": "When he arrived, he told the thief commander, If this monk's life were to survive, I wouldn't be able to live.",
        "source": "T23n1442_043:0864b09_11"
    },
    {
        "source_sentence": "時彼賊帥恐其事露，忿怒持刀斷尊者命，將其屍骸棄糞聚中。",
        "translation": "Fearing that the thief's commander would be exposed, he angrily cut off the Venerable's life with a sword and threw his corpse into a pile of dung.",
        "source": "T23n1442_043:0864b11_12"
    },
    {
        "source_sentence": "此是尊者先所作業，今時果熟還於自身蘊器處受，非於餘處，乃至廣說。",
        "translation": "This is what the venerable one did previously. The present maturation of this fruit returns to be felt in his own body, in the aggregates and containers; it is nowhere else:",
        "source": "T23n1442_043:0864b12_13"
    },
    {
        "source_sentence": "爾時世尊於十五日褒灑陀時在眾中坐，大眾皆集唯鄔陀夷一人不到。",
        "translation": "It was then that the Bhagavān was seated in the midst of the crowd on the fifteenth day of the Buddha's birthday, and all the members of the crowd gathered together but Udayana didn't come.",
        "source": "T23n1442_043:0864b15_0"
    },
    {
        "source_sentence": "時知座者白言：「不見尊者鄔陀夷！」",
        "translation": "Knowing the throne, he said, Don't you see Venerable Udayana!",
        "source": "T23n1442_043:0864b16_1"
    },
    {
        "source_sentence": "諸佛世尊得無忘念，即告眾曰：「我說鄔陀夷教化人中最為第一，今已被殺棄糞聚中，",
        "translation": "The buddhas and world-honored ones, having attained the state of nonforgetfulness, said to the assembly, “I proclaim that Udayana is the foremost among all those who teach people. He has now been slaughtered in a pile of dung.",
        "source": "T23n1442_043:0864b17_2"
    },
    {
        "source_sentence": "汝等應為長淨。」",
        "translation": "You should be purified for a long time.",
        "source": "T23n1442_043:0864b19_3"
    },
    {
        "source_sentence": "時諸苾芻為長淨已，佛言：「汝等應可俱行，與鄔陀夷為最後供養設利羅。」",
        "translation": "After the monks had purified themselves for a long time, the Buddha said, You should all go together and make offerings to Udayana as your final offerings to Śāriputra.",
        "source": "T23n1442_043:0864b19_4"
    },
    {
        "source_sentence": "爾時世尊大眾圍繞夜至城門，放大光明遍滿城邑，其門自開，皆謂天曉。",
        "translation": "It was then that the Bhagavān surrounded the crowd and went to the city gates at night, emanating a great ray of light that filled the cities. The gates opened on their own, all calling it dawn.",
        "source": "T23n1442_043:0864b22_0"
    },
    {
        "source_sentence": "諸人咸起，其警夜者知天未明。",
        "translation": "The people all got up, and those who were alerted at night knew the sky was not yet clear.",
        "source": "T23n1442_043:0864b23_1"
    },
    {
        "source_sentence": "時勝光王及勝鬘夫人等驚怪其事，門人奏曰：「今佛世尊及諸聖眾俱至門首。」",
        "translation": "The king of Vaiśeṣika and the wife of Vaiśravaṇa were surprised by this, and their disciples said, Now, the Bhagavān Buddha and the holy ones have all arrived at the entrance.",
        "source": "T23n1442_043:0864b24_2"
    },
    {
        "source_sentence": "時王聞已總命群臣、勝鬘夫人、部領宮內城中士女，並悉奔馳俱到城門，",
        "translation": "When the king heard this, he ordered his ministers, the queen and the ladies of the royal palace, as well as the officials in charge of the state, to all rushed to the city gates.",
        "source": "T23n1442_043:0864b26_3"
    },
    {
        "source_sentence": "禮世尊足。",
        "translation": "He bowed his head at the feet of the Bhagavān.",
        "source": "T23n1442_043:0864b27_4"
    },
    {
        "source_sentence": "王先稽首白佛言：「世尊！",
        "translation": "The king first bowed his head and said to the Buddha, Bhagavān!",
        "source": "T23n1442_043:0864b28_0"
    },
    {
        "source_sentence": "以何因緣無上大師躬至於此？」",
        "translation": "What are the causes and conditions for the unsurpassed teacher's coming here in person?",
        "source": "T23n1442_043:0864b28_1"
    },
    {
        "source_sentence": "佛告大王：「鄔陀夷苾芻教化人中我說第一，今被他殺棄糞聚中，我今故來為彼焚身作供養事。」",
        "translation": "The Buddha told the great king, Among the monks who teach people in Udayana, I'll be the first to say that I've been killed by someone else and thrown into a pile of dung, and now I'm here to burn my body for their sake as an offering.",
        "source": "T23n1442_043:0864b29_2"
    },
    {
        "source_sentence": "時勝光王聞是事已，及勝鬘夫人，便以四寶莊校喪輿，躬從如來至糞聚所，",
        "translation": "Having heard about this matter, King Prabhākaramitra and the queen Vaiśravaṇa took their death carriages decorated with the four kinds of jewels and went in person from the place where the Tathāgata was buried to the place where the dung had accumulated.",
        "source": "T23n1442_043:0864c02_3"
    },
    {
        "source_sentence": "出尊者屍香湯洗浴置寶輿中，奏眾伎樂幢幡滿路香煙遍空，王及大臣傾城士女，",
        "translation": "Then the king and his ministers poured perfumed bathing water from the incense of the corpse of the Venerable into a precious carriage to wash it. They played music, played music, set up banners and streamers, filled the road with fragrant smoke, filling the air everywhere. The king and his ministers poured all the merchants and women of the",
        "source": "T23n1442_043:0864c04_4"
    },
    {
        "source_sentence": "從佛及僧送出城外，至一空處積眾香木，灌灑蘇油以火焚之，誦無常經畢，",
        "translation": "The Buddha and the monks escorted them out of the city. They went to an empty place where they stored various kinds of fragrant wood, poured scented oil over it, burned it in the fire, and recited the sutra on the impermanence of things after finishing its recitation.",
        "source": "T23n1442_043:0864c06_0"
    },
    {
        "source_sentence": "取舍利羅置金瓶內，於四衢路側建窣堵波。",
        "translation": "He took the relics, placed them inside a golden vase, and built a stupa beside the four quarters of the road.",
        "source": "T23n1442_043:0864c07_1"
    },
    {
        "source_sentence": "種種香花及眾音樂，莊嚴供養昔未曾有。",
        "translation": "Various kinds of incense, flowers, and various music were offered as an unprecedented offering.",
        "source": "T23n1442_043:0864c08_2"
    },
    {
        "source_sentence": "王及中宮并諸士庶，佛及聖眾各還本所。",
        "translation": "The king, the middle palace, the soldiers, the Buddha, and the holy ones each returned to their own place.",
        "source": "T23n1442_043:0864c09_3"
    },
    {
        "source_sentence": "爾時世尊至住處已告諸苾芻：「此由非時行招斯大過，廣說乃至我觀十利，",
        "translation": "It was then that the Bhagavān arrived at his dwelling place and said to the monks, This is because of these untimely actions that bring about this great error, which is explained in detail up to the ten benefits of self-observation.",
        "source": "T23n1442_043:0864c10_4"
    },
    {
        "source_sentence": "為諸苾芻制其學處，應如是說：「若復苾芻非時入聚落者，波逸底迦。」",
        "translation": "For the sake of those monks who regulate their places of training, they should thus say, If another monk enters a village at an ungodly hour, pratyekabuddha.",
        "source": "T23n1442_043:0864c12_5"
    },
    {
        "source_sentence": "如是世尊為諸苾芻制學處已，非時不得入聚落。",
        "translation": "Thus, the Bhagavān has established a place of training for the monks, but it's not the right time to enter a village.",
        "source": "T23n1442_043:0864c14_6"
    },
    {
        "source_sentence": "時諸苾芻有看病人遂闕瞻視，知僧事者僧事廢闕。",
        "translation": "The monks then had an attendant sick and went missing to look around, knowing that the saṃgha's affairs were neglected by the saṃgha's affairs.",
        "source": "T23n1442_043:0864c15_7"
    },
    {
        "source_sentence": "以事白佛，佛言：「有苾芻者囑授應去，應告彼曰：『具壽存念！",
        "translation": "He told the Buddha about this, and he said, There's a monk who instructed him to leave, so you should tell him, 'Gushou存念!",
        "source": "T23n1442_043:0864c17_8"
    },
    {
        "source_sentence": "我有看病因緣，或為眾事須非時入聚落。",
        "translation": "I'll see the causes and conditions of illness, or maybe I'll enter a village at an ungodly hour for various reasons.",
        "source": "T23n1442_043:0864c18_9"
    },
    {
        "source_sentence": "白具壽知。』",
        "translation": "He said, 'I'll tell you the full life span.'",
        "source": "T23n1442_043:0864c19_10"
    },
    {
        "source_sentence": "彼答云：『奧箄迦。』」",
        "translation": "They replied, 'Abhidharma.'",
        "source": "T23n1442_043:0864c19_11"
    },
    {
        "source_sentence": "時有苾芻於俗舍內先寄衣鉢，其舍非時忽然火起，苾芻即便往取衣鉢，",
        "translation": "There was a monk who had previously sent his robe and bowl inside a secular dwelling. At an ungodly hour in that dwelling, a fire broke out suddenly and the monk went to get his robe and bowl.",
        "source": "T23n1442_043:0864c20_12"
    },
    {
        "source_sentence": "行至中途作如是念：「我不囑授非時入聚落，是所不應。」",
        "translation": "When he arrived on the way, he thought, I won't entrust you to enter a village at an ungodly hour; this is what you shouldn't do.",
        "source": "T23n1442_043:0864c21_13"
    },
    {
        "source_sentence": "遂即迴還覓人囑授，須臾之頃衣鉢燒盡。",
        "translation": "He then returned and looked for someone to entrust it to him, and in a moment his robes and bowl were burned up.",
        "source": "T23n1442_043:0864c23_0"
    },
    {
        "source_sentence": "時諸苾芻以緣白佛，佛言：「除因緣故。」",
        "translation": "The monks then reported this to the Buddha for his sake, and he said, It's because it's free of causes and conditions.",
        "source": "T23n1442_043:0864c23_1"
    },
    {
        "source_sentence": "告諸苾芻：「前是創制，此是隨開。",
        "translation": "He told the monks, Formerly, this was a new rule, but this is a follow-on.",
        "source": "T23n1442_043:0864c24_2"
    },
    {
        "source_sentence": "應如是說：若復苾芻非時入聚落，不囑餘苾芻，除餘緣故，波逸底迦。」",
        "translation": "You should thus say, 'Suppose another monk enters a village at an ungodly hour and doesn't entrust it to another monk, except for other reasons, pratyekabuddha.'",
        "source": "T23n1442_043:0864c25_3"
    },
    {
        "source_sentence": "若復苾芻者，謂此法中人，餘義如上。",
        "translation": "If another monk refers to someone in this teaching, the rest are as above.",
        "source": "T23n1442_043:0864c27_4"
    },
    {
        "source_sentence": "言非時者，有二分齊，謂從過午至明相未出。",
        "translation": "When stating that it is not the right time, there are two distinctive characteristics: from beyond the noon hour up to when the light has not yet appeared.",
        "source": "T23n1442_043:0864c27_5"
    },
    {
        "source_sentence": "聚落義如上。",
        "translation": "The meaning of a village is as above.",
        "source": "T23n1442_043:0864c28_6"
    },
    {
        "source_sentence": "入者，謂至聚落。",
        "translation": "“Entry”: arriving at a village.",
        "source": "T23n1442_043:0864c29_7"
    },
    {
        "source_sentence": "餘苾芻者，謂於其處現有苾芻而不告語。",
        "translation": "The rest of the bhikṣus means that there's a bhikṣu who doesn't tell them where he's present.",
        "source": "T23n1442_043:0864c29_8"
    },
    {
        "source_sentence": "除時因緣者，謂有難緣。",
        "translation": "“Exception made for the supporting object at the moment”: Conditioned by what is difficult.",
        "source": "T23n1442_043:0865a01_9"
    },
    {
        "source_sentence": "餘義如上。",
        "translation": "The rest are as above.",
        "source": "T23n1442_043:0865a02_0"
    },
    {
        "source_sentence": "此中罪相其事云何？",
        "translation": "What's the matter with these characteristics of sin?",
        "source": "T23n1442_043:0865a02_1"
    },
    {
        "source_sentence": "若苾芻於非時作非時想疑，得根本罪。",
        "translation": "If a monk creates an idea of what's not the right time and doubts what's not the right time, he'll be guilty of a fundamental offense.",
        "source": "T23n1442_043:0865a02_2"
    },
    {
        "source_sentence": "於時作非時想疑，得惡作罪。",
        "translation": "A person who doubts what's done at the right time and what's not done at the right time commits the sin of bad action.",
        "source": "T23n1442_043:0865a03_3"
    },
    {
        "source_sentence": "餘二無犯。",
        "translation": "The other two are not offenses.",
        "source": "T23n1442_043:0865a04_4"
    },
    {
        "source_sentence": "又無犯者，廣說如上。",
        "translation": "Also, there's no offense, which is explained in detail as above.",
        "source": "T23n1442_043:0865a04_5"
    },
    {
        "source_sentence": "爾時勝鬘夫人，知尊者鄔陀夷枉被賊師所殺，慇懃白王令捕賊師，為護未來諸苾芻故。",
        "translation": "Knowing that Venerable Udayana had been killed in vain by the thief's teacher, Lady Vaiśravaṇa told the king to arrest the thief's teacher because he wanted to protect the future monks.",
        "source": "T23n1442_043:0865a06_0"
    },
    {
        "source_sentence": "時王即勅有司嚴加掩捕，獲賊師已，王遣將賊投熱油釜中而斷其命。",
        "translation": "The king then ordered an official to cover up the thief and capture him. Having captured the thief's master, the king sent him into a kettle of hot oil and cut off his life.",
        "source": "T23n1442_043:0865a08_1"
    },
    {
        "source_sentence": "賊之伴侶有五百人，皆截其手，彼私通女以其頭髮繫不調馬足，放令蹋死。",
        "translation": "The thief's companions had five hundred men, all of whom cut off their hands, and the private woman tied her hair around him and didn't regulate his horse's legs, allowing him to step on it.",
        "source": "T23n1442_043:0865a09_2"
    },
    {
        "source_sentence": "時諸苾芻咸皆有疑，白佛言：「世尊！",
        "translation": "The monks then all had doubts and said to the Buddha, Bhagavān!",
        "source": "T23n1442_043:0865a11_3"
    },
    {
        "source_sentence": "彼之賊師曾作何業殺鄔陀夷受苦而死？",
        "translation": "What action did the thief master ever do to kill Udayana, who suffered and died?",
        "source": "T23n1442_043:0865a12_4"
    },
    {
        "source_sentence": "及私通女五百賊徒皆被刑戮？」",
        "translation": "And the five hundred thieves and women of private penetration were all tortured and killed?",
        "source": "T23n1442_043:0865a13_5"
    },
    {
        "source_sentence": "佛告諸苾芻：「由彼王等於先世中自所作業，還當自受，非於餘處有物代受，",
        "translation": "The Buddha said to the bhikṣus: Having done what they did in a previous life, the kings and others should also do as they have done. There is no other place for them to perform their duties.",
        "source": "T23n1442_043:0865a13_6"
    },
    {
        "source_sentence": "如餘廣說。",
        "translation": "It's as explained in detail elsewhere.",
        "source": "T23n1442_043:0865a15_7"
    },
    {
        "source_sentence": "汝等應聽！",
        "translation": "You should listen!",
        "source": "T23n1442_043:0865a15_8"
    },
    {
        "source_sentence": "乃往古昔於婆羅痆斯城王名梵摩達多，其王大臣聰明博識有五百弟子，",
        "translation": "Formerly the king of Vārāṇasī, named Brahmadatta, had five hundred disciples who were intelligent and knowledgeable.",
        "source": "T23n1442_043:0865a16_0"
    },
    {
        "source_sentence": "為貪利故遂至王前詐陳預夢，云：『我夢見當於十二年中天不降雨，國土荒亂人民飢饉王位將危。』",
        "translation": "Because of their craving for profit, they went to the king's presence and fraudulently predicted a dream, saying, 'In my dream, I saw that it would be twelve years before rain didn't fall in heaven, and the land would be desolate and the people would starve and the king's position would be in danger.'",
        "source": "T23n1442_043:0865a17_1"
    },
    {
        "source_sentence": "王曰：『若如是者事當奈何？",
        "translation": "The king said, 'If that's the case, what should I do?'",
        "source": "T23n1442_043:0865a19_2"
    },
    {
        "source_sentence": "欲作何計得免災厄？』",
        "translation": "What do you think you want to do to escape disaster?'",
        "source": "T23n1442_043:0865a20_3"
    },
    {
        "source_sentence": "大臣白曰：『應殺五百頭牛作耶慎若大會，設婆羅門，方免災難。』",
        "translation": "The ministers said, 'Should you kill five hundred headed cows to create a great assembly of Yaśina and set up a brāhmaṇa to avoid disaster?'",
        "source": "T23n1442_043:0865a21_0"
    },
    {
        "source_sentence": "王遂出教總集五百頭牛俱在一處，牛大吼叫。",
        "translation": "The king then issued a teaching to gather the five hundred headed cows together in one place, and the cows roared loudly.",
        "source": "T23n1442_043:0865a22_1"
    },
    {
        "source_sentence": "王聞其聲便生悲愍，告大臣曰：『豈俱殺此諸牛命耶？』",
        "translation": "When the king heard that sound, he became compassionate and told his ministers, 'Did you both kill the lives of these cows?'",
        "source": "T23n1442_043:0865a23_2"
    },
    {
        "source_sentence": "臣測王意白言：『大王！",
        "translation": "The ministers questioned the king's intention and said, 'Great king!",
        "source": "T23n1442_043:0865a24_3"
    },
    {
        "source_sentence": "觀此群牛欲殺之時，有行婬者其牛合死。』",
        "translation": "When he observes these herds of cattle wanting to kill them, if there's a lion who walks around, his cattle will die together.'",
        "source": "T23n1442_043:0865a25_4"
    },
    {
        "source_sentence": "時將設會總察諸牛，遂有特牛、牸牛共為婬事。",
        "translation": "When he was about to set up an assembly, he surveyed the cattle and found that there were special cattle and cowherding cattle who worked together for him.",
        "source": "T23n1442_043:0865a26_5"
    },
    {
        "source_sentence": "大臣曰：『此應合殺。』",
        "translation": "The minister said, 'Should this be combined with killing?'",
        "source": "T23n1442_043:0865a27_6"
    },
    {
        "source_sentence": "彼五百弟子一時舉手云：『此牛合死。』",
        "translation": "One time, those five hundred disciples raised their hand and said, 'This cow died together.'",
        "source": "T23n1442_043:0865a27_7"
    },
    {
        "source_sentence": "其大臣婦亦云：『合死。』",
        "translation": "The minister's wife also said, 'He'll die together.'",
        "source": "T23n1442_043:0865a28_8"
    },
    {
        "source_sentence": "遂殺二牛以供設會。",
        "translation": "He then killed two cows to make offerings to the assembly.",
        "source": "T23n1442_043:0865a28_9"
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T23n1442_043:0865a29_10"
    },
    {
        "source_sentence": "往時大臣者即賊師是，其大臣婦者即私通女是，五百弟子者即賊伴五百人是。",
        "translation": "Their ministers in the past were the thief's teachers, their ministers' wives were the women of private affairs, and the five hundred disciples were the five hundred thieves' companions.",
        "source": "T23n1442_043:0865a29_11"
    },
    {
        "source_sentence": "往時二牛即勝光王及勝鬘夫人是，昔時被殺今還殺彼。",
        "translation": "In the past, these were the two cows, which were the king of Vaiśravaṇa and the wife of Vaiśravaṇa, who were killed in the past and are still killing them now.",
        "source": "T23n1442_043:0865b02_12"
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T23n1442_043:0865b03_13"
    },
    {
        "source_sentence": "凡諸有情自所作業果報不亡，雖經多劫緣合還受。",
        "translation": "Ordinary sentient beings do their own work without losing the karmic retribution, and even though they go through many eons of conditioned assemblage, they still experience it.",
        "source": "T23n1442_043:0865b03_14"
    },
    {
        "source_sentence": "是故當知，勿為惡業，修諸善品。",
        "translation": "Therefore, you should know that you don't cultivate good qualities for bad actions.",
        "source": "T23n1442_043:0865b05_15"
    },
    {
        "source_sentence": "「復次諸苾芻！",
        "translation": "Furthermore, monks!",
        "source": "T23n1442_043:0865b06_0"
    },
    {
        "source_sentence": "汝等當聽！",
        "translation": "You should listen!",
        "source": "T23n1442_043:0865b06_1"
    },
    {
        "source_sentence": "其鄔陀夷先作何業，由彼業力，今被他殺棄糞聚中？",
        "translation": "What action did that Udayana do in the past that caused him to be killed by someone else and thrown into a pile of dung because of the power of that action?",
        "source": "T23n1442_043:0865b06_2"
    },
    {
        "source_sentence": "乃往古昔於一聚落有捕獵人，以屠殺為業而自活命。",
        "translation": "In ancient times there were hunters and hunters in one village who made the business of butchering to earn their living.",
        "source": "T23n1442_043:0865b07_3"
    },
    {
        "source_sentence": "彼時有一獨覺來至林所而暫停息。",
        "translation": "At the time, a solitary realizer came to the forest and stopped his breath.",
        "source": "T23n1442_043:0865b08_4"
    },
    {
        "source_sentence": "當是之日彼捕獵人一無所獲，便生怪念：『我從昔來於此林中多獲禽獸，",
        "translation": "On that day, the hunter had nothing to catch. He wondered and thought, “Since ancient times I have caught many animals in this forest.",
        "source": "T23n1442_043:0865b09_5"
    },
    {
        "source_sentence": "何故今日而無所得？』",
        "translation": "Why is there nothing to be gained today?'",
        "source": "T23n1442_043:0865b11_6"
    },
    {
        "source_sentence": "遂見人蹤隨跡而去，見一獨覺端居而坐，是時獵者作如是念：『由此人來我無所得。』",
        "translation": "He then saw the traces of the people following them and saw a solitary realizer sitting there, and the hunter thought, 'From this person coming, I won't get anything.'",
        "source": "T23n1442_043:0865b11_7"
    },
    {
        "source_sentence": "遂生瞋忿，即滿張弓放以毒箭中其禁處。",
        "translation": "He then became angry and filled his bow and released it into the forbidden place with a poisonous arrow.",
        "source": "T23n1442_043:0865b13_8"
    },
    {
        "source_sentence": "獨覺聖者見此愚人起悲愍心，為現神變騰空上踊猶若鵝王。",
        "translation": "Seeing this foolish man, the pratyekabuddha sage arouses compassion and manifests miraculous powers to cause him to rise up into the sky like a king of geese.",
        "source": "T23n1442_043:0865b14_9"
    },
    {
        "source_sentence": "時彼獵人見神通已深生追悼，發言仰告：『我愚癡人不識賢聖，願縱身下受我懺謝。』",
        "translation": "Seeing his supernormal powers, the hunter was deeply grieved and said, 'I'm a foolish man who doesn't know the wise and saintly, so may I accept my repentance by bowing down.'",
        "source": "T23n1442_043:0865b16_10"
    },
    {
        "source_sentence": "時彼聖者為哀愍故，放身而下受其懺謝，因即命終。",
        "translation": "Because of his pity, the noble man then released himself and went down to receive his repentance, and so he died.",
        "source": "T23n1442_043:0865b18_0"
    },
    {
        "source_sentence": "時彼獵人以火焚形，取其舍利起窣覩波，種種供養因發大願：『勿緣此罪令我當來受地獄報，",
        "translation": "The hunter then burned his body in the fire, took the relics, raised a torch, and made various offerings. Because of these offerings he made the great vow:",
        "source": "T23n1442_043:0865b19_1"
    },
    {
        "source_sentence": "於未來世當得逢遇殊勝大師親承供養。』",
        "translation": "In a future life, he'll meet and receive an offering from the most excellent teacher.'",
        "source": "T23n1442_043:0865b21_2"
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T23n1442_043:0865b22_3"
    },
    {
        "source_sentence": "往時獵人者即鄔陀夷是，由昔殺他今還被殺。",
        "translation": "The hunter of the past was Udayana, who killed others in the past and is still alive now.",
        "source": "T23n1442_043:0865b22_4"
    },
    {
        "source_sentence": "「復次諸苾芻！",
        "translation": "Furthermore, monks!",
        "source": "T23n1442_043:0865b24_0"
    },
    {
        "source_sentence": "汝等當聽！",
        "translation": "You should listen!",
        "source": "T23n1442_043:0865b24_1"
    },
    {
        "source_sentence": "此鄔陀夷先作何業，得阿羅漢親事於我，被殺之後棄糞聚中；",
        "translation": "What action did this upāsikā do in the past that made him become an arhat and became intimate with me? After being killed, he threw himself into a pile of dung.",
        "source": "T23n1442_043:0865b24_2"
    },
    {
        "source_sentence": "佛與僧眾王及大臣，勝鬘夫人并諸宮女城中士庶，俱至屍邊莊嚴寶輿移至勝處，",
        "translation": "The Buddha, the members of the sangha, the kings and ministers, the queens, the palace ladies, and the officials in the city all went to the side of the corpse. Adorned with jeweled carriages, they carried it to a superior place.",
        "source": "T23n1442_043:0865b25_3"
    },
    {
        "source_sentence": "焚燒既訖取設利羅造窣覩波盛興供養？",
        "translation": "After the burning has ended, he takes Śāriputra and creates a wagon to make great offerings?",
        "source": "T23n1442_043:0865b27_4"
    },
    {
        "source_sentence": "乃往古昔有一瓦師，見一獨覺身嬰疾病，為乞食故次到其家。",
        "translation": "In the distant past, there was a tileworker who saw a solitary realizer with an illness and went to his house one by one for the sake of begging for food.",
        "source": "T23n1442_043:0865b28_5"
    },
    {
        "source_sentence": "時彼瓦師不識賢聖，遂便捉咽推出棄糞聚中，彼身無力因即命過。",
        "translation": "That master of the tile didn't know the wise and saintly, so he grabbed his throat and pushed it into a pile of dung, which had no power to cause him to die.",
        "source": "T23n1442_043:0865c01_6"
    },
    {
        "source_sentence": "有餘獨覺乘空而度，見其屍骸縱身而下，以諸香花隨時供養。",
        "translation": "Some other pratyekabuddhas were liberated through the air and saw their bodies hovering in the air, and they offered incense and flowers as offerings to the relics at any time.",
        "source": "T23n1442_043:0865c02_7"
    },
    {
        "source_sentence": "瓦師見已具問其故，知是聖人便生憂悔：『我是愚癡不識賢聖。』",
        "translation": "After seeing this, the tile master asked him about it in detail, knowing that this sage was a sage, he became sad and repented, 'I'm ignorant and don't know the noble ones.'",
        "source": "T23n1442_043:0865c04_8"
    },
    {
        "source_sentence": "自知無力能如法焚燒，遂即白王共為禮葬。",
        "translation": "Knowing that they had no power to burn the corpse according to the rules, they immediately reported this to the king and buried it.",
        "source": "T23n1442_043:0865c05_9"
    },
    {
        "source_sentence": "王聞大聖非理涅槃，總命群官及後宮婇女城中士庶，人物駢闐各持蘇油并諸香水，",
        "translation": "When the king heard that the Great Sage had entered nirvana which was not based on reason, he ordered all the officials and the ladies of the palace and women’s quarters in the royal city to bring sour oil and perfume.",
        "source": "T23n1442_043:0865c06_10"
    },
    {
        "source_sentence": "至聖者所焚身供養。",
        "translation": "The supreme sage burns his body and makes offerings.",
        "source": "T23n1442_043:0865c08_11"
    },
    {
        "source_sentence": "時彼瓦師作金色瓶盛其餘骨，置雜彩輿往四衢道側，造窣覩波隨力供養。",
        "translation": "The master of the tile then made a golden vase to contain the remaining bones, placed it in a mixed colored carriage and went to the side of the four roads, making waves as much as they could to make offerings.",
        "source": "T23n1442_043:0865c08_12"
    },
    {
        "source_sentence": "遂發弘願：『我之所作無間重業，勿緣此故墮捺落迦。",
        "translation": "He then made a great vow, 'My unremitting heavy karma won't cause me to fall into naraka because of this.",
        "source": "T23n1442_043:0865c10_13"
    },
    {
        "source_sentence": "以此慇重供養之業，於未來世當得遭遇殊勝大師，親承教旨不生疲厭，",
        "translation": "Because of these debilitating offerings, in the future he will be able to meet a supreme teacher and personally receive his instructions without weariness.",
        "source": "T23n1442_043:0865c11_14"
    },
    {
        "source_sentence": "獲得如是神通自在。』",
        "translation": "They attain such mastery of supernormal abilities.'",
        "source": "T23n1442_043:0865c13_15"
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T23n1442_043:0865c14_0"
    },
    {
        "source_sentence": "彼時瓦師即鄔陀夷，由昔所作惡業餘報，於五百生中常被他殺投之糞聚。",
        "translation": "The tile master then, Udayana, because of the residual retribution of bad actions he did in the past, was always killed by someone else and thrown into a pile of dung for 500 lifetimes.",
        "source": "T23n1442_043:0865c14_1"
    },
    {
        "source_sentence": "由彼供養發願力故，今值遇我成阿羅漢。",
        "translation": "Because of the power of their offerings and vows, they've met me now to become an arhat.",
        "source": "T23n1442_043:0865c15_2"
    },
    {
        "source_sentence": "由此業故雖涅槃後，我與大眾王及人民，悉皆雲集焚身供養。",
        "translation": "Because of this karma, even though it's after nirvāṇa, I, the king of the masses, and my people all gathered together in a cloud to burn their bodies and make offerings.",
        "source": "T23n1442_043:0865c16_3"
    },
    {
        "source_sentence": "「汝等當知！",
        "translation": "You should know!",
        "source": "T23n1442_043:0865c18_4"
    },
    {
        "source_sentence": "又何緣故此鄔陀夷教化人中最為第一？",
        "translation": "For what reason is this upāsikā the foremost among those who teach and transform people?",
        "source": "T23n1442_043:0865c18_5"
    },
    {
        "source_sentence": "於過去世迦攝波佛時，鄔陀夷於彼出家，為大法師善能說法，教化有情無量億數，",
        "translation": "At the time of Kāśyapa Buddha in a past world, Udayana renounced his householder’s life and became a great teacher of the Dharma. He was able to expound the Dharma for immeasurable millions of sentient beings.",
        "source": "T23n1442_043:0865c19_6"
    },
    {
        "source_sentence": "由彼業力於諸眾中教化第一。",
        "translation": "Because of their karmic power, they're the best among all the teachings and transformations.",
        "source": "T23n1442_043:0865c21_7"
    },
    {
        "source_sentence": "是故諸苾芻！",
        "translation": "Therefore, monks!",
        "source": "T23n1442_043:0865c22_8"
    },
    {
        "source_sentence": "當觀如是善惡之報，如影隨形終不亡失，善業勤修惡事當捨，應如是學。」",
        "translation": "You should observe the results of such good and bad actions, which are like shadows that never perish according to form, and diligently cultivate good actions and bad deeds in order to abandon them; you should thus train.",
        "source": "T23n1442_043:0865c22_9"
    },
    {
        "source_sentence": "　食明相今知、　　針筒床脚量、",
        "translation": "The characteristics of food are now known clearly, the dimensions of a needle-tube bed and legs,",
        "source": "T23n1442_043:0865c25_0"
    },
    {
        "source_sentence": "　貯花并坐具、　　瘡雨大師衣。",
        "translation": "He stored flowers, sitting cloth, and the great master's robe for sores and rain.",
        "source": "T23n1442_043:0865c25_0"
    },
    {
        "source_sentence": "第九攝頌曰：食前食後行詣餘家不囑授學處第八十一爾時薄伽梵在室羅伐城逝多林給孤獨園。",
        "translation": "The ninth collection of verses says, Before he eats and after he eats, he goes to another house without entrusting it to the eighth and eleventh places of training.",
        "source": "T23n1442_043:0865c25_0"
    },
    {
        "source_sentence": "時此城中有一長者，大富多財受用豐足。",
        "translation": "At the time, there was an elderly man in this city who was very wealthy and had plenty of possessions to use.",
        "source": "T23n1442_043:0866a01_0"
    },
    {
        "source_sentence": "時具壽鄔波難陀因行乞食至長者家，長者即便持飯施與。",
        "translation": "Upananda Goshou then went to the elder's house because he was begging for food, and the elder gave him food.",
        "source": "T23n1442_043:0866a01_1"
    },
    {
        "source_sentence": "因為說法，施食之人獲五功德，謂壽命、色、力、安樂、詞辯。",
        "translation": "For the sake of preaching the Dharma, a person who gives food obtains five virtues, which are life, form, strength, well-being, and eloquence.",
        "source": "T23n1442_043:0866a03_2"
    },
    {
        "source_sentence": "長者聞已深心歡喜，頂禮其足歸依三寶受五學處。",
        "translation": "After hearing this, the elder was deeply delighted and bowed his head at his feet, relied on the Three Treasures, and accepted the five places of training.",
        "source": "T23n1442_043:0866a04_3"
    },
    {
        "source_sentence": "時鄔波難陀復於他日至長者家，長者白言：「聖者！",
        "translation": "Upananda then went back to the elder's house from another place, and the elder said, Sage!",
        "source": "T23n1442_043:0866a05_4"
    },
    {
        "source_sentence": "我今因大德為善知識故，欲請佛及僧就舍而食。",
        "translation": "Now, because the great virtuous one is a good teacher, I want to invite the Buddha and the saṃgha to my dwelling to eat.",
        "source": "T23n1442_043:0866a06_5"
    },
    {
        "source_sentence": "唯願聖者為我白知。」",
        "translation": "Please let the noble one know it for me.",
        "source": "T23n1442_043:0866a07_6"
    },
    {
        "source_sentence": "時鄔波難陀還至住處，稱長者名為請佛僧。",
        "translation": "Upananda then returned to his dwelling place and called the elder by the name of invited buddhas and monks.",
        "source": "T23n1442_043:0866a08_7"
    },
    {
        "source_sentence": "時鄔波難陀即於晨朝至長者宅，報長者曰：「我有緣事暫至餘家，我若不來不須行食。」",
        "translation": "Upananda then went to the elder's house in the morning and reported to the elder, saying, I have a reason to go to another house for a while, and if I don't come, I won't need to eat.",
        "source": "T23n1442_043:0866a09_8"
    },
    {
        "source_sentence": "作是語已捨之而去。",
        "translation": "After he said this, he abandoned it and departed.",
        "source": "T23n1442_043:0866a11_9"
    },
    {
        "source_sentence": "爾時世尊知彼長者不閑法式不來告白，即便自將大眾詣長者家就其食處。",
        "translation": "Knowing that the elder wasn't at leisurely, the Bhagavān didn't come to confess his confession, he then led the crowd to the elder's house and ate there.",
        "source": "T23n1442_043:0866a11_10"
    },
    {
        "source_sentence": "時諸苾芻報長者曰：「應唱隨意。」",
        "translation": "The monks then reported to the elder, You should sing it as you wish.",
        "source": "T23n1442_043:0866a13_11"
    },
    {
        "source_sentence": "長者即便報言：「聖者！",
        "translation": "The elder then reported, Sage!",
        "source": "T23n1442_043:0866a14_12"
    },
    {
        "source_sentence": "我為大眾設斯座褥。」",
        "translation": "I'll set up this seat mat for the masses.",
        "source": "T23n1442_043:0866a14_13"
    },
    {
        "source_sentence": "佛言：「此即便是作隨意訖，宜應就坐。」",
        "translation": "The Buddha said, Even so, it's appropriate to take a seat after this is done as you wish.",
        "source": "T23n1442_043:0866a15_14"
    },
    {
        "source_sentence": "佛及大眾坐時既久，日復將中不見行食。",
        "translation": "When the Buddha and the great assembly had been seated for a long time, they didn't see food or practices in the midst of the sun.",
        "source": "T23n1442_043:0866a16_15"
    },
    {
        "source_sentence": "佛告阿難陀曰：「汝告長者，日時既至應可行食。",
        "translation": "The Buddha told Ānanda, Tell the elder, 'Now that the sun has arrived, you should go and eat.'",
        "source": "T23n1442_043:0866a18_0"
    },
    {
        "source_sentence": "日時過者食何所為？」",
        "translation": "What's food for those who pass by at the end of the day?",
        "source": "T23n1442_043:0866a19_1"
    },
    {
        "source_sentence": "具壽阿難陀奉教而告長者，報曰：「聖者！",
        "translation": "Gosshou Ānanda followed the instruction and told the elder, saying, Sage!",
        "source": "T23n1442_043:0866a19_2"
    },
    {
        "source_sentence": "鄔波難陀今未來到。」",
        "translation": "Upananda will now come in the future.",
        "source": "T23n1442_043:0866a20_3"
    },
    {
        "source_sentence": "如是至三，阿難陀曰：「若鄔波難陀不來者不欲行食耶？」",
        "translation": "Up to three times like this, Ānanda said, If Upananda doesn't come, won't he want to eat?",
        "source": "T23n1442_043:0866a20_4"
    },
    {
        "source_sentence": "報言：「如是。」",
        "translation": "He replied, So it is.",
        "source": "T23n1442_043:0866a22_5"
    },
    {
        "source_sentence": "具壽阿難陀以事白佛，爾時世尊說伽他曰。",
        "translation": "Kauṣṭhila Ānanda told the Buddha about this, and the Bhagavān then said to Kātyāyana.",
        "source": "T23n1442_043:0866a22_6"
    },
    {
        "source_sentence": "「由他悉皆苦，　　自由便受樂，",
        "translation": "Because all others are painful, they experience pleasure freely.",
        "source": "T23n1442_043:0866a24_0"
    },
    {
        "source_sentence": "　共有皆闕事，　　智者不應為。」",
        "translation": "They all lack things in common, and the wise shouldn't do them.",
        "source": "T23n1442_043:0866a25_0"
    },
    {
        "source_sentence": "時欲將中鄔波難陀方始來至，遂便行食。",
        "translation": "He then wanted to go to Upananda in the middle before he arrived, so he went out to eat.",
        "source": "T23n1442_043:0866a26_0"
    },
    {
        "source_sentence": "時諸苾芻有噉少許、有不食者，佛為長者說施頌已從座而去，鄔波難陀即於此住不往寺中。",
        "translation": "When there were some monks who had a little anger and those who didn't eat, the Buddha left his seat after speaking the verse of generosity to the elder, and Upananda stayed here and didn't go to the temple.",
        "source": "T23n1442_043:0866a26_1"
    },
    {
        "source_sentence": "當時是十五日眾僧欲作褒灑陀，唯鄔波難陀不來赴集，復無持欲人，眾皆久坐妨廢法事，",
        "translation": "It was the fifteenth day at that time when all the monks wished to perform the prātimokṣatra. Upananda alone did not come to the assembly, and there were no companions in the holy life who desired it. All the monks sat for a long time preventing them from doing their religious duties.",
        "source": "T23n1442_043:0866a29_2"
    },
    {
        "source_sentence": "求覓不得令眾疲勞。",
        "translation": "Seeking to find it doesn't cause the crowd to tire.",
        "source": "T23n1442_043:0866b02_3"
    },
    {
        "source_sentence": "時諸苾芻共生嫌賤作如是語：「云何苾芻受食家請，食前食後而不速來，",
        "translation": "The monks then became disgusted with each other and said, How is it that a monk accepts an invitation to eat at home and doesn't come quickly after eating before or after he eats?",
        "source": "T23n1442_043:0866b02_4"
    },
    {
        "source_sentence": "久住俗舍？」",
        "translation": "Have you lived in a secular dwelling for a long time?",
        "source": "T23n1442_043:0866b04_5"
    },
    {
        "source_sentence": "以緣白佛，佛言：「食前食後有此過生，乃至我觀十利，為諸弟子制其學處，",
        "translation": "He therefore said to the Buddha, “There will not be another existence.” The Buddha replied: There will not be another existence.",
        "source": "T23n1442_043:0866b04_6"
    },
    {
        "source_sentence": "應如是說：「若復苾芻受食家請，食前食後行詣餘家者，波逸底迦。」",
        "translation": "You should explain it this way, 'Suppose another monk accepts an invitation from a food house and goes to another house before he eats or after he eats, pratyekabuddha.'",
        "source": "T23n1442_043:0866b06_7"
    },
    {
        "source_sentence": "如是世尊為諸苾芻制其學已。",
        "translation": "Thus, the Bhagavān instructed the monks to train them.",
        "source": "T23n1442_043:0866b09_0"
    },
    {
        "source_sentence": "時有看病苾芻廢其瞻視，知僧事者撿校有闕。",
        "translation": "A sick monk who was attending the monk then abandoned his supervision, knowing that the monk in charge of the saṃgha had a deficiency in examining it.",
        "source": "T23n1442_043:0866b09_1"
    },
    {
        "source_sentence": "時諸苾芻以緣白佛，佛聞此已告諸苾芻：「前是創制，今復隨開，應如是說：「若復苾芻受食家請，",
        "translation": "The monks then reported this to the Buddha for his sake. Having heard these words, the Buddha told the monks, Formerly it was a new ordination but now it has been reopened. You should explain in this way:",
        "source": "T23n1442_043:0866b10_2"
    },
    {
        "source_sentence": "食前食後行詣餘家，不囑授者，波逸底迦。」",
        "translation": "If someone goes to another house before they eat or after they eat and doesn't entrust it, pratyekabuddha.",
        "source": "T23n1442_043:0866b13_3"
    },
    {
        "source_sentence": "若復苾芻者，謂鄔波難陀，餘義如上。",
        "translation": "If another monk is Upananda, the rest are as above.",
        "source": "T23n1442_043:0866b15_0"
    },
    {
        "source_sentence": "食家請者，謂被他喚食家義如上。",
        "translation": "Those who are invited by the food family mean that they're called by others to the food family as above.",
        "source": "T23n1442_043:0866b15_1"
    },
    {
        "source_sentence": "食前者，謂是午前。",
        "translation": "Before you eat, it's called morning.",
        "source": "T23n1442_043:0866b16_2"
    },
    {
        "source_sentence": "若出行時過二家者，便得墮罪。",
        "translation": "If someone goes beyond the two houses at the time of travel, they'll fall into sin.",
        "source": "T23n1442_043:0866b17_0"
    },
    {
        "source_sentence": "食後者，謂過午已後。",
        "translation": "“After the meal”: After having gone beyond noon.",
        "source": "T23n1442_043:0866b17_1"
    },
    {
        "source_sentence": "若出行時過三家者，便得墮罪。",
        "translation": "If someone goes beyond the three houses at the time of travel, they'll fall into sin.",
        "source": "T23n1442_043:0866b18_2"
    },
    {
        "source_sentence": "不囑授者，謂不報人，應囑施主云：「我往某處。」",
        "translation": "Someone who doesn't entrust means someone who doesn't repay the donor and should entrust the donor with the task, saying, I'll go to a certain place.",
        "source": "T23n1442_043:0866b18_3"
    },
    {
        "source_sentence": "或囑苾芻云：「向某處。」",
        "translation": "Or he might ask a monk to tell him, To a certain place.",
        "source": "T23n1442_043:0866b19_4"
    },
    {
        "source_sentence": "結罪如上。",
        "translation": "The binding sins are as above.",
        "source": "T23n1442_043:0866b20_5"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1442_043:0866b20_6"
    },
    {
        "source_sentence": "若苾芻受食家請，食前行過二家，食後行過三家，不囑授得墮罪。",
        "translation": "If a monk who receives an invitation from a food house and goes beyond the two houses before he eats and goes beyond the three houses after eating without being instructed to do so, he'll fall into sin.",
        "source": "T23n1442_043:0866b21_7"
    },
    {
        "source_sentence": "若不以此苾芻為先首，而請喚者無犯。",
        "translation": "If he doesn't make this monk the first to lead, and invites him to call it, it's not a violation.",
        "source": "T23n1442_043:0866b22_8"
    },
    {
        "source_sentence": "又無犯者，謂初犯人，廣說如上。",
        "translation": "Also, no offense refers to the first offender, which is explained in detail above.",
        "source": "T23n1442_043:0866b23_9"
    },
    {
        "source_sentence": "根本說一切有部毘奈耶卷第四十三",
        "translation": "Mūlasarvâstivāda-vinaya, vol. 43",
        "source": "T23n1442_043:0866b25_0"
    }
]