[
    {
        "source_sentence": "續薩婆多毘尼毘婆沙序",
        "translation": "Preface to the Continued Sarvâstivāda-vinaya-vibhāṣā",
        "source": "T23n1440_009:0558c16_0"
    },
    {
        "source_sentence": "西京東禪定沙門智首撰",
        "translation": "Compiled by the ascetic Zhixiu, a practitioner of the Western Capital's Eastern Meditation",
        "source": "T23n1440_009:0558c18_0"
    },
    {
        "source_sentence": "世雄息化、律藏枝分，遂使天竺聖人隨部別釋。",
        "translation": "As a result, the worldly heroes stopped teaching and divided the branches of the vinaya collection so that the sages of India would interpret them separately according to their divisions.",
        "source": "T23n1440_009:0558c19_0"
    },
    {
        "source_sentence": "自佛教東流年代綿久，西土律論頗傳此方，然此薩婆多即解其十誦。",
        "translation": "Since the Buddhist teachings had spread to the east for a long time, the Vinaya and Vinaya treatises of the Western lands were widely transmitted in this direction. The Sarvāstivāda master understood the ten recitations [of the sutra].",
        "source": "T23n1440_009:0558c20_1"
    },
    {
        "source_sentence": "智首宿緣積善、早預緇門，始進戒品，即為毘尼藏學。",
        "translation": "Zhixiang, the constellation of the head of wisdom, had accumulated goodness as a condition and was early in the approach of precepts, and when he began to advance in the category of precepts, that's when he studied the Vinaya.",
        "source": "T23n1440_009:0558c21_2"
    },
    {
        "source_sentence": "至於諸律諸論每備披尋，常慨斯論要妙而文義闕少。",
        "translation": "As for the various vinayas and treatises, he always prepared a list of them and often regretted that these treatises were subtle in essence but lacking in text and meaning.",
        "source": "T23n1440_009:0558c22_3"
    },
    {
        "source_sentence": "乃至江左淮右爰及關西，諸有藏經皆親檢閱，悉同彫落罕有具者。",
        "translation": "To the left of the river, to the right of the Huai River and to the west of the pass, all the collections of Buddhist scriptures were preserved and revised in person. All had the same carving but there were rarely any copyists who possessed them.",
        "source": "T23n1440_009:0558c24_4"
    },
    {
        "source_sentence": "雖復求之彌懇，而緣由莫測，每恨殘缺、滯於譯人，靜言思此恒深悲歎。",
        "translation": "Even though his requests were more sincere, he could not fathom the reason for them. Every time he hated the translators because of their incompetence and was constantly saddened by the obstacles they encountered. He always spoke quietly about this matter with deep sorrow and lamentation.",
        "source": "T23n1440_009:0558c25_5"
    },
    {
        "source_sentence": "比奉詔旨來居禪定，幸逢西蜀寶玄律師共談此論，闕義玄言本鄉備有。",
        "translation": "In accordance with the imperial edict, he came to live in meditation and was fortunate to have an interview with the Vinaya Master Baoxuan of the Western Regions who discussed this treatise together. The profound theories were missing from his native land but they were all found in it.",
        "source": "T23n1440_009:0558c27_6"
    },
    {
        "source_sentence": "非意聞之，不勝慶躍，於是慇懃三覆問其所由，方知此典譯在於蜀，若依本翻有其九卷。",
        "translation": "When he did not wish to hear it, he was overjoyed and jumped for joy. So he asked the Master three times in vain what had happened so that he could only know that the transla­ tation of this scripture took place in Shu (in present-day Shanxi province) and that there were nine fascicles if we take the original translation as the source.",
        "source": "T23n1440_009:0558c29_7"
    },
    {
        "source_sentence": "往因魏世道武殄滅法門，乃令茲妙旨首末零落，遂使四方皆傳闕本，其真言圓備尚蘊成都。",
        "translation": "Formerly, when the Daoist Emperor Wu of the Wei dynasty suppressed the Buddhist teachings, he ordered this marvelous doctrine to be transmitted in all four directions without a copy, and his true sayings were complete and included in Chengdu.",
        "source": "T23n1440_009:0559a02_8"
    },
    {
        "source_sentence": "智首乃託卭僰行人、井絡良信，經涉三周所願方果。",
        "translation": "Zhixiu then entrusted it to the practitioners and well-versed people who believed in Buddhism. The scriptures were translated in three cycles, so as to fulfill their wishes.",
        "source": "T23n1440_009:0559a04_9"
    },
    {
        "source_sentence": "以皇隋之馭天下二十六載大業二年歲次丙寅冬十二月，躬獲此本，傳之京邑。",
        "translation": "In the twenty-sixth year of Emperor Sui’s rule over the empire, in the twelfth month in the winter of the second year of the Daye period (557–557 C.E.",
        "source": "T23n1440_009:0559a05_10"
    },
    {
        "source_sentence": "智首深願流茲覺水、散此慧燈，悟彼學徒、補其法寶。",
        "translation": "The profound vow of the head of wisdom is to flow this water of awakening and scatter this lamp of wisdom, enlighten those students and replenish their treasures of the Dharma.",
        "source": "T23n1440_009:0559a07_11"
    },
    {
        "source_sentence": "已有一本，附齊州神通寺僧沙禪師，令於海岱之間諸藏傳寫。",
        "translation": "There was already a copy of this book, which had been entrusted to the Chan Master Sengsha of Shentong Monastery in Qizhou and ordered copies to be transmitted from one collection to another in Haidai.",
        "source": "T23n1440_009:0559a08_12"
    },
    {
        "source_sentence": "猶恨晉魏燕趙未獲流布，相州靜洪律師毘尼匠主，復是智首生年躬蒙訓導，今謹附一本屈傳之河朔。",
        "translation": "I am still hating the fact that Yan Zhao of the Jin and Wei dynasties had not been able to circulate it. The Vinaya master Jing Hong, a lawyer from Xiangzhou, who was also the founder of Vinaya Master [Daosun’s] faculty of Vinaya Lawyer, once again received instruction and guidance in his own lifetime from Zhixiong (i.e., Zhi",
        "source": "T23n1440_009:0559a10_13"
    },
    {
        "source_sentence": "故具述由序標之卷初，願尋覽諸賢無猜惑也。",
        "translation": "That's why it's described in detail in the first volume of the preface, wanting to discern the wise without doubt.",
        "source": "T23n1440_009:0559a12_14"
    },
    {
        "source_sentence": "薩婆多毘尼毘婆沙卷第九",
        "translation": "*Sarvâstivāda-vinaya-vibhāsā, vol. 9",
        "source": "T23n1440_009:0559a16_0"
    },
    {
        "source_sentence": "失譯人名今附秦錄",
        "translation": "The names of the lost translators are now appended to the Qin records.",
        "source": "T23n1440_009:0559a18_0"
    },
    {
        "source_sentence": "九十事第六十九",
        "translation": "The Sixty-sixth of the Ninety Deeds",
        "source": "T23n1440_009:0559a19_0"
    },
    {
        "source_sentence": "謗人犯重，偷蘭遮。",
        "translation": "A person who denigrates someone and commits a serious offense is called a pārājika.",
        "source": "T23n1440_009:0559a20_0"
    },
    {
        "source_sentence": "犯突吉羅向一人謗，亦犯。",
        "translation": "A person who violates the precepts and denigrates one person to another person in a tukhāra also violates them.",
        "source": "T23n1440_009:0559a20_1"
    },
    {
        "source_sentence": "九十事第七十",
        "translation": "The Seventy-seventh of the Ninety Deeds",
        "source": "T23n1440_009:0559a21_0"
    },
    {
        "source_sentence": "女人同道行者，上制尼，此制白衣女也。",
        "translation": "A woman who practices the same path as a practitioner is a nun, and this is a white-robed woman under the precepts.",
        "source": "T23n1440_009:0559a22_0"
    },
    {
        "source_sentence": "義如上尼中無異也。",
        "translation": "The meaning is as explained in the above-mentioned nun's book, there's no difference.",
        "source": "T23n1440_009:0559a22_1"
    },
    {
        "source_sentence": "若共多女，犯多也。",
        "translation": "If they share many women, it's a violation of many.",
        "source": "T23n1440_009:0559a23_2"
    },
    {
        "source_sentence": "九十事第七十一",
        "translation": "ninety-eighth and seventy-first matters",
        "source": "T23n1440_009:0559a24_0"
    },
    {
        "source_sentence": "賊共行者，袈裟，秦言染也；",
        "translation": "The common practitioner of thieves is the reddish-brown robe, which is the Sanskrit for dye.",
        "source": "T23n1440_009:0559a25_0"
    },
    {
        "source_sentence": "結愛等亦名染。",
        "translation": "The bonds of desire and so forth are also called defilement.",
        "source": "T23n1440_009:0559a25_1"
    },
    {
        "source_sentence": "著此服者，在獸不令其畏，是故獵師喜假服之。",
        "translation": "A person wearing this robe doesn't cause fear in animals; therefore, the hunter likes to take it nominally.",
        "source": "T23n1440_009:0559a26_0"
    },
    {
        "source_sentence": "後令獸遠見比丘便生畏心，遠而避之。",
        "translation": "Later, he caused the animals to see the monk from a distance and became frightened, so they avoided him from a distance.",
        "source": "T23n1440_009:0559a27_1"
    },
    {
        "source_sentence": "與賊行亦爾，是以人見比丘共賊行便生不信，是故佛制。",
        "translation": "It's likewise with the act of a thief because when someone sees a monk who acts together with a thief, they become disbelieving, which is why the Buddha disciplines them.",
        "source": "T23n1440_009:0559a27_2"
    },
    {
        "source_sentence": "九十事第七十二",
        "translation": "ninety-seventh and seventy-second parts of the Vinaya",
        "source": "T23n1440_009:0559b01_0"
    },
    {
        "source_sentence": "不滿二十年中人，若不滿二十、自想不滿，不得戒者，真實不滿乃至無十九故，所以不得戒也。",
        "translation": "If someone who doesn't reach 20 years of age and doesn't attain the precepts if they don't reach 20 and don't realize it for themselves, then they won't attain the precepts because they really aren't fulfilled up to 19 years old, which is why they won't attain them.",
        "source": "T23n1440_009:0559b02_0"
    },
    {
        "source_sentence": "胡本十九得戒者，不如秦也，要數日滿，為年下不滿得戒者，以母胎足故也。",
        "translation": "The Hu people who had received the precepts at the age of nineteen were not as good as those in the Qin dynasty, but it took a few days for them to do so. It is because they did not receive the precepts when their mother’s embryo was still alive.",
        "source": "T23n1440_009:0559b04_1"
    },
    {
        "source_sentence": "共事者，說戒羯磨等。",
        "translation": "The common service is preaching the precepts, such as the kalpa of morality.",
        "source": "T23n1440_009:0559b05_2"
    },
    {
        "source_sentence": "共住得罪者，以過二宿也，若歲滿日少亦得也。",
        "translation": "A person who lives together and commits a sin is guilty because he goes beyond the two constellations, and if he's old and young at the end of his life, he'll be guilty.",
        "source": "T23n1440_009:0559b06_3"
    },
    {
        "source_sentence": "若人滿二十、自想滿二十，僧中問云不滿者，有二種：一誤若忘此人得戒；",
        "translation": "If someone is over twenty years old and thinks he is over twenty. The Saṃkhya asks, “They are dissatisfied” but there are two kinds:",
        "source": "T23n1440_009:0559b07_4"
    },
    {
        "source_sentence": "二意不欲受，師強與故說不滿，此人不得戒。",
        "translation": "The second is that the mind doesn't want to accept it, and the teacher forcibly gives it to someone who says it's dissatisfied because it's said to be dissatisfied, but this person won't receive the precepts.",
        "source": "T23n1440_009:0559b09_0"
    },
    {
        "source_sentence": "年六十不得受大戒，設師僧強授亦不得，以其人不任堪苦行道。",
        "translation": "When he was 60 years old, he couldn't receive the great precepts, and even if his teacher or monk forcibly taught them to him, because that person wouldn't be allowed to follow the path of ascetic practice.",
        "source": "T23n1440_009:0559b10_0"
    },
    {
        "source_sentence": "又心智鈍弱，唯聽為沙彌。",
        "translation": "Also, his mind and wisdom are weak, so he's only heard that he's a novice.",
        "source": "T23n1440_009:0559b11_1"
    },
    {
        "source_sentence": "七歲以下亦不聽度，度受戒，俱突吉羅。",
        "translation": "When he's less than seven years old, he won't be disciplined, but when he's disciplined and receives the precepts, it's a grave offense.",
        "source": "T23n1440_009:0559b12_2"
    },
    {
        "source_sentence": "僧祇家有觀相貌義。",
        "translation": "The Saṃkhya school has the meaning of contemplating appearances.",
        "source": "T23n1440_009:0559b13_0"
    },
    {
        "source_sentence": "年未滿二十不聽者，以其輕躁不耐寒苦，若受大戒人多呵責。",
        "translation": "If someone under the age of 20 doesn't listen because they're light and agitated and can't endure cold and pain, those who receive the great precepts will often be rebuked if they're disciplined.",
        "source": "T23n1440_009:0559b13_1"
    },
    {
        "source_sentence": "若是沙彌，人則不呵故也。",
        "translation": "If he's a novice, people won't criticize him.",
        "source": "T23n1440_009:0559b14_2"
    },
    {
        "source_sentence": "尼十二得者，為夫家所使，任忍眾苦，加厭本事也。",
        "translation": "The twelve attainments of nuns are those who are entrusted by their husband's family, tolerate the many sufferings and become disillusioned with their original duties.",
        "source": "T23n1440_009:0559b15_3"
    },
    {
        "source_sentence": "九十事第七十三",
        "translation": "ninety-seventh of the seventy-third",
        "source": "T23n1440_009:0559b17_0"
    },
    {
        "source_sentence": "掘地中生地者，胡本云實地。",
        "translation": "Someone who digs up the ground and produces a ground in it, which is originally called real ground in the Hu scriptures.",
        "source": "T23n1440_009:0559b18_0"
    },
    {
        "source_sentence": "不生者，云不實地。",
        "translation": "Those who don't arise are called the ground of insubstantiality.",
        "source": "T23n1440_009:0559b18_1"
    },
    {
        "source_sentence": "四月及八月此是雨時，地相連著潤勢相淹，能生草木故，義名生地。",
        "translation": "In the fourth month and in the eighth month, when it rains, the soil is connected to the earth and moistened by the water. It produces grass and trees; this is why it is called producing soil.",
        "source": "T23n1440_009:0559b19_2"
    },
    {
        "source_sentence": "餘無雨時，日炙乾燥風吹土起，而不生草故，義名不生地也。",
        "translation": "When there's no rain in the rest, the sun roasts dry and wind blows to produce dirt, but grass doesn't grow, which means it doesn't grow.",
        "source": "T23n1440_009:0559b20_3"
    },
    {
        "source_sentence": "若觸此上乾土，犯突吉羅。",
        "translation": "If someone touches dry land above here, it's a violation of the gravel offense.",
        "source": "T23n1440_009:0559b22_0"
    },
    {
        "source_sentence": "下侵濕地，犯墮。",
        "translation": "It's a violation to enter the wet land below.",
        "source": "T23n1440_009:0559b22_1"
    },
    {
        "source_sentence": "牆根齊築處，不犯，以異於地故。",
        "translation": "It's not a violation to build the wall facing each other because it's different from the ground.",
        "source": "T23n1440_009:0559b22_2"
    },
    {
        "source_sentence": "地雖築治，若濕相淹，發犯墮。",
        "translation": "Even though the earth is built and healed, if it's submerged in moisture, it becomes a violation to fall.",
        "source": "T23n1440_009:0559b23_3"
    },
    {
        "source_sentence": "凡欲取菜草土，當遙言某處有好者淨來，若到邊指示，犯也。",
        "translation": "Whenever he wants to take vegetables, grass, or dirt, he'll say there's a good person from a distance who's coming cleanly. If he goes to the side and tells them, it's a violation.",
        "source": "T23n1440_009:0559b24_4"
    },
    {
        "source_sentence": "蟻封雨時犯突吉羅，以非根本實地故。",
        "translation": "When an ant is sealed by rain, it's a violation of the grave offense because it's not the root real ground.",
        "source": "T23n1440_009:0559b25_5"
    },
    {
        "source_sentence": "若中生草，觸草犯墮，封土犯突吉羅。",
        "translation": "If grass grows in the middle, touching grass is a violation of falling, and sealing dirt is a violation of purgatory.",
        "source": "T23n1440_009:0559b26_6"
    },
    {
        "source_sentence": "所以犯突者，有少相連分故。",
        "translation": "The reason for violating the precepts is that there are few distinctive parts.",
        "source": "T23n1440_009:0559b27_7"
    },
    {
        "source_sentence": "泥下地，犯墮。",
        "translation": "It's a violation to fall down on the ground in mud.",
        "source": "T23n1440_009:0559b28_8"
    },
    {
        "source_sentence": "屋上牆上生草，如蟻封通覆處地若土，起犯突及下地犯墮。",
        "translation": "The grass growing on the wall above the house is like an ant seal that penetrates and covers the ground or soil, which gives rise to violations and falls down from the lower ground.",
        "source": "T23n1440_009:0559b28_9"
    },
    {
        "source_sentence": "九十事第七十四",
        "translation": "ninety-eight (seventy-four) matters",
        "source": "T23n1440_009:0559c01_0"
    },
    {
        "source_sentence": "四月請中，佛遮非時非親里乞。",
        "translation": "In the fourth month, when he was invited, the Buddha stopped begging at an ungodly hour and didn't go to his relatives.",
        "source": "T23n1440_009:0559c02_0"
    },
    {
        "source_sentence": "六群以釋摩男是親故，四月竟已從乞，以非時非法呵責，強索故制之。",
        "translation": "Because the six groups of people thought Śākyamuni's man was their relative, they begged him after the fourth month ended and unlawfully reprimanded him at an ungodly hour and forcibly asked to restrain him.",
        "source": "T23n1440_009:0559c02_1"
    },
    {
        "source_sentence": "以數數請者，或請主官事怱懅，不如所請後更請；",
        "translation": "Someone who repeatedly invites by means of numerous invitations sometimes invites the chief official to attend to him or her, not as frequently as he or she would be invited.",
        "source": "T23n1440_009:0559c04_2"
    },
    {
        "source_sentence": "或二月已盡，後有財，更請二月；",
        "translation": "Or, when the duration of two months has expired and there is some wealthy person who wishes to extend it for another two months.",
        "source": "T23n1440_009:0559c05_3"
    },
    {
        "source_sentence": "或多財人數數請故。",
        "translation": "It's because they may have a lot of possessions and are invited by many people.",
        "source": "T23n1440_009:0559c06_4"
    },
    {
        "source_sentence": "事不一同。",
        "translation": "The things aren't the same.",
        "source": "T23n1440_009:0559c06_5"
    },
    {
        "source_sentence": "三時之中隨請，若夏初請夏中受，若夏半來請不盡四月則并入冬分受，餘時亦爾。",
        "translation": "In the three seasons, it follows the invitation at the beginning of summer and is accepted in the middle of summer. If an invitation doesn't end in the fourth month after the half-moon of summer and enters into the winter season to accept it, the same goes for the other seasons.",
        "source": "T23n1440_009:0559c06_6"
    },
    {
        "source_sentence": "別請者，私請大德人，不犯也。",
        "translation": "It's not a violation to invite someone else who privately invites a great virtuous person.",
        "source": "T23n1440_009:0559c08_7"
    },
    {
        "source_sentence": "九十事第七十五",
        "translation": "ninety-fifth of the seventy-five rituals",
        "source": "T23n1440_009:0559c10_0"
    },
    {
        "source_sentence": "結同戒者，若二部同戒，必於大僧中結，後令大比丘告尼，以女人賤當從大僧受故。",
        "translation": "If the two parts of the precepts are the same, they must be fettered in the great saṃgha, and then he causes the great monks to tell the nuns that women who are inferior will receive them from the great saṃgha.",
        "source": "T23n1440_009:0559c11_0"
    },
    {
        "source_sentence": "若獨結尼戒，就二部中也，或因尼起同、或因比丘起同、或俱因起不同。",
        "translation": "If the precepts for nuns alone are fettered, it's in two parts, either because they give rise to the same thing as nuns, or because they give rise to the same thing as monks, or both give rise to different things.",
        "source": "T23n1440_009:0559c12_1"
    },
    {
        "source_sentence": "修多羅者，四阿含及二百五十戒。",
        "translation": "The sūtra refers to the four Āgamas and the two hundred and fifty precepts.",
        "source": "T23n1440_009:0559c14_2"
    },
    {
        "source_sentence": "毘尼者，言折伏，以能折伏貪恚癡故，諸律是也。",
        "translation": "Vinaya means to subdue because it can subdue craving, ill-will, and delusion, which are the precepts.",
        "source": "T23n1440_009:0559c15_3"
    },
    {
        "source_sentence": "摩多勒伽者，善擇諸法相義，有似阿毘曇也。",
        "translation": "Mathurika refers to the meaning of skillfully discriminating the characteristics of dharmas, which resembles the abhidharma.",
        "source": "T23n1440_009:0559c16_4"
    },
    {
        "source_sentence": "毘婆沙者，云阿毘曇及戒僧一，是以明義相、論色非色、教非教等故也。",
        "translation": "The Vibhāṣā says that the abhidharma and the precepts are one, so it's because they clarify the meaning and characteristics, discuss form and formlessness, teach and not teach, and so forth.",
        "source": "T23n1440_009:0559c17_5"
    },
    {
        "source_sentence": "及入毘尼經者，餘經中諸說戒處是。",
        "translation": "and the entry into the Vinaya, which are the places where the precepts are taught in other scriptures.",
        "source": "T23n1440_009:0559c19_6"
    },
    {
        "source_sentence": "云若以此經中戒向未受大戒說，犯突，要心口輕其人不來聽戒，犯；",
        "translation": "It is said that if, in this sūtra, the precepts are directed toward those who have not received the Great Precepts and preached them, it is a violation to violate [the precepts].",
        "source": "T23n1440_009:0559c20_0"
    },
    {
        "source_sentence": "若有餘事不來，無苦。",
        "translation": "If there are other things that don't come, there's no suffering.",
        "source": "T23n1440_009:0559c21_1"
    },
    {
        "source_sentence": "九十事第七十六",
        "translation": "ninety-seventh and sixty-sixth matters",
        "source": "T23n1440_009:0559c23_0"
    },
    {
        "source_sentence": "往聽鬪諍犯者，以能破佛法令僧為二部，是故制諍後聽者犯。",
        "translation": "A person who goes to listen to a dispute and violates the precepts because he can break the Buddha's teachings and make the saṃgha into two groups, so he restrains those who listen later from violating them.",
        "source": "T23n1440_009:0559c24_0"
    },
    {
        "source_sentence": "所以在高下處聽犯者，以諍事重故，故不同說戒布薩羯磨等也。",
        "translation": "It's because the offenders are heard to violate the precepts at higher and lower heights because of the seriousness of their deeds, so it's not the same as teaching the precepts, rules, upāsaka, karma, etc.",
        "source": "T23n1440_009:0559c25_1"
    },
    {
        "source_sentence": "此中諍人及餘不諍人來聽，及向人說不說，皆犯。",
        "translation": "Here, it's a violation for an angry person or another person who doesn't have anger to come and listen, or for someone who teaches or doesn't teach.",
        "source": "T23n1440_009:0559c26_2"
    },
    {
        "source_sentence": "九十事第七十七",
        "translation": "ninety-seventh of the seventy-seventh deeds",
        "source": "T23n1440_009:0559c29_0"
    },
    {
        "source_sentence": "僧斷事時默然起去中，若但明白白二白四羯磨者，以百一羯磨入此三中故。",
        "translation": "When the saṃgha stops doing things, it's silently rising and leaving in the middle, but if it only explains the two white and four karmas, it's because the one hundred and one karmas enter these three.",
        "source": "T23n1440_009:0560a01_0"
    },
    {
        "source_sentence": "輕事白羯磨、中事白二、重事白四，說此三羯磨時，若起去犯墮，餘非羯磨事起去犯突。",
        "translation": "When he explains these three karmas, if he gives rise to the practice of going and violates them, the other non-karmic karmas give rise to the practice of going and violating them.",
        "source": "T23n1440_009:0560a02_1"
    },
    {
        "source_sentence": "九十事第七十八",
        "translation": "ninety-eighth of the seventy-eight rituals",
        "source": "T23n1440_009:0560a05_0"
    },
    {
        "source_sentence": "不恭敬者，胡云惱他也。",
        "translation": "Someone who doesn't venerate is said to harm others.",
        "source": "T23n1440_009:0560a06_0"
    },
    {
        "source_sentence": "凡四事惱他：與記識已、師及於已是上座，語令莫作是事，初順言不作，後作一也。",
        "translation": "These are the four things that harm others: giving instructions to consciousnesses, teachers, and superiors who have already done these things, telling them not to do them, first agreeing with what they say and not doing it, and then doing one thing.",
        "source": "T23n1440_009:0560a06_1"
    },
    {
        "source_sentence": "二逆言當作犯墮。",
        "translation": "The second is to say that it's a violation and a fall.",
        "source": "T23n1440_009:0560a08_2"
    },
    {
        "source_sentence": "惱下坐犯突。",
        "translation": "He was disturbed and sat down to violate the precepts.",
        "source": "T23n1440_009:0560a08_3"
    },
    {
        "source_sentence": "未與記時有二事，唯犯突也。",
        "translation": "When he doesn't give the assurance, there are two things, but it's a violation of the precepts.",
        "source": "T23n1440_009:0560a09_4"
    },
    {
        "source_sentence": "九十事第七十九",
        "translation": "ninety-seventh of the seventy-nine rituals",
        "source": "T23n1440_009:0560a10_0"
    },
    {
        "source_sentence": "飲酒中，凡有酒香、酒味、醉，此三中若飲一，犯墮也。",
        "translation": "Among drinking alcohol, where there's the fragrance of alcohol, the taste of alcohol, and drunkenness, it's a violation to drink one of these three.",
        "source": "T23n1440_009:0560a11_0"
    },
    {
        "source_sentence": "噉麴犯者，云此麴以麥及藥草以酒和，臥之後乾持行，和水飲之，能令人醉者也。",
        "translation": "A person who commits the offense of liquor says this liquor is mixed with wheat and medicinal herbs to make wine, dried up after lying down and carried away, blended with water to drink it, which will make him drunk.",
        "source": "T23n1440_009:0560a12_1"
    },
    {
        "source_sentence": "餘麴無犯也。",
        "translation": "The rest of the wine is not a violation.",
        "source": "T23n1440_009:0560a14_0"
    },
    {
        "source_sentence": "若過是罪者，此酒極重，飲之者能作四逆，除破僧逆，以破僧要當自稱為佛故。",
        "translation": "If someone goes beyond this offense, this wine is extremely heavy, and those who drink it can commit four heinous crimes, except for the one who breaks the saṃgha's prohibition, because they will call themselves buddhas if they break the saṃgha's precepts.",
        "source": "T23n1440_009:0560a14_1"
    },
    {
        "source_sentence": "亦能破一切戒及餘眾惡也。",
        "translation": "It can also break all the precepts and other bad qualities.",
        "source": "T23n1440_009:0560a16_2"
    },
    {
        "source_sentence": "九十事第八十",
        "translation": "The Eighty-eighth of the Ninety Deeds",
        "source": "T23n1440_009:0560a17_0"
    },
    {
        "source_sentence": "非時入聚落中，明在阿練若處者，有檀越近聚落外作住處、學問處及阿練若處。",
        "translation": "If someone enters a village at an ungodly hour and explains that they're in a place of forest or forest dwelling, there's a donor who goes near a village to make a living, a place of training, or a place of forest dwelling.",
        "source": "T23n1440_009:0560a18_0"
    },
    {
        "source_sentence": "有遠阿練若住畏賊故，近聚落作僧藏也。",
        "translation": "Because there are people who live in distant forests because they're afraid of thieves, they make a monk's store near the village.",
        "source": "T23n1440_009:0560a19_1"
    },
    {
        "source_sentence": "若寺在聚落外，不白出寺至城門，犯突。",
        "translation": "If a temple is outside a village and doesn't leave without telling the monastery to go to the city gates, it's a violation to enter.",
        "source": "T23n1440_009:0560a20_2"
    },
    {
        "source_sentence": "又云，入聚落內時，若總白入聚落，後到隨意所至也。",
        "translation": "It's also said that when he enters a village inside a village, if he enters the village with a general statement, he'll go there as he wishes.",
        "source": "T23n1440_009:0560a21_3"
    },
    {
        "source_sentence": "若別相白、若先不白隨見異寺比丘白，無犯。",
        "translation": "If they confess separately, or if they don't confess first and follow the monks of a different temple to confess when they see them, it's not a violation.",
        "source": "T23n1440_009:0560a23_0"
    },
    {
        "source_sentence": "九十事第八十一",
        "translation": "ninety-eighth and eighty-first matters",
        "source": "T23n1440_009:0560a25_0"
    },
    {
        "source_sentence": "食前後者，此為檀越家比丘結也。",
        "translation": "Those who eat before and after this are the bonds of the monks of the donor's household.",
        "source": "T23n1440_009:0560a26_0"
    },
    {
        "source_sentence": "緣跋難陀出百兩金錢、百兩貯畜、百兩飲食。",
        "translation": "Conditioned by Upananda, he gave a hundred taels of money, a hundred taels of stores, and a hundred taels of food and drink.",
        "source": "T23n1440_009:0560a26_1"
    },
    {
        "source_sentence": "此施主所以請佛及僧，欲在僧中從其乞生。",
        "translation": "This donor therefore invites the Buddha and the saṃgha to be born among the saṃgha because he wants to beg for them.",
        "source": "T23n1440_009:0560a27_2"
    },
    {
        "source_sentence": "然知其欲乞故先至已，餘行晚來，因制戒也。",
        "translation": "Knowing that he wanted to beg, however, he arrived beforehand and came late in the other directions, so he established the precepts.",
        "source": "T23n1440_009:0560a28_3"
    },
    {
        "source_sentence": "檀越道人設食，日晨白，僧往不犯。",
        "translation": "The donor monks and nuns offered food to the saṃgha in the morning, but it was not a violation when the saṃgha went there.",
        "source": "T23n1440_009:0560a29_4"
    },
    {
        "source_sentence": "不白，往者犯墮。",
        "translation": "If he doesn't confess, the person who goes there commits a sin.",
        "source": "T23n1440_009:0560b01_5"
    },
    {
        "source_sentence": "若白，往於道中至餘家索食，食得正食墮，助食突。",
        "translation": "If he tells them, he goes to another house on the road to solicit food and eats it, and when he gets proper food, he falls into a pit that helps him eat.",
        "source": "T23n1440_009:0560b01_6"
    },
    {
        "source_sentence": "若與僧一時去不白，先入者墮。",
        "translation": "If he leaves with the saṃgha at one time and doesn't confess, those who enter first will fall into it.",
        "source": "T23n1440_009:0560b03_7"
    },
    {
        "source_sentence": "主人明日當作食，今日自往者墮，除主人喚。",
        "translation": "The host will prepare food tomorrow, and the one who goes on his own today will fall down, except for the host's call.",
        "source": "T23n1440_009:0560b03_8"
    },
    {
        "source_sentence": "食後主人不留，輒自住者墮。",
        "translation": "The host doesn't stay behind after eating, and those who often live on their own fall into it.",
        "source": "T23n1440_009:0560b04_9"
    },
    {
        "source_sentence": "作經勞主人，僧先至而方後到者墮，食後未嚫去者墮。",
        "translation": "It's because the master of the sūtras is laborious, and those who arrive before the saṃgha arrives and those who arrive later fall into it, and those who don't eat after they leave fall into it.",
        "source": "T23n1440_009:0560b05_10"
    },
    {
        "source_sentence": "餘道人欲私行，直報同學，得犯與不犯，與上同。",
        "translation": "The rest of the Way people who want to practice it privately will be directly rewarded by their fellow students, and they'll be subject to violations or non-violations, which are the same as the above.",
        "source": "T23n1440_009:0560b06_11"
    },
    {
        "source_sentence": "雖大界內近寺白衣家，不白亦犯墮也。",
        "translation": "Even though they're inside the great realm and near a white-robed house in a temple, if they don't say so, they'll be guilty of falling into it.",
        "source": "T23n1440_009:0560b07_12"
    },
    {
        "source_sentence": "入城突。",
        "translation": "He entered the city gates.",
        "source": "T23n1440_009:0560b08_13"
    },
    {
        "source_sentence": "若白而還晚，令僧惱者突。",
        "translation": "If he returns late after confessing and causes the saṃgha to be disturbed, he'll prostrate.",
        "source": "T23n1440_009:0560b09_0"
    },
    {
        "source_sentence": "九十事第八十二",
        "translation": "ninety-eighty-eighth and eighty-second matters",
        "source": "T23n1440_009:0560b10_0"
    },
    {
        "source_sentence": "門者，王宮外門也。",
        "translation": "The gate is the gate outside the king's palace.",
        "source": "T23n1440_009:0560b11_0"
    },
    {
        "source_sentence": "門閫者，宮門前一限木也，過此木犯。",
        "translation": "A door is a tree that's limited to one piece of wood in front of the palace gate, and it's a violation to go beyond this piece of wood.",
        "source": "T23n1440_009:0560b11_1"
    },
    {
        "source_sentence": "未藏寶者，王已出外、夫人未起。",
        "translation": "Someone who doesn't store treasures has left the king's palace and his wife hasn't risen.",
        "source": "T23n1440_009:0560b12_2"
    },
    {
        "source_sentence": "其進御時，所著寶衣輕明照徹內身外現，以發欲意未藏此衣，名未藏寶。",
        "translation": "When he enters the kingdom, his jeweled robe that's worn is light and shining, which shines through his inner body and outwardly manifests, and it's called not-hiding treasure because he arouses the desire to store this robe.",
        "source": "T23n1440_009:0560b12_3"
    },
    {
        "source_sentence": "又女為男寶，夫人未以餘衣覆身，亦名未藏寶。",
        "translation": "Also, the woman is a male treasure, and the wife doesn't cover her body with other clothing, which is also called a treasure that isn't hidden.",
        "source": "T23n1440_009:0560b14_4"
    },
    {
        "source_sentence": "夜未曉者，胡本有二義：一未曉、二夫人未起。",
        "translation": "Before dawn, there are two meanings in the original Hu: first, before dawn, and second, when the queen has not risen.",
        "source": "T23n1440_009:0560b15_5"
    },
    {
        "source_sentence": "王及夫人未出、寶衣未藏，入限木內犯。",
        "translation": "Before the king and his wife leave, or before their jeweled robes are hidden, they enter inside a limited wooden chamber to commit crimes.",
        "source": "T23n1440_009:0560b16_6"
    },
    {
        "source_sentence": "已出已藏，入限不犯。",
        "translation": "It's not a violation to leave it and hide it after entering the limit.",
        "source": "T23n1440_009:0560b17_7"
    },
    {
        "source_sentence": "及王夫人大臣太子勢力強將入，不犯。",
        "translation": "It's not a violation if the king's wife, ministers, or princes are so powerful that they're about to enter.",
        "source": "T23n1440_009:0560b18_8"
    },
    {
        "source_sentence": "或未藏寶夫人無突。",
        "translation": "Perhaps there's a woman who doesn't hide treasure and has no protuberance.",
        "source": "T23n1440_009:0560b19_0"
    },
    {
        "source_sentence": "有夫人無寶，突。",
        "translation": "There was a queen who had no treasure, but she prostrated herself.",
        "source": "T23n1440_009:0560b19_1"
    },
    {
        "source_sentence": "入天龍鬼神宮門，突。",
        "translation": "He entered the gate of the palace of the gods, dragons, ghosts, and spirits.",
        "source": "T23n1440_009:0560b19_2"
    },
    {
        "source_sentence": "入空宮門，不犯。",
        "translation": "It's not a violation to enter the gate of an empty palace.",
        "source": "T23n1440_009:0560b20_3"
    },
    {
        "source_sentence": "王者，取聚落主已上也。",
        "translation": "The king is someone who takes the lord of a village and goes up there.",
        "source": "T23n1440_009:0560b20_4"
    },
    {
        "source_sentence": "九十事第八十三",
        "translation": "ninety-eighty-eighth phenomenon",
        "source": "T23n1440_009:0560b22_0"
    },
    {
        "source_sentence": "我今始知是法者，云經心聽、亂心聽戒故犯。",
        "translation": "Now, when I first know this teaching, I'll say that it's a violation because the sūtras are listened to in mind and the precepts are listened to in distraction.",
        "source": "T23n1440_009:0560b23_0"
    },
    {
        "source_sentence": "云初至眾學犯突，說竟犯墮。",
        "translation": "It's said that the first one arrives at the point where the multitude of students violates the precepts, and the second one ends up violating them.",
        "source": "T23n1440_009:0560b24_0"
    },
    {
        "source_sentence": "實先知、言始知，犯妄語墮。",
        "translation": "If someone really knows beforehand and speaks when they first know it, they'll violate the precept against lying.",
        "source": "T23n1440_009:0560b24_1"
    },
    {
        "source_sentence": "此中正結不專心聽罪也。",
        "translation": "This is the correct conclusion that he doesn't focus his mind on listening to sins.",
        "source": "T23n1440_009:0560b25_2"
    },
    {
        "source_sentence": "九十事第八十四",
        "translation": "ninety-eighty-fourth of the eighty-four",
        "source": "T23n1440_009:0560b26_0"
    },
    {
        "source_sentence": "針筒者，以是小物故，所以不入三十事故。",
        "translation": "A syringe is because it's a small thing, so it doesn't enter 30 things.",
        "source": "T23n1440_009:0560b27_0"
    },
    {
        "source_sentence": "又應破故，若還主主不受，若與他則主惱。",
        "translation": "It should also be refuted because if the owner returns, the owner won't accept it, and if he gives it to someone else, the owner will be disturbed.",
        "source": "T23n1440_009:0560b28_0"
    },
    {
        "source_sentence": "施僧則非法，唯毀棄。",
        "translation": "Giving to the saṃgha is unlawful, but it's only a disparagement.",
        "source": "T23n1440_009:0560b29_0"
    },
    {
        "source_sentence": "骨者，象馬龍骨。",
        "translation": "The bones are the bones of elephants, horses, and dragons.",
        "source": "T23n1440_009:0560b29_1"
    },
    {
        "source_sentence": "牙者，象及猪牙。",
        "translation": "Teeth are elephant teeth and pig teeth.",
        "source": "T23n1440_009:0560b29_2"
    },
    {
        "source_sentence": "齒者，象馬猪齒。",
        "translation": "The teeth are elephant, horse, and pig teeth.",
        "source": "T23n1440_009:0560c01_3"
    },
    {
        "source_sentence": "角者，牛羊鹿角也。",
        "translation": "horns refers to the horns of cattle, sheep, goats, and deer.",
        "source": "T23n1440_009:0560c01_4"
    },
    {
        "source_sentence": "貪好故、不淨故犯也。",
        "translation": "It's a violation because of craving for goodness and impurity.",
        "source": "T23n1440_009:0560c02_5"
    },
    {
        "source_sentence": "現餘鉢支等亦爾也。",
        "translation": "So it is with the remaining bowls and so forth in the present.",
        "source": "T23n1440_009:0560c02_6"
    },
    {
        "source_sentence": "九十事第八十五",
        "translation": "ninety-eighth and eighty-fifth matters",
        "source": "T23n1440_009:0560c04_0"
    },
    {
        "source_sentence": "高廣床者，以生憍慢故，木床高大悉犯，俗人八戒同是也。",
        "translation": "A high and wide bed is a violation because it gives rise to arrogance, and a wooden bed that's high and large are all violations, which are the same as the eight precepts for laypeople.",
        "source": "T23n1440_009:0560c05_0"
    },
    {
        "source_sentence": "八指者，一指二寸也。",
        "translation": "Eight fingers means one finger is two inches long.",
        "source": "T23n1440_009:0560c06_1"
    },
    {
        "source_sentence": "隨得者，明用時隨坐臥得罪。",
        "translation": "Those who follow it will be guilty of walking, sitting, and lying down while they're using it.",
        "source": "T23n1440_009:0560c06_2"
    },
    {
        "source_sentence": "所以不入捨墮者，以截斷故。",
        "translation": "The reason it doesn't enter into equanimity and fall is because it's cut off.",
        "source": "T23n1440_009:0560c07_3"
    },
    {
        "source_sentence": "截使應量，入僧中悔，若下濕處聽八寸，支過悉犯。",
        "translation": "If he cuts off the messenger's allowance and enters the saṃgha to repent, or if he goes down into a wet place and listens to eight inches, it's a violation for all his faults.",
        "source": "T23n1440_009:0560c08_4"
    },
    {
        "source_sentence": "九十事第八十六",
        "translation": "ninety matters, eighty-sixth",
        "source": "T23n1440_009:0560c10_0"
    },
    {
        "source_sentence": "兜羅者，草木華綿之總稱也。",
        "translation": "Tula is the general term for grass, trees, flowers, and cotton.",
        "source": "T23n1440_009:0560c11_0"
    },
    {
        "source_sentence": "以是貴人所畜故。",
        "translation": "It's because it's stored by a noble person.",
        "source": "T23n1440_009:0560c11_1"
    },
    {
        "source_sentence": "又人所慊故、喜生蟲故。",
        "translation": "It's also because it's eaten by humans and likes to give rise to insects.",
        "source": "T23n1440_009:0560c12_2"
    },
    {
        "source_sentence": "又若臥軟暖上，後得寒及麁[革*卬]時不堪忍故，乞時犯突，隨貯至成犯墮。",
        "translation": "Also, if someone lies on a soft and warm surface and later becomes cold and unable to tolerate it when they're wearing [grassps*shoulders], he commits a violation when begging, and he follows the store until he reaches completion of his offense.",
        "source": "T23n1440_009:0560c12_3"
    },
    {
        "source_sentence": "凡施佛即得其福，無從用生。",
        "translation": "Anyone who gives to a buddha will immediately attain its merit, which doesn't arise from using it.",
        "source": "T23n1440_009:0560c14_4"
    },
    {
        "source_sentence": "今佛不用故，僧則常用，福則常生故，應護作臥具也。",
        "translation": "Now, because the Buddha doesn't use it, the saṃgha always uses it, and merit always produces it, he should guard it as a bedding.",
        "source": "T23n1440_009:0560c15_0"
    },
    {
        "source_sentence": "九十事第八十七",
        "translation": "ninety-eighth and eighty-seventh matters",
        "source": "T23n1440_009:0560c17_0"
    },
    {
        "source_sentence": "覆瘡衣者，先未聽畜涅槃僧。",
        "translation": "A person wearing a sores-covering robe hasn't heard the saṃgha of nirvāṇa before.",
        "source": "T23n1440_009:0560c18_0"
    },
    {
        "source_sentence": "有一比丘，病癰膿血流出，污安多衛。",
        "translation": "There was a monk who became ill with abscesses, pus, and blood flowing out to pollute undergarment.",
        "source": "T23n1440_009:0560c18_1"
    },
    {
        "source_sentence": "佛見，聽畜覆瘡衣，乃至瘡差後十日內畜，不犯。",
        "translation": "When the Buddha sees it, he hears that it's not a violation to store sores-covering clothing or store inside ten days after the sores are healed.",
        "source": "T23n1440_009:0560c19_2"
    },
    {
        "source_sentence": "既聽涅槃僧，患瘡時涅槃僧內著之，量如涅槃僧。",
        "translation": "When he hears about the nirvāṇa saṃgha, he puts it inside the nirvāṇa saṃgha when he's suffering from sores, which are as large as the nirvāṇa saṃgha.",
        "source": "T23n1440_009:0560c20_3"
    },
    {
        "source_sentence": "九十事第八十八",
        "translation": "ninety matters of the eighty-eighth category",
        "source": "T23n1440_009:0560c22_0"
    },
    {
        "source_sentence": "尼師檀者，本佛在時不臥故小作，後因難陀聽益，縷際從織邊，唯於一頭更益一搩手，凡長六尺廣三尺，令比丘臥故。",
        "translation": "A nun's sandalwood is a small piece of work that was originally made by the Buddha when he wasn't lying down; later, because Nanda heard about it, the thread came from the edge of the wool and only one hair added to his hand, which was six feet long and three feet wide, causing the monk to lie down.",
        "source": "T23n1440_009:0560c23_0"
    },
    {
        "source_sentence": "僧臥具量四八尺也。",
        "translation": "The monks' bedding was four or eight feet in size.",
        "source": "T23n1440_009:0560c25_1"
    },
    {
        "source_sentence": "今若欲作尼師檀，量故如本作也。",
        "translation": "Now, if you want to make a nun's sandalwood, it's the same size as the one you made in the past.",
        "source": "T23n1440_009:0560c26_2"
    },
    {
        "source_sentence": "云以此先制故，所以在此中也。",
        "translation": "It's said that this is because they were previously restrained, which is why they're here.",
        "source": "T23n1440_009:0560c27_0"
    },
    {
        "source_sentence": "後以結三十捨墮，則入捨墮。",
        "translation": "After that, he concludes with the thirty equanimity and falls, and then he enters into equanimity.",
        "source": "T23n1440_009:0560c27_1"
    },
    {
        "source_sentence": "今作不如法，便入捨墮也。",
        "translation": "Now, if someone doesn't follow the teaching, they'll enter into equanimity.",
        "source": "T23n1440_009:0560c28_2"
    },
    {
        "source_sentence": "九十事第八十九",
        "translation": "ninety-eighty-eighth day of the month",
        "source": "T23n1440_009:0560c29_0"
    },
    {
        "source_sentence": "雨浴衣中求願，佛不與過願者，云過願如王大人法，有從求願所索，禮必不違，若求妻妾奴婢田宅悉與。",
        "translation": "If someone asks for a vow in the rain-bathing robe but the Buddha doesn't give it to someone who has a faulty vow, they say their faulty vow is according to the king's great man's teaching, and there are people who ask for what they want from the vow with respect that won't be disobeyed, or if they ask for wives, concubines, slaves, mai",
        "source": "T23n1440_009:0561a01_0"
    },
    {
        "source_sentence": "佛以過此不如法與，故云不與過願，唯與如法願也。",
        "translation": "Because it's beyond this, the Buddha doesn't give what's not given according to the teaching, so he says he doesn't give what's wrong with his vow, but gives it only as he wishes according to the teaching.",
        "source": "T23n1440_009:0561a03_1"
    },
    {
        "source_sentence": "云今凡比丘浴，若露覆室，要不共白衣及覆上身，要當著竭支，一當有羞媿、二喜生他欲想故。",
        "translation": "It's because ordinary monks now say that if they bathe and cover their room with a white robe or cover their upper body, they mustn't share the white robe or cover their upper body; they must put on dry clothes, because one will have modesty and two will be delighted to give rise to the desire for others.",
        "source": "T23n1440_009:0561a04_2"
    },
    {
        "source_sentence": "昔有羅漢比丘浴，有一比丘見其身體鮮淨細軟，便欲心生。",
        "translation": "When an arhat monk was bathing, a monk saw that his body was pure and fine and soft, so he wanted to give rise to the mind.",
        "source": "T23n1440_009:0561a06_3"
    },
    {
        "source_sentence": "後不久男根墮落即有女根，則休道為俗生子。",
        "translation": "Soon after that, the male faculty will fall and there will be a female faculty, so he'll stop teaching as a secular child.",
        "source": "T23n1440_009:0561a08_4"
    },
    {
        "source_sentence": "後還遇見即便識之，知本所因即歸情求，及羅漢教令悔過，用心純至還得男根。",
        "translation": "Knowing the original cause, he then returned to his own mind and sought it out, and the arhat taught him to repent, intending to return to the male faculty with pure effort.",
        "source": "T23n1440_009:0561a09_5"
    },
    {
        "source_sentence": "故宜不露形也。",
        "translation": "Therefore, it's appropriate not to reveal form.",
        "source": "T23n1440_009:0561a11_6"
    },
    {
        "source_sentence": "云婬持戒大比丘及沙彌罪，同破七寶塔，勸人令出家精進，斯福同塔也。",
        "translation": "It's said that the great monks and śrāmaṇeras who violate the precepts and commit crimes together destroy seven-jeweled stūpas and encourage people to leave home and make effort, which is the same as a stūpa of merit.",
        "source": "T23n1440_009:0561a11_7"
    },
    {
        "source_sentence": "九十事第九十",
        "translation": "The ninety-ninth matter of the ninety",
        "source": "T23n1440_009:0561a14_0"
    },
    {
        "source_sentence": "云佛衣量，佛身丈六，常人半之，衣量廣長皆應半也。",
        "translation": "It's said that the size of the Buddha's robe is six feet in height, which is half the size of a regular person's body; the size of the robe should be one-half long and wide.",
        "source": "T23n1440_009:0561a15_0"
    },
    {
        "source_sentence": "佛弟難陀短佛四指，衣應減長中一尺、廣中四寸。",
        "translation": "The Buddha's younger brother nanda is four fingers shorter than the Buddha, and his robe should be reduced by one foot in length and four inches in breadth.",
        "source": "T23n1440_009:0561a16_1"
    },
    {
        "source_sentence": "難陀先著上衣，佛著中衣，今不聽過等，聽著下衣，常人則下中下也。",
        "translation": "Nanda had previously worn an upper garment, but the Buddha wore a middle garment; now he won't listen to anyone who wears a lower garment.",
        "source": "T23n1440_009:0561a17_2"
    },
    {
        "source_sentence": "佛衣色如金詰施，[疊*毛]色亦爾，故難陀衣宜當覆沙。",
        "translation": "The color of the Buddha's robe is like a gift made of gold, and so is the color of cotton*hair; therefore, it's appropriate to cover the sand with the nanda robe.",
        "source": "T23n1440_009:0561a18_3"
    },
    {
        "source_sentence": "覆沙者，秦言壞色也，令同比丘衣也。",
        "translation": "A covering sand is the Qin word for a broken color, which causes people to wear monk's robes.",
        "source": "T23n1440_009:0561a20_0"
    },
    {
        "source_sentence": "四悔過第一",
        "translation": "the first of the four repentances",
        "source": "T23n1440_009:0561a21_0"
    },
    {
        "source_sentence": "此是不共戒，比丘尼、式叉摩尼、沙彌尼無犯，沙彌突吉羅。",
        "translation": "This is an uncommon precept that's not violated by bhikṣuṇīs, śrāmaṇīs, or śrāmaṇerīs who don't violate it, and which is a śrāmaṇer's grave offense.",
        "source": "T23n1440_009:0561a22_0"
    },
    {
        "source_sentence": "此戒體無罪名，一人邊一說悔過。",
        "translation": "The essence of these precepts is without the name blameworthiness, and one person expresses repentance at each side.",
        "source": "T23n1440_009:0561a23_1"
    },
    {
        "source_sentence": "是中犯者，若比丘不病入聚落中，非親比丘尼邊自手取根食，得波羅提提舍尼罪。",
        "translation": "If a monk enters a village without illness and doesn't take food from the faculties of his own hand at the side of a nun who's not related to him or her, he or she will be guilty of the offense of prātimokṣaṇa.",
        "source": "T23n1440_009:0561a24_2"
    },
    {
        "source_sentence": "若一時取十五種食，一波羅提提舍尼。",
        "translation": "If he takes fifteen kinds of food at one time, it's prātimokṣaṇi.",
        "source": "T23n1440_009:0561a25_3"
    },
    {
        "source_sentence": "若一一取，十五波羅提提舍尼。",
        "translation": "If he takes one by one, he'll take fifteen prātimokṣaṇas.",
        "source": "T23n1440_009:0561a26_4"
    },
    {
        "source_sentence": "不犯者，若病、若親里比丘尼、若天祠中多人聚中與、若沙門住處與、聚落外若比丘尼坊舍中與，不犯。",
        "translation": "A person who doesn't violate the precepts doesn't violate them if they're sick, if they're relatives of a monk or nun, if they're given to someone in a large group of people in a deva temple, if they're given to an ascetic living place, or if they're given to a monk or nun outside a village or monastery.",
        "source": "T23n1440_009:0561a27_5"
    },
    {
        "source_sentence": "第二事",
        "translation": "second thing",
        "source": "T23n1440_009:0561b01_0"
    },
    {
        "source_sentence": "此是不共戒，比丘尼、式叉摩尼、沙彌尼無犯，沙彌突吉羅。",
        "translation": "This is an uncommon precept that's not violated by bhikṣuṇīs, śrāmaṇīs, or śrāmaṇerīs who don't violate it, and which is a śrāmaṇer's grave offense.",
        "source": "T23n1440_009:0561b02_0"
    },
    {
        "source_sentence": "是中犯者，若比丘受比丘尼所教與食，得波羅提提舍尼罪，隨受得爾所波羅提提舍尼。",
        "translation": "If a monk accepts the food taught by a bhikṣuṇī and eats it, he'll be guilty of the offense of prātimokṣatriya, and he'll receive such-and-such prātimokṣatriya accordingly.",
        "source": "T23n1440_009:0561b03_1"
    },
    {
        "source_sentence": "若二部僧共坐，一部僧中若有一人語是比丘尼者，第二部僧亦名為語。",
        "translation": "If two groups of monks are seated together, and if there's one person in a group of monks who says it's a bhikṣuṇī, the second group of monks is also called speech.",
        "source": "T23n1440_009:0561b05_2"
    },
    {
        "source_sentence": "若別入別坐別食別出者，是中入檀越門比丘應問出比丘：「何比丘尼是中教檀越與比丘食？」",
        "translation": "If someone enters separately, sits separately, eats separately, and leaves separately, the monk who enters the donor's door in this way should ask the monk who exits, Which monk or nun teaches the donor to give the monk food?",
        "source": "T23n1440_009:0561b07_0"
    },
    {
        "source_sentence": "答言：「某。」",
        "translation": "He replied, I will.",
        "source": "T23n1440_009:0561b09_1"
    },
    {
        "source_sentence": "應問：「約勅未？」",
        "translation": "You should ask, Haven't you done so?",
        "source": "T23n1440_009:0561b09_2"
    },
    {
        "source_sentence": "答言：「已約勅。」",
        "translation": "He replied, I've already instructed you.",
        "source": "T23n1440_009:0561b09_3"
    },
    {
        "source_sentence": "是入比丘亦名約勅。",
        "translation": "This monk who enters is also called a commander.",
        "source": "T23n1440_009:0561b09_4"
    },
    {
        "source_sentence": "有諸比丘出城門時，有比丘入者，應問出者。",
        "translation": "When some monks leave the city gates, if there's a monk who enters them, you should ask him to leave.",
        "source": "T23n1440_009:0561b10_5"
    },
    {
        "source_sentence": "若出未約勅，入者應約勅。",
        "translation": "If someone leaves without being instructed, they should be instructed to enter if they do so.",
        "source": "T23n1440_009:0561b11_6"
    },
    {
        "source_sentence": "若出約勅，入者亦名約勅。",
        "translation": "If he produces a command, the person who enters it is also called a command.",
        "source": "T23n1440_009:0561b12_0"
    },
    {
        "source_sentence": "第三事",
        "translation": "third matter",
        "source": "T23n1440_009:0561b13_0"
    },
    {
        "source_sentence": "此戒與比丘尼共，三眾不共。",
        "translation": "These precepts are shared with the bhikṣuṇīs and not shared by the threefold assembly.",
        "source": "T23n1440_009:0561b14_0"
    },
    {
        "source_sentence": "是中犯者，若比丘學家中，僧作學家羯磨已，先不請後來自手取根食，得波羅提提舍尼。",
        "translation": "If a monk trains at home and the saṃgha performs the home-learning karma, he first doesn't ask for it, then takes food from his faculties with his hand, and attains pratideśanīya.",
        "source": "T23n1440_009:0561b14_1"
    },
    {
        "source_sentence": "若一時取十五種食，得一罪。",
        "translation": "If someone takes fifteen kinds of food at one time, they'll be guilty of one sin.",
        "source": "T23n1440_009:0561b16_2"
    },
    {
        "source_sentence": "若異時各各取，得十五波羅提提舍尼。",
        "translation": "If they each take it at different times, they'll attain fifteen prātimokṣaṇas.",
        "source": "T23n1440_009:0561b17_3"
    },
    {
        "source_sentence": "第四事",
        "translation": "fourth matter",
        "source": "T23n1440_009:0561b19_0"
    },
    {
        "source_sentence": "此是不共戒，四眾無犯。",
        "translation": "This is an uncommon precept that's not violated by the four groups of people.",
        "source": "T23n1440_009:0561b20_0"
    },
    {
        "source_sentence": "是中犯者，若比丘僧未差，是人不僧坊外自手取根食，僧坊內取，得波羅提提舍尼罪。",
        "translation": "If a monk who doesn't take the food with his own hand outside the saṃgha's quarters and takes it inside the saṃgha's quarters without being sent by the saṃgha, he'll be guilty of the offense of prātimokṣatriya.",
        "source": "T23n1440_009:0561b20_1"
    },
    {
        "source_sentence": "若比丘受僧羯磨已，是比丘知是中有賊入，應將淨人是中立。",
        "translation": "If a monk has accepted the saṃgha's karma, that monk knows that there's a thief who enters it, and he or she should place the pure person in the middle.",
        "source": "T23n1440_009:0561b22_2"
    },
    {
        "source_sentence": "若是中見人有似賊者，應取是食，語諸持食人：「汝莫來入，是中有人似賊。」",
        "translation": "If someone in the middle sees someone who looks like a thief, they should take this food and tell the person holding it, Don't enter; there's someone in the middle who looks like a thief.",
        "source": "T23n1440_009:0561b23_3"
    },
    {
        "source_sentence": "若是持食人強來者，不犯。",
        "translation": "It's not a violation if someone forcibly brings food with them.",
        "source": "T23n1440_009:0561b25_4"
    },
    {
        "source_sentence": "律師云：所羯磨人必使勇健多力能却賊者。",
        "translation": "The Vinaya master said, A person who undertakes the karma must be courageous and powerful enough to stop thieves.",
        "source": "T23n1440_009:0561b26_5"
    },
    {
        "source_sentence": "若不能却，一切僧盡應至有賊處。",
        "translation": "If they can't get rid of it, all the saṃgha should go to a place where there are thieves.",
        "source": "T23n1440_009:0561b27_6"
    },
    {
        "source_sentence": "若復不能，應語聚落檀越令多人防護也。",
        "translation": "If they can't, they should tell the villagers and donors to make many people guard them.",
        "source": "T23n1440_009:0561b28_7"
    },
    {
        "source_sentence": "眾學初",
        "translation": "beginning of all Buddhist studies",
        "source": "T23n1440_009:0561c01_0"
    },
    {
        "source_sentence": "此是共戒。",
        "translation": "These are the shared precepts.",
        "source": "T23n1440_009:0561c02_0"
    },
    {
        "source_sentence": "諸比丘極高著泥洹僧者，非是五比丘，非是優為迦葉等，亦非舍利弗、目揵連等，又非善來比丘，多是白四羯磨受具戒者。",
        "translation": "Those monks who are extremely high-handedly attached to the nirvāṇa saṃgha aren't five monks, not Udayana Kāśyapa and so forth, not Śāriputra, Maudgalyāyana and so forth, nor well-coming monks, but mostly those who have received the full set of precepts in the four white karmas.",
        "source": "T23n1440_009:0561c02_1"
    },
    {
        "source_sentence": "如釋種千人同時出家者，此諸人等多壞威儀。",
        "translation": "Suppose the Śākyamuni clan had a thousand people who all renounced home at the same time, and these people often disrupted their manners.",
        "source": "T23n1440_009:0561c05_2"
    },
    {
        "source_sentence": "如釋種比丘本出豪族，以先習故，下著泥洹僧。",
        "translation": "Suppose a monk of the Śākya clan originally came from a noble family, and because he had previously cultivated it, he put down nirvāṇa as a monk.",
        "source": "T23n1440_009:0561c06_3"
    },
    {
        "source_sentence": "諸婆羅門外道在佛法中出家，高著泥洹僧。",
        "translation": "The Brāhmaṇas and non-Buddhists who leave home in the Buddha's teachings are highly attached to the nirvāṇa saṃgha.",
        "source": "T23n1440_009:0561c07_4"
    },
    {
        "source_sentence": "諸六群比丘參差著泥洹僧。",
        "translation": "The six groups of monks gathered to attend the nirvāṇa saṃgha.",
        "source": "T23n1440_009:0561c08_5"
    },
    {
        "source_sentence": "問曰：「五篇戒中佛何以正制著泥洹僧著三衣，觀去來現佛及淨居天耶？」",
        "translation": "Q: In the five precepts, why does the Buddha correctly regulate the three robes of the nirvāṇa saṃgha wearing the three robes and observing past and future manifestations of the Buddha and the purely abiding gods?",
        "source": "T23n1440_009:0561c08_6"
    },
    {
        "source_sentence": "答曰：「佛結五篇戒，皆應觀三世諸佛及淨居天。",
        "translation": "He answered, The Buddha formed five precepts in five parts, which should all be observed by the buddhas of the three times and the purely abiding gods.",
        "source": "T23n1440_009:0561c10_7"
    },
    {
        "source_sentence": "但年歲久遠，文字漏落，餘篇盡無此中獨有。",
        "translation": "For a long time, however, the Sanskrit texts have been lost to oblivion. The rest of the works are not found here alone.",
        "source": "T23n1440_009:0561c11_8"
    },
    {
        "source_sentence": "復次結五篇戒，此最在初，結後集藏者銓次在後，以此篇貫初故，餘篇不說。",
        "translation": "Furthermore, the five chapters of the precepts are concluded at the beginning. The one who concludes the later collection of scriptures is in succession at the end. Because this chapter extends to the beginning, it is not mentioned in other chapters.",
        "source": "T23n1440_009:0561c12_9"
    },
    {
        "source_sentence": "復次此戒於餘篇是輕者，將來弟子不生重心，是故如來以佛眼觀去來諸佛及淨居天也而後結也，使來世眾生不生慢罪。",
        "translation": "Furthermore, this precept is lighter in other parts because the future disciples won't give rise to heavy thoughts. That's why the Tathāgata observes past and future buddhas and the purely abiding gods with the Buddha's eye and then concludes it, so that sentient beings in future lives won't become conceited.",
        "source": "T23n1440_009:0561c14_10"
    },
    {
        "source_sentence": "復次三世諸佛結戒有同不同，於五篇戒中不必盡同，此著泥洹僧袈裟，三世諸佛一切盡同，是故此戒觀諸佛及淨居天，餘篇不觀也。」",
        "translation": "Furthermore, there are similarities and dissimilarities between the three worldly buddhas' fetters and precepts, which don't all have to be the same in five parts of the precepts; this monk wearing a nirvāṇa monk's robe means that all the three worldly buddhas are the same, so this precept observes the buddhas and the pure abode gods as well as the other",
        "source": "T23n1440_009:0561c17_11"
    },
    {
        "source_sentence": "問曰：「此眾學戒結既在初，而在後耶？」",
        "translation": "He asked, Are these the precepts for all those who study the precepts at the beginning or at the end?",
        "source": "T23n1440_009:0561c20_12"
    },
    {
        "source_sentence": "答曰：「佛在初結，後集法藏者銓次在後。",
        "translation": "He answered, The Buddha was at the beginning of the compilation, and the later collectors of the Dharma collection were listed in order behind him.",
        "source": "T23n1440_009:0561c21_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1440_009:0561c22_14"
    },
    {
        "source_sentence": "罪名雖一而輕重有五，以重戒在先、輕戒在後，此戒於五篇中最輕，是故在後。",
        "translation": "Although the name of blameworthiness is one, there are five forms of weakness: because strong precepts come first and weak precepts come last. These precepts are the lightest of the five; that is why they are at a later stage.",
        "source": "T23n1440_009:0561c22_15"
    },
    {
        "source_sentence": "又以一是實罪、二是遮罪，以實在初、遮罪在後。",
        "translation": "It's also because one is a real offense and two are crimes that are covered up, the first to be revealed and the second to be covered up after.",
        "source": "T23n1440_009:0561c24_16"
    },
    {
        "source_sentence": "又以一是無殘、二是有殘。",
        "translation": "Furthermore, it's because one is without residue and two are with residue.",
        "source": "T23n1440_009:0561c25_17"
    },
    {
        "source_sentence": "又以如焦敗種、又以如多羅葉，是故重者在初、輕者在後。」",
        "translation": "It's also because it's like a scorched seed or a palm leaf, so the heavy one comes first and the lighter one comes second.",
        "source": "T23n1440_009:0561c25_18"
    },
    {
        "source_sentence": "問曰：「餘篇戒不言應當學，而此戒獨爾？」",
        "translation": "He asked, The rest of the precepts don't say that they should be studied, but are these precepts alone?",
        "source": "T23n1440_009:0561c27_19"
    },
    {
        "source_sentence": "答曰：「餘戒易持而罪重，犯則成罪，或眾中悔或對首悔。",
        "translation": "He answered, The other precepts are easy to uphold but the offense is serious, and when they're violated, it becomes a sin. Some people may repent in the midst of the congregation or repent face-to-face.",
        "source": "T23n1440_009:0561c28_20"
    },
    {
        "source_sentence": "此戒難持而罪輕，脫爾有犯，心悔念學，罪即滅也。",
        "translation": "Because these precepts are difficult to uphold but the offense is light, they're freed from those who violate them with remorse and mindfulness of training, and their sins are extinguished.",
        "source": "T23n1440_009:0561c29_21"
    },
    {
        "source_sentence": "以戒難持易犯故，常慎心念學，不結罪名，直言應當學也。」",
        "translation": "Because the precepts are difficult to uphold and easy to violate, they're always mindful of training with caution, don't define the names of crimes, and simply say that they should be studied.",
        "source": "T23n1440_009:0562a01_22"
    },
    {
        "source_sentence": "高下著內衣者，踝上一搩手，上下過名高下。",
        "translation": "A person wearing an inner robe at a height and a lower height puts his hand on the top of his ankle, and when he goes up and down, it's called high and low.",
        "source": "T23n1440_009:0562a03_0"
    },
    {
        "source_sentence": "若比丘沙彌遠行來時，聽踝上二搩手上至膝下。",
        "translation": "If a monk or novice comes from afar and travels, he hears the two knuckles above his ankles reach down to his knees.",
        "source": "T23n1440_009:0562a04_1"
    },
    {
        "source_sentence": "比丘尼、式叉摩尼、沙彌尼，一切時踝上一搩手，正使行來不得高也。",
        "translation": "The bhikṣuṇīs, śikṣamāṇīs, and novices all put their palms on their ankles at the same time, precisely so that they won't be able to walk up high.",
        "source": "T23n1440_009:0562a05_2"
    },
    {
        "source_sentence": "三、不參差。",
        "translation": "3. not variegating.",
        "source": "T23n1440_009:0562a06_3"
    },
    {
        "source_sentence": "四、不如釿頭。",
        "translation": "4. It's not like the tip of a lotus flower.",
        "source": "T23n1440_009:0562a07_4"
    },
    {
        "source_sentence": "五、不如多羅葉。",
        "translation": "5. It's not like a palm leaf.",
        "source": "T23n1440_009:0562a07_5"
    },
    {
        "source_sentence": "六、不如象鼻。",
        "translation": "6. It's not like an elephant's nose.",
        "source": "T23n1440_009:0562a07_6"
    },
    {
        "source_sentence": "七、不如麨揣。",
        "translation": "7. It's not like a divination.",
        "source": "T23n1440_009:0562a08_7"
    },
    {
        "source_sentence": "八、不細襵。",
        "translation": "8. not subtle and crude...",
        "source": "T23n1440_009:0562a08_8"
    },
    {
        "source_sentence": "九、不著茸。",
        "translation": "9. It's not attached to hair.",
        "source": "T23n1440_009:0562a08_9"
    },
    {
        "source_sentence": "十、不并襵兩邊。",
        "translation": "10. It doesn't go along with the two sides of the debate.",
        "source": "T23n1440_009:0562a08_10"
    },
    {
        "source_sentence": "十一、不著細縷內衣。",
        "translation": "11. He doesn't wear finely woven undergarments.",
        "source": "T23n1440_009:0562a09_11"
    },
    {
        "source_sentence": "十二、周齊著三衣。",
        "translation": "12. He wears the three robes in a circumference.",
        "source": "T23n1440_009:0562a09_12"
    },
    {
        "source_sentence": "有四事：高下者，在泥洹僧上四指；",
        "translation": "There are four things:",
        "source": "T23n1440_009:0562a10_13"
    },
    {
        "source_sentence": "三不參差；",
        "translation": "The third is the principle of non-differentiation.",
        "source": "T23n1440_009:0562a10_14"
    },
    {
        "source_sentence": "四周齊也。",
        "translation": "It's the same as the four circumferences.",
        "source": "T23n1440_009:0562a11_15"
    },
    {
        "source_sentence": "入白衣舍有四十一事，受食有二十七事：一、一心受飯。",
        "translation": "There are forty-one things that enter a white-robed dwelling, and twenty-seven things that receive food: 1. accepting rice with one mind.",
        "source": "T23n1440_009:0562a12_0"
    },
    {
        "source_sentence": "二、一心受羹。",
        "translation": "2. accepting the soup with one mind.",
        "source": "T23n1440_009:0562a13_1"
    },
    {
        "source_sentence": "三、不溢鉢受羹飯。",
        "translation": "3. he doesn't overflow his bowl to receive the rice and soup.",
        "source": "T23n1440_009:0562a13_2"
    },
    {
        "source_sentence": "四、羹飯等食。",
        "translation": "4. food such as soup and rice.",
        "source": "T23n1440_009:0562a13_3"
    },
    {
        "source_sentence": "五、不拘飯食。",
        "translation": "5. not being restrained by food and drink.",
        "source": "T23n1440_009:0562a14_4"
    },
    {
        "source_sentence": "六、不搆飯食。",
        "translation": "6. He doesn't prepare food and drink.",
        "source": "T23n1440_009:0562a14_5"
    },
    {
        "source_sentence": "七、不大揣飯食。",
        "translation": "7. not speculating about food and drink.",
        "source": "T23n1440_009:0562a14_6"
    },
    {
        "source_sentence": "八、不手捉食。",
        "translation": "8. He doesn't grasp food with his hand.",
        "source": "T23n1440_009:0562a15_7"
    },
    {
        "source_sentence": "九、不豫張口待食。",
        "translation": "9. He doesn't prepare his mouth to wait for food.",
        "source": "T23n1440_009:0562a15_8"
    },
    {
        "source_sentence": "十、不含食語。",
        "translation": "10. words that don't contain food.",
        "source": "T23n1440_009:0562a15_9"
    },
    {
        "source_sentence": "十一、不齧半食。",
        "translation": "Eleventh, he doesn't eat half a meal.",
        "source": "T23n1440_009:0562a16_10"
    },
    {
        "source_sentence": "十二、不吸食作聲。",
        "translation": "12. He doesn't make sounds by ingesting food.",
        "source": "T23n1440_009:0562a16_11"
    },
    {
        "source_sentence": "十三、不嚼食作聲。",
        "translation": "13. He doesn't chew food and make sounds.",
        "source": "T23n1440_009:0562a17_0"
    },
    {
        "source_sentence": "十四、不味咽食。",
        "translation": "14. He doesn't taste and swallow food.",
        "source": "T23n1440_009:0562a17_1"
    },
    {
        "source_sentence": "十五、不吐舌食。",
        "translation": "15. He doesn't spit out food with his tongue.",
        "source": "T23n1440_009:0562a17_2"
    },
    {
        "source_sentence": "十六、不縮鼻食。",
        "translation": "16. food that doesn't shrink from the nose and nose.",
        "source": "T23n1440_009:0562a18_3"
    },
    {
        "source_sentence": "十七、不舐手食。",
        "translation": "17. He doesn't lick food with his hands.",
        "source": "T23n1440_009:0562a18_4"
    },
    {
        "source_sentence": "十八、不指抆鉢食。",
        "translation": "18. He doesn't point to food from a bowl or bowl.",
        "source": "T23n1440_009:0562a18_5"
    },
    {
        "source_sentence": "十九、不振手食。",
        "translation": "19. food that doesn't shake hands.",
        "source": "T23n1440_009:0562a19_6"
    },
    {
        "source_sentence": "二十、不棄箸半飯。",
        "translation": "20. He doesn't discard the chopstick and half a bowl of rice.",
        "source": "T23n1440_009:0562a19_7"
    },
    {
        "source_sentence": "二十一、不膩手捉飲器。",
        "translation": "21. He doesn't hold a drinking container with greasy hands.",
        "source": "T23n1440_009:0562a20_8"
    },
    {
        "source_sentence": "二十二、不病不得自為索羹飯。",
        "translation": "22. If he's not sick, he mustn't ask for his own rice and soup.",
        "source": "T23n1440_009:0562a20_9"
    },
    {
        "source_sentence": "二十三、不飯覆羹更望得。",
        "translation": "23. He doesn't cover his rice with soup and hopes to get it again.",
        "source": "T23n1440_009:0562a21_10"
    },
    {
        "source_sentence": "二十四、不相看比坐鉢。",
        "translation": "24. The bowl that doesn't look at each other like a sitting bowl.",
        "source": "T23n1440_009:0562a21_11"
    },
    {
        "source_sentence": "二十五、端視鉢。",
        "translation": "25. He looks at the bowl with his palm.",
        "source": "T23n1440_009:0562a22_12"
    },
    {
        "source_sentence": "二十六、次第噉食盡。",
        "translation": "26. The food consumed in order is exhausted.",
        "source": "T23n1440_009:0562a22_13"
    },
    {
        "source_sentence": "二十七、洗鉢水有飯，不問主人不應棄舍內。",
        "translation": "26. If you wash your bowls and water with food without asking the host, you shouldn't throw it inside the dwelling.",
        "source": "T23n1440_009:0562a23_14"
    },
    {
        "source_sentence": "為人說法有十九事，大小便唾涕有三事，上樹有一事。",
        "translation": "There are 19 things to teach the Dharma for people, three things to expel and spit out with urine and tears, and one thing to go up a tree.",
        "source": "T23n1440_009:0562a24_15"
    },
    {
        "source_sentence": "七滅諍第一",
        "translation": "seventh, the first in terms of cessation",
        "source": "T23n1440_009:0562a26_0"
    },
    {
        "source_sentence": "自言滅諍法。",
        "translation": "He himself says he's extinguishing the debilitating dharma.",
        "source": "T23n1440_009:0562a27_0"
    },
    {
        "source_sentence": "五眾有事，及五篇犯有犯不犯事，盡自言滅諍法滅也。",
        "translation": "The five groups of people who have matters, and the five rules for violating or violating non-violating offenses are extinguished by saying they've ended their disputes and ceased the teaching.",
        "source": "T23n1440_009:0562a27_1"
    },
    {
        "source_sentence": "自言滅諍，有十種非法、十種如法。",
        "translation": "There are ten kinds of what's not unlawful and ten kinds of what's according to the teaching when he says he's extinguishing anger.",
        "source": "T23n1440_009:0562a28_2"
    },
    {
        "source_sentence": "十非法者，若比丘犯波羅夷罪，自言不犯。",
        "translation": "Ten unlawful means that if a monk commits the sin of pārājika, he says he won't violate it.",
        "source": "T23n1440_009:0562a29_3"
    },
    {
        "source_sentence": "眾僧問言：「汝自說犯不？」",
        "translation": "The saṃgha asked, Do you yourself say it's a violation?",
        "source": "T23n1440_009:0562b01_4"
    },
    {
        "source_sentence": "自言不犯，是名非法。",
        "translation": "If someone says they won't violate it, this is called an unlawful thing.",
        "source": "T23n1440_009:0562b01_5"
    },
    {
        "source_sentence": "又比丘犯僧殘、波逸提、波羅提提舍尼、突吉羅，自言不犯。",
        "translation": "Furthermore, a monk violates the saṃghâvaśeṣaṇī, pratyekabuddha, pratideśanīya, and purgatory by saying he doesn't violate it.",
        "source": "T23n1440_009:0562b02_6"
    },
    {
        "source_sentence": "眾僧問言：「汝自說犯不？」",
        "translation": "The saṃgha asked, Do you yourself say it's a violation?",
        "source": "T23n1440_009:0562b03_7"
    },
    {
        "source_sentence": "自言不犯，是名五非法也。",
        "translation": "If someone says they won't violate it, these are called the five unlawful things.",
        "source": "T23n1440_009:0562b04_8"
    },
    {
        "source_sentence": "又比丘不犯波羅夷罪，自言我犯。",
        "translation": "Again, a monk who doesn't commit the offense of pārājika and says to himself, I've committed it.",
        "source": "T23n1440_009:0562b04_9"
    },
    {
        "source_sentence": "眾僧問言：「汝自說犯不？」",
        "translation": "The saṃgha asked, Do you yourself say it's a violation?",
        "source": "T23n1440_009:0562b05_10"
    },
    {
        "source_sentence": "自言我犯，是名非法。",
        "translation": "It's called unlawful to say that I've violated it.",
        "source": "T23n1440_009:0562b06_11"
    },
    {
        "source_sentence": "有比丘不犯僧殘、波夜提、波羅提提舍尼、突吉羅，自言我犯。",
        "translation": "If a monk doesn't violate the saṃghâva, pāyattika, pārotiṣṭiśanīya, or pratyekabuddha, he says it's a violation to himself.",
        "source": "T23n1440_009:0562b06_12"
    },
    {
        "source_sentence": "眾僧問言：「汝自說犯不？」",
        "translation": "The saṃgha asked, Do you yourself say it's a violation?",
        "source": "T23n1440_009:0562b07_13"
    },
    {
        "source_sentence": "自言我犯，是名十非法。",
        "translation": "To say yourself that I've violated them is called one of the ten unlawful things.",
        "source": "T23n1440_009:0562b08_14"
    },
    {
        "source_sentence": "十如法者，有比丘犯波羅夷，自言我犯。",
        "translation": "Ten according to the teaching, there's a monk who violates the pārājika and tells himself that he's violating it.",
        "source": "T23n1440_009:0562b08_15"
    },
    {
        "source_sentence": "眾僧問言：「汝自說犯不？」",
        "translation": "The saṃgha asked, Do you yourself say it's a violation?",
        "source": "T23n1440_009:0562b09_16"
    },
    {
        "source_sentence": "自言我犯，是名如法。",
        "translation": "If someone says to themselves, 'I've violated it,' this is called following the rules.",
        "source": "T23n1440_009:0562b10_17"
    },
    {
        "source_sentence": "有比丘犯僧殘、波夜提、波羅提提舍尼、突吉羅，自言我犯。",
        "translation": "If a monk violates the saṃghâvaśeṣaṇī, pāyattika, pārotiṣṭikāni, or pratyekabuddha, he says to himself, I'm violating it.",
        "source": "T23n1440_009:0562b10_18"
    },
    {
        "source_sentence": "眾僧問言：「汝自說犯不？」",
        "translation": "The saṃgha asked, Do you yourself say it's a violation?",
        "source": "T23n1440_009:0562b12_19"
    },
    {
        "source_sentence": "自言我犯，是名五如法。",
        "translation": "To claim that I've violated the precepts is called five according to the teaching.",
        "source": "T23n1440_009:0562b12_20"
    },
    {
        "source_sentence": "又比丘不犯波羅夷、僧殘、波夜提、波羅提提舍尼、突吉羅，自言不犯。",
        "translation": "Furthermore, a monk who doesn't violate the pārājika, the saṃghârāma, the pāyattika, the prātideśaṇī, or the tukhila says he doesn't violate it.",
        "source": "T23n1440_009:0562b13_21"
    },
    {
        "source_sentence": "眾僧問言：「汝自說犯不？」",
        "translation": "The saṃgha asked, Do you yourself say it's a violation?",
        "source": "T23n1440_009:0562b14_22"
    },
    {
        "source_sentence": "自言不犯，是名十如法。",
        "translation": "To say oneself that it's not a violation is called the ten ways to follow the Dharma.",
        "source": "T23n1440_009:0562b15_23"
    },
    {
        "source_sentence": "第二事",
        "translation": "second thing",
        "source": "T23n1440_009:0562b16_0"
    },
    {
        "source_sentence": "現前滅諍，有二種非法、二種如法。",
        "translation": "In the present, there are two kinds of unlawfulness and two kinds of righteousness in extinguishing disputes.",
        "source": "T23n1440_009:0562b17_0"
    },
    {
        "source_sentence": "二非法者，有非法僧，約勅非法僧令折伏，與現前滅諍。",
        "translation": "The second is unlawful: when there's an unlawful saṃgha, he commands an unlawful saṃgha to be subdued and extinguished with the cessation of dispute in the present.",
        "source": "T23n1440_009:0562b17_1"
    },
    {
        "source_sentence": "有非法僧，約勅非法三人、二人、一人令折伏，與現前毘尼。",
        "translation": "If there's an unlawful monk, he commands three people, two people, or one person who are unlawful to be subdued and given the present vinaya.",
        "source": "T23n1440_009:0562b19_2"
    },
    {
        "source_sentence": "乃至不如法一人，約勅不如法一人、僧、三人、二人令折伏，與現前毘尼，是名一非法現前毘尼。",
        "translation": "Even if one person who doesn't follow the teaching and orders another person who doesn't follow the teaching, a monk, three people, or two people to be subdued by someone who doesn't follow the teaching and is given a present vinaya, this is called an unlawful present vinaya.",
        "source": "T23n1440_009:0562b20_3"
    },
    {
        "source_sentence": "有不如法僧，約勅如法僧令折伏，與現前毘尼。",
        "translation": "If there's a monk who doesn't follow the Dharma and orders a monk who follows the Dharma to be disciplined, they'll be given the present vinaya.",
        "source": "T23n1440_009:0562b22_4"
    },
    {
        "source_sentence": "有不如法僧，約勅如法三人、二人、一人令折伏，與現前毘尼。",
        "translation": "If there's a monk who doesn't follow the teaching and orders three, two, or one person to be disciplined accordingly, he'll give them the present vinaya.",
        "source": "T23n1440_009:0562b23_5"
    },
    {
        "source_sentence": "乃至不如法一人，約勅如法一人、僧、三人、二人令折伏，與現前毘尼。",
        "translation": "Even if there's one person who doesn't follow the teaching and orders one person who follows the teaching, a monk, three people, or two people to be disciplined, they'll be given the present vinaya.",
        "source": "T23n1440_009:0562b25_0"
    },
    {
        "source_sentence": "是名二非法現前毘尼。",
        "translation": "These are called the two kinds of unlawful present and future vinaya.",
        "source": "T23n1440_009:0562b26_1"
    },
    {
        "source_sentence": "二種如法現前毘尼者，有如法僧，約勅如法僧令折伏，與現前毘尼。",
        "translation": "The two kinds of vinaya that are presented in accordance with the teaching are those who have a Dharma-abiding monk who commands a Dharma-abiding monk to cause it to be subdued, and they're given the present vinaya.",
        "source": "T23n1440_009:0562b27_2"
    },
    {
        "source_sentence": "又如法僧，約勅如法三人、二人、一人令折伏，與現前毘尼。",
        "translation": "Also, if a monk who follows the Dharma orders three people, two people, or one person to be disciplined according to the Dharma and give them the presently presented vinaya.",
        "source": "T23n1440_009:0562b28_3"
    },
    {
        "source_sentence": "乃至如法一人，約勅如法一人、僧、三人、二人令折伏，與現前毘尼，是名一如法現前毘尼。",
        "translation": "Even if one person according to the teaching is instructed by one person according to the teaching and one person, a monk, three people, or two people are ordered to be subdued, and they're given the present vinaya, this is called one who follows the teaching and presents it according to the teaching.",
        "source": "T23n1440_009:0562c01_0"
    },
    {
        "source_sentence": "又如法僧，約勅不如法僧令折伏，與現前毘尼。",
        "translation": "Also, if a monk who follows the teaching of the Dharma is instructed to subdue a monk who doesn't follow the teaching and ordered to be disciplined, they'll be given the present vinaya.",
        "source": "T23n1440_009:0562c03_1"
    },
    {
        "source_sentence": "又如法僧，約勅不如法三人、二人、一人令折伏，與現前毘尼。",
        "translation": "Also, it's like when a monk who follows the Dharma orders three people, two people, or one person who don't follow the Dharma to be disciplined and given the presently presented vinaya.",
        "source": "T23n1440_009:0562c04_2"
    },
    {
        "source_sentence": "乃至如法一人，約勅不如法一人、僧、三人、二人令折伏，與現前毘尼。",
        "translation": "It's up to one person who follows the teaching and commands one person who doesn't follow the teaching, a monk, three people, or two people to subdue them, and they'll be given the present vinaya.",
        "source": "T23n1440_009:0562c05_3"
    },
    {
        "source_sentence": "是名二種如法現前毘尼。",
        "translation": "These are called the two kinds of vinaya that are manifested according to the teaching.",
        "source": "T23n1440_009:0562c07_4"
    },
    {
        "source_sentence": "第三事",
        "translation": "third matter",
        "source": "T23n1440_009:0562c08_0"
    },
    {
        "source_sentence": "此是守護毘尼，三眾盡與憶念毘尼，五篇戒盡與憶念毘尼。",
        "translation": "These are the vinaya for guarding, the vinaya for extinguishing the three congregations and remembering the vinaya, and the five precepts for extinguishing the five precepts and remembering the vinaya.",
        "source": "T23n1440_009:0562c09_0"
    },
    {
        "source_sentence": "與憶念毘尼，必白四羯磨與，或現前或不現前，比丘比丘尼現前、三眾不現前。",
        "translation": "If he gives it to someone who remembers the vinaya, he must tell them the four karmas, whether they're present or not, and the monks and nuns are present but the three groups of people aren't present.",
        "source": "T23n1440_009:0562c10_1"
    },
    {
        "source_sentence": "若比丘得憶念已，若下戒作沙彌，即先憶念。",
        "translation": "If a monk attains recollection after attaining it, or if he follows the precepts and becomes a novice, he first remembers it.",
        "source": "T23n1440_009:0562c12_2"
    },
    {
        "source_sentence": "若反戒還俗後更出家，若作沙彌若受具戒，即先憶念。",
        "translation": "If someone renounces the precepts and leaves home again after returning to secular life, or becomes a novice or receives the full set of precepts, they'll first remember them.",
        "source": "T23n1440_009:0562c13_3"
    },
    {
        "source_sentence": "若根變作比丘尼，即先憶念。",
        "translation": "If his faculties change into monks and nuns, he first remembers them.",
        "source": "T23n1440_009:0562c14_4"
    },
    {
        "source_sentence": "若沙彌得憶念已，若受具戒，即先憶念。",
        "translation": "If a novice attains recollection and receives the full set of precepts, he'll first remember them.",
        "source": "T23n1440_009:0562c15_5"
    },
    {
        "source_sentence": "若返戒還俗後更出家，若作沙彌若受具戒，即先憶念。",
        "translation": "If someone returns to the precepts, returns to lay status, and then leaves home again, or becomes a novice or receives the full set of precepts, they'll first remember them.",
        "source": "T23n1440_009:0562c16_0"
    },
    {
        "source_sentence": "若根變作沙彌尼，亦即先憶念。",
        "translation": "If his faculties change into novices, he also first remembers them.",
        "source": "T23n1440_009:0562c17_1"
    },
    {
        "source_sentence": "若比丘尼、式叉摩尼、沙彌尼得憶念已，展轉次第如比丘、沙彌法。",
        "translation": "If the bhikṣuṇīs, śikṣamāṇīs, and śrāmaṇīs attain recollection, they will follow one another in order according to the rules of the monks and śrāmaṇeras.",
        "source": "T23n1440_009:0562c17_2"
    },
    {
        "source_sentence": "有三種非法憶念毘尼、有三種如法憶念毘尼。",
        "translation": "There are three kinds of unlawful recollection of the vinaya and three kinds of proper recollection of the vinaya.",
        "source": "T23n1440_009:0562c19_3"
    },
    {
        "source_sentence": "三種非法者，有比丘犯無殘罪，自言犯有殘罪。",
        "translation": "The three kinds of unlawfulness are when a monk commits an offense that's not a grave offense and declares himself to have committed a grave offense.",
        "source": "T23n1440_009:0562c20_4"
    },
    {
        "source_sentence": "是比丘從僧乞憶念毘尼，若僧與是比丘憶念毘尼，是名非法。",
        "translation": "That monk asks the saṃgha to remember the vinaya, and if the saṃgha gives it to that monk to remember the vinaya, this is called an unlawful thing.",
        "source": "T23n1440_009:0562c21_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1440_009:0562c23_0"
    },
    {
        "source_sentence": "是人應滅擯故。",
        "translation": "It's because this person should cease anger.",
        "source": "T23n1440_009:0562c23_1"
    },
    {
        "source_sentence": "又如施越比丘，狂癡心故，多作不清淨非法不隨順道非沙門法。",
        "translation": "It's also like a donor monk who, because of his crazy mind, often does impure and unlawful things that don't follow the path and aren't the ascetic dharmas.",
        "source": "T23n1440_009:0562c23_2"
    },
    {
        "source_sentence": "是人還得本心，先所作罪，若僧、三人、二人、一人常說是事。",
        "translation": "If the saṃgha, three people, two people, or one person always talks about this matter, that person will return to their original mind and be guilty of what they did before.",
        "source": "T23n1440_009:0562c25_3"
    },
    {
        "source_sentence": "是人從僧乞憶念毘尼，若僧與是人憶念毘尼，是名非法。",
        "translation": "That person asks the saṃgha to remember the vinaya from the saṃgha, and if the saṃgha gives it to that person to remember the vinaya, this is called unlawful.",
        "source": "T23n1440_009:0562c26_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1440_009:0562c27_5"
    },
    {
        "source_sentence": "是人應與不癡毘尼故。",
        "translation": "That person should give it to someone who doesn't be deluded about the vinaya.",
        "source": "T23n1440_009:0562c27_6"
    },
    {
        "source_sentence": "又如呵多比丘，無慚無愧破戒見聞疑罪，是人自言我有是罪，後言我無是罪。",
        "translation": "Again, if a monk Hatthaka is shameless and disrespectful, violates the precepts, sees and doubts about sins, that person says to himself, 'I have this sin,' and then he says, 'I have no such sin.'",
        "source": "T23n1440_009:0562c28_7"
    },
    {
        "source_sentence": "若僧與是人憶念毘尼，是名非法。",
        "translation": "If the saṃgha and that person are mindful of the vinaya, this is called an unlawful thing.",
        "source": "T23n1440_009:0563a01_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1440_009:0563a02_0"
    },
    {
        "source_sentence": "是人應與實覓毘尼故。",
        "translation": "That person should give it to someone who really searches the Vinaya.",
        "source": "T23n1440_009:0563a02_1"
    },
    {
        "source_sentence": "是名三非法憶念毘尼。",
        "translation": "These are called the three unlawful ways to remember the vinaya.",
        "source": "T23n1440_009:0563a02_2"
    },
    {
        "source_sentence": "三如法者，又如陀驃比丘，為慈地比丘尼無根波羅夷謗故，若僧、三人、二人、一人常說是事。",
        "translation": "Third, according to the teaching, it's also like a monk who says this for the sake of the bhikṣuṇī Maitreya because he or she doesn't have the faculties to denigrate the pārājika, and if the saṃgha, three people, two people, or one person always explains this matter.",
        "source": "T23n1440_009:0563a03_3"
    },
    {
        "source_sentence": "是比丘從僧乞憶念毘尼，若僧與是人憶念毘尼，是名如法。",
        "translation": "That monk asks the saṃgha to remember the vinaya, and if the saṃgha gives it to that person to remember the vinaya, this is called following the teaching.",
        "source": "T23n1440_009:0563a05_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1440_009:0563a06_5"
    },
    {
        "source_sentence": "是人應與憶念毘尼故。",
        "translation": "That person should give it to someone who remembers the vinaya.",
        "source": "T23n1440_009:0563a06_6"
    },
    {
        "source_sentence": "又如一比丘犯罪，是罪發露如法悔過除滅。",
        "translation": "Again, it's like a monk who commits a sin and reveals the offense in accordance with the rules to repent and remove it.",
        "source": "T23n1440_009:0563a07_7"
    },
    {
        "source_sentence": "若僧、三人、二人、一人猶說是事。",
        "translation": "If the saṃgha, three people, two people, or one person still explains this matter.",
        "source": "T23n1440_009:0563a08_8"
    },
    {
        "source_sentence": "是比丘從僧乞憶念毘尼，若僧與憶念毘尼，是名如法。",
        "translation": "That monk asks the saṃgha to remember the vinaya, and if the saṃgha gives it to him to remember the vinaya, this is called following the teaching.",
        "source": "T23n1440_009:0563a09_9"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1440_009:0563a10_10"
    },
    {
        "source_sentence": "是人應與憶念毘尼故。",
        "translation": "That person should give it to someone who remembers the vinaya.",
        "source": "T23n1440_009:0563a10_11"
    },
    {
        "source_sentence": "又如比丘未犯是罪、將必當犯，以是事故，若僧、三人、二人、一人說是犯罪。",
        "translation": "It's also like a monk who hasn't committed this offense and will surely commit it, and because of these things, if the saṃgha, three people, two people, or one person says it's a crime.",
        "source": "T23n1440_009:0563a11_12"
    },
    {
        "source_sentence": "是比丘從僧乞憶念毘尼，若僧與是人憶念毘尼，是名如法。",
        "translation": "That monk asks the saṃgha to remember the vinaya, and if the saṃgha gives it to that person to remember the vinaya, this is called following the teaching.",
        "source": "T23n1440_009:0563a12_13"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1440_009:0563a14_14"
    },
    {
        "source_sentence": "是人應與憶念毘尼故。",
        "translation": "That person should give it to someone who remembers the vinaya.",
        "source": "T23n1440_009:0563a14_15"
    },
    {
        "source_sentence": "是名三如法憶念毘尼。",
        "translation": "These are called the three ways to remember the vinaya according to the teaching.",
        "source": "T23n1440_009:0563a14_16"
    },
    {
        "source_sentence": "憶念毘尼行法者，餘比丘不應出其罪過、不應令憶念、不應乞聽亦不應受餘比丘乞聽，若彼從乞聽突吉羅，若受他乞聽亦突吉羅。",
        "translation": "If someone remembers the vinaya and practices it, other monks shouldn't be expelled from their sins, made to remember it, begged to hear it, or accepted another monk's request to hear it, and if they were to ask to hear it from a beggar, they would also hear it, and if they were to accept another person's request to hear it, they would also hear it.",
        "source": "T23n1440_009:0563a15_17"
    },
    {
        "source_sentence": "若彼不聽若出過罪、若令憶念，得波夜提。",
        "translation": "If they don't listen, confess their sins, or cause them to be remembered, they'll attain pāyattika.",
        "source": "T23n1440_009:0563a18_18"
    },
    {
        "source_sentence": "第四事",
        "translation": "fourth matter",
        "source": "T23n1440_009:0563a20_0"
    },
    {
        "source_sentence": "此是守護毘尼，五眾盡與不癡毘尼。",
        "translation": "This is the guardian vinaya, which explains that the five groups of people are given to those who aren't deluded.",
        "source": "T23n1440_009:0563a21_0"
    },
    {
        "source_sentence": "與不癡毘尼，必白四羯磨，或與現前或不現前，比丘比丘尼現前、三眾不現前。",
        "translation": "To give the non-deluded vinaya, he must tell the four karmas, whether it's present or not, and the monks and nuns are present and the three groups of people aren't present.",
        "source": "T23n1440_009:0563a21_1"
    },
    {
        "source_sentence": "若比丘得不癡毘尼已，若下戒作沙彌，即先不癡毘尼。",
        "translation": "If a monk has attained the Vinaya of not being deluded and follows the precepts to become a novice, that's when he first doesn't forget the Vinaya.",
        "source": "T23n1440_009:0563a23_2"
    },
    {
        "source_sentence": "若反戒還俗後更出家，若作沙彌若受具戒，即先不癡毘尼。",
        "translation": "If someone renounces the precepts and leaves home again after returning to secularism, or becomes a novice or receives the full set of precepts, that's when they first don't forget the vinaya.",
        "source": "T23n1440_009:0563a24_3"
    },
    {
        "source_sentence": "若根變作比丘尼，即先不癡毘尼。",
        "translation": "If his faculties change into monks and nuns, that's when he first doesn't forget the vinaya.",
        "source": "T23n1440_009:0563a26_4"
    },
    {
        "source_sentence": "若沙彌得不癡毘尼已，若受具戒，即先不癡毘尼。",
        "translation": "If a novice attains the vinaya of not being deluded and receives the full set of precepts, that's when he first attains the vinaya of not being deluded.",
        "source": "T23n1440_009:0563a26_5"
    },
    {
        "source_sentence": "若反戒還俗後更出家，若作沙彌若受具戒，即先不癡毘尼。",
        "translation": "If someone renounces the precepts and leaves home again after returning to secularism, or becomes a novice or receives the full set of precepts, that's when they first don't forget the vinaya.",
        "source": "T23n1440_009:0563a28_6"
    },
    {
        "source_sentence": "若根變作沙彌尼，亦即先不癡毘尼。",
        "translation": "If someone's faculties change into novice nuns, they also first don't forget the vinaya.",
        "source": "T23n1440_009:0563a29_7"
    },
    {
        "source_sentence": "若比丘尼、式叉摩尼、沙彌尼得不癡毘尼已，展轉次第如比丘、沙彌法。",
        "translation": "If a bhikṣuṇī, a śikṣamāṇi, or a novice nun has attained the vinaya of not being deluded, they'll follow it one after another in order according to the rules for monks and novices.",
        "source": "T23n1440_009:0563b01_8"
    },
    {
        "source_sentence": "不癡毘尼有四種非法、四種如法。",
        "translation": "There are four kinds of non-deluded vinaya that are unlawful and four kinds that are according to the teaching.",
        "source": "T23n1440_009:0563b02_9"
    },
    {
        "source_sentence": "四種非法者，有比丘不癡狂現狂癡相貌，諸比丘僧中問：「汝狂癡時所作今憶念不？」",
        "translation": "The four kinds of unlawfulness are when a monk isn't deluded and shows the appearance of delusion, and the monks and saṃgha ask, Do you remember what you did while you were deluded?",
        "source": "T23n1440_009:0563b03_10"
    },
    {
        "source_sentence": "答言：「長老！",
        "translation": "He replied, Elder!",
        "source": "T23n1440_009:0563b05_11"
    },
    {
        "source_sentence": "我憶念癡故作。」",
        "translation": "I'll do it because of the delusion of recollection.",
        "source": "T23n1440_009:0563b05_12"
    },
    {
        "source_sentence": "他人教我，使作二憶。",
        "translation": "Someone teaches me to make two kinds of recollection.",
        "source": "T23n1440_009:0563b06_13"
    },
    {
        "source_sentence": "夢中，作三憶。",
        "translation": "In a dream, he creates three recollections.",
        "source": "T23n1440_009:0563b06_14"
    },
    {
        "source_sentence": "裸形、東西走、立大小便，四也。",
        "translation": "It's naked, walking east and west, standing and relieving themselves, and defecating.",
        "source": "T23n1440_009:0563b06_15"
    },
    {
        "source_sentence": "是人從僧乞不癡毘尼，若僧與是人不癡毘尼，是名四非法。",
        "translation": "That person begs from the saṃgha and doesn't forget the vinaya, and if the saṃgha gives it to that person and doesn't forget the vinaya, these are called the four unlawful things.",
        "source": "T23n1440_009:0563b07_16"
    },
    {
        "source_sentence": "四如法者，有比丘實狂癡心顛倒現狂癡相貌，諸比丘問：「汝憶念狂癡時所作不？」",
        "translation": "Fourth, according to the teaching, when a monk's mind is really crazy and deluded and he shows the appearance of being crazy, the monks ask, Do you remember what you did when you were crazy?",
        "source": "T23n1440_009:0563b09_0"
    },
    {
        "source_sentence": "答言：「不憶念他不教我作、不憶念夢中作、不憶裸形東西走、不憶立大小便。」",
        "translation": "He replied, They don't remember others and don't teach me to do it, don't remember doing it in a dream, don't remember walking east or west in naked form, and don't remember urinating or defecating.",
        "source": "T23n1440_009:0563b10_1"
    },
    {
        "source_sentence": "是人從僧乞不癡比尼，若僧與是人不癡毘尼，是名四如法不癡毘尼。",
        "translation": "That person begs from the saṃgha and doesn't become deluded about the vinaya, and if the saṃgha gives it to that person and doesn't become deluded about the vinaya, these are called the four ways he doesn't become deluded about the vinaya according to the teaching.",
        "source": "T23n1440_009:0563b12_2"
    },
    {
        "source_sentence": "得不癡毘尼行法者，餘比丘不應出其過罪、不應令憶念、不應從乞聽亦不應受他比丘乞聽。",
        "translation": "If someone attains the practice of not being deluded about the vinaya, the other monks shouldn't be expelled from their faults, remembered, begged to listen, or accepted by another monk.",
        "source": "T23n1440_009:0563b14_3"
    },
    {
        "source_sentence": "若從彼乞聽得突吉羅，若受他乞聽亦得突吉羅。",
        "translation": "If someone begs and hears from them, they'll attain purgatory, and if they accept another person's request and hear it, they'll also attain purgatory.",
        "source": "T23n1440_009:0563b16_4"
    },
    {
        "source_sentence": "若彼不聽便出過罪、若令憶念，得波夜提罪。",
        "translation": "If they don't hear it, then they'll be released from their sins and if they cause them to remember it, they'll be guilty of the offense of pāyattika.",
        "source": "T23n1440_009:0563b17_5"
    },
    {
        "source_sentence": "第五事",
        "translation": "fifth matter",
        "source": "T23n1440_009:0563b19_0"
    },
    {
        "source_sentence": "此是折伏毘尼，一切五篇戒盡與實覓毘尼，一切五眾盡與此毘尼。",
        "translation": "These are the rules for refuting vinaya, which give up all five pieces of the precepts to the real search for vinaya and all five groups of people who give up this vinaya.",
        "source": "T23n1440_009:0563b20_0"
    },
    {
        "source_sentence": "比丘比丘尼現前、三眾不現前，白四羯磨與。",
        "translation": "The monks and nuns who are present and the three groups of people who aren't present tell the four karmas to give them.",
        "source": "T23n1440_009:0563b21_1"
    },
    {
        "source_sentence": "實覓毘尼有五種非法、五種如法。",
        "translation": "In truth, there are five kinds of non-dharmas and five kinds of ways to search for the vinaya.",
        "source": "T23n1440_009:0563b22_2"
    },
    {
        "source_sentence": "五種非法者，有比丘犯波羅夷罪，先言不犯、後言犯。",
        "translation": "The five kinds of unlawfulness are when a monk commits the sin of pārājika and first says he doesn't violate it and then he violates it.",
        "source": "T23n1440_009:0563b23_3"
    },
    {
        "source_sentence": "若僧與是人實覓毘尼，是名非法。",
        "translation": "If the saṃgha and that person really search for a vinaya, this is called an unlawful thing.",
        "source": "T23n1440_009:0563b24_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1440_009:0563b25_5"
    },
    {
        "source_sentence": "是人應與滅擯故。",
        "translation": "It's because that person should be given the cessation of anger.",
        "source": "T23n1440_009:0563b25_6"
    },
    {
        "source_sentence": "有比丘犯僧殘、波夜提、波羅提提舍尼、突吉羅，先言不犯、後言犯。",
        "translation": "If a monk violates the saṃgha's precepts, pāyattika, pārotiṣṭiśanīya, or tukhila, he first says he doesn't violate them and then he violates them.",
        "source": "T23n1440_009:0563b25_7"
    },
    {
        "source_sentence": "若僧與是人實覓毘尼，是名非法。",
        "translation": "If the saṃgha and that person really search for a vinaya, this is called an unlawful thing.",
        "source": "T23n1440_009:0563b27_8"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1440_009:0563b28_9"
    },
    {
        "source_sentence": "是人隨所犯應治故。",
        "translation": "It's because that person should be disciplined according to what they violate.",
        "source": "T23n1440_009:0563b28_10"
    },
    {
        "source_sentence": "五如法者，有比丘犯波羅夷，先言犯、後言不犯。",
        "translation": "Five, it's according to the teaching that if a monk violates the pārājika, he first says he violates it and then he doesn't violate it.",
        "source": "T23n1440_009:0563b28_11"
    },
    {
        "source_sentence": "若僧與是人實覓毘尼，是名如法。",
        "translation": "If the saṃgha and that person really search for a vinaya, this is called following the teaching.",
        "source": "T23n1440_009:0563b29_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1440_009:0563c01_13"
    },
    {
        "source_sentence": "是人應與實覓故。",
        "translation": "It's because that person should search for the real.",
        "source": "T23n1440_009:0563c01_14"
    },
    {
        "source_sentence": "若比丘犯僧殘、波夜提、波羅提提舍尼、突吉羅，先言犯、後言不犯。",
        "translation": "If a monk violates the saṃgha's precepts, pāyattika, pārotiṣṭiśanīya, or pratyekabuddha, he first says he violates them and then he doesn't violate them.",
        "source": "T23n1440_009:0563c02_15"
    },
    {
        "source_sentence": "若僧與是比丘實覓毘尼，是名如法。",
        "translation": "If the saṃgha and that monk really search for a vinaya, this is called following the teaching.",
        "source": "T23n1440_009:0563c03_16"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1440_009:0563c04_17"
    },
    {
        "source_sentence": "是人應與實覓毘尼故。",
        "translation": "That person should give it to someone who really searches the Vinaya.",
        "source": "T23n1440_009:0563c04_18"
    },
    {
        "source_sentence": "實覓毘尼行法者，是比丘不應與他受大戒，不得受他依止，不應畜新舊沙彌，不得教比丘尼法，若僧羯磨教化比丘尼不應受，僧所與作實覓毘尼罪更不應犯，若似是罪及過是罪亦不應作，不應呵僧羯磨亦不應呵作羯磨人，不應從他乞聽，不應遮說戒，不應遮受戒，不應遮自恣，不應出無罪比丘過罪，不應共同事。",
        "translation": "A bhikṣu should not give the great precepts to others; he should not accept another’s support; he should not keep new or old śrāmaṇeras [for religious practice]; he should not teach the Dharma to bhikṣuṇīs. If a bhikṣu or bhikṣuṇī who has been converted by the sangha is not allowed to receive them, and if a bhikṣu or bhi",
        "source": "T23n1440_009:0563c05_19"
    },
    {
        "source_sentence": "應調伏心行隨順比丘僧意。",
        "translation": "They should tame their minds and conduct themselves in accordance with the monks' and saṃgha's wishes.",
        "source": "T23n1440_009:0563c12_20"
    },
    {
        "source_sentence": "若不如是行法者，盡形不得離是羯磨。",
        "translation": "If someone doesn't thus practice, they won't be allowed to part with this karma in their entirety.",
        "source": "T23n1440_009:0563c13_21"
    },
    {
        "source_sentence": "第六事",
        "translation": "sixth matter",
        "source": "T23n1440_009:0563c15_0"
    },
    {
        "source_sentence": "多覓毘尼者，多求因緣斷，多處未斷，從多人斷故，名多覓毘尼。",
        "translation": "Someone who searches for a lot of vinaya often seeks causes and conditions to stop it, but in many places it's not stopped; because it's stopped by many people, it's called searching for a lot of vinaya.",
        "source": "T23n1440_009:0563c16_0"
    },
    {
        "source_sentence": "行籌時、斷事時，一切僧集，不得取欲。",
        "translation": "When he practices the tokens, or when he stops doing things, all the saṃgha gathers and doesn't allow him to grasp desire.",
        "source": "T23n1440_009:0563c17_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1440_009:0563c18_2"
    },
    {
        "source_sentence": "或多比丘說非法故。",
        "translation": "Perhaps many monks say it's because it's unlawful.",
        "source": "T23n1440_009:0563c18_3"
    },
    {
        "source_sentence": "是名一切行籌。",
        "translation": "This is called the chip of all practices.",
        "source": "T23n1440_009:0563c19_0"
    },
    {
        "source_sentence": "此中一切比丘不應取欲，如行鉢法也。",
        "translation": "Here, all monks shouldn't take desires, just as they do with the practice of the bowl.",
        "source": "T23n1440_009:0563c19_1"
    },
    {
        "source_sentence": "若不能斷，乃至彼處僧坊中，若有三人二人一人比丘持三藏四眾所重者，應到彼處，應語彼一比丘，如前次第事具足向說。",
        "translation": "If you can't stop it, even if there are three people, two people, or one monk in a saṃgha hall at that place who hold the treasures of the tripiṭaka and four members of the fourfold assembly, you should go there, speak to that monk, and explain them in order as before.",
        "source": "T23n1440_009:0563c20_2"
    },
    {
        "source_sentence": "是大德比丘應作是語：「不可二人相言俱得勝也，是中必一勝一負。」",
        "translation": "That monk of great virtue should say, You mustn't say that two people can both be victorious in terms of their characteristics; there must be one victory and one defeat here.",
        "source": "T23n1440_009:0563c23_3"
    },
    {
        "source_sentence": "如是語者，是名如法說。",
        "translation": "Such words are called speaking according to the teaching.",
        "source": "T23n1440_009:0563c24_4"
    },
    {
        "source_sentence": "若不如是語者，是名非法說。",
        "translation": "If someone doesn't say this, they're called speaking unlawfully.",
        "source": "T23n1440_009:0563c25_5"
    },
    {
        "source_sentence": "是諸相言比丘若如法斷事已，還更發起，波逸提。",
        "translation": "If these signs say that a monk stops things according to the teaching and then resumes them again, pratyekabuddha.",
        "source": "T23n1440_009:0563c25_6"
    },
    {
        "source_sentence": "若但訶責，言是斷事不如法，犯突吉羅。",
        "translation": "If someone simply reprimands them, saying that they're cutting off things that aren't according to the rules, it's a violation of the grave offense.",
        "source": "T23n1440_009:0563c27_7"
    },
    {
        "source_sentence": "闥賴吒利者，闥賴名地、吒利名住，智勝自在於正法不動，如人住地無傾覆也。",
        "translation": "Śāriputra means that Śāriputra is called earth and Śāriputra is called abiding, and his knowledge is superior because he doesn't budge from the right teaching, just as a person abides in the ground without overturning it.",
        "source": "T23n1440_009:0563c28_0"
    },
    {
        "source_sentence": "應滅期者，恐事纏難斷，當云受語有偏故，亦恐前人求及於己故也。",
        "translation": "It should be stated that it is because there are partial feelings and verbal expressions. Also, because one fears that the person before him or her might seek [the precepts] together with oneself.",
        "source": "T23n1440_009:0563c29_1"
    },
    {
        "source_sentence": "應捨付僧者，以從僧中來，既不能滅，宜還付本故也。",
        "translation": "Those who should abandon and pay to the saṃgha because they came from among the saṃgha, and since they can't be extinguished, it's better to return and pay back the original.",
        "source": "T23n1440_009:0564a02_2"
    },
    {
        "source_sentence": "僧現前者，明僧既集，中有能遮者而不遮，則僧和合，名現前也。",
        "translation": "When the saṃgha is manifested, it means that once the saṃgha has gathered, there's something that can be obscured but isn't obscured, and when the saṃgha combines, it's called manifesting.",
        "source": "T23n1440_009:0564a03_3"
    },
    {
        "source_sentence": "烏迴鳩羅者，烏迴名二、鳩羅名平等，心無二其平如秤。",
        "translation": "The eunuch is called two, and the eunuch is called equal, and his mind is without duality, which is as flat as a scale.",
        "source": "T23n1440_009:0564a05_0"
    },
    {
        "source_sentence": "今必以二人有五法。",
        "translation": "Now, it must be because there are five dharmas for two people.",
        "source": "T23n1440_009:0564a06_1"
    },
    {
        "source_sentence": "五法者，不隨愛故捨有罪、不隨瞋故罰無過、不畏彼故而違法、不癡故不畏罪非法輕斷事也、知斷不斷，故名烏迴鳩羅。",
        "translation": "The five dharmas are that they abandon blameworthiness because they don't follow craving, aren't punished because they don't follow anger, aren't unlawful because they don't fear it, aren't afraid of what's unlawful because they aren't deluded, don't despise things that are unlawful because they don't fear faults, and know",
        "source": "T23n1440_009:0564a06_2"
    },
    {
        "source_sentence": "與欲以小遠去者，恐僧中有相佐助事，必叵斷故也。",
        "translation": "Those who want to go far away from the monastery because they're afraid that there will be members of the saṃgha who assist them, and they won't be able to stop it.",
        "source": "T23n1440_009:0564a09_3"
    },
    {
        "source_sentence": "所以取欲者，令有相助者後更無言故。",
        "translation": "The reason for grasping desire is that it causes those who are assisted by characteristics to have no words after them.",
        "source": "T23n1440_009:0564a10_4"
    },
    {
        "source_sentence": "更立烏迴鳩羅者，諍事逐增，恐有破僧之由妨行道故。",
        "translation": "The reason for establishing the name Ugrakula is that debauchery increases gradually, and it's feared that there might be a cause for breaking the saṃgha because it obstructs the practice of the path.",
        "source": "T23n1440_009:0564a11_5"
    },
    {
        "source_sentence": "故更差多方能善斷事者，不必具五法也。",
        "translation": "Therefore, it's not necessary to have five dharmas that can be skillfully eliminated in many ways.",
        "source": "T23n1440_009:0564a13_6"
    },
    {
        "source_sentence": "遣使近處僧者，若就他處事必增多難斷，故遣使也。",
        "translation": "A messenger who sends an envoy to a nearby saṃgha means that if he goes to another place, things will surely increase and become difficult to stop, so he sends an envoy.",
        "source": "T23n1440_009:0564a14_7"
    },
    {
        "source_sentence": "彼既來已，若彼中能者云七日盡已破安居者，以未開三十九夜故也。",
        "translation": "After he comes, if he's able to do so, he says seven days have ended and he breaks up his retreat because the thirty-nine nights haven't yet opened.",
        "source": "T23n1440_009:0564a15_8"
    },
    {
        "source_sentence": "開某處乃至持摩多勒伽者，佛法有二柱能持佛法，謂坐禪、學問，故求此人輩。",
        "translation": "He who opens a certain place up to the point where he maintains the mātṛkā has two pillars of the Buddha's teaching that can support the Buddha's teaching, which are sitting meditation and training, so he seeks this group of people.",
        "source": "T23n1440_009:0564a16_9"
    },
    {
        "source_sentence": "亦中有大德人，令諍事羞難故也。",
        "translation": "Also, there's a great virtuous person among them who makes it difficult to deceive others.",
        "source": "T23n1440_009:0564a18_10"
    },
    {
        "source_sentence": "傳事人斷者，恐至他處難滅，亦望其人向他處，僧有愧，受諫故。",
        "translation": "A messenger who stops it because he's afraid it won't be easy to extinguish it if he goes to another place, and he also expects that person to go to another place, so the saṃgha is ashamed and receives an admonition.",
        "source": "T23n1440_009:0564a19_11"
    },
    {
        "source_sentence": "又坐禪道遠之勞故、亦惡事得滅為善故。",
        "translation": "It's also because the path of sitting meditation is far removed from the trouble, and it's because goodness ceases bad things as well.",
        "source": "T23n1440_009:0564a21_0"
    },
    {
        "source_sentence": "作期者，以事起從夏故，除夏三月，取餘九月明事。",
        "translation": "The duration of action is because the actual entities are produced from summer. Exception made for three months in summer, the other nine months are taken to clarify the actual entities.",
        "source": "T23n1440_009:0564a21_1"
    },
    {
        "source_sentence": "若叵斷，其當作方宜令斷，莫令還至夏分也。",
        "translation": "If they can't be cut, it's appropriate for them to be cut; don't let them return to the summer retreat.",
        "source": "T23n1440_009:0564a23_2"
    },
    {
        "source_sentence": "若能者，付以傳事便還。",
        "translation": "If he can, he'll send it to the messenger and return it.",
        "source": "T23n1440_009:0564a24_3"
    },
    {
        "source_sentence": "所以界外令滿眾者，明差四人使界外滅。",
        "translation": "The reason he causes the crowd to be filled outside the boundary is to explain that he sends four people outside the boundary to cease.",
        "source": "T23n1440_009:0564a24_4"
    },
    {
        "source_sentence": "若事可斷，必令後不起故、以重故也。",
        "translation": "If something can be stopped, it will surely cause later non-arising because of its severity.",
        "source": "T23n1440_009:0564a25_5"
    },
    {
        "source_sentence": "為五事故，立行籌人也、疾滅也。",
        "translation": "It's for five reasons that he establishes the person who practices and stops his illness.",
        "source": "T23n1440_009:0564a26_6"
    },
    {
        "source_sentence": "強者有三：一其人身有力、二倚有力人、三有錢力往來。",
        "translation": "There are three kinds of strong people: 1. those whose bodies are powerful, 2. those who rely on someone who's powerful, and 3. those who have money and power to come and go.",
        "source": "T23n1440_009:0564a27_7"
    },
    {
        "source_sentence": "從一住處至一住處者，明事久，既經多處不斷，事纏堅結。",
        "translation": "“From one residence up to one residence”: It is said that the actual entities last for a long time. After going through many places, they are not discontinued. The actual entities are bound by strong fetters.",
        "source": "T23n1440_009:0564a28_8"
    },
    {
        "source_sentence": "其人無慚無愧心轉姦巧故。",
        "translation": "It's because that person has no shame and no modesty and their minds become adulterous.",
        "source": "T23n1440_009:0564a29_9"
    },
    {
        "source_sentence": "所以行籌者，事既難斷，若說一是一非，必增其惡心，故行籌於眾人前，好惡自伏、理亦無偏。",
        "translation": "It's because it's difficult to stop, and if someone says one thing is right or wrong, they must increase their bad thoughts. Therefore, the practitioner conducts himself in front of people, subduing good and evil on his own and with no partiality in principle.",
        "source": "T23n1440_009:0564b01_10"
    },
    {
        "source_sentence": "藏行籌者，行籌人心為非法人故，望取非法者多。",
        "translation": "Someone who stores and practices chips because the practitioner's mind is an unlawful person, and there are many people who hope to take what's unlawful.",
        "source": "T23n1440_009:0564b03_11"
    },
    {
        "source_sentence": "若在明處助非法者，著取非法籌故也。",
        "translation": "If someone helps what's unlawful in a clear place, they're addicted to taking an unlawful chip.",
        "source": "T23n1440_009:0564b04_12"
    },
    {
        "source_sentence": "期行者，要共，相親者，作要也。",
        "translation": "Someone who practices with an intention to share the essentials and those who are intimate with each other make the essentials.",
        "source": "T23n1440_009:0564b05_13"
    },
    {
        "source_sentence": "一切僧取籌者，以此事重故，一切悉集說戒自恣。",
        "translation": "Because of the seriousness of this matter, all the saṃgha gathered together to preach the precepts for self-restraint.",
        "source": "T23n1440_009:0564b06_14"
    },
    {
        "source_sentence": "雖要猶有不來，此將欲令相助者後無語故，亦恐受欲人多取非法籌故。",
        "translation": "Even though there's still someone who doesn't come, this is because they want to help each other and have no words later, and they're afraid that the person who wants to receive it will often take an unlawful chip.",
        "source": "T23n1440_009:0564b07_15"
    },
    {
        "source_sentence": "四眾所尊重者，以上取二種籌、停等叵斷故，就有德人，眾所歸伏無不用語故，有不隨者羞亦為諸人所笑，必受語，傳事人多說事不說人，大德比丘亦直說事是非不說人。",
        "translation": "The fourth is honored by the congregation because the above two kinds of chip and stopping are unacceptable, so there are virtuous people who take the above-mentioned two kinds of chip and stop. Because they don't use words, those who don't follow them will be shameful and laughed at by others, and they will surely accept their words.",
        "source": "T23n1440_009:0564b09_16"
    },
    {
        "source_sentence": "有事二人各自內知而伏，則勝負相現也。",
        "translation": "If there are two things that each know and subdue themselves internally, then the characteristic of superiority and inferiority will appear.",
        "source": "T23n1440_009:0564b13_17"
    },
    {
        "source_sentence": "還發起波逸提者，以二罪印之，令彼此後更無言，故結罪也。",
        "translation": "Those who again give rise to pratyekabuddhas will be stamped with two offenses that cause them to have no words after each other, so they'll be condemned.",
        "source": "T23n1440_009:0564b14_18"
    },
    {
        "source_sentence": "第七事",
        "translation": "seventh deed",
        "source": "T23n1440_009:0564b16_0"
    },
    {
        "source_sentence": "何以名布草毘尼？",
        "translation": "What's the name of the discipline of spreading grass?",
        "source": "T23n1440_009:0564b17_0"
    },
    {
        "source_sentence": "或有一住處，諸比丘喜鬪諍相言。",
        "translation": "Sometimes there's a dwelling place where the monks like to fight and say.",
        "source": "T23n1440_009:0564b17_1"
    },
    {
        "source_sentence": "是諸比丘應和合一處已，應作是念：「諸長老！",
        "translation": "After these monks are reconciled and united, they should think, Elders!",
        "source": "T23n1440_009:0564b18_2"
    },
    {
        "source_sentence": "我等大失非得、大衰非利、大惡不善。",
        "translation": "We have great errors that are not attained, great failures that are not benefits, and great evils that are not good.",
        "source": "T23n1440_009:0564b19_3"
    },
    {
        "source_sentence": "我等以信故，佛法中出家求道，然今喜鬪諍相言。",
        "translation": "Because of our faith, we renounced the householder’s life to seek the path in the buddha-dharma. But now we delight in fighting and bragging [against each other].",
        "source": "T23n1440_009:0564b20_0"
    },
    {
        "source_sentence": "若我等求是事根本者，僧中或未起事便起、已起事不可滅。」",
        "translation": "If we seek the root of these things, then something that hasn't yet arisen in the saṃgha will arise and something that has already arisen won't cease.",
        "source": "T23n1440_009:0564b21_1"
    },
    {
        "source_sentence": "作是念故白僧：「若僧時到僧忍聽，是事以布草毘尼滅。",
        "translation": "Because of this thought, he said to the saṃgha, If the saṃgha arrives at the saṃgha's time and listens to the saṃgha forbearance, this matter will be extinguished by covering it with grass and vinaya.",
        "source": "T23n1440_009:0564b22_2"
    },
    {
        "source_sentence": "是名白。」",
        "translation": "This is called white.",
        "source": "T23n1440_009:0564b23_3"
    },
    {
        "source_sentence": "諸比丘應分作二部，是中若有上座大長老，應語此一部言：「我等大失非得、大衰非利、大惡非善。",
        "translation": "The bhikṣus should be divided into two divisions: if there is a superior monk or a great elder among them, he should address this section, saying: “Our great loss is not gaining; our great loss is not losing; our great loss is not gaining; and our great evil is not doing good.",
        "source": "T23n1440_009:0564b23_4"
    },
    {
        "source_sentence": "我等信故，佛法中出家求道，然今喜鬪諍相言。",
        "translation": "Because of our faith, we renounced the householder’s life to seek the path in the buddha-dharma. But now we delight in fighting and bragging [against each other].",
        "source": "T23n1440_009:0564b26_5"
    },
    {
        "source_sentence": "若我當自屈意，我等所作罪，除偷蘭罪、除白衣相應罪，是汝等現前發露悔過不覆藏。」",
        "translation": "If I were to bend my own mind and commit the sins that I've committed, except for the sin of stealing or the sin associated with white robes, you would now reveal your repentance and not hide it.",
        "source": "T23n1440_009:0564b27_6"
    },
    {
        "source_sentence": "是中若無一比丘遮是事者，應到第二部眾所，是中若有長老上座，應語言：「我等大失非得、大衰非利、大惡非善。",
        "translation": "If there's not a single monk here who obscures this matter, he should go to the second group of people. If there are elders and senior monks among them, they should say, 'We have great loss that's not gained, great decline that's not gained, great evil that's not good, and great evil that's not good.",
        "source": "T23n1440_009:0564b29_7"
    },
    {
        "source_sentence": "我等信故，佛法中出家求道，今喜鬪諍相言。",
        "translation": "Because of our faith, we renounced the householder’s life to seek the path in the buddha-dharma.",
        "source": "T23n1440_009:0564c02_8"
    },
    {
        "source_sentence": "若我等求是事根本者，僧中或有未起事便起、已起事不可滅。",
        "translation": "If we seek the root of these things, then there might be something that has yet to arise in the saṃgha that will arise and something that has already arisen that can't be extinguished.",
        "source": "T23n1440_009:0564c03_9"
    },
    {
        "source_sentence": "今汝等當自屈意，我等所作罪，除偷蘭遮、除白衣相應罪，今自為及為彼故，當現前發露悔過不覆藏。」",
        "translation": "Now, you must bend over backwards to yourselves and think that the sins we've committed will be removed from the sins associated with pārājika and white robes, and now for our own sake and for their sake, we'll clearly express our repentance without covering it.",
        "source": "T23n1440_009:0564c05_10"
    },
    {
        "source_sentence": "諸比丘言：「汝自見罪不？」",
        "translation": "The monks said, Do you yourself see the sin?",
        "source": "T23n1440_009:0564c07_11"
    },
    {
        "source_sentence": "答言：「見罪。」",
        "translation": "He replied, I'll see the sin.",
        "source": "T23n1440_009:0564c07_12"
    },
    {
        "source_sentence": "「如法悔過莫復更起。」",
        "translation": "They repent of their faults according to the teaching and don't arise again.",
        "source": "T23n1440_009:0564c08_13"
    },
    {
        "source_sentence": "第二部眾亦如是說。",
        "translation": "The second group of people also explains it this way.",
        "source": "T23n1440_009:0564c08_14"
    },
    {
        "source_sentence": "是名如布草毘尼法。",
        "translation": "This is called the method of practicing according to the cloth and grass vinaya.",
        "source": "T23n1440_009:0564c09_15"
    },
    {
        "source_sentence": "一切鬪諍誹謗犯罪和合事，現前毘尼所攝。",
        "translation": "All the combined offenses of fighting, slander, and crimes are included in the present Vinaya.",
        "source": "T23n1440_009:0564c10_0"
    },
    {
        "source_sentence": "唯有下四事，用上七毘尼滅無餘也。",
        "translation": "There are only the following four things, which are extinguished by using the above-mentioned seven vinaya.",
        "source": "T23n1440_009:0564c11_0"
    },
    {
        "source_sentence": "一切善不善無記，及十四破僧、六諍本生，通名諍事(在人名諍、在僧名事)，用三毘尼滅(現前、多覓、布草)。",
        "translation": "All good, unskillful, and indeterminate, as well as the fourteen refutations of the saṃgha and the six crude original births, are generally called crude deeds (which are called crude deeds among humans and crude deeds among saṃgha names), and they are extinguished by using the three vinaya rules (which are present, abundant, numerous, and spreading grass",
        "source": "T23n1440_009:0564c12_0"
    },
    {
        "source_sentence": "從見聞疑根生，作不作俱言犯，通名出事(在人名出、在僧名事)，用四毘尼滅(現前、憶念、不癡、實覓)。",
        "translation": "When doubt arises from the faculty of seeing and hearing, it's called an offense that's committed or unconstructed, which is generally called a matter that comes forth (in person names come forth and in saṃgha names come forth), and it's extinguished by using four vinaya rules (which are present, recollection, non-delusion, and genuine search).",
        "source": "T23n1440_009:0564c13_1"
    },
    {
        "source_sentence": "從身作口作身心作口作生，通名犯事(方便名犯事、成名破、不悔名越)，用二毘尼滅(現前、自言)。",
        "translation": "They are produced from bodily actions, verbal actions, body actions, and bodily actions as well as verbal actions, which are generally called offenses (the method is called an offense, the formation is called a breach, and the absence of repentance is called a transgression), and they are extinguished by using two vinayas (which are present and self-expressed).",
        "source": "T23n1440_009:0564c15_2"
    },
    {
        "source_sentence": "從白白二白四布薩自恣差十四人，從僧至僧為事本，通名作事，用一毘尼(現前)。",
        "translation": "Fourteen people are self-imposed from the white and white, two white and four pusa, and fourteen people are appointed by themselves, with the business being the business from the saṃgha to the saṃgha, commonly known as doing business, using one vinaya (as shown here).",
        "source": "T23n1440_009:0564c16_3"
    },
    {
        "source_sentence": "薩婆多毘尼毘婆沙卷第九",
        "translation": "*Sarvâstivāda-vinaya-vibhāsā, vol. 9",
        "source": "T23n1440_009:0564c19_0"
    }
]