[
    {
        "source_sentence": "根本說一切有部毘奈耶卷第三",
        "translation": "Mūlasarvâstivāda-vinaya, vol. 3",
        "source": "T23n1442_033:0805b23_0"
    },
    {
        "source_sentence": "十三",
        "translation": "thirteen",
        "source": "T23n1442_033:0805b24_0"
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yogâcārabhūmi in Sanskrit",
        "source": "T23n1442_033:0805b26_0"
    },
    {
        "source_sentence": "與非親苾芻尼作衣學處第二十五",
        "translation": "Twenty-fifth place of training in making robes for nuns who aren't related to one another",
        "source": "T23n1442_033:0805b27_0"
    },
    {
        "source_sentence": "爾時薄伽梵在室羅伐城逝多林給孤獨園。",
        "translation": "At the time, the Bhagavān was staying at Anāthapiṇḍada Park in Jeta's Grove in Śrāvastī.",
        "source": "T23n1442_033:0805b28_0"
    },
    {
        "source_sentence": "時笈多苾芻尼五衣破壞，多有餘衣，便作是念：「誰當為我刺作大衣？」",
        "translation": "When the five robes of the Gupta bhikṣuṇī were damaged, and there were many other robes, she thought, Who will make a large robe for me to pierce?",
        "source": "T23n1442_033:0805b29_0"
    },
    {
        "source_sentence": "如是念時，有餘諸尼來至其所，告言：「笈多！",
        "translation": "When he had this thought, some other nuns came to him and told him, Gupta!",
        "source": "T23n1442_033:0805c01_1"
    },
    {
        "source_sentence": "何故似有憂色？」",
        "translation": "Why does it seem to have the form of grief?",
        "source": "T23n1442_033:0805c02_2"
    },
    {
        "source_sentence": "彼便報言：「姊妹！",
        "translation": "They then replied, Sister!",
        "source": "T23n1442_033:0805c02_3"
    },
    {
        "source_sentence": "我之五衣並多朽故，而僧伽胝極是破碎。",
        "translation": "My five garments are mostly rotten, but the saṃghâvaśeṣa is extremely broken.",
        "source": "T23n1442_033:0805c03_4"
    },
    {
        "source_sentence": "我今多有疊衣，不知欲遣誰作？」",
        "translation": "Now, there are so many pieces of cloth that I don't know who will make it.",
        "source": "T23n1442_033:0805c04_5"
    },
    {
        "source_sentence": "諸尼報曰：「汝豈持金鉢從他乞食耶？",
        "translation": "The nuns replied, Did you carry the golden bowl and beg for food from someone else?",
        "source": "T23n1442_033:0805c04_6"
    },
    {
        "source_sentence": "汝有聖者鄔陀夷眾所知識，寧容憂念無人刺衣？」",
        "translation": "Do you have the knowledge of the noble person Udayana, so why should you be sad and think that there's no one to steal your robe?",
        "source": "T23n1442_033:0805c05_7"
    },
    {
        "source_sentence": "報言：「彼是尊德，豈能為我？」",
        "translation": "He replied, That's a venerable virtue, so how could he do it for me?",
        "source": "T23n1442_033:0805c06_8"
    },
    {
        "source_sentence": "答言：「或容為汝。」",
        "translation": "He replied, Perhaps I can do it for you.",
        "source": "T23n1442_033:0805c07_9"
    },
    {
        "source_sentence": "報曰：「彼定不能。」",
        "translation": "He replied, They surely won't.",
        "source": "T23n1442_033:0805c07_10"
    },
    {
        "source_sentence": "答言：「豈有將涉渡人聞水流聲即脫靴履？",
        "translation": "He replied, Could it be that someone who's about to cross the river hears the sound of a stream of water and then takes off their shoes?",
        "source": "T23n1442_033:0805c08_11"
    },
    {
        "source_sentence": "可持疊去，或能為刺。」",
        "translation": "You can take the pile and leave it, or you can be a thorn.",
        "source": "T23n1442_033:0805c09_12"
    },
    {
        "source_sentence": "是時笈多即持白疊，往鄔陀夷所禮足而坐。",
        "translation": "Gupta then took the white cloth, went to Udayana's place, bowed his feet, and sat down.",
        "source": "T23n1442_033:0805c09_13"
    },
    {
        "source_sentence": "時鄔陀夷見其大疊報言：「笈多！",
        "translation": "Udayana then saw his great pile and reported, Gupta!",
        "source": "T23n1442_033:0805c10_14"
    },
    {
        "source_sentence": "若人得此新好白疊，刺作複僧伽胝衣隨時受用，修諸善品日有增益。」",
        "translation": "If someone obtains this new, nice white cotton cloth and pierces it to make a pair of saṃghâva robes that can be used at any time, cultivating good qualities will increase day by day.",
        "source": "T23n1442_033:0805c11_15"
    },
    {
        "source_sentence": "笈多曰：「大德若須，理合持奉。",
        "translation": "Gṛdhrakūṭa said, If the great virtuous man needed it, he would uphold it in accordance with principle.",
        "source": "T23n1442_033:0805c12_16"
    },
    {
        "source_sentence": "然我大衣極成破碎，今將此疊憑為作衣。」",
        "translation": "Still, my great robe is extremely broken; now I'll use this pile of cloth to make a robe.",
        "source": "T23n1442_033:0805c13_17"
    },
    {
        "source_sentence": "時鄔陀夷便作斯念：「我與刺者，十二眾尼若有刺衣皆來憑我，我復何容為他勞苦？",
        "translation": "Udayana then had this thought, I and the thief, and if the twelve nuns in the assembly had robes made of thorns, they would all come to rely on me, so how could I allow them to suffer for others?",
        "source": "T23n1442_033:0805c14_18"
    },
    {
        "source_sentence": "若不刺者笈多見恨，我今宜可作法刺之，令如木釜一煮便壞，不復更來令我縫刺。」",
        "translation": "If someone doesn't pierce it, then the Gupta sees what's hateful, and now I should make a ritual to pierce them, so that they'll be like a wooden cauldron that breaks apart once cooked, and they won't come back again to let me pierce it.",
        "source": "T23n1442_033:0805c16_19"
    },
    {
        "source_sentence": "報笈多曰：「可留疊去。」",
        "translation": "He replied to Gupta, You can leave it in a pile and go.",
        "source": "T23n1442_033:0805c18_20"
    },
    {
        "source_sentence": "時六眾苾芻來，見大疊問言：「大德！",
        "translation": "When the six monks came, they saw Mahāprajāpa and asked, Mañjuśrī!",
        "source": "T23n1442_033:0805c18_21"
    },
    {
        "source_sentence": "此是誰疊？」",
        "translation": "Who is this a pile?",
        "source": "T23n1442_033:0805c19_22"
    },
    {
        "source_sentence": "報言：「是所愛人物。」",
        "translation": "He replied, This is the person he loves.",
        "source": "T23n1442_033:0805c19_23"
    },
    {
        "source_sentence": "問言：「誰是所愛？」",
        "translation": "He asked, Who is loved?",
        "source": "T23n1442_033:0805c20_24"
    },
    {
        "source_sentence": "報：「是笈多。」",
        "translation": "He replied, Yes, Gupta.",
        "source": "T23n1442_033:0805c20_25"
    },
    {
        "source_sentence": "「若如是者，我等共為。」",
        "translation": "If it's like this, we'll work together.",
        "source": "T23n1442_033:0805c20_26"
    },
    {
        "source_sentence": "即截其疊尋便刺了。",
        "translation": "He cut off the pile of cloth and then pierced it.",
        "source": "T23n1442_033:0805c21_27"
    },
    {
        "source_sentence": "時鄔陀夷持此大衣詣經行處，以五色線刺作自身共笈多尼相抱之像，便持大衣置房中架上。",
        "translation": "Udayin then took this large robe and went to the place where he was walking, drew it with five-colored thread, made an image of himself embraced by the Gupta nuns, and placed the large robe on a shelve in his room.",
        "source": "T23n1442_033:0805c21_28"
    },
    {
        "source_sentence": "笈多既至，問：「衣成未？」",
        "translation": "When the Gupta arrived, he asked, Have you finished making your robes?",
        "source": "T23n1442_033:0805c23_29"
    },
    {
        "source_sentence": "報言：「衣始刺成，汝即來至。」",
        "translation": "He replied, When your robes are pierced, you'll come right here.",
        "source": "T23n1442_033:0805c24_30"
    },
    {
        "source_sentence": "遂便以衣置彼肩上，告曰：「乃至未染已來不得輒開，開便獲罪。」",
        "translation": "He then placed his robe over his shoulder and told him, Until it's not stained, you mustn't open it; if you open it, you'll be guilty.",
        "source": "T23n1442_033:0805c24_31"
    },
    {
        "source_sentence": "是時笈多持衣而去。",
        "translation": "Gupta then took his robe and departed.",
        "source": "T23n1442_033:0805c26_32"
    },
    {
        "source_sentence": "彼同伴尼告言：「笈多可將衣來，我試為觀，不知尊者如何刺作？」",
        "translation": "The companions and nuns told him, Gupta, Come with your robes, and I'll try to see for you, but I don't know how the venerable could stab it.",
        "source": "T23n1442_033:0805c26_33"
    },
    {
        "source_sentence": "笈多報曰：「汝可不聞聖者鄔陀夷作如是語：『乃至未染已來勿輒開衣，若開得罪。』」",
        "translation": "Gṛdhrakūṭa replied, You mustn't hear the noble person Udayana say this, 'Don't open your robes so easily until they haven't stained; if you open them, you'll be guilty.'",
        "source": "T23n1442_033:0805c28_34"
    },
    {
        "source_sentence": "既至寺內諸尼報曰：「我試看衣，刺作何似？」",
        "translation": "When they arrived inside the monastery, the nuns reported, I'll examine my robe and see what it looks like with a knife.",
        "source": "T23n1442_033:0805c29_35"
    },
    {
        "source_sentence": "報言：「聖者鄔陀夷作如是語：『乃至未染已來，不應輒開，若開得罪。』」",
        "translation": "He replied, The noble person Udayin said this, 'Up to the point where it's not stained, you shouldn't open it so easily; if you open it, you'll be guilty.'",
        "source": "T23n1442_033:0806a01_36"
    },
    {
        "source_sentence": "時有得意苾芻尼強就肩上抽取大衣遂便開張。",
        "translation": "At the time, there was a certain monk or nun who had an intention to forcibly pull his or her large robe over their shoulders and then opened it.",
        "source": "T23n1442_033:0806a03_37"
    },
    {
        "source_sentence": "諸尼見已皆大譏笑作如是語：「聖者鄔陀夷久與笈多不能相見，今日始得交頸同居。」",
        "translation": "Seeing them, the nuns all laughed and said, The noble Udayana and Gupta haven't seen each other for a long time, but today they've just been able to live together by joining their necks.",
        "source": "T23n1442_033:0806a04_38"
    },
    {
        "source_sentence": "時喬答彌大世主報諸尼曰：「汝等頭上無髮腋下毛長，有何歡情而更誼笑？」",
        "translation": "The great lord of the world then replied to the nuns, You don't have hair growing under your armpits on your heads, so why are you laughing and smiling?",
        "source": "T23n1442_033:0806a06_39"
    },
    {
        "source_sentence": "諸尼白言：「聖者！",
        "translation": "The nuns said, Sage!",
        "source": "T23n1442_033:0806a08_40"
    },
    {
        "source_sentence": "鄔陀夷作非法事，由斯見笑。」",
        "translation": "Udayana did an unlawful thing, so he smiled when he saw it.",
        "source": "T23n1442_033:0806a08_41"
    },
    {
        "source_sentence": "遂問其故，尼以事白。",
        "translation": "He then asked the reason for this, and the nun told him about it.",
        "source": "T23n1442_033:0806a09_42"
    },
    {
        "source_sentence": "時大世主告諸尼曰：「彼常惡行虧損聖教，令法河岸日見崩隤。」",
        "translation": "The great lord of the world then told the nuns, That constant bad behavior undermines the noble teaching and causes the Dharma River's bank to crumble day by day.",
        "source": "T23n1442_033:0806a09_43"
    },
    {
        "source_sentence": "諸苾芻尼以此因緣白諸苾芻，諸苾芻眾聞生嫌恥，具以白佛。",
        "translation": "The monks and nuns told the monks about this cause and condition, and the monks and nuns who heard it became embarrassed and reported it to the Buddha.",
        "source": "T23n1442_033:0806a11_0"
    },
    {
        "source_sentence": "佛告鄔陀夷：「汝實與非親尼作衣耶？」",
        "translation": "The Buddha told Udayana, Do you really make robes for a nun who isn't your relative?",
        "source": "T23n1442_033:0806a12_1"
    },
    {
        "source_sentence": "白言：「實爾。",
        "translation": "They said, It's true.",
        "source": "T23n1442_033:0806a13_2"
    },
    {
        "source_sentence": "大德！」",
        "translation": "Great virtuous one!",
        "source": "T23n1442_033:0806a13_3"
    },
    {
        "source_sentence": "世尊集諸苾芻，種種呵責鄔陀夷已，乃至「制其學處，應如是說：「若復苾芻與非親苾芻尼作衣者，波逸底迦。」",
        "translation": "After the Bhagavān gathered the monks and variously rebuked Udayana, he said, If another monk makes robes for a nun who's not a relative of the monk or nun, pratyekabuddha.",
        "source": "T23n1442_033:0806a13_4"
    },
    {
        "source_sentence": "若復苾芻者，謂鄔陀夷，餘義如上。",
        "translation": "If another monk is a Udayana, the rest are as above.",
        "source": "T23n1442_033:0806a16_0"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1442_033:0806a16_1"
    },
    {
        "source_sentence": "得罪輕重六句同前，無犯如上。",
        "translation": "The six sentences that describe the seriousness of the offense are the same as the previous one, but there's no offense like the above.",
        "source": "T23n1442_033:0806a17_2"
    },
    {
        "source_sentence": "與苾芻尼同道行學處第二十六",
        "translation": "Twenty-sixth Place of Studying with a Bhikṣuṇī who Follows the Way",
        "source": "T23n1442_033:0806a18_0"
    },
    {
        "source_sentence": "佛在室羅伐城逝多林給孤獨園。",
        "translation": "The Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T23n1442_033:0806a19_0"
    },
    {
        "source_sentence": "時六眾苾芻難陀、鄔波難陀，作如是念共相告曰：「此諸黑鉢用獼猴脂以塗其足，常遊四方，將欲行時受他利養，行還之日復受供給，多人愛敬。",
        "translation": "The six monks Nanda and Upananda then had this thought in common with each other, saying, These black bowls are coated with the hair of a rhesus monkey to rub their feet, always traveling in four directions, receiving benefits from others when they want to go, and being offered again on the day they return home, which many people love and respect.",
        "source": "T23n1442_033:0806a19_1"
    },
    {
        "source_sentence": "我等猶若井蛙未曾遊歷，是故無緣得他利養。",
        "translation": "We're like frogs in a well who haven't traveled, so there's no reason for us to attain the benefit of others.",
        "source": "T23n1442_033:0806a23_0"
    },
    {
        "source_sentence": "我今宜可告姊妹知。」",
        "translation": "Now, it's appropriate for me to tell my sister.",
        "source": "T23n1442_033:0806a24_1"
    },
    {
        "source_sentence": "於日初分著衣持鉢，往十二眾苾芻尼處告言：「姊妹！",
        "translation": "On the first part of the day, he put on his robe and took his bowl and went to the place where the twelve monks and nuns were staying, telling them, Sister!",
        "source": "T23n1442_033:0806a24_2"
    },
    {
        "source_sentence": "汝等善住，我欲遊方隨處教化。」",
        "translation": "You are well-abiding; I want to travel and teach wherever I can.",
        "source": "T23n1442_033:0806a25_3"
    },
    {
        "source_sentence": "時彼諸尼聞皆啼泣。",
        "translation": "When those nuns heard this, they all cried out in tears.",
        "source": "T23n1442_033:0806a26_4"
    },
    {
        "source_sentence": "鄔陀夷問言：「姊妹！",
        "translation": "Udayana asked, Sister!",
        "source": "T23n1442_033:0806a26_5"
    },
    {
        "source_sentence": "何故啼泣？」",
        "translation": "Why are you weeping?",
        "source": "T23n1442_033:0806a27_6"
    },
    {
        "source_sentence": "答曰：「大德行矣！",
        "translation": "He replied, Great virtuous practitioner!",
        "source": "T23n1442_033:0806a27_7"
    },
    {
        "source_sentence": "給苑空虛。」",
        "translation": "Giving to the garden is empty and vacant.",
        "source": "T23n1442_033:0806a27_8"
    },
    {
        "source_sentence": "報言：「姊妹！",
        "translation": "He replied, Sister!",
        "source": "T23n1442_033:0806a28_9"
    },
    {
        "source_sentence": "大師處世百千聖眾，汝等何故輒謂空虛？」",
        "translation": "When the great teacher was in the world with a hundred thousand sages, why did you so easily call it emptiness and space?",
        "source": "T23n1442_033:0806a28_10"
    },
    {
        "source_sentence": "答曰：「諸黑鉢者聞我名時尚不歡喜，豈容至彼許我安坐，賜以言談為宣妙法？」",
        "translation": "He answered, The black bowlers who heard my name and didn't rejoice when they heard it, so how could they go there and allow me to sit quietly and give me words to proclaim the wonderful teaching?",
        "source": "T23n1442_033:0806a29_11"
    },
    {
        "source_sentence": "鄔波難陀曰：「若如是者可相隨去。」",
        "translation": "Upananda said, If that's the case, you can follow each other.",
        "source": "T23n1442_033:0806b02_12"
    },
    {
        "source_sentence": "吐羅難陀尼曰：「苾芻與尼同一道行，是事合不？」",
        "translation": "Tūranandaṇḍanī said, Does it fit that monks and nuns practice the same path together?",
        "source": "T23n1442_033:0806b02_13"
    },
    {
        "source_sentence": "鄔波難陀曰：「道理合去，誰復相遮？",
        "translation": "Upananda said, It's reasonable to go away, but who else would be able to obscure it?",
        "source": "T23n1442_033:0806b03_14"
    },
    {
        "source_sentence": "多辦路糧可相隨去。」",
        "translation": "They'll prepare a large amount of provisions for the road and be able to follow each other.",
        "source": "T23n1442_033:0806b04_15"
    },
    {
        "source_sentence": "時苾芻尼隨言辦訖，六眾苾芻著衣持鉢入城乞食，既得食已往尼寺中。",
        "translation": "When the monks and nuns finished following their instructions, the six monks in robes and bowls entered the city to solicit alms, and after they had obtained food, they went to the nun's monastery.",
        "source": "T23n1442_033:0806b05_16"
    },
    {
        "source_sentence": "十二眾見白言：「聖者！",
        "translation": "The twelve members of the assembly saw him and said, Sage!",
        "source": "T23n1442_033:0806b06_17"
    },
    {
        "source_sentence": "可食小食。」",
        "translation": "You can eat small food.",
        "source": "T23n1442_033:0806b07_18"
    },
    {
        "source_sentence": "六眾為受，所有路糧悉皆食盡，告諸尼曰：「姊妹！",
        "translation": "The six members of the assembly accepted it, and all the provisions for the journey were eaten up. They told the nuns, Sister!",
        "source": "T23n1442_033:0806b07_19"
    },
    {
        "source_sentence": "汝等造得路糧，應可將來觀其好不？」",
        "translation": "Do you build provisions for the road, and will you see what's good in the future?",
        "source": "T23n1442_033:0806b08_20"
    },
    {
        "source_sentence": "尼便報曰：「向者小食並是路糧，今已食盡。」",
        "translation": "The nuns then reported, That little food was all the provisions for the journey, and now that they've eaten it up, he said.",
        "source": "T23n1442_033:0806b09_21"
    },
    {
        "source_sentence": "六眾曰：「若如是者何得長途共相支濟？",
        "translation": "The six members of the assembly said, If that's the case, how will they be able to share their common characteristics and help each other for a long time?",
        "source": "T23n1442_033:0806b10_22"
    },
    {
        "source_sentence": "更可多作，若少乏者當受飢苦。」",
        "translation": "You can do more, and if you're poor, you'll experience hunger and suffering.",
        "source": "T23n1442_033:0806b11_23"
    },
    {
        "source_sentence": "彼更營辦俱投商旅。",
        "translation": "They all went on a business trip to prepare for it.",
        "source": "T23n1442_033:0806b11_24"
    },
    {
        "source_sentence": "時有乞食苾芻亦欲隨去，諸人報曰：「斯等六人並皆惡行，若同去者被惱不疑。」",
        "translation": "A begging monk then wanted to go along with them, and the people replied, These six people are all engaged in bad behavior; if they go together, they'll be disturbed and won't doubt it.",
        "source": "T23n1442_033:0806b12_25"
    },
    {
        "source_sentence": "乞食者曰：「我不從彼受業，亦不依止為師，彼以何緣而相惱亂？」",
        "translation": "The beggar said, I won't receive my training from them, and I won't rely on them as teachers; for what reason will they disturb each other?",
        "source": "T23n1442_033:0806b14_26"
    },
    {
        "source_sentence": "不受勸言遂即同去。",
        "translation": "They didn't accept the words of encouragement and then departed together.",
        "source": "T23n1442_033:0806b15_27"
    },
    {
        "source_sentence": "是時六眾既至界外，自相謂曰：「我等何能久事容範？",
        "translation": "When the sixfold assembly arrived outside the boundary, they said to each other, How can we serve you for a long time?",
        "source": "T23n1442_033:0806b16_0"
    },
    {
        "source_sentence": "宜各隨意作自威儀。」",
        "translation": "It's appropriate for each to make their own manner as they wish.",
        "source": "T23n1442_033:0806b17_1"
    },
    {
        "source_sentence": "是時難陀與難陀苾芻尼、難陀弟子及尼弟子，乃至求寂及求寂女，同在一處隨路而行，其鄔波難陀等亦復如是。",
        "translation": "It was then that Nanda and the nuns of Nanda, the disciples of Nanda and the disciples of the nuns, up to the nuns who sought extinction and the women who sought extinction were all traveling together in one place along the path, and so did Upananda and others likewise.",
        "source": "T23n1442_033:0806b17_2"
    },
    {
        "source_sentence": "時有婆羅門居士等，見其合雜作如是語：「此是沙門婦、此是男、此是女、此是兒婦、此是孫子，與俗不殊，何有正法？」",
        "translation": "When some Brāhmaṇa householders and others saw this combination, they said, This is an ascetic woman, this is a man, this is a woman, this is a child, this is a wife, and this is a grandson, not different from the laity, so what's right teaching?",
        "source": "T23n1442_033:0806b20_3"
    },
    {
        "source_sentence": "鄔波難陀聞而告曰：「儜惡婆羅門！",
        "translation": "Upon hearing this, Upananda told him, That's a bad Brāhmaṇa!",
        "source": "T23n1442_033:0806b22_4"
    },
    {
        "source_sentence": "假令我今脚蹋汝咽，多畜妻子，法與非法何干汝事？」",
        "translation": "Suppose I now stepped on your throat with my feet and gave you many wives, then what's the matter with you if it's lawful or unlawful?",
        "source": "T23n1442_033:0806b23_5"
    },
    {
        "source_sentence": "時彼乞食苾芻聞已生念：「我寧身死，誰能共此惡行之人共為遊歷？」",
        "translation": "When that begging monk heard this, he thought, How could I die if I were to die in peace, and who would travel with this bad person?",
        "source": "T23n1442_033:0806b24_6"
    },
    {
        "source_sentence": "遂即旋返至逝多林。",
        "translation": "He then returned to Jeta's Grove.",
        "source": "T23n1442_033:0806b26_7"
    },
    {
        "source_sentence": "時諸苾芻見而問曰：「善來！",
        "translation": "When the monks saw him, they asked, Good man!",
        "source": "T23n1442_033:0806b26_8"
    },
    {
        "source_sentence": "行李安樂不？」",
        "translation": "Is the bag comfortable?",
        "source": "T23n1442_033:0806b27_9"
    },
    {
        "source_sentence": "答言：「具壽！",
        "translation": "He replied, Kauṣṭhila!",
        "source": "T23n1442_033:0806b27_10"
    },
    {
        "source_sentence": "寧有安樂？",
        "translation": "How could there be peace and comfort?",
        "source": "T23n1442_033:0806b27_11"
    },
    {
        "source_sentence": "我共六眾同道而行，彼行惡事虧損佛法。」",
        "translation": "Together with the six groups of people, we'll practice the same path, and they'll do bad things that will harm the Buddha's teaching.",
        "source": "T23n1442_033:0806b28_12"
    },
    {
        "source_sentence": "問曰：「彼作何事？」",
        "translation": "He asked, What did they do?",
        "source": "T23n1442_033:0806b29_0"
    },
    {
        "source_sentence": "即便具答。",
        "translation": "He then answered in full.",
        "source": "T23n1442_033:0806b29_1"
    },
    {
        "source_sentence": "少欲苾芻聞生嫌賤：「云何苾芻與尼同路人間遊行？」",
        "translation": "When a monk with few desires heard this, he became disgusted and said, How do monks and nuns travel among the people of the road?",
        "source": "T23n1442_033:0806b29_2"
    },
    {
        "source_sentence": "以此因緣具白世尊。",
        "translation": "Because of these causes and conditions, he told the Bhagavān.",
        "source": "T23n1442_033:0806c01_3"
    },
    {
        "source_sentence": "世尊知已待六眾至，集眾問曰：「汝等六人實作如是不端嚴事耶？」",
        "translation": "Knowing that he had waited until the six groups of people arrived, the Bhagavān gathered them together and asked, Have you six people really done such unscrupulous things?",
        "source": "T23n1442_033:0806c02_4"
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, Indeed.",
        "source": "T23n1442_033:0806c03_5"
    },
    {
        "source_sentence": "世尊種種呵責，乃至「制其學處，應如是說：若復苾芻與苾芻尼同一道行者，波逸底迦。」",
        "translation": "The Bhagavān was variously rebuked by the Bhagavān, even to the point where he instructed them to regulate their places of training, and they should say, 'Suppose another monk or nun who practices the same path as a monk or nun, pratyekabuddha.'",
        "source": "T23n1442_033:0806c03_6"
    },
    {
        "source_sentence": "如是世尊為諸苾芻制學處已。",
        "translation": "Thus, the Bhagavān has established a place of training for the monks.",
        "source": "T23n1442_033:0806c05_7"
    },
    {
        "source_sentence": "佛在給孤獨園。",
        "translation": "The Buddha was staying at Anāthapiṇḍada Park.",
        "source": "T23n1442_033:0806c06_8"
    },
    {
        "source_sentence": "有眾多苾芻尼在王舍城，於王園寺三月安居。",
        "translation": "There were many bhikṣuṇīs in Rājagṛha who stayed at the royal park and temple for three months.",
        "source": "T23n1442_033:0806c06_9"
    },
    {
        "source_sentence": "夏既終已，欲詣給園禮世尊足，出求商旅。",
        "translation": "At the end of the summer he wished to go to the monastery to pay his respects at the feet of the World-honored One and went out on a business trip.",
        "source": "T23n1442_033:0806c08_0"
    },
    {
        "source_sentence": "於商人中見有苾芻，遂相謂曰：「姊妹！",
        "translation": "Seeing a monk among the merchants, they said to each other, Sister!",
        "source": "T23n1442_033:0806c08_1"
    },
    {
        "source_sentence": "此有苾芻，不合同去，當更別求。」",
        "translation": "There's a monk here who won't contract to go, so he'll ask for it separately.",
        "source": "T23n1442_033:0806c09_2"
    },
    {
        "source_sentence": "諸商旅中皆有苾芻，復相告曰：「我雖久覓皆有苾芻，不可同行。」",
        "translation": "All the merchants and travelers had monks in them, and they again told each other, Even though I've been searching for monks for a long time, I can't go along with them.",
        "source": "T23n1442_033:0806c10_3"
    },
    {
        "source_sentence": "但遙望商旅隨後而去。",
        "translation": "They simply looked from a distance for the merchants and traveled on their way.",
        "source": "T23n1442_033:0806c11_4"
    },
    {
        "source_sentence": "時苾芻尼在後行時趁伴不及，便被盜賊劫奪衣資，漸漸遊行至室羅伐，詣苾芻尼寺。",
        "translation": "When the bhikṣuṇīs were walking behind them, they didn't have time to catch up with their companions, so they were robbed by thieves and robbed of their clothing and traveled gradually until they reached Śrāvastī and went to the bhikṣuṇī temple.",
        "source": "T23n1442_033:0806c12_5"
    },
    {
        "source_sentence": "尼既見已告言：「姊妹！",
        "translation": "When the nun saw him, she told him, Sister!",
        "source": "T23n1442_033:0806c14_6"
    },
    {
        "source_sentence": "行李安樂不？」",
        "translation": "Is the bag comfortable?",
        "source": "T23n1442_033:0806c14_7"
    },
    {
        "source_sentence": "答曰：「寧有安樂？",
        "translation": "He replied, How could there be peace and happiness?",
        "source": "T23n1442_033:0806c15_8"
    },
    {
        "source_sentence": "在路遭賊劫我衣物。」",
        "translation": "On the road, I'll be attacked by thieves who plunder my clothing and possessions.",
        "source": "T23n1442_033:0806c15_9"
    },
    {
        "source_sentence": "諸尼報曰：「豈無商旅與同行耶？」",
        "translation": "The nuns replied, Isn't there a merchant traveling with his companions?",
        "source": "T23n1442_033:0806c15_10"
    },
    {
        "source_sentence": "答言：「有。」",
        "translation": "He replied, Yes.",
        "source": "T23n1442_033:0806c16_11"
    },
    {
        "source_sentence": "「若爾，何因遭賊？」",
        "translation": "If that's the case, what is the reason for being attacked by thieves?",
        "source": "T23n1442_033:0806c16_12"
    },
    {
        "source_sentence": "答：「有苾芻不合同去，緣斯在後，遂遭賊劫。」",
        "translation": "A: There's a monk who doesn't leave the contract, and because he's behind it, he'll be robbed by thieves.",
        "source": "T23n1442_033:0806c17_13"
    },
    {
        "source_sentence": "諸尼曰：「九十六種諸外道類，皆悉慈愍不棄女人，唯佛世尊獨棄我等，令無依怙，被賊劫奪。」",
        "translation": "The nuns said, Ninety-six kinds of non-Buddhist types are all compassionate and don't abandon women; only the Bhagavān abandoned us alone so that we had no support and were robbed by thieves.",
        "source": "T23n1442_033:0806c18_14"
    },
    {
        "source_sentence": "諸苾芻尼聞已諸白苾芻，諸苾芻白佛。",
        "translation": "After the monks and nuns heard it, they said to the monks, and the monks said to the Buddha.",
        "source": "T23n1442_033:0806c20_15"
    },
    {
        "source_sentence": "佛言：「除時因緣。」",
        "translation": "The Buddha said, Except for the timely causes and conditions.",
        "source": "T23n1442_033:0806c21_16"
    },
    {
        "source_sentence": "復於異時有眾多苾芻，隨逐商旅人間遊行，飲食有闕，佛言：「應持路糧。」",
        "translation": "Again, at another time, there were many monks traveling among the merchants and people who lacked food and drink, and the Buddha said, You should carry provisions for the journey.",
        "source": "T23n1442_033:0806c21_17"
    },
    {
        "source_sentence": "如佛所教持路糧者，諸苾芻不知遣誰持去？",
        "translation": "As the Buddha taught, whoever maintains the provisions for the path doesn't know which of the monks will send them away?",
        "source": "T23n1442_033:0806c23_0"
    },
    {
        "source_sentence": "佛言：「應令男淨人或女淨人；",
        "translation": "The Buddha said, You should cause men to be pure and women to be pure.",
        "source": "T23n1442_033:0806c24_0"
    },
    {
        "source_sentence": "此若無者，令求寂男求寂女；",
        "translation": "If this were non-existent, it would cause men who seek peace and women who seek peace.",
        "source": "T23n1442_033:0806c24_1"
    },
    {
        "source_sentence": "此若無者，苾芻苾芻尼應更互持去更互授食。」",
        "translation": "If this doesn't, the monks and nuns should again carry each other away and give each other food.",
        "source": "T23n1442_033:0806c25_2"
    },
    {
        "source_sentence": "又有眾多苾芻人間遊行，有染患者，諸苾芻棄之而去，佛言：「不應棄去，應可輿行。」",
        "translation": "Again, there were many monks who were traveling among the people with defiled illnesses, and the monks abandoned them and departed. The Buddha said, You shouldn't abandon them; you should carry them on your carriage.",
        "source": "T23n1442_033:0806c26_3"
    },
    {
        "source_sentence": "苾芻力少不能持去，佛言：「若有苾芻尼應共輿去。」",
        "translation": "When the monks had little strength and couldn't carry it away, the Buddha said, If there are monks and nuns, they should go on a carriage together.",
        "source": "T23n1442_033:0806c28_4"
    },
    {
        "source_sentence": "苾芻近頭、尼在足處，便生染心，佛言：「苾芻近足、尼在頭邊。」",
        "translation": "When a monk approaches his head or nun's feet and becomes defiled, the Buddha says, A monk approaches his head or nun's feet.",
        "source": "T23n1442_033:0806c29_5"
    },
    {
        "source_sentence": "行至村坊俱看病人，不行乞食遂闕飲食，佛言：「應留一人看守病者，餘皆乞食。",
        "translation": "When he went to the village, they all looked after the sick and didn't beg for food or drink, so the Buddha said, You should leave one person to look after the sick; the others will all beg for food.",
        "source": "T23n1442_033:0807a01_6"
    },
    {
        "source_sentence": "若苾芻尼病，亦應准此將去。」",
        "translation": "If a monk or nun is ill, he or she should also follow this and leave.",
        "source": "T23n1442_033:0807a03_7"
    },
    {
        "source_sentence": "爾時世尊告諸苾芻曰：「前是創制、此是隨開。」",
        "translation": "It was then that the Bhagavān addressed the monks, Formerly, this was a creation and this is a follow-on.",
        "source": "T23n1442_033:0807a04_0"
    },
    {
        "source_sentence": "乃至「應如是說：「若復苾芻與苾芻尼共商旅期行者，除餘時，波逸底迦。",
        "translation": "It should be explained in this way: Again, if a monk or nun travels with a monk or nun on a business trip together, except at other times, it's pratyekabuddha.",
        "source": "T23n1442_033:0807a05_0"
    },
    {
        "source_sentence": "餘時者，謂有恐怖、畏難處，此是時。」",
        "translation": "The other time refers to the time when there's a place of fear and difficulty, which is this time.",
        "source": "T23n1442_033:0807a07_1"
    },
    {
        "source_sentence": "若復苾芻者，謂是六眾苾芻。",
        "translation": "If another monk is a monk, that's the six groups of monks.",
        "source": "T23n1442_033:0807a08_0"
    },
    {
        "source_sentence": "尼者，謂十二眾。",
        "translation": "A nun refers to twelve congregations.",
        "source": "T23n1442_033:0807a08_1"
    },
    {
        "source_sentence": "期者，謂同結伴。",
        "translation": "The fixed date means the same as the companion.",
        "source": "T23n1442_033:0807a09_0"
    },
    {
        "source_sentence": "行者，謂涉路而去。",
        "translation": "A practitioner means to wade off on a path.",
        "source": "T23n1442_033:0807a09_1"
    },
    {
        "source_sentence": "除時因緣者，謂有難緣得同商旅，若無商旅不能得去。",
        "translation": "“Exception made for the occasional cause and condition”: When there is a difficult condition, it is acquisition of the same caravan by means of another one; when no caravan is present, it cannot go.",
        "source": "T23n1442_033:0807a09_2"
    },
    {
        "source_sentence": "恐怖畏難乃至結罪，並如上說。",
        "translation": "The fear of fear and difficulty up to the formation of sins are as explained above.",
        "source": "T23n1442_033:0807a11_0"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1442_033:0807a11_1"
    },
    {
        "source_sentence": "若苾芻共苾芻尼商旅同路行時，若越半半拘盧舍，皆得惡作；",
        "translation": "If a bhikṣu travels on the same road with a bhikṣuṇī, or if he exceeds one-half a krośa they will all be guilty of misdeeds.",
        "source": "T23n1442_033:0807a12_2"
    },
    {
        "source_sentence": "滿滿拘盧舍，皆得墮罪。",
        "translation": "They'll all fall into sin if they fill the whole of Kukkuṭāsa.",
        "source": "T23n1442_033:0807a13_3"
    },
    {
        "source_sentence": "或從村詣野、或從野詣村，里數結罪，咸皆准此。",
        "translation": "Whether it's from a village to a wilderness or from a wilderness to a village, the number of crimes committed in each village will all follow this.",
        "source": "T23n1442_033:0807a14_4"
    },
    {
        "source_sentence": "又無犯者，謂最初犯人，或癡狂、心亂、痛惱所纏。",
        "translation": "Also, there's no offense because the first offender is sometimes tethered by delusion, mental disturbance, or pain.",
        "source": "T23n1442_033:0807a15_5"
    },
    {
        "source_sentence": "與苾芻尼同乘一船學處第二十七",
        "translation": "Twenty-seventh place of training with the bhikṣuṇīs in a single boat",
        "source": "T23n1442_033:0807a17_0"
    },
    {
        "source_sentence": "佛在室羅伐城逝多林給孤獨園。",
        "translation": "The Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T23n1442_033:0807a18_0"
    },
    {
        "source_sentence": "時六眾苾芻難陀、鄔波難陀共相謂曰：「此諸黑鉢用獼猴脂以塗其足。」",
        "translation": "The six monks Nanda and Upananda of the assembly then said to each other, These black bowls are coated with rhesus monkey fat to rub their feet.",
        "source": "T23n1442_033:0807a18_1"
    },
    {
        "source_sentence": "如是等廣說如前。",
        "translation": "Such and so forth are explained in detail as before.",
        "source": "T23n1442_033:0807a20_2"
    },
    {
        "source_sentence": "乃至告十二眾知，彼便啼泣，令辦路糧遂共同船男女交雜，諸人譏笑。",
        "translation": "Knowing this, the twelve members of the assembly cried out in tears and ordered their provisions to prepare the journey. The men and women on board the boat were mixed together and everyone laughed with derision.",
        "source": "T23n1442_033:0807a20_3"
    },
    {
        "source_sentence": "諸苾芻聞以緣白佛，佛便呵責，乃至「制其學處，應如是說：「若復苾芻與苾芻尼同乘一船者，波逸底迦。」",
        "translation": "When the monks heard this, they reported it to the Buddha for his sake, and he reprimanded them, saying, Suppose another monk and nun ride together in a boat, pratyekabuddha.",
        "source": "T23n1442_033:0807a22_4"
    },
    {
        "source_sentence": "如是世尊為諸苾芻制學處已。",
        "translation": "Thus, the Bhagavān has established a place of training for the monks.",
        "source": "T23n1442_033:0807a25_0"
    },
    {
        "source_sentence": "在給園中去斯不遠有河，名曰難渡。",
        "translation": "Not far from here in Jeta’s Grove there is a river called Nandanavana (“ Difficult to cross”).",
        "source": "T23n1442_033:0807a25_1"
    },
    {
        "source_sentence": "於此河外有村，名曰白鴿。",
        "translation": "Beyond this river is a village called White dove.",
        "source": "T23n1442_033:0807a26_2"
    },
    {
        "source_sentence": "村有長者，造立大寺修營既畢，欲施與僧，便請二部僧尼就彼設供。",
        "translation": "An elderly man in the village had built a large temple and completed the construction, so he wanted to give it to the saṃgha, so he invited the two groups of monks and nuns to set up an offering there.",
        "source": "T23n1442_033:0807a27_3"
    },
    {
        "source_sentence": "時有一尼勤修善品，作如是念：「我於今日不行乞食，且當作業，待至臨中我當赴供。」",
        "translation": "Then, there was a nun who diligently cultivated good qualities and thought, Today, I won't go begging for food; I will do my work until I come to make an offering.",
        "source": "T23n1442_033:0807a28_4"
    },
    {
        "source_sentence": "既修禪誦見日欲中遂到河岸，見諸苾芻先在船上，是時船主報言：「聖者！",
        "translation": "When he had cultivated meditation and recitation, he saw that the sun was in midst of desire and went to the river's shore when he saw the monks on board the boat before him, and the captain of the boat reported, Sage!",
        "source": "T23n1442_033:0807b01_5"
    },
    {
        "source_sentence": "宜可上船。」",
        "translation": "It's advisable to board the boat.",
        "source": "T23n1442_033:0807b03_6"
    },
    {
        "source_sentence": "尼言：「賢首！",
        "translation": "The nun said, Good man!",
        "source": "T23n1442_033:0807b03_7"
    },
    {
        "source_sentence": "我不合去，宜待後船。」",
        "translation": "I won't go together; it's better to wait for the latter boat.",
        "source": "T23n1442_033:0807b03_8"
    },
    {
        "source_sentence": "船更迴來，取人將去，復喚尼上。",
        "translation": "The boat returns again, takes the man who is about to leave and calls up the nun.",
        "source": "T23n1442_033:0807b04_9"
    },
    {
        "source_sentence": "尼見苾芻，復云：「在後。」",
        "translation": "Seeing the monk, the nuns again said, Behind him.",
        "source": "T23n1442_033:0807b04_10"
    },
    {
        "source_sentence": "船到彼岸繫纜而去。",
        "translation": "The boat reached the other shore, tied its ropes, and departed.",
        "source": "T23n1442_033:0807b05_11"
    },
    {
        "source_sentence": "時苾芻尼遂便叫喚船人：「船人！",
        "translation": "The monks and nuns then called out to the boatmen, Boatmen!",
        "source": "T23n1442_033:0807b05_12"
    },
    {
        "source_sentence": "可來取我。」",
        "translation": "Come and get me.",
        "source": "T23n1442_033:0807b06_13"
    },
    {
        "source_sentence": "船人不肯，尼乃佇立河邊，見日過午即便歸寺，乃至食勢尚存能為習誦，飢虛既逼倚臥一邊。",
        "translation": "The boatmen refused, and the nuns stood at the riverside. Seeing that the sun was past noon, they went back to the monastery; but their power of eating remained so strong that they could practice chanting it for themselves.",
        "source": "T23n1442_033:0807b06_14"
    },
    {
        "source_sentence": "是時諸尼赴供迴已，問此尼曰：「聖者！",
        "translation": "After the nuns went back to make offerings, they asked this nun, Sage!",
        "source": "T23n1442_033:0807b08_15"
    },
    {
        "source_sentence": "食是他物，腹豈他耶？",
        "translation": "What's food is another thing, but isn't the belly?",
        "source": "T23n1442_033:0807b09_16"
    },
    {
        "source_sentence": "多食貪餮飽悶而臥。」",
        "translation": "He often eats and craves food, sleeps with hunger and torpor, and lies down.",
        "source": "T23n1442_033:0807b10_17"
    },
    {
        "source_sentence": "報曰：「我不去食，何悶之有？」",
        "translation": "He replied, If I don't go to eat, why would there be torpor?",
        "source": "T23n1442_033:0807b10_18"
    },
    {
        "source_sentence": "問曰：「何因不食？」",
        "translation": "He asked, Why won't you eat?",
        "source": "T23n1442_033:0807b11_19"
    },
    {
        "source_sentence": "具以其事告語諸尼。",
        "translation": "He told the nuns about this matter.",
        "source": "T23n1442_033:0807b11_20"
    },
    {
        "source_sentence": "尼白苾芻，苾芻白佛。",
        "translation": "The nun said to the monk, and the monk said to the Buddha.",
        "source": "T23n1442_033:0807b12_0"
    },
    {
        "source_sentence": "佛言：「除直渡。」",
        "translation": "The Buddha said, Except for the straight crossing.",
        "source": "T23n1442_033:0807b12_1"
    },
    {
        "source_sentence": "世尊以此因緣告諸苾芻曰：「前是創制，此是隨開。",
        "translation": "Because of these causes and conditions, the Bhagavān addressed the monks, saying, Formerly, it was to create a rule, but this is to follow it.",
        "source": "T23n1442_033:0807b12_2"
    },
    {
        "source_sentence": "為制學處應，如是說：「若復苾芻與苾芻尼期乘一船，若沿波若泝流，除直渡，波逸底迦。」",
        "translation": "In order to regulate the place of training, it's thus explained, Suppose another monk and a nun ride on a boat for a certain period of time with a monk or nun, or if they go along the pāñcika-paripṛcchā, except for a straight crossing, pratyekabuddha.",
        "source": "T23n1442_033:0807b13_3"
    },
    {
        "source_sentence": "若復苾芻者，謂是六眾，餘義如上。",
        "translation": "If another monk refers to the six congregations, the rest are as above.",
        "source": "T23n1442_033:0807b17_0"
    },
    {
        "source_sentence": "期乘一船者，謂共乘船過津濟處。",
        "translation": "Someone who intends to board a single boat means to share the same boat and go beyond the place where the bridge is crossed.",
        "source": "T23n1442_033:0807b17_1"
    },
    {
        "source_sentence": "沿波者，謂下水。",
        "translation": "Along the waves means to go down into the water.",
        "source": "T23n1442_033:0807b18_2"
    },
    {
        "source_sentence": "泝流者，謂上水。",
        "translation": "A flowing stream refers to the higher water.",
        "source": "T23n1442_033:0807b18_3"
    },
    {
        "source_sentence": "直渡者，謂正趣傍岸。",
        "translation": "Someone who crosses straight is someone who's headed for the side bank.",
        "source": "T23n1442_033:0807b19_4"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1442_033:0807b19_5"
    },
    {
        "source_sentence": "若苾芻共尼同乘船，計其遠近，得罪輕重同前道行。",
        "translation": "If a monk and nun ride together in a boat and calculate the distance between them, they'll be guilty of the same serious offense as the previous one.",
        "source": "T23n1442_033:0807b20_6"
    },
    {
        "source_sentence": "若篙棹折隨流而去，或復柂折或避灘磧，或柂師不用其語，此皆無犯。",
        "translation": "It's not a violation if the boat breaks down and follows the river and leaves, or if it breaks down again or avoids the sea or the captain of the boat doesn't use his words.",
        "source": "T23n1442_033:0807b21_7"
    },
    {
        "source_sentence": "又無犯者，謂初犯人，或癡狂、心亂、痛惱所纏。",
        "translation": "It's also not a violation because the first offender is sometimes tethered by delusion, mental disturbance, or pain.",
        "source": "T23n1442_033:0807b22_8"
    },
    {
        "source_sentence": "獨與女人在屏處坐學處第二十八",
        "translation": "Twenty-eighth place where he sat and studied alone with a woman in seclusion",
        "source": "T23n1442_033:0807b24_0"
    },
    {
        "source_sentence": "佛在室羅伐城逝多林給孤獨園。",
        "translation": "The Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T23n1442_033:0807b25_0"
    },
    {
        "source_sentence": "時具壽鄔陀夷，於日初分著衣持鉢入城乞食，次至故二笈多之舍。",
        "translation": "At the beginning of the day, Kauṣṭhila Udayana put on his robes, took his bowl, entered the city to solicit alms, and then went to the old dwelling of the two Guptas.",
        "source": "T23n1442_033:0807b25_1"
    },
    {
        "source_sentence": "是時笈多遙見鄔陀夷來，即為敷座告言：「善來！",
        "translation": "Seeing Udayana coming from a distance, Gupta spread out his seat and told him, Good friend!",
        "source": "T23n1442_033:0807b27_2"
    },
    {
        "source_sentence": "聖者可於此坐。」",
        "translation": "The sage may sit here.",
        "source": "T23n1442_033:0807b28_3"
    },
    {
        "source_sentence": "即共笈多相對而坐。",
        "translation": "He then sat facing each other with Gupta.",
        "source": "T23n1442_033:0807b28_4"
    },
    {
        "source_sentence": "時鄔陀夷為其說法，憶昔同歡告笈多曰：「汝憶昔日於彼園中或天祠處，敷設如是臥具、然如是燈明、食如是飲食，作如是歡戲不？」",
        "translation": "Udayin then taught the Dharma for him, remembering what he had told Gupta in the past, Do you remember how you used to spread out such bedding, light such a lamp, eat such food and drink in that garden or deva shrine, and make such joyous play?",
        "source": "T23n1442_033:0807b29_5"
    },
    {
        "source_sentence": "答言：「我憶。」",
        "translation": "He replied, I remember.",
        "source": "T23n1442_033:0807c03_6"
    },
    {
        "source_sentence": "時有乞食苾芻亦至笈多舍，笈多見已作如是念：「我今若起與食恐絕言談。」",
        "translation": "A monk who was begging for food then also went to the Gupta's dwelling, and when he saw it, Gupta thought, Now, if I were to get up and give food, I'm afraid I won't talk.",
        "source": "T23n1442_033:0807c03_7"
    },
    {
        "source_sentence": "即便撝手令去。",
        "translation": "He then raised his hand and ordered him to leave.",
        "source": "T23n1442_033:0807c05_8"
    },
    {
        "source_sentence": "時鄔陀夷見其撝手，告言：「笈多！",
        "translation": "Udayana then saw his palms and told him, Gupta!",
        "source": "T23n1442_033:0807c05_9"
    },
    {
        "source_sentence": "汝對我前情無羞恥，便與外人手相撝遣。」",
        "translation": "You won't be ashamed of your past feelings, and you'll be dismissed by the outsiders with their hands.",
        "source": "T23n1442_033:0807c06_10"
    },
    {
        "source_sentence": "報言：「聖者！",
        "translation": "He replied, Sage!",
        "source": "T23n1442_033:0807c07_11"
    },
    {
        "source_sentence": "我實不與外人漫相撝遣，然有乞食苾芻欲來求食，我作是念：『若起與食恐絕言談。』",
        "translation": "I really don't give food to outsiders, but there are begging monks who want to come and ask for food, and I think, 'If I start giving food, I'm afraid I won't talk.'",
        "source": "T23n1442_033:0807c07_12"
    },
    {
        "source_sentence": "遂以手撝，更無別意。」",
        "translation": "So he put his hand on it, and there's no different idea.",
        "source": "T23n1442_033:0807c09_13"
    },
    {
        "source_sentence": "鄔陀夷曰：「豈我為汝說四聖諦法而畏絕耶？",
        "translation": "Udayana said, Did I teach the Dharma of the four noble truths for you and fear them?",
        "source": "T23n1442_033:0807c09_14"
    },
    {
        "source_sentence": "然我於昔時常自舉手，從他乞匃得斯產業，捨而出家。",
        "translation": "In the past, however, I always raised my hand to beg for this property from someone else and gave it up to leave home.",
        "source": "T23n1442_033:0807c10_15"
    },
    {
        "source_sentence": "汝今不能助成福事惠施乞人。」",
        "translation": "Now, you can't help accomplish meritorious deeds and give alms to beggars.",
        "source": "T23n1442_033:0807c11_16"
    },
    {
        "source_sentence": "于時笈多即便重喚乞者，以上妙飯食授與滿鉢。",
        "translation": "The Gupta then summoned the beggar again, gave him the above-mentioned marvelous rice and food to fill his bowl.",
        "source": "T23n1442_033:0807c12_17"
    },
    {
        "source_sentence": "時乞食者得食便去，其鄔陀夷於此飯食訖歸逝多林。",
        "translation": "The beggar then obtained food and departed, and the Udayana returned to Jeta's Grove after he had finished his meal.",
        "source": "T23n1442_033:0807c13_18"
    },
    {
        "source_sentence": "彼乞食者便作是念：「我今宜往大德鄔陀夷所助其歡喜。」",
        "translation": "The beggar then had this thought, Now, I'd better go to the great virtuous Upāsikā and help him rejoice.",
        "source": "T23n1442_033:0807c14_19"
    },
    {
        "source_sentence": "往彼告言：「大德當生慶喜，我於今日受仁妙供。」",
        "translation": "Going there, he told them, The great virtuous one will give rise to rejoicing, and today I'll accept a wonderful offering of kindness.",
        "source": "T23n1442_033:0807c16_20"
    },
    {
        "source_sentence": "鄔陀夷曰：「汝初入舍見作何事？」",
        "translation": "Udayana said, What did you do when you first entered the house?",
        "source": "T23n1442_033:0807c17_21"
    },
    {
        "source_sentence": "答曰：「見以手遮。」",
        "translation": "He replied, I see it covered with my hand.",
        "source": "T23n1442_033:0807c18_0"
    },
    {
        "source_sentence": "問曰：「後作何事？」",
        "translation": "He asked, What will you do later?",
        "source": "T23n1442_033:0807c18_1"
    },
    {
        "source_sentence": "答曰：「彼出好食持以相施。」",
        "translation": "He answered, They give each other good food and maintain it as a gift.",
        "source": "T23n1442_033:0807c18_2"
    },
    {
        "source_sentence": "報曰：「當爾之時我在舍內，令施汝食。」",
        "translation": "He replied, At the time, I was inside the monastery and asked you to give me food.",
        "source": "T23n1442_033:0807c19_3"
    },
    {
        "source_sentence": "問曰：「大德當時共女人一處坐耶？」",
        "translation": "He asked, Did the great virtuous man sit in one place with a woman at the time?",
        "source": "T23n1442_033:0807c20_4"
    },
    {
        "source_sentence": "答言：「爾。」",
        "translation": "He replied, Yes.",
        "source": "T23n1442_033:0807c20_5"
    },
    {
        "source_sentence": "曰：「此事合不？」",
        "translation": "He said, Is this the right thing?",
        "source": "T23n1442_033:0807c21_6"
    },
    {
        "source_sentence": "答：「從合不合我已作訖，何干汝事？",
        "translation": "Answer: From the time it's combined and not combined, I've done it, so why would I do your work?",
        "source": "T23n1442_033:0807c21_7"
    },
    {
        "source_sentence": "若汝不能共容忍者，當告苾芻制其學處。」",
        "translation": "If you can't tolerate the ninja together, you must tell the monk to regulate his place of training.",
        "source": "T23n1442_033:0807c22_8"
    },
    {
        "source_sentence": "答曰：「我豈相捨！」",
        "translation": "He replied, How can I abandon it?",
        "source": "T23n1442_033:0807c23_9"
    },
    {
        "source_sentence": "即以此事白諸苾芻。",
        "translation": "He then told the monks about this matter.",
        "source": "T23n1442_033:0807c23_10"
    },
    {
        "source_sentence": "少欲者聞各生嫌恥：「云何苾芻與女人屏處獨坐？」",
        "translation": "Those with few desires heard each one and became disgusted, How did the monks and women sit alone in a secluded place?",
        "source": "T23n1442_033:0807c23_11"
    },
    {
        "source_sentence": "時諸苾芻以此因緣具白世尊，世尊乃至問鄔陀夷，廣說如前，「制其學處，應如是說：若復苾芻獨與一女人屏處坐者，波逸底迦。」",
        "translation": "The monks then told the Bhagavān about this cause and condition, and the Bhagavān or even the Bhagavān asked Udayana to explain it in detail as before, Restricting his place of training, he should thus say, 'Suppose another monk sits alone with a woman in a secluded place, pratyekabuddha.'",
        "source": "T23n1442_033:0807c25_0"
    },
    {
        "source_sentence": "若復苾芻者，謂鄔陀夷，餘義如上。",
        "translation": "If another monk is a Udayana, the rest are as above.",
        "source": "T23n1442_033:0807c27_1"
    },
    {
        "source_sentence": "女人者，謂堪行婬女。",
        "translation": "A woman is a woman who's capable of sexual misconduct.",
        "source": "T23n1442_033:0807c28_2"
    },
    {
        "source_sentence": "獨者，謂無第三人。",
        "translation": "Alone means there's no third person.",
        "source": "T23n1442_033:0807c29_3"
    },
    {
        "source_sentence": "屏處有三：謂牆、柵及幔。",
        "translation": "There are three places of seclusion: walls, fences and curtains.",
        "source": "T23n1442_033:0807c29_4"
    },
    {
        "source_sentence": "坐者，謂一尋內縱身而坐，結罪同前。",
        "translation": "Sitting means to sit with one bodily posture, facing inward. The blameworthiness is the same as before.",
        "source": "T23n1442_033:0808a01_5"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1442_033:0808a01_6"
    },
    {
        "source_sentence": "若苾芻獨與女人在屏處縱身而坐，無第三人，得波逸底迦。",
        "translation": "If a monk is alone with a woman in a secluded place and sits cross-legged without a third person, he'll attain pratyekabuddha.",
        "source": "T23n1442_033:0808a02_7"
    },
    {
        "source_sentence": "若在門屋下或在房門前，或令女人獨於此處摩煮諸藥，大開其門，來往諸人皆得見者，無犯。",
        "translation": "It's not a violation if someone is under the door or in front of the door, or if they cause a woman to cook medicines here alone and open the door wide so that everyone who comes and goes can see them.",
        "source": "T23n1442_033:0808a03_8"
    },
    {
        "source_sentence": "又無犯者，謂最初犯人，或癡狂、心亂、痛惱所纏。",
        "translation": "Also, there's no offense because the first offender is sometimes tethered by delusion, mental disturbance, or pain.",
        "source": "T23n1442_033:0808a05_9"
    },
    {
        "source_sentence": "與苾芻尼屏處坐學處第二十九",
        "translation": "Twenty-nineth place where he sat and studied with the bhikṣuṇīs in seclusion",
        "source": "T23n1442_033:0808a07_0"
    },
    {
        "source_sentence": "佛在室羅伐城逝多林給孤獨園。",
        "translation": "The Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T23n1442_033:0808a08_0"
    },
    {
        "source_sentence": "是時笈多既出家已，次當授事。",
        "translation": "After leaving home, Gupta then, he'll next teach the Dharma.",
        "source": "T23n1442_033:0808a08_1"
    },
    {
        "source_sentence": "時諸尼眾，於日初分著衣持鉢皆行乞食，唯有笈多獨在寺住。",
        "translation": "The nuns then gathered their robes and bowls for the first part of the day to solicit alms, but only Gupta lived alone in the monastery.",
        "source": "T23n1442_033:0808a09_2"
    },
    {
        "source_sentence": "時鄔陀夷入城乞食，至苾芻尼寺。",
        "translation": "Udayana then entered the city to solicit alms and went to the Bhikṣuṇī Temple.",
        "source": "T23n1442_033:0808a10_3"
    },
    {
        "source_sentence": "是時笈多躬為灑掃，於寺門前遙見鄔陀夷來，告言：「善來聖者！」",
        "translation": "Gautama then personally swept it away, saw Udayana coming from a distance in front of the temple gates, and told him, Well come, sage!",
        "source": "T23n1442_033:0808a11_4"
    },
    {
        "source_sentence": "即便放篲，前禮其足在一面立。",
        "translation": "He dismounted, bowed his head at his feet, and stood to one side.",
        "source": "T23n1442_033:0808a13_5"
    },
    {
        "source_sentence": "時鄔陀夷便為說法，說法既久憶昔同歡，告笈多曰：「汝憶往日於彼園中，廣說如前。」",
        "translation": "Udayana then taught the Dharma for him, and since he had taught the Dharma for a long time, he remembered the same joy in the past and told Gupta, Remember what you said in detail in those parks in the past.",
        "source": "T23n1442_033:0808a13_6"
    },
    {
        "source_sentence": "乃至答言：「我憶。」",
        "translation": "He replied, I remember it.",
        "source": "T23n1442_033:0808a15_7"
    },
    {
        "source_sentence": "時有老病苾芻尼在門屋下坐，作如是念：「此之二人乃至母嫁時事亦共評論。」",
        "translation": "An elderly and sick bhikṣuṇī then sat under the door and thought, These two people or even their mother's married affairs will also be commented on together.",
        "source": "T23n1442_033:0808a16_0"
    },
    {
        "source_sentence": "時既延久，笈多報曰：「聖者！",
        "translation": "After a long time had passed, Gupta replied, Sage!",
        "source": "T23n1442_033:0808a17_1"
    },
    {
        "source_sentence": "應去。",
        "translation": "You should leave.",
        "source": "T23n1442_033:0808a18_2"
    },
    {
        "source_sentence": "諸苾芻尼欲來入寺，見不掃除恐生嫌恨，我當掃灑。」",
        "translation": "The monks and nuns want to enter the monastery, but when they see someone who doesn't sweep it, they're afraid to become angry, so I will sweep it.",
        "source": "T23n1442_033:0808a18_3"
    },
    {
        "source_sentence": "鄔陀夷遂去。",
        "translation": "Udayana then departed.",
        "source": "T23n1442_033:0808a19_4"
    },
    {
        "source_sentence": "笈多掃灑，諸尼見問：「掃地何少？」",
        "translation": "When Gupta swept, the nuns saw him and asked, What's missing from the sweeping ground?",
        "source": "T23n1442_033:0808a19_5"
    },
    {
        "source_sentence": "答曰：「自汝去後我立不坐。」",
        "translation": "He replied, After you leave, I'll stand and not sit.",
        "source": "T23n1442_033:0808a20_6"
    },
    {
        "source_sentence": "老尼聞已報曰：「仁等去後笈多不坐，其事實爾。",
        "translation": "When the old nun heard this, she reported back, saying, Sir, it's true that you won't be able to sit in the Gupta after you leave.",
        "source": "T23n1442_033:0808a21_7"
    },
    {
        "source_sentence": "然大德鄔陀夷來至於此，立共笈多恣意言話，乃至母嫁亦並評章。」",
        "translation": "Still, when the great virtuous Upāsikā came to this place, he stood up with Gupta and spoke freely, even as his mother's wife commented on the chapter.",
        "source": "T23n1442_033:0808a22_8"
    },
    {
        "source_sentence": "諸苾芻尼問笈多曰：「實作如是不端嚴事耶？」",
        "translation": "The monks and nuns asked Gupta, Did you really do such an unworthy thing?",
        "source": "T23n1442_033:0808a23_9"
    },
    {
        "source_sentence": "答言：「實爾。」",
        "translation": "He replied, Indeed.",
        "source": "T23n1442_033:0808a24_10"
    },
    {
        "source_sentence": "諸尼聞已咸生嫌恥：「云何苾芻與苾芻尼獨在屏處立？」",
        "translation": "After hearing this, the nuns all became embarrassed and said, How are the monks and nuns standing alone in a secluded place?",
        "source": "T23n1442_033:0808a25_11"
    },
    {
        "source_sentence": "以此因緣白諸苾芻，諸苾芻白佛。",
        "translation": "Because of these causes and conditions, he told the monks, and the monks told the Buddha.",
        "source": "T23n1442_033:0808a26_12"
    },
    {
        "source_sentence": "佛以此緣集苾芻眾，問答呵責廣說如前，乃至「為制學處，應如是說：若復苾芻獨與一苾芻尼屏處坐者，波逸底迦。」",
        "translation": "The Buddha gathered the monks for this reason and asked, answered, and rebuked them in detail as before, even to the point where he said, In order to regulate the training place, he should thus explain, 'Suppose another monk sits alone with a monk or nun in a secluded place, pratyekabuddha.'",
        "source": "T23n1442_033:0808a27_13"
    },
    {
        "source_sentence": "若復苾芻者，謂鄔陀夷，餘義如上。",
        "translation": "If another monk is a Udayana, the rest are as above.",
        "source": "T23n1442_033:0808a29_14"
    },
    {
        "source_sentence": "釋獨等義廣說如前。",
        "translation": "The explanation of the meaning of solitary and so forth is explained in detail as before.",
        "source": "T23n1442_033:0808b01_15"
    },
    {
        "source_sentence": "此中犯相立臥皆犯，餘如前說。",
        "translation": "Among these forms of transgression, lying or standing is a transgression. The rest are as has been said previously.",
        "source": "T23n1442_033:0808b01_16"
    },
    {
        "source_sentence": "知苾芻尼讚歎得食學處第三十",
        "translation": "Thirty-fifth Place of Cultivation for Those Who Know That A Bhikṣuṇī Praises the Acceptance of Food",
        "source": "T23n1442_033:0808b03_0"
    },
    {
        "source_sentence": "佛在室羅伐城逝多林給孤獨園。",
        "translation": "The Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T23n1442_033:0808b04_0"
    },
    {
        "source_sentence": "爾時具壽大迦攝波在城東園鹿子母舍，時迦攝波於晡後時從靜慮起，往世尊所禮佛足已退坐一面。",
        "translation": "It was then that the long-lived Kāśyapa Mahākāśyapa was staying at the deer's mother's house in the Deer Park to the east of the city, and Kāśyapa rose from meditation late in the morning and went to the Bhagavān's side after bowing his head at the Buddha's feet.",
        "source": "T23n1442_033:0808b04_1"
    },
    {
        "source_sentence": "爾時佛告迦攝波曰：「汝今年衰朽老，所著布糞掃衣極成重滯，此應棄捨。",
        "translation": "It was then that the Buddha addressed Kāśyapa, saying, This year you're old and decrepit, wearing cloth, dung, sweeping clothes, and extremely heavy hindrances, so you should abandon them.",
        "source": "T23n1442_033:0808b07_2"
    },
    {
        "source_sentence": "當隨我教依眾而住，受別請食及施主衣，應以刀截并染壞色而守持之。」",
        "translation": "You must follow my instructions and rely on the crowd to abide, accept food that's specially invited and the donor's clothing, and guard it with a knife that cuts off and dyes its color.",
        "source": "T23n1442_033:0808b08_3"
    },
    {
        "source_sentence": "時迦攝波奉教歡喜禮佛而去。",
        "translation": "Kāśyapa then paid homage to the Buddha and departed.",
        "source": "T23n1442_033:0808b10_4"
    },
    {
        "source_sentence": "於此城中有一長者，於長夜中作如是念：「善哉！",
        "translation": "In this city, there was an elderly man who had this thought for a long time during the night, Good!",
        "source": "T23n1442_033:0808b11_5"
    },
    {
        "source_sentence": "大迦攝波合受人天恭敬供養，我當何時於己舍中得設微供延請來食？」",
        "translation": "Mahākāśyapa, when will I be able to make a humble offering in my own house and invite someone to come for food?",
        "source": "T23n1442_033:0808b12_6"
    },
    {
        "source_sentence": "長者聞佛令迦攝波依眾而住并受別請，往詣其所禮足已在一面坐。",
        "translation": "When the elder heard that the Buddha had told Kāśyapa to stay with the crowd and accepted a special invitation, he went to him, bowed his head at his feet, and sat to one side.",
        "source": "T23n1442_033:0808b13_7"
    },
    {
        "source_sentence": "時迦攝波為彼長者說微妙法示教利喜，長者便念：「我若獨請大德詣舍食者，或容不肯受，我今宜可通請四人。」",
        "translation": "Kāśyapa then explained the subtle teaching to that elder and showed him how to benefit and rejoice, and the elder thought, If I were to invite the great virtuous man alone to my house to eat, or if he would allow me to refuse to accept it, I might as well invite four people.",
        "source": "T23n1442_033:0808b15_8"
    },
    {
        "source_sentence": "長者即從座起偏袒右肩合掌禮敬白言：「聖者！",
        "translation": "The elder rose from his seat, bared his right shoulder, joined his palms in respect, and said, Sage!",
        "source": "T23n1442_033:0808b17_9"
    },
    {
        "source_sentence": "唯願大德并已四人，明日就家受我微供。」",
        "translation": "May the great virtuous one and the four others who have joined him go home tomorrow to receive my humble offerings.",
        "source": "T23n1442_033:0808b19_0"
    },
    {
        "source_sentence": "是時尊者默然受請。",
        "translation": "The venerable then remained silent and accepted the invitation.",
        "source": "T23n1442_033:0808b20_0"
    },
    {
        "source_sentence": "時彼長者見受請已禮足而去，既至舍已告其妻曰：「賢首！",
        "translation": "Seeing the invitation, the elder bowed his feet and departed. When he arrived at the house, he told his wife, Good man!",
        "source": "T23n1442_033:0808b20_1"
    },
    {
        "source_sentence": "我於長夜作如是念：『善哉！",
        "translation": "For a long time, I had this thought:",
        "source": "T23n1442_033:0808b21_2"
    },
    {
        "source_sentence": "大迦攝波合受人天恭敬供養，我當何時於已舍中得設微供延請來食？』",
        "translation": "When did the great Kāśyapa gather together to receive the respect and offerings of humans and gods, when will I be able to make a modest offering in my dwelling and invite food?'",
        "source": "T23n1442_033:0808b22_3"
    },
    {
        "source_sentence": "我於向者延請大德通已四人，明來我舍為受供養。",
        "translation": "I've invited four people of great virtue and insight from those who went before me to come to my house to make offerings.",
        "source": "T23n1442_033:0808b24_0"
    },
    {
        "source_sentence": "彼已慈悲許受我請，賢首宜可多辦清淨上妙飲食。」",
        "translation": "They have kindly and compassionately agreed to accept my invitation, so it's advisable for Bhadrapāla to prepare a large amount of pure, excellent food and drink.",
        "source": "T23n1442_033:0808b25_1"
    },
    {
        "source_sentence": "其妻聞已尋皆備辦，應合冷食今日修營，堪熱食者明朝當作。",
        "translation": "When the wife heard this, she found out and prepared everything. She should combine a cold meal with today’s food to sustain her health. Those who were able to eat hot food would do so in the morning.",
        "source": "T23n1442_033:0808b26_2"
    },
    {
        "source_sentence": "時彼長者至明日清旦便作是念：「我今若於三層舍下敷設坐席，乞食諸人共相諠閙。",
        "translation": "The elder then thought, Now, if I were to spread out a seat under the three-story dwelling and beg for food, the people would be arguing with each other.",
        "source": "T23n1442_033:0808b27_3"
    },
    {
        "source_sentence": "若在第三層上，烏鳥亂飛恐污飲食，宜於中層敷其座褥。」",
        "translation": "If he's on the third storey, a crow flying in disorder is afraid to defile food and drink, so it's better to spread out his seat bedding on the middle storey.",
        "source": "T23n1442_033:0808b29_4"
    },
    {
        "source_sentence": "既敷設已即令使者往白尊者迦攝波：「大德！",
        "translation": "After setting it up, he ordered the messenger to go and tell Venerable Kāśyapa, Mañjuśrī!",
        "source": "T23n1442_033:0808c02_0"
    },
    {
        "source_sentence": "飲食已辦，幸願知時。」",
        "translation": "The food and drink have been prepared, so please let me know the time.",
        "source": "T23n1442_033:0808c03_0"
    },
    {
        "source_sentence": "如佛所說：「若為先首受他請者應在前赴。」",
        "translation": "As the Buddha said, If you're the first to accept someone else's invitation, you should go in front of him.",
        "source": "T23n1442_033:0808c03_1"
    },
    {
        "source_sentence": "時大迦攝波於日初分通己四人往長者舍，既至彼已便昇中閣就坐而坐。",
        "translation": "At the beginning of the day, Mahākāśyapa went to the elder's house with his four men and rose up into the middle hall, sat down, and took his seat.",
        "source": "T23n1442_033:0808c04_2"
    },
    {
        "source_sentence": "是時長者禮尊者迦攝波足已在一面坐，時大迦攝波為其說法示教利喜。",
        "translation": "The elder then bowed his head at the feet of Venerable Kāśyapa and sat to one side, and Mahākāśyapa taught him the Dharma and showed him how to benefit.",
        "source": "T23n1442_033:0808c06_3"
    },
    {
        "source_sentence": "時吐羅難陀苾芻尼亦來乞食前入長者舍，告其婦曰：「妙相無病長壽，當施好食。」",
        "translation": "The Tūrananda bhikṣuṇī also came to the elder's house in front of the almsbowl and told his wife, Marvelous features have no illness or long life; you must give them good food.",
        "source": "T23n1442_033:0808c07_4"
    },
    {
        "source_sentence": "長者婦見報言：「聖者！",
        "translation": "When the elder's wife saw him, she said, Sage!",
        "source": "T23n1442_033:0808c09_5"
    },
    {
        "source_sentence": "今日稍忙無暇相與。」",
        "translation": "Today, I'm slightly busy and don't have time to share it with you.",
        "source": "T23n1442_033:0808c10_6"
    },
    {
        "source_sentence": "問言：「何為？」",
        "translation": "He asked, What is it?",
        "source": "T23n1442_033:0808c10_7"
    },
    {
        "source_sentence": "答曰：「尊者大迦攝波一切人天皆恭敬供養，今我舍內聊設踈供，請彼四人來此受食，時將欲至，仁可且去。」",
        "translation": "He answered, Venerable Mahākāśyapa, all the people and gods respectfully offer support, so now I'll make a humble offering in my dwelling and invite those four people to come here to receive food when they're about to arrive, so please go.",
        "source": "T23n1442_033:0808c10_8"
    },
    {
        "source_sentence": "尼便報曰：「彼是外道出家至愚至鈍，多有諸餘釋迦上族出家具戒，為大法師三藏俱明詞辯無礙，何不供養乃施餘人？」",
        "translation": "The nuns then replied, That's a non-Buddhist renunciant who's so ignorant and dull that there are many other Śākyas of the upper castes who renounce the precepts to become great法師三藏俱明詞辯無礙, so why don't they make offerings to others?",
        "source": "T23n1442_033:0808c13_9"
    },
    {
        "source_sentence": "時大迦攝波聞此語聲作如是念：「勿令此尼廣為惡業。」",
        "translation": "When Mahākāśyapa heard this sound, he had this thought, Don't cause this nun to do a lot of bad actions.",
        "source": "T23n1442_033:0808c16_0"
    },
    {
        "source_sentence": "故作謦欬，金聲雅亮響遍宅中。",
        "translation": "That's why it's made into a bell, and its golden sound is so elegant and bright that it fills the house.",
        "source": "T23n1442_033:0808c17_1"
    },
    {
        "source_sentence": "尼聞妙音知是迦攝波，作如是語：「彼大龍象已至宅中。」",
        "translation": "Knowing that it was Kāśyapa, the nun heard Marvelous Sound and said, That great dragon elephant has arrived at his house.",
        "source": "T23n1442_033:0808c17_2"
    },
    {
        "source_sentence": "長者聞已遂作是念：「前云：『外道出家至愚至鈍。』",
        "translation": "After hearing this, the elder thought, 'It's been said before, 'Non-Buddhist renunciants are most ignorant and dull.'",
        "source": "T23n1442_033:0808c19_3"
    },
    {
        "source_sentence": "後更說云：『是大龍象。』」",
        "translation": "Later, he said, 'That's a great dragon elephant.'",
        "source": "T23n1442_033:0808c20_4"
    },
    {
        "source_sentence": "便起怒心從閣而下。",
        "translation": "He then became angry and went down from the pavilion.",
        "source": "T23n1442_033:0808c20_5"
    },
    {
        "source_sentence": "彼下閣時急行震響，尼聞行聲便作是念：「聽此行步響異尋常，必當於我作無利事，宜可急出勿令見我。」",
        "translation": "When he descended from the pavilion, there was a sudden sound of an urgent movement, and when the nuns heard the sound of his movement, they thought, Listen to the sounds of this movement that are so extraordinary and ordinary that they'll surely do unbeneficial things for me; it's better to get out quickly and not let them see me.",
        "source": "T23n1442_033:0808c21_6"
    },
    {
        "source_sentence": "即擡裙急步疾出其舍，長者告曰：「禿沙門尼！",
        "translation": "He then lifted his skirt and quickly left his house, and the elder told him, baldie!",
        "source": "T23n1442_033:0808c23_7"
    },
    {
        "source_sentence": "何故逃走？",
        "translation": "Why do they run away?",
        "source": "T23n1442_033:0808c24_8"
    },
    {
        "source_sentence": "更不得來入我宅內。」",
        "translation": "They won't be allowed to come into my house again.",
        "source": "T23n1442_033:0808c24_9"
    },
    {
        "source_sentence": "尼遙報曰：「汝家如廁、如獄、停旃荼羅，我蒙國王同宮內人無有障礙。",
        "translation": "From a distance, the nun replied, Your house is like a toilet, like a prison, and like a caṇḍāla, so I'll have no obstruction if the king or people inside the palace are the same as me.",
        "source": "T23n1442_033:0808c25_10"
    },
    {
        "source_sentence": "汝若觸著我者，當截汝雙腕。」",
        "translation": "If you touch me, I'll cut off your wrists.",
        "source": "T23n1442_033:0808c26_11"
    },
    {
        "source_sentence": "長者告曰：「禿沙門尼！",
        "translation": "The elder told them, baldie nuns!",
        "source": "T23n1442_033:0808c27_12"
    },
    {
        "source_sentence": "諸耆宿尼蒙王恩澤，非汝貪恚無識之人，且放汝去。」",
        "translation": "The senior monks and nuns have been blessed by the king, so it's not because you're greedy or addicted to people without consciousness that you've been released.",
        "source": "T23n1442_033:0808c27_13"
    },
    {
        "source_sentence": "長者自持種種上妙飲食竭誠供養，飯食既訖收鉢澡手嚼齒木已，長者及妻卑席而坐，聽說妙法。",
        "translation": "The elderly man offered various kinds of delicious food and drink to him, and when the meal was over, he put away his bowl, rinsed his hands, chewed his teeth, and sat down on a low seat with the elder and his wife, listening to the wonderful teaching.",
        "source": "T23n1442_033:0808c29_14"
    },
    {
        "source_sentence": "時大迦攝波為說法要示教利喜，從座而去。",
        "translation": "Mahākāśyapa then taught the essentials of the Dharma for him, showed them how to benefit and delight in it, and departed from his seat.",
        "source": "T23n1442_033:0809a02_15"
    },
    {
        "source_sentence": "至住處已往詣佛所，禮佛足已却坐一面，白佛言：「世尊！",
        "translation": "When he arrived, he went to the Buddha's place, bowed his head at his feet, withdrew to sit at one side, and said to him, Bhagavān!",
        "source": "T23n1442_033:0809a03_16"
    },
    {
        "source_sentence": "我蒙佛教令依眾住受別請食，由斯乃是外道出家至愚至鈍，復是佛弟子中為大龍象。",
        "translation": "As a result, I've been instructed by the Buddha to rely on the living and accept food that's specially invited. That's why I'm a non-Buddhist renunciant who's so ignorant and dull as to be a great dragon elephant among the Buddha's disciples.",
        "source": "T23n1442_033:0809a04_17"
    },
    {
        "source_sentence": "我於今日得斯毀譽。",
        "translation": "Today, I've received this praise.",
        "source": "T23n1442_033:0809a06_18"
    },
    {
        "source_sentence": "大德！",
        "translation": "O great virtuous one!",
        "source": "T23n1442_033:0809a07_0"
    },
    {
        "source_sentence": "我於長夜自居闌若、讚住闌若，自常乞食、讚常乞食，自居樹下、著糞掃衣，讚居樹下、著糞掃衣。」",
        "translation": "For a long time, I've lived on my own at the end of the night and praised living in the end of the night, always begged for food and praised begging for food, lived under trees on my own, wore robes made of dung and sweeping clothes, praised living under trees, and wore robes made of dung and sweeping clothes.",
        "source": "T23n1442_033:0809a07_1"
    },
    {
        "source_sentence": "佛告大迦攝波：「汝見何利自居闌若、讚歎闌若，自常乞食、讚歎乞食，自居樹下、讚歎樹下，自著糞掃衣、讚歎糞掃衣。」",
        "translation": "The Buddha told Mahākāśyapa, What do you see as the benefits of living in your own place and praising it? You always beg for food and praise it; you live under a tree and praise it; you wear dung sweeping robes yourself and praise dung sweeping robes.",
        "source": "T23n1442_033:0809a09_2"
    },
    {
        "source_sentence": "大迦攝波白佛言：「世尊！",
        "translation": "Mahākāśyapa said to the Buddha, Bhagavān!",
        "source": "T23n1442_033:0809a11_3"
    },
    {
        "source_sentence": "我見二利。",
        "translation": "The view of self has two benefits.",
        "source": "T23n1442_033:0809a12_4"
    },
    {
        "source_sentence": "云何為二？",
        "translation": "What are these two?",
        "source": "T23n1442_033:0809a12_5"
    },
    {
        "source_sentence": "一者於現世中得安樂住，二者於未來世能與多人作大燈炬示其正路。",
        "translation": "One, they'll attain peaceful abiding in the present life, and two, they'll be able to make a great torch of lamps for many people in future lives and show them the right path.",
        "source": "T23n1442_033:0809a12_6"
    },
    {
        "source_sentence": "時彼諸人咸共聞知作如是語：『佛在世時有大德苾芻，捨俗出家淨修梵行。",
        "translation": "Those people then all heard the Buddha's words, saying, 'When he was in the world, there was a virtuous monk who renounced the secular life and left home to purely cultivate the religious practice.",
        "source": "T23n1442_033:0809a14_7"
    },
    {
        "source_sentence": "大師所讚智者所稱，自居闌若乃至示其正路。』",
        "translation": "The great teacher praises what the wise person calls it, and he goes from one place to another or shows them the right path.'",
        "source": "T23n1442_033:0809a16_8"
    },
    {
        "source_sentence": "時諸苾芻等聞是事已各自策勵，如說修行勤求出道，彼於長夜得安樂住。」",
        "translation": "After hearing these things, the monks and others each encouraged themselves to cultivate their practice as described and diligently pursue the path of renunciation, and they were able to live peacefully for a long time.",
        "source": "T23n1442_033:0809a17_9"
    },
    {
        "source_sentence": "說是語已，佛告大迦攝波：「善哉！",
        "translation": "After speaking these words, the Buddha addressed Mahākāśyapa, Good!",
        "source": "T23n1442_033:0809a18_10"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T23n1442_033:0809a19_11"
    },
    {
        "source_sentence": "汝能如是，於長夜中與未來世同梵行者作大饒益，哀愍世間人天等眾，惠利一切令得解脫。",
        "translation": "For a long time, you've been able to give great benefit to those who practice the same religious practices in future generations, pitying humans and gods in the world and benefiting all of them so that they attain liberation.",
        "source": "T23n1442_033:0809a19_12"
    },
    {
        "source_sentence": "迦攝波！",
        "translation": "Kāśyapa!",
        "source": "T23n1442_033:0809a21_13"
    },
    {
        "source_sentence": "若有毀訾杜多行者，我毀其人；",
        "translation": "If there are those who disparage the practitioners of Buddhism, I disparage them.",
        "source": "T23n1442_033:0809a22_14"
    },
    {
        "source_sentence": "若有讚歎杜多行者，我讚其人。",
        "translation": "If someone praises the practitioner Duduo, I'll praise him.",
        "source": "T23n1442_033:0809a22_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T23n1442_033:0809a23_16"
    },
    {
        "source_sentence": "迦攝波！",
        "translation": "Kāśyapa!",
        "source": "T23n1442_033:0809a23_17"
    },
    {
        "source_sentence": "我於長夜讚歎行此杜多功德，稱揚顯說諸行中最。",
        "translation": "For a long time, I've praised the virtue of performing this duty and praised it as the best among all the practices.",
        "source": "T23n1442_033:0809a23_18"
    },
    {
        "source_sentence": "迦攝波！",
        "translation": "Kāśyapa!",
        "source": "T23n1442_033:0809a25_0"
    },
    {
        "source_sentence": "汝從今日常住闌若，讚歎他人住闌若處，乃至廣說。",
        "translation": "From today, you'll always stay in a place where others live and praise the places where they live, up to explain it in detail.",
        "source": "T23n1442_033:0809a25_1"
    },
    {
        "source_sentence": "汝等應當勤心修學。」",
        "translation": "You should diligently cultivate it.",
        "source": "T23n1442_033:0809a26_2"
    },
    {
        "source_sentence": "時迦攝波奉教修習。",
        "translation": "Kāśyapa then taught and cultivated it.",
        "source": "T23n1442_033:0809a26_3"
    },
    {
        "source_sentence": "此是緣起，仍未制學處。",
        "translation": "This is conditioned arising, but it's still not a place of training.",
        "source": "T23n1442_033:0809a27_4"
    },
    {
        "source_sentence": "佛在室羅伐城逝多林給孤獨園。",
        "translation": "The Buddha was staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T23n1442_033:0809a28_0"
    },
    {
        "source_sentence": "時世飢饉乞求難得，時有淨信婆羅門長者居士等，於諸大德尊宿苾芻常為供養。",
        "translation": "At the time, there was a hunger in the world and it was difficult to ask for alms, and sometimes there were purely faithful Brāhmaṇas, elders, householders, and others who always made offerings to the venerable monks of great virtue.",
        "source": "T23n1442_033:0809a28_1"
    },
    {
        "source_sentence": "時六眾苾芻入城乞食，詣十二眾尼所。",
        "translation": "Six groups of monks then entered the city to solicit alms and went to twelve nuns.",
        "source": "T23n1442_033:0809b01_2"
    },
    {
        "source_sentence": "時彼諸尼見六眾至，報言：「聖者！",
        "translation": "When those nuns saw the six congregations arrive, they replied, Sage!",
        "source": "T23n1442_033:0809b02_3"
    },
    {
        "source_sentence": "就座可食小食。」",
        "translation": "Let's take a seat and eat a small meal.",
        "source": "T23n1442_033:0809b03_4"
    },
    {
        "source_sentence": "鄔波難陀曰：「誰當授我？」",
        "translation": "Upananda said, Who will teach me?",
        "source": "T23n1442_033:0809b03_5"
    },
    {
        "source_sentence": "答言：「我等。」",
        "translation": "He replied, We are.",
        "source": "T23n1442_033:0809b04_6"
    },
    {
        "source_sentence": "報曰：「今日雖爾，明朝遣誰？」",
        "translation": "He replied, Even so today, who will send it tomorrow morning?",
        "source": "T23n1442_033:0809b04_7"
    },
    {
        "source_sentence": "答曰：「我當還奉。」",
        "translation": "He replied, I will return and serve it.",
        "source": "T23n1442_033:0809b04_8"
    },
    {
        "source_sentence": "報言：「姊妹！",
        "translation": "He replied, Sister!",
        "source": "T23n1442_033:0809b05_9"
    },
    {
        "source_sentence": "說得此食，未能支濟。",
        "translation": "It's said to obtain this food, but they can't support it.",
        "source": "T23n1442_033:0809b05_10"
    },
    {
        "source_sentence": "汝等若能順我等意為饒益者，諸婆羅門等先所供給諸大苾芻種種供養，汝當勸彼迴施於我。",
        "translation": "If you can follow our wishes and give them benefit, the brāhmaṇas and others will first offer various kinds of offerings to the great bhikṣus that they've offered, and you must encourage them to return them to me.",
        "source": "T23n1442_033:0809b06_0"
    },
    {
        "source_sentence": "若能如是得好供給，我當支濟。」",
        "translation": "If you can thus obtain good offerings, I'll help you.",
        "source": "T23n1442_033:0809b08_1"
    },
    {
        "source_sentence": "時吐羅難陀尼白言：「聖者！",
        "translation": "Tūranandaṇḍanī then said, Sage!",
        "source": "T23n1442_033:0809b08_2"
    },
    {
        "source_sentence": "我苾芻尼合作此事不？」",
        "translation": "Do I, the bhikṣuṇī, cooperate with this?",
        "source": "T23n1442_033:0809b09_3"
    },
    {
        "source_sentence": "鄔波難陀曰：「深是合作，誰復相遮？",
        "translation": "Upananda said, Profound is cooperation, so who else would hide it from him?",
        "source": "T23n1442_033:0809b10_0"
    },
    {
        "source_sentence": "豈令我等受餓而死。」",
        "translation": "How could it cause us to suffer hunger and die?",
        "source": "T23n1442_033:0809b10_1"
    },
    {
        "source_sentence": "尼曰：「我等奉教。」",
        "translation": "The nuns said, We'll follow the teaching.",
        "source": "T23n1442_033:0809b11_2"
    },
    {
        "source_sentence": "時吐羅難陀苾芻尼入城乞食，到彼尊者憍陳如施主之舍，至彼舍中作如是語：「仁比於誰以食供養？」",
        "translation": "When the monks and nuns of Tūrananda entered the city to solicit alms, they went to that Venerable Kauṇḍinya's house like a donor's dwelling and said, Who will make an offering of food to you, sir?",
        "source": "T23n1442_033:0809b11_3"
    },
    {
        "source_sentence": "答曰：「聖者憍陳如我常供養。」",
        "translation": "He answered, The noble monk Kauṇḍinya is like me who always makes offerings.",
        "source": "T23n1442_033:0809b13_4"
    },
    {
        "source_sentence": "報曰：「汝若能於釋種出家，明閑三藏辯才無礙，是大法師為供養者，仁等必當獲殊勝福。」",
        "translation": "He replied, If you can leave home among the Śākyas and understand that the eloquence of the Tripiṭaka is unobstructed, this great teacher of the Dharma will surely make offerings to you, so you'll surely attain extraordinary merit.",
        "source": "T23n1442_033:0809b14_5"
    },
    {
        "source_sentence": "彼便問曰：「誰是釋種具斯眾德？」",
        "translation": "They then asked, Who is the Śākyamuni who possesses these virtues?",
        "source": "T23n1442_033:0809b16_6"
    },
    {
        "source_sentence": "報曰：「聖者難陀即其人也。」",
        "translation": "He replied, The sage named Nanda is that person.",
        "source": "T23n1442_033:0809b17_7"
    },
    {
        "source_sentence": "答曰：「我隨教作。」",
        "translation": "He replied, I'll do as I teach.",
        "source": "T23n1442_033:0809b17_8"
    },
    {
        "source_sentence": "長者遂便以憍陳如供養迴與難陀。",
        "translation": "The elder then offered Kauṇḍinya as an offering and returned it to Nanda.",
        "source": "T23n1442_033:0809b18_9"
    },
    {
        "source_sentence": "如是諸餘耆宿尊德所有供養，悉皆迴與六眾苾芻。",
        "translation": "Thus, all the other offerings made by the venerable spirits of old age are given back to the six groups of monks.",
        "source": "T23n1442_033:0809b19_0"
    },
    {
        "source_sentence": "爾時六眾於日初分著衣持鉢入城乞食，至施食家受諸飲食，餅果之類盛滿角袋，并持飯鉢還歸住處。",
        "translation": "At the beginning of the day, the six members of the assembly put on their robes and bowls for the first part of the day, entered the city to solicit alms, went to the charity food house, accepted food and drink, filled their horn-shaped sacks with cakes and fruits, and returned home with their rice bowls.",
        "source": "T23n1442_033:0809b20_1"
    },
    {
        "source_sentence": "諸苾芻見問曰：「袋中盛滿何處將來？」",
        "translation": "When the monks saw him, they asked, Where will he come from when his bag is full?",
        "source": "T23n1442_033:0809b22_2"
    },
    {
        "source_sentence": "報言：「願我姊妹無病長壽，緣彼教化我得美食。」",
        "translation": "They replied, May my sister be free of illness and have a long life span, so that they can teach me good food based on their teaching.",
        "source": "T23n1442_033:0809b23_3"
    },
    {
        "source_sentence": "諸苾芻曰：「具壽！",
        "translation": "The monks said, Kauṣṭhila!",
        "source": "T23n1442_033:0809b24_4"
    },
    {
        "source_sentence": "合遣諸尼教化飲食而受用耶？」",
        "translation": "Are you sending the nuns to teach and transform food and drink together and accepting it?",
        "source": "T23n1442_033:0809b24_5"
    },
    {
        "source_sentence": "答曰：「據何不合？",
        "translation": "He replied, Why doesn't it fit?",
        "source": "T23n1442_033:0809b25_6"
    },
    {
        "source_sentence": "深誠應理。",
        "translation": "He was deeply devoted to the principle.",
        "source": "T23n1442_033:0809b25_7"
    },
    {
        "source_sentence": "豈我不食自餓而死！」",
        "translation": "Isn't it because I didn't eat myself and die from hunger!",
        "source": "T23n1442_033:0809b26_8"
    },
    {
        "source_sentence": "少欲苾芻聞生嫌賤：「云何苾芻令苾芻尼教化飲食而受用耶？」",
        "translation": "When a monk with few desires hears, he becomes disgusted and says, How does a monk cause a monk or nun to teach and eat and drink for the benefit of a monk or nun?",
        "source": "T23n1442_033:0809b26_9"
    },
    {
        "source_sentence": "以此因緣具白世尊。",
        "translation": "Because of these causes and conditions, he told the Bhagavān.",
        "source": "T23n1442_033:0809b27_10"
    },
    {
        "source_sentence": "世尊乃至廣為問答，「為制學處，應如是說：「若復苾芻知苾芻尼讚歎因緣得食，食者，波逸底迦。」",
        "translation": "The Bhagavān even asked and answered in detail, In order to regulate the place of training, he should thus explain, Suppose another monk knows that a monk or nun praises the causes and conditions for obtaining food, and he eats it, pratyekabuddha.",
        "source": "T23n1442_033:0809b28_11"
    },
    {
        "source_sentence": "如是世尊為諸苾芻制學處已。",
        "translation": "Thus, the Bhagavān has established a place of training for the monks.",
        "source": "T23n1442_033:0809c02_12"
    },
    {
        "source_sentence": "室羅伐城有一長者，為二種業：一、謂興易，二、謂營農。",
        "translation": "In the city of Śrāvastī there was an elderly man who did two kinds of work: 1. producing and selling, and 2. farming.",
        "source": "T23n1442_033:0809c02_13"
    },
    {
        "source_sentence": "於曠野中耕地既訖下糠麥種，即於田處葺作小廬，復持錢財餘處興易。",
        "translation": "After he had finished plowing the land in the wilderness and planted rice and wheat, he built a small dwelling at the site of the field and then took his money and possessions to live elsewhere.",
        "source": "T23n1442_033:0809c04_14"
    },
    {
        "source_sentence": "時有乞食苾芻，人間遊行至室羅伐。",
        "translation": "A monk who was begging for food then traveled among the people to Śrāvastī.",
        "source": "T23n1442_033:0809c05_15"
    },
    {
        "source_sentence": "出城觀望見彼小廬，作如是念：「此處閑靜堪為止宿。」",
        "translation": "When he left the city and looked around, he saw that small hut and thought, This place is quiet enough to spend the night.",
        "source": "T23n1442_033:0809c06_16"
    },
    {
        "source_sentence": "即便每日入城乞食權停小盧，由人氣故諸餘鳥鹿不來侵損，復蒙時雨苗實極成。",
        "translation": "Even if he entered the city every day to solicit alms, he had the right to stop at a small place where other birds and deer didn't attack him because of his agitation, and then he was again subject to rain and seedlings that were extremely fruitful.",
        "source": "T23n1442_033:0809c07_17"
    },
    {
        "source_sentence": "時彼長者他處經求安隱得至，藏舉貨物，洗浴食已告其婦曰：「我於先時於某處田中下糠麥種，遂出經求。",
        "translation": "The elder then went to another place to search for the sūtras and obtain peace, stored his goods, washed, bathed, and ate, and told his wife, “Formerly, I planted rice and wheat in a certain field in a certain place, so I came out to search for the sūtras.",
        "source": "T23n1442_033:0809c09_18"
    },
    {
        "source_sentence": "不知今時可得種不？」",
        "translation": "Don't you know if you can plant seeds at the present time?",
        "source": "T23n1442_033:0809c11_19"
    },
    {
        "source_sentence": "遂往田中見苗實成熟，便作是念：「我所種苗不作籬柵，亦不使人而為守護。",
        "translation": "He went to the fields and saw that the crops were really ripe, so he thought, My seedlings aren't made into hedges or fences, and I won't let people guard them.",
        "source": "T23n1442_033:0809c12_20"
    },
    {
        "source_sentence": "何故今時非意成熟？」",
        "translation": "Why isn't it the ripening of mind at the present time?",
        "source": "T23n1442_033:0809c14_21"
    },
    {
        "source_sentence": "即便按行，見有人跡，尋蹤而去至舊草廬，窺戶內觀見乞食者加趺端坐宴默禪思。",
        "translation": "He went to the old hermitage. Looking inside the door, he saw that the beggar was sitting cross-legged in meditation in quietude and contemplation.",
        "source": "T23n1442_033:0809c14_22"
    },
    {
        "source_sentence": "長者便念：「我田得成由此人力。」",
        "translation": "The elder then thought, My field will be made up of this man.",
        "source": "T23n1442_033:0809c16_23"
    },
    {
        "source_sentence": "遂前問曰：「聖者！",
        "translation": "He then went forward and asked, Sage!",
        "source": "T23n1442_033:0809c17_24"
    },
    {
        "source_sentence": "住斯？」",
        "translation": "Abiding here?",
        "source": "T23n1442_033:0809c17_25"
    },
    {
        "source_sentence": "答言：「如是。」",
        "translation": "He replied, So it is.",
        "source": "T23n1442_033:0809c17_26"
    },
    {
        "source_sentence": "長者告言：「聖者！",
        "translation": "The elder told him, Sage!",
        "source": "T23n1442_033:0809c17_27"
    },
    {
        "source_sentence": "此是我田，幸可依住。",
        "translation": "This is my field, so fortunately I can rely on it.",
        "source": "T23n1442_033:0809c18_28"
    },
    {
        "source_sentence": "若須花葉及齒木者，隨意當取，明就我家為受踈供。」",
        "translation": "If you need flowers, leaves, teeth, and wood for your teeth, take them as you wish, explaining that you'll go to my house to make a humble offering.",
        "source": "T23n1442_033:0809c18_29"
    },
    {
        "source_sentence": "苾芻報曰：「我是乞食人不受他請。」",
        "translation": "The monk replied, I'm a beggar who won't accept someone else's invitation.",
        "source": "T23n1442_033:0809c19_30"
    },
    {
        "source_sentence": "便不相許。",
        "translation": "They then won't allow each other.",
        "source": "T23n1442_033:0809c20_31"
    },
    {
        "source_sentence": "時彼長者禮足而去，既至家已報婦曰：「賢首！",
        "translation": "The elder then bowed his feet and departed, and when he arrived home, he reported to the woman, Good man!",
        "source": "T23n1442_033:0809c20_32"
    },
    {
        "source_sentence": "應料理倉庫，田麥極成。」",
        "translation": "You should prepare a storehouse, and the fields and wheat will be perfectly formed.",
        "source": "T23n1442_033:0809c21_33"
    },
    {
        "source_sentence": "婦曰：「仁誑我耶？」",
        "translation": "The woman said, Are you kind and compassionate to me?",
        "source": "T23n1442_033:0809c22_34"
    },
    {
        "source_sentence": "夫曰：「我先下種不安籬柵，亦不使人而為守護，今極成熟。",
        "translation": "He said, “I formerly planted an unsealed hedge and did not allow anyone to guard it. It is now extremely mature.",
        "source": "T23n1442_033:0809c22_35"
    },
    {
        "source_sentence": "何事相誑？",
        "translation": "What are the characteristics of things that are gross?",
        "source": "T23n1442_033:0809c24_36"
    },
    {
        "source_sentence": "汝勿致疑！」",
        "translation": "Don't doubt it!",
        "source": "T23n1442_033:0809c24_37"
    },
    {
        "source_sentence": "婦問其故，答曰：「我於田邊造一草室，有乞食者於彼居停，由其力故苗實成熟。」",
        "translation": "The woman asked him why, and he answered, I built a grass dwelling at the edge of a field, and there were beggars living there because of their power to ripen the seedlings.",
        "source": "T23n1442_033:0809c24_38"
    },
    {
        "source_sentence": "婦曰：「若如是者，何不請來就舍受食？」",
        "translation": "The woman said, If that's the case, why don't you invite them to come to the house and accept food?",
        "source": "T23n1442_033:0809c26_39"
    },
    {
        "source_sentence": "答曰：「我已言請，彼不肯受。",
        "translation": "He replied, I've already told them to ask, but they won't accept it.",
        "source": "T23n1442_033:0809c27_40"
    },
    {
        "source_sentence": "自云：『我是乞食之人，不受他請。』」",
        "translation": "They say, 'I'm a beggar and won't accept another's invitation.'",
        "source": "T23n1442_033:0809c27_41"
    },
    {
        "source_sentence": "婦曰：「彼乞食者，日歷百家乞求辛苦，方能滿腹。",
        "translation": "The woman said, That beggar goes to hundreds of houses every day to beg for food and only then can he satisfy his belly.",
        "source": "T23n1442_033:0809c28_42"
    },
    {
        "source_sentence": "仁不慇懃，所以不受。",
        "translation": "Because you're kind and not angry, you won't accept it.",
        "source": "T23n1442_033:0809c29_43"
    },
    {
        "source_sentence": "宜可更去，苦相邀屈，必應為受。」",
        "translation": "It's advisable to go again, and if you're invited by suffering, you should surely accept it.",
        "source": "T23n1442_033:0810a01_0"
    },
    {
        "source_sentence": "時彼長者聞婦勸已，遂便復去，至已禮足白言：「聖者！",
        "translation": "After hearing the woman's advice, the elder then departed again and after bowed his head at her feet, he said, Sage!",
        "source": "T23n1442_033:0810a01_1"
    },
    {
        "source_sentence": "幸願慈悲，明當就宅，受我微供。」",
        "translation": "May you have mercy and compassion, so that you'll go to your house tomorrow and receive my humble offerings.",
        "source": "T23n1442_033:0810a02_2"
    },
    {
        "source_sentence": "苾芻報曰：「長者我是乞食人，不受他請。」",
        "translation": "The monk replied, Sir, I'm a beggar, and I won't accept someone else's invitation.",
        "source": "T23n1442_033:0810a03_3"
    },
    {
        "source_sentence": "長者報曰：「願當降意，明至我家，略受疎食，勿違所請。」",
        "translation": "The elder replied, May I please subdue my mind and explain that I'll go to my house for a short time to receive food from the hermit so as not to disobey your invitation?",
        "source": "T23n1442_033:0810a04_4"
    },
    {
        "source_sentence": "時乞食人見彼長者慇懃不已，遂默然受。",
        "translation": "Seeing the elder's anger, the beggar then remained silent and accepted it.",
        "source": "T23n1442_033:0810a05_5"
    },
    {
        "source_sentence": "長者見受禮足而去，既至舍已告其婦曰：「賢首！",
        "translation": "Seeing him, the elder paid his respects and departed. When he arrived at the house, he told his wife, Good man!",
        "source": "T23n1442_033:0810a06_6"
    },
    {
        "source_sentence": "乞食苾芻已受我請，明日許來，應可為辦上妙飲食。」",
        "translation": "After accepting my invitation, the begging monk will allow me to come tomorrow, so you should prepare a wonderful food and drink for him.",
        "source": "T23n1442_033:0810a07_7"
    },
    {
        "source_sentence": "其婦聞已即便備辦，堪冷食者今日預為，須熱食者明日營作。",
        "translation": "When the woman heard this, she made preparations for it. Those who were able to eat a cold food would prepare it today and those who needed hot food would prepare it tomorrow.",
        "source": "T23n1442_033:0810a08_8"
    },
    {
        "source_sentence": "是時有餘乞食苾芻來至田中草室之內，喚乞食者曰：「可來共行。」",
        "translation": "Some other beggar monks then came to the grass room in the field and called the beggar, Come and walk together.",
        "source": "T23n1442_033:0810a10_9"
    },
    {
        "source_sentence": "乞食報曰：「有別長者來請我食，時至當赴，不及相隨。」",
        "translation": "The beggar replied, Some other elderly man came to invite me to eat, and when he arrived, he didn't have time to go along with him.",
        "source": "T23n1442_033:0810a11_10"
    },
    {
        "source_sentence": "餘乞食者作如是語：「汝大福德能獲利養，為物受請，時至當行。」",
        "translation": "The other beggars said, You're greatly blessed and capable of benefiting others, so you'll accept the invitation for something when it comes time to do so.",
        "source": "T23n1442_033:0810a12_11"
    },
    {
        "source_sentence": "爾時吐羅難陀苾芻尼，於日初分著衣持鉢入城乞食，巡次至彼設供之家，便入其舍，見長者婦報言：「妙相！",
        "translation": "It was then that the Tūrananda monks and nuns gathered their robes, bowls, and bowls for the first part of the day and entered the city to solicit alms.",
        "source": "T23n1442_033:0810a14_12"
    },
    {
        "source_sentence": "願汝無病長壽，當施我食。」",
        "translation": "May you have no illness and long life, give me food.",
        "source": "T23n1442_033:0810a16_13"
    },
    {
        "source_sentence": "婦人答曰：「聖者！",
        "translation": "The woman replied, Sage!",
        "source": "T23n1442_033:0810a17_14"
    },
    {
        "source_sentence": "且去我有憂愁，無容授食。」",
        "translation": "Go away, for I'm sad and have no room to give food.",
        "source": "T23n1442_033:0810a17_15"
    },
    {
        "source_sentence": "問曰：「何憂？」",
        "translation": "He asked, What's the grief?",
        "source": "T23n1442_033:0810a18_16"
    },
    {
        "source_sentence": "答曰：「請乞食者許來就舍，今既不至恐其絕食，是故壞憂。」",
        "translation": "He answered, A beggar who asks for food will be allowed to come and go to his dwelling, but now that he won't go there, I'm afraid he won't eat it; therefore, my sorrow will break down.",
        "source": "T23n1442_033:0810a18_17"
    },
    {
        "source_sentence": "尼便報曰：「我若喚來，與我食不？」",
        "translation": "The nun then replied, If I summon you, will you give me food?",
        "source": "T23n1442_033:0810a19_18"
    },
    {
        "source_sentence": "報言：「與食。」",
        "translation": "He replied, Give me food.",
        "source": "T23n1442_033:0810a20_19"
    },
    {
        "source_sentence": "尼曰：「我雖蒙食，其伴如何？」",
        "translation": "The nun said, Even though I've been given food, what about my companions?",
        "source": "T23n1442_033:0810a20_20"
    },
    {
        "source_sentence": "報言：「亦與。」",
        "translation": "He replied, I'll give it to you, too.",
        "source": "T23n1442_033:0810a21_21"
    },
    {
        "source_sentence": "「守寺之尼誰當與食？」",
        "translation": "Who will give food to the nun who guards the temple?",
        "source": "T23n1442_033:0810a21_22"
    },
    {
        "source_sentence": "報言：「亦與。」",
        "translation": "He replied, I'll give it to you, too.",
        "source": "T23n1442_033:0810a22_23"
    },
    {
        "source_sentence": "吐羅難陀便作是念：「入城乞人今皆欲出，新來入者即是其人。」",
        "translation": "Tūrananda then had this thought, The beggars who enter the city now all want to leave, and those who newly enter are their own people.",
        "source": "T23n1442_033:0810a22_24"
    },
    {
        "source_sentence": "尼往城門遙望而住。",
        "translation": "The nun went to the city gate and stayed there from a distance.",
        "source": "T23n1442_033:0810a23_25"
    },
    {
        "source_sentence": "其乞食者作如是念：「我既受請，不為乞食且修善品，時至當行。」",
        "translation": "The beggar thinks, Since I've accepted the invitation, I won't beg for food and cultivate good qualities; I will do so when the time comes.",
        "source": "T23n1442_033:0810a24_26"
    },
    {
        "source_sentence": "看時欲至，著衣持鉢往赴城中。",
        "translation": "When he was about to arrive, he put on his robes, took his bowl, and went into the city.",
        "source": "T23n1442_033:0810a25_27"
    },
    {
        "source_sentence": "時吐羅難陀見而便念：「此之來者是受請人。」",
        "translation": "Seeing this, Tūrananda thought, This is the person who's invited.",
        "source": "T23n1442_033:0810a26_28"
    },
    {
        "source_sentence": "即前問曰：「聖者！",
        "translation": "He then asked, Sage!",
        "source": "T23n1442_033:0810a27_29"
    },
    {
        "source_sentence": "於某甲舍受其請耶？」",
        "translation": "Did you accept his invitation in a certain house?",
        "source": "T23n1442_033:0810a27_30"
    },
    {
        "source_sentence": "答言：「爾。」",
        "translation": "He replied, Yes.",
        "source": "T23n1442_033:0810a28_31"
    },
    {
        "source_sentence": "尼曰：「我於彼家已相讚歎。」",
        "translation": "The nun said, I've praised each other at their house.",
        "source": "T23n1442_033:0810a28_32"
    },
    {
        "source_sentence": "報言：「姊妹！",
        "translation": "He replied, Sister!",
        "source": "T23n1442_033:0810a28_33"
    },
    {
        "source_sentence": "我先令汝相讚歎耶？」",
        "translation": "Did I first cause you to praise each other?",
        "source": "T23n1442_033:0810a29_34"
    },
    {
        "source_sentence": "便作是念：「如世尊說：『若苾芻尼讚歎得食，即不應食。』",
        "translation": "He then had this thought, As the Bhagavān said, 'If a monk or nun praises food obtained, he or she shouldn't eat it.'",
        "source": "T23n1442_033:0810a29_35"
    },
    {
        "source_sentence": "我今寧可忍飢絕食，不緣此故而犯其罪。」",
        "translation": "Now, I'd rather tolerate hunger and starvation than commit a sin for this reason.",
        "source": "T23n1442_033:0810b01_36"
    },
    {
        "source_sentence": "即欲回還。",
        "translation": "He then wanted to return.",
        "source": "T23n1442_033:0810b02_37"
    },
    {
        "source_sentence": "吐羅難陀見其欲去，報言：「聖者！",
        "translation": "Seeing him wanting to leave, Tūrananda replied, Sage!",
        "source": "T23n1442_033:0810b03_0"
    },
    {
        "source_sentence": "我不知仁名字氏族，云何輒爾共相讚歎？」",
        "translation": "I don't know the names of your clansmen, so why would you praise each other?",
        "source": "T23n1442_033:0810b03_1"
    },
    {
        "source_sentence": "時乞食者報言：「姊妹！",
        "translation": "The beggar then replied, Sister!",
        "source": "T23n1442_033:0810b04_2"
    },
    {
        "source_sentence": "若先是實，後便妄語；",
        "translation": "If it were real first, it would later be a false statement.",
        "source": "T23n1442_033:0810b05_3"
    },
    {
        "source_sentence": "若後是實，前言是虛。」",
        "translation": "If the latter is real, the former says it's false.",
        "source": "T23n1442_033:0810b05_4"
    },
    {
        "source_sentence": "說是語已遂還本處。",
        "translation": "After he said these words, he returned to his original place.",
        "source": "T23n1442_033:0810b06_5"
    },
    {
        "source_sentence": "尼極羞恥，便行乞食。",
        "translation": "Being greatly embarrassed, the nun then went begging for food.",
        "source": "T23n1442_033:0810b06_6"
    },
    {
        "source_sentence": "時彼苾芻還歸草室，乃至食力未盡已來修諸善品，食力消已遂便倚臥。",
        "translation": "That monk then returned to the hermitage and cultivated good qualities since he hadn't exhausted his power of eating, and when his power of eating dissipated, he reclined.",
        "source": "T23n1442_033:0810b07_7"
    },
    {
        "source_sentence": "餘乞食者來問之曰：「食是他物，腹豈他耶？」",
        "translation": "The other beggars came to him and asked, What's the food that's another thing, isn't it something else in your belly?",
        "source": "T23n1442_033:0810b08_8"
    },
    {
        "source_sentence": "答曰：「我何所作？」",
        "translation": "He replied, What will I do?",
        "source": "T23n1442_033:0810b09_9"
    },
    {
        "source_sentence": "報曰：「多貪飽食，遂使不能修諸善品。」",
        "translation": "He replied, They're so greedy with food that they can't cultivate good qualities.",
        "source": "T23n1442_033:0810b10_0"
    },
    {
        "source_sentence": "問：「誰貪飽食？」",
        "translation": "He asked, Who craves food?",
        "source": "T23n1442_033:0810b10_1"
    },
    {
        "source_sentence": "答曰：「汝是多貪。」",
        "translation": "He replied, You're greedy.",
        "source": "T23n1442_033:0810b11_2"
    },
    {
        "source_sentence": "報曰：「我不曾食。」",
        "translation": "He replied, I've never eaten.",
        "source": "T23n1442_033:0810b11_3"
    },
    {
        "source_sentence": "問曰：「有何因緣？」",
        "translation": "He asked, What are the causes and conditions?",
        "source": "T23n1442_033:0810b11_4"
    },
    {
        "source_sentence": "時乞食者具以其事白諸苾芻，諸苾芻以緣白佛。",
        "translation": "The beggar then told the monks about this, and the monks told the Buddha about it as a condition.",
        "source": "T23n1442_033:0810b12_5"
    },
    {
        "source_sentence": "佛言：「除施主先有意受，食無犯。」",
        "translation": "The Buddha said, Except for the donor who had previously intended to accept it, it's not a violation to eat food.",
        "source": "T23n1442_033:0810b13_6"
    },
    {
        "source_sentence": "爾時世尊讚歎持戒呵破戒者，告諸苾芻曰：「前是創制，此是隨開。",
        "translation": "It was then that the Bhagavān praised those who observed the precepts and disparaged those who violated them, telling the monks, Formerly, this was a creation, but this is a follow-on.",
        "source": "T23n1442_033:0810b14_0"
    },
    {
        "source_sentence": "為諸苾芻制其學處，應如是說：若復苾芻知苾芻尼讚歎因緣得食食，除施主先有意，波逸底迦。」",
        "translation": "If a monk knows that a monk or nun praises the causes and conditions for obtaining food, except for the donor's prior intention, pratyekabuddha.",
        "source": "T23n1442_033:0810b15_1"
    },
    {
        "source_sentence": "若復苾芻者，謂是六眾，餘義如上。",
        "translation": "If another monk refers to the six congregations, the rest are as above.",
        "source": "T23n1442_033:0810b18_0"
    },
    {
        "source_sentence": "苾芻尼者，謂吐羅難陀。",
        "translation": "A bhikṣuṇī is a Tūrananda.",
        "source": "T23n1442_033:0810b18_1"
    },
    {
        "source_sentence": "讚歎者有其二種：一、讚歎持戒，二、讚歎多聞。",
        "translation": "There are two kinds of praise: 1. praising observance of precepts and 2. praising well-versedness.",
        "source": "T23n1442_033:0810b19_2"
    },
    {
        "source_sentence": "食有二種，已如上說。",
        "translation": "Eating is of two kinds: as has been said above.",
        "source": "T23n1442_033:0810b20_3"
    },
    {
        "source_sentence": "食者，謂吞咽也。",
        "translation": "Eating refers to swallowing.",
        "source": "T23n1442_033:0810b20_4"
    },
    {
        "source_sentence": "除施主先有意者，若施主先有心請此苾芻。",
        "translation": "If the donor first has a mind to invite this monk, except for someone who previously had an intention to do so.",
        "source": "T23n1442_033:0810b21_5"
    },
    {
        "source_sentence": "設令讚歎食之無犯。",
        "translation": "It's not a violation to praise and venerate someone who eats it.",
        "source": "T23n1442_033:0810b22_6"
    },
    {
        "source_sentence": "此中犯相其事云何？",
        "translation": "What's the matter with this offense?",
        "source": "T23n1442_033:0810b22_7"
    },
    {
        "source_sentence": "如有眾多苾芻受俗家請，若苾芻尼先往其舍作如是語：「仁等設供請何苾芻？」",
        "translation": "Suppose there are many monks who have been invited by a layman's family, and if a monk or nun first goes to their house and says, Sir, what monk would you like to make an offering?",
        "source": "T23n1442_033:0810b23_8"
    },
    {
        "source_sentence": "報言：「某甲。」",
        "translation": "He replied, So-and-so.",
        "source": "T23n1442_033:0810b24_9"
    },
    {
        "source_sentence": "尼曰：「欲行何麨？」",
        "translation": "The nun said, What do you want to do?",
        "source": "T23n1442_033:0810b25_10"
    },
    {
        "source_sentence": "施主報曰：「欲行麁麨。」",
        "translation": "The donor replied, I want to practice sexual misconduct.",
        "source": "T23n1442_033:0810b25_11"
    },
    {
        "source_sentence": "尼曰：「應與細麨。」",
        "translation": "The nun said, You should give it to the fine-minded.",
        "source": "T23n1442_033:0810b25_12"
    },
    {
        "source_sentence": "彼苾芻或有證得預流果者，或得一來果者，或得不還果者，或有證得阿羅漢果者，尼曰：「欲行何酥？」",
        "translation": "Some of those monks may realize the fruit of pre-flow, some attain the fruit of once-returning, some attain the fruit of nonreturning, or some attain the fruit of arhatship, and the nuns say, What kind of butter do you want to practice?",
        "source": "T23n1442_033:0810b26_13"
    },
    {
        "source_sentence": "報曰：「羊酥。」",
        "translation": "He replied, Sheep's butter.",
        "source": "T23n1442_033:0810b28_14"
    },
    {
        "source_sentence": "尼曰：「應與牛酥，彼苾芻得四果故。」",
        "translation": "The nun said, You should give it to the cow butter because that monk will attain four fruits.",
        "source": "T23n1442_033:0810b28_15"
    },
    {
        "source_sentence": "尼曰：「欲行何鹽？」",
        "translation": "The nun said, What salt do you want to practice?",
        "source": "T23n1442_033:0810b29_16"
    },
    {
        "source_sentence": "報言：「醎鹽。」",
        "translation": "He replied, It's called salty salt.",
        "source": "T23n1442_033:0810b29_17"
    },
    {
        "source_sentence": "尼曰：「應與石鹽，彼苾芻得四果故。」",
        "translation": "The nun said, You should give rock salt to that monk because he'll attain four fruits.",
        "source": "T23n1442_033:0810c01_18"
    },
    {
        "source_sentence": "若行醋漿應與酪漿，乃至諸菜餅果悉皆勸與勝上好者，欲與非時沙糖漿，尼曰：「應與石蜜漿。」",
        "translation": "If he practices vinegar and juice, he should give it to those who are encouraged to give superior goodness, and if he wants to give sugary juice at an ungodly hour, the nun says, You should give rock honey and juice.",
        "source": "T23n1442_033:0810c01_19"
    },
    {
        "source_sentence": "欲與粟米飯，尼曰：「應與粳米飯。」",
        "translation": "When he wanted to give rice and millet, the nun said, You should give rice and millet.",
        "source": "T23n1442_033:0810c04_20"
    },
    {
        "source_sentence": "欲與菜羹，尼曰：「應與肉羹，彼苾芻得四果故。」",
        "translation": "When he wanted to give meat gruel, the nun said, You should give meat gruel because that monk got four fruits.",
        "source": "T23n1442_033:0810c04_21"
    },
    {
        "source_sentence": "若諸苾芻，知苾芻尼見彼施主行麁食時勸讚行好，讚彼苾芻獲得勝果。",
        "translation": "If monks and nuns know that a monk or nun who sees the donor's offering of food and drink encourages good conduct, praising that monk or nun for attaining superior results.",
        "source": "T23n1442_033:0810c05_22"
    },
    {
        "source_sentence": "若苾芻知如是虛相讚歎，食其食者，皆得波逸底迦。",
        "translation": "If a monk knows such a false praise and eats it, they'll all attain pratyekabuddha.",
        "source": "T23n1442_033:0810c07_23"
    },
    {
        "source_sentence": "若苾芻尼讚歎苾芻，云持三藏應與好食者，得惡作罪。",
        "translation": "If a bhikṣuṇī praises a bhikṣu and says that he maintains the Tripiṭaka and should give good food, he or she will be guilty of misdeeds.",
        "source": "T23n1442_033:0810c08_24"
    },
    {
        "source_sentence": "若苾芻實得諸果，實解三藏，尼雖讚歎食之無犯。",
        "translation": "If a monk really obtains the fruits and really understands the Tripiṭaka, it's not a violation for a nun to praise and eat them even though he praises them.",
        "source": "T23n1442_033:0810c09_25"
    },
    {
        "source_sentence": "又無犯者，謂最初犯人，或癡狂、心亂、痛惱所纏。",
        "translation": "Also, there's no offense because the first offender is sometimes tethered by delusion, mental disturbance, or pain.",
        "source": "T23n1442_033:0810c11_0"
    },
    {
        "source_sentence": "根本說一切有部毘奈耶卷第三十三",
        "translation": "Mūlasarvâstivāda-vinaya, vol. 33",
        "source": "T23n1442_033:0810c13_0"
    }
]