[
    {
        "source_sentence": "鼻奈耶卷第八",
        "translation": "(Skt. vinaya), vol. 8",
        "source": "T24n1464_008:0884c02_0"
    },
    {
        "source_sentence": "姚秦涼州沙門竺佛念譯",
        "translation": "Yaoqin Liangzhou shaman Zhu Fonian's translation",
        "source": "T24n1464_008:0884c04_0"
    },
    {
        "source_sentence": "波逸提法之二",
        "translation": "two of the dharmas of pratyekabuddha",
        "source": "T24n1464_008:0884c05_0"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_008:0884c06_0"
    },
    {
        "source_sentence": "爾時世尊未結過中食戒。",
        "translation": "At the time, the Bhagavān hadn't yet formed the precept against eating midday.",
        "source": "T24n1464_008:0884c06_1"
    },
    {
        "source_sentence": "尊者迦留陀夷日下晡，著衣持鉢入舍衛殯陀跋陀。",
        "translation": "Venerable Kālôdayin descended to the sun, put on his robe and bowl, and entered Śrāvastī-gṛhapāda.",
        "source": "T24n1464_008:0884c07_2"
    },
    {
        "source_sentence": "天陰夜黑厚雲，掣電霹靂光亘然明。",
        "translation": "The celestial shade of the night is a thick cloud of darkness, and the lightning bolt shines brightly.",
        "source": "T24n1464_008:0884c08_3"
    },
    {
        "source_sentence": "有一妊娠婦女出外汲水，尊者迦留陀夷至門欲入分衛，電光中見迦留陀夷，大驚怖懼，便失聲言：「毘舍支(毘舍支鬼也)。」",
        "translation": "When a pregnant woman came out to draw water, Venerable Kālôdayin arrived at the door and wanted to enter the part of the guards' quarters. Seeing Kālôdayin in the lightning, he was greatly frightened and lost his voice, saying, Vaiśālī (also known as Vaiśālī).",
        "source": "T24n1464_008:0884c09_4"
    },
    {
        "source_sentence": "迦留陀夷答：「我是沙門，非鬼。」",
        "translation": "Kālôdayin replied, I'm an ascetic, not a ghost.",
        "source": "T24n1464_008:0884c12_5"
    },
    {
        "source_sentence": "婦人答：「若沙門者，不殺汝父、不害汝母，而墮我娠。」",
        "translation": "The woman answered, Suppose an ascetic doesn't kill your father or harm your mother and falls into my pregnancy.",
        "source": "T24n1464_008:0884c12_6"
    },
    {
        "source_sentence": "時此婦人往語十二法比丘，十二法比丘往白世尊。",
        "translation": "The woman then went to speak to the twelve monks of the Dharma, and the twelve monks of the Dharma went to the Bhagavān.",
        "source": "T24n1464_008:0884c13_7"
    },
    {
        "source_sentence": "世尊告曰：「若比丘日過中食者，墮。」",
        "translation": "The Bhagavān told him, If a monk goes to eat midday every day, he'll fall.",
        "source": "T24n1464_008:0884c15_0"
    },
    {
        "source_sentence": "時尊者婆特婆梨聞世尊結過中食戒，便作是語：「二食中最好最妙無過暮食，而沙門瞿曇斷我此食。」",
        "translation": "When Venerable Bhadrika heard that the Bhagavān had formed the precept against eating midday, he said, Of the two kinds of food, the best and most wonderful one is to eat at night, but the ascetic Gautama cut off this food for me.",
        "source": "T24n1464_008:0884c15_1"
    },
    {
        "source_sentence": "諸比丘聞，往白世尊。",
        "translation": "The monks heard it and went to the Bhagavān.",
        "source": "T24n1464_008:0884c18_2"
    },
    {
        "source_sentence": "世尊告曰：「此著味來日久，不但今日。",
        "translation": "The World-honored One said: Not only today, but also for a long time since I have been attached to this food.",
        "source": "T24n1464_008:0884c18_3"
    },
    {
        "source_sentence": "聽我說。",
        "translation": "Listen to me as I explain.",
        "source": "T24n1464_008:0884c19_4"
    },
    {
        "source_sentence": "往昔無數劫時，劫盡天地融爛。",
        "translation": "In the past, when there were countless eons in the past, an eon ended and heaven and earth melted away.",
        "source": "T24n1464_008:0884c19_5"
    },
    {
        "source_sentence": "後此地有肥甚甘美肥，如弱石蜜。",
        "translation": "Later, there's plenty of fat in this place that's very sweet and rich like weak rock honey.",
        "source": "T24n1464_008:0884c20_6"
    },
    {
        "source_sentence": "有一阿婆最羅天子來下此地，以指甞地肥甚甘美，意愛樂憙還上天上，語諸天子，將諸天子來下，教使甞此地肥。",
        "translation": "An abhidharma deity came down to this place and pointed at the thickness of the earth with his fingers, which was very sweet and tasty. Desiring to eat it, he returned up to heaven. He said to the deities, “Come down!” and told them to eat the thickness of the earth.",
        "source": "T24n1464_008:0884c21_7"
    },
    {
        "source_sentence": "至三日，身重不復能飛。",
        "translation": "On the third day his body weighed heavier and he could not fly again.",
        "source": "T24n1464_008:0884c23_8"
    },
    {
        "source_sentence": "地肥漸沒，地生鹵土曝。",
        "translation": "The fertility of the soil gradually disappeared, and the soil gave rise to salty soil.",
        "source": "T24n1464_008:0884c24_9"
    },
    {
        "source_sentence": "後漸自然粳米出而食之。",
        "translation": "Later, he gradually and naturally produced millet and ate it.",
        "source": "T24n1464_008:0884c24_10"
    },
    {
        "source_sentence": "爾時此人亦著味，今復著味。」",
        "translation": "At the time, this person was also attached to taste, but now they're also attached to taste.",
        "source": "T24n1464_008:0884c25_11"
    },
    {
        "source_sentence": "佛遊舍衛國祇樹給孤獨園。",
        "translation": "The Buddha traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_008:0884c26_0"
    },
    {
        "source_sentence": "尊者畢陵淚跋昔患目痛，諸長者婆羅門送酥油蜜黑石蜜及諸生食，諸弟子常停食經宿而食。",
        "translation": "Venerable Pilinda, weeping and suffering from vision pain in the past, the elders and brāhmaṇas offered ghee, honey, black rock honey, and raw food to the disciples, who always stopped eating and ate for the night.",
        "source": "T24n1464_008:0884c26_1"
    },
    {
        "source_sentence": "時十二法比丘見，往白世尊。",
        "translation": "When the twelve Dharma monks saw him, they went to the Bhagavān.",
        "source": "T24n1464_008:0884c28_2"
    },
    {
        "source_sentence": "世尊告曰：「若比丘無病，停食經宿而食者，墮。」",
        "translation": "The Bhagavān told him, If a monk isn't ill and stops eating after the night has passed and eats it, he'll fall.",
        "source": "T24n1464_008:0884c29_3"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_008:0885a02_0"
    },
    {
        "source_sentence": "時六群比丘不受水、不受食而食。",
        "translation": "The six groups of monks then ate without accepting water or food.",
        "source": "T24n1464_008:0885a02_1"
    },
    {
        "source_sentence": "十二法比丘見，往白世尊。",
        "translation": "Seeing this, the twelve-dharma monks went to the Bhagavān.",
        "source": "T24n1464_008:0885a03_2"
    },
    {
        "source_sentence": "世尊告曰：「若比丘不受水、不受食而食投面門，除其水、楊枝者，墮。」",
        "translation": "The Bhagavān told him, If a monk doesn't accept water or food and eats it and throws it to his face, except for water and poplar branches, he'll fall.",
        "source": "T24n1464_008:0885a04_3"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_008:0885a06_0"
    },
    {
        "source_sentence": "時六群比丘所至村落，見酪乳酥魚肉脯輒乞自入。",
        "translation": "When the six groups of monks arrived at the village, they saw cream, milk, butter, fish, and meat being dried and begged to enter on their own.",
        "source": "T24n1464_008:0885a06_1"
    },
    {
        "source_sentence": "諸長者見，自相謂言：「此沙門釋子太乞魚脯用為？」",
        "translation": "Seeing them, the elders said to each other, Is this ascetic or Śākyamuni who asks for a fish container?",
        "source": "T24n1464_008:0885a08_0"
    },
    {
        "source_sentence": "往白十二法比丘，十二法比丘往白世尊。",
        "translation": "He went to tell the twelve monks of the Dharma, and the twelve monks of the Dharma went to tell the Bhagavān.",
        "source": "T24n1464_008:0885a09_1"
    },
    {
        "source_sentence": "世尊集和合僧，備十功德，佛為沙門結戒：「若比丘知彼村落有好酥乳酪出魚肉脯，若比丘無病往彼乞者，波逸提。」",
        "translation": "The Bhagavān gathered the ten virtues to harmonize the saṃgha, and the Buddha formed the precepts for the ascetic, If a monk knows that there's good butter, milk, cheese, fish, meat, and dried milk in that village, and if a monk doesn't have illness and goes there to beg, pratyekabuddha.",
        "source": "T24n1464_008:0885a10_2"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_008:0885a13_0"
    },
    {
        "source_sentence": "爾時有二比丘住拘薩羅界深山中住，未曾見佛，常懷企望欲得見佛。",
        "translation": "At the time, there were two monks living deep in the mountains of the Kośala realm who hadn't seen the Buddha before and always wanted to see him.",
        "source": "T24n1464_008:0885a13_1"
    },
    {
        "source_sentence": "二人共議，便發進路來見世尊。",
        "translation": "The two men had a discussion together, so they came out to meet the Bhagavān on the road.",
        "source": "T24n1464_008:0885a15_2"
    },
    {
        "source_sentence": "時春後月極熱，野馬像水日以向中，值曠野中了無水漿，身體燋渴。",
        "translation": "In the month after spring, when it was extremely hot, the statue of a wild horse facing toward the middle with water and sunlight shining on it, he found that there was no water or juice in the wilderness and his body was hungry and thirsty.",
        "source": "T24n1464_008:0885a16_3"
    },
    {
        "source_sentence": "二人處處求水，值小潭水，水少虫多。",
        "translation": "Everywhere the two men searched for water, and they found a small pool of water with little water but plenty of worms.",
        "source": "T24n1464_008:0885a17_4"
    },
    {
        "source_sentence": "其一比丘語一比丘言：「飲此虫水，度此曠澤，得覲世尊。」",
        "translation": "One of those monks said to another monk, Drink this insect's water, cross this wild marsh, and get to see the Bhagavān.",
        "source": "T24n1464_008:0885a18_5"
    },
    {
        "source_sentence": "一比丘答言：「受世尊戒，云何當壞？」",
        "translation": "One monk answered, Accepting the Bhagavān's precepts, how will they be broken?",
        "source": "T24n1464_008:0885a19_6"
    },
    {
        "source_sentence": "時一人飲、一人不飲。",
        "translation": "One person then drank, and one person didn't drink.",
        "source": "T24n1464_008:0885a20_7"
    },
    {
        "source_sentence": "其不飲水者命終，生三十三天，著百寶冠來詣世尊，頭面禮足在一面住。",
        "translation": "Those who didn't drink water died and were born in the Trāyastriṃśa gods, wearing a hundred-jeweled crown, came to the Bhagavān, bowed their heads and feet, and stayed at one side.",
        "source": "T24n1464_008:0885a21_8"
    },
    {
        "source_sentence": "時世尊與說法，使得見諦。",
        "translation": "The Bhagavān then taught the Dharma to them so that they'll see the truth.",
        "source": "T24n1464_008:0885a22_9"
    },
    {
        "source_sentence": "其飲水者在後至，世尊遙見比丘來，脫憂多羅僧示黃金體：「汝為癡人，用觀是四大身為？",
        "translation": "When the water drinker arrived late, the Bhagavān saw the monk coming from a distance. He dismounted from his seat and showed him the golden body to the saṃgha: You're a foolish man, so why would you contemplate these four major bodies?",
        "source": "T24n1464_008:0885a23_10"
    },
    {
        "source_sentence": "純盛臭處。",
        "translation": "It's pure and full of smelly places.",
        "source": "T24n1464_008:0885a25_11"
    },
    {
        "source_sentence": "其見法者則見我身。」",
        "translation": "Those who see the Dharma then see my body.",
        "source": "T24n1464_008:0885a25_12"
    },
    {
        "source_sentence": "世尊告曰：「若比丘知雜虫水而取飲者，墮。」",
        "translation": "The Bhagavān told him, If a monk knows the water mixed with worms and takes it to drink it, he'll fall.",
        "source": "T24n1464_008:0885a26_13"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_008:0885a28_0"
    },
    {
        "source_sentence": "有一長者請佛及比丘僧，時六群比丘先前至飯食厨間止。",
        "translation": "An elderly man invited the Buddha and the monks, and then six groups of monks stopped at the kitchen for food and drink in front of him.",
        "source": "T24n1464_008:0885a28_1"
    },
    {
        "source_sentence": "諸長者見，自相謂言：「此沙門釋子先來是間，妨作飯食。」",
        "translation": "Seeing this, the elders said to each other, This ascetic or Śākyamuni had been here before and prevented me from making food.",
        "source": "T24n1464_008:0885b01_2"
    },
    {
        "source_sentence": "十二法比丘聞，往白世尊。",
        "translation": "When the twelve monks of the Dharma heard this, they went to the Bhagavān.",
        "source": "T24n1464_008:0885b02_3"
    },
    {
        "source_sentence": "世尊告曰：「若比丘先至請飯食家，坐若臥、弄小兒，墮。」",
        "translation": "The Bhagavān told him, Suppose a monk first goes to the house to invite food and drink, sits or lies down, plays with a small child, and falls down.",
        "source": "T24n1464_008:0885b02_4"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_008:0885b05_0"
    },
    {
        "source_sentence": "有一長者請比丘僧。",
        "translation": "An elderly man invited a monk to the saṃgha.",
        "source": "T24n1464_008:0885b05_1"
    },
    {
        "source_sentence": "長者出行不在，長者婦獨在後作食。",
        "translation": "The elder's traveling isn't here, and the elder's wife is alone behind him to make food.",
        "source": "T24n1464_008:0885b06_2"
    },
    {
        "source_sentence": "時尊者迦留陀夷先至長者家坐。",
        "translation": "Venerable Kālôdayin then went to the elder's house and sat down.",
        "source": "T24n1464_008:0885b07_3"
    },
    {
        "source_sentence": "諸長者見，自相謂言：「云何比丘釋子獨與婦人一處坐？」",
        "translation": "Seeing them, the elders said to each other, How did the monks and Śākyamunis sit alone with their wives in one place?",
        "source": "T24n1464_008:0885b07_4"
    },
    {
        "source_sentence": "十二法比丘往白世尊。",
        "translation": "The twelve monks of the Dharma went to the Bhagavān.",
        "source": "T24n1464_008:0885b09_5"
    },
    {
        "source_sentence": "世尊告曰：「若比丘先至請食家與婦人獨處坐者，墮。」",
        "translation": "The Bhagavān told them, If a monk goes to the house of food and invites a woman to sit alone with him, he'll fall into it.",
        "source": "T24n1464_008:0885b09_6"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園，與大比丘僧五百人俱。",
        "translation": "Bhagavān Buddha traveled to the Anāthapiṇḍada Park in Jeta Grove in Śrāvastī accompanied by five hundred great bhikṣus and monks.",
        "source": "T24n1464_008:0885b11_0"
    },
    {
        "source_sentence": "爾時鞞羅然村有婆羅門名阿耆達兜，大富饒，錢財田業成就。",
        "translation": "At the time, there was a Brāhmaṇa named Agnidatta in the village of Rājagṛha who was very wealthy and accomplished in money, possessions, land, and business.",
        "source": "T24n1464_008:0885b12_1"
    },
    {
        "source_sentence": "時來至舍衛住一長者家，語長者言：「卿此間頗有沙門婆羅門聰明智慧，將諸徒眾，眾中人師者不？",
        "translation": "When he arrived at Sāvatthī, he stayed at the house of an elder and said to the elder, Do you have a śramaṇa or brāhmaṇa here who's intelligent and wise, leading his disciples, or is there a teacher among them?",
        "source": "T24n1464_008:0885b13_2"
    },
    {
        "source_sentence": "有此人者，我欲時往禮拜問訊，使我心開意解。」",
        "translation": "If this person exists, I want to go there at the right time to venerate and greet them so that my mind will be enlightened.",
        "source": "T24n1464_008:0885b15_3"
    },
    {
        "source_sentence": "長者答：「此間有沙門瞿曇，是釋種子，出家學道剃除鬚髮，服三法衣，今成阿耨多羅阿惟三佛。",
        "translation": "The elder answered, Here's the ascetic Gautama, a son of the Śākyamuni family who left home to train in the path, shaved his hair and beard, and wore the three Dharma robes, and now he becomes an unsurpassed abhisaṃbuddha.",
        "source": "T24n1464_008:0885b17_0"
    },
    {
        "source_sentence": "欲往見者，今正是時，可往問訊。」",
        "translation": "Those who want to go and see him, now is the right time for them to go and greet him.",
        "source": "T24n1464_008:0885b19_1"
    },
    {
        "source_sentence": "婆羅門問：「瞿曇今為所在？",
        "translation": "The Brāhmaṇa asked, Where is Gautama now?",
        "source": "T24n1464_008:0885b19_2"
    },
    {
        "source_sentence": "欲往問訊。」",
        "translation": "I want to go and ask questions.",
        "source": "T24n1464_008:0885b20_3"
    },
    {
        "source_sentence": "時長者答：「今世尊在舍衛國祇樹給孤獨園，欲往便往。」",
        "translation": "The elder then answered, Now, the Bhagavān is staying at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī, and he wants to go there.",
        "source": "T24n1464_008:0885b20_4"
    },
    {
        "source_sentence": "時阿耆達兜婆羅門明日出舍衛詣祇桓，爾時世尊與無數億百千人說法。",
        "translation": "The Agnidatta then left Śrāvastī and went to Jīvaka on the morning, and the Bhagavān taught the Dharma to countless hundreds of millions of people.",
        "source": "T24n1464_008:0885b22_0"
    },
    {
        "source_sentence": "時阿耆達兜婆羅門遙見世尊端正無比，諸根具足、身黃金色，即前至佛所擎拳稱善，在一面坐。",
        "translation": "Seeing the Bhagavān's incomparable appearance, his faculties were complete and his body golden-colored, he went to the Buddha, raised his fist, praised him as good, and sat to one side.",
        "source": "T24n1464_008:0885b23_1"
    },
    {
        "source_sentence": "世尊為說種種微妙法，說法已默然住。",
        "translation": "The Bhagavān explained various subtle dharmas for them, and after teaching the Dharma, he remained silent.",
        "source": "T24n1464_008:0885b25_2"
    },
    {
        "source_sentence": "時婆羅門白世尊言：「願沙門瞿曇及比丘僧，受我夏坐九十日。」",
        "translation": "The Brāhmaṇa then said to the Bhagavān, May the ascetic Gautama and the monks and nuns accept my summer retreat for ninety days.",
        "source": "T24n1464_008:0885b26_3"
    },
    {
        "source_sentence": "爾時世尊億往昔對而不可避，即默然受婆羅門請。",
        "translation": "It was then that the Bhagavān addressed the Brāhmaṇa and couldn't avoid it, so he remained silent and accepted the invitation of the Brāhmaṇa.",
        "source": "T24n1464_008:0885b28_4"
    },
    {
        "source_sentence": "時婆羅門從坐起，擎拳辭退。",
        "translation": "The Brāhmaṇa then rose from his seat, raised his fist, and withdrew.",
        "source": "T24n1464_008:0885b29_5"
    },
    {
        "source_sentence": "從舍衛國即往鞞羅然，與佛比丘僧辦四月夏坐，種種飯食。",
        "translation": "From Sāvatthī, he went to Vārāṇasī and prepared a summer retreat for four months with the Buddha, monks, and nuns, as well as various kinds of food and drink.",
        "source": "T24n1464_008:0885b29_6"
    },
    {
        "source_sentence": "至夏坐初，勅守門者：「我今於四月中在內，欲不出行，莫令有人入。",
        "translation": "At the beginning of the summer retreat, an edict was issued to the gatekeeper: For the duration of the fourth month I am staying inside this monastery. If you wish not to go there, do not allow anyone to enter it.",
        "source": "T24n1464_008:0885c02_7"
    },
    {
        "source_sentence": "若有苦樂吉凶事，亦莫白我。」",
        "translation": "If there's pain, happiness, good fortune, or bad fortune, don't tell me either.",
        "source": "T24n1464_008:0885c03_8"
    },
    {
        "source_sentence": "守門者即奉教命。",
        "translation": "The gatekeeper then follows the instructions.",
        "source": "T24n1464_008:0885c04_9"
    },
    {
        "source_sentence": "爾時世尊夏坐時到，集和合僧，世尊告曰：「汝等各各收治衣鉢，當詣鞞羅然所。」",
        "translation": "When the time came for the Bhagavān to take his summer retreat, he gathered the assembled monks together, and the Bhagavān told them, You must each put away your robes and bowls and go to Kālāmaṇḍarī.",
        "source": "T24n1464_008:0885c04_10"
    },
    {
        "source_sentence": "時五百比丘從世尊著衣持鉢至鞞羅然。",
        "translation": "The five hundred monks then went from the Bhagavān, put on their robes and bowls, to Vārāṇasī.",
        "source": "T24n1464_008:0885c06_11"
    },
    {
        "source_sentence": "時鞞羅然無有堂舍，北有大失利沙山，山谷曠大草木深邃，種種華樹若干種鳥。",
        "translation": "To the north, there's a large Śāriputra mountain, a valley of vast grasses and trees, various flowers and trees, and several kinds of birds.",
        "source": "T24n1464_008:0885c07_12"
    },
    {
        "source_sentence": "爾時世尊及比丘僧，於彼山宿。",
        "translation": "At the time, the Bhagavān and the monks were staying on that mountain.",
        "source": "T24n1464_008:0885c09_13"
    },
    {
        "source_sentence": "時鞞羅然純婆羅門，人民飢饉乞求難得。",
        "translation": "At that time the people of Vārāṇasī were starving and it was difficult to obtain almsfood.",
        "source": "T24n1464_008:0885c10_14"
    },
    {
        "source_sentence": "世尊即夜集和合僧，告諸比丘：「比丘當知。",
        "translation": "That night, the Bhagavān gathered the assembled monks and told the monks, Monks, You should know this.",
        "source": "T24n1464_008:0885c11_0"
    },
    {
        "source_sentence": "此鞞羅然純婆羅門種，人民飢餓乞求難得。",
        "translation": "These people of Kaḷāraṇapura are purely brāhmaṇas, and it's difficult to obtain food because the people are hungry and beg for it.",
        "source": "T24n1464_008:0885c11_1"
    },
    {
        "source_sentence": "諸比丘欲於此間夏坐者坐，不者各隨所宜。」",
        "translation": "Those monks who want to sit here for the summer will do so, but those who don't will do so as appropriate.",
        "source": "T24n1464_008:0885c12_2"
    },
    {
        "source_sentence": "時舍利弗即退至阿茂訶山頂，受釋提桓因、須夷阿須倫女請(帝釋夫人)，四月食天厨。",
        "translation": "Śāriputra then withdrew to the top of Mount Amogha and accepted the invitations of Śakra Devānām-Indra and Sūrya Asuras (the wife of Indra), who ate in the celestial kitchen for four months.",
        "source": "T24n1464_008:0885c13_3"
    },
    {
        "source_sentence": "時世尊於鞞羅然，一不滿五百比丘結夏坐。",
        "translation": "At that time the World-honored One was staying in Benares. There were five hundred monks, one less than a thousand in number, who had taken their summer retreat.",
        "source": "T24n1464_008:0885c15_4"
    },
    {
        "source_sentence": "其長者婆羅門信佛者，或作四食五食六食便止，諸比丘乞求不能得。",
        "translation": "That elderly Brāhmaṇa believed in the Buddha, or he made four foods, five foods, and six foods to stop him, but the monks begged for them and couldn't get them.",
        "source": "T24n1464_008:0885c16_5"
    },
    {
        "source_sentence": "時尊者目犍連白佛言：「所以名閻浮提，因閻浮提果名。",
        "translation": "Venerable Maudgalyāyana then said to the Buddha, That's why it's called Jambudvīpa, which is the name of the fruit of Jambudvīpa.",
        "source": "T24n1464_008:0885c18_6"
    },
    {
        "source_sentence": "東方去此無數千里，取閻浮果與比丘使食，去果不遠，有呵梨勒阿摩勒國；",
        "translation": "Countless thousand li to the east of here he obtained some Jambudvipa fruits and gave them to the bhikṣus to eat. Not far from the fruit was the country of Hārilāmalā.",
        "source": "T24n1464_008:0885c19_7"
    },
    {
        "source_sentence": "至欝單曰，取自然粳米；",
        "translation": "When he arrived in Uttarakuru he said, “Take the millet that is naturally grown.",
        "source": "T24n1464_008:0885c21_8"
    },
    {
        "source_sentence": "至三十三天，取天甘露，與諸比丘使食。",
        "translation": "When he arrived in the thirty-three heavens, he took the heavenly ambrosia and gave it to the monks to eat.",
        "source": "T24n1464_008:0885c21_9"
    },
    {
        "source_sentence": "取此地肥，以左手反此地、右手取地肥，與諸比丘使食。」",
        "translation": "Take the fat from this place, reverse it with your left hand to this place and take the fat from that place with your right hand and give it to the monks to eat.",
        "source": "T24n1464_008:0885c22_10"
    },
    {
        "source_sentence": "世尊告目犍連曰：「知汝有此神力。",
        "translation": "The Bhagavān told Maudgalyāyana, Know that you have this miraculous power.",
        "source": "T24n1464_008:0885c24_11"
    },
    {
        "source_sentence": "此諸比丘宿對因緣，欲置何所？」",
        "translation": "Where do these monks want to place them for past causes and conditions?",
        "source": "T24n1464_008:0885c24_12"
    },
    {
        "source_sentence": "世尊不許。",
        "translation": "The Bhagavān won't allow it.",
        "source": "T24n1464_008:0885c25_13"
    },
    {
        "source_sentence": "鞞羅然界饒軟水草，有馬子驅馬於中放。",
        "translation": "On the boundary of Vārāṇasī there was a thicket of soft water and grass in which some horsemen drove their horses and released them.",
        "source": "T24n1464_008:0885c25_14"
    },
    {
        "source_sentence": "見諸比丘乞求無所得，語比丘言：「此間穀貴，乞求難得。",
        "translation": "Seeing that the monks begged for nothing, he said to the monks, “The grain here is valuable but it is difficult to obtain.",
        "source": "T24n1464_008:0885c26_15"
    },
    {
        "source_sentence": "我無有熟食麨乾飯，唯有馬麥，須當相施。」",
        "translation": "I don't have cooked rice, millet, or dry rice; I only have horse and wheat, so you must give it to me.",
        "source": "T24n1464_008:0885c27_16"
    },
    {
        "source_sentence": "諸比丘答：「世尊不許當食馬麥。」",
        "translation": "The monks answered, The Bhagavān won't allow me to eat horse wheat.",
        "source": "T24n1464_008:0885c28_17"
    },
    {
        "source_sentence": "往白世尊。",
        "translation": "He went to the Bhagavān and said.",
        "source": "T24n1464_008:0885c29_18"
    },
    {
        "source_sentence": "世尊告曰：「雖知是馬麥，隨時飲水飽，生草可取食耳。」",
        "translation": "The Bhagavān told him, Even though you know that this is horse wheat, you can drink water and feed it at any time; grow green grass will allow you to take food.",
        "source": "T24n1464_008:0885c29_19"
    },
    {
        "source_sentence": "時馬有五百匹，比丘僧少一不滿五百。",
        "translation": "At the time, there were 500 horses and less than 500 monks and nuns with fewer than one of them.",
        "source": "T24n1464_008:0886a02_20"
    },
    {
        "source_sentence": "馬日食麥一斗，養馬人日食麥二斗。",
        "translation": "A horse eats one sheng of wheat every day, and a horse farmer eats two shengs of wheat every day.",
        "source": "T24n1464_008:0886a02_21"
    },
    {
        "source_sentence": "分人馬麥各半，以施佛比丘僧。",
        "translation": "They divided half of the grain and gave it to the Buddha, bhikṣus, and saṃgha.",
        "source": "T24n1464_008:0886a03_22"
    },
    {
        "source_sentence": "時阿難持世尊分及己分入鞞羅然，求人熟。",
        "translation": "Ānanda then took the Bhagavān's portion and his own portion into Trāyastriṃśa Heaven to solicit their maturity.",
        "source": "T24n1464_008:0886a04_23"
    },
    {
        "source_sentence": "見一婦人，歎佛功德：「世尊有此戒、三昧、智慧、解脫、解脫智，三十二大人相八十種好莊嚴其身，圓光七尺(佛尋竟手足覆四支，不啻七尺)，身黃金色視之無厭。",
        "translation": "He saw a woman who praised the Buddha's merits, saying, Bhagavān, with this precept, samādhi, wisdom, liberation, and knowledge of liberation, his body adorned with thirty-two major characteristics and eighty-eight kinds of beauty was seven feet in circumference (the Buddha looked at her, covering four limbs with hands and feet that were no more than seven feet",
        "source": "T24n1464_008:0886a05_24"
    },
    {
        "source_sentence": "剔除鬚髮被袈裟出家學道，得阿耨多羅三耶三佛。",
        "translation": "He shaved his hair and beard, put on a monk's robe, left home, and trained in the path to attain unsurpassed, correct, and complete enlightenment.",
        "source": "T24n1464_008:0886a08_25"
    },
    {
        "source_sentence": "救眾生厄，不度者度、不脫者脫、不般涅槃者令般涅槃，無生老病死憂悲惱苦。",
        "translation": "He saves sentient beings from suffering, liberates those who aren't liberated, liberates those who aren't liberated, and causes those who don't attain parinirvāṇa to attain parinirvāṇa without the suffering of birth, old age, illness, death, grief, sorrow, pain, and vexation.",
        "source": "T24n1464_008:0886a09_26"
    },
    {
        "source_sentence": "不出家學道者，當作轉輪王，七寶前導：輪寶、象寶、馬寶、摩尼寶、玉女寶、長者寶、主兵寶。",
        "translation": "Those who don't leave home and train in the path will become wheel-turning king, guided by seven treasures: the wheel treasure, elephant treasure, horse treasure, maṇi treasure, jade woman treasure, elder treasure, and general treasure.",
        "source": "T24n1464_008:0886a11_27"
    },
    {
        "source_sentence": "當有千子，雄健勇猛。",
        "translation": "You will have a thousand sons, all of whom will be valiant and brave.",
        "source": "T24n1464_008:0886a13_28"
    },
    {
        "source_sentence": "典四天下，不加刀杖。",
        "translation": "He ruled over the four quarters of the empire without using swords or sticks.",
        "source": "T24n1464_008:0886a14_0"
    },
    {
        "source_sentence": "我及汝等皆當臣屬。",
        "translation": "'We and you will all be subjects.'",
        "source": "T24n1464_008:0886a14_1"
    },
    {
        "source_sentence": "受請至此鞞羅然夏坐。",
        "translation": "He accepted the invitation and arrived here, where he spent the summer retreat in Vārāṇasī.",
        "source": "T24n1464_008:0886a14_2"
    },
    {
        "source_sentence": "大妹！",
        "translation": "Great sister!",
        "source": "T24n1464_008:0886a15_3"
    },
    {
        "source_sentence": "能以此麥與作麨不？」",
        "translation": "Can you give this wheat to make a bowl of rice?",
        "source": "T24n1464_008:0886a15_4"
    },
    {
        "source_sentence": "婦人答言：「我家，阿難！",
        "translation": "The woman replied, At my house, Ānanda!",
        "source": "T24n1464_008:0886a16_5"
    },
    {
        "source_sentence": "役務事多。",
        "translation": "There were many servants and duties.",
        "source": "T24n1464_008:0886a16_6"
    },
    {
        "source_sentence": "自尚不供，況當供他？」",
        "translation": "If you don't make offerings yourself, how could you make offerings to others?",
        "source": "T24n1464_008:0886a16_7"
    },
    {
        "source_sentence": "去此不遠，有一婦人聞歎佛功德，甚奇甚特，便作此念：「世間乃有是人耶？」",
        "translation": "Not far from here, there was a woman who heard the Buddha praise his merits and became very surprised and special, so she thought, Is there such a person in the world?",
        "source": "T24n1464_008:0886a17_8"
    },
    {
        "source_sentence": "即呼阿難：「持此麥來，我與作麨。",
        "translation": "He then called Ānanda, bringing this wheat, and I'll make a bowl of it for him.",
        "source": "T24n1464_008:0886a19_0"
    },
    {
        "source_sentence": "從今日始，佛阿難及餘梵行者麥來，我與作麨。」",
        "translation": "From today on, the Buddha Ānanda and the other religious practitioners will bring wheat, and I'll give it to them as food.",
        "source": "T24n1464_008:0886a19_1"
    },
    {
        "source_sentence": "時此婦人即磨麥持與阿難。",
        "translation": "The woman then took the milled wheat and gave it to Ānanda.",
        "source": "T24n1464_008:0886a20_2"
    },
    {
        "source_sentence": "阿難持麨詣佛所，行澡水，授佛麨。",
        "translation": "Ānanda went to the Buddha with a bowl and offered him water for washing.",
        "source": "T24n1464_008:0886a21_3"
    },
    {
        "source_sentence": "佛便食之。",
        "translation": "The Buddha then ate it.",
        "source": "T24n1464_008:0886a22_4"
    },
    {
        "source_sentence": "阿難見佛食麨，悲泣墮淚。",
        "translation": "When Ānanda saw that the Buddha was eating rice gruel, he wept in sorrow and fell into tears.",
        "source": "T24n1464_008:0886a22_5"
    },
    {
        "source_sentence": "復作是念：「佛世尊是國王子，常食好食、未曾食惡食。",
        "translation": "Again, he thought, Bhagavān, this is a prince of the kingdom who always eats good food and never eats bad food.",
        "source": "T24n1464_008:0886a23_0"
    },
    {
        "source_sentence": "云何今日食此麥麨！",
        "translation": "How did you eat this wheat gruel today?",
        "source": "T24n1464_008:0886a24_1"
    },
    {
        "source_sentence": "那得氣力？」",
        "translation": "How can we attain energy?",
        "source": "T24n1464_008:0886a24_2"
    },
    {
        "source_sentence": "時世尊知阿難心所念，語阿難言：「汝能食此麨不？」",
        "translation": "Knowing what Ānanda thought, the Bhagavān said to Ānanda, Can you eat this rice?",
        "source": "T24n1464_008:0886a24_3"
    },
    {
        "source_sentence": "對曰：「能食。」",
        "translation": "He replied, They can eat.",
        "source": "T24n1464_008:0886a26_0"
    },
    {
        "source_sentence": "世尊即授與一揣，使食天甘露味。",
        "translation": "The Bhagavān then gave him a pot to eat the taste of heavenly ambrosia.",
        "source": "T24n1464_008:0886a26_1"
    },
    {
        "source_sentence": "阿難復作此念：「世尊食此必有氣力。」",
        "translation": "Again, Ānanda thought, Bhagavān, this food will surely have energy.",
        "source": "T24n1464_008:0886a27_2"
    },
    {
        "source_sentence": "世尊食已，澡鉢行水，白佛：「向者倩一婦人作麨，而不肯作。",
        "translation": "After he had eaten, the Bhagavān washed his bowl with water and said to the Buddha, That's when a woman in Anāthapiṇḍika made a dispute but refused to make it.",
        "source": "T24n1464_008:0886a27_3"
    },
    {
        "source_sentence": "有一婦人，不倩而自作。",
        "translation": "There was a woman who did it herself without asking questions.",
        "source": "T24n1464_008:0886a29_4"
    },
    {
        "source_sentence": "願聞其意。」",
        "translation": "May I hear your thoughts?",
        "source": "T24n1464_008:0886a29_5"
    },
    {
        "source_sentence": "世尊告曰：「其不作者設當為作，當為轉輪聖王第一夫人。",
        "translation": "The Bhagavān told him, If he doesn't do it, he'll be the first wife of the wheel-turning sage king if he wants to do it.",
        "source": "T24n1464_008:0886b01_0"
    },
    {
        "source_sentence": "不使而作者，獲大功德。",
        "translation": "The author who doesn't cause them to do so will attain great merit.",
        "source": "T24n1464_008:0886b02_1"
    },
    {
        "source_sentence": "雖不更作餘福，種阿耨多羅三耶三佛根。」",
        "translation": "Even though they don't further create other merits, they plant the unsurpassed, correct, and complete buddha faculties.",
        "source": "T24n1464_008:0886b02_2"
    },
    {
        "source_sentence": "對未畢日，無有聞佛及比丘僧食馬麥者。",
        "translation": "On the day before it was over, no one had heard that the Buddha and the monks and nuns were eating horse wheat.",
        "source": "T24n1464_008:0886b03_3"
    },
    {
        "source_sentence": "有天魔波旬化作比丘僧，擔囊盛乾餅石蜜，摸持九百葉餅於街巷間行。",
        "translation": "A deva Māra Pāpīyān transformed himself into a monk and carried a bag full of dry cakes and rock honey, carrying 900 pieces of cakes made of leaves in the streets.",
        "source": "T24n1464_008:0886b04_4"
    },
    {
        "source_sentence": "諸長者問諸比丘：「從何所來？」",
        "translation": "The elders asked the monks, Where did you come from?",
        "source": "T24n1464_008:0886b06_5"
    },
    {
        "source_sentence": "諸比丘答：「從鞞羅然來。」",
        "translation": "The monks replied, They came from Vārāṇasī.",
        "source": "T24n1464_008:0886b07_6"
    },
    {
        "source_sentence": "「佛及比丘僧無所乏婆？」",
        "translation": "There's nothing lacking in the Buddha and the monks and nuns?",
        "source": "T24n1464_008:0886b07_7"
    },
    {
        "source_sentence": "化比丘答：「飲食豐饒不能食盡，今送餘至舍衛。」",
        "translation": "The transformation monk answered, There's plenty of food and drink that can't be eaten up; now, I'll send the rest to Śrāvastī.",
        "source": "T24n1464_008:0886b08_8"
    },
    {
        "source_sentence": "往對償畢，其時十六大國皆聞佛及比丘僧在鞞羅然三月食馬麥。",
        "translation": "When they had paid their respects, the sixteen great kingdoms all heard that the Buddha and the monks and nuns were staying in Benares for three months to feed on horse wheat.",
        "source": "T24n1464_008:0886b09_9"
    },
    {
        "source_sentence": "諸富長者婆羅門積財一億，及入海導師車馬駱駝載負種種供具，往迎世尊及比丘僧。",
        "translation": "The wealthy and elderly brāhmaṇas accumulated hundreds of millions of possessions, as well as the entering sea guide's chariots, horses, cakravartins, and camels carrying various offerings to greet the Bhagavān and the monks.",
        "source": "T24n1464_008:0886b10_10"
    },
    {
        "source_sentence": "餘有七日當新歲，佛知而問阿難：「新歲餘有幾日？」",
        "translation": "Knowing that the remaining seven days would be new years, the Buddha knew and asked Ānanda, How many more days are left in the new year?",
        "source": "T24n1464_008:0886b12_11"
    },
    {
        "source_sentence": "阿難白佛：「餘有七日。」",
        "translation": "Ānanda said to the Buddha, There are seven days left.",
        "source": "T24n1464_008:0886b13_12"
    },
    {
        "source_sentence": "佛語阿難：「將二比丘入鞞羅然邑，語阿耆達兜婆羅門：『佛已受卿請九十日，今竟，欲普人間分衛。』」",
        "translation": "The Buddha said to Ānanda, Take these two monks into the town of Vārāṇasī and tell the Brāhmaṇa Agnidatta, 'The Buddha has accepted your invitation for ninety days, but now that it's over, he wants to protect all people.'",
        "source": "T24n1464_008:0886b14_13"
    },
    {
        "source_sentence": "時比丘白佛：「阿耆達兜意不一飯佛，何以故告別？」",
        "translation": "The monk then said to the Buddha, Agnidatta didn't want to give a meal to the Buddha, so why did he tell him to say goodbye?",
        "source": "T24n1464_008:0886b16_14"
    },
    {
        "source_sentence": "世尊告曰：「雖不設飯，交是請主，法應當別。」",
        "translation": "The Bhagavān told him, Even if you don't set up a meal and give it to the invitee, the Dharma should be separated.",
        "source": "T24n1464_008:0886b17_15"
    },
    {
        "source_sentence": "時尊者阿難承佛教，將二比丘入鞞羅然，住阿耆達兜門，語守門者：「汝往白，阿難在外欲得相見。」",
        "translation": "Following the Buddha's instructions, Venerable Ānanda led the two monks into Trāyastriṃśapāda and stayed at the gate of Agnidatta, saying to the gatekeeper, Go tell him, Ānanda, you want to see each other outside.",
        "source": "T24n1464_008:0886b18_16"
    },
    {
        "source_sentence": "時阿耆達兜在中庭，沐頭被白[疊*毛]衣踞繩床上。",
        "translation": "Agnidatta then stayed in the courtyard, washed his hair and covered his head with white [folding*hair] cloth, and sat down on a rope bed.",
        "source": "T24n1464_008:0886b20_17"
    },
    {
        "source_sentence": "時守門者即白，答語：「使入。」",
        "translation": "The gatekeeper then said, Let's go in.",
        "source": "T24n1464_008:0886b21_18"
    },
    {
        "source_sentence": "阿難即入，徐徐就坐。",
        "translation": "Ānanda then entered, walked slowly, and took his seat.",
        "source": "T24n1464_008:0886b22_19"
    },
    {
        "source_sentence": "默然須臾，婆羅門問：「以何事來？」",
        "translation": "In a moment of silence, the Brāhmaṇa asked, What's the reason for coming?",
        "source": "T24n1464_008:0886b22_20"
    },
    {
        "source_sentence": "阿難報言：「世尊語：『婆羅門！",
        "translation": "Ānanda replied, Bhagavān, saying, 'Brāhmaṇa!",
        "source": "T24n1464_008:0886b23_21"
    },
    {
        "source_sentence": "已受卿請九十日。",
        "translation": "I've accepted your invitation for ninety days.",
        "source": "T24n1464_008:0886b24_22"
    },
    {
        "source_sentence": "今欲入人間普分衛。』」",
        "translation": "Now, I want to enter the universal protection of all people.'",
        "source": "T24n1464_008:0886b24_23"
    },
    {
        "source_sentence": "婆羅門問：「云何阿難！",
        "translation": "The Brāhmaṇa asked, What's the matter, Ānanda!",
        "source": "T24n1464_008:0886b25_24"
    },
    {
        "source_sentence": "瞿曇於此夏坐耶？」",
        "translation": "Is Gautama sitting here this summer?",
        "source": "T24n1464_008:0886b25_25"
    },
    {
        "source_sentence": "阿難答：「卿前請夏坐而忘耶？」",
        "translation": "Ānanda answered, Did you forget to ask for a summer retreat before?",
        "source": "T24n1464_008:0886b26_26"
    },
    {
        "source_sentence": "婆羅門問：「九十日中云何得食？」",
        "translation": "The Brāhmaṇa asked, How can you eat for ninety days?",
        "source": "T24n1464_008:0886b26_27"
    },
    {
        "source_sentence": "阿難答：「大困大厄，世尊及比丘僧三月食馬麥。」",
        "translation": "Ānanda answered, Great trouble and great misfortune, the Bhagavān and the monks and nuns ate horse wheat for three months.",
        "source": "T24n1464_008:0886b27_28"
    },
    {
        "source_sentence": "時婆羅門憶請佛及比丘僧辦夏坐具，勅守門者莫令人來。",
        "translation": "The Brāhmaṇa then remembered the invitation of the Buddha and the monks to prepare their summer sitting cloths, and he ordered the gatekeeper not to allow them to come.",
        "source": "T24n1464_008:0886b28_29"
    },
    {
        "source_sentence": "阿耆達兜婆羅門復作是念：「四方遠近皆當聞我為此惡事。",
        "translation": "Again, the Agnidatta Brāhmaṇa thought, All people in the four directions and far and near will hear me do this bad thing.",
        "source": "T24n1464_008:0886b29_30"
    },
    {
        "source_sentence": "阿耆達兜請佛比丘僧無有供養。」",
        "translation": "Agnidatta invites buddhas, monks, and saṃgha without offerings.",
        "source": "T24n1464_008:0886c02_31"
    },
    {
        "source_sentence": "復語阿難：「可留瞿曇沙門得懺悔不？」",
        "translation": "Again, he said to Ānanda, Can I leave the ascetic Gautama to repent?",
        "source": "T24n1464_008:0886c03_0"
    },
    {
        "source_sentence": "阿難答曰：「不得留。」",
        "translation": "Ānanda answered, You mustn't stay.",
        "source": "T24n1464_008:0886c03_1"
    },
    {
        "source_sentence": "時阿耆達兜愁憂懊惱，自投于地。",
        "translation": "Agnidatta, grieved and distressed, threw himself to the ground.",
        "source": "T24n1464_008:0886c04_2"
    },
    {
        "source_sentence": "時親里眾以水灑而起坐，親里語阿耆達兜言：「汝莫愁憂。",
        "translation": "The relatives of the villagers then rose and sat up with water sprinkled over them, and they said to Agnidatta, Don't be sad.",
        "source": "T24n1464_008:0886c05_0"
    },
    {
        "source_sentence": "我等當詣瞿曇沙門所，與汝悔過。",
        "translation": "We will go to the place where the śramaṇa Gautama resides and report this matter to you.",
        "source": "T24n1464_008:0886c06_1"
    },
    {
        "source_sentence": "若不住者，持此種種飲食，使人舁往，當隨後行。",
        "translation": "If he doesn't abide, he'll carry these various foods and drinks, cause people to eat and go there, and then follow them.",
        "source": "T24n1464_008:0886c07_2"
    },
    {
        "source_sentence": "住處有乏，當以供養。」",
        "translation": "If there's a deficiency in the dwelling place, you should make an offering.",
        "source": "T24n1464_008:0886c08_3"
    },
    {
        "source_sentence": "時阿難與婆羅門及親里眾，詣世尊所悔過。",
        "translation": "Ānanda, the brāhmaṇa and his relatives went to the World-honored One to repent of their sins.",
        "source": "T24n1464_008:0886c08_4"
    },
    {
        "source_sentence": "世尊遙見來：「若我不住者，沸血當從面孔出。」",
        "translation": "The Bhagavān saw him coming from a distance, If I don't stay, boiling blood will come out of my face.",
        "source": "T24n1464_008:0886c09_5"
    },
    {
        "source_sentence": "以大慈悲更住七日，前所辦夏坐四月飲食盡舁來，豐饒盈溢。",
        "translation": "Because of his great compassion he stayed there for seven days. In the fourth month, during the summer retreat that had been arranged earlier, all the food and drinks were plentiful and overflowing.",
        "source": "T24n1464_008:0886c10_6"
    },
    {
        "source_sentence": "時跋嗜(邵脂反)人民聞佛當來六十日，普行分衛各辦供具以待如來。",
        "translation": "It was then that the people of Vṛji (Shaoshi) heard that the Buddha would come for 60 days, and they all traveled to make offerings to each other in order to wait for the Tathāgata.",
        "source": "T24n1464_008:0886c12_7"
    },
    {
        "source_sentence": "時世尊於鞞羅然具補納衣，一日衣竟，著衣持鉢詣跋嗜國。",
        "translation": "One day, when the Bhagavān had completed his robes, he put on his robe and took his bowl to the country of Vārāṇasī.",
        "source": "T24n1464_008:0886c13_8"
    },
    {
        "source_sentence": "阿耆達亦載飲食隨如來後，有所乏者即供足之。",
        "translation": "Agnidatta also carried food and drink to follow the Tathāgata, and if he had any lack, he would provide for them.",
        "source": "T24n1464_008:0886c15_9"
    },
    {
        "source_sentence": "知如來所投頓，輒在前供辦，並作是語：「我今日、我明日請佛。」",
        "translation": "Knowing what the Tathāgata had thrown away, they quickly made offerings in front of him and said, Today or tomorrow, I'll invite the Buddha.",
        "source": "T24n1464_008:0886c16_10"
    },
    {
        "source_sentence": "時跋嗜人民聞阿耆達載飲食隨如來後，「此必妨我不得飯佛。」",
        "translation": "When the people of Vṛji heard that Agnidatta was carrying food and drink after the Tathāgata, they said, This will surely prevent me from feeding the Buddha.",
        "source": "T24n1464_008:0886c17_11"
    },
    {
        "source_sentence": "即集會自作限制：「其作食飯佛者作小食，復作蜜漿，勿聽婆羅門得作飯食。",
        "translation": "He then assembled the assembly and made a self-imposed restriction, saying, Those who cook rice for the Buddha should cook small foods and also make honey and syrup, so that the Brāhmaṇa won't be allowed to cook rice.",
        "source": "T24n1464_008:0886c18_12"
    },
    {
        "source_sentence": "其有見阿耆達者，當罵言：『惡婆羅門！",
        "translation": "Anyone who sees Agnidatta will scold him, saying, 'Stupid Brāhmaṇa!",
        "source": "T24n1464_008:0886c20_13"
    },
    {
        "source_sentence": "將佛及比丘僧九十日與馬麥食。",
        "translation": "He gave the Buddha and the monks and nuns a meal of horse wheat for ninety days.",
        "source": "T24n1464_008:0886c21_14"
    },
    {
        "source_sentence": "今復載飯食妨他耶？』」",
        "translation": "Is it now that you're carrying rice and food to prevent others?'",
        "source": "T24n1464_008:0886c22_15"
    },
    {
        "source_sentence": "時婆羅門愁悶在一面立，看諸人民供具少者，輒供足之。",
        "translation": "The Brāhmaṇa, overcome with grief, stood to one side. Seeing that the offerings of all the people were scarce, he offered them as an offering.",
        "source": "T24n1464_008:0886c22_16"
    },
    {
        "source_sentence": "唯見無豆鬻，即以胡麻子、蘇子、豆擣阿摩勒、鞞醯勒、蓽茇、薑作鬻，奉上世尊。",
        "translation": "They simply saw that there was no bean curd, and they made a dish of sesame seeds, millet, sour milk, bean curds, black mustard seed, fenugreek celery, grapes, or shrimps to offer to the Bhagavān.",
        "source": "T24n1464_008:0886c24_17"
    },
    {
        "source_sentence": "世尊告曰：「分與比丘僧。」",
        "translation": "The Bhagavān told them, Share it with the monks and nuns.",
        "source": "T24n1464_008:0886c25_18"
    },
    {
        "source_sentence": "比丘僧不受：「世尊不許當食此鬻。」",
        "translation": "The monks and nuns didn't accept it, saying, Bhagavān, the Bhagavān won't allow me to eat this food.",
        "source": "T24n1464_008:0886c26_19"
    },
    {
        "source_sentence": "時婆羅門來白世尊：「諸比丘不受此鬻。」",
        "translation": "The Brāhmaṇa then came to the Bhagavān and said, Monks, don't accept this dispute.",
        "source": "T24n1464_008:0886c27_20"
    },
    {
        "source_sentence": "世尊告諸比丘：「從今以往，有病無病，常服此鬻。",
        "translation": "The Bhagavān addressed the monks, From now on, there's illness and no illness, so he always takes this medicine.",
        "source": "T24n1464_008:0886c28_21"
    },
    {
        "source_sentence": "有五事：益於身體，除飢不渴，無風寒病，腸胃通利，生食病熟。」",
        "translation": "There are five things: it benefits the body, removes hunger and thirst, doesn't experience illnesses of wind and cold, has a sharp intestines and stomach, and produces food that's ripe for illness.",
        "source": "T24n1464_008:0886c29_22"
    },
    {
        "source_sentence": "阿耆達復作是念：「我夏四月辦種種飲食載飲食來，復不得飯佛及比丘僧。",
        "translation": "Again, Agnidatta thought, In the fourth month of summer, I'll prepare a variety of foods and drinks to bring in food and drink, but I won't be allowed to feed the Buddha or the monks.",
        "source": "T24n1464_008:0887a01_23"
    },
    {
        "source_sentence": "我今當如祭神法布食著地，使諸比丘脚履上過，則為已食。」",
        "translation": "Now, I will spread food on the ground as an offering to the deity and cause the monks to walk upward so that they'll eat it.",
        "source": "T24n1464_008:0887a03_24"
    },
    {
        "source_sentence": "世尊告曰：「此非脚所履物，此是口所食具。」",
        "translation": "The Bhagavān told them, These aren't things that your feet walk; these are food preparations for your mouth.",
        "source": "T24n1464_008:0887a04_25"
    },
    {
        "source_sentence": "世尊與婆羅門說法，說法已婆羅門即還去。",
        "translation": "The Bhagavān taught the Dharma to the Brāhmaṇa, and after he taught the Dharma, the Brāhmaṇa returned.",
        "source": "T24n1464_008:0887a05_26"
    },
    {
        "source_sentence": "時世尊著衣持鉢還舍衛國。",
        "translation": "The Bhagavān then put on his robe, took his bowl, and returned to Śrāvastī.",
        "source": "T24n1464_008:0887a06_27"
    },
    {
        "source_sentence": "有一外道梵志身體肥大，從世尊後。",
        "translation": "There was a non-Buddhist priest whose body was fat and large, following behind the Bhagavān.",
        "source": "T24n1464_008:0887a07_28"
    },
    {
        "source_sentence": "有一婆羅門著道來，問此梵志：「此間飲食可得不？」",
        "translation": "A Brāhmaṇa came along on the path and asked this priest, Can I get food and drink here?",
        "source": "T24n1464_008:0887a08_29"
    },
    {
        "source_sentence": "答言：「可得。」",
        "translation": "He replied, It's possible.",
        "source": "T24n1464_008:0887a09_30"
    },
    {
        "source_sentence": "復問：「由誰得？」",
        "translation": "Again, he asked, From whom did you get it?",
        "source": "T24n1464_008:0887a09_31"
    },
    {
        "source_sentence": "答言：「從是禿長者得。」",
        "translation": "He replied, From this, the baldie attains it.",
        "source": "T24n1464_008:0887a09_32"
    },
    {
        "source_sentence": "婆羅門言：「咄去去，汝為惡言。",
        "translation": "The Brāhmaṇa said, Go away, you're saying bad things.",
        "source": "T24n1464_008:0887a10_33"
    },
    {
        "source_sentence": "汝得肥壯皆由瞿曇沙門，而反更罵。",
        "translation": "You've gained weight and strength because of the Gautama ascetic, who instead ridicules you.",
        "source": "T24n1464_008:0887a10_34"
    },
    {
        "source_sentence": "若瞿曇沙門聞，當為沙門結戒，不復與外道飲食。」",
        "translation": "If the Gautama ascetic hears it, he'll form the precepts for the ascetic and no longer give food and drink to non-Buddhists.",
        "source": "T24n1464_008:0887a11_35"
    },
    {
        "source_sentence": "諸比丘往白世尊。",
        "translation": "The monks went to the Bhagavān and told him.",
        "source": "T24n1464_008:0887a12_36"
    },
    {
        "source_sentence": "世尊告曰：「此外道異學長夜習顛倒，此等若被打中毒橫羅官事，謂呼沙門瞿曇為。」",
        "translation": "The Bhagavān told them, Other heretics who spend a long time cultivating mistakenness are called the ascetic Gautama if they're beaten and poisoned by officials in Zāra.",
        "source": "T24n1464_008:0887a13_37"
    },
    {
        "source_sentence": "時世尊故未與沙門結戒。",
        "translation": "At the time, the Bhagavān hadn't yet formed the precepts with the ascetic.",
        "source": "T24n1464_008:0887a15_38"
    },
    {
        "source_sentence": "前至舍衛國，舍衛國長者與佛及比丘僧，作酥餅百葉脆餅。",
        "translation": "When he went to Sāvatthī, the elders of Sāvatthī and the Buddha and the monks and nuns made butter cakes with a hundred leaves and crisp cakes.",
        "source": "T24n1464_008:0887a15_39"
    },
    {
        "source_sentence": "諸佛世尊常法，飲食不足終不起坐，要當食足。",
        "translation": "Bhagavān, it's always the teaching of the buddhas and world-honored ones that they don't have enough food or drink to finish sitting without rising, so they must eat their feet.",
        "source": "T24n1464_008:0887a17_40"
    },
    {
        "source_sentence": "若檀越少者，以佛力一切充足。",
        "translation": "If the donor is small, he'll be able to satisfy them all with the Buddha's power.",
        "source": "T24n1464_008:0887a18_41"
    },
    {
        "source_sentence": "有二婆羅門婦來，語尊者阿難：「見施少餅。」",
        "translation": "Two Brāhmaṇa women came and said to Venerable Ānanda, See the little cake you gave me.",
        "source": "T24n1464_008:0887a18_42"
    },
    {
        "source_sentence": "時以兩番餅與一人，一番餅與一。",
        "translation": "He then gave two pieces of cakes to one person and one piece of cake to the other.",
        "source": "T24n1464_008:0887a19_43"
    },
    {
        "source_sentence": "人得一番者，問彼一人：「汝得幾番？」",
        "translation": "When someone gets one, they ask the other person, How many times have you gotten it?",
        "source": "T24n1464_008:0887a20_44"
    },
    {
        "source_sentence": "答言：「得二番。」",
        "translation": "He replied, There are two ways to get it.",
        "source": "T24n1464_008:0887a21_45"
    },
    {
        "source_sentence": "反問：「汝得幾番？」",
        "translation": "He asked, How many times did you get it?",
        "source": "T24n1464_008:0887a21_46"
    },
    {
        "source_sentence": "答：「得一番。",
        "translation": "Answer: I'll get one.",
        "source": "T24n1464_008:0887a22_47"
    },
    {
        "source_sentence": "汝長得一番，當與我分。」",
        "translation": "If you long for one, you'll give me a share.",
        "source": "T24n1464_008:0887a22_48"
    },
    {
        "source_sentence": "答：「各自得分。",
        "translation": "Answer: Each one is divided into two.",
        "source": "T24n1464_008:0887a22_49"
    },
    {
        "source_sentence": "不與汝分。」",
        "translation": "I won't give you a share.",
        "source": "T24n1464_008:0887a23_50"
    },
    {
        "source_sentence": "一人言：「阿難必是汝婿。」",
        "translation": "One person said, Ānanda must be your husband.",
        "source": "T24n1464_008:0887a23_51"
    },
    {
        "source_sentence": "二人共相捽搣大喚。",
        "translation": "The two people screamed together and called out loudly.",
        "source": "T24n1464_008:0887a24_0"
    },
    {
        "source_sentence": "世尊知而問阿難：「此人何以共鬪？」",
        "translation": "Knowing this, the Bhagavān asked Ānanda, Why is this person fighting together?",
        "source": "T24n1464_008:0887a24_1"
    },
    {
        "source_sentence": "阿難具白世尊。",
        "translation": "Ānanda told the Bhagavān in detail.",
        "source": "T24n1464_008:0887a25_2"
    },
    {
        "source_sentence": "世尊告曰：「若比丘自手與婆羅門、婆羅門婦餅者，墮。",
        "translation": "The Bhagavān told them, Suppose a monk gives cakes to the Brāhmaṇa or Brāhmaṇa's wife with his own hand, and they fall into it.",
        "source": "T24n1464_008:0887a25_3"
    },
    {
        "source_sentence": "食有五種：一根食。",
        "translation": "There are five kinds of food:",
        "source": "T24n1464_008:0887a26_4"
    },
    {
        "source_sentence": "根食者，藕、盧蔔、繫婆陀(根小而甜)。",
        "translation": "The food of the faculties is lotus, red lotus, and fetters (the faculties are small but sweet).",
        "source": "T24n1464_008:0887a27_5"
    },
    {
        "source_sentence": "二莖食。",
        "translation": "The second is the food of stems.",
        "source": "T24n1464_008:0887a27_6"
    },
    {
        "source_sentence": "莖食者，竿炙叔基(酢莖)諸所食菜。",
        "translation": "Stem food refers to the vegetables that are eaten by poles, roasting roots, and so forth ( vinegar stems).",
        "source": "T24n1464_008:0887a28_7"
    },
    {
        "source_sentence": "三為葉食。",
        "translation": "Three, it's for the food of leaves.",
        "source": "T24n1464_008:0887a28_8"
    },
    {
        "source_sentence": "諸所食葉。",
        "translation": "It's the leaves that are eaten.",
        "source": "T24n1464_008:0887a29_9"
    },
    {
        "source_sentence": "四為華食。",
        "translation": "Fourth, it's a flower food.",
        "source": "T24n1464_008:0887a29_10"
    },
    {
        "source_sentence": "婆婆羅梨華(波波羅酸棗)婆婆。",
        "translation": "(Skt. pārājika) and pārājika (pārājika) are called pārājika.",
        "source": "T24n1464_008:0887a29_11"
    },
    {
        "source_sentence": "五為果食。",
        "translation": "The fifth is fruit food.",
        "source": "T24n1464_008:0887b01_12"
    },
    {
        "source_sentence": "諸所食果，蒲萄甘橘。",
        "translation": "The fruits that they eat are grapes, grapes, grapes, grapes, and sweet oranges.",
        "source": "T24n1464_008:0887b01_13"
    },
    {
        "source_sentence": "復有五食：粟米、糜米、青麥、豌豆、粳米。",
        "translation": "Again, there are five kinds of food: millet, millet, green wheat, peasants, and millet.",
        "source": "T24n1464_008:0887b01_14"
    },
    {
        "source_sentence": "若食此食時，有五婆羅門來乞，當言此非我食。",
        "translation": "When he eats this food, five brāhmaṇas come and beg for it, saying, 'This isn't my food.'",
        "source": "T24n1464_008:0887b02_15"
    },
    {
        "source_sentence": "有索水者，當言非我水。",
        "translation": "If someone asks for water, they'll say it's not self-water.",
        "source": "T24n1464_008:0887b03_16"
    },
    {
        "source_sentence": "索果者，當言非我果。",
        "translation": "The one who asks for a fruit should say that it's not the fruit of self.",
        "source": "T24n1464_008:0887b04_17"
    },
    {
        "source_sentence": "盡不得與，除其父母、病人。」",
        "translation": "They can't give it to anyone except their parents or the sick.",
        "source": "T24n1464_008:0887b04_18"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_008:0887b06_0"
    },
    {
        "source_sentence": "王波斯匿與阿闍世常共鬪，時興兵相伐。",
        "translation": "King Prasenajit and Ajātaśatru always fought with each other, and at the time they raised an army to attack each other.",
        "source": "T24n1464_008:0887b06_1"
    },
    {
        "source_sentence": "六群比丘自相謂言：「共往看軍馬。」",
        "translation": "The six groups of monks said to each other, Let's go see the army and horses together.",
        "source": "T24n1464_008:0887b07_2"
    },
    {
        "source_sentence": "即往看軍馬。",
        "translation": "He went to see the army and horses.",
        "source": "T24n1464_008:0887b08_3"
    },
    {
        "source_sentence": "諸長者見，自相謂言：「此沙門釋子出家為道，方觀軍馬。」",
        "translation": "Seeing this, the elders said to each other, This ascetic or Śākyamuni leaves home for the path and only then observes armies and horses.",
        "source": "T24n1464_008:0887b08_4"
    },
    {
        "source_sentence": "以此事往白世尊。",
        "translation": "He went to the Bhagavān because of this matter.",
        "source": "T24n1464_008:0887b10_0"
    },
    {
        "source_sentence": "世尊告曰：「若比丘，軍馬欲發就往看者，墮。」",
        "translation": "The Bhagavān told him, Suppose a monk or army horse wants to go and look for it, and he falls down.",
        "source": "T24n1464_008:0887b10_1"
    },
    {
        "source_sentence": "◎鼻奈耶卷第八",
        "translation": "*Hinayana, vol. 8",
        "source": "T24n1464_008:0887b11_2"
    }
]