[
    {
        "source_sentence": "根本說一切有部毘奈耶羯恥那",
        "translation": "Mūlasarvâstivāda-sūtra",
        "source": "T24n1449_001:0097b03_0"
    },
    {
        "source_sentence": "衣事一卷",
        "translation": "monastic robes in one volume",
        "source": "T24n1449_001:0097b04_0"
    },
    {
        "source_sentence": "大唐三藏義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Jīvaka of the Great Tang",
        "source": "T24n1449_001:0097b06_0"
    },
    {
        "source_sentence": "爾時佛在室羅筏城逝多林給孤獨園。",
        "translation": "It was then that the Buddha stayed at Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1449_001:0097b07_0"
    },
    {
        "source_sentence": "時有眾多苾芻在自來城三月坐雨安居已，各持衣鉢，詣世尊所。",
        "translation": "At the time, there were many monks in their own city who had been sitting in rain for three months and had settled down, each bringing their robes and bowls to the Bhagavān.",
        "source": "T24n1449_001:0097b07_1"
    },
    {
        "source_sentence": "路逢泥雨，困於暑熱，野草割身，遍皆流汗，漸次遊行，至室羅筏城。",
        "translation": "On the way he encountered mud and rain and was tormented by the heat of the summer. His body was cut off by wild grass and sweat flowed all over his body. He gradually traveled one after another until he reached the city of Śrāvastī.",
        "source": "T24n1449_001:0097b09_2"
    },
    {
        "source_sentence": "時諸苾芻安置衣鉢，洗足已，至世尊處，頂禮雙足，在一面坐。",
        "translation": "The monks then placed their robes and bowls, washed their feet, went to the Bhagavān's place, bowed their heads and feet, and sat to one side.",
        "source": "T24n1449_001:0097b10_3"
    },
    {
        "source_sentence": "世尊常法，見客苾芻來，共相慰問：「汝於何處安居而來至此？」",
        "translation": "The Bhagavān always said, Seeing the guest monk coming, they all greeted each other and asked, Where are you staying and coming here?",
        "source": "T24n1449_001:0097b12_4"
    },
    {
        "source_sentence": "白言：「世尊！",
        "translation": "He said, Bhagavān!",
        "source": "T24n1449_001:0097b13_5"
    },
    {
        "source_sentence": "我等於自來城三月安居已，而來至此。」",
        "translation": "We came here three months after we had settled in our own city.",
        "source": "T24n1449_001:0097b13_6"
    },
    {
        "source_sentence": "問言：「汝等在彼安居，於三月中，得安樂住不？",
        "translation": "He asked, Have you been living there for three months?",
        "source": "T24n1449_001:0097b14_7"
    },
    {
        "source_sentence": "乞求飲食，不難得不？」",
        "translation": "Is it not difficult to beg for food and drink?",
        "source": "T24n1449_001:0097b15_8"
    },
    {
        "source_sentence": "答言：「世尊！",
        "translation": "He replied, Bhagavān!",
        "source": "T24n1449_001:0097b16_9"
    },
    {
        "source_sentence": "我等三月安樂而住，飲食不難。",
        "translation": "We will live in peace and comfort for three months. It will not be difficult for us to eat or drink.",
        "source": "T24n1449_001:0097b16_10"
    },
    {
        "source_sentence": "我等從彼擎持衣鉢，所經道路，泥雨艱辛，身形疲頓，漸來至此。」",
        "translation": "From there, we lifted our robes and bowls to carry them. The road that we passed on the way was muddy and rainy, exhausted in body and form, and gradually came here.",
        "source": "T24n1449_001:0097b17_11"
    },
    {
        "source_sentence": "世尊聞已，作如是念：「我諸弟子雨安居竟，人間遊行，擎持衣鉢，路逢泥雨，極遭辛苦，形體疲頓。",
        "translation": "Having heard this, the World-honored One thought: When my disciples have settled down through rain and are enjoying a peaceful retreat, I am traveling among the people. Carrying my robes and bowl in my hands, I encounter mud and rain on the road.",
        "source": "T24n1449_001:0097b18_12"
    },
    {
        "source_sentence": "我今宜可令諸苾芻，得安樂住。",
        "translation": "Now, it's appropriate for me to allow the monks to live in comfort.",
        "source": "T24n1449_001:0097b20_13"
    },
    {
        "source_sentence": "并諸施主福增長故，聽諸苾芻張羯恥那衣。",
        "translation": "Because the donor's merit increases, he listens to the monks who open their khaṭṭika robes.",
        "source": "T24n1449_001:0097b21_14"
    },
    {
        "source_sentence": "張此衣時，有五勝利：一、無過十日犯；",
        "translation": "When these robes are spread, there are five advantages:",
        "source": "T24n1449_001:0097b22_15"
    },
    {
        "source_sentence": "二、無過一月犯；",
        "translation": "The second is an offense committed for one month without exceeding that.",
        "source": "T24n1449_001:0097b23_16"
    },
    {
        "source_sentence": "三、無過經宿離衣犯；",
        "translation": "The third is the offense of not transgressing the precepts by staying overnight apart from one’s clothes.",
        "source": "T24n1449_001:0097b23_17"
    },
    {
        "source_sentence": "四、唯著上下二衣，得人間遊行；",
        "translation": "They wear only the two upper and lower garments, allowing them to travel among the people.",
        "source": "T24n1449_001:0097b24_18"
    },
    {
        "source_sentence": "五、得隨意多畜長衣。",
        "translation": "5. They can store long robes as much as they wish.",
        "source": "T24n1449_001:0097b24_19"
    },
    {
        "source_sentence": "復有五種饒益：一、得別眾食；",
        "translation": "Again, there are five kinds of benefit:",
        "source": "T24n1449_001:0097b25_20"
    },
    {
        "source_sentence": "二、得數數食；",
        "translation": "The second is that they receive food repeatedly.",
        "source": "T24n1449_001:0097b25_21"
    },
    {
        "source_sentence": "三、俗家不請，得往受食；",
        "translation": "3. Those who are not invited by their lay followers may go and receive food.",
        "source": "T24n1449_001:0097b26_22"
    },
    {
        "source_sentence": "四、得隨意多求衣；",
        "translation": "The fourth was that they obtained robes to be worn as much as they wished.",
        "source": "T24n1449_001:0097b26_23"
    },
    {
        "source_sentence": "五、始從八月半，至正月半時，經五箇月所得財物，皆是羯恥那衣利養。",
        "translation": "5. From the first half of the eighth month until the second half of the first month, the property acquired over five months are all the benefits of the khaṭṭṭika robe.",
        "source": "T24n1449_001:0097b27_24"
    },
    {
        "source_sentence": "如是開時，令諸弟子，得安樂住。」",
        "translation": "When it's thus opened, he causes his disciples to attain a peaceful abode.",
        "source": "T24n1449_001:0097b28_25"
    },
    {
        "source_sentence": "即告諸苾芻：「欲令汝等得安樂住，并諸施主福增長故，雨安居眾張羯恥那衣，獲多利益如前十種。」",
        "translation": "He then told the monks, In order to make you attain a peaceful abode, and because the merits of the donors increase, it rains on the ten kinds of benefits like the previous ones for those who live in peace and open their khaṭṭika robes.",
        "source": "T24n1449_001:0097b29_26"
    },
    {
        "source_sentence": "如世尊說張羯恥那衣者，諸苾芻不知云何張衣？",
        "translation": "As the Bhagavān explains, when he opens the kaṭhina robe, the monks don't know how to open the robe?",
        "source": "T24n1449_001:0097c02_27"
    },
    {
        "source_sentence": "佛言：「三月安居，眾獲衣物，應將作衣，先以言白，告眾令知：『大眾應知，今夏坐苾芻眾得此衣。",
        "translation": "The Buddha said, In the third month's retreat, when the assembled monks obtained their clothing, they should make a robe and first tell them with words to let them know, 'The assembled monks should know that this summer's seated monks will obtain this robe.",
        "source": "T24n1449_001:0097c03_28"
    },
    {
        "source_sentence": "若大眾樂者，令將此物，為眾作羯恥那衣。』",
        "translation": "If the masses are happy, they'll cause this thing to be made into a khaṭṭika robe for the masses.'",
        "source": "T24n1449_001:0097c05_29"
    },
    {
        "source_sentence": "至明日已鳴揵椎、集僧伽、言白已周。",
        "translation": "On the morning, he had already sounded the gong, gathered the saṃgha, and completed his speech.",
        "source": "T24n1449_001:0097c06_30"
    },
    {
        "source_sentence": "令一苾芻作白曰：「『大德僧伽聽！",
        "translation": "He ordered a monk to make a confession, saying, 'Listen, Mañjuśrī!",
        "source": "T24n1449_001:0097c07_31"
    },
    {
        "source_sentence": "此衣是此處雨安居僧伽所獲利物，僧伽今共將此衣作羯恥那。",
        "translation": "This robe is the property of the rainy retreat saṃgha at this place that benefits the saṃgha, and now the saṃgha together makes this robe into a khaṭṭṭika.",
        "source": "T24n1449_001:0097c09_32"
    },
    {
        "source_sentence": "此衣當為僧伽張作羯恥那。",
        "translation": "This robe should be made into a khaṭṭṭika for the saṃgha.",
        "source": "T24n1449_001:0097c10_33"
    },
    {
        "source_sentence": "若張衣已，雖出界外，所有三衣尚無離過，何況餘衣？",
        "translation": "If he opens his robe and leaves the boundary, even though he's outside the boundary, there are three kinds of robes that aren't free from each other, so why wouldn't he?",
        "source": "T24n1449_001:0097c11_34"
    },
    {
        "source_sentence": "若僧伽時至聽者，僧伽應許僧伽今將此衣，令某甲苾芻當為僧伽作羯恥那。",
        "translation": "If the saṃgha arrives to listen at the time of the saṃgha, the saṃgha should allow the saṃgha to accept this robe and cause a certain monk to make a kaṭhina for the saṃgha.",
        "source": "T24n1449_001:0097c12_35"
    },
    {
        "source_sentence": "若張衣已，雖出界外，所有三衣尚無離過，何況餘衣？",
        "translation": "If he opens his robe and leaves the boundary, even though he's outside the boundary, there are three kinds of robes that aren't free from each other, so why wouldn't he?",
        "source": "T24n1449_001:0097c14_36"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T24n1449_001:0097c15_37"
    },
    {
        "source_sentence": "羯磨准白成。",
        "translation": "The karma is formed according to the explanation.",
        "source": "T24n1449_001:0097c15_38"
    },
    {
        "source_sentence": "次當差張羯恥那衣苾芻，須具五德者，應可量差，所謂無欲、愛、恚、癡、知張與不張。",
        "translation": "Next, he'll send a monk who wears the khaṭṭika robe and requires the five virtues to be possessed, which should be measured differently, namely, freedom from desire, craving, anger, delusion, and knowing what's open and what's not open.",
        "source": "T24n1449_001:0097c16_39"
    },
    {
        "source_sentence": "若異此者，即不應差。",
        "translation": "If it's different from this, then it shouldn't differ.",
        "source": "T24n1449_001:0097c17_40"
    },
    {
        "source_sentence": "如是應差，為前方便。",
        "translation": "Thus, this is the first method of making a difference.",
        "source": "T24n1449_001:0097c18_41"
    },
    {
        "source_sentence": "眾現集已，應先問能不能，云：『汝某甲！",
        "translation": "After the congregation had assembled, he should first ask if he could, 'You, Mr. A.!",
        "source": "T24n1449_001:0097c18_42"
    },
    {
        "source_sentence": "能為僧伽作張衣人不？』",
        "translation": "Can you make a monk's robe for the saṃgha?'",
        "source": "T24n1449_001:0097c19_43"
    },
    {
        "source_sentence": "若言能者，答言：『我能。』",
        "translation": "If someone says they can, they reply, 'I can.'",
        "source": "T24n1449_001:0097c20_44"
    },
    {
        "source_sentence": "次一苾芻作白羯磨，差云：『大德僧伽聽！",
        "translation": "The next monk made a statement of karma and sent it, saying, 'Listen, Mañjuśrī!",
        "source": "T24n1449_001:0097c20_45"
    },
    {
        "source_sentence": "此苾芻某甲，樂作張羯恥那衣人，今為僧伽張羯恥那衣。",
        "translation": "This monk, Mr. A., is happy to make a kaṭhina robe for the saṃgha, but now he's making a kaṭhina robe for the saṃgha.",
        "source": "T24n1449_001:0097c21_46"
    },
    {
        "source_sentence": "若僧伽時至聽者，僧伽應許僧伽今差某甲苾芻作張羯恥那人。",
        "translation": "If the saṃgha arrives at the time of the saṃgha and listens, the saṃgha will allow the saṃgha to accept that the saṃgha now sends a certain monk to become a khaṭṭṭika person.",
        "source": "T24n1449_001:0097c22_47"
    },
    {
        "source_sentence": "此某甲當為僧伽張羯恥那衣。",
        "translation": "This certain person will make a kaṭhina robe for the saṃgha.",
        "source": "T24n1449_001:0097c24_48"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T24n1449_001:0097c25_49"
    },
    {
        "source_sentence": "『大德僧伽聽！",
        "translation": "'Listen, great virtuous monks!",
        "source": "T24n1449_001:0097c25_50"
    },
    {
        "source_sentence": "此苾芻某甲，樂作張羯恥那人，今為僧伽張羯恥那衣。",
        "translation": "This monk, a certain person, liked to make a kaṭhina robe for the saṃgha, but now he's making a kaṭhina robe for the saṃgha.",
        "source": "T24n1449_001:0097c25_51"
    },
    {
        "source_sentence": "僧伽今差某甲作張羯恥那人。",
        "translation": "Now, the saṃgha will send a certain person to be Zhang khaṭṭṭika.",
        "source": "T24n1449_001:0097c26_52"
    },
    {
        "source_sentence": "某甲苾芻當為僧伽張羯恥那。",
        "translation": "A certain monk will be the saṃghâṭika khaṭṭika for the saṃghâṭika.",
        "source": "T24n1449_001:0097c27_53"
    },
    {
        "source_sentence": "若諸具壽聽差某甲作張羯恥那人，此某甲當為僧伽張羯恥那者默然；",
        "translation": "If the whole group of living beings were to allow a certain person to be appointed khaṭṭṭika, this certain person would be silent for the sake of the sangha as khaṭṭika.",
        "source": "T24n1449_001:0097c28_54"
    },
    {
        "source_sentence": "若不許者說。』",
        "translation": "If someone doesn't approve, they say so.'",
        "source": "T24n1449_001:0097c29_55"
    },
    {
        "source_sentence": "『僧伽已聽此某甲作張羯恥那人，此某甲當為僧伽作張羯恥那衣人竟。",
        "translation": "'The saṃgha has heard that this certain person will make a monk's robe for the saṃgha, and this certain person will make a monk's robe for the saṃgha after he finishes making a monk's robe.",
        "source": "T24n1449_001:0098a01_56"
    },
    {
        "source_sentence": "僧伽已聽許，由其默然故，我今如是持。』",
        "translation": "After the saṃgha has heard it, I'll now thus maintain it because they're silent.'",
        "source": "T24n1449_001:0098a02_57"
    },
    {
        "source_sentence": "其次張衣苾芻應作白羯磨，當作羯恥那衣。",
        "translation": "Next, the monk who opens his robe should make a white karma and make a khaṭṭṭika robe.",
        "source": "T24n1449_001:0098a03_58"
    },
    {
        "source_sentence": "「『大德僧伽聽！",
        "translation": "'Listen, great virtuous monks!",
        "source": "T24n1449_001:0098a05_0"
    },
    {
        "source_sentence": "此衣當為僧伽作羯恥那衣。",
        "translation": "This robe should be made into a kaṭhina robe for the saṃgha.",
        "source": "T24n1449_001:0098a05_1"
    },
    {
        "source_sentence": "此苾芻某甲，僧伽已差作張衣人。",
        "translation": "This monk, Mr. A., has been sent by the saṃgha to make a patch of robes for him.",
        "source": "T24n1449_001:0098a05_2"
    },
    {
        "source_sentence": "若僧伽時至聽者，僧伽應許僧伽今以此衣作羯恥那，付某甲苾芻。",
        "translation": "If the saṃgha agrees to listen at the time of the saṃgha, the saṃgha should allow the saṃgha to now make this robe into a khaṭṭika and give it to a certain monk or nun.",
        "source": "T24n1449_001:0098a06_3"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T24n1449_001:0098a08_4"
    },
    {
        "source_sentence": "羯磨准白應作。",
        "translation": "The karma should be done in accordance with the explanation.",
        "source": "T24n1449_001:0098a08_5"
    },
    {
        "source_sentence": "「作羯恥那衣苾芻，制其行法。",
        "translation": "He becomes a monk in the kaṭhina robe and restrains his practice.",
        "source": "T24n1449_001:0098a09_0"
    },
    {
        "source_sentence": "作衣之處，當須在前洗浣染治、割截縫刺，乃至刺三兩針共作。",
        "translation": "Where he makes his robes, he must wash, wash, dye, treat, cut, sew, and pierce them beforehand, or make three or two needles of thorns together.",
        "source": "T24n1449_001:0098a09_1"
    },
    {
        "source_sentence": "復須再三作如是念：『此衣當為僧迦張作羯恥那衣、現張作羯恥那衣、已張作羯恥那衣。』",
        "translation": "Again and again, it's necessary to repeatedly think, 'This robe will be made into a kaṭhina robe for the saṃgha that's made into a kaṭhina robe, a kaṭhina robe that's made into a kaṭhina robe in the present, or a kaṭhina robe that's already made into a kaṭhina robe.'",
        "source": "T24n1449_001:0098a11_2"
    },
    {
        "source_sentence": "於此三心，但為後二，亦成作法。",
        "translation": "The last two minds are sabhāga dharmas, that is to say, the states of absorption.",
        "source": "T24n1449_001:0098a13_3"
    },
    {
        "source_sentence": "若不作者，得惡作罪。",
        "translation": "If someone doesn't do it, they'll be guilty of misdeeds.",
        "source": "T24n1449_001:0098a13_4"
    },
    {
        "source_sentence": "次至八月白半十五日，其知事人應告大眾，作如是白：『諸大德！",
        "translation": "Next, on the fifteenth day of the eighth month, the  confessor should tell the crowd, saying, 'O great virtuous ones!'",
        "source": "T24n1449_001:0098a14_5"
    },
    {
        "source_sentence": "明日我當為眾張羯恥那衣，仁等各各捨舊持衣，來集某甲處。』",
        "translation": "'Tomorrow, I will open the kaṭhina robe for the crowd, and you'll each abandon your old carrying robes and come to gather at a certain place.'",
        "source": "T24n1449_001:0098a15_6"
    },
    {
        "source_sentence": "其張衣苾芻，於此衣上布列名花，妙香熏馥，鳴揵椎集眾，言白復周。",
        "translation": "The monk in his outer robe spreads a row of famous flowers on top of this robe, which are exquisitely fragrant and ring the bell to gather the crowd, and he says it's white again.",
        "source": "T24n1449_001:0098a17_7"
    },
    {
        "source_sentence": "可將此衣至，上座前立，兩手擎衣，作如是白：「『大德僧伽聽！",
        "translation": "You should bring this robe to him, stand in front of the superior monk, lift it with both hands, and make this statement, 'Listen, Mañjuśrī!'",
        "source": "T24n1449_001:0098a18_8"
    },
    {
        "source_sentence": "此衣僧伽許張作羯恥那衣，我苾芻某甲，僧伽今差作張羯恥那衣人。",
        "translation": "This robe is allowed by the saṃgha to be made into a khaṭṭṭika robe, and I, Mr. A. Bhikṣu, will now send it to the saṃgha as a man who makes a khaṭṭika robe.",
        "source": "T24n1449_001:0098a20_9"
    },
    {
        "source_sentence": "我某甲是張羯恥那衣，我以此衣，當為僧伽張作羯恥那衣。』",
        "translation": "I, Mr. A., am making a kaṭhina robe for you, and with this robe, I will make a kaṭhina robe for the saṃgha.'",
        "source": "T24n1449_001:0098a21_10"
    },
    {
        "source_sentence": "如是三說。",
        "translation": "These are the three teachings.",
        "source": "T24n1449_001:0098a23_11"
    },
    {
        "source_sentence": "次舒張此衣，上座前立，作如是語：『上座存念！",
        "translation": "Next, he spreads out this robe and stands in front of the superior monk, saying, 'Superior monk, keep it in mind!'",
        "source": "T24n1449_001:0098a23_12"
    },
    {
        "source_sentence": "此衣僧伽許作羯恥那衣，我苾芻某甲是張衣人。",
        "translation": "These robes are allowed by the saṃgha to be made into khaṭṭika robes, and my monk, Mr. A., is a man who spreads robes.",
        "source": "T24n1449_001:0098a24_13"
    },
    {
        "source_sentence": "我今為大眾張此衣。』",
        "translation": "Now, I'll open this robe for the masses.'",
        "source": "T24n1449_001:0098a25_14"
    },
    {
        "source_sentence": "上座答曰：『善哉張衣！",
        "translation": "The superior monk answered, 'Good, Zhang衣!'",
        "source": "T24n1449_001:0098a26_15"
    },
    {
        "source_sentence": "極善張衣！",
        "translation": "extremely good, don't you dare!",
        "source": "T24n1449_001:0098a26_16"
    },
    {
        "source_sentence": "此中所有財利饒益，我當獲之。』",
        "translation": "Whatever wealth, profit, and benefit there is here, I'll get it.'",
        "source": "T24n1449_001:0098a26_17"
    },
    {
        "source_sentence": "如是三說，乃至行末，皆作是說：『善哉張衣！",
        "translation": "Thus, these three explanations, up to the end of the practice, all say, 'Good, open your robe!'",
        "source": "T24n1449_001:0098a27_18"
    },
    {
        "source_sentence": "極善張衣！",
        "translation": "extremely good, don't you dare!",
        "source": "T24n1449_001:0098a28_19"
    },
    {
        "source_sentence": "此中所有財利饒益，我當獲之。』",
        "translation": "Whatever wealth, profit, and benefit there is here, I'll get it.'",
        "source": "T24n1449_001:0098a28_20"
    },
    {
        "source_sentence": "次復應知持衣人法，不持此衣至大小便室，不入厨舍煙火之處，不安置露地，不棄衣向界外。",
        "translation": "Next, you should also know the rules for people who carry robes. They don't carry these robes to their urinating or excreting room, don't enter a kitchen that's smoked and burned, don't place them out in the open air, and don't throw away their robes outside the boundary.",
        "source": "T24n1449_001:0098a29_21"
    },
    {
        "source_sentence": "設暫出，不應經宿。",
        "translation": "If he leaves for a short time, he shouldn't spend the night.",
        "source": "T24n1449_001:0098b02_22"
    },
    {
        "source_sentence": "持衣苾芻若不依行者，得越法罪。",
        "translation": "If a monk wearing robes doesn't rely on the practice, he'll be guilty of transgressing the Dharma.",
        "source": "T24n1449_001:0098b03_23"
    },
    {
        "source_sentence": "其持衣人，既至正月十五日，應在眾中作如是白：『大眾應知！",
        "translation": "On the fifteenth day of the first month, the person holding the robe should say this to the crowd, 'You should know!'",
        "source": "T24n1449_001:0098b03_24"
    },
    {
        "source_sentence": "明日當出羯恥那衣，仁等各各守持自衣，其有利物，大眾應分。』」",
        "translation": "On the day after tomorrow, he'll give out his khaṭṭika robe, and each of you will guard your own robes, which are advantageous things that should be shared by the public.'",
        "source": "T24n1449_001:0098b05_25"
    },
    {
        "source_sentence": "鄔波離請世尊曰：「有幾種人不成張衣？」",
        "translation": "Upāli asked the Bhagavān, How many kinds of people don't prepare their robes?",
        "source": "T24n1449_001:0098b06_26"
    },
    {
        "source_sentence": "佛言：「有五種人：謂無夏人、破夏人、後夏人、求寂人、張衣之時不現前者。",
        "translation": "The Buddha said, There are five kinds of people: those who don't have the summer retreat, those who break the summer retreat, those who follow the latter retreat, those who seek quiescence, and those who don't show up when they open their robes.",
        "source": "T24n1449_001:0098b07_27"
    },
    {
        "source_sentence": "復有五種不成張衣：謂行遍住人、行遍住竟人、行六夜人、行六夜竟人、授學人。」",
        "translation": "Again, there are five kinds of people who don't wear robes: those who practice pervasively abiding, those who practice pervasively abiding, those who practice for six nights, those who practice for six nights, and those who teach students.",
        "source": "T24n1449_001:0098b09_28"
    },
    {
        "source_sentence": "「大德！",
        "translation": "“O great virtuous one!",
        "source": "T24n1449_001:0098b10_29"
    },
    {
        "source_sentence": "有幾種人但得財利，而無饒益？」",
        "translation": "How many kinds of people simply attain wealth and profit but don't benefit?",
        "source": "T24n1449_001:0098b11_30"
    },
    {
        "source_sentence": "佛言：「有五種人：謂無夏、破夏、後夏、求寂、不現前人。",
        "translation": "The Buddha said, There are five kinds of people: those who lack summer, break up summer, stay in the latter summer, seek quiescence, and don't show their presence.",
        "source": "T24n1449_001:0098b11_31"
    },
    {
        "source_sentence": "復有五種人：行遍住人、遍住竟人、六夜人、六夜竟人、授學人，此謂得利、無饒益。」",
        "translation": "Again, there are five kinds of people: those who practice the pervasive abode, those who complete the pervasive abode, those who finish the six nights, those who finish the six nights, and those who teach students, which are called those who attain profit and those who don't benefit.",
        "source": "T24n1449_001:0098b13_0"
    },
    {
        "source_sentence": "「大德！",
        "translation": "“O great virtuous one!",
        "source": "T24n1449_001:0098b14_1"
    },
    {
        "source_sentence": "有幾種人利、益俱無？」",
        "translation": "How many kinds of people and benefits are there that are both nonexistent?",
        "source": "T24n1449_001:0098b14_2"
    },
    {
        "source_sentence": "佛言：「鄔波離！",
        "translation": "The Buddha said, Upāli!",
        "source": "T24n1449_001:0098b15_3"
    },
    {
        "source_sentence": "有五種人：謂不見罪被舉人、重犯被舉人、不捨惡見被舉人、餘處坐夏人、僧破已後非法律人。」",
        "translation": "There are five kinds of people: those who don't see faults that are lifted, those who commit serious crimes that are lifted, those who don't abandon bad views that are lifted, those who sit elsewhere in summer, and those who aren't legal after the saṃgha breaks up.",
        "source": "T24n1449_001:0098b15_4"
    },
    {
        "source_sentence": "時有眾多苾芻人間遊行，遭賊劫奪，漸至室羅筏城。",
        "translation": "A large group of monks were traveling among the people, and when they were robbed by thieves, they gradually reached the city of Śrāvastī.",
        "source": "T24n1449_001:0098b18_0"
    },
    {
        "source_sentence": "諸苾芻見問言：「善來具壽！",
        "translation": "When the monks saw him, they asked, Well come, Kauṣṭhila!",
        "source": "T24n1449_001:0098b19_1"
    },
    {
        "source_sentence": "行李安樂不？」",
        "translation": "Is the bag comfortable?",
        "source": "T24n1449_001:0098b19_2"
    },
    {
        "source_sentence": "答言：「何有安樂？",
        "translation": "He replied, How could there be peace and comfort?",
        "source": "T24n1449_001:0098b20_3"
    },
    {
        "source_sentence": "所是衣物，皆被賊奪將。」",
        "translation": "All of these clothes and things are taken by thieves and generals.",
        "source": "T24n1449_001:0098b20_4"
    },
    {
        "source_sentence": "報言：「具壽！",
        "translation": "He replied, Kauṣṭhila!",
        "source": "T24n1449_001:0098b21_5"
    },
    {
        "source_sentence": "今我此處多有衣利，若出羯恥那衣，得與具壽共相分給。」",
        "translation": "Now, there's a lot of clothing and benefits for me here, so if I give out my khaṭṭika robe, I'll be able to share it with the rest of my life.",
        "source": "T24n1449_001:0098b21_6"
    },
    {
        "source_sentence": "以緣白佛，佛言：「苾芻若有賊緣，當可為出羯恥那衣。",
        "translation": "He told the Buddha for this reason, and he said, If a monk has the thief's condition, he can remove his khaṭṭika robe for him.",
        "source": "T24n1449_001:0098b22_7"
    },
    {
        "source_sentence": "應如是出，如常作前方便已，令一苾芻作白羯磨：『大德僧伽聽！",
        "translation": "You should thus come out, as usual, and after performing the previous method, cause one monk to make a statement of karma, 'Listen, Mañjuśrī!'",
        "source": "T24n1449_001:0098b23_8"
    },
    {
        "source_sentence": "於此住處，和合僧伽共張羯恥那衣。",
        "translation": "At this dwelling place, the combined saṃgha shared the kaṭhina robe.",
        "source": "T24n1449_001:0098b25_9"
    },
    {
        "source_sentence": "今有眾多苾芻，被賊所劫無衣至此。",
        "translation": "Now, there are many monks who have been robbed by thieves and come here without robes.",
        "source": "T24n1449_001:0098b26_0"
    },
    {
        "source_sentence": "若僧伽時至聽者，僧伽應許僧伽今為此被賊苾芻出羯恥那衣。",
        "translation": "If the saṃgha arrives at the time of the saṃgha and listens, the saṃgha should allow the saṃgha to give up the khaṭṭika robe for this thief monk's sake.",
        "source": "T24n1449_001:0098b26_1"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T24n1449_001:0098b28_2"
    },
    {
        "source_sentence": "羯磨准白成，乃至結竟。",
        "translation": "The karma follows the completion of the confession, up to the end of the fetters.",
        "source": "T24n1449_001:0098b28_3"
    },
    {
        "source_sentence": "既作法已，所有利物，受衣之人皆共平分。",
        "translation": "After performing the ritual, they'll share all the benefits of their possessions with the person who receives the robe.",
        "source": "T24n1449_001:0098b29_0"
    },
    {
        "source_sentence": "其所得衣，各隨自意，分遺被賊無衣苾芻。」",
        "translation": "Each of the garments he obtains follows his own wishes, and they are given to a thief or monk without robes who leaves them behind.",
        "source": "T24n1449_001:0098b29_1"
    },
    {
        "source_sentence": "鄔波離請世尊曰：「大德！",
        "translation": "Upāli asked the Bhagavān, Mañjuśrī!",
        "source": "T24n1449_001:0098c01_2"
    },
    {
        "source_sentence": "疎薄衣、惡衣、多結衣、紵麻衣、繚緣衣、破故衣、犯捨衣、死人衣，此等諸衣合作羯恥那不？」",
        "translation": "What are the thin robes, bad robes, much fettered robes, hemp robes, rag robes, broken old robes, robes for crimes, and robes for dead people, and these robes that cooperate with kaṭhina?",
        "source": "T24n1449_001:0098c02_3"
    },
    {
        "source_sentence": "佛言：「不合。」",
        "translation": "The Buddha said, It doesn't fit.",
        "source": "T24n1449_001:0098c04_4"
    },
    {
        "source_sentence": "「大德！",
        "translation": "“O great virtuous one!",
        "source": "T24n1449_001:0098c05_0"
    },
    {
        "source_sentence": "石碾衣、及屬別人三衣、及不滿三五肘、或不割截、或不清淨、或不差張衣人、或在界外，得張衣不？」",
        "translation": "Is it possible to open a rock-ground robe, three robes belonging to someone else, or a robe that's not more than three or five elbows long, which isn't cut off, doesn't look impure, doesn't differ from the person who opens the robe, or is outside the boundary?",
        "source": "T24n1449_001:0098c05_1"
    },
    {
        "source_sentence": "佛言：「不合。」",
        "translation": "The Buddha said, It doesn't fit.",
        "source": "T24n1449_001:0098c07_2"
    },
    {
        "source_sentence": "「夏三月中所得衣，成張衣不？」",
        "translation": "Is the robe obtained in the three months of summer made into a garment?",
        "source": "T24n1449_001:0098c07_3"
    },
    {
        "source_sentence": "佛言：「得。」",
        "translation": "The Buddha said, Yes.",
        "source": "T24n1449_001:0098c08_4"
    },
    {
        "source_sentence": "「若夏三月了，所得之衣得作羯恥那衣不？」",
        "translation": "If the three months of summer have passed, will the garments you've obtained be made into khaṭṭṭika robes?",
        "source": "T24n1449_001:0098c08_5"
    },
    {
        "source_sentence": "佛言：「得。」",
        "translation": "The Buddha said, Yes.",
        "source": "T24n1449_001:0098c09_6"
    },
    {
        "source_sentence": "若更有眾多法非法衣，准上文意應知。",
        "translation": "If there are many other things that are unlawful in terms of the Dharma, they should be known according to the meaning of the above.",
        "source": "T24n1449_001:0098c09_7"
    },
    {
        "source_sentence": "出羯恥那衣相，本有八種。",
        "translation": "There are originally eight kinds of kaṭhina robes.",
        "source": "T24n1449_001:0098c11_0"
    },
    {
        "source_sentence": "云何為八？",
        "translation": "What are the eight?",
        "source": "T24n1449_001:0098c11_1"
    },
    {
        "source_sentence": "　初決去不定、　　決定失去衣、",
        "translation": "The first decides to leave indeterminately, determines to lose their robes,",
        "source": "T24n1449_001:0098c11_2"
    },
    {
        "source_sentence": "　聞出出界疑、　　望斷同心出。",
        "translation": "Hearing and leaving the realm of doubt, he expects to be freed by the same mind.",
        "source": "T24n1449_001:0098c11_2"
    },
    {
        "source_sentence": "攝頌曰：云何決去失？",
        "translation": "The Summary verse says, How do we determine the error of removal?",
        "source": "T24n1449_001:0098c11_2"
    },
    {
        "source_sentence": "如有苾芻，同在一處受羯恥那衣。",
        "translation": "Suppose there's a monk who shares the same place where he receives the khaṭṭika robe.",
        "source": "T24n1449_001:0098c14_3"
    },
    {
        "source_sentence": "作衣已竟，於此無戀心，遂持衣鉢欲往餘方，出界外更不擬來，決意出者，是名決去失。",
        "translation": "When he finishes making his robes, he doesn't cling to them, so he takes his robe and bowl, wants to go to another place, leaves the boundary, doesn't intend to come back, and decides to leave.",
        "source": "T24n1449_001:0098c15_4"
    },
    {
        "source_sentence": "云何不定失？",
        "translation": "What's the indeterminate error?",
        "source": "T24n1449_001:0098c17_5"
    },
    {
        "source_sentence": "如有苾芻，同在一處受羯恥那衣，未作衣遂出界外求衣，或未作衣、或已作半，於此利物及以住處，或有戀、或無戀、或有望、或無望，更擬還作衣、或起疑念，是名不定失。",
        "translation": "Suppose a monk who is in the same place and accepts a khaṭṭika robe that hasn't been made but then goes outside the boundary to search for a robe or a robe that hasn't been made or half-finished, either because he wants to benefit things here or where he lives, or because there's an attachment, or no attachment, or hope, or no hope, and intends to return",
        "source": "T24n1449_001:0098c17_6"
    },
    {
        "source_sentence": "云何決定失？",
        "translation": "What's a definite error?",
        "source": "T24n1449_001:0098c22_0"
    },
    {
        "source_sentence": "如有苾芻，同在一處受羯恥那衣，未作衣遂出界外求衣，作如是念：「還來作衣。」",
        "translation": "Suppose a monk who's in the same place and accepts a khaṭṭika robe, leaves outside the boundary to search for a robe before he makes a robe, and thinks, I'll make a robe back.",
        "source": "T24n1449_001:0098c22_1"
    },
    {
        "source_sentence": "復作是念：「我今出去，更不復來，亦復不能造支伐羅。」",
        "translation": "Again, he thought, Now that I'm going out, I won't come back, and I won't create any more treasures.",
        "source": "T24n1449_001:0098c24_2"
    },
    {
        "source_sentence": "是名決定失。",
        "translation": "This is called a definite error.",
        "source": "T24n1449_001:0098c25_3"
    },
    {
        "source_sentence": "云何失去失？",
        "translation": "What's lost?",
        "source": "T24n1449_001:0098c26_0"
    },
    {
        "source_sentence": "如有苾芻，同在一處受羯恥那衣，未作衣出界外造支伐羅，起首作衣，遂失其衣，是名失去失。",
        "translation": "Suppose a monk were to accept the khaṭṭika robe at one place and leaves without making a robe outside the boundary to make a caīvara, starts making a robe, and then loses his robe, which is called loss.",
        "source": "T24n1449_001:0098c26_1"
    },
    {
        "source_sentence": "云何聞出失？",
        "translation": "What's the loss of hearing and leaving?",
        "source": "T24n1449_001:0098c29_0"
    },
    {
        "source_sentence": "如有苾芻，同在一處受羯恥那衣，未作衣出界外求衣，念言：「迴還我當作衣。」",
        "translation": "Suppose a monk who's in the same place and accepts a kaṭhina robe without making a robe outside the boundary and asks for a robe, thinking, Give it back to me to make a robe.",
        "source": "T24n1449_001:0098c29_1"
    },
    {
        "source_sentence": "去後大眾遂便出衣。",
        "translation": "After he left, the crowd then took off their robes.",
        "source": "T24n1449_001:0099a02_0"
    },
    {
        "source_sentence": "彼聞出羯恥那衣，心生隨喜：「善哉出衣。」",
        "translation": "When they heard that he produced the kaṭhina robe, their hearts became joyous and rejoiced, Good, producing a robe.",
        "source": "T24n1449_001:0099a02_1"
    },
    {
        "source_sentence": "是名聞出失。",
        "translation": "This is called hearing out and losing.",
        "source": "T24n1449_001:0099a03_2"
    },
    {
        "source_sentence": "云何出界疑失？",
        "translation": "What's the error of leaving the realm of doubt?",
        "source": "T24n1449_001:0099a03_3"
    },
    {
        "source_sentence": "如有苾芻，同在一處受羯恥那衣。",
        "translation": "Suppose there's a monk who shares the same place where he receives the khaṭṭika robe.",
        "source": "T24n1449_001:0099a04_0"
    },
    {
        "source_sentence": "未作衣，苾芻自念：「出界作支伐羅。",
        "translation": "Before he made his robes, the monk thought to himself, Exit the boundary and make a chevara.",
        "source": "T24n1449_001:0099a04_1"
    },
    {
        "source_sentence": "若了、若不了，或還、不還。」",
        "translation": "Whether they understand it or don't understand it, they may or may not return.",
        "source": "T24n1449_001:0099a05_2"
    },
    {
        "source_sentence": "生如是心，出界便失。",
        "translation": "When such a mind arises, it's lost when it leaves the boundary.",
        "source": "T24n1449_001:0099a06_3"
    },
    {
        "source_sentence": "云何望斷失？",
        "translation": "What's the hope for cessation and loss?",
        "source": "T24n1449_001:0099a06_4"
    },
    {
        "source_sentence": "如有苾芻，同在一處受羯恥那衣作衣，作衣未竟，出界求覓，擬還作衣。",
        "translation": "Suppose a monk were to accept a kaṭhina robe and make a robe in one place, but before he finished making a robe, he left the boundary to search for it and intended to return to make a robe.",
        "source": "T24n1449_001:0099a06_5"
    },
    {
        "source_sentence": "既至彼方，求衣不得，望心斷絕，是名望斷失。",
        "translation": "When he reaches that place, he doesn't obtain his robes and hopes to cut off his mind, which is called the loss of hope.",
        "source": "T24n1449_001:0099a08_6"
    },
    {
        "source_sentence": "云何同心出？",
        "translation": "How are they produced in the same mind?",
        "source": "T24n1449_001:0099a10_0"
    },
    {
        "source_sentence": "如有苾芻，同在一處受羯恥那衣作衣，出界外求衣，後還來住處，共眾作白二法出衣，是名同心出。",
        "translation": "Suppose there's a monk who shares the same place where he receives the khaṭṭika robe and makes a robe, leaves outside the boundary to ask for a robe, returns back to his dwelling place, produces a robe together with the two ways to make a confession, which is called producing a robe with the same mind.",
        "source": "T24n1449_001:0099a10_1"
    },
    {
        "source_sentence": "根本說一切有部毘奈耶羯恥那衣事一卷",
        "translation": "Mūlasarvâstivāda-sūtra, Vinaya-kaṭhina's Conditions for the Garment of the Sarvâstivāda school in One Volume",
        "source": "T24n1449_001:0099a13_0"
    }
]