[
    {
        "source_sentence": "毘尼母經卷第二",
        "translation": "*Mother of the Vinaya, Volume 2",
        "source": "T24n1463_002:0807a04_0"
    },
    {
        "source_sentence": "失譯人名今附秦錄",
        "translation": "The names of the lost translators are now appended to the Qin records.",
        "source": "T24n1463_002:0807a06_0"
    },
    {
        "source_sentence": "「尼遣使受戒中，佛在世時唯有一女得。",
        "translation": "When the nun sent an envoy to receive the precepts, there was only one woman who attained them while the Buddha was in the world.",
        "source": "T24n1463_002:0807a07_0"
    },
    {
        "source_sentence": "所以得者，但此女顏容挺特世所無比，若往者恐惡人抄略，是故佛聽。",
        "translation": "The reason it's obtained is because this woman's appearance is so extraordinary that it's unsurpassed in the world, and if you go there, you're afraid bad people will copy it; therefore, the Buddha will listen.",
        "source": "T24n1463_002:0807a07_1"
    },
    {
        "source_sentence": "今時若有如是比者，可得遣使受戒，其餘一切要現前得具，不現前不得。",
        "translation": "If there's such a comparison at the present time, they can send an envoy to receive the precepts, and all the other things that need to be attained in front of them are not attained in front of them.",
        "source": "T24n1463_002:0807a09_2"
    },
    {
        "source_sentence": "「師法受具中，除憍曇彌五百諸女，其餘一切不得師法受具。",
        "translation": "Among the five hundred women of Kātyāmī, except for the five hundred women of Kātyāmī, all the other women weren't allowed to receive the master's instructions.",
        "source": "T24n1463_002:0807a11_3"
    },
    {
        "source_sentence": "「上受具中，除尊者摩訶迦葉蘇陀耶，其餘一切不得建立善法上受具。",
        "translation": "Among the above-mentioned precepts, except for Venerable Mahākāśyapa Sudarśana, all the other precepts that don't establish good qualities can be received upward.",
        "source": "T24n1463_002:0807a12_4"
    },
    {
        "source_sentence": "「若男子女人其性調善，慧亦明了，無有諸難，得受具足。",
        "translation": "“If a man or woman is well-regulated by nature and well-adjusted, he or she also has insight. There are no difficulties in gaining full ordination.",
        "source": "T24n1463_002:0807a14_5"
    },
    {
        "source_sentence": "復有三人不得受具：一不自稱字；",
        "translation": "Again, there are three kinds of people who cannot receive the ordination:",
        "source": "T24n1463_002:0807a15_6"
    },
    {
        "source_sentence": "二不稱和上字；",
        "translation": "The second is that they do not proclaim the word harmonious.",
        "source": "T24n1463_002:0807a16_7"
    },
    {
        "source_sentence": "三不乞戒。",
        "translation": "Three, the precept against not begging.",
        "source": "T24n1463_002:0807a16_8"
    },
    {
        "source_sentence": "此三種人不得受具；",
        "translation": "These three kinds of people are not allowed to receive the ordination.",
        "source": "T24n1463_002:0807a16_9"
    },
    {
        "source_sentence": "與此相違得受具足。",
        "translation": "Contrary to this, they'll attain full ordination.",
        "source": "T24n1463_002:0807a17_10"
    },
    {
        "source_sentence": "復有五人可受具足：一成就丈夫；",
        "translation": "“Furthermore, there are five people who can be ordained:",
        "source": "T24n1463_002:0807a17_11"
    },
    {
        "source_sentence": "二不負債；",
        "translation": "The second is the principle of not being in debt.",
        "source": "T24n1463_002:0807a18_12"
    },
    {
        "source_sentence": "三不是人奴；",
        "translation": "The third is not a human slave.",
        "source": "T24n1463_002:0807a18_13"
    },
    {
        "source_sentence": "四年滿二十；",
        "translation": "The fourth year was twenty years in duration.",
        "source": "T24n1463_002:0807a19_0"
    },
    {
        "source_sentence": "五父母放出家。",
        "translation": "Five, his parents released him from home.",
        "source": "T24n1463_002:0807a19_1"
    },
    {
        "source_sentence": "是五種人得受具足。",
        "translation": "These are the five kinds of people who attain endowment.",
        "source": "T24n1463_002:0807a19_2"
    },
    {
        "source_sentence": "復有五處，白四羯磨受戒滿足。",
        "translation": "Again, there are five places where he tells the four karmas to receive the full set of precepts.",
        "source": "T24n1463_002:0807a20_3"
    },
    {
        "source_sentence": "何者五？",
        "translation": "What are these five?",
        "source": "T24n1463_002:0807a20_4"
    },
    {
        "source_sentence": "一者和上；",
        "translation": "The first is the supreme one.",
        "source": "T24n1463_002:0807a21_0"
    },
    {
        "source_sentence": "二者阿闍梨；",
        "translation": "The second is the preceptor.",
        "source": "T24n1463_002:0807a21_1"
    },
    {
        "source_sentence": "三眾僧具足；",
        "translation": "The third is the endowment of all the Sangha.",
        "source": "T24n1463_002:0807a21_2"
    },
    {
        "source_sentence": "四性調順；",
        "translation": "The fourth is naturally harmonious.",
        "source": "T24n1463_002:0807a21_3"
    },
    {
        "source_sentence": "五諸根具足無諸障礙。",
        "translation": "The five faculties are fully endowed without any hindrances.",
        "source": "T24n1463_002:0807a22_4"
    },
    {
        "source_sentence": "是名五處受戒滿足；",
        "translation": "These are called the five places where one receives the full set of precepts.",
        "source": "T24n1463_002:0807a22_5"
    },
    {
        "source_sentence": "與五人相違不得受具。",
        "translation": "It's at odds with the five people who won't be allowed to receive the precepts.",
        "source": "T24n1463_002:0807a23_6"
    },
    {
        "source_sentence": "復有二人不聽受具：一者有業障；",
        "translation": "“Furthermore, there are two kinds of people who will not be allowed to receive the precepts:",
        "source": "T24n1463_002:0807a23_7"
    },
    {
        "source_sentence": "二者龍變為人。",
        "translation": "Two, the dragon transforms into a human being.",
        "source": "T24n1463_002:0807a24_8"
    },
    {
        "source_sentence": "若先不知與受戒，後時知應擯出眾。",
        "translation": "If someone first doesn't know the precepts and receive them, they'll be known to leave the congregation at a later time.",
        "source": "T24n1463_002:0807a24_9"
    },
    {
        "source_sentence": "先知，不應與受戒。",
        "translation": "Knowing beforehand, they shouldn't be given the precepts.",
        "source": "T24n1463_002:0807a25_10"
    },
    {
        "source_sentence": "如上十三比類應廣知。",
        "translation": "The above-mentioned 13 categories should be understood in detail.",
        "source": "T24n1463_002:0807a26_0"
    },
    {
        "source_sentence": "復有一人不應受具，此身上忽生白色，生已復滅。",
        "translation": "Again, there's another person who shouldn't receive the precepts, and white whiteness suddenly appears on his body, which ceases again after being born.",
        "source": "T24n1463_002:0807a26_1"
    },
    {
        "source_sentence": "若先知，不應與受具。",
        "translation": "If you know it beforehand, you shouldn't give it to someone who receives the requisites.",
        "source": "T24n1463_002:0807a27_2"
    },
    {
        "source_sentence": "若不知已受具竟，後時雖知，不應驅出眾。",
        "translation": "If someone doesn't know they've received the full set of precepts, then even though they know them later, they shouldn't drive out the crowd.",
        "source": "T24n1463_002:0807a28_3"
    },
    {
        "source_sentence": "「云何為業？",
        "translation": "What's karma?",
        "source": "T24n1463_002:0807b01_0"
    },
    {
        "source_sentence": "思業、行業、可思業，故思業非可思業。",
        "translation": "Action resulting from thinking is action, action resulting from thinking and action that is to be thought of. Therefore, action resulting from thinking is no action that is to be thought of.",
        "source": "T24n1463_002:0807b01_1"
    },
    {
        "source_sentence": "可受業不可受業、少受業多受業、已受業未受業、色業非色業、可見業不可見業、有對業無對業、聖業世間業，現身受業、生受業、後受業，趣惡業、趣天業、趣涅槃業。",
        "translation": "karma that can be received and karma that can't be received, karma that's received little and often received, karma that's already received and karma that's not yet received, form actions that aren't form actions, visible actions that are invisible, opposable actions that are opposable, noble actions that are worldly actions, action that's received in the present body, action that's received in birth, action that'",
        "source": "T24n1463_002:0807b02_2"
    },
    {
        "source_sentence": "有三業，一切諸業攝在其中：白業、白第二業、白第四業。",
        "translation": "There are three actions, in which all actions are included: white action, white second action, and white fourth action.",
        "source": "T24n1463_002:0807b05_3"
    },
    {
        "source_sentence": "復有四業：非法作業、法作業、群共作業、業齊集作業。",
        "translation": "Again, there are four kinds of karma: unlawful karma, Dharma karma, group karma, shared karma, and karma that's collected together.",
        "source": "T24n1463_002:0807b06_4"
    },
    {
        "source_sentence": "復有四種業：有比丘群業、共作非法羯磨齊集業、共作非法羯磨群共業、作法羯磨齊集業。",
        "translation": "Again, there are four kinds of karma: a monk's group karma, the karma that gathers karma with shared unlawful karma, the karma that gathers karma with shared unlawful karma, the karma that gathers karma with shared unlawful karma, and the karma that gathers karma with shared dharma karma.",
        "source": "T24n1463_002:0807b08_5"
    },
    {
        "source_sentence": "作法羯磨，此中非法業、群共業，諸比丘不應作。",
        "translation": "He performs a dharma-karma, which is an unlawful action or a shared action among the groups of actions, and the monks shouldn't do it.",
        "source": "T24n1463_002:0807b10_6"
    },
    {
        "source_sentence": "非法業、齊集業，此二業不應作。",
        "translation": "What's unlawful and what's collected together shouldn't be done by these two kinds of actions.",
        "source": "T24n1463_002:0807b11_7"
    },
    {
        "source_sentence": "法業、群品業，亦不應作。",
        "translation": "karma of the doctrine and karma of all classes should also not be done.",
        "source": "T24n1463_002:0807b11_8"
    },
    {
        "source_sentence": "法業、齊集業，此二業應作，吾所聽之。",
        "translation": "These two actions should be done, and I'll listen to them.",
        "source": "T24n1463_002:0807b12_9"
    },
    {
        "source_sentence": "此中有三種應當知：一者白業；",
        "translation": "Of these, it should be known that there are three kinds:",
        "source": "T24n1463_002:0807b13_10"
    },
    {
        "source_sentence": "二者擯罰業；",
        "translation": "The second is the action of sexual misconduct.",
        "source": "T24n1463_002:0807b14_11"
    },
    {
        "source_sentence": "三非白非擯罰業。",
        "translation": "Three, it's not white and not a punishable act of anger.",
        "source": "T24n1463_002:0807b14_12"
    },
    {
        "source_sentence": "云何名為白業？",
        "translation": "What's called white karma?",
        "source": "T24n1463_002:0807b14_13"
    },
    {
        "source_sentence": "白已剃髮受沙彌戒，乃至大比丘戒亦先白後受。",
        "translation": "After confessing, he shaved his hair and accepted the śrāmaṇer precepts, and so forth, up to the great monk's precepts were also confessed before they were accepted.",
        "source": "T24n1463_002:0807b15_14"
    },
    {
        "source_sentence": "若不聽，不得受比丘法。",
        "translation": "If you don't listen, you won't be allowed to receive the monk's teaching.",
        "source": "T24n1463_002:0807b16_15"
    },
    {
        "source_sentence": "一切皆如是。",
        "translation": "All of them are like this.",
        "source": "T24n1463_002:0807b16_16"
    },
    {
        "source_sentence": "若有所作，要白眾僧，聽得，不聽不得作，是故名為白業羯磨。",
        "translation": "If someone does something, they must tell the saṃgha that they'll be allowed to hear it and won't do it if they don't hear it, which is therefore called a white karma karma karma karma.",
        "source": "T24n1463_002:0807b17_17"
    },
    {
        "source_sentence": "云何名為擯罰羯磨？",
        "translation": "What's called the karman of punishment?",
        "source": "T24n1463_002:0807b18_18"
    },
    {
        "source_sentence": "若有比丘不順佛語，或自白僧或他白僧，僧集隨其罪輕重，眾訶責擯出。",
        "translation": "If a monk doesn't obey the Buddha's words, either tells the saṃgha for himself or tells the saṃgha for others, and the saṃgha gathers together according to the seriousness of his crimes, and the congregation reprimanded him and expelled him.",
        "source": "T24n1463_002:0807b18_19"
    },
    {
        "source_sentence": "或有人擯罰，罪負未訖更重作之，眾僧亦更重訶責。",
        "translation": "If someone is subject to punishment, and their offense has not yet been completed and they repeat it again, the saṃgha will also repeatedly reprimand them.",
        "source": "T24n1463_002:0807b20_20"
    },
    {
        "source_sentence": "如此之類皆名擯罰業也。",
        "translation": "These kinds of actions are all called crude and punitive actions.",
        "source": "T24n1463_002:0807b21_21"
    },
    {
        "source_sentence": "云何名為不白不擯罰？",
        "translation": "What's called not confessing and not punishing?",
        "source": "T24n1463_002:0807b22_22"
    },
    {
        "source_sentence": "若有比丘，僧差營房舍，此業非白亦非擯罰。",
        "translation": "Suppose there's a monk who sends a monk to build a dwelling for the saṃgha, and this action isn't white or punishable by sexual misconduct.",
        "source": "T24n1463_002:0807b23_0"
    },
    {
        "source_sentence": "又復此人，僧初與羯磨立作營房人，是亦非白非擯罰。",
        "translation": "Again, this person who first establishes a camper for the saṃgha and karma as a camper is also not white or black-white in punishment.",
        "source": "T24n1463_002:0807b24_0"
    },
    {
        "source_sentence": "是業名為非白非擯罰。",
        "translation": "This is called an action that's neither white nor black and not a punishment.",
        "source": "T24n1463_002:0807b25_1"
    },
    {
        "source_sentence": "又復解羯磨非一。",
        "translation": "Furthermore, he understands that the karma is not one and the same.",
        "source": "T24n1463_002:0807b25_2"
    },
    {
        "source_sentence": "如羯磨亡比丘物，此羯磨非白非擯罰，是故有異。",
        "translation": "It's like the karma that deceases a monk's property, and this karma is neither white nor punishable by anger; therefore, there's a difference.",
        "source": "T24n1463_002:0807b26_3"
    },
    {
        "source_sentence": "受功德衣羯磨亦如是。",
        "translation": "It's likewise when he receives the karman of the robe of merit.",
        "source": "T24n1463_002:0807b27_4"
    },
    {
        "source_sentence": "如結大界羯磨、淨地羯磨，如此等不在白擯罰羯磨也。",
        "translation": "It's like the great bound karma and the pure ground karma, which aren't part of the white patched punishment karma.",
        "source": "T24n1463_002:0807b27_5"
    },
    {
        "source_sentence": "「復有二種羯磨：一為人；",
        "translation": "Again, there are two kinds of ordination:",
        "source": "T24n1463_002:0807b29_6"
    },
    {
        "source_sentence": "二為法。",
        "translation": "The second is the Dharma.",
        "source": "T24n1463_002:0807b29_7"
    },
    {
        "source_sentence": "何等為法羯磨？",
        "translation": "What's the Dharma karma?",
        "source": "T24n1463_002:0807b29_8"
    },
    {
        "source_sentence": "如白已說波羅提木叉戒自恣，如平僧坊地、差營事人、差分衣鉢人，如為受迦絺那衣、捨迦絺那衣、結界捨界、離衣宿。",
        "translation": "As you've said, the prātimokṣa precepts are self-restraint, such as accepting a kaṭhina robe, abandoning a kaṭhina robe, forming a boundary, abandoning a boundary, and parting with your robes for the night.",
        "source": "T24n1463_002:0807c01_9"
    },
    {
        "source_sentence": "先布薩却安居者，諸比丘檀越請安居。",
        "translation": "Those who previously absoled from their retreat are invited to retreat by the monks and donors.",
        "source": "T24n1463_002:0807c03_10"
    },
    {
        "source_sentence": "安居日滿，比丘尼為飲食美故不去，檀越心生疲厭。",
        "translation": "When the day of his retreat was over, the monks and nuns didn't go out for the sake of food and drink, and the donor became weary.",
        "source": "T24n1463_002:0807c04_11"
    },
    {
        "source_sentence": "諸比丘即往白佛。",
        "translation": "The monks then went to the Buddha and told him.",
        "source": "T24n1463_002:0807c05_12"
    },
    {
        "source_sentence": "佛即制：安居竟，比丘尼若過一日，波逸提。",
        "translation": "The Buddha then made a rule: If a monk or nun goes beyond one day after the end of his retreat, pratyekabuddha.",
        "source": "T24n1463_002:0807c06_13"
    },
    {
        "source_sentence": "若大比丘，突吉羅。",
        "translation": "If a great monk, it's a grave offense.",
        "source": "T24n1463_002:0807c07_14"
    },
    {
        "source_sentence": "齊集自恣，問法答法、問毘尼答毘尼。",
        "translation": "They gathered together for self-restraint to ask questions about the Dharma and answer the Dharma, and they asked questions about the vinaya and answered the vinaya.",
        "source": "T24n1463_002:0807c07_15"
    },
    {
        "source_sentence": "問法者迦葉是，答法者阿難是。",
        "translation": "The one who asked the Dharma was Kāśyapa, and the one who answered the Dharma was Ānanda.",
        "source": "T24n1463_002:0807c08_16"
    },
    {
        "source_sentence": "問毘尼者迦葉是，答毘尼者優波離是。",
        "translation": "He asked, Vinaya is Kāśyapa, and he answered, Vinaya is Upāli.",
        "source": "T24n1463_002:0807c09_17"
    },
    {
        "source_sentence": "俱名依法羯磨。",
        "translation": "They're both called the Dharma-dharma karma.",
        "source": "T24n1463_002:0807c09_18"
    },
    {
        "source_sentence": "云何名依人羯磨？",
        "translation": "What's called the person-dependent karma?",
        "source": "T24n1463_002:0807c10_19"
    },
    {
        "source_sentence": "如度沙彌法，先白後剃髮受戒。",
        "translation": "It's like the method of liberating a novice who first confesses and then shaves his hair to receive the precepts.",
        "source": "T24n1463_002:0807c10_20"
    },
    {
        "source_sentence": "如行波利婆沙日未滿更犯，還行本事，行摩那埵、行阿浮訶那，與現前毘尼、憶念毘尼。",
        "translation": "Suppose he returns to his original duty on the day before the day when he practices parivāsa and violates it again, practices manas and abhidharma, and gives them the present vinaya and mindfulness of vinaya.",
        "source": "T24n1463_002:0807c11_21"
    },
    {
        "source_sentence": "因闥婆摩羅子被謗故，佛制憶念毘尼。",
        "translation": "Because the Kauśāma-malāputra was denigrated, the Buddha established a system of recollection and a vinaya.",
        "source": "T24n1463_002:0807c13_22"
    },
    {
        "source_sentence": "因難提伽比丘本清淨心受戒，失心所作違於毘尼。",
        "translation": "Because the monk Nandika had originally received the precepts with a pure mind, he lost his mind and did something contrary to the vinaya.",
        "source": "T24n1463_002:0807c14_23"
    },
    {
        "source_sentence": "後還得本心，諸比丘謗言犯罪。",
        "translation": "Later, when they returned to their original minds, the monks denigrated them and committed crimes.",
        "source": "T24n1463_002:0807c15_24"
    },
    {
        "source_sentence": "此比丘自言：『我本失心時，所作不覺不知。』",
        "translation": "This monk said to himself, 'When I lost my mind in the past, I didn't know what I did.'",
        "source": "T24n1463_002:0807c16_25"
    },
    {
        "source_sentence": "佛言：『癡狂心所作不犯。』",
        "translation": "The Buddha said, 'It's not a violation to do what's done with a deluded mind.'",
        "source": "T24n1463_002:0807c17_0"
    },
    {
        "source_sentence": "是故此比丘從眾僧乞不癡毘尼。",
        "translation": "That's why this monk begged the saṃgha and didn't forget the vinaya.",
        "source": "T24n1463_002:0807c17_1"
    },
    {
        "source_sentence": "「云何名自知比丘？",
        "translation": "What's called a monk who knows for himself?",
        "source": "T24n1463_002:0807c18_2"
    },
    {
        "source_sentence": "佛在世時常自說戒。",
        "translation": "When the Buddha was in the world, he always explained the precepts for himself.",
        "source": "T24n1463_002:0807c18_3"
    },
    {
        "source_sentence": "忽至說戒日，說戒時至，初夜中夜諸比丘請佛說戒，佛默然不說。",
        "translation": "Suddenly, on the day of preaching the precepts, when the time for preaching the precepts arrived, the monks in the first watch of the night and midnight invited the Buddha to preach the precepts, but he remained silent and didn't explain them.",
        "source": "T24n1463_002:0807c19_4"
    },
    {
        "source_sentence": "目連以天眼觀此眾中誰不清淨，佛不說也。",
        "translation": "Maudgalyāyana observed with the divine eye who among these people was impure, but the Buddha didn't explain it.",
        "source": "T24n1463_002:0807c20_5"
    },
    {
        "source_sentence": "見一比丘不清淨。",
        "translation": "He saw a monk who was impure.",
        "source": "T24n1463_002:0807c21_6"
    },
    {
        "source_sentence": "目連即起捉臂牽出。",
        "translation": "Maudgalyāyana then rose, grabbed it by the arm, and pulled it out.",
        "source": "T24n1463_002:0807c22_7"
    },
    {
        "source_sentence": "佛即告目連言：『何以不審？",
        "translation": "The Buddha then addressed Maudgalyāyana, saying, 'Why don't you examine it?'",
        "source": "T24n1463_002:0807c22_8"
    },
    {
        "source_sentence": "悉問之。",
        "translation": "They all asked him about it.",
        "source": "T24n1463_002:0807c23_9"
    },
    {
        "source_sentence": "諸比丘應自知，所以初夜中夜佛不言者，外有惡賊故爾。』",
        "translation": "The monks should know for themselves why the Buddha didn't say anything in the first watch of the night at midnight, because there were bad thieves outside.'",
        "source": "T24n1463_002:0807c23_10"
    },
    {
        "source_sentence": "爾時舍衛國諸比丘鬪訟，此應滅之。",
        "translation": "It was then that the monks of Śrāvastī argued, and this should be extinguished.",
        "source": "T24n1463_002:0807c24_11"
    },
    {
        "source_sentence": "云何得滅？",
        "translation": "How do they attain cessation?",
        "source": "T24n1463_002:0807c25_12"
    },
    {
        "source_sentence": "眾中三藏比丘，當取其語和合滅之。",
        "translation": "In the assembly, the Tripiṭaka monks of the three collections should take their words and combine them to extinguish them.",
        "source": "T24n1463_002:0807c25_13"
    },
    {
        "source_sentence": "有比丘字訶德，有風熱亂心故，與諸外道論義，言辭錯亂前後不定，為外道所笑。",
        "translation": "A monk named Hatthaka had a wind and fever that disturbed his mind, and he argued with non-Buddhists about the meaning of the treatise. Their words were in disorder before and after each other; they laughed at him.",
        "source": "T24n1463_002:0807c26_14"
    },
    {
        "source_sentence": "諸比丘白佛。",
        "translation": "The monks said to the Buddha,",
        "source": "T24n1463_002:0807c28_15"
    },
    {
        "source_sentence": "佛呼此比丘在前，語言：『汝莫亂心故與人論議。",
        "translation": "The Buddha summoned the monk who was in front of him and said, 'Don't disturb your mind; therefore, don't discuss it with someone.",
        "source": "T24n1463_002:0807c28_16"
    },
    {
        "source_sentence": "言應定實。』",
        "translation": "They say it should be determined to be real.'",
        "source": "T24n1463_002:0807c29_17"
    },
    {
        "source_sentence": "現前訶責現前滅之。",
        "translation": "He'll be reprimanded in the present and extinguished in the present.",
        "source": "T24n1463_002:0808a01_0"
    },
    {
        "source_sentence": "爾時舍衛國諸比丘諍訟，佛告諸比丘：『各各相向五體投地，如草敷地滅所諍訟，犯事後當懺悔除滅。』",
        "translation": "It was then that the monks of Śrāvastī argued, and the Buddha addressed the monks, Each facing toward the other five bodies and throwing themselves to the ground like grass spreading on the ground to extinguish their disputes, and after doing so, they will repent and remove them.'",
        "source": "T24n1463_002:0808a02_0"
    },
    {
        "source_sentence": "從訶責羯磨乃至知種種雜物人羯磨，此是依人羯磨。",
        "translation": "From the karman of rebuke up to the karman of knowing various miscellaneous things, this is the karman of relying on people.",
        "source": "T24n1463_002:0808a04_1"
    },
    {
        "source_sentence": "「有羯磨成事不成、有事成羯磨不成、有俱成、有俱不成。",
        "translation": "「有羯磨成事不成、有事成羯磨不成、有俱成、有俱不成。",
        "source": "T24n1463_002:0808a05_2"
    },
    {
        "source_sentence": "羯磨者，法也。",
        "translation": "The kalpa refers to the Dharma.",
        "source": "T24n1463_002:0808a06_3"
    },
    {
        "source_sentence": "事者，人也。",
        "translation": "A thing is a person.",
        "source": "T24n1463_002:0808a07_4"
    },
    {
        "source_sentence": "云何名事成羯磨不成者？",
        "translation": "What's called a situation that accomplishes karma and doesn't accomplish karma?",
        "source": "T24n1463_002:0808a07_5"
    },
    {
        "source_sentence": "此人清淨一切無諸障礙，是名事成。",
        "translation": "This person is pure and unobstructed in everything, which is called the accomplishment of a task.",
        "source": "T24n1463_002:0808a07_6"
    },
    {
        "source_sentence": "羯磨不成者，或言語不具亦前後不次第說不明了，是名羯磨不成。",
        "translation": "Someone who doesn't approve of the karma or whose words are not complete and who doesn't explain them sequentially before or after, this is called someone who doesn't approve of the karma.",
        "source": "T24n1463_002:0808a08_7"
    },
    {
        "source_sentence": "何者名為羯磨成事不成？",
        "translation": "What's called a karma that accomplishes things and doesn't accomplish them?",
        "source": "T24n1463_002:0808a10_8"
    },
    {
        "source_sentence": "羯磨成者，言語具足前後次第說亦明了，是名羯磨成。",
        "translation": "The accomplishment of a kalpa is when the words are complete and explained in sequence before, after, and clearly understood, which is called the accomplishment of a kalpa.",
        "source": "T24n1463_002:0808a10_9"
    },
    {
        "source_sentence": "事不成者，有人諸根不具及餘障礙，是名事不成。",
        "translation": "A person who doesn't have the faculties and other hindrances, this is called a person who doesn't have the faculties.",
        "source": "T24n1463_002:0808a12_10"
    },
    {
        "source_sentence": "又俱成者，羯磨及人此二皆具，故言俱成。",
        "translation": "Also, the accomplishment of both means that both karma and humans are present in both; therefore, it is said to be accomplished together.",
        "source": "T24n1463_002:0808a13_11"
    },
    {
        "source_sentence": "俱不成者，羯磨及人二俱不足，是名俱不成。",
        "translation": "Both are not settled: neither the kalpa nor the person is sufficient for both. This is called ‘both’.",
        "source": "T24n1463_002:0808a14_12"
    },
    {
        "source_sentence": "「應止羯磨者，諸比丘皆集，但所作不如法，應羯磨作法不羯磨作、應白作法不白作，眾中有持毘尼行清淨者說言：『此非法非律，是不應作。』",
        "translation": "When the monks who should stop the karma are assembled, but what they do doesn't conform to the teaching, they should karma-practise the teaching and not karma-practise it, or they should confess the teaching and not confess the teaching, and those in the assembly who maintain the purity of the vinaya practice say, 'This is neither unlawful nor undisciplined; it shouldn't be done",
        "source": "T24n1463_002:0808a15_13"
    },
    {
        "source_sentence": "即止不作，是名止羯磨。",
        "translation": "That is, stopping and not doing it is called the karma of stopping.",
        "source": "T24n1463_002:0808a18_14"
    },
    {
        "source_sentence": "不應止羯磨者，眾僧齊集，所作亦皆如法，眾中無譏慊者，是名不應止羯磨。",
        "translation": "A karma that shouldn't be stopped is called a karma that shouldn't be stopped because the saṃgha gathers together, and whatever it does is done according to the rules, and there's no criticism among the saṃgha, which is called a karma that shouldn't be stopped.",
        "source": "T24n1463_002:0808a18_15"
    },
    {
        "source_sentence": "此二章，卑犍度中廣說章。",
        "translation": "These two chapters are extensively explained in the Piṅgandharma.",
        "source": "T24n1463_002:0808a20_16"
    },
    {
        "source_sentence": "卑者，國名也。",
        "translation": "The lowest is the name of the country.",
        "source": "T24n1463_002:0808a21_17"
    },
    {
        "source_sentence": "「擯出有二種羯磨：一永擯；",
        "translation": "(2) There are two kinds of eunuch ordination:",
        "source": "T24n1463_002:0808a21_18"
    },
    {
        "source_sentence": "二為調伏故擯。",
        "translation": "The second is to subdue anger for the sake of discipline.",
        "source": "T24n1463_002:0808a22_19"
    },
    {
        "source_sentence": "調伏者，未懺悔中間，及飲食坐起言語，一切僧法事皆不得同，是名擯出。",
        "translation": "A disciplined person who doesn't repent in the interim, eats, sits, and speaks without food or drink, and doesn't allow all the saṃgha's religious affairs to be the same as them, this is called a debauchery.",
        "source": "T24n1463_002:0808a22_20"
    },
    {
        "source_sentence": "調伏羯磨，此人若剛強永無改悔，盡此一身不復得同僧事。",
        "translation": "If this person is rigid and never repents, they won't be able to work with the saṃgha for the rest of their life.",
        "source": "T24n1463_002:0808a24_21"
    },
    {
        "source_sentence": "尊者優波離即從座，起整衣服合掌禮佛，白佛言：『世尊！",
        "translation": "Venerable Upāli then rose from his seat, adjusted his clothes, saluted the Buddha with joined palms, and said to him, 'Bhagavān!",
        "source": "T24n1463_002:0808a25_22"
    },
    {
        "source_sentence": "若有比丘於僧事無缺而強擯者，此事云何？』",
        "translation": "If there's a monk who forcibly disputes the saṃgha's affairs without fail, what's the matter?'",
        "source": "T24n1463_002:0808a26_23"
    },
    {
        "source_sentence": "佛言：『擯有二種：一者善擯；",
        "translation": "The Buddha said: There are two kinds of hatred.",
        "source": "T24n1463_002:0808a27_24"
    },
    {
        "source_sentence": "二者惡擯。",
        "translation": "The second is bad anger.",
        "source": "T24n1463_002:0808a28_25"
    },
    {
        "source_sentence": "如擯十三種人者，名為善擯。",
        "translation": "Like the thirteen kinds of people who are angry, they're called good anger.",
        "source": "T24n1463_002:0808a28_26"
    },
    {
        "source_sentence": "與此相違，名為惡擯。",
        "translation": "To be at odds with this is called bad anger.",
        "source": "T24n1463_002:0808a29_27"
    },
    {
        "source_sentence": "是名擯出羯磨。",
        "translation": "This is called the monastic ordination karma.",
        "source": "T24n1463_002:0808a29_28"
    },
    {
        "source_sentence": "復有眾僧，聽懺悔入僧次第羯磨。",
        "translation": "Again, there are the saṃgha who listens to the repentance and enters the saṃgha's orderly karma.",
        "source": "T24n1463_002:0808a29_29"
    },
    {
        "source_sentence": "若比丘為調伏故擯出者，此人後時改悔求僧除罪，僧有所教勅皆順僧意不敢違逆，能使眾僧齊心歡喜，僧即聚集解擯羯磨，更作聽入僧羯磨，是名聽入僧羯磨。』",
        "translation": "If a monk leaves out for the sake of subjugation, this person later repents and asks the saṃgha to remove his sins, complies with the saṃgha's instructions and doesn't dare disobey them, makes the saṃgha wholeheartedly rejoice, and the saṃgha then gathers together to resolve the disputed karma and creates another karma to allow the saṃgha to enter",
        "source": "T24n1463_002:0808b01_30"
    },
    {
        "source_sentence": "優波離問佛：『擯出懺悔，此事云何？』",
        "translation": "Upāli asked the Buddha, 'What's the matter with this repentance?'",
        "source": "T24n1463_002:0808b05_31"
    },
    {
        "source_sentence": "佛言：『為調伏者，聽使懺悔。",
        "translation": "The Buddha said, 'For those who are disciplined, I'll listen to their repentance.",
        "source": "T24n1463_002:0808b06_32"
    },
    {
        "source_sentence": "永擯者，不聽懺悔。』",
        "translation": "Those who are permanently disciplined won't be allowed to repent.'",
        "source": "T24n1463_002:0808b06_33"
    },
    {
        "source_sentence": "「何者名為訶責羯磨？",
        "translation": "What's called the rebuke karma?",
        "source": "T24n1463_002:0808b07_34"
    },
    {
        "source_sentence": "有人僧中健鬪強諍，於僧法事中皆不如法，現前種種訶責乃至擯出。",
        "translation": "Some people in the saṃgha are vigorous and strongly resistant, don't follow the rules in all the saṃgha's business, and present various kinds of rebuke or reprimand up to expulsion.",
        "source": "T24n1463_002:0808b07_35"
    },
    {
        "source_sentence": "此訶責事，訶責犍度中廣說。",
        "translation": "This matter of reprimanding is spoken of elaborately in the chapter ‘Reprimanding’.",
        "source": "T24n1463_002:0808b09_36"
    },
    {
        "source_sentence": "有訶責者，若比丘作種種不如法事，眾僧語言：『長老！",
        "translation": "If a monk does various things that are not according to the Dharma, the saṃgha says, 'Elder!'",
        "source": "T24n1463_002:0808b10_0"
    },
    {
        "source_sentence": "汝犯不如法事。』",
        "translation": "You've done something that's not according to the Dharma.'",
        "source": "T24n1463_002:0808b11_1"
    },
    {
        "source_sentence": "此人即答僧言：『我不知不見犯何等事。』",
        "translation": "That person then answered the saṃgha, 'I don't know what kind of offense I haven't seen.'",
        "source": "T24n1463_002:0808b11_2"
    },
    {
        "source_sentence": "僧應種種苦責擯出，是名呵責羯磨。",
        "translation": "The saṃgha should expel various kinds of painful rebuke from the saṃgha, which is called the rebuke karma.",
        "source": "T24n1463_002:0808b12_3"
    },
    {
        "source_sentence": "諫法應三處諫：見、聞、疑破戒破見破行。",
        "translation": "The method of remonstrance should be admonished in three places: views, hearing, and doubt that break the precepts and break views and break practices.",
        "source": "T24n1463_002:0808b13_4"
    },
    {
        "source_sentence": "諫者有五事因緣：一知時；",
        "translation": "There are five reasons for remonstrating:",
        "source": "T24n1463_002:0808b14_5"
    },
    {
        "source_sentence": "二利於前人；",
        "translation": "The second is to benefit those who came before them.",
        "source": "T24n1463_002:0808b14_6"
    },
    {
        "source_sentence": "三實心；",
        "translation": "The third is the mind of reality.",
        "source": "T24n1463_002:0808b15_7"
    },
    {
        "source_sentence": "四調和語；",
        "translation": "The fourth is harmonious speech.",
        "source": "T24n1463_002:0808b15_8"
    },
    {
        "source_sentence": "五不麁惡語。",
        "translation": "Five, he doesn't speak harshly.",
        "source": "T24n1463_002:0808b15_9"
    },
    {
        "source_sentence": "復有內立五種因緣故應諫：一利益；",
        "translation": "Again, there are five kinds of reasons established within the doctrine:",
        "source": "T24n1463_002:0808b15_10"
    },
    {
        "source_sentence": "二安樂；",
        "translation": "The second is well-being.",
        "source": "T24n1463_002:0808b16_11"
    },
    {
        "source_sentence": "三慈心；",
        "translation": "The third is the mind of compassion.",
        "source": "T24n1463_002:0808b16_12"
    },
    {
        "source_sentence": "四悲心；",
        "translation": "The fourth is compassion.",
        "source": "T24n1463_002:0808b17_0"
    },
    {
        "source_sentence": "五於犯罪中欲使速離。",
        "translation": "Five, he wants to quickly get rid of crimes.",
        "source": "T24n1463_002:0808b17_1"
    },
    {
        "source_sentence": "是名諫法緣事。",
        "translation": "This is called the condition for remonstrating with respect to the Dharma.",
        "source": "T24n1463_002:0808b17_2"
    },
    {
        "source_sentence": "云何名為緣事？",
        "translation": "What's called a conditioned thing?",
        "source": "T24n1463_002:0808b18_3"
    },
    {
        "source_sentence": "若因若緣。",
        "translation": "Whether it's a cause or a condition.",
        "source": "T24n1463_002:0808b18_4"
    },
    {
        "source_sentence": "此中從何初起？",
        "translation": "Where did they come from?",
        "source": "T24n1463_002:0808b18_5"
    },
    {
        "source_sentence": "如拔陀波羅比丘經中，應當廣知。",
        "translation": "As it's explained in the Sutra on the Upāsaka Bhikṣu, they should be known in detail.",
        "source": "T24n1463_002:0808b19_0"
    },
    {
        "source_sentence": "爾時世尊在舍衛國一坐而食。",
        "translation": "It was then that the Bhagavān ate while he was sitting in Sāvatthī.",
        "source": "T24n1463_002:0808b19_1"
    },
    {
        "source_sentence": "佛告諸比丘：『吾一食已來身體調適無諸患苦，汝等亦應一食。』",
        "translation": "The Buddha told the monks, 'Since I ate once, my body has been well-balanced without any pain or suffering, so you should also eat once.'",
        "source": "T24n1463_002:0808b20_2"
    },
    {
        "source_sentence": "諸比丘聞告，歡喜奉行。",
        "translation": "The monks who heard the instruction were delighted and remembered it well. ****** 33.",
        "source": "T24n1463_002:0808b21_3"
    },
    {
        "source_sentence": "拔陀波羅比丘不順佛告，『不能一食。",
        "translation": "The monk Bhadrapāla disobeyed the Buddha's instructions, saying, 'You can't eat a single meal.",
        "source": "T24n1463_002:0808b22_4"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_002:0808b23_5"
    },
    {
        "source_sentence": "我常數數食，以此為法。』",
        "translation": "I always eat repeatedly and repeatedly, and this is the Dharma.'",
        "source": "T24n1463_002:0808b23_6"
    },
    {
        "source_sentence": "佛復告言：『汝能多食者，中前多乞，一坐而食。』",
        "translation": "Again, the Buddha told them, 'If you can eat a lot, beg often in front of me and eat with one seat.'",
        "source": "T24n1463_002:0808b23_7"
    },
    {
        "source_sentence": "復言：『不能。』",
        "translation": "Again, he said, 'I can't.'",
        "source": "T24n1463_002:0808b24_8"
    },
    {
        "source_sentence": "佛復欲遊諸國邑，阿難為佛縫衣。",
        "translation": "Again, when the Buddha wanted to travel to various cities, Ānanda made a sewing robe for him.",
        "source": "T24n1463_002:0808b25_9"
    },
    {
        "source_sentence": "此比丘到阿難所問言：『汝何所作？』",
        "translation": "This monk went to Ānanda and asked, 'What did you do?'",
        "source": "T24n1463_002:0808b25_10"
    },
    {
        "source_sentence": "阿難答言：『世尊欲遊諸國邑，是故為佛縫衣。",
        "translation": "Ānanda replied, 'The Bhagavān wants to travel to various countries and cities, so he sews his robe for the Buddha.",
        "source": "T24n1463_002:0808b26_11"
    },
    {
        "source_sentence": "汝住此或無利益。』",
        "translation": "If you stay here, it might not be helpful.'",
        "source": "T24n1463_002:0808b27_12"
    },
    {
        "source_sentence": "聞此語已即到佛所，五體投地白佛言：『世尊！",
        "translation": "After hearing these words, he went to the Buddha and bowed his five bodies to the ground and said to him, 'Bhagavān!",
        "source": "T24n1463_002:0808b28_13"
    },
    {
        "source_sentence": "當為弟子懺悔。』",
        "translation": "I will repent for my disciples.'",
        "source": "T24n1463_002:0808b29_14"
    },
    {
        "source_sentence": "佛言：『懺悔無益。",
        "translation": "The Buddha said, 'It's useless to repent.",
        "source": "T24n1463_002:0808b29_15"
    },
    {
        "source_sentence": "一切沙門婆羅門皆知汝行非法。",
        "translation": "All the śramaṇas and brāhmaṇas will know that you are acting contrary to the Dharma.",
        "source": "T24n1463_002:0808b29_16"
    },
    {
        "source_sentence": "若順吾言者，四禪四空定諸通解脫皆可得耳。",
        "translation": "If someone follows my words, they'll attain liberation through the four meditations and four concentrations of emptiness in the fourth dhyāna.",
        "source": "T24n1463_002:0808c01_17"
    },
    {
        "source_sentence": "不用吾言者，於此諸善不可得也。』",
        "translation": "Those who don't use my words won't attain these good qualities.'",
        "source": "T24n1463_002:0808c02_18"
    },
    {
        "source_sentence": "復更慇懃三請世尊，世尊然後受其懺悔，復為說法：『若人造惡能改悔者，於佛法中多所利益。』",
        "translation": "Again, he repeatedly asked the Bhagavān three times, and the Bhagavān then accepted his repentance and taught him again, 'If someone commits evil and can repent, they'll often benefit from the Buddha's teaching.'",
        "source": "T24n1463_002:0808c03_19"
    },
    {
        "source_sentence": "如是廣說。",
        "translation": "It's explained in detail like this.",
        "source": "T24n1463_002:0808c05_20"
    },
    {
        "source_sentence": "此拔陀波羅比丘數數犯罪，諸比丘見已諫之。",
        "translation": "This monk Upagupta committed several offenses, and when the monks saw him, they remonstrated with him.",
        "source": "T24n1463_002:0808c05_21"
    },
    {
        "source_sentence": "聞諫之言不以經懷，便以餘言而答。",
        "translation": "When he heard the words of his remonstrance, he didn't harbor them in the sūtras, so he answered with other words.",
        "source": "T24n1463_002:0808c06_22"
    },
    {
        "source_sentence": "佛向拔陀波羅比丘言：『有一比丘犯種種罪。",
        "translation": "The Buddha said to the monk Bhadrapāla, 'There's a monk who commits various crimes.",
        "source": "T24n1463_002:0808c07_23"
    },
    {
        "source_sentence": "諸比丘見已如法諫之。",
        "translation": "When the monks saw this, they remonstrated with him according to the teaching.",
        "source": "T24n1463_002:0808c08_24"
    },
    {
        "source_sentence": "此比丘更以異言而答，復生瞋恚。』",
        "translation": "This monk answers with different words and then becomes angry again.'",
        "source": "T24n1463_002:0808c09_25"
    },
    {
        "source_sentence": "佛言：『此比丘雖不受諫，亦應諫之。",
        "translation": "The Buddha said, 'Although this monk doesn't accept the admonition, he should also admonish him.",
        "source": "T24n1463_002:0808c10_0"
    },
    {
        "source_sentence": "所以爾者，欲使諸沙門婆羅門一切廣聞，亦欲使其現身長夜受苦。』",
        "translation": "That's why I want to cause all the śramaṇas and brāhmaṇas to hear it widely, and I want to cause them to suffer for a long time in their present body.'",
        "source": "T24n1463_002:0808c10_1"
    },
    {
        "source_sentence": "佛說曰：『調伏法有三種：一呵責；",
        "translation": "The Buddha said: There are three kinds of discipline:",
        "source": "T24n1463_002:0808c12_2"
    },
    {
        "source_sentence": "二別住宿；",
        "translation": "The second is to dwell separately.",
        "source": "T24n1463_002:0808c13_0"
    },
    {
        "source_sentence": "三當令依止有智慧者乃至驅出。",
        "translation": "Three, it will cause those who rely on someone with wisdom to rely on them and even drive them out.",
        "source": "T24n1463_002:0808c13_1"
    },
    {
        "source_sentence": "是人因是事調伏，心意柔軟順僧法而行，能使大眾歡悅，是名調伏法。』",
        "translation": "Because of these things, that person's mind is disciplined, his mind is flexible and compliant with the saṃgha's teaching, and he can cause the masses to rejoice, which is called the method of discipline.'",
        "source": "T24n1463_002:0808c14_0"
    },
    {
        "source_sentence": "「舍摩陀者(秦言名滅)，何等比丘事應滅？",
        "translation": "Śāmadharma (known as cessation in the Qin language), what kind of monk's business should be ceased?",
        "source": "T24n1463_002:0808c15_1"
    },
    {
        "source_sentence": "若有比丘隨善法，能除四受：一者欲受；",
        "translation": "Suppose there is a monk who, following a wholesome factor, is able to eliminate four forms of clinging:",
        "source": "T24n1463_002:0808c16_2"
    },
    {
        "source_sentence": "二者見受；",
        "translation": "The second is seeing and feeling.",
        "source": "T24n1463_002:0808c17_3"
    },
    {
        "source_sentence": "三者戒取受；",
        "translation": "The third is taking and receiving of precepts.",
        "source": "T24n1463_002:0808c17_4"
    },
    {
        "source_sentence": "四者我取受。",
        "translation": "Fourth, it's self-acquisition and sensation.",
        "source": "T24n1463_002:0808c17_5"
    },
    {
        "source_sentence": "能除此四受，隨順行出離法，善者念念增進，惡者捨之，是名為滅。",
        "translation": "Being able to remove these four sensations and follow the practice of liberation from them is called cessation, where goodness increases moment by moment and badness abandons it.",
        "source": "T24n1463_002:0808c17_6"
    },
    {
        "source_sentence": "又復滅者，從現前毘尼乃至敷草毘尼，滅此七諍，亦名為滅也。",
        "translation": "Further cessation is also called cessation when these seven abscesses are extinguished, from the present vinaya up to the laying out of grass vinaya.",
        "source": "T24n1463_002:0808c19_7"
    },
    {
        "source_sentence": "不應滅者，若比丘成就五法起鬪諍事：一者常樂在家；",
        "translation": "“They should not be abandoned”: If a monk accomplishes five things that give rise to disputes, the first is always happy at home.",
        "source": "T24n1463_002:0808c20_8"
    },
    {
        "source_sentence": "二者常樂依國王大臣；",
        "translation": "The second is that they always delight in relying on the king’s ministers.",
        "source": "T24n1463_002:0808c21_9"
    },
    {
        "source_sentence": "三者不樂依僧；",
        "translation": "The third is that they do not delight in relying on the Sangha.",
        "source": "T24n1463_002:0808c22_10"
    },
    {
        "source_sentence": "四者亦不依法；",
        "translation": "The fourth is that they also do not rely on the Dharma.",
        "source": "T24n1463_002:0808c22_11"
    },
    {
        "source_sentence": "五者眾僧所行事皆不順之。",
        "translation": "Fifth, all the activities of the saṃgha should not be done in a way that accords with them.",
        "source": "T24n1463_002:0808c23_12"
    },
    {
        "source_sentence": "若比丘成就此五種事，所有諍事不應滅之。",
        "translation": "If a monk accomplishes these five kinds of things, he shouldn't extinguish all the disputes that exist.",
        "source": "T24n1463_002:0808c23_13"
    },
    {
        "source_sentence": "復有比丘成就五法，有諍事起應當滅之。",
        "translation": "Again, if there's a monk who accomplishes five things and has a dispute that arises, he should be extinguished.",
        "source": "T24n1463_002:0808c24_14"
    },
    {
        "source_sentence": "何等為五？",
        "translation": "What are the five?",
        "source": "T24n1463_002:0808c25_15"
    },
    {
        "source_sentence": "五者與上五事相違，即是五也。",
        "translation": "The fifth is at odds with the above-mentioned five things, which are the five.",
        "source": "T24n1463_002:0808c25_16"
    },
    {
        "source_sentence": "成此五法，所有諍事應當滅之。",
        "translation": "When these five things are accomplished, all the disputes that will arise should be eliminated.",
        "source": "T24n1463_002:0808c26_17"
    },
    {
        "source_sentence": "又復滅者，隨僧行法能隨順之，所有善法日日增進，其所行事常為解說。",
        "translation": "Again, cessation is when someone follows the practice of the saṃgha and can follow it, and their good qualities increase day by day, explaining what they're doing for them.",
        "source": "T24n1463_002:0808c27_18"
    },
    {
        "source_sentence": "若有事能令僧喜，行之不惓，是名滅法。",
        "translation": "If there are things that can cause the saṃgha to rejoice and practice without anger, this is called the method of cessation.",
        "source": "T24n1463_002:0808c28_19"
    },
    {
        "source_sentence": "「捨戒法。",
        "translation": "He renounces the precepts.",
        "source": "T24n1463_002:0808c29_20"
    },
    {
        "source_sentence": "若比丘愁憂不樂不樂梵行，欲歸家不樂比丘法，於此法中生慚愧心，意欲成就在家之法。",
        "translation": "If a monk is sad and doesn't enjoy or delight in religious practice, wants to return home and doesn't enjoy the monks' teachings, becomes ashamed of these teachings and wants to accomplish the householder's teaching.",
        "source": "T24n1463_002:0808c29_21"
    },
    {
        "source_sentence": "『出家法於我無益，在家法益我甚好。』",
        "translation": "'The renunciant's teaching doesn't benefit me, but the layman's teaching benefits me very well.'",
        "source": "T24n1463_002:0809a03_0"
    },
    {
        "source_sentence": "意欲捨比丘法還家，作如是語：『我捨佛法僧、和上阿闍梨、梵行、毘尼、波羅提木叉戒。』",
        "translation": "Wishing to abandon the monk's teaching and return home, he says, 'I abandon the Buddha, Dharma, Saṃgha, Vātsīputrīya, religious practice, vinaya, and prātimokṣa precepts.'",
        "source": "T24n1463_002:0809a03_1"
    },
    {
        "source_sentence": "如是廣說，應當知是為捨戒。",
        "translation": "This extensive explanation should be known as abandoning the precepts.",
        "source": "T24n1463_002:0809a05_2"
    },
    {
        "source_sentence": "不捨戒者，若癡狂心亂乃至口噤不能言者，不名捨戒。",
        "translation": "A person who doesn't abandon the precepts and if they're deluded, mentally disturbed, or even verbally silent and unable to speak, it's not called abandoning the precepts.",
        "source": "T24n1463_002:0809a06_3"
    },
    {
        "source_sentence": "如是廣說，應當知。",
        "translation": "This extensive explanation should be understood in this way.",
        "source": "T24n1463_002:0809a07_4"
    },
    {
        "source_sentence": "「戒羸者，比丘生念，不樂梵行、樂在外道乃至作僧祇人，是名戒羸。",
        "translation": "When the precepts are weak, a monk becomes mindful and doesn't delight in religious practice or pleasure in non-Buddhists or even becomes an incalculable number of people, which is called a weak precept.",
        "source": "T24n1463_002:0809a08_0"
    },
    {
        "source_sentence": "戒羸事如上文中所說。",
        "translation": "The weakness of the precepts is as explained above.",
        "source": "T24n1463_002:0809a09_1"
    },
    {
        "source_sentence": "「說戒法。",
        "translation": "He teaches the precepts.",
        "source": "T24n1463_002:0809a10_2"
    },
    {
        "source_sentence": "應如法集僧，僧集已應當一白羯磨，不應二三四白羯磨也。",
        "translation": "You should gather the saṃgha according to the teaching, and once the saṃgha has gathered it, you should give a white karma-pāramitā, not two, three, or four white karmas.",
        "source": "T24n1463_002:0809a10_3"
    },
    {
        "source_sentence": "僧作法事如法取欲，皆應默然不應遮也。",
        "translation": "If the saṃgha does things according to the Dharma and takes desires according to the Dharma, they should all be silent and not obstructed.",
        "source": "T24n1463_002:0809a11_4"
    },
    {
        "source_sentence": "僧若不滿足者不應說戒，僧若滿足應廣說戒。",
        "translation": "If the saṃgha isn't fulfilled, he shouldn't explain the precepts, and if the saṃgha is fulfilled, he should explain the precepts in detail.",
        "source": "T24n1463_002:0809a12_5"
    },
    {
        "source_sentence": "「時不中，略說也。",
        "translation": "“The time isn’t middling, but it’s briefly explained.",
        "source": "T24n1463_002:0809a13_6"
    },
    {
        "source_sentence": "時者，無留難名為時。",
        "translation": "A time is a time when there's no difficulty in being called a time.",
        "source": "T24n1463_002:0809a13_7"
    },
    {
        "source_sentence": "爾時世尊於靜房中心念：『我為諸比丘制戒說波羅提木叉，乃至能使人得四沙門果。",
        "translation": "It was then that the Bhagavān thought in the center of his secluded room, 'I prescribed the precepts for the monks and taught them the prātimokṣa, even to the point where they were able to cause people to attain the four ascetic fruits.",
        "source": "T24n1463_002:0809a14_8"
    },
    {
        "source_sentence": "波羅提木叉者，戒律行住處，是名波羅提木叉義。』",
        "translation": "The prātimokṣa is the place where the precepts are practiced and abiding, which is called the meaning of the prātimokṣa.'",
        "source": "T24n1463_002:0809a16_9"
    },
    {
        "source_sentence": "爾時諸比丘用歌音誦戒。",
        "translation": "It was then that the monks recited the precepts in song and sound.",
        "source": "T24n1463_002:0809a17_10"
    },
    {
        "source_sentence": "佛言：『不應當以高聲了了誦戒。",
        "translation": "The Buddha said, 'You shouldn't recite the precepts with a loud voice that understands them.",
        "source": "T24n1463_002:0809a18_11"
    },
    {
        "source_sentence": "歌音誦戒有五事過：一心染著此音；",
        "translation": "There are five faults in the singing, sound, and recitation precepts:",
        "source": "T24n1463_002:0809a18_12"
    },
    {
        "source_sentence": "二為世人所嫌；",
        "translation": "The second is to be disliked by the world.",
        "source": "T24n1463_002:0809a19_13"
    },
    {
        "source_sentence": "三與世人無異；",
        "translation": "The third is no different from worldly people.",
        "source": "T24n1463_002:0809a19_14"
    },
    {
        "source_sentence": "四妨廢行道；",
        "translation": "The fourth obstructs the path of practice.",
        "source": "T24n1463_002:0809a20_15"
    },
    {
        "source_sentence": "五妨入定。",
        "translation": "The fifth obstructs entry into concentration.",
        "source": "T24n1463_002:0809a20_16"
    },
    {
        "source_sentence": "是名五事過也。』",
        "translation": "These are called the five things that are wrong.'",
        "source": "T24n1463_002:0809a20_17"
    },
    {
        "source_sentence": "「佛在世時，諸比丘日日說戒，眾僧皆生厭心。",
        "translation": "When the Buddha was in the world, the monks taught the precepts day after day, and the saṃgha all became disillusioned.",
        "source": "T24n1463_002:0809a22_0"
    },
    {
        "source_sentence": "佛聞即制十五日一說戒。",
        "translation": "When the Buddha heard this, he prescribed the precepts to be taught once every fifteen days.",
        "source": "T24n1463_002:0809a23_0"
    },
    {
        "source_sentence": "爾時於一住處說戒，僧坊既大，諸比丘遠者不聞。",
        "translation": "It was then that the precepts were taught in one dwelling place, and since the saṃgha hall was so large, the monks from a distance didn't hear them.",
        "source": "T24n1463_002:0809a23_1"
    },
    {
        "source_sentence": "是以如來為諸比丘制法：『僧眾若多僧房亦大者，應當正中敷座，說戒者在此座上，當高聲了了說，使得聞之。』",
        "translation": "That's why the Tathāgata established a rule for monks, saying, 'If there are many monks in the saṃgha and their monastic quarters are also large, you should spread out your seat in the center and make sure that the preceptor who teaches the precepts is here on his seat, speaks loudly and clearly, and makes them hear it.'",
        "source": "T24n1463_002:0809a24_2"
    },
    {
        "source_sentence": "爾時諸比丘在一住處，僧眾雖大，無誦戒者，法事不成。",
        "translation": "At the time, the monks were in one dwelling place, and although the saṃgha was large, there were no people who recited the precepts, so the Dharma didn't work.",
        "source": "T24n1463_002:0809a27_3"
    },
    {
        "source_sentence": "世尊聞已告諸比丘：『從今已後，有出家者，至五臘要誦戒使利。",
        "translation": "After hearing this, the Bhagavān told the monks, 'From now on, there's a renunciant who leaves home until the fifth year when he recites the precepts for the benefit of the messenger.",
        "source": "T24n1463_002:0809a28_4"
    },
    {
        "source_sentence": "若根鈍者，乃至百臘亦應誦之。",
        "translation": "If his faculties are dull, he should recite it even for a hundred years.",
        "source": "T24n1463_002:0809a29_5"
    },
    {
        "source_sentence": "若故不誦、若先誦後時廢忘、若復鈍根不能得者，此等三人有四種過：一不得畜弟子；",
        "translation": "If, for this reason, they do not recite it; if, when first reciting it, they forget it at a later moment; or if, furthermore, their faculties are dull and unable to acquire it, these three people have four faults:",
        "source": "T24n1463_002:0809b01_6"
    },
    {
        "source_sentence": "二不得離依止；",
        "translation": "The second is that they cannot be separated from the support.",
        "source": "T24n1463_002:0809b03_7"
    },
    {
        "source_sentence": "三不得作和上；",
        "translation": "The third is that they cannot be made superiors.",
        "source": "T24n1463_002:0809b03_8"
    },
    {
        "source_sentence": "四不得作阿闍梨。",
        "translation": "Fourth, he mustn't become a preceptor.",
        "source": "T24n1463_002:0809b04_9"
    },
    {
        "source_sentence": "是名不誦戒者罪。』",
        "translation": "This is called the sin of someone who doesn't recite the precepts.'",
        "source": "T24n1463_002:0809b04_10"
    },
    {
        "source_sentence": "「有八種難，得略說戒：一者王難；",
        "translation": "“There are eight kinds of difficulties that can be briefly explained in the precepts:",
        "source": "T24n1463_002:0809b05_11"
    },
    {
        "source_sentence": "二者賊難；",
        "translation": "The second is the difficulty of thieves.",
        "source": "T24n1463_002:0809b05_12"
    },
    {
        "source_sentence": "三者水難；",
        "translation": "The third is the difficulty of water.",
        "source": "T24n1463_002:0809b06_0"
    },
    {
        "source_sentence": "四者火難；",
        "translation": "The fourth is the danger of fire.",
        "source": "T24n1463_002:0809b06_1"
    },
    {
        "source_sentence": "五者病難；",
        "translation": "The fifth is the difficulty of illness.",
        "source": "T24n1463_002:0809b06_2"
    },
    {
        "source_sentence": "六者人難；",
        "translation": "The sixth is the difficulty of being human.",
        "source": "T24n1463_002:0809b06_3"
    },
    {
        "source_sentence": "七者非人難；",
        "translation": "The seventh is the difficulty of not being human.",
        "source": "T24n1463_002:0809b06_4"
    },
    {
        "source_sentence": "八者毒蛇難。",
        "translation": "Eight, the difficulty of poisonous snakes.",
        "source": "T24n1463_002:0809b07_5"
    },
    {
        "source_sentence": "有此八種得略說戒。",
        "translation": "There are these eight kinds of precepts that can be briefly explained.",
        "source": "T24n1463_002:0809b07_6"
    },
    {
        "source_sentence": "略有五種：一者說戒序已，稱名說言：『四波羅夷，汝等數數聞。』",
        "translation": "Briefly, there are five kinds: first, after explaining the preface to the precepts, he calls them by name and says, 'Four pārājikas, you've heard them repeatedly.'",
        "source": "T24n1463_002:0809b07_7"
    },
    {
        "source_sentence": "乃至眾學亦如是說。",
        "translation": "It's likewise explained for all the students.",
        "source": "T24n1463_002:0809b09_8"
    },
    {
        "source_sentence": "第二略者，從戒序說四事竟，後亦稱名如前也。",
        "translation": "The second abbreviation is that after the preface to the precepts explains the four things, they're also called as before.",
        "source": "T24n1463_002:0809b09_9"
    },
    {
        "source_sentence": "第三略者，從戒序說至十三事，後者稱名亦如前二。",
        "translation": "The third is abbreviated: from the preface to the precepts, it's explained up to 13 things, and the latter name is like the previous two.",
        "source": "T24n1463_002:0809b10_10"
    },
    {
        "source_sentence": "第四略者，從戒序說至二不定，餘者稱名亦如前三。",
        "translation": "The fourth is abbreviated: from the preface to the precepts, it's explained up to two indeterminate; the other ones are called as above three.",
        "source": "T24n1463_002:0809b12_0"
    },
    {
        "source_sentence": "第五略者，從戒序說乃至尼薩耆波逸提，後者稱名亦如前四。",
        "translation": "The fifth abbreviation is from the preface to the precepts that are explained in the preface to the precepts up to the prātimokṣatriya, and the latter name is like the previous four.",
        "source": "T24n1463_002:0809b13_1"
    },
    {
        "source_sentence": "爾時有眾多比丘在一處，皆根鈍無所知，有賊難不得就餘寺說戒，法事不成。",
        "translation": "At the time, there were many monks in one place who were all dull-witted and didn't know anything, and it was difficult for thieves to preach the precepts at other temples because of their lack of ability to do so.",
        "source": "T24n1463_002:0809b14_2"
    },
    {
        "source_sentence": "佛聞已教諸比丘：『汝等當略說戒。",
        "translation": "After hearing this, the Buddha taught the monks, 'You must briefly explain the precepts.",
        "source": "T24n1463_002:0809b16_3"
    },
    {
        "source_sentence": "「諸惡莫作、諸善奉行、自淨其意、是諸佛教。」",
        "translation": "Don't do evil, practice goodness, purify your own minds, and this is the teaching of Buddhism.",
        "source": "T24n1463_002:0809b17_4"
    },
    {
        "source_sentence": "是名略說戒。』",
        "translation": "This is called a brief explanation of the precepts.'",
        "source": "T24n1463_002:0809b18_5"
    },
    {
        "source_sentence": "「不成說戒有四種：非法群共說戒，不名說戒；",
        "translation": "“There are four kinds of precepts that are not taught:",
        "source": "T24n1463_002:0809b18_6"
    },
    {
        "source_sentence": "非法齊集，此亦不名說戒；",
        "translation": "What is not the doctrine of unity and what is not the doctrine of sameness, also does not receive the name precept preaching.",
        "source": "T24n1463_002:0809b19_7"
    },
    {
        "source_sentence": "群共，此亦不成說；",
        "translation": "Nor does the Sūtra teach that it is common to all beings.",
        "source": "T24n1463_002:0809b20_0"
    },
    {
        "source_sentence": "應一白處二白，此亦不成說戒。",
        "translation": "You should have one white place and two white, but this doesn't make it possible to explain the precepts here.",
        "source": "T24n1463_002:0809b20_1"
    },
    {
        "source_sentence": "若有比丘於說戒時，三四別共私論起貢高心，因說戒論義生於諍訟，如此說戒不成說戒。",
        "translation": "If a monk, at the time of preaching the precepts, gives rise to an arrogant mind that's divided into three or four separately discussed and privately arrogant, then he explains the meaning of the precepts and creates controversy by discussing them, and this kind of explanation of the precepts doesn't make it possible to explain the precepts.",
        "source": "T24n1463_002:0809b21_2"
    },
    {
        "source_sentence": "不成有二種：一鬪訟故說戒不成；",
        "translation": "There are two kinds of unformed precepts:",
        "source": "T24n1463_002:0809b23_3"
    },
    {
        "source_sentence": "二惡心故增長煩惱。",
        "translation": "The second is the growth of afflictions because of bad thoughts.",
        "source": "T24n1463_002:0809b23_4"
    },
    {
        "source_sentence": "是二皆不成說戒。",
        "translation": "Neither of these two doesn't establish the teaching of the precepts.",
        "source": "T24n1463_002:0809b24_5"
    },
    {
        "source_sentence": "此事布薩犍度中應當廣知。",
        "translation": "This matter should be known in detail in the uposatha-pāramitā.",
        "source": "T24n1463_002:0809b24_6"
    },
    {
        "source_sentence": "是處應說。",
        "translation": "This is the place where it should be explained.",
        "source": "T24n1463_002:0809b25_7"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T24n1463_002:0809b25_8"
    },
    {
        "source_sentence": "若比丘未犯罪心中生念：『云何不犯眾惡而得生善？』",
        "translation": "If a monk doesn't commit crimes, he thinks to himself, 'How can goodness arise without committing numerous bad sins?'",
        "source": "T24n1463_002:0809b25_9"
    },
    {
        "source_sentence": "即詣持法、持毘尼、持摩得勒伽藏者問之。",
        "translation": "He then went to the person who upheld the teachings, upheld the vinaya, and upheld the maṇḍala storehouse to ask questions.",
        "source": "T24n1463_002:0809b27_10"
    },
    {
        "source_sentence": "『尊者！",
        "translation": "'Sir, venerable!",
        "source": "T24n1463_002:0809b28_0"
    },
    {
        "source_sentence": "何者是法？",
        "translation": "What's the teaching?",
        "source": "T24n1463_002:0809b28_1"
    },
    {
        "source_sentence": "何者非法？",
        "translation": "What's unlawful?",
        "source": "T24n1463_002:0809b28_2"
    },
    {
        "source_sentence": "何者可說？",
        "translation": "Which one can be explained?",
        "source": "T24n1463_002:0809b28_3"
    },
    {
        "source_sentence": "何者不可說？』",
        "translation": "What's ineffable?'",
        "source": "T24n1463_002:0809b28_4"
    },
    {
        "source_sentence": "彼師聞此語，即次第為說，法如法說，不如法不如法說，如毘尼如毘尼說，非毘尼如非毘尼說，輕如輕說，重如重說，麁惡語如麁惡語說，非麁惡語如非麁惡語說，犯如犯說，不犯如不犯說，殘如殘說，不殘如不殘說，應如應說，不應如不應說，制如制說，不如制如不如制說，所說如所說，不如所說如不如所說，齊量如齊量說，不齊量如不齊量說，分別如分別說，不分別如不分別說。",
        "translation": "When the teacher heard these words, he taught them in order: The Dharma is taught according to the Dharma; not according to the Dharma but according to the Dharma; according to the Dharma and not according to the Dharma; just as the Vinaya is taught according to the Vinaya; what is not the Vinaya is taught according to what is not the Vinaya; light is taught according to what is light; heavy is taught according to what is heavier; harsh",
        "source": "T24n1463_002:0809b29_5"
    },
    {
        "source_sentence": "「比丘法。",
        "translation": "“ Bhikṣu-dharma.",
        "source": "T24n1463_002:0809c08_6"
    },
    {
        "source_sentence": "食在界內，無淨厨不得食。",
        "translation": "When food is within the boundary, there's no clean kitchen to eat.",
        "source": "T24n1463_002:0809c08_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_002:0809c09_8"
    },
    {
        "source_sentence": "佛遊諸聚落，見諸比丘共諍。",
        "translation": "The Buddha traveled to various villages and saw the monks arguing with each other.",
        "source": "T24n1463_002:0809c09_9"
    },
    {
        "source_sentence": "佛問比丘：『諍何等事？』",
        "translation": "The Buddha asked the monk, 'What's the matter?'",
        "source": "T24n1463_002:0809c10_10"
    },
    {
        "source_sentence": "比丘白佛：『昨日食已有餘殘食，是故諍之。』",
        "translation": "The monks said to the Buddha, 'There's already leftover food left over from yesterday's meal; therefore, I'll eat it.'",
        "source": "T24n1463_002:0809c10_11"
    },
    {
        "source_sentence": "佛言：『從今已去，宿食及在大界內食，無淨厨者一切不得食。』",
        "translation": "The Buddha said, 'From now on, there's food for the night and food for the great realm within the great realm that can't be eaten by anyone who doesn't have a clean kitchen.'",
        "source": "T24n1463_002:0809c11_12"
    },
    {
        "source_sentence": "眾僧住處初立寺時，眾僧齊集，應先羯磨作淨厨處，後羯磨眾僧房舍處。",
        "translation": "When the saṃgha's dwelling place is first established, when the saṃgha gathers together, they should first karma make a clean kitchen and then karma the dwelling place for the saṃgha.",
        "source": "T24n1463_002:0809c13_13"
    },
    {
        "source_sentence": "若當時忘誤不羯磨作淨厨處者，後若憶，還解大界後解小界，先羯磨淨厨處。",
        "translation": "If someone forgets the place to make a clean kitchen at the time and doesn't perform the ritual, then if they remember it later, they'll return to the large realm and then remove the small realm, and they'll first perform the ritual for making a clean kitchen.",
        "source": "T24n1463_002:0809c14_14"
    },
    {
        "source_sentence": "結界法：先結小界、後結大界。",
        "translation": "The method of forming a boundary: first forming a small boundary, and then forming a large boundary.",
        "source": "T24n1463_002:0809c16_15"
    },
    {
        "source_sentence": "共宿食、殘宿食、眾僧小界內所作食、僧自手作食，若僧值世飢饉得食，餘時不得食。",
        "translation": "If a monk is hungry in the world and gets food when he shares nightly food, leftover nightly food, food made for the saṃgha's small realm inside the saṃgha, or food made by the saṃgha himself, then he won't get food at other times when he's hungry.",
        "source": "T24n1463_002:0809c17_16"
    },
    {
        "source_sentence": "受食已檀越來請，彼中食即足，應以此食轉施餘僧。",
        "translation": "After accepting the food, the donor comes and asks for it, and the food that's included is sufficient, so he should give it to the other saṃgha with this food.",
        "source": "T24n1463_002:0809c19_17"
    },
    {
        "source_sentence": "彼僧得已，應作殘食法而食。",
        "translation": "After they obtain it, the saṃgha should make a method of eating leftover food and eat it.",
        "source": "T24n1463_002:0809c20_18"
    },
    {
        "source_sentence": "復有諸大師為國主所重請食，彼中食足，餘殘將來施同住處僧。",
        "translation": "Again, there were great masters who had repeatedly invited food for the sake of the lord of the kingdom. Their food was plentiful and the remainder was about to be given to the monks living together with them.",
        "source": "T24n1463_002:0809c20_19"
    },
    {
        "source_sentence": "僧怖不食。",
        "translation": "The saṃgha was afraid and didn't eat.",
        "source": "T24n1463_002:0809c22_20"
    },
    {
        "source_sentence": "佛言：『聽汝作殘食法食之無過。』",
        "translation": "The Buddha said, 'There's nothing wrong with listening to you make leftover food for the Dharma and food.'",
        "source": "T24n1463_002:0809c22_21"
    },
    {
        "source_sentence": "有比丘外得菓來即與淨施主，施主值世飢饉不還本主。",
        "translation": "Suppose there's a monk who comes from outside to obtain fruit and gives it to the pure donor, and the donor meets worldly hunger and doesn't return to his original donor.",
        "source": "T24n1463_002:0809c23_22"
    },
    {
        "source_sentence": "佛因而制戒：『從今已去，若飢饉世得自畜而食。",
        "translation": "The Buddha therefore established the precepts, saying, 'From now on, if you're hungry in the world, you can store it yourself and eat it.",
        "source": "T24n1463_002:0809c24_23"
    },
    {
        "source_sentence": "池中菓一切菓亦如是。』",
        "translation": "So are the fruits in the pond and all the fruits.'",
        "source": "T24n1463_002:0809c25_24"
    },
    {
        "source_sentence": "「畜鉢法。",
        "translation": "It's the method of storing bowls.",
        "source": "T24n1463_002:0809c26_25"
    },
    {
        "source_sentence": "除鐵鉢、瓦鉢，餘一切鉢皆不得畜。",
        "translation": "Except for an iron bowl and a tile bowl, no other bowls may be stored.",
        "source": "T24n1463_002:0809c26_26"
    },
    {
        "source_sentence": "「色中上色衣不應畜。",
        "translation": "You shouldn't store the upper colored robes in form.",
        "source": "T24n1463_002:0809c27_27"
    },
    {
        "source_sentence": "何者？",
        "translation": "What's that?",
        "source": "T24n1463_002:0809c27_28"
    },
    {
        "source_sentence": "錦紋鬘花如此等衣不中畜。",
        "translation": "Such robes as brocaded silk, patterned silk, and cloth like this don't belong in the middle.",
        "source": "T24n1463_002:0809c27_29"
    },
    {
        "source_sentence": "「應說者，有比丘生念：『云何修諸善法？』",
        "translation": "You should say, 'There's a monk who thinks, 'How do you cultivate good qualities?'",
        "source": "T24n1463_002:0809c28_30"
    },
    {
        "source_sentence": "往詣諸智者所，問言：『云何名犯？",
        "translation": "He went to the wise and asked, 'What's the name of the offense?'",
        "source": "T24n1463_002:0809c29_31"
    },
    {
        "source_sentence": "云何不犯？",
        "translation": "How is it not a violation?",
        "source": "T24n1463_002:0809c29_32"
    },
    {
        "source_sentence": "云何懺悔？",
        "translation": "What is repentance?",
        "source": "T24n1463_002:0810a01_33"
    },
    {
        "source_sentence": "因何事而犯？』",
        "translation": "What is the reason for violating it?'",
        "source": "T24n1463_002:0810a01_34"
    },
    {
        "source_sentence": "彼師隨順毘尼為說犯不犯，如是廣，應當知。",
        "translation": "That teacher follows the Vinaya and explains for them what's violated and what's not violated, which is so extensive as to be known.",
        "source": "T24n1463_002:0810a01_35"
    },
    {
        "source_sentence": "問者聞師說已，心中無復憂苦，隨順師教如毘尼而行，心得清淨隨順善法，更無餘念，是名應說。",
        "translation": "When the questioner hears what his teacher teaches, there's no more grief or suffering in his mind, follows his teacher's instructions and conducts himself according to the vinaya, becomes pure and follows the good qualities, and has no residual thoughts, which is called what should be taught.",
        "source": "T24n1463_002:0810a02_36"
    },
    {
        "source_sentence": "又復應說者，比丘生念：『厭患生死，云何出離修道而得涅槃？』",
        "translation": "Furthermore, it should also be said that a monk gives rise to the thought, 'A monk who's disillusioned with birth and death, how can he escape cultivation and attain nirvāṇa?'",
        "source": "T24n1463_002:0810a04_37"
    },
    {
        "source_sentence": "生此念已，即到智者邊問之：『尊者大德！",
        "translation": "After he had this thought, he went to the wise man's side and asked him, 'Venerable Mañjuśrī!",
        "source": "T24n1463_002:0810a06_38"
    },
    {
        "source_sentence": "云何修四禪乃至四果？』",
        "translation": "How do you cultivate the four meditations and even the four fruits?'",
        "source": "T24n1463_002:0810a07_39"
    },
    {
        "source_sentence": "彼師次第為說，乃至阿羅漢果，是名應說。",
        "translation": "That teacher explains it in order, up to the fruit of arhatship, which is called what should be explained.",
        "source": "T24n1463_002:0810a07_40"
    },
    {
        "source_sentence": "云何名為非法說？",
        "translation": "What's called an unlawful teaching?",
        "source": "T24n1463_002:0810a08_41"
    },
    {
        "source_sentence": "彼師為問者說，法說非法、非法說法，乃至所說名非所說、不所說名所說，限量作非限量、非限量作限量，分別名不分別、不分別名分別，從食鉢乃至飲皆亦如是。",
        "translation": "That teacher teaches for the questioner, saying that what's taught according to the teaching is unlawful and what's taught according to the teaching is unlawful, even that what's taught is called what's not taught and what's not taught is called what's taught, that limited is made into a limited, that limited is made into a limited, that limited is made into a limited, that discriminated is called nondiscrimina",
        "source": "T24n1463_002:0810a08_42"
    },
    {
        "source_sentence": "又不應說者，有比丘問智者：『云何得初禪乃至四果？』",
        "translation": "Also, it shouldn't be explained that there are monks who ask the wise person questions, 'How can they attain the first dhyāna or even the four fruits?'",
        "source": "T24n1463_002:0810a12_43"
    },
    {
        "source_sentence": "智者為說：『汝之所問得過人法。",
        "translation": "The wise one said to him, 'That question you've asked obtains a teaching that's beyond the ability of people.",
        "source": "T24n1463_002:0810a13_44"
    },
    {
        "source_sentence": "汝犯波羅夷。』",
        "translation": "You've violated the pārājika.'",
        "source": "T24n1463_002:0810a14_45"
    },
    {
        "source_sentence": "是名不應說。",
        "translation": "This is called something that shouldn't be explained.",
        "source": "T24n1463_002:0810a14_46"
    },
    {
        "source_sentence": "往時有比丘，字難提伽。",
        "translation": "In the past, there was a monk named Nandika.",
        "source": "T24n1463_002:0810a15_47"
    },
    {
        "source_sentence": "失性，於眾僧布薩日，或憶或不憶，憶時來、不憶不來。",
        "translation": "The nature of loss is that it's either remembered or not remembered on the day when the saṃgha precepts are taught, and it's remembered when it comes or not remembered when it doesn't.",
        "source": "T24n1463_002:0810a15_48"
    },
    {
        "source_sentence": "諸比丘往白世尊。",
        "translation": "The monks went to the Bhagavān and told him.",
        "source": "T24n1463_002:0810a16_49"
    },
    {
        "source_sentence": "佛告言：『但與此比丘作失性白二羯磨。",
        "translation": "The Buddha told them, 'I'll simply perform the two karman rituals of making a mistake with this monk.",
        "source": "T24n1463_002:0810a17_50"
    },
    {
        "source_sentence": "雖不來，法事成就。』",
        "translation": "Even though it doesn't come, the Dharma service will be accomplished.'",
        "source": "T24n1463_002:0810a18_51"
    },
    {
        "source_sentence": "此布薩犍度中廣明。",
        "translation": "This is explained in detail in the uposatha-pāramitā.",
        "source": "T24n1463_002:0810a18_52"
    },
    {
        "source_sentence": "此比丘還得本心，心中生疑，本失性羯磨為捨不捨？",
        "translation": "When this monk returns to his original mind, doubt arises in his mind, and the karma of the originally lost nature is equanimous or not?",
        "source": "T24n1463_002:0810a19_53"
    },
    {
        "source_sentence": "往白世尊。",
        "translation": "He went to the Bhagavān and said.",
        "source": "T24n1463_002:0810a20_54"
    },
    {
        "source_sentence": "佛言：『得心者可捨之。』",
        "translation": "The Buddha said, 'He who has attained the mind can abandon it.'",
        "source": "T24n1463_002:0810a20_55"
    },
    {
        "source_sentence": "諸比丘復疑：『後還失心，此復云何？』",
        "translation": "The monks again wondered, 'After that, what's the point of losing your mind?'",
        "source": "T24n1463_002:0810a20_56"
    },
    {
        "source_sentence": "佛言：『還作失性羯磨，後得本心還捨。』",
        "translation": "The Buddha said, 'Return to the karman of losing one's nature and return it after attaining the original mind.'",
        "source": "T24n1463_002:0810a21_57"
    },
    {
        "source_sentence": "「比丘受人施，不如法，為施所墮。",
        "translation": "A monk who receives a donation from someone doesn't follow the teaching and falls into the category of giving.",
        "source": "T24n1463_002:0810a22_58"
    },
    {
        "source_sentence": "墮有二種：一者食他人施，不如法修道，放心縱逸無善可記；",
        "translation": "There are two kinds of falling. The first is giving food to others and not practicing the path in accordance with the Dharma. Being at ease or indulging in idleness, there is nothing good to remember.",
        "source": "T24n1463_002:0810a23_59"
    },
    {
        "source_sentence": "二者與施轉施，施不如法。",
        "translation": "The second is giving and transforming it into giving, which is not according to the teaching.",
        "source": "T24n1463_002:0810a24_60"
    },
    {
        "source_sentence": "因此二處當墮三途。",
        "translation": "Because of these two places, they'll fall into the three paths.",
        "source": "T24n1463_002:0810a25_61"
    },
    {
        "source_sentence": "若無三途受報，此身即腹壞食出，所著衣服即應離身。",
        "translation": "If there were no retribution in the three paths, this body would be broken and eaten out of its abdomen, and the clothes it wears would part with its body.",
        "source": "T24n1463_002:0810a25_62"
    },
    {
        "source_sentence": "「應施者，若父母貧苦，應先授三歸五戒十善然後施與。",
        "translation": "You should give because if your parents are poor and suffering, you should first bestow the three refuges, five precepts, ten good qualities, and then give them.",
        "source": "T24n1463_002:0810a26_63"
    },
    {
        "source_sentence": "若不貧，雖受三歸五戒，不中施與。",
        "translation": "If someone isn't poor, even though they receive the three refuges and five precepts, they won't give them in the middle.",
        "source": "T24n1463_002:0810a28_64"
    },
    {
        "source_sentence": "復有施處：一者治塔人；",
        "translation": "Again, there is another sphere of unlimited benefit:",
        "source": "T24n1463_002:0810a28_65"
    },
    {
        "source_sentence": "二者奉僧人；",
        "translation": "The second is to serve the Sangha.",
        "source": "T24n1463_002:0810a29_66"
    },
    {
        "source_sentence": "三者治僧房人；",
        "translation": "The third was to govern the monks’ quarters.",
        "source": "T24n1463_002:0810a29_67"
    },
    {
        "source_sentence": "四者病苦人；",
        "translation": "The fourth is that of those suffering from illness.",
        "source": "T24n1463_002:0810b01_68"
    },
    {
        "source_sentence": "五者嬰兒；",
        "translation": "The fifth is that of the infant.",
        "source": "T24n1463_002:0810b01_69"
    },
    {
        "source_sentence": "六者懷妊女人；",
        "translation": "The sixth is a pregnant woman.",
        "source": "T24n1463_002:0810b01_70"
    },
    {
        "source_sentence": "七者牢獄繫人；",
        "translation": "The seventh is to imprison those who are bound by bonds.",
        "source": "T24n1463_002:0810b02_0"
    },
    {
        "source_sentence": "八者來詣僧房乞人。",
        "translation": "Eight, he came to the saṃgha's room to solicit alms.",
        "source": "T24n1463_002:0810b02_1"
    },
    {
        "source_sentence": "如此等人，或中與、或不中與。",
        "translation": "Such people are sometimes given in the middle and sometimes not given in the middle.",
        "source": "T24n1463_002:0810b02_2"
    },
    {
        "source_sentence": "治塔、奉僧、治僧房人，計其功勞當償作價；",
        "translation": "The construction of the stupas, the service to the Sangha, and the maintenance of the chambers for the sangha will be valued at the expense of their labor.",
        "source": "T24n1463_002:0810b03_3"
    },
    {
        "source_sentence": "若過分與，為施所墮。",
        "translation": "If it's given in error, it's a gift that falls into the category of giving.",
        "source": "T24n1463_002:0810b04_4"
    },
    {
        "source_sentence": "施病者食，當作慈心，隨病者所宜而施與之。",
        "translation": "Giving food to someone who's sick should be done with a compassionate mind, giving it to them as they see fit.",
        "source": "T24n1463_002:0810b04_5"
    },
    {
        "source_sentence": "若設病錯誤與食，為施所墮。",
        "translation": "If someone is sick and mistakenly given food, they'll fall into the category of giving.",
        "source": "T24n1463_002:0810b05_6"
    },
    {
        "source_sentence": "嬰兒、牢獄繫人、懷妊者，如此人等當以慈心施之，勿望出入得報，當為佛法不作留難。",
        "translation": "A baby, a prisoner bound to someone who's pregnant, or someone who's pregnant should be given by such people with kindness and not expecting rewards from leaving or entering, so that they won't make it difficult for the Buddha's teaching.",
        "source": "T24n1463_002:0810b06_7"
    },
    {
        "source_sentence": "如此等心施之如法，若不爾為施所墮。",
        "translation": "Giving with such a mind is given according to the teaching, and if that's not the case, it will fall into giving.",
        "source": "T24n1463_002:0810b08_8"
    },
    {
        "source_sentence": "詣僧房乞，若自有糧，不須施之，施者為施所墮；",
        "translation": "If someone goes to the monks’ quarters to beg for food and has provisions of his own, he does not need to give them. Giving is a form of giving that will fall into it.",
        "source": "T24n1463_002:0810b09_9"
    },
    {
        "source_sentence": "若無糧食，施之無過。",
        "translation": "If you don't have food, it's no offense to give it.",
        "source": "T24n1463_002:0810b10_10"
    },
    {
        "source_sentence": "若比丘不坐禪不誦經、不營佛法僧事，受人施，為施所墮。",
        "translation": "If a monk doesn't sit in meditation, doesn't recite sūtras, and doesn't work for the Buddha, Dharma, or Saṃgha, and receives donations from others, he'll fall into the category of giving.",
        "source": "T24n1463_002:0810b10_11"
    },
    {
        "source_sentence": "若有三業，受施無過。",
        "translation": "If there are three actions, it's not wrong to accept a gift.",
        "source": "T24n1463_002:0810b12_12"
    },
    {
        "source_sentence": "若前人無三業，知而轉施與者，受施能施二皆為施所墮。",
        "translation": "If the person before him didn't have three actions, and he knew and gave them to someone else, then both those who receive and those who give and those who can give would all fall into giving.",
        "source": "T24n1463_002:0810b12_13"
    },
    {
        "source_sentence": "若比丘食檀越施，以知足為限，若飽強飲食者，為施所墮。",
        "translation": "If a monk eats donations given by donors and takes the limit of knowing what's sufficient, and if he is satisfied with strong food and drink, he'll fall into the category of giving.",
        "source": "T24n1463_002:0810b13_14"
    },
    {
        "source_sentence": "若比丘作憍慢意自飲食者，為施所墮。",
        "translation": "If a monk becomes conceited and eats on his own, he'll fall into the category of giving.",
        "source": "T24n1463_002:0810b15_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_002:0810b16_16"
    },
    {
        "source_sentence": "世尊於長夜中常讚歎限食。",
        "translation": "The Bhagavān always praised limited food for a long time during the night.",
        "source": "T24n1463_002:0810b16_17"
    },
    {
        "source_sentence": "最後乃至施持戒者，能受施能消施也。",
        "translation": "The last one, up to the one who gives and observes precepts, is someone who can accept generosity and extinguishes generosity.",
        "source": "T24n1463_002:0810b16_18"
    },
    {
        "source_sentence": "如佛說曰：『施持戒者果報益大，施破戒者得果報甚少。』",
        "translation": "As the Buddha said, 'The reward for giving and observing precepts is great, and the reward for giving and violating precepts is very small.'",
        "source": "T24n1463_002:0810b17_19"
    },
    {
        "source_sentence": "如佛說偈：『寧吞鐵丸而死，不以無戒食人信施。』",
        "translation": "As the Buddha said in a verse, 'I'd rather swallow an iron ball and die than believe in giving it to someone who eats without precepts.'",
        "source": "T24n1463_002:0810b19_0"
    },
    {
        "source_sentence": "若食足已更強食者，不加色力但增其患，是故不應無度食也。",
        "translation": "If someone who eats after they're sufficient and then eats more strongly, they don't add physical strength but increase their suffering; therefore, they shouldn't eat without limit.",
        "source": "T24n1463_002:0810b20_1"
    },
    {
        "source_sentence": "「羯磨者，有四因緣羯磨得成：一如法；",
        "translation": "“Commentary: There are four reasons assemblies can be accomplished:",
        "source": "T24n1463_002:0810b21_2"
    },
    {
        "source_sentence": "二僧齊集；",
        "translation": "The second is the assembly of monks.",
        "source": "T24n1463_002:0810b22_3"
    },
    {
        "source_sentence": "三如法白一處白一乃至白四處白四，白四處不三二一白；",
        "translation": "The third is to explain in accordance with the doctrine that one part of whiteness is white, and four parts of whiteness are white. Four parts of whiteness are not three, two, or one white.",
        "source": "T24n1463_002:0810b22_4"
    },
    {
        "source_sentence": "四者眾僧不來者與欲，眾中無說難者。",
        "translation": "4. The saṃgha doesn't come to give it to those who desire it, and there's no difficulty explained among the saṃgha.",
        "source": "T24n1463_002:0810b23_5"
    },
    {
        "source_sentence": "此四法成就，是名如法羯磨。",
        "translation": "When these four things are accomplished, this is called the karma-karma according to the teachings.",
        "source": "T24n1463_002:0810b24_6"
    },
    {
        "source_sentence": "此事章卑犍度中當廣知。",
        "translation": "This matter will be explained in detail in the chapter on the Upagupta-pāramitā.",
        "source": "T24n1463_002:0810b25_7"
    },
    {
        "source_sentence": "非羯磨者，四事不成不名羯磨。",
        "translation": "What's not a karma is that four things don't become karma and aren't called karma.",
        "source": "T24n1463_002:0810b26_0"
    },
    {
        "source_sentence": "「毘尼者，有種種毘尼，有犯毘尼、有鬪諍毘尼、有煩惱毘尼、比丘毘尼、比丘尼毘尼、少分毘尼、一切處毘尼、從犯毘尼、出罪毘尼。",
        "translation": "The vinaya refers to various vinayas: the vinaya for offenses, the vinaya for quarrels, the vinaya for afflictions, the vinaya for monks, the vinaya for nuns, the vinaya for bhikṣus, the vinaya for minor offenses, the vinaya for all places, the vinaya for transgressions, and the vinaya for expulsion.",
        "source": "T24n1463_002:0810b26_1"
    },
    {
        "source_sentence": "又毘尼，能滅不善根、能滅障法、能滅五蓋惡行，名為毘尼。",
        "translation": "Also, the vinaya that extinguishes unwholesome roots, extinguishes hindrances, and extinguishes the five hindrances to bad actions is called the vinaya.",
        "source": "T24n1463_002:0810b29_2"
    },
    {
        "source_sentence": "復有毘尼，能發露隨順修行、捨惡從善，名為毘尼。",
        "translation": "Also, there's a vinaya that reveals the practice of following and abandoning evil and following goodness, which is called a vinaya.",
        "source": "T24n1463_002:0810c01_3"
    },
    {
        "source_sentence": "云何名為發露？",
        "translation": "What's called revealing?",
        "source": "T24n1463_002:0810c03_4"
    },
    {
        "source_sentence": "所犯不隱盡向人說，名為發露。",
        "translation": "The offense that isn't concealed and fully explained to others is called revealing.",
        "source": "T24n1463_002:0810c03_5"
    },
    {
        "source_sentence": "此事滅罪犍度中廣說。",
        "translation": "This matter is explained in detail in the chapter on extinguishing sins.",
        "source": "T24n1463_002:0810c04_6"
    },
    {
        "source_sentence": "隨順者，隨順和上所說、隨順阿闍梨所說，乃至眾僧所說皆不違逆，是名隨順。",
        "translation": "A follower is someone who follows what the superior teaches and follows what the preceptor teaches, even if they don't disobey what the saṃgha teaches, which is called following.",
        "source": "T24n1463_002:0810c04_7"
    },
    {
        "source_sentence": "云何名為滅？",
        "translation": "What's called cessation?",
        "source": "T24n1463_002:0810c06_8"
    },
    {
        "source_sentence": "能滅鬪諍，故名為滅。",
        "translation": "It's called cessation because it extinguishes fighting.",
        "source": "T24n1463_002:0810c07_9"
    },
    {
        "source_sentence": "云何名為斷？",
        "translation": "What's called stopping?",
        "source": "T24n1463_002:0810c07_10"
    },
    {
        "source_sentence": "如斷煩惱名為斷。",
        "translation": "As the afflictions are stopped, they're called stopped.",
        "source": "T24n1463_002:0810c07_11"
    },
    {
        "source_sentence": "煩惱毘尼、斷煩惱毘尼中應當廣知。",
        "translation": "The afflictive vinaya and the vinaya on ending afflictions should be understood in detail.",
        "source": "T24n1463_002:0810c08_12"
    },
    {
        "source_sentence": "又比丘說言：『如我所知見者，欲不能障道。』",
        "translation": "Again, the monk said, 'As I know and see, desire can't obstruct the path.'",
        "source": "T24n1463_002:0810c09_13"
    },
    {
        "source_sentence": "餘比丘諫言：『莫作是語，欲者是障道之本。",
        "translation": "The other monks remonstrated, saying, 'Don't say such words; desire is the root of the path of obstruction.",
        "source": "T24n1463_002:0810c10_14"
    },
    {
        "source_sentence": "所以知之，世尊種種為欲作喻，欲如火坑乃至刀喻等。",
        "translation": "That's why we know that the Bhagavān makes various metaphors for desire, such as the metaphor of wanting like a fire pit or even a sword.",
        "source": "T24n1463_002:0810c11_15"
    },
    {
        "source_sentence": "云何言不障？",
        "translation": "How can it be said to be unobstructed?",
        "source": "T24n1463_002:0810c12_16"
    },
    {
        "source_sentence": "當捨此見。』",
        "translation": "You must abandon this view.'",
        "source": "T24n1463_002:0810c12_17"
    },
    {
        "source_sentence": "諸比丘諫時，受諫者好。",
        "translation": "When the monks remonstrate, it's good for those who receive remonstration.",
        "source": "T24n1463_002:0810c12_18"
    },
    {
        "source_sentence": "若不受，諸比丘當為作白四羯磨憶之，是名棄捨惡見比丘過語。",
        "translation": "If they don't accept it, the monks will make a confession to the four karmas and remember it for them, which is called renouncing the faulty words of the monk who abandons bad views.",
        "source": "T24n1463_002:0810c13_19"
    },
    {
        "source_sentence": "諸比丘集作法事，不如法眾中有見，眾僧作法事不成。",
        "translation": "The monks gathered together to perform religious duties that weren't according to the teachings, and there was a view among the congregation that the saṃgha didn't perform religious duties.",
        "source": "T24n1463_002:0810c14_20"
    },
    {
        "source_sentence": "此人若有三四五伴，可得諫之。",
        "translation": "If this man has three, four, or five companions, you can admonish him.",
        "source": "T24n1463_002:0810c16_21"
    },
    {
        "source_sentence": "若獨一，不須諫也。",
        "translation": "If he's alone, there's no need to admonish him.",
        "source": "T24n1463_002:0810c16_22"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1463_002:0810c17_23"
    },
    {
        "source_sentence": "大眾力大或能擯出，於法無益自得苦惱。",
        "translation": "The great power of the masses may be so great that they can coarsely escape, but it's useless to get pain and suffering for themselves in terms of the Dharma.",
        "source": "T24n1463_002:0810c17_24"
    },
    {
        "source_sentence": "以是義故，應默然不言。",
        "translation": "Because of this meaning, they should be silent and not say anything.",
        "source": "T24n1463_002:0810c18_25"
    },
    {
        "source_sentence": "「若入僧中，應立五德：一者常起慈心，如掃扠喻，好惡平等皆欲令得善。",
        "translation": "If he enters the saṃgha, five virtues should be established: first, always cultivating a mind of kindness, like the parable of sweeping dirt, equality of good and evil, and wanting to make them wholesome.",
        "source": "T24n1463_002:0810c18_26"
    },
    {
        "source_sentence": "二者於諸上座常起恭敬謙下之心，無得慢也。",
        "translation": "The second is that they always show respect and humbleness to the superior monks without conceit.",
        "source": "T24n1463_002:0810c20_27"
    },
    {
        "source_sentence": "三者於諸下座勿得談論而共交由。",
        "translation": "Third, the bhikṣus should not engage in arguments with those seated below them.",
        "source": "T24n1463_002:0810c21_28"
    },
    {
        "source_sentence": "四者若僧集作法事時，大眾應請一知法者說法。",
        "translation": "4. When the saṃgha gathers to perform a Dharma service, the masses should invite one person who knows the Dharma to teach the Dharma.",
        "source": "T24n1463_002:0810c22_29"
    },
    {
        "source_sentence": "五者若眾不請，應語眾令請知法說。",
        "translation": "5. If the congregation isn't invited, he or she should speak to the congregation and ask them to know the teaching.",
        "source": "T24n1463_002:0810c23_30"
    },
    {
        "source_sentence": "舍利弗亦成就上五種入僧法。",
        "translation": "Śāriputra also accomplished the above five ways to enter the saṃgha.",
        "source": "T24n1463_002:0810c24_31"
    },
    {
        "source_sentence": "「云何名白？",
        "translation": "What's called white?",
        "source": "T24n1463_002:0810c25_32"
    },
    {
        "source_sentence": "『迦葉！",
        "translation": "'Kāśyapa!",
        "source": "T24n1463_002:0810c25_33"
    },
    {
        "source_sentence": "隨比丘說言，眾皆聽許，默然故。』",
        "translation": "Following the monks' words, the crowd listened and approved, remaining silent.'",
        "source": "T24n1463_002:0810c25_34"
    },
    {
        "source_sentence": "名為白。",
        "translation": "It's called white.",
        "source": "T24n1463_002:0810c26_35"
    },
    {
        "source_sentence": "白一處是，如初度沙彌、受大戒時白僧，白僧已差教授師，將出家者屏猥處問其遮法。",
        "translation": "It's said to be one place, such as when he first liberates a novice or tells the saṃgha about the great precepts at the time of accepting the precepts, and after telling the saṃgha, he sends a teacher who's about to leave home and asks him about the refutation of the teaching in a secluded place.",
        "source": "T24n1463_002:0810c26_36"
    },
    {
        "source_sentence": "為欲說波羅提木叉、若自恣、若鉢破更受。",
        "translation": "He wants to explain the prātimokṣa, whether it's self-restraint or a bowl that breaks and accepts it again.",
        "source": "T24n1463_002:0810c28_37"
    },
    {
        "source_sentence": "有一比丘字闡陀，始欲犯戒。",
        "translation": "There was a monk named Chanda who had just begun to violate the precepts.",
        "source": "T24n1463_002:0810c29_38"
    },
    {
        "source_sentence": "諸比丘知已諫之。",
        "translation": "The monks knew and remonstrated with him.",
        "source": "T24n1463_002:0810c29_39"
    },
    {
        "source_sentence": "此比丘語諸比丘言：『汝等何所說？",
        "translation": "This monk said to the monks, 'What are you saying?'",
        "source": "T24n1463_002:0810c30_40"
    },
    {
        "source_sentence": "共誰言？",
        "translation": "To whom do they say it together?",
        "source": "T24n1463_002:0811a01_41"
    },
    {
        "source_sentence": "誰有犯者？",
        "translation": "Who commits an offense?",
        "source": "T24n1463_002:0811a01_42"
    },
    {
        "source_sentence": "云何名犯？』",
        "translation": "What's called a violation?'",
        "source": "T24n1463_002:0811a01_43"
    },
    {
        "source_sentence": "作如此異語。",
        "translation": "He said this kind of strange thing.",
        "source": "T24n1463_002:0811a01_44"
    },
    {
        "source_sentence": "諸比丘白佛。",
        "translation": "The monks said to the Buddha,",
        "source": "T24n1463_002:0811a02_0"
    },
    {
        "source_sentence": "佛言：『與此比丘作異語別住羯磨。』",
        "translation": "The Buddha said, 'I'll make a different statement to this monk and live separately in the karma.'",
        "source": "T24n1463_002:0811a02_1"
    },
    {
        "source_sentence": "闡陀比丘後時復更輕弄諸比丘。",
        "translation": "At some point later, the monk Cunda again teased the other monks.",
        "source": "T24n1463_002:0811a03_2"
    },
    {
        "source_sentence": "諸比丘語莫坐便坐、莫起便起、莫語便語、莫來便來。",
        "translation": "The monks said, If you don't sit, then you'll sit; if you don't get up, then you'll get up; if you don't speak, then you speak; and if you don't come, then you'll come.",
        "source": "T24n1463_002:0811a03_3"
    },
    {
        "source_sentence": "諸比丘白佛。",
        "translation": "The monks said to the Buddha,",
        "source": "T24n1463_002:0811a05_0"
    },
    {
        "source_sentence": "佛言：『為作調弄白一羯磨。』",
        "translation": "The Buddha said, 'I'll make a white karma for the sake of taming it.'",
        "source": "T24n1463_002:0811a05_1"
    },
    {
        "source_sentence": "如此等及餘未列名者，皆名白一羯磨。",
        "translation": "These and the others that have not been named are all called white karmas.",
        "source": "T24n1463_002:0811a05_2"
    },
    {
        "source_sentence": "「云何名為白二羯磨？",
        "translation": "What are the two white karmas?",
        "source": "T24n1463_002:0811a06_3"
    },
    {
        "source_sentence": "白者，『大德僧聽！",
        "translation": "He said, 'Listen, great virtuous monks!",
        "source": "T24n1463_002:0811a07_4"
    },
    {
        "source_sentence": "某甲房舍隤毀。",
        "translation": "A certain person's dwelling house is completely destroyed.",
        "source": "T24n1463_002:0811a07_5"
    },
    {
        "source_sentence": "若僧時到僧忍聽，僧與某甲房舍與某檀越修治及與營事比丘。",
        "translation": "If the saṃgha arrives at the saṃgha's time and the saṃgha tolerates it, the saṃgha gives a certain monk in a certain dwelling to a certain donor to cultivate it and give it to a monk who works for it.",
        "source": "T24n1463_002:0811a08_0"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T24n1463_002:0811a09_1"
    },
    {
        "source_sentence": "『大德僧聽！",
        "translation": "'Listen, great virtuous monks!",
        "source": "T24n1463_002:0811a09_2"
    },
    {
        "source_sentence": "某房舍某房舍，無檀越，隤毀。",
        "translation": "A certain dwelling, a certain dwelling, or a certain dwelling without a donor, is destroyed.",
        "source": "T24n1463_002:0811a09_3"
    },
    {
        "source_sentence": "僧今與某房舍與某檀越令修治及營事比丘。",
        "translation": "Now, the saṃgha gave a certain dwelling to a certain donor and asked him to cultivate it and serve the monks.",
        "source": "T24n1463_002:0811a10_4"
    },
    {
        "source_sentence": "若僧忍者持某房舍與某檀越令修治及營事比丘，僧忍者默然；",
        "translation": "If a ninja of the samgha takes a certain dwelling and gives it to a certain donor, causing him or her to cultivate and attend to the bhikṣus, the ninja of the samgha remains silent.",
        "source": "T24n1463_002:0811a11_5"
    },
    {
        "source_sentence": "不忍者便說。",
        "translation": "Those who can't tolerate it then explain it.",
        "source": "T24n1463_002:0811a13_6"
    },
    {
        "source_sentence": "僧已忍持某房舍與某檀越及營事比丘竟。",
        "translation": "The saṃgha has tolerated the completion of carrying a certain dwelling, giving it to a certain donor and a monk who works for it.",
        "source": "T24n1463_002:0811a13_7"
    },
    {
        "source_sentence": "僧忍，默然故，是事如是持。』",
        "translation": "Because the saṃgha tolerated it and remained silent, these things are thus maintained.'",
        "source": "T24n1463_002:0811a14_8"
    },
    {
        "source_sentence": "營僧事人分亡比丘衣鉢，受迦絺那衣、捨迦絺那衣，一切結界不離衣宿法，先結大界後結不失衣界、先捨不失衣界後捨大界，教授比丘尼自恣。",
        "translation": "When the person who serves the saṃgha shares the lost monk's robe and bowl, he accepts the kaṭhina robe and abandons the kaṭhina robe, and all the fetters don't part from the nightly rules for clothing, first fetters the great fetter, then fetters the realm of not losing a robe, first abandons the realm of not losing a robe, then abandons the great",
        "source": "T24n1463_002:0811a15_9"
    },
    {
        "source_sentence": "如是等眾多，皆白二羯磨。",
        "translation": "Such a large group of people all told the two karmas.",
        "source": "T24n1463_002:0811a18_10"
    },
    {
        "source_sentence": "「白四羯磨者，白已三羯磨，是名白四羯磨。",
        "translation": "To explain the four karmas is to explain the three karmas that have been explained, which are called the four white karmas.",
        "source": "T24n1463_002:0811a18_11"
    },
    {
        "source_sentence": "一者呵責。",
        "translation": "One is to criticize.",
        "source": "T24n1463_002:0811a19_12"
    },
    {
        "source_sentence": "二者有比丘共白衣鬪，眾僧勸令與檀越懺悔，擯出滅擯、別住還行本事、行摩那埵、行阿浮呵那乃至七滅諍。",
        "translation": "Second, if there's a monk who fights with the white robes and is encouraged by the saṃgha to make repentance with the donor, he extinguishes anger when he walks out and leaves it, returns to his original duty when he lives separately, practices manasattva, practices abhidharma, and even extinguishes anger seven times.",
        "source": "T24n1463_002:0811a20_13"
    },
    {
        "source_sentence": "有比丘大德，為巨富信心檀越所重，請其多年，隨其所須供給與之。",
        "translation": "A monk of great virtue, esteemed by the great wealthy and faithful donors, asked him to make offerings as needed for many years.",
        "source": "T24n1463_002:0811a22_14"
    },
    {
        "source_sentence": "傍人說曰：『此長者巨富，由比丘故大損其財。』",
        "translation": "The people around him said, 'This elderly man is so wealthy that it's because of the monk that he greatly damages his property.'",
        "source": "T24n1463_002:0811a24_15"
    },
    {
        "source_sentence": "癡失性比丘尼受戒已，來僧中乞戒；",
        "translation": "Monks and nuns with the nature of delusion, having received the precepts, came to the assembled assembly to ask for the precepts.",
        "source": "T24n1463_002:0811a25_16"
    },
    {
        "source_sentence": "犯戒事、覆鉢、默擯，如是等及餘未列者，皆白四羯磨。",
        "translation": "If someone violates the precepts, covers their bowl and remains silent, such things as these and the rest that aren't listed are all reported to the four karmas.",
        "source": "T24n1463_002:0811a26_17"
    },
    {
        "source_sentence": "「別住有二種。",
        "translation": "“There are two kinds of distinctive abodes.",
        "source": "T24n1463_002:0811a27_18"
    },
    {
        "source_sentence": "若有外道來入佛法中求出家者，僧應與四月別住白四羯磨。",
        "translation": "If there are non-Buddhist monks who come to enter the Buddha's teaching and seek to leave home, the saṃgha should give them four months to live separately and explain the four karmas.",
        "source": "T24n1463_002:0811a27_19"
    },
    {
        "source_sentence": "又復別住者，十三種種性於僧殘中若犯一一，不發露覆藏。",
        "translation": "Furthermore, those who live separately also have 13 different kinds of natures that don't reveal the hidden treasury if they violate one of the saṃgha's violations.",
        "source": "T24n1463_002:0811a28_20"
    },
    {
        "source_sentence": "後時發露，僧與白四羯磨別住。",
        "translation": "When it's revealed later, the saṃgha and the four white karmas will live separately.",
        "source": "T24n1463_002:0811b01_21"
    },
    {
        "source_sentence": "以何義故名為別住？",
        "translation": "What does it mean to be called a separate abode?",
        "source": "T24n1463_002:0811b02_0"
    },
    {
        "source_sentence": "別在一房不得與僧同處。",
        "translation": "They were separately in one room and couldn't be with the saṃgha.",
        "source": "T24n1463_002:0811b02_1"
    },
    {
        "source_sentence": "一切大僧下坐，不得連草食。",
        "translation": "All the great monks sat down below and were not allowed to eat from the herd of grass.",
        "source": "T24n1463_002:0811b03_2"
    },
    {
        "source_sentence": "又復一切眾僧苦役，掃塔及僧房，乃至僧大小行來處皆料理之。",
        "translation": "Again, all the saṃgha were subject to torture, sweeping down their stūpas and monks' quarters, and even taking care of them where the saṃgha came and went, large and small.",
        "source": "T24n1463_002:0811b03_3"
    },
    {
        "source_sentence": "又復雖入僧中，不得與僧談論，若有問者亦不得答。",
        "translation": "Again, even though he enters the saṃgha, he can't discuss it with the saṃgha, and if he asks a question, he can't answer it.",
        "source": "T24n1463_002:0811b05_4"
    },
    {
        "source_sentence": "以是義故，名為別住。",
        "translation": "Because of this meaning, it's called a separate abode.",
        "source": "T24n1463_002:0811b06_5"
    },
    {
        "source_sentence": "行本事者，別住時未竟，又復更犯，復從眾僧乞別住，僧還與本所覆藏日作白四羯磨，故名本事。",
        "translation": "When the original service is performed, it's called the original service because it's not finished when he's staying separately, and there are further offenses. Again, he begs from the saṃgha to stay separately, and the saṃgha returns with the four karmas of making a confession on the day that covers the originally covered hiding place.",
        "source": "T24n1463_002:0811b06_6"
    },
    {
        "source_sentence": "云何名為摩那埵。",
        "translation": "What's called manasattva?",
        "source": "T24n1463_002:0811b09_0"
    },
    {
        "source_sentence": "摩那埵者？",
        "translation": "manas?",
        "source": "T24n1463_002:0811b09_1"
    },
    {
        "source_sentence": "別住苦役與前住無異，但與日限少有異耳。",
        "translation": "There's no difference between the separate abode of suffering and the previous abode, but there's only a minor difference from the daytime limit.",
        "source": "T24n1463_002:0811b09_2"
    },
    {
        "source_sentence": "若犯時即發露者，亦六日六夜行之。",
        "translation": "If he reveals it at the time of offense, he'll also practice it for six days and nights.",
        "source": "T24n1463_002:0811b10_3"
    },
    {
        "source_sentence": "摩那埵者(秦言意喜)，前唯自意歡喜，亦生慚愧，亦使眾僧歡喜。",
        "translation": "Manaṭṭha (known as mind joy in the Qin language) is simply rejoicing in one's own mind, which also gives rise to shame and makes the saṃgha rejoice.",
        "source": "T24n1463_002:0811b11_4"
    },
    {
        "source_sentence": "由前喜故與其少日，因少日故始得喜名。",
        "translation": "Because of the former joy, it is given to him for a little time; because of this little time, he receives the name joy.",
        "source": "T24n1463_002:0811b12_5"
    },
    {
        "source_sentence": "眾僧喜者，觀此人所行法不復還犯，眾僧歎者言：『此人因此改悔，更不起煩惱成清淨人也。』",
        "translation": "The saṃgha rejoices when they observe that the person's practice won't be repeatedly violated, and the saṃgha praises them, saying, 'This person repents because of this, doesn't become a pure person with no more afflictions.'",
        "source": "T24n1463_002:0811b13_6"
    },
    {
        "source_sentence": "是故喜耳。",
        "translation": "That's why it's so joyous.",
        "source": "T24n1463_002:0811b15_7"
    },
    {
        "source_sentence": "阿浮呵那者，清淨戒生，得淨解脫。",
        "translation": "“Abhijana”: The pure moral precept arises and acquires a pure liberation.",
        "source": "T24n1463_002:0811b16_0"
    },
    {
        "source_sentence": "於此戒中清淨無犯，善持起去，是名阿浮呵那義。",
        "translation": "In these precepts, purity and non-violation are observed, and well-maintained arousal and departure are called the meaning of abhikṣuṇa.",
        "source": "T24n1463_002:0811b16_1"
    },
    {
        "source_sentence": "「有犯、不犯，犯者三種人犯：一不癡狂；",
        "translation": "When there is an offense and a non-occurrence, the offender commits it to three kinds of persons:",
        "source": "T24n1463_002:0811b17_2"
    },
    {
        "source_sentence": "二不散亂心；",
        "translation": "The second is undisturbed mind.",
        "source": "T24n1463_002:0811b18_3"
    },
    {
        "source_sentence": "三不為苦痛所逼。",
        "translation": "Three, they aren't oppressed by pain and suffering.",
        "source": "T24n1463_002:0811b19_0"
    },
    {
        "source_sentence": "是名為犯。",
        "translation": "This is called a violation.",
        "source": "T24n1463_002:0811b19_1"
    },
    {
        "source_sentence": "復有犯者，一切所犯輕重，隨彼佛所制處廣應當知。",
        "translation": "Again, if there's a violation, the relative seriousness of all the offenses should be known in detail according to the place where they're regulated by the Buddha.",
        "source": "T24n1463_002:0811b19_2"
    },
    {
        "source_sentence": "不犯者亦如是。",
        "translation": "It's likewise with someone who doesn't violate it.",
        "source": "T24n1463_002:0811b20_3"
    },
    {
        "source_sentence": "隨何篇所明，彼中廣應當知。",
        "translation": "Whatever the text explains, it should be understood in detail there.",
        "source": "T24n1463_002:0811b21_4"
    },
    {
        "source_sentence": "決了犯不犯義，一切當毘尼中推之。",
        "translation": "Determining the meaning of violating and not violating, they'll all be judged in the Vinaya.",
        "source": "T24n1463_002:0811b21_5"
    },
    {
        "source_sentence": "從初法非法不知，乃至懺悔不懺悔不知，此二十二種與人受具，皆名為犯。",
        "translation": "They don't know what's unlawful in the first teaching and don't know what's repentant or not repentant, and these twenty-two kinds of offerings to someone are all called offenses.",
        "source": "T24n1463_002:0811b22_6"
    },
    {
        "source_sentence": "欲決斷一切不犯者，應當毘尼中推之。",
        "translation": "Those who want to decide that all those who don't violate it should be judged in the Vinaya.",
        "source": "T24n1463_002:0811b24_7"
    },
    {
        "source_sentence": "有能成就二十二法者，應與人受具，是名不犯。",
        "translation": "If someone can accomplish the twenty-two dharmas, they should give them to someone to receive the full set of precepts, which is called not violating it.",
        "source": "T24n1463_002:0811b25_8"
    },
    {
        "source_sentence": "「有比丘犯非比丘尼犯，又比丘尼犯非比丘犯，又比丘比丘尼犯非式叉摩尼犯，又比丘比丘尼犯非沙彌沙彌尼犯。",
        "translation": "Again, some monks and nuns commit what's not a violation of the bhikṣuṇī, some other monks and nuns commit what's not a violation of the bhikṣuṇī, some other monks and nuns commit what's not a violation of the bhikṣuṇī, some other monks and nuns commit what's not a violation of the bhikṣuṇ",
        "source": "T24n1463_002:0811b26_9"
    },
    {
        "source_sentence": "或有出家五眾犯非優婆塞優婆夷犯。",
        "translation": "Perhaps there are five groups of renunciant monks who commit crimes that aren't committed by laymen or laymen.",
        "source": "T24n1463_002:0811b28_10"
    },
    {
        "source_sentence": "復有七眾皆犯。",
        "translation": "Again, there are seven groups of people who all violate it.",
        "source": "T24n1463_002:0811b29_11"
    },
    {
        "source_sentence": "何等名為比丘犯非比丘尼犯？",
        "translation": "What's called a monk who violates it and a nun who doesn't violate it?",
        "source": "T24n1463_002:0811c01_12"
    },
    {
        "source_sentence": "如阿練若住處所行法，比丘尼不行，比丘犯非比丘尼犯。",
        "translation": "Suppose a monk or nun doesn't practice the rules of the abode where he or she lives in a forest, and a monk or nun commits an offense that's not a monk or nun.",
        "source": "T24n1463_002:0811c01_13"
    },
    {
        "source_sentence": "有一比丘在阿練若處住，懈怠不能瓶中盛水亦復無食。",
        "translation": "There was a monk who lived in Ālīyatana but couldn't fill the pot with water because he was lazy and didn't eat.",
        "source": "T24n1463_002:0811c03_14"
    },
    {
        "source_sentence": "後時有賊來，從索水索食皆不得，瞋恚即打此比丘。",
        "translation": "Later, a thief came along and begged for water and food, but they all couldn't get it, so angrily they beat this monk.",
        "source": "T24n1463_002:0811c04_15"
    },
    {
        "source_sentence": "如來知已後與制戒：阿練若處住者，皆應瓶盛水、殘食少多留之，賊來索可與耳。",
        "translation": "Knowing this, the Tathāgata then gave them the precepts: Those who live in a forest dwelling place should always leave a pot full of water and a small amount of leftover food with them, so that the thief can give it to them if he asks for it.",
        "source": "T24n1463_002:0811c05_16"
    },
    {
        "source_sentence": "如是等皆比丘法，非比丘尼所行法。",
        "translation": "These are all monks' dharmas, not the dharmas practiced by monks and nuns.",
        "source": "T24n1463_002:0811c07_17"
    },
    {
        "source_sentence": "「何者比丘尼犯非比丘犯？",
        "translation": "What's a violation by a monk or nun that's not a violation by a monk?",
        "source": "T24n1463_002:0811c08_18"
    },
    {
        "source_sentence": "若比丘尼獨渡水、獨行入村、離眾獨宿，或獨隨道行、或獨使男子剃髮、或獨比丘經行處行、或結加趺坐，如是等所犯，比丘尼犯非比丘犯。",
        "translation": "If a monk or nun crosses water alone, walks alone into a village, sleeps alone apart from the congregation, walks alone along the path, causes men to shave themselves alone, walks alone in a place where he or she walks, or sits cross-legged, such offenses are committed by monks and nuns who violate them and not by monks.",
        "source": "T24n1463_002:0811c09_19"
    },
    {
        "source_sentence": "「何者名比丘比丘尼犯非式叉摩尼犯？",
        "translation": "What's called a monk or nun who commits a violation that's not a violation of the śrāmaṇerī?",
        "source": "T24n1463_002:0811c12_20"
    },
    {
        "source_sentence": "若比丘比丘尼不受食而食，比丘比丘尼犯，非式叉摩尼犯。",
        "translation": "If a monk or bhikṣuṇī doesn't accept food and eats it, and a monk or bhikṣuṇī violates the precepts, it's not a violation of the Śākyamuni.",
        "source": "T24n1463_002:0811c13_21"
    },
    {
        "source_sentence": "「何等三眾犯非沙彌沙彌尼犯？",
        "translation": "What are the three groups of offenses that aren't committed by novices and nuns?",
        "source": "T24n1463_002:0811c14_22"
    },
    {
        "source_sentence": "除沙彌沙彌尼戒已，犯餘戒者是三眾犯非沙彌沙彌尼犯。",
        "translation": "Except for the precepts for novices and novice nuns who have violated the rest of the precepts, these are the three groups of people who commit crimes that aren't committed by novices or novices.",
        "source": "T24n1463_002:0811c15_23"
    },
    {
        "source_sentence": "「何者五眾犯非優婆塞優婆夷犯？",
        "translation": "What are the five kinds of offenses that are not committed by laymen and laywomen?",
        "source": "T24n1463_002:0811c16_24"
    },
    {
        "source_sentence": "除五戒已，犯餘戒者是五眾犯，非二眾也。",
        "translation": "A violation of the other precepts after the five precepts is a violation of the five groups of offenses, not two groups of offenses.",
        "source": "T24n1463_002:0811c17_25"
    },
    {
        "source_sentence": "「何者名七眾都犯？",
        "translation": "What are the seven universal offenses?",
        "source": "T24n1463_002:0811c18_26"
    },
    {
        "source_sentence": "七眾皆持五戒，七眾若犯此五戒，皆同犯也。",
        "translation": "All seven groups of people observe the five precepts, and if seven groups of people violate these five precepts, they'll all violate them together.",
        "source": "T24n1463_002:0811c19_27"
    },
    {
        "source_sentence": "「有犯冬有非春夏有，有犯春有非夏冬有，有犯夏有非冬春有。",
        "translation": "Some offenses are committed in winter and not in spring and summer; some offenses are committed in spring and not in summer and winter; and some offenses are committed in summer and not in winter and not in spring.",
        "source": "T24n1463_002:0811c20_28"
    },
    {
        "source_sentence": "何者冬有非春夏有？",
        "translation": "What's winter and what's not spring and summer?",
        "source": "T24n1463_002:0811c21_29"
    },
    {
        "source_sentence": "冬四月已滿，應捨功德衣。",
        "translation": "When the fourth month of winter is over, he should give up his robe of merit.",
        "source": "T24n1463_002:0811c21_30"
    },
    {
        "source_sentence": "若不捨過一日，犯突吉羅。",
        "translation": "If he doesn't abandon it for more than one day, he commits a grave offense.",
        "source": "T24n1463_002:0811c22_31"
    },
    {
        "source_sentence": "此犯冬有非春夏也。",
        "translation": "This offense is committed in winter and not in spring or summer.",
        "source": "T24n1463_002:0811c23_32"
    },
    {
        "source_sentence": "何者春犯非夏冬有？",
        "translation": "What's a violation in spring that doesn't exist in summer and winter?",
        "source": "T24n1463_002:0811c23_33"
    },
    {
        "source_sentence": "春一月殘，應乞雨浴衣。",
        "translation": "When the first month of spring is over, you should beg for rain and bathing clothes.",
        "source": "T24n1463_002:0811c24_34"
    },
    {
        "source_sentence": "若過一月乞、若乞過長得，得已不十五日用，此三事皆犯尼薩耆波逸提。",
        "translation": "If he begs for more than a month or asks for more than a long period of time and doesn't use it for fifteen days after receiving it, these three things are all crimes against the rules of saṃghâvaśeṣa.",
        "source": "T24n1463_002:0811c24_35"
    },
    {
        "source_sentence": "何者夏有非冬春有？",
        "translation": "What's summer and what's not winter and spring?",
        "source": "T24n1463_002:0811c26_36"
    },
    {
        "source_sentence": "比丘法應夏安居。",
        "translation": "The monks should be allowed to spend the summer retreat according to the rules.",
        "source": "T24n1463_002:0811c26_37"
    },
    {
        "source_sentence": "安居有二種：前、後。",
        "translation": "There are two kinds of abiding: prior and subsequent.",
        "source": "T24n1463_002:0811c27_38"
    },
    {
        "source_sentence": "若不安居，復不自恣，此犯夏有非冬春有。",
        "translation": "If someone doesn't live peacefully and doesn't do it for themselves, this is a violation that exists in summer and not in winter or spring.",
        "source": "T24n1463_002:0811c27_39"
    },
    {
        "source_sentence": "是故此三所犯，各當時而有，是名犯不犯。",
        "translation": "Therefore, each of these three offenses exists at the same time, which is called a violation or non-violation.",
        "source": "T24n1463_002:0811c28_40"
    },
    {
        "source_sentence": "「何者輕？",
        "translation": "What's light?",
        "source": "T24n1463_002:0811c29_41"
    },
    {
        "source_sentence": "犯波羅提提舍尼，此罪輕，或向一人說、若自心念，皆能滅也。",
        "translation": "If someone violates the prātideśanīya, this is a minor offense that can be extinguished if they teach it to one person or think of it for themselves.",
        "source": "T24n1463_002:0811c29_42"
    },
    {
        "source_sentence": "自種性者，若比丘畜人皮革屣、食人肉，若畜食者，偷蘭遮。",
        "translation": "The self-nature is that if a monk stores human leather and flesh or eats human flesh, or if he stores food, it's a pārājika.",
        "source": "T24n1463_002:0812a01_43"
    },
    {
        "source_sentence": "種性者，肉及皮即是人身，故言種性。",
        "translation": "The seed nature means that flesh and skin are human bodies, so it's called the seed nature.",
        "source": "T24n1463_002:0812a02_44"
    },
    {
        "source_sentence": "突吉羅者，不攝身威儀得突吉羅。",
        "translation": "A tukhila who doesn't gather his body and manner gains a tukhila.",
        "source": "T24n1463_002:0812a03_45"
    },
    {
        "source_sentence": "惡口者，說言汝是工師技兒諸根不具，如此說者得波逸提，是名惡口輕犯也。",
        "translation": "Someone who speaks harshly, saying, 'You're a skillful worker whose faculties aren't endowed.' If someone speaks like this, they'll attain pratyekabuddha, which is called a minor offense of harsh speech.",
        "source": "T24n1463_002:0812a03_46"
    },
    {
        "source_sentence": "「重者，波羅夷、僧伽婆尸沙。",
        "translation": "“重者, pārājika and saṃghâvaśeṣa.",
        "source": "T24n1463_002:0812a06_0"
    },
    {
        "source_sentence": "此二邊所得偷蘭遮，重也。",
        "translation": "These two sides obtain the pārājika, which is heavier.",
        "source": "T24n1463_002:0812a06_1"
    },
    {
        "source_sentence": "或有所犯，於比丘重比丘尼輕。",
        "translation": "If someone commits an offense, they'll be despised by the monks and nuns who are superior to the monks.",
        "source": "T24n1463_002:0812a07_2"
    },
    {
        "source_sentence": "或有所犯，於比丘尼重比丘輕。",
        "translation": "If someone commits an offense, they'll be esteemed by the monks and nuns and despised by the monks.",
        "source": "T24n1463_002:0812a07_3"
    },
    {
        "source_sentence": "比丘重者，故出精，比丘得僧伽婆尸沙，比丘尼得波逸提。",
        "translation": "A monk who produces semen because it's heavy for a monk, and a monk who produces semen obtains the sand of Saṃghâvaśeṣa, and a monk or nun obtains pratyekabuddha.",
        "source": "T24n1463_002:0812a08_4"
    },
    {
        "source_sentence": "比丘尼重者，比丘尼婬欲心盛，手摩男子屏處；",
        "translation": "When a bhikṣuṇī is heavy, the bhikṣuṇī’s or nun’s mind is filled with sexual desire. The bhikṣuṇī puts his or her hand over the male secluded place.",
        "source": "T24n1463_002:0812a10_0"
    },
    {
        "source_sentence": "男子亦摩比丘尼屏處；",
        "translation": "The men also touched the monks and nuns in their seclusion.",
        "source": "T24n1463_002:0812a11_1"
    },
    {
        "source_sentence": "俱著觸樂；",
        "translation": "They all cling to the pleasure of touch.",
        "source": "T24n1463_002:0812a11_2"
    },
    {
        "source_sentence": "比丘尼犯波羅夷。",
        "translation": "A bhikṣuṇī violates the pārājika.",
        "source": "T24n1463_002:0812a11_3"
    },
    {
        "source_sentence": "若比丘尼知比丘尼犯重；",
        "translation": "Suppose a bhikṣuṇī knows that the bhikṣuṇī commits a grave offense.",
        "source": "T24n1463_002:0812a12_4"
    },
    {
        "source_sentence": "覆藏不向一比丘尼說；",
        "translation": "The enlightening being conceals it and doesn’t teach it to a single bhikṣuṇī.",
        "source": "T24n1463_002:0812a12_5"
    },
    {
        "source_sentence": "亦得波羅夷。",
        "translation": "They'll also attain pārājika.",
        "source": "T24n1463_002:0812a13_6"
    },
    {
        "source_sentence": "若比丘不隨順僧法；",
        "translation": "Suppose a monk does not comply with the rules of the order.",
        "source": "T24n1463_002:0812a13_7"
    },
    {
        "source_sentence": "僧與呵責羯磨。",
        "translation": "The saṃgha gave him the karma of rebuke.",
        "source": "T24n1463_002:0812a14_8"
    },
    {
        "source_sentence": "又比丘尼言：『此比丘隨順僧法。』",
        "translation": "Again, the monks and nuns said, 'This monk follows the saṃgha's teaching.'",
        "source": "T24n1463_002:0812a14_9"
    },
    {
        "source_sentence": "種種言說與比丘同心。",
        "translation": "Various kinds of words and explanations are the same as a monk's mind.",
        "source": "T24n1463_002:0812a15_10"
    },
    {
        "source_sentence": "諸比丘尼諫言：『不須往反言語相助。』",
        "translation": "The monks and nuns remonstrated, saying, 'There's no need to speak back and forth to help each other.'",
        "source": "T24n1463_002:0812a15_11"
    },
    {
        "source_sentence": "不受尼諫，往返言語相助不絕。",
        "translation": "They didn't accept the nun's remonstrance, and they spoke back and forth to help each other without stopping.",
        "source": "T24n1463_002:0812a16_12"
    },
    {
        "source_sentence": "尼僧與作白四羯磨。",
        "translation": "The nuns and monks gave him the four white karmas.",
        "source": "T24n1463_002:0812a17_13"
    },
    {
        "source_sentence": "此尼得波羅夷。",
        "translation": "This nun attained pārājika.",
        "source": "T24n1463_002:0812a17_14"
    },
    {
        "source_sentence": "比丘尼復有八事犯波羅夷：一者尼與男子互相捉手；",
        "translation": "Again, bhikṣuṇīs commit eight kinds of grave offenses:",
        "source": "T24n1463_002:0812a18_15"
    },
    {
        "source_sentence": "二者便更互捉衣；",
        "translation": "The two kinds of people then grabbed each other’s clothes.",
        "source": "T24n1463_002:0812a19_16"
    },
    {
        "source_sentence": "三者共男子靜屏處並坐；",
        "translation": "The third is to be seated together with men in a quiet place, sitting side by side.",
        "source": "T24n1463_002:0812a19_17"
    },
    {
        "source_sentence": "四者屏處共語；",
        "translation": "The fourth is to associate in seclusion and talk together.",
        "source": "T24n1463_002:0812a20_18"
    },
    {
        "source_sentence": "五者屏處身相觸；",
        "translation": "The fifth is that the body touches one another in a secluded place.",
        "source": "T24n1463_002:0812a20_19"
    },
    {
        "source_sentence": "六者尼共男子獨道行；",
        "translation": "The sixth is that nuns practice the path alone with men.",
        "source": "T24n1463_002:0812a21_20"
    },
    {
        "source_sentence": "七者道中露身相觸；",
        "translation": "The seventh is that they reveal their bodies to each other in the path.",
        "source": "T24n1463_002:0812a21_21"
    },
    {
        "source_sentence": "八者至共期行不淨處。",
        "translation": "Eight, he arrives at the impure place where he's practicing together.",
        "source": "T24n1463_002:0812a22_22"
    },
    {
        "source_sentence": "若尼具前七事時犯偷蘭遮，滿八事犯波羅夷。",
        "translation": "If a nun commits the offense of stealing a pārājika when he fulfills the previous seven things, and if he fulfills the full set of eight things, he commits a pārājika.",
        "source": "T24n1463_002:0812a22_23"
    },
    {
        "source_sentence": "此是比丘尼重比丘輕。",
        "translation": "This is a bhikṣuṇī who esteems the bhikṣus and despises the bhikṣus.",
        "source": "T24n1463_002:0812a23_24"
    },
    {
        "source_sentence": "「或有犯重報輕，或有犯輕報重，或有犯重報亦重，或有犯輕報亦輕。",
        "translation": "Again, some [monks] may experience a lighter retribution for violating the precepts than others. Some may experience a lighter retribution for violating the precepts. Some may experience a heavy retribution for violating the precepts. Some may experience a lighter retribution for violating the precepts.",
        "source": "T24n1463_002:0812a24_25"
    },
    {
        "source_sentence": "有犯重報輕者，有比丘作使和合男女，若和合者得僧殘，不和合得偷蘭遮。",
        "translation": "If someone commits a minor offense with a heavy retribution, a monk who makes an envoy to reconcile men and women will attain the saṃghâvaśeṣa if they reconcile, and if they don't reconcile, they'll be given a pārājika.",
        "source": "T24n1463_002:0812a25_26"
    },
    {
        "source_sentence": "若比丘私作房，不白眾僧乞羯磨，未成犯偷蘭遮，成已犯僧殘。",
        "translation": "If a monk privately builds a dwelling and doesn't tell the saṃgha to ask for a karma, violating the pārājika before it's done is a violation of the saṃgha after it's done.",
        "source": "T24n1463_002:0812a27_27"
    },
    {
        "source_sentence": "是名犯重報輕。",
        "translation": "This is called a minor offense whose serious retribution is light.",
        "source": "T24n1463_002:0812a28_28"
    },
    {
        "source_sentence": "犯輕報重者，若比丘瞋恚心打阿羅漢，或復欲心摩觸阿羅漢起於染著，乃至打佛於佛上起染欲心，或有惡口罵阿羅漢及佛，毀呰形殘諸根不具，此得波逸提，是名犯輕報重。",
        "translation": "If a monk with an angry mind beats an arhat, or if he touches an arhat with the mind of desire and becomes defiled by attachment, or if he strikes a buddha and gives rise to a defiled desire over a buddha, or if he speaks harshly against an arhat or a buddha and disparages the arhat and the Buddha, disparaging their form and leaving their fac",
        "source": "T24n1463_002:0812a29_29"
    },
    {
        "source_sentence": "犯重報重者，波羅夷及二無根謗聖及凡，得僧殘罪。",
        "translation": "A grave offense with a grave retribution is the grave sin of pārājika and the two rootless crimes of denigrating sages and worldlings who attain the saṃgha's cruelty.",
        "source": "T24n1463_002:0812b04_30"
    },
    {
        "source_sentence": "二無根者：一比丘瞋心遣妹尼彌勒，往謗阿羅漢陀驃摩羅子，語言：『大德共我行欲。』",
        "translation": "The second has no faculties: One monk angrily sends his sister, Nirmāṇarati, to denigrate the arhat Kātyāmalāputra and say, 'The great virtuous one shares my sexual desire.'",
        "source": "T24n1463_002:0812b05_31"
    },
    {
        "source_sentence": "此謗他比丘。",
        "translation": "This is a monk who denigrates others.",
        "source": "T24n1463_002:0812b07_32"
    },
    {
        "source_sentence": "隨路行，見二羊共行欲，心中生念：『前謗既虛，今以母羊為彌勒尼、翁羊為陀驃摩羅子。』",
        "translation": "When he was traveling along the road, he saw two sheep together practicing sexual desires and thought in his mind, 'I've previously denigrated it, but now I'll take my mother's sheep to be Maitreya and my old woman's sheep to be Dharmaraṇḍa.'",
        "source": "T24n1463_002:0812b07_33"
    },
    {
        "source_sentence": "生此念已，來到寺中向眾僧說：『前時不實，今日實見。』",
        "translation": "After this thought arose, he came to the monastery and said to the saṃgha, 'That wasn't true in the past; today it's true.'",
        "source": "T24n1463_002:0812b09_34"
    },
    {
        "source_sentence": "諸比丘即諫言：『此阿羅漢，莫以惡言謗之。』",
        "translation": "The monks then remonstrated, saying, 'This arhat, don't denigrate him with bad words.'",
        "source": "T24n1463_002:0812b10_35"
    },
    {
        "source_sentence": "答言：『實爾。",
        "translation": "He replied, 'It's true.",
        "source": "T24n1463_002:0812b11_36"
    },
    {
        "source_sentence": "聽我所說。』",
        "translation": "Listen to what I teach.'",
        "source": "T24n1463_002:0812b11_37"
    },
    {
        "source_sentence": "諸比丘聽之。",
        "translation": "The monks listened to it.",
        "source": "T24n1463_002:0812b12_38"
    },
    {
        "source_sentence": "說言：『我向者路中行，見二羊共行欲。",
        "translation": "He said, 'I was walking on the road in front of him and saw two sheep together practicing sexual desire.",
        "source": "T24n1463_002:0812b12_39"
    },
    {
        "source_sentence": "翁羊為陀驃摩羅子，母羊即是彌勒尼。』",
        "translation": "The man's goat is the son of Dharmarakṣa, and the mother's goat is Maitreya.'",
        "source": "T24n1463_002:0812b13_40"
    },
    {
        "source_sentence": "諸比丘聞此言，即共論議。",
        "translation": "When the monks heard these words, they had a discussion together.",
        "source": "T24n1463_002:0812b14_41"
    },
    {
        "source_sentence": "此二皆無根，是名二無根謗。",
        "translation": "These two are all without faculties, and these are called the two kinds of slander that lack faculties.",
        "source": "T24n1463_002:0812b14_42"
    },
    {
        "source_sentence": "一污他家、二壞法輪僧方便、三隨壞法輪僧徒眾、四惡性不受人諫，得僧殘罪，此是犯重報亦重。",
        "translation": "The first defiles another's home, the second destroys the Dharma-wheel saṃgha's skillful means, the third follows the destruction of the Dharma-wheel saṃgha's disciples, and the fourth doesn't accept people's remonstrance with evil natures to obtain the saṃgha's cruel offense of being a monk, which is a serious offense that brings",
        "source": "T24n1463_002:0812b15_43"
    },
    {
        "source_sentence": "犯輕報亦輕者，若比丘入聚落不憶念攝身四威儀及口四過，忘誤犯者，一人前懺悔波逸提突吉羅。",
        "translation": "If a monk enters a village and doesn't remember the four commits of gathering in his body, the four commits of deportment, or the four commits of speaking, and forgets them, one person will repent to pratyekabuddha in front of him.",
        "source": "T24n1463_002:0812b17_44"
    },
    {
        "source_sentence": "若比丘尼犯罪，先忘不發露，布薩時始憶，若欲發露恐亂僧聽戒，心中默念：『說戒已當懺悔。』",
        "translation": "If a monk or nun commits a sin and first forgets to disclose it, the bodhisattva then begins to remember it when he or she does so, and if he or she wants to disclose it in order to disturb the saṃgha's ability to hear the precepts, he or she quietly thinks in his or her mind, 'After speaking the precepts, I will repent.'",
        "source": "T24n1463_002:0812b19_45"
    },
    {
        "source_sentence": "如此等皆犯輕報亦輕。",
        "translation": "These are all minor offenses, and the result is also minor.",
        "source": "T24n1463_002:0812b22_46"
    },
    {
        "source_sentence": "「有三種犯：一者事重心輕；",
        "translation": "“There are three kinds of transgression:",
        "source": "T24n1463_002:0812b22_47"
    },
    {
        "source_sentence": "二者事輕心重；",
        "translation": "The second is the weakness of deeds and the weakness of mind.",
        "source": "T24n1463_002:0812b23_48"
    },
    {
        "source_sentence": "三者事心俱重。",
        "translation": "Three, both the mind and phenomena are heavy.",
        "source": "T24n1463_002:0812b23_49"
    },
    {
        "source_sentence": "事重心輕者，若比丘在尼寺中為尼說法，日已沒，心中生疑謂日未沒說法，此是事重心輕。",
        "translation": "If a monk teaches the Dharma to a nun in a nun's monastery and the sun goes down, and he has doubts in his mind that he teaches the Dharma before the sun goes down, this is a matter of seriousness and lightness of mind.",
        "source": "T24n1463_002:0812b23_50"
    },
    {
        "source_sentence": "事輕心重者，比丘在尼寺說法，日未沒意謂日已沒說法，此是事輕心重。",
        "translation": "A monk who teaches the Dharma at a nun's monastery and doesn't intend to teach it on the day before the sun goes down means that he hasn't taught it on the day. This is a serious matter of lightness of mind.",
        "source": "T24n1463_002:0812b25_51"
    },
    {
        "source_sentence": "心事俱重者，比丘在尼寺說法，日已沒心作沒想，此是心事俱重。",
        "translation": "A monk who teaches the Dharma at a nun's monastery and has no thoughts of going down after the sun goes down, these are the two kinds of heavy burdens of mind and work.",
        "source": "T24n1463_002:0812b27_52"
    },
    {
        "source_sentence": "心輕事重、心重事輕，是二俱得突吉羅。",
        "translation": "What's light in the mind is heavier and what's heavy in the mind is lighter, and these two people both attain purgatory.",
        "source": "T24n1463_002:0812b29_53"
    },
    {
        "source_sentence": "心事俱重得波逸提。",
        "translation": "Both mind and things are heavily concentrated, and they attain pratyekabuddha.",
        "source": "T24n1463_002:0812b29_54"
    },
    {
        "source_sentence": "波羅夷者，犯名雖同，果報有異。",
        "translation": "Although the name of the offense is the same, the result differs.",
        "source": "T24n1463_002:0812c01_55"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1463_002:0812c02_56"
    },
    {
        "source_sentence": "如婬處非一，畜生及人。",
        "translation": "The place of sexual passion is not one and the same:",
        "source": "T24n1463_002:0812c02_57"
    },
    {
        "source_sentence": "人中有出家、有不出家。",
        "translation": "Among people, there are those who leave home and those who don't leave home.",
        "source": "T24n1463_002:0812c02_58"
    },
    {
        "source_sentence": "又不出家中有二種，有持戒、不持戒。",
        "translation": "Also, there are two kinds of people who don't leave home: those who observe precepts and those who don't.",
        "source": "T24n1463_002:0812c03_59"
    },
    {
        "source_sentence": "出家中有五種，亦有持戒、不持戒乃至聖人。",
        "translation": "There are five kinds of renunciants, which also include those who observe precepts, those who don't observe precepts, and even sages.",
        "source": "T24n1463_002:0812c04_60"
    },
    {
        "source_sentence": "有如是差別，犯名雖同，果報有異。",
        "translation": "Although the names of offenses are the same, there are differences in their retribution.",
        "source": "T24n1463_002:0812c05_61"
    },
    {
        "source_sentence": "第二波羅夷者，所盜處非一，有出家、在家。",
        "translation": "The second pārājika is that the place where stealing occurs isn't one and the same, with renunciants and householders.",
        "source": "T24n1463_002:0812c06_0"
    },
    {
        "source_sentence": "在家人中盜取他物亦有差別，出家人中盜亦有差別，是三寶中盜亦有差別。",
        "translation": "Stealing within a householder is also different from taking what belongs to someone else. Stealing within a renunciant is also different from stealing. The same applies to thievery within the Triple Gem.",
        "source": "T24n1463_002:0812c07_0"
    },
    {
        "source_sentence": "是故波羅夷名雖同，果報有異。",
        "translation": "Therefore, even though the name of pārājika is the same, there are differences in its retribution.",
        "source": "T24n1463_002:0812c08_1"
    },
    {
        "source_sentence": "第三波羅夷者，天及人乃至聖人，如此人等若斷命根得波羅夷。",
        "translation": "The third pārājika refers to gods, humans, or even sages, and if they cut off the life root of such people, they'll attain pārājika.",
        "source": "T24n1463_002:0812c09_2"
    },
    {
        "source_sentence": "斷名雖同，果報亦異。",
        "translation": "Although the name of abandoning is the same, the fruit and retribution are also different.",
        "source": "T24n1463_002:0812c11_0"
    },
    {
        "source_sentence": "第四波羅夷者亦有差別，向在家人說得過人法重，向出家人說得過人法輕。",
        "translation": "The fourth kind of pārājika also has a distinction, which is to explain the relative seriousness of the teachings that are superior to those taught to householders and the relative lightness of the teachings that are superior to those taught to renunciants.",
        "source": "T24n1463_002:0812c11_1"
    },
    {
        "source_sentence": "是故得罪名雖同，果報不同也。」",
        "translation": "Therefore, even though the names of the crimes obtained are the same, the results differ.",
        "source": "T24n1463_002:0812c13_2"
    },
    {
        "source_sentence": "毘尼母經卷第二",
        "translation": "*Mother of the Vinaya, Volume 2",
        "source": "T24n1463_002:0812c14_0"
    }
]