[
    {
        "source_sentence": "鼻奈耶卷第三",
        "translation": "*Hinayana, vol. 3",
        "source": "T24n1464_003:0860b16_0"
    },
    {
        "source_sentence": "姚秦涼州沙門竺佛念譯",
        "translation": "Yaoqin Liangzhou shaman Zhu Fonian's translation",
        "source": "T24n1464_003:0860b18_0"
    },
    {
        "source_sentence": "僧殘法之一",
        "translation": "one of the crimes against the saṃgha",
        "source": "T24n1464_003:0860b19_0"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_003:0860b20_0"
    },
    {
        "source_sentence": "爾時尊者迦留陀夷(迦留陀夷，黑光也，阿難從弟也)於祇桓歲坐，掃灑房室，",
        "translation": "It was then that Venerable Kālôdayin (known as Kālôdayin, “black Light,” Ānanda’s younger brother) sat in the monastery and swept his dwelling.",
        "source": "T24n1464_003:0860b20_1"
    },
    {
        "source_sentence": "於中敷床，前著澡罐，外復有澡罐。",
        "translation": "On the inside, he spreads out a bed and puts his bathing pot in front of him, and on the outside there's another bathing pot.",
        "source": "T24n1464_003:0860b22_2"
    },
    {
        "source_sentence": "到時著衣持鉢入舍衛城分衛，得食而還，入房舉衣鉢息。",
        "translation": "When he arrived, he put on his robe and took his bowl into Śrāvastī's quarters to guard the city, returned with food, entered his room, raised his robe and bowl, and stopped.",
        "source": "T24n1464_003:0860b22_3"
    },
    {
        "source_sentence": "迦留陀夷婬意偏多，憶向所見得食之家婦女，婬意熾盛，以手弄陰精墮。",
        "translation": "Kālôdayin's anger was so strong that he remembered the woman he saw who had gotten food at home, and his anger became so strong that he touched her with his hand and fell into sexual misconduct.",
        "source": "T24n1464_003:0860b24_4"
    },
    {
        "source_sentence": "即便洗手澡浴掃灑房室，如是再三，乃至竟夏坐。",
        "translation": "He then washed his hands, bathed, bathed, swept the room, and sprinkled it three times like this until he sat up for the rest of the summer.",
        "source": "T24n1464_003:0860b25_5"
    },
    {
        "source_sentence": "時諸比丘是迦留陀夷知識，在拘薩羅結夏坐。",
        "translation": "The monks then were Kālôdayin's friends, and they sat in Kośala for the summer retreat.",
        "source": "T24n1464_003:0860b27_0"
    },
    {
        "source_sentence": "坐已具補納衣，一日竟衣，著衣持鉢來至舍衛國祇樹給孤獨園。",
        "translation": "After he had sat down, he prepared his patched robes for one day, completed his robes, put on his robe and bowl, and came to the Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_003:0860b28_1"
    },
    {
        "source_sentence": "時諸比丘往詣迦留陀夷比丘所，各各相向禮拜問訊已，在一面坐。",
        "translation": "The monks then went to the place where the monk Kālôdayin was staying, faced each other, venerated him, and greeted him, and sat to one side.",
        "source": "T24n1464_003:0860b29_2"
    },
    {
        "source_sentence": "「云何優陀夷！",
        "translation": "How, Udayana!",
        "source": "T24n1464_003:0860c02_3"
    },
    {
        "source_sentence": "體履健不？",
        "translation": "Is the body and legs strong?",
        "source": "T24n1464_003:0860c02_4"
    },
    {
        "source_sentence": "於夏坐中無苦不乞求婆？」",
        "translation": "Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Not Begging for the Blessed?",
        "source": "T24n1464_003:0860c02_5"
    },
    {
        "source_sentence": "優陀夷答：「我於此間掃灑房室，乃至弄陰。」",
        "translation": "Udāyin replied, Here, I sweep my room and even play with the shade.",
        "source": "T24n1464_003:0860c03_6"
    },
    {
        "source_sentence": "具向諸比丘說。",
        "translation": "I'll explain it to the monks.",
        "source": "T24n1464_003:0860c04_7"
    },
    {
        "source_sentence": "諸比丘答：「云何優陀夷無數方便，世尊說婬不淨，向婬念婬、婬熾盛，",
        "translation": "The monks answered, What are the countless skillful means of Udayana that the Bhagavān teaches that sexual misconduct is impure and that it's directed toward sexual misconduct, mindfulness of sexual misconduct, and arrogance are prevalent?",
        "source": "T24n1464_003:0860c04_8"
    },
    {
        "source_sentence": "說婬之惡露。",
        "translation": "It's said to be a bad manifestation of anger.",
        "source": "T24n1464_003:0860c06_9"
    },
    {
        "source_sentence": "卿云何於中起婬意？」",
        "translation": "How did you give rise to anger in them?",
        "source": "T24n1464_003:0860c06_10"
    },
    {
        "source_sentence": "如是諸比丘極苦責諫。",
        "translation": "Thus, the monks were extremely painful and remonstrated.",
        "source": "T24n1464_003:0860c06_11"
    },
    {
        "source_sentence": "責諫已便起去，往詣世尊，如事具白世尊。",
        "translation": "After remonstrating, he got up and departed, went to the Bhagavān, told him exactly as he had been told.",
        "source": "T24n1464_003:0860c07_12"
    },
    {
        "source_sentence": "世尊知而自問優陀夷：「審為此事耶？」",
        "translation": "Knowing this, the Bhagavān asked Udayana, Are you examining this matter?",
        "source": "T24n1464_003:0860c08_13"
    },
    {
        "source_sentence": "時優陀夷內懷慚愧外則恥眾，從坐起，偏袒右肩右膝著地叉手向佛，白世尊言：「審爾。",
        "translation": "Udāyin, feeling shame inside and ashamed of the crowd, rose from his seat, bared his right shoulder, knelt on his right knee, saluted the Buddha with palms joined, and said to the Bhagavān, Listen.",
        "source": "T24n1464_003:0860c09_14"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T24n1464_003:0860c11_15"
    },
    {
        "source_sentence": "世尊告曰：「云何癡人，我不以無數方便說婬之不淨，向婬念婬、婬熾盛婬之惡露。",
        "translation": "The Bhagavān told him, Why is it that a foolish man doesn't explain the impurity of sexual misconduct with countless skillful means and faces sexual misconduct with thoughts of sexual misconduct and blazing sexual misconduct as bad dew?",
        "source": "T24n1464_003:0860c11_16"
    },
    {
        "source_sentence": "云何癡人而以此手受長者信施，復以此手而捉此形弄耶？」",
        "translation": "How did a foolish man accept the elder's faithful gift with this hand and then grasp this shaped play with that hand?",
        "source": "T24n1464_003:0860c13_17"
    },
    {
        "source_sentence": "如是佛世尊無數方便誨責，因此事集和合僧，備十功德，世尊為沙門結戒：「諸沙門當共防此。",
        "translation": "Thus, the Bhagavān, the Buddha, the Bhagavān, had innumerable skillful means to admonish them, gathered the harmonious saṃgha for this reason and prepared the ten virtues, and the Bhagavān established the precepts for ascetics, saying, All ascetics should guard these together.",
        "source": "T24n1464_003:0860c14_18"
    },
    {
        "source_sentence": "若比丘憶念弄陰墮精，僧伽婆施沙(秦言眾決斷)。」",
        "translation": "If a monk remembers to play with his aggregates and fall into semen, the saṃghâvaśeṣa (known in the Qin as'decided by the multitude').",
        "source": "T24n1464_003:0860c16_19"
    },
    {
        "source_sentence": "世尊遊舍衛國祇樹給孤獨園。",
        "translation": "The Bhagavān traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_003:0860c18_0"
    },
    {
        "source_sentence": "時有一比丘在祇桓夏坐。",
        "translation": "At the time, there was a monk who was sitting in Jeta's summer retreat.",
        "source": "T24n1464_003:0860c18_1"
    },
    {
        "source_sentence": "此比丘於夢中失精，覺已便懷狐疑：「我不犯僧伽婆施沙耶？」",
        "translation": "The monk lost his energy in a dream, and after realizing it, he harbored doubts, Am I not violating the saṃghâvaśeṣa?",
        "source": "T24n1464_003:0860c19_2"
    },
    {
        "source_sentence": "便問諸比丘。",
        "translation": "He then asked the monks.",
        "source": "T24n1464_003:0860c20_3"
    },
    {
        "source_sentence": "諸比丘不知當何報？",
        "translation": "The monks did not know what retribution they should receive.",
        "source": "T24n1464_003:0860c21_0"
    },
    {
        "source_sentence": "諸比丘往白世尊。",
        "translation": "The monks went to the Bhagavān and told him.",
        "source": "T24n1464_003:0860c21_1"
    },
    {
        "source_sentence": "世尊告曰：「夢中失精無罪。",
        "translation": "The Bhagavān told him, It's no offense to lose energy in a dream.",
        "source": "T24n1464_003:0860c21_2"
    },
    {
        "source_sentence": "若比丘弄陰失精，除其夢中，僧伽婆施沙。」",
        "translation": "If a monk plays with the aggregates and loses his semen, except in a dream, Saṃghâva gives sand.",
        "source": "T24n1464_003:0860c22_3"
    },
    {
        "source_sentence": "時尊者優波離問世尊：「失精有幾處，是僧伽婆施沙？」",
        "translation": "Venerable Upāli then asked the Bhagavān, How many places where there's a loss of energy that are the sands of Saṃghâvaśeṣa?",
        "source": "T24n1464_003:0860c23_4"
    },
    {
        "source_sentence": "世尊告曰：「左右手弄者，僧伽婆施沙，使他手弄亦爾。",
        "translation": "The Bhagavān told them, If someone plays with their left and right hands, the saṃghâva gives sand so that other people's hands will play likewise.",
        "source": "T24n1464_003:0860c24_5"
    },
    {
        "source_sentence": "他兩曲肘弄者，及屈膝間兩掖間臍兩邊，及岐間尻溝間，兩肩上項間，",
        "translation": "He plays with the other two bends of the elbow, and he bends between the knees at the knees, between the two hollows at the navel, between the two sides of the navel, between the two sides of the flanks, between the buttocks, between the shoulders, and between the neck.",
        "source": "T24n1464_003:0860c25_6"
    },
    {
        "source_sentence": "現身上屈申處衣裏弄者，伏床褥弄者，畫女像木女像作處所弄失精者，",
        "translation": "He's shown to play inside his clothes, lying on a bed or bedding, or playing in the place where he paints an image of a woman or wooden woman and loses his semen.",
        "source": "T24n1464_003:0860c27_7"
    },
    {
        "source_sentence": "僧伽婆施沙。」",
        "translation": "Saṃghâvaśeṣa.",
        "source": "T24n1464_003:0860c29_8"
    },
    {
        "source_sentence": "佛遊舍衛國祇樹給孤獨園。",
        "translation": "The Buddha traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_003:0861a01_0"
    },
    {
        "source_sentence": "時尊者難陀婬意偏多，入舍衛城分衛。",
        "translation": "Venerable Nanda then had a partial mind, and he entered the city of Śrāvastī to guard it.",
        "source": "T24n1464_003:0861a01_1"
    },
    {
        "source_sentence": "有一長者婦，以手接難陀足作禮，女人手濡，難陀便失精墮此人手上。",
        "translation": "There was an elderly woman who touched Nanda's feet with her hand and paid homage to him. The woman's hand became wet, and Nanda lost his energy and fell into the man's hand.",
        "source": "T24n1464_003:0861a02_2"
    },
    {
        "source_sentence": "女人即舉手塗頂上：「我今得大利，乃使尊者難陀婬意熾盛，梵行全碩，",
        "translation": "The woman then raised her hand and rubbed it on the top of her head, saying, “Now that I have obtained great rewards, Venerable Nanda’s mind is enlightened and his practice of austerity is all-inclusive.",
        "source": "T24n1464_003:0861a04_3"
    },
    {
        "source_sentence": "意不犯戒。」",
        "translation": "The mind doesn't violate the precepts.",
        "source": "T24n1464_003:0861a05_4"
    },
    {
        "source_sentence": "難陀便懷狐疑：「我不犯僧伽婆施沙？」",
        "translation": "Nanda then harbored doubt, I won't violate the saṃghâvaśeṣa?",
        "source": "T24n1464_003:0861a06_0"
    },
    {
        "source_sentence": "便問諸比丘。",
        "translation": "He then asked the monks.",
        "source": "T24n1464_003:0861a06_1"
    },
    {
        "source_sentence": "諸比丘不知報，即往具白世尊。",
        "translation": "The monks didn't know the reward, so they went there and reported it to the Bhagavān.",
        "source": "T24n1464_003:0861a07_2"
    },
    {
        "source_sentence": "時世尊因此事，集和合僧。",
        "translation": "The Bhagavān then gathered the assembled monks for this reason.",
        "source": "T24n1464_003:0861a07_3"
    },
    {
        "source_sentence": "世尊知而問難陀：「實如此事不？",
        "translation": "Knowing this, the Bhagavān asked Nanda, Is this really such a thing?",
        "source": "T24n1464_003:0861a08_4"
    },
    {
        "source_sentence": "難陀！」",
        "translation": "Nanda!",
        "source": "T24n1464_003:0861a09_5"
    },
    {
        "source_sentence": "時尊者難陀，內懷慚愧外則恥眾，偏袒右肩右膝著地叉手向佛，白世尊言：「審爾。",
        "translation": "Venerable Nanda, ashamed of himself and ashamed of the crowd, bared his right shoulder, knelt on his right knee, saluted the Buddha with his palms joined, and said to the Bhagavān, Listen.",
        "source": "T24n1464_003:0861a09_6"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T24n1464_003:0861a11_7"
    },
    {
        "source_sentence": "爾時世尊於眾人前歎難陀言：「善哉善哉！",
        "translation": "It was then that the Bhagavān praised Nanda in front of the crowd, saying, Good, good!",
        "source": "T24n1464_003:0861a11_8"
    },
    {
        "source_sentence": "難陀！",
        "translation": "Nanda!",
        "source": "T24n1464_003:0861a12_9"
    },
    {
        "source_sentence": "乃能作是全梵行能爾。",
        "translation": "He's then able to perform this whole religious practice and be able to do so.",
        "source": "T24n1464_003:0861a12_10"
    },
    {
        "source_sentence": "行梵行者得大果報、得大功德。」",
        "translation": "Those who practice the religious practice will attain great rewards and great merit.",
        "source": "T24n1464_003:0861a12_11"
    },
    {
        "source_sentence": "時世尊告諸比丘：「其族姓子見難陀者，誰能呰言不端政乎？",
        "translation": "The Bhagavān then addressed the monks, Who among those clansmen who saw Nanda could say words that weren't proper?",
        "source": "T24n1464_003:0861a13_12"
    },
    {
        "source_sentence": "身體柔濡筋力勝人，婬意偏多，誰能勝難陀也？",
        "translation": "Their bodies are soft and supple, their tendons are stronger than those of human beings, and their anger is predominant. Who can overcome Nanda?",
        "source": "T24n1464_003:0861a14_13"
    },
    {
        "source_sentence": "如是比丘！",
        "translation": "So it is, monks!",
        "source": "T24n1464_003:0861a16_0"
    },
    {
        "source_sentence": "難陀族姓子閉塞根門，飲食知足，夜不失時，念定不亂(此上四句，其人名曰修妬路，",
        "translation": "The Nanda clansman shut the doors of his faculties, knew enough to eat and drink, didn't lose sleep at night, and was mindful of his concentration without disturbance. (The above four sentences are called the path of cultivating jealousy.",
        "source": "T24n1464_003:0861a16_1"
    },
    {
        "source_sentence": "是本明也)，難陀能盡形壽淨修梵行。",
        "translation": "This is the original explanation.) Nanda was able to purify the religious practice for the rest of his life.",
        "source": "T24n1464_003:0861a17_2"
    },
    {
        "source_sentence": "彼難陀族姓子云何能閉塞諸根門？",
        "translation": "How can that Nanda clansman shut the doors of his faculties?",
        "source": "T24n1464_003:0861a18_3"
    },
    {
        "source_sentence": "於此難陀族姓子，眼見色者意無染著，設使見色眼根不具者，當念無明憂惡不善法，",
        "translation": "“Furthermore, Nanda, the eye-witness who sees visible things with his own eyes has no attachment or attachment in his mind. If he sees visible things but is not endowed with the eye faculty, he should think of ignorance, sorrow, evil, and unwholesome states.",
        "source": "T24n1464_003:0861a19_4"
    },
    {
        "source_sentence": "意不向者則護眼根。",
        "translation": "When the mind isn't directed toward them, then it protects the eye faculty.",
        "source": "T24n1464_003:0861a21_5"
    },
    {
        "source_sentence": "如是耳鼻舌身意法知已不起染著，設使意根不具者，當念無明憂惡不善法，",
        "translation": "If someone’s faculty of thought is not endowed with the faculty of thought, they should be mindful of ignorance, sorrow, evil, and unwholesome states.",
        "source": "T24n1464_003:0861a21_6"
    },
    {
        "source_sentence": "意不向者則護意根。",
        "translation": "When the mind isn't directed toward them, then it protects the mind faculty.",
        "source": "T24n1464_003:0861a23_7"
    },
    {
        "source_sentence": "此是難陀族姓子閉塞根門。",
        "translation": "This is the gate of the Nanda clansmen who shut off their faculties.",
        "source": "T24n1464_003:0861a23_8"
    },
    {
        "source_sentence": "彼難陀族姓子云何飲食知足？",
        "translation": "How did that Nanda clansman know enough to eat and drink?",
        "source": "T24n1464_003:0861a24_9"
    },
    {
        "source_sentence": "於此難陀族姓子摶飯食知足，無有貪餮，不求顏色氣力無細滑意。",
        "translation": "Here, the Nanda clansman's food and drink are well enough to satisfy them, with no craving or indulgence, and he doesn't seek form or energy, and he has no fine or slippery intentions.",
        "source": "T24n1464_003:0861a25_10"
    },
    {
        "source_sentence": "所以食者，欲使身體久住，以滅故病、新者不興，樂得行道。",
        "translation": "That's why they eat because they want to make their bodies abide for a long time, so that sicknesses and new ones won't arise because they cease, and they'll happily attain the path of practice.",
        "source": "T24n1464_003:0861a26_11"
    },
    {
        "source_sentence": "譬如有人有瘡痍病，以膏塗之。",
        "translation": "It's like a person who has a sores and rubs it with an ointment.",
        "source": "T24n1464_003:0861a28_12"
    },
    {
        "source_sentence": "所以塗者何？",
        "translation": "Why is it coated?",
        "source": "T24n1464_003:0861a28_13"
    },
    {
        "source_sentence": "欲使瘡愈。",
        "translation": "I want to make my sores heal.",
        "source": "T24n1464_003:0861a29_14"
    },
    {
        "source_sentence": "如是難陀族姓子飲食知足，無有貪餮，乃至樂得行道。",
        "translation": "Thus, the Nanda clansman is content with food and drink, has no craving or thirst, and delights in the path of practice.",
        "source": "T24n1464_003:0861a29_15"
    },
    {
        "source_sentence": "譬如有人以脂膏車。",
        "translation": "It's like a person who uses a cart made of fat and grease.",
        "source": "T24n1464_003:0861b01_16"
    },
    {
        "source_sentence": "所以膏者何？",
        "translation": "What's the reason for this anointing?",
        "source": "T24n1464_003:0861b02_17"
    },
    {
        "source_sentence": "以其重載故。",
        "translation": "It's because it's heavily loaded.",
        "source": "T24n1464_003:0861b02_18"
    },
    {
        "source_sentence": "如是難陀族姓子飲食知足，無有貪餮，乃至樂得行道。",
        "translation": "Thus, the Nanda clansman is content with food and drink, has no craving or thirst, and delights in the path of practice.",
        "source": "T24n1464_003:0861b02_19"
    },
    {
        "source_sentence": "此是難陀族姓子飲食知足。",
        "translation": "This is the food and drink of the Nanda clansmen.",
        "source": "T24n1464_003:0861b03_20"
    },
    {
        "source_sentence": "彼難陀族姓子云何是夜不失時？",
        "translation": "What's the time for that Nanda clansman not to lose it at night?",
        "source": "T24n1464_003:0861b04_21"
    },
    {
        "source_sentence": "於此難陀族姓子，晝日經行坐禪，夜亦經行坐禪。",
        "translation": "At this place the Nanda clansman walked and sat in meditation day and night, and also walked and sat in meditation at night.",
        "source": "T24n1464_003:0861b05_22"
    },
    {
        "source_sentence": "初夜時經行坐禪，降伏心不使睡眠，中夜之時襞憂多僧使四疊而敷坐上，",
        "translation": "On the first watch of the night, he walked up and sat in meditation, subduing his thoughts so as not to cause them to sleep. On the second watch of the middle watch, he spread his outer robes in four layers and sat cross-legged on them.",
        "source": "T24n1464_003:0861b06_23"
    },
    {
        "source_sentence": "舉僧伽梨著頭前，右脇著地、累足更互申脚，繫想在明，何時當曉？",
        "translation": "When the saṃghâvaśeṣarī is held in front of his head, his right shoulder touches the ground and his feet are pressed against each other's feet, and he ties his thoughts to the light; when will it dawn?",
        "source": "T24n1464_003:0861b08_24"
    },
    {
        "source_sentence": "後夜即起經行坐禪，降伏心法。",
        "translation": "On the latter part of the night, he rose from his seat to practice meditation and subdued his mind and dharmas.",
        "source": "T24n1464_003:0861b09_25"
    },
    {
        "source_sentence": "此是難陀族姓子初夜後夜不失時。",
        "translation": "This is the time when the Nandha clansman's family didn't miss the first and last watch of the night.",
        "source": "T24n1464_003:0861b10_26"
    },
    {
        "source_sentence": "彼難陀族姓子云何念定不亂？",
        "translation": "How does that Nanda clansman's concentration of mindfulness not be disturbed?",
        "source": "T24n1464_003:0861b11_27"
    },
    {
        "source_sentence": "於此難陀族姓子，若欲視東，正身思惟而視東，無有亂意。",
        "translation": "If he wants to look eastward at this Nanda clansman, he correctly contemplates with his body and looks east, without any distracting thoughts.",
        "source": "T24n1464_003:0861b11_28"
    },
    {
        "source_sentence": "若欲視南西北，正身思惟而視，無有亂意。",
        "translation": "If he wants to look south or west, he correctly contemplates his body and looks with no distracting thoughts.",
        "source": "T24n1464_003:0861b13_29"
    },
    {
        "source_sentence": "於是難陀族姓子，若欲有痛想終不失智，行識亦爾，痛想未起不令使興，",
        "translation": "Then the Nanda clansman, wishing to have painful thoughts and never losing his knowledge, so too would volition and consciousness. But he would not allow painful thoughts to arise until they arose.",
        "source": "T24n1464_003:0861b14_30"
    },
    {
        "source_sentence": "若痛想有起次第滅之。",
        "translation": "If pain and perception arise in sequence, they'll cease.",
        "source": "T24n1464_003:0861b15_31"
    },
    {
        "source_sentence": "此是難陀族姓子念定不亂。",
        "translation": "This is the name of a Nanda clansman who's mindful and unconfused.",
        "source": "T24n1464_003:0861b16_32"
    },
    {
        "source_sentence": "是故難陀失精無罪。",
        "translation": "Therefore, it's not a sin for Nanda to lose his energy.",
        "source": "T24n1464_003:0861b16_33"
    },
    {
        "source_sentence": "若復當有如是失者，亦復無罪。",
        "translation": "If there's another mistake like this, it's also no offense.",
        "source": "T24n1464_003:0861b17_34"
    },
    {
        "source_sentence": "諸比丘！",
        "translation": "Monks!",
        "source": "T24n1464_003:0861b18_35"
    },
    {
        "source_sentence": "從今以去，當著舍勒(半泥洹僧)。",
        "translation": "From now on, he'll wear Śāriputra (a half-nirvāṇa monk).",
        "source": "T24n1464_003:0861b18_36"
    },
    {
        "source_sentence": "弄陰者義何所趣？",
        "translation": "What does it mean to play with the aggregates?",
        "source": "T24n1464_003:0861b18_37"
    },
    {
        "source_sentence": "獨處興意念想，若己若彼身體相近弄陰，是弄義也。」",
        "translation": "If someone gives rise to thoughts and thoughts alone, and if they play the aggregate with their own or another's body near each other, this is the meaning of play.",
        "source": "T24n1464_003:0861b19_38"
    },
    {
        "source_sentence": "佛遊釋羈瘦迦惟羅越那拘陀園。",
        "translation": "The Buddha traveled to the park of Śākyamuni's retreat in Kapilavastu.",
        "source": "T24n1464_003:0861b21_0"
    },
    {
        "source_sentence": "爾時尊者迦留陀夷當五日直，有諸長者婦女來至園中諸房間觀。",
        "translation": "It was then that five days before Venerable Kālôdayin's arrival, some elderly women came to the garden and looked around the room.",
        "source": "T24n1464_003:0861b21_1"
    },
    {
        "source_sentence": "時尊者迦留陀夷手執鑰牡在門外立，呼言：「諸姊來前，入此園遊觀，",
        "translation": "Venerable Kālôdayin then stood outside the door with his key and pearl in his hand, called out to them, Sisters, come before him.",
        "source": "T24n1464_003:0861b23_2"
    },
    {
        "source_sentence": "中有浴池泉源。」",
        "translation": "There's a bathing pond and a spring in the middle.",
        "source": "T24n1464_003:0861b24_3"
    },
    {
        "source_sentence": "時諸婦女即入園遊觀，開諸房戶使入觀看。",
        "translation": "The women then entered the garden to browse, opened the doors of their rooms, and asked them to look inside.",
        "source": "T24n1464_003:0861b25_4"
    },
    {
        "source_sentence": "歷陰室內，捉諸婦女抱鳴捻挃身體。",
        "translation": "In the inner sanctum, he grabbed the women's bodies and embraced and swung them around him.",
        "source": "T24n1464_003:0861b26_5"
    },
    {
        "source_sentence": "諸婦女或欲從者、或不從者。",
        "translation": "The women either want to obey or don't obey.",
        "source": "T24n1464_003:0861b27_6"
    },
    {
        "source_sentence": "其不從者出語諸比丘：「常無畏處，安隱處而更大有恐畏。」",
        "translation": "Those who don't obey it say to the monks, Always be in a fearless place and have greater fear when you're in a peaceful place.",
        "source": "T24n1464_003:0861b27_7"
    },
    {
        "source_sentence": "諸比丘問：「有何恐畏？」",
        "translation": "The monks asked, What fear is there?",
        "source": "T24n1464_003:0861b29_0"
    },
    {
        "source_sentence": "即以所見事具白諸比丘。",
        "translation": "He then told the monks in detail what he saw.",
        "source": "T24n1464_003:0861b29_1"
    },
    {
        "source_sentence": "諸比丘不知當何報，往詣世尊具白此事。",
        "translation": "The monks didn't know what to repay, so they went to the Bhagavān and told him about this matter.",
        "source": "T24n1464_003:0861c01_2"
    },
    {
        "source_sentence": "世尊知而問尊者優陀夷：「審為此事耶？」",
        "translation": "Knowing this, the Bhagavān asked Venerable Udayana, Are you examining this matter?",
        "source": "T24n1464_003:0861c02_0"
    },
    {
        "source_sentence": "時優陀夷內懷慚愧外則恥眾，偏袒右肩右膝著地合掌向佛，白世尊言：「審爾。",
        "translation": "Udāyin, ashamed of himself and ashamed of the crowd, bared his right shoulder, knelt with his right knee on the ground, joined his palms together, faced the Buddha, and said to the Bhagavān, Listen.",
        "source": "T24n1464_003:0861c02_1"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T24n1464_003:0861c04_2"
    },
    {
        "source_sentence": "世尊告曰：「云何我前不為癡人無數方便說婬不淨，向婬念婬、婬意熾盛婬之惡露。",
        "translation": "The Bhagavān told him, Why didn't I explain the impurity of sexual misconduct to a deluded person with countless skillful means that was directed toward sexual misconduct and the bad dew of anger, thoughts of anger, and thoughts of anger that flourish in anger?",
        "source": "T24n1464_003:0861c04_3"
    },
    {
        "source_sentence": "云何憂陀夷！",
        "translation": "What's Udayana?",
        "source": "T24n1464_003:0861c06_4"
    },
    {
        "source_sentence": "我前不向憂填王說婬不淨耶？",
        "translation": "Didn't I say to the king of Udayana that it's crude and impure?",
        "source": "T24n1464_003:0861c07_5"
    },
    {
        "source_sentence": "王憂填問我：『瞿曇！",
        "translation": "King Udayana asked me, 'Gautama!",
        "source": "T24n1464_003:0861c07_6"
    },
    {
        "source_sentence": "此諸比丘年少端正，新來入法鼻奈，諸根善具眼鼻充澤、皮濡如桃花，",
        "translation": "These bhikṣus were young and handsome. They had newly arrived in Jambudvīpa, endowed with the faculties of hearing and smelling good; their eyes and noses were as lustrous as white lotus blossoms and their skin as soft as a peach flower.",
        "source": "T24n1464_003:0861c08_7"
    },
    {
        "source_sentence": "安詳不犯他婦女，盡命淨修梵行。』",
        "translation": "He's peaceful and doesn't violate other women, purifying the religious practice for the rest of his life.'",
        "source": "T24n1464_003:0861c09_8"
    },
    {
        "source_sentence": "爾時我語王：『諸比丘其像母者當呼言母，其像姊妹者當呼言姊妹，像女者亦當呼言女。",
        "translation": "It was then that I said to the king, 'Monks, those whose images are mothers should call them mothers, those whose images are sisters should call them sisters, and those whose images are women should call them women.",
        "source": "T24n1464_003:0861c10_9"
    },
    {
        "source_sentence": "以是義理故，大王！",
        "translation": "Because of this meaning, great king!",
        "source": "T24n1464_003:0861c12_10"
    },
    {
        "source_sentence": "使諸比丘年少端正者，乃至不犯女色，盡形命得修梵行。』",
        "translation": "It causes the monks who are young and handsome, even those who don't violate women's form to cultivate religious practice for the rest of their lives.'",
        "source": "T24n1464_003:0861c13_11"
    },
    {
        "source_sentence": "王復問：『世尊！",
        "translation": "The king again asked, 'Bhagavān!",
        "source": "T24n1464_003:0861c14_12"
    },
    {
        "source_sentence": "人心多想。",
        "translation": "The mind is full of conceptions.",
        "source": "T24n1464_003:0861c14_13"
    },
    {
        "source_sentence": "設使我等像母言母，乃至像女言女，心故走世法。",
        "translation": "Suppose we were to say mother in the form of mother, or even mother in the form of daughter in the form of daughter, and our minds therefore run away from worldly dharmas.",
        "source": "T24n1464_003:0861c15_14"
    },
    {
        "source_sentence": "頗更有餘義，使諸年少比丘盡命淨修梵行不？』",
        "translation": "Could there be any other meaning that causes young monks to purify the religious practice for the rest of their lives?'",
        "source": "T24n1464_003:0861c16_15"
    },
    {
        "source_sentence": "世尊告曰：『我以語諸比丘，大王！",
        "translation": "The Bhagavān told them, 'I'll tell the monks, great king!",
        "source": "T24n1464_003:0861c17_16"
    },
    {
        "source_sentence": "諸比丘當觀此身，從足拇指上至髮際，觀種種惡露不淨。",
        "translation": "The monks should contemplate this body, going from the top of their thumbs and feet up to the limits, observing various bad and impure defilements.",
        "source": "T24n1464_003:0861c18_17"
    },
    {
        "source_sentence": "此身中有髮毛爪齒塵垢、皮肉血筋脈骨髓、心肝脾腎肺腸胃腹、屎溺肪膏膽涕唾涎腦膜。",
        "translation": "In this body, there's hair, nails, teeth, dirt, skin, flesh, blood, tendons, veins, bones, marrow, heart, liver, spleen, kidneys, lungs, intestines, stomach, stomach, fat, fat, bile, tears, spittle, saliva, and the membrane of the brain.",
        "source": "T24n1464_003:0861c19_18"
    },
    {
        "source_sentence": "以是義故，大王！",
        "translation": "Because of this, great king!",
        "source": "T24n1464_003:0861c21_19"
    },
    {
        "source_sentence": "使諸年少比丘盡命得修梵行。』",
        "translation": "That will cause the young monks to cultivate the religious practice for the rest of their lives.'",
        "source": "T24n1464_003:0861c21_20"
    },
    {
        "source_sentence": "王復問：『世尊！",
        "translation": "The king again asked, 'Bhagavān!",
        "source": "T24n1464_003:0861c22_21"
    },
    {
        "source_sentence": "此心多想。",
        "translation": "This mind has many conceptions.",
        "source": "T24n1464_003:0861c22_22"
    },
    {
        "source_sentence": "說使我等觀此惡露，故謂是淨，頗更有餘義，使諸年少比丘盡命得修梵行不？』",
        "translation": "It's said to cause us to observe this bad dew, so it's called pure. Could there be any other meaning that would cause young monks to cultivate the religious practice for the rest of their lives?'",
        "source": "T24n1464_003:0861c23_0"
    },
    {
        "source_sentence": "世尊告曰：『我前以說，大王！",
        "translation": "The Bhagavān told him, 'I'll explain it first, great king!",
        "source": "T24n1464_003:0861c24_1"
    },
    {
        "source_sentence": "諸比丘當閉諸根門，守念不忘、意不分散。",
        "translation": "The monks should shut the doors of their faculties, keep them in mind and not forget them, and don't disperse their thoughts.",
        "source": "T24n1464_003:0861c25_2"
    },
    {
        "source_sentence": "設眼見色心不染著，設眼見色有染著者，心念無明憂惱不善之法使不近者，",
        "translation": "Suppose the eye sees form and the mind isn't stained by it, and suppose the eye sees form with defiled attachment, and the mind is mindful of ignorance, sorrow, and unwholesome things so that they won't be near it.",
        "source": "T24n1464_003:0861c26_3"
    },
    {
        "source_sentence": "則守念眼根。",
        "translation": "He then guards the eye faculty of mindfulness.",
        "source": "T24n1464_003:0861c28_4"
    },
    {
        "source_sentence": "如是耳鼻舌身意法無有染著，假有染著意，心念無明憂惱不善之法，使不近者則守念意根。",
        "translation": "Thus, the mind of the ear, nose, tongue, body, and mind are free of defiled attachment, and if they have defiled attachment, their mind is mindful of ignorance, grief, sorrow, and unwholesome things, so that those who aren't close to it will guard the mind faculty of mindfulness.",
        "source": "T24n1464_003:0861c28_5"
    },
    {
        "source_sentence": "以是義故，大王！",
        "translation": "Because of this, great king!",
        "source": "T24n1464_003:0862a01_6"
    },
    {
        "source_sentence": "使諸年少比丘盡命得修梵行。』",
        "translation": "That will cause the young monks to cultivate the religious practice for the rest of their lives.'",
        "source": "T24n1464_003:0862a01_7"
    },
    {
        "source_sentence": "王白世尊：『儻有此義，諸年少比丘盡命得修梵行。",
        "translation": "The king said to the Bhagavān, 'It's because of this meaning that the young monks attain cultivation of religious practice for the rest of their lives.",
        "source": "T24n1464_003:0862a02_8"
    },
    {
        "source_sentence": "若我入宮裏時不護身念根，意不端一則心走向婬意世法。",
        "translation": "If I don't guard the faculty of mindfulness of body when I enter the palace, and my mind isn't straightforward, then my mind goes to the worldly dharmas of anger and thoughts.",
        "source": "T24n1464_003:0862a03_9"
    },
    {
        "source_sentence": "若護身念根，意端一心無分散，不向婬世法。",
        "translation": "If he guards the faculty of mindfulness of body, his mind is single-minded and un distracted, and he doesn't look to worldly dharmas.",
        "source": "T24n1464_003:0862a05_0"
    },
    {
        "source_sentence": "是故世尊！",
        "translation": "Therefore, Bhagavān!",
        "source": "T24n1464_003:0862a06_0"
    },
    {
        "source_sentence": "可奇可特。",
        "translation": "It's marvelous and extraordinary.",
        "source": "T24n1464_003:0862a06_1"
    },
    {
        "source_sentence": "誰聞沙門瞿曇此語，能不具諸根？",
        "translation": "Who among the śramaṇas and brāhmaṇas who have heard these words of the śramaṇa Gautama will not be endowed with all the supernormal faculties?",
        "source": "T24n1464_003:0862a06_2"
    },
    {
        "source_sentence": "我今自歸佛、歸法、歸比丘僧。",
        "translation": "I now take refuge in the Buddha, Dharma, and Sangha.",
        "source": "T24n1464_003:0862a07_3"
    },
    {
        "source_sentence": "願世尊聽為優婆塞，盡命不殺生，受三自歸。』」",
        "translation": "May the Bhagavān hear that you become a layman, don't kill life for the rest of your life, and accept the three self-refuges.'",
        "source": "T24n1464_003:0862a07_4"
    },
    {
        "source_sentence": "爾時世尊告優陀夷：「此世人常能爾，癡人而不防此。",
        "translation": "It was then that the Bhagavān addressed Udayana, This worldly person always can do so, but a deluded person doesn't guard it.",
        "source": "T24n1464_003:0862a08_5"
    },
    {
        "source_sentence": "像母者當言母，乃至女亦如是。」",
        "translation": "An image mother should say mother, and so it's likewise with a woman.",
        "source": "T24n1464_003:0862a10_6"
    },
    {
        "source_sentence": "爾時世尊以無數方便誨責優陀夷，集和合僧，備十功德，為比丘結戒：「若比丘婬意熾盛，",
        "translation": "At the time, the Bhagavān had innumerable skillful means to admonish Udayana, assembled the harmonious monks, prepared the ten virtues, and formed the precepts for the monks:",
        "source": "T24n1464_003:0862a10_7"
    },
    {
        "source_sentence": "手摸女人，若執手捉臂捉髮及諸身體腕節，摩抆把持，犯者，僧伽婆施沙。」",
        "translation": "If he touches a woman with his hand, takes her by the hand, grasps her armpits and bodily wrist knuckles, rubs their hands together, and holds them, it's a violation to give sand to Saṃghâva.",
        "source": "T24n1464_003:0862a12_8"
    },
    {
        "source_sentence": "時尊者優波離問佛：「把持女人幾處，是僧伽婆施沙？」",
        "translation": "Venerable Upāli then asked the Buddha, Where is this Saṃghâvaśeṣa holding a woman?",
        "source": "T24n1464_003:0862a14_9"
    },
    {
        "source_sentence": "世尊告曰：「若比丘以婬意熾盛，從堂上抱女子著象上，僧伽婆施沙。",
        "translation": "The Bhagavān told him, Suppose a monk's anger is so intense that he goes up from his hall to embrace a woman and puts her on an elephant, and the saṃghâva gives them sand.",
        "source": "T24n1464_003:0862a15_10"
    },
    {
        "source_sentence": "若象上抱下著馬上、馬上抱著車上、車上抱著輿上、輿上抱著床上、床上抱著繩床上、繩床上抱著机上、机上抱著地，",
        "translation": "Suppose an elephant is embraced on a horse, carried on a chariot on a horse, carried on a cart on a chariot, carried on a carriage, carried on a palanquin, carried on a bed, carried on a rope bed, carried on a chair on a rope bed, carried on a chair on a chair, carried on a desk on a desk",
        "source": "T24n1464_003:0862a17_11"
    },
    {
        "source_sentence": "若復從地抱展轉還至堂上者，僧伽婆施沙。",
        "translation": "If he again embraces it from the ground and goes back up to the hall in turn, the saṃghâva gives sand.",
        "source": "T24n1464_003:0862a19_12"
    },
    {
        "source_sentence": "除其母姊妹、病人，無染著意者，不犯戒。」",
        "translation": "Except for their mother, sisters, and sick people who aren't defiled by attachment, they won't violate the precepts.",
        "source": "T24n1464_003:0862a20_13"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_003:0862a22_0"
    },
    {
        "source_sentence": "爾時有眾比丘於拘薩羅國夏坐，夏坐已補納衣，一日成衣，著衣持鉢來至舍衛。",
        "translation": "It was then that a group of monks were sitting in the country of Kośala for the summer retreat, and after they had sat for the summer retreat, they patched their robes one day and completed their robes, put on their robes and bowls, and came to Śrāvastī.",
        "source": "T24n1464_003:0862a22_1"
    },
    {
        "source_sentence": "去舍衛不遠有江，名阿脂賴跋提，南岸止住，水流駃疾。",
        "translation": "Not far from Sāvatthī there is a river called Aciravatī, which lies on the southern bank and flows with fast-flowing water.",
        "source": "T24n1464_003:0862a24_2"
    },
    {
        "source_sentence": "時有諸婦女白比丘言：「諸嚴賢等渡我等。」",
        "translation": "Some women then said to the monks, Let's go cross over to us, you sages.",
        "source": "T24n1464_003:0862a25_3"
    },
    {
        "source_sentence": "諸比丘答：「諸姊當知，世尊不許得渡女人。」",
        "translation": "The monks replied, Sisters, You should know that the Bhagavān won't allow you to cross over to a woman.",
        "source": "T24n1464_003:0862a26_4"
    },
    {
        "source_sentence": "諸女人各相執手便入水中，為水所漂。",
        "translation": "Each of the women held their hands and went into the water, where they were floating in the water.",
        "source": "T24n1464_003:0862a27_5"
    },
    {
        "source_sentence": "即稱怨言：「諸賢諸賢，誰有慈心能勝釋子，我今沒溺，願來見救。」",
        "translation": "He then called out to the enemy, saying, Good men and good men, who with kindness can overcome the Śākyamuni's son? Now that I'm submerged, may I come to see and rescue him.",
        "source": "T24n1464_003:0862a28_6"
    },
    {
        "source_sentence": "諸比丘愍念，往執手救。",
        "translation": "The monks felt pity for him and went to rescue him by holding his hand.",
        "source": "T24n1464_003:0862b01_0"
    },
    {
        "source_sentence": "諸比丘各懷疑：「不犯僧伽婆施沙？」",
        "translation": "The monks each wondered, Is it not a violation of the saṃghâvaśeṣa?",
        "source": "T24n1464_003:0862b01_1"
    },
    {
        "source_sentence": "即問諸比丘。",
        "translation": "He then asked the monks.",
        "source": "T24n1464_003:0862b02_2"
    },
    {
        "source_sentence": "諸比丘不知當何報，往白世尊。",
        "translation": "The monks didn't know what to repay, so they went to the Bhagavān.",
        "source": "T24n1464_003:0862b02_3"
    },
    {
        "source_sentence": "世尊告曰：「無染著意不犯罪。",
        "translation": "The Bhagavān told him, Don't be defiled by attachment and not commit crimes.",
        "source": "T24n1464_003:0862b03_4"
    },
    {
        "source_sentence": "以慈心往救，若復當有溺沒者，若捉髮執衣不得持體。",
        "translation": "If someone were to rescue them with a compassionate mind, they wouldn't be able to carry their body if they were to catch and cling to their robe.",
        "source": "T24n1464_003:0862b03_5"
    },
    {
        "source_sentence": "火厄亦爾。」",
        "translation": "So is the misfortune of fire.",
        "source": "T24n1464_003:0862b05_6"
    },
    {
        "source_sentence": "有一女人行嶮峪側，時比丘捉手過。",
        "translation": "A woman was walking along the side of a precipitous valley, when a monk caught her hand and passed by.",
        "source": "T24n1464_003:0862b05_7"
    },
    {
        "source_sentence": "比丘便疑：「我不犯僧伽婆施沙？」",
        "translation": "The monk then wondered, Isn't it a violation of the saṃghâvaśeṣa?",
        "source": "T24n1464_003:0862b06_8"
    },
    {
        "source_sentence": "往白世尊。",
        "translation": "He went to the Bhagavān and said.",
        "source": "T24n1464_003:0862b07_0"
    },
    {
        "source_sentence": "世尊告曰：「無染著意不犯罪。",
        "translation": "The Bhagavān told him, Don't be defiled by attachment and not commit crimes.",
        "source": "T24n1464_003:0862b07_1"
    },
    {
        "source_sentence": "若復當更有如此者，以衣裹手往捉臂過。」",
        "translation": "If there's another person like this, wrap their hands in their robes and go to them to catch their arm.",
        "source": "T24n1464_003:0862b07_2"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_003:0862b09_0"
    },
    {
        "source_sentence": "時尊者迦留陀夷於祇桓止住。",
        "translation": "Venerable Kālôdayin then stayed at Jīvaka.",
        "source": "T24n1464_003:0862b09_1"
    },
    {
        "source_sentence": "有諸長者婦女來至浴池房園觀看，執鑰牡開諸房戶，呼曰：「諸姊來入浴池觀看。」",
        "translation": "Some elderly women came to the bathing pond and looked at the dwelling garden, opened the doors of the dwellings with their keys, and called out, Sisters, come and look at the bathing pond.",
        "source": "T24n1464_003:0862b10_2"
    },
    {
        "source_sentence": "婦女至浴池園觀，優陀夷共諸婦女談語經時，說婬快樂相娛樂事。",
        "translation": "When the women went to bathe in the pond and park, Udayana and the women talked about the sūtras together, saying that they were enjoying sexual pleasure and entertaining each other.",
        "source": "T24n1464_003:0862b12_3"
    },
    {
        "source_sentence": "其中婦女或有然可、或不然可。",
        "translation": "The women among them may be allowed to do so or not allowed to do so.",
        "source": "T24n1464_003:0862b13_4"
    },
    {
        "source_sentence": "其不然可者，出白諸比丘：「常聞無畏安隱處，而更恐畏。」",
        "translation": "If he doesn't approve, he goes out and tells the monks, Always hear that there's a place of fearlessness and peacefulness but become even more frightened.",
        "source": "T24n1464_003:0862b14_5"
    },
    {
        "source_sentence": "諸比丘問：「有何恐畏？」",
        "translation": "The monks asked, What fear is there?",
        "source": "T24n1464_003:0862b15_6"
    },
    {
        "source_sentence": "諸婦女具白比丘。",
        "translation": "The women all told the monk.",
        "source": "T24n1464_003:0862b16_7"
    },
    {
        "source_sentence": "時優陀夷以出，語諸比丘亦爾。",
        "translation": "Udayana then went out and said the same thing to the monks.",
        "source": "T24n1464_003:0862b16_8"
    },
    {
        "source_sentence": "諸比丘諫責優陀夷：「世尊不以無數方便說婬不淨，向婬念婬、婬意熾盛婬之惡露？」",
        "translation": "The monks remonstrated with Udayana, Bhagavān, didn't the Bhagavān use countless skillful means to say that sexual misconduct is impure and that it's a bad dew for anger, thoughts of anger, and thoughts of anger are raging in anger?",
        "source": "T24n1464_003:0862b17_9"
    },
    {
        "source_sentence": "諸比丘苦諫已，往白世尊。",
        "translation": "After the monks had been painfully remonstrated, they went to the Bhagavān.",
        "source": "T24n1464_003:0862b19_10"
    },
    {
        "source_sentence": "世尊知而問尊者優陀夷：「審為此事，如諸比丘所白不？」",
        "translation": "Knowing this, the Bhagavān asked Venerable Udayana, Do you examine this matter as the monks said?",
        "source": "T24n1464_003:0862b19_11"
    },
    {
        "source_sentence": "優陀夷內懷慚愧外則恥眾，偏袒右肩右膝著地叉手向佛，白世尊言：「審爾。",
        "translation": "Udāyin, internally ashamed of his shame and embarrassed by the crowd, bared his right shoulder, knelt on his right knee, saluted the Buddha with his palms together, and said to the Bhagavān, Listen.",
        "source": "T24n1464_003:0862b21_12"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T24n1464_003:0862b22_13"
    },
    {
        "source_sentence": "世尊告曰：「我不以無數方便說婬之不淨，向婬念婬、婬意熾盛婬之惡露？",
        "translation": "The Bhagavān told them, Don't I use countless skillful means to explain the impurity of sexual misconduct and the bad dew of anger toward anger, mindfulness of anger, and thoughts of anger that are blazing with anger?",
        "source": "T24n1464_003:0862b22_14"
    },
    {
        "source_sentence": "卿云何歎婬相娛樂事？」",
        "translation": "How do you praise the deeds of enjoyment of sexual misconduct?",
        "source": "T24n1464_003:0862b24_15"
    },
    {
        "source_sentence": "世尊無數方便誨責，集和合僧，備十功德，為比丘結戒：「若比丘婬意熾盛，",
        "translation": "The Bhagavān, who had innumerable skillful means to admonish and reprimand them, assembled the harmonious monks, prepared the ten virtues, and formed the precepts for the monks: If a monk's anger is so intense that he becomes jealous of it,",
        "source": "T24n1464_003:0862b25_16"
    },
    {
        "source_sentence": "向女人歎婬相娛樂事，惡語相向惡眼相視，若大若小女人，犯者僧伽婆施沙。」",
        "translation": "If he praises women for their deeds, speaks harshly to them and looks at them with bad eyes, or if he's a large or small woman, the offender is given sand by Saṃghâva.",
        "source": "T24n1464_003:0862b26_17"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_003:0862b29_0"
    },
    {
        "source_sentence": "時諸比丘各行乞食至揭貳迦村(婬聚)，諸長者見，嫌其到彼：「此諸釋子吉無不利，",
        "translation": "The monks then each went to the village of Gṛdhrakūṭa for almsround, and when the elders saw them, they resented their arrival there, saying, “These Śākyamunis are fortunate and not disadvantageous.",
        "source": "T24n1464_003:0862b29_1"
    },
    {
        "source_sentence": "自知稱好而入此婬聚，如彼婬人，入者以婬故。",
        "translation": "He knows for himself that he's praised as good and enters this crude group, just like that crude person who enters because of his crudeness.",
        "source": "T24n1464_003:0862c02_2"
    },
    {
        "source_sentence": "亦入諸女家大童女家，如欲娶婦者。」",
        "translation": "They'll also enter the house of women and the house of great girls, just as if they want to marry a woman.",
        "source": "T24n1464_003:0862c03_3"
    },
    {
        "source_sentence": "諸比丘以此因緣具白世尊。",
        "translation": "The monks told the Bhagavān about this cause and condition.",
        "source": "T24n1464_003:0862c04_4"
    },
    {
        "source_sentence": "世尊告曰：「比丘有五事不應行。",
        "translation": "The Bhagavān told him, There are five things a monk shouldn't do.",
        "source": "T24n1464_003:0862c05_5"
    },
    {
        "source_sentence": "云何五？",
        "translation": "What are the five?",
        "source": "T24n1464_003:0862c05_6"
    },
    {
        "source_sentence": "入婬種家、入大童女家、若寡婦不端者家、沽酒家、偷賊家。",
        "translation": "He enters a house of sexual misconduct, a house for big girls, a house for widows who aren't dignified, a house for selling wine, and a house for thieves.",
        "source": "T24n1464_003:0862c06_0"
    },
    {
        "source_sentence": "比丘此五不應行，比丘不得入。",
        "translation": "A monk shouldn't practice these five things, and a monk mustn't enter them.",
        "source": "T24n1464_003:0862c07_1"
    },
    {
        "source_sentence": "若其入者，此比丘為犯罪、為有重過。」",
        "translation": "If he enters, this monk commits a crime or serious offense.",
        "source": "T24n1464_003:0862c08_2"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_003:0862c09_0"
    },
    {
        "source_sentence": "彼有一婆羅門生女，顏色姝好端正無雙，以其端正故母字為善光。",
        "translation": "There was a Brāhmaṇa who gave birth to a woman of unsurpassed beauty and beauty. Because she was so beautiful, her mother’s name in olden times was Sunetra.",
        "source": "T24n1464_003:0862c09_1"
    },
    {
        "source_sentence": "初生之日為相師婆羅門見記：「此女人當與五百人通。」",
        "translation": "On the day of her first birth, she was given to a Brāhmaṇa who saw her and said, This woman will give it to five hundred people.",
        "source": "T24n1464_003:0862c11_2"
    },
    {
        "source_sentence": "遂長十六歲，諸人聞記當與五百人通，無有娶者。",
        "translation": "So he grew up to the age of sixteen years old. All the people who heard this prediction gave it to the five hundred members of the royal family, but no one would marry him.",
        "source": "T24n1464_003:0862c12_3"
    },
    {
        "source_sentence": "有一入海商人，與共比村，遙見此女端正，便起婬想，即問：「此誰家女？」",
        "translation": "A merchant entered the sea and shared a village with him. Seeing this woman's beauty from a distance, he had sexual thoughts and asked, Whose daughter is this?",
        "source": "T24n1464_003:0862c13_4"
    },
    {
        "source_sentence": "答者言：「婆羅門女。」",
        "translation": "The answerer said, Brāhmaṇa maiden.",
        "source": "T24n1464_003:0862c15_5"
    },
    {
        "source_sentence": "復問：「為嫁未？」",
        "translation": "Again, he asked, Is she married yet?",
        "source": "T24n1464_003:0862c15_6"
    },
    {
        "source_sentence": "答：「未也。」",
        "translation": "Answer, Not yet.",
        "source": "T24n1464_003:0862c15_7"
    },
    {
        "source_sentence": "「若爾者我當娶為婦。」",
        "translation": "If that's the case, I will take her as my wife.",
        "source": "T24n1464_003:0862c16_8"
    },
    {
        "source_sentence": "答者言：「此女盡好，有一不可。」",
        "translation": "The answerer said, This woman is so beautiful that there's one thing she can't do.",
        "source": "T24n1464_003:0862c16_9"
    },
    {
        "source_sentence": "問：「是何事？」",
        "translation": "He asked, What's the matter?",
        "source": "T24n1464_003:0862c17_10"
    },
    {
        "source_sentence": "答者具語：「初生之日，相師梵志記，當與五百人通。」",
        "translation": "The answerer told them all, On the day he's first born, the master of signs and priests will give it to five hundred people.",
        "source": "T24n1464_003:0862c17_11"
    },
    {
        "source_sentence": "商人復作是念：「我舍無有人入，唯有釋子。",
        "translation": "Again, the merchant thought, There's no one to enter my house but the Śākyamuni.",
        "source": "T24n1464_003:0862c18_12"
    },
    {
        "source_sentence": "然釋子無有此意。」",
        "translation": "Still, the Śākyamuni doesn't have this idea.",
        "source": "T24n1464_003:0862c19_13"
    },
    {
        "source_sentence": "商人便娉為婦娶之。",
        "translation": "The merchant then gave her to the woman and married her.",
        "source": "T24n1464_003:0862c20_0"
    },
    {
        "source_sentence": "未遠有商人入海採寶，彼國常法，其有商人數入海者常使導前，若自不肯，",
        "translation": "Not far from here, however, there were merchants going into the sea to collect precious things. The custom of that country is always the same: if there were merchants who went into the sea with a large number of merchants, they would always be guided by an envoy; but if they did not wish to do so, how could they go ahead?",
        "source": "T24n1464_003:0862c20_1"
    },
    {
        "source_sentence": "王逼之。",
        "translation": "The king oppressed him.",
        "source": "T24n1464_003:0862c22_2"
    },
    {
        "source_sentence": "時商人來語此商人：「君次應在前採寶。」",
        "translation": "The merchant then came and said to the merchant, Next, you should go ahead and gather treasure.",
        "source": "T24n1464_003:0862c22_3"
    },
    {
        "source_sentence": "商人便勅守門者：「我今入海採寶。",
        "translation": "The merchant then instructed the gatekeeper, Now, I'll go into the ocean to gather treasure.",
        "source": "T24n1464_003:0862c23_4"
    },
    {
        "source_sentence": "莫使異人於此止宿，除其釋子。",
        "translation": "Don't cause any other people to stay here, except for the Śākyamuni.",
        "source": "T24n1464_003:0862c24_0"
    },
    {
        "source_sentence": "所以爾者，釋子無有婬意。」",
        "translation": "That's why the Śākyamuni has no angry intention.",
        "source": "T24n1464_003:0862c24_1"
    },
    {
        "source_sentence": "即日發引入海。",
        "translation": "That day, he set out to enter the ocean.",
        "source": "T24n1464_003:0862c25_2"
    },
    {
        "source_sentence": "有沙門婆羅門至此家乞食者，婦便共調戲說婬之歡樂：「可來與我作不淨行。」",
        "translation": "When an ascetic or brāhmaṇa comes to this house to solicit alms, the woman then plays with him and tells him how happy he is, Come and give me some impure behavior.",
        "source": "T24n1464_003:0862c25_3"
    },
    {
        "source_sentence": "諸比丘不知當何報，各懷疑往詣世尊，具白此事。",
        "translation": "The monks didn't know what to repay, so they each doubted it and went to the Bhagavān to report this matter.",
        "source": "T24n1464_003:0862c27_4"
    },
    {
        "source_sentence": "世尊告曰：「如此家者比丘不得入乞食。",
        "translation": "The Bhagavān told them, Such a monk at home won't enter to solicit alms.",
        "source": "T24n1464_003:0862c28_5"
    },
    {
        "source_sentence": "若入乞食者，不得坐、不得與言語。",
        "translation": "If someone enters to solicit alms, they mustn't sit or speak with them.",
        "source": "T24n1464_003:0862c29_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1464_003:0863a01_7"
    },
    {
        "source_sentence": "如此家壞人梵行。",
        "translation": "Such a family destroys people's religious practice.",
        "source": "T24n1464_003:0863a01_8"
    },
    {
        "source_sentence": "設坐聽受語者，僧伽婆施沙。」",
        "translation": "Suppose someone sits and listens to the words they receive, and Saṃghâva gives them sand.",
        "source": "T24n1464_003:0863a01_9"
    },
    {
        "source_sentence": "彼女人婬意熾盛，即日向暮便死，莊嚴服飾輿棄塚間。",
        "translation": "The woman's anger became so strong that she died at sunset, and her adorned clothes and carriage were abandoned in the cemetery.",
        "source": "T24n1464_003:0863a02_10"
    },
    {
        "source_sentence": "時有五百群賊從塚間過，見此女尸便起婬意，向五百人盡為不淨行。",
        "translation": "When five hundred groups of thieves passed by from the tomb, they saw this woman's corpse and became angry, pointing at five hundred people for all their impure behavior.",
        "source": "T24n1464_003:0863a03_11"
    },
    {
        "source_sentence": "如前婆羅門所記，其語不虛。",
        "translation": "As the previous Brāhmaṇa explained, his words aren't false.",
        "source": "T24n1464_003:0863a05_12"
    },
    {
        "source_sentence": "坐與沙門婆羅門調戲故，由此因緣生三惡趣，天竺國北泉水名毘怛吐作龍妻，",
        "translation": "Because he sat and played with the śramaṇas and brāhmaṇas, they were born in the three evil destinies as a result of these causes and conditions. The northern fountain in India is called Vaiśravaṇa’s dragon wife.",
        "source": "T24n1464_003:0863a05_13"
    },
    {
        "source_sentence": "有五百龍常與共通。",
        "translation": "There were 500 dragons who always shared it with each other.",
        "source": "T24n1464_003:0863a07_14"
    },
    {
        "source_sentence": "佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "Bhagavān, the Bhagavān, traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_003:0863a09_0"
    },
    {
        "source_sentence": "爾時有諸長者婦女來至房舍園觀觀看，時六群比丘語諸長者婦女言：「我等國王子端正無雙，",
        "translation": "It was then that some wealthy men and women came to the monastery garden to watch. Six groups of monks said to the wealthy men and women, “Our princes in our country are incomparably handsome.",
        "source": "T24n1464_003:0863a09_1"
    },
    {
        "source_sentence": "身體香潔精進無比。",
        "translation": "Their bodies are fragrant and clean, and their effort is unsurpassed.",
        "source": "T24n1464_003:0863a11_2"
    },
    {
        "source_sentence": "於法中最上者，汝等可與我戲笑相娛樂，能以身施者於檀中最尊。」",
        "translation": "The highest among all the teachings, you can play and entertain yourself with me, and those who give their bodies to me are the most honored among the sandalwood.",
        "source": "T24n1464_003:0863a12_3"
    },
    {
        "source_sentence": "其中婦女或然可者、不然可者。",
        "translation": "The women among them may approve or not approve.",
        "source": "T24n1464_003:0863a13_4"
    },
    {
        "source_sentence": "其不然者出語諸比丘：「常無恐懼安隱之處，而更有恐懼。」",
        "translation": "If he doesn't, he says to the monks, Always have no fear where you're comfortable, and there's still fear.",
        "source": "T24n1464_003:0863a14_5"
    },
    {
        "source_sentence": "諸比丘問：「有何事？」",
        "translation": "The monks asked, What's the matter?",
        "source": "T24n1464_003:0863a15_6"
    },
    {
        "source_sentence": "諸婦女具白比丘。",
        "translation": "The women all told the monk.",
        "source": "T24n1464_003:0863a16_7"
    },
    {
        "source_sentence": "比丘不知當何報，往白世尊。",
        "translation": "The monk didn't know what to repay, so he went to the Bhagavān.",
        "source": "T24n1464_003:0863a16_8"
    },
    {
        "source_sentence": "世尊知而問六群諸比丘：「審為此事耶？」",
        "translation": "Knowing this, the Bhagavān asked the six groups of monks, Did you examine this matter?",
        "source": "T24n1464_003:0863a17_9"
    },
    {
        "source_sentence": "比丘內懷慚愧外則恥眾，偏袒右臂右膝著地長跪叉手，白佛言：「審爾。",
        "translation": "The monk was internally ashamed and shameful but externally ashamed of the crowd. He bared his right shoulder, knelt with his right knee on the ground, saluted him by folding his palms, and said to the Buddha:",
        "source": "T24n1464_003:0863a18_10"
    },
    {
        "source_sentence": "世尊！」",
        "translation": "Bhagavān!",
        "source": "T24n1464_003:0863a19_11"
    },
    {
        "source_sentence": "世尊告曰：「云何癡人！",
        "translation": "The Bhagavān told him, What a fool!",
        "source": "T24n1464_003:0863a20_0"
    },
    {
        "source_sentence": "我不說婬如蛇毒蜇人(修妬路)，寧為蛇毒虺毒黑蟒毒所蜇，不與剎利種婆羅門種長者種婦女交會。",
        "translation": "I won't say that it's like a snake poisonous to sting people (the path of cultivation), preferring to be stung by the poison of snakes, poisonous gnats, and black pythons, and not having sexual intercourse with the elders of the Śāriputra family or the Brāhmaṇa family.",
        "source": "T24n1464_003:0863a20_1"
    },
    {
        "source_sentence": "雖復端正無雙服飾殊好，寧投身入火不與交會。",
        "translation": "Even though he's handsome and has no pair of distinctive clothing, he prefers to throw himself into the fire and doesn't engage in sexual misconduct.",
        "source": "T24n1464_003:0863a22_2"
    },
    {
        "source_sentence": "我不說婬如大聚薪(修妬路)放火然，大聚薪火炎熾盛，寧身投入中，",
        "translation": "I don't say it's like a large heap of firewood (the path of cultivation) that burns, but the large heap of firewood is so blazing hot that I'd rather throw myself into it.",
        "source": "T24n1464_003:0863a23_3"
    },
    {
        "source_sentence": "不與剎利種婆羅門長者婦女交接娛樂。",
        "translation": "They won't engage in sexual intercourse with the elders and women of the warrior family.",
        "source": "T24n1464_003:0863a25_4"
    },
    {
        "source_sentence": "我不說婬如深火坑(修妬路)，大深坑盛滿火，但有赤炭無有烟氣，寧投身入，",
        "translation": "I don't say that it's like a deep fire pit (the path of cultivation), and the great deep pit is full of fire, but there's red charcoal and no smoke, so I'd rather throw myself into it.",
        "source": "T24n1464_003:0863a26_5"
    },
    {
        "source_sentence": "不與剎利婆羅門長者種婦女交接娛樂。",
        "translation": "They won't engage in sexual intercourse with the elders of the kṣatriya brāhmaṇas and women.",
        "source": "T24n1464_003:0863a27_6"
    },
    {
        "source_sentence": "婬如狗齩(五巧反)骨、如鳥銜肉，肉既少少受苦多也。",
        "translation": "It's like a dog's hindrance (five skillful antidotes) and like a bird holding flesh, which has little flesh and suffers much pain.",
        "source": "T24n1464_003:0863a28_7"
    },
    {
        "source_sentence": "如蜜塗刀，婬亦復爾。",
        "translation": "It's like applying honey to a sword, and so is the arrow.",
        "source": "T24n1464_003:0863a29_8"
    },
    {
        "source_sentence": "如王有教取彼罪人，日三時拷拷則矛刺百瘡，婬亦復然。",
        "translation": "Suppose the king has an instruction to take those sinners away, torture them three times a day and three times a day, and then spit on a hundred sores with a spear, and so it is with the abscess.",
        "source": "T24n1464_003:0863b01_9"
    },
    {
        "source_sentence": "亦如畫瓶中盛臭處、如毒花香向鼻則死，寧飲毒漿而不向婬。",
        "translation": "It's also like when a painted vial contains a place full of bad odor and poisonous flowers with an odor that goes to the nose and dies, preferring to drink poisonous juice instead of boiling it.",
        "source": "T24n1464_003:0863b02_10"
    },
    {
        "source_sentence": "如人彈琴，但有空聲，亦如劍樹上下刺人，如怨家盜賊常無善意，如沸屎灰河地獄，",
        "translation": "It's like when someone plays the lute but has an empty sound, it's like a sword tree that stabs people up and down with its sword. Like enemies who steal from thieves and always have no good intentions, it's like boiling excrement in the ash-river hell.",
        "source": "T24n1464_003:0863b04_11"
    },
    {
        "source_sentence": "婬亦復然。",
        "translation": "It's likewise with anger.",
        "source": "T24n1464_003:0863b06_12"
    },
    {
        "source_sentence": "我不說婬義因緣、婬本末鬪諍、縣官佞讒眩惑欺誑，作種種無數惡法，",
        "translation": "I won't explain the causes and conditions of anger, disputes in the past and future, quarrels among officials, flattery, delusion, deceitfulness, and various kinds of countless bad qualities.",
        "source": "T24n1464_003:0863b06_13"
    },
    {
        "source_sentence": "皆由婬起。",
        "translation": "They all arise from anger.",
        "source": "T24n1464_003:0863b07_14"
    },
    {
        "source_sentence": "我無數方便說婬不淨，向婬念婬、婬意熾盛婬之惡露。",
        "translation": "Countless times I've explained that anger is impure, pointing out the bad dew of anger toward anger and the blazing anger in anger and anger-mindfulness.",
        "source": "T24n1464_003:0863b08_15"
    },
    {
        "source_sentence": "卿等云何於中造惡？」",
        "translation": "How did you create evil in them?",
        "source": "T24n1464_003:0863b09_16"
    },
    {
        "source_sentence": "時世尊無數方便誨責，因此事集和合僧，備十功德，佛為比丘結戒：「若比丘婬意熾盛，",
        "translation": "When the Bhagavān had innumerable skillful means to admonish them, he gathered the harmonious saṃgha for this reason and prepared the ten virtues. The Buddha established the precepts for monks: If a monk's anger is intense,",
        "source": "T24n1464_003:0863b09_17"
    },
    {
        "source_sentence": "於女人前自歎身端正，又言精進比丘，於法中最上淨行。",
        "translation": "In front of the woman, he praised himself for his good appearance and said, A diligent monk who conducts himself with utmost purity is the most pure practice in the Dharma.",
        "source": "T24n1464_003:0863b11_18"
    },
    {
        "source_sentence": "作如是法行者，僧伽婆施沙。」",
        "translation": "If someone does such a practice, the saṃghâva will give them sand.",
        "source": "T24n1464_003:0863b13_19"
    },
    {
        "source_sentence": "(一跋難陀，二難陀，生天迦留陀夷，闡怒闡怒車匿也。",
        "translation": "(The first is Upananda, and the second is Upananda, born in the heavenly Kālôdayin, a charioteer of anger and anger.",
        "source": "T24n1464_003:0863b13_20"
    },
    {
        "source_sentence": "佛去世已，於阿難許得道，二人般涅槃，馬師、弗那跋，生龍中。",
        "translation": "After the demise of the Buddha, he gave his permission to Ānanda to attain enlightenment, and they both entered nirvana. The horsemen and Pūrṇavardhana were born among dragons.",
        "source": "T24n1464_003:0863b14_21"
    },
    {
        "source_sentence": "六人也。",
        "translation": "They are the six kinds of people.",
        "source": "T24n1464_003:0863b14_22"
    },
    {
        "source_sentence": "皆從弟。",
        "translation": "They all follow their disciples.",
        "source": "T24n1464_003:0863b15_0"
    },
    {
        "source_sentence": "闡觸綿反。",
        "translation": "He explains that contact is repeatedly contradictory.",
        "source": "T24n1464_003:0863b15_1"
    },
    {
        "source_sentence": "怒奴故反)佛世尊遊舍衛國祇樹給孤獨園。",
        "translation": "The Buddha Bhagavān traveled to Anāthapiṇḍada Park in Jeta Grove in Śrāvastī.",
        "source": "T24n1464_003:0863b15_2"
    },
    {
        "source_sentence": "爾時尊者阿難，平旦著衣持鉢入舍衛城分衛，分衛已還出城。",
        "translation": "Venerable Ānanda then, at dawn, put on his robes, took his bowl, and entered the city of Śrāvastī to guard it. Having guarded it, he returned out of the city.",
        "source": "T24n1464_003:0863b16_3"
    },
    {
        "source_sentence": "爾時甚熱夏後月暑盛，時尊者阿難行路中道焦渴。",
        "translation": "It was then that the moon became very hot and after the summer months became intensely hot, and Venerable Ānanda was traveling on a path of hunger and thirst.",
        "source": "T24n1464_003:0863b18_4"
    },
    {
        "source_sentence": "彼中道有旃荼羅女名鉢吉蹄，於井汲水。",
        "translation": "In the middle way, there was a caṇḍala woman named Padmavyūha who drew water from a well.",
        "source": "T24n1464_003:0863b19_5"
    },
    {
        "source_sentence": "時阿難詣井乞水，語：「大妹！",
        "translation": "Ānanda then went to the well to solicit water and said, Great sister!",
        "source": "T24n1464_003:0863b20_6"
    },
    {
        "source_sentence": "我今須水，施我少水。」",
        "translation": "Now that I need water, give me a little water.",
        "source": "T24n1464_003:0863b20_7"
    },
    {
        "source_sentence": "時女報阿難：「我是摩鄧伽種。」",
        "translation": "The woman then reported to Ānanda, I'm of the Mātaṅga family.",
        "source": "T24n1464_003:0863b21_8"
    },
    {
        "source_sentence": "阿難語：「我不問是義旃荼羅非旃荼羅也。",
        "translation": "Ānanda said, I don't ask whether this meaning is a caṇḍala or not a caṇḍala.",
        "source": "T24n1464_003:0863b22_9"
    },
    {
        "source_sentence": "我今須水，但施我水。」",
        "translation": "Now, I need water, but give me water.",
        "source": "T24n1464_003:0863b23_0"
    },
    {
        "source_sentence": "女報：「君母種成就，沙門瞿曇第一弟子，王波斯匿所敬末利夫人阿闍梨。",
        "translation": "The woman replied, Your mother's family is accomplished, the first disciple of the ascetic Gautama, and the king Prasenajit respects the Ajātaśatru of Lady Mālī.",
        "source": "T24n1464_003:0863b23_1"
    },
    {
        "source_sentence": "我是旃荼羅種，不敢持水相與。」",
        "translation": "I'm a caṇḍāla, so I won't dare to carry the water and give it to you.",
        "source": "T24n1464_003:0863b25_2"
    },
    {
        "source_sentence": "阿難語女：「我不問汝旃荼羅非旃荼羅。",
        "translation": "Ānanda said to the woman, I won't ask you whether it's a candra or not a candra.",
        "source": "T24n1464_003:0863b25_3"
    },
    {
        "source_sentence": "我今須水，速以水見與。」",
        "translation": "Now, I need water, so quickly give it to you with water.",
        "source": "T24n1464_003:0863b26_4"
    },
    {
        "source_sentence": "女答：「若須水者便取。」",
        "translation": "The woman answered, If you need water, take it.",
        "source": "T24n1464_003:0863b27_5"
    },
    {
        "source_sentence": "時女先掬水澆阿難足，復掬水澆阿難手。",
        "translation": "The woman then poured water over Ānanda's feet with a scoop of water, and again poured water over Ānanda's hands with a scoop of water.",
        "source": "T24n1464_003:0863b27_6"
    },
    {
        "source_sentence": "澆手足已，復生婬意。",
        "translation": "After pouring water over his hands and feet, he again had a feeling of anger.",
        "source": "T24n1464_003:0863b28_7"
    },
    {
        "source_sentence": "時尊者阿難飲水已，便前進路。",
        "translation": "After he had drunk water, Venerable Ānanda then went on his way.",
        "source": "T24n1464_003:0863b29_8"
    },
    {
        "source_sentence": "時鉢吉蹄女見阿難前行不遠，捉水瓶還家，啟白父母：「阿母！",
        "translation": "When she saw Ānanda walking not far away in front of her, the Prabhākaramitra woman returned home with a water bottle and asked her parents, A mother!",
        "source": "T24n1464_003:0863b29_9"
    },
    {
        "source_sentence": "願以沙門阿難為夫婿。」",
        "translation": "May the ascetic Ānanda be his husband and son-in-law.",
        "source": "T24n1464_003:0863c02_10"
    },
    {
        "source_sentence": "母答：「此阿難者轉輪王家子，剎利釋種，姓瞿曇。",
        "translation": "The mother answered, This Ānanda is the son of the wheel-turning king's family, a Śāriputra of the kṣatriya caste named Gautama.",
        "source": "T24n1464_003:0863c02_11"
    },
    {
        "source_sentence": "國王大臣盡識知，沙門瞿曇弟子。",
        "translation": "The king and his ministers all knew him, and he was a disciple of the ascetic Gautama.",
        "source": "T24n1464_003:0863c03_12"
    },
    {
        "source_sentence": "是波斯匿所敬、末利夫人師。",
        "translation": "This was the teacher respected by Prasenajit and Lady Miliṇḍa.",
        "source": "T24n1464_003:0863c04_13"
    },
    {
        "source_sentence": "我等小家旃荼羅種，當云何得阿難以為夫婿？」",
        "translation": "How will we, the caṇḍalas of our small family, get Ānanda to be their husband?",
        "source": "T24n1464_003:0863c05_14"
    },
    {
        "source_sentence": "女報母：「若不得阿難為夫婿者，我若當飲毒、以刀自刺、若自絞死。」",
        "translation": "The woman told her mother, If you can't get Ānanda to be your husband and son-in-law, then I'll drink poison, stab myself with a knife, or squeeze myself to death.",
        "source": "T24n1464_003:0863c06_15"
    },
    {
        "source_sentence": "母報女曰：「此間亦有摩鄧伽神語符呪，能移日月以墮著地，復能移著。",
        "translation": "The mother replied to the maid, “There is also a magical spell called ‘Mātaṅga’ that moves the sun and moon by dropping them to the ground.",
        "source": "T24n1464_003:0863c07_16"
    },
    {
        "source_sentence": "彼亦能呪因帝梵天使下，況不能得沙門。",
        "translation": "They can also curse Indra and Brahmā, so why wouldn't they attain as an ascetic?",
        "source": "T24n1464_003:0863c09_17"
    },
    {
        "source_sentence": "阿難使來，或能以一事不可得，若死若生不能婬。",
        "translation": "Ānanda's messenger came, or he might be able to do something that's unobtainable, and if he dies or is born, he can't see it.",
        "source": "T24n1464_003:0863c10_18"
    },
    {
        "source_sentence": "設復為沙門瞿曇所護者，我不能得，除此可得。」",
        "translation": "Suppose someone else is protected by the ascetic Gautama, and I can't get it; except for this, I can get it.",
        "source": "T24n1464_003:0863c11_19"
    },
    {
        "source_sentence": "女聞此語歡喜踊躍，便起澡浴莊嚴身體，著白服飾敷臥具思想而望來。",
        "translation": "When she heard these words, the woman rejoiced and jumped for joy. Then she got up to bathe and adorned her body. She dressed herself in white clothes, spread out bedding, and thought of coming.",
        "source": "T24n1464_003:0863c12_20"
    },
    {
        "source_sentence": "時母亦藻浴著白服飾，以牛屎塗地，以五色綖結縷，盛滿四瓶水、盛滿四椀血、盛滿椀四種香水、盛滿四椀䴵漿，",
        "translation": "The mother also bathed herself and dressed herself in white clothes. She covered the earth with cow dung and covered it with five-colored silk thread, filling four bowls of water, four bowls of blood, four kinds of perfume, and four bowls of grated wine.",
        "source": "T24n1464_003:0863c14_21"
    },
    {
        "source_sentence": "以四口大刀竪牛屎，四角頭竪四枚箭，然八明燈。",
        "translation": "With a four-pronged great sword, he devoured cow dung and a four-cornered head with four arrows, but eight bright lamps.",
        "source": "T24n1464_003:0863c16_22"
    },
    {
        "source_sentence": "取四死人髑髏，種種香塗其上。",
        "translation": "He takes the four dead people's skulls and rubs them with various kinds of fragrance.",
        "source": "T24n1464_003:0863c17_23"
    },
    {
        "source_sentence": "以花布地，捉熨斗燒香繞三匝，向東方跪而誦摩鄧伽呪術。",
        "translation": "He spreads flowers on the ground, takes an iron and burns incense, circumambulates it three times, kneels toward the east, and recites the mantra of Mātaṅga.",
        "source": "T24n1464_003:0863c18_24"
    },
    {
        "source_sentence": "時阿難於祇桓意便恍惚，為呪所縛，如魚被鐵鉤、如象隨鉤。",
        "translation": "Ānanda then went into a trance in Jīvaka's mind and was bound by a spell, like a fish caught with an iron hook or an elephant following a hook.",
        "source": "T24n1464_003:0863c19_25"
    },
    {
        "source_sentence": "時尊者阿難隨呪術至旃荼羅家，母便語女：「阿難已至，從卿所為。」",
        "translation": "Venerable Ānanda then followed the spell and went to the house of Candra, and his mother said to her daughter, Ānanda has arrived, following what you've done.",
        "source": "T24n1464_003:0863c21_26"
    },
    {
        "source_sentence": "時鉢吉蹄女見阿難，踊躍歡喜，前抱阿難坐著床上，牽掣衣裳捻挃阿難。",
        "translation": "When she saw Ānanda, the woman Prabhākaramitra jumped and rejoiced. Embracing Ānanda in front of her, she sat cross-legged on the couch; pulling him with her clothes and robes, she twisted [the upper part of] Ānanda’s neck.",
        "source": "T24n1464_003:0863c22_27"
    },
    {
        "source_sentence": "譬如力人手捉長毛小羊，從其人手。",
        "translation": "It's like a strong man holding a small sheep with long hair in his hand and following it from that person's hand.",
        "source": "T24n1464_003:0863c24_28"
    },
    {
        "source_sentence": "爾時尊者阿難見十方盡闇冥，譬如日月為羅睺阿須倫手所障，無復有明。",
        "translation": "At the time, Venerable Ānanda saw the darkness in the ten directions end, just as the sun and moon are obstructed by the hand of Rāhu asura, and there's no more light.",
        "source": "T24n1464_003:0863c25_29"
    },
    {
        "source_sentence": "如是阿難為大呪所厭不得動。",
        "translation": "Thus, Ānanda is disgusted by the great dhāraṇī and won't move.",
        "source": "T24n1464_003:0863c26_30"
    },
    {
        "source_sentence": "於是阿難有大力人力(當十大力士力，拘夷力亦如阿難)，為呪術所厭，",
        "translation": "Ānanda then had a powerful manpower like Ānanda's, who was disgusted by the spell and hated it.",
        "source": "T24n1464_003:0863c27_31"
    },
    {
        "source_sentence": "不能得動。",
        "translation": "They can't move.",
        "source": "T24n1464_003:0863c28_32"
    },
    {
        "source_sentence": "時尊者阿難聖道諦力念還得寤：「我今困厄，世尊不慈愍我？」",
        "translation": "Venerable Ānanda then thought to himself, Now that I'm in distress, the Bhagavān won't have compassion for me?",
        "source": "T24n1464_003:0863c29_33"
    },
    {
        "source_sentence": "「佛者最極尊於世間，　　諦無有能過佛之前，",
        "translation": "“Buddha is the supremely honored one in the world. There is no other truth that surpasses Buddha.",
        "source": "T24n1464_003:0864a01_34"
    },
    {
        "source_sentence": "　佛者最極尊於人天，　　諦諸法之王無上田。",
        "translation": "The Buddha is the most supremely honored among humans and gods, Unsurpassed as the king of truth and dharmas.",
        "source": "T24n1464_003:0864a01_34"
    },
    {
        "source_sentence": "世尊知阿難為旃荼羅呪術所縛，便誦佛語：「阿難以此實義，於旃荼羅舍得解。",
        "translation": "Knowing that Ānanda was bound by the caṇḍāla spell, the Bhagavān recited the Buddha's words, Ānanda, this true meaning of the caṇḍāla can be understood in the caṇḍāla-śāstra.",
        "source": "T24n1464_003:0864a01_34"
    },
    {
        "source_sentence": "「法者最極尊於世間，　　諦無有能過法之前，",
        "translation": "Vimalakīrti: The doctrine is the highest and most honored in the world. There is no truth that can surpass it.",
        "source": "T24n1464_003:0864a06_0"
    },
    {
        "source_sentence": "　法者最極尊於人天，　　諦斷諸縛結永息田。",
        "translation": "The Dharma is the most supremely honored among humans and gods, which truthfully ends the bonds of bondage and permanently calms the field.",
        "source": "T24n1464_003:0864a07_0"
    },
    {
        "source_sentence": "「阿難以此實義，於旃荼羅舍得解。",
        "translation": "Ānanda, this true meaning of the abhidharma is understood in caṇḍālaśa.",
        "source": "T24n1464_003:0864a08_0"
    },
    {
        "source_sentence": "「僧者最極尊於世間，　　諦無有能過僧之前，",
        "translation": "Vimalakīrti: The community of monks is the highest and most honored thing in the world. There is really no one who surpasses the community of monks.",
        "source": "T24n1464_003:0864a09_0"
    },
    {
        "source_sentence": "　僧者最極尊於人天，　　諦美福第一無上田。",
        "translation": "The saṃgha is the most supremely honored among humans and gods, the highest field of truth and virtue.",
        "source": "T24n1464_003:0864a10_0"
    },
    {
        "source_sentence": "「阿難以此實義，於旃荼羅舍得解。」",
        "translation": "Ānanda, this is the true meaning of the teaching that he understands in caṇḍālaśa.",
        "source": "T24n1464_003:0864a11_0"
    },
    {
        "source_sentence": "誦偈適竟，旃荼羅家內所設呪具，刀箭碎折瓶甕破壞、燈滅髑髏迸碎、黑風起展轉不相見，",
        "translation": "When the recitation of the verse was over, the incantations were set up inside the caṇḍāla's house, with swords and arrows broken down, bottles and jars broken down, lamps destroyed, skulls burst into flames, black breezes rising and turning without seeing each other.",
        "source": "T24n1464_003:0864a11_1"
    },
    {
        "source_sentence": "旃荼羅呪術不行。",
        "translation": "The caṇḍāla spell doesn't work.",
        "source": "T24n1464_003:0864a13_2"
    },
    {
        "source_sentence": "母便告女：「此必瞿曇沙門神力所為，眾物碎散、呪術不行。」",
        "translation": "The mother then told her, This must be the result of the divine powers of the Gautama ascetic, for which all things are broken up and dispersed and the spells won't work.",
        "source": "T24n1464_003:0864a14_3"
    },
    {
        "source_sentence": "時阿難便作是念：「此將是世尊恩力。」",
        "translation": "Ānanda then had this thought, This will be the Bhagavān's kindness.",
        "source": "T24n1464_003:0864a15_4"
    },
    {
        "source_sentence": "時尊者阿難得解，譬如大象王盛年六十，醉暴凶惡身大牙長，從鐵靽得解，",
        "translation": "Venerable Ānanda then found it difficult to understand, analogous to a great elephant king in full bloom at the age of sixty years old with an intoxicated and terrifying body that had large tusks as long as [their] teeth, who could be liberated from an iron ball.",
        "source": "T24n1464_003:0864a16_5"
    },
    {
        "source_sentence": "從城走向空閑處。",
        "translation": "He walks from the city to a quiet place.",
        "source": "T24n1464_003:0864a18_6"
    },
    {
        "source_sentence": "阿難亦爾，乃尊誦佛語從旃荼羅舍得解，還向祇桓。",
        "translation": "Ānanda was also like this. Having recited the Buddha’s words, the venerable monk departed from Kaṇḍāraśalī to obtain his understanding and returned to Jeta’s quarters.",
        "source": "T24n1464_003:0864a18_7"
    },
    {
        "source_sentence": "時此女人逐阿難至祇桓門，並作是語：「阿難是我夫！",
        "translation": "The woman then followed Ānanda to the Jīvaka Gate and said, Ānanda is my husband!",
        "source": "T24n1464_003:0864a19_8"
    },
    {
        "source_sentence": "阿難是我夫！」",
        "translation": "Ānanda, this is my husband!",
        "source": "T24n1464_003:0864a20_9"
    },
    {
        "source_sentence": "如犢隨母不離須臾，時此女人逐阿難後不離須臾。",
        "translation": "It's like a Vātsī who follows his mother and doesn't leave for a moment, when this woman chases after Ānanda and doesn't leave for a moment.",
        "source": "T24n1464_003:0864a21_10"
    },
    {
        "source_sentence": "時尊者阿難往詣世尊所，頭面禮足具白世尊。",
        "translation": "Venerable Ānanda then went to the Bhagavān, bowed his head and feet, and told him everything.",
        "source": "T24n1464_003:0864a22_11"
    },
    {
        "source_sentence": "世尊告曰：「我於諸法中不見幻惑誑人如女人者，人亦復爾。",
        "translation": "The Bhagavān told them, Among all the teachings, I don't see people who are illusory and deceiving women like women, and so are people.",
        "source": "T24n1464_003:0864a23_12"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1464_003:0864a24_13"
    },
    {
        "source_sentence": "以其婬繫意故。",
        "translation": "It's because of their anger-binding thoughts.",
        "source": "T24n1464_003:0864a25_0"
    },
    {
        "source_sentence": "是故阿難！",
        "translation": "Therefore, Ānanda!",
        "source": "T24n1464_003:0864a25_1"
    },
    {
        "source_sentence": "當覺意方便，不為六欲所牽。」",
        "translation": "You should perceive the mind's skillful means and not be led by the six desires.",
        "source": "T24n1464_003:0864a25_2"
    },
    {
        "source_sentence": "時尊者阿難平旦著衣持鉢入舍衛分衛。",
        "translation": "At sunrise, Venerable Ānanda put on his robes, took his bowl, and entered Śrāvastī's quarters to guard.",
        "source": "T24n1464_003:0864a26_3"
    },
    {
        "source_sentence": "此女人亦逐其後，語諸長者：「阿難是我夫！",
        "translation": "The woman also followed him and said to the elders, Ānanda, this is my husband!",
        "source": "T24n1464_003:0864a27_4"
    },
    {
        "source_sentence": "阿難是我夫！」",
        "translation": "Ānanda, this is my husband!",
        "source": "T24n1464_003:0864a28_5"
    },
    {
        "source_sentence": "時阿難分衛竟還至佛所，前白佛言：「此女去處，語諸長者污染人，不審當何為？」",
        "translation": "Ānanda then returned to the Buddha after partially guarding it and said to him, This woman's place of departure told the elders to pollute people, not knowing what to do.",
        "source": "T24n1464_003:0864a28_6"
    },
    {
        "source_sentence": "世尊告曰：「汝往共語，如姊妹相向。",
        "translation": "The World-honored One said to them: Go and talk among yourselves together, just as sisters face one another.",
        "source": "T24n1464_003:0864b01_7"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1464_003:0864b01_8"
    },
    {
        "source_sentence": "此女人應當作比丘尼。」",
        "translation": "This woman should become a bhikṣuṇī.",
        "source": "T24n1464_003:0864b02_9"
    },
    {
        "source_sentence": "時此女人來到佛所，白世尊言：「願世尊還我沙門阿難，用作夫婿。」",
        "translation": "The woman then came to the Buddha and said to the Bhagavān, May the Bhagavān return to my ascetic Ānanda and make him my husband.",
        "source": "T24n1464_003:0864b02_10"
    },
    {
        "source_sentence": "世尊告曰：「若須阿難者，於我法中為比丘尼，當與汝阿難。」",
        "translation": "The Bhagavān told him, If you need Ānanda, become a bhikṣuṇī in my teaching and give it to you Ānanda.",
        "source": "T24n1464_003:0864b04_11"
    },
    {
        "source_sentence": "時此女人歡喜踊躍：「爾時世尊當為道。",
        "translation": "The woman then rejoiced and jumped, At that point, the Bhagavān will be the Way.",
        "source": "T24n1464_003:0864b05_12"
    },
    {
        "source_sentence": "世尊當為道。」",
        "translation": "Bhagavān, you will become the Way.",
        "source": "T24n1464_003:0864b06_13"
    },
    {
        "source_sentence": "如來世尊問：「有父母不？",
        "translation": "The Bhagavān asked, Do you have parents?",
        "source": "T24n1464_003:0864b06_14"
    },
    {
        "source_sentence": "辭父母未？」",
        "translation": "Have you abandoned your parents?",
        "source": "T24n1464_003:0864b07_15"
    },
    {
        "source_sentence": "女報：「有父母而未辭父母。」",
        "translation": "The woman replied, There are parents but they haven't left their parents.",
        "source": "T24n1464_003:0864b07_16"
    },
    {
        "source_sentence": "「汝往辭父母還。」",
        "translation": "“Go and leave your parents and return.”",
        "source": "T24n1464_003:0864b08_17"
    },
    {
        "source_sentence": "時此女人即從坐起，詣父母所，而以此事具白父母。",
        "translation": "The woman then got up from her seat, went to her parents, and reported this story to them.",
        "source": "T24n1464_003:0864b08_18"
    },
    {
        "source_sentence": "父母聞此語已，歡喜踊躍，本殖善根各應得道。",
        "translation": "When their parents heard these words, they rejoiced and jumped for joy. Each of them had planted good roots in the past to attain enlightenment.",
        "source": "T24n1464_003:0864b09_19"
    },
    {
        "source_sentence": "母告女：「欲為道者便為，我等亦欲共往見世尊。」",
        "translation": "The mother told her, If you want to do it for the sake of the path, then you'll do it; we also want to go together to see the Bhagavān.",
        "source": "T24n1464_003:0864b10_20"
    },
    {
        "source_sentence": "時父母及女往詣佛所，頭面禮足在一面住。",
        "translation": "Their parents and daughters then went to the Buddha, bowed their heads and feet, and stayed at one side.",
        "source": "T24n1464_003:0864b11_21"
    },
    {
        "source_sentence": "時世尊為此女故，廣與大眾說法。",
        "translation": "The Bhagavān then explained the teaching to the masses for the sake of this woman.",
        "source": "T24n1464_003:0864b12_22"
    },
    {
        "source_sentence": "無數方便現諸法義，柔濡義、檀義、尸義、天義、說婬不淨義、增長生根諸結義、出家義、諸道品義。",
        "translation": "Countless and skillful means show the meaning of the teachings, which are gentle, sandalwood, śīla, celestial, speaking crude and impure, growing the bonds that give rise to the faculties, leaving home, and the factors of the path.",
        "source": "T24n1464_003:0864b13_23"
    },
    {
        "source_sentence": "時世尊說四聖諦苦習盡道，時此女人即在坐上解四聖諦，父母得阿那含道，",
        "translation": "When the World-honored One had discoursed on the four noble truths of suffering, its arising and cessation (i.e., the path leading to nirvana), the woman then sat up and explained the four noble truths; her parents attained the anāgāmi-phala.",
        "source": "T24n1464_003:0864b15_24"
    },
    {
        "source_sentence": "女得須陀洹道。",
        "translation": "The woman attained the stream entry path.",
        "source": "T24n1464_003:0864b17_25"
    },
    {
        "source_sentence": "譬如純帛[疊*毛]衣易為作色，彼聞法亦爾。",
        "translation": "It's like a pure silk [tuft of *hair] cloth that's easy to make color for it, and so is hearing the teaching.",
        "source": "T24n1464_003:0864b17_26"
    },
    {
        "source_sentence": "時父母叉手白佛：「從今以往歸佛歸法歸眾，聽為優婆塞，盡命不殺歸命。」",
        "translation": "His parents then saluted him with their palms together and said to the Buddha, From now on, they'll return to the Buddha, the Dharma, and the congregation, listen as laymen, and for the rest of their lives they won't kill or take life.",
        "source": "T24n1464_003:0864b18_27"
    },
    {
        "source_sentence": "時鉢吉蹄女現世得果，頭面禮佛足叉手向佛，白世尊言：「所犯過者，",
        "translation": "The goddess Pāgṛdhrakūṭa attained the fruit in this world, bowed her head and feet at the Buddha’s feet, saluted him with palms joined, and said:",
        "source": "T24n1464_003:0864b20_28"
    },
    {
        "source_sentence": "世尊含容，願如來不尤責。",
        "translation": "Bhagavān, please let the Tathāgata not especially blame us.",
        "source": "T24n1464_003:0864b21_29"
    },
    {
        "source_sentence": "如小兒如癡、如無善，所向阿難作不善意，願恕聽入道為比丘尼，得依世尊修行梵行。」",
        "translation": "Like a small child who's deluded and unwholesome, he directs his attention to Ānanda with an unwholesome intention, may he or she forgive him or her for listening to the monks and nuns who enter the path and attain the religious practice of relying on the Bhagavān.",
        "source": "T24n1464_003:0864b22_30"
    },
    {
        "source_sentence": "時世尊告阿難：「汝往，阿難！",
        "translation": "The Bhagavān then addressed Ānanda, Go, Ānanda!",
        "source": "T24n1464_003:0864b24_31"
    },
    {
        "source_sentence": "將二比丘尼及此女人，往夏坐比丘尼所，摩訶鉢柘鉢提瞿曇彌。",
        "translation": "When the two bhikṣuṇīs and this woman were taking their summer retreat to sit with the bhikṣuṇīs, Mahāprajāpatī Gautamī.",
        "source": "T24n1464_003:0864b24_32"
    },
    {
        "source_sentence": "『世尊有教，以此女為道，授具足戒。』」",
        "translation": "'The Bhagavān has taught that this woman is the path and bestows the full set of precepts.'",
        "source": "T24n1464_003:0864b26_33"
    },
    {
        "source_sentence": "時阿難受此教已，將二比丘尼及此女人，往詣鉢柘鉢提瞿曇彌所：「世尊有教，",
        "translation": "After receiving this instruction, Ānanda led the two monks, nuns, and these women to Padmavṛṣabhadra’s presence. “O Bhagavat!",
        "source": "T24n1464_003:0864b27_34"
    },
    {
        "source_sentence": "使此女為道，授具足戒。」",
        "translation": "I'll cause this woman to follow the path and give her the full set of precepts.",
        "source": "T24n1464_003:0864b28_35"
    },
    {
        "source_sentence": "大愛道問阿難：「云何阿難！",
        "translation": "The great beloved path asked Ānanda, What's the matter, Ānanda?",
        "source": "T24n1464_003:0864b29_36"
    },
    {
        "source_sentence": "世尊許旃荼羅女為道耶？」",
        "translation": "Does the Bhagavān allow the caṇḍāla woman to be the Way?",
        "source": "T24n1464_003:0864c01_37"
    },
    {
        "source_sentence": "阿難報：「瞿曇彌！",
        "translation": "Ānanda replied, Gautama!",
        "source": "T24n1464_003:0864c01_38"
    },
    {
        "source_sentence": "此女人以得道果，何以不得為道？」",
        "translation": "Because this woman has attained the fruit of the path, why doesn't she attain it as the path?",
        "source": "T24n1464_003:0864c02_0"
    },
    {
        "source_sentence": "時大愛道即與剔髮為道，授具足戒，教威儀禮節，得八解脫禪、得阿羅漢道。",
        "translation": "The great beloved Way then gave him the path of hair shaving, bestowed the full set of precepts, taught his manner and etiquette, attained the eight liberating meditations, and attained the path of the arhat.",
        "source": "T24n1464_003:0864c02_1"
    },
    {
        "source_sentence": "時大愛道將此女人及五百比丘尼往詣佛所，頭面作禮在一面立。",
        "translation": "Mahāprajñāpāramitā then took this woman and five hundred bhikṣus and nuns to the Buddha, bowed their heads and faces, and stood to one side.",
        "source": "T24n1464_003:0864c04_2"
    },
    {
        "source_sentence": "時世尊觀鉢吉蹄女人意，語言：「汝今須阿難為夫不？」",
        "translation": "The Bhagavān then observed the mind of the woman Prabhākaramitra and said, Do you need Ānanda to be your husband now?",
        "source": "T24n1464_003:0864c06_3"
    },
    {
        "source_sentence": "時比丘尼慚愧羞恥，長跪白佛言：「尊者阿難是我兄，同一法、同一水乳。」",
        "translation": "The monks and nuns, shameful and embarrassed, knelt down and said to the Buddha, Venerable Ānanda is my brother, with the same dharma and the same water and milk.",
        "source": "T24n1464_003:0864c07_4"
    },
    {
        "source_sentence": "時阿難意懷狐疑：「我不犯僧伽婆施沙不？」",
        "translation": "Ānanda then harbored doubt in his mind, Isn't it a violation of the saṃghâvaśeṣa?",
        "source": "T24n1464_003:0864c08_5"
    },
    {
        "source_sentence": "即問諸比丘。",
        "translation": "He then asked the monks.",
        "source": "T24n1464_003:0864c09_6"
    },
    {
        "source_sentence": "諸比丘不知當云何答，往白世尊。",
        "translation": "The monks didn't know what to answer, so they went to the Bhagavān.",
        "source": "T24n1464_003:0864c10_7"
    },
    {
        "source_sentence": "世尊告曰：「阿難不犯罪，此乃摩鄧伽呪所惑。",
        "translation": "The Bhagavān told him, Ānanda doesn't commit crimes, but this is the mental disturbance caused by the mantra of Mātaṅga.",
        "source": "T24n1464_003:0864c10_8"
    },
    {
        "source_sentence": "若復當有被呪術者，彼亦無罪。」",
        "translation": "If someone else is subject to the spell, they won't be guilty either.",
        "source": "T24n1464_003:0864c11_9"
    },
    {
        "source_sentence": "鼻奈耶卷第三",
        "translation": "*Hinayana, vol. 3",
        "source": "T24n1464_003:0864c13_0"
    }
]