[
    {
        "source_sentence": "根本說一切有部毘奈耶雜事",
        "translation": "Mūlasarvâstivāda-vinaya miscellaneous matters",
        "source": "T24n1451_020:0297b09_0"
    },
    {
        "source_sentence": "卷第二十",
        "translation": "Volume 20",
        "source": "T24n1451_020:0297b10_0"
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yogâcārabhūmi in Sanskrit",
        "source": "T24n1451_020:0297b12_0"
    },
    {
        "source_sentence": "　猛獸筋不應、　　燈光及勇健、",
        "translation": "Fierce animal tendons shouldn't be allowed, flames and courageousness are not allowed,",
        "source": "T24n1451_020:0297b13_0"
    },
    {
        "source_sentence": "　馱娑度尼法、　　因許喬答彌。",
        "translation": "Dharmadatta's teaching of the Dharma and Indra's acceptance of Gautama.",
        "source": "T24n1451_020:0297b13_0"
    },
    {
        "source_sentence": "　尼不前長者、　　可與餘臥具、",
        "translation": "If a nun doesn't go before an elder, she can give him the rest of the bedding.",
        "source": "T24n1451_020:0297b13_0"
    },
    {
        "source_sentence": "　不合灒水污，　　第六總應知。",
        "translation": "The sixth, which does not adhere to the defilement of salty water, should be known in general.",
        "source": "T24n1451_020:0297b13_0"
    },
    {
        "source_sentence": "　猛獸筋皮綖、　　擁前復擁後、",
        "translation": "A fierce animal with tendons, skin, flesh, and bones Embraces the front and embraces the back.",
        "source": "T24n1451_020:0297b13_0"
    },
    {
        "source_sentence": "　兩角及尖頭，　　諸靴皆不合。",
        "translation": "Neither the two horns nor the pointed topknot fit, and neither did the shoes.",
        "source": "T24n1451_020:0297b13_0"
    },
    {
        "source_sentence": "第六門總攝頌曰：(此二頌攝至第三十一卷半)第六門第一子攝頌曰：緣在室羅伐城。",
        "translation": "The sixth section summarizes the verse, saying, These two verses are collected up to the thirty-first and a half volumes.) The first son of the sixth section summarizes the verse, saying, Conditions are in Śrāvastī.",
        "source": "T24n1451_020:0297b13_0"
    },
    {
        "source_sentence": "佛言：「苾芻不應用五猛獸皮有爪牙者，謂智象、智馬、師子、虎、豹。」",
        "translation": "The Buddha said, A monk who doesn't use the five fierce animal skins with claws and teeth is a wise elephant, a wise horse, a lion, a tiger, or a leopard.",
        "source": "T24n1451_020:0297b21_1"
    },
    {
        "source_sentence": "是時六眾用彼獸筋，還同有過，佛言：「不用此筋而縫鞋履。」",
        "translation": "The six members of the assembly then used that animal's tendon, and they all had the same mistake, and the Buddha said, Don't use this tendon to sew shoes and footwear.",
        "source": "T24n1451_020:0297b22_2"
    },
    {
        "source_sentence": "六眾便用皮綖，有過同前，復用其皮補鞋，佛言：「皆不合用。",
        "translation": "The six members of the assembly then used leather sandals, which had the same defects as the previous ones. Again, they replaced the shoes with leather sandals.",
        "source": "T24n1451_020:0297b24_3"
    },
    {
        "source_sentence": "如是應知履屨之屬，若擁前擁後、兩角尖頭，麻履諸靴皆不應著，皆越法罪。",
        "translation": "Thus, you should know that it's a violation of the Dharma if you embrace the front, embrace the back, or have two horns and pointed heads, and don't put on the sandals or shoes made of hemp.",
        "source": "T24n1451_020:0297b25_4"
    },
    {
        "source_sentence": "除兩三重革屣。」",
        "translation": "It's except for two or three pairs of leather sandals.",
        "source": "T24n1451_020:0297b27_5"
    },
    {
        "source_sentence": "　四大王初誕，　　光明普皆照；",
        "translation": "The first birth of the four great kings Is their light shining everywhere.",
        "source": "T24n1451_020:0297b27_6"
    },
    {
        "source_sentence": "　父母因斯事，　　各為立其名。",
        "translation": "Because of these things, the parents established their names for each other.",
        "source": "T24n1451_020:0297b27_6"
    },
    {
        "source_sentence": "(如斯之類西國人皆不著，若是外國寒鄉為活命因緣持心方用)內攝頌曰：爾時菩薩在覩史天宮，王舍城中有王名曰大蓮花，以法化世人民熾盛，安隱豐樂無諸盜賊。",
        "translation": "(Such kinds of people in the western countries don't cling to them, but if they live in a cold foreign land and maintain their minds only for the sake of living.) The inner verse says, At the time, the bodhisattva was staying at the palace of Kauśinagara in the city of Rājagṛha, where there was a king named Mahāprajñāpāramitā-puṇ",
        "source": "T24n1451_020:0297b27_6"
    },
    {
        "source_sentence": "室羅伐城王名梵授，唱誓尼城王名大輪，憍閃毘城王名百軍，此等四王皆是法王，以法化世廣說如餘。",
        "translation": "The king of Śrāvastī is called Brahmadatta; the king of Sāvatthī is called Maheśvara; the king of Kaśinagara is called Hundred armies; these four kings are all Dharma kings, teaching the world by means of the Dharma.",
        "source": "T24n1451_020:0297c04_7"
    },
    {
        "source_sentence": "是時菩薩於天宮上，以五種事觀察世間。",
        "translation": "At the time, the bodhisattva was observing the world in the celestial palace with five kinds of things.",
        "source": "T24n1451_020:0297c06_8"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T24n1451_020:0297c07_9"
    },
    {
        "source_sentence": "一、觀遠祖；",
        "translation": "The first is the contemplation of distant ancestors.",
        "source": "T24n1451_020:0297c07_10"
    },
    {
        "source_sentence": "二、觀時節；",
        "translation": "The second is observing the seasons and seasons.",
        "source": "T24n1451_020:0297c07_11"
    },
    {
        "source_sentence": "三、觀方國；",
        "translation": "The third is to contemplate all directions and lands.",
        "source": "T24n1451_020:0297c08_12"
    },
    {
        "source_sentence": "四、觀近族；",
        "translation": "The fourth is to contemplate all kinds of living beings.",
        "source": "T24n1451_020:0297c08_13"
    },
    {
        "source_sentence": "五、觀母氏。",
        "translation": "5. the Avalokitêśvara family.",
        "source": "T24n1451_020:0297c08_14"
    },
    {
        "source_sentence": "六欲諸天三淨母腹，摩耶夫人因寢夢見六牙白象來降腹中。",
        "translation": "In the womb of the three pure mothers of the gods of the six desires, Lady Māyā saw a white elephant with six tusks coming down from her bed in a dream while she was sleeping.",
        "source": "T24n1451_020:0297c08_15"
    },
    {
        "source_sentence": "于時大地六種震動，放大光明遍滿世界勝天光明，世界中間黑闇之處，日月不照悉皆明了，所有眾生皆得相見。",
        "translation": "The earth then shook in six ways, emanating a great ray of light that filled the world with the light of the supreme gods. In the middle of the world, where the sun and moon didn't shine, they all became clear to see each other, and all sentient beings were able to see each other.",
        "source": "T24n1451_020:0297c10_16"
    },
    {
        "source_sentence": "菩薩生時如下所說，四大國王皆誕太子，見大光明如鎔金色，各各自言：「由我生男威神力故，能令天地光曜希奇。」",
        "translation": "When the bodhisattva was born, as explained below, the four great kings of the four great kingdoms all gave birth to princes who saw a great radiance like molten gold and each said, It's because of the authoritative power of my birth as a man that I can cause heaven and earth to shine brilliantly and marvelously.",
        "source": "T24n1451_020:0297c12_17"
    },
    {
        "source_sentence": "各為立名用符靈瑞。",
        "translation": "Each one establishes their names for the purpose of using the talismans and spiritual auspiciousness.",
        "source": "T24n1451_020:0297c15_18"
    },
    {
        "source_sentence": "時大蓮花王告眾人曰：「我子生時如日光影，乾坤洞照勝妙希奇，應與我子名曰影勝(梵云頻毘娑羅)。」",
        "translation": "The great lotus king then told the crowd, When my son is born, he's like the shadow of the sun shining brightly, and heaven and earth are so marvelous and rare that they should give him to my son named Vaiśravaṇa (Sanskrit: Bimbisara).",
        "source": "T24n1451_020:0297c15_19"
    },
    {
        "source_sentence": "其梵授王告眾人曰：「我子生時，光明殊勝，普照世間，應與我子名曰勝光。」",
        "translation": "The Brahmadatta king told the crowd, When my son was born, his light was so brilliant that it shone everywhere in the world; he should give me a child named Vaiśravaṇa.",
        "source": "T24n1451_020:0297c18_20"
    },
    {
        "source_sentence": "其大輪王告眾人曰：「我子生時如大燈光遍皆明照，應與我子名曰燈光。」",
        "translation": "The great wheel-turning king told the crowd, When my child is born, it's like a great lamp that shines brightly everywhere, so you should give my child the name lamp.",
        "source": "T24n1451_020:0297c19_21"
    },
    {
        "source_sentence": "其百軍王告眾人曰：「我子生時光如日出無不明了，應與我子名曰出光。」",
        "translation": "The king of the one hundred armies told the crowd, My son's birth is like when the sun rises and there's nothing he doesn't know, so you should give my son the name Exiting Light.",
        "source": "T24n1451_020:0297c21_22"
    },
    {
        "source_sentence": "各各自謂子之功能，然並不知由菩薩力。",
        "translation": "Each of them claimed to be the son's ability, but they didn't know it was because of the bodhisattva's power.",
        "source": "T24n1451_020:0297c23_0"
    },
    {
        "source_sentence": "　腹中天守護，　　生已蹈蓮花，",
        "translation": "The goddess in the womb protects them, and after they're born, she walks like a lotus flower.",
        "source": "T24n1451_020:0297c24_0"
    },
    {
        "source_sentence": "　舉手獨稱尊，　　灌洗花衣落。",
        "translation": "He raised his hand to call himself the honored one and poured out a flower garment.",
        "source": "T24n1451_020:0297c24_0"
    },
    {
        "source_sentence": "內攝頌曰：爾時菩薩降母腹中，天帝釋主令四天子，各持器仗守護其母，勿令人及非人輒為損害。",
        "translation": "The inner verse says, At the time, the bodhisattva descended into his mother's womb, and Indra the lord of the gods ordered the four celestial sons to guard their mother with a container and a weapon, so that no one or non-people would harm her.",
        "source": "T24n1451_020:0297c24_0"
    },
    {
        "source_sentence": "菩薩處胎不為胎中血垢所污，譬如眾寶聚在一處不相霑污，菩薩在腹亦復如是。",
        "translation": "A bodhisattva in the womb isn't stained by blood and dirt in the womb, like a cluster of treasures in one place that aren't defiled by each other, so is the bodhisattva in his belly.",
        "source": "T24n1451_020:0297c29_0"
    },
    {
        "source_sentence": "又如清淨妙瑠璃寶置五彩上，明目之人分明見別，母觀腹內分明亦爾。",
        "translation": "It's also like placing a pure, marvelous lapis lazuli treasure on a five-colored surface that makes it clear to those with eyes that they see distinctly, and so does the mother look inside her belly clearly.",
        "source": "T24n1451_020:0298a01_1"
    },
    {
        "source_sentence": "母雖持胎身無勞倦，自然奉持五種學處，謂盡形壽不殺生、不偷盜、不邪婬、不妄語、不飲酒，於諸丈夫絕婬染意。",
        "translation": "Although the mother carried the embryo without weariness, she naturally maintained five kinds of training: not taking life for the rest of her life, not stealing, not engaging in sexual misconduct, not speaking falsehoods, not drinking alcohol, and stopping anger and defiled thoughts toward men.",
        "source": "T24n1451_020:0298a03_2"
    },
    {
        "source_sentence": "十月滿足往藍毘尼林攀無憂樹枝，暫時佇立便於右脇誕生菩薩。",
        "translation": "When the tenth month was over, he went to the Lumbinī grove and climbed a branch of the Aśoka tree, stood there for a while, and then the bodhisattva was born on his right side.",
        "source": "T24n1451_020:0298a06_3"
    },
    {
        "source_sentence": "爾時大地六種震動，放大光明與入胎無異。",
        "translation": "At the time, the earth shook in six ways, emanating great light that was no different from what it would have been if it had entered the womb.",
        "source": "T24n1451_020:0298a07_4"
    },
    {
        "source_sentence": "菩薩生時，帝釋親自手承置蓮花上，不假扶侍足蹈七花行七步已，遍觀四方手指上下作如是語：「此即是我最後生身，天上天下唯我獨尊。」",
        "translation": "When the bodhisattva was born, Indra himself put his hand on top of the lotus flower, walked seven steps without supporting his attendants' feet as he touched it, and looked around in all directions with his fingers up and down like this, saying, This is my last body to be born; I alone am the sole honored one in heaven and earth.",
        "source": "T24n1451_020:0298a08_5"
    },
    {
        "source_sentence": "梵王捧傘、天帝執拂，於虛空中龍王注水，一溫一冷灌浴菩薩。",
        "translation": "The Brahma king held an umbrella, the emperor held a whisk, and the dragon king poured water into the sky while the bodhisattva was bathing with warmth and coldness.",
        "source": "T24n1451_020:0298a11_6"
    },
    {
        "source_sentence": "初誕生時於其母前，自然井現香泉上涌隨意受用。",
        "translation": "When he was first born, he naturally appeared in front of his mother's well and went up to the fragrant fountain to enjoy it as he wished.",
        "source": "T24n1451_020:0298a13_7"
    },
    {
        "source_sentence": "又於空中諸天下散嗢鉢羅花、鉢頭摩花、拘勿頭花、奔陀利花，并餘種種奇妙香末，天妙音樂自然發響，天妙衣纓從空亂墜。",
        "translation": "Also, the heavenly flowers such as blue lotus flower, padma flower, kumuda flower, puṇḍarīka flower, and a variety of other wonderful fragrant powders rose up in the sky. The exquisitely beautiful celestial music naturally sounded, and the exquisitely clothed garments flew down from the sky in disarray.",
        "source": "T24n1451_020:0298a14_8"
    },
    {
        "source_sentence": "更有眾多奇妙靈瑞，如餘處說。",
        "translation": "There are also many other marvelous spiritual manifestations, as described elsewhere.",
        "source": "T24n1451_020:0298a17_9"
    },
    {
        "source_sentence": "　阿私多覩相，　　那剌陀勸師，",
        "translation": "Asita's debilitating characteristic, Nārada encouraged his teacher.",
        "source": "T24n1451_020:0298a18_0"
    },
    {
        "source_sentence": "　五百瑞現前，　　父王立三字。",
        "translation": "Five hundred omens appeared before him, and his father, the king, established three words.",
        "source": "T24n1451_020:0298a18_0"
    },
    {
        "source_sentence": "內攝頌曰：于時南方於大山中有古仙人名阿私多，善知世界成壞時節。",
        "translation": "An inner verse says, At the time, there was an an ancient sage named Asita in a great mountain in the south who well knew the time and seasons of the world's formation and disintegration.",
        "source": "T24n1451_020:0298a18_0"
    },
    {
        "source_sentence": "時有一人名那剌陀，聰明辯慧數來參謁，阿私多仙共論世間成壞之事。",
        "translation": "At the time, there was a man named Nārada, who was intelligent and eloquent, and he often came to see him. The sage Asita discussed worldly matters of formation and disintegration with him.",
        "source": "T24n1451_020:0298a22_1"
    },
    {
        "source_sentence": "「何故此光明，　　遍照猶如日，",
        "translation": "Why is this light shining everywhere like the sun?",
        "source": "T24n1451_020:0298a24_2"
    },
    {
        "source_sentence": "　充滿山林處，　　忽現此希奇？」",
        "translation": "Filling a place in a mountain forest, does this suddenly appear as rare?",
        "source": "T24n1451_020:0298a24_2"
    },
    {
        "source_sentence": "「若是日光便赫烈，　　今此涼冷現希奇；",
        "translation": "“If it is like this, the light of the sun would shine brightly. Now that it is cool and cool, how marvelous it is!",
        "source": "T24n1451_020:0298a24_2"
    },
    {
        "source_sentence": "　必是無上牟尼尊，　　初出母胎彰此瑞。",
        "translation": "It must be the unsurpassed honored sage Muni, who first emerged from his mother's womb to show this sign.",
        "source": "T24n1451_020:0298a24_2"
    },
    {
        "source_sentence": "　此是菩薩出胎相，　　光明清淨世希有；",
        "translation": "This is the enlightening being’s sign of emerging from the womb, Rarely seen in the world.",
        "source": "T24n1451_020:0298a24_2"
    },
    {
        "source_sentence": "　譬如金色滿十方，　　騰照三有皆明徹。」",
        "translation": "It's like a golden color that fills the ten directions, rising and illuminating the three existences clearly and thoroughly.",
        "source": "T24n1451_020:0298a24_2"
    },
    {
        "source_sentence": "聞已傷歎，即於仙處而為出家，後於異時共此仙人在石窟中，見光明照異相希奇，即說伽他問其師曰：仙人答曰：那剌陀白其師曰：「鄔波馱耶！",
        "translation": "After hearing this, he regretted it and left home at the ṛṣi's place. Later, on another occasion, he was staying with this ṛṣi in a rock cave when he saw that the light shone brilliantly and his strange appearance was so marvelous that he said to his teacher by saying, The ṛṣi answered, Nārada said to his teacher, Upāsaka!",
        "source": "T24n1451_020:0298a24_2"
    },
    {
        "source_sentence": "若如是者，今可共行往觀菩薩。」",
        "translation": "If that's the case, we can now practice together to go and observe the bodhisattva.",
        "source": "T24n1451_020:0298b05_3"
    },
    {
        "source_sentence": "師曰：「子今知不？",
        "translation": "The teacher said, Do you know now?",
        "source": "T24n1451_020:0298b06_4"
    },
    {
        "source_sentence": "菩提薩埵有大威神，無量諸天悉皆雲集，我等雖至頂謁無由，待入城中為立名已，如其重出我望逢迎。」",
        "translation": "Bodhisattva has a great majestic power, and measureless gods all gathered in clouds, even though we had no way to reach the top of our heads to meet him, so we waited until we entered the city to establish our names and were greeted as they came out.",
        "source": "T24n1451_020:0298b06_5"
    },
    {
        "source_sentence": "菩薩生時，闡鐸迦等五百侍者同時而生，闡稚迦等五百侍女亦同時而誕，上象、厩馬皆生五百，五百伏藏自然開發，隣國諸王皆奉信物。",
        "translation": "When the Bodhisattva was born, five hundred maidservants named Chandaka and other five hundred maidservants were born at the same time, five hundred maidservants named Chandaka and other five hundred maidservants named Chandika were born at the same time, five hundred elephants and stable horses all produced five hundred, five hundred treasure treasuries naturally developed spontaneously, and the kings of neighbor",
        "source": "T24n1451_020:0298b09_6"
    },
    {
        "source_sentence": "大臣見已白淨飯王曰：「大王！",
        "translation": "Seeing this, the minister said to King Jīvaka, Great king!",
        "source": "T24n1451_020:0298b12_7"
    },
    {
        "source_sentence": "今日國祚興隆，王子誕生嘉瑞咸應，五百侍男、五百侍女，上象、上馬各生五百，五百伏藏自然開現，諸國朝賓奇珍總集。」",
        "translation": "Today, the kingdom's throne is prosperous, and when the princes are born, good fortune arises; five hundred men and five hundred maidservants, five hundred elephants and five hundred horses each give birth to five hundred treasures that are naturally revealed, and all the court officials of the countries gather rare treasures.",
        "source": "T24n1451_020:0298b12_8"
    },
    {
        "source_sentence": "王聞告已心大欣躍，告大臣曰：「太子生後諸事皆成，宜與立字名一切事成(梵云薩娑頞他悉陀)。」",
        "translation": "After hearing the announcement, the king was overjoyed and told his ministers, The prince's business will be done after he's born, so it's better to give him the name established (Sanskrit: sattva).",
        "source": "T24n1451_020:0298b15_9"
    },
    {
        "source_sentence": "此是菩薩最初立字，號一切事成。",
        "translation": "This is the first word that the bodhisattva establishes, and it's called accomplished by all things.",
        "source": "T24n1451_020:0298b17_10"
    },
    {
        "source_sentence": "是時菩薩乘四寶輿，無量百千人天翊從入劫比羅城。",
        "translation": "The bodhisattva then rode a four-jeweled carriage, and measureless hundreds of thousands of gods and goddesses entered the city of Kapilavastu.",
        "source": "T24n1451_020:0298b18_11"
    },
    {
        "source_sentence": "諸釋迦子體懷憍慢立性多言，菩薩入城，皆悉默然，牟尼無語。",
        "translation": "The Śākyamuni's sons were conceited in essence and established their nature with much talk, and the bodhisattva entered the city, but they were all silent, and Muni didn't say anything.",
        "source": "T24n1451_020:0298b19_12"
    },
    {
        "source_sentence": "王見是已報諸臣曰：「諸釋迦子體懷傲慢立性多言，太子入城，皆悉默然。",
        "translation": "Seeing this, the king reported to his ministers, The princes of the Śākyas were conceited and arrogant in essence, and when they entered the city, they all remained silent.",
        "source": "T24n1451_020:0298b21_13"
    },
    {
        "source_sentence": "牟尼無語，應與太子名曰釋迦牟尼。」",
        "translation": "If the Muni has nothing to say, he should give it to the prince named Śākyamuni.",
        "source": "T24n1451_020:0298b22_14"
    },
    {
        "source_sentence": "此是菩薩第二立名。",
        "translation": "This is the second name established by the bodhisattva.",
        "source": "T24n1451_020:0298b23_15"
    },
    {
        "source_sentence": "時此城中有舊住藥叉名釋迦增長，時人敬重立廟祠祀，但是釋種生男女已，令淨澡浴抱至藥叉處而申敬禮。",
        "translation": "At the time, there was an old yakṣa named Śākyamuni who lived in this city and was venerated by the people of that time when they built a temple and shrine for him, but after the male and female members of the Śākya clan had been born, they were told to bathe, embraced, and bowed respectfully at the yakṣa's place.",
        "source": "T24n1451_020:0298b24_0"
    },
    {
        "source_sentence": "時淨飯王以上酥蜜滿太子口，告大臣曰：「可抱太子往禮藥叉。」",
        "translation": "King Śuddhodana then filled the prince's mouth with butter and honey and told the minister, You may embrace the prince and pay homage to Yakṣa.",
        "source": "T24n1451_020:0298b26_1"
    },
    {
        "source_sentence": "大臣抱至，時彼藥叉遙見太子即自現身，至菩薩所頂禮其足。",
        "translation": "When the ministers embraced him, the yakṣa saw the prince from a distance and manifested himself to the bodhisattva's feet.",
        "source": "T24n1451_020:0298b27_2"
    },
    {
        "source_sentence": "臣歸白王，王聞是已生希有心：「今我太子於天神中更為尊勝，應與立字名天中天。」",
        "translation": "The ministers returned to the king and said, Having heard this, the king had a rare thought, Now that my prince is even more honored among gods and goddesses, he should be given the name established as the god of gods.",
        "source": "T24n1451_020:0298b29_3"
    },
    {
        "source_sentence": "此是菩薩第三立名。",
        "translation": "This is the third name established by the bodhisattva.",
        "source": "T24n1451_020:0298c02_4"
    },
    {
        "source_sentence": "　付母養太子，　　令觀大人相；",
        "translation": "I entrusted it to my mother, the crown prince, To let him observe the marks of greatness.",
        "source": "T24n1451_020:0298c03_0"
    },
    {
        "source_sentence": "　阿私多遠至，　　親覩牟尼形。",
        "translation": "Asita came from a great distance And appeared in the form of Samantabhadra.",
        "source": "T24n1451_020:0298c03_0"
    },
    {
        "source_sentence": "內攝頌曰：爾時父王便以太子付諸養母，隨時澡浴乳哺飲食，常令安隱適悅身心。",
        "translation": "The internal collection of verses says, At the time, the father and king then entrusted the prince to his nursing mothers, bathing, feeding milk and feeding food at appropriate times, always making them peaceful and comfortable in body and mind.",
        "source": "T24n1451_020:0298c03_0"
    },
    {
        "source_sentence": "養母便以上妙塗香塗摩身體，具諸瓔珞授與父王。",
        "translation": "The nursing mother then rubbed her body with a wonderful scented ointment, and gave it to the father king with all the jewelry.",
        "source": "T24n1451_020:0298c07_1"
    },
    {
        "source_sentence": "王即抱持瞻視歡喜。",
        "translation": "The king then embraced it and looked at it with joy.",
        "source": "T24n1451_020:0298c08_2"
    },
    {
        "source_sentence": "即便總命諸婆羅門、國中所有解占相人知算計者令觀太子，告言：「君等宜可瞻察，我聞古仙作如是說：『具三十二大丈夫相者有其二事：若在家者當為輪王，普王四洲以法化世，七寶成就：所謂輪寶、象寶、馬寶、珠寶、女寶、主藏臣寶、主兵臣寶，千子具足，勇健忠良能伏怨敵，周圓海內無諸患惱，人民豐樂安隱而住。",
        "translation": "Even so, the king ordered all the brahmans and state officials who had knowledge of divination to calculate the number of thirty-two signs of greatness in the assembly to see the prince. They told him, “You should also pay close attention to this: I have heard the ancient sages say that those who possess the thirty-two marks of greatness are endowed with these two things:",
        "source": "T24n1451_020:0298c09_3"
    },
    {
        "source_sentence": "若出家者剃除鬚髮，服袈裟衣成等正覺，有大名稱充滿世間。』」",
        "translation": "If someone leaves home, shaves their hair and beard, puts on the reddish-brown robes, becomes perfectly enlightened, and has a great reputation that fills the world.'",
        "source": "T24n1451_020:0298c16_4"
    },
    {
        "source_sentence": "時諸相師聞王說已，悉共觀察咸白王曰：「誠如大王所說之事，三十二相若成就者，唯有二事謂輪王及佛，乃至有大名稱充滿世間。」",
        "translation": "After hearing the king's explanation, the soothsayers all observed it together and said to the king, It's true that if the thirty-two marks were accomplished as described by the great king, there would be only two things called wheel kings and buddhas, even those with great reputation filling the world.",
        "source": "T24n1451_020:0298c18_5"
    },
    {
        "source_sentence": "王復問曰：「其相云何？」",
        "translation": "The king again asked, What's the characteristic?",
        "source": "T24n1451_020:0298c21_6"
    },
    {
        "source_sentence": "時彼相師悉皆具答，一一別指三十二相，具有廣文(以共餘經及律論等，事無差別，故不煩譯)。",
        "translation": "Each one of these thirty-two distinctive characteristics has an extensive text (as common to other scriptures, vinaya, treatises, and so forth, because there are no distinctions in things, so they don't need to be translated).",
        "source": "T24n1451_020:0298c21_7"
    },
    {
        "source_sentence": "爾時阿私多仙人告那剌陀曰：「摩納婆！",
        "translation": "It was then that the sage Asita addressed Nārada, Manabha!",
        "source": "T24n1451_020:0298c24_0"
    },
    {
        "source_sentence": "比者菩薩已入城中立三名訖，我等宜往禮拜瞻顏。」",
        "translation": "After the bodhisattva has entered the city and established three names, we should go there to pay homage and look at him.",
        "source": "T24n1451_020:0298c24_1"
    },
    {
        "source_sentence": "各乘神通騰空而去，由彼菩薩威神之力，去劫比羅城可一驛許，遂失神通足步而去。",
        "translation": "Each of them ascended up into the air by their supernormal powers and departed. By the spiritual power of the bodhisattva’s authority, they left Kapilavastu on a journey of about one shilling from Kapilavastu; but as soon as they had lost their supernormal powers they flew away at once.",
        "source": "T24n1451_020:0298c26_2"
    },
    {
        "source_sentence": "既入城已到王門所，報門人曰：「汝去白王：『阿私多仙今至門首。』」",
        "translation": "After entering the city, he arrived at the king's gate and reported to the gatekeeper, saying, Go tell the king, 'The sage Asita is now at the entrance of the gate.'",
        "source": "T24n1451_020:0298c28_0"
    },
    {
        "source_sentence": "使去白王，王曰：「隨入。",
        "translation": "The envoy departed and reported to the king, who said, “Come along.",
        "source": "T24n1451_020:0298c29_1"
    },
    {
        "source_sentence": "誰遮大仙？」",
        "translation": "Who obscures the great sage?",
        "source": "T24n1451_020:0298c29_2"
    },
    {
        "source_sentence": "即詣王所。",
        "translation": "He went to the king's place.",
        "source": "T24n1451_020:0299a01_3"
    },
    {
        "source_sentence": "王見仙至，遙唱：「善來！",
        "translation": "Seeing the ṛṣi arriving, the king called out from a distance, Well come!",
        "source": "T24n1451_020:0299a01_4"
    },
    {
        "source_sentence": "奉吉祥事。」",
        "translation": "It's an auspicious service.",
        "source": "T24n1451_020:0299a01_5"
    },
    {
        "source_sentence": "為洗足已，妙師子座安置令坐，王禮足已白言：「大仙！",
        "translation": "After washing his feet, the marvelous lion's seat was placed and made to sit down, and after bowing his feet, the king said, Great sage!",
        "source": "T24n1451_020:0299a02_6"
    },
    {
        "source_sentence": "何事得來？」",
        "translation": "What is the thing that comes from it?",
        "source": "T24n1451_020:0299a03_7"
    },
    {
        "source_sentence": "「國主我今至，　　欲見王太子；",
        "translation": "When the sovereign of the kingdom approached me, I wished to see the prince.",
        "source": "T24n1451_020:0299a03_8"
    },
    {
        "source_sentence": "　瞻仰牟尼尊，　　導師中第一。」",
        "translation": "He venerates the Venerable Muni, the best of guides.",
        "source": "T24n1451_020:0299a03_8"
    },
    {
        "source_sentence": "仙說伽他曰：王言：「太子睡著。」",
        "translation": "The sage said to the king, saying, Prince, you're sleeping.",
        "source": "T24n1451_020:0299a03_8"
    },
    {
        "source_sentence": "答曰：「雖睡，我欲暫觀。」",
        "translation": "He replied, Even though I'm asleep, I want to look around for a while.",
        "source": "T24n1451_020:0299a06_9"
    },
    {
        "source_sentence": "王便抱現。",
        "translation": "The king then embraced it and showed it.",
        "source": "T24n1451_020:0299a06_10"
    },
    {
        "source_sentence": "「良馬不多睡，　　半夜暫時眠；",
        "translation": "Good horses don’t sleep much, sleeping for a little while in the middle of the night.",
        "source": "T24n1451_020:0299a07_11"
    },
    {
        "source_sentence": "　所為事未成，　　因何久安寢？」",
        "translation": "What's the reason for sleeping peacefully for a long time when the task hasn't been done?",
        "source": "T24n1451_020:0299a07_11"
    },
    {
        "source_sentence": "覩菩薩眼雙眸不合，仙既見已說伽他曰：仙復問曰：「諸占相人有何記說？」",
        "translation": "When the bodhisattva's eyes didn't fit together, the sage saw him and said to Kṣāṭa, The sage again asked, What do the people who divine signs say?",
        "source": "T24n1451_020:0299a07_11"
    },
    {
        "source_sentence": "王言：「大仙彼相者云：『當作輪王化四天下。』」",
        "translation": "The king said, That great sage says, 'That characteristic is to become a wheel-turning king who transforms the four worlds.'",
        "source": "T24n1451_020:0299a10_12"
    },
    {
        "source_sentence": "「相者語多謬，　　末劫無輪王；",
        "translation": "Characteristics are often said to be wrong, and there is no wheel king in the final eon.",
        "source": "T24n1451_020:0299a11_13"
    },
    {
        "source_sentence": "　有此勝福緣，　　斷惑當成佛。",
        "translation": "If there are these excellent causes of merit, cutting off mental disturbances will lead to becoming a buddha.",
        "source": "T24n1451_020:0299a11_13"
    },
    {
        "source_sentence": "　若是化四洲，　　輪王相非顯；",
        "translation": "If these are the four continents of apparitional beings, The characteristics of wheel-turning kings do not appear.",
        "source": "T24n1451_020:0299a11_13"
    },
    {
        "source_sentence": "　分明大師相，　　成佛定無疑。」",
        "translation": "They clearly show the characteristics of a great teacher, and there's no doubt about becoming a buddha.",
        "source": "T24n1451_020:0299a11_13"
    },
    {
        "source_sentence": "仙以伽他而答王曰：仙人遍觀見成佛相已，復更觀察久近當得無上甘露轉妙法輪？",
        "translation": "The sage answered the king with a verse, saying, After he pervasively observes the characteristics of becoming a buddha, how long will it be before he further observes that he'll attain the unsurpassed ambrosia of immortality to turn the wonderful Dharma wheel?",
        "source": "T24n1451_020:0299a11_13"
    },
    {
        "source_sentence": "遂見二十九年捨王城去，六年苦行當成正覺。",
        "translation": "He then saw that in the twenty-nineth year he left the royal city and spent six years practicing austerities before he became perfectly enlightened.",
        "source": "T24n1451_020:0299a18_14"
    },
    {
        "source_sentence": "復觀自身得幾時住？",
        "translation": "Again, how long does he observe the time of his own abiding?",
        "source": "T24n1451_020:0299a19_15"
    },
    {
        "source_sentence": "得見佛不？",
        "translation": "Will you see the Buddha?",
        "source": "T24n1451_020:0299a20_0"
    },
    {
        "source_sentence": "知不見佛，便生憂惱涕淚盈目。",
        "translation": "Knowing that they hadn't seen the Buddha, they become sad and weep with tears filling their eyes.",
        "source": "T24n1451_020:0299a20_1"
    },
    {
        "source_sentence": "「若男若女來觀者，　　咸悉歡喜遍身心；",
        "translation": "“All the men and women who come to this exposition Are all delighted, pervading their bodies and minds.",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "　仁今親覩相非常，　　何因泣涕盈雙目？",
        "translation": "Now that you're so unworthy, why are you weeping and tears filling your eyes?",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "　假使太子相非善，　　短壽多病不吉祥；",
        "translation": "Suppose the prince’s features aren’t good, And his short life span is accompanied by many illnesses and inauspicious signs.",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "　唯願大仙如實言，　　勿令我意增憂悴。」",
        "translation": "Please let the great sage speak as he really is, so that I won't be overcome by sorrow in my mind.",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "「假使霹靂從空下，　　可畏來臨太子身；",
        "translation": "Suppose a thunderbolt were to come down from the sky, Fearlessly approaching the prince’s body.",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "　此於無上牟尼尊，　　如毛髮許不能損。",
        "translation": "This is like a hair that can't be damaged by the unsurpassed venerable sage.",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "　假使烈火騰風焰，　　利劍如霜現在前；",
        "translation": "Suppose a blazing fire raises a flame of wind, And a sharp sword like frost appears before it.",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "　毒藥黑蛇一時來，　　至太子處皆銷散。",
        "translation": "The poisonous black snake came at once, and when it arrived at the prince's place, they all disappeared.",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "　我傷早死不見佛，　　流淚盈目難裁忍；",
        "translation": "My sorrow is that I died early and did not see the Buddha. With tears flowing down my eyes, it is difficult to bear it.",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "　棄無上法我前亡，　　未有事業能成就。",
        "translation": "Rejecting the unsurpassed dharma, I'll die before me, but there's nothing to accomplish.",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "　此有大福除眾惱，　　證甘露法為導師；",
        "translation": "This greatly blessed one removes all afflictions And realizes the teaching of immortality as his teacher.",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "　若能聞教如說行，　　咸歸寂滅無為處。」",
        "translation": "If they can hear the teaching as explained and practice it, they'll all return to the unconditioned place of cessation.",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "王見懷愁說頌問曰：仙人答曰：王聞太子證甘露法，默然無語。",
        "translation": "Seeing this, the king was grieved and asked in verse, The sage answered, When the king heard that the prince had realized the nectar of immortality, he remained silent and didn't say anything.",
        "source": "T24n1451_020:0299a20_2"
    },
    {
        "source_sentence": "凡諸世人皆為邪心之所擾亂，出言諂誑不能依實。",
        "translation": "Ordinary people are all disturbed by wrong thoughts, producing words that are flattering and can't rely on the truth.",
        "source": "T24n1451_020:0299b06_3"
    },
    {
        "source_sentence": "時彼仙人而告王曰：「比日大王每作是念：『何時得令阿私多仙，足步入城與我相見，及諸人眾致敬慇懃。』",
        "translation": "The sage then addressed the king, saying, Whenever King Bimbisāra had this thought, 'When did you get the ṛṣi Asita to enter the city with me on foot and meet him, and all the people paid respect to him?'",
        "source": "T24n1451_020:0299b07_4"
    },
    {
        "source_sentence": "我哀愍故徒行至此，今時事了將欲出城，可為掃除淨修郭邑。」",
        "translation": "I'm sorry to have come here, but now that my business is done and I'm about to leave the city, I can sweep and clean up the fortress.",
        "source": "T24n1451_020:0299b10_5"
    },
    {
        "source_sentence": "時淨飯王勅令諸臣嚴治道路，普告城邑皆共修營，巷陌康莊塗拭清淨，灑以栴檀香水、散以占博迦花，幢蓋陵空、香煙滿路，見者愛樂如歡喜園。",
        "translation": "The king of Jīvaka then ordered his ministers to strictly regulate the roads and told the cities to all prepare preparations for the journey. The street corners were well-maintained, coated and clean, sprinkled with sandalwood perfume and scattered with campaka flowers, covered with banners and canopies, filled with smoke and fragrance, filling the roads with incense and smoke",
        "source": "T24n1451_020:0299b11_6"
    },
    {
        "source_sentence": "復遣搖鈴遍皆宣告：「諸人當知，或先住城中，或他方新至，所有人眾皆悉存心，明日晨朝看大仙出。」",
        "translation": "Again, he sends a waving bell and announces it everywhere, All people should know that whether they've previously stayed in the city or have newly arrived from another place, all the people will keep their minds together and see the great sage emerging tomorrow morning.",
        "source": "T24n1451_020:0299b14_7"
    },
    {
        "source_sentence": "眾既聞已各至途中，瞻望仙人步出城闕，咸生希有悵望而歸。",
        "translation": "Having heard this, the monks and nuns each set out on their way to see the holy ones. Seeing the holy ones approaching them, they left the city and departed from the palace. All of them were disheartened and looked away in great wonder.",
        "source": "T24n1451_020:0299b17_8"
    },
    {
        "source_sentence": "時阿私多仙還向本山，繫心禪寂以智方便發起神通，報命將終遂便遇患，雖加藥餌瞬息無幾。",
        "translation": "The sage Asita then returned to his native mountain, concentrated his mind in meditation and quiescence, developed supernormal abilities with wisdom and skillful means, and when his retribution was about to end, he became ill, even though he added medicine and diet for a short while.",
        "source": "T24n1451_020:0299b18_9"
    },
    {
        "source_sentence": "時那剌陀來禮師足，白言：「大師！",
        "translation": "Nārada then came to the master's feet, bowed his head at his feet, and said, Master!",
        "source": "T24n1451_020:0299b20_10"
    },
    {
        "source_sentence": "我本出家求甘露味，師所得者幸願共分。」",
        "translation": "I originally left home to seek the taste of ambrosia, and it's fortunate that the teacher who obtains it will share it with me.",
        "source": "T24n1451_020:0299b21_11"
    },
    {
        "source_sentence": "師曰：「我亦同汝，本出家時意求甘露，竟無所獲空處生涯。",
        "translation": "The teacher said, I'm the same as you. When I originally left home, I intended to pursue immortality but didn't obtain an empty place for my life.",
        "source": "T24n1451_020:0299b22_12"
    },
    {
        "source_sentence": "彼雪山側劫比羅城，太子興世相師共記：當成正覺號天人師稱一切智。",
        "translation": "In the Kapilavastu city beside the snowy mountains, the prince raised his worldly teacher and shared a common record: He will become perfectly enlightened and be called the teacher of gods and humans who call him omniscience.",
        "source": "T24n1451_020:0299b23_13"
    },
    {
        "source_sentence": "汝當於彼而求出家，捨高慢心當自謙下，勤修梵行作不放逸，當於爾時獲甘露味。」",
        "translation": "You must seek to leave home there, abandon your conceit, humble yourself, diligently cultivate the religious practice, and don't be lazy; you'll attain the taste of ambrosia at that point.",
        "source": "T24n1451_020:0299b25_14"
    },
    {
        "source_sentence": "「如來出世難遭遇，　　今得逢時甚希有；",
        "translation": "“The Buddha has appeared in the world but is difficult to encounter. It is rare for him to be seen now.",
        "source": "T24n1451_020:0299b27_15"
    },
    {
        "source_sentence": "　汝莫放逸至心求，　　當獲無生甘露味。」",
        "translation": "Don't be careless and earnest, and you'll attain the taste of unborn ambrosia.",
        "source": "T24n1451_020:0299b27_15"
    },
    {
        "source_sentence": "說伽他曰：作是語已便即命終。",
        "translation": "He said to Kṣāṭa, After saying this, he'll die.",
        "source": "T24n1451_020:0299b27_15"
    },
    {
        "source_sentence": "「積聚皆銷散，　　崇高必墮落；",
        "translation": "The accumulation will all disperse, And the lofty one will surely fall.",
        "source": "T24n1451_020:0299c01_16"
    },
    {
        "source_sentence": "　合會皆別離，　　生者咸歸死。」",
        "translation": "They'll all be united and separated, and those who are born will all return to death.",
        "source": "T24n1451_020:0299c01_16"
    },
    {
        "source_sentence": "如有頌言：爾時阿私多仙命終之後，弟子那剌陀如法焚燒，殯葬事訖割捨憂慼，遂詣婆羅痆斯於諸仙內而共住止。",
        "translation": "As a verse says, When the sage Asita died, his disciple Nārada was burned and buried according to the rules, and after the funeral service ended, he cut off his grief and went to Vārāṇasī to live among the sages together with them.",
        "source": "T24n1451_020:0299c01_16"
    },
    {
        "source_sentence": "其那剌陀先是迦多演那種族，時人因號迦多演那仙人，眾皆敬重。",
        "translation": "That Nārada was formerly of the Kātyāyana family, and the people then called him the Kātyāyana sage, who was venerated by all the people.",
        "source": "T24n1451_020:0299c06_17"
    },
    {
        "source_sentence": "時嗢逝尼王所生太子名曰燈光，王付八母而為瞻養，是事無闕，乃至年漸長大技藝博通，文武所須無不綜習。",
        "translation": "The prince who was born to the king of Kaṇḍinī, named Dīpaṅkara, entrusted these eight mothers to him as his guardians. As he grew up, they were not lacking in such matters and learned in arts and crafts; they mastered all the teachings necessary for civil and military affairs.",
        "source": "T24n1451_020:0299c07_18"
    },
    {
        "source_sentence": "釋迦菩薩為童子戲，燈光太子亦為童戲。",
        "translation": "The Śākyamuni Bodhisattva is a children's play, and the prince Candraprabha is also a children's play.",
        "source": "T24n1451_020:0299c11_0"
    },
    {
        "source_sentence": "菩薩受太子灌頂時，燈光亦受太子灌頂。",
        "translation": "When the bodhisattva receives the prince's consecration, the lamp also receives the prince's consecration.",
        "source": "T24n1451_020:0299c11_1"
    },
    {
        "source_sentence": "菩薩出四門觀見老病死患，遂於三夫人處生厭離心，所謂牛護夫人、鹿養夫人、名稱夫人，此為上首六千婇女咸皆捨棄，於其中夜踰城而去。",
        "translation": "When the bodhisattva came out of the four gates and observed the danger of old age, illness, and death, he became disillusioned with the three wives, which were called the cow-protecting wife, the deer- nursing wife, and the famed wife.",
        "source": "T24n1451_020:0299c12_2"
    },
    {
        "source_sentence": "往空林所修出家業，依止仙人學殊勝定離欲界欲。",
        "translation": "He went to the forest of emptiness to cultivate his family business, relying on the saṃgha to train in superior concentration and part with the desires of the desire realm.",
        "source": "T24n1451_020:0299c16_3"
    },
    {
        "source_sentence": "次從曷羅摩子習無所有定，斷無所有處欲。",
        "translation": "Next, he cultivates the concentration of nothingness from the Kālāma child and stops the desire for the craving for the sphere of nothingness.",
        "source": "T24n1451_020:0299c17_4"
    },
    {
        "source_sentence": "更無導者，便於六年專修苦行，不別證悟將為無益。",
        "translation": "If there were no guide, it would be useless to focus on cultivating austerities for six years without realizing enlightenment separately.",
        "source": "T24n1451_020:0299c18_5"
    },
    {
        "source_sentence": "遂即住情而為遊縱，噉好飲食酥油塗身，湯水澡浴往聚落中，於難陀、難陀力二牧牛女所，食十六倍上妙乳糜。",
        "translation": "He then stayed in his emotions and went on a pleasure trip, coated his body with delicious food and drink, butter and oil, bathing himself in hot water and going to a village where he ate sixteen times as much marvelous milk gruel at the homes of Nanda and Nanda's two cowherding women.",
        "source": "T24n1451_020:0299c19_6"
    },
    {
        "source_sentence": "迦利迦龍王尊重讚歎，於善吉邊取吉祥草，詣菩提樹下自敷草已，端身正念加趺而坐，心念口言：「若不斷盡諸漏，我終不解加趺。」",
        "translation": "The dragon king Kālīyaka respected and praised him, took the auspicious grass at the side of Sunetra, went to the foot of the bodhi tree, spread it out for himself, sat upright with his body correctly cross-legged, and said, If I don't stop these contaminants, I won't be able to untie the cross-legged.",
        "source": "T24n1451_020:0299c22_7"
    },
    {
        "source_sentence": "是時菩薩以慈心器仗，降伏三十六億千魔眾已證無上智，受梵天請往婆羅痆斯三轉十二行法輪。",
        "translation": "At the time, the bodhisattva had subdued 3.6 billion Māras with the container of a compassionate mind, realized unsurpassed wisdom, and accepted the invitation from the Brahma gods to go to the thirty-two practices of the Dharma wheel in Vārāṇasī by Brahmā.",
        "source": "T24n1451_020:0299c25_8"
    },
    {
        "source_sentence": "時燈光王亦於此時，受灌頂大王位，以法教化，嗢逝尼國人民熾盛，安隱豐樂廣如餘說。",
        "translation": "At the time, King Dīpaṅkara also consecrated himself to the throne of great kingship and taught him the Dharma so that the people of Kaṅgālī would be prosperous and peaceful and happy, as explained in detail elsewhere.",
        "source": "T24n1451_020:0299c27_9"
    },
    {
        "source_sentence": "由王力故百姓歌謠，歡會相次隨處供養勝上天神，穿五百池五百渠水，令人受用無有闕乏。",
        "translation": "Because of the king's power, the people sang hymns of praise and assembled to make offerings to the superior celestial spirits in order, passing through five hundred ponds and five hundred streams of water so that they could enjoy them without lack.",
        "source": "T24n1451_020:0299c29_10"
    },
    {
        "source_sentence": "　燈光得為王，　　有五殊勝物；",
        "translation": "The lamp becomes king, and there are five extraordinary things.",
        "source": "T24n1451_020:0300a03_0"
    },
    {
        "source_sentence": "　因敘奇異事，　　廣說健陀羅。",
        "translation": "As a result, he described the marvelous things and explained them extensively to Gandhāra.",
        "source": "T24n1451_020:0300a03_0"
    },
    {
        "source_sentence": "第六門第二子攝頌曰：時燈光王有五勝物。",
        "translation": "The second son of the sixth aspect summarizes the verse, saying, At the time, there were five superior things for the king of the lamp.",
        "source": "T24n1451_020:0300a03_0"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T24n1451_020:0300a06_1"
    },
    {
        "source_sentence": "一者勝雄象名曰葦山；",
        "translation": "The first is called Reed Mountain because it overpowers the heroic elephant.",
        "source": "T24n1451_020:0300a06_2"
    },
    {
        "source_sentence": "二者勝母象名曰賢善；",
        "translation": "The second is the elephant named Goodness, which overpowers its mother.",
        "source": "T24n1451_020:0300a07_3"
    },
    {
        "source_sentence": "三者勝駝名曰海足；",
        "translation": "The third was a superior camels called the sea-legged.",
        "source": "T24n1451_020:0300a07_4"
    },
    {
        "source_sentence": "四者勝馬名曰衣頸；",
        "translation": "The fourth was a superior horse named Kanyakubja.",
        "source": "T24n1451_020:0300a08_5"
    },
    {
        "source_sentence": "五者勝使者名曰飛烏。",
        "translation": "Fifth, the superior messenger is called flying crow.",
        "source": "T24n1451_020:0300a08_6"
    },
    {
        "source_sentence": "其象日夜行一百驛，母象日夜行八十驛，駝日夜行七十驛，馬日夜行五十驛，飛烏日夜行二十五驛。",
        "translation": "The elephant traveled in one hundred carriages day and night; the mother elephant traveled in eighty carriages day and night; the camels traveled in seventy carriages day and night; the horses traveled in fifty carriages day and night; and the flying crows traveled in twenty-five carriages day and night.",
        "source": "T24n1451_020:0300a09_7"
    },
    {
        "source_sentence": "其王雖有如是勝物快樂安隱，然而四大不調忽有不睡之病，由此疾故於酥起憎、於酒生愛。",
        "translation": "Although the king had such a wonderful thing, happy and peaceful, the four major disorders suddenly became ill with an illness that didn't cause him to fall asleep, and because of this illness, hatred for butter and craving for wine arose.",
        "source": "T24n1451_020:0300a11_8"
    },
    {
        "source_sentence": "時諸醫人以種種妙藥，與酥和煎上王令服。",
        "translation": "The doctors then gave various wonderful medicines, mixed them with butter and decocted it for the king to take.",
        "source": "T24n1451_020:0300a13_9"
    },
    {
        "source_sentence": "王不肯用，時太子中宮咸知酥藥能治不睡，皆奉藥酥，王更憎睡。",
        "translation": "The king refused to use it, and the prince's palace knew that the antidote of butter could cure not falling asleep, so they all offered medicine and butter, and the king hated sleeping.",
        "source": "T24n1451_020:0300a14_10"
    },
    {
        "source_sentence": "王乃勅曰：「若有人當在我前說酥名者，當斬其頭。」",
        "translation": "The king then commanded, If someone were to explain the name of the butter in front of me, they'd beheaded.",
        "source": "T24n1451_020:0300a16_11"
    },
    {
        "source_sentence": "王既無睡，便於初夜與內宮人共為歡戲，於中夜時至象馬厩而為撿閱，於後夜時觀諸庫藏，自持利劍問守更人曰：「誰為警覺？」",
        "translation": "The king hadn't slept, so he went to the elephant-horse stable in the middle of the night with the palace staff to play and rejoice.",
        "source": "T24n1451_020:0300a17_12"
    },
    {
        "source_sentence": "若第一問及二問時，不應答者乍容忍恕，至第三問不相答者，便斬其首。",
        "translation": "If someone doesn't answer the first question or two questions at the time, they'll be allowed to tolerate it for a while and then beheaded if they don't answer the third question.",
        "source": "T24n1451_020:0300a20_13"
    },
    {
        "source_sentence": "由斯嚴酷隱燈光名，共安餘字號曰猛暴。",
        "translation": "Because of this, it's called the name of the lamp that's strictly and cruelly hidden, and shared with the rest of the word for peace is called fierce violence.",
        "source": "T24n1451_020:0300a21_14"
    },
    {
        "source_sentence": "燈光王於異時命大夫人及內宮曰：「我親警覺，爾何眠睡？」",
        "translation": "On another occasion, the king of the lamplight asked the great queen and the inner palace, I'm personally alerted, why are you sleeping?",
        "source": "T24n1451_020:0300a22_15"
    },
    {
        "source_sentence": "答言：「大王！",
        "translation": "He replied, Great king!",
        "source": "T24n1451_020:0300a24_16"
    },
    {
        "source_sentence": "我亦警覺。」",
        "translation": "I'm also alert.",
        "source": "T24n1451_020:0300a24_17"
    },
    {
        "source_sentence": "如是連宵不得眠睡，共白王曰：「若使我等通宵不睡者，是則無由稱可王意，又此不眠廢我等業。」",
        "translation": "Thus, for many nights, they couldn't sleep and said to the king together, If we didn't sleep all night long, then there wouldn't be a way to praise the king's intention, and this doesn't sleep that would dispel our actions.",
        "source": "T24n1451_020:0300a24_18"
    },
    {
        "source_sentence": "王曰：「若非爾業，誰復應為？」",
        "translation": "The king said, If that's not the case, who else would do it?",
        "source": "T24n1451_020:0300a26_19"
    },
    {
        "source_sentence": "答言：「太子應作。」",
        "translation": "He replied, The prince should do it.",
        "source": "T24n1451_020:0300a27_20"
    },
    {
        "source_sentence": "時王即便行告太子曰：「何不警覺？」",
        "translation": "The king then went on to the prince and told him, Why aren't you alert?",
        "source": "T24n1451_020:0300a27_21"
    },
    {
        "source_sentence": "答曰：「我為警覺。」",
        "translation": "He replied, I'm alert.",
        "source": "T24n1451_020:0300a28_22"
    },
    {
        "source_sentence": "後遂不能，便白王曰：「若常令我為警覺者，便廢王業，此非我事。」",
        "translation": "Later, he couldn't, so he said to the king, If you always make me alert, then you'll abandon the king's business; this isn't my business.",
        "source": "T24n1451_020:0300a28_23"
    },
    {
        "source_sentence": "王曰：「誰復應為？」",
        "translation": "The king said, Who should do it again?",
        "source": "T24n1451_020:0300b01_24"
    },
    {
        "source_sentence": "答言：「大臣應作。」",
        "translation": "He replied, The minister should do it.",
        "source": "T24n1451_020:0300b01_25"
    },
    {
        "source_sentence": "王即便行告大臣曰：「何不警覺？」",
        "translation": "The king then went on to the minister and said, Why aren't you alert?",
        "source": "T24n1451_020:0300b02_26"
    },
    {
        "source_sentence": "答曰：「我為警覺。」",
        "translation": "He replied, I'm alert.",
        "source": "T24n1451_020:0300b02_27"
    },
    {
        "source_sentence": "後遂不能，便白王曰：「若常令我為警覺者，誰輔佐王如法化世？",
        "translation": "When he was unable to do so, he said to the king, If you always cause me to be alert, who will assist the king in teaching the world according to the Dharma?",
        "source": "T24n1451_020:0300b03_28"
    },
    {
        "source_sentence": "此非我事。」",
        "translation": "This is not a matter for me.",
        "source": "T24n1451_020:0300b04_29"
    },
    {
        "source_sentence": "王曰：「誰復應為？」",
        "translation": "The king said, Who should do it again?",
        "source": "T24n1451_020:0300b04_30"
    },
    {
        "source_sentence": "答言：「散兵應作。」",
        "translation": "He replied, You should disperse your troops and do it.",
        "source": "T24n1451_020:0300b05_31"
    },
    {
        "source_sentence": "王即便行詣散兵所，告言：「我自警覺，汝等何因不為警覺？」",
        "translation": "The king then went to the place where the army was scattered and told them, I alerted myself, so why aren't you alerted?",
        "source": "T24n1451_020:0300b05_32"
    },
    {
        "source_sentence": "後遂不能，便白王曰：「若常令我為警覺者，如何為王共他交戰？",
        "translation": "Later, he couldn't, so he said to the king, If you always cause me to be alert, how can you fight with others for the king?",
        "source": "T24n1451_020:0300b06_33"
    },
    {
        "source_sentence": "此非我事。」",
        "translation": "This is not a matter for me.",
        "source": "T24n1451_020:0300b08_34"
    },
    {
        "source_sentence": "王曰：「誰復應為？」",
        "translation": "The king said, Who should do it again?",
        "source": "T24n1451_020:0300b08_35"
    },
    {
        "source_sentence": "答言：「百姓應作。」",
        "translation": "He replied, The people should do it.",
        "source": "T24n1451_020:0300b08_36"
    },
    {
        "source_sentence": "王即便行詣百姓所同前問答。",
        "translation": "The king then went to the crowd and asked the same questions as before.",
        "source": "T24n1451_020:0300b09_37"
    },
    {
        "source_sentence": "時彼國人番次守更而為警覺。",
        "translation": "The people of that country then guarded the night watchman in turn and became alert.",
        "source": "T24n1451_020:0300b09_38"
    },
    {
        "source_sentence": "時賣香童子當其番次，念：「王暴惡或當殺我。」",
        "translation": "The boy selling incense then took his seat and thought, Perhaps the king's violence will kill me.",
        "source": "T24n1451_020:0300b10_39"
    },
    {
        "source_sentence": "遂於夜中掌頰懷憂。",
        "translation": "In the middle of the night, he then put his palms and cheeks in distress.",
        "source": "T24n1451_020:0300b11_40"
    },
    {
        "source_sentence": "時彼知識見而問曰：「仁何故憂？」",
        "translation": "Seeing him, the monk asked, Why are you so sad?",
        "source": "T24n1451_020:0300b12_0"
    },
    {
        "source_sentence": "彼即以事具答知識。",
        "translation": "That's the knowledge that answers with a detailed explanation of things.",
        "source": "T24n1451_020:0300b12_1"
    },
    {
        "source_sentence": "彼便報白：「汝家不遠有人名曰健陀羅，何不相求為警覺事？」",
        "translation": "He then reported, Not far from your house, there's a man named Gandhāra whose name is Gandhāra, so why don't you seek each other for the sake of alertness?",
        "source": "T24n1451_020:0300b13_2"
    },
    {
        "source_sentence": "童子報曰：「如我惜命，彼寧肯為？",
        "translation": "The boy replied, Just as I cherish my life, why would they want to do it?",
        "source": "T24n1451_020:0300b14_3"
    },
    {
        "source_sentence": "設使見求，定不能作。」",
        "translation": "Suppose someone sees and asks, but they won't surely do it.",
        "source": "T24n1451_020:0300b15_4"
    },
    {
        "source_sentence": "告言：「與其錢物，必當為作。」",
        "translation": "He told them, Give them their money and property, and they'll surely do it for them.",
        "source": "T24n1451_020:0300b15_5"
    },
    {
        "source_sentence": "即往相求。",
        "translation": "That is, they'll go there to seek each other.",
        "source": "T24n1451_020:0300b16_6"
    },
    {
        "source_sentence": "彼人報曰：「若能與我五百金錢，我當為作。」",
        "translation": "The man replied, If you can give me five hundred coins, I will do it for you.",
        "source": "T24n1451_020:0300b16_7"
    },
    {
        "source_sentence": "即便許彼。",
        "translation": "He even agreed with them.",
        "source": "T24n1451_020:0300b17_8"
    },
    {
        "source_sentence": "健陀羅曰：「且當與半，若我命存，相還未晚。",
        "translation": "Gandhāra said, “You should give me half of it. If my life lasts, I shall return before too long.",
        "source": "T24n1451_020:0300b17_9"
    },
    {
        "source_sentence": "如其身死，此即屬君，隨情所用。」",
        "translation": "If his body dies, this belongs to you, use it as you like.",
        "source": "T24n1451_020:0300b18_10"
    },
    {
        "source_sentence": "即便與半。",
        "translation": "He even gave it to half of them.",
        "source": "T24n1451_020:0300b19_11"
    },
    {
        "source_sentence": "彼得錢已多買酒肉及諸餅果，王執杖人並皆命食咸令飽足，報諸人曰：「王令警覺，我當番次。」",
        "translation": "After Peter had bought a lot of money, he bought wine, meat, and cakes and fruits, and the king's staff and men ordered them to eat and make them all satisfied, and they reported to the people, alerting the king, I will be next in line.",
        "source": "T24n1451_020:0300b19_12"
    },
    {
        "source_sentence": "問諸人曰：「大王如何作警覺事。」",
        "translation": "He asked the people, How did the great king do the task of alertness?",
        "source": "T24n1451_020:0300b21_13"
    },
    {
        "source_sentence": "彼皆具報所有因緣。",
        "translation": "They are all endowed with the causes and conditions for retribution.",
        "source": "T24n1451_020:0300b22_14"
    },
    {
        "source_sentence": "健陀羅曰：「幸願君等為我思量。」",
        "translation": "Gandhāra said, May you consider it for me.",
        "source": "T24n1451_020:0300b23_0"
    },
    {
        "source_sentence": "答曰：「我等蒙君所賜美饍，在腹未消云何不為？」",
        "translation": "He answered, We've been given a delicious food by you, so why won't we do it if it doesn't go away in our belly?",
        "source": "T24n1451_020:0300b23_1"
    },
    {
        "source_sentence": "問曰：「我等為君欲作何事？」",
        "translation": "He asked, What do we want to do for you?",
        "source": "T24n1451_020:0300b24_2"
    },
    {
        "source_sentence": "答曰：「若王來問：『誰警覺？』",
        "translation": "He answered, Suppose the king comes and asks, 'Who's alert?'",
        "source": "T24n1451_020:0300b25_3"
    },
    {
        "source_sentence": "時，喚我令覺。」",
        "translation": "At the time, he summoned me to awaken.",
        "source": "T24n1451_020:0300b25_4"
    },
    {
        "source_sentence": "答言：「如是。」",
        "translation": "He replied, So it is.",
        "source": "T24n1451_020:0300b26_5"
    },
    {
        "source_sentence": "時健陀羅即於中夜，以毛毯縈膝坐而暫睡。",
        "translation": "During the middle of the night, Gandhāra sat cross-legged on a hairy blanket and fell asleep for a while.",
        "source": "T24n1451_020:0300b26_6"
    },
    {
        "source_sentence": "王於初夜與宮人戲笑，於中夜時觀諸象馬，便於後夜問守更人，諸人告曰：「健陀羅！",
        "translation": "On the first watch of the night, the king and his palace officials had amusement with each other. During the middle watch of the night, they observed the elephants and horses.",
        "source": "T24n1451_020:0300b27_7"
    },
    {
        "source_sentence": "汝覺勿睡，大王欲來。」",
        "translation": "wake up and don't sleep, for the great king wants to come.",
        "source": "T24n1451_020:0300b29_8"
    },
    {
        "source_sentence": "彼遂警覺，王便告曰：「警覺者誰？」",
        "translation": "He then alerted him, and the king told him, Who's alert?",
        "source": "T24n1451_020:0300b29_9"
    },
    {
        "source_sentence": "健陀羅聞作如是念：「我若初言，即為答者，後時不然，定當斬我頭落于地。」",
        "translation": "When Gandhāra heard this, he thought, If I first say that, it's an answer, and if I don't at some point later, I'll surely be cut off and dropped to the ground.",
        "source": "T24n1451_020:0300c01_10"
    },
    {
        "source_sentence": "即不言應。",
        "translation": "That is, it doesn't say'should.'",
        "source": "T24n1451_020:0300c03_11"
    },
    {
        "source_sentence": "王更喚之：「誰為警覺？」",
        "translation": "The king summoned him again, Who is alert?",
        "source": "T24n1451_020:0300c03_12"
    },
    {
        "source_sentence": "彼還默然。",
        "translation": "They remained silent.",
        "source": "T24n1451_020:0300c03_13"
    },
    {
        "source_sentence": "第三復命：「警覺者誰？」",
        "translation": "The third again ordered, Who's the alert one?",
        "source": "T24n1451_020:0300c04_14"
    },
    {
        "source_sentence": "答言：「大天！",
        "translation": "He replied, Great god!",
        "source": "T24n1451_020:0300c04_15"
    },
    {
        "source_sentence": "我是健陀羅。」",
        "translation": "I am Gandhāra.",
        "source": "T24n1451_020:0300c04_16"
    },
    {
        "source_sentence": "王曰：「健陀羅！",
        "translation": "The king said, Gandhāra!",
        "source": "T24n1451_020:0300c05_17"
    },
    {
        "source_sentence": "汝思何事？」",
        "translation": "What do you think?",
        "source": "T24n1451_020:0300c05_18"
    },
    {
        "source_sentence": "彼有智慧於世間事善能談說，答言：「大王！",
        "translation": "They had wisdom and good ability to talk about worldly affairs, and they replied, Great king!",
        "source": "T24n1451_020:0300c05_19"
    },
    {
        "source_sentence": "我思世事。」",
        "translation": "I'm thinking about worldly affairs.",
        "source": "T24n1451_020:0300c06_20"
    },
    {
        "source_sentence": "　鵂鶹鶴飲乳，　　芒草尾身齊，",
        "translation": "Lions and cranes drink milk; Their bodies are lined with hair, leaves, herbs, and plants.",
        "source": "T24n1451_020:0300c07_0"
    },
    {
        "source_sentence": "　斑駁與毛同，　　沙盆水不溢，",
        "translation": "The dazzling hair is the same as a hair, Yet not overflowing with sand or water.",
        "source": "T24n1451_020:0300c07_0"
    },
    {
        "source_sentence": "　鹽麨水差別，　　衣瓦變成塵，",
        "translation": "The difference between salt and salty water is that their clothes and tiles become dust.",
        "source": "T24n1451_020:0300c07_0"
    },
    {
        "source_sentence": "　是謂健陀羅，　　世間思十事。",
        "translation": "These are the ten things that Gandhāra thinks about in the world.",
        "source": "T24n1451_020:0300c07_0"
    },
    {
        "source_sentence": "內攝頌曰：王曰：「汝於世事何所思量？」",
        "translation": "An internal verse said, The king said, What do you think about worldly affairs?",
        "source": "T24n1451_020:0300c07_0"
    },
    {
        "source_sentence": "健陀羅曰：「世有奇事，且如鵂鶹鳥有毛無毛，以秤秤之輕重相似。」",
        "translation": "Gandhāra said, There's a rare thing in the world, such as a bird with hair and no hair that resembles a weighing scale.",
        "source": "T24n1451_020:0300c12_1"
    },
    {
        "source_sentence": "王曰：「此事實不？」",
        "translation": "The king said, Is this true?",
        "source": "T24n1451_020:0300c14_2"
    },
    {
        "source_sentence": "答言：「王當目驗。」",
        "translation": "He replied, The king will examine it with his eyes.",
        "source": "T24n1451_020:0300c14_3"
    },
    {
        "source_sentence": "王曰：「若然者善，我自親觀。」",
        "translation": "The king said, If that's the case, it's good; I myself will observe it.",
        "source": "T24n1451_020:0300c14_4"
    },
    {
        "source_sentence": "健陀羅至曉得鵂鶹鳥，對王秤看，後去其毛秤便相似，王曰：「此有何緣？」",
        "translation": "When he arrived at dawn, Gandhāra saw the bird and looked at the king's scale; after going away, it looked like a hair scale, and the king said, What's the reason for this?",
        "source": "T24n1451_020:0300c15_5"
    },
    {
        "source_sentence": "答曰：「由風扇羽。」",
        "translation": "He answered, It's because of the wind fan and feathers.",
        "source": "T24n1451_020:0300c17_0"
    },
    {
        "source_sentence": "王曰：「汝有妙智。」",
        "translation": "The king said, You have marvelous wisdom.",
        "source": "T24n1451_020:0300c17_1"
    },
    {
        "source_sentence": "答曰：「由王故然。」",
        "translation": "He answered, It's because of the king.",
        "source": "T24n1451_020:0300c17_2"
    },
    {
        "source_sentence": "王遂默然。",
        "translation": "The king then remained silent.",
        "source": "T24n1451_020:0300c18_3"
    },
    {
        "source_sentence": "時健陀羅愁過一宵，以手摩頭而還舊宅。",
        "translation": "After one night of sorrowfulness, Gandhāra touched his head with his hand and returned to his old house.",
        "source": "T24n1451_020:0300c18_4"
    },
    {
        "source_sentence": "時賣香童子，持餘半物還健陀羅，是時國中但當番次，皆以五百金錢雇健陀羅求其警覺，為知更次。",
        "translation": "The boy selling incense then returned the other half of his goods to Gandhāra, and when he returned it to Gandhāra, all the kingdoms of the country simply took their seats next to each other. They all hired Gandhāra for five hundred coins to ask him to alerten them so that they would know where to go.",
        "source": "T24n1451_020:0300c19_5"
    },
    {
        "source_sentence": "王於後夜問言：「誰覺？」",
        "translation": "On the latter night, the king asked, Who will awaken?",
        "source": "T24n1451_020:0300c21_6"
    },
    {
        "source_sentence": "答曰：「我健陀羅。」",
        "translation": "He replied, I am Gandhāra.",
        "source": "T24n1451_020:0300c22_7"
    },
    {
        "source_sentence": "王曰：「汝何所思？」",
        "translation": "The king said, What are you thinking?",
        "source": "T24n1451_020:0300c22_8"
    },
    {
        "source_sentence": "答言：「大王！",
        "translation": "He replied, Great king!",
        "source": "T24n1451_020:0300c22_9"
    },
    {
        "source_sentence": "我思世事。」",
        "translation": "I'm thinking about worldly affairs.",
        "source": "T24n1451_020:0300c23_0"
    },
    {
        "source_sentence": "王曰：「云何世事？」",
        "translation": "The king said, What are worldly affairs?",
        "source": "T24n1451_020:0300c23_1"
    },
    {
        "source_sentence": "答曰：「長項白鶴以水和乳令飲，但飲其乳，唯有水存。」",
        "translation": "He answered, A long-horned white crane mixes water with milk and causes it to drink, but when it drinks the milk, only water remains.",
        "source": "T24n1451_020:0300c23_2"
    },
    {
        "source_sentence": "王曰：「此事實不？」",
        "translation": "The king said, Is this true?",
        "source": "T24n1451_020:0300c24_3"
    },
    {
        "source_sentence": "答言：「王當目驗。」",
        "translation": "He replied, The king will examine it with his eyes.",
        "source": "T24n1451_020:0300c25_4"
    },
    {
        "source_sentence": "王曰：「若然者善。」",
        "translation": "The king said, If that's the case, it's good.",
        "source": "T24n1451_020:0300c25_5"
    },
    {
        "source_sentence": "至曉便將鶴鳥對王令飲，果如所言，王曰：「此有何緣？」",
        "translation": "When dawn came, he told the king to tell him to drink the cranes and birds, and the fruit was as he had said, and the king said, What's the reason for this?",
        "source": "T24n1451_020:0300c25_6"
    },
    {
        "source_sentence": "答曰：「鳥口性醋，若飲乳時遂便成酪，致令水在。」",
        "translation": "He answered, A bird's mouth is inherently vinegar; when it drinks milk, it then becomes cream and causes water to remain.",
        "source": "T24n1451_020:0300c27_7"
    },
    {
        "source_sentence": "王言：「汝有妙智。」",
        "translation": "The king said, You have marvelous wisdom.",
        "source": "T24n1451_020:0300c28_8"
    },
    {
        "source_sentence": "答曰：「由王故然。」",
        "translation": "He answered, It's because of the king.",
        "source": "T24n1451_020:0300c28_9"
    },
    {
        "source_sentence": "王遂默然。",
        "translation": "The king then remained silent.",
        "source": "T24n1451_020:0300c28_10"
    },
    {
        "source_sentence": "復於他夜王問：「誰為警覺？」",
        "translation": "Again, on another night, the king asked, Who is alert?",
        "source": "T24n1451_020:0300c29_11"
    },
    {
        "source_sentence": "如前答言：「我為警覺。」",
        "translation": "As before, he answered, I'm alert.",
        "source": "T24n1451_020:0300c29_12"
    },
    {
        "source_sentence": "王曰：「汝何所思？」",
        "translation": "The king said, What are you thinking?",
        "source": "T24n1451_020:0301a01_13"
    },
    {
        "source_sentence": "答言：「大王！",
        "translation": "He replied, Great king!",
        "source": "T24n1451_020:0301a01_14"
    },
    {
        "source_sentence": "我思世事。」",
        "translation": "I'm thinking about worldly affairs.",
        "source": "T24n1451_020:0301a01_15"
    },
    {
        "source_sentence": "王曰：「云何世事？」",
        "translation": "The king said, What are worldly affairs?",
        "source": "T24n1451_020:0301a01_16"
    },
    {
        "source_sentence": "答曰：「世有芒草以物椎打，與不椎者若以秤秤輕重相似，餘草不然。」",
        "translation": "He answered, In the world, there's a lump of grass that's beaten with an object and doesn't beat it, but if it's similar in weight to what's not beaten with a scale, the other grass isn't.",
        "source": "T24n1451_020:0301a02_17"
    },
    {
        "source_sentence": "王曰：「此事實不？」",
        "translation": "The king said, Is this true?",
        "source": "T24n1451_020:0301a03_18"
    },
    {
        "source_sentence": "答言：「王當目驗。」",
        "translation": "He replied, The king will examine it with his eyes.",
        "source": "T24n1451_020:0301a04_19"
    },
    {
        "source_sentence": "王曰：「若然者善。」",
        "translation": "The king said, If that's the case, it's good.",
        "source": "T24n1451_020:0301a04_20"
    },
    {
        "source_sentence": "至曉便將芒草對王椎打，便以秤秤果如所說。",
        "translation": "When dawn came, he struck the king with a hammer with his mango and then weighed the fruit as he had been told.",
        "source": "T24n1451_020:0301a04_21"
    },
    {
        "source_sentence": "王曰：「此有何緣？」",
        "translation": "The king said, What's the reason for this?",
        "source": "T24n1451_020:0301a06_0"
    },
    {
        "source_sentence": "答曰：「椎打之時便有風入。」",
        "translation": "He answered, When he strikes it with a hammer, a wind enters in.",
        "source": "T24n1451_020:0301a06_1"
    },
    {
        "source_sentence": "乃至王遂默然。",
        "translation": "The king then remained silent.",
        "source": "T24n1451_020:0301a06_2"
    },
    {
        "source_sentence": "復於他夜王復問言：「何人警覺？」",
        "translation": "Again, on another night, the king asked again, Who is alert?",
        "source": "T24n1451_020:0301a07_3"
    },
    {
        "source_sentence": "答曰：「我健陀羅。」",
        "translation": "He replied, I am Gandhāra.",
        "source": "T24n1451_020:0301a08_0"
    },
    {
        "source_sentence": "王曰：「汝何所思？」",
        "translation": "The king said, What are you thinking?",
        "source": "T24n1451_020:0301a08_1"
    },
    {
        "source_sentence": "答曰：「我思世事。」",
        "translation": "He answered, I'm thinking about worldly affairs.",
        "source": "T24n1451_020:0301a08_2"
    },
    {
        "source_sentence": "王曰：「云何世事？」",
        "translation": "The king said, What are worldly affairs?",
        "source": "T24n1451_020:0301a09_3"
    },
    {
        "source_sentence": "答曰：「有告靈鼠尾與身等。」",
        "translation": "He answered, There's an announcement that the tail of a spiritual rat and its body are the same.",
        "source": "T24n1451_020:0301a09_4"
    },
    {
        "source_sentence": "王曰：「此事實不？」",
        "translation": "The king said, Is this true?",
        "source": "T24n1451_020:0301a10_5"
    },
    {
        "source_sentence": "答言：「王當目驗。」",
        "translation": "He replied, The king will examine it with his eyes.",
        "source": "T24n1451_020:0301a10_6"
    },
    {
        "source_sentence": "王曰：「若然者善。」",
        "translation": "The king said, If that's the case, it's good.",
        "source": "T24n1451_020:0301a10_7"
    },
    {
        "source_sentence": "至曉便將鼠來對王比度，誠如所言，王曰：「此有何緣？」",
        "translation": "When dawn came, he brought the rat to the king to compare it with what he had said, saying, What's the reason for this?",
        "source": "T24n1451_020:0301a11_8"
    },
    {
        "source_sentence": "答曰：「我於春時見緣樹下尾與身齊。」",
        "translation": "He answered, In spring, I saw the tail at the foot of a tree with my body aligned under it.",
        "source": "T24n1451_020:0301a12_9"
    },
    {
        "source_sentence": "乃至王遂默然。",
        "translation": "The king then remained silent.",
        "source": "T24n1451_020:0301a13_10"
    },
    {
        "source_sentence": "復於他夜王復問言。",
        "translation": "Again, on another night, the king asked again.",
        "source": "T24n1451_020:0301a13_11"
    },
    {
        "source_sentence": "答曰：「我為警覺。」",
        "translation": "He replied, I'm alert.",
        "source": "T24n1451_020:0301a14_0"
    },
    {
        "source_sentence": "王曰：「汝何所思？」",
        "translation": "The king said, What are you thinking?",
        "source": "T24n1451_020:0301a14_1"
    },
    {
        "source_sentence": "答曰：「我思世事。」",
        "translation": "He answered, I'm thinking about worldly affairs.",
        "source": "T24n1451_020:0301a14_2"
    },
    {
        "source_sentence": "王曰：「云何世事？」",
        "translation": "The king said, What are worldly affairs?",
        "source": "T24n1451_020:0301a15_3"
    },
    {
        "source_sentence": "答曰：「大王！",
        "translation": "He replied, Great king!",
        "source": "T24n1451_020:0301a15_4"
    },
    {
        "source_sentence": "我思雉鳥，於其身上隨有斑駁，還有爾許莖毛仍除其尾。」",
        "translation": "I'm thinking of a pheasant bird whose body has spots on it, and there are some other stems and hair that have been removed from its tail.",
        "source": "T24n1451_020:0301a15_5"
    },
    {
        "source_sentence": "王曰：「此事實不？」",
        "translation": "The king said, Is this true?",
        "source": "T24n1451_020:0301a17_0"
    },
    {
        "source_sentence": "答言：「王當目驗。」",
        "translation": "He replied, The king will examine it with his eyes.",
        "source": "T24n1451_020:0301a17_1"
    },
    {
        "source_sentence": "王曰：「若然者善。」",
        "translation": "The king said, If that's the case, it's good.",
        "source": "T24n1451_020:0301a17_2"
    },
    {
        "source_sentence": "至曉即得一雉，對王果如所說。",
        "translation": "At dawn he found a pheasant and presented the royal fruit as described above.",
        "source": "T24n1451_020:0301a18_3"
    },
    {
        "source_sentence": "王曰：「汝何得知？」",
        "translation": "The king said, How do you know?",
        "source": "T24n1451_020:0301a18_4"
    },
    {
        "source_sentence": "答曰：「我先數知。」",
        "translation": "He answered, I've known it before.",
        "source": "T24n1451_020:0301a19_5"
    },
    {
        "source_sentence": "王曰：「汝有妙智。」",
        "translation": "The king said, You have marvelous wisdom.",
        "source": "T24n1451_020:0301a19_6"
    },
    {
        "source_sentence": "答言：「由王故然。」",
        "translation": "He replied, It's because of the king.",
        "source": "T24n1451_020:0301a19_7"
    },
    {
        "source_sentence": "王遂默然。",
        "translation": "The king then remained silent.",
        "source": "T24n1451_020:0301a20_8"
    },
    {
        "source_sentence": "又復問言：「何人警覺？」",
        "translation": "Again, he asked, Who is alert?",
        "source": "T24n1451_020:0301a20_9"
    },
    {
        "source_sentence": "答曰：「我健陀羅。」",
        "translation": "He replied, I am Gandhāra.",
        "source": "T24n1451_020:0301a21_0"
    },
    {
        "source_sentence": "王曰：「汝思何事？」",
        "translation": "The king said, What do you think?",
        "source": "T24n1451_020:0301a21_1"
    },
    {
        "source_sentence": "答言：「大王！",
        "translation": "He replied, Great king!",
        "source": "T24n1451_020:0301a21_2"
    },
    {
        "source_sentence": "如沙滿盆，還將盆水添滿不溢，沙水同處兩不相礙。」",
        "translation": "It's like filling a pot with sand and returning it to another pot full of water that doesn't overflow, where the sand and water in the same place don't obstruct each other.",
        "source": "T24n1451_020:0301a21_3"
    },
    {
        "source_sentence": "王曰：「此事實不？」",
        "translation": "The king said, Is this true?",
        "source": "T24n1451_020:0301a23_4"
    },
    {
        "source_sentence": "答言：「王當目驗。」",
        "translation": "He replied, The king will examine it with his eyes.",
        "source": "T24n1451_020:0301a23_5"
    },
    {
        "source_sentence": "至曉即以盆盛沙，瀉水令滿其水不溢，王遂默然。",
        "translation": "When dawn came, he filled the pot with sand and poured water to fill it so that the water wouldn't overflow. The king remained silent.",
        "source": "T24n1451_020:0301a23_6"
    },
    {
        "source_sentence": "又王問：「是誰警覺？」",
        "translation": "Again, the king asked, Who is alert?",
        "source": "T24n1451_020:0301a25_7"
    },
    {
        "source_sentence": "答言：「是我警覺。」",
        "translation": "He replied, It's my alertness.",
        "source": "T24n1451_020:0301a25_8"
    },
    {
        "source_sentence": "王復問言：「汝思何事？」",
        "translation": "The king again asked, What do you think?",
        "source": "T24n1451_020:0301a25_9"
    },
    {
        "source_sentence": "「我思世事。」",
        "translation": "I'm thinking about worldly affairs.",
        "source": "T24n1451_020:0301a26_10"
    },
    {
        "source_sentence": "「云何世事？」",
        "translation": "What are worldly affairs?",
        "source": "T24n1451_020:0301a26_11"
    },
    {
        "source_sentence": "「我思以鹽一升和一升水其水不增。」",
        "translation": "I thought that if I mixed one sheng of salt with one sheng of water, the water wouldn't increase.",
        "source": "T24n1451_020:0301a26_12"
    },
    {
        "source_sentence": "王曰：「此事實不？」",
        "translation": "The king said, Is this true?",
        "source": "T24n1451_020:0301a27_13"
    },
    {
        "source_sentence": "答言：「王當目驗。」",
        "translation": "He replied, The king will examine it with his eyes.",
        "source": "T24n1451_020:0301a28_14"
    },
    {
        "source_sentence": "至曉即以水和鹽，王親自試，王問：「何故？」",
        "translation": "When dawn came, he mixed water with salt and the king tested it himself, and the king asked, Why is that?",
        "source": "T24n1451_020:0301a28_15"
    },
    {
        "source_sentence": "答言：「鹽從水出，得水依舊。」",
        "translation": "He replied, The salt comes out of the water, and the water remains the same as before.",
        "source": "T24n1451_020:0301a29_16"
    },
    {
        "source_sentence": "王遂默然。",
        "translation": "The king then remained silent.",
        "source": "T24n1451_020:0301a29_17"
    },
    {
        "source_sentence": "王復問言：「何人警覺？」",
        "translation": "The king again asked, Who is alert?",
        "source": "T24n1451_020:0301b01_18"
    },
    {
        "source_sentence": "依前而答。",
        "translation": "Relying on the previous one, he answered.",
        "source": "T24n1451_020:0301b01_19"
    },
    {
        "source_sentence": "王曰：「汝思何事？」",
        "translation": "The king said, What do you think?",
        "source": "T24n1451_020:0301b01_20"
    },
    {
        "source_sentence": "答言：「我思世事。」",
        "translation": "He replied, I'm thinking about worldly affairs.",
        "source": "T24n1451_020:0301b02_21"
    },
    {
        "source_sentence": "王曰：「云何世事？」",
        "translation": "The king said, What are worldly affairs?",
        "source": "T24n1451_020:0301b02_22"
    },
    {
        "source_sentence": "答言：「我思以水一升和一升麨，揣不相著。」",
        "translation": "He replied, I'm thinking of using a sheng of water and a sheng of bread to make sure they aren't attached to each other.",
        "source": "T24n1451_020:0301b03_23"
    },
    {
        "source_sentence": "王曰：「此事實不？」",
        "translation": "The king said, Is this true?",
        "source": "T24n1451_020:0301b04_0"
    },
    {
        "source_sentence": "答言：「王當目驗。」",
        "translation": "He replied, The king will examine it with his eyes.",
        "source": "T24n1451_020:0301b04_1"
    },
    {
        "source_sentence": "至曉取水及麨對王和試。",
        "translation": "At dawn, he took the water and a bowl of rice and presented it to the king to reconcile with him.",
        "source": "T24n1451_020:0301b04_2"
    },
    {
        "source_sentence": "王問：「何故？」",
        "translation": "The king asked, Why is that?",
        "source": "T24n1451_020:0301b05_3"
    },
    {
        "source_sentence": "答曰：「我本國人並多食麨，常見如此。」",
        "translation": "He answered, The people of my native land often eat rice and see it like this.",
        "source": "T24n1451_020:0301b05_4"
    },
    {
        "source_sentence": "王云：「汝能記事。」",
        "translation": "The king said, You can write it.",
        "source": "T24n1451_020:0301b06_5"
    },
    {
        "source_sentence": "答言：「是大王力。」",
        "translation": "He replied, It's the great king's power.",
        "source": "T24n1451_020:0301b06_6"
    },
    {
        "source_sentence": "王遂默然。",
        "translation": "The king then remained silent.",
        "source": "T24n1451_020:0301b07_7"
    },
    {
        "source_sentence": "王復問言：「何人警覺？」",
        "translation": "The king again asked, Who is alert?",
        "source": "T24n1451_020:0301b07_8"
    },
    {
        "source_sentence": "同前問答，乃至「云何世事？」",
        "translation": "It's the same as the previous question and answer, up to What are worldly affairs?",
        "source": "T24n1451_020:0301b07_9"
    },
    {
        "source_sentence": "答曰：「我見世人常於日夜機柕織功，所出絹布綺繡之屬不知何去？」",
        "translation": "He answered, I've seen people always weave and weave with skillful means day and night, and I don't know where the silk cloth and fine embroidered silk that comes from them will go.",
        "source": "T24n1451_020:0301b08_10"
    },
    {
        "source_sentence": "王曰：「我亦不知，此物何去？」",
        "translation": "The king said, I don't know either; where is this thing going?",
        "source": "T24n1451_020:0301b09_11"
    },
    {
        "source_sentence": "健陀羅曰：「此等諸物終歸為土。」",
        "translation": "Gandhāra said, These things ultimately return to the land.",
        "source": "T24n1451_020:0301b10_12"
    },
    {
        "source_sentence": "王曰：「誠如汝說終歸為土。」",
        "translation": "The king said, It's really as you say, ultimately returning to the land.",
        "source": "T24n1451_020:0301b11_13"
    },
    {
        "source_sentence": "王復問言：「何人警覺？」",
        "translation": "The king again asked, Who is alert?",
        "source": "T24n1451_020:0301b11_14"
    },
    {
        "source_sentence": "同前問答。",
        "translation": "It's the same as the previous question and answer.",
        "source": "T24n1451_020:0301b12_15"
    },
    {
        "source_sentence": "乃至「云何世事？」",
        "translation": "It goes so far as to say, What are worldly affairs?",
        "source": "T24n1451_020:0301b12_16"
    },
    {
        "source_sentence": "答曰：「我見世間諸陶師等，日夜不住多作瓦器，不知此物向何處去？」",
        "translation": "He answered, I've seen that the potter masters of the world don't abide day and night, often making tile vessels, and they don't know where this thing is going.",
        "source": "T24n1451_020:0301b12_17"
    },
    {
        "source_sentence": "時王答言：「我亦不知向何處去！」",
        "translation": "The king then replied, I don't know where to go either!",
        "source": "T24n1451_020:0301b14_18"
    },
    {
        "source_sentence": "健陀羅曰：「此等諸物化為泥土。」",
        "translation": "Gandhāra said, These things are transformed into mud.",
        "source": "T24n1451_020:0301b15_19"
    },
    {
        "source_sentence": "王言：「如汝所說爛為泥土。」",
        "translation": "The king said, As you say, it's rotten into mud.",
        "source": "T24n1451_020:0301b15_20"
    },
    {
        "source_sentence": "　猛光親問母，　　知從蠍所生；",
        "translation": "Guṇaprabha asked his mother directly, Knowing that he had been born from a scorpion.",
        "source": "T24n1451_020:0301b17_0"
    },
    {
        "source_sentence": "　與彼五百金，　　驅之令出國。",
        "translation": "Give him five hundred pieces of gold and drive him out of the country.",
        "source": "T24n1451_020:0301b17_0"
    },
    {
        "source_sentence": "內攝頌曰：爾時大王既見健陀羅，多有情智應答巧便，即更問曰：「汝多智慧，能了世間種種事業，我不能睡此有何因？」",
        "translation": "The inner verse said, When the great king saw Gandhāra, many sentient beings with wisdom answered skillfully and asked again, You're so wise that you can comprehend all kinds of worldly works; what's the reason I can't sleep here?",
        "source": "T24n1451_020:0301b17_0"
    },
    {
        "source_sentence": "健陀羅曰：「唯願大王！",
        "translation": "Gandhāra said, Please, great king!",
        "source": "T24n1451_020:0301b22_1"
    },
    {
        "source_sentence": "寬其罪、賜無畏，敢為王說。」",
        "translation": "They'll be excused their sins and given fearlessness, and they'll dare to explain it for the king.",
        "source": "T24n1451_020:0301b22_2"
    },
    {
        "source_sentence": "王曰：「賜汝無畏，隨意說之。」",
        "translation": "The king said, Give you fearlessness, explain it as you wish.",
        "source": "T24n1451_020:0301b23_3"
    },
    {
        "source_sentence": "時健陀羅即白王曰：「王從蠍生。」",
        "translation": "Gandhāra then said to the king, The king was born from a scorpion.",
        "source": "T24n1451_020:0301b24_4"
    },
    {
        "source_sentence": "王曰：「汝今罵我。」",
        "translation": "The king said, Now, you're scolding me.",
        "source": "T24n1451_020:0301b24_5"
    },
    {
        "source_sentence": "健陀羅曰：「王令實說豈敢相罵，如其不信待至明旦王自驗知。」",
        "translation": "Gandhāra said, How dare you criticize each other if they don't believe in the king's true teaching and wait until tomorrow morning to know it for themselves?",
        "source": "T24n1451_020:0301b25_6"
    },
    {
        "source_sentence": "王報言：「好。」",
        "translation": "The king replied, Good.",
        "source": "T24n1451_020:0301b26_7"
    },
    {
        "source_sentence": "至天明已，時健陀羅掘地作坑，滿填牛糞上安敷具，令王臥息，即便得睡。",
        "translation": "When dawn came, he dug a pit on the ground in Gandhāra and filled it with cow dung to lay out provisions so that the king would be able to lie down and sleep.",
        "source": "T24n1451_020:0301b26_8"
    },
    {
        "source_sentence": "王自證知，尚疑虛實，遂入宮中問其母曰：「我今有事要須問知，當可實說我從何生？」",
        "translation": "Knowing for himself that he still doubted the truth, the king went into the palace and asked his mother, Now, there's something I must ask to know, so can I really tell you where I was born?",
        "source": "T24n1451_020:0301b28_9"
    },
    {
        "source_sentence": "母曰：「大王！",
        "translation": "His mother said, Great king!",
        "source": "T24n1451_020:0301c01_10"
    },
    {
        "source_sentence": "今可與我無畏，我當為說。」",
        "translation": "Now, you can give me fearlessness, and I will explain it for you.",
        "source": "T24n1451_020:0301c01_11"
    },
    {
        "source_sentence": "王言：「與母無畏。」",
        "translation": "The king said, Be fearless with your mother.",
        "source": "T24n1451_020:0301c02_12"
    },
    {
        "source_sentence": "即便報曰：「汝昔父王多諸婇女，因行他國綿歷歲時，我起欲心忽見一蠍，作如是念：『此是丈夫，我共行欲可不樂乎！』",
        "translation": "He even replied, Your father and king had many court ladies in the past, and when he was traveling to another country for years, I suddenly saw a scorpion with desire and thought, 'This is a man; isn't it pleasant for me to share my desires?'",
        "source": "T24n1451_020:0301c02_13"
    },
    {
        "source_sentence": "於時彼蠍變成男子，與我交通，便覺有娠，因茲生汝。」",
        "translation": "That scorpion then became a man and communicated with me, and he realized that she was pregnant; as a result, you were born.",
        "source": "T24n1451_020:0301c05_14"
    },
    {
        "source_sentence": "王既聞已作如是念：「彼健陀羅有大明慧，能知我本從蠍所生。",
        "translation": "After hearing this, the king had this thought, That gandharva has great insight and wisdom that can know that I was originally born from a scorpion.",
        "source": "T24n1451_020:0301c06_15"
    },
    {
        "source_sentence": "我施無畏不可刑戮，今者應可重與賞賜，令其出國勿使眾人知如是事。」",
        "translation": "I give it without fear and can't be tortured or killed, so now I should again reward him with a reward and cause him to leave the country so that people won't know such things.",
        "source": "T24n1451_020:0301c07_16"
    },
    {
        "source_sentence": "遂即賜與健陀羅五百金錢令其出國。",
        "translation": "He then gave him five hundred coins to Gandhāra and allowed him to leave the country.",
        "source": "T24n1451_020:0301c09_17"
    },
    {
        "source_sentence": "根本說一切有部毘奈耶雜事卷第二十",
        "translation": "Mūlasarvâstivāda-vinaya miscellaneous works of the Sarvâstivāda school, vol. 20",
        "source": "T24n1451_020:0301c11_0"
    }
]