[
    {
        "source_sentence": "善見律毘婆沙序品第一",
        "translation": "The First Chapter of the Preface to the Good Vision Vinaya, Vibhāṣā",
        "source": "T24n1462_001:0673b03_0"
    },
    {
        "source_sentence": "簫齊外國三藏僧伽跋陀羅譯",
        "translation": "Xuqi's translation of the foreign translation of the Tripiṭaka Saṃghâvardhana",
        "source": "T24n1462_001:0673b05_0"
    },
    {
        "source_sentence": "南無諸佛",
        "translation": "to praise the buddhas",
        "source": "T24n1462_001:0673b06_0"
    },
    {
        "source_sentence": "　若人百億劫，　　不可思議時，",
        "translation": "If a person spends ten billion eons, At an inconceivable time,",
        "source": "T24n1462_001:0673b07_0"
    },
    {
        "source_sentence": "　為一切眾生，　　往至疲倦處，",
        "translation": "For the sake of all sentient beings, I go to a place where they're weary.",
        "source": "T24n1462_001:0673b08_0"
    },
    {
        "source_sentence": "　正為世間故，　　南無大慈悲。",
        "translation": "It's precisely for the sake of the world that there's no great compassion in the south.",
        "source": "T24n1462_001:0673b09_0"
    },
    {
        "source_sentence": "　由法難知故，　　從生生世間，",
        "translation": "Because the dharmas are difficult to know, they arise from birth in the world.",
        "source": "T24n1462_001:0673b10_0"
    },
    {
        "source_sentence": "　稽首頭頂禮，　　甚深微妙法。",
        "translation": "He bowed his head at the top of his head and paid homage to the profound and subtle Dharma.",
        "source": "T24n1462_001:0673b11_0"
    },
    {
        "source_sentence": "　破裂壞消盡，　　無明煩惱網，",
        "translation": "breaks up, disintegrates, disappears, and ends the web of afflictions of ignorance.",
        "source": "T24n1462_001:0673b12_0"
    },
    {
        "source_sentence": "　若戒定智慧，　　解脫具足行。",
        "translation": "If he observes precepts, concentration, wisdom, and liberation, he'll be fully endowed with practice.",
        "source": "T24n1462_001:0673b13_0"
    },
    {
        "source_sentence": "　懃修功德者，　　眾僧良福田，",
        "translation": "Those who diligently cultivate virtue, the saṃgha is a good field of blessings.",
        "source": "T24n1462_001:0673b14_0"
    },
    {
        "source_sentence": "　我今一心歸，　　頭面稽首禮。",
        "translation": "I now return with one mind, bowing my head and face in homage.",
        "source": "T24n1462_001:0673b15_0"
    },
    {
        "source_sentence": "　歸命三寶竟，　　至演毘尼義，",
        "translation": "After taking refuge in the Three Treasures, I'll explain the meaning of the Vinaya.",
        "source": "T24n1462_001:0673b16_0"
    },
    {
        "source_sentence": "　令正法久住，　　利益饒眾生。",
        "translation": "They cause the right teaching to abide for a long time, benefiting sentient beings.",
        "source": "T24n1462_001:0673b17_0"
    },
    {
        "source_sentence": "　以此功德願，　　消除諸惡患，",
        "translation": "Because of these virtuous vows, They will remove all the evil afflictions.",
        "source": "T24n1462_001:0673b18_0"
    },
    {
        "source_sentence": "　若樂持戒者，　　持戒離眾苦。",
        "translation": "If someone delights in observing precepts, they observe precepts and are free of suffering.",
        "source": "T24n1462_001:0673b19_0"
    },
    {
        "source_sentence": "說曰：「律本初說，爾時，佛在毘蘭若，優波離為說之首，時集五百大比丘眾。",
        "translation": "He said, At the time when the text of the Vinaya was first taught, the Buddha was in Vaiśravaṇa, with Upāli as the speaker and five hundred great monks assembled.",
        "source": "T24n1462_001:0673b20_0"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1462_001:0673b21_1"
    },
    {
        "source_sentence": "如來初成道，於鹿野苑轉四諦法輪，最後說法度須跋陀羅，所應作者已訖，於俱尸那末羅王林娑羅雙樹間，二月十五日平旦時入無餘涅槃。",
        "translation": "When the Tathāgata first achieved enlightenment, he turned the wheel of the Dharma of the four truths in Deer Preserve and finally taught the Dharma for the salvation of Subhadra. Having completed what should be done, he entered nirvana without remainder at dawn on the fifteenth day of the second month among the two śāla trees in the royal forest of Kuśinagara.",
        "source": "T24n1462_001:0673b21_2"
    },
    {
        "source_sentence": "七日後迦葉從葉波國來，與五百比丘僧，往俱尸那國，問訊世尊。",
        "translation": "Seven days later Kāśyapa came from Yepo and, accompanied by five hundred monks and nuns, went to the country of Kusinagara to pay his respects to the World-honored One.",
        "source": "T24n1462_001:0673b25_3"
    },
    {
        "source_sentence": "路逢一道士，迦葉問曰：『見我師不？』",
        "translation": "When he met a fellow practitioner on the road, Kāśyapa asked, 'Do you see my teacher?'",
        "source": "T24n1462_001:0673b26_4"
    },
    {
        "source_sentence": "道士答言：『汝師瞿曇沙門，命過已經七日。",
        "translation": "The Daoist replied, 'Your teacher, the Gautama ascetic, has passed away seven days.",
        "source": "T24n1462_001:0673b27_5"
    },
    {
        "source_sentence": "瞿曇涅槃，諸人天供養，我從彼得此天曼陀羅華。』",
        "translation": "Gautama's nirvāṇa is offered by humans and gods, and I'll take this heavenly maṇḍala flower from Peter.'",
        "source": "T24n1462_001:0673b28_6"
    },
    {
        "source_sentence": "迦葉與大比丘聞佛已涅槃，宛轉涕哭悶絕躄地。",
        "translation": "Kāśyapa and the great bhikṣu heard that the Buddha had entered nirvana, weeping and screaming in distress.",
        "source": "T24n1462_001:0673b29_7"
    },
    {
        "source_sentence": "時有比丘，名須跋陀羅摩訶羅言：『止，止！",
        "translation": "A monk named Subhadra Mahāra then said, 'Stop, stop!",
        "source": "T24n1462_001:0673c02_0"
    },
    {
        "source_sentence": "何足啼哭？",
        "translation": "What's the point of weeping?",
        "source": "T24n1462_001:0673c02_1"
    },
    {
        "source_sentence": "大沙門在時，是淨是不淨、是應作是不應作。",
        "translation": "When the great ascetic is present, it's pure and impure, and what should be done and what shouldn't be done.",
        "source": "T24n1462_001:0673c03_2"
    },
    {
        "source_sentence": "今適我等意，欲作而作，不作而止。』",
        "translation": "Now, according to our intentions, we want to do it and do it, but stop when we don't.'",
        "source": "T24n1462_001:0673c04_3"
    },
    {
        "source_sentence": "時迦葉默然而憶此語，便自思惟：『惡法未興，宜集法藏。",
        "translation": "Kāśyapa remained silent and remembered these words. He thought to himself, “There is not yet an arising of evil deeds in the world.",
        "source": "T24n1462_001:0673c05_0"
    },
    {
        "source_sentence": "若正法住世，利益眾生。』",
        "translation": "If the right teaching abides in the world, it's for the benefit of sentient beings.'",
        "source": "T24n1462_001:0673c06_1"
    },
    {
        "source_sentence": "迦葉復念：『佛在世時語阿難：「我涅槃後，所說法戒即汝大師。」",
        "translation": "Kāśyapa again thought, 'When the Buddha was in the world, he said to Ānanda, After my nirvāṇa, the precepts that you teach are your great teacher.'",
        "source": "T24n1462_001:0673c06_2"
    },
    {
        "source_sentence": "是故我今當演此法。』",
        "translation": "Therefore, I will now explain this teaching.'",
        "source": "T24n1462_001:0673c08_3"
    },
    {
        "source_sentence": "迦葉惟念：『如來在世時以袈裟納衣施我。』",
        "translation": "Kāśyapa thought, 'When the Tathāgata was in the world, he gave me his robe and undergarment to wear.'",
        "source": "T24n1462_001:0673c08_4"
    },
    {
        "source_sentence": "又念：『往昔佛語比丘：「我入第一禪定，迦葉亦入定。」",
        "translation": "Again, he thought, 'In the past, the Buddha said to the monk, When I entered the first dhyāna, Kāśyapa also entered it.'",
        "source": "T24n1462_001:0673c09_5"
    },
    {
        "source_sentence": "如來如是讚嘆我，聖利滿足與佛無異，此是如來威德加我。",
        "translation": "The Tathāgata thus praises me, and the noble benefits he fulfills are no different from those of the Buddha, which is the Tathāgata's authoritative attribute to me.",
        "source": "T24n1462_001:0673c10_6"
    },
    {
        "source_sentence": "譬如大王脫身上鎧，施與其子使護其種姓，如來當知，我滅度後迦葉當護正法，是故如來施衣與我。』",
        "translation": "It's like a great king who takes off his armor and gives it to his son to protect his family, so the Tathāgata will know that after I die, Kāśyapa will protect the right teaching; therefore, the Tathāgata gives me his robe.'",
        "source": "T24n1462_001:0673c12_7"
    },
    {
        "source_sentence": "「迦葉即集比丘僧，語諸比丘：『我於一時，聞須跋陀羅摩訶羅言：「大沙門在時，是淨是不淨、是應作是不應作。",
        "translation": "Kāśyapa then assembled the monks and said to the monks, 'At one time, I heard Subhadra Mahāra say, 'When the great ascetic was here, this was pure and impure, and what should be done and what should not be done.",
        "source": "T24n1462_001:0673c14_8"
    },
    {
        "source_sentence": "今適我等意，欲作而作，不作而止。」",
        "translation": "Now, according to our intentions, we want to do it and do it, but stop when we don't.",
        "source": "T24n1462_001:0673c17_9"
    },
    {
        "source_sentence": "諸長老！",
        "translation": "Elders!",
        "source": "T24n1462_001:0673c18_10"
    },
    {
        "source_sentence": "我等輩宜出法藏及毘尼藏。』",
        "translation": "It's appropriate for us to produce the Dharma store and the vinaya store.'",
        "source": "T24n1462_001:0673c18_11"
    },
    {
        "source_sentence": "諸比丘白大德迦葉：『大德！",
        "translation": "The monks said to Venerable Kāśyapa, 'Venerable!",
        "source": "T24n1462_001:0673c19_12"
    },
    {
        "source_sentence": "當選擇諸比丘，大德迦葉！",
        "translation": "You should choose the monks, Mañjuśrī Kāśyapa!",
        "source": "T24n1462_001:0673c19_13"
    },
    {
        "source_sentence": "佛法九關一切悉通，一切學人須陀洹、斯陀含，愛盡比丘，非一百亦非一千，通知三藏者得至四辯，有大神力得三達智，佛所讚嘆。",
        "translation": "All the nine precepts of the Buddha's teaching are fully applicable, and all trainees attain stream entry and sakṛdāgāmi-samādhi when they stop craving monks, neither one hundred nor 1,000, notifying the Tripiṭaka that they have attained the four eloquent explanations, having great supernormal powers to attain the three kinds of penetrating wisdom praised by the Buddha",
        "source": "T24n1462_001:0673c20_14"
    },
    {
        "source_sentence": "又愛盡比丘五百少一，是大德摩訶迦葉！",
        "translation": "Also, the five hundred and one thousand monks who have ended craving are the great virtuous Mahākāśyapa!",
        "source": "T24n1462_001:0673c23_15"
    },
    {
        "source_sentence": "所以選擇五百而少一者，為長老阿難故。",
        "translation": "The reason they chose five hundred but less one is because it was for the elder Ānanda.",
        "source": "T24n1462_001:0673c24_16"
    },
    {
        "source_sentence": "若無阿難，無人出法；",
        "translation": "In the absence of Ānanda, there would be no one who could expound the Dharma.",
        "source": "T24n1462_001:0674a01_17"
    },
    {
        "source_sentence": "阿難所以不得入者，正在學地。』",
        "translation": "Ānanda, the reason he can't enter is because he's in the stage of training.'",
        "source": "T24n1462_001:0674a01_18"
    },
    {
        "source_sentence": "「大德迦葉，為欲斷諸誹謗故，不取阿難。",
        "translation": "Venerable Kāśyapa, it's because he wants to stop slander that he doesn't take Ānanda.",
        "source": "T24n1462_001:0674a02_19"
    },
    {
        "source_sentence": "諸比丘言：『阿難雖在學地，而親從佛前受修多羅、祇夜，於法有恩，復是耆老，釋迦種族如來親叔之子，又無偏黨三毒。",
        "translation": "The monks said, 'Although Ānanda was still in the stage of training, he personally accepted sūtra and pratyekabuddha before the Buddha to receive the sutras and pratyekabuddhas because he had kindness for the Dharma. Furthermore, he's an elderly man, a son of the Tathāgata of the Śākya clan who's a close uncle, and he has no partiality",
        "source": "T24n1462_001:0674a03_20"
    },
    {
        "source_sentence": "大德迦葉！",
        "translation": "Kāśyapa, the great virtuous one!",
        "source": "T24n1462_001:0674a06_21"
    },
    {
        "source_sentence": "應取阿難足五百數，此是眾聖意也。』",
        "translation": "You should take the five hundred sufficient numbers for Ānanda, which are the intentions of the sages.'",
        "source": "T24n1462_001:0674a06_22"
    },
    {
        "source_sentence": "諸大德比丘作是思惟：『在何處集法藏？",
        "translation": "The great virtuous monks thought, 'Where did you gather the Dharma treasure?'",
        "source": "T24n1462_001:0674a07_23"
    },
    {
        "source_sentence": "唯王舍城眾事具足，我等宜往王舍城中，安居三月出毘尼藏，莫令餘比丘在此安居。",
        "translation": "Only the city of Rājagṛha is fully equipped with everything, so it's advisable for us to go to the city of Rājagṛha and stay there for three months without leaving the vinaya treasury, so that no other monks can stay here.",
        "source": "T24n1462_001:0674a08_24"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1462_001:0674a10_25"
    },
    {
        "source_sentence": "恐餘比丘不順從故，是以遣出。』",
        "translation": "I'm afraid the other monks won't obey it, so I'll send them out.'",
        "source": "T24n1462_001:0674a11_0"
    },
    {
        "source_sentence": "於是大德迦葉白二羯磨，於僧耆品中廣明。",
        "translation": "The great virtuous Kāśyapa then explained the two karmas in detail in the Saṃgha Chapter.",
        "source": "T24n1462_001:0674a11_1"
    },
    {
        "source_sentence": "「於是從如來涅槃，後七日大會，復七日中供養舍利，過半月已，餘夏一月半在，迦葉已知安居已近。",
        "translation": "“Thereupon, seven days after the nirvana of the Tathāgata, a great assembly was held to pay homage to Śāriputra. After one and a half months had passed, he remained in Jambudvīpa for another month and a half. Kāśyapa knew that his retreat was approaching.",
        "source": "T24n1462_001:0674a12_2"
    },
    {
        "source_sentence": "迦葉語諸長老：『我等去時已至，往王舍城。』",
        "translation": "Kāśyapa said to the elders, 'We've arrived at the time of our departure and are headed for Rājagṛha.'",
        "source": "T24n1462_001:0674a15_3"
    },
    {
        "source_sentence": "大德迦葉，將二百五十比丘逐一路去。",
        "translation": "Kāśyapa, the great virtuous monk, led two hundred and fifty monks on their way.",
        "source": "T24n1462_001:0674a16_4"
    },
    {
        "source_sentence": "大德阿[少\\/兔]樓馱，將二百五十比丘，復逐一路去。",
        "translation": "The great virtuous a[lesser\\/rabbit]ruddha, accompanied by two hundred and fifty bhikṣus, proceeded on his way.",
        "source": "T24n1462_001:0674a17_5"
    },
    {
        "source_sentence": "賢者阿難，取如來袈裟，比丘僧圍遶，往舍衛國，至如來故住處。",
        "translation": "Good man Ānanda, take the reddish-brown robes of the Tathāgata. Surrounded by the bhikṣus and monks, he proceeded to Sāvatthī and came to the place where the Tathāgata was staying.",
        "source": "T24n1462_001:0674a18_6"
    },
    {
        "source_sentence": "舍衛城人見阿難已，懊惱悲泣問阿難言：『如來今在何所而獨來耶？』",
        "translation": "Seeing Ānanda, the people of Sāvatthī were distressed and wept and asked Ānanda, 'Where is the Tathāgata coming alone now?'",
        "source": "T24n1462_001:0674a19_7"
    },
    {
        "source_sentence": "諸人號哭，猶如如來初涅槃時。",
        "translation": "The people wailed and cried out, just as they did at the time when the Tathāgata entered nirvana.",
        "source": "T24n1462_001:0674a21_8"
    },
    {
        "source_sentence": "賢者阿難，以無常法教化諸人，既教化已，入祇樹園，即開佛房取佛床座出外拂拭，入房掃灑。",
        "translation": "Good man, Ānanda, you teach people the Dharma of impermanence. Having thus taught and edified them, he entered the Jetavana grove. He then opened the Buddha’s quarters, took the Buddha’s seat on which he was seated, went outside to wipe it off, and swept it clean.",
        "source": "T24n1462_001:0674a22_9"
    },
    {
        "source_sentence": "掃灑已，取房中故供養花出外棄之，還取床座復安如本。",
        "translation": "After he had swept it away, he took the old offering flower in his room, left it outside, and discarded it. He returned to take the bed and seat and placed them safely as before.",
        "source": "T24n1462_001:0674a24_10"
    },
    {
        "source_sentence": "賢者阿難種種供養，如佛在時無異。",
        "translation": "Good man, Ānanda, these various offerings are no different when the Buddha is present.",
        "source": "T24n1462_001:0674a25_11"
    },
    {
        "source_sentence": "於是阿難，從佛涅槃後，坐倚既久四大沈重，欲自療治，一日已至三日中服乳，取利而於寺坐。",
        "translation": "Ānanda then, after the nirvana of the Buddha, he sat cross-legged for a long time. The four major depressed sensations were so great that he wished to heal himself. After one day and three days had passed, he collected milk, took profit, and remained seated at the monastery.",
        "source": "T24n1462_001:0674a26_12"
    },
    {
        "source_sentence": "「時有修婆那婆羅門來請阿難，阿難答曰：『今日服藥不得應命，明日當赴。』",
        "translation": "At the time, there was a śubhāna brāhmaṇa who came to Ānanda and invited him, and Ānanda answered, 'Today, I won't be allowed to take medicine for my life; tomorrow, I will go.'",
        "source": "T24n1462_001:0674a28_13"
    },
    {
        "source_sentence": "至日將一長老比丘，到脩婆那家。",
        "translation": "On the day of his arrival, he took an elderly monk to Sūvana's house.",
        "source": "T24n1462_001:0674b01_14"
    },
    {
        "source_sentence": "脩婆那即問脩多羅義，是故阿鋡第十品中，名《脩婆那脩多羅經》。",
        "translation": "That's why the tenth chapter of the abhidharma is called the Sutra of Śubhaṇa- sūtra, which asks about the meaning of sūtra.",
        "source": "T24n1462_001:0674b02_15"
    },
    {
        "source_sentence": "於是阿難，於祇樹園中種種修護已，欲入安居向王舍城。",
        "translation": "Ānanda then, having cultivated various disciplines in the Jetavana grove, he wanted to enter peacefully and head for Rājagṛha.",
        "source": "T24n1462_001:0674b04_16"
    },
    {
        "source_sentence": "「大德迦葉，與阿[少\\/兔]樓馱一切比丘眾，至王舍城。",
        "translation": "“The great virtuous Kāśyapa and all the monks of A[lesser\\/rabbit]ruddha went to Rājagṛha.",
        "source": "T24n1462_001:0674b05_17"
    },
    {
        "source_sentence": "爾時見十八大寺一時頹毀，如來滅後，諸比丘衣笐諸物縱橫棄散而去，是故狼藉。",
        "translation": "It was then that the eighteen great temples were suddenly decayed, and after the nirvana of the Tathāgata, the monks' robes, garments, and other objects were thrown away horizontally and scattered, which is why it was so chaotic.",
        "source": "T24n1462_001:0674b06_18"
    },
    {
        "source_sentence": "五百大德比丘順佛教故，修護房舍。",
        "translation": "Because five hundred monks of great virtue followed Buddhism, they cultivated the protection of their dwellings.",
        "source": "T24n1462_001:0674b08_19"
    },
    {
        "source_sentence": "若不修護，外道當作此言：『瞿曇沙門在世時修治房舍，既涅槃後棄捨而去。』",
        "translation": "If someone doesn't cultivate protection, non-Buddhists will say, 'When the Gautama ascetic was in the world, he cultivated his dwelling and abandoned it after nirvāṇa.'",
        "source": "T24n1462_001:0674b09_20"
    },
    {
        "source_sentence": "為息此譏嫌故，宜應料理。",
        "translation": "In order to quell this criticism, it's appropriate to take care of it.",
        "source": "T24n1462_001:0674b11_21"
    },
    {
        "source_sentence": "迦葉言：『佛在世時讚歎安居，先事修護房舍。』",
        "translation": "Kāśyapa said, 'When the Buddha was in the world, he praised his retreat and built a dwelling for him.'",
        "source": "T24n1462_001:0674b11_22"
    },
    {
        "source_sentence": "作計校已，往至阿闍世王所，告求所須。",
        "translation": "After making the calculation, he went to King Ajātaśatru and asked for what he needed.",
        "source": "T24n1462_001:0674b12_23"
    },
    {
        "source_sentence": "王見比丘，頭面禮足即問：『大德何所須求？』",
        "translation": "Seeing the monk, the king bowed his head and feet and asked, 'What does the great virtuous man need to ask for?'",
        "source": "T24n1462_001:0674b13_24"
    },
    {
        "source_sentence": "迦葉答曰：『十八大寺頹毀敗壞，今欲修護，王自知之。』",
        "translation": "Kāśyapa answered, 'The eighteen great temples have been decayed and disintegrated, but now I want to protect them, so the king knows for himself.'",
        "source": "T24n1462_001:0674b14_25"
    },
    {
        "source_sentence": "王答：『善哉！』",
        "translation": "The king answered, 'Good!'",
        "source": "T24n1462_001:0674b16_26"
    },
    {
        "source_sentence": "即給作人。",
        "translation": "That's when he gives it to someone who creates it.",
        "source": "T24n1462_001:0674b16_27"
    },
    {
        "source_sentence": "「夏初一月日，迦葉等修治，修治寺中已，復往王所而白王曰：『所修護寺今悉畢竟，我等今者便演出法藏及毘尼藏。』",
        "translation": "On the first day of the first month in summer, Kāśyapa and others cultivated it, and after cultivating it in the monastery, they went back to the king and told him, 'Now that the temple we've cultivated has all been completed, we'll now perform the Dharma store and the vinaya store.'",
        "source": "T24n1462_001:0674b16_28"
    },
    {
        "source_sentence": "王答：『大善！",
        "translation": "The king answered, 'O great good!",
        "source": "T24n1462_001:0674b19_29"
    },
    {
        "source_sentence": "所願成就。』",
        "translation": "What's desired will be accomplished.'",
        "source": "T24n1462_001:0674b19_30"
    },
    {
        "source_sentence": "王復言曰：『我今當轉王威法輪，諸大德當演無上法輪。』",
        "translation": "The king then said, 'Now, I will turn the wheel of the king's authoritative teaching, and the great virtuous ones will teach the unsurpassed Dharma wheel.'",
        "source": "T24n1462_001:0674b19_31"
    },
    {
        "source_sentence": "王白眾僧：『我今政聽諸大德使令。』",
        "translation": "The king said to the saṃgha, 'Now, I'll listen to the orders of the great virtuous messengers.'",
        "source": "T24n1462_001:0674b21_32"
    },
    {
        "source_sentence": "眾僧答曰：『先立講堂。』",
        "translation": "The saṃgha answered, 'First, I'll set up a lecture hall.'",
        "source": "T24n1462_001:0674b21_33"
    },
    {
        "source_sentence": "王問：『何處起戴？』",
        "translation": "The king asked, 'Where did you get up and carry it?'",
        "source": "T24n1462_001:0674b22_34"
    },
    {
        "source_sentence": "答曰：『可於先底槃那波羅山邊禪室門邊造，此中閑靜。』",
        "translation": "He answered, 'Should you build it at the side of the Chan school's entrance on the edge of Mount Pāṭaliputra and be quiet here?'",
        "source": "T24n1462_001:0674b22_35"
    },
    {
        "source_sentence": "王答：『甚善！』",
        "translation": "The king answered, 'Very good!'",
        "source": "T24n1462_001:0674b24_0"
    },
    {
        "source_sentence": "於是阿闍世王威力，猶如第二忉利天毘舍技巧，須臾之頃即立，成辦棟梁椽柱、障壁階道，皆悉刻鏤種種異妙。",
        "translation": "The king Ajātaśatru, with his mighty power like the skillfulness of the second Trāyastriṃśa god Vaiśravaṇa, stood up in a moment's time and completed the beams, beams, pillars, walls, stairways, and other extraordinary features.",
        "source": "T24n1462_001:0674b24_1"
    },
    {
        "source_sentence": "於講堂上，以珍玩妙寶而莊嚴之，懸眾雜花繽紛羅列，地下亦復如是，種種殊妙猶如梵天宮殿無異，氍氀茵褥薦席五百，敷置床上，悉北向坐。",
        "translation": "In the assembly hall they were adorned with rare treasures and exquisite jewels, draped with various kinds of flowers and arrayed in rows. The earth beneath them was also like this, all as marvelously beautiful as the palace of Brahmā’s heavenly abode without any difference. Five hundred seats were arranged on cushions, mattresses, bedding, beds, and",
        "source": "T24n1462_001:0674b26_2"
    },
    {
        "source_sentence": "又高座以眾寶莊飾，選高座中最精妙者，擬以說法高座東向。",
        "translation": "Also, the high seat was decorated with various treasures and selected the most exquisite of the high seats to teach the Dharma facing east from the high seat.",
        "source": "T24n1462_001:0674c01_3"
    },
    {
        "source_sentence": "「眾僧語阿難曰：『明日集眾出毘尼藏，汝猶須陀洹道，云何得入？",
        "translation": "The saṃgha said to Ānanda, 'Tomorrow, we'll gather the collection of vinaya for tomorrow, but you're still on the path of stream entry, so how can you enter?'",
        "source": "T24n1462_001:0674c02_4"
    },
    {
        "source_sentence": "汝勿懈怠。』",
        "translation": "Don't be lazy.'",
        "source": "T24n1462_001:0674c04_5"
    },
    {
        "source_sentence": "於是阿難自思惟：『明日眾聖集法，我云何以初學地入中？』",
        "translation": "Ānanda then thought to himself, 'Tomorrow, how will I enter the teaching of the assembly of the sages with the first ground of training?'",
        "source": "T24n1462_001:0674c04_6"
    },
    {
        "source_sentence": "阿難從初夜觀身已，過中夜未有所得。",
        "translation": "Ānanda had observed his body since the first watch of the night, but he hadn't attained it past midnight.",
        "source": "T24n1462_001:0674c06_7"
    },
    {
        "source_sentence": "阿難思惟：『世尊往昔有如是言：「汝已修功德，若入禪定速得羅漢。」",
        "translation": "Ānanda thought, 'In the past, the Bhagavān said, You've cultivated merit; if you enter meditation, you'll quickly attain arhatship.'",
        "source": "T24n1462_001:0674c07_8"
    },
    {
        "source_sentence": "佛言無虛，當由我心精懃太過，今當疇量取其中適。』",
        "translation": "The Buddha said, 'There's nothing false; it must be the result of my mind's overweening zeal, and now I'll measure up to where it fits in.'",
        "source": "T24n1462_001:0674c08_9"
    },
    {
        "source_sentence": "於是阿難從經行處下至洗脚處，洗脚已入房却坐床上，欲少時消息倚身欲臥，脚已離地、頭未至枕，於此中間便得羅漢。",
        "translation": "Ānanda then went down from the place where he was walking to the place where he was washing his feet. After washing his feet, he entered the room and withdrew to sit on the bed. Just a little while before he wished to do so, he reported that he was lying cross-legged and wanted to lie down. When his feet were off the ground but his head did not reach the pillow, he attained ar",
        "source": "T24n1462_001:0674c10_0"
    },
    {
        "source_sentence": "若有人問，於佛法中離行住坐臥而得道者，阿難是也。",
        "translation": "If someone asks, 'In the Buddha's teaching, he parts with walking, standing, sitting, and lying down and attains enlightenment,' this is Ānanda.",
        "source": "T24n1462_001:0674c12_1"
    },
    {
        "source_sentence": "「於是大德迦葉至中月二日(六月十七日)中食已竟，料理衣鉢集入法堂。",
        "translation": "On the second day of the second month (seventh day of the sixteenth month), after he had finished his midday meal, the great virtuous Kāśyapa prepared his robe and bowl and gathered them into the Dharma hall.",
        "source": "T24n1462_001:0674c14_2"
    },
    {
        "source_sentence": "賢者阿難欲現證所得令大眾知，不隨眾僧入。",
        "translation": "Good man, Ānanda wanted to show what he had attained so that the masses would know it, but he didn't follow the saṃgha into his presence.",
        "source": "T24n1462_001:0674c15_3"
    },
    {
        "source_sentence": "眾僧入已次第而坐，留阿難坐處。",
        "translation": "After the saṃgha entered, they sat in order and left Ānanda to sit there.",
        "source": "T24n1462_001:0674c16_4"
    },
    {
        "source_sentence": "下坐眾僧從上和南，次及空處而問：『留此處擬誰？』",
        "translation": "The lower-seated monks of the saṃgha came from the upper chamber, went to the next and empty place, and asked, 'Who will stay here?'",
        "source": "T24n1462_001:0674c17_5"
    },
    {
        "source_sentence": "答曰：『擬阿難。』",
        "translation": "He answered, 'I'll ask Ānanda.'",
        "source": "T24n1462_001:0674c18_6"
    },
    {
        "source_sentence": "又問：『阿難今在何處？』",
        "translation": "Again, he asked, 'Where is Ānanda now?'",
        "source": "T24n1462_001:0674c19_7"
    },
    {
        "source_sentence": "阿難知眾心故、現神足故，於此處沒，當坐處踊出現身。",
        "translation": "Knowing the minds of the assembly and manifesting his supernormal powers, Ānanda disappeared from this place and emerged in his seat.",
        "source": "T24n1462_001:0674c19_8"
    },
    {
        "source_sentence": "於是眾僧坐竟，大德迦葉語諸長老：『為初說法藏？",
        "translation": "When the saṃgha had finished sitting, the great virtuous Kāśyapa said to the elders, 'Is it the first teaching of the Dharma store?'",
        "source": "T24n1462_001:0674c21_9"
    },
    {
        "source_sentence": "毘尼藏耶？』",
        "translation": "Is the store of vinaya?'",
        "source": "T24n1462_001:0674c22_10"
    },
    {
        "source_sentence": "諸比丘答曰：『大德！",
        "translation": "The monks replied, 'O great virtuous one!",
        "source": "T24n1462_001:0674c22_11"
    },
    {
        "source_sentence": "毘尼藏者是佛法壽，毘尼藏住佛法亦住，是故我等先出毘尼藏。",
        "translation": "The store of vinaya refers to the duration of a buddha' s dharma. When the store of vinaya abides, the dharma of a buddha also abides. That is why we have first produced the store of vinaya.",
        "source": "T24n1462_001:0674c22_12"
    },
    {
        "source_sentence": "誰為法師？』",
        "translation": "Who is the teacher of the Dharma?'",
        "source": "T24n1462_001:0675a02_13"
    },
    {
        "source_sentence": "長老優波離眾有問曰：『阿難不得為法師耶？』",
        "translation": "The elder Upāli asked, 'Didn't Ānanda get to be the teacher of the Dharma?'",
        "source": "T24n1462_001:0675a02_14"
    },
    {
        "source_sentence": "答曰：『不得為法師。",
        "translation": "He replied, 'You mustn't become a teacher of the Dharma.",
        "source": "T24n1462_001:0675a03_15"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1462_001:0675a04_16"
    },
    {
        "source_sentence": "佛在世時常所讚歎，我聲聞弟子中持律第一優波離也。』",
        "translation": "When the Buddha was in the world, he always praised me, Upāli, the first among śrāvaka disciples who upheld the precepts.'",
        "source": "T24n1462_001:0675a04_17"
    },
    {
        "source_sentence": "眾曰：『今正應問優波離出毘尼藏。』",
        "translation": "The crowd said, 'Now, you should ask Upāli to produce the Vinaya.'",
        "source": "T24n1462_001:0675a05_18"
    },
    {
        "source_sentence": "於是摩訶迦葉作白羯磨，問優波離：『長老僧聽，若僧時到僧忍聽。",
        "translation": "Mahākāśyapa then made a confession and asked Upāli, 'Elder, the saṃgha will listen; if the saṃgha arrives at the time, the saṃgha will tolerate listening.'",
        "source": "T24n1462_001:0675a06_19"
    },
    {
        "source_sentence": "我問優波離毘尼法中。",
        "translation": "I asked Upāli about the rules of the Vinaya.",
        "source": "T24n1462_001:0675a08_20"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T24n1462_001:0675a08_21"
    },
    {
        "source_sentence": "優波離作白羯磨：『大德僧聽，若僧時到僧忍聽。",
        "translation": "Upāli made a confession, saying, 'The great virtuous monks will listen, and if the saṃgha arrives at the time of the saṃgha, the saṃgha will tolerate listening.'",
        "source": "T24n1462_001:0675a08_22"
    },
    {
        "source_sentence": "我今答大德迦葉毘尼法。",
        "translation": "Now, I'll answer the teaching of the great virtuous Kāśyapa Vinaya.",
        "source": "T24n1462_001:0675a09_23"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T24n1462_001:0675a10_24"
    },
    {
        "source_sentence": "如是優波離白羯磨已，整身衣服，向大德比丘頭面作禮。",
        "translation": "After he had thus explained the ritual, Upāli straightened his body and clothing, bowed his head and face to the monk Mahāprajñāpāramitā, and paid homage.",
        "source": "T24n1462_001:0675a10_25"
    },
    {
        "source_sentence": "作禮已上高座而坐，取象牙裝扇。",
        "translation": "After paying homage, he ascended the high seat and sat down, took his ivory, and set up a fan.",
        "source": "T24n1462_001:0675a12_26"
    },
    {
        "source_sentence": "「迦葉還坐已，問優波離長老：『第一波羅夷，何處說？",
        "translation": "After returning to his seat, Kāśyapa asked the elder Upāli, 'First, what's the paranirmita-vaśavartin?'",
        "source": "T24n1462_001:0675a12_27"
    },
    {
        "source_sentence": "因誰起耶？』",
        "translation": "Who is the cause that gives rise to it?'",
        "source": "T24n1462_001:0675a14_28"
    },
    {
        "source_sentence": "答曰：『毘舍離結，因迦蘭陀子須提那起。』",
        "translation": "He answered, 'The Vaiśravaṇa bond arises because of the Kalandaka's son Sudināna.'",
        "source": "T24n1462_001:0675a14_29"
    },
    {
        "source_sentence": "問曰：『犯何罪也？』",
        "translation": "He asked, 'What's the offense?'",
        "source": "T24n1462_001:0675a15_30"
    },
    {
        "source_sentence": "答曰：『犯不淨罪。』",
        "translation": "He answered, 'I'll commit an impure offense.'",
        "source": "T24n1462_001:0675a15_31"
    },
    {
        "source_sentence": "迦葉問優波離罪、因緣、人身、結戒、隨結戒，有罪亦問，無罪亦問。",
        "translation": "Kāśyapa asked Upāli about sins, causes and conditions, human bodies, fetters and precepts, and subsequent fetters, questions about sins as well as questions about sins, and questions about sinlessness.",
        "source": "T24n1462_001:0675a16_32"
    },
    {
        "source_sentence": "如第一波羅夷，如是第二、第三、第四因緣本起，大迦葉悉問，優波離隨問盡答，是故名四波羅夷品。",
        "translation": "As in the case of the first pārājika, so in the case of the second, third, and fourth causes and conditions that originally arose, Mahākāśyapa asked them all questions, and Upāli answered them completely as he asked, which is why it's called the chapter on the four pārājikas.",
        "source": "T24n1462_001:0675a17_33"
    },
    {
        "source_sentence": "復次問僧伽婆尸沙，復次問二不定，次問三十尼薩耆波夜提，次問九十二波夜提，次問四波羅提提舍尼，次問七十五眾學，次問七滅諍法，如是大波羅提木叉作已。",
        "translation": "Again, he asked Saṃghâvaśeṣa, again asked the two indeterminate questions, then asked the thirty-nine questions of Pāyāntika, then asked the ninety-two questions of Pāyāntika, then asked the four questions of Pārātimokṣa, then asked the seventy-five questions of the teachings of the assembly, and then asked the seven questions of the cessation",
        "source": "T24n1462_001:0675a19_34"
    },
    {
        "source_sentence": "「次問比丘尼八波羅夷，名波羅夷品。",
        "translation": "Next, he asked the monks and nuns about the eight pārājikas, which are called the pārājika class.",
        "source": "T24n1462_001:0675a24_0"
    },
    {
        "source_sentence": "復次問十七僧伽婆尸沙，次問三十尼薩耆波夜提，次問六十六波夜提，次問八波羅提提舍尼，次問七十五眾學，次問七滅諍法，如是已作比丘尼波羅提木叉竟。",
        "translation": "Furthermore, he asked about the seventeen saṃghâvaśeṣas, the thirty-six pāyatti bhikṣus, the sixty-six pāyatti bhikṣus, the eight pārājika bhikṣus, the seventy-five śrāmaṇerīs, and the seven rules for extinguishing disputes.",
        "source": "T24n1462_001:0675a24_1"
    },
    {
        "source_sentence": "「次問蹇陀(漢言雜事)，次問波利婆羅(漢言三擯四羯磨也)，如是律藏作已。",
        "translation": "Next, he asks Upagupta (Sanskrit for miscellaneous matters), and then he asks parivara (Sanskrit for the four karmas in Chinese), thus does the vinaya work.",
        "source": "T24n1462_001:0675a28_2"
    },
    {
        "source_sentence": "「大德迦葉一切問優波離，優波離答已，是故名五百羅漢集律藏竟。",
        "translation": "The great virtuous Kāśyapa all asked Upāli, and Upāli answered him, which is why it's called the completion of the five hundred arhats' collection of vinaya.",
        "source": "T24n1462_001:0675b01_3"
    },
    {
        "source_sentence": "於是，長老優波離放扇從高座下，向諸大德比丘作禮，作禮已，還復本座。",
        "translation": "The elder Upāli then dismounted from his high seat and paid homage to the monks of great virtue. After paying homage, he returned to his seat.",
        "source": "T24n1462_001:0675b02_4"
    },
    {
        "source_sentence": "摩訶迦葉言：『毘尼集竟。",
        "translation": "Mahākāśyapa said, 'The Vinaya collection is complete.",
        "source": "T24n1462_001:0675b04_5"
    },
    {
        "source_sentence": "問法藏。",
        "translation": "He asked the Dharma store.",
        "source": "T24n1462_001:0675b04_6"
    },
    {
        "source_sentence": "誰為法師，應出法藏？』",
        "translation": "Who is the teacher of the Dharma who should produce the Dharma treasure?'",
        "source": "T24n1462_001:0675b05_7"
    },
    {
        "source_sentence": "諸比丘言：『長老阿難。』",
        "translation": "The monks said, 'Elder Ānanda.'",
        "source": "T24n1462_001:0675b05_8"
    },
    {
        "source_sentence": "於是大德迦葉作白羯磨：『長老僧聽，若僧時到僧忍聽。",
        "translation": "The great virtuous Kāśyapa then made a confession, saying, 'Elder, the saṃgha will listen, and if the saṃgha arrives at the time, the saṃgha will tolerate listening.'",
        "source": "T24n1462_001:0675b06_9"
    },
    {
        "source_sentence": "我問長老阿難法藏。",
        "translation": "I asked the elder Ānanda the Dharma treasure.",
        "source": "T24n1462_001:0675b07_10"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T24n1462_001:0675b07_11"
    },
    {
        "source_sentence": "阿難復作白羯磨：『大德僧聽，若僧時到僧忍聽。",
        "translation": "Ānanda then again made a statement to the saṃgha, saying, 'The great virtuous monks will listen, and if the saṃgha arrives at the saṃgha's time, the saṃgha will tolerate listening.",
        "source": "T24n1462_001:0675b08_12"
    },
    {
        "source_sentence": "我今答大德迦葉法藏。",
        "translation": "Now, I'll answer the great virtuous Kāśyapa Dharma store.",
        "source": "T24n1462_001:0675b09_13"
    },
    {
        "source_sentence": "白如是。』",
        "translation": "He said, 'So it is.'",
        "source": "T24n1462_001:0675b09_14"
    },
    {
        "source_sentence": "於是阿難從坐起，偏袒右肩禮大德僧已即登高座，登高座已，手捉象牙裝扇。",
        "translation": "Ānanda then rose from his seat, bared his right shoulder, saluted the great virtuous monk with veneration, ascended to a high seat, and after ascending that high seat, he grabbed an ivory fan in his hand.",
        "source": "T24n1462_001:0675b10_0"
    },
    {
        "source_sentence": "「大德迦葉問阿難：『法藏中《梵網經》，何處說耶？』",
        "translation": "The great virtuous Kāśyapa asked Ānanda, 'Where did the Brahmā's Net Sutra in the Dharma store say that?'",
        "source": "T24n1462_001:0675b12_0"
    },
    {
        "source_sentence": "阿難答曰：『王舍城、那蘭駄二國中間王菴羅絺屋中說。』",
        "translation": "Ānanda answered, 'The king of Rājagṛha and the two kings of Nāraṇḍa explained it in the monastery.'",
        "source": "T24n1462_001:0675b13_1"
    },
    {
        "source_sentence": "『因誰而起？』",
        "translation": "'Who gave rise to it?'",
        "source": "T24n1462_001:0675b14_2"
    },
    {
        "source_sentence": "『因修悲夜波利婆闍迦、婆羅門揵多，因二人起。』",
        "translation": "'It's because of the cultivation of compassion that two people, Yaparivāsa and Brāhmaṇa Candra, arose.'",
        "source": "T24n1462_001:0675b14_3"
    },
    {
        "source_sentence": "大德迦葉問阿難《梵網經》因緣本起。",
        "translation": "The great virtuous Kāśyapa asked Ānanda about the causes and conditions for the original arising of the Brahmā's Net Sutra.",
        "source": "T24n1462_001:0675b15_4"
    },
    {
        "source_sentence": "次問：『《沙門果經》何處說耶？』",
        "translation": "Next, he asked, 'Where does the ascetic fruit sūtra say it?'",
        "source": "T24n1462_001:0675b16_5"
    },
    {
        "source_sentence": "阿難答曰：『於王舍城耆婆林中說。』",
        "translation": "Ānanda answered, 'Explain it in the Jīvaka's Grove in Rājagṛha.'",
        "source": "T24n1462_001:0675b17_6"
    },
    {
        "source_sentence": "『為誰說耶？』",
        "translation": "'Who did you teach it for?'",
        "source": "T24n1462_001:0675b18_0"
    },
    {
        "source_sentence": "『為阿闍世王、梵棄子等。』",
        "translation": "'For the sake of King Ajātaśatru, Brahmā and so forth.'",
        "source": "T24n1462_001:0675b18_1"
    },
    {
        "source_sentence": "如是《沙門果經》因緣本起，以是方便問五部經。」",
        "translation": "Thus, this is the original cause and condition for the initiation of the Ascetic Fruit Sutra, which asks five kinds of sūtras with skillful means.",
        "source": "T24n1462_001:0675b18_2"
    },
    {
        "source_sentence": "「何謂為五部？」",
        "translation": "What are the five divisions?",
        "source": "T24n1462_001:0675b19_3"
    },
    {
        "source_sentence": "答曰：「《長阿鋡經》、《中阿鋡經》、《僧述多經》、《殃堀多羅經》、《屈陀迦經》。」",
        "translation": "He answered, The Chang ahan jing, the Zhong ahan jing, the samsutta jing, the ehora jing, and the kūdaka jing.",
        "source": "T24n1462_001:0675b20_4"
    },
    {
        "source_sentence": "問曰：「何謂《屈陀迦經》？」",
        "translation": "He asked, What's the Kukkuṭika-sūtra?",
        "source": "T24n1462_001:0675b21_5"
    },
    {
        "source_sentence": "答曰：「除四阿鋡，餘者一切佛法，悉名《堀陀迦經》。",
        "translation": "He answered, Except for the four abhidharmas, all the other buddha-teachings are all called the Godāga Sutra.",
        "source": "T24n1462_001:0675b22_6"
    },
    {
        "source_sentence": "四阿鋡中一切雜經，阿難所出，唯除律藏。",
        "translation": "All the miscellaneous sūtras in the four abhidharmas are produced by Ānanda except for the vinaya collection.",
        "source": "T24n1462_001:0675b23_7"
    },
    {
        "source_sentence": "佛語一味，分別有二用，初中後說其味有三，三藏亦復如是，戒定慧藏，若是部黨，五部經也。",
        "translation": "The Buddha's words are one flavor, and there are two functions of distinction, which are explained in the beginning, middle, and end with three flavors, and so is the Tripiṭaka, which is likewise for the store of morality, meditation, and wisdom, if it's a sect, then it's a five-part scripture.",
        "source": "T24n1462_001:0675b24_8"
    },
    {
        "source_sentence": "若一二分別有九部經，如是聚集有八萬法藏。」",
        "translation": "If there are nine separately divided into one or two, such a collection of sūtras will have 80,000 dharma stores.",
        "source": "T24n1462_001:0675b26_9"
    },
    {
        "source_sentence": "問曰：「何以名為一味？」",
        "translation": "He asked, Why is it called the single flavor?",
        "source": "T24n1462_001:0675b27_10"
    },
    {
        "source_sentence": "「世尊得阿耨多羅三藐三菩提，乃至涅槃時，於一中間四十五年，為天、龍、夜叉、乾闥婆、阿修羅、迦樓羅、緊那羅、摩睺羅伽、人非人等，是為一味，若一解脫性復為一味。」",
        "translation": "Bhagavān, when the Bhagavān attains unsurpassed, correct, and complete enlightenment, up to the time of nirvāṇa, forty-five years in between are gods, dragons, yakṣas, gandharvas, asuras, garuḍas, kiṃnaras, mahoragas, humans, nonhumans, and so forth, which is one flavor, and if",
        "source": "T24n1462_001:0675b28_11"
    },
    {
        "source_sentence": "「何謂為二？」",
        "translation": "What are the two?",
        "source": "T24n1462_001:0675c03_0"
    },
    {
        "source_sentence": "「法藏、毘尼藏。」",
        "translation": "The Dharma store and the vinaya store.",
        "source": "T24n1462_001:0675c03_1"
    },
    {
        "source_sentence": "「何以初中後說？」",
        "translation": "Why is it explained in the beginning, middle, and end?",
        "source": "T24n1462_001:0675c03_2"
    },
    {
        "source_sentence": "「佛初中後說，是謂為三。",
        "translation": "“These are the first, middle, and last teachings of the Buddha.",
        "source": "T24n1462_001:0675c03_3"
    },
    {
        "source_sentence": "「『流轉非一生，　　走去無厭足，",
        "translation": "'It's not a single lifetime of transmigration, but it doesn't tire of walking and going.",
        "source": "T24n1462_001:0675c04_4"
    },
    {
        "source_sentence": "　　正覓屋住處，　　更生生辛苦，",
        "translation": "Looking for a house or dwelling place, they'll again experience hardship and suffering.",
        "source": "T24n1462_001:0675c04_4"
    },
    {
        "source_sentence": "　　今已見汝屋，　　不復更作屋。",
        "translation": "Now that I've seen your house, I won't build another one.",
        "source": "T24n1462_001:0675c04_4"
    },
    {
        "source_sentence": "　　一切脊肋骨，　　碎折不復生，",
        "translation": "All the bones and ribs on their backs Will be crushed and dismembered, And no longer grow.",
        "source": "T24n1462_001:0675c04_4"
    },
    {
        "source_sentence": "　　心已離煩惱，　　愛盡至涅槃。』",
        "translation": "My mind has been free of afflictions, and I've ended craving until I reach nirvāṇa.'",
        "source": "T24n1462_001:0675c04_4"
    },
    {
        "source_sentence": "而說偈言：「復有法師，解優陀那偈，此是如來初說，月生三日中得一切智慧，踊躍觀看因緣。",
        "translation": "Again, there's a teacher of the Dharma who understands the udāna verse, which is the Tathāgata's first teaching that the moon gives rise to all wisdom in three days, and he jumps up and down to see the causes and conditions.",
        "source": "T24n1462_001:0675c04_4"
    },
    {
        "source_sentence": "「『時法生成就，　　蹇陀迦中說。』",
        "translation": "'The accomplishment of the timely arising of dharmas is explained in the caṇḍika.'",
        "source": "T24n1462_001:0675c11_5"
    },
    {
        "source_sentence": "說是偈言：「如來臨涅槃時勅諸比丘：『汝於我法中慎莫懈怠。』",
        "translation": "He spoke this verse, saying, When the Tathāgata approaches nirvāṇa, he commands the monks, 'You must be careful not to lazy in my teaching.'",
        "source": "T24n1462_001:0675c11_5"
    },
    {
        "source_sentence": "此是最後說，於兩中間，是名中說。」",
        "translation": "This is the final teaching, and between these two, it's called speaking in terms of names.",
        "source": "T24n1462_001:0675c15_6"
    },
    {
        "source_sentence": "問曰：「何謂三藏？」",
        "translation": "He asked, What are the three collections?",
        "source": "T24n1462_001:0675c16_0"
    },
    {
        "source_sentence": "答曰：「毘尼藏、修多羅藏、阿毘曇藏，是名三藏。」",
        "translation": "He answered, The Vinaya collection, the sūtra collection, and the abhidharma collection are called the three collections.",
        "source": "T24n1462_001:0675c16_1"
    },
    {
        "source_sentence": "問曰：「何謂毘尼藏？」",
        "translation": "He asked, What's the Vinaya?",
        "source": "T24n1462_001:0675c17_2"
    },
    {
        "source_sentence": "「二波羅提木叉、二十三蹇陀、波利婆羅，是名毘尼藏。」",
        "translation": "The two prātimokṣas, twenty-three bodhisattvas, and parivara are called the vinaya collection.",
        "source": "T24n1462_001:0675c17_3"
    },
    {
        "source_sentence": "問曰：「何謂修多羅藏？」",
        "translation": "He asked, What's the sūtra store?",
        "source": "T24n1462_001:0676a01_4"
    },
    {
        "source_sentence": "答曰：「《梵網經》為初，四十四修多羅，悉入《長阿鋡》；",
        "translation": "He answered, “The Sutra of Brahmā’s Net is the first. The forty-four sūtras all belong to the Chang ahan jing.",
        "source": "T24n1462_001:0676a01_5"
    },
    {
        "source_sentence": "初根《牟羅波利耶》，二百五十二修多羅，悉入《中阿鋡》；",
        "translation": "The text of the first faculty, called “Sara-paripāliya” with two hundred fifty-two chapters, all belonged to the Middle Length Abhidharma.",
        "source": "T24n1462_001:0676a02_6"
    },
    {
        "source_sentence": "《烏伽多羅阿婆陀那》為初，七千七百六十二修多羅，悉入《僧述多》；",
        "translation": "The first was the work Ugratara avadāna, consisting of seven thousand seven hundred and sixty-two sūtras. All these entered into the Saṅgha Sūtra.",
        "source": "T24n1462_001:0676a03_7"
    },
    {
        "source_sentence": "《折多波利耶陀那修多羅》為初，九千五百五十七脩多羅，悉入《鴦掘多羅》，《法句喻》、《軀陀那》、《伊諦佛多伽》、《尼波多》、《毘摩那》、《卑多》、《涕羅涕利伽陀》、《本生》、《尼涕婆》、《波致參毘陀》、《佛種性經》。",
        "translation": "The first was the sūtra of the 折多波利耶陀那修多羅, and the ninety-five hundred and fifty-seven sūtras all entered into the Aṅgulitālā, which included the Dharma句喻、體陀那、伊諦佛多伽、尼波多、毘摩那、毘摩那、卑多、涕羅涕利伽陀、本生、尼涕婆、波",
        "source": "T24n1462_001:0676a05_8"
    },
    {
        "source_sentence": "若用藏者，破作十四分，悉入《屈陀迦》，此是名《修多羅藏》。」",
        "translation": "If someone uses the store, they break it down into 14 parts and enter them all into the Kukkutaka, which is called the sūtra store.",
        "source": "T24n1462_001:0676a09_9"
    },
    {
        "source_sentence": "問曰：「何謂阿毘曇藏？」",
        "translation": "He asked, What's the abhidharma store?",
        "source": "T24n1462_001:0676a10_10"
    },
    {
        "source_sentence": "答曰：「法僧伽、毘崩伽、陀兜迦他、耶摩迦、鉢叉逼伽羅坋那祗迦他跋偷，此是阿毘曇藏。」",
        "translation": "He answered, These are the abhidharma collections of the Dharma-saṃgha, vibhaṅga, dhāraṇyakata, yamaka, and pratyekabuddha.",
        "source": "T24n1462_001:0676a11_11"
    },
    {
        "source_sentence": "問曰：「何謂毘尼義耶？」",
        "translation": "He asked, What's the meaning of vinaya?",
        "source": "T24n1462_001:0676a13_12"
    },
    {
        "source_sentence": "「將好非一種，　　調伏身口業，",
        "translation": "“Good intentions aren’t one and the same, but to tame bodily and verbal actions",
        "source": "T24n1462_001:0676a13_13"
    },
    {
        "source_sentence": "　知毘尼義者，　　說是毘尼義。」",
        "translation": "Knowing the meaning of vinaya, they say it's the meaning of vinaya.",
        "source": "T24n1462_001:0676a13_13"
    },
    {
        "source_sentence": "說偈答曰：問曰：「何謂種種五篇波羅提木叉？」",
        "translation": "He spoke a verse in reply, asking, What are the various five-part prātimokṣas?",
        "source": "T24n1462_001:0676a13_13"
    },
    {
        "source_sentence": "「波羅夷為初，五篇七聚罪，是謂為種種戒母，將成堅行寬方便，隨結從身口不善作，此是將身口業，是故名毘尼耶。」",
        "translation": "The first, the five parts and seven categories of sins are called the mother of various precepts that are about to become resolute in practice and skillful in following the bonds and not doing well with body and speech, which are directed toward bodily and verbal actions; therefore, they're called vinaya.",
        "source": "T24n1462_001:0676a16_14"
    },
    {
        "source_sentence": "問曰：「何謂修多羅？」",
        "translation": "He asked, What's meant by sūtra?",
        "source": "T24n1462_001:0676a19_15"
    },
    {
        "source_sentence": "「種種義開發，　　善語如秀出，",
        "translation": "Various meanings arise, and good words are like elegant expressions.",
        "source": "T24n1462_001:0676a19_16"
    },
    {
        "source_sentence": "　經緯與涌泉，　　繩墨綖貫穿，",
        "translation": "The scriptures and lapis lazuli are connected with the well-flowing fountain, With strings of ink and thread running through it.",
        "source": "T24n1462_001:0676a19_16"
    },
    {
        "source_sentence": "　是謂脩多羅，　　甚深微妙義。」",
        "translation": "This is called the profound and subtle meaning of sūtra.",
        "source": "T24n1462_001:0676a19_16"
    },
    {
        "source_sentence": "以偈答曰：問曰：「何謂發義？」",
        "translation": "He answered in verse, Q: What's the meaning of arousing?",
        "source": "T24n1462_001:0676a19_16"
    },
    {
        "source_sentence": "答曰：「自發義能發他義。」",
        "translation": "He answered, The meaning that arises on its own can give rise to the meaning of others.",
        "source": "T24n1462_001:0676a24_17"
    },
    {
        "source_sentence": "問曰：「何謂善語？」",
        "translation": "He asked, What's meant by good speech?",
        "source": "T24n1462_001:0676a24_18"
    },
    {
        "source_sentence": "答曰：「先觀人心然後善語。」",
        "translation": "He answered, First observe the mind and then speak well.",
        "source": "T24n1462_001:0676a25_19"
    },
    {
        "source_sentence": "問曰：「何謂秀出？」",
        "translation": "He asked, What's meant by秀出?",
        "source": "T24n1462_001:0676a25_20"
    },
    {
        "source_sentence": "答曰：「譬如禾稻秀出結實。」",
        "translation": "He answered, It's like a grain of rice that's beautiful and produces its fruit.",
        "source": "T24n1462_001:0676a26_21"
    },
    {
        "source_sentence": "問曰：「何謂經緯？」",
        "translation": "He asked, What's the sūtra?",
        "source": "T24n1462_001:0676a26_22"
    },
    {
        "source_sentence": "答曰：「以綖織成。」",
        "translation": "He answered, It's made by weaving silk.",
        "source": "T24n1462_001:0676a27_23"
    },
    {
        "source_sentence": "問曰：「何謂涌泉？」",
        "translation": "He asked, What's called a well-formed spring?",
        "source": "T24n1462_001:0676a27_24"
    },
    {
        "source_sentence": "答曰：「如泉取者眾多而無窮盡。」",
        "translation": "He answered, Suppose someone takes a large amount of water from a spring and doesn't end it.",
        "source": "T24n1462_001:0676a28_25"
    },
    {
        "source_sentence": "問曰：「何謂繩墨？」",
        "translation": "He asked, What's meant by rope and ink?",
        "source": "T24n1462_001:0676a28_26"
    },
    {
        "source_sentence": "答曰：「如直繩能去曲木。」",
        "translation": "He answered, It's like a straight rope that removes twisted wood.",
        "source": "T24n1462_001:0676a29_27"
    },
    {
        "source_sentence": "問曰：「何謂為綖？」",
        "translation": "He asked, What's meant by anger?",
        "source": "T24n1462_001:0676a29_28"
    },
    {
        "source_sentence": "答曰：「譬如散花，以綖貫穿風吹不散。",
        "translation": "He answered, It's like a scattered flower that penetrates the wind and blows without scattering it with its silhouette.",
        "source": "T24n1462_001:0676b01_29"
    },
    {
        "source_sentence": "修多羅者亦復如是，貫諸法相亦不分散。」",
        "translation": "So it is with the sūtra, which follows the characteristics of dharmas and doesn't disperse them.",
        "source": "T24n1462_001:0676b02_30"
    },
    {
        "source_sentence": "問曰：「何謂阿毘曇？」",
        "translation": "He asked, What's the abhidharma?",
        "source": "T24n1462_001:0676b03_31"
    },
    {
        "source_sentence": "「有人意識法，　　讚歎斷截說，",
        "translation": "“Some people praise the dharmas of the thinking consciousness, Praising their elimination and cutting off teachings.",
        "source": "T24n1462_001:0676b03_32"
    },
    {
        "source_sentence": "　長法是故說，　　是為阿毘曇。",
        "translation": "Because of the long doctrine, it is said to be an abhidharma.",
        "source": "T24n1462_001:0676b03_32"
    },
    {
        "source_sentence": "以偈答曰：「此是阿毘偈也，意、識、讚歎、斷截、長，此入阿毘義也。」",
        "translation": "He replied in verse, This is the meaning of the abhi sūtra, which refers to the mind, consciousness, praise, elimination, and length.",
        "source": "T24n1462_001:0676b03_32"
    },
    {
        "source_sentence": "問曰：「何謂為意？」",
        "translation": "He asked, What's meant by that?",
        "source": "T24n1462_001:0676b07_33"
    },
    {
        "source_sentence": "答曰：「修多羅句云，有人言極劇意云何？",
        "translation": "He answered, The sūtra says, What's the intention of someone who says extremely cruel?",
        "source": "T24n1462_001:0676b07_34"
    },
    {
        "source_sentence": "是阿毘意義也。」",
        "translation": "This is the meaning of abhidharma.",
        "source": "T24n1462_001:0676b08_35"
    },
    {
        "source_sentence": "「何謂為識？」",
        "translation": "What's meant by consciousness?",
        "source": "T24n1462_001:0676b08_36"
    },
    {
        "source_sentence": "答曰：「脩多羅句畫夜阿毘，此是阿毘識義也。」",
        "translation": "He answered, This is the meaning of the abhiconsciousness in the sūtra phrase drawn at night and abhi.",
        "source": "T24n1462_001:0676b09_37"
    },
    {
        "source_sentence": "「何謂讚歎？」",
        "translation": "What's meant by praising?",
        "source": "T24n1462_001:0676b10_38"
    },
    {
        "source_sentence": "答曰：「王阿毘王，此是阿毘讚歎義也。」",
        "translation": "He answered, King Abhijit, this is the meaning of praising Abhijit.",
        "source": "T24n1462_001:0676b10_39"
    },
    {
        "source_sentence": "「何謂斷截？」",
        "translation": "What's meant by cutting?",
        "source": "T24n1462_001:0676b11_40"
    },
    {
        "source_sentence": "答曰：「足力阿毘，此是阿毘斷截義也。」",
        "translation": "He answered,足力阿毘, which is the meaning of abhisaṃkuṭika.",
        "source": "T24n1462_001:0676b11_41"
    },
    {
        "source_sentence": "「何謂為長？」",
        "translation": "What's meant by long?",
        "source": "T24n1462_001:0676b12_42"
    },
    {
        "source_sentence": "答曰：「阿毘于多(漢言長也)，此是阿毘長義也。",
        "translation": "He answered, Abhidharma (known as long in Chinese), which is the meaning of abhidharma.",
        "source": "T24n1462_001:0676b12_43"
    },
    {
        "source_sentence": "又曰：『生色界，慈心遍觀一方毘呵羅(漢言意義)。",
        "translation": "Again, he said, 'When you're born in the form realm, your mind of kindness pervades and observes one side of Vaiśravaṇa (known as meaning in Chinese).",
        "source": "T24n1462_001:0676b13_44"
    },
    {
        "source_sentence": "識者，色聲乃至觸，是識義也。",
        "translation": "Consciousness means form, sound, and even touch, which is the meaning of consciousness.",
        "source": "T24n1462_001:0676b14_45"
    },
    {
        "source_sentence": "讚歎者，學法、無學法、世間無上法，此是讚歎義也。",
        "translation": "Praise refers to the teaching of training, the teaching of post-learning, and the unsurpassed teaching in the world. This is the meaning of praise.",
        "source": "T24n1462_001:0676b15_46"
    },
    {
        "source_sentence": "斷截者，觸法成學，是斷截義也。",
        "translation": "Cutting refers to the meaning of cutting, which is the accomplishment of training by touching things.",
        "source": "T24n1462_001:0676b16_47"
    },
    {
        "source_sentence": "長者，大法不可度量阿耨多羅法，是長義也。』",
        "translation": "Elder, the great teaching can't be measured by an anuttara dharma, which is its long meaning.'",
        "source": "T24n1462_001:0676b17_48"
    },
    {
        "source_sentence": "此義應當知之。",
        "translation": "This meaning should be known.",
        "source": "T24n1462_001:0676b18_49"
    },
    {
        "source_sentence": "又曰：『曇者法也。』」",
        "translation": "Again, he said, 'Dharma is the Dharma.'",
        "source": "T24n1462_001:0676b18_50"
    },
    {
        "source_sentence": "「何謂為藏？」",
        "translation": "What's meant by store?",
        "source": "T24n1462_001:0676b18_51"
    },
    {
        "source_sentence": "「智藏藏義味，　　從義學器者，",
        "translation": "“The store of wisdom is the store of meaning, and those who study it from the container of meaning are likewise.",
        "source": "T24n1462_001:0676b19_52"
    },
    {
        "source_sentence": "　我今合一說，　　藏義汝自知，",
        "translation": "I will now explain it in unity. Know for yourself the meaning of ‘ Storehouse’:",
        "source": "T24n1462_001:0676b19_52"
    },
    {
        "source_sentence": "以偈答曰：　此是藏義也。」",
        "translation": "He answered in verse, This is the meaning of the store.",
        "source": "T24n1462_001:0676b19_52"
    },
    {
        "source_sentence": "問曰：「何謂為藏？」",
        "translation": "He asked, What's meant by store?",
        "source": "T24n1462_001:0676b23_0"
    },
    {
        "source_sentence": "答曰：「藏者學，此是法藏也。",
        "translation": "He answered, The store is training, which is the store of the Dharma.",
        "source": "T24n1462_001:0676b23_1"
    },
    {
        "source_sentence": "又脩多羅句云，如人執攬與鋘鈇而來。",
        "translation": "The sūtra also says, Suppose a person takes a man's robe and comes with a bowl.",
        "source": "T24n1462_001:0676b24_0"
    },
    {
        "source_sentence": "此是器義也。",
        "translation": "This is the meaning of a container.",
        "source": "T24n1462_001:0676b24_1"
    },
    {
        "source_sentence": "今已總說三藏，應當知是二義也。",
        "translation": "Now, we've explained the three collections in general, and you should know that these are the two meanings.",
        "source": "T24n1462_001:0676b25_2"
    },
    {
        "source_sentence": "已略說毘尼藏。",
        "translation": "I've already briefly explained the Vinaya.",
        "source": "T24n1462_001:0676b26_3"
    },
    {
        "source_sentence": "智藏亦言義器，脩多羅亦如是。",
        "translation": "The store of wisdom also speaks of the container of meaning, and so does sūtra.",
        "source": "T24n1462_001:0676b26_4"
    },
    {
        "source_sentence": "又曰：『阿毘曇者則是藏也。』",
        "translation": "Again, he said, 'The abhidharma is the store.'",
        "source": "T24n1462_001:0676b27_5"
    },
    {
        "source_sentence": "如是已知。",
        "translation": "They've thus known it.",
        "source": "T24n1462_001:0676b27_6"
    },
    {
        "source_sentence": "復於三藏中，種種因緣指示佛法，語言分別隨所薄著，學除甚深相學破合離者，次第文句至義自出。",
        "translation": "Furthermore, in the Tripiṭaka, various causes and conditions are cited to show the Buddha's teachings, language is discriminated according to what's weakened, and those who study and remove profound characteristics of training and break up and separation are individually expressed in order of words and phrases until they reach their meaning.",
        "source": "T24n1462_001:0676b28_7"
    },
    {
        "source_sentence": "今次第現此三藏。",
        "translation": "Now, these three collections are presented in order.",
        "source": "T24n1462_001:0676c01_8"
    },
    {
        "source_sentence": "阿毘說曰：『阿毘者，意義、識義、讚歎義、斷截義、出過廣義、大義、無上義。",
        "translation": "The Abhidharma teaches: Abhidharma is the meaning, the meaning of consciousness, the meaning of praise, the meaning of elimination, the meaning of transcendence, the meaning of vastness, the meaning of greatness, and the meaning of peerlessness.",
        "source": "T24n1462_001:0676c01_9"
    },
    {
        "source_sentence": "何謂為意？",
        "translation": "What's meant by mind?",
        "source": "T24n1462_001:0676c03_10"
    },
    {
        "source_sentence": "憶持也。",
        "translation": "It's also called recollection.",
        "source": "T24n1462_001:0676c03_11"
    },
    {
        "source_sentence": "識者分別也。",
        "translation": "Consciousness is discrimination.",
        "source": "T24n1462_001:0676c03_12"
    },
    {
        "source_sentence": "讚歎者，常為聖人之所讚歎也。",
        "translation": "Praise means that it's always praised by sages.",
        "source": "T24n1462_001:0676c04_13"
    },
    {
        "source_sentence": "斷截者，分別偈也。",
        "translation": "The verse that cuts off refers to the distinctive verse.",
        "source": "T24n1462_001:0676c04_14"
    },
    {
        "source_sentence": "出過者，過於餘法也。",
        "translation": "What's beyond that is beyond the other dharmas.",
        "source": "T24n1462_001:0676c05_15"
    },
    {
        "source_sentence": "廣者，於諸法中最為廣也。",
        "translation": "Extensive is the most extensive of all dharmas.",
        "source": "T24n1462_001:0676c05_16"
    },
    {
        "source_sentence": "大者諸法之最大也。",
        "translation": "The great one is the greatest of all dharmas.",
        "source": "T24n1462_001:0676c06_17"
    },
    {
        "source_sentence": "無上者，諸法無能勝也。",
        "translation": "The unsurpassed one means that there are no dharmas that can be overpowered.",
        "source": "T24n1462_001:0676c06_18"
    },
    {
        "source_sentence": "曇者，舉義承義護義。",
        "translation": "Dharma refers to the meaning that gives rise to the meaning and protects the meaning.",
        "source": "T24n1462_001:0676c07_19"
    },
    {
        "source_sentence": "何謂為舉？",
        "translation": "What's meant by holding?",
        "source": "T24n1462_001:0676c07_20"
    },
    {
        "source_sentence": "舉者，舉置眾生於善道也。",
        "translation": "raised means to raise and place sentient beings in a good path.",
        "source": "T24n1462_001:0676c08_21"
    },
    {
        "source_sentence": "承者，承受眾生不令入三惡道也。",
        "translation": "Inheritance means to bear the burden on sentient beings and not allow them to enter the three bad destinies.",
        "source": "T24n1462_001:0676c08_22"
    },
    {
        "source_sentence": "護者，擁護眾生令得種種快樂也。",
        "translation": "Protecting refers to protecting sentient beings so that they attain various kinds of happiness.",
        "source": "T24n1462_001:0676c09_23"
    },
    {
        "source_sentence": "藏者器也。",
        "translation": "The store is the container.",
        "source": "T24n1462_001:0676c10_24"
    },
    {
        "source_sentence": "何謂為器？",
        "translation": "What's meant by a container?",
        "source": "T24n1462_001:0676c10_25"
    },
    {
        "source_sentence": "器者，能聚集眾義也。』」",
        "translation": "A container is someone who can gather all the meanings together.'",
        "source": "T24n1462_001:0676c10_26"
    },
    {
        "source_sentence": "問曰：「藏與阿毘曇，為同為異？」",
        "translation": "He asked, Are the store and the abhidharma the same or different?",
        "source": "T24n1462_001:0676c11_27"
    },
    {
        "source_sentence": "答曰：「同。」",
        "translation": "He replied, So it is.",
        "source": "T24n1462_001:0676c12_28"
    },
    {
        "source_sentence": "又問曰：「若同者，但云阿毘曇自足，何須復言藏也？」",
        "translation": "Again, he asked, If it's the same, why would it need to be called store if it's just saying that the abhidharma is self-contained?",
        "source": "T24n1462_001:0676c12_29"
    },
    {
        "source_sentence": "答曰：「聖人說法欲使文句具足故，更安藏字也，如是三藏義亦爾。",
        "translation": "He answered, Because the noble person teaches the Dharma so that the words are complete in terms of words and phrases, they're also called store names, and so is the meaning of the tripiṭaka.",
        "source": "T24n1462_001:0676c13_30"
    },
    {
        "source_sentence": "又為指示故，為教授故，為分別故，為繫故，為捨故，為甚深相故，為離合故。",
        "translation": "Also, it's because of instructions, because of instruction, because of discernment, because of bondage, because of equanimity, because of profound characteristics, and because of separation from union.",
        "source": "T24n1462_001:0676c15_31"
    },
    {
        "source_sentence": "若比丘隨所至處，顯現如是一切諸義，此是三藏，如是次第威德顯現正義，隨罪過、隨比類、隨教法、隨覆見纏名色差別。",
        "translation": "If a monk follows where he goes and reveals all these meanings, this is the tripiṭaka, which shows the correct meaning in order of authoritative qualities according to crimes, types, teachings, and distinctions in name-and-form by following the afflictions of overt views.",
        "source": "T24n1462_001:0676c16_32"
    },
    {
        "source_sentence": "若人依毘尼為行則得入定，得定便具三達智，此是戒為行本，因三昧故便具六通。",
        "translation": "If someone relies on the Vinaya as their practice, then they'll enter concentration, and when they attain concentration, they'll have the three kinds of penetrating cognition. This is the foundation of practice based on precepts, and because of samādhi, they'll have the six supernormal powers.",
        "source": "T24n1462_001:0676c19_33"
    },
    {
        "source_sentence": "若人修學阿毘曇，能生實智慧，實慧既生便具四辯。",
        "translation": "If someone cultivates the abhidharma, they can give rise to real wisdom, and when real wisdom arises, they'll have four kinds of eloquence.",
        "source": "T24n1462_001:0677a01_34"
    },
    {
        "source_sentence": "若人隨順律語得世間樂。",
        "translation": "Suppose a person follows the words of the precepts and attains worldly happiness.",
        "source": "T24n1462_001:0677a03_0"
    },
    {
        "source_sentence": "何謂為世間樂？",
        "translation": "What's meant by worldly happiness?",
        "source": "T24n1462_001:0677a03_1"
    },
    {
        "source_sentence": "淨戒之人人天讚善，常受世間四事供養，此世間樂除欲樂。",
        "translation": "The people of the pure precepts are praised by humans and gods as good, and they always receive worldly offerings in four ways, which are worldly pleasures that remove desires and pleasures.",
        "source": "T24n1462_001:0677a04_0"
    },
    {
        "source_sentence": "如脩多羅說、佛所說，我已知之，不宜在家，出家學道而得道果。",
        "translation": "As the sūtra teaches and what the Buddha teaches, I've known it; it's not advisable for someone to leave home and train in the path so that they can attain the fruit of the path.",
        "source": "T24n1462_001:0677a05_1"
    },
    {
        "source_sentence": "得道果者，戒定慧力也。",
        "translation": "Attaining the fruit of the path is the power of morality, meditation, and wisdom.",
        "source": "T24n1462_001:0677a06_2"
    },
    {
        "source_sentence": "隨逐惡者，皆由無智，無智故佛教妄解，妄解故誹謗如來，作諸惡業自破其身，從此因緣廣生邪見。",
        "translation": "Those who pursue evil are all because of lack of knowledge. Because of their lack of knowledge, the Buddha’s doctrine is based on deluded understanding. Because of deluded understanding, they denigrate the Tathagata and do evil deeds that destroy their own bodies. As a result of these causes and conditions, wrong view arises widely.",
        "source": "T24n1462_001:0677a07_3"
    },
    {
        "source_sentence": "於阿毘曇僻學者，捉心過急，則心發逸所不應思，如脩多羅，告諸比丘，有四法，不應思而思，心則發狂。」",
        "translation": "If an abhidharmaless scholar grasps the mind and becomes overly hasty, then his mind arouses thoughts that shouldn't be thought, like when he says to monks in sūtra, There are four things that you shouldn't think but think, and your mind goes crazy.",
        "source": "T24n1462_001:0677a09_4"
    },
    {
        "source_sentence": "法師曰：「如是次第破戒、邪見亂心、善不善說已。",
        "translation": "The teacher of the Dharma said, In this order, he breaks the precepts, wrong views disturb his mind, and speaks well or badly.",
        "source": "T24n1462_001:0677a12_5"
    },
    {
        "source_sentence": "「具足不具足，　　隨行而得之，",
        "translation": "Endowed and not endowed, They attain it as they go along.",
        "source": "T24n1462_001:0677a13_6"
    },
    {
        "source_sentence": "　比丘樂學者，　　當愛重此法。",
        "translation": "A monk who delights in learning should esteem this teaching.",
        "source": "T24n1462_001:0677a13_6"
    },
    {
        "source_sentence": "而說偈言：「如是藏義知一切佛語，應當知。」",
        "translation": "He spoke a verse, saying, Such is the meaning of the store that knows all the Buddha's words, and you should know them.",
        "source": "T24n1462_001:0677a13_6"
    },
    {
        "source_sentence": "「何謂為阿含？」",
        "translation": "What's meant by the Āgamas?",
        "source": "T24n1462_001:0677a16_7"
    },
    {
        "source_sentence": "法師曰：「有五阿含。",
        "translation": "The teacher of the Dharma said, There are five Āgamas.",
        "source": "T24n1462_001:0677a17_8"
    },
    {
        "source_sentence": "何謂為五？",
        "translation": "What are the five?",
        "source": "T24n1462_001:0677a17_9"
    },
    {
        "source_sentence": "一者、《長阿含》，二者、《中阿含》，三者、《僧育多阿含》，四者、《鴦堀多羅阿含》，五者、《屈陀伽阿含》。」",
        "translation": "1. the Longer Āgamas, 2. the Middle Āgamas, 3. the Saṃyuktâgama Āgamas, 4. the Aṅguliṃdhara Āgamas, and 5. the Kudgala Āgamas.",
        "source": "T24n1462_001:0677a17_10"
    },
    {
        "source_sentence": "問曰：「何謂為長阿含？」",
        "translation": "He asked, What's meant by long abhidharma?",
        "source": "T24n1462_001:0677a19_11"
    },
    {
        "source_sentence": "「三品中《梵網經》為初，四十四修多羅悉入三品中，是名長阿含。」",
        "translation": "In the three sections, the Sutra of Brahmā's Net is the first, and the forty-four sūtras all enter into the three sections; this is called the long abhidharma.",
        "source": "T24n1462_001:0677a20_12"
    },
    {
        "source_sentence": "法師問：「云何名之為長？」",
        "translation": "The teacher of the Dharma asked, What's called long?",
        "source": "T24n1462_001:0677a21_13"
    },
    {
        "source_sentence": "「聚眾法最多故名為長。」",
        "translation": "It's called long because the multitude of dharmas is the greatest.",
        "source": "T24n1462_001:0677a22_14"
    },
    {
        "source_sentence": "又問曰：「何謂為阿含？」",
        "translation": "Again, he asked, What's meant by the Āgamas?",
        "source": "T24n1462_001:0677a22_15"
    },
    {
        "source_sentence": "答曰：「容受聚集義名阿含。",
        "translation": "He answered, The meaning of allowing gathering together is called the Āgamas.",
        "source": "T24n1462_001:0677a23_16"
    },
    {
        "source_sentence": "如修多羅說，佛告諸比丘：『我於三界中不見一阿含，如畜生阿含，純是眾生聚集處也。』",
        "translation": "As the sūtra explains, the Buddha told the monks, 'I don't see a single Āgama in the three realms like the Āgama of animals, which is simply the place where sentient beings gather together.'",
        "source": "T24n1462_001:0677a23_17"
    },
    {
        "source_sentence": "以是義故，中阿含亦應知，不長不短故名為中。",
        "translation": "Because of this meaning, the middle abhidharma should also be known. Because it is neither long nor short, it is called ‘middle’.",
        "source": "T24n1462_001:0677a25_18"
    },
    {
        "source_sentence": "於十五品，根學修多羅為初，一百五十二修多羅，是名中阿含。",
        "translation": "In the fifteen classes, the first is the sūtra of faculties and training, while the one hundred and fifty-two sūtras are called the middle abhidharma.",
        "source": "T24n1462_001:0677a27_0"
    },
    {
        "source_sentence": "「七月日出法竟，大德迦葉，修理成就十力法已，於是大地如人歡喜，歎言：『善哉，善哉！』",
        "translation": "After the seventh-monthly sunrise dharma ended, the great virtuous Kāśyapa repaired and perfected the ten powers of the Dharma, the whole land rejoiced like a human being and praised it, saying, 'Good, good!'",
        "source": "T24n1462_001:0677a28_1"
    },
    {
        "source_sentence": "乃徹黃泉六種震動，又種種奇異妙相出現，此是五百大眾羅漢初集名也。",
        "translation": "He then penetrated the Yellow Spring with six kinds of trembling and various strange and marvelous appearances, which are the names of the first assembly of the five hundred great arhats.",
        "source": "T24n1462_001:0677b01_2"
    },
    {
        "source_sentence": "「世間中五百，　　羅漢出是法，",
        "translation": "Five hundred arhats in the world (i.e., philosophers and bodhisattvas) taught this Dharma:",
        "source": "T24n1462_001:0677b03_3"
    },
    {
        "source_sentence": "　故名五百出，　　諸賢咸共知。",
        "translation": "That's why they're called the five hundred emanations, which are known to all the good men.",
        "source": "T24n1462_001:0677b03_3"
    },
    {
        "source_sentence": "而說偈言：「是時大眾說，大德迦葉問優波離：『波羅夷何處結耶？』",
        "translation": "He spoke a verse, saying, At the time, the masses said, The great virtuous Kāśyapa asked Upāli, 'Where's the knot of pārājika?'",
        "source": "T24n1462_001:0677b03_3"
    },
    {
        "source_sentence": "「亦問犯處、亦問因緣、亦問人身：『此問大德自知？』」",
        "translation": "Again, he asks about the place of the offense, asks about the causes and conditions, and asks about the person's body: 'Is this a question that the great virtuous one knows for himself?'",
        "source": "T24n1462_001:0677b07_4"
    },
    {
        "source_sentence": "答曰：「時因人結戒，是故結戒一切次第我今當說。",
        "translation": "Answer: At the time, it was because people were forming precepts, so I'll explain the order in which they were forming precepts now.",
        "source": "T24n1462_001:0677b08_5"
    },
    {
        "source_sentence": "爾時佛在毘蘭若處。」",
        "translation": "It was then that the Buddha was in Vaiśravaṇa.",
        "source": "T24n1462_001:0677b09_6"
    },
    {
        "source_sentence": "問曰：「何時說耶？」",
        "translation": "He asked, When did it say that?",
        "source": "T24n1462_001:0677b09_7"
    },
    {
        "source_sentence": "答：「集五百大眾說，如是種種義出已。」",
        "translation": "Answer: After he gathered the five hundred members of the assembly to explain these various meanings, he said.",
        "source": "T24n1462_001:0677b10_8"
    },
    {
        "source_sentence": "問曰：「何以優波離說？」",
        "translation": "He asked, Why did Upāli say that?",
        "source": "T24n1462_001:0677b11_9"
    },
    {
        "source_sentence": "答曰：「為大德迦葉問是戒本已。",
        "translation": "He answered, After the great virtuous Kāśyapa asked this question about the source of the precepts, he said.",
        "source": "T24n1462_001:0677b11_10"
    },
    {
        "source_sentence": "現今誰持者？",
        "translation": "Who's maintaining it now?",
        "source": "T24n1462_001:0677b12_11"
    },
    {
        "source_sentence": "持者何處住？",
        "translation": "Where does the holder of the precepts live?",
        "source": "T24n1462_001:0677b12_12"
    },
    {
        "source_sentence": "我當說根本。",
        "translation": "I will explain the root.",
        "source": "T24n1462_001:0677b13_0"
    },
    {
        "source_sentence": "今說章句義。",
        "translation": "Now, we'll explain the meaning of the chapter and sentence.",
        "source": "T24n1462_001:0677b13_1"
    },
    {
        "source_sentence": "爾時佛住毘蘭若，此根本律藏初如是說。",
        "translation": "At the time, the Buddha was staying in Vaiśravaṇa, and this fundamental vinaya collection first explained it this way.",
        "source": "T24n1462_001:0677b13_2"
    },
    {
        "source_sentence": "長老優波離佛前持，佛未涅槃時，六通羅漢無數千萬，從優波離受。",
        "translation": "The elder Upāli Buddha held it in front of him, and when the Buddha hadn't entered nirvāṇa, there were countless millions of arhats with six supernormal powers who received it from Upāli.",
        "source": "T24n1462_001:0677b14_3"
    },
    {
        "source_sentence": "世尊涅槃後，大德迦葉為初，諸大悲眾集閻浮利地中，誰能持？",
        "translation": "World-honored One, after the nirvana of the World-honored One, the venerable Kāśyapa is the first. Who will be able to support the great compassionate assembly assembled in Jambudvlpa?",
        "source": "T24n1462_001:0677b16_4"
    },
    {
        "source_sentence": "優波離為初，諸律師次第持，乃至第三大眾諸大德持，今次第說師名字：優波離，大象拘，蘇那拘，悉伽符，目揵連子帝須。",
        "translation": "Upāli is the first, which is held in order by the Vinaya masters and up to the third, held by the great virtuous men of the assembly. The next teacher is named Upāli, Mahāprajāpatīṇa, Kanakamuni, Kanakamuni, Sūnâstivāda, Siddhârthapu, and Maudgalyāyana Tissasu.",
        "source": "T24n1462_001:0677b17_5"
    },
    {
        "source_sentence": "五人得勝煩惱，次第閻浮利地中持律亦不斷，乃至第三一切諸律師，皆從優波離出，此是連續優波離。",
        "translation": "When five people attain superior afflictions, the precepts won't continue to be maintained in order in Jambudvīpa, and so forth, up to the third, all the Vinaya masters emerge from Upāli, which is a continuous Upāli.",
        "source": "T24n1462_001:0677b20_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1462_001:0677b23_0"
    },
    {
        "source_sentence": "優波離從金口所聞，聚於心中開施與人。",
        "translation": "Upāli heard it from the golden mouth, and he gathered it in his mind to give it to someone.",
        "source": "T24n1462_001:0677b23_1"
    },
    {
        "source_sentence": "人知已，有學人須陀洹、斯陀含、阿那含不可計數，愛盡比丘一千。",
        "translation": "Knowing this, the people knew that there were innumerable stream entrants, sakṛdāgāmins, and non-returners who had studied [the Buddhist teaching]. The number of those who abandoned their craving was one thousand.",
        "source": "T24n1462_001:0677b24_2"
    },
    {
        "source_sentence": "大象拘是優波離弟子，從優波離口悉聞，自解至深極理，學人初受不可計數，愛盡比丘一千。",
        "translation": "Mahāprajñāpāramitā was a disciple of Upāli. He heard all the teachings from Upāli’s mouth and understood them for himself up to the profound ultimate truth. For the first time he received incalculable numbers of precepts, and after having destroyed his craving one thousand bhikṣus.",
        "source": "T24n1462_001:0677b25_3"
    },
    {
        "source_sentence": "蘇那拘，此是大象拘弟子，蘇那拘從師口受取律已，讀誦性自知律，學人初受不可計數，愛盡比丘一千。",
        "translation": "Suna Kauṇḍinya, who was a disciple of Mahāprajāpaṇa Kauṇḍinya, accepted the precepts from his teacher's mouth and read and recited them out loud to know the precepts for himself. The first acceptance of the precepts by the trainee could not be counted; he had destroyed all his cravings in 1,000 bhikṣus.",
        "source": "T24n1462_001:0677b27_4"
    },
    {
        "source_sentence": "悉伽符是蘇那拘弟子，從師口受律已，於一千阿羅漢中，最勝性自知律，學人初受學不可計數，愛盡比丘非百千不可度量。",
        "translation": "Siṃhalafu was a disciple of Sunakūṭa who had received the precepts from his teacher's mouth, and among the 1,000 arhats, he knew the precepts for himself most excellently; the number of those who studied them for the first time were incalculable, and the number of monks who ended their craving wasn't one hundred thousand that couldn't be measured.",
        "source": "T24n1462_001:0677c01_5"
    },
    {
        "source_sentence": "爾時閻浮利地無數比丘集，目揵連子帝須神力，第三大眾欲現如是毘尼藏，閻浮利地中諸法師次第乃至第三大眾持，應當知。」",
        "translation": "At the time, there were countless monks in Jambudvīpa who gathered together, and Maudgalyāyana Tīrṣipastra asked them to use their supernormal powers; the third group of monks wanted to present such a Vinaya, and the order of the Dharma masters in Jambudvīpa up to the third group of monks held it, as you should know.",
        "source": "T24n1462_001:0677c04_6"
    },
    {
        "source_sentence": "問曰：「何謂為第三大眾？」",
        "translation": "He asked, What's meant by the third group of people?",
        "source": "T24n1462_001:0677c07_7"
    },
    {
        "source_sentence": "答曰：「此是次第時已出竟，光明妙法用智慧故。",
        "translation": "He answered, This is the sequence that's been completed at the right time because it's illuminating the marvelous teaching and using wisdom.",
        "source": "T24n1462_001:0677c07_8"
    },
    {
        "source_sentence": "「壽命住世間，　　五百智慧明，",
        "translation": "Their life spans live in the world, and their five hundred wisdoms shine brightly.",
        "source": "T24n1462_001:0677c09_9"
    },
    {
        "source_sentence": "　五百中大德，　　迦葉最為初，",
        "translation": "Among the five hundred great virtuous ones, Kāśyapa is the first.",
        "source": "T24n1462_001:0677c09_9"
    },
    {
        "source_sentence": "　譬如燈油盡，　　涅槃無著處。」",
        "translation": "It's like when the oil of a lamp has run out, and nirvāṇa has no attachment place.",
        "source": "T24n1462_001:0677c09_9"
    },
    {
        "source_sentence": "而說是讚曰：跋闍子品第二集法藏「於是眾聖，日夜中次第而去。",
        "translation": "He spoke this praise, saying, The second collection of the Dharma store in the chapter on the Vajjiputta, So the sages departed day and night in order.",
        "source": "T24n1462_001:0677c09_9"
    },
    {
        "source_sentence": "世尊涅槃已一百歲時，毘舍離跋闍子比丘，毘舍離中十非法起。",
        "translation": "When the World-honored One was one hundred years away from nirvana, the monk Vaiśālī Vajrapāṇi bhikṣu and ten unlawful acts occurred in Vaiśālī.",
        "source": "T24n1462_001:0677c14_10"
    },
    {
        "source_sentence": "何謂為十？",
        "translation": "What are these ten?",
        "source": "T24n1462_001:0677c16_11"
    },
    {
        "source_sentence": "一者、鹽淨，二者、二指淨，三者、聚落間淨，四者、住處淨，五者、隨意淨，六者、久住淨，七者、生和合淨，八者、水淨，九者、不益縷尼師壇淨，十者、金銀淨。",
        "translation": "1. the purity of salt, 2. the purity of two fingers, 3. the purity of villages, 4. the purity of dwelling places, 5. the purity of following one's wishes, 6. the purity of long abiding, 7. the purity of producing and combining, 8. the purity of water, 9. the purity of the unfired nun's altar, 10. the purity of gold",
        "source": "T24n1462_001:0677c16_12"
    },
    {
        "source_sentence": "此是十非法。",
        "translation": "These are the ten unlawful things.",
        "source": "T24n1462_001:0677c19_13"
    },
    {
        "source_sentence": "於毘舍離現此十非法，諸跋闍子修那伽子名阿須，阿須爾時作王，黨跋闍子等。",
        "translation": "In Vaiśālī, these ten things are shown to be unlawful, and the Vṛjiputra's son Śubhaṅga is called Asoka; Asoka then becomes king of the Vṛjiputra family.",
        "source": "T24n1462_001:0677c20_0"
    },
    {
        "source_sentence": "爾時長老耶須拘迦，是迦乾陀子，於跋闍中彷徉而行毘舍離，跋闍子比丘毘舍離中現十非法，聞已：『我不應隱住壞十力法，若為方便滅此惡法？』",
        "translation": "It was then that the elder Yaśoka, the son of Kātyāyana, roamed around in Vṛji and traveled to Vaiśālī, and after hearing this, the monk Vṛjiputra showed ten unlawful things in Vaiśālī, he said, 'Shouldn't I be quietly abiding and destroying the ten powers?",
        "source": "T24n1462_001:0677c21_1"
    },
    {
        "source_sentence": "即往至毘舍離。",
        "translation": "He then went to Vaiśālī.",
        "source": "T24n1462_001:0678a03_2"
    },
    {
        "source_sentence": "到已，爾時長老耶須拘迦乾陀子，於毘舍離大林鳩咤伽羅沙羅中住。",
        "translation": "When he arrived, it was then that the elder Yaśoka Gandhāra's son stayed at Kauṣṭhilasara in Vaiśālī's great forest.",
        "source": "T24n1462_001:0678a03_3"
    },
    {
        "source_sentence": "爾時，跋闍子比丘說戒時，取水滿鉢置比丘僧中。",
        "translation": "At the time, when the monk Vajrapāṇi was speaking the precepts, he took a bowl full of water and placed it among the monks and nuns.",
        "source": "T24n1462_001:0678a05_4"
    },
    {
        "source_sentence": "爾時，毘舍離諸優婆塞來詣，跋闍子比丘作如是言，語諸優婆塞：『應與眾僧錢，隨意與半錢若一錢，使眾僧得衣服。』",
        "translation": "It was then that the laymen of Vaiśālī came to him, and the monk Vajrapāṇi said this, saying to the laymen, 'Should you give the money for the saṃgha's money or give half a coin or one coin as you like to the saṃgha to obtain their clothing?'",
        "source": "T24n1462_001:0678a06_5"
    },
    {
        "source_sentence": "「一切應說，此是集毘尼義。",
        "translation": "All of them should be explained, which is the meaning of the collection of the vinaya.",
        "source": "T24n1462_001:0678a09_6"
    },
    {
        "source_sentence": "七百比丘不減不長，是名七百比丘集毘尼義。",
        "translation": "Seven hundred monks who don't decrease and don't grow are called seven hundred monks gathering the meaning of the vinaya.",
        "source": "T24n1462_001:0678a10_7"
    },
    {
        "source_sentence": "於集眾中，二萬比丘集。",
        "translation": "Among the assembly, twenty thousand monks assembled.",
        "source": "T24n1462_001:0678a11_8"
    },
    {
        "source_sentence": "長老耶斯那比丘發起此事，於跋闍子比丘眾中，長老離婆多問薩婆迦，薩婆迦比丘答：『律藏中斷十非法，及消滅諍法。",
        "translation": "When the elder Yasena bhikṣu initiated this matter, among the monks of Vṛjiputra's congregation, the elder Rīvaka asked Sāvaka about it, and the monk Sāvaka answered, 'In the Vinaya, there are ten unlawful things that are eliminated in the ten unlawful ones and the cessation of the debilitating dharmas.",
        "source": "T24n1462_001:0678a11_9"
    },
    {
        "source_sentence": "大德！",
        "translation": "O great virtuous one!",
        "source": "T24n1462_001:0678a14_10"
    },
    {
        "source_sentence": "我等輩今應出法及毘尼，擇取通三藏者，至三達智比丘擇取已，於毘舍離婆利迦園中，眾已聚集，如迦葉初集法藏無異。",
        "translation": "We should now present the teachings and the vinaya, discerning and apprehending what belongs to the three collections. The bhikṣu Samantabhadra discerned and apprehended them in Vaiśālī’s brāhmaṇa park, where all the bhikṣus gathered together as Kāśyapa did when he first collected the Tripiṭaka of the Dharma.” Having done so,",
        "source": "T24n1462_001:0678a14_11"
    },
    {
        "source_sentence": "一切佛法中垢洗除已，依藏更問、依阿含問、依枝葉問、依諸法聚問，一切法及毘尼藏盡出。』",
        "translation": "After he washes away the stains in all the Buddha's teachings, he asks questions based on the store and further questions, questions based on the Āgamas, questions based on branches and leaves, and questions based on categories of questions, and all the teachings and Vinaya collections are exhausted.'",
        "source": "T24n1462_001:0678a17_12"
    },
    {
        "source_sentence": "「世間中七百，　　是為七百名，",
        "translation": "“Seven hundred in the world are these seven hundred names:",
        "source": "T24n1462_001:0678a19_13"
    },
    {
        "source_sentence": "　依如前所說，　　汝等自當知。",
        "translation": "As has been said before, You should know for yourselves.",
        "source": "T24n1462_001:0678a19_13"
    },
    {
        "source_sentence": "「『第二好集眾，　　大法一切出，",
        "translation": "'The second good thing is to gather crowds, and all the great teachings are produced.",
        "source": "T24n1462_001:0678a19_13"
    },
    {
        "source_sentence": "　　已至重法處，　　應作已作竟，",
        "translation": "Having arrived at a place of great dharmas, one should do what should be done and finish what has been done",
        "source": "T24n1462_001:0678a19_13"
    },
    {
        "source_sentence": "　　愛盡比丘者，　　是名第二集。』」",
        "translation": "The monk who has ended craving is called the second collection.'",
        "source": "T24n1462_001:0678a19_13"
    },
    {
        "source_sentence": "此是大眾，於八月日得集竟，說偈讚曰：「是時，薩婆迦眉、蘇寐、離婆多、屈闍須毘多、耶須、婆那參復多，此是大德阿難弟子，修摩[少\\/兔]、婆娑伽眉，此二人是阿[少\\/兔]留駄弟子，已曾見佛，而說偈言：阿育王品第三集法藏「諸大德自作念言：『當來世我等師法，如是濁垢起有無耶？』",
        "translation": "At the end of the assembly on the eighth day of the eighth month, he spoke these verses in praise, saying, “At that time there were Sāvakamei, Supratiṣṭha, Revata, Kauṣṭhila, Yaśu, and Upagupta, disciples of Venerable Ānanda. These two were all devoted disciples of [Aniruddha] but they had never before seen",
        "source": "T24n1462_001:0678a19_13"
    },
    {
        "source_sentence": "大德即見當來世非法垢起，從此以後百歲又十八年中，波咤利弗國阿育王已生世，生已一切閻浮利地靡不降伏，於佛法中甚篤信極大供養。",
        "translation": "The great virtuous one then saw that the unlawful defilement would arise in the future world, and for another hundred years and eighteen years after this, King Aśoka of Pāṭaliputra had already been born in the world, and when he was born, all the Jambudvīpa lands were completely subdued, and he became very devoted to the Buddha's teachings and made great offerings.",
        "source": "T24n1462_001:0678b03_14"
    },
    {
        "source_sentence": "於是諸外道梵志，見阿育王如此信佛法，外道梵志貪供養故，入佛法中而作沙門，猶事外道如舊，以外道法教化諸人。",
        "translation": "The non-Buddhist priests then saw that King Aśoka believed in the Buddha's teaching so much, and because they wanted to make offerings, non-Buddhist priests entered the Buddha's teaching and became as śramaṇas, serving non-Buddhists as before.",
        "source": "T24n1462_001:0678b06_15"
    },
    {
        "source_sentence": "如是佛法極大濁垢，濁垢欲成。",
        "translation": "Thus, the Buddha's teaching is so greatly defiled that it wants to become defiled.",
        "source": "T24n1462_001:0678b09_16"
    },
    {
        "source_sentence": "於是諸大德作是念：『我等輩及當來世見垢不？』",
        "translation": "The great virtuous ones then had this thought, 'We and the future generations of us are not tainted by views?'",
        "source": "T24n1462_001:0678b10_17"
    },
    {
        "source_sentence": "各自觀壽命不及，復作是念：『誰為當來宣傳？』",
        "translation": "Each of them observes that their lifespan isn't long, and they also think, 'Who will proclaim it in the future?'",
        "source": "T24n1462_001:0678b11_18"
    },
    {
        "source_sentence": "諸大德觀一切人民及欲界中，都無一人。",
        "translation": "The great virtuous ones observe that there's no one among all the people or anyone in the desire realm.",
        "source": "T24n1462_001:0678b12_19"
    },
    {
        "source_sentence": "復觀諸梵天，有一天人短壽，曾觀法相。",
        "translation": "Again, he observed the Brahma gods, a god with a short life span who once observed the characteristics of the Dharma.",
        "source": "T24n1462_001:0678b13_20"
    },
    {
        "source_sentence": "諸大德作如是念：『我等當往請此梵天人下生世間，於目揵連婆羅門家中受胎，然後我等教化令其出家，得出家已，一切佛法通達無礙三達智已，破壞外道判諸諍法，整持佛法。』",
        "translation": "The great virtuous ones had this thought, 'Should we go and invite these Brahmā gods to descend into the world and receive birth in the womb at the homes of Maudgalyāyana's brāhmaṇas, then we would teach them so that they leave home, leave home after leaving home, comprehend all the Buddha's teachings without obstruction and three kinds of cognition, disrupt non-Buddhist",
        "source": "T24n1462_001:0678b14_21"
    },
    {
        "source_sentence": "「於是諸大德往至梵天，梵天人名帝須。",
        "translation": "The great virtuous ones then went to the Brahma gods, and the Brahma gods are called Tiṣya.",
        "source": "T24n1462_001:0678b18_22"
    },
    {
        "source_sentence": "諸大德至，語帝須：『從此百年後十八年中，如來法極大垢起，我等觀一切世間及欲界，不見一人能護佛法，乃至梵天見汝一人。",
        "translation": "When the great virtuous monks arrived, they said to Indra, 'Eighteen years after this one hundred years, the Tathāgata's teaching will become extremely defiled, and we won't see a single person in all the worlds or in the realm of desire who can protect the Buddha's teaching, even up to the Brahma gods who see you alone.",
        "source": "T24n1462_001:0678b19_23"
    },
    {
        "source_sentence": "善哉，善人！",
        "translation": "Excellent, good man!",
        "source": "T24n1462_001:0678b22_24"
    },
    {
        "source_sentence": "若汝生世間，以十力法汝當整持。』",
        "translation": "If you were to be born in the world, you would maintain it correctly with the ten powers.'",
        "source": "T24n1462_001:0678b22_25"
    },
    {
        "source_sentence": "諸大德作是言已，大梵帝須聞諸大德佛法中垢起我當洗除，聞已，歡喜踊躍答曰：『善哉！",
        "translation": "Having said these words, the great brāhmaṇa needed to hear the teachings of the great virtuous buddhas. Hearing them, he rejoiced and jumped for joy.",
        "source": "T24n1462_001:0678b23_26"
    },
    {
        "source_sentence": "對已，與諸大德立誓，於梵天應作已罷，從梵天下。』",
        "translation": "After you've made this vow with the great virtuous ones, you should make a vow in the Brahma heaven that you'll cease and leave the Brahma realm.'",
        "source": "T24n1462_001:0678b25_27"
    },
    {
        "source_sentence": "爾時，有大德和伽婆、栴陀跋闍二人，於眾少年，通持三藏，得三達智、愛盡阿羅漢，是二人不及滅諍。",
        "translation": "At the time, there were two men of great virtue, Vakṣobhya and Bhadravardhana, who were among the young people in the assembly, held the Tripiṭaka, attained the knowledge of the three teachings, and ended craving as arhats, but they didn't succeed in extinguishing anger.",
        "source": "T24n1462_001:0678b27_28"
    },
    {
        "source_sentence": "諸大德語二長老：『汝二人不及滅諍，眾僧今依事罰汝。",
        "translation": "The great virtuous monks said to the two elders, 'You two won't be able to end the dispute, and the saṃgha will now punish you based on your deeds.",
        "source": "T24n1462_001:0678b29_29"
    },
    {
        "source_sentence": "當來有梵天人名帝須，當託生目揵連婆羅門家，汝二人可一人往迎，取度出家，一人教學佛法。』",
        "translation": "In the future, there will be a Brahma god named Tiṣya who'll be born in the house of Maudgalyāyana Brāhmaṇa, and you two may one person go to meet him, save him, leave home, and teach him the buddha-dharma.'",
        "source": "T24n1462_001:0678c01_30"
    },
    {
        "source_sentence": "「第二七百眾，　　和合滅非法，",
        "translation": "The second seven hundred assemblies harmonize and extinguish unlawfulness.",
        "source": "T24n1462_001:0678c04_31"
    },
    {
        "source_sentence": "　當來法因緣，　　已作令久住。",
        "translation": "The causes and conditions of future dharmas have already been done, so they'll abide for a long time.",
        "source": "T24n1462_001:0678c04_31"
    },
    {
        "source_sentence": "　愛盡得自在，　　善通三達智，",
        "translation": "Having destroyed craving and attained mastery, They are well versed in the three knowledges.",
        "source": "T24n1462_001:0678c04_31"
    },
    {
        "source_sentence": "　神通得自在，　　猶不免無常。",
        "translation": "Their supernormal powers attain freedom, but they still can't escape impermanence.",
        "source": "T24n1462_001:0678c04_31"
    },
    {
        "source_sentence": "　我今說名字，　　傳流於將來，",
        "translation": "I will now give you my name, transmitting it in the future.",
        "source": "T24n1462_001:0678c04_31"
    },
    {
        "source_sentence": "　如是生無常，　　已知生難得，",
        "translation": "Thus, birth is impermanent, knowing that birth is difficult to attain.",
        "source": "T24n1462_001:0678c04_31"
    },
    {
        "source_sentence": "　若欲得常住，　　當懃加精進。",
        "translation": "If you want to attain eternal abiding, you must diligently apply yourself with effort.",
        "source": "T24n1462_001:0678c04_31"
    },
    {
        "source_sentence": "於是諸大德阿羅漢，隨壽長短各入涅槃，而說偈言：「此第二僧說：『摩呵梵魔帝須，從梵天下，託生目揵連婆羅門家。』",
        "translation": "The great virtuous arhats then entered nirvāṇa according to their length of life, and they each spoke a verse, saying, This second monk said, 'This is Mahāprajāpatīṣu, who was born in the house of the brāhmaṇa Maudgalyāyana from Brahmā Heaven.'",
        "source": "T24n1462_001:0678c04_31"
    },
    {
        "source_sentence": "於是和伽婆觀見帝須已入婆羅門家受胎。",
        "translation": "Thereupon, Vakṣobhya observed that Tiṣya had entered the Brāhmaṇa's home and was born in the womb.",
        "source": "T24n1462_001:0678c14_32"
    },
    {
        "source_sentence": "知受胎已，和伽婆日日往其家乞食，乃至七年。",
        "translation": "Knowing that he had entered the womb, Vātsīputrīya went to his house day after day to solicit alms, up to seven years old.",
        "source": "T24n1462_001:0678c15_33"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1462_001:0678c16_34"
    },
    {
        "source_sentence": "為度因緣故，於是七年乞飯不得，乞水亦不得。",
        "translation": "For the sake of liberation, he couldn't get food for seven years and didn't get water to beg for it.",
        "source": "T24n1462_001:0678c16_35"
    },
    {
        "source_sentence": "過七年已復往乞食，其家人應曰：『食已竟，大德！",
        "translation": "After seven years have passed, he goes back to solicit alms again, and his family members should say, 'I've finished eating, Mañjuśrī!",
        "source": "T24n1462_001:0678c18_0"
    },
    {
        "source_sentence": "更往餘家。』",
        "translation": "I'll go to another house.'",
        "source": "T24n1462_001:0678c19_1"
    },
    {
        "source_sentence": "和伽婆念言：『今得語已，還。』",
        "translation": "Vātsīputrī thought, 'Now that I've heard your words, return.'",
        "source": "T24n1462_001:0678c19_2"
    },
    {
        "source_sentence": "於是婆羅門從餘處還，於路見和伽婆：『咄出家人！",
        "translation": "The Brāhmaṇa then returned from another place and saw Vātsīputrīya on the road, 'Duh, renunciant!",
        "source": "T24n1462_001:0678c20_0"
    },
    {
        "source_sentence": "從我家來耶？",
        "translation": "Did you come from my house?",
        "source": "T24n1462_001:0678c21_1"
    },
    {
        "source_sentence": "有所得不？』",
        "translation": "Is there something to be attained?'",
        "source": "T24n1462_001:0678c21_2"
    },
    {
        "source_sentence": "答曰：『得。』",
        "translation": "He replied, 'I'll get it.'",
        "source": "T24n1462_001:0678c21_3"
    },
    {
        "source_sentence": "婆羅門還至家中，而問家人：『比丘乞食，有與不耶？』",
        "translation": "The Brāhmaṇa returned home and asked his family members, 'Does the monk begging for food give it to him?'",
        "source": "T24n1462_001:0678c21_4"
    },
    {
        "source_sentence": "家人答曰：『都不與之。』",
        "translation": "The family replied, 'I won't give it to them.'",
        "source": "T24n1462_001:0679a01_5"
    },
    {
        "source_sentence": "婆羅門言：『比丘妄語，若明日來者我當詰問。』",
        "translation": "The Brāhmaṇa said, 'That monk speaks falsely; if he comes tomorrow, I'll interrogate and question him.'",
        "source": "T24n1462_001:0679a01_6"
    },
    {
        "source_sentence": "「明日門外坐，大德和伽婆明日來，婆羅門問曰：『大德！",
        "translation": "On the following day, he sat outside the door. The great virtuous monk Vakṣobhya came on the following day.",
        "source": "T24n1462_001:0679a02_7"
    },
    {
        "source_sentence": "昨言乞有所得。",
        "translation": "Yesterday, I said there's something to be gained from begging.",
        "source": "T24n1462_001:0679a03_8"
    },
    {
        "source_sentence": "定無所得，何以妄語？",
        "translation": "What's the reason for lying when there's no attainment of concentration?",
        "source": "T24n1462_001:0679a04_9"
    },
    {
        "source_sentence": "比丘法得妄語不？』",
        "translation": "Does the monk's teaching obtain false speech?'",
        "source": "T24n1462_001:0679a04_10"
    },
    {
        "source_sentence": "大德和伽婆答曰：『我往汝家七年，都無所得，昨始得家人語我更往餘家，是故言得。』",
        "translation": "The great virtuous monk Vātsīputra answered, 'I went to your house for seven years, but I didn't get anything; yesterday, I was told by my family to go to another house, which is why I said I got it.'",
        "source": "T24n1462_001:0679a05_11"
    },
    {
        "source_sentence": "婆羅門自思念言：『此比丘正得語，而言有所得。",
        "translation": "The brāhmaṇa thought to himself, “This bhikṣu has acquired the right speech by saying that he possesses it.",
        "source": "T24n1462_001:0679a07_12"
    },
    {
        "source_sentence": "善哉！",
        "translation": "Excellent, good!",
        "source": "T24n1462_001:0679a08_13"
    },
    {
        "source_sentence": "是知足人也，若得飲食者，便應大歡喜。』",
        "translation": "This is someone who knows they're satisfied, and if they get food and drink, they'll be overjoyed.'",
        "source": "T24n1462_001:0679a08_14"
    },
    {
        "source_sentence": "婆羅門即迴己飲食分，施與和伽婆，而作是言：『從今已去，日日於此取食。』",
        "translation": "The Brāhmaṇa then returned his portion of food and drink, gave it to Vātsīputrīya, and said, 'From now on, I'll take my food here day after day.'",
        "source": "T24n1462_001:0679a09_15"
    },
    {
        "source_sentence": "於是和伽婆日日恒往取食。",
        "translation": "That's why Vātsīputrīya always went there day after day to get food.",
        "source": "T24n1462_001:0679a11_16"
    },
    {
        "source_sentence": "婆羅門見和伽婆威儀具足，發大歡喜心，歡喜心已，復更請曰：『大德！",
        "translation": "Seeing that the Bhagavān was fully endowed with deportment, the Brāhmaṇa became overjoyed. Having become overjoyed, he again asked, 'O great virtuous one!",
        "source": "T24n1462_001:0679a11_17"
    },
    {
        "source_sentence": "自今以後莫餘家乞，長來此食。』",
        "translation": "From now on, don't beg at another house; come here for a long time to eat.'",
        "source": "T24n1462_001:0679a13_18"
    },
    {
        "source_sentence": "和伽婆默然受請。",
        "translation": "Vakṣobhya accepted the invitation by remaining silent.",
        "source": "T24n1462_001:0679a14_19"
    },
    {
        "source_sentence": "日日食已漸示佛法，示已而去。",
        "translation": "After he had eaten each day, he gradually showed the Buddha's teaching and departed after showing it.",
        "source": "T24n1462_001:0679a14_20"
    },
    {
        "source_sentence": "「爾時婆羅門子年始十六，已學婆羅門法三圍陀書。",
        "translation": "At the time, the Brāhmaṇa boy was sixteen years old and had studied the three Vedas of the Brāhmaṇa teachings.",
        "source": "T24n1462_001:0679a15_21"
    },
    {
        "source_sentence": "婆羅門子初從梵天下，猶好淨潔，床席、先提悉不與人雜。",
        "translation": "When he first came from the Brahma world, the Brāhmaṇa's son was still good-looking and clean, and neither his bed or seat nor any of his saṃgha were mixed with him.",
        "source": "T24n1462_001:0679a16_22"
    },
    {
        "source_sentence": "若欲往師所，以床席、先提，以白潔裹，懸置屋間而去。",
        "translation": "If you want to go to the teacher's place, wrap it in a bed, seat, saṃnti, white cloth, and hang it between the walls of your house and leave.",
        "source": "T24n1462_001:0679a18_0"
    },
    {
        "source_sentence": "去後大德和伽婆至，而作是念：『時今至矣！",
        "translation": "When the great virtuous monk Vakṣobhya arrived after his departure, he thought, 'The time has now come!'",
        "source": "T24n1462_001:0679a19_1"
    },
    {
        "source_sentence": "來往多年，此婆羅門子都不共語。",
        "translation": "For many years past and future, these Brāhmaṇas won't speak together.",
        "source": "T24n1462_001:0679a20_2"
    },
    {
        "source_sentence": "以何方便而化度之？』",
        "translation": "By what method will they be liberated?'",
        "source": "T24n1462_001:0679a21_0"
    },
    {
        "source_sentence": "即以神力，令家中床座隱蔽不見，唯見婆羅門子所舉先提。",
        "translation": "He then used his supernormal powers to make his home bed and seat disappear, but he saw only the saṃnti held up by the Brāhmaṇa's son.",
        "source": "T24n1462_001:0679a21_1"
    },
    {
        "source_sentence": "爾時，婆羅門見和伽婆來，遍求坐床了不能得，唯見其子所舉先提，即取與和伽婆坐。",
        "translation": "At the time, the Brāhmaṇa saw Vātsīputrī arriving and begged for a seat to sit on it but could not find it. Seeing only the saṃnti he had raised by his son, he took it and gave it to Vātsīputrī to him to sit.",
        "source": "T24n1462_001:0679a22_2"
    },
    {
        "source_sentence": "「婆羅門子還，見和伽婆坐其先提，見已心生忿怒，即問家人：『誰持我先提與沙門坐？』",
        "translation": "When the Brāhmaṇa returned, he saw that Vātsīputrīya was sitting in his saṃnti and became angry when he saw him.",
        "source": "T24n1462_001:0679a25_0"
    },
    {
        "source_sentence": "大德和伽婆食竟，婆羅門子瞋心已息。",
        "translation": "When the great virtuous monk had finished eating, the Brāhmaṇa's anger ceased.",
        "source": "T24n1462_001:0679a27_1"
    },
    {
        "source_sentence": "大德和伽婆語婆羅門子：『汝何所知？』",
        "translation": "The great virtuous Vātsīputra said to the Brāhmaṇa, 'What do you know?'",
        "source": "T24n1462_001:0679a28_0"
    },
    {
        "source_sentence": "婆羅門子：『咄沙門！",
        "translation": "The Brāhmaṇa said, 'Duh-shattering monk!",
        "source": "T24n1462_001:0679a28_1"
    },
    {
        "source_sentence": "我無所知，誰應知也？』",
        "translation": "I don't know anything, so who should know?'",
        "source": "T24n1462_001:0679a29_2"
    },
    {
        "source_sentence": "婆羅門子問和伽婆：『沙門知圍陀法不？』",
        "translation": "The Brāhmaṇa asked Vātsīputra, 'Does the ascetic know the way to wade?'",
        "source": "T24n1462_001:0679a29_3"
    },
    {
        "source_sentence": "問已，此沙門必知。",
        "translation": "After he asks, this ascetic will surely know.",
        "source": "T24n1462_001:0679b01_4"
    },
    {
        "source_sentence": "大德和伽婆於三圍陀中通達，及乾晝(漢言一切物名)、揩晝、伊底呵寫、文字，一切分別。",
        "translation": "The great virtuous Bhagavān comprehends the three Vedas, and he discerns them all in dry days (the names of all things in Chinese), daubled days, Īśyapa, and words.",
        "source": "T24n1462_001:0679b02_5"
    },
    {
        "source_sentence": "婆羅門子，於狐疑法不能通達。",
        "translation": "The Brāhmaṇa's children doubted the teaching and couldn't understand it.",
        "source": "T24n1462_001:0679b04_0"
    },
    {
        "source_sentence": "所以爾者，由師不解。",
        "translation": "That's because the teacher doesn't understand it.",
        "source": "T24n1462_001:0679b04_1"
    },
    {
        "source_sentence": "婆羅門子問和伽婆，於難解中問問盡答。",
        "translation": "The Brāhmaṇa asked Vātsīputrīya, who answered all the questions in the difficulty-to-understand section.",
        "source": "T24n1462_001:0679b05_2"
    },
    {
        "source_sentence": "和伽婆語婆羅門子：『汝問已多，我今次問汝一事，汝應當答。』",
        "translation": "Vātsīputrīya said to the Brāhmaṇa, 'You've asked many questions, so now I'll ask you one question, and you should answer it.'",
        "source": "T24n1462_001:0679b06_3"
    },
    {
        "source_sentence": "婆羅門子言：『善哉，沙門！",
        "translation": "The Brāhmaṇa said, 'Good, ascetic!",
        "source": "T24n1462_001:0679b07_4"
    },
    {
        "source_sentence": "我當分別答耶？』",
        "translation": "Will I answer separately?'",
        "source": "T24n1462_001:0679b08_5"
    },
    {
        "source_sentence": "和伽婆於雙心中，問婆羅門子：『若人心起而不滅，若人心滅而不起，若人心滅而滅，若人心起而起？』",
        "translation": "In their minds, the Bhagavān asked the Brāhmaṇa boy, 'If the mind arises and doesn't cease, if the mind ceases and doesn't arise, if the mind ceases and ceases, and if the mind arises and does arise?'",
        "source": "T24n1462_001:0679b08_6"
    },
    {
        "source_sentence": "於是婆羅門子，仰頭向虛空、下頭視地，不知所以，反諮沙門：『咄沙門！",
        "translation": "The Brāhmaṇa's son then looked up into the sky with his head facing upward and looked down at the ground, but didn't know why he did so, and asked the ascetic, 'Duh, ascetic!",
        "source": "T24n1462_001:0679b11_0"
    },
    {
        "source_sentence": "此是何義？』",
        "translation": "What's the meaning of this?'",
        "source": "T24n1462_001:0679b12_1"
    },
    {
        "source_sentence": "和伽婆答：『此是佛圍陀。』",
        "translation": "Vātsīputrīya replied, 'This is the Buddha's weed.'",
        "source": "T24n1462_001:0679b12_2"
    },
    {
        "source_sentence": "婆羅門子語：『大德得與我不？』",
        "translation": "The Brāhmaṇa said, 'Has the great virtuous man given it to me?'",
        "source": "T24n1462_001:0679b13_3"
    },
    {
        "source_sentence": "答曰：『得。』",
        "translation": "He replied, 'I'll get it.'",
        "source": "T24n1462_001:0679b14_4"
    },
    {
        "source_sentence": "復問：『云何可得？』",
        "translation": "Again, he asked, 'How can it be obtained?'",
        "source": "T24n1462_001:0679b14_5"
    },
    {
        "source_sentence": "答曰：『汝若出家，然後可得。』",
        "translation": "He answered, 'If you leave home, you'll be able to attain it later.'",
        "source": "T24n1462_001:0679b14_6"
    },
    {
        "source_sentence": "「於是婆羅門子心大歡喜，來到父母所而白言：『此沙門知佛圍陀，我欲就學，用白衣服沙門不與，令我出家然後當得。』",
        "translation": "The Brāhmaṇa's son, overjoyed, came to his parents and said, 'This ascetic knows that the Buddha Vedas want me to train, so I won't give it to the white-clad ascetic who doesn't give it to him; he will allow me to leave home and then I'll attain it.'",
        "source": "T24n1462_001:0679b15_7"
    },
    {
        "source_sentence": "父母作是念已：『善哉！",
        "translation": "After their parents had thought this, they said, 'Good!",
        "source": "T24n1462_001:0679b18_8"
    },
    {
        "source_sentence": "若汝出家學圍陀竟，當速還家。』",
        "translation": "If you leave home and finish training in Veda, you'll quickly return home.'",
        "source": "T24n1462_001:0679b18_9"
    },
    {
        "source_sentence": "婆羅門子心念言：『我就此沙門學佛圍陀竟者當還。』",
        "translation": "The Brāhmaṇa thought to himself, 'I'll return after this ascetic trains in the buddha-weeds.'",
        "source": "T24n1462_001:0679b19_10"
    },
    {
        "source_sentence": "臨欲去時父母教勅：『汝能懃學，當聽汝去。』",
        "translation": "When he was about to leave, his parents instructed him, 'If you can follow the rules of training, you must be allowed to leave.'",
        "source": "T24n1462_001:0679b20_11"
    },
    {
        "source_sentence": "答曰：『無暇教勅。』",
        "translation": "He answered, 'There's no time to teach and command.'",
        "source": "T24n1462_001:0679b21_12"
    },
    {
        "source_sentence": "「於是婆羅門子往詣和伽婆所。",
        "translation": "“Thereupon, the Brāhmaṇa went to Vātsīputrīya’s place.",
        "source": "T24n1462_001:0679b22_13"
    },
    {
        "source_sentence": "到已，和伽婆即取婆羅門子度為沙彌，以三十二禪定法教其思惟，婆羅門子須臾之頃得須陀洹道。",
        "translation": "When he arrived, Vakṣobhya then took the Brāhmaṇa's son and converted him into a novice, taught him his thoughts with the teaching of the thirty-two meditations, and in a moment, the Brāhmaṇa's son attained the stream entry path.",
        "source": "T24n1462_001:0679b22_14"
    },
    {
        "source_sentence": "和伽婆思念：『此婆羅門子已得道跡，不樂還家。",
        "translation": "Bhagavān thought, 'This Brāhmaṇa boy has already attained the path and doesn't want to return home.",
        "source": "T24n1462_001:0679b25_15"
    },
    {
        "source_sentence": "譬如燋穀不復更生，此沙彌亦復如是。』",
        "translation": "It's like a grain of millet that doesn't grow again, and so is this novice.'",
        "source": "T24n1462_001:0679b26_16"
    },
    {
        "source_sentence": "和伽婆復言：『若我與禪定深法，其得羅漢者恬靜而住，於佛法中不復更學。",
        "translation": "Again, Vakṣobhya said, 'Suppose I were to give the profound teaching of meditation to someone who attains arhatship and abides quietly and doesn't further train in the Buddha's teaching.",
        "source": "T24n1462_001:0679b27_17"
    },
    {
        "source_sentence": "我今遣其往詣栴陀跋闍所，教學佛法并宣我意。』",
        "translation": "Now, I'll send him to the place of Candrabhadra to teach the Buddha's teachings and explain my intentions.'",
        "source": "T24n1462_001:0679b29_18"
    },
    {
        "source_sentence": "和伽婆言：『善來沙彌！",
        "translation": "Vakṣobhya said, 'Well come, śrāmaṇer!",
        "source": "T24n1462_001:0679c01_19"
    },
    {
        "source_sentence": "汝可往彼大德栴陀跋闍所學佛法耶！",
        "translation": "Would you go to that buddha-dharma studied by the great virtuous Candrabhadra?",
        "source": "T24n1462_001:0679c01_20"
    },
    {
        "source_sentence": "汝到彼已，當作是言：「大德！",
        "translation": "When you arrived there, you should say this, Mañjuśrī!",
        "source": "T24n1462_001:0679c02_21"
    },
    {
        "source_sentence": "我師遣來此教學佛法。」』",
        "translation": "My teacher sent me here to teach the buddha-dharma.'",
        "source": "T24n1462_001:0679c03_22"
    },
    {
        "source_sentence": "栴陀跋闍答：『善哉沙彌！",
        "translation": "Bhadravardhana replied, 'Good, Sramana!",
        "source": "T24n1462_001:0679c04_0"
    },
    {
        "source_sentence": "明日當教帝須一切佛法及義，唯除律藏。』",
        "translation": "Tomorrow, he will teach the emperor that all the Buddha's teachings and doctrines are needed, except for the vinaya.'",
        "source": "T24n1462_001:0679c04_1"
    },
    {
        "source_sentence": "教學已竟受具足戒，未滿一歲即通律藏，於三藏中悉具足知。",
        "translation": "After finishing his teaching, he received the full set of precepts and was less than one year old when he mastered the vinaya, fully knowing them all in the Tripiṭaka.",
        "source": "T24n1462_001:0679c05_2"
    },
    {
        "source_sentence": "和尚阿闍梨，以一切佛法付帝須已，隨壽命長短入於涅槃。",
        "translation": "The monk and Ajari, having entrusted all the Buddha's teachings to the emperor, enter nirvāṇa according to the length of his life.",
        "source": "T24n1462_001:0679c07_0"
    },
    {
        "source_sentence": "爾時，帝須深修禪定，即得阿羅漢，以佛法教導一切人民。",
        "translation": "It was then that the emperor needed to deeply cultivate meditation, and he attained arhatship, teaching all the people with the Buddha's teaching.",
        "source": "T24n1462_001:0679c08_1"
    },
    {
        "source_sentence": "「爾時賓頭沙羅王生兒一百。",
        "translation": "At the time, King Piṇḍola gave birth to a hundred children.",
        "source": "T24n1462_001:0679c09_2"
    },
    {
        "source_sentence": "賓頭沙羅王命終，阿育王四年中殺諸兄弟，唯置同母弟一人。",
        "translation": "In the fourth year after the death of King Piṇḍola, King Aśoka killed his brothers and placed only one of them with their younger brothers.",
        "source": "T24n1462_001:0679c10_3"
    },
    {
        "source_sentence": "過四年已，然後阿育王自拜為王，從此佛涅槃已一百一十八年。",
        "translation": "After four years had passed, King Aśoka then prostrated himself as king, and it was one hundred and eighty-eight years after the Buddha’s nirvana at this place.",
        "source": "T24n1462_001:0679c12_0"
    },
    {
        "source_sentence": "後阿育王即統領閻浮利地，一切諸王無不降伏，王之威神，統領虛空及地下，各一由旬，阿耨達池諸鬼神，恒日日獻水八擔合十六器，以供王用。",
        "translation": "The king of Aśoka then ruled over Jambudvīpa, and all the kings would not fail to subdue him. His majestic spirit ruled over space and earth, one yojana in each direction; and the ghostly spirits at Anavatapta Lake offered water for the king’s use with an eight-carrying vessel of sixteen gallons of water every day on a regular basis.",
        "source": "T24n1462_001:0679c13_1"
    },
    {
        "source_sentence": "「爾時阿育王已信佛法，以水八器施比丘僧，二器施通三藏者，二器供王夫人，餘四器自供。",
        "translation": "It was then that King Aśoka had faith in the Buddha's teaching, gave eight vessels of water to the monks and nuns, two vessels to those who shared the Tripiṭaka, two vessels for the king's wife, and the other four vessels for himself.",
        "source": "T24n1462_001:0679c17_0"
    },
    {
        "source_sentence": "又雪山鬼神，日日獻楊枝木，名羅多，柔軟香美。",
        "translation": "Every day the snow-capped mountain spirits offered to them poplar branches and trees called sattvas, soft and fragrant with a delicate odor.",
        "source": "T24n1462_001:0679c19_1"
    },
    {
        "source_sentence": "王及夫人、宮中妓女，合一萬六千人，寺中比丘有六萬眾，常以楊枝恒日日供比丘僧，及王夫人宮中妓女，悉令備足。",
        "translation": "The king, his wife, and the courtesans in the palace were all gathered together of sixteen thousand people. Sixty thousand bhikṣus lived in the monastery; they provided daily almsfood to the bhikṣus and sangha members as well as the courtesans in the palace of the king’s wife and queen.",
        "source": "T24n1462_001:0679c20_2"
    },
    {
        "source_sentence": "復有雪山鬼神獻藥果，名阿摩勒呵羅勒，此果色如黃金，香味希有。",
        "translation": "Again, there was a spirit from the Himalayan Mountains who offered a medicinal fruit named amṛta-horala. The color of this fruit was like gold and its fragrance was rare.",
        "source": "T24n1462_001:0680a01_3"
    },
    {
        "source_sentence": "復有鬼神獻熟菴羅果。",
        "translation": "Again, there are ghosts and spirits who offer ripened grapes.",
        "source": "T24n1462_001:0680a02_4"
    },
    {
        "source_sentence": "復有鬼神，日日獻五種衣服，悉黃金色及手巾，又日日獻賢聖蜜漿，又獻塗香及闍提花。",
        "translation": "Every day another spirit offered five kinds of clothing, all golden in color and hand cloth, as well as the juice of holy honey from the wise and saintly gods and offering scented ointments and jṛhattika flowers.",
        "source": "T24n1462_001:0680a03_5"
    },
    {
        "source_sentence": "海龍王又獻名眼藥。",
        "translation": "The dragon king of the sea also offered a name-and-form eye medicine.",
        "source": "T24n1462_001:0680a05_6"
    },
    {
        "source_sentence": "阿耨達池邊，有自然粳米香美，鼠剝去皮取完全者，鸚鵡日日齎九十擔獻王。",
        "translation": "By the side of Anavatapta Lake there was a sweet scent of natural millet. The rats peeled off their skin to obtain the perfect grain, and every day the parrot carried ninety carriages to present it to the king.",
        "source": "T24n1462_001:0680a06_7"
    },
    {
        "source_sentence": "又巧作堂屋，中蜜蜂結房，作蜜以供王。",
        "translation": "He also skillfully constructed a hall, decorated with honey bees in the middle of it, and made honey to offer to the king.",
        "source": "T24n1462_001:0680a08_0"
    },
    {
        "source_sentence": "迦陵頻伽之鳥來至王所，作種種妙音以娛樂王。",
        "translation": "The kalaviṅka bird came to the king and made various wonderful sounds to entertain him.",
        "source": "T24n1462_001:0680a09_0"
    },
    {
        "source_sentence": "王有如是神力。",
        "translation": "The king had such miraculous powers.",
        "source": "T24n1462_001:0680a10_1"
    },
    {
        "source_sentence": "「又於一日，王作金鎖遣鎖海龍王將來。",
        "translation": "Again, on another day, the king made a gold chain and sent it to the sea dragon king who was about to come.",
        "source": "T24n1462_001:0680a10_2"
    },
    {
        "source_sentence": "此海龍王壽命一劫，曾見過去四佛。",
        "translation": "This naga king of the sea has a life span of one world age. He once saw the past buddhas of the four directions.",
        "source": "T24n1462_001:0680a11_3"
    },
    {
        "source_sentence": "龍王到已，賜坐師子座，以白傘覆上，種種香花供養。",
        "translation": "When the dragon king arrived, he was given a lion seat and covered it with a white umbrella to offer various kinds of incense and flowers.",
        "source": "T24n1462_001:0680a12_4"
    },
    {
        "source_sentence": "阿育王脫己所著瓔珞，瓔珞海龍王身，以一萬六千妓女圍遶供養。",
        "translation": "King Aśoka took off the necklace he wore and presented it to the dragon king Ocean of Necklaces, surrounded by 16,000 court ladies.",
        "source": "T24n1462_001:0680a13_5"
    },
    {
        "source_sentence": "阿育王語海龍王言：『我聞如來相好殊妙，我欲見之，汝可現之。』",
        "translation": "King Aśoka said to the sea dragon king, 'I've heard that the Tathāgata's features are so beautiful and marvelous that I want to see them; you can show them.'",
        "source": "T24n1462_001:0680a15_6"
    },
    {
        "source_sentence": "於是海龍王受教，即現神力，自變己身為如來形像，種種功德莊嚴微妙，有三十二大人之相、八十種好，譬如蓮花、欝波羅花開敷莊嚴水上，亦如星宿莊嚴虛空，青黃赤白種種光色，去身一尋以自莊嚴，譬如青虹，亦如電光圍遶而去，譬如金山，眾寶光明而圍遶之，一切眾生視之無厭，諸梵天龍夜叉乾闥婆等，於七日之中瞻仰目不暫捨。",
        "translation": "The dragon king of the sea, having received the instruction, manifested miraculous powers and transformed himself into the form of the Tathāgata in his own body, adorned with various virtues and subtleties. He possessed the thirty-two major marks and eighty kinds of beauty, such as lotus blossoms and camphor flowers blooming on the surface of water, like the constellations",
        "source": "T24n1462_001:0680a16_7"
    },
    {
        "source_sentence": "「阿育王見之歡喜。",
        "translation": "King Aśoka was delighted to see him.",
        "source": "T24n1462_001:0680a24_8"
    },
    {
        "source_sentence": "自從登位三年唯事外道，至四年中信心佛法。",
        "translation": "In the third year after he ascended the throne, he served non-Buddhist monks only, and in the fourth year he believed in Buddhism.",
        "source": "T24n1462_001:0680a25_9"
    },
    {
        "source_sentence": "王所以事外道者，時阿育王父賓頭沙羅王，本事外道，日日供施婆羅門六萬人，王與夫人宮內悉事外道，是故相承事之。",
        "translation": "The reason the king served the heretics was that King Aśoka's father, King Piṇḍola, who had formerly served the heretics, offered 60,000 brāhmaṇas day and day to each of them, and the king and his wife all served the heretics inside the palace; therefore, they served each other.",
        "source": "T24n1462_001:0680a26_10"
    },
    {
        "source_sentence": "有一日阿育王供設諸婆羅門，王於殿上坐，見諸婆羅門左右顧視都無法用。",
        "translation": "One day, King Aśoka offered food to the brāhmaṇas. When the king was seated in the palace, he saw that none of the brāhmaṇas looked around him and could not use it.",
        "source": "T24n1462_001:0680a29_11"
    },
    {
        "source_sentence": "王見如此而作是念：『我且更選試，必有法則者，我當供養。』",
        "translation": "Seeing this, the king thought, 'Now that I've selected and tested them again, there must be a rule for me to make offerings.'",
        "source": "T24n1462_001:0680b02_12"
    },
    {
        "source_sentence": "作是念已向諸臣言：『卿等！",
        "translation": "After he had this thought, he said to the ministers, 'You!",
        "source": "T24n1462_001:0680b03_13"
    },
    {
        "source_sentence": "若有事沙門婆羅門者，可請來我宮中，我當供施。』",
        "translation": "If someone serves the ascetic or priest, ask them to come to my palace, and I'll make an offering.'",
        "source": "T24n1462_001:0680b04_14"
    },
    {
        "source_sentence": "諸臣答曰：『善哉！』",
        "translation": "The ministers replied, 'Good!'",
        "source": "T24n1462_001:0680b05_15"
    },
    {
        "source_sentence": "答已各去。",
        "translation": "After answering, they each departed.",
        "source": "T24n1462_001:0680b05_16"
    },
    {
        "source_sentence": "「於是諸臣依其所事事尼揵陀等諸外道，各將至王宮，到已而白王言：『此是我等羅漢。』",
        "translation": "The ministers then relied on the non-Buddhists like Nirgrantha and others who served them, each went to the king's palace, arrived, and said to the king, 'This is our arhat.'",
        "source": "T24n1462_001:0680b06_0"
    },
    {
        "source_sentence": "是時阿育王，即敷施床座，高下精麁各各不同。",
        "translation": "King Aśoka then spread out a bed and seat, each different in height and depth.",
        "source": "T24n1462_001:0680b08_1"
    },
    {
        "source_sentence": "王語諸外道：『隨力所堪，各各當座而坐。』",
        "translation": "The king said to the non-Buddhists, 'Depending on their abilities, each of them will take their seats and sit down.'",
        "source": "T24n1462_001:0680b09_2"
    },
    {
        "source_sentence": "諸外道聞王此言，仍各自量而坐，或坐先提者，或坐木段者。",
        "translation": "When the non-Buddhist monks heard these words of the king, they each took their seats according to their measures, whether they were sitting on a front seat or a wooden cushion.",
        "source": "T24n1462_001:0680b10_3"
    },
    {
        "source_sentence": "王觀察如此，自作念曰：『此諸外道等定無法用。』",
        "translation": "Observing this, the king thought to himself, 'These non-Buddhists and so forth are definitely useless.'",
        "source": "T24n1462_001:0680b11_4"
    },
    {
        "source_sentence": "王即知已而作是言：『外道如此，不足供施。』",
        "translation": "Knowing this, the king then said, 'Such is insufficient for a non-Buddhist to make an offering like this.'",
        "source": "T24n1462_001:0680b12_5"
    },
    {
        "source_sentence": "食訖即令出。",
        "translation": "After he finishes his meal, he'll be allowed to leave.",
        "source": "T24n1462_001:0680b13_6"
    },
    {
        "source_sentence": "「又復一日，王於殿上，在窓牖中，見一沙彌，名泥瞿陀，從殿前過，行步平正威儀具足。",
        "translation": "“Furthermore, on another day, the king was in the hall when he saw a novice named Nirgrantha walking from the front of the hall through the windows and windows. His movements were even and his manner was dignified.",
        "source": "T24n1462_001:0680b14_7"
    },
    {
        "source_sentence": "王問：『此誰沙彌耶？』",
        "translation": "The king asked, 'Who is this śrāmaṇer?'",
        "source": "T24n1462_001:0680b16_8"
    },
    {
        "source_sentence": "左右答曰：『泥瞿陀沙彌，是先王長子修摩那之子也。』」",
        "translation": "The left and right answered, 'Nigupta-śrāmaṇer is the son of Ximena, the eldest son of the late king.'",
        "source": "T24n1462_001:0680b16_9"
    },
    {
        "source_sentence": "法師曰：「我今依次第說因緣。",
        "translation": "The teacher of the Dharma said, Now, I'll explain causes and conditions in order.",
        "source": "T24n1462_001:0680b17_10"
    },
    {
        "source_sentence": "爾時，賓頭沙羅王病困，阿育王從所封欝支國來還父王國，即殺修摩那太子，仍自把王國事。",
        "translation": "At the time, King Piṇḍola was ill and in distress, and King Aśoka came back to his father's kingdom from the enclosed country of Kauśinagara and killed Prince Sumeru, who still took charge of the affairs of the king's state.",
        "source": "T24n1462_001:0680b18_11"
    },
    {
        "source_sentence": "阿育王殺太子修摩那已，撿挍宮內。",
        "translation": "After King Aśoka killed the prince Xiumana, he picked him up and took him inside the palace.",
        "source": "T24n1462_001:0680b20_12"
    },
    {
        "source_sentence": "修摩那妃先已懷胎滿十月，仍假服逃出，去城不遠至栴陀羅村，村邊有樹名泥瞿陀，有一天人作此樹神。",
        "translation": "Formerly the queen, who had been pregnant for a full ten months, fled on her way out of the palace. Not far from the city, she went to the village of Gandhāra, where there was a tree called Nirgrantha by the side of the village. A goddess named Nirgrantha appeared and deified this tree.",
        "source": "T24n1462_001:0680b21_13"
    },
    {
        "source_sentence": "樹神見修摩那妃語言：『善來！』",
        "translation": "The tree goddess saw Xiumana and said, 'Good, coming!'",
        "source": "T24n1462_001:0680b24_14"
    },
    {
        "source_sentence": "妃聞樹神喚，即往至樹所。",
        "translation": "The queen heard the spirit of the tree calling her and went to the tree.",
        "source": "T24n1462_001:0680b24_15"
    },
    {
        "source_sentence": "樹神神力化作一屋，語妃曰：『汝可住此屋。』",
        "translation": "The tree spirit transformed it into a house and said to the queen, 'You may stay in this house.'",
        "source": "T24n1462_001:0680b25_16"
    },
    {
        "source_sentence": "妃聞語已即便入屋，其夜而生一男兒，母為作字名泥瞿陀。",
        "translation": "After hearing these words, the queen went into her room and gave birth to a boy named Nirgrantha.",
        "source": "T24n1462_001:0680b26_17"
    },
    {
        "source_sentence": "於是旃陀羅主敬心供給，如奴見大家無異。",
        "translation": "The lord of caṇḍāla then offered them with respect, just like a slave who sees the whole group without any difference.",
        "source": "T24n1462_001:0680b27_18"
    },
    {
        "source_sentence": "時王女妃住樹神屋中七年，泥瞿陀年已七歲。",
        "translation": "The king's queen was staying in the tree goddess's house for seven years, and Nirgrantha was seven years old.",
        "source": "T24n1462_001:0680b29_0"
    },
    {
        "source_sentence": "爾時有阿羅漢比丘，名婆留那，以神通觀泥瞿陀，因緣應度，作是念：『今時至矣。』",
        "translation": "It was then that an arhat monk named Vārāṇasī observed Nirgrantha with his supernormal powers and thought, 'Now is the time.'",
        "source": "T24n1462_001:0680c01_1"
    },
    {
        "source_sentence": "欲度為沙彌。",
        "translation": "He wanted to save him as a novice.",
        "source": "T24n1462_001:0680c03_0"
    },
    {
        "source_sentence": "即往詣妃所，求度為沙彌。",
        "translation": "He went to the queen's place and sought to be ordained as a novice.",
        "source": "T24n1462_001:0680c03_1"
    },
    {
        "source_sentence": "妃即與令度。",
        "translation": "The queen then gave him the order to save her.",
        "source": "T24n1462_001:0680c03_2"
    },
    {
        "source_sentence": "婆留那即度為沙彌，髮未落地即得羅漢。",
        "translation": "Vārāṇasī then passed away as a novice, and before he landed there, he attained arhatship.",
        "source": "T24n1462_001:0680c04_3"
    },
    {
        "source_sentence": "「又一日，沙彌料理裝束已，往詣師所供養已，取鉢盂袈裟往至母所，從城南入過殿前行出城東門。",
        "translation": "Again, on another day, after he had prepared his robes and went to the teacher's place to make offerings, the novice took his bowl and kaṣāya and went to his mother, entered the south of the city in front of the hall, and left the east gate of the city.",
        "source": "T24n1462_001:0680c05_4"
    },
    {
        "source_sentence": "爾時，阿育王在殿上向東經行，王見泥瞿陀沙彌於殿前過，威儀具足視地七尺而行，心中清淨。",
        "translation": "At the time, King Aśoka was walking eastward in the palace, and when he saw Nirgrantha ascetic pass by in front of the palace, his manner was so dignified that he looked seven feet away from the ground and walked, his mind pure and clear.",
        "source": "T24n1462_001:0680c07_5"
    },
    {
        "source_sentence": "此因緣已前說，今當廣說。",
        "translation": "These causes and conditions have already been spoken of previously. Now, they shall be spoken of elaborately.",
        "source": "T24n1462_001:0680c10_0"
    },
    {
        "source_sentence": "於是阿育王而作是念：『彼沙彌者，屈身俯仰威儀庠序，當有聖利法也。』",
        "translation": "The king of Aśoka then had this thought, 'That śrāmaṇer bends his body down and looks up in a dignified manner, which will have noble qualities for the benefit of the Dharma.'",
        "source": "T24n1462_001:0680c10_1"
    },
    {
        "source_sentence": "王見沙彌已信心歡喜，即發慈哀心。",
        "translation": "Seeing the novice, the king rejoiced in faith and immediately became compassionate.",
        "source": "T24n1462_001:0680c12_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1462_001:0680c13_3"
    },
    {
        "source_sentence": "過去世時，此沙彌是阿育王兄，曾共修功德。",
        "translation": "In a past life, this novice was the brother of King Aśoka and cultivated virtue together.",
        "source": "T24n1462_001:0680c13_4"
    },
    {
        "source_sentence": "「『往昔因緣故，　　今生復歡喜，",
        "translation": "'It was because of the causes and conditions of the past that I now rejoice again.",
        "source": "T24n1462_001:0680c14_5"
    },
    {
        "source_sentence": "　　譬如欝鉢花，　　得水鮮開敷。』",
        "translation": "It's like a bowl-shaped flower that obtains water and freshly blooms.'",
        "source": "T24n1462_001:0680c14_5"
    },
    {
        "source_sentence": "而作偈說：「於是阿育王，生慈悲已不能自止，即遣三臣往喚沙彌。",
        "translation": "He composed a verse, saying, After the king of Aśoka had shown compassion and couldn't stop himself, he sent three ministers to summon the śrāmaṇer.",
        "source": "T24n1462_001:0680c14_5"
    },
    {
        "source_sentence": "諸臣極久未時得還，復遣三臣。",
        "translation": "For a long time, the ministers hadn't returned at the right time, and they again sent three ministers.",
        "source": "T24n1462_001:0680c18_6"
    },
    {
        "source_sentence": "三臣到已，語沙彌言：『沙彌速去！』",
        "translation": "When the three ministers arrived, they said to the śrāmaṇer, 'Śrāmaṇer, go quickly!'",
        "source": "T24n1462_001:0680c19_7"
    },
    {
        "source_sentence": "於是沙彌，執持威儀安庠而來。",
        "translation": "That's when the śrāmaṇer, who was maintaining his demeanor and manner, came in.",
        "source": "T24n1462_001:0680c19_8"
    },
    {
        "source_sentence": "到已，王語沙彌：『當自觀察，隨意坐也。』",
        "translation": "When he arrived, the king said to the novice, 'Should you examine yourself and sit as you wish?'",
        "source": "T24n1462_001:0680c20_9"
    },
    {
        "source_sentence": "於是沙彌，觀看眾中都無比丘，沙彌知已，仍欲就白傘高座，而作方便令王受鉢。",
        "translation": "The novice then observed that there were no monks in the assembly. Knowing this, the novice still wanted to take a high seat under a white umbrella and made an effort to have the king accept the bowl.",
        "source": "T24n1462_001:0680c21_10"
    },
    {
        "source_sentence": "王見沙彌作方便已，心自念言：『此沙彌者必為家主。』",
        "translation": "Seeing the śrāmaṇer's skillful means, the king thought to himself, 'This śrāmaṇer must be the head of his family.'",
        "source": "T24n1462_001:0680c23_11"
    },
    {
        "source_sentence": "沙彌即以鉢授王已，即就王座。",
        "translation": "The novice then gave the bowl to the king and took his seat on the king's throne.",
        "source": "T24n1462_001:0680c24_12"
    },
    {
        "source_sentence": "王以己所食施與沙彌，沙彌自量取足而受。",
        "translation": "The king gave what he ate to the novice, who accepted it by measuring his own feet.",
        "source": "T24n1462_001:0680c25_13"
    },
    {
        "source_sentence": "沙彌食竟，於是王問沙彌：『沙彌師教，沙彌悉知不？』",
        "translation": "When the śrāmaṇer had finished eating, the king asked the śrāmaṇer, 'Is the śrāmaṇer's teacher teaching what the śrāmaṇer knows?'",
        "source": "T24n1462_001:0681a01_14"
    },
    {
        "source_sentence": "答曰：『我知少分。』",
        "translation": "He replied, 'I know a little bit.'",
        "source": "T24n1462_001:0681a02_15"
    },
    {
        "source_sentence": "王言：『善哉！",
        "translation": "The king said, 'Good!",
        "source": "T24n1462_001:0681a03_0"
    },
    {
        "source_sentence": "為我說之。』",
        "translation": "Explain it for me.'",
        "source": "T24n1462_001:0681a03_1"
    },
    {
        "source_sentence": "『善哉大王！",
        "translation": "'Good, great king!",
        "source": "T24n1462_001:0681a03_2"
    },
    {
        "source_sentence": "我當為說。』",
        "translation": "I will explain it for you.'",
        "source": "T24n1462_001:0681a03_3"
    },
    {
        "source_sentence": "「『不懈怠者是涅槃，　　若懈怠者是生死。』",
        "translation": "'That which is lazy is nirvāṇa, and that which is lazy is birth-and-death.'",
        "source": "T24n1462_001:0681a04_0"
    },
    {
        "source_sentence": "沙彌而作是念，量王所堪，即為說法呪願，便說半偈：「王聞已，向沙彌言：『我知已，但說令盡。』",
        "translation": "The śrāmaṇer had this thought, measured what the king was capable of, explained the dhāraṇī for him, and then spoke half a verse, After hearing it, the king said to the śrāmaṇer, 'I know it, but I'll explain it so that it's complete.'",
        "source": "T24n1462_001:0681a04_0"
    },
    {
        "source_sentence": "沙彌呪願已竟，王向沙彌言：『日供養八分。』",
        "translation": "After he had finished the śrāmaṇer's vow, the king said to the śrāmaṇer, 'Eight parts of the offering are offered each day.'",
        "source": "T24n1462_001:0681a07_1"
    },
    {
        "source_sentence": "沙彌答：『善哉！",
        "translation": "The novice replied, 'Good!",
        "source": "T24n1462_001:0681a08_2"
    },
    {
        "source_sentence": "我當迴與師。』",
        "translation": "I will return it to my teacher.'",
        "source": "T24n1462_001:0681a09_3"
    },
    {
        "source_sentence": "王問：『沙彌師是誰耶？』",
        "translation": "The king asked, 'Who is the śrāmaṇer?'",
        "source": "T24n1462_001:0681a09_4"
    },
    {
        "source_sentence": "答言：『無罪見罪呵責，是名我師。』",
        "translation": "He replied, 'There's no offense to be seen and blamed as a sin, which is called my teacher.'",
        "source": "T24n1462_001:0681a10_5"
    },
    {
        "source_sentence": "王言：『更與八分。』",
        "translation": "The king said, 'Give me another eight parts.'",
        "source": "T24n1462_001:0681a10_6"
    },
    {
        "source_sentence": "沙彌答：『善哉！",
        "translation": "The novice replied, 'Good!",
        "source": "T24n1462_001:0681a11_7"
    },
    {
        "source_sentence": "我當與阿闍梨。』",
        "translation": "I will give it to the ācārya.'",
        "source": "T24n1462_001:0681a11_8"
    },
    {
        "source_sentence": "王復問言：『闍梨是誰？』",
        "translation": "The king again asked, 'Who is this, ācārya?'",
        "source": "T24n1462_001:0681a11_9"
    },
    {
        "source_sentence": "答：『共於善法中教授令知，是我闍梨。』",
        "translation": "Answer: 'To teach them together in the good Dharma so they'll know it is my preceptor.'",
        "source": "T24n1462_001:0681a12_10"
    },
    {
        "source_sentence": "王復答言：『善哉！",
        "translation": "The king then replied, 'Good!",
        "source": "T24n1462_001:0681a13_11"
    },
    {
        "source_sentence": "我更與八分。』",
        "translation": "I'll give you another eight parts.'",
        "source": "T24n1462_001:0681a13_12"
    },
    {
        "source_sentence": "沙彌答：『此八分與比丘僧。』",
        "translation": "The śrāmaṇer answered, 'These eight parts are given to the monks and nuns.'",
        "source": "T24n1462_001:0681a13_13"
    },
    {
        "source_sentence": "王復問言：『比丘僧是誰？』",
        "translation": "The king again asked, 'Who is the monk or nun?'",
        "source": "T24n1462_001:0681a14_14"
    },
    {
        "source_sentence": "答言：『我師我闍梨我是依止，故得具足戒。』",
        "translation": "He replied, 'My teacher and my preceptor are the support for me, so I'll attain the full set of precepts.'",
        "source": "T24n1462_001:0681a15_15"
    },
    {
        "source_sentence": "王聞是已倍增歡喜，王語沙彌：『若爾我更與八分。』",
        "translation": "After hearing this, the king rejoiced even more and said to the novice, 'If that's the case, I'll give you another eight parts.'",
        "source": "T24n1462_001:0681a16_16"
    },
    {
        "source_sentence": "沙彌答言：『善哉！",
        "translation": "The novice replied, 'Good!",
        "source": "T24n1462_001:0681a17_17"
    },
    {
        "source_sentence": "受。』",
        "translation": "Accept it.'",
        "source": "T24n1462_001:0681a17_18"
    },
    {
        "source_sentence": "受已而去。",
        "translation": "After accepting it, he departed.",
        "source": "T24n1462_001:0681a17_19"
    },
    {
        "source_sentence": "「明日沙彌與比丘僧三十二人來至王宮，到已中食竟。",
        "translation": "“Tomorrow, the novice and thirty-two monks and bhikṣus came to the king’s palace. Having arrived there, they had completed their midday meal.",
        "source": "T24n1462_001:0681a17_20"
    },
    {
        "source_sentence": "王問沙彌：『更有比丘無？』",
        "translation": "The king asked the novice, 'Is there another monk?'",
        "source": "T24n1462_001:0681a19_21"
    },
    {
        "source_sentence": "沙彌答言：『有。』",
        "translation": "The novice replied, 'Yes.'",
        "source": "T24n1462_001:0681a19_22"
    },
    {
        "source_sentence": "『若有者更將三十二人來。』",
        "translation": "'If there are, I'll bring thirty-two more.'",
        "source": "T24n1462_001:0681a20_23"
    },
    {
        "source_sentence": "如是漸增乃至六萬。",
        "translation": "It gradually increases in this way up to 60,000.",
        "source": "T24n1462_001:0681a20_24"
    },
    {
        "source_sentence": "是時外道六萬徒眾失供養分。",
        "translation": "At the time, 60,000 non-Buddhist disciples lost the portion of their offerings.",
        "source": "T24n1462_001:0681a21_25"
    },
    {
        "source_sentence": "大德泥瞿陀即授王及宮內夫人諸臣，悉受三歸五戒。",
        "translation": "The great virtuous Nirgrantha then bestowed the three refuges and five precepts on the king and his palace ladies and ministers, who all received the three refuges and five precepts.",
        "source": "T24n1462_001:0681a21_26"
    },
    {
        "source_sentence": "是時王及諸人信心倍增，無有退轉。",
        "translation": "At the time, the king and his people's faith doubled, and there was no turning back.",
        "source": "T24n1462_001:0681a23_27"
    },
    {
        "source_sentence": "王為諸眾僧，起立大寺安處眾僧，乃至六萬日日供養。",
        "translation": "For the sake of the monks, the king built a large temple for them and placed it there to serve as an offering for 60,000 days.",
        "source": "T24n1462_001:0681a24_28"
    },
    {
        "source_sentence": "王所統領八萬四千國王，勅諸國起八萬四千大寺，起塔八萬四千，王勅諸國造立塔寺，各受王命歡喜而造。",
        "translation": "The king ruled over eighty-four thousand kingdoms and ordered the countries to build eighty-four thousand great temples and eighty-four thousand stūpas, and the king ordered the countries to build stupas and monasteries, each rejoicing in receiving the king's order.",
        "source": "T24n1462_001:0681a25_29"
    },
    {
        "source_sentence": "「復有一日於阿育僧伽藍作大布施，布施已，王於六萬比丘僧中坐，而作是言：『我有四種供給，湯藥、飲食、衣服、臥具，自恣與僧。』",
        "translation": "Again, there was another day when he made a great gift to the 60,000 monks and nuns of Aśoka Monastery, and after making the gift, the king sat among the 60,000 monks and nuns and said, 'I have four kinds of offerings, namely, hot water, medicine, food, clothing, bedding, and self-reliance for the saṃgha.'",
        "source": "T24n1462_001:0681a28_0"
    },
    {
        "source_sentence": "語已而作是問：『諸大德！",
        "translation": "After he said this, he asked, 'O great virtuous ones!",
        "source": "T24n1462_001:0681b02_1"
    },
    {
        "source_sentence": "佛所統領有幾種法耶？』",
        "translation": "How many kinds of dharmas are there that are led by the Buddha?'",
        "source": "T24n1462_001:0681b02_2"
    },
    {
        "source_sentence": "比丘答言：『支法有九，法聚有八萬四千。』",
        "translation": "The monks replied, 'There are nine factors of the Dharma, and there are 84,000 dharmas in the Dharma group.'",
        "source": "T24n1462_001:0681b03_3"
    },
    {
        "source_sentence": "王聞已，至心於法。",
        "translation": "Having heard this, the king paid close attention to the Dharma.",
        "source": "T24n1462_001:0681b04_4"
    },
    {
        "source_sentence": "王作是念：『我當立八萬四千寺，以供養八萬四千法聚。』",
        "translation": "The king thought, 'Should I establish 84,000 temples to make offerings to 84,000 dharmas?'",
        "source": "T24n1462_001:0681b04_5"
    },
    {
        "source_sentence": "即日出銀錢九十六億，而喚大臣。",
        "translation": "On that day, he produced ninety-six billion pieces of silver coin and summoned the minister.",
        "source": "T24n1462_001:0681b05_6"
    },
    {
        "source_sentence": "臣到已，王語臣言：『我所領八萬四千國，遣人宣令，國起一寺。』",
        "translation": "When the minister arrived, the king said to his ministers, 'I'll govern 84,000 countries and send someone to declare that a temple will be built in my country.'",
        "source": "T24n1462_001:0681b06_7"
    },
    {
        "source_sentence": "阿育王自作阿育王僧伽藍。",
        "translation": "King Aśoka himself made the monastic monastery of King Aśoka.",
        "source": "T24n1462_001:0681b08_8"
    },
    {
        "source_sentence": "「眾僧見阿育王欲起大寺，見已有一比丘，名因陀掘多，有大神力漏盡羅漢。",
        "translation": "When the saṃgha saw that King Aśoka wanted to build a large temple, they saw that there was already a monk named Indragupta with great supernormal powers who had ended the contaminants of the arhat.",
        "source": "T24n1462_001:0681b08_9"
    },
    {
        "source_sentence": "眾僧即差因陀掘多，統知寺事。",
        "translation": "The monks then sent Indragupta to supervise the affairs of the monastery.",
        "source": "T24n1462_001:0681b10_10"
    },
    {
        "source_sentence": "是時因陀掘多見寺有所闕短處，自以神力修治令辦，王出銀錢，羅漢神力三年乃成。",
        "translation": "When Indragupta saw that there was something missing in the monastery, he cultivated it with his own supernatural powers to make it possible for him to do so. The king produced silver coins and the temple was completed in three years by the supernatural powers of the arhat.",
        "source": "T24n1462_001:0681b11_11"
    },
    {
        "source_sentence": "諸國起寺來啟答王，一日俱到，白統臣言：『造塔寺已成。』",
        "translation": "The kings of the countries built temples and came to answer the questions, and when they arrived one day, they all said to the emperor, 'The stūpa has been completed.'",
        "source": "T24n1462_001:0681b13_12"
    },
    {
        "source_sentence": "統臣入白王言：『八萬四千國，起八萬四千寺塔，皆悉已成。』",
        "translation": "The ruler's ministers went in and said to the king, 'Eighty-four thousand countries built 84,000 temples and stūpas have all been completed.'",
        "source": "T24n1462_001:0681b14_13"
    },
    {
        "source_sentence": "王答言：『善哉！』",
        "translation": "The king answered, 'Good!'",
        "source": "T24n1462_001:0681b16_14"
    },
    {
        "source_sentence": "王語一大臣：『可打鼓宣令，寺塔已成，七日之後當大供養布施，國中一切內外人民，悉受八戒身心清淨。』",
        "translation": "The king said to one of his ministers, 'You may beat the drum and proclaim that the temple's stūpa has been completed, that seven days from now you will make great offerings and give alms, and that all the people inside and outside the country will receive the eight precepts so that their bodies and minds are pure.'",
        "source": "T24n1462_001:0681b16_15"
    },
    {
        "source_sentence": "過七日已，莊嚴擬赴王命，如天帝釋諸天圍遶，阿育王國土亦復如是，莊嚴竟，人民遊觀無有厭足，人民悉入寺舍。",
        "translation": "After seven days had passed, the adornments were prepared to go to the king's orders, just as Indra and the gods surrounded him with goddesses, so was the kingdom of King Aśoka's land when the adornments were completed, where the people traveled and observed without tire, and all the people entered the monastery.",
        "source": "T24n1462_001:0681b18_16"
    },
    {
        "source_sentence": "「爾時集眾，有八億比丘僧、九十六萬比丘尼，於集眾中羅漢一萬。",
        "translation": "At the time, there were 800 million monks and 960,000 bhikṣus and nuns in the assembly, and 10,000 arhats in the assembly.",
        "source": "T24n1462_001:0681b21_17"
    },
    {
        "source_sentence": "諸比丘僧心作是念：『我當以神通力令王得見己所造功德，見此已然後佛法大盛。』",
        "translation": "The monks and nuns thought, 'Should I use my supernormal powers to cause the king to see the merit he's created so that after seeing this, the Buddha's teaching will flourish?'",
        "source": "T24n1462_001:0681b23_18"
    },
    {
        "source_sentence": "諸比丘以神通力，王所統領閻浮利地，縱廣四萬乃至海際，其中所起塔寺，一切供養布施種種功德，使王一時覩見。",
        "translation": "Because of their supernormal powers, the monks led the king's command over Jambudvīpa, which was 40,000 miles long and 40,000 miles wide up to the limit of the sea, where they built stūpas and temples that were all offered as offerings and various merits, causing the king to see them at once.",
        "source": "T24n1462_001:0681b25_19"
    },
    {
        "source_sentence": "王得見已心中歡喜，而白眾僧言：『如我今者，供養如來作大布施，心中歡喜有如我不？』",
        "translation": "When the king saw this, he rejoiced in his heart and said to the saṃgha, 'Such as I am now, offering support to the Tathāgata makes a great gift, and my heart rejoices with such-and-such self?'",
        "source": "T24n1462_001:0681b27_20"
    },
    {
        "source_sentence": "於是眾僧，推目揵連子帝須令答王。",
        "translation": "The saṃgha then asked Maudgalyāyana, the prince of Mūryamuni, to answer the king.",
        "source": "T24n1462_001:0681b29_21"
    },
    {
        "source_sentence": "帝須答王言：『佛在世時諸人供養，不及於王，唯王一人無能過者。』",
        "translation": "The emperor answered the king, saying, 'When the Buddha was in the world, all the people who offered support to him weren't as good as the king, except for the king alone, who couldn't surpass him.'",
        "source": "T24n1462_001:0681c01_22"
    },
    {
        "source_sentence": "「王聞帝須此語，心中歡喜不斷，而作念言：『於佛法中作大布施，無與我等，我當受持佛法如子愛父，則無有狐疑。』",
        "translation": "When the king heard these words, he didn't stop rejoicing in his heart and thought, 'If you make a great gift of the Buddha's teaching but don't give it to us, then I will uphold the Buddha's teaching like a son who loves his father, so there won't be any doubt.'",
        "source": "T24n1462_001:0681c03_23"
    },
    {
        "source_sentence": "於是大王問比丘僧：『我於佛法中得受持不？』",
        "translation": "The great king then asked the monks and nuns, 'Did I receive and uphold the Buddha's teaching?'",
        "source": "T24n1462_001:0681c06_24"
    },
    {
        "source_sentence": "爾時帝須聞王語已，又見王邊王子，名摩哂陀，因緣具足，便作念：『若是王子得出家者，佛法極大興隆。』",
        "translation": "After hearing what the emperor had said, he also saw a prince by the king's side named Mahāprajāpaṇḍa, whose causes and conditions were complete, and he thought, 'If this prince leaves home, the Buddha's teaching will flourish so greatly.'",
        "source": "T24n1462_001:0681c07_25"
    },
    {
        "source_sentence": "念已而白王言：『大王！",
        "translation": "After he thought this, he said to the king, 'Great king!",
        "source": "T24n1462_001:0681c09_26"
    },
    {
        "source_sentence": "如此功德猶未入佛法，譬如有人從地積七寶上至梵天，以用布施，於佛法中亦未得入，況王布施而望得入！』",
        "translation": "Such merit still hasn't entered the Buddha's teaching, so it's like a person who accumulates seven treasures from the earth up to Brahmā Heaven and uses them to give alms, but they haven't yet entered the Buddha's teaching, so why wouldn't the king hope to enter because he gives alms?'",
        "source": "T24n1462_001:0681c10_27"
    },
    {
        "source_sentence": "王復問言：『云何得入法分？』",
        "translation": "The king again asked, 'How can you enter the Dharma part?'",
        "source": "T24n1462_001:0681c12_28"
    },
    {
        "source_sentence": "帝須答言：『若貧若富，身自生子，令子出家得入佛法。』",
        "translation": "The emperor must answer, 'If you're poor or wealthy, give birth to your own child so that he leaves home and enters the Buddha's teaching.'",
        "source": "T24n1462_001:0681c13_29"
    },
    {
        "source_sentence": "作是言已，王自念：『我如此布施，猶未入佛法，我今當求得入因緣。』",
        "translation": "After he said this, the king thought to himself, 'Such a gift of mine hasn't yet entered the Buddha's teaching; now I will seek the causes and conditions for entering it.'",
        "source": "T24n1462_001:0681c14_30"
    },
    {
        "source_sentence": "「王觀看左右見摩哂陀，而作是念：『我弟帝須已自出家。』",
        "translation": "The king looked around to see Mahāprajāpa and thought, 'My younger brother Indra must have left home himself.'",
        "source": "T24n1462_001:0681c16_31"
    },
    {
        "source_sentence": "即立摩哂陀為大子，王復籌量立為太子好？",
        "translation": "He then appointed Mahāprajāpa as the prince, and the king again considered him to be the prince's goodness.",
        "source": "T24n1462_001:0681c17_32"
    },
    {
        "source_sentence": "令出家好？",
        "translation": "It's good for causing someone to leave home?",
        "source": "T24n1462_001:0681c18_33"
    },
    {
        "source_sentence": "即語摩哂陀：『汝樂出家不？』",
        "translation": "He then said to Mahāprajāpatī, 'Are you happy to leave home?'",
        "source": "T24n1462_001:0681c19_34"
    },
    {
        "source_sentence": "摩哂陀見叔帝須出家後，心願出家，聞王此言心大歡喜，即答：『實樂出家。",
        "translation": "When Mahāprajāpa saw that Śubhavyūha had to leave home, he wished to leave home. Hearing these words of the king, Mahāprajāpaṇḍa was greatly delighted and answered, 'It's really pleasant to leave home.",
        "source": "T24n1462_001:0681c19_35"
    },
    {
        "source_sentence": "若我出家，王於佛法得入法分。』",
        "translation": "If I leave home, the king will attain the entry into the Dharma aspect of the Buddha's teaching.'",
        "source": "T24n1462_001:0681c21_36"
    },
    {
        "source_sentence": "爾時王女名僧伽蜜多，立近兄邊，其婿先已與帝須俱出家。",
        "translation": "It was then that the king's daughter named Saṃghāmitra stood near her brother, whose son-in-law had previously left home with Tissa.",
        "source": "T24n1462_001:0681c22_37"
    },
    {
        "source_sentence": "王問僧伽蜜多：『汝樂出家不？』",
        "translation": "The king asked Saṃghamitta, 'Are you happy to leave home?'",
        "source": "T24n1462_001:0681c23_38"
    },
    {
        "source_sentence": "答言：『實樂。』",
        "translation": "He replied, 'It's really pleasant.'",
        "source": "T24n1462_001:0681c24_39"
    },
    {
        "source_sentence": "王答：『若汝出家大善。』",
        "translation": "The king answered, 'If you leave home, it's great and good.'",
        "source": "T24n1462_001:0681c24_40"
    },
    {
        "source_sentence": "王知其心，心中歡喜向比丘言：『大德！",
        "translation": "Knowing his mind, the king rejoiced in his heart and said to the monk, 'O great virtuous one!",
        "source": "T24n1462_001:0681c25_41"
    },
    {
        "source_sentence": "我此二子，眾僧為度，令我得入佛法。』",
        "translation": "These two sons of mine are saved by the saṃgha, so that I can enter the Buddha's teaching.'",
        "source": "T24n1462_001:0681c26_0"
    },
    {
        "source_sentence": "善見律毘婆沙卷第一",
        "translation": "Shanjian lu vibhāṣa, vol. 1",
        "source": "T24n1462_001:0681c27_0"
    }
]