[
    {
        "source_sentence": "根本說一切有部毘奈耶雜事",
        "translation": "Mūlasarvâstivāda-vinaya miscellaneous matters",
        "source": "T24n1451_038:0396a06_0"
    },
    {
        "source_sentence": "卷第三十八",
        "translation": "卷第三十八",
        "source": "T24n1451_038:0396a07_0"
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yogâcārabhūmi in Sanskrit",
        "source": "T24n1451_038:0396a09_0"
    },
    {
        "source_sentence": "第八門第十子攝頌說涅槃之餘",
        "translation": "The rest of the eighth aspect, the tenth son's collection of verses explaining nirvāṇa",
        "source": "T24n1451_038:0396a10_0"
    },
    {
        "source_sentence": "爾時拘尸那城有出家外道名曰善賢(梵云蘇跋陀羅)，年百二十形容衰朽，俱尸那城所有壯士，於善賢處悉生恭敬，尊重供養如阿羅漢。",
        "translation": "At the time, there was a renunciant non-Buddhist named Shanxian (Sanskrit: Subhadra) in the city of Kuśinagara who was one hundred and twenty years old and described as decreasing, and all the strong men in Kuśinagara's city paid respect to him at Shanxian's place and honored him like an arhat.",
        "source": "T24n1451_038:0396a11_0"
    },
    {
        "source_sentence": "去斯不遠有大華池名曰曼陀枳爾，於池岸上有烏曇跋樹，善賢梵志常遊於此。",
        "translation": "Not far from the pond was a great flowering pond called Mantāṇeśvara, with an undergarbha tree on its shore. The brahmin Bhadrapāla always lived in this pond.",
        "source": "T24n1451_038:0396a13_1"
    },
    {
        "source_sentence": "往昔菩薩在覩史天，作白象狀入母胎時，彼烏曇樹華始新出，降誕之始漸有光色，為童子時其華欲發，厭老病死遠託山林，其華稍大狀如鵶嘴，修苦行時現萎萃相，捨苦行已氣息疎通噉諸飲食廣如前說，乃至成等正覺其華開敷。",
        "translation": "In the past, when the bodhisattva was in Kauśinagara Heaven and entered his mother's womb in the form of a white elephant, the flowers of that udumbara tree began to grow newly emerging, and they gradually became shiny when he descended into the sky. When he was a child, the flowers were about to bloom, disillusioned with old age, illness, death, and leaving for",
        "source": "T24n1451_038:0396a15_2"
    },
    {
        "source_sentence": "梵王來請於婆羅痆斯轉法輪時，其樹及華光色榮盛，妙香芬馥遍諸方界。",
        "translation": "When the Brahmā king came and invited him to turn the wheel of the Dharma in Vārāṇasī, that tree and its flowers flourished with color and luster, and their wonderful fragrance pervaded the worlds in all directions.",
        "source": "T24n1451_038:0396a21_3"
    },
    {
        "source_sentence": "然佛大悲普於有緣，所在世界廣濟度已，詣拘尸那為最後臥，而此華樹形色枯萃，見者驚歎。",
        "translation": "Still, the Buddha's great compassionate compassion extended everywhere to those with conditions, and after he had extensively liberated them in his world, he went to Kuśinagara as his last layman, where these flowers and trees withered in form and color, and those who saw them marveled.",
        "source": "T24n1451_038:0396a22_4"
    },
    {
        "source_sentence": "是時善賢觀斯變異而作是念：「拘尸那城必有凶禍。」",
        "translation": "Good men then observed these transformations and thought, There must be a bad misfortune in the city of Kuśinagara.",
        "source": "T24n1451_038:0396a24_5"
    },
    {
        "source_sentence": "爾時護國天神發大音聲告諸人曰：「今日如來於中夜時，必入無餘妙涅槃界。」",
        "translation": "It was then that the guardian goddess of the country spoke out in a loud voice to the people, Today, the Tathāgata will surely enter the marvelous nirvāṇa realm without remainder during the middle of the night.",
        "source": "T24n1451_038:0396a26_6"
    },
    {
        "source_sentence": "善賢梵志聞其說已，作如是念：「哀哉！",
        "translation": "After hearing what he said, the good and virtuous priest thought, Alas!",
        "source": "T24n1451_038:0396a27_7"
    },
    {
        "source_sentence": "苦哉！",
        "translation": "How painful!",
        "source": "T24n1451_038:0396a28_8"
    },
    {
        "source_sentence": "彼大沙門喬答摩氏，必於今夜當般涅槃。",
        "translation": "That great ascetic, the Gautama family, will surely attain parinirvāṇa tonight.",
        "source": "T24n1451_038:0396a28_9"
    },
    {
        "source_sentence": "然我每於自所得法有懷疑惑，常自思惟我於何時因何方便得見彼人諮啟未悟？",
        "translation": "However, whenever I had doubts about the teaching that I had attained, I always thought to myself, 'When and how did I get to see those people who consulted me but didn't understand?'",
        "source": "T24n1451_038:0396a29_10"
    },
    {
        "source_sentence": "惜哉！",
        "translation": "What a pity!",
        "source": "T24n1451_038:0396b02_11"
    },
    {
        "source_sentence": "法眼不久將滅。",
        "translation": "Soon, the Dharma eye will soon cease.",
        "source": "T24n1451_038:0396b02_12"
    },
    {
        "source_sentence": "今宜速往親自啟問。",
        "translation": "Now, it's better to quickly go there and personally ask questions.",
        "source": "T24n1451_038:0396b03_13"
    },
    {
        "source_sentence": "若蒙大悲垂哀為決，於諸猶豫永得開解。」",
        "translation": "If someone is given great compassion and pity for their resolve, they'll always be liberated from the hesitation.",
        "source": "T24n1451_038:0396b03_14"
    },
    {
        "source_sentence": "作是念已出拘尸那城詣雙林所。",
        "translation": "After he had this thought, he left the city of Kuśinagara and went to the twin forests.",
        "source": "T24n1451_038:0396b04_15"
    },
    {
        "source_sentence": "于時阿難陀見佛日將沒，在寺門外身心憂慼露地經行。",
        "translation": "Ānanda then saw that the Buddha was about to depart on the day, and he was outside the temple gates, his body and mind grieved as he walked out into the open air.",
        "source": "T24n1451_038:0396b05_16"
    },
    {
        "source_sentence": "善賢見已近而告曰：「汝阿難陀！",
        "translation": "Seeing this, Shanxian approached him and told him, You Ānanda!",
        "source": "T24n1451_038:0396b06_17"
    },
    {
        "source_sentence": "我聞沙門喬答摩具一切智，於諸眾生平等濟拔，然我每於自所得法有懷猶豫，比常希願聽受未聞竟不果遂。",
        "translation": "I've heard that the ascetic Gautama possesses omniscience and equally rescues all sentient beings, but every time I harbor hesitation about the teachings I've attained, I always wish to hear and accept them, but it won't be accomplished.",
        "source": "T24n1451_038:0396b07_18"
    },
    {
        "source_sentence": "今聞天聲遍告我等，如來今夜定入涅槃。",
        "translation": "Now, I've heard the sound of heaven telling us all that the Tathāgata will surely enter nirvāṇa tonight.",
        "source": "T24n1451_038:0396b09_19"
    },
    {
        "source_sentence": "大德頗能為我諮啟，容我面奉申述疑情。」",
        "translation": "The great virtuous man is quite capable of consulting me and allowing me to express my doubts face-to-face.",
        "source": "T24n1451_038:0396b10_20"
    },
    {
        "source_sentence": "阿難陀言：「善賢！",
        "translation": "Ānanda said, Good man!",
        "source": "T24n1451_038:0396b11_21"
    },
    {
        "source_sentence": "汝今不應作如是語故惱世尊，然我大師今見背痛未能安隱。」",
        "translation": "Now, you shouldn't say such a thing because it disturbs the Bhagavān, but now I, the great teacher, see that my back pain can't be peaceful.",
        "source": "T24n1451_038:0396b12_22"
    },
    {
        "source_sentence": "善賢如是再三諮啟，竟不為白。",
        "translation": "Shanxian thus repeatedly consulted him, but he didn't explain it.",
        "source": "T24n1451_038:0396b13_23"
    },
    {
        "source_sentence": "又告曰：「阿難陀！",
        "translation": "Again, he told them, Ānanda!",
        "source": "T24n1451_038:0396b14_24"
    },
    {
        "source_sentence": "我昔曾聞古仙梵志耆年有德軌範人說，諸佛出世如烏曇華，億百萬劫時乃一現。",
        "translation": "I've heard the ancient sage priest Jīvaka, a man of virtue and morality, say that the buddhas emerge in the world like the udumbara flower, appearing once every hundred million eons.",
        "source": "T24n1451_038:0396b14_25"
    },
    {
        "source_sentence": "如來今日定入涅槃，我懷迷惑願見諮問，唯希大德為我諮白，我得見佛誠為幸甚。」",
        "translation": "Today, the Tathāgata is about to enter nirvāṇa, and I'm confused and want to ask questions, but I only wish that the great virtuous one would consult me, and I'll be very fortunate to see the Buddha's sincerity.",
        "source": "T24n1451_038:0396b16_26"
    },
    {
        "source_sentence": "阿難陀告言：「善賢！",
        "translation": "Ānanda told him, Good man!",
        "source": "T24n1451_038:0396b18_27"
    },
    {
        "source_sentence": "今我大師身有乖違，甚不安隱勿故相惱。」",
        "translation": "Now, there's a discrepancy in my great teacher's body, so don't be disturbed by it.",
        "source": "T24n1451_038:0396b18_28"
    },
    {
        "source_sentence": "善賢再三如前苦請，尊者不允其志。",
        "translation": "Good and good, he repeatedly asked as before, but the venerable didn't agree with his wishes.",
        "source": "T24n1451_038:0396b19_29"
    },
    {
        "source_sentence": "阿難陀與善賢，於寺門外共言論時。",
        "translation": "Ānanda and Shanxian were talking outside the temple gates.",
        "source": "T24n1451_038:0396b20_30"
    },
    {
        "source_sentence": "佛以清淨耳超越人天，一一聞說，告阿難陀曰：「汝今不應遮彼善賢，任來見我隨其請問。",
        "translation": "The Buddha, transcending humans and gods by means of his pure ears, listened to each other’s explanations. He said to Ānanda: You should not deny the excellence of that good man. Why don’t you come and let me ask him questions?",
        "source": "T24n1451_038:0396b21_31"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1451_038:0396b23_32"
    },
    {
        "source_sentence": "此善賢者即是我於最後為外道說法令生正信，親命善來為我弟子。」",
        "translation": "This good man is the last time I taught the teaching for non-Buddhists to give rise to right faith and personally ordered Sunetra to be my disciple.",
        "source": "T24n1451_038:0396b23_33"
    },
    {
        "source_sentence": "于時善賢聞佛世尊慈悲容許，心生歡喜不勝抃躍，詣世尊所共申種種往復言談，却住一面白言：「喬答摩！",
        "translation": "When Shanxian heard the Buddha's compassionate tolerance of the Bhagavān, he became overjoyed and jumped for joy. He went to the Bhagavān to exchange various words with him, stood to one side, and said:",
        "source": "T24n1451_038:0396b25_34"
    },
    {
        "source_sentence": "我欲諮問願垂聽許為我解說。」",
        "translation": "I want to ask questions, so please listen and allow them to be explained for me.",
        "source": "T24n1451_038:0396b27_35"
    },
    {
        "source_sentence": "佛告梵志：「隨汝所問。」",
        "translation": "The Buddha told the priest, Follow what you ask.",
        "source": "T24n1451_038:0396b28_36"
    },
    {
        "source_sentence": "彼即問曰：「喬答摩！",
        "translation": "He then asked, Gautama!",
        "source": "T24n1451_038:0396b28_37"
    },
    {
        "source_sentence": "我曾遍觀諸外道類，各別立宗所謂：晡刺拏迦攝波子、末塞羯利瞿梨子、珊逝移毘刺知子、阿市多雞舍甘跋羅子、脚具陀迦多演那子、昵揭爛陀慎若低子，此等諸師各述異宗，未知誰是？」",
        "translation": "I've observed the various non-Buddhist types, each establishing a separate doctrine that says, 'These teachers each described different doctrines, but we don't know who they were.'",
        "source": "T24n1451_038:0396b29_38"
    },
    {
        "source_sentence": "「我年二十九，　　出家求善法；",
        "translation": "When I was twenty-nine years old, I renounced the householder’s life To seek the true Dharma.",
        "source": "T24n1451_038:0396c04_39"
    },
    {
        "source_sentence": "　又五十餘年，　　專行戒定慧。",
        "translation": "For more than fifty years he practiced exclusively morality, absorption, meditation, and wisdom.",
        "source": "T24n1451_038:0396c04_39"
    },
    {
        "source_sentence": "　一心無散亂，　　唯求於正理；",
        "translation": "With one mind, without distraction, They seek only the truth.",
        "source": "T24n1451_038:0396c04_39"
    },
    {
        "source_sentence": "　除斯真法外，　　無別有沙門。」",
        "translation": "Beyond this true teaching, there's no separate ascetic.",
        "source": "T24n1451_038:0396c04_39"
    },
    {
        "source_sentence": "爾時世尊即命善賢，為說伽他曰：爾時世尊說此頌已，復告善賢曰：「此是諸佛善說八聖道支，甚為希有難可值遇，除此已外欲求一、二、三、四沙門道果終無可得。",
        "translation": "It was then that the Bhagavān summoned Sunetra and said to him, After speaking this verse, the Bhagavān again addressed Sunetra, saying, These are the eight noble factors of the path well explained by the buddhas, which are rare and difficult to meet, and there's nothing to be obtained except for those who want to pursue one, two, three, or four ascetic paths other than these",
        "source": "T24n1451_038:0396c04_39"
    },
    {
        "source_sentence": "是故能於善說法律八聖道支求沙門果，必定當得。",
        "translation": "Therefore, if someone can pursue the fruit of asceticism in the eight noble factors of the path that are well-explained dharmas, they'll surely attain it.",
        "source": "T24n1451_038:0396c12_40"
    },
    {
        "source_sentence": "復次，善賢！",
        "translation": "Furthermore, good man!",
        "source": "T24n1451_038:0396c14_41"
    },
    {
        "source_sentence": "離八聖法，諸有外道婆羅門等各執己見，或說三世無因無果，所修福善皆空無益。",
        "translation": "Being free of the eight noble dharmas, there are non-Buddhist priests and brāhmaṇas who each hold their own view or say that the three worlds lack cause and effect, and all the goodness cultivated is empty and useless.",
        "source": "T24n1451_038:0396c14_42"
    },
    {
        "source_sentence": "是故我於沙門婆羅門眾中，大師子吼而作是言：『凡有修行皆獲果報。』」",
        "translation": "That's why I among the ascetics and priests in the assembly, the great philosophers roar and say, 'All who cultivate it will attain its fruit.'",
        "source": "T24n1451_038:0396c16_43"
    },
    {
        "source_sentence": "說此法時，善賢梵志遠塵離垢得法眼淨，於諸諦實得不壞信，超越愛河斷諸疑網，自然通達諸微妙法，即從座起整衣合掌，向阿難陀作如是語：「大師尊重事難諮請，我觀大德獲大善利，幸得值遇無上法王，於諸師中灌頂最上，由師力故我亦善證，我今重希於善說法律而為出家求受近圓，成苾芻性修沙門行。」",
        "translation": "When he preached this teaching, the good and virtuous brāhmaṇa obtained the eye of insight into the Dharma far removed from all defilement. Having attained unshakable faith in the truths, transcended the river of craving and cut off the web of doubt; having naturally mastered the subtle dharma by himself, he stood up from his seat, joined his palms in respect, and said to Ā",
        "source": "T24n1451_038:0396c17_44"
    },
    {
        "source_sentence": "時具壽阿難陀白佛言：「世尊！",
        "translation": "Kauṣṭhila Ānanda then said to the Buddha, Bhagavān!",
        "source": "T24n1451_038:0396c25_0"
    },
    {
        "source_sentence": "今此善賢聞法悟解，心樂出家廣如前說，乃至成苾芻性，唯願世尊哀愍拔濟。」",
        "translation": "Now, this good person who hears the teaching and understands it, happily leaves home with a mind that's as extensive as described above, up to becomes a monk, so may the Bhagavān have pity on him and rescue him.",
        "source": "T24n1451_038:0396c25_1"
    },
    {
        "source_sentence": "爾時世尊即告善賢：「善來苾芻，可修梵行。」",
        "translation": "It was then that the Bhagavān addressed Shanxian, Well-come monk, you may cultivate the religious practice.",
        "source": "T24n1451_038:0396c27_2"
    },
    {
        "source_sentence": "於佛言下如常威儀，出家近圓成苾芻性，一心勤勇不為放逸，作如是念：「善男子！",
        "translation": "Following the Buddha's words, he follows the usual manner, leaves home, becomes a monk who approaches perfection, is single-minded and diligent, doesn't act carelessly, and thinks, Good man!",
        "source": "T24n1451_038:0396c28_3"
    },
    {
        "source_sentence": "何故剃除鬢髮而披法服正信出家，於無上道而修梵行？",
        "translation": "Why do they shave their hair, don religious robes, correctly believe in the Dharma, leave home, and cultivate the religious practice on the unsurpassed path?",
        "source": "T24n1451_038:0397a01_4"
    },
    {
        "source_sentence": "於現法中得自證悟：我生已盡、梵行已立、所作已辦、不受後有。」",
        "translation": "In the present life, they'll attain self-realization: 'My birth has ended, my religious practice has been established, what I've done has been done, and I won't be subject to later existence.'",
        "source": "T24n1451_038:0397a02_5"
    },
    {
        "source_sentence": "爾時善賢起徹到心，即便速證阿羅漢果，得心解脫復作是念：「我今不忍見佛般涅槃，宜可先去。」",
        "translation": "It was then that Shanxian arose, penetrated his mind, quickly realized the fruit of arhatship, and attained mental liberation. Again, he thought, Now, I can't bear to see the Buddha attain parinirvāṇa; it's better to leave first.",
        "source": "T24n1451_038:0397a04_0"
    },
    {
        "source_sentence": "作是念已詣世尊所，頂禮雙足退坐一面，白佛言：「大德世尊！",
        "translation": "Having had this thought, he went to the Bhagavān, bowed his head and feet, withdrew to sit at one side, and said to the Buddha, Bhagavān!",
        "source": "T24n1451_038:0397a06_1"
    },
    {
        "source_sentence": "我願先入涅槃。」",
        "translation": "I wish to enter nirvāṇa first.",
        "source": "T24n1451_038:0397a08_2"
    },
    {
        "source_sentence": "佛告善賢：「汝於今者入涅槃耶？」",
        "translation": "The Buddha told Shanxian, Do you enter nirvāṇa now?",
        "source": "T24n1451_038:0397a08_3"
    },
    {
        "source_sentence": "答言：「如是。」",
        "translation": "He replied, So it is.",
        "source": "T24n1451_038:0397a09_4"
    },
    {
        "source_sentence": "再三顧問，佛言：「一切諸行皆悉無常，汝於所作自可知時，我更何言？」",
        "translation": "After repeatedly advising him, the Buddha said, All conditioned things are impermanent; what else can I say when you know for yourself what you've done?",
        "source": "T24n1451_038:0397a09_5"
    },
    {
        "source_sentence": "善賢將欲入滅而作是念：「我今應為五種加持方可滅度：諸來觀者皆見我身，剃除鬢髮著僧伽胝，莫令彼見外道儀式。",
        "translation": "Good men, just as they were about to enter nirvana, thought: I should now attain nirvana through five kinds of empowerment. All those who came to see me shaved off their hair and put on the saṃghâvaśeṣa robe so that they would not see the rituals of heretics.",
        "source": "T24n1451_038:0397a11_6"
    },
    {
        "source_sentence": "又諸外道來舁我時勿令身舉，同梵行者方能舁去。",
        "translation": "Also, when non-Buddhists come to attack me, don't let them lift their bodies; they're the same as religious practitioners who can only get rid of it.",
        "source": "T24n1451_038:0397a13_7"
    },
    {
        "source_sentence": "又入浴池洗我身時，令諸外道不得其底，同梵行者能洗我身。",
        "translation": "Also, when he enters a bathing pond to wash my body, he causes the non-Buddhist practitioners to attain its bottom and those who practice the same religious life can wash my body.",
        "source": "T24n1451_038:0397a15_8"
    },
    {
        "source_sentence": "又諸外道入水之時，當令魚鼈擾亂不安，同梵行者即無惱害。",
        "translation": "Also, when non-Buddhists enter water, they'll cause fish and turtles to be disturbed and unsettled, and those who practice the same religious life won't be harmed.",
        "source": "T24n1451_038:0397a16_9"
    },
    {
        "source_sentence": "又諸外道不能燒我遺身，同梵行者方令火著。」",
        "translation": "Also, non-Buddhists won't be able to burn my remains, and those who practice the same religious teachings will only cause the fire to burn them.",
        "source": "T24n1451_038:0397a17_10"
    },
    {
        "source_sentence": "作此五種加持念已便入涅槃。",
        "translation": "After he creates these five kinds of blessings, he'll enter nirvāṇa.",
        "source": "T24n1451_038:0397a19_0"
    },
    {
        "source_sentence": "時諸外道聞善賢梵志已入涅槃，將諸音樂幢旛傘蓋，詣拘尸那城，於四衢道告諸人曰：「汝等當知！",
        "translation": "When the non-Buddhist monks heard that the good and virtuous priest had entered nirvāṇa, they gathered their music banners, parasols, and umbrellas to go to the city of Kuśinagara and told the people in the four streets, You should know!",
        "source": "T24n1451_038:0397a19_1"
    },
    {
        "source_sentence": "彼大沙門喬答摩常作此語：『唯我法中有八支聖道四沙門果，外道中無，廣說如前，乃至作師子吼。』",
        "translation": "That great ascetic Gautama always said, 'There are only eight parts of the noble path in my teaching and four fruits of asceticism in non-Buddhist teachings that are explained in detail as before, even to the point where they make a lion's roar.'",
        "source": "T24n1451_038:0397a21_2"
    },
    {
        "source_sentence": "然我法中同梵行者大師善賢亦得涅槃，與彼何異？」",
        "translation": "Still, in my teaching, we're the same as the religious practitioner, and the great teacher Shanxian also attains nirvāṇa, so what's the difference between them?",
        "source": "T24n1451_038:0397a24_3"
    },
    {
        "source_sentence": "諸苾芻曰：「汝等若言是我徒侶，任自持去。」",
        "translation": "The monks said, If you say this is my companion, let's go on your own.",
        "source": "T24n1451_038:0397a25_4"
    },
    {
        "source_sentence": "而諸外道多人共舉竟不能動況能持去。",
        "translation": "Many non-Buddhist people raised it together but they couldn't move it, so why wouldn't they be able to carry it?",
        "source": "T24n1451_038:0397a26_5"
    },
    {
        "source_sentence": "苾芻告曰：「汝等不能，我等自舉。」",
        "translation": "The monks told them, You can't; we'll lift ourselves up.",
        "source": "T24n1451_038:0397a27_6"
    },
    {
        "source_sentence": "答曰：「可爾。」",
        "translation": "He replied, Yes.",
        "source": "T24n1451_038:0397a28_7"
    },
    {
        "source_sentence": "諸苾芻即共舉去，外道默然。",
        "translation": "The monks then lifted it together and departed, but the non-Buddhists remained silent.",
        "source": "T24n1451_038:0397a28_8"
    },
    {
        "source_sentence": "又諸外道來至浴池，諸苾芻曰：「今可為汝同梵行者洗浴其身。」",
        "translation": "Again, the non-Buddhist monks came to the bathing pond and the monks said, Now, you can wash and bathe your body for those religious practitioners who practice with you.",
        "source": "T24n1451_038:0397a29_0"
    },
    {
        "source_sentence": "彼入水時不得其底，又被魚鼈之所擾惱，苾芻不爾。",
        "translation": "When he enters the water, he doesn't get its bottom and is disturbed by fish and turtles, but the monk isn't like that.",
        "source": "T24n1451_038:0397b01_1"
    },
    {
        "source_sentence": "苾芻報曰：「此若是汝同梵行者，宜自焚燒。」",
        "translation": "The monks replied, If you're a fellow practitioner of the same religious practice as me, it's better to burn yourself.",
        "source": "T24n1451_038:0397b02_2"
    },
    {
        "source_sentence": "而諸外道以火焚燒竟不能著，苾芻然火遂便炎熾。",
        "translation": "The non-Buddhist monks were burned by the fire and couldn't touch it, but the monks were burned into a blazing fire that became too hot.",
        "source": "T24n1451_038:0397b03_3"
    },
    {
        "source_sentence": "時諸人眾共嗤外道，彼各懷慚低頭而去。",
        "translation": "The people then laughed at the non-Buddhist, and each of them with shame bowed their heads and departed.",
        "source": "T24n1451_038:0397b04_4"
    },
    {
        "source_sentence": "時拘尸那城諸壯士等，見此希奇於世尊處，倍生敬仰發淨信心，各懷戀慕作如是語：「大悲世尊為最後臥，現身有疾支節不安，尚能為彼善賢說法，令速證得阿羅漢果，復令拘尸那城諸壯士等皆獲善利。」",
        "translation": "When the strong men of Kuśinagara saw this marvelous place where the Bhagavān was lying, they all became doubly respectful and aroused pure faith, each withdrew in admiration and said, The Bhagavān Mahāprajñāpāramitā is the last to lie down; he's now sick and restless in body and limbs, yet he can still teach the Dharma for that good man",
        "source": "T24n1451_038:0397b05_5"
    },
    {
        "source_sentence": "時諸苾芻咸皆有疑，請世尊曰：「如來今時現身有疾支節不安，尚能令彼善賢梵志出生死海證阿羅漢，究竟涅槃盡諸苦際。」",
        "translation": "The monks then all had doubts, and they asked the Bhagavān, Now that the Tathāgata is sick in body and limbs are restless, he's still able to cause that good-natured brahmin to escape the ocean of birth and death and realize arhatship, ultimately nirvāṇa at the end of suffering.",
        "source": "T24n1451_038:0397b10_6"
    },
    {
        "source_sentence": "佛告苾芻：「汝等當知！",
        "translation": "The Buddha told the monks, You should know!",
        "source": "T24n1451_038:0397b13_7"
    },
    {
        "source_sentence": "此未希有，我今已斷根本三毒，解脫生老病死愁憂苦惱，具一切智，於諸境界得大自在，令彼善賢出生死海，得最後邊住涅槃處不足為難。",
        "translation": "Now that I have cut off the three fundamental poisons of birth, old age, illness, death, sorrow, pain, and vexation, possessed omniscience, attained great freedom in all spheres, caused those good men to leave the sea of birth and death, and attained the final state of nirvāṇa where it won't be difficult for me.",
        "source": "T24n1451_038:0397b13_8"
    },
    {
        "source_sentence": "我於往昔在生死中，具貪、瞋、癡，未斷生老病死憂悲苦惱，無有智慧能善思量，在傍生內尚能為彼善賢梵志，及拘尸那城諸壯士等自捨身命。",
        "translation": "In the past, I was in birth-and-death with craving, anger, and delusion, hadn't cut off birth, old age, illness, grief, sorrow, pain, and vexation, didn't have the wisdom to contemplate well, and was still able to give up my own life for those good brahmins and strong men of Kuśinagara who were among the unenlighten",
        "source": "T24n1451_038:0397b17_9"
    },
    {
        "source_sentence": "我為汝說，宜應諦聽！",
        "translation": "I will explain it for you. Listen attentively!",
        "source": "T24n1451_038:0397b20_10"
    },
    {
        "source_sentence": "「乃往昔時於大山澤，有一鹿王千鹿圍繞依林而住，有大智慧預識機宜。",
        "translation": "“In the distant past, there was a deer king surrounded by a thousand deer in a great swamp in a great mountain and living in a forest with great wisdom and insight.",
        "source": "T24n1451_038:0397b21_0"
    },
    {
        "source_sentence": "於所居處獵者來見，而往告王。",
        "translation": "At the place where he lived, a hunter came to see him and went there to tell the king.",
        "source": "T24n1451_038:0397b22_1"
    },
    {
        "source_sentence": "時王以兵周遍圍繞，鹿王作念：『我若不能救濟眾鹿，必被獵人之所屠害。』",
        "translation": "The king then surrounded them with an army, and the deer king thought, 'If I can't save the deer, they'll surely be slaughtered by a hunter.'",
        "source": "T24n1451_038:0397b23_2"
    },
    {
        "source_sentence": "爾時鹿王四顧瞻望而作是念：『我今作何方便，能令群鹿免斯苦厄？』",
        "translation": "It was then that the deer king looked around in all directions and thought, 'What method can I use now to help the animals escape this kind of suffering?'",
        "source": "T24n1451_038:0397b25_0"
    },
    {
        "source_sentence": "遂見深山下有澗水駛流出谷，諸鹿羸弱不能浮趒，鹿王入澗橫流而住，作大音聲普告群鹿：『汝等速來，可從此岸擲上我背趒於彼岸，必得存活。",
        "translation": "They then saw that deep below the mountain there was a stream of water running high and coming out of the valley, and the deer were too weak to float. The king deer entered the stream and stayed cross-riding in the stream. In a loud voice they said to the other deer, “Come quickly!",
        "source": "T24n1451_038:0397b26_1"
    },
    {
        "source_sentence": "若不爾者當遭屠害。』",
        "translation": "If you don't, you'll be slaughtered.'",
        "source": "T24n1451_038:0397b29_2"
    },
    {
        "source_sentence": "於是群鹿次第悉踏大鹿王脊，皆越駛河得離危難。",
        "translation": "The herd of deer then stepped on the backs of the great deer king in order, and they all crossed the river to escape danger.",
        "source": "T24n1451_038:0397c01_3"
    },
    {
        "source_sentence": "由諸群鹿蹄甲踐蹋，鹿王皮穿血肉皆盡唯餘脊骨，雖極苦痛心無退轉，悉令群鹿安隱得渡，仍懷顧戀誰未渡者？",
        "translation": "Because they tread on the feet of all the herds of deer, their flesh and blood pierced by the skin of the king deer, leaving only the remaining bones behind. Although it was so painful that they did not retreat, they caused the other deer to be able to cross over safely; but they still cherished the thought of those who hadn't yet crossed.",
        "source": "T24n1451_038:0397c02_4"
    },
    {
        "source_sentence": "於群鹿中有一鹿兒不能趒渡，爾時鹿王雖受極苦，尚懷哀念不顧自身，從水而出遂取鹿兒，置於脊上渡至彼岸。",
        "translation": "When there was a deer among the herd of deer that couldn't cross, the deer king Deer King, though suffering extreme pain, still had compassion for himself and didn't look around him. He emerged from the water, took the deer, placed it on his back, and crossed to the other shore.",
        "source": "T24n1451_038:0397c05_5"
    },
    {
        "source_sentence": "鹿王遍觀知渡盡已，氣力將竭臨命終時而發誓願：『我救群鹿及此鹿兒，救濟死厄不惜身命，願我當來得成無上正等覺時，令彼得渡生死羅網，置最後邊妙涅槃處。』」",
        "translation": "When the deer king pervasively observes and knows that he's crossed over, his energy is about to dry up and he makes a vow at the end of his life, saying, 'I save the animals and these deer children, rescue them from death and misfortune without sparing my life, and wish that in the future, when I attain unsurpassed perfect enlightenment, I will cause Peter to",
        "source": "T24n1451_038:0397c07_6"
    },
    {
        "source_sentence": "佛告諸苾芻：「汝意云何？",
        "translation": "The Buddha told the monks, What do you think?",
        "source": "T24n1451_038:0397c11_7"
    },
    {
        "source_sentence": "勿生異念。",
        "translation": "Don't give rise to different thoughts.",
        "source": "T24n1451_038:0397c12_8"
    },
    {
        "source_sentence": "往時鹿王者即我身是，其群鹿者拘尸那城諸壯士是，其鹿兒者即善賢是。",
        "translation": "The deer king of the past was me myself, while the group of deer were the strong men of Kuśinagara, and the fox boy was Shanxian.",
        "source": "T24n1451_038:0397c12_9"
    },
    {
        "source_sentence": "「又諸苾芻！",
        "translation": "Again, monks!",
        "source": "T24n1451_038:0397c14_0"
    },
    {
        "source_sentence": "如我無智在傍生內，喘息不安受諸苦毒，皮肉支節分解之時，救濟善賢令至無畏。",
        "translation": "It's like when I have no knowledge and live among the animals, panting and feeling painful and uncomfortable, and my flesh and bones disintegrate as I rescue good people and make them fearless.",
        "source": "T24n1451_038:0397c14_1"
    },
    {
        "source_sentence": "汝等善聽！",
        "translation": "You should listen attentively.",
        "source": "T24n1451_038:0397c16_2"
    },
    {
        "source_sentence": "乃往古昔婆羅痆斯時有國王名曰梵授，以法化世廣如經說。",
        "translation": "In the distant past, there was a king named Brahmadatta at the time of Vārāṇasī who transformed the world with the Dharma as explained in detail in the sūtras.",
        "source": "T24n1451_038:0397c16_3"
    },
    {
        "source_sentence": "王有智馬預知前事，隣國敬畏悉來朝貢。",
        "translation": "The king had a wise horse who foresaw the former affairs, and all the neighboring countries in respect and fear came to pay homage to him.",
        "source": "T24n1451_038:0397c17_4"
    },
    {
        "source_sentence": "馬既命終，時諸小王令使報曰：『汝梵授王今可輸稅分與我等，若不爾者不得出城。",
        "translation": "When the horse died, the kings of the lesser kingdoms ordered his messengers to report, “Your majesty, Brahmā, you should now pay us a portion of the tax. If you don’t do so, we won’t be allowed to leave the city.” The king said in reply:",
        "source": "T24n1451_038:0397c18_5"
    },
    {
        "source_sentence": "如見違者，我等同來破滅其國。』",
        "translation": "If you see someone who disagrees, we'll all come together to destroy their country.'",
        "source": "T24n1451_038:0397c20_6"
    },
    {
        "source_sentence": "王告使曰：『我不送稅亦不出城。』",
        "translation": "The king told his envoy, 'I won't send the tax, and I won't leave the city.'",
        "source": "T24n1451_038:0397c21_7"
    },
    {
        "source_sentence": "遂於國內訪求智馬，後於異處遂便獲得。",
        "translation": "He sought out a horse of wisdom in his own country and found it elsewhere.",
        "source": "T24n1451_038:0397c22_8"
    },
    {
        "source_sentence": "時屬春序卉木敷榮，群鳥和鳴甚可愛樂，王乘智馬將諸婇女遊適芳園歡娛受樂。",
        "translation": "At the time, it belonged to the spring season. The trees and shrubs were luxuriant and the sounds of birds singing harmoniously was very pleasurable. The king rode on a wise horse and his court ladies traveled to the pleasure grove to enjoy their happiness.",
        "source": "T24n1451_038:0397c23_9"
    },
    {
        "source_sentence": "時諸小王聞梵授王與諸臣佐及宮婇女，在外遊戲情無所懼，未即入城相與謀計，各嚴四兵至城門首。",
        "translation": "When the lesser kings heard that King Brahmadatta and his ministers and palace ladies were playing outside without fear, they didn't immediately enter the city to discuss it with him or plan it, and each of them gathered four armies at the head of the city gate.",
        "source": "T24n1451_038:0397c25_0"
    },
    {
        "source_sentence": "大臣白王：『諸小國王不恭朝命，敢興逆亂來扣城門，願見警備。』",
        "translation": "The ministers said to the king, 'The king of the small kingdoms who don't respect the imperial order dare to provoke rebellion and come to close the city gates, wishing to see the guards.'",
        "source": "T24n1451_038:0397c27_1"
    },
    {
        "source_sentence": "王既聞已勅索智馬：『速嚴四兵，我自討擊。』",
        "translation": "After hearing this, the king ordered Soghiyama, 'Quickly prepare four armies and I will attack it myself.'",
        "source": "T24n1451_038:0397c28_2"
    },
    {
        "source_sentence": "時王乘馬嚴兵誓眾共彼鬪戰，王恃威力獨處先鋒，遂被賊軍以槊中馬，腸胃皆出受諸楚毒，眾苦難堪形命無幾，仍作是念：『王遭困厄，我若不救是所不應，宜忍苦楚令王免厄，得至城門到無畏處。』",
        "translation": "The king then rode his horse and armed his troops, vowing to fight with them, and the king relied on his mighty strength to be alone at the frontline, so he was captured by a thief's army and put on a horse; his intestines and stomach were all painful and vexed, and there were so many hardships that their form and life were short that they still thought, 'The king",
        "source": "T24n1451_038:0397c29_3"
    },
    {
        "source_sentence": "作是念已周迴顧望無入城路，然此城外有大浴池名曰妙梵，近王宮闕，於其池中有四蓮華，青黃赤白皆悉遍滿。",
        "translation": "After he had this thought, he looked around the city and saw that there was no way to enter it, but there was a large bathing pond outside the city called Marvelous Brahmā, near the palace of the king. Inside the pond were four lotus blossoms, blue, yellow, red, and white, all pervading it.",
        "source": "T24n1451_038:0398a05_4"
    },
    {
        "source_sentence": "于時智馬不顧身命，騰躍池中踐荷葉上，負王渡難直入宮中。",
        "translation": "The wise horse then, disregarding his body and life, jumped up and down in the pond and trampled on a lotus leaf, carrying the king's difficulty of crossing straight into the palace.",
        "source": "T24n1451_038:0398a07_5"
    },
    {
        "source_sentence": "時王纔下，馬便命絕。",
        "translation": "As soon as the king descended, his horse died.",
        "source": "T24n1451_038:0398a09_6"
    },
    {
        "source_sentence": "時諸小王競入園林，處處尋覓竟不能得，迴軍劫掠各還本居。",
        "translation": "The lesser kings then rushed into the grove, searched everywhere but couldn't find it, and each returned to their original abode with a retreating army of robbers.",
        "source": "T24n1451_038:0398a09_7"
    },
    {
        "source_sentence": "時梵授王既免危厄得存性命，告婆羅痆斯諸大臣等及眾人曰：『若有能救剎帝利灌頂大王命者如何恩賞？』",
        "translation": "After King Brahmadatta had escaped danger and obtained the vitality to preserve his life, he told the ministers of Vārāṇasī and others and the crowd, 'If you can save the lives of the consecrated great king Śāriputra, what's the reward for kindness?'",
        "source": "T24n1451_038:0398a11_8"
    },
    {
        "source_sentence": "諸臣白王：『可分半國。』",
        "translation": "The ministers said to the king, 'We can divide half a kingdom into two.'",
        "source": "T24n1451_038:0398a13_9"
    },
    {
        "source_sentence": "王曰：『此之智馬能全我命，馬今既死欲何以報？』",
        "translation": "The king said, 'This wise horse will be able to fulfill my life, so why would I want to repay it now that he's dead?'",
        "source": "T24n1451_038:0398a14_10"
    },
    {
        "source_sentence": "諸臣答言：『應為智馬，於城四門宜作非時白蓮華會，廣行惠施盛修福業以資魂路。』",
        "translation": "The ministers replied, 'Should you be a horse of wisdom that makes it advisable to hold an untimely white lotus assembly at the four gates of the city and extensively practice generosity and cultivate meritorious actions to support the path of soul?'",
        "source": "T24n1451_038:0398a15_11"
    },
    {
        "source_sentence": "王言：『甚善！",
        "translation": "The king said, 'Very good!",
        "source": "T24n1451_038:0398a17_12"
    },
    {
        "source_sentence": "宜時疾作。』",
        "translation": "It's better to do it quickly at the right time.'",
        "source": "T24n1451_038:0398a17_13"
    },
    {
        "source_sentence": "時王即令太子中宮婇女臣佐使民莊嚴衢路，布列香華幡蓋明燈，在處懸設無不充滿，如歡喜園甚可愛樂。",
        "translation": "The king then ordered the prince's court ladies, ministers, assistants, and people to adorn the streets with fragrant flowers, banners, canopies, and bright lamps, hanging everywhere, filling them up like the joyful park, which was very pleasing.",
        "source": "T24n1451_038:0398a17_14"
    },
    {
        "source_sentence": "王令擊鼓宣告遠近：『我於明日欲為智馬於城四門營建非時白蓮華會，宜可告知集法場所受我供養。』",
        "translation": "The king ordered him to beat the drum and announce from near and far, 'Tomorrow, I want to build an untimely white lotus assembly for Zhi horse at the four gates of the city in order to make offerings to me at the site of the assembly.'",
        "source": "T24n1451_038:0398a20_0"
    },
    {
        "source_sentence": "時至雲集，隨須給與普令稱意。",
        "translation": "When the time came, they gathered in clouds and gave whatever they needed to make sure he would praise them.",
        "source": "T24n1451_038:0398a22_1"
    },
    {
        "source_sentence": "汝等苾芻於意云何？",
        "translation": "What do you monks think?",
        "source": "T24n1451_038:0398a23_2"
    },
    {
        "source_sentence": "彼時智馬即我身是，我為彼王受諸苦楚，身形分解不顧身命，尚能救濟令離危厄。」",
        "translation": "That wise horse at the time was me, and I suffered all kinds of pain for that king; my body disintegrated without concern for my life, but I can still save them from danger and distress.",
        "source": "T24n1451_038:0398a23_3"
    },
    {
        "source_sentence": "時諸苾芻又復有疑，請世尊曰：「大德！",
        "translation": "The monks then again had doubts, and asked the Bhagavān, Mañjuśrī!",
        "source": "T24n1451_038:0398a26_0"
    },
    {
        "source_sentence": "具壽善賢先作何業？",
        "translation": "What action did Guoshou Shanxian do first?",
        "source": "T24n1451_038:0398a26_1"
    },
    {
        "source_sentence": "今為大師最後弟子。」",
        "translation": "Now, I'm the last disciple of the great teacher.",
        "source": "T24n1451_038:0398a27_2"
    },
    {
        "source_sentence": "佛告諸苾芻：「汝等當知！",
        "translation": "The Buddha told the monks, You should know!",
        "source": "T24n1451_038:0398a27_3"
    },
    {
        "source_sentence": "自所作業今還自受，廣如餘處乃至說頌。",
        "translation": "The action which is self-manifesting, is now also self-accompanied: as extensively as in other sources up to being spoken of in verse.",
        "source": "T24n1451_038:0398a28_4"
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T24n1451_038:0398a29_5"
    },
    {
        "source_sentence": "乃往古昔此賢劫中人壽二萬歲時，有佛出世名迦攝波十，號具足，在婆羅痆斯仙人墮處施鹿林中。",
        "translation": "In ancient times, when the human life span was twenty thousand years in this world age of the wise, a buddha named Kāśyapa (10) appeared in the world. His name was Puṣkarasārin and he fell into the Deer Preserve to the holy man Vārāṇasī.",
        "source": "T24n1451_038:0398a29_6"
    },
    {
        "source_sentence": "時彼如來、應、正等覺，有外孫子名曰無憂，求解脫故而為出家，謂解脫果自然可得，於八正道而不勤修，經歷多時竟無果證，遊行人間隨處作夏。",
        "translation": "At the time, that Tathāgata, Arhat, and Completely Awakened One had an external grandson named Wu sorrowless who left home because he sought liberation, meaning that the fruit of liberation can naturally be attained without diligent cultivation of the eightfold right path, but after a long period of time, he didn't realize it, traveled among the people everywhere for the summer.",
        "source": "T24n1451_038:0398b02_7"
    },
    {
        "source_sentence": "時彼如來有緣皆度，所作已辦如薪盡火滅，於其中夜將入涅槃。",
        "translation": "The Tathāgata then had a reason to save them all, and what he did was like firewood that goes out and the fire goes out, and he's about to enter nirvāṇa there at night.",
        "source": "T24n1451_038:0398b06_8"
    },
    {
        "source_sentence": "時彼苾芻在無憂樹下，而此樹神聞迦攝波如來當般涅槃，悲泣雨淚霑無憂身。",
        "translation": "That monk was then under the tree of no sorrow, and the deity of that tree heard that Kāśyapa Tathāgata was about to enter parinirvāṇa, weeping with pity and raining tears for his body without sorrow.",
        "source": "T24n1451_038:0398b07_9"
    },
    {
        "source_sentence": "苾芻仰觀問其神曰：『有何所以如是悲啼？』",
        "translation": "The monk looked up and asked the god, 'What's the reason for such a sorrowful wailing?'",
        "source": "T24n1451_038:0398b09_10"
    },
    {
        "source_sentence": "樹神對曰：『今日中夜迦攝波佛將入涅槃。』",
        "translation": "The tree gods replied, 'Tonight, Kāśyapa Buddha is about to enter nirvāṇa.'",
        "source": "T24n1451_038:0398b10_11"
    },
    {
        "source_sentence": "時彼苾芻聞如是語，情懷痛切如箭入心，悲啼號哭發聲大喚。",
        "translation": "When that monk hears these words, his feelings are as painful as when an arrow enters his heart, and he cries out in sorrow and wails aloud.",
        "source": "T24n1451_038:0398b11_12"
    },
    {
        "source_sentence": "樹神問曰：『何故悲啼？』",
        "translation": "The tree god asked, 'Why are you crying in sorrow?'",
        "source": "T24n1451_038:0398b12_13"
    },
    {
        "source_sentence": "對曰：『迦攝波如來、應、正等覺是我親舅，我雖依附而不勤修，去此既遠難申禮敬，我是凡夫無力速往，是以悲哭。』",
        "translation": "He replied, 'The Kāśyapa Tathāgata, Arhat, and Perfectly Enlightened One are my relatives and uncles, and even though I rely on them but don't diligently cultivate them, it's hard to pay respect to them because they're so far away from here; I'm a worldling who doesn't have the strength to quickly go there, so I weep with pity.",
        "source": "T24n1451_038:0398b13_14"
    },
    {
        "source_sentence": "樹神報曰：『然我有力令仁疾至，不知見佛得有益不？』",
        "translation": "The tree gods replied, 'Suppose I'm powerful enough to cause you to arrive quickly, but I don't know if seeing the Buddha will be helpful.'",
        "source": "T24n1451_038:0398b15_15"
    },
    {
        "source_sentence": "苾芻報曰：『我極勇猛，若見佛者必能依行證獲果利。』",
        "translation": "The monks replied, 'I'm so courageous that if I see the Buddha, I'll surely be able to rely on my practice to realize its fruition.'",
        "source": "T24n1451_038:0398b16_16"
    },
    {
        "source_sentence": "是時樹神以神通力，將此苾芻疾至佛所。",
        "translation": "The tree god then, using his supernormal powers, took this monk to the Buddha's place because he was ill.",
        "source": "T24n1451_038:0398b18_17"
    },
    {
        "source_sentence": "既見佛已發清淨心起廣大願，時彼如來隨其根性，為說妙法證阿羅漢果，不忍見佛入般涅槃，是故於先而取滅度。",
        "translation": "Having seen the Buddha, he arouses a pure mind and gives rise to a vast vow, then the Tathāgata follows his faculties and nature in order to explain the marvelous teaching for the realization of the fruit of the arhat, doesn't tolerate seeing the Buddha enter parinirvāṇa, and therefore takes extinction first.",
        "source": "T24n1451_038:0398b19_18"
    },
    {
        "source_sentence": "時彼樹神既見世尊及苾芻涅槃已，情懷戀慕作如是念：『今此具壽所獲勝利皆由我得，以此功德願我來世迦攝波佛所授摩納婆記，人壽百歲得成正覺號釋迦牟尼，彼涅槃時，我得聲聞無學果已在先滅度。』」",
        "translation": "When that tree god saw the Bhagavān and the monks in nirvāṇa, he cherished feelings of affection and thought, 'Now, these benefits gained by longevity are all obtained by me; with this merit, may I attain the Manabha assurance given to me by Kāśyapa Buddha in the future lifetime by a man called Śākyamuni, who will become perfectly enlightened when",
        "source": "T24n1451_038:0398b21_19"
    },
    {
        "source_sentence": "佛告諸苾芻：「於汝意云何？",
        "translation": "The Buddha told the monks, What do you think?",
        "source": "T24n1451_038:0398b26_20"
    },
    {
        "source_sentence": "時天神者今善賢是。",
        "translation": "The god of the time is now Shanxian.",
        "source": "T24n1451_038:0398b27_21"
    },
    {
        "source_sentence": "由是義故，於一切時遠離惡友近善知識，應如是學。」",
        "translation": "Because of this meaning, they should thus train at all times to be far removed from bad friends and near good teachers.",
        "source": "T24n1451_038:0398b27_22"
    },
    {
        "source_sentence": "時阿難陀白佛言：「世尊！",
        "translation": "Ānanda then said to the Buddha, Bhagavān!",
        "source": "T24n1451_038:0398b29_0"
    },
    {
        "source_sentence": "我於靜處作如是念：『善知識者是半梵行，諸修行者由善友力方能成辦，得善友故遠離惡友，以是義故方知善友是半梵行。』」",
        "translation": "In a quiet place, I thought, 'Good friends are half the religious practice, and it's because of the power of good friends that practitioners can accomplish it; because they attain good friends, they're far removed from bad friends; this is why they know that good friends are half the religious practice.'",
        "source": "T24n1451_038:0398b29_1"
    },
    {
        "source_sentence": "佛言：「阿難陀勿作是語：『善知識者是半梵行。』",
        "translation": "The Buddha said, Ānanda, don't say this, 'Good friends are halfway through religious practice.'",
        "source": "T24n1451_038:0398c03_2"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1451_038:0398c04_3"
    },
    {
        "source_sentence": "善知識者是全梵行，由此便能離惡知識，不造諸惡常修眾善，純一清白具足圓滿梵行之相。",
        "translation": "A good friend is the whole religious practice, which enables him to part with bad friends, not create evil and always cultivate goodness, purely one that's pure and white and complete with the characteristics of the religious practice.",
        "source": "T24n1451_038:0398c04_4"
    },
    {
        "source_sentence": "由是因緣若得善伴與其同住，乃至涅槃事無不辦，故名全梵行。",
        "translation": "Because of these causes and conditions, if they attain good companionship and live together with them, there's nothing that doesn't accomplish the task of nirvāṇa, so it's called the whole religious practice.",
        "source": "T24n1451_038:0398c06_5"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1451_038:0398c08_6"
    },
    {
        "source_sentence": "阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_038:0398c08_7"
    },
    {
        "source_sentence": "我由善知識故，令諸有情於生老病死憂悲苦惱皆得解脫，若離善友無如是事。",
        "translation": "Because of my good friends, I cause sentient beings to attain liberation from birth, old age, illness, death, grief, sorrow, pain, and vexation, and if they part with good friends, there's no such thing.",
        "source": "T24n1451_038:0398c08_8"
    },
    {
        "source_sentence": "阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_038:0398c10_9"
    },
    {
        "source_sentence": "於我所說應勤修學。」",
        "translation": "You should diligently cultivate what I teach.",
        "source": "T24n1451_038:0398c10_10"
    },
    {
        "source_sentence": "爾時佛告諸苾芻曰：「由是義故，從今已去不應輒度外道出家并受近圓，除釋迦種及事火留髻外道。",
        "translation": "It was then that the Buddha addressed the monks, For this reason, from now on, you shouldn't easily liberate non-Buddhist renunciants who leave home and accept proximate perfection except for those of the Śākyas and non-Buddhists who serve the fire-staying topknot.",
        "source": "T24n1451_038:0398c12_0"
    },
    {
        "source_sentence": "若披外道服來求出家及受近圓者，問無障法，此人應與。",
        "translation": "If someone wearing a non-Buddhist robe comes to leave home and receives the near completion, they'll ask about the unobstructed Dharma, and this person will give it to them.",
        "source": "T24n1451_038:0398c14_1"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1451_038:0398c15_2"
    },
    {
        "source_sentence": "此是我親有機緣故。",
        "translation": "This is because it's the causal condition of my own relatives and organs.",
        "source": "T24n1451_038:0398c15_3"
    },
    {
        "source_sentence": "其事火人說有業用，有因有緣有策勵果故，此等不勞共住，即與出家并受近圓。",
        "translation": "It's because the fire person explains that there's karma and function, which has causes and conditions and encourages results, so they don't bother to live together, which means they leave home and experience near completion.",
        "source": "T24n1451_038:0398c16_4"
    },
    {
        "source_sentence": "若是自餘外道之類，來求出家及近圓者，其親教師應與衣服，食僧常食四月共住。",
        "translation": "If there are other non-Buddhist types who come to leave home and those who approach perfection, their relatives and teachers should give them clothing and feed the saṃgha for four months to live together.",
        "source": "T24n1451_038:0398c18_5"
    },
    {
        "source_sentence": "若觀其人性行調柔堪濟度者，應與出家并近圓事，如是應知。",
        "translation": "If someone observes that their nature and conduct are gentle and capable of being liberated, they should be given to leave home and approach perfect things like this, which should be known.",
        "source": "T24n1451_038:0398c19_6"
    },
    {
        "source_sentence": "「復次汝等苾芻！",
        "translation": "Furthermore, you monks!",
        "source": "T24n1451_038:0398c22_0"
    },
    {
        "source_sentence": "若法能於現在及未來世生長利樂者，汝等應當受持讀誦，為他演說勿使廢忘，欲令梵行得久住世，安樂人天利樂饒益諸眾生故。",
        "translation": "If a teaching can produce benefits and pleasures in the present and future, you should memorize it, recite it, explain it for others so they won't forget it, wanting to make the religious practice long-lastingly abiding in the world because it brings peace and happiness to humans and gods and benefits sentient beings.",
        "source": "T24n1451_038:0398c22_1"
    },
    {
        "source_sentence": "此法是何？",
        "translation": "What is this doctrine?",
        "source": "T24n1451_038:0398c25_2"
    },
    {
        "source_sentence": "所謂契經、應頌、記別、諷頌、自說、因緣、本事、本生、方廣、希有、譬喻、論議。",
        "translation": "They are the sūtras, the appropriate verses, the assurances, the distinctive marks, the chants, the self-explanations, the causes and conditions, the past events, the past lives, the breadth, the rareties, the metaphors, and the discussions.",
        "source": "T24n1451_038:0398c25_3"
    },
    {
        "source_sentence": "此十二分教，若能受持讀誦如說行者，能於現未生長利樂，乃至慈愍群生佛法久住。",
        "translation": "If someone can memorize, recite, and practice these twelve parts of the teaching as explained, they'll be able to cultivate benefits and pleasures that haven't yet grown in the present, up to the point where they'll long abide in the Buddha's teaching of compassion for sentient beings.",
        "source": "T24n1451_038:0398c27_4"
    },
    {
        "source_sentence": "汝等苾芻！",
        "translation": "You monks!",
        "source": "T24n1451_038:0398c29_0"
    },
    {
        "source_sentence": "我涅槃後，作如是念：『我於今日無有大師。』",
        "translation": "After my nirvāṇa, I had this thought, 'Today, I have no teacher.'",
        "source": "T24n1451_038:0398c29_1"
    },
    {
        "source_sentence": "汝等不應起如是見，我令汝等每於半月說波羅底木叉，當知此則是汝大師、是汝依處，若我住世無有異也。",
        "translation": "You shouldn't give rise to such a view, for I will cause you to recite the prātimokṣas every half-month, and you should know that this is your teacher and your reliance, so there's no difference between if I were to live in the world.",
        "source": "T24n1451_038:0399a01_2"
    },
    {
        "source_sentence": "又始從今日小下苾芻，於長宿處不應喚其氏族姓字，應喚『大德』或云『具壽』，老大苾芻應喚小者為『具壽』。",
        "translation": "Again, from today onward, a monk who's small shouldn't call out the name of his family for a long period of time when he's staying overnight; he should call out to them, 'Mañjuśrī' or 'Gushou,' and an elderly monk should call out to the small as 'Gushou.'",
        "source": "T24n1451_038:0399a03_3"
    },
    {
        "source_sentence": "然大苾芻於小者處，應可存情哀憐覆護生慈念心，或以衣鉢鉢絡腰絛，共相濟給勿令闕事，或復教授讀誦禪思使有日益，如是能令我法增長。",
        "translation": "A great monk, however, should maintain compassion for the small and guard his compassionate mind with kindness, or wrap his robe, bowl, bowl, waistcoat, and belt around his waistcoat so that they can help each other without missing anything, or teach them to recite meditation and recitation so that there's an increase in their thoughts, which will thus cause the growth of my teaching.",
        "source": "T24n1451_038:0399a06_0"
    },
    {
        "source_sentence": "若不爾者法當速滅。",
        "translation": "If that's not the case, the teaching will quickly cease.",
        "source": "T24n1451_038:0399a09_1"
    },
    {
        "source_sentence": "又汝等苾芻此地方所有其四處，若有淨信男子女人，乃至盡形常應繫念生恭敬心。",
        "translation": "Furthermore, you monks, there are four places in this place where there are pure faithful men and women, up to the point where they're always mindful of their form and give rise to respect.",
        "source": "T24n1451_038:0399a09_2"
    },
    {
        "source_sentence": "云何為四？",
        "translation": "What are the four?",
        "source": "T24n1451_038:0399a11_3"
    },
    {
        "source_sentence": "一謂佛生處；",
        "translation": "The first is the birthplace of buddhas.",
        "source": "T24n1451_038:0399a11_4"
    },
    {
        "source_sentence": "二、成正覺處；",
        "translation": "The second is the state of perfect enlightenment.",
        "source": "T24n1451_038:0399a12_5"
    },
    {
        "source_sentence": "三、轉法輪處；",
        "translation": "The third is the state of turning the wheel of the Dharma.",
        "source": "T24n1451_038:0399a12_6"
    },
    {
        "source_sentence": "四、入大涅槃處。",
        "translation": "4. the place where he enters great nirvāṇa.",
        "source": "T24n1451_038:0399a12_7"
    },
    {
        "source_sentence": "若能於此四處或自親禮，或遙致敬企念虔誠，生清淨信常繫心者，命終之後必得生天。」",
        "translation": "If someone can either venerate themselves here in these four places or venerate them from afar with respect and reverence, give rise to pure faith and always fix their minds, they'll surely be born in heaven after their life ends.",
        "source": "T24n1451_038:0399a13_8"
    },
    {
        "source_sentence": "(比於西方，親見如來一代五十餘年居止之處，有其八所：一、本生處，二、成道處，三、轉法輪處，四、鷲峯山處，五、廣嚴城處，六、從天下處，七、祇樹園處，八、雙林涅槃處。",
        "translation": "(Comparing with the eight places in the West, there are those where the Tathāgata lived and stayed for more than fifty years during his lifetime: 1. the place where he was originally born; 2. the place where he became a buddha; 3. the place where he turned the wheel of the Dharma; 4. the place where he climbed Vulture Peak; 5. the place where he lived in the extensively adorned city; 6.",
        "source": "T24n1451_038:0399a15_9"
    },
    {
        "source_sentence": "四是定處，餘皆不定。",
        "translation": "The fourth is the sphere of absorption. The others are all indeterminate.",
        "source": "T24n1451_038:0399a16_10"
    },
    {
        "source_sentence": "總攝頌曰：「生成法鷲，廣下祇林，虔誠一想，福勝千金。」",
        "translation": "The general collection of verses says, Produce the eagles of the Dharma, go down into the vast forest of gṛdhrakūṭa, revere one thought, and merit is superior to a thousand pieces of gold.",
        "source": "T24n1451_038:0399a16_11"
    },
    {
        "source_sentence": ")復次佛告諸苾芻：「汝等有疑今悉應問，若於佛法僧寶，苦集滅道四聖諦處，有疑問者我當為答。」",
        "translation": ") Furthermore, the Buddha told the monks, Now if you have doubts, you should ask questions. If you have doubts about the four noble truths of the Buddha, Dharma, saṃgha, treasure, suffering, accumulation, cessation, and path, I will answer them if you have doubts.",
        "source": "T24n1451_038:0399a17_12"
    },
    {
        "source_sentence": "時具壽阿難陀白佛言：「世尊！",
        "translation": "Kauṣṭhila Ānanda then said to the Buddha, Bhagavān!",
        "source": "T24n1451_038:0399a21_0"
    },
    {
        "source_sentence": "如我今者解佛所說，命諸苾芻有疑當問。",
        "translation": "As I now understand what the Buddha teaches, I ordered the monks who had doubts to ask questions.",
        "source": "T24n1451_038:0399a21_1"
    },
    {
        "source_sentence": "然此眾中竟無一人，於佛法僧寶苦集滅道諦有懷疑惑更須問者。」",
        "translation": "Still, there's not a single person in this congregation who harbors doubt about the truth of the Buddha, Dharma, and Saṃgha treasures, suffering, arising, cessation, and the path that need to be asked.",
        "source": "T24n1451_038:0399a22_2"
    },
    {
        "source_sentence": "佛言：「善哉，善哉！",
        "translation": "The Buddha said, Good, good!",
        "source": "T24n1451_038:0399a24_3"
    },
    {
        "source_sentence": "阿難陀！",
        "translation": "Ānanda!",
        "source": "T24n1451_038:0399a24_4"
    },
    {
        "source_sentence": "汝能如實通達作如是語，於此眾內我以智觀，於諦寶中實無疑者，此是如來最後所作。」",
        "translation": "You can truly understand and say such words, and within this congregation, I'll observe them with knowledge and really have no doubts about the treasure of truth; this is the last thing the Tathāgata does.",
        "source": "T24n1451_038:0399a24_5"
    },
    {
        "source_sentence": "爾時如來大悲愍故，遂去上衣現其身相，告諸苾芻：「汝等今者可觀佛身，汝等今者可觀佛身。",
        "translation": "Because of his great compassion, the Tathāgata then removed his upper robes and revealed his body, telling the monks, Now you can contemplate the Buddha's body; now you can contemplate the Buddha's body.",
        "source": "T24n1451_038:0399a26_6"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1451_038:0399a28_7"
    },
    {
        "source_sentence": "如來、應、正等覺難可逢遇，如烏曇跋羅華。」",
        "translation": "The difficulty of encountering the Tathāgata, Arhat, and Completely Awakened One is like the udumbara flower.",
        "source": "T24n1451_038:0399a29_8"
    },
    {
        "source_sentence": "時諸苾芻咸皆默然，佛言：「法皆如是，諸行無常，是我最後之所教誨。」",
        "translation": "The monks then all remained silent, and the Buddha said, All dharmas are thus, and all conditioned things are impermanent; this is the last thing I'll teach.",
        "source": "T24n1451_038:0399b01_0"
    },
    {
        "source_sentence": "作是語已安心正念入初靜慮，從此起已順次第入第二靜慮，乃至非想非非想處及滅受想定，寂然宴默。",
        "translation": "Having said these words, he enters the first concentration with right mindfulness and peace of mind and enters the second concentration in sequence after emerging from this, up to the abode of neither perception nor non-perception and the cessation of feeling and perception, remaining silent and absorbed in meditation.",
        "source": "T24n1451_038:0399b02_1"
    },
    {
        "source_sentence": "時阿難陀問尊者阿尼盧陀曰：「今我大師為入涅槃為未入耶？」",
        "translation": "Ānanda then asked Venerable Aniruddha, Now, is my teacher entering nirvāṇa or not?",
        "source": "T24n1451_038:0399b04_2"
    },
    {
        "source_sentence": "答曰：「佛未涅槃，但住滅受想定。」",
        "translation": "He answered, The Buddha hasn't yet entered nirvāṇa but abides in the concentration of cessation and sensation.",
        "source": "T24n1451_038:0399b06_3"
    },
    {
        "source_sentence": "阿難陀言：「我曾從佛親聞此語，若佛世尊入邊際定寂然不動，從此無間世間眼閉必入涅槃。」",
        "translation": "Ānanda said, I once heard these words from the Buddha's relatives; if the Bhagavān entered the limitless concentration and remained silent and unmoving, he would surely enter nirvāṇa with the eyes closed in the world without interruption from here.",
        "source": "T24n1451_038:0399b07_4"
    },
    {
        "source_sentence": "爾時世尊從滅受想定出，逆次第入非想非非想處，從非想非非想出入無所有處，次入識無邊處，次入空無邊處，次入第四靜慮，入第三、入第二、入初靜慮，從初禪出還入第二、第三、第四靜慮，寂然不動，便入無餘妙涅槃界。",
        "translation": "At the time, the Bhagavān emerged from the concentration of cessation of feeling and perception, entered the abode of neither perception nor non-perception in order, exited from the abode of neither perception nor non-perception in order, entered into the sphere of nothingness, entered into the boundless state of consciousness, entered into the boundless state of empti",
        "source": "T24n1451_038:0399b09_5"
    },
    {
        "source_sentence": "爾時世尊纔涅槃後，大地震動流星晝現諸方熾然，於虛空中諸天擊鼓。",
        "translation": "It was then that the Bhagavān, just after his nirvāṇa, a great earthquake shook the meteors and the stars were shining brightly in all directions, and the gods beat their drums in the sky.",
        "source": "T24n1451_038:0399b15_0"
    },
    {
        "source_sentence": "時具壽大迦攝波，在王舍城羯蘭鐸迦池竹林園中，見大地動，即便斂念觀察何事？",
        "translation": "When Kauṣṭhila Mahākāśyapa was in the bamboo grove of Kalandaka's pond and bamboo grove in Rājagṛha, he saw the earth move and even withdrew to examine what it was.",
        "source": "T24n1451_038:0399b16_1"
    },
    {
        "source_sentence": "便見如來入大圓寂，自念：「我今既無大師，唯依法住，諸行法爾知更云何？」",
        "translation": "He then saw the Tathāgata enter great perfect quiescence and thought to himself, Now that I don't have a teacher but only live according to the Dharma, what else do you know about the practice of the Dharma?",
        "source": "T24n1451_038:0399b18_2"
    },
    {
        "source_sentence": "復作是念：「此未生怨王勝身之子信根初發，彼若聞佛入涅槃者，必嘔熱血而死，我今宜可預設方便。」",
        "translation": "Again, he thought, This is the first reason this enemy king's victorious body-son who has yet to arise gives rise to the faculty of faith. If he hears that the Buddha enters nirvāṇa, he'll surely vomit hot blood and die; now it's appropriate for me to set up an expedient method.",
        "source": "T24n1451_038:0399b20_3"
    },
    {
        "source_sentence": "作是念，已即命城中行雨大臣：「仁今知不？",
        "translation": "He had this thought, and then ordered the minister of traveling rain in the city, Do you know it now?",
        "source": "T24n1451_038:0399b22_4"
    },
    {
        "source_sentence": "佛已涅槃，未生怨王信根初發，彼若聞佛入涅槃者，必嘔熱血而死。",
        "translation": "Before the Buddha enters nirvalJa, when the enemy king who has not yet arisen gives rise to his faculty of faith for the first time. If he hears that the Buddha enters nirvalJa, he will surely vomit hot blood and die.",
        "source": "T24n1451_038:0399b23_5"
    },
    {
        "source_sentence": "我今宜可預設方便。」",
        "translation": "Now, it's appropriate for me to set up a method.",
        "source": "T24n1451_038:0399b25_6"
    },
    {
        "source_sentence": "即依次第而為陳說：「仁今疾可詣一園中，於妙堂殿如法圖畫佛本因緣。",
        "translation": "He then told him in order, saying, Now, you're ill, so you can go to a park and paint the Buddha's original causes and conditions in the marvelous hall as shown in the Dharma drawing.",
        "source": "T24n1451_038:0399b25_7"
    },
    {
        "source_sentence": "菩薩昔在覩史天宮，將欲下生觀其五事，欲界天子三淨母身，作象子形託生母腹，既誕之後踰城出家，苦行六年坐金剛座，菩提樹下成等正覺。",
        "translation": "Formerly the Bodhisattva was in the palace of Kauśinagara Heaven, about to descend into the Pure Land. He observed these five things: The celestial beings of the realm of desire (kāmadhātu) had three pure bodies as goddesses and assumed the form of an elephant; after his birth he passed away from the city and renounced household life. After six years of auster",
        "source": "T24n1451_038:0399b27_8"
    },
    {
        "source_sentence": "次至婆羅痆斯國為五苾芻三轉十二行四諦法輪。",
        "translation": "Next, he went to the country of Vārāṇasī and taught the Dharma wheel of the thirty-two practices of the four noble truths for five monks.",
        "source": "T24n1451_038:0399c01_9"
    },
    {
        "source_sentence": "次於室羅伐城為人天眾現大神通。",
        "translation": "Next, he manifested great supernormal abilities for humans and gods in the city of Śrāvastī.",
        "source": "T24n1451_038:0399c02_10"
    },
    {
        "source_sentence": "次往三十三天為母摩耶廣宣法要，寶階三道下贍部洲，於僧羯奢城人天渴仰。",
        "translation": "Next, he went to the Trāyastriṃśa gods and proclaimed the essentials of the Dharma extensively for his mother Māyā. At the foot of the jeweled steps in the three directions was Jambudvīpa, where the people of the city of Siṃhala cherished it.",
        "source": "T24n1451_038:0399c03_11"
    },
    {
        "source_sentence": "於諸方國在處化生，利益既周將趣圓寂，遂至拘尸那城娑羅雙樹，北首而臥入大涅槃。",
        "translation": "In various countries in all directions, wherever he was teaching sentient beings, his benefits were complete and he was about to enter perfect quiescence, so he went to the city of Kuśinagara, two śāla trees at the northern end, and lay down into great nirvāṇa.",
        "source": "T24n1451_038:0399c05_12"
    },
    {
        "source_sentence": "如來一代所有化迹既圖畫已，次作八函與人量等置於堂側，前七函內滿置生酥，第八函中安牛頭栴檀香水。",
        "translation": "After the Tathāgata had painted all the traces of his transformation in one lifetime, he next made eight boxes equal in size to the number of people and placed them beside the hall. The first seven boxes were filled with fresh butter, while the eighth box contained sandalwood perfume from oxhead sandalwood.",
        "source": "T24n1451_038:0399c07_13"
    },
    {
        "source_sentence": "若因駕出可白王言：『暫迀神駕躬詣芳園所觀其圖畫。』",
        "translation": "If he leaves the carriage, he can tell the king, 'For a moment, I'll go to the fragrant park and look at his drawings.'",
        "source": "T24n1451_038:0399c09_14"
    },
    {
        "source_sentence": "時王見已問行雨言：『此述何事？』",
        "translation": "Seeing it, the king asked Xingzhao, 'What's the matter in this statement?'",
        "source": "T24n1451_038:0399c11_15"
    },
    {
        "source_sentence": "彼即次第為王陳說一如圖畫，始從覩史降身母胎，終至雙林北首而臥。",
        "translation": "He then explained one thing in order to Wang Chen as a drawing, first descending from Kauśinagara into his mother's womb and finally lying down at the northern head of the twin trees.",
        "source": "T24n1451_038:0399c11_16"
    },
    {
        "source_sentence": "王聞是語即便悶絕宛轉于地，可速移入第一函中。",
        "translation": "When the king heard these words, he fell to the ground in distress and quickly moved into the first box.",
        "source": "T24n1451_038:0399c13_17"
    },
    {
        "source_sentence": "如是一、二、三、四乃至第七，後置香水王便穌息。」",
        "translation": "Thus, it's one, two, three, four, or even the seventh, and then he puts his perfume king behind him and calms down.",
        "source": "T24n1451_038:0399c14_18"
    },
    {
        "source_sentence": "是時尊者次第教已往拘尸那城，行雨大臣一如尊者所教之事次第作已，時王因出大臣白言：「願王暫迀神駕遊觀園中。」",
        "translation": "After the Bhagavān had taught them in order and went to Kuśinagara, the king then left his ministers and said, May the king temporarily send a divine carriage to the park of contemplation for a while.",
        "source": "T24n1451_038:0399c15_19"
    },
    {
        "source_sentence": "王至園所見彼堂中圖畫新異，始從初誕乃至倚臥雙林，王問臣曰：「豈可世尊入涅槃耶？」",
        "translation": "When the king arrived at the garden and saw a newly painted painting in that hall, the king asked his ministers, How could the Bhagavān enter nirvāṇa?",
        "source": "T24n1451_038:0399c18_20"
    },
    {
        "source_sentence": "是時行雨默然無對。",
        "translation": "At the time, it rained and remained silent without reply.",
        "source": "T24n1451_038:0399c20_21"
    },
    {
        "source_sentence": "王見是已知佛涅槃，即便號咷悶絕宛轉于地。",
        "translation": "Knowing that this was the Buddha’s nirvana, the king cried in distress and fell to the ground.",
        "source": "T24n1451_038:0399c21_0"
    },
    {
        "source_sentence": "臣即移舉置蘇函中，如是至七方投香水，從此已後王漸穌息。",
        "translation": "The minister then lifted it up and placed it in the envelope of soap, went seven directions like this, and poured perfume into it; after that the king gradually calmed his breath.",
        "source": "T24n1451_038:0399c22_1"
    },
    {
        "source_sentence": "爾時如來入涅槃時，娑羅雙樹名華下散彌覆金軀。",
        "translation": "At the time, when the Tathāgata entered nirvāṇa, the two śāla trees were named flowers that spread down to cover his golden body.",
        "source": "T24n1451_038:0399c24_0"
    },
    {
        "source_sentence": "「世尊涅槃時，　　最勝娑羅樹，",
        "translation": "“At the time of the Bhagavat’s nirvana, The supreme śāla tree",
        "source": "T24n1451_038:0399c25_1"
    },
    {
        "source_sentence": "　低枝下垂蔭，　　復散以名華。」",
        "translation": "It hangs down under a low branch to provide shade, and it's again dispersed as a flower.",
        "source": "T24n1451_038:0399c25_1"
    },
    {
        "source_sentence": "「諸行無常，　　是生滅法；　　生滅滅已，",
        "translation": "Conditioned things are impermanent, the law of arising and ceasing; once they arise and cease,",
        "source": "T24n1451_038:0399c25_1"
    },
    {
        "source_sentence": "時有苾芻見斯事已而說頌曰：時天帝釋亦說頌曰：　寂滅為樂。」",
        "translation": "After seeing this, a monk said in verse, At the time, Śakra also said in verse, Tranquil extinction is bliss.",
        "source": "T24n1451_038:0399c25_1"
    },
    {
        "source_sentence": "「於一切世間，　　生者皆歸死；",
        "translation": "In all worlds, Those who are born return to death.",
        "source": "T24n1451_038:0400a02_0"
    },
    {
        "source_sentence": "　無常力最大，　　諸行盡淪亡。",
        "translation": "The power of impermanence is greatest, and all conditioned things are completely lost.",
        "source": "T24n1451_038:0400a02_0"
    },
    {
        "source_sentence": "　大師世間眼，　　十力無與等；",
        "translation": "The great teacher’s worldly eye Is unequaled by the ten powers.",
        "source": "T24n1451_038:0400a02_0"
    },
    {
        "source_sentence": "　化緣既周遍，　　寂滅在雙林。」",
        "translation": "Since the conditions for transformation have pervaded them, their tranquility is in the twin forests.",
        "source": "T24n1451_038:0400a02_0"
    },
    {
        "source_sentence": "「佛無出入息，　　其心亦湛然；",
        "translation": "The Buddha neither exhales nor inhales, Yet his mind is also calm.",
        "source": "T24n1451_038:0400a02_0"
    },
    {
        "source_sentence": "　世眼今已閉，　　寂然安不動。",
        "translation": "Now that the worldly eye has been shut, it's still and unmoving.",
        "source": "T24n1451_038:0400a02_0"
    },
    {
        "source_sentence": "　世尊十力具，　　化盡入無餘；",
        "translation": "The World-honored One is endowed with the ten powers, Entering everywhere by teaching.",
        "source": "T24n1451_038:0400a02_0"
    },
    {
        "source_sentence": "　見聞諸有情，　　毛竪心驚怖。",
        "translation": "Seeing and hearing sentient beings, their hair stands on end in fear.",
        "source": "T24n1451_038:0400a02_0"
    },
    {
        "source_sentence": "　汝心莫沈沒，　　亦勿懷憂惱；",
        "translation": "Don’t let your mind sink, And don’t harbor sorrow.",
        "source": "T24n1451_038:0400a02_0"
    },
    {
        "source_sentence": "　佛證真木叉，　　譬如燈焰滅。」",
        "translation": "The Buddha realizes the true mokṣa, which is like the cessation of a flame in a lamp.",
        "source": "T24n1451_038:0400a02_0"
    },
    {
        "source_sentence": "時梵天王亦說頌曰：爾時尊者阿尼盧陀亦說頌曰：時諸苾芻，見佛世尊般涅槃已各懷悲感，或有迷悶宛轉于地，椎胸大喚心生憂慘，或有尋思法理作如是說：「我等今時宜自裁忍，世尊常說：『一切光華可愛樂事，雖是尊重，終歸無常悉皆離別。』」",
        "translation": "The Brahmadeva king then also spoke a verse, saying, At the time, Venerable Aniruddha also spoke a verse, saying, When the monks saw the Bhagavān's parinirvāṇa, each of them were grieved, or some of them were confused and turned to the ground, beat their chests and wails in great grief, or some of them contemplated the principle of the Dharma and said,",
        "source": "T24n1451_038:0400a02_0"
    },
    {
        "source_sentence": "時阿尼盧陀告阿難陀曰：「具壽！",
        "translation": "Aniruddha then addressed Ānanda, Kauṣṭhila!",
        "source": "T24n1451_038:0400a19_0"
    },
    {
        "source_sentence": "宜應勸誘大眾，且各裁抑，勿乖儀式莫大悲號。",
        "translation": "It's advisable to encourage and tempt the masses, and each should be disciplined, so that they don't disobey rituals and don't wail with great compassion.",
        "source": "T24n1451_038:0400a19_1"
    },
    {
        "source_sentence": "所以者何？",
        "translation": "Why is that?",
        "source": "T24n1451_038:0400a20_2"
    },
    {
        "source_sentence": "於此現有住百千劫長壽諸天，皆生嫌恥作如是語：『云何苾芻於佛世尊善說法律而為出家，不能善觀諸無常事乃生憂苦？』」",
        "translation": "Here, there are gods who live for a hundred thousand long eons and all become disgusted and say, 'How is it that a monk who well explains the Dharma to the Bhagavān and leaves home because he can't well observe impermanent things and then becomes sad and painful?'",
        "source": "T24n1451_038:0400a21_0"
    },
    {
        "source_sentence": "阿難陀白言：「此諸天眾其數幾何？」",
        "translation": "Ānanda said, How many of these gods are there?",
        "source": "T24n1451_038:0400a23_1"
    },
    {
        "source_sentence": "答曰：「從此拘尸那城，乃至金河及娑羅雙樹，至壯士繫冠制底，於此四邊周十二踰繕那，大威德天悉皆充滿，無有空隙可容立杖。",
        "translation": "He answered, From this city of Kuśinagara up to the two śāla trees at the Gold River and the two pairs of śāla trees down to the strong man's crown restraints are twelve yojanas in circumference on all four sides here, filled with the god Mahāprajāpatīṃśavartin who has no space to allow him to place his cane.",
        "source": "T24n1451_038:0400a24_2"
    },
    {
        "source_sentence": "而此諸天見佛涅槃，各懷悲感椎胸懊惱悶絕于地，亦有如前共相開解，且各裁止，乃至終歸無常悉皆離別。」",
        "translation": "When these gods saw the Buddha's nirvāṇa, they each harmed with grief and beat their chests in distress and screamed on the ground, and there were also those who shared the same understanding as before, which was to be judged and stopped by each other, up to the point where they ended up returning to impermanence and all separated.",
        "source": "T24n1451_038:0400a27_3"
    },
    {
        "source_sentence": "于時尊者阿尼盧陀，為阿難陀及諸大眾，廣說法要乃至天明，時苾芻等默然聽受。",
        "translation": "Venerable Aniruddha then explained the essentials of the Dharma extensively for Ānanda and the other members of the assembly, up to heavenly luminosity, and the monks and others listened quietly.",
        "source": "T24n1451_038:0400b01_4"
    },
    {
        "source_sentence": "阿尼盧陀復告阿難陀曰：「汝今宜往拘尸那城告諸壯士，昨於中夜如來大師已入無餘妙涅槃界。",
        "translation": "Aniruddha then again told Ānanda, Now it's advisable for you to go to the city of Kuśinagara and tell the strong men that last night in the middle of the night, the Tathāgata has entered the realm of nirvāṇa without remainder.",
        "source": "T24n1451_038:0400b02_5"
    },
    {
        "source_sentence": "仁等今時所應作者宜當速辦，勿為後悔。」",
        "translation": "It's advisable for you to quickly prepare what you should do now, so don't regret it.",
        "source": "T24n1451_038:0400b05_6"
    },
    {
        "source_sentence": "復重告曰：「如來大師於汝城邑入般涅槃，爾等云何不興供養報佛慈恩？」",
        "translation": "Again, he said, The Tathāgata's great teacher entered parinirvāṇa in your city, so why wouldn't you make offerings to repay the Buddha's kindness?",
        "source": "T24n1451_038:0400b06_7"
    },
    {
        "source_sentence": "時阿難陀聞是語已，即持天衣，將一苾芻以為侍者，往壯士集堂。",
        "translation": "After hearing these words, Ānanda took his celestial robe and made a monk into an attendant to go to the hall where the strong men assembled.",
        "source": "T24n1451_038:0400b07_8"
    },
    {
        "source_sentence": "有五百人先在堂處，尊者告曰：「仁等壯士及諸大眾，如來大師已於中夜入無餘依妙涅槃界。",
        "translation": "There were five hundred people who had previously been in the hall, and the venerable told them, Sirs, you've entered the marvelous nirvāṇa realm of remainderlessness in the middle of the night.",
        "source": "T24n1451_038:0400b09_9"
    },
    {
        "source_sentence": "仁等今時所應作者宜應速辦，勿生後悔。」",
        "translation": "It's advisable for you to quickly prepare what you should do now, so don't regret it.",
        "source": "T24n1451_038:0400b11_10"
    },
    {
        "source_sentence": "又重告曰：「如來大師於汝城邑入般涅槃，汝等云何不興供養報佛慈恩？」",
        "translation": "Again, he said, The Tathāgata's great teacher entered parinirvāṇa in your city, so why don't you make offerings to repay the Buddha's kindness?",
        "source": "T24n1451_038:0400b12_11"
    },
    {
        "source_sentence": "時諸壯士聞是告已，或有悶絕宛轉于地，椎胸大喚身體戰慄不能自持，或有高聲作如是語：「我於佛所曾聞是說：『世間無常悉皆離別。』」",
        "translation": "When the strong men heard this announcement, some of them were faint-hearted and turned to the ground, beat their chests and bodies in great cries that they couldn't control themselves, or some of them raised their voices and said, I've heard this teaching from the Buddha, 'The world is impermanent and completely distinct.'",
        "source": "T24n1451_038:0400b14_12"
    },
    {
        "source_sentence": "時諸壯士共相謂曰：「宜各齎持種種華鬘塗香末香燒香，及諸妙物音聲鼓樂，速往雙林以申供養。」",
        "translation": "The strong men then said to each other, Let's each bring various kinds of flowers, garlands, ointments, powdered incense, burned incense, and wonderful things with sounds and sounds and drums to the twin forests to make offerings.",
        "source": "T24n1451_038:0400b17_13"
    },
    {
        "source_sentence": "并大臣輔相各與眷屬男女大小親友知識，出拘尸城詣雙林所。",
        "translation": "They were accompanied by ministers and assistant ministers, each with their retinues, men, women, relatives, friends, and acquaintances, leaving the city of Kuśinagara and arriving at the twin forests.",
        "source": "T24n1451_038:0400b19_14"
    },
    {
        "source_sentence": "既至彼已，於佛臥處師子床前盡哀情已，各持所有上妙諸香名華，無數幢幡繒綵飲食奇珍，奏諸音樂廣供養已，白阿難陀曰：「無上法王已歸圓寂，不知今者葬禮如何？」",
        "translation": "When they arrived there, they were all grieved in front of the lion's seat where the Buddha was lying and didn't know what to do for his funeral service now.",
        "source": "T24n1451_038:0400b20_15"
    },
    {
        "source_sentence": "尊者告曰：「然我先已奉佛教勅，所有葬法如轉輪王。」",
        "translation": "The venerable told him, Still, I've previously obeyed the Buddha's teaching that all funeral rite is like a wheel-turning king.",
        "source": "T24n1451_038:0400b24_16"
    },
    {
        "source_sentence": "問曰：「其法如何？」",
        "translation": "He asked, What's the teaching?",
        "source": "T24n1451_038:0400b25_17"
    },
    {
        "source_sentence": "答曰：「以白疊絮先用裹體，次以千張白疊周遍纏身，置金棺中盛滿香油，覆以金蓋積栴檀木及海岸諸香，以火焚燎。",
        "translation": "He answered, First, he wrapped his body in a white cloth, covered it with a thousand pieces of white cloth, placed it inside a golden coffin filled with fragrant oil, covered it with a gold lid, stored sandalwood wood and seashore incense, and burned it in the fire.",
        "source": "T24n1451_038:0400b26_18"
    },
    {
        "source_sentence": "後將牛乳澆火令滅，有餘舍利盛以金瓶，於四衢大道建窣覩波，周匝圍繞懸繒幡蓋，塗末燒香奏眾伎樂，恭敬供養設大施會。",
        "translation": "He then poured the milk of the cow into the fire and caused it to go out. The remaining relics were preserved in a golden pitcher, placed on the four sides of the great highway, surrounded by hanging silhouetted banners and canopies, smeared with scented powder and burned incense, played music, offered respect and offerings, and set up a great almsgiving",
        "source": "T24n1451_038:0400b28_19"
    },
    {
        "source_sentence": "此是輪王焚葬之法，如來大師倍勝於此。」",
        "translation": "This is the method for the wheel-turning king's burning and burial, which is twice as great as this for the Tathāgata Daishi.",
        "source": "T24n1451_038:0400c02_20"
    },
    {
        "source_sentence": "時諸壯士聞是語已，白尊者曰：「我領其言，然非一、二、三日能辦此事。",
        "translation": "When the strong men heard these words, they said to the venerable, I'll follow their words, but it won't be for one, two, or three days to do this.",
        "source": "T24n1451_038:0400c04_0"
    },
    {
        "source_sentence": "若至七日住者，如前所為方可成就。」",
        "translation": "If he stays for seven days, he'll be able to accomplish what he did before.",
        "source": "T24n1451_038:0400c05_1"
    },
    {
        "source_sentence": "答言：「可爾。」",
        "translation": "He replied, That's right.",
        "source": "T24n1451_038:0400c06_2"
    },
    {
        "source_sentence": "是時諸人即便如前，依輪王葬法一一備具無有闕少，從拘尸那城周圍十二踰繕那，乃至繫冠制底，所有無量歸仰眾生咸來雲集，各持香華種種伎樂供養之具，壯士眷屬皆悉出城，詣雙樹間於師子床前，陳設所有盡心供養。",
        "translation": "The people then did as before, each according to the rules for the funeral of the wheel-turning king, provided with everything they needed. They came from the twelve yojanas around the city of Kuśinagara up to the end of their crowns and robes, gathered in great clouds of countless sentient beings who revered him, each brought incense, flowers, and various kinds of music to make offerings",
        "source": "T24n1451_038:0400c06_3"
    },
    {
        "source_sentence": "時壯士中有一耆宿，告諸人曰：「現在大眾，女持幢幡、男可擎輿，我等齎持種種華綵、塗香、末香、燒香及諸音樂，從拘尸那城西門而入，於東門出，度金沙河，至壯士繫冠制底勝處安置以火焚燒。」",
        "translation": "Among the strong men, there was a senior monk among them who told the people, Now, in the assembled crowd, women carry banners, banners, streamers, and men can raise their carriages, and we carry various kinds of flowers, silks, ointments, powdered incense, burning incense, and music. Entering through the west gate of Kuśinagara city from the west gate, we",
        "source": "T24n1451_038:0400c11_4"
    },
    {
        "source_sentence": "是時諸人聞是語已，各各爭前欲舉金棺，雖共盡力竟不能動。",
        "translation": "After hearing these words, each of the people then rushed forward to lift the gold coffin, but even though they did so together, they couldn't move it.",
        "source": "T24n1451_038:0400c16_5"
    },
    {
        "source_sentence": "爾時具壽阿難陀，白尊者阿尼盧陀曰：「拘尸那城諸壯士等，雖竭筋力竟不能動如來金棺，我今不知有何所以？」",
        "translation": "It was then that Kauṣṭhila Ānanda said to Venerable Aniruddha, The strong men in Kuśinagara city couldn't move the Tathāgata's golden coffin even though they did so with all their strength, but now I don't know why.",
        "source": "T24n1451_038:0400c18_0"
    },
    {
        "source_sentence": "尊者告曰：「此是諸天作如斯意，欲令壯士及諸人民，女持幢幡、男捧尊輿，威儀整肅翊從如來，我等諸天共持華綵，燒眾妙香奏天伎樂廣陳供養，於西門入東門而出，度金沙河至繫冠制底，以是因緣威儀未備不能移動。」",
        "translation": "The Venerable told him, These are the gods who have this intention to cause strong men and people, women carrying banners and streamers and men holding venerable carriages, their manner is so dignified that they follow the Tathāgata, and we gods share the same flower silhouettering, burning incense, playing heavenly music and offerings are presented extensively at the west gate, entering",
        "source": "T24n1451_038:0400c20_1"
    },
    {
        "source_sentence": "是時具壽阿難陀報尊者曰：「若如是者，可隨天意。」",
        "translation": "It was then that the long-lived Ānanda replied to the venerable, If so, you can follow the god's wishes.",
        "source": "T24n1451_038:0400c25_2"
    },
    {
        "source_sentence": "時諸壯士即隨天願，備設如前方來持輿，即便輕舉捧戴而行。",
        "translation": "The strong men then complied with the god's vow, prepared as before to carry the carriage, lifted it lightly, held it, and carried it.",
        "source": "T24n1451_038:0400c26_3"
    },
    {
        "source_sentence": "于時空中天雨嗢鉢羅華、拘物頭華、鉢頭摩華、分陀利華，沈水末香、栴檀末香、多揭羅多摩羅末香，及曼陀羅華等。",
        "translation": "The sky then rained blue lotus blossoms, white lotus blossoms, blue lotus blossoms, blue lotus blossoms, blue lotus blossoms, blue lotus blossoms, blue lotus blossoms, blue lotus blossoms, blue lotus blossoms, blue lotus blossoms, blue lotus blossoms, blue lo",
        "source": "T24n1451_038:0400c28_4"
    },
    {
        "source_sentence": "諸天伎樂百千萬種，於虛空中一時俱奏，諸天華蓋其從如雲，并散天衣有盈億數。",
        "translation": "A hundred million kinds of celestial music were played simultaneously in the sky at one time, with heavenly flowers covering them like clouds and spreading millions of celestial robes.",
        "source": "T24n1451_038:0401a01_5"
    },
    {
        "source_sentence": "時拘尸那城諸壯士等各相謂曰：「天供養已，我等應為。」",
        "translation": "The strong men in Kuśinagara then said to each other, After the gods make offerings, we should do it.",
        "source": "T24n1451_038:0401a03_6"
    },
    {
        "source_sentence": "時諸壯士及餘一切貴賤男女，營辦香華威儀嚴肅，百千萬種不可勝紀，恭敬供養隨從金棺，城中而過度金沙河至繫冠制底，所散之華積至于膝。",
        "translation": "The strong men and all the other noble and humble men and women then prepared incense, flowers, and manners with dignity and solemnity, a hundred million kinds of incomparable forms, respected and offered support to the golden coffin as they went from the city beyond the river of gold sand up to the base of the fettered crown, and the flowers they scattered reached down to their knees.",
        "source": "T24n1451_038:0401a04_7"
    },
    {
        "source_sentence": "于時有一外道梵志，聞佛滅度詣娑羅林，持華數莖還波波聚落，於其中路逢大迦攝波，與五百弟子威儀整肅，將詣雙林禮大師足，遇見外道問言：「汝從何來？",
        "translation": "At the time, there was a non-Buddhist priest who heard that the Buddha had entered nirvāṇa and went to the sal trees. Carrying a few stalks of flowers in his hand, he returned to the village of Kapilavastu, where he met Mahākāśyapa on the roadway. He was accompanied by five hundred disciples with proper demeanor and manner. They were about to",
        "source": "T24n1451_038:0401a08_8"
    },
    {
        "source_sentence": "欲向何處？」",
        "translation": "Where do you want to go?",
        "source": "T24n1451_038:0401a11_9"
    },
    {
        "source_sentence": "外道答曰：「我從拘尸那來，將詣波波聚落。」",
        "translation": "The non-Buddhist replied, I came from Kuśinagara and was about to go to the village of Upagupta.",
        "source": "T24n1451_038:0401a12_10"
    },
    {
        "source_sentence": "迦攝波知而故問：「汝從彼來，知我大師釋迦牟尼如來四大安不？」",
        "translation": "Knowing this, Kāśyapa asked, Did you come from that place and know the four major peaces of my great teacher, Śākyamuni Tathāgata?",
        "source": "T24n1451_038:0401a13_11"
    },
    {
        "source_sentence": "外道答言：「我從彼來，親見大德喬答摩已入涅槃，經今七日。",
        "translation": "The non-Buddhist replied, I came from that place and happened to see the great virtuous man Gautama in person. It has been seven days since he entered nirvana.",
        "source": "T24n1451_038:0401a14_12"
    },
    {
        "source_sentence": "自滅度來，所有人天皆以香華種種威儀，具申供養遺身舍利，我從彼會得此華來。」",
        "translation": "When he entered nirvāṇa, all the people and gods of that assembly presented various kinds of fragrant flowers and mannerisms to make offerings to the relics left by him, and I came from that assembly to obtain these flowers.",
        "source": "T24n1451_038:0401a15_13"
    },
    {
        "source_sentence": "大迦攝波所將五百人中有一莫訶羅苾芻，稟性愚癡不辯好惡，聞外道語遂出麁言：「快哉！",
        "translation": "Among the five hundred monks led by Mahākāśyapa, there was a Mohāra monk whose nature was foolish and unable to distinguish good from evil. Hearing the words of non-Buddhist teachers, he came out in anger and said, How wonderful!",
        "source": "T24n1451_038:0401a17_14"
    },
    {
        "source_sentence": "樂哉！",
        "translation": "How delightful!",
        "source": "T24n1451_038:0401a19_15"
    },
    {
        "source_sentence": "我等從今免被拘制於諸戒律，云：『此應作、此不應作。』",
        "translation": "From now on, we'll be freed from being restrained by the precepts, which say, 'This should be done and this shouldn't be done.'",
        "source": "T24n1451_038:0401a20_0"
    },
    {
        "source_sentence": "此事皆息。",
        "translation": "These things are all stopped.",
        "source": "T24n1451_038:0401a21_1"
    },
    {
        "source_sentence": "自今已後，能持、不持，皆由於我，可行者行，不須者棄。」",
        "translation": "From now on, they'll be able to maintain and not maintain them all because of me; those who can do so will do it, and those who don't need it will abandon it.",
        "source": "T24n1451_038:0401a21_2"
    },
    {
        "source_sentence": "時彼老叟出此語時，空中諸天聞其非法，即以神力掩蔽聲響不令人聞，唯迦攝波領知斯語。",
        "translation": "When that old man spoke these words, the gods in the sky heard what was unlawful and covered up the sound with their supernormal powers so no one could hear it, except Kāśyapa, who knew them.",
        "source": "T24n1451_038:0401a22_3"
    },
    {
        "source_sentence": "是時尊者為教誨彼故，即於道傍暫時停歇，與眾俱坐告言：「諸具壽！",
        "translation": "In order to instruct them, the venerable then stopped for a while at the side of the road and sat with the crowd together, telling them, Kauṣṭhila!",
        "source": "T24n1451_038:0401a24_4"
    },
    {
        "source_sentence": "世間諸行皆悉無常，體不堅牢是難委信，不得久存並歸散滅，宜起厭離勿生愛著。",
        "translation": "The world's conditioned forces are all impermanent, and it's difficult to believe that their essence isn't resolute, so they can't exist for a long time and return to dispersal, so it's advisable to become disillusioned with them and not become attached to them.",
        "source": "T24n1451_038:0401a26_5"
    },
    {
        "source_sentence": "且止斯事，我等速往，見佛全身各並前進。」",
        "translation": "Stop this matter, and we'll quickly go there and see the Buddha's whole body moving forward together.",
        "source": "T24n1451_038:0401a28_6"
    },
    {
        "source_sentence": "時諸壯士并四眾等，先用疊絮裹如來體，次以千張白疊周匝纏身，置香油棺覆以金蓋，各持香木如法焚燒，火不能著。",
        "translation": "The strong men and the four groups of people then wrapped the Tathāgata's body in a pile of cotton cloth, wrapped it around him with a thousand pieces of white cloth, covered his body with a coffin made of fragrant oil and covered it with a gold lid, and each carried an incense wooden canopy to burn it according to the rules, but the fire couldn't touch it.",
        "source": "T24n1451_038:0401a29_7"
    },
    {
        "source_sentence": "時阿尼盧陀告阿難陀曰：「雖欲然火終無著法。」",
        "translation": "Aniruddha then addressed Ānanda, Even though they want it, the fire never clings to the Dharma.",
        "source": "T24n1451_038:0401b02_8"
    },
    {
        "source_sentence": "問：「其何故？」",
        "translation": "He asked, Why is that?",
        "source": "T24n1451_038:0401b03_9"
    },
    {
        "source_sentence": "答曰：「斯為諸天不令火著。」",
        "translation": "He answered, It's because the gods won't allow the fire to touch it.",
        "source": "T24n1451_038:0401b04_10"
    },
    {
        "source_sentence": "復問：「何緣？」",
        "translation": "Again, he asked, What's the reason?",
        "source": "T24n1451_038:0401b04_11"
    },
    {
        "source_sentence": "答曰：「為大迦攝波與五百徒眾隨路而來，欲見世尊金色全身親觀焚燎，為待彼故天不令燒。」",
        "translation": "He answered, Suppose Mahākāśyapa and his five hundred disciples came along the road and wanted to see the Bhagavān's golden-colored body being burned up in intimate contemplation because they were waiting for him so gods wouldn't let him burn it.",
        "source": "T24n1451_038:0401b04_12"
    },
    {
        "source_sentence": "時阿難陀即以此事普告眾知，須臾尊者徒眾皆至。",
        "translation": "Ānanda then told the crowd about this matter, and in a moment, the venerable monk's disciples all arrived.",
        "source": "T24n1451_038:0401b07_13"
    },
    {
        "source_sentence": "拘尸那城諸人遙見尊者眾來，各持香華種種音樂，詣尊者所頭面禮足。",
        "translation": "From a distance, the people of Kuśinagara saw the Venerable's congregation coming, each carrying incense and flowers and various music, and went to the Venerable with their heads and feet bowed.",
        "source": "T24n1451_038:0401b08_14"
    },
    {
        "source_sentence": "時有無量百千大眾，隨從尊者詣世尊所，除去香木啟大金棺，千疊及絮並開解已，瞻仰尊容頭面禮足，於此時中唯有四大耆宿聲聞，謂具壽阿若憍陳如、具壽難陀、具壽十力迦攝波、具壽摩訶迦攝波。",
        "translation": "Measureless hundreds of thousands of people in the assembly then followed the Venerable to the Bhagavān, removed the fragrant wood and opened the great gold coffin, unlocked it with a thousand pieces of cloth and floss, looked up at the venerable's features, bowed their heads and feet, and at that point, there were only four major senior śrāvakas, namely,",
        "source": "T24n1451_038:0401b09_15"
    },
    {
        "source_sentence": "然摩訶迦攝波有大福德多獲利養，衣鉢藥直觸事有餘，尊者作念：「我今自辦供養世尊。」",
        "translation": "Still, Mahākāśyapa has great merit and much benefit from being blessed, and his robes, bowls, and medicine directly touch things with remainder, so the venerable thought, Now, I'll make my own offerings to the Bhagavān.",
        "source": "T24n1451_038:0401b14_16"
    },
    {
        "source_sentence": "即辦白疊千張及白疊絮，先以絮裹後用疊纏，置金棺中傾油使滿，覆以金蓋積諸香木退住一面。",
        "translation": "He then prepared a thousand sheets of white cotton cloth and white cotton cloth, wrapped it first in cotton cloth and then covered it with cotton cloth, placed it in a gold coffin to pour oil so that it would be full, covered it with a golden lid heap of fragrant wood, and withdrew to one side.",
        "source": "T24n1451_038:0401b16_17"
    },
    {
        "source_sentence": "由佛餘威及諸天力，所有香木自然火起。",
        "translation": "Because of the other powers of the Buddha and the gods, all the fragrant wood that exists naturally causes fire to arise.",
        "source": "T24n1451_038:0401b18_18"
    },
    {
        "source_sentence": "「如來妙體歸圓寂，　　自然火起燎餘身；",
        "translation": "The Buddha’s marvelous body returns to perfect quiescence, spontaneously setting fire to burn the rest of his body.",
        "source": "T24n1451_038:0401b19_19"
    },
    {
        "source_sentence": "　唯留內外一雙全，　　所有千衣隨火化。」",
        "translation": "Only one pair remains intact inside and out, and all the thousand robes he has are transformed by the fire.",
        "source": "T24n1451_038:0401b19_19"
    },
    {
        "source_sentence": "時阿難陀右繞火積說伽他曰：時拘尸那城諸壯士等，欲以牛乳注火令滅，未瀉之頃其火積中忽生四樹：一、金色乳樹，二、赤色乳樹，三、菩提樹，四、烏曇跋樹，於此樹中乳自流出令火皆滅。",
        "translation": "Ānanda then circumambulated the fire pile to the right and said, The strong men of Kuśinagara wanted to pour cow's milk into the fire so that it would go out, but before they did so, four trees suddenly arose from the fire pile: 1. the golden-colored milk tree, 2. the red-colored milk tree, 3. the bodhi tree, and 4. the uḍumbara tree.",
        "source": "T24n1451_038:0401b19_19"
    },
    {
        "source_sentence": "是時拘尸那城諸貴賤等，共收舍利盛金瓶中置七寶輿上，以種種香華栴檀沈水塗香、末香、燒香、繒蓋、幢幡，音聲伎樂廣陳供養，舁入城中安妙堂上，復更如前盛興供養。",
        "translation": "The people of Kuśinagara then gathered the relics into a golden vase and placed them on a seven-jeweled carriage, offering various kinds of fragrant flowers, sandalwood, sunken water, ointments, powdered incense, burning incense, canopies, banners, streamers, sounds, music, and so forth. They entered the city to place the relics in a wonderful",
        "source": "T24n1451_038:0401b26_20"
    },
    {
        "source_sentence": "是時波波聚落諸壯士等，聞佛世尊於拘尸那城入般涅槃已經七日，無量人天廣陳供養，於其聚落總集四兵，象馬車步各自嚴辦種種器仗，共詣拘尸那城欲分舍利。",
        "translation": "After seven days had passed since the Bhagavān had entered parinirvāṇa in the city of Kuśinagara, measureless people and gods made extensive offerings, gathered four armies from that village, elephants, horses, chariots, and foot soldiers each prepared various weapons and went to the city of Kuśinagara together to share their relics.",
        "source": "T24n1451_038:0401c01_21"
    },
    {
        "source_sentence": "既至城已報諸人曰：「無上法王眾生慈父，我等諸人比於長夜供養恭敬，親承訓導受持正法。",
        "translation": "When they arrived in the city, they reported to the people, saying, “The unsurpassed king of the Dharma is the loving father of sentient beings. For a long time we humans have offered support and reverence to him, directly following his instruction and upholding the true-dharma.",
        "source": "T24n1451_038:0401c05_22"
    },
    {
        "source_sentence": "今既滅度，有餘舍利我等欲取，將往波波聚落，建窣覩波安置供養。」",
        "translation": "Now that he's extinguished, there are other relics we want to take, so we'll go to the village of Upāsaka and build a stupa to place them as an offering.",
        "source": "T24n1451_038:0401c07_23"
    },
    {
        "source_sentence": "城中諸人聞斯告已咸作是言：「世尊導師是我慈父親承訓誘，既於我界而般涅槃，全身舍利應留永劫於此供養，終不分與外邑諸人。」",
        "translation": "After the people in the city heard this announcement, they all said, Bhagavān, the guide of the Bhagavān is my loving father who instructed and tempted me, and since he's parinirvāṇa in our realm, his whole body and relics should be kept here for an eternity as an offering, never to be shared with the people outside the city.",
        "source": "T24n1451_038:0401c08_24"
    },
    {
        "source_sentence": "時波波人遣使答曰：「若分者善；",
        "translation": "The people of Parvata then sent an envoy to reply, saying:",
        "source": "T24n1451_038:0401c12_0"
    },
    {
        "source_sentence": "如不與者，我等當以強力奪取。」",
        "translation": "If you don't give it, we will take it away with force.",
        "source": "T24n1451_038:0401c12_1"
    },
    {
        "source_sentence": "城人聞已告彼眾曰：「徒事鬪戰，終不可得。」",
        "translation": "After the people of the city heard this, they told the crowd, They'll never get it if they fight in vain.",
        "source": "T24n1451_038:0401c13_2"
    },
    {
        "source_sentence": "爾時遮洛迦邑、部魯迦邑、阿羅摩邑、吠率奴邑、劫比羅城諸釋迦子、薜舍離栗姑毘子悉皆來集。",
        "translation": "It was then that the towns of Cāraka,部魯迦,阿羅摩邑,吠率奴邑,劫比羅城諸釋迦子、舍離栗姑毘子悉來集。",
        "source": "T24n1451_038:0401c15_0"
    },
    {
        "source_sentence": "是時摩伽陀國未生怨王，既聞佛世尊於拘尸那城入般涅槃，一切人天廣設供養。",
        "translation": "When the king of Magadha who hadn't yet become a resentful king heard that the Bhagavān had entered parinirvāṇa in the city of Kuśinagara, all people and gods made extensive offerings.",
        "source": "T24n1451_038:0401c17_1"
    },
    {
        "source_sentence": "既聞是事生大憂苦，遂告行雨大臣曰：「卿今知不？",
        "translation": "Having heard that this matter gave rise to great grief and suffering, he told the minister Xing Rai, Do you know it now?",
        "source": "T24n1451_038:0401c19_2"
    },
    {
        "source_sentence": "我聞世尊已入涅槃，在拘尸城大興供養，為爭舍利諸處競來欲相侵奪，我今亦往請取身骨。」",
        "translation": "I've heard that the Bhagavān has entered nirvāṇa and is making great offerings in Kuśinagara, but now I'm going to ask him to take my bones.",
        "source": "T24n1451_038:0401c20_3"
    },
    {
        "source_sentence": "臣曰：「如是，應裝整兵便往拘尸那城。」",
        "translation": "The minister said, So it is, you should prepare your troops and go to the city of Kuśinagara.",
        "source": "T24n1451_038:0401c22_4"
    },
    {
        "source_sentence": "時未生怨王遂乘大象欲往佛所，纔昇象上念佛恩深，心便悶絕從象墜墮宛轉于地，良久乃酥便乘馬去，念佛恩故不能抑止，還墮于地久穌息已，告行雨大臣曰：「我今不能親往佛所，卿等今者可領四兵，往拘尸那城傳我言教，問訊壯士少病小惱、起居輕利、安樂行不？",
        "translation": "At that time King Ajātaśatru, the enemy king of Vaiśravaṇa, wished to go before the Buddha. As soon as he ascended onto the top of his elephant and remembered the deep kindnesses of the Buddha, his mind was overcome with a feeling of great distress. He climbed down from the elephant and fell to the ground. After a long while, after passing away, he",
        "source": "T24n1451_038:0401c23_5"
    },
    {
        "source_sentence": "『世尊在日接引我等，長夜慇懃是我大師。",
        "translation": "'The Bhagavān is in the sun to guide us, and it's my great teacher for a long time.",
        "source": "T24n1451_038:0401c29_6"
    },
    {
        "source_sentence": "今於仁等聚落入般涅槃，有遺舍利幸與一分，於王舍城作窣覩波，冀申敬重香華伎樂種種供養。』」",
        "translation": "Now, when you enter parinirvāṇa in the village of Ren and so forth, there's a portion of the relic's relics that are fortunately given as offerings in the city of Rājagṛha in order to show respect for them, such as fragrant flowers, music, and various offerings.'",
        "source": "T24n1451_038:0402a01_7"
    },
    {
        "source_sentence": "行雨白言：「如王教勅。」",
        "translation": "The rain poured and said, As the king instructed me.",
        "source": "T24n1451_038:0402a03_8"
    },
    {
        "source_sentence": "即嚴四兵詣拘尸那城，告諸壯士曰：「仁等咸聽！",
        "translation": "He then gathered his four armies to the city of Kuśinagara and told the strong men, Listen, gentlemen!",
        "source": "T24n1451_038:0402a04_9"
    },
    {
        "source_sentence": "摩伽陀國未生怨王，問訊仁等具說如前，世尊大師於我等輩，常為饒益令得安樂，可尊可敬。",
        "translation": "Before the enemy king of Magadha arises, he greets you and tells you exactly as before. The Bhagavat, the great teacher, has always benefited us in order to make us attain well-being, which is honorable and venerable.",
        "source": "T24n1451_038:0402a05_10"
    },
    {
        "source_sentence": "今者於仁聚落入般涅槃，有遺舍利幸當與分，於王舍城建窣覩波廣興供養。」",
        "translation": "Now, when he enters parinirvāṇa in the humane village, there's a relic that's fortunate enough to be shared with him and built a stupa in Rājagṛha to make extensive offerings.",
        "source": "T24n1451_038:0402a07_11"
    },
    {
        "source_sentence": "諸壯士曰：「世尊誠是饒益安樂一切群生，可尊可敬。",
        "translation": "The strong men said, Bhagavān, it's really beneficial and peaceful to all sentient beings, worthy of honor and respect.",
        "source": "T24n1451_038:0402a09_12"
    },
    {
        "source_sentence": "然於今者在我聚落入般涅槃，有遺舍利王欲見分，此誠難得。」",
        "translation": "Still, now that he's entered parinirvāṇa in my village, there's a portion of what King Śāriputra wants to see, which is really difficult to attain.",
        "source": "T24n1451_038:0402a10_13"
    },
    {
        "source_sentence": "時行雨臣告諸壯士曰：「若其仁等能與者善，如不見分我加兵力強奪將去。」",
        "translation": "The ministers who carried the rain then told the strong men, If you can give it to them, it's good; if you don't see part of it, I'll force and take it away with my strength.",
        "source": "T24n1451_038:0402a11_14"
    },
    {
        "source_sentence": "答言：「任意。」",
        "translation": "He replied, arbitrary.",
        "source": "T24n1451_038:0402a13_15"
    },
    {
        "source_sentence": "時諸人眾悉皆大集闐噎城隅，城中所有壯士男女並閑弓射，即便總出象馬車步，嚴整四兵欲共七邑兵交合戰。",
        "translation": "The people then all gathered together at the corners of the city to scream, and the strong men and women in the city were calmly shooting with bows and arrows, so they collectively produced elephants, horses, chariots, and footsteps, and their four armies were well-arranged, intending to fight against each other in seven towns.",
        "source": "T24n1451_038:0402a13_16"
    },
    {
        "source_sentence": "根本說一切有部毘奈耶雜事卷第三十八",
        "translation": "Mūlasarvâstivāda-vinaya miscellaneous works of the Sarvâstivāda school, vol. 38",
        "source": "T24n1451_038:0402a17_0"
    }
]