[
    {
        "source_sentence": "根本說一切有部毘奈耶藥事",
        "translation": "Mūlasarvâstivāda-sūtra",
        "source": "T24n1448_006:0023c07_0"
    },
    {
        "source_sentence": "卷第六",
        "translation": "Vol. 6",
        "source": "T24n1448_006:0023c08_0"
    },
    {
        "source_sentence": "大唐三藏義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Jīvaka of the Great Tang",
        "source": "T24n1448_006:0023c10_0"
    },
    {
        "source_sentence": "爾時摩羯陀國未生怨王，及廣嚴城栗姑毘等，各造舡橋。",
        "translation": "At the time, the king of Magadha who hadn't yet arisen a grudge and the vastly adorned city of Rṛgbodhi and so forth each built a bridge of anger.",
        "source": "T24n1448_006:0023c11_0"
    },
    {
        "source_sentence": "于時諸龍便作是念：「我今身墮惡趣，應修福業。",
        "translation": "The dragons then had this thought, Now that I've fallen into a bad destiny in my body, I should cultivate good actions.",
        "source": "T24n1448_006:0023c12_1"
    },
    {
        "source_sentence": "各舉其頭，於弶伽河中相續為橋，令世尊等蹈上而過。」",
        "translation": "Each of them raised their heads and continued to form a bridge in the Ganges, so that the Bhagavān and others would step on it and pass by.",
        "source": "T24n1448_006:0023c13_2"
    },
    {
        "source_sentence": "作是念已，彼諸龍等各各舉頭相續為橋。",
        "translation": "After he had this thought, each of those dragons raised their heads and continued to build a bridge.",
        "source": "T24n1448_006:0023c14_3"
    },
    {
        "source_sentence": "爾時世尊告諸苾芻曰：「此三橋上，欲得過者，隨汝等心；",
        "translation": "It was then that the World-honored One said to the monks: Those who wish to go beyond these three bridges may do so according to their wishes.",
        "source": "T24n1448_006:0023c15_4"
    },
    {
        "source_sentence": "我當與阿難陀蹈彼龍橋渡弶伽水。」",
        "translation": "I will go with Ānanda to that dragon's bridge and cross the Ganges with him.",
        "source": "T24n1448_006:0023c16_5"
    },
    {
        "source_sentence": "其諸弟子或取未生怨橋、或取栗姑毘橋，唯有世尊及具壽阿難陀，於龍橋上而渡。",
        "translation": "Some of those disciples took the bridge over the enemy bridge that hadn't yet arisen or the bridge over the栗姑比, but only the Bhagavān and Kauśinagara and Ānanda crossed it on a dragon bridge.",
        "source": "T24n1448_006:0023c17_6"
    },
    {
        "source_sentence": "「智人渡大海，　　乘舡不作橋，",
        "translation": "A wise person crosses the great ocean, rides a carriage and doesn't build a bridge.",
        "source": "T24n1448_006:0023c19_7"
    },
    {
        "source_sentence": "　愚者海為橋，　　江河乘大舶。",
        "translation": "The sea of foolishness is a bridge, and the river rides on a great ship.",
        "source": "T24n1448_006:0023c19_7"
    },
    {
        "source_sentence": "　世尊已渡河，　　婆羅門處岸，",
        "translation": "The World-honored One has crossed the river. The brahmans are on shore.",
        "source": "T24n1448_006:0023c19_7"
    },
    {
        "source_sentence": "　聲聞乘栰去，　　苾芻但洗身。",
        "translation": "The śrāvakas ride on a cart and leave, but the monks simply wash their bodies.",
        "source": "T24n1448_006:0023c19_7"
    },
    {
        "source_sentence": "　觸處水平流，　　何煩別求井？",
        "translation": "If the place of touch is horizontal and flowing, why bother to search for a well separately?",
        "source": "T24n1448_006:0023c19_7"
    },
    {
        "source_sentence": "　斷除貪愛本，　　更當何所求？」",
        "translation": "To remove the root of craving, what else should you seek?",
        "source": "T24n1448_006:0023c19_7"
    },
    {
        "source_sentence": "爾時有一近事之男，而說頌曰：爾時世尊渡弶伽河已，遙見高原，告阿難陀曰：「汝見原不？",
        "translation": "It was then that a man of near service spoke these verses: At that time the World-honored One, having crossed the Ganges River, saw the high plain from a distance and said to Ānanda:",
        "source": "T24n1448_006:0023c19_7"
    },
    {
        "source_sentence": "欲識因緣，為汝宣說。」",
        "translation": "I want to know the causes and conditions, so I'll explain them for you.",
        "source": "T24n1448_006:0023c28_8"
    },
    {
        "source_sentence": "阿難陀白言：「唯願開示。」",
        "translation": "Ānanda said, Please reveal it.",
        "source": "T24n1448_006:0023c28_9"
    },
    {
        "source_sentence": "佛言：「此高原者，往昔大聲王建立寶幢之所。",
        "translation": "The Buddha said, This is a high plain where the great king of sound built a jeweled banner in the past.",
        "source": "T24n1448_006:0023c29_10"
    },
    {
        "source_sentence": "其寶幢量高一千尋，復以純金眾寶嚴飾，於此幢下廣施財物，作功德已，",
        "translation": "The jeweled banner was one thousand feet in height, adorned with pure gold and various other precious ornaments. Beneath the banner he offered a great deal of money and property to all those who perform meritorious deeds.",
        "source": "T24n1448_006:0024a01_11"
    },
    {
        "source_sentence": "即將寶幢棄弶伽河中。",
        "translation": "He then abandoned the jeweled banner in the Ganges River.",
        "source": "T24n1448_006:0024a03_12"
    },
    {
        "source_sentence": "汝今欲見此寶幢不？」",
        "translation": "Do you want to see this jeweled banner now?",
        "source": "T24n1448_006:0024a03_13"
    },
    {
        "source_sentence": "白言：「世尊！",
        "translation": "He said, Bhagavān!",
        "source": "T24n1448_006:0024a04_14"
    },
    {
        "source_sentence": "今正是時，我及苾芻咸願瞻覩。」",
        "translation": "Now is the right time, and I and the monks all wish to see it.",
        "source": "T24n1448_006:0024a04_15"
    },
    {
        "source_sentence": "爾時世尊以百福鞔萬字輪相施無畏手，觸彼高地。",
        "translation": "At the time, the Bhagavān gave his fearless hand with a hundred merits and ten thousand-syllable wheel of form to touch that high ground.",
        "source": "T24n1448_006:0024a06_0"
    },
    {
        "source_sentence": "時有諸龍，便作是念：「何故世尊以手觸地？」",
        "translation": "Some dragons then had this thought, Why did the Bhagavān touch the ground with his hand?",
        "source": "T24n1448_006:0024a07_1"
    },
    {
        "source_sentence": "即知如來為苾芻眾欲示寶幢。",
        "translation": "He then knew that the Tathāgata wanted to show the jeweled banner for the monks.",
        "source": "T24n1448_006:0024a08_2"
    },
    {
        "source_sentence": "時彼諸龍即於地中捧出寶幢，諸苾芻眾咸得瞻覩。",
        "translation": "The dragons then raised their jeweled banners from the ground, and all the monks and nuns were able to see them.",
        "source": "T24n1448_006:0024a08_3"
    },
    {
        "source_sentence": "時有苾芻名拔陀離，志性閑靜，僻在一處，補糞掃衣。",
        "translation": "At the time, there was a monk named Bhadrika with a quiet mind and a secluded place where he patched his robes with rags and swept away.",
        "source": "T24n1448_006:0024a10_4"
    },
    {
        "source_sentence": "爾時世尊告諸苾芻：「汝等速須觀視此幢形相，其幢不久尋即滅沒。」",
        "translation": "It was then that the Bhagavān addressed the monks, You must quickly examine the shape of this banner; it won't be long before its appearance ceases.",
        "source": "T24n1448_006:0024a12_0"
    },
    {
        "source_sentence": "既見滅已，諸苾芻等白言：「世尊！",
        "translation": "After seeing it cease, the monks and others said, Bhagavān!",
        "source": "T24n1448_006:0024a13_1"
    },
    {
        "source_sentence": "我等咸見，唯有具壽拔陀離，性樂閑靜，而補衣服不觀。",
        "translation": "We all saw that there was only Kauṣṭhila and Upāli, who were naturally blissful and quiet by nature but did not look around to change their clothes.",
        "source": "T24n1448_006:0024a14_2"
    },
    {
        "source_sentence": "為當離貪愛故？",
        "translation": "Why should they be free of craving?",
        "source": "T24n1448_006:0024a15_3"
    },
    {
        "source_sentence": "為復先曾觀見耶？",
        "translation": "Why is it that you've seen it before?",
        "source": "T24n1448_006:0024a16_0"
    },
    {
        "source_sentence": "不同瞻禮。",
        "translation": "They didn't pay homage to him.",
        "source": "T24n1448_006:0024a16_1"
    },
    {
        "source_sentence": "如若離欲，此亦有離欲者；",
        "translation": "Just as if someone were to be free from desire, there would also be one who is free from desire.",
        "source": "T24n1448_006:0024a16_2"
    },
    {
        "source_sentence": "若曾觀見，在於何處？」",
        "translation": "If you've ever observed it, where is it?",
        "source": "T24n1448_006:0024a17_3"
    },
    {
        "source_sentence": "佛即報言：「汝等當知！",
        "translation": "The Buddha then replied, You should know!",
        "source": "T24n1448_006:0024a17_4"
    },
    {
        "source_sentence": "此苾芻已離貪愛故，復曾瞻禮。」",
        "translation": "Because this monk has parted with craving, he once again paid homage.",
        "source": "T24n1448_006:0024a18_5"
    },
    {
        "source_sentence": "佛言：「昔時有王名曰叫聲，與天帝釋共為親友。",
        "translation": "The Buddha said, Once upon a time, there was a king named Screaming Sound who became intimate with Śakra Devānām-Indra.",
        "source": "T24n1448_006:0024a19_0"
    },
    {
        "source_sentence": "其叫聲王既無子息，心懷求乞，拓頰思念：『我今多有種種財寶，國位臣人悉皆充滿，",
        "translation": "The king cried out in distress, thinking to himself, “I now have a great deal of riches and jewels. All my officials and subjects are filled with such treasures.",
        "source": "T24n1448_006:0024a20_1"
    },
    {
        "source_sentence": "今無子息，我死之後當絕繼嗣。』",
        "translation": "Now, there's no child to stop, and after I die, I will cut off my heirs.'",
        "source": "T24n1448_006:0024a21_2"
    },
    {
        "source_sentence": "時天帝釋見叫聲王，便即問曰：『王今何故拓頰思念憂愁而住？』",
        "translation": "Seeing the screaming king, Śakra Devānām-Indra asked, 'Why is the king standing there now with his cheeks bared and thoughts of grief?'",
        "source": "T24n1448_006:0024a22_3"
    },
    {
        "source_sentence": "時王答曰：『我今多有種種庫藏，身若死後絕其繼嗣，所以憂愁。』",
        "translation": "The king then answered, 'Now, I have many kinds of storehouses in my body that will be cut off from their heirs after death, which is why I'm so sad and distressed.'",
        "source": "T24n1448_006:0024a24_4"
    },
    {
        "source_sentence": "帝釋報言：『勿須憂惱，我諸天子死相現者，勸令與王而作其子。』",
        "translation": "Śakra replied, 'There's no need to worry, for those of us gods who show their deadly appearance will be encouraged to become their sons with the king.'",
        "source": "T24n1448_006:0024a25_5"
    },
    {
        "source_sentence": "諸天常法，有欲死者，五衰相現。",
        "translation": "In the eternal law of gods, there are five signs of decay when someone dies from desire.",
        "source": "T24n1448_006:0024a26_6"
    },
    {
        "source_sentence": "云何為五？",
        "translation": "What are the five?",
        "source": "T24n1448_006:0024a27_7"
    },
    {
        "source_sentence": "一者衣裳垢膩、二者頭上花萎、三者口出惡氣、四者脇下汗流、五者不樂本座。",
        "translation": "One, their clothes are dirty and greasy, two, the flowers on their heads wither, three, bad breath coming out of their mouths, four, sweat flowing down from their sides, and five, not enjoying their original seats.",
        "source": "T24n1448_006:0024a27_8"
    },
    {
        "source_sentence": "後時有一天子衰相既現，帝釋勸言：『仁者可於叫聲王最大夫人腹內受生。』",
        "translation": "When the declining appearance of a celestial being later appeared, Indra exhorted him, saying, 'Sir, you may be born inside the womb of the first wife of King Screaming.'",
        "source": "T24n1448_006:0024a29_9"
    },
    {
        "source_sentence": "時天答帝釋言：『凡是國王，多造過失。",
        "translation": "The gods then answered Śakra, saying, 'All the kings of countries often commit errors.",
        "source": "T24n1448_006:0024b02_10"
    },
    {
        "source_sentence": "我若生彼，還造諸非，違法理人，當墮無間，不願生彼。』",
        "translation": "If I were to give rise to them, I'd still create what's wrong, and someone who doesn't follow the principle of non-dharma would fall into an unremitting state and not want to give rise to them.'",
        "source": "T24n1448_006:0024b03_11"
    },
    {
        "source_sentence": "帝釋報言：『仁者！",
        "translation": "Indra replied, 'Sir, my lord!",
        "source": "T24n1448_006:0024b04_12"
    },
    {
        "source_sentence": "我當加被，令汝省覺。』",
        "translation": "I will entrust it to you and cause you to realize it.'",
        "source": "T24n1448_006:0024b04_13"
    },
    {
        "source_sentence": "時天答言：『天主當知！",
        "translation": "The gods then replied, 'O lord of the gods, you should know!'",
        "source": "T24n1448_006:0024b05_14"
    },
    {
        "source_sentence": "諸天放逸，多著快樂，豈能憶我？』",
        "translation": "The gods are careless and mostly attached to happiness, so how could they remember me?'",
        "source": "T24n1448_006:0024b05_15"
    },
    {
        "source_sentence": "帝釋報言：『仁者！",
        "translation": "Indra replied, 'Sir, my lord!",
        "source": "T24n1448_006:0024b06_16"
    },
    {
        "source_sentence": "雖復如是，我終令汝憶知省覺。』",
        "translation": "Even so, I will cause you to remember and examine it.'",
        "source": "T24n1448_006:0024b06_17"
    },
    {
        "source_sentence": "時彼天子聞是語已，遂往叫聲王最大夫人腹內受胎。",
        "translation": "After hearing these words, the celestial prince then went to Screaming King's first wife and entered a womb in her belly.",
        "source": "T24n1448_006:0024b07_18"
    },
    {
        "source_sentence": "當受胎日，王諸人眾皆喜大叫。",
        "translation": "On the day he was about to enter the womb, the king's people were all joyful and shouted.",
        "source": "T24n1448_006:0024b08_19"
    },
    {
        "source_sentence": "日月既滿，遂生一子，顏貌端正，廣如上說，乃至鼻高修直。",
        "translation": "When the sun and moon were full he gave birth to a child whose appearance was as described above, up to the point where his nose was high and straight.",
        "source": "T24n1448_006:0024b09_20"
    },
    {
        "source_sentence": "時叫聲王集會眷屬，欲立其名：『與作何字？』",
        "translation": "The king of the screaming sound then gathered his retinue and wanted to name him, 'What's the word for it?'",
        "source": "T24n1448_006:0024b10_21"
    },
    {
        "source_sentence": "眷屬答言：『此之童子，入母胎時諸人大叫，應可立名為大叫聲。』",
        "translation": "The dependents replied, 'This boy, when he enters his mother's womb, the great screaming of people should be designated as a great wailing sound.'",
        "source": "T24n1448_006:0024b11_22"
    },
    {
        "source_sentence": "其王依請，遂立其名。",
        "translation": "Relying on the request, the king established his name.",
        "source": "T24n1448_006:0024b13_23"
    },
    {
        "source_sentence": "時大叫聲童子，授與八母，看侍長養：二為乳母、二恒洗濯、二常懷抱、二與戲樂。",
        "translation": "The boy cried out in a loud voice and gave it to eight mothers, two nursing nurses, two constant washing, two constant embracing, and two providing play and pleasure.",
        "source": "T24n1448_006:0024b13_24"
    },
    {
        "source_sentence": "每與乳、酪、醍醐、生熟酥等種種美味而為養育，猶如蓮花速令長大，",
        "translation": "He nourishes them with various delicacies such as milk, curds, butter, and cooked butter, just as a lotus flower grows quickly.",
        "source": "T24n1448_006:0024b15_25"
    },
    {
        "source_sentence": "聰叡開悟乃能善閑，十八種伎藝悉皆通達，才辯智慧無不通利。",
        "translation": "He was wise and enlightened, able to be good at leisure. He mastered all the eighteen kinds of arts and crafts, and possessed unfailing ability, eloquence, and wisdom.",
        "source": "T24n1448_006:0024b17_0"
    },
    {
        "source_sentence": "凡剎利王受灌頂位，人間自在有大力勢，遠近諸王皆悉降伏。",
        "translation": "Whenever the king of the kṣatriyas receives the consecration, he's free among humans and has great power to subdue all the kings from near and far.",
        "source": "T24n1448_006:0024b18_1"
    },
    {
        "source_sentence": "安置民人，要須具如是藝，善能調象，弄馬乘輅，施弓捻箭，於陣出入，",
        "translation": "They must be skilled in such skills to tame elephants, play horses and riding carriages, offer bows and arrows, and enter and leave the battlefield.",
        "source": "T24n1448_006:0024b19_2"
    },
    {
        "source_sentence": "善用鉤索，鐵箭鐵矟，踏地努拳，結髮莊束，善其射法。",
        "translation": "He was skilled in the art of archery, using hooks and cords as well as iron arrows and spears to strike the ground with his fist.",
        "source": "T24n1448_006:0024b21_3"
    },
    {
        "source_sentence": "略有五種：一者遠射悉皆穿穴、二者聞聲即射皆能殺戮、三者隨其要處悉能射之、四者亦射皆中、五者射入堅牢，",
        "translation": "In brief, there are five kinds: first, they can shoot from a distance and penetrate all the holes; second, they can kill when they hear sound of their shot; third, they can shoot wherever they need to be; fourth, they can also shoot in the middle; and fifth, they can shoot into a firmly fortified place.",
        "source": "T24n1448_006:0024b22_4"
    },
    {
        "source_sentence": "此之射法悉能善了。",
        "translation": "These archery rituals are all well-understood.",
        "source": "T24n1448_006:0024b25_5"
    },
    {
        "source_sentence": "王子法爾，父王在位，其名不顯。",
        "translation": "The prince's name isn't revealed when his father, the king, is in power.",
        "source": "T24n1448_006:0024b25_6"
    },
    {
        "source_sentence": "後於異時，叫聲大王身既崩已，時大叫聲太子策立登位。",
        "translation": "Later, at another time, after the body of the great king Screaming and Howling collapsed, the prince Screaming and Howling then rose to his throne.",
        "source": "T24n1448_006:0024b26_7"
    },
    {
        "source_sentence": "初紹王位，正法理人，至於後時，還行非法。",
        "translation": "At first he assumed the throne of kingship as a man who upheld the correct teachings and principles, but when he returned later he practiced what was against the Dharma.",
        "source": "T24n1448_006:0024b27_8"
    },
    {
        "source_sentence": "于時帝釋報言：『仁者！",
        "translation": "At the time, Indra replied, 'Sir, my lord!",
        "source": "T24n1448_006:0024b28_9"
    },
    {
        "source_sentence": "我昔勸汝與叫聲王為子。",
        "translation": "'In the past, I encouraged you to give Screaming King as your child.",
        "source": "T24n1448_006:0024b29_10"
    },
    {
        "source_sentence": "汝今不應行此非法而理於國，當墮地獄。』",
        "translation": "Now, you shouldn't do this unlawful thing and govern the country; you'll fall into hell.'",
        "source": "T24n1448_006:0024b29_11"
    },
    {
        "source_sentence": "時大聲王聞此語已，以正法理人，不久之間復行非法。",
        "translation": "After hearing these words, Mahāsvara heard them, and because of the correct principles of the Dharma and people, he soon again committed an unlawful act.",
        "source": "T24n1448_006:0024b30_12"
    },
    {
        "source_sentence": "於第二迴帝釋復告：『仁者！",
        "translation": "At the second turn, Śākyamuni again told him, 'Sir, my lord!",
        "source": "T24n1448_006:0024c01_13"
    },
    {
        "source_sentence": "我先勸汝與叫聲王為其太子。",
        "translation": "'First, I'll encourage you to give Screaming King as his prince.",
        "source": "T24n1448_006:0024c02_14"
    },
    {
        "source_sentence": "汝今不應行斯非法理於國位，當墮地獄。』",
        "translation": "Now, you shouldn't practice this unlawful principle at the state level; you'll fall into hell.'",
        "source": "T24n1448_006:0024c03_15"
    },
    {
        "source_sentence": "時大聲王答帝釋言：『我等國王多諸放逸，貪五欲樂，聞已便忘。",
        "translation": "King Mahāsudassana then answered Śakra, saying, 'Our kings are often lazy and greedy with the five desires and pleasures, and when they hear them, they forget them.",
        "source": "T24n1448_006:0024c04_16"
    },
    {
        "source_sentence": "唯願慈悲，留一記驗。",
        "translation": "Please have mercy and compassion and leave me with this assurance.",
        "source": "T24n1448_006:0024c05_17"
    },
    {
        "source_sentence": "我得見已，作諸功德。』",
        "translation": "After I've seen it, I'll create merits.'",
        "source": "T24n1448_006:0024c06_18"
    },
    {
        "source_sentence": "「爾時帝釋，勅工巧天(梵云毘首羯磨天)：『汝今可往大聲王宮端嚴道場，",
        "translation": "At that time the emperor Śakra, lord of the gods, said to the deities skilled in the arts and crafts (known as Vaiśravaṇa in Sanskrit:",
        "source": "T24n1448_006:0024c07_0"
    },
    {
        "source_sentence": "化作金幢舉高千尋，種種雜寶而為間錯。』",
        "translation": "He transforms himself into a golden banner that's a thousand feet high, and he mixes various kinds of treasures together.'",
        "source": "T24n1448_006:0024c08_1"
    },
    {
        "source_sentence": "時工巧天既受勅已，即往大聲王宮端嚴道場內化作金幢，舉高千等，眾寶莊嚴。",
        "translation": "After receiving the command, the skilled goddess of arts and crafts then went to the great sound king's palace and adorned himself inside the site of enlightenment with a gold banner one thousand feet in height, adorned with all kinds of treasures.",
        "source": "T24n1448_006:0024c09_2"
    },
    {
        "source_sentence": "時大聲王既見金幢，遂造施堂，修諸功德。",
        "translation": "When King Mahāsvara saw the golden banner, he built a charity hall to cultivate its merits.",
        "source": "T24n1448_006:0024c11_3"
    },
    {
        "source_sentence": "王令親舅，名阿輸迦，專守供養。",
        "translation": "The king ordered his uncle, named Aśoka, to guard and make offerings to him exclusively.",
        "source": "T24n1448_006:0024c12_4"
    },
    {
        "source_sentence": "是時國人悉皆樂見，既覩幢已，還往施堂，心不捨離，來往供養，遂廢家業。",
        "translation": "The people of the country then all delighted in seeing it. Having erected the banner, they returned to the charity hall but their minds were not dispassionate and came back and forth to make offerings, thus abandoning their family business.",
        "source": "T24n1448_006:0024c12_5"
    },
    {
        "source_sentence": "時王國稅不能充足，王之大臣隨少將進。",
        "translation": "At the time, the king's state hadn't enough to pay the tax, and his ministers were about to advance as little as possible.",
        "source": "T24n1448_006:0024c14_6"
    },
    {
        "source_sentence": "時大聲王既見物少，便即問言：『汝等何故少進租庸？』",
        "translation": "Seeing that the king of Mahāsvara had few things, he asked, 'Why are you paying little attention to the tenants?'",
        "source": "T24n1448_006:0024c15_7"
    },
    {
        "source_sentence": "諸臣答曰：『大王當知！",
        "translation": "The ministers replied, 'Great king, you should know!'",
        "source": "T24n1448_006:0024c16_8"
    },
    {
        "source_sentence": "贍部洲人施堂食已，即觀金幢，遂廢生業。",
        "translation": "After the people of Jambudvīpa gave food to the hall, they observed the gold banner and then abandoned their karma.",
        "source": "T24n1448_006:0024c17_9"
    },
    {
        "source_sentence": "由此因緣，租稅不足。』",
        "translation": "Because of these causes and conditions, the taxes aren't enough.'",
        "source": "T24n1448_006:0024c18_10"
    },
    {
        "source_sentence": "王便報曰：『宜廢施堂。』",
        "translation": "The king then reported, 'Should we abandon the donor's hall?'",
        "source": "T24n1448_006:0024c18_11"
    },
    {
        "source_sentence": "諸臣奉命，遂即除毀。",
        "translation": "The ministers obeyed the order, and they were then expelled.",
        "source": "T24n1448_006:0024c19_12"
    },
    {
        "source_sentence": "是時諸人自辦糧食，觀禮金幢，還不捨離，靡營家業，同前租稅不能充足。",
        "translation": "The people then prepared food and provisions for themselves, paid homage to the golden banner, and didn't abandon it. They were engaged in family business, which was the same as the previous one without paying any extra fee or charge.",
        "source": "T24n1448_006:0024c19_13"
    },
    {
        "source_sentence": "王又問言：『我令汝等既毀施堂，何故今者稅猶不足？』",
        "translation": "The king also asked, 'I've ordered you to destroy the hall of giving, so why isn't the tax sufficient now?'",
        "source": "T24n1448_006:0024c21_14"
    },
    {
        "source_sentence": "臣復答言：『大王當知！",
        "translation": "The ministers again replied, 'Great king, you should know!'",
        "source": "T24n1448_006:0024c22_15"
    },
    {
        "source_sentence": "彼諸人眾，自辦資糧，食已觀覩金幢，不營家業，是故租庸猶不充足。』",
        "translation": "Those people in the crowd prepared their own provisions and ate, observed the gold banner after eating it, and didn't engage in family business; therefore, the lease is still insufficient.'",
        "source": "T24n1448_006:0024c23_16"
    },
    {
        "source_sentence": "時大聲王廣作布施，造諸功德，遂將金幢投弶伽河內。」",
        "translation": "The king Mahāsvara then made a wide offering of merits, and he threw the gold banner into the Ganges River.",
        "source": "T24n1448_006:0024c24_17"
    },
    {
        "source_sentence": "佛告諸苾芻：「勿作異念！",
        "translation": "The Buddha told the monks, Don't think differently!",
        "source": "T24n1448_006:0024c25_18"
    },
    {
        "source_sentence": "彼大聲王親舅阿輸迦者，今拔陀離苾芻是。",
        "translation": "That great sound king's father-in-law Aśoka was the present-day Bhadrika monk.",
        "source": "T24n1448_006:0024c26_19"
    },
    {
        "source_sentence": "由昔因中守護供養，所以不來觀禮金幢。」",
        "translation": "Because they were guarded and offered support in the past, they didn't come to pay homage to the golden banner.",
        "source": "T24n1448_006:0024c27_20"
    },
    {
        "source_sentence": "時諸苾芻咸問世尊：「此之金幢何處壞滅？」",
        "translation": "The monks then all asked the Bhagavān, Where will this gold banner break down?",
        "source": "T24n1448_006:0024c28_21"
    },
    {
        "source_sentence": "佛言：「於未來世人壽八萬歲時，有轉輪聖王名曰餉佉，如法理世，十善化人。",
        "translation": "The Buddha said, In the future when people's life span is 80,000 years, there will be a wheel-turning sage king named Śākyamuni, who will follow the Dharma and principles of the world and skillfully transform people with the ten good qualities.",
        "source": "T24n1448_006:0024c29_22"
    },
    {
        "source_sentence": "時王具足四種兵軍，能降一切悉皆得勝。",
        "translation": "The king then had four kinds of armies, and they were able to subdue all of them and attain victory.",
        "source": "T24n1448_006:0025a02_23"
    },
    {
        "source_sentence": "常修善品為大法王，具有七寶，所謂輪寶、象寶、馬寶、珠寶、女寶、主藏臣寶、主兵臣寶。",
        "translation": "He always cultivates good qualities as the great king of the Dharma and possesses seven treasures, which are called wheel treasure, elephant treasure, horse treasure, jewelry, women treasure, treasury treasure, and army treasure.",
        "source": "T24n1448_006:0025a03_0"
    },
    {
        "source_sentence": "王有千子，勇健多力，能破怨敵，遍四洲界悉皆賓伏，一切人民無有侵奪。",
        "translation": "The king had a thousand sons, valiant and strong, capable of defeating enemies. All the four continents were completely subjugated by them; all the people did not attack or harm them.",
        "source": "T24n1448_006:0025a04_1"
    },
    {
        "source_sentence": "犯罪之者，不行刀杖，以法宣令自然調伏。",
        "translation": "Those who commit crimes don't use swords or sticks, and they naturally subdue them by proclaiming the Dharma.",
        "source": "T24n1448_006:0025a06_2"
    },
    {
        "source_sentence": "時王有婆羅門名曰善淨，是王大臣，善淨有妻名曰淨妙，常以慈心遍覆一切。",
        "translation": "There was a brāhmaṇa named Sunetra, the king's minister, who had a wife named Sunetra and always covered all people with a compassionate mind.",
        "source": "T24n1448_006:0025a07_3"
    },
    {
        "source_sentence": "後時誕子，號為慈氏。",
        "translation": "At that time a boy named Maitreya was born to him.",
        "source": "T24n1448_006:0025a09_4"
    },
    {
        "source_sentence": "時善淨大臣，常教八萬摩納婆等四薜陀論。",
        "translation": "At the time, the minister of good purity always taught 80,000 Manabha and other four treatises on sexual misconduct.",
        "source": "T24n1448_006:0025a09_5"
    },
    {
        "source_sentence": "以摩納婆等付與慈氏，令教習讀四薜陀論。",
        "translation": "Manabha and others entrusted it to Maitreya, who ordered them to teach and study the four treatises of the Gandhāra.",
        "source": "T24n1448_006:0025a10_6"
    },
    {
        "source_sentence": "時四天王各持伏藏及以金幢奉獻餉佉，所謂氷竭羅伏藏從羯陵伽國來；",
        "translation": "The four guardian gods of the heavens then each presented the ambrosia treasury and the golden banner, which was called the ambrosia treasury of icy glow coming from the kingdom of Kaliṅga.",
        "source": "T24n1448_006:0025a11_7"
    },
    {
        "source_sentence": "般逐迦大藏從密絺羅國來；",
        "translation": "The Mahāprajñāpāramitā-paripṛcchā came from the country of Mitra.",
        "source": "T24n1448_006:0025a13_8"
    },
    {
        "source_sentence": "伊羅鉢羅藏從揵陀羅國來；",
        "translation": "Elāpattra came from the country of Kaṇḍāla.",
        "source": "T24n1448_006:0025a14_9"
    },
    {
        "source_sentence": "餉佉大藏從波羅痆斯城來。",
        "translation": "The Mahāprajñāpāramitā-sūtra came from the city of Vārāṇasī.",
        "source": "T24n1448_006:0025a14_10"
    },
    {
        "source_sentence": "時餉佉王持此金幢施與善淨，善淨受已施與慈氏，慈氏受已，施與八萬摩納婆等，",
        "translation": "The king of Kauṇḍinya then gave this golden banner to Suprajit, who gave it to Maitreya after he accepted it. After Maitreya accepted it, he gave 80,000 manas and so forth.",
        "source": "T24n1448_006:0025a15_11"
    },
    {
        "source_sentence": "摩納受已各共分之。",
        "translation": "After receiving it, Mānava shared it with them.",
        "source": "T24n1448_006:0025a17_12"
    },
    {
        "source_sentence": "是時慈氏見此寶幢須臾無常，知一切法皆悉磨滅，心生憂惱。",
        "translation": "At the time, Maitreya saw that this jeweled banner was impermanent for a moment, knew all dharmas were completely annihilated, and became sad at heart.",
        "source": "T24n1448_006:0025a17_13"
    },
    {
        "source_sentence": "即趣靜林，起大慈悲，以智慧劍截諸煩惱，證得無上菩提智，號曰彌勒應正等覺。",
        "translation": "He then proceeded to the quiet forest, aroused great compassion, cut off all afflictions with the sword of wisdom, and realized the unsurpassed knowledge of enlightenment, which was called Maitreya Perfectly Enlightened.",
        "source": "T24n1448_006:0025a19_14"
    },
    {
        "source_sentence": "既成佛已，即於其日，時餉佉王七寶隱沒。",
        "translation": "On the day after he had become a buddha, the seven treasures of King Śākyamuni were hidden in seclusion.",
        "source": "T24n1448_006:0025a21_15"
    },
    {
        "source_sentence": "既見是已，遂與八萬國王前後圍繞亦隨出家。",
        "translation": "Having seen this, he was surrounded by 80,000 kings and renounced the householder’s life.",
        "source": "T24n1448_006:0025a22_16"
    },
    {
        "source_sentence": "時王女寶名毘舍佉，亦與八萬宮人婇女隨共出家。",
        "translation": "The king's daughter, the treasured name Vaiśravaṇa, also left home with 80,000 palace ladies and women.",
        "source": "T24n1448_006:0025a23_17"
    },
    {
        "source_sentence": "時善淨大臣，與八萬摩納婆等亦隨出家。",
        "translation": "The minister Sunetra then left home along with 80,000 Manabhas and others.",
        "source": "T24n1448_006:0025a24_18"
    },
    {
        "source_sentence": "爾時彌勒佛與八萬俱胝苾芻，前後圍繞詣尊足山，向迦攝波苾芻骨鎖留身之所，",
        "translation": "At that time Maitreya Buddha and the eighty thousand koṭis of bhikṣus, surrounded by them in front and behind him, proceeded to the foot of the mountain. They approached the place where Kāśyapa Bhikṣu had his body encased in a chain of bones.",
        "source": "T24n1448_006:0025a25_19"
    },
    {
        "source_sentence": "指山門開。",
        "translation": "He pointed to the mountain gate and opened it.",
        "source": "T24n1448_006:0025a27_20"
    },
    {
        "source_sentence": "于時彌勒世尊，以其右手擎取迦攝全身骨鎖，置左掌中，為諸聲聞廣說妙法，",
        "translation": "Bhagavān Maitreya then lifted the entire body of Kāśyapa with his right hand, placed it in his left palm, and taught the wonderful Dharma to the śrāvakas.",
        "source": "T24n1448_006:0025a27_21"
    },
    {
        "source_sentence": "告諸苾芻：『汝等當知！",
        "translation": "He told the monks, 'You should know!'",
        "source": "T24n1448_006:0025a29_22"
    },
    {
        "source_sentence": "過去世時，人壽百歲，有佛名釋迦牟尼，出於世間。",
        "translation": "In a past world when the human life span was one hundred years, a buddha named Śākyamuni emerged from the world.",
        "source": "T24n1448_006:0025a29_23"
    },
    {
        "source_sentence": "此之迦攝，是彼聲聞，少欲知足，杜多第一。",
        "translation": "This Kāśyapa is the first among śrāvakas who have few desires and are satisfied, and Duda is the first.",
        "source": "T24n1448_006:0025b01_24"
    },
    {
        "source_sentence": "彼佛滅後，能結集釋迦牟尼教法。』",
        "translation": "After the cessation of that Buddha, he'll be able to compile the teachings of Śākyamuni.'",
        "source": "T24n1448_006:0025b02_25"
    },
    {
        "source_sentence": "時彌勒佛諸聲聞等既見迦攝留身之骨，心生憂惱：『如何此身，能證如是種種功德？』",
        "translation": "When Maitreya Buddha and the śrāvakas saw the bones of Kāśyapa's body, their minds became sad and distressed, saying, 'How can this body realize such various merits?'",
        "source": "T24n1448_006:0025b03_26"
    },
    {
        "source_sentence": "時彌勒世尊諸弟子等，由生憂惱，俱時現證阿羅漢果。",
        "translation": "At the time, Bhagavān Maitreya and his disciples were both grieved and distressed, and they all now realized the fruit of arhatship at the same time.",
        "source": "T24n1448_006:0025b05_27"
    },
    {
        "source_sentence": "于時有九十六俱胝阿羅漢，能證杜多而生厭離。",
        "translation": "At the time, there were ninety-six koṭi of arhats who were able to realize Dutta and become disillusioned with it.",
        "source": "T24n1448_006:0025b06_28"
    },
    {
        "source_sentence": "時彼金幢便即隱沒。",
        "translation": "The golden banner then disappeared.",
        "source": "T24n1448_006:0025b07_29"
    },
    {
        "source_sentence": "「諸苾芻等便白佛言：『有何因緣，餉佉輪王，今與世尊同時出世？』",
        "translation": "The monks and others then said to the Buddha, 'What's the reason why the wheel-turning king Śākyamuni is appearing in the world at the same time as the Bhagavān?'",
        "source": "T24n1448_006:0025b08_30"
    },
    {
        "source_sentence": "彼佛告言：『由願力故。』",
        "translation": "The Buddha told them, 'It's because of the power of their vow.'",
        "source": "T24n1448_006:0025b09_31"
    },
    {
        "source_sentence": "苾芻復問：『云何願力？』",
        "translation": "Again, the monk asked, 'What's the power of the vow?'",
        "source": "T24n1448_006:0025b10_32"
    },
    {
        "source_sentence": "時彌勒佛為諸苾芻說：『於往昔中天竺國，是時有王名摩娑婆，正法理民，",
        "translation": "Maitreya then said to the bhikṣus: Once upon a time, in the ancient India, there was a king named musa (i.e., Mahesvara) who ruled over the people of Jambudvīpa and upholded the true-dharma.",
        "source": "T24n1448_006:0025b10_33"
    },
    {
        "source_sentence": "國界豐樂，無諸諍訟，人眾充滿，常有花果，雨澤順時，五穀成熟。",
        "translation": "The land borders are rich and pleasant, with no disputes or controversies. All the inhabitants are full of people and there are always plenty of flowers and fruit. The rain and soil are seasonal and the five grains are ripe.",
        "source": "T24n1448_006:0025b12_34"
    },
    {
        "source_sentence": "時北天竺國有王名曰多財，亦正法理世，國界豐樂，無眾諍訟，人眾充滿，",
        "translation": "In the northern Indian country of Jambudvīpa there was a king named Prabhūtaratna, who also upheld the right Dharma and the principles of the world. His territory was prosperous and he had no disputes or controversies.",
        "source": "T24n1448_006:0025b13_35"
    },
    {
        "source_sentence": "常有花果，雨澤順時，五穀成熟。",
        "translation": "Flowers and fruit are always present, and the five grains are ripened at the proper time of rain and moisture.",
        "source": "T24n1448_006:0025b15_36"
    },
    {
        "source_sentence": "後於異時，中天竺王有一大臣產生一子，其子生時，自然耳有寶璫隨身而出。",
        "translation": "At another time, there was a minister of the king of Central India who gave birth to a son. When his son was born, he naturally had a jeweled ear ring in his body and came out.",
        "source": "T24n1448_006:0025b16_37"
    },
    {
        "source_sentence": "子既生已，即集親屬，慶喜設會，與立其名。",
        "translation": "When the prince had been born, they gathered their relatives together to celebrate the occasion and established an assembly in which to establish his name.",
        "source": "T24n1448_006:0025b17_38"
    },
    {
        "source_sentence": "由子初生耳有寶璫，遂從立稱名曰寶光。",
        "translation": "Because the ear of his firstborn child had a precious ring in it, he was named Jewel Light.",
        "source": "T24n1448_006:0025b18_39"
    },
    {
        "source_sentence": "時此寶光，後於異時，見老病死心懷憂惱，即棄俗緣趣於山林，當日能證阿耨多羅三藐三菩提，",
        "translation": "At that time this Jewel Light, on another occasion, seeing old age, sickness, and death with sorrow in their hearts, abandoned worldly conditions and headed for a mountain forest. On that day he was able to realize highest, complete enlightenment.",
        "source": "T24n1448_006:0025b19_40"
    },
    {
        "source_sentence": "便即號為寶光如來。",
        "translation": "He then called himself the Jewel Light Tathāgata.",
        "source": "T24n1448_006:0025b21_41"
    },
    {
        "source_sentence": "復於異時，北天竺國多財之王，昇於高樓，與諸大臣前後圍繞，告群臣曰：「頗有如我國土，",
        "translation": "Again, on another different occasion, the wealthy king of the northern Indian kingdom ascended to a high building surrounded by his ministers.",
        "source": "T24n1448_006:0025b22_42"
    },
    {
        "source_sentence": "人眾豐樂，無諸諍訟，雨澤順時，五穀成熟，常受快樂。」",
        "translation": "The people are abundant and happy, there are no disputes or controversies, rain and moisture follow the seasons, and the five grains mature and always experience happiness.",
        "source": "T24n1448_006:0025b24_43"
    },
    {
        "source_sentence": "時有商人，曾向中天竺國，前白王曰：「彼中天竺有王名摩娑婆，其國豐樂，",
        "translation": "At that time a merchant traveled to the kingdom of Central India. He said to the king, “There is a king named musa in Central India whose country is prosperous and well populated.",
        "source": "T24n1448_006:0025b25_44"
    },
    {
        "source_sentence": "與王相似。」",
        "translation": "They're similar to the king.",
        "source": "T24n1448_006:0025b27_45"
    },
    {
        "source_sentence": "時多財王聞此語已，心大瞋怒，便告大臣曰：「汝等即可嚴四種兵，我今自往伐彼摩娑婆王，",
        "translation": "Having heard these words, King Mahākātyāyana became greatly angry and said to his ministers, “You may prepare four divisions of your troops.",
        "source": "T24n1448_006:0025b27_46"
    },
    {
        "source_sentence": "并破國土。」",
        "translation": "It also destroys the land.",
        "source": "T24n1448_006:0025b29_47"
    },
    {
        "source_sentence": "時多財王即領兵眾：一者象兵、二者馬兵、三者車兵、四者步兵，各嚴器仗，",
        "translation": "Then King Mahākātyāyana led the army of soldiers, consisting of elephant troops, cavalrymen, horse troops, chariot troops, and infantrymen, each equipped with their own weapons.",
        "source": "T24n1448_006:0025b29_48"
    },
    {
        "source_sentence": "遂向中天，渡弶伽河已，南岸而住。",
        "translation": "He then proceeded toward the middle heaven, crossed the Ganges River, and remained on the southern bank.",
        "source": "T24n1448_006:0025c02_49"
    },
    {
        "source_sentence": "時摩娑婆王聞多財王領四種兵馬至河南岸。",
        "translation": "The king of Māra then heard that King Prabhūtaratna had led four kinds of soldiers and horses to the southern shore.",
        "source": "T24n1448_006:0025c03_50"
    },
    {
        "source_sentence": "既聞是已，亦嚴四兵，各持軍器，渡弶伽河北岸而住。",
        "translation": "Having heard this announcement, the fourfold army, each holding an armed weapon, crossed the Ganges to the northern bank of the Ganges and remained there.",
        "source": "T24n1448_006:0025c04_51"
    },
    {
        "source_sentence": "時寶光如來知此二王正堪調伏，來至弶伽河止宿而住，於其夜中起世間心。",
        "translation": "Knowing that these two kings were capable of being subdued, the Jewel Light Tathāgata then came to the Ganges and stayed overnight there, and in the middle of the night he raised his worldly mind.",
        "source": "T24n1448_006:0025c05_52"
    },
    {
        "source_sentence": "諸佛常法，若起念時，帝釋梵王護世善神即知佛念。",
        "translation": "The buddhas always teach that when they give rise to mindfulness, Indra, Brahmā, and the world-protecting good deities know the Buddha's mindfulness.",
        "source": "T24n1448_006:0025c07_53"
    },
    {
        "source_sentence": "彼諸天等既知念已，來至佛所，頂禮佛足，退坐一面。",
        "translation": "Knowing the thought, those gods and others came to the Buddha, bowed their heads at his feet, withdrew, and sat to one side.",
        "source": "T24n1448_006:0025c08_54"
    },
    {
        "source_sentence": "由彼天光赫焃照彼摩娑婆王軍眾。",
        "translation": "It's because that divine light shines brightly and brilliantly to illuminate the king's army of Māra.",
        "source": "T24n1448_006:0025c09_55"
    },
    {
        "source_sentence": "時多財王見彼光明，心生驚怪，問諸臣曰：「是何光明，照耀彼軍？」",
        "translation": "Seeing that light, King Mahāprajāpatī was startled and asked his ministers, What's the light that shines on that army?",
        "source": "T24n1448_006:0025c10_56"
    },
    {
        "source_sentence": "群臣答曰：「彼摩娑婆王國內有佛出世號曰寶光如來，帝釋諸天悉來供養，",
        "translation": "The ministers replied, “In the kingdom of Māra there was a buddha named Jewel Light Tathāgata who appeared in the world. All the Indra gods came to make offerings to him.",
        "source": "T24n1448_006:0025c11_57"
    },
    {
        "source_sentence": "具大威德，有斯光明。」",
        "translation": "It's endowed with great authority and virtue, and it has this light.",
        "source": "T24n1448_006:0025c13_58"
    },
    {
        "source_sentence": "時多財王告諸臣曰：「彼摩娑婆王國內有此佛寶二足福田出現世間，感得梵天王等常來供養，",
        "translation": "Then King Prabhūtaratna said to his ministers, “In the kingdom of Māra there appeared in the world these two-legged field of blessedness belonging to the Buddha.",
        "source": "T24n1448_006:0025c14_59"
    },
    {
        "source_sentence": "我今豈得損彼王身國軍人眾。」",
        "translation": "How could I now harm the king's body or the army and people of his country?",
        "source": "T24n1448_006:0025c16_60"
    },
    {
        "source_sentence": "時多財王即遣使者報彼王曰：「王今可來共我相見。",
        "translation": "The king of much wealth then sent an envoy to report to the king, saying, Now, king, you may come and see me.",
        "source": "T24n1448_006:0025c17_0"
    },
    {
        "source_sentence": "汝大福德，國中感得二足福田寶光如來應正等覺，釋梵諸天而來供養。",
        "translation": "Your great merit is that the Tathāgata Worthy of Correct Enlightenment, the two-legged field of blessedness and jeweled light acquired in your country, and the Śakra Devānām-Indra gods came to make offerings.",
        "source": "T24n1448_006:0025c18_1"
    },
    {
        "source_sentence": "然我今者欲得相見，執手取辭，彼此無畏，各得安穩。」",
        "translation": "Still, now that I want to see each other, I'll hold my hand and take my words with me, so they won't fear each other and will attain stability.",
        "source": "T24n1448_006:0025c19_2"
    },
    {
        "source_sentence": "時摩娑婆王聞此語已，心懷不信，遂往寶光佛所，頂禮雙足，退坐一面，",
        "translation": "Having heard these words, King Māra disbelieved in them. So he went to the buddha Jewel Light, bowed his head at both feet, withdrew, and sat to one side.",
        "source": "T24n1448_006:0025c21_3"
    },
    {
        "source_sentence": "而白佛言：「世尊！",
        "translation": "He said to the Buddha, Bhagavān!",
        "source": "T24n1448_006:0025c22_4"
    },
    {
        "source_sentence": "彼多財王遣使相喚，欲得相見，執手取辭。",
        "translation": "That wealthy king of many possessions sent an envoy to summon them, wanting to see each other, held their hands together, and took his leave.",
        "source": "T24n1448_006:0025c23_5"
    },
    {
        "source_sentence": "我今不知云何？",
        "translation": "Now, I don't know what it is.",
        "source": "T24n1448_006:0025c24_6"
    },
    {
        "source_sentence": "世尊遣我去不？」",
        "translation": "Will the Bhagavān send me away?",
        "source": "T24n1448_006:0025c24_7"
    },
    {
        "source_sentence": "爾時寶光如來報曰：「大王！",
        "translation": "It was then that the Jewel Light Tathāgata reported, Great king!",
        "source": "T24n1448_006:0025c24_8"
    },
    {
        "source_sentence": "今可往看，必得安穩。」",
        "translation": "Now, you can go and look around, and you'll surely attain stability.",
        "source": "T24n1448_006:0025c25_9"
    },
    {
        "source_sentence": "時王復問佛曰：「我今至彼，既相見已，如何設禮？」",
        "translation": "The king then again asked the Buddha, Now that I've arrived there, how can I pay homage after seeing each other?",
        "source": "T24n1448_006:0025c25_10"
    },
    {
        "source_sentence": "佛告王曰：「彼王有力，應先禮拜。」",
        "translation": "The Buddha told the king, That king is powerful; he should first venerate him.",
        "source": "T24n1448_006:0025c27_0"
    },
    {
        "source_sentence": "時摩娑婆王聞佛語已，即往多財王所，欲禮雙足。",
        "translation": "After hearing the Buddha's words, King Māsābha went to the king of many possessions and wanted to bow at their feet.",
        "source": "T24n1448_006:0025c27_1"
    },
    {
        "source_sentence": "時多財王即起迎接，相抱撫拍，共相慰喻，歡喜取辭。",
        "translation": "King Prabhūtaratna then rose to greet them, embraced and patted them, comforted them together, and rejoicingly took their leave.",
        "source": "T24n1448_006:0025c28_2"
    },
    {
        "source_sentence": "還至佛所，頂禮雙足，退坐一面。",
        "translation": "He returned to the Buddha, bowed his head at his feet, withdrew, and sat to one side.",
        "source": "T24n1448_006:0026a01_3"
    },
    {
        "source_sentence": "時摩娑婆而白言：「世尊！",
        "translation": "Māra then said, Bhagavān!",
        "source": "T24n1448_006:0026a01_4"
    },
    {
        "source_sentence": "一切諸王，誰為最尊，合受禮敬？」",
        "translation": "Who among all the kings is the most honored, and who are they venerated together?",
        "source": "T24n1448_006:0026a02_5"
    },
    {
        "source_sentence": "佛報王曰：「轉輪聖王合受禮拜。」",
        "translation": "The Buddha answered the king, Wheel-Turning Sage King, accepting and venerating it together.",
        "source": "T24n1448_006:0026a03_6"
    },
    {
        "source_sentence": "王聞佛語，專記在心，即從座起，偏袒右肩，合掌向佛，而白佛言：「唯願世尊及苾芻眾受我等請，",
        "translation": "When the king heard these words of the Buddha, he concentrated his thoughts on them. He rose from his seat, bared his right shoulder, joined his palms in respect toward the Buddha, and said to him: May the World-honored One and the bhikṣus accept our invitation!",
        "source": "T24n1448_006:0026a03_7"
    },
    {
        "source_sentence": "明日供養。」",
        "translation": "I'll make an offering tomorrow.",
        "source": "T24n1448_006:0026a06_8"
    },
    {
        "source_sentence": "于時世尊默然而受。",
        "translation": "The Bhagavān then accepted it in silence.",
        "source": "T24n1448_006:0026a06_9"
    },
    {
        "source_sentence": "乃至世尊食訖，嚼齒木，嗽淨水已，時摩娑婆王即於佛前至誠發願：「我今供佛并諸聖眾所有功德，",
        "translation": "When the World-honored One had finished his meal, he chewed on the wood of his teeth and tooth relic bones and rinsed himself with clean water. At that moment King Mahāsudassana approached the Buddha and made a sincere vow before him:",
        "source": "T24n1448_006:0026a06_10"
    },
    {
        "source_sentence": "持此善根，願我當得轉輪聖王。」",
        "translation": "Holding these good roots, may I attain the wheel-turning sage king.",
        "source": "T24n1448_006:0026a09_0"
    },
    {
        "source_sentence": "既發願已，忽聞有吹螺之聲。",
        "translation": "After he had made the vow, he suddenly heard the sound of a conch blowing.",
        "source": "T24n1448_006:0026a09_1"
    },
    {
        "source_sentence": "爾時寶光如來便與授記：「汝當來世人壽八萬歲時，汝當出世作轉輪王，",
        "translation": "It was then that the Tathāgata Jewel Light gave him this prediction: In the future, when the human life span is eighty thousand years, you will appear in the world as a wheel-turning king.",
        "source": "T24n1448_006:0026a10_2"
    },
    {
        "source_sentence": "號曰餉佉。」",
        "translation": "It's called a rice bowl.",
        "source": "T24n1448_006:0026a12_3"
    },
    {
        "source_sentence": "眾人聞已，出極大聲。",
        "translation": "After the crowd heard this, a very loud voice sounded out.",
        "source": "T24n1448_006:0026a12_4"
    },
    {
        "source_sentence": "彼多財王去猶未遠，聞此叫聲，問群臣曰：「摩娑婆王國內有何因緣，",
        "translation": "Not far away from him, however, King Prabhāsa heard the sound of this cry. Hearing it, he asked the courtiers, “What is the reason why so many people in the kingdom of Māra’s household are calling out to you?",
        "source": "T24n1448_006:0026a12_5"
    },
    {
        "source_sentence": "出此大聲？」",
        "translation": "What's the great sound that comes out?",
        "source": "T24n1448_006:0026a14_6"
    },
    {
        "source_sentence": "諸臣察問，尋報王曰：「寶光如來與摩娑婆王授記，於當來世作轉輪王。",
        "translation": "The ministers questioned him and reported to the king, saying, “The Tathāgata Jewel Light grants a prediction to King Massābha that he will become a universal ruler in the future.",
        "source": "T24n1448_006:0026a14_7"
    },
    {
        "source_sentence": "彼諸人等聞此記已，歡喜踊躍，為此緣故出大叫聲。」",
        "translation": "After hearing this assurance, those people rejoiced and jumped for joy, and for this reason they produced a great wailing sound.",
        "source": "T24n1448_006:0026a16_8"
    },
    {
        "source_sentence": "時多財王聞此語已，遂即迴駕，詣寶光如來正等覺所，頂禮雙足，退坐一面，",
        "translation": "Having heard these words, King Prabhūtaratna turned his carriage and rode to the place where the Tathāgata Ratnachuda was staying. After honoring him by bowing his forehead at [the Buddha’s] feet, he withdrew and sat to one side.",
        "source": "T24n1448_006:0026a17_9"
    },
    {
        "source_sentence": "而白佛言：「世尊！",
        "translation": "He said to the Buddha, Bhagavān!",
        "source": "T24n1448_006:0026a19_0"
    },
    {
        "source_sentence": "一切世間誰合受輪王禮拜？」",
        "translation": "Who in all the worlds will assemble to receive the wheel-turning king's veneration?",
        "source": "T24n1448_006:0026a19_1"
    },
    {
        "source_sentence": "佛告大王：「唯有如來、應、正等覺，合受轉輪聖王禮拜供養。」",
        "translation": "The Buddha told the great king, Only the Tathāgata, Arhat, and Perfectly Enlightened One are united with the wheel-turning sage king to venerate and make offerings.",
        "source": "T24n1448_006:0026a20_0"
    },
    {
        "source_sentence": "時多財王從坐而起，整理衣服，頂禮佛已，合掌恭敬，而白佛言：「唯願世尊及苾芻僧伽，",
        "translation": "Then King Prakarasārin rose from his seat, arranged his clothes, bowed his head at the Buddha’s feet, joined his palms in respect, and said to him:",
        "source": "T24n1448_006:0026a21_1"
    },
    {
        "source_sentence": "明日受我微供。」",
        "translation": "You'll receive my humble offerings tomorrow.",
        "source": "T24n1448_006:0026a23_2"
    },
    {
        "source_sentence": "乃至食訖，收鉢澡嗽已，時多財王起大慈悲，普遍生界，便發願言：「以此供養善根，",
        "translation": "When the meal was over, he put away his bowl and bathed. Then King Mahāprajāpatī arose from great compassion for all sentient beings in the realm of rebirth and made the following vow:",
        "source": "T24n1448_006:0026a23_3"
    },
    {
        "source_sentence": "願我當來早得成佛，為天人師。」",
        "translation": "May I attain buddhahood in the future as a teacher of gods and humans.",
        "source": "T24n1448_006:0026a25_4"
    },
    {
        "source_sentence": "佛即報曰：「大王當知！",
        "translation": "The Buddha then replied, Great king, you should know!",
        "source": "T24n1448_006:0026a26_5"
    },
    {
        "source_sentence": "於未來世人壽八萬歲時，當得作佛名曰彌勒，十號具足。」",
        "translation": "At the time when people's life span in the future will be 80,000 years, they'll become buddhas named Maitreya, and their ten names will be complete.",
        "source": "T24n1448_006:0026a26_6"
    },
    {
        "source_sentence": "佛告諸苾芻：「猶此願力，佛與輪王，二寶同時出現於世。」』」",
        "translation": "The Buddha told the monks, Just like this vow power, the Buddha and the wheel-turning king appear in the world at the same time as the two treasures.",
        "source": "T24n1448_006:0026a27_7"
    },
    {
        "source_sentence": "爾時世尊告阿難陀曰：「汝可共我往俱胝聚落。」",
        "translation": "It was then that the Bhagavān addressed Ānanda, You may go with me to the village of Kauṇḍinya.",
        "source": "T24n1448_006:0026b01_0"
    },
    {
        "source_sentence": "時阿難陀遂與世尊遊行佛栗氏國，漸至俱胝聚落，次北不遠有勝攝林樹，",
        "translation": "Ānanda then traveled with the World-honored One to the country of Vṛji and gradually reached the village of Kauṇḍinya. Not far to the north, there was a tree called Vaiśeṣika’s Grove not far away.",
        "source": "T24n1448_006:0026b02_1"
    },
    {
        "source_sentence": "佛於中住。",
        "translation": "The Buddha abides there.",
        "source": "T24n1448_006:0026b03_2"
    },
    {
        "source_sentence": "爾時世尊告諸苾芻曰：「汝等當知！",
        "translation": "It was then that the Bhagavān addressed the monks, You should know!",
        "source": "T24n1448_006:0026b04_3"
    },
    {
        "source_sentence": "此之禁戒若破，於三摩地亦皆隨失。",
        "translation": "If these precepts are broken, they'll all be lost in samādhi.",
        "source": "T24n1448_006:0026b04_4"
    },
    {
        "source_sentence": "汝等若能修習持戒，此三摩地即能常住。",
        "translation": "If you can cultivate observance of the precepts, this samādhi will be able to abide permanently.",
        "source": "T24n1448_006:0026b05_5"
    },
    {
        "source_sentence": "以其智慧，修習身心，於三毒中得正解脫。",
        "translation": "Because of their wisdom, they cultivate body and mind to attain right liberation in the midst of the three poisons.",
        "source": "T24n1448_006:0026b06_6"
    },
    {
        "source_sentence": "如是修習，得解脫已，聖者善能了知：我生已盡，梵行成立，所作已辦，",
        "translation": "Having cultivated it in this way, they attain liberation. The noble ones are well able to know: “My births have ended, the holy life has been established, what should be done has been done.",
        "source": "T24n1448_006:0026b07_7"
    },
    {
        "source_sentence": "不受後有。」",
        "translation": "They won't be subject to later existence.",
        "source": "T24n1448_006:0026b09_8"
    },
    {
        "source_sentence": "爾時世尊告具壽阿難陀曰：「汝可共我往那地迦聚落。」",
        "translation": "It was then that the Bhagavān addressed Kauṣṭhila Ānanda, You may go with me to the village of Nādika.",
        "source": "T24n1448_006:0026b10_0"
    },
    {
        "source_sentence": "阿難陀唯然，遂與如來遊佛栗氏國，漸至那地迦聚落群氏迦堂中。",
        "translation": "Ānanda did so, and he traveled with the Tathāgata to the country of Vṛji and gradually reached the hall of the kṣatriyas in the village of Nādika.",
        "source": "T24n1448_006:0026b11_1"
    },
    {
        "source_sentence": "彼那地迦聚落，時有災疫，人眾多死。",
        "translation": "In that village of Nāgârjuna, there's a disaster and epidemic at the time, and many people die.",
        "source": "T24n1448_006:0026b12_2"
    },
    {
        "source_sentence": "于時有淥目親近、極精進、近勝端嚴、近端嚴、多眾最上，并賢善現名稱、施稱、上稱等眾多鄔波索迦，",
        "translation": "At that time there were numerous upāsaka, such as Mahāprajāpatīṇa and Upāsaka, the supremely zealous ones, those who approached superior forms of adornment, those who approached forms of adornment, the most distinguished among many beings in the assembly, virtuous and well-known names, charitable titles, and higher title",
        "source": "T24n1448_006:0026b13_3"
    },
    {
        "source_sentence": "皆已身死。",
        "translation": "They all died in their bodies.",
        "source": "T24n1448_006:0026b15_4"
    },
    {
        "source_sentence": "時諸苾芻於晨朝時執持衣鉢，入那地迦聚落巡門乞食。",
        "translation": "The monks then took their robes and bowls in the morning and went into the village of Nādika to solicit alms at the entrance.",
        "source": "T24n1448_006:0026b16_5"
    },
    {
        "source_sentence": "彼諸苾芻聞此聚落多有人死，然有淥目親近乃至上稱等諸鄔波索迦皆悉身死。",
        "translation": "Those monks heard that many people in this village had died, but those with coarse eyes who became intimate with them or even the above-mentioned Upāsaka and so forth all died.",
        "source": "T24n1448_006:0026b17_6"
    },
    {
        "source_sentence": "諸苾芻等既聞人死，巡乞食已，還至本處，安置衣鉢，詣世尊所，頂禮雙足，",
        "translation": "Having heard that the man had died, the monks and others, having gone on a hunting excursion to solicit almsfood, returned to their native place. Placed their robes and bowls [in the stupa], they approached the World-honored One and bowed at his feet.",
        "source": "T24n1448_006:0026b19_7"
    },
    {
        "source_sentence": "退坐一面，而白佛言：「我等諸苾芻，於晨朝時執持衣鉢，入那地迦聚落遊行乞食，",
        "translation": "They withdrew, sat to one side, and said to the Buddha: In the morning, we bhikṣus, holding our robes and bowls, entered the village of Nādika to solicit alms.",
        "source": "T24n1448_006:0026b21_8"
    },
    {
        "source_sentence": "乃聞人說此聚落中多有人死。",
        "translation": "He then heard people say that many people in this village had died.",
        "source": "T24n1448_006:0026b22_9"
    },
    {
        "source_sentence": "彼諸人等既並身死，各趣何道受生？」",
        "translation": "Since those people and so forth die together, what path will they each go to be born in?",
        "source": "T24n1448_006:0026b23_10"
    },
    {
        "source_sentence": "佛告諸苾芻：「彼淥目鄔波索迦，斷五下分結已即受化生，於此涅槃證不還果，",
        "translation": "The Buddha said to the bhikṣus: Having cut off the five lower bonds, Upāsaka Kauśika of Kātyāyana entered nirvana and realized the state of nonreturner.",
        "source": "T24n1448_006:0026b24_11"
    },
    {
        "source_sentence": "於此世中得不退轉法。",
        "translation": "In this world, they'll attain the Dharma of nonretrogression.",
        "source": "T24n1448_006:0026b26_12"
    },
    {
        "source_sentence": "餘鄔波索迦等，亦復如是。」",
        "translation": "The other upāsaka and so forth are likewise.",
        "source": "T24n1448_006:0026b26_13"
    },
    {
        "source_sentence": "佛告諸苾芻：「於彼那地迦聚落，更有二百五十一鄔波索迦並悉身死，",
        "translation": "The Buddha said to the monks: In that village of Nadīka there were two hundred and fifty-one other upāsaka, all dead.",
        "source": "T24n1448_006:0026b27_14"
    },
    {
        "source_sentence": "亦皆斷五下分結得受化生，於此涅槃證不還果，於此世中得不退轉，於彼聚落，",
        "translation": "They all cut off the five lower bonds and attain birth by undergoing transformation, realize the fruit of nonreturning in this nirvāṇa, and attain irreversibility in this world.",
        "source": "T24n1448_006:0026b29_0"
    },
    {
        "source_sentence": "復有三百鄔波索迦亦皆身死，斷三分結故，及貪、瞋、癡由有輕障，證一來果，",
        "translation": "Three hundred upāsaka also died in their bodies, because they had cut off the threefold fetter of craving, hatred, and delusion. They realized the fruit of the once-returner by reason of the slightest obstacle:",
        "source": "T24n1448_006:0026c01_1"
    },
    {
        "source_sentence": "更此受生，當斷一切諸煩惱惑。",
        "translation": "Furthermore, this sensation and birth will cut off all the afflictions and mental disturbances.",
        "source": "T24n1448_006:0026c03_2"
    },
    {
        "source_sentence": "於彼聚落，復有五百一鄔波索迦身死，斷三分結故，證預流果，不墮惡趣，",
        "translation": "In that village, there were another five hundred and one Upāsaka who died in their bodies. Because they had cut off the three-part fetters, they attained the state of stream-winner and did not fall into evil destinies.",
        "source": "T24n1448_006:0026c04_3"
    },
    {
        "source_sentence": "決定當證菩提之果，於人天中七返受生，輪轉息已，斷除煩惱。」",
        "translation": "They'll surely realize the fruit of enlightenment and be born seven times among humans and gods, and after their transmigration stops, they'll cut off their afflictions.",
        "source": "T24n1448_006:0026c06_4"
    },
    {
        "source_sentence": "佛告諸苾芻：「汝等當知！",
        "translation": "The Buddha told the monks, You should know!",
        "source": "T24n1448_006:0026c07_5"
    },
    {
        "source_sentence": "欲死者皆來問我，虛生擾亂，無有利樂。",
        "translation": "Those who want to die will all come and ask me questions, and there's no advantage or disadvantage in the confusion of space.",
        "source": "T24n1448_006:0026c08_0"
    },
    {
        "source_sentence": "然而生者，皆歸於死；",
        "translation": "Still, all those who are born return to death.",
        "source": "T24n1448_006:0026c08_1"
    },
    {
        "source_sentence": "若如來出現或不出現，生滅是常，有何奇異？",
        "translation": "If the Tathāgata appears or doesn't appear, and arising and ceasing are constant, what wonder is there?",
        "source": "T24n1448_006:0026c09_2"
    },
    {
        "source_sentence": "然其法者，即是法界，如來由自神通證現覺已，演說示現，分別安住，",
        "translation": "The Dharma is the realm of reality. Having realized enlightenment by means of his own supernormal powers, the Tathāgata expounds and demonstrates it, differentiating and establishing it.",
        "source": "T24n1448_006:0026c10_3"
    },
    {
        "source_sentence": "開示廣說種種妙法，所謂：有此故彼有，此生故彼生，所謂無明緣行、行緣識、識緣名色、名色緣六處、六處緣觸、觸緣受、受緣愛、愛緣取、取緣有、有緣生、生緣老死憂悲苦惱，",
        "translation": "It reveals and extensively explains various wondrous dharmas, namely, that which exists because it exists and that which arises because it arises because it arises: so-called nescience conditioned by volition, volition conditioned by consciousness, name and form conditioned by consciousness, name and form conditioned by name and form conditioned by name",
        "source": "T24n1448_006:0026c11_4"
    },
    {
        "source_sentence": "如是純極苦蘊生。",
        "translation": "Thus, this is the purely extremely painful aggregate of suffering that arises.",
        "source": "T24n1448_006:0026c15_5"
    },
    {
        "source_sentence": "所謂無此有故，彼即不生；",
        "translation": "Because this does not exist, they do not arise.",
        "source": "T24n1448_006:0026c16_6"
    },
    {
        "source_sentence": "彼若滅故，此即當滅，所謂無明滅故行滅、行滅故識滅、識滅故名色滅、名色滅故六處滅、六處滅故觸滅、觸滅故受滅、受滅故愛滅、愛滅故取滅、取滅故有滅、有滅故生滅、生滅故老死憂悲苦惱滅，",
        "translation": "Because of the cessation of nescience, formations cease; because of the cessation of formations, consciousness ceases; because of the cessation of consciousness, name-and-form ceases; because of the cessation of name-and-form ceases; because of the cessation of name-and-form ceases; because of the cessation of",
        "source": "T24n1448_006:0026c16_7"
    },
    {
        "source_sentence": "如是純極苦蘊滅。",
        "translation": "Thus, this is the cessation of the purely extremely painful aggregate of suffering.",
        "source": "T24n1448_006:0026c21_8"
    },
    {
        "source_sentence": "然與汝諸苾芻等，當說《法鏡經》。",
        "translation": "Still, you monks and others will explain the Dharma mirror sūtra.",
        "source": "T24n1448_006:0026c21_9"
    },
    {
        "source_sentence": "汝等諦聽，善思念之！",
        "translation": "Listen attentively and give close attention to it.",
        "source": "T24n1448_006:0026c22_10"
    },
    {
        "source_sentence": "云何名法鏡經？",
        "translation": "What's the name of the Dharma Mirror Sutra?",
        "source": "T24n1448_006:0026c22_11"
    },
    {
        "source_sentence": "汝等當於正覺極生信樂，此名『法鏡經』，及於法僧伽所有聖者戒光清淨，",
        "translation": "You should give rise to great faith in the true awakening, which is called the Dharma mirror sūtra and the purity of the noble precepts that belong to the Dharma assembly.",
        "source": "T24n1448_006:0026c23_12"
    },
    {
        "source_sentence": "皆生極信，此是『法鏡經』。",
        "translation": "They all gave rise to great faith, and this is the Dharma Mirror Sutra.",
        "source": "T24n1448_006:0026c24_13"
    },
    {
        "source_sentence": "苾芻當知！",
        "translation": "You should know, monks!",
        "source": "T24n1448_006:0026c25_14"
    },
    {
        "source_sentence": "我所云說法鏡經者，所說是也。」",
        "translation": "What I say is the Dharma mirror sūtra, which is what I teach.",
        "source": "T24n1448_006:0026c25_15"
    },
    {
        "source_sentence": "爾時世尊於佛栗氏國人間遊行，到那雉迦聚落。",
        "translation": "It was then that the Bhagavān traveled among the people of the country of Vṛji and reached the village of Nāgârjuna.",
        "source": "T24n1448_006:0026c27_0"
    },
    {
        "source_sentence": "時菴沒羅波利夫人，聞佛至那雉迦聚落。",
        "translation": "At the time, Lady Maudgalyāyana Upāli heard that the Buddha had arrived in the pheasant's village of Nāgârjuna.",
        "source": "T24n1448_006:0026c28_1"
    },
    {
        "source_sentence": "時彼夫人有一鸚鵡鳥名曰圓面，善解人語，便遣此鳥往那雉迦，頂禮世尊：「起居輕利，",
        "translation": "The queen then had a parrot named Yuanming, who was good at understanding people’s words. So she sent this bird to Cundaka and bowed her head in respect to the World-honored One, saying:",
        "source": "T24n1448_006:0026c29_2"
    },
    {
        "source_sentence": "少病少惱，安樂行不？",
        "translation": "Do you live in peace and comfort with few illnesses and few afflictions?",
        "source": "T24n1448_006:0027a02_3"
    },
    {
        "source_sentence": "世尊若欲遊廣嚴城者，願哀愍我，先至菴沒羅園。」",
        "translation": "Bhagavān, if you want to travel to the vast and beautiful city, please have pity on me and first go to the mango grove.",
        "source": "T24n1448_006:0027a02_4"
    },
    {
        "source_sentence": "是時鸚鵡既受命已，即往佛所，至廣嚴城，遇栗姑毘童子等出城遊戲。",
        "translation": "After receiving the instruction, the parrot went to the Buddha's place and arrived at the extensively adorned city, where he met young Licchavis and others who came out of the city to play.",
        "source": "T24n1448_006:0027a03_5"
    },
    {
        "source_sentence": "見鸚鵡飛過，同聲唱言：「菴沒羅婢鸚鵡，我等今當攢箭射殺。」",
        "translation": "Seeing a parrot flying past them, they all cried out in unison, saying, Uncle Maudgalyāyana, we'll now shoot and kill it with an arrow.",
        "source": "T24n1448_006:0027a05_6"
    },
    {
        "source_sentence": "言已挽弓，即射鸚鵡，其箭倒下，至童子頭上。",
        "translation": "After he said so, he drew his bow and shot a parrot, whose arrow fell down to the boy's head.",
        "source": "T24n1448_006:0027a06_7"
    },
    {
        "source_sentence": "「兩國交戰時，　　使者不應殺；",
        "translation": "“When the two countries are engaged in battle, Envoys should not kill.",
        "source": "T24n1448_006:0027a07_8"
    },
    {
        "source_sentence": "　況我是佛使，　　一切不能傷。」",
        "translation": "How much more so when I'm the Buddha's messenger, who can't hurt anyone.",
        "source": "T24n1448_006:0027a07_8"
    },
    {
        "source_sentence": "「我等箭無力，　　汝言見有驗；",
        "translation": "Because our arrows are powerless, You may say that we have seen it.",
        "source": "T24n1448_006:0027a07_8"
    },
    {
        "source_sentence": "　此是佛威德，　　汝當無畏去。」",
        "translation": "This is the Buddha's authoritative virtue, so you must go without fear.",
        "source": "T24n1448_006:0027a07_8"
    },
    {
        "source_sentence": "時彼鸚鵡即說頌曰：時諸童子亦說頌曰：時鸚鵡鳥即至佛所，頭面敬禮世尊足已，",
        "translation": "The parrot then composed the following verse:",
        "source": "T24n1448_006:0027a07_8"
    },
    {
        "source_sentence": "具陳夫人所有誠信，佛言：「善哉！",
        "translation": "Guo Chen's wife had faith in what she had, and the Buddha said, Good!",
        "source": "T24n1448_006:0027a14_9"
    },
    {
        "source_sentence": "當善安穩。」",
        "translation": "You'll be well-maintained.",
        "source": "T24n1448_006:0027a15_10"
    },
    {
        "source_sentence": "默然受請。",
        "translation": "He accepted the invitation in silence.",
        "source": "T24n1448_006:0027a15_11"
    },
    {
        "source_sentence": "於是鸚鵡知佛受請，致敬而去，未至菴園，便被惡鵄空中搦殺。",
        "translation": "Knowing that the Buddha had accepted his invitation, the parrot departed in respect and didn't go to the pond, so he was killed by a wicked bird in the air.",
        "source": "T24n1448_006:0027a16_12"
    },
    {
        "source_sentence": "既捨命已即生四天王天。",
        "translation": "After abandoning his life, he'll be born in the heaven of the four heavenly kings.",
        "source": "T24n1448_006:0027a17_13"
    },
    {
        "source_sentence": "生彼天已，即自念言：「我因何事？",
        "translation": "After he was born in that heaven, he thought to himself, What's the reason for me?",
        "source": "T24n1448_006:0027a18_14"
    },
    {
        "source_sentence": "種何福業？",
        "translation": "What meritorious actions are planted?",
        "source": "T24n1448_006:0027a18_15"
    },
    {
        "source_sentence": "而來生此。」",
        "translation": "They came to be born here.",
        "source": "T24n1448_006:0027a19_16"
    },
    {
        "source_sentence": "便自觀見，由作佛使，捨傍生身，得斯善報。",
        "translation": "He then observed for himself that because he had become a messenger of the Buddha, he abandoned the body of an unenlightened person and attained this good reward.",
        "source": "T24n1448_006:0027a19_17"
    },
    {
        "source_sentence": "復作是念：「我今不應隔宿報世尊恩。」",
        "translation": "Again, he thought, Now, I shouldn't separately repay the Bhagavān's kindness in the past.",
        "source": "T24n1448_006:0027a20_18"
    },
    {
        "source_sentence": "即以嚴身之具及青蓮華、俱物頭花、芬陀利花、曼陀羅花、摩訶曼陀羅花，",
        "translation": "He adorned his body with ornaments, such as blue lotus blossoms, red lotus blossoms, white lotus blossoms, pink lotus blossoms, red lotus blossoms, and mahāmandārava flowers.",
        "source": "T24n1448_006:0027a21_19"
    },
    {
        "source_sentence": "於中夜分，至世尊所，頂禮佛足，而以供養，退坐一面。",
        "translation": "At midnight he came to the place where the World-honored One was. Having saluted the Buddha by bowing his forehead at his feet, he withdrew and sat to one side in homage.",
        "source": "T24n1448_006:0027a22_20"
    },
    {
        "source_sentence": "由彼天身光明力故，時那雉迦聚落非常光耀。",
        "translation": "Because of the power of that celestial body's radiance, the pheasant village in Cunda is extremely shining.",
        "source": "T24n1448_006:0027a24_21"
    },
    {
        "source_sentence": "爾時世尊即知根性，為天說法，所謂四聖諦理。",
        "translation": "It was then that the Bhagavān knew the nature of faculties and taught the Dharma to gods, which are called the principle of the four noble truths.",
        "source": "T24n1448_006:0027a26_0"
    },
    {
        "source_sentence": "聞此法已，便以智金剛杵摧破二十高峯煩惱薩迦耶見山，證預流果。",
        "translation": "After hearing this teaching, he then destroyed the mountain of the afflictive sarvajñas on twenty high peaks with a vajra of wisdom and attained the fruit of stream-winner.",
        "source": "T24n1448_006:0027a27_1"
    },
    {
        "source_sentence": "時天子證諦理已，三歎善哉：「今佛世尊，大利益我，非諸父母及諸眷屬、天主、沙門、婆羅門等能作斯事。",
        "translation": "After realizing the truth, the celestial sons praised him three times, saying, Now, Bhagavān, it's not possible for parents, their followers, gods, ascetics, ascetics, priests, and brāhmaṇas to do such things.",
        "source": "T24n1448_006:0027a28_2"
    },
    {
        "source_sentence": "唯佛世尊，能拔地獄、傍生、餓鬼之苦，建立天人，超度生死，枯血淚海、離骨肉山，",
        "translation": "Only the Buddha, the World-Honored One, can remove the suffering of hells, animals, and hungry ghosts. He establishes heavenly beings to transcend birth and death, leaving behind the sea of withered blood and tears as well as the mountain of bones and flesh.",
        "source": "T24n1448_006:0027b02_0"
    },
    {
        "source_sentence": "關閉一切諸惡趣門，開示涅槃淨天之路。",
        "translation": "He closes the door to all bad destinies and reveals the pure heavenly path of nirvāṇa.",
        "source": "T24n1448_006:0027b03_1"
    },
    {
        "source_sentence": "從無始已來，習耶見山，以金剛智慧能悉摧壞，令我得證預流果。",
        "translation": "Ever since beginningless time I have been cultivating the mountain of Vaiśravaṇa. By means of my adamantine wisdom I have been able to completely destroy it, enabling me to attain the state of stream-enterer.",
        "source": "T24n1448_006:0027b04_2"
    },
    {
        "source_sentence": "我從今日乃至命存，歸佛法僧，作鄔波索迦，永不殺生等，願佛攝受。」",
        "translation": "From today until my life exists, I'll return to the Buddha, Dharma and Saṃgha, become Upāsaka, never kill sentient beings, and so forth, and may the Buddha take them in.",
        "source": "T24n1448_006:0027b06_3"
    },
    {
        "source_sentence": "歡喜踊躍，猶如商人獲大財利，亦如農夫苗稼滋茂，亦如勇士摧伏強敵，",
        "translation": "They're like a merchant who obtains great wealth and profit, like a farmer whose crops grow and prosper, or like a warrior defeating a strong enemy.",
        "source": "T24n1448_006:0027b07_4"
    },
    {
        "source_sentence": "亦如病人離諸疾患，得神通已禮佛而去，以其神力還至天宮。",
        "translation": "It's also like when a sick person is free of illness and attains supernormal abilities, venerates the Buddha and leaves him, and returns to the palace of heaven with his supernormal powers.",
        "source": "T24n1448_006:0027b09_5"
    },
    {
        "source_sentence": "爾時世尊告阿難陀曰：「我今與汝，往詣廣嚴城中。」",
        "translation": "It was then that the Bhagavān addressed Ānanda, Now, I'll go with you to the city of Vaiśālī.",
        "source": "T24n1448_006:0027b11_0"
    },
    {
        "source_sentence": "阿難陀答言：「奉命唯然。」",
        "translation": "Ānanda replied, Yes, it's the only thing that follows orders.",
        "source": "T24n1448_006:0027b12_1"
    },
    {
        "source_sentence": "爾時世尊與阿難陀，至廣嚴城菴羅林住，告阿難陀曰：「汝可往薜舍離城，",
        "translation": "It was then that the World-honored One and Ānanda went to the great city of Vaiśālī, where they lived in a mango grove. They said to Ānanda:",
        "source": "T24n1448_006:0027b12_2"
    },
    {
        "source_sentence": "脚踏門閫，說於此呪，并說此頌。",
        "translation": "He steps on the door with his feet and says this dhāraṇī, and he also recites this verse.",
        "source": "T24n1448_006:0027b14_3"
    },
    {
        "source_sentence": "呪曰：「『毘娑囉他毘娑囉他毘娑囉他毘娑囉他復圖復圖路哥阿努甘笈辜阿若波夜底薩縛復陀阿奴末底提娜薩縛復陀波囉復陀阿奴末底娜薩縛阿囉漢阿奴末底娜薩縛式叉阿奴末底薩縛尸囉縛迦阿奴末底薩縛薩底縛溺(上)奴末底波囉底迦波囉摩奴末底娜迦始縛囉奴末底娜因陀囉奴末底娜提婆多奴末底娜阿素囉陀囉奴末底娜阿蘇囉畢理灑奴末底娜薩縛復陀奴末底娜毘娑囉毘娑囉毘娑囉毘娑囉復圖嚧迦奴甘[竺-二+扱]俱藐般也邸聞遮陀聞遮陀息災難、驅災難、驅出耶鬼。",
        "translation": "The mantra said, 'visārata, visarata, visarata, visarata, visarata, Visarata, and so forth are further fettered by the binding of the arhat anut-maṇḍinīna, the binding of the arhat anut-maṇḍinīna, the binding of the arhat anut-maṇḍ",
        "source": "T24n1448_006:0027b15_0"
    },
    {
        "source_sentence": "「『世尊欲入，大自在最勝尊與帝釋及梵天欲入，世界主護世四天王與無量諸天眷屬欲入，",
        "translation": "Ānanda, the World-honored One wished to enter. The great sovereign and supremely venerable one wished to enter together with Indra and the god Brahmā.",
        "source": "T24n1448_006:0027b27_0"
    },
    {
        "source_sentence": "阿蘇羅王與其眷屬、諸鬼神等無量百千，於佛世尊生大信心，亦欲來入，",
        "translation": "The king of the asuras, together with his retinues and countless hundreds of thousands of other spirits, also had great faith in the World-honored Buddha and wished to enter.",
        "source": "T24n1448_006:0027b29_1"
    },
    {
        "source_sentence": "為利益一切眾生故。",
        "translation": "It's for the benefit of all sentient beings.",
        "source": "T24n1448_006:0027c01_2"
    },
    {
        "source_sentence": "汝等鬼神莫生損害，速出速出、速出速出、速去速去。",
        "translation": "All of you ghosts and spirits, don't harm me. Come out quickly! Come out quickly! Come out quickly!",
        "source": "T24n1448_006:0027c02_3"
    },
    {
        "source_sentence": "汝等若欲發惡心者，今當速去；",
        "translation": "Those of you who want to give rise to bad thoughts should now quickly leave.",
        "source": "T24n1448_006:0027c03_4"
    },
    {
        "source_sentence": "若有慈悲心者便可聽住，無有過失。",
        "translation": "If there's a compassionate mind, then they can listen and abide, with no faults.",
        "source": "T24n1448_006:0027c04_5"
    },
    {
        "source_sentence": "樂為擁護者亦可聽住。",
        "translation": "Those who are happy to embrace it can also listen and abide.",
        "source": "T24n1448_006:0027c05_0"
    },
    {
        "source_sentence": "大悲世尊為憐愍一切有情故，作如此說：「蘇畝蘇畝蘇畝蘇嚧　嚧畝嚧畝　畝畝嚧蘇摸嚧摸蘇摸嚧　摸嚧摸嚧摸嚧摸嚧摸嚧摸嚧摸嚧　彌理彌理　蘇嚧彌理　蘇嚧彌理　蘇呂彌理　蘇呂彌理　蘇呂彌理　蘇呂彌理　蘇呂彌理　蘇呂彌理　蘇呂彌理　蘇呂彌理　蘇呂彌理　蘇呂彌理　理理理理理理　利利利利利利　彌理彌理彌理彌理　彌利彌利　賀私彌彌理彌理私私弭　殑伽囉伽囉迦吒　殑迦囉迦囉迦遮　殑迦囉殑迦囉　殑迦囉殑迦囉　殑迦囉殑迦囉　殑迦囉殑迦囉　俱利賒殑迦囉殑迦離迦利賒理理理理理阿理破娑理　逋理逋理逋理逋理逋理逋理逋理　逋奈他奈他託離布離布那他託涅理迦車託離布離逋理涅理　車託波囉夜他　離逋離布波囉夜他。」",
        "translation": "Because of pity for all sentient beings, the great compassionate Bhagavān said, So many so many so many so many so many so many so many so many so many so many so many so many so many so many so many so many so many so many so many",
        "source": "T24n1448_006:0027c05_1"
    },
    {
        "source_sentence": "世尊憐愍世間，欲入此城，利益一切眾生故、慈悲喜捨故。",
        "translation": "The Bhagavān has pity for the world and wants to enter this city because it benefits all sentient beings and is compassionate, compassionate, joyful, and equanimous.",
        "source": "T24n1448_006:0027c19_2"
    },
    {
        "source_sentence": "此呪成就伽他，一切諸天及一切眾生以最勝智慧法性。",
        "translation": "This spell accomplishes the dharma-nature of all gods and all sentient beings with the most excellent wisdom.",
        "source": "T24n1448_006:0027c20_3"
    },
    {
        "source_sentence": "「『斷除諸結習，　　遠離諸貪愛；",
        "translation": "Ending all bonds and habits, They become free of craving.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　其心常寂靜，　　彼能安樂汝。",
        "translation": "Their minds are always quiescent, And they can give you peace and comfort.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　世間若有人，　　善住涅槃道；",
        "translation": "If there are people in the world, They will skillfully abide in the path of nirvana.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　能說一切法，　　彼能安樂汝。",
        "translation": "He can teach all the teachings, and he'll be able to comfort you.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　生死流轉中，　　作諸歸依者；",
        "translation": "In the transmigration of birth and death, they make various refuges.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　利益有情類，　　彼能安樂汝。",
        "translation": "Benefiting sentient beings, they can bring you peace and comfort.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　普以大悲心，　　養育諸有情；",
        "translation": "With great compassion they provide for all sentient beings.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　慈念如赤子，　　彼能安樂汝。",
        "translation": "Being compassionate like a tiny child, he's able to bring you peace and comfort.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　一切歸依者，　　在於生死中；",
        "translation": "All those who take refuge Are in birth and death.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　依之獲善利，　　彼能安樂汝。",
        "translation": "Relying on them to obtain good benefits, they'll be able to bring you peace and comfort.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　證諸一切法，　　清淨無染穢；",
        "translation": "He realizes that all things Are pure and undefiled.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　身口意寂然，　　彼能安樂汝。",
        "translation": "Their body, speech, and mind are tranquil, And they can give you peace and comfort.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　勇猛出見時，　　增長諸財物；",
        "translation": "When he emerges with courageous vision, He increases his wealth and possessions.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　成就諸義量，　　彼能安樂汝。",
        "translation": "Accomplishing measures of meaning, they'll be able to comfort you.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　在昔降誕時，　　大地皆震動；",
        "translation": "When he was born in the past, The earth shook and all trembled.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　眾生悉歡喜，　　彼能安樂汝。",
        "translation": "The sentient beings will all rejoice, and they'll be able to comfort you.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　大地六變動，　　證得菩提道；",
        "translation": "The great earth moves in six ways, Realizing the path of enlightenment.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　魔王生惱心，　　彼能安樂汝。",
        "translation": "The king of Māra gives rise to a mind of anguish, and he's able to make you comfortable.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　善轉正法輪，　　名稱滿十方；",
        "translation": "Skillfully turning the wheel of the true teaching, Renown fills the ten directions.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　說諸聖諦理，　　彼能安樂汝。",
        "translation": "He teaches the truth of the noble truths, which will bring you peace and comfort.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　演諸微妙法，　　摧伏諸外道；",
        "translation": "He expounds the subtle teachings, Destroying heretics.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　攝受於眾生，　　彼能安樂汝。",
        "translation": "Taking in sentient beings, they can bring you peace and comfort.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　願佛以安樂，　　及於帝釋天；",
        "translation": "I pray that the Buddha will bring peace and happiness To those in Indra’s heaven.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　一切諸鬼神，　　常為擁護者。",
        "translation": "All the ghosts and spirits always protect them.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　以佛功德力，　　諸天皆歡喜，",
        "translation": "By the power of the Buddha’s virtue All the gods are joyful.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　所求事願者，　　無有不成就。",
        "translation": "There's no one who doesn't fulfill the task or vow that they seek.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　常護諸二足，　　及諸四足等；",
        "translation": "He always guards the two legs, The four legs, etc.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　去者獲安穩，　　來者亦安樂。",
        "translation": "Those who go will attain stability, and those who come will also be comfortable.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　夜中獲安樂，　　晝時亦安樂；",
        "translation": "In the middle of the night they attain peace, And in the daytime they are also peaceful.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　不逢諸惡事，　　一切皆安樂。",
        "translation": "Not encountering bad things, they're all comfortable.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　一切世間人，　　及諸一切天；",
        "translation": "All the people of all worlds And all the gods.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　異道鬼傍生，　　悉皆無惱患。",
        "translation": "Non-Buddhist spirits, ghosts, and animals Have no afflictions at all.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　鬼神來此者，　　地行及空中；",
        "translation": "ghosts and spirits come here, traveling on the earth and in the sky.",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "　　常以慈悲心，　　晝夜為善事。』」",
        "translation": "Always compassionate, Day and night is a good thing.'",
        "source": "T24n1448_006:0027c22_4"
    },
    {
        "source_sentence": "說伽他曰：根本說一切有部毘奈耶藥事卷第六",
        "translation": "Śāriputra: Mūlasarvâstivāda-sūtra, the Vinaya of the Sarvāstivāda school, vol. 6",
        "source": "T24n1448_006:0027c22_4"
    }
]