[
    {
        "source_sentence": "根本說一切有部毘奈耶破僧事",
        "translation": "Mūlasarvâstivāda's Vinaya that breaks the saṃgha",
        "source": "T24n1450_015:0175a02_0"
    },
    {
        "source_sentence": "卷第十五",
        "translation": "(Skt. 15.",
        "source": "T24n1450_015:0175a03_0"
    },
    {
        "source_sentence": "大唐三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yijingfeng of the Great Tang",
        "source": "T24n1450_015:0175a05_0"
    },
    {
        "source_sentence": "佛告諸苾芻：「提婆達多非為今時無恩無報，從昔已來亦無恩無報。",
        "translation": "The Buddha told the monks, It's not that Devadatta has no kindness and no reward at the present time, and since the distant past, he has had no kindness and no reward.",
        "source": "T24n1450_015:0175a06_0"
    },
    {
        "source_sentence": "汝等善聽，我當為說。」",
        "translation": "Listen well, and I will explain it for you.",
        "source": "T24n1450_015:0175a07_1"
    },
    {
        "source_sentence": "攝頌曰。",
        "translation": "The gathering verse says.",
        "source": "T24n1450_015:0175a08_0"
    },
    {
        "source_sentence": "佛告諸苾芻：「乃往古昔此婆羅痆斯城有一大村，去村不遠有一大林，花菓茂盛流泉浴池。",
        "translation": "The Buddha told the monks, Once upon a time, there was a large village in this city of Vārāṇasī, and not far from it was a large forest with plenty of flowers and fruit, flowing into a spring and bathing pond.",
        "source": "T24n1450_015:0175a09_0"
    },
    {
        "source_sentence": "有一仙人名憍尸迦，在彼林中，每食墮落之菓，衣服樹皮；",
        "translation": "There was a holy man named Kauśika who lived in the forest. Every time he ate fruit that fell into the air, his clothes were made of tree bark.",
        "source": "T24n1450_015:0175a11_1"
    },
    {
        "source_sentence": "心大慈悲，種種禽獸皆咸依附。",
        "translation": "Their minds are greatly compassionate, and all kinds of animals rely on them.",
        "source": "T24n1450_015:0175a12_2"
    },
    {
        "source_sentence": "有一母象在彼林中，當產之時聞師子吼，心大驚怖失大小便，棄子而走，出於林中。",
        "translation": "A mother elephant was in the forest, and when she gave birth to a lion she heard the lion's roar. She was greatly frightened and lost her excreted and defecated, abandoned her child, and ran out of the forest.",
        "source": "T24n1450_015:0175a13_3"
    },
    {
        "source_sentence": "時仙採菓，見小象子知其失母，仙起慈心慜彼象子，尋覓其母，求不能得，遂收象子至自住處，而鞠養之如子無異。",
        "translation": "When the ṛṣi was collecting fruit, he saw that the small elephant knew it had lost its mother. The ṛṣi became compassionate to the young elephant and looked for his mother but couldn't find her; so he gathered the elephant into his own dwelling place and nursed it like a child without any difference.",
        "source": "T24n1450_015:0175a14_4"
    },
    {
        "source_sentence": "既漸長大，便壞仙處花菓樹木。",
        "translation": "As he grew up, the flowers, fruits, and trees in the sage's place were destroyed.",
        "source": "T24n1450_015:0175a17_5"
    },
    {
        "source_sentence": "仙既見已遂即嗔責，象知仙瞋更不損林。",
        "translation": "When the holy man saw this, he became angry and rebuked him. Knowing that the holy man was angry, the elephant didn't harm the forest.",
        "source": "T24n1450_015:0175a18_6"
    },
    {
        "source_sentence": "象又漸大心極猛盛，後復損林，仙又訶責，象無怖懼。",
        "translation": "Again, the elephant gradually grew in size and became so strong that it later damaged the forest. The holy man reprimanded him again but the elephant was not frightened.",
        "source": "T24n1450_015:0175a19_7"
    },
    {
        "source_sentence": "仙加苦嗔，象起害心欲踐仙人。",
        "translation": "The ṛṣi became angry and pained, and the elephant became harmful and wanted to trample on the ṛṣi.",
        "source": "T24n1450_015:0175a20_8"
    },
    {
        "source_sentence": "仙走入室，象以鼻牙損仙半屋，便即自走。",
        "translation": "When the holy man ran into his room, the elephant damaged half of the holy man's room with its nose and teeth, so he ran away on his own.",
        "source": "T24n1450_015:0175a21_9"
    },
    {
        "source_sentence": "時樹林神即說頌曰。」",
        "translation": "The tree-forest deity then spoke a verse, saying.",
        "source": "T24n1450_015:0175a22_10"
    },
    {
        "source_sentence": "佛告諸苾芻：「往昔仙人者，今我身是。",
        "translation": "The Buddha told the monks, In the past, I was the sage, but now I am myself.",
        "source": "T24n1450_015:0175a23_0"
    },
    {
        "source_sentence": "往昔象者，今提婆達多是。",
        "translation": "Formerly the elephant was Devadatta, who is now Devadatta.",
        "source": "T24n1450_015:0175a23_1"
    },
    {
        "source_sentence": "往昔無恩，今亦如是，無有善報，汝等當知！」",
        "translation": "You should know that there was no kindness in the past, and so is it now; there's no good reward, you should know!",
        "source": "T24n1450_015:0175a24_2"
    },
    {
        "source_sentence": "佛告諸苾芻：「提婆達多復有無恩無報之行。",
        "translation": "The Buddha told the monks, Devadatta has another practice that's without kindness and without retribution.",
        "source": "T24n1450_015:0175a26_0"
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "Listen attentively!",
        "source": "T24n1450_015:0175a27_0"
    },
    {
        "source_sentence": "往昔此波羅痆斯時有國王名大帝釋軍，國土豐饒人皆快樂。",
        "translation": "Formerly in this country of Vārāṇasī there was a king named Mahāprajāpatīṃdhara, who ruled the army of the Śākyas. His land was prosperous and his people were all happy.",
        "source": "T24n1450_015:0175a27_1"
    },
    {
        "source_sentence": "王有夫人號為月光，但所作夢皆有真實。",
        "translation": "The king had a queen named Candraprabha, but all the dreams he created were real.",
        "source": "T24n1450_015:0175a28_2"
    },
    {
        "source_sentence": "於彼國內有一菩薩而作鹿王，其形金色殊勝端正，人所見者無有厭足。",
        "translation": "In that country there was a bodhisattva named Deer King, golden-colored in shape and extremely handsome; everyone who saw him did not tire of it.",
        "source": "T24n1450_015:0175a29_3"
    },
    {
        "source_sentence": "自知端正心常怖畏，恒怕獵師常藏其身。",
        "translation": "Knowing himself to be handsome, he always feared the hunter and always hid his body.",
        "source": "T24n1450_015:0175b02_4"
    },
    {
        "source_sentence": "時諸禽獸互相解語，時有一烏詣鹿王所心生愛念，作如是語：『阿舅！",
        "translation": "The animals then explained to each other, and then a crow went to the deer king's place with love and thought, saying, 'Auntie!",
        "source": "T24n1450_015:0175b03_5"
    },
    {
        "source_sentence": "云何驚怖食草？』",
        "translation": "What's the fear of being frightened and eating grass?'",
        "source": "T24n1450_015:0175b04_6"
    },
    {
        "source_sentence": "金色鹿王便即報曰：『我為端正，一切獵師若見我者，恐相殺害，為此食草心常驚怖。』",
        "translation": "The golden-colored deer king then reported, 'I'm so handsome; if any hunters see me, they're afraid to kill each other, and their minds are always frightened by this food of grass.'",
        "source": "T24n1450_015:0175b05_7"
    },
    {
        "source_sentence": "烏尋報曰：『我於夜中亦怕鵂鶹，我等與舅，從今已去更相守護。",
        "translation": "The crow replied, 'In the middle of the night, I'm also afraid of sexual misconduct; we and my uncle will guard each other from now on.",
        "source": "T24n1450_015:0175b07_0"
    },
    {
        "source_sentence": "若於白日，我處高樹監察好惡，有事報王。",
        "translation": "If on the white day, I'll stay at a high tree to supervise good and evil, and there's something to report to the king.",
        "source": "T24n1450_015:0175b08_1"
    },
    {
        "source_sentence": "若至夜中，王當觀視有事報我。』",
        "translation": "If he arrives in the middle of the night, the king will observe and reward me with something.'",
        "source": "T24n1450_015:0175b09_2"
    },
    {
        "source_sentence": "於彼國中有一大河在於林側，時有二人先有怨讎，忽然相逢。",
        "translation": "In that country, there was a large river at the side of a forest, and two people who were once enemies suddenly met each other.",
        "source": "T24n1450_015:0175b10_3"
    },
    {
        "source_sentence": "一人力勝，遂縛怨人擲於河中，其水流急彼人漂溺，便作是言：『誰能救得我者，我與作奴？』",
        "translation": "One man was victorious, so he bound the enemy and tossed him into the river, and the water flowed quickly. That person drowned and said, 'Who can save me, or let me be your slave?'",
        "source": "T24n1450_015:0175b11_4"
    },
    {
        "source_sentence": "時彼鹿王與五百眷屬至河飲水，聞此聲已起慈悲心，便入水中欲救溺人。",
        "translation": "That deer king and his five hundred members of his retinue then went to the river to drink water, and when they heard this sound, they became compassionate and entered the water in order to rescue the drowning man.",
        "source": "T24n1450_015:0175b13_5"
    },
    {
        "source_sentence": "是時老烏來詣王所，便即告言：『此黑頭蟲，都無恩義，勿須救拔，若得離難必害鹿王。』",
        "translation": "The old crow then came to the king and told him, 'This black-headed bug has no kindness; don't rescue it; if you get rid of it, you'll surely harm the deer king.'",
        "source": "T24n1450_015:0175b15_6"
    },
    {
        "source_sentence": "時彼鹿王為慈悲故，不取烏言，往溺人所背負而出。",
        "translation": "Because of his compassion, that deer king didn't take the crow's words, went to the drowning man's back and carried it out.",
        "source": "T24n1450_015:0175b17_7"
    },
    {
        "source_sentence": "既到岸上，以口解繩待蘇息已，便即報言：『子須當知，此是歸路，汝當好去。』",
        "translation": "When he arrived on the shore, he untied his rope with his mouth and waited for him to rest, and then reported, 'Should you know, son? This is the return path; you must depart well.'",
        "source": "T24n1450_015:0175b18_8"
    },
    {
        "source_sentence": "時彼溺人胡跪合掌報鹿王言：『我於王邊更得此命，願常供侍為奴，以報王恩。』",
        "translation": "The drowning man then knelt down with his palms joined and reported to the deer king, saying, 'I've regained this life at the king's side, wishing to always serve as a slave to repay the king's kindness.'",
        "source": "T24n1450_015:0175b19_9"
    },
    {
        "source_sentence": "「『不用汝為奴，　　亦不須承事；",
        "translation": "'There's no need for you to be a slave, and there's no need to serve.",
        "source": "T24n1450_015:0175b21_10"
    },
    {
        "source_sentence": "　　但莫說見我，　　恐彼取我皮。",
        "translation": "Don't say that they see me, lest they take my skin.",
        "source": "T24n1450_015:0175b21_10"
    },
    {
        "source_sentence": "時彼鹿王即說頌曰：「『我今於汝更求一事，汝隨我願勿言見我，即是報恩。",
        "translation": "The deer king then spoke a verse, saying, 'Now, I'll ask you for another thing, so please follow my wishes and don't say that you see me, which is to repay kindness.",
        "source": "T24n1450_015:0175b21_10"
    },
    {
        "source_sentence": "何以故？",
        "translation": "Why is it so?",
        "source": "T24n1450_015:0175b26_11"
    },
    {
        "source_sentence": "我身端嚴色相具足，恐彼人知殺我取皮，是故莫說見我在此。』",
        "translation": "My body is adorned with form and characteristics, and I'm afraid that person will know to kill me and take my skin; therefore, don't say they see me here.'",
        "source": "T24n1450_015:0175b26_12"
    },
    {
        "source_sentence": "彼人答言：『敬從王願，我定不說。』",
        "translation": "They replied,'Venerate the king's vow, and I won't explain it.'",
        "source": "T24n1450_015:0175b27_13"
    },
    {
        "source_sentence": "即起合掌右繞三匝作禮而去。",
        "translation": "He rose, joined his palms three times to the right, paid homage, and departed.",
        "source": "T24n1450_015:0175b28_14"
    },
    {
        "source_sentence": "「爾時月光夫人，受五欲樂疲極而睡，於後夜中夢見鹿王，身皮金色微妙端嚴，坐師子座，為諸國王及諸人眾說甚深法。",
        "translation": "At the time, Lady Candraprabha was overcome with five desires and exhausted from sleep, and in the latter part of the night she dreamt that she saw a deer king with golden-colored skin and finely adorned features, seated on a lion's seat, explaining the profound Dharma to the kings and the people.",
        "source": "T24n1450_015:0175c01_0"
    },
    {
        "source_sentence": "夢中思惟：『我作此夢定是真實。』",
        "translation": "In a dream, he thought, 'This dream I made must be true.'",
        "source": "T24n1450_015:0175c03_1"
    },
    {
        "source_sentence": "歡喜而寤，即向於王說夢所見。",
        "translation": "Delighted and overjoyed, he told the king what he had seen in his dream.",
        "source": "T24n1450_015:0175c04_2"
    },
    {
        "source_sentence": "王既聞已信其所夢，心生驚怪：『何得有鹿處師子座為眾說法？』",
        "translation": "After hearing this, the king believed what he dreamed and became frightened in his heart, saying, 'How could there be a deer sitting on a lion's seat to teach the Dharma for the crowd?'",
        "source": "T24n1450_015:0175c05_3"
    },
    {
        "source_sentence": "時月光夫人為王陳說悅意之語，王大歡喜，即便慇懃請王，為覓金色之鹿。",
        "translation": "The king was greatly delighted, and he invited the king to search for a golden-colored deer.",
        "source": "T24n1450_015:0175c06_4"
    },
    {
        "source_sentence": "王勅群臣，國內獵師總召令集。",
        "translation": "The king ordered his ministers to assemble the hunters of the country and summoned them together.",
        "source": "T24n1450_015:0175c08_5"
    },
    {
        "source_sentence": "諸臣奉命，召諸獵師將詣王所。",
        "translation": "The ministers obeyed the king's order and summoned the hunters to go to the king's place.",
        "source": "T24n1450_015:0175c09_0"
    },
    {
        "source_sentence": "王問獵師：『我聞國內有金色鹿，汝等見不？",
        "translation": "The king asked the hunter, 'I've heard that there are golden deer in my country. Do you see them?'",
        "source": "T24n1450_015:0175c09_1"
    },
    {
        "source_sentence": "若有見者，以軟繩繫勿令傷損，將來見我。』",
        "translation": "If there's anyone who sees it, don't let them be tied with a soft rope and harmed; they'll come to see me in the future.'",
        "source": "T24n1450_015:0175c10_2"
    },
    {
        "source_sentence": "時諸獵師白大王言：『我獵多年，不見此鹿亦不曾聞。",
        "translation": "The hunters then said to the king, 'I've been hunting for years and haven't seen this deer or heard of it.",
        "source": "T24n1450_015:0175c11_3"
    },
    {
        "source_sentence": "大王既聞，鹿在何處？",
        "translation": "When the great king heard this, where was the deer?",
        "source": "T24n1450_015:0175c12_4"
    },
    {
        "source_sentence": "請為王捉。』",
        "translation": "Please take it for the king's sake.'",
        "source": "T24n1450_015:0175c13_5"
    },
    {
        "source_sentence": "王勅諸臣，擊鼓宣令：『訪有見者來報我知，我即當賞五百聚落。』",
        "translation": "The king ordered his ministers to strike the drum and declare, 'If someone who saw me comes to report to me with knowledge, I'll reward five hundred villages.'",
        "source": "T24n1450_015:0175c13_6"
    },
    {
        "source_sentence": "諸臣受教，擊鼓集眾宣王賞募。",
        "translation": "The ministers were instructed, beat the drum and gathered the crowd to proclaim the king's prize.",
        "source": "T24n1450_015:0175c14_7"
    },
    {
        "source_sentence": "時彼溺人聞王重募，即便作念：『我今貧困，為欲貪求王之重賞？",
        "translation": "The drowning man then heard the king's request and even thought, 'Now that I'm poor, why would I want to covet the king's heavy reward?'",
        "source": "T24n1450_015:0175c15_8"
    },
    {
        "source_sentence": "為當報恩不說其鹿？』」",
        "translation": "Why should we repay kindness and not tell the deer?'",
        "source": "T24n1450_015:0175c17_9"
    },
    {
        "source_sentence": "佛告諸苾芻：「世間常法，一切有情五欲所繫，無惡不作。",
        "translation": "The Buddha told the monks, It's always true in the world that all sentient beings are bound by the five desires and there's nothing bad that they don't do.",
        "source": "T24n1450_015:0175c17_10"
    },
    {
        "source_sentence": "時彼溺人心貪五欲，即思往時被怨執縛。",
        "translation": "At the time, that person's mind is addicted to the five desires, and when they think about it, they're bound by enemies and attachments.",
        "source": "T24n1450_015:0175c18_11"
    },
    {
        "source_sentence": "復作是念：『我今背恩欲報彼怨，不懼未來如前苦事，應報其怨。』",
        "translation": "Again, he thinks, 'Now that I've turned my back on kindness and want to repay their grudge, I won't be afraid of suffering in the future as before; I should repay their grudge.'",
        "source": "T24n1450_015:0175c19_12"
    },
    {
        "source_sentence": "作是念已詣王宮門，見種種莊嚴依王正法，使守門者白大王知。",
        "translation": "After he had this thought, he went to the entrance of the king's palace and saw various adornments that relied on the king's right teaching, causing the gatekeeper to tell the great king.",
        "source": "T24n1450_015:0175c21_13"
    },
    {
        "source_sentence": "王既聞已即喚令入，其人報王：『於山林中具諸花菓。",
        "translation": "After hearing this, the king summoned him to enter. The man reported to the king, 'There are flowers and fruit in the mountain forest.",
        "source": "T24n1450_015:0175c22_14"
    },
    {
        "source_sentence": "有一鹿王，身皮金色千鹿圍遶，至極端正。",
        "translation": "There was a deer king whose skin was golden-colored and surrounded by a thousand deer.",
        "source": "T24n1450_015:0175c23_15"
    },
    {
        "source_sentence": "我知其處令王得見。』",
        "translation": "I know where it is so that the king can see it.'",
        "source": "T24n1450_015:0175c24_16"
    },
    {
        "source_sentence": "王聞語已心大歡喜，召諸群臣將其兵眾，外國朝者見王嚴駕，亦皆隨從。",
        "translation": "Having heard these words, the king was greatly delighted and summoned his ministers and troops. All the foreign courtiers who saw the royal chariot were also following it.",
        "source": "T24n1450_015:0175c25_17"
    },
    {
        "source_sentence": "其人引前往鹿王所，布兵圍繞。",
        "translation": "The man was led to the place where the deer king lived, surrounded by soldiers.",
        "source": "T24n1450_015:0175c26_18"
    },
    {
        "source_sentence": "時彼鹿王親友之烏，恒在高樹，遙見兵眾來漸近林中。",
        "translation": "At the time, that deer king's close friend and crow was always in a high tree, and he saw his troops coming from a distance and gradually approaching him in the forest.",
        "source": "T24n1450_015:0175c27_19"
    },
    {
        "source_sentence": "烏即下樹報鹿王言：『前被溺人是背恩者，王不須救，不用我言。』",
        "translation": "The crow then went down to the tree and reported to the deer king, saying, 'That person who was previously drowned is someone who turned away from kindness, so the king doesn't need to save them; he doesn't use my words.'",
        "source": "T24n1450_015:0175c28_20"
    },
    {
        "source_sentence": "鹿王問言：『有何所以？』",
        "translation": "The deer king asked, 'What's the reason for this?'",
        "source": "T24n1450_015:0176a01_21"
    },
    {
        "source_sentence": "烏答鹿王：『前者溺人將諸兵眾，來獵鹿王。』",
        "translation": "The crow answered the deer king, 'The former drowned man and his troops came to hunt the deer king.'",
        "source": "T24n1450_015:0176a01_22"
    },
    {
        "source_sentence": "時彼千鹿聞兵眾聲，驚怖走散。",
        "translation": "The thousand deer then heard the sounds of the troops and fled in fear.",
        "source": "T24n1450_015:0176a02_23"
    },
    {
        "source_sentence": "是時鹿王即作是念：『我今若走，彼諸兵眾尋覓於我，亦殺千鹿；",
        "translation": "The deer king thought, “If I go now, those soldiers will search for me and also kill a thousand deer.",
        "source": "T24n1450_015:0176a03_24"
    },
    {
        "source_sentence": "我寧守死，活彼千鹿。』",
        "translation": "I'd rather guard death than live a thousand deer.'",
        "source": "T24n1450_015:0176a04_25"
    },
    {
        "source_sentence": "作是念已，爾時鹿王詣國王所，往時溺人遙見鹿王，即舉兩手指示王言：『金色鹿王彼來者是。』」",
        "translation": "After he had this thought, the deer king then went to the king's place, and when the drowning man saw the deer king from a distance, he raised his two hands and instructed the king, saying, 'That's the golden-colored deer king who came here.'",
        "source": "T24n1450_015:0176a05_26"
    },
    {
        "source_sentence": "佛告諸苾芻：「眾生若造極惡業者，不待來生今即見受。",
        "translation": "The Buddha told the monks, If sentient beings create extremely bad actions, they won't wait until they're born in the future to see and receive them now.",
        "source": "T24n1450_015:0176a08_0"
    },
    {
        "source_sentence": "被溺之人，由不知恩造惡業故，手指鹿訖手即墮地。",
        "translation": "Because the person who was drowned didn't know that kindness created bad karma, his fingers and deer ended up on the ground with their hands.",
        "source": "T24n1450_015:0176a09_1"
    },
    {
        "source_sentence": "王見是事怪而問言：『何忽如是兩手墮落？』",
        "translation": "Seeing this, the king wondered and asked, 'Why did you suddenly fall down with both hands like this?'",
        "source": "T24n1450_015:0176a10_2"
    },
    {
        "source_sentence": "「『穿牆盜物者，　　此不名為賊；",
        "translation": "'Those who steal things through walls aren't called thieves here.",
        "source": "T24n1450_015:0176a11_3"
    },
    {
        "source_sentence": "　　有恩而不報，　　是名為大賊。』",
        "translation": "If someone has kindness but doesn't repay it, this is called a great thief.'",
        "source": "T24n1450_015:0176a11_3"
    },
    {
        "source_sentence": "時彼溺人苦痛悲泣，即便向王以頌答曰：「王聞此語即問彼人：『此頌何義？",
        "translation": "The drowning man then cried in pain and sorrow, and he answered the king with a verse, When the king heard these words, he asked that person, 'What's the meaning of this verse?'",
        "source": "T24n1450_015:0176a11_3"
    },
    {
        "source_sentence": "我今不解。』",
        "translation": "Now, I don't understand.'",
        "source": "T24n1450_015:0176a15_4"
    },
    {
        "source_sentence": "時彼溺人即便為王具說前事。",
        "translation": "The drowning man then explained the previous events to the king.",
        "source": "T24n1450_015:0176a15_5"
    },
    {
        "source_sentence": "「『無恩溺人，　　何故汝身，　　不陷入地？",
        "translation": "'There's no kindness to the drowning person, so why isn't your body plunged into the ground?",
        "source": "T24n1450_015:0176a16_6"
    },
    {
        "source_sentence": "　　何故汝舌，　　不破百分？　　何故金剛，",
        "translation": "Why don't your tongue break a hundred parts?",
        "source": "T24n1450_015:0176a16_6"
    },
    {
        "source_sentence": "　　執持刀杖，　　不殺害汝？　　一切鬼神，",
        "translation": "All the demons and goddesses, holding swords and sticks, Will not kill you.",
        "source": "T24n1450_015:0176a16_6"
    },
    {
        "source_sentence": "　　何不打汝？　　汝極背恩，　　何故少報？』",
        "translation": "Why won't I strike you? Because you're extremely ungrateful, why will you have little reward?'",
        "source": "T24n1450_015:0176a16_6"
    },
    {
        "source_sentence": "王聞是已，為不知恩溺人說頌報曰：「王知彼鹿是大菩薩有大威德，告諸臣言：『應與鹿王設大供養，卿等速迴掃灑道路，懸繒幡蓋燒眾名香，我與鹿王俱來入城。』",
        "translation": "When the king heard this, he spoke a verse to the person who didn't know kindness and drowning, saying, Knowing that the deer was a great bodhisattva with great authority, the king told his ministers, 'Should you make a great offering to the deer king?",
        "source": "T24n1450_015:0176a16_6"
    },
    {
        "source_sentence": "諸臣聞勅具依王教。",
        "translation": "The ministers heard the command and relied on the king's teaching.",
        "source": "T24n1450_015:0176a24_7"
    },
    {
        "source_sentence": "是時國王令金色鹿在前而行，國王大臣隨鹿王後，入婆羅痆斯城，於宮門前置師子座，種種莊嚴請鹿王坐。",
        "translation": "The king then ordered the golden deer to walk in front of him, and the king's ministers followed the deer king into the city of Vārāṇasī, placed a lion seat in front of the palace gate, and invited the deer king to sit on it with various adornments.",
        "source": "T24n1450_015:0176a25_8"
    },
    {
        "source_sentence": "王及月光夫人，後宮婇女王子人民，圍遶而坐。",
        "translation": "The king and Lady Candraprabha were surrounded by the queens, princes, and people in the rear palace.",
        "source": "T24n1450_015:0176a27_9"
    },
    {
        "source_sentence": "是時鹿王方說妙法，王及夫人一切大眾，既聞法已，即請鹿王為受五戒，一切有情願歸菩提。",
        "translation": "The deer king then explained the wonderful teaching, and the king and his wife and all the other people heard the teaching, so they invited the deer king to receive the five precepts for them, and all sentient beings wished to return to enlightenment.",
        "source": "T24n1450_015:0176a28_10"
    },
    {
        "source_sentence": "王見是已心大歡喜，向鹿王言：『王所遊處山林曠野，悉施鹿王。",
        "translation": "Seeing this, the king rejoiced greatly and said to the deer king, 'All the places where the king travels in the mountains, forests, and wilderness are given to the deer king.",
        "source": "T24n1450_015:0176b01_11"
    },
    {
        "source_sentence": "我從今後永斷殺生，亦令國人不得遊獵，願諸有情，於諸住處心無怖畏。』」",
        "translation": "From now on, I'll permanently stop killing sentient beings and cause the people of my country not to go hunting, wishing that all sentient beings have no fear in their minds where they live.'",
        "source": "T24n1450_015:0176b03_12"
    },
    {
        "source_sentence": "佛告諸苾芻：「爾時鹿王者，今我身是。",
        "translation": "The Buddha told the monks, At the time, that was the deer king, and now I am him.",
        "source": "T24n1450_015:0176b05_0"
    },
    {
        "source_sentence": "時無恩溺人，今提婆達多是。",
        "translation": "At the time, there was no kindness to the person who drowned him, but Devadatta is now.",
        "source": "T24n1450_015:0176b05_1"
    },
    {
        "source_sentence": "過去無恩，今亦如是。」",
        "translation": "In the past, there was no kindness, and so is it now.",
        "source": "T24n1450_015:0176b06_2"
    },
    {
        "source_sentence": "佛告諸苾芻：「提婆達多復有無恩無報之行。",
        "translation": "The Buddha told the monks, Devadatta has another practice that's without kindness and without retribution.",
        "source": "T24n1450_015:0176b06_3"
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "Listen attentively!",
        "source": "T24n1450_015:0176b07_4"
    },
    {
        "source_sentence": "往昔婆羅痆斯邊界聚落，於中有一作花鬘人，其聚落傍有一河水，作花鬘人每常渡水取花來去。",
        "translation": "Formerly in a village at the frontier of Vārāṇasī there was a flower garland maker, and beside that village was a river with water. A flower garland maker often crossed the river to fetch flowers from the river and bring them back and forth.",
        "source": "T24n1450_015:0176b08_5"
    },
    {
        "source_sentence": "後於一時欲渡河水，於此河中非時得一菴沒羅果，持詣王城與守門者，守門者得轉餉通事。",
        "translation": "One time, he wanted to cross the river and at an ungodly hour obtained a fruit of ambrosia in that river, took it to the king's city and gave it to the gatekeeper, who would be given general service.",
        "source": "T24n1450_015:0176b10_6"
    },
    {
        "source_sentence": "通事人得便奉進王，王得其菓復與王妃，妃得其菓即便食之。",
        "translation": "When the officials obtained it, they presented it to the king, and when the king got the fruit, he gave it back to the king's queen, who received the fruit and ate it.",
        "source": "T24n1450_015:0176b12_7"
    },
    {
        "source_sentence": "以菓香美復從王索，王復問彼通事之人：『何處得菓？』",
        "translation": "With the fragrance of the fruit, he again asked the king to ask for it, and the king asked the person in charge, 'Where did you get the fruit?'",
        "source": "T24n1450_015:0176b13_8"
    },
    {
        "source_sentence": "通事人答：『我於守門人邊得之。』",
        "translation": "The superintendent replied, 'I got it at the side of the gatekeeper.'",
        "source": "T24n1450_015:0176b15_9"
    },
    {
        "source_sentence": "王即遣喚守門人問：『菓汝從何得？』",
        "translation": "The king then sent someone to summon the guards and asked, 'How did you get the fruit?'",
        "source": "T24n1450_015:0176b15_10"
    },
    {
        "source_sentence": "守門人云：『我於花鬘人邊而得此菓。』",
        "translation": "The guards at the gate said, 'I got this fruit by the side of a flower garland.'",
        "source": "T24n1450_015:0176b16_11"
    },
    {
        "source_sentence": "王復遣喚作花鬘人問言：『何處得菓？』",
        "translation": "The king then sent another caller to the flower garland and asked, 'Where did you get the fruit?'",
        "source": "T24n1450_015:0176b17_12"
    },
    {
        "source_sentence": "花鬘人答：『於河中得。』",
        "translation": "The flower garland man answered, 'I got it in the river.'",
        "source": "T24n1450_015:0176b18_13"
    },
    {
        "source_sentence": "王語作花鬘人：『汝往河所更覓此菓。』",
        "translation": "The king said to the flower garland owner, 'Go to the river and look for this fruit again.'",
        "source": "T24n1450_015:0176b18_14"
    },
    {
        "source_sentence": "其花鬘人既得勅已，自齎糧食復往河所，尋水而覓行至一山，於高崖上遙見菓樹。",
        "translation": "Having received the command, the flower garland bearer returned to the river with provisions and food. Looking for water he reached a mountain where he saw a fruit-bearing tree on a high cliff from a distance.",
        "source": "T24n1450_015:0176b19_15"
    },
    {
        "source_sentence": "其巖嶮絕，一切獼猴皆不能上，何況於人？",
        "translation": "The cliffs are so steep that none of the monkeys can climb them, much less humans.",
        "source": "T24n1450_015:0176b21_16"
    },
    {
        "source_sentence": "其作鬘人多日尋覓，無有上處，糧食復盡，其人心念：『我得王教令覓其菓，今既不獲如何得歸？』",
        "translation": "The monk spent many days searching for a place to eat, and when his food ran out, he thought, 'I've been instructed by the king to search for some fruit, but now that I haven't found it, how can I return?'",
        "source": "T24n1450_015:0176b22_17"
    },
    {
        "source_sentence": "作是念已不顧身命，手攀嶮崖漸漸而上，未到果所遂便墜落，下有深澗墮在其中。",
        "translation": "Having thought thus, without concern for his body or life, he climbed up the steep cliff with his hand and gradually ascended it; but before reaching the fruit, he fell down into a deep valley below.",
        "source": "T24n1450_015:0176b24_18"
    },
    {
        "source_sentence": "「時有菩薩作獼猴王遊行山谷，見花鬘人墮在深坑受諸飢苦。",
        "translation": "A bodhisattva then became a rhesus monkey king traveling through a valley and saw a flower garland man fall into a deep pit and suffer hunger and suffering.",
        "source": "T24n1450_015:0176b26_19"
    },
    {
        "source_sentence": "菩薩發心救諸含識，善巧方便，時獼猴王遂設其計，取一大石輕重如人，即便背負調習運轉，知得出坑，遂負鬘人漸漸而出。",
        "translation": "When the bodhisattva arouses the intention to save the conscious beings and skillfully uses skillful means, the rhesus monkey king then sets up his plan, takes a large rock as light and heavy as a man's weight, carries it along with its back and forth in an uncontrolled motion, knows how to get out of the pit, and gradually carries the torpor-stricken person out.",
        "source": "T24n1450_015:0176b27_20"
    },
    {
        "source_sentence": "由此疲極身體乏困。",
        "translation": "As a result, they're extremely exhausted and their bodies are hungry.",
        "source": "T24n1450_015:0176c01_21"
    },
    {
        "source_sentence": "當於彼時，一切禽獸悉解人語。",
        "translation": "At the time, all the animals understood human speech.",
        "source": "T24n1450_015:0176c02_22"
    },
    {
        "source_sentence": "時獼猴王問花鬘人：『汝因何事落在深坑？』",
        "translation": "The monkey king then asked the flower garland man, 'What did you cause you to fall into a deep pit?'",
        "source": "T24n1450_015:0176c02_23"
    },
    {
        "source_sentence": "時花鬘人廣如上說。",
        "translation": "The flower garland people then explained it in detail as above.",
        "source": "T24n1450_015:0176c03_24"
    },
    {
        "source_sentence": "是時菩薩便作是念：『此採菓人不得其菓，必當受罪。",
        "translation": "The bodhisattva then had this thought, 'This fruit picker won't get the fruit, and he'll surely be guilty.",
        "source": "T24n1450_015:0176c04_25"
    },
    {
        "source_sentence": "我今應可與取菴沒羅菓。』",
        "translation": "Now, I should give you the fruit of ambrosia.'",
        "source": "T24n1450_015:0176c05_26"
    },
    {
        "source_sentence": "菩薩雖困，遂昇高巖摘取其菓，擲與鬘人。",
        "translation": "Even though the Bodhisattva was in distress, he climbed up a high cliff to pick the fruit and tossed it to the miller.",
        "source": "T24n1450_015:0176c06_0"
    },
    {
        "source_sentence": "彼人得已便自食足，餘殘菓子衣裓盛之。",
        "translation": "When he had obtained it, that man then ate his own food and filled it with the remaining leftover fruit and garments.",
        "source": "T24n1450_015:0176c06_1"
    },
    {
        "source_sentence": "獼猴下樹報花鬘人言：『我今疲乏欲少時睡，汝可警覺守護於我。』",
        "translation": "The monkey went down to the tree and reported to the flower garuḍa, saying, 'Now that I'm exhausted and want to sleep for a little while, you should alertly guard me.'",
        "source": "T24n1450_015:0176c07_2"
    },
    {
        "source_sentence": "花鬘答言：『好！",
        "translation": "The flower garland replied, 'Good!",
        "source": "T24n1450_015:0176c09_3"
    },
    {
        "source_sentence": "我警覺。』",
        "translation": "I'll alert you.'",
        "source": "T24n1450_015:0176c09_4"
    },
    {
        "source_sentence": "獼猴便睡。",
        "translation": "The monkey then fell asleep.",
        "source": "T24n1450_015:0176c09_5"
    },
    {
        "source_sentence": "時花鬘人而作是念：『我路糧盡，若食菓子以何奉王？",
        "translation": "The flower garland bearer then thought, 'I've run out of food for the road, so if I eat fruit, why would I offer it to the king?'",
        "source": "T24n1450_015:0176c10_6"
    },
    {
        "source_sentence": "應殺獼猴曝作乾脯將充路糧，方可得達。』",
        "translation": "You should kill the rhesus monkey and expose it to dry dried food that's about to fill up the provisions for the road before you can reach it.'",
        "source": "T24n1450_015:0176c11_7"
    },
    {
        "source_sentence": "時彼惡人不知恩故，遂起惡念，擎取大石打獼猴頭，骨髓俱破遂致命終。",
        "translation": "The evil man, not knowing the reason for his kindness, then had a bad thought and raised a large rock to beat the monkey's head, which broke apart like bone and marrow and died.",
        "source": "T24n1450_015:0176c12_8"
    },
    {
        "source_sentence": "「『承事恭敬，　　猶如善友；　　有如是人，",
        "translation": "'Relying on service and respect is like being a good friend; there are people like this,",
        "source": "T24n1450_015:0176c14_0"
    },
    {
        "source_sentence": "　　不知恩報。』」",
        "translation": "I don't know the reward for kindness.'",
        "source": "T24n1450_015:0176c14_0"
    },
    {
        "source_sentence": "「爾時空中有一天神，見此事已，即說頌曰：佛告諸苾芻：「汝等當知：往昔獼猴王者，即我身是。",
        "translation": "Seeing this, the celestial gods in the sky spoke these verses: The Buddha said to the bhikṣus: You should know that I am the old monkey king of the past.",
        "source": "T24n1450_015:0176c14_0"
    },
    {
        "source_sentence": "其花鬘惡人者，今提婆達多是。",
        "translation": "That flower garland is now Devadatta, a bad person.",
        "source": "T24n1450_015:0176c18_1"
    },
    {
        "source_sentence": "非但過去不知報恩，今亦如是。",
        "translation": "Not only did they not know the repayment of their kindness in the past, but so it is now.",
        "source": "T24n1450_015:0176c18_2"
    },
    {
        "source_sentence": "苾芻當知。」",
        "translation": "You should know this, monks.",
        "source": "T24n1450_015:0176c19_3"
    },
    {
        "source_sentence": "佛告諸苾芻：「提婆達多復有無恩無報之行。",
        "translation": "The Buddha told the monks, Devadatta has another practice that's without kindness and without retribution.",
        "source": "T24n1450_015:0176c20_0"
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "Listen attentively!",
        "source": "T24n1450_015:0176c21_0"
    },
    {
        "source_sentence": "往昔之時有一山林，種種花菓。",
        "translation": "In the distant past there was a mountain forest with various kinds of flowers and fruit.",
        "source": "T24n1450_015:0176c21_1"
    },
    {
        "source_sentence": "時有一鳥名曰啄木，其林一邊有師子王，尋常殺鹿而食。",
        "translation": "At the time, there was a bird named woodpecking, and on one side of that forest was a lion king who often killed deer and ate.",
        "source": "T24n1450_015:0176c21_2"
    },
    {
        "source_sentence": "後殺一鹿遂便食噉，骨橫咽中不能得出，痛苦多時不能得食，羸劣飢瘦。",
        "translation": "Later, he killed a deer and then ate it. The animal was so weak and hungry that they could not get out of their mouths to swallow the flesh. They often suffered extreme pain and were unable to eat.",
        "source": "T24n1450_015:0176c23_3"
    },
    {
        "source_sentence": "彼鳥遊戲見師子王，即便問曰：『阿舅！",
        "translation": "When the bird was playing and saw the lion king, it asked, 'Auntie!",
        "source": "T24n1450_015:0176c24_4"
    },
    {
        "source_sentence": "何故羸瘦如此？』",
        "translation": "Why is it so weak and thin?'",
        "source": "T24n1450_015:0176c25_5"
    },
    {
        "source_sentence": "師子答曰：『我有痛苦。』",
        "translation": "The lion answered, 'I'm in pain.'",
        "source": "T24n1450_015:0176c26_6"
    },
    {
        "source_sentence": "時鳥問言：『何故痛苦？』",
        "translation": "The bird then asked, 'Why is it painful?'",
        "source": "T24n1450_015:0176c26_7"
    },
    {
        "source_sentence": "其師子王廣如上說。",
        "translation": "The king of lions is as explained above.",
        "source": "T24n1450_015:0176c27_0"
    },
    {
        "source_sentence": "鳥復報曰：『我為治苦，汝是諸獸中王，能報恩不？",
        "translation": "Again, the bird replied, 'I'm curing suffering. Are you the king among animals, or can you repay kindness?'",
        "source": "T24n1450_015:0176c27_1"
    },
    {
        "source_sentence": "每日之中常與我食。』",
        "translation": "Every day, you'll always give me food.'",
        "source": "T24n1450_015:0176c28_2"
    },
    {
        "source_sentence": "師子王報曰：『依汝所須常能供給。』",
        "translation": "The lion king replied, 'Depending on what you need, you can always make offerings.'",
        "source": "T24n1450_015:0176c29_0"
    },
    {
        "source_sentence": "鳥便思念：『我作方計除却其骨，待去却後然始令知。",
        "translation": "The bird then thought, 'I'll make a plan to remove the bones, but I'll let you know after I remove them.",
        "source": "T24n1450_015:0176c29_1"
    },
    {
        "source_sentence": "待師子睡方可除骨。』",
        "translation": "It's only when the lion sleeps that he can remove his bones.'",
        "source": "T24n1450_015:0177a01_2"
    },
    {
        "source_sentence": "既作念已，暫遊於樹求覓其食。",
        "translation": "After he had this thought, he temporarily traveled to a tree to search for food.",
        "source": "T24n1450_015:0177a02_3"
    },
    {
        "source_sentence": "時師子王，遇涼風吹，遂便美睡。",
        "translation": "The lion king then encountered a cool breeze and fell asleep.",
        "source": "T24n1450_015:0177a03_4"
    },
    {
        "source_sentence": "鳥見睡已，以木著口審細更看，遂入口中銜骨而出。",
        "translation": "Seeing that he had fallen asleep, the bird put wood in his mouth and examined it closely.",
        "source": "T24n1450_015:0177a03_5"
    },
    {
        "source_sentence": "在於樹上待師子王睡眠覺後，將骨示之。",
        "translation": "On the tree, he waited for the lion king to sleep and after awakening, showed him his bones.",
        "source": "T24n1450_015:0177a05_6"
    },
    {
        "source_sentence": "時師子王須臾睡寤，遂覺喉中骨去無痛，蹲踞嚬呻。",
        "translation": "The king of lions then fell asleep for a moment, and then felt the bones in his throat go away without pain, crouching and screaming.",
        "source": "T24n1450_015:0177a06_0"
    },
    {
        "source_sentence": "鳥見歡喜，從樹飛下以骨示之，報師子云：『阿舅！",
        "translation": "The bird was delighted to see him, flew down from the tree and showed him his bones, and reported to the lion, 'Uncle!",
        "source": "T24n1450_015:0177a07_1"
    },
    {
        "source_sentence": "苦痛皆由此骨。』",
        "translation": "It's all painful and painful because of this bone.'",
        "source": "T24n1450_015:0177a08_2"
    },
    {
        "source_sentence": "師子歡慶報彼鳥云：『外甥！",
        "translation": "The lion rejoiced and reported to the bird, saying, 'Neither of you!",
        "source": "T24n1450_015:0177a08_3"
    },
    {
        "source_sentence": "我久苦痛今得除差，我欲一生供養承事。",
        "translation": "I've been suffering and pained for a long time, but now I've been healed, and I want to make offerings and serve them for one lifetime.",
        "source": "T24n1450_015:0177a09_4"
    },
    {
        "source_sentence": "唯願外甥！",
        "translation": "May it please you, my nephews!",
        "source": "T24n1450_015:0177a10_5"
    },
    {
        "source_sentence": "日日來此。』",
        "translation": "Day after day, they come here.'",
        "source": "T24n1450_015:0177a10_6"
    },
    {
        "source_sentence": "鳥聞此語歡喜而去。",
        "translation": "When the bird heard these words, it rejoiced and departed.",
        "source": "T24n1450_015:0177a10_7"
    },
    {
        "source_sentence": "後師子王正食鹿時，其啄木鳥被鷹所逐，驚怖飢急飛投師子，說被鷹逐飢急怖事，『願舅賜我一餐之食。』",
        "translation": "Later, when the king of the lion was about to feed a deer, that woodpecking bird was driven by an eagle and flew into the lion in fear and said, 'I'm driven by an eagle and hungry and afraid, so please give me a meal of food.'",
        "source": "T24n1450_015:0177a11_8"
    },
    {
        "source_sentence": "「『我當行殺害，　　惡性亦惡行；",
        "translation": "'I will commit killing, and evil by nature I will also commit evil.",
        "source": "T24n1450_015:0177a13_9"
    },
    {
        "source_sentence": "　　我牙齒鋒利，　　入我口得出；",
        "translation": "My teeth are sharp and sharp, Entering through my mouth and coming out.",
        "source": "T24n1450_015:0177a13_9"
    },
    {
        "source_sentence": "　　應當自忻慶，　　今復更何索？』",
        "translation": "You should congratulate yourself, so why would you ask for it now?'",
        "source": "T24n1450_015:0177a13_9"
    },
    {
        "source_sentence": "「『物墮海中失，　　夢得寤時失，",
        "translation": "'Things that fall into the ocean are lost, while dreams are lost when they're awakened.",
        "source": "T24n1450_015:0177a13_9"
    },
    {
        "source_sentence": "　　承事惡人失；　　救濟無恩人，",
        "translation": "Those who serve evil people will lose, and those who rescue those without benevolence will be saved.",
        "source": "T24n1450_015:0177a13_9"
    },
    {
        "source_sentence": "　　此更為大失，　　我從汝何索？』",
        "translation": "This is another great mistake, so why would I ask for it from you?'",
        "source": "T24n1450_015:0177a13_9"
    },
    {
        "source_sentence": "時師子王以頌答曰：「鳥聞此說亦以頌答：「鳥說頌已即便飛去。」",
        "translation": "The king of lions then answered with a verse, When the bird heard this teaching, it also answered with a verse, After the bird spoke the verse, it flew away.",
        "source": "T24n1450_015:0177a13_9"
    },
    {
        "source_sentence": "佛告諸苾芻：「往時啄木鳥王者，即我身是。",
        "translation": "The Buddha told the monks, In the past, I was the king who pecked wooden bird kings.",
        "source": "T24n1450_015:0177a21_10"
    },
    {
        "source_sentence": "彼無恩師子王者，今提婆達多是。",
        "translation": "That kindless lion king is now Devadatta.",
        "source": "T24n1450_015:0177a22_11"
    },
    {
        "source_sentence": "先不知恩亦不知報，今亦如是。",
        "translation": "Formerly they did not know the kindness and also did not know the retribution. The same applies to the present.",
        "source": "T24n1450_015:0177a23_12"
    },
    {
        "source_sentence": "汝等當知！」",
        "translation": "You should know!",
        "source": "T24n1450_015:0177a23_13"
    },
    {
        "source_sentence": "世尊復告諸苾芻曰：「提婆達多復有無恩無報之行。",
        "translation": "Again, the Bhagavān addressed the monks, Devadatta has another practice that's without kindness or retribution.",
        "source": "T24n1450_015:0177a25_0"
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "Listen attentively!",
        "source": "T24n1450_015:0177a26_1"
    },
    {
        "source_sentence": "往昔婆羅痆斯城有一貧人，常取柴樵賣以活命。",
        "translation": "Formerly in the city of Vārāṇasī there was a poor man who always took firewood and sold it for his livelihood.",
        "source": "T24n1450_015:0177a26_2"
    },
    {
        "source_sentence": "其人復於一時，執持繩斧往趣林邊，將欲伐柴。",
        "translation": "Again, at one time the man took his rope axe and went to the edge of the forest, intending to cut down firewood.",
        "source": "T24n1450_015:0177a27_3"
    },
    {
        "source_sentence": "即逢非時大暴風雨，七日不息，為避風雨漸次經歷，遂至山邊見一石窟，即欲入中。",
        "translation": "He then encountered a great storm of wind and rain at an ungodly hour that didn't stop for seven days, so he gradually passed away in order to avoid the wind and rain. So he went to the side of the mountain and saw a stone cave, and he wanted to enter it.",
        "source": "T24n1450_015:0177a28_4"
    },
    {
        "source_sentence": "將至窟門，見熊在內驚怖却走。",
        "translation": "When he arrived at the cave gate, he saw that the bear was inside and fled in fear.",
        "source": "T24n1450_015:0177b01_5"
    },
    {
        "source_sentence": "熊見驚走便呼彼云：『善男子來！",
        "translation": "Seeing him, the bear ran in fear and called out to him, saying, 'Come, good man!",
        "source": "T24n1450_015:0177b02_6"
    },
    {
        "source_sentence": "汝勿怖我。』",
        "translation": "Don't be afraid of me.'",
        "source": "T24n1450_015:0177b02_7"
    },
    {
        "source_sentence": "其人雖復聞彼熊呼，猶懷恐怖，躊躇而立不前不却。",
        "translation": "Even though the man heard the bear calling, he was still frightened and stood in fear, neither going nor retreating.",
        "source": "T24n1450_015:0177b03_8"
    },
    {
        "source_sentence": "熊見彼住即抱入窟，不令驚懼，與諸美菓堪食樹根，養經七日至第八日。",
        "translation": "Seeing that they were staying there, the bears embraced them and entered the cave. They were not frightened but gave them delicious fruit to feed on the roots of the tree for seven days until the eighth day.",
        "source": "T24n1450_015:0177b04_9"
    },
    {
        "source_sentence": "熊自出外看其風雨，見風雨歇，即與美菓發遣令去。",
        "translation": "The bear came out to look for the wind and rain but when he saw that the wind and rain stopped, he gave him some sweet fruit and sent it away.",
        "source": "T24n1450_015:0177b05_10"
    },
    {
        "source_sentence": "其人長跪合掌白言：『我蒙供養身命得活，我從今後何以報恩？』",
        "translation": "That person knelt down with joined palms and said, 'I've been offered support for my body and life to live, so how can I repay that kindness from now on?'",
        "source": "T24n1450_015:0177b07_11"
    },
    {
        "source_sentence": "熊即報曰：『汝但勿向外人噵說我在此住者，即為報恩。』",
        "translation": "The bear then replied, 'Don't tell the outsiders that I'm staying here, which is to repay kindness.'",
        "source": "T24n1450_015:0177b08_12"
    },
    {
        "source_sentence": "其人即便遶熊行道經一匝已，報其熊曰：『我終不敢報餘人知。』",
        "translation": "After he had circled the bear one time on the path, that man reported to the bear, 'I would never dare to report it to anyone else.'",
        "source": "T24n1450_015:0177b09_13"
    },
    {
        "source_sentence": "說此語已便即而去。",
        "translation": "After he said these words, he departed.",
        "source": "T24n1450_015:0177b11_14"
    },
    {
        "source_sentence": "其人行至婆羅痆斯城門，見一獵師欲行遊獵，先共相識。",
        "translation": "The man went to the city gate of Vārāṇasī and saw a hunter who wanted to go hunting, but they had previously known each other.",
        "source": "T24n1450_015:0177b11_15"
    },
    {
        "source_sentence": "獵師問曰：『汝多日不還家中，婦兒眷屬悉皆憂惱言：「為被風雨漂，及虎狼食？」",
        "translation": "The hunter asked, 'For a long time, you won't return home, and your wives, children, and their retinues all become sad and say, Is it because you're floating in the wind and rain and eating by tigers and wolves?'",
        "source": "T24n1450_015:0177b13_0"
    },
    {
        "source_sentence": "將作汝死。",
        "translation": "I'll make you die.",
        "source": "T24n1450_015:0177b14_1"
    },
    {
        "source_sentence": "已度大雨禽獸多死，汝今云何得活？』",
        "translation": "Now that you've crossed the great rain, many animals and birds have died, how will you be able to live?'",
        "source": "T24n1450_015:0177b15_0"
    },
    {
        "source_sentence": "時採薪人說熊收養，廣如上說。",
        "translation": "The firewood collector then told the bear to harvest and raise it, as explained above.",
        "source": "T24n1450_015:0177b15_1"
    },
    {
        "source_sentence": "獵師問曰：『彼熊今在何山何窟？",
        "translation": "The hunter asked, 'Where's that bear now at the mountain or cave?'",
        "source": "T24n1450_015:0177b16_2"
    },
    {
        "source_sentence": "願汝視我。』",
        "translation": "May you look at me.'",
        "source": "T24n1450_015:0177b17_3"
    },
    {
        "source_sentence": "時採柴人報獵師曰：『我今縱死亦不能却入山林。』",
        "translation": "The woodcutter then reported to the hunter, 'Now that I'm dead, I can't go into the mountain forest.'",
        "source": "T24n1450_015:0177b17_4"
    },
    {
        "source_sentence": "獵師報曰多以巧言種種勸化：『我若殺得，與汝多分，我取一分。』",
        "translation": "The hunter replied, Many of them are skillfully exhorted in various ways, saying, 'If I kill you, I'll give you a large portion; I'll take one part.'",
        "source": "T24n1450_015:0177b18_5"
    },
    {
        "source_sentence": "其人即起貪心，遂便却迴，視彼熊處行至窟邊，遙指熊視。",
        "translation": "The man then became greedy and withdrew. He looked around the place where the bear was hiding and went to the edge of the cave, pointing at the bear from a distance to see him.",
        "source": "T24n1450_015:0177b20_6"
    },
    {
        "source_sentence": "是時獵師於其窟門，多積柴薪以火熏之。",
        "translation": "At the entrance to the cave, the hunter stored a large amount of firewood and smoked it with fire.",
        "source": "T24n1450_015:0177b21_7"
    },
    {
        "source_sentence": "「『我此山中住，　　不害於一人；",
        "translation": "'I live on this mountain, and I won't harm anyone.",
        "source": "T24n1450_015:0177b22_8"
    },
    {
        "source_sentence": "　　食菓及樹根，　　常起慈悲念。",
        "translation": "Eating fruit and the roots of trees, he always arouses compassion.",
        "source": "T24n1450_015:0177b22_8"
    },
    {
        "source_sentence": "　　我今命欲盡，　　當復作何計？",
        "translation": "Now that my life is about to end, what else should I think?",
        "source": "T24n1450_015:0177b22_8"
    },
    {
        "source_sentence": "　　自念過去業，　　善惡今得報。』",
        "translation": "He thought to himself about past actions, and now he'll get the results of good and bad actions.'",
        "source": "T24n1450_015:0177b22_8"
    },
    {
        "source_sentence": "時熊被煙火逼困苦欲死，即說頌曰：「時熊說此頌已即便命終。",
        "translation": "When the bear was tormented by smoke and fire and suffering painful death, he spoke a verse, saying, After speaking this verse, the bear died.",
        "source": "T24n1450_015:0177b22_8"
    },
    {
        "source_sentence": "時彼獵師知熊死已，即入窟中取熊剝皮分作三分，語彼樵人：『汝取肉二分，我取一分。』",
        "translation": "Knowing that the bear had died, the hunter went into the cave to take two parts of the bear's skin and shaved it into three parts, telling the woodcutter, 'Take two parts of the flesh; I'll take one part.'",
        "source": "T24n1450_015:0177b28_9"
    },
    {
        "source_sentence": "時採樵人以手取肉，當取肉時兩手俱落，獵師見以唱言：『奇哉！",
        "translation": "When the woodcutter takes the flesh with his hand, both hands fall off when he takes it, and the hunter sees it and calls out, 'How wonderful!'",
        "source": "T24n1450_015:0177c01_10"
    },
    {
        "source_sentence": "奇哉！』",
        "translation": "How marvelous!'",
        "source": "T24n1450_015:0177c02_11"
    },
    {
        "source_sentence": "獵師己肉亦不將行，便却入城，以希奇事聞奏於王，說向國人。",
        "translation": "The hunter didn't leave his own flesh, so he withdrew into the city and reported it to the king as an extraordinary thing to tell the people of his country.",
        "source": "T24n1450_015:0177c03_12"
    },
    {
        "source_sentence": "王既聞已親自往看，收取熊皮往詣寺中，打鍾集眾，遂將熊皮安僧眾前。",
        "translation": "Having heard this, the king went personally to see it and collected the bear’s hide. He went to the monastery to beat the bell to gather the monks there. Then he placed the hide in front of the assembly.",
        "source": "T24n1450_015:0177c04_13"
    },
    {
        "source_sentence": "「『大王今當知，　　此非實熊身；",
        "translation": "Great king, you should now know that this is not really the body of a bear.",
        "source": "T24n1450_015:0177c06_14"
    },
    {
        "source_sentence": "　　是勝上菩薩，　　當獲無上果。",
        "translation": "This is the supreme bodhisattva who will attain the unsurpassed fruit.",
        "source": "T24n1450_015:0177c06_14"
    },
    {
        "source_sentence": "　　應三世供養，　　大王須起塔。』",
        "translation": "You should make offerings in the three worlds, and the great king must build a stūpa.'",
        "source": "T24n1450_015:0177c06_14"
    },
    {
        "source_sentence": "王禮僧已，為諸僧眾說如上事，寺中上坐證阿羅漢果，以頌報國王曰：「時王聞已勅諸大臣，取種種香木，往詣熊窟所焚燒其身，起塔安置種種花香，懸繒幡蓋灑掃供養。",
        "translation": "After the king had paid homage to the saṃgha, he explained the above-mentioned matters for the assembly of monks. The superior seat in the monastery who had attained arhatship recited these verses to the king of the country: Having heard this, the king then instructed his ministers to gather various kinds of fragrant wood and go to the bear’s cave to burn him ali",
        "source": "T24n1450_015:0177c06_14"
    },
    {
        "source_sentence": "國王大臣及諸人等共立制約，每一年中同集供養。",
        "translation": "Each year, the king's ministers and other people established a common set of rules to make offerings in each year.",
        "source": "T24n1450_015:0177c13_15"
    },
    {
        "source_sentence": "共立制已禮塔而去。",
        "translation": "Together, they established the precepts, paid homage to the stūpa, and departed.",
        "source": "T24n1450_015:0177c14_16"
    },
    {
        "source_sentence": "一切人民若有來禮彼塔及供養者，皆得生天。」",
        "translation": "If all people come to pay homage to that stūpa or make offerings, they'll be born in heaven.",
        "source": "T24n1450_015:0177c14_17"
    },
    {
        "source_sentence": "佛告諸苾芻：「往昔熊者，今我身是。",
        "translation": "The Buddha told the monks, In the past, I was a bear, but now I am myself.",
        "source": "T24n1450_015:0177c15_18"
    },
    {
        "source_sentence": "昔採樵惡人者，今提婆達多是。",
        "translation": "Formerly the bad woodcutter was Devadatta, who is now Devadatta.",
        "source": "T24n1450_015:0177c16_19"
    },
    {
        "source_sentence": "昔時早已無恩無報，今時亦復無恩無愧。",
        "translation": "Formerly there was no kindness and no retribution, but now there's no kindness and no shame.",
        "source": "T24n1450_015:0177c17_20"
    },
    {
        "source_sentence": "汝等當知。」",
        "translation": "You should know this.",
        "source": "T24n1450_015:0177c18_21"
    },
    {
        "source_sentence": "爾時世尊復告諸苾芻：「此提婆達多復有無恩無報之行。",
        "translation": "It was then that the Bhagavān again addressed the monks, Again, this Devadatta has no kindness and no retribution for his actions.",
        "source": "T24n1450_015:0177c19_0"
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "Listen attentively!",
        "source": "T24n1450_015:0177c20_1"
    },
    {
        "source_sentence": "往昔婆羅痆斯城有一貧人，常取柴樵賣以活命。",
        "translation": "Formerly in the city of Vārāṇasī there was a poor man who always took firewood and sold it for his livelihood.",
        "source": "T24n1450_015:0177c20_2"
    },
    {
        "source_sentence": "其人後於一時，執持繩斧詣於山林，至一樹邊欲採其樵，遂逢大蟲驚怕却走，上一大樹。",
        "translation": "One day, the man took his rope axe and went to the mountain forest. When he arrived at the edge of a tree in order to gather firewood, he met a large worm that fled in fear and climbed up a big tree.",
        "source": "T24n1450_015:0177c21_3"
    },
    {
        "source_sentence": "不覺樹上有熊，見已復怕不敢更上。",
        "translation": "They didn't realize that there was a bear in the tree, and after seeing it, they were afraid and didn't dare to go up further.",
        "source": "T24n1450_015:0177c23_4"
    },
    {
        "source_sentence": "熊見驚怕漸下報言：『汝不須怕！",
        "translation": "Seeing this, the bear was frightened and gradually reported, 'You don't need to be afraid!'",
        "source": "T24n1450_015:0177c24_5"
    },
    {
        "source_sentence": "但依投我。』",
        "translation": "They simply rely on me.'",
        "source": "T24n1450_015:0177c25_6"
    },
    {
        "source_sentence": "樵人聞已亦不敢近。",
        "translation": "After hearing this, the woodcutter didn't dare to approach him.",
        "source": "T24n1450_015:0177c25_7"
    },
    {
        "source_sentence": "熊見悲愍自來執抱，於其樹上選安隱處，熊抱而坐。",
        "translation": "Seeing pity, the bear took his own embrace and went to choose a peaceful place above the tree. The bear greeted him and sat down.",
        "source": "T24n1450_015:0177c25_8"
    },
    {
        "source_sentence": "是時樹下大蟲報其熊曰：『此是無恩眾生，後殃害汝，何須守護？",
        "translation": "The large worm under the tree then reported to the bear, saying, 'This is a kindless sentient being who will harm you in later misfortune, so why should you guard it?'",
        "source": "T24n1450_015:0177c27_9"
    },
    {
        "source_sentence": "當可擲於樹下，我須食之；",
        "translation": "You should toss it under a tree. I must eat it.",
        "source": "T24n1450_015:0177c28_10"
    },
    {
        "source_sentence": "若不得食我終不去。』」",
        "translation": "If you can't eat me, I won't go.'",
        "source": "T24n1450_015:0177c29_11"
    },
    {
        "source_sentence": "佛告諸苾芻：「世間之法，有歸投者尚自守護，何況菩薩有來歸投而不守護？",
        "translation": "The Buddha told the monks, Worldly dharmas are still guarded by those who take refuge in them, so why wouldn't they be guarded by bodhisattvas who take refuge in them?",
        "source": "T24n1450_015:0178a01_0"
    },
    {
        "source_sentence": "時熊報大蟲曰：『此人投我，終不違信。』",
        "translation": "The bear then reported to the great bug, saying, 'This man threw himself at me, but he never disobeyed me.'",
        "source": "T24n1450_015:0178a02_1"
    },
    {
        "source_sentence": "蟲聞此語，為飢乏故亦不肯去。",
        "translation": "When the worm heard these words, it became hungry and refused to leave.",
        "source": "T24n1450_015:0178a03_2"
    },
    {
        "source_sentence": "熊報樵人：『我今抱汝疲乏暫睡，少時汝自警覺并守護我。』",
        "translation": "The bear reported to the woodcutter, saying, 'Now that I'm carrying you in my arms and drowsy for a while, you should alert yourself and guard me for a little while.'",
        "source": "T24n1450_015:0178a04_3"
    },
    {
        "source_sentence": "頭枕樵人便起思念：『我暫睡息，當為樵人說十頌法。』",
        "translation": "The head-covered woodcutter then got up and thought, 'I'll take a moment to sleep and calm down, and I'll explain ten verses of the teaching for the woodcutter.'",
        "source": "T24n1450_015:0178a05_4"
    },
    {
        "source_sentence": "作此念已熊即便睡。",
        "translation": "After he had this thought, the bear went to sleep.",
        "source": "T24n1450_015:0178a06_5"
    },
    {
        "source_sentence": "蟲見熊睡，報樵人曰：『汝能幾時樹上而住？",
        "translation": "Seeing the bear asleep, the worm reported to the woodcutter, 'How long can you stay up in the tree for?'",
        "source": "T24n1450_015:0178a07_6"
    },
    {
        "source_sentence": "應可擲熊樹下我食即去，免害於汝當得還家。』",
        "translation": "You should toss my food under a bear's tree and go away, so you won't harm it; you can return home.'",
        "source": "T24n1450_015:0178a08_7"
    },
    {
        "source_sentence": "時採樵人聞此語已，即起惡念：『此蟲好語，我於此處能幾時住？』",
        "translation": "After hearing these words, the gatherer of firewood then had this bad thought, 'This is a good word for the bug; how long will I be able to stay here?'",
        "source": "T24n1450_015:0178a09_8"
    },
    {
        "source_sentence": "作此念已，便即擲熊樹下推落，覺已未至地間即說十字，說已至地。",
        "translation": "After he had this thought, he tossed it under a bearded tree and pushed it down. He woke up but didn't reach the ground, so he said cross-shaped, and after saying that, he reached the ground.",
        "source": "T24n1450_015:0178a10_9"
    },
    {
        "source_sentence": "蟲既得熊，遂便食噉飽足便去。",
        "translation": "When the worm had obtained the bear, he ate it and became satisfied, and then departed.",
        "source": "T24n1450_015:0178a12_10"
    },
    {
        "source_sentence": "樵人聞熊說十字祕密之法，便即思念：『熊有好法應說視我。』",
        "translation": "When the woodcutter heard the bear teach the secret method of cross-shapedness, he thought, 'The bear has a good teaching that should be taught to me.'",
        "source": "T24n1450_015:0178a12_11"
    },
    {
        "source_sentence": "遂起貪求即生煩惱，為失法故心迷狂走。",
        "translation": "As a result, craving and seeking arise, which are the afflictions that give rise to affliction, and because they're losing the Dharma, their minds wander off in delusion.",
        "source": "T24n1450_015:0178a14_12"
    },
    {
        "source_sentence": "說十字曰。",
        "translation": "He spoke the cross and said.",
        "source": "T24n1450_015:0178a15_13"
    },
    {
        "source_sentence": "「時樵人親屬既見癲狂，將彼歸家，更無餘語唯說十字。",
        "translation": "When the woodcutter's relatives saw that he was crippled, they took him home and told him nothing but a cross.",
        "source": "T24n1450_015:0178a16_0"
    },
    {
        "source_sentence": "其親屬等既見癲狂，即覓醫人及善呪者，種種醫方療不能差。",
        "translation": "When their relatives and so forth saw that they were crippled, they looked for a doctor or someone who had good spells, but various kinds of doctors and medicines couldn't cure them.",
        "source": "T24n1450_015:0178a17_1"
    },
    {
        "source_sentence": "時婆羅痆斯城不遠，有林多菓，眾鳥皆集出美妙音。",
        "translation": "Not far from the city of Vārāṇasī, there was a forest full of fruit and many birds gathered together to produce beautiful sounds.",
        "source": "T24n1450_015:0178a18_2"
    },
    {
        "source_sentence": "時彼林中有一仙人，具五神通，狂人親屬將視仙人，[跍*月]跪禮拜便即白言：『我此眷屬癲狂心亂，不說餘語唯宣十字，我等不解如何治差？』",
        "translation": "A sage in that forest then had five supernormal powers, and his crazy relatives were about to look at the sage. Kneeling down [in a hunch*moon] to venerate him, they said, 'My family members are crippled and my mind is disturbed, so I won't say anything else but proclaim crossroads; how can we treat it if we don't understand?'",
        "source": "T24n1450_015:0178a19_3"
    },
    {
        "source_sentence": "仙人報曰：『此人造惡都不知恩，殺大菩薩擲於樹下，而未至地間說於十字，以攝十頌說此十字已墮地而死，被虎所食，時採樵人便即癲狂。』",
        "translation": "The sage replied, 'This man committed evil and didn't know kindness, killing the great bodhisattva and tossed him under a tree before he reached the ground and told him about the cross. He gathered ten verses to explain that after he said this cross, he fell to the ground and died, being eaten by a tiger, and then the woodcutter went crazy.'",
        "source": "T24n1450_015:0178a22_4"
    },
    {
        "source_sentence": "時諸眷屬及仙門人皆白仙言：『云何十頌？",
        "translation": "The members of his retinue and the sage's disciples then all said to the sage, 'What are the ten verses?'",
        "source": "T24n1450_015:0178a26_5"
    },
    {
        "source_sentence": "復有何義？』",
        "translation": "What's the meaning of that?'",
        "source": "T24n1450_015:0178a27_0"
    },
    {
        "source_sentence": "是時仙人次第解釋，便說頌曰。」",
        "translation": "The sage then explained it one by one, and he spoke a verse, saying.",
        "source": "T24n1450_015:0178a27_1"
    },
    {
        "source_sentence": "爾時世尊告諸苾芻：「汝等當知！",
        "translation": "It was then that the Bhagavān addressed the monks, You should know!",
        "source": "T24n1450_015:0178a27_2"
    },
    {
        "source_sentence": "往昔熊者，今我身是。",
        "translation": "The bear of the past is now me.",
        "source": "T24n1450_015:0178a28_3"
    },
    {
        "source_sentence": "時採樵人不知恩者，今提婆達多是。",
        "translation": "The woodcutter who didn't know the kindness at the time was Devadatta, now Devadatta.",
        "source": "T24n1450_015:0178a29_4"
    },
    {
        "source_sentence": "昔不知恩，今亦如是。",
        "translation": "In the past I did not know kindness, but so it is now.",
        "source": "T24n1450_015:0178a29_5"
    },
    {
        "source_sentence": "汝等當知。」",
        "translation": "You should know this.",
        "source": "T24n1450_015:0178b01_6"
    },
    {
        "source_sentence": "爾時世尊告諸苾芻：「此提婆達多復有無恩無報之行。",
        "translation": "It was then that the Bhagavān addressed the monks, Again, this Devadatta has no kindness or retribution for his actions.",
        "source": "T24n1450_015:0178b02_0"
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "Listen attentively!",
        "source": "T24n1450_015:0178b03_1"
    },
    {
        "source_sentence": "昔有一城名曰寂靜，其中有王亦名寂靜。",
        "translation": "In the old days there was a city called Silent, in which there was a king named Silent.",
        "source": "T24n1450_015:0178b03_2"
    },
    {
        "source_sentence": "國土豐饒人民安樂，無諸賊盜不相征伐。",
        "translation": "The land is abundant and the people are peaceful, and there are no thieves or thieves who don't attack each other.",
        "source": "T24n1450_015:0178b04_3"
    },
    {
        "source_sentence": "王性慈悲，愍諸眾生等如一子，心好惠施常樂聽法，無有慳貪，供養沙門婆羅門等及諸貧病，心無厭足。",
        "translation": "The king's nature is compassionate and pitying sentient beings like a single child, his mind is fond of generosity, always happy to listen to the Dharma, has no stinginess or greed, makes offerings to ascetics, priests, and other poor and sick people, and doesn't tire of it.",
        "source": "T24n1450_015:0178b05_4"
    },
    {
        "source_sentence": "王有常法，每日清旦先參父母，後看病人，然治國務。",
        "translation": "Every day at dawn the king observed a rule of regularity, first visiting his parents and attending to the ill; but he governed the affairs of state.",
        "source": "T24n1450_015:0178b07_5"
    },
    {
        "source_sentence": "時有貧人重病極困，醫人瞻者不肯與藥，皆云定死。",
        "translation": "At the time, there was a poor man seriously ill and in great distress, and the doctors who saw him refused to give him medicine, saying that he would surely die.",
        "source": "T24n1450_015:0178b08_6"
    },
    {
        "source_sentence": "病人既聞心懷苦惱，悲泣遊行至寂靜城。",
        "translation": "When the sick man heard this, his mind was overcome with sorrow and distress, and he wailed in tears as he marched to the city of Silentude.",
        "source": "T24n1450_015:0178b10_7"
    },
    {
        "source_sentence": "時王春時與諸群臣后妃眷屬欲遊園觀，行詣城門，時彼病人拄杖悲泣，跪拜王前白其王曰：『唯願大王，救我救我如是病苦，令得命全。』",
        "translation": "In the spring of that year, the king and his ministers, queens, and their retinues wanted to visit the park and go to the city gates, but the sick man cried in pity when he knelt down and bowed to the king and said to him, 'May the great king please save me and save me from such illness and suffering so that my life will be complete.'",
        "source": "T24n1450_015:0178b11_0"
    },
    {
        "source_sentence": "王既見已起大慈悲，迴駕還宮命大臣曰：『召我國內所有醫人。』",
        "translation": "After seeing this, the king arouses great compassion and returns to the palace with his carriage and appoints a minister, saying,'summon all the doctors in my country.'",
        "source": "T24n1450_015:0178b14_1"
    },
    {
        "source_sentence": "臣奉王命，遂即召集一切醫人，便將見王。",
        "translation": "The ministers obeyed the king's order, so they summoned all the doctors and soon saw the king.",
        "source": "T24n1450_015:0178b15_2"
    },
    {
        "source_sentence": "王喚病人躬自親看：『汝等醫人必須治差。』",
        "translation": "The king summoned the sick man and saw for himself, 'You doctors must treat your illnesses.'",
        "source": "T24n1450_015:0178b16_3"
    },
    {
        "source_sentence": "諸醫見已白大王曰：『觀此人病藥極難得。』",
        "translation": "Seeing them, the doctors said to the great king, 'Look at this person's illness and medicine are extremely difficult to obtain.'",
        "source": "T24n1450_015:0178b17_4"
    },
    {
        "source_sentence": "王便問曰：『何故難得？』",
        "translation": "The king then asked, 'Why is it difficult?'",
        "source": "T24n1450_015:0178b18_5"
    },
    {
        "source_sentence": "醫答王言：『要須一生不解嗔人，而取其血煮粥治之，方可除差。",
        "translation": "The physician answered the king, saying, 'It's necessary for one lifetime to not understand anger and take his blood and cook porridge to treat it before he can get rid of it.",
        "source": "T24n1450_015:0178b18_6"
    },
    {
        "source_sentence": "如若不得其病不除。』",
        "translation": "If he doesn't get it, his illness won't be healed.'",
        "source": "T24n1450_015:0178b20_7"
    },
    {
        "source_sentence": "王既聞已便作是念：『我既不能救一人命，用此王位及身命為？』",
        "translation": "After hearing this, the king thought, 'Since I can't save one person's life, what is the use of this king's position and body and life?'",
        "source": "T24n1450_015:0178b20_8"
    },
    {
        "source_sentence": "却自觀察，『我一生來無有瞋處。』",
        "translation": "Instead, he observes for himself, 'There's no place where there's anger in my lifetime.'",
        "source": "T24n1450_015:0178b22_9"
    },
    {
        "source_sentence": "作是念已，命其乳母便即問曰：『我幼小時不有瞋不？』",
        "translation": "After he had this thought, he ordered his wet nurse to ask, 'Didn't I have anger when I was young?'",
        "source": "T24n1450_015:0178b22_10"
    },
    {
        "source_sentence": "乳母答言：『自生抱王我尚無瞋，何況王身！』",
        "translation": "The nurse replied, 'I'm still not angry when I'm born to embrace the king, so why wouldn't I be angry with the king's body?'",
        "source": "T24n1450_015:0178b24_0"
    },
    {
        "source_sentence": "未將為定，更問親母：『兒自生來見有瞋不？』",
        "translation": "Before he's set, he asks his relatives and mothers, 'Did you see anger from your own birth?'",
        "source": "T24n1450_015:0178b24_1"
    },
    {
        "source_sentence": "母便報曰：『既懷王已我尚無瞋，況王自身！』",
        "translation": "The mother then replied, 'Since I've harbored the king, I still have no anger, so why wouldn't I?'",
        "source": "T24n1450_015:0178b25_2"
    },
    {
        "source_sentence": "王既聞已歡喜踊躍，作如是念：『今得藥耶？』",
        "translation": "After hearing it, the king rejoiced and jumped for joy, and thought, 'Has he gotten the medicine now?'",
        "source": "T24n1450_015:0178b26_3"
    },
    {
        "source_sentence": "告諸醫人：『於我身上，五處下針刺取其血。』",
        "translation": "He told the doctors, 'On my body, I'll place a needle underneath five places to draw blood.'",
        "source": "T24n1450_015:0178b27_4"
    },
    {
        "source_sentence": "諸醫白王：『病人卑下、王是貴勝，我今不敢於王身上而輒下針。』」",
        "translation": "The doctors said to the king, 'The sick man is inferior and the king is noble, so now I won't dare to put down a needle on the king's body.'",
        "source": "T24n1450_015:0178b28_5"
    },
    {
        "source_sentence": "佛告諸苾芻：「一切菩薩善解世間種種事業。",
        "translation": "The Buddha told the monks, All bodhisattvas well understand the various worldly undertakings.",
        "source": "T24n1450_015:0178c01_6"
    },
    {
        "source_sentence": "爾時國王起慈悲心，即自下針五處出血令器皆滿，便付醫人，即令作粥與病人食。",
        "translation": "The king of that country then became compassionate, dropped his needles and bled in five places to make sure the containers were full, gave them to a doctor, made porridge, and fed the patient.",
        "source": "T24n1450_015:0178c02_7"
    },
    {
        "source_sentence": "是時國人見王慈悲善養黎庶，王子臣人后妃婇女一切國人悉皆啼泣，共相謂曰：『王愍一人不惜身命，棄捨我等今無依怙。』",
        "translation": "Seeing the king's compassionate kindness and well- nourishment to the common people, princes, ministers, queens, consorts, and court ladies all wept and said to each other, 'The king pitying one person doesn't spare his life; he abandons us and now has no support.'",
        "source": "T24n1450_015:0178c04_0"
    },
    {
        "source_sentence": "王既聞已報諸人曰：『汝勿懊惱，此非惡事。』",
        "translation": "After hearing this, the king reported to the people, 'Don't be distressed; this isn't a bad thing.'",
        "source": "T24n1450_015:0178c06_1"
    },
    {
        "source_sentence": "爾時大王於其六月日日出血供其病人，是時國王漸加羸瘦身體無力。",
        "translation": "It was then that the great king bled day after day for six months to help his sick man, and the king gradually became weaker and thinner in body and powerless.",
        "source": "T24n1450_015:0178c07_2"
    },
    {
        "source_sentence": "清淨諸天見王事已，作如是念：『此是賢劫菩薩身，若遣衰亡非是好事，我等以天威力方便，毛孔之中皆入甘露。』",
        "translation": "Seeing the king's deeds, the pure gods thought, 'This is the bodhisattva's body of the good eon, and it's not a good idea for us to use the power of heavenly skillful means to enter ambrosia in our hair pores.'",
        "source": "T24n1450_015:0178c09_3"
    },
    {
        "source_sentence": "念已即與威力，王當可活、病人得差。",
        "translation": "After he thought this, he gave him his authority, and the king would be able to live and the sick man would be cured.",
        "source": "T24n1450_015:0178c12_4"
    },
    {
        "source_sentence": "諸天加威，王得平復，病人又差。",
        "translation": "When the gods gained power, the king regained his peacefulness and the sick man was cured again.",
        "source": "T24n1450_015:0178c12_5"
    },
    {
        "source_sentence": "王便更與病人五大好村。",
        "translation": "The king then gave the sick man five large and beautiful villages.",
        "source": "T24n1450_015:0178c13_6"
    },
    {
        "source_sentence": "時彼病人寂靜城中，與其城內王臣宰貴身為同類，八方傳號。",
        "translation": "At the time, that sick man was still in the city and his king's ministers and officials inside the city were of the same caste as them, with the names transmitted from one side to the other in eight directions.",
        "source": "T24n1450_015:0178c14_7"
    },
    {
        "source_sentence": "經於六月與病人血食乃得差，及以更賞五大好村。",
        "translation": "After six months, he gave the sick man a meal of blood to eat, and then he was cured, and he rewarded the five great beautiful villages.",
        "source": "T24n1450_015:0178c15_8"
    },
    {
        "source_sentence": "八方既聞此號皆悉怪念，來至彼城問彼病人曰：『實國王經六月中出血供養汝不？』",
        "translation": "When the eight directions heard this call, they all wondered and came to that city and asked the sick man, 'In six months, did the king of reality bleed blood to make offerings to you?'",
        "source": "T24n1450_015:0178c16_9"
    },
    {
        "source_sentence": "彼病惡人即作無恩無報告諸人曰：『此之國王於我何益？",
        "translation": "That sick and evil person then did no favors and didn't report, and the people said, 'What good is the king of this country to me?'",
        "source": "T24n1450_015:0178c18_10"
    },
    {
        "source_sentence": "身有惡血應合棄却，或以施人此有何怪？』",
        "translation": "If there's bad blood in your body, you should discard it; or if you give it to someone else, what wonder is there?'",
        "source": "T24n1450_015:0178c19_11"
    },
    {
        "source_sentence": "然彼惡人出此語已，即於地中火出，燒此人家一切皆盡，彼之病人却得瘦病。」",
        "translation": "After that bad man spoke these words, however, a fire emerged from the ground and burned everything in this house, and the sick man became thin and ill.",
        "source": "T24n1450_015:0178c20_12"
    },
    {
        "source_sentence": "佛告諸苾芻：「彼國王者，今我身是。",
        "translation": "The Buddha told the monks, That king of that country is now me.",
        "source": "T24n1450_015:0178c22_13"
    },
    {
        "source_sentence": "彼時病人無恩無報，今提婆達多是。」",
        "translation": "The sick man at the time had no kindness or reward, and this is Devadatta now.",
        "source": "T24n1450_015:0178c23_14"
    },
    {
        "source_sentence": "佛告諸苾芻：「此提婆達多復有無恩無報之行。",
        "translation": "The Buddha told the monks, This Devadatta has another practice that's without kindness and without retribution.",
        "source": "T24n1450_015:0178c24_15"
    },
    {
        "source_sentence": "汝等諦聽！",
        "translation": "Listen attentively!",
        "source": "T24n1450_015:0178c25_16"
    },
    {
        "source_sentence": "往昔過去婆羅痆斯城，有一國王廣如前說，乃至王妃生一王子，顏貌端嚴，其色赤白頭面圓滿，猶如傘蓋。",
        "translation": "In the past, in the city of Vārāṇasī, there was a king as explained above, and his queen gave birth to a prince with a graceful appearance, red and white in color, with a perfectly rounded head and face like an umbrella.",
        "source": "T24n1450_015:0178c25_17"
    },
    {
        "source_sentence": "手臂垂下猶如象鼻，兩眉相連額廣鼻直，一切肢節悉皆圓足。",
        "translation": "Their arms hang down like an elephant's nose, their two eyebrows are interlocked, their foreheads are broad and the nose straight, and all their limbs are fully legless.",
        "source": "T24n1450_015:0178c27_18"
    },
    {
        "source_sentence": "彼生之時諸吉祥事悉皆現前，生已經於二十一日，一切眷屬皆來集會作諸喜樂。",
        "translation": "When he's born, all the auspicious things will be manifested, and after he's born on the twenty-first day, all his retinues will come together to create joy and happiness.",
        "source": "T24n1450_015:0178c29_19"
    },
    {
        "source_sentence": "是時諸臣相共白言：『王子生時百千吉祥皆悉現前，因此立名號為善行。』",
        "translation": "The ministers then said to each other, 'When the prince was born, a hundred thousand auspicious signs all appeared before him, so he established his name as a good practice.'",
        "source": "T24n1450_015:0179a02_20"
    },
    {
        "source_sentence": "廣說如上，乃至漸長。",
        "translation": "It's explained in detail as above, up to gradually growing.",
        "source": "T24n1450_015:0179a03_21"
    },
    {
        "source_sentence": "時彼善行性大慈悲，於諸有情生怜愍心，常樂布施，濟給沙門、婆羅門及諸貧窮遠行人等。",
        "translation": "That good practitioner then had great compassion by nature, became compassionate toward sentient beings, always delighted in generosity to help ascetics, priests, and other poor and distant practitioners.",
        "source": "T24n1450_015:0179a04_22"
    },
    {
        "source_sentence": "爾時父王語善行言：『自今已後，不應如是恒行布施，我國庫藏不可供足。』",
        "translation": "It was then that the father king said to Sunetra, 'From now on, you shouldn't always practice generosity like this; our treasury won't be sufficient.'",
        "source": "T24n1450_015:0179a06_23"
    },
    {
        "source_sentence": "是時王妃又生一子，彼子生時百千災厄不吉祥事，皆悉現前，乃至立號名為惡行。",
        "translation": "The king's queen then gave birth to another child, and when that child was born, a hundred thousand disasters and inauspicious things all appeared before her, even naming them bad actions.",
        "source": "T24n1450_015:0179a08_0"
    },
    {
        "source_sentence": "至彼長大。」",
        "translation": "They'll grow up there.",
        "source": "T24n1450_015:0179a09_1"
    },
    {
        "source_sentence": "佛告諸苾芻：「世間常法：行布施者，眾人喜愛名稱普聞。",
        "translation": "The Buddha told the monks, It's always true in the world: When someone practices generosity, the people love their reputation and universally hear it.",
        "source": "T24n1450_015:0179a10_2"
    },
    {
        "source_sentence": "有異國王，聞其善行好行惠施，遂欲嫁女為善行妻，多與珍寶車乘僮僕作書遣使。",
        "translation": "When a king of another country heard that Shanxing was good-practicing and generous, he wanted to marry her as Shanxing's wife. He gave many treasured chariots, carriages, servants, and messengers in writing to send them off.",
        "source": "T24n1450_015:0179a11_3"
    },
    {
        "source_sentence": "詣婆羅痆斯國報其王知，王聞歡喜許共為婚。",
        "translation": "He went to the country of Vārāṇasī and reported this to the king, who was delighted when he heard it and agreed to marry with him.",
        "source": "T24n1450_015:0179a13_4"
    },
    {
        "source_sentence": "是時善行前白父王：『不欲費損父王庫藏，我今入海自求珍寶，得已娶妻。』",
        "translation": "He then went before Sunetra and said to his father, 'I don't want to lose the treasury of my father's storehouse; now that I've entered the sea to seek treasure for myself, I'll marry after I get it.'",
        "source": "T24n1450_015:0179a14_5"
    },
    {
        "source_sentence": "王即聽許。",
        "translation": "The king then listened and gave his permission.",
        "source": "T24n1450_015:0179a15_6"
    },
    {
        "source_sentence": "善行見許，歡喜裝束辦糧欲去。",
        "translation": "Seeing his approval, Shanxing was delighted and prepared to leave.",
        "source": "T24n1450_015:0179a16_7"
    },
    {
        "source_sentence": "惡行見已即作是念：『今此我兄，自他國人皆悉愛敬，入海採寶忽若得來，父王大臣一切國人倍生敬重，我父必當策為國主，我無國分。",
        "translation": "Seeing this bad action, he thought to himself, “This is my brother. All the people in other countries hold him dear and venerate him. Suddenly they go into the sea to collect treasures and suddenly come here. Their fathers, kings, ministers, and all the people of their countries are even more respectful to me. My father will surely be the ruler of my country; I have no sovereignty over",
        "source": "T24n1450_015:0179a16_8"
    },
    {
        "source_sentence": "我今宜可設一方便隨彼入海伺求殺之，我身得迴。",
        "translation": "Now, it's advisable for me to devise a method of following them into the ocean and seeking to kill them, so that I can turn around.",
        "source": "T24n1450_015:0179a20_0"
    },
    {
        "source_sentence": "樂與不樂，父必策我以為太子。』",
        "translation": "What's pleasant and what's unpleasant, and my father will surely take me as the prince.'",
        "source": "T24n1450_015:0179a21_1"
    },
    {
        "source_sentence": "作此念已，亦詣父所白父王曰：『我欲隨兄入海求寶。』",
        "translation": "After he had this thought, he also went to his father and said to the king, 'I want to go with my brother into the sea to search for treasure.'",
        "source": "T24n1450_015:0179a21_2"
    },
    {
        "source_sentence": "王聞許之，惡行歡喜亦作裝束。",
        "translation": "When the king heard this and gave his permission, he rejoiced in evil deeds and also made a monk's robe.",
        "source": "T24n1450_015:0179a23_3"
    },
    {
        "source_sentence": "是時善行，於其城內擊鼓搖鈴，遍告眾人：『我欲入海，有能去者，應辦糧食裝束隨行，我為商主，水陸阻難我皆能護，我皆能護使無怖畏，亦不輸稅。』",
        "translation": "Good practice then beats the drum and shakes the bell in his city, telling all the people, 'If I want to enter the sea and there's someone who can go, prepare food and clothing for my travel, I'm the merchant leader, and I can protect them if there's an obstacle on land or water, and I can protect them so they won't fear me and don't pay any taxes.'",
        "source": "T24n1450_015:0179a23_4"
    },
    {
        "source_sentence": "作是語已，有五百人至太子所白太子言：『我等請隨太子。』",
        "translation": "After he said this, five hundred people went to the prince and said to him, 'We're invited to follow the prince.'",
        "source": "T24n1450_015:0179a27_5"
    },
    {
        "source_sentence": "于時取吉勝日，即便同去。",
        "translation": "They then took the auspicious day and departed together.",
        "source": "T24n1450_015:0179a28_6"
    },
    {
        "source_sentence": "廣說如前，乃至入海即告弟曰：『此舶海中忽逢難破，汝應捉我，不須恐怖。』",
        "translation": "He explained it in detail as before, and even when he entered the sea, he told his disciple, 'This ship suddenly encounters difficulty breaking down in the ocean; you should catch me; there's no need to be afraid.'",
        "source": "T24n1450_015:0179a29_7"
    },
    {
        "source_sentence": "惡行報云：『如兄所教。』",
        "translation": "The retribution of bad actions is, 'Thus taught by my brother.'",
        "source": "T24n1450_015:0179b01_8"
    },
    {
        "source_sentence": "舶遇好風遂至寶所。",
        "translation": "When the ship encountered a good wind, it reached the treasure site.",
        "source": "T24n1450_015:0179b02_9"
    },
    {
        "source_sentence": "是時舶師告於太子及眾人曰：『汝等昔聞有珍寶渚，今此處是。",
        "translation": "The captain of the ship then told the prince and his men, 'In the past you heard that there was a island of treasures and treasures, and this is where it is now.",
        "source": "T24n1450_015:0179b02_10"
    },
    {
        "source_sentence": "有種種寶，隨其採取。』",
        "translation": "There are various treasures that can be collected according to them.'",
        "source": "T24n1450_015:0179b04_11"
    },
    {
        "source_sentence": "眾人聞已歡喜踊躍，即便下舡取種種寶，猶如麻麥滿其船中。",
        "translation": "The people who heard this rejoiced and jumped for joy. They even went down to the bottom of the river to collect various treasures, just as if they were filled with sesame wheat floating on a boat.",
        "source": "T24n1450_015:0179b04_12"
    },
    {
        "source_sentence": "善行太子取如意珠，繫其腰下迴船而還。",
        "translation": "Prince Sunetra then took the wish-granting pearl, tied it around his waist, and returned by boat.",
        "source": "T24n1450_015:0179b06_13"
    },
    {
        "source_sentence": "欲至此岸，逢摩竭魚打破其船。",
        "translation": "When he was about to reach this shore, he encountered a mahoraga fish and broke his boat.",
        "source": "T24n1450_015:0179b07_0"
    },
    {
        "source_sentence": "是時惡行即捉其兄，船人珍寶皆悉漂失。",
        "translation": "The evildoer then grabbed his brother, and the boatmen and treasures all drifted away.",
        "source": "T24n1450_015:0179b07_1"
    },
    {
        "source_sentence": "唯有惡行，以兄威力得至此岸。",
        "translation": "Only bad deeds caused him to reach this shore by the power of his elder brother.",
        "source": "T24n1450_015:0179b08_2"
    },
    {
        "source_sentence": "善行用力既出海已疲極而睡，惡行守兄，遂見其兄腰下寶珠。",
        "translation": "Shanxing's exertion was exhausted, and he fell asleep after emerging from the ocean. While guarding his brother with evil deeds, he saw the precious pearl beneath his brother's waist.",
        "source": "T24n1450_015:0179b09_3"
    },
    {
        "source_sentence": "即作是念：『兄得好珠我失所獲，我今應可刺兄目瞎，持珠獨還。』",
        "translation": "He then thought, 'This is what I lost when my brother got a good pearl, so now I should pierce his blindness and return it alone with the pearl.'",
        "source": "T24n1450_015:0179b10_4"
    },
    {
        "source_sentence": "作是念已先盜取寶，便以棘針刺兄目瞎，棄之而去。",
        "translation": "Having thought this, he first steals the treasure and then pierces his brother’s blind eyes with a thorn needle. He discards it and leaves.",
        "source": "T24n1450_015:0179b12_5"
    },
    {
        "source_sentence": "善行無眼不知歸路，後牧牛人見已問云：『從何而來？』",
        "translation": "When Shanxing had no eyes, he didn't know the way to return, and when the cowherd saw him, he asked, 'Where did you come from?'",
        "source": "T24n1450_015:0179b13_6"
    },
    {
        "source_sentence": "是時盲人具如上說。",
        "translation": "The blind man then explained it as above.",
        "source": "T24n1450_015:0179b14_7"
    },
    {
        "source_sentence": "牧牛人知即起慈心，將歸家中。",
        "translation": "Knowing this, the cowherd immediately became compassionate and returned home.",
        "source": "T24n1450_015:0179b15_8"
    },
    {
        "source_sentence": "善行本性極善彈琴，在彼家內時為彈琴。",
        "translation": "Shanxing's original nature is extremely good at playing the lute, and when he's inside his house, he plays the lute.",
        "source": "T24n1450_015:0179b15_9"
    },
    {
        "source_sentence": "牧牛人妻心生愛念，即起染欲語盲人云：『共我行私。』",
        "translation": "The cowherd wife's mind became cravingful, and she became defiled with desire and said to the blind man, 'Let's go privately together.'",
        "source": "T24n1450_015:0179b16_10"
    },
    {
        "source_sentence": "盲人聞已兩手掩耳白云：『勿出此語，我不欲聞。",
        "translation": "After hearing this, the blind man covered his ears with both hands and said, 'Don't say these words; I don't want to hear them.",
        "source": "T24n1450_015:0179b17_11"
    },
    {
        "source_sentence": "汝是我妹，何出此言？』」",
        "translation": "You're my sister, so why do you say that?'",
        "source": "T24n1450_015:0179b18_12"
    },
    {
        "source_sentence": "佛告諸苾芻：「世間常法：一切有情心貪欲色，若不相隨各生瞋恚。",
        "translation": "The Buddha told the monks, It's always true in the world: All sentient beings have minds that crave form, and if they don't follow each other, anger will arise.",
        "source": "T24n1450_015:0179b19_13"
    },
    {
        "source_sentence": "時彼婦人見不遂意，即生瞋恨起心謗染，告其夫云：『彼無目人欲婬穢我，如何家內養此惡人？』」",
        "translation": "Seeing what she didn't want, the woman became angry and distressed, and told her husband, 'That blind man wants to defile me, so how can he raise this bad person in his house?'",
        "source": "T24n1450_015:0179b20_14"
    },
    {
        "source_sentence": "佛復告諸苾芻：「世間常法：一切有情於所愛妻，被人侵污心生瞋惱，此一切怨此怨為重。",
        "translation": "Again, the Buddha told the monks, It's always the case in the world that all sentient beings become angry when they're attacked by someone who loves their wife, and this is a serious enmity or resentment.",
        "source": "T24n1450_015:0179b23_0"
    },
    {
        "source_sentence": "由此因緣其牧牛人聞妻語已，於無目人起重瞋恨，復作是念：『此人重罪，今見無目，即是受報，不須殺害，但驅令出。』",
        "translation": "For this reason, the cowherd heard what his wife said, became deeply angry at the person without eyes and again thought, 'This man committed a grave offense; now that he has no eyes, he's suffering the result, so he doesn't need to be killed but must be expelled.'",
        "source": "T24n1450_015:0179b25_0"
    },
    {
        "source_sentence": "作此念已即便馳出。",
        "translation": "After he had this thought, he fled.",
        "source": "T24n1450_015:0179b27_1"
    },
    {
        "source_sentence": "其無目人抱琴而去，巡歷城邑乞求活命。",
        "translation": "The blind man took his lute and departed, traveling through the cities to beg for a living.",
        "source": "T24n1450_015:0179b28_2"
    },
    {
        "source_sentence": "後時父王既崩之後，其弟惡行即紹王位，無目之人漸次乞求，至妻國城。",
        "translation": "Later, after his father died, the king's younger brother bad behavior assumed the throne of kingship, and the blind man gradually begged for it one by one until he went to his wife's country and city.",
        "source": "T24n1450_015:0179b29_0"
    },
    {
        "source_sentence": "其妻年長，諸國王子皆從競索，女之父王告其女曰：『先嫁汝時，善行王子入海船沒而死。",
        "translation": "As the wife grew old, all the princes of various countries competed for her. The daughter’s father told her daughter, “When you were previously married to me, Prince Sudarśana entered into a ship and died.",
        "source": "T24n1450_015:0179c01_1"
    },
    {
        "source_sentence": "今有王子等競來索汝，如不嫁汝，恐諸王子心懷瞋恨。",
        "translation": "Now, there are princes and others who come to ask for you, just as if they won't marry you, lest the princes harbor anger in their minds.",
        "source": "T24n1450_015:0179c03_2"
    },
    {
        "source_sentence": "是故我今共汝平章，汝心若為？』",
        "translation": "Therefore, I'll now share with you a peaceful chapter, so what do you think?'",
        "source": "T24n1450_015:0179c04_3"
    },
    {
        "source_sentence": "女白王曰：『唯願父王，勅國內人，嚴淨城邑集諸國人，女自簡選。』",
        "translation": "The queen said to the king, 'All we ask, father, is that you command the people of your country to adorn and purify the cities and gather the people of their countries so that the queen can choose them for herself.'",
        "source": "T24n1450_015:0179c05_4"
    },
    {
        "source_sentence": "父王允女所請，遂勅境內及諸外國：『我有一女今欲出嫁，集諸國人自簡駙馬。』",
        "translation": "The father and king agreed with the request, so he ordered all the people in his territory and those outside of his country to say, 'There's a woman who wants to marry me now, and they gathered the people of their countries to make up their own horses.'",
        "source": "T24n1450_015:0179c07_5"
    },
    {
        "source_sentence": "遂即嚴飾城隍如歡喜園，即令擊鼓宣告：『現在城中所有人眾，及四遠來者，王女求夫隨情選擇，君等隨力莊飾，皆來集會。』",
        "translation": "He then adorned the city goddess as a joyful park, and he ordered her to beat the drum and declare, 'Now, all the people in the city and those from the four distant lands who are seeking husbands will choose them according to their feelings, and you'll all be adorned according to your abilities and come to the assembly.'",
        "source": "T24n1450_015:0179c08_6"
    },
    {
        "source_sentence": "至明清旦嚴飾王女，與諸婇女相隨而出，如歡喜園中吉祥天女處妙花林，遂於城中百千萬數大眾之中，次第巡行自求夫主。",
        "translation": "The next morning, the king's beautifully adorned queen and her court ladies emerged with them, just like the auspicious celestial maiden in the joyful park in a marvelous flowery forest, so she went around among hundreds of thousands of millions of people in the city to search for her husband.",
        "source": "T24n1450_015:0179c11_7"
    },
    {
        "source_sentence": "其時善行立在一邊彈琴而住，有情業力因緣會合，共相遭遇。",
        "translation": "When Shanxing then stood at one side, played the lute and stayed there, sentient beings gathered together by the causes and conditions of their karmic power to meet each other.",
        "source": "T24n1450_015:0179c14_8"
    },
    {
        "source_sentence": "聞彼琴聲心生戀慕，即以花鬘遙擲其上，告言：『此人是我夫主。』",
        "translation": "When he heard the sound of that lute, his mind became attached to it, and he threw a flower garland over it from a distance and told him, 'This man is my husband's master.'",
        "source": "T24n1450_015:0179c15_9"
    },
    {
        "source_sentence": "時諸大眾各生憂惱，共出嫌言：『今此眾內有多豪族，諸方貴勝王子大臣年華可愛，及此城內美妙男子，如何棄此而取盲人以為夫主？』",
        "translation": "The masses of people then became sad and angry, each saying, 'Now that there are so many powerful clans in this assembly, the noble princes and ministers from different directions who are beautiful and attractive in appearance and the wonderful men in this city, how could they abandon them here and take the blind man as their husband?'",
        "source": "T24n1450_015:0179c17_10"
    },
    {
        "source_sentence": "時王近臣見此事已，心懷憂惱，便入白王：『王隨女情求得夫主。』",
        "translation": "Seeing this, the king's close ministers were grieved and distressed, and they went in to the king and said, 'The king follows the woman's feelings and seeks her husband.'",
        "source": "T24n1450_015:0179c20_11"
    },
    {
        "source_sentence": "王問：『如何？』",
        "translation": "The king asked, 'What's the matter?'",
        "source": "T24n1450_015:0179c21_12"
    },
    {
        "source_sentence": "答言：『眼瞎。』",
        "translation": "He replied, 'The eye is blind.'",
        "source": "T24n1450_015:0179c22_13"
    },
    {
        "source_sentence": "王聞愁惱，喚女來問：『少女何意？",
        "translation": "When the king heard this, he was distressed and summoned the daughter to come and ask her, 'What do you think, young woman?'",
        "source": "T24n1450_015:0179c22_14"
    },
    {
        "source_sentence": "今此城中多有賢人貴勝宰輔大臣及四遠來男子非一，何因不愛而取盲人？』",
        "translation": "Now that there are so many good men in this city, noble ministers, and four men from distant lands who aren't one and the same, why don't they take the blind man because they don't love him?'",
        "source": "T24n1450_015:0179c23_15"
    },
    {
        "source_sentence": "女答父云：『我愛於此。』",
        "translation": "The woman answered her father, 'I love this.'",
        "source": "T24n1450_015:0179c24_16"
    },
    {
        "source_sentence": "王曰：『若爾，宜應就彼。",
        "translation": "The king said, 'If that's the case, it's appropriate to go there.",
        "source": "T24n1450_015:0179c25_17"
    },
    {
        "source_sentence": "何故住斯？』",
        "translation": "Why are you staying here?'",
        "source": "T24n1450_015:0179c25_18"
    },
    {
        "source_sentence": "女即詣彼告言：『仁是我夫。』",
        "translation": "The woman then went to him and told him, 'Sir, you're my husband.'",
        "source": "T24n1450_015:0179c26_19"
    },
    {
        "source_sentence": "答曰：『汝為非理，作此思惟，共餘男子而為交耶？』",
        "translation": "He answered, 'Is it not reasonable for you to think like this and exchange words with other men?'",
        "source": "T24n1450_015:0179c26_20"
    },
    {
        "source_sentence": "女曰：『仁者，我無此心作如是事。』",
        "translation": "The woman said, 'Sir, kindness, I don't have this mind to do such a thing.'",
        "source": "T24n1450_015:0179c27_21"
    },
    {
        "source_sentence": "問曰：『如何得知？』",
        "translation": "He asked, 'How can I know?'",
        "source": "T24n1450_015:0179c28_22"
    },
    {
        "source_sentence": "女即懇誠發實信語：『仁今證實我心如念：「善行王子及於仁處，情生樂欲無異心者，願仁一目平復如故。」』",
        "translation": "The woman then earnestly and sincerely gave rise to true faith, saying, 'Now, you've confirmed my mind as I thought, Good sons, princes and benefactors, whose feelings give rise to pleasure and desire without different thoughts, may your one eye be as it was before.'",
        "source": "T24n1450_015:0179c28_23"
    },
    {
        "source_sentence": "而此少女發實語時，盲人一目便即開明，告曰：『賢女！",
        "translation": "When this young woman spoke the truth, a blind man opened his eyes with one eye and told her, 'Good girl!",
        "source": "T24n1450_015:0180a02_24"
    },
    {
        "source_sentence": "我是善行，被弟惡行而於我處為無利事。』",
        "translation": "I'm a good practitioner, and my disciples do bad deeds that are not beneficial to me.'",
        "source": "T24n1450_015:0180a03_25"
    },
    {
        "source_sentence": "女曰：『何以得知仁是善行？』",
        "translation": "The woman said, 'How do you know that kindness is a good practice?'",
        "source": "T24n1450_015:0180a04_26"
    },
    {
        "source_sentence": "即發實語作如是言：『我被惡行刺我眼時，我心於彼而無少恨。",
        "translation": "He then spoke the truth and said, 'When I'm harmed by bad actions that pierce my eyes, my mind has no little grudge against them.",
        "source": "T24n1450_015:0180a04_27"
    },
    {
        "source_sentence": "斯言若實，我之一目平復如故。』",
        "translation": "If this is true, then one of my eyes will be as it was before.'",
        "source": "T24n1450_015:0180a06_28"
    },
    {
        "source_sentence": "說實語時雙眼明照。",
        "translation": "When he speaks the true words, his two eyes are clearly illuminated.",
        "source": "T24n1450_015:0180a06_29"
    },
    {
        "source_sentence": "是時王女即將善行詣父王處，白言：『此是我夫。』",
        "translation": "The king's daughter then went to her father, the king, and said, 'This is my husband.'",
        "source": "T24n1450_015:0180a07_30"
    },
    {
        "source_sentence": "王乃不信，女便向王具說前事。",
        "translation": "The king then didn't believe it, so the woman told the king about the previous events.",
        "source": "T24n1450_015:0180a08_31"
    },
    {
        "source_sentence": "王甚奇怪，即令大禮共成婚媾已，多嚴兵馬，令其善行還到本城，驅彼惡行，冊立善行紹繼父位。",
        "translation": "The king was very surprised, and he ordered him to perform the great ritual of making a common marriage ceremony. He prepared his troops and horses so that Shanxing would return to his own city, drive out those who had committed evil deeds, and appoint Shanxing to succeed to his father’s throne.",
        "source": "T24n1450_015:0180a09_32"
    },
    {
        "source_sentence": "汝等苾芻，於汝意云何。",
        "translation": "What do you monks think?",
        "source": "T24n1450_015:0180a11_33"
    },
    {
        "source_sentence": "善行王子豈異人乎？",
        "translation": "Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is Is",
        "source": "T24n1450_015:0180a11_34"
    },
    {
        "source_sentence": "即我身是。",
        "translation": "That is, it's the self-body.",
        "source": "T24n1450_015:0180a12_35"
    },
    {
        "source_sentence": "其惡行者，今提婆達多是。",
        "translation": "That bad action is now Devadatta.",
        "source": "T24n1450_015:0180a12_36"
    },
    {
        "source_sentence": "非但今時無有報恩，往昔之時亦復如是。」",
        "translation": "Not only is there no repayment of kindness at the present time, but it's likewise in the past.",
        "source": "T24n1450_015:0180a13_37"
    },
    {
        "source_sentence": "根本說一切有部毘奈耶破僧事卷第十五",
        "translation": "Mūlasarvâstivāda-sūtra, Vinaya that breaks the saṃgha's business, vol. 15",
        "source": "T24n1450_015:0180a15_0"
    }
]