[
    {
        "source_sentence": "根本薩婆多部律攝卷第十一",
        "translation": "Mūlasarvâstivāda-vinaya, Volume 11",
        "source": "T24n1458_011:0586a16_0"
    },
    {
        "source_sentence": "尊者勝友集",
        "translation": "Venerable Vaiśeṣika's Assembly",
        "source": "T24n1458_011:0586a18_0"
    },
    {
        "source_sentence": "三藏法師義淨奉　制譯",
        "translation": "translated by the Tripiṭaka Master Yogâcārabhūmi in Sanskrit",
        "source": "T24n1458_011:0586a19_0"
    },
    {
        "source_sentence": "◎非時食學處第三十七",
        "translation": "The thirty-seventh place of training for eating at an ungodly hour",
        "source": "T24n1458_011:0586a20_0"
    },
    {
        "source_sentence": "爾時薄伽梵在室羅伐城給孤獨園，時十七眾苾芻遇緣斷食，便詣俗舍而行乞食。",
        "translation": "At the time, the Bhagavān was staying at Anāthapiṇḍada's Park in Śrāvastī, and when seventeen monks met a reason to cut off food, they went to a secular dwelling to solicit alms.",
        "source": "T24n1458_011:0586a21_0"
    },
    {
        "source_sentence": "既得食已，非時而噉。",
        "translation": "After he had obtained the food, he ate it at an ungodly hour.",
        "source": "T24n1458_011:0586a22_1"
    },
    {
        "source_sentence": "事惱同前，制斯學處。",
        "translation": "The matters and disturbances are the same as before, except for this place of training.",
        "source": "T24n1458_011:0586a23_2"
    },
    {
        "source_sentence": "「若復苾芻，非時食者，波逸底迦。」",
        "translation": "Again, if a monk eats at an ungodly hour, pratyekabuddha.",
        "source": "T24n1458_011:0586a24_0"
    },
    {
        "source_sentence": "言非時者，有二分齊：一、謂過午；",
        "translation": "When stating that it is not the right time, there are two parts:",
        "source": "T24n1458_011:0586a25_0"
    },
    {
        "source_sentence": "二、明相未出。",
        "translation": "Second, it explains that the characteristic has yet to emerge.",
        "source": "T24n1458_011:0586a25_1"
    },
    {
        "source_sentence": "言食者，謂是時藥、可噉嚼物。",
        "translation": "The expression food refers to the medicine that's available at the time and things that can be chewed.",
        "source": "T24n1458_011:0586a26_0"
    },
    {
        "source_sentence": "於非時作非時想疑，若噉咽時，便得墮罪，時非時想疑，得惡作罪。",
        "translation": "If someone doubts what's done at an unwholesome time and doesn't perceive what's not done at the right time, then they'll fall into a sin if they swallow it while swallowing it, and if they doubt what's done at the right time and wrong time, they'll be guilty of bad actions.",
        "source": "T24n1458_011:0586a26_1"
    },
    {
        "source_sentence": "時與非時作時想者，無犯。",
        "translation": "It's not a violation for someone who conceptualizes time at the right time and doesn't conceptualize time at the right time.",
        "source": "T24n1458_011:0586a28_2"
    },
    {
        "source_sentence": "若有病緣，醫人遣非時食麨、食肉者，應取牛糞中穀麥磨以為麨，與彼令食，犲糞中肉非時聽噉。",
        "translation": "If there are conditions for illness, the doctor sends someone who eats rice or meat at an ungodly hour to eat rice and meat, they should take grain and wheat from cow dung that's ground into milled rice and give it to them to eat, and the flesh from cow dung is not allowed to be eaten at an ungodly hour.",
        "source": "T24n1458_011:0586a28_3"
    },
    {
        "source_sentence": "若此等物病猶不差，要食好食方除疾者，可於屏處隨所須食而授與之。",
        "translation": "If these things are still not cured by illness, and they need to eat good food to remove the illness, they can be given away in a secluded place as much food as they need.",
        "source": "T24n1458_011:0586b01_4"
    },
    {
        "source_sentence": "贍部洲人向餘三洲及往天上，當依本處時量而食。",
        "translation": "The people of Jambudvīpa will go up to the other three continents and reach heaven. They will eat according to the time they live in their native land.",
        "source": "T24n1458_011:0586b03_5"
    },
    {
        "source_sentence": "「頗有無病苾芻在南贍部，非時食噉得無罪耶？」",
        "translation": "Could it be that there's a sick monk in southern Jambudvīpa who doesn't eat food at an ungodly hour and isn't guilty?",
        "source": "T24n1458_011:0586b04_6"
    },
    {
        "source_sentence": "「有，謂東西兩洲苾芻來此，依彼時分而食。」",
        "translation": "Yes, it means that monks from the two continents of east and west come here and eat according to their time.",
        "source": "T24n1458_011:0586b05_7"
    },
    {
        "source_sentence": "應知食時所有行法，若大眾多，於日時候難可知者，佛言：「食時欲至，先鳴健稚長打一通，更打三搥，總名三下。」",
        "translation": "You should know all the rules for practice at the time of food, whether large or small, that are difficult to know during the daytime, when the Buddha said, When he's about to eat, he first sounds a long beating bell and beats it once; then he beats three more bells, which are collectively called three blows.",
        "source": "T24n1458_011:0586b06_8"
    },
    {
        "source_sentence": "眾既聞已，各淨洗浴，及諸大眾共浴尊像。",
        "translation": "After the crowd heard this, they each cleansed their baths and all the other members of the assembly bathed the venerable image together.",
        "source": "T24n1458_011:0586b09_9"
    },
    {
        "source_sentence": "有病苾芻即應請食，授事苾芻亦聽先噉，次打三通更打三下，總名長打，大眾方食。",
        "translation": "A sick monk should then ask for food, and a consecrated monk who serves the monk also listens to the first beating. Next, he beats three times and then beats three times, which is generally called a long beating, and the masses then eat it.",
        "source": "T24n1458_011:0586b10_10"
    },
    {
        "source_sentence": "若聲小不聞，應打大鼓、或吹雙蠡。",
        "translation": "If the sound isn't heard by the small, he should beat a large drum or blow both bowls.",
        "source": "T24n1458_011:0586b12_11"
    },
    {
        "source_sentence": "凡讀經浴像及洗浴時，皆打三下。",
        "translation": "Whenever he reads the sūtras, bathes an image, and washes a bath, he beats it three times.",
        "source": "T24n1458_011:0586b12_12"
    },
    {
        "source_sentence": "打健稚法，復有五種：若常集眾者長打三通，大打三下。",
        "translation": "There are five more ways to beat a gandharva: if he always gathers the crowd, he'll be beaten three times for a long time and three times at the top of his head.",
        "source": "T24n1458_011:0586b13_13"
    },
    {
        "source_sentence": "若寺家營作長打三通，大打兩下。",
        "translation": "If a monk of the monastery strikes three blows for a long time, he hits two or more blows twice.",
        "source": "T24n1458_011:0586b15_0"
    },
    {
        "source_sentence": "若苾芻死長打一通，漸細便絕。",
        "translation": "If a monk dies, he'll be beaten for a long time and gradually lose his ability.",
        "source": "T24n1458_011:0586b15_1"
    },
    {
        "source_sentence": "若坐禪處應搖錫杖警覺。",
        "translation": "If he's sitting in meditation, he should shake his staff and alertly awaken.",
        "source": "T24n1458_011:0586b16_2"
    },
    {
        "source_sentence": "時眾若遭賊時，欲令人覺任打多少。",
        "translation": "When the crowd was attacked by thieves, they wanted to let them know how many times they'd been beaten.",
        "source": "T24n1458_011:0586b17_3"
    },
    {
        "source_sentence": "大眾集會行食難者，隨處分坐，於上座前各安飲食。",
        "translation": "When it's difficult for the masses to assemble and practice food, they sit separately wherever they are, placing food and drink in front of the superior seat.",
        "source": "T24n1458_011:0586b17_4"
    },
    {
        "source_sentence": "若恐行食不均平者，其撿挍人隨行觀察。",
        "translation": "If he's afraid his food and drink won't be evenly balanced, the person who picks it up will observe it as he walks.",
        "source": "T24n1458_011:0586b19_5"
    },
    {
        "source_sentence": "若行食人少撿挍，苾芻受取飲食應可共行，不得兩人同一盤食。",
        "translation": "If a practitioner eats, he or she collects food and drink for a little while, then the bhikṣu should be allowed to go along with him or her; they mustn't eat together in the same dining.",
        "source": "T24n1458_011:0586b20_6"
    },
    {
        "source_sentence": "若於行路無器可求，共食非犯、或共求寂同食亦聽。",
        "translation": "If there's no container to ask for on the path of travel, it's not a violation to eat together and drink together, or if they share the same food and seek quiescence together and listen as well.",
        "source": "T24n1458_011:0586b21_7"
    },
    {
        "source_sentence": "苾芻先受取食持器勿放，然後同食。",
        "translation": "The monks first accept the food and don't let it go; then they eat together.",
        "source": "T24n1458_011:0586b22_8"
    },
    {
        "source_sentence": "若有淨人須與食者，應遙擲與。",
        "translation": "If there are pure people who need to give food, they should toss it from a distance.",
        "source": "T24n1458_011:0586b23_9"
    },
    {
        "source_sentence": "若眷屬久離相遇，心喜欲同食者，屏處共食。",
        "translation": "If their retinues have been separated from each other for a long time and are delighted to share the same food, they'll eat together in a secluded place.",
        "source": "T24n1458_011:0586b24_10"
    },
    {
        "source_sentence": "准求寂法，苾芻唯著下裙、上無衣者，不應噉食。",
        "translation": "In accordance with the teaching of seeking quiescence, a monk who wears only a lower robe or a lower one without a robe shouldn't eat and drink.",
        "source": "T24n1458_011:0586b25_11"
    },
    {
        "source_sentence": "若病羸老，上著小僧脚崎、或貫偃帶，屏處而食。",
        "translation": "If he's sick and old, he puts his feet on a small monk's footstool or sits cross-legged to eat in a secluded place.",
        "source": "T24n1458_011:0586b26_12"
    },
    {
        "source_sentence": "若此亦不能著者，隨時將息，但著下裙屏處而食。",
        "translation": "If he can't touch it, he'll stop at any time and simply put his undergarment in a secluded place to eat.",
        "source": "T24n1458_011:0586b27_13"
    },
    {
        "source_sentence": "若金銀水精及琉璃器，並不應用。",
        "translation": "If gold, silver, water spirits, and lapis lazuli vessels aren't used, they won't be used.",
        "source": "T24n1458_011:0586b28_14"
    },
    {
        "source_sentence": "若在天龍藥叉所居之處，無器可求，隨意用食。",
        "translation": "If there's a place where gods, dragons, yakṣas, and yakṣas live, there's no container to ask for, so he uses food as he wishes.",
        "source": "T24n1458_011:0586b29_15"
    },
    {
        "source_sentence": "若食時眾人坐定，未唱時至不應行食，乃至一匕鹽亦不應受，受者得越法罪。",
        "translation": "If people sit in meditation when they eat and don't go to eat until the time before they sing it, or if they don't accept even a single dagger of salt, those who do so will be guilty of transgressing the law.",
        "source": "T24n1458_011:0586c01_16"
    },
    {
        "source_sentence": "若行食人不解者，上座教唱，上座若忘次座應教。",
        "translation": "If the practitioner doesn't understand it, the superior teaches to sing it, and if the superior forgets it, the next seat should teach it.",
        "source": "T24n1458_011:0586c03_17"
    },
    {
        "source_sentence": "噉食之時不應隨情輒索飲食，若火力微者得索熟果，若少壯者隨意取生，設有須索應小作聲。",
        "translation": "When he eats, he shouldn't ask for food or drink according to his feelings; if the fire is weak, he'll obtain ripened fruit; if he's small and strong, he'll take it as he wishes, and if there's a request, he'll make a little noise.",
        "source": "T24n1458_011:0586c04_18"
    },
    {
        "source_sentence": "食時踞坐好整威儀，不應顧視，當生厭想，住於正念，無掉亂心，然後方食。",
        "translation": "When he eats, he's seated and well-maintained in his manner, doesn't look around, becomes disillusioned with thoughts, abides in right mindfulness without agitation, and then eats.",
        "source": "T24n1458_011:0586c06_19"
    },
    {
        "source_sentence": "若異此者，得越法罪。",
        "translation": "If someone disobeys this, they'll be guilty of transgressing the law.",
        "source": "T24n1458_011:0586c08_20"
    },
    {
        "source_sentence": "若食了時所有餘食不應輒棄，應與父母等、若俗男女來乞食時，應自防心隨有而惠。",
        "translation": "If they finish eating, they shouldn't abandon the remaining food they have, and when they give it to their parents or laymen or women who come to solicit alms, they should guard their minds and give it to them accordingly.",
        "source": "T24n1458_011:0586c08_21"
    },
    {
        "source_sentence": "若傍生類應施一掬，安鉢草葉不應足蹈。",
        "translation": "If there are animals, you should give them a swallowing, and place bowls, grass, leaves, and so forth without walking on your feet.",
        "source": "T24n1458_011:0586c10_22"
    },
    {
        "source_sentence": "不脫鞋履亦不應食。",
        "translation": "They won't take off their shoes or footwear, and they won't eat.",
        "source": "T24n1458_011:0586c11_23"
    },
    {
        "source_sentence": "若是病人恐身有損，應踏皮革屣上。",
        "translation": "If this is a sick person who's afraid his body will be damaged, he should step on the leather sandals.",
        "source": "T24n1458_011:0586c12_24"
    },
    {
        "source_sentence": "若食脆鞕餅果不應作聲，應須潤濕。",
        "translation": "If he eats crispy cakes and fruits, he shouldn't make sounds, and he should moisten them.",
        "source": "T24n1458_011:0586c13_0"
    },
    {
        "source_sentence": "薄粥歠欱不得作聲。",
        "translation": "The thin gruel and millet won't make a sound.",
        "source": "T24n1458_011:0586c13_1"
    },
    {
        "source_sentence": "若蘿菔等擘破應食。",
        "translation": "If it's broken like a lotus root and so forth, they should eat it.",
        "source": "T24n1458_011:0586c14_2"
    },
    {
        "source_sentence": "若在俗家，上座食竟，洗漱既了，應復本座，為說施頌。",
        "translation": "If he's in a layman's home, the superior monk finishes his meal, and after washing and rinsing, he should return to his seat and speak a verse of generosity for him.",
        "source": "T24n1458_011:0586c14_3"
    },
    {
        "source_sentence": "說施頌時若聞聲者，即不應食；",
        "translation": "When the verse on giving is uttered, if someone hears the sound, they should not eat.",
        "source": "T24n1458_011:0586c16_0"
    },
    {
        "source_sentence": "若恐時過食亦無犯，或聽一兩伽他，然後更食。",
        "translation": "If you're afraid it won't be a violation if you eat too late at the time, or if you listen to one or two taels of food and then eat again.",
        "source": "T24n1458_011:0586c16_1"
    },
    {
        "source_sentence": "為上座者常應觀察上中下座，勿令怱遽食不飽足。",
        "translation": "Those who serve as superior should always observe the superior, middle, and inferior seats so that they don't eat quickly and aren't satisfied.",
        "source": "T24n1458_011:0586c17_2"
    },
    {
        "source_sentence": "若食了時取一掬食，以水澆之，隨意而棄，以施傍生。",
        "translation": "When he finishes eating, he takes a scoop of food, pours it with water, discards it as he wishes, and gives it to an unenlightened person.",
        "source": "T24n1458_011:0586c19_0"
    },
    {
        "source_sentence": "若有施主來請僧時，應先行籌知數方報，臨到食時更有客來、或於數內有人他行，應報施主。",
        "translation": "If there's a donor who comes to invite the saṃgha, he should first calculate the number of ways to reward him. When he arrives at the meal, if there are any other guests or people walking inside the number, he should report back to the donor.",
        "source": "T24n1458_011:0586c20_1"
    },
    {
        "source_sentence": "若臨食時欲出行者，應留待食有緣任去。",
        "translation": "If someone wants to travel when they're about to eat, they should leave and wait for food with conditions to allow them to leave.",
        "source": "T24n1458_011:0586c22_2"
    },
    {
        "source_sentence": "若多客來飲食少者，上座應令平等而與。",
        "translation": "If there are many guests who come with little food or drink, the superior monk should cause them to give it equally.",
        "source": "T24n1458_011:0586c23_3"
    },
    {
        "source_sentence": "若食多者，隨彼施主多少行之。",
        "translation": "If he eats a lot, he follows the donor's number of ways to do so.",
        "source": "T24n1458_011:0586c24_4"
    },
    {
        "source_sentence": "若大眾食了施頌復訖，應住少時觀望施主，若欲聞法應為宣說，若無心者隨意而去。",
        "translation": "If the large crowd finishes eating and then finishes reciting the verse, they should stay for a short time to look out for the donor, explain the teaching if they want to hear it, and go as they wish if they don't have the mind.",
        "source": "T24n1458_011:0586c25_0"
    },
    {
        "source_sentence": "苾芻食訖皆應誦念一兩伽他，報施主恩，亦不應發邪惡之願，為斷煩惱永解脫故。",
        "translation": "When a monk finishes his meal, he should recite one or two taels of it to repay the donor's kindness, and he shouldn't give rise to any bad or evil vow because he wants to end the afflictions and be permanently liberated.",
        "source": "T24n1458_011:0586c26_1"
    },
    {
        "source_sentence": "如上所說，不依行者，咸得惡作。",
        "translation": "As explained above, those who don't rely on practice will all attain bad actions.",
        "source": "T24n1458_011:0586c28_2"
    },
    {
        "source_sentence": "食曾觸食學處第三十八",
        "translation": "The Thirty-eighth Place of Study for Those Who Eat and Formerly Treat on Food",
        "source": "T24n1458_011:0587a01_0"
    },
    {
        "source_sentence": "佛在室羅伐城給孤獨園，時哥羅苾芻乞食而食，所有餘食遂即曝乾，風雨之時水漬而食。",
        "translation": "When the Buddha was staying at Anāthapiṇḍada's Park in Śrāvastī, the Kālāma bhikṣu begged for food and ate it, and all the rest of his food was then dried up and eaten by being submerged in water when it rained.",
        "source": "T24n1458_011:0587a02_0"
    },
    {
        "source_sentence": "事惱同前，制斯學處。",
        "translation": "The matters and disturbances are the same as before, except for this place of training.",
        "source": "T24n1458_011:0587a04_1"
    },
    {
        "source_sentence": "「若復苾芻，食曾經觸食者，波逸底迦。」",
        "translation": "Again, if a monk eats food and touches food, it's pratyekabuddha.",
        "source": "T24n1458_011:0587a04_2"
    },
    {
        "source_sentence": "曾經觸者，謂是自手先曾執捉、或留經夜擬自噉食。",
        "translation": "Someone who has touched it before means they've previously held it with their own hand or kept it for the night to prepare food for themselves.",
        "source": "T24n1458_011:0587a06_0"
    },
    {
        "source_sentence": "然曾經觸有其二種：一、謂中前從他受得齊日中時；",
        "translation": "However, there are two kinds of past contact:",
        "source": "T24n1458_011:0587a07_1"
    },
    {
        "source_sentence": "二、謂中後受得齊初夜時，過此限分若更食者，得波逸底迦。",
        "translation": "2. It means that when he receives the precepts at the beginning of the night after midnight and goes beyond this limit, if he eats again, he'll attain pratyekabuddha.",
        "source": "T24n1458_011:0587a08_2"
    },
    {
        "source_sentence": "若不受而觸齊時分內食者，得惡作罪，是名輒觸。",
        "translation": "If someone doesn't accept it and touches it while eating at the same time, they'll be guilty of committing a bad offense, which is called touching it lightly.",
        "source": "T24n1458_011:0587a09_3"
    },
    {
        "source_sentence": "若過時分又得曾觸，波逸底迦。",
        "translation": "If someone were to touch it again at a later time, pratyekabuddha.",
        "source": "T24n1458_011:0587a10_4"
    },
    {
        "source_sentence": "曾觸曾觸想疑，波逸底迦，次二句輕，後二無犯。",
        "translation": "The second two sentences are lighter, and the last two are not offenses if there's doubt about having touched or touched it, pratyekabuddha.",
        "source": "T24n1458_011:0587a11_5"
    },
    {
        "source_sentence": "若在北洲曾觸輒觸不受，並皆無犯，由彼於物無彼我心。",
        "translation": "If someone in the northern continent touches it and doesn't touch it, there's no offense, because they don't have that self or mind with respect to things.",
        "source": "T24n1458_011:0587a12_6"
    },
    {
        "source_sentence": "或於彼取向餘處者，亦無有犯。",
        "translation": "It's not a violation if someone takes it from that place and goes to another place.",
        "source": "T24n1458_011:0587a13_7"
    },
    {
        "source_sentence": "若苾芻於三處有曾觸過，謂由僧祇及由苾芻并授學人。",
        "translation": "If a monk has ever touched something in three places, it's because of the incalculable number of monks, the monk and the person who taught it to him.",
        "source": "T24n1458_011:0587a14_8"
    },
    {
        "source_sentence": "若苾芻尼於四處有曾觸過，謂式叉摩拏以為第四。",
        "translation": "If a bhikṣuṇī has ever touched anything in any of the four places, it's said that Śākyamuni is the fourth.",
        "source": "T24n1458_011:0587a15_9"
    },
    {
        "source_sentence": "望二種人無曾觸過：一、無羞恥人謂不畏罪；",
        "translation": "They look to two kinds of people who have never offended against them:",
        "source": "T24n1458_011:0587a17_10"
    },
    {
        "source_sentence": "二、有羞慚忘失正念。",
        "translation": "2. having shame and forgetfulness of right mindfulness.",
        "source": "T24n1458_011:0587a18_11"
    },
    {
        "source_sentence": "若於求寂等有希望心，持食與彼，欲至食時還有望心，得一惡作，食得墮罪。",
        "translation": "If someone has a hopeful intention to seek quiescence and so forth, and gives food to them while they're holding it, and if they have another hopeful intention when they want to eat it, they'll be guilty of committing one bad act, and they'll fall into the sin by eating it.",
        "source": "T24n1458_011:0587a18_12"
    },
    {
        "source_sentence": "有望心與、無望而食，但得惡作。",
        "translation": "They're expected to give food with hearts and hopelessly eat it, but they'll only get bad actions.",
        "source": "T24n1458_011:0587a20_13"
    },
    {
        "source_sentence": "無望而與、有望而食，唯得墮罪。",
        "translation": "If someone gives food without hope and eats with hope, they'll only be guilty of a sin.",
        "source": "T24n1458_011:0587a21_14"
    },
    {
        "source_sentence": "俱無希望，食之無犯。",
        "translation": "They both have no hope, and it's not a violation to eat them.",
        "source": "T24n1458_011:0587a21_15"
    },
    {
        "source_sentence": "若曾觸鉢匙、盞鉢帒、并支伐羅、水瓶、錫杖，乃至戶鑰相染觸物，及以觸口觸手而飲噉者，咸得墮罪。",
        "translation": "If someone has touched bowls, bowls, bowls, bowls, bowls, bowls, jugs, water bottles, pewter bowls, or even door keys that are stained by the characteristics of their touches, or if they touch them with their mouths and hands and drink from them, they'll all fall into sin.",
        "source": "T24n1458_011:0587a22_16"
    },
    {
        "source_sentence": "苾芻若欲飲水噉食，時與非時，皆須以水再三漱口方可飲噉，若不爾者，得惡作罪。",
        "translation": "If a monk wants to drink water and eat, he must rinse his mouth repeatedly with water before he can drink it; if he doesn't, he'll be guilty of a misdeed.",
        "source": "T24n1458_011:0587a24_17"
    },
    {
        "source_sentence": "若是病人無可得處，曾觸酥等食亦無罪。",
        "translation": "If this is a sick person who has no place to go, it's not a sin if he touches food like butter and so forth.",
        "source": "T24n1458_011:0587a26_18"
    },
    {
        "source_sentence": "瀉水乳時流注向下，承之以器與觸食相連，苾芻疑不敢食，佛言：「水等下流食之無犯。」",
        "translation": "When he pours water and milk down, the stream flows downward, carrying it in a container that's connected to touch and food, and the monk doubts it and doesn't dare to eat it; the Buddha says, It's not a violation to feed it downward with water or so.",
        "source": "T24n1458_011:0587a27_19"
    },
    {
        "source_sentence": "在路行時所有糧食，若求寂等力弱無堪不能持者，應以繩繫，令彼持繩，方為擎舉及以扶下，並皆無犯。",
        "translation": "It's not a violation to bind food and drink that's stored on the road if they seek quiescence or other powers that are weak and incapable of being held, tie them with a rope so that they can hold the rope and then lift it up or support it down for their sake.",
        "source": "T24n1458_011:0587a29_20"
    },
    {
        "source_sentence": "或令彼持繩，暫為擎食，令其憩息。",
        "translation": "Or they may cause them to carry a rope, lift food for a while, and cause them to take a rest.",
        "source": "T24n1458_011:0587b02_21"
    },
    {
        "source_sentence": "彼緣賊怖棄食逃走，可自持行無觸宿過。",
        "translation": "Because of the thief's fear, they abandon their food and run away, but they can carry it on their own without touching past actions.",
        "source": "T24n1458_011:0587b03_22"
    },
    {
        "source_sentence": "若越河澗無餘可求，亦遣持繩共擎而渡。",
        "translation": "If they cross a river or stream with nothing left to ask for, they'll also send their rope and carry it together to cross.",
        "source": "T24n1458_011:0587b04_23"
    },
    {
        "source_sentence": "若此兩人無方得濟，獨持而渡，此亦非犯。",
        "translation": "If these two people have no way to be relieved and cross alone, this is also not a violation.",
        "source": "T24n1458_011:0587b05_24"
    },
    {
        "source_sentence": "僧祇米穀以車運載，若車欲覆應共扶正。",
        "translation": "Incalculable rice and grains are carried by chariot, and if the chariot wants to cover it, they should be supported together.",
        "source": "T24n1458_011:0587b06_25"
    },
    {
        "source_sentence": "若病苾芻須乘此車者，應避軾邊。",
        "translation": "If a sick monk needs to ride this chariot, he should avoid the side of the pond.",
        "source": "T24n1458_011:0587b07_26"
    },
    {
        "source_sentence": "若乘船者應避柁處。",
        "translation": "If someone rides on a boat, they should avoid the place of sexual misconduct.",
        "source": "T24n1458_011:0587b07_27"
    },
    {
        "source_sentence": "曬穀米等有難緣來，若無人者應自收內。",
        "translation": "It's difficult to dry grain and rice for any reason, so if there's no one else, you should collect it yourself.",
        "source": "T24n1458_011:0587b08_28"
    },
    {
        "source_sentence": "若行險路無人可求，若有食糧應自持去，所到之處換易而食；",
        "translation": "If there is no one to be asked for food and provisions, they should carry their own food and provisions with them. Wherever they go, they exchange it for food and drink.",
        "source": "T24n1458_011:0587b09_29"
    },
    {
        "source_sentence": "必無換人，分為二分，持一惠彼未近圓人，持餘一分共易而食。",
        "translation": "There must be no exchange for someone, so it's divided into two parts, which are to maintain one benefit for someone who hasn't yet approached perfection and eat with the other part in common.",
        "source": "T24n1458_011:0587b10_30"
    },
    {
        "source_sentence": "此亦無者，應一日中斷食而行，至第二日食一虎拳，第三日中食二虎拳，第四日已去隨意飽食。",
        "translation": "On the second day, he ate one tiger's fist; on the third day, he ate two tiger's fist; and on the fourth day he ate as much food as he wished.",
        "source": "T24n1458_011:0587b12_31"
    },
    {
        "source_sentence": "若其糧食中途罄絕，見有飲食，無未近圓人可令授者，縱不作淨及以不受、或自上樹打果而食，並開無犯。",
        "translation": "If someone's food and provisions are exhausted halfway up the road, and they see that there's food and drink but don't have a person who doesn't yet approach the perfect person to give it to them, even if they don't do so purely or because they won't accept it, or if they eat from their own tree or fruit and open it without eating, it's not a violation.",
        "source": "T24n1458_011:0587b14_32"
    },
    {
        "source_sentence": "若僧伽鎗鑊內煎酥乳等，湧沸流溢無人可使，應自撓攪勿令棄失。",
        "translation": "If the saṃghâva cooks butter, milk, and so forth in a cauldron with no one to serve it, they should stir themselves up and not let it go.",
        "source": "T24n1458_011:0587b16_33"
    },
    {
        "source_sentence": "若苾芻曬曝藥等，難至無人，設自擎舉無觸宿罪。",
        "translation": "If a monk dries and exposes medicine, etc., but it's difficult to reach someone else, he or she lifts them up without touching their past sins.",
        "source": "T24n1458_011:0587b18_34"
    },
    {
        "source_sentence": "凡因難事所有開緣，至無難時皆不應作。",
        "translation": "Whenever there's a difficult thing that causes an opening condition, it shouldn't be done when there's no difficulty.",
        "source": "T24n1458_011:0587b19_35"
    },
    {
        "source_sentence": "若酥瓶等謂是煮染，瓶器誤觸著者無犯。",
        "translation": "If a bottle of butter or so forth is said to be cooked and dyed, and the container mistakenly touches it, it's not a violation.",
        "source": "T24n1458_011:0587b20_36"
    },
    {
        "source_sentence": "若錯持此瓶欲上閣者，若未半閣道應放置地，若行過半即應擎出。",
        "translation": "If someone mistakenly holds this vase and wants to go up the pavilion, they should place it on the ground if they don't reach halfway up the pavilion, or they should lift it out if they walk more than halfway.",
        "source": "T24n1458_011:0587b21_37"
    },
    {
        "source_sentence": "凡飲非時漿，先須洗手漱口令淨，然後飲之。",
        "translation": "Whenever he drinks the juice at an ungodly hour, he must first wash his hands and rinse his mouth to make it pure and then drink it.",
        "source": "T24n1458_011:0587b22_38"
    },
    {
        "source_sentence": "若異此者得惡作罪。",
        "translation": "If someone disobeys this, they'll be guilty of misdeeds.",
        "source": "T24n1458_011:0587b23_39"
    },
    {
        "source_sentence": "然於口中常含津觸，欲求極淨，此故無緣，應以澡豆及瞿摩等，和水揩脣周遍令淨，再三水漱，飲時非犯。",
        "translation": "However, it's not a violation for someone who always contains fluids in their mouth and wants to seek the ultimate purity, so without conditions, they should mix soap and ghee with water to wipe their lips all around to make them pure, rinse them again and again with water, which is not a violation when they drink it.",
        "source": "T24n1458_011:0587b24_40"
    },
    {
        "source_sentence": "若鉢中有隙者，應再三洗之而用。",
        "translation": "If there's a space in the bowl, you should wash it three times and use it.",
        "source": "T24n1458_011:0587b26_41"
    },
    {
        "source_sentence": "若盛熱食有膩浮上者無犯。",
        "translation": "If he puts on a hot food and has greasiness floating above him, it's not a violation.",
        "source": "T24n1458_011:0587b27_42"
    },
    {
        "source_sentence": "若鉢隙中有宿飯粒，應摘去之，水滌再三，設有餘津食皆無犯。",
        "translation": "If there's a grain of cooked rice in the space between the bowl, he should remove it, wash it three times with water, and give it to others for food without violating the rules.",
        "source": "T24n1458_011:0587b28_43"
    },
    {
        "source_sentence": "苾芻及尼各有觸宿，兩相換用者聽食。",
        "translation": "Monks and nuns each have a tactile constellation, and those who exchange their two characteristics listen and eat.",
        "source": "T24n1458_011:0587b29_44"
    },
    {
        "source_sentence": "若苾芻尼所有飲食，苾芻為舉作彼物心，尼將施時得食境想六句，准上應思。",
        "translation": "If a monk or nun gives food and drink to a monk or nun, the monk's mind is made up of those things, and when the nun gives it to him or her, he or she receives the food with six thoughts in six sentences, which should be considered according to the above.",
        "source": "T24n1458_011:0587c01_45"
    },
    {
        "source_sentence": "不受食學處第三十九",
        "translation": "thirty-nineth place of training that doesn't accept food",
        "source": "T24n1458_011:0587c04_0"
    },
    {
        "source_sentence": "佛在室羅伐城給孤獨園，時哥羅苾芻多住深摩舍那處，有諸俗人祠祭先靈，所有食飲自取而食。",
        "translation": "When the Buddha was staying at Anāthapiṇḍada's Park in Śrāvastī, Kālāma Bhikṣuṭa lived in a deep mocana place where there were secular people who sacrificed food and drink to their ancestors and took it for themselves.",
        "source": "T24n1458_011:0587c05_0"
    },
    {
        "source_sentence": "時俗譏謗云食人肉，惡聲流布，法眾慚恥。",
        "translation": "At the time, the people criticized him for saying that he ate human flesh and bad rumors spread in public, shameful to the Dharma community.",
        "source": "T24n1458_011:0587c07_1"
    },
    {
        "source_sentence": "世尊因制他授方食，既有授人堪為明證。",
        "translation": "The Bhagavān then instructed others to prescribe a prescription for food, and since he gave it to them, they were capable of clearly realizing it.",
        "source": "T24n1458_011:0587c08_2"
    },
    {
        "source_sentence": "是時六眾受與不受，並皆取食。",
        "translation": "The six groups of people then accepted and didn't accept it, and they all took food.",
        "source": "T24n1458_011:0587c09_3"
    },
    {
        "source_sentence": "事惱同前，制斯學處。",
        "translation": "The matters and disturbances are the same as before, except for this place of training.",
        "source": "T24n1458_011:0587c09_4"
    },
    {
        "source_sentence": "「若復苾芻，不受食舉著口中而噉咽者，除水及齒木，波逸底迦。」",
        "translation": "Again, if a monk doesn't accept food and puts it in his mouth and swallows it, except for water and teeth and wood, pratyekabuddha.",
        "source": "T24n1458_011:0587c11_0"
    },
    {
        "source_sentence": "不受者，謂不從授學人、苾芻尼、式叉摩拏、求寂男、求寂女并諸俗類而受得也。",
        "translation": "Someone who doesn't accept it means they don't receive it from the trainees, nuns, bhikṣuṇīs, Śākyamunis, men seeking quiescence, women seeking quiescence, and other secular types.",
        "source": "T24n1458_011:0587c13_0"
    },
    {
        "source_sentence": "若猨猴、熊羆有智知受非受者，此亦成受。",
        "translation": "If monkeys and bears with wisdom know what's received and what's not received, this is also accepted.",
        "source": "T24n1458_011:0587c14_1"
    },
    {
        "source_sentence": "受法有四：一、須作意；",
        "translation": "There are four ways to receive dharmas:",
        "source": "T24n1458_011:0587c15_2"
    },
    {
        "source_sentence": "二、有授人；",
        "translation": "The second is that there are those who preach.",
        "source": "T24n1458_011:0587c16_3"
    },
    {
        "source_sentence": "三、自手受；",
        "translation": "The third is to receive the precepts with one’s own hands.",
        "source": "T24n1458_011:0587c16_4"
    },
    {
        "source_sentence": "四、槃等置地手承一邊。",
        "translation": "4. Putting the Buddha's hand on the ground, he carries it to one side.",
        "source": "T24n1458_011:0587c16_5"
    },
    {
        "source_sentence": "復有五種：一、身授身受；",
        "translation": "Again, there are five kinds:",
        "source": "T24n1458_011:0587c17_6"
    },
    {
        "source_sentence": "二、物授身受；",
        "translation": "The second is the sensation of giving things to one’s body.",
        "source": "T24n1458_011:0587c17_7"
    },
    {
        "source_sentence": "三、身授物受；",
        "translation": "The third is bodily entrustment of things to be received.",
        "source": "T24n1458_011:0587c18_8"
    },
    {
        "source_sentence": "四、物授物受；",
        "translation": "The fourth is the giving of things to things and the receiving of things.",
        "source": "T24n1458_011:0587c18_9"
    },
    {
        "source_sentence": "五、置地受，謂有方國嫌惡苾芻，作曼荼羅置鉢於上，遙而指授遣置其中。",
        "translation": "5. placing it on the ground and accepting it means that there are disliked monks from different countries who make a maṇḍala, place his bowl on top of it, point at it from a distance, and send it to him.",
        "source": "T24n1458_011:0587c18_10"
    },
    {
        "source_sentence": "復有五種受法：一、仰手受；",
        "translation": "“Furthermore, there are five kinds of feeling:",
        "source": "T24n1458_011:0587c20_11"
    },
    {
        "source_sentence": "二、以床受；",
        "translation": "The second is to receive [the precepts] by means of a bed.",
        "source": "T24n1458_011:0587c20_12"
    },
    {
        "source_sentence": "三、木枯受；",
        "translation": "The third is the sensation of withered trees.",
        "source": "T24n1458_011:0587c21_13"
    },
    {
        "source_sentence": "四、衣角受；",
        "translation": "4. accepting [the precepts] by the horns of one’s robe.",
        "source": "T24n1458_011:0587c21_14"
    },
    {
        "source_sentence": "五、安鉢中受。",
        "translation": "5. place it in the bowl and accept it.",
        "source": "T24n1458_011:0587c21_15"
    },
    {
        "source_sentence": "有五種不成受，謂在界外、若遙遠處、若在傍邊、若在背後、或時合手，與此相違便成受法。",
        "translation": "There are five kinds that don't become sensations, which are received when they're outside the boundary, if they're distant, if they're nearby, if they're behind them, or if they join their hands at the time, and then they become sensations in ways that are at odds with this.",
        "source": "T24n1458_011:0587c22_16"
    },
    {
        "source_sentence": "時有施主持諸供食，列在眾前，本心擬施，家中火起棄食往救，無人授食，時將欲過。",
        "translation": "At the time, there was a donor who hosted the offerings and was listed in front of the crowd. He originally intended to give alms, but when the fire broke at his house he threw away food to be rescued, and no one gave him food because he was about to pass by.",
        "source": "T24n1458_011:0587c24_17"
    },
    {
        "source_sentence": "佛言：「應作北洲心自取而食。」",
        "translation": "The Buddha said, You should make a mind to take it yourself and eat it on the northern continent.",
        "source": "T24n1458_011:0587c25_18"
    },
    {
        "source_sentence": "若受得食，有不受食墮中，若有淨人更令其授，必無授者撥去食之。",
        "translation": "If someone receives food and obtains it, some people who don't accept food fall into it, and if a pure person causes them to give it again, there must be no donor who denies it and eats it.",
        "source": "T24n1458_011:0587c26_19"
    },
    {
        "source_sentence": "若汁墮中，多却方食。",
        "translation": "If the juice falls into it, they mostly eat it only when they remove it.",
        "source": "T24n1458_011:0587c28_20"
    },
    {
        "source_sentence": "若先受得，小兒來觸，更受方食。",
        "translation": "If he first receives it, the child comes to touch it and then eats it again.",
        "source": "T24n1458_011:0587c28_21"
    },
    {
        "source_sentence": "有五種塵：觸塵、非觸塵、淨塵、不淨塵及以微塵，若可了知，應須更受。",
        "translation": "There are five kinds of dust: contact dust, non-contact dust, clean dust, impure dust, and tiny dust; if they can be discerned, they should have to be felt again.",
        "source": "T24n1458_011:0587c29_22"
    },
    {
        "source_sentence": "復有五塵：飯、食、衣、花及以果塵，咸須受食。",
        "translation": "Again, there are five dust motes: rice, food, clothing, flowers, and fruits that all need to be eaten.",
        "source": "T24n1458_011:0588a01_23"
    },
    {
        "source_sentence": "凡欲受食先須用心，或置鉢中、或承以葉，遣令置此遂墮餘處，更受方食。",
        "translation": "Whenever he wants to accept food, he must first make an effort, put it in his bowl or carry a leaf, send it there, leave it here, and then fall into another place where he'll accept it.",
        "source": "T24n1458_011:0588a02_24"
    },
    {
        "source_sentence": "授食之人不閑軌則而放盤上，應更總受，亦不應自取持與淨人令授而食。",
        "translation": "If the person who gives food doesn't follow the rules and leaves it on the tray, he should accept it in a general way, and he shouldn't take it for himself or give it to a pure person to give it to eat.",
        "source": "T24n1458_011:0588a04_25"
    },
    {
        "source_sentence": "若是病人，無人可得，不受無犯。",
        "translation": "If this is a sick person, there's no one who can get it, and it's not a violation to accept it.",
        "source": "T24n1458_011:0588a06_26"
    },
    {
        "source_sentence": "凡看病人要須識知可不，方與病人食。",
        "translation": "Whenever he looks at a sick person, he must know whether it's good or not before he gives food to the patient.",
        "source": "T24n1458_011:0588a06_27"
    },
    {
        "source_sentence": "言噉咽者，謂在咽喉。",
        "translation": "When it's called swallowing, it means it's in the throat.",
        "source": "T24n1458_011:0588a07_28"
    },
    {
        "source_sentence": "又灌鼻時，先淨洗手從他受取，然後灌之；",
        "translation": "Also, when pouring water into the nose, they first wash their hands cleanly and receive it from another. They then pour water into them.",
        "source": "T24n1458_011:0588a08_29"
    },
    {
        "source_sentence": "由其入口，必吞咽故。",
        "translation": "It's because when he enters it, he must swallow it.",
        "source": "T24n1458_011:0588a09_30"
    },
    {
        "source_sentence": "除水及齒木者，水若渾濁鑒面不見，亦令他授。",
        "translation": "Except for water and teeth and wood, if the water is mixed with dirt and doesn't see his face, he also causes others to give it to him.",
        "source": "T24n1458_011:0588a09_31"
    },
    {
        "source_sentence": "然諸濁水應用蒱萄及蘡薁子、或以麨團內濁水中，水即澄清方堪飲用。",
        "translation": "However, if you use grapes, grapes, or rice plants or impure water inside a lump of rice, the water becomes clear and ready to drink.",
        "source": "T24n1458_011:0588a10_32"
    },
    {
        "source_sentence": "若醎水、鹻鹵水堪為鹽用，此皆須受。",
        "translation": "If saltwater and salty water are capable of being used as salt, they must all be accepted.",
        "source": "T24n1458_011:0588a12_33"
    },
    {
        "source_sentence": "若池河內有棄飯粒，取水濾用無犯。",
        "translation": "If there are discarded grains of rice in a pond or river, it's not a violation to take the water and filter it for use.",
        "source": "T24n1458_011:0588a13_34"
    },
    {
        "source_sentence": "若水中有油酪膩津上覆，應撓動濾用。",
        "translation": "If there's oil, cream, and grease in the water that covers the river, it should be twisted and filtered.",
        "source": "T24n1458_011:0588a14_35"
    },
    {
        "source_sentence": "若行路中見有轆轤汲水、或用酪瓶皮帒盛水，時及非時濾用無犯。",
        "translation": "It's not a violation if someone on the road sees a pot of water that's collected and drawn, or fills it with milk from a creamy pot or skin, and filters it at the right time or wrong time without violating the rules.",
        "source": "T24n1458_011:0588a15_36"
    },
    {
        "source_sentence": "後為難開，不應常用。",
        "translation": "The latter is difficult to disclose, so it shouldn't always be used.",
        "source": "T24n1458_011:0588a16_37"
    },
    {
        "source_sentence": "有五瓶瓨：謂盛大小便及貯酒器，此不應用，應遠棄之。",
        "translation": "There are five kinds of vases: the great defecation and the container for storing wine, which should be discarded far away if they aren't used.",
        "source": "T24n1458_011:0588a17_38"
    },
    {
        "source_sentence": "盛酥油瓶，火燒去膩，牛糞淨洗，時及非時咸皆得用、或池水中浸之令淨。",
        "translation": "When he fills a jar of ghee, the fire burns away its greasiness, and cow dung is washed clean at the right time or when it's not the right time to use it, or soaked in water from a pool to make it pure.",
        "source": "T24n1458_011:0588a18_39"
    },
    {
        "source_sentence": "若鉢中盛飯有鳥來啄，去[此\\/束]四邊，隨意而食，穢處螥蠅觸食非犯。",
        "translation": "It's not a violation if a bird comes to peck at food in the bowl and goes from [this\\/ bunch] four sides and eats as it wishes, or if defiled places are eaten by flies and gnats that touch food.",
        "source": "T24n1458_011:0588a20_40"
    },
    {
        "source_sentence": "諸盛水瓨應用甎木為蓋，勿令蟲入。",
        "translation": "The water poured into the pot is covered with a lid made of charcoal wood, so that no insects can enter.",
        "source": "T24n1458_011:0588a21_41"
    },
    {
        "source_sentence": "若淨水瓶傍口上穴，應用竹木蓋塞。",
        "translation": "If a pot of pure water is placed next to your mouth in a cave, use a bamboo or wooden lid to fill it.",
        "source": "T24n1458_011:0588a22_42"
    },
    {
        "source_sentence": "若瓶中水少，恐洗手不足，應用葉飲。",
        "translation": "If there's little water in the pot, he's afraid his hands won't be enough to wash them, so he uses leaves to drink.",
        "source": "T24n1458_011:0588a23_43"
    },
    {
        "source_sentence": "無人取葉用黃落葉，此若無者就連枝葉，或此亦無蹲踞一處，以瓶注口隨意飲之。",
        "translation": "If they don't have leaves and leaves, they spread them on a series of leaves, or if there's no one here who sits cross-legged in one place, he pours the bottle into his mouth and drinks it as he wishes.",
        "source": "T24n1458_011:0588a24_44"
    },
    {
        "source_sentence": "用齒木法事亦應知，謂於晨旦嚼用之時，得五種利：一、決除熱水；",
        "translation": "You should also know the ritual for using tooth wood, that is, when you chew and use it in the morning you will attain five kinds of benefits:",
        "source": "T24n1458_011:0588a25_45"
    },
    {
        "source_sentence": "二、能蠲冷癊；",
        "translation": "The second is that they are able to subdue the harmfulness of cold.",
        "source": "T24n1458_011:0588a27_46"
    },
    {
        "source_sentence": "三、令口清淨；",
        "translation": "The third is to purify their mouths.",
        "source": "T24n1458_011:0588a27_47"
    },
    {
        "source_sentence": "四、樂欲飲食；",
        "translation": "The fourth is the desire for food and drink.",
        "source": "T24n1458_011:0588a28_0"
    },
    {
        "source_sentence": "五、能明眼目。",
        "translation": "5. He's able to illuminate the eyes and eyes.",
        "source": "T24n1458_011:0588a28_1"
    },
    {
        "source_sentence": "齒木有三種：長者十二指、短者八指、二內名中。",
        "translation": "There are three kinds of tooth wood: twelve fingers for the elder, eight fingers for the shorter and two inner names.",
        "source": "T24n1458_011:0588a28_2"
    },
    {
        "source_sentence": "嚼用之時，先以澡豆土屑淨洗手已，次洗齒木，然後嚼之。",
        "translation": "When he chews it, he first cleans his hands with soap and dirt, then washes their teeth and wood, and then chews it.",
        "source": "T24n1458_011:0588a29_3"
    },
    {
        "source_sentence": "若嚼了已水洗方棄。",
        "translation": "If he has finished chewing it, wash it with water and then discard it.",
        "source": "T24n1458_011:0588b02_0"
    },
    {
        "source_sentence": "若乏水處，於沙土中揩已而棄。",
        "translation": "If there's no water, he rubs it into the sand and discards it after washing it.",
        "source": "T24n1458_011:0588b02_1"
    },
    {
        "source_sentence": "此由苾芻於前生中曾作毒蛇，嚼齒木時不洗而棄，有蟲附近中毒而死。",
        "translation": "It's because a monk once made a poisonous snake in a previous life that chews wood with its teeth and doesn't wash it away when he chews it, and a bug nearby poisons it and dies.",
        "source": "T24n1458_011:0588b03_2"
    },
    {
        "source_sentence": "因斯世尊制洗方棄。",
        "translation": "Because of this, the Bhagavān washed it and then discarded it.",
        "source": "T24n1458_011:0588b04_3"
    },
    {
        "source_sentence": "然棄齒木及洟唾等，應於屏處再三彈指謦咳，然後方棄。",
        "translation": "However, if you discard teeth, wood, mucus, saliva, and so forth, you should repeatedly snap your fingers and cough three times in the secluded place before you discard them.",
        "source": "T24n1458_011:0588b05_4"
    },
    {
        "source_sentence": "若常行處、若是淨地、若好樹邊、少在老前，咸非嚼處。",
        "translation": "If it's always walking, if it's a pure place, if it's near a good tree, or if it's young and in front of an old man, it's not a place to chew.",
        "source": "T24n1458_011:0588b06_5"
    },
    {
        "source_sentence": "有三種事應在屏處：謂大、小便及嚼齒木。",
        "translation": "There are three kinds of things that should be done in a secluded place: large, urinating and chewing tooth wood.",
        "source": "T24n1458_011:0588b07_6"
    },
    {
        "source_sentence": "若老病者畜承水器，此若無者，應臨水竇嚼頭寸許，令使柔軟，然後徐徐揩齒齗牙，悉使周遍。",
        "translation": "If an elderly or ill person is holding a water vessel, and if it doesn't have one, he should approach the water to chew his hair about an inch away so that it becomes soft and gentle, and then gradually rubbing his teeth, gums, and teeth all over it.",
        "source": "T24n1458_011:0588b08_7"
    },
    {
        "source_sentence": "次用刮舌箄屈而淨刮，勿令極利致使損傷。",
        "translation": "Next, he scrapes his tongue with a crooked and pure scrape so that it doesn't get extremely sharp and cause damage.",
        "source": "T24n1458_011:0588b11_0"
    },
    {
        "source_sentence": "應用竹木鍮石銅鐵，除諸寶物，餘皆聽作。",
        "translation": "He uses bamboo, wood, charcoal, stone, copper, and iron, except for the treasures, he'll be allowed to do anything else.",
        "source": "T24n1458_011:0588b12_0"
    },
    {
        "source_sentence": "若無箄者，應擘齒木為兩片已，更互相揩，准前應用。",
        "translation": "If there's no roughness, you should break the wood of your teeth into two pieces and rub them against each other, just as before.",
        "source": "T24n1458_011:0588b12_1"
    },
    {
        "source_sentence": "若卒無齒木，應用豆屑、或乾牛糞淨洗口脣，然後方食。",
        "translation": "If someone suddenly has no teeth or wood, they'll use beans, dust, dry cow dung, or excrement to cleanse their mouth and lips, and then they'll eat.",
        "source": "T24n1458_011:0588b14_2"
    },
    {
        "source_sentence": "若食了已事亦同然，乃至未將淨水洗漱口內，食津不應輒咽。",
        "translation": "If he has finished eating, the same thing happens, even if he doesn't wash his mouth with clean water and rinse it in his mouth, so he won't swallow it as soon as he eats.",
        "source": "T24n1458_011:0588b15_3"
    },
    {
        "source_sentence": "此中犯者，不受不受想或復生疑，咸得墮罪，次二句輕，後二無犯。",
        "translation": "In this case, an offender who doesn't experience feelings or perceive feelings or has doubts again will all fall into sin, and the next two sentences are lighter, while the last two are not a violation.",
        "source": "T24n1458_011:0588b16_4"
    },
    {
        "source_sentence": "若行食人少俗家酥蜜等瓶，如法受已，苾芻應行。",
        "translation": "If a practitioner eats a bottle of butter, honey, etc., from a layman's home and receives it in accordance with the teaching, the monk should do so.",
        "source": "T24n1458_011:0588b18_5"
    },
    {
        "source_sentence": "若僧家器物則不應觸。",
        "translation": "If there's a container at the saṃgha's house, then he shouldn't touch it.",
        "source": "T24n1458_011:0588b19_6"
    },
    {
        "source_sentence": "行餅果等所有筐籠，苾芻先受俗人後捉，如其欲放，苾芻在前俗人在後。",
        "translation": "When he walks around in a basket of cakes, fruits, and so forth, the monk first receives them from the layman and then takes them away, and if he wants to release them, the monk goes ahead and the layman follows behind him.",
        "source": "T24n1458_011:0588b20_7"
    },
    {
        "source_sentence": "苾芻行時先已成受，俗人與者是新受得。",
        "translation": "When a monk practices, he's already accepted it, and the layman who gives it to him is newly accepted.",
        "source": "T24n1458_011:0588b21_8"
    },
    {
        "source_sentence": "諸有雜果分為三色：謂上、中、下，行時間取勿使不平，放果盂中墮向餘處，齊手及處自取而食。",
        "translation": "Conditioned fruits are divided into three colors: upper, middle and lower. At the moment of going downward one takes them at the same time but does not let them fall unevenly. When throwing [the fruit] into a fruit-bottle, one goes to another place.",
        "source": "T24n1458_011:0588b22_9"
    },
    {
        "source_sentence": "此已成受，如若更遠重應受之。",
        "translation": "This has already been accepted, as if it were to be accepted even further away.",
        "source": "T24n1458_011:0588b24_10"
    },
    {
        "source_sentence": "索美食學處第四十",
        "translation": "The Forty-tenth Place of Cultivating Cultivation by Seeking Food",
        "source": "T24n1458_011:0588b26_0"
    },
    {
        "source_sentence": "佛在劫比羅伐窣覩國，時六眾苾芻受大名施主請，既至宅已，見其所設無堪食者，遂詣餘家求乞美膳，得乳酪等飽足食已，還至其舍更不能食，因生譏議。",
        "translation": "When the Buddha was staying in Kapilavastu, six monks were invited by the greatly renowned donor. Having arrived at their home, they saw that there was nothing to eat and went to another house to beg for a delicious meal. Having obtained enough milk and cheese, etc., to be fed, they returned to their dwelling but could no longer eat.",
        "source": "T24n1458_011:0588b27_0"
    },
    {
        "source_sentence": "事惱同前，制斯學處。",
        "translation": "The matters and disturbances are the same as before, except for this place of training.",
        "source": "T24n1458_011:0588c01_1"
    },
    {
        "source_sentence": "如世尊說：「上妙飲食乳酪生酥魚及肉，若苾芻無病為己詣他家乞，取食者，波逸底迦。」",
        "translation": "As the Bhagavān said, If a monk goes to another's house to solicit milk, cheese, raw butter, fish, or meat for his own sake without illness and takes it, pratyekabuddha.",
        "source": "T24n1458_011:0588c03_0"
    },
    {
        "source_sentence": "他家者，非親族也。",
        "translation": "Someone from another family is not a relative.",
        "source": "T24n1458_011:0588c05_0"
    },
    {
        "source_sentence": "乞者，他不先許。",
        "translation": "A beggar doesn't allow others to do so first.",
        "source": "T24n1458_011:0588c05_1"
    },
    {
        "source_sentence": "無病而乞無病而食，得波逸底迦及惡作罪。",
        "translation": "If someone begs without illness and eats without illness, they'll be guilty of the offense of pratyekabuddha and misdeeds.",
        "source": "T24n1458_011:0588c05_2"
    },
    {
        "source_sentence": "無病從乞有病而食，乞得小罪，食時無犯。",
        "translation": "If he's not sick and eats from begging for a little offense because he's sick, then it's not a violation to beg when he eats.",
        "source": "T24n1458_011:0588c06_3"
    },
    {
        "source_sentence": "有病從乞無病而食，乞時無犯，食得墮罪。",
        "translation": "If someone who's sick and begs to eat without illness, it's not a violation when they beg, and if they eat, they'll fall into sin.",
        "source": "T24n1458_011:0588c07_4"
    },
    {
        "source_sentence": "第四無犯。",
        "translation": "Fourth, there's no offense.",
        "source": "T24n1458_011:0588c08_5"
    },
    {
        "source_sentence": "若乞食時欲得餘物者，他持食與，報言：「姊妹！",
        "translation": "If someone wants to get something else when they're begging for food, another person will give it to them with food and report, Sister!",
        "source": "T24n1458_011:0588c08_6"
    },
    {
        "source_sentence": "我飯已足。」",
        "translation": "I've had enough to eat.",
        "source": "T24n1458_011:0588c09_7"
    },
    {
        "source_sentence": "若彼問言：「更何所須？」",
        "translation": "If they ask, What else is necessary?",
        "source": "T24n1458_011:0588c10_8"
    },
    {
        "source_sentence": "者，即便隨情所欲從乞者無犯。",
        "translation": "It's not a violation even if someone follows what they want and follows the beggar's request.",
        "source": "T24n1458_011:0588c10_9"
    },
    {
        "source_sentence": "若彼施主告苾芻曰：「有所須者隨意可索。」",
        "translation": "If the donor tells the monk, Whatever you need, ask as you like.",
        "source": "T24n1458_011:0588c11_10"
    },
    {
        "source_sentence": "或乞酪漿彼便施酪，或從天龍藥叉舍乞，皆無犯。",
        "translation": "It's not a violation if someone asks for some milk or cheese and then gives it to them, or if they ask from the gods, dragons, yakṣas, or nuns.",
        "source": "T24n1458_011:0588c12_11"
    },
    {
        "source_sentence": "　蟲水二食舍，　　無復往觀軍，",
        "translation": "The two food sheds of insects and water are no longer going to observe the army.",
        "source": "T24n1458_011:0588c13_12"
    },
    {
        "source_sentence": "　兩夜覿遊兵，　　打擬覆麁罪。",
        "translation": "For two nights, he waded and traveled to the army, beating a man who wanted to cover up his crimes.",
        "source": "T24n1458_011:0588c13_12"
    },
    {
        "source_sentence": "◎◎第五攝頌曰：受用有蟲水學處第四十一佛在憍閃毘國，時闡陀苾芻受用水時，害眾生命。",
        "translation": "The fifth gathering verse says, The forty-first Buddha was in Kauśinagara when the monk Cunda accepted water and harmed the lives of sentient beings.",
        "source": "T24n1458_011:0588c13_12"
    },
    {
        "source_sentence": "由用水事無悲煩惱，制斯學處。",
        "translation": "Because the water service is free from sorrow and affliction, it's a place of training that's limited.",
        "source": "T24n1458_011:0588c19_13"
    },
    {
        "source_sentence": "「若復苾芻，知水有蟲受用者，波逸底迦。」",
        "translation": "Again, if a monk knows that water has worms in it and accepts it, pratyekabuddha.",
        "source": "T24n1458_011:0588c20_0"
    },
    {
        "source_sentence": "言受用者，有二種受用：一、內受用，謂供身所須。",
        "translation": "When it comes to feelings and functions, there are two kinds of feelings and functions: 1. internal feelings and functions, which are needed by the offering body.",
        "source": "T24n1458_011:0588c21_0"
    },
    {
        "source_sentence": "二、外受用，謂洗衣鉢等。",
        "translation": "2. external enjoyment, which is the washing bowl and so forth.",
        "source": "T24n1458_011:0588c22_1"
    },
    {
        "source_sentence": "前之學處為營作故，局澆泥草；",
        "translation": "In the former monastery they poured mud and grass for construction purposes.",
        "source": "T24n1458_011:0588c22_2"
    },
    {
        "source_sentence": "今此通論隨何受用。",
        "translation": "Now, this is a general theory that follows what's experienced and used.",
        "source": "T24n1458_011:0588c23_3"
    },
    {
        "source_sentence": "若苾芻以貪瞋等心、或由忘念、或由渴乏，受由蟲水不問多少、或觀不觀有蟲無蟲，作有蟲想，心無慚恥而不濾漉，於瓶等中乃至飲一掬，便得墮罪。",
        "translation": "If a monk with such thoughts as greed and anger, or because of forgetfulness or thirst, receives insect water without asking for it, or observes that there are worms and no worms, creates the perception that there are worms, has no shame in his mind and doesn't filter it, then he'll fall into sin if he drinks a single scoop of water from a bottle or so forth",
        "source": "T24n1458_011:0588c23_4"
    },
    {
        "source_sentence": "有說：「隨以瓶等取水之時，若用盡者，方得墮罪。",
        "translation": "Some say, Suppose someone takes a pot of water or so forth and uses it to get water; if they run out of water, they'll fall into sin.",
        "source": "T24n1458_011:0588c27_5"
    },
    {
        "source_sentence": "若起心欲取，得責心惡作。",
        "translation": "If someone gives rise to the intention to take it, they'll be reprimanded for bad actions in their mind.",
        "source": "T24n1458_011:0588c28_6"
    },
    {
        "source_sentence": "已起方便，得對說惡作。」",
        "translation": "Having given rise to the skillful means, they'll be able to explain bad actions in response.",
        "source": "T24n1458_011:0588c28_7"
    },
    {
        "source_sentence": "諸墮罪處類此應知，始終忘觀亦得惡作，境想六句，四犯、二非犯。",
        "translation": "These should be known as the types of places where sins are committed, in which forgetfulness and contemplation at first and last also lead to bad actions, six sentences with objects and perceptions, four offenses, and two non-violations.",
        "source": "T24n1458_011:0588c29_8"
    },
    {
        "source_sentence": "有說：「於無蟲水作有蟲想，亦得墮罪。」",
        "translation": "Some say, If someone creates the perception of insects in water without insects, they'll also fall into sin.",
        "source": "T24n1458_011:0589a01_9"
    },
    {
        "source_sentence": "有五種眼不應觀水：一、患瘡眼；",
        "translation": "There are five kinds of eyes that should not look at water:",
        "source": "T24n1458_011:0589a02_10"
    },
    {
        "source_sentence": "二、睛翳眼；",
        "translation": "The second is the divine eye of insight.",
        "source": "T24n1458_011:0589a03_11"
    },
    {
        "source_sentence": "三、狂亂眼；",
        "translation": "The third is the eye of delusion.",
        "source": "T24n1458_011:0589a03_12"
    },
    {
        "source_sentence": "四、老病眼；",
        "translation": "4. the eye of old age and sickness;",
        "source": "T24n1458_011:0589a03_13"
    },
    {
        "source_sentence": "五、天眼。",
        "translation": "5. the divine eye.",
        "source": "T24n1458_011:0589a04_14"
    },
    {
        "source_sentence": "由彼天眼與人事不同故不許觀。",
        "translation": "Because their divine vision is different from that of humans, they won't allow contemplation.",
        "source": "T24n1458_011:0589a04_15"
    },
    {
        "source_sentence": "齊幾許時應觀其水？",
        "translation": "At how many moments should one contemplate the water?",
        "source": "T24n1458_011:0589a05_16"
    },
    {
        "source_sentence": "謂六牛竹車迴轉之頃、或心淨已來觀知無蟲，設不濾漉飲亦無犯。",
        "translation": "It's not a violation if the six oxen, bamboo carts, or chariots of cow turn and sometimes their minds are purified after observing that there are no insects, and it's not a violation if they aren't filtered and drunk.",
        "source": "T24n1458_011:0589a05_17"
    },
    {
        "source_sentence": "不觀不濾，咸不合用。",
        "translation": "They are neither observed nor filtered, and they don't fit together.",
        "source": "T24n1458_011:0589a07_18"
    },
    {
        "source_sentence": "應知濾物有其五種：一、謂方羅；",
        "translation": "You should know that there are five kinds of filtered things:",
        "source": "T24n1458_011:0589a07_19"
    },
    {
        "source_sentence": "二、謂法瓶；",
        "translation": "The second is the Dharma-bottle.",
        "source": "T24n1458_011:0589a08_20"
    },
    {
        "source_sentence": "三、君持迦；",
        "translation": "The third is that of the ruler and his retainers.",
        "source": "T24n1458_011:0589a08_21"
    },
    {
        "source_sentence": "四、酌水羅；",
        "translation": "The fourth is to offer water for drinking.",
        "source": "T24n1458_011:0589a08_22"
    },
    {
        "source_sentence": "五、謂衣角。",
        "translation": "5. It's called the horn of a garment.",
        "source": "T24n1458_011:0589a09_0"
    },
    {
        "source_sentence": "若苾芻無濾羅等，不應往餘村餘寺，齊三拘盧舍。",
        "translation": "If a monk doesn't have filters and so forth, he shouldn't go to other villages or other temples, which are equal to three krośas.",
        "source": "T24n1458_011:0589a09_1"
    },
    {
        "source_sentence": "若所到之處，知無闕乏，不持去者無犯，謂知彼僧祇恒有淨水。",
        "translation": "If he knows where he's arriving and doesn't lack it, it's not a violation if he doesn't carry it away, which is to say that he knows that there's always pure water in those incalculable eons.",
        "source": "T24n1458_011:0589a10_2"
    },
    {
        "source_sentence": "若於河井先知無蟲，若同行伴下至一人持羅而去，然共行時應問彼云：「羅共用不？",
        "translation": "If he first knows that there are no worms in the river well, and if he's accompanied by a companion, he goes down to one person with Rāhula and leaves, but when they're walking together, they should ask him, Does Rāhula use it together?",
        "source": "T24n1458_011:0589a11_3"
    },
    {
        "source_sentence": "或至別路、或爾迴還，能與我羅獨持去不？」",
        "translation": "Perhaps you'll go to another path or return, and will you give me Rāhula the opportunity to leave by myself?",
        "source": "T24n1458_011:0589a13_4"
    },
    {
        "source_sentence": "如其許者可共俱往；",
        "translation": "If they agree, they can go together.",
        "source": "T24n1458_011:0589a14_5"
    },
    {
        "source_sentence": "若不爾者，不應共去。",
        "translation": "If that's not the case, they shouldn't go together.",
        "source": "T24n1458_011:0589a15_6"
    },
    {
        "source_sentence": "若不問者，得惡作罪。",
        "translation": "If someone doesn't ask, they'll be guilty of misdeeds.",
        "source": "T24n1458_011:0589a15_7"
    },
    {
        "source_sentence": "若順河流齊五拘盧舍，若不流河齊三拘盧舍，雖無濾羅去亦無犯。",
        "translation": "If he follows the flow of the river and reaches five krośas, or if he doesn't go along with the flow of the river and reaches three krośas, it's not a violation even though there's no filtering away.",
        "source": "T24n1458_011:0589a16_8"
    },
    {
        "source_sentence": "若順河流，一度觀水無有蟲者，齊一拘盧舍，隨意飲用，然須中間無別河入。",
        "translation": "If someone follows the river and once observes water without any bugs, they'll equalize one krośa and drink it as they wish, but there won't be a separate river in between.",
        "source": "T24n1458_011:0589a17_9"
    },
    {
        "source_sentence": "若不流水及逆流水，一度觀時，齊一尋內得用。",
        "translation": "If there's water that doesn't flow and water that flows contrary to it, when he observes it once, he can use it within a single fathom.",
        "source": "T24n1458_011:0589a19_10"
    },
    {
        "source_sentence": "有五種淨水：一、僧伽淨；",
        "translation": "There are five kinds of pure water:",
        "source": "T24n1458_011:0589a20_11"
    },
    {
        "source_sentence": "二、別人淨；",
        "translation": "The second is the purity of others.",
        "source": "T24n1458_011:0589a20_12"
    },
    {
        "source_sentence": "三、濾羅淨；",
        "translation": "The third is the purity of filtering.",
        "source": "T24n1458_011:0589a21_13"
    },
    {
        "source_sentence": "四、湧泉淨；",
        "translation": "The fourth is the purity of springing up water.",
        "source": "T24n1458_011:0589a21_14"
    },
    {
        "source_sentence": "五、井水淨。",
        "translation": "5. The well's water is pure.",
        "source": "T24n1458_011:0589a21_15"
    },
    {
        "source_sentence": "若知彼人是持戒者，存護生命，縱不觀察，得彼水時飲用無犯。",
        "translation": "If someone knows they're a person who observes the precepts and protects their life, even if they don't observe them, it's not a violation to drink when they get that water.",
        "source": "T24n1458_011:0589a21_16"
    },
    {
        "source_sentence": "凡一觀水，始從日出迄至明相未出已來咸隨受用。",
        "translation": "Every one of them observes water, beginning with the sun rising up to the morning before it rises, and they all follow it.",
        "source": "T24n1458_011:0589a23_17"
    },
    {
        "source_sentence": "若取水時手捉濾羅久生勞倦，應用三股立拒羅繫兩邊。",
        "translation": "When he takes water, he grasps the filter with his hand for a long time and becomes tired, using three-pronged standing rejection to bind it around both sides.",
        "source": "T24n1458_011:0589a24_18"
    },
    {
        "source_sentence": "若水駃不停蟲多悶死，應於羅中安沙、若牛糞末承之令住。",
        "translation": "If a water hammer doesn't stop and many insects die in distress, he should place sand or cow dung in Rāhula and make them stay there.",
        "source": "T24n1458_011:0589a25_19"
    },
    {
        "source_sentence": "若作瓦椀銅椀緣穿三孔，各安繩鎖繫在三竿，其水羅角置之椀內，下以瓫器而承其水，瓨內觀蟲必須器滿。",
        "translation": "If he makes a brick bowl or copper bowl with three holes, each sets a rope and chain tied it to three poles, puts the horns of water inside the bowl, carries the water by means of a pot underneath, and looks inside to see that the container must be full.",
        "source": "T24n1458_011:0589a27_20"
    },
    {
        "source_sentence": "若觀水時蟲細難見，應草莛示勿以指示。",
        "translation": "If you observe water when the insects are subtle and difficult to see, you should show them with a blade of grass so that they won't tell you.",
        "source": "T24n1458_011:0589a29_21"
    },
    {
        "source_sentence": "取水既訖羅置椀中，若近河池就彼傾覆，必居原陸可放井中，不得懸虛羅翻井上，令蟲悶絕、或致損生。",
        "translation": "When he has finished taking the water, he puts it in his bowl. If he approaches a river or pond and drops it over it, he'll surely live on dry land and be allowed to place it in a well, but he won't be allowed to hang it up a well that doesn't have any space above it, which will cause the insects to faint and die or harm their life.",
        "source": "T24n1458_011:0589b01_22"
    },
    {
        "source_sentence": "應為放生器，作小罐子，上下各安兩鼻，繫以雙繩羅覆此中。",
        "translation": "You should make a small pot for the sake of releasing sentient beings and place two noses on top and bottom of each one, tied together with twin cords to cover them.",
        "source": "T24n1458_011:0589b03_23"
    },
    {
        "source_sentence": "淨水澆瀝慇懃觀察，知無蟲已正沈井內，翻底拔之再三縱沒，勿令蟲在羅，須淨洗曬曝令乾。",
        "translation": "He pours water into the well and observes that there are no worms, knows they're correctly submerged in the well, turns over the bottom and pulls them up again and again without letting the worms enter it, and requires to wash, dry, and make them dry.",
        "source": "T24n1458_011:0589b05_24"
    },
    {
        "source_sentence": "若羅易壞者，應以銅鐵瓦器底安花孔，闊三四指、高兩三指，以絹或疊繫之而用。",
        "translation": "If Luo's easy to break down, he should place a flower pore three or four fingers wide and two or three fingers high on the bottom of a copper-iron vessel, tied with silk or cotton cloth.",
        "source": "T24n1458_011:0589b07_25"
    },
    {
        "source_sentence": "若於寺中安僧伽水瓨，應在便處，并安木床、或為甎座，常須淨潔，時時應以茅草洗刷，勿令垢穢。",
        "translation": "If an saṃghâva is installed in a monastery, it should be placed in a stove or on a wooden bed or bamboo seat. It should always be clean and tidy; at the right time it should be washed and brushed with thatched grass so as not to get dirty.",
        "source": "T24n1458_011:0589b09_26"
    },
    {
        "source_sentence": "若有臭氣於陰處曬乾，若不淨手不應輒觸。",
        "translation": "If there's an odor and a dry smell in the aggregates, then if it's impure, his hand shouldn't touch it.",
        "source": "T24n1458_011:0589b11_27"
    },
    {
        "source_sentence": "若有飲緣須將去者、或銅瓦椀、或於葉內持去。",
        "translation": "If someone has a drinking condition and needs to leave it, or if they take a copper tile bowl or leave it inside a leaf.",
        "source": "T24n1458_011:0589b12_28"
    },
    {
        "source_sentence": "其行水人須著淨服，勿以宿觸衣裳觸其瓨器，諸小苾芻亦聽行水。",
        "translation": "Those who walk on water must wear clean clothes and don't touch their robes or clothing with a constellation to touch the pot, and the small monks will also listen to those who walk on water.",
        "source": "T24n1458_011:0589b13_29"
    },
    {
        "source_sentence": "若有俗家來借瓨器，應與故者不可與新；",
        "translation": "If a layman came and borrowed a jug, he should give it to the old man or not to the new one.",
        "source": "T24n1458_011:0589b15_30"
    },
    {
        "source_sentence": "苾芻借時隨意而與。",
        "translation": "When the monk borrows it, he gives it as he wishes.",
        "source": "T24n1458_011:0589b16_31"
    },
    {
        "source_sentence": "應以一房用貯器物，銅器若少應共處安。",
        "translation": "You should use one room to store the container's goods, and if there are few copper containers, you should place them together in a peaceful place.",
        "source": "T24n1458_011:0589b16_32"
    },
    {
        "source_sentence": "如其多者別置一庫(其放生罐，一繩亦得。",
        "translation": "If there are many of them, they'll be placed in a separate storehouse (the one that releases the growing pot with a single rope will also get it.",
        "source": "T24n1458_011:0589b17_33"
    },
    {
        "source_sentence": "承水之椀，或置羅中)。",
        "translation": "A bowl that carries water or puts it in a tray.)",
        "source": "T24n1458_011:0589b18_34"
    },
    {
        "source_sentence": "有食家強坐學處第四十二",
        "translation": "The forty-second place of training where there's a food eater who sits forcibly and trains.",
        "source": "T24n1458_011:0589b19_0"
    },
    {
        "source_sentence": "佛在室羅伐城給孤獨園，時鄔陀夷善解逆相預識人情，知彼男女欲行非法，即為女說法共相惱亂，由詣俗家事及婬煩惱，制斯學處。",
        "translation": "When the Buddha was staying at Anāthapiṇḍada's Park in Śrāvastī, Udayana well understood the feelings of people who were hostile to each other and knew that men and women who wanted to do what wasn't forbidden, so he taught the Dharma for women and shared the disturbance with them, regulating the place of training by going to secular household affairs and sexual afflictions and anger.",
        "source": "T24n1458_011:0589b20_0"
    },
    {
        "source_sentence": "「若復苾芻，知有食家強安坐者，波逸底迦。」",
        "translation": "Again, if a monk knows that there's a foodist who forcibly sits at home, pratyekabuddha.",
        "source": "T24n1458_011:0589b24_0"
    },
    {
        "source_sentence": "言知者，識彼人心欲行交會。",
        "translation": "The expression knowing refers to the exchange of consciousnesses that are associated with desire and volition in those minds.",
        "source": "T24n1458_011:0589b25_0"
    },
    {
        "source_sentence": "有食家者，女是男之食、男是女之食，謂男女行交會時更相受用，故名有食。",
        "translation": "A householder who has food means that women are food for men and men are food for women. That is to say, when men and women engage in sexual intercourse, they experience each other's food; therefore, it's called having food.",
        "source": "T24n1458_011:0589b25_1"
    },
    {
        "source_sentence": "強安坐者，不問舍主自縱己心，故云強坐。",
        "translation": "Someone who sits forcibly doesn't ask the owner of the dwelling to control his own mind, so he's called sitting forcibly.",
        "source": "T24n1458_011:0589b27_2"
    },
    {
        "source_sentence": "此中犯者，謂彼男女各有婬心契合，此時欲行交會，苾芻染心強為說法，以妨其事令他瞋恨。",
        "translation": "Here, the offense here is that when men and women each have a disputed mind and are united, they want to engage in sexual intercourse at the right time, and a monk with a defiled mind forcibly explains the teaching so that it will prevent them from doing so and cause others to become angry.",
        "source": "T24n1458_011:0589b28_3"
    },
    {
        "source_sentence": "在座坐時，便得墮罪。",
        "translation": "When he's sitting in his seat, he'll fall into sin.",
        "source": "T24n1458_011:0589c01_4"
    },
    {
        "source_sentence": "有食有食想六句同前。",
        "translation": "The six phrases with food and perception of food are the same as the previous one.",
        "source": "T24n1458_011:0589c01_5"
    },
    {
        "source_sentence": "若天女及半稚迦等，咸得惡作。",
        "translation": "If goddesses and half a thousand other goddesses do bad actions, they'll all attain bad actions.",
        "source": "T24n1458_011:0589c02_6"
    },
    {
        "source_sentence": "為賊所逐避難潛形，無婬染心者無犯。",
        "translation": "It's not a violation if someone is driven away by thieves and takes refuge in latent form without anger or defiled mind.",
        "source": "T24n1458_011:0589c03_7"
    },
    {
        "source_sentence": "有食家強立學處第四十三",
        "translation": "The forty-third place of training established by a householder who eats",
        "source": "T24n1458_011:0589c05_0"
    },
    {
        "source_sentence": "佛在室羅伐城給孤獨園，鄔陀夷苾芻前入俗舍，居門扇後自隱其身，觀行惡法，彼人知已遂便譏罵。",
        "translation": "When the Buddha was staying at Anāthapiṇḍada’s Park in the city of Śrāvastī, the bhikṣu Udayana entered a secular monastery in front of the bhikṣu Udāyin and lived behind a door or fan to hide himself. Observing that he was engaged in evil deeds, the bhikṣu ridiculed him.",
        "source": "T24n1458_011:0589c06_0"
    },
    {
        "source_sentence": "事惱同前，制斯學處。",
        "translation": "The matters and disturbances are the same as before, except for this place of training.",
        "source": "T24n1458_011:0589c08_1"
    },
    {
        "source_sentence": "「若復苾芻，知有食家，在屏處強立者，波逸底迦。」",
        "translation": "Again, if a monk knows there's a food house and stands forcibly in a secluded place, pratyekabuddha.",
        "source": "T24n1458_011:0589c09_0"
    },
    {
        "source_sentence": "言屏處者，謂唯有二人。",
        "translation": "The term'secluded place' means that there are only two people.",
        "source": "T24n1458_011:0589c11_0"
    },
    {
        "source_sentence": "前隨屏露，以坐為儀；",
        "translation": "In front of them, they followed the seclusion and took their seats as their manner.",
        "source": "T24n1458_011:0589c11_1"
    },
    {
        "source_sentence": "此但據屏，以立為事，乃至少時即得本罪。",
        "translation": "This is simply based on the principle of seclusion, which is established as a matter, and it's possible to attain the original offense for a little while.",
        "source": "T24n1458_011:0589c12_0"
    },
    {
        "source_sentence": "若有難緣，同前非犯。",
        "translation": "If there are difficult conditions, it's the same as the previous non-violation.",
        "source": "T24n1458_011:0589c12_1"
    },
    {
        "source_sentence": "與無衣外道男女食學處第四十四",
        "translation": "and the forty-fourth place where men and women of non-robed non-Buddhist schools eat and train.",
        "source": "T24n1458_011:0589c14_0"
    },
    {
        "source_sentence": "佛在室羅伐城給孤獨園，時阿難陀苾芻飯食已訖，即以殘食與二無衣女人。",
        "translation": "When the Buddha was staying at Anāthapiṇḍada's Park in Śrāvastī, the monk Ānanda finished his meal and gave some leftover food to two women without robes.",
        "source": "T24n1458_011:0589c15_0"
    },
    {
        "source_sentence": "彼之二女：一老、一少，不審觀察，老與一餅、少者與二。",
        "translation": "The two women, one old and one young, didn't examine it carefully, and the old gave one cake and the young gave two.",
        "source": "T24n1458_011:0589c16_1"
    },
    {
        "source_sentence": "老母語少者言：「彼與二餅意有所求，汝宜備辦。」",
        "translation": "The old mother said to the young man, They have something to ask for with these two cakes, so you should prepare them.",
        "source": "T24n1458_011:0589c17_2"
    },
    {
        "source_sentence": "由外道事譏嫌待緣煩惱，制斯學處。",
        "translation": "Because non-Buddhist practitioners criticize the afflictions that are conditioned by resentment, they regulate this place of training.",
        "source": "T24n1458_011:0589c19_3"
    },
    {
        "source_sentence": "「若復苾芻，自手授與無衣外道，及餘外道男女食者，波逸底迦。」",
        "translation": "Again, if a monk gives food with his own hand to a non-Buddhist who doesn't wear robes and other non-Buddhist men and women who eat it, pratyekabuddha.",
        "source": "T24n1458_011:0589c20_0"
    },
    {
        "source_sentence": "言無衣者，謂露形外道。",
        "translation": "The expression 'without robes' means a non-Buddhist who shows his form.",
        "source": "T24n1458_011:0589c22_0"
    },
    {
        "source_sentence": "言及餘外道者，總收餘類。",
        "translation": "The expression and the other non-Buddhist refers generally to the other kinds.",
        "source": "T24n1458_011:0589c22_1"
    },
    {
        "source_sentence": "自手與者，謂親自手決心施與。",
        "translation": "Giving with one's own hand means giving with one's own hand and the intention to give it.",
        "source": "T24n1458_011:0589c23_2"
    },
    {
        "source_sentence": "此中犯者，謂是露形等外道男女。",
        "translation": "A transgressor here is a non-Buddhist man or woman, such as an open-minded one.",
        "source": "T24n1458_011:0589c23_3"
    },
    {
        "source_sentence": "受者現前，苾芻授與、或墮手內、或落器中者，波逸底迦。",
        "translation": "If the recipient is present, and the monk gives it to him or drops it into his hand or into a container, pratyekabuddha.",
        "source": "T24n1458_011:0589c24_4"
    },
    {
        "source_sentence": "若未墮時，得惡作罪，由自手與彼生憍慢無羞慚故。",
        "translation": "If someone commits a misdeed when they haven't yet fallen, it's because they give it to them with their own hands and become conceited and lacking shame.",
        "source": "T24n1458_011:0589c25_5"
    },
    {
        "source_sentence": "若不現前、或時棄地，先出其分、後方食者，咸得惡作。",
        "translation": "If someone doesn't show it, or sometimes abandons the ground, and first produces a part of it and then eats it, they'll all get bad actions.",
        "source": "T24n1458_011:0589c27_6"
    },
    {
        "source_sentence": "境想六句如上應知。",
        "translation": "The six sentences on objects and perceptions should be understood as above.",
        "source": "T24n1458_011:0589c28_7"
    },
    {
        "source_sentence": "若宗親、若病苦，與時無犯。",
        "translation": "It's not a violation if someone's relatives or illness is painful, and it's not a violation when they share it with them.",
        "source": "T24n1458_011:0589c28_8"
    },
    {
        "source_sentence": "若欲出家與其共住，如廣文說。",
        "translation": "If you want to leave home and live together with them, as explained in detail.",
        "source": "T24n1458_011:0589c29_9"
    },
    {
        "source_sentence": "觀軍學處第四十五",
        "translation": "The Forty-fifth Place of Study for Contemplation of the Armed forces",
        "source": "T24n1458_011:0590a02_0"
    },
    {
        "source_sentence": "佛在室羅伐城給孤獨園，時勝光王嚴整軍旅，將欲征討。",
        "translation": "When the Buddha was staying at Anāthapiṇḍada Park in Śrāvastī, King Prabhākaramitra arranged his troops and intended to invade.",
        "source": "T24n1458_011:0590a03_0"
    },
    {
        "source_sentence": "時六眾苾芻輒往觀察。",
        "translation": "The six monks then quickly went there to examine it.",
        "source": "T24n1458_011:0590a04_1"
    },
    {
        "source_sentence": "由觀軍事不寂靜煩惱，制斯學處。",
        "translation": "Because they observe the military and nonquiescent afflictions, they regulate this place of training.",
        "source": "T24n1458_011:0590a04_2"
    },
    {
        "source_sentence": "「若復苾芻，往觀整裝軍者，波逸底迦。」",
        "translation": "If another monk goes to observe the army of well-armed soldiers, pratyekabuddha.",
        "source": "T24n1458_011:0590a06_0"
    },
    {
        "source_sentence": "言整裝軍者，欲將戰鬪。",
        "translation": "When it's called a well-armed army, it's because they want to fight.",
        "source": "T24n1458_011:0590a07_0"
    },
    {
        "source_sentence": "軍有四種：謂象、馬、車、步。",
        "translation": "There are four kinds of armies: elephant, horse, chariot, and infantry.",
        "source": "T24n1458_011:0590a07_1"
    },
    {
        "source_sentence": "此中犯者，去寺不遠有大軍眾，嚴整師旅欲挍兵旗，苾芻往觀。",
        "translation": "Among the offenders here, not far from the monastery, there's a large army of monks who are dressed in formation and want to raise an army banner, and the monks go to observe it.",
        "source": "T24n1458_011:0590a08_2"
    },
    {
        "source_sentence": "假使不挍為挍而觀，初見之時，便得墮罪。",
        "translation": "If someone doesn't contemplate anger as anger, then when they first see it, they'll fall into sin.",
        "source": "T24n1458_011:0590a09_3"
    },
    {
        "source_sentence": "設方便時，得多惡作。",
        "translation": "When he sets up a method, there are so many bad actions.",
        "source": "T24n1458_011:0590a10_4"
    },
    {
        "source_sentence": "若觀天龍、阿蘇羅等軍，亦得惡作。",
        "translation": "If he observes the armies of gods, dragons, asuras, and so forth, he'll also get bad actions.",
        "source": "T24n1458_011:0590a10_5"
    },
    {
        "source_sentence": "乃至故心觀鶉等鬪，並惡作罪，境想同前。",
        "translation": "It's because the mind observes such fights as quails and so forth, which are both bad actions and crimes, and its objects and perceptions are the same as the previous one.",
        "source": "T24n1458_011:0590a11_6"
    },
    {
        "source_sentence": "不犯者，若賊軍欲至，須往觀望知其遠近；",
        "translation": "Those who don’t violate the precepts have to go and observe if bandits are about to arrive, knowing their distance and proximity.",
        "source": "T24n1458_011:0590a12_7"
    },
    {
        "source_sentence": "若乞食遇見、若軍營近路、若軍來寺中、若有難緣，縱觀無犯。",
        "translation": "If he meets someone who's begging for food, if an army is on the road nearby, if an army comes to a temple, or if there are difficult circumstances, it's not a violation even if he observes them.",
        "source": "T24n1458_011:0590a13_8"
    },
    {
        "source_sentence": "軍中過二宿學處第四十六",
        "translation": "The forty-sixth place of training in the army, past the two lunar stations",
        "source": "T24n1458_011:0590a15_0"
    },
    {
        "source_sentence": "佛在室羅伐城給孤獨園，時勝光王勅命軍旅，六眾見已遂久停留。",
        "translation": "When the Buddha was staying at Anāthapiṇḍada's Park in Śrāvastī, King Prabhākaram Indra then ordered his army to leave. Seeing this, the sixfold assembly stayed there for a long time.",
        "source": "T24n1458_011:0590a16_0"
    },
    {
        "source_sentence": "事惱同前，制斯學處。",
        "translation": "The matters and disturbances are the same as before, except for this place of training.",
        "source": "T24n1458_011:0590a17_1"
    },
    {
        "source_sentence": "「若復苾芻，有因緣往軍中，應齊二夜。",
        "translation": "“Suppose another monk has a reason to go to the army for two nights at once.",
        "source": "T24n1458_011:0590a19_0"
    },
    {
        "source_sentence": "若過宿者，波逸底迦。」",
        "translation": "If he goes beyond the past, it's pratyekabuddha.",
        "source": "T24n1458_011:0590a19_1"
    },
    {
        "source_sentence": "此中犯者，相去不遠，有整兵軍，苾芻有緣受請詣彼、或有衣利引起貪心。",
        "translation": "The offenders here are not far from each other, and there's a well-armed army of monks who have conditions to accept an invitation to go there, or they may have clothing and benefits that cause them to become greedy.",
        "source": "T24n1458_011:0590a21_0"
    },
    {
        "source_sentence": "而彼軍營或整不整，作整兵心停留觀察，至第三夜明相出時，便得墮罪。",
        "translation": "That army may be orderly or not orderly, but if they make a correct effort to keep their minds together and observe it until the third watch of the night comes out at dawn, they'll fall into sin.",
        "source": "T24n1458_011:0590a22_1"
    },
    {
        "source_sentence": "設方便時，亦多惡作。",
        "translation": "When setting up a method, there are also many bad deeds.",
        "source": "T24n1458_011:0590a24_2"
    },
    {
        "source_sentence": "不犯者，若為王等之所拘礙，若餘難事者無犯。",
        "translation": "A person who doesn't violate the precepts is not offended if he's hindered by the king and so forth, or if he has other difficulties.",
        "source": "T24n1458_011:0590a24_3"
    },
    {
        "source_sentence": "動亂兵軍學處第四十七",
        "translation": "The Forty-seventh Place of Study for the Disturbed Armed Forces",
        "source": "T24n1458_011:0590a26_0"
    },
    {
        "source_sentence": "佛在室羅伐城給孤獨園，時六眾苾芻詣整兵軍所，動亂兵戈象馬逃奔，令軍慴怖。",
        "translation": "When the Buddha was staying at Anāthapiṇḍada's Park near the city of Śrāvastī, six monks went to gather an army of monks and disturbed their troops with spears, elephants, horses, and fled, causing the army to become frightened.",
        "source": "T24n1458_011:0590a27_0"
    },
    {
        "source_sentence": "事惱同前，制斯學處。",
        "translation": "The matters and disturbances are the same as before, except for this place of training.",
        "source": "T24n1458_011:0590a28_1"
    },
    {
        "source_sentence": "「若復苾芻，在軍中經二宿，觀整裝軍、見先旗兵、若看布陣者，波逸底迦。」",
        "translation": "If another monk spends two nights in an army and observes a well-armored army, sees the first banner or soldier, or looks at someone who spreads out a formation, it's pratyekabuddha.",
        "source": "T24n1458_011:0590b01_0"
    },
    {
        "source_sentence": "言整裝軍者，謂是裝束臨將戰時。",
        "translation": "This is called a well-armored army because it's the time when he's dressed and approaching battle.",
        "source": "T24n1458_011:0590b03_0"
    },
    {
        "source_sentence": "言先旗者，四種旗中見先引者。",
        "translation": "It's called the first flag because it's the first to be cited in the four kinds of flags.",
        "source": "T24n1458_011:0590b03_1"
    },
    {
        "source_sentence": "何謂四旗？",
        "translation": "What are the four kinds of flags?",
        "source": "T24n1458_011:0590b04_2"
    },
    {
        "source_sentence": "一、師子旗；",
        "translation": "The first is the lion’s banner.",
        "source": "T24n1458_011:0590b04_3"
    },
    {
        "source_sentence": "二、大牛旗；",
        "translation": "The second is the great ox- Banner.",
        "source": "T24n1458_011:0590b05_0"
    },
    {
        "source_sentence": "三、鯨魚旗；",
        "translation": "The third is the banner of whales and fish.",
        "source": "T24n1458_011:0590b05_1"
    },
    {
        "source_sentence": "四、金翅鳥旗。",
        "translation": "4. the banner of the garuḍa bird.",
        "source": "T24n1458_011:0590b05_2"
    },
    {
        "source_sentence": "兵者，四種兵中見首出者。",
        "translation": "A soldier is someone who sees the first of the four kinds of soldiers coming out.",
        "source": "T24n1458_011:0590b05_3"
    },
    {
        "source_sentence": "言布陣者，陣有四種：一、矟刀勢；",
        "translation": "When it comes to formation of formations, there are four kinds:",
        "source": "T24n1458_011:0590b06_4"
    },
    {
        "source_sentence": "二、車轅勢；",
        "translation": "The second is the momentum of the cartriage.",
        "source": "T24n1458_011:0590b07_5"
    },
    {
        "source_sentence": "三、半月勢；",
        "translation": "The third is the half-moon phase.",
        "source": "T24n1458_011:0590b07_6"
    },
    {
        "source_sentence": "四、鵬翼勢。",
        "translation": "4. the gesture of a phoenix's wing...",
        "source": "T24n1458_011:0590b07_7"
    },
    {
        "source_sentence": "言散兵者，除前所引餘雜兵戎。",
        "translation": "The expression dispersal of troops means to remove the remaining mixed armies and battles that were cited earlier.",
        "source": "T24n1458_011:0590b07_8"
    },
    {
        "source_sentence": "此中犯者，觀已整軍，即得墮罪。",
        "translation": "If someone here commits this offense, they'll be disciplined by observing the whole army and then fall into sin.",
        "source": "T24n1458_011:0590b08_9"
    },
    {
        "source_sentence": "若未整軍，得惡作罪。",
        "translation": "If someone doesn't prepare an army, they'll be guilty of misdeeds.",
        "source": "T24n1458_011:0590b09_10"
    },
    {
        "source_sentence": "若觀整軍乃至散兵者，俱得墮罪。",
        "translation": "If someone observes the formation of an army or even the dispersal of an army, they'll all fall into sin.",
        "source": "T24n1458_011:0590b09_11"
    },
    {
        "source_sentence": "餘並同前，難緣非犯。",
        "translation": "The rest are the same as the previous ones. It is not a transgression for someone who has difficulty with regard to conditions.",
        "source": "T24n1458_011:0590b10_12"
    },
    {
        "source_sentence": "打苾芻學處第四十八",
        "translation": "The Forty-eighth Place of Study for Upāsaka Bhikṣu",
        "source": "T24n1458_011:0590b11_0"
    },
    {
        "source_sentence": "佛在室羅伐城給孤獨園，時鄔陀夷因十七眾不隨其命，遂便打之。",
        "translation": "When the Buddha was staying at Anāthapiṇḍada's Park in Śrāvastī, Udayana didn't follow his life because of the seventeen people there, so he beat him.",
        "source": "T24n1458_011:0590b12_0"
    },
    {
        "source_sentence": "由結伴事不忍煩惱，制斯學處。",
        "translation": "It is a place of training because it does not tolerate the defilements by means of its associates.",
        "source": "T24n1458_011:0590b13_1"
    },
    {
        "source_sentence": "「若復苾芻，瞋恚故不喜打苾芻者，波逸底迦。」",
        "translation": "Again, if a monk is angry and doesn't like to beat a monk because he's angry, pratyekabuddha.",
        "source": "T24n1458_011:0590b15_0"
    },
    {
        "source_sentence": "言打者，若手指彈、若脚指蹴、若甎瓦等、若以草莛打著他者，隨其所有手指多少，及以芥子草莛數量，還得爾許波逸底迦。",
        "translation": "When it's called beating, if someone snaps with their fingers, stepping with their feet and toes, kicking with a piece of dirt or tile, or hitting someone else with a blade of grass, they'll get back that amount of pāyattika according to how many fingers they have, as well as the number of blades of grass made of mustard seeds.",
        "source": "T24n1458_011:0590b16_0"
    },
    {
        "source_sentence": "若不著者，亦得爾許惡作之罪。",
        "translation": "If someone isn't attached, they'll also be guilty of such a misdeed.",
        "source": "T24n1458_011:0590b18_1"
    },
    {
        "source_sentence": "若殺心而打，得窣吐羅。",
        "translation": "If he kills it with his mind and beats it, he'll attain utpala.",
        "source": "T24n1458_011:0590b19_2"
    },
    {
        "source_sentence": "言苾芻者，若持戒、若破戒，有苾芻相起苾芻想、或復生疑，皆得墮罪。",
        "translation": "When it comes to a monk, whether he observes the precepts or breaks them, if there are monks who give rise to the perception of a monk or have doubts again, they'll all fall into sin.",
        "source": "T24n1458_011:0590b20_0"
    },
    {
        "source_sentence": "若非苾芻作苾芻想疑，或於柱壁、或於餘事作掉亂心而打拍者，咸得惡作。",
        "translation": "If it's not a monk who gives rise to the perception of a monk, or if he disturbs his mind with respect to a pillar wall or other things and beats it, they'll all be badly done.",
        "source": "T24n1458_011:0590b21_1"
    },
    {
        "source_sentence": "無犯者，不以瞋心、為利益事。",
        "translation": "A person who doesn't violate the precepts doesn't do things for the benefit of anger or profit.",
        "source": "T24n1458_011:0590b23_2"
    },
    {
        "source_sentence": "以手擬苾芻學處第四十九",
        "translation": "The Forty-nineth Place of Study for the Formation of a Bhikṣu with His\\/her Hand",
        "source": "T24n1458_011:0590b24_0"
    },
    {
        "source_sentence": "緣與前同，以手擬為異，制斯學處。",
        "translation": "The reasoning is the same as the previous one. It is different from the monastery because it was built by hand, and it is a place of training.",
        "source": "T24n1458_011:0590b25_0"
    },
    {
        "source_sentence": "「若復苾芻，瞋恚故不喜，擬手向苾芻者，波逸底迦。」",
        "translation": "Again, if a monk becomes angry and doesn't rejoice because he intends to point his hand at the monk, pratyekabuddha.",
        "source": "T24n1458_011:0590b26_0"
    },
    {
        "source_sentence": "謂作打心而擬其手，初舉手時，便得本罪。",
        "translation": "It's when someone strikes their mind and prepares their hand, and when they first raise their hand, they'll attain the original sin.",
        "source": "T24n1458_011:0590b28_0"
    },
    {
        "source_sentence": "若一舉手向多苾芻，隨其多少准人得罪。",
        "translation": "If he raises his hand once to many monks, he'll be guilty according to their number of crimes according to the person.",
        "source": "T24n1458_011:0590b28_1"
    },
    {
        "source_sentence": "若與苾芻相瞋恨時，應往詣彼求其懺摩，不應瞋心未歇往求辭謝。",
        "translation": "If you're angry with a monk, you should go to him or her to ask for his repentance, and he or she shouldn't beg for an apology without stopping anger.",
        "source": "T24n1458_011:0590b29_2"
    },
    {
        "source_sentence": "彼亦不得同師子行，為堅鞕心不相容恕。",
        "translation": "They also won't be allowed to act like a lion, which is because their minds are so resolute that they can't forgive each other.",
        "source": "T24n1458_011:0590c02_3"
    },
    {
        "source_sentence": "若不肯忍，應遣智人方便和解，速令諍息。",
        "translation": "If you won't tolerate it, you should send a wise person to reconcile with skillful means and quickly calm the anger.",
        "source": "T24n1458_011:0590c03_4"
    },
    {
        "source_sentence": "小者到彼瞋苾芻邊，至勢分時即應禮拜，彼應云：「無病。」",
        "translation": "The younger one goes to the side of that angry monk and should venerate him at the moment of his arrival, and he should say, There's no illness.",
        "source": "T24n1458_011:0590c04_5"
    },
    {
        "source_sentence": "若見苾芻鬪諍之時，無朋黨心而為揮解。",
        "translation": "If he sees a monk who's engaged in fighting, he doesn't have the mind of friends or factions and is freed by them.",
        "source": "T24n1458_011:0590c05_6"
    },
    {
        "source_sentence": "俗人鬪處不應往看，恐引為證故。",
        "translation": "It's because the secular people who fight shouldn't go to see it, lest they be led to its realization.",
        "source": "T24n1458_011:0590c06_7"
    },
    {
        "source_sentence": "如上所說不順行者，咸得惡作。",
        "translation": "Those who don't follow the above-explained practices will all attain bad actions.",
        "source": "T24n1458_011:0590c07_8"
    },
    {
        "source_sentence": "覆藏他麁罪學處第五十",
        "translation": "The Fifty-fifth Place of Study for the Suppression of the Sins of hiding others' bonds",
        "source": "T24n1458_011:0590c08_0"
    },
    {
        "source_sentence": "佛在室羅伐城給孤獨園，時鄔波難陀犯僧伽伐尸沙罪。",
        "translation": "When the Buddha was staying at Anāthapiṇḍada Park in Śrāvastī, Upananda committed the sin of crimes against Saṃghâvaśeṣa.",
        "source": "T24n1458_011:0590c09_0"
    },
    {
        "source_sentence": "有達摩苾芻見，恐其外說遂作是言：「爾親教師我先知犯，遏惡揚善，曾不語人。",
        "translation": "Seeing this, Bodhidharma Bhikṣu was afraid that he might say something outwardly and said, Your relatives and teachers, I've known the offense before, suppressed evil and promoted goodness, never saying anything to anyone.",
        "source": "T24n1458_011:0590c10_1"
    },
    {
        "source_sentence": "汝見我非，理應藏覆。」",
        "translation": "If you see that I'm not, the principle should be hidden.",
        "source": "T24n1458_011:0590c12_2"
    },
    {
        "source_sentence": "達摩聞已，向諸苾芻說，其事同前。",
        "translation": "After hearing this, Dharma explained it to the monks, who did the same thing as before.",
        "source": "T24n1458_011:0590c12_3"
    },
    {
        "source_sentence": "覆藏煩惱，制斯學處。",
        "translation": "The defilement of hypocrisy and ignorance is the sphere of training.",
        "source": "T24n1458_011:0590c13_4"
    },
    {
        "source_sentence": "「若復苾芻，知他苾芻有麁惡罪覆藏者，波逸底迦。」",
        "translation": "Again, if a monk knows that another monk has a crude and bad sin to hide, pratyekabuddha.",
        "source": "T24n1458_011:0590c14_0"
    },
    {
        "source_sentence": "知者，謂自見知、或因他說。",
        "translation": "“Knowing”: Knowing by oneself or because of someone else.",
        "source": "T24n1458_011:0590c16_0"
    },
    {
        "source_sentence": "言苾芻者，若持戒、若破戒、有苾芻相，皆曰苾芻。",
        "translation": "A monk refers to someone who observes the precepts, breaks the precepts, or has the characteristics of a monk, and they're all called a monk.",
        "source": "T24n1458_011:0590c16_1"
    },
    {
        "source_sentence": "言麁罪者，謂初二部及此方便。",
        "translation": "The sin of sexual misconduct refers to the first two divisions and this method.",
        "source": "T24n1458_011:0590c17_2"
    },
    {
        "source_sentence": "覆藏即是掩覆其過。",
        "translation": "To cover it up is to cover its faults.",
        "source": "T24n1458_011:0590c18_3"
    },
    {
        "source_sentence": "此中犯者，若見聞作覆藏心，至明相出，便得墮罪。",
        "translation": "If someone here commits this offense, then they'll fall into a sin if they see and hear the mind that creates covering and concealment until their appearance emerges in the morning.",
        "source": "T24n1458_011:0590c18_4"
    },
    {
        "source_sentence": "自餘諸犯覆皆惡作。",
        "translation": "The rest of the offenses themselves are covered by bad actions.",
        "source": "T24n1458_011:0590c19_5"
    },
    {
        "source_sentence": "破戒人邊設令發露，不成發露，境想准知。",
        "translation": "If someone who breaks the precepts allows them to be revealed at the side of someone who breaks the precepts, they won't reveal them, and their objects and perceptions are accurately known.",
        "source": "T24n1458_011:0590c20_6"
    },
    {
        "source_sentence": "無犯者，若說他時令自不安，若命梵難、若破僧因緣，為護此故，覆皆無犯。",
        "translation": "A person who doesn't violate the precepts will not violate them if he tells others to make himself uneasy, or if he causes a religious difficulty or disrupts the causes and conditions of the saṃgha in order to protect it.",
        "source": "T24n1458_011:0590c21_7"
    },
    {
        "source_sentence": "　伴惱觸火浴，　　同眠法非障，",
        "translation": "To be accompanied by torment, touching fire and bathing is not an obstruction if you share the same dormancy.",
        "source": "T24n1458_011:0590c23_0"
    },
    {
        "source_sentence": "　未捨求寂染，　　收寶極炎時。",
        "translation": "They haven't yet abandoned the defilement of seeking quiescence, and it's extremely hot to gather treasure.",
        "source": "T24n1458_011:0590c23_0"
    },
    {
        "source_sentence": "第六攝頌曰：共至俗家不與食學處第五十一佛在室羅伐城，時鄔波難陀與達摩苾芻先有嫌惡，便以美言誘說，將至俗家，遂不與食，令彼飢乏，其事同前。",
        "translation": "When the fifty-first buddha was staying in Śrāvastī, Upananda and Dharma Bhikṣu had previously been at odds with each other. So he enticed [the bhikṣu] by means of flattering words to tell them how to go to a layman’s home but they did not give him food so as to make him hungry and starving.",
        "source": "T24n1458_011:0590c23_0"
    },
    {
        "source_sentence": "由不忍煩惱，制斯學處。",
        "translation": "Because they cannot tolerate the defilements, they are disciplined in these places of training.",
        "source": "T24n1458_011:0590c29_1"
    },
    {
        "source_sentence": "「若復苾芻，語餘苾芻，作如是語：『具壽！",
        "translation": "Again, if a monk says to another monk, 'Suppose another monk says this, 'Gushou!",
        "source": "T24n1458_011:0591a02_0"
    },
    {
        "source_sentence": "共汝詣俗家，當與汝美好飲食，令得飽滿。』",
        "translation": "Together with you, I'll go to a layman's home and give you good food and drink so you can be satisfied.'",
        "source": "T24n1458_011:0591a02_1"
    },
    {
        "source_sentence": "彼苾芻至俗家竟不與食，語言：『具壽！",
        "translation": "That monk went to a layman's house and didn't give food, saying, 'Gushou!",
        "source": "T24n1458_011:0591a03_2"
    },
    {
        "source_sentence": "汝去，我與汝共坐共語不樂，我獨坐獨語樂。』",
        "translation": "Go away; I won't be happy to sit with you and talk together, but I'll be happy to sit alone and talk alone.'",
        "source": "T24n1458_011:0591a04_3"
    },
    {
        "source_sentence": "作是語時，欲令生惱者，波逸底迦。」",
        "translation": "When he says this, he wants to cause anger to arise, pratyekabuddha.",
        "source": "T24n1458_011:0591a05_4"
    },
    {
        "source_sentence": "言俗家者，謂婆羅門及餘俗家。",
        "translation": "A layman's house refers to a brāhmaṇa and other laymen's houses.",
        "source": "T24n1458_011:0591a07_0"
    },
    {
        "source_sentence": "言令得飽滿者，意欲不與飲食令受飢餓。",
        "translation": "When it's said to cause them to be satisfied, the intention is not to give food and drink so that they'll suffer hunger.",
        "source": "T24n1458_011:0591a07_1"
    },
    {
        "source_sentence": "此中犯者，有苾芻相作苾芻想，為惱亂心，他領解時，便得墮罪。",
        "translation": "Here, an offense is committed when a monk gives rise to the perception of a monk as a monk and becomes disturbed, and when another person understands it, they'll be condemned.",
        "source": "T24n1458_011:0591a08_2"
    },
    {
        "source_sentence": "若惱授學人及以餘人，得惡作罪。",
        "translation": "If someone disturbs a trainee or any other person, they'll be guilty of misdeeds.",
        "source": "T24n1458_011:0591a10_3"
    },
    {
        "source_sentence": "若在尼寺、若天廟處、若外道家而惱亂者，皆惡作罪。",
        "translation": "If someone disturbs a nun's temple, a heavenly shrine, or a non-Buddhist home, they'll all commit a bad offense.",
        "source": "T24n1458_011:0591a10_4"
    },
    {
        "source_sentence": "若隨醫教為病令斷食者，無犯。",
        "translation": "If he follows the doctor's instruction to cut off food for illness, it's not a violation.",
        "source": "T24n1458_011:0591a12_5"
    },
    {
        "source_sentence": "觸火學處第五十二",
        "translation": "fifty-second place of training in touching fire",
        "source": "T24n1458_011:0591a13_0"
    },
    {
        "source_sentence": "佛在王舍城，因火燒樹熏出黑蛇，諸苾芻見皆悉馳走、或以火頭而遙打擲。",
        "translation": "When the Buddha was in Rājagṛha, a black snake emerged from a tree that was burned by fire and smoked out of it. Seeing this, all the monks fled away, or they were tossed far away with the tip of the fire.",
        "source": "T24n1458_011:0591a14_0"
    },
    {
        "source_sentence": "因用火事不寂靜煩惱，制斯學處。",
        "translation": "Because the afflictions of using fire and not quiescent defilements are restrained, they regulate this place of training.",
        "source": "T24n1458_011:0591a15_1"
    },
    {
        "source_sentence": "「若復苾芻，無病為身，若自然火、若教他然者，波逸底迦。」",
        "translation": "If another monk doesn't have illness as his body, and if he naturally burns it or teaches others to do so, pratyekabuddha.",
        "source": "T24n1458_011:0591a17_0"
    },
    {
        "source_sentence": "言無病者，若有病緣觸亦非犯。",
        "translation": "When it's said to be without illness, it's not a violation if there are illnesses that cause contact.",
        "source": "T24n1458_011:0591a19_0"
    },
    {
        "source_sentence": "言為身者，非為他也。",
        "translation": "When it's called body, it's not for others.",
        "source": "T24n1458_011:0591a19_1"
    },
    {
        "source_sentence": "言自然者，若吹令發焰、若翻轉火薪。",
        "translation": "When it's called natural, it's blown and made to give rise to a flame or firewood that turns around.",
        "source": "T24n1458_011:0591a20_2"
    },
    {
        "source_sentence": "若教他然者，謂令他然火。",
        "translation": "If someone teaches others to make it happen, they'll cause others to make the fire go away.",
        "source": "T24n1458_011:0591a21_0"
    },
    {
        "source_sentence": "若為戲謔掉弄火頭、若作半月像、若作車輪形，凡諸觸火不在時中，若然若滅、若忘念、若掉舉、若氣吹、若投薪、若動柴炭，纔動轉時皆得墮罪。",
        "translation": "If someone plays around with the fire head, makes a half-moon image, or takes the form of a chariot wheel, and touches it while it's not there, then they'll fall into sin if it goes away, forgets, moves, blows air, throws firewood, or moves charcoal, but only when it moves.",
        "source": "T24n1458_011:0591a21_1"
    },
    {
        "source_sentence": "若不解方言人、若遣書等、若現身相使然火時，咸得惡作。",
        "translation": "If someone doesn't understand the words, sends a letter, and so forth, or manifests their physical appearance to cause it to burn, they'll all be badly done.",
        "source": "T24n1458_011:0591a24_2"
    },
    {
        "source_sentence": "若翻覆糠[(麥-大+十)*弋]火、或可於中燒餅而食。",
        "translation": "If he covers the chaff [(wheat-da+10)*yi] fire, or if he can burn cakes and eat them in it.",
        "source": "T24n1458_011:0591a26_3"
    },
    {
        "source_sentence": "雖在時內無心守持、若髮毛爪骨洟唾血等置火中者，咸得惡作。",
        "translation": "Even though there's no mind inside when it's present, if hair, nails, bones, abscesses, spittle, blood, and so forth are placed in the fire, they'll all get bad actions.",
        "source": "T24n1458_011:0591a27_0"
    },
    {
        "source_sentence": "無犯者，謂在時中作心守持。",
        "translation": "A person who doesn't violate the precepts means that they are maintained in mind at the time.",
        "source": "T24n1458_011:0591a28_1"
    },
    {
        "source_sentence": "言時者，謂為三寶、鄔波馱耶、阿遮利耶、若為諸餘同淨行者，所有事業、或時為己熏鉢染衣熟諸飲食、或寒或病所有營為，作心守持，乃至事訖中間忘念，觸時無犯。",
        "translation": "It's not a violation when he does anything for the sake of the Three Treasures, Upāsaka, Acala, or any other fellow practitioner who practices together with purity, or when he performs tasks, or when he perfumes his bowl, dyes his robes, cooks food and drink, or prepares preparations for cold or illness, makes effort to maintain them in his mind, or even forgets them midway",
        "source": "T24n1458_011:0591a29_2"
    },
    {
        "source_sentence": "言守持心者，若欲觸火應心念云：「我今為作如是事故須觸此火。」",
        "translation": "When someone says they guard their mind, if they want to touch the fire, they should mentally think, Now, for such a purpose, I need to touch this fire.",
        "source": "T24n1458_011:0591b03_3"
    },
    {
        "source_sentence": "及為同梵行者。",
        "translation": "They're the same as religious practitioners.",
        "source": "T24n1458_011:0591b05_4"
    },
    {
        "source_sentence": "若欲滅時，應云：「為無事故須滅。」",
        "translation": "When they want to cease, they should say, There's nothing that needs to be ceased.",
        "source": "T24n1458_011:0591b05_5"
    },
    {
        "source_sentence": "若觸師子等得惡作罪。",
        "translation": "If someone touches a lion or so forth, they'll be guilty of misdeeds.",
        "source": "T24n1458_011:0591b06_6"
    },
    {
        "source_sentence": "作觸火想有其六句，後二無犯。",
        "translation": "There are six sentences that create the perception of touching fire, and the last two are not offenses.",
        "source": "T24n1458_011:0591b06_7"
    },
    {
        "source_sentence": "若放野火，得窣吐羅罪。",
        "translation": "If he releases a wildfire, he'll be guilty of the sin of utpala.",
        "source": "T24n1458_011:0591b07_8"
    },
    {
        "source_sentence": "亦不應於石炭地上輒爾然火，應將甎石厚布方燒。",
        "translation": "Nor should it be so lightly burned on the ground of a charcoal; it should be covered thickly with bricks and stones before it is burned.",
        "source": "T24n1458_011:0591b08_9"
    },
    {
        "source_sentence": "若於廊廡及寺中庭然火之時，勿令熏屋，待煙盡已方持入屋。",
        "translation": "If there's a fire in the corridor or temple courtyard, don't allow it to smoke the house; wait until the smoke has gone out and then carry it into the house.",
        "source": "T24n1458_011:0591b09_10"
    },
    {
        "source_sentence": "若營作人所須之木，不應輒燒。",
        "translation": "If you want to make the wood that people need, you shouldn't burn it lightly.",
        "source": "T24n1458_011:0591b10_11"
    },
    {
        "source_sentence": "若輕損時，得惡作罪。",
        "translation": "If someone is despised, they'll be guilty of misdeeds.",
        "source": "T24n1458_011:0591b11_12"
    },
    {
        "source_sentence": "為翻火聚應作鐵鍤，夜誦經時應炳燈燭，所須燈樹應作一重。",
        "translation": "To reverse the fire cluster, an iron bowl should be made; when reciting a sutra at night, a lamp or candle should be lit to illuminate it. The lamps and trees that are needed should be made one-by-one.",
        "source": "T24n1458_011:0591b12_13"
    },
    {
        "source_sentence": "若是僧物，聽作多重。",
        "translation": "If these are the property of the saṃgha, they'll be made into many pieces.",
        "source": "T24n1458_011:0591b13_14"
    },
    {
        "source_sentence": "◎根本薩婆多部律攝卷第十一",
        "translation": "Mūlasarvâstivāda-vinaya, Volume 11",
        "source": "T24n1458_011:0591b14_15"
    }
]